{
  "title": "10 years later, there’s still nothing like Journey’s multiplayer",
  "url": "https://www.theverge.com/2022/3/13/22972989/journey-10-year-anniversary-multiplayer-jenova-chen-austin-wintory",
  "date": "2022-03-13T16:35:44.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zArGjHKwtJ55QVcy-dRdKWtLKOk=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70616254/IMG_1885.0.jpeg\" />        <figcaption><em>The game’s multiplayer still has an effect on me.</em> | Screenshot by Jay Peters / The Verge</figcaption>    </figure>  <p>Journey turns 10 today</p> <p class=\"p--has-dropcap\" id=\"24x9Qq\">I’ll never forget the first time I played <em>Journey</em>.</p><p id=\"x3beM8\">Throughout the game, real-life players can join you on your quest toward a mountain on the horizon. Players can fade in and out of your adventure — maybe they want to go faster than you, maybe they just quit — but in the latter half of my game, I had found somebody who stuck with me. <em>Journey</em> has no voice or text chat and no names identifying other players you meet. The only way we could communicate was through our movements, sticking close together to refill each other’s energy, and singsong chirps. Despite those limitations, we built a rapport.</p><p id=\"GY11CX\">Near the end of <em>Journey</em>, you have to scale the mountain, and as you approach the peak, you get caught in a storm. Much of the game is filled with sunlight, flight, and joyful music, but the mountain is gray, winds buffet your character, and the music is, at times, uncomfortable. Even though the level was draining, I was happy that I had my companion, and we huddled together as we marched toward the peak.</p><p id=\"oAD4ti\">Eventually, the music fades out, and you can only hear your footsteps trudging ever more slowly through the elements. Then, as the game grew silent, my friend collapsed into the snow. I actually cried out in dismay. Then my character fell over, too, and the screen faded to white. </p><p id=\"GUpxcG\">In many video games, you die a lot. That was the only time a virtual death has made me feel like I had actually lost a friend.</p><p id=\"xKThXR\">Fortunately, that’s not actually the end. In a cutscene, I was revived soon after I fell, and then, in an exuberant celebration of color and music that’s perhaps my favorite video game “level” of all time, soared toward the top of the mountain — with my once-fallen friend flying alongside me.</p><hr class=\"p-entry-hr\" id=\"VA09lq\"><p id=\"s3SmsW\"><em>Journey</em> turns 10 years old today, March 13th, and I still haven’t experienced anything like that moment. To mark the anniversary and learn more about the game’s bond-forging multiplayer, I spoke with Jenova Chen, president and creative director of <em>Journey</em> developer thatgamecompany. While it may feel like the game is effortlessly pairing you with companions as you go along, based on what he told me, it wasn’t quite that simple.</p><p id=\"5PFWHG\">The goal for <em>Journey</em> was to “innovate how it feels between people on the internet,” Chen said. “Can we invent the right environment, the right feedback, to bring out something that we’re more proud of? And to have an online game where people feel friendly and compassionate towards each other?” He elaborated further later in our conversation. “We want to see two people going through the journey together, [like when] in our life, we meet someone special, and we travel with them, and eventually, we might depart from each other.” </p><div class=\"c-float-right c-float-hang\"><aside id=\"Gt42db\"><q>“Human beings, unfortunately, are giant babies”</q></aside></div><p id=\"hg7ib5\">While it was a profound ideal, “the reality is: human beings, unfortunately, are giant babies in the virtual world,” Chen said. “No matter how old you are, even if you’re in your 70s, if we move you from Earth and into a virtual space, [that person] would become a giant baby. A baby doesn’t know what is a good moral value versus what is a bad moral value. The baby only knows: if I’m in a new environment, I’m going to try to push the buttons and see what kind of feedback I can get, and babies are great at looking for maximum feedback.”</p><p id=\"kiANXc\">To encourage compassion, the team tested a lot of ideas. They tried a system inspired by <em>Gears of War</em> that let you help out an incapacitated friend but found that even in playtests among the developers, the player would rather not help the other person out. “That way, they create a lot of anxiety in the other player and make the other player more angry. And they actually get more gratification out of the feedback,” Chen said.</p><p id=\"Uhmvtp\">They also tested a mechanic where one person could push the other high up, and then that person would pull the first. “But once we gave this physics simulation to the players, they chose to push each other off the wall and see them fall from the cliff and die, waiting to be helped,” Chen said.</p><p id=\"TlkE6j\">During those tests, people would say, “I would rather play this game alone. Why do you force me to play with this other person? I hate them,” according to Chen. That’s because “killing is much bigger feedback than just helping the other person to get on a ledge,” Chen said. </p><div class=\"c-float-left c-float-hang\"><aside id=\"UtF5Bj\"><q>“At the time, I was like, ‘Is humanity at its core just dark?’”</q></aside></div><p id=\"teZsG3\">The challenges of making those mechanics work affected Chen. “At the time, I was like, ‘Is humanity at its core just dark?’” he said. But a child psychologist helped Chen see things in terms of the way babies view feedback. “If you don’t want babies to do something terrible, give them zero feedback,” he recalled learning from her. “Don’t give them negative feedback because they will misinterpret that as positive feedback.” </p><p id=\"BAzGip\">That led to a change that would have a huge effect on the game: when you got close to someone, you’d recharge their energy. (In the final game, you use your energy to fly.) “And so that makes people feel like ‘Oh, I love to stay near someone because I don’t have to run to find the energy,’” he said. “So they end up sticking together, and they travel together, and they form a companionship. That was just one simple change. From assholes who want to kill each other and dancing around their corpse, creating hatred, to ‘hey, they’re all lovey-dovey, they’re helping each other, and they couldn’t leave each other.’”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2PGzcn4-zOUWB6A9aeRLpDkSBfU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307114/IMG_1886.jpeg\">      <cite>Screenshot by Jay Peters / The Verge</cite>      <figcaption><em>A friend and I hanging out on our quest.</em></figcaption>  </figure></div><p id=\"gCSmRr\">The team also had to experiment to land on the musical chirps that players can use to communicate with each other. They tried a “thumbs up and thumbs down idea” where you could push the thumbstick up to show a green ping and push it down to show a red ping. But in testing, the majority of pings were red as players spammed them to bug their partner to do what they wanted, which created feelings of stress.</p><p id=\"yEyHQg\">“Eventually, we realized it’s better just to keep it neutral,” Chen said. “And then we let the frequency and the amplitude [of the ping] be interpreted by the other player. But we noticed that when we don’t add context, people usually interpret the other person’s intention positively. I think that’s deep down our human nature.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"BnStlW\"><q>The chirp is like a musical instrument</q></aside></div><p id=\"7iNO0K\">Even though the chirp is intended to be neutral, it’s not a static noise. It’s almost like a musical instrument, and its sound evolves throughout the game, <em>Journey</em> composer Austin Wintory told me. “At the very beginning of the game, it’s very bird-like, and there’s flute and little bits of cello,” he said. But over the course of the game, you’ll hear more of a human voice within that sound. “So by the time you’re in the clouds and the very big finale, especially if you do one of the big charged up [pings], you can really hear there’s a human voice in there.” (The human voice used in the pings is Lisbeth Scott, who sings <em>Journey’s</em> end credits.)</p><hr class=\"p-entry-hr\" id=\"iUojHl\"><p id=\"gVuU4j\">The humanity in the design of <em>Journey</em>, from the human voice in the chirps to the multiplayer design that encourages cooperation, is so much of what makes the game memorable for me. As I climbed the mountain with my companion the first time I played the game, I realize now that while I may have been huddled close to my friend to try and share my energy, deep down, I just wanted to do everything I could to help them get up that mountain — and I knew they were doing the same for me.</p><p id=\"SHRvBl\">Ahead of talking to Chen and Wintory, I replayed <em>Journey</em> for the first time since it came out. Despite how much I love the game, I’ve always worried another run would change how I feel about it. I was so fearful of how it might contort my memories that I was actively procrastinating on playing it. </p><p id=\"HIyiIA\">To my surprise, the experience was just as powerful. Ten years on, there are still people playing <em>Journey</em>, and I met four other companions who were part of my adventure. I even made a new friend who stuck by my side through the snowy climb to the mountain’s summit — and through the joyful flight to the peak.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/J8W3n5EE62C8Y7URJaRghJ2zzzw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307148/IMG_1890.jpeg\">      <cite>Screenshot by Jay Peters / The Verge</cite>      <figcaption><em>My companion and I walking together at the very end of the game.</em></figcaption>  </figure></div><p id=\"7VF7tP\">Journey<em> is available on PS3, PS4, PS5, PC, and iOS. Composer Austin Wintory has also just released a re-orchestration of the </em>Journey<em> soundtrack performed by the London Symphony Orchestra titled </em><a href=\"https://austinwintory.bandcamp.com/album/traveler-a-journey-symphony\"><em>“Traveler — A Journey Symphony.”</em></a> <em>I’ve listened to it and thought it was very good.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rjxHoYElB1-VD6MMpWAylObbxHc=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307103/IMG_1885.jpeg",
  "description": "Jenova Chen told us about the development of the game.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}