{
  "title": "1Password 8 for Mac brings autofilling passwords to native apps",
  "url": "https://www.theverge.com/2022/5/3/23055212/1password-8-mac-password-manager-security",
  "date": "2022-05-03T17:51:20.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/o67YyjHO5_-AKUaLfbYAWtExzl0=/0x17:2200x1484/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70827874/1pass8.0.png\" />    </figure>  <p id=\"mvIfcl\">1Password 8 for Mac came out of beta and <a href=\"https://blog.1password.com/1password-8-for-mac/\">into public release</a> on Tuesday, bringing a more modern redesign and a number of new features to the popular password manager. But there’s one thing about the app that might be a game-changer for Mac users: a new Universal Autofill feature that means you can automatically enter passwords into apps the same as you can in browser tabs.</p><p id=\"oYH5Ri\">Previously, like with most password managers, everything was seamless enough in the browser: load the webpage, click the icon, and it fills your password. But if you’re in a native app, you have to open your password manager, search for the account, and copy and paste your info into the app. With Universal Autofill, which 1Password assigns to a global ⌘\\ keyboard shortcut, you can open a new overlaid menu that will fill passwords in apps just like you’d expect. (1Password 8 has been <a href=\"https://www.theverge.com/2021/11/16/22784996/1password-version-8-windows-release-download-features\">out for Windows for months</a> but doesn’t have a feature like Universal Autofill.) In my brief testing, it works well, and it’s impressively fast especially if you also have Touch ID turned on.</p><p id=\"NgQyrg\">This new version has been a long-time coming. 1Password 8 has been <a href=\"https://www.theverge.com/2021/8/11/22619846/1password-8-macos-early-access-password-manager-app\">in public beta for months</a> — the company said 40,000 people have been testing it — and the company has promised it would fix practically everything that ailed previous versions: a strange <a href=\"https://www.reddit.com/r/1Password/comments/jt2zei/1password_taking_12gb_of_ram_and_11k_ports/\">Chrome memory bug</a>, the app’s occasional slowness and confusing interface, everything. I’ve been one of those beta testers for the last few months, and it is in fact a massively better experience — fewer instances of 1Password taking forever to load or not loading at all, fewer memory-hog problems, and an interface that belongs in this decade. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PUCNA2UPLfJ0qaGQEKnsVLf6noc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23435385/universal_autofill_zoom.gif\">      <cite>Image: 1Password</cite>      <figcaption><em>Universal Autofill works outside the browser, finally.</em></figcaption>  </figure><p id=\"MQM32X\">But features like Universal Autofill are really what make or break password managers. Because even though it’s an unequivocal, no-question, easy-choice good idea to use a password manager, most people don’t. Password managers are a pain! On iOS and Android, where typing your long hexadecimal password is a hassle, password managers are an easy win, and both OSes have done a good job turning them into a two-tap process. On desktop, though, it’s both easier to type and more annoying to hunt through your password manager. 1Password is trying to solve that <em>and</em> give you even fewer reasons not to use it.</p><p id=\"jCU2pL\">Universal Autofill is also one of those features that 1Password could use for many more things. The service has been branching out from “password manager” to “important-info-of-all-kinds manager” that also <a href=\"https://www.theverge.com/2022/2/23/22947693/1password-cryptocurrency-wallet-storage-password-manager-security\">stores your crypto wallets</a>, <a href=\"https://www.theverge.com/2021/9/28/22698013/1password-hide-my-email-feature-fastmail-integration\">hides your email</a>, and more. A feature like Universal Autofill could train users to use 1Password more and eventually use it to store more stuff.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7MTjZAupZFWeQSYsQhXWA4J8ZQk=/0x174:2200x1326/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23435365/1pass8.png",
  "description": "A new keyboard shortcut to remember.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}