{
  "title": "1Password syncing went down for a few hours today during a database upgrade",
  "url": "https://www.theverge.com/2022/4/27/23045469/1password-outage-password-manager-security-cloud-storage",
  "date": "2022-04-27T23:04:17.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/K7Lu0i1XNPUfxITe8-rEIAH6RUM=/0x22:1300x889/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70802362/1password2.0.jpg\" />        <figcaption>1Password</figcaption>    </figure>  <p id=\"n2eoVl\">Whenever we talk about password managers, especially ones that sync their data to the cloud, there’s always discussion about whether or not your information is secure and what happens if the servers go down. The second thing is exactly <a href=\"https://www.reddit.com/r/1Password/comments/ud0fon/anyone_having_issues_logging_in/?sort=new\">what 1Password users in the US experienced earlier today</a>, as a problem affecting 1Password.com kept mobile, desktop, and browser clients from syncing.</p><p id=\"82StnE\">A <a href=\"https://1password.statuspage.io/incidents/4dkxnp84p27p\">status page</a> first noted the problem at 10:42AM ET and listed it as stabilized, with clients able to connect again by 2:42PM ET. During the outage, the status page noted that the issue didn’t affect any offline data stored in clients, and other domains like 1password.ca, 1password.eu, or ent.1password.com were operational. </p><p id=\"pMoADP\">Before I knew there was an outage, I saw it on my own account when I tried to save a password, and it simply would not do it. All of my local clients still had all of my current passwords, so I think most people didn’t even notice it was down. However, if you don’t store your passwords on a local device or had lost access to it during the outage, there could have been a real problem.</p><div><div id=\"e4ress\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re now operational.  <br><br>Earlier today, 1Password experienced a brief service outage – this was not a security incident and your data remains safe. We’ve stabilized the system while we investigate further.<br><br>A huge thank you for your patience.</p>— 1Password (@1Password) <a href=\"https://twitter.com/1Password/status/1519411117294075907?ref_src=twsrc%5Etfw\">April 27, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"B7KirI\">In a statement provided to <em>The Verge</em>, 1Password CTO Pedro Canahuati said:</p><blockquote><p id=\"vHzfmZ\">Earlier today, 1Password experienced a brief service outage due to our planned database upgrade. This was not a security incident, and customer data was not affected in any way.</p><p id=\"kOs5as\">The 1Password.com service was down during this outage and that affected new user signups and syncing new data across devices. Our system is designed to ensure any stored passwords are always safe and accessible locally on their devices.</p><p id=\"7ypKOP\">At this time, we have stabilized the system while we investigate the performance regression. Customers’ devices should be syncing all new data and sign-ups are working.</p><p id=\"kg4jVW\">We’re taking steps to avoid similar disruptions in the future, and will be providing updates on our status page and social media channels, as well as our blog over the next day or two.</p></blockquote><p id=\"uh6Hjh\">Anyone who uses a password manager that stores data in the cloud does have some risk of this happening to them, but it doesn’t seem to have been very disruptive. On the other hand, cloud storage makes keeping tons of logins accessible from every device you use easier and enables features <a href=\"https://www.theverge.com/2017/5/23/15681990/1password-travel-mode-feature-added-security\">like the Travel Mode</a> that wipes out data stored on your device if you’re in a situation where it may be confiscated or searched. Still, given the fact that the new 1Password 8 client will only sync with the cloud and doesn’t give the option of sticking exclusively to local storage, it’s something to be aware of. For customers who prefer local storage, <a href=\"https://1password.community/discussion/comment/602340/#Comment_602340\">1Password has said they can continue using 1Password 7.</a></p><aside id=\"TZftGV\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The best free password manager\",\"url\":\"https://www.theverge.com/22311182/best-free-password-manager-bitwarden-zoho-vault-roboform-sticky-password\"},{\"title\":\"How to use a password manager (and why you really should) \",\"url\":\"https://www.theverge.com/2017/7/24/15921282/best-password-manager-1password-lastpass-dashlane-how-to\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/zTTrliSX3BtVtu1U7cmuEdHjnBo=/0x115:1300x796/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387913/1password2.jpg",
  "description": "The password manager still (mostly) worked while offline",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}