{
  "title": "1Password now lets you easily store crypto wallet details",
  "url": "https://www.theverge.com/2022/2/23/22947693/1password-cryptocurrency-wallet-storage-password-manager-security",
  "date": "2022-02-23T21:03:24.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/v1jtMu5vaRChnmTqNspcpRXsvLA=/85x0:1215x753/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70542333/1password_phantom_wallet_update.0.png\" />        <figcaption><em>1Password can now store details attached to your Phantom wallet.</em> | Image: 1Password</figcaption>    </figure>  <p id=\"1VLbDO\"><a href=\"https://blog.1password.com/phantom-crypto-wallet-1password/\">A 1Password update</a> brings a specific item type dedicated to crypto and digital assets to the password manager’s interface. This could make it easier to store details attached to your cryptocurrency wallet, although it’s usually best to store your wallet’s information offline.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GYKa2pB-5bshZImzOtAb41SNOsk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23266126/1password_crypto_wallet_example.png\">      <cite>Image: 1Password</cite>      <figcaption><em>1Password now has dedicated fields for information related to crypto wallets.</em></figcaption>  </figure><p id=\"Khbc4G\">The update brings a “Crypto Wallet” item — or a blank, easy-to-fill-in format — to the password manager. It comes with fields specific to the kind of information you’ll need to input, like your wallet address and recovery phrase.</p><p id=\"CFX5nN\">While you could previously store crypto-related information in 1Password, the process wasn’t always that straightforward, as it required you to repurpose existing fields. For example, as detailed in a <a href=\"https://blog.1password.com/how-to-use-1password-to-manage-cryptocurrency/#exchange-accounts\">how-to on 1Password’s website</a>, the company suggests modifying and adding fields within the “Login” item to make them suitable for your crypto wallet’s information, such as adding a separate section for your private key. When using the Crypto Wallet item, you shouldn't have to toy around as much with new sections since they’re already formatted for the basic information you need to store.</p><p id=\"ZCw3Yk\">1Password’s update also adds support for <a href=\"https://phantom.app/\">Phantom’s crypto wallet</a>, which carries Solana-based tokens and NFTs. If you create a Phantom wallet and you have a subscription to 1Password, you’ll get prompted to tie your Phantom wallet password, wallet address, and secret recovery phrase to the password manager.</p><p id=\"jLjDwU\">Generally, experts advise that your seed phrase (the master key that unlocks your wallet), should never be stored on an internet-connected device — not even in a password manager — due to potential security risks; they recommend securely storing it in a physical location. But you could also argue that storing your seed phrase in a password manager is still safer than what some people who are new to crypto might do, like screenshot it or save it in an online document. Storing information in a password manager might also be more convenient for people who hold only a small amount of crypto and have a lot less to lose.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jaW0jjJzuJWOO9yW7ckyx8FVJjs=/0x37:1300x718/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23266020/1password_phantom_wallet_update.jpeg",
  "description": "It’s also partnering with the Phantom crypto wallet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}