{
  "title": "2024 Volkswagen ID Buzz electric microbus revealed: less flower, more power",
  "url": "https://www.theverge.com/2022/3/9/22967468/volkswagen-id-buzz-electric-microbus-photos-specs",
  "date": "2022-03-09T18:20:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/juCdQLndhL0S608ZcT8XCmBjAxM=/0x47:1900x1314/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70600106/alopez_220304_4996_0007.0.jpg\" />        <figcaption>Photo by Amanda Lopez for The Verge</figcaption>    </figure>  <p>VW resurrects its iconic microbus for an electric era</p> <p class=\"p--has-dropcap p-large-text\" id=\"zhcXhu\">After five years of teases, the long-awaited debut of the Volkswagen ID Buzz is finally here. The German automaker revealed the all-electric van at a virtual event on Wednesday, where it positioned the ID Buzz as a recreation of its iconic Type 2 Microbus — think hippies, flower power, and peace signs — for a more modern era. </p><p id=\"1oufd5\">The ID Buzz and its commercial equivalent, <a href=\"https://www.theverge.com/2018/9/20/17882400/vw-volkswagen-id-buzz-cargo-van-concept-electric\">the ID Buzz Cargo</a>, <a href=\"https://www.theverge.com/2021/3/26/22352748/volkswagen-id-buzz-electric-microbus-us-release-date\">will arrive in Europe later this year</a>, with a longer wheelbase version for US markets scheduled to make its <a href=\"https://www.theverge.com/2022/1/6/22870273/vw-microbus-electric-id-buzz-date-reveal\">debut in 2023 </a>and go on sale here in 2024. </p><div class=\"c-float-right c-float-hang\"><aside id=\"ofep8q\"><q>There’s a lot we still don’t know — mainly the price</q></aside></div><p id=\"zZ8Cgx\">There’s a lot we still don’t know — mainly the price. But the ID Buzz will play a crucial role as VW continues along its transformational path from environmental scofflaw (<a href=\"https://www.theverge.com/2021/3/26/22352646/volkswagen-dieselgate-investigation-damages-winterkorn-audi\">remember Dieselgate?</a>) to EV leader. The van will serve as a showcase for the company’s MEB modular electric architecture, and it will be among the first electric vans marketed specifically with families in mind. </p><p id=\"5ADxiy\">The van has been slightly updated from <a href=\"https://www.theverge.com/2017/1/10/14215476/volkswagen-microbus-concept-id-buzz-emissions-scandal\">the concept form that first captured many people’s imagination back in 2017</a>. The grille is a little bit different, with larger air vents than you might typically expect from an electric vehicle. And the overall shape is boxier, with sharper angles and a taller road stance. </p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/A8KGYUnhZqiZ8qzBTer5NYeiXyM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301460/alopez_220304_4996_0006.jpg\">  </figure></div><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TLmWl1UWm-9UhB8zfDyeSlQpKa0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301462/alopez_220304_4996_0013.jpg\">  </figure></div><p id=\"KODcho\"></p><p id=\"lf3Yk2\">But VW stayed surprisingly true to the original design, even going so far as to offer the same Day-Glo lemon yellow two-tone paint scheme as an option. (VW is offering a total of 11 color variants.)</p><p id=\"Wy4RbY\">The first European version of the ID Buzz will feature a battery pack with 81 kWh of energy capacity, 77 kWh of which is usable. That will power a rear-axle motor capable of putting out 201 horsepower and 229 lb-feet of torque. But let’s face it: this is not an EV destined for the track — in fact, VW is limiting the van’s top speed to just 90 mph (145 km/h). Considering its ancestor could only hit 60 mph (usually while cruising downhill), this shouldn’t be too disappointing to most customers. </p><p id=\"najyUh\">VW isn’t revealing the driving range, but all signs point to around 300 miles on a full charge. The charging power when using alternating current (AC) is 11 kW. At a DC fast-charging station, the ID Buzz’s charging power increases to as much as 170 kW. VW claims the vehicle will charge from 5 to 80 percent in just 30 minutes — or just eight minutes less than <a href=\"https://www.theverge.com/22302883/vw-id4-review-volkswagen-ev-specs-range-photos-video\">the 2021 VW ID 4 SUV</a>. </p><div class=\"c-float-right c-float-hang\"><aside id=\"qW5sr2\"><q>all signs point to around 300 miles on a full charge</q></aside></div><p id=\"GPGvU7\">In the future, VW says the ID Buzz will offer Plug and Charge functionality, the standard that enables an EV to automatically identify and authorize itself to a third-party charging station on behalf of the owner. </p><p id=\"bloTrl\">But the ID Buzz should have adequate charging support, thanks to VW-subsidiary Electrify America, which has more than 670 charging stations across the US, including nearly 2,900 individual DC fast chargers. Like Tesla, VW has skin in the game when it comes to EV charging infrastructure, which will go a long way in luring car owners away from the warm embrace of the combustion engine.</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uRIW3SKbjyjmbWeKCpat0rk_-OM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301464/alopez_220304_4996_0010.jpg\">  </figure></div><p id=\"kt0OKg\">The European version of the van and its commercial equivalent will come with bi-directional charging, in which the vehicle can also be used as a power source for other electrical devices or even a whole home. VW says it envisions the ID Buzz eventually being used to “smooth” the electrical grid during times of peak demand — a <a href=\"https://www.theverge.com/2022/3/8/22965919/gm-pge-ev-charging-grid-home-california\">similar</a> <a href=\"https://www.theverge.com/2021/3/26/22352090/bmw-pge-ev-california-vehicle-grid-charging\">claim</a> made by other major automakers. </p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bhFGuTdN5VdncC6_tIGuJ60SjYs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301529/alopez_220304_4996_0011.jpg\">  </figure></div><p id=\"m4GFhz\">The European ID Buzz won’t be as large as other minivans on the market, with a wheelbase of only 117.6 inches (2,988 mm). The US version will be longer when it goes on sale in 2024, though VW didn’t disclose the size. Overall, the European version is 185.5 inches long, which is partly because its overhangs are so short.</p><p id=\"GgCC1R\">These ultra-short overhangs, or the length of the vehicle that extends beyond its wheelbase, will be one of the defining characteristics of the ID Buzz. For example, the van is about 9 inches longer between axels than the VW ID 4 but only 5 inches longer overall. It stands 76.3 inches (1,937 mm) high, 78.2 inches (1,895 mm) wide at the mirrors, and even the European version has 138 cubic feet of cargo area. That’s more than a Cadillac Escalade, so yeah, it’s big inside. </p><div class=\"c-float-right c-float-hang\"><aside id=\"VtSEQa\"><q>In essence, VW is introducing a brand new form factor to the EV market</q></aside></div><p id=\"9Sq6EQ\">In essence, VW is introducing a brand new form factor to the EV market. The hot hatches have <a href=\"https://www.theverge.com/2022/2/15/22936174/gm-chevy-bolt-production-april\">come</a> and <a href=\"https://www.theverge.com/2021/6/28/22554419/bmw-i3-discontinued-us-electric-hatchback-sales\">gone</a>, and the electric crossovers and compact SUVs are currently <a href=\"https://www.theverge.com/22265570/mustang-mach-e-review-electric-ford-ev-photos-video\">commanding the moment</a>. They’ll soon be replaced by <a href=\"https://www.theverge.com/2022/1/5/22863648/chevy-silverado-electric-truck-specs-price\">the trucks</a> and <a href=\"https://www.theverge.com/2021/4/21/22394483/cadillac-lyriq-electric-suv-price-specs-2022\">the luxury SUVs</a>, which have proven to be American car buyers’ preferred profile. Into this swirling mass of sizes and shapes comes a van, both familiar and entirely unique. Not a minivan — a microbus.  </p><p id=\"buRXwq\">“The original transporter, or the bus, was obviously really loved, for not only its design, which was super iconic and still is to this day, but of course, also for its functionality and its spaciousness,” Jeffrey Lear, product manager for the ID Buzz at VW, told <em>The Verge</em>. “So really nice packaging, super short overhangs, really low center of gravity, and the ID Buzz, thanks to our modular electric drive, is now able to tick off all of those same boxes.”</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HqTUDPnWi9loEeLLzU7onAGjk5E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301466/alopez_220304_4996_0016.jpg\">  </figure></div><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OWx3mZT9jVDVMjPAOmINblVctGY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301469/alopez_220304_4996_0025.jpg\">  </figure></div><p id=\"2JWLcF\">That spaciousness is apparent as soon as you step inside. The standard length ID Buzz will launch with five seats, all of which are adjustable. Front seats can be moved up to 9.6 inches (245 mm) forward and aft, while the three-person bench seat in the rear can be folded down completely or split 40:60, and it can be moved lengthways a total of 5.9 inches (150 mm).</p><p id=\"wGeKV8\">On the standard wheelbase, a six-seat configuration will come later, with individual seats arranged in three rows of two. With the extended wheelbase, a seven-seat configuration will also be available in a 2/3/2 arrangement. The cargo version of the ID Buzz will be even more spacious, with an option for a single front seat and a fixed partition to separate the back storage area. </p><p id=\"yKRf4S\">The cockpit of the ID Buzz is similar to the ID 4, with a 10-inch gauge cluster paired with a 10-inch centrally positioned infotainment system. (A larger 12-inch display is optional.) The vehicle’s software can be updated over the air and will support both Apple CarPlay and Android Auto. </p><div id=\"JoeKtv\"><div data-anthem-component=\"gallery:11085982\"></div></div><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3PGqmgkakovy4L49vIJvEESyFbI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301488/alopez_220304_4996_0019.jpg\">  </figure></div><p id=\"0GnPNu\">VW is really stressing the modularity of the ID Buzz’s interior, with a completely movable and removable center console. This option, which was carried over from the concept version, allows for the center console to turn into a multifunctional box that can be relocated in the middle of the second row of seats. There’s plenty of room inside for a plethora of gadgets, including a laptop, but the tidiness potential is huge. Removing the center console for a thorough cleaning will be a big selling point for families who often have to deal with dangerous levels of cracker crumbs in their car. </p><p id=\"ONB873\">The ID Buzz will be one of VW’s most sustainable vehicles, with a leather-free interior that utilizes recycled materials and a fabric made from 10 percent collected ocean plastic and 90 percent recycled PET bottles. </p><div class=\"c-float-left c-float-hang\"><aside id=\"098odC\"><q>The ID Buzz’s adorable and functional design belies a lot of intelligence going on beneath the surface</q></aside></div><p id=\"CD3IlG\">The ID Buzz’s adorable and functional design belies a lot of intelligence going on beneath the surface. In Europe, <a href=\"https://www.theverge.com/2018/9/20/17882400/vw-volkswagen-id-buzz-cargo-van-concept-electric\">the Buzz Cargo</a> will have sensors and software that VW says will enable autonomous driving capabilities. But a fully autonomous version of the Buzz won’t be available until after the regular one is released. The VW Group, which also owns Audi, Skoda, and Porsche, expects it to be its first autonomous vehicle ever released.</p><p id=\"J5qUSJ\">We’ve actually already been treated to images of the ID Buzz draped in high-tech sensors and hardware in its role as <a href=\"https://www.theverge.com/2021/9/6/22659306/vw-autonomous-id-buzz-reveal-argo-iaa\">an autonomous test vehicle in Germany</a>. VW has said the autonomous microbus will serve as a <a href=\"https://www.theverge.com/2021/5/12/22430813/vw-argo-autonomous-delivery-ride-pooling-germany\">platform for its full-scale commercial ride-hailing and delivery operation</a> that it plans on launching in Germany in 2025.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6u45DoLL8XhzKLVZIQEEa84PznA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301516/alopez_220304_4996_0014.jpg\">  </figure></div><p id=\"2tSCm6\">When it’s released, the ID Buzz will join <a href=\"https://www.theverge.com/2019/9/9/20857217/volkswagen-vw-id3-electric-price-specs-mile-range-frankfurt-motor-show-2019\">the ID 3 hatchback</a>, <a href=\"https://www.theverge.com/22302883/vw-id4-review-volkswagen-ev-specs-range-photos-video\">the ID 4 compact SUV</a>, and <a href=\"https://www.theverge.com/2021/2/19/22291294/vw-id5-ev-electric-suv-coupe-production-volkswagen-2021\">soon-to-be-released ID 5 coupe</a> as the newest member of VW’s fast-growing lineup of electric vehicles. (China will also be getting an elongated ID 6 at some point in the future.) VW’s ID family also includes concept versions of a large SUV (<a href=\"https://jalopnik.com/the-volkswagen-i-d-roomzz-concept-has-room-for-days-an-1834048772\">ID Roomzz</a>) and a dune buggy (<a href=\"https://www.theverge.com/2019/3/7/18254329/volkswagen-id-buggy-electric-concept-car-geneva-motor-show-2019\">ID Buggy</a>). All are being built on Volkswagen’s MEB modular electric vehicle platform.</p><p id=\"hFSAs6\">But none will have to walk the tightrope in the same way as the ID Buzz. “This car has to play a careful role,” product lead Jeffrey Lear said. “It has to balance both sides, right? It needs to be modern and fresh and exciting for folks who may not have even been around during those times,” he said, referring to the Microbus’ original heyday of the 1960s and ’70s. </p><p id=\"J5d9fy\">The cues are still there, from the two-tone paint job to the very prominent VW logo on the grille, Lear noted. Still, it will be a delicate balancing act. “I’d call it like the 80-20 split,” he said, “with 20 percent nostalgia and 80 percent looking ahead.”</p><p class=\"c-end-para\" id=\"udrCGg\">So does that mean we’ll be getting an <a href=\"https://www.theverge.com/2019/9/5/20851784/vw-beetle-electric-conversion-frankfurt-motor-show\">electric VW Beetle</a> next? “ I haven’t seen anything, I haven’t even heard any rumors,” Lear said slyly, “but there’s a range of possibilities with this platform.”</p><p id=\"4xPrCy\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n7Qfuao3oDvebvYLJslOPkMoJ2k=/0x183:1900x1178/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23296294/alopez_220304_4996_0007.jpg",
  "description": "The US version won’t be available until 2024.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}