{
  "title": "A camera battery with a USB-C port is a gadget whose time has come",
  "url": "https://www.theverge.com/2022/4/19/23031768/nitecore-sony-camera-ufz100-battery-usb-c",
  "date": "2022-04-19T14:57:15.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/P7Y2t8j1NwPXDgX9Jn3jBtQceA0=/94x0:1507x942/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70766678/nitecore_ufz_100.0.png\" />        <figcaption><em>Nitecore’s UFZ100 is compatible with an array of Sony cameras.</em> | Image: <a class=\"ql-link\" href=\"https://photo.nitecore.com/product/ufz100\" target=\"_blank\">Nitecore</a></figcaption>    </figure>  <p id=\"0ATq0N\">The <a href=\"https://photo.nitecore.com/product/ufz100\">Nitecore UFZ100 camera battery</a> is here to release photographers from Sony’s proprietary grasp — a built-in USB-C charging port lets you power it up using the same hardware as many of your other devices (via <a href=\"https://gizmodo.com/camera-battery-with-usb-c-charging-port-1848806373\"><em>Gizmodo</em></a>). It hasn't been officially released yet, but you can use the battery with the Sony A7 III, A7R III, A7R IV, A7S III, A9 (ILCE-9), A9 II, A6600, A7C, A1, FX3, and A7 IV, saving you from lugging around a separate charger if you want to bring along (and charge) an extra battery on a shoot.</p><p id=\"avmFTd\">As <em>Gizmodo</em> points out, the battery has a slightly smaller capacity than its proprietary equivalent, with the <a href=\"https://electronics.sony.com/imaging/imaging-accessories/interchangeable-lens-camera-accessories/p/npfz100\">Sony NP-FZ100</a> coming with a 2,280mAh capacity and the Nitecore UFZ100 featuring 2,250mAh. In terms of charging times, Nitecore’s battery appears to fall a bit short as well. If you’re charging Sony’s battery with the $99.99 <a href=\"https://electronics.sony.com/imaging/imaging-accessories/interchangeable-lens-camera-accessories/p/bcqz1\">BC-QZ1 charger</a>, Sony says it should charge fully in about 2.5 hours, while the Nitecore UFZ100 takes four hours to reach a full charge. It’s unclear if the four-hour charging time beats the amount of time it takes to charge Sony’s battery inside the camera using a micro-USB cable and AC adapter, however.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0Fngc9k24kH-4Mur2c7ouM2ZfgA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23400114/nitecore_specs_battery.jpg\">      <cite>Image: <a class=\"ql-link\" href=\"https://photo.nitecore.com/product/ufz100\" target=\"_blank\">Nitecore</a></cite>      <figcaption><em>Nitecore’s UFZ100 battery fully charges in about four hours.</em></figcaption>  </figure><p id=\"gU556h\">Besides the presence of a USB-C connector, the battery itself comes with a power indicator light that flashes red when it’s charging and stays green when it’s fully charged. There’s also a built-in button on the battery, and pressing it will make the indicator light show different colors depending on how much juice the battery currently has: green for over 50 percent, blue for less than 50 percent, and red for less than 10 percent.</p><p id=\"hQKlXK\">That said, we have no idea how reliable the battery really is, let alone how much it costs or its release date. <em>The Verge</em> reached out to Nitecore with a request for comment but didn’t immediately hear back. It does seem a bit like a tradeoff, though — Nitecore’s battery may not last as long or charge as fast, but the USB-C compatibility makes it all the more convenient.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/l17_dH4Sgb4DEBpEUc6G0AhZ5Zc=/0x52:1600x890/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23400000/nitecore_ufz_100.png",
  "description": "This Nitecore battery charges via USB-C.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}