{
  "title": "A cheaper Apple TV could be happening",
  "url": "https://www.theverge.com/2022/5/13/23070852/apple-tv-cheaper-predicted-2h-2022",
  "date": "2022-05-13T17:25:36.000Z",
  "author": "Alex Cranz",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BKwgEFgnwdcpLDsc1DVHmzOeVFo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70866147/DSCF3876_3.0.jpg\" />        <figcaption>Photo by Chris Welch / The Verge</figcaption>    </figure>  <p id=\"udM4BL\">An Apple TV that actually competes with Roku and Amazon could be on the market by the end of the year. According to analyst Ming-Chi Kuo <a href=\"https://twitter.com/mingchikuo/status/1525127349616128000\">in a tweet</a>, Apple would launch a new Apple TV “that improves cost structure” in the second half of 2022.</p><p id=\"sUpzsg\">It’s about damn time.</p><p id=\"ftkMPV\">Currently, Apple sells three Apple TV models. Its 4K Apple TV comes in 32GB and 64GB capacities and retails for $179 and $199, respectively. That’s a good deal for what you get from the 4K Apple TV. Apart from Nvidia’s Shield lineup, no set-top box really has the same support for a wide range of home theater standards and formats that the Apple TV 4K does. It’s the gold standard for professional home theater installers and is particularly praised for its EDID capabilities.</p><aside id=\"lUZXhM\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple TV 4K (2021) review: much better remote, slightly faster box\",\"url\":\"https://www.theverge.com/22454960/apple-tv-4k-2021-review\"}]}'></div></aside><p id=\"8lWYTV\">EDID, or Extended Display Identification Data, basically tells your set-top box, or Blu-Ray player, or other device, what kind of display you’ve plugged it into. Devices that do bad EDID handshakes may try and play HDR content when your TV can’t support it or, worse, think your TV is incapable of HDR and deny you that sweet dynamic range you probably paid for. Roku, Amazon, and a lot of other set-top boxes can be pretty lousy at those handshakes and giving your TV the best quality signal it can handle from any given streaming source. Apple nails it.</p><p id=\"pxz5I6\">But while the more budget-friendly Apple TV HD shares the same crackerjack EDID handling, it lacks all the other goodies that make the 4K a must-buy for home theater nerds. It only supports up to 1080p, and at $149, it’s a terrifically bad buy. Like, you’re better off saving your money kind of bad buy. </p><div class=\"c-float-right\"><aside id=\"bbcU1H\"><q>I genuinely worry for Google’s search algorithm when people google “Apple TV”</q></aside></div><p id=\"SC18cU\">Which is a problem for Apple. The company wants to <a href=\"https://www.theverge.com/2022/5/10/23065290/apple-streaming-advertising-services-peter-stern-eddy-cue\">sell its services to you</a>, including Apple Fitness (which only works on Apple devices) and Apple TV Plus. It’s worked diligently with other set-top box providers and TV makers to get those products on their devices, but that’s really not enough to compete with Roku and Amazon, which each have set-top boxes that start at well under $50 and have most of the same capabilities as the $149 Apple TV HD. </p><aside id=\"e2HIsi\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Eddy Cue reportedly has bigger plans for Apple’s billion-dollar streaming and ads business\",\"url\":\"https://www.theverge.com/2022/5/10/23065290/apple-streaming-advertising-services-peter-stern-eddy-cue\"}]}'></div></aside><p id=\"DMjVE3\">An Apple TV stick that starts at $99 or lower with AirPlay 2 support, that excellent EDID handling, and the ability to tackle Fitness would be much more appealing. That’s closer in price to the sticks offered by Roku and Amazon. It would still be more expensive, but at least it would be under $100. </p><p id=\"eVlTgP\">But any cheaper Apple TV device would still leave me wondering — what the heck is the point of the Apple TV HD then? To just part money from the wallets of people who aren’t paying attention? With its high price and lower resolution output, it doesn’t make a lot of sense as a product at its current price. It could end up getting a price drop to under $100, and a new device with 4K support could take its place in the middle.</p><p id=\"32VBcE\">Kuo’s tweet doesn’t really provide clarity on where this new device would sit in the Apple TV lineup, so it’s anyone’s guess at this point. (If you actually know, feel free to drop us a line at <a href=\"mailto:tips@theverge.com\">tips@theverge.com</a>.) It could even replace the Apple TV HD altogether.</p><p id=\"Jkv0Qf\">Whatever this potential new product ends up being, let’s hope it’s cheaper than the current offerings and that it has a better name. We’ve got Apple TV 4K, Apple TV HD, Apple TV Plus, and the Apple TV Up Next app; if we add Apple TV Stick or whatever to the lineup, I genuinely worry for Google’s search algorithm when people google “Apple TV.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NGbuchQjDMeMEUiGtNzSJm20Lc8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22541101/DSCF3876_3.jpg",
  "description": "Skip the Apple TV HD for now",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}