{
  "title": "A chat with YouTube chief product officer Neal Mohan on new features coming this year",
  "url": "https://www.theverge.com/2022/2/10/22927169/vergecast-podcast-interview-youtube-product-features-2022-nft-metaverse",
  "date": "2022-02-10T15:58:26.000Z",
  "author": "Andrew Marino",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mJNgreSvaRkCaZOGLtkFlIPzyw0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70493063/acastro_181214_3140_youtube.0.0.jpg\" />        <figcaption>Illustrations by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"FtWbNW\">Today on YouTube’s official blog, chief product officer Neal Mohan published “<a href=\"https://blog.youtube/inside-youtube/innovations-for-2022-at-youtube/\">Look at 2022: Community, Collaboration, and Commerce</a><em>,” </em>where he announced new product features coming to YouTube this year. </p><p id=\"RtBxuE\">Neal also joined our podcast <a href=\"http://theverge.com/the-vergecast\"><em>The Vergecast</em></a> with <em>Verge</em> editor-in-chief Nilay Patel and streaming reporter Catie Keck to chat further about these new features coming to YouTube — including more editing tools for Shorts, interactive live streaming, <a href=\"https://www.theverge.com/2022/2/10/22925936/youtube-creators-feature-shopping-live-streaming-gifted-memberships\">monetization</a>, <a href=\"https://www.theverge.com/2022/2/10/22926293/youtube-tv-new-features-picture-in-picture-ios-surround-sound-landscape-mode\">a new YouTube TV interface</a>, and more.</p><div id=\"QFS86w\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP9442356956&amp;light=true\" width=\"100%\"></iframe></div><p id=\"kE8OnD\">Also in the theme of 2022, the discussion also covers this year’s most talked-about tech trends: NFTs and the metaverse. </p><p id=\"A4rjtT\">Here is a brief example of what you could possibly do with NFTs on YouTube, according to Neal Mohan: </p><blockquote><p id=\"RUOAKB\">You could imagine it being, as you described the canonical use case, right? The kind of pre-funding or crowdfunding of the video. That is kind of like a very clear case. But you could see a lot of other cases. Today what’s happening on the platform is people create clips of videos. They create even shorts of video-related content. </p><p id=\"OHlsha\">They create even Shorts of video-related content. You could boil that down to thumbnails, iconic thumbnails, et cetera. And so there’s lots of permutations and combinations. And I think one of the ways that at least my team is thinking about it is what are the ways that creators want to participate in that? But just as importantly, what are the ways that really add value from a viewer standpoint? If you partake in that, you’ve acquired an NFT, in your example of an image or of a clip of a video or a full video, how do you display that? Where could that go? What are the ways that users could actually continue to not just derive satisfaction for it personally, but also display it and things like that? And so those are the active conversations that we have right now in terms of how we’re thinking about this working both for our creators and our viewers.</p></blockquote><p id=\"qoqGNh\">You can listen to the full discussion here or on your preferred podcast player. </p><p id=\"duTdiy\">Stay subscribed for an all-new show on Friday covering this week’s biggest tech stories. </p><aside id=\"Pg9bxT\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"The Vergecast\",\"description\":\"The podcast you need to make sense of the week in tech news\",\"label\":\"Subscribe\",\"url\":\"https://pod.link/430333725\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/1YHtqz83ZXtiguVZ6SC3b8wI-vE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13627538/acastro_181214_3140_youtube.0.jpg",
  "description": "New tools for Shorts, interactive live streaming, and more.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}