{
  "title": "A court just blew up internet law because it thinks YouTube isn’t a website",
  "url": "https://www.theverge.com/2022/5/13/23068423/fifth-circuit-texas-social-media-law-ruling-first-amendment-section-230",
  "date": "2022-05-13T15:22:19.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wb3TrhMOCqN53rZRgqweHbFnRlQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70865505/akrales_220309_4977_0403.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"lUbZum\">Yesterday the Fifth Circuit Court of Appeals decided in favor of Texas Attorney General Ken Paxton in a lawsuit over HB 20, a bizarre law effectively banning many apps and websites from moderating posts by Texas residents. The court granted Paxton a stay on an earlier ruling to block the law, <a href=\"https://www.theverge.com/2022/5/11/23067002/texas-netchoice-paxton-hb20-social-media-law-fifth-circuit-appeals-court-grant-stay-ruling\">letting HB 20 go into effect</a> immediately while the rest of the case proceeds. The decision was handed down without explanation. But court-watchers weren’t necessarily surprised because it followed an <a href=\"https://www.protocol.com/policy/texas-appeal-confusion\">equally bizarre hearing</a> earlier this week — one that should alarm almost anyone who runs a website. And without intervention from another court, it’s going to put social networks that operate in Texas at legal risk.</p><p id=\"Ri1jZJ\">HB 20, to recap a little, bans social media platforms from removing, downranking, demonetizing, or otherwise “discriminat[ing] against” content based on “the viewpoint of the user or another person.” It applies to any “internet website or application” that hits 50 million monthly active users and “enables users to communicate with other users,” with exceptions for internet service providers and media sites. Social networks also aren’t allowed to ban users based on their location in Texas, a provision clearly meant to stop sites from simply pulling out of the state — which might be the simplest solution for many of them.</p><p id=\"biQGHk\">This is all happening because a judge doesn’t believe YouTube is a website.</p><p id=\"oHRmVC\"><a href=\"https://www.ca5.uscourts.gov/OralArgRecordings/21/21-51178_5-9-2022.mp3\">The Monday hearing</a> put Paxton and a NetChoice attorney in front of Fifth Circuit judges Leslie Southwick (who voted against the majority), Andrew Oldham, and Edith Jones. Things were dicey from the beginning. Paxton argued that social media companies should be treated as common carriers because of their market power, which would require them to treat all content neutrally the way that phone companies do, something no established law comes even close to requiring. In fact, thanks to a Republican <a href=\"https://www.theverge.com/2017/12/14/16776154/fcc-net-neutrality-vote-results-rules-repealed\">repeal of net neutrality laws</a>, even internet service providers like Comcast and Verizon aren’t common carriers.</p><p id=\"ThFnsf\">The panel, however, seemed sympathetic to Paxton’s reasoning. Judge Oldham professed to be shocked (shocked!) at learning that a private company like Twitter could ban categories of speech like pro-LGBT comments. “That’s extraordinary,” Oldham said. “Its future ownership — it could just decide that we, the modern public square of Twitter ... we will have no pro-LGBT speech.” He then ran through an extended analogy in which Verizon listened to every phone call and cut off any pro-LGBT conversation, ignoring interjections that Twitter simply <em>isn’t a common carrier </em>and the comparison doesn’t apply.</p><div class=\"c-float-right\"><aside id=\"uUqrCy\"><q>“Your clients are internet providers. They are not websites.”</q></aside></div><p id=\"FJhYGU\">But the hearing went fully off the rails when Judge Jones began discussing Section 230, the law that shields people who use and operate “interactive computer services” from lawsuits involving third-party content. Courts have applied the term “interactive computer service” to all kinds of things, including old-school web forums, email listservs, and even gossip sites. But as NetChoice’s attorney was arguing that websites should receive First Amendment protections, Judge Jones seemed baffled by the terminology.</p><p id=\"WMwMv4\">“It’s not a website. Your clients are internet providers. They are not websites,” Jones asserted of websites including Facebook, YouTube, and Google. “They are defined in the law as interactive computer services.” To mangle the term a little further, she asked if the sites were “interactive service providers” that she defined as fundamentally different from media websites like <em>Axios</em> and <em>Breitbart</em>. (Newspaper and blog comment sections have been repeatedly defined as interactive computer services, too.)</p><p id=\"edBAum\">The idea that YouTube is an “internet provider” and not a “website” is nonsense in a literal sense since it’s demonstrably a website that you must access via a separate internet service provider. (<a href=\"https://www.youtube.com/\">Try it from home!</a>) It’s unclear whether Jones was confusing “interactive computer services” with ISPs. But the real problem isn’t a judge that doesn’t understand technology. It’s that she apparently thinks relying on Section 230 strips website operators of First Amendment rights. Around the weird waffling over “internet providers,” Jones laid out a line of thinking that seemingly boils down to this:</p><ol><li id=\"DF8BZz\">Only “interactive computer services” can rely on Section 230</li><li id=\"NtExnR\">Section 230 protects these sites from being considered the “publishers or speakers” of any given piece of third-party content</li><li id=\"dVOCgc\">The First Amendment kicks in if companies are expressing speech</li><li id=\"j9FJd5\">If companies aren’t legally liable for a<em> specific instance of illegal speech</em>, their overall moderation strategy shouldn’t count as speech either</li><li id=\"28OO6k\">Thus, YouTube and Facebook have to pick between being Section 230 “interactive computer services” and having First Amendment rights</li></ol><p id=\"TDCsGf\">There’s nothing in this logic that stops at the world’s tech giants. Jones’ reasoning would be a blank check for laws that require sites (or apps or mailing lists) of any size to accept a government-mandated moderation strategy or open themselves up to libel and harassment lawsuits every time a user posts a comment. It is <em>much</em> worse than not knowing YouTube is a website — a term Jones seems to be using metaphorically to mean a publisher of speech.</p><div class=\"c-float-right\"><aside id=\"5syLZD\"><q>There’s a broad, but vague, sense that big websites should be treated like utilities</q></aside></div><p id=\"nfPBDZ\">There’s a broad sense that places like YouTube <em>feel</em> powerful enough to be utilities, so judges and lawmakers (and <a href=\"https://www.theverge.com/2022/4/15/23025120/elon-musk-twitter-free-speech-government-censorship\">Elon Musk</a>) can get away with throwing around vague terms like “modern public square.” But neither Paxton nor the Fifth Circuit judges have even bothered with a legal framework that would focus on the world’s most powerful platforms. Instead, HB 20’s “50 million users” criteria would likely sweep up non-“Big Tech” companies like Yelp, Reddit, Pinterest, and many others. Are those sites (sorry, “internet providers”) the phone company, too?</p><p id=\"yg5hbi\">Meanwhile, real ISPs get a free pass despite having extraordinary power over Americans’ internet access, apparently for the sole reason that they haven’t made Texas politicians mad.</p><p id=\"jvDoXs\">HB 20 says that if you run a social network — even a nonprofit one — you’ll have to throw out your community standards if enough people like the space you’ve built on them. And that’s just the start of the issues. Is labeling a post as false information “discriminating against” it? Can YouTube honor an advertiser’s request to pull ads off particularly offensive videos? Can Reddit deputize moderators to ban users from specific pieces of the platform? Can Texas really force any website on the internet to operate in its state? The potential legal headaches are endless and morbidly fascinating.</p><p id=\"9BFQuE\">This is just to say: one of the nation’s highest courts blew up internet law because its judges don’t see any difference between Pinterest and Verizon. And they should try typing “youtube.com” into a browser.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9VWxuG3vZ7lVsNr-65Ze6s2vEEk=/0x103:2040x1171/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318441/akrales_220309_4977_0403.jpg",
  "description": "Texas’ social media regulation kicked in this week.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}