{
  "title": "A cringe rapper slash Forbes contributor allegedly found with billions in stolen Bitcoin ",
  "url": "https://www.theverge.com/2022/2/8/22923772/doj-irs-bitfinex-hack-bitcoin-recovery-encrypted-files-razzlekhan",
  "date": "2022-02-08T21:17:36.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xc-MmCqQhcznvvILq_BF98HnEzk=/233x0:2648x1610/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70485405/Screen_Shot_2022_02_08_at_10.43.03.0.png\" />        <figcaption><em>Heather Morgan, who was arrested along with her husband, performed under the name “Razzlekhan.”</em> | Image: Razzlekhan</figcaption>    </figure>  <p id=\"jU8oGP\">The Department of Justice has finally found almost all of the billions worth of Bitcoin stolen during the 2016 hack of cryptocurrency exchange Bitfinex — in the hands of a published <em>Forbes</em> and <em>Inc.</em> writer and rapper, who calls herself the “Crocodile of Wall Street,” and her startup founder husband.</p><p id=\"BSfHgk\">The DOJ says it seized about $3.6 billion worth of the cryptocurrency, allegedly held by Heather Morgan and her husband, Ilya Lichtenstein. The couple is accused of trying to cover their tracks by laundering the stolen funds through “a labyrinth of cryptocurrency transactions.” It’s the department’s “largest financial seizure ever,” <a href=\"https://www.justice.gov/opa/pr/two-arrested-alleged-conspiracy-launder-45-billion-stolen-cryptocurrency\">according to a Tuesday press release</a>.</p><p id=\"Qg3Ytb\">The DOJ doesn’t explicitly say they stole the billions in cryptocurrency — an unnamed hacker was the one who transferred 119,754 Bitcoin from the exchange to an outside wallet, and that wallet was allegedly controlled by Lichtenstein. But considering the total amount stolen during the breach was 119,756 Bitcoin, that suggests Lichenstein and his partner had access to nearly the entire sum stolen from Bitfinex.</p><p id=\"cXsO9X\">And according to the <a href=\"https://www.justice.gov/opa/press-release/file/1470186/download\">statement of facts</a> prepared by an IRS special agent (PDF), the value of those Bitcoin has ballooned significantly since the hack — in 2016, they were worth $71 million, and now, their value is measured in billions.</p><div class=\"c-float-left\"><aside id=\"bg12wj\"><q>“This song is for the entrepreneurs and hackers”</q></aside><div id=\"e3JSZQ\"><div ><iframe src=\"https://www.youtube.com/embed/_DIuPPmY9mw?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"sGayeS\">Morgan has instantly <a href=\"https://twitter.com/bigblackjacobin/status/1491117305308545025?s=20&amp;t=VcKUpNWNPG7UzUIIXanLOg\">become a character following news of the hack today</a>, as people have been combing through <a href=\"https://www.instagram.com/razzlekhan/\">her social media</a> and LinkedIn and discovering her... unique persona. The DOJ’s criminal complaint lists an alias of hers as “Razzlekhan,” and people were <a href=\"https://twitter.com/EamonJavers/status/1491104839878983680?s=20&amp;t=Z-fMkzyxXdX8rOl3tEH8zA\">quick to discover the rap songs she released under that name</a>. The music video for one of the songs is titled “Rap Anthem for Misfits &amp; Weirdos: Versace Bedouin Music Video,” and Razzlekhan shouts out “entrepreneurs and hackers” in the lyrics. </p><div id=\"kRkjMW\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Her website might be more cursed.<a href=\"https://t.co/JovbBM8jGq\">https://t.co/JovbBM8jGq</a> <a href=\"https://t.co/TmXSa1zuDc\">pic.twitter.com/TmXSa1zuDc</a></p>— Kevin Collier (@kevincollier) <a href=\"https://twitter.com/kevincollier/status/1491108695606181888?ref_src=twsrc%5Etfw\">February 8, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"cZy3an\">Morgan’s also done a considerable amount of writing at <em>Inc.</em> and <em>Forbes</em>, and <a href=\"https://www.forbes.com/sites/heathermorgan/?sh=1277e8547f7d\">her author profile</a> says that “when she’s not reverse-engineering black markets to think of better ways to combat fraud and cybercrime, she enjoys rapping and designing streetwear fashion.” One of her articles even offers advice on <a href=\"https://www.forbes.com/sites/shellyearchambeau/2022/02/08/getting-your-seat-at-the-table/?sh=405715f4514d\">how to keep your business safe from cybercriminals</a>. </p><p id=\"llrcYw\">While Morgan’s online antics have gotten a lot of the focus, the bulk of the DOJ’s accusations fall on Lichtenstein (though Morgan is still heavily implicated and allegedly gave false information to at least one of the crypto exchanges she held Bitcoin in). <a href=\"https://www.linkedin.com/in/unrealdutch/\">Lichtenstein’s LinkedIn</a> lists him as the founder of a blockchain startup named Endpass and co-founder of MixRank.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/e39TzMTJE8vXr-gjNpCqT1C8nRA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23227146/Screen_Shot_2022_02_08_at_11.45.52.png\">      <cite>Image: <em>Elliptic</em></cite>      <figcaption><em>An image from analysis done by Elliptic, tracing the movement of some of the stolen funds.</em></figcaption>  </figure><p id=\"ngA0MS\">Since the hack, the crypto industry has kept a close eye on the stolen coins’ movement. Crypto compliance firm Elliptic <a href=\"https://www.elliptic.co/blog/elliptic-analysis-bitcoin-bitfinex-theft\">has a great deep-dive from 2021</a>, which covers how hundreds of thousands of dollars worth of Bitcoin were shuffled around, though, at the time, it was unknown who controlled the wallet. The government alleges that Lichtenstein and Morgan’s laundering involved several other crypto exchanges and gift cards for Walmart, Uber, Hotels.com, and PlayStation. The statement of facts also accuses the couple of lying to exchanges about how they got the Bitcoin and what they were doing with it.</p><div class=\"c-float-right\"><aside id=\"54KBqp\"><q>Lichtenstein allegedly kept the private keys in his email’s cloud storage</q></aside></div><p id=\"J4FGnq\">Law enforcement says it was able to seize the 94,636 Bitcoin left in the wallet because Lichtenstein allegedly uploaded a list to a cloud storage and email provider that contained addresses for the wallet that Binfinex’s funds were dumped into, along with the private keys to access them. The file was encrypted, but after obtaining it through a search warrant, the statement of facts says that law enforcement was able to decrypt it and several other files (though it doesn’t offer any explanation of how). </p><p id=\"zyUoN3\">This let the government seize the 94,636 Bitcoin left in the wallet and also gave it access to other potentially incriminating documents, like a spreadsheet showing other accounts linked to the stolen funds and a list of dark web sites that sold passports and IDs.</p><p id=\"TqWku7\">The DOJ will let people who lost Bitcoin in the hack request that the government return it to them, <a href=\"https://twitter.com/EamonJavers/status/1491093570505539586\">according to CNBC correspondent Eamon Javers</a>. Javers <a href=\"https://twitter.com/EamonJavers/status/1491093564540932096\">also notes</a> that the couple is accused of using some of the funds to purchase NFTs but says the DOJ wouldn’t say whether they’d purchased any Bored Apes.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Aq7idkUZpMIjxycB1Z9Xg39-UjU=/0x51:2880x1559/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23226853/Screen_Shot_2022_02_08_at_10.43.03.png",
  "description": "A couple is accused of laundering the funds.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}