{
  "title": "A dog’s breed doesn’t determine much about its behavior",
  "url": "https://www.theverge.com/2022/4/28/23043508/dog-breed-behavior-genetics-study-stereotypes",
  "date": "2022-04-28T18:00:00.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/t_saaLQFpAvJTHnazZEwquzGi1Q=/0x43:1024x726/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70805785/4EA5176C_D98F_4A32_9AC5_BA0A3141AF5C_1_105_c.0.jpeg\" />        <figcaption><em>This is Igloo! His birthday was yesterday, and he is very patient and kind.</em> | Alex Cranz</figcaption>    </figure>  <p id=\"UFT1vm\">Elinor Karlsson has never owned a dog. But ever since she was a graduate student, she’s been studying dog genetics. (They’re good models for studying genetic diseases in humans.) Part of that work involved collecting genetic and behavioral data on thousands of dogs. And <a href=\"https://darwinsark.org/\">all that data</a> meant the research team could ask a question Karlsson had been wondering for years: does a dog’s breed really say anything about how that dog acts?</p><p id=\"TrN9a0\">“Everybody was assuming that breed was predictive of behavior in dogs,” said Karlsson, now the<strong> </strong>director of the Vertebrate Genomics Group at the Broad Institute of MIT and Harvard, during a press briefing. “And that had never really been asked particularly well. And we could actually do that.”  </p><p id=\"ypkFl2\">The answer they found goes against the stereotypes many people hold about their dogs. Dog breed <em>doesn’t </em>actually predict behavior, at least not in a major way, according to a <a href=\"http://www.science.org/doi/10.1126/science.abk0639\">new paper</a> published Thursday in the journal <em>Science</em>. The research did find some genes associated with traits like human sociability and howling frequency. But overall, only around 9 percent of dog behavior was explained by breed. </p><p id=\"RbUiCw\">“Dogs are individuals,” said Marjie Alonso, a study author and executive director of the International Association of Animal Behavior Consultants. “What a dog looks like is not really going to tell you what the dog acts like.”</p><div class=\"c-float-right\"><aside id=\"Odm5xu\"><q>“What a dog looks like is not really going to tell you what the dog acts like.”</q></aside></div><p id=\"WZbHcV\">The study analyzed survey responses from nearly 20,000 dog owners about their dog’s behavior — asking about things like how they interacted with people, how easy they were to train, how they played with toys, and the times they behaved aggressively or retreated from conflict. It also sequenced the DNA of over 2,000 dogs. Around half the dogs were mutts, which made it possible to tease apart breeds and behaviors. If certain behaviors were linked to certain breeds on a genetic level, mutts with more ancestry from a breed should share that breed’s behavioral traits. “Once we have the mixed-breed dogs in our study, we can try to start dissecting what’s connected to breed and what’s not connected to breed in a way we can’t in the purebred dogs,” Karlsson said. </p><p id=\"TlajAI\">The study did find some behaviors, like howling, had stronger connections to various breeds. Beagles and bloodhounds, for example, were more likely to howl than other dogs. How responsive dogs are to directions had some genetic links, too. Border collies tended to be more responsive, and mixed-breed dogs with border collie ancestry were also more likely to have that trait.</p><p id=\"nq3UKI\">But other behaviors, like how easily a dog is frightened, had almost no relationship to breed despite stereotypes around some types of dogs spooking more or less easily than others. The size of a dog also had very little ability to predict how a dog was going to behave. Large dogs weren’t calmer than small dogs, as people sometimes assume. </p><p id=\"abfoR1\">Overall, breed wasn’t a good way to figure out how a dog is going to behave, the study found. “What we were finding didn’t necessarily line up with people’s perceptions of dogs and the stereotypes that people have of dogs,” Karlsson said. “People are very good at finding patterns. And I think that they find patterns even when there aren’t patterns.”</p><p id=\"g2dPQl\">The findings track with a common experience many dog owners have, Alonso said. Often, people will get new dogs that are the same breed as an older dog. Then, they’re frustrated when the new dog doesn’t act the same as the first.</p><p id=\"nmVPc5\">“They get the same breed because they wanted the same dog,” said Alonso. “I don’t think that we should really be deciding that breeds are the things that will tell us whether or not we’re going to be happy with a dog, or a dog is going to be happy with us.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ujCmMDEOopy-ppTcBtx5CUVVqwo=/0x116:1024x652/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23420974/4EA5176C_D98F_4A32_9AC5_BA0A3141AF5C_1_105_c.jpeg",
  "description": "But your dog is perfect.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}