{
  "title": "A first look at Microsoft’s new Windows 11 Android apps support",
  "url": "https://www.theverge.com/22737102/microsoft-windows-11-android-apps-support-feature-hands-on",
  "date": "2022-02-15T23:40:15.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nDYaBVrY8eI4X3UkT2TULmacBBA=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70022861/thumbnail_v3_notext.5.jpeg\" />    </figure>  <p id=\"LYO9hT\">On February 15th, <a href=\"https://www.theverge.com/2022/2/15/22934562/microsoft-windows-11-february-2022-update-android-apps-taskbar-improvements\">Microsoft released its first big public update to Windows 11</a> with the long-awaited ability to use Android apps. What are they like? Well, we covered that when they originally hit the Beta Channel for Windows 11 insiders, and so far it feels largely identical — so here’s our October 2021 story and video.</p><p id=\"VVbeRs\"><strong>Original story: </strong></p><p id=\"cRN9AE\">Microsoft has released the first preview version of its Android apps support in Windows 11. It’s available to testers in the Beta Channel version of Windows 11, which means you’ll need to opt into the Windows Insider program to get access. I’ve installed the preview version on two systems — a gaming rig with a Core i9 11900K and Microsoft’s Surface Pro X — to get a feel for exactly how well Android apps run on Windows 11.</p><p id=\"MpVgkK\">The experience of installing apps is very simple. Microsoft has partnered with Amazon, so the Microsoft Store will list apps but send you over to Amazon’s Appstore app to get them installed or updated. This also installs a Windows Subsystem for Android in the background, which is the core technology that powers Android apps running on Windows 11.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VnSdFLSghwYftFmrK7dQtqQSJ8g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22943047/android1.png\">      <figcaption><em>The Windows Subsystem for Android powers the entire experience.</em></figcaption>  </figure><p id=\"mIGD8V\">Apps effectively run in a virtual machine, contained within their own world but able to sit side by side with other Windows apps. You can pin Android apps to the Start menu or taskbar and use all of the windowing and multitasking features of Windows 11 just like a regular desktop app.</p><p id=\"OEs2Xe\">While there are only 50 apps officially available in this preview, I was able to install Amazon’s Kindle app, the BBC Sounds app, and a bunch of games to test just how well Windows 11 handles mobile games. </p><p id=\"Kx7caR\">On both the Surface Pro X (an Arm-powered device) and my Intel-powered gaming rig, apps ran surprisingly well. I was able to run them alongside Word, Chrome, and other desktop apps, as if they were just regular Windows apps.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SbWLR7fj_eqqOsux2bAfSx2G4Pk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22943049/android2.jpeg\">      <figcaption><em>Android apps and games running side by side.</em></figcaption>  </figure><p id=\"sFifJo\">Apps show up in search results as if they were regular Windows ones, and the integration into the Start menu and taskbar makes them feel just like any other app. It’s surprisingly seamless and a well-integrated solution.</p><p id=\"7U1C91\">The preview isn’t perfect, though. I noticed 100 percent CPU utilization when I attempted to get four Android games running side by side using Windows 11’s Snap Layouts feature on my gaming PC. Everything suddenly felt laggy, until seconds later it sprung back to life and the CPU usage went back to normal.</p><p id=\"svltAK\">Likewise, games didn’t seem to run very well on the Surface Pro X with low frame rates and stuttering. This is a preview though, so I’d hope to see performance improve before this ships to all Windows 11 users.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/u9UPf1gxea08VpKcyO8tPHYvXXM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22943053/android3.jpeg\">      <figcaption><em>Amazon’s Appstore is the only official way to get Android apps on Windows 11 outside of sideloading.</em></figcaption>  </figure><p id=\"yh3jE2\">I also noticed in <em>Final Fantasy XV </em>that the game reloads when you attempt to resize it, and some apps and games don’t resize particularly well. It all depends on how developers have built their apps, but expect most to run best in phone-like dimensions.</p><p id=\"sIZN1t\">The question is whether you actually want or need Android apps. I personally only need a handful, like the Kindle app or some smart home apps, but it’s the Android mobile games that are more interesting to me. </p><p id=\"XTA2qM\">Bluestacks has supported Android apps on Windows for years, and the company has leaned heavily into supporting mobile games on Windows. Microsoft is late to the party here, but its subsystem is clearly the result of years of work to extend Windows to running Linux kernels and GUI apps. While Microsoft is busy getting Android apps on Windows 11 working, <a href=\"https://www.theverge.com/2021/9/30/22701930/bluestacks-x-android-games-browser-free-cloud-gaming\">Bluestacks is now in the process</a> of bringing Android apps into the browser and running them in the cloud.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4x55XyCSsi19IgJ4Zzg5mgzI-xk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22943060/android4.jpeg\">      <figcaption><em>Android apps can run alongside Windows apps.</em></figcaption>  </figure><p id=\"dfiRLG\">Microsoft’s Android apps support relies on the Amazon Appstore for now, which has only a fraction of the apps available on Google’s Play Store. It’s inevitable that someone will sideload this onto Windows 11 and unlock many more apps with it, but Microsoft won’t officially be supporting this.</p><p id=\"6vfdMy\">Still, the initial preview is a lot more complete and smooth (on the right hardware) than I expected. Microsoft’s initial release to the Beta Channel of Windows Insider also suggests this might appear for everyone using Windows 11 a lot sooner than we expected.</p><p id=\"NFMz4P\"><em><strong>Update February 15th, 2022: </strong></em><em>Added that Windows 11’s Android app support is now live in public preview.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sRaZpb6dwLA62zYWIyCt2f0P4ZQ=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22943049/android2.jpeg",
  "description": "Mobile apps and games are coming to Windows 11 soon.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}