{
  "title": "A former Foxconn executive tries to explain what went wrong in Wisconsin",
  "url": "https://www.theverge.com/23030465/foxconn-lcd-factory-wisconsin-alan-yeung-trump-scott-walker-wisconn-valley-dome-decoder-interview",
  "date": "2022-04-19T14:30:00.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hENOvZo3ZEwl6fD_c5Qz1dJqQ-0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70766545/VRG_ILLO_Decoder_220418.0.jpg\" />        <figcaption>Photo Illustration by The Verge</figcaption>    </figure>  <p>A plan to revive US manufacturing gone wrong</p> <p class=\"p--has-dropcap p-large-text\" id=\"To2Hra\">Alan Yeung is a professor of entrepreneurship at the University of Wisconsin-Madison and the former head of the <a href=\"https://www.theverge.com/policy/2019/4/26/18518650/foxconn-wisconsin-factory-lcd-buildings-us\">Foxconn project in Wisconsin</a>. </p><p id=\"fCxb5L\">If you don’t quite remember, the Foxconn project in Wisconsin was announced in 2017 as a massive deal to build the first “Generation 10.5” LCD factory in North America. It was also one of the first big moments in the Trump presidency, complete with President Trump holding a golden shovel at a lavish groundbreaking ceremony where he said the factory would be “the eighth wonder of the world.”</p><p id=\"PwUXFU\">The deal was supposedly quite simple: Foxconn (the company best known for manufacturing the iPhone), President Trump, and Wisconsin Governor Scott Walker all announced that Foxconn would build a 20-million-square-foot display factory in Wisconsin that would bring 13,000 manufacturing jobs back to the United States. <a href=\"https://www.theverge.com/2018/10/29/18027032/foxconn-wisconsin-plant-jobs-deal-subsidy-governor-scott-walker\">Wisconsin promised more than $4 billion in tax credits to Foxconn</a>, cleared land by pushing people out of their homes, and diverted water from Lake Michigan to support the factory. A lot of people got excited about this promised American manufacturing renaissance and left good jobs to join it.</p><p id=\"TxAQ9Z\">But it turned out that while Foxconn was putting on a great show, no LCD factory was actually getting built, even though Foxconn kept saying it was happening.</p><p id=\"7TcQod\"><em>Verge</em> investigations editor Josh Dzieza and the rest of the <em>Verge</em> team wrote more than 20 stories about Foxconn, the factory, the “innovation centers” the company promised to build around Wisconsin, and the people in Wisconsin who felt betrayed when it never happened. Josh won both <a href=\"https://www.deadlineclub.org/2021-awards-winners/\">Deadline Club</a> and <a href=\"https://www.hillmanfoundation.org/sidney-awards/josh-dzieza-wins-november-sidney-exposing-great-foxconn-con#:~:text=Josh%20Dzieza%20is%20an%20investigations,the%202019%20Deadline%20Club%20awards.\">Sidney awards</a> for <a href=\"https://www.theverge.com/c/21507966/foxconn-empty-factories-wisconsin-jobs-loophole-trump\">his reporting on Foxconn</a>.</p><p id=\"vPHM31\">As the Foxconn exec who was initially in charge of the project, Yeung was one of the central characters in this entire story. Josh and I both tried to interview him multiple times while this was all ongoing, and he always turned us down since Foxconn has a policy of not talking to reporters. Alan has since left Foxconn and written a book called <em>Flying Eagle</em> — the codename of the project. When he reached out to come on <em>Decoder,</em> we couldn’t say no.</p><div id=\"aTN9B9\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP7502469969\" width=\"100%\"></iframe></div><p id=\"K0wigc\"><em>This transcript has been lightly edited for clarity.</em></p><p id=\"61LKRM\"><strong>Nilay Patel: Alan Yeung is a professor of entrepreneurship at University of Wisconsin-Madison, and was the lead on the Foxconn project in Wisconsin. Welcome to </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"re5Veq\">Thank you for having me.</p><p id=\"4SHHpG\"><strong>NP: I am very excited to talk to you. I also have Josh Dzieza here, the reporter at </strong><em><strong>The Verge</strong></em><strong> who covered Foxconn most extensively. Welcome Josh.</strong></p><p id=\"5EKL87\"><strong> Josh Dzieza: Hi. Good to meet you, Alan.</strong></p><p id=\"zA6WZI\">Hey, Josh.</p><p id=\"m2YRcm\"><strong>NP: Alan, you have written a book about Foxconn in Wisconsin called </strong><em><strong>Flying Eagle</strong></em><strong>. Tell us about that book.</strong></p><p id=\"zafkYW\">I wrote the book in the past year and a half, partly because I think there are a lot of untold stories that need to be told. I wanted to share some of the interesting backstories and narratives of the tireless people and patriots who put in a great deal of work to bring this investment into the United States, and to Wisconsin.</p><p id=\"fCBokP\"><strong>NP: Josh and I covered this project extensively at </strong><em><strong>The Verge</strong></em><strong> the whole time, and we have both read the book. If you just read this book cover to cover, you would end fully believing that there is a Generation 10.5 LCD factory in southeastern Wisconsin. There is not a factory. What happened?</strong></p><p id=\"nr9guM\">Well, if you read the book — which you did, and I thank you for that — it stopped right around the end of 2017. I think everybody, including myself, fully believed that the Gen 10.5 project would happen. A great deal of work went in there, as was the plan and the intent. By the way, I want to thank the two of you and <em>The Verge</em> for covering the story so extensively. Not everybody had actually put in the time and effort to do that. I also want to clarify that, up until this point, I have not talked to the media or <em>The Verge</em>.</p><p id=\"NnUYA2\"><strong>NP: We tried to talk to you a lot, and you always said no.</strong></p><p id=\"fgBC0u\">Yes, we have very strict policy, especially given my role at the company and my responsibility for the project. I do appreciate you taking the interest and doing very extensive reporting on that. I commend you for that. A lot of the facts and data you share are more complete and extensive than any other outlet or report organization. That is a really great contribution and great discourse.</p><p id=\"k9kz0g\"><strong>NP: Josh did all the work, so congratulations go to him. I appreciate the compliment, but I just want to get back to this. You wrote an entire book about Foxconn Wisconsin that ends before the thing happens. It is all about how the deal came to be, but it does not address the fact that it was never executed. There is no factory. Why not address that in the book?</strong></p><div class=\"c-float-right c-float-hang\"><aside id=\"EEAtGV\"><q>“There is no factory. Why not address that in the book?”</q></aside></div><p id=\"5HtwQp\">That will be the next book. Originally, there was going to be only one book, but it would just take way too long and would be very thick. What I would like to do for now is share the first chapters of the story and how that came about. I think your reports over the years have talked about how political this endeavor and project have become. It had never been intended to be political, but unfortunately — once it got into that high profile — it turned very political and became a bit of a football later. That narrative and a lot of the stories will come in the second book.</p><p id=\"RVSHX0\"><strong>JD: You were there during the crucial period when the factory did not get built, and you must have some ideas about why that did not happen. Even if you have not written the second book yet, could you tell us why, in your view, there is not a factory in Wisconsin?</strong></p><p id=\"emyDoZ\">I am writing that second book and it should come out sometime this year with the title <em>Wisconn Valley</em>. Quite honestly, most people do not want to mention that, and the science park will probably have its name changed back to Foxconn Science Park. Long and short answer, Josh, is that the business condition and the investment climate changed dramatically in Wisconsin. I have expanded on that a little bit in my public comments the last few weeks, but I will probably have a lot more to share in the second book. If you invite me to come back I can tell you a bit more later. </p><p id=\"lixbf0\">In the global sense, Chinese manufacturers were flooding the market with big panels because they have a lot of Gen 10.5 — or maybe even a Gen 11 — fabs coming on stream. A lot of those products were shipped based on tremendous amounts of support and subsidies within mainland China. Even the Foxconn fab in southern China had a tough time competing. </p><p id=\"jYAyjg\">That would be the market side, but in the long term, it would absorb all the volume. The company had every intention to build both the Gen 6 and the Gen 10.5 fab. I think we have shared it publicly that if the market condition is not ripe for a 10.5, we will build Gen 6 first, and then we will follow on the 10.5. </p><p id=\"NaG3b1\">The business environment and investment climate changed a lot in Wisconsin, partly because we did have a change of leadership within the governor’s mansion. That is not the entire reason, but it is a big chunk of it. If you remember, there were a lot of collaborations between Governor Walker and the administration with the company called Foxconn. We appreciate that and we are grateful for the support. We are also very thankful for the bipartisanship that we encounter coming into not just Wisconsin, but the other states as well. You both read my book; I have complimented a lot of that within Wisconsin, going up and down I-94. The mayors and the county executives of Milwaukee and Kenosha were also very supportive.</p><div class=\"c-float-left c-float-hang\"><aside id=\"68PHyf\"><q>“Every politician wants to see a giant factory with 13,000 jobs in their backyard.”</q></aside></div><p id=\"UPLvKy\"><strong>NP: I believe that. Every politician wants to see a giant factory with 13,000 jobs in their backyard. Josh wrote the story where he visited all of Foxconn’s innovation centers that were empty before the election — before Walker was voted out and Evers was voted in — and there was no factory. I would tell you that maybe the people of Wisconsin said, “The guy who made us these promises, Scott Walker, did not deliver, so we voted in a new person.” </strong><a href=\"https://www.theverge.com/2018/11/7/18072436/foxconn-factory-wisconsin-tony-evers-scott-walker-election\"><strong>The election of Tony Evers</strong></a><strong> is not why Foxconn did not build a factory, because they were already not building a factory.</strong></p><p id=\"7YjP4v\">Actually, that is not true. I am not praising all these attributes or reasoning behind the election here. When you have a company coming in making an investment — whether it is $100 million or $10 billion, in this case — the kind of attack that we received, almost from day one after the contract was signed, was basically unprecedented.</p><p id=\"inEx2E\"><strong>NP: That attack was rooted in the exact thing you said, which is that the market for LCDs was being overwhelmed by Chinese suppliers. No one could see the business case for an LCD factory in Wisconsin at higher labor rates and without the supply of workers to staff such a factory. The criticism was that this does not make economic sense.</strong></p><p id=\"kbl4VZ\">I would just answer that point by saying a couple things. We have consultants and advisors — and other states have hired them — but nobody really has a crystal ball. The market changes dramatically in terms of supply and demand, and it is very technical. </p><div class=\"c-float-right c-float-hang\"><div id=\"CgyoCH\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"rtlZs2\">When you go back to what we said before, I still believe today — and five years from now — there is a tremendous need for a TFT LCD fab in the United States. When we built in Wisconsin and signed the contract, people became a lot less supportive, not because they did not want the investment, but because it became political. Articles came out attacking us so that they may score a point or two, and that was not very helpful. </p><p id=\"74SOad\">If after the election, they all died down and everything went back to, “Let’s work together and make it happen,” we would be very happy. That wasn’t really the case then, and we know why. There was another election coming up with the biggest supporter of all, which was President Trump, so we live with that. The company has been very reserved and conservative in terms of making statements. We did work with the incumbent, and we have said nothing negative about the prior or the later administrations. I think that remains to be the same.</p><p id=\"ily6cc\">I will come back to what you said about the innovation center, because that was my idea. We had talked about how to build up the capability, and how to leverage all other places and locations within Wisconsin. That will be one of the ways that we tap into local talent. I think your press organization had said that, too. Anytime you put well over $50 million — along with paying for upkeep and property taxes — into innovation centers, they can get compared to Potemkin offices, used to help an incumbent get reelected. We do not do that; we actually work for our shareholders, and I would like to clarify that. If that was the appearance, and it really shouldn’t be, then that was unfortunate. </p><p id=\"sEDrDH\">I will mention in the next book that we actually purposely scaled back the announcement of the innovation center for Madison until the following April, because it was too close to the election. It really is not fair that we announced that one a few weeks before the November election in 2018.</p><p id=\"bNG0nm\"><strong>NP: We are back with Alan Yeung. Before the break, Alan had been talking about the innovation centers. </strong></p><p id=\"oNGmkB\"><strong>JD: Alan, to revisit the innovation centers, you announced several of them across Wisconsin in late 2018. I visited them in 2019, well after they were supposed to be open, and </strong><a href=\"https://www.theverge.com/2019/4/10/18296793/foxconn-wisconsin-location-factory-innovation-centers-technology-hub-no-news\"><strong>there was no one in them</strong></a><strong>. It was just dusty sawhorses and concrete floors. When I reported that, you said that they were not empty and that </strong><a href=\"https://www.theverge.com/2019/4/26/18518462/foxconn-empty-buildings-wisconsin-no-correction\"><strong>a correction would be forthcoming</strong></a><strong>. One never came and </strong><a href=\"https://www.theverge.com/2019/5/13/18565408/foxconn-wisconsin-innovation-centers-factories-empty-tax-subsidy\"><strong>I checked back a month later</strong></a><strong>, </strong><a href=\"https://www.theverge.com/2020/4/12/21217060/foxconn-wisconsin-innovation-centers-empty-buildings\"><strong>and then a year later</strong></a><strong>, and they continued to be empty and they never opened. I guess my question is, why did you say they were not empty when they were? Why did they remain empty for so long?</strong></p><p id=\"UosqqU\">Let me put it this way: We did answer you, but our corporate rules on engagement and communication are strict. Unless we have something substantive to really share — either because of the plan or something that we have done — I would not be able to actually say a whole lot. I have indicated to you and everybody else multiple times that there are people working there. I did worry about your wellbeing. I was talking and joking about you climbing trees and all that. Really, we are very fond of you and your reporting because you obviously have a keen interest in the project. We did have ourselves, our partners, and our clients in many of the buildings. </p><p id=\"RZdwo2\">The only ones we never actually did anything with were in Eau Claire; the brick buildings were meant to be a dormitory and short-term housing when we actually rotate engineers and programs in. The principal who was supposed to sell us the project and the property never actually delivered. He went around and told us both that we did not fulfill our commitment, but he did not fulfill his performance contract with us. We terminated him, which was unfortunate.</p><p id=\"Na3BaZ\"><strong>NP: Why not just say these things to us? I understand that Foxconn has a policy, but we asked you 5,000 times and there was just dead silence. Also, Josh never risked life or limb; I wouldn’t let our reporters do that. He just looked through the window. There are still people in Wisconsin going around to these sites and looking in the windows and seeing no one in these buildings.</strong></p><p id=\"5E92jZ\">Those Eau Claire sites, the two brick buildings, are unfortunate because I made the decision that they would have been a good mixed-use structure.</p><p id=\"IDFXgR\"><strong>NP: The idea was that you were going to have short-term housing for engineers. Why do you need to house engineers in that building?</strong></p><p id=\"g0uFSp\">For people to work together and bring up some of the talent, we would rotate engineers and programmers to be on-site around our innovation center. I will bring that up in my next book. We have a conveyor belt concept. It is not feasible to tap into just Mount Pleasant or Milwaukee alone to really build up the talent pool. We were going to use Milwaukee as our radiation point and headquarters, and it would tap into Madison, Eau Claire, Racine, and other places. We could find a site to actually work with innovators, programmers, and engineers. That work was supposed to be partly local and partly remote work by then, but that was before Covid-19. We did make it happen within Milwaukee and a bit of Racine, but not other places.</p><p id=\"ltNy8e\">As I said before, we try a lot of different ideas. Some of those get reported, others do not. Unfortunately, within the media, when everything becomes negative, that sells a lot more clicks and eyeballs. Ninety-six percent of the things we were trying did not happen and got reported; the other 4 percent happened, but did not get picked up. That became a little unfortunate, but the innovation center is something that we actually feel very proud of and we made a commitment to. They were supposed to be linked by Whiteboard and broadband, and really tap into Eau Claire and Green Bay. We did not want to lease buildings because that did not show commitment and, as I mentioned before, we were making investments in Wisconsin with or without credits. None of the buildings that we purchased in Green Bay, Eau Claire, Madison, Milwaukee, or in downtown Racine earned us tax credits. That was not the primary objective for doing this project.</p><p id=\"uKaWY6\"><strong>NP: We don’t even have any questions about tax credit. I am just trying to get to the heart of why you signed up to build a Gen 10.5 factory in Wisconsin, which is a famous cocktail-napkin contract with Scott Walker. All of this other stuff seems like a distraction from that project. Now you are saying you do not think there is a talent base in Wisconsin alone, and you have to bring engineers into short-term housing from all these cities around Wisconsin to help grow a talent base. This entire book is about wining and dining with politicians, getting the deal together, and whether Scott Walker arrives in China and goes straight on the factory tour or stops at the hotel first. Nowhere in this book is there an economic defense of this investment that says, “This is a good idea that we think will return a profit to us.”</strong></p><p id=\"ZQhvNo\">Let me come back to you with a couple things. There were no napkins, okay? The one thing that you published, based on an open record request, is actually what I wrote about in the book. There is a piece of stationery that both Chairman Gou and Governor Walker signed, to make a commitment to reshore manufacturing — that is a fact — but there is no napkin and all that.</p><p id=\"415IHT\"><strong>NP: I will concede that there is not a napkin.</strong></p><p id=\"W9NKpm\">Having the team fly into Japan — not China — is a way to showcase, impress, and communicate with them how big this project would have been, and how committed the company would be in finding the right partner and the right state of making investment. I put some works and pages behind that and I think you read through that already. Foxconn is a $180-plus billion company. If you do the averaging, half a billion dollars of products, financial resources, or cash moves around the world every day. We do not make investments very casually. Therefore, the biggest criteria we have is the commitment of the people we work with. </p><p id=\"jrLeMr\">President Trump and the Office of American Innovation, through our engagement, had demonstrated that. Our site selection process went down to the state and the local level and allowed us to gauge who would be the best partners. In the end, we said there were two: Ohio and Wisconsin, Governor Kasich and Governor Walker. That was our conclusion, and was one of my points within the book. I would just bring out a very simple but interesting fact that if staff support and input were taken into account, the Gen 10.5 fab would have gone to Ohio.</p><p id=\"Wddn69\"><strong>NP: It would not have because there is no fab.</strong></p><p id=\"0vGklc\">Ohio is a lot closer to the Eastern seaboard and end-use market, and the logistics would have worked a lot better. Given what we see in hindsight with the business environment, Ohio’s investment climate — unlike Wisconsin — has only gotten better, not worse. Wisconsin wanted the Gen 6 fab; they wanted the application and the ability to work with medical, with dual use, and other solutions that a Gen 10.5 would not work with. So later on, when we pivot back to, “Hey, let’s go back to what you want at Wisconsin,” the Walker administration actually would have supported that, but unfortunately, we did not get there with the next administration.</p><p id=\"WLTrpR\"><strong>JD: I want to push back on that because according to records that I received, there was over a year period when the Evers administration was asking Foxconn to tell it what it was building — whether it was a Gen 6 or a server manufacturing facility or something else — so that they could revise the contract to reflect that. You, among other Foxconn executives, refused to tell them. I think the idea that the Walker administration would have welcomed the Gen 6 while the Evers wouldn’t have is not accurate. Why wouldn’t Foxconn tell the Evers administration what it was building?</strong></p><p id=\"l5fNXG\">We told the Wisconsin Department of Commerce secretary during the Walker administration, we told his successor, and we told the governor. Unfortunately, I think the public narrative has been one-sided, so the company decided not to actually talk or negotiate this in the open. I will share a bit more in my next book on that. I understand where you guys are coming from.</p><p id=\"boMjru\"><strong>NP: I understand you have a next book, but you have to answer this question. There is not a Gen 6 fab. There is not a Gen 10.5 fab. There is not a factory that is making anything that is known to anyone, as far as we can tell. If you had just said, “We are going to make a Gen 6 fab,” I think everyone would have been like, “Okay, where is it?” There isn’t one. </strong></p><p id=\"TPM2RE\"><strong>The idea that it is the Evers administration, that business climate changed, or that Wisconsin was the wrong choice — which is what you are suggesting right now — that is all on Foxconn. If you chose wrong and should have chosen Ohio because of politics, it is still on Foxconn. If you decided 10.5 was not going to work out and Gen 6 was better, and you could not convince the Evers administration that you were actually going to build an LCD factory. What we have heard from that administration is that you never engaged or told them anything. So where is the accountability here for there not being a factory?</strong></p><p id=\"BkmewQ\">Let me actually correct what you just said. Wisconsin was the first choice and Wisconsin remained the top choice for Foxconn for this project.</p><p id=\"Yp23pv\"><strong>NP: You just said Ohio is better.</strong></p><div class=\"c-float-left c-float-hang\"><aside id=\"HTprWP\"><q>“Once we made the commitment to build the fab in Wisconsin, there was no looking back.“</q></aside></div><p id=\"UaZTOB\">Ohio would have been better for Gen 10.5, but once we made the commitment to build the fab in Wisconsin, there was no looking back. That is really something that you should get from the first book and you will probably get more from the second book. You keep asking where the Gen 6 fab is. If you look at some of the investment and the sizing of the clean room and everything, it is actually built for a Gen 6 fab. I would caution you — since you have me here to speak with the two of you — you cannot make conclusions or inferences without getting the other side’s story. In other words, it is not like nothing is being built there. They would just choose not to tell you.</p><p id=\"BPbuPc\"><strong>NP: What is being built?</strong></p><p id=\"Ccnb2S\">Foxconn and Chairman Gou believe that publicity is not helpful in terms of the customers because they do not want you to share client confidentiality. Publicity is not helpful in terms of competition because we were actually telegraphing to our competitors.</p><p id=\"X7Ykns\"><strong>NP: There was an enormous amount of client publicity, though. We were told that Briggo was going to </strong><a href=\"https://www.theverge.com/2019/9/5/20851978/foxconn-briggo-partnership-wisconsin-airport-coffee-robots-automation\"><strong>build coffee robots there</strong></a><strong>. We were told that Google was going to build servers there. We were told there was going to be a Gen 6 LCD factory there. We were told that </strong><a href=\"https://www.theverge.com/2020/4/8/21213269/foxconn-ventilators-wisconsin-plant-medtronic-pb-560-open-source-design-covid-19\"><strong>you were going to build ventilators</strong></a><strong>. None of that stuff happened.</strong></p><p id=\"9Dwl7H\">What we intended to do in Wisconsin is a combination of both, and we did build certain things in there. Whether or not it would continue is not up to the company to disclose publicly, in many cases. We have no obligation to share whether it launched, it commenced, or it ended. We did have commitment and obligation to the state of Wisconsin and its people in terms of the spirit of the contract or when the agreement demands it. In the case of ventilators, it was amid Covid-19. You would not believe how much work and how much goodwill was there to actually talk to potential partners in Minnesota.</p><p id=\"kyoFn1\"><strong>NP: Did you make a Medtronic ventilator at that facility?</strong></p><p id=\"qt7spH\">Well, I think you should ask those two companies.</p><p id=\"WP2c2C\"><strong>NP: No, I am asking you.</strong></p><p id=\"joPCPK\">I can tell you without betraying the confidentiality that products or prototypes had been made, but by the time the ventilator was up and running, and actually would have been shipped, the world had found out they did not really need ventilators. </p><p id=\"3ia9QX\">There are lots of projects and prototypes that the company makes that may not pan out. By the same token, whether the servers, the PC boards, or any communication products are built and shipped, they would not tell you because they are not actually in a position to share some of this information. That is why we would not be able to talk to <em>The Verge</em> or other media outlets unless there is a business reason or we have the okay with our partners or client to do so.</p><p id=\"isWeQD\"><strong>NP: What client doesn’t want the enormous win of saying, “We are the client for Foxconn in Wisconsin?” We asked all the people that we heard about.</strong></p><p id=\"VC73bc\">No, that is the question. Briggo, as a client and a partner of Foxconn, allows us to actually mention that we are building the prototype and the first articles for them. We got express approval and agreement from that company to publicize that. The ventilator was in a very difficult situation because of Covid-19, and our chairman made the phone call to Minneapolis to actually talk to the CEO there to get the project up and running. We do not want to take credit for that. We do not actually think it is anything beyond what a corporate citizen would do. </p><p id=\"61uAr9\">The project was moving along to build a Gen 6 fab and we would have added more if it had progressed further from there. That is what I can tell you at this point. You are right that there is no Gen 6 or 10.5 fab. I think the agreement that they amended last year — and actually signed into a new contract, nullifying the original one — probably put that into a period, no longer a question mark. You can see, for now, there is no Gen 6 or 10.5 fab. So we killed that one. </p><p id=\"W1ONW1\">You can either call that a win-win or a lose-lose for both parties. I am now a resident in Wisconsin; I pay taxes, my son goes to school there, and all that good stuff. I would just pose the question to everybody, “Would you rather a company invest $10 billion in your state, or would you rather they invest only $1 billion?” Right now, we get the latter. If you take that nine billion and go somewhere else, would other governors or countries welcome that with open hands?</p><p id=\"0rh15o\">I am hearing that Saudi Arabia and the UAE are looking to talk to Foxconn to create a $9 billion project in those countries. I am hearing that the likes of Ohio and other states continue to welcome Foxconn to put whatever amount of investment there. I would hope our politicians and legislators actually work together to ensure the next investor or company to come to Wisconsin does not get the same kind of treatment we did after we signed the deal in 2017. </p><p id=\"wGCmDz\">I am not placing any blame on anybody. I want more investment to come; if they do not feel the contract was fair, then they can renegotiate. Keep in mind — I actually point this out to everybody in my book — that it was a bipartisan effort to pass the legislation to actually approve the deal. Both sides of the aisle supported it and the governor signed it into law.</p><p id=\"HakVef\"><strong>JD: Let me stop you there for a second. You are teasing these other projects in Saudi Arabia, Ohio, or various other places that might or might not be happening. Whether or not Foxconn manufactured some secret products that you cannot tell us about, Foxconn did announce a lot of stuff. Their M.O. in Wisconsin was to make these big announcements about innovation centers or smart cities or the factory building, this and that. </strong></p><p id=\"bNGboQ\"><strong>I talked to a lot of people who really believed those promises and they left good jobs to be part of a revival of US manufacturing. You mentioned patriots when you started; I talked to a lot of people who felt very patriotic about this idea. Then they got there and saw it was not happening. There was no attempt to invest in an LCD factory, and no willingness to invest in really much of any manufacturing there. They felt that it was all optics, that there was no plan. cxd was all just announcements of big things that were going to happen that never did and they felt betrayed. How do you answer these people?</strong></p><div><aside id=\"0QxweF\"><q>“<strong>A lot of people really believed those promises and they left good jobs to be part of a revival of US manufacturing.</strong>“</q></aside></div><p id=\"WM9LfB\">These are good but loaded questions. Let me address them one by one. I think over the years, your reports have been very detailed and very comprehensive, but some of the information in there might need to be revisited because it may not be accurate. I can point it out offline.</p><p id=\"JBaPE0\"><strong>NP: Tell us what is not accurate.</strong></p><p id=\"SyV5aU\">Okay. When you look at India, when you look at Vietnam…</p><p id=\"HxuJe7\"><strong>NP: No. Answer the question about the employees in Wisconsin who felt betrayed.</strong></p><p id=\"R9QMcx\">Okay, I can do that later, but I will do it now.</p><p id=\"3YmcW5\"><strong>NP: We are running out of time, so I want you to do that now.</strong></p><p id=\"YPXK9k\">Well, the company makes investments — it makes announcements — and sometimes it depends on certain factors, including the customers in the marketplace, the timing, and the pace of that happening. Based on the market wants and needs of the customer, they can crank it up or it may take a little bit longer. </p><p id=\"rasJX9\">Some of your reports talked about it never happening in Vietnam or India, but if you go there right now, you can see the investment — $5 billion and many jobs — and the tremendous prosperity Foxconn as a company has brought. We were very proud to work with Prime Minister Modi to bring the investment to India near Chennai, and I think that project and the site have a ways to go. Five years ago, your comments and narrative would have been very negative. I would urge you and everybody else to really look at the longer-term horizon, at what we are doing and what the company is doing. </p><p id=\"hVg38H\">I no longer speak for or work for the company, I want to make sure you understand that. I am not defending the company per se, but I am sharing a fact; just look at what great things are happening in India and Vietnam. I think it will happen in Wisconsin.</p><p id=\"ieRFDs\"><strong>JD: What about the people in 2018 and 2019 that you hired to be part of a manufacturing renaissance — who left good jobs because they thought they were going to build something — and then ended up being asked, “Maybe you should figure out what Foxconn should do in Wisconsin?”</strong></p><p id=\"IHEuMK\">I was on both sides. I have every intention to actually build and help bring manufacturing, innovation, technical, and R&amp;D jobs. I also eventually left the company. I would point out that we recruited these people with good intentions. Personally and professionally, we made a good faith effort to actually make things happen. Including right now, there are hundreds of people over there trying to make something happen. Some of those things, they just cannot tell you.</p><p id=\"ZU8bKS\">One of the people I have the great pleasure of working with is Major General Timothy Zadalis. When I brought him in and he actually supported the project, one thing he said to me was, “You have some challenges here including human resources, with visioning and making things happen. The outcome with that would invariably be that Foxconn will become a training ground for other companies within the region. You are going to lose a lot of talent and many of them with good intentions.” Some of them left on good terms, but others might not have. Josh, maybe you had talked to someone that might have been a little bit unhappy when they departed the company, maybe even involuntarily.</p><p id=\"tozeSm\">Invariably, I think they got something out of it; they got training, and the stepping stones and experiences to move on to other positions in other companies. I can point to at least 30 to 50 people that have actually moved on to great organizations to take on great responsibility and are doing quite well. I take pride in doing that. Do I wish they had stayed on at Foxconn doing the Flying Eagle project? Of course I do. I wish I had stayed myself, and been in the project building that Gen 10.5 or Gen 6 fab, but that did not happen. Why did I leave? I believed I could do a lot more outside Foxconn than inside, and do it a lot faster, that includes the innovation center and speaking to the two of you.</p><p id=\"evlUoY\"><strong>NP: I’m happy you are here. I have to tell you, though, I received phone calls — and Josh received many more of these calls — from people in tears who had left senior positions as executives because they believed in this and felt betrayed. Hopefully, they all got better jobs in the end.</strong></p><p id=\"HMqxc1\">I appreciate it. I actually had not gotten to that point. I will write about that in my following book, but I did mention a little bit about the sacrifices that people made in making this project happen, at least during 2017 and early 2018. One of these groups of people are the farmers and residents within that site in Mount Pleasant. I felt we had been fair and we had been above-board in working with the local and the state government in making the project happen.</p><p id=\"ygKo1y\">I heard about getting people out of their farms and homes, but it really is not like that. People were selling their farms at $5,000 an acre. We made a conscious decision not to buy any of the land before an announcement was made because it would not be fair to them. They all got the same package and the same deal. Many of those people got $50,000 per acre and quite a number of them became millionaires. They were able to just go across the way to buy land or farm, but had more money in their pocket and moved on from there. If you say, “Well, it was involuntary,” that is not true. The people who chose not to leave or move, stayed and are still there.</p><p id=\"eiEsC7\"><strong>JD: Residents were threatened with eminent domain and about 80 homes were bulldozed, whether or not they were happy with the house they could buy with whatever compensation they received. I did speak to homeowners who had built homes thinking they would spend the rest of their lives there, only to find Foxconn was moving in. They had their home demolished and later found out that Foxconn never actually needed the land. As for the residents being able to stay, you are probably referring to Kim Mahoney, who decided to stay but is no longer in a neighborhood, and now sits next to a mysterious Foxconn glass dome. I would actually be curious if you could tell us what is inside of it.</strong></p><p id=\"LerL2l\">Okay. Well, there was no eminent domain per se. There are people who chose to stay.</p><p id=\"aryVt7\"><strong>NP: But people were threatened with eminent domain.</strong></p><p id=\"eiaTzo\">No, the facts prove it. The people who wanted to stay did and they are still there. The people who agreed to leave and move on got compensated. I have said before that I am grateful for their sacrifice, contribution, and support. Many of them actually became very successful when they got 10X the price increase from $5,000 to $50,000 an acre. They removed themselves from there and bought new farms and homes elsewhere before the current price increases. I think they have done very well. We respect and continue to support those who decided not to go, but on the other hand, those were their choices. </p><p id=\"BIjICf\">I think in the long term, whether Foxconn continues to invest, and for other companies — including a company like Intel coming in — this site is very attractive. If you look at the corridor between Milwaukee and O’Hare in Chicago, this is probably the most exciting site that one could look at, not just in the upper Midwest but also elsewhere. People ask me why Ohio won over Wisconsin as the first runner-up, and there are multiple factors, some of which we already talked about.</p><p id=\"DGXfho\"><strong>NP: We are running out of time, and I need to ask you a few questions that I have been dying to know the answer to. Josh actually pivoted to these. Your book and Foxconn talked a lot about AI 8K+5G, but it was never defined as far as I could tell. We searched and searched. What on earth is AI 8K+5G?</strong></p><p id=\"EbIauN\">That will actually be in the next book.</p><p id=\"F81ujl\"><strong>NP: It’s in this book.</strong></p><div class=\"c-float-left c-float-hang\"><aside id=\"H3xrzI\"><q>“<strong>What on earth is AI 8K+5G?</strong>“</q></aside></div><p id=\"DmyxIk\">In the years 2016 and 2017, Foxconn — and especially Sharp — held a commanding lead in terms of 8K technology. I will actually expand on this in my next book, and our plan was to build more capacity in North America to support the growing business in the US, and to support other usage such as medical. There are some prototypes that we work with, including dual use and defense for hands-off displays, and even antenna and other usages that require thin-film technology. Those are the things that we had talked about, and it would go beyond what Foxconn usually does as an EMS provider. We have a brand called Sharp that has the capability, the will, and the intending commitment to do that.</p><p id=\"CawuK4\">Now, AI would have been a little bit less advanced than 8K, but 5G focused on a tremendous capability in Taiwan and elsewhere. The usage for 5G is both indoors and outdoors; IoT capability being used for logistics, supply chain, and warehouse management is a prime example of using 5G indoors even before you go outdoors. Some of that work was being done by the Foxconn Industrial Internet [FII] team and I think they have done some good work there. Unfortunately, a lot of the customers in traction might not be in the Upper Midwest and Wisconsin. AI is actually a tough nut to crack because most of us do not know enough about deep learning or big data. If you look at how to actually monetize AI, most of that is in autonomous vehicles and other hot areas, not within the factory floor. The best example would be GE Digital, which invested 10 to 15 years into that business before grossing maybe $1 billion in revenue.</p><p id=\"x61GDp\"><strong>NP: I just want to be clear, the pitch was that there would be an AI 8K+5G ecosystem. That was the phrase we kept hearing: “This is an ecosystem.” You are telling me the 8K part was Sharp displays for defense applications and medical applications. The 5G stuff was putting sensors and control units on manufacturing indoors, and potentially autonomous vehicles. Then the AI part was still to be determined. How is that an ecosystem?</strong></p><p id=\"JfcCQu\">Well, no, I did not say that. The area of artificial intelligence within Foxconn was not as advanced as the other two, but it does not mean we do not have investment there.</p><p id=\"z7abcf\"><strong>NP: Sure, but how is that an ecosystem?</strong></p><p id=\"NQDykg\">Those are the three areas that we would invest in and they tie in with each other, just using 5G and AI is an example. You wrote extensively about my autonomous vehicle project that did not quite happen, but the UW Madison engineering team did work with Racine to take it to the next step. All the credit goes to them.</p><p id=\"znHbTO\"><strong>NP: I interview a lot of car CEOs on this show, man. None of them can make the cars drive themselves. Why can Foxconn do it?</strong></p><p id=\"I9fdTv\">The idea is that some of the driving, the equipment, or the sensing should not reside in the vehicle, right?</p><p id=\"swEFHt\"><strong>NP: Sure</strong>.</p><p id=\"sRXZr9\">If you put in the $10,000 lidar — back then it was $50,000 — and all the equipment, you basically have a server sitting in the trunk of a $100,000 vehicle.</p><p id=\"D1UYbU\"><strong>NP: Again, if you name an autonomous driving CEO, I have talked to them on this show.</strong></p><p id=\"cvGE8o\">Right. If you move some of that computation and sensing capability from the vehicle to the roadside…</p><p id=\"E5uNpq\"><strong>NP: So the AI 8K+5G ecosystem was autonomous cars?</strong></p><p id=\"4uagtO\">No, that is an example. You have a client server model between the vehicle and the roadside so your vehicle equipment cost will be down to four digits, as opposed to six digits. Your sensors, your lidars, and your communication could become 5G.</p><p id=\"vFO0HI\"><strong>NP: I just want to push — that requires a 5G network. Was Foxconn going to build a 5G network?</strong></p><p id=\"GDJURC\">Foxconn actually provides some of the equipment and components into that industry. I cannot get into whether it is actually serving different customers, but we were not going to put up 5G towers, if that was your question.</p><p id=\"OdX8aJ\"><strong>NP: So that was not going to be a network.</strong></p><p id=\"Zko6Az\">The 5G tower indoors was part of the plan, but whether that happened or not I cannot say because I left the company. Even if I did know, I probably would not be in a position to tell you. You would have to go back and ask them if anybody would speak with you. </p><p id=\"NpjYuD\">I do want to say one thing to the two of you. I actually am very thankful for your reporting. By and large, it is pretty comprehensive and accurate, but I hope you will go back and correct the areas that need it.</p><p id=\"BXQdBD\"><strong>NP: Well, that is why we’re asking you.</strong></p><p id=\"C9GCTX\">I would urge you to be a bit more positive and futuristic; don’t be so negative all the time. I think we should look past politics, and I will support that. I will come back and speak with you more.</p><p id=\"3FnBcB\"><strong>NP: We would love to hear from you. </strong></p><p id=\"uEIdBg\"><strong>JD: </strong><a href=\"https://www.theverge.com/2019/10/3/20896815/foxconn-wisconsin-fii-giant-dome-plans-release-cancel\"><strong>The dome in Mount Pleasant</strong></a><strong>, the glass orb that Foxconn built, what is inside of it?</strong></p><p id=\"jZ14QU\">I think there are data center capabilities, including equipment and servers.</p><p id=\"cDyhic\"><strong>NP: In the dome?</strong></p><p id=\"7PKJmj\">Oh, you’ve never been there? There are a lot of people who have actually gone through the tour.</p><p id=\"K4ZJO9\"><strong>NP: Okay, but what is in the actual glass dome?</strong></p><p id=\"y697ZC\">I cannot tell you what it is now, but to the best of my knowledge from back then, it is their data center capabilities. Everything that Foxconn did there on campus inside the dome is pioneering work. As our chairman Young Liu said, we did all this based on business, not politics. If the scale for the data center equipment and some of the work that they would do is pioneering, they probably would not tell you. A lot of that is actually in partnership with some of the biggest names within the data center world and they may not carry the Foxconn label when it becomes commercialized. I can assure you that the dome is needed.</p><p id=\"jJyuyk\"><strong>NP: The dome is needed to do pioneering data center work?</strong></p><p id=\"fsQmRJ\">The dome should have been better and bigger. Okay?</p><div class=\"c-float-right c-float-hang\"><aside id=\"8v77Jh\"><q>“The dome should have been better and bigger.”</q></aside></div><p id=\"q1Ukms\"><strong>NP: I agree. If anyone says to me that a dome should be bigger, I always agree with them. That is true.</strong></p><p id=\"lgV6ux\">The dome right now is limited in scale. If they make it slightly bigger I think it would scale better, but when you have that kind of negative environment they do not want to invest that big.</p><p id=\"47JHAy\"><strong>NP: I just want to be clear.</strong> <strong>Is the dome itself required for pioneering data center work?</strong></p><p id=\"4Gc5Vm\">You would have to go back to FII and ask them whether the architecture of the dome is needed. I think they just wanted to make a statement for the Foxconn investment for the campus there, beyond just a tin roof and gray walls. </p><p id=\"jhJz0d\"><strong>NP: So the dome itself, what is inside of it?</strong></p><p id=\"Va2qVS\">Data center equipment.</p><p id=\"DmK5Hr\"><strong>NP: There is a data center inside the dome?</strong></p><p id=\"QaKkJM\">That is what I just told you three times.</p><p id=\"6VCtXS\"><strong>NP: Okay. I believe you. I have seen a lot of data centers, but I have never heard anyone tell me the best shape for a data center is a dome.</strong></p><p id=\"LTChxi\">Whether the shape, size or scale of that dome is relevant, appropriate, and optimized for a data center, I cannot say. The FII team believed that it was optimal and the right thing to do for some of the pioneering work and development projects they had. If they would speak with you on record, I think you can get the answer. Other than that, speak to the people who have gone through the tour and see if they can tell you more. </p><p id=\"gwLtKV\">I would not speculate as to whether it is right or wrong because some of the reports you had got some of the facts right, but the conclusion is not advisable. I can help you over time to actually put some really positive, but also fair interpretation on that. You guys have done well over the years and I congratulate you, and I mentioned seeing you quite a few times on CNBC. I would encourage you to look at things from both sides. If there is nobody else to speak with you, I will do that to the best of my knowledge.</p><p id=\"7Hj5vQ\"><strong>NP: I appreciate that.</strong></p><p id=\"U1hH6e\">I am not doing them a favor. I am just telling you the facts, data, and information that you should probably have. It is unfortunate that there is only one side, because the other side wouldn’t speak with you.</p><p id=\"z7I8qQ\"><strong>NP: I agree.</strong></p><p id=\"nTlsqL\">I think we agree on that.</p><p id=\"fpnUnF\"><strong>NP: I will tell you, we tried very hard.</strong></p><p id=\"N40fIV\">Yeah, you did. I very much wanted to speak with you on record, but due to the circumstances and some of the political sensitivity, it is probably best that I was not able to do that. You saw what happened to my <a href=\"https://twitter.com/alansyeung/status/1121209484234448896\">tweet</a>; it just got way out of hand because people got too excited about it.</p><p id=\"BCiDMl\"><strong>NP: That’s true. Twitter is bad for everybody, and I think we can confidently agree on that. I know you’ve got to run, but my one gentle pushback to “the press was too negative” — I have been doing this a long time. The easiest way to get good press out of </strong><em><strong>The Verge</strong></em><strong> is to say you are going to do something and then do it. All of the perceived negativity here is because we heard about a lot of things that were going to happen that did not happen.</strong></p><p id=\"Ze4aQu\">Let me answer that as a closing here. I said this while talking with other media outlets: there are 100 things that Foxconn said they would do. If you don’t aim high, none of the 100 things are worth doing. And in the process of trying your best, putting in all your resources and making a commitment to do it, you get two or three things done. The outcome is a $185 billion company that’s spending around the world and that OEM brand names will work with any day if you ask them. </p><p id=\"MWITyD\"><strong>JD: But a lot of people in Wisconsin heard about the </strong><a href=\"https://www.theverge.com/c/21507966/foxconn-empty-factories-wisconsin-jobs-loophole-trump\"><strong>hundred things you promised to do and believed that they were real</strong></a><strong>. Whether or not Foxconn did two or three is up for debate, but they certainly felt that they were misled in what Foxconn promised to do.</strong></p><p id=\"Q1sfPn\">Whether they were misled by someone or by some organization, I cannot say unless they go on record to speak on it. I would look back and say it was still a positive experience. That was over $1 billion investment from the company, and another six hundred million-plus to come. If you look at the contract, they are getting less than 5 percent tax credit. This company continues to invest here, but they will look elsewhere if they get bad treatment and awful tax credits. There is other competition out there. </p><p id=\"VsxS05\">As a Wisconsinite, I would just urge everybody to take a look forward and say, “How can we win the next Intel project? How can we actually make sure people look at Wisconsin as a really good business environment for investment?” Not just because of a change of governorship, or because the press is always negative, or because we have a few people who actually decided not to move. Those were our choices. I understand it, and I am empathetic about that. Let’s move forward and actually do something positive. I would support <em>The Verge</em> to do the same. If you find three positive things for me, I will actually share that with you. If you actually want to confirm on things that are negative, I’ll do the same.</p><p id=\"XULf6r\"><strong>NP: I appreciate that. I promise you, we are going to track </strong><a href=\"https://www.theverge.com/2022/1/21/22894612/intel-ohio-chip-plant-20-billion-processor-shortage\"><strong>Intel in Ohio</strong></a><strong> just as close as we tracked Foxconn in Wisconsin.</strong></p><p id=\"kpxHiM\">Good for you. Intel is a great company and I congratulate them, and also Ohio for that deal. It will be good for them.</p><p id=\"E3mGl0\"><strong>NP: All right. Well, Alan, you have given us a lot of time. I have 10 million more questions, but it sounds like you have to put out this next book for us to get any of the answers. When is the next book coming out?</strong></p><p id=\"iOsOyc\">It will be this year, and again, it is going to be called <em>Wisconn Valley</em>. I will share a lot more facts beyond 2017.</p><p id=\"Q2l3eJ\"><strong>NP: Then we will have you back and we will talk about it.</strong></p><p id=\"M21EpK\">Thank you.</p><p class=\"c-end-para\" id=\"wNSeng\"><strong>NP: Thanks so much, Alan.</strong></p><aside id=\"b6at7b\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe now!\",\"url\":\"https://pod.link/decoder\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/s-938l_pHsDaMEneFhn78lnfMSA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397473/VRG_ILLO_Decoder_220418.jpg",
  "description": "How a Trump-endorsed plan overpromised and underdelivered",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}