{
  "title": "A geomagnetic storm may have effectively destroyed 40 SpaceX Starlink satellites",
  "url": "https://www.theverge.com/2022/2/8/22924561/spacex-starlink-satellites-geomagnetic-storm",
  "date": "2022-02-09T01:40:19.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"TOPSHOT-URUGUAY-SPACE-SPACEX-SATELLITE-STARLINK\" src=\"https://cdn.vox-cdn.com/thumbor/_jp1roY99CAfSnoadpINAxzzlTM=/0x27:4500x3027/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70486313/1231167449.0.jpg\" />        <figcaption>Photo by MARIANA SUAREZ/AFP via Getty Images</figcaption>    </figure>  <p id=\"E6g1pS\">Elon Musk’s satellite internet service Starlink just got dealt an expensive blow — <a href=\"https://www.spacex.com/updates/\">the company’s currently estimating</a> that 40 of the 49 Starlink satellites it launched on February 3rd will be destroyed because of a geomagnetic storm. </p><p id=\"lzWXHy\">The storm caused “up to 50 percent higher drag than during previous launches,” keeping the deployed satellites from reaching their proper orbit around the Earth. And while Starlink tried to fly them “edge-on (like a sheet of paper)” to reduce that drag, it now looks like as many as 40 of them will burn up in the Earth’s atmosphere instead of reaching their destinations. </p><p id=\"btEO08\">SpaceX <a href=\"https://spacenews.com/spacex-passes-2000-starlink-satellites-launched\">recently crossed the 2,000 satellite launch milestone</a>, and has plans to launch 12,000 if not a great many more — so losing 40 of them might not be a huge deal in the grand scheme of things. Still, that’s the vast majority of an entire Falcon 9 rocket’s Starlink launch capacity burning up in the atmosphere.</p><p id=\"frZCyQ\">Here the full SpaceX blog post for posterity:</p><blockquote><p id=\"YZFrEo\">On Thursday, February 3 at 1:13 p.m. EST, Falcon 9 launched 49 Starlink satellites to low Earth orbit from Launch Complex 39A (LC-39A) at Kennedy Space Center in Florida. Falcon 9’s second stage deployed the satellites into their intended orbit, with a perigee of approximately 210 kilometers above Earth, and each satellite achieved controlled flight.</p><p id=\"LSow5q\">SpaceX deploys its satellites into these lower obits so that in the very rare case any satellite does not pass initial system checkouts it will quickly be deorbited by atmospheric drag. While the low deployment altitude requires more capable satellites at a considerable cost to us, it’s the right thing to do to maintain a sustainable space environment.</p><p id=\"7fBSod\">Unfortunately, the satellites deployed on Thursday were significantly impacted by a geomagnetic storm on Friday. These storms cause the atmosphere to warm and atmospheric density at our low deployment altitudes to increase. In fact, onboard GPS suggests the escalation speed and severity of the storm caused atmospheric drag to increase up to 50 percent higher than during previous launches. The Starlink team commanded the satellites into a safe-mode where they would fly edge-on (like a sheet of paper) to minimize drag—to effectively “take cover from the storm”—and continued to work closely with the Space Force’s 18th Space Control Squadron and LeoLabs to provide updates on the satellites based on ground radars.</p><p id=\"B8YYK6\">Preliminary analysis show the increased drag at the low altitudes prevented the satellites from leaving safe-mode to begin orbit raising maneuvers, and up to 40 of the satellites will reenter or already have reentered the Earth’s atmosphere. The deorbiting satellites pose zero collision risk with other satellites and by design demise upon atmospheric reentry—meaning no orbital debris is created and no satellite parts hit the ground. This unique situation demonstrates the great lengths the Starlink team has gone to ensure the system is on the leading edge of on-orbit debris mitigation.</p></blockquote><p id=\"4BHWoM\">As you can see, SpaceX is taking this opportunity to tout how little its satellites impact the skies — something that’s been in question this past month, as <a href=\"https://www.wsj.com/articles/spacexs-starlink-satellites-are-photobombing-astronomy-images-study-says-11644062404\">a new study</a> furthers the concern that Starlink satellites are <a href=\"https://www.theverge.com/2020/3/24/21190273/spacex-starlink-satellite-internet-constellation-astronomy-coating\">leaving streaks across astronomers’ images</a> as they orbit, and could prevent us from identifying dangerous asteroids. Astronomers are forming <a href=\"https://www.iau.org/news/pressreleases/detail/iau2201/\">a “Centre for the Protection of the Dark and Quiet Sky from Satellite Constellation Interference”</a> to combat the issue.</p><aside id=\"ugXJQj\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The true impact of SpaceX’s Starlink constellation on astronomy is coming into focus\",\"url\":\"https://www.theverge.com/2020/3/24/21190273/spacex-starlink-satellite-internet-constellation-astronomy-coating\"},{\"title\":\"SpaceX’s new Starlink Premium tier promises up to 500Mbps for $500 a month\",\"url\":\"https://www.theverge.com/2022/2/2/22913921/spacex-starlink-premium-satellite-internet-faster-speed-expensive\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/ro4KQA9HsifhvM2ON5ZmmRH8zLI=/0x349:4500x2705/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23228240/1231167449.jpg",
  "description": "Premature atmospheric reentry",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}