{
  "title": "A hacker stole $625 million from the blockchain behind NFT game Axie Infinity",
  "url": "https://www.theverge.com/2022/3/29/23001620/sky-mavis-axie-infinity-ronin-blockchain-validation-defi-hack-nft",
  "date": "2022-03-29T17:58:31.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"Three non-NFT Sky Mavis “axie” characters\" src=\"https://cdn.vox-cdn.com/thumbor/fCB4NlnFGR_pJEXmirHYC1E6k5Y=/96x0:1784x1125/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70685892/Starter_Axies__3_.0.png\" />        <figcaption>Sky Mavis</figcaption>    </figure>  <p id=\"jUGjmT\">Roughly $625 million worth of cryptocurrency has been stolen from Ronin, the blockchain underlying popular crypto game <em>Axie Infinity</em>. Ronin and <em>Axie Infinity</em> operator Sky Mavis <a href=\"https://roninblockchain.substack.com/p/community-alert-ronin-validators?s=w\">revealed the breach</a> on Tuesday and froze transactions on the Ronin bridge, which allows depositing and withdrawing funds from the company’s blockchain. </p><p id=\"1iGmD7\">Sky Mavis says it’s working with law enforcement to recover 173,600 Ethereum (currently worth around $600 million) and 25.5 million USDC (a cryptocurrency pegged to the US dollar) from the culprit, who withdrew it from the network on March 23rd. The attack focused on the bridge to Sky Mavis’ Ronin blockchain, an intermediary between <em>Axie Infinity</em> and other cryptocurrency blockchains like Ethereum. Users could deposit Ethereum or USDC to Ronin, then purchase non-fungible token items or in-game currency, or they could sell their in-game assets and withdraw the money.</p><p id=\"qW8d6t\">According to Sky Mavis, an attacker used hacked private security keys to compromise the network nodes that validate transfers to and from the Ronin blockchain. That let the attacker quietly withdraw large quantities of Ethereum and USDC. The transfer was discovered today — nearly a week later — when another user attempted to withdraw 5,000 Ethereum through the bridge.</p><div class=\"c-float-right\"><aside id=\"U6jfCC\"><q>“As we’ve witnessed, Ronin is not immune to exploitation”</q></aside></div><p id=\"6sUtaP\">Sky Mavis says the “axie” NFT tokens players must buy to access <em>Axie Infinity</em> haven’t been compromised, nor have the SLP and AXS in-game cryptocurrencies used in battling and breeding the pokémon-like cartoon axolotls. (Disclosure: Adi purchased three axies for a total of $105 last month in order to report on the game; axies currently sell starting at around $25 apiece.) But the freezing of withdrawals and deposits effectively locks out many new players, and the hack leaves the fate of other user funds on the Ronin blockchain in question. Sky Mavis says it’s “working with law enforcement officials, forensic cryptographers, and our investors to make sure there is no loss of user funds,” calling that its “top priority.”</p><p id=\"4lCyC7\">Validator nodes are a feature of proof-of-stake blockchains like Ronin, which are less energy intensive than proof-of-work systems like Bitcoin and Ethereum. The nodes review new transactions to confirm that their inputs and outputs match and that authorization signatures are valid, rejecting any transactions that don’t conform. Using a smaller number of nodes is faster and more efficient — but as the hack shows, it can create security risks if a majority of the nodes are compromised. It’s a potential vulnerability for blockchains that are touted as both cheaper and more environmentally friendly than Ethereum.</p><div class=\"c-float-right\"><aside id=\"YTsShS\"><q>Validator nodes are a key feature of less energy-intensive blockchains</q></aside></div><p id=\"wUkalo\">According to Sky Mavis, the Ronin attack was possible partly because of a shortcut the company had taken to relieve an “immense user load” on its network in November of last year — months after the game <a href=\"https://restofworld.org/2021/axie-infinity/\">exploded in popularity in the Philippines</a> and other countries where players relied on it as a full-time job. The system was discontinued in December, but the permissions that allowed it were never revoked. In addition to compromising four of Sky Mavis’ own nodes, the attacker exploited them to get access to one managed by the community-owned Axie DAO. After compromising five of the nine validator nodes, the attacker could effectively override any transaction security and withdraw whatever funds they liked.</p><p id=\"TQEsRA\">Sky Mavis says it will increase the required number of nodes to eight for transactions, and it will reopen the Ronin bridge “at a later date” once it’s certain no more funds can be drained. For now, the Ronin breach appears to be the largest hack to date of “decentralized finance” networks, coming on the heels of <a href=\"https://www.businessinsider.in/investment/news/hackers-stole-322-million-in-2022s-largest-defi-hack-so-far-10-million-is-being-offered-for-its-return/articleshow/89324200.cms\">a $322 million theft</a> from the bridge protocol Wormhole last month.</p><p id=\"tEkRF7\">“As we’ve witnessed, Ronin is not immune to exploitation and this attack has reinforced the importance of prioritizing security, remaining vigilant, and mitigating all threats,” the company said in its announcement. “We know trust needs to be earned and are using every resource at our disposal to deploy the most sophisticated security measures and processes to prevent future attacks.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/cBrO9rsRxqE-vgB6eR7sJnef1mI=/0x78:2000x1125/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23353145/Starter_Axies__3_.png",
  "description": "The theft was discovered nearly a week later.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}