{
  "title": "A new Steam Deck update adds one of the most-requested features ",
  "url": "https://www.theverge.com/2022/5/11/23067870/steam-deck-update-per-game-performance-profiles",
  "date": "2022-05-12T00:45:46.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/54zMARL-ho9SO6Kp-xbzU0QxFAU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70859279/vpavic_220210_5030_0087.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"kpl4Bu\">The coolest feature of the <a href=\"https://www.theverge.com/22960536/steam-deck-faq-valve-one-month-later\">Steam Deck</a> — bar none, if you ask me — is how the portable gaming PC lets you get the absolute most from its AMD RDNA 2 graphics and 40 watt-hour battery. As of <a href=\"https://www.theverge.com/23047412/valve-steam-deck-fan-tape-fix-noise-whine\">the last update</a>, you could lower the screen’s refresh rate to <em>increase</em> your effective framerate and lower latency, and you’ve been able to throttle the CPU, GPU and frame limiter since launch. The catch: even if you figured out a great combination that gave you the battery life and/or performance you crave, the Steam Deck wouldn’t <em>save</em> those settings per game. </p><p id=\"wVmYPR\">You’d have to memorize them, and flick the toggles appropriately, every time you switched to a different game. That changes today. </p><p id=\"C2s4P4\"><a href=\"https://steamcommunity.com/app/1675200/eventcomments/3270187589544872959\">Wednesday’s update</a> now comes with per-game performance settings, letting you flick a single switch in the Quick Access menu to set a custom performance profile for each of your games. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lwxxGyXLtksN6oGaE4m9Te59S7o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454774/PXL_20220511_235634248.MP.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption>You no longer need to manually set 40/40 every time you launch <em>Elden Ring, if that’s your cup of tea.</em></figcaption>  </figure><p id=\"ZOtt6T\">Flick it off, and you’ll be back to your global system settings, so you can have both a “generally I like my games running at 30fps” setting but also “<em>Elden Ring</em> should run at 40fps with a 40Hz refresh rate” and “<em>Vampire Survivors </em>should run at 10fps and 5 watts because I want to play it for the entirety of this car ride” if you wish. </p><p id=\"m5DnC6\">This has been one of the most-requested Steam Deck features since the beginning, and I’m hoping there’s more to come — because it <em>doesn’t</em> let you set multiple profiles (like one profile when you’re plugged into AC power, and another for the longest battery life you can manage), or save and share profiles with the larger community so that we Power Users can help the less-tweak-happy among us get their games running better. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bnNjt7N-oLOo4ZhTjEaYlfEOnBE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454776/PXL_20220511_235750289.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Your global performance profile isn’t going away, either.</em></figcaption>  </figure><p id=\"Eb7vM4\">(Valve already showed us how powerful that can be with community controller profiles — a big reason many ancient games were immediately playable on the Steam Deck is because users were encouraged to upload configurations for the Steam Controller back in the day.)</p><p id=\"0fRmPK\">I suspect Valve is very aware of this, and that today’s update lays the groundwork for that as well. Because while the Steam Deck still might <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">not be ready</a> for everyone who might pick up a Nintendo Switch, update after <a href=\"https://www.theverge.com/2022/4/25/23041969/valve-steam-deck-lock-screen-update\">update</a> has shown Valve is listening closely and intently to power user feedback.</p><p id=\"6LgLhN\"><em>Digital Foundry </em>recently did <a href=\"https://www.youtube.com/watch?v=GF8NzlBiaOM\">an excellent look</a> at how the previous update’s adjustable refresh rate and fan curve let you get more out of the Steam Deck. I’m embedding a copy below for your viewing pleasure.</p><div id=\"YRkUrf\"><div ><iframe src=\"https://www.youtube.com/embed/GF8NzlBiaOM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"S9aNjd\">You can read <a href=\"https://steamcommunity.com/app/1675200/eventcomments/3270187589544872959\">the full Steam Deck changelog here</a>. The rest is mostly bugfixes, though you can also now hold down the power button to “stop streaming” a game, and Valve moved the haptics and rumble toggles away from the Quick Access menu. That’s a change I actually disagree with; they came in handy when an older game (can’t remember which) was really overzealous with the vibrations.</p><aside id=\"FAvWRr\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Valve says you shouldn’t fix the Steam Deck’s noisy fan this way\",\"url\":\"https://www.theverge.com/23047412/valve-steam-deck-fan-tape-fix-noise-whine\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/3kH_yv0cFFYRPe3TbrUg20yiwUg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270008/vpavic_220210_5030_0087.jpg",
  "description": "Per-game performance profiles are here",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}