{
  "title": "A new free app makes using iPads easier for people with hand tremors",
  "url": "https://www.theverge.com/2022/4/13/23024029/staybl-ipads-hand-tremors-parkinsons-disease",
  "date": "2022-04-13T20:04:46.000Z",
  "author": "Sheena Vasani",
  "content": "      <figure>      <img alt=\"Using split screen to watch a video in YouTube and read an article in Safari on the 2022 iPad Air\" src=\"https://cdn.vox-cdn.com/thumbor/SQOqkvFuJmJV41U0GKsp2meNUJI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745955/akrales_220314_5071_0362.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"tp0eRn\">A <a href=\"https://apps.apple.com/app/staybl/id1610352658\">new free app called Staybl</a> uses existing technologies in the iPad to <a href=\"https://gizmodo.com/staybl-makes-reading-easier-for-ipad-users-with-hand-tr-1848776672\">make it easier</a> to use for those dealing with involuntary hand tremors because of conditions like Parkinson’s disease.</p><p id=\"T1lKFb\">Global advertising company Havas Creative’s offices in New York and Germany created the app after two years of work with experts from the German Parkinson’s Association and Parkinson’s patients in Germany and the US.</p><p id=\"8jEfMF\"><a href=\"https://www.adweek.com/agencies/havas-develops-app-to-help-people-with-tremors-use-tablets/\">Their goal</a> is to improve access to technology for those dealing with Parkinson’s disease and other health issues that cause tremors. While the app is currently only available for use on Apple’s iPad, its creators aim to bring it to other digital devices and platforms in the future. </p><p id=\"kgrdPN\">“We always talk about how technology should improve our lives, but we don’t naturally include everyone in those benefits,” said Eric Schoeffler, the chief creative officer of Havas in Germany. “Staybl is not a medicine, nor is it a cure. However, it’s a technological solution that can provide easier access to the digital world for all people with Parkinson’s and tremors,” Schoeffler added.</p><p id=\"CHWXt7\">Tremors are one of the earliest symptoms of <a href=\"https://www.nia.nih.gov/health/parkinsons-disease\">Parkinson’s disease</a>, an incurable neurodegenerative disorder affecting the central nervous system. Over time, these tremors — which commonly affect the hands — can make it difficult to perform simple tasks, like putting on clothes or using mobile devices, and can impact a person’s overall quality of life.</p><p id=\"7ULimC\">However, using the iPad’s accelerometer, Staybl can detect when the device is shaken because of tremors and then immediately respond by moving its on-screen web browser in the opposite direction. This stabilizes the screen so the user can easily view the web page and hold the device steady.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XOo8Cvu8Ya1WratTN7jdln1x7uw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387917/Staybl.png\">      <cite>Image: Staybl</cite>      <figcaption><em>Staybl’s browser makes it easier to surf the web more steadily.</em></figcaption>  </figure><p id=\"reYXpd\">In addition, the app’s browser also comes with other features to make using the iPad easier for those dealing with hand tremors. For instance, it gets rid of swipe and slide gestures for navigation, provides larger buttons that are easier to press, and offers customizable settings to accommodate tremor symptoms that may vary throughout the day.</p><p id=\"gfeZ5l\">You can <a href=\"https://apps.apple.com/app/staybl/id1610352658\">download the free app through the App Store</a>, though it’s only currently compatible with iPads running iPadOS 14 or later.</p><p id=\"IuOetJ\">Staybl is one of many solutions tech companies have developed over the years to help those dealing with Parkinson’s-related hand tremors. Liftware, for instance, <a href=\"https://www.theverge.com/2013/9/23/4761182/liftware-spoon-helps-parkinsons-sufferers-control-their-tremor\">created an electric spoon</a> to help those with the condition feed themselves more steadily. Its microchip and sensors can detect tremors, prompting the spoon to move in the opposite direction and thus cancel out the movements.</p><aside id=\"S11iUj\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Parkinson’s meds are hard to grab, so TikTok users crowdsourced a solution\",\"url\":\"https://www.theverge.com/2021/1/23/22244673/parkinsons-tiktok-crowdsourced-pill-bottle\"},{\"title\":\"How a teen punk led a movement for disabled people online\",\"url\":\"https://www.theverge.com/22583848/disabled-teen-cripple-punk-media-representation\"}]}'></div></aside><p id=\"sDrihc\">Apple may also be looking into how to steady an iPhone’s display when the mobile device user’s hands are shaking, <a href=\"http://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&amp;Sect2=HITOFF&amp;u=%2Fnetahtml%2FPTO%2Fsearch-adv.html&amp;r=19&amp;p=1&amp;f=G&amp;l=50&amp;d=PG01&amp;S1=(apple.AANM.+AND+20191017.PD.)&amp;OS=aanm/apple+and+pd/10/17/2019&amp;RS=(AANM/apple+AND+PD/20191017)\">a patent application</a> published by the US Patent and Trademark Office in 2019 revealed. It appears the tech giant was considering using dynamic image stabilization circuity and motion sensors to counteract sudden movements, so the system can shift on-screen content back to the display’s center whenever there are tremors.</p><p id=\"xjPBY6\">These are on top of a few existing features Apple already offers — some of which the company has listed on the <a href=\"https://www.apple.com/accessibility/mobility/\">accessibility portion of its website</a> — that could make using mobile devices a little easier for those dealing with hand tremors. For example, Apple offers a “Hold direction” setting located under “Touch Accommodations Control” on the iPhone, iPad, Apple Watch, HomePod, and iPod Touch. That makes it possible for users to set the length of time their fingerprint needs to touch the screen before the phone recognizes and processes it.</p><aside id=\"pQl9JH\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Twitter rolls out its ALT badge and improved image descriptions\",\"url\":\"https://www.theverge.com/2022/4/7/23015669/twitter-alt-badge-improved-image-descriptions-accessibility\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/iMBTS_5mcuPPCftAsHIA6NXuV74=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318513/akrales_220314_5071_0362.jpg",
  "description": "It uses the iPad’s accelerometer to detect movements.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}