{
  "title": "A new Yo! MTV Raps is coming to Paramount Plus",
  "url": "https://www.theverge.com/2022/5/2/23053870/yo-mtv-raps-paramount-plus",
  "date": "2022-05-02T20:05:45.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LqX5Th_V-ZqM3Am3o317lPXy_3c=/230x0:7963x5155/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70823981/YOMTVRAPS_Conceited_and_DJ_02212022_AJ_01150_R.0.jpeg\" />        <figcaption>Conceited and DJ Diamond Kuts. | Paramount Plus</figcaption>    </figure>  <p id=\"z102pp\"><a href=\"https://www.vulture.com/2018/06/how-yo-mtv-raps-changed-hip-hop.html\"><em>Yo! MTV Raps</em></a> played an instrumental role in turning rap music into one of the most influential art forms of the 20th century and <a href=\"https://www.vulture.com/2018/06/how-yo-mtv-raps-changed-hip-hop.html\">shaping the trajectory of the music industry</a> in ways that are still being felt today. There’s no way another show could recapture the magic that turned the original <em>Yo! MTV Raps</em> into a cultural phenomenon, but Paramount Plus is going to give it a shot with an all-new revival built around some of the biggest names currently in the game.</p><p id=\"kt69zI\">Today, Paramount Plus announced the upcoming premiere of its new incarnation <em>Yo! MTV Raps</em>, a “comprehensive deep dive into the current state of hip hop” hosted by DJ Diamond Kuts and rapper Conceited. Like the original show, the new <em>Yo! MTV Raps </em>will feature a variety of segments and interviews with artists as well as performances — both live and recorded. From the looks of the trailer, where guests like JID, Saba, and IDK are featured, the new show’s putting a particular focus on in-studio performances rather than sending its hosts out to meet artists where they’re at the way Fab 5 Freddy used to back in the ’80s.</p><p id=\"TAzP3b\">While <em>Yo! MTV Raps</em>’ structure may have some impact on the show’s success, what’s likely going to end up determining whether it takes off after its May 24th premiere is how much heat the guests decide to bring.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rY5K9B1dBmKcKiLbglYJb5esLrI=/0x434:8192x4723/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23433472/YOMTVRAPS_Conceited_and_DJ_02212022_AJ_01150_R.jpeg",
  "description": "Rapper Conceited and DJ Diamond Kuts to host Paramount Plus’ Yo! MTV Raps revival",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}