{
  "title": "A new John Harris art book will capture more of his dreamlike sci-fi landscapes",
  "url": "https://www.theverge.com/2022/3/25/22994748/john-harris-art-book-into-the-blue",
  "date": "2022-03-25T14:15:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uSVfVBjBjh8aAkrEyWq_0C07NdA=/77x0:1262x790/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70671195/The_Art_of_John_Harris___Into_the_Blue___sales_cover_copy.0.jpg\" />        <figcaption>Image: Titan Books</figcaption>    </figure>  <p id=\"IiKnti\">Legendary artist John Harris is best-known for his almost ethereal paintings of science fiction landscapes — and soon, there will be a new collection of his work for fans to dig into. Titan Books has announced <em>The Art of John Harris II: Into the Blue</em>, a hardcover book curating decades of work from the 73-year-old painter. The new collection will focus on his more futuristic paintings, as well as give readers a behind-the-scenes look at how certain projects went from sketch to completed work.</p><p id=\"PepRdJ\">Some of Harris’ most iconic work includes book covers for the likes of Isaac Asimov to Jack Vance. And despite having a very distinct and surreal style — he says ideas come to him through meditation and lucid dreaming — <a href=\"https://www.theverge.com/2014/5/30/5761438/john-harris-sci-fi-art\">Harris previously told <em>The Verge</em></a> that he doesn’t consciously paint a specific way. </p><div id=\"3iKvhX\"><div data-anthem-component=\"gallery:11112312\"></div></div><p id=\"TQBtCK\">“It always puzzles me when this issue of style comes up because I don’t consciously have a style,” he explains. “This is not being disingenuous. I simply try to paint what is in my mind’s eye. If people recognize my style, maybe what they are seeing is simply a feeling or vision that is personal to me. Maybe that is why it appears to withstand fashion — because it isn’t a fashion.” (Harris previously released a collection with Titan called <a href=\"https://titanbooks.com/7143-the-art-of-john-harris-beyond-the-horizon/\"><em>Beyond the Horizon</em></a> in 2014.)</p><p id=\"FYsYe6\"><em>Into the Blue</em> will be available on October 11th, 2022. You can check out a selection of his work from <em>Beyond the Horizon</em> in the gallery above and get a glimpse at the new collection’s cover below.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZpfqaHNRDOKY-_kf-o70GC_xRrM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342654/2.jpg\">      <cite>Image: Titan Books</cite>  </figure>",
  "image": "https://cdn.vox-cdn.com/thumbor/RSdGFlziDJM9k8jIH7osEaqmAqI=/0x45:1338x746/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23342639/The_Art_of_John_Harris___Into_the_Blue___sales_cover_copy.jpg",
  "description": "Paintings from a surreal future.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}