{
  "title": "A new standard could let companies build processors out of Lego-like chiplets",
  "url": "https://www.theverge.com/2022/3/2/22958049/ucie-chiplet-standard-processors-soc-intel-tsmc-samsung-arm",
  "date": "2022-03-02T17:10:39.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YgfiIU9a5fllx9yqkrLOAtISqFI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70570339/acastro_210430_1777_semiCon_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"HSbz6W\">The world’s biggest chipmakers are coming together to create a new <a href=\"https://www.uciexpress.org/\">Universal Chiplet Interconnect Express (UCIe) system</a> for integrating chiplets together in future semiconductor designs. </p><p id=\"TcTKsz\">Virtually every major name in processor technology is onboard with the <a href=\"https://www.businesswire.com/news/home/20220302005254/en/Leaders-in-Semiconductors-Packaging-IP-Suppliers-Foundries-and-Cloud-Service-Providers-Join-Forces-to-Standardize-Chiplet-Ecosystem\">standardization effort</a>, including foundry owners like Intel, TSMC, and Samsung and major players in semiconductor-adjacent spaces, like AMD, Arm, Qualcomm, Meta, Google Cloud, and Microsoft.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/acDmFpttVJLrGmxnpcCNgIn_lLs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23282997/Untitled.png\">  </figure><p id=\"GqNcMW\">As the name alludes, UCIe is aiming to take the same broad ecosystem model PCIe (peripheral component interconnect express) has used for years, expanded over to chiplets— tiny, more specialized chips that only do a few specific functions. </p><p id=\"LJqDeB\">The goal with UCIe is to create a standard for connecting chiplets together, making it easier for companies to mix and match different chiplet components when building SoCs. The idea is that tech companies will be able to simply slot in different chiplet components into their designs, similar to how you can simply slot in any PCIe compatible accessory to your computer (regardless of the individual companies that made each part). </p><p id=\"HjUi1P\">Broadly speaking, there are two ways to make a modern system-on-a-chip (SoC). Integrated monolithic chips, the most traditional method, pack all the bits and pieces of a semiconductor into a single printed piece of silicon. </p><div class=\"c-float-right\"><aside id=\"tkbRRk\"><q>A new standard for building better chips out of chiplets</q></aside></div><p id=\"smgYiO\">Chiplets take a different approach. Instead of making one big chip with all the components on it, chiplets break things up into smaller components that are then combined into a larger processor. </p><p id=\"ZhdgxI\">There are a few benefits to the chiplet system. Chiplets can lead to less waste (for example, if a core doesn’t work, it’s easier to throw away one of two eight-core chiplets than it is to lose a full 16-core monolithic chip). There are also benefits in chip design, allowing companies to shrink down critical components (like CPU cores) to new, smaller processing nodes without having to shrink down the entirety of the SoC to match. Lastly, combining chiplets together lets companies make bigger chips than they could with a single, monolithic design. </p><p id=\"ulTDGq\">AMD’s recent Zen 2 and Zen 3-based Ryzen chips are some of the most prominent examples of modern chiplet designs: each Zen 3 processor, for example, is made out of 7nm eight-core chiplets for the CPU / GPU components from TSMC, combined with an I/O chiplet built on older nodes from GlobalFoundries.</p><p id=\"29lFVG\">The UCIe project is still very much in the early stages, though. Right now, the standardization process is focused on establishing rules for interconnecting chiplets together into broader packages. But there are plans to create a UCIe industry organization that will eventually help define next-generation UCIe technology, including “chiplet form factor, management, enhanced security, and other essential protocols” in the future. </p><p id=\"IbGcBU\">That means that there could one day be an entire chiplet ecosystem that would let companies build a custom SoC by shopping around for different components to suit their needs — just like you’d build a gaming PC. And that’s a big benefit for companies like AMD or Qualcomm as they look to design and build even more powerful and complex chips going forward (which, in turn, is good motivation for foundries like TSMC and Samsung to get on board, too.) </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/y9pZ-z0o32IqHSg1fi5UKJRIMnI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22481672/acastro_210430_1777_semiCon_0001.jpg",
  "description": "Making chiplets work better across the industry",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}