{
  "title": "A phone relay capture may be the latest of Russia’s communications woes in Ukraine",
  "url": "https://www.theverge.com/2022/3/15/22979381/phone-relay-capture-russia-military-unencrypted-communications-ukraine",
  "date": "2022-03-15T17:56:47.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NevXPdtEYpUQhOG52OtGwuG79UQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70626295/VRG_Illo_STK010_K_Radtke_Russia_Glitch.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"b0izps\">In the latest communications setback to hit the Russian military, the Security Service of Ukraine (abbreviated as SBU) claims to have captured a hacker who was helping to provide communications services for Russian troops inside Ukrainian territory, <a href=\"https://www.vice.com/en/article/v7djda/ukraine-arrests-hacker-routing-calls-for-russian-troops\">VICE reports</a>.</p><p id=\"kcooWM\">The SBU shared details in a <a href=\"https://twitter.com/ServiceSsu/status/1503642820527239169\">tweet</a> and Telegram message posted at around 10AM local time (4AM ET), including pictures alleged to show the hacker and their communications system, though the reports have not been independently confirmed.</p><p id=\"oV7QB5\">According to the SBU’s Telegram post, the hacker was helping to route calls from within Russia to the mobile phones of Russian troops in Ukraine, and also sending text messages to Ukrainian security officers and civil servants proposing they surrender.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jebzPXlxuv3bPQz6_FqlT-jYiLM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23318008/RussianComms3.jpeg\">      <cite>Photo: Ukrainian Security Services via Twitter</cite>      <figcaption><em>The computer workstation of an alleged hacker said to be supporting Russian troops in Ukraine.</em></figcaption>  </figure><p id=\"2XsBod\">Images shared by the SBU claim to show hardware and software being used for these activities, and appear to be consistent with a relay system for voice and SMS communications.</p><p id=\"9JOPcs\">In a <a href=\"https://twitter.com/mcdaidc/status/1503697414301044739\">tweet thread</a>, Cathal Mc Daid, CTO at Adaptive Mobile Security, explained the devices used and their significance. Mc Daid said that the system was comprised of a SIM box server that could switch among 128 different SIM cards, paired with GSM gateways for connecting voice calls and SMS messages to a local mobile network, and unknown software to handle messaging and call forwarding.</p><p id=\"vWEOnI\">Mc Daid also said such systems were unreliable and should not be used for military communications.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uVJC8ANYAQGHCPgfTD1B2vQjPWg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23318013/RussianComms2.jpeg\">      <cite>Photo: Ukrainian Security Services via Twitter</cite>      <figcaption><em>A recovered SIM box and hardware devices.</em></figcaption>  </figure><p id=\"DXVuNy\">The use of insecure, civilian-grade communications systems now seems par for the course for Russian troops operating in Ukraine. Since the invasion began, numerous reports have emerged of Ukrainian security forces intercepting messages sent between Russian military units, a feat made possible by the lack of encryption on Russian communications.</p><p id=\"5QpavQ\">Early on in the invasion, Russian troops reportedly <a href=\"https://news.sky.com/story/russians-reportedly-take-out-own-secure-communications-system-during-kharkiv-assault-12560577#\">reduced their own ability to use encrypted phone handsets</a> by destroying local 3G and 4G masts, knocking out the mobile data networks that the phones rely on. With the Russian military relying on unencrypted comms, Ukrainian intelligence services were able to intercept sensitive communications and in some cases broadcast them to the world — as happened with reports of the <a href=\"https://www.theguardian.com/world/2022/mar/08/vitaly-gerasimov-second-russian-general-killed-ukraine-defence-ministry-claims\">death of Russian general Vitaly Gerasimov</a>.</p><p id=\"THjE5T\">Images from the conflict that were shared on social media also suggested that in some cases Russian troops were <a href=\"https://defence-blog.com/russian-soldiers-uses-chinese-portable-radios-during-kremlins-invasion-of-ukraine/\">using unencrypted handheld radios</a> for battlefield communications. The Russian Ministry of Defense previously implied that it had issued encrypted tactical radios to the majority of the Russian armed forces, but analysts at the Royal United Services Institute (a British defense and security think tank) observed there are indications that the <a href=\"https://rusi.org/explore-our-research/publications/commentary/russian-comms-ukraine-world-hertz\">delivery of the radios has been hampered by corruption</a>.</p><p id=\"qHCGD6\">The outdated and poorly maintained nature of Russian communications devices also appears to be mirrored by the condition of much of the heavy equipment being used by the Russian military, even as troops embark on crucial military operations like the assault on the Ukrainian capital, Kyiv. <a href=\"https://www.washingtonpost.com/world/2022/03/15/ukraine-kyiv-russia-war/\">Reporting from the battlefield</a> by the Washington Post indicates that some of the Russian tank units are operating Soviet-era T-72 vehicles, a model first produced more than 50 years ago.</p><p id=\"9L21sJ\">However, in spite of many technical and logistical glitches, Russian forces heavily outnumber the Ukrainian military, and show no signs of lessening their assault as the war <a href=\"https://www.vox.com/22970918/russia-war-in-ukraine-explained\">pushes into a dangerous new phase</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/f7KJr2aheHc7wDPf0i8I7FXDIG0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268168/VRG_Illo_STK010_K_Radtke_Russia_Glitch.jpg",
  "description": "Sensitive messages have been intercepted since the conflict began.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}