{
  "title": "A pig virus may have contributed to the death of first pig heart transplant patient",
  "url": "https://www.theverge.com/2022/5/6/23060519/pig-virus-heart-transplant-xenotransplantation",
  "date": "2022-05-06T20:56:19.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WD2521Pp-GYbz5agjryI8AI-PnM=/40x0:5004x3309/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70841327/GettyImages_BA4628_001.5.jpg\" />        <figcaption>Photo by Gary John Norman via Getty Images</figcaption>    </figure>  <p id=\"GrhTNf\">A preventable infection by a porcine virus might have contributed to the death of the first patient to have a heart transplant with a pig organ, <a href=\"https://www.technologyreview.com/2022/05/04/1051725/xenotransplant-patient-died-received-heart-infected-with-pig-virus/\"><em>MIT Technology Review </em>reported this week</a>.</p><p id=\"Fl4NuZ\">David Bennett Sr, who had severe heart disease, received a genetically modified pig heart in early January of this year — a major milestone in animal-to-human transplants, or xenotransplantation. He <a href=\"https://www.theverge.com/2022/3/9/22968956/pig-heart-transplant-patinet-dies-xenotransplantation\">died in March</a>. Initially, the hospital where the procedure was performed said that the cause of death was unknown. </p><p id=\"Ou18QU\">But last month, Bennett’s transplant surgeon <a href=\"https://www.technologyreview.com/2022/05/04/1051725/xenotransplant-patient-died-received-heart-infected-with-pig-virus/\">said in a webinar</a> that the heart was infected with porcine cytomegalovirus, a virus that doesn’t infect human cells but can damage the organ. Virus-free hearts transplanted into baboons survived much longer than virus-infected hearts, according to a German <a href=\"https://pubmed.ncbi.nlm.nih.gov/33067513/\">study.</a>  </p><p id=\"DTUfda\">Bennett received a heart from biotechnology company Revivicor, which produces genetically modified pigs. They’re supposed to be free of viruses, but this particular virus can be hard to detect, Joachim Denner, a virologist at the Free University of Berlin, <a href=\"https://www.technologyreview.com/2022/05/04/1051725/xenotransplant-patient-died-received-heart-infected-with-pig-virus/\">told <em>MIT Technology Review</em></a>. The company declined to comment to <em>MIT Technology Review</em> about the heart and the virus. </p><p id=\"nsHS5l\">It’s still unclear how big of a role the virus played in Bennett’s death. But if he died because of the virus — and not because his body rejected the organ — groups working on xenotransplantation likely won’t have to rethink their overall strategy. “If this was an infection, we can likely prevent it in the future,” Bartley Griffith, the transplant surgeon, said during his presentation<em>.</em></p><p id=\"KI2BVq\"></p><p id=\"bTtfvW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DLug1qFygIEqgurdROnw42VhQVI=/0x250:5004x2870/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23443712/GettyImages_BA4628_001.jpg",
  "description": "It’s something researchers could prevent in the future.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}