{
  "title": "A ransomware group paid the price for backing Russia",
  "url": "https://www.theverge.com/2022/2/28/22955246/conti-ransomware-russia-ukraine-chat-logs-leaked",
  "date": "2022-02-28T22:11:46.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vfLRT9C-P1yE84rnnOT-zy2Zmto=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70562282/VRG_ILLO_STK001_carlo_cadenas_cybersecurity_virus.0.jpg\" />        <figcaption>Illustration by Carlo Cadenas / The Verge</figcaption>    </figure>  <p id=\"AkMFBX\">As Russia’s invasion of Ukraine enters its fifth day, a coalition led by the US and Europe has mounted a coordinated response focused on <a href=\"https://www.theverge.com/2022/2/26/22951307/us-sanctions-russia-vk-ceo-vladimir-kiriyenko\">financial sanctions</a> and, increasingly, military aid. While the conflict grows in scale and intensity, organizations far beyond the apparatus of military and government are being drawn in — including ransomware groups active in Russia and Ukraine. </p><p id=\"CN8PDq\">That gravitational pull is particularly fraught in Russia, where the borders between hackers and the Russian intelligence services are sometimes porous, and one group in particular has been made to pay for its allegiance to the Putin regime. </p><p id=\"ntQDJ9\">On Friday, the notorious ransomware gang Conti surprised many observers by explicitly casting its lot with Putin’s military agenda, <a href=\"https://twitter.com/BrettCallow/status/1497249143663652865\">declaring “full support”</a> for the Russian government and threatening to mount attacks on critical infrastructure of any adversaries launching cyberattacks against Russia.</p><div id=\"BMSOgr\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Conti <a href=\"https://twitter.com/hashtag/ransomware?src=hash&amp;ref_src=twsrc%5Etfw\">#ransomware</a> operation sides with Russia and threatens attacks on critical infrastructure. <a href=\"https://t.co/L8E7lEW1MJ\">pic.twitter.com/L8E7lEW1MJ</a></p>— Brett Callow (@BrettCallow) <a href=\"https://twitter.com/BrettCallow/status/1497249143663652865?ref_src=twsrc%5Etfw\">February 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"Yg7vjd\">Two days later, on February 27th, Conti’s posturing came to backfire spectacularly when an anonymous individual leaked a cache of chat logs from the organization, revealing a huge amount of previously unpublished information about the ransomware group’s internal workings.</p><p id=\"Rt1WkD\">The leaked data contains over a year’s worth of chat logs from the open-source instant messaging service Jabber, containing messages between at least <a href=\"https://intelx.io/?did=51fbf19b-91f5-4d2d-b4e7-504477ebe916\">20 chat handles</a> presumed to belong to members of the gang. Among other things, these logs seem to confirm a chain of command linking Conti to Russian intelligence agencies. According to Christo Grozev, executive director of open-source intelligence research group Bellingcat, the chat logs show that members of Conti <a href=\"https://twitter.com/christogrozev/status/1498386621657493510\">tried to hack a Bellingcat contributor</a> on the orders of Russia’s main internal security service, the FSB.</p><p id=\"u8txNm\">Russia has been widely criticized for harboring cybercriminal groups in the past, and with certain exceptions — notably the public <a href=\"https://www.theverge.com/2022/1/14/22883675/russia-fsb-revil-hacker-group-ransomware-us-request-fbi-doj\">takedown of the REvil hacker group</a> by the FSB in January — they are largely allowed to operate with impunity provided they refrain from attacking domestic targets. But while proximity to the Russian government has been an advantage for cybercriminals in the past, there are some signs that the dynamics of the Ukraine invasion are turning it into a liability.</p><p id=\"zkmXMg\">Though the identity of the leaker has not been revealed, Alex Holden, the Ukrainian-born founder of cybersecurity company Hold Security, said that the logs had been leaked by a Ukrainian security researcher who had managed to infiltrate the Conti gang.</p><p id=\"BVMvEH\">“This is a Ukrainian citizen, a legitimate cybersecurity researcher, who is doing this as part of his war against cybercriminals who support the Russian invasion,” Holden said. Further details of the leaker’s identity could not be disclosed without risking his safety, Holden said.</p><div class=\"c-float-right\"><aside id=\"R6t7Di\"><q>“This is a Ukrainian citizen ... who is doing this as part of his war against cybercriminals who support the Russian invasion”</q></aside></div><p id=\"xtvfRx\">The Record also <a href=\"https://therecord.media/conti-ransomware-gang-chats-leaked-by-pro-ukraine-member/\">reports</a> that the chat logs contain Bitcoin addresses where payments made to the Conti gang were received, and messages detailing negotiations between Conti and companies that had not disclosed a ransomware incident.</p><p id=\"Gi0dwH\">Bill Demirkapi, a security researcher who published a version of the logs <a href=\"https://twitter.com/BillDemirkapi/status/1498107736759881728\">translated into English</a> via Google, confirmed to <em>The Verge</em> that the logs contained details of Conti’s technical infrastructure, logistical operations, discussions of zero-day vulnerabilities, and details about internal tooling. Given the short timeline since the release of the logs, Demirkapi said, it was hard to assess the long-term impact it would have on the group.</p><p id=\"BhVM7l\">Although many of the most prolific ransomware groups are considered to be aligned with Russia, in practice, many of them are transnational entities and include a diversity of ethnicities and nationalities, said Chester Wisniewski, principal research scientist at Sophos. With international opinion overwhelmingly favoring Ukraine, many of them may have decided to steer clear of the conflict rather than declare support for the Russian invasion.</p><p id=\"4d7asD\">“The polarizing nature of this conflict — which effectively seems to be the whole world versus Russia — means there’s way less [cybercriminal] activity than we expected,” Wisniewski said. “I think there’s a lot of sympathy for Ukraine among members of these different groups, and as a result they’re sitting it out.”</p><div class=\"c-float-left\"><aside id=\"Xf7M51\"><q>“For us it is just business and we are all apolitical”</q></aside></div><p id=\"bbgcLa\">LockBit, another ransomware group and effectively a competitor to Conti, released a statement on Sunday saying that the group <a href=\"https://www.scmagazine.com/analysis/ransomware/after-conti-backs-war-ransomware-gangs-realize-peril-of-patriotism-amid-infighting\">would not target Western infrastructure</a>, supposedly due to the international makeup of the organization. Rather than profess any support for Ukraine, the statement declared neutrality in the conflict.</p><p id=\"qbN3Lz\">“For us it is just business and we are all apolitical,” the message posted by LockBit said.</p><p id=\"uXRIJ8\">Though ransomware gangs (with the exception of Conti) have been reluctant to choose sides, certain hacktivist groups — which are by definition political — have rushed to join the cause. A hacktivist group operating from Belarus has <a href=\"https://www.bloomberg.com/news/articles/2022-02-27/belarus-hackers-allegedly-disrupted-trains-to-thwart-russia\">claimed to be disrupting the movement of military units</a> by shutting down railways in the country, after the Belarusian government launched missile strikes against Ukraine and agreed to support Russia by sending troops over the Ukrainian border. </p><p id=\"9SglSd\">Separately, a Twitter account linked to Anonymous declared that the hacking collective was “officially in cyber war against the Russian government,” and the group claimed responsibility for a number of <a href=\"https://www.theguardian.com/world/2022/feb/27/anonymous-the-hacker-collective-that-has-declared-cyberwar-on-russia\">DDoS attacks and other hacks</a> against Russian government websites and media channels.</p><p id=\"gnaChy\">Though other groups with offensive hacking capabilities may be tempted to join the conflict, cybersecurity professionals have <a href=\"https://twitter.com/RobertMLee/status/1497298806580207624\">cautioned against escalation</a>. Regardless of intent, cyberattacks can have unforeseen consequences, particularly if targets are tied to infrastructure or other critical services with applications beyond the military.</p><p id=\"STpt4K\">“I’m worried about collateral damage from the ‘good guys,’ the vigilantes,” Wisniewski said. “Encouraging people to attack [cyber targets], that to me is a very dangerous situation ... it’s not just an innocent activity when you don’t know the side effects.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZUKiU-xwFaQRtCFMaVCPHayjV5c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23249791/VRG_ILLO_STK001_carlo_cadenas_cybersecurity_virus.jpg",
  "description": "Is proximity to the Putin regime becoming a liability?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}