{
  "title": "A renowned community of quilters is taking on copycats — and winning",
  "url": "https://www.theverge.com/22905288/gees-bend-quilters-etsy-online-sales",
  "date": "2022-02-07T14:00:00.000Z",
  "author": "Alexandra Marvar",
  "content": "      <figure>      <img alt=\"An illustration of three Black woman quilters, drawn in shades of blue, putting a quilt up against a star-patterned orange background.\" src=\"https://cdn.vox-cdn.com/thumbor/3ml8FzD9W3_PmCsPHaTHiHoPH5k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472819/VRG_ILLO_5000_ClaudiaCAkole_MIW3_GeesBendQuilts.0.jpg\" />        <figcaption>Illustration by Claudia Chinyere Akole</figcaption>    </figure>  <p>Online sales gave Gee’s Bend quilters control over their work </p> <p class=\"p--has-dropcap p-large-text\" id=\"pwJOfH\">Quilts made by generations of women in Gee’s Bend, Alabama, have hung in the Met, the Whitney, and the Smithsonian Museum of Art. They’ve been shown at galleries and art fairs around the world. But if the quilters want to directly sell their world-famous quilts — vibrant, often asymmetrical, charismatic works, originally hand-stitched for warmth from scavenged fabric — they’ve had to wait for prospective buyers to come to them.</p><p id=\"H1QVk3\">That requires a drive deep into the Alabama Black Belt, along red dirt roads with little to no cell signal, through an isolated stretch of grassy meadows and pine woods, to a community deep in an oxbow of the Alabama River that, if the ferry’s not running, is nearly 40 miles from the closest hotel, supermarket, or pharmacy. </p><p id=\"XvDf4f\">At least, this is how it worked before February of 2021. </p><p id=\"YKXIss\">Despite their celebrity, much of the quilters’ fame is based on visitors sharing their work outside of their community — and historically, the financial benefits have gone to people outside of their community, too. Occasionally, some of that trickles back in the form of one-off gallery sales, or <a href=\"https://www.thenation.com/article/gees-bend-quilt-alabama/\">copyright royalties</a>. But it hasn’t been enough to lift this Black community, renowned in the art world, out of what the United Nations has called some of the <a href=\"https://www.al.com/news/2017/12/un_poverty_official_touring_al.html\">most extreme conditions of poverty</a> in the developed world.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zUzykvyqt0up64RXm78t7qN08E4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212934/nest_64099293_Full_cred_StacyAllen.jpg\">      <cite>Photo by Stacy K. Allen for Nest</cite>      <figcaption><a class=\"ql-link\" href=\"https://www.etsy.com/shop/georgieswayquilts\" target=\"_blank\"><em>Stella Mae Pettway</em></a></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7pvw5cMt5y0SphYVblLRTllnhk0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212916/182_SharonWilliams_022_cred_StacyAllen.jpg\">      <cite>Photo by Stacy K. Allen for Nest</cite>      <figcaption><a class=\"ql-link\" href=\"https://www.etsy.com/shop/ShasShopGeesBend\" target=\"_blank\"><em>Sharon Williams</em></a></figcaption>  </figure></div></div></div><p id=\"4K8yox\">One thing the Gee’s Bend quilters have needed is an easier way to sell quilts directly — control what they offer, set the prices, and reap all the profits. So, a year ago this month, three generations of Gee’s Bend quilters launched their own Etsy shops, turning the online platform into the accessible, direct-to-consumer sales opportunity they had been missing. </p><p id=\"kEMFuZ\">None of them had ever used Etsy before, but some were certainly familiar with it — and not for the opportunity it offered them. For years, a chorus of independent crafters had been peddling #<a href=\"https://www.pinterest.com/eileenrich/gees-bend-inspired-quilt-designs/\">geesbendinspired</a> quilts on Etsy. While they racked up sales leveraging the Gee’s Bend name, the women behind their key search term carried on quilting when they could acquire fabric.</p><div class=\"c-float-right c-float-hang\"><aside id=\"IzClyy\"><q>“We used these quilts for warmth. It was about our struggle, and our survival.”</q></aside></div><p id=\"VZkzp0\">These days, when fourth-generation quilter <a href=\"https://www.etsy.com/shop/GeesbendPlace\">Claudia Pettway Charley</a> spots a “Gee’s Bend-inspired” quilt on Etsy, she’ll reach out to the seller to ask them how exactly they are related to her or her community. She hopes to engage them in a thoughtful dialogue about appropriation. She rarely receives a response. </p><p id=\"QtDS6g\">“We put a lot of work into it, and it’s about our life,” Charley says of quilting. She recently took on the job of community manager in Gee’s Bend, vetting partnership opportunities and acting as a liaison between outsiders and her community. “We were struggling. These were made from scraps. Some was old denim that had been worn by my grandfather, torn and faded. My grandmother used corn and feed sacks, washed them and sometimes bleached them to have different colors. It wasn’t ‘I’m just going to go and make this.’ We used these quilts for warmth. It was about our struggle, and our survival.”</p><p id=\"6ww2wz\">Charley might feel differently, she offers, if these makers — who may have, say, studied textiles at art school — sent some of their profits back to the community that inspired them. But that doesn’t happen. “This work is ‘inspired’ in your mind, because you see the quilt pattern,” Charley says. “But you don’t know my story. And you’re going to try and duplicate it — and go to Joann Fabrics to do it?” </p><p id=\"p1Tcxz\"><a href=\"https://www.nytimes.com/2021/09/24/arts/design/joe-minter-gees-bend-souls-grown-deep.html\">A long-time Gee’s Bend partner</a>, the Souls Grown Deep Foundation — an Atlanta-based nonprofit formed by the family of the first major private collector of Gee’s Bend quilts — knew that direct access to the market could help address this issue and more. They tapped Nest, an artisans’ advocacy organization that had been working with the quilters for a couple years on other initiatives, to look into direct market access. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/agPkH0ddN3viCu4ltHrguODWG98=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212977/GeesBendJuly__0538_cred_StacyAllen.jpg\">      <cite>Photo by Stacy K. Allen for Nest</cite>      <figcaption><em>Quilt by </em><a class=\"ql-link\" href=\"https://www.etsy.com/shop/QuiltedbyKatieMae\" target=\"_blank\"><em>Katie Mae Pettway</em></a><em>.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/puTlGoXDlScpJsqYzL5DKdUx06g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212978/GeesBendJuly_0600_cred_StacyAllen.jpg\">      <cite>Photo by Stacy K. Allen for Nest</cite>      <figcaption><em>Quilt by </em><a class=\"ql-link\" href=\"https://www.etsy.com/shop/QuiltsByCaster\" target=\"_blank\"><em>Caster Pettway</em></a><em>.</em></figcaption>  </figure></div></div></div><p id=\"54n083\">According to Nest’s director of brand strategy and sourcing, Amanda Lee, once her team and an initial group of quilters settled on the plan for Etsy, they faced some intimidating realities: Starting from scratch and competing with long-established sellers is no easy feat in itself, and before that, there were even bigger barriers to entry. Most of the quilters lacked tech skills or experience, internet access or even cell signal, the ability to photograph the work, or the know-how to market it well. When the online shops were up and running, they’d still need to navigate another problem: only a handful of residents had cars and driver’s licenses, and the nearest full-service post office was over 30 miles away. Some didn’t have bank accounts to receive payments. Some had zero experience filing taxes. </p><p id=\"hz99MP\">Etsy helped clear a path, waiving their standard 5 percent transaction fees for a year and donating a $50,000 grant to support Nest in everything from photography, marketing, and brand-building workshops to financial literacy guidance.</p><div class=\"c-float-left c-float-hang\"><aside id=\"7C8CXL\"><q>“I’ve actually gotten a very small house built, thanks to Etsy and a few more people.”</q></aside></div><p id=\"OepwTT\">Ten quilters’ shops launched in concert on February 1, 2021, and within 48 hours, some had sold out of inventory, grossing a total of $72,000. By August, that became $300,000, and as of mid-December, more than a dozen Gee’s Bend quilt shops — all branded with an official Gee’s Bend logo to set them apart from the rest — have made more than half a million dollars in sales, according to data provided by Nest. </p><p id=\"OXIE9F\">This is serious money for any maker, but in Gee’s Bend, its impact is tremendous. “I’ve actually gotten a very small house built, thanks to Etsy and a few more people,” says Mary Margaret Pettway, a third-generation quilter who sells <a href=\"https://www.etsy.com/shop/LunkysBaby\">quilts and pieced wall hangings</a> on Etsy. (Pettway is a common surname in Gee’s Bend, because it was settled in part by formerly enslaved people from the Pettway plantation.) Her 19-year-old son also just sold his first quilt on the platform. “It allows us to get things we need. I know a couple women who have bought vehicles. They’re paying off all their old debts. They can help their families.” </p><p id=\"1R1VHK\">Charley has used some of her earnings to pay her daughter’s college tuition — without student loans. But, she adds, Etsy’s benefits go beyond predictable income and financial security: For the first time, it puts the makers in control. </p><p id=\"HflA1v\">“Etsy gave us an outlet and a platform where we were able to keep up with our own inventory, set our prices, and receive 100 percent of the proceeds,” Charley says. “That alone was something totally different. When you’re able to man your own thing — mind your own business, as they say — that was a whole new level for us.”</p><div><aside id=\"G6v7kF\"><q>“We keep it going from one generation to the next, and we continue to work, and we don’t stop.”</q></aside></div><p id=\"O5cOlA\"><a href=\"https://www.etsy.com/shop/ReapWhatYouSewNice\">Delia Pettway Thibodeaux</a> is a Gee’s Bend quilter who, now retired from a career in the Navy and for the Department of Defense, splits her time between home in the Bend and Washington state. She too has opened up shop on Etsy. She said it has helped broaden the quilters’ audience, while also creating opportunities for less-known and younger artists — “the silent quilters” — in the community. </p><p id=\"sK1V0C\">“Gee’s Bend is a major brand,” she says. “A lot of people don’t have art money now, so we are able to make some custom works according to budget, style, spaces people have in their homes, and helped us reach a whole new genre of people.”</p><p id=\"oorGY6\">These days in the Bend, one might see Claudia Pettway Charley quilting with her 85-year-old mother Tinnie, her aunt Minnie, and her 19-year-old daughter Francesca at her side. All of them sell their work on Etsy. </p><p class=\"c-end-para\" id=\"0ngWsB\">“We keep it going from one generation to the next, and we continue to work, and we don’t stop,” Charley says. “The idea is that it not become a dying art. We dare not stop now. And Etsy is the best thing we’ve had in making sure we have a kind of control we’ve never been able to have, so we control our destiny, the Gee’s Bend way.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/g77SH0UsgPoi00A6l__KYYZ340s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23212828/VRG_ILLO_5000_ClaudiaCAkole_MIW3_GeesBendQuilts.jpg",
  "description": "\"We used these quilts for warmth. It was about our struggle and our survival.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}