{
  "title": "A rocket is still set to slam into the Moon next month — but it may not be from SpaceX after all",
  "url": "https://www.theverge.com/2022/2/13/22931817/china-change-5-t1-rocket-spacex-falcon-9-moon-collision",
  "date": "2022-02-13T17:09:09.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jTNySvvkpw0Yj--LwRGM1zcZ7Zo=/0x306:1920x1586/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70504535/PIA00404_large.0.jpeg\" />        <figcaption><em>A mosaic image of the Moon’s north pole, taken by NASA’s Galileo spacecraft</em> | Image: NASA/JPL/USGS</figcaption>    </figure>  <p id=\"dFDBeo\">Last month, an astronomer and space tracking expert made a bit of a splash when <a href=\"https://www.theverge.com/2022/1/27/22904427/spacex-falcon-9-rocket-second-stage-moon-collision-deep-space-junk\">he predicted that a piece of an old SpaceX Falcon 9 rocket</a> left in space for the last seven years was going to collide with the Moon this March. But now he’s changing that prediction in a big way. While the rocket part he’s been tracking is still on a collision course with the Moon, he now believes that the vehicle is not an old Falcon 9 part, but an old Chinese rocket instead.</p><p id=\"HDDjCF\">The update comes from Bill Gray, an astronomer and asteroid tracker running <a href=\"https://www.projectpluto.com/\">Project Pluto</a>, who has been following this doomed object since March of 2015. He says the object was first picked up by the Catalina Sky Survey, a program that uses telescopes near Tucson, Arizona to scan the sky for potentially dangerous asteroids that could pose a threat to Earth. When the survey found this particular object, other astronomers noticed that it wasn’t orbiting the Sun like asteroids typically do. It was actually orbiting the Earth, suggesting that the object was human made and something that we put into space ourselves.</p><div class=\"c-float-right\"><aside id=\"I2esbd\"><q>“I had pretty good circumstantial evidence for the identification, but nothing conclusive.”</q></aside></div><p id=\"dxZWj2\">A number of clues made Gray and others think that this object was one of SpaceX’s rockets. Specifically, they thought it was the top portion of <a href=\"https://www.theverge.com/2015/2/12/8024031/nasa-dscovr-rocket-deep-space-spacex-falcon-9-launch\">a Falcon 9 that had launched in February of 2015</a>, putting a valuable satellite called DSCOVR into a very distant orbit for the National Oceanic and Atmospheric Administration. That rocket would have gone to a very high altitude to get the satellite to its destination, and this newly observed object had apparently passed by the Moon two days after the DSCOVR mission launched. Given those details and other characteristics of the object, Gray and others were pretty confident that the mystery junk was part of the Falcon 9 rocket that launched DSCOVR.</p><p id=\"a1u6ig\">However, Gray admits that identifying objects like this isn’t always as solid as we’d want it to be. “I had pretty good circumstantial evidence for the identification, but nothing conclusive,” Gray <a href=\"https://www.projectpluto.com/temp/correct.htm\">wrote in a new blog post</a>, first reported by <a href=\"https://arstechnica.com/science/2022/02/actually-a-falcon-9-rocket-is-not-going-to-hit-the-moon/\"><em>Ars Technica</em></a>.</p><p id=\"mz3xxE\">Now, this particular object has been getting a ton of attention, since Gray first predicted in January that the deep-space object would collide with the Moon on March 4th. But after taking a closer look at the object’s history and getting some new details from NASA, Gray is fairly convinced that this object is a leftover piece of a Chinese rocket, specifically a Long March 3C that launched China’s Chang’e 5-T1 mission to the Moon. That flight was a precursor mission that sent a capsule looping around the Moon and careening back to Earth, to test out technology China would use to bring samples of lunar dirt back to our planet.</p>  <figure class=\"e-image\">        <img alt=\"A Long March 3C rocket carrying the Chan\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bCcF006zQyttU9gzsK616LEhO4c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23239093/104589462.jpg\">      <cite>Image: STR/AFP via Getty Images</cite>      <figcaption>China’s Long March 3C launching in 2010. Part of the same rocket is thought to be on a collision course with the Moon.</figcaption>  </figure><p id=\"cZWDgo\">Gray says he realized the case of mistaken identity when he got an email from someone at NASA’s Jet Propulsion Laboratory who keeps track of active space missions. JPL has its own tracking system, and the JPL employee argued that it was unlikely that the Falcon 9 would have passed close by the Moon two days after the DSCOVR launch. “He happened to think, ‘Wait a minute. I don’t remember that having gone past the Moon,’” Gray tells <em>The Verge</em>. “That caused him to dig into the historical data of where DSCOVR actually went.” Based on that mission’s trajectory, the Falcon 9 would have been in another part of space entirely when this object skimmed the Moon.</p><div class=\"c-float-left\"><aside id=\"u7Wlzm\"><q>“I think we can say that we have a very solid chain of evidence for it.”</q></aside></div><p id=\"Fd8iy2\">So Gray went back in time to see if there were any other launches that could fit the bill for this object. That’s when he found the Chang’e 5-T1 mission, which launched in October of 2014. After reconstructing the probable orbit and trajectory for the mission, he realized that the Long March 3C rocket that launched the mission is now the best fit for this mystery object.</p><p id=\"gAgxFP\">“I think we can say that we have a very solid chain of evidence for it,” Gray says. “Running the orbit back to launch for the Chinese spacecraft makes ample sense. It winds up with an orbit that goes past the Moon at the right time after launch.”</p><p id=\"gAsLzW\">Despite the confusion about the object’s identity, Gray says this is just further proof that we need more information about these rocket boosters that go to deep space. As Gray argues, some people’s general attitude toward these kinds of objects is that we don’t need to pay attention to them once they are in space, since they are so far out in orbit. As of now, no formal entity is consistently tracking leftover rockets like this that go into deep space trajectories. “The only folks that I know of who pay attention to these old rocket boosters are the asteroid tracking community,” he says.</p><p id=\"rHMtmY\">Ultimately, Gray says it would be better if those who launch deep space rockets had to report the last known location of their vehicles, to make it easier to track and identify the lost parts. Of course, China is notorious for releasing very little information about its space missions. “This sort of thing would be considerably easier if the folks who launch spacecraft — if there was some regulatory environment where they had to report something,” Gray says. “But as it stands, it’s always a certain amount of detective work that goes into figuring these things out.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HWS1bTEfFhvOh8yI3hDicHUyPAk=/0x444:1920x1449/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23239091/PIA00404_large.jpeg",
  "description": "It’s most likely a leftover Chinese rocket booster.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}