{
  "title": "A Samsung.com ‘expert’ has been fired after speaking up about working for free",
  "url": "https://www.theverge.com/2022/5/13/23067868/samsung-expert-ibbu-terminated-pay",
  "date": "2022-05-13T11:00:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/SPZ96IS8Ps3q9MVFef_7nLkVtHg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70864479/acastro_190503_1777_samsung_0001.0.0.jpg\" />        <figcaption><em>She had been contracted to sell phones on Samsung.com.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"wcEd6z\">On April 14th, <em>The Verge </em><a href=\"https://www.theverge.com/2022/4/14/23001790/samsung-online-sales-labor-customer-service-contractors-ibbu\">published a story</a> about how Samsung’s “Experts,” who answer customer chats at Samsung.com, were being pushed by both Samsung and staffing agency Ibbu to do some customer support for free. While we spoke to a dozen experts during our reporting, only one was willing to be named in the story: Jennifer Larson. </p><p id=\"zpIVAd\">The day after our story was published, Larson received an email saying that she was being temporarily suspended and that she’d get an update in a week. Over four weeks later, Ibbu told her she’d been fired. </p><p id=\"H8IN86\">The email to Larson read, in part:</p><blockquote><p id=\"9MGd3i\">After reviewing your activity on the platform, Ibbu has determined that grounds exist to terminate you from the platform. While we value and encourage any feedback from the Ibbu community and constructive communications on the livefeed, using the Ibbu platform for personal communications violates Ibbu policy, and in this case has also led to complaints from other community members. Furthermore, disclosing confidential information about the Ibbu platform on social media, and encouraging visitors, directly into the chat, to look at third party links or content is a material breach of policy and the Agreement, which constitute grounds for termination.</p></blockquote><p id=\"V0Muip\">Ibbu didn’t immediately respond to <em>The Verge</em>’s request to share the policies it’s quoting or for specifics on why it terminated Larson. </p><div id=\"kzvz6O\"><div data-anthem-component=\"gallery:11189272\"></div></div><p id=\"je5xAq\">But Larson isn’t the only one wondering if they lost her job for speaking out. Two other experts told us that they were terminated from the Samsung Mobile “mission” after speaking to <em>The Verge</em>. Another expert, who we didn’t originally speak to but publicly posted our story on their LinkedIn page, was also terminated. Unlike Larson, however, they weren’t suspended before being fired, and they’re able to work on other Ibbu jobs if they want.</p><p id=\"xBBq10\">Before they were terminated, the experts’ job was to sell Samsung phones. In theory, that job involved logging into Ibbu’s system when they felt like it and answering questions from people who had clicked the “Chat with an expert” button on Samsung.com. But <a href=\"https://www.theverge.com/2022/4/14/23001790/samsung-online-sales-labor-customer-service-contractors-ibbu\">as we laid out in our previous report</a>, based in part on testimonies and evidence provided by people who’ve now been fired, the system didn’t work as intended. Experts often found themselves dealing with support questions from people having issues with their phones or orders instead of inquiries from customers trying to decide whether to go with the S22 Plus or Ultra.</p><p id=\"oawOGI\">To make matters worse, the “Experts” are only paid on commission, meaning they are extremely unlikely to see a single cent for answering support chats. Despite that, and despite the fact that their contract says they shouldn’t answer support questions, the experts we talked to felt pressured to by both Ibbu and Samsung. One Samsung employee justified it by suggesting answering support chats was a way to boost the experts’ customer satisfaction numbers.</p><div class=\"c-float-right\"><aside id=\"pGPmhj\"><q>Ibbu expects its experts to end at least 14 percent of chats with a sale</q></aside></div><p id=\"oY2Jy8\">That number is important to the experts — it, along with the percentage of chats that they turn into sales, determines whether they get to keep their jobs. But as several experts had pointed out to us, it’s hard to keep those numbers up when you’re disappointing customers by telling them they ended up in the wrong chat and that they have to go to a different part of Samsung.com to reach the correct person.</p><p id=\"nSvzfJ\">Samsung didn’t immediately respond to <em>The Verge</em>’s request for comment on whether the company had anything to do with Larson or other Ibbu experts being terminated.</p><p id=\"GOBcWY\">Aside from Larson’s case, Ibbu cited poor performance when it terminated the experts we spoke to. Over a week after it had let them go, though, the company acknowledged in an internal post that out-of-scope chats were a growing problem — though its estimate of only 2.81 percent of chats being misrouted by bots is significantly lower than what experts suggested to us. The company also said that it was “continuously working on tracking and improving this to lower this percentage as quickly as possible.”</p><p id=\"chgJuf\">It’s cold comfort for those who already got termination emails citing low customer satisfaction and sales numbers. One of the former experts told <em>The Verge</em> that this isn’t the outcome they would’ve chosen but that they “have zero desire to get that job back with Samsung Mobile.” Another said that they do want their job back but would want to see major changes from Ibbu. Both mentioned that they continued to have difficulties meeting Ibbu’s goals.</p><p id=\"cz66VV\">As for Larson, she’s not surprised that she ended up being fired, though she didn't expect Ibbu to keep her in limbo for so long. When it comes to speaking up about the way the company treated her, though, she said she was glad she did it. “I wouldn’t change anything.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZUFHhQYXmVzTLQjmlXIH4h4JEro=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16317091/acastro_190503_1777_samsung_0001.0.jpg",
  "description": "She’s still glad she spoke up.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}