{
  "title": "A second season of Severance is on the way",
  "url": "https://www.theverge.com/2022/4/6/23013116/severance-apple-workplace-drama-ben-stiller-streaming",
  "date": "2022-04-06T15:33:53.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/AbBkSMJvRlvtkR2WwhJkQSZ7YiY=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70716992/Severance_Photo_010101.0.jpg\" />        <figcaption>Severance stars Adam Scott as a worker drone who surgically divides his work and home personalities | Apple</figcaption>    </figure>  <p id=\"FlNQnn\"><em>Severance</em>, the creepy Apple TV Plus drama about workers who find work-life balance by surgically altering their brains, has been renewed for a second season, the streamer announced Wednesday. The show starring Adam Scott as Mark S., a grieving widower who willingly forgets who he is for the entirety of his workday, has found an audience with its portrayal of the horrors of capitalism in a large but claustrophobic office. </p><p id=\"hcc3Le\">Mark and his coworkers Helly R. (Britt Lower), Irving (John Turturro), Dylan (Zach Cherry), and Burt (a spectacularly understated Christopher Walken) are trying to figure out what exactly they’re<em> really</em> doing in the macrodata refinement department at Lumon Industries while avoiding trips to the dreaded Break Room. They’re constantly monitored by the deeply unsettling Harmony Cobel (Patricia Arquette), the mysterious Ms. Casey (Dichen Lachman), and steely-eyed Seth Milchick (Tramell Tillman). Mark’s real family includes his pregnant sister Devon (Jen Tullock) and the always reliably funny Michael Chernus as Ricken, Devon’s husband (who authors a self-help book titled <em>The You You Are</em> and holds dinner parties with no actual dinner). </p><p id=\"QQ8VHy\">Created by Dan Erickson and with episodes directed by Ben Stiller and Aoife McArdle, the show’s first season finale arrives this Friday.</p><div id=\"uhIctE\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Your <a href=\"https://twitter.com/hashtag/Severance?src=hash&amp;ref_src=twsrc%5Etfw\">#Severance</a> Season 2 request has been accepted. <a href=\"https://t.co/OTayQHRNHL\">pic.twitter.com/OTayQHRNHL</a></p>— Apple TV+ (@AppleTVPlus) <a href=\"https://twitter.com/AppleTVPlus/status/1511705288574836741?ref_src=twsrc%5Etfw\">April 6, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"XXclfX\"><em>Severance</em> cleverly explores what it means to have a work persona separate from your “real” identity, where one can never leave the office, and the other doesn’t remember anything they did at work. It’s set in an antiseptically clean, labyrinthine building with decor and computers that recall the 1970s and 1980s (but we don’t really have a sense of exactly <em>when</em> we are). </p><p id=\"SsuJh5\">Good performance at Lumon might earn workers a handshake, a melon party, a music dance experience (with music options like “defiant jazz”) or perhaps even a waffle party, all of which are as weird and awesome as they sound. The workers start to unravel the mystery behind the cult-like Egan family, founders of Lumon, and figure out all is not as it seems. (Also: the <a href=\"https://www.extraweg.com/severance\">opening credits montage</a> is an absolutely spectacular CGI animated feature in itself that sets the tone for the show; don’t skip!)</p><p id=\"p1Idm9\">The season two teaser keeps it simple, with the words “You’ll feel like you never left” displayed on a vintage computer screen. Yes, I just shuddered. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Y0JIVQ59ZW3aCUNGhWgLn7E23II=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23236106/Severance_Photo_010101.jpg",
  "description": "Time to get down with a waffle party",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}