{
  "title": "A teen is reportedly the mastermind behind the Lapsus$ hacking group ",
  "url": "https://www.theverge.com/2022/3/23/22993731/lapsus-hacking-group-teenager-mastermind",
  "date": "2022-03-23T23:52:20.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vxOU4IX7LnD_G87B61ooei3JU8c=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70664112/acastro_170621_1777_0006.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"0aUclS\">In recent weeks, the Lapsus$ hacking group has taken credit for accessing company data from <a href=\"https://www.theverge.com/2022/3/1/22957212/nvidia-confirms-hack-proprietary-information-lapsus\">Nvidia</a>, <a href=\"https://www.theverge.com/2022/3/7/22965220/samsung-hack-lapsus-galaxy-source-code-confirmed-nvidia\">Samsung</a>, <a href=\"https://www.theverge.com/2022/3/11/22972768/ubisoft-cyber-security-incident-hack\">Ubisoft</a>, <a href=\"https://www.theverge.com/2022/3/22/22990637/okta-breach-single-sign-on-lapsus-hacker-group\">Okta</a>, and even <a href=\"https://www.theverge.com/2022/3/22/22991409/lapsus-microsoft-security-windows-source-code\">Microsoft</a>, and according to <a href=\"https://www.bloomberg.com/news/articles/2022-03-23/teen-suspected-by-cyber-researchers-of-being-lapsus-mastermind?sref=ylv224K8\">a new <em>Bloomberg</em> report</a>, an England-based teenager might be the person heading up the operation.</p><p id=\"k5z2bk\">“Four researchers investigating the hacking group Lapsus$, on behalf of companies that were attacked, said they believe the teenager is the mastermind,” <em>Bloomberg</em> said. However, the teenager, who apparently uses the online aliases “White” and “breachbase,” has not been accused by law enforcement, and the researchers “haven’t been able to conclusively tie him to every hack Lapsus$ has claimed,” <em>Bloomberg</em> said. </p><p id=\"RCcAGF\">The teenager is apparently based about five miles outside of Oxford University, and <em>Bloomberg</em> says it was able to speak to his mother for ten minutes through a “doorbell intercom system” at the home. The teenager’s mother told the publication she did not know of allegations against him. “She declined to discuss her son in any way or make him available for an interview, and said the issue was a matter for law enforcement and that she was contacting the police,” <em>Bloomberg</em> said.</p><p id=\"wuMzgF\">Lapsus$ apparently doesn’t just consist of the England-based teenager, though. <em>Bloomberg</em> reports that one suspected member is another teenager in Brazil and that seven unique accounts have been linked with the group. One of the members is apparently such a capable hacker that researchers thought the work was automated, one person involved in research about the group told <em>Bloomberg</em>.</p><p id=\"M0QIng\">According to <a href=\"https://krebsonsecurity.com/2022/03/a-closer-look-at-the-lapsus-data-extortion-group/\">cybersecurity expert Brian Krebs</a>, a core member of Lapsus$, who may have used the aliases “Oklaqq” and “WhiteDoxbin,” also purchased Doxbin, a website where people can post or search for the personal information of others for the purposes of <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.kaspersky.com%2Fresource-center%2Fdefinitions%2Fwhat-is-doxing&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F23%2F22993731%2Flapsus-hacking-group-teenager-mastermind\" rel=\"sponsored nofollow noopener\" target=\"_blank\">doxing</a>. This WhiteDoxbin individual apparently wasn’t the best admin and had to sell the site back to its previous owner, but leaked “the entire Doxbin data set,” which led to the Doxbin community <em>doxing WhiteDoxbin</em>, “including videos supposedly shot at night outside his home in the United Kingdom,” Krebs reported.</p><p id=\"68pWVO\">Krebs also reports that this person may have been behind <a href=\"https://www.theverge.com/2021/6/10/22528003/ea-data-breach-frostbite-fifa-internal-tools-hack\">the EA data breach</a> that took place last year. What may connect the person between <em>Bloomberg</em> and Krebs’ is the name “breachbase.” </p><p id=\"Va9m82\">From Krebs:</p><blockquote><p id=\"aZ1G0X\">Back in May 2021, WhiteDoxbin’s Telegram ID was used to create an account on a Telegram-based service for launching distributed denial-of-service (DDoS) attacks, where they introduced themself as “@<strong>breachbase</strong>.” News of EA’s hack last year was first posted to the cybercriminal underground by the user “Breachbase” on the English-language hacker community <strong>RaidForums</strong>, which was recently seized by the FBI.</p></blockquote><p id=\"YCxDSI\">The full picture surrounding Lapsus$ is still murky, but I strongly urge you to read both <a href=\"https://www.bloomberg.com/news/articles/2022-03-23/teen-suspected-by-cyber-researchers-of-being-lapsus-mastermind?sref=ylv224K8\"><em>Bloomberg</em></a> and <a href=\"https://krebsonsecurity.com/2022/03/a-closer-look-at-the-lapsus-data-extortion-group/\">Krebs’</a> reports to learn more about what may be going on.</p><p id=\"W5KpwS\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ajgJb4Dplj0SL3Vzfp3VTQzrD1Q=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8792139/acastro_170621_1777_0006.jpg",
  "description": "The full picture around the group is still murky.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}