{
  "title": "A tech executive is privately funding hundreds of soldiers to fight for Ukraine",
  "url": "https://www.theverge.com/2022/3/9/22969195/ukraine-russia-reddit-discord-anthony-capone-volunteers-subreddit-veterans",
  "date": "2022-03-09T18:37:05.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"Portrait photograph of Anthony Capone holding a microphone, edited with a abstract stylized background. \" src=\"https://cdn.vox-cdn.com/thumbor/IYVlyzHn7J6OJth1gm9It4EpkuE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70600206/acastro_220309_5075_0001.0.jpg\" />        <figcaption>Photo Illustration by Alex Castro / The Verge Photograph from Anthony Capone</figcaption>    </figure>  <p>‘At this point, I’ve probably spent a couple hundred thousand’</p> <p class=\"p--has-dropcap p-large-text\" id=\"J93ej2\">As Russian forces continue to wreak havoc in Ukraine, one tech executive is arranging financial support for volunteers interested in fighting the invasion.</p><p id=\"fVj0oy\">On February 27th, DocGo president Anthony Capone wrote a lengthy <a href=\"https://www.linkedin.com/in/anthony-e-capone/recent-activity/shares/\">post on LinkedIn</a> detailing a previous “international expedition” through eastern Europe and his personal opposition to the war. As part of the post, he promised to “personally cover all travel and equipment expenses” for anyone “that is willing to volunteer but doesn’t have the financial means.” </p><p id=\"LZE7Zf\">Capone emphasized that his comments on Ukraine are personal statements and “not made on behalf of DocGo,” a software-enabled medical transport company previously known as Ambulnz.</p><div class=\"c-float-right c-float-hang\"><aside id=\"4fryUR\"><q>Capone’s message came in response to a call-to-arms from Ukrainian President Volodymyr Zelensky</q></aside></div><p id=\"mHxofl\">Capone’s message came in response to a call-to-arms from Ukrainian President Volodymyr Zelensky earlier that day, asking foreigners to “fight side-by-side with Ukrainians against the Russian war criminals” as part of Ukraine’s new “international legion” of foreign fighters. </p><p id=\"pwMR3N\">In a Wednesday call with <em>The Verge</em>, Capone emphasized that none of the volunteers are being paid for their services and that he is “very careful not to take active duty military.” Capone said that he has accepted 400 applicants, although many are still waiting for acceptance into the international legion. </p><p id=\"ZnC9IJ\">Volunteers and additional donations are being coordinated through a newly formed organization called <a href=\"https://ukrainiandemocracy.com/\">Ukrainian Democracy</a>, which Capone says has staff in both Poland and the United States.</p><p id=\"vZhZvp\">One of Capone’s proclaimed 400 volunteers is Alexander Szokoly, a US military veteran, who provided <em>The Verge </em>with his travel itinerary for his Thursday evening flight to Warsaw. After Zelensky announced Ukraine’s foreign legion, Szokoly searched Reddit for other like-minded veterans eager to take up arms against Russia in eastern Europe. On Reddit, he found posts encouraging users to reach out to Capone on LinkedIn if they needed money to volunteer.</p><p id=\"TLfXZr\">“I am a former Army Combat Medic and am preparing to leave this week,” Szokolycommented on Capone’s LinkedIn post. “Please reach out. My brigade trained with javelins and in CBRN gear explicitly to fight Russians.”</p><p id=\"pkadLi\">It took about five days for the Ukrainian foreign legion and Capone’s organization to approve his self-organized team of volunteer soldiers, Szokoly told <em>The Verge</em>. “[Capone] is covering flights as well as medical supplies and body armor on the ground,” he said.</p><p id=\"qN5ihS\">Capone confirmed to <em>The Verge </em>that Szokoly was working with his organization and described him as “a good experienced guy.”</p><p id=\"qY6pjI\">While the ongoing devastation in Ukraine has led to international concern, NATO-aligned countries (including the US) have held off on direct military involvement for fear of provoking nuclear conflict with Russia. That stalemate has led to an outpouring of support from private citizens, including <a href=\"https://www.cnbc.com/2022/03/09/heres-a-list-of-top-rated-charities-to-help-the-ukraine-relief-effort.html\">donations to relief efforts</a> and <a href=\"https://www.theguardian.com/world/2022/mar/08/where-in-europe-are-ukraines-refugees-going\">resettlement efforts for refugees displaced by the conflict</a>.</p><p id=\"Ew1PCO\">Some have gone farther, traveling to the conflict zone in hopes of joining the fight on the Ukrainian side. Last week, <a href=\"https://www.militarytimes.com/flashpoints/ukraine/2022/03/03/volunteer-fighters-arrive-in-ukraine-but-the-untrained-should-stay-home/\">the <em>Military Times </em>reported</a> that “several hundred” volunteers had already arrived to fight alongside Ukrainian forces. According to the <em>Times</em>, the Ukrainian embassy in Washington, DC had received over 3,000 applications from US citizens alone. Many of these applicants are military veterans, while others appear to be young people and teenagers who have no prior military experience. </p><p id=\"oYKOGr\">This dramatic influx of unskilled volunteers has overwhelmed Ukrainian officials and has created longer and longer wait times for acceptance for veterans and people with prior combat experience. Several Reddit and Discord users posted screenshots of emails from the US Ukrainian Embassy warning them not to call or send additional emails, “otherwise, your application WILL BE REMOVED from the candidates’ list!” <a href=\"https://www.foxnews.com/world/ukraine-military-turns-volunteers-away-as-140k-ukrainians-come-home-to-fight-russia\">On Monday, <em>Fox News </em>reported</a> that the Ukrainian military has started turning away volunteers.</p><p id=\"8bQt9h\"><a href=\"https://www.reuters.com/world/europe/foreign-fighters-ukraine-offers-purpose-camaraderie-cause-2022-03-07/\">According to <em>Reuters</em></a>, the US government has requested that American citizens abstain from traveling to Ukraine to defend the nation from Russia.</p><p id=\"5Qb6mM\">Still, many American veterans and would-be volunteers see the cost of plane tickets, transportation, and gear as the main factor holding them back from joining the fight. The r/VolunteersForUkraine community on Reddit shows dozens of posts from users looking for “sponsors” to pay for their travel and equipment. Other users ask for rides to the Ukrainian border from Warsaw or to meet up with fellow Americans arriving in eastern Europe around the same time.</p><p id=\"wklXzm\">One user wrote to the community looking for advice on how to pause bill payments. “I’m flying out to Ukraine next week, but that doesn’t make bills go away,” one user wrote. “I’m going regardless, just wondering if there’s anything I can do so I’m only half fucked if I come back.”</p><div class=\"c-float-left c-float-hang\"><aside id=\"KqYLzb\"><q>“Just wondering if there’s anything I can do so I’m only half fucked if I come back”</q></aside></div><p id=\"gTlyZw\">Capone’s LinkedIn post circulated heavily in these Reddit communities, often naming him as a direct source for funding. As of publication, there are over 250 comments on Capone’s LinkedIn post asking for financial help in traveling to Ukraine. Capone has replied to dozens of the comments, telling them to DM him.</p><p id=\"LYqanw\">To coordinate the ongoing funding effort, Capone has created a new organization called “Ukrainian Democracy LLC” to help filter volunteers and connect them with sponsors. After volunteers are fully vetted, they are connected with a sponsor who will purchase their “flights and/or protective gear,” Capone said <a href=\"https://www.linkedin.com/posts/activity-6906978363777667072-CzIz\">in a post</a>. His team then handles the logistics of transporting volunteers to the foreign legions base in Ukraine, Capone’s post said.</p><p id=\"WSSYp3\">It’s unclear how much of his own money Capone has put into the effort. Last week, Capone tagged Delta Airlines CEO Ed Bastian and United Airlines CEO Scott Kirby in a LinkedIn post asking for help transporting “some of these individuals to Warsaw.” </p><p id=\"E1NrRX\">Responding to a question from <em>The Verge </em>about how much money he has personally invested in the endeavor, Capone said, “I make all of my money from the benefits of democracy.” He continued, “It’s only right that I use those benefits to defend others who are trying to have a similar democracy.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"xiI5Rm\"><q>“At this point, I’ve probably spent a couple hundred thousand”</q></aside></div><p id=\"Z9IEnr\">“At this point, I’ve probably spent a couple hundred thousand,” Capone told <em>The Verge</em>. “But we just launched.”</p><p id=\"cEasUW\">Traveling from Warsaw through Belarus in 2010, Capone said soldiers gave him “a pretty fair beating, worse than some of my more intense rugby matches” when he arrived without a transit visa. Returning to Warsaw, he boarded a separate train arriving in Moscow through Kyiv, where he met a “Polish/Ukrainian systems engineer” who offered to let him stay at his home before he finished the last leg of his trip.</p><p class=\"c-end-para\" id=\"H0Me3S\">“Fast [forward] to today and that same train is now filled with thousands of Ukrainians being driven from their home,” Capone wrote. He described particular anger at reports that Russians had attacked medics attending to injured civilians. “As an individual that employs thousands of EMTs,” Capone wrote, “I cannot begin to overstate my anger at such an injustice.” </p><p id=\"eM6Fww\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/g5g2E_twEm02jNGguNi0dDvJTfU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23301550/acastro_220309_5075_0001.jpg",
  "description": "He’s r/VolunteersForUkraine’s top financial resource.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}