{
  "title": "A third Apple store is looking to unionize",
  "url": "https://www.theverge.com/2022/5/3/23055406/apple-union-maryland-retail-corporate-return-to-work-letter-core-together",
  "date": "2022-05-03T21:40:03.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/UON9Fb3D87REomNRX0OectXvLDM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70828789/acastro_180604_1777_apple_wwdc_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"8NiWKS\">Employees at a third Apple retail store have announced that they’re trying to organize a vote on whether to unionize, <a href=\"https://www.washingtonpost.com/technology/2022/05/03/apple-retail-towson-union-labor-machinists/\">according to a report from <em>The Washington Post</em></a>. Workers at Apple’s Towson Town Center store in Maryland say that they’ve received signatures from a majority of the employees that would likely be able to join a union, and are planning on filing with the National Labor Relations Board to schedule an election.</p><p id=\"hbb6QN\">In <a href=\"https://www.goiam.org/dear-tim/\">a letter</a>, the organizers say their union is called the “Coalition of Organized Retail Employees” (or AppleCORE), and say they’re not trying to “go against or create conflict with” Apple management. Instead, the workers say they want to gain access to rights they currently don’t have. While they don’t specify which ones in the letter or <a href=\"https://www.goiam.org/news/imail/maryland-apple-store-employees-move-to-join-the-iam/\">a press release</a>, <em>The Washington Post</em> reports employees saying they want a voice when it comes to determining their pay, hours, and coronavirus safety. In the letter, the workers ask Tim Cook to voluntarily recognize the union, saying they have the support of “a solid majority” of their coworkers.</p><p id=\"8KF75W\">If Apple doesn’t voluntarily recognize the union, the next step for AppleCORE would be petitioning the NLRB to hold an election. If the regulator agrees that there’s been a sufficient showing of interest, Apple and the union will have to determine who would be eligible to join the union (and therefore who will be able to vote), and decide a date for the election. This can either happen voluntarily or after an NLRB hearing.</p><p id=\"CEbYZb\">Earlier on Tuesday, Apple agreed to schedule a union vote on June 2nd with <a href=\"https://www.theverge.com/2022/5/3/23055452/apple-retail-store-atlanta-union-vote-date-set-june-cwa\">workers at another retail store in Atalanta</a>. Employees in New York have also <a href=\"https://www.theverge.com/2022/4/16/23028356/apple-store-workers-grand-central-terminal-new-york-union-signatures\">started collecting signatures</a> to hold a union vote.</p><aside id=\"ps6OMO\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"First US Apple Store union election set for June 2nd in Atlanta\",\"url\":\"https://www.theverge.com/2022/5/3/23055452/apple-retail-store-atlanta-union-vote-date-set-june-cwa\"}]}'></div></aside><p id=\"4sU53u\">It’s not just retail workers pushing back on Apple’s policies. A group known as Apple Together recently published a letter protesting the company’s return to office plan for corporate employees, which will eventually implement a <a href=\"https://www.theverge.com/2022/3/4/22961592/apple-april-11-return-office-corporate-pandemic-tim-cook\">hybrid schedule</a> of three days in the office and two “flexible” days where employees can work remotely. </p><p id=\"kAFnGe\">The letter, which <a href=\"https://appletogether.org/hotnews/thoughts-on-office-bound-work\">you can read in full here</a>, takes issues with several of Apple’s claims about limiting options for remote work. Its authors say that Apple’s heavily siloed structure makes it hard to “serendipitously” run into colleagues, that the company’s insistence on keeping employees at offices will hurt diversity, and that commutes eat into employees’ productivity. Most importantly, the letter says, Apple’s employees can’t make products that will delight customers who are trying to work remotely if they don’t have experience with doing so themselves. It concludes by asking Apple’s management to be as flexible with remote work as its employees have been over the pandemic.</p><p id=\"DW5rlR\">At this point, labor organization at Apple seems to be the work of several independent groups, rather than something driven by a singular force (as is the case with, say, <a href=\"https://www.tallahassee.com/story/news/2022/05/03/starbucks-tallahassee-first-win-union-election-nlrb-florida-leon-county-votes-unionization/9630316002/\">Starbucks</a>). The retail stores are looking to partner with different established unions — Atlanta is organizing with the Communications Workers of America, New York with Workers United, and the workers in Maryland with the International Association of Machinists and Aerospace Workers. </p><p id=\"nUjuCl\">The workers also have varied demands, though they’re along the same lines — workers in New York are asking for a $30 minimum wage at the store, while Atlanta’s pay demands are for “transparency around pay inequality, cost of living adjustments, and real living wages.” You can read the full list of demands <a href=\"https://fsworkersunited.org/mission.html\">from New York here</a>, and <a href=\"https://www.theverge.com/2022/4/29/23048296/apple-retail-store-union-atlanta-cumberland-mall-open-letter\">from Atlanta here</a>.</p><p id=\"VU6V8i\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/W4T_cOXSKByy6vwN8c-FcH-1S4A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477051/acastro_180604_1777_apple_wwdc_0003.jpg",
  "description": "New York, Georgia, and now Maryland.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}