{
  "title": "A tiny DJI drone smuggled its own weight in drugs over the US border wall",
  "url": "https://www.theverge.com/2022/2/3/22916246/dji-mini-2-drone-smuggle-meth-us-mexico-border-wall",
  "date": "2022-02-03T21:14:55.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ZzQut25InrH5IZnnWqKeaLS1Nso=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70468387/vpavic_201214_4405_0361.0.jpg\" />        <figcaption>Photo by Ryan Loughlin</figcaption>    </figure>  <p id=\"kC991T\">If you’ve ever wondered whether drug dealers might just fly packets of powder over the border wall with inexpensive consumer drones, wonder no more — the US Border Patrol caught a <a href=\"https://www.theverge.com/22277238/dji-mini-2-drone-review-price-specs-features\">DJI Mini 2</a> dead to rights dropping off its own weight in meth last October.</p><p id=\"7kAhA4\">That’s according to a recently released search warrant from the Drug Enforcement Administration (DEA), which is trying to search the drone for evidence that might help them track down the pilot. </p><p id=\"9hH90U\">On October 7th, according to the affidavit, Tecate’s Campo Border Patrol Station radioed that a drone was spotted flying over the 25-foot-high fence. An agent spotted the drone buzzing over a parking lot just the other side of the wall; watched it land; watched a grey Mercedes roll up with a man ready to collect the goods; then intercepted the drone before the driver could pick it up. </p><p id=\"13KZ7g\">The bundle contained a package filled with 0.57 pounds (259g) of methamphetamine, more than you might think a 249g DJI Mini 2 can carry on its own. But for a short hop over a 25-foot border wall to a parking lot just the other side, it’s actually quite feasible — <a href=\"https://www.youtube.com/watch?v=IZNernWBQfY\">multiple</a> <a href=\"https://www.youtube.com/watch?v=y13yY2k3dvI&amp;t=537s\">videos</a> show the DJI Mini 2 can lift double its own weight for a short time. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pMjLfWHkqx-6v052xlXHiax9Ty8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23216172/tecate_border_patrol_area.jpg\">      <cite>Image: Google Maps</cite>      <figcaption><em>The drone landed in one of the parking lots visible here, just north of the Tecate border.</em></figcaption>  </figure><p id=\"oK86qN\">It’s not clear from the search warrant whether Chinese drone manufacturer DJI will be asked to share information about the user who flew the drone — for now, it sounds like the agent is simply asking to do some data forensics on the drone and its microSD card.</p><p id=\"5mi3f9\">He says flights like this are common: “In this area, it is common for human / narcotics smuggling organizations to use drones to fly over the boundary fence and assist and / or facilitate their criminal operations in the United States.” There are one-off <a href=\"https://www.newsweek.com/drone-meth-crash-san-ysidro-border-mexico-1569876\">reports</a> going back <a href=\"https://www.cnn.com/2015/01/22/world/drug-drone-crashes-us-mexico-border/index.html\">years</a> about failed drone drug deliveries near the border, but usually, the drone pictures are older, larger models. A would-be drug-running DJI Mini drone <a href=\"https://twitter.com/OCSheriff/status/1438572152844951554\">was seized last September in Costa Mesa, California</a>, though, when a man was “suspected of using a drone in an attempt to smuggle drugs” into an Orange County jail. </p><div id=\"F8D4P5\"><iframe src=\"https://embed.documentcloud.org/documents/21196860-drone-warrant-meth-feb-2022/?embed=1&amp;responsive=1&amp;title=1\" title=\"drone-warrant-meth-feb-2022 (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div><p id=\"ogXMc6\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WHiTzpvMYCJALlkTl7BtRUtAd6w=/0x213:2040x1281/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22296016/vpavic_201214_4405_0361.jpg",
  "description": "Yes, the Mini 2 can do that",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}