{
  "title": "A top Wikipedia editor has been arrested in Belarus",
  "url": "https://www.theverge.com/2022/3/11/22973293/wikipedia-editor-russia-belarus-ukraine",
  "date": "2022-03-11T22:28:57.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Wikipedia logo\" src=\"https://cdn.vox-cdn.com/thumbor/CvPrbUqSnI_zPMtKGSgxc22IIlQ=/0x91:2800x1958/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70611039/Wikipedia_logo_v2.svg.0.png\" />        <figcaption>Image: Wikipedia</figcaption>    </figure>  <p id=\"Nx9Ves\">The Main Directorate for Combating Organized Crime and Corruption of Belarus (GUBOPiK) has detained prominent Wikipedia editor Mark Bernstein, according to the Belarusian publication <a href=\"https://news.zerkalo.io/life/11113.html\"><em>Zerkalo</em></a>. The arrest comes after Bernstein’s personal information was shared on GOBUPiK’s public Telegram channel. Bernstein is <a href=\"http://www.encyclopedia.ru/news/enc/detail/38080/\">one of the top 50 editors of Russian Wikipedia</a>. </p><p id=\"xhuODc\"><em>The Verge</em> was able to confirm that Bernstein’s information — including his social media, Wikipedia handle, and place of work — had been shared in GUBOPik’s channel on the messaging app. A video of Bernstein’s arrest was also posted alongside his photo and personal details. In the photo itself, Bernstein is accused of “distributing fake anti-Russian information.” The channel has since been made private. </p><p id=\"ZpffSL\"><em>Zerkalo</em> also reports that Berstein had been accused of editing Wikipedia articles about Russia’s invasion of Ukraine. However, none of the information in the Telegram channels clearly specifies exactly what, if anything, Bernstein has officially been charged with. In an <a href=\"https://www.wikidata.org/wiki/Special:CentralAuth?target=Pessimist2006\">activity log</a> of Bernstein’s purported Wikimedia username, you can see that he’s made over 200,000 edits to Russian Wikipedia articles. Currently, his account is described as “blocked indefinitely.”</p><p id=\"EpAUlf\">In the Russian Wikipedia channel on Telegram, users in Belarus and Russia were also advised to hide personal data and to only edit articles about the war from other accounts.</p><p id=\"rWct2M\">Belarus has offered logistical support throughout the Russian invasion of Ukraine, serving as a staging area for units moving towards the Ukrainian capital of Kyiv. Earlier today, Ukraine said that Belarus may be <a href=\"https://www.reuters.com/world/ukraine-says-russian-aircraft-fired-belarus-ukrainian-air-space-2022-03-11/\">planning to join the invasion</a> with its own military, alleging that Russia had staged a “false-flag” attack to provoke the country’s involvement.</p><p id=\"cUl5tR\">Last week, Russian President Vladimir Putin signed a law that punishes people spreading “fake news” <a href=\"https://www.theverge.com/2022/3/4/22961472/russia-fake-news-law-military-ukraine-invasion-casualties-jail-time\">with up to 15 years in prison</a>. Roskomnadzor, the country’s tech and communications agency, also <a href=\"https://www.theverge.com/2022/3/3/22960007/russia-wikipedia-wikimedia-foundation-censorship-demand\">threatened to block Wikipedia</a> over the Russian-language page on the current invasion of Ukraine. At the time, the Wikimedia Foundation issued a statement in support of Russian Wikipedia editors.</p><p id=\"6poZ5O\">Reached for comment, a Wikimedia Foundation spokesperson said the group was watching the situation closely. “The Foundation’s Trust and Safety and Human Rights teams have been monitoring the ongoing crisis in Ukraine,” the spokesperson said, “and are in close touch with our communities in the region to ensure their safety and respond to their needs.”</p><p id=\"zi8GtI\"><em><strong>Correction, March 11, 2022, 6:20PM: </strong></em><em>A previous version of this article stated Mark Bernstein had edited over 200,000 articles on Russian Wikipedia. This has been corrected to over 200,000 edits. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bY8p4reZ9fYnB4E4Krpf3w0fyjg=/0x291:2800x1757/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285874/Wikipedia_logo_v2.svg.png",
  "description": "The editor had been doxxed prior to the arrest",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}