{
  "title": "A walk through the end with Naoki Yoshida",
  "url": "https://www.theverge.com/2022/4/29/23048457/ffxiv-naoki-yoshida-interview-square-enix",
  "date": "2022-04-29T18:37:05.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"Naoki Yoshida (Video Game Developer) Portrait Shoot, London\" src=\"https://cdn.vox-cdn.com/thumbor/XjMRdLjSGw-k1uegS6KqeedIQNc=/0x0:6605x4403/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70811522/1232398922.0.jpg\" />        <figcaption>Photo by Olly Curtis/Future Publishing via Getty Images</figcaption>    </figure>  <p>The celebrated game director shared insight into the process of crafting Final Fantasy XIV: Endwalker’s story</p> <p id=\"d0qDl9\">The problem with a lot of long-lived MMOs is that, eventually, the villains get so powerful that they become absurd. But Naoki Yoshida, game director of <em>Final Fantasy XIV</em>, isn’t worried about villain power creep. In an interview with <em>The Verge</em>, the celebrated director of the phenomenally popular <em>Final Fantasy XIV </em>MMO shared insight into <a href=\"https://www.theverge.com/2022/1/11/22877031/final-fantasy-xiv-endwalker-review-square-enix-pc\"><em>Endwalker</em>’s phenomenal story</a> and why he’s not worried about creating an even bigger Big Bad.</p><p id=\"QuK1pv\">In <em>Final Fantasy XIV: A Realm Reborn</em>, the game’s final boss is the military general of a fascist nation and an ancient being bent on destruction and death. After that, in the <em>Heavensward </em>expansion, players fight ancient alien dragons who, after years of conflict with the mortal races of the world, are unable to put aside their hate and work toward a peaceful coexistence. In <em>Stormblood</em>, the warriors of light fought a megalomaniacal despot imbued with the powers of a dragon god, and in <em>Shadowbringers,</em> you fought that despot’s even more powerful great grandfather. Finally, in the most recent expansion <em>Endwalker</em>, players face and defeat the embodiment of hopelessness and sorrow. </p><p id=\"Ecqje1\">One would imagine, in light of ever-increasing stakes and ever more powerful enemies, it’d be tough for Yoshida’s team to craft a villain more threatening than essentially death itself. But when I asked him if he was at all worried that he and his team painted themselves in a corner, he simply said, “No.”</p><p id=\"XaePGG\">“The world is always full of mysteries,” Yoshida said via email. “And, even in real-world affairs, some unbelievably sorrowful incidents do happen. They may not necessarily be from some overwhelming threat; they could be horrors born from personal ideology, or tragedies caused by a concentration of power, or things that arise as a result of beliefs based on religion or education. So as we clumsily try our best to understand and overcome various barriers between ourselves, we’re still a long way off from where we want to be.”</p><div class=\"c-float-right\"><aside id=\"DDmAft\"><q>“The world is always full of mysteries.”</q></aside></div><p id=\"Xa3SZM\"><em>Endwalker</em>’s story puts a far-too-neat-to-be-coincidental bow on plotlines that began way back in 2012 with <em>A Realm Reborn</em>. I asked Yoshida if the parallels between <em>ARR</em> and <em>Endwalker</em> were a happy accident or something meticulously planned over these last 10 years.</p><p id=\"HHPEuL\">“If you were to ask if I ad-libbed it, well, that would be the case,” Yoshida said with a translator’s note indicating a little laugh. “We were careful to leave room for adjustments to some degree when scattering parts and foreshadowing, which may have contributed to everything seeming to have been planned from the beginning.”</p><p id=\"YG04Ux\">Yoshida and his team may not be the master long-term planners <em>Endwalker</em>’s story might imply, but some elements of the story were crafted to intentionally dovetail with things set in motion a decade ago. In my review of <em>Endwalker</em>, I called the game a “songfic” set to “<a href=\"https://youtu.be/39j5v8jlndM\">Answers</a>,” the theme song of <em>A Realm Reborn</em>, and Yoshida confirmed my assertion. </p><p id=\"4sXsQx\">“We intentionally created the story to fit the song’s lyrics, so yes, that was intentional,” he said.</p><p id=\"CbYXEs\">In addition to being an incredible and emotional story, <em>Endwalker</em> introduced new features that put an interesting spin on <em>FFXIV</em>’s traditional MMO gameplay. For example, in most MMOs, you must complete dungeons with a party of other players. In <em>Shadowbringers</em> and again in <em>Endwalker</em>, Yoshida’s team introduced the trust system that allowed players to complete dungeons with a party of NPCs. The trust system can massively reduce a player’s wait in a dungeon queue and is also a great way for them to learn a boss’s mechanics without fear of slowing other, more advanced players down at the cost of dungeons taking a bit longer than usual. I wanted to know how Yoshida planned to innovate on the MMO format in future expansions. </p><div class=\"c-float-right\"><aside id=\"E7Oy6t\"><q>“There’s no limit to the mysteries and excitement that await in all the adventures to come.”</q></aside></div><p id=\"KO9hEU\">Yoshida responded that he’s still in the honeymoon phase of planning the next expansion and would like to remain there for now.</p><p id=\"sKRgJA\">“Things are the most fun when I’m fantasizing and imagining what sort of things I can make, and the process of shaping those thoughts into reality is when it’s very painful,” he said. “So please give me a little more time to enjoy my fantasy :P.” </p><p id=\"rU4St0\">Another facet of <em>FFXIV</em>’s powerful appeal are the characters your warrior of light befriends and be-enemies. In <em>Shadowbringers</em>, you spend the majority of the time fighting against a man named Emet-Selch, a powerful immortal being who wants to destroy your world because he believes it will bring back his own ruined world. But by <em>Shadowbringers</em>’ end and throughout most of <em>Endwalker,</em> Emet-Selch has become a friend — one you even call upon to help you defeat <em>Endwalker</em>’s final boss.</p><p id=\"VNBaOi\">As its name implies, <em>Endwalker </em>deals with the themes of closure and endings. Throughout the game, your NPC companions talk about what they’ll do after everything is over, suggesting that your time together as this motley crew of world-savers is, after so long, at its end. It’s a sad moment because it feels like, once this trial is over, the warrior of light will no longer have a reason for existence. Then, Emet-Selch gives you a gift — he tells you that there are still mysteries in the world for you to discover and explore. It’s a powerfully moving moment because it’s Emet-Selch — a man who had at one time been your immortal enemy — and not one of your many friends who restores to you a reason to keep going. I had to know why the story was written this way and what that might mean for the warrior of light’s and Emet-Selch’s relationship. </p><p id=\"N5cwVC\">Yoshida knew there would be concerns about <em>Endwalker</em>’s end.</p><p id=\"LZ3St7\">“With how cleanly <em>Endwalker</em> reaches its conclusion, there may be people out there who feel uncertain about future adventures,” he said. “That’s precisely why I had Emet-Selch take on the role of chiding like, ‘What’s with that lonely look, as though you know and have adventured through everything there is to see in the world? That’s nonsense, there are so many views you’ve yet to see. I’ve seen them; now you go see them, too.’”</p><p id=\"2dMAKh\">Interestingly, the mysteries Emet-Selch shared with the warrior of light are now exactly what the latest patch explores. He told you to investigate the mysteries of the 12 deities that Eorzeans worship, and in the Aglaia raid, released with patch 6.1, players will do just that. I asked Yoshida if all of Emet-Selch’s <em>Endwalker</em> revelations were a sneaky hint at what’s to come in future expansions.</p><p id=\"oFlbJc\">“The story of FFXIV has always been woven together with a thorough schedule and regular patches,” he said. “We’ve always readied our overall plans two years in advance, and that hasn’t changed this time either. Having said that, I don’t think it’s necessarily possible to go to all the places Emet-Selch mentioned in two years, but it sure would be nice if we could visit those places someday.” (The translator’s note mentions a grin from Yoshida, which may indicate Emet-Selch’s gift may yet have implications for future Final Fantasy XIV stories.)</p><p id=\"CFz1aT\">“This is also a message from us,” he said. “About how there’s no limit to the mysteries and excitement that await in all the adventures to come.”</p><p id=\"ZL48fB\"></p><p id=\"INyScS\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Yt7JcrR3YYLXyN3QVsFgrNsgdmQ=/0x145:6605x3603/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23426053/1232398922.jpg",
  "description": "There’s no limit to the mysteries and excitement that await.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}