{
  "title": "A warming world gives viruses more chances to hitchhike from species to species ",
  "url": "https://www.theverge.com/2022/4/28/23044725/climate-change-zoonotic-virus-spillover",
  "date": "2022-04-28T09:00:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Annual Bat Migration\" src=\"https://cdn.vox-cdn.com/thumbor/1pm7YqnFvNWlX0UFSgEWcEHSxFE=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70803382/496473194.0.jpg\" />        <figcaption>Straw-coloured fruit bats at their daytime roosts in ‘Mushitu’ or ever-green swamp forest in April, 2014, Kasanka National Park, Zambia. | Photo credit should read Nick Garbutt/Future Publishing via Getty Images</figcaption>    </figure>  <p id=\"imFRjF\">Climate change is pushing mammals into new territory, increasing the number of opportunities for viruses to jump from species to species — including humans. By 2070, if global temperatures continue to rise as predicted, there could be a total of 15,000 new cross-species “viral sharing events,” according to new <a href=\"https://www.nature.com/articles/s41586-022-04788-w\">research</a> published today in the journal <em>Nature</em>. </p><p id=\"HngjBY\">Of the at least <a href=\"https://pubmed.ncbi.nlm.nih.gov/31182813/\">10,000 virus species</a> in mammals capable of infecting humans, most are still only circulating among animals in the wild. The worry is that more of those viruses could eventually make the leap to humans, potentially<strong> </strong>sparking a health crisis like the COVID-19 pandemic.</p><p id=\"HcQl8q\">“Ultimately, this work provides us with more incontrovertible evidence that the coming decades will not only be hotter but sicker,”<strong> </strong>Gregory Albery, a disease ecologist at Georgetown University and co-lead author of the study, said in a call with reporters. </p><div class=\"c-float-left\"><aside id=\"w0dc60\"><q>“The coming decades will not only be hotter but sicker”</q></aside></div><p id=\"bfyXGO\">As global temperatures rise, many species might need to migrate because the climate they’re used to living in is changing. Others might find that places that were once inhospitable — maybe they were too cold — are becoming more enticing. As they travel, they bring pathogens with them.<strong> </strong>Essentially, viruses now have more hosts with whom they can hitchhike long distances. That allows viruses to reach places and species that they otherwise wouldn’t have had access to in the past. </p><p id=\"OtKbNP\">“Even now, this process has likely been taking place, mostly unobserved and below the surface, and we need to start looking for it,” Albery said.</p><p id=\"RPUaNP\">When a virus passes<strong> </strong>from one species to another, it’s called a “<a href=\"https://www.theverge.com/21314971/phone-mining-pandemic-link-coronavirus-spillover-minerals-electronics\">spillover</a>” event. If spillover occurs between an animal and a human being, a zoonotic disease can emerge. The virus that causes COVID-19 is a zoonotic virus, which means it can move between humans and other animals. There’s <a href=\"https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(20)30641-1/fulltext\">evidence</a> the novel coronavirus originated in bats. But it probably <a href=\"https://www.frontiersin.org/articles/10.3389/fmicb.2020.580137/full\">jumped to at least one other animal</a> before reaching humans.</p><p id=\"KORWyC\">The authors of the new study looked at potential changes to the geographical ranges of over 3,000 mammal species in a warming world. They also took into consideration how land use might change, say from deforestation and urban development. </p><p id=\"PoQGYa\">There could be over 300,000 “first encounters” between different kinds of animals in a future with two degrees of global warming above pre-industrial levels, the research shows. Most of those encounters would probably take place in tropical Asia and Africa. And that could lead to 15,000 transmission events in which at least one novel virus moves from one species to another. A majority of the projected viral sharing involves bats, which are unique among mammals because they can fly from continent to continent. </p><p id=\"hhRKP0\">The researchers stop short of estimating how often viruses might then hop over to humans. And not every virus that finds its way from an animal to a human triggers an epidemic.<strong> </strong>But Albery noted on the press call that when a virus jumps to a new species, it can create conditions that might help the virus evolve into one that’s “particularly well suited or well placed to make the jump into humans.” </p><p id=\"FBBPCV\">Take <a href=\"https://www1.nyc.gov/site/wildlifenyc/animals/raccoons.page\">raccoons</a>, which can thrive in forests, marshes, suburbs, and city centers. If those resourceful raccoons suddenly become susceptible to a new virus, they might be much more able to bring that virus into places where humans live. And since the virus has already made one leap from another kind of animal to a raccoon, then the virus has demonstrated that it’s prone to jumping between species.</p><div class=\"c-float-right\"><aside id=\"iaoe0t\"><q>“We have to take that seriously as a real-time threat”</q></aside></div><p id=\"y8g3Vy\">The new paper suggests that these trends are already underway and will be a problem even under some of the best-case scenarios for future climate change. We’re <a href=\"https://climateactiontracker.org/global/temperatures/\">well on our way</a> toward surpassing that two-degree threshold; the world has already warmed by over one degree. </p><p id=\"VjeNXa\">The COVID-19 pandemic emerged shortly after this research was completed, which the authors say points to the urgent need to prepare for more spillover. “We have to take that seriously as a real-time threat,” Georgetown University biologist Colin Carlson, another lead author of the study, said on the call. “We have to acknowledge that climate change is going to be the biggest upstream driver of disease emergence. And we have to build health systems that are ready for that.”</p><p id=\"InvDQA\">That includes pairing surveillance of new viruses with observations of how species’ geographic ranges are shifting, the authors say. It’s part of a bigger movement to adopt a concept called <a href=\"https://www.cdc.gov/media/releases/2021/s1103-one-health.html#:~:text=The%20virus%20that%20causes%20COVID,both%20people%20and%20animals.\">One Health</a>, which acknowledges that the health of animals, people, and the environment <a href=\"https://www.theverge.com/2020/4/10/21216165/pandemic-prevention-sciencetist-animal-human-health-disease\">are all connected</a>.</p><p id=\"WvJtNY\"></p><p id=\"Psfwrk\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dAnhXYP-wba9LhJ8zLHwfLQVRy4=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23420588/496473194.jpg",
  "description": "Humans need to prepare now, researchers say.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}