{
  "title": "A year after LG left the smartphone business, Samsung is the big winner",
  "url": "https://www.theverge.com/23033944/lg-mobile-samsung-galaxy-a32-5g-motorola-oneplus-us-market-share",
  "date": "2022-04-20T18:36:31.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WZoBxgVjRjICLPoEHtIdrn5ruag=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70772622/ajohnson_220405_5129_0005.0.jpg\" />        <figcaption><em>Samsung was well-positioned to scoop up a big chunk of the market share LG left behind with its affordable A-series phones.</em> | Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p>The Galaxy got even bigger </p> <p class=\"p--has-dropcap p-large-text\" id=\"HrCD4k\">Just over a year ago, <a href=\"https://www.theverge.com/2021/4/4/22346084/lg-exits-smartphone-business\">LG announced that it was leaving the smartphone business</a>. It wasn’t an entirely surprising move since the company’s mobile division <a href=\"https://www.theverge.com/2021/1/20/22240282/lg-smartphone-business-exit-2021-internal-memo\">had been posting huge losses for years</a>. All the same, it <a href=\"https://www.theverge.com/2021/4/11/22375938/lg-smartphone-business-exit-tcl-motorola\">left a significant void in the US smartphone market</a>, especially in the prepaid device space where LG had a strong presence. </p><p id=\"Z5BDHq\">This new vacancy presented an intriguing opportunity for another Android device maker to fill the void — maybe OnePlus, which had recently started bringing budget phones to the US. Or maybe another Chinese brand like Xiaomi could finally get a foothold in the US.</p><p id=\"WimoAx\">The obvious answer, Samsung, turned out not to be a challenger. Samsung is already the second-largest smartphone brand in the US, and its A-series phones have been the big winners in LG’s absence. <a href=\"https://www.counterpointresearch.com/q4-2021-us-smartphone-market/\">According to Counterpoint Research,</a> Samsung’s A-series phones contributed to its 11 percent year-over-year sales growth in Q4 of 2021. It notes that the Galaxy A12 was the best-selling Android device in the US in 2021 and that <a href=\"https://www.counterpointresearch.com/us-smartphone-volumes-grow-1-yoy-q3-2021-apple-leads-motorola-becomes-third-largest-oem-lgs-exit/\">the Galaxy A32 5G was a strong seller at Metro by T-Mobile</a>, the country’s largest prepaid brand. </p><div><aside id=\"4n7GYy\"><q>The smartphone market in the US was a two-party system long before LG left the space, and it’s even more of one with LG gone</q></aside></div><p id=\"A06M7q\">It hasn’t been a complete landslide; Motorola picked up some would-be LG customers, and OnePlus did gain a little traction. But the smartphone market in the US was a two-party system long before LG left the space, and it’s even more of one with LG gone. </p><p id=\"3KxPVp\">While we’re declaring a winner, let’s be clear who the loser is, and it’s certainly <em>not</em> LG. Longtime tech analyst Avi Greengart can see that, despite his sentiments about covering the company’s mobile division. “They were exciting to cover, but the bottom line is that LG’s phone division was losing hundreds of millions of dollars a year, and had no clear path to profitability. LG as a conglomerate has plenty of profitable products and product lines. The cold, hard logic of cutting this loose, it does make sense.”</p><p id=\"ntILFn\">LG’s doing fine. We, the people who buy smartphones and now have fewer choices on our store shelves, are the ones who lost out. We’ve got one less option when it comes time to pick a new phone, and one less reason to stray from Apple and Samsung, the dominant brands in the US smartphone market.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0TZwOtM9teN7NEnh0AqXSFZr0Cw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22654068/ajohnson_20210608_4627_0001.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The Galaxy A32 5G has been one of the company’s top-selling devices in the US since it debuted last year.</em></figcaption>  </figure></div><p id=\"2h5kFF\">What made Samsung such a good candidate to fill LG’s vacancy? Strong brand recognition, for one. Jeff Moore, an analyst at Wave7 Research, says that’s especially important in prepaid. “As a general rule, if you’re switching over to a prepaid carrier, from another prepaid carrier, you’re going to opt for the most expensive free phone. And the brand name is a big help with that. So, that provides a giant tailwind to Samsung when people are switching over from one carrier to another.”</p><p id=\"iDqQSN\">Samsung was in a good position logistically, too. The company already has strong relationships with US wireless carriers. Without them, it’s very hard to sell smartphones in the US. The company also had devices at the right price points at the ready with <a href=\"https://www.theverge.com/2021/4/7/22370189/samsung-galaxy-a52-a42-a32-5g-a12-a02s-price-specs-price\">no less than five A-series devices</a> in its budget phone portfolio in 2021.</p><p id=\"sQgQzV\">And then there’s the fact that Samsung’s A-series phones are just plain good. More often than not, they’re the best option at every price point under $500. Samsung has also been making important improvements on the software side, too. It offers the longest security support policy among Android phones sold in the US with some A-series models getting <a href=\"https://security.samsungmobile.com/securityPost.smsb\">up to five years of security updates</a>. It’s also been working on getting major OS version upgrades to older devices sooner. Case in point: <a href=\"https://www.xda-developers.com/samsung-galaxy-a32-5g-a71-4g-one-ui-4-1-android-12/\">last year’s A32 5G is starting to get Android 12</a> even as <a href=\"https://www.theverge.com/2022/4/19/23027444/oneplus-nord-n20-5g-specs-price-screen-availability\">new devices from other manufacturers</a> still ship with Android 11.</p><div class=\"c-float-left c-float-hang\"><aside id=\"c251pw\"><q>Samsung had devices at the right price points at the ready, with no less than five A-series devices in its budget phone portfolio</q></aside></div><p id=\"xrohkw\">As Greengart points out, the company also has the advantage of getting paid more than once when it sells a phone. “Samsung uses its own displays, its own semiconductors in some cases, and its own memory chips. So adding volume hits its bottom line not just on the sale of the phone, but on the sale of the components as well.”</p><p id=\"QLAc64\">No doubt, Samsung had the incentives and the right pieces of the puzzle to go after LG’s vacated market share, a strategy that has paid off. <a href=\"https://www.counterpointresearch.com/us-market-smartphone-share/\">Counterpoint’s reporting</a> shows that, in Q4 of 2020, Samsung owned 16 percent market share in the US. In Q4 of 2021, that number was up to 22 percent. In January of 2022, the Galaxy A32 5G was the fifth-best selling phone in the US — behind four iPhone models. If anything, Samsung has underperformed thanks to trouble keeping its products in stock. Counterpoint notes that, in Q2 of 2021, “Shortages, especially for A-series devices somewhat stifled Samsung’s growth potential.”</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/exupepktApYiQyWFy5QUaXPP8pM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385634/ajohnson_220411_5138_0004.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>Following LG’s exit, Motorola is now the only manufacturer to offer a budget-friendly device with a built-in stylus.</em></figcaption>  </figure></div><p id=\"AtgpR2\">Motorola’s gains were significant, too. Prior to LG leaving the space, Motorola held around 5 percent market share in the US. After Q1 2021, it jumped up to around 10 percent. (Counterpoint pegs it at 12 percent share in Q4 of 2021, quite a jump from 3 percent in the same period of 2020.) In particular, the Moto G Pure helped, and it <a href=\"https://www.theverge.com/22787370/moto-g-pure-review-4g-android-budget-phone\">stands out as a very good device in the under-$200 category</a>. That’s been enough to propel it to the No. 3 slot in market share — but it’s a distant third place behind Samsung, lagging by 10 or 20 percentage points depending on the quarter.</p><p id=\"yWQ6As\">If Samsung and, to a lesser extent, Motorola were able to fill the void LG left so quickly, are we really missing much with its absence? Both Greengart and Moore think so. Greengart also points to LG’s willingness to innovate, mentioning that the company was the first to put five cameras on a smartphone and the first to adopt the ultrawide camera as a complement to the main rear camera. “We do lose something when companies that tried different things leave the market,” he says.</p><p id=\"PbT7j4\">He also notes that LG phones were often discounted, too, which made them an appealing Samsung alternative. “LG always priced its phones equivalent to Samsung. Then they very quickly dropped in price because they weren’t as good. That opened up sort of a bargain: a phone that’s almost as good as Samsung for a lot less money… and [now] that phone is not available.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"NS8b9q\"><q>Even a brand as recognizable as Google hasn’t been able to put a dent in the duopoly</q></aside></div><p id=\"zE4F8Y\">LG left a little room for movement in the prepaid space, but overall the US is undeniably dominated by two brands: Apple and Samsung. It’s hard to imagine that changing anytime soon. Even a brand as recognizable as Google <a href=\"https://www.pcmag.com/news/up-against-flashy-flagships-iphone-se-and-pixel-6-struggle-to-find-buyers\">hasn’t been able to put a dent in the duopoly</a>. Moore cites the Pixel 6 as a case study in what happens when a challenger puts all of the pieces together and really goes after some of that market share. “We got very, very low share figures for Google Pixel despite having a complete ad blitz, a good, well-known brand name and availability with all carriers.” It’s hard to imagine a brand with more household name recognition than Google, and yet the Pixel remains a cult favorite.</p><p id=\"H439Ll\">Moore sums up the entire market situation, commenting on speculation that OnePlus could make a run at the duopoly. “There had been some hope that maybe they could make it a three-way game… but they’re still in the low-to-mid single digits, and it’s not really a game.” </p><p id=\"4CCrvR\">Samsung didn’t grab all of the market share that LG left behind, but it gained enough to consolidate an already insurmountable lead. Game, set, match.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EbP4znl0O3WvDCTJHAbqgpFZcvU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23371623/ajohnson_220405_5129_0005.jpg",
  "description": "The US phone market duopoly got even stronger.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}