{
  "title": "Activision Blizzard and Epic Games halt sales of games in Russia",
  "url": "https://www.theverge.com/2022/3/5/22963195/activision-blizzard-halts-new-game-sales-russia-ukraine-invasion",
  "date": "2022-03-05T22:53:49.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H8pzIv2zSxyYyvlUGLJE5nsBw4o=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70584077/acastro_210729_1777_blizzard_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"zxxolq\">Activision Blizzard is suspending new sales “of and in” its games in Russia, the game company’s president Daniel Alegre announced in a <a href=\"https://activisionblizzard.com/newsroom/2022/03/supporting-the-ukrainian-people\">publicly-shared letter to employees</a> (via <a href=\"https://www.eurogamer.net/articles/2022-03-05-activision-blizzard-suspends-new-sales-of-and-in-it-games-in-russia\"><em>Eurogamer</em></a>). The move bars Russians from any new transactions with the company, which includes both the sales of its games and in-game purchases.</p><p id=\"EPijgK\">The press release doesn’t specify whether the ban includes both digital <em>and</em> physical games. It does, however, highlight some of the contributions the company and its employees made to Ukraine, and also offers resources to workers affected by the war. The crisis in Ukraine comes at a sensitive time in Activision Blizzard’s history — the company <a href=\"https://www.theverge.com/2022/1/20/22894005/blizzard-boss-mike-ybarra-changes-blog-activision-microsoft\">continues to face criticism</a> after it was sued for <a href=\"https://www.theverge.com/2021/7/22/22588215/activision-blizzard-lawsuit-sexual-harassment-discrimination-pay\">allegedly fostering a toxic workplace culture</a> last year.</p><div class=\"c-float-right\"><aside id=\"pN6Fxn\"><q>Activision Blizzard joins a growing list of game companies</q></aside></div><p id=\"AQC5wC\">“We are doing everything possible to assist employees, and their families, who are being directly affected by this tragedy,” Alegre says in the letter. “If you or a colleague needs support, please don’t hesitate to reach out to your manager or local HR leaders. I’d also like to remind you that our Employee Assistance Program is available to those who need emotional support during this difficult time.” </p><p id=\"DkH4fl\">Activision Blizzard joins a growing list of game companies that have stopped doing business in Russia. Microsoft, which <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">announced its plans to purchase Activision Blizzard</a> in January, <a href=\"https://www.theverge.com/2022/3/4/22961445/microsoft-russia-ukraine-sales-ban-xbox-azure-windows-office\">has moved to ban “new” sales of its products and services</a> in Russia and Belarus — a block that not only includes Xbox games, but also products associated with Windows, Office, Microsoft 365, and more.</p><p id=\"l91sfj\">Meanwhile, <a href=\"https://www.theverge.com/2022/3/2/22958329/ea-sports-fifa-nhl-russia\">EA Games removed Russian teams</a> from its FIFA and NHL games, and later <a href=\"https://www.theverge.com/2022/3/4/22961673/ea-halting-sales-games-content-currency-russia-belarus\">cut off all sales to Russia and Belarus</a>. <em>Cyberpunk 2077</em> developer <a href=\"https://www.theverge.com/2022/3/3/22959975/cd-projekt-red-gog-cuts-off-sales-russia-belarus-mykhailo-fedorov\">CD Projekt Red has also taken similar steps</a> in barring physical and digital sales to customers in both countries. Activision Blizzard notably hasn’t blocked sales to Belarus, Russia’s economic partner. <em>The Verge</em> reached out to Activision Blizzard with a request for comment but didn’t immediately hear back.</p><div id=\"uyRZaP\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Epic is stopping commerce with Russia in our games in response to its invasion of Ukraine. We’re not blocking access for the same reason other communication tools remain online: the free world should keep all lines of dialogue open.</p>— Epic Games Newsroom (@EpicNewsroom) <a href=\"https://twitter.com/EpicNewsroom/status/1500236775448588295?ref_src=twsrc%5Etfw\">March 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"jU3ZRp\">Shortly after Activision Blizzard’s announcement, Epic Games stated that it’s “stopping commerce with Russia” in its games, and notes that it won’t ban Russian players from accessing them. It’s unclear whether the <em>Fortnite</em> developer’s ban on commerce applies to microtransactions, games, or both.</p><p id=\"BLF6np\">Earlier this week, Ukrainian vice prime minister Mykhailo Federov <a href=\"https://twitter.com/FedorovMykhailo/status/1498945221337534469\">called for Xbox and PlayStation</a> to “temporarily block” Russian and Belorussian accounts and halt their participation in esport events. He <a href=\"https://twitter.com/FedorovMykhailo/status/1499307028430401536\">later asked</a> a number of developers, including Epic Games, Nintendo, Rockstar, and Tencent to halt their games in Russia.</p><p id=\"MuS443\"><em>Disclosure: Casey Wasserman is on the board of directors for Activision Blizzard as well as the board of directors of Vox Media, The Verge’s parent company.</em></p><p id=\"ar553O\"><em><strong>Update March 5th 5:53PM ET: </strong></em><em>Updated to add that Epic Games has also banned sales in Russia.</em></p><p id=\"4dm4s5\"><em><strong>Correction March 6th 9:00AM ET:</strong></em><em> A previous version of the story mistakenly referred to Mykhailo Federov as the vice prime minister of Russia, when he is the vice prime minister of Ukraine. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YB3mKbDW2qyFagrVAb5IVVLU79k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22749476/acastro_210729_1777_blizzard_0002.jpg",
  "description": "Activision Blizzard and Epic join the list",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}