{
  "title": "Activision Blizzard confirms vaccine mandate is over, employees will walk out April 4th",
  "url": "https://www.theverge.com/2022/4/1/23007115/activision-blizzard-workers-walkout-vaccine-mandate-a-better-abk",
  "date": "2022-04-01T23:59:29.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6gUgaxaxMpNrm19UHT1KTsWlh3Q=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70700759/acastro_210729_1777_blizzard_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"nnMDXp\">Activision Blizzard is officially lifting its vaccine mandate for US corporate employees, and workers have announced they plan to walk out in protest. The company confirmed to <em>The Verge</em> that it has already ended the mandate, and A Better ABK, an organization of Activision Blizzard employees advocating for better working conditions, <a href=\"https://twitter.com/ABetterABK/status/1509999545459134469\">announced Friday</a> that employees will walk out of work on April 4th at 1PM ET in protest.</p><p id=\"qvkpoQ\">Jessica Gonzalez, a former Activision Blizzard employee and a founder of A Better ABK, originally revealed that the company was changing its vaccine policy <a href=\"https://twitter.com/_TechJess/status/1509673087872110601\">on Twitter Thursday evening</a>. In a series of screenshots, she shared the text of an email sent by Brian Bulatao, the company’s chief administrative officer. “Effective immediately, we are lifting our vaccine mandate for all US employees,” Bulatao says in the text shared by Gonzalez. Bulatao also discussed the company’s return-to-office policies, though acknowledged that they differed across the business. <em>Bloomberg</em> gaming journalist Jason Schreier reported on the email <a href=\"https://twitter.com/jasonschreier/status/1509677643133865988\">shortly after</a>. </p><div id=\"yFr0dL\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">LEAKED: Brian Bulatao emailed all of ABK to talk returning to office in June. They will not be enforcing proof of vaccination. I’m sure the ‘benefits’ of in person collaboration is actually so employees organizing can be followed and monitored closely. Do not die for this company <a href=\"https://t.co/MSOwWVYBR3\">pic.twitter.com/MSOwWVYBR3</a></p>— Jessica Gonzalez   is a chair   (@_TechJess) <a href=\"https://twitter.com/_TechJess/status/1509673087872110601?ref_src=twsrc%5Etfw\">March 31, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"CpJvSI\">“As part of returning to office, Blizzard and Activision Blizzard held several feedback sessions and polls over the course of three months, at the end of which they decided to mandate the vaccine for workers coming into office,” a representative for ABK Workers Alliance <a href=\"https://www.polygon.com/23007018/activision-blizzard-workers-walkout-vaccine-mandate-dropped\">said to <em>Polygon</em></a>. “This was the agreement under which people agreed to come back. This recent change was not run by any employees before being announced.”</p><p id=\"n64OYm\">On Friday, Bulatao sent another email to clarify the company’s policies — seemingly assuring employees that not all of them will need to return to work if they’re uncomfortable.  “For the majority of our employees, we are still operating under a voluntary return to office opportunity,” he said in the email, which was shared with <em>The Verge</em>. “Although we are not on a company-wide basis requiring vaccinations to enter our buildings in the US, it is still up to the leaders of Activision Publishing, Blizzard, and King to determine the processes and policies that work best for their employees and locations based on local conditions and risk.”</p><p id=\"qfXI5F\">Schreier <a href=\"https://twitter.com/jasonschreier/status/1510029374602592256\">also reported</a> that Blizzard chief Mike Ybarra sent an email Friday saying that Blizzard, specifically, will require vaccination for the next few months at least.</p><div id=\"pq02gQ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At the same time, Blizzard boss Mike Ybarra emailed staff saying they'll continue to require vaccination for at least the next few months and that about 80% of their employees in Irvine, Austin, and Albany have uploaded proof of vaccination</p>— Jason Schreier (@jasonschreier) <a href=\"https://twitter.com/jasonschreier/status/1510029374602592256?ref_src=twsrc%5Etfw\">April 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"mLzJGu\">A Better ABK made <a href=\"https://twitter.com/ABetterABK/status/1509999547375886355\">three demands of the company</a> on Friday, which I will quote below and which you can see in the embedded tweet that follows:</p><blockquote><p id=\"aAtMxO\">An immediate reversal to lifting the vaccine requirement</p><p id=\"j2bIrk\">Remote work should be offered as a permanent solution</p><p id=\"SQlr4u\">The decision to work remote or in office should be made by each individual employee</p></blockquote><div id=\"TXe56x\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1. An immediate reversal to lifting the vaccine requirement<br>2. Remote work should be offered as a permanent solution<br>3. The decision to work remote or in office should be made by each individual employee</p>— ABetterABK   ABK Workers Alliance (@ABetterABK) <a href=\"https://twitter.com/ABetterABK/status/1509999547375886355?ref_src=twsrc%5Etfw\">April 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"hHODSc\">Following Activision Blizzard’s clarifications, the group retweeted <a href=\"https://twitter.com/valentine_irl\">a Blizzard employee</a> but has so far not posted its own response.</p><div id=\"oe0pqA\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Breaking: Brian Bulatao has conceded to allow each studio to choose their own vaccine mandate requirements. So far I've heard that Blizzard, QAMN, QALA, and QATX have reinstated a vaccine mandate. I hope to hear that all of my fellow ABK coworkers will be similarly protected.</p>— Valentine Powell   ️‍  ️‍⚧️ (@valentine_irl) <a href=\"https://twitter.com/valentine_irl/status/1510035716000026632?ref_src=twsrc%5Etfw\">April 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"X0w9hj\">It’s unclear how many workers are expected to walk out, and according to <em>Polygon</em>, “a representative for the group did not have an estimate number of participants.” Gonzalez didn’t reply to a Twitter DM, and the A Better ABK Twitter account didn’t reply to a tweet asking for clarification. Activision Blizzard didn’t immediately reply to a request for comment.</p><p id=\"B7Mgg7\">Activision Blizzard employees have previously walked out in response to the scandals that have plagued the company as of late. In July, staffers <a href=\"https://www.theverge.com/2021/7/28/22598410/activision-blizzard-employee-walk-out-protest-sexism-discrimination-lawsuit\">walked out</a> after <a href=\"https://www.theverge.com/2021/7/22/22588215/activision-blizzard-lawsuit-sexual-harassment-discrimination-pay\">the state of California’s sexual harassment</a> sued the company, and more than 350 people were in attendance, <a href=\"https://www.washingtonpost.com/video-games/2021/07/27/blizzard-employees-walkout/\">according to <em>The Washington Post</em></a>. More than 150 attended a walkout following an explosive <a href=\"https://www.wsj.com/articles/activision-videogames-bobby-kotick-sexual-misconduct-allegations-11637075680\"><em>Wall Street Journal</em> report</a> alleging CEO Bobby Kotick <a href=\"https://www.theverge.com/2021/11/16/22785457/activision-blizzard-bobby-kotick-ceo-wall-street-journal-wsj-report-allegations\">was aware</a> of sexual misconduct allegations at the company, <a href=\"https://www.polygon.com/22786117/activision-blizzard-walk-out-bobby-kotick-resignation-demands\">according to <em>Polygon</em></a>. And another walkout took place <a href=\"https://www.theverge.com/2021/12/6/22820549/activision-blizzard-raven-software-layoffs-walkout-call-of-duty\">following layoffs</a> of a dozen QA staffers who worked at a studio involved with the hugely-successful <em>Call of Duty</em> series, with at least 200 walking out, <a href=\"https://www.washingtonpost.com/video-games/2021/12/06/raven-software-walkout/\">according to <em>The Washington Post</em></a>.</p><p id=\"STlUUK\">Here’s Activision Blizzard’s full statement to <em>The Verge</em>, via spokesperson Kelvin Liu:</p><blockquote><p id=\"6RuLt8\">The health and safety of our employees is at the absolute forefront of everything we do, including our return to office policy. While Activision Blizzard’s U.S. vaccine mandate has been lifted, for the majority of our employees, we are still operating under a voluntary return to office opportunity. In addition, employees who are not comfortable returning to the office are encouraged to work with their manager and our HR team to explore options for working arrangements that suit their individual situations. We will continue to monitor conditions and make adjustments to the policy as needed.</p><p id=\"4Gv1yy\">We recognize some employees may be participating in a walkout to express their views. The company supports our employees’ right to express their opinions in a safe and nonthreatening way, and will not retaliate for any decision to participate in this walkout. The company also hopes that those who walk out will conduct themselves in a legal, safe, and nonviolent manner.  </p></blockquote><p id=\"Cdnigt\">And here’s the text of Brian Bulatao’s latest email:</p><blockquote><p id=\"VQ867V\"><strong>From: Brian Bulatao</strong></p><p id=\"kCQLiD\"><strong>Subject: Vaccine Policy Update</strong></p><p id=\"RY2hot\"><strong>Date: April 1, 2022</strong></p><p id=\"iiITBx\">Everyone,</p><p id=\"5zR2iv\">Yesterday, I shared an update that we are lifting our corporate vaccine mandate for all U.S. employees. As a result of questions that have emerged since, I want to clarify what this means in terms of decision making throughout our organization about what is best for a particular business unit or location.</p><p id=\"4beEVB\">First, from the beginning of the pandemic, we have always made the health and safety of employees our highest priority. Our decisions have been founded in implementing standards that meet or exceed local guidance in the communities where we live and work. And, for the majority of our employees, we are still operating under a voluntary return to office opportunity. We will continue to monitor conditions and make adjustments to the policy as needed.</p><p id=\"1qbf5I\">Although we are not on a company-wide basis requiring vaccinations to enter our buildings in the US, it is still up to the leaders of Activision Publishing, Blizzard, and King to determine the processes and policies that work best for their employees and locations based on local conditions and risk.</p><p id=\"QvmTV7\">Thank you for your feedback. We will continue to clarify our plans as we get closer to our full return date. </p><p id=\"jrJlyE\"> Brian</p></blockquote><p id=\"l0deUh\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/h2rSImaBZEuQcgdaZtZKS39sh_c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22749477/acastro_210729_1777_blizzard_0003.jpg",
  "description": "The company is officially lifting its vaccine mandate.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}