{
  "title": "Activision Blizzard’s new full-time jobs come with a bit of union busting",
  "url": "https://www.theverge.com/23015299/activision-blizzard-raven-software-unionizing-employees-qa-raises",
  "date": "2022-04-07T21:24:09.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3FlB9G7CnckDFPBYmCb79JEmJt8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70723552/acastro_210729_1777_blizzard_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"XFtLoc\">Hours after announcing <a href=\"https://www.theverge.com/2022/4/7/23015033/activision-blizzard-full-time-qa-game-tester-20-dollars-hourly\">it would convert over 1,000 temporary and contract QA employees </a>to full time and provide a minimum pay of $20 per hour, Activision Blizzard is stating that Raven Software QA workers will not be part of that deal. According to a <a href=\"https://www.bloomberg.com/news/articles/2022-04-07/activision-blizzard-makes-1-100-game-testers-full-time-employees\">report from <em>Bloomberg</em></a>, the QA testers at Raven Software <a href=\"https://www.theverge.com/2022/1/21/22894964/activision-blizzard-raven-software-employees-create-game-workers-alliance-union\">who recently organized as the Game Workers Alliance</a> will not be able to take advantage of the new pay minimum — something Activision Blizzard failed to mention upfront when it sent the initial news to media outlets. Excluding organizing employees from company-wide benefits seems to be Activision Blizzard’s latest move against the burgeoning labor movement going on at the company.</p><p id=\"QNAheE\">In a statement to <em>The Verge,</em> Activision Blizzard spokesperson Jessica Taylor confirmed <em>Bloomberg</em>’s findings, saying:</p><blockquote><p id=\"4J16VC\">“All QA at Raven are full-time and already have access to full company benefits and eligibility to participate in the company’s bonus program. Due to our legal obligations under the National Labor Relations Act, we cannot institute new pay initiatives at Raven at this time, because they would be new kinds of compensation change.”</p></blockquote><p id=\"JXRdR3\">In addition to that statement, Activision Blizzard also provided <em>The Verge</em> with a copy of the email that Brian Raffel, Raven Software studio head, sent out to employees. </p><blockquote><p id=\"CfOTOZ\">Team, <br><br>Today, it was announced that all US-based TEA and contingent QA workers will be converted to FTE. This news builds upon our conversions across AP studios that began in December of 2021. Through direct dialogue with each other, we improved pay, expanded benefits, and provided professional opportunities to attract and retain the world’s best talent. <br><br>As part of today’s news, those Activision QA teams will receive an increase in minimum hourly rates. In addition, when the conversions take place, those QA employees will have access to full company benefits and eligibility to participate in the company’s bonus program, the same way our Raven QA teams have already been able to. Due to our legal obligations under the National Labor Relations Act, we are prohibited from making new kinds of compensation changes at Raven at this time. <br><br>I encourage you to speak to any department lead, manager, or HR to learn more about the union, this process or to answer any specific questions about [this] news.</p><p id=\"GXhEhA\"><br>As always, I will share more specifics when I can. I’m excited about what this could mean for our teams. </p></blockquote><p id=\"Hi7mQb\">The email seems expertly crafted to have a chilling effect on the Game Workers Alliance’s continued efforts to establish the company’s first union. Phrasing like “through direct dialogue with each other, we improved pay, expanded benefits, and provided professional opportunities” sends the message that organizers’ union activities have prevented them from enjoying the benefits the company is extending to others. </p><p id=\"ooiNZf\">As Activision Blizzard has not voluntarily recognized the union, <a href=\"https://www.theverge.com/2022/1/25/22901563/raven-software-union-game-workers-alliance-activision-blizzard\">the next step in the process</a> involves a vote overseen by the National Labor Relations Board (NLRB). If a majority of voters decide in favor of a union, it must be recognized and bargaining must begin. That vote has not yet happened, and excluding Raven QA from the company-wide QA improvements might intimidate employee-organizers and fence-sitters into voting against unionization. </p><p id=\"sdAklu\">The Communications Workers of America (CWA), which helps form and has advocated for unions <a href=\"https://www.google.com/search?q=communication+workers+of+america+site%3Atheverge.com\">at a variety of tech companies</a> including Activision Blizzard, agrees. In an email, CWA secretary-treasurer Sara Steffens told <em>The Verge</em>:</p><blockquote><p id=\"GSYvYS\">Make no mistake, all credit for Activision Blizzard’s latest move to give all temporary and contingent QA team members full-time employment and a raise should go to the workers who have been organizing, mobilizing and speaking out.<br><br>It’s especially galling then that Activision has excluded Raven Software QA workers, who have been at the forefront of this effort, from these benefits. The company’s assertion that the National Labor Relations Act prevents them from including Raven workers is clearly an effort to divide workers and undermine their effort to form a union (Game Workers Alliance - CWA). Activision’s disingenuous announcement is further evidence of the need for workers to have a protected voice on the job. We strongly urge Activision Blizzard to rectify this situation and respect Raven QA workers’ protected right to organize under the law.</p></blockquote><p id=\"zErEFU\">Activision Blizzard characterizes it very differently, of course. Here’s a reply to the CWA via Activision spokesperson Rich George:</p><blockquote><p id=\"jEHQ0t\">The union’s assertion is both wrong and disingenuous. It is well known that, during an election petition period, the law prevents an employer from extending new kinds of benefits to employees who are going to be voting. See National Labor Relations Board v. Exchange Parts Co., 375 U.S. 405 (1964), and the associated cases, for discussion of these rules. The CWA is blaming us for trying to comply with the law by pretending the law does not exist.”</p></blockquote><p id=\"YFQ97a\">This isn’t the first possible union-busting action Activision Blizzard has taken regarding the organizing Raven QA employees. Days after the Game Workers Alliance voted to form, Activision Blizzard restructured the QA department, embedding QA workers across departmental teams. By breaking the QA department up into workers distributed across multiple teams, Activision Blizzard is potentially isolating organizers and disrupting communication and cohesion. Though the process is common in video game developer organization, the CWA said, “[This] is nothing more than a tactic to thwart Raven QA workers who are exercising their right to organize.” </p><p id=\"1HOAEq\"><em><strong>Update, 6:11 PM ET: </strong></em><em>Added a reply from Activision Blizzard to the CWA’s allegations.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/h2rSImaBZEuQcgdaZtZKS39sh_c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22749477/acastro_210729_1777_blizzard_0003.jpg",
  "description": "Raven Software union members won’t get the pay raises.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}