{
  "title": "Activision Blizzard hit with another sexual harassment lawsuit",
  "url": "https://www.theverge.com/2022/3/24/22995291/activision-blizzard-sexual-harassment-lawsuit-lisa-boom-jane-doe",
  "date": "2022-03-24T23:30:06.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NrxUWr7Bk2lfVT39zsfP5RoC7oQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70669112/acastro_210729_1777_blizzard_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"gcZ2c7\">Another sexual harassment lawsuit has been filed against Activision Blizzard. The law firm of entertainment lawyer Lisa Bloom filed the suit on behalf of a plaintiff identified as “Jane Doe” against Activision Blizzard. Jane Doe alleges she has been subject to sexual harassment and discrimination while working at the company. The suit names Activision Blizzard, Blizzard Entertainment, three former Blizzard employees, two current employees, and “Does 1 through 25” as defendants.</p><p id=\"5XO6tX\"><strong>Content warning</strong>: <em>This story contains descriptions of sexual harassment.</em></p><p id=\"CiB9l0\">Many of the allegations in the lawsuit involve Mark Skorupa, a former Blizzard staffer who is one of the named defendants and a current Microsoft employee. Doe was hired as a senior administrative assistant to support Skorupa and another Blizzard employee in the IT department, and according to the lawsuit, Skorupa made sexual comments and advancements toward Doe, including putting his hand on Doe’s lap during a lunch on her first day and giving her long, unwelcomed hugs.</p><div class=\"c-float-right\"><aside id=\"oWsZ3K\"><q>Doe’s lawsuit attempts to show a repeated pattern of dismissal of complaints </q></aside></div><p id=\"9jjsgE\">Doe’s lawsuit attempts to show a repeated pattern of dismissal of complaints by both managers and HR. It also alleges that the company retaliated against her for going to HR with complaints of sexual harassment and that HR “dismissed Ms. Doe’s sexual misconduct complaints, saying that it was just her leadership being nice and trying to be friends with her. HR asked Ms. Doe to keep all of her issues, concerns, recordings, or emails to herself because they could be very damaging to Activision Blizzard.”</p><p id=\"1Njrlk\">The lawsuit alleges that Skorupa made a number of hurtful comments toward Doe, that the company demoted Doe, and kept her from getting other positions in the company that she applied for. In one example, she interviewed for a role, but the lawsuit says the company hired a “less-qualified receptionist” who was fired shortly after “because she was not qualified for the position.”</p><p id=\"LoVat3\">Doe eventually wrote to <a href=\"https://www.theverge.com/2021/8/3/22607356/blizzard-president-leaving-harassment-protest-brack\">former Blizzard president J. Allen Brack</a> about the harassment and retaliation, and soon after, she was offered a new position, though one with “a significant decrease in pay.” In this position, “Ms. Doe’s manager often set her up to fail.”</p><p id=\"Lx8HxC\">The suit states that Doe spoke at a press conference on December 8th about her experiences, indicating that Doe is possibly the woman who identified herself as “Christine” at a conference organized by Bloom <a href=\"https://www.theverge.com/2021/12/8/22823991/activision-blizzard-sexual-harassment-victim-press-conference\">that same day</a>. </p><p id=\"S4axWS\">There are more allegations in the lawsuit itself, which you can <a href=\"https://www.documentcloud.org/documents/21509383-jane-doe-v-activision-blizzard?responsive=1&amp;title=1\">read here</a> or at the bottom of this article.</p><p id=\"tc9VhI\">Activision Blizzard didn’t immediately reply to a request for comment. Activision Blizzard has been under intense scrutiny for its workplace culture since the state of California filed its sexual harassment lawsuit against the company <a href=\"https://www.theverge.com/2021/7/22/22588215/activision-blizzard-lawsuit-sexual-harassment-discrimination-pay\">in July</a>. That lawsuit anonymously referenced an employee who committed suicide during a company retreat, and her parents have since <a href=\"https://www.theverge.com/2022/3/6/22964148/activision-blizzard-lawsuit-claims-sexual-harassment-contributed-employee-death\">filed their own lawsuit</a> against Activision Blizzard. The family alleges that sexual harassment was a “significant factor” leading to her death, <a href=\"https://www.washingtonpost.com/video-games/2022/03/04/activision-blizzard-employee-suicide-lawsuit/\">according to <em>The Washington Post</em></a>.</p><p id=\"78EQjk\">A bombshell <a href=\"https://www.wsj.com/articles/activision-videogames-bobby-kotick-sexual-misconduct-allegations-11637075680\"><em>Wall Street Journal</em> report</a> alleged CEO Bobby Kotick <a href=\"https://www.theverge.com/2021/11/16/22785457/activision-blizzard-bobby-kotick-ceo-wall-street-journal-wsj-report-allegations\">had been aware</a> of sexual misconduct allegations at the company, though he has remained in the role. </p><p id=\"swCsXM\">Microsoft, which plans to acquire Activision <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">in a deal worth nearly $70 billion</a>, declined to comment.</p><div id=\"UhQQPh\"><iframe src=\"https://embed.documentcloud.org/documents/21509383-jane-doe-v-activision-blizzard/?embed=1&amp;responsive=1&amp;title=1\" title=\"Jane Doe v. Activision Blizzard (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div><p id=\"EG6iHz\"><em><strong>Update March 24th, 9:03PM ET</strong></em><em>: Microsoft declined to comment.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YB3mKbDW2qyFagrVAb5IVVLU79k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22749476/acastro_210729_1777_blizzard_0002.jpg",
  "description": "The company has been under scrutiny for its culture.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}