{
  "title": "Adding physical buttons to Fitbit’s next-gen devices is a smart idea",
  "url": "https://www.theverge.com/2022/5/6/23058971/fitbit-garmin-fitness-tracker-buttons-watch",
  "date": "2022-05-06T15:08:46.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/RD2RhgXupN8fqzpSFzx2utGYJFY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70839895/akrales_190903_3635_0098.0.jpg\" />        <figcaption><em>The Versa 2 was the last Fitbit smartwatch to have a physical button.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"jTXfjC\">To button, or not to button? When it comes to wearables, the answer is you should always opt for physical buttons. And while they’re abundant on smartwatches, fitness trackers tend to favor touchscreens and capacitive buttons. But it looks like there may be some good news for fans of physical buttons. A new leaked photo of the Fitbit Versa 4 indicates that the side button is back, baby.</p><p id=\"OhwDuB\">The photo comes from <a href=\"https://9to5google.com/2022/05/04/fitbit-versa-4-sense-2/\"><em>9to5Google</em></a>, and for the most part, it looks almost identical to the Versa 3 — except if you zero in on the right-hand side, where you can see a teeny little raised button. </p><p id=\"tf3CGY\">It might not seem like it, but this is actually a significant design change. Earlier iterations of the Versa — one of Fitbit’s most popular devices — had a physical side button. Then, with the Versa 3 in 2020, Fitbit did away with it in favor of a smooth indentation. This was technically a “button,” but it wasn’t something you could actually press in a traditional sense. Instead, when you squeezed it correctly, the Versa 3 would vibrate. The <a href=\"https://www.theverge.com/21450123/fitbit-sense-review\">Fitbit Sense</a>, which came out the same year, also shared the same design.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eeudvd4izhljcbd_um9Q7D5yXVc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23442257/fitbit_versa_4_sense_2_cover.jpeg\">      <cite>Image: <em>9to5Google</em></cite>      <figcaption><em>You can see a tiny little button on the right-hand side of this purported Fitbit Versa 4.</em></figcaption>  </figure><p id=\"9stW2R\">On the surface, this seemed sensible. In theory, no buttons meant no accidental presses and a sleeker profile. In reality, it made for a crappy user experience. </p><p id=\"jTllnM\">If you use too little pressure on the Sense or Versa 3’s button, it won’t do anything. And if you use too much pressure, it still might not do anything. Or, instead of waking the screen as you intended, you might end up triggering the long-press shortcut instead. For whatever reason, the top half of the button tended to be more responsive than the bottom. If you peruse <a href=\"https://community.fitbit.com/t5/Versa-3/Versa-3-button-is-not-always-responding/td-p/4505016\">Fitbit</a> <a href=\"https://community.fitbit.com/t5/Versa-3/Versa-3-button-stuck/td-p/4716533\">and</a> <a href=\"https://www.reddit.com/r/fitbit/comments/izwfmr/versa_3_button_really_glitchy/\">Reddit</a> <a href=\"https://community.fitbit.com/t5/Versa-3/Versa-3-button-too-sensitive/td-p/5032963\">forums</a>, you’ll find plenty of customers griping and sharing tips on how to make this button work. </p><p id=\"pYkvMp\">This isn’t a new problem. There are plenty of fitness trackers that don’t have <em>any</em> kind of button or crown. Instead, they rely on touchscreens entirely. For instance, with the Garmin Vivosmart 3 and Vivosmart 4, you had to tap the screen to confirm your choices. That meant nailing the perfect cadence and pressure each time. If you didn’t master it, it meant a simple two-second task could end up taking several minutes to figure out. And while the Garmin Vivosmart devices are the example I’m using here, there are several touchscreen-only fitness bands out there with the same problems.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ng_GgG4h4Azcpf-pmXoQRcmDtWI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432437/vsong_220426_5173_0005.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>This button on the Garmin Vivosmart 5 took a good product and made it great.</em></figcaption>  </figure><p id=\"lDpR9d\">Sweaty fingers are also an issue. Touchscreens often don’t register moist fingers, and they also make it harder to use capacitive buttons. The irony is these are devices meant to be worn while exercising, so they effectively become harder to use just when you need them most.</p><p id=\"7jPJTl\">A well-designed physical button is a simple solution to all these problems. When you see a physical button, you don’t have to learn how to use it. You just press and it does the thing you want. If you want to get fancy, you can program nifty shortcuts — like pausing your music — and never have to look down at your watch. A physical button does not care how sweaty your fingers are. It will always do its job. </p><div class=\"c-float-right\"><aside id=\"yAelr8\"><q>When you see a physical button, you don’t have to learn how to use it</q></aside></div><p id=\"bkdBqx\">I recently reviewed the <a href=\"https://www.theverge.com/23055864/garmin-vivosmart-5-review-fitness-tracker-wearable\">Garmin Vivosmart 5</a>, and one small change ended up being a game-changer in a tracker series that was always finicky. That change? Adding a physical button. The combination of a touchscreen and a button was perfect. I could use the touchscreen when it made sense, like when scrolling through menus. But I could also always rely on the button to get me back to the homescreen, the previous screen, or end a workout. Adding the button single-handedly eliminated one of the tracker series’ worst pain points.</p><p id=\"XqFuPu\">This is the most likely reason why — if this leaked photo is to be believed — Fitbit has backpedaled to an older design. It’s a smart decision if so, and it’s further proof that you get the best wearable experience when you use both a touchscreen <em>and</em> physical buttons. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UyjFI_yOTrTV779oq-oslDTEUCo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19168635/akrales_190903_3635_0098.jpg",
  "description": "Huzzah! Fitbit Versa 4 and Sense 2 may bring back physical buttons.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}