{
  "title": "Adobe is taking another step into NFTs",
  "url": "https://www.theverge.com/2022/3/9/22967057/adobe-nft-behance-polygon-blockchain-support",
  "date": "2022-03-09T15:00:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-v40zgjBNCDdaqMeVnzRpmjmM0Q=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70598822/acastro_210329_1777_nft_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"a6abdS\">Adobe’s social network Behance is adding support for the Polygon cryptocurrency platform, letting users more easily showcase Polygon-based non-fungible tokens or NFTs. The company is touting Polygon integration as a more environmentally conscious way for artists to create NFTs, which Behance <a href=\"https://techcrunch.com/2021/10/26/adobes-behance-adds-support-for-nfts-and-paid-subscriptions/\">began supporting late last year</a>. While <a href=\"https://www.theverge.com/2022/2/8/22923530/world-wildlife-fund-nft-polygon-layer-2-blockchain-energy-emissions\">that eco-friendliness is debatable</a>, it’s part of Adobe’s <a href=\"https://www.theverge.com/22740442/adobe-scott-belsky-interview-nft-photoshop-blockchain-creator-economy\">ongoing expansion into crypto</a> — as well as an attempt to placate artists that are worried about its potential negative effects.</p><p id=\"Exj2Xt\">Polygon works on top of the popular Ethereum blockchain, and it’s got a smaller energy footprint for individual crypto transactions; it also avoids the massive transaction costs associated with Ethereum. (On the other hand, popularizing Polygon still adds more total traffic to the energy-hungry Ethereum system, which is supposed to <a href=\"https://www.technologyreview.com/2022/03/04/1046636/ethereum-blockchain-proof-of-stake/\">start using a more efficient verification system</a> but hasn’t done so yet.) With this new feature, artists can mint NFTs with Polygon on the popular marketplace OpenSea, display the image associated with them on Behance, and direct viewers to OpenSea where they can buy it.</p><p id=\"Kl8Mob\">Adobe began adding NFT support in late 2021, starting with <a href=\"https://www.theverge.com/2021/10/26/22745506/adobe-nft-art-theft-content-credentials-opensea-rarible-photoshop\">a program called Content Credentials</a>, which links creator attribution details with an NFT image in Photoshop. Its interest in cryptocurrency assets intersects with an earlier program <a href=\"https://www.theverge.com/2020/10/20/21523927/adobe-content-authenticity-initiative-photoshop-behance-beta-tool-added\">called the Content Authenticity Initiative</a>, which pairs images with details about who created them and whether they’ve been edited. Unlike that non-blockchain system, however, NFTs are highly contentions, and some of the most vocal criticism has focused on their environmental cost. While this move likely won’t quiet those concerns, it’s a signal that Adobe is at least aware of them.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IVL0qTILLdUK0KGUt8E3CQahHro=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22413649/acastro_210329_1777_nft_0004.jpg",
  "description": "It’s trying to assuage artists’ environmental concerns.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}