{
  "title": "Aerospace startup reveals new modular lunar rover for carrying people and cargo on the Moon",
  "url": "https://www.theverge.com/2022/3/10/22971232/venturi-astrolab-flex-lunar-rover-nasa-artemis-spacex",
  "date": "2022-03-10T23:30:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7KDiW6OwkF_3eTm-1gny05BrwAY=/0x0:2000x1333/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70606521/Wed__02_Mar_2022_17_04_54_GMTAstrolab_FLEXrover.0.jpg\" />        <figcaption>The FLEX rover prototype | Image: Venturi Astrolab</figcaption>    </figure>  <p id=\"8kRoey\">Today, aerospace startup <a href=\"https://astrolab.space/\">Venturi Astrolab</a> revealed its new interplanetary rover designed to transport cargo and people across the surface of the Moon — and eventually Mars. The company says it plans to build a fleet of these rovers over the coming decade to help NASA and commercial companies establish a long-term presence on the Moon.</p><p id=\"tiZ4TX\">Called FLEX, for Flexible Logistics and Exploration, the rover can crouch down and lift payloads up from the surface of the Moon, carrying them under its belly before depositing them at their intended location. With its “modular payload concept,” it can carry many different types of objects, so long as they are built to an agreed-upon standard of size and shape. In keeping with its name FLEX, the rover can maneuver semi-autonomously, be controlled remotely — or it can even<strong> </strong>be modified to include a crew interface, allowing astronauts to ride on the rover while guiding it through lunar terrain.</p><div class=\"c-float-right\"><aside id=\"180zoR\"><q>“we want to solve the local transportation problem.”</q></aside></div><p id=\"xX4uJ6\">The goal of FLEX and ultimately Astrolab is to capitalize on the world’s renewed push to send people back to the Moon, according to Jaret Matthews, Astrolab’s CEO. Currently, NASA is working to send the first woman and the first person of color to the Moon through <a href=\"https://www.theverge.com/2021/3/12/22323621/trump-moon-program-artemis-biden-nasa-timeline\">the space agency’s Artemis program</a>. And companies like SpaceX and Blue Origin are developing their own landers that will be able to take people to the lunar surface. In the meantime, various commercial companies, like Astrobotic and Intuitive Machines, are building robotic lunar landers that will carry cargo to the Moon. Matthews says he hopes that FLEX rovers will be up there by the time those efforts really ramp up.</p><p id=\"uGvdJF\">“Companies like SpaceX and Blue Origin are solving the long haul transportation problem, and we want to solve the local transportation problem — and ultimately set the standard for lunar logistics,” Matthews tells <em>The Verge</em>.</p><p id=\"H2G2jU\">Matthews has a long history of working with rovers. He started his career at NASA’s Jet Propulsion Laboratory, where he worked on the twin Spirit and Opportunity rovers that were launched to Mars in 2003. He then left to go to SpaceX, working on the company’s Crew Dragon spacecraft and the technology needed for it to dock with the ISS. He’s now taking his expertise to his new company, Astrolab, which he formed with his co-founders in January of 2020.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mpBcJoWK1HuUjPiTmCcO_bs-Kuw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23305027/Wed__02_Mar_2022_17_05_21_GMTAstrolab_FLEXroverPayload.jpg\">      <cite>Image: Venturi Astrolab</cite>      <figcaption><em>The FLEX rover prototype undergoing tests in California</em></figcaption>  </figure><p id=\"DA14lD\">Astrolab has already built a full-scale prototype of FLEX, which the company recently test drove out in the California desert near Death Valley, about five hours out from the company’s headquarters in Hawthorne. Former astronaut Chris Hadfield, who’s on Astrolab’s board of advisors, even took the rover for a spin, giving his advice on how the vehicle’s design held up. The company used FLEX to pick up and deliver payloads, as well as set up a vertical solar panel — a critical technology needed for in-space energy that future lunar astronauts will probably need to set up to stay on the Moon long-term, Matthew says.</p><p id=\"r7wjwk\">Astrolab wants FLEX to be able to carry as much cargo as possible, which is why the company went with the modular design. Matthews likens it to how shipping containers here on Earth are made to specific international standards. He hopes eventually we’ll create a similar standard for cargo on the Moon. “You have all those containers kind of move seamlessly through the global supply chain, and that’s a really efficient model where all this infrastructure is designed to work together,” Matthews says. “So we think that approach makes sense to take forward to the Moon and Mars.”</p><div class=\"c-float-left\"><aside id=\"2YJHxr\"><q>“they can essentially drive it like they stole it.”</q></aside></div><p id=\"CrEQhM\">Matthews says they learned a lot from their field tests with the FLEX prototype. Ultimately, the prototype is built for Earth terrain, though, so the equipment is much “beefier” than it would be for a lunar environment, which has one-sixth our planet’s gravity. The company says the final rover should weigh about 1,100 pounds, or 500 kilograms, and will be built specifically to handle the lunar terrain. “We want the hardware to be super robust so that they can essentially drive it like they stole it and not have to worry about it,” Matthews says.</p><p id=\"RUPd4Z\">Lunar rovers have to contend with all sorts of environmental struggles, such as higher radiation and the dreaded lunar night, a two-week period when the Moon is plunged into darkness and temperatures can <a href=\"https://lunar.gsfc.nasa.gov/images/lithos/LROlitho7temperaturevariation27May2014.pdf\">drop below -208 degrees Fahrenheit</a>, or -130 degrees Celsius. Astrolab claims that FLEX will have insulation and “sufficient internal battery capacity,” allowing the rover to withstand and stay warm between 100 and 300 hours of nighttime at the Moon’s south pole. Once the sun rises again, FLEX’s external solar arrays will then start generating electricity from the light.</p><p id=\"we4UmM\">When it’s complete, FLEX will supposedly be able to launch on multiple types of rockets and landers. Matthews cites startup Astrobotic’s Peregrine lander, which is supposed to launch this year and carry a NASA rover to the Moon, as a potential ride for FLEX. The company isn’t saying how much FLEX will cost, but Matthews says the long-term plan is to charge for services of the rovers rather than for each individual vehicle. “We want to be the UPS, FedEx, and the Uber of the Moon,” he says.</p><p id=\"79xA0H\">Conversations have already begun with NASA, which <a href=\"https://www.nasa.gov/feature/nasa-prompts-companies-for-artemis-lunar-terrain-vehicle-solutions/\">put out a call for companies last year</a> to come up with designs for a “lunar terrain vehicle” that could transport future Artemis astronauts across the Moon’s south pole. Astrolab has also reached out to potential customers, including SpaceX, whose headquarters are next door to Astrolab’s in Hawthorne. With a mission control center already built, along with a thermal vacuum chamber for testing, Astrolab wants to send up its first FLEX rovers in the years ahead, testing them out on the lunar surface before astronauts arrive. “Astronaut time is the most precious resource in the world, and safety is a prime concern, so you want to be able to do as much robotically in their absence as you can,” Matthews says.</p><p id=\"UbOBwI\">And it’s quite likely it’ll be a while before astronauts actually make it back to the lunar surface. NASA recently <a href=\"https://www.theverge.com/2021/11/9/22772427/nasa-artemis-program-moon-lunar-landing-2025-delay\">delayed its first landing date for Artemis to 2025</a>, though auditors of the space agency say <a href=\"https://www.space.com/artemis-moon-landing-likely-slip-to-2026\">a 2026 landing is more realistic</a>. That gives Astrolab even more time to get the FLEX up and running on the lunar surface.</p><p id=\"MXpWR6\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5y7h10hHo_QyRkX_brQXczAVjaU=/0x144:2000x1191/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23304969/Wed__02_Mar_2022_17_04_54_GMTAstrolab_FLEXrover.jpg",
  "description": "Standardizing delivery service on the Moon",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}