{
  "title": "After ‘protestware’ attacks, a Russian bank has advised clients to stop updating software ",
  "url": "https://www.theverge.com/2022/3/21/22989339/protestware-attacks-russia-sberbank-open-source",
  "date": "2022-03-21T19:17:48.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6Wm-9Ny_CHOdjCmib0g8rC_oDRQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70653366/akrales_220309_4977_0258.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"2WgalM\">As the Russian invasion of Ukraine draws on, consequences are being felt by many parts of the technology sector, including open-source software development.</p><p id=\"DHKrqZ\">In a recent announcement, the Russian bank Sber advised its customers to temporarily stop installing software updates to any applications out of concern that they could contain malicious code specifically targeted at Russian users, <a href=\"https://www.technologyreview.com/2022/03/21/1047489/activists-are-targeting-russians-with-open-source-protestware/\">labeled by some as “protestware.”</a></p><p id=\"2ogxu2\">As quoted in <a href=\"https://www.fontanka.ru/2022/03/18/70517441/\">Russian-language news sites</a>, Sber’s announcement reads:</p><blockquote><p id=\"I2tE8h\">Currently, cases of provocative media content being introduced into freely distributed software have become more frequent. In addition, various content and malicious code can be embedded in freely distributed libraries used for software development. The use of such software can lead to malware infection of personal and corporate computers, as well as IT infrastructure.</p></blockquote><p id=\"ChqDeq\">Where there was an urgent need to use the software, Sber advised clients to scan files with an antivirus or carry out manual review of source code — a suggestion that is likely to be impractical, if not impossible, for most users.</p><p id=\"0DgMsw\">Though framed in general terms, the announcement was likely made in reference to an incident that took place earlier in March, where the developer of a widely used JavaScript library added an update that <a href=\"https://arstechnica.com/information-technology/2022/03/sabotage-code-added-to-popular-npm-package-wiped-files-in-russia-and-belarus/\">overwrote files on machines located in Russia or Belarus</a>. Supposedly implemented as a protest against the war, the update raised alarm from many in the open-source community, with fears that it would undermine confidence in the security of open-source software overall.</p><p id=\"4FvhFf\">The update was made in a JavaScript module called <a href=\"https://github.com/RIAEvangelist/node-ipc\">node-ipc</a>, which, according to the NPM package manager, is downloaded around <a href=\"https://web.archive.org/web/20220321073546/https://www.npmjs.com/package/node-ipc\">1 million times per week</a> and used as a dependency by the popular front-end development framework Vue.js.</p><p id=\"cWxX72\">According to <em>The Register</em>, updates to node-ipc made on March 7th and March 8th added code that checked whether the IP address of a host machine was geolocated in Russia or Belarus, and if so, <a href=\"https://www.theregister.com/2022/03/18/protestware_javascript_node_ipc/\">overwrote as many files as possible with a heart symbol</a>. A later version of the module dispensed with the overwriting function and instead dropped a text file on users’ desktops containing a <a href=\"https://github.com/RIAEvangelist/peacenotwar/blob/main/WITH-LOVE-FROM-AMERICA.txt\">message</a> that “war is not the answer, no matter how bad it is,” with a link to a song by Matisyahu.</p><p id=\"AD53k0\">Although the most destructive features of the “protestware” module no longer appear in the code, the consequences are harder to undo. Since open-source libraries are fundamental to software development, a general loss of trust in their integrity could have knock-on effects for users in Russia and elsewhere.</p><p id=\"Lgb7jQ\">In a <a href=\"https://twitter.com/selenalarson/status/1505883066799038466\">tweet</a>, cybersecurity analyst Selena Larson referred to it as “forced insecurity”; in general, the open-source community has <a href=\"https://www.scmagazine.com/analysis/application-security/what-happens-when-protestware-sabotages-open-source-in-response-to-current-events\">fiercely condemned the node-ipc update</a> and pushed back on the idea of protest through module sabotage, even for worthy causes. </p><p id=\"MaxeVX\">More broadly, the Ukraine conflict has posed difficult ethical questions to technology companies working in Russia. While many global tech leaders <a href=\"https://www.theverge.com/2022/3/1/22957000/apple-russia-ukraine-invasion-halt-product-sales-app-store\">like Apple</a>, <a href=\"https://www.theverge.com/2022/3/9/22969220/amazon-russia-belarus-ukraine-invasion-prime-video-stops-sending-orders\">Amazon</a>, and <a href=\"https://www.theverge.com/2022/3/9/22969600/sony-interactive-entertainment-playstation-suspending-hardware-software-shipments-russia-store\">Sony</a> have paused or halted sales in the Russian market, others remain: in a blog post from March 7th, Cloudflare CEO Matthew Prince said that the company would <a href=\"https://blog.cloudflare.com/steps-taken-around-cloudflares-services-in-ukraine-belarus-and-russia/\">continue to provide service in Russia</a> despite calls to pull out, writing that “Russia needs more Internet access, not less.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bipRL9C0riT2uBQGtnpxj25VlEo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318436/akrales_220309_4977_0258.jpg",
  "description": "Analysts raised concerns about \"forced insecurity.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}