{
  "title": "After Yang director Kogonada on crafting ",
  "url": "https://www.theverge.com/2022/3/9/22967466/after-yang-kogonada-interview",
  "date": "2022-03-09T15:30:00.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"FRANCE-FILM-FESTIVAL-CANNES\" src=\"https://cdn.vox-cdn.com/thumbor/Xw_uWVjGlM6uughFILIx8L6aR5Q=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70599010/VRG_ILLO_5074_Kogonada_s.0.jpg\" />        <figcaption>US director Kogonada arrives for the screening of the film “Flag Day” at the 74th edition of the Cannes Film Festival in Cannes, southern France, on July 10, 2021. (Photo by John MACDOUGALL / AFP) | Photo Illustration by Grayson Blackmon / The Verge, Photo courtesy Getty Images</figcaption>    </figure>  <p>After Yang’s director discusses the film’s wider unseen world</p> <p class=\"p--has-dropcap\" id=\"rAMu4F\">It’s difficult at first to identify, but there is something powerfully amiss in the world of director <a href=\"https://www.theverge.com/2022/3/4/22956531/after-yang-kogonada-review\">Kogonada’s <em>After Yang</em></a>, a film about <a href=\"https://www.theverge.com/2022/1/27/22902494/sundance-film-festival-2022-best-movies\">a human family dealing</a> with the fact that one of its members, an android, <a href=\"https://www.theverge.com/2022/2/1/22912211/after-yang-a24-trailer-kogonada\">is about to die</a>. Because the movie’s central family is so wrapped up in the pain they’re feeling, and because they’re all accustomed to the future they’re living in, none of it strikes them as especially strange. But in <em>After Yang</em>’s quietly precise attention to detail, you can see how each glimpse of the outside world is meant to give you a deeper understanding of how everyone from this future is still recovering from something larger than any one of their individual lives.</p><p id=\"3KsteN\">The fact that <em>After Yang doesn’t</em> initially look, sound, or feel like your typical feature about people surviving in a somewhat dystopian near-future is entirely by design and something Kogonada attributes to his own fascination with architecture and engineering. When I spoke with Kogonada about the film recently, he explained that one of his big goals was to emphasize how the “exhaustion of being” is still something everyone in this world is struggling with as society continues its long process of recovering from multiple calamitous events. Rather than focusing on the details of those events, Kogonada said, it was dreaming up ideas for how humanity had to respond to them that helped guide his filmmaking process.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lovccodCuJBqGZMSsvaNcux57K0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298667/Screen_Shot_2022_03_08_at_1.21.02_PM.png\">  </figure></div><p id=\"bILnu8\"><strong>You’ve always talked about being curious about the people who live on the ground level and sort of in the background of big blockbuster sci-fi films.</strong></p><p id=\"CgiOyu\">Kogonada: Yes!</p><p id=\"li11RS\">And you do get the sense that <em>After Yang</em>’s story is homing in on Jake and Kyra as two very ordinary people within this world. </p><p id=\"r76fAM\"><strong>Before we talk about the family, talk to me a bit about constructing this world around them. What were the aspects that you wanted us to see, and what were you really sort of hoping to keep obscured for our imaginations to work through?</strong></p><p id=\"pwsRpY\">Originally, I thought it was going to be an almost 100 percent interior film where we never really felt the outside world except maybe through reflections or maybe through a window because I just thought, thematically, it was such an interior story. I think so much of the relationship between Jake and Kyra — you know that something is off or that they’re at a real critical moment. I really do think Jake is sort of lost and feels detached, and that interior narrative for him was important to me. But of course, with Yang, it’s going to be all about also trying to understand Yang by really opening him up. </p><p id=\"JA5IL3\">That was always kind of a part of it, but there was a moment where we thought, “Well, just so that it’s not totally claustrophobic, let’s give the story some air and kind of get a glimpse of this world.” That worldbuilding, again — it was going to be indirect, but I had a real back story about that future that really kind of provided a context of how we were going to design it.</p><p id=\"dxysKO\"><strong>There’s a softness and a greenness to so much about this future.</strong></p><p id=\"B9Bq0J\">I didn’t want it to be metallic and dystopian and industrial. To me, it was like in a society that had some climate catastrophe that was really fatal and really kind of created some humility in society. We led with the idea that in order to survive now, these people had to change everything about the way they approach modern life and that they had to incorporate nature, and it had to be organic. To me, it was about a society that had been really humbled and had to remake the world in order to survive.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sum0U8h2BF77uCV8MKdBTPgeV9E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298696/Screen_Shot_2022_03_08_at_1.19.51_PM.png\">  </figure></div><p id=\"R1fLHF\"><strong>It does feel like the weight Jake and Kyra are living with is partially related to their personal drama, but it’s also how the reality of the world they’re living in has left everyone a bit “different.” How have Jake and Kyra internalized that societal humbling, in your mind?</strong></p><p id=\"OOyHc6\">You know, that’s something no one’s asked me. I mean, this probably reflects my own sensibilities, but there is a kind of… you know, they’re not screaming at each other, but there is a sort of deeper exhaustion there. In the script, there’s a deeper narrative about Kyra’s role in this place. You get glimpses of her working on something and being in a sort of a botanical lab. Her career is really kind of on the rise, and she’s doing something very significant. In the script, we name it, and we know that she’s about to do something that’s going to be really helpful for society.</p><p id=\"1NGAmD\">Jake has to contend with his own loss, but he’s also having to contend with being on the other side of his relationship with Kyra and his sort of questioning the meaning of his own…not work, exactly, but the validity to it. Jake connected to tea in the same way that I connected with cinema, and there are moments where the thing you love becomes your job, and maybe you don’t feel successful at it. This thing that once gave you life — you know, like, “Oh, I love film,” — starts losing that sort of flavor for you. So there’s that element.</p><p id=\"y33nCn\"><strong>In the book, both Jake and Kyra are described as white, middle-class retail workers who are out of their depths both because of their stations in life and because of their whiteness to really be effective parents to Mika. Here, though, they’re an interracial couple, and we don’t know exactly what it is that Kyra is doing, but Jake works in this tea shop, and it feels very much like he’s a white guy who’s made his obsession or, I guess, generalized Orientalism into his whole identity in a way that’s really just gone unexamined. </strong></p><p id=\"vfQR0g\">Yeah, yeah.</p><p id=\"tU6dR1\"><strong>Talk to me about the thinking that went into reworking Jake’s character in particular.</strong></p><p id=\"JvgeQZ\">I think it’s interesting, you know, because certainly we have this sort of genre of white savior film, and Colin and I talked about that. Colin is a lead in this film, and he’s like the white person in the family, and this could easily be framed as like “Hero Dad Fixes a Broken Robot for His Daughter.”  But always in our telling of it, it was like this lost, white male in this new society, who was almost — in his attempt to fix Yang — was fixing himself. </p><p id=\"Pd2AS6\">Yang was doing the work of fixing Jake because Jake is one of the people who is, in a way, lost in this new world. What’s interesting to me is that Yang is a construct of Asian-ness. He’s this manufactured idea of Asian-ness, and part of that conversation about Orientalism is how things like tea and all these things that we have that we associate with certain cultures. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/W7Yqj5rGNMiUt9C1bfGVmE6V_Vw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298701/Screen_Shot_2022_03_08_at_1.17.47_PM.png\">  </figure></div><p id=\"qu9uzb\"><em><strong>After Yang</strong></em><strong>’s obviously a story about grief, but it’s also a really frank portrayal of some of the more complicated aspects of transracial adoption that aren’t </strong><em><strong>new </strong></em><strong>exactly but are sometimes almost framed as being inappropriate to talk about. Like what sort of obligation adoptive parents have to their children to connect them to the cultures of their birth. What more, if anything, did you want </strong><em><strong>After Yang </strong></em><strong>to contribute to the larger pre-existing conversations around transracial adoption?</strong></p><p id=\"3cIhhj\">If I’m honest, I don’t know. I don’t exactly have any kind of agenda like “here’s what people should walk away from this believing about transnational adoption” because I think all of these things are so complex and delicate and require that conversation you’re talking about itself. But I will say it’s personal. </p><p id=\"3EFuLm\">We have two boys that we adopted from Korea, and we knew that we wanted to adopt. I felt strongly that we should adopt from Korea because we could offer them a Korean family. There are a lot of Korean adoptees who grow up in completely white environments. There are some families who don’t care about that connection, and they just raise them completely white, and then there are families that try, but it’s hard, you know? It’s just going to a Korean restaurant or watching tapes about Korea, and I’m glad that people make that attempt, but that’s also such a small piece of it.</p><p id=\"u32N4I\">It’s similar to filmmaking. I had theories about filmmaking, and I had theories about transnational adoption, but when you’re suddenly in it, it always humbles your theories. My sense of my boys, from the minute I saw their photo, I couldn’t describe it. There was a kind of connection. My sister had adopted kids, and other people I knew had adopted kids, but I just couldn’t imagine that it could feel so engrafting. So, there’s a lot that I’m wrestling with, and I don’t truthfully have answers, but this was my attempt to explore these things that are preoccupying my mind.</p><p id=\"lgwnUb\"><strong>You can see a lot of that feeling and a lot of those ideas in the way that Yang seems to be grappling with his own sense of self. As much as the movie leads you to thinking about how the family feels about Yang, it’s also very much about how Yang feels about the family, and you get the sense that some of his malfunctioning is his grappling with “Well, what is this? What am I, exactly?”</strong></p><p id=\"IEQUml\">Exactly.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PiNuJbV5PY4GqKn7zhJuJAlQn8k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298704/Screen_Shot_2022_03_08_at_1.18.34_PM.png\">  </figure></div><p id=\"Ly9Ofe\"><strong>You mentioned earlier that Yang is this sort of construct of Asian-ness. Talk to me about the concepts you really wanted to work with with Yang’s interiority.</strong></p><p id=\"8DuS6L\">In the short story, all the flashbacks are from Jake’s perspective. Jake’s the one who is kind of recalling Yang, and it really centers him in trying to find value in Yang through his memories. We do have a memory — that key memory — is Jake’s, but everything else is really Yang’s, here. I wanted to focus on this sort of lesson of what Yang is valuing and attending to in this everyday space, even though the memories are just fragments and they don’t have their own full narrative. The challenge, too, was figuring out what Yang was finding meaningful. I appreciate you asking this because there’s two levels to it with Yang. </p><p id=\"NpnKbe\"><strong>Oh?</strong></p><p id=\"n33s71\">One is this feeling of displacement and this longing for a sense of place and his own sense of identity. I think if you’re a person of color and living in a predominantly white world, we all understand that sometimes — that feeling of displacement <em>is</em> our base that we’re constantly constructing and trying to build off of. The other level is more about the things that we don’t necessarily focus on, even in our search for answers and meaning. Sometimes the truth of what is meaningful is right in front of us and may be something as simple as just attending to mundane everyday things in a way that has a lot of personal value.</p><p id=\"FueHQy\"><strong>The movie doesn’t really go into much detail about why there are so many Chinese orphans or how Brothers &amp; Sisters came to be the megacorporation that it is, but it all gives you just enough of an idea to wonder. In your headcanon, what has the China of this film’s reality become, not necessarily as a state actor, but as a concept? How does it loom in people’s minds? </strong></p><p id=\"yipX9A\">We don’t explore it in the film, but I think there’s a sort of glimpse in Russ’ office where you see a flash of a newspaper talking about a war that had happened. Because I’m always a little bit hesitant of putting things too much in the spotlight, I didn’t want to zoom in and suddenly distract you by making it all about that. Some of this is borrowed from the short story, but I do think that there was a war and there was a real moment in China, and the liberal people of this world feel like they needed to do something in response. There are these orphaned kids that have been the consequences of a very long conflict that’s ended, but now there is this need to help because China lost that war. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ruT3fBBbkjdt375_iH09J4S0Xt0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298716/Screen_Shot_2022_03_08_at_1.17.26_PM.png\">  </figure></div><p id=\"GAn42U\"><strong>This is going to bug me if I don’t ask you since you brought it up, but let’s double back to Kyra for a second. What </strong><em><strong>is </strong></em><strong>she working on, exactly?</strong></p><p id=\"FUy8KW\">So, in this world, in this city, they realize that the trees and plants need to be a vital part of their environment. Initially, the idea was that there was going to be this sort of city in a forest, and you can still see elements of that I had this idea — and there is a scientific word for it, and we won’t go into now — but it’s basically the natural cycle of leaves falling. In this future, that natural process poses a danger to the city because it creates all of this debris. At the same time, though, everyone in this world longs for seasons — the change of the seasons. </p><p id=\"egKsgq\">This issue may feel a little bit aesthetic, but Kyra was creating a way for trees to continue to express the passage of time, only without their leaves falling. It was meaningful to me because I think so much of this work and work that I care about is also about us recognizing a passage of time, and I think that is the thing that can often attune us. I’d written all of that into the script, but it just kind of became its own thing, and I just thought I was so fascinated by it. </p><p id=\"AthHx2\"><strong>What more do you want to see from speculative near-future films that are thinking about where we’re going to be as a society?</strong></p><p id=\"10aTx9\">One of the things that fascinates me is our emotional attachment to things that we create. So often, the story is “AI wants to be human,” but I didn’t want to do that because I think there are a lot of great stories already exploring that. I think this idea of how ethnicity and diversity can play out in these worlds is interesting because we haven’t had many voices around to tell those sort of feature stories yet, but I think as we do, it might expand us as human beings. </p><p id=\"Jp9Xu6\">But also, the thing that I was drawn to here is how grief and loss and these emotions that we feel are complicated once they become intertwined with other elements. It might seem really speculative, but that happens all the time. There are emotional attachments that we have to our pets, to our sports teams, you know? That’s what we do as humans, and I think it’s going to get more complicated as there become more *<em>things*</em> that we feel like we connect to on some other, deeper level.</p><p id=\"zbWh6f\"></p><p class=\"c-end-para\" id=\"VFHYjP\"><em>After Yang </em>is now in theaters and streaming on Showtime.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7WC186XBqS-o_2Mwgc83P3-kJD4=/0x0:2050x1073/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23299240/VRG_ILLO_5074_Kogonada_s.jpg",
  "description": "After Yang’s director discusses the film’s deeper, unseen ideas.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}