{
  "title": "After mistaken identity and confusion, a piece of space junk slams into the Moon",
  "url": "https://www.theverge.com/2022/3/4/22958705/chinese-rocket-space-debris-moon-collision-change-5-t1",
  "date": "2022-03-04T15:53:57.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NIWYVk5q5JTONoLwqs_ZcpU63v8=/0x0:2400x1600/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70579019/Back_side_of_the_Moon_AS16_3021.0.jpg\" />    </figure>  <p id=\"nkGfwX\">After years of zooming through deep space, a presumed leftover piece of a Chinese rocket slammed into the Moon today, just as space tracking experts expected it would. At least, it <em>should</em> have hit the Moon around 7:30AM ET this morning, as long as the law of gravity has not changed. The collision brings an end to the rocket’s life in space and likely leaves a fresh new crater on the Moon that may be up to 65 feet wide.</p><p id=\"pEln8S\">The now-expired rocket has caused quite a buzz this past month. First of all, the vehicle was never intended to crash into the Moon, making it a rare piece of space debris to find its way to the lunar surface by accident. Additionally, there was some confusion over its identity, with various groups trying to nail down exactly where the rocket came from.</p><div class=\"c-float-right\"><aside id=\"BzLphP\"><q>finding its way to the lunar surface by accident</q></aside></div><p id=\"csGEsc\">Originally, space trackers thought it was <a href=\"https://www.theverge.com/2022/1/27/22904427/spacex-falcon-9-rocket-second-stage-moon-collision-deep-space-junk\">a leftover piece of a SpaceX Falcon 9 rocket</a> that had launched a weather satellite back in 2015. But after careful analysis, various groups of space trackers confirmed that the rocket was <a href=\"https://www.theverge.com/2022/2/13/22931817/china-change-5-t1-rocket-spacex-falcon-9-moon-collision\">likely leftover from the launch of China’s Chang’e 5-T1 mission</a> — a flight that launched in 2014 to test out technology needed to bring samples back from the Moon. That mission, launched on a Chinese Long March 3C rocket, sent a spacecraft looping around the Moon in an attempt to see if China could send a vehicle to the Moon and then bring it back to Earth. Given the flight profile of the Chang’e 5-T1 mission and the tracking of the mystery object, astronomers are fairly certain that a chunk of the Long March 3C rocket has remained in an extremely elongated orbit around Earth ever since, only to find its way to the far side of the Moon.</p><p id=\"z5KS1C\">China <a href=\"https://www.theverge.com/2022/2/22/22945801/china-change-5-t1-rocket-debris-moon-collision-update\">tried to deny that the rocket belonged to the country’s space program</a>, claiming that the rocket actually returned to our planet and fell into the atmosphere. “According to China’s monitoring, the upper stage of the Chang’e-5 mission rocket has fallen through the Earth’s atmosphere in a safe manner and burnt up completely,” Wang Wenbin, a spokesperson for China’s Ministry of Foreign Affairs, <a href=\"https://www.fmprc.gov.cn/mfa_eng/xwfw_665399/s2510_665401/2511_665403/202202/t20220221_10644075.html\">said during a press conference</a> in February after trackers had changed the identity of the rocket. However, Wang may have mixed up his Chinese missions. Chang’e-5 was a completely different mission that launched in 2020, while astronomers believe this rocket stemmed from the <em>Chang’e 5-T1 </em>mission, which took place six years earlier.</p><p id=\"QXbwnv\">Some other confusion revolved around the fact that the Space Force’s 18th Space Control Squadron (18SPCS) — which keeps track of space debris around Earth — noted on its tracking website that the rocket from the Chang’e 5-T1 mission returned to our planet about a year after launch and burned up in our atmosphere. However, the 18SPCS later confirmed in a statement to <em>The Verge</em> that the Long March 3C from the flight did <em>not</em> actually reenter our atmosphere and has been in space ever since its launch.</p>  <figure class=\"e-image\">        <img alt=\"A Long March 3C rocket carrying the Chan\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CFFqfO-EurpK0iTnnouyRB4fd9Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23288063/104589462.jpg\">      <cite>Image: STR/AFP via Getty Images</cite>      <figcaption><em>A Chinese Long March 3C rocket</em></figcaption>  </figure><p id=\"mzkOaG\">Though the 18SPCS’s update lends credibility to the idea that the rocket is from the Chang’e 5-T1 mission, it won’t say for sure that’s the origin of the object. “The 18th Space Control Squadron is currently determining the appropriate update to the space catalog,” Major Annmarie Annicelli, chief of the public affairs operations division at US Space Command, provided in an emailed statement to <em>The Verge</em>. “While U.S. Space Command can confirm the CHANG’E 5-T1 rocket body never de-orbited, we cannot confirm the country of origin of the rocket body that may impact the moon.”</p><p id=\"HZeKsm\">The reason the 18SPCS does not have good data here is that it’s not really concerned with tracking deep-space debris like this. The 18SPCS is much more focused on tracking space debris in closer orbits to Earth, as the space environment there has become much more crowded. That population of objects has grown extensively over the last few decades, <a href=\"https://www.theverge.com/2021/11/15/22782946/russia-asat-test-satellite-international-space-station-debris\">especially after Russia intentionally destroyed one of its own satellites</a> during an anti-satellite test, or ASAT test, in November. The 18SPCS claimed that once the Chang’e 5-T1 rocket passed more than 22,000 miles beyond Earth, their official trackers de-prioritized following the object. They plan to revise the database, though, to reflect more up-to-date information.</p><p id=\"W2wQg6\">But while the 18SPCS cannot confirm or deny the source of the space debris, astronomers are pretty certain that the rocket is from Chang’e 5-T1 <em>and</em> that it is now pulverized on the lunar surface. The rocket’s demise was <a href=\"https://www.projectpluto.com/temp/dscovr.htm\">first predicted by Bill Gray</a>, an astronomer and asteroid tracker running <a href=\"https://www.projectpluto.com/\">Project Pluto</a>, who’s been following the rocket pretty closely for the last few months. </p><p id=\"uw9d6J\">The collision shouldn’t really be a cause for concern, especially since we’ve crashed plenty of objects on the lunar surface before. Pieces of rockets from the Apollo missions to the Moon were sent careening into the lunar surface, and NASA purposefully crashed a spacecraft into the Moon in 2009 called LCROSS in order to blast up some lunar dirt and see what materials were lurking under the surface. All those past crashes were usually on purpose, though, and the ones that weren’t typically entailed a lunar lander or vehicle bound for the Moon going in a little too hard. This may be the first time a spacecraft that wasn’t supposed to go to the Moon’s surface made it there anyway. Or at least, it’s the first time one we know about.</p><div class=\"c-float-left\"><aside id=\"YZOd9o\"><q>why we need better plans for disposing of our deep-space debris</q></aside></div><p id=\"GKjwdB\">Gray and others have used this episode as a case for <a href=\"https://www.theverge.com/2022/1/27/22904427/spacex-falcon-9-rocket-second-stage-moon-collision-deep-space-junk\">why we need better plans for disposing of our deep-space debris</a> and why we need to be tracking junk that goes to extra high altitudes like this. But now that the rocket has impacted, its leftovers could be great to study. The team behind NASA’s Lunar Reconnaissance Orbiter, which is currently orbiting the Moon, says they’ll try to see the aftermath of the crash if they can. Gray predicted that the rocket likely hit the Moon in a far side crater called Hertzsprung.</p><p id=\"Z4XIfM\">“We certainly have an interest in finding the impact crater and will attempt to do so over the coming weeks and months,” John Keller, the deputy project scientist for the Lunar Reconnaissance Orbiter mission, emailed to <em>The Verge</em> in a statement. “We will not be near the impact site when it takes place so we won’t be able to directly observe it. The onboard narrow angle cameras have sufficient resolution to detect the crater but the Moon is full of fresh impact craters, so positive identification is based on before and after images under similar lighting conditions.”</p><p id=\"BZCYfF\">Hopefully, the LRO team can find it and give us an image of the final resting place of the Long March 3C rocket, and perhaps we can use this whole ordeal as an opportunity to see what kinds of materials the collision was able to dig up.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ecFeRWUKZ_Fie9ds3lKN7H_tbL4=/0x0:2400x1257/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23288076/Back_side_of_the_Moon_AS16_3021.jpg",
  "description": "The rocket met its predicted doom.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}