{
  "title": "AirTags are sending a new kind of false alarm, report says",
  "url": "https://www.theverge.com/2022/5/6/23060113/airtags-safety-phantom-alerts-apple",
  "date": "2022-05-06T20:10:54.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"An AirTag\" src=\"https://cdn.vox-cdn.com/thumbor/168YZZIbqBB0ZLrHS9-aEk2kY7Y=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70841120/vpavic_4547_20210421_0038.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"Iqv44V\">Apple’s AirTags have been sending out “phantom” alerts that are confusing iPhone users, according to a <a href=\"https://www.wsj.com/articles/phantom-airtag-alerts-send-iphone-users-on-wild-goose-chases-11651799060\">new <em>Wall Street Journal </em>report</a>. The AirTags, which launched last year, feature anti-stalking measures that are designed to alert users when an unknown AirTag has been detected on their person over an extended period of time. The idea is to discourage AirTags from being used to track people without their consent. </p><p id=\"P2R2YN\">The <em>WSJ</em> reports that these false alerts generally occur in the middle of the night and have started popping up in recent weeks. When a person receives an unknown AirTag alert, they’re supposed to see an accompanying map that shows where and how long the AirTag was detected on their person. These false alarms, however, are accompanied by maps depicting several straight lines radiating from a person’s location. If you’ve ever seen an unknown AirTag alert, this is highly unusual and seems to indicate a bug in the system.</p><p id=\"Jh4Xyy\">It’s unclear how prevalent this particular false alert is, though this isn’t the only type of false alarm a person may experience. While <a href=\"https://www.theverge.com/2022/3/1/22947917/airtags-privacy-security-stalking-solutions\">testing the AirTag’s safety features</a>, I was repeatedly notified that my own AirTag was stalking me. Several users have <a href=\"https://www.reddit.com/r/gadgets/comments/spk0b4/comment/hwgiqjo/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">reported a similar experience on Reddit</a> and other social media. Likewise, other users have reported seeing confusing alerts triggered by their AirPods — an issue that Apple <a href=\"https://support.apple.com/en-us/HT212227\">addressed</a> in a recent update to better differentiate between alerts triggered by various accessories. </p>  <figure class=\"e-image\">        <img alt=\"AirTags\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qPeprEY3uZnYIrPxafC5-14_lS8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22461387/vpavic_4547_20210421_0074.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>  </figure><p id=\"QlV0uH\">In the <em>WSJ </em>report, users say that the alerts put them on edge — particularly when they can’t seem to find any AirTag on their person. In one instance, one user said they were unable to force the supposed unknown AirTag to play a sound and that the FindMy app was saying the AirTag was unreachable. This also happened in my testing several times even though the AirTag in question was mere inches away. </p><p id=\"ihbVcY\">Following multiple reports of unwanted stalking earlier this year, Apple said in February that it intended to make <a href=\"https://www.theverge.com/2022/2/10/22927374/apple-airtag-safety-update-stalking\">unknown AirTags alert people sooner</a> and to emphasize louder tones on sound alerts. Apple is currently rolling out an AirTags update for the latter in <a href=\"https://www.macrumors.com/2022/04/29/airtags-firmware-tune-unwanted-tracking-sound/\">a firmware update</a> labeled 1.0.301.</p><div class=\"c-float-right\"><aside id=\"bwPugi\"><q>Too many false alarms could be dangerous, as users may become desensitized to AirTag alerts</q></aside></div><p id=\"7hjZ22\">During a recent <em>Verge</em> <a href=\"https://www.theverge.com/2022/3/1/22947917/airtags-privacy-security-stalking-solutions\">investigation</a>, domestic violence experts said that too many false alarms could be dangerous, as users may become desensitized to AirTag alerts meant to keep them safe. However, they also emphasized there are design challenges that need to be addressed. While experts agree the current notification window isn’t adequate, shortening it too much may also unnecessarily frighten people who aren’t being tracked. That’s because AirTags must still be able to identify if they’ve been planted on a person or just happen to be in that person’s vicinity. It would seem that this recent round of phantom alerts is proving concerns about false alarms justified.</p><aside id=\"yqtjzl\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"AirTags are dangerous — here’s how Apple could fix them\",\"url\":\"https://www.theverge.com/2022/3/1/22947917/airtags-privacy-security-stalking-solutions\"},{\"title\":\"Apple says it will make unknown AirTags alert you sooner\",\"url\":\"https://www.theverge.com/2022/2/10/22927374/apple-airtag-safety-update-stalking\"},{\"title\":\"AirTag location trackers are smart, capable, and very Apple\",\"url\":\"https://www.theverge.com/2021/4/22/22396693/apple-airtag-location-tracker-hands-on-find-my-privacy-safety\"}]}'></div></aside><p id=\"e9bQHf\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wOf28dT1tcnPlRTXB_YW5S2qkl4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22461379/vpavic_4547_20210421_0038.jpg",
  "description": "Too many false alarms could desensitize AirTag owners.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}