{
  "title": "Alexa can’t make these otherwise great dumbbells smart",
  "url": "https://www.theverge.com/23022416/nordictrack-iselect-adjustable-dumbbells-review-amazon-alexa",
  "date": "2022-04-13T16:00:00.000Z",
  "author": "Victoria Song",
  "content": "  <p>While voice commands worked, it was easier to adjust the weights myself</p> <p class=\"p--has-dropcap p-large-text\" id=\"a4fQRv\">One of the first things I bought at the start of the pandemic was a set of adjustable dumbbells. My husband and I both wanted to strength train, but we needed several different weights. He had actual muscles while I had noodle arms. The problem was our apartment couldn’t accommodate a full rack. Adjustable dumbbells seemed like a sensible choice. And it was until it wasn’t. During a set of chest presses, the pin securing the weight plates broke. I got a 5-pound plate to the face. So, as you can imagine, I was wary about testing the $429 (or as low as $300 on sale) NordicTrack iSelect Adjustable Dumbbells. </p><p id=\"IyTCcV\">While the price was certainly one thing I was wary about, it’s actually not outrageous. I’ll get into it more in a bit, but you could easily spend as much — if not more — on 10 sets of regular dumbbells. That’s essentially what you’re replacing here, as the iSelect Dumbbells go from five to 50 pounds in five-pound increments. You’re also paying a premium for the iSelect’s smart features. </p><p id=\"ueBM7Q\">There are two things that make the iSelect dumbbells “smart.” The first is that these use an electronic locking mechanism, as opposed to pins or end screws. The second is that you can change the weights using voice commands to Alexa. Though, fortunately, you don’t <em>have</em> to since there’s also a knob that lets you change the weights manually. </p><div id=\"EHoPAo\"><div data-anthem-component=\"scorecard:11141138\"></div></div><p id=\"iqkJ7q\">The dumbbells (or smartbells?) themselves rest in a custom-fitted tray. At the center is the manual knob as well as an LCD display that shows you the current weight. There’s also an optional tablet holder that you can screw into the back. The tray itself is relatively compact, measuring 21 x 19 x 16 inches (LWH). I couldn’t fit it into my living room, but that’s only because I already have another connected fitness gadget in there. It did, however, fit easily in my home office. Most people shouldn’t have a problem figuring out somewhere to store the tray. The only requirements are to place it near a power outlet, which isn’t usually a consideration when storing dumbbells. You’ll also want to be intentional about where you place the tray to begin with. Once you put these babies down, you’ll have to move 100 pounds of weight plates if you change your mind. It’s <em>not</em> fun. (You should also keep this in mind when the weights get delivered. The box it comes in weighs a hefty 123 pounds.) </p><p id=\"na8LuG\">Setting up the dumbbells is easy. All you’ve got to do is download the iSelect app for iOS or Android and then follow the prompts to pair the dumbbells over Bluetooth and Wi-Fi. (The latter is for firmware updates.) If you want to use the dumbbells with Alexa, you’ll have to take a few extra steps to link the iSelect app and your Amazon account. The iSelect app is also where you can set customized weight profiles for 15 dumbbell exercises, including bicep curls, chest presses, and squats. I didn’t use this feature much, but I can see it being useful if you’re someone who knows exactly how much weight you need for each move.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3X5Ls05LJUPvg-PJA7ACQExxZtg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383007/vsong_220411_5135_0005.jpg\">      <figcaption><em>You can set presets in the iSelect app.</em></figcaption>  </figure></div><p id=\"n1HNgj\">Unlike most connected fitness products, the iSelect Dumbbells have one huge thing in their favor: a subscription isn’t mandatory. You get one month of NordicTrack’s iFit family membership with purchase, but you don’t have to stick with it. Just make sure you cancel the auto-renewal if you’d rather use a different service — if you even want to use a service at all. The best part is that you’re not stuck with bricked dumbbells if NordicTrack decides to stop selling or supporting this device. </p><p id=\"OzIYqt\">If you do choose to stay with iFit, you’ll have to download a separate iFit app to access classes. It’s annoying when connected gadgets make you download multiple apps to use them. It’s especially irksome if neither app is particularly well-made. With both the iSelect and iFit apps, I had loading and connectivity issues. It wasn’t every time I fired up the apps, and restarting my phone usually fixed the problem. But I didn’t appreciate the extra time I had to spend troubleshooting when trying to squeeze in a workout.</p><p id=\"mYMZrC\">As for iFit’s content — it’s fine. It’s not flashy like Peloton or Apple Fitness Plus, but that might appeal to folks who don’t love peppy instructors spouting fortune cookie wisdom. You’re also still getting a solid workout. Structurally, the classes and exercises featured were similar to those I’ve taken on several other fitness apps. (Though I appreciated that iFit didn’t rush through rest periods between sets.) It’s just a different overall flavor. If Peloton is a Starbucks frappuccino, iFit is more like a solid cup of diner coffee. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/V2sIDdv-7XpfthIgKcfhz6YQV14=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383006/vsong_220411_5135_0004.jpg\">      <figcaption><em>You can also attach an optional tablet holder if you like to follow along to classes.</em></figcaption>  </figure><p id=\"WI0oKP\">That said, iFit doesn’t provide special content or features within its service for these dumbbells. Unlike the Tempo Move or JaxJox’s connected dumbbells, these dumbbells aren’t going to count your reps or give any extra insight. The most you get is instructors in <em>some</em> classes going over how the iSelect dumbbells work while cheesily plugging the Alexa functionality. </p><p id=\"w0YtL9\">Speaking of which, one of the most annoying things about working out with traditional adjustable dumbbells is that it takes time to increase or decrease weights. That’s not an issue if you’re making your own workouts. However, if you’re taking classes, the 30 seconds between sets isn’t enough time to reset the weights in the rack, lift a mechanical pin, calculate how many extra plates you need to add, and then really make sure everything is secured. When I <a href=\"https://www.theverge.com/2022/1/11/22876686/nordictrack-ifit-alexa-adjustable-dumbbells-fitness\">first covered these dumbbells</a>, NordicTrack emphasized in a demo that the combo of Alexa and the speedy electronic locking mechanism would be fast <em>and</em> safe.</p><p id=\"2zaJO8\">In reality, Alexa was sometimes fast. Other times, Alexa got very confused.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/R21Cww-BCkhm7n0Ai1LozI4vI_8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383005/vsong_220411_5135_0003.jpg\">      <figcaption><em>It’s just so much easier and faster to use the manual knob.</em></figcaption>  </figure></div><p id=\"x2U8jB\">To control the dumbbells, you can issue commands like “Alexa, set weights to bicep curl,”   “Alexa, increase / decrease weights by five pounds,” or “Alexa, set weights to 15 pounds.” When everything is working properly, it takes Alexa maybe 5–10 seconds to do what you’ve asked. That’s not including the time to re-rack the dumbbells, which you have to do to adjust the weight. Unfortunately, Alexa is not always the smartest assistant on the block. Many times, Alexa would mistake “weights” with “lights.” Instead of doing what I asked, Alexa would ask which Hue bulbs I wanted to turn on or off. Other times, Alexa would say it couldn’t connect to my dumbbells — but would then successfully change the weights after a short lag. </p><p id=\"zWDPdE\">Again, this is less of an issue if you’re not following along with any sort of program. If you are, however, Alexa can have a hard time hearing you correctly. I tested using both an Echo Spot and the fourth-generation Echo, both of which occasionally had difficulty understanding me — the Spot more so than the Echo. To be fair, Alexa <em>was</em> able to understand me over a Peloton or iFit class with no problem several times. But, every once in a while, I’d have to repeatedly yell over the instructor or pause the class for Alexa to understand my command. But even if Alexa was working properly, nine out of 10 times it was faster for me to manually adjust the weights myself using the knob.</p><p id=\"qwsNW2\">The only time I could see myself using Alexa over the knob is if I were running to the kitchen for water during a recovery break. Even then, I’m not sure that’d be faster than manually adjusting. I’m all for Alexa controls being there for accessibility reasons, but in that case, I’d want the feature to work more consistently. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/huKLaV75-mgOlJ2Miv5ylhWloFY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383008/vsong_220411_5135_0006.jpg\">      <figcaption><em>The shape is a little bulky for my taste, but the square ends make it good for plank-dumbbell exercises like renegade rows.</em></figcaption>  </figure><p id=\"KMgsdC\">I was impressed by how fast it was to manually adjust the dumbbells. A couple of years ago, I reviewed <a href=\"https://gizmodo.com/jaxjox-kettlebell-connect-review-this-connected-kettle-1844285865\">JaxJox’s connected kettlebell</a>. While it also had an electronic locking mechanism, it wasn’t always fast enough to keep up with classes. Conversely, it feels like the iSelect dumbbells switch weights instantaneously. And that speed doesn’t come at the expense of safety. I’ve done overhead tricep extensions, deadlifts, Russian twists, renegade rows, chest presses, squats — you name it. Nothing ever fell off.</p><p id=\"r9E3tb\">The iSelect Dumbbells are also sturdy, and the plates don’t rattle as much as other adjustable dumbbells I’ve tried. The handles are grippy and the square shape is good for exercises where you have to plank with the weight (e.g., renegade rows, dumbbell pass-throughs.) Even so, the shape is bulkier than I’d have liked, and I wouldn’t say they were vastly better than the standard dumbbells I already have.</p><p id=\"0QNNBN\">At $429, the dumbbells are expensive. That’s not including the cost of an Amazon Echo device — if you don’t already have one — or the $39 monthly subscription if you choose to continue with iFit. However, whether they’re too expensive to be worth it depends on your strength-training needs. A full rack of standard dumbbells from 5 to 50 pounds in five-pound increments can cost a small fortune. NordicTrack’s version, for instance, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.nordictrack.com%2Fdumbbells%2Fpremium-dumbbell-set-dumbbell-rack%3Fgclid%3DCj0KCQjwxtSSBhDYARIsAEn0thR_LmfMRs_b9DhceRk5NxjreREowlw_Ac4xuU2hDkFUL6A_elNtL7EaAjsQEALw_wcB&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23022416%2Fnordictrack-iselect-adjustable-dumbbells-review-amazon-alexa\" rel=\"sponsored nofollow noopener\" target=\"_blank\">costs $1,999</a>. Most are in the $700–$1,000 range. When you compare the iSelect dumbbells to that, then you’re getting a deal. You’re also saving a ton of space in your home.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/L5JSCTAFv3bKoVBvt9BgaWumLRw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383004/vsong_220411_5135_0002.jpg\">      <figcaption><em>The weights go from five to 50 pounds in five-pound increments.</em></figcaption>  </figure></div><p id=\"jK34HJ\">But that’s if you actually need a full rack. If you’re a beginner, you don’t. Smaller, space-efficient dumbbell sets can be found for much less. Adjustable dumbbell sets with a smaller range are also on Amazon for roughly $20–$150. Some can even turn into barbells. Meanwhile, if you’re disappointed by the lack of metrics, JaxJox also has a $499 set of connected adjustable dumbbells that can count your reps.</p><p class=\"c-end-para\" id=\"XArwW3\">If you have multiple people in your house at different strength levels — like me and my husband — a set like this makes more sense. We also happen to already have Alexa devices, though I don’t know that either of us would’ve used the voice control if I weren’t testing the device. For me, these dumbbells have the weight range we need, save space, and adjust quickly for classes. Most importantly, I can work out without worrying a plate will whack me in the schnoz. I’m well aware that no one needs to spend hundreds on connected weights that don’t actually have very many smart features. But if you’re looking for a full rack and don’t have a lot of space to work with, you could do far worse. </p><p id=\"bQ7m18\"><em>Photography by Victoria Song / The Verge</em></p><div><div id=\"4BBIJF\"><div data-anthem-component=\"aside:11141160\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/-fOe9_2WxrnrDAW2IxAFbgVBGfs=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23383003/vsong_220411_5135_0001.jpg",
  "description": "It was faster to change the weights myself.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}