{
  "title": "Alexa Together review: keeping tabs on Dad",
  "url": "https://www.theverge.com/23066024/alexa-together-review-elder-care-urgent-response",
  "date": "2022-05-14T14:00:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "  <p>For $20 a month, the service provides peace of mind, but many of its features should be free </p> <p class=\"p--has-dropcap p-large-text\" id=\"fp5gtg\">Every morning for the last four months, an alert has popped up on my phone between 4AM and 6AM, saying, “First activity of the day detected for Michael at 4:39 AM.” Thankfully, I don’t see it at that time. But later, when I’m actually awake and scrolling through my notifications, it’s a quick mental check telling me that my dad, who lives 300 miles away in Florida, is up and moving around.</p><p id=\"9aWcO4\">In January, we started a trial of <a href=\"https://www.amazon.com/Alexa-Together/b?ie=UTF8&amp;node=21390531011&amp;tag=googhydr-20&amp;hvadid=593619346528&amp;hvpos=&amp;hvexid=&amp;hvnetw=g&amp;hvrand=13999413085495540910&amp;hvpone=&amp;hvptwo=&amp;hvqmt=e&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=9010494&amp;hvtargid=kwd-1432099856796&amp;ref=pd_sl_4saqg68leh_e\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Alexa Together</a>, a new $19.99 a month service from Amazon that uses its digital assistant to somewhat unobtrusively keep tabs on a consenting family member or loved one. Six months of the service comes <a href=\"https://www.amazon.com/dp/B09FYLF9YT?th=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">bundled with the $130 Echo Show 8</a>, or you can get a 6-month free trial if you already have an Echo device. Using cues from my father’s interactions with Echo speakers and Alexa-connected devices in his home in Florida, Alexa Together kept me informed here in South Carolina without bothering him and without me needing to remember to call and check in (yes, I am a terrible daughter). </p><p id=\"3rkK7L\">Why would you want this service? Because technology, including smart connected devices, can make it easier for aging Americans to stay in their homes for longer. Specifically, Alexa Together can help a caregiver who doesn’t live with an aging loved one maintain a near-constant connection through those smart devices and provide help more easily and quickly when they are needed. </p><p id=\"y2fZHm\">While Alexa Together is not the first service to offer features like this, it’s certainly the most affordable and accessible. It’s also easy to set up and manage, especially if you are already familiar with Echo devices and the Alexa app. </p><div id=\"j7gCoq\"><div data-anthem-component=\"scorecard:11190592\"></div></div><p id=\"ryraIO\">A key feature of the US-only service is a direct line to a 24/7 Urgent Response service, where trained agents can request 911 dispatch in an emergency or contact a friend or family member. It adds a hands-free way to get help, which could be crucial if my dad fell down or was in the type of trouble that meant he couldn’t reach a phone. All he needs to do is call out, “Alexa, I need help,” and the Echo speaker would connect him with an operator. </p><p id=\"d1zZdd\">Thankfully, we never needed this service, but we did test it out, and it worked as advertised. Dad had to ask twice, but the second time he said, “Alexa, call for help,” the Echo Show 8 dialed the response center, and the call was answered within three rings. He could hear and talk to the operator, and they knew who he was. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tcarGJVEjh21yIFRFC53Vapt7Lg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23462847/AT_screenshot_2.jpg\">      <figcaption><em>I received a text message immediately when my dad called Urgent Response, then I got notifications from the Alexa app following through on the event.</em></figcaption>  </figure></div><p id=\"gfovGn\">As soon as my dad connected with the service, I received a text message (not a notification from the Alexa app, which I’d likely miss). This informed me he’d connected with the response center and then the app followed up with notifications when the call was complete, prompting me to check in. </p><p id=\"hHdKMv\">Of course, there are many well-known wearable medical alert devices that carry out a similar function, and an <a href=\"https://www.theverge.com/2019/10/28/20936113/apple-watch-emergency-sos-fall-detection-set-up-how-to\">Apple Watch can connect you to emergency services</a> with its SOS feature, plus newer models have fall detection capability. But wearables require someone to actually wear them. If that’s an issue with your loved one, Alexa Together is a good option. </p><p id=\"BdTgAj\">While Alexa Together isn’t quite at the level of a dedicated medical alert system — it relies on Wi-Fi, so it would be no good if the internet went down, the power went out, or if my dad tripped in the garden — it’s also nowhere near as expensive as many of those systems. Plus, it turned out to be a perfect way to slowly introduce the concept of smart home tech into my older parents’ home. I’ve been trying for years to get my dad to use smart home devices, and this is the first time anything has stuck.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yXifvkYt3eksr_--sgCofkT1IGA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451673/jtuohy_220508_5207_0003.jpg\">      <figcaption><em>Dropping in on my Dad’s Echo Show 8 using an Echo Show 10.</em></figcaption>  </figure></div><h2 id=\"vGVSVl\">Alexa Together: Setup, features, and testing</h2><p class=\"p--has-dropcap\" id=\"7vFked\">My father is in his late 70s. He lives with my mother, who is the same age, and they’ve had smartphones for a few years now. But they turn them off when they’re not using them. Like many people in their Boomer generation, they are more comfortable with computers than smartphones. (Yes, they still have a landline.) They’ve used Alexa, and are familiar with smart devices, but mainly because they visit me. </p><p id=\"JwecbA\">Getting them set up with Alexa Together was straightforward and we did it all over the phone, each using the Alexa app on our smartphones. You don’t have to do it together, but I  wanted to walk through it with my dad and make sure he was comfortable with what he was getting into. There are many privacy concerns around using Alexa in your home, <a href=\"https://www.theverge.com/2022/4/28/23047026/amazon-alexa-voice-data-targeted-ads-research-report\">especially regarding advertising</a>, and we’ve addressed the data privacy features of this service in our sidebar. If you are not comfortable using Alexa because of these concerns, this service is not for you.</p><p id=\"GRxfDe\">The most challenging part of the process was setting up the Echo Show 8 in his house. (He accidentally enabled Amazon Kids Plus, which meant none of the calling features worked at first). Both parties need their own Amazon account logged into their respective devices. The care receiver needs at least one Echo speaker. <a href=\"https://www.theverge.com/22521948/amazon-echo-show-8-2nd-gen-2021-review\">The Echo Show 8</a> is a good option as it has a screen and camera for video calling, although if you are going to add a lot of additional smart home devices, <a href=\"https://www.theverge.com/22297810/amazon-echo-show-10-2021-review\">consider an Echo Show 10</a>, which has a smart home hub built in. </p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BBruWt-AfA-gsFNiWTVNdQx-rww=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23467448/IMG_1974__1_.PNG\">      <figcaption><em>The activity alerts Alexa Together sends.</em></figcaption>  </figure></div><p id=\"WstesA\">The care receiver also needs to verify a mobile phone number with a text message and verify their address for the emergency response. On my end, after I’d accepted the terms and services (see sidebar) and provided his email address, I had to create a pin for the Alexa Together portion of the Alexa app. This is where I can see his activity feed and access some areas of his Alexa app to help him remotely. </p><p id=\"EymKyA\">Amazon recently added a “Circle of Support” feature, which was promised when the <a href=\"https://www.theverge.com/2021/12/7/22822026/amazon-alexa-together-elder-care-price-features-release-date\">service first launched in December of last year</a>. This lets up to 10 people be “caregivers,” with one maintaining “primary” status and the only one who can manage the Remote Assist feature. You can also add the care receiver’s spouse as one, so they can get the alerts, too — helpful if one half of the couple is more active and out and about than the other. </p><p id=\"WXsqUl\">Amazon sent my dad an <a href=\"https://www.amazon.com/gp/product/B084DCJKSL?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Echo Show 8</a>, an <a href=\"https://www.amazon.com/Echo-Dot/dp/B084J4KNDS?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Echo Dot (4th gen)</a>, an <a href=\"https://www.amazon.com/gp/product/B089DR29T6?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon smart plug</a> (which we plugged a lamp into), and one <a href=\"https://www.amazon.com/gp/product/B01M9AU8MB/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Philips Hue light bulb</a> to test Alexa Together with. This setup retails for around $250. While all you need to get started is an Echo speaker for around $40, what he received is the minimum amount of kit you’ll need for a three-bedroom home so the service can be accessed throughout the house. This is because the activity feed, which is the main feature you’ll interact with, requires the care receiver to actually use Alexa by interacting with devices such as smart lights or smart plugs or making a request of Alexa on an Echo speaker. </p><p id=\"GNi7dg\">You can also tie in third-party fall detection devices to the service, with an upfront cost but no additional monthly fees. These currently include the $250 <a href=\"https://www.amazon.com/VAYYAR-Care-Touchless-Compatible-Detection/dp/B09JXV82Z6?ots=1&amp;slotNum=2&amp;imprToken=bec0577e-ba85-8877-67f&amp;ascsubtag=%5B%5Dvg%5Bp%5D22586067%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Vayyar Care</a>, a wall-mounted device designed for bathrooms that uses sensors and radio waves to detect a human figure falling, ATS’s<a href=\"https://www.amazon.com/SkyAngelCare-Detection-Compatible-Together-Automatically/dp/B09LGJYPY8?ots=1&amp;slotNum=3&amp;imprToken=bec0577e-ba85-8877-67f&amp;ascsubtag=%5B%5Dvg%5Bp%5D22586067%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\"> SkyAngelCare</a>, a $170 fall-detection pendant that communicates over Wi-Fi to Alexa, and <a href=\"https://www.amazon.com/dp/B09XGWD797?th=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">AltumView’s smart activity sensor,</a> a $250 fall detection camera that transmits stick-figure animations rather than video to protect privacy.</p><div class=\"c-float-left c-float-hang\"><aside id=\"kZRtLm\"><q>With the knowledge that he was in some way communicating with me by using them — my dad started to ask Alexa to turn on the light</q></aside></div><p id=\"bOblZe\">I had put a <a href=\"https://www.theverge.com/2017/6/26/15865292/amazon-echo-show-alexa-review\">first-gen Echo Show</a> in my parents’ home a few years ago, and they use it primarily as a picture frame. With the new smart home gadgets — and the knowledge that he was in some way communicating with me by using them — my dad actually started to ask Alexa to turn on the light or turn off the lamp. They also started to use the assistant for more things than just their shopping list. </p><p id=\"UMP6Aj\">As mentioned, the main feature of Alexa Together you, as the caregiver, will interact with is the activity feed and alerts. The feed, which is housed in the Alexa app, gives a zoomed-out view of the daily Alexa interactions of the care receiver without divulging just which 1950s rocker my dad was listening to on repeat. The service also sends you an alert confirming there was activity within a specific time window (which you can adjust) and one if no activity is detected in that time. I quickly found I became anxious about receiving those daily alerts; for obvious reasons, they don’t always arrive at the same time.</p><p id=\"AqMjJN\">The one time I got a “No activity” alert — meaning no one had interacted with the assistant in the designated time window — I immediately called their landline. Everyone was okay, but their routine had changed that day. I was impressed that Alexa had detected this anomaly. When it comes to elder care, anomalies indicate changes in routine and are critical indicators of health and well-being. However, there wasn’t a problem, only a change in routine. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/be-5zc7cuLSLNjIjV1qj5dsQz4Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23462880/AT_screenshot_1.jpg\">      <figcaption><em>The Alexa Together interface is in the Alexa app, this shows the home page, activity feed, and Remote Assist settings.</em></figcaption>  </figure></div><p id=\"FKIbvp\">This is where setting up motion or contact sensor integration would be useful, something that requires no action on their part other than to walk past it. For the setup we had, most of the interactions needed to be active. The Echo Show and 4th generation Echo Dot can detect when someone is near them, and trigger a “first activity” alert. However, only the first motion event will register, general motion detection won’t show up in the activity feed, and if you only have one or two devices registering motion it could easily be missed. </p><p id=\"U8f5M9\">Using an Echo Show 10 or other devices with a Zigbee smart home hub would let you set up compatible contact and motion sensors to add more signals, such as when a medicine cabinet was opened, or if there was motion in the bathroom. I wasn’t able to test any of this with the equipment we had, but you would have to scroll through the feed to see this activity as you can’t customize the alerts. I’d like more options for setting up alerts (such as when specific devices are triggered — so I could know my dad took his medicine). Currently, you can only choose to be alerted to no activity and first activity.</p><div class=\"c-float-right c-float-hang\"><div id=\"d7pmAZ\"><div data-anthem-component=\"aside:11190959\"></div></div></div><p id=\"zN6buJ\">If my dad hadn’t answered the phone following the No Activity alert, I could have used the Drop-In feature. Usually, you can only Drop In on other people’s devices if they give you permission in the app. With Alexa Together, you can go into the care receiver’s account using Remote Assist and enable it on each Echo speaker individually. This is different from Alexa Calling, as the person doesn’t have to actively answer the call; it lets you tune into their Echo Show and see and hear what’s going on. Yes, it’s creepy, but there is an audible warning when a Drop-In starts, and the feed is fuzzy for a few minutes to give you the chance to move out of the way. It’s less intrusive than having a dedicated security camera in my parent’s home, something I know people looking after family members from afar have tried to use, with mixed results. </p><p id=\"f11B9v\">Remote Assist is the other feature I found helpful. As someone accustomed to painfully dealing with tech support requests over the phone, things were much more straightforward. Remote Assist allowed me to go in and adjust settings on my Dad’s Echo devices in Florida using my Alexa app here in South Carolina. I could turn off Do Not Disturb, enable Drop-In, and change the wake word, among other things. It also lets me set reminders for him — such as times to take medication — that would audibly and visually appear on his Echo speakers. I can also add things to his shopping list, add contacts to Alexa Calling for him, and set up music and podcast services. </p><p id=\"U6Jwwh\">These Remote Assist features aren’t a free-for-all. I only have access to certain controls. This does feel limiting, and features I couldn’t access didn’t make a lot of sense. For example, I couldn’t disable the Amazon Kids controls he’d accidentally turned on, so I had to walk him through it over the phone. What you can and can’t do feels a bit random. The Remote Assist interface is also a little buggy and very slow at times. </p><div><aside id=\"Uk9xbQ\"><q>“We have looked upon the expanded system as an asset not an intrusion” </q></aside></div><p id=\"rZpRqc\">One thing I wanted to do and couldn’t was create Routines remotely, though <a href=\"https://www.aboutamazon.com/news/devices/alexa-together-is-helping-bridge-the-miles-between-families\">that feature is on the way</a>. While I couldn’t test it, the company provided examples of what you will be able to do, such as setting up a Routine triggered by my dad turning off his alarm that would turn on the light, tell him the weather, and start playing the news. Other examples included turning on all of the household’s smart lights at sunset or setting up a goodnight Routine where Alexa will turn off smart lights and play sleep sounds. Amazon says the care receiver will get an email whenever a Routine is set up for them.</p><p id=\"7Jl4cG\">My dad found the service helpful, too, saying it was reassuring knowing that just by turning on one of the two new smart lights, I knew they were up and about. He has also started to use Alexa more (which is clearly part of the company’s goal here), and he likes it. “We’ve been using the system for entertainment, diary prompts, delivery updates, our shopping lists, and an additional information source,” he says. “We have looked upon the expanded system as an asset, not an intrusion, and we have been well satisfied with its performance.” </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JmTtMVEQ180G8pHq0-CKbBwUEMM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22641649/dseifert_4619_echo_show_2nd_gen_2.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>You need an Echo smart speaker to use Alexa Together. An Echo Show 8 is one of the better options, as you can video call and Drop In with your loved one.</em></figcaption>  </figure></div><h2 id=\"E7Hu2P\">Alexa Together: Should you subscribe?</h2><p class=\"p--has-dropcap\" id=\"MGcNRd\">While I found all these features useful, alone, they are not worth $20 a month (Alexa’s previous service, <a href=\"https://www.theverge.com/21560891/amazon-alexa-care-hub-how-to-use-setup\">Alexa Care Hub</a>, did a lot of this and was free). What you are really paying for is the Urgent Response feature, which adds another layer of peace of mind. Mainly because it’s entirely hands-free; as long as my dad can talk, he can get help. But you can set up a free <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__www.amazon.com_gp_help_customer_display.html-3FnodeId-3DG6WYZPF5XKHNBZKA&amp;d=DwMGaQ&amp;c=7MSjEE-cVgLCRHxk1P5PWg&amp;r=HTakECkqD13F_4No8TePr7snOg-TM_Z0bAqwspVK1Ig&amp;m=SG5q73qmqysH8bFat8OaE_c8n5N-CT1hEhb6pGi41DFj37KT5Vev7x7wHStnnEeN&amp;s=W13rAtm_DK2HvujB91rKO8LTJG7GXsMheFsMl6RzjRI&amp;e=\">Emergency Contact</a> feature without having to pay for Alexa Together. This lets you designate a contact as someone who Alexa will call and text when they say, “Alexa, call for help.” </p><p id=\"QjxDpT\">If you’re an OnStar member, you can use <a href=\"https://media.gm.com/media/us/en/gm/home.detail.html/content/Pages/news/us/en/2021/sep/0922-amazon.html\">its Alexa Skill</a> in the same way as the Alexa Together Urgent Response feature. Another option would be to set your parents up with a monitored security system, such as Ring or Simplisafe, which has a similar low cost for monthly professional monitoring but comes with a higher upfront equipment cost, plus they’d need help installing it. </p><div class=\"c-float-right c-float-hang\"><aside id=\"Vt4G4H\"><q>Alexa Together is relatively inexpensive and easy to use</q></aside></div><p id=\"TT6FWx\">Bearing these alternative urgent response options in mind, I’d like to see a free tier of Alexa Together without Urgent Response, with the option to upgrade when you want to add to it. I also think it’s limiting that two Amazon accounts are required, meaning someone can’t use this service alone (without a caregiver) or just with a spouse or live-in caregiver. Many caregivers who live with the person they care for might find this service helpful, especially if they travel or work out of the house. </p><p id=\"7qUy2T\">Overall, I think Alexa Together is an impressive system that has the potential to get smarter and more valuable. Compared to a lot of smart home products and medical alert devices that try to achieve similar results, Alexa Together is relatively inexpensive and easy to use. And it does what I want it to do: feel connected to my parents throughout the day even though they’re hundreds of miles away.</p><p id=\"5Q4JHV\"><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p><div><div id=\"khhPBa\"><div data-anthem-component=\"aside:11192708\"></div></div></div><p id=\"ANp9UD\"></p><p id=\"ZDGGUr\"></p><p id=\"LRJBOp\"></p><p id=\"OrXErL\"></p><p id=\"v2PrMM\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZxAKYTdckvlyuZ_tLFyM6knrV_A=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23451674/jtuohy_220508_5207_0008.jpg",
  "description": "Amazon’s new subscription service helps monitor Dad remotely, and surprisingly, it’s not as creepy as it sounds.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}