{
  "title": "Alex Garland’s Men has more than one thing on its mind",
  "url": "https://www.theverge.com/2022/5/9/23055151/alex-garland-men-review-a24",
  "date": "2022-05-09T16:00:00.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5SELnL3aWy0JJWHPjp_1GzaoqoI=/153x0:5928x3850/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70848649/https___cdn.sanity.io_images_xq1bjtf4_production_fe413743ffc3928af242b0bea13725b01e3c844e_6048x4024.0.jpg\" />    </figure>  <p>Jessie Buckley and Rory Kinnear star in Alex Garland’s latest feature</p> <p class=\"p--has-dropcap\" id=\"EpDx2E\">Despite all of the mystery that <a href=\"https://www.theverge.com/2022/2/9/22925148/alex-garland-men-trailer\"><em>Men</em></a>, writer / director Alex Garland’s new folk horror for A24, has been shrouded in, the movie’s story about a haunted woman trying to find peace in <a href=\"https://www.theverge.com/2022/3/23/22992578/men-trailer-alex-garland-release-date\">a world full of leering, lecherous men</a> is a surprisingly straightforward one. <em>Men </em>is often arresting in its brutality as it spins a stomach-turning tale about the multifaceted monster that misogyny truly is. But <em>Men</em> struggles to keep its messages and all their headiness in focus largely because of its frustrating obsession with making you question just how much of its otherworldliness is real.</p><p id=\"CYRXuH\"><em>Men</em> tells the story of Harper Marlowe (Jessie Buckley), a young widow who takes off to the English countryside for a solitary retreat following her husband James’ (Paapa Essiedu) unexpected and grisly death by suicide. <em>Men </em>doesn’t reveal much about either Harper or James as individual people or what first brought them together as a couple, but through flashbacks, the movie details the toxic mix of abuse and emotional manipulation that ultimately led to the end of their marriage. Though Harper knows that leaving James was the right decision and that James’ suicide was not her fault, she can’t help but feel partially responsible and psychologically trapped by the traumatic circumstances of his death. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oUfLEEn9rPlRW1IlI6arkD7weMI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23438276/Screen_Shot_2022_05_04_at_10.23.27_AM.png\">  </figure><p id=\"NhdcmN\">That feeling of being stuck and harmed by someone’s emotional violence even after they’ve died is one of the first manifestations of the malevolent entity that <em>Men</em>’s title refers to. <em>Men </em>illustrates that, while Harper’s trip is something she wants to do for herself, most everyone she interacts with — save for her friend Riley (Gayle Rankin) — readily presumes that she’s traveling with a man because she couldn’t possibly have the desire to get out on her own. </p><p id=\"h7IAnC\">“Everyone” is a loaded concept within the context of <em>Men</em>, in part because there truly aren’t all that many other people living in the remote and impossibly quaint village where Harper’s rented out a luxurious manor all to herself. Aside from Geoffrey (Rory Kinnear), the awkward, bumbling parody of an English countryman who owns the house where Harper’s staying, the only other people really living in the village seem to be a small assortment of male townsfolk — all of whom are also inexplicably and unsettlingly portrayed by Kinnear. Whether or not Harper herself can see that every male-identified person she meets in the village has the same grown man’s face isn’t clear, and <em>Men </em>leaves that question open for you to interpret as its story becomes increasingly strange and symbolic.</p><p id=\"Ruxbuv\">Though <em>Men</em> clues you in to the danger circling around Harper, it isn’t until she ventures out into the nearby woods for a walk and encounters a naked man — Kinnear once again — that it becomes apparent to her. Being chased through a secluded forest by a crazed man covered in bruises and cuts is alarming all on its own. But an important element of the horror <em>Men </em>conjures is how easy it is for the men around Harper to dismiss her fear regardless of how undeniably justified it is.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LlFcTNHVNqr2UN-T_UdgrsHcg0o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440524/Screen_Shot_2022_05_04_at_10.26.40_AM.png\">  </figure><p id=\"DDIWi5\">Though they’re important feelings she experiences as <em>Men </em>unfolds, neither fear nor guilt is what defines Buckley’s Harper, a woman who reflexively hides parts of who she is from strangers more out of caution than anything else. As one of the few women to appear in <em>Men</em>, Harper unexpectedly becomes a kind of final girl as the movie mutates into a home invasion thriller that’s equal parts cerebral and straightforward. <em>Men</em>’s implicitly supernatural trappings invite you to question its heroine’s state of mind. But Buckley brings a steadfast resolve to her performance as Harper, reinforcing the idea that the only person who could imagine this simply “being in her head” is someone who’s never known what it feels like to have their agency and bodily autonomy disregarded because of their sex or gender.</p><p id=\"YSpWqU\">The strange energy that each of Kinnear’s different characters has occasionally plays as enigmatic because <em>Men </em>doesn’t really clue you in to all that much about who they are outside of the fact that, in different ways, they all have bones to pick with women. Geoffrey’s simpering, emotional stuntedness may make it difficult for, say, the village’s priest or barkeep to see much of themselves in him. But <em>Men </em>shows you how the thing that unites them is an almost elemental disdain and lust for Harper. </p><p id=\"oMSs96\">At times — especially when its male characters are reveling in their most base, id-driven sexual impulses — <em>Men </em>bears a certain narrative similarity to Emerald Fennel’s <em>Promising Young Woman</em>. But unlike <em>Promising Young Woman</em>, where you were partially meant to be horrified because of how awful all of its seemingly “good” men truly were, <em>Men </em>leaves little room for questioning how each of its titular characters is an existential threat to Harper.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NEETNis-UqypE0DzOpOfM2-e3CA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440500/https___cdn.sanity.io_images_xq1bjtf4_production_b7f7aa5c5e3bfe5fa410e8c67df55539b798cdf1_1920x1080.png\">      <cite>A24</cite>  </figure><p id=\"kMOg3U\">Much of what takes place in <em>Men</em>’s final acts is genuinely mind-boggling and fucked up in ways that make you appreciate Garland for being willing to go there. That said, the way <em>Men</em> comes to a close will also make you question the degree to which Garland thought through the optics and implications of his story as a whole beyond their immediate ability to make you profoundly uncomfortable.</p><p id=\"rs0512\"><em>Men </em>wants to leave you thinking more deeply about what it’s trying to say, and it’s likely that many people who end up seeing the film will feel inclined to. But the same heightened reality that makes <em>Men</em>’s scares so potent ultimately has a muddling effect on the movie’s message, so much so that you can’t be sure whether Garland himself understood what he was trying to say.</p><p id=\"Ud3I2W\"><em>Men </em>also stars Sarah Twomey, Zak Rothera-Oxley, and Sonoya Mizuno. The movie hits theaters on May 20th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sDvb_iRuLMWifQE9j1PeSJyscok=/0x673:5928x3777/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437638/https___cdn.sanity.io_images_xq1bjtf4_production_fe413743ffc3928af242b0bea13725b01e3c844e_6048x4024.jpg",
  "description": "Director Alex Garland’s Men will leave you shaken.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}