{
  "title": "Alfa Romeo’s new SUV comes with an NFT for some reason",
  "url": "https://www.theverge.com/2022/2/9/22925040/alfa-romeo-nft-service-history-vehicle-data-second-hand-prices",
  "date": "2022-02-09T11:12:47.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DLFAK6ld3-tTtOMzDnr2rccZMnM=/16x0:784x512/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70487355/AR023_018TNq2q44hcn6ijr19qd0trlca2mgv__mid.0.jpg\" />        <figcaption><em>The Alfa Romeo Tonale.</em> | Image: Alfa Romeo</figcaption>    </figure>  <p id=\"Kt9z6k\">The Alfa Romeo Tonale SUV is the “first car on the market” to come with an NFT digital certificate, that the <a href=\"https://media.stellantisnorthamerica.com/newsrelease.do?id=23507&amp;amp;mid=\">Italian automaker says</a> will increase the car’s residual value. </p><p id=\"2nRb1b\">How? Well, that’s not exactly clear, but it involves recording information from the car’s electronic system to the blockchain as proof that a car has been properly serviced when it comes time to sell it.</p><p id=\"hOjRVS\">“With the customer’s consent, the NFT will record vehicle data, generating a certificate that can be used to assure the car has been properly maintained,” Alfa Romeo’s press release says. “On the pre-owned car market, NFT certification represents an additional source of credibility for owners or dealers to count on.” </p><p id=\"OK2w3M\">However, as <a href=\"https://www.cnbc.com/2022/02/08/new-alfa-romeo-suv-equipped-with-nft-blockchain-technology.html\"><em>CNBC</em> notes</a>, the data must be recorded by a certified Alfa Romeo dealer. </p><div class=\"c-float-right\"><aside id=\"U91iPJ\"><q>“NFT certification represents an additional source of credibility for owners or dealers”</q></aside></div><p id=\"DbwzQM\">As with a lot of NFT projects, there are questions about whether blockchain technology is  actually adding any value. Manufacturers already maintain a detailed service history of cars linked to their VINs (vehicle identification numbers). Notably, they’ve been able to do this for decades without using blockchain tech, which often uses energy-intensive proof of work algorithms.</p><p id=\"00YUGy\">Unfortunately, technical details on how Alfa Romeo’s NFT works are a little thin. When asked directly, spokesperson Nick Cappa was unable to say which blockchain the NFT will be stored on, or exactly which data is stored in the car’s NFT record. He did says that the company “soon” plans to extend NFTs to “the whole Alfa Romeo lineup.” </p><p id=\"fERnc7\">Tonale is Alfa Romeo’s latest SUV, available in both plug-in hybrid and gas-powered models. Its launch comes as the company is beginning to transition to an all-electric lineup by 2027, <em>CNBC</em> notes, which will include the launch of its first all-battery electric car in North America in 2025. The Tonale will be available to order in the fourth quarter of 2022, with plans to ship in the first quarter of 2023.</p><aside id=\"x63qPU\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"NFTs, explained\",\"url\":\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\"}]}'></div></aside><p id=\"QxtUhs\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Uaxyr7UKdg8bdFBvWOWtte8d7vU=/0x47:800x466/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229059/AR023_018TNq2q44hcn6ijr19qd0trlca2mgv__mid.jpg",
  "description": "Whose emissions are higher, the car’s or the NFT’s?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}