{
  "title": "Alienware’s 2022 gaming laptops are going big on AMD",
  "url": "https://www.theverge.com/2022/4/21/23035277/alienware-dell-2022-gaming-laptops-g15-m15-m17-amd-ryzen-9-nvidia-rtx-features-specs-price",
  "date": "2022-04-21T14:40:58.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Dell G15 2022\" src=\"https://cdn.vox-cdn.com/thumbor/wAoIt-d2w8ziJLPIWsY3i131kqQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70776005/g152022.0.jpg\" />        <figcaption><em>Similar speckled design but with new internal hardware.</em></figcaption>    </figure>  <p id=\"KVihyc\">Alienware has announced a release date and pricing info for its latest batch of gaming laptops. Today’s big news is that the new Dell G15, the Alienware M15 R7, and the Alienware M17 R5 are available now. Notably, each of the configurations will come equipped with AMD’s 6000-series processors (paired with Nvidia’s RTX 30-series graphics cards by default) and fast DDR5 RAM, among other impressive specs. Intel-based versions will likely release later in 2022.</p><p id=\"o1YWrb\">The most affordable option in the lineup is a 2022 iteration of the Dell G15 (pictured above), which is back in its speckled, Alienware-esque design. <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAlienwareLaptop042122/https://www.dell.com/en-us/shop/gaming-laptops/new-g15-gaming-laptop/spd/g-series-15-5525-laptop/gn5525fowvs\" rel=\"sponsored nofollow noopener\" target=\"_blank\">It starts at $899.99</a>, equipped with a 1080p display that has a 120Hz refresh rate, AMD’s Ryzen 5 6600H six-core processor, a Nvidia RTX 3050, 8GB of 4,800MHz DDR5 RAM (supports up to 32GB), and a 256GB NVMe M.2 SSD. In terms of processing and graphical grunt, this model can go all the way up to AMD’s Ryzen 6 6900HX and the RTX 3070 Ti, respectively, with a QHD 240Hz display.</p><p id=\"Uy7eHM\">All models of the G15 have a similar port layout, including an HDMI 2.1 port, three USB-A 3.2 Gen 1 ports, one USB-C Gen 3.2 port with DisplayPort alt-mode, a headphone port, and an ethernet jack. Though models that have the RTX 3060 and up will feature a faster 2.5Gbps ethernet jack, others will get one with slower bandwidth.</p>  <figure class=\"e-image\">        <img alt=\"Alienware M15 R7 2022\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tlXp0NNBECpxgxXhj5-6tXyTJJs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23406031/m152022.jpg\">      <figcaption><em>This model has also seen very few aesthetic changes year to year.</em></figcaption>  </figure><p id=\"GpbRH0\">If you want a more appealing design that can deliver more power than the G15 (and you don’t mind paying more), you might be interested in the 15.6-inch Alienware M15 R7 <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAlienwareLaptop042122/https://www.dell.com/en-us/shop/laptops/amd/spd/alienware-m15-r7-amd-gaming-laptop/wnm15r7cto010s\" rel=\"sponsored nofollow noopener\" target=\"_blank\">starting at $1,499.</a><a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.dell.com/en-us/shop/laptops/amd/spd/alienware-m15-r7-amd-gaming-laptop/wnm15r7cto010s\" rel=\"sponsored nofollow noopener\" target=\"_blank\">99</a> or the <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.dell.com/en-us/shop/cty/pdp/spd/alienware-m17-r5-amd-gaming-laptop?~ck=mn\" rel=\"sponsored nofollow noopener\" target=\"_blank\">17.3-inch M1</a><a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAlienwareLaptop042122/https://www.dell.com/en-us/shop/cty/pdp/spd/alienware-m17-r5-amd-gaming-laptop?~ck=mn\" rel=\"sponsored nofollow noopener\" target=\"_blank\">7 R5 that starts at $1,599.99</a>. While not as thin as Alienware’s pricier X-series gaming laptops, these retain many of the same design characteristics — just in a heavier chassis (and the larger size allows for more power, mind you). </p><p id=\"IyBvGR\">With either model, you can elect for a 1080p display that offers Nvidia’s G-Sync adaptive sync and a 165Hz refresh rate. In the M15 R7, you can go up to a QHD 240Hz panel with G-Sync, while the M17 R5 offers up to a 4K 120Hz panel with AMD’s FreeSync Premium. Processor configurations start with AMD’s Ryzen 7 6800H, going up to the AMD Ryzen 9 6900HX. The M17 R5 can go up even higher to the AMD Ryzen 9 6980HX, which is currently the top-of-the-line chip in AMD’s ballpark.</p><p id=\"aIOUuq\">As for the selection of GPUs, the base offering for both laptops includes the RTX 3050 Ti at the bottom rung with 90W maximum graphics power in the M15, with the M17 R5 getting 95W with the same chip. The step-up configuration includes an RTX 3060 (140W in both machines), the RTX 3070 Ti (150W in both, as well), or the 16GB variant of the RTX 3080 Ti at the top with 140W of max graphics power. (There’s a higher 155W power ceiling in the M17 R5.)</p>  <figure class=\"e-image\">        <img alt=\"Alienware M17 R5 Ryzen Edition\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_X3Fupy4HSfHIsBPk9VqK9pEGgA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23134066/m17r5ryzenedition2.jpg\">      <cite>Image: Alienware</cite>      <figcaption><em>A top-down view of the Alienware M17 R5.</em></figcaption>  </figure><p id=\"J27V4G\">During CES 2022, <a href=\"https://www.theverge.com/2022/1/4/22858782/alienware-m17-r5-ryzen-edition-radeon-graphics-nvidia-gaming-laptop\">Alienware announced the M17 R5 Ryzen Edition laptop</a>, which can be configured with AMD’s latest, high-end processors and mobile graphics chips. It’s the model that can sport the aforementioned Ryzen 9 6980HX. And, in the case of graphics, it can get AMD’s Radeon RX 6700M 10GB card with 125W of max graphics power or the Radeon RX 6850M XT 12GB card, which has an impressive 165W max graphics power.</p><p id=\"tRq28a\">The base models of the M15 and M17 include just 8GB of 4,800MHz DDR5 RAM, but with their two SO-DIMM slots, the M15 and M17 support up to 64GB. As for storage, lesser models have a single storage option that starts with 256GB NVMe M.2 SSDs, going up to 2TB. Or, if you elect for an RTX 3060 or higher configuration, you’ll have dual storage options with support for up to 4TB of storage.</p><p id=\"8NMF3r\">Alienware also determines which ports you’ll get by the GPU that’s inside. All models have a headphone jack, two USB-A 3.2 Gen 1 ports along the right, a power port on the back, an HDMI 2.1 port, and another USB-A 3.2 Gen 1 port. The base models with the RTX 3050 Ti include 1Gbps ethernet jacks (as opposed to 2.5Gbps ports in higher tiers) and a USB-C 3.2 Gen 2 port with 15W PD and DisplayPort 1.4 functionality. Higher-tiered machines have a USB-C USB4 port. (Alienware says actual USB4 support for that port is coming this summer, though.)</p>  <figure class=\"e-image\">        <img alt=\"Alienware M17 R5\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qWFuJT3zYqtl3zs6yJrkCpv9O08=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23406060/m17rear2022.jpg\">      <figcaption><em>From the front to the back, these machines sure haven’t changed much.</em></figcaption>  </figure><p id=\"rvcHFd\">Some smaller details I noticed about these new machines are that, unfortunately, webcams are still 720p, while several competitors in the gaming space have made the jump to 1080p. And, at least in the case of the M17 R5, there’s an option to get a 240W small form factor charger built with GaN technology, which typically yields greater power efficiency than other chargers while being smaller. Alienware hasn’t shown off what it will look like yet, so we don’t know if it’s smaller or simply more efficient.</p><p id=\"CigDAJ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/w-ttNUvJtcdjE6_OZk3_8bkV0mI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23406029/g152022.jpg",
  "description": "Small on external changes but with mostly new internals.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}