{
  "title": "Alienware’s thin, 14-inch X14 gaming laptop is now available",
  "url": "https://www.theverge.com/2022/2/11/22927726/alienware-thin-14-inch-x14-gaming-laptop-now-available-release-date-price",
  "date": "2022-02-11T13:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Alienware X14\" src=\"https://cdn.vox-cdn.com/thumbor/TK2O5T1IGOzoSgdtoTMqOIOsZTw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70497025/cfaulkner_141231_5006_0014.0.jpg\" />        <figcaption>Photo by Cameron Faulkner / The Verge</figcaption>    </figure>  <p id=\"Dzfiru\">Alienware’s new 14-inch X14 gaming laptop is now on sale, <a href=\"https://www.theverge.com/2022/1/4/22855430/alienware-x14-14-inch-gaming-laptop-dell-display-specs-price\">following its announcement in January at CES 2022</a>. While the X14 is considerably smaller (and thinner) than the 15-inch X15 or 17-inch X17, it borrows some of the highlights of those pricier, more powerful machines. At launch, it features a 14-core Intel Core i7-12700H processor, up to Nvidia’s RTX 3060 graphics chip, and up to 2TB of SSD storage and 32GB of LPDDR5 RAM clocked at 5,200MHz. If you want a machine with those specs inside, it’ll cost you $2,299.99 — not cheap for an RTX 3060-equipped laptop.</p><p id=\"v8g7Vo\">There are less costly options at launch, and more are on the way. Prices for the low-end X14 configuration currently start at $1,649.99, and you’ll get the same Core i7-12700H processor, but with 16GB of LPDDR5 clocked at a slightly slower 4,800MHz speed, 512GB of storage, and Nvidia’s RTX 3050. Alienware told <em>The Verge</em> that configurations with Intel’s Core i5-12500H processor will arrive in the future, but it didn’t have prices to share upon request.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/j17E2JtL74LMrVNptY_P4R0yisk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23231671/cfaulkner_141231_5006_0001.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>  </figure><p id=\"MqdeDA\"><a href=\"https://www.theverge.com/e/22692101\">I reviewed the X14</a>, and the good news is that it’s a natural fit in Alienware’s lineup, despite its specs being geared toward a more casual crowd of gamers than usual. It’s a surprisingly speedy laptop when it comes to gaming, as well as for creative tasks like exporting video in Adobe Premiere Pro. </p><p id=\"AyCRb6\">Unfortunately, the reduction in size comes with a drop in gaming performance compared to Alienware’s other X-series laptops. That’s to be expected, but I wouldn’t suggest getting this machine if you want to run every game at its highest graphical settings. Additionally, its keyboard layout and trackpad could have used some extra refinement. And while its Alder Lake mobile processor tore through video exports, it didn’t provide the same kind of miracle for battery life. I got about four and a half hours of battery usage on the X14. </p><p id=\"1zC9sl\">These downsides may be forgivable for some, but they’re tough to accept given the X14’s high asking price. If you have near $2,000 to spend on a laptop, maybe you should get one that’s a little less compromised. <a href=\"https://www.theverge.com/e/22692101\">You can read my full review right here.</a></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QBiwwcZ0kkOBMeMwf9WcmtiKBSA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23231678/cfaulkner_141231_5006_0014.jpg",
  "description": "This USB-C-powered gaming laptop is here",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}