{
  "title": "Alienware’s QD-OLED monitor sets a new standard for gaming displays",
  "url": "https://www.theverge.com/23011794/alienware-aw3423dw-review-qd-oled-curved-gaming-pc-monitor",
  "date": "2022-04-06T14:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "  <p>It’s the monitor that I’ve been waiting for</p> <p class=\"p--has-dropcap\" id=\"I4yOqg\">High-end TVs and gaming monitors have been on a collision course for the past few years. The TV industry has pursued the best-looking picture, while monitors have opted for the fastest display tech. The crash that blends the two worlds together might have finally happened with Alienware’s latest curved gaming monitor, which has a QD-OLED screen. It’s the first device (of several more to come in 2022) to show what Samsung’s new QD-OLED display technology is capable of — for PC users, specifically.</p><p id=\"3agc80\">The AW3423DW, as it’s officially (and clumsily) called, is now available for $1,299.99, beating Samsung and Sony’s forthcoming QD-OLED TVs to market. Actually, while it’s technically available, <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.dell.com/en-us/shop/alienware-34-curved-qd-oled-gaming-monitor-aw3423dw/apd/210-bcye/monitors-monitor-accessories\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the soonest delivery date for new buyers of this QD-OLED is currently late June</a>. So, those TVs might find their way into plenty of homes by the time people finally get their hands on this monitor.</p><p id=\"Q7rhz2\">But those will still be TVs, and <em>this</em> is a monitor. While this isn’t the first OLED targeted toward PC gamers, the AW3423DW is the kind of monitor that I have been waiting years for. I don’t want to have a tall TV on my desk, even if it is one of the “smaller” 42-inch LG C2 OLED TVs that are releasing this spring. The AW3423DW looks like a gaming monitor, with its immersive 1800R curve and 21:9 ultrawide (3440 x 1440) design. And, with a display capable of 175Hz refresh rate, it acts like one but has far better picture quality — and brightness — thanks to QD-OLED. At $1,299, Alienware’s pricing seems right on the money, coming in for less than next-gen TVs with many (but not all) of the same perks.</p><div id=\"BT8zzo\"><div data-anthem-component=\"scorecard:11129951\"></div></div><p id=\"OO3oNs\"></p><div class=\"c-float-right\"><div id=\"PyELcW\"><div data-anthem-component=\"aside:11129956\"></div></div></div><p id=\"qyae4P\">There’s a lot riding on QD-OLED panels given that Samsung Display claims they boast some key improvements over standard OLED. They promise a brighter image while still maintaining the excellent control over brightness that’s been a hallmark of OLED displays. What does that mean practically? The ability to be more accurate with brightness means QD-OLEDS can theoretically produce colors more accurately than traditional OLED displays. So, the reds and greens of nature that might look a little more muted on other displays will feel vibrant and more real on a QD-OLED. It comes down to the quantum dot layer (that’s the “QD” in the name), which converts blue light into red and green when needed, without the need for color filters typically used in standard OLED panels. Color filters tend to diffuse or dim the picture in some instances, especially when viewed at an angle. That’s not an issue here.</p><p id=\"gnQBAu\">The AW3423DW delivers on the promises of QD-OLED with a bright picture (like, give-you-a-headache bright), unbelievably good viewing angles, and gorgeous colors. Jumping into the dense, green forests on <em>Shadow of the Tomb Raider</em> looked <em>amazing</em>. The first taste of what the technology is capable of is a delicious one, and I like it even more because it’s in a smaller design made for PC gamers.</p><p id=\"sZ6nco\">As a gamer, I was consistently impressed with the HDR performance, too. OLEDs can struggle with HDR performance in brighter areas. The plume of an explosion won’t be quite as detailed in HDR on an OLED display versus LED. Yet, with a powerful PC rig attached, games look fabulous on the AW3423DW. Explosions popped. I tested out all of the games that I hoped would look great here, like <em>Destiny 2</em>, <em>No Man’s Sky</em>, <em>Deathloop</em>, and <em>Cyberpunk 2077</em>. Thanks to that 1800R curve, practically any game that puts the player in a world with a grand amount of scale looks phenomenal — especially considering that I’m looking at the AW3423DW from about one foot away. I’ve used curved gaming monitors before, but this QD-OLED panel’s combination of curve and vividness were the missing factors that pulled me further into my games. It might sound cliche, but I feel like I’m really seeing games as their makers intended.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Alienware AW3423DW QD-OLED gaming monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MbLspn7won1dC0F1PjkropSGfgM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367363/bfarsace_220404_5111_0009.jpg\">      <figcaption><em>Destiny 2 is the game that the AW3423DW is marketed alongside, and for good reason. It looks brilliant displayed on it.</em></figcaption>  </figure></div><p id=\"RNVVTq\">But not every game plays nicely with the 21:9 aspect ratio. Sadly for me, that currently includes <em>Elden Ring</em>, which registers the native 3440 x 1440 resolution in its settings but still slaps black bars on the screen to confine it to 16:9. There’s a downloaded tool called “Flawless Ultrawide” that can force ultrawide, but you apparently run the risk of getting caught by <em>Elden Ring’s</em> anti-cheat system by using it. </p><p id=\"PAVlXn\">Nevertheless, <em>Elden Ring</em> looks fantastic on the AW3423DW. I was in the Academy of Raya Lucaria section of the game when I first received the monitor for testing, and I was impressed with how radiant the effect of using glintstone sorcery appears on the QD-OLED. On my IPS panel at home, the same effect looks more muted and decidedly less cool. Glintstone sorcery should look powerful and unwieldy, and it finally does on this display.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Alienware AW3423DW QD-OLED gaming monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7BcDu1npC1B8z22Q6Ted2AbJcrU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367359/bfarsace_220404_5111_0005.jpg\">      <figcaption><em>Games and really everything else look just as good at more extreme viewing angles as they do straight on.</em></figcaption>  </figure></div><p id=\"qOJe0R\">If you’re purely gaming, you may not need to make any adjustments to the color profile, but the out-of-the-box contrast and brightness settings were not suitable for simpler use cases, like using productivity apps — namely Gmail, Slack, or Google Docs. Out of games and in the world of text, the off-whites and grays didn’t have the color separation that they should. Everything just kind of blended together. While the out-of-the-box pre-calibrated settings were great for games, I had to create a new calibration profile for simple productivity tasks. It’s an annoying extra step — switching between calibration profiles depending on the tasks — but it definitely felt worth it when playing games.</p><p id=\"aw2lkd\"><a href=\"https://www.youtube.com/watch?v=XVgUosc-64U\"><em>HDTVtest</em> has an interesting video</a> about another possible pitfall of QD-OLED (or at least this one) for productivity tasks. According to their analysis, it produces a color fringing effect that can be seen while typing in a word processor or completing a similar task. But that flaw wasn’t distractingly noticeable during my testing. </p><p id=\"kQ2VSB\">Back to the topic of screen settings, I was less than impressed with the on-screen UI of the AW3423DW and its bottom-mounted joystick that’s used to move about the interface. It’s generally confusing to navigate, and it looks out of place on a high-end monitor. My greatest moments of disappointment with this monitor were when I was trying to outsmart the interface, which commonly makes it harder than necessary to make simple adjustments.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Alienware AW3423DW QD-OLED gaming monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FycWC19b2_ZxyrfxiqO-WRK3BRU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367360/bfarsace_220404_5111_0006.jpg\">      <figcaption><em>The LEDs around the monitor can be customized within the UI.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Alienware AW3423DW QD-OLED gaming monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1RWmAD1QmdYd5tvpOkcwt-6B16U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367356/bfarsace_220404_5111_0002.jpg\">      <figcaption><em>The monitor’s kludgy on-screen display is controlled via a small joystick.</em></figcaption>  </figure></div></div></div><p id=\"Q5w7YR\">The AW3423DW isn’t the only OLED that can deliver amazing picture quality, bright colors, and true blacks. You can still use an OLED TV as a gaming monitor. And, if you’re someone who watches a lot of movies and TV shows and enjoys console gaming, getting something like LG’s 42-inch C2 might actually be the better buy. That’s mainly because it has a 16:9 aspect ratio, allowing modern gaming devices, be it a PC, a Switch, or the Xbox Series X or PS5, to fully fill out the screen, in addition to having HDMI 2.1 and 4K 120Hz support for consoles and PC. Plus, LG claims that its latest OLEDs are brighter than ever, but we haven’t been able to test them yet ourselves.</p><p id=\"1xEHWC\">On the AW3423DW, Microsoft’s Xbox Series X or Sony’s PS5 consoles are limited to displaying in 16:9 (hello, big black vertical bars on the sides of the picture). And while Microsoft’s console can at least render at QHD (2560 x 1440) resolution at 120Hz refresh rate, the PS5 can only do a measly 1080p at 120Hz on this $1,300 screen. (You’ll first need to turn on Performance Mode within the PS5’s game preset settings.) Needless to say, it’s not much fun to play games like that. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Alienware AW3423DW QD-OLED gaming monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/md61XkGaUQJdafhHXgzdVQ6vlR0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367358/bfarsace_220404_5111_0004.jpg\">      <figcaption><em>The stand offers height, tilt, slant, and swivel adjustments.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Alienware AW3423DW QD-OLED gaming monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HabEJoNUcBQxu7nO51_UmT5G-Z4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367366/bfarsace_220404_5111_0012.jpg\">      <figcaption><em>The moire seen on the display isn’t visible in person.</em></figcaption>  </figure></div></div></div><p id=\"B5bSQu\">The AW3423DW has the slight advantage when it comes to brightness. Standard OLED TVs, <a href=\"https://www.theverge.com/2021/12/11/22815110/lg-c1-48-oled-samsung-odyssey-neo-g9-review-monitor-tv\">like the LG C1 we reviewed last year</a>, can sometimes appear dim because of an Automatic Static Brightness Limiter, a mechanism that’s in place to prevent pixels from overheating. In our review, Sean Hollister said the OLED panel got so dim during his non-gaming use that it caused eyestrain. Well, after using this QD-OLED, I can safely say that this isn’t an issue here. But that doesn’t mean those auto-dimming techniques aren’t present; they just aren’t as noticeable.</p><p id=\"fIcnDo\">This monitor can display a small white window close to or directly on Alienware’s claim of 1,000 nits of peak brightness. But expanding it to cover more of the screen will cause it to dim, as is usually the case with OLEDs. This can be seen in both of the AW3423DW’s HDR modes: HDR Peak 1000 and DisplayHDR 400 True Black (though True Black generally looks less bright at default settings with less of a dramatic shift in tone as you scale content up and down in size). This dimming effect is especially noticeable if you have two windows side by side in dark mode and switch one over to white, which causes the entire panel to take a noticeable step down in brightness. </p><p id=\"kS63yz\">If you want to get in the weeds, <a href=\"https://www.youtube.com/watch?v=lNG2s0yPIDY&amp;t=354s\">check out the technical analysis from the YouTube channel <em>HDTVtest</em></a> that shows the AW3423DW dipping to a low of around 280 nits with white taking up the full screen. Compare that to <a href=\"https://www.rtings.com/tv/reviews/lg/c1-oled\">RTINGS’s review of the LG C1</a>, which measured 125 nits of peak brightness with a similar test. The QD-OLED’s gains are minor but a step in the right direction — especially if you’re playing games that have a lot of snow or highlights.</p>  <figure class=\"e-image\">        <img alt=\"Alienware AW3423DW QD-OLED gaming monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FRsb_Ymh0lKRkBe8I-q5JA5XvTA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367357/bfarsace_220404_5111_0003.jpg\">      <figcaption><em>The AW3423DW has two HDMI 2.0 ports and one DisplayPort.</em></figcaption>  </figure><p id=\"T934jn\">One other interesting observation from <em>HDTVtest</em> is that you may notice better contrast and darker blacks with the AW3423DW (and perhaps other QD-OLEDs if they’re built the same way) in a dimly-lit room. The monitor’s screen coating omits a light-reflecting polarizer, and thus, deep blacks can appear gray if you’re using it in a well-lit room. I didn’t notice a huge difference in day-to-day usage at <em>The Verge’s</em> offices. Blacks still looked inky and deep in a well-lit room, but viewing the display in the dark makes everything look even better. </p><p id=\"mhWCz3\">You may be considering Alienware’s QD-OLED monitor alongside some other curved monitors. Some of the most popular models are Samsung’s 49-inch <a href=\"https://www.theverge.com/21590961/samsung-odyssey-g9-review-ultrawide-monitor-price-specs\">Odyssey G9</a> and the <a href=\"https://www.theverge.com/2021/12/11/22815110/lg-c1-48-oled-samsung-odyssey-neo-g9-review-monitor-tv\">newer Odyssey Neo G9</a> curved gaming monitors. The AW3423DW is a clear winner for a few reasons but none more convincing than its price, which is just a couple hundred dollars more than the $1,000 Odyssey G9. </p><p id=\"mDcPrj\">The Odyssey Neo G9, for all of its improvements including impressively bright Mini LED backlighting, costs $2,000. It’d be a good alternative for people who want way more screen real estate (along with an eye-searing 2,000 nits of peak brightness) if not for a few show-stopping issues that we encountered during our reviews.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IilIcsSqa_Nz5ENHHkuVvC4cLQU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367362/bfarsace_220404_5111_0008.jpg\">      <figcaption><em>The design of the monitor has Alienware’s usual futuristic aesthetic, but it’s subdued enough to blend in at the office.</em></figcaption>  </figure></div><p id=\"0kByz5\">If you’re a gamer, the 32:9 aspect ratio that Samsung used on both the Odyssey G9 and Odyssey Neo G9 could be an immersion-breaker. Even in games that have ultrawide compatibility, we noticed that there was usually stretching around the edges of these monitors. That’s less of a knock against Samsung and more on the limited use cases of that ultra-ultrawide screen size. Then, there are the bigger issues. In our <a href=\"https://www.theverge.com/2021/12/11/22815110/lg-c1-48-oled-samsung-odyssey-neo-g9-review-monitor-tv\">Neo G9 review</a>, we noticed off-colored shadows in games as well as instances where the monitor displays horizontal lines when the colors darken. That may not happen with every unit, but it’s not an issue that you’ll have with the AW3423DW.</p><p id=\"O0elJw\">OLEDs can be a little more sensitive to extended use versus LEDs, and there are a couple of features built into this monitor to safeguard the panel and extend its lifespan. One is a pixel-shifting technique that happens automatically, triggering every few minutes. It shifts all of the screen’s pixels in a direction, yet it’s hardly noticeable. Then, there’s “pixel refresh,” a process that takes about seven minutes to complete. The monitor will ask you to perform it if it’s been on for four hours straight. If you decline, it’ll perform the feature automatically the next time the monitor enters standby mode should your use exceed four hours. Lastly, the “panel refresh” feature can be manually triggered (it will happen automatically after 1,500 hours of use) to completely refresh every pixel in the QD-OLED. It supposedly takes an hour to run through that process.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Alienware QD-OLED\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/59LyPbj6XcaLWyi2KQbo5jZBH6E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367355/bfarsace_220404_5111_0001.jpg\">      <figcaption><em>Another shot that shows how well this QD-OLED panel still looks when viewed from its edges.</em></figcaption>  </figure></div><p id=\"bzMqMS\">Despite being a first-generation product, the AW3423DW doesn’t feel like one. $1,300 might sound like a lot to pay for an ultrawide QHD monitor — and it is a lot of money — but Alienware got the price right here. What’s more, it costs less and looks better than many 4K monitors that I’ve seen. And it lives up to Samsung Display’s promises by delivering a brighter picture than we’ve seen before in OLED TVs. </p><p id=\"d6ZkfN\">Yet, it may not be the perfect monitor for everyone. Its on-screen display and joystick controls are far less intuitive to use than they should be, and it may take some time to tweak the display’s settings to suit your non-gaming needs. It’s also lacking in high-end HDMI 2.1 ports for faster refresh rates over HDMI, and its 21:9 aspect ratio means that modern consoles won’t fill the whole screen. Admittedly, those are all minor gripes if you know what you’re getting into.</p><p class=\"c-end-para\" id=\"ARUsfB\">For being the first (and so far the only) QD-OLED monitor on the market, Alienware’s AW3423DW should satisfy a lot of people. If only it were easier to purchase right now.</p><p id=\"KH2y9F\"></p><p id=\"J3MRjh\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EK152E-2yyJzz03ffDX6791s7RQ=/0x208:2040x1276/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23298670/akrales_220308_5069_0036.jpg",
  "description": "QD-OLED takes gaming to brighter levels",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}