{
  "title": "All hail Elden Ring’s ever-growing map",
  "url": "https://www.theverge.com/2022/4/4/23009950/elden-ring-giant-map-game-design-from-software",
  "date": "2022-04-04T17:58:31.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"A portion of Elden Ring’s map\" src=\"https://cdn.vox-cdn.com/thumbor/uND6L4nUmSb71Ox_-Yt5LEBANxM=/145x0:2221x1384/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70708840/Screen_Shot_2022_04_04_at_1.17.59_PM.0.png\" />    </figure>  <p id=\"PppoL8\">One of <em>Elden Ring’s</em> most polarizing features is its willingness to withhold information. While it’s less arcane than earlier FromSoftware titles like <em>Dark Souls</em>, the game constantly hands you items, quests, and mechanics <a href=\"https://www.theverge.com/2022/2/28/22954823/elden-ring-open-world-guide\">with very little explanation</a>. But after 130 hours and counting in the Lands Between, I’m in love with how well it sometimes deploys that obscurity. And there’s no better example than <em>Elden Ring’s</em> map, which has transcended a simple open-world convention to become one of my very favorite pieces of the game.</p><p id=\"PORI87\">If you’re still in the early areas of <em>Elden Ring</em>, you might want to skip this post because I’m going to talk about a mechanic that relies on mystery. But if you’ve played a bit of the game, you might know what I’m talking about. <em>Elden Ring’s </em>map offers a constant give-and-take of showing players new spaces to explore, then pulling back a curtain to more places that they didn’t even realize could <em>exist. </em>It withholds information only to reveal it in a way that’s delightful, satisfying, and entirely in keeping with the world’s vast scope. It’s not just an interface element — it’s a meta-game in its own right.</p><div class=\"c-float-right\"><aside id=\"7EesR4\"><q>If I knew how small that starting area really was, my Tarnished might have curled up and cried</q></aside></div><p id=\"WcUXza\"><em>Elden Ring’s</em> opening map (arguably the first meaningfully included in a FromSoftware title) features the basic elements you can find in many games. There’s a square with exposed terrain around where the player starts, icons marking fast-travel points and special locations like tombs, and fog in the places you haven’t yet explored. By default, it includes very little detail, but you can find map fragments that overlay it with stylized depictions of forests, buildings, and caverns that you might want to explore.</p><p id=\"386Ief\">Most importantly, the map looks large by many games’ standards, but not <em>that </em>large. It’s basically a continent with some blank space around the sides, inviting you to fill in discrete gaps by running around and hunting down those fragments. It helps that <em>Elden Ring’s</em> opening area is a conventional-looking fantasy playground, so it’s easy to feel like you’ve got a handle on what’s happening, especially with so many things you clearly <em>don’t</em> know as a guidepost.</p><p id=\"PJqxAu\">Then, in a very early area, you can encounter an item that teleports you to a new location. After outrunning some enemies that are likely much stronger than your low-level character, you open your map and try to get your bearings. Suddenly you realize you’ve ended up in a place that wasn’t even in the fogged-out edges of your guide. The map has gotten bigger.</p><div class=\"c-float-left\"><aside id=\"ujfbbT\"><q>The game withholds information only to reveal it in an incredibly satisfying way</q></aside></div><p id=\"fymHMj\"><em>Elden Ring</em> is like a puzzle where you keep finding new corner pieces. Exploration stretches the boundaries of the map until it fills your screen and then forces you to start scrolling. Collecting fragments fills in strips of land that expose gaps with whole new stretches of fogged-out areas, some of which aren’t accessible until long after you first see them. There’s a second map literally underneath the main map. (That’s not counting all the densely packed caves and other sub-areas marked as icons, whose twists and turns aren’t drawn at all.) I once spent a good half-hour failing to find a building clearly indicated at my location, forgot about it for several dozen more hours, then emerged from a boss dungeon to discover that the building was on a higher, previously unseen level. “Map got bigger!” I would call to my husband across the room.</p><p id=\"hWZtDk\">These constant revelations help pace an experience that might otherwise feel overwhelming while emphasizing its absurd, daunting largeness. The world isn’t just bigger than you may think — it’s designed to appear in constantly growing chunks where nearly every new region is bigger than the last until you can zoom out and see your starting area absolutely dwarfed by the latest megacontinent you’ve discovered. If I knew how tiny Limgrave and Caelid would turn out to be when I got started, my character would have <a href=\"https://kotaku.com/elden-ring-lightning-ram-ashes-of-war-where-to-get-from-1848685068\">curled up in a ball</a> and cried.</p><p id=\"E0etYL\">There’s reasonable criticism of <a href=\"https://gamerant.com/elden-ring-map-soulslike-interactive-potential-content-hidden/\"><em>Elden Ring’s</em> map key and enigmatic interface</a> in general, and FromSoftware has added some new elements since launch, like markings for merchants and other characters. But the map itself isn’t coyness or frustration for its own sake. It’s a joyful exercise in the power of unknown unknowns — although, at this point, seeing it get any bigger might just break me.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XsQHAnKny6HUVsHthBtEuJwi0D8=/0x73:2366x1312/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366675/Screen_Shot_2022_04_04_at_1.17.59_PM.png",
  "description": "A constant give-and-take of mystery and revelation",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}