{
  "title": "Alphabet’s Wing kicks off drone delivery service in Dallas on April 7th",
  "url": "https://www.theverge.com/2022/4/4/23006894/alphabet-wing-drone-delivery-dallas-kick-off",
  "date": "2022-04-04T12:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/aK3STrmqGAFg13YlzscZhP5U0Bc=/0x0:5568x3712/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70707055/Wing_2.0.jpg\" />    </figure>  <p id=\"lrnf39\">Wing, the drone delivery company operated by Google-parent Alphabet, will launch its first commercial service in the US on April 7th. The company’s quadcopters will be available to “tens of thousands” of homes in the suburban towns of Frisco and Little Elm, both of which are part of the Dallas-Fort Worth metro area, the company said. </p><p id=\"dsAAJw\">Customers can order items from a limited number of stores that are partnering with Wing, including Walgreens, Blue Bell Creameries, Easyvet, and Texas Health. Wing’s operational model involves parking small shipping containers next to participating stores to act as tiny hangers from which Wing’s drones will be deployed. After receiving orders online, employees at each partnering store take the items outside and load them into a cardboard package attached to the drone. Wing’s operations team then pilots the drone remotely to the customer’s homes. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jz01ugiTdwIoYRd11hdLmOsV06o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23361229/Wing_3.png\">  </figure><p id=\"CuhMMN\">Drone deliveries were supposed to revolutionize the movement of goods around cities, with companies like Amazon and Uber promising to set up large-scale operations in the near future. Instead, the technology has mainly focused on small-scale experiments, delivering vaccines and blood to remote locations. In the US, drone delivery has generally been limited to smaller towns, where land usage is less crowded and complex. And some companies have faltered in their progress, with <a href=\"https://www.theverge.com/2021/8/3/22607267/amazon-drone-delivery-program-uk-operations-failure-oversell\">Amazon’s program in the UK shedding dozens of employees</a>.</p><div class=\"c-float-right\"><aside id=\"GgFSA5\"><q>Wing has been able to rack up a series of minor successes, recently completing its 200,000th delivery while operating in three countries</q></aside></div><p id=\"61i6jq\">Wing has been able to rack up a series of minor successes, recently completing its <a href=\"https://www.theverge.com/2021/8/25/22640833/drone-delivery-google-alphabet-wing-milestone\">200,000th delivery</a> while operating in three countries: the US, Finland, and Australia. Its biggest success has been in Logan, Australia: a suburb of Brisbane where more than 50,000 of its total deliveries have been carried out.</p><p id=\"ZVVWcz\">Wing has been <a href=\"https://www.theverge.com/2021/10/20/22736278/alphabet-wing-drone-delivery-dallas-walgreens\">testing its service in the Dallas suburbs since last year</a>, and the decision to launch a commercial service is a sign of the company’s growing confidence in the technology. “This is an important milestone for Wing and drone delivery in the US,” Wing CEO Adam Woodworth said in a blog post. </p><p id=\"kDk1AI\">Much like sister company Waymo, Wing is focused on incremental improvements before pulling the lever on wide-scale deployment. The company has also set up a facility at Frisco Station, a mixed-use development and local tourism destination north of Dallas. That facility has delivery capabilities and, according to Wing, “will initially be dedicated to exploring new use cases, community demonstrations, and public tours.”</p><p id=\"B5TmGl\">Wing’s drones can operate as both fixed-wing aircraft and hovering copters. Unlike Amazon’s delivery drones, the aircraft also don’t need to land to drop off goods. Wing’s craft flies to their location, descends to a height of 23 feet (seven meters), and then lowers their packages on a tether, automatically releasing them onto the ground.</p><p id=\"bkFz63\"></p><p id=\"w4MpiE\"></p><p id=\"laNJCT\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KJDD0ZY2ZVO0F0sJnEf8Lze7MAw=/0x399:5568x3314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23361147/Wing_2.jpg",
  "description": "Dallas can now order Band-Aids to be delivered by drone.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}