{
  "title": "Amazon union workers won in New York — can they win across the country?",
  "url": "https://www.theverge.com/2022/4/4/23006562/amazon-labor-union-jfk8-win-contract-negotiations-expansion",
  "date": "2022-04-04T21:21:34.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Union fist breaking out of an Amazon box, surrounded by other amazon boxes.\" src=\"https://cdn.vox-cdn.com/thumbor/4fboSIX2ntbN0-K47fsyIqPPQRQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70709874/acastro_220404_5123_0001.0.jpg\" />        <figcaption>What comes after a historic win? | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"QCBcWt\">The Amazon Labor Union (ALU) scored a historic victory on April 1st when it <a href=\"https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win\">became the first-ever union to successfully organize Amazon employees</a>. Christian Smalls, a fired worker motivated by what he viewed as poor treatment, rallied his co-workers through the process and, in January 2022, got <a href=\"https://www.theverge.com/2022/1/26/22903584/amazon-jfk8-warehouse-union-election-labor-nlrb\">just enough votes to qualify for a formal election</a>. On Friday, the workers of Amazon’s JFK8 warehouse <a href=\"https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win\">voted to unionize</a>, 2,654 to 2,131.</p><p id=\"lBiCRS\">It was a hard-won victory, coming after years of work, and labor activists are already hoping to apply the same tactics to the hundreds of thousands of Amazon warehouse workers across the rest of the country. After the RWDSU’s stumble in the Bessemer election last year, the newly formed Amazon Labor Union is pointing to a different path forward — and forcing Amazon to take a hard second look at working conditions in many of its fulfillment centers.</p><p id=\"I3VEZp\">The ALU developed its own playbook early on. Instead of knocking on co-workers’ doors, the organizers <a href=\"https://www.vice.com/en/article/bvnkxa/the-amazon-labor-union-took-on-the-worlds-richest-manand-won\">camped out near the warehouse</a>, handing out literature, answering questions, and sharing news stories about how much Amazon was spending on things like corporate salaries and labor consultants. They shifted course when they had to, putting the focus on just <a href=\"https://www.theverge.com/2022/3/2/22959234/amazon-union-staten-island-ldj5-election-drive-nlrb-approval-go-ahead\">two NYC warehouses</a>, JFK8 and LDJ5, and used <a href=\"https://www.tiktok.com/@amazonlaborunion/video/7068490211503770926?_t=8QrUK0eDpgU&amp;source=h5_m&amp;_r=1\">social media videos</a> to raise awareness. They even held phonebanks, <a href=\"https://www.thecity.nyc/staten-island/2022/3/24/22995196/amazon-workers-staten-island-union-vote\">calling every one of the workers</a> eligible to vote in the election.</p><p id=\"LkKdf3\">More importantly, organizers say Amazon underestimated their resolve. In an interview with <em>The Verge</em>, Gerald Bryson, the ALU’s sergeant-at-arms, said that the company had a dismissive attitude towards him and his fellow organizers. He made repeated references to how Amazon representatives called them inarticulate “thugs,” behavior that was <a href=\"https://www.theverge.com/2022/1/27/22905235/nlrb-amazon-broke-labor-laws-jfk8-warehouse-workers\">cited in a lawsuit from the National Labor Relations Board (NLRB</a>).</p><aside id=\"oxtGTI\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"NLRB alleges Amazon broke the law with anti-labor action in New York\",\"url\":\"https://www.theverge.com/2022/1/27/22905235/nlrb-amazon-broke-labor-laws-jfk8-warehouse-workers\"}]}'></div></aside><p id=\"JSPIPI\">Another key difference between the successful drive in Staten Island and the thus far unsuccessful union drive in Bessemer, Alabama: ALU was independent, and the Bessemer organizing efforts were done in coordination with the Retail, Wholesale and Department Store Union (RWDSU), an 85-year-old labor union that already represents thousands of workers. The Amazon Labor Union is an independent organization, not affiliated with any established union. </p><p id=\"hP8Jvp\">“I wouldn’t say they won <em>because</em> they were an independent union,” said Rebecca Givan, associate professor of labor studies and employment relations at Rutgers University. “But they certainly proved that an indie union with little infrastructure and resources could do this.” </p><p id=\"LUY6y7\">Bryson is convinced that the ALU will be able to keep making progress. Part of his confidence comes from the trust he puts in Chris Smalls. “For everything that they said about Chris, he’s got a heart of gold. We all sit down, and we listen to each other — no decision that you hear coming out of his mouth is just Chris.”</p><div><aside id=\"4nUncQ\"><q>Unionizing in other states is going to take “a lot of lawyer time”</q></aside></div><p id=\"hUytn4\">Bryson told <em>The Verge</em> that the ALU founders were interested in expanding, but it will be hard to recreate the same approach that worked at JFK8. “It’s kind of tricky,” he said about trying to work with facilities in different states. “The labor laws that we’re using here might not apply so much somewhere else.”</p><p id=\"eNFV8l\">Unlike Alabama, New York has a strong union tradition that many of the workers were likely familiar with, said James Williams, Jr., general president of the International Union of Painters and Allied Trades (IUPAT). “When you break that [Amazon] armor, you’re going to break it in places where there’s union density,” Williams, Jr. said. “If your neighbor is a teamster, or a member of the food and commercial workers union, and you hear them talking about their pensions, their benefits, their livelihood, you already have a sense of what unions can do and how they benefit workers.”</p><p id=\"aBSUPa\">Givan agreed and said workers who know someone in a union can challenge a company’s anti-union rhetoric. “They can say, ‘Hold on a sec, we had great health insurance when I was a kid because of my mom’s union job,’” she said, while workers who have little experience with a union don’t have the same context. </p><p id=\"1apbY4\">But even the ALU organizers found themselves trying to dispel misconceptions about unions, Bryson said. He asked one co-worker who was dead-set against unionizing what they knew about unions. The response? “I know they killed Jimmy Hoffa,” Bryson was told. “That wasn’t the answer I was expecting,” Bryson laughed.</p><p id=\"9jCt5H\">In addition to three other Staten Island <a href=\"https://twitter.com/jordanzakarin/status/1509971341415436289\">warehouses, ALU organizers</a> say they have Amazon workers in more than a dozen states who want to organize as well. There are vast swaths of the country where unions are not well-established, but Amazon has warehouses nearly everywhere there are potential customers, so the ALU may have to tweak its tactics to reach those workers. </p><div class=\"c-float-right\"><aside id=\"CwBWY2\"><q>“That’s the key to organizing: getting the employer to the table.”</q></aside></div><p id=\"1pWOSP\">Looking to the future of union organizing in general, not just at Amazon, Givan said we’re likely to see more smaller, nimble organizations try to emulate the ALU playbook, even if its final chapters have yet to be written. Another thing we’re seeing, she says, is people who are already politically aligned and want to organize getting jobs at places like Amazon or Starbucks specifically to help start union campaigns. </p><p id=\"FDk2jL\">She also noted that younger organizers have a different set of tools at their disposal than their predecessors. While it’s still better to have one-on-one communication between co-workers, she said workers publicly on social media that they’re pro-union shows they’re not intimidated, a powerful message to send.</p><p id=\"bbOAbt\">The fight is just beginning for the ALU; it now has to begin negotiations with Amazon, a company well-known for its aversion to unions and its willingness to <a href=\"https://www.theverge.com/2021/11/29/22565851/amazon-bessemer-union-vote-nlrb-appeal-overturned-second-election\">use union-busting tactics</a>. The ALU will have to bring the same determination to the next — and arguably harder — part of the process: getting Amazon to sign a contract. </p><p id=\"v0zZy1\">“They have to organize around that, and they have to be willing to strike,” Williams said. Now isn’t the time to relax, he added; the ALU organizers have to fight just as hard for a contract as they did for an election. “That’s the key to organizing: getting the employer to the table.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LTTlYxQnR74NBEL4alaBr-2UrVM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23367262/acastro_220404_5123_0001.jpg",
  "description": "The fight is far from over.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}