{
  "title": "Amazon hardware exec takes another swipe at Zuckerberg’s metaverse fantasy",
  "url": "https://www.theverge.com/2022/5/20/23131767/amazon-hardware-meta-metaverse-virtual-reality-vs-real-world",
  "date": "2022-05-20T08:10:27.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KR5-1_AYN-upMT4k1thC8Z54jlY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70890945/acastro_211101_1777_meta_0003.0.jpg\" />        <figcaption>“We wanna enhance the here and now.” | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"3D1oTL\">Meta and its CEO Mark Zuckerberg can’t catch a break — everyone just keeps saying that they don't want to live in the metaverse. This week, it’s Amazon’s head of devices David Limp, who said that he doesn’t want to live in a virtual world 24 / 7, or even a few hours a day.</p><p id=\"R7ahaA\">Limp expressed similar views when interviewed <a href=\"https://www.ft.com/content/3d5bdfa8-d85e-41e8-b2d5-fadf8948cbba\">last month by the <em>Financial Times</em></a>, where he spent most of his time espousing his vision of <a href=\"https://www.theverge.com/22696187/amazon-alexa-ambient-disappearing-computer-limp-interview\">ambient computing</a> — the idea that the computer is everywhere — as he’s been keen to do over the last year and change. </p><p id=\"GkxCF5\">While speaking at <em>The Wall Street Journal</em>’s Future of Everything Festival, Limp <a href=\"https://www.wsj.com/articles/amazon-head-of-devices-company-focused-on-real-world-tech-not-metaverse-11652980028\">was asked what he was thinking about the metaverse</a>. He said that while he does believe that there’ll be “some form of place-shifting” in the future, he’s focused on devices that “enhance the here and now.” He said that even with current tech like phones and wireless earbuds, it can be hard to communicate with his kids, even when they’re in the same house. “I want to try to work on technologies that bring people’s heads up, get them to enjoy the real world about them, make the family a more communal experience.”</p><div class=\"c-float-right\"><aside id=\"rPGJ9b\"><q>What even is a metaverse?</q></aside></div><p id=\"weCZKA\">He also said that the term “metaverse” was almost impossible to pin down: “if I asked these few hundred people what they thought the metaverse was, we’d get 205 different answers. We don’t have a common definition, it means a lot of different things to a lot of different people.” When it comes to Meta, Mark Zuckerberg has <a href=\"https://www.theverge.com/22588022/mark-zuckerberg-facebook-ceo-metaverse-interview\">tried to describe</a> what he means by “metaverse,” but at this point he’s pretty long on vision and short on concrete details — though he does say that <a href=\"https://www.theverge.com/23022611/meta-facebook-nazare-ar-glasses-roadmap-2024\">AR glasses</a> will play a big role.</p><p id=\"9SRy6m\">For what it’s worth, <a href=\"https://www.theverge.com/22701104/metaverse-explained-fortnite-roblox-facebook-horizon\">here’s our definition</a> of the metaverse.</p><p id=\"mz90sI\">Limp addressed AR glasses, saying that they’re better than VR because you can at least see the real world. However, he said, “I wouldn’t like if it completely embeds everybody and distracts them from the here and now.”</p><p id=\"EgpoXb\">Limp isn't alone in critiquing Meta’s proposed future. Last month, Snap’s CEO said something very similar about how there’s no one definition of “metaverse,” and <a href=\"https://www.theverge.com/2022/4/28/23046594/snap-evan-spiegel-metaverse-pixy-ar-interview\">said that the company’s “big bet is on the real world”</a> where people can spend time together. Former head of Nintendo of America Reggie Fils-Aimé said that “Facebook itself is not an innovative company” and predicted that people wouldn’t want to spend all of their entertainment time in virtual reality. “I look at the vision that’s been to date articulated, and I’m not a believer,” he said.</p><p id=\"7DgBnI\">Of course, just because a lot of people in tech make fun of something doesn’t mean that it’s absolutely going to fail — after Apple announced the first iPhone, then-CEO of Microsoft Steve Ballmer <a href=\"https://www.macrumors.com/2016/11/07/former-microsoft-ceo-steve-ballmer-wrong-iphone/\">ridiculed its lack of keyboard and price tag</a>. However, at least in my opinion, there’s a difference between saying that a product isn’t great for one reason or another and saying that it’s fundamentally incompatible with the way people want to live their lives. At this point, it’s hard to predict who will end up being right. But in my heart, and I can’t believe I’m saying this, I want it to be the guy from Amazon.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7_DEKXgLohyHzTf_PYfUHXUlRqE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22977157/acastro_211101_1777_meta_0003.jpg",
  "description": "He’s far from the only one.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}