{
  "title": "Amazon is reportedly using Chinese suppliers with ties to forced labor",
  "url": "https://www.theverge.com/2022/3/7/22965654/amazon-suppliers-forced-labor-china-uyghurs",
  "date": "2022-03-07T21:35:02.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9MDsnb7UquCrogrknQv-MHonavs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70591004/acastro_181114_1777_amazon_hq2_0005.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"OH8x5t\">Amazon is allegedly employing suppliers in China with links to forced labor, according to a <a href=\"https://www.techtransparencyproject.org/articles/amazon-suppliers-tied-forced-labor-xinjiang\">report from the Tech Transparency Project</a> (TTP), a research group owned by the nonprofit watchdog organization Campaign for Accountability (via <a href=\"https://www.nbcnews.com/tech/tech-news/amazon-suppliers-linked-forced-labor-china-watchdog-group-says-rcna16452\">NBC News</a>). The report accuses Amazon of continuing to work with these suppliers, despite evidence of their association with Uyghur labor camps.</p><p id=\"2YfLMe\">China’s population of Uyghurs, the country’s Muslim ethnic minority, is largely concentrated in the Xinjiang region of China. Over several years, the group has been subject to a number of human rights abuses within the country, <a href=\"https://www.vox.com/future-perfect/22311356/china-uyghur-birthrate-sterilization-genocide\">including internment camps, constant surveillance, mass sterilization, and forced labor</a>. As the TTP notes, China uses what it calls “labor transfers” to transport Uyghurs from the Xinjiang region to factories throughout China, forcing them into labor programs the TTP says “are often coercive and connected to a network of mass internment and reeducation camps.”</p><div class=\"c-float-right\"><aside id=\"nJrbMZ\"><q>Five suppliers have been publicly denounced for being connected to the forced labor</q></aside></div><p id=\"akbIxK\">The TTP pinpoints five companies on <a href=\"https://web.archive.org/web/20211216135611/https:/sustainability.aboutamazon.com/people/supply-chain?workerCount=true&amp;engagementProgram=true&amp;productCategory=true\">Amazon’s supplier list</a> (available as a CSV file in the small print below the page’s supply chain map) that have been publicly denounced for being “directly or indirectly” connected to the forced labor of China’s Uyghur population in the Xinjiang region. Amazon’s suppliers are responsible for making Amazon-branded products, such as the Echo, Fire TV, Kindle, the wide range of affordable products sold as part of its Amazon Basics line, and more. </p><p id=\"WSUBlp\">The TTP found that three Amazon suppliers — Luxshare Precision Industry, AcBel Polytech, and Lens Technology — have reportedly used forced labor themselves. Two other companies, GoerTek and Hefei BOE Optoelectronics, are indirectly involved, and allegedly utilize suppliers that have been accused of using forced labor. A number of previous reports have implicated these companies in the past — for example, <a href=\"https://www.theverge.com/2021/5/10/22428899/apple-suppliers-china-uyghur-forced-labor-report\">Luxshare</a> and <a href=\"https://www.theverge.com/2020/12/29/22204920/lens-technology-uighur-forced-labor-xinjiang-amazon-apple-tesla\">Lens Technology</a> were both linked to forced labor in bombshell reports from <em>The Information</em> and <em>The Washington Post</em>, although those reports pertained to Apple’s questionable history of suppliers.</p><p id=\"ab6a73\">As the TTP points out, Amazon’s supply chain standards (<a href=\"https://web.archive.org/web/20211216142939/https:/sustainability.aboutamazon.com/amazon_supply_chain_standards_english.pdf\">PDF</a>) specifically rule out forced labor. “Amazon suppliers must not use forced labor — slave, prison, indentured, bonded, or otherwise,” its standards read. “All work must be voluntary, and workers must be free to leave work and terminate their employment or other work status with reasonable notice.”</p><p id=\"4oEyEg\">In addition to alleging Amazon’s use of suppliers connected to forced labor, the TTP also found a number of accounts selling Xinjiang-sourced cotton, the sale of which has been <a href=\"https://www.cbp.gov/newsroom/national-media-release/cbp-issues-region-wide-withhold-release-order-products-made-slave\">banned by the US government last year</a>. A number of countries have also <a href=\"https://www.steptoeinternationalcomplianceblog.com/2021/03/eu-uk-us-and-canada-announce-coordinated-xinjiang-sanctions/\">imposed sanctions on Xinjiang</a>, with <a href=\"https://www.nbcnews.com/politics/congress/biden-signs-bill-banning-goods-china-s-xinjiang-over-abuse-n1286561\">the US moving ban imports from Xinjiang</a> altogether in December.</p><p id=\"UY2Bq5\">Apple and Amazon aren’t the only US-based companies with ties to Xinjiang and forced labor, either. Earlier this year, <a href=\"https://www.theverge.com/2022/1/3/22864951/tesla-china-xinjiang-uyghur-ev-showroom\">Tesla faced criticism for opening a showroom in the Xinjiang region</a> and was also mentioned as an alleged customer of the aforementioned Lens Technology company in the TTP report from December 2020.</p><p id=\"5WbJM2\">“Amazon complies with the laws and regulations in all jurisdictions in which it operates, and expects suppliers to adhere to our Supply Chain Standards,” Amazon spokesperson Erika Reynoso said in a statement to <em>The Verge</em>. “We take allegations of human rights abuses seriously, including those related to the use or export of forced labor. Whenever we find or receive proof of forced labor, we take action.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hExLPjc5LVoWsyEpRvtGsNXwNGs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443462/acastro_181114_1777_amazon_hq2_0005.jpg",
  "description": "Some Amazon-branded products may be made with forced labor.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}