{
  "title": "Amazon’s Project Kuiper books up to 83 rockets to launch its internet-beaming satellites",
  "url": "https://www.theverge.com/2022/4/5/23010245/amazon-project-kuiper-megaconstellation-arianespace-ula-blue-origin",
  "date": "2022-04-05T11:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nyvSH04FPWJu1XRc69xcOZMN_7M=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70711310/maxresdefault.0.jpeg\" />        <figcaption><em>An artistic rendering of Blue Origin’s New Glenn rocket, currently under development</em> | Image: Blue Origin</figcaption>    </figure>  <p id=\"p2D1Uq\">Project Kuiper — Amazon’s planned internet-from-space initiative — announced today that it has booked dozens of new launches on three different rockets to get its future satellites into orbit. The satellites will fly on powerful rockets currently being developed by European launch provider Arianespace, US-based United Launch Alliance, and Blue Origin — Amazon founder Jeff Bezos’ space company.</p><p id=\"3LciCX\">The combined flights — up to 83 launches total — are set to take place over a five-year period and will allow Project Kuiper to launch the bulk of its planned constellation of 3,236 satellites. Amazon did not provide details on how much the launch contracts cost, but the company is investing billions of dollars across the three deals, according to James Watkins, a spokesperson for Project Kuiper. Amazon also claimed that the deal “is the largest commercial procurement of launch vehicles in history.”</p><div class=\"c-float-right\"><aside id=\"CX4PHw\"><q>Amazon says it’s “the largest commercial procurement of launch vehicles in history”</q></aside></div><p id=\"OtxPsb\">Project Kuiper needs quite a bit of rocketry in order to get its future megaconstellation into space. The Amazon subsidiary plans to create a massive array of satellites in low Earth orbit, designed to provide low-latency broadband internet service to all parts of the globe. To tap into the system, users must purchase one of Project Kuiper’s user antennas, which the company previewed in late 2020. The terminals scan the sky, looking for satellites that are overhead. Those satellites relay signals from ground stations — facilities already plugged into existing fiberoptic internet infrastructure — to and from the user antennas.</p><p id=\"gqV1z7\">The concept is fairly similar to SpaceX’s ever-growing Starlink program — a planned constellation of tens of thousands of satellites also designed to provide broadband internet from low Earth orbit. However, Starlink is already quite a few years ahead of Project Kuiper. So far, SpaceX has launched more than 2,000 satellites into orbit and has begun limited service around the world, <a href=\"https://spacenews.com/starlink-reaches-250000-subscribers-as-it-targets-aviation-and-other-markets/\">with 250,000 subscribers tapped into the system so far</a>, according to SpaceX. Project Kuiper has yet to launch any of its satellites.</p><p id=\"CPlx8c\">However, the company is hoping to change that this year. A year ago, Amazon announced that it had purchased nine launches of the United Launch Alliance’s workhorse Atlas V rocket to send<strong> </strong>batches of satellites into orbit. And in November, Project Kuiper revealed its <a href=\"https://www.theverge.com/2021/11/1/22752469/amazon-project-kuiper-prototype-satellite-fcc-2022-abl-space-systems\">plans to launch its first two prototype satellites</a> on an experimental new rocket called the RS1 being developed by startup ABL Space Systems. The company expects those first prototype flights to occur in the fourth quarter of 2022, with one prototype satellite flying on each RS1 rocket. However, that depends on the RS1 being ready in time. ABL Space Systems suffered a testing mishap during the development of the rocket in January, which set the company’s timeline back by three months, <a href=\"https://spacenews.com/abl-space-systems-test-accident-to-delay-first-launch-by-three-months/\">according to <em>Space News</em></a>.</p><div class=\"c-float-left\"><aside id=\"gMSJv5\"><q>The agreement covers launches on three rockets still in development</q></aside></div><p id=\"r97KyA\">Nothing has changed regarding Project Kuiper’s agreement with ABL Space Systems, according to Watkins. Once those first prototype launches take place, then Project Kuiper has the option to fly on either the Atlas V or on the three rockets in its new deal. The agreement covers launches on three rockets still in development: Arianespace’s Ariane 6, ULA’s Vulcan rocket, and Blue Origin’s New Glenn. Project Kuiper has booked 38 launches with ULA, 18 with Arianespace, and at least 12 with Blue Origin (with the option to buy another 15 from the latter).</p><p id=\"po4kp6\">None of the three rockets have yet to launch, and all three have been delayed years beyond their target debuts. As of now, both <a href=\"https://www.esa.int/Enabling_Support/Space_Transportation/Launch_vehicles/Ariane_6\">Arianespace</a> and ULA expect to launch their rockets in late 2022, while Blue Origin does not expect to fly New Glenn <a href=\"https://spacenews.com/vulcan-centaur-on-schedule-for-first-launch-in-2022-as-new-glenn-slips/\">until 2023 at the earliest</a>. </p><p id=\"w85FDc\">Among the five rockets Amazon has tapped for launching its satellites, the Atlas V is the only rocket currently operational. When Arianespace, ULA, and Blue Origin’s rockets begin flying, though, they should have much higher carrying capacities than the Atlas V, allowing Amazon to fit more satellites onto one rocket at a time. Project Kuiper isn’t disclosing how many of its rockets can fit on each vehicle yet, however. </p><p id=\"pL5zEn\">First, Amazon needs to launch its prototypes with ABL. After that, the company will tweak the design of its final satellites before launching them in batches. Amazon won’t say which order of rockets it will use, but now the company has potentially more than 90 different launches to choose from.</p><p id=\"QldlKc\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Qkf_Dq_61ayrVF9SMzIXI8-7250=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23367408/maxresdefault.jpeg",
  "description": "Fellow Jeff Bezos company Blue Origin is part of the deal.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}