{
  "title": "Amazon says vaccinated warehouse workers can now work unmasked",
  "url": "https://www.theverge.com/2022/2/11/22929717/amazon-covid-19-mask-vaccination-warehouse-policies-employees",
  "date": "2022-02-11T23:19:12.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Z_vv4A8ILckdm_aCOJHdKl9phII=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70500308/acastro_180329_1777_amazon_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Khxzzc\">Amazon warehouse employees who have been vaccinated against COVID-19 no longer need to wear face masks at work,<em> </em><a href=\"https://www.wsj.com/articles/amazon-is-easing-mask-mandates-for-its-warehouse-staff-11644530431\"><em>The Wall Street Journal</em> </a>reported. The company is rolling back a mask <a href=\"https://www.theverge.com/2021/12/22/22850036/amazon-mask-mandate-warehouse-employees-omicron-covid-19\">requirement it last put back into effect</a> during the omicron surge in December. Last year, the mask requirement was lifted between May and August and again during much of November and December until the spread of the omicron variant spurred a change.</p><div class=\"c-float-right\"><aside id=\"x69SSG\"><q>Amazon is pushing incentives for vaccinations instead of mandates</q></aside></div><p id=\"An8RtW\">The company also updated its rules for paid time off. Warehouse employees who have received both doses of the coronavirus vaccine by March 18th are eligible for COVID-19 related paid leave if they contract the virus, while unvaccinated employees will lose their COVID-19 related paid leave. In January, Amazon shortened the required quarantine period for infected workers to five days instead of seven, in keeping with updated recommendations from the Centers for Disease Control and Prevention (CDC).</p><p id=\"wlokT0\">Amazon isn’t the only tech company to adjust and readjust its workplace rules during the pandemic. Meta <a href=\"https://www.theverge.com/2022/1/10/22877332/meta-facebook-require-employees-covid-19-booster-vaccine-shot-return-office-reopening\">said in January</a> that it would require the booster vaccine for employees when they return to the office on March 28th. The policy updates the <a href=\"https://www.theverge.com/2021/7/28/22598818/facebook-vaccine-requirement-us-office-employees\">previous guideline from July</a> requiring Meta employees to be vaccinated. </p><p id=\"CIAgYl\">Apple employees are <a href=\"https://www.theverge.com/2022/1/15/22885181/apple-vaccine-covid-19-booster-shot-employees\">required to show proof</a> that they have received the vaccine and a booster (within four weeks of eligibility) before entering their workplace. Those who can’t present proof of vaccination have to show a negative antigen test before entering the workplace. Google also <a href=\"https://www.theverge.com/2022/1/14/22884539/google-require-negative-molecular-test-covid-19-offices\">requires anyone wanting to work in-office regularly</a> to get weekly COVID-19 tests and has asked employees to disclose their vaccination status and wear surgical-grade masks inside. </p><p id=\"1HEC76\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6rg1qBBMioryZf_Hb5wJn2lJ7k8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10587655/acastro_180329_1777_amazon_0002.jpg",
  "description": "Amazon is adjusting its COVID-19 policies again",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}