{
  "title": "Amazon antitrust lawsuit filed by DC attorney general thrown out in court",
  "url": "https://www.theverge.com/2022/3/19/22986307/dc-attorney-general-antitrust-lawsuit-amazon-tossed-out-court",
  "date": "2022-03-19T15:55:20.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/O4LijzlrRzLIdsvudfnM4b8ps2g=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70645881/acastro_181114_1777_amazon_hq2_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"lM6ZKr\">An antitrust lawsuit filed against Amazon by District of Columbia Attorney General Karl Racine was thrown out in court on Friday, according to a report by <a href=\"https://www.nytimes.com/2022/03/18/technology/amazon-dc-antitrust-suit.html\"><em>The New York Times</em></a>. </p><p id=\"pua1Rx\">DC Superior Court Judge Hiram Puig-Lugo granted Amazon’s motion to dismiss the lawsuit, which accuses the e-commerce giant of anticompetitive behavior by preventing third-party sellers from offering lower prices for their products on other platforms, including their own websites. Court records viewed by the <em>NYT</em> didn’t indicate why Judge Puig-Lugo decided to dismiss the complaint.</p><div class=\"c-float-right\"><aside id=\"O3pkxD\"><q>“We believe that the Superior Court got this wrong”</q></aside></div><p id=\"ttivwZ\">“We believe that the Superior Court got this wrong, and its oral ruling did not seem to consider the detailed allegations in the complaint, the full scope of the anticompetitive agreements, the extensive briefing, and a recent decision of a federal court to allow a nearly identical lawsuit to move forward,” Melissa Geller, a spokesperson for the Office of the Attorney General said in a statement to <em>The Verge</em>. </p><p id=\"g8JADZ\">The “nearly identical” lawsuit Geller points to is a class action complaint that goes after Amazon for similar reasons, and claims the company pressures sellers into selling products for an equal or lower price than what they offer elsewhere. Earlier this week, Seattle District Judge Richard A. Jones <a href=\"https://www.protocol.com/bulletins/amazon-pricing-antitrust\">denied a part of Amazon’s motion to dismiss the complaint</a>.</p><p id=\"IyovoO\"><a href=\"https://www.theverge.com/2021/5/25/22453125/dc-attorney-general-amazon-antitrust-lawsuit-favored-nation\">Racine’s lawsuit, which was first filed in May 2021</a>, cruxes on the same argument; it alleges Amazon’s restrictive policies harm consumers by forcing sellers to raise their prices on Amazon and other online platforms, as sellers must account for Amazon’s fees when pricing their products. In 2019, <a href=\"https://www.theverge.com/2019/3/11/18260700/amazon-anti-competitive-pricing-agreements-3rd-party-sellers-end\">Amazon quietly retracted a clause</a> that requires sellers to offer products at the cheapest prices on its Marketplace, however, both lawsuits claim these same restrictions now apply to sellers under <a href=\"https://sellercentral.amazon.com/gp/help/external/G5TUVJKZHUVMN77V\">Amazon’s Fair Pricing Policy</a>.</p><p id=\"g5Co3b\">“We are considering our legal options and we’ll continue fighting to develop reasoned antitrust jurisprudence in our local courts and to hold Amazon accountable for using its concentrated power to unfairly tilt the playing field in its favor,” Geller says.</p><p id=\"4GEaxL\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ANbApt8_hpnu2eYB5cWXLfhac_g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443461/acastro_181114_1777_amazon_hq2_0002.jpg",
  "description": "DC Superior Court granted Amazon’s motion to dismiss the lawsuit.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}