{
  "title": "Amazon launches a Clubhouse competitor that turns everyone into a DJ",
  "url": "https://www.theverge.com/2022/3/8/22966229/amazon-amp-live-audio-radio-dj-clubhouse-competitor-ios-app",
  "date": "2022-03-08T14:00:00.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qC9aDaThm0ZsDO9CeHzwcPKkElQ=/191x0:2249x1372/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70593390/Amp_Screen1.0.jpg\" />        <figcaption>A screenshot of Amazon’s Amp showing a host with several guest callers. Everyone is muted while a song is playing. | Image: Amazon</figcaption>    </figure>  <p id=\"Ed9XkV\">Amazon is launching its <a href=\"https://www.theverge.com/2021/10/26/22744585/amazon-project-mic-launch-live-audio-app\">long-rumored</a> Clubhouse<em> </em>competitor today: <a href=\"https://www.onamp.com/\">a new app called Amp</a> that’s more about listening to music than sitting around and chatting.</p><p id=\"6rVCEQ\">Anyone who signs up will be able to host their own live show, complete with the ability to stream “tens of millions of licensed songs” from the big three record labels and “a long list” of indies, Amazon says. The goal is to turn any user into a radio DJ, able to program a playlist, talk to listeners, and chat with call-in guests.</p><p id=\"IO3F60\">Critically, hosts and listeners won’t need to subscribe to any particular service to tune in — anyone can listen in to full-length songs as long as they sign up for Amp, which is free.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hs6sD1f_eK7wQOBgTrTEZnHaYrU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23296478/Amp_Screen5_Crioyo.jpg\">      <cite>Image: Amazon</cite>      <figcaption>A screenshot of Amp displaying a show’s name and host.</figcaption>  </figure><p id=\"UbQ8Dd\">Amazon is positioning this as more of a radio-style service than a live chat service (there’s even a five-person cap on callers right now), which is probably for the best. Clubhouse and Twitter Spaces already have a big presence in the live audio space, and Facebook is taking a crack at it, too. But none of them have the music licensing agreements in place that Amazon does, and so those services have focused far more on conversations between hosts and guests. Amazon has a chance to let hosts do something very different here, giving everyone a shot at being something like a college radio DJ.</p><p id=\"3wsPpk\">To encourage people to tune in, Amazon is bringing on some celebrity hosts to kick things off. Nicki Minaj, Pusha T, Tinashe, Travis Barker, Lil Yachty, and Big Boi are among the artists who’ll be streaming on Amp. Amazon hasn’t said when they’ll be on just yet, though. There also won’t be monetization incentives for (non-celebrity) hosts at launch, though Amp spokesperson Rebecca Silverstein tells <em>The Verge </em>that Amazon hopes to add features that incentivize creators in the future.</p><p id=\"A8jR5P\">Amazon is also highlighting that it’s put some work into moderation ahead of launch, which is something apps don’t always publicize (or even, necessarily, think through). The service already has “comprehensive community guidelines” in place, and “a 24/7 moderation team” will be able to review reports and act on violations of its policies, the company says.</p><p id=\"QVYz9d\">The service is launching today, but it’s starting off with a fairly limited beta. It’s only available <a href=\"https://apps.apple.com/us/app/id1586403838\">on iOS</a> (Amazon wouldn’t comment on whether an Android or web version is in the works), and there’ll be a waitlist to gain access. It’s also only available in the US for now, which likely has to do with the complexities around music rights. Scaling this across the globe could be tricky.</p><p id=\"GxOqNd\">Amp looks a whole lot like Clubhouse at the end of the day. But the addition of free music could be a compelling draw — and it’s something expensive and tricky enough to negotiate that competitors likely won’t be able to recreate it overnight.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RVvZiJja_vR01qtPB17ISi8vqtc=/0x48:2440x1325/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23296415/Amp_Screen1.jpg",
  "description": "No Amazon subscription required.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}