{
  "title": "Amazon workers vote to unionize Staten Island warehouse",
  "url": "https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win",
  "date": "2022-04-01T16:06:06.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Staten Island Amazon Warehouse Begins Vote On Unionization\" src=\"https://cdn.vox-cdn.com/thumbor/fx3irApiR1XB3qUIIJnXln-6r-U=/0x0:5624x3749/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70698633/1387672919.0.jpg\" />        <figcaption>Workers at Amazon’s Staten Island fulfillment center voted whether to unionize | Photo by Michael M. Santiago/Getty Images</figcaption>    </figure>  <p id=\"nLsgxg\">With a few dozen votes left to count, workers at an Amazon warehouse in New York City appear to have enough votes to unionize. The final tally wasn’t yet available as of this writing, but if their lead holds, the JFK8 fulfillment center in Staten Island will join the Amazon Labor Union. The latest vote count had 2,350 yes and 1,812 no votes.</p><p id=\"xeF57p\">The National Labor Relations Board (NLRB) <a href=\"https://www.theverge.com/2022/1/26/22903584/amazon-jfk8-warehouse-union-election-labor-nlrb\">determined in January</a> that unionization efforts at the facility had “reached a sufficient showing of interest” to hold an election. The facility employs roughly 5,000 people.</p><p id=\"1KwhOf\">The ALU has been trying to unionize Amazon workers in New York for nearly two years. In October 2021, it <a href=\"https://www.theverge.com/2021/10/21/22738310/amazon-warehouse-workers-staten-island-union-election-nlrb\">filed with the NLRB to hold a union election</a> for two Amazon facilities on Staten Island but later withdrew the request because it didn’t have enough signatures. The union <a href=\"https://www.theverge.com/2021/12/22/22850880/amazon-workers-staten-island-refile-union-petition\">refiled in December</a>, focusing on just the JFK8 warehouse, which was the site of <a href=\"https://www.theverge.com/2020/3/30/21199942/amazon-warehouse-coronavirus-covid-new-york-protest-walkout\">several worker protests and walkouts</a> during the height of the coronavirus pandemic.</p><p id=\"oiY3vI\">Unlike the Bessemer unionization effort, the ALU is not affiliated with a national union or larger organization. It is the personal project of Christian Smalls, who was fired from the Staten Island site after organizing a walkout.</p><p id=\"mOoHAM\">The JFK8 election is the first to approve a union for Amazon warehouse workers in the US. Following <a href=\"https://www.theverge.com/2022/1/11/22878457/amazon-bessemer-alabama-union-election-redo-february-fourth\">another union drive at Amazon’s BHM1 facility</a> in Bessemer, Alabama, the NLRB ordered a re-do of an election held last year after it determined <a href=\"https://www.theverge.com/2021/8/2/22598004/nlrb-officer-new-election-amazon-bessemer-union-drive\">that Amazon had interfered with the first</a> election. On Thursday, the votes in <a href=\"https://www.theverge.com/2022/3/31/23004479/amazon-workers-vote-results-union-bessemer-warehouse-challenged-ballots-results\">Bessemer appeared to go against the union,</a> with 933 against and 875 in favor, but since the final result is so close, there will be a hearing on 416 challenged ballots. The hearing is expected to be scheduled in the next few weeks, and both the union and Amazon will have the opportunity to file any objections to the election over the coming month. </p><p id=\"AkLwLa\"><em><strong>Developing... </strong></em></p><p id=\"RY9wYn\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QzAv0_dnWif-MTfY_nlYJ-jBZpg=/0x403:5624x3348/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23357420/1387672919.jpg",
  "description": "The workers have protested warehouse conditions.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}