{
  "title": "Amazon ends its PTO policy for workers with COVID-19",
  "url": "https://www.theverge.com/2022/5/1/23051891/amazon-ends-pto-policy-workers-covid-19",
  "date": "2022-05-01T14:46:32.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zGzUjZgAGddqD7nEwHAUGrB9V4w=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70818983/acastro_181114_1777_amazon_hq2_0006.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"KlILIV\">Amazon will no longer grant up to seven days of paid time off (PTO) for workers sick with COVID-19, the company announced in an internal memo obtained by <em>The Verge</em> (via <a href=\"https://www.cnbc.com/2022/04/30/amazon-workers-wont-get-paid-for-covid-leave-anymore.html\">CNBC</a>). Starting Monday, Amazon will offer up to five days of unpaid, excused leave, with the option for workers to use the paid sick time they’ve accrued.</p><p id=\"dGzVXY\">Amazon initially offered 14 days of PTO at the start of the pandemic, but later <a href=\"https://www.theverge.com/2022/1/7/22872866/amazon-coronavirus-changed-pto-policy-cdc-guidance-update\">shaved one week off this policy</a> in line with the Center for Disease Control’s (CDC) updated guidance. The company now says workers with “confirmed” COVID-19 cases can submit a request for paid time off per its “standard sick leave policy,” regardless of vaccination status. It will also stop giving workers excused time off when waiting for their COVID-19 test results, citing the wide availability of rapid tests.</p><div class=\"c-float-right\"><aside id=\"uwo9SZ\"><q>Amazon also ended its vaccine incentive program</q></aside></div><p id=\"lOISeJ\">Amazon is adjusting some of its other COVID-19 policies as well. It’s discontinuing its <a href=\"https://www.aboutamazon.com/news/community/amazon-personalizes-employee-covid-19-vaccine-education\">vaccine incentive</a> program that paid workers $40 for every COVID-19 vaccine dose they received, and will no longer notify entire workplaces of positive COVID-19 cases “unless required by law.” Amazon has made continued to make adjustments to its policy over the course of the pandemic and <a href=\"https://www.cnn.com/2022/02/28/tech/amazon-warehouse-face-masks/index.html\">ended mask requirements</a> for both vaccinated and unvaccinated warehouse workers in February.</p><p id=\"x2BtPR\">“The sustained easing of the pandemic, ongoing availability of COVID-19 vaccines and treatments, and updated guidance from public health authorities, all signal we can continue to safely adjust to our pre-COVID policies,” Amazon’s notice reads. “We are monitoring conditions closely and will continue to adjust our response as appropriate.”</p><p id=\"oowKQz\">Amazon announced its updated policies just a day after the <a href=\"https://www.theverge.com/23041394/amazon-labor-union-ldj5-election-organizing-trends-unionization\">LDJ5 Amazon warehouse in Staten Island, New York</a> ended its union election. The National Labor Relations Board (NLRB) is set to tally up those votes on Monday, and if the warehouse votes to unionize, it will become the second Amazon warehouse to do so. Last month, a <a href=\"https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win\">nearby Staten Island warehouse voted to unionize</a> with the Amazon Labor Union (ALU) in a historic win for workers.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lELWBatzcWR2gu__MFPTwk7puOg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443481/acastro_181114_1777_amazon_hq2_0006.jpg",
  "description": "Workers will get five days of unpaid time off instead.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}