{
  "title": "Amazon’s trying to solve problem of endless streaming content with IMDb games",
  "url": "https://www.theverge.com/2022/5/5/23059025/amazon-imdb-app-games-fire-tv-exclusive",
  "date": "2022-05-05T20:58:40.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/bk-dDKlqBJoBdn7JV-_PP12usOo=/80x0:944x576/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70837181/1_hbO5IJtYpLeUcl6J77_uBg.0.png\" />    </figure>  <p id=\"YupjUz\">Amazon is throwing its hat into the ring of companies <a href=\"https://www.theverge.com/2022/4/5/23012425/plex-discover-source-watchlist-cross-streaming-service-compatibility-beta\">trying to solve one of streaming TV’s biggest issues</a>: endless amounts of content can make it <em>really difficult </em>to pick something to watch. Its approach uses <a href=\"https://amazonfiretv.blog/imdb-launches-what-to-watch-app-exclusively-on-amazon-fire-tv-9ec60729bed0\">an IMDb-branded app</a> that’s exclusively available to Fire TV owners, which will let you play a series of games designed to help you pick a movie.</p><p id=\"4vg1kA\">Amazon’s <a href=\"https://amazonfiretv.blog/imdb-launches-what-to-watch-app-exclusively-on-amazon-fire-tv-9ec60729bed0\">press release</a> mentions three games in the new app: one will “shuffle through movie and series options” and give you three options to choose from. In theory, the limited choice could help cut down on analysis paralysis since you could end up with something like three times fewer options than you would if you opened up Netflix. However, Amazon does note that there's a “deal cards” button to get new picks, so it’s always possible people will just end up hitting that over and over.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5Y9IRK4OTYGNuhCozhrYduOfdc0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441010/1_j4CL2GwvQ0dLJ3A_qYJVgw.png\">      <cite>Image: Amazon</cite>      <figcaption><em>One of Amazon’s example curated lists, where users are challenged to watch 21 movies.</em></figcaption>  </figure><p id=\"HNE9fd\">The app also has a gamified challenge option where you watch and rate movies on curated IMDb lists to collect digital stamps. Perhaps the most interesting-sounding game, though, is called “This or That.” Amazon says it asks users a series of questions, such as which genre of movie they’re looking for, to come up with recommendations. This feels like the type of thing that really takes the guesswork out of choosing a movie or show, especially since you could always put answers to a vote if you’re trying to find something to watch in a group setting.</p><p id=\"v2TOz7\">Amazon also teases that the app will be updated with more games — one called “Build-a-Cast” and another called “Time Machine.” It doesn’t detail what they are, but I’ve heard of people watching an entire actor’s filmography or marathoning movies from a certain decade, so there’s definitely potential in those ideas.</p><p id=\"FVpGMA\">The app is called “IMDb What to Watch,” and Fire TV owners can download it by searching for it or asking Alexa to “open IMDb What to Watch app.” You’ll also be able to tell the app which streaming services you have access to so it won’t recommend something you don’t watch. I do wish this functionality was built into the IMDb website so people with other streaming box or smart TV systems could watch it, but as Joe Pesci’s character says in <em>The Irishman</em>, “It’s what it is.” (Did I just look that quote up on IMDb? <a href=\"https://www.imdb.com/title/tt1302006/quotes/qt5756857\">Perhaps</a>.)</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/o0L8GvAC1WG1IQwZjGBJBXRqemQ=/0x20:1024x556/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23440858/1_hbO5IJtYpLeUcl6J77_uBg.png",
  "description": "Using IMDb’s massive amounts of data for good.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}