{
  "title": "Amazon’s Smart Air Quality Monitor could be a lot smarter",
  "url": "https://www.theverge.com/22971411/amazon-smart-air-quality-monitor-iaq-review",
  "date": "2022-03-11T15:46:43.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "  <p><em>This inexpensive indoor air quality monitor can only say, not do</em></p> <p id=\"p17CUH\">Amazon’s <a href=\"https://www.amazon.com/Introducing-Amazon-Smart-Quality-Monitor/dp/B08W8KS8D3?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$69.99 Smart Air Quality Monitor</a> is the company’s first foray into the increasingly popular category of indoor air quality monitors (IAQs). And, based on my experience with the product, it’s a bandwagon-jumping move. While relatively inexpensive and helpful thanks to voice control, the Smart Monitor doesn’t add anything particularly innovative or useful to the concept of a consumer air quality monitor.</p><p id=\"On4FNt\">An indoor air quality monitor purports to tell you all about nasties you can’t see floating around in your home (the<a href=\"https://www.epa.gov/iaq-schools/why-indoor-air-quality-important-schools\"> EPA says indoor air may be two to five times more polluted than outdoor air</a>). You may have heard about <a href=\"https://www.epa.gov/indoor-air-quality-iaq/volatile-organic-compounds-impact-indoor-air-quality\">volatile organic compounds</a> and other airborne pollutants that are common in modern homes, many of which can aggravate or contribute to respiratory diseases such as asthma. Common activities in our homes, such as cleaning and cooking (<a href=\"https://www.vox.com/energy-and-environment/2020/5/7/21247602/gas-stove-cooking-indoor-air-pollution-health-risks\">especially with gas</a>), add minuscule particulates to the air that can cause harm and also exacerbate existing health conditions. And of course, the outdoor air can creep in, which, if you live near a busy road or in an area affected by wildfire smoke, can make life miserable. </p><div id=\"Diuh6Z\"><div data-anthem-component=\"scorecard:11088267\"></div></div><p id=\"nZMirh\">A smart air quality monitor can not only give you a heads up when the air quality is going down so you can do something about it (open a window, turn on a fan, fire up an air purifier), but it should also do something about it without you needing to interfere, thanks to its connected nature. </p><div class=\"c-float-right\"><aside id=\"4QjtCL\"><q>“Alexa, what is the indoor air quality?”</q></aside></div><p id=\"uVXXTW\">For example, when particulate matter rises, a connected air quality monitor can tell a smart plug to turn on the fan connected to it or direct a smart thermostat to kick on the HVAC system to get the air moving or even trigger a smart air purifier to start cleaning the air.</p><p id=\"S4o3Le\">Herein lies the problem with Amazon’s cute little $70 smart air quality monitor: it can’t do any of that. </p><p id=\"EJqyxL\">What it can do is send an alert to your phone, announce over an Echo speaker, and indicate with its LED light when your air quality inside is poor. It can also turn on your heating or AC based on temperature, which could help move some air.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ShjWgSTGKVrhUB1ZB65_ygPsYNY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295221/jtuohy_220210_5065_0003.jpg\">      <figcaption><em>The Smart Monitor has a nice, compact design and is powered by a micro-USB cable.</em></figcaption>  </figure><p id=\"DpyZSf\">There’s no on-device screen to show you exactly what’s wrong (a feature on almost all the competition); instead, you need to have a nearby Echo Show to see your readings (or look in the app). The alert it sends just says the air quality is poor — no other info. Other monitors I’ve tested will send specific alerts — such as “CO2 levels are high, time to air this place out” or “Humidity is a bit high, consider running a dehumidifier.” While Amazon’s device does give you an early warning, that’s about it. But for people who don’t want to shell out a small fortune to monitor their air, this is a decent option.</p><p id=\"pEjr6k\">Price is the biggest selling point for the Amazon Smart Air Quality Monitor. It’s a much less expensive way to monitor your indoor air, with most competing products costing between $100 and $300. </p><p id=\"bs4Pao\">The $300 <a href=\"https://www.amazon.com/dp/B082ZF4H37?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Awair Element</a> and <a href=\"https://www.amazon.com/dp/B097YW5Q72?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Airthings View Plus</a> are the leaders here for those who want to get serious about their air. On the less expensive side of things are the $99.99 <a href=\"https://www.amazon.com/Eve-Room-Temperature-Technology-Bluetooth/dp/B09L58NQG2?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Eve Room</a>, which is HomeKit only, the <a href=\"https://shop.netatmo.com/en-us/aircare/home-coach/homecoach\">Netatmo Smart Indoor Air Quality Monitor for $119.99</a>, and the $45 <a href=\"https://us.amazon.com/Aqara-Pollution-Temperature-Humidity-High-Contrast/dp/B094R8RBWT?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Aqara’s TVOC Air Quality Monitor</a> (which requires a <a href=\"https://us.amazon.com/s?k=aqara+hub&amp;ref=nb_sb_noss_1\">hub starting at $30</a>), both of these also work with Alexa and can connect to HomeKit. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ayHtYSW4DETJxATaw3EDz9HiDv4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301981/jtuohy_220309_5065_0012.jpg\">      <figcaption><em>You can see your air quality score dashboard on an Echo Show smart display, as well as in the Alexa app on a smartphone.</em></figcaption>  </figure><p id=\"qTYkla\">The Amazon Smart AQ Monitor measures <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4740125/\">PM 2.5</a> (particulate matter small enough to penetrate the lungs), <a href=\"https://www.epa.gov/indoor-air-quality-iaq/volatile-organic-compounds-impact-indoor-air-quality\">VOCs</a>, carbon monoxide, humidity, and temperature. It’s missing a carbon dioxide monitor, which some competitors offer. This can help identify poor airflow in a room and potentially alert you to the risk of indoor COVID transmission. (High levels of CO2 can indicate that more of the air in a room is <a href=\"https://www.theverge.com/2021/4/14/22382361/covid-carbon-dioxide-co2-ventilation-sensor-bars-restaurant\">made up of other people’s breath</a> — and whatever germs that breath carries.) But the Smart Monitor does offer more sensors than the similarly priced Aqara sensor, which doesn’t measure PM 2.5 or carbon monoxide.</p><div><aside id=\"omUJ67\"><q>This is a smart air quality monitor that’s just not very smart</q></aside></div><p id=\"lHuB4A\">As with most consumer IAQs, the Smart Monitor offers up an easy-to-read score of your air quality. Its onboard indicator light also turns green for good, yellow for moderate, red for poor. The score appears in the app on a scale of 100, with 0 to 35 being bad and 65 to 100 good. It’s likely based on the <a href=\"https://www.airnow.gov/aqi/aqi-basics/\">air quality index, developed by the EPA to help average users understand air quality</a> (I’ve reached out to Amazon for confirmation of this). In my testing, my score hovered around 89, unless I was cooking on my gas stove when it nosedived to around 23. </p><p id=\"Yd94FF\">You can see the score in the device’s dashboard in the Alexa app or on an Echo Show. Here you also get a breakdown of what’s contributing to it and what, if anything, is making it worse. Each of the five sensors has its own line, highlighted in green, yellow, or red, indicating its status. </p><p id=\"qmZAgF\">In the dashboard, you can dive into a sensor’s readings in separate tabs, where you can see historical readings for the last hour, day or week. I was able to review a month’s worth of data.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KxM_Zm0nWDQ9NizHDeZWqncfVfs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295220/jtuohy_220210_5065_0002.jpg\">      <figcaption><em>The cable plugs in underneath.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BMz3dcL_LXqioZaih9XZHRF_qMs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295222/jtuohy_220210_5065_0004.jpg\">      <figcaption><em>A reset button is on the rear.</em></figcaption>  </figure></div></div></div><p id=\"6Zv34F\">The Smart Monitor is a nice-looking device. It has a rectangular puck-like design, with rounded corners, matte white plastic, and a small grille for the air to move through. It’s also significantly smaller than most of the competition and won’t look out of place in a living room or kitchen. It does have to be plugged in via a micro-USB cable and wall plug (included); there’s no battery backup. </p><p id=\"1uH64N\">The monitor is easy to set up — plug it in, open the Alexa app, and, if you are not prompted to pair the monitor, tap “Add Device.” You need to grant access to Bluetooth and your device’s camera (to scan the setup code), agree to the Alexa and Alexa Devices Terms of Use, and then scan the QR code on the back of the device. Alexa will then find the device and connect it to your Alexa account. Next, add it to a room or group. </p><p id=\"oM3glo\">The monitor takes seven minutes to calibrate before it shows an IAQ score, and Amazon says it can take about two days to adjust to your air. Because of the calibration time, it’s not really suited to moving around your home, as you have to unplug it, which resets the calibration. Interestingly, all the competitors have the option to just use battery power, which helps with portability, but most also need time to adjust to properly read your air. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ppCBmuITIlr1YMr2bWccI4Y_4JE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295225/jtuohy_220210_5065_0007.jpg\">      <figcaption><em>I tested the Smart Monitor in the kitchen next to a gas-powered stove. The LED light gives a visual indicator when air quality changes.</em></figcaption>  </figure><p id=\"4ySoPG\">I set up the test unit in my kitchen, and glancing at the red light was a handy reminder to turn my stove hood on when I was cooking on my gas stove. But it would be even better if the Smart Monitor could just turn on the fan automatically if I had a connected range. </p><p id=\"j0gMw1\">The device performed comparably to other smart IAQ monitors during testing, with only minor discrepancies in readings. The main feature it offers that others don’t are voice alerts through a compatible speaker. While not on by default, you can go into the Smart Monitor’s settings in the app and enable push notifications and / or Echo announcements when the air quality drops to poor. These are limited, however, only telling you when it’s poor. I would have liked a follow-up telling me when everything was back to normal. </p><div class=\"c-float-right\"><aside id=\"KIFJjS\"><q>You need a smart display to get the most out of this device.</q></aside></div><p id=\"kSNakH\">You can also ask Alexa for an update on your air by saying “Alexa, what is the indoor air quality?” Responses include poor, fair, and good, along with your air quality score. (Note: if you say “Alexa, what is the air quality,” you’ll get a report from <a href=\"https://www.airnow.gov/\">AirNow.gov</a> of the <em>outdoor </em>air quality index score in your location, no monitor required.) You can also ask what the indoor temperature or humidity is, but you can’t get CO, PM, or VOC readings by voice. </p><p id=\"MeNhee\">Amazon tells me you can also ask for the readings in a specific room if you add the device to a Group in the app. This would be useful if you had a couple of these in various rooms around your house. But in my testing I kept getting the response “That’s not supported yet.”</p><p id=\"Hxtfsb\">While I’m not a proponent of multiple apps, this device deserves a standalone app. It takes four taps through multiple menus and with much scrolling just to get to the monitor’s dashboard, which is not a user-friendly experience.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/94kZSB-D3yFTwjZeXpPlDTlBPNA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23304829/irobot.jpg\">      <figcaption><em>The Alexa app shows your air quality dashboard plus has settings for using the Alexa voice features.</em></figcaption>  </figure><p id=\"GqIbGk\">As alluded to earlier, my other complaint is the lack of home automation. This is a smart air quality monitor that’s just not very smart. It works with <a href=\"https://www.amazon.com/alexa-routines/b?ie=UTF8&amp;node=21442922011#:~:text=Routines%20are%20short%20cuts%20for,off%20your%20alarm%2C%20and%20more.\">Alexa Routines</a> (automated shortcuts that help your connected devices work together), but the only trigger it offers is temperature — there are five sensors here, but only one can tell other devices in your home to turn on or off. (This is also true of all the other air quality monitors that can connect to Alexa, which indicates Amazon has some platform work to do to enable it). </p><p id=\"LfNsDr\">If the Smart Monitor could also act on humidity, VOCs, CO, and particulate matter, it would be much easier to recommend. Amazon has said it is working on adding this functionality, but until it arrives, this device is limited as a smart air quality monitor.</p><p id=\"pjKhxo\">I set up a Routine that activated my HVAC system’s fan if the temperature in the kitchen rose above 75 degrees between 5PM and 8PM, when I am usually cooking. I had the Routine wait 20 minutes and then revert the fan to auto, which worked well. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VXireU888RYGQk_mj_FBwNJ3QWk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295219/jtuohy_220210_5065_0001.jpg\">      <figcaption><em>The Smart Monitor comes with a long cable and power adaptor.</em></figcaption>  </figure><p id=\"tk0B0w\">Another use case for the temperature trigger is as a room sensor for a smart thermostat that works with Alexa, such as the <a href=\"https://www.theverge.com/22791333/amazon-smart-thermostat-review-learning-geofencing-hunches\">Amazon Smart Thermostat.</a> But compared to other room sensors for smart thermostats (such as <a href=\"https://www.theverge.com/2019/6/3/18646398/ecobee-smartthermostat-review-alexa-announcement-price-specs-features\">Ecobee</a> and <a href=\"https://www.theverge.com/2018/9/5/17820594/nest-thermostat-remote-temperature-sensors-review-price-specs\">Nest</a>), functionality is limited. You can’t set conditions outside of time, such as only having the Routine run if motion is detected in the room or the lights are on, which means you could end up heating or cooling an empty room.</p><p id=\"qj0gxV\">The Smart Monitor is essentially a companion device for an Alexa / Echo home rather than a standalone air quality monitor. Amazon designed this to use primarily with voice and visual indicators rather than the app. This approach is okay if you have an Echo Show but less helpful if not. (Amazon offers value bundles that include the Smart Monitor and an Echo Dot or Echo Show 5). </p><p id=\"Hfes0y\">If you have an Amazon Smart Thermostat or similar, an Echo Show, and an interest in how high your particulate matter is, you may get some use out of the Amazon Smart Air Quality Monitor. Otherwise, there is no compelling reason to pick this up as it doesn’t do much — yet. </p><p id=\"myKJf1\"><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p><div><div id=\"cdAW83\"><div data-anthem-component=\"aside:11088409\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/Fs_WbWUhL4d3zAuX9_OPoHhzL94=/0x173:2040x1241/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23295224/jtuohy_220210_5065_0006.jpg",
  "description": "\"Alexa, what’s the indoor air quality? And what can you do about it?\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}