{
  "title": "Amazon’s ‘Play on Luna’ button on Twitch is more potential than practical",
  "url": "https://www.theverge.com/2022/2/21/22944703/amazon-play-on-luna-twitch-button",
  "date": "2022-02-21T21:00:54.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qA1a2qvagpffvPV1s5TTqhr8wBk=/159x0:1881x1148/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70534569/_DSC6805_2.0.jpg\" />    </figure>  <p id=\"oeyefx\">Amazon is tying two of its big gaming efforts, the Twitch streaming platform and its Luna cloud gaming service, a bit closer together. If you’re looking at a game’s page on Twitch and that game is available on Luna, you might now see a “Play on Luna” button that takes you to the title on the cloud gaming service (<a href=\"https://9to5google.com/2022/02/21/amazon-luna-twitch-button-click-to-play/\">via <em>9to5Google</em></a>). </p><p id=\"TNK3kn\">While the button could be a handy way to hop directly into an interesting game you found on Twitch, there are still a lot of limitations to Luna that make the process of just jumping in and playing a game harder than it should be. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4dDoTIJqVZTvmLhDSeNNR3hQEOg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23261317/Screen_Shot_2022_02_21_at_11.45.54_AM.png\">      <cite>Screenshot by Jay Peters / The Verge</cite>      <figcaption><em>We need more people playing </em>Sonic Mania<em> on Twitch.</em></figcaption>  </figure><p id=\"klgcRr\">First of all, to see the button at all, it appears you need to be logged into Twitch, have linked your Amazon account to Twitch, <em>and</em> been accepted into the early access program for Luna. It didn’t appear for me when I checked on the <a href=\"https://www.twitch.tv/directory/game/Sonic%20Mania\"><em>Sonic Mania</em></a> or <a href=\"https://www.twitch.tv/directory/game/Tom%20Clancy's%20Rainbow%20Six%20Extraction\"><em>Tom Clancy’s Rainbow Six Extraction</em></a> Twitch pages while in Chrome’s Incognito mode.</p><p id=\"gObBLD\">The button also isn’t on Twitch streams themselves — instead, it’s buried on a game’s overarching Twitch page. I think the button would be a lot more useful on an individual stream of a game, where I could click it while watching something to immediately try the game streamed from the cloud.</p><div class=\"c-float-right\"><aside id=\"XW0yMS\"><q>If you know where the button is, you still might not be able to just hop into a game</q></aside></div><p id=\"V70ObJ\">Let’s say you’re logged into Twitch, have connected your account to Amazon, have been accepted to the Luna early access program, do know where the “Play on Luna” button is, and you click it to play something on the cloud gaming service, Luna’s business model means you <em>still</em> might not be able to just hop into a game.</p><p id=\"Dp29wl\">Unlike a service such as Netflix, which lets you access all of the available content with one monthly subscription, Luna instead offers different sets of games grouped by “channel,” and each channel has a separate subscription. That means you won’t know if you subscribe to the correct channel on Luna to play a game from Twitch until you click the button. And since I don’t subscribe to any Luna channels, that means I haven’t actually been able to click the button and start playing a game.</p><p id=\"G4tXnF\">As <em>9to5Google</em> pointed out, this Twitch / Luna integration was promised as part of <a href=\"https://press.aboutamazon.com/news-releases/news-release-details/introducing-luna-amazons-new-cloud-gaming-service-where-its-easy\">the service’s debut in September 2020</a>, so it’s been in the works for quite awhile. And the addition of the “Play on Luna” button to Twitch could be a sign that Amazon is taking Luna more seriously. But in my opinion, the button is too hard to find and making it work is more complex than it needs to be. My colleague Sean Hollister has argued that <a href=\"https://www.theverge.com/2021/6/23/22547334/cloud-gaming-xbox-xcloud-microsoft-streaming-google-stadia-amazon\">cloud gaming needs to disappear to succeed</a>, and right now, the “Play on Luna” button has a lot of friction that hinders it from providing a seamless experience. </p><aside id=\"cSF595\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"To succeed, cloud gaming needs to disappear\",\"url\":\"https://www.theverge.com/2021/6/23/22547334/cloud-gaming-xbox-xcloud-microsoft-streaming-google-stadia-amazon\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/zkQwVLR7l7Gxk1vzRBlQtuv399E=/0x40:2040x1108/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21975085/_DSC6805_2.jpg",
  "description": "It isn’t as seamless as you might expect.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}