{
  "title": "Amazon workers say they weren’t all alerted as smoke spread through a warehouse",
  "url": "https://www.theverge.com/2022/3/27/22998856/amazon-workers-werent-all-alerted-smoke-spread-through-warehouse-bessemer-alabama",
  "date": "2022-03-28T00:31:27.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4g7RD11o02lWx6Vfq26UXpoFQCM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70678464/acastro_181114_1777_amazon_hq2_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"tK2ZGc\">Amazon workers claim they weren’t all properly alerted as what they thought was smoke filled the third floor at a Bessemer, Alabama warehouse on Friday, according to a report from the <a href=\"https://www.rwdsu.info/breaking_workers_kept_at_their_stations_for_hours_amid_health_and_safety_incident_at_bessemer_alabama_facility\">Retail, Wholesale and Department Store Union</a> (RWDSU) (via <a href=\"https://www.inputmag.com/culture/amazon-workers-kept-at-factory-unknown-vaporized-substance-spread-bessemer-alabama\"><em>Input</em></a>). While workers on the third floor were told to clock out, go on unpaid voluntary time off (VTO), and evacuate, employees on the other floors were allegedly left to continue working as an unidentified vapor spread throughout the facility. The “smoke” was later found to be vaporized oil from a malfunctioning compressor.</p><p id=\"kyUX4U\">According to the RWDSU’s timeline of events, workers on the third floor evacuated around 1:30PM. Hours later, workers on the first floor started seeing the smoke-like substance and didn’t evacuate until 5:45PM. They reportedly received no notification from a fire alarm, managers, or through the Go screens and A to Z app that Amazon uses to communicate with its workers, and allegedly only knew to evacuate as more employees got word of the situation.</p><div class=\"c-float-right\"><aside id=\"7WC7CK\"><q>“I don’t know what I was breathing in for that long, and I don’t know if it’s still in the air at work today either”</q></aside></div><p id=\"SoNAws\">When they got outside, the RWDSU says there was “limited” police and fire presence. As the overnight shift workers began to arrive at 7:00PM, employees were reportedly told to go inside and begin working despite the “cloudiness” present inside the building. </p><p id=\"JPFENu\">“At first, I thought my glasses were just smudged, but then the air got thicker, and my co-worker said he thought it was smoke and we should leave,” Isaiah Thomas, an Amazon warehouse worker at the Bessemer location told the RWDSU. “Everyone was very confused, and the lack of information made us feel very unsafe...  I don’t know what I was breathing in for that long, and I don’t know if it’s still in the air at work today either.”</p><p id=\"ndtVOv\">The RWDSU says workers have since reported the situation to the Occupational Health and Safety Administration (OSHA), and “are awaiting further investigation.” Although the smoke was likely vaporized oil, it remains unclear whether it poses any health risks. In December, <a href=\"https://www.theverge.com/2021/12/13/22833012/amazon-fatal-warehouse-collapse-osha-investigation-illinois-tornado\">OSHA opened an investigation</a> into the <a href=\"https://www.theverge.com/2021/12/11/22829363/amazon-warehouse-tornado-collapse-edwardsville-illinois\">collapse of an Amazon warehouse</a> in Illinois that killed six workers as a tornado ripped through the Midwest.</p><p id=\"1Z0Dm2\">Amazon spokesperson Kelly Nantel called the RWDSU’s claims “false” in a statement to <em>The Verge</em>. “An air compressor malfunction resulted in smoke emitting from the equipment,” Nantel said. “Out of an abundance of caution, we evacuated the facility and called the local fire department who responded and quickly evaluated and cleared the site. We’re thankful no one was injured and we appreciate the swift actions of the Bessemer Fire Department.”</p><p id=\"IB89ie\">Nantel told <em>The Verge</em> that the fire department’s investigation found no evidence of hazardous conditions. She also denies the RWDSU’s claim that employees were told to clock out and take VTO upon evacuating, and says employees were paid for their entire shifts.</p><p id=\"Wa6vIB\"><em>The Verge</em> reached out to the RWDSU with a request for comment but didn’t immediately hear back.</p><p id=\"wxGeJC\">Workers at Amazon’s Bessemer warehouse have long been fighting to unionize. It held a <a href=\"https://www.theverge.com/2021/2/8/22272213/amazon-union-bhm1-alabama-rwdsu-vote-begins\">union election last February</a> in which a large number of workers <a href=\"https://www.theverge.com/2021/4/9/22374540/amazon-union-vote-outcome-bessemer-alabama-rwdsu-bhm1\">voted against unionizing</a>.  However, union organizers accused Amazon of meddling with the election, alleging that <a href=\"https://www.theverge.com/2021/5/21/22445940/amazon-union-nlrb-hearing-mailbox-bessemer\">Amazon had access to a mailbox</a> workers used to cast their ballots. The National Labor Relations Board later determined that <a href=\"https://www.theverge.com/2021/11/29/22565851/amazon-bessemer-union-vote-nlrb-appeal-overturned-second-election\">Amazon violated US labor laws</a>, and called for a new vote that <a href=\"https://www.theverge.com/2022/1/11/22878457/amazon-bessemer-alabama-union-election-redo-february-fourth\">began on February 4th of this year</a> and <a href=\"https://www.protocol.com/workplace/amazon-union-bessemer-staten-island\">ended on Friday</a> — just as <a href=\"https://www.theverge.com/2022/2/16/22937440/amazon-jfk8-staten-island-union-election-march-25th\">the union vote for an Amazon Staten Island, New York warehouse, called JFK8, began</a>. A <a href=\"https://www.theverge.com/2022/3/18/22985518/amazon-warehouse-union-election-second-staten-island-ldj5\">separate Staten Island warehouse</a>, LDJ5, is also set to begin voting on April 25th.</p><p id=\"ByC3Rw\"><em><strong>Update March 27th 5:46PM ET: </strong></em><em>Updated to add context surrounding the Amazon warehouse collapse in Edwardsville, Illinois.</em></p><p id=\"i5Vkiw\"><em><strong>Update March 27th 8:04PM ET: </strong></em><em>Updated to add Kelly Nantel’s statement to </em>The Verge.</p><p id=\"VBssfc\"><em><strong>Update March 27th 8:30PM ET:</strong></em><em> Updated to add additional context from Nantel.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fhTpM7RsSd5QYNKxgAePu6s5uWA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443464/acastro_181114_1777_amazon_hq2_0004.jpg",
  "description": "Some workers allegedly kept working as smoke filled the building.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}