{
  "title": "Amazon will pay you for your grocery shopping data",
  "url": "https://www.theverge.com/2022/5/16/23074199/alexa-shopping-list-savings-coupons-cashback-groceries",
  "date": "2022-05-16T13:43:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/HMDA7xmeggFYCRhuEol5MW40K4g=/34x0:619x390/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70874141/amazon_shopping.0.jpg\" />        <figcaption><em>Amazon has a new coupon clipping feature for its Alexa app’s shopping list.</em> | Image: Amazon</figcaption>    </figure>  <p id=\"clwcOg\">While you may buy a lot of stuff on Amazon, most people don’t do their weekly grocery shopping with the retail giant (unless Whole Foods is your local store). Amazon is therefore missing a big chunk of your shopping habits, and now, it's offering an incentive for you to hand over that data: grocery coupons. </p><p id=\"W5r4bb\"><a href=\"https://www.amazon.com/b?node=23869270011&amp;tag=aftvn-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Alexa Shopping List Savings</a>, which launched this month, is a new feature for the digital assistant that lets you clip coupons in the Alexa app for items you’ve added to your shopping list. The savings are added up, and the cashback is put on your digital Amazon gift card within a few days. The US-only service is now available to all customers and works exclusively with the Alexa app’s pre-installed <a href=\"https://www.theverge.com/2019/11/20/20973146/amazon-echo-alexa-shopping-list-how-to-manage-skill\">shopping list</a>. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1T2CH_42rHJp8QNd3eXYrwpfyQU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23469722/IMG_5187580E44A0_1.jpeg\">      <cite>Screenshot Jennifer Pattison Tuohy / The Verge</cite>      <figcaption><em>How the coupons appear in the Alexa shopping list.</em></figcaption>  </figure></div><p id=\"GOijxF\">Items can be added to the list either by asking a smart speaker to do it (“Alexa, add eggs, milk, and bread to my shopping list”) or by manually adding them using the smartphone app. Coupons will then show in the list next to the related item, where you can choose to apply them. </p><p id=\"e3z6su\">Once you’ve been to the store, upload your receipt and scan the barcodes of the eligible items into the Alexa app to get your rebate. It’s more hassle than using coupons in the store and is more like a traditional rebate process. But, with the <a href=\"https://www.vox.com/the-goods/2022/3/2/22956966/inflation-explained-by-eggs\">price of groceries increasing</a>, every penny counts for many people these days.</p><p id=\"bJQ5G0\">While it wasn’t completely clear until recently that <a href=\"https://www.theverge.com/2022/4/28/23047026/amazon-alexa-voice-data-targeted-ads-research-report\">what you say to your smart speaker can be used by Amazon to serve ads to you</a>, with this service, Amazon is more forthright. It <a href=\"https://www.amazon.com/b?node=23869270011&amp;tag=aftvn-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">states prominently on the Amazon Shopping List Savings</a> page that data from any information you upload and the offers you activate “may be shared with Amazon’s service providers.” That data will be used in accordance with Amazon’s <a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=468496&amp;ref_=footer_privacy\">privacy policy</a>. If you use a grocery store loyalty card, you have likely entered into a similar data exchange, with <a href=\"https://www.bbc.com/news/technology-43483426\">many stores collecting and tracking customer data</a>. </p><div class=\"c-float-right\"><aside id=\"zxmFwm\"><q>The rebate offers are brand-specific, not store-specific</q></aside></div><p id=\"R7hFiU\">The offers are brand-specific, not store-specific. For example, I saw offers for Dave’s Killer Bread next to the bread entry and Snapple Elements next to the iced tea entry in my Alexa shopping list. Amazon spokesperson Trang Nguyen told <em>The Verge</em> that there are over 100 participating brands, including Pepsi, Snapple, Johnson’s, Sonoma Gourmet, and Applied Nutrition. Most offers are in the grocery and pharmacy category, and there is no specific tie-in with Amazon-owned Whole Foods, Nguyen said. ”Customers can use these offers at their favorite stores nationwide, including Whole Foods,” he said.</p><p id=\"gqBlLw\">While you can add items to an Alexa shopping list by speaking to an Echo smart speaker, it’s not necessary to have one to use the savings feature. The coupons are available just by using the Alexa app and signing up for an account.  </p><p id=\"Nxtrg5\"></p><p id=\"n1duiN\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dElxiv8xEmd6bTIIvmeOUj6Rm6g=/0x25:651x366/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23469627/amazon_shopping.jpg",
  "description": "Use Alexa’s shopping list to get cashback in physical grocery and pharmacy stores.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}