{
  "title": "Amazon prices likely going up with new ‘fuel and inflation surcharge’",
  "url": "https://www.theverge.com/2022/4/14/23024886/amazon-price-hike-fuel-inflation",
  "date": "2022-04-14T09:25:39.000Z",
  "author": "Thomas Ricker",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kbHv25VLTATp1Kmi74jhnlV9NMw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70747542/acastro_181114_1777_amazon_hq2_0007.0.jpg\" />        <figcaption><em>Increased fees to sellers will likely be passed on to buyers.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"EWcAgg\">Amazon is looking to offset costs to third-party sellers in the US resulting from soaring inflation and fuel prices. The new <a href=\"https://sellercentral.amazon.com/gp/help/external/GABBX6GZPA8MSZGW?language=en_US\">five percent “fuel and inflation surcharge” for sellers</a> that use Amazon’s fulfillment services will go into effect starting April 28. Since most items purchased off Amazon are from third-party sellers, you can expect these new costs to be passed along to shoppers.</p><p id=\"3pJKYZ\">89 percent of Amazon’s over two million third-party sellers use Fulfillment by Amazon (FBA) to leverage the retail giant’s supply chain, warehouses, and shipping operations, <a href=\"https://www.junglescout.com/wp-content/uploads/2022/02/The-State-of-the-Amazon-Seller-2022-Jungle-Scout.pdf\">reports Jungle Scout research</a>. </p><div class=\"c-float-right\"><aside id=\"EVnkL8\"><q>“We will be employing a fuel and inflation surcharge for the first time”</q></aside></div><p id=\"9FwcPZ\">“In 2022, we expected a return to normalcy as Covid-19 restrictions around the world eased, but fuel and inflation have presented further challenges,” said an Amazon spokesperson in an email to <a href=\"https://www.cnbc.com/2022/04/13/amazon-slaps-us-sellers-with-5percent-fuel-and-inflation-surcharge.html\"><em>CNBC</em></a>. “It is still unclear if these inflationary costs will go up or down, or for how long they will persist, so rather than a permanent fee change, we will be employing a fuel and inflation surcharge for the first time — a mechanism broadly used across supply chain providers.” </p><p id=\"1vIXu8\">FedEx charges a fuel surcharge of 49 cents per unit while UPS charges 42 cents, according to <em>CNBC</em>. Amazon’s surcharge is 24 cents.</p><p id=\"a2jxIY\">US inflation hit 8.5 percent in March while gasoline was up 48 percent since last year, according to <a href=\"https://www.nytimes.com/2022/04/13/technology/amazon-fuel-surcharge.html\"><em>The New York Times</em></a><em>.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OkgDkEtLBed8QNEu9lTmBnKAtgs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443482/acastro_181114_1777_amazon_hq2_0007.jpg",
  "description": "US sellers hit with 5 percent surcharge on April 28th",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}