{
  "title": "Amazon workers made up almost half of all warehouse injuries last year",
  "url": "https://www.theverge.com/2022/4/12/23022107/amazon-warehouse-injuries-us-half",
  "date": "2022-04-12T18:26:07.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/z4R8kMq9JuawHY8h9P0iiU5BaGQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740974/acastro_181114_1777_amazon_hq2_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"iOuecE\">Amazon workers only make up a third of US warehouse employees, but in 2021, they suffered 49 percent of the injuries for the entire warehouse industry, according to <a href=\"https://thesoc.org/what-we-do/the-injury-machine-how-amazons-production-system-hurts-workers/\">a report by advocacy group Strategic Organizing Center</a> (or SOC). After analyzing data from the Occupational Safety and Health Administration (OSHA), the union coalition found that Amazon workers are twice as likely to be seriously injured than people who work in warehouses for other companies. </p><p id=\"seQQkP\">The report considers “serious injuries” to be ones where workers either have to take time off to recover or have their workloads reduced, following <a href=\"https://www.osha.gov/sites/default/files/ITA_Data_Dictionary.pdf\">OSHA’s report classification</a> (pdf) of “cases with days away from work” and “cases with job transfer or restriction.” The data shows that, over time, the company has been shifting more toward putting people on light duty, rather than having them take time off. The report authors also note that Amazon workers take longer to recover from injuries than employees at other companies: around 62 days on average, versus 44 across the industry.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vbJ1PHzhrQIGGj3oLwetCJIM0OE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23384473/Screen_Shot_2022_04_12_at_09.25.02.png\">      <cite>Graph: Strategic Organizing Center</cite>      <figcaption><em>A graph showing Amazon’s injury rates over the past five years.</em></figcaption>  </figure><p id=\"oWjdjl\">Amazon employees have said it’s not the work itself that’s particularly dangerous but rather the <a href=\"https://www.theverge.com/2020/2/27/21155254/automation-robots-unemployment-jobs-vs-human-google-amazon\">grueling pace the company’s automated systems demand</a>. Amazon actually had workers go slower in 2020 to help combat COVID-19, which accounts for the notably lower injury rates that year. But, as the report notes, the injuries increased by around 20 percent between 2020 and 2021 as the company resumed its usual pace — though the injury rates for 2021 were still lower than they were in 2019.</p><p id=\"UIKWzi\">It’s also worth noting that even with that slowed pace of work in 2020, Amazon has been criticized for how it treated workers in its response to COVID-19, especially in New York, where organizers were motivated to <a href=\"https://www.theverge.com/2020/4/10/21216172/amazon-coronavirus-protests-response-safety-jfk8-fired-covid-19\">start working toward unionizing at the company’s warehouses</a>. New York Attorney General Letitia James has <a href=\"https://www.theverge.com/2021/11/30/22810754/amazon-new-york-ag-reinstate-fired-worker-health-safety-covid\">also filed a suit against Amazon</a>, alleging it failed to protect workers and retaliated against them (which included <a href=\"https://www.theverge.com/2020/4/24/21233891/amazon-coronavirus-protest-sick-out-tech-workers-climate-justice\">firing lead organizer Christian Smalls</a>) after they spoke out. </p><p id=\"jNepm2\">Unfortunately, this study’s results tell the same story we’ve been hearing for years. Even with its reduced injury rates in 2020, Amazon workers were <a href=\"https://www.theverge.com/2021/6/1/22463132/amazon-injury-rate-warehouses-osha-data-report\">still hurt twice as often</a> as other warehouse workers, according to SOC. Tuesday’s report also shows that Amazon’s human workers (whom <a href=\"https://www.theverge.com/2021/6/2/22465357/amazon-industrial-athlete-warehouse-worker-wellness-pamphlet\">it’s called “industrial athletes”</a>) are more at risk for injuries when working at warehouses that have been automated — a fact <a href=\"https://www.theverge.com/2020/9/29/21493752/amazon-warehouses-robots-higher-injury-rates-report-reveal\">Amazon knew years ago</a>, according to internal documents. As <a href=\"https://www.cnbc.com/2022/04/12/study-amazon-workers-suffer-serious-injuries-at-twice-rate-of-rivals.html\">CNBC points out</a>, Amazon says it wants to become the safest place to work, but the company may need to overhaul its entire system to meet that goal.</p><p id=\"pezLzP\">Amazon didn’t immediately respond to <em>The Verge</em>’s request for comment on the report.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/04tu5TjcUQ1I-M3wQrzLd-TIgb0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443463/acastro_181114_1777_amazon_hq2_0003.jpg",
  "description": "The company says it wants to be the \"Safest Place to Work.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}