{
  "title": "Amazon workers at Staten Island warehouse will vote next month on whether to unionize",
  "url": "https://www.theverge.com/2022/2/16/22937440/amazon-jfk8-staten-island-union-election-march-25th",
  "date": "2022-02-16T19:27:24.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ecs5vBjvmUbcUaVsKO9PcL0jp8U=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70517306/acastro_181114_1777_amazon_hq2_0004.0.jpg\" />        <figcaption>Amazon workers in New York will vote on unionization | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"eVJ2e8\">Workers at an Amazon warehouse on Staten Island in New York City will hold an election next month to decide whether to unionize, the Amazon Labor Union (ALU) said Wednesday. Workers at the warehouse, called JFK8, will vote between March 25th and March 30th, according to the ALU, which is representing the workers. The election will be held in person at a tent outside the warehouse, the ALU tweeted.</p><p id=\"gTjAJ7\">The National Labor Relations Board (NLRB) did not immediately confirm the dates, but said Wednesday afternoon that the parties “have tentatively reached a stipulated election agreement.” A hearing scheduled for Wednesday morning was suspended pending finalization of the tentative agreement, according to an email from NLRB spokesperson Elliott Becker. </p><p id=\"ITpObY\">The NLRB <a href=\"https://www.theverge.com/2022/1/26/22903584/amazon-jfk8-warehouse-union-election-labor-nlrb\">determined last month</a> that unionization efforts at Amazon’s JFK8 warehouse had “reached a sufficient showing of interest” to hold an election. </p><div id=\"i5qCgg\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We have officially reached an agreement with Amazon regarding the terms of our JFK8 election. Voting will occur in-person in a tent outside the warehouse, between 3/25-3/30.<br><br>Please contact the NLRB press sec. elliot.becker@nlrb.gov for more info.<a href=\"https://twitter.com/hashtag/amazon?src=hash&amp;ref_src=twsrc%5Etfw\">#amazon</a> <a href=\"https://twitter.com/hashtag/ALUforthewin?src=hash&amp;ref_src=twsrc%5Etfw\">#ALUforthewin</a></p>— Amazon Labor Union (@amazonlabor) <a href=\"https://twitter.com/amazonlabor/status/1493978932332408840?ref_src=twsrc%5Etfw\">February 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"1KwhOf\">The ALU has been trying to unionize Amazon workers in New York for some time: in October 2021, it <a href=\"https://www.theverge.com/2021/10/21/22738310/amazon-warehouse-workers-staten-island-union-election-nlrb\">filed with the NLRB to hold a union election</a> for Amazon facilities on Staten Island but later withdrew the request because it didn’t have enough signatures. It <a href=\"https://www.theverge.com/2021/12/22/22850880/amazon-workers-staten-island-refile-union-petition\">refiled in December</a>, focusing on just the JFK8 warehouse <a href=\"https://www.theverge.com/2020/3/30/21199942/amazon-warehouse-coronavirus-covid-new-york-protest-walkout\">where it has previously held walkouts</a>.</p><p id=\"WPHPHT\">Amazon spokesperson Kelly Nantel said in an email to <em>The Verge</em> that the company was “skeptical” that there were enough legitimate signatures from workers to support the election petition. “But since the NLRB has decided the election will proceed, we want our employees to have their voices heard as soon as possible,” Nantel wrote. “Our employees have always had a choice of whether or not to join a union, and our focus remains on working directly with our team to make Amazon a great place to work.”</p><p id=\"mOoHAM\">The JFK8 election would be the second among Amazon warehouse workers in the US; <a href=\"https://www.theverge.com/2022/1/11/22878457/amazon-bessemer-alabama-union-election-redo-february-fourth\">as part of another union drive at its BHM1 facility</a> in Bessemer, Alabama, the NLRB ordered a re-do of an election held last year after it determined <a href=\"https://www.theverge.com/2021/8/2/22598004/nlrb-officer-new-election-amazon-bessemer-union-drive\">that Amazon had interfered with the first</a> election.</p><p id=\"nrm9QY\"><em><strong>Update February 16th 2:27PM ET: </strong></em><em>Adds comment from the National Labor Relations Board</em></p><p id=\"dUsC5Q\"> </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fhTpM7RsSd5QYNKxgAePu6s5uWA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443464/acastro_181114_1777_amazon_hq2_0004.jpg",
  "description": "It’s the second warehouse to hold a union election.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}