{
  "title": "Amazon’s Alexa can now tell you if your security camera sees a person or package",
  "url": "https://www.theverge.com/2022/4/27/23044873/amazon-alexa-person-package-detection-video-doorbells-security-cameras",
  "date": "2022-04-27T18:30:05.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qzLq9RxZqnQLdhXibyhu9w4xDF0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70800951/jtuohy_220222_5043_0002.0.jpg\" />        <figcaption><em>Amazon’s Alexa can now tell you when your Ring, Google Nest, or Abode camera sees a person.</em> | Photo by Jennifer Pattison Tuohy / The Verge</figcaption>    </figure>  <p id=\"17zTVP\">Alexa has always had aspirations to be a type of digital butler, and today, it’s getting closer to that goal. Amazon’s voice assistant can now announce when there’s a person or package at your video doorbell or security camera. If you have an <a href=\"https://www.theverge.com/22521948/amazon-echo-show-8-2nd-gen-2021-review\">Echo smart display</a> or Fire TV, it can also show you who or what is there by automatically pulling up a live video feed. The new feature will work with <a href=\"https://www.theverge.com/22954554/best-video-doorbell-camera\">video doorbells</a> and <a href=\"https://www.theverge.com/22811985/best-smart-floodlight-security-camera\">security cameras</a> from Ring, Google Nest, and Abode, with more brands potentially adding the ability thanks to a new API from Amazon.</p><p id=\"pYOd2p\">Amazon says that person detection announcements are rolling out now to all Ring video doorbells and cameras and will be coming soon to the Google Nest Cam Outdoor, Nest Cam Indoor, Nest Cam Floodlight, Nest Doorbell (battery), Abode IOTA, and Abode Outdoor Camera. You can also set up an Alexa Routine based on the new detection features, such as turning on a porch light, controlling a smart lock, or activating the sprinklers on a potential intruder.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sPuvnuMyjOIs_MSQ4M6Aq7JjRBk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262926/jtuohy_220217_5036_0008.jpg\">      <cite>Photo by Jennifer Pattison Tuohy / The Verge</cite>      <figcaption><em>Echo Show devices like the Echo Show 10 can now automatically pull up a live feed when a compatible camera detects a person or package.</em></figcaption>  </figure><p id=\"2bfacL\"><a href=\"https://www.theverge.com/2021/9/28/22691923/ring-video-doorbell-package-alerts-amazon-event\">Package detection</a> is first available on the <a href=\"https://www.theverge.com/22359973/ring-video-doorbell-pro-2-review\">Ring Video Doorbell Pro 2</a> and Ring Video Doorbell 2020 and is coming to Abode’s IOTA and Outdoor cameras, but not to the Google Nest cameras, even though the Nest doorbells do have package detection of their own. These partnerships are part of a new <a href=\"https://developer.amazon.com/en-US/blogs/alexa/device-makers/2022/04/Alexa-object-detection-sensor-api-april-2022\">Object Detection Sensor API</a> Amazon has released that allows camera manufacturers to add this functionality to their devices. </p><aside id=\"uvDtdM\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to connect your video doorbell to your smart display \",\"url\":\"https://www.theverge.com/22949565/doorbell-video-nest-echo-show-alexa-google-how-to\"}]}'></div></aside><p id=\"PX6b1c\">If the camera manufacturer charges a fee for person or package detection, you will need to pay that for the feature to work. Ring users will need a Ring Protect plan (from $3 a month) and Abode users an Abode plan (from $7 a month); Google doesn’t charge for person detection. </p><p id=\"d5A6TY\">Currently, many video doorbells that work with Alexa can announce on connected Echo speakers when someone presses the doorbell, and <a href=\"https://www.theverge.com/22949565/doorbell-video-nest-echo-show-alexa-google-how-to\">Ring doorbells can pull up a live feed on an Echo Show</a> or Fire TV. Some security cameras can also announce motion events. But these new features add the ability to do all this for a person or package, too. It should be useful for those times delivery drivers don’t ring the doorbell or for if someone is creeping around in your backyard. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SNgQsPO4hdggQggfMIVZq74zDPI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420359/Alexa_Announcements.jpg\">      <cite>Screenshots: Ring</cite>      <figcaption><em>You control the settings for the person and package announcements in the Alexa app, where you can also set up motion and doorbell press announcements.</em></figcaption>  </figure><p id=\"WNddNJ\">To turn the feature on, you will need to have person and / or package detection enabled on your compatible camera (<a href=\"https://support.ring.com/hc/en-us/articles/4616861167892\">here’s how to do that on Ring devices)</a> and then go into the Alexa app and navigate to the camera or doorbell settings. There, you’ll see a new section called Camera Events, where you can enable either or both options as well as customize the settings. You can also choose which Alexa devices make the announcements if you have more than one.</p><p id=\"RH5E1g\">We have yet to see the features show up on our devices, and it may take some time for it to roll out to all users.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AfPUj6hrxqA6WYjzuOpJmSxKOeM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23267908/jtuohy_220222_5043_0002.jpg",
  "description": "Security cameras from Google Nest, Ring, and Abode will work with the new feature at launch",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}