{
  "title": "Amazon is working on a live-action Blade Runner 2099 TV show from Ridley Scott",
  "url": "https://www.theverge.com/2022/2/11/22929435/amazon-blade-runner-2099-live-action-tv-show-ridley-scott-sequel",
  "date": "2022-02-11T18:43:44.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ivXsJS2W6k_sC3bzGGR4mpZv8mc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70498784/TRI-09454_2040.0.0.jpg\" />        <figcaption>Photo: Alcon Entertainment</figcaption>    </figure>  <p id=\"FbI554\"><em>Blade Runner</em>’s next act will apparently be a live-action TV series from Amazon, with original director Ridley Scott set to return as an executive producer on the project, <em>Blade Runner 2099, </em><a href=\"https://variety.com/2021/tv/global/blade-runner-alien-tv-series-ridley-scott-1235117198/\"><em>Variety </em>reports</a><em>.</em></p><p id=\"eCHAhw\"><em>Blade Runner 2099 </em>will pick up 50 years in the future from the Denis Villeneuve-helmed sequel <em>Blade Runner 2049</em> from 2017 and will see Silka Luisa (the showrunner on Apple TV Plus’ <em>Shining Girls</em>) writing and executive producing the series. <a href=\"https://deadline.com/2022/02/blade-runner-2099-sequel-series-ridley-scott-amazon-1234931521/\"><em>Deadline </em>adds</a><em> </em>that Scott may also direct the show himself, too. </p><p id=\"kVLJXV\">Scott had previously <a href=\"https://variety.com/2021/tv/global/blade-runner-alien-tv-series-ridley-scott-1235117198/\">teased the project</a> in a <em>BBC</em> interview back in November — the first public mention of the series — mentioning that the live-action show was being developed as a 10-episode series to start, with a pilot and a show bible already written. <em>Blader Runner: 2099</em> won’t be the first spin-off show for the iconic sci-fi franchise, either; Adult Swim debuted an anime series, <a href=\"https://www.theverge.com/2018/11/29/18118112/blade-runner-black-lotus-anime-cowboy-bebop-ghost-in-the-shell\"><em>Blade Runner: Black Lotus</em></a>, late last year that further expanded the <em>Blade Runner </em>universe.</p><div class=\"c-float-right\"><aside id=\"7UtCRw\"><q>Does Amazon dream of electric sheep?</q></aside></div><p id=\"Gsa0EV\">The original <em>Blade Runner</em> was released in 1982 and has since risen to prominence as one of the most beloved science fiction movies ever made (along with one of the most controversial, <a href=\"https://www.theverge.com/2017/10/3/16404444/which-blade-runner-version-to-watch-ridley-scott-theatrical-cut-final\">given the plethora of different cuts</a> whose relative merits have been fodder for internet arguments for decades). The 35-years-in-the-making sequel, <em>Blade Runner 2049</em>, was released in 2017 to critical — if not commercial — success. </p><p id=\"UJnjd9\">That Amazon is the reported home of the live-action <em>Blade Runner</em> show speaks to the mega-corporation’s streaming ambitions as it continues to try and build out its library of must-see content. Amazon Studios has invested heavily in genre television in recent years, with the company picking up <em>The Expanse </em>after its original cancellation, along with big-budget projects like <em>The Wheel of Time</em> and <em>The Lord of the Rings: The Rings of Power </em>(the latter of which, with a reported budget of $465 million looks to be the <a href=\"https://www.theverge.com/2021/4/16/22388035/amazon-lord-of-the-rings-lotr-tv-series-production-cost-season-1\">single most expensive TV series ever made</a>). </p><p id=\"fMzLHz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/g9uUseZ44jyjKoNz8qAirLZzO2I=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9349141/TRI-09454_2040.0.jpg",
  "description": "Scott is said to be serving as an executive producer on the series.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}