{
  "title": "Amazon’s new Super Bowl ad features a creepy mind-reading Alexa",
  "url": "https://www.theverge.com/2022/2/7/22922002/amazon-alexa-super-bowl-ad-2022-mind-reading-scarlett-johansson-colin-jost",
  "date": "2022-02-08T00:05:26.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/E_hzxak2R8xS8hMTeL2UhfVTGuI=/239x0:2819x1720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70482030/Screen_Shot_2022_02_07_at_2.31.03_PM__1_.0.jpeg\" />        <figcaption><em>Scarlett Johansson and Colin Jost surprised by Alexa’s response in Amazon’s 2022 Super Bowl ad</em> | Image: Amazon</figcaption>    </figure>  <p id=\"DTevsA\">Amazon’s Super Bowl LVI ad features real-life celebrity couple Scarlett Johansson and Colin Jost, imagining how a mind-reading Alexa could wreck their relationship by revealing unfiltered thoughts to each other.</p><p id=\"Rzc1gs\">The ad starts at the couple’s home with Jost calling Johansson over to check out a cool smart home command for the big game. “Alexa, it’s game day,” Jost confidently calls out, and the home assistant turns on the TV with football playing on Amazon’s Prime video service, closes the blinds, and, to their surprise, specifically chills the rosé bottles in a smart wine cooler. “It’s like she can read your mind,” they say together.</p><p id=\"noH1cX\">This last action of cooling the bottles is based on <a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=G7F5F7K93GKSLC4F\">a real feature</a> of Alexa called Hunches, where Amazon collects data in your smart home to predict and recommend actions that should take place: like turning off lights in your bedroom when you set a scene in the living room. Hunches are enabled by default.</p><div id=\"OK9ZTe\"><div ><iframe src=\"https://www.youtube.com/embed/d0UEAr8I9G8?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"8xpXxW\">The ad then runs a short montage of cheeky marriage idiosyncrasies: Johansson awakens next to Jost in bed, and Alexa suddenly announces that it’s ordering mouthwash, revealing that Jost is thinking about how bad Johansson’s breath is. In another situation, Alexa plays “Little Lies” by Fleetwood Mac while Johansson reassures Jost that she doesn’t really enjoy making love scenes.</p><p id=\"JXZ09K\">This is the seventh year Amazon’s voice assistant has advertised during the big game, and Amazon chairman Jeff Bezos is proud enough to <a href=\"https://twitter.com/JeffBezos/status/1490711280503562243\">present the ad himself</a> via Twitter. The former CEO starred in the <a href=\"https://www.theverge.com/2018/1/31/16954704/amazon-super-bowl-ad-alexa-cardi-b-anthony-hopkins-commerical-gordon-ramsey-rebel-wilson\">2018 Super Bowl Amazon ad</a> alongside celebrities like Cardi B and Gordan Ramsay, taking customer queries and responding outrageously.</p><p id=\"x0cyy2\">If you want to avoid letting Alexa toggle settings based on its own judgment, you can <a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=G63YSH7WU32D9GW9\">turn Hunches off</a> entirely by telling Alexa, “Turn off Hunches.” Or, in the Alexa app, go to the settings for Hunches (More &gt; Settings &gt; Hunches), where you can also choose whether or not the system takes action to automatically control smart devices like your lights or <a href=\"https://www.theverge.com/22791333/amazon-smart-thermostat-review-learning-geofencing-hunches\">thermostat</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0-B7Ep8yLJ2MS_f7AaGeJpldV3c=/0x60:3057x1661/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23225162/Screen_Shot_2022_02_07_at_2.31.03_PM__1_.jpeg",
  "description": "Alexa knows Scarlett Johansson lied",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}