{
  "title": "Amazon will let merchants sell goods with Prime benefits on their own sites",
  "url": "https://www.theverge.com/2022/4/21/23035192/amazon-buy-with-prime-initiative-shipping-benefits",
  "date": "2022-04-21T10:19:45.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/22Tyb1S0CoucYJR2dLFQwd24vrg=/18x0:1583x1043/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70775082/amazon_buy_with_prime.0.jpg\" />        <figcaption><em>Amazon’s Buy With Prime initiative lets merchants offer Prime shipping benefits on their own stores. </em> | Image: Amazon</figcaption>    </figure>  <p id=\"FLRxg2\">Amazon has announced a <a href=\"https://press.aboutamazon.com/news-releases/news-release-details/amazon-unveils-buy-prime-expanding-prime-shopping-benefits\">new initiative named Buy With Prime</a> that extends the purview of its Prime subscription service beyond the bounds of <a href=\"http://Amazon.com\">Amazon.com</a> — a significant change to its business strategy that could help it compete with fast-growing rival Shopify. </p><p id=\"GM2kFs\">Merchants who ship products using Amazon’s warehouse and delivery services (known as Fulfillment by Amazon) will be able to add Buy With Prime buttons to their sites. This will let Prime subscribers buy from these stores directly while retaining the benefits of Amazon’s subscription service. Namely: free shipping, next-day delivery, and free returns. </p><p id=\"InFGig\">Buy With Prime will offer extra convenience and value to Prime subscribers, but its importance to Amazon is about more than bringing in additional Prime revenue. The launch of Buy With Prime is also an expansion of the company’s sizable footprint in the logistics sector (the business of actually moving physical items about) and a way to head off rival e-commerce platform Shopify (which lets merchants quickly build their own storefronts).</p><div class=\"c-float-right\"><aside id=\"nabrbK\"><q>Amazon doesn’t have a great reputation with merchants</q></aside></div><p id=\"wtpuWZ\">A common complaint levied against Amazon by merchants is that it tightly controls their relationships with customers. If you sell your products on <a href=\"http://Amazon.com\">Amazon.com</a>, you get the benefit of setting out your wares in one of the internet’s biggest shopfronts, with schemes like Fulfillment by Amazon and Amazon Prime making delivery easier and faster for both you and your customers. But you also get Amazon looking over your shoulder, collecting data on what you sell, with the threat that it will clone your product and put you out of business. (Pretty much what the company is accused of doing in various <a href=\"https://www.theverge.com/2020/11/10/21558119/amazon-european-union-antitrust-charges-competition-commission-margrethe-vestager\">antitrust lawsuits</a>.)</p><p id=\"RhIrWr\">This is why Shopify <a href=\"https://www.theguardian.com/technology/2020/jun/14/shopify-the-good-shop-to-amazons-bad-shop\">has done so well against Amazon</a>. It doesn’t have its own marketplace for buyers (you don’t go to <a href=\"http://Shopify.com\">Shopify.com</a> to buy toilet roll and curtain rails), but instead offers small and medium-sized businesses tools to quickly set up their own shops, while replicating, in theory, the ease and simplicity of the Amazon shopping experience. </p><p id=\"4sZXRP\">However, by offering Prime benefits on merchants’ own sites, Amazon is loosening its grip somewhat on that customer relationship, potentially easing tensions with merchants. As one Amazon executives stresses in <a href=\"https://press.aboutamazon.com/news-releases/news-release-details/amazon-unveils-buy-prime-expanding-prime-shopping-benefits\">the blog post announcing the initiative</a>: “Allowing merchants to offer Prime shopping benefits on their own direct-to-consumer online stores is an exciting next step in our mission to help merchants of all sizes grow their business.”  </p><p id=\"4aAaf1\">Those benefits don’t come for free, though, and Amazon will charge merchants various undisclosed fees to offer Buy With Prime buttons on their sites. “With no fixed subscription fee or long-term contract required, merchants can expand selection or cancel at any time,” says Amazon.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3LNLOGUpKqXQaZrQ_x9cljrdafI=/0x103:1600x941/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23405816/amazon_buy_with_prime.jpg",
  "description": "Prime subscriptions benefits are moving beyond Amazon.com",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}