{
  "title": "Amazon is still struggling to make drone deliveries work",
  "url": "https://www.theverge.com/2022/4/11/23020549/amazon-struggling-drone-deliveries-prime-air-bezos",
  "date": "2022-04-11T23:29:20.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/k4FdAVBTTIvn0Wz5K-ySN38uDLo=/3x0:2109x1404/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70737613/Screen_Shot_2021_08_03_at_11.54.11_AM.0.png\" />        <figcaption>Image: Amazon</figcaption>    </figure>  <p id=\"S2aNM3\">A report from <a href=\"https://www.bloomberg.com/news/features/2022-04-10/amazon-drone-crashes-delays-put-bezos-s-delivery-dream-at-risk\"><em>Bloomberg</em></a> details the obstacles hampering Amazon’s efforts to get its delivery drone program off the ground, citing a high employee turnover rate and potential safety risks.</p><p id=\"uggr5S\">According to <em>Bloomberg</em>, there were five crashes over the course of a four-month period at the company’s testing site in Pendleton, Oregon. A crash in May took place after a drone lost its propeller, but <em>Bloomberg </em>says Amazon cleaned up the wreckage before the Federal Aviation Administration could investigate. Amazon spokesperson Av Zammit disputed this, saying that Amazon followed orders it received from the National Transportation Safety Board (NTSB) to document the event and move the drone.</p><p id=\"Jtcb8m\">The following month, a drone’s motor shut off as it switched from an upward flight path to flying straight ahead. Two safety features — one that’s supposed to land the drone in this type of situation and another that stabilizes the drone — both failed. As a result, the drone flipped upside down and dropped from 160 feet in the air, leading to a brush fire that stretched across 25 acres. It was later put out by the local fire department.</p><p id=\"dsJp4t\">“Instead of a controlled descent to a safe landing, [the drone] dropped about 160 feet in an uncontrolled vertical fall and was consumed by fire,” the FAA said in a report of the incident obtained by <em>Bloomberg</em>.</p><div class=\"c-float-right\"><aside id=\"CCKDaZ\"><q>“They were more concerned about pumping flights out and didn’t want to slow down”</q></aside></div><p id=\"CE1Wmp\">Former Amazon CEO Jeff Bezos <a href=\"https://www.theverge.com/2013/12/1/5164340/delivery-drones-are-coming-jeff-bezos-previews-half-hour-shipping\">first announced 30-minute drone deliveries</a> in 2013, and almost 10 years later, we still don’t have drones delivering Amazon packages to our doorsteps. In 2019, the company previewed <a href=\"https://www.theverge.com/2019/6/5/18654044/amazon-prime-air-delivery-drone-new-design-safety-transforming-flight-video\">a redesign of its Prime Air delivery drone</a> that has the ability to fly vertically and hinted at launching drone deliveries later that year — a promise that went unfulfilled. One year later, Amazon <a href=\"https://www.theverge.com/2020/8/31/21408646/amazon-prime-air-drone-delivery-faa-clearance-approval-health-safety-alphabet-wing\">announced FAA approval</a> for the company to operate as a drone airline in 2020, which Amazon’s vice president of Prime Air said was “an important step forward for Prime Air.”</p><p id=\"CNJZLh\">Last year, a <a href=\"https://www.wired.co.uk/article/amazon-drone-delivery-prime-air\"><em>Wired</em></a><em> </em>report revealed that <a href=\"https://www.theverge.com/2021/8/3/22607267/amazon-drone-delivery-program-uk-operations-failure-oversell\">Amazon’s drone delivery operation is struggling just as much in the UK</a>, despite <a href=\"https://www.theverge.com/2016/12/14/13952240/amazon-drone-delivery-launch-uk\">making its first-ever drone delivery near Cambridge in 2016</a>. <em>Wired’s</em> report suggests that the UK outfit is marred by some of the same issues described by <em>Bloomberg</em>, including a high turnover rate and potential safety issues. At a UK-based facility for analyzing drone footage for people and animals, one worker reportedly drank beer on the job, while <em>Wired</em> said another held down the “approve” button on their computer regardless of whether there were hazards in the footage or not.</p><p id=\"v99xSI\">In a statement to <em>The Verge</em>, Zammit said the NTSB never classified any of Amazon’s flight tests as an accident, as they didn’t result in any injuries or put structures at risk.</p><p id=\"zvXvgh\">“Safety is our top priority,” Zammit said. “We use a closed, private facility to test our systems up to their limits and beyond. With rigorous testing like this, we expect these types of events to occur, and we apply the learnings from each flight towards improving safety. No one has ever been injured or harmed as a result of these flights, and each test is done in compliance with all applicable regulations.”</p><aside id=\"ZRz4Xj\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Delivery drones are coming: Jeff Bezos promises half-hour shipping with Amazon Prime Air\",\"url\":\"https://www.theverge.com/2013/12/1/5164340/delivery-drones-are-coming-jeff-bezos-previews-half-hour-shipping\"},{\"title\":\"Here’s Amazon’s new transforming Prime Air delivery drone \",\"url\":\"https://www.theverge.com/2019/6/5/18654044/amazon-prime-air-delivery-drone-new-design-safety-transforming-flight-video\"},{\"title\":\"Amazon’s drone delivery program ‘one gigantic oversell,’ says report into UK operation\",\"url\":\"https://www.theverge.com/2021/8/3/22607267/amazon-drone-delivery-program-uk-operations-failure-oversell\"}]}'></div></aside><p id=\"Guugqp\">Former and current employees at Amazon also told <em>Bloomberg</em> that the company is prioritizing the rushed rollout of its drone program over safety. Cheddi Skeete, a former drone project manager at Amazon, said he was fired last month for speaking with his manager about his safety concerns. Skeete told <em>Bloomberg</em> that he was reluctant to continue testing a drone that had crashed five days previously but was told the team had inspected 180 engines on 30 different drones — Skeete doubted this assertion, as checking the motors is a cumbersome process, <em>Bloomberg</em> reports.</p><p id=\"avnOqL\">“We take safety reporting seriously — we have a safety reporting system that’s well-known by all our team members, and we encourage them to raise any safety suggestions and concerns,” Zammit told <em>The Verge</em>. “In addition to using this system, we encourage employees to provide any other feedback they may have through their manager, HR, or our leadership team.”</p><p id=\"w8Y0LI\">David Johnson, a former drone flight assistant for Amazon, told <em>Bloomberg</em> that Amazon would sometimes perform tests “without a full flight team” and with “inadequate equipment.” Johnson also said the company often assigned multiple roles to one person, a claim <em>Bloomberg</em> says is corroborated by two other former Amazon employees. </p><p id=\"g3psq7\">“They give people multiple things to do in a very narrow window of time to try to boost their numbers, and people cut corners,” Johnson told <em>Bloomberg</em>. “They were more concerned about pumping flights out and didn’t want to slow down.”</p><p id=\"nwpOeX\">Zammit denied Johnson’s claims, stating: “Crew members are assigned to only one role per flight. Before each flight test, crew members are briefed on their individual role,” Zammit explained. We do not set time limits for completion of any aspect of our flight tests, and our team can take their time to complete their roles safely.”</p><p id=\"q89X4k\"><em><strong>Correction April 11th 7:28PM ET: </strong></em><em>A previous version of the article described a drone’s descent as “fiery”  when it caught fire when it landed. We regret the error.</em></p><p id=\"YPoUvv\"><em><strong>Update April 11th 7:28PM ET: </strong></em><em>Added additional context surrounding Amazon’s response to a drone crash and added an additional statement from Av Zammit.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VnQRypTW4me_NebaVGGMCsNNjYw=/0x149:2112x1255/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22758042/Screen_Shot_2021_08_03_at_11.54.11_AM.png",
  "description": "High turnover and safety issues are hurting Amazon’s drone program.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}