{
  "title": "Amazon’s Outer Range brings the weird fiction mindset to Westerns",
  "url": "https://www.theverge.com/23057187/outer-range-season-1-review-amazon-prime-video",
  "date": "2022-05-05T15:30:00.000Z",
  "author": "Tauriq Moosa",
  "content": "      <figure>      <img alt=\"outer range\" src=\"https://cdn.vox-cdn.com/thumbor/0tlB1oSY_q2Wz4AxDh1-_ZX0zys=/0x1:700x468/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70835644/RNGE_S1_UT_103_210405_FORRIC_00430RC_thumb.0.jpg\" />        <figcaption>Josh Brolin in <em>Outer Range</em>. | Image: Richard Foreman/Amazon Prime Video</figcaption>    </figure>  <p>A show about cowboys, small town drama, and one big hole</p> <p class=\"p--has-dropcap\" id=\"Qd5HGA\">When characters realize the world they know is in fact “something else,” they have permanently crossed a threshold. The thin membrane they might otherwise call normality has been punctured, and the air of stability drains out. There is some attempt to clutch their worlds close, to grab something pinned down. But it is, inevitably, too late: there is no putting <em>normal</em> back when it never existed in the first place.  </p><p id=\"mi6RFN\">Almost<em> </em>all fiction involves characters trying to fix or improve their world. But only one genre targets literally the world, the universe and existence: “weird fiction” or “new weird fiction.” This genre involves stories about the everyday, the normal, being infused with an otherworldy, abnormal, strange aspect at its core that reverberates to conclude <em>nothing</em> is as it seems. The realization unravels everything around the object or space, taking in the world and, therefore, the characters. </p><p id=\"9vanOw\">A modern classic is <a href=\"https://www.theverge.com/2018/2/28/17060210/annihilation-alex-garland-film-novel-book-biggest-differences\">Jeff VanderMeer’s <em>Annihilation</em></a>, about a bordered off coastal area called “Area X” that threatens the whole world (it moves, see?). Caitlín R. Kiernan pits bureaucracy against otherworldliness that calls out to Earth in her <em>Agents of Dreamland. </em>Mark Z Danielewski’s <em>House of Leaves</em> is about what happens when the borders of your home actually expand into parts of the world or universe that shouldn’t exist. H.P. Lovecraft’s characters realized they were insignificant entities in a universe ruled by unfathomable eldritch entities. David Lynch and Mark Frost’s <em>Twin Peaks </em>slowly stripped the reality of small-town America into a cosmically nightmarish place. N.K. Jemisin pushes the boundaries of what cities are in <em>The City We Became</em>.  </p><p id=\"A9FLpw\">In essence, the (new) weird is about infusing what we take for granted and showing how, at its very essence, that which is normal is, in fact, not. When you can’t trust a house to be a house, how can you trust reality to be true? </p><p id=\"YfWZSa\">In Amazon’s new series <em>Outer Range</em>, the threat to normalcy is much more simple: a gigantic hole. This mysterious, seemingly bottomless hole emits strange noises and vapors. Set in a modern-day Wyoming cattle ranch (led by Josh Brolin’s patriarchal Royal Abbott), Brian Watkin’s neo-Western creep-fiction seems to be what happens when <em>Dallas</em> meets David Lynch. </p><p id=\"hBj7ah\">The season’s penultimate episode and finale drop on May 6th. And a lot has happened to get us there.</p><div class=\"c-wide-block\"><div id=\"h6cnZ6\"><div ><iframe src=\"https://www.youtube.com/embed/3MzAFrTEWSQ?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"1Wv6mt\">The troubles of a modern cowboy town, with missing wives, bar fights, and the first gay (acting) sheriff, becomes literally punctured by a creepy hole on a ranch owned by a family called the Abbotts. This is the “weird” — embodied in a loud void. It’s a negative space, one that has carved itself suddenly into the world as the characters have always known it.  </p><p id=\"j1T9tn\">But the void is not the only new weird entity to appear in the town: Imogen Poots’ Autumn Rivers (an intentionally ridiculous name for an unintentionally ridiculous character) is a mysterious hippie-ish drifter who arrives at the same time as the void, wanting to camp on the Abbotts’ ranch. Like the void, Autumn starts to insert herself into the Abbotts’ lives, ruining, upsetting, and generally refusing to leave the family alone. Autumn appears to be deliberately written, so it feels like even we, the audience, are in a closed room with a gnat. Her relentless presence, her refusal to go away, mirrors the realization characters suffer when confronted with the harsh truth that reality is inherently broken: once seen, it cannot be escaped.</p><div class=\"c-float-right c-float-hang\"><aside id=\"nn0VxS\"><q><em>Outer Range</em> is doing for <em>Dallas</em> what <em>Severance</em> has done for <em>Office Space</em></q></aside></div><p id=\"l8elUV\">Both the void and Autumn become splinters in the Abbotts’ lives, digging into the membrane of their normality. Old wounds rise to the surface, that which was once thought buried re-emerges, and ghosts from other times and places are glimpsed from the corner of eyes and memories. </p><p id=\"lb5xe4\">Despite not understanding it, Royal incorporates the void into his life. It becomes a hiding spot, a dumping ground and, with some intervention from Autumn, a portal to… somewhere else. But just because it’s being used does not mean that it is understood.  </p><p id=\"gk00cS\">Royal discovers the earth (as in the very ground) itself is not what it seems, that the void perhaps alters times or is a portal to a dimension, one that perhaps operates both ways.  Characters’ attempt to balance and hold on to their world in the teeth of this gnashing cosmic displacement puts <em>Outer Range</em> somewhere within the broad tent of the weird genre. </p><p id=\"BW8ewA\"><em>Outer Range</em> is doing for <em>Dallas</em> what <a href=\"https://www.theverge.com/23015650/severance-season-1-review-apple-tv-plus\"><em>Severance</em> has done for <em>Office Space</em></a>: inserting the weird, the uncomfortable, the strange into a familiar genre. Just as audiences are familiar with soap operas involving cowboys or films about corporate drudgery, so, too, are the characters themselves comfortable with their world and realities. Yet, by adding some weird element, such shows upend what we and the characters know. We are along for the ride because there’s no telling where this will go, what this means for the world and the reality we / they initially thought we / they knew. The weird genre works because the storytelling is not about solving a mystery or defeating a big bad, it’s that we suffer along with the characters in having an existential crisis. Like (other) horror, it’s enjoyable because the crises we suffer are, at least, contained within the four corners of the show. </p><p id=\"C8wtbW\"><em>Outer Range</em> is enjoyable not just because it’s mysterious, well-written, and beautifully shot with stunning sound design. It’s enjoyable because it gives you permission to suffer the pain of insignificance, the horror of sudden ignorance but, unlike the characters, come out the other end. Everything is inherently… wrong. While there might be answers — and certainly the show is not shy with giving us <em>some</em> answers faster than I expected — the ride is more enjoyable. Nothing will put the membrane of normality back. We, like the characters, are in for nothing but bitter displacement of the ground we walk on.</p>  <figure class=\"e-image\">        <img alt=\"outer range\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YLHW9IToFMVL69Rij54YNDfLYdI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23439982/RNGE_S1_UT_108_210722_FORRIC_00307RC_thumb.jpg\">      <cite>Image: Richard Foreman/Prime Video</cite>      <figcaption><em>Imogen Poots in </em>Outer Range<em>.</em></figcaption>  </figure><p id=\"BsvBup\">Focusing on the unsettling emotional journey, rather than plot details, is central to the weird. You will never get proper, definitive answers. This is not because of some poor plotting like <em>Lost</em>, but because “answers” in such stories are inherently impenetrable. What designs do Lovecraft’s <em>Eldritch</em> gods have? Why is Daniewleski’s house on Ash Tree Lane infinitely complex and unconstrained by space and time? What is Judy in <em>Twin Peaks</em>? </p><p id=\"MVRErv\">But such stories begin with the premise that everything is broken, that truth leads to “madness,” that our bitter brains are too simple to understand. With that premise, answers will never solidify. The membrane that held it all together is gone. </p><p id=\"79i3os\">And, as some horror writers love to note, leaving it up to audience imagination is often a worse curse than providing an answer (there are <a href=\"https://www.tor.com/2017/10/04/the-great-stephen-king-reread-revival/\">exceptions</a>). I’m not watching <em>Outer Range</em> to obtain answers: I’m putting it firmly within the confines of a managed existential crisis, traveling alongside Josh Brolin as he navigates his universe crumbling — sometimes literally — around him. </p><p class=\"c-end-para\" id=\"SVetL0\">Stories do not have to give answers — or at least concrete answers — that fit like a missing puzzle piece. And this is a genre that is not, I would argue, designed for answers but the experience. We already have Poirots and Marples: it’s time now for more voids and cosmic crises. Bring on the roiling blackness.  </p><p id=\"q9RBNu\"><small>Outer Range </small><small><em>is streaming on Amazon Prime Video.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/j7GnSXYCkq84tTnDSUA1Tpq9cpo=/0x54:700x420/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23439977/RNGE_S1_UT_103_210405_FORRIC_00430RC_thumb.jpg",
  "description": "The end is near.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}