{
  "title": "AMD says its framerate-boosting FSR 2.0 is also headed to Xbox and these Nvidia graphics cards",
  "url": "https://www.theverge.com/2022/3/23/22993152/amd-fsr-2-0-xbox-nvidia-gpus",
  "date": "2022-03-23T18:39:22.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6pGxOQw510i2XUFsnM5_IkbUvzY=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70662806/AMD_FSR_2_Temporal_Upscaling_Diagram_v2__1080p.0.jpg\" />    </figure>  <p id=\"Dg4l0G\"><a href=\"https://www.theverge.com/2022/3/17/22982473/amd-radeon-steam-deck-features-super-resolution-fsr-2-0\">Last week</a>, AMD promised a new technology that should let you blow up your games to higher resolutions or increase their framerates without requiring the fancy machine learning hardware of Nvidia’s GPUs like Nvidia’s lauded DLSS. Now at GDC 2022, it’s revealing how the new FidelityFX Super Resolution 2.0 actually works — and that it’s coming to Microsoft’s Xbox game consoles too. </p><p id=\"3FEGeh\">While AMD says it can’t actually say when Xbox game developers might take advantage of FSR 2.0, it says it “will also be fully supported on Xbox and will be available in the Xbox GDK for registered developers to use in their games.” </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VChgALyxpaNrPAWE-CYNB1MBkPo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23340151/AMD_FSR_2_Temporal_Upscaling_Diagram_v2__1080p.jpg\">  </figure><p id=\"Cnp1C9\">And it’s also giving the community a list of both AMD <em>and Nvidia</em> GPUs where you can expect FSR 2.0 to run — if you’ve got an Nvidia GeForce RTX 1070 or higher, the company suggests, you might be able to take advantage of FSR 2.0 at least on a 1080p monitor, the same way you with an AMD Radeon RX 590, RX 6500 XT or higher. </p><p id=\"BVfZvE\">What we’ve been wondering since day one is: what’s the catch? How can AMD nearly double the framerate of a demanding game like <em>Deathloop, </em>at a 4K-equivalent resolution with the kind of image quality it showed us last week, all without dedicated machine learning cores like Nvidia’s DLSS?  </p><p id=\"2lTE2W\">The answer is complicated, but a short version is that it <em>can’t</em> unless you have a relatively powerful graphics card to begin with.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lLFFIs8t0TTcquT56JxlxS85T-0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23340218/fsr_hardware.jpg\">  </figure><p id=\"muizY8\">While the FSR 2.0 algorithm is remarkably fast — under 1.5ms in all of AMD’s examples — it still takes time to run, and it takes more time on lower-end GPUs where AMD freely admits that some of its optimizations don’t work quite as well. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yCBEf8luy0eibRJJQMPXTPn2svM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23340231/fsr_performance_mode_timing.jpg\">  </figure><p id=\"rgpljg\">In that under 1.5ms period, FSR 2.0 does all sorts of things, though — AMD says it replaces a full temporal anti-aliasing pass (getting rid of a bunch of your game’s jagged edges) by calculating motion vectors; reprojecting frames to cancel out jitter; creating “disocclusion mask” that compare one frame to the next to see what did and didn’t move so it can cancel out ghosting effects; locking thin features in place like the barely-visible edges of staircases and thin wires; keeping colors from drifting; and sharpening the whole image, among other techniques.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/O61I1Z1Kh3klshb3ZXTx_OjmzCY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23340245/thin_features.jpg\">  </figure><p id=\"WBaOPU\">Unlike FSR 1.0, this requires some work on the part of the game developer, so it’s not something you’re going to see every game developer take advantage of — but AMD confirms that both <em>Deathloop</em> and <em>Forspoken</em> (a tech showcase <a href=\"https://www.theverge.com/2022/3/14/22978223/microsoft-directstorage-api-xbox-velocity-windows-pc-nvme-load-times\">that’s also going to use Microsoft’s DirectStorage</a>) will take advantage of it.</p><p id=\"DmpEqd\">AMD says games that already support Nvidia’s DLSS should be easy to set up, though, with just a few days of work to integrate, and that games running on Unreal Engine 4 and Unreal Engine 5 will have a plugin to make it work. Games that already use temporal anti-aliasing also have a development advantage. But if a developer hasn’t built their game with some of these things in mind, AMD says it could take four or more weeks of work.</p><p id=\"k9TQgi\">We’re still waiting to try out FSR 2.0 for ourselves to see how it actually looks in motion, but should developers take advantage, the quality looks to be far better than FSR 1.0.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VvuORaHQwvMVLTFxUKvMYAGfheY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23340275/221371852_A_EN_AMD_FSR_2_Deathloop_GDC_comparison_4K_native_vs_Quality_mode_image_v2.jpg\">  </figure>",
  "image": "https://cdn.vox-cdn.com/thumbor/G716VUXFo_PQ9Zr6pUi0nu1MI7I=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340150/AMD_FSR_2_Temporal_Upscaling_Diagram_v2__1080p.jpg",
  "description": "AMD’s new answer to DLSS might be \"demanding,\" though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}