{
  "title": "AMD promises ‘extreme gaming laptops’ in 2023 with new Dragon Range CPU",
  "url": "https://www.theverge.com/2022/5/3/23056024/amd-dragon-range-zen-4-extreme-gaming-laptop-cpu-ryzen",
  "date": "2022-05-03T23:06:23.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_3bkq7NaOyEgHb5KLrHPBCh9AYs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70829080/akrales_170508_1666_0071.0.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The verge</figcaption>    </figure>  <p id=\"kY4x52\">A funny thing happened in 2020: AMD won the gaming laptop for the first time ever. Until <a href=\"https://www.theverge.com/2020/3/30/21197761/asus-rog-zephyrus-g14-review-gaming-laptop-specs-features-price\">the Asus Zephyrus G14</a>, we’d never seen a laptop with an AMD CPU and AMD GPU run circles around the competition. Since then, we’ve repeatedly seen that “AMD laptop” no longer <a href=\"https://www.theverge.com/2012/6/13/3081671/amd-mountain\">means cheap</a>. But now, AMD is setting its sights higher than mid-range gaming machines — it just revealed it’s building a new CPU aimed at the “pinnacle of gaming performance” with the “highest core, thread and cache ever”. </p><p id=\"9U8THw\">The new CPU line is codenamed “Dragon Range,” and they’ll live exclusively at 55W TDP and up — enough power that they’ll “largely exist in the space where gaming laptops are plugged in the majority of the time,” says AMD director of technical marketing Robert Hallock. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ClvMrwS335P2ds5HDjOVbhOGy4s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23436353/amd_dragon_range.jpg\">      <cite>Slide: AMD</cite>  </figure><p id=\"v42Xtu\">The slide above shows they’re aimed at laptops that are at least 20mm (0.78-inches) thick, while the 35-45W “Phoenix” line are aimed at machines thinner than that same mark. Both are <a href=\"https://www.theverge.com/2022/1/4/22856151/amd-ryzen-7000-desktop-cpu-5nm-next-gen-zen-4-release-date-ces-2022\">part of the same AMD Ryzen 7000 series</a>, based on the same Zen 4 architecture, and unfortunately, it appears both won’t arrive until 2023 — Zen 4 will begin its life as the desktop exclusive “Raphael” later this year, according to the chart.</p><p id=\"mt9lDI\">AMD says that Dragon Range will take up the “HS” suffix for CPUs — the same as the Ryzen 9 4900HS that impressed us at 35W in that 2020 Asus Zephyrus — but hinted that we shouldn’t take the higher TDP as a sign that they’ll totally be ditching power efficiency for performance. They’re estimated to be “notably more power efficient than other laptops in that competing timeframe,” says Hallock. </p><p id=\"68SOcU\">AMD wouldn’t provide more details today, and it’s not clear what the new CPUs might bring to the table that gaming laptops necessarily <em>need</em>, given that graphics chips, not CPUs, are generally where most of the gaming oomph comes from these days. Still, CPU speed does matter, particularly when you’re trying to feed a high refresh rate monitor (which <a href=\"https://www.theverge.com/2022/1/31/22911067/boe-500-hz-gaming-monitor-high-refresh-rate\">may soon go up to 500Hz</a>) with lower-resolution frames — and the kind of gamer who buys an “extreme gaming laptop” might care about even a slight advantage in FPS.</p><p id=\"MbY9Bb\">Hallock says the new chips are an opportunity the company thought it could pursue alongside thin-and-light gaming. “The performance per watt story you’ve been hearing from us will continue into the future as well,” he says.</p><p id=\"MfE2pq\">AMD also told journalists today that, starting next quarter, it will break out gaming into its own financial segment, with revenue from semi-custom parts like PlayStation, Xbox, and Steam Deck chips joining desktop and laptop Radeon graphics — all part of a single gaming business. It sounds like Ryzen may not be part of that segment though, but rather a “Client” one: the company will explain more at an analyst day in June.</p><aside id=\"8LihxY\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Everything you need to know about 2022’s biggest chips\",\"url\":\"https://www.theverge.com/2022/1/11/22878059/chips-processors-cpu-gpu-2022-intel-amd-nvidia-qualcomm-apple-arm-x86\"},{\"title\":\"Intel looks on track to fix its core problems\",\"url\":\"https://www.theverge.com/2022/3/23/22992681/intel-ceo-pat-gelsinger-semiconductor-processor-strategy-idm-2-0-one-year\"},{\"title\":\"Nvidia and AMD GPUs are returning to shelves and prices are finally falling\",\"url\":\"https://www.theverge.com/2022/4/19/23031309/nvidia-amd-gpu-price-in-stock-retail-ebay\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/LrTTJit9hK7EptIbGaQhQrUrN6A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8521401/akrales_170508_1666_0071.0.jpg",
  "description": "The \"highest core, thread and cache ever\".",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}