{
  "title": "Ampler now offers five e-bikes for all types of riders",
  "url": "https://www.theverge.com/2022/3/7/22965188/ampler-axel-juna-curt-electric-bike-range-price-date",
  "date": "2022-03-07T15:00:00.000Z",
  "author": "Thomas Ricker",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/V6u8_JTWzFmovMA-yFUMbVXp_vQ=/0x80:1920x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70588786/Axel_AmplerBCN_CG_061.0.jpeg\" />        <figcaption><em>The all new Ampler Axel.</em> | Image: Ampler</figcaption>    </figure>  <p id=\"QafiZI\">Ampler is back with two all-new pedal-assisted electric bikes — the <a href=\"https://amplerbikes.com\">Juna and Axel</a> — that join updated versions of the company’s Curt, Stout, and Stellar. The five-strong lineup of relatively lightweight e-bikes offers something for everyone in a bid to appeal to all types of riders, of varying sizes and tastes, with designs that look like regular bicycles thanks to batteries integrated neatly into the downtubes.</p><p id=\"JimywC\">I saw each of the new Amplers at a private event in the company’s new Amsterdam showroom and service center. Each e-bike — from the sporty Curt and Axel to the relaxed Juna and Stellar step-throughs to the sturdy Stout — expresses a maturity in form and function that you’d expect from a company that helped pioneer the electrification of desirable city and commuter bikes.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WcIqRf8Sr9YlYkad62VkRkC8OGY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23294616/FQ0Ba8G.png\">      <cite>Image: Ampler</cite>      <figcaption><em>Ampler adds Juna and Axel models to the updated Curt, Stout, and Stellar.</em></figcaption>  </figure><p id=\"WQr3Y9\">“We call it the second generation because almost everything is new, including fully in-house developed frames and electronics systems built to deliver the full Ampler experience,” says Ampler CEO and co-founder Ardo Kaurit in a press release. “It is our passion to create electric bikes that serve the urban commuters — bikes that are exciting, long-lasting, safe and built responsibly. I believe we made a big leap towards our goal with the new generation.” </p><div id=\"mSBuB3\"><div ><iframe src=\"https://www.youtube.com/embed/BrczL5pteyU?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"jIjyxS\">Estonia-based Ampler was formed back in 2014 by three friends: a professional motocross racer, an engineer, and a bike designer. <a href=\"https://www.theverge.com/2016/5/3/11567214/ampler-review-hawk-electric-bike\">The company shot out the gate in 2016</a> with a trio of attractive e-bikes at a time when the category was dominated by hulking, bolt-on battery designs primarily ridden by the aged. Now Ampler employs over 140 people and has shipped over 15,000 e-bikes. It recently secured <a href=\"https://www.businesswire.com/news/home/20211101005635/en/Ampler-E-bikes-Raises-7.4-M-%E2%82%AC-to-Support-Its-Expansion-Plans\">millions in new investment</a> to expand European operations and build a new factory in its home city of Tallinn while extending its showrooms beyond Tallinn, Berlin, and Cologne to new facilities in Amsterdam and Zurich.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WEX6YzdHyzKbGkfqWDS8lALm_j4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23294621/Axel_AmplerBCN_CG_075.jpeg\">      <cite>Image: Ampler</cite>      <figcaption><em>All Ampler e-bikes are now fitted with a new integrated display.</em></figcaption>  </figure><p id=\"zju2fM\">The upright and relaxed Juna (16.5kg / 36 pounds 6 ounces) can accommodate shorter riders starting at 150cm (4 feet 11 inches), while the Axel (16.3kg / 35 pounds 15 ounces) is suitable for riders up to 200cm tall (6 feet 7 inches). Juna and Axel are fitted with single-speed Gates belt drives and feature 27.5in rims and wide 50mm puncture-proof tires that should soak up bumps while supporting heavy loads.</p><p id=\"NbkTsm\">All five Ampler models are now fitted with Bluetooth, GSM, and GPS for theft protection and remote access within Ampler’s refined app, improved cable routing, torque sensors for natural power assist, bright front lights from Busch &amp; Müller, integrated brake lights in the rear fenders (except Curt, which keeps the rear light in the seat post), new integrated displays on the top tubes, and a more conveniently located power button beneath the top tube. </p><p id=\"V8UWTH\">The e-bikes are powered by 250W rear-hub motors developed in-house by Ampler and 48V 336Wh batteries that charge from zero to full in 2.5 hours. Combined, they yield a top speed of 25km/h (per European law) and a range from 50 to 100km, with 70km the stated average, according to Ampler. The integrated battery is not user-removable but can be removed for service, and the bikes lack the throttles popular on faster e-bikes in the US.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OWg5wsOSDupKilMInux-mMauhPk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23294618/OAnlvPn.png\">      <cite>Image: Ampler</cite>      <figcaption><em>The updated Ampler Curt.</em></figcaption>  </figure><p id=\"OQRSMj\">The <a href=\"https://www.theverge.com/2018/9/6/17817064/ampler-curt-electric-bike-review\">Ampler Curt remains one of my favorite e-bikes</a> from any manufacturer. At just 14.4kg (almost 32 pounds), the new Curt is still one of, if not <em>the</em> lightest fully-equipped (lighting, fenders, kickstand) e-bikes available anywhere. Its aggressive geometry can be too uncomfortable for some, though.</p><p id=\"jgVubL\">The all-new Axel is the model I’m most intrigued by as a city / commuter e-bike. It features a reasonably sporty geometry with a low-maintenance belt drive. It also comes standard with fenders, integrated lighting, and a kickstand making it suitable for use as an all-weather city bike for running family errands or a commuter bike that can move riders to a far away office without breaking a sweat. It’s also the model I’ll be reviewing in bicycle-obsessed Amsterdam over the coming weeks — so stay tuned.</p><p id=\"BudEw2\">The Ampler Juna and Axel are available now for €2,590 / £2,490. Availability for the updated Curt will be announced next week alongside the Stout and Stellar models. Ampler’s bikes aren’t cheap, but the company’s also not going to nickel-and-dime you to death with subscription adds-ons like some e-bike makers.</p><p id=\"lzz7nz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qdOacEbaHKSj2wcjdogyRMR9vxc=/0x218:1920x1223/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23294620/Axel_AmplerBCN_CG_061.jpeg",
  "description": "Five e-bikes offer something for everyone.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}