{
  "title": "An official NFL game is coming to Meta Quest and PSVR",
  "url": "https://www.theverge.com/2022/3/23/22992203/official-nfl-vr-game-statuspro-announced",
  "date": "2022-03-23T12:00:00.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"New York Jets v Cleveland Browns\" src=\"https://cdn.vox-cdn.com/thumbor/FGqMbqX9oZqJnTmxx_0XqAlln1g=/0x22:3418x2301/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70660643/619280574.0.jpg\" />        <figcaption>Photo by Jason Miller/Getty Images</figcaption>    </figure>  <p id=\"XOrD6F\">The National Football League is stepping into virtual reality with the announcement of a new official VR game. It will be developed in partnership with sports technology company StatusPro, which makes use of player data for an AR training tool already used by NFL teams. The plan is for the game to become an annual series, like EA’s <em>Madden</em> series.</p><p id=\"JccAEW\">There aren’t many details on the game itself, including what it’ll be called or when it’ll be available. The NFL’s press release describes it as a first-person simulation gaming title that will be released on Meta Quest and PlayStation VR. (No word on whether that means <a href=\"https://www.theverge.com/2022/2/22/21437559/sony-playstation-vr2-psvr-announcement-design-reveal\">PSVR2</a>.)</p><div class=\"c-float-right\"><aside id=\"UQPyVO\"><q>“We are seeing a growing number of fans engaging with VR.”</q></aside></div><p id=\"U3t7VI\">There are other VR football games already available, like the cartoony <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=43993&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.oculus.com%2Fexperiences%2Fquest%2F2592096760842149%2F\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><em>2MD: VR Football Unleashed</em></a> and a <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=43993&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.oculus.com%2Fexperiences%2Fquest%2F5068085479875775\" rel=\"sponsored nofollow noopener\" target=\"_blank\">licensed title</a> featuring Kansas City Chiefs’ star quarterback Patrick Mahomes, but it sounds like the NFL’s focus will be on authenticity for the new project. “We are seeing a growing number of fans engaging with VR and we’re excited to launch the first-ever VR gaming title that complements our existing offerings in the market today,” says the league’s SVP of consumer products Joe Ruggiero in a statement.</p><p id=\"ZZECIV\">StatusPro was co-founded by former Cincinnati Bengals and Cleveland Browns wide receiver Andrew Hawkins and former college quarterback Troy Jones. The company has taken on high-profile investment from figures including LeBron James, Naomi Osaka, and Drake.</p><p id=\"R6UaAi\">“We are grateful to the NFL and our community of investors and stakeholders who share our vision to create an entirely new standard in sports and gaming,” Hawkins says in a statement. “We keep the athlete first in everything we do, and as former football players it means even more to be able to recreate what it actually feels like to step out on the field. Through our proprietary technology at StatusPro, we can deliver an immersive experience that helps NFL fans transform into pro athletes.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tAaZY6hFci2PzGkA04EBtfhWp48=/0x266:3418x2056/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23339099/619280574.jpg",
  "description": "It’s planned to be an annual franchise.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}