{
  "title": "Analogue says early Pocket preorders will ship by the end of March",
  "url": "https://www.theverge.com/2022/3/7/22966008/analogue-pocket-preorder-groups-late-march-q1",
  "date": "2022-03-07T21:11:23.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/84c8CntU4CPaud5EXinOmPvnsHE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70590883/vpavic_211129_4897_0030.0.jpg\" />        <figcaption><em>If you’re in the first group, you Pocket should be coming soon.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"KrqzSu\">Analogue has announced that it’ll be shipping out a new wave of <a href=\"https://www.theverge.com/22831589/analogue-pocket-review\">Pocket handhelds</a> at the end of March to people who got in early during its December presale. The company <a href=\"https://twitter.com/analogue/status/1500888770828288003?s=20&amp;t=ZMfMdOl7FJfNakqhcb7QlQ\">tweeted</a> that Group A preorders will start to ship out the last week of March and would all be shipped by the end of the month. </p><p id=\"u1byOb\">That date means that Analogue is just making its first deadline on time — before the Game Boy throwback handheld officially <a href=\"https://www.theverge.com/2021/12/10/22827971/analogue-pocket-order-price-increase-handheld\">went on sale in December</a>, the company said that the people who ordered first would be getting their Pockets in “Q1 2022.”  While that means the wait is close to over for those in Group A (I’ll admit I’ve been starting to check the calendar, muttering to myself, “You know, there’s not a lot of time left in Q1...”), some people still have a while to go. Group B is scheduled for Q4 2022, and Group C, along with any orders placed now, is set for 2023.</p><div class=\"c-float-right\"><aside id=\"BL6VMH\"><q>Analogue is making the deadline right under the wire</q></aside></div><p id=\"XoNjQV\">Anyone in Group A should have received an email letting them know about the ship date and notifying them that they have until Sunday, March 13th, to change their shipping address if they need to. If you’re in Group A and don’t want the Pocket anymore, you can also cancel your preorder by Sunday. </p><p id=\"sfATa7\">If you want to get excited to play your old Game Boy and Game Boy Advance games again before your Pocket arrives, you can read <a href=\"https://www.theverge.com/22831589/analogue-pocket-review\">our review of it here</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KvmHBE4FK9Ik40uHc3XdcQFnK4s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23055808/vpavic_211129_4897_0030.jpg",
  "description": "Later buyers could be waiting until 2023.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}