{
  "title": "Ancestry will tell you which genetics came from which parent",
  "url": "https://www.theverge.com/2022/4/13/23021782/ancestry-dna-sort-genes-parents-ethnicity",
  "date": "2022-04-13T15:00:00.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"Ancestry DNA test kit\" src=\"https://cdn.vox-cdn.com/thumbor/a5oXdUsVOV74721Pkg9zII6Bv58=/0x43:5261x3550/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70744499/1140390425.0.jpg\" />        <figcaption>Photo by: Geography Photos/Universal Images Group via Getty Images</figcaption>    </figure>  <p id=\"ImBNM3\">Consumer genetics and genealogy company Ancestry announced a new feature, called SideView, that will give customers information about which bits of their DNA — and which parts of their ethnicity — were inherited from each parent. The tool can do that without having genetic information from the parents, which Ancestry says is a first in the industry.</p><p id=\"0QMAYc\">Separating out which parts of someone’s genome came from which parent has been a challenge for researchers, says Barry Starr, the director of scientific communications at Ancestry. “It’s a really big breakthrough for science in general,” he told <em>The Verge</em>. “That’s really something that no one else has been able to do without having a parent tested as well.” The feature will<strong> </strong>be automatically available for all users.</p><p id=\"cLIzVO\">Genetic information is packaged in pairs of chromosomes, and each parent contributes one copy of most chromosomes. DNA analysis, though, reads the sequence of genetic information without sorting out which half different sections came from. Usually, the best way to sort that out is by comparing sections to the DNA of one or both parents. But Ancestry developed a technique that uses the company’s large DNA database — which includes 20 million people’s genetic information — to find overlaps between each user and cousins or distant relatives also in the system. It uses those overlaps to sort each section of DNA by which parent it was inherited from.</p><p id=\"OKkgcv\">Ancestry was interested in developing a way to sort genetic information by parent for a while, Starr says, but it had to wait until the DNA database was big enough that the tool could be accurate. Now, with a database at the size it is now, Starr says Ancestry can have 95 percent precision for 90 percent of customers. “The bigger the database, the better you can do,” he says. </p><p id=\"vljGkY\">The database, though, is largely made up of people with European ancestry — the feature is less accurate for users who have other ancestry from other parts of the world, according to a scientific article from Ancestry describing the technique. The paper has not yet been peer-reviewed or published in a scientific journal. Blind spots around people of color are a <a href=\"https://www.statnews.com/2020/06/10/23andme-ancestry-racial-inequity-genetics/\">longstanding bias</a> in genetic databases and genetic research more generally. DNA tests like Ancestry’s that tie your genetics back to a particular ethnicity are also often criticized for giving people an <a href=\"https://www.popsci.com/story/science/dna-tests-myth-ancestry-race/\">incomplete picture</a> of what genetic heritage actually means and conflating ancestry with race.</p><p id=\"2ucfz7\">At first, the SideView feature will let customers see which side of the family various parts of their ethnicity came from. “Which side of the family did your German come from? Did your French come from? Et cetera,” Starr says. Eventually, it’ll allow people to see which side of the family any relatives identified through Ancestry are from. That’ll make it easier for people to track family history and build out family trees, he says.  </p><p id=\"wubetX\">The strategy Ancestry uses to divide genetic information by parental side could also help people understand more about their health and genetic risk factors, Starr says. For example, someone who has two copies of a certain gene from one parent might be at a higher risk of a disease than someone with two copies but one from each parent. Ancestry wouldn’t do that work themselves — the company <a href=\"https://support.ancestry.com/s/article/Discontinuation-of-AncestryHealth?language=en_US\">discontinued its health services in 2021</a>. But the company is publishing its results, and other groups could theoretically make use of that technique. </p><p id=\"zIg07g\">“This opens up all sorts of avenues for additional features and research,” Starr says. “I think it’s really exciting.”</p><p id=\"5zEhf1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MDlSSzh77cssgWb7YhWXx746Cw8=/0x419:5261x3173/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385341/1140390425.jpg",
  "description": "It relies on the company’s enormous DNA database.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}