{
  "title": "Anchor co-founder Michael Mignano to leave Spotify",
  "url": "https://www.theverge.com/2022/5/2/23054003/anchor-co-founder-michael-mignano-leaves-spotify",
  "date": "2022-05-02T20:14:19.000Z",
  "author": "Ariel Shapiro",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jg77G5e0FLfRT8oBPX9KBhADsRc=/5x0:1415x940/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70824018/Screen_Shot_2022_02_11_at_3.40.20_PM.0.png\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"9cGoW2\">Michael Mignano, co-founder of Anchor and Spotify’s podcasting tech chief for the past three years, submitted his resignation last week, the company confirmed Monday. He will depart at the end of June.</p><p id=\"34VX1E\">The shakeup follows two other high-profile departures in Spotify’s podcasting business. Last month, news broke that head of studios and video <a href=\"https://hotpodnews.com/insider-april-21-2022-%E2%9A%A1%EF%B8%8F-lightning-round-%E2%9A%A1%EF%B8%8F/\">Courtney Holt</a>, who cut blockbuster deals with Joe Rogan and the Obamas, will be leaving the company. Also in April, Gimlet Media director <a href=\"https://hotpodnews.com/insider-april-8-2022-call-this-the-moves-edition/\">Lydia Polgreen</a> announced her departure for <em>The New York Times</em>.</p><p id=\"4ymBDF\">Mignano co-founded DIY podcast distributor Anchor in 2015. Spotify snapped up the company in 2019 for more than $150 million and brought Mignano in as its top podcast tech czar, overseeing the company’s explosive podcast growth and expansion into live audio. </p><p id=\"XVeRMN\">Although Anchor has yet to produce any major audio stars, it has become the <a href=\"https://livewire.io/podcast-hosts-by-episode-share/?utm_source=podnews.net&amp;utm_medium=web&amp;utm_campaign=podnews.net:2022-05-02\">most-used podcast hosting platform</a>. According to Livewire Labs, one out of four new podcast episodes published are done so through Anchor. Spotify has relied on the platform to bulk up its podcast library. The streamer is now home to 4 million podcasts, up from 1 million podcasts in 2020, and the company says that 85 percent of its new podcasts are uploaded through Anchor.</p><p id=\"e19z4b\">Mignano was not available for comment.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3jMS0YbvoyIWqiayiKmffm3HI8c=/0x99:1420x842/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23236521/Screen_Shot_2022_02_11_at_3.40.20_PM.png",
  "description": "Anchor has been instrumental with stocking Spotify’s library, which is now home to 4 million podcasts.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}