{
  "title": "Anchor made Spotify the creator platform it is today ",
  "url": "https://www.theverge.com/2022/5/3/23054525/spotify-mignano-rogan-facebook-zuckerberg-anchor",
  "date": "2022-05-03T14:30:00.000Z",
  "author": "Ariel Shapiro",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GjASUjfF0DWO1w7J1vI-38nsJ8g=/0x0:2051x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70826956/Hot_Pod_Site_Post.0.jpg\" />    </figure>  <p id=\"6XsAoj\">Hello, audiophiles!</p><p id=\"islX9C\">I am very excited to bring you my first public edition of <em>Hot Pod</em>. Following the trail blazed by Nick and Ashley, I’ll be in your inbox every Tuesday with scoops, news, analysis, and japes (quality of the latter not guaranteed). And, the closest I will ever get to being in a makeover montage, today I also get to introduce a fresh new look for <em>Hot Pod</em> courtesy of the ace design teams at <em>The Verge</em> and Vox Media. Readers will notice that we have an updated logo and layout with some hotter colors to accompany the <em>Hot Pod</em> name.</p><p id=\"c48yxv\">So, what’s my deal? Like everyone else in modern media, I hopped around a bit before landing at <em>The Verge</em>. I have done stints at MSNBC, Paramount Plus, and, most relevant to you, covering media and entertainment at <em>Forbes</em>. In my former life as a cataloger of capitalist machinations, I was putting together the 2019 list of highest-paid comedians when I started getting tips that Joe Rogan — “you know, the <em>NewsRadio</em> guy” — was making a stupid amount of money from his podcast. So I pitched (and pitched, and <em>pitched</em>) the magazine’s first <a href=\"https://www.forbes.com/sites/arielshapiro/2020/02/03/crime-does-pay-my-favorite-murder-stars-join-joe-rogan-as-highest-earning-podcasters/?sh=3ad8961e1377\">highest-earning podcaster list</a>. Although nobody was making Kylie money, it was clear that the business was bigger and growing at a faster pace than any of us outside the industry could have anticipated.</p><p id=\"4wgapR\">Cut to: acquisition frenzies, nine-figure licensing deals, and tech giants bending and molding the previously DIY podcasting industry to their will. And somehow after all that, things are no less messy — probably more so. For me, that makes it a dream beat. I look forward to exploring the sources of tension within the industry: suits trying to wring ad dollars out of unwieldy creators, streamers bulking up on podcasting to ease the burden of pricey music royalties, and celebrities starting a podcast because, why not, only to learn it’s a lot more involved than talking into a microphone. </p><p id=\"K2qKm4\">Plus, money. Podcasting is projected to be a $2 billion industry by next year, and I intend to figure out where that is flowing. (It can’t all go to Rogan.) </p><p id=\"rqTyLU\">I also look forward to hearing from you, dear reader! The good stuff always comes from conversations with people in the industry, rather than press releases. That kind of back and forth makes my job more fun and this newsletter a better read. So feel free to hit me up at <a href=\"mailto:ariel.shapiro@theverge.com\">ariel.shapiro@theverge.com</a> with tips, recs, and general thoughts. </p><p id=\"vnna6L\">As for shows, I don’t play favorites. Sorry, that’s a lie — I’m Brian Lehrer ride or die.</p><hr class=\"p-entry-hr\" id=\"0rBPIH\"><p id=\"vWL2BA\"><strong>SCOOP: Anchor co-founder Michael Mignano to leave Spotify</strong></p><p id=\"ZPBHnC\">Another one bites the dust. As I <a href=\"https://www.theverge.com/2022/5/2/23054003/anchor-co-founder-michael-mignano-leaves-spotify\">reported yesterday</a>, Spotify’s podcast tech czar Michael Mignano will leave the company at the end of June, the company confirmed. He is the third top podcasting executive at the streamer to depart in the past month. </p><p id=\"1gXNNx\">In April, Spotify lost two major figures on the editorial side. First was Lydia Polgreen, a longtime <em>New York Times</em> journalist and former editor-in-chief of <em>HuffPost</em>, who became managing director of Gimlet in 2020. She announced that she will be heading back to the <em>Times</em> as an opinion columnist. Then came the announcement that Courtney Holt, Spotify’s head of studios and video who cut blockbuster deals with Joe Rogan and the Obamas and helped make the streamer a true force in podcasting when Apple was the default, would be leaving as well.</p><p id=\"a0Wjcn\">Mignano has left a different kind of mark on the company. After co-founding DIY podcast platform Anchor with Nir Zicherman in 2015, Mignano sold the app to Spotify for $150 million in 2019 and came aboard to lead the tech on podcasts, video, and everything not having to do with music. Megaphone, the podcast advertising and publishing platform Spotify bought in 2020, fell under his purview. In 2021, he oversaw the company’s expansion into live audio when it bought Locker Room last year, which has since been rebranded Spotify Live. </p><div class=\"c-float-right\"><aside id=\"vUiZfv\"><q>Mignano’s original app has proven to be his most consequential contribution to Spotify</q></aside></div><p id=\"8xARTR\">But Mignano’s original app has proven to be his most consequential contribution to Spotify, bulking up the service’s library to 4 million podcasts, up from 1 million podcasts in 2020. The company recently disclosed that 85 percent of its new podcasts are uploaded through Anchor.</p><p id=\"Blwl93\">It’s not that Anchor has created any Joe Rogan or Alex Cooper-esque stars for Spotify (it hasn’t). But the largely unmoderated volume of content it produces has helped shift the company’s perspective on itself: that <a href=\"https://www.theverge.com/2022/2/3/22915456/spotify-ceo-joe-rogan-daniel-ek-town-hall-speech-platform-podcast\">it is a platform for creators</a>, not a publisher. It’s the argument the company used for defending its hands-off approach to Rogan’s COVID misinformation, a stance that pushed away angry subscribers and <a href=\"https://www.theverge.com/2022/1/27/22904463/joe-rogan-spotify-neil-young-decision-moderation-podcasts\">folk-rock legends</a> alike.</p><p id=\"S242mJ\">While Spotify attempts to manage that tension, Mignano is stepping away from day-to-day management of creator platforms. He is heading to an early-stage venture capital firm, with details to be announced closer to his departure. Zicherman remains at the company as the head of audiobooks and gated content.</p><p id=\"WT8hmB\"><strong>Facebook ditches the whole podcasting thing</strong></p><p id=\"bfdnZ6\">After less than a year in the podcast game, Facebook is out. Starting this week, users will no longer be able to upload new podcasts, and all shows will be removed from the platform starting June 3rd,<em> </em><a href=\"https://www.bloomberg.com/news/articles/2022-05-02/facebook-is-planning-to-leave-the-podcast-business-after-a-year\"><em>Bloomberg</em> first reported</a>.</p><p id=\"CkROz8\">The social network announced a slew of audio features last spring, including a central audio hub, shareable clips, and Sound Bites, which allowed users to create short-form audio clips a la TikTok. The hub and Sound Bites will shut down in the next few weeks, the company confirmed. The only real vestige of Facebook’s audio infrastructure that will remain will be its Live Audio Rooms, which will be integrated into Facebook Live.</p><div class=\"c-float-right\"><aside id=\"UtUV3o\"><q>Facebook attempted to go about the shutdown quietly</q></aside></div><p id=\"WVB4iq\">“After a year of learning and iterating on audio-first experiences, we’ve decided to simplify our suite of audio tools on Facebook,” a Meta spokesperson told <em>Hot Pod</em>. “We’re constantly evaluating the features we offer so we can focus on the most meaningful experiences.”</p><p id=\"yZHyvh\">Facebook attempted to go about the shutdown quietly. It reportedly informed its audio partners of the decision by email. It will not be informing users of the change and will leave it up to publishers to break the news to their listeners.</p><p id=\"TcbeR3\">There is still one Zuckerberg who believes in podcasting, however. On Monday, SiriusXM announced that Mark Zuckerberg’s sister Randi, a radio personality, Web3 advocate, and former Facebook spokesperson, will host a new podcast called <em>Crypto Café With Randi Zuckerberg</em>. Let’s hope it’s as unhinged as her <a href=\"https://www.themarysue.com/randi-zuckerberg-crypto-music-video-explained/\">1980s throwback crypto feminism music video</a>.</p><p id=\"dtggbx\"><strong>More big hiring news</strong></p><p id=\"HwTvmA\">Because there wasn’t enough news on Monday, iHeartMedia and Freakonomics Radio Network both made big hires.</p><p id=\"pBqvOk\">Freakonomics Radio Network has hired NPR podcast head <a href=\"https://shorefire.com/releases/entry/neal-carruth-joins-freakonomics-radio-network-as-executive-vice-president-and-general-manager\">Neal Carruth</a> as its new general manager. He will lead editorial strategy for the network, which has expanded to five regular shows and has a dedicated channel on SiriusXM. Carruth spent 23 years at NPR, where he helped create the morning news podcast <em>Up First </em>and oversaw the development of shows like <em>Planet Money</em> and <em>The</em> <em>NPR Politics Podcast</em>.</p><p id=\"FdC7G0\">And iHeartMedia has tapped former Stitcher chief revenue officer <a href=\"https://investors.iheartmedia.com/news/news-details/2022/iHeartMedia-Welcomes-Sarah-Van-Mosel-as-Executive-Vice-President-of-the-iHeart-Audience-Network/default.aspx\">Sarah van Mosel</a> to lead its ad-buying service, the iHeart Audience Network. She will also have a hand in podcast partnerships, sales, and publisher development. Van Mosel worked at Stitcher during its acquisition by SiriusXM, after which she oversaw podcast revenue strategy across the company.</p><hr class=\"p-entry-hr\" id=\"3qqsnX\"><p id=\"GmuD54\">That’s it for me! <a href=\"https://twitter.com/randizuckerberg/status/1498425277734690816?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1498425277734690816%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fmashable.com%2Farticle%2Frandi-zuckerberg-crypto-parody-music-videos\">Carpe your crypto diem</a>, pals.</p><aside id=\"XUhAg8\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/1amo5rTL9fkStkoUVqHyf5xZdFU=/0x168:2051x1242/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23434856/Hot_Pod_Site_Post.jpg",
  "description": "The company has lost three high-profile podcast leaders in the past month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}