{
  "title": "Android’s iOS-friendly emoji reactions officially launch in major Google Messages update",
  "url": "https://www.theverge.com/2022/3/10/22970470/android-ios-messages-emoji-reactions",
  "date": "2022-03-10T14:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KyTkCy6oZ759F8MjOcMyUIoiwmA=/0x0:1336x891/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70603456/Untitled_2.0.jpg\" />        <figcaption><em>Emoji reactions should now play more nicely between iOS and Android.</em> | Image: Google</figcaption>    </figure>  <p id=\"6ZBKVs\">We’ve known <a href=\"https://www.theverge.com/2021/11/22/22796112/google-android-messages-imessage-emoji-reactions-formatting\">for</a> <a href=\"https://www.theverge.com/2022/2/1/22912085/android-apple-ios-messages-emoji-reactions-sms\">months</a> that Google has been working to make its Messaging app properly display emoji reactions sent by iPhone users. Now <a href=\"https://blog.google/products/android/new-android-features-March-2022/\">Google is making the feature available to all</a> as part of a host of new and updated features for its Messages app that are rolling out over the coming weeks. </p><p id=\"vAJoxT\">The <a href=\"https://www.theverge.com/2022/2/1/22912085/android-apple-ios-messages-emoji-reactions-sms\">beta</a> already gave us a pretty good idea of how Google Messages translates emoji reactions sent by iOS users, properly formatting them on Android instead of appearing as a confusing text message that arrived separately. </p><p id=\"hO14Bm\">Despite Google’s capitulation, it still says it wants “Apple to join the rest of the mobile industry and adopt RCS” for a better long-term solution. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9G-59Apy4uH2XMNFSiGWJpo42AA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23303312/ezgif.com_optimize_3.gif\">      <cite>Image: Google</cite>      <figcaption><em>The Google Photos sharing link and emoji reactions in action.</em></figcaption>  </figure><p id=\"4xgW7P\">Google is also building a Google Photos sharing link directly into Messages to offer users a way of sending photos and videos to non-RCS (read: iPhone) users to avoid image quality degradation. Google Messages will also now nudge you to respond to a message if it’s been sitting in your inbox for a while (much like Gmail’s been doing for years), as well as prompting you to wish someone a happy birthday if you’ve got the date in your contacts app. Oh, and links to YouTube videos shared in Messages will now display a preview for iOS users as well, which is nice. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TyhjzLYOKW8mPq_huOaujSGC1n8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23303304/Untitled_3.gif\">      <cite>Image: Google</cite>      <figcaption><em>Messages will now sort your personal and professional correspondence, and nudge you to respond to messages.</em></figcaption>  </figure><p id=\"lk0fvA\">Finally, a pair of Messages features <a href=\"https://www.theverge.com/2021/6/29/22555333/google-messages-one-time-passwords-otp-delete-categories-gmail\">Google first debuted in India last year</a> are getting a global release. The most interesting of these is an option to automatically delete one-time passcodes after 24 hours to avoid your inbox getting cluttered with useless six-digit codes. There’s also a new option to have Google’s software automatically sort your messages and let you filter them by “Personal” and “Business.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MBjADmuhSugD92DWFgUx7vownk4=/0x97:1336x796/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23303297/Untitled_2.jpg",
  "description": "Its OTP cleanup feature is also launching globally.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}