{
  "title": "Android 101: how to organize your homescreen",
  "url": "https://www.theverge.com/22956390/android-organize-home-screen-how-to",
  "date": "2022-03-01T21:24:29.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-31WHvgMD19wMiuf7LhrQOSgjZk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70566854/jbareham_171013_2050_0271.0.jpg\" />        <figcaption>Photo by James Bareham / The Verge</figcaption>    </figure>  <p id=\"8IxcRR\">If you’ve had an Android phone for any length of time, it’s easy to get used to living with, well, chaos. If you’re anything like me, you’re constantly adding new apps, deciding they’re okay but not great, adding another, and so on. Then, a few months later, as you’re scrolling through your app drawer, you’re surprised to see several apps that you forgot about and perhaps don’t even remember what they’re used for. </p><p id=\"kXzBSB\">In a very short time, it can become a mess. And if you’re really an app enthusiast, it can start taking up more space than you can spare. (Here, we can take as written the obligatory KonMari reference.)</p><p id=\"5VFyLn\">There are essentially two steps to making sense of all of those Android apps: find a way to organize them (and there are a variety of ways, depending on what you’re comfortable with) and periodically remove all of the extra apps that you’ve accumulated and no longer use. Here are a few tips to help you do both. If you’re new to Android, this may help you stay organized from day one; if you’re an experienced user, you might pick up a few tips.</p><p id=\"1Vk7gF\">As you go through these suggestions, keep in mind that not all Android interfaces are the same. This how-to was created using a Pixel 6 running Android 12, but your interface may be slightly different, depending on the model of your phone and which Android version you’re running.</p><h1 id=\"22tYBt\">Get organized</h1><p id=\"ykPApH\">At the most basic (and anyone who’s had an Android phone for more than a week or two can skip down a bit), you can just use the app drawer, which is accessed either by swiping up from the bottom of the phone or by pressing on the apps icon at the bottom center of your display. Place the apps you use the most on one or more of your homescreens by long-pressing them while in the app drawer.</p><p id=\"oGE9WH\">The app drawer is (thankfully) organized in alphabetical order, with your last-used apps on top. You can swipe up to go through the apps; you can also swipe down on the side to go through the alphabet (which could be faster). A search bar at the top lets you type in the name of your app if you wish.</p><p id=\"uZNO2u\">However, once you start accumulating apps, you may want to save some time by creating a more structured system.</p><h2 id=\"ir3HCC\">Fill the Favorites Tray</h2><p id=\"Hc1pEL\">You can quickly access your most-used apps by putting them Favorites Tray, the bottom row of apps that is always there no matter which homescreen you’ve swiped to. The tray is already filled? No problem. </p><ul><li id=\"THuLEV\">Long-press on the app you no longer want to keep in the Favorites Tray. Move it to another place on the home page, or move it up until you see the Remove and Uninstall choices at the top of the screen. Choose one and move the app there.</li><li id=\"WHDuPB\">Long-press on an app from the homescreen or from the app drawer and move it into the tray.</li></ul><h2 id=\"wkbM0E\">Create folders on your homescreen</h2><p id=\"7G7dor\">A good way to organize your apps is to use folders. For example, you can put all of your music and podcast apps into a folder called “Listen,” or all your social media apps into a folder called “Social.” It’s simple to create a folder. </p>  <figure class=\"e-image\">        <img alt=\"It’s easy to create a folder by dropping one app on top of another.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ss6Zf9BAX4qFWZthBIog2znl-dc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280745/Android_Folders_2.gif\">      <figcaption><em>It’s easy to create a folder by dropping one app on top of another.</em></figcaption>  </figure><ul><li id=\"ROCl84\">Put the first two apps you want to include on your homescreen.</li><li id=\"hF6cmX\">Long-press one and move it on top of another. This will create a new folder. </li><li id=\"CSUGF0\">Android may give your folder a name. If you want to give it a different name, tap on the folder, tap on the name just below the apps, and type in your new name.</li><li id=\"60JqcA\">Add more apps to a folder by long-pressing on the app and moving it into the folder.</li><li id=\"5SQu3V\">Remove an app from a folder by reversing that process: long-press on the app and move it from the folder to the home page.</li><li id=\"SG6mae\">To remove the folder, simply pull all the apps out of it.</li></ul><h1 id=\"vQn7c1\">Get rid of unused apps</h1><p id=\"z3fpk9\">Sometimes when I install a new app, I’ll know immediately that it’s not for me, and I uninstall it then and there. More often, unfortunately, I’ll try out an app, decide that I may want to use it sometime in the future, and I leave it there. Where it sits. For months. Or years.</p><p id=\"oQKqJ6\">Once you start accumulating apps, it’s incredibly easy to forget about the ones that you no longer need. But allowing old apps to remain on your phone may not be as harmless as it seems. Not only are they taking up useful storage space, but they may be unnecessarily collecting data (assuming you gave them the permission to). And if they’re working in the background, they could be draining your battery.</p><p id=\"nAuEdK\">As a result, it doesn’t hurt to check out what apps you haven’t used recently and remove them from your phone. There are several ways to do this.</p><h2 id=\"Y9QtxN\">Use the app drawer</h2><p id=\"vbk11K\">Yes, this is the obvious one, but it has to be said. Spend a little time cleaning out your app drawer: open it up, and see what’s in there. You may be surprised by what you’ve forgotten and what you may no longer need. Anything you don’t need, swipe up to uninstall.</p><h2 id=\"ACQ762\">Visit the Play Store</h2><p id=\"sxUhPV\">It’s not as simple as going to your App Drawer or as efficient as Files by Google, but if you happen to be in the Play Store and want to get rid of a few unnecessary apps in order to install some new ones, there’s a way.</p><ul><li id=\"ACElsq\">Once in the Play Store, tap on your personal icon in the upper right corner and choose “Manage apps &amp; device.”</li><li id=\"PsNXZV\">Tap “Manage” on top of the page. You should be on the “Installed” tab; if not, it’s the first tab on top.</li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"In “Manage apps &amp;amp; device” you can see all your apps.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/laPau8dP3QhWEhlaL-UZrA9nJHY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280562/Screenshot_20220301_135417.png\">      <figcaption><em>In “Manage apps &amp; device” you can see all your installed apps.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Sort by least used to find out which apps you can get rid of.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QduJ2z43vUHiJLfSmkuZc2Mf61o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280563/Screenshot_20220301_135441.png\">      <figcaption><em>Sort by least used to find out which apps you can get rid of.</em></figcaption>  </figure></div></div></div><ul><li id=\"OIx6TA\">Tap on the parallel lines to the right of “Apps &amp; game,” and you’ll be able to sort according to the least-used apps. You can tap on the small arrow to the right of any app’s name to see if there’s anything new. For any app you no longer want, just tap the box to the right of the arrow, tap the trash can icon at the top right, and select “Uninstall.” (Don’t worry about accidentally uninstalling an important system app — or an app that your phone’s manufacturer thinks is important. You’ll simply be told you can uninstall updates but not the app itself.)</li></ul><p id=\"OCi0vJ\">If you delete an app and then later think, “I shouldn’t have done that,” or you suddenly remember an app you once used that you’d like to use again, you can find and restore your previous apps from the App Store (including ones you deleted from earlier devices that were using the same account).</p><ul><li id=\"x532IW\">Return to the “Manage apps &amp; device” page. Tap on the “Installed” tab so that it now reads “Not installed.” </li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"You can also find previously installed apps.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EhVBL-gGblFsOawb0VFmMMToK5U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280571/Screenshot_20220301_145911.jpg\">      <figcaption><em>You can also find previously installed apps.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"You can then reinstall them, if you wish.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eaQqC3yl52bJ5AUw9z2FxWF3EU0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280578/Screenshot_20220301_140536.png\">      <figcaption><em>You can then reinstall them, if you wish.</em></figcaption>  </figure></div></div></div><ul><li id=\"raIS7E\">Check the box for any app you want to reinstall and select the download icon on the top right. If you know you’ll never want to even look at that app again, next to that, there is a trash can with an “x” in it that will permanently delete the app from your list. (You can still install them from the Play Store.)</li></ul><h2 id=\"fvE2fv\">Use your voice</h2><p id=\"Wg3KAZ\">If you’re walking down the street and don’t have a spare hand, don’t forget about Google Assistant. Activate it (by long-pressing your power button or saying “Hey Google”), and say “Open AppName” or “Find AppName,” and your phone will open the app.</p><h2 id=\"7xRSY7\">Try Files by Google</h2><p id=\"TpUZQu\">Files by Google is a surprisingly handy app that, among other things, helps you get rid of unneeded files that are taking up space. If you decide to install Files (or if your phone came with it already installed), this is how you can use it to get rid of unused apps. </p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Files by Google helps you delete unused apps.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HEh5KfcOtfVeEyh8JpIwPnj8BQk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280734/Screenshot_20220301_152427.jpg\">      <figcaption><em>Files by Google helps you delete unused apps.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"You can sort your apps in a variety of ways.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OZw8oxD1iqCfcL_y_-9krqnRGsQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280736/Screenshot_20220301_152515.jpg\">      <figcaption><em>You can sort your apps in a variety of ways.</em></figcaption>  </figure></div></div></div><ul><li id=\"owSpI2\">If it’s not already selected, tap on the “Clean” icon on the bottom of the screen.</li><li id=\"7Zg2qC\">Scroll down until you find the section labeled “Delete unused apps.” Tap on “Select apps.” </li><li id=\"ZDr6In\">Now you can see how much space each app is taking up and the date it was last used. You can sort the list by oldest to newest, largest to smallest, or in alphabetical order. </li><li id=\"hMWhP5\">Tap on the circle on the right of each app to select any you want to uninstall. </li></ul><h2 id=\"oKKhVA\">Use another app</h2><p id=\"c8hTDM\">There are a variety of Android apps available in the Play Store besides Files by Google that can help. To begin with, there are other file managers that can make it easier to track and administer the contents of your phone. (There are, in fact, several apps called “File Manager” in the Play Store.)</p><p id=\"UYxQid\">Some create overlays to help you organize your homescreen. <a href=\"https://play.google.com/store/apps/details?id=com.mobeedom.android.jinaFS\">Jina</a>, for example, lets you create a sidebar that pulls out from the side of your screen and gives you a compact list view of all your apps. <a href=\"https://play.google.com/store/apps/details?id=com.farmerbb.taskbar\">Taskbar</a> puts a configurable Windows-like start menu on your display.</p><p id=\"ndvnhO\">If you want even more control over your Android environment, there are launchers such as <a href=\"https://play.google.com/store/apps/details?id=com.teslacoilsw.launcher\">Nova</a> and <a href=\"https://play.google.com/store/apps/details?id=com.actionlauncher.playstore\">Action Launcher</a> that allow you to more thoroughly customize your app drawer and homescreen with icons, animations, and different layouts. </p><p id=\"NwzLW8\"><em><strong>Update March 2nd, 2022, 9:20AM ET:</strong></em><em> This article was originally published on March 6th, 2019 and has been updated to account for Android OS and app updates.</em></p><p id=\"W2QQX7\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/frCTfrPlx2U0U-X2BhFTIp6gEs0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9474509/jbareham_171013_2050_0271.jpg",
  "description": "Keep your phone apps easy to find",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}