{
  "title": "Android’s archive feature will partially uninstall apps until you need them again",
  "url": "https://www.theverge.com/2022/3/8/22967924/androids-archive-feature-partially-uninstall-apps",
  "date": "2022-03-08T23:31:06.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Nu-ab_Xa1Z-DEqUFN1Jo5k7_YLM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70596648/acastro_180413_1777_android_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"AF129e\">Google is working on a tool that should let you “archive” certain apps to help free up space on your device. In a <a href=\"https://android-developers.googleblog.com/2022/03/freeing-up-60-of-storage-for-apps.html\">blog post</a>, Google explains any app with the feature will let you partially uninstall it, shrinking the app down by about 60 percent without removing it completely.</p><div class=\"c-float-right\"><aside id=\"3VdVxY\"><q>Archived APKs are much smaller and “preserve user data until the app is restored”</q></aside></div><p id=\"ikGl59\">It does this by creating a new type of APK (Android Package) — otherwise known as the guts that make an app functional on your device — that it calls archived APKs. As Google points out, archived APKs are much smaller and save all your data until you restore it, bringing it back to its original size. The feature will become available to developers with the <a href=\"https://android-developers.googleblog.com/2022/03/freeing-up-60-of-storage-for-apps.html\">Bundletool 1.10 release</a>, but it won’t be functional until Google launches the feature to the general public “later in the year.” Developers can also choose to opt-out of archived APKs, which Google also goes over in the blog post.</p><p id=\"ecp3Kj\">There still aren’t any details on how the feature will present itself on Android — perhaps it will appear alongside the uninstall option when you long-press an app’s icon. Either way, archived APKs seem like they could be great for anyone (specifically, me) who has a graveyard of seldom used apps and isn’t fully committed to letting go of them just yet (but also doesn’t want them to take up tons of storage space). Archiving and then restoring them should be much quicker than reinstalling an app, and will likely consume a lot less mobile data when you’re not on Wi-Fi.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RqOS4nKvRSt2fVr7eK9XOCW0QJY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10646769/acastro_180413_1777_android_0001.jpg",
  "description": "Archived APKs reduce an app’s size by about 60 percent.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}