{
  "title": "Android 101: how to tweak your multitasking pane",
  "url": "https://www.theverge.com/21495830/android-11-multitasking-pane-recent-apps-screenshots-google-how-to",
  "date": "2022-03-09T21:59:30.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JgJil9lDHyvgtbWa090ydXGqQXA=/0x0:800x533/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/67564719/VRG_1777_Android_12_006.5.gif\" />        <figcaption>Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p id=\"GvE6da\">As of Android 10, we’ve been able to choose different ways to access your multitasking pane — that handy flow of thumbnails that lets us view all our active apps, choose which one you want to use, and swipe off any you want to close — and to navigate your home screen. Until then, we mostly navigated Android screens using buttons at the bottom of the screen. Since then, we’ve been able to either swipe to navigate or opt to continue using those same buttons. </p><p id=\"oNUUNT\">If you’ve got Android 10 or 11, you can choose from three methods: gesture navigation, two-button navigation, or three-button navigation. When Android 12 came around, two-button navigation disappeared, but you can still switch between gesture and three-button navigation. Here’s how you change how to navigate through your home screen and access your multitasking pane.</p><ul><li id=\"NUSrGc\">Pull down from the top of the screen to access your app drawer, and tap on your setup icon (the cog in the lower right corner)</li></ul><div id=\"Gi39uI\"><div data-anthem-component=\"gallery:9505811\"></div></div><ul><li id=\"P9Vm59\">If you have Android 11, select “Accessibility” &gt; “System navigation”</li><li id=\"PHj6pv\">If you have Android 10 or 12, select “System” &gt; “Gestures” &gt; “System navigation”</li><li id=\"wjfQtW\">If you have Android 10 or 11, select either “Gesture navigation,” “2-button navigation,” or “3-button navigation.” If you have Android 12, select “Gesture navigation” or “3-button navigation.”</li></ul><p id=\"5BDeTQ\">Now here’s a description of the difference between the three methods.</p><div id=\"4yLard\"><div data-anthem-component=\"gallery:9505711\"></div></div><h2 id=\"pcunL7\">Gesture navigation</h2><p id=\"vsvmFR\">This is the “swipe” method introduced in Android 10 and the one that Google seems to be most anxious that people use. With gesture navigation, you don’t get the old back, home, and switch apps buttons at the bottom of the display. Instead, all you’ll see at the bottom of the screen is a single flat line. Swipe up and hold, and you’ll get the multitasking pane with all your open apps. You can then swipe from side to side to access them.</p><p id=\"nD980H\">Once you’ve got the multitasking panel up, you can tap on the icon at the top of each app page to get a drop-down menu that lets you access the app’s info page and open the app in a split-screen format. Depending on the app, you may be able to access other features as well; for example, if you’re running a video, you can pause it from here.</p><p id=\"wioNJi\">In Android 11, two links were added below the multitasking pane: Screenshot and Select. Tap Screenshot, and you’ll get a screenshot of whatever app page you’re currently looking at. Tap Select, and all the text on that app page will be selected for you to copy, share, or search through.</p><h2 id=\"VsQC0i\">2-button navigation</h2><p id=\"v81694\">If you still have Android 10, this gives you two icons at the bottom of the screen: a short, thick line that stands in for the Home button and a back button to the left. Swipe up on the home button, and you can access the same multitasking pane with the drop-down menus that can be accessed at the top of each app. </p><p id=\"aWhx1I\">However, in Android 11, you do not get the “Screenshot” / “Select” buttons beneath the panes. Instead, as in Android 10, you get a Google search field at the bottom of the screen along with icons for five apps.</p><p id=\"7wd4NS\">As mentioned before, Android 12 doesn’t offer 2-button navigation.</p><h2 id=\"pNKRRW\">3-button navigation</h2><p id=\"sbjIUA\">This is the old-fashioned way to navigate, with the back, home, and switch apps buttons at the bottom of the display. Use the right-hand “switch apps” icon to bring up the multitasking pane. You still have the drop-down menus available above each app, and in Android 11 and 12, you have the Screenshot and Select links below.</p><p id=\"YL3kWF\"><em><strong>Update March 9th, 2022, 5:00PM ET:</strong></em><em> This article was originally published on October 1st, 2020, and has been updated to include Android 12.</em></p><p id=\"0CyvO0\"></p><p id=\"bSbCxn\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5BXo3U_BrWMS1WF9VYFMj9bkkW0=/0x42:800x492/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/67564719/VRG_1777_Android_12_006.5.gif",
  "description": "If you use Android 11, there are three ways you can access your multifunction pane.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}