{
  "title": "Anker’s first 3D printer might be the one you’ve been waiting for",
  "url": "https://www.theverge.com/23012424/anker-first-3d-printer-ankermake-m5-price-specs-launch",
  "date": "2022-04-06T07:00:39.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mNO6LEr6JaVqNH___za1uWdA9qU=/0x0:2200x1467/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70715528/ankermake_m5_3.0.jpg\" />    </figure>  <p id=\"H7AgSt\">3D printing can be a time-consuming and expensive hobby — even if you try to do it on the cheap. It feels like I’ve adjusted, replaced, or upgraded half the parts on my Ender 3 Pro. It’s been fun, but never easy. </p><p id=\"yj2Rqb\">But what if a truly consumer-ready 3D printer changed that? We may be about to find out. <a href=\"https://www.theverge.com/22769839/anker-battery-charger-gan-amazon-apple-mfi-lightning-iphone-magsafe-decoder\">Trusted phone charger company Anker</a> is officially expanding beyond its Eufy smart home devices, Soundcore audio, Nebula projectors and Roav car accessories into 3D printing this year — and not in a small way. The just-revealed <a href=\"https://www.ankermake.com/3dprinter-v8111\">AnkerMake M5</a> looks like it could give leading brands a serious run for their money.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YayyqdsvKlZ8f0fIbR3xwjJqWh0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23370153/ankermake_m5_4.jpg\">      <cite>Image: Anker</cite>      <figcaption><em>Vases are a relatively fast thing to print on any FDM printer, but the M5 could make them even faster.</em></figcaption>  </figure><p id=\"blkxFB\"><a href=\"https://www.kickstarter.com/projects/ankermake/ankermake-m5-3d-printer-5x-faster-printing-and-ai-camera\">Launching on Kickstarter later today</a> for an early bird price of $429 (though Anker suggests it’ll cost $759 or more at retail), the AnkerMake M5 will come standard with nifty features you’d often have to tack onto competing printers — like a webcam that lets you watch prints remotely, records timelapse videos of your creations, and can automatically pause a print job and alert you if it sees the printer produce a molten plastic mess instead of a useful part. </p><p id=\"47HkEA\">But its flagship feature is something far more fundamental: Anker claims it prints <em>five times faster </em>than the competition. And I don’t mean “theoretically you can set it to print really really fast if you painstakingly calibrate it.” I mean Anker is claiming that you can take the printer’s two halves out of the box, connect them with eight screws, plug in two USB-C cables and a power adapter, and it will automatically print at 250mm/sec because that is its <em>default</em> setting. “That’s our baseline for this,” Anker spokeperson Eric Villines tells me.</p><div class=\"c-float-right\"><div id=\"icPjG3\"><div data-anthem-component=\"aside:1523637\"></div></div></div><p id=\"Q0ykZt\">250mm/sec is indeed five times faster than my Ender 3 Pro’s default speed, and more than five times faster than the leading Prusa MK3S+’s quality setting, and I don’t think I can overstate how big a deal it might be for the hobby if it’s true. 3D printing can be an incredibly slow process, but Anker is suggesting it can cut that from a day to a matter of hours, or from a few hours to less than an hour, with a printer that lets you build parts the same size (maximum 235 x 235 x 250mm) as the most popular options on the market.</p><p id=\"ekdGve\">It’s not clear what secret sauce keeps your parts from getting shaken right off the printer at that speed, but it sounds like it could be a lot of things. Anker claims it’s moving the Y-axis build plate using a fancy stepper motor with “high-subdivision drivers” and two belts instead of one. The gantry is raised and lowered on two lead screws instead of one for stability. It’s got a removable textured build surface, similar to Creality’s printers, which I’ve found excellent at keeping prints stuck to the plate. They gave the printer a weighty, die-cast aluminum alloy base to keep it stable. And Anker is claiming “advanced algorithms that align your printing with your course of action.”</p><p id=\"mNitzP\">I’ll believe 250mm/sec when I see it, but I want to believe.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_yFcBxGudN7qQ7sm9cy91NrSfM4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23370155/ankermake_m5.jpg\">      <cite>Image: Anker</cite>      <figcaption><em>It looks like the spool of filament can be mounted on the side or up top. And yes, the touchscreen moves up and down with the gantry.</em></figcaption>  </figure><p id=\"rwEj6o\">For me personally, speed isn’t my biggest frustration with 3D printing. I’m happy to let a print run overnight out in the garage, as long as I’m reasonably sure it’ll wind up complete. But I am so, so tempted to upgrade for a 49-point auto bed leveling system (bed leveling is the root of <em>so many</em> problems in 3D printing), broken filament detection (another issue is filament can dry out and snap in the middle of a print), and a nifty one-button feature that automatically heats and ejects the filament so you can replace it with a different one while avoiding jams. </p><p id=\"Hrzyug\">Villines tells me that Anker enters new product categories when it thinks it can fix the pain points that are keeping people away, and this was the time. “I think 3D printers are right at that moment where they could become, if not mainstream, then certainly more than niche.” </p><p id=\"ZDpCa3\">The vision here is a printer where you could download a design from the internet, send it right to the printer’s 8GB of internal storage over Wi-Fi or even remotely via the cloud, and it’ll handle the rest for you. No need to find a slicer app to translate it into printer code, or worrying about several of the other most common failure points, and when you’re done there’s a whole timelapse video ready and waiting for you to share it on social media. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0gdQaLErRlyBz6vJ5g2a0zSZ_VA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23370669/anker_specs_2.jpg\">  </figure><p id=\"IMZzto\">But Anker has a lot to prove, and its spokesperson was upfront that the company may not have it all figured out quite yet. While Villines says Anker <em>will</em> make the printer regardless of how it does during the Kickstarter campaign (it’s more marketing than anything else and Anker has a good track record there), there is a reason it’s not shipping until September — software features like intelligent failed print detection, promised voice assistant compatibility and, well, most of the software hasn’t yet been built. “I like to say the hardware is at 75 percent and the software is at 2 percent,” he tells me, admitting that the company is anticipating a lot of customer service calls moving into a fraught new category like 3D printing.  </p><p id=\"lZllUM\">It’s also not clear how much of an ecosystem the new printer will have yet, which today’s 3D printing hobbyists tend to expect in return for their investment. It does accept GCode like other printers, uses standard (though longer than the most common type of) nozzles, and the company does intend to offer replacement parts, but it’s not yet clear what might be interchangeable between the AnkerMake and other products on the market. </p><p id=\"zh328Q\">I’d want to see it in action before I buy one, but this could absolutely be my next — and the first 3D printer I could actually recommend — if Anker gets it right. </p><p id=\"ahmXVh\"><em><strong>Update, 3:30AM ET: </strong></em><a href=\"https://www.kickstarter.com/projects/ankermake/ankermake-m5-3d-printer-5x-faster-printing-and-ai-camera\"><em>Anker’s Kickstarter page</em></a><em> doesn’t appear to be live yet, but I’ve been told the expected release window for the printer is September 2022. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5P2JY4_cwl254ibj5JEfBXnZsIQ=/0x158:2200x1310/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23370149/ankermake_m5_3.jpg",
  "description": "Could 3D printing be easy?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}