{
  "title": "Anker Soundcore Liberty 3 Pro review: feature-packed buds",
  "url": "https://www.theverge.com/22941399/anker-soundcore-liberty-3-pro-earbuds-review",
  "date": "2022-02-21T18:00:00.000Z",
  "author": "Chris Welch",
  "content": "  <p>Anker continues to impress on value</p> <p class=\"p--has-dropcap p-large-text\" id=\"OtbLfX\">Anker has managed to hold its own against giant tech rivals by delivering better-than-expected sound and cramming features into its Soundcore-branded wireless earbuds — all while pricing them lower than the competition. The Liberty 3 Pros are the latest example of this and a showcase of how far the company has come in designing audio products. </p><p id=\"KvQmwN\">At $170, the Liberty 3 Pros are the most advanced earbuds in the Soundcore lineup, with dual drivers in each bud, active noise cancellation, wireless charging, plus extra conveniences like multipoint and LDAC support. They offer a powerful, rich sound signature that’s a rung above something like <a href=\"https://www.theverge.com/22323748/anker-liberty-air-2-pro-review-wireless-headphone-price\">the Liberty Air 2 Pro</a>, lengthy battery life, IPX4 water resistance, and more. They also come in a range of colors, including white, black, purple, and the gray set I reviewed.</p><div id=\"bf47E8\"><div data-anthem-component=\"scorecard:11057594\"></div></div><p id=\"cpx4bF\">As far as the ear and wing tips that come in the box, Anker tends to throw in everything but the kitchen sink. With the stemless Liberty 3 Pro buds, you get four of each. With that many sizing options, finding the right fit starts to feel like a <em>process </em>as you tinker with various combinations. But the company deserves credit for providing an abundant selection when most major competitors toss in three pairs of ear tips and call it a day. Though they’re smaller than the prior Liberty 2 Pros, these earbuds aren’t as discrete or tiny as some competitors, but they’re at least not unsightly. </p><p id=\"Ygz0g0\">The pebble-shaped charging case opens with a smooth sliding motion and closes with a satisfying thunk, and so I end up myself fidgeting with it while wearing the Liberty 3 Pros. It’s easy for these cases to feel cheap if they’ve got loose tolerances or open too easily, but Anker avoids those pitfalls. Each earbud has an LED that lights up when they’re properly seated in the case, which supports wireless charging in addition to topping off over USB-C.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kj6ABkpjh-NwA2HkjTeWTLbsEic=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23260741/ear.jpg\">      <figcaption><em>The Liberty 3 Pro earbuds have a stemless design.</em></figcaption>  </figure><p id=\"CQ8rdT\">Anker makes a lot of big claims about sound quality and frequently says that its Soundcore buds are recommended by 20 Grammy-winning experts. In truth, they do sound quite dynamic — if not as refined as our <a href=\"https://www.theverge.com/21309820/best-wireless-earbuds\">favorite premium picks</a>. One driver handles bass, while the other focuses on mids and treble. The Liberty 3 Pros definitely have your standard V-shaped EQ curve and sound crisp and punchy out of the box. Frankly, the default bass output was too much for my liking and overly boomy when I listened to “Stop Making This Hurt” by Bleachers. That track also exposed the Liberty 3 Pro’s occasional habit of boosting treble frequencies into harsh territory. But you get extensive EQ controls if you prefer to dial in your own preferred sound. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JCevaAiH-2IwPO3SSn0q0J8Gk_U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23260740/DSCF7280.jpg\">      <figcaption><em>They have dual drivers, with one focused on bass and the other handling mids and treble.</em></figcaption>  </figure></div><p id=\"YRjbJa\">Despite their support of Bluetooth 5.2, I’ve noticed occasional audio cutouts throughout my time using the Liberty 3 Pros. It’s not a frequent annoyance and only happens once every listening session or two. But competitors like Sony, Samsung, and others have gotten much more reliable in terms of connection stability. </p><p id=\"AN9nyN\">What’s most unique about the Liberty 3 Pros is that they support both LDAC (Sony’s higher-bitrate wireless streaming protocol) and multipoint Bluetooth, so you can connect to two devices simultaneously. Not even Sony’s flagship 1000XM4 earbuds offer multipoint, but it’s finally becoming more common on earbuds besides those from Jabra. </p><p id=\"HAIGDl\">However, it’s worth noting that because of Bluetooth’s bandwidth limitations, you can’t listen at LDAC quality and take advantage of multipoint at the same time; Anker makes you pick one or the other in the Soundcore mobile app. During the workday, I preferred the convenience of multipoint. But if you’re relaxing and want to get the most out of higher fidelity tracks from Amazon Music, Apple, Tidal, or Qobuz, the LDAC toggle isn’t hard to find. Just be aware that it takes a toll on battery life, cutting the eight hours you get on a charge (with ANC off) down to a little over four hours. I got roughly six hours of continuous playback with ANC on using the standard AAC and SBC Bluetooth codecs. The charging case holds enough juice to recharge the earbuds three times.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CwWeWyJGUVyjOmNZruxgekHa5-w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23260742/DSCF7271.jpg\">      <figcaption><em>The earbuds illuminate when placed into the charging case.</em></figcaption>  </figure></div><p id=\"CoP7hK\">Anker continues to get better at active noise cancellation, but it’s still not on the same level that Sony, Bose, and Apple have reached. The Liberty 3 Pros do a decent job quieting your surroundings, but the best noise-canceling earbuds make it feel like you hit a mute button for the world around you, and these aren’t there yet. Same goes for transparency mode, which is an improvement over past models but falls short of the natural effect you get with the AirPods Pro or Bose’s QuietComfort Earbuds. Those I spoke to on Zoom and over the phone said that the Liberty 3 Pros kept my voice sounding clear, though background noise on my end occasionally broke into the conversation. </p><div><div id=\"zqIDUE\"><div data-anthem-component=\"aside:11060441\"></div></div></div><p id=\"xWYTwp\">The Soundcore app for Android and iOS is somewhat bloated and chaotic; I’m not sure who’s asking for a shopping mall section in a companion app for audio accessories. There are a ton of features crammed in — personalized sound profiles, white noise audio, and so on — but it could use some streamlining and less tacky, in-your-face promotion of other Soundcore products. Using the app is a reminder that you went with a value brand, and not in a good way.</p><p id=\"a6ljBF\">Looking at the whole package, the Liberty 3 Pros are an excellent value at $170. It’s easy to get tunnel vision when shopping for earbuds and concentrate only on the biggest brands. But if you’re determined to spend less than $200 on a new set of earbuds, these Soundcore buds come with a lengthy list of features, enjoyable sound (after some EQ modifications), and a comfortable fit, thanks to generous pack-ins. They’re not best in class at any one thing, but very good in several categories and a solid buy.</p><p class=\"c-end-para\" id=\"i2hFTX\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/aM4Ao8AlIIgBpFuPh8_UDqgYQTM=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23260738/DSCF7274.jpg",
  "description": "LDAC and multipoint for under $170? Not bad.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}