{
  "title": "Anker’s pint-sized 100W USB-C charger is on sale, but supplies are sold out until late June",
  "url": "https://www.theverge.com/2022/4/22/23037872/anker-736-gan-charger-100w-usb-c",
  "date": "2022-04-25T18:38:26.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7AGj03xKMd3cRXL4LT_M4zw3_q8=/20x0:797x518/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70783139/Screen_Shot_2022_01_04_at_1.14.13_PM.0.png\" />        <figcaption>Image: Anker</figcaption>    </figure>  <p id=\"fBsxHw\">At CES 2022, Anker announced an addition to its <a href=\"https://www.theverge.com/2021/5/24/22450999/anker-second-generation-nano-ii-gan-chargers-smaller\">Nano II USB-C charger</a> lineup <a href=\"https://www.theverge.com/2022/1/4/22866945/anker-nano-ii-100w-usb-c-736-charger-smallest-ces-2022\">with this more powerful version</a> sporting two USB-C ports capable of outputting up to 100W, plus an old school USB-A charging port. Now the Anker Nano II 100W (also known as the Anker 736 charger) has popped up for sale on Amazon (via <a href=\"https://www.macrumors.com/2022/04/22/anker-736-100w-charger/\"><em>MacRumors</em></a>), and quickly sold out on Friday. Now, (as of Monday afternoon at 2:33PM ET) <a href=\"https://www.amazon.com/dp/B09Q52CXX1?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">it is available to order on Amazon for $75.99</a>, but with delivery dates scheduled for the end of June.</p><p id=\"QlZjXj\">The Nano II chargers use the company’s second-generation version of gallium nitride-based components that replace older charger’s silicon components to pump out more power in a smaller package with less heat. According to Anker, the Nano II 100W is 34 percent smaller than Apple’s 96W charger, with similar capabilities plus two extra ports that help you reduce the number of items you’ll need to keep all of your devices powered up. One other plus is that its fast charging is compatible with a wide array of devices, with USB Power Delivery 3.0 PPS (programmable power standard), and Quick Charge 3.0 support.</p>  <figure class=\"e-image\">        <img alt=\"Anker 736 design highlights\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_J8zK4Ku8nsoBIyrhkzaHaHXpXU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23410512/93465340_ab73_4f25_b43c_16bd0a22aad1.__CR0_0_1940_1200_PT0_SX970_V1___.jpg\">      <cite>Image: Anker</cite>  </figure><p id=\"c5GRQm\">The caveat with this charger is that its USB-C ports are capable of up to 100W power output — but that’s only true when you have one device plugged into one of them. Many notebooks and other devices require significantly less power than that to charge or even fast charge, but it's something to consider if you have a larger MacBook Pro. Using both USB-C ports simultaneously cuts max output to 60W from the first slot and 40W from the second — Anker has a chart to break it down further.</p>  <figure class=\"e-image\">        <img alt=\"Single Port: USB-C 1 (100W Max) / USB-C 2 (100W Max) / USB-A (22.5W Max) Dual Port: USB-C 1 + USB-C 2 (60W Max + 40W Max) / USB-C 1 + USB-A (80W Max + 18W Max) / USB-C 2 + USB-A (60W Max + 22.5W Max) Triple Port: USB-C 1 (45W Max), USB-C 2 (30W Max), USB-A (18W Max)\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ur3WGFTH7jxsrpZ33loOreqAtqs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23410491/94051c46_d347_4ca4_a516_24d77032b398.__CR0_0_1940_1200_PT0_SX970_V1___.jpg\">      <cite>Image: Anker</cite>      <figcaption><em>Anker 736 charging guide</em></figcaption>  </figure><p id=\"aYXwFX\">Anker isn’t the only company using gallium nitride (GaN) for smaller, more powerful chargers — Apple’s first brick with the tech is the <a href=\"https://www.theverge.com/2021/10/19/22734233/apple-140w-macbook-charging-brick-gan-usb-c-pd-3-1-third-party-chargers\">140W power supply that ships with the 16-inch MacBook Pro</a> — but it has been ahead of the pack <a href=\"https://www.theverge.com/circuitbreaker/2018/10/25/18022106/anker-powerport-atom-pd-1-27w-usb-c-brick-gallium-nitride\">since showing off its first GaN power adapter in 2018</a>. </p><p id=\"wgxISC\">In an interview with <em>The Verge</em> EiC Nilay Patel on the <em>Decoder</em> podcast last fall, <a href=\"https://www.theverge.com/22769839/anker-battery-charger-gan-amazon-apple-mfi-lightning-iphone-magsafe-decoder\">Anker CEO Steven Yang </a>explained why his company has been so quick to introduce GaN and iterate products based on it.</p><div id=\"ZCXyHT\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP7602261278\" width=\"100%\"></iframe></div><blockquote><p id=\"gDKnHX\"><strong>Gallium nitride is a key enabling technology that hit the market around three years ago, but you are already talking about the third generation. Is gallium nitride a technology that you have to invest engineering resources in? Is there a supplier pipeline or a material science pipeline? How do you manage that investment?</strong></p><p id=\"sD7Kmw\">Anker was actually the first to introduce gallium nitride to consumer electronics charging. The way we were able to do that was by partnering with the frontier chipset manufacturers who developed the gallium nitride charging chip. We were almost their alpha customer. So when the chip was first developed, it’s a lot of hoops to jump through to make it into a product. That requires not only material science knowledge, but also application knowledge, system architecture knowledge, and knowledge about managing heat. It’s almost a system effort. We accumulate knowledge in that, and couple that together with the gallium nitride chips and the manufacturer to build them into products.</p><p id=\"K0OZNR\">You’ll be seeing the GaN2 this year at the 65-watt size and the 30-watt size. We’ve been working with Power Innovations for almost a year on that. GaN2 is the brand new generation of chips that we launched in the middle of this year. GaN2’s 65-watt size was a fraction of the competition’s.</p><p id=\"aEMKTN\">The reason we were able to do that is based on Power Innovations’ newest generation of their GaN2. We’ve been the sole partner for almost a year developing that — you won’t be seeing similar products coming from other brands for at least three to six months because PI and Anker are working together, solely.</p><p id=\"SXYlT0\"><strong>So Anker and PI have had an exclusive relationship to develop the next generation GaN chipset, and then that window opens three to six months later so other people can buy that chipset.</strong></p><p id=\"ZtgYfD\">Yeah.</p></blockquote><p id=\"exevum\">Anker US media relations head Tyler Mallery confirmed to <em>The Verge</em> that the charger did, in fact, launch and that Anker is waiting for more inventory to arrive. The 736 charger is in short enough supply that it’s not even listed on Anker’s website yet, but if this is the charger you’ve been waiting for, keep an eye on that Amazon page to see when it returns.</p><p id=\"Txtxbs\"><em><strong>Update April 25th, 2:37PM ET:</strong></em><em> Updated to reflect the availability of orders on Amazon.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1q0nJwP0I6m3L2OEDRxi_vAWWPU=/0x46:816x473/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23144899/Screen_Shot_2022_01_04_at_1.14.13_PM.png",
  "description": "Anker’s $79, 100W GaN charger is starting to roll out",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}