{
  "title": "Anonymous bulletin board app Yik Yak is revealing its users’ exact locations",
  "url": "https://www.theverge.com/2022/5/13/23070696/yik-yak-anonymous-app-precise-locations-revealed",
  "date": "2022-05-13T18:22:39.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9MhaGmucNo7gkAHROlvVc-_gYTY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70866485/acastro_170629_1777_0008_v2.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"DyTydI\">Yik Yak, an app that acts as a local anonymous message board, makes it possible to find users’ precise locations and unique IDs, <a href=\"https://www.vice.com/en/article/7kbnna/anonymous-social-media-app-yik-yak-exposed-users-precise-locations\"><em>Motherboard</em> reports</a>. A researcher who analyzed Yik Yak data was able to access precise GPS coordinates of where posts and comments came from, accurate within 10 to 15 feet, and says he brought <a href=\"https://theresponsetimes.com/yikyak-is-exposing-user-locations/\">his findings</a> to the company in April.</p><p id=\"kih2GD\">First launched in 2013, Yik Yak was popular on college campuses, where it was often used to gossip, post updates, and <a href=\"https://www.vox.com/2015/11/13/9728368/yik-yak-colleges-missouri\">cyberbully</a> other students. After waning relevance and failed attempts at <a href=\"https://www.theverge.com/2016/3/8/11175886/yik-yak-handles-usernames\">content moderation</a>, the app shut down in 2017, only to rise from the dead last year. In November, <a href=\"https://twitter.com/YikYakApp/status/1458110405348368393\">the company said</a> it had passed 2 million users.</p><p id=\"3cTgRm\"><em>Motherboard </em>spoke with David Teather, a computer science student based in Madison, Wisconsin, who raised the security concerns to Yik Yak and went on to publish his findings in <a href=\"https://theresponsetimes.com/yikyak-is-exposing-user-locations/\">a blog post</a>. The app shows posts from nearby users but displays only approximate location, such as “around 1 mile away,” up to five miles, to give users a sense of where in their nearby community updates are coming from. </p><p id=\"Ipmwiz\">Though Yik Yak promises anonymity, Teather points out that combining GPS coordinates and user IDs could de-anonymize users and find out where people live since many are likely to be using it from home and the data is accurate to within 10 to 15 feet. That combination of information could be used to stalk or watch a particular person, and Teather mentions that the risk could be higher for people living in rural areas where homes are more than 10 to 15 feet apart because a GPS location could narrow a user down to one address.</p><p id=\"jpjC5m\">As <em>Motherboard</em> reports, the data is accessible to researchers like Teather, who know how to use tools and write code to extract information — but the risk was real enough to prompt Teather to bring it to Yik Yak’s attention.</p><div id=\"oFl7Rc\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I discovered that <a href=\"https://twitter.com/YikYakApp?ref_src=twsrc%5Etfw\">@YikYakApp</a> is exposing millions of user locations through sending precise GPS coordinates of all posts and comments (accurate within 10-15 feet) to the app, these can be harvested by malicious actors to track users locations.<a href=\"https://t.co/pgT809okv7\">https://t.co/pgT809okv7</a></p>— David Teather (@david_teather) <a href=\"https://twitter.com/david_teather/status/1523711775870681088?ref_src=twsrc%5Etfw\">May 9, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"8ztWS2\">“Since user ids are persistent it’s possible to figure out a user’s daily routine of when and where they post YikYaks from, this can be used to find out the daily routine of a particular YikYak user,” Teather writes. He listed other ways the data could be abused, like finding out where someone lives, monitoring users, or breaking into someone’s home when they’re not there.</p><p id=\"scVi1K\">Yik Yak did not respond to a request for comment from <em>The Verge.</em></p><p id=\"CSOkxr\">According to <em>Motherboard, </em>the latest version of the app released by Yik Yak no longer exposes precise location and user IDs, but Teather says he can still retrieve that information using previous versions of the app.</p><p id=\"qscnZs\">“If YikYak did take this more seriously they would restrict these fields from being returned and break older versions and force users to upgrade to a newer version of the app,” he wrote in the blog post.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nMu32hOmEMBEexVd-Wh7rIx6Nzc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9281305/acastro_170629_1777_0008_v2.jpg",
  "description": "A researcher was able to see users’ GPS locations and IDs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}