{
  "title": "Another US internet backbone provider is shutting down services in Russia",
  "url": "https://www.theverge.com/2022/3/9/22968634/lumen-internet-backbone-provider-shutting-down-russia-digital-iron-curtain",
  "date": "2022-03-09T12:03:01.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/SwNIkZ4qai6A02wa67Wx5nz_M1Q=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70598051/acastro_180608_1777_net_neutrality_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"oNuaZb\">Lumen, a US firm that provides essential internet services, says it’s <a href=\"https://news.lumen.com/RussiaUkraine\">pulling out of Russia</a> in response to the country’s invasion of Ukraine. It’s the second major company of its kind to do so in less than a week, following a similar announcement from rival Cogent <a href=\"https://www.theverge.com/2022/3/5/22962822/internet-backbone-provider-cogent-shuts-off-service-russia\">last Friday</a>, and is the latest example of a ‘digital Iron Curtain’ growing between Russia and the West.</p><p id=\"wd_printable_content\">In a <a href=\"https://news.lumen.com/RussiaUkraine\">blog post</a>, Lumen said it was shutting down all business in Russia “due to increased security risk” in the country.</p><p id=\"sikd05\">“We have not yet experienced network disruptions, but given the increasingly uncertain environment and the heightened risk of state action, we took this move to ensure the security of our and our customers’ networks, as well as the ongoing integrity of the global Internet,” said Lumen.</p><p id=\"9qOKSt\">The firm downplayed the impact of this move, emphasizing that it has no consumer customers in Russia, and that the business services it provides there “are extremely small.” </p><div class=\"c-float-right\"><aside id=\"VZt2G7\"><q>Analysts say Lumen is a top service provider in Russia</q></aside></div><p id=\"7GV7ed\">This statement does not seem to fully reflect the scope of Lumen’s business, though. Network analyst firm Kentik says Lumen is “the top international transit provider to Russia.” and that its customers include the country’s biggest telecoms firm, Rostelecom; the major broadband provider TransTelecom (TTK); and three large mobile operators, MTS, Megafon and VEON. </p><p id=\"2OVes5\">These companies can switch to services provided by other firms, but the loss of first Cogent and then Lumen will strain existing capabilities and likely disrupt internet services in Russia. As Doug Madory, director of Kentik, <a href=\"https://www.washingtonpost.com/technology/2022/03/08/lumen-internet-russia-backbone-cut/\">told <em>The Washington Post</em>:</a> “This is going to add up. It would be noticeable, I think.”</p><p id=\"SfnX04\">It’s the latest example of Russia’s increasing isolation from Western internet services — a trend that includes Russia <a href=\"https://www.theverge.com/2022/2/26/22952006/russia-block-twitter-ukraine-invasion-censorship-putin\">blocking or restricting</a> access to social media platforms like Twitter and Facebook, as well as US firms limiting services they offer in Russia. This includes companies like Google and YouTube shutting <a href=\"https://www.theverge.com/2022/3/4/22961302/google-pauses-all-ad-sales-russia-search-youtube\">down ad sales</a> in the country, and Amazon Web Services blocking new Russian <a href=\"https://www.nytimes.com/2022/03/08/technology/amazon-web-services-russia.html\">cloud computing accounts</a>. </p><p id=\"scywFj\">While some experts argue that these measures are a necessary part of the broader package of economic sanctions levied against Russia, others argue that these moves will only isolate the country further, and will limit the ability of its citizens to access independent news on the war in Ukraine. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qI4zFeJu5KvJ4bsK7gLuEFIqTXI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11516257/acastro_180608_1777_net_neutrality_0003.jpg",
  "description": "Russia is increasingly isolated from Western internet services",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}