{
  "title": "Apex Legends Mobile pre-registration is now open on Android",
  "url": "https://www.theverge.com/2022/3/17/22983608/apex-legends-mobile-pre-registration-android",
  "date": "2022-03-17T20:56:52.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OPn1YljAIFpqvIsr36voHNH1urs=/2x0:1003x667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70637779/Screenshot_5.0.png\" />        <figcaption>Image: Respawn Entertainment</figcaption>    </figure>  <p id=\"gxUQK2\">Respawn has opened pre-registration on Android for <em>Apex Legends Mobile</em>, the upcoming mobile version of the battle royale hit. If you pre-register, Respawn says you’ll be “among the first” to play the game when it launches in your region, and you’ll also get exclusive in-game items.</p><p id=\"GlJ8jz\">Respawn launched <em>Apex Legends Mobile</em> <a href=\"https://www.ea.com/games/apex-legends/apex-legends-mobile\">in 10 countries last month</a>, and while it’s unclear when it will be available in the US or more widely, the studio indicated in a press email that the game is set to launch this year. However, if you’re in Taiwan, Hong Kong, and Macau, it’s unclear if you can pre-register. On the <a href=\"https://www.ea.com/games/apex-legends/apex-legends-mobile\"><em>Apex Legends Mobile</em> website</a>, Respawn says that “Taiwan, Hong Kong, and Macau <strong>will</strong> be included in the global pre-registration” (emphasis Respawn’s), but a press email says that pre-registration is available globally <em>except</em> for “China, Hong Kong, Taiwan, Macau, Russia and Belarus.” We’ve asked Respawn if it can clarify.</p><p id=\"FGnTVN\">Right now, it seems that pre-registration is only available for Android, but on the <em>Apex Legends Mobile</em> website, Respawn says that the game is “coming soon” for iOS.</p><div class=\"c-float-right\"><aside id=\"hsR6Ia\"><q>The game is looking good in a new trailer</q></aside></div><p id=\"ec6hr9\">The studio has also released a <a href=\"https://youtu.be/CVqIK8scMHU\">new trailer</a> for the game, which should give you an idea of what <em>Apex Legends Mobile</em> will look like on your mobile phone as well as its touch-based controls. However, whenever the game does release, it will be up against some stiff competition; other mobile shooters like <em>Call of Duty: Mobile</em>, <em>PUBG: Mobile,</em> <em>Garena Free Fire</em> are already incredibly popular, and there are mobile versions of <a href=\"https://www.theverge.com/2021/6/2/22458279/valorant-mobile-spinoff-riot-games\"><em>Valorant</em></a> and <a href=\"https://www.theverge.com/2022/3/10/22971593/activision-call-of-duty-warzone-mobile\"><em>Call of Duty: Warzone</em></a> in the works.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dQUuGrLe90aVGQp05DnXH58-Ay4=/0x71:1004x597/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23324642/Screenshot_5.png",
  "description": "The mobile battle royale game is set to launch this year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}