{
  "title": "Apex Legends next-gen console updates with 4K and HDR launch tomorrow",
  "url": "https://www.theverge.com/2022/3/28/22999936/apex-legends-ps5-xbox-series-x-s-warriors-update",
  "date": "2022-03-29T01:08:52.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ErOaFQ3wvhbqAe5m7pg6j36MXMQ=/164x0:1936x1181/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70683238/APEX_Legends_Screenshots_S12_Map_SabotagedOlympus__1200.0.jpg\" />        <figcaption>Image: Respawn Entertainment</figcaption>    </figure>  <p id=\"VrE25y\">Respawn Entertainment has confirmed that <em>Apex Legends </em>upgrades for the PS5 and Xbox Series X / S consoles will launch tomorrow <a href=\"https://www.ea.com/games/apex-legends/news/warriors-collection-event\">with the new Warriors collection event</a>. Until now, the battle royale shooter has shared versions across the console generations. But when the update is released — usually around 1PM ET — console players will finally be able to join those on PC with support for natively rendered 4K (except on the Series S), HDR, better shadow maps, and greater level of detail distances.</p><p id=\"uITlpx\">All versions on consoles are still limited to 60Hz, with 120Hz gameplay listed as an upgrade coming in the future (however, once the PS5 supports 120Hz output, it will be able to force it even on games that don’t have support built-in if you want to give it a try). When I talked to the developers <a href=\"https://www.theverge.com/2022/2/4/22917825/apex-legends-defiance-hands-on-interview-battle-royal-sandbox\">before the launch of the current season, Defiance,</a> they said that we would see new next-gen features roll out throughout the year with the new seasons. Other features confirmed in the works are adaptive trigger and haptic support for the PlayStation 5 DualSense controller. </p><div class=\"c-float-right\"><aside id=\"ZqT2l3\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apex Legends turns three and prepares to change everything with the launch of Defiance \",\"url\":\"https://www.theverge.com/2022/2/4/22917825/apex-legends-defiance-hands-on-interview-battle-royal-sandbox\"}]}'></div></aside><div id=\"TMYpGt\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Warriors Collection Event will bring next-gen versions of Apex Legends to PS5 and XSX!<br><br>PlayStation players: check out the info below to learn how to update your game  <br>Xbox players: no action is needed. Apex will update via Smart Delivery.<br><br> : <a href=\"https://t.co/Hye8qEKTVh\">https://t.co/Hye8qEKTVh</a> <a href=\"https://t.co/5HfUSAYkWD\">pic.twitter.com/5HfUSAYkWD</a></p>— Apex Legends (@PlayApex) <a href=\"https://twitter.com/PlayApex/status/1508596455535169544?ref_src=twsrc%5Etfw\">March 29, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"8sk8xe\">The other area where the systems differ is how players will get their updated versions. On Xbox Series X and Series S, the <a href=\"https://www.theverge.com/21432635/xbox-series-x-s-release-date-news-price-features-specs-hardware-games\">Smart Delivery tech Microsoft uses</a> means that your console should automatically download the correct version without any intervention once it launches. On PlayStation, it’s a little more complicated. If you have the game installed on a PS5 already, you’ll find the title in your Game Hub, select Options instead of Play Game, and then tell it to download the PS5 version. If you don’t have it installed but have played it before, you’ll just find the game in your library, and make sure to choose the PS5 version when prompted.</p><p id=\"QPVESp\">Across all consoles and PCs, the second half of season twelve includes many fixes to stop things like hackers who enabled dual-wielding weapons and various glitches that could be used to exploit weapons with a charge mechanic like the Rampage LMG or Sentinel sniper. There’s also, of course, a new assortment of cosmetic upgrades to buy and a new heirloom that players can acquire to use with the character Crypto.</p>  <figure class=\"e-image\">        <img alt=\"Crypto’s new heirloom item\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/g_lSM2XVxmb7CkakMaUIRGiwMbE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23351657/crypto_heirloom_apex.gif\">      <cite>Image: Respawn Entertainment</cite>  </figure><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\"The new Control map for Apex Legends includes this spot inside Caustic’s Lab.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/h2E8Xvr8XV52mG8PO7yaI7V24jo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23351647/apex_legends_3_1_2022_5_49_19_pm.png.adapt.1920w.jpg\">      <cite>Image: Respawn Entertainment</cite>      <figcaption><em>The new Control map for Apex Legends includes this spot inside Caustic’s Lab.</em></figcaption>  </figure></div><p id=\"gOiMJ8\">The Warriors event will also bring back the Control limited-time mode for another two weeks, with a few improvements and a new map. It was well-received by players last time around, but there’s no word yet on whether we can expect it to become a regular part of the game or if we’ll see even more ways to play that get away from the standard battle royale setup.</p><p id=\"RSYlIM\">One thing that wasn’t mentioned at all in the update was last week’s massive leak of content that revealed new characters, skins, weapons, and emotes that the developers are working on. The extent of the leaks claimed to stretch over the next couple of years for the game, but based on the changes we’ve seen, I think there may be more <em>Apex Legends </em>surprises that haven’t been uncovered yet.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yKLLNAIzQerMKxj_Totl6GG7-Oc=/0x42:2100x1141/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23351639/APEX_Legends_Screenshots_S12_Map_SabotagedOlympus__1200.jpg",
  "description": "PS5 and Xbox Series X can play Apex Legends in 4K",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}