{
  "title": "Apex Legends season 13 pushes teamwork with a new kind of hero and ranked mode changes",
  "url": "https://www.theverge.com/2022/5/5/23058327/apex-legends-saviors-newcastle-ranked-battle-royale",
  "date": "2022-05-05T19:53:58.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/a_ArmMdeC38692Gc0-4MVhUV6g8=/156x0:1844x1125/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70836916/APEX_Legends_Screenshots_S13_Legend_Newcastle_Base_A_2000.0.jpg\" />        <figcaption><em>‘Newcastle’</em> | Image: Respawn Entertainment</figcaption>    </figure>  <p id=\"O3P2tZ\">Over the last few seasons, the developers of <em>Apex Legends</em> have worked on opening up the game, both <a href=\"https://www.theverge.com/2021/10/28/22750879/apex-legends-escape-ash-storm-point-respawn-ea\">with a massive new map</a> and adding a temporary game mode that swaps out battle royale action <a href=\"https://www.theverge.com/2022/2/4/22917825/apex-legends-defiance-hands-on-interview-battle-royal-sandbox\">for a more traditional team deathmatch</a>. On May 10th, they’re introducing another new legend to the arena with Newcastle and making changes that might help players focus on teamwork.</p><p id=\"GWNLEh\">Season 13 of <em>Apex Legends </em>carries the title <a href=\"https://www.ea.com/games/apex-legends/saviors\"><em>Saviors</em></a>, which matches Newcastle’s kit of abilities that are about keeping his teammates alive longer to help them win fights. While a slew of leaks in the past few months spoiled some of the surprises, seeing him in action is an entirely different thing. He has a passive ability that is unlike any character we’ve seen before, with the ability to not only shield downed teammates while reviving them, but he can also drag them to safety. The shield’s power level increases if Newcastle is carrying a higher-tier knockdown shield, which adds another tweak to an often overlooked item.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dKQj0hwpkhDqF1O6IU1QqsE-748=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440726/Apex_Saviors_Secondary_3840x2160_2500.jpg\">      <cite>Image: Respawn Entertainment</cite>  </figure><p id=\"8pwx7h\">His tactical ability that players can use periodically between cooldowns is a hovering energy shield. We didn’t get any playtest time to try it out, but from what developers said during a briefing, it sounds like it will be easy to control during a fight, allowing players to turn and move the shield to advance on enemies or guard their back while retreating. In a game where “third parties” are attacking whenever shots are fired, having a controllable shield to cover additional angles could change things a lot.</p><div id=\"EkA6Qe\"><div ><iframe src=\"https://www.youtube.com/embed/cheYIVEtVQ4?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"awGoyi\">Finally, his ultimate ability sees Newcastle jump long distances, slam his shield into the ground, and quickly build up a “castle wall” for defense. It was highlighted in the new season trailer where he was introduced, but a key element of playing Newcastle is that you’ll be able to cover even greater distances by targeting your teammates before activating it, which will carry him higher and further to them for the heroic save. </p><p id=\"rNr5nx\">While other legends have abilities that can help their teammates, this one actually uses them to make it better, so maybe the next randoms you’re in a trio with will actually consider working together. As usual, while the game itself is free to play, unlocking the new character requires 12,000 of the Legend Tokens players can earn by playing the game or with 750 Apex Coins. The coins you can also earn in-game in various ways but are mostly obtainable by purchasing them, with prices that start at $9.99 for 1,000 coins.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"‘The Downed Beast’ POI\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/p-56Srh4LBo3EuNy5Zj--TI60tI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440760/APEX_Legends_Screenshots_S13_StormPoint_MapUpdate_TheBeast_A_2500.jpg\">      <cite>Image: Respawn Entertainment</cite>      <figcaption><em>‘The Downed Beast’ POI</em></figcaption>  </figure></div><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\"‘The Downed Beast’ alternate angle\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kYZTeg6jop7mT60npqHuOH6FLXs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440763/APEX_Legends_Screenshots_S13_StormPoint_MapUpdate_TheBeast_H_2500.jpg\">      <cite>Image: Respawn Entertainment</cite>      <figcaption><em>‘The Downed Beast’ alternate angle</em></figcaption>  </figure></div><p id=\"oMEBlH\">Team play is a theme for the new season, as it applies to changes for the massive Storm Point map and for a revamped approach to scoring and progress for anyone who dives into ranked gameplay. The Storm Point map seemed to solve the problem of constant third parties but has been criticized by some players and streamers as too big and too spread out to be fun, as some people said they could walk around the map for an entire match and not see anyone. For the new season, “a detailed global tuning pass was crucial to improve the overall minute to minute gameplay” on the map, based on telemetry and player data gathered since it was added.</p><p id=\"DyVJsP\">There’s a new location on the map, as the massive sea creature that was killed in the season 13 trailer is now part of the action as the “Downed Beast” POI that should give players more reasons to visit an unloved corner of the map. The other big change players will see comes from four IMC Armories that have sprouted up from underground. With callbacks to the <em>Titanfall </em>games, they’re an opportunity for squads to enter and fight off waves of Spectre robots for 60 seconds. The more robots you lay down, the more gear you receive as a prize before ejecting from the armory to reposition yourself on the map. The doors lock while players are inside, so you don’t have to worry about other squads interrupting before it’s over.</p><div id=\"Vw7i8p\"><div ><iframe src=\"https://www.youtube.com/embed/cOFuEQEvC3E?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"GsJhJT\">Finally, among all of the other balance changes coming to <em>Apex Legends</em> in the new season, Respawn has announced a top to bottom change in the way it scores players’ performances in the ranked modes. </p><p id=\"Qi6R6T\"><a href=\"https://www.theverge.com/2019/7/9/20687943/apex-legends-ranked-mode-competitive-playlist-season-2-review\">As we noted when it was introduced in 2019</a>, the ranked mode invites you to accumulate points based on how many other players you kill or where your team finishes in each round. Generally speaking, the longer you last, the more points you get, and the more players you kill, the more points you get. If your teammate gets a kill, it doesn’t affect your score unless you were able to get credit for an assist. As you move up to higher ranks, you can score more points, but it costs you points to start each game, so unless you perform well, you won’t move up. It’s key to keeping the game fresh for experienced players and giving them a target to keep pursuing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6ySsSXlswUloCST1vxJ6xkIq7u4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440757/RankedLeaguesDivisions.jpg\">      <cite>Image: Respawn Entertainment</cite>      <figcaption><em>Apex ranked scoring when it debuted in 2019</em></figcaption>  </figure><p id=\"EaVPuw\">In the current season, the developers changed scoring to reward players more for outlasting more of their opponents, but that caused some problems since players could level up consistently simply by hiding until the end of a match when only a few teams are left. In addition, <em>Apex Legends</em> kept players in the highest rank they reached, so anyone who started losing more points than they could potentially make back in a season had little incentive to keep up the same level of effort or work with their teammates.</p><div><div id=\"6Ps7J1\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ranked gets reloaded with the launch of Apex Legends: Saviors! Check out the highlights below or read the dev blog to learn more about the changes.<br><br> : <a href=\"https://t.co/dvhKOZYyYW\">https://t.co/dvhKOZYyYW</a> <a href=\"https://t.co/x7GUYCwj7c\">pic.twitter.com/x7GUYCwj7c</a></p>— Apex Legends (@PlayApex) <a href=\"https://twitter.com/PlayApex/status/1521898204991795201?ref_src=twsrc%5Etfw\">May 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"a6lbD8\">Under the new system, trying to rise through the ranks to become an Apex Predator will have more to do with your team’s performance than ever before. <a href=\"https://www.ea.com/games/apex-legends/news/saviors-ranked-update\">Respawn broke down the changes here</a>, but just for scoring, now the number of points you get for a kill will change based on where you finish. If you kill several opponents but still get eliminated early, that is, in the developers’ eyes, a loss, and you will likely lose points instead of gaining them. On the other hand, if you stick around to the last two or three teams but don’t manage to kill anyone, the points you receive won’t be nearly enough to help you make real progress.</p><p id=\"Sjdg8r\">Also, players will now get points whenever anyone on the team gets a kill. Whether you’re all the way across the map doing nothing or being a team player, like me, who valiantly gets shot at so that your teammates have an opportunity to attack from the flank, you will be rewarded. Players can also drop out of the tiers they’re in if they lose enough points. With all of the changes combined, it sounds like it will be tough to achieve the highest tiers available, but in a way that more fairly rewards those who play the game as intended.</p><p id=\"sFnX79\">Otherwise, Respawn <a href=\"https://twitter.com/PlayApex/status/1521954819921088512\">has confirmed</a> that <em>Apex Legends Mobile</em> will launch on <a href=\"https://play.google.com/store/apps/details?id=com.ea.gp.apexlegendsmobilefps&amp;hl=en_US&amp;gl=US\">Android</a> and <a href=\"https://www.ea.com/games/apex-legends/apex-legends-mobile/newsletter\">iOS</a> later this month, but there aren’t many other details available about that yet. We also haven’t heard about any fixes or changes coming to the <a href=\"https://www.theverge.com/2022/3/28/22999936/apex-legends-ps5-xbox-series-x-s-warriors-update\">4K console versions of the game</a> that debuted at the end of March. <a href=\"https://www.ea.com/games/apex-legends/saviors\"><em>Apex Legends: Saviors</em></a> will be available when season 13 launches on May 10th for Switch, PlayStation, Xbox, and PC. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/usmZmLReYAL7NNsQSISM15N20ss=/0x40:2000x1087/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23440718/APEX_Legends_Screenshots_S13_Legend_Newcastle_Base_A_2000.jpg",
  "description": "Apex Legends: Saviors launches May 10th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}