{
  "title": "Apparently, people do use Bing",
  "url": "https://www.theverge.com/2022/2/14/22929130/vergecast-bing-search-listeners-using",
  "date": "2022-02-14T15:27:21.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"New bing logo stock\" src=\"https://cdn.vox-cdn.com/thumbor/MjCw2jiVxaBVhl_qQi7EdLJQX4o=/2x0:638x424/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507147/binglogostock2_640.0.jpg\" />    </figure>  <p id=\"DDm0Ji\">If you listened in to <a href=\"https://www.theverge.com/2022/2/4/22917738/meta-earnings-spotify-joe-rogan-controversy-vergecast-podcast-484\"><em>The Vergecast</em></a> a couple of weeks ago, you might remember a sidebar discussion on how <a href=\"https://www.theverge.com/2021/6/9/22525688/google-europe-android-search-provider-selection-choice-screen-pay-to-play-auction\">Android</a> and <a href=\"https://www.theverge.com/2013/3/6/4069126/eu-fines-microsoft-for-windows-7-sp1-browser-ballot\">Windows</a> users in the EU are prompted to choose a default search engine to comply with antitrust regulations. “Nothing in the world can make you pick Bing,” said <em>The Verge e</em>ditor-in-chief Nilay Patel with utter certainty. He then invited <em>Vergecast</em> listeners who actually choose Microsoft’s search engine over Google’s to write to him: “if you're a Bing-by-choice kind of person, let me know.”</p><div class=\"c-float-right\"><aside id=\"klDJNY\"><q>If a company is going to data mine me, I might as well get something out of it</q></aside></div><p id=\"hz47OC\">As it turns out, some of our listeners are straight-up enthusiastic Bing users. “I know you were joking but I wanted to reach out,” a listener named Jimmy wrote in an email to Nilay. Jimmy says he switched to Microsoft’s search engine more than three years ago and even uses it as default in Safari for iPhone and iPad.</p><p id=\"oVAyuk\">“I’m probably one of the few that willingly uses Bing!” wrote another listener named Kaval, proclaiming that they’ve been using Bing since the days of the Windows Phone. “...[T]o be honest I enjoy it. As far as search results go, it doesn’t significantly vary with Google.”</p><p id=\"UloVvS\">There are a wide variety of rationales people use for why they search with Bing. Here are some of the reasons <em>Vergecast</em> listeners gave.</p><h3 id=\"sE4EAh\">Sticking it to Google</h3><p id=\"iF9r3R\">Google is unmatched in terms of search engine popularity but is <a href=\"https://www.theverge.com/2022/2/11/22814204/google-chrome-third-party-cookies-privacy-sandbox-uk-competition-and-markets-authority-regulator\">currently being monitored closely</a> for its anticompetitively dominant position in search advertising after years of relying on third-party cookies.</p><p id=\"3vcKkG\">“I didn’t want Google to have all my info any longer,” Jimmy wrote, believing that Bing works great most of the time and only returns to Google once or twice a week. “But mostly, it was about saying no to Google.”</p><p id=\"sfbbZU\">Jimmy is not alone in being averse to the search giant due to privacy concerns; some users have even filed lawsuits against Google for allegedly collecting copious user data, <a href=\"https://www.theverge.com/2021/3/13/22329240/judge-rules-google-5-billion-lawsuit-tracking-chrome-incognito-privacy\">even when it shouldn’t</a>.</p><p id=\"HpZAO3\">“Maybe once or twice a week I feel like I can’t get the results I want and I repeat my search on Google. Otherwise, it works great,” wrote Jimmy. Another listener named Evan also said Bing searches work “95 percent as well as Google” but doesn't send Google their data. Evan did acknowledge it’s Microsoft that now has the data, though. “I wouldn’t die on this hill, but Bing is fine. I don’t have a relationship with my search engine.”</p><h3 id=\"vYvpbQ\">Microsoft Rewards plus Xbox makes people go Bing</h3><p id=\"TAU7JJ\">It’s all about the rewards! The majority of <em>Vergecast</em> listeners that emailed (and tweeted) mentioned that Microsoft Rewards is their number one reason to use Bing. Xbox gamers especially seem to love it, redeeming points gained from Bing searches for perpetual months of the Game Pass subscription service.</p><div id=\"w8Ek7z\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">I regret to say I too use bing as their default search, for the rewards money. Combines with the gamepass stuff.</p>— Zachary Elvove (@ZacharyElvove) <a href=\"https://twitter.com/ZacharyElvove/status/1489608336098144257?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"BZ0pVi\">Microsoft lets you redeem points for not only Microsoft products but also for gift cards at many different retailers, including Starbucks and Amazon. You can redeem points as donations towards charities or you can enter sweepstakes to win anything from Surface tablets to a trip to the NBA finals. There’s even a Bing Rebates program that offers cash back for making purchases with partnered companies.</p><div id=\"Ka6FqT\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You can redeem them as gift cards on Microsoft, Xbox, gamepass or other brands (in the UK I can redeem them for fairly well known brands like Halfords, TK Max, or even Uber). <a href=\"https://t.co/DpKZQKRuus\">pic.twitter.com/DpKZQKRuus</a></p>—    Tanvir    (@Tambulla) <a href=\"https://twitter.com/Tambulla/status/1489626036048388101?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"hvUvWA\">“If a company is going to data mine me, I might as well get something out of it,” Kaval wrote. Exchanging data for products / money is not far off from how users of the web browser Brave think. Brave users can exchange their data for tokens and can cash it out or directly fund online creators.</p><h3 id=\"Z4Tfoj\">Those are some pretty wallpapers</h3><p id=\"65gORm\">Believe it or not, Bing users love the daily image feature. Multiple <em>Vergecast</em> listeners also chimed in about the wallpapers specifically: “I really enjoy the new background every day,” Kaval wrote.</p><p id=\"OiPEZZ\">Bing’s homepage always has a background image — usually something scenic with a description and informative links on it. In contrast, Google’s main page is traditionally clean with just the logo and a search box on a white background.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UOeZK98PTK1Wxj9EyooUJ2vRRhY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23238661/BingWallpaper.jpg\">      <cite>Image: miralex/Getty Images via Microsoft Bing</cite>      <figcaption><em>Microsoft’s image of the day is Darwin’s Arch.</em></figcaption>  </figure><p id=\"SO5N8H\">You can even download the wallpaper and use it on your computer. Unfortunately, a Microsoft Bing watermark does get added.</p><h3 id=\"XysttR\">It’s, uh, better at some image searches</h3><p id=\"82rtXJ\">In the early days of Bing, there was a focus on the development of a comprehensive image search. High-resolution images could easily be scouted for throughout the internet and presented in a pleasing thumbnail gallery with a style that <a href=\"https://www.theverge.com/2012/6/21/3108540/bing-image-search-redesign-large-thumbnails\">followed in the footsteps</a> of the popular photo site Flickr in 2012. It eventually caught on that Bing was the ideal choice for pornographic image searches.</p><div id=\"MJyAQB\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">Is <a href=\"https://twitter.com/bing?ref_src=twsrc%5Etfw\">@bing</a> no longer the default porn search engine ?</p>— Scottish Pizza Crunch (@MannyCara) <a href=\"https://twitter.com/MannyCara/status/1489612238247837702?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"ohnYJK\">Microsoft probably did not intend on becoming the destination for skin searches, but it would become a highly concerning issue. In 2019, <a href=\"https://techcrunch.com/2019/01/10/unsafe-search/\"><em>TechCrunch</em> reported</a> that Bing was suggesting CSAM material in its searches, which Microsoft immediately put an engineering team on the case to fix.</p><p id=\"Ommu08\">People using Bing for explicit image searches also caused some headaches for Apple. In 2016, with the release of iOS 10, Apple added GIF replies in iMessage that included a search function. The feature, powered by Bing, was <a href=\"https://www.theverge.com/2016/9/15/12929890/imessage-hardcore-porn-gif-ios-10\">returning some queries</a> with hardcore pornography.</p><div class=\"c-float-right\"><aside id=\"uuZA6i\"><q>Bing was the default search, so I decided to try it out</q></aside></div><h3 id=\"dID4A9\">Good by being the default</h3><p id=\"zHvs4Y\">Another <em>Vergecast</em> listener named Logan wrote to Nilay about how it’s easy to hit the Windows button on a PC and just start typing what you’re looking for — bringing up results for things on your computer and on Bing. That’s because Bing is the default search for not only the Edge browser but also for the Windows search function. “When I downloaded Edge to try it out Bing was the default search, so I decided to try it out,” wrote Evan.</p><p id=\"xjt7DG\">Microsoft has the most popular computer OS and can leverage that to get more people to use Bing. And many users are content with that push. “Most of the time on Windows, using anything other than the default is a worse experience,” Logan wrote.</p><p id=\"DBJeMT\">As the result of Bing being the default, many users just end up using it because it’s the path of least resistance. Still, that’s not stopping all users from using Google; the search giant’s name is <a href=\"https://www.theverge.com/2021/10/1/22703263/google-lawyer-argues-bing-used-find-google-top-search-defaults\">apparently the most searched term on Bing</a>.</p><h3 id=\"UaG4T7\">Okay, you all have convinced me</h3><p id=\"a438TM\">I’m not Nilay, but after reading all your reasons, I’ve decided to give Bing a shot. I went to the site and logged in with my Microsoft account, which informed me that I have accrued 288 points — perhaps from my Series X purchase on the Microsoft Store last year.</p><p id=\"vzb2EP\">Microsoft was not convinced I’m serious enough yet, so it also informed me that using the Microsoft Edge web browser will “maximize your earning!” I didn’t feel like switching web browsers right now, but just downloading Edge seemed to be enough to earn me another five points; thanks, Microsoft!</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sg7h7nZ2flPo3JhbeAjdEqEBieI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23238521/Screen_Shot_2022_02_12_at_9.32.14_PM.png\">  </figure><p id=\"iSGQtN\">I continued in Safari on my Mac and scrolled down, checking out the latest news, recent homepage images (hey, the pictures are pretty dope), a “this day in history” feature, and finally a rundown of my current Microsoft Rewards stats. And at the very bottom, there was a big button titled “Make Bing your homepage” along with a message to convince me to follow through:</p><blockquote><p id=\"RYkEAh\"><strong>Experience beauty every day</strong><br>Never miss a moment and keep search at your fingertips. Just set Bing as your browser’s homepage with a few easy steps!</p></blockquote><p id=\"eMbODB\">Feeling bad about not installing Edge and keeping the points, I went ahead and clicked the button and was taken to a page that’s straight giving Windows Vista vibes appears. There’s another button there marked “Make Bing my homepage” along with a check box for making Bing my default search engine. I took a deep breath, thinking about how I was about to join the dozens of Bing users on a quest to get the goods like <a href=\"https://www.bing.com/rebates/details?merchant=sendflowers\">8 percent cash back at </a><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=http%3A%2F%2Fsendflowers.com&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F14%2F22929130%2Fvergecast-bing-search-listeners-using\" rel=\"sponsored nofollow noopener\" target=\"_blank\">sendflowers.com</a> right before Valentine's Day, and I click the button.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pDYnJU8mvX_BGA-jhinzSX1bjWg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23238378/Screen_Shot_2022_02_11_at_10.35.22_AM.png\">  </figure><p id=\"borFby\">For some reason, this action downloaded an executable DefaultPack.EXE on my Mac that doesn’t work, which is confusing. Maybe I should Google what to do with the file.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/l6VRMbeR0sTFOxW4AK6BZVzMGAA=/0x45:640x380/fit-in/1200x630/cdn.vox-cdn.com/assets/3241197/binglogostock2_640.jpg",
  "description": "Bing users are out there, and they want to stick it to Google.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}