{
  "title": "Apple’s Severance turns office life into purgatory",
  "url": "https://www.theverge.com/22929661/severance-review-apple-tv-plus",
  "date": "2022-02-16T14:45:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7VQdY4c96HHYx-i5tq5JjLL3r7E=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70516476/Severance_Photo_010101.0.jpg\" />    </figure>  <p id=\"l8fJn6\">True work-life balance can be as hard to achieve as inbox zero. It’s so challenging, in fact, that the characters in <em>Severance</em> go to a particular extreme to reach it: brain surgery. The show, which is streaming on Apple TV Plus, takes its name from a surgical procedure in which someone’s brain is essentially severed in two, creating two distinct persons: one for work, one for home life. The result is a show that feels a bit like a cross between <em>Black Mirror</em> and <em>The IT Crowd</em>, exploring the horrors of capitalism and technology with a banal kind of cheer.</p><p id=\"cEJPUH\">At the center of the story is a company called Lumon Industries, an Amazon-style megacorporation that dabbles in a little of everything. (“What <em>don’t</em> they make,” one character asks early on.) This means there are lots of sensitive documents to sort through. In lieu of an NDA for those tasked with sorting, the company uses a procedure called severing, in which access to someone’s memories becomes “spatially dictated.” Basically, your memories are tied explicitly to a place. What happens in the records department at Lumon headquarters stays there.</p><p id=\"2Da1YG\">It may sound like a novel way of separating your life, with work troubles staying at work, so you can focus on the rest. In practice, the procedure creates two minds in the same body: one living a normal life, the other trapped in a hellish existence where they can never leave the office. And the two are never able to interact.</p>  <figure class=\"e-image\">        <img alt=\"severance\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kdLvE-i8FYXEQqm2XSyWVgwR3CE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23236167/ATV_Severance_Photo_010108.jpg\">      <cite>Image: Apple</cite>  </figure><p id=\"nXVps2\">You’re first introduced to how this plays out through Helly (Britt Lower), a new Lumon recruit who wakes up on a conference table with no memory of where she is or how she got there. As her new manager, Mark (Adam Scott), starts asking her questions, she realizes she doesn’t remember anything at all. Not even her name. And everyone in her department is in the same position; the only life they know is inside of the office.</p><p id=\"J0W8en\">Where the show succeeds the most is in painting just how messed up this really is for the people stuck in the office. Think about it: all of the good parts of their day don’t happen to them. They don’t even sleep. For them, they leave the office one second, and the next, they’re right back. Mark says that he can feel the effects of sleeping, but it’s not something any of them actually experience for themselves. Life is just nonstop work — a never-ending purgatory inside of a cubicle. To make matters worse, they don’t have a say in being there either. The only way to quit is to file a request with their other self, and since that self has no idea how bad things are inside the office, the answer always comes back no.</p><p id=\"0rcdCz\">Lumon tries to paint over this nightmare scenario with a kind of blind optimism. Employees get excited about having a melon party and work hard so that they can get caricatures drawn of themselves. (That work involves a <em>Minesweeper-</em>like file system for encrypted data where workers need to find the “scary” numbers in a spreadsheet, which they do on delightfully retrofuturistic computers <a href=\"https://www.theverge.com/2021/7/13/22574400/loki-retro-hardware-tempad-kasra-farahani-interview-marvel-disney-plus\">that wouldn’t look out of place in <em>Loki</em></a>.) Negativity is not permitted, and handshakes are available on request.</p>  <figure class=\"e-image\">        <img alt=\"severance\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DdvMxnAIGjkwiVE-PdYUDgvcmb0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23236270/ATV_Severance_Photo_010203.jpg\">      <cite>Image: Apple</cite>  </figure><p id=\"Tkoevz\">The office is clean and mostly empty, but there’s a darkness lurking underneath. In order to improve their “mental wellbeing,” after periods of prolonged stress, employees go to wellness sessions that involve silently listening to some (probably made-up) facts about their non-office doppelgänger. The office manager, Milchick (Tramell Tillman), seems very calm and pleasant right up until he is most definitely not. And when someone breaks the rules, they’re forced into the “break room,” which involves an unsettling kind of punishment that I won’t spoil. You can’t even sneak messages to the outside work, thanks to some sci-fi tech in the elevator that detects any symbols. There’s also a not-so-subtle religious quality to how employees are forced to view Lumon and its founder, sort of an extreme version of the cult-like fandoms that form around tech moguls like Elon Musk.</p><p id=\"6r9Otx\">The doppelgängers, meanwhile, go on blissfully unaware of just how bad things are. Life is normal, except they skip over the work bits and have to deal with very nosy questions about what being severed is like. In Mark’s case, he took on the job in hopes of coping with the loss of a loved one; he figured eight hours of not remembering the pain would help. That, of course, turned out not to be the case. His days are still just as sad, only a bit shorter now.</p><p id=\"lmRRvi\">The set-up has been enough to suck me into the show’s initial two episodes. In a time when the boundaries between work and life are blurring more than ever, it’s fascinating to watch these characters go in the exact opposite direction, distanced so far from work that they don’t even know what their job really is. It’s something I might even consider... if it weren’t for the whole “office hellscape” thing.</p><p id=\"TTyZ1M\">The real tension of <em>Severance </em>comes when Mark’s two lives start to converge, and his real-world persona is confronted with the realities of Lumon and the procedure’s impact. It’s too early to tell if that storyline will carry the show for an entire nine-episode-long season. But the way the show explores its core conceit with such detail and seriousness has helped it get off to a great start — and made me realize that I should probably clock out on time more often.</p><p id=\"4XeJK1\"><small>Severance </small><small><em>starts streaming on Apple TV Plus on February 18th with two episodes, with a weekly release schedule after that.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Y0JIVQ59ZW3aCUNGhWgLn7E23II=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23236106/Severance_Photo_010101.jpg",
  "description": "The show is off to a good, if unsettling, start.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}