{
  "title": "Apple adding iPhone X TrueDepth camera repair option for easier Face ID repairs",
  "url": "https://www.theverge.com/2022/4/6/23013661/apple-iphone-x-truedepth-camera-face-id-repair-fix-service",
  "date": "2022-04-06T19:26:51.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"Face ID sensors\" src=\"https://cdn.vox-cdn.com/thumbor/1QWFOp7WmdFVzKpsb3PKStHAt8I=/111x0:2016x1270/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70718333/iphone_x_kinect.0.jpg\" />        <figcaption>Image: Apple</figcaption>    </figure>  <p id=\"VC9Zyh\">Apple reportedly will soon provide a new Face ID repair option for iPhone X that doesn’t involve replacing the whole device (<a href=\"https://www.macrumors.com/2022/04/06/face-id-repairs-expanded-iphone-x/\"><em>via MacRumors</em></a>). The option comes after <a href=\"https://www.theverge.com/2022/2/24/22949183/apple-face-id-repairs-iphone-xs\">Apple’s recent shift</a> to soon provide a TrueDepth Camera service option that can fix the face unlock feature of the 2018 iPhone XS and newer models but didn’t previously include the 2017 iPhone X.</p><p id=\"AXqmrv\">Repairing just the Face ID component can be difficult since it’s a <a href=\"https://www.theverge.com/circuitbreaker/2017/11/3/16602052/iphone-x-ifixit-teardown\">fairly complex system</a> involving four components: a flood illuminator (a part of the display assembly, more on that later), dot projector, “TrueDepth” front camera, and IR camera. If any of these components malfunction, you could lose the face unlock feature and have to resort to entering a password.</p><p id=\"qtyMaR\">Apple’s old method of dealing with broken Face ID would be to swap the whole device with a like-new refurbished replacement. And that might be OK for customers with otherwise undamaged phones, who have an AppleCare warranty, and wouldn’t mind a shiny new-looking iPhone. But most iPhone X users today probably don’t have an active AppleCare warranty since the device’s 2018 discontinuation, meaning that <a href=\"https://support.apple.com/iphone/repair/service#otherfees\">a full replacement would cost them $549</a>. There’s no mention yet of how much the TrueDepth camera replacement would cost.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9tZMb-o3Qqa4o9T_ODZm2gdWVgU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371905/x16qqOinPDGlOKQU.full.jpeg\">      <cite>Image: iFixit</cite>      <figcaption><em>The flood illuminator is a part of the display assembly, separate from the TrueDepth camera module. Failure to properly transfer it during a screen replacement previously would mean permanently losing Face ID.</em></figcaption>  </figure><p id=\"6f6j9F\">Whole unit replacements can be wasteful on the supply-chain front, though, and data transfers to a new device are always cumbersome — especially for those not paying for Apple’s iCloud backup subscription. Face ID has also been a burden in the screen replacement market, requiring the transfer of a fragile flood illuminator component and earpiece assembly to the new screen in order to maintain face unlock.</p><p id=\"vnFkAY\">It was also <a href=\"https://www.theverge.com/2021/11/9/22772433/apple-iphone-13-screen-replacements-face-id-software-update\">initially difficult</a> to replace the screens of the latest iPhone 13 models without losing Face ID. Since then, Apple had <a href=\"https://www.theverge.com/2021/11/16/22786274/apple-iphone-13-screen-replacement-face-id-ios-15-2-beta-fixes\">remedied it through a software fix</a> and also announced <a href=\"https://www.theverge.com/2021/11/17/22787336/apple-right-to-repair-self-service-diy-reason-microsoft\">a conveniently timed self-repair program</a> that will give end users and third-party service providers <a href=\"https://www.theverge.com/2021/11/19/22787245/apple-iphone-mac-self-service-program-repair-diy\">access to parts and tools</a> to fix screens, batteries, and cameras — though the TrueDepth Camera component is not yet mentioned in it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3tG8u5JNUxcwqmGa3CF69kAx7DE=/0x79:2125x1192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9256799/iphone_x_kinect.jpg",
  "description": "Apple will soon make Face ID repairs easier on iPhone X.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}