{
  "title": "Apple proposes 27 percent commission in Dutch app store dispute  ",
  "url": "https://www.theverge.com/2022/2/4/22917582/apple-netherlands-antitrust-27-percent-commission-alternative-in-app-payment-systems",
  "date": "2022-02-04T13:45:37.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ZWqKN18FumScvdbfhXtM9H8P2uY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70470695/acastro_210429_1777_epicApple_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"N96YWj\">Apple plans to <a href=\"https://developer.apple.com/support/storekit-external-entitlement/\">charge developers of dating apps a 27 percent commission</a> on any in-app purchases made via alternative payment systems in the Netherlands, <a href=\"https://developer.apple.com/news/?id=uub8j2f1&amp;1643958082\">the company has announced</a>. The change comes in response to an order from Dutch competition regulator, the Authority for Consumers and Markets (ACM), <a href=\"https://www.theverge.com/2021/12/24/22852966/apple-netherlands-dating-apps-match-tinder-app-store-competition\">which has demanded</a> that Apple allow dating app developers — and only dating app developers — to use alternatives to Apple’s in-app payment system in the country. Twenty-seven percent represents only a 3 percent reduction compared to the 30 percent commission Apple typically charges for developers using its own payment system.</p><p id=\"jXMhAG\">The announcement follows Google’s proposal to reduce its commission by <a href=\"https://www.theverge.com/2021/11/4/22763040/google-in-app-purchases-alternative-south-korea-payments\">4 percent</a> for developers using alternative payment systems in South Korea, <a href=\"https://www.reuters.com/technology/skorea-seeks-improved-compliance-plans-apple-google-app-store-law-2022-02-03/\"><em>Reuters </em>reports</a>. The proposal came in response to a <a href=\"https://www.theverge.com/2021/8/31/22643800/apple-google-south-korea-app-store-payment-legislation-passes\">law passed</a> in the country last year. South Korea’s new rules are due to be fully fleshed out by March 15th, at which point it’ll be clear exactly what platform holders like Apple and Google will need to do to comply with the law. </p><div class=\"c-float-right\"><aside id=\"sxReWc\"><q>Apple intends to appeal the Dutch regulator’s decision</q></aside></div><p id=\"sEJTKv\">According to <a href=\"https://developer.apple.com/support/storekit-external-entitlement/\">Apple’s documentation</a>, dating app developers in the Netherlands can now apply to use the alternative payment systems. They can choose between offering a third-party payment system within the app’s interface or linking out to an external website to complete a purchase. Apple has said it will also require dating app developers to submit a separate app binary in the Netherlands to enable the alternative payments. </p><p id=\"OtvEsz\">Last week the Dutch regulator <a href=\"https://www.theverge.com/2022/1/25/22900434/apple-netherlands-antitrust-competition-regulator-acm-5-million-euro-fine-in-app-payments\">hit Apple with a €5 million (around $5.7 million) fine</a> for failing to comply with its order — a fine that would repeat weekly until Apple complied. The regulator gave two reasons for fining Apple: firstly, that it hadn’t yet implemented the alternative payment systems, and secondly, that Apple had put “barriers” in place to dissuade developers from moving away from its first-party payment system, like forcing them to choose between using an alternative payment system outside of the app, or an alternative payment system within the app. </p><p id=\"66uVvx\">The announcement of Apple’s 27 percent commission was met with fury by one prominent iOS developer, <a href=\"https://twitter.com/stroughtonsmith/status/1489558951905669120\">Steve Troughton-Smith</a>, who called the commission rate “absolutely vile” and said that “everybody on their executive team should be ashamed.”</p><p id=\"9nocfS\">Apple’s proposed solution — like requiring separate binaries, developers having to report external sales back to Apple, and that meager 3 percent savings — might be too much effort for too little benefit for developers to bother using anything but Apple’s own payment system.</p><p id=\"LgRMk7\">Yesterday, <em>Reuters </em>reported that a South Korean official expressed concerns about the barriers platform holders like Apple and Google may use to dissuade developers from using alternative payment systems. “As a result of any policy, if app developers find it realistically difficult to use an alternative payment system and resort to using the dominant app store operator’s payment system, it would not fit the law’s purpose,” the official said. </p><p id=\"zSV1ER\">A spokesperson from the ACM did not immediately respond to <em>The Verge</em>’s request for comment on whether Apple’s actions today put it in compliance with the order.</p><p id=\"Lhjorz\"><a href=\"https://developer.apple.com/news/?id=uub8j2f1&amp;1643958082\">Apple maintains</a> that it is opposed to offering alternative payments, which it says “will compromise the user experience, and create new threats to user privacy and data security.” It says it is appealing the ACM decision, although it intends to comply with the order in the meantime.</p><p id=\"9NGSMG\">South Korea and the Netherlands are just two proxy battles in a wider wave of antitrust scrutiny of Apple and Google’s app store policies. Last year in the US, a judge ordered Apple to allow developers to <a href=\"https://www.theverge.com/2021/11/9/22773082/epic-apple-fortnite-lawsuit-ruling-injunction-stay-app-store-anti-steering-rules\">link out to external payment processors</a> in response to a <a href=\"https://www.theverge.com/2021/9/12/22667694/epic-v-apple-trial-fortnite-judge-yvonne-gonzalez-rogers-final-ruling-injunction-breakdown\">legal challenge by Epic Games</a>, although this order was later <a href=\"https://www.theverge.com/2021/12/8/22814147/epic-apple-app-store-injunction-paused\">put on hold pending appeal</a>.</p><p id=\"HEq2ag\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RLA9e1L-00sWgf7c7b9gGrGOSZM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22478960/acastro_210429_1777_epicApple_0002.jpg",
  "description": "In response to a Dutch ruling about dating apps.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}