{
  "title": "Apple’s new iPhone SE is a modern phone stuck in yesterday’s design",
  "url": "https://www.theverge.com/22975531/apple-iphone-se-2022-review-price-specs-screen-battery",
  "date": "2022-03-14T13:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p><em>Yesterday’s iPhone, today</em></p> <p class=\"p--has-dropcap p-large-text\" id=\"AXNfoM\">Everything about the iPhone SE is designed for the next few years except for one very important component: the screen. More specifically, the thick bezels that border the 4.7-inch LCD on the top and bottom. It’s a tired design straight out of 2017 that makes an already-small screen feel even smaller than it could be. </p><p id=\"sEuxe8\">That’s a shame because, otherwise, the SE is a fantastic midrange phone. With a starting price of $429, it will give you an excellent return on your investment since it will almost certainly get software updates for years to come. This year’s model also includes 5G and, naturally, Apple’s latest and greatest processor, both of which future-proof the phone for wireless advancements to come in the near future. </p><div id=\"fYxRN3\"><div data-anthem-component=\"scorecard:11092620\"></div></div><p id=\"3JMH7l\">There are some other notable improvements, too, like a bigger battery and some software-based camera updates, which certainly help keep the SE up to date tech-wise. And there’s still the home button with Touch ID, which some people just prefer over Face ID and gesture navigation. This iPhone SE is for them or for someone who just wants an iOS device for as little money as possible and doesn’t mind a small screen. But for everyone else, I think this vintage design is just a little too dated and probably best left in the past.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EaJMxujLNfoSys_CPIOmbl3pasI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307885/ajohnson_221103_5070_0004.jpg\">      <figcaption><em>The 2022 iPhone SE’s 4.7-inch LCD gets bright enough for outdoor use, but lacks the punchy contrast of an OLED panel.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"SaoqQ1\">The iPhone 8 chassis that the SE uses may be vintage, but underneath lies Apple’s very latest mobile processor, the A15 Bionic. It’s the same one you’ll find in the top-of-the-line 13 Pro Max. Again, the SE costs less than $500, and the 13 Pro Max costs more than twice that. That’s just plain cool. And in day-to-day use, the SE behaves like a phone with a top-tier processor. Apps open quickly, and even the graphics-intensive <em>Genshin Impact</em> runs smoothly. There’s not a lot that the SE can’t do that a $1,000-plus phone can.</p><p id=\"giDE0M\">Unfortunately, that cutting-edge performance is hampered by the small screen. It’s not a <em>bad</em> display — it’s a 4.7-inch 750 x 1334 pixel LCD that gets plenty bright for outdoor use. But you don’t get a faster refresh rate, which would make scrolling look a little smoother, you don’t get the same pop and punchiness of OLED, and it’s definitely one of the smallest screens sold on a new smartphone today. Text looks small at the default setting, and you can enlarge it, but that means doing more scrolling. </p><p id=\"KpcoNj\">Playing a game with the phone in landscape mode, I kept feeling like I was running out of room to swipe on the left side of the screen to move my character around. That poor kid in <em>Limbo</em> suffered the consequences when my thumb ended up obscuring whatever sharp object I was supposed to be avoiding. The phone is capable of running even the most graphics-heavy games well, but it’s much less enjoyable playing on a small, cramped screen than a wide-aspect display with more real estate.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VlYvRWQc1BPVa7OoO0Caobr5wMs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307887/ajohnson_221103_5070_0006.jpg\">      <figcaption><em>The SE’s small, 16:9 screen doesn’t show as much content as a taller display with thinner bezels.</em></figcaption>  </figure></div><p id=\"sNXInY\">It’s not just gaming that feels cramped on the SE — even in the phone’s native image gallery app, I have to aim carefully to tap a “pause” button that’s crammed into a tiny little navigation bar at the top of the screen when I play back a video clip in landscape mode. The icons at the bottom of the Facebook app are jammed shoulder-to-shoulder. Sometimes Instagram will load with the messages icon tucked underneath my battery life percentage. The modern internet and app experience were just not constructed for a 16:9 4.7-inch screen.</p><p id=\"Vrme0D\">Another legacy feature is that the base model SE only comes with 64GB of storage. Getting by on 64GB is possible if you’re light on app downloads and not a huge photo-taker, or you’re smart about offloading files to cloud storage. Otherwise, it’s an extra $50 for the 128GB version, which I’d recommend most people spring for if they want this phone to last more than a couple years. So consider $479 the practical price of this phone.</p><p id=\"Hp7mou\">The 2020 SE’s weakest point was its sub-par battery life, so one feature that did get a boost this year is stamina. The 2022 SE includes a bigger battery, and power management is improved with the A15 chip. That results in an extra two hours of charge for most users, according to Apple, which checks out with my experience. I got through a day and a half of moderate use and one full day of heavy use with some video recording, gaming, and a lot of screen on time with brightness boosted.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1JTKTsDaLxj3f5WcsBDio6PrvJo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307886/ajohnson_221103_5070_0005.jpg\">      <figcaption><em>A bigger battery than the previous-gen SE powers the phone through a full day of heavy use.</em></figcaption>  </figure></div><p id=\"RFVwK5\">The SE isn’t geared toward the kinds of things that drain a battery, like watching lots of video or playing graphics-intensive games, so it’s fair to say most SE owners will get through a day on a single charge. That’s a welcome improvement over the last generation and one that will probably make a bigger immediate difference to someone buying the phone than 5G or the new processor.</p><p id=\"HHNICJ\">There’s no MagSafe on the SE, which would open up a new world of accessories and attachments, but the phone still offers standard Qi wireless charging. That feature is by no means guaranteed in a phone that costs under $500, so chalk that up as another point for the SE. The phone also offers IP67 dust and water resistance — another rarity in the midrange class — so it should stand up to splashes and spills.</p><p id=\"11hDdG\">The SE also gets 5G this year. It doesn’t include mmWave, which is the very fast but hard-to-find variety that Verizon tried to convince us all was the future two years ago. <a href=\"https://www.theverge.com/22968066/apple-iphone-se-5g-mmwave-verizon-uw\">It’s not the future</a>, and it doesn’t really matter that the SE doesn’t support it because it does support low and mid-band 5G, including C-band. Verizon and AT&amp;T are expanding their 5G networks with C-band over the next few years, and that should actually improve network speeds considerably. Support for 5G is a good future-proofing feature, even if it’s not tremendously useful yet.</p><div><aside id=\"0upmy5\"><q>The iPhone SE will probably outlive the usefulness of its tiny screen</q></aside></div><p id=\"wxb9wp\">The iPhone SE’s best feature isn’t new at all: iOS. Since the phone’s introduction in 2016, the SE has provided the lowest cost of entry to Apple’s OS and ecosystem of things like blue chat bubbles, FaceTime, and <a href=\"https://www.theverge.com/2022/3/1/22947917/airtags-privacy-security-stalking-solutions\">the Find My network that’s so good it’s problematic</a>. The company also has a fantastic track record of including phones that are six, even seven years old in new OS version updates. Older phones don’t get <em>every</em> new feature in iOS 15, but they get a lot. </p><p id=\"EU08vu\">Case in point: I dug up my first-gen 2016 iPhone SE, powered it up, and downloaded iOS 15. And it works. It’s not flawless by any means, but the fact that the phone I dropped in a toilet four years ago and left for dead can still (mostly) function with the company’s current software version is pretty dang cool. (The phone is clean, I swear.)</p><p id=\"eM3yhm\">This is the paradox of the 2022 iPhone SE. It’s going to get software updates for many years to come, but it will probably outlive the usefulness of its tiny screen. Phones aren’t getting any smaller. Giant screens are here to stay, and the people who design web pages and app menus are planning accordingly. The 4.7-inch screen feels small now, and I can only imagine it’s going to feel <em>very</em> small in 2028, even if the phone is still chugging along on iOS 21.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/l9oJA8NLBK5glyjircq36PGQpi8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307881/ajohnson_221103_5070_0001.jpg\">      <figcaption><em>The iPhone SE 2022 uses last year’s camera hardware, but adds some software-based improvements on top of it.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"k9tWAS\">Like the last model, the 2022 SE includes just one rear camera, a 12-megapixel f/1.8 with optical stabilization that’s been hanging around as long as the phone’s chunky bezels, along with a 7-megapixel f/2.2 selfie camera. In fact, both of those camera modules are the same hardware you got in the 2020 model. You won’t find too many phones with a single rear camera these days, but even though the hardware is old, image quality is certainly good enough for day-to-day snapshots. It can even do decent-looking portrait mode photos with a single lens.</p><p id=\"bAl9L5\">The new processor offers some software-based improvements for this generation, adding Apple’s Deep Fusion technology to boost details in medium and dim lighting. It’s a feature that engages automatically under certain conditions, and there’s no way to tell in image metadata when it’s being used, but I can say that photos of static subjects in crappy indoor lighting look plenty detailed. </p><div id=\"rqNPEf\"><div data-anthem-component=\"gallery:11092655\"></div></div><p id=\"pKxxhH\">However, in <em>very</em> low light, the SE doesn’t do as well. That’s because there’s no night mode, a feature available on many other midrange phones sold in 2022 like the Samsung Galaxy A52 5G, Motorola Moto G Stylus 5G, and of course, the Google Pixel 5A. As a result, images in low light are very dark, and colors look muddled. Night mode on any smartphone has its limitations and usually isn’t very useful for moving subjects. But it’s a nice tool to have when conditions are dark, and flash isn’t an option, and it’s a shame that it’s not included here.</p><div id=\"RxLSUe\"><div data-anthem-component=\"imageslider:11092644\"></div></div><p id=\"Pg9x7V\">The SE continues to offer video recording at up to 4K / 60p. Video recorded at up to 30p in either 4K or 1080 resolutions offers “extended” dynamic range, which does noticeably improve clips with very high contrast, like a shot panning across a bright window and subjects under dim indoor lighting. The A15 chip also enables some improved processing for low-light video, which does a good job of removing noise, although clips look fairly soft as a result. Still, mobile video is a strength for Apple, and overall video quality on the SE is excellent considering the price bracket it’s in.</p><p id=\"jTxfpo\">Sticking with a single rear camera on the SE might be a case of Apple not fixing what isn’t broken. If SE owners are fine with one camera, why add more? The phone’s target audience probably doesn’t mind the lack of ultrawide or telephoto lenses and will likely be satisfied with what remains a very capable camera for everyday photos. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XHdLghz-5D4I6WJ6jcG0P1vZ9RE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307882/ajohnson_221103_5070_0002.jpg\">      <figcaption><em>The 2022 iPhone SE is likely the last time we’ll see this design in a new phone from Apple.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"s2N5dV\">When Dieter Bohn <a href=\"https://www.theverge.com/2020/4/22/21230308/apple-iphone-se-2-2020-review-features-specs-camera-price\">reviewed the 2020 SE</a>, he was so impressed it made him question the entire concept of the $1,000 flagship phone. That phone and this current-gen SE do a whole lot of what a premium phone can do at less than half the price. That remains very impressive, and it’s not lost on me when I pick up the SE and whip through menu screens, record great-looking 4K video, set it on my wireless charger at night, or run <em>Genshin Impact</em> with hardly a hiccup. </p><p id=\"rDzic1\">But phone design has moved on in the last two years, and the SE has stayed firmly in the past. Given just how many times per day most of us look at our phone screens and interact with them, I think it’s fair to demand a little more from your mobile device’s screen than the SE is offering.</p><div><aside id=\"lmk7O3\"><q>Phone design has moved on in the last two years, and the SE has stayed firmly in the past</q></aside></div><p id=\"VS6czl\">That’s not to say there’s nobody who should buy the SE. If you know in your heart of hearts you won’t mind a small screen for at least the next few years, and you just want a reasonably priced device that gets you through your day without any trouble, then this is the iPhone for you. It’s fast, has all the 5G bands that matter, and will most certainly get you through the foreseeable future without having to suffer the pain of making another phone purchase. </p><p id=\"EIF1i1\">For everyone else, I think a bigger screen is a necessity. If you can consider a switch to Android and the green bubble life, the Google Pixel 5A is a fantastic option that’s right around the same price. It includes an ultrawide camera, a great night mode, and, crucially, a much bigger 6.34-inch OLED screen. It’s only guaranteed updates for three years, though.</p><p class=\"c-end-para\" id=\"jxI2TI\">I have to imagine that the 2022 SE is the last time we’ll see this particular design appear in a new phone from Apple. If you’re a fan of this form factor and Touch ID, and you don’t want to let them go, then this is probably your last chance to hang onto them. If we see another SE device in two years, it will likely do away with the big bezels and the home button because life moves fast. Until then, the SE remains a powerful little phone with a retro design that’s just a bit too vintage for most of us.</p><p id=\"4lzNyR\"><em>Photography by Allison Johnson / The Verge</em></p><div><div id=\"it5cj1\"><div data-anthem-component=\"aside:11092730\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/E1_8c1Kyzz7-Ra1GYubDWckR2_0=/0x176:2040x1244/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307883/ajohnson_221103_5070_0003.jpg",
  "description": "Looking a little vintage — and not in a good way.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}