{
  "title": "Apple TV’s Pachinko is an enthralling historical epic",
  "url": "https://www.theverge.com/22994343/pachinko-review-apple-tv-plus",
  "date": "2022-03-25T13:30:00.000Z",
  "author": "Sara Merican",
  "content": "      <figure>      <img alt=\"Pachinko\" src=\"https://cdn.vox-cdn.com/thumbor/WlYk4bsISjYdPDzYVuF8bczvsgM=/12x0:6048x4024/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70670997/Pachinko_Photo_010202.0.jpg\" />        <figcaption>Image: Apple</figcaption>    </figure>  <p>A show that redefines what a ‘tentpole’ series can be</p> <p class=\"p--has-dropcap\" id=\"HM3iI5\">Watching <a href=\"https://tv.apple.com/show/pachinko/umc.cmc.17vf6g68dy89kk1l1nnb6min4?itsct=tv_box_link&amp;itscg=30200&amp;ct=Verge\"><em>Pachinko</em></a> is to have an audience with something deeply sacred and profound. Adapted from Min Jin Lee’s bestselling novel of the same name, Apple TV Plus’ most ambitious project yet is a sublime epic that questions cultural identities, national histories, and intergenerational memory and mourning.</p><p id=\"ieRtJQ\">The eight-episode series follows Sunja through the upheavals in her life across the 20th century, starting from her birth in the southern coastal city of Busan during the Japanese colonization of Korea. An exceptional boldness and truthfulness in vision reverberate through every layer of <em>Pachinko</em>: its story is full of searing humanity, its casting is thoughtful, and the project boasts a formidable multi-national team of producers, consultants, and crew. Even details like the subtitles — colored in yellow for dialogue in Korean and blue for Japanese — inscribe cultural nuance and complexity, demanding a less familiar viewer to engage actively with the text.</p><p id=\"AoHou6\"><em>Pachinko </em>will undoubtedly land differently with various audiences depending on their proximity to the show’s historical context, but ultimately, this is a story in search of a spiritual response — one that will linger indelibly in a viewer’s consciousness.</p><div class=\"c-wide-block\"><div id=\"diPoK0\"><div ><iframe src=\"https://www.youtube.com/embed/O1r5XXJOYNA?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"JmkPn3\">Directed by Justin Chon (<em>Blue Bayou</em>, <em>Gook</em>) and <a href=\"https://www.theverge.com/2022/3/9/22967466/after-yang-kogonada-interview\">Kogonada</a> (<em>After Yang</em>, <em>Columbus</em>), the series jumps between early 1900s Korea and 1980s Japan, and takes many other detours throughout. We meet a whole cast of characters from Sunja’s life: her parents, suitors, children, sister- and brother-in-law, boarders living in her parents’ home, and grandson Solomon Baek. Sunja’s character is played by a cast of three phenomenal actresses, Jeon Yu-na (in her childhood years), Kim Min-ha (as a teenager), and Academy Award-winner Youn Yuh-jung (in her later years). <em>Pachinko</em> also stars Lee Min-ho (Koh Han-su), Anna Sawai (Naomi), and Jin Ha (Solomon Baek). </p><p id=\"Zsx2oU\">The nonlinear construction of time in the <em>Pachinko</em> series marks a significant departure from Lee’s novel, which progresses chronologically, turning this adaptation into a radically different project. Some of <em>Pachinko’</em>s jumps between past and present play out majestically — fleshing out themes like displacement, cultural identity, death, migration, yearning, and ambition. Being able to witness the full expanse of history, it is easy to grow fond of Pachinko’s characters, understanding the past strife that they are burdened and enlightened by. </p><p id=\"HKZxB1\">In these better juxtapositions, <em>Pachinko’</em>s achronological movements imbue the present with the gravity of the past and the sacredness of the grand stories of old. For example, a bowl of Korean white rice (“nuttier” and “sweeter”) that Sunja eats while visiting another <em>zainichi </em>lady’s house suddenly takes on ancient meanings: a resonance of childhood, a grain seller’s generosity, and a mother’s parting gift. With knowledge of past events through the intercutting of scenes, these meanings become touched with the sacred grief of all that one has loved and lost, yet also soothed by the consolation that remembrance brings.</p><p id=\"DOWzBW\">In other moments however, there is a question of whether these temporal jumps decenter Sunja’s experience for the sake of TV suspense and interrupt the emotional journey that a viewer might have with Sunja. <em>Pachinko</em> might have worked better if it was stingier with the number of cuts between past and present, allowing viewers to linger with the characters and grow with them. One episode towards the later part of the series also takes a historical detour that feels particularly disjointed with the rest of the story. Yet, these bumps do not take away the shine from <em>Pachinko</em> — the sheer force and momentum of its story emphatically drive it from beginning to end. </p><p id=\"BcmzVA\">Besides its preoccupation with time, <em>Pachinko</em> is also a meditation about land. Solomon Baek, Sunja’s grandson, is well-groomed and America-educated, caught between several identities and cultures. Despite having a record of successful deals, he is denied a pay bump and promotion — and the accompanying respect — at his New York finance firm. To impress the upper management, he takes on the challenge of scooping up a final, tiny plot of land on a site in Tokyo marked for future hotel development. He is unfazed by the “one landowner hold[ing] the entire deal hostage” — an elderly <em>zainichi </em>Korean lady, Grandmother Han. She refuses to sell her home on the site, spurning repeated offers from developers. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Pachinko\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mN7uFWXIls4eEJ98XOYyoyNhufc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23341970/Pachinko_Photo_010301.jpg\">      <cite>Image: Apple</cite>  </figure></div><p id=\"WBUw7J\">A shot revealing a bird’s-eye view of mammoth construction cranes and equipment already on-site shows the ground being leveled all around. The area has turned into a dreary brown, ready for the development of Tokyo’s high-rises and towers, inviolable proof that the machines of cosmopolitanism and capitalist progress are alive and churning. We learn that grandmother Han — who moved to Japan in 1929 — had bought the plot of land in 1955 for 4,000 yen. Besides sharing stories of his grandmother and their similar cultural backgrounds to break the ice, Solomon attempts to charm Grandmother Han with rare gifts and an increased offer of one billion yen, but she remains stubbornly unwilling to sell the house. He reassures her, “Grandmother, you won. Today you’ll secure great wealth for your children and their children.” Solomon’s colleague, the brash Tom Andrews, cannot understand, calling Grandmother Han’s plot a “tiny piece of shitland.” Another colleague, Naomi, tactfully suggests, “It’s not about the money, not for her.” </p><p id=\"0ms0BT\">Grandmother Han painfully shares with Solomon that her children, born and raised in Japan, “don’t even know the language in which their mother dreams.” The Japanese occupation of Korea ripped away the ground of her homeland from beneath her feet, forced her to move to Tokyo, and then cleaved her native Korean tongue from her children and descendants. If land is the beginning of belonging, then colonization is the traumatic rupture of this principle: the colonized becomes an exile in one’s own home. For the elderly Korean woman unwilling to sell her Tokyo house, clinging on to this plot of land in the country of her colonizer is therefore a radical act — it is a redemptive rebellion, a reclamation of space born from the ashes of personal and national tragedy. </p><p class=\"c-end-para\" id=\"IC1xgG\">In many ways, the enormity of the <em>Pachinko</em> series extends far beyond the small screens we watch it on. It speaks to — and also challenges — our cultural moment. <em>Pachinko</em> is a (long overdue) redefinition of what “tentpole” content from a major streamer can be: whose story it tells, where it comes from and who should have more seats at the table. Pachinko has the qualities to become the new standard-bearer of what a show on a streamer can aspire to be, given the international resources, expansive global reach, and creative expression that a streaming platform like Apple TV Plus offers. In <em>Pachinko</em>, Apple has woven together an extraordinary project that will hopefully herald many more to come.</p><p id=\"b1DsLo\"><small>Pachinko </small><small><em>premieres on</em></small><a href=\"https://tv.apple.com/show/pachinko/umc.cmc.17vf6g68dy89kk1l1nnb6min4?itsct=tv_box_link&amp;itscg=30200&amp;ct=Verge\"><small><em> Apple TV Plus</em></small></a><small><em> on March 25th.</em></small></p><p id=\"7UHoE0\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yPr-LUTVmb_wigARL4F6DBTQTSo=/0x254:6048x3420/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23341968/Pachinko_Photo_010202.jpg",
  "description": "Premiering on March 25th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}