{
  "title": "Apple will allow Dutch dating apps to use other payment options within existing apps",
  "url": "https://www.theverge.com/2022/3/30/23003571/apple-app-store-netherlands-acm-alternate-payment-systems-binaries-ios",
  "date": "2022-03-30T22:16:16.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Apple\" src=\"https://cdn.vox-cdn.com/thumbor/Ky7H1HGFyj5sB-VnRgPlQsH4C14=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70691441/acastro_170731_1777_0003_v6.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"8hXuTX\">To help bring an end to wrangling with Dutch regulators that stretched over the last several months, today, Apple <a href=\"https://developer.apple.com/news/?id=jmps5hyj\">published a new version of its App Store rules</a> that allow local dating apps to take payments through third-party processors. Until now, its proposals to comply with a December ruling mandating the change had not satisfied the <a href=\"https://www.acm.nl/en/publications/acm-obliges-apple-adjust-unreasonable-conditions-its-app-store\">Netherlands Authority for Consumers and Markets</a> (ACM) and earned Apple 50 million euros worth of fines. </p><p id=\"TvhrH8\">Apple previously announced that it would allow dating apps to use alternative payment systems, but it imposed various conditions on how they could do so. Developers would have to submit a separate app binary for the Dutch App Store, and would have to choose between using its in-app payment system or a third-party version, rather than being able to offer both in the same app. And most notably, it said it intended to collect a <a href=\"https://www.theverge.com/2022/2/4/22917582/apple-netherlands-antitrust-27-percent-commission-alternative-in-app-payment-systems\">27 percent commission</a> on payments made using alternative payment systems. </p><p id=\"mMutlB\">Now Apple is giving up on its insistence on a separate binary for apps that see outside payment systems. According to Apple, “This change means that developers may include either entitlement in their existing dating app, but still must limit its use to the app in the Netherlands storefront and on devices running iOS or iPadOS.” It also laid out more specifics on how to evaluate non-Apple payment system providers and examples for the pages apps need to present to customers to inform them they’re about to interact with a non-Apple payment service.</p>  <figure class=\"e-image\">        <img alt=\"Alternate payment processor sample screen\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZYvfTsQLrbmf_Cf4AtR6xtp5Gwk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23356236/apple_alt_payments.jpg\">      <cite>Image: Apple</cite>  </figure><p id=\"igu5qv\">The company has consistently maintained its opposition to the ACM’s order, which Apple says will lead to threats to user privacy and data security. As Apple’s post for developers still says “we disagree with the ACM’s original order and are appealing it.” In the meantime, Apple will still insist on collecting that 27 percent commission on transactions for apps that link out or use a third-party payment system.</p><blockquote><p id=\"cjzHB6\">Consistent with the ACM’s order, dating apps that are granted an entitlement to link out or use a third-party in-app payment provider will pay Apple a commission on transactions. Apple will charge a 27% commission on the price paid by the user, net of value-added taxes. This is a reduced rate that excludes value related to payment processing and related activities. Developers will be responsible for the collection and remittance of any applicable taxes, such as the Netherlands’ value-added tax (VAT), for sales processed by a third-party payment provider.</p><p id=\"ON9VmM\">Developers using these entitlements will be required to provide a report to Apple recording each sale of digital goods and content that has been facilitated through the App Store. This report will need to be provided monthly within 15 calendar days following the end of Apple’s fiscal month. To learn about the details that will need to be included in the report, view an example report. Qualifying developers will receive an invoice based on the reporting and will be required to remit payment to Apple for the amount invoiced within 45 days following the end of Apple’s fiscal month. In the future, if Apple develops technical solutions to facilitate reporting, developers will be required to adopt such technologies.</p></blockquote><p id=\"p3bIEH\">The ACM <a href=\"https://www.acm.nl/en/publications/acm-assess-adjusted-proposal-apple-regarding-its-conditions-dating-apps\">said on Monday that its next step</a> is to present the policy to “market participants for consultation.” If they accept the terms, then Apple may avoid an escalation in fines.</p><p id=\"PpcH9V\">The dispute with the Dutch competition regulator is limited in scope, and concerns just one kind of software on the App Store. But it’s part of a wave of antitrust scrutiny that Apple is facing around the world. The EU’s <a href=\"https://www.theverge.com/2022/3/24/22994234/eu-antitrust-legislation-dma-digital-markets-act-details\">Digital Markets Act</a> could require support for external payment processors in all apps after it goes into effect this fall, while <a href=\"https://www.theverge.com/2021/8/31/22643800/apple-google-south-korea-app-store-payment-legislation-passes\">South Korea recently passed a similar law.</a> Apple’s in-app payments system was the focus of a recent <a href=\"https://www.theverge.com/2021/4/29/22410877/epic-games-apple-app-store-antitrust-trial-lawsuit-news\">high-profile court battle with Epic Games</a>, which eventually resulted in a US judge <a href=\"https://www.theverge.com/2021/11/9/22773082/epic-apple-fortnite-lawsuit-ruling-injunction-stay-app-store-anti-steering-rules\">ordering Apple to allow developers to link out</a> to other payment options. The order was <a href=\"https://www.theverge.com/2021/12/8/22814147/epic-apple-app-store-injunction-paused\">subsequently put on hold</a> pending appeal.</p><aside id=\"vQTQhV\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple would be forced to allow sideloading and third-party app stores under new EU law \",\"url\":\"https://www.theverge.com/2022/3/25/22996248/apple-sideloading-apps-store-third-party-eu-dma-requirement\"}]}'></div></aside><p id=\"MS0CSz\"><em><strong>Update March 30th, 6:15PM ET:</strong></em><em> Added additional context.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9trD9FUxSCoGEeFiHnBBHSyGYaU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8964163/acastro_170731_1777_0003_v6.jpg",
  "description": "Apple gets its cut even if you pay through another system.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}