{
  "title": "Apple and Meta shared data with hackers pretending to be law enforcement officials",
  "url": "https://www.theverge.com/2022/3/30/23003600/apple-meta-shared-data-hackers-pretending-law-enforcement-officials",
  "date": "2022-03-30T21:59:43.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Q0Sq5cNoq7ikt_uz1_LgYShRwwc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70691631/acastro_180604_1777_apple_wwdc_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"76HZcq\">Apple and Meta handed over user data to hackers who faked emergency data request orders typically sent by law enforcement, according to a report by <a href=\"https://www.bloomberg.com/news/articles/2022-03-30/apple-meta-gave-user-data-to-hackers-who-forged-legal-requests\"><em>Bloomberg</em></a>. The slip-up happened in mid-2021, with both companies falling for the phony requests and providing information about users’ IP addresses, phone numbers, and home addresses.</p><p id=\"xffXQD\">Law enforcement officials often request data from social platforms in connection with criminal investigations, allowing them to obtain information about the owner of a specific online account. While these requests require a subpoena or search warrant signed by a judge, <em>emergency</em> data requests don’t — and are intended for cases that involve life-threatening situations.</p><p id=\"r7VFx5\">Fake emergency data requests are becoming increasingly common, as explained in a recent report from <a href=\"https://krebsonsecurity.com/2022/03/hackers-gaining-power-of-subpoena-via-fake-emergency-data-requests/\"><em>Krebs on Security</em></a>. During an attack, hackers must first gain access to a police department’s email systems. The hackers can then forge an emergency data request that describes the potential danger of not having the requested data sent over right away, all while assuming the identity of a law enforcement official. According to <em>Krebs</em>, some hackers are selling access to government emails online, specifically with the purpose of targeting social platforms with fake emergency data requests.</p><div class=\"c-float-right\"><aside id=\"ijH6Sj\"><q>Fake emergency data requests are most often carried out by teenagers</q></aside></div><p id=\"4db6p2\">As <em>Krebs</em> notes, the majority of bad actors carrying out these fake requests are actually teenagers — and according to <em>Bloomberg</em>, cybersecurity researchers believe <a href=\"https://www.theverge.com/2022/3/23/22993731/lapsus-hacking-group-teenager-mastermind\">the teen mastermind behind the Lapsus$ hacking group</a> could be involved in conducting this type of scam. <a href=\"https://www.theverge.com/2022/3/24/22994563/lapsus-hacking-group-london-police-arrest-microsoft-nvidia\">London police have since arrested</a> seven teens in connection with the group.</p><p id=\"deVAY7\">But last year’s string of attacks may have been performed by the members of a cybercriminal group called Recursion Team. Although the group has disbanded, some of them have joined Lapsus$ with different names. Officials involved in the investigation told <em>Bloomberg</em> that hackers accessed the accounts of law enforcement agencies in multiple countries and targeted many companies over the course of several months starting in January 2021.</p><p id=\"hy34wW\">“We review every data request for legal sufficiency and use advanced systems and processes to validate law enforcement requests and detect abuse,” Andy Stone, Meta’s policy and communications director, said in an emailed statement to <em>The Verge</em>. “We block known compromised accounts from making requests and work with law enforcement to respond to incidents involving suspected fraudulent requests, as we have done in this case.”</p><p id=\"E4uxh7\">When asked for comment, Apple directed <em>The Verge</em> to its <a href=\"https://www.apple.com/legal/privacy/law-enforcement-guidelines-us.pdf\">law enforcement guidelines</a>, which state: “If a government or law enforcement agency seeks customer data in response to an Emergency Government &amp; Law Enforcement Information Request, a supervisor for the government or law enforcement agent who submitted the Emergency Government &amp; Law Enforcement Information Request may be contacted and asked to confirm to Apple that the emergency request was legitimate.”</p><p id=\"mO5ggI\">Meta and Apple aren’t the only known companies affected by fake emergency data requests. <em>Bloomberg</em> says hackers also contacted Snap with a forged request, but it’s not clear if the company followed through. <em>Krebs on Security</em>’s report also includes a confirmation from Discord that the platform gave away information in response to one of these fake requests. Snap and Discord didn’t immediately respond to requests for comment from <em>The Verge.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/W4T_cOXSKByy6vwN8c-FcH-1S4A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477051/acastro_180604_1777_apple_wwdc_0003.jpg",
  "description": "Bad actors contacted the platforms with emergency data requests.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}