{
  "title": "Apple could announce new ‘Mac Studio’ and ‘Studio Display’ today",
  "url": "https://www.theverge.com/2022/3/8/22966832/apple-mac-studio-prodisplay-monitor-march-2022-event-iphone-se",
  "date": "2022-03-08T09:33:58.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"Apple Museum in Kyiv\" src=\"https://cdn.vox-cdn.com/thumbor/WR0WVjkiczEskNnqmZBzKi7gxWE=/0x3:6016x4014/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70592812/910723618.0.jpg\" />        <figcaption><em>The Mac Studio’s design is said to be inspired by Apple’s Power Mac G4 Cube from 2000.</em> | Photo by Oleksandr Rupeta/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"a0spI0\">Today’s Apple event could see the announcement of an all-new “Mac Studio” as well as a new standalone monitor, possibly called the “Studio Display,” according to a variety of last-minute rumors and tweets from <a href=\"https://twitter.com/markgurman/status/1500965814056402945\"><em>Bloomberg’s</em> Mark Gurman</a>. </p><p id=\"xAKqu2\">The new Mac is said to be smaller than a Mac Pro, but more powerful than a Mac mini, which could position it as a compact standalone computer targeted at professionals. The name “Mac Studio” first appeared in a <a href=\"https://9to5mac.com/2022/03/04/exclusive-mac-studio-is-coming-is-it-the-pro-mac-mini-or-mini-mac-pro/\">report last week from <em>9to5Mac</em></a>. Meanwhile, the new monitor (which could be the “Studio Display” model that <a href=\"https://9to5mac.com/2022/03/04/apple-studio-display-7k-exclusive/\"><em>9to5Mac </em>has reported on</a>) will reportedly run iOS and be powered by one of Apple’s A-series chips, which are normally found in its iPhones and iPads. The exact specs of the monitor are unclear, with reports claiming Apple is working on both 5K and 7K models.</p><p id=\"aIXEcv\">Gurman reports that both devices are “ready to go,” which is why he’s expecting an announcement today. But in an earlier tweet, he reported that Apple is planning a <a href=\"https://twitter.com/markgurman/status/1500922411281264642\">second  rollout</a> sometime in May or June, where additional Macs could be launched. </p><div id=\"MfPTjW\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Running iOS = has an A-Series chip powering it.</p>— Mark Gurman (@markgurman) <a href=\"https://twitter.com/markgurman/status/1500966484314660866?ref_src=twsrc%5Etfw\">March 7, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"yN05rr\"><a href=\"https://twitter.com/mingchikuo/status/1500507564148400128\">Ming-Chi Kuo</a>, another source of reliable Apple rumors, also believes that Apple has a more powerful Mac mini on the way this year, which he thinks will be joined by a “more affordable” 27-inch display. However, his tweet doesn’t mention whether he expects them to be announced this week, and only notes that he expects both to arrive sometime this year. </p><p id=\"0l4cKJ\">Gurman’s Mac prediction <a href=\"https://www.bloomberg.com/news/articles/2021-01-15/apple-plans-redesigned-imac-new-mac-pro-smaller-mac-pro-cheaper-monitor\">dates back to January 2021</a>, when he reported that Apple had a new Mac in development that would be aimed at professionals and would be “half the size” of the current Mac Pro. “The design will feature a mostly aluminum exterior and could invoke nostalgia for the <a href=\"https://en.wikipedia.org/wiki/Power_Mac_G4_Cube\">Power Mac G4 Cube</a>,” he wrote at the time. </p><p id=\"WQG3AQ\">In the same January 2021 article, Gurman also reported that Apple had started development on a lower-priced alternative to its $5,000 6K <a href=\"https://www.theverge.com/2020/3/2/21161487/apple-mac-pro-display-xdr-review-6k-lcd-screen-price-features\">Pro Display XDR</a> aimed at consumers rather than professionals. In a tweet this week, Gurman reports that Apple may have two displays in development: a 5K low-end model, and a 7K successor to the current Pro Display XDR. If Kuo and Gurman’s predictions are accurate, it sounds like we might be on track to see the 5K model announced today. </p><p id=\"WTvrQc\">The “Mac Studio” and new external “Studio Display” could be announced at an event that’s expected to focus on a new 5G-capable iPhone SE, and will also feature an updated iPad Air with 5G support. Here’s a <a href=\"https://www.theverge.com/2022/3/6/22960325/apple-march-2022-event-iphone-se-peek-performance-rumors-announcements\">full rundown of what we’re expecting</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9Ckc88eKMu47-uSl4xJ2c3_wZzU=/0x433:6016x3583/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23297585/910723618.jpg",
  "description": "Halfway between a Mac Pro and a Mac mini.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}