{
  "title": "Apple’s newest subscription service is an IT management package for small businesses ",
  "url": "https://www.theverge.com/2022/3/31/23005413/apple-business-essentials-mdm-icloud-security",
  "date": "2022-03-31T23:36:20.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9wEiY6IfhFDq3sImmUUVDzQZyl4=/168x133:820x568/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70696298/Apple_Business_Essentials_lifestyle_iPad_mini_big.jpg.large.0.jpg\" />        <figcaption><em>The new Business Essentials app is a portal that can distribute software and company resources.</em> | Image: Apple</figcaption>    </figure>  <p id=\"MHIJqf\">The Business Essentials subscription service that Apple announced and <a href=\"https://www.theverge.com/2021/11/14/22781752/apple-business-enterprise-mdm-essentials-cloud-storage-security\">introduced in a limited beta late last year</a> is <a href=\"https://www.apple.com/newsroom/2022/03/apple-business-essentials-now-available-for-small-businesses/\">now available for any small business</a>. This is Apple’s vertical integration of device management and cloud storage under the Business Manager platform that companies already use to buy and manage their Apple hardware, which is designed for organizations with fewer than 500 employees. Now that it’s officially launched, it also includes an optional new business tier of AppleCare Plus hardware coverage with 24/7 support and the ability to call an Apple-trained tech onsite in as little as four hours.</p><p id=\"UaIEvV\">The subscription ties traditional IT services into one portal with a rate starting at $2.99 per employee per month. Apple is opening its doors with a two-month free trial, which is available for companies that were already part of the beta test.</p><div class=\"c-float-right\"><aside id=\"xyYTuP\"><q>Business Essentials covers basic onboarding, configuration, and tech support — for iPads, iPhones, Apple TVs, and Macs.</q></aside></div><p id=\"hmv7Rp\">Businesses that could use this package, or a third-party setup like it, probably already have access to Apple’s <a href=\"https://business.apple.com/\">Business Manager portal</a>. It’s how businesses (and similarly, schools with Apple School Manager) can reserve and distribute managed Apple IDs, so employees can’t accidentally make a personal Apple ID account. It can also automatically procure devices purchased directly from Apple, acquire software licenses in the App Store, sync directories (Microsoft Azure), and more.</p><p id=\"I7hZHr\">The biggest change for those tasked with IT management comes on the deployment and management side: small business customers can use Apple’s service to push pre-configured packages directly to employees’ devices with their Wi-Fi / VPN settings, mandated FileVault encryption, and apps. Then employees can view their setups, access support, or track repairs via the Business Essentials app. Previously, getting deployment and management features on Apple devices required another service and the expertise to use it. The biggest thing this setup can’t do, though, is work with mobile or desktop devices that aren’t made by Apple.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sKy7CM80KEkxkYqoe1L5YUvKSbw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23358829/Screen_Shot_2022_03_31_at_3.43.19_PM.png\">      <figcaption><em>Max out the subscription to $24.99 per month for one employee.</em></figcaption>  </figure></div><p id=\"BdZb4f\">For small businesses that are looking for a simplified and linear approach to Mac management, or who don’t have the capacity in IT personnel, Apple’s new solution might be compelling. The starting price of $2.99 per month, per employee, covers one device and 50GB of iCloud storage, then jumps to $6.99 for 200GB and $12.99 for 2TB.</p><p id=\"3NnDfV\">AppleCare Plus for Business Essentials is an additional $7 per month for the single device tier (covers one repair or replacement) or an additional $13 per month for the three devices and 200GB iCloud tier (covers two repairs or replacements). At the maximum, a single employee can cost $24.99 per month with three devices, 2TB iCloud storage, and AppleCare Plus for Business Essentials (a cost savings of $1 a month on the AppleCare).</p><p id=\"m3ZxAD\">IT managers can enroll in the new service by navigating to the company’s existing Apple Business Manager site and clicking on the newly added “Subscription” menu on the sidebar. Once enrolled, new sidebar menu options including Service &amp; Support and Collections will appear. Other features include the ability to have employees set up business accounts on their own computers or phones, without the worry of risking business or private data — Apple's solution allows for personal data to be “cryptographically separated” from work data.</p><p id=\"2Wa5mr\">Apple’s new service presents an alternative to established solutions like Jamf, which is used by thousands of businesses and universities, works with Apple’s Business / School Manager platforms, and has much more comprehensive features including security software solutions. But for small businesses that just need to just easily enroll newly purchased Apple hardware, provide basic onboarding support, and only need to distribute software from Apple’s App store repository, Apple’s Business Essentials certainly might cover — well — the essentials.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZqBEvMnaWw5RG1qvMpQhcobZXRc=/168x180:820x521/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23358818/Apple_Business_Essentials_lifestyle_iPad_mini_big.jpg.large.jpg",
  "description": "Apple’s Business Essentials subscription is out of beta",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}