{
  "title": "Apple’s $55 million fine over in-app payments for Dutch dating apps could start growing faster",
  "url": "https://www.theverge.com/2022/3/28/22999998/apple-bigger-fine-proposal-dutch-regulator-acm-netherlands-dating-apps",
  "date": "2022-03-28T19:29:31.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1fo2VTyS7rxNuVbF6_Sr5Y3qUG8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70682087/acastro_170731_1777_0001_v2.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"FBQxKS\"><a href=\"https://www.acm.nl/en/publications/acm-assess-adjusted-proposal-apple-regarding-its-conditions-dating-apps\">Apple could pay an even larger periodic fine</a> if the Dutch competition regulator doesn’t approve of its latest proposal to address its demands to allow dating apps to use alternate formats of payments. The Netherlands Authority for Consumers and Markets (ACM) has fined Apple the maximum of €50 million (~$55 million USD) for failing to satisfy <a href=\"https://www.theverge.com/2021/12/24/22852966/apple-netherlands-dating-apps-match-tinder-app-store-competition\">its order</a>, and the fine on Monday marks Apple’s 10th penalty. </p><p id=\"M8iysQ\">Apple’s new proposal, submitted on the 27th, is currently under review by the ACM, which says it may force Apple to pay another round of fines “with possible higher penalties.” The Dutch regulator has been levying its fines in weekly €5 million (~$5.5 million USD) increments, but the ACM makes it clear that this amount is subject to increase. If the new proposal leads to “definitive conditions” for dating apps, the ACM says it will pass those to developers for evaluation. From there, the ACM will give Apple its final decision on whether or not the company’s in compliance.</p><blockquote><p id=\"HA9H3c\">On Sunday, March 27, Apple adjusted its proposal concerning compliance with the requirements set by the Netherlands Authority for Consumers and Markets (ACM) under Dutch and European competition rules. ACM welcomes Apple’s current step. The adjusted proposal should result in definitive conditions for dating-app providers that wish to use the App Store. Once the proposal for definitive conditions has been received, ACM will submit it to market participants for consultation. ACM will then as soon as possible hand down its decision whether Apple, when implementing those definitive conditions, is in compliance with ACM’s requirement that alternative methods of payment should be possible in dating apps.</p><p id=\"4bJvZG\">Until last weekend, Apple still had not met ACM’s requirements. That is why it has to pay a tenth penalty payment, which means that Apple must pay the maximum penalty of 50 million euros. If ACM comes to the conclusion that Apple does not meet the requirements, ACM may impose another order subject to periodic penalty payments (with possibly higher penalties this time around) in order to stimulate Apple to comply with the order.</p></blockquote><div class=\"c-float-right\"><aside id=\"Q4ey9A\"><q>“Only a monopolist would prefer to pay €50 million in fines instead of outright complying with the rule of law”</q></aside></div><p id=\"EH4rHM\">There aren’t any details about what’s included in Apple’s new proposal, but the company hasn’t been the most flexible when it comes to complying with the ACM’s orders. In January, <a href=\"https://www.theverge.com/2022/1/15/22885065/apple-netherlands-dating-apps-third-party-payment-options\">Apple said it will let dating apps</a> offer alternate payment options, but only if developers create and upload a separate version of their apps specific to the Netherlands. It would then charge the apps <a href=\"https://www.theverge.com/2022/2/4/22917582/apple-netherlands-antitrust-27-percent-commission-alternative-in-app-payment-systems\">a barely-reduced commission of 27 percent</a> — instead of 30 percent — on any purchases made with other payment providers.</p><p id=\"GaemBw\">“Only a monopolist would prefer to pay €50 million in fines instead of outright complying with the rule of law,” said Rick VanMeter, the executive director of the Coalition for App Fairness. “We support the ACM’s persistence in holding Apple accountable these past 10 weeks.” The CAF is made up of a group of companies that advocate for competition and accountability for app stores, with founding members that include Epic Games, Spotify, and Tile.</p><p id=\"mPllUH\">Apple’s decision to block developers from incorporating alternate payment options has long been criticized by a number of tech companies, including <a href=\"https://www.theverge.com/2019/3/13/18263453/spotify-apple-app-store-antitrust-complaint-ec-30-percent-cut-unfair\">Spotify</a>, the <a href=\"https://www.theverge.com/2020/6/17/21294230/epic-games-match-group-spotify-eu-apple-app-store\">Tinder parent company Match Group</a>, and most notably, <a href=\"https://www.theverge.com/2021/4/29/22410877/epic-games-apple-app-store-antitrust-trial-lawsuit-news\">Epic Games</a>. Google, which <a href=\"https://www.theverge.com/21445923/platform-fees-apps-games-business-marketplace-apple-google\">takes a commission of 15 or 30 percent</a> from apps on the Play Store, <a href=\"https://www.theverge.com/2022/3/23/22993417/google-pilot-test-android-alternate-billing-systems-spotify\">announced last week</a> that it will test allowing Android developers to use other payment options, with Spotify as its first subject.</p><p id=\"jmOH4Z\"><em>The Verge</em> reached out to Apple with a request for comment but didn’t immediately hear back.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uQ7d5I9dU2wF97hvQbchzwn1i0Q=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8964129/acastro_170731_1777_0001_v2.jpg",
  "description": "Apple’s €5 million weekly fine just might increase.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}