{
  "title": "Apple will no longer repair iPhones marked as missing",
  "url": "https://www.theverge.com/2022/3/29/23002123/apple-store-repair-iphone-stolen-missing-flagged",
  "date": "2022-03-29T22:42:45.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LMAUEX9Cg5b7hw3ARe_OHln26pE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70687250/acastro_170731_1777_0003_v2.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"hQxYs8\">Apple Stores and authorized service providers will no longer repair iPhones that have been reported as missing through the <a href=\"https://www.gsma.com/services/deviceregistry/\">GSMA device registry</a>, according to an internal memo obtained by <a href=\"https://www.macrumors.com/2022/03/29/apple-stores-iphones-reported-missing-policy/\"><em>MacRumors</em></a>. The company now requires repair technicians to deny users a repair if they’re notified of its missing status in the MobileGenius or GSX systems they use to service customers.</p><p id=\"k4jBTk\">The GSMA device registry is a database of device serial numbers with information about each device’s status. For example, if someone reports their phone as stolen to law enforcement, the authorities may flag the device through GSMA, which can help repair providers identify a device as missing if it ever comes into their shop.</p><div class=\"c-float-right\"><aside id=\"WOyHoB\"><q>Apple’s new policy builds on its existing rules</q></aside></div><p id=\"es1d0M\">Apple’s new policy is designed to prevent its repair providers from fixing phones that may have fallen into the wrong hands. It builds on its <a href=\"https://al-support.apple.com/#/additional-support\">existing rules</a> that bar technicians from removing a device’s Activation Lock unless the customer can provide proof that they purchased it. Apple will also refuse to perform a repair if users <a href=\"https://www.theverge.com/22697218/iphone-apple-ios-15-find-my-how-to\">put their device in Lost Mode</a> through the Find My app, which locks the device and displays contact information on the lock screen.</p><p id=\"J1hPyR\">The company still hasn’t publicly confirmed <em>MacRumors</em>’ findings. <em>The Verge</em> reached out to Apple with a request for comment but didn’t immediately hear back.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/oKEDhFFB3P_BCXggxvGruItz7Jo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8964151/acastro_170731_1777_0003_v2.jpg",
  "description": "iPhones reported as missing are flagged.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}