{
  "title": "Apple Maps’ EV routing is finally coming to the Ford Mustang Mach-E ",
  "url": "https://www.theverge.com/2022/3/21/22985495/apple-maps-ev-routing-ford-mach-e-charging",
  "date": "2022-03-21T17:44:15.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OmuTEkpOnZncSml1Ck8VsQf_52E=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70652877/sokane_210121_4386_0008.0.jpg\" />        <figcaption>Photo by Sean O’Kane / The Verge</figcaption>    </figure>  <p id=\"Diw650\">Ford Mustang Mach-E owners will seemingly soon have another option for planning out a route: Apple Maps’ long-awaited EV routing (<a href=\"https://9to5mac.com/2022/03/18/mach-e-ev-routing-apple-maps-carplay/\">via <em>9to5Mac</em></a>). It’s understandable if that feature doesn’t ring a bell — Apple <a href=\"https://www.theverge.com/2020/6/22/21299325/apple-ios14-maps-updates-cycling-directions-electric-charging-wwdc-2020\">announced it at WWDC 2020</a>, saying that it’d be coming to BMW and Ford cars with iOS 14, but it’s mostly been silent about it since. According to <a href=\"https://www.apple.com/maps/\">the Apple Maps site</a>, the feature assesses “your charge level, elevation, and compatible charging stops along your route.”  </p><p id=\"NO1eVP\">A page posted to <a href=\"https://www.ford.com/support/how-tos/electric-vehicles/ev-range/what-is-the-electric-vehicle-ev-routing-feature-in-apple-maps/\">Ford’s website</a> says that Mach-E owners with either a 2022 model year vehicle or certain versions of the ’21 model will be able to access the route planning while using CarPlay (though it does mention it hopes to get it to all Mach-E drivers by the end of the year). After they’ve enabled it, Ford says the screen will show how much battery the car will have left when you get to your destination. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lJE_gdTQQAAHIeGbV8p7wnFN8uU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23328469/6c267140_ccf1_4cd3_b55d_f184a36b8a1a.png\">      <cite>Image: Ford</cite>      <figcaption><em>I do wish Ford had shown what this would look like for a longer drive.</em></figcaption>  </figure><p id=\"Hqpcs6\">It’s possible the Mach-E could be the first vehicle to get this feature, which would mean that there was <em>quite </em>a long wait between announcement and rollout. Scouring the internet, I couldn’t find solid reports that the feature has made its way to any BMW models — i3 owners <a href=\"https://discussions.apple.com/thread/252696780\">seemed pretty sure they wouldn’t be getting it</a>, and i4 buyers <a href=\"https://www.i4talk.com/threads/chargers-in-idrive-8-navigation.968/page-2\">seemed pretty sure they would</a>, though that car is <a href=\"https://www.bmwusa.com/future-vehicles/i4-all-electric-vehicle-frequently-asked-questions.html\">scheduled to start shipping this month</a>, according to BMW. (I’m sure now that I’ve said this, I’ll hear from tons of people saying that they’ve been using it for a year.) </p><p id=\"75XzTg\">Apple didn’t immediately respond to a request for comment on the matter, and its <a href=\"https://support.apple.com/guide/iphone/set-up-electric-vehicle-routing-iphc5e3a4b4b/ios\">support article for the feature</a> simply says that it requires a “compatible vehicle.” I wasn’t able to find a list from Apple on which cars were compatible. Given some of the answers in Ford’s <a href=\"https://www.ford.com/support/how-tos/electric-vehicles/ev-range/what-is-the-electric-vehicle-ev-routing-feature-in-apple-maps/\">FAQ for the feature</a>, it does seem like some work is required on the part of automakers to make the car and phone talk to each other, which could explain why the rollout took so long.</p><p id=\"oaQEVA\">Apple Maps has had the ability to search for EV charging stations <a href=\"https://discussions.apple.com/thread/251870626\">for a while</a>, pulling up ones near you and letting you route to them as ICE drivers can with gas stations. While that’s good for a quick fill-up, it doesn’t help when planning out longer trips like the routing feature is supposed to. </p><div class=\"c-float-right\"><aside id=\"bWhfEs\"><q>The annoying part of charging a Mach-E isn’t routing, for the most part</q></aside></div><p id=\"pDtDQB\">Of course, it’s worth noting that the Mach-E does have a built-in version of this feature, which Ford says does have some extra features like charge station availability, information on how fast the chargers can juice up your vehicle, etc. But as reviewers like <a href=\"https://www.theverge.com/22265570/mustang-mach-e-review-electric-ford-ev-photos-video\">my former colleague Sean O’Kane</a> and <a href=\"https://www.youtube.com/watch?v=vXzuFprlyrw\">MKBHD</a> have pointed out, there are still frustrations with Ford’s built-in solution — mainly, that oftentimes chargers are outright broken or don’t work the way they should. </p><p id=\"Uqx9eu\">It’s arguable whether that’s Ford’s problem to solve, but it does mean that routing solutions — including Apple’s — are only half the battle when it comes to charging up the Mach-E away from home. Still, it’s nice to have options on how you get your routes, especially if you prefer how Apple Maps works compared to Ford’s built-in navigation. And, hey, maybe if Apple ever <a href=\"https://www.theverge.com/2021/11/18/22789615/apple-self-driving-car-project-titan-custom-processor-ev\">does come out with its rumored car</a>, it can try to bend the charging network into shape itself. That might take a while, though, since Ford <a href=\"https://www.theverge.com/2021/9/7/22661291/apple-car-chief-ford-doug-field\">recently hired away</a> the person that was reportedly in charge of Apple’s automotive efforts.</p><p id=\"NaoRlS\"><em><strong>Update March 21st, 2:21PM ET:</strong></em><em> Updated to reflect that the Apple EV routing page appears to be back up on Ford’s site.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uwKzMNI3P04W5abM_HYCdTKTLw8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22278733/sokane_210121_4386_0008.jpg",
  "description": "More options for finding a charger while you use CarPlay.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}