{
  "title": "Apple Fitness Plus users can learn BTS choreography starting next week",
  "url": "https://www.theverge.com/2022/4/21/23035653/bts-dance-moves-apple-fitness-plus",
  "date": "2022-04-21T16:41:05.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ytIX_WZqIIodZu20dyhugAkhT6s=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70776625/Apple_Fitness_Plus_International_Dance_Day_hero.0.png\" />        <figcaption><em>Fitness Plus users will be able to learn BTS choreography in the service starting next week.</em> | Image: Apple</figcaption>    </figure>  <p id=\"0eQtio\">When Apple Fitness Plus launched in 2020, it was not only a way to showcase the <a href=\"https://www.theverge.com/2020/6/22/21294434/apple-watchos-7-features-sleep-tracking-face-sharing-fitness-apps-2020\">new Dance activity</a> on the Apple Watch but also a subtle way to integrate other services like Apple Music. The fitness service has since added Artist Spotlight series with celebrated musicians, so it’s no surprise Apple is mashing all this together with <a href=\"https://www.apple.com/newsroom/2022/04/apple-fitness-plus-rolls-out-curated-dance-workouts-and-a-new-dance-collection/\">Dance workouts based on mega-popular K-pop band BTS</a>. </p><p id=\"tQ9v6T\">The BTS collaboration is part of a content package for International Dance Day on April 29. Starting next week, workouts will be led by Fitness Plus trainer Ben Allen and feature choreography straight from BTS’ music videos. Some of the songs featured include hits like “Butter (feat. Megan Thee Stallion),” “Dynamite,” “Boy With Luv (feat. Halsey),” “DNA,” “MIC Drop (Steve Aoki Remix),” “Permission to Dance,” and “Life Goes On.” The group’s music will also be featured in different workout categories like HIIT over the next four weeks. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ky7tWZN3aFSueckRscsBBqPpAWw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23406518/Apple_Fitness_Plus_International_Dance_Day_Artist_Spotlight.png\">      <cite>Image: Apple</cite>      <figcaption><em>In addition to dance workouts, BTS’ music will be featured in other workout types like HIIT.</em></figcaption>  </figure></div><p id=\"FdJUqf\">Music has always played a big part in Fitness Plus, with the ability to save playlists into users’ Apple Music accounts. That said, outside of the Latin Grooves genre, the artists featured have primarily been English-language artists from the US. Adding K-pop makes sense, however, given how <a href=\"https://www.vox.com/culture/2018/2/16/16915672/what-is-kpop-history-explained\">popular the genre has become</a> in the global market. Starting with BTS also makes sense, as the group was one of the best-selling groups in the US in 2021 with <a href=\"https://www.billboard.com/pro/2021-album-sales-bts-taylor-swift-drake/\">2.95 million digital song sales</a> and <a href=\"https://www.forbes.com/sites/hughmcintyre/2022/01/06/bts-claims-four-of-the-top-10-bestselling-songs-of-2021-in-america/?sh=6e25afb774ec\">four of the top 10 best-selling singles</a>.</p><p id=\"eVm2dy\">It’s not <em>all</em> BTS, however. Apple is also adding a new Dance Collection titled “Get into a Groove with Dance” and offering a limited-edition award for International Dance Day. Collections are a <a href=\"https://www.theverge.com/2022/1/7/22871851/apple-time-to-run-fitness-plus-apple-watch\">relatively new addition to the service</a> and are curated workout playlists for a specific goal like running a 5K. In addition to BTS, Apple is also adding Artist Spotlight sessions from ABBA and Queen. </p><p id=\"1RDPWd\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CiYKVhic1k1jxTVURFv31RL9JDQ=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23406510/Apple_Fitness_Plus_International_Dance_Day_hero.png",
  "description": "You, too, can learn how to move smooth like butter.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}