{
  "title": "Apple store workers in Atlanta file for the company’s first union election",
  "url": "https://www.theverge.com/2022/4/20/23034175/apple-store-workers-atlanta-union-retail-amazon-google",
  "date": "2022-04-20T19:05:03.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"The Apple logo is shown in a photo illustration\" src=\"https://cdn.vox-cdn.com/thumbor/nhWOmlOtFNU0E_ibfDkAg8i7wzs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70772772/acstro_190902_apple_event_0004.0.0.jpg\" />        <figcaption><em>Apple retail workers in Atlanta have voted to unionize.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"IxPBdW\">An Apple retail store in Atlanta has filed for a union election with the National Labor Relations Board (NLRB). The workers at the Cumberland Mall store, which includes salespeople, technicians, creatives, and operations specialists, would be represented by the Communications Workers of America (CWA). More than 70 percent of the group of about 100 eligible workers signed the union authorization cards, according to a news release — the minimum required is 30 percent. </p><p id=\"zuhISz\">If a majority of the workers vote to unionize, the store would be the first unionized Apple store in the US. Their petition now goes for formal review by the NLRB. </p><p id=\"fzGkhC\">“Apple is a profoundly positive place to work, but we know that the company can better live up to their ideals and so we’re excited to be joining together with our coworkers to bring Apple to the negotiating table and make this an even better place to work,” Derrick Bowles, an Apple Genius worker at the store, said in a statement Wednesday.</p><p id=\"x0DJOx\">A report from <em>The Verge</em> late last year detailed the difficulties many hourly Apple employees face, including low wages and a high-stress workplace. In February, <a href=\"https://www.theverge.com/2022/2/8/22923719/apple-store-retail-workers-sick-days-parental-leave-benefits\">the company increased benefits</a> for its full- and part-time retail workers. The Atlanta workers said, while they provide critical sales and services to the company, Apple doesn’t provide cost-of-living raises or access to equitable stock options. </p><p id=\"5Tp535\">“We work hard at Apple because we really believe in the products and the company and we want to make sure that every Apple worker is able to afford quality housing and basic living expenses,” said Elli Daniels, a product zone worker at Apple. </p><aside id=\"is8e9l\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple’s frontline employees are struggling to survive\",\"url\":\"https://www.theverge.com/c/22807871/apple-frontline-employees-retail-customer-service-pandemic\"}]}'></div></aside><p id=\"SIw8q0\">Workers at other Apple stores are also involved in union drives, but not all are working with the CWA. Retail Apple workers at the Grand Central Terminal store in New York City announced they were <a href=\"https://www.theverge.com/2022/4/16/23028356/apple-store-workers-grand-central-terminal-new-york-union-signatures\">collecting signatures</a> to form a union <a href=\"https://fsworkersunited.org/\">after voting in February</a> to affiliate with Workers United. That’s the same group <a href=\"https://www.npr.org/2022/04/14/1091589719/starbucks-union-drive-workers-united-howard-schultz-petition-vote-organizing\">working with Starbucks stores</a> across the country on unionization efforts. Known as Fruit Stand Workers United, the Grand Central workers are demanding a $30-per-hour minimum wage and other improvements to their reimbursement and benefits. </p><p id=\"bkMryO\">The workers are part of a larger movement among retail employees who felt exploited during the pandemic by corporations that saw huge financial windfalls. A group of workers at an <a href=\"https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win\">Amazon warehouse on Staten Island voted</a> earlier this month to become the first to unionize as part of the newly-formed Amazon Labor Union. And workers for a Google Fiber contractor in Missouri <a href=\"https://www.theverge.com/2022/3/25/22996053/google-fiber-union-contractors-workers-vote-cwa\">voted last month</a> to form the first-ever union at parent company Alphabet. They’ll be part of the Alphabet Workers Union, also affiliated with CWA.</p><p id=\"4LsUGB\">Apple didn’t immediately reply to a request for comment on Wednesday. </p><p id=\"0J7q6Q\"></p><p id=\"ob857K\"></p><p id=\"FpuMGc\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ic0cxlxIefz5FuIWsotP8KINBLI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19182546/acstro_190902_apple_event_0004.0.jpg",
  "description": "The group includes salespeople, technicians, creatives, and operations specialists.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}