{
  "title": "Apple’s solution to Dutch App Store dispute just earned it another €5 million fine",
  "url": "https://www.theverge.com/2022/2/14/22917514/apple-netherlands-dating-apps-external-payment-processors-in-app-commission-acm",
  "date": "2022-02-14T17:09:25.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qITItXxWn2YcQZUpi-Ve7eOCCo8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507616/acastro_210429_1777_epicApple_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"0Vc2Px\">Apple’s <a href=\"https://www.theverge.com/2022/2/4/22917582/apple-netherlands-antitrust-27-percent-commission-alternative-in-app-payment-systems\">new proposals for dating apps in the Netherlands</a> haven’t gone far enough to appease the country’s competition regulator, <a href=\"https://www.acm.nl/en/publications/acm-developing-new-app-unnecessary-and-unreasonable-condition-apple-imposes-dating-app-providers\">which has just announced</a> that it’s fining the company another €5 million (around $5.6 million). It’s the fourth weekly fine levied against the company, bringing the total to €20 million (around $22.6 million), and these fines are set to continue weekly while the Authority for Consumers and Markets (ACM) thinks Apple is failing to comply with its order.</p><p id=\"VTQwCk\">The ACM’s order, which was <a href=\"https://www.theverge.com/2021/12/24/22852966/apple-netherlands-dating-apps-match-tinder-app-store-competition\">made public in late December</a>, says that Apple should allow dating app developers — and only dating app developers — to use alternatives to Apple’s in-app payment system in the country. Apple first announced its intention to comply with the order <a href=\"https://www.theverge.com/2022/1/15/22885065/apple-netherlands-dating-apps-third-party-payment-options\">in mid-January</a> and fully detailed its plans <a href=\"https://www.theverge.com/2022/2/4/22917582/apple-netherlands-antitrust-27-percent-commission-alternative-in-app-payment-systems\">earlier this month</a>.</p><div class=\"c-float-right\"><aside id=\"szoyZp\"><q>The regulator objects to Apple forcing developers to submit a separate app binary</q></aside></div><p id=\"SjE3qa\">But the ACM isn’t happy with the specifics of Apple’s proposals and says that “the revised conditions that Apple has imposed on dating-app providers are unreasonable, and create an unnecessary barrier.”</p><p id=\"NFykDf\">In particular, it doesn’t like that Apple is asking developers to submit a separate app binary for the Dutch market, which it believes will create additional costs for developers and will force customers to download a new, separate app in order to access alternative payment systems. The regulator says it’s also unhappy with “several other elements” of Apple’s proposals and says Apple needs to adjust them to avoid further fines. </p><p id=\"x4McFz\">Despite its efforts to comply with the order, the iPhone manufacturer is still appealing the ACM’s decision. The iPhone manufacturer has said that offering alternatives to its own in-app payments system “will compromise the user experience and create new threats to user privacy and data security.” A representative from Apple did not immediately respond to <em>The Verge</em>’s request for comment on the ACM’s latest notice. </p><p id=\"XY8OiP\">The revenue Apple gains through in-app purchases from dating apps in the Netherlands is likely to make up an insignificant fraction of its global takings. But the dispute is significant for the early precedent it could set amidst an international wave of scrutiny over Apple’s App Store policies.</p><p id=\"SQiY3n\">Under Apple’s proposed policies, which were <a href=\"https://www.theverge.com/2022/2/4/22917582/apple-netherlands-antitrust-27-percent-commission-alternative-in-app-payment-systems\">detailed in early February</a>, dating app developers using alternative payment systems are charged a <a href=\"https://developer.apple.com/support/storekit-external-entitlement/\">27 percent commission</a> by Apple, a small discount on the 30 percent commission it takes when developers use Apple’s own in-app payment system. Developers who want to use alternative payment systems will need to provide a separate app binary to be distributed via the Dutch App Store. The ACM’s ruling follows a complaint from Match Group (owners of Tinder and other dating services), <a href=\"https://www.reuters.com/technology/exclusive-dutch-watchdog-finds-apple-app-store-payment-rules-anti-competitive-2021-10-07/\"><em>Reuters</em> previously reported</a>.</p><p id=\"HX4sZv\">Interestingly, the ACM’s notice posted today doesn’t specifically mention Apple’s intention to collect a 27 percent commission on in-app payments made through alternative payment systems. </p><p id=\"Cqv56d\">Apple previously <a href=\"https://www.theverge.com/2022/1/25/22900434/apple-netherlands-antitrust-competition-regulator-acm-5-million-euro-fine-in-app-payments\">failed to meet the ACM’s deadline</a> for changing its policy, which saw it liable for a weekly fine of €5 million (around $5.7 million) until it complied. The Dutch regulator objected to Apple raising barriers to developers wanting to use third-party payment systems, like forcing them to choose between using payment systems outside the app or alternative payment systems within the app. </p><p id=\"2BXnBA\">Apple’s App Store policies have faced increasing scrutiny around the world, both from developers as well as regulators. In the US last year, a judge ordered Apple to <a href=\"https://www.theverge.com/2021/11/9/22773082/epic-apple-fortnite-lawsuit-ruling-injunction-stay-app-store-anti-steering-rules\">allow developers to link out to external payment processors</a> in response to a legal challenge from Epic Games, although this ruling was subsequently <a href=\"https://www.theverge.com/2021/12/8/22814147/epic-apple-app-store-injunction-paused\">put on hold pending appeal</a>. <a href=\"https://www.theverge.com/2021/8/31/22643800/apple-google-south-korea-app-store-payment-legislation-passes\">South Korea has also passed legislation</a> preventing platform holders like Apple and Google from preventing developers from using alternative payment systems.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RLA9e1L-00sWgf7c7b9gGrGOSZM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22478960/acastro_210429_1777_epicApple_0002.jpg",
  "description": "Apple detailed its proposals earlier this month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}