{
  "title": "Apple service centers can reportedly replace the Studio Display’s ‘built-in’ stands",
  "url": "https://www.theverge.com/2022/3/21/22989517/apple-store-studio-display-interchangeable-stand-replacement-repair-service",
  "date": "2022-03-21T20:03:18.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/F0gOIUTK61Xq9avoNzsVSNTrYUU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70653666/bfarsace_171212_5072_0072.0.jpg\" />        <figcaption><em>Apple says this stand is “not interchangeable,” but reports say it plans on offering a replacement service.</em> | Photo by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"O7uFhF\">Workers at Apple Stores or Authorized Service Providers will be able to change which stand is attached to <a href=\"https://www.theverge.com/22981744/apple-studio-display-5k-monitor-webcam-speakers-review\">the Studio Display</a>, according to <a href=\"https://www.macrumors.com/2022/03/21/studio-display-vesa-mount-adapter-after-purchase/\">a report from <em>MacRumors</em></a>, which cites internal Apple documents. This is despite a warning on <a href=\"https://www.apple.com/shop/buy-mac/mac-studio-display\">Apple’s “Buy Apple Studio Display” page</a>, which says that you have to choose a stand at the time of purchase, as they’re “built-in” and “not interchangeable.” </p><p id=\"l91AXj\">Apple provides three different stand options for the Studio Display. You can get either the standard stand with tilt adjustments or the VESA adapter for attaching the monitor to third-party arms without paying anything extra. If you want a height-adjustable stand from Apple, it’s a $400 upgrade. <a href=\"https://www.theverge.com/2022/3/8/22967455/apple-march-event-mac-studio-display-stand-price\">Apple says</a> you have to decide at the time you’re buying the monitor — though the <em>MacRumors</em> report implies that you’ll be able to pay to change stands later on if you change your mind or get a different desk setup.</p><p id=\"7FaeZu\">Apple didn’t respond to <em>The Verge</em>’s request for comment on whether these reports are accurate.</p><p id=\"3zpfDz\">Differences between what Apple says and reality seem to be a frustrating trend with the Studio Display. Apple’s <a href=\"https://support.apple.com/en-us/guide/studio-display/apd3604aa662/2022/mac/12.2\">“Important handling information for Apple Studio Display” page</a> says that the monitor’s power cable is non-removable, yet <em>The Verge</em> editor-in-chief Nilay Patel, along with <a href=\"https://youtu.be/E75mtGjDRRI?t=1688\">YouTuber Linus Tech Tips</a>, <a href=\"https://twitter.com/reckless/status/1504473080348884992?s=20&amp;t=MkCGeEG4sMpIPW15L7CyCw\">have already proven</a> that the cable can in fact be removed. (Though, in my opinion, that shouldn’t distract from the fact that making a monitor with a power cable that’s supposed to be fixed in place is really annoying.)</p><div id=\"iiHljx\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">Lol sure <a href=\"https://t.co/ZryH9y1sBI\">pic.twitter.com/ZryH9y1sBI</a></p>— nilay patel (@reckless) <a href=\"https://twitter.com/reckless/status/1504473080348884992?ref_src=twsrc%5Etfw\">March 17, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"qldqXS\"><em>Verge</em> fellow Umar Shakir points out that, at least externally, the hinge looks pretty similar to the one found on Apple’s Cinema HD Display from the early 2000s. <a href=\"https://www.applerepairmanuals.com/the_manuals_are_in_here/cinema_hd_display_23dvi.pdf\">According to an archived copy of a service manual,</a> removing the stand for that monitor simply required undoing two screws, which suggests one way Apple could’ve designed the Studio Display’s stand to be user-replaceable. </p><p id=\"GxkI1F\">At least, in my opinion, that’d be almost the perfect use-case for the company’s <a href=\"https://www.theverge.com/2021/11/17/22787144/apple-home-repair-iphone-mac-parts-tools-instructions\">recently introduced Self Service Repair program</a> — it’s the type of job that most people can be comfortable doing themselves but wouldn’t be <em>so</em> easy that it’d make the Pro Display XDR (with its magnetic stand mount) less desirable. Unfortunately, that’s not the world we live in right now.</p><p id=\"k1uJA8\">Currently, <a href=\"https://support.apple.com/displays/repair/service\">Apple’s display service and repair page</a> doesn’t mention the reported program that will let you get your Studio Display’s stand swapped out. <em>MacRumors</em> does say that the price “will vary based on the region, the type of stand or mount being installed, and the cost of labor” and that the kit to make the change won’t be sold online, so it seems unlikely that we’ll ever see hard details about pricing on Apple’s site. We’ll keep an eye out for any public mention from Apple that this is an option — otherwise, you may have to hit up your local Apple Store and ask if they’ll do a stand change if you’re looking to get one done. </p><hr class=\"p-entry-hr\" id=\"ugMoJd\"><h2 id=\"yCML5V\">Related:</h2><div id=\"TdG7e1\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Mac Studio|106311\" data-volume-uuid=\"20d72f7af\" data-volume-id=\"106311\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-873\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/GewViBKTymfQKiWNXOxlFajJr3o=/0x9:2040x1077/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320965/bfarsace_171212_5072_0072.jpg",
  "description": "The pricey monitor might be serviceable after all.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}