{
  "title": "Apple’s DIY repair parts are only slightly cheaper than its repair prices",
  "url": "https://www.theverge.com/2022/4/27/23044490/apple-diy-repair-self-service-replacement-part-price-apple-store",
  "date": "2022-04-27T14:27:12.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/t3idIlm5dC2mbzYB2k_HsUq3Epc=/0x0:1653x1102/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70799542/Apple_Right_to_repair_Hero.0.jpg\" />    </figure>  <p id=\"L2QcLk\">Apple is now <a href=\"https://www.theverge.com/2022/4/27/23044301/apple-iphone-diy-repair-self-service-program-spare-parts-12-13\">selling replacement iPhone parts directly to customers</a>, allowing them to repair their own devices rather than paying a professional. But if you were expecting a DIY repair to be a way of saving money, then you might be a little disappointed. Apple’s pricing for some of the most common replacement parts is very similar to what it’ll charge you to do the repairs at an Apple Store, even when you’re the one delicately taking your phone apart to swap out a broken part. Only once you factor in the credit you get for sending in a replaced part do you stand to see a more significant saving.</p><p id=\"XYFZfW\">Take battery replacements. Apple is charging $69 for a Battery &amp; Screw Kit for iPhone 12 or 13 models and $49 for the same kit for the third-generation iPhone SE. But look at <a href=\"https://support.apple.com/iphone/repair/service/battery-power\">Apple’s site</a>, and an out-of-warranty battery replacement costs exactly the same: $69 for the iPhone 12 or 13 and $49 for the iPhone SE. Apple’s press release says it’s selling these parts at the “<a href=\"https://www.apple.com/newsroom/2022/04/apples-self-service-repair-now-available/\">same price</a>” as what it charges its network of repair partners. </p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LOrCb15rt_YIgbjMr_gLPgnUWN4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23419744/Screen_Shot_2022_04_27_at_2.24.31_PM.jpg\">      <cite>Screenshot: <a class=\"ql-link\" href=\"https://support.apple.com/iphone/repair/service/battery-power\" target=\"_blank\">Apple.com</a></cite>      <figcaption><em>Apple’s own repair prices.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/03uj4aNrWYYuf3OQb7EORtuQ9YI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23419746/Screen_Shot_2022_04_27_at_2.24.24_PM.jpg\">      <cite>Screenshot: <a class=\"ql-link\" href=\"https://www.selfservicerepair.com/order\" target=\"_blank\">SelfServiceRepair.com</a></cite>      <figcaption><em>Versus the price of its repair kits.</em></figcaption>  </figure></div></div></div><p id=\"fynTm1\">Pricing for display replacements differs a little more, but not by much. An iPhone 12 display and screw kit costs $267.96 when bought directly from Apple, while an <a href=\"https://support.apple.com/iphone/repair/service/screen-replacement\">out-of-warranty screen repair</a> costs $279 for the same phone. For the 12 Mini, the price is $225.96 versus $229 for an Apple repair, while the same replacement part for the 12 Pro Max costs $309.96 versus $329 for an Apple repair. It’s a saving of anywhere from $5 to $20, but it’s not much.</p><p id=\"9Bn04Q\">There’s an important caveat here, which is that Apple’s DIY option offers more substantial savings if you’re willing to send back the part that you’ve replaced. An old iPhone 12 or 13 battery, for example, could net you a $24.15 discount according to Apple’s repair site, while the discount offered for a returned display is $33.60. These discounts offer a particularly good deal for battery repairs, where sending in a replaced part could net you a saving of over a third of the price of the repair kit. Apple’s press release says it intends to recycle the parts sent in by customers, though <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ifixit.com%2FNews%2F59239%2Fapples-self-repair-vision-is-here-and-its-got-a-catch%3Fvgo_ee%3D3bheJeT%252FPRsWKKl8dfWh0vlMy%252BOWWuyaZunZiCXh6gI%253D&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F27%2F23044490%2Fapple-diy-repair-self-service-replacement-part-price-apple-store\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><em>iFixit</em> notes</a> they could also refurbish them for reuse.</p><p id=\"JHM4ZY\">Even without these discounts, there could still be important reasons to go down the DIY route, depending on where you’re based. Although Apple has hundreds of Apple Stores in the US and thousands of third-party repair partners around the world, there are still many people who don’t live nearby to somewhere that can repair their iPhone and can’t be without their phone for the three to five business days it takes to turn around a mail-in repair. For those people, a DIY repair option could offer a lifeline. </p><p id=\"K6JuiY\">Apple’s press release makes it clear it doesn’t expect its DIY repair options to be for everyone. “For the vast majority of customers who do not have experience repairing electronic devices, visiting a professional repair provider with certified technicians who use genuine Apple parts is the safest and most reliable way to get a repair,” its press release reads and cautions that self-service repairs are only meant for “customers who are experienced with the complexities of repairing electronic devices.” That could explain why Apple isn’t offering much of a discount to eager customers looking to repair their own phones.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/r6BPFOadtQYYMW8xBokO-XCNITE=/0x119:1653x984/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23419755/Apple_Right_to_repair_Hero.jpg",
  "description": "This isn’t a way to save money.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}