{
  "title": "Apple finally lets ‘reader’ apps like Kindle, Netflix, and Spotify link to their own sites",
  "url": "https://www.theverge.com/2022/3/30/23003503/apple-reader-app-developer-external-link-guidelines-announced-entitlements",
  "date": "2022-03-30T20:34:57.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/UKZCIep-T1IvO4ewVrdrDr1LrYM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70691230/acastro_180604_1777_apple_wwdc_0002.0.jpg\" />        <figcaption><em>It promised this change in September, 2021.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"6pUHcv\">Apple is making good on <a href=\"https://www.theverge.com/2021/9/1/22653264/apple-reader-app-exception-anti-steering-signup-page\">its promise</a> to let some developers link out to their own sites from within their apps, according to <a href=\"https://developer.apple.com/news/?id=grjqafts\">an announcement from the company</a> on Wednesday. The new rules, which go into effect today, let developers of “reader apps” (apps that are primarily meant to provide access to digital content, like Netflix, Kindle, or Spotify) link out to their sites for things like account management or creation.</p><p id=\"tIUQ4A\">This should help improve the historically bad user experience for these types of apps caused by Apple’s previous rules. Previously, if you downloaded the Netflix app but didn’t have an account, Netflix wasn’t allowed to give you a link to sign up or tell you where you could go to create an account. That made apps frustrating for users who didn’t have accounts and forced developers who didn’t want to use Apple’s in-app payment system (and give up 30 percent of their revenue) to make a worse experience for potential customers. Now, developers should at least be able to make a button that takes you to their website.</p>  <figure class=\"e-image\">        <img alt=\"Screenshot of Netflix’s app, with the text “You can’t sign up for Netflix in the app. We know it’s a hassle. Join and come back to start watching TV shows and movies.”\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FPpcDcepRrWvoll7q4RCv9QlxL4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23355988/IMG_4177.jpeg\">      <figcaption><em>An example of the types of language developers had to use under the old rules.</em></figcaption>  </figure><p id=\"T6E2qd\">Developers can’t just immediately add a sign-up link to their app’s home screen and be done with it, though. According to <a href=\"https://developer.apple.com/support/reader-apps/\">Apple’s developer support page</a>, you’ll have to request an “entitlement” before you’ll be allowed to add an external link. Apple has also mandated a specific flow — if a developer is linking a user to their site, they have to put up a screen explaining that any purchases made won’t be done through Apple. And they’ll also have to link to <a href=\"https://apps.apple.com/story/id1614232807\">an Apple page</a> that explains the risks associated with giving your info to a third-party developer.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/17es2BEP6NFxel002RkaKk3Td2g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23355907/Screen_Shot_2022_03_30_at_11.52.51.png\">      <cite>Image: Apple</cite>      <figcaption><em>Apple’s example interstitial screen.</em></figcaption>  </figure><p id=\"05IBSy\">Apple also has a list of requirements that apply to the link itself. For example:</p><ul><li id=\"l5UcBM\">The link must open in a browser, not an in-app web view.</li><li id=\"4xV7tI\">No additional data or parameters can be passed to the website.</li><li id=\"FySlio\">Your app can’t contain text explaining how much things on your website will cost (for example, Netflix can’t say “tap this button to sign up for Netflix, <a href=\"https://www.theverge.com/2022/1/14/22884263/netflix-price-increases-2021-us-canada-all-plans-hd-4k\">starting at $9.99 a month</a>”).</li></ul><p id=\"8tLn65\">Of course, Apple will be reviewing changes to apps before they go live. If <a href=\"https://www.theverge.com/2020/6/22/21298552/apple-hey-email-app-approval-rules-basecamp-launch\">history is any indication</a>, there will probably be some growing pains where developers think their app is in compliance with Apple’s guidelines, but App Review disagrees. </p><p id=\"bowWmB\">When it <a href=\"https://www.theverge.com/2021/9/1/22653264/apple-reader-app-exception-anti-steering-signup-page\">announced this change was coming</a> in September 2021, Apple said that it would help close an antimonopoly investigation from Japanese regulators. At the time, the implementation details were unclear — there were questions about what Apple meant when it said that developers could share “a single link.” Given the guidelines Apple released today, it seems you can only have a single URL that you can point users to (which can’t go through redirects or to a landing page). You can, however, use that link “once per app page,” provided it shows “the same message in each instance.”</p><p id=\"4VPd73\">As we’ve <a href=\"https://www.theverge.com/2021/9/1/22653264/apple-reader-app-exception-anti-steering-signup-page\">mentioned in previous stories</a>, this change is relatively limited in scope. Apple has a pretty long list of requirements apps have to meet if they want to be eligible for the entitlement. So while this change won’t be a very strong argument for Apple against, say, <a href=\"https://www.theverge.com/2022/3/24/22994234/eu-antitrust-legislation-dma-digital-markets-act-details\">the EU</a>, it should help at least make the sign-up experience for some apps a little less ridiculous. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OrCEcxQRSQP5T2C0miJ8ruYHs0E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477049/acastro_180604_1777_apple_wwdc_0002.jpg",
  "description": "Developers can’t mention price in their links.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}