{
  "title": "Apple store workers at Grand Central Terminal start collecting signatures to form a union",
  "url": "https://www.theverge.com/2022/4/16/23028356/apple-store-workers-grand-central-terminal-new-york-union-signatures",
  "date": "2022-04-16T22:23:05.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Re-opening Continues Across Densely Populated New York And New Jersey Areas\" src=\"https://cdn.vox-cdn.com/thumbor/pM_RcHhUbkTa7NsBTpEFwzX3z-I=/0x0:4876x3251/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70758151/1258358037.0.jpg\" />        <figcaption><em>Organizers need approval from at least 30 percent of workers to hold a union election.</em> | Photo by Alexi Rosenfeld/Getty Images</figcaption>    </figure>  <p id=\"IEi0ZU\">Retail Apple employees at a New York City store in Grand Central Terminal have started collecting signatures to form a union, according to a report from <a href=\"https://www.washingtonpost.com/technology/2022/04/16/apple-grand-central-station-retail-union-workers-united/\"><em>The Washington Post</em></a>. </p><p id=\"bjEnmP\">The organizers, who go by Fruit Stand Workers United, announced in an update on its <a href=\"https://fsworkersunited.org/\">website</a> that they voted to affiliate themselves with the Workers United labor union on February 21st, 2022. Workers United is the same group backing <a href=\"https://www.npr.org/2022/04/14/1091589719/starbucks-union-drive-workers-united-howard-schultz-petition-vote-organizing\">recent unionization efforts at Starbucks stores</a> across the country.</p><div class=\"c-float-right\"><aside id=\"LhduBk\"><q>At least three other stores are reportedly working towards organizing</q></aside></div><p id=\"OHzRri\">As noted by <em>The Post</em>, organizers at the Grand Central location are currently handing out signature cards so employees can express interest in forming a union. If at least 30 percent of workers sign off on it, organizers can file a petition with the National Labor Relations Board (NLRB) to hold a union election. So far, there hasn’t been an Apple store that has successfully formed a union.</p><p id=\"TllkGO\">“Grand Central is an extraordinary store with unique working conditions that make a union necessary to ensure our team has the best possible standards of living in what have proven to be extraordinary times,” the organizers’ website reads, citing inflation rates and pandemic-related store closures.</p><p id=\"eE3svV\">Back in February, <a href=\"https://www.washingtonpost.com/technology/2022/02/18/apple-retail-stores-union-labor/\"><em>The Post </em>reported</a> that several Apple stores were getting ready to unionize amid complaints that wages can’t keep up with the skyrocketing rate of inflation and poor working conditions. <em>The Post</em>’s recent report suggests that “at least three” other Apple store locations are progressing towards forming a union.</p><p id=\"yJZpHM\">“We are fortunate to have incredible retail team members and we deeply value everything they bring to Apple,” an Apple spokesperson said in a statement to <em>The Post</em>. “We are pleased to offer very strong compensation and benefits for full time and part time employees, including health care, tuition reimbursement, new parental leave, paid family leave, annual stock grants and many other benefits.” Apple and the NLRB didn’t immediately respond to <em>The Verge</em>’s request for comment.</p><p id=\"NupBWC\">Earlier this year, <a href=\"https://www.theverge.com/2022/2/8/22923719/apple-store-retail-workers-sick-days-parental-leave-benefits\">Apple increased benefits</a> for both part-time and full-time retail employees following <a href=\"https://www.theverge.com/c/22807871/apple-frontline-employees-retail-customer-service-pandemic\"><em>The Verge</em>’s report</a> that Apple store employees’ are struggling with low wages and a stressful working environment. Throughout the course of the pandemic, retail workers have also dealt with <a href=\"https://www.theverge.com/2022/2/22/22946560/apple-store-mask-mandate-customers-employees\">changing mask guidance</a>, <a href=\"https://www.theverge.com/2021/12/22/22850946/apple-store-covid-two-hour-free-shipping-option\">store closures</a>, as well as a requirement to <a href=\"https://www.theverge.com/2022/1/15/22885181/apple-vaccine-covid-19-booster-shot-employees\">submit proof of a COVID-19 booster shot</a> or show a negative COVID-19 test before entering the store.</p><p id=\"5P6r48\"><em><strong>Update April 16th 6:51PM ET: </strong></em><em>Added an updated link to Fruit Stand Workers United’s website.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Y5o7-uqK99BDBc7IN4MA9KL2T1U=/0x350:4876x2903/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23394893/1258358037.jpg",
  "description": "Organizers voted to affiliate themselves with Workers United.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}