{
  "title": "Apple TV Plus’ The Essex Serpent is a slow, tense drama with lots of great sweaters  ",
  "url": "https://www.theverge.com/23067235/the-essex-serpent-review-apple-tv-plus",
  "date": "2022-05-12T23:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FW9INCsyhE-Aepydp_GJMFTf3BE=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70863166/The_Essex_Serpent_Photo_010107.0.jpg\" />        <figcaption>Tom Hiddleston in <em>The Essex Serpent</em>. | Image: Apple</figcaption>    </figure>  <p id=\"e3idZ7\">How much you enjoy <a href=\"https://www.theverge.com/2022/4/26/23042652/essex-serpent-trailer-apple-tv-sarah-perry\"><em>The Essex Serpent</em></a>, an Apple TV Plus adaptation of Sarah Perry’s 2016 novel, might depend on how much you enjoy seeing Tom Hiddleston brooding in a misty field while wearing cozy wool sweaters. For a lot of people, that will probably be enough of a hook. (It was for me.) But thankfully, the six-episode series offers a lot more than great hair blowing in the wind — it’s a tense and heartfelt exploration of grief and belief and how much those two things can mess with you. The great sweaters are just a bonus.</p><p id=\"7ZlB9k\">The show primarily follows two characters. One is Cora Seaborne (Claire Danes), a recent widow and a budding natural history scholar who has quite the fixation with sea serpents. She spends her spare time researching them via old books, maps, and newspaper clippings. When rumors pop up that a serpent has been terrorizing a small fishing village in Essex, she — along with her young son (Caspar Griffiths) and friend / housekeeper (Hayley Squires) — boards a train from London to investigate.</p><p id=\"DoQuf1\">What she finds when she arrives isn’t a serpent — at least not initially, no spoilers there — but rather a town steadily going mad with fear. A missing child has everyone on edge, blaming the mythical creature, which, many believe, is attacking the most sinful of the bunch. As bad things continue to happen to pretty much everyone, the tragedies are inevitably blamed on the beast. One of the first people Cora meets in town is Will Ransome (Hiddleston), a local pastor and one of the few people who <em>doesn’t</em> think the serpent is a bad omen from God.</p><div id=\"ooX4Cb\"><div ><iframe src=\"https://www.youtube.com/embed/A5GqOeELRFU?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"rGW3K0\">Initially, <em>The Essex Serpent </em>leans pretty heavily on some well-worn tropes. When Cora and Will first meet, they have no idea who each other is, and even though she helps him rescue a goat from certain doom, he’s still a big jerk. Later, when they’re properly introduced so he can help with her research, it’s the classic rom-com moment where she has the surprise realization that “Oh, that’s the person who was so rude to me earlier.” It’s not the most original way to have two characters meet, but at least the show quickly moves past it. It helps that Danes and Hiddleston have an antagonistic chemistry that’s a lot of fun to watch play out, even with the familiar setup.</p><div class=\"c-float-right\"><div id=\"ERgTrb\"><div data-anthem-component=\"aside:10599029\"></div></div></div><p id=\"hWLLTW\">The other, much more interesting subject the show leans on is the faith vs. science debate. Cora’s desire to find a logical explanation for the serpent — she spends a lot of time putting on nice outfits to go digging for fossils — comes in direct conflict with most people in town, who become increasingly convinced that it’s the work of a vengeful deity. What makes the dynamic particularly interesting in <em>The Essex Serpent</em> is Will, who is stuck in the middle. He’s a man of faith who also can’t accept the supernatural explanations for everything affecting the town, leaving him questioning quite a bit about his beliefs and how much he can help the community he serves.</p><p id=\"TQPYai\">To add even more drama into the proceedings, the show ends up being much more about interpersonal relationships than existential ones (though the serpent and religion still remain key elements throughout). <em>The Essex Serpent</em> puts a lot of very beautiful people in a very grim location and then lets you watch them try really hard to not be overtly horny for each other. Cora is finally experiencing something close to freedom now that her abusive marriage is over, and she ends up stuck between Will (who is not only a pastor but also married with two kids) and Luke (Frank Dillane), a charming young doctor who also happens to be a pioneering force behind the at-the-time nascent field of open-heart surgery.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q4o96Sy0qMWfa1irwxN3SQBMYuc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453562/The_Essex_Serpent_Photo_010202.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>Claire Danes in </em>The Essex Serpent<em>.</em></figcaption>  </figure><p id=\"1kCNWh\">Much of the show hinges on watching the three of them navigate this awkward dynamic while being too British and polite to just come out and say how they feel. This is balanced with all of the aforementioned struggles like finding a mythical sea serpent or perfecting a radical kind of surgery. It’s a slow burn of a show, which doesn’t reveal its true intentions until a few episodes in. But once it finds its footing, <em>The Essex Serpent</em> becomes a drama that treats its subjects with a refreshing kind of honesty that makes them all the more interesting. Falling in and out of love is always messy, but especially when the world around you is also a complete mess. <em>The Essex Serpent</em> captures that perfectly. And at six episodes long, it does so without overstaying its welcome.</p><p id=\"o0uxrL\">Really, it’s a show about the beautiful chaos that comes from conflict, whether that’s between science and faith, love and hate, or putting a bunch of pretty people in a grim and depressing little town. In that way, the cozy sweater is a metaphor for <em>The Essex Serpent</em> as a whole: its drab and well-worn exterior hides something much more intriguing underneath.</p><p id=\"0CJ9Cp\"><small>The Essex Serpent </small><small><em>starts streaming on Apple TV Plus on May 13th.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/h0iEIeyDA9KvLOIbzgqgChcZ25s=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23453547/The_Essex_Serpent_Photo_010107.jpg",
  "description": "Starring Tom Hiddlestone and Claire Danes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}