{
  "title": "Apple says it will make unknown AirTags alert you sooner",
  "url": "https://www.theverge.com/2022/2/10/22927374/apple-airtag-safety-update-stalking",
  "date": "2022-02-10T18:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"A bunch of AirTags\" src=\"https://cdn.vox-cdn.com/thumbor/xPMEz--8cRKRCeWpYMqDssUJxig=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70493726/vpavic_4547_20210421_0131.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"Eq5CVO\">Following multiple reports of stalking, Apple says it plans to improve AirTag safeguards against unwanted tracking later this year. Specifically, Apple says users will be alerted sooner when an unknown AirTag is detected traveling with them. It also it’ll make unknown AirTags easier to find by “adjusting the tone sequence,” which might make them sound louder, and by guiding people directly to a mystery AirTag using the ultrawideband chip available on newer iPhones.</p><p id=\"4Uqo8S\">“AirTag was designed to help people locate their personal belongings, not to track people or another person’s property, and we condemn in the strongest possible terms any malicious use of our products,” Apple writes in a press release. The company also acknowledges that it’s seeing increased reports of people using AirTags for malicious reasons and writes that it’s actively working with law enforcement on all AirTag-related requests. </p><p id=\"e1ITJ5\">Most importantly, Apple says it’s updating its algorithm to more quickly notify users that an unwanted tracker may be on their person. It also says iPhone 11, 12, and 13 users will be able to use Precision Finding to see exactly where an unknown AirTag is when within range, something that only the owner of the AirTag could do previously. When receiving alerts, Apple also says it will begin simultaneously sending notifications to iPhones when an unknown AirTag first plays a sound alert — currently, if you miss hearing a ping, there won’t necessarily be a notification waiting for you on your iPhone or vice versa. This measure is meant to help in cases where an AirTag’s speaker may have been tampered with. Regarding sound alerts, Apple also says it will emphasize louder tones going forward.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gUZDZEB_US9sdCjtvL5I6FGmLY4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232651/AirTag_privacy_message_in_pairing_flow.png\">      <cite>Image: Apple</cite>      <figcaption><em>Apple will include a more specific privacy notice when setting up AirTags.</em></figcaption>  </figure></div><p id=\"YqcH3p\">In forthcoming software updates, Apple says anyone setting up an AirTag will see a new privacy warning that states using AirTags for unwanted tracking is a crime. The message will also highlight that victims will be notified upon detection and that law enforcement can request identifying information on an AirTag’s owner. Apple also said it’d be updating its support documents to include more detailed explanations of what may trigger an alert and resources for what to do after receiving one.</p><p id=\"pM8Em9\">There are still some major unanswered questions. We don’t yet know exactly when these updates will be available. Apple only says “later this year.” Apple also declined to share how much earlier notifications will arrive. Currently, users will receive an alert at a random period between eight and 24 hours once an unknown AirTag has been detected traveling with them. It also declined to clarify whether the improved sound alerts would merely emphasize louder tones or actually play at a volume louder than its current 60 decibels. While the sound alert improvements will benefit Android users, the other features aren’t particularly useful. Currently, Android users have to manually scan for unknown AirTags using a separate Tracker Detect app.</p><p id=\"KkbqRI\">Even so, it’s a good thing that Apple has acknowledged the shortcomings of its current safeguards. While item and GPS trackers have long been used to stalk people, it’s become increasingly noticeable since the AirTag’s launch due to Apple’s popularity, its ease of use, and its relative affordability. </p><p id=\"0edcBg\">“The alerts system Apple has notifying potential victims of any unwanted tracking has helped shine a light on a problem that existed long before AirTags came on the market,” writes Erica Olsen, director of the Safety Net Project at the National Network to End Domestic Violence, in a statement. “We are happy Apple is engaging in the conversation about victim safety and are continuing to improve safeguards. We hope others will follow their lead.” </p><hr class=\"p-entry-hr\" id=\"LKvTwa\"><h2 id=\"WnfEGk\">Related:</h2><div id=\"tONmAg\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Apple AirTags: the most Apple|101806\" data-volume-uuid=\"791d9753f\" data-volume-id=\"101806\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-782\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/OSgFFOqae4lBP8DEoaxaYAYStFw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22461476/vpavic_4547_20210421_0131.jpg",
  "description": "We don’t know when the updates are coming.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}