{
  "title": "Apple’s Face ID with a Mask works so well, it might end password purgatory",
  "url": "https://www.theverge.com/2022/2/2/22912677/apple-face-id-mask-update-ios-15-4-beta-hands-on-impressions",
  "date": "2022-02-02T17:00:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jGo-p4TrEurjdmebwJ-xHlKaRPo=/159x0:1881x1148/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70462653/_DSC7975_2.0.jpg\" />    </figure>  <p id=\"NHBkQN\">Nearly two years into the COVID-19 pandemic, <a href=\"https://www.theverge.com/2022/1/27/22904908/apple-ios-15-4-beta-1-developer-face-id-mask\">Apple has made Face ID useful again</a> in iOS 15.4 by <em>finally</em> adding the ability to use the face unlock feature while wearing a face mask. </p><p id=\"qrr7oW\">I’ve been testing out the <a href=\"https://www.theverge.com/22906798/ios-iphone-15-4-face-id-mask-test-beta\">new iOS 15.4 beta</a> for a few days, and I’ve been pleasantly surprised at how well Face ID works with a mask — in addition to simply enjoying being able to use my iPhone the way it was originally intended to work, instead of mashing in a six-digit passcode a dozen times whenever I leave the house. </p><aside id=\"O7K8Mz\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to install the iOS 15.4 public beta\",\"url\":\"https://www.theverge.com/22906798/ios-iphone-15-4-face-id-mask-test-beta\"}]}'></div></aside><p id=\"Px1lJ2\">The Face ID vs. Touch ID / fingerprint sensor debate had been a conversation long before COVID-19 and the new norm of almost constantly wearing a face mask when out in public settings or traveling on buses, trains, or planes. But while masks are a great tool for preventing the spread of diseases, they’re a big hindrance in allowing facial recognition tools like Face ID to work for unlocking your phone, given the whole “blocking half of your face” thing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uNkl7TO-HNx3cn3sux8nw9Wjyq0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212900/_DSC7972_2.jpg\">  </figure><p id=\"stvt7L\">iOS 15.4, though, aims to fix that by simply making Face ID work when wearing a mask, zeroing in on details on the top portion of people’s faces to identify them correctly and unlock the phone. It’s not Apple’s first attempt at solving the Face ID / mask issue: <a href=\"https://www.theverge.com/2020/5/20/21265019/apple-ios-13-5-out-now-unlock-iphone-face-mask-id-exposure-notification-covid-19\">iOS 13.5 would recognize</a> when you were wearing a mask and show the password prompt more quickly, and the company added a feature for automatically unlocking your iPhone when wearing an Apple Watch <a href=\"https://www.theverge.com/2021/2/1/22260639/apple-watch-iphone-unlocked-ios-14-5-app-tracking\">in last year’s iOS 14.5 update</a>. But the new Face ID mask support is a much more streamlined solution that has the benefit of not requiring the purchase of additional Apple hardware. </p><div class=\"c-float-right\"><aside id=\"htoiuv\"><q>A more streamlined solution for Face ID while wearing a mask</q></aside></div><p id=\"O2MdwG\">Apple really wants to make sure that customers know that it’s adding the new Face ID option. After installing iOS 15.4 (at least in its current beta form), the first thing you’ll see is a splash screen asking if you’d like to enable Face ID with a mask. Setting up the feature is relatively simple, although you’ll have to re-register your face (presumably so Apple can dial in even further on the details around your eyes). </p><p id=\"FwobIf\">Once you’ve done that, though, Face ID with a mask — for the most part — works really well, which is to say that it works at unlocking your iPhone when you look at it, even when wearing a cloth face mask or more substantial N95. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tZnD91T_XqSSxpRSYxoAO8844Hk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212928/Screen_Shot_2022_02_02_at_11.12.58_AM.png\">      <figcaption><em>A variety of successful (and failed) Face ID mask unlock styles — unregistered glasses, sunglasses, and oversized beanies failed, while properly registered glasses, scarves, and (surprisingly) ski goggles worked</em></figcaption>  </figure><p id=\"vX2U8X\">There are a few weird quirks, though. If you’re using Face ID with a mask and wear glasses, Apple now asks you to make a baseline scan with each pair of glasses that you own. And when I switched to a different, unregistered pair of glasses, Face ID didn’t work when I was wearing a mask. Face ID with a mask also doesn’t work with sunglasses. </p><p id=\"4RdX2m\">Other fails I ran into were when I covered too much of my forehead, like with a pulled-down beanie with earflaps that covered most of my head. But I did have some impressive successes, too: wearing my full ski gear of a knit hat, face mask, and goggles (albeit an unusually transparent pair of goggles) was still enough for Face ID to work and unlock my phone. </p><p id=\"EX23Vp\">The flip side, of course, is that Apple <em>does</em> warn that Face ID with a mask is less accurate than regular Face ID. As Apple notes:</p><blockquote><p id=\"HpyLgY\"><em>Face ID is most accurate when it’s set up for full-face recognition only. To use Face ID while wearing a mask, iPhone can recognize the unique features around the eye to authenticate.</em></p></blockquote><p id=\"5TMdnD\">How <em>much</em> less accurate Face ID is when using a mask, though, is harder to tell — but it’s worth keeping in mind that you might run into some missed unlocks when using the feature. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MLopwvRg-3XvCSb1Ki1AjLD5pqQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212930/_DSC7960_2.jpg\">      <figcaption><em>Apple’s splash screen notifying users about the new Face ID mask functionality</em></figcaption>  </figure><p id=\"du9YYM\">Still, the sheer convenience of being able to quickly unlock my phone without taking off my mask or entering in my password over and over again is well worth the occasional failed unlock. And it’s especially helpful for streamlining Apple Pay for things like paying for the NYC subway (instead of awkwardly fidgeting with my passcode during a hectic rush-hour crowd). </p><p id=\"qsYC2S\">iOS 15.4 is still in public beta, so the usual caveats about running unfinished beta software on your main device still apply. And it’s entirely possible that Apple will hold Face ID mask support for a future update if it’s not happy with the way things are working now. But hopefully, Apple will broadly release iOS 15.4 and the crucial new Face ID feature to the masses in the coming week and end our long password-entering nightmare. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LSNQyIEAyqx11fOFSkOeMboMkgs=/0x40:2040x1108/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23212899/_DSC7975_2.jpg",
  "description": "No more endless password entries",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}