{
  "title": "Apple Cash virtual debit cards may be switching from Discover to Visa",
  "url": "https://www.theverge.com/2022/4/22/23037188/apple-cash-debit-cards-discover-visa-payments",
  "date": "2022-04-22T15:53:57.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/0ER_OcOfmujTYCL5ErslELsmN3k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70781046/acastro_170731_1777_0006_v1.0.jpg\" />        <figcaption>Apple Cash debit cards may be switching from Discover to Visa. | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"KKZ9Yk\">Apple Cash, formerly known as Apple Pay Cash, may be transitioning from the Discover payments network to Visa, a new <a href=\"https://www.macrumors.com/2022/04/22/apple-cash-visa/\">repor</a>t from <em>MacRumors</em> suggests. Visa has a <a href=\"https://www.bankrate.com/finance/credit-cards/pros-and-cons-of-discover-vs-visa/\">much larger global network</a> than Discover, which might account for the move. </p><p id=\"5aXQZS\">Since its launch in 2017, Apple Pay Cash had a <a href=\"https://www.businessinsider.com/apple-pay-cash-to-leverage-discover-network-2017-12\">partnership</a> with Green Dot Bank on Discover’s network, but in recent days, users have noticed that Apple Cash virtual cards now have a Visa logo on them. Apple Cash virtual cards live in users’ Apple Pay mobile wallets, and let them send peer-to-peer payments via iMessage. They function like virtual debit cards, and can be linked to a bank account or other debit card. Apple Card customers’ cash back earnings can be paid to Apple Cash accounts as well. </p><p id=\"ftBvgv\">Apple didn’t immediately reply to a request for comment on Friday so we don’t know if this transition will be happening for all Apple Cash users or when. But <em>MacRumors</em> says users who have Discover Apple Cash accounts can generate a new Apple Cash account number on the Visa network by deactivating Apple Cash in their device settings (I wasn’t able to reproduce this on my own device so far), and then reactivating.</p><p id=\"rMZEE4\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/H-8akpZWOBUhTvR-G5oFzRplEFE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8964133/acastro_170731_1777_0006_v1.jpg",
  "description": "Apple hasn’t commented on the apparent change",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}