{
  "title": "Apple will reportedly sell the iPhone as a subscription service",
  "url": "https://www.theverge.com/2022/3/24/22994814/apple-iphone-hardware-subscription-bundle-report",
  "date": "2022-03-24T17:43:39.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"The smaller notch on the iPhone 13 Pro Max (left) compared to the 12 Pro Max (right)\" src=\"https://cdn.vox-cdn.com/thumbor/DtzyAZxKkhxZJipueUoHkSnV6mQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70667381/vpavic_210916_untitled_0004.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"G5wBZd\">Apple is reportedly working on selling iPhones and iPads themselves as part of a hardware subscription service, <a href=\"https://www.bloomberg.com/news/articles/2022-03-24/apple-aapl-is-working-on-a-hardware-subscription-service-for-iphones?sref=9hGJlFio\">according to a new report from <em>Bloomberg</em></a>, whose author Mark Gurman writes the service could arrive next year. </p><p id=\"3urET0\">The move would fit into <a href=\"https://www.theverge.com/2019/3/20/18273179/apple-icloud-itunes-app-store-music-services-businesses\">Apple’s ongoing push</a> towards subscription services as a whole. Over the past several years, Apple has increasingly been emphasizing recurring subscriptions like Apple Music, Apple TV Plus, Apple News Plus, Apple Fitness Plus, and Apple Arcade as key new revenue streams for the company. Many of those services have already been bundled together into the company’s <a href=\"https://www.theverge.com/2020/10/30/21541685/apple-one-subscription-individual-family-premier-music-tv-plus-arcade-icloud-news-fitness\">Apple One bundles</a>, too. </p><p id=\"xV1Cib\">We’ve already seen a similar shift on the hardware front: Apple added a monthly subscription model for its AppleCare extended warranties back in 2019. And Apple has offered its <a href=\"https://www.apple.com/shop/iphone/iphone-upgrade-program?\">iPhone Upgrade Program</a> — which allows customers to pay for the combined cost of AppleCare and an iPhone over 24 months and the option to trade in their device after 12 months of payments — <a href=\"https://www.apple.com/shop/iphone/iphone-upgrade-program\">since 2015</a>. Both those programs already resemble a hardware subscription in many ways. </p><div class=\"c-float-right\"><aside id=\"pYR4vi\"><q>Apple already offers monthly iPhone payments</q></aside></div><p id=\"nAuKGV\">According to<em> Bloomberg</em>’s report, the monthly charge wouldn’t simply be the price of the device divided by 12 or 24 months, but rather be a still-undecided monthly cost, potentially with the option to upgrade to new hardware as its released. And like Apple’s other subscriptions, it would be tied to a user’s existing Apple ID account, with the possibility of bundling in AppleCare or Apple One services as well. </p><p id=\"SAGoft\"> Right now, you can pay Apple monthly for its services, and you can pay it monthly for an iPhone — but they’re still separate fees and plans to manage. </p><p id=\"vQbIj2\">It’s hard to imagine that Apple will simply be lending out devices on a monthly basis — will you really be able to just pay to “subscribe” an iPhone for a single month, like you can for Apple TV Plus to binge a season of <em>Ted Lasso</em>? Similarly, a world where Apple has customers invest months of capital to rent a device only to have them return it at the end of the process seems equally unlikely.</p><p id=\"D7x5WG\">It’s possible that Apple is simply looking to cut out the middleman and expand its installment-based payment offerings to other products. The iPhone Upgrade Program effectively has customers take out an interest-free loan with Citizens One, which they then repay over the course of the 24-month plan. Apple also allows Apple Card customers to pay for Apple products over monthly installments without paying interest, but that too is only limited to a small subset of Apple customers. An Apple-based subscription service could eliminate those requirements, and allow Apple to expand it to other hardware products (like the iPad or its Mac computers) too. </p><p id=\"QuxASe\">But while details are still slim, one thing is clear: Apple’s subscription ambitions are still only just getting started. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bhzcF8CuUL5IfCDOrzDM6JNgIwA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863283/vpavic_210916_untitled_0004.jpg",
  "description": "There’s not a lot of details on the program right now",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}