{
  "title": "Apple will drop iPhone Lightning port in favor of USB-C in 2023, claims analyst",
  "url": "https://www.theverge.com/2022/5/11/23066661/apple-iphone-15-drop-lightning-port-usb-c-2023-prediction-rumor",
  "date": "2022-05-11T10:40:59.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nRD21ixPaO25kH8Ko5gfuS5hm8k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70855616/akrales_190522_3440_0029.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"g9zGZS\">Apple is preparing to swap the proprietary Lightning port on its iPhones next year for the nearly universally-embraced USB-C, claims company analyst Ming-Chi Kuo. </p><p id=\"2SLHIH\">In a pair of tweets, Kuo said Apple was going to make the change in 2023, basing this claim on an unspecified “survey” (presumably of component manufacturers, from whom Kuo seems to get a lot of his information for predictions about future Apple products). </p><p id=\"5DdZwN\">Kuo said that adopting USB-C “could improve iPhone’s transfer and charging speed in hardware designs, but the final spec details still depend on iOS support.”</p><div id=\"126bgc\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">(2/2)<br>It's expected to see existing USB-C-related suppliers of Apple's ecosystem (e.g., IC controller, connector) become the market's focus in the next 1-2 years, thanks to vast orders from iPhones and accessories' adoption of USB-C ports.</p>— 郭明錤 (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://twitter.com/mingchikuo/status/1524329803280961540?ref_src=twsrc%5Etfw\">May 11, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"JzkbDF\">Kuo’s prediction is hardly without precedence — rumors and speculation about Apple adopting USB-C for the iPhone have swirled for years. The smartphone industry at large has embraced the reversible USB-C standard, and Apple itself has got partly on board, adding USB-C to <a href=\"https://support.apple.com/en-gb/HT209186\">its most recent iPads</a> and using USB-C-compatible Thunderbolt ports on many Macs. Pressure to switch has built from policymakers, too, with the EU still considering a proposal that would make USB-C ports <a href=\"https://www.theverge.com/2021/9/23/22626723/eu-commission-universal-charger-usb-c-micro-lightning-connector-smartphones\">mandatory on smartphones and other electronics</a> (with the intention of reducing e-waste by standardizing chargers and data cables).</p><p id=\"ntMpuV\">And yet, Apple has always seemed particularly resistant to the idea. It’s been suggested that the company <a href=\"https://www.theverge.com/2021/9/23/22689432/eu-iphone-usb-c-switch-portless-design\">would rather make its iPhones <em>portless</em></a>, relying on wireless charging and data transfer, than mar its devices with USB-C. And Kuo himself predicted just last year that Apple <em>isn’t</em> considering USB-C ports. In March 2021, he said Apple planned to keep Lightning ports on the iPhone for the “<a href=\"https://www.theverge.com/2021/3/1/22307716/apple-lightning-portless-iphone-usb-c-magsafe-charging-kuo-rumor\">foreseeable future”</a> — partly to keep the company’s lucrative Made for ‌iPhone‌ (MFi) program running, and partly for better waterproofing.</p><p id=\"l3NzXV\">Maybe, though, Lightning has simply fizzled out. As <em>MacRumors</em> <a href=\"https://www.macrumors.com/2022/02/28/lightning-port-nearing-expiration-whats-next/\">noted in a recent piece</a>, when Apple introduced the standard in September 2012, Phil Schiller called it “a modern connector for the next decade.” Well: it’s May 2022 and the decade is nearly up. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0mHX06bCgRlMtOTci216G53M6TA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16294979/akrales_190522_3440_0029.jpg",
  "description": "After a decade of Lightning, is it time for Apple to move on?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}