{
  "title": "Apple reportedly gives retail managers anti-union scripts",
  "url": "https://www.theverge.com/2022/5/12/23069415/apple-retail-unionization-talking-points-scripts",
  "date": "2022-05-12T23:50:06.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xiYDExGHlsOl8X24BQkJw-d9_WQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70863267/acastro_180604_1777_apple_wwdc_0001.0.jpg\" />        <figcaption><em>Managers have reportedly told employees that outside unions don’t know Apple or its culture.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"v2aeyT\">Apple has been coaching retail store managers on how to try and talk employees out of unionizing, <a href=\"https://www.vice.com/en/article/m7v8qp/leaked-memo-reveals-apples-anti-union-talking-points-for-store-managers\">according to <em>Vice</em></a>. The report says the company has sent around a document full of talking points like “an outside union that doesn’t know Apple” or its culture, or “most union contracts give preference based on seniority.” The document also encourages store leaders to “touch base” with employees about potential union activity.</p><p id=\"M2vv4J\">This comes at a time when there are union drives at several Apple retail stores — two have <a href=\"https://www.theverge.com/2022/4/20/23034175/apple-store-workers-atlanta-union-retail-amazon-google\">officially</a> <a href=\"https://www.theverge.com/2022/5/4/23056187/apple-second-store-union-election-petition-retail\">petitioned</a> the National Labor Relations Board to hold union elections, and another is <a href=\"https://www.theverge.com/2022/4/19/23032222/apple-retail-fruit-stand-workers-united-minimum-wage\">looking to do so</a>. It’s been pretty clear that Apple would try to fight these efforts; the company <a href=\"https://www.theverge.com/2022/4/25/23041632/apple-hires-anti-union-lawyers-littler-mendelson-union-fight-cwa\">hired anti-union lawyers</a>, and at least one worker has told <em>The Verge</em> that the company held a captive audience meeting to spread anti-union talking points. However, it’s still interesting to get a look at exactly the types of arguments the company is using.</p><div class=\"c-float-right\"><aside id=\"gE5FlL\"><q>What if the union you voted for is bad, actually?</q></aside></div><p id=\"vRiYSy\">The document, which is <a href=\"https://www.vice.com/en/article/m7v8qp/leaked-memo-reveals-apples-anti-union-talking-points-for-store-managers\">embedded in <em>Vice</em>’s report</a>, says it may not be possible for store employees to work together as a team if a union represents them, saying that a union “would actually speak <em><strong>for</strong></em>” employees about work-related issues (emphasis original). It gives managers an example to cite as a time when Apple listened to retail employees’ feedback and made changes based on it, and then warns that a union could “make things more complex and rigid.” Leaders, according to the document, “wouldn’t have the flexibility to act in the moment or to address each person’s unique needs.”</p><p id=\"1Ht0Nt\">There are also points that warn about “a rigid union contract that must be followed at all times” making it difficult for employees to seize unusual opportunities, or receive merit-based benefits. What if a union contract made it so employees could only do exactly what their job description says, it asks.</p><p id=\"YmFZlV\">According to <em>Vice</em>, managers at some Apple Stores have been passing the company’s message on during weekly meetings. </p><p id=\"kSv4Uc\">If some of those points sound familiar, it’s likely because they’re similar to the ones used by other companies. In the lead-up to its own union elections, Amazon reportedly held captive audience meetings where workers were told that union negotiators’ interests may not line up with theirs. The company’s CEO <a href=\"https://www.theverge.com/2022/4/20/23033881/amazon-ceo-andy-jassy-union-coments-elections-all-hands\">called unions “slower and more bureaucratic”</a> compared to employees having a direct connection with their managers. </p><p id=\"aKllgA\">It’s also worth noting that even Apple’s talking points acknowledge that the supposed downsides aren’t something inherent to unions — contracts don’t <em>have</em> to enforce rigid working conditions, or give preference to seniority. And while there <a href=\"https://www.theverge.com/2022/5/3/23055406/apple-union-maryland-retail-corporate-return-to-work-letter-core-together\">are</a> <a href=\"https://www.theverge.com/2022/5/3/23055452/apple-retail-store-atlanta-union-vote-date-set-june-cwa\">established</a> <a href=\"https://www.theverge.com/2022/4/20/23034175/apple-store-workers-atlanta-union-retail-amazon-google\">unions</a> involved with the union drives at Apple stores, the organizers themselves are Apple employees, despite the company’s claims about “placing many of our interactions into the hands of a third party.”</p><aside id=\"rF1g0q\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"This is what Apple retail employees in Atlanta are fighting for\",\"url\":\"https://www.theverge.com/2022/4/29/23048296/apple-retail-store-union-atlanta-cumberland-mall-open-letter\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/bEspe2VM_QH315QC-wUtGt5WL_c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477047/acastro_180604_1777_apple_wwdc_0001.jpg",
  "description": "It says unions don’t know Apple or its \"special culture.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}