{
  "title": "Apple’s new strategy is to give — not tell — users what they want",
  "url": "https://www.theverge.com/2022/3/9/22968839/apple-mac-studio-display-m1-ultra-strategy-users",
  "date": "2022-03-09T18:46:17.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MRzTHpJ8a31YyxZaMeQttYdNmvw=/1x0:1960x1306/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70600252/Apple_Mac_Studio_back_220308.0.jpg\" />        <figcaption><em>The new Mac Studio.</em> | Image: Apple</figcaption>    </figure>  <p id=\"BWzIwZ\">There was a time not long ago when it seemed like Apple spent more time telling its customers what <em>they</em> wanted rather than just giving it to them. </p><p id=\"e5EJAL\">Convenient features like SD card slots, HDMI ports, and a traditional laptop keyboard were unceremoniously booted from MacBooks in favor of USB-C and a <a href=\"https://theoutline.com/post/2402/the-new-macbook-keyboard-is-ruining-my-life?zd=1&amp;zi=cq2bmtxb\">disastrous butterfly keyboard</a> paired with a divisive OLED touch bar. Apple’s professionally focused Mac Pro was given a space-efficient cylindrical redesign that <a href=\"https://www.theverge.com/2017/4/4/15175994/apple-mac-pro-failure-admission\">failed at the basic task</a> of keeping power-hungry components (like those a professional user might actually need) cool.</p><p id=\"1tp5zY\">But with yesterday’s announcements, which include the powerful and port-rich Mac Studio and a new monitor that costs a fraction of the price of Apple’s previous attempt, Apple is now consistently doling out consumer-friendly features its fans have been calling for. </p><div class=\"c-float-right\"><aside id=\"j6uDAV\"><q>Apple is continuing its crowd-pleasing turnaround</q></aside></div><p id=\"JNq14s\">Take the Studio Display. With a starting price of $1,599, it’s much more expensive than most monitors on the market, but compared to Apple’s previous monitor, the <a href=\"https://www.theverge.com/2020/3/2/21161487/apple-mac-pro-display-xdr-review-6k-lcd-screen-price-features\">$4,999 Pro Display XDR</a>, which <a href=\"https://www.theverge.com/circuitbreaker/2019/6/3/18651001/apples-mac-pro-xdr-display-monitor-stand-expensive-dongle-not-included-wwdc-2019\">didn’t even come with a stand</a>, the Studio Display looks downright affordable. </p><p id=\"cWyuHB\">It’s still far from a mass-market product, and I’d wager the vast majority of people are going to stick with more generic black rectangles from the <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS48594121\">likes of Lenovo and Dell</a>. But the Studio Display includes the kind of quality-of-life features that are sure to make it popular with a certain subset of Apple’s users. There’s a 12-megapixel webcam integrated neatly into its upper bezel, mics with directional beamforming, and a built-in six-speaker system (which might actually sound pretty good if <a href=\"https://www.theverge.com/22440059/apple-imac-m1-2021-24-review\">Apple’s recent iMac</a> is anything to go by). It’s also 5K resolution, which is a relative rarity <a href=\"https://www.theverge.com/circuitbreaker/2019/7/30/20748047/lg-ultrafine-5k-display-apple-new-model\">outside of monitors from LG</a>, and packaged up in Apple’s trademark slick industrial design.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TMAOkw3LZbP1I1eYsac-5eT55w0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23300969/Apple_Studio_Display_MacOS_Monterey_220308.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>Apple’s Studio Display.</em></figcaption>  </figure><div class=\"c-float-right\"><aside id=\"XDwK9l\"><q></q></aside></div><p id=\"cOHd9l\">Then there’s <a href=\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\">the Mac Studio</a>, which looks to be a more powerful Apple Silicon Mac mini with almost all the ports a professional user could ask for. That means four Thunderbolt 4 ports on its rear and the continued existence of traditional USB-A, Ethernet, 3.5mm audio, and HDMI ports for the vast majority of users that still need them. There are even easily accessible ports and an SD-card slot on the front of the machine, which is wrapped up in a design that evokes nostalgia for Apple’s decades-old <a href=\"https://www.theregister.com/2011/06/30/ten_years_on_g4_cube_rip/?page=1\">Power Mac G4 Cube</a>.</p><div class=\"c-float-right\"><aside id=\"TcCBhm\"><q>An upgraded Mac mini, or an iMac Pro replacement?</q></aside></div><p id=\"WbaFqx\">The Mac Studio looks like a halfway house between the Mac mini and the Mac Pro. But it also appears to be the basis for a powerful replacement for the iMac Pro all-in-one, which <a href=\"https://www.theverge.com/2021/3/6/22316831/apple-store-imac-pro-base-model-while-supplies-last\">Apple discontinued a year ago</a>. At least, that was my takeaway after watching Apple comparing the performance of the Studio’s M1 Ultra with the kinds of Intel Xeon processors it used to include on its professionally focused all-in-one, and which Apple now includes in its more expensive Mac Pro.</p><p id=\"XEmXVf\">The pairing of a Mac Studio and Studio Display is a less expensive, more flexible alternative to the iMac Pro’s computer-inside-a-screen. The last iMac Pro started at $4,999, while the starting price of a Mac Studio with Studio Display is $3,598. But the fact that the two components are sold separately is also important. Even Apple’s <a href=\"https://www.theverge.com/2020/3/2/21161487/apple-mac-pro-display-xdr-review-6k-lcd-screen-price-features\">$4,999 monitor</a> is still an LCD display that can suffer from blooming, iffy black levels, and issues with off-axis viewing. These aren’t problems for the vast majority of users, but anyone doing professional color work will want something better, and Apple’s more flexible approach means they can buy a Mac Studio and get the display they want elsewhere.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/feFhXa00OXyOeq47fmi9_iAC2nE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9867147/jbareham_171213_2180_0158.jpg\">      <cite>James Bareham / The Verge</cite>      <figcaption><em>The iMac Pro.</em></figcaption>  </figure><p id=\"PK5TlR\">Away from the Mac, there was also good news for more budget-conscious smartphone buyers. 5G support is no longer exclusive to Apple’s flagship phones with the launch of the new iPhone SE. It’s a decision that may have more to do with <a href=\"https://www.theverge.com/2022/3/7/22958173/apple-5g-iphone-se-event-carriers-customers\">appeasing carriers</a> than consumers for now, but given how rarely Apple upgrades its entry-level smartphones, 5G might end up being far more essential before this device reaches its end of life, and the iPhone SE is one of the first major inexpensive smartphones that supports <a href=\"https://www.theverge.com/2022/1/19/22891284/verizon-c-band-5g-ultra-wideband-now-available\">C-Band 5G</a> right out of the box.</p><p id=\"6Wq5j5\">There are still other things that many users say they want but that Apple has no interest in providing. MacBooks were easily upgradeable in the past, and it was even possible (if difficult) to upgrade components <a href=\"https://docs.google.com/document/d/19gh_i4VG0_l7XnT7T_bjgeKyJoMuoi_PNFJo8Fibh-E/edit\">like the CPU and RAM</a> in the previous iMac Pro. But with the switch to its own Arm-based silicon, Apple has all but completely eliminated these user-serviceable parts, with everything from RAM to storage soldered onto the computers’ circuit boards. The best Apple could tell us there (via spokesperson Alex Bender) was that “customers have a variety of system memory options to meet their needs” and that “because Mac Studio and Studio Display are separate devices, users can upgrade either one down the road.”</p><p id=\"zHrDTp\">The only even vaguely modular computer Apple now sells is the Mac Pro, and who knows how much this will change when it makes the jump to Apple Silicon. </p><div class=\"c-float-right\"><aside id=\"WgQyvx\"><q>The shift became obvious in 2019</q></aside></div><p id=\"BJTSVu\">It’s hard to say exactly when Apple’s thinking shifted. Last year’s overhaul of its MacBook Pro lineup was the <a href=\"https://www.theverge.com/22733328/apple-macbook-pro-ports-professional-specs\">clearest evidence yet</a> that Apple was prepared to listen to the features being asked for by its most vocal power users, but I think the shift first became visible years earlier in 2017 when Apple <a href=\"https://www.theverge.com/2017/4/4/15175994/apple-mac-pro-failure-admission\">admitted its trash can Mac Pro was a mistake</a> and followed up in 2019 by <a href=\"https://www.theverge.com/2019/6/3/18646424/apple-mac-pro-redesign-new-specs-features-photos-wwdc-2019\">reviving the classic “cheese grater” Mac Pro</a> design that its power users had been asking for — with eight PCI-Express slots, standard memory module slots, and more ports.</p><aside id=\"8KQvoT\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple is ready to admit it was wrong about the future of laptops\",\"url\":\"https://www.theverge.com/22734645/apple-macbook-pro-2021-ports-magsafe-touch-bar-usb-c-future\"}]}'></div></aside><p id=\"PzQ5dm\">In retrospect, it’s an interesting coincidence that famed Apple designer Jony Ive’s departure from the company <a href=\"https://www.apple.com/uk/newsroom/2019/06/jony-ive-to-form-independent-design-company-with-apple-as-client/\">was announced</a> just weeks after the 2019 Mac Pro. The timing of the announcements wasn’t lost on <a href=\"https://onezero.medium.com/jony-ives-errors-why-ugly-isn-t-always-bad-design-but-beautiful-sometimes-is-9c5fde886263\">some commentators</a>, who quickly pointed to Ive’s history of form-over-function design missteps ranging from the original iMac’s “hockey puck” mouse through to the Apple TV’s original Siri remote. His obsessive, years-long focus on <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.wallpaper.com%2Fdesign%2Fjony-ive-apple-park&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F9%2F22968839%2Fapple-mac-studio-display-m1-ultra-strategy-users\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Apple’s new HQ</a> might have been a distraction as well.</p><p id=\"WUVetX\">Since then, Apple has continued to walk back <a href=\"https://www.theverge.com/22446699/apple-tv-4k-hd-siri-remote-review-features-price\">many of the most controversial design decisions</a> of the Ive era, even if its <a href=\"https://www.theverge.com/2022/3/8/22967472/apple-black-magic-trackpad-peripherals-mouse-charging\">latest Magic Mouse</a> still insists on <a href=\"https://www.theverge.com/22967776/apple-magic-mouse-charging-port-bottom-upside-down-its-2022\">charging from the bottom</a>. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JY7mfNejfVDbX486GvNIzYAolMo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9833361/Apple_Magic_Mouse_Bad_Design_2.0.jpg\">      <cite>Image: The Verge</cite>      <figcaption><em>It’s 2022, people.</em></figcaption>  </figure><p id=\"9gMdgl\">I don’t want to overstate Ive’s influence — or understate his accomplishments — at a company that’s as massive and successful as Apple. But with each passing Apple event, it’s hard to ignore the fact that a product shift is happening at the company. Once sparse and streamlined MacBooks are growing useful ports and reverting to thicker and more reliable keyboards, TV remotes are <a href=\"https://www.theverge.com/22446699/apple-tv-4k-hd-siri-remote-review-features-price\">swapping confusing trackpads for intuitive D-pads</a>, and even the humble iPhone is <a href=\"https://www.theverge.com/22684421/apple-iphone-13-mini-review\">thickening up to make room for a bigger battery</a>. </p><div class=\"c-float-right\"><aside id=\"yi8GGf\"><q>“If I had asked my customers what they wanted, they would have said a faster horse”</q></aside></div><p id=\"GwRTis\">Yes, sometimes there’s value in making bold decisions on behalf of your customers. Just look at <a href=\"https://www.youtube.com/watch?v=eywi0h_Y5_U\">what people said</a> when Apple dared to announce the original <a href=\"https://www.nytimes.com/2007/06/13/technology/13phone.ready.html\">iPhone without a physical keyboard</a> or <a href=\"https://www.theverge.com/2016/12/20/14016568/apple-airpods-wireless-earpods-earbuds-review\">when Apple first released the now ultra-popular AirPods</a>. These were product categories in their infancy, and Apple succeeded by making big (and sometimes unpopular) decisions about what form they should take. That Henry Ford quote about faster horses is <a href=\"https://quoteinvestigator.com/2011/07/28/ford-faster-horse/\">almost certainly fake</a>, but it persists because it neatly expresses something that feels so true — and because Apple’s Steve Jobs <a href=\"https://archive.fortune.com/galleries/2008/fortune/0803/gallery.jobsqna.fortune/2.html\">famously quoted it himself</a>. But Tim Cook’s Apple has been known to override Steve Jobs-era decisions, like the idea that Apple’s customers <a href=\"https://www.theverge.com/22639629/tim-cook-apple-ten-years-decade-steve-jobs-legacy\">shouldn’t get a larger iPhone</a>.</p><p id=\"p8f62w\">Tech like laptops and desktop computers are long past their infancy. They’re established product categories, where customers have a clear idea of how they like them to work and what they need to get the job done. So thank god Apple isn’t just telling people how they should be using its products. Instead, with its latest announcements, the company’s showing that it can listen as well.</p><div id=\"njgPsa\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Apple March 2022|106185\" data-volume-uuid=\"d46b6b1e2\" data-volume-id=\"106185\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-641\" class=\"volume-video\" data-volume-player-choice=\"youtube\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/FSCwNE971asVEPtjFFVPqwTwcVU=/0x140:1960x1166/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23300959/Apple_Mac_Studio_back_220308.jpg",
  "description": "After years of bold, unpopular decisions",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}