{
  "title": "Apple says a ‘small portion’ of iPhones recorded interactions with Siri even if you opted out",
  "url": "https://www.theverge.com/2022/2/8/22924225/apple-ios-15-bug-recorded-interactions-siri",
  "date": "2022-02-08T23:29:14.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vxmsHduCPKVNsOc118zjfdyyClA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70486014/acastro_180604_1777_apple_wwdc_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"P8uAgc\">Apple’s release of <a href=\"https://developer.apple.com/documentation/ios-ipados-release-notes/ios-ipados-15_4-release-notes\">iOS 15.4 beta 2</a> fixes a bug that may have recorded interactions with Siri on some devices, regardless of whether you opted out, according to a report from <a href=\"https://www.zdnet.com/article/ios-15-4-update-why-youre-asked-to-help-improve-siri-after-updating/\"><em>ZDNet</em></a>. The bug, which was first introduced in <a href=\"https://www.theverge.com/22683681/ios-15-ipados-review-iphone-ipad-apple\">iOS 15</a>, automatically enabled the <a href=\"https://www.apple.com/legal/privacy/data/en/improve-siri-dictation\">Improve Siri &amp; Dictation</a> setting that gives Apple permission to record, store, and review your conversations with Siri.</p><div class=\"c-float-right\"><aside id=\"AlUV9r\"><q>“We stopped reviewing and are deleting audio received from all affected devices”</q></aside></div><p id=\"fvFCJM\">Apple told <em>ZDNet</em> that it has since deleted any recordings collected in connection with the bug. After discovering the bug, the company reportedly turned off the feature for “many” users when it released iOS 15.2, but fully fixed the bug in the second beta of iOS 15.4. As <em>ZDNet</em> points out, this is the reason why you might get a prompt asking for your permission to enable the Improve Siri &amp; Dictation feature once you install the new 15.4 beta.</p><p id=\"X7qtU6\">“With iOS 15.2, we turned off the Improve Siri &amp; Dictation setting for many Siri users while we fixed a bug introduced with iOS 15,” Apple said in a statement to <em>ZDNet</em>. “This bug inadvertently enabled the setting for a small portion of devices. Since identifying the bug, we stopped reviewing and are deleting audio received from all affected devices.”</p><p id=\"ahCJZK\">This seems like the kind of bug that Apple should explicitly warn all of its users about, and urge them to ensure their iPhones are up-to-date while notifying anyone affected. Instead, the company has left us in the dark about how many phones were affected, or when. Without transparency, there’s no way to tell who may have had their conversations <a href=\"https://www.theverge.com/2019/8/28/20836760/apple-apology-siri-audio-recordings-privacy-changes-contractors\">recorded and listened to by Apple employees</a> despite asking to avoid exactly that outcome. If you have an iPhone, now might be a good time to update to iOS 15.2 or later (if you haven’t already).</p><p id=\"m85R5B\"><em>The Verge</em> reached out to Apple with a request for comment but didn’t immediately hear back.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/r9UQpwU7k-G2aeq6L8OPdaS9jKc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477053/acastro_180604_1777_apple_wwdc_0004.jpg",
  "description": "An iOS 15 bug turned on recording for some users.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}