{
  "title": "Apple’s hidden setting instantly makes your video and audio calls sound better",
  "url": "https://www.theverge.com/23123578/apple-voice-isolation-facetime-calls",
  "date": "2022-05-18T18:05:24.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"Apple iPad 2018\" src=\"https://cdn.vox-cdn.com/thumbor/vzdqWur-a2-_NMBkIOb_PvYIcaU=/0x41:571x422/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883946/ipad_pro_group_facetime_10302018_inline.jpg.large.0.jpg\" />        <figcaption>Image: Apple</figcaption>    </figure>  <p id=\"1F2nbX\">Whenever possible, I like to use FaceTime Audio or WhatsApp instead of making regular phone calls. The people I’m calling see it like a normal phone call, but the audio quality is leaps and bounds better than a good old-fashioned phone call.</p><p id=\"P51APg\">But! It turns out I wasn’t even doing my internet calls the right way. Today, I learned that there’s a newish feature buried in the Control Center that instantly improves the quality of your microphone during calls, whether you’re audio-only or on video. </p><p id=\"SnbaEo\">It’s called Voice Isolation, and it works on most <a href=\"https://support.apple.com/guide/iphone/change-the-audio-settings-iphb54d5dee2/ios#:~:text=Voice%20Isolation%20mode%20prioritizes%20your,Mode%2C%20then%20select%20Voice%20Isolation.\">iPhones</a>, <a href=\"https://support.apple.com/guide/ipad/change-the-audio-settings-ipadb3547a24/ipados\">iPads</a> and <a href=\"https://support.apple.com/guide/facetime/change-audio-options-fctme7c07113/mac#:~:text=Voice%20Isolation%20prioritizes%20your%20voice,Select%20Voice%20Isolation.\">Macs</a> from the last few years as long as you’re running iOS 15 or macOS Monterey. (Anything that supports Spatial Audio seems to also support Voice Isolation.) It’s weirdly hard to find, and you can only access the setting when you’re already in a call: you swipe down from the upper-right corner (or click in the upper-right corner on a Mac) to get to the Control Center, then tap on the button that says “Mic Mode.” By default, it’s set to Standard, but there are two other options: Voice Isolation and Wide Spectrum. Wide Spectrum will actually let the other people on your call hear <em>more </em>background noise, which I guess is useful if you’re holding up your phone at a concert but mostly sounds like a horrible thing to do to the other people on the line. But Voice Isolation? Voice Isolation is where the magic happens.</p><div id=\"mTmePD\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">i had no clue that a) Voice Isolation was a feature available on the new iPhones / Airpods and b) it worked so well. It's incredible on the other end — you hear nothing but the person you are talking to. Surprised it's not automatically turned on!</p>— can duruk (@can) <a href=\"https://twitter.com/can/status/1526312043220828160?ref_src=twsrc%5Etfw\">May 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"po7iOO\">Basically, when you enable Voice Isolation, your device begins to aggressively process the audio coming into your mic in order to remove background noise. When I turned on the setting on my iPhone 12, my dog barking 20 feet away completely disappeared — and so did nearly all of the sounds of traffic. When I turned it on on my MacBook, the sounds of both my laptop fan and my keyboard typing stopped coming through altogether. </p><div class=\"c-float-right\"><aside id=\"Mx5JgF\"><q>When I turned on Voice Isolation, the sounds of my dog and traffic totally disappeared</q></aside></div><p id=\"jsHKZw\">In the process of isolating the voice, Apple also seems to bring it closer; there’s much less echo and room tone, so it sounds like you’re holding your phone to your face even when you’re not. The tradeoff is that your voice definitely sounds more processed, but it always sounds processed through apps like FaceTime or Zoom. </p><p id=\"loWUXA\">In my testing, there was one moment when two cars revved their engines at the same time only a few feet from where I was standing when the AI seemed to get overwhelmed and just output a half-second of total silence. But it’s not like you’d have been able to hear me over the roar anyway, right? And, in general, a little more processing for a lot less background noise is an easy trade to make for most calls. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/i2FLa0WKmXNyOe5P4WX0cK6hKek=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23542175/Voice_Isolation.jpg\">      <cite>Image: Apple/David Pierce</cite>      <figcaption><em>To turn on Voice Isolation, open up Control Center while you’re on a call.</em></figcaption>  </figure><p id=\"qw0UJi\">There are only two problems with Voice Isolation. One, it’s not a universal setting, so you’ll have to enable it in every app you use for calls. Two, it doesn’t work everywhere. Apple makes Voice Isolation available through an API on iOS, iPadOS and macOS, but not every app supports it. On mobile devices, the track record is pretty good: Snapchat, WhatsApp, Slack, Signal, and Instagram all support it, though TikTok doesn’t. Zoom had it on iOS but not the Mac, and there’s no way to turn it on for any in-browser apps as far as I can tell, so that rules out Google Meet and a handful of others. </p><p id=\"GbCvZt\">But the most glaring absence? Regular ol’ phone calls. There are no Mic Modes at all for phone calls even though that’s the place you could probably most use a little bit of improvement. I asked Apple why this is, but the company didn’t comment. </p><p id=\"FYz12x\">To be fair, even in normal modes, Apple’s doing some noise-cancellation work. If you ever want to test it, hold up a fan to your phone and listen as the device takes a few seconds to identify and suppress it, but it doesn’t go far enough. I’ve now heard Voice Isolation, which means I’ve heard what better can sound like. And I want it everywhere, and I want it on all the time — for my sake and for everyone I talk to.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/JylKOtB6OL5kR427T0SiglUWI_0=/0x82:571x381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13358159/ipad_pro_group_facetime_10302018_inline.jpg.large.jpg",
  "description": "Turn this on everywhere you can, ASAP.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}