{
  "title": "Apple Pay is anticompetitive, says EU in preliminary ruling",
  "url": "https://www.theverge.com/2022/5/2/23048116/apple-pay-eu-antitrust-nfc-payment-wallet",
  "date": "2022-05-02T18:15:54.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Bqk5VAR3dWfQ3NBc3XKXf6Mu4ZI=/1x0:1960x1306/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70821380/Apple_Apple_Pay_Transaction_big.jpg.large_2x.0.jpg\" />        <figcaption><em>Apple Pay recently expanded to let merchants receive payments on their iPhone. </em> | Image: Apple</figcaption>    </figure>  <p id=\"SPHrAb\">Apple has been hit with an antitrust accusation by the European Union over its exclusion of rivals from its Apple Pay mobile payment system. The EU sent Apple a formal “Statement of Objections” with the preliminary view that Apple has abused its dominant position in mobile wallets on iOS. </p><p id=\"ELZFtC\">“The Commission takes issue with the decision by Apple to prevent mobile wallets app developers, from accessing the necessary hardware and software (‘NFC input’) on its devices, to the benefit of its own solution, Apple Pay,” <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_2764\">reads the decision</a>. “Today’s Statement of Objections takes issue only with the access to NFC input by third-party developers of mobile wallets for payments in stores.”</p><p id=\"qGrxrJ\">According to the EU, Apple’s exclusionary behavior “leads to less innovation and less choice for consumers for mobile wallets on iPhones.”</p><div class=\"c-float-right\"><aside id=\"z3DQWq\"><q>This is only the initial formal stage of antitrust proceedings against Apple</q></aside></div><p id=\"BMbtMe\">This is only the initial formal stage of antitrust proceedings against Apple, and the company will have the chance to respond to the Commission’s list of objections. The EU notes that the sending of a Statement of Objections “does not prejudge the outcome of an investigation.”</p><p id=\"il7W1F\">“Apple Pay is only one of many options available to European consumers for making payments, and has ensured equal access to NFC while setting industry-leading standards for privacy and security,” Apple spokesperson Hannah Smith said in a statement to <em>The Verge</em>. “We will continue to engage with the Commission to ensure European consumers have access to the payment option of their choice in a safe and secure environment.”</p><p id=\"ZfoUGt\">Today’s ruling follows accusations last year that the company <a href=\"https://www.theverge.com/2021/4/30/22407376/apple-european-union-antitrust-charges-app-store-music-competition-commission-margrethe-vestager\">unfairly penalizes rival music streaming services</a>. The EU has the ability to levy fines up to 10 percent of Apple’s global revenue ($36 billion) as well as force changes to the company’s business practices. In practice, though, any fines upheld against Apple’s likely appeal to the charges will be much smaller.</p><p id=\"kIg393\">The Commission’s preliminary view against Apple once again shows the EU is leading the way in attempts to rein in the power of Big Tech. In past weeks, the bloc has passed two major legislative acts intended to counter the negative effects of digital behemoths. These are <a href=\"https://www.theverge.com/2022/4/23/23036976/eu-digital-services-act-finalized-algorithms-targeted-advertising\">the Digital Services Act (DSA)</a>, which forces companies to take tighter control of harmful content on their platforms, and <a href=\"https://www.theverge.com/2022/3/24/22994234/eu-antitrust-legislation-dma-digital-markets-act-details\">the Digital Markets Act (DMA)</a>, which is intended to level the business playing field, allowing smaller companies to compete with the largest corporations. </p><p id=\"luiGc1\">Apple has objected to a number of provisions outlined by the EU, particularly those that loosen the company’s grip over the App Store (from which Apple collects significant revenue). </p><p id=\"C0UxX8\"><em><strong>Update May 2nd 2:15PM ET: </strong></em><em>Updated to add a statement from Apple.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lhO-66qv4pGjHKp5FQYl5CUxzaA=/0x140:1960x1166/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23425179/Apple_Apple_Pay_Transaction_big.jpg.large_2x.jpg",
  "description": "EU antitrust goes for another bite of the Apple.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}