{
  "title": "Apple will let your subscription apps charge you more money without asking",
  "url": "https://www.theverge.com/2022/5/16/23078313/apple-app-store-subscription-price-increase-permission-rules",
  "date": "2022-05-17T00:31:46.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/36NNCrqIuHVNVYtnSNTyYNb2Zmc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70876805/acastro_210831_1777_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"YdHIbw\">Apple has <a href=\"https://developer.apple.com/news/?id=tpgp89cl&amp;1652741582\">updated its App Store rules</a> to make it so subscriptions can auto-renew without your explicit permission, even if the developer has raised the monthly or annual price. Before the rule change, users would have to manually opt-into a subscription renewal if it came with a price bump; now, that won’t necessarily be the case, though you’ll still be notified about the price change before it happens. Apple says it’s making the change to help avoid the situation where users unintentionally lose access to a subscription because they missed an opt-in message.</p><p id=\"iKRSam\">According to <a href=\"https://developer.apple.com/news/?id=tpgp89cl&amp;1652741582\">Apple’s Monday evening post</a>, there are specific conditions that developers will have to follow if they want to offer what the company is calling “an auto-renewable subscription price increase.” For starters, it can only be so big — <a href=\"https://help.apple.com/app-store-connect/#/devc9870599e\">Apple’s rules say</a> that if a developer increases a weekly or monthly subscription price by more than 50 percent, and that difference is over $5, it doesn’t qualify.  For an annual subscription, devs can still raise the price by 50 percent, but can’t raise it more than $50 USD without requiring an opt-in.</p><div class=\"c-float-right\"><aside id=\"pMEMzI\"><q>A $100 a year subscription could go up by $50 a year without requiring an opt-in, but not by $51 a year</q></aside></div><p id=\"1aq8KQ\">Here are some examples of what that could look like: let’s say I have a subscription that’s $60 a year. The developers could raise it to $90 ($60 plus 50 percent), and it would auto-renew without me having to opt-in. If I have a monthly subscription that’s $15, and the developers wanted to raise it to $22, in theory I’d have to opt-into that — it’s less than a 50 percent increase, but over the $5 cap. </p><p id=\"OqYIEC\">However, Apple’s wording leaves things a bit unclear: what if there’s an app that costs $10 a year, and goes up to $60 a year? Apple’s rules say, verbatim, that consent is needed if the price increase is:</p><blockquote><p id=\"lQVoWB\">More than 50% of the current price; and</p><p id=\"5OILLY\">The difference in price exceeds approximately $5 United States Dollar (USD) per period for non-annual subscriptions, or $50 USD per year for annual subscriptions.</p></blockquote><p id=\"iejZQC\">Reading that literally, it means that <em>both</em> conditions would have to be true to require an opt-in. But the example scenario seems so ridiculous that it’s hard to believe that’s what Apple intends. We’ve reached out for clarification on this point, and will update if we receive any.</p><p id=\"jaC6rS\">The price can only be raised once per year without requiring an opt-in, which should help prevent scammy apps from slowly increasing their price by a buck or two every other month. Apple also says the price increase has to be “permissible by local law,” though that one was probably a given.</p><p id=\"5POSda\">If any of those conditions aren’t met, you’ll still have to opt-in to the price increase, otherwise your subscription will lapse. Apple says that users will be warned about upcoming automatic renewals with price changes by “email, push notifications, and in-app messaging.” It’s worth noting that you could easily turn Apple’s logic on its head: if users were missing those renewal opt-in notices, wouldn’t they also miss these new price change warnings? But it does sound like they’ll be relatively in your face.</p><p id=\"vW5Uph\">We’ve seen evidence that this change was coming — last month, <a href=\"https://techcrunch.com/2022/04/05/apple-pilot-tests-feature-that-allows-developers-to-automatically-charge-users-for-subscription-price-increases/\"><em>TechCrunch</em> reported</a> that Apple appeared to be testing this change with a Disney Plus price increase. Developer Max Seelemann also <a href=\"https://twitter.com/macguru17/status/1506991668108668936\">posted a screenshot</a> in March showing what one of the notifications looked like, though it’s not clear whether this the final design. At the time, Apple confirmed that it was “piloting a new commerce feature we plan to launch very soon,” and said that it would provide details. It looks like that day is here.</p><div id=\"JIlHrW\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">iOS biz people… Subscription price increase as mere NOTICE instead of having to confirm, else subs expires.<br><br>Is this new behavior for everyone or exclusive to Disney+? <a href=\"https://t.co/zt7c15QcTA\">pic.twitter.com/zt7c15QcTA</a></p>— Max Seelemann (@macguru17) <a href=\"https://twitter.com/macguru17/status/1506991668108668936?ref_src=twsrc%5Etfw\">March 24, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"jfmVoE\">The screenshot from March shows that, near the “OK” button, there’s a link that says “to learn more or cancel, review your subscription.” Apple’s post on Monday says that it “will also notify users of how to view, manage, and cancel subscriptions if preferred,” a promise that would seemingly be fulfilled by that link.</p><div class=\"c-float-right\"><aside id=\"STmHrs\"><q>I want to know where every dollar was going, and this change makes that ever-so-slightly more difficult</q></aside></div><p id=\"AQpca4\">From my point of view, Apple’s definitely making a trade-off here between consumer friendliness and convenience. There are probably a lot of people who will be happy that they won’t have to go and re-subscribe to a thing just because the price went up by a buck and they missed an opt-in prompt. </p><p id=\"trBNbf\">Personally, though, I like to know where every dollar is going — and since I almost always opt for annual subscriptions, it seems like I’ll have to be on the lookout for apps that could be going up in price by a pretty significant sum (that $60 subscription wasn’t a hypothetical example). There is an easy fix to this: <em>let users pick </em>whether or not they want the auto-renewing price increases instead of deciding for them. In my mind, that’d just be a toggle in the App Store settings that says something like “Always ask for opt-in if price increases,” and turning it on would make it like this change never happened.</p><p id=\"Av944b\">Apple didn’t immediately respond to <em>The Verge</em>’s question on whether there were plans to add such a toggle.</p><p id=\"QI6kzD\">Or, if Apple wanted to be really consumer-friendly, it could make it so subscriptions don’t auto-renew by default. As my colleague Sean Hollister pointed out in <a href=\"https://www.theverge.com/2021/9/3/22654197/apple-app-store-editorial-scams-refunds\">his piece</a> on how Apple could show it cares about App Store users, Apple co-founder Steve Jobs has a relevant quote (though at the time he was talking about privacy):</p><blockquote><p id=\"UuvLZC\">Ask them. Ask them every time. Make them tell you to stop asking them if they get tired of your asking them.</p></blockquote><p id=\"lud1fl\">With this rule change, Apple has moved one step further away from that.</p><aside id=\"C6AciK\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Eight things Apple could do to prove it actually cares about App Store users\",\"url\":\"https://www.theverge.com/2021/9/3/22654197/apple-app-store-editorial-scams-refunds\"}]}'></div></aside><p id=\"PmrQOL\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4AksjaM_7Q3H_IuoLv3MNC0vcHg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22817753/acastro_210831_1777_0002.jpg",
  "description": "The new policy has a big question mark.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}