{
  "title": "Apple offering a free fix for Apple Watch Series 6 with blanked out screens ",
  "url": "https://www.theverge.com/2022/4/27/23044421/apple-watch-series-6-blank-screens-fix",
  "date": "2022-04-27T13:56:40.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"The Apple Watch Series 6, in Product Red\" src=\"https://cdn.vox-cdn.com/thumbor/CGJG6FhcmAD2pj5bDXaFwIruK_I=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70799382/vpavic_200929_4216_0128.0.jpg\" />        <figcaption><em>The screens on some 40mm Series 6 models may go permanently blank. </em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"W1bI9H\">A small number of Apple Watch Series 6 models may have an issue that causes their display to go permanently blank. The good news is Apple now says you can get it fixed for free.</p><p id=\"CshoAR\">The program (as spotted by <a href=\"https://9to5mac.com/2022/04/22/apple-announces-service-program-for-apple-watch-series-6-blank-screen-issue/\"><em>9to5Mac</em></a>) was quietly launched late last week. According to Apple, the issue only affects 40mm models of the Series 6 manufactured between April and September 2021. If you’ve been experiencing this problem and have an eligible Watch, Apple or an Apple Authorized Service Provider will fix the issue free of charge.</p><p id=\"5KKFW1\">To check for eligibility, you’ll need to know your device’s serial number. If your Series 6 display is blanked out, then it’s best to head to the Watch app on your phone. From there, head to the <strong>My Watch</strong> tab, select <strong>General</strong>, tap <strong>About</strong>, and scroll down to the Serial Number. From there, you can head to <a href=\"https://support.apple.com/apple-watch-series6-service-program-for-blank-screen-issue\">Apple’s website</a> and input the number.</p><div class=\"c-float-right\"><aside id=\"CdhYLC\"><q>The issue only affects 40mm models of the Series 6 made between April and September 2021</q></aside></div><p id=\"QbeWiH\">As for actually getting the device serviced, you have a few options. You can either take it directly to an Apple Store or head over to an <a href=\"https://locate.apple.com/pr/en/\">authorized third-party repair shop</a>. Alternatively, you can also contact Apple Support if you’d rather mail in the device for repair. </p><p id=\"8TtcAG\">As always, there’s some fine print, too. For instance, the fix will not extend the standard warranty of the device. And while the service is worldwide, if the issue presents itself while you’re traveling, you might have to wait to get it serviced in the country or region where you bought it. Also, if your Series 6 has any other sort of damage that may “impair the service,” you might find yourself saddled with additional repair fees. Lastly, there’s also a time limit for the program. Apple says eligible Series 6 models will be covered for only two years after first retail sale — something you should consider if you bought your device secondhand. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QqMHBwQX6div3b1dViZGPUlEscU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21925562/vpavic_200929_4216_0128.jpg",
  "description": "The issue only affects the 40mm Series 6.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}