{
  "title": "Apple’s still not catching scammy apps, and this time they’re on the Mac",
  "url": "https://www.theverge.com/2022/4/15/23027363/apple-scammy-apps-mac-app-store-moderation",
  "date": "2022-04-16T00:39:27.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pcOF7R94aa2osl0vVzB_XDUFy6M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70755667/acastro_210831_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"21b1Bc\">Scam app hunter / developer Kosta Eleftheriou, known for <a href=\"https://www.theverge.com/2021/4/21/22385859/apple-app-store-scams-fraud-review-enforcement-top-grossing-kosta-eleftheriou\">catching egregious scams</a> that make it past Apple’s review process, has once again brought attention to a new crop of shady apps being peddled through the App Store. This time they’re on the Mac, and they’re using pop-ups that make it extremely difficult to quit an app without agreeing to outrageous subscription prices — all without Apple noticing, despite its argument that its App Review process <a href=\"https://www.theverge.com/2021/6/23/22546771/apple-side-loading-security-risk-report-regulatory-pressure\">keeps devices and users safe</a>.</p><p id=\"SpeJ8z\">The app that started the hunt, which seems to have been <a href=\"https://twitter.com/evacchi/status/1513967576166158343\">discovered by Edoardo Vacchi</a>, is called My Metronome. According to Vacchi, Eleftheriou, and user reviews, the app locks up and won’t let you quit it using keyboard shortcuts or the menu bar until you agree to a $9.99-a-month subscription. (It can, however, be force quit.) Eleftheriou told <em>The Verge</em> that it “seems like this developer has experimented with various techniques over the years of preventing people from closing the paywall,” pointing us to several other apps that are still on the store with similar behavior — we’ll get to those in a moment.</p><div id=\"MonOJ5\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I didn’t think this was possible:<br><br>This App Store app immediately asks you for money and then *disables* the “Quit” option so that you can never close it!<br><br>And it’s been like that on the App Store for years!<a href=\"https://t.co/DpOLtz9PCd\">https://t.co/DpOLtz9PCd</a> <a href=\"https://t.co/UCnRq2WvnF\">pic.twitter.com/UCnRq2WvnF</a></p>— Kosta Eleftheriou (@keleftheriou) <a href=\"https://twitter.com/keleftheriou/status/1514732739974471680?ref_src=twsrc%5Etfw\">April 14, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"0x06C6\">Sometime after Eleftheriou <a href=\"https://twitter.com/keleftheriou/status/1514732739974471680\">tweeted about My Metronome</a>, the app was seemingly removed from the store. Trying to open the link pops up with a message saying that it’s no longer available in my region. (Though, to be clear, you probably shouldn't try to download it or any of the apps we’re about to talk about.) Apple didn’t respond to <em>The Verge</em>’s request for comment about whether it was the one to take the app down, or how it passed App Review in the first place.</p><aside id=\"ByTDkZ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Eight things Apple could do to prove it actually cares about App Store users\",\"url\":\"https://www.theverge.com/2021/9/3/22654197/apple-app-store-editorial-scams-refunds\"},{\"title\":\"Gee, I wonder how Apple Podcasts suddenly became a five-star app\",\"url\":\"https://www.theverge.com/2022/2/2/22914612/apple-podcasts-app-rating-user-reviews-problem\"}]}'></div></aside><p id=\"AfOSqV\">The story doesn’t end there though. As developer Jeff Johnson <a href=\"https://twitter.com/lapcatsoftware/status/1513970950554984453\">discovered</a>, the company that made the metronome app, Music Paradise, LLC, has a connection to another App Store developer, Groove Vibes. The <a href=\"https://groovevibes.club/privacy\">privacy</a> <a href=\"https://musicparadise.mobi/privacy\">policies</a> listed on both developers’ websites (which are linked on their App Store pages) say they’re registered at the same address, and both mention the same legal entity, Akadem GmbH.</p><div id=\"TgzlgO\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: This developer \"Music Paradise, LLC\" appears to be the exact same developer as \"Groove Vibes\". Registered at the  same street address in Novosibirsk, Russia!<br><br>Also, both apps lock up your Mac and can't be quit, which is what led me to investigate.<a href=\"https://t.co/c4Tqk83y7X\">https://t.co/c4Tqk83y7X</a> <a href=\"https://t.co/xum3HGn8oI\">https://t.co/xum3HGn8oI</a> <a href=\"https://t.co/363WK9bNNc\">pic.twitter.com/363WK9bNNc</a></p>— Jeff Johnson (@lapcatsoftware) <a href=\"https://twitter.com/lapcatsoftware/status/1513970950554984453?ref_src=twsrc%5Etfw\">April 12, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"gUg3uA\"><em>The Verge </em>decided to test these apps ourselves, so we fired up the Mac App Store and downloaded Music Paradise’s other app, Music Paradise Player, along with Groove Vibes’ entire catalogue of Mac apps. All of them had an immediate pop-up asking for money in the form of a recurring subscription (usually around the $10-a-month price point, give or take a few bucks). Three of Groove Vibes’ apps worked appropriately — you could quit them with the menu bar, or by pressing Command+Q. </p><p id=\"phz0Gy\">However, two apps from the developer, along with Music Paradise Player, greyed out the quit option on the menu bar, and don’t let you press the standard red close button. Keyboard shortcuts were no help either; they stayed open even while I spammed Command+Q, Command+W, and the escape button.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mZHORuGKygnL6bd-46oNGxThBjE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23393457/Screen_Shot_2022_04_15_at_3.12.19_PM.png\">      <figcaption><em>An app should not be able to do this as soon as you open it.</em></figcaption>  </figure><div id=\"xGjBfr\"><blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\"><a href=\"https://t.co/vt214Pk9od\">pic.twitter.com/vt214Pk9od</a></p>— Mitchell (@strawberrywell) <a href=\"https://twitter.com/strawberrywell/status/1515127456302129155?ref_src=twsrc%5Etfw\">April 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"aOUsAb\">The apps don’t totally lock you out of your computer like the ransomware that often makes the news, as there are other ways to close them even if you don’t know how to force quit. Music Paradise Player has an “X” button on its offer screen, and once you press it the subscription screen goes away and you can quit the app normally. FX Tool Box has a small “Maybe Later” button that does the same thing. All To MP3 Convertor has a similar “just let me into the app so I can close it” button, but it is by far the worst offender when it comes to hiding it. It’s a piece of text that says “continue with the limited edition,” nestled between other pieces of text, without any obvious sign that it’s actually a link.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BN8LSNeyegmSzmPsBdG2zHDsgik=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23393268/Screen_Shot_2022_04_15_at_2.25.47_PM.png\">      <figcaption><em>The button that lets you quit All To MP3 Convertor is about as non-obvious as possible without literally being invisible.</em></figcaption>  </figure><p id=\"4EVglY\">But the fact that a savvy user could close these apps, if need be, doesn’t excuse their existence on the store. In theory, App Review should’ve tried them out and rejected them for violating Apple’s guidelines. It’s frustrating to see these apps slip through Apple’s net when there are plenty of other examples where developers get dinged <a href=\"https://twitter.com/jeiting/status/1514331013631164429?s=20&amp;t=Mm4YMwch6ySa8QotTiAYwA\">for seemingly arbitrary reasons</a> (or even just for <a href=\"https://www.cnbc.com/2019/04/02/apple-bends-its-app-store-rules-in-services-push-developers-say.html\">following Apple’s example</a>).</p><p id=\"GF0DRF\">But Apple has let plenty of other scammy apps that flagrantly break its rules slip through the cracks. Eleftheriou previously discovered an iPhone app that <a href=\"https://www.theverge.com/2021/5/26/22454468/ios-app-scam-review-3-star-force-review-process-apple\">won’t work unless you give it a good review</a>, as well as games for kids that <a href=\"https://www.theverge.com/2021/4/15/22386533/ios-app-scam-jungle-runner-magical-forest-apple-kosta\">turned into actual gambling apps</a> when opened from a certain country. The company has <a href=\"https://www.theverge.com/2021/6/7/22523332/apple-app-store-guidelines-change-wwdc-2021-fraud-scam-creators-marijuana-law-roblox\">updated its policies</a> in an attempt to make building scammy apps less appealing, but it’s falling down on actually enforcing those rules.</p><p id=\"ChK0tM\">At the same time, Apple <a href=\"https://www.theverge.com/2021/11/3/22761724/apple-craig-federighi-ios-sideloading-web-summit-2021-european-commission-digital-markets-act\">continues to argue</a> that iPhone owners should only be able to install apps from its store, so it can scrutinize the software. The company vehemently opposes legislation that would force it to allow sideloading, or installing apps from other sources, saying that the lack of an App Store monopoly would subject users to all sorts of scams and malware. (<a href=\"https://www.theverge.com/2021/9/3/22654197/apple-app-store-editorial-scams-refunds\">When we checked last year</a>, the App Review team only had 500 people, who are charged with the Herculean task of making sure that <em>every app on the store </em>follows the rules.)</p><aside id=\"USjCDI\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Eight things Apple could do to prove it actually cares about App Store users\",\"url\":\"https://www.theverge.com/2021/9/3/22654197/apple-app-store-editorial-scams-refunds\"},{\"title\":\"Gee, I wonder how Apple Podcasts suddenly became a five-star app\",\"url\":\"https://www.theverge.com/2022/2/2/22914612/apple-podcasts-app-rating-user-reviews-problem\"}]}'></div></aside><p id=\"sC8zTb\">There is a way to let Apple know about misbehaving apps. Last year, Apple <a href=\"https://www.theverge.com/2021/10/4/22705405/apple-report-a-problem-button-app-store-scams\">added a “Report a Problem” button</a> to the App Store on both iOS and macOS, which shows up near the bottom of the page after you’ve downloaded an app.</p><p id=\"5pB8h0\"><em><strong>Correction April 16th 1:14PM ET:</strong></em><em> The original version of this article incorrectly stated that the report button wasn’t available in the Mac App Store. The report button is available in macOS, but only appears after you’ve downloaded an app. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/TW4Pgf11XrHiLVglsTuXYPnZNTg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22817752/acastro_210831_1777_0001.jpg",
  "description": "More apps that try to trick you into subscriptions.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}