{
  "title": "Apple’s chips are on the table",
  "url": "https://www.theverge.com/22972996/apple-silicon-arm-double-size-mac-m1-pro-max-ultra-a15",
  "date": "2022-03-12T11:00:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H1JprOPFaVPr6fJrYEgM1Io3BTE=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70612473/2022_3_8_apple_234_10_50_37.0.jpg\" />        <figcaption><em>Apple’s dramatic introduction to the M1 Ultra.</em> | Image: Apple</figcaption>    </figure>  <p>The shape of Apple’s silicon strategy is clear</p> <p class=\"p--has-dropcap\" id=\"XoGzLR\">Apple’s transition to its own processors is nearly complete. The company’s recent spring event saw the debut of the Mac Studio and its <a href=\"https://www.theverge.com/2022/3/8/22958174/apple-silicon-m1-ultra-chip-soc-processor-cpu-gpu-update\">M1 Ultra</a> processor — its most powerful piece of silicon yet. But it also revealed what the future of Apple’s computers could look like. </p><p id=\"DjCTb5\">For the first time, all of Apple’s chips are on the table.</p><p id=\"5qwloI\">The first crucial takeaway is that Apple is now a force to be reckoned with when it comes to chips (if it wasn’t already). The incredibly positive reception for the first wave of M1 computers, along with the similar success of its <a href=\"https://www.theverge.com/22751921/apple-macbook-pro-14-16-inch-2021-m1-pro-max-review\">M1 Pro and M1 Max-powered MacBook Pro</a> laptops last year, <a href=\"https://www.theverge.com/2020/11/19/21574057/apple-m1-chips-laptop-performance-intel-qualcomm-competition\">established the company’s bona fides</a>. But the M1 Ultra saw Apple take its biggest swing yet, with what it boasts is the “world’s most powerful chip for a personal computer.” </p><p id=\"Rsymne\">These chips are already becoming selling points for computers. Buying a Mac isn’t just about getting Apple’s software or aesthetic design anymore — it’s about getting the kind of performance and battery life no one else is offering. </p><p id=\"RsQTIo\">Apple fired shots at Intel’s top-tier processor, the Core i9-12900K, claiming a 90 percent improvement from its M1 Ultra in multi-threaded performance at the same power level and the ability to match Intel’s best numbers while using 100W less power. The company <a href=\"https://www.theverge.com/2022/3/9/22968611/apple-m1-ultra-gpu-nvidia-rtx-3090-comparison\">took a similar victory lap over Nvidia’s RTX 3090 GPU</a>, which Apple claims to beat out in performance while drawing 200W less power. (Obviously, we’ll be looking to test those numbers for ourselves in the coming days and weeks). The Apple Silicon transition isn’t an experiment anymore — it’s Apple’s future and one that PC manufacturers will have to pay attention to going forward. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MxaZOm3gGLQuwesXteJvOK93Uic=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298631/lcimg_81d8f753_d066_4188_b9c0_4dc86fe9b86f.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>How many times can Apple double it?</em></figcaption>  </figure></div><p id=\"djziCZ\">Next, there’s the way that Apple is building out its chips. Right now, Apple has four different models of its Arm-based M1 chips, which blur the line between product form factors in a way that we don’t usually see from semiconductors. Apple has been taking a different approach — instead of building chips for specific devices, Apple has effectively built just one really good chip: its A-series processor. And all it’s been doing has been scaling it up, seemingly without limit. From a phone, to a laptop, to what’s allegedly the most powerful desktop, Apple’s secret sauce seems to be nothing more than <a href=\"https://www.theverge.com/2022/3/9/22969101/apple-mac-studio-m1-ultra-max-explains-weight-mystery\">doubling the size of each of its chips</a> and <a href=\"https://www.theverge.com/2020/11/10/21559228/apple-new-macbook-air-pro-difference-arm-m1-fan-thermal-performance\">throwing in more cooling</a> at each step. But it’s remarkable because no company has ever managed to do that before — and because it allows Apple to create an entire portfolio of computers <a href=\"https://www.theverge.com/2022/3/9/22968695/apple-iphone-se-price-increase-5g-tax\">from $430</a> to <a href=\"https://www.theverge.com/2022/3/8/22967608/mac-studio-top-specs-price-cpu-gpu-m1-ultra-expensive\">$8,000</a> (and counting) around a single point in its silicon architecture roadmap.  </p><p id=\"iDQIe3\">The M1 in a MacBook Air or iPad is the same chip as in Apple’s iMac and Mac Mini desktops, running at roughly the same speeds and efficiency. The M1 Max from a MacBook Pro laptop makes the jump to a desk with the Mac Studio. And even the company’s ultra-powerful M1 Ultra isn’t a purely desktop-focused design, given that it’s effectively just two M1 Max processors in a trench coat. Devices are differentiated on specific features or form factor, not necessarily just how powerful they are. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wPXjA6y9G00Ngvbdd2U88wTKSDA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22046476/vpavic_4291_20201113_0366.0.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The M1 MacBook Air turned the industry’s head when we saw what Arm was capable of.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3nktvm9VipSbg-OXh6bRe6D_G1A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22965897/akrales_211028_4820_0523.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Beefier MacBook Pros exist by throwing more cores and cooling at the same problems.</em></figcaption>  </figure></div></div></div><p id=\"SDOUGN\">It’s that scaling pattern that we’re likely to see with Apple’s upcoming Mac Pro, too, which <em>Bloomberg’s</em> Mark Gurman reports will come later this year with up to 40 CPU cores and 128 graphics cores on a chip (the equivalent of four M1 Max processors combined together, or two M1 Ultra chips). It’s yet another doubling — presumably adding in even more cooling to compensate. </p><p id=\"m2co57\">In the same vein that Apple is distinguishing the Mac Studio from the Macbook Pro with different form factors, ports, and feature sets, we’ll likely see a similar shift to help the new Mac Pro stand out from the Mac Studio. The current Mac Pro is Apple’s most powerful (and most expensive) product, and it’s one that fits a very different niche than some of its other computers — and one with no small share of missteps by the company over the years <a href=\"https://www.theverge.com/22734645/apple-macbook-pro-2021-ports-magsafe-touch-bar-usb-c-future\">as Apple misjudged</a> what power users need from their hardware. </p><p id=\"tR9ZGX\">An M1-powered Mac Pro would likely need more than just another doubling of the M1’s core count to satisfy professionals; it needs scalability, modularity, and customization. Things like PCIe cards, user-accessible memory slots, and compatibility with discrete graphics cards and external hardware accelerators — the same factors that made the recent 2019 refresh a success (and whose lack damned the 2016 <a href=\"https://www.theverge.com/tldr/2019/6/5/18652409/apple-mac-pro-design-comparison-cheese-grater-upgrade-old-vs-new-trash-can\">“trash can” model</a> almost immediately). None of Apple’s Arm-based designs have offered any of those things, and it’s still an open question whether Apple is interested in offering them on any level. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"A glowing rainbow M1 Ultra chip, surrounded by baked in memory modules\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sse_cqe3hpsleJrhBV9YAe5yzjI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307251/2022_3_8_apple_186_10_23_29.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>No RAM slots on this M1 Ultra — those black squares are baked-in memory.</em></figcaption>  </figure></div><p id=\"K3QXt6\">The sheer power of Apple’s CPU and GPU cores might mean that it can beat an RTX 3090 today; a 128-core GPU in a Mac Pro would offer an even bigger cushion for a longer amount of time. But without user-upgradable parts, Apple would be forcing a future Mac Pro buyer to anticipate all their needs from the start. We’ll have to wait for a more official announcement to see if Apple can evade the trap of leaning too heavily on non-upgradable systems again or not, though. </p><div class=\"c-float-right\"><aside id=\"LljuwK\"><q>More cores, but the same cores, for now</q></aside></div><p id=\"V7P1Af\">The increasingly hazy line between products also applies to the chips themselves — while the core counts and split between efficient and performance cores vary from model to model (and even within processor families, where Apple offers a variety of configurations), the cores themselves are the same: a Firestorm performance core on a $999 M1 MacBook Air is the almost same as on a $3,999 Mac Studio’s M1 Ultra, <a href=\"https://www.anandtech.com/show/17024/apple-m1-max-performance-review/4\">right down to the 3.23GHz clock speed</a>, although the more powerful chips do feature additional caches and DRAM bandwidth. From a technical standpoint, the M1’s Firestorm cores aren’t much different than the ones in the A14 in an iPhone 12, either, although the iPhone cores are clocked slightly slower. </p><p id=\"hl2oV8\">Intel’s latest 12th Gen processors are built using a similar scaled approach, with a mixture of performance and efficient cores from its most powerful desktop chips to its most battery-friendly models for lightweight laptops. But Intel’s chips don’t quite scale in the same way that Apple is doing here, with products still broken down more traditionally in multiple buckets for different laptop classes and desktop models. Intel’s desktop chips are (for the most part) not making the jump to laptops or tablets in the same way that Apple’s do. </p><h2 id=\"0hY2YO\">The M2 question</h2><p id=\"eFkJwo\">Lastly, there’s the future of Apple’s processors. Apple Silicon is clearly here to stay (at this time, Apple sells just a pair of Intel-based machines: a legacy Mac Mini with severely outdated hardware and the soon-to-be-replaced Mac Pro). This means that at some point — possibly as soon as this year — we’ll start to see the <em>next</em> wave of processors, be they by an “M2” moniker or another name.</p><p id=\"YJjfPt\">Whatever the next generation of Apple chips is, though, it likely won’t be the same kind of massive leap forward that the Intel to M1 switch has been. Instead, it’ll likely be a more gradual, incremental upgrade — similar to the changes from one generation of A-series iPhone processors to the next. </p><p id=\"l5yFDQ\">When it comes to upgrading processors, there are effectively two ways to go about doing it. You can use a new (or refreshed) architecture that introduces more powerful or efficient CPU or GPU cores, or you can move to a smaller manufacturing node — allowing you to pack in more transistors in a similar space or to shrink down similar hardware even further.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-j6kG87GYyufGVne2gEN66EqoVA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307263/2022_3_8_apple_177_10_17_28.jpg\">      <cite>Image; Apple</cite>      <figcaption><em>The M1 Ultra doesn’t actually use Apple’s newest cores.</em></figcaption>  </figure></div><p id=\"ZOSnDc\">We know Apple already has better silicon designs: the company’s A15 chipset features its more advanced Avalanche high-performance cores and Blizzard energy-efficient cores, which (at least on paper) are better than the Firestorm and Icestorm cores they replaced (which Apple originally <a href=\"https://www.anandtech.com/show/16086/apple-announces-new-ipad-with-a12-ipad-air-with-5nm-a14-chip\">debuted back with the A14 chip</a> in the iPhone 12 lineup). Historically, Apple tends to focus on improving its individual core designs with its A-series chips on the iPhone, but the dividends tend to be smaller from year to year. </p><p id=\"UrpGNP\">A future “M2” could follow in that vein and start to refresh Apple’s chip lineup with Avalanche and Blizzard cores, potentially offering similar gains in performance or efficiency like the iPhone 12 to iPhone 13 upgrade. At least <a href=\"https://9to5mac.com/2022/03/09/exclusive-updated-mac-mini-to-have-versions-with-m2-and-m2-pro-chip/\">one rumor from <em>9to5Mac</em></a> indicates that Apple is looking to do that for its M2 lineup, along with adding additional GPU cores to some of its chip models.  </p><p id=\"YXJHgL\">Apple could also — as several rumors already suggest — make a more modest upgrade and take the existing M1 designs and move them down to a more advanced production node. That’s something that may occur as soon as this year, <a href=\"https://www.macrumors.com/2022/03/10/m2-macs-with-tsmc-4nm-process/\">with reports</a> that Apple may ship a new MacBook Air with a largely identical chipset that’s built on TSMC’s 4nm node, instead of the 5nm node it currently uses for its M1 chips — which could let Apple increase performance and / or power efficiency. </p><aside id=\"HeLNzc\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple’s new strategy is to give — not tell — users what they want\",\"url\":\"https://www.theverge.com/2022/3/9/22968839/apple-mac-studio-display-m1-ultra-strategy-users\"},{\"title\":\"Vergecast: the specs and ports announced at Apple’s ‘Peek Performance’ event\",\"url\":\"https://www.theverge.com/2022/3/11/22972630/vergecast-apples-peek-performance-event-specs-ports\"}]}'></div></aside><p id=\"wpsHKz\">Barring some calamity with the Mac Pro, though, it’s clear that Apple has succeeded in pulling off its first generation of computer hardware with a bang. But its competitors aren’t sitting idle, either: Intel is finally shipping its own next-generation laptop chips, and AMD’s products are better than ever, too. And that’s not even counting Arm-based competition — like Qualcomm’s looming plans to bring the fight to <a href=\"https://www.theverge.com/2021/11/16/22785181/qualcomm-next-gen-cpu-pc-apple-m1-competitor-2023\">Apple with its Nuvia-designed chips in 2023</a>.</p><p class=\"c-end-para\" id=\"lcPLdf\">Apple Silicon was a fresh start for the company’s computers that catapulted them ahead of its competition. But with the transition nearly complete, Apple has to do more than just impress once — it needs to keep that momentum going for future products, too.</p><p id=\"TZowHs\"></p><p id=\"i1P3ep\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9d7ks08Zu8qmmE2zjVX0b5-6ewM=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307137/2022_3_8_apple_234_10_50_37.jpg",
  "description": "What being all in on Arm actually means",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}