{
  "title": "Apple’s DIY repair service is now available in the US",
  "url": "https://www.theverge.com/2022/4/27/23044301/apple-self-service-diy-repair-program-spare-parts-iphone-12-13",
  "date": "2022-04-27T12:07:57.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"The iPhone 13 Mini and iPhone 13\" src=\"https://cdn.vox-cdn.com/thumbor/FuoI2XRttjUwH7AJ2V6phfYyJes=/0x0:2002x1335/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70798967/vpavic_210916_4760_0240.0.jpg\" />        <figcaption><em>The iPhone 13 Mini and iPhone 13.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"KzccdM\">Apple is <a href=\"https://www.apple.com/newsroom/2022/04/apples-self-service-repair-now-available/\">launching its DIY phone repair service</a> in the US today, making spare parts available for the iPhone 12, iPhone 13, and third-generation iPhone SE. When the company announced its “Self Service Repair” initiative <a href=\"https://www.theverge.com/2021/11/17/22787144/apple-home-repair-iphone-mac-parts-tools-instructions\">last year</a>, Apple said it planned to sell over 200 “individual parts and tools” to customers. They’re only available in the US for now, but Apple plans to expand the program to other countries, as well as addition devices like Macs equipped with M1 chips, later this year. </p><p id=\"ehKa0H\">Parts are available through Apple’s <a href=\"https://www.selfservicerepair.com/home\">Self Service Repair Store</a>. Tool rental kits will also be available to rent for seven days at a cost of $49, the company said in its press release, for customers who don’t want to buy tools outright.</p><p id=\"pWCb4Q\">The program marks a significant shift for Apple, which has historically <a href=\"https://www.theverge.com/2021/11/19/22787245/apple-iphone-mac-self-service-program-repair-diy\">placed limits</a> on the availability of genuine replacement parts. While alternative, aftermarket parts are sometimes available, Apple’s devices have occasionally shown ominous <a href=\"https://www.theverge.com/2019/9/25/20884287/apple-iphone-11-pro-max-display-screen-replacement-verification-warning\">warning</a> <a href=\"https://www.theverge.com/2019/8/14/20805744/apple-iphone-battery-replacements-ios-safety-statement-unauthorized\">signs</a> if they’ve been repaired with non-genuine components. However, with the Self Service Repair initiative, anyone in the US is free to buy a replacement part direct from Apple, safe in the knowledge that it should function exactly as intended. </p><div class=\"c-float-right\"><aside id=\"UwXXiD\"><q>Google and Samsung recently made similar announcements</q></aside></div><p id=\"4Dq4LF\">Apple previously cautioned that its DIY repair program is aimed at “individual technicians with the knowledge and experience to repair electronic devices,” and that the “vast majority of customers” should still go to a professional repairer. But there’s nothing stopping confident customers from attempting repairs themselves, and Apple is offering <a href=\"http://support.apple.com/self-service-repair\">repair manuals</a> that are available to view before purchasing parts. </p><p id=\"S75ZgB\">Apple says parts will be sold to customers at the same price as its existing authorized repair providers, and that in some cases it’ll offer a credit if customers return a replaced part for recycling. For example, <a href=\"https://techcrunch.com/2022/04/27/apple-opens-self-service-repair-to-us-iphone-users/?tpcc=tcplustwitter\"><em>TechCrunch</em> notes</a> that an iPhone 12 or 13 battery costs $69, with a potential $24.15 credit for returning a replaced part. Displays for the same phones range in price from $225.96 to $309.96, with a potential $33.60 credit.</p><p id=\"zdsFGK\">The launch of Apple’s Self Service Repair program comes amidst a wave of DIY repair announcements from other smartphone manufacturers. In recent months, both <a href=\"https://www.theverge.com/2022/4/8/23016233/google-pixel-smartphones-ifixit-repair-program\">Google</a> and <a href=\"https://www.theverge.com/2022/3/31/23004309/samsung-self-repair-service-program-ifixit-right-to-repair-galaxy\">Samsung</a> have announced partnerships with repair specialists iFixit to sell spare parts for their devices, while on the computer side Valve is also working with the organization to facilitate DIY repairs of the <a href=\"https://www.theverge.com/2022/2/15/22935171/valve-steam-deck-replacement-parts-teardown-ifixit\">Steam Deck</a>. </p><p id=\"BVuYok\">These initiatives follow years of pressure from repair activists and <a href=\"https://www.theverge.com/2020/11/25/21719701/european-parliament-right-to-repair-resolution-hardware-eu-commission-2021\">regulators</a> for manufacturers to make their devices easier to repair, which it’s hoped will prevent them prematurely ending up in landfill. Apple specifically faced additional <a href=\"https://www.theverge.com/2021/11/17/22787336/apple-right-to-repair-self-service-diy-reason-microsoft\">pressure from activist shareholders</a> to re-evaluate its stance on independent repairs last year. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/27VKu8-Ksg-_56gYnQl0K3SqZhI=/0x144:2002x1192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863273/vpavic_210916_4760_0240.jpg",
  "description": "The Self Service Repair program arrives.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}