{
  "title": "Apple’s latest iMovie update adds new features to help you create videos more quickly",
  "url": "https://www.theverge.com/2022/4/12/23022253/apple-imovie-3-0-update-storyboards-templates-magic-movie",
  "date": "2022-04-12T18:02:15.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/EasV_3NJbQ5y69eoyfiJsw0Q0UI=/0x47:1960x1354/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740901/Apple_iMovie_features_storyboards.0.jpg\" />        <figcaption><em>iMovie 3.0 is available now for iPhone and iPad.</em> | Image: Apple</figcaption>    </figure>  <p id=\"E1BgXJ\">Apple’s new iMovie 3.0 update for iPhone and iPad has a major new Storyboards feature that’s designed to make it easier to create videos in the app with pre-built templates. </p><p id=\"GM28TY\">The app will offer 20 different templates covering many video types, “including cooking tutorials, Q&amp;As, product reviews, news reports, and more,” <a href=\"https://www.apple.com/newsroom/2022/04/apple-introduces-new-version-of-imovie-featuring-storyboards-and-magic-movie/\">Apple says in a press release</a>. Storyboards will have shot lists, an “illustrative thumbnail,” and suggestions on how to shoot a clip, according to the release. </p><p id=\"ikumFp\">The new update also adds a feature Apple is calling Magic Movie, which can create videos from photos or images on the fly. “To create a Magic Movie, a user simply selects an album, or any group of photos or images from their library, and Magic Movie instantly identifies the best parts of the footage and creates the project,” Apple says. Users can rearrange or delete clips if they want.</p><p id=\"ue1Rbr\">The iMovie 3.0 update is now available for devices running iOS and iPadOS 15.2 or later. Apple had teased these new features <a href=\"https://9to5mac.com/2022/03/09/imovie-update-teased-at-apple-event/\">in March</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NVwvzsTqaMTnJ1kVpUAGfB0hBXk=/0x187:1960x1213/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23384760/Apple_iMovie_features_storyboards.jpg",
  "description": "iMovie 3.0 is now available for iPhone and iPad.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}