{
  "title": "Apple, Microsoft, and Google all receive poor grades on repairability report card",
  "url": "https://www.theverge.com/2022/3/8/22949669/apple-microsoft-google-repairability-index-ranking",
  "date": "2022-03-08T16:00:00.000Z",
  "author": "Maddie Stone",
  "content": "      <figure>      <img alt=\"The new MacBook Air with the M1 chip\" src=\"https://cdn.vox-cdn.com/thumbor/M4JLuylf4AhCpG46j_WUpf5qoZI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70592886/vpavic_4291_20201113_0366.0.0.jpg\" />        <figcaption><em>Apple MacBook Air</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"VfLtqZ\">Laptops and smartphones made by Apple, Microsoft, and Google are considerably less repair-friendly than those made by competitors Asus, Dell, and Motorola, according to a new report. These findings may be unsurprising to people who like to fix gadgets, but the data to back them up comes from an unusual source: the companies themselves.</p><p id=\"ul5vEt\">The <a href=\"https://uspirg.org/feature/usp/failing-fix\">report</a>, released today by the US Public Research Interest Group’s Education Fund, draws on data companies are now releasing in France to comply with the government’s <a href=\"https://grist.org/climate/why-frances-new-repairability-index-is-a-big-deal/\">world-first “repairability index” law</a>, which went into effect last year. The law requires manufacturers of certain electronic devices, including cell phones and laptops, to score each of their products based on how easily repairable it is and make that score, along with the data that went into it, available to consumers at point-of-sale.</p><p id=\"BD8M9w\">To make that information more accessible to Americans, US PIRG, with assistance from the repair guide site iFixit, compiled French repair scores for 187 laptops and phones produced by 10 major US manufacturers. Rather than simply regurgitate the French scores in English, US PIRG, which runs a <a href=\"https://uspirg.org/feature/usp/right-repair\">right-to-repair advocacy campaign</a>, decided to augment them by penalizing companies that fight against legislation that would facilitate independent repair. The result is a hybrid score that shows how fixable companies’ products are <em>and</em> whether the company is actively opposing consumers’ right to fix them.</p><div class=\"c-float-right\"><aside id=\"n02hVt\"><q>Companies were penalized for lobbying against right to repair laws</q></aside></div><p id=\"ar5Frd\">“If a company actively lobbies, or is part of a coalition lobbying effort, to prevent access to parts, service information and repair tools, that indicates a hostile attitude toward repair choice,” report author Nathan Proctor, who leads US PIRG’s right-to-repair campaign, tells <em>The Verge.</em> “If you want to ensure your product is fixable now and into the future, you should consider the manufacturer’s approach to the repair ecosystem.” </p><p id=\"uRO9RA\"><a href=\"https://www.indicereparabilite.fr/\">France’s repairability index</a> is a score out of 10 telling consumers how fixable a product is based on five criteria: ease of disassembly, availability of repair manuals, spare parts availability, spare parts pricing, and a device-specific category. Companies assign their products points within each of those five categories based on a number of sub-criteria laid out <a href=\"https://www.ecologie.gouv.fr/indice-reparabilite#scroll-nav__6\">in a worksheet</a>. The law requires that both the overall score and the underlying worksheet be published for French consumers. (For example, all of the worksheets Apple has completed for devices sold in France <a href=\"https://support.apple.com/fr-fr/circular-economy-repairability-indices\">can be found on its French website</a>.)</p><p id=\"AClki2\">US PIRG calculated an overall repair score for each of the companies it looked at. It did so by averaging the French repairability indexes for that company’s products with the subscore for ease of disassembly, a criteria Proctor felt should be given additional weight since being able to physically take apart a device is “the most permanent and universal aspect” of its repairability. Finally, US PIRG deducted a point from the company’s overall score if it has a public record of lobbying against US right-to-repair bills, plus another quarter-point if it’s a member of either TechNet or the Consumer Technology Association, two trade associations that lobby against independent repair.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dbAITgx6wpHnFtyaEIZJRKsDlSc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19298844/akrales_191017_3723_0238.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Microsoft’s Surface devices scored only slightly higher than Apple’s</em></figcaption>  </figure><p id=\"mKJ5dG\">Out of the 10 companies US PIRG ranked, Apple received the worst grades, with the 12 fairly recent MacBook Air and Pro models averaging 3.16 out of 10 points and 20 iPhone models dating back to the iPhone 7 receiving just 2.75 out of 10 points. Microsoft fared only slightly better on laptops, averaging 4.6 points for the nine recent Surface laptops US PIRG scored, while Google also received low marks for the Pixel 4a, 6, and 6 Pro smartphones, which scored 4.64 out of 10 on average. </p><p id=\"cmKfRr\">By contrast, Dell and Asus rose to the top of the list for repairable laptops. The 36 Dell and 22 Asus laptops US PIRG scored, lists that include mostly the companies’ current models as of December and January, averaged 7.81 and 7.61 points, respectively. Motorola performed comparably on the smartphone front, receiving 7.77 out of 10 points across 18 phones. </p><p id=\"FifQ9b\">While these scores reflect both device repairability and corporate lobbying practices (for which all companies except for Acer and Motorola lost some points), consumers who are just interested in how physically fixable a companies’ products can find that information in the report as well. For some companies, the two scores mirror one another closely: Apple’s laptops, for instance, received an average disassembly rating of 3.24, while Dell cleaned up in this category, averaging 9.55 out of 10 points. A notable outlier is Microsoft. Its computers scored fairly well on ease of disassembly (7.34), but Microsoft devices lost points in its overall French repair score due to lack of access to spare parts and repair documentation. The company lost additional points in US PIRG’s scoring for its <a href=\"https://medium.com/u-s-pirg/microsoft-named-as-stopping-right-to-repair-in-washington-b880bf4ad052\">history of lobbying against repair legislation</a>.</p><p id=\"5GXWiY\">While neither Apple nor Google commented on the report specifically when asked, each sent a statement reiterating their commitment to making long-lasting, repairable products. Microsoft spokesperson Matt Garville said: “The fact that the repairability index scores are low does not mean that Surface products are not durable or reliable or cannot be repaired. We are committed to designing our products to deliver what customers need and want in a premium device and that includes increasing repairability while balancing other factors such as functionality, performance, security and safety.”</p><p id=\"5O4Tz9\">The report offers a handy, if high-level, guide for consumers looking to buy more repairable devices and align their purchasing decisions with their values. Early data from France suggests that the repair index could have a big impact: a <a href=\"https://news.samsung.com/fr/sondage-indice-reparabilite\">poll</a> commissioned last year by Samsung found that 86 percent of French consumers say their purchasing decisions likely will be impacted by these scores going forward. </p><div class=\"c-float-right\"><aside id=\"thP25S\"><q>The report is high-level, but handy</q></aside></div><p id=\"RYOwIJ\">That could sway some companies to change their practices. Perhaps taking note of its survey results, Samsung has been quietly working to boost its smartphone repair scores by releasing repair manuals in French. Beyond France, other recent campaigns have also demonstrated the power of putting a public spotlight on tech companies’ repair policies: Last year, Microsoft <a href=\"https://grist.org/accountability/bowing-to-investors-microsoft-will-make-its-devices-easier-to-fix/\">committed to making its devices more repairable</a> following a shareholder resolution. Shortly thereafter, Apple <a href=\"https://www.apple.com/newsroom/2021/11/apple-announces-self-service-repair/\">announced</a> a self-service repair program following years of pressure from independent repair advocates <a href=\"https://www.theverge.com/2021/11/17/22787336/apple-right-to-repair-self-service-diy-reason-microsoft\">and more recent pressure from shareholders</a>.</p><p id=\"axpXIV\">There’s much more these tech giants could do to foster independent repair, from <a href=\"https://www.theverge.com/2021/12/14/22832895/dell-luna-sustainable-laptop-concept-repairability-recyclable-environment\">ditching proprietary fasteners and glues</a> in the design stage to actively supporting the right to repair in Congress. Perhaps, a report that ranks companies against their peers — based on their own self-reported data — will motivate some to step up their efforts. If I were answering reporters’ questions about this report, I’d rather be Asus than Apple.</p><p id=\"YDAagf\"><em><strong>Update, 11:00AM, March 8th:</strong></em><em> Added comment from Microsoft.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uK7IBBHUs0tcKJMATsswG5lS_xo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22046476/vpavic_4291_20201113_0366.0.jpg",
  "description": "The report is based on the companies’ own data.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}