{
  "title": "Apple slows return to office plan, will let employees stay remote and require masks in common spaces",
  "url": "https://www.theverge.com/2022/5/17/23100696/apple-delay-hybrid-office-return-work-from-home-covid-19-masks",
  "date": "2022-05-17T20:08:26.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mxFw3PfJHkDQTzYpW3SPvK-395Q=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70880243/acastro_180604_1777_apple_wwdc_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"sz0tnn\">Apple is delaying moving forward on its <a href=\"https://www.theverge.com/2022/3/4/22961592/apple-april-11-return-office-corporate-pandemic-tim-cook\">hybrid return to work for office employees</a>, saying in a memo (reported earlier by <a href=\"https://www.bloomberg.com/news/articles/2022-05-17/apple-delays-plan-to-have-workers-in-office-three-days-a-week\"><em>Bloomberg</em></a>) that “we are extending the phase-in period of the pilot and maintaining two days a week in the office for the time being.” For those who are in the current two-day-per-week pilot, Apple said that if they feel uncomfortable coming into the office, they will again have the option to work remotely.</p><p id=\"AWk5in\">The company’s COVID-19 response team said that its updates are based on monitoring local info like positivity and hospitalization rates and also asked employees to go back to wearing masks when in common areas like meeting rooms, hallways, and elevators. The <em>Bloomberg</em> report added that, on Tuesday, retail employees in about 100 US stores were told they will again be required to wear a mask: </p><blockquote><p id=\"LvAkih\">Based on current conditions, we have two updates to share:</p><p id=\"LuhiLL\">First, we are temporarily asking team members to wear masks in common spaces, meeting rooms, hallways, and elevators—in general, all areas outside of your personal workspace.</p><p id=\"0pRLql\">Second, we are extending the phase-in period of the pilot and maintaining two days a week in the office for the time being. For those of you participating in the pilot, if you are uncomfortable coming into the office during this time, you have the option to work remotely. Please discuss your plans with your manager.</p><p id=\"PoGEPR\">These changes are for your location and we’ll make changes to other locations as required. We’re continuing to monitor local data closely and are committed to providing at least two weeks notice of any changes. </p></blockquote><p id=\"zFCOmu\">The letter didn’t directly respond to <a href=\"https://www.theverge.com/2022/5/3/23055406/apple-union-maryland-retail-corporate-return-to-work-letter-core-together\">requests</a> made by the Apple Together group that <a href=\"https://appletogether.org/hotnews/thoughts-on-office-bound-work\">wrote a letter protesting the hybrid plan</a>, but additional flexibility in returning to the office (however temporary) is in line with what they were asking. CEO Tim Cook originally <a href=\"https://www.theverge.com/2021/6/2/22465846/apple-employees-return-office-three-days-week-september\">announced the new hybrid model nearly a year ago,</a> but repeated spikes in COVID-19 infections delayed its start until earlier this year. Apple didn’t specifically go into the data and trends that caused this change, but the results seem worrying enough that it’s sticking with masking and additional flexibility for now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7ptLK_BDo8wD_MW1bD5ZhVFKDWo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13728969/acastro_180604_1777_apple_wwdc_0002.jpg",
  "description": "Apple is extending the ‘phase-in’ period",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}