{
  "title": "Apple says it’s using more recycled materials than ever before ",
  "url": "https://www.theverge.com/2022/4/19/23031930/apple-recycled-materials-taz-machine-earth-day",
  "date": "2022-04-19T16:51:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Apple’s newest recycling machine, Taz, designed to help conventional bulk electronics recyclers recover more precious materials. \" src=\"https://cdn.vox-cdn.com/thumbor/Y3YJ9vMRCLrgMSJJSw-XCVI3bxo=/1x0:1960x1306/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70767230/Apple_Earth_Day_2022_new_recycling_pathways_material_recovery_lab.0.jpg\" />        <figcaption>At the Material Recovery Lab in Austin, Texas, engineers and experts use a pilot-scale industrial electronics shredder for research and development. Apple’s newest recycling machine, Taz, was developed out of this process, designed to help conventional bulk electronics recyclers recover more precious materials.  | Image: Apple</figcaption>    </figure>  <p id=\"8ZTFyU\">Apple products contained almost 20 percent recycled materials in 2021, the highest percentage<strong> </strong>the company has achieved to date. Apple shared <a href=\"https://www.apple.com/newsroom/2022/04/apple-expands-the-use-of-recycled-materials-across-its-products/\">new details</a> on its recycling programs today, along with some new features it’s offering customers ahead of Earth Day on April 22nd. </p><p id=\"TgWKL5\">In a first for any Apple device, recycled gold was used in the plating of the main logic board in the iPhone 13 and iPhone13 Pro, as well as in wire in the device’s front camera and rear cameras. That “milestone,” Apple says, was the result of the company “pioneer[ing] industry-leading levels of traceability to build a gold supply chain of exclusively recycled content.” </p><div class=\"c-float-left\"><aside id=\"zPye8z\"><q>A first for any Apple device</q></aside></div><p id=\"tYPhwK\">That builds on the company’s <a href=\"https://www.theverge.com/2016/4/15/11438840/apple-recovered-nearly-40-million-in-gold-through-its-recycling\">previous efforts</a> to retrieve gold from its own discarded products. When Apple’s <a href=\"https://www.theverge.com/2018/4/19/17258180/apple-daisy-iphone-recycling-robot\">recycling robots</a> take apart one metric ton of iPhone components, according to the company, they can recover enough used gold and copper to avoid mining 2,000 metric tons of rock. There can be as much as <a href=\"https://www.theverge.com/2018/4/23/17270960/electronic-waste-urban-mining-materials-recycling\">80 times more gold</a> in a ton of cellphones than in a ton of material<strong> </strong>from a gold mine.</p><p id=\"MTxQDt\">Apple also introduced a new recycling machine today named Taz. Taz uses “shredder-like technology to separate magnets from audio modules and recover more rare earth elements,” Apple said in its announcement today. And after a makeover, Daisy, a recycling robot Apple introduced <a href=\"https://www.theverge.com/2018/4/19/17258180/apple-daisy-iphone-recycling-robot\">in 2018</a>, can now take apart 23 iPhone models, the company said today. With their help, Apple says it was able to double its use of recycled tungsten, rare earth minerals, and cobalt in fiscal year 2021.</p><p id=\"Xzgy8i\">Apple was not able to make quite as much progress on plans to reduce its carbon dioxide emissions, according to its newly released <a href=\"https://www.apple.com/environment/pdf/Apple_Environmental_Progress_Report_2022.pdf\">Environmental Progress Report</a>. The company made a <a href=\"https://www.theverge.com/2020/7/21/21332461/apple-carbon-neutral-2030-climate-change\">pledge</a> in 2020 to reduce the planet-heating emissions<strong> </strong>by 75 percent this decade. But in 2021, its <em>gross </em>emissions rose slightly. </p><div class=\"c-float-right\"><aside id=\"VqaCRs\"><q>In 2021, its gross<em> </em>emissions rose slightly</q></aside></div><p id=\"8nchby\">The company tried to cancel out that rise in pollution through projects to offset or remove CO2 from the atmosphere, keeping its <em>net</em> emissions flat last year at 22.5 million metric tons of CO2 equivalent. Most of the company’s climate pollution comes from supply chains for securing materials and making its products. So Apple has <a href=\"https://www.theverge.com/2022/4/14/23025064/apple-supply-chain-pollution-renewable-energy-climate-goals\">pushed hundreds of its suppliers</a> to make its products using clean energy.</p><p id=\"fXyXgM\">To learn more about Daisy and Apple’s environmental initiatives, consumers will be able to check out “a new immersive augmented reality experience” on Snapchat on Earth Day. And from now until April 22nd, Apple says it will donate a dollar to the environmental nonprofit World Wildlife Fund (WWF) with each purchase through Apple Pay on apple.com, in the Apple Store app, or at an Apple Store. It’s worth keeping in mind, however, that a 2019 <a href=\"https://www.buzzfeed.com/tag/world-wildlife-fund\"><em>Buzzfeed News</em></a> investigation revealed that WWF had <a href=\"https://www.buzzfeednews.com/article/tomwarren/wwf-world-wide-fund-nature-parks-torture-death\">financed</a> park rangers accused of human rights abuses. Last year, the WWF expressed “<a href=\"https://www.buzzfeednews.com/article/katiejmbaker/wwf-human-rights-abuses-independent-review\">deep and unreserved sorrow</a>” for those abuses after a 160-page review corroborated <em>Buzzfeed’s </em>reporting. </p><p id=\"ZVkmDf\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/aIcS7wYfOPki7gyb8K0JmOE7M-8=/0x140:1960x1166/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23400090/Apple_Earth_Day_2022_new_recycling_pathways_material_recovery_lab.jpg",
  "description": "But it didn’t reduce greenhouse gas emissions last year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}