{
  "title": "Apple Stores drop mask requirements for customers in several states",
  "url": "https://www.theverge.com/2022/2/22/22946560/apple-store-mask-mandate-customers-employees",
  "date": "2022-02-23T00:01:26.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Apple Store Employees At Some Locations Begin To Organize Unionization Efforts\" src=\"https://cdn.vox-cdn.com/thumbor/lEanHYZkG5FqWY-xN0KX1h4LW_0=/0x0:5976x3984/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70538882/1371393373.0.jpg\" />        <figcaption><em>Apple store employees will still have to wear masks, however.</em> | Photo by Brandon Bell/Getty Images</figcaption>    </figure>  <p id=\"3mwDSc\">Apple will no longer require customers to wear masks in a number of Apple stores across the US, including in Ohio, Kansas, Kentucky, North Carolina, Georgia, and other states that have recently dropped local mask mandates, according to a report by <a href=\"https://www.bloomberg.com/news/articles/2022-02-22/apple-stores-drop-mask-mandates-plan-return-of-in-store-classes\"><em>Bloomberg</em></a>. Employees at Apple stores will still be required to wear masks regardless of vaccination status, however.</p><div class=\"c-float-right\"><aside id=\"nbr5GA\"><q>Apple is also resuming in-store classes</q></aside></div><p id=\"jNhdT6\"><em>Bloomberg</em> says Apple has since updated its website to indicate which stores require masks. When searching for a store using <a href=\"https://www.apple.com/retail/\">Apple’s retail store locator</a>, the site will tell you if masks are “required,” “recommended,” or “optional” for vaccinated customers at specific locations. Masks are still required in states with more rigid guidelines, like Hawaii, Oregon, and Washington. In some locations, such as New York and Connecticut, face masks are only optional for fully-vaccinated customers.</p><p id=\"wwZ135\">In addition to lifting mask requirements, <em>Bloomberg</em> says Apple is also resuming its in-store classes, called <a href=\"https://www.apple.com/today/\">Today at Apple</a>. Classes are available at select locations and include courses on making music with Garageband, editing and shooting photos on an iPhone, and making videos with iMovie. As noted by <em>Bloomberg</em>, some classes will resume this week, while others will start again in March.</p><p id=\"nhrfi9\">Since the start of the COVID-19 pandemic, Apple has continued to change its mask policy in line with local guidance. Adjustments have tended to roll out relatively quickly at Apple — in November, <a href=\"https://www.theverge.com/2021/11/4/22763958/apple-mask-requirements-retail-store-customers-coronavirus\">the company started phasing out mask requirements</a> at retail locations and then <a href=\"https://www.theverge.com/2021/12/14/22834419/apple-retail-store-mask-requirement-december-2021-omicron-covid\">reinstated them again in December</a> as COVID-19 cases started rising.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EpSAk-on70XsM2RcE2k_7XMTr54=/0x370:5976x3499/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23264314/1371393373.jpg",
  "description": "In-store classes will also resume.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}