{
  "title": "Apple’s M2 chips and the computers they’ll power detailed in new leak",
  "url": "https://www.theverge.com/2022/4/14/23026073/apple-m2-silicon-macbook-air-pro-mac-mini-rumors",
  "date": "2022-04-15T00:40:20.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Am48h76JI0k0kdFb4X4ngP11ZNI=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70751206/2022_3_8_apple_177_10_17_28.0.jpg\" />        <figcaption><em>This is Apple’s M1 Ultra, which could be getting an upgrade.</em> | Image: Apple</figcaption>    </figure>  <p id=\"usjVIx\">Apple is reportedly working on nine new Macs featuring its upcoming M2 processors, <a href=\"https://www.bloomberg.com/news/articles/2022-04-14/apple-readies-several-new-macs-with-next-generation-m2-chips\">according to <em>Bloomberg</em>’s Mark Gurman</a>. These rumors come hot on the heels of Apple <a href=\"https://www.theverge.com/22981815/apple-mac-studio-m1-ultra-max-review\">releasing the Mac Studio</a>, and its announcement that the <a href=\"https://www.theverge.com/2022/3/8/22958174/apple-silicon-m1-ultra-chip-soc-processor-cpu-gpu-update\">the M1 Ultra</a> would be the last chip in its current-gen lineup. </p><p id=\"ehMrvC\"><em>Bloomberg</em> isn’t predicting a replacement for the Studio yet, but it reports that most other Mac models will be getting an upgrade. Gurman says he’s seen evidence of an M2-powered MacBook Air with a 10-core GPU — contrary to <a href=\"https://www.theverge.com/2022/3/9/22968489/m2-macbook-air-redesign-m1-ming-chi-kuo\">previous predictions</a> that a redesigned Air would still have an M1 — as well as an entry-level M2 MacBook Pro with the same specs. The 14 and 16-inch MacBook Pros also make an appearance, along with a new Mac Mini and Mac Pro, all rocking next-gen Apple silicon. </p><p id=\"ZyPWyH\">A Mac Mini with the current-gen M1 Pro also cropped up, though it’s hard to imagine that making it to market now that the Mac Studio exists.</p><p id=\"Zf6Txq\">The higher-end machines will reportedly have M2 Pro and M2 Max chips, with the Max having 12 CPU cores and 38 graphics cores (two CPU and six GPU cores extra compared to the <a href=\"https://www.theverge.com/2021/10/18/22726444/apple-m1-pro-max-chip-processor-arm-macbook-fastest\">current M1 Max</a>). <em>Bloomberg</em> doesn’t include details on the breakdown of efficiency and performance cores. The M2 Pro also shows up as an option for the Mac Mini, and Gurman predicts that the Mac Pro will have a “successor to the M1 Ultra.”</p><aside id=\"NAIvbh\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple’s chips are on the table\",\"url\":\"https://www.theverge.com/22972996/apple-silicon-arm-double-size-mac-m1-pro-max-ultra-a15\"}]}'></div></aside><p id=\"kh3hwZ\">(By the way, if you’re trying to figure how this adds up to nine computers like I initially did, it’s one MacBook Air, one entry-level Pro, two models of the Mini, two models each of the 14 and 16-inch MBP — with Pro and Max chips respectively — and the desktop Pro.)</p><p id=\"xcqPEP\">It’s intriguing that the entry-level MacBook Pro may stick around, and still be <a href=\"https://www.theverge.com/2020/11/10/21559228/apple-new-macbook-air-pro-difference-arm-m1-fan-thermal-performance\">barely differentiated</a> from the Air. Whenever I discuss laptops with my colleagues, they usually predict that Apple will quietly discontinue the 13-inch model, given that it seems like an unhappy medium between the Air and the 14-inch Pro. It’s also a bit of an outlier with its Touch Bar, but it’s an open question whether the successor will have one — the <em>Bloomberg</em> report doesn’t say.</p><p id=\"1CZbM3\">Notably absent from the list of computers is any sort of iMac. There’s no mention of a successor to the <a href=\"https://www.theverge.com/22440059/apple-imac-m1-2021-24-review\">M1-powered 24-inch all-in-one</a>, or a replacement for the <a href=\"https://www.theverge.com/2022/3/8/22967616/apple-27-inch-imac-studio-desktop\">recently discontinued 27-inch iMac</a>.</p><p id=\"8Ntz4R\">Gurman says this wealth of information comes from developer logs, which presumably showed up because Apple was testing its new computers using third-party apps. While it wasn’t hard to predict that Apple would be working on the next generation of chips, it’s exciting to see evidence of their existence out in the wild, and to get early details. </p><p id=\"syOiKy\">It may not be that long of a wait before an official announcement of at least a few of these computers — <em>Bloomberg</em> reports that “at least two Macs” could launch “around the middle of the year.” And wouldn't you know it, WWDC <a href=\"https://www.theverge.com/2022/4/5/22984508/apple-wwdc-2022-event-date-software-updates-ios-ipados-macos\">is on the calendar</a> for June 6th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/B2-cMk47oI_KPX4ez2VJDVaEEJM=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307263/2022_3_8_apple_177_10_17_28.jpg",
  "description": "New chips for the Air, Pros, and Mini.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}