{
  "title": "Apple releases fix for Studio Display webcam in latest macOS beta",
  "url": "https://www.theverge.com/2022/4/26/23042940/apple-studio-display-webcam-beta-fix-release-image-quality",
  "date": "2022-04-26T17:27:06.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TeRdd_kD9K-qIl3v_a-7I6Hggnc=/0x0:2880x1920/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70795629/apple_studio_display_1.0.jpg\" />        <figcaption><em>The Studio Display’s camera quality was a mess upon release.</em> | Photo by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"rvhiRD\">When we <a href=\"https://www.theverge.com/22981744/apple-studio-display-5k-monitor-webcam-speakers-review\">reviewed Apple’s $1,599 Studio Display</a> one thing immediately jumped out: its built-in webcam is bad. At the time, Apple told us that an update to improve the camera would be forthcoming, and now it appears to be here. Apple spokesperson Jennie Orphanopoulos tells <em>The Verge</em> that “an update to the Studio Display firmware is now available with today’s beta release of macOS Monterey 12.4. This beta update has refinements to the Studio Display camera tuning, including improved noise reduction, contrast, and framing.”</p><p id=\"s39NfR\">Developers are able to install the Monterey 12.4 beta now; everyone else will be able to install it from Apple’s <a href=\"https://beta.apple.com/sp/betaprogram\">public beta program</a> later today.</p><p id=\"t4gRLw\">Will the improvements to the camera be enough to make your average Zoom call look better than... this? We’ll be testing it soon, so check back for more.</p>  <figure class=\"e-image\">        <img alt=\"Apple Studio Display webcam screenshot\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/02OHK3TVwsb6CKrde5oP-vOoqow=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23322249/Screen_Shot_2022_03_16_at_6.53.30_PM.png\">      <figcaption><em>A sample of the Studio Display’s image quality pre-update.</em></figcaption>  </figure><p id=\"J8QrmP\">The Studio Display’s image quality was strangely inexcusable given the price of the display — and inexplicable for a camera setup that was basically the same as an iPhone 11, with a 12-megapixel sensor, f/2.4 lens, and A13 chip. It’s also a bummer that you have to be running a beta version of macOS to fix the camera, which isn’t something most people would want to do on their work machines. But perhaps it’s understandable that Apple would want to test these changes in a variety of conditions before a rollout to the general public.</p><p id=\"KYymp9\">Once you’ve installed the developer or public beta, you can <a href=\"https://support.apple.com/en-us/HT213110\">update your display</a> by going to System Preferences &gt; Software Update. Once Studio Display Firmware Version 15.5 (Build 19F5062g) is installed, you should see the results of Apple’s tweaks.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DH2io0_sh0rOwNExYg-vEW8FvA8=/0x206:2880x1714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23321838/apple_studio_display_1.jpg",
  "description": "Apple is trying to fix the webcam on its $1,599 monitor.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}