{
  "title": "Apple’s third-party payment proposal isn’t enough for Dutch regulators",
  "url": "https://www.theverge.com/2022/5/2/23053935/apple-app-store-acm-proposal-rejected-further-fines-dating-apps",
  "date": "2022-05-03T12:23:06.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Y5xQPundCcXL4Hxcv1Zvzw6_kIc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70824260/acastro_190218_1777_apple_streaming_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"BL3aYO\">The Netherlands Authority for Consumers and Markets (or ACM) has rejected Apple’s <a href=\"https://www.theverge.com/2022/3/30/23003571/apple-app-store-netherlands-acm-alternate-payment-systems-binaries-ios\">proposed App Store changes</a> that would let dating app developers use third-party payment systems, <a href=\"https://9to5mac.com/2022/05/02/dutch-watchdog-considers-apple-actions-insufficient-on-app-store-payment-system-policies-on-dating-apps/\">according to <em>9to5Mac</em></a> and the <a href=\"https://appfairness.org/coalition-for-app-fairness-statement-on-dutch-acm-developments/\">Coalition for App Fairness</a>. The Dutch regulator <a href=\"https://www.theverge.com/2021/12/24/22852966/apple-netherlands-dating-apps-match-tinder-app-store-competition\">ordered the change</a> in December and has been going back and forth with the company over how it should be implemented — and charging Apple millions in fines along the way. Now, Apple could face further penalties.</p><p id=\"di7JPT\">According to <a href=\"https://twitter.com/nandokasteleijn/status/1521099897088487424\">a journalist’s tweet</a> translated by <em>9to5Mac </em>(and now available in full, below, in English), the regulator says Apple’s most recent proposal for letting developers use third-party payment systems is an “improvement” over its previous ideas, but it’s still “not sufficient to comply with European and Dutch regulations.” Apple did not immediately reply to <em>The Verge</em>’s request for comment.</p><div class=\"c-float-right\"><aside id=\"xWM0yU\"><q>Advocates worry Apple’s proposals would make using third-party payments difficult or unappealing</q></aside></div><p id=\"EgHjHq\">Apple’s latest proposal, which it <a href=\"https://www.theverge.com/2022/3/28/22999998/apple-bigger-fine-proposal-dutch-regulator-acm-netherlands-dating-apps\">submitted on March 27th</a>, said that dating app devs could use <em>either</em> a third-party payment system or Apple’s, not both, and that developers would have to warn users they were about to interact with a system that Apple didn’t control. The same is true if the developer sends users to its site to complete a purchase. </p><p id=\"doNliP\">Apple also said that developers using alternative payment systems would still owe the company a 27 percent commission on in-app sales, compared to the 30 percent it takes from most in-app payments using its own system. (If the developers made less than $1 million in revenue a year, that’d be highly unfavorable compared to <a href=\"https://www.theverge.com/2020/11/18/21572302/apple-app-store-small-business-program-commission-cut-15-percent-reduction\">Apple’s Small Business Program rate of 15 percent</a>.)</p><p id=\"FMabEy\">Apple had previously proposed that dating app developers — the only people affected by the ACM’s order — should have to submit separate versions of their apps for the Netherlands. Its plan in March dropped that requirement after the regulator <a href=\"https://www.theverge.com/2022/2/14/22917514/apple-netherlands-dating-apps-external-payment-processors-in-app-commission-acm\">rejected the previous proposal</a> for being “unreasonable.”</p><p id=\"9rqtQt\">In late March, the ACM said it was <a href=\"https://www.theverge.com/2022/3/28/22999998/apple-bigger-fine-proposal-dutch-regulator-acm-netherlands-dating-apps\">evaluating Apple’s proposal</a> after fining the company approximately $55 million. The regulator said it “may impose another order subject to periodic penalty payments (with possibly higher penalties this time around)” if it found that Apple’s proposal wasn’t sufficient. It had been evaluating penalties on a weekly basis, <a href=\"https://www.theverge.com/2022/2/14/22917514/apple-netherlands-dating-apps-external-payment-processors-in-app-commission-acm\">charging the company €5 million</a> (around $5.6 million) each week it didn’t comply — up to a maximum of €50 million (around $55 million at the time). Now that the cap has been reached, the regulator is reportedly working on additional penalties, saying that the originals “did not have the desired result.”</p><p id=\"ccHHuZ\">The Coalition for App Fairness has applauded the ACM’s decision. The advocacy group is made up of companies like Epic Games, Spotify, Basecamp, and Match Group (which makes dating apps such as Tinder, Match.com, and OkCupid) who are opposed to the App Store’s high fees and role as the singular place to get software for iPhones and iPads. In a <a href=\"https://appfairness.org/coalition-for-app-fairness-statement-on-dutch-acm-developments/\">statement released on Monday</a>, the group said that it “stands ready to support the ACM as it continues to seek fair treatment and remedies for developers,” even as Apple “continues to dig in its heels to protect its monopoly power at all costs.” </p><p id=\"Ln5Cty\">The coalition also said that Apple’s rejected proposal “imposed unnecessary requirements creating friction with the aim to discourage dating app developers from taking advantage of the ACM order.”</p><blockquote><p id=\"m7KC1u\">The Netherlands Authority for Consumers and Markets (ACM) has come to the conclusion that the changes that Apple on March 30 made to its conditions for dating apps in the Netherlands are insufficient. Apple still uses unfair conditions for dating-app providers in the Netherlands. This has been revealed by an ACM investigation, expert opinions, and a consultation among market participants</p><p id=\"iyjNZq\">ACM does see improvements in the proposals that Apple has put forward, but these still fall short of meeting European and Dutch rules. In the meantime, ACM continues to hold discussions with Apple about these issues.</p><p id=\"T9F4hd\">As the previous order subject to periodic penalty payments failed to deliver the desired outcome, ACM is currently preparing a new order subject to periodic penalty payments.</p><p id=\"4o0kpX\">Once we have published this new order subject to periodic penalty payments, we can comment on the contents thereof as well as on the points on which Apple is still in non-compliance. That may take several weeks.</p></blockquote><p id=\"D2Odqg\"><em><strong>Update May 3rd 8:22AM ET: </strong></em><em>Updated to add ACM’s full statement.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lr-Wbv-EBu_NaOZh887Elj_ZUgQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13959810/acastro_190218_1777_apple_streaming_0002.jpg",
  "description": "Apple already faces 50 million euros in fines.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}