{
  "title": "Apple’s latest watchOS update includes a recovery mode, of sorts",
  "url": "https://www.theverge.com/2022/3/15/22978387/apple-watch-8-5-update-recovery-mode-iphone-restore",
  "date": "2022-03-15T17:11:57.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"The Apple Watch Series 7 in green.\" src=\"https://cdn.vox-cdn.com/thumbor/xgK6-V6zvkvOY2HLgov6F-SZNdM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70625987/vpavic_211006_4796_0029.0.jpg\" />        <figcaption><em>Fixing a bricked Apple Watch used to require a mail-in repair.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"x3jWyh\">Apple’s latest watchOS update, 8.5, now has a recovery mode that can help you restore your Apple Watch if it gets stuck on the dreaded red exclamation point screen (<a href=\"https://9to5mac.com/2022/03/14/apple-watch-firmware-can-now-be-restored-from-an-iphone-running-ios-15-4/\">via <em>9to5Mac</em></a>). The update is laid out in a <a href=\"https://support.apple.com/en-us/HT204776\">support article</a> that was updated on Monday — while <a href=\"https://web.archive.org/web/20220218125351/https://support.apple.com/en-us/HT204776\">the previous version of the article</a> just recommended trying to reboot the watch, then setting up a mail-in repair with Apple support, it now describes the process of recovering your Watch at home.</p><p id=\"TmyAbh\">Apple’s article says that you’ll need an iPhone <a href=\"https://www.theverge.com/2022/3/14/22976606/ios-15-4-mask-compatible-face-id-emoji-tap-to-pay-airtags-stalking-update-release-date-features\">running iOS 15.4</a> to go through the steps. If your Watch is showing an animation of a phone and a watch being brought together, or a red exclamation point, the process to fix it is relatively simple:</p><ul><li id=\"OHg19M\">Put your Watch on its charger</li><li id=\"jebNC1\">Unlock your phone and bring it close</li><li id=\"m0Z1Me\">Double-press the Watch’s side button, next to the crown </li></ul><p id=\"h3gEce\">A prompt should then pop up on your phone, saying that it detected an Apple Watch in recovery mode, initiating steps you can follow to restore the Watch. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DH1X1iefzSYKtthAqnRIBjRFUrk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23316503/ios15_iphone13_pro_watchos8_series7_recover_apple_watch.png\">      <cite>Image: Apple</cite>      <figcaption><em>A screenshot showing a Watch in recovery mode, and the prompt that’ll appear on the phone.</em></figcaption>  </figure><p id=\"va6VSy\">There could be a bit of pickiness around what kind of Wi-Fi network your phone is connected to during the process, so if the recovery doesn’t work, you may want to read the fine print on the article.</p><p id=\"Pynxnn\">A colleague asked whether this new feature would make it less risky to run beta software on your Watch. The answer to that question appears to depend on what kind of risk you’re talking about. If you’re worried about your Watch being bricked by unfinished software (a <a href=\"https://developer.apple.com/forums/thread/50461\">few</a> beta testers <a href=\"https://developer.apple.com/forums/thread/50982\">have reported</a> seeing a red exclamation point before, leading to a chat with Apple support), it does seem like this feature could make a home remedy possible. </p><p id=\"jmRBvI\">It is probably still best to leave Watch betas to the brave though — some reports of bricking describe <a href=\"https://developer.apple.com/forums/thread/81275\">an infinitely spinning loading screen</a>, which this process may not be able to fix. There’s also not much reassurance for those worried about getting stuck with an unusably buggy watch. Apple’s <a href=\"https://beta.apple.com/sp/betaprogram/faq\">beta software FAQ</a> still says the “Apple Watch cannot be restored to previously-released OS versions once the public beta is installed,” implying that this recovery feature won’t help you go back to a public version of watchOS. </p><p id=\"DJjsDK\">Apple didn’t respond to a question from <em>The Verge</em> asking if there would be some way to use this feature to roll back from a buggy beta.</p><p id=\"jxBG6H\">Whether or not this update changes the beta calculus, it’s definitely a win that users will have the ability to solve firmware issues at home instead of having to send their Watches in for service. To update to watchOS 8.5, you can <a href=\"https://support.apple.com/en-us/HT204641\">follow Apple’s instructions here</a>. If you have a Series 3, do keep in mind that the process <a href=\"https://support.apple.com/en-us/HT211283\">may be more complicated</a> due to its limited storage space.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ky0xgYCS8-b7aX9fYCvcvGHGjMU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22908899/vpavic_211006_4796_0029.jpg",
  "description": "A potential fix for the red exclamation point.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}