{
  "title": "Apple’s Peek Performance event: rumors, news, and announcements ",
  "url": "https://www.theverge.com/2022/3/7/22961404/apple-event-peek-performance-iphone-se-ipad-air-announcements-news-products",
  "date": "2022-03-07T21:35:26.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8xOhpGGVNrTIeFez-doiQaz2Mp4=/53x0:1145x728/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70591012/Screen_Shot_2022_03_02_at_12.03.10_PM.0.jpg\" />    </figure>  <p>The event is scheduled for 1PM ET / 10AM PT on March 8th</p> <p id=\"RnreWY\">If the seasons are starting to change, it must be time for another Apple event. Of course, it isn’t the fall when a new generation of iPhones comes bearing down on us, but there may be some surprises in store.</p><p id=\"FB5taI\">Apple recently <a href=\"https://www.theverge.com/2022/3/2/22949618/apple-iphone-se-ipad-air-face-id-mask-spring-event-peek-performance\">sent out invites for its “Peek Performance” event</a>, scheduled for Tuesday, March 8th at 1PM ET / 10AM PT. While internet sleuths have tried to discern any hidden meanings baked into the invite graphic or the use of the word “peek,” it’s most certain that one of the announcements for this event will be <a href=\"https://www.theverge.com/2022/2/4/22918318/iphone-se-ipad-air-5g-apple-rumor-march-8-universal-control\">an iterative update of the budget-friendly iPhone SE</a>, now with 5G compatibility. On the iPad front, we may see an updated iPad Air to replace the model that debuted in 2020 with a refreshed design — also now with 5G in tow.</p><p id=\"2XZRy6\">Beyond that, things get a little murkier. There have been rumors of a new, <a href=\"https://www.theverge.com/2021/8/23/22637477/new-mac-mini-design-ports-m1x-release-date-gurman\">higher-end Mac Mini for a little while now</a>. While the existing M1 Mac Mini is still a formidable little machine, nobody is going to say no to more power. But will it get the upgrade to the existing M1 Pro CPU that came in the 14-inch and 16-inch MacBook Pros, or <a href=\"https://www.theverge.com/2022/2/20/22943411/apple-m2-chip-new-macs-rumor\">is it already time for the debut of an M2 processor</a>?</p><p id=\"BvtV1l\">That’s just hardware, though. There’s bound to be some software showcase of new features and probably a little chest-thumping about privacy.</p><p id=\"9DW0Lq\">Whatever gets announced, you can count on <em>The Verge</em> to be watching, live blogging, and covering all the news right here as new products and features are unveiled.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kUFotaUNqgUPkj5Fb1qb1lMMUAM=/0x51:1198x678/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23283097/Screen_Shot_2022_03_02_at_12.03.10_PM.jpg",
  "description": "All the news and announcements from the March 8th event",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}