{
  "title": "Apple helps you download fewer podcasts",
  "url": "https://www.theverge.com/2022/5/17/23093633/apple-podcast-download-spotify-upfronts-siriusxm-wondery-amazon",
  "date": "2022-05-17T15:05:00.000Z",
  "author": "Ariel Shapiro",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TAJwUb7-kRxh3I-RKjadBSikcZU=/0x0:2051x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70878655/Hot_Pod_Site_Post.0.jpg\" />    </figure>  <p id=\"2g3XAR\">Confession: I have stopped automatic downloads on Apple Podcasts because I am reckless with my data and have absolutely let podcast downloads eat my phone on more than one occasion. I love having back episodes of <em>Stuff You Missed in History Class</em> for the subway as much as the next guy, but I also need to be able to save and send my husband <em>I Think You Should Leave</em> GIFs at will (♫ it’s the <a href=\"https://www.youtube.com/watch?v=po9-NWhk1Qo\">little things you do together</a> ♫). Anyway, point being, Apple’s new update that lets users limit downloads to five episodes at a time feels like it was tailor-made for me.</p><p id=\"Ug7q4E\">Also on tap today, Spotify experiments with NFTs, highlights from the Podcast Upfronts, and how the podcast outgrew its namesake.</p><p id=\"csRsvO\"><strong>Apple is making it easier to distribute subscription podcasts, manage podcast storage</strong></p><p id=\"4jW0Zy\">Creators who are part of the Apple Podcasters Program <a href=\"https://www.theverge.com/2022/5/16/23076810/apple-update-subscription-podcasts-spotify-acast-libsyn\">will no longer have to take the extra step</a> of uploading podcasts through the Apple Podcast Connect dashboard – as long as they use a designated distribution platform. The initial group of partner hosts include Acast, Libsyn, Buzzsprout, Omny Studio, RSS.com, Blubrry, and ART19. Podcasters who create subscription podcasts on any of those platforms will be able to publish shows on Apple directly from their host’s dashboard using a new feature known as “Delegated Delivery.” The feature is <a href=\"https://podcasters.apple.com/3513-news-introducing-delegated-delivery\">supposed to launch “this fall.”</a></p><p id=\"Ocsq6X\">Among the hosting platforms not in that initial group is Spotify’s Anchor, though Apple Podcast spokesperson Zach Kahn said it could become a partner host if the company chose to do so. Spotify did not respond to a request for comment on whether it would. Spotify already has its own designated partner hosts that have streamlined publishing for subscription shows through <a href=\"https://newsroom.spotify.com/2021-07-27/here-are-the-first-publishers-and-platforms-getting-connected-with-spotifys-open-access-feature/\">its Open Access program</a>, including Supercast, Glow.fm (which is owned by Libsyn), and Apple partner Acast. (Note: Vox Media is also a partner in Spotify’s Open Access program).</p><p id=\"HOCMkc\">Apple Podcast users will also have a new tool at their disposal with a new software update for iPhones, iPads, and Macs that’s already out. Listeners can now specify how many podcast episodes they want to keep downloaded in the app for offline listening, with options like “five latest episodes” or those published in the “last 14 days.” Older episodes that weren’t manually downloaded will be automatically removed. The new downloads configuration should make a big difference for heavy podcast listeners (me in particular!!) who can quickly rack up downloads that eat their device’s storage.</p><p id=\"dC2Rcz\"><strong>Spotify tests musician NFT galleries, even as crypto market cools</strong></p><p id=\"jubDzO\">Celebrity nonfungible tokens, or NFTs, have seen better days, but Spotify is implementing a test that allows artists like Steve Aoki and The Wombats to show off their own. The new feature, which is available to some US-based Android users, was <a href=\"https://musically.com/2022/05/13/spotify-artists-promote-nfts/\">first reported by <em>Music Ally</em></a>.</p><p id=\"unQsxs\">The experimental update allows participating artists to display their NFT galleries prominently on their Spotify pages right below their song lists. But Spotify hasn’t said if the feature will go wide. “We routinely conduct a number of tests in an effort to improve artist and fan experiences,” the company told <em>Music Ally</em>. “Some of those tests end up paving the way for a broader experience and others serve only as an important learning.”</p><p id=\"J4V7xi\">It may seem like a weird time to be promoting NFTs, just as the <a href=\"https://www.theverge.com/2022/5/12/23069232/terra-luna-collapse-stablecoins-crypto-crash-bitcoin\">crypto market is tanking</a> and the number of <a href=\"https://www.wsj.com/articles/nft-sales-are-flatlining-11651552616\">NFT transactions plummet</a>. But Aoki <a href=\"https://www.theverge.com/22999333/decoder-steve-aoki-crypto-web3-aokiverse-metaverse-music-industry-business-nft\">spoke with <em>Verge</em> editor-in-chief Nilay Patel</a> in March about how NFTs can be a lifeline for musicians at the mercy of streaming’s low per-stream payouts. He said the NFT business “provides an income stream and a conversation in a way that never happened before.”</p><p id=\"svG9kF\">If you don’t have an Android and want to see what Aoki’s <em>whales</em> NFT looks like, check out <a href=\"https://www.theverge.com/2022/5/16/23074909/spotify-experiments-musician-nft-galleries\">my colleague Emma Roth’s piece</a>.  </p><p id=\"7R21UF\"><strong>Podcast Upfronts highlights</strong></p><p id=\"GcAXbo\">While lacking in <a href=\"https://variety.com/2022/tv/news/nbcuniversal-upfront-nbc-1235268107/\">Pete Davidson appearances</a>, the Interactive Advertising Bureau’s Podcast Upfront last week hosted a number of podcasting’s biggest players, who trotted out their best programming and stats for advertisers. As the IAB made lofty projections <a href=\"https://www.theverge.com/2022/5/10/23065056/podcasting-industry-iab-report-audacy-earnings-patreon-pulitzer\">of a $4 billion podcast industry by 2024</a>, studios and publishers pitched why they deserve a slice of that growing pie. Here are some of the highlights:</p><ul><li id=\"EO2npB\">SiriusXM conducted <a href=\"https://podcastreport2022.sxmmedia.com/\">its own study</a> of who podcasting’s newest listeners are and what they want. Recent podcast listeners are younger and more diverse in terms of race and gender than longtime podcast listeners. They also prioritize true crime and celebrity talk shows more than traditional listeners, who flock to news and sports. Comedy is still the number one genre for both.</li><li id=\"vydvYB\">Wondery, which is owned by Amazon, announced <a href=\"https://hotpodnews.com/insider-may-5-2022-cumulus-doesnt-take-the-deal/\">a slew of new ad rep and distribution deals</a>. The company already has distribution deals with chart-toppers like <em>My Favorite Murder</em> and <em>SmartLess</em>,<em> </em>in which new episodes are released a week early exclusively on Amazon Music and Wondery Plus. The new deals have Wondery reaching for the next tier of shows, including <em>Men in Blazers</em>, <em>Something Was Wrong</em>, four shows from the Ten Percent Happier network, and two podcasts from the Shut Up and Give Me Murder network. All have a one-week exclusive window, except for <em>Men in Blazers</em>, which will not have the window, and <em>Twenty Percent Happier</em>, which will be fully exclusive. </li><li id=\"zlo08h\">Companies announced programming updates, including Sony Music, which is debuting <em>Bedtime Stories with Adam McKay</em>, in which the writer and director improvises soothing stories; Slate, which is increasing the frequency of shows <em>What Next: TBD</em>, <em>Mom and Dad Are Fighting</em>, and <em>Working</em> from once a week to twice a week; and iHeartMedia, which will launch a new LGBTQ+ vertical of shows this summer in the mold of the Black Effect Podcast Network and My Cultura.</li></ul><p id=\"HzI3py\">While there was nothing terribly groundbreaking, the direction of programming seemed to correspond with the core of SXM’s findings. Podcast audiences are younger and more diverse than they were only a few years ago, and the greater focus on multicultural and entertainment content reflects that. Also, the true crime train isn’t slowing down any time soon. It’s not my thing, but the people have spoken.</p><p id=\"14tbac\"><strong>Companies are upping podcast ad spend – by a lot</strong></p><p id=\"x8DKB7\">The biggest spenders have remained largely the same, but podcast advertising budgets are increasing at a clip. Virtual mental health services company BetterHelp is once again the number one advertiser in podcasts, and it’s not even close. According to Magellan AI’s report on first-quarter ad spend, BetterHelp spent more than $21 million in podcast ads between January and March this year, more than double what it spent during the same period last year. </p><p id=\"U8h0AR\">That budget is nearly three times what runner-up HelloFresh spent in the first quarter, and It’s not like HelloFresh was skimping. With $7.7 million in podcast ad spend, the direct-to-consumer meal kit company nearly doubled its budget year-over-year. ExpressVPN and Progressive (ranked number four and five, respectively) also massively increased ad spend since last year.</p><p id=\"XnIv7B\">The findings underscore <a href=\"https://www.iab.com/insights/u-s-podcast-advertising-revenue-report-fy-2021-results-2022-2024-growth-projections/\">the IAB’s study</a> about how the podcast industry will grow. While an increase in shows and listeners play a part, the willingness of companies to spend more will be key to making podcasting a $2 billion industry this year and a $4 billion industry by 2024. You can download Magellan’s Q1 Benchmark Report <a href=\"https://www.magellan.ai/resources/reports/q1-22-podcast-advertising-benchmark-report\">here</a>. </p><p id=\"Tkb2Sz\"><strong>The iPod is dead, but the podcast lives on</strong></p><p id=\"jzDOmf\">This is a bit of a rerun for Insiders, but I am going to shamelessly plug <a href=\"https://www.theverge.com/2022/5/15/23071515/ipod-dead-podcast-legacy-apple-spotify\">my piece from this weekend</a> on how the iPod played a fleeting, but crucial, role in the development of the podcast. And wouldn’t you know it, two people claim to have independently combined “iPod” and “broadcast” to name the medium we all know and love and spiral over today. Plus, Leo Laporte’s ill-fated battle to <a href=\"https://www.engadget.com/2006-10-07-leo-laporte-wants-to-rebrand-podcasts-as-netcasts-i-agree.html\">rename it “netcast”</a> (as in “internet broadcast”). My sincerest sympathies to Leo, it didn’t catch.</p><p id=\"ht0uLn\">See you next week, readers! For Insiders, I will be back Thursday with the latest pod goss.</p><aside id=\"AUIZLM\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/2r78uvNnItvm50MexjwOBcE6Neo=/0x147:2051x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23434856/Hot_Pod_Site_Post.jpg",
  "description": "Apple Podcast users can now control how many episodes stay downloaded to their iPhones.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}