{
  "title": "Apple reports best March quarter ever with new records for iPhone and Mac",
  "url": "https://www.theverge.com/2022/4/28/23046890/apple-q2-2022-earnings-iphone-mac",
  "date": "2022-04-28T20:47:04.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"The iPhone 13 Pro (left) and Pro Max (right)\" src=\"https://cdn.vox-cdn.com/thumbor/wy3GKbUSs7KkPO09B4PpB8Hiouk=/0x0:2031x1354/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70806786/vpavic_210916_untitled_0058.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"UJThau\">Even as it deals with continued supply constraints and consumers wary of inflation, Apple today <a href=\"https://www.apple.com/newsroom/2022/04/apple-reports-second-quarter-results/\">reported the best March quarter</a> in its history. The company tallied $97.3 billion in revenue in Q2, up 9 percent over the year-ago quarter. That amounted to a profit of $25 billion, with earnings per share of $1.52. </p><p id=\"VglEPB\">Apple set March quarter revenue records for its iPhone, Mac, and Wearables / Home / Accessories divisions. Apple’s various services <a href=\"https://twitter.com/PatrickMcGee_/status/1519776460042502144\">grew to a new high of 825 million subscribers</a>. And the Mac continues to surge. “The last seven Mac quarters have now been the top seven quarters ever in the history of the Mac,” Apple CEO <a href=\"https://www.cnbc.com/2022/04/28/apple-aapl-earnings-q2-2022.html\">Tim Cook told CNBC</a>. But the second quarter saw a slowdown in iPad sales, which were down slightly year over year. Cook attributed this to “very significant supply constraints.”</p><p id=\"F2wP3g\">The increase in iPhone revenue comes even after Apple noted that the year-ago Q2 saw very strong iPhone demand due to the iPhone 12 series launching a bit later in the fall than normal. New products released by Apple during the March quarter included the <a href=\"https://www.theverge.com/22975531/apple-iphone-se-2022-review-price-specs-screen-battery\">third-gen iPhone SE</a>, green colors of the iPhone 13 and iPhone 13 Pro, the powerful <a href=\"https://www.theverge.com/22981815/apple-mac-studio-m1-ultra-max-review\">Mac Studio</a> desktop, and the 5K <a href=\"https://www.theverge.com/22981744/apple-studio-display-5k-monitor-webcam-speakers-review\">Studio Display</a> external monitor. </p><p id=\"Km0P94\">In January, the company said it anticipated that supply chain challenges would let up somewhat during the March quarter. But with China carrying out strict lockdowns to limit the spread of COVID-19, supply chain issues might become a bigger problem over the next few months. </p><p id=\"EpPywQ\">Apple’s Mac lineup is currently experiencing the brunt of shipping delays. New orders of the recently launched Mac Studio with the M1 Ultra chip now have an estimated delivery date of late July. Many 14- and 16-inch MacBook Pro configurations will see customers waiting until June or later to receive orders placed today. </p><p id=\"56oI9t\">Apple will preview the next major updates to iOS, iPadOS, macOS, watchOS, and tvOS at its <a href=\"https://www.theverge.com/2022/4/5/22984508/apple-wwdc-2022-event-date-software-updates-ios-ipados-macos\">Worldwide Developers Conference (WWDC) in June</a>. Except for a small group of guests that will be invited to Apple’s campus, the conference will be largely virtual — as has been the case for the previous two years.</p><p id=\"QZ6Bt6\">Beyond new products and software, Apple is continuing to face challenges to its comprehensive control over the App Store and iPhone software ecosystem. EU legislation <a href=\"https://www.theverge.com/2022/3/25/22996248/apple-sideloading-apps-store-third-party-eu-dma-requirement\">could force the company to permit sideloading</a> and third-party software stores. It has also begrudgingly agreed to <a href=\"https://www.theverge.com/2022/3/30/23003571/apple-app-store-netherlands-acm-alternate-payment-systems-binaries-ios\">allow third-party payment methods</a> in some countries for very select categories, like dating apps.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ohK1eB408v24ibkHmz7lCxscLvQ=/0x146:2031x1209/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863288/vpavic_210916_untitled_0058.jpg",
  "description": "But iPad sales were down slightly compared to a year ago.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}