{
  "title": "Aqua’s ‘Barbie Girl’ won’t be in the Barbie movie",
  "url": "https://www.theverge.com/2022/4/29/23048807/barbie-girl-movie-mattel-aqua",
  "date": "2022-04-29T19:11:37.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Margot Robbie as Barbie in her dreamcar.\" src=\"https://cdn.vox-cdn.com/thumbor/S-dM4qjkOSD09aUkQwdjIytpeOo=/0x352:1796x1549/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70811769/rev_1_Barbie_InstaVert_High_Res_JPEG.0.jpeg\" />        <figcaption>Warner Bros.</figcaption>    </figure>  <p id=\"nXpNBb\">While Warner Bros.’ and <a href=\"https://www.theverge.com/2022/4/25/23041621/hot-wheels-live-action-movie-mattel-jj-abrams-bad-robot\">Mattel Films</a>’ upcoming <a href=\"https://www.theverge.com/2014/4/23/5644064/barbie-will-become-a-brand-conscious-mary-poppins-in-live-action-movie\"><em>Barbie </em>movie</a> is sure to have some level of self-awareness about its main character’s status as a real-world cultural icon, Mattel is taking a firm stance against featuring the iconic doll’s very unofficial anthem that basically everyone knows by heart.</p><p id=\"rZEQj7\">The small tease of Greta Gerwig’s <em>Barbie </em>movie that Warner Bros. shared this week — a still image of Margot Robbie all dolled up and driving a dream car — singlehandedly put the project at the back front of people’s minds as something they might actually want to see. Partially because of the bright, colorful, “fun” vibes the image gave off, a number of fans began speculating what sorts of music <em>Barbie </em>might feature, and Aqua’s 1997 Hit “Barbie Girl” almost immediately began bubbling up in conversations. Though you could easily imagine <em>Barbie </em>having a bit of a laugh at itself by acknowledging Aqua’s song, <a href=\"https://variety.com/2022/film/news/barbie-girl-movie-aqua-1235254222/\"><em>Variety</em> reports</a> that people hoping to hear “Barbie Girl” on the soundtrack will be sorely disappointed.</p><p id=\"A8zWXp\">Speaking matter-of-factly about “Barbie Girl,” Ulrich Møller-Jørgensen, manager to Aqua’s lead singer Lene Nystrøm, said “the song will not be used in the movie.” Møller-Jørgensen did not expand on why “Barbie Girl” won't be in <em>Barbie</em>, but as <em>Variety</em> notes, it could have something to do with the 1997 lawsuit Mattel filed against the band for trademark violation. Along with its claims of copyright infringement, Mattel also argued that the sexual implications of Aqua’s song damaged the Barbie brand and the company’s marketing plans. Ultimately, <a href=\"https://apnews.com/article/950f17eade79e72becc58f7374850640\">Mattel’s initial suit was dismissed by a lower court</a>, and its later <a href=\"https://www.billboard.com/music/music-news/supreme-court-rejects-mattels-barbie-song-appeal-72533/\">appeal to the Supreme Court was rejected</a>. It seems safe to say that the toy manufacturer’s feelings about the song have yet to change.</p><p id=\"ksWTkc\"><em><strong>Correction April 30th, 7:40 AM:</strong></em><em> An earlier version of this post incorrectly stated that Ulrich Møller-Jørgensen, rather than Lene Nystrøm is Aqua’s lead singer.</em></p><p id=\"OsALjd\"><em>Barbie </em>is slated to hit theaters on July 21st, 2023.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VoUf-1qpSrwPzFv72xYdF9QfnyY=/0x458:1796x1398/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23426192/rev_1_Barbie_InstaVert_High_Res_JPEG.jpeg",
  "description": "Sorry, Aqua fans. \"Barbie Girl\" isn’t in the Barbie movie.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}