{
  "title": "Army Corps of Engineers closes SpaceX Starbase permit application citing lack of information",
  "url": "https://www.theverge.com/2022/4/6/23013435/spacex-starbase-starship-army-corps-engineers-permit-application",
  "date": "2022-04-06T22:01:48.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"US-SPACE-SPACEX-STARSHIP\" src=\"https://cdn.vox-cdn.com/thumbor/nP5spaheRb67BjV5gw1q5ex0scU=/6x0:6042x4024/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70719008/1238379839.0.jpg\" />        <figcaption><em>A prototype of SpaceX’s Starship rocket on the launchpad at Starbase in Texas</em> | Photo by JIM WATSON/AFP via Getty Images</figcaption>    </figure>  <p id=\"rMA6Ep\">The US Army Corps of Engineers has closed a permit application for a proposed expansion of SpaceX’s Starbase facility in Boca Chica, Texas — a potential snag in the company’s plans to add new launch and landing pads to the area, as well as substantially grow the site. In a letter viewed by <em>The Verge</em>, the Corps cited SpaceX’s failure to provide requested follow-up information about the proposed changes as a reason for closing the permit.<strong> </strong>Among other things, the Corps wanted more details about what mitigation measures the company would take to limit the loss of water and wetlands surrounding the site.</p><p id=\"XDlD2S\"><a href=\"https://www.theatlantic.com/science/archive/2020/02/space-x-texas-village-boca-chica/606382/\">SpaceX first purchased land in Boca Chica, Texas, in 2012</a>, with the intention of creating a facility to launch its Falcon 9 and Falcon Heavy rockets. But the company has substantially expanded its plans in recent years, creating a massive new site called Starbase to build and test launch prototypes of its next-generation rocket called Starship — designed to eventually take people and cargo to deep space.</p><div class=\"c-float-right\"><aside id=\"WrYqlo\"><q>SpaceX proposed to modify its existing permit for an expansion</q></aside></div><p id=\"DOYip5\">As SpaceX continues to grow its infrastructure in Boca Chica, the company periodically amends an existing permit it holds with the Army Corps of Engineers, which ensures that the construction plans don’t violate the Clean Water Act and the Rivers and Harbors Act. In December 2020, <a href=\"https://arstechnica.com/science/2021/03/spacex-reveals-the-grand-extent-of-its-starport-plans-in-south-texas/\">SpaceX proposed to modify its existing permit</a> for an expansion that would include “the addition of test, orbital, and landing pads, integration towers, associated infrastructure, stormwater management features and vehicle parking,” <a href=\"https://www.swg.usace.army.mil/Portals/26/docs/regulatory/PN%20APRIL/PN2_201200381.pdf?ver=mYDsA57a8HMJK0MxAGcVxg%3d%3d\">according to a public notice</a> about the changes posted by the Corps in March. <a href=\"https://www.swg.usace.army.mil/Portals/26/docs/regulatory/PN%20March/Plans_201200381.pdf?ver=FRFoaMtv2EGSZh833C4pRA%3d%3d\">SpaceX also included a crude map showing its plans</a>, which entailed building two orbital launchpads, two suborbital launchpads, a new landing pad, and other major infrastructure changes. </p><p id=\"N1SW21\">Such changes would require SpaceX to backfill material into existing flats and wetlands. The public notice claimed that SpaceX’s proposed changes would affect “10.94 acres of mud flats, 5.94 acres of estuarine wetlands, and 0.28 acres of nontidal wetlands.” The Corps also said that SpaceX was working on “a comprehensive, multifaceted mitigation strategy” for the launch site, as well as taking certain avoidance measures to minimize impacts to water areas, such as putting its proposed parking lot in an “upland area to avoid wetland impacts.” Members of the public were asked to provide comments about the proposed changes during a comment period that ended on April 20th, 2021. Various activist groups, <a href=\"https://addup.sierraclub.org/campaigns/save-texas-wetlands-from-spacex\">such as the Sierra Club</a> and <a href=\"https://www.facebook.com/saveRGVfromLNG/posts/4253698294642904\">the local nonprofit Save RGV</a>, urged the public to petition the Corps to deny the permit modification.</p>  <figure class=\"e-image\">        <img alt=\"US-SPACE-SPACEX-STARSHIP\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mkpOnc1EPdgt3_gumZJIRuQGsqI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372599/1238357742.jpg\">      <cite>Photo by JIM WATSON/AFP via Getty Images</cite>  </figure><p id=\"jBkqxz\">Once the comment period ended, the Corps sent a letter to SpaceX on May 21st, 2021, outlining the comments, which included responses from the EPA, the US Fish and Wildlife Service, the Corps itself, and Texas environmental protection organizations. SpaceX was asked to address the comments, as well as submit various documents such as a mitigation plan for avoiding impacts to wetlands and offsetting the loss of aquatic resources, a plan for alternative construction that would provide the same purpose but provide lesser impacts to the area, and more.</p><p id=\"wArSkv\">While SpaceX did provide its response to comments and an analysis about alternative infrastructure in October, the company did not provide its mitigation plan and other required responses, according to a letter sent by the Corps to SpaceX on March 7th. The Corps determined that SpaceX’s plan for alternatives “lacked sufficient detail.” Part of the problem also revolved around SpaceX’s required No Action Alternative. Essentially, SpaceX must provide an alternative plan to the Corps for its proposed activity, one that would accomplish the same goals that the company hopes to achieve but without impacting any wetlands.</p><p id=\"ERtSed\">The letter cited confusion over SpaceX’s No Action Alternative, given conflicting statements the company has made in public and in response to the Corps. Specifically, in its October analysis about alternatives, SpaceX eliminated the possibility of launching Starship out of Cape Canaveral, Florida — the company’s primary launch site for flying the Falcon 9, according to the Corps. But in February, <a href=\"https://www.theverge.com/2022/2/11/22927706/elon-musk-spacex-starship-update-boca-chica-texas\">SpaceX CEO Elon Musk mentioned during a public broadcast</a> that the company <em>would</em> move to Cape Canaveral to launch Starship if SpaceX did not receive certain regulatory approval. The Corps noted that moving to Cape Canaveral seemingly works as a No Action Alternative. If SpaceX was serious about that possibility, that would require a much more rigorous analysis, according to the Corps.</p><p id=\"sBq6Sy\">As a result of this incomplete information and confusion, the Corps told SpaceX in the new letter that its permit application has been withdrawn. But while SpaceX’s permit is closed for now, it seems like it can easily be reopened again.</p><p id=\"pe43UX\">“As of 7 Mar 2022, the SWG Regulatory Office has ‘closed’ the application process because Space Exploration Technologies has not provided the requested information as outlined in the letter,” Lynda Yezzi, chief of public affairs for the Army Corps of Engineers Galveston District (SWG), wrote in an email to <em>The Verge</em>. “Without the requested information, the permit process cannot continue. Once the requested information is received, SWG will reinitiate the permit application process.” Yezzi clarified that SpaceX’s existing permit, approved in September 2014, “is still in compliance with all applicable laws and regulations and remains in effect.”</p><p id=\"yfb301\">It’s unclear exactly why SpaceX failed to provide the necessary information or if the company is planning on sending what the Corps requested. SpaceX did not respond to a request for comment in time for publication.</p><p id=\"0z8BS7\">While SpaceX must undergo a federal review with the Corps, it’s also in the midst of <a href=\"https://www.theverge.com/2021/10/21/22738106/spacex-boca-chica-starship-launch-site-faa-town-hall-environmental-assessment\">a lengthy environmental review with the Federal Aviation Administration</a>, which is determining whether to provide the company with a license to launch Starship to orbit from Boca Chica. In September, the <a href=\"https://www.faa.gov/space/stakeholder_engagement/spacex_starship/media/Draft_PEA_for_SpaceX_Starship_Super_Heavy_at_Boca_Chica.pdf\">FAA released a draft programmatic environmental assessment</a> detailing the ways in which SpaceX’s expanded plans for Starbase would impact the area. (In those plans, SpaceX does not list the possibility of launching out of Cape Canaveral as a No Action Alternative.) The FAA has consistently delayed its decision on how to proceed with Starbase as the agency consults with various other government entities about the project. The latest deadline for a decision is now at the end of April. </p><p id=\"GoFMWZ\">In the meantime, <a href=\"https://www.cnbc.com/2021/12/03/elon-musk-spacex-starts-construction-of-starship-launchpad-in-florida.html\">SpaceX has begun ramping up construction of Starship launch infrastructure</a> in Cape Canaveral. The movement is seen as a possible sign that SpaceX will eventually move operations of the vehicle to Florida if the FAA decision does not go SpaceX’s way.</p><p id=\"n0kBK2\">Read the Corps’ letter to SpaceX below:</p><div id=\"lM0L3R\"><iframe src=\"https://embed.documentcloud.org/documents/21579769-usace-withdraw-letter-1030722/?embed=1&amp;responsive=1&amp;title=1\" title=\"USACE withdraw letter (1)030722 (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div><p id=\"W7wi10\"></p><p id=\"E8GFR3\"></p><p id=\"UmJE1G\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4z6cquenJPjBhNzLHXiF5NfM6-I=/0x429:6048x3595/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23372481/1238379839.jpg",
  "description": "It’s not a dead end for SpaceX though",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}