{
  "title": "Artist Jeff Koons aims to send sculptures to the Moon on commercial lunar lander",
  "url": "https://www.theverge.com/2022/3/29/23000351/jeff-koons-artist-sculptures-intuitive-machines-moon-lander",
  "date": "2022-03-29T12:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hcwm8X_c0tLyS_iR4E8-1817fX0=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70684137/Nova_C_IM_1_Moonscape_2_With_Logo.0.png\" />        <figcaption><em>An artistic rendering of the Intuitive Machines lander on the Moon</em></figcaption>    </figure>  <p id=\"CQd6Tg\">Later this year, American artist Jeff Koons will be displaying some of his latest sculptures in their most exotic location yet: the surface of the Moon. Thanks to a new collaboration, Koons will create some new sculptures that will travel to the lunar surface <a href=\"https://nssdc.gsfc.nasa.gov/nmc/spacecraft/display.action?id=IM-1-NOVA\">on a robotic lunar lander made by Houston-based company Intuitive Machines</a>.  </p><p id=\"fkjnB9\">Intuitive Machines’ lander is called Nova-C, which the company has been developing in partnership with NASA. For the last few years, NASA has been actively working toward sending humans back to the Moon through its Artemis program. And as part of that effort, NASA has been working with commercial companies to develop a whole fleet of vehicles — from smaller robotic landers and rovers to landers capable of carrying humans — that can touchdown on the Moon’s surface.</p><p id=\"dluUjF\">In 2019, <a href=\"https://www.theverge.com/2019/5/31/18647357/nasa-clps-moon-robotic-lunar-landers-artemis-astrobotic-orbit-beyond-intuitive-machines\">NASA awarded three private companies with contracts</a> to develop robotic lunar landers that can demonstrate ways to land on the Moon. Intuitive Machines’ Nova-C was one of the winners, and the company has been working toward the lander’s launch ever since. The tall, cylindrical Nova-C spacecraft will carry five scientific payloads for NASA and some commercial payloads, all mounted on the exterior of the spacecraft except for one designed to reside inside the lander’s propulsion tanks.</p><div class=\"c-float-right\"><aside id=\"xTOGKP\"><q>the Koons sculptures will be encased in a transparent, thermally coated cube</q></aside></div><p id=\"8RYXiX\">Koons is best known for his popular sculptures of balloon animals created out of stainless steel.<strong> </strong>Now, some of his new sculptures will join the payloads on the outside of Nova-C. Specifically, the Koons sculptures will be encased in a transparent, thermally-coated cube that measures 6 inches on all sides, according to Intuitive Machines. The tiny sculptures will supposedly be the first “authorized” works of art to reach the lunar surface, according to Pace Gallery, which represents Koons — though that title will only work if Intuitive Machines can get to the Moon relatively soon. Competing space company Astrobotic, also partnered with NASA, is set to send a piece of artwork to the Moon on its lander <a href=\"https://en.vogue.me/culture/first-artwork-on-moon-surface-nasa-clps-dubai-based-artist-sacha-jafri/\">by Dubai-based artist Sacha Jafri</a>. Astrobotic also intends to launch its lander later this year on the United Launch Alliance’s new Vulcan rocket.</p>  <figure class=\"e-image\">        <img alt=\"“Shine” Jeff Koons Art Exhibition in Florence\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vfaXmeWEHVomiQjuy-5Hzg-m0zQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23352424/1362430256.jpg\">      <cite>Photo by Stefano Guidi/Getty Images</cite>      <figcaption><em>Jeff Koons artwork on display in Florence, Italy</em></figcaption>  </figure><p id=\"4cl8dd\">If Intuitive Machines manages to successfully land Nova-C on the Moon, the sculptures will remain inside the box on the lander’s exterior “in perpetuity.” However, people on Earth should still be able to get a look of the art on the lunar surface. Intuitive Machines plans to include a camera on the top of its lander that should be able to capture the art in its new home. Representatives for Pace Gallery declined to provide any details about what the art will look like, how big it will be, or what materials it would be made from. “Details about the artwork will be announced in the coming weeks,” Adriana Elgarresta, director of public relations for Pace, tells <em>The Verge</em>.</p><p id=\"bym6wc\">Originally, Intuitive Machines planned to launch its lander by 2020. The company holds a contract with SpaceX to launch Nova-C on a Falcon 9 rocket from Cape Canaveral, Florida. Now the launch is planned for later sometime this year, according to Intuitive Machines. The company is aiming to land Nova-C in an area of the Moon called Oceanus Procellarum, the largest of the Moon’s mare — dark plains of basalt that dot the lunar terrain.</p><p id=\"2P6APa\">The sculptures are riding along with the mission as part of Koons’ first NFT collection. <a href=\"https://www.jeffkoonsmoonphases.com/\">Called Moon Phases</a>, “the project will explore the imagination and technological innovation of the human race,” according to a press release. “Reveling in past and future human achievements, the artist has drawn inspiration from the Moon as a symbol of curiosity and determination.” Each NFT from the Moon Phases will have a corresponding sculpture, a group of which will be sent to the actual Moon.</p><aside id=\"knQyls\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Elon Musk made history launching a car into space. Did he make art too?\",\"url\":\"https://www.theverge.com/2018/2/10/16997124/elon-musk-spacex-tesla-art-starman-advertising\"},{\"title\":\"Which artists should SpaceX send to the Moon?\",\"url\":\"https://www.theverge.com/2018/9/18/17872822/yusaku-maezawa-spacex-dear-moon-artists-roundtable-culture\"},{\"title\":\"Rocket Lab’s disco ball satellite plunged back to Earth — and some aren’t sad to see it go\",\"url\":\"https://www.theverge.com/2018/3/22/17144208/rocket-lab-humanity-star-satellite-new-zealand-astronomy\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/JuGXXBp9i5dl1AJ8uHSuy2fRaDo=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23352408/Nova_C_IM_1_Moonscape_2_With_Logo.png",
  "description": "It’s unclear what the sculptures will actually look like",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}