{
  "title": "Artists are playing takedown whack-a-mole to fight counterfeit merch",
  "url": "https://www.theverge.com/22924353/artists-counterfeit-merch-facebook-amazon-etsy-dmca",
  "date": "2022-02-11T13:00:00.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wGD-UxfQK1nOFSsJ6oQ_zH4EcHs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70497012/VRG_ILLO_5000_ClaudiaCAkole_AmazonFacebookKnockoffs.0.jpg\" />        <figcaption>Illustration by Claudia Chinyere Akole</figcaption>    </figure>  <p>‘There are all sorts of obstacles that are thrown up in front of artists’</p> <p class=\"p--has-dropcap p-large-text\" id=\"I3GgLM\">Matt Buchholz’s artwork is usually a hit during the holidays. Under the name Alternate Histories, he creates surreal landscapes of sci-fi staples — think Godzilla or flying saucers — appearing around major cities, which he prints on giftable items like postcards and calendars. But this year, Buchholz found himself with unexpected competitors: counterfeiters ripping off his designs and offering them for sale via Facebook ads. </p><p id=\"egfqaZ\">“Someone sent me a screenshot and was like, ‘Hey, I just saw this ad on Facebook for your calendar’,” he said in an interview with<em> The Verge</em>. The ad had his 2022 calendar and even some of his marketing copy, but the shop wasn’t his. “It had tons of other products that a reverse image search on Google showed were stolen.”</p><p id=\"N4UeYV\">Buchholz is one of the many small sellers overwhelmed with a flood of knockoff and counterfeit versions of their work appearing for sale online. Major platforms allow these fakes to quickly find an audience — he estimates dozens of his work on Facebook alone. And while there are ways to get them taken down, it’s time-consuming to chase down every fake to get it removed, and demoralizing to see ripoffs continue to proliferate across the internet. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8JFO3yjndJD4gb5C8mZSSV9Fot0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232223/IMG_9319.jpg\">      <cite>Photo: Matt Buchholz</cite>      <figcaption><em>Buchholz’s official Alternate Histories calendar.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lSSdl79iYVFi-fqwZNZHOqGmt2E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232253/Screen_Shot_2021_12_01_at_12.58.27_PM.png\">      <cite>Image: Matt Buchholz</cite>      <figcaption><em>A fake listed on Amazon.</em></figcaption>  </figure></div></div></div><p id=\"6c02Tr\">“I’m not sleeping well; I wake up to another person tagging me in a post with a new thing like, ‘Oh look, now they’re selling my Christmas card’,” Buchholz said. “It’s been really draining. I’ve really had to kind of push myself to keep going through it.”</p><p id=\"Mh5UD6\">To spread their fake goods on platforms like Facebook and Amazon, counterfeiters take advantage of a legal provision that protects those companies from user-generated copyright infringement. Under the Digital Millennium Copyright Act (DMCA), enacted by Congress in 1998, these companies have to cooperate with copyright owners to “expeditiously” remove infringing content posted to their platforms. But there’s often a gap of time between when a listing goes up and when the platform catches the infringement and takes it down. And that gap is often long enough to make the effort worth it for counterfeiters. </p><div class=\"c-float-right c-float-hang\"><aside id=\"i2vywv\"><q>“They know they can sell bootleg content for like seven days without consequences”</q></aside></div><p id=\"tCI7Re\">“It’s been a little like whack-a-mole,” says Aaron Reynolds, the artist behind Effin’ Birds, a comic series of swearing birds. Merchandising sites can be particularly bad, he said, willing to print anything a user uploads. “Some of the platforms are really scuzzy and they use the protections of the DMCA. They know they can sell bootleg content for like seven days without consequences, as long as they take down the image when a platform orders them to.”</p><p id=\"uJaxGW\">Buchholz says that of the sites where he lists his work for sale, he’s found Etsy to be the most difficult to get infringement problems resolved on. “They use an automated form for complaints, and only allow 255 characters to describe your problem, and there’s no way to appeal their decision,” he said.</p><p id=\"Joxw0U\">Corinne Pavlovic, vice president of trust and safety at Etsy, said in a statement that the platform is committed to protecting creative works. “We comply with applicable intellectual property laws by assessing all reports, removing items when we receive proper notices of infringement and terminating sellers who receive repeat notices of infringement,” Pavlovic told <em>The Verge</em>.</p><p id=\"Xr2EEk\">Even people who should be experts in copyright matters can struggle to contend with takedown policies. One semester, Sandra Aistars, director of the Arts and Entertainment Advocacy Clinic at George Mason University, had law students do takedown notices for artists and nonprofits and tracked their interactions. Ideally, websites would take down infringing content as soon as they’ve ascertained it’s fraudulent — but proving something is counterfeit can be a daunting process.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rlwoLohFWV43pm5-tHsNRb6V0FU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232287/Amazon_Canada_Effin__Birds_search.jpg\">      <cite>Image: Aaron Reynolds</cite>      <figcaption><em>Fake Effin’ Birds calendars (bottom center) listed alongside genuine ones.</em></figcaption>  </figure></div><p id=\"MQyGgh\">“The students had all these interactions that are not supposed to happen under the DMCA, with the site operators,” Aistars said in an interview with <em>The Verge</em>. “The site operators would come back at them with, ‘Well, are you really entitled to take this work down? Prove that you are the owner or the agent,’ or whatever, after they’ve presented an affidavit under penalty of perjury to do this.”</p><p id=\"qbkSsR\">The exercise made it easy to understand why an artist or creator without legal training would be intimidated out of sending their own takedown notices — she says even law students were rattled by the pushback. “There are all sorts of obstacles that are thrown up in front of artists who are trying to use the minimal tools afforded to them under the act.”</p><p id=\"Tnn2Z3\">It’s hard to get a handle on just how much money and content is siphoned away from artists by scam artists online. <a href=\"https://www.wsj.com/articles/facebook-stolen-content-copyright-infringement-facebook-files-11636493887?mod=article_inline\"><em>The Wall Street Journal</em></a> reported in November that a 2018 internal Facebook analysis found 40 percent of its pages traffic went to pages that stole or recycled most of their content. And that’s just Facebook.</p><div class=\"c-float-left c-float-hang\"><aside id=\"TK12B1\"><q>Buyers receive poor-quality knockoffs... then complain to the original artist</q></aside></div><p id=\"S8GNSR\">Beyond the lost revenue, Buchholz says he’s worried about damage to his reputation as well. During a recent sweep of Amazon for fakes in late January, he found yet another egregious example of a counterfeit of his work, along with several one-star reviews from angry and disappointed customers. They thought they were buying the authentic Alternate Histories calendars, rather than the knockoffs. One reviewer called the calendar “terrible quality. The printed photos look nothing like the picture advertised and the words are spelled wrong in the text descriptions. The pictures of the creatures are just blobs on a vague, blurred background.” The reviewer encouraged others not to buy the calendars. </p><p id=\"YqyopV\">People who buy the knockoff calendars often contact Buchholz to complain about the quality, and there’s nothing he can do for them, much to his consternation. “I can’t help but think about how this is irreparably harming my brand,” he said. </p><p id=\"g2b1SZ\">Reynolds has also found that bootleg copies of his work often sell at higher prices; a recent fake of one of his T-shirt designs was selling for $30, when he normally sells it for $19. He offers a <a href=\"https://twitter.com/EffinBirds/status/1488257429649375232\">discount code</a> for people who buy direct from him: FUCKBOOTLEGGERS.</p><p id=\"VdDa88\">The bigger problem is not the one-off fakes, but the broken system that allows counterfeited works to proliferate with ease on the internet, says University of Akron School of Law professor Mark Schultz. The DMCA, he says, was made for a different era</p><p id=\"4zuG8c\">“One of the big problems with our copyright infrastructure on the internet is it was really designed around what was happening in the mid- to late ’90s, before Napster,” Schultz said in an interview with <em>The Verge. </em>In the olden days of the 1990s, it took a long time to download a file, and the internet was more like a new social network with a small audience, he says.</p><p id=\"jolRr7\">“The reality at the time was that content didn’t spread fast. So infringement was more like an infection people hoped to quarantine.” But now, Schultz adds, infringement is an endemic problem. “It’s a condition we need to learn to alleviate and reduce, but we’re never going to get rid of it.”</p><p id=\"0sD5gb\">Facebook spokesperson Jen Ridings said the platform has a “robust” takedown program and has invested in “proactive” detection features to support creators’ IP rights. “These measures aren’t perfect, and we know that those who try to abuse our platform will continue to change tactics in their determination to violate the rights of others, which is why we also rely on rights holders to report content they believe infringes their IP rights,” she said.</p><p id=\"HEiha3\">Amazon didn’t reply to questions from <em>The Verge</em> about how it handles counterfeited products on its platform.</p><div class=\"c-wide-block\"><div class=\"c-image-grid__wrapper\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eKJgtdysmG6KQ3XjCi_D6OT-dLk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232453/2.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SkQ3wqVizVuNBfnKvgWd5NERqTM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232456/4.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/n3Eywk-1QAYw5PO8ZxzPkjZJdsE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232455/3.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PxejaxcDVg7n2zgw_gZhPx7GiPg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232454/1.jpg\">  </figure></div></div><p class=\"caption\"><em>Unofficial Alternate Histories calendars advertised on Facebook.</em> Images: Matt Buchholz</p></div></div><p id=\"kLSohF\">Schultz says he’s testified before Congress twice on copyright issues, once in 2014 before the House and again in 2020 before the Senate. He said he and his colleagues marveled at how little had changed between the two hearings. But, he added, there’s been a greater understanding in recent years of the power imbalance between big tech and the rest of society. “DMCA reform is very tough,” he said.</p><p id=\"bGtjtv\">Aistars said she’s encouraged by a <a href=\"https://www.tillis.senate.gov/2020/12/tillis-releases-landmark-discussion-draft-to-reform-the-digital-millennium-copyright-act\">discussion draft</a> that Sen. Thom Tillis (R-NC) introduced in late 2020, seeking to reform the DMCA. “The copyright act is already terribly unwieldy, and you can’t legislate as quickly as people can innovate,” she said. “The things that have held up over time are when you take a technology-neutral approach, and enact provisions based on higher principles, and find ways to get parties to collaborate.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"Zt1bXH\"><q>“The tech is there to police these things”</q></aside></div><p id=\"qJ5Q1A\">That’s why Schultz favors a notice and stay-down requirement, meaning once a site has been notified that a work is copyrighted, it has to remove all instances of the work — not just individual files, but all present and future versions. He acknowledges such a system would work better for large entities than for indie creators or smaller platforms. And the Electronic Frontier Foundation <a href=\"https://www.eff.org/deeplinks/2016/01/notice-and-stay-down-really-filter-everything\">has argued</a> that this approach would be more like a “filter-everything” system, and would be too costly for smaller platforms to enforce. But Schultz notes that the European Union made notice and stay-down rules part of its copyright directive, and exempted smaller startups to prevent the rule from being too onerous.</p><p id=\"7GtCVe\">For his part, Buchholz says he thinks there are a few simple things platforms can do to reduce the amount of counterfeiting they are unintentionally supporting, like offering systems to verify sellers as genuine. And Aistars says platforms should make the tools they already offer to more powerful entities like the NFL, which can get pirated football game footage taken down quickly from major sites, more readily available to other creators.</p><p class=\"c-end-para\" id=\"Jdv3HP\">“The tech is there to police these things,” Buchholz said. “It’s just a matter of making it available to anyone who posts work on the internet. But I don’t know if they ever will.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Z5yBpPqBzHjNMUPDUvFpIpFMbm8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23212827/VRG_ILLO_5000_ClaudiaCAkole_AmazonFacebookKnockoffs.jpg",
  "description": "One artist offers a discount code on genuine merch: \"FUCKBOOTLEGGERS\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}