{
  "title": "As Nvidia hacker deadline looms, 71,000 employee accounts have reportedly been exposed",
  "url": "https://www.theverge.com/2022/3/4/22962217/nvidia-hack-lapsus-have-i-been-pwned-email-breach-password",
  "date": "2022-03-04T22:50:56.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7ToUbHnuUKr7lH6I04UE-LugIek=/0x1:2000x1334/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70581321/NVIDIA_Endeavor_building_logo.0.jpg\" />    </figure>  <p id=\"rVDs39\">Nvidia never denied that it got hacked. The GPU giant just didn’t say all that much about what happened, either.</p><p id=\"sXVdKi\">But now — as we wait to see whether the hackers make good <a href=\"https://www.theverge.com/2022/3/1/22957212/nvidia-confirms-hack-proprietary-information-lapsus\">on their threat to dump hundreds of gigabytes of proprietary Nvidia data on the web</a>, including details about future graphics chips, by an unspecified Friday deadline — the compromised email alert website Have I Been Pwned suggests that the scope of the hack <a href=\"https://haveibeenpwned.com/PwnedWebsites#NVIDIA\">includes a staggering 71,000 employee emails and hashes</a> that may have allowed the hackers to crack their passwords (via <a href=\"https://techcrunch.com/2022/03/04/nvidia-ransomware-hackers-demands/\"><em>TechCrunch</em></a>).</p><p id=\"4DlPxS\">It’s not clear how Have I Been Pwned obtained this info, and Nvidia won’t say. Nvidia would not confirm or deny to <em>The Verge</em> whether 71,000 employee credentials have been compromised, and it would not say whether it plans to comply with any of the hackers’ demands. </p><p id=\"DFXBHh\">It is worth noting that Nvidia has far fewer than 71,000 employees — <a href=\"https://investor.nvidia.com/financial-info/annual-reports-and-proxies/default.aspx\">its last annual report</a> lists 18,975 employees across 29 countries, though it’s possible the compromised email addresses include prior employees and aliases for groups of employees. (Companies that rely heavily on email often have a lot of mailing lists.) <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.telegraph.co.uk%2Fbusiness%2F2022%2F02%2F25%2Fus-microchip-powerhouse-nvidia-hit-cyber-attack%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F4%2F22962217%2Fnvidia-hack-lapsus-have-i-been-pwned-email-breach-password\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><em>The Telegraph</em>’s initial report suggested</a> that the company’s internal systems, including email, had been “completely compromised,” and a leak of 71,000 employee credentials would line up with that.</p><p id=\"h2g9HM\">Here is all that Nvidia is actually saying today, via spokesperson Hector Marinez:</p><blockquote><p id=\"dvuSCh\">On February 23, 2022, NVIDIA became aware of a cybersecurity incident which impacted IT resources. Shortly after discovering the incident, we further hardened our network, engaged cybersecurity incident response experts, and notified law enforcement.  </p><p id=\"7lwzKK\">We have no evidence of ransomware being deployed on the NVIDIA environment or that this is related to the Russia-Ukraine conflict. However, we are aware that the threat actor took employee credentials and some NVIDIA proprietary information from our systems and has begun leaking it online. Our team is working to analyze that information. We do not anticipate any disruption to our business or our ability to serve our customers as a result of the incident. </p><p id=\"GptU5j\">Security is a continuous process that we take very seriously at NVIDIA – and we invest in the protection and quality of our code and products daily. </p></blockquote><p id=\"wV4RRE\">That’s what we’d heard previously, and <a href=\"https://nvidia.custhelp.com/app/answers/detail/a_id/5333\">Nvidia’s cybersecurity incident response page</a> hasn’t been updated since March 1st, either. </p><p id=\"yEF049\">The LAPSUS$ hacking group, which has taken credit for the breach, had an unusually populist demand: it stated that it wants Nvidia to open source its GPU drivers forever and remove <a href=\"https://www.theverge.com/2021/5/18/22441847/nvidia-rtx-3080-3070-ethereum-mining-drivers-limit-cryptocurrency\">its Ethereum cryptocurrency mining nerf</a> from all Nvidia 30-series GPUs (such as newer models of the RTX 3080) rather than directly asking for cash. </p><p id=\"53xYum\">But they clearly want cash, too. The hackers have also publicly stated that they’ll sell a bypass for the crypto nerf for $1 million, and this morning, they briefly posted a message suggesting that today’s leak would be delayed while they discussed terms with a would-be buyer of Nvidia’s source code.</p><p id=\"wxSQsW\">If Nvidia does pay up, something that’s not unheard of in these data ransom situations, I wouldn’t necessarily expect to hear about it anytime soon. It won’t necessarily be in either party’s best interests to say so. But if Nvidia doesn’t pay or comply and LAPSUS$ does have the data it claims, things might be about to get interesting.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/TMUbVaVJUtYYcdwoUXyTqe36lCM=/0x144:2000x1191/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22795528/NVIDIA_Endeavor_building_logo.jpg",
  "description": "The hack’s genesis or its conclusion?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}