{
  "title": "Astra’s first launch from Florida ends in failure mid-flight",
  "url": "https://www.theverge.com/2022/2/10/22922010/astra-launch-failure-cape-canaveral-florida-nasa-elana-41",
  "date": "2022-02-10T20:36:58.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/eWo6qqsuMArtAi4g71wJYHPH9Ws=/0x0:2048x1365/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70494668/51861374669_0f4ea498ae_o.0.jpg\" />    </figure>  <p id=\"411l1R\">Small rocket company Astra’s launch today out of Cape Canaveral, Florida, ended in failure a little more than three minutes after takeoff, when an unexpected issue cropped up during flight and prevented the vehicle from reaching orbit. It’s unclear what exactly happened, but live footage from the rocket showed it spinning out of control just after the two main stages of the vehicle separated as planned.</p><p id=\"s4rJgf\">Today marked Astra’s first time launching out of the Cape, after launching primarily out of Kodiak, Alaska, for all of its previous missions and test flights. NASA was the customer for today’s mission, marking the first time Astra launched a payload for the space agency. Called the ELaNa41 mission, the launch carried four small satellites known as CubeSats for NASA, part of an ongoing initiative by NASA to send experimental small spacecraft into orbit from various contenders. </p><div class=\"c-float-right\"><aside id=\"ZfNLIO\"><q>“I’m deeply sorry we were not able to deliver our customer’s payloads.”</q></aside></div><p id=\"IVWx0V\">Now it seems that all of those payloads have been lost. “We experienced an issue in today’s flight,” Chris Kemp, Astra’s CEO, <a href=\"https://twitter.com/Kemp/status/1491868950484828162\">tweeted</a> after the failure. “I’m deeply sorry we were not able to deliver our customer’s payloads. I’m with the team looking at data, and we will provide more info as soon as we can.”</p><p id=\"9RJK1b\">Astra’s stock tumbled sharply on Thursday as the launch failure became apparent. As of 3:40 ET, stock prices were down to $3.59 a share, 33 percent lower than yesterday’s closing price of $5.29. The company began trading on the Nasdaq last July after completing a merger with a special-purpose acquisition company, or SPAC.</p><p id=\"TVc5GL\">Founded in 2016, Astra’s focus is to launch cost-effective small rockets into space. Those small rockets would carry small satellites onboard from different universities, nonprofits, and other organizations. </p><p id=\"NVcibN\">Astra has conducted four previous launches. Its <a href=\"https://www.theverge.com/2021/11/20/22792942/astra-reaches-orbit-first-time-lv0007-rocket\">first successful launch to orbit</a> occurred in November 2021, when it launched its LV0007 rocket carrying a military payload. Astra’s previous launch attempts were met with disappointing results. The company’s <a href=\"https://www.theverge.com/2020/9/12/21433698/astra-rocket-launch-end-failure-orbit\">first attempt to reach orbit</a> in September 2020 ended with its rocket drifting from its planned course, causing the safety system to shut the rocket down. The company <a href=\"https://www.theverge.com/2020/12/16/22178110/astra-small-satellite-launcher-rocket-3-2-alaska-success-orbit\">reached space</a> just a few months later with a December 2020 test flight but fell short of reaching orbit. And in <a href=\"https://www.theverge.com/2021/8/29/22647094/astra-rocket-lv0006-launch-failed\">August 2021</a>, an Astra launch ended prematurely when an engine failed to fire.</p><p id=\"S1KLVS\">The payload Astra attempted to launch today aboard its Rocket 3.3 consisted of CubeSats, a class of small, cheaper satellites frequently made by high schools, universities, and nonprofits. The four CubeSats abroad the ELaNa41 mission were built by the University of Alabama, Tuscaloosa (BAMA-1); New Mexico State University, Las Cruces (INCA); the University of California, Berkeley (QubeSat); and the Johnson Space Center (R5-S1). They were intended to serve <a href=\"https://www.nasa.gov/content/elana-41-mission\">diverse purposes</a>, from testing space junk-cleanup technology to studying neutrons in low-Earth orbit to improve space weather forecasting.</p><p id=\"zXPXLh\">Today’s failure at Cape Canaveral comes after <a href=\"https://www.floridatoday.com/story/tech/science/space/2022/02/07/astra-rocket-launch-scrubs-after-aborted-second-attempt-florida/6689868001/\">two earlier</a> launch attempts that had to be delayed. The initial launch date of February 5th was pushed back due to hardware issues, while Monday’s launch was pushed back to today after the rocket aborted after briefly igniting its engine on the launchpad.</p><p id=\"6dmrfQ\">“Missions like these are critical for developing new launch vehicles in this growing commercial sector,” Hamilton Fernandez, mission manager with NASA’s Launch Services Program, said in a <a href=\"https://blogs.nasa.gov/kennedy/2022/02/10/elana-41-mission-update/\">statement</a> following this afternoon’s failed launch. “The Astra team demonstrated dedication to supporting NASA’s mission. The lessons learned will benefit them and the agency going forward.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pkYyzahMkZ9DjSXrkWFBCBKHVT0=/0x147:2048x1219/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23233316/51861374669_0f4ea498ae_o.jpg",
  "description": "All the satellites on board won’t reach space.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}