{
  "title": "Astra successfully returns to flight just a month after launch failure",
  "url": "https://www.theverge.com/2022/3/15/22979303/astra-rocket-successful-launch-lv0009-kodiak-alaska",
  "date": "2022-03-15T18:14:30.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/keKMDQ_xUYieqw2K2Dp-JTHaF04=/0x0:1200x800/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70626398/22.03.07_LV0009_Kodiak_Kenniston_4_web.0.jpg\" />        <figcaption><em>Astra’s LV0009 rocket ahead of today’s flight from Alaska.</em> | Image: Astra</figcaption>    </figure>  <p id=\"1fGNKh\">Space startup Astra successfully returned to launch today, a little more than a month after its last launch failed mid-flight. Taking off from Kodiak, Alaska, Astra’s LV0009 rocket deployed the satellites it was carrying into orbit for <a href=\"https://astra.com/news/astra-spaceflight-inc-announce-multi-launch-contract/\">three commercial companies</a>, marking the company’s first successful commercial mission.</p><p id=\"uuIFKy\">There was a brief moment during the flight, however, where it seemed like today’s mission might have been a failure. Soon after reaching orbit, the vehicle was supposed to deploy the satellites it was carrying (except for one that was to remain attached to the rocket). However, Astra did not immediately receive confirmation that the payloads had deployed and ended its livestream of the flight before getting word about the fate of the satellites. One of the hosts of the livestream explained that the rocket was “far down range” of the company’s ground station for communicating with the vehicle.</p><div class=\"c-float-right\"><aside id=\"R1YBWu\"><q>“Our customers are calling us and indicating that the satellites are alive”</q></aside></div><p id=\"0yp7nU\">About an hour afterward, Astra resumed its livestream again briefly with CEO Chris Kemp, who confirmed the satellites had actually been deployed. “The payloads have started to communicate with ground stations,” Kemp said. “Our customers are calling us and indicating that the satellites are alive. They’re talking, which means they’ve been successfully deployed.” Trading of Astra’s stock was then halted shortly after the confirmation due to volatility.</p><p id=\"5B02LL\">Today’s launch marks a remarkably short return-to-flight for Astra, <a href=\"https://www.theverge.com/2022/2/10/22922010/astra-launch-failure-cape-canaveral-florida-nasa-elana-41\">following its last launch failure on February 10th</a>. Prior to today’s flight, the company had experienced a string of failures and mishaps, and had only <a href=\"https://www.theverge.com/2021/11/20/22792942/astra-reaches-orbit-first-time-lv0007-rocket\">reached orbit successfully once in November 2021</a>. Now the company can say it has successfully reached orbit a second time. “This has not been easy,” Kemp said during the livestream. “We had a flight just over a month ago, and the team worked really hard — every day, every weekend, many nights — to quickly identify the issues we had on the flight, get another rocket back up to Kodiak, and fly it. And it was absolutely the right thing to do.”</p><p id=\"c6bnni\">Astra’s February flight, the first time the company launched from Florida, was supposed to put four small satellites into orbit for NASA. Astra’s rocket launched as expected, but experienced a problem during rocket stage separation — when the vehicle intentionally breaks apart and sheds weight as it moves along its path into space. Live footage of the flight showed the rocket moving uncontrollably after the stage separation procedure took place. As a result of the failure, all of the payloads on the flight were lost.</p><p id=\"dlw6pB\">On March 6th, <a href=\"https://astra.com/news/post-launch-investigation-what-we-found-and-next-steps/\">Astra said it had identified the issue</a> with the February launch, noting there was a problem with the payload fairing, or the nose cone on top of the rocket that enshrouds the satellites during launch. The fairing did not separate as planned ahead of stage separation. Astra blamed the failure on the separation mechanisms, which are used to separate the fairing in half.</p><blockquote><p id=\"m7GahX\">The separation mechanisms (our fairing has 5 of these) were fired in an incorrect order, which resulted in off-nominal movement of the fairing that caused an electrical disconnection. Due to the disconnection, the last separation mechanism never received its command to open, which prevented the fairing from separating completely before upper stage ignition.</p></blockquote><p id=\"YiPRbt\">Astra said it also found a separate software issue that caused the rocket to tumble after the stage separation. The company explained how it identified the root causes of both issues and developed ways to address the problems. </p><p id=\"z0Mbdq\">Today’s flight had payloads for three customers on board, a mission that had been arranged through a company called Spaceflight, which helps match satellites to rockets going to orbit. The customers included Portland State Aerospace Society and NearSpace Launch.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DHdNFwWd-hVToVmq2n0BRCLVmeY=/0x86:1200x714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318014/22.03.07_LV0009_Kodiak_Kenniston_4_web.jpg",
  "description": "The launch was still a bit of a nail biter, though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}