{
  "title": "Asus drops two OLED Zenbooks and a new logo",
  "url": "https://www.theverge.com/2022/4/21/23035485/asus-zenbook-13-s-oled-pro-15-flip-specs-price",
  "date": "2022-04-21T19:37:51.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kQgzmPJPy8yPHeqT15D0L7o4erU=/0x0:2048x1365/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70777695/Zenbook_S_13_OLED_UM5302_Scenario_photo_03.0.jpg\" />    </figure>  <p id=\"0EAjDe\">Asus has quietly announced two additions to its Zenbook line that are all about the screens. The new AMD-powered Zenbook 13 S joins a <a href=\"https://www.theverge.com/22627179/dell-xps-13-oled-vs-asus-zenbook-comparison-specs-price\">limited, but slowly growing</a> lineup of 13-inch OLED laptops for folks seeking the benefits of OLED technology for a consumer-accessible price. But Asus isn’t leaving Intel behind — the company has also unveiled a new Zenbook Pro 15 Flip OLED convertible powered by 12th-Gen Core processors and Arc GPUs. </p><p id=\"qwCxf4\">The Zenbook 13 S OLED doesn’t look too different from 13-inch Zenbooks we’ve seen before. It weighs 2.2 pounds and is just over half an inch thick. It’s available in some fun colors: Ponder Blue, Aqua Celadon, Refined White, and Vestige Beige. But the most interesting thing is that the word “Asus,” famously prominent on Zenbook lids, has been replaced with a new arrow-shaped logo. This looks much nicer to me and more like something I wouldn’t mind having in a coffee shop all day. </p><p id=\"dEw1U2\">About the screen: it’s a 2.8K 16:10 touchscreen with a 0.2ms response time and a claimed 550 nits of peak brightness. <a href=\"https://www.theverge.com/22538867/asus-zenbook-13-oled-review-amd-ryzen-specs-features-price\">The 13-inch OLED Zenbook we reviewed last year</a> delivered a vivid and bright experience, and such a screen could be a good option for multimedia viewing. In terms of connectivity, there’s an audio jack (which has been missing from some recent Zenbooks), and there are three USB 3.2 Gen 2 Type-C ports that support DisplayPort and Power Delivery. There does not appear to be USB-A, which makes me sad.</p><p id=\"C3Kchn\">The 13 S is powered by AMD’s Ryzen 6000 processors, including a Ryzen 5 6600U or a Ryzen 7 6800U. It can be configured with up to 32GB of RAM (LPDDR5) and 1TB of storage. We haven’t gotten to do a ton of testing with these processors yet, but we expect them to be more than capable of handling entertainment, office work, and other tasks generally done on 13-inch laptops.</p><p id=\"pwmvjX\">Asus has not given us a price or release date for this device, but a 13.9-inch Zenbook S (with no OLED) is <a href=\"https://www.amazon.com/dp/B08H6LLBRL?tag=price04_52421-20&amp;linkCode=osi&amp;th=1&amp;psc=1&amp;ascsubtag=s1650404057287cqe0a52402\" rel=\"sponsored nofollow noopener\" target=\"_blank\">currently going for $1,699.98</a>. </p><div id=\"PxYv5t\"><div data-anthem-component=\"gallery:11154815\"></div></div><p id=\"RP0tRG\">On the Intel side, Zenbook Pro 15 Flip OLED is more of a workstation device. It’s powered by 12th-Gen processors up to a Core i7-12700H and Arc GPUs up to an A370M. Its 15.6-inch screen has 2880 x 1620 resolution and a 120Hz refresh rate (thumbs up) with a 16:9 aspect ratio (thumbs down). You get up to 1TB of storage, and up to 16GB of memory (which is odd since the 13-incher goes up to 32GB). Previous Zenbook 15 Flip models (with Nvidia GPUs rather than Intel ones) are <a href=\"https://bestbuy.7tiv.net/c/482924/614286/10014?u=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fasus-zenbook-flip-15-q538ei-15-6-touch-screen-laptop-intel-core-i7-16gb-memory-gtx1650ti-max-q-1tb-ssd-grey%2F6436221.p%3FskuId%3D6436221&amp;sharedid=theverge.com\" rel=\"sponsored nofollow noopener\" target=\"_blank\">currently goi</a><a href=\"https://shop-links.co/cg5fyQ9lh4I\" rel=\"sponsored nofollow noopener\" target=\"_blank\">ng for as much as $1,499.</a></p><p id=\"mXanGv\">We hope to update this information with prices and release dates as soon as those are available. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EdOlmzMFbHp-uNc4mAuX16UfMd4=/0x147:2048x1219/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23406496/Zenbook_S_13_OLED_UM5302_Scenario_photo_03.jpg",
  "description": "No price or release date yet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}