{
  "title": "Asus ROG Zephyrus G14 review: the price is no longer right",
  "url": "https://www.theverge.com/22938516/asus-rog-zephyrus-g14-gaming-laptop-review",
  "date": "2022-02-17T14:00:00.000Z",
  "author": "Monica Chin",
  "content": "  <p>The cheaper model might be great, but this one isn’t</p> <p class=\"p--has-dropcap p-large-text\" id=\"06SRP3\">Well, I’ll be damned. Asus did it. It fixed literally every problem I’ve ever had with the Zephyrus G14. It added a webcam. It made the screen taller. It made the screen brighter and the touchpad way bigger. When it comes to the features and chassis, I’m basically out of complaints. </p><p id=\"m9Cd3f\">But in doing so, Asus has added another major issue: price. </p><p id=\"fEQNKM\">The reason the G14 <a href=\"https://www.theverge.com/2020/3/30/21197761/asus-rog-zephyrus-g14-review-gaming-laptop-specs-features-price\">shook up the laptop world</a> when it was first released in 2020 wasn’t just its excellent chassis and frame rates; it was the unbelievably low price that chassis and power were available for. (The top configuration was $1,499.) The <a href=\"https://www.theverge.com/22702219/asus-rog-zephyrus-g14-2021-gaming-laptop-review\">2021 model we reviewed</a>, also the top configuration, was $500 more expensive. And this 2022 iteration is yet another step up in price. This system, which has an AMD Ryzen 9 6900HS (the first Ryzen 6000 system we’re seeing this year), a Radeon RX 6800S, 32GB of RAM, 1TB of storage, a 120Hz 2560 x 1600 display, and an animated LED matrix on the lid, will go for (as far as I can tell from the information Asus has provided) $2,499.99. </p><p id=\"nMuCH0\">That puts this G14 model very far outside the budget range it previously occupied. It’s now significantly more expensive than other top 14-inch rigs; it’s in the same price tier as <a href=\"https://www.theverge.com/22723299/razer-blade-15-advanced-late-2021-review-specs-features-design\">Razer’s Blade 15 Advanced</a>, which is already considered pricey. While the G14 remains my favorite 14-inch laptop to use, it’s now in a position where you can get better performance for less. </p><p id=\"T4U5Kl\">Quick note: my test unit appears, from the information Asus sent me (which was vague and which the company wouldn’t clarify when I asked), to be the most expensive one that will be available. It looks like another configuration with the same processor and display, but an RX 6700S (and without the fancy lights, I’m guessing) will also be sold for $1,599.99. I wouldn’t be surprised if that one is a much better deal, and I wish I had it on hand. But this $2,499 SKU is the one Asus sent me, so it’s the one I’m going to review. </p><div id=\"mEayNL\"><div data-anthem-component=\"scorecard:11052163\"></div></div><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The keyboard deck of the Asus ROG Zephyrus G14 seen from above at a slight left angle atop a green fabric bench.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lk-VftjT9l1Jw0nQxeGHfuRh6cM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250309/akrales_220215_5022_0010.jpg\">      <figcaption><em>I will never stop recommending this keyboard.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"pI4JBR\">So how did this thing do? While performance will always vary by title and other conditions, I’d roughly put this Radeon RX 6800S system somewhere between what we’ve seen from the RTX 3060 (which was in last year’s Zephyrus G14 and <a href=\"https://www.theverge.com/22726307/asus-rog-zephyrus-m16-gaming-laptop-review\">Zephyrus M16</a>) and the RTX 3070 (which powered last year’s phenomenal <a href=\"https://www.theverge.com/22321471/asus-rog-zephyrus-g15-gaming-laptop-review\">Zephyrus G15</a>). </p><p id=\"7FPMnP\">The G14 averaged 202fps on <em>CS:GO </em>at maximum settings and native QHD resolution — that CPU-heavy title was the only one to take full advantage of the 120Hz display. The 6900HS processor here displayed an incremental but not significant improvement over the 5900HS that was in the 2021 G14 (which averaged 191fps on this title) and the G15 (178fps). The Ryzen chip looks to be doing its job.</p><p id=\"ZZwJTv\">But when it came to titles that lean more on the Radeon GPU, results were murkier. On <em>Shadow of the Tomb Raider</em>, the G14 delivered 70fps with ray tracing off and just 37fps with ray tracing maxed. This is very close to what we saw from the Intel-based RTX 3060 Zephyrus M16. But both the RTX 3070 G15 and the RTX 3070 Razer Blade 14 did a much better job on this title, especially when ray tracing was in the mix. </p><p id=\"AXfwE4\">We saw similar results from <em>Red Dead Redemption II</em>. The G14 averaged 49fps on this title with all sliders manually maxed, which is a very respectable score that’s a bit better than what we saw from the RTX 3060 M16 but still worse than what we saw from the two RTX 3070 systems.</p><p id=\"2cc4Yl\">These frame rates would be phenomenal from a device that costs $1,599 — another reason that lower-tier model will be a great deal if its performance even comes close to what we’re seeing here. But they’re not blowing away the competitive field that exists in $2,499-land. For example, the RTX 3070 G15 is currently just <a href=\"https://shop-links.co/cgEnRauL2xI\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$1,849.99 at Best Buy</a>. The <a href=\"https://shop-links.co/cgEnRPkdZZ8\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Blade 14 with that GPU</a> is going for $2,199.99. The major benefits you get from the G14, apart from the fancy lights on the lid, are the 32GB of RAM (where both of the RTX 3070 models I just referenced come with just 16GB) and the 16:10 screen. Those things (especially the 16:10) are nice bonuses that I think are worth paying a bit more to get, but not $650 more. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Zephyrus logo on the inside vents of the ROG Zephyrus G14.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/080Tze5135zkxBqFE6LA1BmLiNw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250320/akrales_220215_5022_0193.jpg\">      <figcaption><em>Little logo hidden in the vents. Fun!</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"5TsVe6\">Cooling didn’t seem to be a hugely limiting factor (unlike with some other thin machines I’ve used lately). Like previous Zephyri, this G14 uses ROG’s Intelligent Cooling system — Asus says the vapor chamber covers 50 percent more motherboard area than a traditional heat pipe design. The G14’s processor, unsurprisingly, got hotter than the larger G15’s did in our testing, but it did stay largely in the high 80s (Celsius) without spending a lot of time at concerning levels. </p><p id=\"RHEFPj\">Fans were audible during gameplay but easily faded into the background. I used the Silent fan profile (selected in Asus’ Armoury Crate software) outside of gaming and never heard the fans even with my ear to the deck. The chassis was cold most of the time, even when I was running a fairly heavy workload. </p><div class=\"c-float-left c-float-hang\"><aside id=\"miAmf8\"><q>Fans were audible during gameplay, but easily faded into the background</q></aside></div><p id=\"WVFQDx\">Battery life remains an area where the G14 stands out, but I’m not quite as impressed as I have been in previous years. I averaged seven hours and 50 minutes of continuous work. The test involved using the device as my daily work driver, hopping around a dozen Chrome tabs with occasional slacking, video calls, and Spotify streaming overtop, with the screen around 200 nits of brightness. That’s not as long as I got from last year’s G14 (which gave me over nine and a half hours from the same workload) or from the G15 (which has a 90Wh battery to this unit’s 76Wh battery). Nearly eight hours of use is still a lot better than many gaming laptops out there and close to a full workday, but exceptional battery life has been a big part of the G14’s value so far, and this result chips away at that advantage. </p><p id=\"k5TUZ3\">Gaming while on battery was also a bit disappointing. I got 54 minutes of <em>Red Dead Redemption 2 </em>play, with about 46 minutes of very playable time before everything slowed down. That’s, again, not terrible but still below what we’ve seen from recent AMD systems. During light Chrome use, the beefy 240W charger got the G14 to 60 percent in 41 minutes.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The ports on the left side of the Asus ROG Zephyrus G14.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XlmRCl1nUaYlQ-W99ZZWROJx_hw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250314/akrales_220215_5022_0085.jpg\">      <figcaption><em>Power port, HDMI, USB-C, and audio jack on the left.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The ports on the right side of the Asus ROG Zephyrus G14.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mVn3FN4FC3VDD0v3tpk_-qF2XH0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250313/akrales_220215_5022_0073.jpg\">      <figcaption><em>Two USB-A, a USB-C, and a microSD on the right.</em></figcaption>  </figure></div></div></div><p id=\"TXdAnD\">Let’s dive into the rest of the chassis. If you’ve read my laptop reviews before, you’ll know I often look very hard for things to complain about. But I really have no complaints about the G14. The one thing to note is that Asus seems to have quietly gotten rid of the fingerprint sensor, which used to be built into the power button (though you can now log in with Windows Hello facial recognition). The fact that this is what I’m left to nitpick about is a good sign for everything else.</p><div class=\"c-float-right c-float-hang\"><aside id=\"sCUhyJ\"><q>Asus seems to have quietly gotten rid of the fingerprint sensor</q></aside></div><p id=\"KjiyQ9\">The design is quite similar to previous G14 models, with a few key changes. The AniMe Matrix on the lid has 19 percent more mini LEDs than previous generations (1,449 total). The lights flash all kinds of customizable animated patterns — text messages, pictures, music equalizer effects, whatever else you want. They look pretty cool, even when the laptop is closed. (“What is it doing?” someone who walked by during my testing asked me.) You can even create a very cute virtual pet and play games with it. It’s a legitimately cool thing that I wish didn’t impact the G14’s price so much.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Asus ROG Zephyrus G14 half open, angled to the right, on a green fabric bench.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CpUK_xTgM_D7KSlEUGYotrgVAIs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250317/akrales_220215_5022_0148.jpg\">      <figcaption><em>No fingerprint problems with the white model, but I can’t speak for darker colors.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"59vHd7\">It’s also gotten slightly bigger. My test unit is 3.79 pounds, while one without the Matrix lid is 3.64 pounds (another reason not to waste money on those lights if you’re ambivalent about them). Despite the increase in weight from its initial launch, the G14 remains a tad lighter than the Blade 14. It is thick as laptops go (0.77 inches with the matrix, 0.73 without) but carrying it around and fitting it into a full backpack still wasn’t a problem. </p><div class=\"c-float-right c-float-hang\"><div id=\"9nWRGY\"><div data-anthem-component=\"aside:11052130\"></div></div></div><p id=\"ET3ZYK\">The all-aluminum body is as sturdy as ever. I battered it around in my full backpack for a few days, and it picked up no visible scratches or fingerprints. (The white color of my unit helps with this, of course.) There’s some flex in the screen, but virtually none in the keyboard. The white finish is quite nice. </p><p id=\"uT7qpS\">This G14 also folds back a full 180 degrees, while last year’s model could only do 110. It has the ErgoLift fold-under hinge, as many Asus laptops do. It’s a bit sharp, but not as uncomfortable as it can be on some thinner models. The white finish feels quite nice and is a step up from last year as well. The plasticky black bezels are really the only part of this G14 that doesn’t quite look the $2,500 price.</p><p id=\"wtsQ96\">The change I’m most excited about is in the screen: It’s finally 16:10, with a 91 percent screen-to-body ratio. It looks more modern than previous generations and allows for more multitasking screen space. It’s also a great panel, covering 100 percent of the sRGB gamut and reaching an impressive 515 nits. That makes this one of the brightest gaming laptops I’ve ever reviewed. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The Republic of Gamers nameplate on the lid of the Asus ROG Zephyrus G14.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/raWNUpauZaMUt55wC4nFeasRrJk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250315/akrales_220215_5022_0113.jpg\">      <figcaption><em>The lid LEDs turn off automatically when the G14 is unplugged.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The top half of the Asus ROG Zephyrus G14 keyboard deck.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ua7AnjsA849t4xhhvAwR3MXa14M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250321/akrales_220215_5022_0194.jpg\">      <figcaption><em>I love these discrete volume buttons on the keyboard deck.</em></figcaption>  </figure></div></div></div><p id=\"UOLK9E\">Elsewhere, the touchpad is 50 percent larger than last year’s, and it’s <em>huge</em>. I never once hit plastic while scrolling, and while my right hand was often resting on it, there were no palm-rejection issues. The trackpad itself is quite smooth, with an easy click. And the G14’s keyboard, always one of my favorite keyboards on the market, now has RGB backlighting. I wasn’t blowing my normal typing speeds out of the water, but with 1.7mm of travel, it’s still a lot of fun to use. </p><p id=\"kBHGdc\">Finally, there’s a webcam! It’s compatible with Windows Hello, and it’s actually fairly good. Even in dim light, it delivered a clear and crisp picture with little noise and much more accurate colors than you usually see from laptop cameras. Speaking as someone who’s on Zoom meetings all the time, this single feature has brought the G14 from a device I’d never consider to one that’s I’d actually buy (at the cheaper price). </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Asus ROG Zephyrus G14 angled to the right seen from the back atop a green fabrc bench.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/URQIe0hsfDDsXzk5E7SII9su2HQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250316/akrales_220215_5022_0122.jpg\">      <figcaption><em>I love this G14, but I have mixed feelings about the configuration I got.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"UPJqDS\">At the end of the day, Asus has fixed basically every problem I’ve had with the G14 in the past and has fine-tuned a number of other features. This would be a phenomenal buy for $1,599. And while I unfortunately can’t say this for certain, I strongly suspect that you should wait for the lower-tier model and pay $1,599. </p><p id=\"VgjRcR\">The G14’s low price was a massive part of why so many reviewers (myself included) have been singing its praises from the rooftops for the past two years. I imagine it’s a huge part of why the laptop has been so notoriously difficult to buy. But the 2022 G14 I’ve been sent is in a different category. It’s a luxury product. And that changes the calculus, and the potential audience, significantly. </p><div class=\"c-float-right c-float-hang\"><aside id=\"9FRCRu\"><q>The G14 is no longer the value champ it once was</q></aside></div><p id=\"zwGSgS\">The long and short of it is: You can get a G15 for way less. If you’d prefer a 14-incher, you can get a Blade 14 for way less. While these have 16:9 screens, less RAM, and no virtual pets, they’re better in the area that’s most important in a gaming laptop: frame rates in GPU-intensive games. </p><p id=\"10uLKO\">If you want the 16:10 and the pretty lights, you might also consider the Zephyrus M16. It doesn’t offer quite as much in terms of raw graphics power, but it came quite close on the titles tested here, and it’s currently available for literally $1,000 less. This high-end G14 is really in the Blade 15 Advanced’s price category, and that’s a tougher class than it’s occupied in the past. </p><p class=\"c-end-para\" id=\"Snkz5Y\">The G14 has a nearly flawless chassis and a powerful CPU that may be worth $1,599, but you shouldn’t spend $2,500. To earn that price tag, it needs to bring better performance. </p><div><div id=\"6k5GxU\"><div data-anthem-component=\"aside:11052142\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ai2HXNxl2zJ-4EVf5DHi7PqEBTA=/0x257:2040x1325/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23250310/akrales_220215_5022_0019.jpg",
  "description": "Asus fixed everything, but jacked up the price.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}