{
  "title": "Asus ROG Zephyrus M16 review: hot specs and hot air",
  "url": "https://www.theverge.com/2022/4/29/23047212/asus-rog-zephyrus-m16-review-gaming-laptop",
  "date": "2022-04-29T15:03:50.000Z",
  "author": "Alice Newcome-Beill",
  "content": "  <p>Good performance, iterative design</p> <p class=\"p--has-dropcap p-large-text\" id=\"L7zeZr\">The Asus ROG Zephyrus M16 from last year was a sharp laptop that stumbled a bit in terms of performance thanks largely to its Intel CPU. While the lightweight form factor was a plus, we were ultimately disappointed with the overall performance offered by this laptop, especially given its high price point.  </p><p id=\"nHb26D\">Asus clearly isn’t attempting to reinvent the wheel this year, offering another Intel-based laptop that retains much of what worked with its predecessor while smoothing out some of the rough edges. Many of these additions are welcome but mostly iterative, offering faster 12th Gen Intel CPUs and up to an RTX 3080 Ti graphics card. However, I’m more interested to see if the M16 earned its higher price tag this time around. </p><p id=\"VHu0sI\">It’s also worth mentioning that if you’re in the market for a gaming laptop, the <a href=\"https://www.theverge.com/2022/1/4/22864968/asus-rog-zephyrus-g14-g15-gaming-laptop-2022-webcam-amd-16-10-aspect-ratio-specs-features\">2022 version of the Asus Zephyrus G15</a> added a webcam to its already impressive list of specs, addressing one of the biggest issues we had with the prior model and removing one of the big advantages the M16 had over the G15. However, the Intel processor in the M16 has the potential to give it an edge in creative applications.</p><div id=\"akKusc\"><div data-anthem-component=\"scorecard:11166563\"></div></div><p class=\"p--has-dropcap\" id=\"lt0v5c\">This year’s model of the M16 is all about Alder Lake. The model I tested was equipped with a Core i9-12900H paired with an Nvidia RTX 3070 Ti backed up by 2TB of storage and 16GB of DDR5 RAM. This is considered the middle of the road configuration, priced at $2,149.99. However, Asus also offers a higher tier option for $3,199.99 that has the same CPU and storage but upgrades the GPU to a 3080 Ti and comes with 32GB of RAM. The budget entry of the M16 is priced at $1,649.99 and uses a Core i7-12700H, an RTX 3060, 512GB of storage, and 16GB of RAM instead.</p><div class=\"c-float-right\"><div id=\"zczkWv\"><div data-anthem-component=\"aside:11166540\"></div></div></div><p id=\"PUl9P8\">With more configuration options and a budget model with a price that’s a little more accessible, it feels like Asus is at least on the right track in terms of pricing. Comparatively, the previous model we tested was $1,849.99 at launch and used an Intel Core i9-11900H paired with an RTX 3060, 16GB of RAM, and 512GB of storage. Even among competitors like the Lenovo Legion 5i Pro and the Razer Blade 15, you’ll be hard-pressed to find a laptop that’s less expensive but can match the specs of the M16 pound for pound. </p><p id=\"4IzbEh\">The closest comparable configuration of the new Intel-based Legion 5i Pro costs around $2,300 and matches the M16 in just about every aspect, including the display and GPU, but is packaged with a slightly less powerful Intel Core i7-12700H CPU. The latest model of the Razer Blade 15 is a similar case, with a 3070 Ti, the same amount of RAM and storage, and a slightly less powerful CPU. Priced at $2,999.99, the only edge it has on our review model is the 240Hz display, which is overkill for most situations with this kind of hardware configuration.      </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dWpv2vIw0RoUzOANiwaPzszfVuw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420848/akrales_220426_5160_0108.jpg\">      <figcaption><em>The trackpad and keyboard get the job done, but the chassis attracts dust and fingerprints easily.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"G3D2jM\">So far, the specs of the M16 are mostly what we’d expect, but the inclusion of an integrated Intel Iris Xe GPU and a multiplexer or MUX switch separate this laptop from its predecessor and other gaming options. These additions to the M16 motherboard go hand in hand, allowing the laptop to dynamically switch between its dedicated and integrated GPU based on usage to optimize battery life without sacrificing performance.    </p><p id=\"pRTkSU\">Battery life was a bit of a pain point with the older M16, which only averaged about six hours of general use on a single charge. This year’s M16 thankfully displays at least a marginal improvement. I was able to get an average of two hours while playing <em>Destiny 2</em> on high settings and about six hours of general use with the standard power profile. In practice, the MUX switch had a marked impact on the longevity of this laptop, letting it run roughly three times longer than it would if it relied solely on a discrete GPU. A seven-hour battery life isn’t bad in the realm of gaming laptops (at least ones with Intel chips), but I wouldn’t recommend taking the M16 very far from an outlet.</p><p id=\"tM6ZYf\">One aspect we liked about the previous model of the M16 was the display, which remains relatively unchanged. The thin bezel screen ensures that no screen space is wasted in this 16-inch chassis. With a maximum resolution of 2560 x 1600 and a 165Hz refresh rate, this isn’t the fastest or highest resolution display you can get on a laptop by any stretch, but this strikes a happy medium that allows the M16 to get the most out of its hardware without wasting potential. </p><p id=\"XBPFai\">In terms of performance, the M16 can easily handle a variety of modern titles at its native resolution with all the sliders turned up, which includes ray tracing and v-sync. <em>Shadow of the Tomb Raider</em> struggled a little with RTX shadows maxed out, but still averaged a little under 60fps whereas <em>Doom Eternal</em> was able to manage well over 90fps with all settings on “ultra nightmare.” The only benchmark that tripped up the M16 was <em>Red Dead Redemption 2</em>, which maintained an average of 45fps but occasionally dipped below 30. However, with DLSS enabled on blanched mode, <em>RDR2</em> performed far better, managing a remarkably smooth 60fps. </p><p id=\"wVANH0\">I also tested less graphically demanding titles like <em>Counter-Strike: Global Offensive</em> to see how far I could push the 165Hz display, which the M16 also handled quite well — only dipping below 165fps on a small handful of occasions. The M16 even managed to push a maximum of 340fps at times without vertical sync or a frame limiter enabled, far faster than what the display is even capable of rendering. </p><p id=\"Qho4HG\">These numbers represent a marked improvement over the previous model of the M16, which maxed out at 236fps during our benchmark of <em>CS:GO, </em>and around 38fps in our test with <em>Shadow of the Tomb Raider</em> on ultra settings. The <em>RDR2 </em>benchmark for the older M16 wasn’t much different, however, averaging 42fps with everything set to maximum.</p><p id=\"HAaj3i\">With these previous examples, it should go without saying, but games on the M16 display look amazing. The 2560 x 1600 resolution offers great fidelity, while features like Dolby Vision and HDR10 provide excellent depth of color. Additionally, the 500 nits of peak brightness also ensure that you don’t miss a single detail and do a commendable job of combating glare.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/88anZ05OCB7umDHyrg-sz8laD68=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420851/akrales_220426_5160_0135.jpg\">      <figcaption><em>The form factor is essentially identical to last year’s M16.</em></figcaption>  </figure><p id=\"XWcX3r\">The M16 can handle games well enough, but I had hoped that the presence of Intel silicon would provide a boost in terms of productivity performance as well. Running the hardware against the Puget Systems benchmark tests for DaVinci and Adobe Premiere Pro, I wasn’t disappointed. The final overall scores were 1243 and 1047, respectively.</p><p id=\"nwstmU\">One anomaly I did encounter was in regard to our video export test, which regularly took over seven minutes to complete with the best time clocking in at 7:43. Other laptops with comparable hardware, even ones made by Asus, managed to complete the same task in closer to three minutes. I ran the benchmark on different versions of Adobe Premiere Pro and made sure the correct power settings were being used with no change in the result. I’m currently unsure whether to chalk this one up to a hardware or software issue, but I’ve reached out to Asus for comment and will post an update if anything changes.</p><p id=\"TrBgO5\">Outside of the anomaly with our export tests, these results put the M16 in performance brackets that are currently occupied by more expensive competitors with similar hardware configurations like the Gigabyte Aorus 17 XE4 and the latest model of the Razer Blade 17. While these laptops offer larger screens, they can cost anywhere from $300 to $1,000 more. Comparisons aside, finding performance of this level on a machine that costs a little over $2,000 warrants some attention.</p><div class=\"c-float-right\"><div id=\"UPBzZo\"><div data-anthem-component=\"aside:11166534\"></div></div></div><p id=\"lf3jAy\">While the performance here outstrips the previous model by a wide margin, the M16 still struggles with the thermal load created by this new hardware. While I didn’t experience any throttling while running benchmarks, the temperatures on the CPU for the M16 occasionally spiked to over 90 degrees Celsius. Asus has made some modest improvements to attempt to offset this additional heat, like a different thermal paste and some small changes to the fan blades, but the M16 remains both hot and incredibly loud when under heavy load. However, I should stress that this is when the M16 is using its “turbo” mode, which pushes most of its hardware to the edge of the performance envelope.</p><p id=\"9lEIAt\">Thankfully, the M16, like other Zephyrus laptops, allows you to switch performance profiles that trade higher performance for power usage and more audible cooling. The included Armoury Crate software lets you switch between silent, balanced, and turbo modes with the press of a button. However, while on battery power, the M16 is limited to just its silent or balanced profiles.</p><p id=\"0KzJpY\">Silent mode is particularly impressive, and while it isn’t dead quiet, it’s still capable of delivering usable performance without making itself sound like a jet taking off. It was so quiet, in fact, that I was able to play <em>Destiny 2</em> in my living room without disturbing my partner, who was watching TV just a couple of feet away. This did impact performance, causing occasional dips in the frame rate and some temperature spikes, sometimes reaching as high as 85 degrees Celsius, but barring that, I was astonished at how long this laptop was capable of maintaining that kind of performance without being super audible.</p><p id=\"8fqbCg\">A laptop that gets this loud is going to be in constant competition with its speakers, which feel sadly underpowered. The M16 features a total of six speakers this time around, and while they aren’t terrible, they aren’t great, either. Generally, the sound felt very hollow and was very limited in terms of its presentation. Several times I thought turning up the volume might help, but in most cases, I ended up reaching for a pair of headphones rather than tolerating the lackluster speakers. I even used the Dolby Atmos feature in an effort to fill things out but was still left unimpressed.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6qGW3v2iK4Pd0aQiNixSvkZDgAg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420845/akrales_220426_5160_0035.jpg\">      <figcaption><em>This is what a gaming laptop looks like now? Cool.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"9WWj0p\">The 720p webcam makes a return from last year. While it’s been proven that a gaming laptop doesn’t necessarily need a webcam to be good, it’s become one of those features that you just sort of expect from any laptop — especially if you’re needing to use it for work or schooling tasks outside of gaming. The quality of the camera here isn’t going to blow anyone away but is more than sufficient for Zoom calls. However, the noise-canceling microphone array was surprisingly effective at filtering out unwanted background noise.      </p><p id=\"X11tco\">Regardless of the changes made to the hardware, the chassis of the M16 still looks great.  If you’ve seen a Zephyrus laptop in the past year, the M16 will look familiar. I personally like the aesthetics, especially the reflective highlights on the lid. The Ergolift hinge also makes a welcome return, which lifts the base of the chassis slightly to improve airflow. The matte black finish is sharp-looking, but I was slightly disappointed at how quickly it picked up fingerprints. In terms of size, the M16 measures 14 x 10 x 1 (HWD) and weighs in at just 4.4 pounds. The 240W adapter has some heft to it but isn’t cumbersome, making the entire package relatively portable if not particularly light. </p><p id=\"q4qmwY\">The similarities continue with the layout of the keyboard and touchpad on the M16, which is virtually identical to some of the previous entries in the Zephyrus lineup with dedicated volume keys and RGB backlighting. The spacious trackpad takes up a 5.1- x 3.4-inch footprint, and while certainly larger than most, didn’t feel obtrusive at all. Both the keyboard and trackpad serve up a satisfying click, lending the M16 some excellent haptics whether you’re typing or gaming.</p><p id=\"AarVwF\">The chassis also packs some impressive connectivity options. In addition to the more basic dual USB-A and HDMI hookup, it also includes a pair of USB-C ports, one of which is Thunderbolt-compatible (something you don’t get on the AMD-equipped G15). There’s also a microSD card slot. The laptop can also support a wired ethernet connection and 3.5mm audio cables along with some other nice under the hood improvements, like Wi-Fi 6E and Bluetooth 5.2 connectivity.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WaOfsm6vvt7nk34uwDVPUREdRxU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420847/akrales_220426_5160_0071.jpg\">      <figcaption><em>The port selection remains good and is Thunderbolt 4-compatible.</em></figcaption>  </figure></div><p class=\"p--has-dropcap c-end-para\" id=\"MKeO0A\">As a complete package, the Asus Zephyrus M16 is an acceptable improvement over its predecessor purely from the perspective of its hardware. Asus has done a good job keeping the M16 competitive in the realm of performance. Still, many of the issues we had with the previous model remain — namely, the battery life and how audible it can get when under load. The M16 would be easier to recommend if not for the existence of the updated G15, which we have yet to test but will likely top our list of gaming laptops based on how well prior versions of it have performed. If you need a laptop for a variety of creative applications, the M16 would be the wiser investment. However, if you’re in the market for a gaming laptop, the Ryzen-equipped 2021 model of the G15 with an RTX 3070 is available for $1,849.99 and an RTX 3080 for $2,199.99, making it a better value purely for gaming.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vPgqe4OOThTxA09sj2uc57iJk1g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23420849/akrales_220426_5160_0113.jpg",
  "description": "More of the same from Asus.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}