{
  "title": "Asus’ ROG Flow Z13 is a Surface Pro that’s got game",
  "url": "https://www.theverge.com/22989540/asus-rog-flow-z13-gaming-tablet-windows-specs-review",
  "date": "2022-03-23T14:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "  <p>Good execution, but its specs aren’t enough for serious gamers</p> <p class=\"p--has-dropcap p-large-text\" id=\"9n0QeY\">The influence is obvious. Asus wants you to think of Microsoft’s Surface Pro when you see the ROG Flow Z13. It’s a Windows 11 tablet with a magnetic keyboard, a kickstand, and small bezels surrounding its 120Hz refresh rate display. Those similarities aside, the Flow Z13 is an entirely different beast on the inside. Instead of being an ultra-portable productivity device, the Z13 comes with powerful enough hardware to compete with mid-range gaming laptops. You can use it as a laptop or detach the keyboard, connect a controller, and relax with it on the couch.</p><p id=\"uPyvmQ\">This is not the <a href=\"https://www.theverge.com/circuitbreaker/2019/1/7/18168263/asus-rog-mothership-surface-pro-gaming-laptop-zephyrus-s-gx701-ces-2019\">10-pound monstrosity that Asus released a few years ago</a> — the Z13 is just 12mm thick and weighs under two and a half pounds. In that frame, Asus managed to cram impressive hardware — at least, in the high-end, $1,899 model that I’m testing. It has Intel’s near-top-of-the-line 12th Gen Core i9 12900H processor and Nvidia’s RTX 3050 Ti. It also has fast DDR5 memory clocked at 5,200MHz and 1TB of M.2 NVMe storage. Later this year, Asus will launch a $1,499 model that uses Intel Iris Xe integrated graphics instead of the discrete Nvidia graphics, a lesser Core i5 processor, and half as much storage.</p><p id=\"ngF3Tv\">As if all of that wasn’t novel, the Flow Z13 can be super-charged with Asus’ optional XG Mobile external graphics card enclosure, just like the <a href=\"https://www.theverge.com/22249408/asus-rog-flow-x13-review-price-specs-features\">Flow X13 laptop from 2021</a>. By plugging that in, an RTX 3080 will power your gaming experiences — and provide several more ports and display connectors. Though, that added graphical finesse and versatility comes at a huge cost. I’ll get into that more below.</p><div id=\"hFBGcz\"><div data-anthem-component=\"scorecard:11107056\"></div></div><p id=\"KR3nIT\">The Flow Z13 by itself makes a compelling argument for a gaming tablet that runs Windows, but that statement wholly depends on the games you like to play. My Steam library happens to be filled with indie games and AAA games from another era, and those consistently run at or above 60 frames per second on its 1080p display. I had a great time playing games like <em>Death’s Door</em> and <em>Inscryption </em>at their highest graphical settings. But if your gaming preferences tilt more toward the latest graphically demanding titles, including big, open-world titles like <em>Cyberpunk 2077</em> and <em>Elden Ring</em>, the Z13’s limits become apparent. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0yK06Ng-JCKcdG92naMWpqgBqaw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312828/akrales_220304_5054_0387.jpg\">      <figcaption><em>Playing smaller-scale games, like Death’s Door, is a specialty of the Flow Z13.</em></figcaption>  </figure></div><p id=\"HC4ZS6\">With the tablet plugged in on turbo performance mode, each of those games typically ran between 25–35 frames per second on medium detail settings. That’s not dreadful, but the gameplay wasn’t smooth. Performance commonly spiked and plunged, mostly due to the RTX 3050 Ti graphics card, which offers a meager 40W of total graphics power. While that’s a respectable amount of grunt for this form factor, it’s just not enough juice to run everything as well as you might hope to (most laptops have much higher-wattage GPUs). While most games should be playable, there will likely be visual compromises aplenty. It really depends on what your definition of “playable” is.</p><p id=\"PE2YUQ\">That kind of high-end gaming performance would be damning for any gaming laptop that costs $1,899. At that price, you can get a more powerful 15.6-inch model, like Asus’ Zephyrus G15 with a QHD screen and a faster RTX 3070 GPU, to name one example. But, if we’re taking the Z13 for what it is — a gaming tablet — this performance is impressive. And, even under a heavy load, it runs quietly and relatively cool. At 2.43 pounds, it’s significantly lighter than most 13-inch or 14-inch gaming laptops. Compared to bigger, heavier 15-inch models that pack in more powerful specs at the expense of portability, the Z13’s size makes it easy to slip into a bag or carry around under my arm. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/o7xLTuUxkiUkFWAs-qP7c05bmac=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312829/akrales_220304_5054_0449.jpg\">      <figcaption><em>Performance with graphically-demanding games is hit-and-miss. Elden Ring runs on medium settings at around 25-30 frames per second.</em></figcaption>  </figure></div><div class=\"c-float-right\"><div id=\"d2im0u\"><div data-anthem-component=\"aside:11106997\"></div></div></div><p id=\"SqifbU\">But I won’t make any more excuses for it. If you really take gaming seriously, having a thicker laptop is a worthy trade-off for all-but-guaranteeing-better performance in and out of gaming. The Z13 just isn’t a product that you can safely assume will run everything well. It’s ambitious but imperfect.</p><p id=\"HZkBVi\">The Z13’s power is suitable for running a browser filled with a dozen or more tabs, as well as photo manipulation apps like Affinity Photo. But I wouldn’t recommend this to creators who are considering this as their main workstation. In our Adobe Premiere Pro render test, the Z13 took four minutes, 10 seconds to export a 4-minute, 33-second 4K video. Any computer that takes less time than the video’s runtime is nothing to sneeze at, but you can get even faster speeds with less costly laptops. It performed about half as well as the leading gaming laptops <a href=\"https://www.pugetsystems.com/benchmarks/view.php?id=82703\">in the PugetBench Premiere Pro benchmark</a>. This is another one of those “pretty impressive for a tablet” moments, but serious creators should look elsewhere.</p><p id=\"PCsfQV\">It also may simply not offer the kinds of ports that creators — or just your average person — may need. There’s a headphone jack and enough ports for just a couple of accessories. You’ll get one USB-A port, a Thunderbolt 4 USB-C port, a USB-C port, and a microSD card slot. That’s more than some laptops can claim, but I’m always hungry for more ports.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/98IlinQu4_Maxrf73KP_ZJugu8s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312826/akrales_220304_5054_0256.jpg\">      <figcaption><em>Along the right side of the tablet, there’s a headphone jack, USB-A 2.0 port, a volume rocker, and a power button.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/c7RGkop5AdNe23JIGrRDUlyqEVg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312827/akrales_220304_5054_0260.jpg\">      <figcaption><em>Where the detachable keyboard connects. Yes, we tried to connect a Surface Type Cover. And no, it didn’t work.</em></figcaption>  </figure></div></div></div><p id=\"qxuksk\">Like any laptop or tablet, there’s only so much that the Z13 can do performance-wise or to accommodate multiple accessories or displays. But as I mentioned earlier, Asus made a solution for people who are willing to throw down even more money. Asus built its proprietary PCIe port into the left side of the Z13, which is where you can plug in the powerful but very pricey XG mobile external graphics dock. And by “pricey,” I mean that it practically doubles the cost of the Z13. Alone, the XG Mobile costs $1,499.</p><p id=\"QK1dso\">This dock comes with an RTX 3080 laptop GPU with 150W of total graphics power — more or less equivalent to what you’d be able to get in a thicker gaming laptop (Asus also makes a $1,399 version of the XG Mobile that has AMD’s Radeon 6850M XT). It’s also a complete docking station, with a host of ports, including DisplayPort, HDMI, multiple USB-A ports, an ethernet jack, and an SD card slot. In short, it adds a lot of functionality to the Z13 beyond sheer graphical horsepower.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HZ3iBzFGiSdbDsWsgw8JWclPLLw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312830/akrales_220304_5054_0543.jpg\">      <figcaption><em>If you have the cash for the XG Mobile eGPU, it delivers a tremendous boost in power.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OHiG7NFk2UGkp5nIlsbj587mxeM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312822/akrales_220304_5054_0156.jpg\">      <figcaption><em>To connect the XG Mobile, it attaches and locks onto the tablet with this switch.</em></figcaption>  </figure></div></div></div><p id=\"U4Kpe4\">Unsurprisingly, plugging the XG Mobile into the Z13 turns it into a completely different machine — in a good way. <em>Cyberpunk 2077</em>, which has ray tracing settings that can bring systems to their knees, ran at 60 frames per second with DLSS switched to auto mode. It ran other games flawlessly, too. It felt like I was using a high-end gaming laptop.</p><p id=\"3yzVHb\">There are downsides, in addition to the cost. By using it, the Z13 is no longer the ultra-portable tablet that it was before. You’ll be tied down to a power outlet and the thick XG Mobile plug, and you’ll be out over $3,000 for the ability to deliver more juice to your tablet. While it’s an interesting idea that works as intended, it’s not the route that I’d recommend.</p><p id=\"Gd6Anc\">(Note: Asus offers the XG Mobile in a bundle with a Flow Z13 that has a 60Hz 4K screen for $3,299. It’s a better value if you want the faster GPU, but don’t expect to run most games well on its 4K display.)</p><p id=\"3Xyr0J\">While the Z13 is billed primarily as a gaming tablet, I enjoyed using it as a laptop, too. The keys on the included keyboard cover offer a surprising amount of travel, despite being fitted into a Surface Pro Type Cover look-a-like. Its layout retains almost all of the same keys that you’d find on something like the Zephyrus G14, but with some small sizing adjustments. One major difference here compared to most modern laptops is that this trackpad is small. But no self-respecting gamer should play without a mouse, anyway. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Z3VkD_hIpik2D-fDJhB5uL0VZZs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312819/akrales_220304_5054_0026.jpg\">      <figcaption><em>These keys feel great to type on, and they’re backlit.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UOfdBve3f9ghQjDp3DSUgoCPrbY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312823/akrales_220304_5054_0175.jpg\">      <figcaption><em>The styling on the Flow Z13’s rear isn’t subtle in the slightest.</em></figcaption>  </figure></div></div></div><p id=\"4Ft5s4\">Its 13.4-inch 1080p touchscreen has a 16:10 aspect ratio, so in landscape mode, it’ll look taller than some laptops and tablets out there. That’s great for browsing the web and general laptop usage, as it gives you more vertical space for content, but not every game supports this aspect ratio. At worst, a few of your games may run with little black bars at the top and bottom, which can be annoying. Plus, most TV shows and some movies were made to display on 16:9 aspect ratio screens, so get used to seeing those black bars on the Z13.</p><p id=\"JQiB1q\">Using Windows 11 in tablet mode is an awkward but serviceable experience. The same can be said for using the Flow Z13 as a tablet. It’s heavier and thicker than any other Windows tablet that comes to mind or something like the <a href=\"https://www.theverge.com/22979828/apple-ipad-air-2022-review\">new iPad Air</a>, an <a href=\"https://www.theverge.com/22442084/ipad-pro-2021-review-features-screen-mini-led-m1-processor\">iPad Pro</a>, or <a href=\"https://www.theverge.com/2022/2/9/22923565/samsung-galaxy-tab-s8-ultra-plus-tablets-android-price-specs-features\">Samsung’s Galaxy Tab S8</a>. Though, once the kickstand is flipped out and I’m watching movies or playing games on it from my lap or on a table, those annoyances drift away. </p><p id=\"rMyavp\">The display itself doesn’t look spectacular, especially compared to something like an iPad Pro or some other laptops in this price range. Its contrast, in particular, isn’t as rich. But it’s sharp, and Asus makes up for it with brightness, claiming up to 500 nits at peak levels. It’s more than bright enough to use near a window or outside, and it can get very dim for nighttime use, as well. </p><p id=\"YtjgFH\">Lastly, it also has a 120Hz refresh rate, which makes everything look smoother. Whether you’re gaming or just scrolling through Twitter, it makes the screen more pleasant to look at. </p><p id=\"UeuSbu\">Battery life isn’t great in the Z13, but it might be good enough to suit small gameplay sessions, video chats, or a multi-hour burst of productivity. But if you plan to get invested in a game, don’t go anywhere without the included 100W USB-C power brick, as the Z13 lasts for only about an hour per charge while running <em>Elden Ring</em> (less demanding games will allow the Z13 to survive for longer). </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QxcOXsjnFC8tT8NxEyqgnfuYhbs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312818/akrales_220304_5054_0024.jpg\">      <figcaption><em>What was a small laptop becomes a tabletop affair with the XG Mobile attached.</em></figcaption>  </figure></div><p id=\"2n0QlI\">When used as a laptop for productivity with a dozen or so Microsoft Edge tabs running, it lasted for about 4.5 hours. Perhaps it shouldn’t have come as a surprise that a tablet with a fast refresh rate screen, a high-end Intel Core i9 processor, discrete graphics, and speedy DDR5 RAM would quickly drain a 56Wh battery. Out of curiosity, I bumped the refresh rate down to 60Hz, yet the battery life was similarly mediocre.</p><p id=\"7n72nu\">If you plan to use the Z13 for work or collaborating, you should know that its webcam delivers merely passable results. The picture looks suitable in a well-lit room (perhaps a little better than what Apple’s new Studio Display initially showed us). But it doesn’t handle exposure well, nor does it compensate for less-than-ideal lighting scenarios. This is, unfortunately, par for the course with most laptops, but it’s nevertheless something I’m scrutinizing here given the Z13’s high cost. </p><p id=\"6J3ou4\">The webcam doesn’t support Windows Hello to log you in with face recognition, but its side-mounted power button has a built-in fingerprint sensor, and it logs me in to the device quickly and securely.</p><div><div id=\"AzZwU5\"><div data-anthem-component=\"aside:11106993\"></div></div></div><p id=\"XK1wkg\">The Z13 is a well-designed tablet that’s a tough sell for hardcore gamers because of its low power ceiling. It makes something like the <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">Steam Deck</a> handheld, which starts at $399, all the more attractive. With a little tinkering, it can offer a full OS, giving you flexibility to play games outside of Steam’s ecosystem.</p><p id=\"khUlrX\">In a world where Steam’s Deck is readily available for purchase, I’d recommend that instead of the Z13. But given that it’s only available on a rolling basis via preorders, I’d recommend a handful of gaming laptops instead. Assuming that all you want to do is play games, you can get way more for your money with something like <a href=\"https://www.theverge.com/22938516/asus-rog-zephyrus-g14-gaming-laptop-review\">Asus’ 2022 Zephyrus G14</a> or the <a href=\"https://www.theverge.com/22321471/asus-rog-zephyrus-g15-gaming-laptop-review\">G15</a>. Lenovo and Acer also make more cost-effective gaming laptops that could be good alternatives. Check out our <a href=\"https://www.theverge.com/22295181/best-gaming-laptop\">up-to-date buying guide for the best gaming laptops</a> that suit your budget.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/S9P_Ew7KUhOUcbeaCJ_E0bOmlg4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312820/akrales_220304_5054_0066.jpg\">      <figcaption><em>The hinge is sturdy, and it allows for many angles.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Flow Z13\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Bt5VJBoz_zgCB6QP-0KhWfbezxM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312821/akrales_220304_5054_0137.jpg\">      <figcaption><em>RGB-lit components. It’s glorious.</em></figcaption>  </figure></div></div></div><p id=\"zlKx2f\">It sounds like a failure on Asus’ part that I can’t recommend the Flow Z13 to most people. But it’s far from a total failure as a product. It offers a glimpse of how awesome the future of portable gaming will be. And none of the laptops that I just recommended come close to being as thin or versatile as the Z13.</p><p class=\"c-end-para\" id=\"NJbByd\">With that in mind, this tablet is a reminder of how awesome the <em>now </em>of portable gaming is. And the Flow Z13 is a peak example of how Asus leads the industry by actually bringing concepts like these to life — price be damned. It’s a pretty good laptop, and with expectations in check, it’s a good gaming tablet, too.</p><p id=\"CIXwFx\"></p><p id=\"TdAa0X\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MsKpBJ0MIRTE2LmdQ_5rqnn5i_s=/0x279:2040x1347/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23312825/akrales_220304_5054_0215.jpg",
  "description": "A Surface Pro look-a-like for gaming",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}