{
  "title": "Asus Zenbook Pro 14 Duo OLED review: a dual-screen laptop that works",
  "url": "https://www.theverge.com/23063863/asus-zenbook-pro-duo-14-review-screenpad-plus-dual-screen-laptop-specs-features-price",
  "date": "2022-05-09T18:11:24.000Z",
  "author": "Monica Chin",
  "content": "  <p>Finally, form and function in one</p> <p class=\"p--has-dropcap p-large-text\" id=\"JCK7vk\">Asus did it. It’s made a dual-screen laptop that — and there was a time when I never thought I’d be saying these words — is actually pretty good. </p><p id=\"qQazWN\">Asus has been doing this dual-screen form factor for a while, and parts of the $1,999.99-and -up ZenBook Pro Duo 14 OLED are nothing we haven’t seen before. Like previous models in the Duo line, there’s a big 14.5-inch screen on the top and a smaller 12.7-inch screen on the back of the keyboard deck (the ScreenPad Plus). Below that screen is the keyboard (reaching all the way to the front of said deck), with a teensy touchpad crammed to its right.</p><p id=\"6DDYNm\">But the company has made a small tweak that has made the experience significantly more comfortable: it has raised the secondary screen by 12 degrees. </p><div id=\"Z4y7gc\"><div data-anthem-component=\"scorecard:11183636\"></div></div><p id=\"n8gJ8e\">This, reader, has changed everything. You see, <a href=\"https://www.amazon.com/dp/B08QV5HGHT?tag=price04_52421-20&amp;linkCode=osi&amp;th=1&amp;ascsubtag=s1652069787058ucjua52421\" rel=\"sponsored nofollow noopener\" target=\"_blank\">last year’s 14-inch Zenbook Duo model</a> only tilted the secondary screen up by seven degrees. <a href=\"https://www.theverge.com/2020/6/9/21285164/asus-zenbook-duo-review-screenpad-plus-dual-screen-laptop-specs-freatures-price\">The 2020 model</a> was even flatter. In both cases, I was constantly craning my neck to lean over whenever I needed to see anything on the second screen. </p><p id=\"vQwr5l\">The increase to 12 degrees doesn’t look huge on paper, but it’s finally — finally — made the screen just high enough that I no longer need to crane. Right now, as I type this, I am leaning back in my office chair. I am actually reclining slightly. I can see the Pro Duo’s primary screen and can also see the content of its secondary screen just fine. I can <em>read the words</em> on the secondary screen in this reclined state. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The touchpad of the Asus Zenbook Pro 14 Duo OLED seen from above.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jP0c7FnfyJvKUW53vs1ThKkM2eE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448172/mchin_200731_5205_0013.jpg\">      <figcaption><em>In case you were skeptical about the touchpad being tiny.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The logo on the lid of the Asus Zenbook Pro Duo 14 OLED seen from above.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Dz-hPjccIq-UycsyzqxxuO21t1k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448171/mchin_200731_5205_0012.jpg\">      <figcaption><em>New logo, same concentric design.</em></figcaption>  </figure></div></div></div><p class=\"p--has-dropcap\" id=\"hd2sqF\">There are other various tweaks that make the secondary screen significantly easier to see from a distance than it has been in the past. For one, it’s brighter than last year’s, now reaching 500 nits. It’s also higher resolution (2880 x 864). And there’s a new “anti-glare etching” that keeps it from reflecting ceiling light, which has been a nuisance in the past.</p><p id=\"N7m7VO\">Folks, the second screen is… actually useful now. On previous models, it’s just been a place to throw distractions like Slack and Twitter while my real work happened on the top half. Now, I can keep reference materials down there to glance at and read while I work. </p><p id=\"Ju0Ok4\">Now, does that mean its benefits finally outweigh the compromises required in order to fit a whole second screen onto this laptop? For me, no. But we’re at the point where that’s really just a preference for keyboard location. Asus has fixed basically everything else. </p>  <figure class=\"e-image\">        <img alt=\"The Asus Zenbook Pro 14 Duo angled to the left side on a brown couch. Both screens display a multicolor background with the Asus Zenbook Pro OLED logo.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Zz6qwAv1T5Slgp4Psa1PlbB8wp4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448166/mchin_200731_5205_0004.jpg\">      <figcaption><em>If you were having trouble picturing the deck layout, just look here.</em></figcaption>  </figure><p id=\"wvP7ig\">For example, ScreenXpert. This software allows the Duo’s two screens to work together and has come a long way from the <a href=\"https://www.theverge.com/2019/10/11/20908627/asus-zenbook-pro-duo-review-screenpad-plus-dual-screen-laptop-specs-features-price\">glitchy and unresponsive mess it once was</a>. The new version that’s on this device (ScreenXpert 3) looks significantly more professional than previous iterations. It’s all snappy to use, and windows resized the way they were supposed to. And while I occasionally had to tap a button a couple times to get something to open, that was the extent of the issues I had. It’s intuitive with a remarkably easy learning curve, which has not always been the case with ScreenXpert software.</p><p id=\"N4qTe2\">There’s a taskbar (like a floating miniature Windows taskbar) with quick buttons for various features like toggling brightness, phone mirroring, opening an app navigation screen, locking the keyboard, and making all the windows on the ScreenPad disappear to display the desktop background. I was prepared to complain about the questionable utility of some of these, but it turns out that there is some amount of customization you can do in the Control Center Settings panel, which I found after a bit of exploring. You can also adjust the taskbar’s location by dragging it to the bottom or either side. </p><p id=\"kohiMt\">I remain a fan of the task groups feature (also accessible from this taskbar) which allows you to “save” a configuration of tabs and apps in an arrangement of your choice to open again at a later date. This is something I use a lot on Duo devices.</p><div class=\"c-float-right c-float-hang\"><aside id=\"tnbYpv\"><q>ScreenXpert 3 looks significantly more professional than previous iterations</q></aside></div><p id=\"eMW75K\">The other fix I’m very happy about pertains to the touchpad. The Duo 14’s touchpad is so tiny as to be basically useless. On previous models, I’ve just used a stylus for every possible situation. That’s what I was doing here — until I discovered TouchPad mode. </p><p id=\"UMiKWX\">Touchpad mode allows you to turn the ScreenPad into a giant touchpad. All you have to do is tap it with three fingers. To turn it back into a ScreenPad, you tap an X in the top-right corner. The touchpad works well and is as responsive to all the various gestures as a regular one would be. There are downsides, of course. For one, there’s no clicking mechanism (but tap-to-click does work well). You also are reaching over the keyboard to use it, which is a bit weird (but something I got used to). And the touchpad interface is opaque, so when you have it pulled up, you can’t see the other content that you have sitting on the ScreenPad. I hope Asus is able to make it even the tiniest bit more translucent in the future, but I’m still very happy to see this feature here.</p>  <figure class=\"e-image\">        <img alt=\"The ports on the right side of the Asus Zenbook Pro Duo 14 OLED.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fLyNgrjvaYlW4OZ31do3ewG_fz8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448170/mchin_200731_5205_0010.jpg\">      <figcaption><em>Two USB-C and a USB-A on the right. (There are ports on the back too.)</em></figcaption>  </figure><p id=\"3bkX6K\">The Intel Core i7-12700H inside is a mainstream processor that we’ve mostly seen in high-performance gaming laptops and workstations to date, including <a href=\"https://www.theverge.com/22928060/alienware-x14-review-gaming-laptop\">Alienware’s X14</a>. My unit also has 16GB of RAM and 1TB of storage in addition to an Nvidia GeForce RTX 3050 Ti GPU. Asus says it will cost $1,999.99, which I don’t hate for these specs. </p><p id=\"oXCks1\">The performance in my general work use cases was as good as you’d expect. I’d have Chrome tabs stacked on top of Zoom calls or YouTube streams with no issues on either screen. The RTX 3050 Ti isn’t necessarily designed for AAA gaming and is weaker than other laptop GPUs you can get at this price point, but it can certainly make older, lighter titles a possibility.</p><div class=\"c-float-right c-float-hang\"><aside id=\"JoKoju\"><q>I’d have Chrome tabs stacked on top of Zoom calls or YouTube streams with no issues on either screen</q></aside>  <figure class=\"e-image\">        <img alt=\"The lid of the Asus Zenbook Pro 14 Duo seen from above.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AKf2t6ZXhXykp8zpa-OuSHNgHD4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448168/mchin_200731_5205_0008.jpg\">      <figcaption><em>New logo, by the way.</em></figcaption>  </figure></div><p id=\"cDyEI4\">While the keyboard was sometimes warm, I never felt uncomfortable heat there or on the bottom of the device. This appears to be thanks to Asus’ new cooling system (termed “IceCool Plus”) which includes two 12-volt fans with 97 and 93 blades, respectively. Asus claims that the device stays under 28 decibels when on the Whisper Mode cooling profile and that seems accurate as far as I can tell. Even when I wasn’t on Whisper Mode, I barely ever heard the fans.</p><p id=\"kFsVim\">Battery life was more of a mixed bag. I averaged around five hours of continuous work with both screens at medium brightness. That’s obviously not close to a full day but also not a <em>terrible </em>result given that this device is running two high-resolution screens. The original Pro Duo lasted just over two and a half hours, and the gaming-oriented and way more expensive <a href=\"https://www.theverge.com/21431381/asus-rog-zephyrus-duo-15-review\">Zephyrus Duo 15</a> made it one hour and 48 minutes with this same workload. If you need a lot of juice, you can easily turn off the ScreenPad with a hotkey on the keyboard.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The keyboard deck of the Asus Zenbook Pro Duo 14 seen from above. The ScreenPad displays a multicolor background with a task bar on the left side.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kQlK7wO33diHFCKL9Ih8YB520HQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448169/mchin_200731_5205_0009.jpg\">      <figcaption><em>Look how nice it is!</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"jx7vBn\">The primary screen is 16:10 (hurray!) and is one of the first (if not the very first) 120Hz OLED displays on a laptop. The port selection is pretty good, including two Thunderbolt 4 ports, a full-sized HDMI 2.1, a USB 3.2 Gen 2 Type-A, an SD Express 7.0 card reader, and a combo audio jack. I’m glad to see this device holding onto the HDMI and SD card slot, as all kinds of other premium 14-inchers ditch them for the world of USB-C. (And this thing really should not be skimping on ports because I’ve never wanted to plug an external keyboard and mouse into something more.) There are a few Asus-specific connectivity features as well, including Wi-Fi SmartConnect, which helps the device automatically connect to the best signal in its current environment.</p>  <figure class=\"e-image\">        <img alt=\"The ports on the left side of the Asus Zenbook Pro 14 Duo OLED review.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TZeQ7C2cCZEhWy3YBhapdrl8OpU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448167/mchin_200731_5205_0006.jpg\">      <figcaption><em>Those are vents, not ports — crafty Asus!</em></figcaption>  </figure><p id=\"2GzdkS\">All this is great, which makes it even more unfortunate that I’m still not loving using it. Basically, the Pro Duo 14 has convinced me that even the best possible iteration of the dual-screen form factor isn’t enough to overcome the fact that I can’t stand having a keyboard in this position. I know some love front-mounted keyboards, and for the life of me, I will never understand you people. This is even a great keyboard. The keys are clicky with a decent 1.4mm of travel, a spec that I would usually swoon over. But I am constantly typing with my hands pressed against my chest like a <em>T. rex</em> and I hate it.</p><p id=\"qKdNNg\">I don’t know that this is something Asus can fix. I think we’re running into a wall of personal preference with this design. I will just never enjoy using a keyboard that doesn’t give me anywhere to rest my wrists. But there are absolutely people who don’t have this issue, and for you folks, I think this is legitimately a good buy.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Asus Zenbook Pro Duo 14 seen from above. Both screens display a multicolor background.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-PIN8Fen2P8eQRIAfMDi61PWSlM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448164/mchin_200731_5205_0002.jpg\">      <figcaption><em>As a frequent lap user, it’s not for me.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"SacP5b\">In the Pro Duo 14, Asus has done everything it possibly could to make a good, practical, usable dual-screen system. I legitimately think most problems that could’ve been fixed have been fixed. In our fairly critical review of the first-generation Zenbook Duo, Chaim Gartenberg wrote, “There is a great laptop buried within the raw clay.” Three years later, Asus has dug that laptop out. This is great. </p><p class=\"c-end-para\" id=\"bVy6YP\">The story with Duo laptops from here on out may just come down to whether you like having a keyboard on the front of your deck. Which, given how many other issues these devices have had in the past, is a very good sign for their future.</p><p id=\"4vfM6N\"><em>Photography by Monica Chin / The Verge</em></p><div><div id=\"fUkUpH\"><div data-anthem-component=\"aside:11183700\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/stQl-VyIMLe_N4qtmnjmWqUr9z4=/0x156:2040x1224/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23448165/mchin_200731_5205_0003.jpg",
  "description": "Asus’ latest Duo is its best yet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}