{
  "title": "Asus ROG Strix Scar 17: powerful, brash, derivative",
  "url": "https://www.theverge.com/23022171/asus-rog-strix-scar-17-inch-review-gaming-laptop-2022",
  "date": "2022-04-13T13:35:00.000Z",
  "author": "Cameron Faulkner",
  "content": "  <p>Unique in ways both good and not-so-good</p> <p class=\"p--has-dropcap p-large-text\" id=\"dcomMg\">Asus always finds a way to surprise me. It’s a company that can produce the elegant ROG Zephyrus G14 and G15 gaming laptops — up there with the best in the business in terms of design and thinness. It can also make the Flow Z13, a thin gaming tablet with powerful specs inside. Then, it can go completely in the opposite direction to make something like the Strix Scar 17, a powerful but far less refined laptop that starts at $1,999 and goes up from there. I would say that it’s a device made explicitly for gamers, but I know plenty of gamers who wouldn’t want to be seen using this thing.</p><p id=\"32RCNJ\">Its thick chassis is partially translucent, with multi-colored LEDs shining through, and the enclosure for its display has an angular cut out  — just because! You can even swap between a few included “armor caps” to give your laptop a different look from the back.</p><p id=\"NHVJ8q\">The 2022 model of the Strix Scar 17 is merely a refresh, with very little of its exterior changed from its predecessors (it still doesn’t have a webcam, for example). Most of the focus was on making significant upgrades to its internals. It’s a speed machine, with 32GB of fast DDR5 RAM, a powerful Nvidia RTX 3070 Ti graphics card, and Intel’s Core i9 12900H processor built-in. And to see all of that power on display (well, depending on the games you play), its 17.3-inch QHD panel has a fast 240Hz refresh rate. </p><div id=\"ixiEUv\"><div data-anthem-component=\"scorecard:11140857\"></div></div><p id=\"XD5m1D\">This is a laptop where you can easily see the perks of having the latest Intel and Nvidia hardware built in. The Strix Scar 17 can be relied upon to play any game at a respectable frame rate. While not necessarily unique to this model, this laptop was more than capable enough to run many of those games well on the <a href=\"https://www.theverge.com/23011794/alienware-aw3423dw-review-qd-oled-curved-gaming-pc-monitor\">Alienware QD-OLED gaming monitor</a>, which has a higher 3440 x 1440 resolution than the Strix’s built-in laptop display. </p><p id=\"eQcHX8\">This laptop can’t go toe-to-toe with the new <a href=\"https://www.theverge.com/22946280/razer-blade-17-2022-review-specs-12th-gen-performance-nvidia-rtx-3080-ti-gaming-laptop\">Razer Blade 17</a> or <a href=\"https://www.theverge.com/22765258/alienware-x17-review-4k-17-inch-gaming-laptop\">Alienware X17</a>, at least in terms of looks. Both feature a thin, impressive design with high-end build materials. But if those qualities don’t matter to you, the Strix Scar 17 might be priced more to your liking. While getting either the Blade 17 or X17 with similar specs will cost you well over $3,000,  the model that I tested costs $2,499.99 at Micro Center. So long as you don’t mind some of Asus’ minor cost-cutting measures, like making its laptop clad in plastic instead of aluminum, and other annoyances like McAfee anti-virus pop-ups, you’re getting a lot of power for your money.</p>  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hcBDLQF170tR4ciIffKGi6v4bEY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312860/cfaulkner_141231_5055_0004.jpg\">      <figcaption><em>This strip of LEDs comes alive — even while the laptop is sleeping.</em></figcaption>  </figure><div class=\"c-float-right\"><div id=\"lXG1t9\"><div data-anthem-component=\"aside:11140859\"></div></div></div><p id=\"Z2PBXF\">The Strix Scar 17’s design is excessive, in a word. Like previous iterations of this laptop, it’s dressed to the nines with RGB LED flourishes. There’s a large strip of lights going around the front of the chassis and underneath the wrist rest. The bottom edge of the display features another light strip, diffusing light (somewhat tastefully, actually) on the raised venting component. The ROG logo on the back of the display is lit and so are each of the keys on Asus’ mechanical keyboard. Needless to say, you should probably avoid this laptop if you’re after something that doesn’t have a visible RGB LED at nearly every angle.</p><p id=\"jAzvUA\">When viewed from the top-down, the chassis is bisected with a line that divides an all-black, soft-touch section with a smoky translucent section that lets you see a little into the machine, which looks cool.</p><p id=\"8A5AKS\">Taking a tour around the laptop, the Strix Scar’s keyboard, once again, delivers a brilliant typing experience. The keys are nearly silent, yet they feel tactile and fulfilling to type on. It may take a few days to get accustomed to the keyboard layout, but I’m on board with everything that Asus is going for here. There are dedicated keys raised near the top of the keyboard for volume, and the power button is far enough away from the other keys to not be pressed on accident. There are even four programmable keys that you can customize within Asus’ Armoury Crate software that’s pre-installed.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KraNgX3Q1-_wT6UvbRmOz-YBzHA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312859/cfaulkner_141231_5055_0003.jpg\">      <figcaption><em>This keyboard has everything I want, exactly where I want it.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RSY26L7N0lA72u0a2vbPPiqt5_U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312857/cfaulkner_141231_5055_0001.jpg\">      <figcaption><em>This spacious trackpad can fail to click if you put too much weight on the chassis.</em></figcaption>  </figure></div></div></div><p id=\"8meqFn\">Asus takes full advantage of the chassis real estate by including a number pad, as well as a generously sized trackpad. The trackpad itself is great, though it doesn’t click in on its right side if you lean too much weight on the center of the laptop. This shouldn’t be an issue for most people, unless you’re someone who leans their weight on the wrist rest. The plastic all around this laptop flexes quite a bit — not to a worrying degree, but it’s enough to impact the functionality in this case. Also, the laptop’s mostly plastic design creaks sometimes when I pick it up. This isn’t something that you’ll experience with Razer or Alienware’s laptops, though whether that justifies their higher prices will depend on the person. It’s worth noting that the Strix Scar 17’s build materials don’t yield a laptop that’s lighter than the competition, but I wouldn’t call it heavy. It weighs 6.4 pounds, while Razer’s all-aluminum Blade 17 is 6.06 pounds. The X17 can go up to seven pounds.</p><p id=\"r4opoh\">As for port selection, there is a headphone jack alongside two USB-A ports around the left side (down from three in past iterations). On the backside, there’s a proprietary power connector, a 2.5Gbps Ethernet jack, an HDMI 2.1 port, and two Thunderbolt 4 USB 4 Type-C ports. </p><p id=\"voJpsY\">Along the right side, there’s the Keystone II NFC physical key that can be used to securely log into the laptop, with all Asus account and device settings in tow. Additionally, it can activate a performance mode and a designated app when inserted. Conversely, you can program it to lock the computer or shut down applications when removed. It can also give access to a “shadow drive,” which can be encrypted if you have Windows 11 Pro. This is a feature that I’d expect to see on a business-class laptop, so it’s odd to see it included with a gaming laptop.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/P7HsuciL8s1Fm0Dytnsk18qTIkU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312867/cfaulkner_141231_5055_0011.jpg\">      <figcaption><em>Here’s what the plastic Keystone II NFC key looks like when it’s magnetically attached to the laptop. </em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7c2Qb8fsCrkCYnPfxnSqUqmECQY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312863/cfaulkner_141231_5055_0007.jpg\">      <figcaption><em>The rear features most of the good stuff, including Ethernet, HDMI 2.1, a Thunderbolt 4 port, and a USB-C port.</em></figcaption>  </figure></div></div></div><p id=\"cUHDNW\">Given how terrible most gaming laptop speakers are, I wasn’t expecting one of my favorite things about the Strix Scar 17 would be its speakers. On top of its full-sized keyboard that types like a dream, my music and games sound better played through this laptop’s speakers than almost any that I’ve tested before (on par or slightly below where Apple’s speakers are in the 16-inch MacBook Pro). Games have a lot more punch in their sound than what I’ve experienced with other gaming laptops.</p><p id=\"s5nKkL\">The display on the Strix Scar 17 is great while the laptop is plugged in, but a little less so while running off of its battery. That’s because there’s a feature that gradually dims and brightens the panel depending on what is displayed. It’s on by default, but it can be turned off within the Intel Graphics Command Center. Another quirk that’s hard to ignore is this laptop’s lack of a webcam. Despite adding a webcam to this year’s ROG Zephyrus G14, G15, and others, Asus still has a handful of gaming laptops without one — the Strix Scar 17 included. The top bezel seems big enough to house a small lens, so Asus’ decision to omit a webcam just feels like a miss.</p><p id=\"mzFmqk\">Otherwise, I have no complaints about the display. The configuration that I’m testing has a 17.3-inch QHD IPS panel with a 240Hz refresh rate. It supports 100 percent of the DCI-P3 color gamut, and its 300 nits of peak brightness make it just bright enough to read when it’s basking in natural light from a window. Asus offers a 1080p display option for the Strix Scar 17, but QHD is the right resolution for a 17-inch gaming laptop. 4K is still too demanding on even the best mobile hardware. By comparison, QHD isn’t as much of a challenge, yet it still looks nearly as good as 4K (not to mention, it looks dramatically better than 1080p).</p><p id=\"zL5oY7\">The Strix Scar 17 talks a big game about bringing what gamers want, and its specs mostly deliver on that promise. <em>Cyberpunk 2077</em>, currently one of the most system-intensive PC games, can run at almost 50 frames per second with QHD resolution, ultra graphics settings (DLSS on), and ray tracing settings switched on. That result is about 17fps shy of what the <a href=\"https://www.theverge.com/22946280/razer-blade-17-2022-review-specs-12th-gen-performance-nvidia-rtx-3080-ti-gaming-laptop\">2022 Razer Blade 17</a>’s RTX 3080 Ti was capable of. This is in a laptop that costs $1,500 less.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nyc7GxVwlxV6satUQxb3tZoY-6o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312865/cfaulkner_141231_5055_0009.jpg\">      <figcaption><em>You can swap out the magnetic plate on the rear for a slightly different look.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kEXFCaAfoF06oSh0ZqBlWtbSpvM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312862/cfaulkner_141231_5055_0006.jpg\">      <figcaption><em>The bottom of the display splashes some RGB lighting onto the hinge.</em></figcaption>  </figure></div></div></div><p id=\"sxMxCO\">Asus’ laptop also put up a respectable performance in <em>Red Dead Redemption 2</em>. At ultra settings (no DLSS) in QHD resolution, it achieved a smooth 65fps, while turning DLSS on yielded a 7fps boost. With every game that I tried to run, the Strix Scar 17 didn’t face many obstacles running them at their best settings. Its specs can handle most games without needing to be amped up to the laptop’s “performance” or “turbo” modes (the keyboard has dedicated buttons to do this), which boost the clock speeds of the CPU and graphics card, and then amps up the fan speed accordingly. </p><p id=\"duuDz1\">The laptop’s fans can get loud, but it’s no louder than most other high-end gaming laptops. And even at peak performance, the Strix Scar 17’s above-average speakers do an admirable job at hushing the sound of the fans (though, dialogue-heavy games won’t fare as well, so use some headphones if that applies to you). Also, on the topic of cooling, only the rear-most components of this laptop become toasty during gameplay, but not so hot that it can’t be comfortably used or handled.</p><p id=\"40iV10\">The Strix Scar 17 delivers commendable performance outside of gaming, primarily in creative-focused applications like Adobe Premiere Pro. It ripped through our export test faster than most recent laptops that we’ve tested, completing its render of our 4-minute, 33-second 4K video file in just two minutes and nine seconds. It also fared very well in the PugetBench suite of benchmarking tools for Premiere Pro, scoring 1,001, which beats every laptop we’ve tested so far in 2022 aside from <a href=\"https://www.theverge.com/22900362/msi-ge76-raider-review-alder-lake-17-inch-gaming-laptop\">MSI’s pricier GE76 Raider</a>.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ab49mLfURau7pd9HukUgIhHWDzY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312864/cfaulkner_141231_5055_0008.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>Let’s not forget the ever-practical USB-A ports and headphone jack on the left side.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Asus ROG Strix Scar 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rYojCmA-mTRVolEytyNsaV1p8zw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312858/cfaulkner_141231_5055_0002.jpg\">      <figcaption><em>This laptop’s design was clearly inspired by the Two Face character.</em></figcaption>  </figure></div></div></div><p id=\"qpNep2\">It’s practically a given that any powerful gaming laptop will have not-so-great battery life. And unfortunately, that’s the case here. Its 90Wh battery can last about three and a half hours under normal use, which I define as running a dozen or so browser tabs, music streaming, and a chat app like Slack. On the brighter side, you can recharge this year’s Strix Scar 17 via USB-C — up to 100W with a USB-C PD charger. Previous versions of this laptop all but required you to tote around its large and hefty 280W power brick. So long as you don’t plan on gaming on the go, USB-C recharging is a viable option.</p><p id=\"CqOS4V\">Asus’s Strix Scar 17 proves that you don’t need to spend a fortune to get access to a fast Intel Alder Lake processor or Nvidia’s 3070 Ti mobile graphics card. And for this model’s $2,499 price, it delivers a lot of other great things, like its tactile keyboard, sharp QHD display, booming speakers, and above-average port selection. </p><p class=\"c-end-para\" id=\"3Eop0m\">Though, you’ll find many of its best qualities in some of Asus’ other high-end gaming laptops that offer better designs. The <a href=\"https://www.theverge.com/22938516/asus-rog-zephyrus-g14-gaming-laptop-review\">new ROG Zephyrus G14</a> likely can’t stack up with its power. But its <a href=\"https://shop-links.co/cg1qoFEHm0D\" rel=\"sponsored nofollow noopener\" target=\"_blank\">new ROG Zephyrus M16</a>, for example, has similar specs to the Strix, packed into a sharper design that has a webcam. Additionally, it has a taller 16:10 aspect ratio, though slightly smaller screen. Crucially, the M16 is $300 less than the model that I reviewed, costing $2,149.99 — almost $300 less than the Strix. While its GPU’s total graphics power is likely less than the Strix Scar 17’s, the M16 may be a solid alternative if you know you want a powerful Asus laptop.</p><div><div id=\"DYyUMg\"><div data-anthem-component=\"aside:11140894\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/AaRgQRqNTEWyGpF_hwuBx-k1LVE=/0x150:2040x1218/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23312861/cfaulkner_141231_5055_0005.jpg",
  "description": "A great option in terms of power and price, but not looks",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}