{
  "title": "AT&T will now use a device’s GPS location to route 911 calls",
  "url": "https://www.theverge.com/2022/5/10/23065777/att-route-911-calls-gps-location-based-routing",
  "date": "2022-05-10T21:19:48.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PsTp619JyEdMrUttnj8S8s-mHKE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70854145/acastro_180322_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"s7MoZv\">AT&amp;T says it’s the first carrier to deploy location-based routing for 911 calls across the country, a feature that allows the company to transmit wireless emergency calls to the correct call center based on a device’s GPS location. As announced in <a href=\"https://about.att.com/story/2022/nationwide-location-based-routing.html\">a press release</a>, AT&amp;T says the feature should enable the carrier to accurately locate and route 911 calls within 50 meters of where the call was placed.</p><p id=\"vRQLkA\">AT&amp;T previously routed calls based on the location of the cell tower that picked up the call signal, an area that could cover up to a 10-mile radius. This means a call center miles away — or even a whole town over  — could receive your call, potentially delaying the time it takes for emergency services to reach your precise location. In theory, location-based routing is supposed to help solve this problem by connecting callers with the appropriate call centers for the fastest response times.</p><div class=\"c-float-right\"><aside id=\"4VGkEx\"><q>AT&amp;T won’t use the feature to track the location of mobile devices</q></aside></div><p id=\"pBi7Hh\">As pointed out by <a href=\"https://www.fiercewireless.com/wireless/att-rolls-out-gps-based-routing-wireless-9-1-1-calls\"><em>Fierce Wireless</em></a>, AT&amp;T said it won’t use the feature to track the locations of mobile devices and that it’s only turned on when you place a call to 911. An AT&amp;T spokesperson further clarified to the outlet that only the dispatchers at the call center will receive your location information. In 2019, a report from <a href=\"https://www.vice.com/en/article/nepxbz/i-gave-a-bounty-hunter-300-dollars-located-phone-microbilt-zumigo-tmobile\"><em>Motherboard</em></a> revealed that mobile carriers were <a href=\"https://www.theverge.com/2019/1/8/18174024/att-sprint-t-mobile-scandal-phone-location-tracking-black-market-bounty-hunters-privacy-securus\">reselling users’ location data</a> that ultimately wound up on the black market, available for bail bondsmen and bounty hunters to purchase.</p><p id=\"pphUnH\">Location-based routing won’t be available nationwide to start. So far, the feature has gone live in Alaska, Colorado, Hawaii, Idaho, Montana, Oregon, Washington, Wyoming, Kansas, Illinois, Iowa, Minnesota, North Dakota, Missouri, Nebraska, South Dakota, and Guam. AT&amp;T says it will add support for “additional regions” over the course of the next several weeks and expects nationwide support “by the end of June.” In 2020, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.t-mobile.com%2Fnews%2Fnetwork%2Ftmobile-next-generation-911-location-based-routing&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F10%2F23065777%2Fatt-route-911-calls-gps-location-based-routing\" rel=\"sponsored nofollow noopener\" target=\"_blank\">T-Mobile announced</a> it was launching location-based routing; however, it still hasn’t been made available nationwide.</p><p id=\"ojTKMA\">Last year, the Federal Communications Commission (FCC) ordered AT&amp;T, T-Mobile, and Verizon to <a href=\"https://www.fiercewireless.com/regulatory/at-t-t-mobile-verizon-7-day-timeline-for-911-vertical-location-data\">transmit vertical location (z-axis) information</a> to call centers with the goal of helping dispatchers identify the precise location of a caller from within a multi-story building. After <a href=\"https://www.fiercewireless.com/regulatory/fcc-commissioners-say-911-vertical-location-settlements-let-carriers-off-hook\">missing a deployment deadline</a> set by the FCC, the agency is giving carriers until June 2nd, 2022, to certify their deployment.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IzojXk4f9MzzwbyRZinGMcHL7Pg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10690893/acastro_180322_1777_0001.jpg",
  "description": "The carrier’s tracking only turns on if you call 911",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}