{
  "title": "Audi’s latest concept car is an oversized urban EV that shouldn’t be legal in cities",
  "url": "https://www.theverge.com/2022/4/19/23029320/audi-urbansphere-concept-electric-size-specs",
  "date": "2022-04-19T11:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/td31L8M00aqsvmRggiW74Y7f1EQ=/0x207:4961x3514/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70765762/A221601_large.0.jpg\" />    </figure>  <p id=\"qD9dI5\">Audi completed its luxury concept car triptych with the unveiling of the Urbansphere, a massive, fully autonomous people mover that somehow manages to be entirely too large for the streets it’s designed to travel. </p><p id=\"B1oYE4\">Audi says the Urbansphere was designed “for use in traffic-dense Chinese megacities, although the concept is also suitable for any other metropolitan center in the world.” And yet the vehicle’s staggering size — a whole two feet longer than the 2022 Cadillac Escalade — practically disqualify it from being driven on any city street, regardless of country of origin. </p><div class=\"c-float-right\"><aside id=\"ga1MGt\"><q>Its minivan-esque appearance in the renderings is misleading</q></aside></div><p id=\"XQHI7u\">Its minivan-esque appearance in the renderings is misleading, based on the numbers provided by Audi. The automaker describes the Urbansphere as “the largest model in the sphere family and of all Audi concept cars to date.” </p><p id=\"pSWRSe\">The vehicle’s dimensions are certainly impressive from a clinical standpoint: 5.51 meters (18 feet) long, 2.01 meters (6.6 feet) wide, and 1.78 meters (5.8 feet) high. But the idea of this land yacht steering itself (of course, it’s an autonomous concept) through a pedestrian-and-cyclist-dense environment is enough to make even the most grizzled urban dweller break out in a cold sweat. </p><div id=\"OQ2efY\"><div data-anthem-component=\"gallery:11149602\"></div></div><p id=\"0hJIAT\">Larger vehicles have been linked to a rise in injury and death across the US, especially in dense cities where vulnerable pedestrians and cyclists intermingle with cars, trucks, and buses. <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S2212012221000241#:~:text=Pedestrian%20deaths%20have%20recently%20increased%20in%20the%20US.&amp;text=The%20analysis%20makes%20use%20of,the%20US%20spanning%202000%E2%80%932019.&amp;text=Results%20suggest%20that%20metropolitan%20areas,greater%20rates%20of%20pedestrian%20fatalities.\">Recent studies</a> have shown that cities with more growth in large vehicles suffered greater rates of pedestrian fatalities.</p><p id=\"XINOxu\">It’s hard to know exactly what Audi’s designers and engineers were thinking when they first sketched out this idea with an eye toward maximum dimensions. Naturally, we should take the company at its word when it says that the cavernous interior “acts as a lounge on wheels and a mobile office, serving as a third living space during the time spent in traffic.”</p><p id=\"eV3Qon\">Traffic, of course, is a problem that seems to be getting worse and worse thanks to the swollen SUVs and trucks that are clogging the streets in ever-increasing numbers. At its core, traffic is a geometry problem; the vehicles get larger and larger, while the roads stay more or less the same size. Congestion becomes unavoidable. </p><div class=\"c-float-right\"><aside id=\"ndKhMb\"><q>It’s hard to know exactly what Audi’s designers and engineers were thinking</q></aside></div><p id=\"bAMqL8\">While the words “pedestrian” or “cyclist” make no appearance in Audi’s announcement of the Urbansphere, the automaker notes that an LED display in the vehicle’s grille can be used for “communication.” Lighting symbols can be used to signal intent to other road users, such as left or right turns. Illuminated “eyebrows” can translate as turn signals, and so forth. </p><p id=\"Ao5bfm\">Of course, this is just a concept, and there’s no guarantee that Audi will ever commit to putting the Urbansphere — or anything like it — into production. The automaker has plenty of gigantic SUVs in its lineup, including the forthcoming Q9, which is expected to go into production this year. </p><p id=\"BqDL6l\">Urbansphere is Audi’s third in a series of three concept cars that the German automaker said would “reinvent mobility as we know it today.” <a href=\"https://www.theverge.com/2021/8/12/22621735/audi-skysphere-concept-car-autonomous-electric-transformer\">The first was the Skysphere</a>, a sleek, villainous-looking electric convertible with an adjustable chassis. Next was the <a href=\"https://www.theverge.com/2021/9/2/22653897/audi-grandsphere-concept-autonomous-electric-interior-pics\">Grandsphere</a>, a spacious electric sedan with an interior that looks like it was designed by a Kardashian.</p><p id=\"OpN9Xk\">Audi is using the term “sphere,” which is a three-dimensional representation of a ring, to describe each of these concepts — but somehow thought it only needed three concepts, rather than four, like the four rings that comprise the automaker’s logo. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iMcjjYEkFf_LdQv5jgxP9uwf5NM=/0x562:4961x3159/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23395968/A221601_large.jpg",
  "description": "Two feet longer than the Cadillac Escalade",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}