{
  "title": "Audi vehicles are getting a native Apple Music app",
  "url": "https://www.theverge.com/2022/5/20/23132360/audi-apple-music-mmi-2022-ota-update-streaming",
  "date": "2022-05-20T15:41:49.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/du4s4cx7TotbcuvS-kkf1d9teGM=/0x27:2988x2019/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70892322/A222721_large.0.jpg\" />        <figcaption>Image: Audi</figcaption>    </figure>  <p id=\"eAudXl\">Audi is <a href=\"https://www.audi-mediacenter.com/en/press-releases/audi-adds-apple-music-to-a-wide-range-of-its-models-14666\">adding Apple Music into its cars’ infotainment systems</a>, giving drivers the ability to listen to their playlists and catch up on podcasts without the need for any additional device. This marks the second Volkswagen group automaker to get the integrated streaming music service, as Porsche had <a href=\"https://www.theverge.com/2019/8/20/20813467/porsche-taycan-apple-music-built-in-carplay-all-electric-vehicle-car\">already added the feature</a> into its all-electric Taycan.</p><p id=\"7wwUf2\">“Integrating Apple Music into the Audio infotainment system marks the next step in the collaboration between Audi and Apple,” said Audi’s head of product marketing Christiane Zorn. It shows that Apple is more willing to hand automakers the keys to its music streaming platform, giving drivers more choices on using the service instead of being locked into using Apple CarPlay or resorting to Bluetooth from a smartphone.</p><div class=\"c-float-right\"><aside id=\"6Wls7S\"><q>Nearly all Audi vehicle models 2022 and newer will get Apple Music</q></aside></div><p id=\"SraO9k\">Nearly all Audi vehicle models 2022 and newer will get Apple Music in North America, Europe, and Japan. Current 2022 models on the road will get it via an automatic over-the-air software update. Once the update completes, owners can find the Apple Music icon on their Audi’s infotainment screen, open it, and follow the instructions to log in with Apple ID and enter a verification code.</p><p id=\"eDnywJ\">Apple knew it needed to add its music service on multiple platforms to <a href=\"https://www.theverge.com/2022/1/20/22892939/music-streaming-services-market-share-q2-2021-spotify-apple-amazon-tencent-youtube\">challenge rival Spotify for market dominance</a>. It launched <a href=\"https://www.theverge.com/2015/11/10/9705434/apple-music-android-launch\">Apple Music on Android</a> in 2015 and added apps to <a href=\"https://www.theverge.com/2019/3/13/18264267/apple-music-now-available-amazon-fire-tv\">other platforms like Amazon Fire TV</a>, <a href=\"https://www.theverge.com/2021/10/27/22727865/sony-ps5-apple-music-app-streaming-game-console\">PS5</a>, and, <a href=\"https://www.theverge.com/2022/5/2/23053535/roku-apple-music-app-subscriptions-tv\">most recently, Roku</a>. But when it came to automakers, Apple preferred them to integrate CarPlay over a native infotainment solution. With CarPlay available in nearly every new vehicle out there, Apple is probably no longer worried about the adoption of its iPhone integration system.</p><p id=\"rwkOun\">One major holdout of Apple integration is Tesla. The electric vehicle company hasn’t shown interest in adding CarPlay like other automakers, preferring to use its own operating system to run music apps. Services like Spotify and Tidal are available in Teslas, and while <a href=\"https://www.idropnews.com/rumors/apple-music-may-soon-be-coming-to-teslas-vehicles/149974/\">there was a hint</a> that Apple Music was being tested, it never came to fruition — but <a href=\"https://www.theverge.com/2022/5/9/23063771/tesla-android-carplay-hack-raspberry-pi-web-browser\">maybe you can hack it in</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1Z7pr7De9QvXyGgfl71yPGoDXu0=/0x241:2988x1805/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23577027/A222721_large.jpg",
  "description": "Audi vehicles will play Apple Music without CarPlay.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}