{
  "title": "Audi is bringing 5G connectivity to its vehicles in 2024",
  "url": "https://www.theverge.com/2022/2/22/22945823/audi-verizon-5g-connectivity-2024-v2x",
  "date": "2022-02-22T17:26:23.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/UX_STGAFcq6Lzr0omGaCgxKiwa0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70537078/pesposito_210615_4857_0016.0.jpg\" />        <figcaption>Photo by Phil Esposito / The Verge</figcaption>    </figure>  <p id=\"xYERxD\">Audi of America and Verizon are teaming up to add 5G connectivity to the automaker’s lineup by 2024, the companies announced. The improved connectivity will mean better software performance, enhanced navigation, and faster music and video streaming capabilities.</p><p id=\"DKmEK1\">It’s the latest deal to bring faster network speeds to new model vehicles with more advanced software needs than analog cars of the past. It also comes as car companies explore new technologies, such as vehicle-to-everything (V2X) communication, that could enhance safety and drive quality in the future.</p><p id=\"cQpCzz\">Audi and Verizon say the plan is to bring 5G Ultra Wideband technology to the automaker’s vehicle lineup, starting with model year 2024. The improved connectivity will pave the way for new features, such as “augmented mobile services, new driver-assistance features, and connectivity-enabled innovations for the automated future of driving,” the companies say.</p><div class=\"c-float-right\"><aside id=\"MkmlVq\"><q>Audi touted its position as one of the first automakers to introduce in-vehicle Wi-Fi</q></aside></div><p id=\"bVE0Am\">Audi touted its position as one of the first automakers to introduce in-vehicle Wi-Fi, as well as 4G LTE connectivity, starting with the Audi A3 sedan in 2015. “We will be among the first to bring the next generation of connectivity to our customers in the US,” said Filip Brabec, senior VP of product planning at Audi of America, in a statement.</p><p id=\"4FDQgs\">5G, so named because it is the fifth generation of cellular technology, has the potential to be 100 times faster than 4G LTE, but for many smartphone owners, <a href=\"https://www.theverge.com/2021/2/22/22292074/5g-nationwide-verizon-att-tmobile-c-band\">it’s been a mixed bag</a>. The infrastructure is taking longer to build than originally expected, and most smartphones that claim to use 5G aren’t any faster than 4G. </p><p id=\"xGeBdP\">Audi was also one of the first companies to experiment with V2X communication, demonstrating a new feature that lets its cars communicate with a municipal traffic system to make intelligent predictions about traffic conditions. According to the company, vehicle-to-infrastructure communication, in particular, brings a high-tech sheen to the instrument panel and helps upsell customers on the subscription packages required to access new features.</p><p id=\"dyMuq0\">But the auto industry was slow to develop V2X technology, and the rollout has been piecemeal. Mercedes installed V2V equipment in both the 2017 <a href=\"https://www.theverge.com/2016/1/10/10746250/mercedes-benz-e-class-announced-detroit-auto-show-2016\">E-Class</a> and 2018 S-Class. General Motors also introduced V2V in the <a href=\"https://www.theverge.com/2017/3/9/14869110/cadillac-cts-sedan-v2v-communication-dsrc-gm\">Cadillac CTS</a> in 2017. Other automakers began looking closely at a newer technology called cellular V2X (C-V2X), using existing cell networks to send communications.</p><p id=\"yWhgGj\">In 2017, the Trump administration announced that it was killing an Obama-era mandate that would have required new cars to be equipped with V2V technology. And last year, tensions escalated when the FCC put out a new plan to use some of the spectrum set aside for V2X to expand Wi-Fi instead. <a href=\"https://docs.fcc.gov/public/attachments/DOC-360918A1.pdf\">Calling V2X “a promise unfulfilled,”</a> FCC Chairman Ajit Pai proposed to make the lower 45MHz of the band available for unlicensed uses such as Wi-Fi and allocate the upper 20MHz for C-V2X.</p><p id=\"pdVYLB\">When cars talk with each other, they do it by exchanging data wirelessly over an unlicensed spectrum called the <a href=\"https://www.its.dot.gov/factsheets/dsrc_factsheet.htm\">Dedicated Short Range Communications</a> (DSRC) band, using technology similar to Wi-Fi. The FCC has set aside spectrum in the <a href=\"https://www.fcc.gov/news-events/blog/2016/06/08/defining-auto-safety-life-59-ghz\">5.9GHz band</a> specifically for this purpose, and it is only meant to be used for vehicle-to-everything (V2X) applications. That includes vehicle-to-vehicle (V2V), vehicle-to-infrastructure (V2I), and vehicle-to-pedestrian (V2P) — so cars talking to other cars, to traffic signals, to the phone in your pocket... you name it.</p><p id=\"mEqGXk\">Other automakers are also making deals to bring 5G into their own vehicles. Last year, <a href=\"https://www.theverge.com/2021/8/19/22631247/gm-att-5g-car-chevy-cadillac-gmc-2024\">General Motors and AT&amp;T made a similar deal</a> to equip all model year 2024 Chevrolet, Buick, Cadillac, and GMC vehicles with 5G. </p><p id=\"6fYtAE\">Audi says it stands ready to “collaborate with state departments of transportation, infrastructure providers, and technology providers to develop direct C-V2X communication that can protect vulnerable road users, including pedestrians, school children, road maintenance crews, and cyclists.”</p><p id=\"mwlX8z\"></p><p id=\"10Hkwy\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/78UxIQ6i2oregVF9P8sPbksBy5o=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22978057/pesposito_210615_4857_0016.jpg",
  "description": "The new connectivity could enable better safety.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}