{
  "title": "Audi A6 Avant E-tron concept is an elegant electric wagon that looks production-ready",
  "url": "https://www.theverge.com/2022/3/16/22979186/audi-a6-avant-e-tron-concept-sportback-specs",
  "date": "2022-03-16T22:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/oHwJYNYd6PZxoykbpCLzPKnG3QQ=/0x207:4961x3514/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70632677/A221151_large.0.jpg\" />        <figcaption>Audi</figcaption>    </figure>  <p id=\"Y1VYCH\">Audi unveiled its latest concept car, the A6 Avant E-tron, a luxury executive car that appears to be relatively close to production-ready. </p><p id=\"zzhH9K\">Audi surprised us last year with a concept version of an <a href=\"https://www.theverge.com/2021/4/19/22391245/audi-a6-e-tron-concept-porsche-auto-shanghai-2021\">all-electric A6 sedan</a>, which will be built on a new EV platform the company is co-developing with sister company Porsche. The two Volkswagen group companies are calling the new EV architecture Premium Platform Electric, or PPE. They first started <a href=\"https://www.autoblog.com/2020/04/02/audi-porsche-ppe-platform-electric-cars/\">talking about it a few years ago</a>, and it’s slated to power the larger vehicles in Audi’s and Porsche’s forthcoming electric stables. </p><div class=\"c-float-right\"><aside id=\"aYU1FO\"><q>It’s also at least Audi’s <em>fourth</em> distinct platform for its EVs</q></aside></div><p id=\"bDbvjr\">It’s also at least Audi’s <em>fourth</em> distinct platform for its EVs. Audi adapted one of its internal combustion platforms to include batteries and electric motors for the original E-tron and E-tron Sportback. The company is using the Porsche Taycan’s J1 platform to power <a href=\"https://www.theverge.com/2021/2/9/22274376/audi-etron-gt-rs-electric-car-specs-price\">the E-tron GT</a>. And it’s building the <a href=\"https://www.theverge.com/2021/4/14/22382663/audi-q4-etron-sportback-electric-suv-volkswagen-price-specs-release-date\">Q4 E-Tron and Q4 Sportback E-tron</a> on Volkswagen’s modular MEB platform.</p><p id=\"OS5B0l\">The A6 Avant E-tron is the first “completely tangible look at future production models” that will be built on the PPE platform, Audi Board Member for Technical Development Oliver Hoffmann said in a statement.</p><div id=\"c1S6Xv\"><div data-anthem-component=\"gallery:11099098\"></div></div><p id=\"KiRfbM\">A lot of this ultimately won’t matter much to customers, as it’s not like these Audi EVs will say “powered by Porsche” on the steering wheel or the exterior badging. But there are vast resources in the Volkswagen Group — especially as it tries to break Tesla’s early hold on the EV market — and Audi is clearly trying to leverage the best of what’s available across the larger conglomerate to make a big mark with its electric vehicles.</p><p id=\"oKktRk\">Calling the A6 Avant E-tron “production-ready” is no hyperbole; Audi itself describes the concept as “production-oriented,” meaning this car is likely destined for the assembly line in the near future. </p><p id=\"Agmy6y\">If that turns out to be true, the A6 Avant E-tron will earn the distinction of Audi’s longest-range EV to date, with 700 kilometers (435 miles) of estimated range using the European WLTP standard, depending on the drive system and model variant. The sportback will be quick, too, sprinting from 0 to 100 km/h (62 mph) in less than four seconds. And with its 800-volt system and a charging capacity of up to 270 kW, it can take in enough electrons in just 10 minutes at a fast-charging station to drive about 300 kilometers (186 miles). </p><div class=\"c-float-right\"><aside id=\"C7tvzc\"><q>The A6 Avant E-tron will be similar in size to the Audi A6 and A7</q></aside></div><p id=\"7vBYds\">The A6 Avant E-tron will be similar in size to the Audi A6 and A7, at over 16 feet long, 6.4 feet wide, and 4.7 feet tall. The wagon’s profile looks sleek, and Audi is hoping to squeeze some extra range out of its aerodynamic design. The shape is meant to reduce aerodynamic drag, with Audi claiming a coefficient of 0.22 — just a few notches above Mercedes-Benz’s claimed record-setting 0.20 drag coefficient for the EQS sedan. </p><p id=\"A3tuR4\">Much like with the A6 E-tron concept, the A6 Avant E-tron will feature “Digital Matrix LED” headlights (which are only available outside the US, though we recently just updated our regulations allowing for more smart headlights). These lights, which use a complex shutter system to sculpt the LED light into specific shapes and animations, can now project an Audi-developed video game on a nearby wall or garage door.</p><p id=\"m64xL7\">Four LED projectors in the corners of the vehicle can create turn signal animations on the road. And three of them embedded in each side of the bodywork can do everything from present welcome messages on the ground for the driver and their passengers to warn cyclists that a door is about to open.</p><p id=\"r7GuRx\">The A6 Avant E-tron is not a vision of the far-flung future where autonomous vehicles double as rolling luxury lounges, like <a href=\"https://www.theverge.com/2021/9/2/22653897/audi-grandsphere-concept-autonomous-electric-interior-pics\">Audi’s Grandsphere and Skysphere concepts</a>. Its a more grounded peek at what is coming right around the corner, namely sleek, well-crafted, expertly appointed luxury EVs that are elegant and spacious enough to serve as chauffeured vehicles for 1 percenters. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n3FyKSGaMHCUolE-DP0DtZtZus4=/0x562:4961x3159/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23317587/A221151_large.jpg",
  "description": "It looks close to being production-ready.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}