{
  "title": "Aura Strap 2 review: context — you love to see it",
  "url": "https://www.theverge.com/23066781/aura-strap-2-review-apple-watch-bia",
  "date": "2022-05-11T16:00:00.000Z",
  "author": "Victoria Song",
  "content": "  <p>Finally, a body composition gadget that won’t tell you to just lose weight</p> <p class=\"p--has-dropcap p-large-text\" id=\"UWUbvE\">While smart scales have been around for ages, body composition analysis is still a fairly new feature for wearables. Case in point, the <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Samsung Galaxy Watch 4</a> was the first smartwatch to natively include the feature. Amazon’s Halo Band was the first fitness tracker with the feature. Both of these launched in the past two years. Meanwhile, Apple has yet to tackle body composition. For Apple Watch owners, you’ll have to turn to accessories like the $149 Aura Strap 2. </p><p id=\"swx1fZ\">Like smart scales, the Aura Strap 2 determines your body composition via <a href=\"https://www.theverge.com/2021/8/12/22621600/samsung-galaxy-watch-body-fat-composition\">bioelectric impedance analysis</a> (BIA). BIA works by sending a weak electric current through your body to calculate your body fat percentage, lean muscle mass, water, and sometimes niche metrics like bone mass. This particular strap measures fat, muscle, water, visceral fat (the <a href=\"https://www.webmd.com/diet/what-is-visceral-fat\">dangerous kind of fat</a>), protein, lean mass, and minerals (a proxy for bone mass). </p><div id=\"9Cm7iw\"><div data-anthem-component=\"scorecard:11186627\"></div></div><p id=\"1EGlLV\">Compared to the company’s first iteration of the device, this one is 20 percent slimmer and 5 percent narrower. The measurement process has also been simplified. Instead of taking three steps on the original Aura Strap, all you have to do is touch your palm to the strap’s electrode and wait 30 seconds. Purportedly, these design changes enable Aura to record 16 times more data, and Aura Devices claims the second-gen strap delivers about 95 percent accuracy compared to a DEXA scan — the clinical gold standard for determining body composition. </p><p id=\"Aed6Mv\">That’s already a significant overhaul, but the Aura Strap 2 also changes how you put it on. Instead of clasps, it now opts for a stretchable band that resembles Apple’s Solo Loop band. That can be a pro or con. If you’re using the Apple Watch primarily for health tracking, then you’re probably already aware of how important fit is. Loose fits make for inaccurate metrics, so you want the BIA sensor to rest flush against your skin. That’s harder to do with a stretchy band. Out of the box, the Aura Strap 2 comes with the medium-sized strap preinstalled and three additional sizes in extra small, small, and large. The medium strap did not fit my tiny bird wrists. Neither did the small. Thankfully, the extra small did the trick — though I have friends with even smaller wrists than mine. If your wrist doesn’t quite fit one of the four straps, you’re out of luck because there’s no way to adjust the strap.</p>  <figure class=\"e-image\">        <img alt=\"The Aura Strap 2 on a colorful background\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Lb7Nek8ij9_5VfFBA5VKyxIxV-s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450862/vsong_220509_5206_0005.jpg\">      <figcaption><em>The Aura Strap 2 band is similar to Apple’s Solo Loop</em></figcaption>  </figure><p id=\"qKjD2y\">But while the extra small band fit my wrist, it was a pain to stretch over my hands. I have larger-than-average hands, and there’s only so much you can stretch the strap. (I can use an iPhone 12 Pro Max single-handed with zero problems, and my fingers can stretch nine keys on a piano.) Thankfully, the company says it’s safe to take into the shower and pool, meaning you don’t have to take it off more than once a day. So while I normally take off my Series 7 to shower — you gotta let your wrists breathe, folks! — I kept it on to avoid taking the strap off. I also dreaded putting on the strap in the morning and taking it off at night. I’ll admit that this may be a problem that’s specific to my body, but it’s something to be aware of if you have large hands.</p><div><aside id=\"5X5cr1\"><q>The Aura Strap 2 is refreshingly simple to use</q></aside></div><p id=\"gl8Xob\">Another strap-related gripe: to change strap sizes, you have to open the casing that houses the battery and electrode. The annoying thing is you can’t simply pop it open with your fingers. The strap comes with a little guitar pick that you use to wedge it open, but if you’re like me, you’ll probably lose it within seconds. But at least you can also use a credit card. This is tedious if you need to try multiple bands to find your correct size, though it isn’t likely to be a huge issue beyond setup and when you need to replace the battery itself. Aura says the coin cell battery should last about six months if you take a single reading per day. I can’t say whether that’s true, as I haven’t been using the strap for that long. However, after about a week of testing with 2–3 tests per day, I have about 76 percent left.</p><p id=\"XDgiFk\">Otherwise, the Aura Strap 2 is refreshingly simple to use. There are clear instructions on how to take measurements both in the iPhone app and on the watch itself. To take a reading, all you have to do is put your palm against the electrode with the Aura app open on the watch. Aura does recommend that you stand with your arms out in front of your chest — sort of like you’re about to do a Russian squat dance without the actual squat — but that’s it. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sv5TRqMO5JvUEg6S7Bkj65EWcGo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450861/vsong_220509_5206_0004.jpg\">      <figcaption><em>You can see clear illustrated instructions for how to take a measurement.</em></figcaption>  </figure></div><p id=\"cmftem\">This is a huge step up from the Galaxy Watch 4. When I reviewed the BIA feature on that watch, Samsung gave me a laundry list of things I had to check to get an accurate reading. That list included making sure I wasn’t menstruating or wearing jewelry. It was annoying to use if you wore the watch on your right wrist, as you had to <a href=\"https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/5b2812ea785b8a973f9f99ed6949b9aa.jpg\">reach around to access the buttons</a>. None of these was an issue with the Aura Strap 2. While it did recommend taking measurements at around the same time each day, I didn’t have to worry about my period, my jewelry, or which wrist I wore the Series 7 on, as Apple lets you customize your watch’s orientation.</p><p id=\"eCqoL9\">My results were also consistent from reading to reading. They also roughly correspond to results I got on the Galaxy Watch 4 and the <a href=\"https://www.theverge.com/22834452/amazon-halo-view-review-fitness-trackers\">Amazon Halo View</a>. However, unlike those devices, the Aura app gave me much better context for how these metrics related to each other. Every other device has told me that I’m overweight or obese based on body fat percentage. While body fat percentage is more helpful than BMI, it’s an incomplete picture. For instance, my <a href=\"https://www.webmd.com/fitness-exercise/what-is-waist-to-hip-ratio\">waist-to-hip ratio</a> — another method of measuring your risk of heart disease based on your abdominal fat — is well within a normal range. Also, my smart scale generally puts me at 27–31 percent body fat. Basically, you should always keep in mind these devices can help you measure progress, but they may not be accurate when it comes to your specific health.</p>  <figure class=\"e-image\">        <img alt=\"The Aura app on an iPhone showing measurement results and tips to reach a goal.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1tHX62YtVL42_n2sFxM7LpVQ4KE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450858/vsong_220509_5206_0001.jpg\">      <figcaption><em>The Aura app does a good job of providing context to your results and how they relate to your goals.</em></figcaption>  </figure><p id=\"BNvhI6\">That’s why I was impressed when the Aura app said that while my body fat percentage was a smidge above normal range, I had an overall “good balance of fat and muscle.” Generally, you don’t get much more than straight numbers with body composition features. I also appreciated how the app described each metric and how I should interpret it. For example, my visceral fat percentage was 1 percent. Normally, I’d think that’s an excellent thing. However, the app noted that having visceral fat below the normal range might indicate I don’t have enough for my bodily needs and to check with my doctor if my visceral fat was out of range for a sustained period of time. It also explained that the “norm” was based on the general population and did not necessarily take into consideration my individual metabolism, lifestyle choices, or my personal norms. </p><div class=\"c-float-left c-float-hang\"><aside id=\"4WEhoK\"><q>I also appreciated how the app described each metric and how I should interpret it</q></aside></div><p id=\"YRs8A2\">If you do have a specific body goal — whether it’s to lose weight or get jacked — the Aura app will also contextualize where you’re at and how to get there. I set my goal as an “athletic” body with muscle gain. The app, in turn, told me I’m about 80 percent of the way there already and recommended I increase my caloric intake by 10–15 percent, add more protein to my diet, and do no more than three workouts per week. </p><p id=\"JGenmz\">The best part is that weight is not a big focus of this app. You do have to input it initially, but even if you set your goal to lose fat, it never recommends that you “lose weight.” Instead, it recommends that you reduce your carb and sweets intake for two weeks and cross-train. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VN0twd4wEcwimretZ_4trjvd3MY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450859/vsong_220509_5206_0002.jpg\">      <figcaption><em>One downside of the design is you have to pop open the case housing the electrode with a guitar pic to swap straps or change the battery.</em></figcaption>  </figure></div><p id=\"TLc5NM\">But while I appreciated the extra analysis and context, I didn’t love that a lot of it is locked behind a paywall. If you want monthly reports on fitness and nutrition, guided workouts, or an upcoming feature that lets you chat with a personal trainer, you have to pay $9.99 monthly or $79.99 annually. I can’t definitively say whether the extra fee is worth it, as I tested a pre-launch version of the app. The workout library I had access to was simple and easy to follow but limited to one workout per body area and skill level (beginner, intermediate, advanced). Likewise, I didn’t get the full monthly report experience as I’ve only been testing for a couple weeks. You’re already spending $150 on an accessory. Adding a subscription makes business sense, but it’s yet another thing to pay. And people who’d be inclined to buy this device likely already pay for multiple fitness-related subscriptions. </p><p class=\"c-end-para\" id=\"qYpi8R\">Ultimately, I was pleasantly surprised by the Aura Strap 2. It’s not perfect, but then again, few accessible body composition gadgets are. What sets this apart is a better app that offers holistic insights and context. It’s admittedly a niche product, but if you’re an Apple Watch owner who’s interested in changing your body composition? You could do much, much worse. </p><p id=\"okbVDT\"><em>Photography by Victoria Song / The Verge</em></p><div><div id=\"s9e7rK\"><div data-anthem-component=\"aside:11186655\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/OoamvNnb4K5ZVyxNEmqbGh2UWJs=/0x284:2040x1352/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23450863/vsong_220509_5206_0006.jpg",
  "description": "For once, a body composition device that adds extra context",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}