{
  "title": "AWOL LTV-3500 ultra-short throw projector review: the bright stuff",
  "url": "https://www.theverge.com/23056908/awol-vision-projector-review-short-throw-tv-replacement",
  "date": "2022-05-05T10:10:00.000Z",
  "author": "Thomas Ricker",
  "content": "  <p>Can replace a TV if you don’t mind an even bigger gray rectangle</p> <p class=\"p--has-dropcap p-large-text\" id=\"bhk5lQ\">Thirty five hundred lumens is a lot of output from an ultra-short throw (UST) all-in-one 4K projector. Add Dolby Atmos support and a class-leading price and we’ve got plenty of reason to test an otherwise unknown brand. </p><p id=\"4cBoM9\">I stumbled upon the <a href=\"https://awolvision.com/collections/4k-tri-chroma-ust-laser-projectors/products/awol-vision-4k-tri-chroma-laser-projector-ltv-3500\">AWOL Vision Tri-Chroma Laser Projector model LTV-3500</a> in my on-going quest to find a suitable replacement for big ugly TVs with something that’s relatively affordable and of similar quality and brightness. It’s a fool’s errand, I know, but one I’m happy to accept given the steady advances made by UST projectors over the last few years. These kinds of projectors sit mere inches from the wall, and can save a lot of the cost and hassle that comes with cabling up and mounting a front-projection unit on the other side of the room.</p><p id=\"YKR5co\">I’ve been testing this $4,199 projector in combination with a $769 Ambient Light Rejection (ALR) screen also provided by AWOL. For nearly $5,000, or five times the cost of my 55-inch LG OLED, I’ve temporarily achieved a giant projected image in my living room that my family favors over our TV, both during the day and at night.</p><p id=\"6K1ef7\">My god, what have I done.</p><div id=\"MSqvvH\"><div data-anthem-component=\"scorecard:11177738\"></div></div><p id=\"GHrLKt\">AWOL Vision is a new brand under <a href=\"https://elevationtechpartners.com/\">Elevation Technology Partners</a> started by co-founders Andy Zhao and Steven Shulman. It has its own in-house teams for software, support, and mechanical and Industrial engineering, Shulman tells me, but maintains a relationship with Hisense in China. Hisense introduced the world’s first laser TV back in 2014. Shulman tells me that AWOL owns the intellectual property for its branded projectors and has sole discretion to determine product pricing, sales, and service. Reassuringly, the company recently patched a number of minor bugs and annoyances that were present on the first round of devices that began shipping to <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.indiegogo.com%2Fprojects%2Fawol-the-brightest-4k-triple-laser-projector%23%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23056908%2Fawol-vision-projector-review-short-throw-tv-replacement\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Indiegogo backers</a> just weeks ago.</p><div id=\"eo3YXO\"><div data-anthem-component=\"gallery:11176583\"></div></div><p id=\"wbiStN\">The AWOL Vision projector itself isn’t exactly small, but typically sized for 4K USTs. Its front profile, when viewed from the couch, is about the size of two high-end soundbars stacked on top of each other. It measures 23.6 x 13.9 x 5.7 inches (599 x 353 x 145 mm) and weighs 27lbs / 12.3kg.</p><p id=\"5eN0Eo\">The LTV-3500’s star feature is its brightness. At 3,500 lumens, it’s extremely bright — so bright that the stark white boot-up sequence invokes an involuntary flinch to shield my eyes whenever I start it in a darkened room. And because the projector sits so close to the display surface, most of that light actually reaches the screen to create a highly viewable image even when moderate amounts of ambient light try to interfere. Adding an ALR screen can help compete with overhead light sources and give a boost to contrast and color saturation as demonstrated in the following images.</p><div class=\"p-fullbleed-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IGw6q9xEOloqsa5m8lhJ53cbL_Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437551/verge_IMG20220302150454_2040pxl.jpg\">      <figcaption><em>The projected image on the ALR screen (right) is much more contrasty than the image on the wall.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xVWXJpDweP1ToXANYY3q-lP5Bns=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437554/verge_IMG20220302152040_2040pxl.jpg\">      <figcaption><em>Color saturation is improved too.</em></figcaption>  </figure></div></div></div><p id=\"RJW5qC\">My home is over 180 years old and unsurprisingly has walls that are less than pristine. That’s bad for UST projectors which cast light at extreme angles resulting in dark shadows created by raised plaster and holes that resemble dead pixels. My walls therefore benefit greatly from the uniformity of an ALR screen.</p><p id=\"GzNkWa\">More importantly, ALR screens help reject ambient light while dramatically increasing contrast. I was sent one of AWOL Vision’s ALR Cinematic screens for testing. The screen took two hours to assemble and that’s without installing the frame around it or permanently attaching it to my wall. It’s leaning against the wall in my setup and far from optimized, which explains the overbleeding light in some of the photos.</p><div class=\"c-float-right\"><div id=\"HRgQYO\"><div data-anthem-component=\"aside:11176541\"></div></div></div><p id=\"1RAtMG\">AWOL’s Cinematic ALR screen is specifically designed for UST projectors and claims to improve contrast by 100 times compared to my matte-white walls, while absorbing up to 95 percent of overhead lighting. With an 0.6dB gain it’s not going to brighten the image like AWOL’s Daylight ALR screens (1.1dB gain) but it does have the advantage of maintaining better viewing angles without the risk of hotspots. I can’t vouch for their math, but the photos above showing the projected image split across my wall and the ALR screen at mid-day speak for themselves.</p><p id=\"7wLBNf\">The LTV-3500 can produce a 100-inch image when set 9.8 inches from the wall, or a 120-inch image at 13.6 inches. My narrow sideboard only allows me to position it 7.5-inches inches from the wall. The resulting 90-inch image is still enormous, especially compared to my 55-inch TV, but doesn’t come close to filling the ALR screen.</p><p id=\"jjiLfI\">The AWOL LTV-3500 doesn’t run Android TV like many all-in-one projectors. Instead it runs Android 9.0 and bundles the <a href=\"https://www.theverge.com/22715206/amazon-fire-tv-stick-4k-max-review\">excellent Fire TV Stick 4K Max</a> dongle into the package. The Amazon stick can then be tucked into a specially designed nook on the back of the projector containing an HDMI jack for the stick input and USB to power it. It’s a little clumsy, but makes accessing your Netflix account easy compared to the hoops you’ll have to jump through to get uncertified Android TV projectors to run the streamer’s app. The LTV-3500 boots directly into your selected HDMI port, in my case bringing up the Fire TV interface in a reasonable 30 seconds. There is no standby mode that allows the projector to quickly boot in just a few seconds like other USTs. </p><p id=\"YTnxHa\">AWOL’s Hisense relationship is evident with the Tri-Chroma triple-laser light engine it uses. The LTV-3500 can reproduce 107 percent of the BT.2020 (Rec. 2020) color space, which is impressive for a projector. The 4K HDR image produced by the AWOL Display LTV-3500 is a sight to behold in person, especially at night. </p><p id=\"FEVHEs\">For many, a good enough image that’s also giant can easily trump a perfect display that’s small. Bigger displays create the kind of immersion you want when watching films and TV serials, gaming, or watching sports. The AWOL’s image is so good at night, and good enough during the day, that my family has been choosing it over the 55-inch LG OLED for the last few weeks — despite the TV’s superior color reproduction, contrast, and visibility, especially when the sun is out.</p><div class=\"p-fullbleed-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RSMCrDknYSy4hXkxPaIfmDNJ_sg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437565/verge_hankie_wolf__color_retouched__2040pxl.jpg\">      <figcaption><em>Hank was drawn to the more contrasty wolf on the OLED TV which better overcame the ambient light from a nearby window.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OMbo15t_JHSc37UhYub9eEbQC34=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437571/verge_birds_green__color_corrected__2040pxl.jpg\">      <figcaption><em>Hank doesn’t have an opinion on birds.</em></figcaption>  </figure></div></div></div><p id=\"y3XtDo\">While the AWOL’s colors do wash out under the stress of ambient light, the large image remains very watchable on the ALR screen. I would caution, that it looks worse in these color-corrected photos than it appears to the naked eye. The included High Dynamic light mode was also unusable. In some scenes it does terrible things with faces as it slowly, and inexplicably, shifts skin tones from red to green. After some experimentation, I now leave my review unit in Bright and HDR Vivid modes as I’m often fighting with the sunlight until about 9pm each night.</p><p id=\"e1ALKd\">And while the LTV-3500 supports HDR10 plus, even with the ALR screen and 3,500 lumens, it still falls short of the brightness required to produce the image-popping contrast achieved by modern TVs. Nevertheless, its main appeal over a TV is the sheer size of the image you get. In general, the AWOL’s colors are vibrant, especially when viewed in a darkened room; images are sharp; and focus is uniform.</p><p id=\"XMXCkG\">The 36W stereo speakers inside the LTV-3500 do a reasonable job at producing sound in a pinch. They can be tuned to a number of presets like movie, music, and sports. Otherwise you can also pair the projector with a Bluetooth speaker. Home theater installations will make use of the projector’s S/PDIF jack or, better yet, HDMI eARC for Dolby Atmos sound.</p><p id=\"CWtnl7\">The fan noise produced by the AWOL projector is said to be no more than 30dB, but can easily be heard from my couch ten feet away. The light hum continues even when choosing the option to “close screen,” something you might want to do if listening to music off your favorite app running on the Fire TV stick, for example. The noise bothers me when my attention zeroes in on it, but mostly it just drifts into the background. It’s loud enough though, that I do experience a sense of relief when the projector is shut off.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Fdn3LKr8gYDEiyo308maXw0Fz38=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437662/verge_DSC_7752_2040pxl.png\">      <figcaption><em>The LTV-3500 produces an amazing image in full darkness. </em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"i57AkY\">Most people aren’t bothered by the giant black rectangles they’ve erected in their living rooms. I am, in part because my wife hates it. It’s the reason I lived with a 32-inch LCD as my only television for a decade prior to the COVID-19 outbreak — the lockdown provided all the motivation needed to justify buying a more modern 55-inch set. With society reopening, a tinge of regret is setting in now that the TV sits unused 98 percent of the week. </p><p id=\"JCnxjG\">If money were no object then yes, we’d happily replace our ugly television with an AWOL LTV-3500 and ALR screen. Somehow, neither my wife nor I are bothered by that giant gray screen which approximates the creation of an accent wall. Interior design... how does it work?</p><p id=\"LczLUF\">But five grand is a lot of money and my family simply wouldn’t get enough use out of it to justify the replacement cost. Especially now that life is returning to some semblance of normality with plenty of entertainment options beyond the hallowed couch. </p><p id=\"tPv8Lr\">To the best of my knowledge, the only similarly-specced UST projector with an ALR screen bundle in the same price range is the <a href=\"https://www.hisense-usa.com/tv-and-audio/televisions/all-tvs/120L9G-CINE120A_120-trichroma-laser-tv\">Hisense L9G TriChroma Laser TV</a>. But it’s a little more expensive at $5499 to $5999 depending on ALR screen you select, and it’s a little dimmer at 3,000 lumens. </p><p class=\"c-end-para\" id=\"oiNUFq\">The AWOL Vision Tri-Chroma Laser Projector model LTV-3500 is available for <a href=\"https://awolvision.com/collections/4k-tri-chroma-ust-laser-projectors/products/awol-vision-4k-tri-chroma-laser-projector-ltv-3500\">$4,199 preorder</a> right now with the product shipping for free in June if you live in the US. It’s also available with a variety of <a href=\"https://awolvision.com/products/projector-and-screen-bundle?variant=40136605990960\">ALR screen bundles starting at $4,827</a>. If you’ve got the cash, you’re unlikely to find another 4K UST projector that’s just as bright and colorful with support for Dolby Atmos sound. Congratulations mister moneybags on finding your TV replacement.</p><p id=\"jFqmH3\"><em>All photography by Thomas Ricker / The Verge</em></p><div><div id=\"hMt3pE\"><div data-anthem-component=\"aside:11176483\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/4upPqlP7PD2ziUtZhRO7RMu8yJQ=/0x366:2040x1434/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437535/verge_IMG20220503232443_2040pxl.jpg",
  "description": "Your ugly TV replacement is here, mister moneybags.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}