{
  "title": "Axie Infinity’s financial mess started long before its $600 million hack",
  "url": "https://www.theverge.com/2022/4/8/23015468/axie-infinity-blockchain-nft-play-to-earn-game-economics-hack",
  "date": "2022-04-08T14:08:30.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"A blue axie creature is surprised and knocked backwards.\" src=\"https://cdn.vox-cdn.com/thumbor/uoMd0qi_BBEOWbbPzfzavHNer9I=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70726079/VRG_ILLO_5116_AxieInfinity.0.jpg\" />        <figcaption>Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>Blockchain apps’ great hope is facing a rocky future</p> <p class=\"p--has-dropcap\" id=\"wtYNjr\">Last year, <em>Axie Infinity</em> was touted as <a href=\"https://www.theverge.com/2021/10/13/22725083/axie-infinity-sky-mavis-blockchain-economy-game-pokemon\">one of the best candidates</a> for a mainstream blockchain app. The game, launched in 2018 by Vietnamese developer Sky Mavis, was a massive hit in the cryptocurrency world. It offered <a href=\"https://restofworld.org/2021/axie-infinity/\">full-time job prospects to some players</a> and commanded an entry price of over $1,000 at its peak, while Sky Mavis itself was valued at $3 billion after a $152 million funding round led by Andreessen Horowitz. Even more impressively, <em>Axie Infinity</em> was supposed to herald a new era of “play-to-earn” gaming built around crypto tech.</p><p id=\"kt0xA6\">A year later, <em>Axie’s</em> future looks rockier. </p><p id=\"FmcKkz\">Sky Mavis’ Ronin blockchain <a href=\"https://www.theverge.com/2022/3/29/23001620/sky-mavis-axie-infinity-ronin-blockchain-validation-defi-hack-nft\">suffered a catastrophic hack</a> last week, losing over $600 million to unidentified hackers and putting players’ funds in limbo as Sky Mavis froze Ronin transactions. But even before that, Sky Mavis was facing bigger questions about its long-term sustainability. Combining the freewheeling hype market of crypto with the complicated economic workings of a massively multiplayer game, Axie Infinity’s in-game world has spent months trying to avert a financial crisis. And, as it attempts to reinvent itself with a <a href=\"https://www.theverge.com/2022/4/7/23013134/axie-infinity-ronin-network-crypto-theft-origin-launch\">new free-to-play game</a>, the situation offers a glimpse at what can happen when the hype hits its limits.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"A player-versus-player match in Axie Infinity.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5snTL5mrpPuhI71aKa7ztUoTnrM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23374951/Screen_Shot_2022_03_30_at_10.14.24_AM.png\">  </figure></div><p id=\"56guWl\"><em>Axie Infinity</em> — whose creators refer to it as both a “nation” and “a bleeding-edge game that’s incorporating unfinished, risky, and highly experimental technology” — is sort of like hyper-financialized <em>Pokémon</em>. Players buy or rent three non-fungible tokens (or NFTs) linked to cartoon axolotls called “axies,” each of which has a set of associated stats and battle cards. Winning battles grants players a token called a “smooth love potion” or SLP, and axies can be “bred” with SLP and a third token called AXS to produce new NFTs.</p><p id=\"slf6PP\"><em>Axie’s</em> biggest selling point is the chance to turn these tokens into real money. Axies and SLP can be sold for cryptocurrency, and people can earn SLP by either playing the game directly or participating in the “scholarship” system, where they lend their axies to other players and receive a share of those players’ earnings. The result is a kind of tremendously popular <a href=\"https://www.vice.com/amp/en/article/88g3ag/the-metaverse-has-bosses-too-meet-the-managers-of-axie-infinity\">in-game capital market</a>, where axie-holders can earn currency through investment without necessarily playing the game.</p><div class=\"c-float-right c-float-hang\"><aside id=\"2CFhRR\"><q>The dream of crypto gaming is getting paid for something you currently do for free</q></aside></div><p id=\"q8tTv8\">The dream of <em>Axie Infinity</em>, like a lot of blockchain applications, is to get paid for something you currently do for free online. As Andreessen Horowitz partner Arianna Simpson <a href=\"https://www.theverge.com/2021/10/13/22725083/axie-infinity-sky-mavis-blockchain-economy-game-pokemon\">told my colleague Casey Newton</a> last October, “If I can play a game, and have an equivalent amount of fun, and also make money — well obviously I’d rather do that, right?” (We’ll leave aside the philosophical questions this raises about the nature of fun.) </p><p id=\"xypKQz\">But there is a fundamental problem: <em>Axie Infinity’s</em> in-game economy has so far relied on constant growth to keep it running, with inflation built into the mechanics. Even if the game can overcome the recent challenge of the hack, Sky Mavis hasn’t proven it can transition out of that phase.</p><p id=\"Khszry\"><em>Axie Infinity’s </em>economy is built around three major resources: the in-game cryptocurrency SLP; the axies that live as in-game items as well as NFTs on Sky Mavis’ blockchain; and the “governance token” AXS. The game produces two of those resources in constantly increasing quantities. SLP is earned through player-versus-player battles, and, until recently it was also available by completing daily quests and grinding in single-player mode, the equivalent of printing money and handing it to players in large quantities. Axies can be bred several times to produce new creatures and are largely immortal, so the breeding mechanic increases the pool of NFTs.</p><p id=\"3i2eqv\">Games often include economic “sinks” (like cosmetic items or in-game equipment maintenance costs) that burn resources without producing more. By contrast, <em>Axie Infinity </em>players had two main options: they could sell their SLP — which pumped it back into the ecosystem — or use it to breed axies whose main function is producing <em>even more SLP</em>. Either way, they were creating more resources and watering down the value of everything acquired in the game.</p><div class=\"c-float-left c-float-hang\"><aside id=\"K3Nt7u\"><q>Immortal axolotls present a gameplay problem</q></aside></div><p id=\"2p4ZjY\">“From a macro[economic] perspective, you’ve created a positive feedback loop,” explains Mihai Gheza, the cofounder and CEO of Machinations, a consultancy that tests game economies with large-scale software simulations. Players (especially scholars) would use axies to produce SLP, the SLP would produce more axies, and the axies would bring even more SLP-producing players into the game. “It’s a guaranteed means of creating inflation.”</p><p id=\"vnrqZG\">Sky Mavis said it needed a growing axie pool to let new players join <em>Axie Infinity</em> because, unlike a traditional game, the studio wasn’t supposed to simply create more characters out of thin air. Eventually it planned to introduce more sinks and hoped people would acquire axies for “the intrinsic value they can provide to players in the form of competitive, social, and progression-based fun and achievements.” In the short term, their primary use was generating currency that could create more NFTs for sale or rental, and that only worked if there were people around to buy. “By design the <em>Axie</em> economy will be dependent on new entrants,” <a href=\"https://whitepaper.axieinfinity.com/gameplay/axie-population-and-long-term-sustainability\">Sky Mavis acknowledged</a>.</p><p id=\"KwQTeD\">But unless that intrinsic value materializes, the system requires players to keep joining up. In August, a cryptocurrency writer and decentralized autonomous organization operator who goes by M Goes wrote <a href=\"https://medium.com/coinmonks/axie-infinity-a-developing-worlds-messiah-or-the-biggest-ponzi-scheme-in-crypto-right-now-564ecfb62054\">a widely cited Medium post</a> calling <em>Axie Infinity</em> “the biggest Ponzi scheme in crypto.” He concluded that none of <em>Axie Infinity’s</em> potential long-term business models could support its biggest short-term selling point: letting a large number of people make a consistent full-time living playing games. The system was only sustainable with a huge demand for more SLP and axies, and maintaining that would require a functionally infinite number of new signups. “It is hard to predict when the collapse will happen,” he wrote. “But nevertheless, there are only so many daily players it can reach.”</p><p id=\"8rp0gO\">As it turned out, <em>Axie Infinity</em> skeptics wouldn’t have to wait long. Around the end of 2021, the game suffered a dramatic decline in its <a href=\"https://decrypt.co/89845/axie-infinity-leads-gaming-crypto-crash-amid-wider-market-rout\">token prices</a> and <a href=\"https://www.fxstreet.com/cryptocurrencies/news/axie-infinity-price-risks-further-fall-as-active-users-drop-70-from-peak-202112280847\">sales volumes</a>, with the SLP token <a href=\"https://www.coindesk.com/tech/2022/02/08/axie-infinity-reduces-slp-emissions-to-prevent-collapse/\">crashing from an all-time high</a> of 39 cents to a single penny. A report from research firm Naavik indicated that the typical player’s daily earnings had <a href=\"https://news.bitcoin.com/daily-earnings-of-typical-axie-infinity-player-fall-below-the-philippines-minimum-wage-line-report/\">fallen below the minimum wage</a> in the Philippines, <em>Axie Infinity’s</em> top market. Sky Mavis <a href=\"https://axie.substack.com/p/upcoming-season-20-and-economic-balancing?s=r\">took drastic action</a>, removing a large chunk of SLP-generating options and making player earnings dependent on winning competitive matches instead of just showing up to grind. “We know that this is painful medicine. The Axie economy requires drastic and decisive action now or we risk total and permanent economic collapse,” it warned. “That would be far more painful.”</p><div><aside id=\"f77WgW\"><q>“The problem they have is a classic game economy crash scenario”</q></aside></div><p id=\"87zklM\">These kinds of interventions aren’t unique to crypto gaming. “The problem they have is a classic game economy crash scenario: players need to grind some resource to sell, and selling it in turn drives down the price, necessitating grinding even more of it, thus driving the price down even further,” says Alexander King, a game designer and consultant who specializes in simulations and economics. (Disclosure: King is also an adjunct professor at the NYU Game Center, where my husband teaches.) The zoo-building game <em>Planet Zoo</em>, for instance, upended its online market in 2019 by accidentally creating a reward system that <a href=\"https://www.rockpapershotgun.com/planet-zoo-is-temporarily-a-game-about-mass-producing-knackered-warthogs\">incentivized players breeding millions of mutant warthogs</a>. Inflation is a perennial problem with massively multiplayer online games like <em>World of Warcraft</em>, where for-profit gold farming — itself a venerable but unsanctioned “play-to-earn” system — has <a href=\"https://www.polygon.com/2018/8/22/17759824/world-of-warcraft-azeroth-economy-gold\">contributed to a huge cycle of it</a>.</p><p id=\"EzSeAO\">The problem is that <em>Axie Infinity’s</em> game economy is also supposed to be a <em>real</em> economy where Sky Mavis (in theory, at least) has limited control over how much the game tokens are worth. “Game economies are fantastically difficult systems to balance,” says King. “It’s impossible to build it perfectly beforehand, game designers need to be able to rebalance it on the fly. That’s hard enough to do when it’s run from an internal database the designer has complete control over.”</p><div class=\"c-float-left c-float-hang\"><aside id=\"IYLVCz\"><q>Sky Mavis announced an additional $150 million investment after the hack</q></aside></div><p id=\"MUkig5\">Jon Jordan, a blockchain gaming consultant and early <em>Axie Infinity</em> adopter, thinks the scholarship model’s popularity exacerbated <em>Axie Infinity’s </em>economic woes. Axie sharing was one of the game’s key innovations. But, as it became a larger and larger part of the appeal, it rapidly produced a massive class of full-time players who were focused on producing and recirculating as much SLP as possible. “It became a victim of its own success,” Jordan says. “There was an economy that probably wasn’t balanced, but wasn’t horribly overbalanced in one direction — then that became horribly unbalanced.” As <em>Axie Infinity</em> tries out new economic sinks, it could end up working against the goals of players who see extracting crypto — not tricking out their characters or having fun with in-game systems — as the whole point of the experience.</p><p id=\"5Oc76N\">Just as the new economic measures were starting to take hold, the whole system got hacked. In late March, an unknown attacker exploited a string of vulnerabilities to drain the company’s Ronin network of more than a half-billion dollars in cryptocurrency. (The exact numbers vary thanks to Ethereum’s volatility — in the hours after the initial reveal, it ranged from $600 to $625 million.) The intrusion didn’t directly steal any in-game tokens, but it hobbled the game’s real-money economy and left <em>Axie Infinity</em> players with no easy way to spend their earnings.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"An axie in Axie Infinity\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UFrQUvFL83K17wNkWU-TsvAxJD4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23374957/Screen_Shot_2022_03_30_at_10.19.19_AM.png\">  </figure></div><p id=\"xuBQya\">Sky Mavis called returning players’ money its “top priority,” and it’s not clear the hack will sink the company or the game, which has already outlived many crypto projects and gained even more backing from mainstream investors. The company pressed ahead with its free-to-play plans and announced that it would reopen the Ronin bridge after a security upgrade. It also announced a new $150 million investment that would help replace players’ money. “There’s no guarantees in crypto,” said <a href=\"https://www.cnn.com/2022/04/03/tech/axie-infinity-hack-party-nft-la/index.html\">Sky Mavis co-founder Jeffrey Zirlin to CNN</a> after the hack. “But we’ll do our best to figure it out.”</p><p id=\"ldOzo0\">In the short term, crypto games have been buoyed by speculation, even when there’s <a href=\"https://restofworld.org/2022/investors-land-metaverse-decentraland/?utm-source=sharing\">extraordinarily little to do in them</a>. “You are buying into somebody who is way ahead of everybody else,” says Dominic Ryder, CEO of vEmpire — a multi-pronged crypto initiative that invests in <em>Axie Infinity </em>scholars, digital real estate, and its own blockchain trading card game called <em>vEmpire: The Beginning</em>. “Whether or not the product is good at this point” — and it’s often, he acknowledges, highly limited — “it does have the first mover advantage, and that is where the value is.”</p><p id=\"n18ptI\">But in the long run, <em>Axie Infinity</em> needs to keep players engaged even if they’re not turning a profit. Sky Mavis outlines a future of “intrinsic value” that opens the door to fun social- and challenge-based systems. And it’s soft-launched a replacement for classic <em>Axie Infinity</em> called <em>Axie Infinity: Origin</em>, including non-NFT “starter axies” that will make the game playable without a scholarship or an expensive buy-in process.</p><div class=\"c-float-right c-float-hang\"><aside id=\"09R57F\"><q>Even positive press write-ups tend to ignore Axie Infinity’s gameplay</q></aside></div><p id=\"StRyaO\">Jordan thinks <em>Axie Infinity</em> is well-positioned to become a mainstream free-to-play game as well as a crypto title. Sky Mavis has been selling new assets, like “land” in its fantasy kingdom of Lunacia, that can support future gameplay mechanics. It’s also revamping the gameplay system for <em>Origin</em>.</p><p id=\"iXYnD7\">But Sky Mavis hasn’t proven it can<em> </em>make a game that’s fun enough to play without profit. In one much-cited Twitter poll run by Zirlin, 48 percent of <em>Axie</em>-playing respondents listed their favorite thing about the game as “the economy” rather than the gameplay or the community, and it’s not clear how many would stick around if they weren’t getting paid. “​​A majority of its player base treats the game like a daily job to make daily financial ends meet,” <a href=\"https://www.deconstructoroffun.com/blog/axie-infinity-deconstruction\">concluded an in-depth economic analysis</a> by Naavik. Even positive press write-ups tend to ignore <em>Axie Infinity’s</em> gameplay beyond saying it’s a lot like <em>Pokémon</em>.</p><p id=\"jpBX1U\">In the name of fairly considering <em>Axie Infinity’s</em> prospects, I got permission from <em>The Verge</em> to buy three of the cheapest axies I could find in February, making an exception to our normal policy of not holding cryptocurrency assets. I navigated Sky Mavis’ elaborate onboarding process and spent about $105 on a team, which I sent to our games editor Andrew Webster for testing. Andrew, an avid <em>Pokémon</em> fan, was not immediately impressed. “Why am I fighting olives?” he asked me over Slack as he booted up the game’s first levels, which pit your axolotls against squads of one-eyed slimeballs.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"A screenshot of Axie Infinity’s single-player mode\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7zk0f_tZwWIqVNlGBoZxl2qD9MA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23374959/Screen_Shot_2022_03_30_at_10.10.00_AM.png\">  </figure></div><p id=\"EI0tyr\">(The tentative <em>Verge</em> crypto policy is to sell any assets acquired while reporting a story before publishing it and donate any profits to charity, but the Ronin hack and subsequent freeze made that unfeasible for this article. Low-status “floor axies” like mine are currently listed for $19 apiece on the marketplace, which would make my team worth around $50 less than I paid. By playing, Andrew had earned 10 SLP, or slightly over 20 cents, as of this week.)</p><p id=\"4k2W77\">Andrew did praise some of <em>Axie Infinity’s</em> mechanics, like the added randomness of having axies draw their potential moves from a deck of cards instead of a full list of abilities. “In practice, though, my axies have such a limited array of moves that I’m mostly just using the same few attacks with the occasional healing spell to stay alive,” he said. “Combat seems to mostly boil down to brute force.”</p><div class=\"c-float-left c-float-hang\"><aside id=\"fCaEom\"><q>“Mario Kart with crypto” doesn’t make much sense</q></aside></div><p id=\"LXYOTJ\">Most frustratingly, he said, the game’s NFT-based conventions removed the things he liked most about <em>Pokémon</em>. Every axie is randomly generated and technically unique, like a lot of blockchain art, which practically means it’s one of countless slight variants on a single template — you won’t find iconic, singular-looking creatures equivalent to a Pikachu or Magikarp. Meanwhile, the costs of ownership and complications of scholarship discouraged trying out a bunch of different axies to find your favorite combinations. “The creatures are all extremely similar, and experimentation is nonexistent unless you want to fork out a bunch of cryptocurrency,” he told me.</p><p id=\"l2Vm1C\">Updates like the starter axie system could change this. But, in my personal experience of playing <em>Axie Infinity, </em>forking out cryptocurrency was sort of the whole point — or at the very least, the only thing that distinguished it from countless more mechanically and aesthetically interesting games.</p><p id=\"7Pad5y\">The stereotypical description of play-to-earn games is that they’re like conventional video games where you happen to get crypto instead of gold coins. “Imagine being able to earn money by playing <em>Mario Kart</em>,” <a href=\"https://kotaku.com/mario-kart-nft-idea-is-the-worst-thing-i-have-ever-read-1847977673\">gushes one <em>Bloomberg</em> feature</a>, outlining a scenario where you earn “Mariocoins” by buying access to “NFT Mario” or “NFT Peach.” But if you’ve spent much time interacting with game developers, this pitch doesn’t feel particularly intuitive. It’s basically saying designers should build a popular and profitable video game, a thing that is already immensely difficult to do, where players should incidentally expect the game to pay them.</p><div><aside id=\"a7N3YJ\"><q>“If you have an online poker table of eight people, it’s going to be one person that makes money, and seven people that gamble and lose.”</q></aside></div><p id=\"VDxQ7D\">A more logical comparison is a casino that runs skill-based gambling tables: a system where people play specifically for the thrill of putting real money on the table and only the most skilled can hope to regularly earn a profit, while the house always takes a cut. Some crypto games are upfront about adopting this model, including <em>vEmpire: The Beginning</em>, where players bet money on their card games and the developers (who are still tuning the real-money portion of the game) will collect a commission. “I don’t think we hide that fact,” Ryder says of the gambling comparison. “It is a game where you are staking against another player.”</p><p id=\"uDrQER\">Alternatively, a game could operate mostly as a free-to-play or pay-to-play game with a tiny tier of professional players competing for tokens, and those tokens might be backed by money from outside the system. “The problem at the moment is all the money is basically coming in from small players or investors,” says Jordan. “But if you open up to indirect money coming in from esports sponsors — or however [else] esports are funded — then I think that becomes much less of an issue.”</p><p id=\"Y2IZ5j\">Unlike many <em>Axie</em> skeptics, M Goes is pro-blockchain and open to the possibility of crypto games. But he thinks projects that follow <em>Axie Infinity’s</em> model of simply trying to pay their players will inevitably run into trouble. “I think the name is misleading, because the situation eventually is going to be that it’s ‘play to earn’ for a very small number of people and it’s ‘pay to play’ or ‘free to play with the option to pay’ for the vast majority of people,” he tells <em>The Verge</em>. “If you have an online poker table of eight people, it’s going to be one person that makes money, and seven people that gamble and lose.”</p><p id=\"3BbDe1\">This all makes crypto gaming sound a bit less new and shiny — online poker largely fits the bill of being a “play-to-earn” game, esports are already a thriving business, and indie developers like Jason Rohrer have built more experimental games around <a href=\"https://www.engadget.com/2014-09-28-jason-rohrers-new-game-is-a-devilish-gamble-with-real-money.html#:~:text=Now%2C%20Rohrer%20is%20developing%20Cordial,a%20series%20of%20numbered%20tiles.\">placing wagers</a> or <a href=\"https://www.polygon.com/gaming/2012/3/7/2852927/jason-rohrers-card-game-solves-americas-inflation-problem-by\">literally tearing up bills</a>. But cryptocurrency can let games easily integrate quasi-real-money mechanics without the complications of touching the conventional financial system, at least until players have to <a href=\"https://www.protocol.com/nft-game-tax-scholarships\">pay taxes on their earnings</a>. Similar to the recent explosion of sports betting apps, it’s all part of <a href=\"https://www.vox.com/the-goods/22922511/crypto-nfts-sports-betting-money-hobby\">the ongoing gamification of money</a>.</p><p id=\"8ornJ9\">A big downside of not touching the conventional financial system, of course, is that you’re tying up huge amounts of value in an institution that relies on technical safeguards more than legal or societal ones. (That’s discounting the crypto schemes that are outright scams.) And, in Sky Mavis’ case, those technical safeguards weren’t enough.</p><p id=\"7cwFVY\">When I spoke with Machinations (which does not work directly with Sky Mavis) soon after the hack, they remained positive about <em>Axie Infinity’s</em> prospects, largely because of the apparent continued loyalty of its player base. “One of the key things that you always come back to is: are the contributors to that economy happy with what’s going on? And I think one of <em>Axie Infinity’s</em> biggest strengths is actually the strength and size of its community,” says sales director Matthew Morris. “Short- to medium-term issues with the economy, and how well the overall game economy is performing, can be resolved through a great, well-dedicated community.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"C8xzK7\"><q>“I do think that they have it just as well in check as the US government does.”</q></aside></div><p id=\"FFulc4\"><em>Axie Infinity</em> draws easy comparisons to unprofitable tech products that have managed to operate for years without apparent problems. Uber, for instance, was founded in 2009 and remains valued at <a href=\"https://finance.yahoo.com/quote/UBER/key-statistics/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAAQr0bth5CtCVkAK2PoX6Z39H59ncAaCq__Rj1XwBFAt7o0BSlvia6dUIeHDUd1_fngGOz0c2Ct8qHg0mC12VSY73zYL8_Qctc_7lCsaJX_fM9KwqnXVBiSU2Ak8HeVQb_yOrhi4SD2uAPcf4LzIrBDmY33uE_Oq4WY569tIr2EH\">close to $100 billion</a> despite having <a href=\"https://www.theatlantic.com/ideas/archive/2018/06/taxi-driver-suicides-are-a-warning/561926/\">immiserated a large class of workers</a> and burned <a href=\"https://www.theverge.com/2020/2/6/21126965/uber-q4-earnings-report-net-loss-revenue-profit-2019\">billions of dollars</a> annually without turning a profit even under its own <a href=\"https://techcrunch.com/2021/02/12/will-ride-hailing-profits-ever-come/\">highly creative accounting rules</a>. But these companies aren’t bulletproof — as WeWork, another <a href=\"https://www.theverge.com/22585805/adam-neumann-cult-of-we-wework-book-vc\">hyped and unprofitable giant</a>, discovered. And <em>Axie Infinity</em> is operating in a cutthroat industry of online games that are competing for a finite number of player hours. It’s easy for players to quit logging on, especially as <em>Axie</em> scholar guilds have <a href=\"https://restofworld.org/2022/axie-infinity-nft-game-guilds/\">diversified into other games</a>.</p><p id=\"BcPrGL\">Ultimately, one of the biggest arguments for <em>Axie Infinity’s</em> continued existence — according to some supporters — is simply that other economic systems also don’t seem to make sense and, yet, continue to exist. “There is no defining law on what a healthy, functioning economy is,” says Ryder. “There always seems to be a loser, and everyone’s just making it up as they go along. And there’s nothing wrong with that, because that’s what governments have done for years and years.”</p><p id=\"e1HIQk\">“I do think that they have it just as well in check as the US government does,” he continues, “which might not make you feel better at this stage.”</p><p id=\"qcZvJ1\">There’s a circular quality to a lot of arguments for the blockchain: if enough people believe it’s valuable, it will become valuable. And that could extend to <em>Axie Infinity</em> — short-term problems notwithstanding. The question is what kind of financial impact it will have on people who have sunk hundreds or thousands of dollars into the economy so far, and what players who miss the hype bubble will feel like they’re getting out of the game.</p><p class=\"c-end-para\" id=\"z4YQ5R\">“The fact that people put their time and trust into an ecosystem, oddly enough, can be sufficient for the sustainability of its long term,” argues Gheza. “I don’t want to say that inherently broken economies are sustainable just because people believe in them and want to play them. However, that is one of the most powerful things you can have to get past difficult times.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NFn3ukvtP0D5KjxK4SfmOG2dHis=/0x429:3000x2000/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23355712/VRG_ILLO_5116_AxieInfinity.jpg",
  "description": "Crypto makes a difficult game design problem even harder.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}