{
  "title": "Aya Neo Next review: a Steam Deck alternative with Windows",
  "url": "https://www.theverge.com/22972334/aya-neo-next-review-vs-steam-deck-windows",
  "date": "2022-03-18T14:45:00.000Z",
  "author": "Sam Byford",
  "content": "  <p>The price of compatibility</p> <p class=\"p--has-dropcap p-large-text\" id=\"BmjDKl\">Portable gaming PCs have come a long way. Much of the recent attention has fallen on <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">Valve’s Steam Deck</a>, which just started shipping, but Valve didn’t invent the category — it’s following in the footsteps of several other products from smaller companies. </p><p id=\"LYN8sE\">A few years ago, I reviewed the <a href=\"https://www.theverge.com/2017/12/21/16804940/gpd-win-review-2-specs-features-price\">GPD Win</a>, a breakthrough device that essentially repurposed netbook hardware into a pocket-sized Windows gaming laptop. Performance in this category has been steadily improving, and the new Aya Neo Next is the most advanced Windows gaming handheld we’ve seen yet. Aya Neo is a relatively young company that formed in 2020, but it’s already put out a few well-regarded portables, and the Next is its first big redesign. It’s available to preorder now <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.indiegogo.com%2Fprojects%2Fayaneo-next-future-windows-handheld-for-aaa-games%23%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22972334%2Faya-neo-next-review-vs-steam-deck-windows\" rel=\"sponsored nofollow noopener\" target=\"_blank\">on Indiegogo</a> with shipping set for mid-April.</p><p id=\"0uSWE7\">Comparisons to the Steam Deck are inevitable, and I encourage you to read <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">our review</a> of that device as well. In some areas, like price and performance, Valve has a clear advantage. In others, though, the Aya Neo Next stakes a strong claim for relevance. </p><div id=\"uHXvAB\"><div data-anthem-component=\"scorecard:11089208\"></div></div><p id=\"iTGQ2q\">The Aya Neo Next has a more conventional design than the Steam Deck. Both devices are built around similar 7-inch 1280 x 800 LCD panels, but while Valve has added haptic trackpads and stretched the D-pad and face buttons way out to the edges, Aya Neo has opted for a more straightforward layout in line with a Nintendo Switch. This makes for a smaller device than the Deck — 267mm wide versus 298mm, and 30mm thick versus 49mm — at the cost of a little control flexibility. Valve included haptic trackpads so that the Steam Deck can play games that weren’t designed to work with controllers, which isn’t really something that the Aya Neo Next will support unless you want to hook up a mouse. (As we’ll get into later, though, there are plenty of games it can play that the Steam Deck can’t without jumping through hoops.)</p><div class=\"c-float-right c-float-hang\"><div id=\"vqPAty\"><div data-anthem-component=\"aside:1523637\"></div></div></div><p id=\"A7sIuS\">The controls that are here are generally solid. The analog sticks and triggers have a good amount of travel and use magnetic Hall-effect sensors, which Aya Neo says improves reliability and longevity over traditional physical components. I don’t love the D-pad, which has a high pivot point that can make it a little tricky to use for fast diagonal input in fighting games, but it works accurately enough for four-way movement. There’s an Aya button below the right stick that brings up Aya Space, Aya Neo’s custom software layer, while another customizable button next to it takes you to the Windows desktop by default. Up top, there are volume buttons and a power button with an integrated fingerprint sensor. (The Steam Deck doesn’t have any form of login protection once you give it access to your account, not even the option for a password.) Aya also gives you a USB-C port on both the top and bottom edges, which is a thoughtful touch that gives you more flexibility to charge (or dock) the device while using it in various situations. A headphone jack is located on the top, and there are stereo speakers on the bottom.</p><p id=\"fbLBHH\">I wouldn’t describe the Aya Neo Next’s build quality as premium, exactly, but it’s minimalist and unfussy. The soft-touch plastic on the back (which Aya Neo upsettingly calls a “BabySkin texture”) helps with comfort, as do the controller-like protrusions on the bottom. I have big hands and find it easier to hold and use than a Switch, though that isn’t saying much. At a little over 1.5 lbs, though, you won’t want to hold it upright for too long without having somewhere to rest your elbows.</p><p id=\"pfoKlF\">The screen isn’t spectacular but gets the job done. It’s an IPS panel with exactly the same size and sharpness as the Steam Deck’s, and while I haven’t had a chance to compare them side by side, the Aya Neo Next’s color reproduction is good. It doesn’t get extremely bright, though, and the glass is quite reflective (there’s no option for the etched glass of the most expensive Steam Deck model) — as well as being a fingerprint magnet. I’m not sure I’d take this to the park on a sunny day.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/J9xgVDZ07_0DNvIrNMkQFjz_GjE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23306150/IMG_2198.jpg\">      <figcaption><em>There’s a USB-C port up top as well as on the bottom. You’ll also see the headphone jack, volume buttons, fan exhaust, and sleep/wake button with an integrated fingerprint sensor.</em></figcaption>  </figure></div><p id=\"Lmjg5h\">The internal hardware is centered around an AMD Ryzen 7 5800U or 5825U APU. That gives you eight Zen 3 cores that can run up to 16 threads, which on paper should lead to better CPU performance than the quad-core Steam Deck (which also runs at a lower clock speed). The downside is the integrated GPU, which is based on Vega 8 technology and isn’t as fast as the Steam Deck’s newer RDNA 2 silicon — and GPU power is, of course, more than a little important for gaming. The RAM is also LPDDR4X, while the Steam Deck has LPDDR5.</p><p id=\"XIGR95\">The specific model I’ve been testing is the Aya Neo Next Advance, which recently launched in limited quantities and sold out ahead of the wider Indiegogo campaign. The main difference between the Next Advance, the Next, and the Next Pro, is that the Advance uses the 5800U, and the other two have the 5825U, which has a slight 100MHz speed increase at a base clock of 2.0GHz and 4.5GHz boosted. The Pro also has 32GB of RAM compared to 16GB on the other two models.</p><div class=\"c-float-left c-float-hang\"><aside id=\"0AYpq1\"><q>The Neo’s starting price is more than three times the cost of the Steam Deck’s</q></aside></div><p id=\"M1r6dl\">I can’t really continue at this point without bringing up the price. The Aya Neo Next starts at $1,385, and the Steam Deck starts at $399. That’s not just a stark difference; it’s a MacBook Air-sized gap. But there’s a little more to the comparison. First, the entry-level Aya Neo Next model has a 1TB NVMe SSD (and a 2TB drive is a $100 upgrade), while the $399 Steam Deck has just 64GB of much slower eMMC storage, and even the most expensive $649 model only has a 512GB NVMe SSD. The Steam Deck does have a microSD slot, but that’s another slower form of storage, and the biggest cards available are only 1TB. It is definitely nice to install a ton of games onto one fast 2TB SSD without having to think about where they’re going to be located or how quickly they’re going to load.</p><p id=\"xc0cr8\">The Aya Neo Next also has to account for the cost of a Windows 10 Home license, as well as being made by a company that needs to make a profit on hardware. Valve doesn’t have to make a penny on Steam Deck sales as long as it’s beneficial for the broader Steam ecosystem. That shouldn’t matter to consumers, most of whom will entirely understandably consider the Steam Deck to offer a better bang for their buck. But it doesn’t mean there’s no place for the Aya Neo Next.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/W6ItcirCRA_Snk4S7318vbAakdQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23306151/IMG_2182.jpg\">      <figcaption>The Aya Neo Next’s back panel is covered with soft-touch plastic. </figcaption>  </figure></div><p id=\"hmwvpF\">A big reason why is that, well, it runs Windows. Microsoft’s venerable operating system may not offer the ideal UI for a touchscreen gaming handheld, but it does have the advantage of having provided the software foundation for virtually the entire PC gaming platform for decades. Valve’s Linux-based SteamOS 3.0 has come in pretty hot, and there are a lot of games that the Steam Deck can’t run that the Aya Neo Next has no problem with. </p><p id=\"wzFoob\">Valve just <a href=\"https://www.theverge.com/2022/3/10/22971108/valve-steam-deck-windows-runs-drivers-no-support\">enabled Windows compatibility for the Steam Deck last week</a>, but it’s still early days — you can’t dual-boot with SteamOS, for example, and there’s still no speaker support. After testing Windows on the Steam Deck for four days, my colleague Sean Hollister says he ran into even nastier glitches than he did with Linux, and doesn’t recommend most people try it until Valve or the community has secured better drivers. </p><div class=\"c-float-right c-float-hang\"><div id=\"MXeRhf\"><div data-anthem-component=\"aside:11089190\"></div></div></div><p id=\"uq8K6z\">Meanwhile, you can get a reasonable facsimile of the Steam Deck experience simply by setting the Aya Neo Next to boot Steam in Big Picture mode on launch, which gives you a simplified interface that’s designed for controllers. It’s still running the older UI, though Valve has <a href=\"https://www.theverge.com/2021/7/21/22586454/valve-steam-deck-ui-pc-client-steamos-3-big-picture\">said</a> it plans to replace Big Picture mode with the new Deck interface on all PCs at some point. If all your games are on Steam, Big Picture works well and means you don’t have to interact with Windows very often. Aya’s own Aya Space overlay is also accessible with a single button press and can serve as a game launcher while also letting you update firmware and adjust hardware settings like fan speed and power consumption. The Steam Deck lets you fine-tune power on Linux, but not Windows, and there’s currently no fan adjustment.</p><p id=\"RZXEsU\">Windows being Windows, though, you can install anything you want. (You could conceivably use the Aya Neo Next as a desktop PC with a USB-C dock, though I didn’t try this out.) The Epic Games Store runs natively on the Aya Neo Next, meaning you can play <em>Fortnite</em>, other Epic exclusives like <em>Final Fantasy VII Remake</em>, or the library of weekly free games you may have been amassing for years. Microsoft’s Xbox app is another useful option, meaning Game Pass subscribers can play games like <em>Forza Horizon 5</em> and <em>Halo Infinite</em> on the Aya Neo hardware while syncing their progress with Xbox consoles. With Linux, the Steam Deck can’t even play Game Pass games over cloud streaming, much less install them.</p><p id=\"UIgZPW\">The Aya Neo Next also doesn’t have the issues where, for various reasons, games that are actually on the Steam store still won’t run on Valve’s hardware. <em>Destiny 2</em>, for example, is perfectly playable on the Aya Neo Next, whereas Bungie has <a href=\"https://www.theverge.com/22957294/bungie-destiny-2-steam-deck-game-ban\">threatened to ban</a> players who attempt to get it to run on Linux. Other major Steam titles that are currently unplayable on the Steam Deck include <em>PUBG, Lost Ark</em>, <em>Halo Infinite, </em>and <em>Dead by Daylight</em>. I wouldn’t expect anyone to play multiplayer games at a high competitive level on the Aya Neo Next, but I will say it’s the perfect device for quickly knocking out some battle pass quests.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RrZS2ghGQzGJNd5mLp2RP6AJHb8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23306152/IMG_2197.jpg\">      <figcaption>A quick press of the Aya button brings up this overlay that gives you direct control over various performance settings.</figcaption>  </figure></div><p id=\"edlUpo\">Of course, Windows’ user interface sometimes poses problems, and sometimes you’ll miss not having a physical keyboard, even a tiny one like the GPD Win’s. Windows and Steam both have virtual keyboards, but unlike previous Aya Neo models, there’s no longer a dedicated button to bring it up, so often, you’ll have to bring up the desktop and tap the tiny icon on the taskbar. While you can navigate around Windows with the controller to some extent, this confuses the operating system when you’re in the middle of a game, so it isn’t really practical in regular use. Tasks like installing mods into a game’s folder are a pain without connecting a mouse. And you’ll run into bugs sometimes — one weird glitch we found on both the Aya Neo Next and the Steam Deck with Windows is that we couldn’t get <em>Red Dead Redemption 2</em> to run in fullscreen mode, even though it’s fine on SteamOS. </p><p id=\"2tEFOB\">For the basic use case of installing and launching games, though, you rarely need to interact with Windows, and when you do have to, it works more or less as you’d expect. The Steam Deck’s software is designed for the form factor but feels unfinished; the Aya Neo Next’s is technically more solid but just feels like an awkward fit.  </p><div class=\"c-float-left c-float-hang\"><aside id=\"qsoS9Y\"><q>As for performance, the Aya is in the same ballpark as the Steam Deck, but closer to the bleachers</q></aside></div><p id=\"vmPvzd\">As for performance, I would say it’s generally in the same ballpark as the Steam Deck but closer to the bleachers than field level. As expected, the Steam Deck’s faster GPU translates to better performance in most games we’ve tested directly against each other. But I didn’t encounter anything that was outright unplayable on the Aya Neo Next — at least not because of its horsepower. On newer, demanding games like <em>Cyberpunk 2077, </em>and <em>God of War</em>, I mostly played with a mix of low and medium settings at native resolution — which usually looks good on a screen of this size — and targeting 30 frames per second with V-sync on. </p><div class=\"c-float-right c-float-hang\"><div id=\"8P9tHP\"><div data-anthem-component=\"aside:11101816\"></div></div></div><p id=\"nu5wrc\">Those happen to be examples of games that support AMD’s FidelityFX Super Resolution (FSR), which unfortunately isn’t a universal feature here like it is on the Steam Deck but is helpful for getting a sharper picture when it’s present. It uses reconstruction techniques to give better image quality when rendering at a lower resolution, and a fairly low-powered device with a small screen is the ideal fit. </p><p id=\"GUrXIS\">As far as I can tell, most games that run on a base Xbox One will run at least as well on the Aya Neo Next, albeit at a lower resolution. <em>Elden Ring</em>, for example, isn’t exactly the best-optimized PC game out there, but I could keep a solid 30fps on low to medium settings, not far below what we’re seeing on the Steam Deck. Most Xbox 360-era games I tested, like <em>Batman: Arkham Asylum,</em> run on max settings at 60fps. Basically, you can play PC games from any era as long as they have controller support, which unfortunately isn’t a given. The Steam Deck’s haptic trackpads might not be a perfect replacement for a mouse, but they do significantly expand the number of games that it’ll run at all, particularly older titles. </p><p id=\"Gko8sV\">That said, you can download user-created Steam Input Xbox controller configurations just fine on the Aya Neo Next, which can be helpful for games that don’t fundamentally require a mouse as part of their design. That’s how I was able to play the original <em>Half-Life</em>, for example, even though it isn’t listed as working with controllers. If it had been released in 2022 instead of 1998, it would have had dual-analog controller support like any other modern FPS, but that just wasn’t a factor back then. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Lm9-IyFP9TWCvzrOZLLxCuMGoHc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23306153/IMG_2180.jpg\">      <figcaption>The analog sticks have a lot of throw and Aya says they should be more reliable than conventional designs. It’s hard to test that right now, of course.</figcaption>  </figure></div><p id=\"cTuG8I\">The Aya Neo Next blows away the Switch on a technical level, needless to say. <em>Monster Hunter Rise</em> is one of the best-looking games on Nintendo’s system, but this can easily run it on max settings and double the framerate. <em>Doom Eternal</em> also runs at 60fps on medium, a huge improvement on what was considered a technically impressive but clearly compromised Switch port. And the Switch’s equally herculean version of <em>The Witcher 3</em> frankly looks unplayable next to what you can get on a device like this.</p><p id=\"4EGtb0\">Since both the Steam Deck and the Aya Neo Next have 60Hz screens, it makes sense to target 30fps or 60fps in most games. The Steam Deck tends to have a framerate advantage in benchmarks, but in practice, the Deck’s extra GPU power will be best used in turning a few settings higher up than the Aya Neo Next while maintaining the same locked framerate. Or, if they prefer, Steam Deck owners can turn in the same performance as the Aya Neo Next with the wattage turned down, saving power. I haven’t come across a game that is playable on the Steam Deck and not on the Aya Neo Next for pure horsepower reasons, but it’s inevitable that examples will emerge down the line. There are games that you might want to run on low settings on the Aya Neo Next that are playable on the Steam Deck on medium, and eventually, there’ll be games that will only run on the Steam Deck on low.</p><div class=\"c-float-right c-float-hang\"><aside id=\"fhIoYD\"><q>Future support for the Neo remains an unknown</q></aside></div><p id=\"gzLnvH\">Unsurprisingly, the Aya Neo Next’s battery life isn’t great. As with most gaming laptops and the Steam Deck, you can only really expect a couple of hours of high-intensity play when you’re away from an outlet, though the Aya Neo Next does at least charge faster than the Deck at up to 65W with USB-C PD. Endurance varies not only based on which game you’re playing but which graphical settings you’re using, while the simple Aya Space overlay gives you further options to lower the wattage to extend battery life. The “balanced” option is 15W, but there’s also a 20W “game” setting, an 11W power-saving mode, and a custom option. You can adjust the fan speed, too, which isn’t intolerably loud even at full blast but can still be heard over the speakers. </p><p id=\"IjUXVL\">One unknown about the Aya Neo Next is how well it’ll be supported. Aya Neo is a relatively new company, and it’s always a risk buying something this expensive from Indiegogo, though previous Aya Neo handhelds have shipped successfully. (Aya Neo even went as far as to ship “<a href=\"https://www.ayaneo.com/article/195\">upgrade kits</a>” for a recent hardware redesign that early adopters could slot their existing motherboards and batteries into.) Still, Valve will likely be better equipped to deal with any Steam Deck problems that may arise. On the other hand, Valve isn’t able to make anywhere near enough Steam Decks to meet demand — if you haven’t got a preorder in already, it seems unlikely you’ll be able to buy one in 2022. That alone could make the Aya Neo Next an attractive option for some people since its price will be a lot more competitive when compared to Steam Deck resellers on eBay. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uFlKg_uT1iHZpNhOrqACnd3rurk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23306154/IMG_2195.jpg\">      <figcaption>The AyaSpace overlay works as a game launcher.</figcaption>  </figure></div><p id=\"co5goS\">If you could walk into a store and buy a Steam Deck for $399, and its software was less buggy, and you were able to painlessly install Windows, it would be hard to recommend the Aya Neo Next. But none of those things are true yet, so it’s worth considering on its own merits. Yes, you’re theoretically paying (a lot) more for slightly worse performance. But you’re getting much more storage, more compatible software, and a design you may well prefer.</p><p class=\"c-end-para\" id=\"u47PKS\">The Steam Deck is a more ambitious and potentially mainstream product, but right now, the Aya Neo Next does a better job of achieving its more modest, niche, pricier goals. Both products are far from perfect, but they show that truly portable PC gaming is now a viable category that’s only going to grow from here on out. I’m impressed with what Aya Neo has been able to do with the Next, and I expect bigger manufacturers will get on board with this form factor soon enough.</p><p id=\"hggDVI\"><em>Photography by Sam Byford / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qL7-5Ne3meTUjt-MaJzvnaSeVl8=/0x40:2040x1108/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23306148/IMG_2179_3.jpg",
  "description": "The compatibility you crave, at a price you might not",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}