{
  "title": "Ayn Odin review: a Nintendo Switch with Android",
  "url": "https://www.theverge.com/23026461/ayn-odin-review-android-gaming-handheld",
  "date": "2022-04-16T12:00:00.000Z",
  "author": "Sam Byford",
  "content": "  <p>Cresting a new wave of inexpensive gaming handhelds</p> <p class=\"p--has-dropcap\" id=\"pjUbZ4\">There have been several attempts to create Android-based game consoles, but none have really gone to plan. The <a href=\"https://www.theverge.com/2013/4/4/4180242/ouya-review\">Ouya</a>, for example, was a high-profile Kickstarter success and a disastrous commercial <a href=\"https://www.theverge.com/2019/12/20/21029499/decade-fails-flops-tech-science-culture-apple-google-data-kickstarter-2010-2019\">flop</a>. Nvidia’s streaming-focused <a href=\"https://www.theverge.com/2013/7/31/4573596/nvidia-shield-review\">Shield</a>, meanwhile, evolved into a great streaming box but didn’t do much to make Android a better gaming platform. It turns out Google’s OS isn’t a panacea for building your own ecosystem.</p><p id=\"zrZIIu\">Recently, though, the open nature of Android and the accessibility of manufacturing have let countless smaller Chinese companies produce their own spin on the idea. You don’t have to have sweeping ambitions to build a platform ecosystem if all you want to do is sell to a small crowd of retro game enthusiasts. Companies like Retroid and Anbernic are churning out cheap, low-powered Android handhelds in a variety of shapes and sizes, usually with emulation in mind.</p><p id=\"cLOgs6\">The $200–$300 (depending on configuration) <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.indiegogo.com%2Fprojects%2Fodin-the-ultimate-gaming-handheld%23%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23026461%2Fayn-odin-review-android-gaming-handheld\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Ayn Odin</a> is a new Android handheld that builds on that approach. It’s made by a small company in Shenzhen without any aspirations to create a brand new gaming platform, instead entrusting you to run whatever game you want on the device from the start. But it’s powerful enough to play more types of games than any of its Android competitors, while its design and control layout give it much more flexibility.</p><div id=\"7KEmDb\"><div data-anthem-component=\"scorecard:11145153\"></div></div><p id=\"oyaKz6\">The Odin’s design inspiration is pretty obvious: it’s basically a <a href=\"https://www.theverge.com/2019/9/19/20873717/nintendo-switch-lite-review-price-specs-features-games-launch-date\">Nintendo Switch Lite</a> running Android. As someone who used a Switch Lite for a couple of years, though, I actually think Ayn’s hardware is better. The 5.98-inch 1080p LCD is bigger and sharper. The grips are more comfortable and house useful customizable rear buttons. The D-pad appears to be identical to the PlayStation Vita’s, which is a very good thing. The sticks are a little lower-profile than the Switch’s, but they’re comfortable and easy to use. </p><p id=\"QX1ruq\">Overall, build quality is impressive for this kind of device. The unit I’ve been testing comes in a Super Nintendo-style grey and purple colorway, which is a great look. There’s blue LED lighting on the sides of the device and underneath the analog sticks, which I don’t mind but am glad can be turned off. Up top, there’s a flap similar to the one that hides Switch game cards, except here it covers a microSD card slot and a Micro HDMI port. The only real complaint I have about this hardware is the goofy Odin logo underneath the D-pad. </p><p id=\"TsfCkR\">There are a few different versions of the Odin. I’ve been testing the $287 Odin Pro, which has a Qualcomm Snapdragon 845 processor, 8GB of RAM, and 128GB of storage. The $239 non-Pro Odin has the same Snapdragon 845 but half the RAM and storage. The $198 Odin Lite also has 64GB of storage and 4GB of RAM but swaps the Snapdragon out for a newer MediaTek Dimensity D900. All models are available to order through Indiegogo, though the Lite has only just started shipping to backers. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xXO3hB4XL1uHOmV6_uKgClmAVJU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23391692/IMG_2472.jpg\">      <figcaption><em>The Odin has blue LED lighting under the sticks and on the sides.</em></figcaption>  </figure><p id=\"ATfkCe\">The Snapdragon 845 is what flagship Android phones used in 2018, so you’re getting the raw performance of a Samsung Galaxy Note 9 or a Google Pixel 3. The difference, though, is that the Odin has active cooling, so it’s able to run the processor at its highest speed for longer periods of time, unlike thin smartphones, which don’t have fans and need to throttle their performance to stay cool. The Odin’s fan is almost inaudible on its normal setting, very quiet in performance mode, and about on par with a Nintendo Switch at its loudest in high performance mode. It’s a lot less noticeable than handheld PCs like the <a href=\"https://www.theverge.com/22960536/steam-deck-faq-valve-one-month-later\">Steam Deck</a> and the <a href=\"https://www.theverge.com/22972334/aya-neo-next-review-vs-steam-deck-windows\">Aya Neo Next</a>.</p><div class=\"c-float-right\"><aside id=\"aDOrd2\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Steam Deck review: it’s not ready\",\"url\":\"https://www.theverge.com/22950371/valve-steam-deck-review\"},{\"title\":\"Aya Neo Next review: a Steam Deck alternative with Windows\",\"url\":\"https://www.theverge.com/22972334/aya-neo-next-review-vs-steam-deck-windows\"}]}'></div></aside></div><p id=\"e78wTT\">A chip found in Android phones from three or four years ago may not sound impressive, but it’s far more powerful than what you’d get with most other Android handhelds, which often use low-powered MediaTek or Rockchip SoCs. Those devices are intended to play games from 2D consoles or, at a stretch, early 3D systems like the original PlayStation and Nintendo 64. The Odin, though, is able to emulate more advanced consoles like the Dreamcast, PSP, and GameCube. Between its bigger 16:9 screen and built-in controls, it’s a more convenient and console-like experience than using a newer Android phone with an external controller, even if you sacrifice a little performance.</p><p id=\"rXNAVF\">Emulation is inherently hit and miss, and your results will vary depending on how you tweak settings and which emulators you choose. Overall, though, I found the Odin to do a great job with the three aforementioned systems. Generally, you can at least expect GameCube games to run at their original resolution and frame rate, sometimes with an occasional hitch. Not everything worked — I couldn’t get the GameCube version of <em>NBA Street V3</em> to load past the intro sequence, for example, despite <em>V2</em> (which is better anyway) running fine. PSP games were a revelation, on the other hand, with most of them able to be run at far higher resolution and with better performance than the original hardware. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CqOPH81vWS0cHeZNsYmXBYnXyLA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23391693/IMG_2474.jpg\">      <figcaption><em>There are two buttons on the back of the grips.</em></figcaption>  </figure><p id=\"8RfQg6\">Even on more powerful PCs, PS2 emulation is trickier due to Sony’s proprietary “Emotion Engine” CPU with its custom instruction set. The Odin can run some PS2 games, but I wouldn’t buy it expecting to get a seamless, glitch-free experience with a majority of the system’s library. GameCube versions of games, where they exist, will almost always be a better option if you’re looking to play something from that console generation.</p><p id=\"qFDF1l\">The Steam Deck is an obvious comparison, and while I don’t have one in hand to test side by side, it’ll clearly perform much better for emulation than the Odin. <a href=\"https://www.google.com/url?q=https://www.youtube.com/watch?v%3DfMxVO_eUgEY&amp;sa=D&amp;source=docs&amp;ust=1650047573272318&amp;usg=AOvVaw3f2Hzvqhnow0-CYZ5TSkh1\">Here’s a video</a> showing that you can even get good results with PS3 games on the Deck, which can be notoriously challenging. On the other hand, the Steam Deck is much bigger and more expensive than the Odin (not to mention harder to buy), so it might be overkill for emulation if you’re mostly interested in older games.</p><div class=\"c-float-right\"><aside id=\"31oI9O\"><q>Lots of ways to fill a gaming library</q></aside></div><p id=\"SSWT28\">The Odin is a really great device for streaming games, as long as you’re in Wi-Fi range. It has all the controls you need, and its big 16:9 display is the perfect size and sharpness. I played a ton of Xbox Game Pass titles and found the Odin to be a much better experience than any phone, even one with a controller attached. Streaming games isn’t for everyone yet, but if it works with your connectivity and play style, it’s a good way to expand the capabilities of the Odin. (One unfortunate note: while Sony’s PS4 and PS5 Remote Play app runs fine on the Odin if you pair a DualShock or DualSense controller, I couldn’t get it to work with the built-in controls.)</p><p id=\"9SZnvK\">Native Android games also work well, and you can download anything from the included Google Play Store. The Snapdragon 845 might not be the latest chip, but there aren’t many Android games that can’t get decent performance on it. <em>Genshin Impact</em> is the usual stress test, and I got a solid 30fps at default settings. Games with controller support automatically treat the Odin as if you have a pad hooked up over Bluetooth, and Ayn’s software layer also lets you easily map touchscreen commands to the Odin’s physical controls in games like <em>Genshin</em> and <em>Call of Duty Mobile</em>. </p><p id=\"RsFcdr\">The one major game I couldn’t get to run was <em>Fortnite</em>, which first returned an error message telling me to disable a developer mode I hadn’t turned on, then booted me from any match I attempted to enter because of “internet lag, your IP or machine, VPN usage, for cheating, or being on an untrusted platform.” None of those issues should have applied, needless to say, except apparently the last one. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-Uwn08Au8HDMtw3e_5OdpdjMtus=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23391694/IMG_2475.jpg\">      <figcaption><em>Up top, there’s a power button, a volume rocker, an exhaust for the fan, and a flap that covers a microSD card slot and a Micro HDMI port.</em></figcaption>  </figure><p id=\"hcBmyj\">The Odin’s software is essentially stock Android 10 — the Lite model has Android 11 —  with Google services included, as well as an optional launcher. I found this launcher useful for system-level features like adjusting fan speed and the LED lights, but it requires you to add all your games manually in order to launch them, which I didn’t really find to be worth the effort over just using regular Android for basic operations. Google’s OS isn’t perfectly optimized for 6-inch landscape displays, but at least it’s familiar and works the way you’d expect. </p><div class=\"c-float-right\"><aside id=\"OIA3sq\"><q>No native Netflix but other options</q></aside></div><p id=\"itCLRb\">While Netflix doesn’t show up in the Play Store, other streaming apps like Prime Video do, though you might have to turn the Odin on its side to use the phone-style UI before your video starts. If you’re really adventurous, you can install the Arm-based version of Windows on the Odin through an open-source project specifically for the Snapdragon 845; I did not try this and don’t think it would be a good idea for most people, but hey, the option is there.</p><p id=\"aHfaty\">As with any handheld gaming device, battery life depends on what you’re doing with it, but I found the Odin’s to be generally very good. The Pro version has a 6,000mAh battery, which is bigger than any phone that doesn’t make a giant battery its main selling point, while the regular Odin and Odin Lite’s are a still-pretty-big 5,000mAh. I didn’t do dedicated rundown tests, but I haven’t found myself ever needing to rush to a charger in my time with it — it’s not like the Steam Deck, where you’re lucky to get a couple of hours from newer games. The Odin and Odin Pro support Qualcomm’s Quick Charge up to 4.0+, while Ayn claims the Lite has unspecified “fast charging.”</p><p id=\"GuVyfj\">Another charging-related feature I wasn’t able to test was the Odin’s “Super Dock,” a charging stand with a ton of ports. There are four USB-A 3.0 ports, an HDMI out, USB-C, Ethernet, and unusually, two Nintendo 64 controller ports and two more for GameCube controllers. I can’t speak to how well the dock works, but it’d certainly be a unique way to play <em>Super Smash Bros.</em></p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ginA8R16GzFHP04R056l7WeY0wM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23391690/IMG_2473.jpg\">      <figcaption><em>I love the Vita-esque D-pad, but it’s a shame about the logo.</em></figcaption>  </figure><p id=\"rTSX07\">It’s hard to fault the Ayn Odin for what it sets out to do. Android might not be the perfect ready-made gaming platform, but it’s allowed Ayn to build great hardware, step back, and give the user the responsibility of figuring out what to run on it. For a certain kind of person, this will make them very happy.</p><p id=\"khWCh6\">Streaming, traditional Android gaming, and emulation are all relatively niche use cases, of course, when compared to something like a Nintendo Switch Lite. That’s a $199 machine designed solely to play Nintendo Switch games, and if that’s what you’re after, it obviously does a much better job. The Odin won’t be for everyone.</p><p class=\"c-end-para\" id=\"kmEgwc\">But there’s something to be said for putting the flexibility of Android into a well-made, capable portable console and letting you do what you want with it. While Ayn doesn’t have its own games store to lean on, the Odin’s appeal is that it does for Android what the Steam Deck does for PC gaming — it brings the platform to a convenient form factor and says “hey, go check out what this thing can do.”</p><div><div id=\"H3UIIj\"><div data-anthem-component=\"aside:11145344\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/TRTi7GN5utgrL9pShBfOxFC4-9k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23391688/IMG_2471.jpg",
  "description": "Is this the best Android gaming hardware yet?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}