{
  "title": "Batman tickets to cost more than other films at AMC theaters",
  "url": "https://www.theverge.com/2022/3/2/22957881/batman-tickets-amc-pricing-premium",
  "date": "2022-03-02T10:51:49.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5mQh5t3tjOlY9C7hova0AlRh6SM=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70568599/rev_1_TBM_56056JOrv4_High_Res_JPEG.0.jpeg\" />        <figcaption>Image: Warner Bros</figcaption>    </figure>  <p id=\"mjznGB\">AMC is experimenting with charging more for tickets to <em>The Batman</em> compared to other films showing at its cinemas, <a href=\"https://deadline.com/2022/03/amc-entertainment-ceo-adam-aron-batman-tickets-variable-pricing-box-office-1234968595/\"><em>Deadline</em> reports</a>. The move appears to be an attempt to capitalize on the heightened anticipation for the new superhero movie, which sees Robert Pattinson take on the role of the caped crusader for the first time. <em>Deadline</em> reports that tickets to see <em>The Batman</em> currently cost a dollar more than other films like <em>Uncharted</em> and <em>Dog</em> at the AMC Empire 25 in Times Square. </p><p id=\"1hNGuK\">“Currently, our prices for The Batman are slightly higher than the prices we are charging for other movies playing in the same theaters at the same time,” AMC Entertainment CEO Adam Aron said during an earnings call. “This is all quite novel in the United States, but actually AMC has been doing it for years in our European theaters. Indeed, in Europe we charge a premium for the best seats in the house — as do just about all sellers of tickets in other industries — take sports events, concerts and live theater, for example.” </p><div class=\"c-float-right\"><aside id=\"RWdmrz\"><q>“Currently, our prices for The Batman are slightly higher”</q></aside></div><p id=\"U8LD1A\">It’s relatively common to see UK-based AMC subsidiary Odeon charge more to sit in “Premier” seats in the middle of its cinemas. I’ve just checked preces at my local Odeon in South London, where the more premium seating costs £9.50 (around $12.65) compared to £7.50 (around $10) for a regular seat. The same Odeon is also charging £10 (around $13.30) to see <em>The Batman</em> this Friday, compared to £7.50 for <em>Sing 2</em>. </p><p id=\"YkB1vC\">AMC’s experiments around <em>The Batman</em> are a continuation of a variable pricing policy where it’s charged more for weekend tickets compared to midweek showings in select cinemas, <em>Deadline</em> notes. </p><p id=\"qzTJTS\">The new pricing strategy comes as AMC’s business was hit hard by the pandemic; at one point in October 2020 it warned that there was a possibility of it <a href=\"https://www.theverge.com/2020/10/13/21514822/amc-theaters-cash-movies-delays-closing-pandemic-debt-regal\">running out of cash by the end of the year</a>. Instead, the company found itself at the center of a <a href=\"https://www.theverge.com/2021/6/2/22465198/amc-meme-stock-popcorn-wsb\">memestock trading frenzy</a> that may have <a href=\"https://www.washingtonpost.com/business/2021/02/02/amc-wallstreetbets-stock-debt/\">helped reverse the company’s fortunes</a>. But while memes are fun, AMC’s business inevitably comes down to selling cinema tickets. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/snpVB4A2fEabT-SaNX-aD252scY=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23277505/rev_1_TBM_56056JOrv4_High_Res_JPEG.jpeg",
  "description": "Premium pricing for a blockbuster movie.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}