{
  "title": "Battle at Ukraine’s largest nuclear power plant raises global alarm",
  "url": "https://www.theverge.com/2022/3/4/22960816/ukraine-nuclear-power-plant-fire-russia-zaporizhzhia",
  "date": "2022-03-04T14:31:32.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Zaporizhzhia NPP: Europes largest nuclear power plant\" src=\"https://cdn.vox-cdn.com/thumbor/5GTfhFbzMSUra_YudHDJNKKYaEI=/448x0:5028x3053/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70578638/1157646583.0.jpg\" />        <figcaption>Two cooling towers dominate the landscape as the Zaporizhzhia Nuclear Power Plant is situated on the bank of the Kakhovka Reservoir formed on the Dnipro River, Enerhodar, Zaporizhzhia Region, southeastern Ukraine, July 9, 2019.&nbsp; | Photo credit should read Dmytro Smolyenko/Future Publishing via Getty Images</figcaption>    </figure>  <p id=\"YSKQYP\">A fire broke out at the site of Ukraine’s largest nuclear power plant<strong> </strong>during an apparent Russian <a href=\"https://www.iaea.org/newscenter/pressreleases/update-10-iaea-director-general-statement-on-situation-in-ukraine\">attack</a>, Ukrainian officials <a href=\"https://twitter.com/iaeaorg/status/1499571709774422017\">told</a> the International Atomic Energy Agency (IAEA). The fire at the Zaporizhzhia power plant has been put out and did not affect the nuclear reactors’ safety systems. Radiation levels at the plant <a href=\"https://twitter.com/iaeaorg/status/1499562515340177416\">remained the same</a>, the IAEA reported early morning on March 4th.</p><p id=\"Id6a5H\">The fire started when a projectile hit a training building near one of the plant’s reactors, the agency said. The incident heightened concerns about vulnerabilities at Ukraine’s nuclear facilities during Russia’s invasion. This is the first time war has broken out in a place so heavily reliant on nuclear energy. Ukraine typically gets over half of its electricity from four nuclear power plants with a total of 15 reactors — each of which now faces <a href=\"https://www.theverge.com/2022/3/2/22958029/russia-invasion-ukraine-unprecedented-risk-nuclear-power-plants\">vulnerabilities</a>. Six of those reactors are at Zaporizhzhia. </p><div class=\"c-float-right\"><aside id=\"GNunlU\"><q>“Firing shells in the area of a nuclear power plant violates the fundamental principle that the physical integrity of nuclear facilities must be maintained and kept safe at all times.”</q></aside></div><p id=\"OuEnWj\">“I’m extremely concerned about the situation at the Zaporizhzhia NPP and what happened there during the night. Firing shells in the area of a nuclear power plant violates the fundamental principle that the physical integrity of nuclear facilities must be maintained and kept safe at all time,” IAEA Director General Rafael Mariano Grossi said in a March 4th <a href=\"https://www.iaea.org/newscenter/pressreleases/update-11-iaea-director-general-statement-on-situation-in-ukraine\">press release</a>.</p><p id=\"xPO0mg\">The biggest potential threat the fire could have posed there was most likely damage to the plant’s electrical and cooling systems — which are vital for preventing a disastrous meltdown. The reactors must be kept consistently cool to prevent fuel from melting and releasing radioactive emissions. Since Russia started its invasion of Ukraine, most of the reactors at Zaporizhzhia have been <a href=\"https://snriu.gov.ua/en/timeline?&amp;type=posts\">shut down</a> so that they no longer supply power to the grid. Shutting them down lowers the amount of energy and water needed to keep them cool.<strong> </strong>Others are operating at reduced capacity or in “low power mode,” according to the <a href=\"https://www.iaea.org/newscenter/pressreleases/update-11-iaea-director-general-statement-on-situation-in-ukraine\">IAEA</a>. But every reactor, including those that have been shut down, still needs juice from the grid or some other external power source to run their cooling systems.</p><p id=\"TVKXLp\">“Certainly an out-of-control fire is one of the biggest threats to a nuclear plant,” Edwin Lyman, director of nuclear power safety at the Union of Concerned Scientists, tells <em>The Verge</em>. It could sever electrical cables and knock out control and safety systems at the plant. </p><div class=\"c-float-left\"><aside id=\"QMvSjf\"><q>“Certainly an out-of-control fire is one of the biggest threats to a nuclear plant.”</q></aside></div><p id=\"O8z2Wb\">If a nuclear power plant’s cooling systems go down, there are still several safety nets that would need to fail before a catastrophic fuel meltdown. It might be able to rely on diesel generators or portable water pumps, for example, to keep the reactors safe. But that will also depend on how accessible the site is throughout fighting and fire.</p><p id=\"x2CSdf\">“The situation naturally continues to be extremely tense and challenging because of the circumstances,” Grossi said at a <a href=\"https://www.youtube.com/watch?v=-zsIMfTEUjs\">press conference</a> today. Regulators have not been able to access the whole site to assess all of its operating systems. </p><p id=\"f6TaVi\">One of the biggest concerns now is the wellbeing of Zaporizhzhia’s staff. While Russia has control of the site, it’s still being operated by regular staff. Their safety and ability to focus on the job are crucial to the plant’s security. Two people were reportedly injured overnight, according to the IAEA. Russia also likely has control of the village where most of the plant employees live, Grossi said in a March 2nd <a href=\"https://www.iaea.org/press/press-conferences\">press conference</a>. <a href=\"https://www.washingtonpost.com/climate-environment/2022/02/28/ukraine-nuclear-plant-chernobyl-russia/\">Fighting for control of the area</a> around the plant has raged since the start of the week.</p><p id=\"P0Vcrd\">Ukraine asked the IAEA this week for “<a href=\"https://www.iaea.org/newscenter/pressreleases/update-6-iaea-director-general-statement-on-situation-in-ukraine\">immediate assistance</a>” in keeping its nuclear facilities safe, including <a href=\"https://www.energoatom.com.ua/en/press_center-19/company-20/p/ua_calls_the_fact_of_chnpp-48958\">pressing</a> NATO to deny access to airspace above nuclear facilities. The greatest threats, according to the IAEA and experts whom <em>The Verge</em> spoke with, remain grid failures and munitions strikes that might take out cooling systems or otherwise compromise fuel inside the reactors or in cooling pools used to store spent materials. The IAEA “continues to consult with Ukraine and others” on how to provide assistance, the intergovernmental agency said in a March 3 <a href=\"https://www.iaea.org/newscenter/pressreleases/update-9-iaea-director-general-statement-on-the-situation-in-ukraine\">statement</a>.</p><p id=\"nPXF96\">Ukraine is already the site of the worst nuclear power plant disaster in history, at Chernobyl — where one reactor exploded in 1986. Russia seized <a href=\"https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste\">control of Chernobyl</a> last week. Workers there are under “psychological pressure and moral exhaustion,” Ukraine’s state nuclear power company Energoatom <a href=\"https://www.energoatom.com.ua/en/press_center-19/company-20/p/ua_calls_the_fact_of_chnpp-48958\">reported</a> on March 3rd.</p><aside id=\"QbKKGj\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Ukraine’s nuclear power plants are at ‘unprecedented’ risk as fighting continues \",\"url\":\"https://www.theverge.com/2022/3/2/22958029/russia-invasion-ukraine-unprecedented-risk-nuclear-power-plants\"}]}'></div></aside><aside id=\"hVnbt2\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"What does Russia’s invasion of Ukraine mean for Chernobyl? \",\"url\":\"https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste\"}]}'></div></aside><p id=\"X5AKyY\"></p><p id=\"0eVhHW\"></p><p id=\"RZ2S8Z\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KnFpKm0vC-WQgGvzTX9cbqLrs_M=/0x94:5476x2961/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23287069/1157646583.jpg",
  "description": "A fire at the Zaporizhzhia nuclear power plant has been put out.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}