{
  "title": "BBC resurrects WWII-era shortwave broadcasts as Russia blocks news of Ukraine invasion",
  "url": "https://www.theverge.com/2022/3/4/22961286/bbc-news-blocked-in-russia-ukraine-invasion-shortwave-radio",
  "date": "2022-03-04T10:53:14.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"The BBC logo is seen at the entrance at Broadcasting House,...\" src=\"https://cdn.vox-cdn.com/thumbor/5TacnZ7qhFCxAZqwv8Mfm-Z_7yk=/137x0:4864x3151/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70577791/1237793043.0.jpg\" />        <figcaption>Photo by Vuk Valcic/SOPA Images/LightRocket via Getty Images</figcaption>    </figure>  <p id=\"jX9GSk\">The BBC is resorting to broadcasting news bulletins over shortwave radio in Russia after the country blocked access to BBC websites, <a href=\"https://www.theguardian.com/media/2022/mar/04/bbc-website-blocked-in-russia-as-shortwave-radio-brought-back-to-cover-ukraine-war\"><em>The Guardian</em> reports</a>. The BBC <a href=\"https://www.bbc.co.uk/mediacentre/2022/millions-of-russians-turn-to-bbc-news\">announced</a> it was bringing back the WWII-era broadcasting technology in the region just hours before its sites were banned. News of the ban was also reported by Russian state news agency RIA. </p><p id=\"ocZoRk\">Shortwave radio uses frequencies that carry over long-distances and are accessible on portable sets. The BBC says its shortwave broadcasts will be available on frequencies of 15735 kHz from 6pm to 8pm and 5875 kHz from midnight to 2am, Ukraine time. News will be read in English, which the BBC says will be available in Kyiv as well as “parts of Russia.” </p><div id=\"0oS3JP\"><blockquote class=\"twitter-tweet\"><p lang=\"ru\" dir=\"ltr\">Скачайте наше приложение в AppStore (<a href=\"https://t.co/JJJuK7Ol07\">https://t.co/JJJuK7Ol07</a>) и GooglePlay (<a href=\"https://t.co/WJe4sqoFPh\">https://t.co/WJe4sqoFPh</a>) – оно доступно и работает. И подпишитесь на нас в соцсетях, чтобы следить за самыми важными новостями.<br><br>Ссылки на наши соцсети – в шапке профиля.</p>— bbcrussian (@bbcrussian) <a href=\"https://twitter.com/bbcrussian/status/1499524763554877441?ref_src=twsrc%5Etfw\">March 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"VqcsrO\">Shortwave radio has a long history of wartime broadcasts. <em>The Guardian</em> reports that its usage peaked during the Cold War, but that it was also used throughout WWII to broadcast propaganda. The BBC World Service ended its use of the technology in Europe in 2008 after 76 years.</p><p id=\"f5EM3H\">The state-owned <a href=\"https://t.me/rian_ru/151021\">Russian RIA news agency</a> reported that in addition to blocking BBC News, the Russian communications watchdog Roskomnadzor has also restricted access to the US government-funded Radio Liberty, US state-owned radio broadcaster Voice of America, Meduza (a Russian and English-language news site based in Latvia), and German state-owned broadcaster Deutsche Welle. </p><p id=\"IKRNlw\">The BBC’s Russia Twitter account is also advising that Russians download its iOS and Android apps as a workaround to access its online coverage. In 2019, the corporation also launched a <a href=\"https://www.bbc.co.uk/blogs/internet/entries/936e460a-03b3-41db-be96-a6f2f27934e6\">Tor Onion domain</a>, which is designed to offer a more secure, higher performance, and censorship-resistant way to access its website via Tor browsers compared to a typical .com or .co.uk URL. The BBC’s current onion domain is: https://www.bbcnewsd73hkzno2ini43t4gblxvycyac5aw4gnv7t2rccijh7745uqd.onion. </p><p id=\"2srur6\">The BBC earlier reported that its Russian-speaking audience had seen a huge increase since the country’s invasion of Ukraine. Direct traffic to its Russian language coverage was more than triple its usual levels last week (10.7 million visits versus an average of 3.1 million), while visitors to its English-language content in Russia increased by 252 percent last week. Visits to its Ukrainian-language coverage more than doubled.</p><p id=\"AN3VHc\">“In a conflict where disinformation and propaganda is rife, there is a clear need for factual and independent news people can trust,” said BBC director-general Tim Davie. “We will continue giving the Russian people access to the truth, however we can.”</p><p id=\"qtzLuI\">While the BBC’s reach is being limited inside Russia, Russian state-backed media organizations RT and Sputnik are being targeted outside of the country by <a href=\"https://www.theverge.com/2022/2/28/22955542/facebook-meta-blocks-rt-sputnik-eu-instagram\">tech</a> <a href=\"https://www.theverge.com/2022/3/1/22956114/youtube-blocks-russian-media-rt-russia-today-sputnik-europe\">platforms</a> and <a href=\"https://www.theverge.com/2022/2/27/22953563/eu-ban-russia-aircraft-state-backed-media-ukraine-sanctions\">regulators</a> alike. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rjK1bBVogEvalJ-3Ghz48xoA1kc=/0x267:5000x2885/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23287669/1237793043.jpg",
  "description": "US and German publications are also reportedly affected.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}