{
  "title": "Beanstalk founders dismissed concerns about governance attacks before losing $182 million",
  "url": "https://www.theverge.com/2022/4/22/23037325/beanstalk-dismissed-governance-attacks-lost-182-million",
  "date": "2022-04-22T17:53:49.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KydHFgub4zpYN2V0s2pq2-JqZKQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70781663/acastro_210106_4957_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"KdO4o1\">On April 17th, the decentralized finance (DeFi) project Beanstalk Farms was exploited for $182 million after an attacker mounted a lightning-fast hostile takeover, buying a controlling stake of tokens and <a href=\"https://www.theverge.com/2022/4/18/23030754/beanstalk-cryptocurrency-hack-182-million-dao-voting\">immediately voting to send themself all of the funds</a>.</p><p id=\"yHnEIY\">The incident sparked discussion around “governance attacks,” a way of manipulating blockchain projects that use decentralized governance structures by gaining enough voting rights to reshape the rules.</p><p id=\"v8oeIZ\">In the wake of the attack, chat logs and video evidence show that the founders were warned about the risk of exactly this kind of attack, but they dismissed community members’ concerns.</p><p id=\"497KDr\">The Beanstalk exploit was made possible by another DeFi mechanism known as a “flash loan,” which allows users to borrow large amounts of cryptocurrency for very short periods of time. In the case of the recent hack, the attacker borrowed close to $1 billion in cryptocurrency assets <a href=\"https://docs.aave.com/faq/flash-loans\">through a service called Aave</a>, exchanged them for a 67 percent share in the Beanstalk project, voted through their own proposal to withdraw the entire treasury, and returned the borrowed funds — all in less than 13 seconds.</p><p id=\"Gj7Hdl\">Though the attack shocked Beanstalk users — some of whom <a href=\"https://twitter.com/AndrewPikul/status/1515694173629947916\">claimed to have lost six-figure sums</a> of money — the threat of a governance attack was raised in Beanstalk’s Discord server months previously <em>and</em> in at least one public AMA session held by Publius, the development team behind the project.</p><p id=\"iVVh1Q\">On February 12th, in a discussion room centered around a proposal to accept more kinds of cryptocurrency tokens in the “Silo” (Beanstalk’s central fund reserve), a user with the screenname Mr Mochi wrote:</p><blockquote><p id=\"C0CBeK\"><em>Because of governance attacks, bribes and voter manipulation, governance doesn’t always go as it should. Is this a risk we are willing to take or will there also be an Emergency DAO (like Curve’s) who can block potential attacks?</em></p></blockquote><p id=\"Ce22XW\">Later they added:</p><blockquote><p id=\"E46Kvz\"><em>There’s absolutely ways to mitigate some of this concern in an elegant manner ... As far as I can tell, the current rule-set does not account for flash loan governance attacks or rugpull tokens.</em></p></blockquote><p id=\"58RCBc\">Replying to the comment, a Publius admin account wrote that such manipulation was “not a concern in any capacity until Stalk [governance token] is liquid.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gegwxGmhJws4FwkwAtgusbt8qes=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23409354/FlashLoanQuestion.png\">  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3XjiIpighG-4w7wg76thDNiqWTs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23409372/Governance_manipulation.png\">  </figure><p id=\"0ZDNhR\">A concern about flash loans was also raised in an AMA-style session hosted by Publius on April 12th, a video of which is <a href=\"https://www.youtube.com/watch?v=u7Twx9PnraI\">available on YouTube</a>. Around 6 minutes into the video, a participant asks via chat: “Can the team go into ... why the protocol isn’t susceptible to flash loan type attacks?” </p><p id=\"FyHIQB\">In response, a member of Publius discusses protections against price manipulation via flash loans but doesn’t address the possibility of flash loan-driven governance attacks. </p><p id=\"PmLVIU\">With Beanstalk’s assets entirely depleted by the attack, the project has <a href=\"https://bean.money/blog/path-forward\">launched a 10-day fundraiser</a> to try to replenish the lost funds. Without the benefit of VC funding, the company lacks the kind of deep pockets that have helped other hacked protocols <a href=\"https://www.coindesk.com/business/2022/02/03/jump-trading-backstops-wormholes-320m-exploit-loss-sources/\">backstop even bigger losses</a>. But with the fate of the company hanging in the balance, the success of the fundraiser will depend largely on the community’s trust in the founding team to not make similar mistakes again.</p><p id=\"bQj7lz\">Reached via Discord, Publius had not responded to a request for comment by time of publication.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6rhljt2S18ZkbtuluvW28p4U3yQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23151312/acastro_210106_4957_0001.jpg",
  "description": "One user asked, \"Is this a risk we are willing to take?\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}