{
  "title": "Behind Mark Zuckerberg’s big plans for AR glasses",
  "url": "https://www.theverge.com/23022611/meta-facebook-nazare-ar-glasses-roadmap-2024",
  "date": "2022-04-13T15:00:00.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9B2MKcxc01hG3NE7YO8t1D9KTX8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70744467/acastro_220411_5130_0001.0.jpg\" />        <figcaption>Photo Illustration by Alex Castro / The Verge Photo by Kevin Dietsch / Getty Images</figcaption>    </figure>  <p>Meta is racing to release its first AR glasses in 2024, but sources believe it’ll take a lot longer for them to become mainstream</p> <p class=\"p--has-dropcap p-large-text\" id=\"nDeHQ0\">Mark Zuckerberg has a grandiose vision for the metaverse, and he hopes that you’ll one day see the same thing, too — quite literally, through a pair of augmented reality glasses.</p><p id=\"ZCEXqg\">Zuckerberg calls AR goggles a “holy grail” device that will “redefine our relationship with technology,” akin to the introduction of smartphones. During the special effect-laden video announcing Facebook’s corporate <a href=\"https://www.theverge.com/22749919/mark-zuckerberg-facebook-meta-company-rebrand\">rebrand to Meta last October</a>, they acted as the connective tissue for his metaverse pitch, letting people play games and work with virtual humans <em>Star Trek</em>-style. At one point, Zuckerberg wore them while fencing with a hologram. “Don’t be scared to stab,” his virtual sparring partner quipped.</p><p id=\"HT6ATg\">Zuckerberg may have big hopes for smart glasses, but the near-term reality of the technology is far less lofty. The demonstrations during Zuckerberg’s Meta presentation, such as playing virtual chess on a real table with someone’s avatar, weren’t based on any functioning hardware or software. And Meta doesn’t yet have a working, wearable prototype of its planned AR glasses but rather a stationary demonstration that sits on a table. </p><p id=\"gK0aJd\">Still, Zuckerberg has ambitious goals for when his high-tech glasses will be a reality. Employees are racing to deliver the first generation by 2024 and are already working on a lighter, more advanced design for 2026, followed by a third version in 2028.​​ The details, which together give the first comprehensive look at Meta’s AR hardware ambitions, were shared with <em>The Verge</em> by people familiar with the roadmap who weren’t authorized to speak publicly. A spokesperson for Meta declined to comment for this story.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lt8cpl7HBGwsIOZJE49gyIb7Vf8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385758/Zuckerberg_fencing_Meta_Connect.png\">      <cite>Image: Meta</cite>      <figcaption><em>Mark Zuckerberg fences with a hologram during his metaversion vision presentation last October.</em></figcaption>  </figure></div><p id=\"Hrzdn9\">Animating the push for AR glasses and Facebook’s rebrand to Meta is a desire by Zuckerberg to cast the company he founded as innovative once again, people familiar with his thinking say. The social network’s reputation has been stained by a series of privacy and content moderation scandals, hurting <a href=\"https://www.theverge.com/2021/11/16/22785397/meta-facebook-leak-lockdown\">employee morale</a> and faith in leadership. Regulators are trying to break the company up and curb its business of personalized advertising. And among its Silicon Valley peers, it has become known as a ruthless copycat. </p><div class=\"c-float-right c-float-hang\"><aside id=\"FN3acW\"><q>“He wants it to be an iPhone moment”</q></aside></div><p id=\"rqJGgd\">If the AR glasses and the other futuristic hardware Meta is building eventually catch on, they could cast the company, and by extension Zuckerberg, in a new light. “Zuck’s ego is intertwined with [the glasses],” a former employee who worked on the project tells me. “He wants it to be an iPhone moment.”</p><p id=\"xbL6ms\">Meta’s CEO also sees the AR glasses, dubbed Project Nazare, as a way to get out from under the thumb of Apple and Google, which together dictate the terms that apps like Facebook have to abide by on mobile phones. The first version of Nazare is designed to work independently from a mobile phone with the assistance of a wireless, phone-shaped device that offloads parts of the computing required for the glasses to operate. A marquee feature will be the ability to communicate and interact with holograms of other people through the glasses, which Zuckerberg believes will, over time, provide people with a more immersive, compelling experience than the video calling that exists today.</p><p id=\"yvqpOa\">Despite already spending billions on developing its AR glasses, Meta internally has tepid sales expectations in the low tens of thousands for the first version, which will be aimed at early adopters and developers. A price point hasn’t been decided, but the device will certainly be pricier than the company’s $299 Quest VR headset, given that the AR glasses bill of materials is multiple thousands of dollars. The cost will test Zuckerberg’s willingness to subsidize the price of the hardware to encourage adoption — a competitive strategy intended in part to undercut the margins enjoyed by other players like Apple.  </p><p id=\"AULWHY\">In addition to Nazare, a separate, previously unreported pair of cheaper smart glasses codenamed Hypernova are also planned for 2024. Nazare is designed to operate independently of a smartphone, but Hypernova will pair with a nearby phone to show incoming messages and other notifications through a smaller, heads-up display, similar to the North smart glasses <a href=\"https://www.theverge.com/2020/6/30/21308281/google-north-focals-glasses-purchase-acquire\">Google acquired</a> two years ago. </p><p id=\"b3o9Ts\">Together with Nazare, Hypernova, and future versions of <a href=\"https://www.theverge.com/2021/9/9/22662809/facebook-ray-ban-stories-camera-smart-glasses-hands-on\">the Ray-Ban camera-equipped glasses</a> it recently introduced, Meta hopes to be selling tens of millions of smart glasses towards the end of this decade, its VP of AR, Alex Himel, has told employees.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bRwIzWQU2rpNavn33gftoqf53eg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385765/AR_chess_demo_Meta_Connect.png\">      <cite>Image: Meta</cite>      <figcaption><em>A demo illustrates how Meta imagines AR glasses could work to let someone play chess with a hologram.</em></figcaption>  </figure></div><p id=\"G3Bz4e\">It’s unclear if people will find AR glasses useful in the next few years. Similar products from Microsoft, Snap and others are far from mainstream. And the stakes couldn’t be higher for Meta. Its division making metaverse hardware and <a href=\"https://www.theverge.com/2022/4/11/23020684/meta-horizon-worlds-test-creators-sell-virtual-items-monetization\">related software</a> has swelled to roughly 18,000 people, costing the company $10 billion last year alone. To build the glasses and future VR hardware, Meta has aggressively poached from Microsoft, Apple, Google, and others, driving up the price of talent across the industry. </p><p id=\"KupsWU\">Zuckerberg has said he plans to increase spending on building AR and VR hardware in the years to come, an immense bet happening while his business is under pressure from all sides. Meta’s stock has been hammered due to its <a href=\"https://www.theverge.com/2022/2/2/22914970/facebook-app-loses-daily-users-first-time-earnings\">slowing social media business</a> and younger users <a href=\"https://www.theverge.com/creators/2022/2/3/22916642/snapchat-and-facebook-future-of-social-media-tiktok\">flocking to competitors like TikTok</a>. Antitrust scrutiny has essentially ruled out big acquisitions that kickstarted growth in the past, like the purchase of Instagram and WhatsApp. And after kneecapping Meta’s core ads business with <a href=\"https://www.theverge.com/2021/4/27/22405474/apple-app-tracking-transparency-ios-14-5-privacy-update-facebook-data\">recent tracking changes in iOS</a>, Apple is readying an assault on Zuckerberg’s hardware strategy, too, starting with a <a href=\"https://www.theverge.com/2022/1/14/22883790/apple-virtual-augmented-mixed-reality-ar-vr-headset-launch-2023\">high-end, mixed reality headset</a> as soon as this year and eventually its own AR glasses.</p><p id=\"cV8Dyt\">Since Nazare was brought out of research in 2018 with the internal codename Orion, Zuckerberg has shown a special interest in the project. “It’s like the eye of Sauron,” one former team member says, referring to the all-seeing eye in <em>Lord of the Rings</em>. (Zuckerberg himself recently admitted <a href=\"https://fortune.com/2022/04/07/meta-employees-call-mark-zuckerberg-eye-of-sauron/\">in a podcast</a> that employees sometimes use the phrase to explain his intense involvement in a project.) </p><p id=\"p5u2bb\">Zuckerberg has insisted that the first version of Nazare offer a full AR experience with 3D graphics, a large field of view, and a socially acceptable design. The team originally hoped for it to boast a 70-degree field of view — far wider than what’s currently on the market — but that goal likely won’t be met. The current design of the glasses slightly resembles Superman’s black frames when he’s disguised as Clark Kent. They weigh 100 grams, which is about four times more than a typical pair of normal glasses.</p><p id=\"KZYmvV\">While Meta is racing towards a 2024 ship goal, there’s no guarantee that Nazare will meet that target. Its ship year has already slipped multiple times. Work is still very much underway on the product experience, especially on the software side. An effort to build a custom microkernel operating system for the device off a version of Google’s open-source Fuchsia OS was scrapped at the end of last year, in part because it wasn’t going to be ready in time for 2024. (<a href=\"https://www.theinformation.com/articles/meta-platforms-halts-vr-and-ar-operating-system-project?rc=k5vrz1\"><em>The Information</em></a> earlier reported the decision to scrap the microkernel OS.) Now Meta is pursuing a version built on top of Android for the first version of the AR glasses — a similar approach to what powers the company’s current Quest VR headset.</p><p id=\"uQfgAB\">Nazare won’t be a mainstream device, at least not at first. Its current battery life is only four hours, and the glasses are intended to be used mostly indoors. Even though it will take a while before the glasses sell in high volume, Zuckerberg has spared no expense. The displays are powered by costly custom waveguides and microLED projectors. The first version will have eye tracking and a front-facing camera, along with stereo audio in the frame. Employees are working with semiconductor fabs in Asia to build custom chips for the planned roadmap through the latter half of this decade.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/r4rhW2jk4Vw7T4ELqm17d1HKU8s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385795/CTRL_Labs_Meta_Connect.png\">      <cite>Image: Meta</cite>      <figcaption><em>Last October, Meta presented a conceptual demo of how its EMG wristband could work to let people type without a physical keyboard.</em></figcaption>  </figure></div><p id=\"aGPg4B\">Perhaps the most futuristic aspect of the first versions of both Nazare and Hypernova is <a href=\"https://www.theverge.com/2021/3/18/22338008/facebook-reality-labs-emg-wristbands-ctrl-labs-ar-interface-demo\">a wrist device</a> Meta plans to bundle with the glasses for controlling them, hypothetically, with the wearer’s mind — something that will likely be the company’s next big privacy hurdle. The wristband uses differential electromyography, or EMG, to measure electrical pulses in the arm’s neurons, essentially creating the effect of a phantom limb the wearer can use to interact with the glasses. The result is that someone can essentially think to type or control a virtual interface, which Meta believes will aid in interacting with smart glasses that don’t have a touchscreen, mouse, or keyboard. The tech is based on the company’s <a href=\"https://www.theverge.com/2019/9/23/20881032/facebook-ctrl-labs-acquisition-neural-interface-armband-ar-vr-deal\">roughly $1 billion acquisition</a> of a startup <a href=\"https://www.theverge.com/2018/6/6/17433516/ctrl-labs-brain-computer-interface-armband-hands-on-preview\">called CTRL-Labs</a> in 2019.</p><div class=\"c-float-left c-float-hang\"><aside id=\"PYn1j8\"><q>“If CTRL-Labs works, none of this other stuff needs to matter”</q></aside></div><p id=\"ObIFgm\">Everyone I’ve talked to who has tried a prototype of the band Meta is working on says it’s one of the most impressive tech demos they’ve ever experienced. If it works at scale, the company thinks it could have the next mouse and keyboard. A focus has been getting the EMG to work through the display and other tech built onto the wristband. “If CTRL-Labs works, none of this other stuff needs to matter,” according to one former senior Meta employee.</p><p id=\"ZnhfHS\">In the nearer term, Meta is planning to <a href=\"https://www.theverge.com/2021/6/9/22526266/facebook-smartwatch-two-cameras-heart-rate-monitor\">debut its first-ever smartwatch</a> as soon as this year. While the first and second versions won’t have CTRL-Labs tech built in, the plan is for the third generation to include it and tie up with the debut of Nazare and Hypernova in 2024. A second version of the company’s smart glasses with Ray-Ban is also in the works, as <a href=\"https://www.theinformation.com/articles/meta-platforms-is-struggling-to-develop-its-own-device-chips?rc=k5vrz1\"><em>The Information</em></a> recently reported. Meta sold about 120,000 pairs of the glasses with Ray-Ban during the period when it went on sale last September through December, missing its initial goal of 300,000. On the VR side, a <a href=\"https://www.theverge.com/2021/10/28/22749008/facebook-oculus-project-cambria-pro-vr-ar-headset\">higher-end headset</a> codenamed Cambria with pass-through video capable of blending the real and virtual worlds is being readied for later this year, ahead of a similar device Apple is planning to release.</p><div class=\"c-float-right c-float-hang\"><aside id=\"rVulUQ\"><q>“You have to really be a missionary to see this through. It will take decades.”</q></aside></div><p id=\"1pKwQr\">As Zuckerberg’s involvement with Nazare has deepened and the project has become more of a priority, the team has seen a fair amount of turnover, with the recent heads of product, design, and software departing. He has installed longtime company leaders in key positions, reporting up to <a href=\"https://www.theverge.com/22752986/meta-facebook-andrew-bosworth-interview-metaverse-vr-ar\">CTO Andrew Bosworth</a>. The VP of AR who oversees all glasses products under Bosworth, Alex Himel, has been at the company for 13 years. And the direct leader for Nazare under Himel is Sue Young, who has worked at Facebook for a decade. Two other senior leaders on the team are hardware engineering head Caitlin Kalinowski, who recently moved over from running hardware for Oculus, and former Microsoft executive Don Box, who now runs software engineering for the glasses.</p><p class=\"c-end-para\" id=\"Qexozh\">Even though Zuckerberg has already staked his claim on the metaverse, it’s going to be a long time for AR glasses to possibly garner mainstream appeal. “You have to really be a missionary to see this through,” someone who has been involved with Nazare says. “It will take decades.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/P73PHgiNkkhGp3-gXUAOa2EOKGY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385460/acastro_220411_5130_0001.jpg",
  "description": "With the company’s first AR glasses coming in 2024, sources say \"he wants it to be an iPhone moment.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}