{
  "title": "Bel-Air trades in The Fresh Prince’s Black joy for overwrought prestige",
  "url": "https://www.theverge.com/22906769/bel-air-peacock-review-fresh-prince",
  "date": "2022-02-09T16:00:33.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Olly Sholotan as Carlton, and Jabari Banks as Will in Bel-Air.\" src=\"https://cdn.vox-cdn.com/thumbor/b3IWogK5-z1lt7h75gB_AQfA1hE=/0x0:1350x900/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70488321/2_1.0.jpeg\" />        <figcaption>Peacock</figcaption>    </figure>  <p>The Fresh Prince of Peacock has arrived in Bel-Air</p> <p class=\"p--has-dropcap\" id=\"9I2qxZ\">NBC’s <a href=\"https://www.theverge.com/2020/11/15/21566042/trailers-fresh-prince-breach-black-beauty-happiest-season-pixar-netflix-hulu-hbo-disney\"><em>Fresh Prince of Bel-Air</em></a><em> </em>was always a comedy with a pointed focus on celebrating Blackness while also illustrating how there is no singular way to be Black. <em>Bel-Air</em>, Peacock’s new single-cam reimagining of the series from filmmaker Morgan Cooper and Will Smith, exists in a similar narrative space as its predecessor with an updated story about a young knucklehead from West Philly whose mom ships him off to Los Angeles for his own good. But where the original show often felt like a fresh journey you were meant to be embarking on alongside a fictionalized Will Smith, the new series often plays like an uneven mythologization of its central figure that gets bogged down by the weight of its own presumed greatness.</p><p id=\"tNXS4e\">Before <em>Bel-Air</em>’s Will (Jabari Banks) has a chance to properly introduce himself, the series first presents you with a kind of prophetic dream sequence about the high school basketball player that wordlessly conveys some of the same premise described in <em>The Fresh Prince</em>’s theme song. Though this Will isn’t a storytelling rapper detailing the major beats of his origin story every episode, the premiere opens on him sitting on a throne in a great hall tagged up with glowing glyphs pulsing in time to J.Cole’s “No Role Modelz.”</p><div id=\"jfngGs\"><div ><iframe src=\"https://www.youtube.com/embed/_-_P9DPMuy8?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"vciSPY\">Just how much Will remembers these recurring dreams when he’s awake isn’t especially clear. But what he, his mom Vy (April Parker Jones), and seemingly everyone in Philadelphia knows is that he’s destined for untold levels of success — some of it basketball-related — so long as he manages to keep himself out of trouble. Trouble, of course, has a way of finding Will, and <em>Bel-Air</em>’s first few episodes spend a significant amount of time trying to unpack what that means for him and his family.</p><p id=\"CHNlyR\">Like <a href=\"https://www.theverge.com/2020/9/9/21428647/fresh-prince-of-bel-air-will-smith-reboot\">Cooper’s <em>Bel-Air</em></a><em> </em>short film/fan trailer from 2019 that first put him on the radar of <a href=\"https://www.hollywoodreporter.com/business/business-news/will-smith-jada-pinkett-smith-westbrook-kevin-mayer-tom-staggs-2-1235069608/\">Smith’s Westbrook Studios</a>, Peacock’s series firmly roots Will in a working-class, predominantly-Black chunk of Philadelphia in order to give you a sense of the culture shock he experiences once he’s in California. Will loves Philly, and the city loves him back, but his reputation as a rising basketball star with dreams of going pro put him at odds with people like neighborhood corner boy Darnell (Sloan “D4M $loan” Morgan), and Darnell’s drug-pushing boss, Rashad (Philly rapper Eazy the Block Captain), who also wants Will working for him. </p><div class=\"c-float-right c-float-hang\"><aside id=\"15VRy3\"><q>Just how much Will remembers of these recurring dreams isn’t especially clear</q></aside></div><p id=\"J1YKvn\">When a pickup game ends with guns being drawn, the police arriving, and Will leaving the scene in handcuffs, <em>Bel-Air </em>shifts into the familiar, foreboding tones of prestige dramas about people making it out of the inner city. It’s all meant to highlight the sharp contrast between Will’s hometown and the new world he ends up being spirited away to, and it works to a certain extent. But by the time <em>Bel-Air</em> actually drops Will off with his aunt Viv (Cassandra Freeman) and uncle Phil (Adrian Holmes), the series is already so deep into a story about a kid basically going into the witness protection program to save his life that it’s easy to forget that this is a reboot of a sitcom.</p><div id=\"0BDTq4\"><div ><iframe src=\"https://player.vimeo.com/video/322620538?h=875b32e79a&amp;app_id=122963&amp;byline=0&amp;badge=0&amp;portrait=0&amp;title=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"encrypted-media;\"></iframe></div></div><p id=\"zDpjsb\">It’s once Will touches down at LAX and crosses paths with cab driver Jazz (Jordan L. Jones) that <em>Bel-Air </em>starts to find its rhythm and feel confident in its ability to make you take it seriously without having to try so hard. At times, like when <em>Bel-Air</em>’s hammering home how important Will and Jazz’s burgeoning friendship is to their feeling a sense of community in LA, that confidence is warranted. When it comes to <em>Bel-Air</em>’s approach to class commentary and its new take on the Banks family, though, the show struggles in large part because of its tendency to conflate overwrought seriousness with quality storytelling.</p><p id=\"xFpIDt\">To <em>Bel-Air</em>’s credit, all of its characters are given new levels of depth and interior complexity that <em>The Fresh Prince</em>’s half-hour, multi-cam format didn’t quite lend itself to. Here, Phil’s a powerful lawyer running for district attorney who worries that his financial success might alienate him from voters living paycheck to paycheck. Viv’s a respected art history teacher and Phil’s better half who rightfully sees his campaign as part of <em>their </em>shared political ambitions, all the while keeping just enough of an eye on their three children to be present, but not overbearing.</p><p id=\"X3mN5z\">Compared to Will, Viv, and Phil whose characterizations <em>Bel-Air </em>only changes up but so much, the series updates Hillary (Coco Jones), Carlton (Olly Sholotan), and Ashley (Akira Akbar) in ways that speak to both <em>Bel-Air</em>’s strengths and its weaknesses. It makes sense that the Hillary Banks of 2022 would be an up-and-coming influencer who hasn’t <em>quite </em>figured out how to capitalize on her digital popularity — much to the consternation of her mother and her mother’s influential group of sorors. Because <em>Bel-Air </em>doesn’t frame the Banks family as being so ensconced in wealth that Will is almost foreign to them, you can see why it’s easy for Ashley and her older sister to welcome him into their home.</p><div class=\"c-float-left c-float-hang\"><aside id=\"qef1Et\"><q><em>Bel-Air </em>reimagines Carlton as a Candace Owens-like villain</q></aside></div><p id=\"Bs3sLi\">It’s for that same reason, though, that <em>Bel-Air</em>’s characterization of Carlton, a popular lacrosse player with a reputation for surrounding himself with white people, feels like such a misfire, even though it’s very much trying to build on ideas about Black conservatism that were present in the original series. Every series needs a villain, and Will and Carlton’s rivalry-turned-camaraderie is a beloved part of this franchise. But rather than simply depicting its Carlton as being uncomfortable with his cool cousin moving in, <em>Bel-Air </em>reimagines him as a Candace Owens type, whose internalized anti-Blackness borders on the kind of absurdity you usually only see in Tyler Perry’s more heavy-handed productions.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XIz2jNOrGmg27OCHzY-Roz5UgC8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23227648/NUP_195316_03789.jpeg\">      <cite>Peacock</cite>      <figcaption>Phil Banks speaking at at an event alongside his children.</figcaption>  </figure><p id=\"wjJbAv\">It’s hard, at times, to imagine <em>Bel-Air</em>’s Carlton actually growing up alongside his siblings, or that neither of his parents seem to know about their son’s frequent and voluntary trips to the Sunken Place. That’s the sort of ugly, heavy thing that Will’s meant to draw attention to as his presence has an influence on his family. But because the show plays up the antagonism between the cousins so intensely, it’s not exactly clear what <em>Bel-Air </em>is building to or what it’s trying to say about its subject matter.</p><p class=\"c-end-para\" id=\"KLFISp\">What is clear is that <em>Bel-Air </em>was crafted with fans in mind — not simply fans of <em>The Fresh Prince</em>, but fans of the figure that the real Will Smith has become over the course of his decades-long career. For every clever callback to its predecessor, <em>Bel-Air </em>finds a way to remind you that it’s also the Will Smith Show™ as if there’s any room for doubt as to who the main character here is. Based just on <em>Bel-Air</em>’s first three episodes that were provided to press, it’s difficult to say whether the series is going to end up comfortably settling into its tendency to feel like a Smith-centric vanity project, or if it can manage to rise above that. The potential’s all there, but <em>Bel-Air </em>just has to figure out how to fully tap into it.</p><p id=\"MDCLUy\"><small><em>Bel-Air </em></small><small>debuts on Peacock on February 13th.</small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bcyg3zAP00Umm9sLTaoHOcIizJQ=/0x62:1600x900/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23227629/2_1.jpeg",
  "description": "Bel-Air’s stuck somewhere between being a gritty reboot and a vanity project",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}