{
  "title": "Belkin’s Wemo is the best HomeKit video doorbell, but it’s not perfect",
  "url": "https://www.theverge.com/22922576/belkin-wemo-video-doorbell-apple-homekit-camera-review",
  "date": "2022-02-09T19:32:26.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "  <p>It’s fast and secure, but there are better options outside the walled garden</p> <p class=\"p--has-dropcap p-large-text\" id=\"ZxGwZe\">Apple HomeKit users are a patient bunch. The development of HomeKit compatible products has been a slow process, especially when compared to competing platforms like Amazon Alexa and Google Home. Case in point, video doorbells. Arguably one of the most popular devices in the smart home, the doorbell camera category is woefully slim on options for Apple users. The new Belkin Wemo Video Doorbell is one of just a handful of currently available options for HomeKit users in the US, joining the<a href=\"https://www.theverge.com/22318478/logitech-circle-view-doorbell-homekit-review-test-price\"> Logitech Circle View</a> and the<a href=\"https://www.amazon.com/Smart-Video-Doorbell-Netatmo-Installation/dp/B08R6FFJ9F?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\"> Netatmo Smart Video Doorbell</a>. (<a href=\"https://www.amazon.com/Arlo-Essential-Wired-Video-Doorbell/dp/B07YMV9VMT?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Arlo’s wired doorbell</a> also works with HomeKit, but you need a $100 Arlo hub to get started).</p><p id=\"G3ptFF\">The <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.belkin.com%2Fus%2Fsmart-home%2Fwemo%2Fwemo-smart-video-doorbell%2Fp%2Fp-wdc010%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22922576%2Fbelkin-wemo-video-doorbell-apple-homekit-camera-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$250 Belkin Wemo Video Doorbell</a> is a fast and secure option, thanks to its tight integration with HomeKit and support for HomeKit Secure Video. It has decent 1200 x 1600 HD video with HDR, a selection of useful features for keeping an eye on your front door, and an easy installation process. It’s pricey, on par with<a href=\"https://www.theverge.com/22359973/ring-video-doorbell-pro-2-review\"> Ring’s top-of-the-line (and very good) Ring Pro 2</a>. But it’s not the most expensive HomeKit option — the Netatmo is $300 and doesn’t support HKSV.</p><div id=\"7epXbs\"><div data-anthem-component=\"scorecard:11020078\"></div></div><p id=\"gJ3rJB\">The Wemo is a wired doorbell that connects to low-voltage (16-24v AC) doorbell wiring (there are no battery-powered HomeKit doorbell cameras). If you have a mechanical chime, you can attach a small chime box to your mechanical chime circuit to ring it when the doorbell is pressed. You can also connect the doorbell to a HomePod or HomePod Mini to have the speaker make a pleasant “ding dong” sound (this isn’t customizable, though, as is the case with other doorbells that use digital chimes or connect to Alexa and Google smart speakers). </p><p id=\"VJPFQX\">The doorbell is short and chunky with a noticeable curve toward the top, which helps the camera look down at the floor where packages generally lurk. It’s over 2 inches deep and 5 inches tall when used with its mount — large, especially for a wired doorbell that doesn’t need to squeeze in a big battery. But it has a nice design, all black except for a steel grey pad where the button is, and its curved edges provide a different look than the other HomeKit doorbells. Compared to the Logitech, the design makes it a lot clearer where to press the button. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AQdsa-NREx2qM-ku6Ey17dNRklc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226632/jtuohy_220125_5003_0017.jpg\">      <figcaption><em>The Wemo doorbell does a good job of making it clear which button to push to ring the doorbell.</em></figcaption>  </figure><p id=\"J7dEfT\">Installation is simple. Turn off power to your doorbell wiring and attach the included backplate to your doorframe (with or without the provided wedge mount to give you a different angle) using the included screws. Next, pull the wires through the hole in the middle, and attach them to the terminal screws on the bracket. Lastly, slide the doorbell on top of the mount and fasten the security screw. This installation is more straightforward than other HomeKit doorbells I’ve tested, where you need to connect the wires directly to the doorbell or through a fiddly connection unit.</p><p id=\"VTN1Nn\">While it made for an easy install, I did come across an issue where the Wemo ran out of power. It turned out the two connectors on the doorbell unit that are designed to transfer power from the wires weren’t getting enough of a connection. After some troubleshooting with Belkin support, I fixed it by slightly pulling out the connectors for a stronger connection and making sure the screws were tightened all the way down. After this fix, the doorbell stayed powered with no issues. If you don’t fancy messing with any wiring, Belkin has partnered with <a href=\"https://www.ontechsmartservices.com/products/wemo-smart-video-doorbell-installation-hdspcl\">OnTech to install the doorbell for $99</a>.</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ynkAiawXyFMTtylxsgGpJ48PmKM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226619/jtuohy_220121_5003_0002.jpg\">      <figcaption><em>The HomeKit-compatible Logitech, Netatmo and Belkin Wemo video doorbells.</em></figcaption>  </figure></div><p id=\"aHIras\">Once you have the doorbell powered up, adding it to HomeKit is also simple. Just tap your iPhone to the doorbell, and the phone recognizes it and pops up a pairing dialogue box. There’s no app to open, no code to scan; it’s all really seamless (you can scan the HomeKit code on the back of the doorbell if you prefer or run into trouble). The whole setup is done this way, without even going into the Home app. If you’ve set up a HomePod Mini or Apple TV, you’ll be familiar with the process. </p><p id=\"xVIOTH\">The phone then walks you through naming the doorbell, assigning it to a room, choosing when the camera will stream and / or record, who in your home can view those actions, and enabling face recognition if you choose. You can also decide if you want your HomePods and / or your existing chime to ring and set up a HomeKit suggested automation (such as turning on nearby lights when motion is detected — sadly, you can’t use the doorbell press to trigger an automation in the Home app). The entire process, from installation to set up, took less than 15 mins. There are more settings you can dive into in the Home app – and you will want to – but we’ll get to those later.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BuWQn9H7Xx7g3B_BodTzBpqWzHM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226626/jtuohy_220125_5003_0011.jpg\">      <figcaption><em>The Wemo’s mount wires to your doorbell wiring.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XWz37Xz3Hh-GKQuyOBOKQPYhmeM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226621/jtuohy_220121_5003_0005.jpg\">      <figcaption><em>The doorbell attaches to the mount with a single screw at the base.</em></figcaption>  </figure></div></div></div><p id=\"VBJYxL\">That simple setup comes with a downside: the Wemo Doorbell works with Apple HomeKit and only with Apple HomeKit. This means you must use an iOS device such as an iPhone to view video from the doorbell; it won’t work with Android at all. You will also want a HomeKit hub in your house (Apple TV, HomePod, or iPad) to get the most out of Wemo’s features (although it will work to stream live video without one).  </p><p id=\"xRp3gZ\">All this Apple focus means there’s no Google Home or Amazon Alexa compatibility. You are also limited to whatever features Apple deigns to roll out to its doorbell profile; Belkin can’t add anything itself as the doorbell doesn’t have an app of its own (and won’t work with the existing Wemo app). Currently, features found on other doorbells missing from HomeKit include automated quick replies, local storage of video, and the option to change the digital doorbell chime to a different tone or holiday theme. </p><p id=\"PMXoMm\">But a big reason to choose a HomeKit doorbell is for HomeKit Secure Video. This is Apple’s secure video storage service that ensures any recorded video is end-to-end encrypted and stored in your personal iCloud account, which no one can access without your permission. All video is processed locally on a HomeKit hub, and only recorded video is sent to the cloud. Storage costs are included with iCloud Plus plans, which start at $0.99 per month for one camera or doorbell, and you can have an unlimited number of clips up to 10 days old, but continuous recording is not an option.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Wx4w0R5thQkSOk4R8b8-X3zogoQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23229667/Belkin.jpg\">      <figcaption><em>The Wemo is controlled through the Home app where you can talk to visitors, adjust recording and detection settings and create automations triggered by motion at your door.</em></figcaption>  </figure></div><p id=\"tFvXFc\">The basic technology here is the same as most video doorbells. The Wemo Video Doorbell alerts you to various types of motion at your door or when someone presses the button. A notification pops up on your iPhone (or iPad, Apple Watch, and Apple TV, if you like), complete with an image thumbnail, and you can click on it to view a clip of the video or to go to the Home app, where you see a live view of your doorbell and a timeline of recent activity. If a person, package, pet, or vehicle was spotted, you see the corresponding icon by the clip. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kWD-E_uNzD-n-7flIROOUToAT3k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23229678/B0E6AB8E_B1FA_4CB6_A6DD_EDBFAC18E7DF.JPG\">      <figcaption><em>A great feature is the ability to see and talk to visitors from the notification screen, but night vision could be better.</em></figcaption>  </figure></div><p id=\"3HCTjw\">Usefully, the doorbell can alert you to multiple causes of motion at once — such as a person with a package, for example. Unhelpfully there’s nothing special about the package alert – other doorbells can keep monitoring the package for you and tell you when it’s gone, for example. With HomeKit, you get one notification. And even that was a bit spotty in my testing; there were at least three occasions when the Wemo completely missed the presence of a package on my porch.</p><p id=\"1xUEyC\">The speed of the doorbell, from button push to notification to pulling up the live video, was impressive, under five seconds in most cases. Quicker if you just use the interactive notification on your device (through which you can talk to the visitor and control other smart home devices, such as lights or a door lock). The advantage of being baked into the iPhone’s software is clear, as is the speed of using the local connection through a HomeKit hub and the option of a 5GHz Wi-Fi connection (it also works with 2.4GHz networks). Most non-HomeKit doorbells I’ve tested take upwards of 10 seconds (often longer) to show you a live view of your doorbell, by which point your visitor has most likely moved on.</p><p id=\"ADvcn5\">The video feed itself is notable as it’s different from the competition. The Wemo’s view is circular instead of square or rectangular, with a 3:4 aspect ratio. The official spec says 178-degrees vertical by 140-degrees horizontal, and 223 on the diagonal. In practice, you get an oval-shaped peek at your porch. A lot is going on top to bottom — I could see my entire porch and a good amount side to side. But it felt very squished — especially compared to the similar fisheye lens view from the <a href=\"https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera\">Wyze Video Doorbell Pro</a> I reviewed recently, which had a lot more room to breathe. Compared to its closest competitor, the Logitech, it provides a wider view, and you see more with the Wemo, but the Logitech gives you less distortion. </p><div id=\"Fp9DAQ\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Belkin Wemo Video Doorbell test footage|105877\" data-volume-uuid=\"2d5382d68\" data-volume-id=\"105877\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-485\" class=\"volume-video\"></div><div class=\"caption\"><em>Daytime video quality of the Belkin Wemo Video Doorbell.</em></div></div><p id=\"UJZ955\">Daytime video quality is good, not quite as clear as the Logitech (which has a 5-megapixel sensor compared to the Wemo’s 4), but it’s a minimal difference. Both have 5x digital zoom, but the two differ when it comes to night vision. Wemo uses what it calls “enhanced night vision,” whereas the Logitech dispenses with standard black-and-white night vision in favor of color night vision, aided by a blindingly bright LED light that will scare off your visitors. The Belkin has a similar LED light strip along its center, but it’s nowhere near as bright and just adds a bit of ambient light, helping nighttime visitors see the doorbell and where to press. It doesn’t help much with night vision, though, and this was the weakest part of Wemo’s video; it was quite blurry and pixelated, making it hard to decipher faces.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zdA3nOdYQ1ua99dpKXc2WxFfvF8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226634/jtuohy_220127_5003_0020.jpg\">      <figcaption><em>The Wemo’s has a subtle, always-on LED light strip.</em></figcaption>  </figure></div><p id=\"t9jweA\">As both doorbells work with Apple’s software, there’s little distinction in daily use beyond the view. However, in testing, I did notice one significant difference. The Wemo was less sensitive to small movements than the Logitech. While it picked up (almost) all movement on the porch and cars driving on the road in the far-field of view, it seemed to have a blind spot in the lower mid-range, frequently missing smaller motions the Logitech caught (such as a cat walking along the path in front of my door). Both doorbells rely solely on pixel-based motion detection (Ring, for example, uses pixel-based and PIR-sensing, which more accurately detects people). The HomeKit hub then analyzes the video to spot specific motion (people versus packages). Both HomeKit doorbells frequently mistook the shadow of a tree on my porch for a person, something a PIR sensor wouldn’t have an issue with.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MZZqQXxai7znP0avLwM7-1p6Eeg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23229721/side_by_side.JPG\">      <figcaption><em>This side-by-side comparison shows the field of view of Wemo compared to the Logitech (right). The Wemo sees much more of the porch area.</em></figcaption>  </figure></div><p id=\"mh8eRr\">While I would worry about missing some important events with the Wemo (it skipped a recent Amazon delivery entirely), the reduced sensitivity has some benefits compared to the Logitech. That doorbell is so sensitive to motion it made one of the neat features about a HomeKit doorbell – triggering automations with motion – basically unusable. I set one that turned on my hallway light when motion was detected, and the light turned on constantly. (My colleague Dan Seifert had a similar experience when <a href=\"https://www.theverge.com/22318478/logitech-circle-view-doorbell-homekit-review-test-price\">he tested the Logitech</a>). I set up the same automation with the Wemo, and it worked as expected. </p><div class=\"c-float-right\"><div id=\"aRH77A\"><div data-anthem-component=\"aside:11020050\"></div></div></div><p id=\"aEPxyh\">A good feature in HomeKit is how it handles recording and notifications. You can choose to have the doorbell record on all motion or just when it detects specific motion, but you can also select only to be alerted when it records a clip based on one or more triggers. I set it to record on all motion but only alert me to people, packages, and animals. This way, I could still scroll back through all the recorded activity at my front door without being bombarded with notifications. It’s also possible to choose when the camera records based on if you or members of your home are home or away.</p><p id=\"WeUETs\">A less useful HomeKit feature is Face Recognition. This can use photos stored in your Apple Photos library to identify people and even announce their name on any connected HomePods or Apple TVs. However, it was very unreliable in testing, only accurately identifying members of my household maybe three times out of 10. And while you can disable notifications for individual people (so you don’t constantly get an alert when you walk through your own door), because it’s so flaky, this isn’t a usable feature yet.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yXl_Z0PU1dqBRklbzLYSrleX9NQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226631/jtuohy_220125_5003_0016.jpg\">      <figcaption><em>The Wemo doorbell has a simple, modern design.</em></figcaption>  </figure></div><p id=\"lbiowC\">All things considered, the Belkin Wemo Video Doorbell is a better option than the Logitech Circle View (despite costing $50 more) for a fully-baked HomeKit video doorbell. The Wemo has a larger view, a more user-friendly design, and an easier install.</p><p id=\"pwoLOL\">However, what I really want to see is a full HomeKit doorbell made by a proper security camera company that uses more reliable motion detection and employs better night vision tricks (video quality and digital zoom are dictated by HomeKit). Logitech and Belkin don’t have an extensive track record in the space, and those that do – such as Eufy and Ring — haven’t stepped up with HomeKit compatibility. Choices for HomeKit video doorbells are still too limited, meaning you may want to look outside the bubble if you want the best experience (although you lose the benefits of HomeKit Secure Video, whether that’s worth it is a personal choice). </p><p id=\"YxZCdv\">Ring is still the leader here, and the excellent <a href=\"https://www.theverge.com/22359973/ring-video-doorbell-pro-2-review\">Ring Video Doorbell Pro 2</a> ($250) works just fine with an iPhone. It can see your entire porch and has the best motion detection of any doorbell we’ve tested. You do miss out on face recognition and smart alerts for vehicles and animals, and you’ll have to pay $3 a month to view recorded video. Arlo’s wired or battery-powered buzzers are less expensive and have the same smart alerts as you’ll get in HomeKit, but you’ll have to pay a separate monthly subscription fee. If you prefer something with less cloud reliance and no monthly fees, Eufy’s line has a lot of good options, both battery-powered and wired, with local storage. And of course, there’s <a href=\"https://www.theverge.com/22710545/nest-doorbell-battery-cam-battery-test-review-price-specs-features\">Google Nest’s doorbells</a>, which also have facial recognition and come in wired and battery options.</p><div><div id=\"0Abljn\"><div data-anthem-component=\"aside:11018410\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/QIjoAU0f1Hqyy2xdet0NR05GbUg=/0x208:2040x1276/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23226627/jtuohy_220125_5003_0013.jpg",
  "description": "It’s good, as HomeKit goes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}