{
  "title": "Best gaming laptop in 2022: seven laptops to get your game on",
  "url": "https://www.theverge.com/22295181/best-gaming-laptop",
  "date": "2022-02-07T17:20:33.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"Best Gaming Laptops 2021: Asus ROG Zephyrus G15 gaming laptop\" src=\"https://cdn.vox-cdn.com/thumbor/dFgjUrUVReawUz4BcRUID8XTWDI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/68856650/akrales_210226_4440_0019.9.jpg\" />        <figcaption><em>The best gaming laptop is the Asus ROG Zephyrus G15.</em> | Photo by Amelia Holowaty Krales/ The Verge</figcaption>    </figure>  <p>The best gaming laptop at every size and price</p> <p id=\"23pZwg\">The best gaming laptops are changing every year. The early days of mobile gaming were largely desktop replacements — clunky chassis, multiple power bricks, and RGB lighting galore. But the top contenders now are different. Manufacturers are finally putting powerful specs in sleeker, more portable, and more professional builds. They have excellent, fast refreshing screens that are necessary for a great gaming experience. These laptops aren’t just great for gaming, but for everyday work as well. </p><p id=\"qiHviH\">The best gaming laptop of 2022 is the <a href=\"https://www.theverge.com/22321471/asus-rog-zephyrus-g15-gaming-laptop-review\">Asus ROG Zephyrus G15</a>. It can handle the most demanding games on the market today and also makes a great daily driver.</p><p id=\"VRi2QJ\">We’ll be updating this page regularly as the best gaming laptops hit shelves throughout this year. Some exciting updates are on the way. AMD and Nvidia have announced their next-gen series of mobile processors and mobile graphics cards — the Ryzen 5000 series and the GeForce RTX 3000 series, respectively — and we’re already seeing them in premium gaming laptops across manufacturers.</p><p id=\"cGRnFN\">The <a href=\"https://www.theverge.com/2021/1/14/22217171/gaming-laptops-qhd-screens-display-fast-refresh-rate\">QHD screen</a> is another feature to watch for in the best gaming laptops. A growing number of manufacturers are releasing configurations with 1440p displays, even in gaming laptops under $2,000. These options can hit a sweet spot for many gamers: a better experience than 1080p without the price premium or raw horsepower required for a 4K display. You can expect decently high refresh rates from these panels as well, depending on the model. </p><p id=\"a5KtNO\">One more thing to keep in mind with the best gaming laptops is the power you can expect. Not all chips with the same name are created equal — the RTX 3070 in one laptop may not deliver the same frame rates as the RTX 3070 in another laptop due to its wattage (as well as other factors like the processor and cooling). Nvidia now requires companies to disclose clock speeds and graphics power on each model’s product page, but plenty of manufacturers <a href=\"https://www.theverge.com/2021/2/5/22266921/nvidia-requiring-companies-share-clock-speed-power-gaming-laptop-rtx-30-series-gpu-specs\">haven’t done that yet</a>. Your best bet, if you can’t find those numbers on a company’s website, is to read some reviews and make sure the model you’re considering will deliver the frame rates you’re looking for. We will note the wattage used in any laptops we review with the new RTX graphics cards. </p><p id=\"b1WSZi\">If you’re looking for a more multipurpose device, check out our <a href=\"https://www.theverge.com/21250695/best-laptops\">best laptop</a> page. If you’re an Android gamer, we’ve also got a list of the <a href=\"https://www.theverge.com/21296102/best-chromebooks\">best Chromebooks</a> you can buy.</p><h1 id=\"NqFABt\">Best Gaming Laptop</h1><hr class=\"p-entry-hr\" id=\"VQOCHc\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Best Gaming Laptop 2022: Asus ROG Zephyrus G15 gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WQts40hc8DMLBo4BPnPjc4j4RSI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22341895/akrales_210226_4440_0125.jpg\">      <cite>Photo by Amelia Holowaty Krales/ The Verge</cite>      <figcaption><em>The Asus ROG Zephyrus G15 is the best gaming laptop of 2022.</em></figcaption>  </figure></div><h2 id=\"oTToOm\">1. <a href=\"https://www.theverge.com/22321471/asus-rog-zephyrus-g15-gaming-laptop-review\">Asus ROG Zephyrus G15</a></h2><h3 id=\"rE8ByG\">The best gaming laptop</h3><p id=\"dqOSgQ\">Asus’s ROG Zephyrus G14 was our top gaming laptop pick for quite a while. It did just about everything right, and we weren’t sure whether Asus could ever replicate its resounding success. But somehow, the company managed to make the G14 just a bit bigger, and a heck of a lot better. In doing so, it’s created the ROG Zephyrus G15, the best 15-inch rig you can buy.  </p><p id=\"AsXGzm\">At just over four pounds, the Zephyrus G15 is one of the lightest 15-inch gaming laptops you can buy. But you’re not making any compromises on performance for that portability: it’s powered by the top mobile chips that AMD and Nvidia have to offer, and includes a fast 165Hz QHD (1440p) display. Together, those components can handle even the toughest AAA titles at QHD resolution. The panel has excellent color reproduction as well, so your games will look great. </p><p id=\"HMlhzT\">But it’s not just the gaming; almost everything else about the G15 is great, too. The audio (pumped from a six-speaker array) has strong percussion and bass, the keyboard and touchpad have a satisfying click, the port selection leaves little to be desired, and the battery can last for a whopping eight and a half hours. </p><p id=\"MktsFD\">The G15 won’t be the laptop for everyone. There’s no webcam, which is a significant oversight, and some may prefer something more affordable, or with a flashier aesthetic. But as a package, the G15 is the one to beat. Not only is it the best gaming laptop you can buy, but it’s also one of the best laptops you can buy, period. </p><div id=\"uMAFCa\"><div data-anthem-component=\"productcard:10385239\" data-anthem-component-data='{\"layout\":\"full_with_square_img\"}'></div></div><hr class=\"p-entry-hr\" id=\"PEmMiz\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Best gaming laptop 2022: Razer Blade Pro 17 gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1Hw1GXC0JJNr36nQ6K4vzlWTH-k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21820230/mchin_181119_4158_0015.0.jpg\">      <cite>Photo by Monica Chin / The Verge</cite>      <figcaption><em>The Razer Blade Pro 17 is a monster of a gaming laptop.</em></figcaption>  </figure></div><h2 id=\"yzdsDK\">2. <a href=\"https://www.theverge.com/21405760/razer-blade-pro-17-2020-review\">Razer Blade Pro 17</a></h2><h3 id=\"jT5h16\">The best big-screen gaming laptop</h3><p id=\"E8Fdz3\">The Blade Pro 17 delivers some of the best gaming performance you can find in a laptop — but that’s not even its superpower. What makes Razer’s 17-inch flagship so impressive is it packs that unbelievable power into a thin and attractive chassis. It’s just 0.8 inches thick and only requires one charging brick — so you can carry it around in a backpack or briefcase without compromising on power. </p><p id=\"kQQiQ0\">This year’s model comes with an FHD 360Hz screen — the highest refresh rate you can get on a laptop. It also has a customizable per-key RGB keyboard, which adds a touch of color without being too intense for the office. </p><p id=\"AsGaDN\">The Blade Pro 17 certainly isn’t cheap, but it’s the laptop to buy if you want the best of the best.</p><div id=\"wsMJEI\"><div data-anthem-component=\"productcard:9505921\"></div></div><hr class=\"p-entry-hr\" id=\"XCwzkS\">  <figure class=\"e-image\">        <img alt=\"Best Gaming Laptop 2022: Lenovo Legion 5 Pro gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/khIUMlJ2ktXDrUOk3uifG72ZgZ4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22653564/cfaulkner_20210608_4624_0012.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>The Legion 5 Pro is a powerful device with a massive 16:10 display.</em></figcaption>  </figure><h2 id=\"2kvoth\">3. <a href=\"https://www.theverge.com/22529429/lenovo-legion-5-pro-review-gaming-laptop-price-specs-performance-features\">Lenovo Legion 5 Pro</a></h2><h3 id=\"SAASF8\">A gaming laptop with a 16:10 screen</h3><p id=\"Yc2Q91\">The Legion 5 Pro is the best gaming laptop Lenovo has ever made. For well under $2,000, you get exceptional performance from AMD’s Ryzen 5000 processors in an attractive 16-inch chassis. It delivered respectable results on every game we tried, even at its native 2560 x 1600 resolution. And with the 165Hz display, you’ll be able to fully take advantage of the Legion 5 Pro’s power. </p><p id=\"7QoThO\">Performance aside, the highlight of the Legion 5 Pro is its 16:10 screen. A screen this tall is hard to find on the gaming laptop market these days, and it allows you more room for multitasking if you want to use the Legion 5 Pro as a daily driver. The keyboard is also a delight to use, with 1.5mm of travel and four-zone programmable backlighting. </p><p id=\"zoBjtO\">The Legion’s main downside is its battery life. We only got about four and a half hours of continuous use in our testing. While that’s not the worst we’ve ever gotten from a gaming laptop, it’s nowhere near what you’ll see from the G15. However, it does charge very, very fast with the included 300W power brick. Overall, though the G15 will be a better option for folks who often work on the go, the Legion is still a solid choice—and we have to give Lenovo props for the 16:10 screen.</p><div id=\"DJzER4\"><div data-anthem-component=\"productcard:10843973\"></div></div><hr class=\"p-entry-hr\" id=\"beUVtM\">  <figure class=\"e-image\">        <img alt=\"Best Gaming Laptop 2022: MSI GE76 Raider gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yTUDQEU2WPq8waFESfNBAvfUpOc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23191836/akrales_220124_4985_0005.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The MSI GE76 Raider is a colorful, powerful laptop with a premium price.</em></figcaption>  </figure><h2 id=\"WbNW1Y\">4. <a href=\"https://www.theverge.com/22900362/msi-ge76-raider-review-alder-lake-17-inch-gaming-laptop\">MSI GE76 Raider</a></h2><h3 id=\"8ctfUG\">The best laptop with flashy RGB</h3><p id=\"p53ouL\">The GE76 Raider costs an arm and a leg, but it packs some serious power. You can configure it all the way up to Nvidia’s top mobile GPU and Intel’s top processor., and it has the cooling to keep them in line (It’s currently available with 11th-Gen chips, but the 12th-Gen models should be available in a few weeks.) You can get it with a QHD screen (which we’d recommend for most people, as these hefty specs can take full advantage of it) as well as a 1080p 360Hz display.</p><p id=\"aMgcLu\">Keep in mind that this laptop is really just for gaming. Its battery life is mediocre, and its chassis is quite thick and heavy, so you’ll want to look elsewhere if you’re looking for a device that could double as a portable work driver. (The brick is also huge.) But if you’re looking for what’s essentially a desktop you could travel with, the GE76 Raider will deliver a premium experience.</p><div id=\"SpidSy\"><div data-anthem-component=\"productcard:11016660\"></div></div><hr class=\"p-entry-hr\" id=\"QxS9n2\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Best gaming laptop 2022: Asus ROG Strix G15 Advantage Edition gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4-MFImj_bClitaOWhNkct_TSxqo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22552472/mchin_20190821_4609_0010.jpg\">      <cite>Photo by Monica Chin / The Verge</cite>      <figcaption><em>The Asus ROG Zephyrus G15 Advantage Edition is powered by an impressive AMD processor.</em></figcaption>  </figure></div><h2 id=\"znrRHZ\">5. <a href=\"https://www.theverge.com/22465565/asus-rog-strix-g15-advantage-edition-gaming-laptop-review\">Asus ROG Strix G15 Advantage Edition</a></h2><h3 id=\"BzyEj8\">The best AMD gaming laptop</h3><p id=\"HhOl4t\">The ROG Strix G15 Advantage Edition is one of the few gaming laptops you’ll find that includes both an AMD processor and an AMD GPU. Not to worry — it delivers gaming performance on par with what you’ll see from laptops with Nvidia’s top GPUs. It also delivers one of the best gaming battery experiences we’ve ever seen — it was able to maintain playable frame rates on <em>Red Dead Redemption 2 </em>for over an hour with no charger attached. </p><p id=\"JHVLju\">Speaking of battery, we averaged nine hours and 16 minutes of work use between charges, which makes the Strix G15 far and away one of the longest-lasting gaming laptops on the market. That’s doubly impressive because it’s powering a ton of flashy LEDs, including a per-key RGB keyboard and a colorful light strip around the front edge of the deck. If you’re looking for a jazzy, bold design and you’re all-in on AMD, the Strix G15 Advantage edition is a great gaming laptop for you. </p><div id=\"p8WbEf\"><div data-anthem-component=\"productcard:10641674\"></div></div><hr class=\"p-entry-hr\" id=\"tOxdNl\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Best Gaming Laptop 2022: Razer Blade 14 gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BcbK0DjFD3FXDpcXKnqg9-2Nzxk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22675596/mchin_210621_4641_0002.jpg\">      <cite>Photo by Monica Chin / The Verge</cite>      <figcaption><em>The Razer Blade 14 is the best 14-inch gaming laptop of 2022.</em></figcaption>  </figure></div><h2 id=\"QEpIQu\">6. <a href=\"https://www.theverge.com/22548663/razer-blade-14-review-gaming-laptop-amd-ryzen-9-5900hx-nvidia-rtx-3070\">Razer Blade 14</a></h2><h3 id=\"OCz9wT\">The best gaming laptop in a 14-inch chassis</h3><p id=\"OanWnj\">If you’re looking for a powerful 14-inch device that can keep up with the best 15-inch gaming laptops on the market, the only place you’ll find that is the Razer Blade 14. This slim and portable device includes Nvdia’s RTX 3070 and RTX 3080, Nvidia’s top-of-the-line mobile GPUs, as well as a powerful eight-core AMD chip. It’s a gorgeous device, with a QHD 165Hz display option and a classy RGB keyboard. There’s even a reasonable port selection, including HDMI 2.1 as well as two USB-C ports.</p><div id=\"xwEKhI\"><div data-anthem-component=\"productcard:10803512\"></div></div><hr class=\"p-entry-hr\" id=\"ncjeoh\">  <figure class=\"e-image\">        <img alt=\"Best Gaming Laptop 2022: MSI GS76 Stealth gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8ofvJKd6AZ4GESW3KB1PTbVSNN8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890877/akrales_210928_4764_0023.jpg\">      <cite>Photo by Amelia Holowaty Krales</cite>      <figcaption><em>The MSI GS76 Stealth is a 17-inch gaming laptop most people should consider.</em></figcaption>  </figure><h2 id=\"8hVGol\">7. <a href=\"https://www.theverge.com/22916188/msi-gs76-stealth-review-17-inch-gaming-laptop-qhd\">MSI GS76 Stealth</a></h2><h3 id=\"dkcPNt\">A great 17-inch gaming laptop</h3><p id=\"oSlW8b\">If you like the look of RGB workhorses like the GE76 Raider, but the high prices and massive chassis are turnoffs, the GS76 Stealth may be a more pragmatic purchase for you. The keyboard has fun, customizable, per-key lighting. The lack of a lightstrip may be a disappointment for some gamers, but it does make the GS76 more feasible to bring into an office or other public place without turning heads. </p><p id=\"BmsRfY\">While the GS76 Stealth doesn’t have quite the same power as the top devices on the market, and it couldn’t quite take full advantage of its QHD screen on every title, it should still be able to run <em>most </em>games you might want to play at very respectable frame rates. And as one of the thinnest and lightest 17-inch gaming laptops out there, it’s a good option if you’re looking for a big-screen device that you can still carry around. </p><div id=\"oYlljk\"><div data-anthem-component=\"productcard:11016639\"></div></div><hr class=\"p-entry-hr\" id=\"EpSm1z\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Best Gaming Laptop 2022: Alienware X17 gaming laptop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/q85Q-sLwALCr0V01cfBqOIkh-Vo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22859891/akrales_210916_4757_0204.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The Alienware X17 is a powerful but surprisingly thin and quiet gaming device.</em></figcaption>  </figure></div><h2 id=\"J74U3a\">8. <a href=\"https://www.theverge.com/22765258/alienware-x17-review-4k-17-inch-gaming-laptop\">Alienware X17</a></h2><h3 id=\"lzKwju\">A gaming laptop with a 4K screen</h3><p id=\"m6FWbU\">There’s finally a laptop that can deliver an enjoyable gaming experience in 4K — as long as you’re prepared to fork over some real cash. The Alienware X17 (currently starting at $2,199) can run all kinds of modern titles at playable frame rates at its native 3840 x 2160 resolution. It could even stay close to 60fps with ray tracing on.  </p><p id=\"ULSQ9m\">The X17’s power isn’t its only standout quality. Dell has also managed to cram that power into an impressively thin and sleek chassis. It’s just 0.84 inches thick, with an RGB keyboard that isn’t too obnoxious and a touchpad that lights up when you press it. And it’s quite cool and quiet, even under heavy gaming loads.  </p><p id=\"lpAXv8\">On the other hand, the X17 would not be a good choice to double as a daily driver (though it did do well in our Premiere Pro testing). The webcam is mediocre, and the touchpad is a bit small, especially for a 17-inch notebook. Battery life only averaged around four hours in our testing. And while the chassis is compact, it’s still not light, weighing in at over six pounds. But if you’re looking for a 4K laptop that is, first and foremost, great at running games, this device should top your list. </p><div id=\"vlDZW0\"><div data-anthem-component=\"productcard:10901040\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/FDwsQFnSsL4WzLR5T34pDbFuAgM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22341888/akrales_210226_4440_0019.jpg",
  "description": "Our top picks from Asus, MSI, Razer, and more.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}