{
  "title": "Best Picture nominee Drive My Car hits HBO Max this March to emotionally ruin you",
  "url": "https://www.theverge.com/22933251/drive-my-car-hbo-max-streaming-oscar-nominees",
  "date": "2022-02-14T19:28:08.000Z",
  "author": "Kevin Nguyen",
  "content": "      <figure>      <img alt=\"Actors Hidetoshi Nishijima&amp;nbsp;and Tôko Miura with the titular car\" src=\"https://cdn.vox-cdn.com/thumbor/8rAguGNTXxqauYU9nagJScpAaOA=/4x0:1888x1256/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70508159/Screen_Shot_2022_02_14_at_2.01.22_PM.0.png\" />        <figcaption>Actors Hidetoshi Nishijima&nbsp;and Tôko Miura with the titular car | Cannes Film Festival</figcaption>    </figure>  <p id=\"PiLkBC\">If you’re one of those people who wants to see all the Oscar potentials before the awards show, you’re in luck: <em>Drive My Car</em>, a limited release in theaters, comes to HBO Max on March 2nd, <a href=\"https://deadline.com/2022/02/drive-my-car-academy-award-nominee-premiere-hbo-max-1234932822/\"><em>Deadline</em> reports</a>.</p><p id=\"1TSszZ\">A critically lauded, three-hour Japanese drama, <em>Drive My Car</em> is the kind of movie often relegated solely to the International Film category. But this year, it took surprising Academy Award nominations for Best Adapted Screenplay, Best Director, and Best Picture. </p><p id=\"CNaqfH\"><em>Drive My Car </em>is a quiet movie about grief and how we communicate that — to others, as well as ourselves. So if you’re looking for a gutting and cathartic drama, this is the movie for you. Or maybe you just want to watch someone be driven around in a red Saab for a while. Really, <em>Drive My Car</em> has something for everyone. (Personally, it was my favorite movie of 2021, and I have no problem admitting I saw this gutting drama twice.)</p><p id=\"1lflPe\">If you want to stream some of director Ryosuke Hamaguchi’s other work ahead of <em>Drive My Car</em>’s HBO Max arrival, two of his films are available on the Criterion Channel: the excellent, moody romance <em>Asako I &amp; II</em>, in which a woman’s lover mysteriously vanishes and, two years later, reemerges as an entirely different person (or so she thinks!); and for the more ambitious viewer, there’s <em>Happy Hour</em>, a quiet excavation of the friendship and lives of four women in Kobe (also very good, but with a five-hour runtime, I recommend breaking this up into multiple viewings). Hopefully, the success of <em>Drive My Car</em> inspires more platforms to pick up Hamaguchi’s earlier work.</p><p id=\"Q4zYgn\">Though the movie is based on a Haruki Murakami short story, it takes its source material in a very different and more expansive direction. But if you’re curious, there are three other Haruki Murakami film adaptations. Lee Chang-dong’s terrific, haunting 2018 drama <em>Burning </em>is available to stream on Amazon Prime Video. A very melodramatic take on <em>Norwegian Wood </em>from 2010 is currently on Tubi — not a great film, but the costuming and Jonny Greenwood score might make it worth it for you. But unfortunately, the very underrated <em>Tony Takitani</em> isn’t streaming anywhere I could find, though if you have the means, I recommend seeking out a physical copy of it.</p><p id=\"5UnE8l\">In the meantime, though, enjoy this picture of me watching the end of <em>Drive My Car</em>:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LmHYx6D0K_YuzOBEwZxiDvK44Hs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23240983/odell_beckham_crying.jpg\">  </figure>",
  "image": "https://cdn.vox-cdn.com/thumbor/qMZCxZe05op7OSleYyvhmY03vYQ=/0x133:1892x1124/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23241234/Screen_Shot_2022_02_14_at_2.01.22_PM.png",
  "description": "A real Saab story",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}