{
  "title": "Bethesda’s launcher is going away, but you’ll be able to get your games again on Steam for free",
  "url": "https://www.theverge.com/2022/2/22/22945874/bethesda-launcher-steam-migrate-games-wallet",
  "date": "2022-02-22T19:13:35.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5q7h-M0lTdtNIjr0sPhZ-9ewxgE=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70537591/ss_5d19c69d33abca6f6271d75f371d4241c0d6b2d1.0.jpeg\" />        <figcaption><em>It will be going away this year.</em> | Image: Bethesda Softworks</figcaption>    </figure>  <p id=\"HE6lUk\">Bethesda is retiring its Bethesda.net Launcher this year and will let people move their games and Wallet to Steam starting in early April, the company announced Tuesday. You’ll be able to access and play games on the Bethesda launcher until May.</p><p id=\"fNYLze\">Any game you own on Bethesda’s launcher will be available for free on Steam. When you migrate to Steam, “you will not lose anything from your Bethesda.net account,” <a href=\"https://bethesda.net/en/article/2RXxG1y000NWupPalzLblG/sunsetting-the-bethesda-net-launcher-and-migrating-to-steam\">Bethesda says</a>. “Many games will also have their saves migrated, with a few requiring some manual transfers. For games that require it, you will still use your Bethesda.net login to sign in to play.” </p><p id=\"mQXDCr\">However, Bethesda is only letting you migrate what’s on your Bethesda Launcher to Steam — you can’t use the switch as an opportunity to bring your games and saves to PlayStation or Xbox, according to the company’s FAQs.</p><p id=\"Jvhq2q\">Despite the launcher shutdown, Bethesda.net accounts are sticking around. “Your Bethesda.net account will not be lost and will still be accessible on our website and in-game, and we will continue supporting all Bethesda.net accounts with our future titles,” the company says. And your Bethesda.net Friends List will be merged with Steam’s “after migration.” For <em>Fallout 76</em> players, Bethesda has put together <a href=\"https://fallout.bethesda.net/en/article/FfWIVEmUL8vXXpAtkYnCT/farewell-bethesda-net-launcher-fallout-76-faq\">an FAQ page specific to that game</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PCBo4haj3tt5tmrPBrAWPhosGIs=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262987/ss_5d19c69d33abca6f6271d75f371d4241c0d6b2d1.jpeg",
  "description": "Bethesda.net accounts are sticking around.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}