{
  "title": "Better.com employees were informed of its latest layoffs via severance checks",
  "url": "https://www.theverge.com/2022/3/8/22967171/better-employees-latest-layoffs-severance-checks-vishal-garg",
  "date": "2022-03-08T21:46:07.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/D7448eu3eacX7IoOOQ1WH2rAtE0=/74x0:1427x902/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70596199/better_ceo_garg.0.png\" />        <figcaption><a class=\"ql-link\" href=\"https://player.vimeo.com/video/215031211\" target=\"_blank\">Better.com</a></figcaption>    </figure>  <p id=\"xCFS2O\">As if things couldn’t get more ridiculous at the online mortgage lender <a href=\"http://Better.com\">Better.com</a>, where <a href=\"https://www.cnn.com/2021/12/05/business/better-ceo-fires-employees/index.html\">900 people were laid off over a Zoom call</a> this past December, the company reportedly issued another wave of layoffs by inadvertently notifying employees via its payroll app, as first reported by <a href=\"https://techcrunch.com/2022/03/08/better-com-employees-learned-of-layoffs-when-severance-checks-appeared-in-payroll-app/\"><em>TechCrunch</em></a>.</p><p id=\"wtoaN9\">According to <em>TechCrunch</em>, the company was supposed to announce this round of layoffs on March 8th but later pushed it back to March 9th after news of the original date got out. Better apparently forgot to change the date on its accompanying Workday app, though — unsuspecting employees reportedly saw severance checks appear in the app at 12AM on March 8th.</p><p id=\"OmCmhK\">Better CEO and co-founder Vishal Garg was criticized for firing hundreds of employees over a single Zoom call on December 3rd of last year and allegedly referred to them as “part of the unlucky group that is being laid off” during the meeting. He later issued <a href=\"https://cdn.brandfolder.io/A8SA0YBW/at/ggkbfpsbjbvc335cprpv33bg/A_Message_From_Our_Founder___CEO.pdf\">an apology</a> to employees and then <a href=\"https://www.theverge.com/2021/12/10/22827834/better-com-ceo-vishal-garg-fired-900-people-zoom-time-off\">proceeded to take time off</a> to reportedly conduct a “leadership and cultural assessment.” The whole situation led to an exodus of several Better executives, <a href=\"https://techcrunch.com/2021/12/07/better-coms-pr-comms-marketing-heads-submit-resignations-in-wake-of-layoffs-fiasco/\">including Patrick Lenihan, the vice president of communications</a>, Melanie Hahn, the head of marketing, Tanya Gillogley, the head of public relations, <a href=\"https://techcrunch.com/2022/02/18/better-com-loses-more-senior-execs-as-employees-brace-for-another-mass-layoff/\">among many others</a>.</p><div class=\"c-float-right\"><aside id=\"XV1610\"><q>Around 3,000 employees are reportedly being let go</q></aside></div><p id=\"DRLLEX\">An employee told <em>TechCrunch</em> that after this week’s snafu, Better then deleted the checks from some employees’ Workday accounts, and they said company leaders didn’t even bother to contact employees to apologize about the mistake or acknowledge the layoffs. <em>TechCrunch</em> says an emailed notice was originally supposed to go out on March 9th, which reportedly blames “current market conditions” for a “mass layoff.”</p><p id=\"O7PnrX\"><em>TechCrunch</em> reports around 3,000 workers in the US and India are being let go — almost half of the company’s 8,000-person team — with the majority of affected workers having jobs in sales and operations. Employees’ severance package reportedly consists of 60 to 80 days worth of pay.</p><p id=\"qfH3Sq\">Better told <em>The Verge</em> that “a small number” of employees were notified of the layoffs via their severance checks and that it will be holding “one-to-one calls” with affected employees.</p><p id=\"sOgo8O\">Prior to the initial layoffs, <a href=\"http://Better.com\">Better</a> received a <a href=\"https://techcrunch.com/2021/11/30/better-com-gets-750m-cash-infusion-in-new-agreement-with-its-spac-backers/\">$750 million cash infusion</a> from SPAC backers Aurora Acquisition Corp. and SoftBank.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9y_E2MiCbwgRSNziehejI6fnPTU=/49x70:1427x791/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23078696/better_ceo_garg.PNG",
  "description": "Better.com workers learned of layoffs through a payroll app.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}