{
  "title": "Biden announces new partnership to expand broadband access",
  "url": "https://www.theverge.com/2022/5/9/23064233/biden-comcast-verizon-att-broadband-low-income-service-internet",
  "date": "2022-05-09T20:40:36.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/14Hv-73L8ytfsCp8QQSTvIqKYtU=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70849828/acastro_170711_1777_0005.0.jpg\" />        <figcaption>Image: Alex Castro / The Verge</figcaption>    </figure>  <p id=\"wbHlmo\">On Monday, the Biden administration announced a new partnership with 20 broadband providers, including AT&amp;T and Verizon, to improve their subsidized high-speed internet plans made available to low-income Americans. </p><p id=\"pAyNnv\">The move bolsters the Federal Communications Commission’s Affordable Connectivity Program, which provides a $30 per month subsidy to cover the cost Americans pay for internet service ($75 per month on tribal lands). The program was finalized last November as part of Biden’s bipartisan infrastructure law and the $65 billion investment it made to increase connectivity across the country.</p><div class=\"c-float-right\"><aside id=\"5OR1mB\"><q>“Access to the internet is essential for success”</q></aside></div><p id=\"gM7eCo\">“In the 21st century, access to the internet is essential for success. Every person in our nation, no matter how much they earn, should be able to afford high-speed internet and a high-speed internet plan,” Vice President Kamala Harris said during Monday’s announcement. </p><p id=\"ljQEEM\"><a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/05/09/fact-sheet-president-biden-and-vice-president-harris-reduce-high-speed-internet-costs-for-millions-of-americans/\">In a fact sheet</a> provided by the White House on Monday, officials said that the partnering 20 providers cover more than 80 percent of the US population “across urban, suburban, and rural areas.” The providers’ promises range from boosting the speeds of their low-income plans to lowering the cost of them outright. For many companies, individuals qualifying for the program could receive free internet service as their low-income plans cost no more than $30. </p><p id=\"WPdS8J\">For example, Verizon lowered its $40 plan to $30, effectively making service free for qualifying households.</p><p id=\"QdCFkw\">“We saw during the pandemic how essential high-speed internet really is,” President Biden said. “High-speed internet is not a luxury any longer, it’s a necessity.”</p><p id=\"JfA8EG\">Still, broadband providers largely stand to benefit from this partnership. Americans who were previously unable to afford service will now be able to access the internet by way of these government subsidies, accounting for new customers for the partnered companies. Providers aren’t required to do more than boosting packages a few megabits or lowering costs.</p><p id=\"RFjAEB\">Telecom’s top cop, the FCC, <a href=\"https://www.theverge.com/2021/10/26/22746223/net-neutrality-fcc-jessica-rosenworcel-chair-gigi-sohn-ajit-pai-broadband\">is also at a standstill</a>. Senate Republicans have stalled the nomination of Gigi Sohn to be the agency’s third Democratic commissioner <a href=\"https://www.theverge.com/22876628/fcc-biden-ftc-gigi-sohn-alvaro-bedoya-rosenworcel-net-neutrality\">for over six months</a>. If approved, Sohn would secure a majority for Democrats at the commission and allow for them to take more drastic action to address competition and net neutrality concerns. </p><p id=\"ywjg9V\">“Some of the internet service providers appearing at this White House event are sabotaging President Biden’s FCC even as they pose for today’s photo op,” Matt Wood, Free Press VP of policy and general counsel, said in a statement on Monday. “It will be hard to watch the president and vice president stand shoulder to shoulder with the leaders of the same companies orchestrating a smear campaign against Gigi Sohn.”</p><p id=\"BtydvU\"></p><p id=\"LQqi6k\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wB1ztThKe0NCeLA5yLuNG2FtBBg=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8839375/acastro_170711_1777_0005.jpg",
  "description": "20 providers agreed to bolster low-income service.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}