{
  "title": "Biden group launches TikTok account to boost the president’s agenda",
  "url": "https://www.theverge.com/2022/4/6/23012077/biden-tiktok-president-white-house-account-gen-z",
  "date": "2022-04-06T12:00:00.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"Tessellated TikTok logos against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/WDHnFko39Q_mNvyAAF2gveqN-pw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70715973/acastro_190723_1777_tiktok_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"qYwuYZ\">The Biden-affiliated nonprofit group Building Back Together plans to launch its own TikTok account on Wednesday as part of the group’s latest effort to engage young people with the president’s agenda ahead of the 2022 midterm elections. </p><p id=\"uOmOL5\">The group’s account, @buildingbacktogether, plans to create content inspired by TikTok trends and features, like the green screen function, to explain President Joe Biden’s agenda to the platform’s predominantly younger user base. The organization’s staff will frequently appear on the account, along with news clips and audio featuring the president. </p><p id=\"RlVLe5\">“By launching a TikTok account, we’re building off that work with the goal of reaching the large and growing user base of this platform, including young people who disproportionately use TikTok,” a Building Back Together spokesperson told <em>The Verge </em>on Tuesday. “We want to make sure TikTok users are seeing information about the positive impacts of the president’s agenda, and we’ll be doing that by producing original content tailored to the platform.”</p><div class=\"c-float-right\"><aside id=\"KI1PzE\"><q>“We want to make sure TikTok users are seeing information about the positive impacts of the President’s agenda”</q></aside></div><p id=\"SoLa59\">Biden’s initial Build Back Better proposal stalled out late last year, leaving expansive climate and social safety net provisions in limbo. <a href=\"https://www.politico.com/news/2022/04/04/dems-party-line-spending-manchin-00022362\">Earlier this week</a>, Senate Majority Leader Chuck Schumer (D-NY) signaled that Democrats would continue their push to pass the elusive economic agenda. Still, its passage would rely on Sen. Joe Manchin (D-WV), who has opposed significant elements of the package.</p><p id=\"6hrhws\">The Biden White House has embraced TikTok as an outreach tool, despite <a href=\"https://www.theverge.com/interface/2020/7/14/21321926/tiktok-bans-bytedance-us-china-trump-facebook-political-ads\">lingering concerns</a> over the app’s Chinese parent company. The new announcement comes just weeks <a href=\"https://www.washingtonpost.com/technology/2022/03/11/tik-tok-ukraine-white-house/\">after <em>The Washington Post</em></a><em> </em>reported that the White House was briefing TikTok creators about the war in Ukraine. During the March briefing, Biden administration officials like Press Secretary Jen Psaki and members of the National Security council detailed the White House’s strategic goals in the region following Russia’s ongoing invasion. </p><p id=\"ksv48Q\">“We recognize this is a critically important avenue in the way the American public is finding out about the latest,” Rob Flaherty, White House director of digital strategy, told <em>The Post</em> last month. </p><p id=\"iDThA5\">Building Back Together is one of the only groups dedicated to advancing Biden’s legislative agenda, including bills like the American Rescue Plan and the Bipartisan Infrastructure Law, as well as Judge Ketanji Brown Jackson’s nomination to the Supreme Court. Leading up to the passage of the Bipartisan Infrastructure Law, the group <a href=\"https://buildingbacktogether.org/news/building-back-together-launches-ad-campaign-to-boost-support-for-bipartisan-infrastructure-deal/\">ran a $10 million television and digital ad campaign</a> to boost support for the measure.</p><p id=\"69jLev\">On Instagram, Building Back Together frequently posts news clips and infographics promoting the Biden administration’s goals. <a href=\"https://www.instagram.com/p/CbppzYKMLiN/?utm_source=ig_web_copy_link\">In one recent post</a>, the group used data from the Economic Policy Institute claiming that Biden’s economic plans would help Americans pay for services like health and child care.</p><p id=\"4l3wOM\">“Our TikTok videos will utilize features unique to the platform — whether that’s taking advantage of trending sounds / dances or using options like the green screen feature to do informational videos about different aspects of the President’s agenda,” the spokesperson said.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gGRtqOl8BuJLKbMIib87tuEQrq0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331847/acastro_190723_1777_tiktok_0001.0.jpg",
  "description": "Building Back Together expands its youth messaging",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}