{
  "title": "Biden wants to give state and local police access to drone-tracking tech",
  "url": "https://www.theverge.com/2022/4/25/23041869/white-house-biden-admin-counter-drone-legislation-plan-tracking",
  "date": "2022-04-26T01:18:08.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kjWWfnV-_KbnFfAq4yy7cNEMa-Q=/0x0:2200x1467/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70793029/DJI_Phantom_3_Skyscraper.0.0.0.jpg\" />        <figcaption>Photo by Sean O’Kane / The Verge</figcaption>    </figure>  <p id=\"mCzoDf\">President Biden’s administration called for Congress’s help in letting more law enforcement agencies access drone tracking systems on Monday. In recent months, government use of counter-drone systems has become more controversial after a Ukrainian government official <a href=\"https://www.theverge.com/22985101/dji-aeroscope-ukraine-russia-drone-tracking\">asked drone-maker DJI to cut off Russia’s access</a> to its AeroScope drone location system.</p><p id=\"5sbYxQ\">The <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/04/25/fact-sheet-the-domestic-counter-unmanned-aircraft-systems-national-action-plan/\">White House’s outline</a> of what it calls the “Domestic Counter-Unmanned Aircraft Systems National Action Plan” called for Congress to “reauthorize” the authority to track drones given to organizations like the Departments of Homeland Security, Justice, Defense, and State. (The plan also notes that the CIA and NASA also have limited authorities.) The statement also asks Congress to give more drone detection powers to state, local, territorial and Tribal law enforcement agencies, as well as “critical infrastructure owners and operators.” Access to these types of systems hasn’t been available to state or local agencies before, <a href=\"https://www.washingtonpost.com/politics/white-house-seeks-more-power-to-counter-use-of-drones-in-us/2022/04/25/abcf8356-c4b1-11ec-8cff-33b059f4c1b7_story.html\">according to <em>The Washington Post</em></a>.</p><div class=\"c-float-right\"><aside id=\"PnxABx\"><q>At the moment, the expansion is a plan, not law</q></aside></div><p id=\"QIzUFx\">The administration’s plan calls for a trial program of select state, local, and tribal agencies to work on drone mitigation as well as detection, and allow “critical infrastructure owners and operators” to “purchase authorized equipment to be used by appropriate Federal or [state, local, and tribal] law enforcement agencies to protect their facilities.” It would also create a list of approved drone detection equipment (it already has a <a href=\"https://www.theverge.com/2021/6/1/22463946/dji-drone-ban-pentagon-department-of-interior\">list of drones approved for government use</a>) and set up a database for all government agencies to track drone-related incidents.</p><p id=\"qVEQsH\">It’s worth noting that, at this point, these are recommendations made by the administration, not laws that are in the process of being passed. Congress also very well may have passed laws to, as The White House’s fact sheet says, “close critical gaps in existing law and policy” around drones without Biden’s support. However, officials from both the <a href=\"https://www.dhs.gov/news/2022/04/25/statement-secretary-mayorkas-administrations-c-uas-national-action-plan-and\">Department of Homeland Security</a> and <a href=\"https://www.justice.gov/opa/pr/justice-department-issues-statement-administration-s-counter-unmanned-aircraft-systems-c-uas\">Justice</a> have signaled support for the plan. </p><p id=\"ZdSoKl\">The US government has been moving towards increased oversight on drones for a while now. In 2021 the Federal Aviation Administration <a href=\"https://www.faa.gov/uas/getting_started/remote_id/\">finalized new rules</a> that will <a href=\"https://www.theverge.com/2020/12/28/22203398/faa-remote-id-rules-location-night-over-people\">require any new drones to broadcast the operator’s location</a>, as well as an identification number that law enforcement can look up and information about the drone’s flight. Those rules will go into effect starting this September; it’ll be mostly illegal to fly a drone without those capabilities one year later.</p><p id=\"8WbJmY\">It’s perhaps understandable, then, that some drone pilots may be worried about the privacy implications of their local police department getting access to equipment that tracks not only drones, but also the people flying them. </p><aside id=\"AwwSF0\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"DJI drones, Ukraine, and Russia — what we know about AeroScope\",\"url\":\"https://www.theverge.com/22985101/dji-aeroscope-ukraine-russia-drone-tracking\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/eFp1lCf6PcyQBDb9vr3B-LivswE=/0x158:2200x1310/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/4171174/DJI_Phantom_3_Skyscraper.0.0.jpg",
  "description": "Drones are facing more and more regulation.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}