{
  "title": "Biden demands Congress protect kids online in State of the Union address",
  "url": "https://www.theverge.com/2022/3/1/22957505/biden-children-kids-privacy-tech-facebook-instagram-frances-haugen-sotu",
  "date": "2022-03-02T02:27:45.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"President Biden Delivers His First State Of The Union Address To Joint Session Of Congress\" src=\"https://cdn.vox-cdn.com/thumbor/14zv5DNCa-31jGCanPzUHFUHDBk=/0x0:4873x3249/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70567913/1375574620.0.jpg\" />        <figcaption>Photo by Win McNamee/Getty Images</figcaption>    </figure>  <p id=\"Jppx6k\">President Joe Biden called on Congress to pass new rules to enhance child safety on social media platforms like Facebook and Instagram in his first State of the Union address on Tuesday. It’s the first time Biden has called for these rules, and the White House plans to make specific funding requests to study and improve children’s online safety. </p><p id=\"fXVVFe\">Specifically, Biden requested that Congress institute stronger children’s privacy rules, ban targeted advertising to children, and pressure social media companies to design their products from the ground up with child safety in mind. In a fact sheet provided by the White House earlier on Tuesday, the administration is also expected to target social media algorithms that discriminatorily target kids, especially minorities.</p><div class=\"c-float-right\"><aside id=\"zfHFKF\"><q>“It’s time to strengthen privacy protections”</q></aside></div><p id=\"GMHPkr\">“It’s time to strengthen privacy protections, ban targeted advertising to children, demand tech companies stop collecting personal data on our children,” Biden said Tuesday night.</p><p id=\"bbqWqZ\">The request comes just months after Facebook whistleblower Frances Haugen, Facebook whistleblower, testified before several congressional committees accusing Meta, the parent company of Facebook and Instagram, of turning a blind eye to the safety of young users. Haugen attended Tuesday’s State of the Union address as a special guest of First Lady Jill Biden.</p><p id=\"oLiQWY\">Following Haugen’s testimony, Republicans and Democrats agreed that it was necessary to roll out stronger children’s privacy rules. However, it’s still unclear what those regulations will look like. Last October, Sens. Richard Blumenthal (D-CT) and Ed Markey (D-MA) <a href=\"https://www.theverge.com/2021/10/5/22710371/facebook-whistleblower-congress-hearing-instagram-kids-safety-privacy-blumenthal\">brought back their KIDS Act</a> which would create new limits for developers designing apps for children. It would also ban all targeted advertising to children, something Biden called for during Tuesday night’s address.</p><p id=\"t50zSo\">“As Frances Haugen, who is here with us tonight, has shown, we must hold social media platforms accountable for the national experiment they’re conducting on our children for profit ,” Biden said.</p><p id=\"69YAXx\">Biden also announced that he <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/03/01/fact-sheet-president-biden-to-announce-strategy-to-address-our-national-mental-health-crisis-as-part-of-unity-agenda-in-his-first-state-of-the-union/\">would request $5 million in his 2023 budget</a> to research how social media harms the mental health of its users, “as well as the clinical and societal interventions” the administration could apply to address these concerns. Biden said that the Department of Health and Human services will also launch a “national Center of Excellence on Social Media and Mental Illness” over the next year. The new program would develop and distribute new guidance “on the full impact of adolescent social media use.”</p><p id=\"BGBMK9\"></p><p id=\"jq5Fwv\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lcQoFUl_nYuhvs6IEUH9km8MkR4=/0x350:4873x2901/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23281596/1375574620.jpg",
  "description": "He wants to ban targeted advertising to kids",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}