{
  "title": "Biden administration green lights fuel that could be dirtier than regular gas",
  "url": "https://www.theverge.com/2022/4/12/23021146/biden-administration-ethanol-e15-gas-prices",
  "date": "2022-04-12T09:00:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"A gas pump is seen situated while pumping gas at a Shell gas station on April 01, 2022 in Houston, Texas.&amp;nbsp;\" src=\"https://cdn.vox-cdn.com/thumbor/w_43h0WzpXicemrRZcJCMDyp1oA=/0x0:6192x4128/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70739038/1388975071.0.jpg\" />        <figcaption>A gas pump is seen situated while pumping gas at a Shell gas station on April 01, 2022 in Houston, Texas.&nbsp; | Photo by Brandon Bell/Getty Images</figcaption>    </figure>  <p id=\"fcoVKe\">In an attempt to lower high gas prices, the Biden administration wants to turn to a fuel that’s potentially even dirtier than regular gasoline, the White House announced today. The Environmental Protection Agency plans to issue an emergency waiver that will allow the year-round sale of a fuel called E15, which is banned in most of the US during summer months when smog is a bigger risk. </p><p id=\"EVcect\">E15 is a gasoline blend with up to 15 percent ethanol — a <a href=\"https://www.eia.gov/energyexplained/biofuels/ethanol.php\">fuel</a> made with plant material. The move is supposed to save Americans money while reducing dependence on foreign oil supplies because ethanol can be made with domestically-grown corn. </p><div class=\"c-float-right\"><aside id=\"cATmHx\"><q>The move is supposed to save Americans money while reducing dependence on foreign oil </q></aside></div><p id=\"YHJJuu\">Most gasoline<strong> </strong>in the US is already mixed with up to 10 percent ethanol. The summertime ban has been in effect since 2011, and was based on concerns that more <a href=\"https://www.popsci.com/corn-ethanol-smog/\">ethanol</a> in fuel might lead to more smog. The added boost of ethanol could increase the amount of <a href=\"https://www.catf.us/2018/10/more-ethanol-more-problems/\">smog-causing pollutants</a> entering the atmosphere. Those pollutants <a href=\"https://www.epa.gov/ground-level-ozone-pollution/ground-level-ozone-basics\">can react with sunlight</a> to create more smog — a big problem during sunnier summer months. Growing all that corn to make the fuel can potentially also result in <a href=\"https://www.pnas.org/doi/10.1073/pnas.2101084119\">more greenhouse gas emissions</a>.</p><p id=\"X3G7g4\">The EPA “will work with states across the country to ensure there are no significant air quality impacts through the summer driving season,” a White House fact sheet says.</p><p id=\"VO81uV\">Fans of E15 have argued for years that the fuel isn’t significantly worse for air quality than other gasoline blends. Both Democratic and Republican lawmakers have recently <a href=\"https://grist.org/politics/ethanol-russian-oil-congress/\">introduced</a> <a href=\"https://www.ernst.senate.gov/news/press-releases/as-us-bans-russian-oil-ernst-klobuchar-call-for-expansion-of-american-biofuels\">bills</a> that would lift restrictions on E15. The Trump administration also tried to rollback the summertime ban in 2019, but a federal court <a href=\"https://www.reuters.com./markets/commodities/us-supreme-court-leaves-place-limits-higher-ethanol-fuel-blend-2022-01-10/\">blocked</a> that effort.</p><p id=\"jyVj5n\">The purported costs savings with E15 are matter of debate, too. The White House fact sheet says that E15 can save consumers ten cents per gallon of gasoline, on average. But while it might be cheaper, ethanol has about <a href=\"https://www.fueleconomy.gov/feg/ethanol.shtml\">a third less energy</a> than gasoline. So costs at the pump have to be low enough to offset the slight loss in fuel efficiency that comes with a higher portion of ethanol in the fuel. </p><p id=\"isOqFB\">At the moment, E15 is not very popular in the US anyway. It’s sold in just <a href=\"https://afdc.energy.gov/fuels/ethanol_e15.html\">2,300 gas stations</a> in 30 states. But that could start to change. The fact sheet distributed by the<strong> </strong>Biden administration mentions that the “EPA is also thinking about additional action to facilitate the use of E15 year-round.”</p><p id=\"ISwr2A\">“The Administration’s strategy to spur the development of homegrown biofuels is critical to expanding Americans’ options for affordable fuel in the short-term and to building real energy independence in the long-term by reducing our reliance on fossil fuels,” the fact sheet says.</p><p id=\"ewegwW\"></p><p id=\"B2d63s\"></p><p id=\"18403Q\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mOGnorBpIxIXIKkAcAAI8Df5VCI=/0x443:6192x3685/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23383391/1388975071.jpg",
  "description": "The goal is to lower prices at the pump.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}