{
  "title": "Biden relaunches cancer-fighting ‘moonshot’",
  "url": "https://www.theverge.com/2022/2/2/22914206/biden-cancer-moonshot-screening-treatment",
  "date": "2022-02-02T16:55:04.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"President Joe Biden during an event with the National Governors Association in January.\" src=\"https://cdn.vox-cdn.com/thumbor/Os_Xadsd2lfobd9y096Kbtg8_5k=/0x0:4464x2976/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70462634/1367867871.0.jpg\" />        <figcaption>Photo by Win McNamee/Getty Images</figcaption>    </figure>  <p id=\"oVC5tc\">Continuing work started when he was vice president, President Joe Biden <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/02/02/fact-sheet-president-biden-reignites-cancer-moonshot-to-end-cancer-as-we-know-it/\">announced today</a> the White House is relaunching a cancer “moonshot” — aiming to “end cancer as we know it today.” </p><p id=\"AGpouh\">The ambitious effort has two main goals: to reduce the cancer death rate by 50 percent over the next 25 years and to improve the lives of people with cancer and their families. Biden’s son, Beau, died in 2015 at age 46 from brain cancer. </p><p id=\"8DGCol\">The White House announcement points to a few strategies to meet those goals, like diagnosing cancer sooner. President Biden and First Lady Jill Biden will encourage people to get regular cancer screenings, the White House will push for more access to home screenings, and federal agencies will work to develop tests that can screen for multiple cancers at once. The effort will also look into ways to prevent cancer, like reducing environmental exposures to cancer-causing pollutants, and accelerating research efforts that use <a href=\"https://www.pennmedicine.org/news/news-blog/2021/june/how-mrna-vaccines-help-fight-cancer-tumors-too\">mRNA technology</a> to push the immune system to attack cancer cells. </p><p id=\"U5kxFT\">Biden’s announcement also referenced the administration’s proposed <a href=\"https://www.whitehouse.gov/wp-content/uploads/2021/08/2021-07-25_ARPA-H-Fact-Sheet.pdf\">Advanced Research Projects Agency for Health</a>, which could accelerate research on disease detection and treatment. The federal Advanced Research Projects Agency-Energy, formed in 2009, funds energy research and has helped advance work on clean energy technology. </p><p id=\"5EEadv\">The announcement, though, didn’t include many details on funding for these efforts. There are two years of funding left from Biden’s moonshot effort as vice president — Congress gave $1.8 million to that program in 2016, set to be used over seven years. But it’ll take more investment to meet the stated goals of the new initiatives, which concerns some cancer advocates. “We need to make sure there’s funding available to develop the new technologies and implement them,” Margaret Foti, chief executive officer of the American Association for Cancer Research, <a href=\"https://www.washingtonpost.com/health/2022/02/02/biden-cancer-moonshot-renewal/\">told <em>The Washington Post</em></a><em>. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lyC9cWcaV9ARW0tsiYmoFkNiLC8=/0x213:4464x2550/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23212903/1367867871.jpg",
  "description": "Cancer advocates want to see funding.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}