{
  "title": "Big tech’s 2021 earnings were off the chart",
  "url": "https://www.theverge.com/2022/2/11/22925859/big-tech-companies-2021-earnings-record-revenue-apple-amazon-alphabet-meta",
  "date": "2022-02-11T13:15:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YFTbGnehVkFuVTMqanx-UTRgr8k=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70497066/VRG_ILLO_5014_BigTech2022.0.jpg\" />        <figcaption>Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p id=\"htOi52\">2021 is in the rearview mirror, but the year’s final reckoning didn’t come until the past week — at least where Wall Street is concerned. Major companies ranging from Apple and Google to Netflix and Tesla all announced their earnings for the holiday quarter — and, as has been the case for more or less the last decade-plus of history, Big Tech made Big Bucks.</p><p id=\"Fwb2Rd\">But taken in total, 2021 looks like a different year, even by Big Tech company standards. Despite the ongoing COVID-19 pandemic, the fluctuating economy and job market, supply chain issues, semiconductor shortages, and other socioeconomic issues, major tech firms didn’t just manage to scrape out some tiny margins of revenue last year: they more or less broke the bank with some of the biggest annual revenue increases ever.</p><div id=\"hPwP1l\"><iframe title=\"Tech Industry Revenue (2009 - 2021)\" aria-label=\"Stacked Column Chart\" id=\"datawrapper-chart-7OHdl\" src=\"https://datawrapper.dwcdn.net/7OHdl/7/\" scrolling=\"no\" frameborder=\"0\"  height=\"378\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script></div><h5 id=\"3ShMZs\"><strong>Chart is interactive; click to see yearly revenue broken for each company</strong></h5><p id=\"Sf9hgR\">Apple notched over $350 billion in revenue last year, close to $100 billion over its 2020 revenue and an increase of about 33 percent year over year. Its previous best money-making jump since 2010 was a 44 percent increase from $108 billion to $156.3 billion. This comes in a year that also saw the company forced to admit on multiple occasions that supply chain issues were impacting sales, <a href=\"https://www.theverge.com/2021/10/28/22751418/apple-q4-2021-earnings-supply-constraints-chip-shortage\">including a $6 billion loss in Q4</a> due to chips shortages and manufacturing delays and <a href=\"https://www.theverge.com/2021/10/12/22723209/apple-iphone-13-chip-shortage-manufacturing-report\">slashed manufacturing goals</a> because it simply couldn’t get enough parts.  </p><p id=\"yIJDDq\">Google made over $200 billion in 2021 for the first time ever (its $257 billion in revenue is a staging 40 percent increase from 2020 and the biggest jump in revenue in over a decade). Meta — the company formerly known as Facebook — cracked the $100 billion mark for its first time, too, even if <a href=\"https://www.theverge.com/2022/2/3/22916007/facebook-meta-stock-drop-history-invest\">the company also saw historic losses following its first-ever drop in users</a>. </p><aside id=\"Z2hpXW\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple made more money than ever, even with the supply chain crunch\",\"url\":\"https://www.theverge.com/2022/1/27/22904413/apple-q1-2022-earnings-iphone-13-supply-chain\"},{\"title\":\"Google parent company Alphabet broke $200 billion in annual revenue for the first time\",\"url\":\"https://www.theverge.com/2022/2/1/22912196/google-alphabet-200-billion-annual-revenue-youtube-pixel-search\"},{\"title\":\"Microsoft Office, cloud services, and Windows boost revenue in Q2\",\"url\":\"https://www.theverge.com/22901252/microsoft-q2-2022-earnings-revenue-cloud-services-surface-gaming-xbox\"}]}'></div></aside><p id=\"UgCSea\">It’s not just the big-name tech companies notching record results, though. Snap posted its first-ever net profit and beat growth forecasts. AMD had its best year ever, with a $16 billion in revenue for 68 percent year-over-year growth. </p><p id=\"51xEy8\">All in all, 2021 — at least in terms of sheer money brought in by major tech companies — may have been the most lucrative year in the history of the industry. And that’s <em>in spite</em> of all the challenges that companies faced. The question is: how did this happen? What’s different about 2021 that saw just a massive boom for all these companies?</p><p id=\"ogzXFW\">“During the pandemic, the strong got stronger,” Wedbush analyst Dan Ives tells <em>The Verge. “W</em>e saw three to four years of growth get pulled forward in the course of 12 to 18 months, and the biggest beneficiary of that was the likes of Amazon, Netflix, Facebook, Google, and Apple.” </p><div class=\"c-float-right\"><aside id=\"hvNodE\"><q>“During the pandemic, the strong got stronger.”</q></aside></div><p id=\"lcBvLd\">The answer, of course, is more complicated than any single factor. “For businesses like Alphabet and Meta that are primarily advertising-driven, it’s all about the access to eyeballs,” Forrester vice president and research director Emily Collins explains. “Consumers are spending more time on digital devices / in digital channels, and advertisers are spending more to reach them. These platforms are also investing heavily in commerce features that shorten the distance between awareness and purchase.” </p><p id=\"zyEWEO\">Apple, on the other hand, rode to success on the strength of the same bets that have carried it through the past decade: people really like iPhones, and the company is extremely good at working with suppliers and manufacturing partners, something that Ives <a href=\"https://www.marketwatch.com/story/apple-reports-a-parade-of-sales-records-as-earnings-top-30-billion-for-the-first-time-stock-gains-11643319426\">called out in a research note</a> as “a major statement on iPhone / services demand and Cupertino’s ability to navigate a supply-chain shortage in almost Teflon-like fashion.” Those factors allowed Apple to weather the supply chain shortage — even with the hits that it took, like the aforementioned $6 billion cut to revenue — in a way that other companies couldn’t. </p><p id=\"Q3TFaq\">But with big tech’s big year behind it — even in the strange circumstances of 2021 — the question remains: how long can these companies keep up notching record, unprecedented revenue year after year after year? </p><div class=\"c-float-right\"><aside id=\"NpZ4nQ\"><q>Will 2022 see even better results?</q></aside></div><p id=\"4eebxJ\">The answer will likely depend a lot on the individual company. “I almost call it a ‘bifurcation of tech’ in 2022, where the work from home beneficiaries... Netflix, Facebook, Zoom Peloton, they’ll see growth fall off a cliff, while others will see more elevated growth — but obviously in a more moderate pace,” says Ives. Meta, for example, clearly has a lot of work to do following the brutal aftermath of its quarterly earnings and its nascent — but, at this point, still largely theoretical — pivot into becoming a “metaverse” company. </p><p id=\"6PIopX\">Apple’s prospects, on the other hand, indicate that the company will continue to barrel ahead with its successes. As Ben Wood, chief analyst at CCS Insight, put it <a href=\"https://www.cnbc.com/2022/01/28/apple-is-like-a-freight-train-at-the-moment-tech-analyst-says.html\">in an interview with <em>CNBC</em></a>, “[Apple] is like a freight train at the moment.” And, of course, the ever-shifting landscape of advertising on the internet (and the massive amount of money that companies like Alphabet, Amazon, and Meta have tied up in it) will almost certainly be a key factor in seeing if 2022 will offer an even bigger windfall for big tech than last year. </p><p id=\"BiI2ov\">But looking back at the numbers, one thing is clear: big tech is making big bucks even with things stacked against it, and unless things drastically change across the economy or the industry in 2022, it’s likely we’ll be looking back in 2023 at even bigger numbers than we are right now — at least, for whoever is left standing. </p><p id=\"QYfSny\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pLIfAv_1n6bQwGKPn5bCU1miFes=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23230610/VRG_ILLO_5014_BigTech2022.jpg",
  "description": "Tech companies had their biggest year ever in 2021.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}