{
  "title": "Big Tech’s climate goals are weaker than they seem, report finds",
  "url": "https://www.theverge.com/2022/2/9/22925436/big-tech-climate-change-goals-weak-report",
  "date": "2022-02-09T19:14:40.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Climate Pledge Arena Ribbon Cutting Ceremony\" src=\"https://cdn.vox-cdn.com/thumbor/xKpfpvICWwf1nrFRqQ5E7xaBXTY=/66x0:5937x3914/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70489388/1348137525.0.jpg\" />        <figcaption>SEATTLE, WASHINGTON - OCTOBER 22: Protestors line up as Andy Jassy the CEO of Amazon speaks at the ceremonial ribbon cutting prior to opening night for the NHL’s newest hockey franchise at the Climate Pledge Arena on October 22, 2021 in Seattle, Washington. | Photo by Bruce Bennett/Getty Images</figcaption>    </figure>  <p id=\"hVKBzP\">Tech giants’ climate plans aren’t as aggressive as they sound, according to an <a href=\"https://newclimate.org/2022/02/07/corporate-climate-responsibility-monitor-2022/\">assessment</a> of 25 of the world’s biggest companies published on Monday. The plans many companies have put together rely too much on offsetting their emissions through unreliable methods rather than setting specific targets to prevent pollution in the first place.</p><p id=\"Iitih7\">“We set out to uncover as many replicable good practices as possible, but we were frankly surprised and disappointed at the overall integrity of the companies’ claims,” Thomas Day, lead author of the new study released by the nonprofit NewClimate Institute, said in a <a href=\"https://newclimate.org/2022/02/07/press-release-corporate-climate-responsibility-monitor-2022/\">statement</a>.</p><p id=\"iNvBG5\">The report, which includes both tech giants and other companies operating in sectors like shipping and brick-and-mortar retail, gave Amazon’s and Google’s climate pledges a “low integrity” rating. Apple and Sony fared somewhat better, with “moderate integrity” ratings for their climate pledges. None of the 25 companies received a “high integrity” rating. The companies were rated based on how clear their climate goals are, how upfront they are about their emissions, and how much they’re reducing that pollution versus relying on controversial offsets. On average, the companies only have plans to reduce their planet-heating pollution by 40 percent despite pledges to reach net-zero emissions.</p><div class=\"c-float-right\"><aside id=\"3yjYlh\"><q>On average, the companies only have plans to reduce their planet-heating pollution by 40 percent despite pledges to reach net-zero emissions</q></aside></div><p id=\"zbZYje\">The word “net” in pledges allows companies to make their climate efforts seem more impressive than they are. Companies can reach net-zero climate goals by reducing some of their CO2 pollution <em>and</em> using other tactics to try to cancel out the negative effects of emissions they continue to produce. They might try to offset emissions by investing in tree farms or forests that naturally draw down CO2, even though it’s a strategy that has often <a href=\"https://features.propublica.org/brazil-carbon-offsets/inconvenient-truth-carbon-credits-dont-work-deforestation-redd-acre-cambodia/\">failed</a> to deliver long-term reductions of carbon dioxide building up in the atmosphere. A separate report released last month by <a href=\"https://about.bnef.com/blog/corporate-clean-energy-buying-tops-30gw-mark-in-record-year/\">BloombergNEF</a> warned that the growing popularity of offsets could threaten gains in corporate clean energy buying if companies decide to invest their money in offsets rather than in renewable energy. </p><p id=\"ttKLx3\">Nearly half of the companies studied haven’t specified how much they plan to cut down on their pollution directly<strong> </strong>— meaning they could rely purely on offsets. </p><p id=\"YdLA6B\">Another problem is that some corporate pledges don’t encompass all of the greenhouse gas emissions for which a company is responsible. The most ambitious climate goals tackle emissions from across a company’s entire supply chain and the use of its products. For a tech company, that might include pollution from sourcing materials and building a device, from running a factory or data center, and from consumers using its products or services. </p><p id=\"EyL5cY\">The report faults Amazon for not setting a specific target for how much of its greenhouse gas pollution it will actually cut in order to achieve its goal of net-zero emissions by 2040. After the company announced its net-zero goal in <a href=\"https://www.theverge.com/2019/9/19/20873834/amazon-sustainability-jeff-bezos-climate-change-pledge-emissions-paris-accord\">2019</a>, its carbon dioxide emissions <a href=\"https://sustainability.aboutamazon.com/amazon-sustainability-2020-report.pdf\">grew by 19 percent</a> the following year as its business boomed during the pandemic. </p><p id=\"u6q228\">Google says that it has been neutralizing all of its carbon emissions since 2007. But it became carbon neutral through the use of offsets. By 2030, it plans to “<a href=\"https://sustainability.google/commitments-europe/\">operate carbon-free</a>.” The new report gives the company some props for <a href=\"https://www.theverge.com/2022/2/1/22912183/big-tech-record-clean-energy-purchases-2021\">implementing a new strategy</a> for matching its electricity use with renewable energy on a 24-7 basis. But the authors point out that its climate efforts could be limited by focusing too much on the company’s electricity use. That wouldn’t account for a majority of the company’s emissions, which come from its supply chain and the use of its products and services.</p><p id=\"L9cVWr\">Both Google and Amazon dispute the report’s ratings in statements emailed to <em>The Verge</em>. Google notes that it has a target of reducing emissions by more than 50 percent across its operations and value chain before 2030 (compared to a 2019 baseline). In response to the report’s criticism that it has not stated how much pollution it will actually cut to reach net-zero, Amazon tells <em>The Verge </em>that it has “not made any net zero claims based on offsets.”</p><p id=\"5WYBqr\">Apple, which scored higher in the report, has a climate goal that would reduce its emissions by 62 percent between 2019 and 2030 across its operations and value chain. The report says that Apple’s plans are “reasonably comprehensive and already led to a significant decrease in emissions in recent years.” But the company can do more to cut down on downstream emissions from the use of its products.</p><div class=\"c-float-right\"><aside id=\"0EKpPS\"><q>“We’re fooled into believing that these companies are taking sufficient action” </q></aside></div><p id=\"gpUQr5\">Sony, unlike many of its peers with the “net” caveat in their climate goals, has committed to zero emissions by 2050. The company launched its “road to zero” in 2010 and has updated its strategy every five years. Frequent interim targets, the report notes, are important for keeping companies accountable to reaching their ultimate goal. Still, Sony’s progress seems to have stalled — its emissions have remained largely unchanged since 2017, the report notes. </p><p id=\"GCgoYL\">Neither Sony nor Apple provided comment to <em>The Verge</em> about the new report.</p><p id=\"EAzyjs\">The report’s authors call for more regulatory scrutiny of companies’ emissions and climate pledges to avoid greenwashing. “Misleading advertisements by companies have real impacts on consumers and policymakers. We’re fooled into believing that these companies are taking sufficient action, when the reality is far from it,” Gilles Dufrasne, policy officer from the nonprofit Carbon Market Watch that also contributed to the report, said in a <a href=\"https://newclimate.org/2022/02/07/press-release-corporate-climate-responsibility-monitor-2022/\">statement</a>.</p><p id=\"a0sOPc\"></p><p id=\"kBxs0L\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OhqDQ8gzwqWFko4qLEuIg5DU2Bo=/0x796:5955x3914/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229826/1348137525.jpg",
  "description": "\"Net-zero\" climate goals can be deceptive.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}