{
  "title": "Big Pixel update lets you type to talk during phone calls",
  "url": "https://www.theverge.com/2022/3/7/22965199/google-pixel-update-features-phone-call-captions-battery-level-stickers",
  "date": "2022-03-07T18:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Pc1sCQPotnDa8IvunBDocPFnJT8=/5x0:1085x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70589775/Live_Caption_for_Calls.0.jpg\" />        <figcaption><em>You can type out a response, or choose from pre-written responses.</em> | Image: Google</figcaption>    </figure>  <p id=\"TAJePt\">Google’s <a href=\"https://blog.google/products/pixel/feature-drop-march-2022/\">latest feature drop</a> for its Pixel phones supercharges its Live Caption feature for phone calls, allowing you to avoid having to speak entirely. There are also new custom sticker options, YouTube watch party support in Duo, and a night photography mode for Snapchat. Google says the features are rolling out starting today on the Pixel 3A to 5A and will be coming to the Pixel 6 and 6 Pro later this month. </p><p id=\"Yy04wF\">Google’s Live Caption feature could previously <a href=\"https://www.theverge.com/2020/8/3/21352903/google-live-caption-phone-video-calls-new-languages-assistant\">turn incoming phone call audio into text</a>, but it’s now being updated to work the other way around, so you’ll be able to type text and have Google’s software read it out in the phone call. A short GIF released by the company shows how the feature can be accessed from the volume button menu and either type out messages in full or select from pre-written responses. The previously Pixel 6-exclusive <a href=\"https://support.google.com/phoneapp/answer/11237273?hl=en\">Direct My Call</a> and <a href=\"https://support.google.com/phoneapp/answer/11305057?hl=en&amp;ref_topic=10078984\">Wait Times</a> features are also expanding to all Pixel phones going back to the Pixel 3A. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jlZEUGKcwXqgC8QCYhHqGZg6mho=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23294605/Live_Caption_for_Calls.gif\">      <cite>Image: Google</cite>      <figcaption><em>Live Caption for calls in action.</em></figcaption>  </figure><p id=\"872Cyv\">The Pixel’s At a Glance widget, which is designed to show key information directly on the home and lock screens, is also being upgraded to offer more details about the battery life of connected Bluetooth devices (there’s also a separate battery widget if you don’t want to rely on At a Glance). It also now offers earthquake alerts as well as reminders to turn off an alarm the day before a holiday. With Google’s Snapshot feature <a href=\"https://support.google.com/assistant/answer/11135696?hl\">apparently being discontinued</a>, At a Glance appears to be turning into a spiritual successor.</p><p id=\"6sxd5V\">After launching on the <a href=\"https://www.theverge.com/2022/2/9/22921668/samsung-galaxy-s22-google-duo-features-whiteboard-video-watch-party\">Galaxy S22 earlier this year</a>, Google Duo’s co-watching and live sharing features are also coming to Pixel. They allow YouTube videos to be watched with friends over Google Duo, as well as sharing other apps. Snapchat is being updated on Pixel devices with support for Night Sight, which should make for better low light photographs, while Gboard will now offer stickers containing custom text if your language is set to US English. Interpreter Mode, which is designed to translate face-to-face conversations, now supports Spanish, Italian, and French on Pixel 6 devices. </p><p id=\"LRpCL3\">Finally, pre-existing features are expanding to new languages. Google’s Recorder app will now be able to transcribe Italian and Spanish on Pixel 6 series devices, while support for Assistant Quick phrases is expanding to be available in Spanish, Italian, and French.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ijAxoNmtu2_NT9AZCyWRbj7vfZY=/0x75:1090x646/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23294603/Live_Caption_for_Calls.jpg",
  "description": "Plus new sticker options",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}