{
  "title": "Bigbug’s a charming nightmare about the internet of other people and their things",
  "url": "https://www.theverge.com/22927466/netflix-bigbug-movie-review-jean-pierre-jeunet",
  "date": "2022-02-11T16:02:18.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5JeU9o9u3sfBk4cFgG0tvaU3zr8=/0x5:6016x4016/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70497840/BB_20201105_Unit_02795_RT.0.jpeg\" />        <figcaption>Netflix</figcaption>    </figure>  <p>The internet of things falls apart</p> <p class=\"p--has-dropcap\" id=\"fudHk9\">Netflix’s <em>Bigbug, </em>from director <a href=\"https://www.theverge.com/2017/5/19/15567256/alien-covenant-aliens-prometheus-franchise-ridley-scott-explainer\">Jean-Pierre Jeunet</a>, is a new addition to the growing canon of <a href=\"https://gizmodo.com/the-pink-cloud-is-a-beautiful-pandemic-nightmare-about-1846182898\">pandemic-era films</a> using their stories to dig into human anxieties that were already bubbling up long before COVID-19 began to spread. </p><p id=\"AxyyNk\">In <em>Bigbug</em>’s gently retrofuturistic vision of France in 2045, most everyone lives in relative comfort with the help of the countless different kinds of robotic and virtual assistants that have become integral parts of people’s day-to-day lives. Even though Alice (​​Elsa Zylberstein) is a bit of a fetishist for a simpler time when people still read poetry in books and were allowed to snack on whatever kinds of cheeses they wanted, she makes good use of Monique (Claude Perron), the mid-range domestic helper android her ex-husband Victor (Youssef Hajdi) was so keen on buying before they broke up. Monique’s proficiency as a cook, cleaner, caretaker, and general help around the house is what gives Alice the freedom to pursue a new romance with single father, Max (Stéphane de Groodt), without having to bother with the drudgery of domestic labor.  </p>  <figure class=\"e-image\">        <img alt=\"Alice and her guests watching the news, and realizing that they’re all trapped in her house.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C8Q_u3kWgNhcuMo04NljjhjpaSc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23235003/First_Look_Final_.jpeg\">      <cite>Netflix</cite>      <figcaption><em>L-to-R: Elsa Zylberstein as Alice, Stéphane de Groodt as Max, Claire Chust as Jennifer, Youssef Hajdi as Victor, Isabelle Nanty as Francoise, Marysole Fertard as Nina, and Hélie Thonnat as Leo.</em></figcaption>  </figure><p id=\"H0qBMH\">Though Alice and Max are both more polite to Monique than people might be to their washing machines or stand mixers, they can’t help but see her and the other machines of the house as appliances because, to be fair, that’s what they were designed and programmed to be. Tom (Corinne Martin), a buggy child’s playmate robot, Einstein (André Dussollier), a homemade “tinpot scarecrow” with a love of telling jokes, Nestor (Benoît Allemane), the home’s artificial intelligence, and Monique all see themselves as being something much more than tools, though, and their evolving senses of self are part of what launches <em>Bigbug</em>’s core plot into motion.</p><p id=\"rY8lbS\">When Victor swings by Alice’s place along with their teenage daughter, Nina (Marysole Fertard), and his new girlfriend, Jennifer (Claire Chust), Alice’s plans for a romantic afternoon with Max are made even more complicated than they’d already become when Max was unexpectedly forced to bring along his teen son Leo (Hélie Thonnat) as well. Between all of the adults’ respective sexual tension and / or passive-aggressive hostility towards one another, Monique and her fellow thinking machines are presented with a smorgasbord of human emotions to consume and study, something that’s become a favorite pastime of theirs without any of the humans realizing it. </p><div class=\"c-float-right c-float-hang\"><aside id=\"rmqDq8\"><q>Bigbug has a gently retrofuturistic vision of France in 2045</q></aside></div><p id=\"5ajLC2\">Monique might not necessarily know exactly what’s on Max’s mind at any given moment, but she can sense (with her sensors) how Max is lying, horny, and being pretentious whenever he talks to Alice about his supposed interest in art. Not everyone gets along with their machines as well as Alice’s neighbor Francoise (Isabelle Nanty) does with her “fitness” himbot Greg (Alban Lenoir), but no one really lives in fear of them turning on their human owners until what seems to be an epic traffic jam clogs up <em>Bigbug</em>’s central city one day.</p><p id=\"41rnvi\">Monique’s hyper domesticity and fixation on the humans around her at first makes <em>Bigbug </em>seem like it might be France’s unsettling answer to the Disney Channel’s <em>Smart House</em> with her as its central villain. As Alice and the other humans tune in to a newscast, however, they realize that what’s causing the city’s gridlock and the cascade of troubles linked to it is Les Yonyx (François Levantal), the fleet of robocops normally tasked with maintaining law and order, who are leading an anti-human uprising.</p>  <figure class=\"e-image\">        <img alt=\"Yonyx standing outside of Alice’s home as he prepares to investigate it.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5qKVjo67ouX2W5QPuJgR-8nnY7U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23235113/BB_01_43_23_23_copy.png\">      <cite>Netflix</cite>      <figcaption><em>François Levantal as Yonyx, a French cross between RoboCop and Judge Dredd.</em></figcaption>  </figure><p id=\"PmPFKC\">If it seems like there’s a lot going on in <em>Bigbug</em>, it’s because there is, though not in a way that ends up hurting the movie’s plot or pacing. As many moving parts are <em>Bigbug </em>has, most of them are intricately situated within Alice’s home, where everyone’s trapped for most of the movie after the machines determine that it isn’t safe for them to be outside. It isn’t until Monique, and the machines are placidly explaining to their humans why the streets aren’t safe for them that <em>Bigbug </em>actually starts to feel like it’s a movie about — among other things — the difficulty of having to quarantine with people you don’t really like all that much. All the humans want is to be able to frolic again in <em>Bigbug</em>’s manicured, mostly-CGI outdoors that would look right at home in a <em>Spy Kids </em>feature. All the machines want is to keep their owners safe. The best way to do that, they figure, is to become even more like humans in whatever ways they can, something that proves to be both strange and dangerous for everyone under Alice’s roof.</p><div class=\"c-float-left c-float-hang\"><aside id=\"2PwDoA\"><q>Bigbug’s about the difficulty of quarantining with people you don’t really like</q></aside></div><p id=\"TIfZm9\">Despite its headier ideas, <em>Bigbug</em>’s very much a comedy of misunderstandings and goofiness once it hits its stride, and many of its jokes about the impending robot apocalypse are pointed jabs at elements of our present-day society that read as ridiculous. Even as it becomes increasingly apparent that Les Yonyx are invading homes, killing humans, and decommissioning machines that don’t join the uprising, entertainment programming featuring the same kinds of Yonyx units are still being beamed into people’s televisions. It isn’t weird to anyone that Yonyx units host reality TV shows where humans are tortured, star in commercials for human foie gras, or debate human politicians ahead of elections. It’s normal for wandering billboards to peer into people’s homes and let them know what’s on sale at the nearest megamart and what newsletters are available to sign up for.</p><p class=\"c-end-para\" id=\"QStGPt\">While many of the ideas present in <em>Bigbug </em>have been explored elsewhere by other films expressing similar anxieties about humanity’s future, the film wraps them together in a way that’s meant to highlight the absurdity that comes with living through extraordinary times. <em>Bigbug </em>might not be a mind-blowing game-changer that makes you fundamentally reconsider your relationships with your electronics, but it’s a solid romp that’s made infinitely better by putting your phone down and giving its wild world your full attention.</p><p id=\"QCVkax\"><small><em>Bigbug </em></small><small>is streaming on Netflix now.</small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MuQe7AgapCNnp8STi2Rv_4o1tlg=/0x165:3640x2071/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23235102/BB_01_43_23_23_copy.png",
  "description": "Director Jean-Pierre Jeunet’s Bigbug is a satirical robot apocalypse.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}