{
  "title": "Bill Simmons gets a big Spotify promotion",
  "url": "https://www.theverge.com/2022/5/12/23068638/bill-simmons-spotify-promotion-parcast-cutler-mcnamara-holt",
  "date": "2022-05-12T15:22:07.000Z",
  "author": "Ariel Shapiro",
  "content": "      <figure>      <img alt=\"Vanity Fair New Establishment Summit - Day 2\" src=\"https://cdn.vox-cdn.com/thumbor/xe3xF_Rd2iqbu7kFKQlLyV2U0yY=/0x0:2836x1891/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861254/491733404.0.jpg\" />        <figcaption>Photo by Mike Windle/Getty Images for <em>Vanity Fair</em></figcaption>    </figure>  <p id=\"fzhHgv\">Spotify has lost a number of top executives in the past month, but Bill Simmons is sticking around, with a plum new job, to boot. The sports talk personality is being elevated into a new role overseeing Spotify’s global sports strategy, the company announced this morning.</p><p id=\"lFmysy\">Spotify has been building up its sports presence for the past few years, first purchasing Simmons’ sports media empire <em>The Ringer </em>for nearly $200 million in 2020. In 2021, the company bought sports-oriented live audio app Locker Room (now branded Spotify Live) for more than $67 million. Outside of the talk space, Spotify inked a deal in March with FC Barcelona for branded shirts for the 2022–2023 season. </p><p id=\"9xxRk1\">Sports (soccer in particular) are big for Spotify CEO Daniel Ek. He unsuccessfully <a href=\"https://twitter.com/eldsjal/status/1393644895357833217\">tried to buy Arsenal FC</a> last year. When talking about the new FC Barcelona deal with investors last month, he explained the rationale. “I know a lot of you are Americans, but let me just state sports is a massive thing globally,” he said. “And football or soccer is the number one sport in the world, and FC Barcelona is the number one team in the world. So we are talking about hundreds of millions of consumers.”</p><div class=\"c-float-right\"><aside id=\"MTXGjh\"><q>Spotify is also elevating the founder of Parcast</q></aside></div><p id=\"4ElnGc\">As the company branches out into global sports coverage, more soccer content seems like a given. While Simmons steers Spotify’s international sports content, he will also remain as head of <em>The Ringer</em>.</p><p id=\"a6Km7P\">Simmons isn’t the only one to get a promotion today. Parcast founder Max Cutler, who sold his podcast studio to Spotify for $56 million in 2019, will become the company’s head of creator content and partnerships and step away as managing director of Parcast. Julie McNamara, who ran programming at Paramount Plus before joining Spotify last year, will continue to oversee originals and studio partnerships like recent smash hit <em>Batman Unburied</em>. </p><p id=\"ZJmfjY\">Cutler and McNamara will fill the hole left by Spotify’s last head of studios, Courtney Holt, who stepped back in April after nearly five years with the company. During his time leading the division, Holt was credited with brokering exclusive deals with stars like Joe Rogan, Alex Cooper, and the Obamas to bring top talent over to Spotify, playing a big role in transforming the company into podcasting’s Goliath. While much of the talent he brought in remains at Spotify, the company shared it will let its deal with the Obamas’ Higher Ground Productions expire in six months. Holt remains in an advisory role with the company.</p><p id=\"xDAEIi\">Today’s announcements come on the heels of three top Spotify leaders resigning over the last month, including Holt. After two years at the helm of Gimlet, Lydia Polgreen announced she would be taking a job as an opinion columnist with <em>The New York Times</em>, where she previously worked from 2002 to 2016. Earlier this month, <a href=\"https://www.theverge.com/2022/5/2/23054003/anchor-co-founder-michael-mignano-leaves-spotify\"><em>The Verge</em> broke the news</a> that Michael Mignano, who co-founded DIY podcast platform Anchor and sold the app to Spotify in 2019, would be leaving after three years leading Spotify’s podcasting tech stack to join an early-stage VC firm. </p><p id=\"seH6Dm\">Spotify will be making more big appointments this summer, including Polgreen and Cutler’s replacements.</p><aside id=\"NVtBfR\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/e1IA9lqaTgOOyxMrFClnLb8J_WU=/0x0:2836x1485/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23455882/491733404.jpg",
  "description": "Big changes are happening in Spotify’s podcasting ranks.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}