{
  "title": "BioWare contractors trying to unionize will no longer be forced to return to the office",
  "url": "https://www.theverge.com/2022/5/9/23063933/bioware-keywords-studios-contractors-unionize-return-office",
  "date": "2022-05-09T19:26:01.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/RkeW9521FWq3zcIqB5wswdm_xXc=/152x0:1765x1075/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70849548/story3.0.png\" />        <figcaption><em>Keywords Studios staffers worked on the newest&nbsp;</em>Star Wars: The Old Republic<em> expansion.</em> | Image: EA</figcaption>    </figure>  <p id=\"awvwup\">The company employing a group of BioWare contractors trying to unionize has reversed a policy requiring the workers to return to the office, according to an internal email viewed by <em>The Verge</em>. The return to office policy was one of the key reasons the contractors, who are based in Edmonton, Canada, and employed by development support company Keywords Studios, had begun organizing. Full-time BioWare staffers are being offered a hybrid work from home option, Keywords Studios employees <a href=\"https://www.theverge.com/2022/4/29/23047488/bioware-keywords-studios-contractors-organizing-union-office-return\">told <em>The Verge</em></a>.</p><p id=\"JPfEfp\">Previously, the Keywords Studios employees that worked at BioWare’s Edmonton office had been expected to return to the office today, May 9th. But in an email sent on Friday, they were informed that “until further notice please maintain working from home.” Keywords Studios didn’t immediately reply to a request for comment. </p><div class=\"c-float-right\"><aside id=\"dKk949\"><q>Alberta Labour Relations Board has also ordered a unionization vote by mail-in ballot</q></aside></div><p id=\"kJIwDb\">The Alberta Labour Relations Board has also officially ordered a unionization vote by mail-in ballot, according to a notice seen by <em>The Verge</em>. The Board has also recommended that the potential bargaining unit be expanded from all Keywords Studios workers “employed in development support at the BioWare office in Edmonton” to “all employees.” </p><p id=\"15FpRT\">According to a Keywords Studios employee involved with the organizing efforts, the revised description would apply just to Keywords Studios employees in Alberta and means that two additional workers who do not work with BioWare will receive ballots. The size of the bargaining unit is expected to be between 15 to 20 people. Completed ballots will remain sealed until the size of the bargaining unit is finalized.</p><p id=\"HNi7ks\">Keywords Studios offers services like quality assurance testing and localization for game developers. The staffers embedded with BioWare’s Edmonton team have worked on titles like <em>Mass Effect Legendary Edition</em>, the latest <em>Star Wars: The Old Republic</em> expansion, and <em>Dragon Age 4. </em>The group’s unionization efforts follow other labor organizing in the gaming industry, such as Raven Software QA employees being allowed <a href=\"https://www.theverge.com/2022/4/22/23037874/raven-software-qa-employees-union-election-activision-blizzard-nlrb\">to have a union election</a>.</p><p id=\"yoKWHz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gzzOOl9hBkWkICq2hW0IvgvZXkk=/0x37:1915x1040/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23448818/story3.png",
  "description": "They had been expected back on May 9th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}