{
  "title": "BioWare promises Dragon Age 4 is coming along just fine",
  "url": "https://www.theverge.com/2022/2/23/22947737/bioware-dragon-age-4-production-update",
  "date": "2022-02-23T19:26:33.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"Dragon Age\" src=\"https://cdn.vox-cdn.com/thumbor/2n4pFj0Zzlc1H1n7e5KZB6co2hg=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70541844/Dragon-Age-Inquisition-Preview-08.0.0.jpg\" />    </figure>  <p id=\"1OWuhh\">Production on <em>Dragon Age 4</em> seems to be coming along nicely, according to an update from BioWare.</p><p id=\"9gNllA\">In <a href=\"https://blog.bioware.com/2022/02/23/game-update-dragon-age-in-production/\">a blog post</a>, studio general manager Gary McKay says:  </p><blockquote><p id=\"Bmn0SY\">For the next <em>Dragon Age</em>, we are right in the middle of Production, which is a great feeling. Our blueprint was completed last year, so we’re now focused on building out our vision: creating amazing environments, deep characters, strong gameplay, impactful writing, emotional cinematics – and much more. The blueprint for the game is well understood and the team is focused.</p></blockquote><p id=\"9lfelU\">It’s been seven years since the release of <a href=\"https://www.theverge.com/2014/11/11/7193647/dragon-age-inquisition-pc-ps4-impressions\"><em>Dragon Age: Inquisition</em></a> and almost four years since the <a href=\"https://www.theverge.com/2018/12/6/18126070/dragon-age-4-trailer-teaser-ea-announcement-release-date-game-awards-2018\">first images from <em>DA4</em></a> were teased during The Game Awards. Since then, news on the latest installment of the<em> Dragon Age</em> series <a href=\"https://kotaku.com/dragon-age-fans-have-gotten-good-at-living-on-crumbs-1847215235\">has been spotty</a> — <a href=\"https://www.theverge.com/22167450/dragon-age-4-bioware-trailer-ea-game-awards-reveal\">a short trailer here</a>, some concept art and <a href=\"https://www.ea.com/games/dragon-age/dragon-age-day\">short stories there</a>, and a report stating that <a href=\"https://www.theverge.com/2021/2/25/22301634/dragon-age-single-player-only-ea-bioware-shifts\">EA abandoned ideas of adding multiplayer elements</a> to the game after the failure of <em>Anthem.</em> While some fans are more than content to wait patiently for BioWare to serve up some <a href=\"https://kotaku.com/it-s-been-three-years-and-i-still-hate-solas-1820049714\">Eggs for scrambling</a>, the studio promised a more regular stream of information on the game will start in the coming months.</p><p id=\"3S6QJ9\">“Later this year, you will start to hear more from the <em>Dragon Age</em> team in the form of blogs and social content,” McKay wrote.</p><p id=\"Sug8QH\">The blog wasn’t only <em>Dragon Age</em>-focused. McKay also said the <em>Mass Effect</em> team is hard at work concepting new ideas for the latest installment in the alien romance simulator that occasionally masquerades as a very good action RPG. </p><p id=\"Afwb9w\">In the last three years, <a href=\"https://www.theverge.com/2021/11/24/22801037/dragon-age-4-matt-goldman-bioware-ea\">several high-profile <em>Dragon Age</em> developers have left BioWare</a>, causing concern that the game’s production was in jeopardy. The <em>DA4</em> update seemed to alleviate some anxieties fans have had about the state of the game. McKay said that while he understands fans are eager for information on <em>Dragon Age 4</em>, BioWare’s primary concern is a quality product that will inevitably take time. </p><p id=\"dBz1wm\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_dTjwn3w1uO5oC8BrLLXd-a7_Wk=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/2447766/Dragon-Age-Inquisition-Preview-08.0.jpg",
  "description": "Get your beaters in hand — it’ll soon be Egg crackin’ time.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}