{
  "title": "Blizzard hires a vice president of culture to fix its culture",
  "url": "https://www.theverge.com/tech/2022/5/5/23059254/blizzard-first-culture-vp-hired-to-fix-harassment-discrimination-retaliation",
  "date": "2022-05-05T23:36:44.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/UZXkRZ86rk69cy7Hrk-L7KmnEc4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70837736/acastro_210729_1777_blizzard_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"B7XGxf\">California’s Department of Fair Employment and Housing sued Blizzard last July, saying it “created a culture of ‘constant sexual harassment’ and gender-based discrimination.” The revelations that followed through the rest of the year only served to confirm those assertions, and <a href=\"http://theverge.com/2022/4/29/23048768/activision-blizzard-communications-workers-america-nlrb-charge-wages-working-conditions\">even as accusations of retaliation continue to roll in</a>, a new set of leaders say they are committed to making changes. </p><p id=\"zC9ZEI\">In January, Blizzard president Mike Ybarra <a href=\"https://news.blizzard.com/en-us/blizzard/23763775/putting-our-teams-and-players-at-the-forefront-of-everything-we-do\">wrote about</a> “the work we are doing to rebuild your trust in Blizzard,” and included descriptions of <a href=\"https://www.theverge.com/2022/1/20/22894005/blizzard-boss-mike-ybarra-changes-blog-activision-microsoft\">several full-time leadership roles dedicated to changing the culture</a>. It appears that two of the spots have been filled, as Activision Blizzard appointed Kristen Hines as its new chief diversity, equity, and inclusion officer <a href=\"https://www.theverge.com/2022/4/11/23020687/activision-blizzard-diversity-equity-inclusion-officer\">last month</a>, and today Blizzard Entertainment <a href=\"https://news.blizzard.com/en-us/blizzard/23805078/blizzard-entertainment-welcomes-jessica-martinez-as-vp-of-culture\">announced</a> Jessica Martinez as its first vice president, head of culture.</p><div id=\"p8tByb\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">\"When you create a people-first environment where teams feel safe, valued, and work together toward a shared purpose, everyone thrives–the employees, the players, and the business.” <a href=\"https://t.co/qDonVr8nJz\">pic.twitter.com/qDonVr8nJz</a></p>— Blizzard Entertainment (@Blizzard_Ent) <a href=\"https://twitter.com/Blizzard_Ent/status/1522273278764666882?ref_src=twsrc%5Etfw\">May 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"tJOJW9\">According to Blizzard, her responsibilities include “growing and implementing our culture strategy, ensuring alignment across all teams and functions, and revamping learning and talent development programs.” The announcement says she’s leading the learning and development team, while working with “communications, events, and each of the franchise and functional leaders.” Martinez is credited with 14 years of “leading strategy, communications, operations, and employee experience” at Disney. </p><p id=\"prFR7I\">Beyond those positions, Ybarra’s post mentioned bringing in “a new organizational leader for Human Resources who will build trust, empower our teams, and help foster a safe, positive work environment for everyone.” He also said that compensation for executives would depend on their success in “creating a safe, inclusive, and creative work environment at Blizzard.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YB3mKbDW2qyFagrVAb5IVVLU79k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22749476/acastro_210729_1777_blizzard_0002.jpg",
  "description": "It was sued for a culture of \"constant sexual harassment\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}