{
  "title": "Blizzard is hoping Overwatch 2 leads to a superb OWL season 5",
  "url": "https://www.theverge.com/23058353/activision-blizzard-overwatch-2-league-esports-interview",
  "date": "2022-05-05T14:35:52.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/AgSjNbczP846b82pe1Sa_idAxf4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70835398/acastro_220504_5190_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>Overwatch League commissioner Sean Miller shares his thoughts on what a new game will do for the League</p> <p class=\"p--has-dropcap\" id=\"LuTT4b\">The fifth season of the <em>Overwatch</em> League is all about “new.” With opening day on May 5th, this season boasts a new 5v5 format, a new game mode, new maps, a new commissioner, and even a completely new game as players shift from <em>Overwatch</em> to the <em>Overwatch 2</em> beta. But with this season of new comes old problems. The pandemic still impacts logistics like international travel and live, in-person events. And the League itself is struggling with waning popularity amid <a href=\"https://www.theverge.com/2021/7/28/22597113/activision-blizzard-california-sexual-harassment-lawsuit-discrimination-employee-action\">backlash against its embattled developer</a>, a lengthy off-season, and beloved players and talent <a href=\"https://www.theverge.com/2019/5/25/18639606/overwatch-league-commissioner-nate-nanzer-epic-games-fortnite\">leaving the League</a> for greener pastures. <em>The Verge </em>spoke with League commissioner Sean Miller who discussed the challenges, triumphs, and expectations of a radically new <em>Overwatch</em> League.</p><p id=\"VLcf0E\">This season, the <em>Overwatch</em> League will be played on the <em>Overwatch 2</em> beta. Matches will be scaled from six players per team to five, eliminating one of the two tank roles in the standard format of two tanks, two healers, and two damagers. The <em>Overwatch 2</em> beta also brings with it a new game mode called Push, eliminating the <a href=\"https://www.forbes.com/sites/krisholt/2021/02/19/overwatch-2-will-ditch-the-widely-disliked-assault2cp-maps/?sh=fe227801607a\">much maligned (but honestly not that bad)</a> Assault mode.</p><p id=\"LJCUgf\">Sean Miller, the League’s new commissioner, who took over the role about six months ago, is banking that the new game will be critical to this season’s success.</p><p id=\"TzEMoY\">The day after <em>Overwatch 2 </em>began its closed beta, the game enjoyed its most popular day on Twitch ever, amassing over <a href=\"https://twitter.com/PlayOverwatch/status/1519477448152342529?s=20&amp;t=5r6Y8mN2pq3N4jwNTzOM7Q\">1.5 million concurrent views</a>. The bump neatly coincided with a one-day promotion that <a href=\"https://www.theverge.com/2022/4/26/23043073/how-to-overwatch-2-beta-access-pc\">guaranteed <em>OW2</em> closed beta keys</a> to viewers who watched at least four hours of select streamers. When the promotion ended the next day, those numbers <a href=\"https://www.forbes.com/sites/paultassi/2022/05/03/overwatch-2-has-lost-99-of-its-twitch-audience-in-a-week/?sh=1fb46f2c205f\">fell off a very steep cliff</a>. Though the one-day high doesn’t seem to indicate an organic increase in interest in <em>Overwatch</em>, Miller does believe the newness of <em>Overwatch 2</em> will correlate to an improvement in viewership.</p><p id=\"ntSaMP\">“We expect a massive influx of new viewers this year and we want to make sure that as a League, we are making the gameplay and the tournaments as accessible and as easy to watch as possible,” he said.</p><p id=\"XuWlsM\">Miller says part of the League’s strategy for attracting new (and perhaps many of the lapsed) viewers is through a new co-streaming program debuting this season.</p><p id=\"wNhLUY\">“We’re piloting a program this year for YouTube creators,” Miller said. “We expect to see some great names that have built a presence on their YouTube platforms.” Miller was unable to share who those great names were, but during the <em>OW2</em> beta promotion, huge Twitch personalities not known for streaming <em>Overwatch</em> like Pokimane and Lirik were playing, indicating some of the <a href=\"https://www.theverge.com/2021/8/30/22643215/drlupo-move-from-twitch-youtube-gaming-exclusivity-deal\">big YouTube</a> <a href=\"https://www.theverge.com/2021/9/1/22652368/timthetatman-streaming-twitch-switch-youtube-gaming\">gaming personalities</a> might make their League debut with co-streams.</p><div class=\"c-float-right c-float-hang\"><aside id=\"gdWcR9\"><q>We expect a massive influx of new viewers this year</q></aside></div><p id=\"O2lcR3\">One facet of making <em>Overwatch</em> accessible means having a game people can understand. </p><p id=\"s2CoBI\">“Five versus five as a game is easier to watch, in my opinion,” he said. “And I think we’ve seen feedback that others agree.”</p><p id=\"XgfILg\">He also shared that the reduction in players from six to five has had an immeasurable impact not only on how the game is fundamentally played and watched but also on how it is broadcast.</p><p id=\"zp2ukE\">“Everything from the sound design to the heroes walking to even the graphics had to be built from the ground up,” he said. “That also means that all of the integration that the League has, from the broadcast to competition operations, had to be rebuilt. It’s been a huge challenge in the last few months to ensure the same level of quality of broadcast.”</p><p id=\"teCJ8u\">Accessibility also means your product can’t be boring. One of the biggest yawn factors of watching competitive <em>Overwatch</em> was the way teams relied on certain powerful compositions and strategies known as “metas.” It was not fun to watch a mirror match of the same six heroes poke at each other from behind shields for weeks on end. When this stagnation happened during the 2019 season, the League tried to fix it through the role lock rule, indicating teams could have no more than two of each role in a match. In 2020, when metas calcified and strategies grew stale again, the League introduced hero pools, which temporarily banned the use of a rotating group of overused heroes. One of the best and most fun to watch moments in <em>Overwatch</em> League history was in 2020, when Mei, a character that had become reviled because of her constant play, was banned after a caster’s cat picked her name out of a lineup of heroes.</p><div id=\"Md42mV\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">THE SYSTEM WORKS! <a href=\"https://twitter.com/hashtag/NoriSaves?src=hash&amp;ref_src=twsrc%5Etfw\">#NoriSaves</a> <a href=\"https://twitter.com/hashtag/OWL2020?src=hash&amp;ref_src=twsrc%5Etfw\">#OWL2020</a> <a href=\"https://t.co/XAcMWDiDXd\">pic.twitter.com/XAcMWDiDXd</a></p>— Overwatch League (@overwatchleague) <a href=\"https://twitter.com/overwatchleague/status/1244448045846102017?ref_src=twsrc%5Etfw\">March 30, 2020</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"NrSZRs\"><em>Overwatch</em> is, of course, a team game, but the dominance of certain metas created an overreliance on team play at the expense of what makes <em>Overwatch</em> exciting: the big hero moments. League clips that rack up views aren’t usually the ones that show good team dynamics; they’re the ones of a Widowmaker getting five headshots in a row or a Reinhardt Earthshattering an entire team. </p><div id=\"swjnqX\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Earthshatter that sealed the deal. <a href=\"https://twitter.com/JJANGGU_OW?ref_src=twsrc%5Etfw\">@JJANGGU_OW</a>'s flanking Reinhardt is a force to be reckoned with! <a href=\"https://twitter.com/hashtag/AnteUp?src=hash&amp;ref_src=twsrc%5Etfw\">#AnteUp</a> <a href=\"https://twitter.com/hashtag/OWL2021?src=hash&amp;ref_src=twsrc%5Etfw\">#OWL2021</a> <a href=\"https://t.co/lYN2AkCzUO\">pic.twitter.com/lYN2AkCzUO</a></p>— Overwatch League (@overwatchleague) <a href=\"https://twitter.com/overwatchleague/status/1383890617697116169?ref_src=twsrc%5Etfw\">April 18, 2021</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"q9Iipu\">Miller thinks the five versus five format will provide more opportunities to have those big hero moments. Metas will always be inherent to competitive<em> Overwatch</em>, but 5v5 introduces a new level of flexibility, potentially allowing teams to choose heroes better suited to the strengths of their players rather than heroes the meta demands. </p><p id=\"Jd6xDQ\">“[Five versus five] should provide more opportunities for crazy [plays], because there’s only one tank,” he said. “[Teams are] seeing that it’s more dynamic. They’re seeing that they’re able to have more strategies because of less players.”</p><p id=\"6mBEMt\">Exciting plays generate the kind of hype the <em>Overwatch</em> League needs. So do tournaments.</p><p id=\"1MaUxL\">“I think [tournaments] have really been a boon for everything,” Miller said. “For the business, for the viewers, and for the players. [They provide] much more opportunity to have those high stakes moments that everybody loves to watch sports for.”</p><p id=\"x4Jd7B\">Introduced in 2020, <a href=\"https://www.theverge.com/21279107/overwatch-league-may-melee-tournament-structure-blizzard\">tournaments changed the face of the League</a>. They instantly injected an element of excitement into a format that had remained largely unchanged since the inaugural 2018 season. And they’re back again for season five, bringing with them the return of live events. </p><p id=\"MXmPmI\">“You can put those high stakes moments in the places where people want to be, which are the LAN events,” Miller said. </p><div class=\"c-float-right c-float-hang\"><aside id=\"ubZoqr\"><q>It’s been a huge challenge in the last few months to ensure the same level of quality of broadcast</q></aside></div><p id=\"smjhzW\">The <em>Overwatch</em> League was always meant to adopt a traditional sports model of having teams host games in their home cities. The pandemic crashed that plan, forcing the League to split into two East / West regions and pivot to online-only broadcasts. In 2022, in-person events are making a gradual return, subject to the whims of the pandemic, logistics, and the needs of the teams.</p><p id=\"tgXCkH\">During opening weekend, the most anticipated match on the schedule between the Dallas Fuel and the Houston Outlaws (affectionately known as the Battle For Texas) will be held live in a brand new dedicated esports arena in Arlington, Texas. A few weeks later, the League’s first tournament of the season will also be held there, bringing in the top eight qualifying teams for a weekend of competition.</p><p id=\"U2DKuB\">“It’s going to be awesome,” Miller said. “They’re going to make such a memorable experience.”</p><p id=\"kXzUki\">But the pandemic isn’t over, and <a href=\"https://www.gamespot.com/articles/pax-east-enforcer-dies-after-being-exposed-to-covid-during-convention/1100-6503083/\">there are real consequences for holding live events even now</a>, two years later. In China and Korea, the countries where the Eastern region teams are based, the pandemic is still a major issue. </p><p id=\"vVYE3S\">“The COVID situation in the Eastern region right now is presenting its challenges,” Miller said. “And we’re gonna have to work around that.” As it stands now, the Eastern region teams won’t play until the third week of the season, meaning fans will have to wait a little longer to see the triumphant return of <a href=\"https://www.theverge.com/2021/9/27/22696933/the-shanghai-dragons-2021-overwatch-league-grand-finals\">season 4 champions, the Shanghai Dragons</a>. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dN695DDzaaeMOtkhImaDOZAWWNI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23439818/OWL_Press_Asset_BZ6HR6.jpg\">      <cite>Image: Blizzard Entertainment</cite>      <figcaption><em>The Shanghai Dragons at the moment of their 2021 Grand Finals victory.</em></figcaption>  </figure></div><p id=\"B4SIJr\">Though the <em>Overwatch</em> League has soldiered on for five seasons now, the health of the League has always been a lingering question. Last year, <a href=\"https://kotaku.com/activision-blizzard-esports-announces-layoffs-1846485267\">Blizzard laid off almost 200 individuals</a>, most of whom were employed in the company’s esports division. The League also <a href=\"https://www.theverge.com/2021/8/6/22612536/overwatch-league-call-of-duty-sponsors-activision-blizzard-sexual-harassment-discrimination-lawsuit\">seemed to lose several high-profile sponsors</a> like Coca-Cola, T-Mobile, and State Farm after the news broke that the company was being investigated for rampant incidents of harassment and discrimination. Blizzard even <a href=\"https://www.theverge.com/2021/8/26/22638947/blizzard-overwatch-mccree-name-change-lawsuit\">changed the name of one of <em>Overwatch</em>’s heroes</a> from McCree to Cassidy after <a href=\"https://www.theverge.com/2021/8/11/22620800/activision-blizzard-departures-lawsuit-diablo-4-director\">the employee for whom the character was named</a> was seen in the now infamous “<a href=\"https://kotaku.com/inside-blizzard-developers-infamous-bill-cosby-suite-1847378762\">Cosby Suite</a>” photo.</p><p id=\"hB0c8X\">Add to that fans’ general dissatisfaction with<em> Overwatch</em> itself from a lack of meaningful updates as the developers focused on the announced too soon and increasingly delayed <em>Overwatch 2</em>, and it’s easy to see why people might think the League is in trouble.</p><p id=\"si5yP9\">Miller doesn’t agree. “I can say that I am very optimistic about the League’s future,” he said. “It’s crazy to think that even though 2022 hasn’t officially even started yet, we are in the midst of planning for 2023–2024 right now.”</p><p id=\"F8KjyC\">Miller acknowledged that his role as the League’s commissioner would naturally incline him to speak optimistically about what the League’s doing, but he did offer a little more concrete reassurance that Blizzard still intends to support the League.</p><p id=\"Wqygtf\">“The plans that we are working through right now for the coming years are no less than what we’re doing now in terms of level of excitement and things that we want to give to our fans and our players.”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/O3B16kkZ_4DEwGax4x4RbgpiDjI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23439830/OWL_Press_Asset_BZ6F3Y.jpg\">      <cite>Image: Blizzard Entertainment</cite>      <figcaption><em>When COVID restrictions relaxed in parts of China in 2021, Chinese </em>Overwatch<em> teams were able to hold their own live events.</em></figcaption>  </figure></div><p id=\"liBn7q\">But the <em>Overwatch</em> League needs a bit more than developer support to keep on keeping on. Like any professional sport, “E” or otherwise, it needs a healthy ecosystem of players to draw from. Blizzard created a kind of farm system — a “Tier 2” — under the <em>Overwatch</em> League from which it promoted talent when pros retired. It was called the “Path To Pro,” and it was a tiered set of amateur leagues high-skill players could work their way through in order to gain the experience necessary to eventually be recruited to the League. But Blizzard’s support for those amateur leagues has varied, from strong to spotty and nonexistent.</p><p id=\"UKmXP2\">Miller agreed, saying Blizzard’s support for Tier 2 “could be better” but that the <em>Overwatch</em> League isn’t hurting for new players to fill rosters.</p><p id=\"MMbrcV\">“The percentage of rookies in the league this year is actually at a record high,” he said, noting that statistic obviously didn’t include the inaugural season. He also thinks <em>Overwatch 2 </em>will be critical to attracting new players. ”<em>Overwatch 2</em> is a huge thing from a pipeline perspective,” Miller said.</p><p class=\"c-end-para\" id=\"inR3lh\">Miller said he couldn’t confirm details but explained, “the health of the ecosystem at large is very much on our minds” and that news about Tier 2 plans would be coming “soon™.” </p><p id=\"CjmeI8\">According to several impressions of the closed beta, it still feels like a half-finished game. A significant number of tank and damage heroes enjoyed everything from slight tweaks to complete overhauls while support heroes remained basically untouched. Wrecking Ball, the hamster tank hero, <a href=\"https://www.pcgamer.com/wrecking-ball-benched-in-overwatch-2-beta-for-literally-wrecking-servers/\">won’t be playable</a> because he literally breaks the game. The <em>Overwatch 2</em> developers made it clear they are taking player feedback seriously, and Miller shared that pro player opinions were a part of that feedback.</p><p id=\"yMPEfF\">“The interactions and collaboration that I saw between the development team and the players during that initial alpha period was one of the coolest experiences I’ve been able to see,” he said, adding that the pros’ response to <em>Overwatch 2</em> has been, “overwhelmingly positive.”</p><p id=\"MuChjZ\">It’s good that players seem to enjoy the new game and, hopefully, all the changes <em>Overwatch 2 </em>brings will match the expectations Miller has for the League. Those changes challenged his team. </p><p class=\"c-end-para\" id=\"eebxTo\">“And, I’m glad that it was a challenge, because we pushed ourselves on that,” he said. “And it’s going to be so much better for the fan experience and for the player experience.”</p><p id=\"hIyrhF\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mrD-onsbAXIeiOkNptNXHv6wcTw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23439843/acastro_220504_5190_0001.jpg",
  "description": "New year, new Overwatch League",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}