{
  "title": "BlockFi will pay $100 million in a settlement with SEC and states over its interest accounts",
  "url": "https://www.theverge.com/2022/2/14/22933245/sec-blockfi-settlement-interest-account-yield-filing-register-crypto",
  "date": "2022-02-14T19:36:03.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Gbx1gk14becOoB8z5JvJ-CmV8FY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70508197/mdoying_180308_2373_0059still.0.jpg\" />        <figcaption>Photo by Michele Doying / The Verge</figcaption>    </figure>  <p id=\"WQpEi6\">BlockFi, a crypto finance institution, <a href=\"https://www.sec.gov/news/press-release/2022-26\">will pay $100 million in penalties</a> to the Securities and Exchange Commission (or SEC) and 32 US states after it settled charges relating to its interest program (<a href=\"https://www.theblockcrypto.com/linked/134165/with-100-million-settlement-confirmed-blockfi-aims-to-register-yield-with-sec\">via <em>The Block</em></a>). Regulators say that the company’s BlockFi Interest Accounts, which let users earn returns on cryptocurrencies like Bitcoin, Ethereum, and USDT, were unregistered securities and that BlockFi wasn’t properly registered as an investment company. </p><p id=\"cA6nK1\">BlockFi pitched its interest accounts as a way to earn “up to 9.25 percent” interest on crypto deposited into the account, though the percentage varied from month to month and was <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fblockfi.com%2Frates%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F14%2F22933245%2Fsec-blockfi-settlement-interest-account-yield-filing-register-crypto\" rel=\"sponsored nofollow noopener\" target=\"_blank\">dependent on how much you had deposited</a>. According to the SEC, because customers were technically lending their assets to BlockFi, its Interest Account product had to be registered as a security. The <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fblockfi.com%2Fregulatory-developments%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F14%2F22933245%2Fsec-blockfi-settlement-interest-account-yield-filing-register-crypto\" rel=\"sponsored nofollow noopener\" target=\"_blank\">company announced</a> that it’s planning on creating a new product called BlockFi Yield, which it says will be registered with the SEC and will largely fill the same role of letting people earn interest on their crypto. BlockFi “intend[s] for BlockFi Yield to be a new, SEC-registered crypto interest-bearing security, which will allow clients to earn interest on their crypto assets,” according to a statement from the company’s CEO Zac Prince.</p><div class=\"c-float-right\"><aside id=\"hBYAYF\"><q>The SEC is putting other companies with similar products on notice</q></aside></div><p id=\"rKq1W7\">“Crypto lending platforms offering securities like [BlockFi’s Interest Accounts] should take immediate notice of today’s resolution and come into compliance with the federal securities laws,” said the SEC’s director of compliance, Gurbir Grewal. </p><p id=\"cDc6Qw\">While the regulator says its settlement with BlockFi is “the first case of its kind with respect to crypto lending platforms,” it’s not the first time it’s tangled with a crypto company over this kind of product. Last year, Coinbase <a href=\"https://www.theverge.com/2021/9/20/22684169/coinbase-crypto-lend-feature-discontinued-sec-lawsuit-threats\">canceled the launch of its Lend program</a>, which it called a “high-yield alternative to traditional savings accounts.” The company says the SEC <a href=\"https://www.theverge.com/2021/9/8/22662826/coinbase-sec-lend-regulation-crypto-lawsuit-exchange\">threatened legal action</a> if Lend launched, claiming that it would be regulated as a security. At the time, Coinbase said it was looking for “regulatory clarity for the crypto industry” and has <a href=\"https://www.theverge.com/2021/12/9/22826888/coinbase-defi-interest-non-us-compound-lending-program\">since launched a similar product</a> that lets non-US customers earn interest on their crypto. </p><p id=\"J42WpA\">BlockFi says that customers not in the US won’t be affected by Monday’s resolution. US customers will still continue to earn interest on the crypto they have in their interest accounts but won’t be able to deposit any more — those accounts will also be turned into BlockFi Yield accounts after the program is registered with the SEC. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8yfgXrGoOEaSwTSGXFh2VFiFiuk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10432793/mdoying_180308_2373_0059still.jpg",
  "description": "It promised \"up to 9.25 percent\" returns on Ethereum and more.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}