{
  "title": "Bloodborne is finally on PC (in the form of a neat PS1 demake)",
  "url": "https://www.theverge.com/2022/1/31/22910985/bloodborne-psx-demake-pc-fangame",
  "date": "2022-01-31T21:57:13.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qpTjI6qzphKL_X0oc_gmJGre7cg=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70455233/2022_01_31_12_19_15_Greenshot.0.jpg\" />    </figure>  <p id=\"XNYNcY\"><em>Bloodborne</em> is finally on PC — in a manner of speaking. Fans of 2015’s FromSoftware roguelike have been fervently wishing for a PC port. At long last, their prayers have been answered on the gnarled finger of a monkey’s paw with a PSX “demake” <a href=\"https://b0tster.itch.io/bbpsx\">available now for free</a>.</p><div id=\"HSofIp\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BloodbornePSX: NOW AVAILABLE TO DOWNLOAD<br><br>➡️Get it here: <a href=\"https://t.co/40oWAplt4y\">https://t.co/40oWAplt4y</a><br><br>Thank you for the support over the 13 month dev period. It means so much to me <br><br>➡️Discord: <a href=\"https://t.co/kzxCUCCn44\">https://t.co/kzxCUCCn44</a><br>➡️Extended Launch Trailer: <a href=\"https://t.co/qUn6qLdkhi\">https://t.co/qUn6qLdkhi</a><a href=\"https://twitter.com/hashtag/BloodbornePSX?src=hash&amp;ref_src=twsrc%5Etfw\">#BloodbornePSX</a> <a href=\"https://twitter.com/hashtag/Demake?src=hash&amp;ref_src=twsrc%5Etfw\">#Demake</a> <a href=\"https://t.co/FTxl8YlFVC\">pic.twitter.com/FTxl8YlFVC</a></p>—    Lilith Walther ️‍⚧️ (ps1 goth girl) BLM ACAB (@b0tster) <a href=\"https://twitter.com/b0tster/status/1488195375248805889?ref_src=twsrc%5Etfw\">January 31, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"knd6Tg\">Developer Lilith Walther has been working on the demake for 13 months and has drummed up considerable interest from fans of PS1-era games and <em>Bloodborne</em> enthusiasts alike. The game already has its own Twitch category with (as of right now) over 25,000 people tuned in to see the technical feat of de-<a href=\"https://www.nytimes.com/2021/11/24/style/yassify-bot-meme.html#:~:text=To%20%E2%80%9Cyassify%E2%80%9D%20something%2C%20in,becomes%20almost%20unrecognizably%20made%20up.\">yassifiying</a> one of the best games of the PS4 era. </p><p id=\"rFpfap\">It’s unclear just how much of the original <em>Bloodborne</em> Walther has included, but it seems like only Yharnam, the game’s first zone, has been faithfully de-created. Though this demake doesn’t encompass the entire game, players can still get a well-rounded <em>Bloodborne </em>experience. You can fight both the Cleric Beast and Father Gascoigne — arguably one of the hardest bosses in the entire game — while also encountering one of the notoriously difficult Hunter NPC fights. </p><p id=\"vGjVqM\"><em>Bloodborne</em> <em>PSX</em> is a lovely rendition of its source material. The opening cutscene <a href=\"https://twitter.com/GameSpot/status/1454878337084575747\">lines up perfectly with its PS4 predecessor</a>, and a lot of little details have been faithfully transported. </p><div id=\"sDMdiE\"><div data-anthem-component=\"gallery:11005794\"></div></div><p id=\"KTDgSH\">As I was playing, it was a delight to feel my <em>Bloodborne</em> muscle memory kicking in, remembering exactly where enemies should be and being rewarded by ganking them before they could gank me. But the game isn’t just <em>Bloodborne</em> with a retro-looking coat of graphical paint. Walther also took steps to capture what playing <em>Bloodborne</em> would have felt like were it released in 1997 instead of 2015. The game has controller support, but only the D-pad moves your character despite the analog sticks working in the menu. And there are settings you can enable that will intentionally slow down the game’s framerate during intense moments like boss fights and increase “loading times” in order to recreate the painfully slow chug-a-lug of the PSX. There’s even the old school “<a href=\"https://youtu.be/rwN3kZYJZiU\">bwaam whaam</a>” of the Sony Computer Entertainment start-up screen and a graphics setting that makes the game look like it’s being played on an old CRT TV. </p><p id=\"8pwbvh\">In <a href=\"https://kotaku.com/two-developers-are-turning-bloodborne-into-a-playable-p-1846135016\">an interview with <em>Kotaku</em></a>, Walther said she was inspired by other fan-made demakes like the <a href=\"https://www.polygon.com/2017/4/24/15408030/breath-of-the-wild-free-download-windows-pc-fan-game\">NES version of <em>Breath of the Wild</em></a><em> </em>and that, to her, <em>Bloodborne</em> was made a couple of console generations too late. </p><p id=\"kBSmSz\">“I always thought of the <em>Soulsborne</em> games as retro in their feel,” Walther told <em>Kotaku</em>. “And I mean that as a form of the highest praise.”</p><p id=\"g54BQU\"></p><p id=\"04B3fC\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IXle1QzlIlbubrbYyurB0XGr5ag=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23207907/2022_01_31_12_19_15_Greenshot.jpg",
  "description": "May you find your true PC port in the waking world.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}