{
  "title": "Blumhouse’s Firestarter remake brings the heat in first trailer",
  "url": "https://www.theverge.com/2022/2/9/22925684/firestarter-trailer-blumhouse-stephen-king",
  "date": "2022-02-09T19:57:05.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2k2lYYfFJS-AqUwFccH1bSh8S0M=/459x0:2217x1172/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70489643/Screen_Shot_2022_02_09_at_1.47.21_PM.0.png\" />    </figure>  <p id=\"AjqSF6\"><a href=\"https://www.theverge.com/2021/9/10/22667291/stephen-king-short-story-red-screen-humble-bundle-aclu\">Stephen King</a>’s <em>Firestarter </em>novel tells the story of a young family on the run from the US government as it attempts to capture them and better understand the superhuman mental abilities they all developed after being exposed to an experimental chemical. Universal and <a href=\"https://www.theverge.com/2018/11/15/18096826/blumhouse-jason-blum-thriller-features-amazon\">Blumhouse</a>’s upcoming adaptation of the book is likely to hit many of the same notes found in the source material and in Mark L. Lester’s 1984 film of the same name. But the new <em>Firestarter</em>’s first trailer leads with an energy that feels decidedly rooted in 2022, and it’s difficult to say whether that’s a good thing or not.</p><p id=\"smn1Ix\"><em>Firestarter</em> revolves around haggard psychic dad Andy McGee (Zac Efron), whose ability to influence people’s minds in the novel appears to be reworked as telekinesis here, and his daughter Charlie (Ryan Kiera Armstrong), a gifted telekinetic whose powers absolutely eclipse her parents’. There is only a handful of shots of Charlie’s mother Vicky (Sydney Lemmon) before Andy’s forced to flee with his child in tow, doing everything he can to keep her away from those who want to harness her abilities for their own purposes. </p><p id=\"BbZ9ty\">While much of that is in line with the arc of the novel, what the new <em>Firestarter </em>seems especially keen on digging into is how people from the present day would logically see Charlie as a burgeoning superhero-type rather than just a strange little girl who can also will flames into existence with her mind. The scale of Charlie’s power was always one of the more important things about the novel’s story, but it’s easy to see how this new feature might end up borrowing a page or two from Sony’s <a href=\"https://www.polygon.com/2019/5/24/18638555/brightburn-review-superman-horror-movie-james-gunn\"><em>Brightburn</em></a><em> </em>when <em>Firestarter </em>hits theaters <em>and </em>Peacock on May 13th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pT-ZD8p700WxIdLgF_rwDVHUsKc=/219x0:2458x1172/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229871/Screen_Shot_2022_02_09_at_1.47.21_PM.png",
  "description": "Blumhouse’s new Firestarter remake updates the Stephen King classic for age of cape movies",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}