{
  "title": "BMW iX XDrive50 review: a high-tech beast with bling",
  "url": "https://www.theverge.com/23074741/bmw-ix-xdrive50-review-ev-specs-price-photos",
  "date": "2022-05-19T12:00:00.000Z",
  "author": "Abigail Bassett",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/W5MtrV6ek6qQbjAt6AIRTJ8O9PA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70886876/abassett_220410_5188_0001.0.jpg\" />        <figcaption><em>The 2022 BMW iX is the German automaker’s flagship EV in the US.</em> | Photo by Abigail Bassett for The Verge</figcaption>    </figure>  <p>BMW’s all-electric crossover is packed to the gills with technology, power, and range</p> <p class=\"p--has-dropcap p-large-text\" id=\"HDGEgf\">As I climb into the Aventurin Red Metallic BMW iX XDrive50 parked in front of my house, a woman in a current generation BMW X3 rolls up next to me. “I want that car,” she exclaims out the window. I laugh and agree as she reiterates, “No. Seriously. I want that car.” </p><p id=\"M7YXj1\">As a former X3 owner myself, it’s no surprise that the all-electric midsize SUV from BMW garners this kind of attention — and not just because of that polarizing gaping maw at the front of the vehicle, either. It’s because it’s the first fully-electric flagship offering from BMW, and it looks strikingly similar to BMW’s extremely popular X5. It’s also one of two of the new all-electric utility vehicles coming from BMW, and it offers tons of technology, power, and range.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OvUXc4tj87xKM6BYiFISPZmh010=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447533/abassett_220410_5188_0004.jpg\">      <cite>Photo by Abigail Bassett for The Verge</cite>      <figcaption><em>The iX is loaded with some very cutting-edge tech that makes it stand out in an increasingly crowded sea of luxury EVs.</em></figcaption>  </figure></div><h2 id=\"oS8x6N\">BMW returns to the all-electric game with a bang</h2><p id=\"lBKAmS\">BMW got into the SUV game (or SAV as BMW calls it, which stands for “sports activity vehicle”)  back in the late ‘90s with the creation of the extremely popular X5. The company has sold more than 950,000 X5s in the US alone, a spokesperson confirmed. In the first quarter of 2022, it’s the best-selling vehicle that BMW makes, according to the company. BMW has parlayed those sales numbers into what could be another future success with the introduction of <a href=\"https://www.theverge.com/2020/11/11/21558833/bmw-ix-inext-electric-suv-range-price-specs\">the 2022 BMW iX XDrive50</a>, an X5-sized SUV with an all-electric powertrain and more than 300 miles of range. </p><p id=\"n97pqU\">The iX is a clean-sheet design that was created from the ground up. It’s BMW’s flagship for the new all-electric architecture and design for the company, and it’s loaded with some very cutting-edge technology that makes it stand out in an increasingly crowded sea of luxury electrics. </p><div class=\"c-float-right\"><aside id=\"WGlR4k\"><q>The iX is a clean-sheet design that was created from the ground up</q></aside></div><p id=\"jD2G08\">While BMW was early to the electrification game, releasing the short-range <a href=\"https://www.theverge.com/2021/6/28/22554419/bmw-i3-discontinued-us-electric-hatchback-sales\">BMW i3</a> in 2013, the company discontinued it last year after poor sales as a result of Americans’ desire for bigger, higher-riding SUVs. It’s been nearly 10 years since the company unveiled a new all-electric vehicle, but it has returned to the space with some very impressive offerings, including the <a href=\"https://www.theverge.com/2021/6/1/22462504/bmw-i4-ev-price-specs-photos-release-date\">BMW i4 sedan</a> and the BMW iX in various formats (the iX 40, iX 50, and coming soon, the very quick iX M60). Just last week, <a href=\"https://www.theverge.com/2022/4/20/23032951/bmw-i7-electric-sedan-announce-specs-price\">BMW also unveiled the i7 sedan</a>, putting the company on track to reach its goal to move toward a 50 percent global share of fully-electric vehicle sales by 2030. </p><p id=\"Frbvjd\">While the i3 was intended as a city car with an initial range of just 80 miles, the iX more than quadruples that range — reaching an EPA estimated range of 324 miles. That’s all thanks to the 111.5kWh (gross) battery pack nestled into the carbon fiber reinforced plastic (CFRP), aluminum, and high strength steel space frame that underpins the vehicle. That battery gets a usable 105.2kWh, which means that, for example, on a one-way trip from Los Angeles to San Francisco (depending on traffic, temperature, and how hard you drive it) you will only have to stop once to recharge.  </p><p id=\"ov3C5O\">Like the BMW i3 before it, the iX has a distinct design both inside and out. Housed behind that giant nose sits a ton of technology that makes the iX a dream to drive. Inside, the iX is opulent and luxurious, complete with crystal knobs and buttons, a simple and elegant wood panel where the iDrive controller lives, push-button door handles, and an optional vast sunroof with electrochromic shading that turns it from opaque to clear with the push of a button. The hexagonal steering wheel is quite nice and includes a simplified button and wheel setup to control everything from the audio system to the advanced driver-assist system.</p><p id=\"2Z25SX\">On the road, the BMW iX is quiet, quick, and, despite the BMW purists’ cries of anguish over everything from styling to the form of the SUV, the iX is very fun to drive. The battery is heavy, and, if you choose to wheel the nearly 5,700-pound car on winding roads, you can certainly feel that weight, but the powerful, dual, electrically-excited synchronous motors that sit at the front and back of the vehicle make it agile and balanced. BMW says that the iX puts out a combined 523 horsepower and 564 pound-feet of torque, and, since it’s all-electric, that torque is immediate, punchy, and smooth. </p><div class=\"p-fullbleed-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3YoHFBhkv20e7GQDncwcypgd1hs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447538/abassett_220410_5188_0009.jpg\">      <cite>Photo by Abigail Bassett for The Verge</cite>      <figcaption><em>The hexagonal steering wheel is quite nice and includes a simplified button and wheel setup to control everything.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ze9MFQdn_fKeiW3N_Qh3xyyKR2M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447539/abassett_220410_5188_0010.jpg\">      <cite>Photo by Abigail Bassett for The Verge</cite>      <figcaption><em>The iX is opulent and luxurious, complete with crystal knobs and buttons.</em></figcaption>  </figure></div></div></div><h2 id=\"35Lb7s\">ADAS: drive like a real human </h2><p id=\"DWK4qi\">Even when driven hard, the iX maintains and even surprises with its electric range. I took a quick day trip from Los Angeles down to Encinitas, near San Diego, a distance of just under 100 miles one-way (70 miles to be exact) and started out with a nearly full charge at 310 miles of range. By the time I got to my destination in Encinitas, I had 243 miles remaining. Back home, after winding around traffic, I had 177 miles left. </p><p id=\"CsZEYF\">If you do the math, you’ll notice that my range only dropped by around 67 miles each way, a cumulative savings of 6 miles of range. That’s because of the very good and very efficient adaptive cruise control system that I used the entire way <em>and</em> the easy-to-use one-pedal driving mode (B-mode) that regenerates power back into the battery.  You can definitely feel the difference between the normal mode and the one-pedal mode, which ups the regen when you lift your foot off the accelerator. It’s easy to get used to, especially in bad LA traffic.</p><div class=\"c-float-right\"><aside id=\"Q98k4E\"><q>Even when driven hard, the iX maintains and even surprises with its electric range</q></aside></div><p id=\"VV4I5e\">The advanced driver assistance system (ADAS) integrates with the navigation system and takes into consideration the mode you choose to drive in and how aggressively you drive. BMW has built an adaptive recuperation system that makes the iX more efficient and boosts its range by taking the intensity of the brake energy recuperation during overrun and active braking and adapting it to the road situation as it’s detected by data coming in from the navigation system and the sensors used by the driver assistance systems. It’s incredibly smart, seamless, and surprising to experience, and it truly does take some of the range anxiety out of driving an electric vehicle. </p><p id=\"S6vwz1\">The ADAS system, called the Active Driving Assistant Pro (an additional cost of $1,700), is one of the best I’ve experienced. BMW has tuned the system so that it adapts to the driving situation you’re using it in. For example, it’s exceedingly common in Los Angeles to come to a complete stop from over 70mph after climbing a small hill on the highway. When it happens, it yields fender-benders galore, and, during my time with the SUV, I came across plenty. </p><p id=\"tM7NmK\">The ADAS system in the BMW iX, however, handled each one of these instances exceptionally well — and without panic. That’s because the iX is equipped with five cameras, five radar systems, 12 ultrasonic sensors, and vehicle-to-vehicle communication to help manage the ADAS system in real time. It also integrates data from the navigation system and 5G technology (one of the first vehicles to get it) as well. </p><p id=\"6tziyW\">That means that the iX can essentially “see” a slowdown before you get to it and adapt the speed so that when you come upon a sudden stop, it doesn’t panic brake or emit all kinds of alarms like other vehicles do. It also uses the vehicle’s onboard camera to monitor traffic and activates brake regeneration in certain driving situations in a very subtle and gentle fashion so that you end up with a little bit more range on longer drives.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BOMyldHoTcJCJYDYf9Eq8CnqU5o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447532/abassett_220410_5188_0003.jpg\">      <cite>Photo by Abigail Bassett for The Verge</cite>  </figure></div><h2 id=\"rCqPWB\">Voice control: speak to me like a real human</h2><p id=\"60iKVq\">In addition to this, the voice-activated system in the BMW iX is one of the best in the business. When the company designed the iX it got rid of a lot of buttons and integrated many of the common tasks drivers and passengers do into the eighth generation of iDrive. You can choose to control the system either by using a crystal wheel in the center console (which is striking and mirrors the seat adjustment controls on the door) or by using the vehicle’s voice assistant.  </p><p id=\"0VjLPX\"> At the heart of the <a href=\"https://www.theverge.com/2021/3/15/22332131/bmw-idrive-update-curved-screen-autonomous-electric-ix\">iDrive 8 system</a> is a single large curved display that starts behind the uniquely hexagonal-shaped steering wheel and stretches to the middle of the vehicle. BMW merged the 12.3-inch instrument cluster and the central 14.9-inch infotainment screen into a single unit that is angled toward the driver, making for easy reading in all kinds of light.  The system uses natural language processing to help you get to the functions you want and need without having to fumble through menus.</p><div class=\"c-float-right\"><aside id=\"SF1gKx\"><q>The voice-activated system in the BMW iX is one of the best in the business</q></aside></div><p id=\"ppdcaC\">While you still have to use a keyphrase, in this case, “Hey BMW,” to wake the system up, you can simply ask for directions to a specific restaurant, give an address, or find a list of the nearest chargers, and you don’t have to say it in any specific way. You can take natural pauses, stop and start, and even muddle the address order, and the system will still find the right place for you. Once you start the navigation, the system uses very good augmented reality overlays to show you just where to turn on the center screen while it gives you direction indicators on the instrument cluster. Overall, it’s incredibly easy to use and very good. </p><p id=\"zlB3x0\">With just one exception: during my time with the BMW iX, a nail punctured the belly of the rear-left tire. I happened to be relatively close to my destination but tried to use voice control to navigate to a safe location to pull over and make a call. When the iX’s system noticed that the air pressure was dropping, it sent up an immediate tire pressure alert. Surprisingly, that alert significantly reduced the capability of the voice system. When I asked it to find the nearest gas station, the system told me that, because of the tire issue, the voice assistant wasn’t available. I stopped in a nearby parking lot to make my call and limped home. The fleet management company had the tire plugged, and I was back on my way with a patched tire. Once the tire was fixed, the voice assistant was back. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zHHQNcgAjOquVgZwfQ-vjhamx_A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447531/abassett_220410_5188_0002.jpg\">      <cite>Photo by Abigail Bassett for The Verge</cite>  </figure></div><h2 id=\"SPxpPc\">Backing in and charging up</h2><p id=\"lTZS3M\">In addition to driving the iX around 300 miles during the week I spent in it, I also had the opportunity to charge it on a public DC fast charger. As is pretty much par for the course, the public charging experience is exceedingly shoddy, but, since I live in Southern California, it’s admittedly better than it is in other parts of the country. I chose a local EVgo DC fast charger that had both availability and a coffee shop to see if I could get a quick charge before hitting the road again. BMW offers complimentary charging for two years for the iX and i4 at Electrify America chargers, but there were none nearby.</p><p id=\"5VHAwZ\">BMW says that the battery in the iX can charge from 10 to 80 percent in 30 minutes, and once I finally got the EVgo system to work, I charged on a 150kWh charger for about 30 minutes and regained 79 miles of range, going from 57 percent to 82 percent charge (from 193 miles of range to 272 miles of range), which was more than enough. </p><div class=\"c-float-right\"><aside id=\"oVqoVi\"><q>My biggest complaint about the charging experience is where BMW placed the charge port</q></aside></div><p id=\"IT5DVy\">My biggest complaint about the charging experience (outside of the incredibly buggy EVgo system) is where BMW placed the charge port. In many EVs, the charging port is at the front driver’s side in front of the door. In the BMW iX, it sits on the rear passenger side, which means that if you’re using a public charging station, you have to back into the space and get the charger on the correct side of the vehicle. At the location I chose, I could only use two of the four available chargers because of the configuration. While most owners won’t frequently charge on public chargers (since EV owners typically charge at home), backing into a spot in a crowded parking lot and praying that the charger that you chose works is a lot to ask of most drivers. </p><h2 id=\"zrOjw0\">BMW iX: worth it?</h2><p id=\"ssXo4N\">The BMW iX xDrive50 I spent the week in priced out at a whopping $104,820. With a base price that starts at $83,200, the BMW iX is at the upper reaches of luxury SUV territory, not to mention EV territory. BMW still has incentives left, so it does qualify for a $7,500 federal tax credit if you meet the criteria. </p><p id=\"Gq4Bz8\">While the price isn’t anywhere near affordable, it’s not meant to be. This is, after all, a flagship vehicle — a place for BMW to test its advanced features with customers with a plan to trickle the tech down into other vehicles in their lineup. The company is already offering many of the features in the iX on vehicles they’ve just announced, like the BMW i7 and the i4. </p><p class=\"c-end-para\" id=\"tXaLID\">After spending a week with the iX, it’s clear that those who love the X5 will be pleased with the new all-electric beast from BMW. If you’ve got the scratch to spend and want a vehicle that’s at the leading edge of technology and power, the BMW iX is a clear head and shoulders above the rest. </p><p id=\"vKHdHt\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uzdW-_ilTAPrxgxqRZ5owdtYbvE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23447530/abassett_220410_5188_0001.jpg",
  "description": "BMW’s new EV is a high-tech crossover.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}