{
  "title": "BMW teases the upcoming i7 electric sedan — and its massive grille",
  "url": "https://www.theverge.com/2022/3/16/22980864/bmw-i7-electric-sedan-images-specs-grille",
  "date": "2022-03-16T14:40:51.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/F3kLp0lrrtZy2mClt-bMfC7efz0=/1x0:1600x1066/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70629994/967586.0.jpeg\" />        <figcaption>Image: BMW</figcaption>    </figure>  <p id=\"a8fMhe\">In a few weeks, BMW plans on unveiling its latest electric vehicle, the i7 luxury sedan. Ahead of that, the German automaker is offering a few teaser images, some interesting specs, and — of course — confirmation that this EV will have an absolutely massive, entirely unnecessary kidney-shaped grille. </p><p id=\"5fzsft\">To be fair, the grille is an indelible part of the automaker’s identity. It’s how you know a BMW is a BMW. So it stands to reason that the company would include it on its upcoming EVs, despite the vehicle lacking an engine under the hood in need of cooling. </p><div class=\"c-float-right\"><aside id=\"jhg4iG\"><q>To be fair, the grille is an indelible part of the automaker’s identity</q></aside></div><p id=\"Io8p9d\">BMW claims that the i7’s grille has been “completely reinterpreted to achieve a modern and distinct look.” For example, the grille is outlined in a narrow band of “exclusive crystal glass” LED, which helps accent it and — arguably — draw more attention to it. </p><p id=\"7nPJrp\">It should be mentioned that the company has been subjected to a lot of harsh criticism lately on social media for its ever expanding take on the classic kidney grille. <a href=\"https://www.theverge.com/2021/6/1/22462746/bmw-ix-suv-ev-price-specs\">When asked about this last year</a>, Don Smith, product manager for BMW, said that while “obviously it makes no sense to have an open grille,” the automaker’s customers “want it to look like a BMW.” Fair enough!</p><div id=\"uDJ8fL\"><div data-anthem-component=\"gallery:11098138\"></div></div><p id=\"ayjoBj\">BMW claims that when it’s revealed in April, the i7 will be “the first all-electric luxury sedan in the world.” The Mercedes-Benz EQS and Lucid Air may beg to differ, but the automaker is certainly pulling out all the stops, boasting a claimed range of 580-610 km (360-379 miles) according to the European WLTP standard, and up to 305 miles (491 km) according to EPA estimates. The combined power consumption will be 19.7–18.9 kWh per 100 km, according to WLTP, <a href=\"https://www.carscoops.com/2021/12/2023-bmw-i7-dubbed-as-the-worlds-first-all-electric-luxury-sedan/\">which is lower than previously advertised</a>.</p><p id=\"2stwRq\">We’ve also got some interior images to mull over. The big news here is the inclusion of BMW’s ultrawide 31-inch theater screen, with its 32:9 panoramic display format and 8K streaming resolution. The screen, which moves out of the roof liner, is for rear passengers, basically turning the sedan into a luxury cinema-on-the-go. The i7 will also be equipped with a Sky Lounge panoramic glass roof with LED light threads. It’ll be interesting to see how this interacts with the BMW theater screen.</p><p id=\"jluesk\">For the driver, a curved display starts behind the steering wheel and extends halfway across the dashboard. This involves merging the 12.3-inch instrument cluster and the central 14.9-inch infotainment screen into a single unit angled toward the driver. Featuring the latest version of BMW’s iDrive operating software, the curved display will have the appearance of floating above the dashboard, which is quickly becoming a common feature in luxury automobiles. </p><p id=\"JN9KMO\">BMW has a host of new EVs coming out in the next few years, with <a href=\"https://www.press.bmwgroup.com/global/article/detail/T0348272EN/bmw-group-posts-significant-sales-growth-through-september-group%E2%80%99s-electro-offensive-consistently-driven-forward-sales-of-fully-electric-vehicles-more-than-doubled?language=en\">the goal of achieving 50 percent</a> of the company’s sales by 2030. The company is developing an all-electric version of its <a href=\"https://www.theverge.com/2020/7/28/21345464/bmw-5-7-series-x1-electric-car-ev-plug-in\">5 Series</a> as well as its entry-level X1 SUV. Earlier this year, the company revealed the <a href=\"https://www.theverge.com/2020/7/14/21324114/bmw-ix3-electric-suv-range-specs-price-china-europe\">production iX3</a>, the all-electric version of its top-selling X3 SUV, which will only be available in Europe and China. In the US, the <a href=\"https://www.theverge.com/2021/6/1/22462504/bmw-i4-ev-price-specs-photos-release-date\">BMW i4 sedan</a> and <a href=\"https://www.theverge.com/2021/6/1/22462746/bmw-ix-suv-ev-price-specs\">iX SUV</a> will start making deliveries later this year.</p><p id=\"NwEJYo\">That means almost all of the German luxury automaker’s most popular cars will soon have all-electric variants. A fully electric version of the 3 Series, BMW’s most popular car in the US, has <a href=\"https://www.autocar.co.uk/car-news/new-cars/new-electric-bmw-3-series-spied-testing\">already been spotted in testing camouflage</a>.</p><p id=\"xpsaSm\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ndDxmMNHrO03cJf01QmijHzIwnM=/0x114:1600x952/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320313/967586.jpeg",
  "description": "BMW claims it’s the world’s first luxury electric sedan.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}