{
  "title": "BMW’s new electric 7 series luxury sedan will start at $120,295",
  "url": "https://www.theverge.com/2022/4/20/23032951/bmw-i7-electric-sedan-announce-specs-price",
  "date": "2022-04-20T12:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/25quuG_nfV-669cc0G4YPZb5CnU=/0x0:4961x3307/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70770500/P90458174_The_new_BMW_i7_xDrive60._European_model_shown.0.jpg\" />    </figure>  <p id=\"AeETJO\">BMW announced a new electric 7 series luxury sedan, the i7 xDrive60. The upcoming EV will have an estimated range of “up to 300 miles” and a starting price of $120,295. Interested car buyers can pre-order the i7 starting today and deliveries are expected to start later this year. </p><p id=\"VYmOwt\">Chock full of high-tech features, like a massive 8K theater screen for rear passengers, BMW is hoping the i7 will become a segment leader in the increasingly crowded luxury electric sedan space. Certainly the automaker’s 7 series has long held the place as the brand’s ultimate expression of luxury (alongside the 8 series). And BMW recently nipped the crown for best-selling luxury brand in the US from Mercedes-Benz, but Tesla is right on its heels. </p><div class=\"c-float-right\"><aside id=\"QS7IV1\"><q>BMW recently nipped the crown for best-selling luxury brand in the US from Mercedes-Benz</q></aside></div><p id=\"4iSUEZ\">The i7 can’t beat beat Tesla in battery performance and range, but it can certainly compete in performance. Featuring two electric motors with a combined output of 536 horsepower and 549 pound-feet of torque, the i7 xDrive60 will sprint from 0-60 in about 4.5 seconds. </p><p id=\"5KZ0Bd\">The vehicle’s battery provides 101.7 kWh of usable energy, but the combined power consumption will be 19.7–18.9 kWh per 100 km, <a href=\"https://www.carscoops.com/2021/12/2023-bmw-i7-dubbed-as-the-worlds-first-all-electric-luxury-sedan/\">which is lower than previously advertised</a>. By way of comparison, the most powerful Tesla, the long-range Model S, has a 100kWh battery, while Mercedes-Benz’s flagship EQS sedan, with 350 miles of range, has one with 107.8kWh of capacity.</p><div id=\"iEFROL\"><div data-anthem-component=\"gallery:11151832\"></div></div><p id=\"oL2Isz\">Notably, BMW says it won’t use rare earth materials to power the i7’s two motors. Instead, the motors operate on the principle of a “current-energized synchronous machine,” which BMW describes as “the excitation of the rotor is triggered by the precisely metered supply of electrical energy.”</p><p id=\"esTPfX\">Most electric motors are powered by permanent magnets, sometimes no larger than a pack of playing cards, that are made of rare earth metals. The magnets enable the motors to transform electricity into motion, thus powering the vehicle. These rare earth magnets, mostly made of neodymium (NdFeB), are almost entirely mined and processed in China.</p><p id=\"NXPDFa\">By using current-energized synchronous machine principles, BMW says it can achieve a higher energy density, especially in the rear motor, which in turn allows the automaker to achieve levels of performance it expects out of its 7-series vehicles.</p><div class=\"c-float-right\"><aside id=\"OxqUJY\"><q>The design is unmistakably BMW</q></aside></div><p id=\"Io8p9d\">The design is unmistakably BMW, right down to the <a href=\"https://www.theverge.com/2022/3/16/22980864/bmw-i7-electric-sedan-images-specs-grille\">massive, unnecessary kidney-shaped grille in the front</a>. BMW claims that the i7’s grille has been “completely reinterpreted to achieve a modern and distinct look.” For example, the grille is outlined in a narrow band of “exclusive crystal glass” LED, which helps accent it and — arguably — draw more attention to it.</p><p id=\"7nPJrp\">It should be mentioned that the company has been subjected to a lot of harsh criticism lately on social media for its ever expanding take on the classic kidney grille. <a href=\"https://www.theverge.com/2021/6/1/22462746/bmw-ix-suv-ev-price-specs\">When asked about this last year</a>, Don Smith, product manager for BMW, said recently that while “obviously it makes no sense to have an open grille,” the automaker’s customers “want it to look like a BMW.” </p><p id=\"HULl9l\">There’s more crystal inside the i7, including on the dashboard and center console in the form of a gear shifter knob. But the real draw is the Theater Screen, a massive 31-inch display that basically turns the sedan into a cinema-on-wheels. With its 32:9 panoramic display format and 8K streaming resolution, the screen moves out of the roof liner and is for rear passengers only. The i7 will also be equipped with a Sky Lounge panoramic glass roof with LED light threads. It’ll be interesting to see how this interacts with the BMW theater screen.</p><p id=\"jluesk\">For the driver, a curved display starts behind the steering wheel and extends halfway across the dashboard. This involves merging the 12.3-inch instrument cluster and the central 14.9-inch infotainment screen into a single unit angled toward the driver. Featuring the latest version of BMW’s iDrive operating software, the curved display will have the appearance of floating above the dashboard, which is quickly becoming a common feature in luxury automobiles.</p><div class=\"c-float-right\"><aside id=\"WoJvLu\"><q>BMW has a host of new EVs coming out in the next few years</q></aside></div><p id=\"JN9KMO\">BMW has a host of new EVs coming out in the next few years, with <a href=\"https://www.press.bmwgroup.com/global/article/detail/T0348272EN/bmw-group-posts-significant-sales-growth-through-september-group%E2%80%99s-electro-offensive-consistently-driven-forward-sales-of-fully-electric-vehicles-more-than-doubled?language=en\">the goal of achieving 50 percent</a> of the company’s sales by 2030. The company is developing an all-electric version of its <a href=\"https://www.theverge.com/2020/7/28/21345464/bmw-5-7-series-x1-electric-car-ev-plug-in\">5 Series</a> as well as its entry-level X1 SUV. Earlier this year, the company revealed the <a href=\"https://www.theverge.com/2020/7/14/21324114/bmw-ix3-electric-suv-range-specs-price-china-europe\">production iX3</a>, the all-electric version of its top-selling X3 SUV, which will only be available in Europe and China. In the US, the <a href=\"https://www.theverge.com/2021/6/1/22462504/bmw-i4-ev-price-specs-photos-release-date\">BMW i4 sedan</a> and <a href=\"https://www.theverge.com/2021/6/1/22462746/bmw-ix-suv-ev-price-specs\">iX SUV</a> will start making deliveries later this year.</p><p id=\"NwEJYo\">That means almost all of the German luxury automaker’s most popular cars will soon have all-electric variants. A fully electric version of the 3 Series, BMW’s most popular car in the US, has <a href=\"https://www.autocar.co.uk/car-news/new-cars/new-electric-bmw-3-series-spied-testing\">already been spotted in testing camouflage</a>. (The automaker <a href=\"https://www.theverge.com/2021/6/28/22554419/bmw-i3-discontinued-us-electric-hatchback-sales\">discontinued</a> its quirky i3 hatchback last year.)</p><p id=\"GB4Vyg\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ophIz_fCf_qdiFrI_PCNWUBsJPg=/0x356:4961x2953/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23401739/P90458174_The_new_BMW_i7_xDrive60._European_model_shown.jpg",
  "description": "An 8K, 31-inch rear-seat theater screen for passengers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}