{
  "title": "Boeing’s third launch attempt nears for embattled Starliner spacecraft",
  "url": "https://www.theverge.com/2022/5/19/23075086/boeing-cst-100-starliner-nasa-commercial-crew-oft-2-iss",
  "date": "2022-05-19T13:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ljdrbMuhlfu1LLZKSbfhdt-IWjk=/393x0:5583x3460/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70887084/52083048300_d42477af57_o.0.jpg\" />        <figcaption><em>Boeing’s CST-100 Starliner as it is wheeled out to its launchpad on an Atlas V rocket.</em> | Image: NASA/Joel Kowsky</figcaption>    </figure>  <p>Perhaps this time will be the one</p> <p id=\"qWWO2C\">On Thursday, aerospace company Boeing is set to conduct a critical test flight of its new passenger spacecraft, the CST-100 Starliner — a mission that will launch the gumdrop-shaped capsule to the International Space Station without any people on board. It’s a flight that Boeing desperately needs to go well after a long journey to the launchpad that’s been marked by numerous failures, false starts, and lengthy delays.</p><p id=\"gkrcW4\">Starliner is, in essence, a space taxi. Designed to carry up to seven passengers, the capsule is meant to launch to orbit on top of an Atlas V rocket, automatically dock with the International Space Station, or ISS, and then eventually land back on Earth again under a suite of parachutes. Once it’s deemed operational, Starliner will primarily transport NASA astronauts to and from the station to help keep the ISS continuously staffed. But before NASA feels comfortable putting people on board, the agency wants Starliner to prove it can safely perform all the major milestones of a human spaceflight mission.</p><div class=\"c-float-right c-float-hang\"><aside id=\"japA5p\"><q>This upcoming Starliner launch is a do-over of a do-over</q></aside></div><p id=\"fuJtGo\">Proving that has turned out to be a struggle for Boeing over the last three years. In fact, this upcoming Starliner launch is a do-over of a do-over. Boeing first attempted to launch an uncrewed Starliner in 2019, but the spacecraft never made it to the space station as intended. At NASA’s behest, the company agreed to give the test flight another shot, with a redo launch planned to take place in the summer of last year. But after rolling out Starliner to the launchpad, Boeing wound up taking the spacecraft back to the factory to fix some valves that weren’t behaving properly. It’s been nearly a year since that rollback took place, and the cumulative delays <a href=\"https://spacenews.com/boeing-takes-185-million-charge-because-of-starliner-delays/\">have cost Boeing an extra $595 million</a>.</p><p id=\"nGlNFs\">Now, Boeing is poised to try again, and the company is hoping that the third time will be the charm. “The Boeing team is prepared and ready,” Mark Nappi, Boeing’s program manager for the Commercial Crew Program, said during a press conference ahead of the flight. “The NASA-Boeing partnership is really strong, and it’s a reflection of all the hard work that’s been done.” </p><p id=\"oZQnUF\">The reality is Boeing’s ties to NASA have slowly eroded during Starliner’s development, and failing at this flight test could put that partnership in further jeopardy. Plus, if Boeing doesn’t succeed, NASA could be left with just one launch provider — SpaceX — to get humans to and from the ISS.</p><h2 id=\"2XqzIm\"><strong>First try</strong></h2><p id=\"ZEid3N\">Boeing’s been working on Starliner <a href=\"https://www.nasa.gov/press/2014/september/nasa-chooses-american-companies-to-transport-us-astronauts-to-international\">since 2014</a> when NASA selected the company, along with SpaceX, to develop space capsules that could carry astronauts to and from the space station. The two companies were the finalists in NASA’s Commercial Crew Program, which aimed to put private companies — not the government — in charge of transporting people to low Earth orbit. At the time, Boeing received an initial development contract worth $4.2 billion, while SpaceX received a contract worth $2.6 billion.</p><p id=\"jnWVwP\">Those contract awards sparked a competition between SpaceX and Boeing to see which company could launch humans to the ISS first. Throughout the development process, both SpaceX and Boeing seemed neck and neck, with Boeing projected to be slightly ahead. The company had been favored from the beginning, as it has been a longtime contractor for the space agency. Boeing is the prime contractor on the International Space Station, and it’s currently building NASA’s next-generation rocket, the Space Launch System.</p><div class=\"c-float-left c-float-hang\"><aside id=\"xyIn4l\"><q>For Boeing, the Commercial Crew Program was a new way of doing business with NASA</q></aside></div><p id=\"IZBCp4\">But for Boeing, the Commercial Crew Program was a new way of doing business with NASA. Boeing has often worked with the space agency through cost-plus contracts: agreements where the company receives funding from the agency to cover all development costs. Once development is over, NASA owns the vehicle. With Commercial Crew, the contracts were fixed-price. NASA gave the companies a lump sum, and the companies had to cover any development costs that went over the initial price. Along the way, Boeing struggled with meeting its milestones, and <a href=\"https://oig.nasa.gov/docs/IG-20-005.pdf\">an audit revealed</a> that NASA agreed to pay the company an additional $287 million to address these schedule slips and “ensure the company continued as a second commercial crew provider.”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1nNz5mri5_xnMRNh_GHMv8qJINQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545084/KSC_20191220_PH_AWG05_0523_orig.jpeg\">      <cite>Image: NASA/Tony Gray &amp; Kevin O’Connell</cite>      <figcaption><em>Starliner lifting off on top of ULA’s Atlas V rocket in December 2019.</em></figcaption>  </figure></div><p id=\"IAaym8\">When it finally came time to fly Starliner, Boeing experienced nothing but snags. As part of its Commercial Crew agreement with NASA, Boeing is supposed to launch an uncrewed version of the capsule and put it through the paces of an actual launch before humans ride on the vehicle. Boeing first tried to do this back in December 2019 with a mission called OFT, or Orbital Flight Test. While Starliner successfully launched to space on top of its Atlas V rocket, a software glitch prompted the capsule to fire its thrusters incorrectly, <a href=\"https://www.theverge.com/2019/12/20/21031243/boeing-cst-100-starliner-oft-launch-failure-orbit\">and it got into the wrong orbit</a>. Mission controllers could not fix the issue during the misfire due to a <a href=\"https://blogs.nasa.gov/commercialcrew/2020/02/07/nasa-shares-initial-findings-from-boeing-starliner-orbital-flight-test-investigation/\">communications blackout</a>. Ultimately, Starliner wasn’t able to reach the International Space Station, and Boeing was forced to bring the capsule home early <a href=\"https://www.theverge.com/2019/12/22/21033757/boeing-cst-100-starliner-landing-success-oft-rough-flight\">after just two days in space</a>.</p><div class=\"c-float-right c-float-hang\"><aside id=\"bYqTV5\"><q>Boeing and NASA revealed that engineers had actually fixed a <em>second</em> software issue mid-flight</q></aside></div><p id=\"jxwgsH\">Later, Boeing and NASA revealed that engineers had <a href=\"https://www.theverge.com/2020/2/6/21127127/boeing-starliner-spacecraft-nasa-safety-software-glitch-catastrophic\">actually fixed a <em>second</em> software issue mid-flight</a>, one that could have caused a “catastrophic spacecraft failure” during landing if it hadn’t been remedied, according to a NASA safety panel. After that, NASA and Boeing launched a full investigation into the OFT issues and Boeing’s safety culture, coming up with <a href=\"https://www.nasa.gov/feature/nasa-and-boeing-complete-orbital-flight-test-reviews\">80 recommendations that Boeing should address before it flew again</a>, such as conducting more simulations and integrated software testing. Boeing also opted to do a redo of OFT — a new mission called OFT-2.</p><p id=\"FxhLEb\">As Boeing worked to prepare for its do-over, SpaceX successfully launched its first human crew in May 2020 and has conducted five crewed missions for NASA since.</p><h2 id=\"PXG7GE\"><strong>Second try</strong></h2><p id=\"1nlqhN\">Boeing’s second attempt at launching Starliner was supposed to happen last August, a year and a half after the botched OFT mission. After claiming to have implemented all of the changes that NASA asked for, the company rolled Starliner out to its launchpad in Florida, poised for launch. But hours before the capsule was slated for takeoff, Boeing halted the countdown.</p><p id=\"5OX4vd\">The company found that 13 of Starliner’s 24 valves — used to transport the capsule’s oxidizer propellant — <a href=\"https://www.theverge.com/2021/8/3/22607683/boeing-starliner-technical-issue-nasa-launch-postponed\">were stuck in the wrong position</a>. While Boeing was able to free some of the valves before the scheduled takeoff time, a few still wouldn’t budge, and the company opted to roll the capsule back to the factory for further inspection. Diagnosing the issue took months and included CT scans of the valves. The company believes that some of the oxidizer in the valves escaped, mingling with moisture from the humid Florida air, <a href=\"https://www.theverge.com/2021/10/19/22735198/boeing-starliner-nasa-sticky-valves-oxidizer-corrosion-launch-delay\">creating corrosion that prevented the valves from opening properly</a>.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PQ8rhS3Jn1r0oD9ChSfUetO74eE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545103/KSC_20220504_PH_FMX01_0124_orig.jpeg\">      <cite>Image: NASA/Frank Michaux</cite>      <figcaption><em>Boeing’s Starliner spacecraft earlier this month, ahead of integration on top of the Atlas V rocket.</em></figcaption>  </figure></div><p id=\"7jUzSf\">Boeing says it has fixed the problem and is ready to fly again. The valves on this Starliner have been replaced, and Boeing has included some extra fixes to ensure the corrosion doesn’t happen again. A sealant has been added to prevent moisture from entering the valves, and Boeing has done a dry purge to get any extra moisture out of the system.</p><p id=\"dt6H3i\">Originally, Boeing indicated that the valves would stay the same design. “We have not redesigned the valve at this point,” Michelle Parker, Boeing vice president and deputy general manager of space and launch, said during a press conference. “These are the same valves.” However, after <a href=\"https://www.reuters.com/business/aerospace-defense/exclusive-boeing-clashes-with-key-supplier-ahead-starliner-spacecraft-launch-2022-05-11/\">a report in <em>Reuters</em> detailed friction between Boeing and Aerojet Rocketdyne</a>, the manufacturer of the valves, over the cause of the stickiness, Boeing admitted that the company <em>is</em> considering a valve redesign.</p><p id=\"gaSEbW\">“The short term solution has been not to have a redesigned valve,” Nappi said during a follow-up press conference. “That’s always been the case. And the long term solution, we’ve been looking at options for at least a month if not more, and it has included a valve redesign as an option.”</p><h2 id=\"bfY2Tw\"><strong>The future</strong></h2><p id=\"LZSukH\">As of now, things appear to be on track for Thursday’s launch. “We did one last cycle of all the valves [on Monday] and they all operated nominally, so we’re in good shape,” Nappi said. </p><p id=\"Dp4Hf4\">If Boeing can get Starliner into the proper orbit this time, the main thing the company needs to demonstrate is Starliner’s ability to automatically dock with the International Space Station. That’s a critical task the capsule will have to perform on its human spaceflight missions. “You can do so much on the ground, you can do so much analysis and then at some point, it’s really ready to go fly and test those systems,” Steve Stich, the program manager for the Commercial Crew Program at NASA, said during a press conference. If the launch is a success, Starliner will attempt to dock with the International Space Station on Friday afternoon, and its hatch will be opened on Saturday morning. The capsule will stay attached to the ISS for about four to five days before undocking and returning to Earth, landing in either White Sands Missile Range in New Mexico, Dugway Proving Ground in Utah, Edwards Air Force Base in California, or Willcox Playa in Arizona.</p><div class=\"c-float-left c-float-hang\"><aside id=\"Z4pS1j\"><q>“You can do so much on the ground”</q></aside></div><p id=\"5FFGnQ\">All and all, Boeing really needs this mission to go well. Though the company is still one of NASA’s biggest partners, <a href=\"https://www.theverge.com/2021/7/28/22595730/boeing-starliner-astronaut-capsule-launch-nasa-oft2\">its future with the space agency is a bit dubious</a>. Boeing’s work on NASA’s next-generation rocket, the Space Launch System, continues to suffer delay after delay, and its development costs have ballooned over the last decade. Boeing also lost out on a major multimillion-dollar bid to build NASA’s new human lander to put people on the Moon. After a string of setbacks across the board, Boeing could use a Starliner win.</p><p id=\"Y4SBub\">After the launch is over, then it’s time to get ready for putting people on board Starliner — and that could take some time, especially if Boeing does decide to do a valve redesign. A NASA safety panel also noted that there is a “tremendous amount of work to accomplish” between a successful OFT-2 flight and a test flight with people on board. “The panel is pleased that from all indications there’s no sense of needing to rush,” Dave West, a member of NASA’s Aerospace Safety Advisory Panel, said during a meeting last week.</p><p id=\"n3Qp4P\">But, ultimately, any major Starliner setbacks put NASA in a bit of a bind, too. While SpaceX has proven to be very capable of putting crews into orbit for the space agency, NASA <em>does</em> like to have redundancy. For the last decade, NASA only had the Russian Soyuz rocket to get its astronauts to orbit, which proved to be a tricky situation when one Soyuz failed during a launch, prompting fears that NASA had no way to fly astronauts to space. While NASA is still working toward flying future astronauts on Russian Soyuz capsules, tensions between the US and Russia make that arrangement somewhat tenuous. Having Boeing’s Starliner in play would give NASA even more options, something the agency always likes to have.</p><p class=\"c-end-para\" id=\"GAP9F4\">“This mission is a major stepping stone for Boeing and NASA, as we enable ... an additional crew provider to the International Space Station,” Joel Montalbano, the program manager for the International Space Station at NASA, said during a press conference. “And we consider this a landmark flight.”</p><p id=\"oA76Jp\"></p><p id=\"ZAS1nk\"></p><p id=\"aDySjV\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Y0IXQ9hnk8VSr1C7J5z6ugjHIqw=/0x166:5976x3295/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23545098/52083048300_d42477af57_o.jpg",
  "description": "It’s been a long road to get to this point.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}