{
  "title": "Boeing CEO calls Trump’s Air Force One deal a risk it ‘probably shouldn’t have taken’",
  "url": "https://www.theverge.com/2022/4/27/23045514/boeing-ceo-trump-air-force-one-deal-risk",
  "date": "2022-04-28T01:10:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"President Biden Delivers Remarks On Infrastructure Projects In Portland, Oregon\" src=\"https://cdn.vox-cdn.com/thumbor/lx5jO0dr0zIRFkGk4gh-DqIx_wY=/0x2:4874x3251/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70802679/1240139146.0.jpg\" />        <figcaption><em>Boeing is still working on the next generation Air Force One (the current one is pictured here).</em> | Photo by Nathan Howard/Getty Images</figcaption>    </figure>  <p id=\"mWGPp0\">Boeing’s CEO, Dave Calhoun, says that the company’s deal with Trump to build Air Force One was a risk the company “probably shouldn’t have taken.” The comment was made on Wednesday during <a href=\"https://investors.boeing.com/investors/events-and-presentations/event-details/2022/Q1-2022-The-Boeing-Company-Earnings-Conference-Call/default.aspx\">a conference call</a> to discuss the company’s <a href=\"https://boeing.mediaroom.com/2022-04-27-Boeing-Reports-First-Quarter-Results\">Q1 results for 2022</a>, which show that the Air Force One program went $660 million over its expected budget in the past few months. In <a href=\"https://s2.q4cdn.com/661678649/files/doc_financials/2022/q1/07d53103-45d1-4066-8c2b-32682cbc35a0.pdf\">a financial filing</a> (PDF), Boeing reports that it’s now lost $1.1 billion on the contract.</p><p id=\"Pwv524\">“Air Force One I’m just gonna call a very unique moment, a very unique negotiation, a very unique set of risks that Boeing probably shouldn’t have taken, but we are where we are and we’re going to deliver great airplanes. And we’re gonna recognize the cost associated with it,” says Calhoun.</p><div class=\"c-float-right\"><aside id=\"FpBOZy\"><q>Q1 was a “messy quarter” when it came to Boeing’s defense contracts.</q></aside></div><p id=\"sjGglJ\">In 2018, Boeing came to an agreement with then-president Trump to develop and build two new Air Force One airplanes for a fixed price of $3.9 billion. <a href=\"https://www.acquisition.gov/far/part-16#FAR_Subpart_16_2\">According to acquisition.gov</a>, a firm-fixed-price contract is where the contractor (in this case, Boeing) is paid the same for a project no matter what costs — and potentially, losses — it incurs. </p><p id=\"a1uJPU\">The new agreement came after Trump threatened (via tweet, of course) to <a href=\"https://www.theverge.com/2016/12/6/13857444/trump-tweet-air-force-one-boeing-nuclear-blast\">cancel the government’s previous Air Force One order</a> as a cost-cutting measure in 2016. The original project was estimated to come in somewhere between $4 and $5 billion. The new agreement also shifted the timeline to build the plane — Trump apparently wanted it done by 2021, instead of 2024, <a href=\"https://www.cnn.com/2018/02/27/politics/boeing-air-force-one-donald-trump/index.html\">according to CNN</a>.</p><p id=\"DjhvCw\">Boeing didn’t meet that timeline, which isn’t terribly surprising. Since that deal was made, the company has been rocked by the <a href=\"https://www.theverge.com/2019/3/22/18275736/boeing-737-max-plane-crashes-grounded-problems-info-details-explained-reasons\">737 Max scandal</a> (which led to its CEO, Dennis Muilenburg, being fired and replaced by Calhoun), not to mention a global pandemic. </p><div class=\"c-float-right\"><aside id=\"VaU2pC\"><q>“We just got whacked in a number of different areas.”</q></aside></div><p id=\"GWun8U\">Calhoun said during Wednesday’s call that COVID-19 had been especially rough for the company’s work on the new Air Force One. “In the defense world when a COVID line goes down or a group of workers steps out, we don’t have a whole bunch of cleared people to step into their shoes,” he said, noting the “ultra-high” security clearances required to work on the president’s plane. “We just got whacked in a number of different areas.”</p><p id=\"RiZMQw\">He also noted that he didn’t want to take on any additional fixed price contracts, and had a “very different philosophy” about them compared to the company’s previous CEO.</p><p id=\"qsz5TN\">Calhoun says that, with regard to government contracts, Boeing had a “messy quarter” largely because of the Air Force One project. “You’ll recall it was a public negotiation that happened quite some time ago. We took some risks not knowing that COVID would arrive, and not knowing that an inflationary environment would take hold like it has.”</p><p id=\"IrXgPw\"><a href=\"https://www.politico.com/news/2022/04/27/boeing-trump-air-force-one-deal-00028216\"><em>Politico </em>is reporting</a> that Boeing now plans to deliver the first Air Force One in 2024, and the second plane the year after. CNBC, however, <a href=\"https://www.cnbc.com/2022/04/27/boeing-lost-billion-dollars-on-trump-air-force-one-plane-deal.html\">reports</a> that it could be delayed further, and Boeing’s financial statement says it may continue to lose money on the project.</p><p id=\"6qdOYt\">CNBC’s story also includes a <a href=\"https://twitter.com/Boeing/status/968501017854775297?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E968501017854775297%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.cnbc.com%2F2022%2F04%2F27%2Fboeing-lost-billion-dollars-on-trump-air-force-one-plane-deal.html\">2018 tweet from Boeing</a> that calls the project (which, again, is now over a billion in the hole) an “outstanding value to taxpayers.” The tweet also says that “President Trump negotiated a good deal on behalf of the American people.” But here’s a question — if Boeing is taking heavy losses on the project, and writes them off on its taxes, is the general public really any better for the supposed savings?</p><div id=\"mv2ejE\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Boeing is proud to build the next generation of Air Force One, providing American Presidents with a flying White House at outstanding value to taxpayers. President Trump negotiated a good deal on behalf of the American people. <a href=\"https://t.co/m0HtGfXVlv\">pic.twitter.com/m0HtGfXVlv</a></p>— The Boeing Company (@Boeing) <a href=\"https://twitter.com/Boeing/status/968501017854775297?ref_src=twsrc%5Etfw\">February 27, 2018</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"kexHBO\">One final note: $2 billion per plane is still an unbelievable amount of money. You know how the F-35 is famous for being obscenely over budget, with the final price tag expected to be <a href=\"https://www.nbcnews.com/think/opinion/air-force-admits-f-35-fighter-jet-costs-too-much-ncna1259781\">around $1.6 trillion</a>? So far, <a href=\"https://www.f35.com/f35/about/fast-facts.html\">Lockheed says</a> it’s made around 800 of those planes, which means each one also currently costs around $2 billion, though that figure will go down as more planes are made. </p><p id=\"9IZdAc\">As my colleague Andrew Hawkins <a href=\"https://www.theverge.com/2016/12/6/13857444/trump-tweet-air-force-one-boeing-nuclear-blast\">has pointed out</a>, though, Boeing’s Air Force One(s) will likely be very advanced and able to dodge missiles and survive nuclear fallout and EMPs — there’s a cost to making the, as he put it, “the most resilient, high-tech, tricked-out jumbo jet in existence.”</p><aside id=\"DCtrsb\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Trump’s Boeing beef ignores the high costs of building a plane that can withstand a nuclear blast\",\"url\":\"https://www.theverge.com/2016/12/6/13857444/trump-tweet-air-force-one-boeing-nuclear-blast\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/eO87acqwcoJewqUgIQgOapTROXk=/0x350:4874x2902/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23421371/1240139146.jpg",
  "description": "COVID has made the project more difficult and expensive.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}