{
  "title": "Bollinger selects manufacturing supplier to help build its electric commercial vehicles",
  "url": "https://www.theverge.com/2022/5/9/23063629/bollinger-roush-contract-manufacture-ev-commercial",
  "date": "2022-05-09T16:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ITQhFFAkQrIQ632NjCDEpJfW6C0=/375x0:4425x2700/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70848633/Bollinger_Motors_DELIVER_E_Side.0.jpg\" />    </figure>  <p id=\"TdXdgo\">Electric vehicle startup Bollinger said it has selected its manufacturing supplier to build its forthcoming delivery van. The company will use Detroit auto supplier Roush as a contract manufacturer to assemble its line of all-electric platforms and chassis cabs for commercial vehicles. </p><p id=\"6jHGI9\">Bollinger says it will “source and provide all materials” for Roush, which will then assemble the platforms and chassis at its facility in Livonia, Michigan, which is 20 miles from Bollinger’s Oak Park headquarters. </p><div class=\"c-float-right\"><aside id=\"Bh4sjo\"><q>“We will be building state-of-the-art vehicles from day one right here in Michigan.”</q></aside></div><p id=\"dvk8Rm\">“We will be building state-of-the-art vehicles from day one right here in Michigan,” said Robert Bollinger, founder and CEO of Bollinger Motors. “Roush has significant engineering and assembly history, and we’re excited to work with them to provide our commercial fleet customers with exceptional electric vehicles.” </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Hu8fTjvPdJ19Q-SZMOVNhI8qNMg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448362/Embargo_May_9_12pm_EDT_Bollinger_Motors_Announces_Contract_Manufacturing_Partner.jpg\">      <cite>Image: Bollinger</cite>  </figure><p id=\"vkFSl8\">Bollinger burst onto the scene several years ago with a pair of very cool-looking, rugged, box-like electric truck prototypes: the four-door B1 (which is shaped like a Jeep Wrangler) and the B2 (which is longer and has a pickup bed). The company later postponed its plans to manufacture electric trucks in order to focus on commercial delivery vans. It’s the latest EV startup to <a href=\"https://www.theverge.com/2021/12/21/22846960/electric-vehicles-car-companies-promises-ship-dates\">run into speed bumps</a> as it attempts to build a complicated vehicle manufacturing business from scratch.</p><p id=\"i5EMeX\">Partnering with Roush may help improve Bollinger’s status, which currently has been languishing in the category of startups with intriguing prototypes but no concrete plans to turn them into a reality. In addition to working with established automakers for over 30 years, Roush also helped build <a href=\"https://www.theverge.com/2015/1/14/7547129/google-self-driving-cars-detroit\">Google’s now retired “Firefly” autonomous prototype cars</a> and Nuro’s driverless delivery robots. </p><p id=\"IwWvGg\">Bollinger’s Deliver-E electric van, <a href=\"https://www.theverge.com/2020/8/28/21405451/bollinger-electric-delivery-van-production-price-specs\">which was announced in 2020</a>, is slated to be built on a variable vehicle platform that allows for multiple battery sizes, such as 70kWh, 105kWh, 140kWh, 175kWh, and 210kWh. This will mean customers will have a variety of range options, prices, and wheelbase sizes to choose from. The front-wheel-drive platform will be engineered to fit Classes 2B, 3, 4, and 5.</p><p id=\"9KjGrJ\">The company has previously declined to affirm a starting date for the van’s production, citing the search for a manufacturing partner. A spokesperson did not immediately respond to questions about when manufacturing will begin. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IZvf6ehLkIQuGnCg7G7yfej1Kk8=/0x94:4800x2607/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21824794/Bollinger_Motors_DELIVER_E_Side.jpg",
  "description": "Plans to make an electric truck are delayed \"indefinitely.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}