{
  "title": "Boost Mobile will let you lower your phone bill by playing games and watching ads",
  "url": "https://www.theverge.com/2022/5/15/23073854/boost-mobile-dish-lower-phone-bill-watch-ads-play-games",
  "date": "2022-05-15T17:36:50.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Celero 5G from Boost Mobile\" src=\"https://cdn.vox-cdn.com/thumbor/yx3tOQwEagfrmimCofF9CjizsRM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70871956/gsin_190407_4933_0031_cropped.0.jpg\" />        <figcaption>Photo by Gloria Sin / The Verge</figcaption>    </figure>  <p id=\"vXJ9KX\">Boost Mobile will now let you pay part of your phone bill with “blockchain-backed” Boostcoins earned through watching ads and playing games (via <a href=\"https://www.cnet.com/tech/mobile/boost-mobile-will-let-you-pay-your-phone-bill-by-watching-ads-and-playing-games/\"><em>CNET</em></a>). In a <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.boostmobile.com%2Fabout%2Fnewsroom.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F15%2F23073854%2Fboost-mobile-dish-lower-phone-bill-watch-ads-play-games\" rel=\"sponsored nofollow noopener\" target=\"_blank\">press release</a>, the carrier says you can get BoostCoins by downloading the new BoostOne app, and then interacting with the games, ads, and Boost Mobile’s partners from within the app.</p><p id=\"X4r732\">But don’t get too excited just yet — one Boostcoin equals just one cent. In other words, you’ll likely have to dedicate a lot of time to the app if you want to see any significant savings. As pointed out by <em>CNET</em>, watching an ad lasting several seconds will earn you two Boostcoins. There’s also a <em>Wheel of Fortune</em>-style <em>Spin &amp; Win</em> game that rewards players with anywhere from five cents to $5 in a single spin. It’s unclear whether there are limitations on how many games you can play per day, as well as how many ads you can watch.</p><div class=\"c-float-right\"><aside id=\"AErqiR\"><q>This isn’t Dish’s first attempted move into the web 3 space</q></aside></div><p id=\"uD3KDD\">“This represents an exciting new business model and a stepping stone into the future for wireless consumers,” Stephen Stokols, the CEO of Boost Mobile, said in the press release. “Most telcos rely on subscription models, but it’s time to move beyond the old ways and to embrace proven digital models popular in other industries.”</p><p id=\"LqcWg1\">Boost Mobile says it plans on letting users share Boostcoins with each other in the future, and will eventually include other ways to redeem the coins, like trading them for a free phone. It’s still not entirely clear how Boostcoins are backed by the blockchain, and Dish (Boost’s parent company) didn't immediately reply to <em>The Verge</em>’s request for comment.</p><p id=\"k2VUr9\">This isn’t Dish’s first attempted move into the web 3 space, and (unfortunately), it looks like this is only just the beginning. Earlier this month, <a href=\"https://www.theverge.com/2022/5/4/23057401/dish-network-5g-las-vegas-oran-project-genesis-nft\">Dish finally launched its 5G network in Las Vegas</a>, called Project Genesis. It rolled out an accompanying app that comes with gamified ways to help the company fine-tune the network, which offers some rewards for participating — including NFTs. </p><p id=\"41X0LV\">Last week, <a href=\"https://www.theverge.com/2022/5/10/23066066/dish-network-boost-infinite-project-genesis-5g\">Boost CEO Stokols teased the company’s new postpaid Boost Infinite wireless plan</a> coming this fall. Stokols hinted at letting users pay for their new phones with cryptocurrency, as well as allowing users to exchange their unused data for digital currency. Dish is currently in the process of trying to squeeze its way between T-Mobile, Verizon, and AT&amp;T to become the fourth major carrier option in the US, and its deadline to cover 20 percent of the population with its service <a href=\"https://www.theverge.com/2022/2/24/22949389/dish-network-5g-las-vegas\">is closely approaching</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/N-8TRxnXG09yD0tCwBdBqU1k2OY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23102112/gsin_190407_4933_0031_cropped.jpg",
  "description": "Rewarding you with \"blockchain-backed\" Boostcoins.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}