{
  "title": "Bored Ape Yacht Club creator raises $450 million to build an NFT metaverse",
  "url": "https://www.theverge.com/2022/3/22/22991272/yuga-labs-seed-funding-a16z-bored-ape-yacht-club-bayc-metaverse-other-side",
  "date": "2022-03-22T19:00:00.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"An illustration of a Bored Ape at the center of a vortex pulling in Meebits and CryptoPunks.\" src=\"https://cdn.vox-cdn.com/thumbor/cDQnpfg2kAPsh02bRvSxMfMXV1M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70658200/acastro_2203011_5082_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"m8VXA1\">Yuga Labs, the owner of three of the biggest NFT brands on the market, has raised $450 million in funding at a $4 billion valuation, the company announced today. The team behind Bored Ape Yacht Club plans to use the money to build a media empire around NFTs, starting with games and its own metaverse project.</p><p id=\"2pAymv\">The team describes its metaverse project, called <em>Otherside</em>, as an MMORPG meant to connect the broader NFT universe. They hope to create “an interoperable world” that is “gamified” and “completely decentralized,” says Wylie Aronow, a co-founder of Bored Ape Yacht Club who goes by the pseudonym Gordon Goner. “We think the real <em>Ready Player One</em> experience will be player run.”</p><p id=\"hUPxGb\">The announcement comes just weeks after Yuga Labs made a major move to consolidate the NFT space, <a href=\"https://www.theverge.com/2022/3/11/22973394/bored-ape-yacht-club-cryptopunks-meebits-nft\">acquiring CryptoPunks and Meebits from Larva Labs</a>. The acquisition put three of the most lucrative NFT collections under one roof — and gave Yuga Labs a bigger roster of IP to pull from when crafting its game and metaverse plans. The company also <a href=\"https://www.theverge.com/2022/3/16/22981916/apecoin-dao-launched-bayc-bored-ape-yuga-labs\">launched a cryptocurrency, ApeCoin</a>, last week; the token will be governed independently and used as the primary currency in Yuga Labs’ properties.</p><p id=\"zOP9jb\">Yuga Labs is partnering with “a few different game studios” to bring <em>Otherside</em> to life, says CEO Nicole Muniz. The game won’t be limited to Bored Ape holders, and the company plans to create development tools that allow NFTs from other projects to work inside their world. “We’re opening the door to effectively a walled garden and saying ‘Everybody’s welcome.’”</p><div id=\"2s3aIK\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">See you on the Otherside in April. Powered by <a href=\"https://twitter.com/apecoin?ref_src=twsrc%5Etfw\">@apecoin</a> <a href=\"https://t.co/1cnSk1CjXS\">pic.twitter.com/1cnSk1CjXS</a></p>— Yuga Labs (@yugalabs) <a href=\"https://twitter.com/yugalabs/status/1505014986556551172?ref_src=twsrc%5Etfw\">March 19, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"EzXo5j\">Metaverse projects are all the rage right now — <a href=\"https://www.theverge.com/22749919/mark-zuckerberg-facebook-meta-company-rebrand\">see Facebook renaming itself to Meta</a> — but Yuga Labs thinks other companies are going about their metaverse ideas wrong, giving the startup a chance to stand out. People won’t bond from spending time together in a shared virtual space with nothing going on, says Greg Solano, a Yuga Labs co-founder who goes by the pseudonym Gargamel. Instead, he says, people bond from being put in positions where they have to collaborate.</p><p id=\"6kLxk4\">“You only play with people and make friends because you’re getting your ass kicked,” Solano says. “Basically, we don’t think deep social experience comes from essentially a Zoom chat and walking around saying ‘hi.’” Yuga Labs declined to provide a timeline on the release of <em>Otherside</em>. A play-to-earn game is also planned for later this year.</p><p id=\"b3kUFV\">The funding round, one of the largest for an NFT company to date, was led by the firm Andreessen Horowitz, which has been investing heavily in the Web3 space. It previously funded OpenSea, Dapper Labs, and Coinbase. Also joining the funding round are the game studio Animoca Brands and crypto firms Coinbase and MoonPay, among others. Chris Lyons, a general partner at Andreessen Horowitz, will join the board of Yuga Labs. Funding talks were <a href=\"https://www.ft.com/content/acc635d6-bb05-4af6-b4da-b8462c06466d\">first reported last month by the <em>Financial Times</em></a>.</p><div class=\"c-float-right\"><aside id=\"sDG0t9\"><q>“There’s a dystopian future where Meta is this kind of dominant digital experience provider”</q></aside></div><p id=\"6lNPud\">“To me, Yuga Labs, combined with these other emerging [Web3] companies, are an important counterweight to companies like Meta,” Chris Dixon, who leads Andreessen Horowitz’s crypto arm, tells <em>The Verge</em>. “There’s a dystopian future where Meta is this kind of dominant digital experience provider, and all of the money and control goes to that company.” (Interestingly, Andreessen Horowitz’s co-founder, Marc Andreessen, is on Meta’s board of directors and invested early in Facebook.)</p><p id=\"NyrkRJ\">Yuga Labs has been financially successful to date. A <a href=\"https://www.theblockcrypto.com/post/137829/bored-ape-yacht-club-yuga-labs-virtual-land-sales-metaverse\">leaked pitch deck</a> indicates that the company made $137 million last year, primarily by taking a cut of the transactions tied to its NFT brands, with an astounding 95 percent profit margin. (Yuga Labs declined to comment on figures from the deck.)</p><p id=\"0QNlJS\">But the company has built fairly little at this point. Its NFT collections have 40,000 users at most, according to OpenSea’s data, and the company has only released one game for a limited period of time. That means Yuga Labs is essentially being given hundreds of millions of dollars to build a gaming company — or at least, the Web3-ified 2022 version of one — from scratch, off the back of a hugely lucrative art project. </p><p id=\"hQV6ig\">That success is what investors are thinking about when funding Yuga Labs. “They built this very energized community and this culture phenomenon,” says Dixon. But the company is ultimately making the same big bet that so many others are right now: that some format of metaverse project will become the next explosive thing. Now, they just have to build it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rVEmV_irhLRha08S9D3dyv1AKOI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307862/acastro_2203011_5082_0001.jpg",
  "description": "The company wants to build a \"player-run\" metaverse RPG.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}