{
  "title": "Bored Ape Yacht Club creator buys CryptoPunks and Meebits",
  "url": "https://www.theverge.com/2022/3/11/22973394/bored-ape-yacht-club-cryptopunks-meebits-nft",
  "date": "2022-03-11T23:00:00.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"An illustration of a Bored Ape at the center of a vortex pulling in Meebits and CryptoPunks.\" src=\"https://cdn.vox-cdn.com/thumbor/5ozAiAHUL_qVsVTOc9OxbbUL0eM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70611184/acastro_2203011_5082_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"62I84I\">Yuga Labs, the creator of Bored Ape Yacht Club, announced today that it had acquired CryptoPunks and Meebits from Larva Labs. CryptoPunks is one of the oldest and most valuable brands in the NFT world, and Meebits quickly joined the list of most valuable NFT collections after launching last May.</p><p id=\"vWtzaN\">Yuga Labs hopes to foster a “community of builders” creating derivative works around the two projects. To do that, it plans to grant intellectual property and commercialization rights to CryptoPunks and Meebits owners, allowing them to create works and products based off their NFTs the same way that Bored Ape owners have.</p><p id=\"nBbmwe\">“Everybody knows CryptoPunks, everybody loves CryptoPunks,” Greg Solano, a Bored Ape Yacht Club co-founder who goes by the pseudonym Gargamel, tells <em>The Verge</em>. “It’s just iconic, ahead of its time. It’s visionary, and it’s gonna be here forever. We were just immediately excited about it without knowing at all what we would want the next step to be.”</p><div class=\"c-float-right\"><aside id=\"DDTLGN\"><q>“We felt like we were less and less suited to this.”</q></aside></div><p id=\"q3jBMp\">Matt Hall and John Watkinson, the co-founders of Larva Labs, said that they thought Yuga Labs would be better stewards of the projects going forward. The duo launched CryptoPunks in 2017 as a “sort of a digital art project,” Hall tells <em>The Verge</em>. “We felt like we were less and less suited to this as a couple of software developer experimentalist kind of people.” </p><p id=\"JFiQUe\">Yuga Labs is also acquiring more than 400 CryptoPunks and 1,700 Meebits from Larva Labs as part of the deal. The company declined to share the sale price. Larva Labs will continue to operate independently and work on new projects.</p><p id=\"Mc03VJ\">More than $1 billion worth of Bored Apes have been traded to date, according to OpenSea, which ranks the collection as the second-largest NFT collection of all time by trading volume. It’s beaten only by CryptoPunks, at $2.2 billion. Meebits have traded around $227 million in volume, according to OpenSea.</p><p id=\"tmy244\">The acquisition comes as the NFT market has started to cool off. After a rapid rise in sales volume and value throughout much of last year, the market began to dip around the holidays and has yet to pick back up. The sales tracker NonFungible pegs yesterday’s NFT sales at around 12,000 transactions with a total value of $30 million. Transaction totals were 10x higher than that through August and September of last year; even a month ago, sales numbers and value were twice as high as today.</p><div class=\"c-float-right\"><aside id=\"fY5lSl\"><q>Yuga Labs has grown to 50 employees, from 11 just two months ago</q></aside></div><p id=\"1aieZ1\">But while today’s purchase turns Yuga Labs into even more of a juggernaut in the NFT space, its founders are looking beyond NFTs when thinking about what’s next. The company has already launched merch drops, released a limited-time mobile game, and held a celebrity-packed party in Brooklyn.</p><p id=\"Pxm3X0\">“We see ourselves with tentacles into all those things: streetwear, events, gaming, NFTs, et cetera,” says Wylie Aronow, another co-founder of Bored Ape Yacht Club, who goes by the pseudonym Gordon Goner. “It’s just a matter of figuring out and extending that utility to these new IPs.”</p><p id=\"or71yO\">The team is also going to need to figure out ways to monetize its new acquisitions, which weren’t making money for Larva Labs. Though Yuga Labs takes a cut every time a Bored Ape is resold, Larva Labs doesn’t do that with CryptoPunks and Meebits. Yuga Labs doesn’t intend to change that, so they’ll have to figure something else out. Yuga Labs declined to comment on future plans for CryptoPunks and Meebits. They don’t want to repeat Bored Ape’s “membership club” model with CryptoPunks and Meebits, Aronow said. </p><p id=\"SArTOC\">Yuga Labs has also been growing rapidly. Yuga Labs had 11 employees as of January. Today, the co-founders say that number is closer to 50. The company has <a href=\"https://www.ft.com/content/acc635d6-bb05-4af6-b4da-b8462c06466d\">reportedly been in talks</a> with Andreessen Horowitz about a multi-million dollar investment at a valuation approaching $5 billion. Yuga Labs declined to comment on a potential investment.</p><p id=\"XalFBi\">The acquisition is a big deal for another reason: it’s perhaps the first sign of the NFT space professionalizing and consolidating. Outside of <a href=\"https://www.theverge.com/22348858/nba-nft-top-shot-dapper-labs\">the NBA’s Top Shot</a>, most of the big brands in the NFT space have been eccentric projects with names like Cool Cats and Pudgy Penguins that seem to be operated out of Discord servers. Yuga Labs is starting to act like a real company — and like any company staking a claim in a growing market, it’s looking to consolidate.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rVEmV_irhLRha08S9D3dyv1AKOI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307862/acastro_2203011_5082_0001.jpg",
  "description": "BAYC creator Yuga Labs has grown to 50 employees.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}