{
  "title": "Bored Ape Yacht Club creates a cryptocurrency to fund games, events, and merch",
  "url": "https://www.theverge.com/2022/3/16/22981916/apecoin-dao-launched-bayc-bored-ape-yuga-labs",
  "date": "2022-03-16T22:40:56.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"A blue coin with the Bored Ape Yacht Club logo in the middle.\" src=\"https://cdn.vox-cdn.com/thumbor/onk5nimeieHy-Vuql_ZO3kdMb8U=/432x0:2448x1344/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70632893/Screen_Shot_2022_03_16_at_6.32.10_PM.0.png\" />        <figcaption>The ApeCoin logo. | Image: ApeCoin DAO</figcaption>    </figure>  <p id=\"KXgsap\">Yuga Labs took its next step toward trying to build a broader media empire around the Bored Ape Yacht Club non-fungible token (NFT) series today with the announcement of a cryptocurrency called ApeCoin that will be the “primary token for all new products and services” from the company. That includes a newly announced play-to-earn blockchain game that the company plans to release later this year in partnership with the developer nWay.</p><p id=\"FLL22q\">ApeCoin’s initial use will be as in-game currency, but it’s being pitched as something that can be used beyond the confines of Yuga Labs’ titles. Starting tomorrow, it’ll be supported in <em>Benji Bananas</em>, a game from Animoca Brands, which also owns nWay. And the hope seems to be that it could be adopted in even more titles or even used as a more general-purpose digital currency.</p><div class=\"c-float-right\"><aside id=\"nwk4gI\"><q>Yuga Labs and BAYC’s founders will get around a quarter of all tokens</q></aside></div><p id=\"nvdG3s\">To make that happen, ApeCoin has been set up independently of Yuga Labs. The token will be overseen by a community-controlled organization called ApeCoin DAO. The DAO (short for decentralized autonomous organization) will be funded by sales of ApeCoin — 1 billion coins will be available — and controlled by members, with each token awarding a single vote. A corporate parent, the Ape Foundation, has also been created to execute decisions on behalf of the DAO. The Foundation’s board includes Alexis Ohanian and the co-founder of Animoca Brands, among others.</p><p id=\"yA9YGW\">The DAO is initially planning to spend a chunk of the money it raises on building out an ecosystem around the coin. That includes funding game development, events, and merch production. The roadmap also propose launching a decentralized NFT marketplace.</p><p id=\"xRSXEX\">Yuga Labs won’t be totally removed from the DAO, though — in fact, it’ll have a pretty sizable voting share in the organization. The company will retain around 15 percent of all ApeCoins minted, and BAYC’s founders will get another 8 percent. Contributors to the DAO’s launch will get another 14 percent of the tokens, too. Then, another 15 percent of tokens will be offered up first to holders of Bored Ape NFTs, leaving a little less than half of the total supply for everyone else who might want to buy in.</p><p id=\"Spolbe\">Since its launch last April, Bored Ape Yacht Club has become the biggest name in the NFT world, with multi-million dollar sales and a growing list of celebrity owners. Yuga Labs is now in talks for a multi-million dollar investment, and just last week it <a href=\"https://www.theverge.com/2022/3/11/22973394/bored-ape-yacht-club-cryptopunks-meebits-nft\">acquired two of the other biggest names in NFTs</a> — CryptoPunks and Meebits — to expand its portfolio.</p><p id=\"sYy7hA\">The company may be focused on the crypto world, but it seems to be orienting itself around games and other media going forward. And while it may not control ApeCoin, the token’s launch could position Bored Ape Yacht Club as the center of a broader blockchain gaming universe.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NUyIZCDWb-iqQeJ-v2e2JhmNCdA=/157x0:2724x1344/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23322207/Screen_Shot_2022_03_16_at_6.32.10_PM.png",
  "description": "Yuga Labs also teased work on a play-to-earn game.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}