{
  "title": "Bored Ape Yacht Club creator’s metaverse mint rocks the Ethereum blockchain",
  "url": "https://www.theverge.com/2022/5/1/23051974/bored-ape-yacht-club-metaverse-mint-rocked-ethereum-blockchain-otherside-otherdeeds-yuga-labs",
  "date": "2022-05-01T18:28:24.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"An illustration of a Bored Ape at the center of a vortex pulling in Meebits and CryptoPunks.\" src=\"https://cdn.vox-cdn.com/thumbor/Js4-64hvrSSasL1OV47Uny-QwH8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70819553/acastro_2203011_5082_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"lyeysQ\">Yuga Labs, the web3 company behind the Bored Ape Yacht Club, disrupted the entire Ethereum blockchain as a flood of users rushed to purchase NFTs representing virtual plots of land in its upcoming metaverse project, <em>Otherside</em>. A total of 55,000 Otherdeeds sold at <a href=\"https://mirror.xyz/0x3ae401F245034dAe25af1e2f9b9Bb8F006b1Dc6e/ErZMh-0TTwMrAKPJ1hlDcjvNfZvQ998G-B-oTS6BVQk\">a flat price of 305 ApeCoin</a>, or around $5,800 at the time of purchase (via <a href=\"https://cointelegraph.com/news/eth-gas-price-surges-as-yuga-labs-cashes-in-300m-selling-otherside-nfts\"><em>CoinTelegraph</em></a>), raising about $320 million in what was considered the “largest NFT mint in history.”</p><p id=\"GhmVix\">Otherdeeds are minted in <a href=\"https://www.theverge.com/2022/3/16/22981916/apecoin-dao-launched-bayc-bored-ape-yuga-labs\">BAYC’s native ApeCoin</a>, but <a href=\"https://twitter.com/OthersideMeta/status/1520568876785876992\">still require Ethereum for gas fees</a>. A gas fee is the cost associated with a transaction on the Ethereum blockchain. Fees typically increase as the network gets more congested, as it becomes more work to process a transaction.</p><p id=\"b3tfI3\">Such a large volume of transactions during the Otherdeed mint caused gas fees to soar. As noted by <em>CoinTelegraph</em>, Reddit user <a href=\"https://www.reddit.com/r/ethereum/comments/ufouzo/comment/i6vcwci/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">u/johnfintech</a> pointed out that some buyers shelled out anywhere from <a href=\"https://etherscan.io/block/14688922\">2.6 ETH ($6,500) to 5 ETH ($14,000)</a> in gas fees alone — more than the cost of an Otherdeed NFT (and in some cases, more than twice the cost). By the time the virtual land deeds sold out, buyers paid a total of about $123 million just to execute their transactions on the Ethereum blockchain (via <a href=\"https://www.bloomberg.com/news/articles/2022-05-01/bored-ape-metaverse-frenzy-raises-millions-disrupts-ethereum\"><em>Bloomberg</em></a>).</p><p id=\"ItFsEo\">Yuga Labs issued an apology <a href=\"https://twitter.com/yugalabs/status/1520612362986078208?s=20&amp;t=QNoynCDpHbNoG7LMmwBv_A\">on Twitter</a> shortly after the mint ended. “We’re sorry for turning off the lights on Ethereum for a while,” Yuga Labs said. “It seems abundantly clear that ApeCoin will need to migrate to its own chain in order to properly scale. We’d like to encourage the DAO [decentralized autonomous organization] to start thinking in this direction.” The ApeCoin DAO, the entity responsible for making decisions within the ApeCoin community, exists separately from Yuga Labs. The DAO’s decisions are carried out by the <a href=\"https://apecoin.com/about\">Ape Foundation’s Board</a>, consisting of Reddit co-founder Alexis Ohanian, Animoca co-founder Yat Siu, and others.</p><div id=\"T9j8ig\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">We're sorry for turning off the lights on Ethereum for a while. It seems abundantly clear that ApeCoin will need to migrate to its own chain in order to properly scale. We'd like to encourage the DAO to start thinking in this direction.</p>— Yuga Labs (@yugalabs) <a href=\"https://twitter.com/yugalabs/status/1520612362986078208?ref_src=twsrc%5Etfw\">May 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"dzZyLI\">The disruption slowed transactions on Ethereum-linked services, like Uniswap, and caused the Ethereum transaction tracker, Etherscan, to crash. <a href=\"https://twitter.com/topshotkief/status/1520596603115028480\">A number</a> <a href=\"https://twitter.com/talionique/status/1520640411567792128\">of</a> <a href=\"https://twitter.com/ExistentialEnso/status/1520575140563664911?s=20&amp;t=_jfjAn5y6MsgB4CVVmVLzQ\">users</a> also reported losing thousands of dollars to gas fees in failed transactions. Yuga Labs <a href=\"https://twitter.com/yugalabs/status/1520612364839661568?s=20&amp;t=QNoynCDpHbNoG7LMmwBv_A\">promised</a> to reimburse users for the gas fees associated with failed transactions, but it’s unclear what the refund process will look like. <em>The Verge</em> reached out to Yuga Labs with a request for comment but didn’t immediately hear back.</p><p id=\"THMe8T\">As <a href=\"https://mirror.xyz/0x3ae401F245034dAe25af1e2f9b9Bb8F006b1Dc6e/ErZMh-0TTwMrAKPJ1hlDcjvNfZvQ998G-B-oTS6BVQk\">outlined in a post</a> days before the mint, Yuga Lab’s original goal was to avoid an “apocalyptic” gas war, or a sudden spike in gas fees due to high demand. It said it would ditch the popular Dutch auction style of minting, in which an NFT goes up for sale at a certain ceiling price and is then incrementally lowered over time. It employed an alternate method instead, selling NFTs at a flat price and opting to gradually allow more mints to occur over time:</p><blockquote><p id=\"O9CHUg\">Rather than resorting to a faux Dutch Auction, the Otherdeed mint will employ the following mechanic: the sale price will remain flat for the duration, and at the start of the sale, there will be an intentionally low per-wallet limit on the number of NFTs that may be minted (note, this is not “minted at once,” but “minted in total”). Once the initial wave of relatively low-gas transactions have been submitted, and the network starts to calm, the wallet-level minting limit will be increased to allow a second wave of minting - those who are satiated will sit this wave out, while those with more ApeCoin to spend will mint.  </p></blockquote><p id=\"NU7aDH\">The mess of a mint prompted some users to propose ways to improve the process in the future. Will Papper, the co-founder of Syndicate DAO, a platform that lets users create web3 investment clubs, <a href=\"https://twitter.com/WillPapper/status/1520592312379658241?s=20&amp;t=-8FusNQJTkrxv9lyoIARdg\">suggested that</a> Yuga Labs optimize its contracts to lower gas fees and adjust its mint mechanism. </p><div><div id=\"kp3asZ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Of course, gas optimizations are only one part of the equation.<br><br>You need a better mint mechanism design (allowlist, Dutch auction) + gas optimizations.<br><br>Money spent on gas is money that could go to builders. This takes place both via the design of the mint + the smart contract.</p>— Will Papper ✺ (@WillPapper) <a href=\"https://twitter.com/WillPapper/status/1520663444558471168?ref_src=twsrc%5Etfw\">May 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"dihGCs\">In March, <a href=\"https://www.theverge.com/2022/3/22/22991272/yuga-labs-seed-funding-a16z-bored-ape-yacht-club-bayc-metaverse-other-side\">Yuga Labs raised $450 million in funding</a> to build the <em>Otherside</em>, a decentralized metaverse with elements of gamification. While it’s supposed to encompass Yuga Lab’s NFT brands, such as the <a href=\"https://www.theverge.com/2022/3/11/22973394/bored-ape-yacht-club-cryptopunks-meebits-nft\">newly-acquired CryptoPunks and Meebits</a>, the company has goals to extend support to NFTs from other entities. A lot is still unknown about the prospective <em>Otherside</em>, but that clearly hasn’t stopped its enthusiastic community from investing in the project.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rVEmV_irhLRha08S9D3dyv1AKOI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307862/acastro_2203011_5082_0001.jpg",
  "description": "Gas fees soared during the Otherside mint.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}