{
  "title": "Bored Ape Yacht Club members want to build an empire, starting with weed",
  "url": "https://www.theverge.com/2022/2/11/22925408/bored-ape-yacht-club-cannabis-copyright",
  "date": "2022-02-11T14:00:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KnZ9f0sd8ZjqccgOG0Zleu91s3g=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70497195/acastro_220209_5013_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro</figcaption>    </figure>  <p>What do you do with the IP rights to your very expensive cartoon primate? Put him on cannabis packaging</p> <p class=\"p--has-dropcap p-large-text\" id=\"xe8KzH\">When Richard Lee first brought his business proposal to Backpack Boyz, he could sense skepticism from the California-based cannabis company. </p><p class=\"p-large-text\" id=\"hVlx7p\">“‘You’re gonna put an ape on this bag, and you’re gonna make a new flavor, but like, who’s gonna buy this?’ is kind of what they were thinking,” Lee says. </p><p id=\"7j09An\">The ape in question is the Bored Ape Yacht Club #768 NFT, a wide-eyed primate with white fur, a blue hat, and a silver hoop earring. Lee had purchased his ape, which he’s named Crypto Painter, in May 2021 for 1.15 ETH (about $3,000 USD today). Now he wanted to license Crypto Painter out, and Backpack Boyz was his first stop. </p><div class=\"c-float-right c-float-hang\"><aside id=\"U7gX6e\"><q>Lending out his ape was the first test in his grand vision he’s held since the beginning: to make Crypto Painter a star</q></aside></div><p id=\"VZHtr5\">The finished product was an ice blue, <em>Matrix</em>-style cannabis flower package with Lee’s ape emblazoned over the name of the new strain: Crypto Gelato. At that point, Backpack Boyz had been watching the NFT space only from a distance — they mostly agreed to do it, Lee thinks, as a favor for the mutual friend who made the introduction. </p><p id=\"AJ7GYj\">But then they started selling out.</p><p id=\"zPy76J\">First, the product was a bestseller at the grand opening of the San Diego Backpack Boyz store in December. And when Crypto Gelato was sold at the Rolling Loud music festival a few days later, a younger, more crypto-knowledgeable crowd cleared the shelves. Since then, the strain has been a consistent hit at all three Backpack Boyz shops in California, and at times, supply hasn’t been able to keep up with demand. </p><p id=\"8G1lvF\">“It kind of blew up,” says Lee, a former Hollywood visual effects artist who goes by <a href=\"https://twitter.com/painter_crypto\">@cryptopainter</a> online. At one point, he had to post a PSA on Instagram asking people to please not acquire Crypto Gelato illegally. Lending out his ape was the first test in the grand vision he’s held since the beginning: to make Crypto Painter a star. </p><p id=\"V6XKLU\">Lee seems to be at least one step closer to his goal — since the Backpack Boyz deal, he’s secured another cannabis-related licensing agreement with a large weed company, to be announced soon. Another two non-cannabis deals are also underway, Lee says. Oh, and he wants to license his ape to a local political candidate.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/awClqc3Rp73VMgemCcllRHxgGqI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23230459/Image_from_iOS.jpg\">      <cite>Image: Richard Lee</cite>  </figure></div><p id=\"aYnQlE\">“It’s kind of like, hey, this does work, and it works really well,” Lee says of licensing his BAYC character. “So let’s go bigger now.”</p><p id=\"qiBnJ9\">Owning a Bored Ape Yacht Club NFT naturally comes with perks. There’s the flex of having something inaccessible to most, a ready-made network of thousands of other ape owners to connect with, invites to exclusive (<a href=\"https://www.theverge.com/22824387/bored-ape-yacht-club-nft-party-new-york\">or not-so-exclusive</a>) parties, and, if you play your cards right, the ability to resell your ape for a sum of money that would change the lives of most of us. But for many in the club, having an ape represents a different kind of promise, separate from the Blockchain and nonfungibility and betting on JPEGs: you can slap your ape on all sorts of stuff and sell it.</p><p id=\"3XRtD4\">NFT purchases come with specific usage rights to the art depicted — the original artist typically retains ownership of the copyright, but buyers can set the NFT as their profile picture, for example. But Bored Apes are different: when you buy an ape, you also get the rights to it. You can put your ape with pink fur and a military-inspired hat on a <a href=\"https://www.diamondsupplyco.com/products/diamond-supply-co-diamond-ape-deck-black?_pos=2&amp;_sid=61e5b7add&amp;_ss=r\">skate deck</a>, as streetwear brand owner Nicky Diamonds did. Or lend your closed-eyes, pierced-ear ape to a <a href=\"https://www.youtube.com/watch?v=1c2xBMH14NU&amp;t=111s\">music video</a>. </p><p id=\"U24WZs\">The Yacht Club members pursuing cannabis deals describe an array of perspectives within the larger BAYC ecosystem. Some people just want to collect their apes, meet other enthusiasts, and watch the space grow. But there are others — often self-described as “entrepreneurs” or “business-minded people” — who see the apes as a launching pad for something bigger than even the Yacht Club.</p><p id=\"tobeg2\">Lee is a part of a subgroup of BAYC members entering the brave new world of Bored Ape weed marketing and branding. Crypto Gelato in California is just one example. There’s also ape #6355 — a cream-colored character with bloodshot eyes who sports a cowboy hat — that appears on a strain called <a href=\"https://twitter.com/heavysugar/status/1462213844575551489/photo/1\">Crepe Ape</a> in Washington. The owner of that ape, who goes by <a href=\"https://twitter.com/heavysugar\">@heavysugar</a> on Twitter, says he let his friends’ weed company use his ape for free, and that another, potentially bigger deal is in the works. Two other Bored Ape owners told<em> The Verge</em> that they’re in talks to launch their own products or that they expect their ape weed to be available in the coming months. </p><div class=\"c-float-right c-float-hang\"><div id=\"2WHJUJ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It’s been really hard keeping up with demand in Cali. The younger crowd really loves it. Thanks for the love    <a href=\"https://t.co/BgskTjW9Lf\">https://t.co/BgskTjW9Lf</a> <a href=\"https://t.co/IOZ4KML7gV\">pic.twitter.com/IOZ4KML7gV</a></p>— cryptopainter (@painter_crypto) <a href=\"https://twitter.com/painter_crypto/status/1483958152143900674?ref_src=twsrc%5Etfw\">January 20, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"MRNwXL\">“There are a lot of entrepreneurial smokers in the group, so naturally, we just ran with it,” Lee says. </p><p id=\"5Pbdul\">Rob, a Yacht Club member who works in the cannabis industry and goes by <a href=\"https://twitter.com/SmileFckrs\">@SmileFckrs</a>, says licensing was part of the appeal from the beginning. He purchased his ape for 15 ETH, or around $45,000, in August 2021 and thought of it as an investment in branding and marketing opportunities. </p><p id=\"5Lpp4r\">BAYC #1836 — with his short mohawk, silver stud earring, and white tank top — has come to represent positivity, Rob says, and he wants any partnerships to fit with the ape’s image. He says he’s currently in talks with companies in the cannabis industry that have shown “active interest” in using his ape’s likeness.</p><p id=\"R0EeXE\">“You see Mickey Mouse or Alvin and the Chipmunks — these characters that have come along and been able to stand the test of time. I really think that could be where my ape goes,” Rob says. “That’s why I’ve been very cautious on actually licensing it out and actually using it.”</p><p id=\"8MQR8h\">The comparison to Disney has been <a href=\"https://www.theverge.com/22785051/nft-collectibles-intellectual-property-decentralized-disney\">made before</a> but hasn’t proven itself out yet. Aside from a few apes backed by celebrities, most ventures haven’t broken into the mainstream consciousness  — ask your mom to name a bored ape off the top of her head, quickly. But the possibility of your ape being a household name one day buoys the hustle.</p><p id=\"JLny2i\">“Once I found out that we’re able to license it, I naturally thought right away, ‘I’m going to try to build the next Disney,’” Lee says. “Not just an item or product, but more like a culture and a lifestyle.”</p><p id=\"16cK8f\">Lee’s energy and faith in his ape and other NFT projects have perhaps converted a few. He says he’s introduced other BAYC members to companies looking for apes to partner with to show them that they, too, can make their apes work for their bottom line without selling. And after the success of Crypto Gelato, Backpack Boyz are moving deeper into crypto and NFTs, says Harry Yim, digital product manager. The company had wanted to get into the space, and a collaboration with Lee felt natural. </p><div class=\"c-float-left c-float-hang\"><aside id=\"9JxNNy\"><q>“In the grand scheme of things, definitely, it’s more valuable as an IP asset than as an NFT.”</q></aside></div><p id=\"doiOBo\">“When you have a tangible product and a following, then I think if you’re smart about it, the NFTs and the metaverse can really accentuate and expand that business,” Yim says. He says Backpack Boyz is also exploring how it can make NFTs part of its business through special deals, new strains or other perks for owners.</p><p id=\"TF3uan\">Not everyone initially set out to build a brand around their ape. Joey, who goes by <a href=\"https://twitter.com/jdotcolombo\">@jdotcolombo</a> on Twitter, got in on BAYC early — he minted and purchased seven apes over the course of an evening without fully understanding how valuable they would become.</p><p id=\"h353FN\">“I had no understanding of the IP,” he says. It wasn’t until he started engaging with other ape owners — and saw a statement about licensing from the BAYC founders — that he started to see the potential.</p><p id=\"mAFY1Q\">Joey’s company <a href=\"https://moneytreescannabis.com/\">Money Trees Cannabis</a> will soon have bored ape products of its own: his ape with a yellow fisherman’s hat and diamond grills will appear on packages in California and Michigan in the next few months. He’s taking his packaging a step further, incorporating augmented reality artwork featuring his apes. “The ape will take a hit and then smile,” he says.</p><div class=\"c-float-right c-float-hang\"><div id=\"zPqicj\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Definitely something. <a href=\"https://twitter.com/hashtag/crepeape?src=hash&amp;ref_src=twsrc%5Etfw\">#crepeape</a> <a href=\"https://twitter.com/hashtag/BAYC?src=hash&amp;ref_src=twsrc%5Etfw\">#BAYC</a> <a href=\"https://twitter.com/hashtag/BoredApeYachtClub?src=hash&amp;ref_src=twsrc%5Etfw\">#BoredApeYachtClub</a> <a href=\"https://twitter.com/hashtag/BoredApeYC?src=hash&amp;ref_src=twsrc%5Etfw\">#BoredApeYC</a> <a href=\"https://twitter.com/hashtag/firebros206?src=hash&amp;ref_src=twsrc%5Etfw\">#firebros206</a> <a href=\"https://t.co/agtc06onYq\">pic.twitter.com/agtc06onYq</a></p>— Ray   (@heavysugar) <a href=\"https://twitter.com/heavysugar/status/1462213844575551489?ref_src=twsrc%5Etfw\">November 21, 2021</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"ICzh81\">For now, Joey is only using his apes in-house, but he has plans to approach other companies as well — perhaps an energy drink featuring his pink ape in a biker jacket? He’s already resold a few of his original seven apes, including, regrettably, an ape with a BAYC-branded hat that could have appeared on derivative works. Joey says, in his mind, the potential uses of the intellectual property outweigh the value of the token itself.</p><p id=\"sNIGFD\">“In the grand scheme of things, definitely, it’s more valuable as an IP asset than as an NFT,” Joey says.</p><p id=\"Dp4EZn\">For Lee, the initial investment has already paid off. He agreed to lend the likeness of his ape for a cut of each Backpack Boyz unit sold and said they’re planning on rolling out additional products featuring his ape. Lee declined to share specifics of the deal but said in the few months Crypto Gelato has been on California shelves, he’s “definitely” made back the cost of his multiple apes and then some. </p><p id=\"TaEc0N\">But if this seems like a space that includes people with no experience playing ball with corporate lawyers — and potentially entering agreements that bite them — it is. Some BAYC members have experience dealing with IP, running a business, and looking over contracts. Others — not so much. </p><p id=\"IdhAe7\">Rob has seen some members of the Yacht Club who were offered deals that he feels were a bad shake for the ape owner. In one case, a contract precluded the Yacht Club member from profiting until the second year of the deal.</p><p id=\"wUGjCP\">“Unfortunately, because there are a lot of folks that don’t understand this stuff, [companies will] throw stuff out there, and people are going to get excited because there is money attached to it,” he says. Not every project takes off, either, instead staying in the insular NFT communities and on Discord servers. </p><div class=\"c-float-left c-float-hang\"><aside id=\"MjLE1W\"><q>Could all 10,000 cartoon primates build up a recognizable brand? There are only so many weed companies out there and only one Disney</q></aside></div><p id=\"QOqvu7\">But that’s no matter for the apes. Underlying the unbridled enthusiasm in the community is this idea of WAGMI — a rallying call used in crypto and NFT circles that’s short for “we’re all gonna make it.” I asked the Yacht Club members if they’re worried the space would get crowded down the line. Could all 10,000 cartoon primates build up a recognizable brand? There are only so many weed companies out there and only one Disney. And some apes are owned by the most famous people in the world, who don’t have to do anything with them to enrich themselves: after news dropped that Justin Bieber had acquired a Bored Ape, his own NFT collection <a href=\"https://twitter.com/corentin/status/1487749681870520320\">jumped in value</a>.</p><p id=\"N04roU\">Yacht Club members believe there’s room for anyone who understands the potential value of what they own and who’s willing to go out and make things happen. There are deals being signed left and right, they say, as more people wise up. The celebrity collectors come and go. But the business-minded people know that they have something special.</p><p class=\"c-end-para\" id=\"qxjtDu\">“We were here before them; we built this,” Lee, owner of the Crypto Painter ape, says. “We’ll be here after they leave.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CkIMW07eBriqTRnS5zU9CWspki0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229930/acastro_220209_5013_0001.jpg",
  "description": "Bored Ape Yacht Club apes are appearing on weed now.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}