{
  "title": "Bored Ape Yacht Club’s newest merch drop can only be bought with ApeCoin",
  "url": "https://www.theverge.com/2022/3/28/23000264/apecoin-bored-ape-yacht-club-bayc-merch-dao",
  "date": "2022-03-28T19:58:58.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"A blue coin with the Bored Ape Yacht Club logo in the middle.\" src=\"https://cdn.vox-cdn.com/thumbor/eAZHAhHrSOkmI4Gnt5YD5Q_I5FQ=/432x0:2448x1344/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70682237/Screen_Shot_2022_03_16_at_6.32.10_PM.0.png\" />        <figcaption>Image: ApeCoin DAO</figcaption>    </figure>  <p id=\"cXRYer\">Bored Ape Yacht Club NFT holders can <a href=\"https://store.boredapeyachtclub.com/\">buy new merchandise items</a> from Yuga Labs — but they can only use the newly-launched ApeCoin to do it, according to an announcement in the BAYC Discord server. Yuga Labs, which has a large stake in the organization backing ApeCoin, will get more ApeCoin (and more control over the organization) as NFT holders pay for their merch.</p><p id=\"oCi1I3\">That is, assuming they can. Continuing cryptocurrency’s trend of “money but worse,” users complained they were having trouble checking out.</p><div id=\"t0NzHq\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hey everyone, we’re aware of the Coinbase Commerce issues during merch store checkout. They are working on a resolution now. If you encountered payment problems we’ll be following up with next steps soon.</p>— Bored Ape Yacht Club (@BoredApeYC) <a href=\"https://twitter.com/BoredApeYC/status/1508511428243869702?ref_src=twsrc%5Etfw\">March 28, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"q5Xd50\">“Total shitshow,” one user said.</p><p id=\"Kp0QCF\">“Not fudding and I am a happy owner, but this is a very small online event relative to building a metaverse,” another said, <a href=\"https://www.theverge.com/2022/3/22/22991272/yuga-labs-seed-funding-a16z-bored-ape-yacht-club-bayc-metaverse-other-side\">referencing the planned development of <em>Otherside</em></a><em>, </em>a game meant to connect NFTs. “Would like to see much more thorough testing and smooth customer experiences before larger drops take place. Just my .02.”</p><p id=\"ZOKAfw\">The merch drop highlights something strange about ApeCoin, which, so far, has been used as an in-game currency for <a href=\"https://www.theverge.com/2022/3/16/22981916/apecoin-dao-launched-bayc-bored-ape-yuga-labs\"><em>Benji Bananas</em>, a game from Animoca Brands</a>. ApeCoin is also a way to vote in the ApeCoin DAO — DAO is short for “decentralized autonomous organization,” though, in this case, the <a href=\"https://www.theverge.com/2022/3/25/22994795/apecoin-yuga-labs-sec-regulation-utility-token\">decentralized and autonomous parts</a> both seem pretty, uh, <em>arguable.</em></p><p id=\"Si6yLT\">Members who pay in ApeCoin are essentially giving their ApeCoin DAO vote back to Yuga Labs, further consolidating Yuga Labs’ control over the DAO. <a href=\"https://apecoin.com/about\">The company has been granted 150 million tokens</a>, but they are locked up for a year. Yuga Labs’ founders get 80 million tokens, which are also locked for a year. Additionally, Yuga Labs owns seven Bored Apes and 10 Mutant Apes. The merch launch — and transfer of tokens to Yuga Labs — comes as there are two days left to vote on the <a href=\"https://snapshot.org/#/apecoin.eth\">initial DAO proposals.</a></p><p id=\"gEXA7Z\">In order to access the BAYC merch store, users must own a BAYC or Mutant Ape Yacht Club NFT. Based on screenshots in the Discord — I don’t have a BAYC NFT, so I can’t see the store directly — the items appear to be priced in dollars. They include hoodies, soccer jerseys, hats, sweatpants, and throw blankets. Token holders who pay Yuga Labs in ApeCoin essentially handing over their DAO votes to Yuga Labs.</p><p id=\"1nwxSs\">Yuga Labs initially announced the merchandise on Friday at 1:57PM PT. After Yuga Labs made its announcement, ApeCoin rose from $13.83 at 2PM PT on March 26th to $15.13 at 12:33PM PT today, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.coinbase.com%2Fprice%2Fapecoin&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F28%2F23000264%2Fapecoin-bored-ape-yacht-club-bayc-merch-dao\" rel=\"sponsored nofollow noopener\" target=\"_blank\">according to Coinbase</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NUyIZCDWb-iqQeJ-v2e2JhmNCdA=/157x0:2724x1344/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23322207/Screen_Shot_2022_03_16_at_6.32.10_PM.png",
  "description": "Monkey business",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}