{
  "title": "Brave is bypassing Google AMP pages because they’re ‘harmful to users’",
  "url": "https://www.theverge.com/2022/4/19/23032776/brave-de-amp-google-browser",
  "date": "2022-04-19T22:33:03.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xOd7OVENfrG2hUPKd-dp3f8tRwY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70768957/acastro_200211_3900_Brave_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"JxOzcR\">Brave announced a new feature for its browser on Tuesday: De-AMP, which automatically jumps past any page rendered with <a href=\"https://developers.google.com/amp\">Google’s Accelerated Mobile Pages framework</a> and instead takes users straight to the original website. “Where possible, De-AMP will rewrite links and URLs to prevent users from visiting AMP pages altogether,” Brave <a href=\"https://brave.com/privacy-updates/18-de-amp/\">said in a blog post</a>. “And in cases where that is not possible, Brave will watch as pages are being fetched and redirect users away from AMP pages before the page is even rendered, preventing AMP / Google code from being loaded and executed.”</p><p id=\"vsLj8B\">Brave framed De-AMP as a privacy feature and didn’t mince words about its stance toward Google’s version of the web. “In practice, AMP is harmful to users and to the Web at large,” Brave’s blog post said, before explaining that AMP gives Google even more knowledge of users’ browsing habits, confuses users, and can often be slower than normal web pages. And it warned that the next version of AMP — so far just called AMP 2.0 — will be even worse.</p><div class=\"c-float-right\"><aside id=\"qrrGAe\"><q>“In practice, AMP is harmful to users and to the Web at large”</q></aside></div><p id=\"kpFpIb\">Brave’s stance is a particularly strong one, but the tide has turned hard against AMP over the last couple of years. Google originally <a href=\"https://www.theverge.com/2018/3/8/17095078/google-amp-accelerated-mobile-page-announcement-standard-web-packaging-urls\">created the framework</a> in order to simplify and speed up mobile websites, and AMP is now managed by a group of open-source contributors. It was <a href=\"https://www.theverge.com/2018/3/8/17095078/google-amp-accelerated-mobile-page-announcement-standard-web-packaging-urls\">controversial from the very beginning</a> and smelled to some like Google trying to exert even more control over the web. Over time, more companies and users grew concerned about that control and chafed at the idea that Google would prioritize AMP pages in search results. Plus, the rest of the internet eventually figured out how to make good mobile sites, which made AMP — and similar projects like Facebook Instant Articles — less important. </p><p id=\"S5taSF\">A number of <a href=\"https://apps.apple.com/us/app/amplosion-redirect-amp-links/id1585734696\">popular apps</a> and <a href=\"https://chrome.google.com/webstore/detail/redirect-amp-to-html/kifkmmpiicbcnkjaliilaoeaojlldonl\">browser extensions</a> make it easy for users to skip over AMP pages, and in recent years, publishers (including <em>The Verge’s</em> parent company Vox Media) have moved away from using it altogether. AMP has even become part of the antitrust fight against Google: <a href=\"https://www.wsj.com/articles/publishers-move-to-abandon-google-supported-mobile-web-initiative-11645725640\">a lawsuit alleged</a> that AMP helped centralize Google’s power as an ad exchange and that Google made non-AMP ads load slower. </p><p id=\"JQM55Q\">Still, nobody has gone after AMP quite as hard as Brave. De-AMP is somewhat reminiscent of <a href=\"https://www.theverge.com/2018/3/27/17167094/mozilla-firefox-facebook-container-tracker-blocker\">Mozilla’s Facebook Container extension</a>, which it created in 2018 as a way for Firefox users to prevent Facebook from tracking them across the web. It’s a statement of values in the form of a new feature. Google has been a target for Brave for years, too; Brave has published blog posts complaining about Google’s privacy features and even went so far as to <a href=\"https://www.theverge.com/2021/10/20/22736142/brave-browser-search-engine-default-google-quant-duckduckgo-web-discovery-project\">build its own search engine</a>. Brave has long billed itself as <a href=\"https://www.theverge.com/2020/2/14/21128019/brave-privacy-tools-private-network-browser-settings-security\">a privacy-first browser</a>, so Google is a logical villain to choose.</p><p id=\"xuJ1fQ\">Of course, for all Brave’s bravado and development, it holds only a tiny portion of the browser market, and Chrome continues to dominate. So no matter how much of the internet turns against it, AMP won’t die until Google kills it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ghDpdHZ47TdACnDTbAx05D-ug8g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19713458/acastro_200211_3900_Brave_0001.0.jpg",
  "description": "Google’s mobile pages are dying off.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}