{
  "title": "Brazilian court orders Apple and Google to block Telegram over disinformation",
  "url": "https://www.theverge.com/2022/3/18/22985595/brazil-supreme-court-telegram-apple-google-block-order",
  "date": "2022-03-18T21:57:02.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ngqk8lLLy7lDrHmLelukcAt1n2U=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70643690/acastro_180417_1777_telegram_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"NzTVzV\">Brazilian Supreme Court Justice Alexandre de Moraes has ordered Apple and Google to help block access to the Telegram messaging app within the country, <a href=\"https://www.reuters.com/world/americas/brazil-supreme-court-orders-suspension-telegram-app-country-reports-2022-03-18/\">according to <em>Reuters</em></a>. The sealed order, handed down today, demands Brazil’s telecommunications agency Anatel officially suspend Telegram until it complies with local orders and pays a series of fines. The news follows accusations that Telegram has <a href=\"https://www.nytimes.com/2021/11/08/world/americas/brazil-telegram-disinformation.html\">failed to prevent users from spreading disinformation</a> as it’s become a communications hub for President Jair Bolsonaro.</p><p id=\"s8Emi1\">Brazilian authorities <a href=\"https://www.reuters.com/technology/brazil-electoral-court-could-ban-telegram-app-not-fighting-fake-news-2022-01-20/\">threatened to suspend Telegram</a> earlier this year, saying it hadn’t responded to requests to fight false election information. Telegram responded in February <a href=\"https://www.zdnet.com/article/telegram-bans-disinformation-channels-to-avoid-suspension-in-brazil/\">by removing three channels</a> from US-based Brazilian blogger Allan dos Santos, a supporter of Bolosnaro, for allegedly spreading disinformation and inciting violence. However, <a href=\"https://abcnews.go.com/International/wireStory/brazil-judge-bans-messaging-app-telegram-ignoring-ruling-83534840\">according to an <em>Associated Press</em> description</a> of today’s order, Moraes said the company had been uncooperative with authorities. The order apparently gives Apple, Google, and local phone carriers five days to block Telegram, while Anatel has 24 hours to implement an official suspension.</p><p id=\"1EMtjV\">Google spokesperson Frederico Cursino confirmed to <em>The Verge</em> via email that the company had “received a Supreme Court order regarding the messaging app Telegram in Brazil,” but “as the case is sealed, we will not be commenting.” Apple and Telegram did not immediately respond to requests for comment.</p><p id=\"YeYiC5\">Telegram is caught in a crossfire between the Supreme Court and Bolsonaro, whom the court is investigating for <a href=\"https://www.reuters.com/world/americas/brazils-top-court-subpoenas-bolsonaro-leaked-documents-case-2022-01-27/\">allegedly leaking police documents</a> and making <a href=\"https://www.bbc.com/news/world-latin-america-59528857\">comments falsely linking</a> AIDS to the COVID-19 vaccine. (Bolsonaro, in turn, <a href=\"https://www.reuters.com/world/americas/brazils-bolsonaro-asks-senate-impeach-supreme-court-justice-2021-08-20/\">has called for</a> Moraes’ impeachment.) But the app has <a href=\"https://www.wired.com/story/germany-telegram-covid/\">been criticized elsewhere</a> for offering a haven where far-right political figures can post false information and hate speech to avoid deplatforming from services like Facebook and Twitter, part of Telegram’s stated commitment to refusing government censorship demands. It’s been banned in Russia for refusing to share encryption keys in anti-terrorism investigations, although <a href=\"https://www.theverge.com/2020/6/18/21295535/russia-telegram-ban-lifted-security\">that prohibition was lifted in 2020</a>. Meanwhile, Brazil’s legal system has previously ordered blocks of Telegram competitor WhatsApp — but <a href=\"https://www.theguardian.com/world/2016/jul/19/whatsapp-ban-brazil-facebook\">the bans have proven to be short-lived</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ma3VFJyH8a5RbMNAidMYF8bCF6w=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10668737/acastro_180417_1777_telegram_0004.jpg",
  "description": "Telegram has repeatedly run afoul of national governments.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}