{
  "title": "Brooklyn Public Library is offering free digital library cards to young adults in the US",
  "url": "https://www.theverge.com/2022/4/25/23041346/brooklyn-library-free-digital-cards-ebook-collection-banned-books",
  "date": "2022-04-25T19:56:31.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"New York\" src=\"https://cdn.vox-cdn.com/thumbor/h5GVBUTFraoitok-9GBf0vDy3TY=/9x0:5112x3402/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70791915/849886652.0.jpg\" />        <figcaption><em>The Brooklyn Public Library just announced its “Books Unbanned” initiative.</em> | Photo by Sergi Reboredo / VW PICS/Universal Images Group via Getty Images</figcaption>    </figure>  <p id=\"wxlxL0\">The Brooklyn Public Library (BPL) is counteracting a ban on certain books by letting anyone in the US aged 13 to 21 apply for a digital library card. This gives teens and young adults, regardless of their location in the United States, access to the library’s entire ebook collection.</p><p id=\"W2Q4iQ\">The initiative, called Books Unbanned, is fighting what the BPL describes as an “increasingly coordinated and effective effort to remove books tackling a wide range of topics from library shelves.” <a href=\"https://www.ala.org/news/press-releases/2022/04/national-library-week-kicks-state-america-s-libraries-report-annual-top-10\">According to the American Library Association</a> (ALA), a total of 729 books were <a href=\"https://www.ala.org/advocacy/bbooks/aboutbannedbooks\">challenged</a> in 2021, meaning a person or group attempted to ban these titles from public libraries.</p><div id=\"jUINJd\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BPL is combating the negative impact of increased censorship and book bans in libraries across the country with <a href=\"https://twitter.com/hashtag/BooksUnbanned?src=hash&amp;ref_src=twsrc%5Etfw\">#BooksUnbanned</a>. With libraries facing an increasingly coordinated and effective effort to remove books from library shelves. Learn more at <a href=\"https://t.co/4sPbslW817\">https://t.co/4sPbslW817</a> <a href=\"https://t.co/OqhNH45JJU\">pic.twitter.com/OqhNH45JJU</a></p>— BKLYN Library (@BKLYNlibrary) <a href=\"https://twitter.com/BKLYNlibrary/status/1517587802766065666?ref_src=twsrc%5Etfw\">April 22, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"6vu3z7\">This led to 1,597 challenges or removals of individual books, most of which were written by or about Black or LGBTQIA+ people and targeted a teenage audience. In Llano, Texas, books including Maurice Sendak’s <em>In the Night Kitchen</em> were removed from shelves, and the head of the town’s governing body, Ron Cunningham, questioned whether the town should even have libraries, according to emails obtained through <a href=\"https://www.washingtonpost.com/nation/2022/04/17/public-libraries-books-censorship/\">public record requests by <em>The Washington Post</em></a>. Further north in Granbury, Texas, the Granbury Independent School District pulled over 100 books, <a href=\"https://www.texastribune.org/2022/02/28/granbury-isd-aclu-book-removal/\">only to then return them to the library system</a> after criticism from students and the ACLU.</p><p id=\"wFILoD\">In addition to the library cards offered to any people in the US between the ages of 13 and 21, the Brooklyn Public Library has also made a <a href=\"https://www.bklynlibrary.org/search?booklist=569834\">selection of ebooks and audiobooks</a> that are frequently banned or challenged at other locations “always available” to library cardholders. You can see a full list of frequently challenged books (and why they were challenged) on the <a href=\"https://www.ala.org/advocacy/bbooks/frequentlychallengedbooks/top10\">ALA’s website</a>.</p><p id=\"yDccIX\">If you’re interested in getting a BPL digital library card, you can apply by emailing BooksUnbanned@bklynlibrary.org. You can also find more information about banned books on <a href=\"https://www.bklynlibrary.org/books-unbanned\">BPL’s website</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-jdoNaeYmCJmFIGNE4ushEtA3-g=/0x361:5120x3042/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23415349/849886652.jpg",
  "description": "The BPL is fighting back against book removals.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}