{
  "title": "Buffalo shooting suspect reportedly shared plans on Discord",
  "url": "https://www.theverge.com/2022/5/16/23078297/buffalo-shooting-suspect-discord-planning-logs",
  "date": "2022-05-17T00:11:35.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8DRzuFC-UX85uMpRIJ56EJj5QKA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70876743/acastro_210129_1777_discord_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"4y5v3u\">The alleged gunman behind the attack in Buffalo, New York that left 10 dead and three injured on Saturday used Discord to discuss and share plans ahead of the assault, <a href=\"https://www.bloomberg.com/news/articles/2022-05-16/buffalo-shooter-laid-out-attack-plans-on-discord-app-for-months\">according to <em>Bloomberg</em></a>.</p><p id=\"dnFCRS\">As far back as December, the suspect is reported to have used a private server on the popular chat service to describe his intentions to carry out an attack. He later shared links to Discord logs describing his attack plan and white supremacist views, according to <em>Bloomberg</em>. The report says that the suspect mentioned the terrorist who attacked a mosque in Christchurch, New Zealand more than 30 times and used racist slurs and extremist phrases while in the app.</p><div class=\"c-float-right\"><aside id=\"tB2ylj\"><q>Discord wanted to ensure “another event like Charlottesville isn’t planned on our platform”</q></aside></div><p id=\"ayBSHk\">“As soon as we became aware of it we took action against it and removed the server in accordance with our policies against violent extremism,” a Discord spokesperson told <em>Bloomberg</em>. The company did not immediately respond to <em>The Verge</em>’s request for more information on its moderation policies.</p><p id=\"29pqpK\">Discord’s moderation team “splits its time” between responding to user-reported messages and “proactively finding and removing servers and users” engaged in “high-harm activity,” <a href=\"https://discord.com/blog/how-trust-safety-addresses-violent-extremism-on-discord\">the company wrote</a> in 2021. That approach to moderation was created after Discord learned  that white supremacists had <a href=\"https://www.theverge.com/2018/8/7/17660308/white-supremacists-charlottesville-rally-discord-plan\">used its app</a> to organize the violent Unite the Right rally in Charlottesville, Virginia in 2017.</p><p id=\"hGfx2h\">“Trust &amp; Safety has spent a lot of time since 2017 trying to ensure that another event like Charlottesville isn’t planned on our platform,” the company wrote last year.</p><p id=\"4pUxve\">As recently as 2019, Discord was primarily relying on user reports to moderate its platform and not actively monitoring private or public servers, according to <a href=\"https://www.pcgamer.com/how-private-is-your-private-discord-server/\">a <em>PC Gamer </em>story</a><em> </em>from that year. The company’s moderation team does have the ability to read messages from private servers, the story said, but Discord typically only did so when a message was reported by a user.</p><p id=\"7KQTIu\">Saturday’s attack is being investigated as a hate crime, Buffalo police have said. <a href=\"https://www.cnn.com/2022/05/15/us/buffalo-supermarket-shooting-sunday/index.html\"><em>CNN </em>reports</a> that the suspect, identified as Payton S. Gendron, told authorities he was targeting a Black community; 11 of the people shot were Black.</p><p id=\"Y3D8tK\">The suspect is also alleged to have used Discord to plan to livestream the attack. Video of the assault was broadcast live on Twitch, which claims to have stopped the stream “less than two minutes after the violence began.” Even so, footage has continued to spread online as major platforms struggle to crack down on new uploads of the horrific footage.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mIWhNALm2KaQ60iPjphTzOTz7SU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22268966/acastro_210129_1777_discord_0001.jpg",
  "description": "Discord wanted to ensure \"another event like Charlottesville isn’t planned on our platform\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}