{
  "title": "Bungie wants to make your Destiny 2 weapons matter more in The Witch Queen",
  "url": "https://www.theverge.com/2022/2/3/22916193/destiny-2-the-witch-queen-weapons-sandbox-changes",
  "date": "2022-02-03T18:56:27.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wwTSKb8zlh7Eq-yPde2oaGSmhyY=/80x0:944x576/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70467710/image2.0.jpg\" />    </figure>  <p id=\"tmnUFI\">Bungie is getting ready to launch what could be one of the biggest expansions to <em>Destiny 2</em> we’ve ever seen later this month, <em>The Witch Queen</em>. While the expansion will follow the story of Savathûn, it also introduces new exotic weapons, weapon crafting, and big changes to the <em>Destiny 2</em> sandbox.</p><p id=\"5U0KGw\"><a href=\"https://www.bungie.net/en/Explore/Detail/News/50995\">Bungie is previewing</a> some of those weapon changes today, alongside detailing exactly how <em>Destiny 2</em> players will be able to craft their own weapons in <em>The Witch Queen</em>. Players of the new expansion will be given the opportunity to forge a new Glaive weapon type early on, including all the necessary materials to craft this initial weapon.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jMdzjLDic49v3g6n3_U221YB8M8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215895/d2crafting.jpg\">      <cite>Image: Bungie</cite>      <figcaption><em>Get ready to craft weapons in Destiny 2.</em></figcaption>  </figure><p id=\"XYjvu2\">Weapon crafting in <em>Destiny 2</em> will allow players to pick the barrels, frames, and weapon traits on a subset of weapons and archetypes without all of the RNG needed for a perfect weapon drop. A selection of new weapons will be available at first, and Bungie says more will be added in the future. Crafting will involve finding patterns (essentially weapon blueprints), collecting materials needed for crafting and then leveling your new weapon up by using it to defeat enemies.</p><p id=\"SQayfh\">The faster you level a gun up, the more enhanced traits you’ll be able to unlock. This includes enhanced stats, traits, and bonuses to weapon capabilities. It seems a lot more similar to how you used to level weapons in the original <em>Destiny</em> game, with a focus on combat for unlocking perks. Bungie is also introducing a mementos system that will include activity-specific trackers and cosmetic flair for weapons.</p><p id=\"5Kslhv\">While we don’t have the full list of guns that will support this new crafting system, you will be able to craft the upcoming Osteo Striga exotic submachine gun and the three class-specific exotic Glaives. Existing guns you currently own won’t be supported in this weapon crafting system, so this feels like a steady push by Bungie to get <em>Destiny 2</em> players to gradually sunset their own weapons in favor of crafted ones throughout 2022. That’s a lot better than making existing weapons useless.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/iErP5hnDstIHDCw4sbvzumT9w5Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23209796/wCBo56o.jpeg\">      <cite>Image: Bungie</cite>      <figcaption><em>You’ll be able to select the weapon perks you want.<span class=\"ql-cursor\">﻿</span></em></figcaption>  </figure><p id=\"ipj9Jn\">The <em>Destiny 2</em> sandbox is also getting some major shakeups for <em>The Witch Queen</em>. Bungie has experimented with pursuit and pinnacle weapons from activities in the past, with unique traits that were often overpowered. In<em> The Witch Queen,</em> it’s moving towards origin traits instead, which will appear as an additional third perk on new weapon drops. You’ll get unique ones depending on where the gun originated from. In Trials of Osiris, the endgame player-vs-player activity, the Alacrity perk will boost reload, stability, aim assist, and even range if all your teammates are dead and you’re trying to save the round alone. It’s a lot like the Celerity, but with a range and aim assist buff now.</p><p id=\"1TNYIs\">Similarly, Nightfall strike weapons will drop with Stunning Recovery, a perk that partially refills your magazine and triggers health regeneration and improves recovery. That could make finishing a champion a little easier or assist with survivability just when you’re diving behind cover. The overall world loot pool is also being replaced with 12 new weapons in the style of the year one foundry weapon sets. Each of these foundries includes unique origin traits, too.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/i9DkRcL5Td5uIWZUVhgreIkIZzQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23216030/Shape_Screen_UI_Details_En.jpg\">      <cite>Image: Bungie</cite>      <figcaption><em>Weapon crafting includes custom frames.</em></figcaption>  </figure><p id=\"BYEOwT\">In total, Bungie is promising a staggering 42 new legendary weapons and all returning Trials, Iron Banner, and Nightfall weapons. There are 14 origin traits shipping with <em>The Witch Queen</em>, with more to come throughout the seasons in 2022. Compared to the mediocre loot in <em>Beyond Light</em>, there’s a lot to play for in <em>The Witch Queen</em>.</p><p id=\"OxZUGv\">It wouldn’t be a <em>Destiny</em> sandbox update without some nerfs, buffs, and changes, though. I would highly recommend <a href=\"https://www.bungie.net/en/Explore/Detail/News/50995\">reading all of Bungie’s latest This Week At Bungie (TWAB) </a>for all of the sandbox and weapon changes coming to <em>Destiny 2, </em>but here are the big ones for <strong>PvP</strong>:</p><ul><li id=\"z6luV7\">Players now only drop one special ammo on death, and the maximum you can pick up is one for shotgun, fusion rifles, or sniper rifles. You can still use scavenger mods to boost this, but you won’t be picking up five or six shots anymore.</li><li id=\"St9hDz\">Tap the trigger, the perk available on the <strong>Main Ingredient</strong> Fusion rifle sold by Xur, is getting nerfed to make it far less stable so it’s less overpowered in PvP.</li><li id=\"8sdBPU\"><strong>Felwinter’s Lie</strong>, the shotgun that still dominates in PvP, is getting a 15 percent increase in its spread angle, which sounds like a hefty nerf to make it less lethal.</li><li id=\"zTDTTC\"><strong>Chaperone</strong><em>, </em>the exotic shotgun favored by controller players, will see its passive range buff reduced from 2 meters to 0.5 meters.</li><li id=\"tNE3PY\"><strong>Dead Man’s Tale, </strong>a total nuisance in PvP, is having its catalyst’s hip-fire rate reduced from 150rpm to 130rpm. This should make it more difficult to spam hip-fire shots from across a map.</li><li id=\"PlKF0f\"><strong>Lorentz Driver</strong> and <strong>Arbalest</strong> will get more flinch to make it easier to counter them, but I’m not convinced this will help, considering the huge amounts of aim assist these linear fusion rifles have.</li></ul><p id=\"vcSNfG\"><em>The Witch Queen</em> expansion launches on Xbox, PlayStation, PC, and Stadia on February 22nd.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/H84qQgE7DI4nf3Y3QZYfi0PDsN4=/0x20:1024x556/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215789/image2.jpg",
  "description": "Destiny is getting a big weapon shakeup.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}