{
  "title": "Cadillac Lyriq, the brand’s first electric vehicle, starts production ahead of schedule",
  "url": "https://www.theverge.com/2022/3/21/22988872/cadillac-lyriq-production-ev-spring-hill-delivery",
  "date": "2022-03-21T16:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QGhdTxJH9y_0s_5xcGbZm0WAGJI=/82x0:2319x1491/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70652258/MY23LYRIQ_HERO_FRONT_3_4_BLACK_ROOF_FINAL.0.jpg\" />        <figcaption>Images: Cadillac</figcaption>    </figure>  <p id=\"Edk3DB\">The 2023 Cadillac Lyriq electric crossover is now in production at General Motors’ Spring Hill, Tennessee factory, the automaker announced Monday. The EV is the luxury brand’s first electric vehicle. </p><p id=\"cRkcGG\">The Lyriq is officially ahead of schedule after GM initially said that production was not slated to begin until late 2022. Facing criticism that its new EVs were taking too long to reach customers, the automaker put the Lyriq on an accelerated development schedule that resulted in an early 2022 start date.  </p><p id=\"3Pa6LF\">“This is bringing Cadillac back to leadership, back to tier one luxury, and really getting an American luxury brand recognized and highly desirable, both from a design technology and engineering standpoint,” said Mark Reuss, president of GM, in a briefing with reporters on Monday. </p><div class=\"c-float-right\"><aside id=\"85iiPL\"><q>“This is bringing Cadillac back to leadership”</q></aside></div><p id=\"FfXBbN\">The Lyriq, <a href=\"https://www.theverge.com/2020/8/6/21357717/cadillac-lyriq-gm-ev-suv-touchscreen-size-specs-release-date\">which made its debut back in August 2020</a>, <a href=\"https://www.theverge.com/2021/4/21/22394483/cadillac-lyriq-electric-suv-price-specs-2022\">will start at $59,990</a> — though GM has yet to detail its trim levels and options. The Lyriq will launch in Debut Edition form, with a 100.4 kWh battery pack and rear-wheel drive. GM is targeting 300 miles of EPA-rated range, plus 340 horsepower and 324 pound-feet of torque. </p><p id=\"yz4QRS\">The Lyriq can charge at up to 190kW at public fast charging stations or up to 19.2kW at home (with the right equipment), which adds around 52 miles of range per hour. It will have Super Cruise, which is the hands-free driver assistance system that started at Cadillac but is now spreading to other GM vehicles. And it features a massive 33-inch display that stretches from the left of the driver all the way to the middle of the dashboard. There’s an active noise cancellation system to dampen road noise, LED headlamps, and more.</p><p id=\"5sNtEn\">The Lyriq is also the first Cadillac to be built on GM’s new flexible Ultium architecture, which is being used to power the automaker’s next-generation lineup of EVs, including the Hummer EV. GM altered the chemistry of its Ultium battery cells to reduce dependency on cobalt. And the Lyriq’s battery electronics will be incorporated directly into the modules, eliminating nearly 90 percent of the battery pack wiring as compared to GM’s other EVs.</p><p id=\"3ldGrg\">Demand is strong for the Lyriq, with executives touting over 240,000 “hand-raisers” for the electric crossover. Those customers did not have to put money down for a reservation but rather have just indicated an interest in a possible purchase. GM is anticipating a high number of those hand-raisers will convert to actual customers when the order bank opens on May 19th. </p><p id=\"lHvdil\">“So we’re not going through reservations anymore,” said Rory Harvey, vice president for global sales at Cadillac. “We’re going straight to orders as of May the 19th.” But Harvey cautioned that those customers likely won’t see a Lyriq in their driveway until later this year or even 2023. </p><p id=\"Z5TfdH\">When it starts reaching customers later this year, the Lyriq will find itself in competition with a host of new luxury EVs, including the BMW iX SUV, Volvo XC40 Recharge and C40 Recharge, and Audi E-tron. Others are also scheduled to be available later this year, including the Mercedes-Benz EQE, Rivian R1S, and Maserati Grecale. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n6u4hM3q7rlVv7669-zFKw40-u4=/0x118:2400x1375/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22457992/MY23LYRIQ_HERO_FRONT_3_4_BLACK_ROOF_FINAL.jpg",
  "description": "Customers can place an order starting May 19th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}