{
  "title": "Cake Ösa electric motorbike review: hungry for more",
  "url": "https://www.theverge.com/23074615/cake-osa-review-electric-scooter-motorcycle-moped",
  "date": "2022-05-17T10:01:31.000Z",
  "author": "Thomas Ricker",
  "content": "  <p>Hauls your gadgets and tools, then powers them when you arrive</p> <p class=\"p--has-dropcap p-large-text\" id=\"SXLLl3\">Everyone — and I do mean <em>everyone</em> — has an opinion about the Ösa electric two-wheeler from Swedish upstarts Cake. It invokes such a surge of emotion that dozens of strangers felt compelled to exclaim unsolicited critiques at me over the last few weeks. </p><p id=\"uPWADO\">“What is that!?” shrieked a middle-aged man who bicycled across a busy street just to ask. “What a dumb design,” scolded a boorish woman waiting next to me on a ferry. Mostly, though, people just looked on in silence, scowling or excitedly tapping their friends to behold the unique-looking scooter that had just rolled into view.</p><p id=\"m06fPh\">The Cake Ösa is rather unique. It not only transports all your gadgets and tools, it also transforms into an electric generator to power them once you arrive. </p><div id=\"tLfcEu\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Cake Ösa review|107198\" data-volume-uuid=\"3dae50ed8\" data-volume-id=\"107198\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-944\" class=\"volume-video\" data-volume-player-choice=\"youtube\"></div><div class=\"caption\">Today’s office</div></div><p id=\"hBI5Dz\">Cake calls Ösa a “multifaceted utility platform with off-road capabilities.” To test that claim, I took an <a href=\"https://ridecake.com/en/shop/bikes/explore-and-commute-series/osa-flex/\">Ösa Flex model</a> on a sunrise surf safari and then cooked breakfast off the Ösa’s battery, which also powered my workday on a remote stretch of beach. I wanted to mimic one of those boastful “today’s office” stories you’ve seen on Instagram but rarely, if ever, experience in real life. </p><p id=\"ojpkoP\">How did it do? Good enough to make me think the $9,000 / €9,000 starting price isn’t as crazy as I first thought.</p><div id=\"jZZ6Bz\"><div data-anthem-component=\"scorecard:11194808\"></div></div><p class=\"p--has-dropcap\" id=\"qIYphK\">Cake was founded in 2016 by Stefan Ytterborn, who’s also responsible for launching the POC apparel brand popular with mountain bikers. POC, founded in 2005, is an abbreviation for “Piece Of Cake.” That bit of trivia blew the minds of my MTBing friends, who universally liked the Ösa for what it is, but they were even more impressed by what it <em>can do</em>.</p><p id=\"970xOj\">Ösa is just one of the many eclectic, electric-only vehicles produced by Cake in a range that spans off-road motorbikes to street-legal mopeds. It even has an entire series dedicated to <a href=\"https://ridecake.com/en/kids-category-page/\">getting kids hooked on electric power</a>. The Ösa model is positioned as a rolling workbench that can easily transport and power gadgets like phones, speakers, and laptops; as well as medium-to-light-duty tools like drills and circular saws when fitted with an optional inverter sold by Cake.</p><p id=\"hRzA0J\">The Ösa model is available in a few configurations. The Ösa Plus is equivalent to a 125cc motorcycle with a top speed of 90km/h (56mph). The <a href=\"https://ridecake.com/en/shop/bikes/explore-and-commute-series/osa-flex/\">Ösa Flex</a> configuration can be ridden with a typical driver’s license but maxes out at 45km/h (30mph). It’s the Ösa Flex that I tested for 10 days in and around Amsterdam. </p><p id=\"BEsqzs\">Weirdly, Cake doesn’t make an e-bike despite its POC mountain biking lineage. All of Cake’s vehicles come with throttles and footrests, not pedals.</p><h2 id=\"6mPeIu\">The battery-powered generator</h2><p id=\"hk3hcT\">Tesla owners have long attached after-market inverters to their giant rolling DC batteries in order to convert them into unofficial (and potentially warranty-voiding) mobile AC power sources. It’s a trend that’s recently been fully embraced by the likes of <a href=\"https://www.theverge.com/2021/2/23/22296991/hyundai-ioniq-5-electric-suv-ev-battery-range-specs\">Hyundai’s Ioniq 5 SUV</a> and new electric pickups from <a href=\"https://www.theverge.com/23065908/ford-f150-lightning-electric-truck-first-drive-specs-road-bluecruise\">Ford</a> and <a href=\"https://www.theverge.com/transportation/2021/9/28/22697309/rivian-r1t-electric-truck-test-drive-off-roading-camp-tested\">Rivian</a>. It’s no wonder Cake refers to Ösa as a truck in some of its marketing.</p><p id=\"CnDfn9\">My Ösa Flex review vehicle came with all the bells and whistles needed for maximum hauling capacity, power, and range. That means a Cake inverter, a second hot-swappable battery, a surfboard holder, a second seat, a small basket for the front, and a large basket for the back. The Ösa’s top bar was then fitted with plenty of adjustable attachment points to mount everything.</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KfY-RVXjV8KLsNx_US-cOgeZhgg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23470583/verge_IMG20220426080418_2040pxl.jpg\">      <figcaption><em>My make-shift kitchen and charging station assembled from the Cake Ösa’s battery and inverter.</em></figcaption>  </figure><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yzL4ABDyxRYY2X3GWesEElH1E9s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23470592/verge_IMG20220426070530_2040pxl.jpg\">      <figcaption><em>A vehicle that makes the most of Covid remote work policies.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Fh1F3Xx6oAQk49cd5qzpLDrcruQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23470590/verge_IMG20220426074702_2040pxl.jpg\">      <figcaption><em>All work and no play makes Jack a dull boy.</em></figcaption>  </figure></div></div></div><p id=\"VVaHo2\">For my test, I rode 32km (20 miles) from Amsterdam to the North Sea coastline. There I loaded up the Ösa with my kitesurfing gear, induction cooktop, and tent before riding to a remote beach for an early morning kitesurf session. Then, with the inverter and battery set up like a kitchen in front of my tent, I was able to cook breakfast and power my laptop and 5G hotspot to run the international news shift for <em>The Verge</em>.</p><p id=\"nvW9GV\">It all worked surprisingly well. The large battery quickly slips out of the Ösa after removing a beefy power cable and a thin velcro strap. The optional 1000W Cake Pure Sinewave DC to AC power inverter (available in both <a href=\"https://ridecake.com/en/shop/spare-parts/chains-sprocket-powertrain-spare-parts/power-inverter-eu/\">230V EU</a> and <a href=\"https://ridecake.com/en/shop/spare-parts/chains-sprocket-powertrain-spare-parts/power-inverter-us/\">110V US</a> models) connects directly to the main power port of the Cake battery with a thick and rather unwieldy cable that limits placement of the bulky box. The inverter can connect to the battery while still on the Ösa, but I wanted to keep my distance from it for fear the wind might topple the scooter off its center stand parked precariously in the moist sand.</p><div class=\"c-float-right c-float-hang\"><aside id=\"GP9Zb2\"><q>Good thing I was carrying a second battery</q></aside></div><p id=\"Cq3GIM\">The inverter is limited to 1000 watts and was easily overpowered by my induction cooktop when set to high. Its fan is also quite loud when it kicks in. Still, when connected to the Ösa battery, I had enough power to boil the water inside the Moka coffee pot and to fry up an egg and toast after. The 50Ah / 2.5kWh battery still had enough juice to power a small 600W space heater for another 60 minutes before shutting off. Good thing I was carrying a second, fully charged Cake battery to keep my laptop running and still get me back home. </p><p id=\"oMPSVv\">Cake offers plenty of examples of the types of devices the inverter can power when connected to Ösa’s battery. These include power tools (drills, grinders, weeders, air compressors); consumer electronics (game consoles, electric guitars); industrial equipment (cloud server, facial recognition system); household appliances (vacuum, fan, sewing machine); and office equipment (coffee machine, blender, toaster). Unfortunately, the company fails to mention duration, which in some cases will measure just a few minutes before the battery is completely drained.</p><p id=\"PJVkgr\">Even without the inverter, the Cake Ösa battery can power a laptop or devices like travel fridges that can be plugged directly into the 12V / 15A (180W) jack, as well as your USB devices from the two 5V / 2A (10W) USB-A jacks. I was able to snake a standard-length Apple Lighting cable to my iPhone mounted on the handlebar to keep it fully charged while navigating long journeys.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dCbPS5N-dGplRyUaXb7-Ld2anK8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23470593/verge_IMG20220502145122_2040pxl.jpg\">      <figcaption><em>Cake and POC (Piece of Cake) were both founded by Stefan Ytterborn.</em></figcaption>  </figure><h2 id=\"oRPAXm\">The ride</h2><p id=\"ri8b6e\">You can choose from three ride modes on the Cake Ösa Flex. Mode 1 is meant to maximize range with a top speed of 30km/h (19mph), mode 2 boosts the top speed to 45km/h (28mph), and mode 3 maxes out acceleration. I settled on mode 2 for my daily riding, as it offered the best balance of range and power. I was able to deplete a fully charged battery after 70km (43 miles) while riding in mode 2 with my baskets fully loaded and in windy conditions that hovered just above freezing. The battery charges to 80 percent in two hours off a household jack or 100 percent in three hours.</p><p id=\"KrZKMn\">The Ösa rides heavy compared to traditional mopeds, making it feel very stable at any speed, even on packed sand. It weighs about 100kg (220 pounds) with all the hauling accessories and battery installed. The geometry puts the rider low to the ground in a very relaxed position on a saddle that’s more comfortable than it looks, even on rides lasting over an hour. </p><p id=\"hyYJgl\">The only real gripe is that the display isn’t readable at all in sunlight, direct or indirect. It’s really bad and slowed me down when powering up the vehicle because I could barely see the display to enter the pin required to unlock it.</p><p id=\"NbJiGs\">Nevertheless, if I had to sum up my time with the Cake Ösa Flex in just one word, it would be “fun.” In fact, The Cake Ösa is the most fun I’ve ever had on two wheels — or any wheels.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/d7PADf-nsCitsEEShEuc9lXitm0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23470569/verge_IMG20220429152813_2040pxl.jpg\">      <figcaption><em>Hank the beagle is ready to ride.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"nuVnWF\">If there’s a silver lining to the pandemic, it’s the rise of tools like Zoom and Slack that have allowed corporations to extend remote work opportunities to more people. Vehicles like the Ösa Flex can help make the most of these new hybrid office policies. It’s a terrific on- and off-road vehicle with oodles of configurable storage options for anyone in need of such a rig.</p><p id=\"tbz7oH\">Still, while the idea of a work bike like the Ösa Flex or faster Ösa Plus motorbike is compelling, I can’t imagine there’s enough capacity here to be practical for most tradespeople to power their workdays. Having to carry a separate inverter isn’t ideal either. The Ösa Flex was fine for my modest needs as a journalist, but that’s only because I carried a second 17kg (almost 38 pounds) battery with me.</p><p id=\"T5jT4W\">Cake did recently introduce a more robust <a href=\"https://ridecake.com/en/work-category-page/\">Work series</a> across its lineup of vehicles. In addition to providing more hauling power, the Ösa Flex Work ships with an XL 75Ah / 3.75kWh battery that weighs 26kg (over 57 pounds). That makes it a bit more viable for those in need of off-grid power — especially if you carry a second or third battery — but it also increases the starting price from $9,000 / €9,000 to $11,000 / €11,000. A true rolling electric generator like the <a href=\"https://www.theverge.com/23065908/ford-f150-lightning-electric-truck-first-drive-specs-road-bluecruise\">Ford F-150 Lightning</a> starts at $40,000 with 98kWh of battery capacity — enough to power a work site or an entire home for days at a time. </p><p id=\"ejlq4d\">The fact that you now have so much choice in mobile power stations is just... icing on the cake.</p><p id=\"utBkjS\"><em>All photography by Thomas Ricker / The Verge </em>— v<em>ideo by Ivo Ricker</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/oL1f2J3w8kE6jGzDuvo-80WHIWY=/0x373:4096x2518/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23470562/IMG20220426064418.jpg",
  "description": "Hauls your gadgets and tools and then powers them when you arrive.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}