{
  "title": "CalDigit’s TS4 is the new king of Thunderbolt docks",
  "url": "https://www.theverge.com/22957456/caldigit-ts4-thunderbolt-4-dock-review",
  "date": "2022-03-02T15:15:00.000Z",
  "author": "Dan Seifert",
  "content": "  <p>All the ports and all the power</p> <p id=\"EjJU0X\">Once the domain of IT departments and corporate purchase orders, laptop docks have become an indispensable tool of the home office. Thanks to interfaces like USB-C, a capable dock can turn your humble ultralight laptop into a full-fledged desktop system, complete with an external display and plenty of peripherals. And it takes just one cable to switch from portable laptop mode to desktop destroyer.</p><p id=\"AMBYVS\">CalDigit’s latest dock, the $359.95 Thunderbolt 4-powered TS4, provides nearly any port you could desire, plus it can keep your laptop charged up while you use it. The TS4 is the most well-equipped dock you can buy right now — it has the most ports, the widest compatibility, and one of the smallest footprints on your desk. It’s nearly perfect, provided you can stomach its sky-high price.</p><div id=\"zaFkpy\"><div data-anthem-component=\"scorecard:11074485\"></div></div><p id=\"q2lRZO\">First, a primer on laptop docks. Years ago, docks were limited to business laptops, which relied on proprietary interfaces to connect worker drone laptops to an external display, mouse, and keyboard when they were seated at their desk. That’s how the name “dock” came about — you literally docked the base of your laptop in a clunky contraption, and the connection was made through pins on the bottom of the computer. Some devices, like Microsoft Surface devices, streamlined this down to a single proprietary port that connected the computer to a variety of other peripherals.</p><p id=\"KAcDoj\">Then USB-C upended all of it. Now that virtually all laptops have a small port that can handle data, power, and video through one connection, all you need to do is plug a dock into the side of your computer, and you’re off to the races. You don’t need a proprietary dock from Lenovo or HP or whoever makes your computer — USB-C works with any computer with a USB-C port.</p><p id=\"22bUHq\">Once Apple released the <a href=\"https://www.theverge.com/2016/11/14/13616404/apple-macbook-pro-touch-bar-review-2016-13-inch-15-inch-laptop\">2016 MacBook Pro</a>, which eliminated all ports save for USB-C, the market of simple USB-C docks exploded. These devices generally hang off the side of a computer and provide a couple of USB-A ports, an HDMI video out, and perhaps an SD card reader or Ethernet jack. They are ideal for travel — since your new computer didn’t come with the ports you’ve been used to for years, this little adapter provided most everything you need in a little dongle.</p><p id=\"YpKipD\">But while USB-C docks are useful for traveling, they are less than ideal for more permanent desk setups. They have a small number of ports, limited bandwidth, and often connect with short cables, which makes for a messy desk when everything is plugged in.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UzTu7dwr_CPpLi8kMfwHGBCzTyM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253477/dseifert_220212_5020_0001.jpg\">      <figcaption><em>The TS4 uses a large external power brick to provide juice for a laptop and many accessories.</em></figcaption>  </figure><p id=\"ZA6LmC\">Thunderbolt docks address all of those problems. They have way more ports (the TS4 boasts a total of 18), four times the bandwidth for high-resolution / high-refresh display connections and speedy external drives, and are meant to stay in one place. They come with cables that are long enough to reach your laptop, whether it’s right next to the dock or a couple feet away. A good Thunderbolt dock is right up there with an external monitor and an ergonomic chair when it comes to home office upgrades.</p><p id=\"scZoi3\">There are two main downsides to Thunderbolt docks. The first, obvious one, is cost. While basic, portable USB-C docks can be found for as little as $50, you’re going to spend at least $200, and often much more, on a Thunderbolt dock. The other is power. They require big power supplies to be able to charge your computer and run all of the peripherals you might plug into the dock. The TS4 comes with a massive brick of a 230W power supply that you have to find room for and makes it about as portable as a chonky gaming laptop.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-X7o0RfVXHWGYa8hY_qiIicXYVM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253481/dseifert_220212_5020_0005.jpg\">      <figcaption><em>The TS4 can be used in either vertical or horizontal orientation.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HlJ5g1O_4rFDGyTnitTo7kOz7uo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253479/dseifert_220212_5020_0003.jpg\">      <figcaption><em>Most of the TS4’s ports are found on the back, with everything you need to hook up a whole desktop worth of accessories.</em></figcaption>  </figure></div></div></div><p id=\"TZbD3N\">Now that you’re up to speed on the difference between various laptop docks, know this: the TS4 is the most capable dock on the market right now. Across its 18 ports are three Thunderbolt 4 ports, three 10Gb/s USB-C ports, five 10Gb/s USB-A ports, DisplayPort 1.4, 2.5Gbps Ethernet, full-size and microSD UHS-II card slots, 3.5mm audio in, 3.5mm audio out, and a 3.5mm combo audio in and out on the front. It can output up to 98W to a laptop through the host Thunderbolt 4 port, while a 20W USB-C port on the front charges another device. The other Thunderbolt ports can charge devices at up to 15W, while the other USB-C ports and the USB-A ports output 7.5W each. A neat trick allows the TS4 to charge devices through most of its ports even when your laptop isn’t plugged into it, letting it double as a charging station.</p><p id=\"X5ykLd\">The TS4 is compatible with Thunderbolt 4, Thunderbolt 3, and USB 4 computers, and unlike many other Thunderbolt docks (and its predecessor, CalDigit’s TS3 Plus), it’s also compatible with more basic USB-C laptops or tablets, like Chromebooks or iPads. But if you want to get the most out of it, you’ll want to use it with a Thunderbolt laptop — those non-Thunderbolt USB-C devices will be limited with how many displays and how much bandwidth is available to peripherals.</p><p id=\"qSCd7A\">The only thing missing here is a dedicated HDMI port. You’ll need to use a USB-C to HDMI cable plugged into one of the Thunderbolt ports if your display doesn’t have DisplayPort. The TS4 can support up to two 6K 60Hz displays or a 1440p 240Hz display, depending on the laptop you’re plugging it into.</p><p id=\"ykNmRS\">All of that capability is packed into a five-and-a-half-inch tall, four-and-a-half-inch deep, and under-two-inch wide box. It’s small enough to sit vertically or horizontally on my desk or be integrated into an under desk mount if you want to hide it completely.</p><p id=\"UiCb4t\">To test the TS4, I hooked it up to a 14-inch MacBook Pro with the M1 Pro processor and plugged in every peripheral I could think of. Here’s everything I hooked up at once:</p><ul><li id=\"ApVimL\">1Gbps Ethernet line</li><li id=\"otWK6D\">A 5120 x 1440 120Hz display</li><li id=\"SfgETt\">A USB-A keyboard</li><li id=\"bqZNBz\">External speakers</li><li id=\"kYhbPZ\">A USB-C SSD</li><li id=\"liy2Kt\">A Thunderbolt 3 SSD</li><li id=\"vQpRnd\">An external camera via an Elgato CamLink 4K</li><li id=\"sSwe1E\">A USB-A microphone</li><li id=\"aNsXE6\">A UHS-II SD card</li></ul><p id=\"DNrb6p\">With all of those devices connected, I was able to access the full bandwidth of my 1Gbps FiOS internet, the full read and write speed of the USB-C SSD, and the full read and write speed of the SD card. I was able to run my 49-inch display at the full 120Hz that macOS supports through the DisplayPort connection and fast charge my MacBook’s battery at the same rate as the MagSafe charger that comes with the computer.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ArpZXzjAYCLZZRWyXtYS-TU3KsI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253484/dseifert_220212_5020_0008.jpg\">      <figcaption><em>Even with all of the devices I need to use hooked up, there were still a handful of available ports on the TS4.</em></figcaption>  </figure><p id=\"hNRj2X\">The only device that was slower than when connected directly to my Mac was the Thunderbolt 3 SSD, which lost about 20 percent of its write speed and 30 percent of its read speeds through the dock. I also had some issues with the Thunderbolt drive not mounting after waking the Mac from sleep, but that may be due to the beta version of macOS I’ve been using during my test period.</p><p id=\"KYOKRs\">I also had to <a href=\"https://www.caldigit.com/ethernet-port-on-the-ts4-or-ts3-plus-does-not-work-properly/\">disable the automatic energy-efficient mode</a> in the Mac’s network preferences for the Ethernet adapter in order to get the Mac to recognize the Ethernet connection.</p><p id=\"GaH1Et\">Getting the CamLink 4K to work with the TS4 was a bit more of a challenge. Initially, the video feed from my external camera would just freeze after a few seconds, regardless of which video capture or calling app I was using. To fix this problem, I had to plug the CamLink 4K into a Windows computer and use Elgato’s 4K Capture Utility, which isn’t available for Mac, and change the USB Transfer Mode from Automatic to Isochronous, which maintains a constant rate of transmission. Once that was changed, the CamLink 4K worked reliably through the TS4 dock.</p><p id=\"tnGT3x\">When it’s time to take my laptop away from my desk, I simply unplug one cable and go. And when I get back to my desk, it’s just one cable to reconnect all of my external devices and charge my laptop. If I want to switch from my Mac to my gaming laptop, it’s just one cable to move every peripheral over at once. It’s really hard to overstate the convenience factor here.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ikAs7RsPzp2ZRjqEdPCczDhjRIo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253485/dseifert_220212_5020_0009.jpg\">      <figcaption><em>The TS4 is compact enough to sit on most any size desk or even be hidden away.</em></figcaption>  </figure><p id=\"3YuwIw\">The TS4, like the TS3 Plus before it, is also more reliable than other Thunderbolt docks I’ve used. With the exception of my temperamental Thunderbolt SSD and the configuration steps for the Ethernet connection and CamLink, everything just worked as I expected it to every time I plugged my laptop into the dock.</p><p id=\"zFNPIA\">The TS4 is undeniably expensive, and if you have an older dock like the TS3 Plus, it probably isn’t worth the cost to upgrade. But if you’re chasing the ultimate work-from-home desk setup or just want the best Thunderbolt dock you can get, the TS4 is the way to go.</p><p id=\"jdxRgA\"><em>Photography by Dan Seifert / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iQ774ZtB_AaVgkEJnL121T2QYDE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23253482/dseifert_220212_5020_0006.jpg",
  "description": "The ultimate work-from-home desk upgrade",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}