{
  "title": "CalDigit’s new TS4 Thunderbolt 4 Dock has the most ports ever",
  "url": "https://www.theverge.com/2022/2/8/22923422/caldigit-ts4-thunderbolt-4-dock-usb-c-price-specs-monitor",
  "date": "2022-02-08T16:08:03.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kZQps2VwMQey8xLHMwDi1mSU44k=/0x46:1920x1326/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70483988/TS4_Thunderbolt_4_Dock_Refreshed_1920p.0.jpg\" />    </figure>  <p id=\"iPHUY2\">CalDigit makes the biggest, best Thunderbolt docks around, and it’s finally getting on the Thunderbolt 4 train with <a href=\"https://www.caldigit.com/thunderbolt-station-4/\">its new TS4 dock</a> — a $359.95 dock that offers a whopping 18 total ports to handle any accessory you can throw at it, along with 98W of passthrough power for keeping your laptop charged. </p><p id=\"w4FX9R\">Let’s just jump right into the most important thing here: the ports, which CalDigit boasts are “the most featured on any Thunderbolt dock ever.” Thunderbolt 4 support is the big headliner here, but the TS4 should work with Thunderbolt 4, Thunderbolt 3, USB4, and USB-C devices, so it’ll be handy even if you have an older device, too. </p><p id=\"V4KFRt\">While the company’s <a href=\"https://www.caldigit.com/ts3-plus/\">old flagship TS3 Plus dock</a> only had two Thunderbolt ports (one for connecting to your computer and one for downstream devices) and a single regular USB-C port, the TS4 heavily ups the ante, with three Thunderbolt 4 ports (one for your computer to connect to the dock, two downstream), in addition to two USB-C ports (both USB 3.2 Gen2, with one offering 20W of power while the other tops out at 7.5W). </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/N24Q2myBAoYlMY_eyCPn_4Zqwjs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226392/TS4_Thunderbolt_4_Dock_Labled_Graphic_Updated_1500px.jpg\">      <cite>Image: CalDigit</cite>      <figcaption>ALL THE PORTS</figcaption>  </figure><p id=\"qjr7Wj\">Here’s everything you get on the TS4:</p><ul><li id=\"9NMy0b\">One host Thunderbolt 4 USB-C port (offering up to 98W of charging for a connected laptop) and 40Gbps data transfer speeds</li><li id=\"NmSo3J\">Two downstream Thunderbolt 4 USB-C ports (up to 15W of charging and 40Gbps data transfer speeds) </li><li id=\"LwMpav\">One 20W USB-C 3.2 Gen2 port (with 10Gbps data transfer speeds)</li><li id=\"8fRsjb\">One 7.5W USB-C 3.2 Gen2 port (with 10Gbps data transfer speeds)</li><li id=\"TdlVBO\">Five USB-A ports, with four on the back, one on the front — all five ports feature the USB 3.2 Gen2 specification and offer 7.5W charging and 10Gbps data transfer speeds.</li><li id=\"aJIcV5\">A 3.5mm audio-in jack</li><li id=\"5lqQHK\">A 3.5mm audio-out jack</li><li id=\"xdEMmQ\">A 3.5mm audio combo jack</li><li id=\"ujJu05\">A 2.5 Gbps ethernet port</li><li id=\"fPduGE\">A DisplayPort 1.4 port</li><li id=\"TUokA0\">An SD UHS-II slot</li><li id=\"LgDU1z\">A microSD UHS-II slot</li></ul><p id=\"cdWlJa\">The most notable absence is an HDMI port, although, given the TS4’s Thunderbolt-heavy focus, it makes sense that the dock focuses more on offering more Thunderbolt ports (which are more versatile and allow for connecting accessories like SSDs in addition to displays) than it does HDMI ones. CalDigit does note that customers looking to hook up an HDMI display can use an active HDMI to DisplayPort adapter or simply get an HDMI to USB-C cable. </p><p id=\"tqkdti\">As for actually connecting displays, there are a lot of options here, depending on what kind of ports your computer has, what operating system you’re running, and what screens you actually have on hand. The short of it, though, is that the TS4 supports up to dual 6K 60Hz displays with Apple M1 Pro and M1 Max computers and up to dual 4K 60Hz displays with Windows devices. If you’re only hooking up a single display, Windows users can connect up at up to 8K and 60Hz, while macOS tops out at 6K and 60Hz. CalDigit also has a more comprehensive chart that explains the various other permutations for different devices. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EEfc1SCfgcMToX1ulKvRsAcSKzk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226355/Screen_Shot_2022_02_08_at_10.33.35_AM.png\">  </figure><p id=\"9jl52K\">Aside from the new ports, the design of the CalDigit TS4 is largely the same as its previous Thunderbolt docks — a large, aluminum block with a variety of handy ports intentionally put on the front so that you can easily access them, with the rest on the back to (hopefully) avoid a rat’s nest of cables on your desk. </p><p id=\"UG3VGz\">The biggest downside, though, is the price: the TS4 costs $359.95 in the US, £324.99 in the UK, and €324.99 in the EU — making it <em>far </em>more expensive than a regular USB-C dock, which tends to cost in the $50 to $100 range. It’s also an increase over the already pricey $309 TS3 Plus, although you are getting more and faster ports on the new model. </p><p id=\"fiqYx8\"><a href=\"http://shop.caldigit.com/us/Docking%20Stations?product_id=212\">The TS4 is available to order now</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/REi0GAgR-hr5om71gm6S33q-FSk=/0x184:1920x1189/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23226395/TS4_Thunderbolt_4_Dock_Refreshed_1920p.jpg",
  "description": "18 ports, including five USB-C ports",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}