{
  "title": "California takes on Big Plastic over recycling myths ",
  "url": "https://www.theverge.com/2022/4/29/23048481/california-plastic-recycling-myths-investigation-exxon",
  "date": "2022-04-29T17:18:44.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"On Earth Day, San Francisco Expands Recycling To Rigid Plastics\" src=\"https://cdn.vox-cdn.com/thumbor/Nm8iSUUCDn7phKKxdZaQA-sfd64=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70811013/80825558.0.jpg\" />        <figcaption>A tractor drives through a giant pile of plastic bottles at the San Francisco Recycling Center April 22, 2008 in San Francisco, California. | Photo by Justin Sullivan/Getty Images</figcaption>    </figure>  <p id=\"wNRQT7\">California will investigate whether fossil fuel companies have broken the law by perpetuating myths about plastic recycling, Attorney General Rob Bonta announced yesterday. </p><p id=\"QLVD3n\">The investigation marks a fresh attempt to hold the fossil fuel industry accountable for downplaying the harm their products inflict on the planet. California will be looking into whether companies have<strong> </strong>misled consumers into thinking that recycling keeps plastic out of landfills and ecosystems — and whether they’ve broken any laws in the process. </p><p id=\"YJLz2z\">The reality is that the vast majority of plastic — <a href=\"https://www.science.org/doi/10.1126/sciadv.1700782\">more than 90 percent</a> of all plastic ever made — never gets recycled. </p><div class=\"c-float-left\"><aside id=\"Ub2yS6\"><q>“Enough is enough”</q></aside></div><p id=\"oom5xj\">“Enough is enough,” Bonta said in a <a href=\"https://oag.ca.gov/news/press-releases/attorney-general-bonta-announces-investigation-fossil-fuel-and-petrochemical\">press release</a>. “For more than half a century, the plastics industry has engaged in an aggressive campaign to deceive the public, perpetuating a myth that recycling can solve the plastics crisis.”</p><p id=\"f7qbFM\">Plastic is actually difficult to recycle (<a href=\"https://www.theverge.com/2019/9/12/20862775/aluminum-recycling-water-tech-plastic-manufacturing-cocacola-pepsi-apple\">more so than some other materials</a>) and degrades each time it gets rehashed. That’s one reason why it’s unlikely your plastic bottle will become another bottle. If it does get reused, it’s more likely to wind up as fibers in carpeting, which doesn’t require such high-grade plastic. And it often costs more to recycle plastic than to toss it, burn it — or just make more<strong> </strong>new plastic. </p><p id=\"EZHmEL\">Plastic makers anticipated these troubles with their products decades ago, according to a 2020 investigation by <a href=\"https://www.npr.org/2020/09/11/897692090/how-big-oil-misled-the-public-into-believing-plastic-would-be-recycled\">NPR</a><em> </em>and<em> </em><a href=\"https://www.pbs.org/wgbh/frontline/film/plastic-wars/\">PBS<em> Frontline</em></a>, but promoted recycling as a viable solution to plastic waste anyway. “There is serious doubt that [recycling plastic] can ever be made viable on an economic basis,” the news outlets cite one industry insider saying in a 1974 speech.</p><p id=\"iQAPiJ\">Plastic’s popularity has skyrocketed over the past several decades. The world produces about 200 times more plastic today than it did in the 1950s. California’s investigation will probe “<a href=\"https://oag.ca.gov/plastics\">companies’ role in perpetuating myths around recycling and the extent to which this deception is still ongoing</a>” and determine whether their actions broke the law. </p><p id=\"VkAVlD\">The state issued its first subpoena to ExxonMobil, one of the world’s biggest plastic producers.<strong> </strong>In an email to <em>The Verge, </em>ExxonMobil operations media manager Julie King called Bonta’s statements “meritless allegations” that “distract from the important collaborative work that is underway to enhance waste management and improve circularity.” </p><div class=\"c-float-right\"><aside id=\"61DhlI\"><q>Recycling just can’t make our plastic addiction sustainable</q></aside></div><p id=\"1e1dZH\">Despite decades of failure with plastic recycling, many companies are still trying to sell consumers on products that they say are more sustainable because they use recycled or “recyclable” plastic. </p><p id=\"PmX7oz\">Take the “Ocean Plastic Mouse” that Microsoft <a href=\"https://www.theverge.com/2021/9/22/22684591/microsoft-ocean-plastic-mouse-recycled-sustainability\">released</a> last year, in <a href=\"https://www.sabic.com/en/news/30776-sabic-and-microsoft-collaborate-to-create-microsoft-s-first-product-made-with-recycled-ocean-plastic\">collaboration</a> with Saudi Aramco (an oil company) subsidiary Saudi Basic Industries Corporation. About 20 percent of the mouse’s shell is recycled plastic. But any benefits from using that much recycled material might be canceled out if the company sells 20 percent more products. What’s more, a hot market for recycled plastic might actually keep the market for new plastics strong since lower-quality recycled plastics are usually reinforced with virgin plastic. <a href=\"https://www.theverge.com/2021/10/6/22712435/recycling-e-waste-tech-plastic-pollution\">Recycling just can’t make our plastic addiction sustainable</a>.</p><p id=\"WA8Kjo\">If companies like ExxonMobil knew this (like <a href=\"https://graphics.latimes.com/exxon-arctic/\">Exxon knew</a> early on that fossil fuels would drive a climate crisis) and decided to use that misinformation anyway to lure customers, California could ultimately hold them accountable. Similar <a href=\"https://www.cbsnews.com/news/climate-change-disinformation-suing-fossil-fuel-companies/\">lawsuits</a> are still making their way through court. </p><aside id=\"RfnWUy\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Recycled plastic won’t solve tech’s waste problem\",\"url\":\"https://www.theverge.com/2021/10/6/22712435/recycling-e-waste-tech-plastic-pollution\"}]}'></div></aside><p id=\"XW6sEu\"></p><p id=\"q5kprk\"></p><p id=\"yZZwWB\"></p><p id=\"4cbAMa\"></p><p id=\"sm4RMG\"></p><p id=\"gzUXyv\"></p><p id=\"D6r5ne\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZM9kJaLTizRVmIE0s3jD_7l-DWg=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23425874/80825558.jpg",
  "description": "Very little plastic has ever been recycled.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}