{
  "title": "California governor signs executive order shaping cryptocurrency regulation in the state",
  "url": "https://www.theverge.com/2022/5/7/23061351/california-governor-signs-executive-order-aiming-regulate-foster-cryptocurrency-usage",
  "date": "2022-05-07T18:35:53.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"SFChronicleNewsom\" src=\"https://cdn.vox-cdn.com/thumbor/acCVdGEWg4eW2bl2kjB-EP62kpY=/0x0:6720x4480/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70843526/1360473768.0.jpg\" />        <figcaption><em>Governor Gavin Newsom’s executive order aims to “create a transparent and consistent business environment” for businesses in crypto.</em> | Brontë Wittpenn/The San Francisco Chronicle via Getty Images</figcaption>    </figure>  <p id=\"CFSXnd\">California Governor Gavin Newsom <a href=\"https://www.gov.ca.gov/2022/05/04/governor-newsom-signs-blockchain-executive-order-to-spur-responsible-web3-innovation-grow-jobs-and-protect-consumers/\">signed an executive order</a> on Wednesday that lays the groundwork for bolstering and regulating the cryptocurrency industry in the state (via <a href=\"https://www.cnbc.com/2022/05/04/california-governor-signs-executive-order-on-cryptocurrencies.html\">CNBC</a>). As outlined in the <a href=\"https://www.gov.ca.gov/wp-content/uploads/2022/05/5.4.22-Blockchain-EO-N-9-22-signed.pdf\">executive order</a>, Newsom’s goal is “to create a transparent and consistent business environment for companies operating in blockchain,” that balances “the benefits and risks to consumers.”</p><p id=\"VvGWQj\">The executive order calls upon the California Governor’s Office of Business and Economic Development (GO-Biz) to collaborate with the state’s Department of Financial Protection and Innovation (DFPI) and Business, Consumer Services and Housing Agency (BCSH). Together, the state agencies are tasked with devising “potential blockchain applications and ventures,” which could include applications in the “private sector, academia, and community.”</p><div class=\"c-float-right\"><aside id=\"92R25w\"><q>Newsom’s plan aligns with the executive order President Joe Biden signed in March</q></aside></div><p id=\"ohiCL3\">It also orders the DFPI to shape a regulatory approach to cryptocurrency, create consumer protections, as well as produce educational materials that inform California’s residents about both the risks and benefits associated with cryptocurrencies. The order specifically says the materials will “include information about how to avoid scams and frauds,” one of <a href=\"https://www.theverge.com/22522380/cryptocurrency-scams-hacks-bitcoin\">the major concerns about crypto</a>.</p><p id=\"T7y69d\">“Too often government lags behind technological advancements, so we’re getting ahead of the curve on this, laying the foundation to allow for consumers and business to thrive,” Newsom said in a statement.</p><p id=\"XtiSXB\">Newsom’s plan aligns with the <a href=\"https://www.theverge.com/2022/3/9/22966006/cryptocurrency-regulation-white-house-biden-treasury-commerce\">executive order President Joe Biden signed in March</a>, serving as the White House’s framework for future cryptocurrency regulation. Right now, it’s too early to tell how Newsom’s order will impact California’s cryptocurrency industry — no regulatory measures have been rolled out just yet, but the plans are in place to do so.</p><div id=\"wPB3Co\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/DigitalChamber?ref_src=twsrc%5Etfw\">@DigitalChamber</a> statement on California Executive Order N-9-22 - \"The <a href=\"https://twitter.com/hashtag/California?src=hash&amp;ref_src=twsrc%5Etfw\">#California</a> executive order rightly recognizes the role <a href=\"https://twitter.com/hashtag/blockchain?src=hash&amp;ref_src=twsrc%5Etfw\">#blockchain</a> technologies play in spurring job growth and economic competitiveness for the state, but also the national economy.     <a href=\"https://t.co/QtOz8WOadY\">pic.twitter.com/QtOz8WOadY</a></p>— Chamber of Digital Commerce (@DigitalChamber) <a href=\"https://twitter.com/DigitalChamber/status/1521955919172718592?ref_src=twsrc%5Etfw\">May 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"xh6Jyw\">Kristin Smith, the executive director of the Blockchain Association, a trade group representing companies in the cryptocurrency industry, welcomed Newsom’s executive order. “The Blockchain Association applauds California for issuing an executive order to study crypto and digital assets,” Smith said in a statement to <em>The Verge</em>. She also added that the crypto industry is looking forward to collaboration with the government “on commonsense rules for industry to allow California — and the United States — to lead in crypto innovation.”</p><p id=\"1CBLvX\">The Chamber of Digital Commerce, an advocacy group for blockchain technologies, had a similar response, <a href=\"https://twitter.com/DigitalChamber/status/1521955919172718592\">noting</a> the order “rightly recognizes the role blockchain technologies play in spurring job growth and economic competitiveness for the state, but also the national economy.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/E9XGIpirBjUoMQp_Y-wKhuuxyRE=/0x321:6720x3839/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23444851/1360473768.jpg",
  "description": "The order aims to bolster and regulate the crypto industry.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}