{
  "title": "California governor has been interfering in Activision Blizzard lawsuit",
  "url": "https://www.theverge.com/2022/4/13/23023776/activision-blizzard-sexual-harassment-gavin-newsom",
  "date": "2022-04-13T17:23:30.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"SFChronicleNewsom\" src=\"https://cdn.vox-cdn.com/thumbor/WK3NnDUx_dKItiMBr5xNGSQ_vbo=/0x0:6720x4480/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745221/1360473768.0.jpg\" />        <figcaption>Brontë Wittpenn/The San Francisco Chronicle via Getty Images</figcaption>    </figure>  <p id=\"Mc0F61\">The state of California’s case against Activision Blizzard just took another blow. <a href=\"https://www.bloomberg.com/news/articles/2022-04-13/california-lawyer-says-governor-interfered-with-activision-suit\">A report in <em>Bloomberg</em></a> alleges that the office of California Governor Gavin Newsom sought to “interfere” in the lawsuit between the state’s Department of Fair Employment and Housing and Activision Blizzard for <a href=\"https://www.theverge.com/2021/7/28/22597113/activision-blizzard-california-sexual-harassment-lawsuit-discrimination-employee-action\">sexual harassment and discrimination</a>. When the suit’s head counsel Janette Wipper tried to maintain the department’s autonomy, she was allegedly fired by Newsom, which prompted assistant chief counsel for the DFEH Melanie Proctor to resign in protest. </p><p id=\"Quidc5\">According to the <em>Bloomberg</em> report, Proctor sent an email to staff saying, “The Office of the Governor repeatedly demanded advance notice of litigation strategy and of next steps in the litigation. As we continued to win in state court, this interference increased, mimicking the interests of Activision’s counsel.” </p><p id=\"VHTxiN\">“Claims of interference by our office are categorically false,” Erin Mellon, communications director for Governor Newsom, said in a statement to <em>The Verge</em>. “The Newsom administration supports the effective work DFEH has done under Director Kevin Kish to enforce civil rights laws and protect workers, and will continue to support DFEH in their efforts to fight all forms of discrimination and protect Californians.” We asked if Newsom fired Wipper, but Mellon said that she can’t comment on personnel matters.</p><p id=\"IEcrwC\">Activision Blizzard recently settled with the EEOC to the tune of an $18 million victim compensation fund. The DFEH sought to block that settlement, claiming it could allow Activision Blizzard the ability to destroy evidence or release the company from the state’s claims. After <a href=\"https://www.theverge.com/2022/1/7/22872861/california-dfeh-appeals-decision-activision-blizzard-settlement-eeoc\">an attempt to stay the settlement</a>, <a href=\"https://www.theverge.com/2022/2/24/22949065/activision-blizzard-eeoc-settlement-california-judge-dfeh-stay-denied\">a California judge ultimately denied the DFEH’s requests</a>, paving the way for the settlement’s <a href=\"https://www.theverge.com/2022/3/29/23001663/activision-blizzard-18-million-harassment-settlement-eeoc-dfeh\">approval at the end of March</a>. </p><p id=\"rmiRNq\">The $18 million settlement was criticized for being a drop in the bucket for the billion-dollar company. Riot Games, a similar billion-dollar video game publisher, <a href=\"https://www.theverge.com/2021/12/28/22856743/riot-games-settlement-gender-discrimination-lawsuit-dfeh\">recently settled its own harassment lawsuit</a> for $100 million. High-profile lawyer Lisa Bloom, who has <a href=\"https://www.theverge.com/2022/3/24/22995291/activision-blizzard-sexual-harassment-lawsuit-lisa-boom-jane-doe\">filed her own case against the company</a>, <a href=\"https://www.theverge.com/2021/12/8/22823991/activision-blizzard-sexual-harassment-victim-press-conference\">held a press conference back in December</a> saying, “Given that there are hundreds of victims, I think we can all agree that the $18 million number is woefully inadequate.” </p><p id=\"A6hxwH\">While the DFEH’s attempts to block the settlement didn’t seem to be motivated by the settlement’s size (or relative lack thereof), it did seem to want to pursue harsher penalties than the EEOC proposed. Now with the DFEH’s top two lawyers gone, allegedly at the behest of the California governor, it seems like political forces (who could have a vested interest in Activision’s board <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">or even Microsoft’s</a>) have decided Activision Blizzard has properly atoned. In an email to <em>The Verge</em>, DFEH deputy communication director Fahizah Alim said, “DFEH does not comment on personnel matters. DFEH will continue to vigorously enforce California’s civil rights and fair housing laws.”</p><p id=\"cM1lf0\"><em><strong>Update April 13th, 3:44PM ET</strong></em><em>: A spokesperson from Governor Newsom’s office declined to comment on the circumstances of Wipper’s firing.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ysWUbkYq00lRKBi9o56vBvN0WwI=/0x90:6720x3608/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387581/1360473768.jpg",
  "description": "Two DFEH lawyers are out in the ongoing case.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}