{
  "title": "California net neutrality law to remain intact after appeals court says it won’t reconsider earlier decision",
  "url": "https://www.theverge.com/2022/4/21/23035359/california-net-neutrality-law-appeal-overturn-fcc-broadband",
  "date": "2022-04-21T15:54:29.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1yTqnD123u0JG2FkFCjD8ECPe7Y=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70776389/acastro_180608_1777_net_neutrality_0001.0.jpg\" />        <figcaption>California’s net neutrality law remains intact | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ymWtWO\">A federal appeals court has denied a request for a rehearing on its January decision that upholds California’s net neutrality law. The 2018 law, widely considered the strongest in the US, was signed into law a year after the Federal Communications Commission <a href=\"https://www.theverge.com/2017/12/14/16776154/fcc-net-neutrality-vote-results-rules-repealed\">(FCC) repealed the Open Internet Order</a>. That order had <a href=\"https://www.theverge.com/2015/2/26/8114265/fcc-ruling-net-neutrality-victory-internet-title-ii\">established stringent net neutrality rules</a> that prohibited internet service providers from throttling or blocking legal websites and apps, and banned ISPs from prioritizing paid content. </p><p id=\"NwZsGR\">California’s law, which finally took effect last year, also prohibits throttling and speed lanes. Wireless trade associations including the NCTA, the CTIA, and ISPs including Comcast, Verizon, and AT&amp;T sued to block California’s law from taking effect, saying the FCC decision should preempt the state law. But that challenge was rejected by a district court judge. The Ninth Circuit <a href=\"https://www.theverge.com/2022/1/28/22906856/court-upholds-california-net-neutrality-law\">voted 3-0 in January to uphold the lower court ruling</a>, saying the FCC “no longer has the authority” to regulate broadband internet services because the agency reclassified them as “information services, instead of telecommunications services. The FCC therefore cannot preempt the state action. </p><p id=\"X85wnw\">FCC chairwoman Jessica Rosenworcel <a href=\"https://twitter.com/jrosenworcel/status/1516891672482922501?\">praised</a> the decision on Twitter, reiterating her position that she wants to see net neutrality become “the law on the land” again. The FCC can’t currently reinstate net neutrality at the federal level however since the panel lacks a majority and the two Democrats and two Republicans remain deadlocked on the issue. President Biden’s FCC nominee Gigi Sohn is still awaiting a confirmation vote in the Senate. </p><p id=\"ZfD3ll\">The CTIA did not immediately reply to a request for comment on Thursday, while the NCTA’s senior vice president of strategic communications Brian Dietz said that organization had no comment on the decision. If the telecom companies want to continue pursuing the matter, the next step would be an appeal to the US Supreme Court to hear the case. </p><div id=\"5VN8i8\"><iframe src=\"https://embed.documentcloud.org/documents/21692884-transportroom/?embed=1&amp;responsive=1&amp;title=1\" title=\"9th circuit court denies rehearing on Ca. net neutrality law (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/e3dw5zihPBrogeythiPF7Sp54ms=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11515901/acastro_180608_1777_net_neutrality_0001.jpg",
  "description": "The FCC remains divided on the issue of net neutrality",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}