{
  "title": "Capcom is making a game where it rains dinosaurs",
  "url": "https://www.theverge.com/2022/3/9/22969723/capcom-exoprimal-dinosaurs-playstation-xbox-pc",
  "date": "2022-03-09T22:36:20.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yVRMsRDypuxVD0OQ_5j9szBDVmE=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70601569/Exoprimal___State_of_Play_March_2022_Reveal_Trailer___PS5__PS4_1_59_screenshot.0.png\" />        <figcaption>Image: Capcom</figcaption>    </figure>  <p id=\"LX8OX7\">Capcom just announced <em>Exoprimal</em>, a ridiculous-looking game featuring people in metal exosuits taking on hordes of dinosaurs. The game was revealed during Sony’s State of Play presentation. It’s set in a near future — 2043, <a href=\"https://www.youtube.com/watch?v=F3K89Vlz-80\">according to a trailer</a> — and apparently, we’ll have the technology at that time forecast “dinosaur outbreaks,” where a portal opens and sends down waves of dinosaurs that need to be dispatched. As one of my colleagues observed, it looks like a <em>Dynasty Warriors-</em>style game, except you’re in futuristic suits and fighting dinosaurs instead of people.</p><p id=\"fLjEWk\"><a href=\"https://blog.playstation.com/2022/03/09/futuristic-exosuits-clash-with-dinosaur-hordes-in-exoprimal-out-in-2023/\">According to a PlayStation blog post</a>, the game is focused around multiplayer co-op. “Always outnumbered by their foes, Exofighter teams will need to coordinate and select a strategic combination of suits to overcome the odds,” Capcom’s Kellen Haney said in the blog.</p><p id=\"WQ58ww\">Here’s how the main mode will work, according to a press release: </p><blockquote><p id=\"SE368f\">In the game’s main mode, Dino Survival, teams fight for every breath against countless dinosaurs while racing to complete missions before rival squads in 5v5 matches. A dynamic mix of objectives keeps players on their guard and ensures each match is different form the last. Exofighters will need to stay on their toes as hunts transition into precious cargo deliveries or desperate last stands against relentless assaults. Opposing teams are even given opportunities to tackle adversaries head-on and impede their progress. </p></blockquote><p id=\"GnTJTN\">It won’t be a PlayStation exclusive game, however — the press release states that <em>Exoprimal </em>will be available on PS4, PS5, Xbox Series X / S, Xbox One, and on PC via Steam when it launches in 2023.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FtTIzDwCjT0KhGK18B_0TUF8vwk=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23302316/Exoprimal___State_of_Play_March_2022_Reveal_Trailer___PS5__PS4_1_59_screenshot.png",
  "description": "Exoprimal will be released in 2023",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}