{
  "title": "Carbon capture tech is advancing in the wrong direction",
  "url": "https://www.theverge.com/2022/2/18/22940826/carbon-capture-tech-wrong-direction-power-plants-industrial-emissions",
  "date": "2022-02-18T21:51:21.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Equipment installed as part of the Petra Nova Carbon Capture Project stands at the NRG Energy Inc. WA Parish generating station in Thompsons, Texas, U.S., on Thursday, Feb. 16, 2017. The project, a joint venture between NRG Energy and JX Nippon Oil &amp; Gas Exploration Corp., reportedly captures and repurposes more than 90% of its own Co2 emissions.\" src=\"https://cdn.vox-cdn.com/thumbor/47sqYlfXEOdNGCjQSs4TaK7lS7o=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70527213/GettyImages_643866630.0.jpeg\" />        <figcaption><em>Equipment installed as part of the Petra Nova Carbon Capture Project stands at the NRG Energy Inc. WA Parish generating station in Thompsons, Texas, U.S., on Thursday, Feb. 16, 2017 before it closed in 2020.  </em> | Photo by Luke Sharrett/Bloomberg via Getty Images</figcaption>    </figure>  <p id=\"CYy8Zn\">Carbon capture tech that’s often sold as a solution for cutting greenhouse gas emissions from heavy industry — the most difficult sector to decarbonize — is still far off track from accomplishing that, according to a recent <a href=\"https://think.ing.com/articles/carbon-capture-technology-government-action-ccs-answer-environment-storage-controversial/#a1\">analysis</a> by financial services firm ING. </p><p id=\"MnCvPT\">The pipeline of new carbon capture and storage (CCS) projects, which aim to remove CO2 from power plants’ and industrial facilities’ emissions, is growing. But the majority of projects expected to come online this decade don’t tackle industrial pollution. Instead, the biggest growth is expected to be in carbon capture paired with fossil fuel power plants, similar to how the majority of the 40 million metric tons of CCS capacity the world has today is used in natural gas processing. </p><div class=\"c-float-right\"><aside id=\"xhux5v\"><q>The biggest growth is expected to be in carbon capture paired with fossil fuel power plants</q></aside></div><p id=\"64MweV\">That outlook doesn’t seem to jive with what some CCS proponents say is the best use case for the technologies. A lot of the recent enthusiasm for the tech has centered on its ability to reduce greenhouse gas emissions from crucial industries like cement, steel, and fertilizer production. To be sure, some advocates would rather see polluting facilities move out of their neighborhoods than outfitted with new climate tech. But industrial pollution makes up about a <a href=\"https://www.climateworks.org/programs/industry/\">third</a> of global carbon dioxide emissions, and it’s hard to eliminate because this sort of manufacturing often requires extremely high temperatures that have been difficult to reach using renewable energy.</p><p id=\"BGs7I6\">CCS is rapidly gaining momentum in the US, with support from Republicans and the Biden administration alike. Earlier this week, as part of a broader effort to slash pollution from the industrial sector, the Biden administration <a href=\"https://www.theverge.com/2022/2/15/22933710/biden-administration-guidelines-carbon-capture-pipelines\">announced</a> new federal guidelines for evaluating CCS projects that could encourage “widespread deployment” of the technologies. And in a bid to speed up permitting in Louisiana, Republican Senator Bill Cassidy threatened to block the appointment of Biden’s nominees for Environmental Protection Agency leadership because of the agency’s “<a href=\"https://www.cassidy.senate.gov/newsroom/press-releases/cassidy-places-holds-on-epa-nominees-over-delays-in-permitting-of-louisiana-carbon-capture\">delays</a>” in approving his state’s application to regulate wells for captured carbon dioxide.</p><p id=\"vx3xq5\">Despite those efforts, carbon capture as a strategy for tackling climate change is still divisive among environmentalists, in part because it’s been used to extend the reign of dirty power plants. An aging coal plant, for example, might be able to claim some green credentials if it captures some of its carbon emissions — even though other impacts of mining and burning coal, like habitat destruction and air pollution, remain. </p><p id=\"VQfM5Z\">What’s more, the CCS projects the US has funded in the past have a <a href=\"https://www.theverge.com/2021/12/30/22860207/carbon-capture-coal-plants-wasted-federal-dollars-watchdog-gao\">checkered track record</a>. Since 2009, the Department of Energy has invested hundreds of millions of dollars in carbon capture initiatives for several coal plants that never came to fruition, largely because of high costs and investors’ cold feet, according to a December <a href=\"https://www.gao.gov/products/gao-22-105111\">report</a> by the Government Accountability Office. </p><div class=\"c-float-left\"><aside id=\"ULZr3w\"><q>CCS capacity set to quadruple worldwide by 2030</q></aside></div><p id=\"X4QTzp\">It’s likely that CCS paired with gas production and power generation still outpaces industrial uses in spite of high costs because policymakers have paid more attention to cleaning up the power sector over the years, says Coco Zhang, head of ESG Research at ING Americas. But now, as more governments move to reach net-zero greenhouse gas emissions, they’re putting a bigger emphasis on gutting those stubborn industrial emissions. </p><p id=\"3ELuFH\">The bipartisan infrastructure law the US passed last year includes $12 billion to build out carbon capture and storage infrastructure, with a heavy emphasis on industrial emissions. Democrats’ stalled budget reconciliation package, a massive environmental and social spending bill, could further boost the technologies by increasing tax credits for carbon capture. </p><p id=\"sL3J58\">Still, with CCS capacity set to quadruple worldwide by 2030 and a smaller portion of that growth projected to show up in heavy industries per ING, there would likely need to be a larger push from governments for carbon capture to take off where it might be most useful.</p><p id=\"2Ff6fA\"></p><p id=\"xskba8\"></p><p id=\"i51j1Q\"></p><p id=\"ziB4xb\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SSRwLt-iIEtaLlaUmXz9h9cN5Zo=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23256117/GettyImages_643866630.jpeg",
  "description": "There’s a long way to go to decarbonize heavy industry.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}