{
  "title": "CD sales just rose for the first time in almost two decades",
  "url": "https://www.theverge.com/2022/3/14/22976557/cd-sales-increase-2021-recording-industry-association-of-america",
  "date": "2022-03-14T09:51:34.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hL5pqJuM0lIepruiX7mJXG46Uz4=/0x0:1055x703/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70618944/Screen_Shot_2022_03_14_at_9.16.02_AM.0.jpg\" />        <figcaption><em>In the US, CD sales increased for the first time since 2004.</em> | Image: RIAA</figcaption>    </figure>  <p id=\"nQb82D\">CD sales in the US for 2021 increased for the first time in almost two decades, according to <a href=\"https://www.riaa.com/u-s-sales-database/\">data published by the Recording Industry Association of America</a> (RIAA). Shipments rose from 31.6 million in 2020 to 46.6 million in 2021, and revenue from the format rose from $483.2 million to $584.2 million. The RIAA’s numbers corroborate a similar <a href=\"https://www.marketwatch.com/story/cd-sales-increased-in-2021-for-the-first-time-in-17-years-think-adele-and-not-the-ones-that-pay-0-50-11641579788\">report from MRC Data</a> published earlier this year.</p><p id=\"SvlAj9\">Although CD sales are still far from their 2000 peak — when almost a billion CD albums were shipped in the US — <a href=\"https://www.axios.com/cd-sales-grow-for-first-time-since-2004-0745a5ce-a2f3-4ed3-8b1e-14b20f0b218e.html\"><em>Axios</em> notes</a> that the increase is another key element of the resurgence in physical music. Vinyl sales have been steadily increasing for over a decade-and-a-half now, and hit 39.7 million units in the US in 2021, bringing in $1 billion in revenue. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-X0ovG7BDhJUOXXhBJ-SV53cFEk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312502/Screen_Shot_2022_03_14_at_9.22.19_AM.jpg\">      <cite>Image: RIAA</cite>      <figcaption><em>The biggest source of revenue in the US in 2021 was Paid Subscriptions at $8.6 billion.</em></figcaption>  </figure><p id=\"PJmIZl\">The combination means that physical media as a whole experienced its first increase in sales since 1996, but streaming remains king. Paid subscriptions made up 57.2 percent of revenue measured by the RIAA in 2021 at $8.6 billion, while ad-supported streams brought in $1.8 billion. Meanwhile, CD and vinyl album sales combined made up less than 11 percent of revenue.</p><p id=\"B9I3FX\">Personally, I’ll be very interested to see if this resurgence in CDs specifically continues as the world emerges from two years of pandemic lockdowns. CDs are great for listening to music at home, but I haven’t seen anyone carrying around a cumbersome portable CD player in years. And whereas vinyl offers a distinct sound compared to digital music, CDs contain digital music that’s essentially identical to what’s offered by lossless music services from Apple and Amazon (though, crucially, <a href=\"https://www.theverge.com/2021/12/23/22851667/spotify-hifi-lossless-hi-fi-streaming\">not Spotify</a>). </p><p id=\"c1KkSD\">Then again, CDs still offer something that purely digital services can only dream of: a nice physical object, complete with album art and a real sense of ownership. Plus there’s the sense that more of your money is going directly to an artist, rather than the pennies offered per play by streaming corporations. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0PY5KRcpq0nRZpKcpsa4N7qsRRA=/0x76:1055x628/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23312499/Screen_Shot_2022_03_14_at_9.16.02_AM.jpg",
  "description": "According to data from the RIAA.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}