{
  "title": "CDC launches wastewater tool to help show COVID-19 trends",
  "url": "https://www.theverge.com/2022/2/4/22917887/cdc-covid-19-wastewater-tracking-pandemic",
  "date": "2022-02-04T19:50:53.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xzTbCLsmEkJuv0mvavwxcHhnlug=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472477/acastro_200428_1777_coronavirus_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"qvRC1U\">Since the early stages of the COVID-19 pandemic, sewage systems in cities around the United States have helped track the spread of the coronavirus in real time. Now, those tracking projects will have public visibility through <a href=\"https://covid.cdc.gov/covid-data-tracker/#wastewater-surveillance\">a tool</a> on the Centers for Disease Control and Prevention (CDC)’s COVID-19 data tracking website, the agency announced Friday. </p><p id=\"W6jLba\">The tool pulls in data from National Wastewater Surveillance System (NWSS), which the CDC launched <a href=\"https://www.cdc.gov/healthywater/surveillance/wastewater-surveillance/wastewater-surveillance.html\">in September 2020</a>. That network includes data from more than 400 sites in the US.</p><p id=\"X2bNce\">Wastewater gives officials a way to track the spread of the coronavirus because the virus <a href=\"https://www.theverge.com/2020/4/20/21227995/sewage-wastewater-poop-coronavirus-survellience-biobot\">can be detected</a> in the feces of residents before they are prompted to get tested. But, unlike testing data, wastewater doesn’t rely on people showing up to get tested — it’s passive. While COVID-19 testing has been one of the main sources of tracking the presence of the virus, wastewater can put communities and health officials ahead of the spread of COVID-19 because it detects the virus in its early stages.</p><p id=\"TM9eMV\">“These data are uniquely powerful because they capture the presence of infection from people with or without symptoms,” Amy Kirby, team lead for the National Wastewater Surveillance System, said in a press briefing Friday. </p><p id=\"VxDPoI\">Early on in the pandemic, this method was used in places like <a href=\"https://www.theverge.com/21549141/coronavirus-tracking-sewage-new-york-city-outbreak\">New York City</a> and universities like the <a href=\"https://www.theverge.com/21283825/sewer-systems-coronavirus-seawge-data-warning-signs-cities\">University of Arizona</a>, which used wastewater tracking to visualize and predict the spread of COVID-19. The results can be an early signal that a wave of infections is coming.</p><p id=\"h3iC8Z\">The map shows how much the levels of coronavirus’ genetic material in wastewater have changed at each site over the previous 15 days. If a site does not detect the coronavirus after performing at least one test during that 15-day period, it will be logged as “non-detects.” If no samples were collected during the 15-day period, it will be labeled as “no recent data.” </p><p id=\"LlIvoA\">Kirby said in the briefing that hundreds more sites will begin submitting data that will be reflected in the tool “in the coming weeks.” The data will still be limited, though, because some areas around the country don’t have the infrastructure in place to do this type of sewage testing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7-b5qvgOGBOjNyt5Ge8AewuoCM0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23218289/Screen_Shot_2022_02_04_at_10.56.10_AM.png\">      <cite>Image: CDC</cite>      <figcaption>The National Wastewater Surveillance System</figcaption>  </figure><aside id=\"wLFgrZ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"We helped a New York sewage plant check poop for the coronavirus\",\"url\":\"https://www.theverge.com/21549141/coronavirus-tracking-sewage-new-york-city-outbreak\"}]}'></div></aside><p id=\"sMZJPK\"></p><p id=\"t0iZxE\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7RSmouS9VS4GRgFBIe1NZRaEDMM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19933220/acastro_200428_1777_coronavirus_0003.0.jpg",
  "description": "The tool is currently available on the CDC website.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}