{
  "title": "CDC launches new infectious disease forecasting center",
  "url": "https://www.theverge.com/2022/4/19/23032085/cdc-disease-forecasting-center-data",
  "date": "2022-04-19T16:57:00.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YleCHGzc4Whaq9OD3BWjChTv4j8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70767268/acastro_200512_1777_socialDistance_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1u0FAW\">The Centers for Disease Control and Prevention (CDC) officially launched a new center that will forecast infectious disease outbreaks. The Center for Forecasting and Outbreak Analytics is “the equivalent of the National Weather Service for infectious diseases,” the agency said in a statement <a href=\"https://www.cdc.gov/media/releases/2022/p0419-forecasting-center.html\">Tuesday</a>. </p><p id=\"1kVeuB\">Along with experts in data analytics and disease modeling, the center will also have communications specialists on staff to interpret the information for the public. </p><p id=\"vj5nCu\">Planning for the center began last August. It attempts to correct some of the <a href=\"https://www.theverge.com/22633116/covid-data-us-vaccine-boosters\">major</a> <a href=\"https://www.theverge.com/2021/8/16/22627004/public-health-data-gaps-fax-email-politico\">deficiencies</a> the COVID-19 pandemic revealed in the United States’ public health infrastructure. The CDC has never had a dedicated infectious disease forecasting program, and it has spent the past two years struggling to compile and distribute information about the spread of COVID-19 in a timely manner. US officials have regularly leaned on data from other countries to understand who’s at risk from the disease and how well the protection from various vaccines is holding up.</p><p id=\"WBknw5\">Researchers at the center have already produced data helping improve understanding of the omicron variant of the virus, showing that it caused less serious outcomes than the delta variant in the US, <em>The</em> <em>Washington Post</em> <a href=\"https://www.washingtonpost.com/health/2022/04/19/new-cdc-team-early-alert-pandemic/\">reported.</a></p><p id=\"05vCQi\">But the analysis done by the center can only be as good as the information it bases that analysis on. Experts say there needs to be increased<strong> </strong>funding and attention at the local level to collect good data about COVID-19 and other diseases. </p><p id=\"xm62nv\">“I do worry that we don’t have enough resources invested in ensuring the necessary level of community testing, surveillance and access to other data sources to get the most out of this new high-quality modeling center,” Jeffrey Duchin, health officer for Seattle and King County in Washington state, <a href=\"https://www.washingtonpost.com/health/2022/04/19/new-cdc-team-early-alert-pandemic/\">told <em>The Washington Post.</em></a></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1gW0YHCZcG_xrJXYveU5w2aPkxc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19981041/acastro_200512_1777_socialDistance_0001.0.jpg",
  "description": "A big part of the job is public communication.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}