{
  "title": "CERN’s particle accelerator starts up after a three-year hiatus",
  "url": "https://www.theverge.com/2022/4/22/23037077/cern-particle-accelerator-restarts-upgrades-dark-matter",
  "date": "2022-04-22T14:47:47.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MFMIZpdTVdx1GObFsfupz5YYXBg=/0x0:7722x5148/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70780714/20210_138_LHC_01.0.jpeg\" />        <figcaption>The Large Hadron Collider restarted after three years of upgrades. | CERN</figcaption>    </figure>  <p id=\"A5AUxD\">Two beams of protons zipped around the Large Hadron Collider on Friday, marking the <a href=\"https://home.cern/news/news/accelerators/large-hadron-collider-restarts\">return</a> of the world’s largest particle accelerator after over three years on hiatus. The European Organisation for Nuclear Research, or CERN, spent the past three years doing maintenance work<strong> </strong>and making major upgrades to the system. Now, the group is preparing to start on a four-year stretch of data collection scientists hope will reveal new secrets of the universe. </p><p id=\"85GJqN\">“It is going to be two to three times better, in terms of the ability for our experiment to detect, collect and analyze data,” Marcella Bona, a particle physicist from Queen Mary University of London, <a href=\"https://www.bbc.com/news/science-environment-61149387\">told <em>BBC.</em></a></p><p id=\"7J4IoJ\">This summer will <a href=\"https://home.cern/news/news/accelerators/large-hadron-collider-restarts\">mark the start</a> of the third run of the LHC, referred to as Run 3. The upgrades over the past few years mean that this run will see higher numbers of particle collisions, and that those particles will collide with greater energy than anything seen in previous runs. Scientists will use the new capabilities to test the limits of the <a href=\"https://home.cern/science/physics/standard-model\">Standard Model of physics</a>, a theory that explains how particles interact on a subatomic level. Along with other experiments, they will try and find new kinds of particles, and maybe even get a clearer picture of <a href=\"https://home.cern/science/physics/dark-matter\">dark matter</a>, a still-undiscovered substance that scientists believe accounts for a large percentage<strong> </strong>of the universe. But its existence still hasn’t been proven. </p><p id=\"x8VIIQ\">New projects will also scrutinize the Higgs boson, a particle discovered through experiments at the LHC in a landmark finding <a href=\"https://www.theverge.com/2012/7/4/3136527/higgs-boson-discovery-cern-announcement\">ten years ago</a>, in more detail. </p><p id=\"EwxkCl\">“It’s a really exciting time,” Bona told <em>BBC</em>. “We’ve worked for the past three years updating the machinery. Now we are ready.”</p><p id=\"jAFaEj\"></p><p id=\"AlMiwi\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/f9p1GfyyicWTr-dC_ejxXKIRcrs=/0x553:7722x4596/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23409071/20210_138_LHC_01.jpeg",
  "description": "It’s looking for dark matter.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}