{
  "title": "China announces plans for a new asteroid-deflecting mission",
  "url": "https://www.theverge.com/2022/4/25/23041839/china-asteroid-space-planetary-defense",
  "date": "2022-04-25T23:35:40.000Z",
  "author": "Mary Beth Griggs",
  "content": "      <figure>      <img alt=\"Two grey asteroids against a black background. A tiny spacecraft hurtles towards the asteroid on the left. \" src=\"https://cdn.vox-cdn.com/thumbor/sa-LHd0I1CNnBwAQaobo42WSouw=/352x0:4149x2531/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70792829/DART_collision_Angle2_still.0.jpeg\" />        <figcaption>An illustration of NASA’s DART spacecraft just before it hits Dimorphos | NASA</figcaption>    </figure>  <p id=\"9A3rbH\">China’s space agency plans to send a spacecraft to slam into an asteroid, knocking it into a new — and hopefully safer — orbit. The prospective new mission will launch within the next four years, and was announced on Sunday by Wu Yanhua, deputy director of the China National Space Administration, according to <a href=\"https://www.globaltimes.cn/page/202204/1260181.shtml\"><em>Global Times</em></a>, a state-run news outlet. </p><p id=\"QtFS0q\">The country hasn’t yet determined which asteroid to target. The mission was announced as one part of a larger new planetary defense effort, which will seek to catalog and monitor near-Earth asteroids, especially those that might pose a threat to our planet. The effort would include a new warning system as well. Eventually, the plan is to identify an asteroid that might threaten Earth, and send a spacecraft to crash into it, changing its orbit in the process. But it is still very early days, and the overall project has not been formally approved yet  — it is “being reviewed for approval,” <a href=\"https://www.globaltimes.cn/page/202204/1260181.shtml\"><em>Global Times </em>reports</a>.<em> </em></p><p id=\"QV3HtN\">The idea does appear to have been circulating for a while. Back in January, a white paper published by Chinese officials mentioned plans to study a planetary defense system, and last October, the country hosted a planetary defense conference, <a href=\"https://spacenews.com/china-to-conduct-asteroid-deflection-test-around-2025/\">Andrew Jones reported for <em>Space News</em></a>. The planetary defense project would also set up software to simulate asteroid impacts, and would run rehearsals of what to do in the event of a potential impact. (NASA and the European Space Agency <a href=\"https://www.theverge.com/2019/5/1/18522828/nasa-near-earth-asteroids-impact-simulation-exercise\">have held similar simulations</a>.) </p><p id=\"TetkfI\">NASA has its own asteroid-redirecting mission, which <a href=\"https://www.theverge.com/2021/11/23/22797714/nasa-dart-asteroid-planetary-defense-redirect-crash-course-launch\">took off in November</a>. But the agency isn’t targeting any potentially threatening space rocks just yet. NASA’s <a href=\"https://www.nasa.gov/planetarydefense/dart/dart-news\">Double Asteroid Redirection Test</a> (DART) is aiming for the tiny moonlet of an asteroid called Didymos. It will try to knock the space rock, called Dimorphos, off-course on September 26, 2022. Data from that impact could help inform future planetary defense efforts — just in case they are ever needed in the future. </p><p id=\"L28Mbr\">Small space rocks hit our planet every day, raining down as meteorites and dust. It’s the bigger rocks that space agencies like CNSA and NASA are more worried about. Efforts to catalog near-earth objects have already found and tracked the <a href=\"https://cneos.jpl.nasa.gov/stats/\">vast majority of large (bigger than 1 km) asteroids</a> in our vicinity. But smaller asteroids could still be catastrophic — and efforts to identify and track those chunks of rock are still ongoing. That’s why China, the US, and many other nations are interested in planetary defense — everyone wants to know not only what’s coming, but how to stop it when it does. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/efy-Durqd2VGH21Kd94FMidsRoU=/0x88:4500x2444/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23416076/DART_collision_Angle2_still.jpeg",
  "description": "The mission is part of a larger planetary defense effort.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}