{
  "title": "China releases video of spacecraft orbiting Mars for Lunar New Year",
  "url": "https://www.theverge.com/2022/1/31/22910712/china-tianwen-1-spacecraft-mars-orbiter-selfie-video",
  "date": "2022-01-31T18:49:45.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/e-K6ZUqqKtBPpHE56k0M0yMC25M=/187x0:2320x1422/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70454065/Screen_Shot_2022_01_31_at_12.31.34_PM.0.png\" />        <figcaption>Image: Screenshot from Tianwen-1 video on China Xianhu News</figcaption>    </figure>  <p id=\"uJuQ5S\">China’s first Mars orbiter, Tianwen-1, is showing off its journey around the Red Planet in a newly released selfie video ahead of the Chinese Lunar New Year. The brief clip, <a href=\"http://www.xinhuanet.com/english/20220131/3f4b2f38ef9a40dba0dcffbe225f3113/c.html\">released Monday by the China National Space Administration</a>, shows a good portion of the spacecraft’s body, engines, and solar array zooming through space, with portions of Mars’ surface appearing in the background. </p><p id=\"TvYBRF\">The Tianwen-1 orbiter has been circling Mars for nearly a year now. <a href=\"https://www.theverge.com/2020/7/22/21330251/china-tianwen-1-mars-mission-rover-lander-orbiter-long-march-5-launch\">After launching from China in July of 2020</a>, the vehicle <a href=\"https://www.theverge.com/2021/2/10/22276153/china-reaches-mars-tianwen-1-probe\">inserted itself into the planet’s orbit in February of 2021</a>. The spacecraft is China’s first mission to successfully reach the Red Planet’s orbit, making the nation one of just a handful of countries to explore Mars robotically. Tianwen-1 came to Mars bundled together with a lander and a rover, <a href=\"https://www.theverge.com/2021/5/14/22436072/china-tianwen-1-mars-landing-zhurong-rover\">both of which successfully landed on the planet’s surface in May of last year</a>.</p><div id=\"X6iiyU\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">China's Mars probe Tianwen-1 extended festival greetings to the Chinese people with stunning video footage captured by a camera on its orbiter to snap selfies above the red planet on Monday, the eve of the Chinese Lunar New Year <a href=\"https://t.co/6lCYTk7zEf\">https://t.co/6lCYTk7zEf</a> <a href=\"https://t.co/GfSe3tBZEJ\">pic.twitter.com/GfSe3tBZEJ</a></p>— China Xinhua News (@XHNews) <a href=\"https://twitter.com/XHNews/status/1488167626945748992?ref_src=twsrc%5Etfw\">January 31, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"r1lknt\">Typically, China is fairly opaque when it comes to its spaceflight missions, releasing only limited information about launches and its spacecraft. But the country has released some enticing pictures of the Tianwen-1 mission recently. This isn’t even Tianwen-1’s first selfie. In early January, the orbiter released a small spacecraft with a camera onboard, <a href=\"https://twitter.com/AJ_FI/status/1477077043435163650\">which snapped pictures of Tianwen-1</a> with a very large Mars in the background. Tianwen-1 also captured a picture of itself during its transit to Mars by releasing another spacecraft with a camera on it that <a href=\"https://twitter.com/AJ_FI/status/1477084129414074369?s=20&amp;t=5fSen7708o0S27jriI0vLA\">captured the vehicle encased in its protective shell</a>. This recent video was taken by a camera attached to Tianwen-1.</p><p id=\"mHqJRi\">Spacecraft selfies have been a delightful aspect of space missions baked into vehicles for decades. NASA’s various Mars rovers, including Curiosity and <a href=\"https://www.nasa.gov/feature/jpl/say-cheese-on-mars-perseverance-s-selfie-with-ingenuity\">Perseverance</a>, have created beautiful selfie mosaics of themselves and the Martian landscape. China’s rover also <a href=\"https://www.theverge.com/2021/6/11/22529603/china-cnsa-zhurong-rover-selfie-mars-perseverance\">snapped a picture of itself on the Martian surface</a> after its landing last year. Additionally, when NASA landed its Insight lander on Mars, the space agency sent two small satellites that rode along with the vehicle, <a href=\"https://www.nasa.gov/feature/jpl/nasa-hears-marco-cubesats-loud-and-clear-from-mars\">one of which also captured a selfie of itself while in space with Mars in the background</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yHnJjEHL0Rg4r4SkCkZXa4jFVcw=/0x55:2506x1367/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23207729/Screen_Shot_2022_01_31_at_12.31.34_PM.png",
  "description": "Getting very close with Tianwen-1",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}