{
  "title": "China casts doubt on origin of rocket debris about to slam into the Moon",
  "url": "https://www.theverge.com/2022/2/22/22945801/china-change-5-t1-rocket-debris-moon-collision-update",
  "date": "2022-02-22T19:22:18.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"A Long March 3C rocket carrying the Chan\" src=\"https://cdn.vox-cdn.com/thumbor/1kfIp2O2UiQ2kYpwYo2gRoT2ctc=/0x17:3112x2092/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70537644/104589462.0.jpg\" />        <figcaption><em>Part of a Chinese Long March 3C, shown here, is thought to be the piece of debris about to slam into the Moon in March. But China is casting doubt on that claim.</em> | Image: STR/AFP via Getty Images</figcaption>    </figure>  <p id=\"3EfDd2\">China claims that a piece of distant space debris that’s about to slam into the Moon does not stem from one of the nation’s lunar missions, as astronomers tracking the object believe. However, it’s possible that China may have mixed up which mission the debris originally came from, as most evidence points to it being an old Chinese rocket.</p><p id=\"aosDJH\">This doomed space object has received quite a lot of attention over the last few weeks, ever since an astronomer and space tracker by the name of Bill Gray first predicted that it would slam into the Moon on March 4th after years of orbiting the Earth. At first, <a href=\"https://www.theverge.com/2022/1/27/22904427/spacex-falcon-9-rocket-second-stage-moon-collision-deep-space-junk\">Gray thought the object was a leftover chunk of a SpaceX Falcon 9 rocket</a> that launched a satellite for the National Oceanic and Atmospheric Administration back in 2015. But after some follow-up analysis, Gray claimed that he was mistaken and that the debris was <a href=\"https://www.theverge.com/2022/2/13/22931817/china-change-5-t1-rocket-spacex-falcon-9-moon-collision\">actually an old rocket stage leftover from China’s Chang’e 5-T1 mission</a> from 2014, which tested out technology needed to bring samples back from the Moon.</p><div class=\"c-float-right\"><aside id=\"B4FUyY\"><q>This doomed space object has received quite a lot of attention</q></aside></div><p id=\"r1bLrH\">Gray’s conclusion that the object is a Chinese rocket has been backed up by analysis from <a href=\"https://www.washingtonpost.com/science/2022/02/16/china-moon-rocket-spacex/\">NASA’s Jet Propulsion Laboratory</a> and <a href=\"https://news.arizona.edu/story/uarizona-students-confirm-errant-rockets-chinese-origin-track-lunar-collision-course\">by a team at the University of Arizona</a>. But China is now officially weighing in on the matter and is potentially disputing American astronomers’ claims. “According to China’s monitoring, the upper stage of the Chang’e-5 mission rocket has fallen through the Earth’s atmosphere in a safe manner and burnt up completely,” Wang Wenbin, a spokesperson for China’s Ministry of Foreign Affairs, <a href=\"https://www.fmprc.gov.cn/mfa_eng/xwfw_665399/s2510_665401/2511_665403/202202/t20220221_10644075.html\">said during a press conference on Monday</a>. The statement was <a href=\"https://spacenews.com/china-claims-rocket-stage-destined-for-lunar-impact-is-not-from-its-2014-moon-mission/\">first reported by <em>Space News</em></a>.</p><p id=\"3KcsOc\">Notably, Wang said that the rocket from the <em>Chang’e-5</em> mission burned up in Earth’s atmosphere, according to a transcript of the conference. But Gray and others are claiming that the rocket is from the Chang’e 5-T1 mission, which is a separate flight altogether. Chang’e 5-T1 was a precursor mission to Chang’e-5, which did not launch until 2020. The booster from that mission did actually fall back to Earth and burn up in the atmosphere, <a href=\"https://www.projectpluto.com/temp/correct.htm#confusion\">according to a new blog post by Gray</a>.</p><p id=\"xcaXzd\">As for the booster from Chang’e 5-T1, <em>Space News</em> notes that the Space Force’s 18th Space Control Squadron — responsible for tracking space debris — says on its tracking website that it burned up in Earth’s atmosphere in October of 2015. But Gray has an explanation for that discrepancy, too. Apparently, the 18SPCS only provided one update on the rocket’s trajectory shortly after the mission launched and then never again. That means the “conclusion” that the rocket burned up is likely a prediction based on that one update, Gray says.</p><p id=\"xSbre2\">“If that’s all they had to work with, then the re-entry date is a prediction a year ahead of time and is not particularly meaningful. (Sort of like trying to predict weather a year ahead of time),” Gray writes in his blog post. <em>The Verge</em> reached out to US Space Command, which maintains the massive catalog of tracked space debris around Earth but did not receive a response in time for publication. We’ll update if we hear back.</p><div class=\"c-float-left\"><aside id=\"BnQsPd\"><q>“It would be really surprising if there were two objects as large as the one we’re tracking.”</q></aside></div><p id=\"VYflmg\">Gray says he did briefly wonder if there was maybe some other massive object that went up with the Chang’e 5-T1 mission, and that second object is causing all of this fuss now. Such a mysterious second object isn’t cataloged, though. He also says that after asking around, it seems unlikely that another object could explain what they’re seeing. “It would be really surprising if there were two objects as large as the one we’re tracking <em>and</em> the upper stage [of the Chinese rocket],” Gray tells <em>The Verge</em>. “So anybody who says that this is not the upper stage has a pretty good-sized mountain of evidence at this point to overcome.”</p><p id=\"E1PQ4f\">So, all signs seem to point to the rocket coming from China. For Gray, what all of this confusion shows is that better tracking of deep space junk is very much needed. Official tracking entities like the 18SPCS are really more focused on tracking debris in lower orbits around Earth, as they post a significant risk to satellites and other assets we rely on every day. When it comes to objects like this that were launched into deep space and have spent years in highly elongated orbits around Earth, no official agency is really keeping a look out.</p><p id=\"V69bY3\">Gray argues that entities launching objects like this should make their rockets’ positioning data publicly available and that someone — or some (probably international) agency — should maintain all of that info. And above all, some care should be given to how these objects are discarded. “Many more spacecraft are now going into high orbits, and some of them will be taking crews to the Moon,” Gray writes. “Such junk will no longer be merely an annoyance to a small group of astronomers. A few fairly simple steps would help quite a bit.”</p><p id=\"2bPIb2\">As for this object, no matter where it came from, one thing is still certain: it’s going to be dust on March 4th when it slams into the Moon.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tD6whXxkSFQFf2Pw2-2p-cqqiC8=/0x240:3112x1869/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23263409/104589462.jpg",
  "description": "It still seems likely that the object is from China, though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}