{
  "title": "Chinese astronauts return to Earth after spending six months in space",
  "url": "https://www.theverge.com/2022/4/17/23029421/chinese-astronauts-return-earth-six-months-space-shenzhou-13-tiangong-tianhe-china",
  "date": "2022-04-17T21:14:14.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Crew Members Of The Shenzhou XIII Mission Return To Earth\" src=\"https://cdn.vox-cdn.com/thumbor/nTMQRChgTi_yv2lTxH6ELaN_c24=/287x0:5176x3259/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70760341/1391865673.0.jpg\" />        <figcaption><em>The three taikonauts spent 183 days on the Tiangong space station.</em> | Photo by VCG/VCG via Getty Images</figcaption>    </figure>  <p id=\"jghxBi\">Three Chinese astronauts, also known as taikonauts, safely returned to Earth yesterday after spending six months aboard China’s unfinished Tiangong space station, according to a report from <a href=\"https://www.space.com/china-shenzhou-13-astronauts-landing-returns-to-earth\"><em>Space.com</em></a>. This is China’s second crewed mission to Tiangong and its longest so far.</p><p id=\"aQBw8O\">The Shenzhou 13 spacecraft landed in the Inner Mongolian desert at 9:56AM local time on Saturday morning, departing from the space station’s core Tianhe module about nine hours prior. The <a href=\"https://www.theverge.com/2021/10/15/22722565/china-shenzhou-13-crewed-launch-tianhe-space-station\">crew took off from the Jiuquan Satellite Launch Center</a> in the Gobi desert last October and spent a total of 183 days on the space station. </p><div class=\"c-float-right\"><aside id=\"NmgFSc\"><q>Wang Yaping made history as the first Chinese woman to conduct a spacewalk</q></aside></div><p id=\"xEGfxX\">This mission is not only China’s longest, but taikonaut Wang Yaping made history as the first Chinese woman to visit the Tianhe space station and also became the <a href=\"https://www.space.com/china-shenzhou-13-first-female-spacewalk\">first Chinese woman to conduct a spacewalk</a>. Wang was accompanied by crewmate Ye Guangfu and commander Zhai Zhigang. The trio carried out a total of two spacewalks, performed various tests around the station, as well as held two live lectures for students watching from Earth.</p><p id=\"umy06e\">Shenzhou 13 is part of <a href=\"https://www.space.com/tiangong-space-station\">11 missions China has planned</a> to finish constructing the Tiangong space station. China <a href=\"https://www.bbc.com/news/world-asia-china-56924370\">first launched the Tianhe module</a> in April 2021, and later <a href=\"https://www.theverge.com/2021/6/16/22537815/china-rocket-launch-astronauts-crew\">sent three taikonauts</a> to bring the station online. As noted by <em>Space.com</em>, the Shenzhou 14 crew is set to depart for the space station sometime in June. China plans on having the station finished by the end of the year, which will include the launch of two additional modules.</p><p id=\"5Pjvwt\">While six months aboard a space station sounds like a long time, it’s the typical timeframe for missions to the International Space Station, which China is excluded from. <a href=\"https://www.theverge.com/2022/3/29/22996778/nasa-astronaut-mark-vande-hei-russian-soyuz-return-space-station\">NASA astronaut Mark Van de Hei</a>, who just returned to Earth last month, currently holds the record for the longest consecutive stay in space at 355 days.</p><p id=\"yg78v5\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XAoF_oQqE-H5XKsAKZ5WLgiEXGA=/0x0:5176x2710/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23396170/1391865673.jpg",
  "description": "Shenzhou 13 is China’s second crewed mission to its space station.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}