{
  "title": "Chinese phone brands are carrying the torch for Europe’s biggest mobile show",
  "url": "https://www.theverge.com/2022/2/27/22950422/mwc-mobile-world-congress-2022-chinese-phone-brands-honor-oppo-huawei-tcl-poco",
  "date": "2022-02-27T15:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"SPAIN-TELECOM-MOBILE-WORLD-CONGRESS\" src=\"https://cdn.vox-cdn.com/thumbor/H0erlQbxwaTT2yhbQPDxUW_4yW8=/1x0:3964x2642/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70556670/1238355222.0.jpg\" />        <figcaption>Photo by LLUIS GENE/AFP via Getty Images</figcaption>    </figure>  <p id=\"fDYsJf\">Next week sees Mobile World Congress return to Barcelona, two years after the COVID-19 pandemic <a href=\"https://www.theverge.com/2020/2/12/21127754/mwc-2020-canceled-coronavirus-trade-show-phone-mobile-world-congress-gsma-statement\">forced the cancellation</a> of the world’s biggest mobile phone trade show, and one year after the show took place <a href=\"https://www.theverge.com/2021/5/11/22430649/samsung-mobile-world-congress-mwc-barcelona-remote-covid\">without many of its largest exhibitors</a> in attendance. Not everyone is making a return to this year’s in-person event (<a href=\"https://www.itpro.co.uk/business/business-operations/361986/sony-pulls-out-of-mwc-2022\">Sony</a>, <a href=\"https://www.cnet.com/tech/mobile/lenovo-goes-fully-virtual-for-mwc-2022/\">Lenovo</a>, and some media outlets including <em>The Verge</em> aren’t attending) but it almost feels like the show is back to full strength.</p><p id=\"LBrvN0\">But it’s also an event that’s going to show off exactly how much the smartphone industry has shifted in recent years. As it stands, all the show’s biggest hardware announcements appear likely to come from Chinese brands like Oppo, Honor, TCL, Xiaomi-sub-brand Poco, and Huawei, rather than brands from Europe, America, or even another Asian country like South Korea. </p><div class=\"c-float-right\"><aside id=\"r7gaOY\"><q>Honor plans to announce the Magic 4 at the show</q></aside></div><p id=\"EaEEBm\">Honor, for example, is planning to announce the <a href=\"https://www.gsmarena.com/honor_confirms_magic4_series_will_arrive_at_mwc-news-53180.php\">Magic 4 series at the show</a>, marking its first Western flagship smartphone launch since splitting with former parent company Huawei. Although the company released the <a href=\"https://www.theverge.com/22752483/honor-50-review-108-megapixel-quad-camera-120hz-oled-display\">mid-range Honor 50</a> globally last year, the Magic 4 is rumored to be using Qualcomm’s flagship Snapdragon 8 Gen 1 processor, making it a direct (and likely affordable) competitor to the likes of Samsung’s Galaxy S22 or the OnePlus 10.</p><p id=\"iJJd7h\">Meanwhile Oppo has said it plans to announce “<a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.oppo.com%2Fen%2Fnewsroom%2Fpress%2Foppo-will-attend-the-mwc-2022%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F27%2F22950422%2Fmwc-mobile-world-congress-2022-chinese-phone-brands-honor-oppo-huawei-tcl-poco\" rel=\"sponsored nofollow noopener\" target=\"_blank\">several high-end flagship products</a>” alongside augmented reality and 5G “R&amp;D achievements” at this year’s MWC. The company is fresh off the heels of announcing its latest flagship smartphone, the <a href=\"https://www.theverge.com/2022/2/24/22948778/oppo-find-x5-pro-announced-specs-features-camera\">Find X5 Pro</a>, last Thursday, but still intends to use this year’s show to make major announcements.</p><p id=\"d8CZZw\">Or what about TCL, which says it plans to <a href=\"https://www.techadvisor.com/news/mobile-phone/tcl-30-series-phones-3812046/\">reveal more entries in its 30 Series of smartphones</a> after announcing the first two entries, the 30 XE 5G and 30 V5G, at CES earlier this year. Or Poco, the Xiaomi sub-brand that plans to announce the <a href=\"https://www.gsmarena.com/poco_mwc_event_scheduled_for_february_28-news-53236.php\">Poco X4 Pro 5G and Poco M4 Pro</a> at an event on February 28th. Oppo spinoff Realme is promising to announce the “<a href=\"https://twitter.com/realmeglobal/status/1495684719651950594\">world’s fastest smartphone charging technology</a>” at this year’s show, which for those keeping track would need to be faster than the <a href=\"https://www.androidpolice.com/2020/07/16/realme-announces-125w-ultradart-charging-tech-which-sounds-awfully-familiar/\">125W UltraDart technology</a> it announced a couple of years ago.</p><p id=\"U1D6io\">In contrast, major phone brands outside of China have rarely shown much interest in using MWC for major consumer-facing announcements. Google has never launched a smartphone at MWC, and Apple takes the show about as seriously as it takes every other major trade show, which is to say “not very.” But even Samsung, which used MWC to announce its flagship Galaxy S smartphone <a href=\"https://www.theverge.com/mobile/2018/1/10/16873136/samsung-galaxy-s9-launch-date-february-mwc\">as recently as 2018</a>, appears to be focusing its MWC launches this year on a <a href=\"https://www.theverge.com/2022/2/17/22938681/samsung-february-27-mwc-event-galaxy-book-laptop\">humble laptop</a>. Only HMD, the Finland-headquartered company that now produces Nokia-branded smartphones, has routinely timed its <a href=\"https://www.theverge.com/circuitbreaker/2019/2/24/18234962/nokia-9-pureview-cameras-5-features-specs-multiple-price-release-date-photos-hands-on-mwc-2019\">major</a> <a href=\"https://www.theverge.com/2018/2/25/17049950/nokia-8-sirocco-release-date-pricing-mwc-2018\">product</a> <a href=\"https://www.theverge.com/2017/2/26/14741504/nokia-6-nokia-5-nokia-3-android-phones-mwc-2017\">announcements</a> with the Barcelona trade show. </p><div class=\"c-float-right\"><aside id=\"iHFHfh\"><q>HMD, which produces Nokia smartphones, is a major exception</q></aside></div><p id=\"iyLdH2\">MWC’s increasing focus on Chinese companies doesn’t mean it’s losing relevance, because these phones are more popular with customers all around the world than ever. As of last year, <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS48830822\">IDC reports</a> that three out of the top five most popular smartphone brands worldwide — Xiaomi, Oppo, and Vivo — are headquartered in China, with the number one and two spots being taken up by Samsung and Apple. It’s a similar situation in Europe specifically, where <a href=\"https://www.counterpointresearch.com/europes-fastest-growing-brand-realme/\">Counterpoint Research reports</a> that seven out of the top ten most popular smartphone brands are headquartered in China.</p><p id=\"ZgKEF4\">Instead, I think the trend is an interesting display of who has the most to gain from timing a big announcement to coincide with a crowded trade show. It’s not companies like Samsung and Apple, which have the kind of global physical presence that allows them to host big launches separately from major trade shows. But for a company like Honor or TCL, a show like MWC looks like an invaluable way to get a lot of press into one place to show off your wares. </p><p id=\"bnWCkL\">The news around MWC 2022 will almost certainly be dominated by Chinese tech brands, who are doing the best out of anyone at keeping the buzz around Europe’s biggest mobile show alive. But the more you look at it, it starts to look like good logistics.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yW3PjSdnlCoIja5t7u4ieP74-yA=/0x284:3964x2359/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270447/1238355222.jpg",
  "description": "Get ready for big news from Huawei, Honor, and Oppo.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}