{
  "title": "Chip ‘n Dale: Rescue Rangers is the sound of Disney laughing at its own meta humor",
  "url": "https://www.theverge.com/23071425/chip-n-dale-rescue-rangers-review",
  "date": "2022-05-17T16:00:00.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/87FjDIXOj-HP3RxaE5-FySheHH0=/153x0:2654x1667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70878948/CHIPNDALE_RESCUE_RANGERS_Payoff_042622.0.jpeg\" />        <figcaption>The modern day Chip and Dale. | Disney</figcaption>    </figure>  <p>The film stars John Mulaney and Andy Samberg</p> <p id=\"IcL0Mi\">Disney’s new feature-length, hybrid live-action / animated <a href=\"https://www.theverge.com/2022/2/16/22937546/disney-plus-chip-n-dale-rescue-rangers-movie-reboot\"><em>Chip ‘n Dale: Rescue Rangers</em></a><em> </em>movie from director Akiva Schaffer is the perfect example of everything that’s wonderful and terrible about Hollywood’s current era of reboots. In its frantic attempt at lighting up the warm, fuzzy nostalgia centers of your brain, <em>Chip ‘n Dale: Rescue Rangers </em>forgets that callbacks to the good old days really aren’t enough to make these sorts of big-screen reimaginings work. But what makes the movie such an odd experience to sit through is how much of its sense of humor feels like Disney trying to poke fun at itself in ways that don’t exactly work.</p><p id=\"hpHya9\">Set in a world where the <em>Rescue Rangers </em>cartoon from the late ‘80s was one of the first TV gigs Chip (John Mulaney) and Dale (Andy Samberg) landed, the live-action <em>Chip ‘n Dale </em>movie<em> </em>tells the story of how its titular pair of chipmunks first met as children and went on to become celebrities. As the only two cartoon chipmunks in their school full of larger cartoon animals and human children, Chip and Dale become fast friends whose shared love of comedy eventually leads to them becoming a relatively successful pair of performers. Following <em>Rescue Rangers</em>’ cancellation, the chipmunks’ paths split, and while Dale elects to stick it out in Hollywood, Chip ultimately decides to become an insurance salesman.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qRHiXNHNSTb96vxgXdoJJUIrSj4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23482627/CDRR_FF_003.jpeg\">      <cite>Image: Disney Enterprises</cite>  </figure><p id=\"PCx9cA\">After years of not speaking, the chipmunks are reunited when news breaks that one of their fellow original <em>Rescue Rangers</em> castmates has gone missing — a disappearance that may be connected to the string of “bootleggings” terrorizing Hollywood. Disney’s gone meta before with films like <em>Ralph Breaks the Internet </em>that jokingly acknowledged the studio’s existence as a cultural and economic juggernaut. But <em>Chip ‘n Dale</em>’s script from Dan Gregor and Doug Mand feels very much like a snapshot of this current moment where entertainment behemoths are encouraging audiences to look at their entire IP catalogs as interconnected universes and movies as crossover opportunities.</p><p id=\"Q7aREr\">The idea of classic Disney characters like <em>The Little Mermaid</em>’s Flounder being washed up has-beens who dodge bill collectors has a certain charm to it. But each of <em>Chip ‘n Dale: Rescue Rangers’ </em>self-deprecating jokes bears the unmistakable aftertaste of a megacorporation trying to get in on jokes about itself that just don’t work because they’re coming out of Disney characters’ mouths. By making fun of itself, <em>Chip ‘n Dale </em>inadvertently ends up illustrating just how powerful a company like Disney is and how easily that power can lead to overbloated nostalgia grabs that play like <a href=\"https://www.theverge.com/2022/2/15/22935445/disney-metaverse-strategy-plans-mike-white-memo\">ominous signs of metaverses to come</a>.</p><div id=\"KaEjAE\"><div ><iframe src=\"https://www.youtube.com/embed/_VKgV2txuoM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"NbVCrJ\">Visually, <em>Chip ‘n Dale </em>is a mixed bag in multiple senses of the phrase. Unlike Dale, who elects to get CGI “surgery” out of a desire to stay marketable, Chip — along with most of the movie’s animated characters — remains 2D and cell-shaded. While the characters’ different aesthetic styles generally work when they’re being presented like an ever-present sight gag about the dynamics of Chip and Dale’s world, in visually-complicated moments when characters interact, their styles sometimes clash to the point of breaking the illusion necessary for the movie to make sense.</p><p id=\"KuxF6J\">Like many reboots attempting to appeal to multiple generations of fans as well as newcomers, <em>Chip ‘n Dale: Rescue Rangers </em>feels like a story that isn’t entirely sure what it wants to be. While the core plot that pairs Chip and Dale with detective Ellie Whitfield (Kiki Layne) feels like it’s meant to be a jumping-on point for new fans, the movie also tries to give ample time to the other original Rescue Rangers: Gadget (Tress MacNeille), Zipper (Dennis Haysbert), and Monterey Jack (Eric Bana). This would all be fine were it not for the way that <em>Chip ‘n Dale</em>’s surprisingly long list of cameos and jabs at cartoons from beyond Disney’s walled garden feel like unnecessary adornments cluttering up what might otherwise have been a perfectly solid welcoming back of its main characters.</p><p id=\"7l3afA\"><em>Chip ‘n Dale: Rescue Rangers</em> hits Disney Plus on May 20th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/oGObvvB05kIBTgN1uIOYZdroKuo=/0x100:2806x1569/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23463801/CHIPNDALE_RESCUE_RANGERS_Payoff_042622.jpeg",
  "description": "The live-action Chip ‘n Dale movie is for die-hard Disney fans.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}