{
  "title": "Chris Dixon thinks web3 is the future of the internet — is it?",
  "url": "https://www.theverge.com/23020727/decoder-chris-dixon-web3-crypto-a16z-vc-silicon-valley-investing-podcast-interview",
  "date": "2022-04-12T15:47:39.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JE8g8VSE6bQ4tZw1PMRqiTMkCP4=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740220/VRG_ILLO_Decoder_ChrisDixon.0.jpg\" />        <figcaption>Chris Dixon | Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>Plus, why a16z has spent $3 billion on web3 startups</p> <p class=\"p--has-dropcap p-large-text\" id=\"Fn4qVI\">Regular listeners to <em>Decoder</em> know I’m pretty skeptical of crypto. But I want to come by that skepticism honestly, so I talk to people who are actually investing in and building crypto startups and technology. There is a lot of money, attention, and energy — both literal and metaphorical — in crypto, and I think it’s important to ask the questions and really listen to the answers. We’ve done a few of these episodes now, but this episode is a conversation I’ve wanted to have from the very beginning. </p><p id=\"klcDgO\">Chris Dixon leads crypto investing at the storied Silicon Valley venture capital firm Andreessen Horowitz, or a16z. He’s responsible for leading funding rounds for Coinbase, which went public about a year ago, the NFT marketplace OpenSea, and Yuga Labs, which is behind the <a href=\"https://www.theverge.com/2022/3/22/22991272/yuga-labs-seed-funding-a16z-bored-ape-yacht-club-bayc-metaverse-other-side\">Bored Ape Yacht Club</a>, among others. He is also a prolific user of <a href=\"https://twitter.com/cdixon\">Twitter</a>, where he posts lengthy threads about crypto and web3. He is at once one of the biggest investors in the space and its biggest booster. </p><p id=\"wVWFT5\">Chris is a smart guy who has been around the industry a long time and has seen a lot of tech hype come and go. This episode gets way into the weeds and, while we do talk over each other here and there, I think excited but respectful disagreement is in too short supply these days, so we wanted to keep all of that in the episode. </p><p id=\"Z3Z6qR\">In any case, I think it’s a good one, and no matter what side of the crypto debate you’re on, you’ll find something here that you hadn’t thought about before.</p><p id=\"ceHtT1\">OK, Chris Dixon, general partner at Andreessen Horowitz. Here we go. </p><div id=\"qq5zSU\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP6466300983\" width=\"100%\"></iframe></div><p id=\"7s2ras\"><em>This transcript has been lightly edited for clarity.</em></p><p id=\"3PGPKZ\"></p><p id=\"aFks7u\"><strong>Chris Dixon is a general partner at the storied Silicon Valley venture capital firm Andreessen Horowitz, or a16z, where he leads a16z crypto. Welcome to </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"ArjV97\">Thanks for having me.</p><p id=\"CXA6XH\"><strong>I always ask what I have come to call the </strong><em><strong>Decoder</strong></em><strong> questions about structure and decision-making, but I really want to talk about Web3 with you, so let’s do those questions as a little bit of a lightning round.</strong></p><p id=\"RlB6vH\">Sure.</p><p id=\"tdT5pI\"><strong>How is Andreessen Horowitz structured?</strong></p><p id=\"JnbXTM\">Great question. It has actually changed a lot over the recent years. When I joined the firm in 2013, it was just a traditional venture firm with a group of investors that we call general partners. Something different with our firm is that we have operating teams, which are teams whose job is to support our portfolio companies. That was a new idea from founders Ben [Horowitz] and Marc [Andreessen]; they had been entrepreneurs in the past and had wished that their VCs would do more than just provide money and advice. They wanted them to supplement their network, introduce them to people, help them recruit, and a whole bunch of different things.</p><p id=\"7u5Dmi\">They built the firm with that in mind. Over the last few years, we realized that Web3 is just so different from other areas. For example, we have a biology and healthcare fund, we have a FinTech practice, we have an enterprise software practice — there are different expertises required, different people involved, and different networks of companies. Over the last few years we really split it out, so I am part of the firm, but really run an autonomous unit.</p><p id=\"YFolBX\">Our crypto Web3 team is now at about 60 people. We are pretty significant, and that has grown a lot over the last few years. Out of those 60 people, about 15 are on the investment team; I am one of four general partners who lead investments and we have about 10 junior people under us who support. The other 45 are in our operating team, and their jobs are to help our companies with everything from recruiting talent to business development to research and computer science. </p><p id=\"OG15tv\">We have a team that helps if we are working on cutting edge problems, and we have a marketing communications team.  Security is a big issue in the space, so we also have a five-person security team who does things like audit their smart contracts. Sonal Chokshi — who built out the firm’s podcasts — just came over to our team and we are going to really ramp that up. The way we think about the comm side is not for us, but to evangelize the space and explain what are sometimes difficult concepts. We really want to make an investment in that, so we have this broad team. Our core activity is two things: We meet entrepreneurs and lead investments, and then get involved with those companies and help them out.</p><p id=\"msF7TW\"><strong>You said there are four general partners, and you have a few billion dollars in funds for crypto startups. How much is it exactly?</strong></p><p id=\"cLGvYT\">The last one was $2.2 billion, I think it is around $3 billion now.</p><p id=\"9Kner8\"><strong>Where does that money come from?</strong></p><p id=\"DccfXt\">We raise money, as our companies do. Our LPs — limited partners — are everything from university endowments to nonprofit foundations. For those who do not know, universities and nonprofits basically have two sides of the organization. There is the side that gives out money and the side that invests money. We talk to the folks who invest money. Sometimes they are high net worth friends, entrepreneurs who have been successful, and so on; it is a collection of different groups.</p><p id=\"R64nKf\">Venture capital in its modern form began probably 40 to 50 years ago, and it is often called the Yale Model. David Swensen, who ran Yale’s endowment, had the realization that they had a very long time horizon with their capital; universities operate on decades’, if not centuries’, time horizons. They had all these smart students leaving who were starting companies, and they made the connection of, “Maybe we could take that capital that is very patient, and give it to these founders who also have a long time horizon.” </p><p id=\"yFKNup\">If you invest in a venture-backed startup you may not see your money for 10 or 15 years, so you have to have a really long time horizon. That was the origin of the venture capital industry, the connection between those long-term sources of capital and the founders who had a long time horizon in what they were building.</p><p id=\"HNw4iz\"><strong>You have long-term sources of capital, you have founders who are going to build on potentially decades’ time horizons, and you, the VC, sit in the middle. How do you make decisions? This is like the classic </strong><em><strong>Decoder</strong></em><strong> question.</strong></p><div class=\"c-float-right c-float-hang\"><div id=\"hBXLwS\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"Lyq48h\">Yeah, it is a really good question. This is such an important thing in our business, because it is very easy to get wrong and I have certainly gotten it wrong. To me, the most common failure mode in investing in venture capital is decisions by committee. A group of people get together because of various politics, economics, or even social dynamics, and they all have to come to consensus on what is a good investment. In my experience, the nature of good startup investments is they generally have one thing that is amazing and a bunch of stuff that is messed up.</p><p id=\"gA7PiV\">It is just the nature of startups. They are very hard and there is a lot of stuff going on, and often going wrong. But the good ones have some magic superpower where they have some incredible breakthrough in technology, or there is some great market insight, or for whatever reason they have built a product that the market just loves. You see these things over and over. We all know Twitter, so let’s go back 10 years ago to a product that I think we and other tech people loved as an example, Twitter Fail Whale. I am sure the numbers were going up, but there were management changes and just the question, “What is the business model?” You could imagine a committee looking at that saying, “Wow, I don’t know, how do we get to consensus?” </p><p id=\"ulLB5q\">What I have learned, and the way we operate, is we have the solo decision-maker model. One of the general partners will sponsor an investment and we will have a vigorous discussion, which I think is important; you want to get to the truth and not to delude yourself. I believe it is very important to have individual decision-makers who are closest to the topic and know it the best, not have decisions by committee.</p><p id=\"Wxaxlm\">I think that is the number one failure mode in venture capital. I don’t know other areas of investment, but I am guessing it is also the failure mode for those areas, and a general failure mode in management. I believe the same way for recruiting. We have what we call the <em>Ocean’s 11</em> model; there are the people that blow stuff up and there are the people that do the backflips. If you went and tried to find an all-around great person, you would have a different group than if you went out and said, “I want to get a specialist in each area.”</p><p id=\"T8cDxL\"><strong>I just want to point out that you have just constructed a metaphor in which you are George Clooney.</strong></p><p id=\"O4jzsU\">Definitely, George Clooney or Brad Pitt.</p><p id=\"W7E0MR\"><strong>In that model, a bunch of institutions with a lot of money give you a lot of money, and you go seek out founders. How does Andreessen Horowitz make money?</strong></p><p id=\"64LjVe\">What I am about to describe is standard venture capital. There is something called carry, which is basically a percentage of the profits. We all get a salary, but that is not the significant money in the business; that is more to cover the bills and things. </p><p id=\"xdjKtA\">Let’s say someone gives us $1 billion — we have to first return that $1 billion before we make any money. We also have to return the money that we charge to pay salaries, rent, and all the other kinds of things. We have to completely pay everything back. Then above that, we take a percentage of the profits. That is how it works throughout venture capital.</p><p id=\"v2Hzfw\">It is different in hedge funds, where they have what is called mark to market. They can actually not have paid the money back, but just have the paper profits and take profits on that. I like how venture works; to me, it is like a startup. It’s very simple. You give us money and I won’t take anything until I have fully paid back every dollar I took, then on the profits, you take something. I think it is a very simple, nice model, and we are fully aligned with our investors. It’s pretty much standard across the industry.</p><p id=\"nf5Hu1\"><strong>To make it one step more granular, how does a general partner like yourself get paid?</strong></p><p id=\"2T5lpv\">Basically, we have that pool of money I just described and split it up across the team. All 62 people on our team get some percentage of that, which varies by seniority and things like that.</p><p id=\"6QR1zP\"><strong>That’s great. Those were my lightning round questions that I think are important to ask everybody. Let’s talk about Web3. Andreessen Horowitz generally is responsible for a ton of money flowing into Web3, but you are one of the solo decision-makers so you personally are responsible for a lot of it. Give me the elevator definition of Web3. I think your definition is one of the most important definitions.</strong></p><div class=\"c-float-left c-float-hang\"><aside id=\"xOYWLs\"><q>“The way I think about the history of the web is in three eras.”</q></aside></div><p id=\"rWCUkl\">The way I think about the history of the web is in three eras. The first, what we call Web1, I think of as roughly 1990 to 2005. The key feature of Web1 was that the platform that you built on was the web or on email. Even before 1990, there were open protocols designed by the government and academia. For a bunch of great accident-of-history reasons, those became the governing protocols of the early internet. I think that was a very positive thing for a number of reasons. One, I think it was good for innovation and entrepreneurship. If you were a small business, a creative person, or an entrepreneur — for example, Larry and Sergey — you built a website in the 1990s. You built up an audience, and you truly had that audience. </p><p id=\"OkvQmo\">You could not have a Twitter or Facebook or Apple step in the middle and say, “Hey, I’m going to change the algorithm. I am going to lower your reach.” Everyone who has built on top of a social network has had this experience where your reach is lowered. You could not have the economics change. There is something called the take rate, where Apple takes 30% for example, and it could not change. The rules could not change. The web had rules — you cannot put up illegal content or it would get taken down, DMCA, copyright, and all this other stuff — but they were rules built through democratic, legislative processes. There may be limits, but I think there were rules decided in the right way.</p><p id=\"vazHZp\">Then you had Web2 come along. Web2 I think of as roughly 2005 to 2020. I was involved in some of that and I think you saw some of that too, with early RSS, early social networks, and everything else. It was a really exciting time because I think people started to realize that websites could be more than just consumptive. You could be active. Instead of just reading the New York Times, you could now create a website like Facebook, Blogger, Twitter, or Tumblr, where anybody could come along and be their own publisher.</p><p id=\"ged97R\">That was the beginning of social networking. You had things like YouTube that said anyone can be a broadcaster. I think that was a really positive thing and it had this democratizing effect. It also brought these really powerful services to billions of people. Then mobile phones accelerated, and now you have billions of people who can type into their phone and read Wikipedia and watch YouTube. There were a lot of positive things, but I think there was a big negative thing with Web2: We basically handed over the power of the effective de facto control of the internet to five or so companies.</p><p id=\"ZBTGDQ\">Open protocols still exist, you can still go to websites, but effectively most of the power and most of the money on the web goes to Apple, Facebook, Amazon, Google, and maybe Twitter and a handful of other smaller companies. </p><p id=\"tFXFk9\">I will just give you one of the reasons I got into Web3. When Twitter changed their API in 2011 or so, there was a big wave of startups — including a lot of my friends — who built Twitter startups. That was a thing in 2009 and 2010, with Tweety, TweetDeck, and all sorts of API services. There was a VC firm that started that was literally only doing Twitter apps. People thought of it as the new web and a new platform, but then there was this very harsh lesson learned. For a long time Twitter did not have a client software, and at some point they decided, “Hey, we need to control. We are going to have client software, have an ad-based model, and change the API,” and that whole industry died. Same thing happened with the Facebook platform. </p><p id=\"x4naUG\">That was very influential for me, personally. The realization was that we used to build these really important platform services as protocols, but now they are being built as companies. When I first saw Bitcoin, I was less interested in the financial aspects of it, but thought architecturally it was a really interesting way to build something. In my mind, if Web3 works right — if we can do it the right way — it is the best of both worlds of Web1 and Web2. The advanced functionality that we have come to like from Web2 service is the slick user interfaces, the ability to read and write as we say, and to both consume and publish. We also have the predictability, reliability, and neutrality of Web1 protocols. Very importantly, we have the ability for creative people, businesses, and startups to reach audiences directly, and to truly have a relationship with those audiences that is not mediated by algorithms and advertising, which is where I think we are today.</p><p id=\"38VYLx\"><strong>There are like four concepts in there. You talked about protocols. There are many ways to talk about protocols at many layers of the stack. You are not talking about replacing </strong><a href=\"https://en.wikipedia.org/wiki/Transport_Layer_Security#SSL_1.0,_2.0,_and_3.0\"><strong>SSL</strong></a><strong> or </strong><a href=\"https://en.wikipedia.org/wiki/Internet_protocol_suite\"><strong>TCP/IP</strong></a><strong>, the transport layer protocols.</strong></p><p id=\"5Tr1Bg\">No, those are all great. Those are all good.</p><p id=\"c3ibH7\"><strong>You are talking about </strong><a href=\"https://en.wikipedia.org/wiki/HTTPS\"><strong>HTTPS</strong></a><strong> and </strong><a href=\"https://en.wikipedia.org/wiki/Simple_Mail_Transfer_Protocol\"><strong>SMTP</strong></a><strong> — I guess it is </strong><a href=\"https://en.wikipedia.org/wiki/Internet_Message_Access_Protocol\"><strong>IMAP</strong></a><strong> — for email. Those are protocols that people could build websites on, could build email services on, set up a server, communicate with an audience, and the audience comes to you.</strong></p><p id=\"tXjqeK\">Something that we are investing in now — and a lot of entrepreneurs are working on — are protocols similar to SMTP. Instead of just supporting email use cases, they would also support Twitter use cases or Discord use cases. They are protocols that let you build services in the same way as SMTP. It is an open protocol and no one controls it. You do a lot of IT work at the client level, with Gmail, Outlook, Superhuman, whatever it might be. Imagine a world where you could have a protocol that is similar to SMTP, but for Discord or Twitter. Then imagine you had a variety of clients that implemented in the same way you do with email. I think that would be a significant step forward for the internet.</p><p id=\"YTVVxC\"><strong>That is one layer — “Let’s build some technology.” Maybe it’s blockchain, maybe it’s not. </strong><a href=\"https://en.wikipedia.org/wiki/Mastodon_(software)\"><strong>Mastodon</strong></a><strong> exists, and that is a federated Twitter protocol that’s not the blockchain.</strong></p><p id=\"2QWOYp\">Yes, but it has not become that popular. Why is that? I would argue a lot of it is because there is no central namespace. The user experience with Mastodon is the same with <a href=\"https://en.wikipedia.org/wiki/RSS\">RSS</a>. You cannot just go by cdixon on Mastodon, you are cdixon at a server. A lot of why Twitter won is that, opposed to RSS, they had a global namespace. The problem with RSS and with Mastodon is the internet right now has no publicly owned, common database; there is no place to store that follow graph. That is why companies stepped in and said, “We’ll store it for you.” </p><p id=\"glL6wB\">Then once they stored it, they ended up having monopolistic network effects. One way to look at a blockchain is as a community-owned database. DNS and a blockchain are the only examples in the history of the internet where you had databases that a community owned, not a company. The other exception might be Wikipedia, as it is a nonprofit. I think it has its own issues with that architecture, but I am a big fan of Wikipedia. </p><p id=\"aOPFor\">That is basically my argument. We could take things like Mastodon and RSS and make them feature parity with Twitter and Facebook, if we are willing to use some of these new technologies like blockchains.</p><p id=\"hBYrGm\"><strong>That was on protocols. I could argue on the fine edges of that, but I agree that a giant global database that anyone can trust is conceptually a great thing. Then there is what you were talking about, which is user acquisition and creators monetizing their content. That seems totally divorced from protocol to me. Let’s say I make a video, and I want people to watch it. Ethereum — a giant global database that anyone can trust that is distributed — does not help me get people to watch it. Some aggregator of audience, like YouTube, is what gets people to watch it. Unless I did a marketing campaign; I can put my face on city buses to try to get people to watch my video. Those are the ways you can do it.</strong></p><p id=\"UkplYS\">The way I look at a social network is that there is a two-sided market. You can do distribution, you can do monetization. With YouTube or Spotify, it is both acquiring an audience and it is monetizing those users. In Web2 those two things are bundled. I think that there is a really interesting opportunity right now to unbundle those two things. </p><p id=\"HRN3KU\">As an example, music is a really interesting area and we have a number of investments there, so I’ll mention <a href=\"https://royal.io\">Royal</a> and <a href=\"https://www.sound.xyz\">Sound.xyz</a>. What both of those websites do is they let musicians basically create NFTs and other new sorts of digital objects musicians can use. Think of the NFT as scarce digital album art that also gives you other perks, like behind-the-scenes access in the Discord and other kinds of membership features. Sound.xyz has been live for three months and every day does two drops. These are not super well-known musicians, but thus far — we will see if it continues — it has been three months and every one of those is sold out at $10,000 a drop.</p><div class=\"c-float-left c-float-hang\"><aside id=\"glGQhC\"><q>“Most musicians pre-Covid-19 would make most of their money offline in merch and touring.”</q></aside></div><p id=\"8EqdWo\">I believe the musician keeps 95%, which is dramatically different. Contrast that with Spotify, who on their own site advertises they have 8 million musicians, and of that, only 14,000 make $50,000 or more per year. The rest make less. You talk to musicians and they will say streaming is not a very good option unless you are some mega artist. In fact, most musicians pre-Covid-19 would make most of their money offline in merch and touring. Why? You don’t have these giant Web2 machines sitting in the middle of you and your audience. </p><p id=\"DK6HLN\">I am not arguing that NFTs are magical new things that change human behavior, but they are a way for creative people to go direct to their audience and bypass these algorithmic advertising-driven feeds. Thus far, the results are really promising, and I think we are going to see a lot of new ways in which creative people monetize. As you said, that is not distribution. Think of it like Substack right now; a lot of people will build their audience on Twitter, but then they will monetize on Substack. I think it has been great for creative people.</p><p id=\"RyXoDS\"><strong>Yes, I know a lot of those people. I understand the argument. We just had </strong><a href=\"https://www.theverge.com/22999333/decoder-steve-aoki-crypto-web3-aokiverse-metaverse-music-industry-business-nft\"><strong>Steve Aoki on the show</strong></a><strong>. He is doing NFTs for exactly the reasons you described. Steve is a famous guy; he can just tweet, “I made an NFT,” and people will buy it. The unsigned musician — who is not making any money on Spotify — can go to one of your services if they hit scale, put an NFT up, and may still be in that long tail that does not make any money.</strong></p><p id=\"beZD0s\">It is early. I cannot prove a lot of these statements, but I am clearly betting on them. I think this is the chance to finally realize the “1,000 True Fans” visions. Kevin Kelly has a <a href=\"https://kk.org/thetechnium/1000-true-fans/\">famous blog post</a> from around 2002 where he mentions this great thing about the internet. For people like me, who were around for the first year of the internet, this was always the dream. You could now have someone who is into some kind of niche activity that most of the world does not love, but there are 1,000 people that really love it and are willing to patronize, buy books, and visit when there’s a talk. </p><p id=\"G2FZIx\">I believe that never happened in Web2. It did not happen because of the nature of the business models. They are very extractive — Facebook is well-known for this — and they will deliberately let you build a big organic reach, then change the algorithm to lower your reach and make you pay to get back there. They are incredibly sophisticated money extraction machines. This is why they are so profitable and so successful.</p><p id=\"VrArSw\"><strong>I understand your criticism of Facebook. But I want to get back to NFTs as a technology and blockchain as a technology. I am saying that if I am a musician that mints an NFT and puts it on Royal, what guarantees me that I am going to sell anything there? The technology does not guarantee it.</strong></p><p id=\"3uPRVY\">Well, you have to have an audience. For example, we are investors in OpenSea and they only have about 400,000 transacting users, but they did somewhere in the ballpark of $3 billion to $4 billion in sales last month. If you look at websites like Sound.xyz, they will sell out $10,000 but they only sell 30 or 40 NFTs each drop. It is the same fact that you have seen video games, they are cream-skimming the hardest-core fans. I am not saying you can’t have fans, but I think you can have a lot fewer. Some people like <em>Fortnite</em>; I have spent too much money on <em>Clash Royale</em> because I like that game. I think I am probably one of the suckers who pays all the money in <em>Clash Royale</em>. If you talk to these companies, it is like 99% do not pay anything, while 1% love it and pay a lot. I think that is basically what we are bringing with this video game model. </p><p id=\"OzHq1y\">We have an investment called Foundation, which I encourage you to check out at Foundation.app. It is much more of an artist-focused NFT site. I have bought a few artists’ NFTs myself. Sparth, when I saw his art, I was like, “That looks so cool, and it looks kind of familiar.” It turns out he was a <em>Halo</em> artist and did a lot of the graphic design for the video game, but never got his name on the box. They just do not get credit for these things. So he goes on Foundation and sells NFTs. </p><div class=\"c-float-right c-float-hang\"><aside id=\"0xMo1g\"><q>“It is this neat mix of patronage, fandom, and collecting that could not exist before.”</q></aside></div><p id=\"gSCF5x\">Look, I don’t get to hang out with <em>Halo</em> designers. I am a fan, but I do venture capital. It was cool that he DMs me, we talk, and he sent me his book. It is this neat mix of patronage, fandom, and collecting that could not exist before. If you look at the economics of these things, he does not need many people like me.  I am not saying I am giving him so much money, it is just that the Web2 money sucks so bad that it is really easy to be a dramatic improvement. </p><p id=\"rwp7kp\">In fact, we are going to do a dashboard to show this. I am pretty sure that NFT sales this year will pass all of Web2 payouts to all creative people. Facebook and Instagram pay zero rev share. They make all their money in advertising. How much goes back to the creators? </p><p id=\"VCH9Yo\"><strong>I know you think Facebook is bad, you don’t have to convince me that Facebook is bad.</strong></p><p id=\"aFKTFW\">The bar is pretty low. I think that we are going to show very quickly that musicians can make a lot more money through these methods than they can on Spotify. When they see that and they see it at scale, I think there is going to be a giant wave of a transition away from those other Web2 services. They may still use them for distribution — I don’t see Web3 replacing TikTok anytime soon — but I think we can replace a lot of these things in terms of monetization. That reduces a lot of their power and opens up the possibility for a genuine kind of replacement on the distribution side.</p><p id=\"Yd35Iz\"><strong>At the end of the day though, an NFT is a technological construct.</strong></p><p id=\"j7rndt\">Yes. It is digital ownership; you can now own a digital object.</p><p id=\"THrODF\"><strong>I just want to dive into the technology of NFTs specifically to interrogate that claim. It can contain some code and contain a pointer to something else. I have many criticisms of Web3, and somewhere at the top of the list, under climate — which we should talk about — is that the actual relationship between you buying an NFT and you acquiring a copy of a song or photo is divorced in the law.</strong></p><p id=\"hWgO8F\">It is not a copyright. You’re not buying a copy.</p><p id=\"GN54DL\"><strong>I think that is very fuzzy for many people.</strong></p><p id=\"cRPa3t\">Well, sure. Think of it this way: If you buy a painting, you are not buying the copyright.</p><p id=\"9hBK3M\"><strong>Why do I need this technology to buy a copy of a song? I don’t.</strong></p><p id=\"k2IV2i\">It is just like every other technology you use, the service can just decide to take it away on a whim. If you buy a book on Kindle, Amazon can remove it. They have done that in the past. You are renting it, you are not buying it; it says it right in the terms of service. Even if you buy an object in the video game, the video game is still going to go away in a couple years.</p><p id=\"QEo5y0\"><strong>Let’s say I set up a marketplace where some people sell me PDFs. What does the NFT give me that just sending me a PDF for money does not?</strong></p><p id=\"dNrGtU\">What you are buying is a digital object, which is a concept. I guess you can get into the philosophy of what you are buying. When I am buying a painting, it is a physical object that has value for me because of some philosophical connection. At some point, an artist made this on the page and society decided to value that in a certain way. By the way, some NFTs do convey copyrights.</p><p id=\"U4Dfgm\"><strong>I am not sure that’s true. To convey a copyright, you need a written instrument that is signed.</strong></p><p id=\"03wEtM\">Oh, it is absolutely true. We have done a lot of legal work on it and it is absolutely true, but I do think there can be some work done on the copyrights. I have analyzed a specific contract — Bored Ape’s, for example —and had lawyers do it, and there is some ambiguity in the revocability. I think that there could be improvements. One of the projects we are working on is to improve Creative Commons, like remove the ambiguity in a lot of these contracts and come up with standards. When you get an NFT that conveys a copyright, you want assurance that if the company is acquired it does not get revoked.</p><div class=\"c-float-left c-float-hang\"><aside id=\"r0Fe8F\"><q>“Let me just be clear, there are issues in any emerging space.“</q></aside></div><p id=\"gNR7z1\">Let me just be clear, there are issues in any emerging space. You alluded to the metadata critique of NFTs, that some of the data is not on-chain and some is. There are lots of ways to mitigate that. We can talk about the environmental stuff, which I think is another thing which is improving rapidly. I think there certainly are flaws today, and it can get much better with copyright stuff. I do not see it as any kind of inherent problem. I have been involved with multiple kinds of computing waves now, and every time, there are a bunch of issues. We choose to look at them as opportunities for entrepreneurs to come along and solve them.</p><p id=\"uSQ2Mm\"><strong>I’m with you there. When I hear about NFTs — and about musicians in particular — monetizing, I think it is just something they can sell directly with a lower transaction rate on a different kind of marketplace. The actual idea of it being an NFT might not be important.</strong></p><p id=\"CFMpF4\">Do you own your own domain?</p><p id=\"EXxClJ\"><strong>Yes. I am sure, like you, I have registered numerous domains.</strong></p><p id=\"3iW5or\">It is very similar to that. I own cdixon.org, and I own it because I host it at Netlify. If Netlify becomes evil, I will just switch it over to another place because I control the DNS record. An NFT is architecturally very different from other things on the internet.</p><p id=\"7mE0Hb\"><strong>Why should musicians sell me an NFT and not an MP3 file?</strong></p><p id=\"IxYKP9\">They could do both. I just think it is independent.</p><p id=\"dFOboq\"><strong>Why do we think the NFT blockchain scenario here is going to be more successful and lucrative than a music service that connects people directly to artists at high levels for MP3s?</strong></p><p id=\"hPvAiR\">Well, I think there are two things with NFTs. One, I do think architecturally it is very different from other objects on the internet, in the sense that most objects are controlled by an application and NFTs are controlled by users. It switches the polarity, and I think that is important. As we see the rise of Web3 gaming, you will see a whole different class of things where people own characters and other kinds of objects that they can take across different experiences. Instead of it being contained in an app, it is contained at the user level. There is an architectural aspect, and there is a social aspect. Why do people value wearing fashion — like Supreme T-shirts — or cars? A lot of value in the world is about showing that you are early to something, that you are high-status, and that you have great taste.</p><p id=\"pYaQYs\">NFT culture is very familiar in the offline world, just applied to the online world. Instead of just saying you were a musician’s first fan, you can now prove you were the first fan by buying their NFT. It could be wrong, but we are making the bet that people value that. Early signs show that people do value these things, in the same way they value things in the offline world that convey status or taste. There is also a community aspect to these things, like with Discords. My wife has a CryptoPunk and she goes to CryptoPunk breakfasts and CryptoPunk meetups. It is a culture.</p><div class=\"c-float-right c-float-hang\"><aside id=\"XhN6uc\"><q>“NFT culture is very familiar in the offline world, just applied to the online world.”</q></aside></div><p id=\"SnS2dL\">To me, there are two aspects that make NFTs different. One, you truly own it architecturally like you would a domain name. If you do not like how somebody is treating your NFT, you can just move it away. That is not true on the web today; everything is contained in an application or a website. Two, it allows you to have different social signals that people can see when you own something. This applies to everything from taste and status, to the fact that you are an early adopter, to whatever the particular design of the community NFT might be.</p><p id=\"UJPZd4\"><strong>I am just trying to make the connection between the technology and the community and culture. You and I were both around during the early moments for a lot of different things; the second the technology scales, the community and the culture change dramatically. I could not predict that. If I were you, I would not bet other people’s money on the current sense of community or culture being resilient to scale.</strong></p><p id=\"gZrMC7\">I view the internet today as millions of subcommunities. I think NFTs are a way for subcommunities to have cultural artifacts and create little economies within them. It is a big world, so some of the popular existing ones will go awry, but my bet is that there will be many positive communities. </p><p id=\"pF6EZ6\">Music communities are a really interesting example. People come together and they are excited. Now instead of just monetizing through streaming breadcrumbs and algorithmic feeds, they have a new way to build an economy and sell things.</p><p id=\"MPHuQp\"><strong>I am very sympathetic to the plight of musicians. I am still wondering about the idea that the blockchain is a thing that creates digital scarcity, and creates a thing you can sell and resell and append contracts to. I’m still wondering, is it the necessary technology or is it just the one that we have?</strong></p><p id=\"xTCvXM\">I obviously get criticized a lot here by critics, but this is a controversial space. What are the alternatives? The web has been around for 30 years; there have been 10,000 startups funded. I think we have run the experiment of corporate-owned networks. We know how it ends up. We are open to all sorts of different innovations, even if it is not blockchain. We have a whole firm that does non-blockchain-based investing. We always like new ideas, but a lot of the critics are like, “Why couldn’t you do this with a website and database?”</p><p id=\"IYfLo0\">First of all, I have been doing this a long time. I probably invested in that at one point; I have invested in a lot of different things. I was very involved in crowdfunding, and was a seed investor in Kickstarter. I was a true believer in that mission and still own all my Kickstarter stock. I spent years working on crowdfunding to find new ways to monetize creative activities. I think that services like Indiegogo and Patreon are valuable, but there are fundamental limits and it is time to try a different approach.</p><p id=\"am4PUg\"><strong>I have pushed hard enough on why blockchain is the technology to solve some of these problems. The biggest criticism we have both alluded to now is the climate impact. You have to use a lot of power to run a global trustless computer and database, and you need a lot of computers verifying the transactions, validating transactions, mining coins, and so on. I have yet to see a use case for this stuff that rises to the level that balances out the growing energy impact.</strong></p><p id=\"xSfeoa\">First, the energy impact is very specific to a certain type of blockchain. There are two broad types of blockchains: proof of work and proof of stake. Proof of work was pioneered by Bitcoin. The reason you need something called the civil resistance method is because these are permissionless networks. Anyone can join the network. The problem with permissionless is that somebody could take 1,000 computers and then spam the network. Bitcoin had the idea that there needs to be some price of admission, some way to prove that you are not spamming the system. Bitcoin decided to do this as proof of work, where you deliberately have to waste energy in order to join the network. That is literally what proof of work is, and it does waste a lot of energy.</p><p id=\"Nm6JZx\">Proof of stake says that instead of wasting, you just have to show you have skin in the game — by taking a certain amount of the network tokens and locking them up in escrow — and if you are dishonest, misbehave, or aren’t a good participant in the network, they take away your escrow. These are two very different methods. Ethereum came out in 2015 and from the very beginning, there was a narrative out there that there was some kind of pivot. The plan was always to upgrade for proof of stake, explicitly as Vitalik said, for energy purposes. This is on blog posts from six years ago. In the last four years we have not made a single investment in anything that was proof-of-work based. It was all proof of stake with one exception, which is Ethereum Layer 1, which today is proof-of-work based.</p><p id=\"PFHbOD\">They are in the very final stages of what is called the merge, the upgrade — which I think will happen in the next three months — where it will transition to proof of stake. There is already a proof-of-stake network running, it is just a question of flipping a switch. It has been in the works for five years, but because it is such a big network with a lot of value they have been very careful. When that finally happens, there will not be a single Web3 protocol that is proof-of-work based. Ethereum Layer 2s, Optimism, Arbitrum, zkSync, StarkWare, Solana, Celer, and Avalanche will all be proof of stakes. </p><p id=\"RGpeU5\">There are strong incentives to use clean energy, I will not go into that argument now. I think ultimately the future is proof of stake. Solana has these audited stats that a transaction in Solana is very close to a Google search in terms of energies. Although I would also point out, we do not know how much a Google search is exactly because those companies do not publish their energy stats. How much energy does Citibank use? How much does Visa use? We do not know, because they do not publish it. One of the big differences with blockchains is that they are public, so you can audit it. </p><p id=\"5DVCAJ\">I accept that criticism, but I also think it is unfair. I have read articles in <em>The Verge</em>, where they say this is a pivot from the crypto community to try to answer the question of energy use. This is not the case. The record is there that this has been a long-time effort.</p><p id=\"dzdV5R\"><strong>It’s vaporware, though. It is vapor until it ships.</strong></p><p id=\"Ux8NAf\">There are huge teams working on it. I think it will be in the next three months.</p><p id=\"Sxw9SB\"><strong>Right. I would like to buy a Rivian R1T. There is a huge company working on it and they spent $5 billion, but I can’t buy the car yet.</strong></p><p id=\"x4F7aW\">You could just be cynical about the whole thing, but there are well-intentioned people working on this with fully finished software. They are just waiting to flip a switch.</p><p id=\"tobkJM\"><strong>I am not being cynical, I am being realistic. Your prediction is three months, so you think it will be done around July 6.</strong></p><p id=\"k8NhJq\">Definitely this year, I am hoping in three months.</p><p id=\"cOOxON\"><strong>Some of the cynicism is rooted in the fact that I have heard that a lot for the past several years.</strong></p><p id=\"l3g2yf\">It is definitely not vaporware. It is very complex software, and that does get delayed sometimes.</p><p id=\"IUSDoD\"><strong>My criticism is not, “I don’t think it is ever going to happen,” but we have been hearing it is going to happen for a long time. Once you get to that point, I think some cynicism is warranted. Your prediction is a year, hopefully three months.</strong></p><p id=\"HPBDlD\">I would encourage folks to understand that there is really a difference in proof of stake and proof of work.</p><p id=\"T4SIX5\"><strong>What you just laid out is a key difference between what you might think of as Web3 and Bitcoin. You are saying Web3 is going to be built on Ethereum, and Ethereum might eventually move to proof of stake.</strong></p><p id=\"xGrgIg\">Yes. Just to be clear, there are scaled production networks that are proof of stake. This is not a theoretical concept. Cosmos, Polkadot, Solana, and Avalanche are all significant networks with significant value in communities that are all proof of stake. The only thing that has not happened yet is specifically Ethereum. It is hard because Ethereum has so many billions of dollars, they cannot screw it up. It is like fixing the airplane while it is in the air.</p><p id=\"DOQ9c9\"><strong>I asked Steve Aoki, “Why did you launch your thing on Ethereum and not Solana?” His answer was, “Ethereum is ready and Solana is not.”</strong></p><p id=\"l6y7ja\">We have a lot of companies building on Solana. It is a network effect. Ethereum is a bigger community for sure, but Solana is a real network with a lot of things being built on it.</p><p id=\"pOJmDy\"><strong>They are in competition, but the current leader of that competition is still proof of work, with a somewhat unknown switch date. We are optimistic, but it is not known.</strong></p><p id=\"W31Bft\">It’s software.</p><p id=\"vk3vwt\"><strong>All right, fair enough.</strong></p><p id=\"B5gYW2\">Software is like writing a book. If I’m writing a book and you keep asking, “When is it going to be done?” I don’t know, because it is a very complex, creative act. I believe it will be in the next few months, but I am not 100% sure.</p><p id=\"pvcWZP\"><strong>I would draw a straight line from climate impact to the real-world experience of using Web3 products right now. They are complicated, but they also have transaction fees that swing wildly. Ethereum gas fees wildly fluctuate hour to hour, and then Gary Vaynerchuck just had an NFT project where people spent more on the gas fees than the NFTs. What makes any of that usable or predictable for a mainstream consumer?</strong></p><p id=\"DjKSQG\">There are a lot of UX challenges. Some of these are specific issues, like Gary’s thing yesterday. In my view, it was just the software bugs essentially could have been mitigated, but it does happen. I think you will have a different experience if you use Phantom and Solana. Their transaction costs are a penny, and Phantom is a super-slick modern software. Ethereum right now, as you said, is a leader. I think that the wallets still need to be improved and will get much better. Everyone agrees the gas prices are a big issue, and that is where all of the software development effort is going on the Ethereum team, along with the merge. I won’t go into all the details, but over time, the various L1 upgrades will dramatically reduce the gas fees. I agree with all that.</p><p id=\"gqcS3l\">My experience early on the internet was text-based command line stuff, and having to go set up drivers on your Windows machine. The big innovation in the ‘90s and the internet was AOL realizing that you had all this stuff you had to put on your computer, so we should put it all on a CD and send it out to them. I could flip it around on you and say the fact that Web3 will pay out more to creators this year than Web2 — even though the UX has a lot of work to do — shows what the promise is. Once we fix that, it is going to be really big.</p><p id=\"C1CpTH\"><strong>I understand the problems with Spotify. We have had executives from all those companies on the show, and we have talked about those issues. What I am continuing to push on, is that in this space — with a lot of innovation, a lot of energy, a lot of money, and a lot of criticisms — maybe creator payments or Decentralized Finance [DeFi] is the thing that makes it all worth it. I do not see a mainstream application unlocking people’s brains the same way hitting play on Real Player in 1997 unlocked my brain, where I was listening to a British radio broadcast instead of the one from my FM radio.</strong></p><p id=\"PSHPO0\">I do not think it is hyperbole to say the internet is the most important invention of the last 100 years, and very likely might be the most important invention of the next 100 years. It is currently about to be controlled by five companies, and they make all the money and have all the power. I believe we need countervailing technologies that allow that power and money to be decentralized, to be sent out to the edges, to return to the first year of the web when a creator could go and build an audience and have a direct relationship with them.</p><p id=\"Y5w1Er\">To me, I cannot think of a more important issue. I understand these critics who say that the energy use is not worth it. I think it is worth it to not have the internet turn out like broadcast TV, and have CBS, NBC, and ABC. I don’t think that is a good outcome. People talk about things like the metaverse. Is the metaverse going to be architected like the web, where you can build your own part of the metaverse, have interoperable objects, and bring people together using protocols and standards? Or is it going to be a dystopian <em>Ready Player One</em> kind of thing owned by Meta?<strong> </strong>I would flip that and say, I cannot think of a more important issue in the world than the economic and governance architecture of the internet. If people have other proposals for how to fix that, I would love to hear them.</p><div><aside id=\"CBtWnq\"><q>“Is the metaverse going to be architected like the web, where you can build your own part of the metaverse, have interoperable objects, and bring people together using protocols and standards? Or is it going to be a dystopian <em>Ready Player One</em> kind of thing owned by Meta?”</q></aside></div><p id=\"G0B3c7\"><strong>Let me ask you about Meta real quick. You lead crypto investing at a firm called Andreessen Horowitz. Marc Andreessen is on the board of Meta. Is that a conflict for you?</strong></p><p id=\"LHopKC\">No. He is on the board in his personal capacity, and I have no connection to Meta. The firm has no connection to Meta beyond his personal involvement.</p><p id=\"POPx3N\"><strong>It is named after him. His name is on the door. I can tell you that Mike Bloomberg doesn’t run Bloomberg, but his name is on the door.</strong></p><p id=\"CPg2qW\">I am just telling you that I have no connection to them. I have no love lost between our team and that company. We are going to do everything we can to replace them with a new set of companies.</p><p id=\"nYumLn\"><strong>I will tell the audience a very quick story about how Chris and I first came to know each other. You were an investor in Oculus, and when Oculus sold itself to Facebook — now Meta — I could tell that you were sad about that. You were not in love with that decision. I just want to put it out there.</strong></p><p id=\"aZn4oD\">You and I talked then, and I think we were off the record, so you know my honest views on it. The reason they had to sell is basically because they did not have the money. The big thing at the time was the latency of the screens. People said, “VR makes you sick,” and they needed these special screens. The one company that made it was Samsung, and they said, “Don’t even call me if you are not going to spend $1 billion.” </p><p id=\"yJf8Ym\">We were a venture-backed company. We had just written a check for $37 million at the time, which is a big venture check, but nothing on the scale of things. They were trying to build out this whole thing, but at the time they just did not have the money. People talk about defensibility and network effects, but Samsung owns a mountain in Korea where all of the minerals come from to make those screens, so you have to go to Samsung.</p><p id=\"u7HZ5y\">The point I am making is that I agree with you. We could talk separately about VR, but I am just a hobbyist at this point. I think it is scary right now that there is no real independent VR, and that this may turn out even worse than phones, where there are just two megacorps that build credible VR. You have talked about the money in venture capital. I am really happy we do not have to do that again. We are never going to sell a company to Facebook, Google, or anybody else. We have enough money now because of the success of a number of these companies in the space, and we can truly go out and build something independent. That is a lesson I learned from Oculus and Facebook.</p><p id=\"OSkMzE\"><strong>Let me continue to push on this. You have laid out a story of the web. Web2 centralizes a bunch of cool stuff that was happening with Web1, but you are saying Web3 decentralizes it again. You are investing in a bunch of companies that are ultimately central service providers. A regular person does not want to think about the challenges we talked about, like climate, user experience, or security, and take any of that risk onto themselves. They do not want to set up their own web server, they just want to go to Tumblr or Blogger; they do not want to figure out how to transmit photos to their friends, they just want to use Google Photos or Facebook.</strong></p><p id=\"Zqw7zv\"><strong>I see the exact same thing happening in Web3. OpenSea is the dominant marketplace, and almost every app relies on their APIs. They are going to sit at the center of it. The underlying protocols may be decentralized, but I think an emerging reality and real criticism here is that at the end of the day, you, Andreessen Horowitz, are going to invest in a bunch of companies who control the user experience for a lot of people.</strong></p><p id=\"YrBjDB\">The way the OpenSea tech works, as an example, is they crawl the blockchain just like Google does, and they now support Polygon and Solana. They index the NFTs and they provide those on an API. We have an investment in an infrastructure company called Alchemy that does the exact same thing, and is the exact same API. I don’t agree. Because it is open data like the web, you will have multiple companies doing it.</p><p id=\"oXd6km\"><strong>The web is open data, but Google is dominant because it provides the best user experience. Microsoft is not a small company, they cannot make Bing compete with Google.</strong></p><p id=\"c7tzul\">Google is a very interesting case. The competition is one click away, and there are a bunch of reasons — including the data network effects — that they can do all these powerful things. There is a whole advertising side, which creates a network effect. </p><p id=\"Hhbb9V\">With Web1, I am not claiming people are going to directly interact with protocols. You did not directly go and interact with SMTP. You were mediated by client software, like Gmail — back then it was Hotmail — or Outlook. The key difference when you have a protocol there is that the user can switch. If I am hosting with Rackspace, or using email through Hotmail, and they start misbehaving and are starting to charge me too much, I can switch. That is a big difference from Twitter. I am not happy with Twitter right now, but I cannot switch. I have built an audience up over so many years, and I cannot take them with me. With Web1, you could take it with you. To me, that is the key difference.</p><p id=\"YJVzDg\">I am not denying that you will have centralized service providers in the mix to create a better experience. The key is, “Do they get such dominant network effects that users can’t switch?” Then they can abuse their position, and change the economics and the way the algorithms work. You have those centralized intermediaries in there, like an email client made by a professional software company, but the user still has the ability to exit and to switch. That keeps the companies in check and limits their power.</p><p id=\"61fY4h\">You should read [Signal founder] <a href=\"https://moxie.org/2022/01/07/web3-first-impressions.html\">Moxie Marlinspike’s blog post</a>. He is obviously a very smart, thoughtful person, but I believe that blog post missed a key point. You are always going to have centralized services in the mix, because it is just a fact that centralized companies make better user experiences than protocols do. I agree with that. I think the question is, do the network effects accrue to the company, or do they accrue to the protocol? In Web1, they accrue to the protocol, in Web2, they accrue to the company. In Web3, we are trying to architect it such that they will accrue to the protocol.</p><p id=\"PbtJKF\">We are investors in OpenSea. Obviously we think we will make money, but notice that it is a 2.5% take rate. There is nothing else in Web2 that is even close to that. They have to be 2.5%. Why? You can switch. If they raise it, they are limited in their power. Things that have offline goods like StockX and eBay, and OpenSea which has NFTs, have a much lower take rate, because they have to and you can switch. You can just go sell your sneakers somewhere else. The people that charge 100% percent are the ones where you cannot. You build an audience up on TikTok or Twitter, and you are locked in forever. That is it, they own you. They can charge whatever they want. That is the key to me.</p><p id=\"DHFH7p\">I think that is kind of a straw man argument that Moxie makes, because we are not denying it. We are investors in Coinbase, and we did great on it. If you want to get your Bitcoin somewhere else though, you can switch. That keeps them in check so they cannot act like monopolists. That is the key to me. We can build a great web, with lots of great services that have all of the advanced functionality people want from Web2, but keep monopolists in check by letting the network effects accrue to community-owned protocols instead of accruing to companies. </p><p id=\"Ons2ku\"><strong>Let’s talk about the one monopolist you cannot keep in check. You were once on the board of Coinbase, and they are public. They just put up a blog post talking about their commitment to free speech, and they do not want to be free speech martyrs. The core of it is, to get an app on the app store you have to do what Apple says. That is just a fact. That may be changing with some regulations in lawsuits, but right now that is very true. </strong></p><p id=\"AEGdpb\"><strong>If you want to sell an NFT, that is a digital good. At the end of the day, Apple is going to look at that and say, “That is a digital good, and we want 30% of that transaction.” They have not yet done it for cryptocurrencies. How does this ecosystem develop apps on the phone that let people transact without paying Apple 30% for everything? MetaMask does not let you buy anything, and OpenSea does not let you buy anything on the iPhone.</strong></p><div class=\"c-float-right c-float-hang\"><aside id=\"JOzxmp\"><q>“The idea that a hardware provider can charge 30% to every single software provider on their platform just seems like a crazy and unhealthy situation to me.”</q></aside></div><p id=\"MBmZBB\">My broader editorial view would be that I am very much on the <a href=\"https://www.theverge.com/2021/9/12/22667694/epic-v-apple-trial-fortnite-judge-yvonne-gonzalez-rogers-final-ruling-injunction-breakdown\">side of Epic on that lawsuit</a>. Forget about Web3 for a minute. The idea that a hardware provider can charge 30% to every single software provider on their platform just seems like a crazy and unhealthy situation to me, that you cannot have alternative app stores, or other choices for app developers and consumers. There are not many businesses in the world that can sustain a 30% tax. That is significantly limiting. I am generally an optimist about free market solving these things, which I know is a minority view these days. I do not think that is the case with phones. You may just need regulatory interventions.</p><p id=\"yY4Hv8\"><strong>Can OpenSea hit scale without being able to transact on the phone?</strong></p><p id=\"VR9ey0\">I think that Apple will come around on some of this. Some of these things are technical issues. Apple wants to allow for chargebacks, and it is very hard with crypto because it is non-revocable if you sell an NFT. What if you buy an NFT, you sell it, and then you say, “Hey, I want a chargeback?” Companies like Stripe and other payment providers are solving that. I really hope that at some point we, the community, can convince them that it is not a good policy. I do not think Apple particularly loves some of these social networks. If we show this is a significant revenue stream for musicians, as I talked about before, I think that can be compelling. </p><p id=\"v6B60Y\">I think Apple is a company that genuinely values user privacy and genuinely values creative work. Of the big companies, Apple is by far my favorite, as you can tell. They sell a product with an honest business model, and there is no surveillance and advertising. They do have too much power, but I think overall, they do support creative people and do not like the surveillance internet that we have developed. My hope is that we, the community, can convince them that this is a technology that actually is aligned with some of their goals. If we can do that, they might loosen up their policies. That is a longer-term challenge.</p><p id=\"4jYk80\"><strong>One blocker is that ex copyright lawyers, like me, come and talk to you about whether you have to have a written conveyance that is signed to move a Bored Ape.</strong></p><p id=\"hRKurc\">I did not realize you are an ex copyright. I was arguing with a copyright lawyer on that one.</p><p id=\"JoiTaw\"><strong>I keep it under. I wasn’t any good at it, as you can tell. The other blocker is that the biggest computing platform that you can think of is mobile phones, and the companies that control those operating systems restrict the sale of digital goods unless you pay the tax. Is that on your brain as something that you have to overcome? You are not going to get everybody unless you get on the phones.</strong></p><p id=\"gbFjgc\">For sure. I agree. I think that is definitely something. I have gone to Apple many times and presented. I have tried to argue the things that I am arguing with you today. This is a positive thing that is aligned with them.</p><p id=\"N5o5lC\"><strong>Then you’re like, “Look at my </strong><em><strong>Candy Crush</strong></em><strong> purchases alone. I will support you.”</strong></p><p id=\"3FqySv\">Right. We are constantly working on it, from being here today to explain my point of view, to trying to have one-on-one sessions explaining how this technology is going to be aligned with people. I do not think a venture capital firm ultimately solves these things. If you look at the history of tech, the way these things tend to get solved is killer products. Entrepreneurs build great products, and those great products convince people.</p><p id=\"HlS8zj\">Maybe an Apple exec comes home and sees their kid doing some cool thing in Web3, and that is how it spreads. One of the things that is really encouraging is that up until recently, Web3 was dominated by super hardcore tech enthusiasts, but we have seen a dramatic change in the kind of entrepreneurs entering the space. I liken it to mobile. The iPhone came out in 2007, then the App Store in 2008. There is usually a year-long period where people are figuring out what to do, with things like flashlight apps. Then you had this two- or three-year period where the real great entrepreneurs entered, and you had Snapchat, Uber, and Instagram.</p><p id=\"rjtNxs\">Most of the popular apps on mobile today, outside of maybe TikTok, were built in this golden period between 2009 to 2011. What it really takes is a new influx of entrepreneurs, and I believe we might be entering that space now in Web3. The level of entrepreneurs entering has gone up dramatically. I have friends who aren’t even interested in Web3, they are just generalist tech investors, and they tell me 50% to 75% of their pitches now are Web3. I hear this over and over. From a talent perspective it has just taken over, which is what we need now. You get the talent and the killer apps, and you start to really show people the potential of the technology and change minds.</p><p id=\"OVNwob\"><strong>Casey Newton and Liz Lopatto will kill me if I don’t ask you about the investment into Yuga Labs and Bored Ape Yacht Club. I will just ask a very simple question. You invested $450 million into Yuga Labs?</strong></p><p id=\"FXFLsO\">We did not, that was the total round.</p><p id=\"GIVt3c\"><strong>The total round, sure. So how much did Andreessen invest?</strong></p><p id=\"cyuIjj\">I do not think we are allowed to disclose that.</p><p id=\"5Spguc\"><strong>Sure, so let’s just say it is some huge number. We will use $450 million. That is all the investors, and I will just bundle you together for that. In the standard sort of venture model, you want 10 to 30x returns for a hit. That implies that you are going to get $4.5 billion to $13.5 billion back. What do you see that generates that valuation when that company exits?</strong></p><p id=\"GN6a0M\">There are a bunch of really special things about that community. I think what they have done is sort of a cultural phenomenon. The community, the buzz, they have has all sorts of offshoot companies. One really cool one is called Jenkins the Valet, which is a group of people who bought an NFT, a Bored Ape, and now they are going out and creating a whole story with books, movies, and all sorts of other things around that community. I am actually in LA right now, doing a lot of stuff related to Web3. The Hollywood media world is very excited about Web3 for a variety of reasons. They just understand NFTs — selling emotion and stories — in a way that a lot of traditional tech people did not. I think they also do not love Web2 and are open to new architectures.</p><p id=\"TEV552\">I am really excited about an idea we call decentralized content creation, decentralized storytelling. The next Disney or Marvel would not come top-down from a company. It would come from an internet community who comes together using NFTs, tokens, and other kinds of Web3 concepts to create stories and characters, and would actually own parts of those characters and have control over them. Instead of having to sit there on the sidelines and debate what should be canon on the next Star Wars, they can actually decide that as a community. In the same way that Wikipedia took an activity that was traditionally centralized, like encyclopedia creation, and made it community-controlled. This to me is the ultimate power of the internet. </p><p id=\"pcz5qc\">Decentralized content creation is an area that has a very rich ecosystem around the Bored Apes community. There are going to be games and metaverse experiences. They are taking a very enthusiastic core community and expanding it much more broadly.</p><p id=\"Jk86Ay\"><strong>I just want to ask two things. We started this whole thing and I asked you how you make decisions, and you said, “Single decision-makers make better decisions than communities.” If I had to point to creative work, I know for a fact that single creatives or small teams of creatives make better decisions than committees. One need only look at Hollywood itself for this. Why do we think that is going to produce better work? Why do we think that will produce the next Disney or Marvel?</strong></p><p id=\"aKmMKf\">I do not think the architecture is going to be 100 people all equally doing stuff. I think there could still be hierarchy, but it can be bottoms-up emerging hierarchy. Do you think the current system of, “You have to move to LA, wait tables for eight years, and have the right connections to get your screenplay read” is optimal?</p><p id=\"ZJgIh5\"><strong>No, but if I had to give you the argument for Web2, it is that it provided a dramatic counterbalance to the current system that enabled many more people to participate.</strong></p><p id=\"pTMS7Y\">I agree. I think Web2 improved on it, but I do not think it has actually changed the way that the economics and governance in Hollywood actually work. I think the idea that you could have fans that truly have participation and ownership in communities and storytelling is really exciting.</p><p id=\"Ix6yjw\"><strong>I would just argue that Netflix is a success, and part of the reason is because it famously lets directors and showrunners do what they want, without undue burden from the studio.</strong></p><p id=\"lcjY9H\">I have never created a TV show. I  do have friends who have, and they tell me they have significant groups of writer’s rooms and that it is a very collaborative process with a group of people. I do not think that in those writers’ rooms everyone has equal say, but I think that they appreciate having a diversity of inputs. Then maybe you have a few key decision-makers.</p><p id=\"117OJL\"><strong>Do you think that somehow this model will create $4.5 to $13.5 billion dollars worth of value?</strong></p><p id=\"LYIhEQ\">We have a portfolio, and when we make an investment, we say, “If this goes right, could it be 10X-plus? Do we think it is a great team? Do we think it is a big idea? Do we think they are building it in the right way?” If those are all yes, we make the investment. Some will work out and some will not; if we are good, a significant portion will work. I am not saying it is guaranteed to work, but I think it is compelling. I think it is a big vision, and the team is great.</p><p id=\"HD0T5V\"><strong>The structure of that deal is wild. There is a new coin called ApeCoin, and it is controlled by a Dow. The Dow is not part of Yuga Labs, but Yuga Labs gifted it. They own the Ape now and they have issued a lot of the coin. You got a bunch of the coin, like 15% to investors, and Yuga Labs owns 25%. That is just a very complicated deal structure to me. At the end of the day, you ended up with a bunch of tokens that are going to increase in value right away. Doesn’t that feel like you already have a stock or a security of some kind?</strong></p><p id=\"3gXxSH\">Let’s briefly talk about securities laws. There are many assets in the world; there are commodities such as oil, gold, baseball cards, and art. A subset of assets in the world are called securities. There has been a hundred years of case law, and the most famous Supreme Court case is <a href=\"https://en.wikipedia.org/wiki/SEC_v._W._J._Howey_Co.\"><em>SEC v Howey Co.</em></a> There is this thing called the Howey Test, and there are five factors for determining if something is a security. One of the important factors is that you have a group of managers who have significant asymmetric information that needs to be disclosed to the public. That is why you have all the securities laws based around disclosure and fraud. Our general view is that the goals of the SEC and the goals of the Web3 community are actually aligned, for different reasons.</p><div class=\"c-float-left c-float-hang\"><aside id=\"HaoiIv\"><q>“The Web3 community wants to remove pockets of asymmetric power.”</q></aside></div><p id=\"06WDv5\">The Web3 community wants to remove pockets of asymmetric power, and the SEC wants to remove pockets of asymmetric information. Something like Bitcoin is so decentralized at this point. We do not even know who Satoshi is. There is some core development team, but I do not think anyone credibly thinks that they actually have knowledge that influences the price of Bitcoin. It has been deemed by various regulators to be a commodity, similar to something like oil or gold. There are certainly people in the world who are experts in gold, people that run gold mining companies, people that have hedge funds that try to predict the price of gold, and use satellite imagery and all sorts of other things. Ultimately there is no gold management company, there is no Tim Cook of gold. There is no one who knows the quarterly earnings next month.</p><p id=\"GhZ0jy\">We have a six-person legal team, including a bunch of former regulators and other people. We have done a lot of work thinking about these topics, and guiding our companies to make sure they build these things in the right way, such that they are truly decentralized networks. There is no way for them to take power back, and there is no asymmetric information, such that they violate securities laws. </p><p id=\"NCzRoT\">I think the fortunate thing is that securities laws and the ethos of Web3 happen to align, and that they both want highly decentralized networks. We try to encourage people when they are in this space to build it in the right way — similar to Bitcoin and Ethereum — where it is truly owned and operated by the community, and not by the original creators of the system. Ideally, everybody is 100% aligned by owning tokens. Ultimately, many of these projects should not even have companies, they should just be like Linux.</p><p id=\"7Fnvsw\"><strong>There is one guy who is really important to Linux.</strong></p><p id=\"Vtm2tj\">Open-source software is generally created by communities. I think that these crypto projects, these Web3 projects, should ultimately be services that are owned and operated by the communities, and the companies should dissolve over time. That is my general view.</p><p id=\"aXEzfY\"><strong>That is the vision of progressive decentralization.</strong></p><p id=\"7RoGSg\">It is hard to get there overnight, but there are a whole set of safeguards that you can put on legally. With Bitcoin itself, Satoshi was on the forums coding for the first two years before they disappeared. At first, it is very hard because people look at you like you are crazy, and they are not going to join your projects. There are often people working in the early stages.</p><p id=\"XKNEqO\"><strong>Let me make the direct open-source software comparison then, because you brought up Linux and flagged it in my head. Do you think Yuga Labs should go away and ApeCoin should become its own protocol? We started with protocols and user experiences and how they are different, so apply that to the Bored Ape Yacht Club.</strong></p><p id=\"2Xgfvp\">We do not run the companies, and the projects will do what they want to do. There may be some companies building client software, or a foundation that guides it like the Linux Foundation, but I would like to see a world where these are simply open protocols, and there are no companies. To me, that is the strong form of this whole thesis.</p><p id=\"ztvl5S\"><strong>We are talking about financializing culture in a very deep and meaningful way; we are talking about coins, securities, tokens, and buying things. If I am a kid on the internet right now, I do not have a lot of money. The income streams for artists may be bad, but I have access to culture in a remarkably open way that never existed before. That doesn’t get you 1,000 true fans — that could get you 1 million true fans around the world. For example, K-pop is a phenomenon that exists because of the internet. If you start gating that with money, tokens, and special privileges, haven’t you created an ecosystem of landlords of culture that only allow rich people to participate?</strong></p><p id=\"EFkADL\">I think it is the opposite. Look at gaming. I think gaming is always five to 10 years ahead of every form of media, and that goes back to when they were very early on the internet. You had things like Steam and digital distribution. Technically and creatively, games have become the center of culture in a lot of ways. The dominant model now is the <em>League of Legends</em> or <em>Fortnite</em> model, where you get the game for free, they still make a ton of money, but they do it by monetizing a different layer of the stack. They monetize the status layer. Why do you buy the bunny suit in <em>Fortnite</em>? Why do you buy the wolf cloak in <em>League of Legends</em>? It’s high status, it’s funny, or it’s cool. You know that in those games, everything is cosmetic.</p><p id=\"jtsWXt\">You are not buying anything that makes you better, but <em>Fortnite</em> makes $2 billion a year on cosmetic goods. Let’s talk about streaming. You might have thought that because of their business model, that video games would reduce sharing. In fact, it is the opposite. All the video game companies lean into streaming. Nintendo fought it for a long time because it was a violation of copyright, but they realized the marketing benefits outweigh the scarcity copyright argument.</p><p id=\"2xCxAk\">I would say gaming is freer and more open than ever, and yet makes the most money because they monetize a different layer of the stack. To me, NFTs are very similar. It is virtual goods for the rest of the internet. They are going to let musicians monetize the way <em>Fortnite</em> monetizes. So just give away your music, because I think ultimately that will be the dominant model. We are not pushing that on anybody, to be clear, but I think people will opt for that. Do all the things the video game world does: give it away, have it stream, have it remixed, have mods, make it as popular as possible, get it embedded in culture, and then monetize the status layer, the NFT layer, the virtual good layer. Video games figured this out; this is not that revolutionary. It just gives that technology to everybody else, so I think it will only make media more open. Now that you have a new business model, I think it will let more people pursue creative assets. How many visual designers are stuck at Pepsi doing the 8,000th stupid Pepsi ad, when they could be out doing cool art or something?</p><p id=\"T5wRv2\"><strong>We just learned Pepsi is not an a16z LP. I will end here, because this connects directly to the Steve Aoki episode. He proposed the same thing, and my question to him was, “You are a huge musician. Are you telling me music itself will not be valuable? That it will carry no intrinsic value, and will all be marketing for something else that is worth money?”</strong></p><p id=\"lHaL5W\">That is like saying the video game does not have value. Of course it has value.</p><p id=\"Odn8gH\"><strong>You are telling me all the music will be free, and people will not transact for music.</strong></p><p id=\"Kf43L1\">Video games are free, but it does not mean video games are valueless.</p><p id=\"PNdMLm\"><strong>Video games are like a shopping mall now, and you buy clothes in them. Music is not that thing.</strong></p><p id=\"LOrPIx\">I do not think they are like shopping. <em>League of Legends</em> and <em>Fortnite</em> are great games, and they are free. I don’t agree with you.</p><p id=\"MyQ5dd\"><strong>They are transaction platforms, in a way that a song is not.</strong></p><p id=\"y4geLT\">They just realized that it is better to have it be incredibly popular and spread around the world. The internet is a giant meme propagation machine. You can try to fight it, but it turns out that is not the best strategy. Let it do its thing and monetize the status layer. This is why video games have become the center of culture and are a $150 billion a year business; $60 billion of that is virtual goods, whereas the entire music industry is around $20 billion. </p><p id=\"lW5na2\">Money is important because it goes to fund those musicians, and you could have more people pursuing their passions, as they should be. This should be a golden period for creative people on the internet. You push a button and six billion people have access. The only reason that it is not right now, is because it is mediated by these five companies with algorithms and advertisements that are designed to extract as much money as possible. Seeing the 18th Hawaiian vacation ad in my music feed is not helpful for anybody, and I do not see the societal value of that. People who listen may not like video games, but I think we are in a video game golden period. They are mostly free because they figured out this other way to monetize. We should run with that.</p><p id=\"xmKFLB\">By the way, I am not 100% sure about any of this stuff, but I think it is an experiment worth running. We are going to try to fund people to run that experiment. I guess I would just ask the audience to be open-minded about whether that is an experiment worth running. They do not have to believe everything I said today, but it is an important topic as to how the internet is structured — economically and governance-wise — over the coming decades.</p><p id=\"IKeriL\"><strong>I think that is an amazing place to leave it. Chris, thank you so much for coming on, for engaging, and taking on the questions. I appreciate it. We will have you back in three months when Ethereum goes to proof of stake.</strong></p><p class=\"c-end-para\" id=\"HbOmOu\">All right. Thanks Nilay, it was good to see you.</p><aside id=\"k7vJMN\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe now!\",\"url\":\"https://pod.link/decoder\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/qSwUp4I7Dty68PLiBi6vAPzlBwg=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382395/VRG_ILLO_Decoder_ChrisDixon.jpg",
  "description": "Plus, why his VC firm Andreessen Horowitz has spent $3 billion on web3 startups.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}