{
  "title": "Chris Novak, Xbox’s head of research and design, is leaving after nearly 20 years",
  "url": "https://www.theverge.com/2022/4/19/23032758/chris-novak-xbox-head-of-research-design-leaving-microsoft-20-years",
  "date": "2022-04-19T22:27:14.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"The Xbox X in a circle logo against a dark background with green lines.\" src=\"https://cdn.vox-cdn.com/thumbor/IHeJKEqkwQuJONOYcJm6QT0e028=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70768926/acastro_190530_1777_xbox_0002.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"9PuRlh\">Chris Novak, Xbox’s head of research and design who has been at Microsoft for nearly 20 years, is leaving the company, he announced Tuesday on LinkedIn. In his current role, which he’s had for more than five years, he led the user experience for things like Xbox Game Pass, Xbox Cloud Gaming, and Xbox Live, according to his LinkedIn. At Microsoft, he also held the roles of design architect and design director.</p><p id=\"embySp\">“I have loved my time with Xbox,” Novak said <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6922270276734902272/?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A6922270276734902272%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29\">in a post on LinkedIn</a>. “Building end-to-end experiences for gamers is a privilege. There are very few things one gets to work on in life which evoke such passion in people around the world. I adore listening to gamers and envisioning that next moment of unexpected delight. Gaming is amazing. Xbox will always be with me.”</p><p id=\"roxgxV\">Novak shared more about his career at the company <a href=\"https://www.polygon.com/23032055/xbox-chris-novak-exiting-resigns-microsoft-20-years\">in an interview with <em>Polygon</em></a> published Tuesday, which I recommend you read in full. “Microsoft has been where I’ve gotten to learn in the crucible of gaming, from the world’s best across the industry,” Novak said to <em>Polygon</em>. “I’ve got to see it in its best times and its worst times. And that learning process, I tremendously treasure.”</p><p id=\"lVQ2Dv\">Novak has also spoken with <em>The Verge</em> <a href=\"https://www.theverge.com/2015/12/10/9880594/microsoft-xbox-games-2016-interview-crackdown-3-quantum-break-recore\">in the past</a>, including a discussion of the <a href=\"https://www.theverge.com/2017/10/5/16426122/microsoft-xbox-one-dashboard-design-ui-refresh-interview-customization\">challenges of making console interfaces</a>. While the change could be a blow to Microsoft, I think he leaves Xbox in a good place. Microsoft does have some ground to cover to catch up to Sony, but products like the ones Novak worked on put the company in a strong position to compete.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/91kzfzXtVCJeiAe0rbOxyF-YApM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16309943/acastro_190530_1777_xbox_0002.0.jpg",
  "description": "\"I have loved my time with Xbox.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}