{
  "title": "Chrome OS 100 brings new Launcher design to Chromebooks",
  "url": "https://www.theverge.com/2022/3/30/23003295/chrome-os-100-version-features-google",
  "date": "2022-03-30T17:40:42.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PNF_HhfxHlF9pydbfNWUy81FHm4=/0x60:1228x879/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70690393/Text_Dictation_Editing.0.png\" />    </figure>  <p id=\"B3sPpp\"><a href=\"https://www.theverge.com/2022/3/30/23002780/chrome-browser-version-100-features\">Like its Chrome browser counterpart</a>, Chrome OS has finally reached its 100th version. Google fully updates its operating system <a href=\"https://support.google.com/chrome/a/answer/3168106?hl=en#:~:text=As%20a%20Chrome%20administrator%2C%20you,happen%20every%202%E2%80%933%20weeks.\">every four weeks or so</a>. The new release comes with a new design for Chrome OS’s launcher meant to make it more intuitive and customizable for Chromebook users.</p><p id=\"YwZ9J7\">The launcher (for Windows users, it’s the equivalent of the start menu) has a friendlier design than previous launchers have, with more rounded corners. It now opens from the side of the screen rather than the center. (This is around where the Windows start menu was for ages — it has, funnily enough, moved to the center in Windows 11). </p><p id=\"X8jqkF\">There are new options for sorting icons as well — you can manually arrange them and can organize them by name or color. The search bar will show more detailed previews from Google as you type and can search between Chrome your tabs if you have a bunch open.</p><p id=\"9zCZcr\">This launcher has been floating around for a while; it was spotted in the here-be-dragons Canary channel last summer. Its early days had <a href=\"https://www.androidpolice.com/2021/06/02/chrome-os-is-testing-a-new-launcher-with-old-vibes/\">some kinks</a>, which Google has presumably had ample time to work out.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lERH0qDJWiTX9YxKNMPDD-P5Bls=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23355574/Screen_Shot_2022_03_30_at_12.59.36_PM.png\">  </figure><p id=\"x7VmJc\">Other updates coming to Chrome OS include a new dictation edit feature — you can now say “delete” while dictating to delete the previous letter you typed or “move to next character” to make your cursor hop a letter forward — GIF creation in the camera app, YouTube supervision in Family Link, and a new YouTube app with offline access. For IT administrators, Google’s Admin console has a new report “for a quick look at which devices need attention.”</p><p id=\"GYBB23\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Nna5t4AQy4hfsBKdjA8nJtHmul8=/0x148:1228x791/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23355532/Text_Dictation_Editing.png",
  "description": "You can also make GIFs in the camera app.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}