{
  "title": "Chrono Cross remains strange and spellbinding in new remaster",
  "url": "https://www.theverge.com/23012990/chrono-cross-remastered-review-ps4-xbox-switch",
  "date": "2022-04-07T13:30:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Glu82aVw6m9EES0W4eIhlVrYpBc=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70720971/CC_TRDE_03.0.jpg\" />    </figure>  <p id=\"1SBblT\"><em>Chrono Cross</em> got off to a, let’s say, difficult start. It was billed as a follow-up to <em>Chrono Trigger</em>, one of the most beloved role-playing games ever created, but while the two take place in the same world, there are some big differences. <em>Chrono Trigger</em> was created by a superteam of developers including <a href=\"https://www.theverge.com/games/2021/3/2/22309074/fantasian-diorama-rpg-apple-arcade-hironobu-sakaguchi\"><em>Final Fantasy</em> mastermind Hironobu Sakaguchi</a>, <a href=\"https://www.theverge.com/2018/8/27/17787902/dragon-quest-11-yuji-horii-interview\">long-time <em>Dragon Quest</em> steward Yuji Horii</a>, and <em>Dragon Ball</em> creator Akira Toriyama. It’s frequently cited as one of the greatest games ever made. That all-star team didn’t continue on with the series, and though <em>Chrono Cross</em> was largely well-received at launch, its legacy never reached the same heights as its predecessor. It’s always been that weird follow-up with parallel worlds, a confusing story, and far too many characters.</p><p id=\"2pNF91\">Which brings us to the new remaster on the Nintendo Switch, Xbox One, PC, and PS4. Dubbed <em>Chrono Cross: The Radical Dreamers Edition</em>, the release is a fairly light update to the PlayStation-era version, with upgraded visuals, some quality-of-life features, and the inclusion of a long-lost text adventure. In terms of scope, it’s similar to <a href=\"https://www.theverge.com/2019/9/3/20847283/final-fantasy-8-remaster-switch-xbox-ps4-yoshinori-kitase-interview\">the remaster of <em>Final Fantasy VIII</em></a><em> </em>that Square Enix released a few years back. And just like <em>FFVIII</em>, <em>Chrono Cross</em> is an often-disparaged follow-up that could do with a second chance.</p><p id=\"LwDzEY\"><em>Chrono Cross</em> isn’t a direct sequel to <em>Trigger</em> but rather a sort of spiritual successor that takes place in the same universe. The core conceit of the game’s fantasy world is the idea of parallel worlds. At the outset, protagonist Serge finds himself in a nearly-identical version of his own world with one key difference: in this one he died at a young age. The story then gets extremely strange and convoluted from there, involving everything from an evil talking panther to a powerful supercomputer. Serge jumps back and forth between worlds, recruiting new team members (there are an astounding 45 playable characters) in an attempt to learn the mysteries of his past and the different worlds.</p><div id=\"nkEYcU\"><div data-anthem-component=\"imageslider:11131316\"></div></div><p id=\"qzvV6Q\">The story can be hard to follow, even by Japanese RPG standards, but it had just enough mystery to keep pushing me forward. This is particularly true of the characters you’ll meet; many are underdeveloped, likely due to the sheer size of the cast, but discovering and meeting new team members is one of the highlights of the game.</p><p id=\"RW45X1\"><em>Chrono Cross </em>has a lot else going for it. The strange world is a fascinating place to explore, an intriguing mix of fantasy and science fiction filled with beautiful pre-rendered backgrounds. The game has an interesting twist on classic turn-based battles, with a stamina system that forces you to make important decisions about how you’ll use your available actions, and a take on magic that works a lot like materia in <em>Final Fantasy VII</em>.</p><p id=\"sytDFk\">And, my goodness, the soundtrack is one of the best of all video games, a gorgeous collection from Yasunori Mitsuda that includes one of my favorite compositions ever, “<a href=\"https://open.spotify.com/track/5sawyhIAWf23HYNgiIyBsc\">Shore of Dreams (Another World)</a>”. When that song starts playing on the overworld map, I always have to stop and listen for a minute or two. (In fact, I’m listening to it right now as I write this.) There’s a very distinct flavor to PlayStation-era RPGs that (<a href=\"https://www.theverge.com/22383403/fantasian-review-apple-arcade-rpg-iphone-ipad\">mostly</a>) doesn’t exist anymore, but it’s captured perfectly in <em>Chrono Cross</em>.</p><p id=\"3lGr8Z\">This is all true of the remaster, but with a few tweaks. The most obvious is the upgraded visuals; the character models now look sharper and clearer while, in contrast, the pre-rendered backdrops now have a painterly, almost impressionistic vibe. (The developers used a combination of AI upscaling and manual restoration to achieve the effect.) I actually like the contrast, but it’s definitely a choice that might not appeal to everyone. You also have the option to switch back to the original 32-bit graphics though, annoyingly, swapping between visual styles requires a complete restart of the game. The CG cutscenes also retain their original look, which can be a bit jarring if you’re playing with the more modern-looking graphics option on.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TFkQKThkMHwc8Du8brYCNbrKX7Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371060/CC_TRDE_RD_2.png\">      <figcaption><em>Radical Dreamers.</em></figcaption>  </figure><p id=\"Ew6i1W\">Other quality-of-life tweaks include a fast forward option and an auto-battle mode so you can focus on story and exploration. These are nice, particularly to speed past some of the more tedious sections of the game, but the remaster is definitely missing a manual save feature. I’ve been playing on the Switch, and there are some long gaps between save points that make the game feel more punishing than it needs to be.</p><p id=\"ycneoE\">Perhaps the most interesting addition is a little-known game called <em>Radical Dreamers</em>. It was a visual novel that launched in 1996 exclusively on the Japan-only Satellaview, an add-on for the Super Famicom. It’s a visual novel that was billed as a side-story to <em>Chrono Trigger</em>, but it also sets up a lot of the premise and characters in the follow-up. Essentially, it serves as a very welcome bridge between <em>Trigger</em> and <em>Cross</em>, and now it’s available with an official English translation for the first time.</p><p id=\"jYILZi\">Square Enix could’ve definitely done more to celebrate <em>Chrono Cross</em> in this package (making <em>Chrono Trigger</em> available on the Switch would also be a nice touch for completionists). But even in a no-frills package, <em>Chrono Cross</em> remains a great game. And the things that made it stand out initially — that complex narrative, the huge cast, the oddly compelling world — are what keep it interesting more than two decades later.</p><p id=\"wJhfHm\"><small>Chrono Cross: The Radical Dreamers Edition</small><small><em> is available now on the Nintendo Switch, Xbox One, PC, and PS4.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HN8PA5R82_8N8AVT_0OkWGK5bDk=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23370829/CC_TRDE_03.jpg",
  "description": "The soundtrack is still incredible.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}