{
  "title": "Chrome is changing its logo for the first time in eight years",
  "url": "https://www.theverge.com/2022/2/5/22919398/chrome-logo-change-eight-years",
  "date": "2022-02-05T20:27:22.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DG6gK4vbHmJAYaHJ33RN-viOtVw=/590x51:1932x946/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70475523/chrome_logo_change.0.jpeg\" />        <figcaption>The new Chrome logo side-by-side with previous variations. | Image by Elvin Hu via <a class=\"ql-link\" href=\"https://twitter.com/elvin_not_11/status/1489647023410212869\" target=\"_blank\">Twitter</a></figcaption>    </figure>  <p id=\"Oia8md\">Chrome is changing its logo for the first time since 2014, and if you squint really hard, you might actually be able to see what’s different. Elvin Hu, a designer for Google Chrome, offers a first look at the logo’s redesign in a thread on Twitter, as well as some of the thinking behind the ever-so-subtle changes.</p><div id=\"QNvW5D\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some of you might have noticed a new icon in Chrome’s Canary update today. Yes! we’re refreshing Chrome’s brand icons for the first time in 8 years. The new icons will start to appear across your devices soon. <a href=\"https://t.co/aaaRRzFLI1\">pic.twitter.com/aaaRRzFLI1</a></p>— Elvin   (@elvin_not_11) <a href=\"https://twitter.com/elvin_not_11/status/1489647023410212869?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"8Ok7yF\">Instead of incorporating shadows on the borders between each color, essentially “raising” them off the screen, the red, yellow, and green are simply flat. And while not mentioned by Hu, the blue circle in the middle seems to be bigger and stares into your soul even more, but maybe that’s just my imagination.</p><p id=\"P406d4\">The colors in the logo do look more vibrant (probably on account of the design team getting rid of the shadows), but there’s another change that I would’ve never noticed if I didn’t read Hu’s Twitter thread. Apparently, Google’s design team discovered “placing certain shades of green and red next to each other created an unpleasant color vibration.” To fix this and make the icon “more accessible,” they decided to use very subtle gradients — that I’m convinced the human eye can’t even see — to prevent any color vibration.</p><div class=\"c-float-right\"><aside id=\"bNdWaX\"><q>The main Chrome logo won’t look the same across all systems</q></aside></div><p id=\"qxxo6U\">The main Chrome logo (the one you click on from your dock / taskbar to access the web) won’t look the same across all systems either. On ChromeOS, the logo will look more colorful to complement the other system icons, while on macOS, the logo will have a small shadow, making it appear as if it’s “popping out” of the dock. Meanwhile, the Windows 10 and 11 version has a more dramatic gradient so that it fits in with the style of other Windows icons. Hu says you’ll start seeing the new icon now if you use Chrome Canary (the developer version of Chrome), but it will start rolling out for everyone else over the next few months.</p><p id=\"t0fXlw\">There are also some new icons for the beta and developer versions of the Chrome logo, with the most dramatic change being a blueprint-style icon for the beta app on iOS. Hu also notes that the design team experimented with a white line that serves as the border between each color, but found that this made the overall icon smaller, potentially making it harder to recognize among other Google apps.</p><p id=\"UfOwaX\">From 2008 until now, the Chrome logo has been getting gradually simpler. What started out as a shiny, three-dimensional emblem has been squashed down into a 2D symbol of modernity. Maybe one day I’ll get my wish and see that almost tangible 2008 Chrome logo grace my desktop once again. But not today.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iz_cUTBhNi9juhKVlXPhCdL27fk=/590x147:1932x850/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23220447/chrome_logo_change.jpeg",
  "description": "If you squint really hard, you can see the difference.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}