{
  "title": "Chrome’s new tool should let you revisit your old Google rabbit holes",
  "url": "https://www.theverge.com/2022/2/8/22923323/google-chrome-journeys-revisit-old-browsing-sessions",
  "date": "2022-02-08T17:00:00.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-5y0vHnWrMKDRa6Xu-pZuGs-QkA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70484201/acastro_180416_1777_chrome_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"HJKGZP\">Google Chrome is rolling out Journeys, a feature that lets you revisit your old browsing sessions based on the subject matter you were searching for. If you type a word in the address bar that’s related to some convoluted rabbit hole you’ve been down in the past, you’ll see a “Resume your research” option that links you to the related sites you’ve visited before.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/O9z6e0lRULeerKBy3371IP6ASxM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226080/chrome_journeys_feature1.jpeg\">      <cite>Image by Google</cite>      <figcaption>Journeys clumps together related searches from past browsing sessions.</figcaption>  </figure><p id=\"xvFooF\">So far, it sounds like it could be a much more viable solution than digging through your search history for that <em>one site</em> you kind of remember visiting three weeks ago. If you were knee-deep in research about axolotls, you should see all the related pages you accessed in Journeys whenever you type in the creature’s name at a later date. The Journeys page will prominently display the sites you’ve spent more time on and will also provide suggestions based on what you’ve searched for.</p><p id=\"yghjLT\">Google notes that you can delete specific sites included in your Journeys, erase entire chunks of your history, as well as turn off the feature altogether. None of it is saved to your Google Account either, so you won’t have to worry about past Journeys haunting your browsing experience on mobile — for now, at least (Google wants to expand it to other devices in the future). It’s currently available on the desktop version of Chrome on all operating systems in English, German, Spanish, French, Italian, Dutch, Portuguese, and Turkish.</p><p id=\"JmJ1g0\">Besides Journeys, Google is also adding a couple of more updates in the form of Chrome Actions and widgets. Chrome Actions are <a href=\"https://www.theverge.com/2020/11/17/21571832/google-chrome-2020-speed-memory-improvements\">commands you can give Chrome</a> by typing them directly in your address bar — some new ones include “manage settings,” “share this tab,” and “view your Chrome history,” all of which are more convenient than opening and scrolling through Settings. Google offers a full list of Actions <a href=\"https://support.google.com/chrome/answer/10957616?hl=en\">on this page</a>.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cmB_-8FOaxwoJAKh4VJ-8VlwDrY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226242/chrome_android_widgets.jpeg\">      <cite>Image by Google</cite>      <figcaption>You can add widgets by long-pressing the Chrome icon and then selecting “widgets.”</figcaption>  </figure><p id=\"oMWPnW\">Lastly, Google is adding some new widgets for Chrome on Android (that were <a href=\"https://www.androidpolice.com/chrome-for-androids-redesigned-widgets-are-rolling-out-in-beta/\">first spotted in the beta release of Chrome 95 last year</a>). Two widgets come with the options to conduct a text, voice, Lens, and private search, but they’re in different formats — one is presented with the Chrome address bar on top and four icons below, while the other has a horizontal layout with the address bar to the left of the icons. There’s also a separate widget for Google’s dino game, which is known for appearing when you use Chrome in offline mode. Google says you can add widgets by long-pressing on Chrome’s icon and then selecting “widgets.” It seems like a simple way to run up a quick search or jump over cacti on the fly.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8vrII42-MmhQI5d4qECJlqUBk6U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10673529/acastro_180416_1777_chrome_0001.jpg",
  "description": "Dig through the rabbit holes of your past.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}