{
  "title": "Clean energy broke records in 2021 but still can’t catch up with oil and gas",
  "url": "https://www.theverge.com/2022/3/3/22960195/clean-energy-records-2021-oil-gas-forecast",
  "date": "2022-03-03T22:39:07.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Westlands Solar Park in the San Joaquin Valley of California, Lemoore, California, solar power plant\" src=\"https://cdn.vox-cdn.com/thumbor/cN16WENniiaXGmSvwKhdm3MEJ2M=/0x0:5472x3648/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70576219/1233995608.0.jpg\" />        <figcaption>Lemoore, California July 2021. Westlands Solar Park, near the town of Lemoore in the San Joaquin Valley of California. | Carolyn Cole / Los Angeles Times via Getty Images</figcaption>    </figure>  <p id=\"n8qWAo\">Clean energy just had a record-setting year in the US,<strong> </strong>but without a drastic shift in policies, oil and gas will continue<strong> </strong>to dominate the US energy sector for the next three decades, according to two new energy reports released today. </p><p id=\"Rhai74\">The Energy Information Administration’s (EIA) <a href=\"https://www.eia.gov/outlooks/aeo/narrative/introduction/sub-topic-01.php\">annual energy outlook</a> forecast that the US, the world’s top producer of <a href=\"https://www.eia.gov/tools/faqs/faq.php?id=709&amp;t=6\">oil</a> and <a href=\"https://www.statista.com/statistics/264771/top-countries-based-on-natural-gas-production/\">gas</a>, will continue to produce record amounts of crude oil and gas through 2050<strong> </strong>if it continues down its current path. Petroleum and gas will also continue to be the country’s “most-consumed” sources of energy through the middle of the century unless something changes. “Though renewable sources grow faster, there is still a large established base of fossil fuel use that we simply do not see losing their predominance through 2050, at least not absent some form of policy action,” Stephen Nalley, acting EIA administrator, said in a <a href=\"https://www.youtube.com/watch?v=0Gs1AsqPsYo\">webinar</a> today.</p><div class=\"c-float-right\"><aside id=\"hyoT4y\"><q>Petroleum and gas will also continue to be the country’s “most-consumed” sources of energy</q></aside></div><p id=\"Dkg1ZJ\">The Biden administration has set a goal of virtually eliminating greenhouse gas emissions by 2050, in line with the goals of the Paris climate accord and what the vast body of <a href=\"https://www.ipcc.ch/sr15/chapter/spm/\">research</a> has shown is needed globally to prevent a much more severe climate crisis. The only way to accomplish that is to move from dirty fossil fuels to clean energy sources like solar and wind farms. </p><p id=\"agKdbZ\">There’s some significant<strong> </strong>movement in that direction, but not nearly enough. Clean energy broke several records in the US in 2021, according to another <a href=\"https://about.bnef.com/blog/bloombergnef-2021-executive-factbook/\">analysis</a> released today by BloombergNEF and trade group Business Council for Sustainable Energy. </p><p id=\"ZukvP2\">There was a record $105 billion in private investment last year in renewable energy and batteries, electric transport, as well as hydrogen and <a href=\"https://www.theverge.com/authors/justine-calma\">carbon capture technologies that might be able to clean up hard-to-abate pollution</a> from heavy industry. Developers built an additional 37 GW of generating capacity from wind and solar power, helping renewables break another record for how much renewable energy contributed to the power grid. Sales of electric vehicles also doubled from 2020 to 2021. </p><div class=\"c-float-right\"><aside id=\"QBczIc\"><q>A record $105 billion in private investment last year </q></aside></div><p id=\"nmak2l\">Even so, renewable energy still makes up just over 20 percent of the US power sector, while gas is almost double that. That means that the Biden administration has a long way to go in order to meet its goal of a 100 percent clean power sector by 2035. A <a href=\"https://www.theverge.com/2022/2/16/22937248/biden-climate-goals-renewable-energy-growth-us-lags-solar-wind-batteries\">report</a> released last month by industry group American Clean Power found that annual wind, solar, and energy storage installations need to grow at about twice the rate they did in 2021 in order to meet that 2035 goal. </p><p id=\"zv1Ha9\">The bipartisan infrastructure law passed last year includes $80 billion of federal investment in clean energy technologies, including new transmission lines crucial for bringing energy from far-flung wind and solar farms to cities and towns. Much of Biden’s remaining plans for cleaning up the power grid, however, are tied up in the beleaguered budget reconciliation bill that Democrats have quarreled over for months. Proposals to set federal clean energy standards and penalize utilities for sticking with dirty energy have already fallen by the wayside. The latest iteration of the bill still includes crucial tax incentives for clean energy, but those are still in limbo as the bill remains stalled in Congress. </p><p id=\"DjjN8O\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1q1NgzlTFK8mPAwwi3USzcaFTOw=/0x392:5472x3257/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23286558/1233995608.jpg",
  "description": "US climate goals are still far out of reach",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}