{
  "title": "Climate campaign pushes Bitcoin network to drop energy-hungry code ",
  "url": "https://www.theverge.com/2022/3/29/22999715/climate-change-bitcoin-drop-energy-hungry-software-code-proof-of-work",
  "date": "2022-03-29T16:47:51.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"CHINA-FINANCE-CRYPTOCURRENCY\" src=\"https://cdn.vox-cdn.com/thumbor/DsmM1ZMVYKTZ6BzC6ENgQ2-aXac=/0x0:5976x3984/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70685587/1234051655.0.jpg\" />        <figcaption>This photo taken on April 1, 2021 shows a worker adjusting cryptocurrency mining rigs at a cryptocurrency farm in Dujiangyan in China’s southwestern Sichuan province.  | Photo by STR/AFP via Getty Images</figcaption>    </figure>  <p id=\"ilgZoc\">Greenpeace and other environmental groups launched a new campaign today to push the Bitcoin network to slash its growing greenhouse gas emissions. The goal of the campaign, dubbed “Change the code, not the climate,” is to switch up the energy-hungry process of verifying transactions and mining new Bitcoins.  </p><p id=\"ci7MwF\">The cryptocurrency uses more electricity annually than global gold mining operations or the entire country of Norway, <a href=\"https://ccaf.io/cbeci/index/comparisons\">according to the Cambridge Centre for Alternative Finance</a>. Burning through so much energy generates some serious greenhouse gas emissions, but campaign organizers argue that it doesn’t have to be that way. Other cryptocurrencies use just a fraction of the energy Bitcoin requires because they use a different system to verify transactions. </p><div class=\"c-float-left\"><aside id=\"tXpNkj\"><q>“Change the code, not the climate”</q></aside></div><p id=\"ANBuWj\">In order to validate transactions, Bitcoin miners rely on specialized hardware to solve complex puzzles. Their computers gobble up a lot of energy in the process, and the miners get new tokens in return. It’s a process called “proof of work,” in which the energy used is sort of the price paid to verify transactions. The process is deliberately energy-intensive as a safety measure. The baked-in inefficiency is meant to discourage bad actors from manipulating the data because it would cost a lot of energy to do so.</p><p id=\"LoVajH\">The new campaign aims to move Bitcoin away from that energy-hungry proof of work process. The most popular alternative is called proof of stake. Cryptocurrencies that use proof of stake use vastly less energy because there are no puzzles to solve. Instead of essentially paying with electricity to participate in the process, you have to offer up some of your own tokens. This is supposed to prove that you have a “stake” in keeping the ledger accurate. If you mess anything up, you lose tokens as a penalty.</p><p id=\"2cyB0h\">While proof of stake might make solve a lot of Bitcoin’s pollution problems, experts have been skeptical that miners would be willing to make the change. Miners invest a lot in their hardware and would be hard-pressed to abandon it. And some fans of proof of work maintain that it’s the most secure way to maintain the ledger. </p><p id=\"YRpTgn\">“We know Bitcoin stakeholders are incentivized not to change,” the campaign acknowledges on its <a href=\"https://www.cleanupbitcoin.com/\">website</a>. “Changing Bitcoin would render a whole lot of expensive infrastructure worthless, meaning Bitcoin stakeholders will need to walk away from sunk costs — or find other creative solutions.” </p><p id=\"ObEY55\">Regardless, the campaign’s organizers are trying to enlist some big names in tech to help turn up the heat on Bitcoin miners to make the change. “Leaders like <a href=\"https://www.theverge.com/2021/5/24/22451900/elon-musk-bitcoin-miners-council-sustainability\">Elon Musk</a> of Tesla, Jack Dorsey of Block, and Abby Johnson of Fidelity have vested interests in Bitcoin — and the power to affect change,” the campaign website says. </p><div class=\"c-float-right\"><aside id=\"Lcbulm\"><q>Bitcoin has gotten even dirtier</q></aside></div><p id=\"kDOGHD\">The website implores visitors to tweet at the Musk, Dorsey, and Johnson to support the campaign. The campaign also includes new ads in <em>The</em> <em>Wall Street Journal, The New York Times, MarketWatch, Politico</em>, and on Facebook.</p><p id=\"MtRaGT\">“No matter how you feel about Bitcoin, pushing those with the power to ensure a code change will make our planet and communities safer from the destructive impacts of climate change,” Greenpeace USA chief program officer Tefere Gebre said in a <a href=\"https://www.greenpeace.org/usa/news/change-the-code-not-the-climate-greenpeace-usa-ewg-others-launch-campaign-to-push-bitcoin-to-reduce-climate-pollution/\">press release</a>. </p><p id=\"URQc2p\">Bitcoin has <a href=\"https://www.theverge.com/2022/2/28/22954859/bitcoin-mining-pollution-china-ban\">gotten even dirtier</a> since China banned it in 2021. The biggest mining hub in the world is now the <a href=\"https://ccaf.io/cbeci/mining_map\">US</a>, where miners have breathed new life into retired and aging <a href=\"https://www.theguardian.com/technology/2022/feb/18/bitcoin-miners-revive-fossil-fuel-plant-co2-emissions-soared\">coal</a> and <a href=\"https://grist.org/technology/bitcoin-greenidge-seneca-lake-cryptocurrency/\">gas</a> power plants. </p><p id=\"YU7x8U\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/t5EJuphzvGYIbad7hRgi9YwDKfk=/0x428:5976x3557/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23352906/1234051655.jpg",
  "description": "Cryptocurrencies don’t have to burn through so much energy.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}