{
  "title": "Clipchamp is Microsoft’s new video editing app for Windows 11",
  "url": "https://www.theverge.com/2022/3/9/22969250/clipchamp-windows-11-microsoft-video-editing-app",
  "date": "2022-03-09T18:48:52.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/HBBYkh0aJ1H44gSKey5uXj68ta8=/0x0:1650x1100/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70600276/windows11main.0.jpg\" />    </figure>  <p id=\"vdLXiX\">If you’ve been waiting for Microsoft to resurrect Windows Movie Maker, Clipchamp might be the next best thing. After <a href=\"https://www.theverge.com/2021/9/8/22662225/microsoft-clipchamp-acquisition-video-editing-web-app-windows\">acquiring Clipchamp</a> last year, <a href=\"https://blogs.windows.com/windows-insider/2022/03/09/announcing-windows-11-insider-preview-build-22572/\">Microsoft is now bundling</a> the app into Windows 11. It’s a browser-based app that supports trimming, splitting, transitions, and even has a screen recorder feature. </p><p id=\"cMRsxu\">Clipchamp includes a timeline, just like pro apps like Adobe Premiere Pro, and uses a combination of templates and a library of filters, transitions, stock media, and styles to let people create videos with multi-track audio support and user-friendly editing. Microsoft has integrated in an Azure-powered text-to-speech generator for creators to use voiceovers in 70 languages, and OneDrive is also integrated for cloud storage of files.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/q89WpJi0RYuV6dHUWf2CGzU8kWg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301607/Clipchamp_editor_med.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>Clipchamp is now part of Windows 11.</em></figcaption>  </figure><p id=\"aiEXPF\">Microsoft says Clipchamp is now an “inbox” app in Windows 11, which means it will be preinstalled on all new Windows 11 devices. The Microsoft Family app is also now an inbox app, with features like filters for Edge, screen time activity on Xbox, Windows, and Android, and family location tracking.</p><p id=\"m3qqiR\">Alongside these app updates, Microsoft is now starting to test some changes to the search experience in Windows 11. “Starting early next week, we will begin rolling out an update for Search in Windows 11 that highlights interesting moments in time,” explains Amanda Langowski, head of Microsoft’s Windows Insider program. “The search box in Start and Search will periodically update with content, including fun illustrations, that help you discover more, be connected, and stay productive.”</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ETLsZGQzldhlkN9XesLDd9c9UZ8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301610/Search_highlights_Consumer_final_cropped.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>The new search highlights feature.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/839KSvglaJCllXpz7_arKM3ig8I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301612/Search_highlights_Enterprise.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>Work users can sign in and get access to company files.</em></figcaption>  </figure></div></div></div><p id=\"wZS6mD\">These search highlights will include moments like holidays, anniversaries, and other moments in time. Recent search results will be placed at the side, and if you sign in with a work account, then files and contacts through Microsoft Search will be displayed. You can always turn off the search highlights feature, and it’s also making its way to Windows 10 too.</p><p id=\"uGE7vI\">Microsoft is also making further improvements to clear up some of the legacy of Windows. The Print Queue is getting updated to match the Windows 11 design, both Quick Assist and Windows Sandbox now have Fluent design icons, and Windows Media Player has been renamed to Windows Media Player Legacy. It’s clear that the new Media Player app for Windows 11 will eventually mean Windows Media Player will disappear from the OS.</p><p id=\"hLO3S9\">As always, some of these changes won’t appear in Windows 11 for months. Microsoft rolls out features gradually, and the company is no longer waiting on big annual feature drops to update Windows 11.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4bM2xi-rvp2HKhrvpg8Jeqvzxcw=/0x118:1650x982/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22679352/windows11main.jpg",
  "description": "Windows finally has a better video editing app again.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}