{
  "title": "CNN president Jeff Zucker abruptly resigns",
  "url": "https://www.theverge.com/2022/2/2/22914592/cnn-jeff-zucker-resigns-romantic-relationship-colleague",
  "date": "2022-02-02T18:14:47.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"NATPE Miami 2020 - 17th Annual Brandon Tartikoff Legacy Awards\" src=\"https://cdn.vox-cdn.com/thumbor/pkLfCzl6h6PlwbAR5uKeMWxmPUo=/0x141:2595x1871/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70463114/1195415843.0.jpg\" />        <figcaption>Photo by Jason Koerner/Getty Images</figcaption>    </figure>  <p id=\"GL3rHf\">CNN president Jeff Zucker, a leading proponent of forthcoming streaming service CNN Plus, has resigned from the company following the discovery of a consensual relationship with another high-ranking executive. </p><p id=\"99KaxK\">The relationship, which was not disclosed internally when it began, was discovered as part of an investigation into conduct by former CNN anchor Chris Cuomo. Cuomo was <a href=\"https://www.cnn.com/2021/12/04/media/cnn-fires-chris-cuomo/index.html\">fired from the network</a> in December following a probe into his own involvement in the handling of sexual harassment allegations against his brother, former New York Governor Andrew Cuomo.</p><p id=\"zyhbLx\">Zucker reportedly had a consensual relationship with EVP and chief marketing officer Allison Gollust, who will remain in her position at the company, the <a href=\"https://www.nytimes.com/2022/02/02/business/media/jeff-zucker-cnn.html\"><em>New York Times</em></a> reported. CNN’s chief media correspondent Brian Stelter <a href=\"https://twitter.com/brianstelter/status/1488905768342589450\">shared a copy</a> of Zucker’s internal note to staff.</p><p id=\"cGoAS3\">“As part of the investigation into Chris Cuomo’s tenure at CNN, I was asked about a consensual relationship with my closest colleague, someone I have worked with for more than 20 years,” Zucker wrote. “I acknowledged the relationship evolved in recent years. I was required to disclose it when it began but I didn’t. I was wrong.”</p><p id=\"TVIOs9\">He added, “I am grateful to the thousands of incredibly talented CNN and Turner Sports employees who helped make this such a joy for me, and such a success for all of us.”</p><p id=\"lU3XjM\">In a <a href=\"https://twitter.com/brianstelter/status/1488911534139006985\">statement obtained</a> by Stelter, Gollust wrote that after remaining “close friends and professional partners for over 20 years,” their “relationship changed during Covid. I regret that we didn’t disclose it at the right time. I’m incredibly proud of my time at CNN and look forward to continuing the great work we do everyday.”</p><p id=\"cuyhFM\">It’s unclear how the resignation might impact the roadmaps of CNN Plus or the forthcoming merger between <a href=\"https://www.theverge.com/2021/6/1/22448140/warner-bros-discovery-warnermedia-new-name-merger-att\">WarnerMedia and Discovery</a>. Zucker <a href=\"https://cnnpressroom.blogs.cnn.com/2021/07/19/cnn-to-debut-in-q1-2022/\">had said last year</a> that CNN Plus would “offer consumers a streaming product that grows the reach and scope of the CNN brand in a way that no one else is doing. Nothing like this exists.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2Scfa_WNFRrMzNm3Ng6MIttclek=/0x146:2595x1505/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23213240/1195415843.jpg",
  "description": "The relationship was not disclosed internally.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}