{
  "title": "CNN Plus will cost $2.99 per month for early subscribers",
  "url": "https://www.theverge.com/2022/3/3/22959764/cnn-plus-streaming-price",
  "date": "2022-03-03T15:32:33.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BEVdQ1Q-WlDsUK2J3wOMz2q5kwQ=/50x0:590x360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70574178/cnn_plus_3d_whiteplus_redbg_pr_email_logo_640x360.0.jpg\" />        <figcaption>CNN Plus has announced its subscription prices | CNN/Warner Media</figcaption>    </figure>  <p id=\"vAq4L3\">CNN has finally revealed details about pricing for its forthcoming CNN Plus streaming service. Those who subscribe in the first four weeks of CNN Plus launch will pay $2.99 a month, a 50 percent discount off the regular $5.99 per month / $59.99 per year subscription price. Early subscribers will lock in that $2.99 / month price for as long as they keep their subscriptions, the company said in a news release Thursday. </p><p id=\"FAPyVo\">The service will reportedly launch later this month, <a href=\"https://www.latimes.com/entertainment-arts/business/story/2022-03-02/cnn-and-cnn-streaming-service-after-jeff-zucker\">according to the <em>Los Angeles Times</em></a> — CNN only says that it will launch “later this spring.” </p><p id=\"YPWMzX\"><a href=\"https://www.theverge.com/2021/7/19/22583424/cnn-plus-launch-streaming-service-first-quarter\">CNN announced its streaming service</a> last July and, over the past several months, has announced several shows that will be part of CNN Plus. In addition to daily versions of weekly CNN shows like <em>Reliable Sources</em> and an evening newscast with anchor Wolf Blitzer, the streamer will have weekly programs that feature CNN anchors as well as other media personalities, including Jemele Hill, Audie Cornish, Scott Galloway, and Rex Chapman. It’s also planning original series and movies, as well as access to CNN’s library of content. </p><p id=\"jMUWyI\">CNN’s parent company WarnerMedia is in the middle of a merger with Discovery, expected to close later this month. The network will also have a new head after longtime <a href=\"https://www.theverge.com/2022/2/2/22914592/cnn-jeff-zucker-resigns-romantic-relationship-colleague\">president Jeff Zucker resigned last month</a> after failing to properly disclose a relationship with another executive at the company. The relationship came to light as part of an investigation into former news anchor <a href=\"https://www.cnn.com/2021/12/04/media/cnn-fires-chris-cuomo/index.html\">Chris Cuomo, who was fired</a> in December. Chris Licht, an executive at CBS, has been <a href=\"https://www.cnbc.com/2022/02/28/cnn-hires-turnaround-expert-chris-licht-to-replace-jeff-zucker.html\">named as Zucker’s replacement</a>. </p><p id=\"YDr4gl\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z3Co3EevBuaf6Ko3Hpr3XCSWfgQ=/0x13:640x348/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285277/cnn_plus_3d_whiteplus_redbg_pr_email_logo_640x360.jpg",
  "description": "CNN announced plans for a streaming service last July.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}