{
  "title": "CNN Plus launches with Reddit-like interactive Q&As",
  "url": "https://www.theverge.com/2022/3/29/23000627/cnn-plus-streaming-service-launch",
  "date": "2022-03-29T15:15:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"The app highlights a main show in the center with a bar of recent titles beneath it.\" src=\"https://cdn.vox-cdn.com/thumbor/ZTmJaK9POmEBVkHiGw23uZ4VQCc=/213x0:2853x1760/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70685116/CNNPlus_Featured_Homepage.0.jpg\" />        <figcaption>A screenshot of CNN Plus’ interface. | Image: CNN Plus</figcaption>    </figure>  <p id=\"3AkLL2\">CNN’s premium streaming service launches today. The service, CNN Plus, will debut with about a dozen weekly shows, more than a thousand hours of on-demand content, and a Reddit-like interactive tool for asking reporters and guests questions about the day’s biggest news. It’s a major bet on viewers being willing to pay not just for news but for <em>more </em>news — and that the CNN brand can beat out other often freely available options.</p><p id=\"XvDBpE\">CNN Plus isn’t just a digital library for coverage from its cable sibling. Available on Amazon Fire TV, Android phones and tablets, and Apple devices, the app will launch with new shows from Audie Cornish, Anderson Cooper, and Jake Tapper, among others.<strong> </strong>At its core, it’s a product for people who — god help them — need a dedicated streaming service for news coverage that goes beyond what’s already available through paid newsletters, documentary services, and CNN’s existing 24-hour nonstop channel.</p><p id=\"uHMe7k\">“We view CNN Plus as being additive. It’s a totally new thing that’s a complimentary product to CNN on linear television,” Robyn Peterson, chief technology officer and SVP at CNN, said during a demo of the product. “It’s not really a second newsreel.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZG81oX70-YcNeLLnagxUN0RTWfc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23351347/IMG_0706.PNG\">      <cite>Image: CNN Plus</cite>      <figcaption>The CNN Plus app showing a grid of available titles.</figcaption>  </figure><p id=\"yjqMZX\">One of the ways that CNN Plus differentiates itself is through interactivity. During some live CNN Plus segments, viewers will be able to submit questions through a feature called Interview Club during and prior to segments. Those questions can then be upvoted by other subscribers — sort of like a Reddit for viewers who want additional context about the news.</p><p id=\"zXjhO3\">CNN would like us to view CNN Plus as being distinguished from its broadcast counterpart, but the two are awfully enmeshed. A single CNN app will give viewers access to both CNN Plus and the pay-TV experiences, which includes feeds for CNN, CNN International, and HLN. But the two programming components will need to be unlocked separately. CNN Plus will cost $6 per month, while you’ll need a cable provider login to access the pay-TV programming. For its first month, CNN Plus will allow users to <a href=\"https://www.theverge.com/2022/3/11/22972566/cnn-plus-launch-march-29-streaming\">lock in a discounted rate</a> of $3 per month as long as they stay subscribed.</p><p id=\"1CUj5b\">The challenge is that CNN will be going up against a number of general-purpose streaming services, like Peacock or Paramount Plus, that offer news content alongside hit sitcoms, dramas, and movies. Plus, plenty of free-to-stream services currently have 24-hour news coverage as well, including the Roku Channel, YouTube, Pluto, and Plex, among others.</p><p id=\"SzZJ5F\">CNN Plus’ challenge won’t just be launching in a crowded streaming space. Its biggest hurdle will be convincing subscribers that it’s worth paying for a service that does news and little else.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9oF0MHUoQ8JLc83Ultcxsr8bIOc=/0x78:3066x1683/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23351346/CNNPlus_Featured_Homepage.jpg",
  "description": "Another streamer enters the space.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}