{
  "title": "Coachella will sell lifetime festival passes as NFTs",
  "url": "https://www.theverge.com/2022/2/1/22912255/coachella-lifetime-passes-nfts",
  "date": "2022-02-01T18:00:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Y86OQQynSnR17wyj3p8KZZVhGZc=/259x0:1759x1000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70458267/Coachella_NFTs__HERO_.0.png\" />        <figcaption>Image: Coachella</figcaption>    </figure>  <p id=\"81eVuD\">Coachella is selling lifetime festival passes for the first time — but you have to buy an NFT to get one. The music festival today launched <a href=\"https://nft.coachella.com/\">an NFT marketplace</a> built by FTX US, with three collections of NFTs going on sale on February 4th.</p><p id=\"l8LnN7\">The company will auction the Coachella Keys Collection, a group of 10 NFTs that allow holders lifetime tickets to the festival. Owners of the token will get passes to Coachella every year, plus “access to Coachella-produced virtual experiences forever.” NFT purchases also include special perks at the 2022 festival like front row access and a celebrity chef dinner. </p><p id=\"94WcOH\">That the festival is dipping into the NFT craze is perhaps unsurprising — in November, Coachella parent company AEG renamed the Staples Center the Crypto.com Arena — and other traditional companies have shown there’s plenty of money to be made by attaching physical products and services to digital goods. NFT resales often net profits for the original seller, too, which could be a boon for something as permanent as a lifetime pass. If the NFTs are resold, Coachella, photographers, art installation artists, and design artists will receive a royalty.</p><div class=\"c-float-right\"><aside id=\"hPdUqN\"><q>Digital ticketing is possible without NFTs attached — the NFL even got rid of paper tickets for the 2021 season</q></aside></div><p id=\"rdrSW2\">Ticketing is often raised as a use case for NFTs and blockchains — before Coachella, the NFL announced in November it would <a href=\"https://www.theverge.com/2021/11/18/22789265/nft-nfl-football-commerative-ticketmaster\">tack on NFTs to tickets</a> for select games. But in the case of the NFL, the digital token itself doesn’t gain you entry to the event. Owners of Coachella’s NFTs use the token to redeem two festival passes yearly. Digital ticketing and resales are also possible without NFTs attached — the NFL even got rid of paper tickets for the 2021 season.</p><p id=\"KFhn5v\">Other companies have tied NFTs to physical products and experiences: one of the draws of the Bored Ape Yacht Club is the parties you supposedly get <a href=\"https://www.theverge.com/22824387/bored-ape-yacht-club-nft-party-new-york\">exclusive access</a> to, and companies from <a href=\"https://www.theverge.com/2022/1/13/22881943/gap-nft-hoodies-frank-ape\">Gap</a> to <a href=\"https://www.theverge.com/2021/12/16/22822143/adidas-nft-launch-into-the-metaverse-price-release-date\">Adidas</a> have sold NFTs that come with physical merchandise.</p><p id=\"OtUTC1\">In addition to the 10 lifetime-pass NFTs, Coachella will sell 1,000 NFTs priced at $180 that buyers can use to redeem a physical Coachella photo book. The company will also sell 10,000 NFTs of “fan-favorite festival photos and never before heard soundscapes,” priced at $60 apiece. Minted on Solana, Coachella will donate a portion of NFT sales to <a href=\"https://www.givedirectly.org/\">GiveDirectly</a>, <a href=\"https://www.liderescampesinas.org/\">Lideres Campesinas</a>, and <a href=\"https://findfoodbank.org/\">Find Food Bank</a>. </p><p id=\"1YlWuy\"><em><strong>Update February 1st 2:30 PM ET:</strong></em> This story has been updated to include responses from Coachella.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lEOy73pKE1ZPLxCOXKvKDActRLg=/54x0:1964x1000/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23209780/Coachella_NFTs__HERO_.png",
  "description": "Lifetime pass owners also get access to \"Coachella-produced virtual experiences forever.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}