{
  "title": "Coinbase says it’s blocking 25,000 Russia-linked crypto addresses",
  "url": "https://www.theverge.com/2022/3/7/22965605/coinbase-russian-sanctions-address-blocking",
  "date": "2022-03-07T17:27:03.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wEDMQ-Mp7OdZZga-F-N0W-jiABc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70589625/jbareham_180313_1777__bitcoin_cryptocurrency_0003.0.jpg\" />        <figcaption>Illustration by James Bareham / The Verge</figcaption>    </figure>  <p id=\"MQ8zbN\">Coinbase says it’s currently blocking 25,000 cryptocurrency addresses linked to Russian people or entities, defending itself against claims that Russia could <a href=\"https://www.nytimes.com/2022/02/23/business/russia-sanctions-cryptocurrency.html\">evade sanctions with crypto</a>. In <a href=\"https://blog.coinbase.com/using-crypto-tech-to-promote-sanctions-compliance-8a17b1dabd68\">a blog post published yesterday</a>, chief legal officer Paul Grewal outlined how the financial exchange is complying with new rules imposed amid the ongoing invasion of Ukraine. That includes using “sophisticated blockchain analytics” to identify accounts that are indirectly linked to banned users.</p><p id=\"of9WnL\">Coinbase indicated that the 25,000 blocked accounts were “related to Russian individuals or entities we believe to be engaging in illicit activity.” It didn’t specify when precisely they’d been blocked or how many of the restrictions were related to the current sanctions — in one example, for instance, Coinbase cited a 2020 sanction against a specific Russian national with 1,200 potentially linked accounts.</p><div class=\"c-float-right\"><aside id=\"at8hau\"><q>“Coinbase fully supports these efforts by government authorities”</q></aside></div><p id=\"EHH3dI\">“Sanctions play a vital role in promoting national security and deterring unlawful aggression, and Coinbase fully supports these efforts by government authorities,” said Grewal. While crypto wallets can be anonymous and don’t require dealing with traditional banks, he points out that transactions are “traceable, permanent, and public” — which can potentially make it easier to crack down on illicit accounts, preventing them from buying or selling cryptocurrency through a service like Coinbase. “Digital assets have properties that naturally deter common approaches to sanctions evasion.”</p><p id=\"o4GwSK\">US lawmakers have questioned whether cryptocurrency companies are following sanctions against Russia. Four senators, including Elizabeth Warren (D-MA), <a href=\"https://www.nytimes.com/2022/03/02/business/treasury-cryptocurrencies-russia-sanctions.html\">sent a letter last week</a> urging Treasury Secretary Janet Yellen to outline plans for enforcing compliance.</p><p id=\"9Pg7p9\">Crypto companies have hastened to <a href=\"https://www.washingtonpost.com/business/2022/03/03/crypto-sanctions-russia/\">disagree with the analysis</a>, downplaying the digital currency’s value for large-scale illicit transactions. <a href=\"https://www.theguardian.com/technology/2022/mar/04/binance-founder-says-cryptocurrencies-wont-help-russia-evade-sanctions\">Binance founder Changpeng Zhao called crypto</a> “too small for Russia,” citing its extremely low adoption levels. “The Russian government and other sanctioned actors would need virtually unobtainable amounts of digital assets to meaningfully counteract current sanctions,” wrote Grewal. (The sanctions so far don’t require blocking <a href=\"https://www.reuters.com/markets/europe/crypto-exchanges-wont-bar-russians-raising-fears-sanctions-backdoor-2022-03-02/\">ordinary Russian citizens</a>, despite calls from Ukraine to extend them.) Conversely, they’ve pointed to Ukraine’s extensive <a href=\"https://www.theverge.com/2022/2/26/22952357/ukraine-bitcoin-ethereum-donation-vitalik-buterin\">crypto fundraising operations</a>, which had raised <a href=\"https://www.cnbc.com/2022/03/03/ukraine-raises-54-million-as-bitcoin-donations-surge-amid-russian-war.html#:~:text=One%20CryptoPunk%20NFT%20worth%20over,for%20Wikileaks%20founder%20Julian%20Assange.\">approximately $54 million</a> as of late last week.</p><p id=\"xyCvkw\">Russia is increasingly isolated from the larger non-crypto financial system. Among other things, Visa and Mastercard <a href=\"https://www.theverge.com/2022/3/5/22963433/visa-mastercard-suspend-services-russia-ukraine\">suspended operations in the country</a> over the weekend, leaving cardholders inside Russia dependent on Russia’s National Payment Card System.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Cc25lbecHTviBbtDHrkDsMPMUcw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10418911/jbareham_180313_1777__bitcoin_cryptocurrency_0003.jpg",
  "description": "The account owners were linked to \"illicit activity.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}