{
  "title": "CoinDesk fixes a CMS leak that may have been used for crypto insider trading",
  "url": "https://www.theverge.com/2022/2/7/22922219/coindesk-cms-leak-api-unpublished-insider-trading",
  "date": "2022-02-07T23:26:47.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/HV-P692N6XqHoJsonwAZdaIeMLw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70481886/acastro_170621_1777_0008.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"hnP9QJ\">CoinDesk has fixed an exploit that allowed anyone to view unpublished headlines, create drafts, and edit articles on the website. <a href=\"https://www.coindesk.com/business/2022/02/04/coindesk-fixes-cms-exploit-that-leaked-headlines-before-publication/\">In a post on its site</a>, CoinDesk says the vulnerability could’ve let “unidentified actors” view non-public information, allowing them to make trading decisions they could profit from.</p><div class=\"c-float-right\"><aside id=\"EiOsr6\"><q>“The issue is now fixed and added safeguards have been put in place”</q></aside></div><p id=\"9bic9E\">“The exploit, which was brought to CoinDesk’s attention by a white-hat hacker, may have allowed unidentified actors to profit from nonpublic information by making trades ahead of the publication of at least one article,” Kevin Worth, CoinDesk’s chief content officer writes in the post. “The issue is now fixed and added safeguards have been put in place.”</p><p id=\"1rrpJ1\">While CoinDesk says the security hole just exposed unpublished headlines, <a href=\"https://twitter.com/Tree_of_Alpha/status/1489545291036561410?s=20&amp;t=r7_N4Httavx7iFNc0DN69g\">the Twitter user</a> who initially brought the exploit to CoinDesk’s attention illustrates how the issue goes much deeper than that. Bad actors found a way to manipulate the application programming interface (API) that CoinDesk uses to publish content. Whenever the API received a bad request, it would return an error stack (or a long error message), which essentially contained the means for someone to access CoinDesk’s backend publishing system. As a result, users had the ability to make changes to existing articles, add fake drafts, and, of course, get an early look at the information that could give them a trading advantage.</p><p id=\"MDXcYV\">This type of insider trading isn’t unheard of — in the past, <a href=\"https://www.theverge.com/2018/8/22/17716622/sec-business-wire-hack-stolen-press-release-fraud-ukraine\">hackers have tapped into newswire sites like BusinessWire</a>, gaining early access to press releases and other information that has the power to tip the stock market.</p><p id=\"925N55\">Law enforcement’s response to insider trading in the world of crypto has been mixed. Last year, the US Commodity Futures Trading Commission <a href=\"https://www.bloomberg.com/news/articles/2021-09-17/u-s-s-binance-probe-expands-to-examine-possible-insider-trading?sref=ExbtjcSG\">opened an investigation into cryptocurrency exchange Binance</a> over possible insider trading and market manipulation. Around the same time, Nate Chastain, the former product chief at NFT marketplace OpenSea, <a href=\"https://www.theverge.com/2021/9/15/22676075/opensea-insider-information-nft-trading-nate-chastain\">was also accused of using inside information</a> to buy and sell NFTs, but no legal action has been taken. As regulators in the US <a href=\"https://www.theverge.com/2021/11/24/22800740/cryptocurrency-us-banking-regulation-clarification-financial-institutions-stablecoins\">work to clarify the laws surrounding cryptocurrency</a>, insider trading may become less of a gray area.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/N8EhH0rYSwMveMcUwOK-7v_NNz4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8792129/acastro_170621_1777_0008.jpg",
  "description": "It also let bad actors edit articles and create drafts.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}