{
  "title": "Coinbase experiencing major outage as crypto prices plummet",
  "url": "https://www.theverge.com/2022/5/12/23068996/coinbase-outage-withdrawal-cryptocurrency-bitcoin-price-crash",
  "date": "2022-05-12T18:18:11.000Z",
  "author": "Russell Brandom",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IKIzZVpkapq9KsztDkk2wTPWVPU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861994/mdoying_180308_2373_0092still.0.jpg\" />        <figcaption>Photo by Michele Doying / The Verge</figcaption>    </figure>  <p id=\"v1aANk\">Coinbase users are reporting difficulty withdrawing funds, heightening fears amid a widespread crash in cryptocurrency prices.</p><p id=\"uWNJqX\">The company confirmed the issues <a href=\"https://twitter.com/CoinbaseSupport/status/1524802731763965958\">in a tweet</a> on Thursday. “We are aware that some customers are having issues trading and accessing accounts on Coinbase and Coinbase Pro,” the company said. “Your funds are safe, and we are actively working on the issue. We’ll provide an update here soon.”</p><p id=\"1puFUN\">Shortly afterward, the company indicated the situation might be resolving: “We’re seeing recovery after implementing a fix, but our teams are continuing to monitor the situation.”</p><div id=\"w45KPM\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re seeing recovery after implementing a fix, but our teams are continuing to monitor the situation. Rest assured, we have all hands on deck and will continue our work to ensure our services are healthy. <a href=\"https://t.co/N1t0FqMA5z\">https://t.co/N1t0FqMA5z</a></p>— Coinbase Support (@CoinbaseSupport) <a href=\"https://twitter.com/CoinbaseSupport/status/1524812283133808640?ref_src=twsrc%5Etfw\">May 12, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"FBnui8\">In communities on Reddit, users have reported <a href=\"https://www.reddit.com/r/CoinBase/comments/unneit/cant_withdraw_funds/\">rolling delays in withdrawals</a>, leaving thousands of dollars hanging in the balance. More recently, another user reported that they were unable to access the app or website at all. </p><p id=\"zs0Sry\">“Has the bear market crashed their servers?” <a href=\"https://www.reddit.com/r/CoinBase/comments/uo5v3h/coinbase_servers_down/\">the post reads</a>. “Pretty frightening if someone wants to make a fast trade.”</p><p id=\"5Pl6Zc\">The downtime comes amid a widespread crash in cryptocurrency prices, adding particular urgency to trades and withdrawals. Bitcoin has fallen to under $30,000, losing more than 25 percent of its value over the course of a month. As in any financial crash, the price drop has pushed many coin-holders to sell their assets and tested the underlying financial infrastructure of many institutions.</p><p id=\"EIyE15\">As a leading cryptocurrency exchange and wallet service, Coinbase has been hit particularly hard by the crash. The company <a href=\"https://www.cnbc.com/2022/05/10/coinbase-coin-earnings-q1-2022.html\">reported a steep drop in revenue</a> earlier this week, and its stock has shed more than half its value over the course of a week. Users were particularly shaken <a href=\"https://www.wsj.com/articles/coinbase-says-users-crypto-assets-lack-bankruptcy-protections-11652294103?st=tbu3mhg1wikknor&amp;reflink=desktopwebshare_twitter\">by a financial filing</a> that suggested Coinbase account holders might be viewed as unsecured creditors in bankruptcy proceedings, seeming to suggest that they might lose money from their accounts if the company becomes insolvent. Coinbase CEO Brian Armstrong <a href=\"https://twitter.com/brian_armstrong/status/1524233480040710144\">contested the claims</a>, saying user funds were not in danger.</p><p id=\"nsKKuY\">Coinbase did not immediately respond to a request for comment.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/I_plGlE5qd5Sl2uU9Luh1kQ4XYg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10432805/mdoying_180308_2373_0092still.jpg",
  "description": "Coinbase says its in the process of resolving the outage.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}