{
  "title": "Collapsed Amazon warehouse had construction defects, says family of slain worker",
  "url": "https://www.theverge.com/2022/4/12/23021839/amazon-warehouse-tornado-collapsed-construction-defects-slain-worker",
  "date": "2022-04-12T17:43:41.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"US-STORM-CLIMATE\" src=\"https://cdn.vox-cdn.com/thumbor/d19wEHFXjPOrllQ2_xG21Z8Oq6o=/266x0:3934x2445/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740782/1237195057.0.jpg\" />        <figcaption>Photo by TIM VIZER/AFP via Getty Images</figcaption>    </figure>  <p id=\"Htkuq1\">The Amazon warehouse that collapsed with employees inside during a December tornado outbreak might have harbored a “grave violation” of building code that made the structure extremely vulnerable, according to an attorney representing the family of a worker who died there.</p><p id=\"jRForT\">A tornado outbreak tore through the Amazon distribution center in Edwardsville, Illinois, on December 10th, leveling parts of the building and killing six people. Supporting columns in parts of the warehouse that collapsed might not have been properly secured to the ground, according to a newly unearthed <a href=\"https://www.cliffordlaw.com/wp-content/uploads/2022/04/REDACTED-Amazon-Narrative-12-10-21_Redacted-1.pdf\">report</a> filed by a structural engineer who was asked by local officials to assess the damage after the tornado.</p><div class=\"c-float-right\"><aside id=\"mmy6vK\"><q>“A peg coming out of a hole”</q></aside></div><p id=\"Kik9KC\">“I became concerned when I noticed that none of the columns appeared to be ripped or torn from the base,” the report reads. The report describes the apparent ease with which columns lifted out of the floor as similar to “a peg coming out of a hole.” </p><p id=\"g08nQW\">The report was obtained through a Freedom of Information Act request by a lawyer representing the family of Austin McEwen, a 26-year-old delivery driver who died while huddling with other workers in a warehouse restroom for shelter. It is expected to be introduced as part of a wrongful death lawsuit by McEwen’s family.</p><p id=\"eoOS6N\">In particular, the document suggests that the warehouse building was constructed in violation of local and international building codes. The columns supporting the building should have been securely anchored to the floor, but in a number of columns, the engineer found no evidence of anchoring. </p><p id=\"KabRst\">“I could find no weld or bolted connection at the base of any column, but only a bead of what appeared to be some sort of caulk around the column at the finished floor line,” the report reads. “An examination of several of the empty pockets where columns once stood also did not reveal any indication of positive securement of the columns at or below the finished floor level.”</p><p id=\"GEUzbw\">The columns appeared to be properly anchored in other parts of the warehouse, which remained standing, McEwen family lawyer Jack Casciato said on a <a href=\"https://www.cliffordlaw.com/updated-zoom-invite-to-todays-9-a-m-cst-press-conference-clifford-law-offices-foia-request-reveals-structural-deficiencies-in-devastating-amazon-warehouse-collapse-in-downstate-i/\">press call</a> today. “Someone just simply didn’t finish the job,” said Casciato on the call. </p><div class=\"c-float-left\"><aside id=\"pZ1t2S\"><q>“Someone just simply didn’t finish the job”</q></aside></div><p id=\"DGkqlj\">The building was built before Amazon leased the facility, but the family believes that Amazon should have spotted the deficiencies. Their lawsuit also notes that the building lacked a basement shelter where employees might have been able to take cover.</p><p id=\"wWRlEU\">Amazon is also under scrutiny for <a href=\"https://www.theverge.com/22836393/amazon-warehouse-tornado-collapse-illinois-disaster\">pushing its employees to continue working</a> even though forecasts warned of tornadoes in the area at least a day in advance. Amazon did not immediately respond to a press inquiry from <em>The Verge</em>. Amazon spokesperson Kelly Nantel <a href=\"https://www.ksdk.com/article/news/local/report-questions-structural-stability-of-amazon-warehouse/63-f41c7ede-f0a5-4824-bfe6-2bfe4d566653\">told local news outlet KSDK</a> that “Investigators continue to conduct a comprehensive forensic examination of the building and debris — so it’s premature and misleading to suggest there were any structural issues. The original developer completed construction on this building in 2018 in compliance with all applicable building codes as documented by the city and the original owner. The building was re-inspected and passed City inspections in 2020 when Amazon leased the building.”</p><p id=\"NF8XZD\">The engineer ends the report with a note of caution, saying that concerns about the design of the building would require more analysis by other professionals “before any conclusions could be reached.”</p><p id=\"SUnKC9\">The Occupational Safety and Health Administration (OSHA) has <a href=\"https://www.theverge.com/2021/12/13/22833012/amazon-fatal-warehouse-collapse-osha-investigation-illinois-tornado\">opened</a> an investigation into what happened there that day and is reviewing the report, according to the McEwen family’s lawyer. </p><p id=\"rBk6UD\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/naRmM1dFIz9ECNVZRpWfO3lR5GI=/0x124:4200x2323/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23384615/1237195057.jpg",
  "description": "Supportive columns didn’t provide much support.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}