{
  "title": "Comcast and Charter team up in hopes of toppling Roku, Amazon streaming hardware",
  "url": "https://www.theverge.com/2022/4/27/23044434/comcast-charter-streaming-joint-venture-announced-flex",
  "date": "2022-04-27T13:57:04.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jV796NI3VIzY3Hjvf3myhBfYG-w=/196x0:2305x1406/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70799390/xclass.0.jpeg\" />        <figcaption>Image: Comcast</figcaption>    </figure>  <p id=\"SmdVke\">As the old saying goes, if you can’t beat ‘em, partner up with another overly powerful cable giant to give yourself a better shot. This morning, Comcast and Charter <a href=\"https://corporate.comcast.com/press/releases/comcast-charter-flex-nationwide-streaming-xclass-tv\">announced a new joint venture</a> that will see the two companies teaming up to develop “a next-generation streaming platform on a variety of branded 4K streaming devices and smart TVs.” This new platform and the devices that run it will square off against Amazon, Roku, Google, Apple, and other established streaming hardware players. </p><p id=\"1CNsgS\">The new venture is evenly divided between the two companies and is exclusively focused on streaming; it “does not involve the broadband or cable video businesses of either Comcast or Charter, which will remain independent.” </p><p id=\"UNUSk1\">Comcast says its Flex streaming platform will serve as the foundation for what’s coming next. It’s also contributing “the retail business for <a href=\"https://corporate.comcast.com/press/releases/comcast-launches-xclass-tv-powered-by-global-entertainment-platforms\">XClass TVs</a> and will contribute Xumo, a streaming service it acquired in 2020.” Comcast introduced its XClass TVs last year as an alternative to the many popular budget TVs that come preloaded with Roku, Amazon, or Google software. For its part, Charter — known better to many for its Spectrum brand — is kicking in $900 million over the course of several years.</p><p id=\"hQqT9C\">Peacock will unsurprisingly be heavily featured on the upcoming software and slate of products. But customers will also have access to the wide app selection presently available on Flex, so all the heavy hitters like Netflix, Prime Video, Disney Plus, Hulu, HBO Max, Spotify, and others are covered. </p><p id=\"60IoPk\">Here’s how the new partners see their early strategy playing out:</p><blockquote><p id=\"kE0232\">The XClass TVs will be available through national retail partners and potentially direct from Comcast and Charter to provide more customer choice. Xumo will continue to operate as a free global streaming service available through the joint venture’s products and third-party devices. Charter will offer the 4K streaming TV devices and voice remotes beginning in 2023. Comcast will continue to offer the Flex streaming platform as a streaming device and service to its customers. </p></blockquote><p id=\"D7LAaq\">A unified effort from the No. 1 and second-largest cable operators in the United States means you’re likely to see an enormous retail and advertising presence for whatever products arise from this joint venture. And, with the potential for big profits, there’s ample reason for them to be aggressive. </p><p id=\"tCGBPj\">More than one in every three smart TVs sold in the US and Canada last year <a href=\"https://newsroom.roku.com/news/2022/01/roku-tv-is-the-no-1-selling-smart-tv/wpvypjjd-1641222688\">was a Roku TV model</a>. Amazon and Google are also finding success with their TV hardware partnerships. If Comcast and Charter can eat into that even just a little, the new joint venture will be off to a good start. But it’s no small challenge: Roku and Google TVs are <a href=\"https://www.theverge.com/22914122/tcl-6-series-google-tv-r646-review-mini-led\">offering better picture quality</a> than ever before. They’re a proven, known quantity that consumers are familiar with. </p><p id=\"du8HMH\">Comcast and Charter note that “closing of the joint venture is subject to customary closing conditions.”</p><p id=\"ckDeGJ\"><small><em>Disclosure: Comcast is an investor in Vox Media, </em></small><small>The Verge</small><small><em>’s parent company.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NjWooXnwWFQXgIKgp1s0UvOPzBM=/0x49:2500x1358/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23419699/xclass.jpeg",
  "description": "New devices and TVs will run Comcast’s Flex platform.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}