{
  "title": "Congress advances new subsidies for domestic chip manufacturing",
  "url": "https://www.theverge.com/2022/2/4/22917942/competes-act-passes-house-usica-chips-act-funding",
  "date": "2022-02-04T18:25:25.000Z",
  "author": "Russell Brandom",
  "content": "      <figure>      <img alt=\"US Capitol 5 (Verge Stock)\" src=\"https://cdn.vox-cdn.com/thumbor/V5U2iX7Ct9lDd-8kB3kRr0QGn-w=/36x0:984x632/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472079/US_Capitol_5.1419979779.0.jpg\" />        <figcaption>US Capitol 5 (Verge Stock)</figcaption>    </figure>  <p id=\"tl06bi\">In a Friday session, the US House of Representatives passed the America COMPETES Act on a 222-210 vote. Colloquially described as a “China competition” bill, the COMPETES Act would provide new subsidies to the US semiconductor manufacturing industry, along with other measures aimed at stimulating the economy.</p><p id=\"z1E24n\">Votes fell roughly along party lines, with only a single House Democrat opposing the measure and only a single Republican voting in support.</p><div class=\"c-float-right\"><aside id=\"wmFs2Q\"><q>$39 billion in direct subsidies for new fabrication facilities</q></aside></div><p id=\"SKU7IB\">The COMPETES Act provides $52 billion of federal money to boost US semiconductor manufacturing, with $39 billion going to direct subsidies for new fabrication facilities. Many facilities eligible for this funding are <a href=\"https://semiliterate.substack.com/p/how-to-spend-39-billion\">already under construction</a>, including a TSMC <a href=\"https://www.cnbc.com/2021/10/16/tsmc-taiwanese-chipmaker-ramping-production-to-end-chip-shortage.html\">$12 billion foundry in Arizona</a> (set to begin production in 2024) and Intel’s <a href=\"https://www.theverge.com/2022/1/22/22895447/intel-ohio-chip-fab-manufacturing-cpu-processor-explained\">$20 billion foundry in Ohio</a>. </p><p id=\"iVjHDH\"><a href=\"https://www.theverge.com/2021/6/8/22457293/semiconductor-chip-shortage-funding-frontier-china-competition-act\">In June</a>, the Senate passed its own version of these subsidies as part of the US Innovation and Competition Act (USICA), although the bills vary in certain respects. The House and Senate versions of the bill will now need to be reconciled before the final text can head to President Biden’s desk and be signed into law.</p><p id=\"cZd7GC\">While the ongoing chip shortage has driven political momentum behind the bill, the new subsidies are unlikely to address the current supply chain problems. The subsidized foundries won’t be producing chips until 2024 at the earliest, at which point the current pandemic-related supply crunch will likely have subsided.</p><p id=\"Dk5Let\">The bill also establishes a new engineering-focused directorate within the National Science Foundation and provides $3 billion in subsidies for domestic manufacturing related to solar power.</p><p id=\"CxFd81\"><a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2022/02/04/statement-from-president-biden-on-house-passage-of-the-america-competes-act/\">In a statement after House passage of the bill</a>, President Biden emphasized the impact the provisions will have on US manufacturing. “The House took a critical vote today for stronger supply chains and lower prices, for more manufacturing – and good manufacturing jobs – right here in America,” Biden said in a statement. “I look forward to the House and Senate quickly coming together to find a path forward and putting a bill on my desk as soon as possible for my signature.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3X8gxAXQy4LVFuEwx6ZPPdYN0Co=/0x49:1020x583/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14410354/US_Capitol_5.1419979779.jpg",
  "description": "A big new economic bill is one step away from Biden’s desk.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}