{
  "title": "Congress is still spinning its wheels on autonomous vehicle regulation",
  "url": "https://www.theverge.com/2022/2/3/22916045/congress-autonomous-vehicle-hearing-av-start-legislation",
  "date": "2022-02-03T19:59:26.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Js2Oe7yOK0fGrkKSj-qRbIG91XE=/0x85:2040x1445/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70467966/vpavic_4412_20210111_0003.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"qnkYWl\">On Wednesday, Congress held its first hearing on autonomous vehicles <a href=\"https://www.theverge.com/2020/2/11/21133389/house-energy-commerce-self-driving-car-hearing-bill-2020\">in over two years</a>, and there was not a lot to show for it. At the end of the four-and-a-half-hour event, there was no indication that lawmakers were any closer to a consensus on how best to regulate this rapidly emerging technology. </p><p id=\"yMjQZE\">AV legislation has been stalled in Congress for over five years now, with lawmakers unable to reconcile differences over proposals to increase the number of autonomous vehicles on the road and prohibit states from setting their own performance standards. And after yesterday’s hearing, it was clear that a new set of concerns has risen in the interim, including the need to protect workers displaced by automation and to differentiate between advanced driver assistance systems and AVs. </p><div class=\"c-float-right\"><aside id=\"3T1tOd\"><q>it was clear that a new set of concerns has risen in the interim</q></aside></div><p id=\"5G2sTE\">In fact, those new concerns have almost completely replaced the old debates over safety exemptions and liability concerns. During the hearing, representatives from the AV industry made little effort to urge lawmakers to pass legislation and only half-hearted attempts to remind members that the current patchwork of state rules across the country was inconvenient to the wider deployment of AVs. </p><p id=\"3ac9OJ\">The American Vision for Safer Transportation Through Advancement of Revolutionary Technologies (AV START) Act “has been in limbo for a least half a decade,” said Rep. Tim Burchett (R-Tenn.). The bill would give automakers <a href=\"https://www.theverge.com/2017/7/19/15998356/self-driving-car-congress-legislation-lobbying-safety\">more leeway to manufacture and deploy vehicles without traditional controls</a>, like steering wheels, side-view mirrors, and pedals. It would also preempt states and cities from passing laws regarding autonomous vehicles.</p><p id=\"PseHxJ\">Democrats objected to green-lighting the mass rollout of robot vehicles without stringent safety and liability rules. And after several failed attempts, lawmakers basically gave up trying to pass it — and the AV industry similarly stopped pushing for its adoption. Instead, AV operators have turned their attention to the Biden administration’s effort to <a href=\"https://www.federalregister.gov/documents/2020/12/03/2020-25930/framework-for-automated-driving-system-safety\">develop a framework for AV safety through the federal rule-making process</a> — while still highlighting their frustrations with the lack of action from Congress. </p><p id=\"GbFjiV\">“That is certainly not workable for an efficient rollout of the technology, nor is it workable to actually realize even the potential [of AVs],” said Nat Beuse, vice president of safety at AV company Aurora, when asked about the patchwork of state laws regarding AV deployment. “That is a framework that just doesn’t work.”</p><div class=\"c-float-right\"><aside id=\"AVd2YI\"><q>“That is a framework that just doesn’t work”</q></aside></div><p id=\"dFJ1AC\">But instead of urging for the passage of AV START, which would replace the patchwork of state rules with a national framework, Beuse cited several proposed rules put out by the Department of Transportation and the National Highway Traffic Safety Administration that have a better chance of success than anything that would need to pass through a highly divided Congress. </p><p id=\"LAKL6P\">Essentially, the AV industry is learning to live with the current patchwork system. And the message to Congress was to stay out of the AV industry’s way. Laws and regulations should be “technology and business neutral,” Beuse said. And anything related to jobs that are being lost to automation was premature at best. </p><p id=\"Cdzfpm\">Some of the lawmakers with autonomous vehicles operating in their districts are understandably bullish about the future of the industry. Rep. Conor Lamb (D-Penn.) called Aurora “an incredible, farseeing company” while praising Beuse’s work at Uber before joining Aurora as head of safety. (No mention of Uber’s involvement in the <a href=\"https://www.theverge.com/2019/11/20/20973971/uber-self-driving-car-crash-investigation-human-error-results\">first pedestrian fatality</a> from an autonomous vehicle.)</p><p id=\"TxwFbM\">Other members, though, were more skeptical of the claim that AVs could make a difference in reducing traffic fatalities. Rep. Hank Johnson (D-Ga.) brought up the statistic that “94 percent traffic crashes are caused by human error” — <a href=\"https://www.theatlantic.com/ideas/archive/2021/11/deadly-myth-human-error-causes-most-car-crashes/620808/\">an erroneous data point</a> that has nonetheless been used as a talking point by the AV industry for years to make the argument that robot drivers are preferable to human ones. </p><p id=\"5eeZDk\">“In fact, numerous structural issues play a role in traffic crashes, including the distance between crosswalks and... the width of a lane as the speed limit changes, and the presence or absence of bike lanes,” Johnson said. “The idea that self-driving cars are the solution misses the bigger picture.”</p><div class=\"c-float-right\"><aside id=\"4KsGyi\"><q>“In fact, numerous structural issues play a role in traffic crashes”</q></aside></div><p id=\"7tZU8c\">But while AV operators rarely use the “94 percent” figure anymore, they haven’t completely abandoned it as a talking point. Last week, Transportation Secretary Pete Buttigieg revealed a <a href=\"https://www.transportation.gov/nrss/usdot-national-roadway-safety-strategy\">comprehensive new roadway safety plan</a>, in which the government asserts that “the overwhelming majority of serious and fatal crashes includes at least one human behavioral issue as a contributing factor.”</p><p id=\"F5Gd1x\">The safety plan does not specifically link the idea of human error in traffic crashes to the need to replace human drivers with autonomous vehicles  — but the AV industry doesn’t need much prompting. Ariel Wolf, general counsel of the Autonomous Vehicle Industry Association, called it a “key point... The autonomous vehicle industry, fundamentally and first and foremost, exists to address that safety failure as contributing to the crisis on our roadways.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vtjG0Vqkwjh8mmGXyWImPG0Uihk=/0x231:2040x1299/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22309273/vpavic_4412_20210111_0003.jpg",
  "description": "No indication we’re any closer to AV legislation",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}