{
  "title": "Conservative Twitter accounts got boost in followers after Musk acquisition, data shows",
  "url": "https://www.theverge.com/2022/4/27/23045005/conservative-twitter-follower-boost-musk-acquisition-data",
  "date": "2022-04-27T19:18:12.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gI9BMGkzcMiCnpmM4kE3_aMIpv0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70801199/VRG_Illo_STK022_K_Radtke_Musk_Thumbs_Up.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"duoUiD\">It’s not your imagination: follower counts on Twitter really have been shifting wildly in response to news that Elon Musk had <a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\">finalized a deal</a> to acquire the platform.</p><p id=\"xoVVTf\">Data compiled by <em>The Verge</em> from social media statistics site Social Blade shows that in the two days since the deal was completed, influential conservative accounts have increased their follower counts at roughly ten times the average daily rate for the month leading up to the acquisition.</p><p id=\"xyZuby\">Meanwhile, popular liberal accounts have suffered, collectively losing hundreds of thousands of followers on April 25th and 26th after a month of gains.</p><p id=\"YH6p5K\">The shifts are unlikely to be the result of changes within Twitter’s management of the platform, as the deal will not close for months and Musk has not had time to directly affect operations. Instead, the shifts appear to be an organic reaction to the news, with users either joining or leaving the platform in anticipation of Musk’s ownership.</p><div id=\"hujAfR\"><iframe title=\"Change in follower count\" aria-label=\"Interactive line chart\" id=\"datawrapper-chart-3XmzM\" src=\"https://datawrapper.dwcdn.net/3XmzM/4/\" scrolling=\"no\" frameborder=\"0\"  height=\"407\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script></div><p id=\"R572Tb\">The data provides empirical backing to claims made by prominent conservatives like Donald Trump Jr, who <a href=\"https://twitter.com/DonaldJTrumpJr/status/1519002011651477511\">shared screenshots</a> from his own social media analytics that appeared to show disproportionate follower gains on April 26th.</p><p id=\"euqt6s\">To investigate the claims, <em>The Verge</em> compiled a list of 100 influential Twitter accounts, 50 each from the political <a href=\"https://github.com/corintxt/post-elon-twitter-follows/blob/main/liberal-list.csv\">left</a> and <a href=\"https://github.com/corintxt/post-elon-twitter-follows/blob/main/conservative-list.csv\">right</a> and each with a minimum of 100,000 followers. </p><p id=\"XXCcla\">Using data from Social Blade, a service that provides analytics for a range of social media platforms, we pulled 30 days of historical information on the number of followers for each account and calculated the day-to-day change as an absolute value and a percentage change. We then calculated average values for the percentage change across both ideological groups. (View the <a href=\"https://github.com/corintxt/post-elon-twitter-follows\">full dataset and calculations on GitHub</a>.)</p><p id=\"aPQmCw\">Out of the 50 conservative accounts in our dataset, 48 made unusually large follower gains on April 25th and 26th, while only two accounts lost followers. On April 26th, the conservative accounts in our dataset gained 17,229 followers on average. The single largest gain went to Florida Governor Ron DeSantis, who gained 141,556 followers.</p><div class=\"c-float-right\"><div id=\"tAUn7H\"><iframe title=\"Average daily follower change\" aria-label=\"Grouped Column Chart\" id=\"datawrapper-chart-GDt0b\" src=\"https://datawrapper.dwcdn.net/GDt0b/1/\" scrolling=\"no\" frameborder=\"0\"  height=\"522\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script></div></div><p id=\"moqpjs\"></p><p id=\"LBH5mf\">All 50 of the liberal accounts in our dataset lost followers across the same two days. On average, each account lost 6,062 followers on April 26th, with the single largest loss from the account of Vice President Kamala Harris, whose follower count decreased by 22,453.</p><p id=\"SlXJpV\">Based on our limited sample, the change seemed to be a net gain for Twitter in terms of users. Follower increases for conservative accounts outweighed losses from liberal accounts by 3:1, with a net increase of 638,000 followers when losses between April 25th and April 26th are subtracted from gains. The exact number of new accounts is hard to quantify since there are undoubtedly significant overlaps between the new followers of many accounts in the dataset, but there’s strong evidence that account gains outweighed losses.</p><p id=\"nWiCx1\">The precise cause for the dramatic changes in follower count is still unclear, although Twitter told <a href=\"https://twitter.com/DonaldJTrumpJr/status/1519002011651477511\">NBC News</a> that fluctuations over the same period were “a result of an increase in new account creation and deactivation.” If true, it would represent a shift of hundreds of thousands of users over a single day, a surprising explanation for news of this kind.</p><p id=\"kSmbJu\">Twitter did not immediately respond to a request for comment.</p><p id=\"EvHrxv\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/JZZhD4gPOgsjAREtT4k5CPxPc08=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390589/VRG_Illo_STK022_K_Radtke_Musk_Thumbs_Up.jpg",
  "description": "Data shows hundreds of thousands of followers joining the political right.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}