{
  "title": "Construction begins on New York’s first offshore wind farm ",
  "url": "https://www.theverge.com/2022/2/14/22933095/new-york-offshore-wind-farm-south-fork-long-island-construction",
  "date": "2022-02-14T17:55:25.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Block Island wind farm as seen from Montauk Point, New York\" src=\"https://cdn.vox-cdn.com/thumbor/du0Zy8yXwmxncaOUNGijqJGi5-0=/0x167:4000x2834/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507800/1317979252.0.jpg\" />        <figcaption>Montauk Point, N.Y.: The Block Island wind farm, from Montauk Point, on Long Island, New York on April 16, 2021. | Photo by Mark Harrington/Newsday RM via Getty Images</figcaption>    </figure>  <p id=\"Uc5AZQ\">New York State <a href=\"https://www.governor.ny.gov/news/governor-hochul-announces-start-construction-new-yorks-first-offshore-wind-project\">broke ground</a> on Friday on its first offshore wind farm, kicking off a boom in similar projects aimed at transforming the state’s — and the nation’s — energy mix. The South Fork Wind project off the coast of Long Island is expected to be operational by the end of 2023.</p><p id=\"iAw5uR\">New York has the largest pipeline of offshore wind projects underway of any state in the nation, with five in active development. South Fork Wind is being billed as one of the first-ever commercial-scale offshore wind farms in North America. Once completed, it should be able to generate 130 megawatts (MW) of power — enough to power 70,000 homes in nearby East Hampton.</p><p id=\"fqJvuj\">That alone amounts to a major scaling up of offshore wind capacity in the US. The nation so far only has two operational wind farms along its coasts — off the shores of <a href=\"https://dwwind.com/project/block-island-wind-farm/\">Rhode Island</a> and <a href=\"https://www.boem.gov/renewable-energy/state-activities/coastal-virginia-offshore-wind-project-cvow\">Virginia</a> — with a combined capacity of just 42 MW.  </p><div class=\"c-float-right\"><aside id=\"y1C2iQ\"><q>That’s set to change dramatically over the next few years</q></aside></div><p id=\"BfciPv\">That’s set to change dramatically over the next few years. Ørsted and Eversource, the energy companies developing South Fork, have an even bigger project in the works nearby: Sunrise Wind, a 924-MW wind farm that’s expected to break ground <a href=\"https://www.youtube.com/watch?v=Fi8dgFSEw3c\">next year</a>. </p><p id=\"qIiXXH\">Altogether, all the offshore projects under development in New York state’s current portfolio total over <a href=\"https://www.nyserda.ny.gov/All-Programs/Offshore-Wind/Focus-Areas/NY-Offshore-Wind-Projects\">4,300 MW</a> of clean energy. By 2035, the state hopes to harness more than twice as much renewable energy from offshore wind. To get there, Governor Kathy Hochul in January <a href=\"https://www.governor.ny.gov/news/governor-hochul-announces-nation-leading-500-million-investment-offshore-wind\">announced</a> $500 million in funding to build up manufacturing and supply chain infrastructure for offshore wind. The money will also go towards updating the state’s ports to prepare for the boom in wind farms.</p><p id=\"GcK3s6\">By 2035, the Biden administration envisions a 100 percent clean power sector nationwide. Offshore wind is expected to <a href=\"https://www.theverge.com/2022/1/12/22879269/biden-climate-public-lands-water-renewable-energy-offshore-wind-solar-grid\">play a big part in reaching that goal</a>, with the administration <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/29/fact-sheet-biden-administration-jumpstarts-offshore-wind-energy-projects-to-create-jobs/\">establishing a target of 30,000 MW</a> of installed offshore wind capacity by 2030 last year. In pursuing that goal, the administration has recently <a href=\"https://www.theverge.com/2021/10/13/22725234/biden-offshore-wind-boost-united-states-coastlines\">announced plans</a> to auction off vast tracts of water along the nation’s continental coastlines. That includes areas in the New York Bight, off the shores of New York and New Jersey, where the administration plans to hold an <a href=\"https://www.boem.gov/renewable-energy/state-activities/new-york-bight\">offshore wind energy auction</a> later this month.</p><p id=\"ExaX55\">South Fork Wind is further east, about 35 miles away from Montauk Point, Long Island. There, 12 Siemens-Gamesa turbines will tower over the Atlantic — each with blades longer than the Statue of Liberty.</p><aside id=\"TVIFOS\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Offshore wind projects are outpacing the ships that build them \",\"url\":\"https://www.theverge.com/2022/2/3/22916065/offshore-wind-energy-demand-installation-vessels-supply\"}]}'></div></aside><p id=\"FepCP8\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n41hwO4vvDBFdiBqTVraaCCMc2c=/0x453:4000x2547/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23240937/1317979252.jpg",
  "description": "It’s just the start of the Empire State’s offshore wind boom.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}