{
  "title": "Coros Vertix 2 review: a work in progress",
  "url": "https://www.theverge.com/23131541/coros-vertix-2-review-fitness-tracker-gps-smartwatch",
  "date": "2022-05-20T14:53:52.000Z",
  "author": "Victoria Song",
  "content": "  <p>This behemoth of a GPS watch has a few things to iron out</p> <p class=\"p--has-dropcap p-large-text\" id=\"8b7yqU\">When it comes to multisport fitness watches, you probably think of something from Garmin, Polar, or Suunto. But if you enjoy outdoor sports and are terminally online, you might have also heard of Coros. The company is a relative newcomer to the space, but I’ll admit to being curious when I started seeing it pop up more frequently in running subreddits, forums, and on TikTok<strong> </strong>during the pandemic. The most devoted athletes in this category already know what they do and don’t like from their GPS watches — and I was eager to see how the $699 Coros Vertix 2 would measure up against the category’s heavyweights. </p><p id=\"QWDROd\">The Vertix 2 is the most expensive and full-featured watch in Coros’ lineup. Most notably, it supports dual-frequency satellite communication and can access all five major satellite systems (GPS, GLONASS, Galileo, BeiDou, and QZSS) simultaneously. That’s a first for a smartwatch, and the promise is the Vertix 2 should be able to deliver accurate GPS tracking even in the most challenging environments. </p><div id=\"Kl7329\"><div data-anthem-component=\"scorecard:11252937\"></div></div><p id=\"Y2FQjM\">Basically, this is supposed to be a tough GPS watch for the most intrepid athletes. That’s evident from the Vertix 2’s specs. It has an estimated battery life of 140 standard GPS hours and 60 <em>days</em> of everyday use. Compared to its predecessor, the Vertix 2 also adds color topographic maps, the ability to control an action camera, 32GB of music storage, and “ECG capability.” (It’s not truly an ECG, though more on that in a bit.) As far as durability goes, the case is made of titanium, the display is a “diamond-like coated sapphire glass,” and it has 10 ATM (328 feet) of water resistance. </p><p id=\"ZXAAwD\">Just don’t expect a <em>smart</em> fitness watch. The extent of its smart features is delivering push notifications and setting timers and alarms. You’re not going to get NFC payments, the ability to reply to texts, or a third-party app ecosystem. (That said, the most recent firmware update did add the ability to ping your phone!) </p><p id=\"07Mcri\">Looking at photos of the Vertix 2, I knew it would be big, chunky, and heavy. It’s got a 1.4-inch LCD display housed in a 50mm case and 26mm interchangeable straps. Despite the use of lightweight titanium, it still weighs a whopping 89 grams (that’s over 10 grams more than two 45mm aluminum Series 7s) and is 15.7mm thick. (I wince to think about what it would weigh if Coros used stainless steel here.) How could it <em>not</em> be a behemoth?</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6KC1oT9kwZKeQzbDZ2e0a6A9YV0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576005/vsong_220516_5227_0007.jpg\">      <figcaption><em>I got a minor rash after a week of wear because the watch didn’t fit me well and rubbed against my skin.</em></figcaption>  </figure><p id=\"bwDOfx\">Even so, I wasn’t prepared for just how big, chunky, and heavy the watch was on my wrist. It looks comically large on me, and there is no getting a jacket sleeve over this thing. I have to wear the strap super tight during exercise, and yet I can still fit two chopsticks through the gap between my skin and the lugs. I feel gravity pulling on the case when I swing my arm running. You can bet I woke up in the middle of the night to take it off when I wore it to sleep. After a week of wear, I ended up with a minor rash. I can make do with a 45–47mm watch, but the Vertix 2 simply wasn’t made for my pint-sized wrists.</p><div class=\"c-float-right c-float-hang\"><aside id=\"NoHm5k\"><q>Not every outdoor enthusiast is a huge, hulking person</q></aside></div><p id=\"erfbH5\">I’m fully aware this watch caters to a different body type. But not every outdoor activity enthusiast is a huge, hulking person. This excludes many people, particularly women, from using Coros’ most advanced smartwatch — through no fault of their own. Even putting that aside, 50mm may be too large for people who <em>like</em> bigger watches, as the Vertix 2 only comes in one size. At least Garmin’s Fenix 7 series gives you <a href=\"https://www.theverge.com/22937154/garmin-fenix-7s-review-fitness-tracker-smartwatch\">multiple size options</a>.</p><p id=\"RRNqkS\">There are benefits to the Vertix 2’s larger screen, however. Notifications are much easier to read, and the memory-in-pixel LCD is highly visible in direct sunlight. You can also fit more data within each screen during an exercise — which is neat because Coros lets you customize what you see to your exact preferences. If you want to know as much as you possibly can at a glance, the Vertix 2 is a great option. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/g6ssc_C8ZBQ287MHB8ueFy9_TK4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576006/vsong_220516_5227_0008.jpg\">      <figcaption><em>The case measures 50mm and almost 16mm thick. </em></figcaption>  </figure></div><p id=\"0HuIyU\">Beyond hardware, the watch’s software and features are typical for this category. With the exception of action cam control and dual-band satellite frequency, Coros isn’t bringing anything we haven’t seen before. (Speaking of which, I wasn’t able to test the action cam feature as I don’t own one.) My main issue is the Vertix 2 feels like a work in progress.</p><p id=\"dqwKys\">Take menu navigation. Buttons reign supreme for multisport watches because they’re more likely to register sweaty fingers than touchscreens. The Vertix 2 opts for two buttons along with a rotatable crown — and the crown throws a wrench in things as it’s the <em>only</em> way to scroll up and down through menus. It’s simply not intuitive.</p><p id=\"GpLjtu\">In fact, Coros doesn’t really follow the rules when it comes to smartwatch UI. You can’t flick your wrist to wake the watch. You actually can’t do much until you long-press the crown to unlock the screen. I can see that preventing accidental presses during workouts, but it’s annoying when you want to quickly access something. (I’m also used to long-presses bringing up digital assistants or app shortcuts.) That’s just one example. There were plenty of times when I had to fight against muscle memory while using the Vertix 2 — like swiping to view notifications or using the back button to scroll down. I imagine lots of people would have similar problems at first. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tZpgxDi5Xz68dPbZNDMfhBHecXk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576003/vsong_220516_5227_0005.jpg\">      <figcaption><em>It’s thick! The crown is also the primary form of scrolling, which doesn’t always work well.</em></figcaption>  </figure><div class=\"c-float-right c-float-hang\"><div id=\"wxOh4M\"><div data-anthem-component=\"aside:11252235\"></div></div></div><p id=\"yPu6O4\">You get used to it over time, but the crown can still occasionally be finicky. While trying to end one run, I kept scrolling past the “Finish” button even though I was barely rotating the crown. You don’t have that issue when scrolling with physical buttons. And while the watch has a touchscreen, it’s limited to swiping through maps, widgets, and workout stats during activity. Even then, the latter isn’t enabled by default — you have to manually turn that on in the settings. A lot of this could’ve been avoided by giving users an additional option aside from the rotating crown. </p><p id=\"o4k81K\">For health features, it sounds cool that the Vertix 2 has an ECG sensor. In practice, it’s a gimmick. You can’t actually take ECG readings for atrial fibrillation in the way an Apple Watch, Fitbit, or Samsung Galaxy Watch 4 can. Unlike those watches, the Vertix 2 hasn’t received FDA clearance to do that. Instead, it measures your heart rate variability (HRV) for 60 seconds, which you can then view in the app. HRV can be handy for gauging recovery or stress, but you don’t need an ECG-level sensor to track that metric. </p><p id=\"kzHgdx\">Similarly, sleep tracking was a miss. I never actually made it through a whole night wearing the Vertix 2, but even if I did, the sleep metrics are incredibly basic. The majority of the time, I didn’t even have access to sleep stages. That changed with a recent firmware update, which added REM tracking.</p><p id=\"95vEcH\">And while it’s fine that Coros added 32GB of storage for music, it’s not that useful because the Vertix 2 doesn’t support streaming services or offline downloads. You have to go old school and sideload MP3s. It’s true there will always be people who prefer that, but the vast majority of people don’t curate MP3 libraries anymore. Personally, I haven’t had to drag and drop music files onto a portable player in about a decade — and I’m not about to start again in 2022. In all fairness, Coros isn’t the only fitness watchmaker that does this. It just makes less and less sense with each passing year.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/riB8AfiREG8D7zShitRUMbzwInE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576001/vsong_220516_5227_0001.jpg\">      <figcaption><em>This watch arrives in a very extra carrying case.</em></figcaption>  </figure><p id=\"jXhMsQ\">Maps on the Vertix 2 are passable, though it’s not going to dethrone the navigation features offered by Garmin or Polar. I would’ve been more okay with this had the Vertix 2 been priced lower. As it stands, you’re paying the same as some Fenix 7 models but getting less detail and context. There are no labels, and landmarks aren’t highlighted, either. There’s also no turn-by-turn navigation, which I’d expect to see at this price point. The Vertix 2’s maps would be better than nothing in a pinch, but when I got turned around during a trail run, I ended up reaching for my phone because at least Google Maps labels things. </p><p id=\"eDDP2S\">Another thing to be aware of: the Vertix 2 drops ANT Plus compatibility. Personally, I mostly use Bluetooth accessories so it didn’t affect me much. It can also measure running power from the wrist with no additional accessories needed. However, if you use a lot of ANT Plus accessories in your training, the Vertix 2 isn’t the best choice for you.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QseQCNPA4XtPXcTBpvy2LUkMJds=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576002/vsong_220516_5227_0003.jpg\">      <figcaption><em>The ECG sensor is only used to measure HRV.</em></figcaption>  </figure><p id=\"xnwCKt\">It might sound like all I have are complaints, but I want to acknowledge that the Vertix 2 is a good showing for a company that’s only been making fitness watches for four years. Of course a younger company has things to iron out when compared to companies that have been leading the space for at least a decade. </p><div class=\"c-float-left c-float-hang\"><aside id=\"tnzcUT\"><q>The Vertix 2 is a good showing for a company that’s only been making fitness watches for four years</q></aside></div><p id=\"pq5ok4\">There’s a lot I liked about the Vertix 2 as well. For starters, the Coros app keeps things simple but still offers a good level of customizability. I liked that you could program your own custom workouts and training plans. That was something I wished I could do more easily when I was training for a half marathon not that long ago. Not everyone will use that feature, but I appreciate the option exists. I loved that you could easily customize several activity screens to your exact preferences. I dug training insights, like my VO2 Max, running power, and even my humbling race time predictions. The streamlined design was also a refreshing change of pace from the crowded Garmin Connect or Polar Flow apps. Data nerds might bristle, but it’s more than fine if you want to spend as little time in a companion app as possible. </p><p id=\"S3Vrq2\">Where the Vertix 2 shines is battery life and GPS accuracy. I haven’t been wearing this watch for 60 days, but it’s been about two weeks with about 30–60 minutes of GPS activity a day. I still have 85 percent battery. Enabling dual-frequency satellite communication or anything beyond standard GPS mode drained the battery faster — but this is still phenomenal stamina. I have zero doubt that this is a watch where you can leave the charger at home, even if you’re on a multiday trip jam-packed with GPS activity.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FkvSaauHSYTHFbHL9XxYnbdEJgs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576004/vsong_220516_5227_0006.jpg\">      <figcaption><em>While this watch is too big for me, larger screens do offer better readability.</em></figcaption>  </figure></div><p id=\"WDkvvV\">Speaking of GPS, the Vertix 2 never had trouble finding a signal. That’s impressive considering I live in a challenging area for GPS with lots of tall buildings and water. It also had no trouble when I went trail running in a park with dense tree coverage. In my testing, the Vertix 2 recorded distances that were consistently within a tenth of a mile of my phone and my Apple Watch Series 7. The routes recorded by the app, Vertix 2, and Series 7 also highly corresponded to each other. There were some parts where the Series 7 was slightly more accurate than the Vertix 2 in standard GPS mode. But there were also areas where the Vertix 2 outdid the Series 7. All in all, the Vertix 2 met all of my GPS tracking expectations.</p><p id=\"93Qb0Z\">It had a few hiccups when it came to heart rate, mostly during interval runs. But the majority of the time it was within 5–10 beats per minute<strong> </strong>of my Polar H10 chest strap. In this case, I mostly attribute any wonky readings I saw to the fact that the watch didn’t fit me well.</p><div><aside id=\"FoWVwR\"><q>The Vertix 2 feels like a step on the way to something better</q></aside></div><p id=\"Oj5DLg\">Overall, the Vertix 2 feels like a step on the way to something better. It shows promise, especially since it excels in two areas that endurance athletes care about: battery life and GPS tracking. It’s encouraging to see that Coros continues to push firmware updates that add extra value as well. However, those rough edges are still there, and for the price, you’ll be better served by a discounted <a href=\"https://www.theverge.com/circuitbreaker/2019/8/29/20838081/garmin-fenix-6-solar-price-date\">Garmin Fenix 6</a>. With Coros’ other watches, the lower price is an incredible bargain for the feature set. If a few things are unpolished, the price makes them easier to overlook. It’s harder to do that when the Vertix 2 costs $700. The $499.95 <a href=\"https://www.theverge.com/22904291/polar-grit-x-pro-review-gps-smartwatch-fitness-tracker\">Polar Grit X Pro</a>, for example, has a wealth of training features, accurate GPS, and turn-by-turn navigation.</p><p class=\"c-end-para\" id=\"XcPa78\">This isn’t the watch for me (or really anyone with a similar body type as me), but that doesn’t mean no one should buy it. I’d recommend it if you can find it on sale, aren’t put off by bulky and heavy watches, frequently travel to areas with poor GPS signal, or just want something simpler than a Garmin or Polar. In any case, I saw enough on the Vertix 2 that I’m intrigued to see what Coros does next. </p><p id=\"5J3Rs9\"><em>Photography by Victoria Song / The Verge</em></p><p id=\"4wiO7g\"></p><p id=\"z7cs94\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7gFBivAVgntwKGKgBLt8tFaRKKA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23576008/vsong_220516_5227_0009.jpg",
  "description": "A promising watch that’s just a bit rough around the edges.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}