{
  "title": "Corsair’s updated full-size K70 keyboard is more responsive and customizable",
  "url": "https://www.theverge.com/2022/2/10/22866427/corsair-k70-rgb-pro-wired-mechanical-keyboard-usb-cable",
  "date": "2022-02-10T15:55:36.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FxPzoNZXI2K_kAhiH0RrsB7MsPA=/0x1:1580x1054/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70493057/K70_RGB_PRO_PBT_23.0.jpg\" />        <figcaption><em>The K70 RGB Pro.</em> | Image: Corsair</figcaption>    </figure>  <p id=\"MD28QV\">Corsair’s latest mechanical keyboard is the K70 RGB Pro, which adds a numpad to the <a href=\"https://www.theverge.com/2021/5/5/22420824/corsair-k70-rgb-tkl-review\">K70 RGB TKL</a> released last year while retaining many of its other improvements. These include reduced input latency, as well as a detachable USB cable and standard key layout that should make it easier to customize the K70 RGB Pro with third-party accessories.</p><p id=\"IXf3Bm\">The K70 RGB Pro is designed first and foremost as a gaming keyboard, with an emphasis on speed and responsiveness. It internally scans for keypresses at 4,000Hz and can report them to an attached PC at up to 8,000Hz. Compared to more typical 1,000Hz keyboards, this should result in reduced input latency. The K70 RGB Pro is also available with Cherry MX Speed switches, which need to be pressed less far before they register a press, alongside more typical Red, Blue, Brown, and Silent Red switch options.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ajtnjgq1HYtUgm-XXcSGbMISjiw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23144063/K70_RGB_PRO_PBT_36.jpg\">      <cite>Image: Corsair</cite>      <figcaption><em>The K70 RGB Pro’s detacheable USB cable.</em></figcaption>  </figure><p id=\"N5KIi9\">It’s worth noting that the K70 RGB Pro uses standard mechanical switches, which are unlikely to be as responsive as the optical switches found in Corsair’s higher-end K100 keyboard. It may also lose out in responsiveness to keyboards like <a href=\"https://www.theverge.com/22691381/razer-huntsman-v2-review-optical-mechanical-keyboard-8000hz-polling-rate-linear-clicky-switches\">Razer’s recent Huntsman V2</a>, which internally checks for keypresses at 8,000Hz, giving them a slight theoretical speed advantage. But we’re talking about differences of a fraction of a second, which arguably make little difference to all but the best of players.</p><p id=\"Ho1uCl\">Another feature inherited from the K70 RGB TKL is its “tournament switch,” which disables distracting flashing backlights and macros for when you want to focus on a game. A magnetic wrist rest is included for keeping your hands at a comfortable angle while using the keyboard, and keycaps are double-shot PBT for the best mix of durability and aesthetics.</p><p id=\"zaVcmA\">The Corsair K70 RGB Pro starts at $159.99 in the US, €189.99 in the EU, and £169.99 in the UK. We’ve followed up with the company for an exact release date. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kOk992d_KSFAyg55UnFOzY7dSgQ=/0x114:1580x941/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23144062/K70_RGB_PRO_PBT_23.jpg",
  "description": "Inheriting improvements from the tenkeyless version",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}