{
  "title": "Corsair’s K70 gaming keyboard updated with more responsive optical switches",
  "url": "https://www.theverge.com/2022/4/7/23014554/corsair-k70-mechanical-gaming-keyboard-opx-optical-switches-price",
  "date": "2022-04-07T13:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IRpRbS3ylH4CrvVNynOG8g3V-FA=/0x0:2400x1600/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70720816/K70_RGB_TKL_OPX_PBT_31.0.jpg\" />    </figure>  <p id=\"P4b8GX\">Corsair is announcing an updated version of its K70 mechanical keyboard today that comes with more responsive OPX optical mechanical switches. It costs $149.99, $10 more than the <a href=\"https://www.theverge.com/2021/5/5/22420824/corsair-k70-rgb-tkl-review\">standard K70 released last year</a> with more traditional Cherry mechanical switches. Aside from the switch change, the new K70 is broadly identical to last year’s model, with a detachable USB-C cable, RGB lighting, and a tenkeyless layout. </p><p id=\"jgmoAS\">The reason you might want a gaming keyboard with optical switches comes down to debounce delay, which typically affects keyboards with traditional mechanical switches. When you press a mechanical switch, there can be a brief period when its metal contacts clatter together before eventually settling, and this means the keyboard can take a moment to register a keypress. Optical switches simply interrupt a beam of infrared light when pressed and don’t suffer from this delay by default, making them a great choice for gaming.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YEC_SB_1MeTgcH8dtd1yhAiJsjk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23373478/K70_RGB_TKL_OPX_PBT_37.jpg\">      <cite>Image: Corsair</cite>      <figcaption><em>The K70’s optical mechanical switches.</em></figcaption>  </figure><p id=\"o7nMPk\">But the benefits of optical switches on Corsair’s keyboards are a little more complicated. Spokesperson Justin Ocbina tells me the company’s Axon technology can <em>already</em> avoid any debounce delay incurred when you first press a mechanical switch. The benefits of an optical switch on Corsair’s keyboard come when you repeatedly press the same switch. There’s no 5ms period when a key can’t register a second press after a first; it’s ready to be pressed again instantly — handy for any games where speed is of the essence.</p><p id=\"DtmJ6Y\">Ocbina declined to share who is manufacturing Corsair’s OPX optical mechanical switches but said it’s a linear switch with a 1mm actuation distance. That compares to a 2mm actuation distance for Cherry’s MX Red switch or 1.2mm for its speed-focused Silver switch. The K70 scans for keypresses at 4,000Hz internally (four times faster than many mechanical keyboards) and reports them to a connected PC at up to 8,000Hz (eight times faster than most). Corsair says this keeps median latency below 0.25ms.</p><p id=\"BYQlVm\">Other features of the K70 include durable PBT double-shot keycaps, a hardware tournament switch to disable macros during competitive play, media keys, a volume roller, and the ability to coordinate the keyboard’s lighting effects via Corsair’s iCUE software. For an idea of how the non-switch parts of the keyboard perform in practice, check out our review of the <a href=\"https://www.theverge.com/2021/5/5/22420824/corsair-k70-rgb-tkl-review\">Corsair K70</a> from last year. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Z6-nifwHF3V_yYjP9ruAyw88eDo=/0x172:2400x1429/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23373476/K70_RGB_TKL_OPX_PBT_31.jpg",
  "description": "The original had standard mechanical switches.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}