{
  "title": "Costa Rican president says country is ‘at war’ with Conti ransomware group ",
  "url": "https://www.theverge.com/2022/5/18/23125958/costa-rica-president-says-country-at-war-conti-ransomware-cybercrime",
  "date": "2022-05-18T22:01:22.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2gossIeKpQFp89z4ngasSlZJZl4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70885206/acastro_170621_1777_0004_fin.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"G1Gkn0\">Ransomware — and particularly the Conti ransomware gang — has become a geopolitical force in Costa Rica. On Monday, the new Costa Rican president Rodrigo Chaves – who <a href=\"https://apnews.com/article/caribbean-central-america-costa-rica-carlos-alvarado-327d0204171eedc2c6575e0f805cf1e0https://apnews.com/article/caribbean-central-america-costa-rica-carlos-alvarado-327d0204171eedc2c6575e0f805cf1e0\">began his four-year term</a> only ten days ago – declared that the country was <a href=\"https://www.bbc.com/news/technology-61323402\">”at war” with the Conti cybercriminal gang</a>, whose ransomware attack has disabled agencies across the government since April.</p><p id=\"hHQf4l\">In a forceful statement made to press on May 16th, President Chaves also said that Conti was <a href=\"https://www.cyberscoop.com/costa-rica-conti-ransomware-extortion-collaborators/\">receiving help from collaborators within the country</a>, and called on international allies to help.</p><p id=\"wWgdHU\">“We’re at war and this is not an exaggeration,” Chaves <a href=\"https://www.nacion.com/el-pais/servicios/rodrigo-chaves-sobre-ataques-de-hackers-gente/K7S2YPH3BFAARNJHWDBC4MI4Y4/story/\">told local media</a>. “The war is against an international terrorist group, which apparently has operatives in Costa Rica. There are very clear indications that people inside the country are collaborating with Conti.”</p><div class=\"c-float-right\"><aside id=\"z5dV2I\"><q>“We’re at war and this is not an exaggeration”</q></aside></div><p id=\"T71jBs\">President Chaves’ declaration of war against Conti comes in the face of unusually belligerent rhetoric from the ransomware group, which <a href=\"https://therecord.media/ransomware-gang-threatens-to-overthrow-new-costa-rica-government-raises-demand-to-20-million/\">stated its intent</a> to “overthrow the government by means of a cyberattack.” In a message posted to the Conti website, the ransomware group urged citizens of Costa Rica to pressure their government to pay the ransom, which has been doubled from an initial $10 million to $20 million.</p><p id=\"FKXrLU\">Over the period of the attack, the US government has also <a href=\"https://www.theverge.com/2022/5/9/23064321/costa-rica-conti-ransomware-attack-state-of-emergency-reward\">offered a bounty of up to $10 million</a> for information that could identify or locate the main coordinators of the Conti group’s operations, or $5 million for information leading to the arrest of any Conti member.</p><p id=\"hK0WGT\">The severe impact of Conti’s attack on the Costa Rican government points to the continued ability of the largest ransomware groups to operate on a scale that can pose a threat to nation states, and draw on funding reserves that allow them to buy their way into some of the most sensitive computer systems by bribing those with access.</p><p id=\"A5RVo4\">“We’re at the point now where these ransomware groups make billions of dollars, so their ability to get access to these [networks] is only limited by their own desire,” said Jon Miller, CEO and co-founder of anti-ransomware software platform Halcyon. “Month after month, more of these groups are coming online. This is a drastically growing problem.”</p><p id=\"FXHDzP\">As the Costa Rican crisis continues, more knock-on effects are reaching citizens of the country. Statements made by Chaves put the <a href=\"https://apnews.com/article/technology-government-and-politics-caribbean-gangs-381efc2320abb5356dee7f356e55e608\">number of government agencies hit at 27</a>, including the finance ministry and the Ministry of Labor and Social Security. One of the effects was that the government was unable to collect taxes through traditional means, Chaves said.</p><p id=\"SxTQVV\">So far, the Costa Rican president has remained intransigent that the government will pay nothing to the ransomware gang. With neither side appearing to budge, the situation has reached a stand-off – but one that will be closely watched by other governments hoping to avoid a similar fate.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SBG3ciGoz9l7iAyeJfyd80XJ1MU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8726987/acastro_170621_1777_0004_fin.jpg",
  "description": "\"We’re at war, and this is not an exaggeration.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}