{
  "title": "Court lets Texas restrictions on social platform content moderation take effect",
  "url": "https://www.theverge.com/2022/5/11/23067002/texas-netchoice-paxton-hb20-social-media-law-fifth-circuit-appeals-court-grant-stay-ruling",
  "date": "2022-05-11T22:49:58.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"U.S. Supreme Court Hears Expedited Challenges Over Texas Abortion Ban\" src=\"https://cdn.vox-cdn.com/thumbor/LaE22FdNWLTf7z9nXcVFV3Y_Jvg=/0x0:6670x4447/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70858943/1236278969.0.jpg\" />        <figcaption>Photo by Drew Angerer/Getty Images</figcaption>    </figure>  <p id=\"1GdR3i\">The controversial Texas social media law HB 20 will take effect following a ruling today from a US appeals court. The tech industry trade groups NetChoice and the Computer and Communications Industry Association (CCIA) managed to <a href=\"https://www.theverge.com/2021/12/1/22809654/texas-law-blocked-netchoice-ccia-injunction-viewpoint-discrimination\">block HB 20</a> in court last year, but that victory has been undone by the Fifth Circuit Court of Appeals, which today granted <a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23454498/21_51178_Documents.pdf\">Texas Attorney General Ken Paxton’s request for a stay in <em>NetChoice and CCIA v. Paxton</em></a><em>. </em>NetChoice and the CCIA were <a href=\"https://www.theverge.com/2021/6/30/22558086/florida-social-media-theme-park-law-preliminary-injunction-lawsuit\">successful in blocking</a> a similar law in Florida last year.</p><p id=\"ZkMVqT\">HB 20 allows Paxton’s office or Texas residents to sue social networks that moderate based on “the viewpoint of the user or another person,” among other offenses — language that potentially makes basic moderation decisions legally risky. </p><p id=\"AuRRUl\">The ruling follows <a href=\"https://www.protocol.com/policy/texas-appeal-confusion\">a confusing hearing</a> where a Fifth Circuit judge claimed web services like Twitter “are not websites” and compared them to phone companies like Verizon, which are governed under specific common carrier rules set by the FCC. NetChoice and the CCIA can choose to mount an emergency appeal, but without quick intervention from a higher level like the Supreme Court, the law is now in force.</p><p id=\"zYf76i\">“In an unusual and unfortunate move, a split 2-1 Fifth Circuit panel lifted the injunction without ruling on the merits and without issuing an opinion explaining the order. Because HB 20 is constitutionally rotten through and through, we are weighing our options and plan to appeal the order immediately,” said Carl Szabo, vice president and general counsel of NetChoice.</p><div class=\"c-float-left\"><aside id=\"aqozBX\"><q>“We are weighing our options and plan to appeal the order immediately”</q></aside></div><p id=\"SnIJg7\"><a href=\"https://www.theverge.com/2021/9/9/22661626/texas-social-media-law-hb-20-signed-greg-abbott\">HB 20 covers web services</a> that have more than 50 million active monthly users and rely primarily on user-generated content. That includes giant networks like Facebook but also many smaller sites and apps. It also applies rules specifically to email providers. It’s an unprecedented decision to let state governments control how companies moderate websites. It also conflicts with <a href=\"https://www.theverge.com/2021/6/30/22558086/florida-social-media-theme-park-law-preliminary-injunction-lawsuit\">a different circuit’s decision</a> to block the similar law in Florida, potentially setting up a Supreme Court fight over moderation — which <a href=\"https://www.theverge.com/2021/4/5/22368045/clarence-thomas-social-media-regulation-knight-v-trump\">some justices seem eager</a> to take on.</p><p id=\"kWYGQ8\">But it’s not yet clear what the decision practically means for Texas residents or others on the internet. The rule applies to decisions made after the law takes effect, so aggrieved users can’t sue over past conflicts with the services. Google didn’t immediately respond to questions about whether it would change its policies. Twitter and Facebook owner Meta declined to comment.</p><div class=\"c-float-right\"><aside id=\"bkVw7A\"><q>The law could make many kinds of moderation risky</q></aside></div><p id=\"C9dnUq\">Based on the hearing, the decision seemingly hinges on judges’ sympathy for claims that large social networks constitute a “public square” or a utility akin to a phone network — where operators are required to treat content neutrally. Internet service providers like Comcast <em>were</em> defined as common carriers under the Obama administration’s net neutrality rules, but <a href=\"https://www.theverge.com/2019/7/9/20687903/net-neutrality-was-repealed-a-year-ago-whats-happened-since\">those rules were quickly repealed</a> under former President Donald Trump, and web platforms like Facebook and Twitter have never fallen under the definition.</p><p id=\"JeLhHb\">HB 20’s critics have blasted it for infringing on the First Amendment rights of private companies. “Texas’s law violates the First Amendment because it compels social media companies to publish speech they don’t want to publish. Worse, the theory of the First Amendment that Texas is advancing in this case would give government broad power to censor and distort public discourse,” said Scott Wilkens, senior staff attorney with the Knight First Amendment Institute, in a statement following the decision.</p><p id=\"FdSLjw\"><a href=\"https://knightcolumbia.org/documents/6aw5xf6e12\">In a brief opposing the law</a>, the Knight Institute noted that “much user content expresses a viewpoint,” so HB 20 potentially bars sites (not only Twitter and Facebook but apparently also Yelp, Reddit, Tinder, and many other sites) from enforcing community standards, including bans on hate speech. The rules apply not only to banning users or removing content, but to “discriminat[ing] against” content, which the Knight Institute suggests could include adding fact-checking notes or any other labels. </p><p id=\"ix49Hl\">Either way, it could send a ripple effect across the internet — even if it’s later repealed.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CIpuK8-2SPm8jkWRmHDa3WILLpU=/0x955:6670x4447/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23454511/1236278969.jpg",
  "description": "A lawsuit against it remains ongoing.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}