{
  "title": "Craig of the Creek’s creators open up about building a show with DIY in its heart",
  "url": "https://www.theverge.com/22939796/craig-of-the-creek-creators-interview-diy",
  "date": "2022-03-07T14:30:00.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TCCgaUYQz0CD_TChioeL1YYqFFM=/196x210:1921x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70588673/VRG_Illo_5012_DIY_K_Radtke_Craig_Creek.0.jpg\" />        <figcaption>Matt Burnett and Ben Levin. | Illustration by Kristen Radtke / The Verge, Photo courtesy of Cartoon Network</figcaption>    </figure>  <p>What happens when DIY and imagination collide</p> <p class=\"p--has-dropcap\" id=\"PYFgpc\">In Cartoon Network’s <em>Craig of the Creek</em>, an ordinary chunk of suburban woods located somewhere along the East Coast is transformed into a sprawling world of wonder thanks to the imaginations and ingenuity of all the local kids who hang out there. While Craig and the other Creek kids’ adventures have become increasingly fantastical over the course of the show’s<em> </em>four seasons, they’ve all been underpinned by <em>Craig of the Creek</em>’s focus on how dreaming something up — say, a mecha built out of cardboard boxes — goes hand-in-hand with actually trying to turn those dreams into reality when you’re a kid.</p><p id=\"lN9vFP\">Watching <em>Craig of the Creek</em>, you can immediately sense bits and pieces of their own childhoods that co-creators ​​Matt Burnett and Ben Levin poured into the series. But something that reveals itself more gradually is how much of <em>Craig of the Creek</em>’s ideas about play and creativity are rooted in a do-it-yourself mindset that goes a bit deeper than just encouraging kids to get into building things. </p><p id=\"vRB721\">That’s definitely a big part of it, Burnett and Levin explained when I spoke with them recently following <a href=\"https://www.theverge.com/2022/1/20/22892102/craig-of-the-creek-season-5-the-movie\">news of a <em>Craig of the Creek </em>origin movie</a> and the series<em> </em>being renewed for a fifth season. But more than the act of building itself, <em>Craig of the Creek</em>’s a show about the power and importance of creating spaces where the spirit of trying things out just for the sake of it can thrive. That spirit, Burnett and Levin told me, is a big part of the reason <em>Craig of the Creek </em>exists, and they want to share it with the next generation of young creative minds.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WBwCCNpnPF5SUVqYRfS6Vtb51GY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289069/Craig_of_the_Creek_Key_Art__1__0.jpeg\">      <cite>Image: Cartoon Network</cite>      <figcaption><em>Craig of the Creek.</em></figcaption>  </figure><p id=\"LIhupS\"><strong>What were your own relationships with building things as kids?</strong></p><p id=\"BUDct0\"><strong>Ben Levin: </strong>I was always fascinated with people who could build things. My grandfather actually was an industrial engineer who worked in a factory. Earl, Craig’s grandfather in the show, is somewhat based on my grandfather, who had this amazing workshop, and could build anything, and I just always thought that was so cool. I also feel like there were — not to make this too echo chamber-y — but I think in the ’80s and early ’90s, any kind of movie like <em>The Goonies</em> where somebody has a contraption or a trap door, or like a treehouse, with tricks, you know? That was always so cool.</p><p id=\"ATHC8e\">It was a mix of seeing people who could actually make something as a kid, and then seeing these movies where kids had elaborate treehouses and security systems. That was maybe an early inspiration on my part for that kind of building stuff. I <em>tried</em> to build things as a kid. I was definitely like, “Look. I got a skateboard and some trash bags, and it’s really windy. Can I make some sort of skateboard windsail contraption? I think we can make this work.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"87lOjW\"><q>“I got a skateboard and some trash bags, and it’s really windy. Can I make some sort of skateboard windsail contraption?”</q></aside></div><p id=\"sCrvOc\"><strong>Matt Burnett: </strong>I never knew him, but my grandfather was very much into woodworking, and my dad did a lot of that stuff, and I never really aspired to do what he was doing, but I had all the tools around in the garage to just mess around with stuff. As a kid, I was a little limited by what I had. Stuff that I wanted, I was like, “Well, I gotta make it myself.” Any time I would find a stick that had any give to it, any bend, it was like, “Oh, this is becoming a bow for a bow and arrow. I’m gonna grab a piece of twine, and find the lightest, straightest stick I can, and just try shooting at things in the backyard.” And toy-wise, the one toy my parents really indulged me in was Legos, and I feel like I used Legos to make all the other toys that I didn’t have. </p><p id=\"APGndp\">The show’s inspired by Ben and I growing up separately in different parts of the East Coast, but having similar access to big wooded areas right near our houses. Just running around back there and being like, “What can we make here that imitates what we’ve seen on TV or in <em>The Goonies</em>, or building a fort that we can hang out in?” It was, you know, terrible. We didn’t even have nails — we were just laying planks of wood on sort of parallel tree limbs.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-JHuiMr-gPYZy1V2Ub3_vpBF7YA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289142/Opening_theme__62_.png\">      <cite>Image: Cartoon Network</cite>      <figcaption><em>Craig of the Creek.</em></figcaption>  </figure></div><p id=\"iKEYSf\"><strong>I think a lot of people can relate to being the kids who weren’t, you know, building functional crossbows and drawbridge forts, but definitely </strong><em><strong>wanting</strong></em><strong> to be the kids who were. </strong></p><p id=\"IsOWM0\"><strong>Movies and shows that revolve around those kinds of kids can have a way of feeling sort of alienating if you aren’t already a crafty person, but it feels very much like </strong><em><strong>Craig of the Creek</strong></em><strong> is created with a wariness about that sort of potential alienation. Talk to me about how you both go about finding that balance between making these characters’ creations feel fantastical, but also sort of within the audience’s grasp?</strong></p><p id=\"bqURFC\"><strong>BL: </strong>I think there are two levels to the DIY in the show. There’s the level of play where it’s about kids creating identities, and groups, and little worlds for themselves to play in. We’ve gotten wilder and wilder as things go on, but very early on it was very much the intention, and still is, to always think about what things the kids are using. What would be at their disposal to make what they’re making? Make the materials make sense. Even if you don’t see how everything works, making sure it feels like the ways things function make sense, while also not being too elaborate.</p><p id=\"lcjqIV\">We actually were just doing an episode that involves building a giant lamp, essentially, or a giant device to light up an area, and looking back at some of the first passes, it was just too complicated. It raised out of a box, and I just felt like I don’t see how it could work. I don’t want to just push a button and have it raise up, and feel like there’s some robotics inside. Like, how could Craig have built that? So, we stripped it down. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6Ybj-Y7jpRi_2rY42HlfCgD-PeM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289103/The_Other_Side_The_Tournament__218_.png\">      <cite>Image: Cartoon Network</cite>      <figcaption><em>Craig of the Creek.</em></figcaption>  </figure></div><p id=\"5IkPnA\"><strong>And about the other side of the show’s take on DIY?</strong></p><p id=\"3YzZYJ\"><strong>BL:</strong> The other side of DIY is a lot about artistic expression. We’ve got episodes like “Vulture’s Nest” where Craig and his friends form a band, and they’re sort of mentored by a real-life band, Bad Moves, that we’re friends with. There’s episodes like “Kelsey the Author” where she tries out writing her own books, and I feel like that’s the other level of DIY that’s super important. We’ve definitely got the crafting stuff and mapping your world, which is really fun, but there’s also like an artist — showing Craig and how his drawing skills expand, and Kelsey expressing herself. </p><p id=\"VzfuAN\">I got to try out a lot of forms of artistic expression as a kid, and I was lucky in high school to be around a music scene that was very DIY. I was very into the ’90s and 2000s ska scene, and in Maryland and the surrounding area, there was a group of people who would put on shows in this indoor soccer place. They sort of created this DC ska scene — this hub that allowed all these teenagers to try out music. </p><p id=\"JvYfhN\"><strong>Just making things with your own hands.</strong></p><p id=\"WYxRqH\"><strong>BL: </strong>Yeah, like silk-screening shirts, and recording our music in people’s basements, and getting to play in these really tiny local shows. Seeing people who were just <em>regular</em> people put on these shows and organize this stuff, it broke down a lot of the barriers in my mind of what could be done.</p><div class=\"c-float-left c-float-hang\"><aside id=\"3iIheS\"><q>“When you see someone else your age doing that thing, it suddenly opens up your world”</q></aside></div><p id=\"8WsAhD\">I think often there’s a mental barrier when you see a drawing, or a comic book, you know, anything. You kind of, in your head as a kid, think, “Well, that’s for adults. You have to go get a degree and be hired by somebody to make this.” When you see someone else your age doing that thing, it suddenly opens up your world and you’re like, “Oh, I can do this. It’s not impossible.” Of course, there are definitely financial barriers to creating art in some forms, but I think [one of the] things we’re hoping to do is at least nip that mental barrier, and show kids producing art in a way that is achievable. </p><p id=\"t0J3VI\">With “Vulture’s Nest,” we tried to write a song that wasn’t too complicated. We worked with our composer Jeff Rosenstock to write something we thought that kids could maybe learn. It was only a few chords repeated over and over again, but we try, just like with the inventions, to keep the level of their creations realistic so that kids feel like “I can try that.”</p><div class=\"c-wide-block\"><div id=\"6mfU3x\"><div ><iframe src=\"https://www.youtube.com/embed/1MENtZjI2dY?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"L5mTb4\"><strong>Grounded as the show is, though, it does end up going off the rails pretty frequently, and I’m curious to hear about the internal logic you use to shift back and forth between reality and fantasy.</strong></p><p id=\"9NLnGN\"><strong>MB:</strong> Yeah, I remember very early on something we used to say about the show when we were pitching it is like, the things that the kids build in the Creek work the way you want them to work when you build them as a kid. If you tie a plunger on a rope, it’s going to work as a suction cup, you know, grappling hook thing, even though in real life, that’s not the way it works. The design Ben was talking about got me thinking specifically of a background for a new episode where a kid has set up a shop in the Creek. It’s like making sure every item that is a part of these buildings or these contraptions are recognizable to a kid and something a kid could conceivably get their hands on. They can’t get a robotic servo thing that’s going to lift something up, but if it’s made out of cardboard and it’s got light bulbs in it, then yeah, sure. </p><p id=\"x7Nv0Z\">The background I was looking at earlier, there was a big sign that looked like a button, and it was like, “Well, let’s make this a slice of a log that they’ve drilled holes in to look like a button as opposed to a big plastic button that someone would style for a theme park. Kids won’t do that; you gotta see where it came from, and that’s really the aesthetic approach to our DIY.</p><p id=\"JV5Rrr\"><strong>BL: </strong>All the design team — both our background team and character and crafts team — really think about that stuff, and our art director Martin Ansolabehere, he’ll often be like, “We can’t use too many Christmas lights. We gotta find different ways to light up dark places.” He pushes us to make sure we don’t lean on that too much.</p><p id=\"TPGaoB\"><strong>As the series has gone on, what other rules of thumb have you had to come up with, like “no more Christmas lights,” to keep pushing the idea of the Creek as this expansive play that the kids are always coming up with new ideas for?</strong></p><p id=\"JKfYOa\"><strong>BL:</strong> One of the main theories that we stumbled upon, almost between the pilot and the show starting, was that the show can get fantastical, but only if it’s linked to an emotion. So, if the kids are feeling very scared, or very excited, or something seems very scary, then it can be very big and outlandish. If something is very triumphant, it can be huge. </p><p id=\"NcLMet\">I mean, just to point to one of the first episodes, the kids jump on a trampoline and bounce out of the Creek, and the idea is, that’s at the climax of the episode where they’ve figured out a way to get out of the Creek, and their emotions feel like, “Wow, look what we did!” So the idea is that you can have these moments, but they have to relate to an emotion because as a kid, you know, everything feels bigger. Everything’s so exciting, or you want a new toy so bad, or you’re afraid of this kid — whatever it is, those are the moments when we allow the show to stretch reality.</p><div class=\"c-wide-block\"><div id=\"cO5ZSr\"><div ><iframe src=\"https://www.youtube.com/embed/ETpmizuP2lM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"oAnflH\"><strong>You get a lot of that in “The Future is Cardboard” and the other Carter-centric episodes where, no, the cardboard giant robot isn’t </strong><em><strong>literally </strong></em><strong>moving, but also — yes it is, in everyone’s imaginations. What sort of themes did you really want to explore with Carter both as this representation of how the Creek works, and as, you know, just a kid?</strong></p><p id=\"orYefA\"><strong>BL: </strong>One level of Carter is that he was someone who had a little bit of trouble playing with others. I don’t know if his story has so much to do with the building itself, as much as, like, he finally found a friend.</p><div class=\"c-float-right c-float-hang\"><aside id=\"9YwxQj\"><q>“DIY is Craig’s contribution to the community of the Creek”</q></aside></div><p id=\"wKu9iD\"><strong>MB: </strong>I think the Carter character was really interesting because his was an early episode — the first one, at least — and it really helped figure out Craig’s character because DIY and building inventions is very much a part of Craig’s identity. He’s drawing his own map of the Creek all the time, and he takes a lot of pride in that. That first episode with Carter is Craig feeling a little bit like his best friends, Kelsey and J.P., aren’t as on board with his DIY aspirations as Carter, who’s built this whole kingdom out of cardboard. Craig’s like, “Whoa, this is a guy I can vibe with. This is it!” But that isolation that Carter has — that Carter doesn’t play well with others — is what differentiates him from Craig. </p><p id=\"d5XbUE\">Saying “DIY community,” like, DIY is Craig’s contribution to the community of the Creek. He likes to build these things for his friends, to help his friends, to help all the kids in the Creek, and I think Carter just gets a little, you know, maybe megalomaniacal, or just a little bit more... he’s just not thinking of others. But his character arcs over the course of the series to kind of get to the place where Craig is, and the two really do complement each other well.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jQtR-OBk153QDj94KdRT9fMp0eE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289126/Screen_Shot_2022_03_04_at_2.08.12_PM.png\">      <cite>Image: Cartoon Network</cite>      <figcaption><em>Craig of the Creek.</em></figcaption>  </figure></div><p id=\"dGurix\"><strong>You’ve mentioned so much about how the show has become more ambitious over time, and you can see that just watching the show evolve. Between </strong><em><strong>Craig</strong></em><strong>, </strong><em><strong>Jessica’s Big Little World</strong></em><strong>, and the movie, what sort of leaps of faith are you getting ready to take with the franchise in its future?</strong></p><p id=\"MsqZ5v\"><strong>MB:</strong> The crew has created such a big cast, and I think one thing we’re always excited about is how a lot of the show is Craig and his friends exploring, and meeting new kids or finding new places. But we get so excited about the creation of those new characters, and everybody on the crew makes them feel so real that revisiting and building upon those characters and their worlds more is just as exciting. There’s a lot of that in season four. You’re going to see some expansion of the allure of the Creek, and that’s a lot of fun. </p><p class=\"c-end-para\" id=\"8rQCAr\"><strong>BL: </strong>They’ve announced that we’re working on a movie, which is big. The scale of what we’re doing in it, and some of the visual elements that the story is going to require, are definitely bigger than we’re used to, and it’s pushing us to find new approaches to how we make this stuff. We’re experimenting with some elements of animation that we’re not necessarily accustomed to, but we’re going to give it a shot. We’re trying to level up our skills along with the characters in the show to just make it better, and to try new things, the way the kids in the Creek are always trying new stuff. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VvgxfNZNqv6sUTn9FZRyfPSOmSA=/0x210:2040x1278/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23278556/VRG_Illo_5012_DIY_K_Radtke_Craig_Creek.jpg",
  "description": "Craig of the Creek’s Matt Burnett and Ben Levin discuss DIY culture.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}