{
  "title": "Crashing Elon Musk’s Cyber Rodeo at the Texas Gigafactory",
  "url": "https://www.theverge.com/23023458/tesla-elon-musk-cyber-rodeo-austin-texas-gigafactory",
  "date": "2022-04-14T12:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/odu-fIcVnwxzX-o7WCdkHSl9_m0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70747834/lgrush_220407_5139_0018.0.jpg\" />    </figure>  <p>When you’re in Austin and you hear there’s going to be a party</p> <p id=\"iy87B1\">As I watched the giant Tesla coils fire white streaks of electric current at a sexy cowboy gyrating inside the metal cage, I had to admit that I was having a good time. The commitment to spectacle at the Tesla Gigafactory was impressive. The lightning-like sparks would burst outward from the coils to the rhythm of the club music, pulsating through the nearby speakers. Inside the cage, the dancer wearing a cowboy hat and booty shorts got down to the beat as the crowd around him cheered. What more could you want from a party?</p><p id=\"47l7NG\">The electrified dance cage was just one in a long line of garish exhibitions I had seen on my whirlwind tour of <a href=\"https://www.theverge.com/2022/4/8/23008731/tesla-texas-gigafactory-open-cybertruck-elon-musk\">Tesla’s new Gigafactory in Austin, Texas</a>, on a Thursday night. I’d already weaved in and out of a metallic cactus forest, passed not one but two mechanical bulls, skirted by a petting zoo located inside a massive geodesic dome, and witnessed probably the most spectacular display of light-up drones in the night sky I’d ever seen.</p><p id=\"1TkczD\">It was all just a small taste of what Tesla’s opening party for the Austin Gigafactory had to offer. And everything I did witness I counted as a blessing because I really didn’t think I’d make it in there. But thanks to some good timing and major life choices, I happened to find myself inside the Gigafactory surrounded by car parts, twirling robots, lots of pink neon lighting, and thousands of drunk Tesla fans shouting at the top of their lungs.</p><div class=\"c-float-right c-float-hang\"><aside id=\"DhalKO\"><q>Inside the cage, the dancer wearing a cowboy hat and booty shorts got down to the beat</q></aside></div><p id=\"f8CfSK\">My husband and I moved down to Austin, Texas, in March 2021. But unlike a lot of the transplants here, I have a history with this town. I lived here for four years when I attended the University of Texas, and I grew up outside of Houston. This state is in my blood, for better or for worse.</p><p id=\"NvoPzo\">Our move coincided with Elon Musk’s own move to Austin. He announced in July 2020 that the city would be home to a new, massive car-making factory — the largest in the world by volume, according to Elon. If you turned the whole thing on its side, it’d be taller than the Burj Khalifa in Dubai. An opening party for the factory was announced a few weeks ago, the theme of which was going to be “Cyber Rodeo.” Tesla would be inviting 15,000 people, and you needed an invite to get in. I did not have an invite but decided to crash anyway.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tAIe02s27TrM-VAmiVd4Kg8N9Z0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387519/lgrush_220407_5139_0064.jpg\">      <figcaption><em>An art installation using Tesla coils and dance music by ArcAttack.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UDHMBZDEARMU5auBON-BaFZEOSs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387494/lgrush_220407_5139_0039.jpg\">      <figcaption><em>The proposed Tesla robot.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HF5tua-jQdXG70SIswGXuUAy__Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387493/lgrush_220407_5139_0038.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nFTVYdmmACzpe5vqHnsRkyBRqvE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387495/lgrush_220407_5139_0040.jpg\">      <figcaption><em>The Cybertruck on display.</em></figcaption>  </figure></div></div></div><p id=\"IqVHA4\">Now, thanks to years of covering SXSW with and without a badge, I cut my teeth on sneaking into parties in Austin. It’s an Austin rite of passage to eventually smuggle your way into some bar on East Sixth or the Paramount and run into Richard Linklater or Mike Judge. There’s no real strategy to it. You just need patience, the willingness to talk enough that people might get annoyed and let you in, and, obviously, some luck. However, I am very much not a car reporter. I am strictly a space reporter, which means the vehicles I cover <a href=\"https://www.theverge.com/2018/12/13/18130973/space-karman-line-definition-boundary-atmosphere-astronauts\">need to cross the Kármán line</a> before I’ll consider writing about them. (Though I guess one of Elon’s cars <em>is</em> currently <a href=\"https://www.theverge.com/2017/12/22/16811944/elon-musk-spacex-tesla-roadster-mars-falcon-heavy\">crossing the orbit of Mars right now</a>, so perhaps my standards need an update.) Still, I have been covering Elon’s other major company, SpaceX, for years now. Finding my way into the Austin Gigafactory seemed to combine a few of my skill sets, so I figured I’d give it a shot.</p><div class=\"c-float-left c-float-hang\"><aside id=\"ck9ruG\"><q>Finding my way into the Austin Gigafactory seemed to combine a few of my skill sets</q></aside></div><p id=\"2hLUim\">I called up Sean O’Kane, who recently defected from <em>The Verge</em> to <em>Bloomberg</em>, to see if he’d give me a ride. He <em>is</em> the car reporter, so it seemed fitting that he’d also be the driver. He also moved to Austin during the pandemic, and combining forces felt right seeing as how I know very little about Tesla and Sean knows a lot. Sean didn’t have an invite either, so we were at least in the same boat.</p><p id=\"gNmvi9\">The morning of the event, I checked my phone to see one of Elon’s latest tweets to a fan claiming the “door will not be super strict” to the event. I thought that seemed promising and sent the tweet to Sean. Surely we’d make it in at some point! I donned a cowboy hat and some boots — this was a rodeo after all — and departed.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KAwWfvqUdZU5YfW8lNFs1z04Flk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387289/lgrush_220407_5139_0003.jpg\">      <figcaption><em>Hopefuls without invites stand on the perimeter of the Gigafactory.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4Zpa5aT7GHvk2fQD8Xk2y5zwuJQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387290/lgrush_220407_5139_0004.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eyhWHzxBBtN5SBMVjZ26E7JQxVk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387292/lgrush_220407_5139_0006.jpg\">      <figcaption><em>The Tesla Booty Dancers outside the entrance.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hSEWQEpuWsoNmS3genuDCAVZrys=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387454/GettyImages_1239824688.jpg\">      <cite>Photo by Suzanne Cordeiro / AFP via Getty Images</cite>      <figcaption><em>A man riding Tesla’s $1,900 Cyberquad for kids.</em></figcaption>  </figure></div></div></div><p id=\"RNUKft\">We arrived without much of a clue about what we should do. At first, we parked in a makeshift dirt-covered “parking lot” and made our way across the highway to the outer perimeter of the factory. My first impression was: “Yep, it’s big.” The entire structure is just one massive squat gray fortress that seemingly stretches forever into the horizon. There’s a thin line of windows that cuts through the middle of the exterior, but that’s about it. No frills. A fairly brutalist design that feels incredibly out of place in the Texas Hill Country, with its hallmark bungalows and modern wood-paneled angular homes.</p><div class=\"c-float-right c-float-hang\"><aside id=\"ukBJlw\"><q>My first impression was: “Yep, it’s big.”</q></aside></div><p id=\"6U1LlL\">We stood out there for about 10 minutes with other Austinites and out-of-state travelers. They, too, lacked QR codes, but some had still trekked to the factory site for a potential chance to glimpse the inside. This wasn’t the real line to get in, just a waypoint for people without an invite. Most of the group included people in their 20s — plenty of young men but a good showing of women as well. One woman brought her baby in a Babybjorn. Various panhandlers stood around the road — some with signs begging to be someone’s plus one, others urging Elon Musk to fix racism in Austin. A grown man did laps around the group on Tesla’s $1,900 Cyberquad for kids. It was weird. Most people simply stood there, staring at the factory longingly without really saying anything. It was as if the Gigafactory was the ark and none of us had received our invites ahead of the flood.</p><p id=\"b8OatZ\">Not content to drown, we made our way to an actual parking lot by flashing a bootleg QR code at an attendant before he stared too long and walked to the front security entrance, which was sequestered by a line of metal barricades. Unfortunately, Elon’s decree about security turned out to be completely false. The gatekeepers were absolutely not letting anyone without a QR code in, and your QR code had to actually work or you were escorted from the line. Our solution to this problem was to, once again, just stand there. We figured maybe at some point they’d actually read Elon’s tweet and let us in. This party occurred in the week-long window in which Elon seemed like he’d be on the board of Twitter, so surely the security team knew that. His tweets were legally binding, right? I think that’s how it works.</p><div class=\"c-float-left c-float-hang\"><aside id=\"ZyZteF\"><q>The Tesla Booty Dancers periodically cheered and got down on the asphalt to twerk. Unfortunately, that didn’t help them get in</q></aside></div><p id=\"TrC9mu\">We may or may not have languished there for a few hours. It helped that we were surrounded by others also lacking proper QR codes, milling about the entrance in case there was a sudden change of protocol. Two recent UT grads came up to us asking if we’d had any luck, and we commiserated over our fates. A dance team wearing bright red shorts with the word “S3XY” on the bottoms, calling themselves the Tesla Booty Dancers, periodically cheered and got down on the asphalt to twerk. Unfortunately, that didn’t help them get in either.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mhEYD50gkS2njxBkonYs_8-Mi7w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387460/lgrush_220407_5139_0008.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yA5J9PW9eDHGJXu_N0fAPDxUfn8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387463/lgrush_220407_5139_0010.jpg\">      <figcaption><em>Whatever this was reminded me of a face-hugger about to implant eggs in my stomach.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0aFaj8Pwi0-ENcNkeQPc3qz9C78=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387466/lgrush_220407_5139_0012.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eBfLo3ZVPrSIMR-o7xWVgRYFnZQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387469/lgrush_220407_5139_0015.jpg\">  </figure></div></div></div><p id=\"7XVUfH\">As the clock neared 8PM, I told Sean I was ready to leave. The nice thing about not getting into a party as a journalist is that you don’t have to actually write anything, which means less work. I could just go home and sit on my couch with my dog in peace. But as soon as I had resolved to walk back to the car, I miraculously found myself with a QR code on my phone, sent to me by a benevolent friend who had extra on hand. Immediately, I was overjoyed — then sad. Now I <em>had</em> to write a story.</p><p id=\"BskoQ9\">We bolted through the line as fast as we could and entered the Gigafactory, where I suddenly felt like I was thrust into a neon-lit nightclub hosted aboard the USCSS Nostromo from <em>Alien</em>. The place was absolutely cavernous with pretty concrete <em>Blade Runner</em> vibes, punctuated by the extremely lopsided ratio of square footage to people. There was just way too much space for it to be completely full. A giant neon sign showcasing the party’s logo — “Cyber Rodeo, Giga Texas” — shown on the outline of the state of Texas. It displayed prominently behind two DJs who spun some surprisingly light and airy tunes that reverberated through the gargantuan halls.</p><div class=\"c-float-right c-float-hang\"><aside id=\"5YQO9B\"><q>I suddenly felt like I was thrust into a neon-lit nightclub hosted aboard the USCSS Nostromo</q></aside></div><p id=\"HxM5SL\">I really didn’t have any idea what any of the stuff inside the factory was, but I just started taking pictures of everything. (I want to be clear again that I don’t cover Tesla. Send all your questions to Sean.) One piece of machinery reminded me of the face-hugger, which added to the <em>Alien</em> theme I had created in my head. There was a whole wall of car parts lit up in pink that I goggled at for a minute. But we couldn’t linger too long because we knew Elon was giving a presentation at 9PM. That meant we had about an hour to weave our way through the factory and see as much as we could before finding the main stage.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oMie_YNXI26KsGA4DWJtM7aekGQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387468/lgrush_220407_5139_0014.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tCQnbYI8uGwEV4V-PAPjmZwcCTk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387474/lgrush_220407_5139_0020.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zRzBpdCGi8t9KMn-XsEPChEWFPA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387475/lgrush_220407_5139_0021.jpg\">      <figcaption><em>The robots that build the cars were on full display, twirling about as if the factory were in open production.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MiVA4iRX_ZVPej-zA14l6jlOr_M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387479/lgrush_220407_5139_0025.jpg\">  </figure></div></div></div><p id=\"RBRWfA\">Moving at a power walk, we briskly followed some white lines on the floor pointing us to what seemed like an important destination. As we moved, we passed by gaggles of red and yellow robotic machines used to manufacture the cars. They twirled and danced about as if the factory were actually in production that evening. I was certainly dazzled. It also felt extremely open and available, a much different experience from whenever you tour a rocket factory. Rockets are technically considered weapons since the same technology used to create them is also used in ICBMs. And the knowledge of how to build rockets is subject to intense regulation. Typically, if you’re allowed into a rocket factory, someone is constantly following you around, telling you not to take pictures of things from certain angles and then forcing you to delete the pictures from your phone.</p><div class=\"c-float-left c-float-hang\"><aside id=\"Hhk5y1\"><q>It was unfair that the robots had to work while we all got to party</q></aside></div><p id=\"qcmpXm\">But the robots here were out and about, on full display for everyone, and no one was telling me not to take pictures. I enjoyed seeing them pirouette, though I did think to myself it was unfair that the robots had to work while we all got to party.</p><p id=\"ZFHie2\">At one point, we passed a projection of a metallic Doge on a wall, floating against another outline of Texas. Later on, I marveled at a fleet of Teslas moving on trackless platforms across the floor, almost beckoning me to get inside them like a ride at Disney World. All the while, I kept thinking the crowd did not <em>feel</em> like 15,000 people. Either this party was a bust or we hadn’t hit the main spot yet.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VjUSKffutvegvRQ9GH6OHT1k2Iw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387482/lgrush_220407_5139_0028.jpg\">      <figcaption><em>This dome housed the petting zoo.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/g_JO0nPVnGa6kEH1nkktEnkPDwA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387483/lgrush_220407_5139_0029.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CsFA4Vbqr1xuyWIoQZ7kDPDLIMI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387491/lgrush_220407_5139_0036.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jRAYkr_J9d9PlrXxu94OnHae3L4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387485/lgrush_220407_5139_0031.jpg\">  </figure></div></div></div><p id=\"h0bWsp\">Eventually we found ourselves outside in a cyberpunk carnival. Here was the petting zoo and cactus forest as well as cowboys painted entirely in silver and women in sparkly bodysuits on roller skates. A giant metal cowboy boot sat next to a giant metal cowboy hat. Party-goers shot basketballs into hoops and threw rings onto rubber ducks floating in a pond for plush prizes. At one point, I passed by a tattoo parlor in an Airstream and resisted the temptation to sit down for some ink. In the midst of the outdoor section, two massive Tesla coils standing as high as the factory’s ceiling shot sparks of current, playing “The Imperial March” from <em>Star Wars</em>. And at the back was the main stage for music, where we heard Gary Clark Jr. had performed. The merchandise table sported massive lines of people weaving around the venue as others stood in line for food trucks and, of course, the bar. Unfortunately we arrived too late to see Bevo, the live longhorn and official mascot for the University of Texas, but I felt comforted knowing he had graced these parts.</p><div class=\"c-float-right c-float-hang\"><aside id=\"DWqlQ4\"><q>Two massive Tesla coils standing as high as the factory’s ceiling shot sparks of current, playing “The Imperial March” from <em>Star Wars</em></q></aside></div><p id=\"2Qb1nJ\">The carnival was much more crowded than the factory, but it still didn’t feel like 15,000 people. We looked at the time: 8:45PM. We still hadn’t found the main stage yet. After asking around, we learned it was upstairs and made our way to a staircase. As we slowly ascended in a stream of people, I could feel the growing vibrations and droning hum of thousands of people talking and moving around on the floor above me. </p><p id=\"L5PUEA\">Sure enough, it was... a lot of people. As far as the eye could see, thousands of attendees crowded inside this second-floor cavern, many trying to take pictures of a Cybertruck that was on display as well as a model of the Tesla humanoid robot. But most of the crowd shoved themselves around the makeshift stage, eager to see the Tesla CEO in all his glory. A car hung from the ceiling over the stage between two massive screens, again sporting the party’s logo. In the back of the room on large risers was clearly the VIP section, and I looked at all of the personal space they had with envy.</p><p id=\"gLqeha\">It was certainly the largest crowd of indoor people I had been in since the pandemic began, so I was more than a little unsettled. And everyone was slightly buzzing with alcohol and excitement as Elon’s appointed speaking time grew near. However, years of covering Elon’s speaking events meant Sean and I knew to expect a delay.</p><p id=\"ePhqnh\">I checked my phone at 9:30PM. Still nothing.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/v4-J2RQ5BYzYdKKJpTNH11vT6Lc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387513/lgrush_220407_5139_0058.jpg\">      <figcaption><em>The massive crowd gathered for Elon Musk’s talk with the VIP section on risers in the background.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/y7Q8HV8GD4qkguZ_E2bsWSD_e0w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387456/GettyImages_1239825365.jpg\">      <cite>Photo by Suzanne Cordeiro / AFP via Getty Images</cite>      <figcaption><em>Elon Musk speaks at the Tesla Giga Texas manufacturing “Cyber Rodeo” grand opening party.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Tpw3lit3hi2Z6qUHTY3SZbJzPYo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387501/lgrush_220407_5139_0046.jpg\">      <figcaption><em>The drones outside the window creating Nikola Tesla’s face.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jQY_I1_1rfC_yMoHi3yzjbvkUcQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387515/lgrush_220407_5139_0060.jpg\">      <figcaption><em>Harrison Ford spotted in the VIP section.</em></figcaption>  </figure></div></div></div><p id=\"iJeym9\">Then, shots of the Gigafactory filmed from a helicopter outside appeared on the screens, and the crowd cheered. Apparently art from Beeple shown on the factory’s facade, but I didn’t quite notice because the drone display had begun. Suddenly, outside the window, I was greeted with the Cyber Rodeo logo again, comprised entirely of twinkly drones in the night sky. It was extremely cool. They proceeded to morph into what I thought was Elon’s face but have since learned was Nikola Tesla’s face, then a Tesla car with rotating wheels, and then the Cybertruck. With each new creation, the crowd erupted, but the loudest cheers came when the drones turned into the Doge. Elon sure does commit to a theme.</p><p id=\"8L8dLN\">After a short video of a woman horseback riding in a field of wild Teslas, Elon — wearing a Cyber Rodeo shirt, dark sunglasses, and a black cowboy hat — finally drove onstage in a Tesla roadster. His appearance was greeted how you might expect, like the headliner at a rock concert agreeing to play an encore. Basically Elon did his Elon thing, hyping up Texas and how it’s big and how the Gigafactory is big. After every major proclamation, the people standing directly next to me shouted their jubilations into my ear at an excruciating pitch. I was happy for them! I was not happy for the future of my hearing.</p><div class=\"c-float-left c-float-hang\"><aside id=\"bx7gIt\"><q>As we left, something hit me. Was this my <em>first</em> rodeo?</q></aside></div><p id=\"ISw6NB\">At one point the Cybertruck drove on stage, and Elon proclaimed the factory officially open. “Here at Tesla, we believe in throwing great parties,” he announced, before getting into the driver’s seat and driving away as a massive firework display exploded outside. The crowd began to disperse, and Sean and I swam upstream to get a look at the VIP section. We recognized Elon’s mom, Maye, and his brother, Kimbal, who I’m sure felt at home among the sea of cowboy hats. Sean’s eagle eyes then spotted Harrison Ford above us. I creepily snapped some pictures of him from down below in the mosh pit.</p><p id=\"5fQFDw\">After that, I settled into the crowd around the electrified gyrating cowboy and simply basked in the wildness of the night. Having seen quite enough spectacle for the evening, we then embarked on our maze-like journey back to the car. As we left, something hit me. Was this my <em>first</em> rodeo? Yes, I’ll admit, as a Texas native, I’ve never been to a rodeo before. It’s been a dream of mine to go to one someday and tell everyone not to ask me questions, explaining to them, “Sorry, but this <em>is</em> my first rodeo.” I’m not sure the Cyber Rodeo gets to count, but I certainly was out of my element most of the night — so perhaps, in the metaverse, it does?</p><p id=\"MsPfHx\">I told this revelation to Sean, and he then threatened to leave me in the Gigafactory.</p><p id=\"987JKh\"><em>Photography by Loren Grush / The Verge</em></p><p id=\"n8PtO4\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mdsypSoCq60-AhNTetTY68NFHuY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387472/lgrush_220407_5139_0018.jpg",
  "description": "Joining a crowd of 15,000 inside Austin’s massive new Tesla plant.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}