{
  "title": "Cryptocurrency’s big Super Bowl ads sold FOMO, not the future",
  "url": "https://www.theverge.com/2022/2/14/22933456/crypto-super-bowl-commercials-impact-advertisements-analysis-fomo",
  "date": "2022-02-14T23:18:46.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"A stylized illustration of a Bitcoin in purple and black shadows.\" src=\"https://cdn.vox-cdn.com/thumbor/2dsUBWbMCIM3evnTvmz09iaMUC0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70509264/acastro_bitcoin_2.0.jpg\" />        <figcaption><em>Cryptocurrency startups were everywhere at Super Bowl LVI, with star-studded commercials featuring LeBron James and Larry David all pushing viewers to jump on the hype train.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Sw0S6W\">Super Bowl LVI may have been the first crypto bowl.</p><p id=\"EpUFYa\">It’s not that cryptocurrency-related ads completely overwhelmed the Super Bowl commercial breaks to the exclusion of all other advertisements. In fact, there were more ads for the Super Bowl’s more traditional fare of booze, cars, and movie trailers than there were crypto commercials. </p><p id=\"vGfr54\">But cryptocurrency made a splash at the Super Bowl — one of the most-watched and highest-profile advertising events on the year — in a bid to try and win over mainstream customers (in addition to a largely young and male minority that’s <a href=\"https://www.forbes.com/sites/marisadellatto/2021/11/11/cryptos-super-user-young-men-43-of-us-males-aged-18-to-29-have-bought-the-currency/?sh=19c8afd6349a\">embraced digital currency so far</a>.) But despite the hype, none of the cryptocurrency commercials at the big game made any attempt to actually sell people on anything other than spending more money on crypto. </p><aside id=\"c177cO\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Coinbase’s bouncing QR code Super Bowl ad was so popular it crashed the app\",\"url\":\"https://www.theverge.com/2022/2/13/22932397/coinbases-qr-code-super-bowl-ad-app-crash\"}]}'></div></aside><p id=\"S0BH4O\">LeBron James was there (with his de-aged younger self) to <a href=\"https://twitter.com/cryptocom/status/1493033811105378307\">promote Crypto.com</a>. Larry David compared missing out on crypto to passing up the wheel, the moon landing, or the idea of portable music <a href=\"https://twitter.com/FTX_Official/status/1493028625825869828\">for FTX</a>. eToro sold being part of the crypto community as <a href=\"https://twitter.com/eToroUS/status/1493237343079133185\">a new wave of “social investing</a>.” Budweiser’s Bud Light Next was promoted with NFT drops. And Coinbase’s bouncing QR code offered free Bitcoin for customers who signed up — which, while lacking celebrity cameos, was still among the most talked-about ads of the night. All told, it was perhaps the biggest debut yet for crypto on the national stage, surpassing even the seemingly endless Matt Damon ads <a href=\"https://www.protocol.com/bulletins/matt-damon-crypto-com-ad\">that haunted the NFL’s regular season</a>. </p><p id=\"lEYVap\">Some of those ads were remarkably effective. <a href=\"https://www.theverge.com/2022/2/13/22932397/coinbases-qr-code-super-bowl-ad-app-crash\">Coinbase’s commercial, in particular</a>, was a standout, with the company reporting an astonishing 20 million hits on its website in one minute — enough traffic to temporarily crash the app and the most the company had ever had. (Something that may have been the point of the enigmatic advertisement in the first place.) The following morning also saw Coinbase appear as the number two most downloaded iPhone app on the App Store. </p><div id=\"eZFmoc\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some more details. We had over 20M hits on our landing page in one minute. That was historic and unprecedented.  We also saw engagement that was 6 times higher than our previous benchmarks.  We're ready for you at <a href=\"https://t.co/VobV6m9vSo\">https://t.co/VobV6m9vSo</a>  <a href=\"https://twitter.com/hashtag/WAGMI?src=hash&amp;ref_src=twsrc%5Etfw\">#WAGMI</a> <a href=\"https://t.co/d9A2aAEEaC\">https://t.co/d9A2aAEEaC</a></p>— Surojit (@surojit) <a href=\"https://twitter.com/surojit/status/1493113238275297280?ref_src=twsrc%5Etfw\">February 14, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"aEP3ow\">But it’s equally telling what elements of the blockchain boon weren’t present at the Super Bowl. For the most part, the commercials focused almost exclusively on exchanges and the most basic aspect of ways to more easily invest in cryptocurrency. There were no ads shilling NFT drops, no Bored Ape appearances during the halftime show, or even a mention of the <a href=\"https://business.ticketmaster.com/blog/nfl-partners-with-ticketmaster-to-offer-limited-edition-nfts-to-celebrate-super-bowl-lvi/\">NFL’s commemorative NFTs</a> for the big game. </p><p id=\"jKFEcj\">Nor were there commercials promoting the theoretically more practical uses of crypto, as part of the “Web3” pitch that envisions blockchain technology underpinning huge swaths of the future of the internet, much in the same way that user-generated content and social media drove the Web 2.0 era. </p><p id=\"nCoGHH\">If this year’s Super Bowl was meant to be the blockchain’s big public debut, it was remarkably short on pitches that explain what cryptocurrency technology will actually do or how it’ll improve things in users’ day-to-day lives. Instead, crypto’s big mainstream pitch was a flashy, celebrity-studded entryway to get new buyers into the blockchain hype wheel. </p><p id=\"3LlxIJ\">The biggest Super Bowl crypto players were just promoting the <em>idea </em>of cryptocurrency in general, telling viewers that now is the time to buy into blockchain, offering free deposits of Bitcoin for signing up, and pushing the narrative that <em>not</em> getting on board with crypto would mean missing out on the next big thing.</p><div id=\"jo8V26\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In his moment of truth, <a href=\"https://twitter.com/KingJames?ref_src=twsrc%5Etfw\">@KingJames</a> called it. <br><br>Fortune Favors the Brave <a href=\"https://twitter.com/hashtag/FFTB?src=hash&amp;ref_src=twsrc%5Etfw\">#FFTB</a> <a href=\"https://t.co/Snhpit3vnh\">pic.twitter.com/Snhpit3vnh</a></p>— Crypto.com (@cryptocom) <a href=\"https://twitter.com/cryptocom/status/1493033811105378307?ref_src=twsrc%5Etfw\">February 14, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"VBVEbD\">“If you want to make history, you gotta call your own shots,” LeBron tells his younger self before a “Fortune favors the brave” slogan pops on screen. “Do you want to be Larry David, stuck in the past and skipping out on humanity’s greatest inventions, or do you want to be King James?” the Super Bowl’s crypto exchanges ask. There’s no proof of the value of cryptocurrency or the utility in owning Bitcoin or Ethereum — just an attempt to drum up FOMO. </p><div class=\"c-float-right\"><aside id=\"5W88iS\"><q>More FOMO than the future</q></aside></div><p id=\"5tbgNw\">Of course, none of the commercials here mentioned the quiet part of how cryptocurrency works: more buy-in from new customers means prices will continue to rise for cryptocurrencies, making existing crypto believers (and the companies like Crypto.com or FTX that facilitate those sales) more wealthy in a way that starts to look a little like a towering pyramid scheme dressed up in the veneer of “the future of the internet.” </p><p id=\"brpkYn\">Clearly, the cryptocurrency companies that shelled out millions for Super Bowl ads think it’s worth the attempt to get more mainstream customers, given the <a href=\"https://www.cnn.com/2022/02/11/media/super-bowl-commercials-nbc/index.html\">estimated $7 million price tag</a> for a 30-second ad in this year’s game. </p><p id=\"nA12Z3\">2022 wasn’t the first time the Super Bowl served as a hotbed for hyped, up-and-coming technology. Twenty-two years ago, Super Bowl XXXIV saw the then-St. Louis Rams face off against the Tennessee Titans, <a href=\"https://www.fastcompany.com/90453258/20-years-ago-the-dot-coms-took-over-the-super-bowl\">with a whopping 17 dot-com startups</a> buying commercials (compared to just two the year before). Two decades later — and after the burst of the dot-com bubble — <a href=\"https://en.wikipedia.org/wiki/Dot-com_commercials_during_Super_Bowl_XXXIV\">virtually all those companies are extinct</a>. </p><p id=\"Vy6lfv\">It’s not clear yet where cryptocurrency falls in that hype cycle or if it even is a comparable case at all. It’s possible that Super Bowl LVI is just the calm before the storm, and next year’s big game will be swamped with Web3 startups all pitching the world on the latest and greatest blockchain-based innovations. Or maybe, like the dot-com boom before it, these crypto companies will be defunct this time next year, and we’ll look back at 2022 as nothing more than an odd curiosity.</p><div class=\"c-float-right\"><aside id=\"5s0sMV\"><q>An ouroboros of nothingness</q></aside></div><p id=\"KSC5cn\">But one thing is clear from blockchain’s big Super Bowl debut: if the technology is to succeed in the mainstream, high-minded rhetoric about how Bitcoin is the next smartphone, moon landing, or wheel won’t be enough. At Super Bowl LVI, cryptocurrency promises an ouroboros of nothingness: it’s the future because it’s the future, and if you miss out, you won’t be part of it. At some point, though, if blockchain technology is going to have any chance at surviving with mainstream customers as anything but silicon snake oil, it’ll have to actually deliver on some of those promises. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mde_l3lUC4muDPEFG7LYrUz0O3g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8921023/acastro_bitcoin_2.jpg",
  "description": "Crypto was everywhere and nowhere at the Super Bowl",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}