{
  "title": "Crypto exchange FTX is launching a gaming unit to drive token adoption",
  "url": "https://www.theverge.com/2022/2/21/22944563/ftx-cryptocurrency-exchange-gaming-unit-nft-blockchain",
  "date": "2022-02-21T18:08:36.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/59DtGNt4OnlBasVAtclR7CyzlD4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70534155/acastro_210329_1777_nft_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"H9OmWp\">Crypto exchange FTX is launching a new team focused on driving cryptocurrency and non-fungible token (or NFT) adoption in the gaming world, <a href=\"https://www.bloomberg.com/news/articles/2022-02-21/ftx-enters-gaming-as-backlash-grows-against-crypto-s-incursion?sref=ExbtjcSG\">according to a <em>Bloomberg</em> report</a>.</p><p id=\"cxfpIR\">The initial offering from the new gaming unit will reportedly be a “crypto as a service” platform through which game publishers can launch tokens and provide support for in-game NFTs.</p><p id=\"VAWpHH\">“We are launching FTX Gaming because we see games as an exciting use case for crypto,” an FTX spokesperson told Bloomberg via email. “There are 2 billion+ gamers in the world who have played with and collected digital items, and can now also own them.”</p><div class=\"c-float-right\"><div id=\"fCKaQy\"><div data-anthem-component=\"aside:10374749\"></div></div></div><p id=\"6aUJ0P\">The new gaming-focused team from FTX is a sign of the continued push to bring blockchain-based products into the gaming space, as demonstrated by projects like <a href=\"https://www.theverge.com/2022/2/3/22914855/gamestop-nft-marketplace-immutable-x-ethereum-announcement\">GameStop’s own NFT marketplace</a>. But though game developers and retailers see crypto tokens and NFT items as a promising revenue stream, gamers have voiced widespread <a href=\"https://www.theverge.com/22917126/nfts-crypto-gamers-music-fans-fandoms\">skepticism over the need for blockchain technology</a>.</p><p id=\"IqqzTv\">In the past few months, various game publishing companies have been forced to <a href=\"https://www.theverge.com/2022/2/1/22913110/team17-worms-nft-metaworms-gaming-playtonic-overcooked\">cancel proposed NFT projects</a> after fan backlash, which has largely sprung from opposition to new forms premium downloadable content that are seen as offering little extra value to players. Other blockchain critics point out that there are already many established markets for the trade of in-game items, making the value proposition of cryptocurrency tie-ins unclear.</p><p id=\"5c9wMi\">Brett Harrison, president of FTX US, told <em>The Verge </em>that the company believes blockchain technology can build on existing game features without detracting from the experience of players who are hesitant to adopt it.</p><p id=\"Q17tqI\">“I think the backlash is primarily out of concern that the focus on cryptocurrency will divert the efforts of game studios away from making the best game possible for the players,” Harrison said in an email. “We believe that blockchain technology takes features of games that already exist, such as in-game avatars, skins, and rewards, and makes it possible for players to own, invest, and trade these items outside of the game. But the enjoyability of the game for all players, including those who don’t wish to participate in these kind of economies, should always be the primary objective regardless of whether blockchain tech is involved.”</p><p id=\"x7brgp\">For the FTX exchange, the attempt to build collaborations with game developers is another prong of its incursion into the cultural space. The company was behind the recent launch of an NFT marketplace for the Coachella festival, where photographs, posters and <a href=\"https://www.theverge.com/2022/2/1/22912255/coachella-lifetime-passes-nfts\">lifetime passes to the festival</a> were sold as NFTs. Viewers of this year’s Super Bowl will also have seen ads from FTX, which was <a href=\"https://www.nytimes.com/2022/02/11/business/media/super-bowl-commercials.html\">one of many crypto companies</a> vying for the attention of football fans.</p><p id=\"7uBtCx\">Having closed a $400 million funding round in January 2022, the company has become <a href=\"https://www.cnbc.com/2022/01/26/coinbase-rival-ftx-us-valued-at-8-billion-in-first-funding-round.html\">one of the most valuable private crypto firms in the world</a>, and claims to be the third-largest exchange by trading volume.</p><p id=\"oHR7OC\">FTX’s international operations were <a href=\"https://www.coindesk.com/business/2021/09/24/ftx-moves-headquarters-from-hong-kong-to-bahamas-report/\">relocated from Hong Kong to the Bahamas</a> in September 2021, citing the Caribbean nation’s favorable and comprehensive regulatory regime — though job postings for the gaming unit are currently <a href=\"https://jobs.lever.co/FTXUS\">listed</a> under FTX US, the US affiliate of the company.</p><p id=\"2kwq8M\"><em>Updated at 1:25pm ET to include statement from FTX US.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3vN8qI-rv32H0ZY2qqGqxbgpC_U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22413648/acastro_210329_1777_nft_0003.jpg",
  "description": "Gamers have voiced skepticism over blockchain-based products",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}