{
  "title": "Cycle-tracking apps stand behind their privacy policies as Roe teeters",
  "url": "https://www.theverge.com/2022/5/6/23060000/period-apps-privacy-abortion-roe-supreme-court",
  "date": "2022-05-06T15:29:36.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"BioWink GmbH Secures $7million In Funding From Investors\" src=\"https://cdn.vox-cdn.com/thumbor/gS8kpFoBIHL2MTD-FhiP2KjdvH8=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70839993/491970248.0.jpg\" />    </figure>  <p id=\"veGRJl\">Fertility and cycle tracking apps are widely used and can be useful tools that help people monitor their health. But <a href=\"https://www.consumerreports.org/health-privacy/what-your-period-tracker-app-knows-about-you-a8701683935/\">reports regularly show</a> that, like other health apps, they fall short when it comes to protecting user privacy. That shortfall is particularly concerning for users in the US after a leaked Supreme Court opinion indicated that the court intends to overturn <em>Roe v. Wade</em> — eliminating the right to an abortion in the United States and allowing states to criminalize the safe and lifesaving medical procedure.</p><p id=\"bYmhL8\">Information stored in cycle-tracking apps isn’t covered by the medical privacy law HIPAA, so companies have broad leeway with how they use it — and who they share it with. They often share information with data brokers, advertisers, and other third parties that are difficult to track. One app, Flo, was <a href=\"https://techcrunch.com/2021/01/13/flo-gets-ftc-slap-for-sharing-user-data-when-it-promised-privacy/\">cited by the Federal Trade Commission</a> for sharing data with Facebook even after it promised users it kept data private. </p><p id=\"LablDV\">To date, data from things like cycle tracking apps doesn’t appear to have been used to prosecute pregnant people in the US, but data sucked up by other internet and app use has already been used for that exact purpose.</p><p id=\"Cs7IwH\">“The fact that it’s possible is a problem that we shouldn’t ignore,” says Cynthia Conti-Cook, a technology fellow with the Ford Foundation’s gender, racial, and ethnic justice team who wrote a <a href=\"https://scholarworks.law.ubalt.edu/cgi/viewcontent.cgi?article=2078&amp;context=ublr\">2020 paper</a> on digital surveillance and abortion. </p><div class=\"c-float-right\"><aside id=\"dG3HgQ\"><q>“The fact that it’s possible is a problem that we shouldn’t ignore”</q></aside></div><p id=\"JLb1PE\"><em>The Verge</em> reached out to several popular fertility tracking apps and products to ask if they had any plans to adjust or strengthen protections around user data in response to the news that abortion would likely be illegal in many states by this summer. Many companies did not specify any planned changes in response to the news, instead leaning on their existing policies, which they said protect user data. </p><p id=\"nSWt9N\">The smart ring Oura, which has a menstrual cycle tracking feature, did not have any plans to share, spokesperson John Kuch said in an email. Apple did not respond to a request for comment about the period tracking feature on its Health app. Flo, the company cited by the FTC for sharing data, said in a statement from spokesperson Denae Thibault that the company went through an audit in March 2022 that showed “no weaknesses in privacy practices” and that it does not share data with third parties. </p><p id=\"GzuoB3\">Brigid Lowney, a spokesperson for popular period tracker Clue said in an email to <em>The Verge</em> that data in the app is “private and safe.” “We have received messages from users concerned about how their data could be used by US courts if Roe vs Wade is overturned. We completely understand this anxiety,” the statement said. It did not say if the company would change or strengthen privacy protections. </p><p id=\"2kZ6w0\">Nurx, a telemedicine company offering birth control and emergency contraception, said in a statement from spokesperson Ann Noder that it keeps patient data confidential. “We will evaluate our response to any eventual decision in light of our mission and principles concerning contraceptive access and affordability,” the statement said. </p><p id=\"2nYIOp\">Glow said in an email from its press team that it will “continue to uncompromisingly protect our users’ privacy and personal health information” but did not say if it would make any changes to its policies. </p><p id=\"Ll5uBM\">Conti-Cook says she’d be skeptical of companies that claim to tightly protect user data without seeing their business model. Pregnant or potentially pregnant people’s data is valuable to advertisers and other third parties because it’s a group that will be going out and buying new things for a potential future child. Selling that data, or making it available to partners, is the business model for these types of apps, she says. “That’s the business model of all of surveillance capitalism.”</p><p id=\"F6nna3\"><a href=\"https://helloclue.com/privacy\">Clue</a>, for one, says in its privacy policy that it does not share data with third parties or advertisers. It <a href=\"https://helloclue.com/articles/about-clue/making-money-at-clue-our-principles-and-promises\">said in a blog post</a> that its business model is not based on user data. But <a href=\"https://glowing.com/privacy\">Glow</a> and <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.nurx.com%2Fprivacy-policy%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F6%2F23060000%2Fperiod-apps-privacy-abortion-roe-supreme-court\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Nurx</a> say in privacy policies that they share data for marketing and advertising purposes. <a href=\"https://flo.health/privacy-policy\">Flo’s</a> policy says it shares “non-health Personal Data” for marketing purposes. </p><p id=\"od3yDa\">And all four of those companies, along with <a href=\"https://ouraring.com/privacy-policy-oura-health\">Oura ring</a>, say in their privacy policies that they would share personal user data in response to subpoenas or legal obligations. </p><div class=\"c-float-right\"><aside id=\"G7rj5T\"><q>“law enforcement is more tech savvy than they’ve ever been in history”</q></aside></div><p id=\"Xu7N9m\">The main concern for legal experts right now is that an individual’s data from these apps could be used against them if they’re already suspected of terminating a pregnancy. But it might not stop there, says Jerome Greco, a public defender in the digital forensics unit of the legal aid Society in New York City. “I think in the future it could become more broad, and they could be aggregating data and parsing data to try to identify suspects,” he says. “I think law enforcement is more tech-savvy than they’ve ever been in history and have more resources than they’ve ever had.”</p><p id=\"UhHODX\">Most of the digital information that’s been used to prosecute people for terminating a pregnancy has been internet searches and analysis of someone’s physical phone — like a <a href=\"https://scholarworks.law.ubalt.edu/cgi/viewcontent.cgi?article=2078&amp;context=ublr\">Mississippi woman</a> who was hospitalized after delivering a stillborn fetus and whose internet search history on how to induce a miscarriage was used to indict her for murder.</p><p id=\"ddoG4V\">“We’ve seen cases where women’s Google searches, unencrypted communications, emails, and other types of messages — like Facebook Messenger — were used against them, and social media posts,” Conti-Cook says. </p><p id=\"IF81fD\">It’s hard to predict the new ways states that criminalize abortion might find to use personal health data and other digital tools to prosecute people they suspect of terminating a pregnancy. But being vigilant about the hypothetical situations that could occur in the future helps people protect themselves, Conti-Cook says.</p><p id=\"LS20UQ\">People concerned about their data being used against them around abortion can take steps to protect themselves, Conti-Cook says: don’t share your phone with police, social workers, or anyone at a hospital. Use internet browsers that prevent tracking. Use encrypted text messaging apps to discuss anything sensitive. </p><p id=\"tCT0sz\">“Our digital autonomy is an extension of our bodily autonomy, and that’s how we need to start thinking about it,” she says. </p><p id=\"mX4sba\"></p><p id=\"8ecc5o\"></p><p id=\"apZImQ\"></p><p id=\"3xGxR7\"></p><p id=\"P1n1n9\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dl8QTjXKXr3V0pYqGILufC2OEWM=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23442392/491970248.jpg",
  "description": "Fertility apps often have leaky privacy policies.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}