{
  "title": "Dancing With the Stars is heading to Disney Plus ",
  "url": "https://www.theverge.com/2022/4/8/23016891/dancing-with-the-stars-disney-plus-exclusive-abc",
  "date": "2022-04-08T18:30:21.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"disney+\" src=\"https://cdn.vox-cdn.com/thumbor/LcR9zdhZE3LTT_KpdZ2JBYOcqaI=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70727561/disneyplus.0.5.jpg\" />        <figcaption>Image: Disney</figcaption>    </figure>  <p id=\"l2PXdd\">Wildly popular celebrity competition series <em>Dancing With the Stars</em> is heading to Disney Plus, marking the first live series to debut exclusively on the streaming service. </p><p id=\"llHlVx\">The series previously aired 30 seasons across 16 years on ABC, Disney’s broadcast TV network. Disney said the series has an exclusive two-season pickup on Disney Plus and will premiere in the US and Canada in the fall. The show will be shot in front of a live audience by BBC Studios’ production arm in Los Angeles. </p><p id=\"pUxd7r\">Specifics about Disney Plus’ rights to past seasons are unclear. Asked whether <em>Dancing With the Stars</em> will air on broadcast at all moving forward or whether Disney Plus will get the entirety of the show’s catalog, Disney spokesperson Heather Levine told <em>The Verge</em> that the company will have additional details to share at a later date.</p><div id=\"cuC1vz\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Get the Mirrorball ready.   Dancing with the Stars is moving to a new home when it returns this fall as the first LIVE series on <a href=\"https://twitter.com/hashtag/DisneyPlus?src=hash&amp;ref_src=twsrc%5Etfw\">#DisneyPlus</a>! <a href=\"https://twitter.com/hashtag/DWTS?src=hash&amp;ref_src=twsrc%5Etfw\">#DWTS</a>    <a href=\"https://t.co/CKmfgSgOZF\">pic.twitter.com/CKmfgSgOZF</a></p>— Disney+ (@disneyplus) <a href=\"https://twitter.com/disneyplus/status/1512479132780687362?ref_src=twsrc%5Etfw\">April 8, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"KlYTXG\">The decision to move one of ABC’s biggest live television series to Disney Plus underscores the company’s commitment to bringing more subscribers to its marquee streaming service. Disney Plus says it plans to reach 230 million to 260 million subscribers by 2024 and has been laser-focused on that goal. Some of Disney’s biggest films debuted on Disney Plus since its launch, and the service recently announced a <a href=\"https://www.theverge.com/2022/3/9/22967831/disney-plus-ads-hbo-max-hulu-streaming\">cheaper, ad-supported tier</a> as well.</p><p id=\"D6LbGj\">“The show’s broad appeal, as well as the overwhelming popularity of its Disney-themed competition nights, make Disney Plus the perfect home for <em>Dancing with the Stars </em>while continuing to expand our demographic reach,” Kareem Daniel, chairman of Disney media and entertainment distribution, said in a statement. </p><p id=\"J9nPVC\">It is, however, a bold decision given the show’s immense popularity at ABC. The company said that during its fall 2021 season, <em>Dancing With the Stars</em> was among the top five unscripted series with adults ages 18 to 49. Dana Walden, chairman of entertainment at Walt Disney Television, said in a statement that ABC is focused on expanding its unscripted slate.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UNwCDDyNGwQAeUhyZpyrem-mAUU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13412121/disneyplus.0.jpg",
  "description": "Disney Plus’ first live show will run at least two seasons.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}