{
  "title": "Daniel Radcliffe goes full sex symbol in first Weird Al biopic teaser",
  "url": "https://www.theverge.com/2022/5/3/23055717/daniel-radcliffe-weird-al-trailer-roku",
  "date": "2022-05-03T21:00:39.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jdZCHIynr9n4eY8Q8oHigLh1VVE=/130x0:1915x1190/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70828644/Screen_Shot_2022_05_03_at_3.59.59_PM.0.png\" />        <figcaption>Daniel Radcliffe as Weird Al. | Roku</figcaption>    </figure>  <p id=\"dgDAYk\">People might not have known what to expect <a href=\"https://www.theverge.com/2022/1/18/22884544/daniel-radcliffe-weird-al-yankovic-roku-biopic\">when Roku first announced</a> that it’d tapped Daniel Radcliffe to portray Weird Al Yankovic in its upcoming biopic, <em>Weird: The Al Yankovic Story. </em>But following the streamer’s inaugural upfront presentation this week and a new <em>Weird </em>trailer, there’s little question about what sort of energy director Eric Appel’s going for.</p><p id=\"oEv1cf\">At one point in Yankovic’s 1989 feature <em>UHF, </em>Yankovic plays a parody of Sylvester Stallone’s <em>Rocky </em>character due to Stallone himself <a href=\"https://screenrant.com/uhf-movie-sylvester-stallone-rambo-cameo-rejection/\">backing out of a planned cameo</a>. In order to approximate Stallone’s physique for the film, Yankovic donned an oiled-up muscle suit that didn’t need to look anywhere near as convincing as it did. Though <em>Weird</em>’s trailer doesn’t mention <em>UHF </em>or Stallone by name, Radcliffe does somehow manage to evoke the idea of a buff Yankovic the moment he rips his shirt off on stage in front of a cheering crowd.</p><p id=\"8UitYf\"><em>Weird </em>was just one of many upcoming projects Roku hyped up during its first upfronts, where it <a href=\"https://newsroom.roku.com/news/2022/05/roku-unveils-a-better-tv-advertising-experience-at-first-in/mih1dmow-1651512827\">also announced</a> Zoe Lister-Jones’ <em>Slip</em> and a new season of <em>The Great American Baking Show. </em>Though Roku’s slate of forthcoming content makes it seem as if the streamer’s keeping its options open in terms of what kind of movies and series it wants to become known for, its vision for OneView, its advertising platform, appears to be far more focused. According to the company, Roku’s OneView ad platform will soon offer retailers the option to pair shoppable ads with Roku Pay, the payment platform through which subscribers can currently purchase content.</p><p id=\"PeGGA0\"><em>Weird: The Al Yankovic Story</em> debuts on the Roku Channel this fall.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4CO52u6IvmjcXw8FPa2vZOCLdYw=/0x60:2044x1130/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23435917/Screen_Shot_2022_05_03_at_3.59.59_PM.png",
  "description": "Fans of Weird Al’s UHF will see the singer in Daniel Radcliffe’s portrayal.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}