{
  "title": "Data leak from Russian delivery app shows dining habits of the secret police",
  "url": "https://www.theverge.com/2022/4/3/23008658/data-leak-russian-delivery-app-dining-habits-secret-police-yandex-food",
  "date": "2022-04-03T18:21:59.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Yandex\" src=\"https://cdn.vox-cdn.com/thumbor/HGGv_6Sdn5EGPjC79inZr2lJiVA=/0x0:2835x1890/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70705183/1205021532.0.jpg\" />        <figcaption><em>A Yandex Food leak exposed the data of 58,000 users, including those associated with the Russian government.</em> | Image: Getty Images</figcaption>    </figure>  <p id=\"5dMY2o\">A massive data leak from Russian food delivery service Yandex Food revealed the delivery addresses, phone numbers, names, and delivery instructions belonging to those associated with Russia’s secret police, according to findings from <a href=\"https://www.bellingcat.com/news/rest-of-world/2022/04/01/food-delivery-leak-unmasks-russian-security-agents/\"><em>Bellingcat</em></a>.</p><p id=\"Qng0pr\">Yandex Food, a subsidiary of the larger Russian internet company, Yandex, <a href=\"https://yandex.ru/company/services_news/2022/01-03-2022\">first reported</a> the data leak on March 1st, blaming it on the “dishonest actions” of one of its employees and noting that the leak doesn’t include users' login information. Russian communications regulator Roskomnadzor has since threatened to fine the company up to 100,000 rubles (~$1,166 USD) for the leak, which <a href=\"https://www.reuters.com/legal/litigation/russian-tech-giant-yandex-lambasted-over-data-leak-regulator-launches-case-2022-03-23/\"><em>Reuters</em></a> says exposed the information of about 58,000 users. The Roskomnadzor also blocked access to an online map containing the data — an attempt to conceal the information of ordinary citizens, as well as those with ties to the Russian military and security services.</p><div class=\"c-float-right\"><aside id=\"g8XeF5\"><q>Bellingcat used the data to identify a person with ties to Alexey Navalny’s poisoning</q></aside></div><p id=\"HQN1bf\">Researchers at <em>Bellingcat </em>gained access to the trove of information, sifting through it for leads on any people of interest, such as an individual linked to the <a href=\"https://news.un.org/en/story/2021/03/1086012\">poisoning of Russian opposition leader</a> Alexey Navalny. By searching the database for phone numbers collected as part of a previous investigation, <em>Bellingcat</em> uncovered the name of the person who was in contact with Russia’s Federal Security Service (FSB) to plan Navalny’s poisoning. <em>Bellingcat</em> says this person also used his work email address to register with Yandex Food, allowing researchers to further ascertain his identity. </p><p id=\"SUjuHL\">Researchers also examined the leaked information for the phone numbers belonging to individuals tied to Russia’s Main Intelligence Directorate (GRU), or the country’s foreign military intelligence agency. They found the name of one of these agents, Yevgeny, and were able to link him to Russia’s Ministry of Foreign Affairs and find his vehicle registration information.</p><p id=\"IhihTF\"><em>Bellingcat</em> uncovered some valuable information by searching the database for specific addresses as well. When researchers looked for the GRU headquarters in Moscow, they found just four results — a potential sign that workers just don’t use the delivery app, or opt to order from restaurants within walking distance instead. When <em>Bellingcat</em> searched for FSB’s Special Operation Center in a Moscow suburb, however, it yielded 20 results. Several results contained interesting delivery instructions, warning drivers that the delivery location is actually a military base. One user told their driver “Go up to the three boom barriers near the blue booth and call. After the stop for bus 110 up to the end,” while another said “Closed territory. Go up to the checkpoint. Call [number] ten minutes before you arrive!”</p><div id=\"DkZWym\"><blockquote class=\"twitter-tweet\"><p lang=\"ru\" dir=\"ltr\">Благодаря слитой базе «Яндекса» нашлась ещё одна квартира экс-любовницы Путина Светланы Кривоногих. Именно туда их дочь Луиза Розова заказывала еду. Квартира 400 м², стоит примерно 170 млн рублей!<a href=\"https://t.co/z3uGKOdQhc\">https://t.co/z3uGKOdQhc</a> <a href=\"https://t.co/tOGXOsFmRY\">pic.twitter.com/tOGXOsFmRY</a></p>— Соболь Любовь (@SobolLubov) <a href=\"https://twitter.com/SobolLubov/status/1506611213530247173?ref_src=twsrc%5Etfw\">March 23, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"odARbk\">In a translated <a href=\"https://twitter.com/SobolLubov/status/1506611213530247173\">tweet</a>, Russian politician and Navalny supporter, Lyubov Sobol, said the leaked information even led to additional information about Russian President Vladimir <a href=\"https://nypost.com/2021/02/17/vladimir-putins-secret-daughter-says-shes-enjoying-the-limelight/\">Putin’s alleged “secret” daughter</a> and former mistress. “Thanks to the leaked Yandex database, another apartment of Putin’s ex-mistress Svetlana Krivonogikh was found,” Sobol said. “That’s where their daughter Luiza Rozova ordered her meals. The apartment is 400 m², worth about 170 million rubles [~$1.98 million USD]!”</p><p id=\"lYpYqj\">If researchers were able to uncover this much information based on data from a food delivery app, it’s a bit unnerving to think about the amount of information Uber Eats, DoorDash, Grubhub, and others have on users. In 2019, <a href=\"https://www.theverge.com/2019/9/26/20885963/doordash-blog-post-data-breach-user-data-passwords\">a DoorDash data breach</a> exposed the names, email addresses, phone numbers, delivery order details, delivery addresses, and the hashed, salted passwords of 4.9 million people — a much larger number than those affected in the Yandex Food leak.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QO7vbc65vKjkKFbNimA2BuzU8EA=/0x203:2835x1687/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23364060/1205021532.jpg",
  "description": "The Yandex Food leak exposed the data of 58,000 users.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}