{
  "title": "David Pierce returns to The Verge to join the cast of The Vergecast ",
  "url": "https://www.theverge.com/2022/4/14/23024321/david-pierce-returns-to-the-verge-to-join-the-cast-of-the-vergecast",
  "date": "2022-04-14T14:00:00.000Z",
  "author": "aude.white",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YAC1RukZj3vFZN0LzDnnyWNBENc=/0x43:800x576/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70748326/IMG_1131__1_.0.jpeg\" />        <figcaption>David Pierce</figcaption>    </figure>  <p id=\"bkKudY\">The Verge and the Vox Media Podcast Network today announced that David Pierce is returning to The Verge as editor-at-large to join the cast of the site’s namesake podcast <a href=\"https://podcasts.apple.com/us/podcast/the-vergecast/id430333725\"><em>The Vergecast</em></a><em>. </em>Pierce begins his role on April 18th, appearing on <em>The Vergecast </em>for the first time since he left The Verge in 2015 on the show’s April 22nd episode. </p><p id=\"yhxfGl\">Pierce will co-host <em>The Vergecast, </em>which each week unpacks the tech news of the week. This marks a homecoming for Pierce, who was previously deputy editor at The Verge, and a frequent guest on <em>The Vergecast </em>during his original stint at the site. In addition to his hosting duties, Pierce will also write and report for The Verge, focusing on major tech companies and consumer technology.</p><p id=\"b1bzWk\">“David was one of our very first hires when The Verge launched 2011 and helped lay the foundation that allowed The Verge to grow into what it is today,” says The Verge’s editor-in-chief Nilay Patel. “We actually launched <em>The Vergecast </em>before The Verge itself, and David is going to bring a burst of energy to <em>The Vergecast </em>as we refresh and expand the show with more episodes, more special series, and more guest appearances from inside and outside The Verge. We also have some grand ideas about what the future of tech news — and The Verge itself — looks like in the years to come.”</p><p id=\"b9oi2Z\">Pierce joins from Protocol, where he was editorial director, helping to launch the publication and its flagship “Source Code” newsletter and podcast. Prior to Protocol, Pierce held roles at the <em>Wall Street Journal </em>and <em>Wired, </em>where he covered personal technology. He is based in Washington, D.C., and is a graduate of the University of Virginia.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dcxKKM3pVw916DuT1MBcMtcRDGQ=/0x100:800x519/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23388278/IMG_1131__1_.jpeg",
  "description": "Pierce will be editor-at-large at The Verge, beginning his role on April 18th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}