{
  "title": "Dbrand’s limited-edition leather skins are back for good",
  "url": "https://www.theverge.com/2022/2/24/22949191/dbrand-leather-phone-tablet-laptop-skins-back-in-stock-permanently",
  "date": "2022-02-24T17:26:40.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/G3E7IsA16g-OIMWxLLwOABViXu8=/160x0:1888x1152/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70545437/Collection.0.jpg\" />        <figcaption><em>Dbrand’s leather collection of skins.</em> | Image: Dbrand</figcaption>    </figure>  <p id=\"pO238d\">Gadget skin-maker Dbrand is announcing that its line of adhesive leather skins for smartphones and laptops are now available for sale once again, and this time, they will remain as a permanent fixture in its <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeDealsRoundup022422/https://dbrand.com/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">online store</a>. The vegetable-tanned genuine leather skins first launched as a limited-edition run back in December and are now back due to popular demand. The 3M adhesive leather skins sell for around $34.95 for smartphones and $69.95 for laptops and are available in black, brown, and tan colorways for over 100 products, including the new Samsung Galaxy S22, iPhones, MacBooks, Google Pixels, and gaming consoles.</p><p id=\"AUtUqV\">Dbrand says that these leather skins are made from full-grain cow leather, and they’re less than 0.5mm thick — though it will feel a bit thicker than your average adhesive skin. The skins have been created with a custom adhesive solution in collaboration with 3M that allows for bubble-free application and adhesive-free removal. Though applying a skin is not always an easy feat, <a href=\"https://youtu.be/Q8w8obzV_t8\">Dbrand has a new installation tutorial video</a> that also covers how to care for the leather and speed up the patina process.</p><div id=\"ORnL3H\"><div data-anthem-component=\"gallery:11065532\"></div></div><p id=\"RK1Z29\">For those that prefer keeping their phones in a case, the leather skins can also be purchased for Dbrand’s Grip Case if you want a leather accent attached to the back. And if that’s not enough of the leather lifestyle for you, Dbrand is also selling extras and oddities like a leather balm, leather keytag, and even a leather cube or pyramid.</p><p id=\"GE7rfv\">With Apple’s recent leather cases leaving many disappointed and the relative rarity of good, high-quality leather case options for other devices, Dbrand’s skins might be the next best option. But if you’re looking for protection over a little extra grip and style points, you’ll want to go with the case option.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Jj0D95Agn9u0Ltc-kByjZ6Cwx30=/0x40:2048x1112/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268198/Collection.jpg",
  "description": "Choose from three colors of leather for a range of devices",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}