{
  "title": "DC sues Grubhub, claiming its app is full of hidden fees and jacked-up prices",
  "url": "https://www.theverge.com/2022/3/21/22989563/district-of-columbia-karl-racine-grubhub-lawsuit-misleading-fees",
  "date": "2022-03-21T19:51:24.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/X6aWNEmlp9GXAXRGx7oQfUJVpJA=/0x0:7360x4907/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70653580/Grubhub_For_Restaurants_Delivery_Status.0.png\" />    </figure>  <p id=\"NxMVdo\">District of Columbia Attorney General Karl Racine <a href=\"https://thedcline.org/2022/03/21/press-release-ag-racine-sues-grubhub-for-charging-hidden-fees-using-misleading-marketing-tactics-during-the-covid-19-pandemic-to-increase-profits-at-the-expense-of-consumers-restaurants/\">is suing Grubhub</a> for deceptive business practices, saying its food delivery app covertly inflates prices for diners who order through it. The suit demands an end to a laundry list of allegedly illegal practices as well as financial restitution and civil penalties.</p><p id=\"01WRn8\"><a href=\"https://oag.dc.gov/sites/default/files/2022-03/2022-03-21-Grubhub-Complaint-.pdf\">The newly filed lawsuit</a> argues that Grubhub’s promises of “free” online orders — and “unlimited free delivery” for Grubhub Plus — are misleading. While customers can make pickup orders for free, the company charges delivery and service fees for standard orders and service fees for Grubhub Plus orders, displaying the service fee until recently as part of a single line with sales taxes. “Grubhub misled District residents and took advantage of local restaurants to boost its own profits, even as District consumers and small businesses struggled during the COVID-19 pandemic,” said Racine in a statement. “Grubhub charged hidden fees and used bait-and-switch advertising tactics — which are illegal.”</p><div class=\"c-float-left\"><aside id=\"I3Uiw1\"><q>“Grubhub misled District residents and took advantage of local restaurants”</q></aside></div><p id=\"iR9fOu\">The complaint says Grubhub orders <a href=\"https://www.nytimes.com/2020/02/26/technology/personaltech/ubereats-doordash-postmates-grubhub-review.html\">often cost more</a> than ordering the same item at a restaurant and argues that the company fails to reasonably disclose this to consumers. “Because Grubhub already charges consumers several different types of fees for its services ... consumers expect that the menu prices listed on Grubhub are the same prices offered at the restaurant or on the restaurant’s website,” it says.</p><p id=\"a77uXo\">As previously reported by news outlets <a href=\"https://www.theverge.com/2020/1/29/21113876/grubhub-seamless-fake-restaurant-listings-no-permission-postmates-doordash\">including <em>The Verge</em></a>, Grubhub has also listed many restaurants without their permission to expand its service, routing orders through its services and taking a commission. The complaint says it listed “over a thousand” restaurants in DC that had no connection with the company, asserting that the unapproved listings often contained menu errors and resulted in orders that would “take longer to fill, would be filled incorrectly, would be delivered cold, or would eventually be cancelled altogether.”</p><p id=\"IjFk9v\">Grubhub — which also operates Seamless and several other food delivery apps — has made more elaborate attempts to insert itself into restaurant transactions as well. The lawsuit notes its launch of <a href=\"https://www.theverge.com/2019/6/28/19154220/grubhub-seamless-fake-restaurant-domain-names-commission-fees\">unsanctioned microsites</a> that appear to be official restaurant sites, as well as custom phone numbers that <a href=\"https://ny.eater.com/2019/5/20/18632443/grubhub-nyc-restaurants-fees-fake-phone-calls-no-order-lawsuit\">let it charge fees</a> when customers call restaurants, even when the calls didn’t result in orders. The company also offered a “Supper for Support” promotion that <a href=\"https://www.theverge.com/2020/3/31/21201039/grubhub-10-off-promo-supper-for-support-restaurants-discount-full-commission-coronavirus-closure\">required restaurants to foot the bill</a> for a special discount; it offered restaurants <a href=\"https://www.theverge.com/2020/4/2/21206019/grubhub-restaurants-250-discounts-coronavirus\">$250 in compensation</a> after a backlash.</p><div class=\"c-float-right\"><aside id=\"rzqe9d\"><q>Grubhub insists it hasn’t misrepresented its fees</q></aside></div><p id=\"ZlOneD\">Grubhub indicated that it would fight the lawsuit and said many of the practices it describes are either appropriately disclosed or have been discontinued. “During the past year, we’ve sought to engage in a constructive dialogue with the DC attorney general’s office to help them understand our business and to see if there were any areas for improvement,” said Katie Norris, director of corporate communications, in a statement to <em>The Verge</em>. “We are disappointed they have moved forward with this lawsuit because our practices have always complied with DC law, and in any event, many of the practices at issue have been discontinued. We will aggressively defend our business in court and look forward to continuing to serve DC restaurants and diners.”</p><p id=\"6n5Evt\">Grubhub’s statement says the app no longer lists restaurants that haven’t agreed to work with it, and it’s retired its microsites and the Supper for Support program. It also includes disclosures in its terms of use — although “moving forward,” it will more prominently tell users that prices might be lower when ordering directly from the restaurant, and it will specify in marketing that only pickup orders are free. “Grubhub has not misrepresented its fees,” it says.</p><p id=\"F18t9j\"><a href=\"https://www.nytimes.com/2020/02/26/technology/personaltech/ubereats-doordash-postmates-grubhub-review.html\">Grubhub is far from the only delivery app</a> charging higher fees that customers aren’t necessarily aware of, nor is it the only one that’s come under legal fire. Last year, the city of Chicago <a href=\"https://www.theverge.com/2021/8/27/22644880/chicago-doordash-grubhub-lawsuit-tipping-phone-order-fee-cap\">sued both Grubhub and DoorDash</a> on similar grounds, and it <a href=\"https://chicago.eater.com/2022/2/2/22912477/chicago-grubhub-lawsuit-third-party-delivery-amended-complaint-restaurants\">publicized an amended complaint</a> last month. Conversely, Grubhub and other delivery app companies <a href=\"https://www.theverge.com/2021/9/10/22666455/doordash-grubhub-uber-eats-sue-new-york-city-restaurant-fee-caps-lawsuit\">have sued cities for fee caps</a> implemented during the COVID-19 pandemic — which the companies have called a legal overreach.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uKAHQfzeoUGUgm82q51H1BDveX0=/0x0:7360x3853/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19656045/Grubhub_For_Restaurants_Delivery_Status.png",
  "description": "Hidden fees and \"bait-and-switch\" advertising",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}