{
  "title": "Dead Space remake gets January release date",
  "url": "https://www.theverge.com/2022/5/12/23068873/ea-dead-space-release-date-art-livestream",
  "date": "2022-05-12T18:16:36.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_LsziWCHuaatORn4XnXg1bUQcpQ=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861968/CH3_Console_Room_Concept.0.png\" />        <figcaption>Image: EA Motive</figcaption>    </figure>  <p id=\"zc8dar\">In a day filled with news of <a href=\"https://www.theverge.com/2022/5/12/23068378/starfield-bethesda-redfall-delay-2023-pc-xbox\">disappointing but not wholly unexpected postponements</a>, it seems like the<em> </em><a href=\"https://www.theverge.com/2021/7/22/22586840/dead-space-remake-pc-ps5-xbox-series-x\"><em>Dead Space</em> remake</a> is coming along nicely enough for the developers to commit to a release date. Today, <a href=\"https://youtu.be/yAXLkdbSiVg\">in a developer livestream</a>, the team at EA’s Motive Studio announced the remake to 2008’s survival horror smash hit will launch January 27th while also showing off the work put into giving the game a fresh coat of bloody paint.</p><p id=\"yP8cBC\">Though the livestream was plagued by several technical hiccups, it was primarily focused on the art of the <em>Dead Space </em>remake. The developer team outlined three pillars that underpin the game’s uniquely horrifying look and feel: </p><ul><li id=\"c8gJfF\">Horror storytelling. <em>Dead Space</em> is, obviously, set in space but sci-fi isn’t in the visual driver’s seat, it’s all the spooky stuff.</li><li id=\"shqobU\">Immersion. The developers stressed that their goal is to ensure players will be scared of what’s in front of them.</li><li id=\"PqUXko\">A lived-in world. Every object, from the plasma cutters to the health tanks, tells a story and has a meaning.</li></ul><p id=\"WVvbEz\">The livestream dove into the technical process of rebuilding a <em>Dead Space</em> level from the ground up. There were lots of before and after shots of items, the updates made to Isaac’s iconic space suit, and short clips of Isaac walking around updated levels. At the end of the livestream, the team put together all the visual pillars and concepts highlighted previously in a short in-game demo.</p><p id=\"uPoDG4\">This is the third presentation on the development of the<em> Dead Space</em> remake. A few months ago, EA Motive held <a href=\"https://www.theverge.com/2022/3/11/22973541/ea-dead-space-remake-released-early-2023\">a similar livestream</a> centered on the game’s audio, and before that, fans were treated to <a href=\"https://www.theverge.com/2021/8/31/22648846/dead-space-remake-twitch-livestream-news-footage\">the very first look at the remake</a>. With the release date set for January 27th, EA also announced that fans would get a full reveal of the game later this year to coincide with spooky season. </p><p id=\"KwQakE\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Vgg3smrHOGql-Av-9hYtPUfFMrc=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23456398/CH3_Console_Room_Concept.png",
  "description": "We’re also getting a full look at the game at Halloween.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}