{
  "title": "Death is not the end of life in After Yang’s first trailer",
  "url": "https://www.theverge.com/2022/2/1/22912211/after-yang-a24-trailer-kogonada",
  "date": "2022-02-01T14:52:41.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Justin H. Min as Yang.\" src=\"https://cdn.vox-cdn.com/thumbor/Q748sFGqKYoiRzOPuBlyV0SfF7I=/543x0:2325x1188/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70457369/Screen_Shot_2022_02_01_at_9.03.42_AM.0.png\" />        <figcaption>A24</figcaption>    </figure>  <p id=\"75GLnB\">Though the future of writer / director Kogonada’s <a href=\"https://www.theverge.com/2022/1/27/22902494/sundance-film-festival-2022-best-movies\"><em>After Yang</em></a><em> </em>is a lush, calm, near-utopia, human life finds a way to engineer its own tragedy in the movie’s first trailer.</p><p id=\"ABBjfH\">Set in a future where it’s become commonplace for people to buy sophisticated androids to take care of their organic children, <em>After Yang </em>tells the story of Jake (Colin Farrell), his wife Kyra (Jodie Turner-Smith), their adopted daughter Mika (Malea Emma Tjandrawidjaja), and Yang, their “son” charged with watching over his younger sister. Despite all of the time that Yang’s spent with the family acting as both a caregiver and a general assistant, when he begins to malfunction, there’s some disagreement as to what they should do, seemingly because Jake and Kyra aren’t exactly on the same page about who Yang is to them. He is Mika’s, and he’s part of their family, but he’s also a machine whose sudden “death” and all its financial implications bring to the surface tensions that Jake, Kyra, and Mika have all been trying to leave unacknowledged.</p><p id=\"zkCknK\">The trailer gives you a good sense of the melancholy present all throughout <em>After Yang</em> and teases out just enough of its wider world to show you how strange a place it is. What it doesn’t show, though, is how much of an emotional gut-punch <em>After Yang </em>is more often than not — that’s something you’ll have to see for yourself when <em>After Yang</em> hits theaters and begins streaming on Showtime on March 4.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/znnwtS-n54ExurZj93Q95f5-G6U=/300x0:2569x1188/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23209634/Screen_Shot_2022_02_01_at_9.03.42_AM.png",
  "description": "A24’s After Yang from director Kogonada imagines a future where living machines learn, love, and also die.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}