{
  "title": "Deebot X1 Omni review: the do-everything robot vacuum",
  "url": "https://www.theverge.com/23037426/ecovacs-deebot-x1-omni-review-vacuum-mop-robot-voice-control",
  "date": "2022-04-24T14:00:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "  <p>This $1,550 robot can mop, vacuum, clean itself, and find you in your home</p> <p class=\"p--has-dropcap p-large-text\" id=\"zh8ldg\">There are robot vacuums and then there are home robots. <a href=\"https://www.amazon.com/ECOVACS-X1-Self-Empty-Auto-Clean-Navigation/dp/B09NPKWDRX?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Ecovacs’ $1,549 Deebot X1 Omni Robot Vacuum and Mop</a> is the latter. This bot can sweep and mop your floors, empty its own dustbin, refill its mopping reservoir, and clean and dry its mop. Plus, it can respond to your voice commands directly with its onboard voice assistant and double as a roving home security camera. I’d say we’ve gone way beyond “vacuum.” </p><p id=\"y8SULs\">This brave new world became apparent when I was standing at my fridge on a busy morning and spilled a few drops of yogurt on the floor. Rather than pause my well-oiled pre-school routine to grab a mop, I simply had to say, “Okay, Yiko.” (pronounced <em>ee-kho</em>) </p><p id=\"OmRzxH\">“I’m here!” said the bot. “Come clean here,” I commanded. Following a whirring noise as it moistened its mops, the X1 Omni rumbled over to where I was standing to tackle the mess while I continued to make breakfast and pack lunches. After it finished its job I told it to “go home,” where it emptied its bin and washed and blow-dried its two spinning mops. </p><p id=\"lNVvV1\">While lots of robot vacuums work with voice assistants, the X1 Omni is the first to have its own dedicated voice interface. After a month of living with Yiko, I’m convinced this is the future of smart home voice control. </p><div id=\"vVCQLe\"><div data-anthem-component=\"scorecard:11156417\"></div></div><p id=\"C50NYW\">While Yiko is not going to play your favorite Spotify playlist for you or update you on the weather, the benefit here is context. Yiko knows it’s a vacuum, so responds more accurately and reliably. When I tested this model’s direct competitor, the <a href=\"https://www.theverge.com/22960447/roborock-s7-maxv-ultra-review-robot-vacuum-mop-hybrid\">$1,400 Roborock S7 MaxV Ultra</a>, with Siri shortcuts, asking Apple’s voice assistant to tell Bobby (my name for the vacuum) to clean the kitchen, Siri often thought I was trying to make a phone call to someone named Bobby. </p><aside id=\"hBlFNo\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The Best Robot Vacuum You Can Buy Right Now\",\"url\":\"https://www.theverge.com/22997597/best-robot-vacuum-cleaner\"}]}'></div></aside><p id=\"fVDiN1\">Because home voice assistants like Siri and Alexa can do so many things, they are more prone to misunderstanding commands. Yiko responded correctly to every request, and never tried to call anyone. The X1 Omni can also use its onboard camera and microphones to improve its context-based clues — helping it know I was in front of the fridge when I asked it to clean up the yogurt. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0LwYitBpw2Th7ZuGZFIm3pHI9zg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397449/jtuohy_220314_5147_0003.jpg\">      <figcaption><em>The X1 Omni features an onboard voice assistant named Yiko as well as a camera that doubles as a home security device.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/K900T2wk_bXRJPBk8904mCQrRH0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397454/jtuohy_220314_5147_0008.jpg\">      <figcaption><em>Two removable, washable mopping pads help the X1 Omni keep your floors sparklingly clean.</em></figcaption>  </figure></div></div></div><p id=\"suavdF\">This is an excellent application of a technology I expect we’ll see more of in the smart home. I don’t anticipate it will replace whole-home voice assistants. (No one wants a microphone and speaker in all their lightbulbs, plus there are better ways to add context to smart lighting, such as Ultra-Wideband or radar technology.) But on a complicated multitasking device like a robot vacuum, a dedicated voice assistant makes a lot of sense. </p><p id=\"9LZL0T\">As excited as I am about this innovation, Yiko is still a work in progress. Voice control is a hard nut to crack. I sometimes had to repeat the wake-up phrase two or three times to get the robot’s attention. In addition, it struggled to hear me when it was vacuuming and it sometimes got distracted, going off to clean the whole house rather than carrying out the command I gave it. The speaker is also pretty crummy and you have to be close by for it to hear you (it has an array of 3 microphones on its silver turret).</p><div><aside id=\"7ex1dB\"><q>On a multitasking device like a robot vacuum, a dedicated voice assistant makes a lot of sense</q></aside></div><p id=\"jIGvuT\">The “clean here” command seemed only to work when the robot’s camera can see you — it couldn’t find me when I was out of its line of sight but it could still hear my commands. Also, not everyone wants a roving camera in their house. Many high-end vacuums have cameras onboard to enable AI obstacle detection (so they don’t roll over dog poop or eat your charging cables). Like the X1 Omni, some turn this into a home security / pet watching feature, which may be more than most people need or want out of their vacuum cleaner. The X1 can store photos and videos on Ecovacs’ servers, which raises potential privacy concerns (see <em>Smart Home Data Privacy</em>). It also has two-way audio, so you can chat with your family, through the vacuum.</p><div id=\"XXPp7E\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Deebot X1 Omni robot vacuum test video|106900\" data-volume-uuid=\"226c81b52\" data-volume-id=\"106900\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-199\" class=\"volume-video\"></div><div class=\"caption\">Yiko can be commanded to wash the mopping pads, empty the bin, and clean where you are, alongside lots of other common robot vacuum voice commands.</div></div><div class=\"c-float-right c-float-hang\"><div id=\"2C7CmQ\"><div data-anthem-component=\"aside:11156596\"></div></div></div><p id=\"gZQbDj\">In terms of a robot vacuum, the X1 Omni has all the high-end specs you’d expect: AI obstacle avoidance so it doesn’t get tripped up by stray cables and socks; lidar navigation and mapping; 5,000 Pa of suction power; and a 5,200mAh battery that promises over four hours of cleaning on quiet mode. In testing, it never ran out of juice on standard mode when cleaning my 400-square-foot main floor, but when I pumped up the power to max suction and high water flow with two passes, it had to go back to charge after 70 minutes. </p><p id=\"Se5PPs\">You control the robot with the Ecovacs Home app, which has digital keep-out zones to keep the bot away from tricky or sensitive areas, room-specific and customized cleaning (so you can have the kitchen double mopped and the hallway vacuumed on max power but just lightly clean the dining room), four vacuuming modes, and three mopping modes. </p><p id=\"GYLiwz\">All this is in addition to the built-in voice assistant and security camera feature. It’s a lot. And I’m not convinced that we need to throw the kitchen sink at the challenge of cleaning our floors (this model literally has a sink inside it for washing the mops). The phrase “too many cooks” is apt here, primarily because the X1 Omni software is not always up to all the tasks the hardware demands. </p><p id=\"rGu8pM\">This is a good vacuum and excellent mop, but it’s not as smart as its cheaper competitors, such as the $1,400 Roborock S7 MaxV Ultra and <a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\">the $800 Roomba J7 Plus</a> (which doesn't mop). It has AI-powered obstacle avoidance but was tripped up once by my fake dog turds (made from putty). While it ably avoided cables and shoes and other large objects, it also decided a smattering of Cocoa Krispies cereal and a gum wrapper should be avoided. The X1 navigated expertly around furniture, getting in between my kitchen stools and dining table chair legs without knocking anything over, but its 3-D mapping technology that should identify all my furniture automatically (so I can ask it to go clean around the couch) only found one piece of furniture in my house. </p><p id=\"Ch1Om2\">You can add furniture manually in the Ecovacs app, but the X1 went through a phase of refusing to use the carefully crafted map on which I’d added keep-out zones and furniture, and instead created a new one on each run. I eventually fixed this by deleting all the maps and sending it out on another quick mapping run (which it did in under two minutes, faster than most lidar mapping robots that take five or six minutes to get my floorplan down). This time the map stuck, but it hasn’t identified any more furniture and I’m reticent to put all that work in, in case it deletes it again. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fg5CE5ns_wRHahTY6guPGLLLmvA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397459/jtuohy_220315_5147_0013.jpg\">      <figcaption><em>The Deebot X1 Omni is a good-looking, if very large, robot vacuum station.</em></figcaption>  </figure><p id=\"spC07M\">Software niggles aside, the X1’s hardware is impressive, and this is a good-looking robot vacuum, a rarity in this space. Ecovacs tasked Danish firm Jacob Jensen Design (of Bang &amp; Olufsen fame) to dream up this sleek, modern-looking robot and base. While the whole package is enormous (the base is two feet high and over a foot deep), it looks much better than Roborock’s utilitarian auto empty, wash, and fill dock, and it does far more than iRobot’s elegant auto-empty base for its j7 robot vacuum. </p><p id=\"8TUs9L\">Ecovacs’ automatic Omni Station hides all the utilitarian features of this home cleaning robot inside a polished silver and matte black case. It packs in two removable, four-liter water tanks (one for dirty water, one for clean), a pop-out drawer for the dust bag, and a nice little cubby for the robot to hide in, tucking it away more discreetly than most charging docks. It looks good enough that you won’t feel the need to hide this away, although you may struggle to find a home for it since it is so big. </p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_u-LwEOq7AM46wmUZwTbi9ABZyU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397457/jtuohy_220314_5147_0011.jpg\">      <figcaption><em>The base station has three controls on the top. One fills the mop cleaning “sink” so you can scrub it, the other sends the robot on a job, and the third recalls the bot to the base.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GqdysaG_XHX5AYivAgmIwGv0IaQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397458/jtuohy_220314_5147_0012.jpg\">      <figcaption><em>The Omni station holds two large water tanks up top and a dust bag in a drawer in the middle.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PaxblTjhGzJKgTUv8sqAtjpFv5M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397448/jtuohy_220314_5147_0002.jpg\">      <figcaption><em>Spare mop pads and a brush for scrubbing the mop cleaning sink when necessary are stored between the two water tanks.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UANwyFfbFW1Aal2QaA4tgep03c8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23411092/PXL_20220420_180710287.jpg\">      <figcaption><em>The X1’s small bristle/rubber hybrid roller brush is disappointing.</em></figcaption>  </figure></div><p id=\"S62BzE\">The X1 Omni is an excellent robot mop. Instead of the thin scrap of cloth you find on most mopping vacuums, it has two thick mopping pads that spin at 180 RPM. However, they have to be removed if you want to vacuum rugs or carpet, as the robot has rug-avoidance tech that stops it from dragging wet cloths over your carpet. You need to flip the entire robot over to install or uninstall them, and there’s no storage spot for them in the giant Omni base. But the two pads look impressive as they do their spinning thing. </p><p id=\"7a3JEl\">While it mops much better than most hybrid mop/vacs, it wasn’t any more effective at mopping than the Roborock S7 MaxV Ultra. Both do excellent jobs of tackling light spills and cleaning up fine debris the vacuum missed, but neither can handle tougher jobs like ketchup or dried-up milk. You also can’t add a cleaning solution to the X1 to help with the hard scrubbing.</p><p id=\"2XwAlr\">The Roborock model also has the advantage that you don’t have to remove the mop if you just want to vacuum, thanks to a feature that lifts it up when it goes over carpet. But the X1 Omni does a better job at cleaning its mop, filling a little sink in the dock with water and swirling them around every 15 minutes during a clean. (You can adjust this timing in the app.) Then, when it’s finished, it will quietly blow hot air for two to four hours to get them properly dry. The Omni also has much larger tanks, but I still needed to refill them as often as the Roborock model (after every four or five cleans). I assume this is because its plush pads use more water. </p><p id=\"q39Ilf\">The X1 Omni is good at vacuuming, cleaning each room methodically while intelligently avoiding most obstacles. It heads back to empty its bin at the end of a run (a predictably loud process, although not too lengthy at around 12 seconds). I had no problems with clogging and it emptied the small bin effectively each time. </p><p id=\"tzPTWt\">But the X1 Omni is not the best sucker out there: the Roomba j7 and i3 and Roborock S7 and S7 MaxV are all more effective at getting up the dirt. One reason for this is that the Omni uses just one small bristle / rubber hybrid brush (the competition has larger rubber-only brushes). In my experience, these hybrid brushes get more easily tangled by hair and carpet fluff than rubber ones, making them less effective. I had to clean this one out every few days, which was another thing that took away from that promised hands-free experience.</p><p id=\"e5Lbvs\">There are a lot of innovative and useful features on the X1 Omni, and I am very impressed by the design and functionality of the base station as well as Yiko. But the robot’s cleaning prowess, while very good, isn’t <em>as</em> good as the Roborock S7 Max V or Roomba j7, despite costing more. </p><p id=\"d7OTLN\">Ecovacs does have two cheaper models in its new flagship X1 series that dispense with a few features to cut costs (and size). Both offer Yiko voice control, AI obstacle avoidance, and 5,000 Pa suction power. </p><p id=\"6ZqlzN\"><a href=\"https://www.amazon.com/ECOVACS-Auto-Cleaning-Navigation-Avoidance-Assistant/dp/B09NPM632Z?ref_=ast_sto_dp&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The $1,349 Deebot X1 Turbo</a> is the same as the X1 Omni, except the base only cleans and refills the mops. (It doesn’t auto-empty the bin, which is probably the best feature in recent robo vac innovation.) <a href=\"https://www.amazon.com/ECOVACS-Emptying-Navigation-Avoidance-Assistant/dp/B09NVJ9G6H?ref_=ast_sto_dp&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The $1,149 Deebot X1 Plus</a> comes with a more standard auto-empty station that doesn’t clean or refill the mopping tank. It also uses an upgraded version of Deebots’ previous mopping technology, which is a flat cloth on a removable water tank. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/g0mP5YJEoss3z20TXSOHYN5YlMU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23410182/KV_DEEBOT_X1_FamilyImage_2__1_.jpg\">      <cite>Image: Ecovacs</cite>      <figcaption><em>The XI Omni is Ecovacs’ flagship model alongside the X1 Turbo and X1 Plus.</em></figcaption>  </figure><p id=\"ykCr4q\">While I’ve not tested the X1 Plus, I have used Deebot’s OZMO Pro mopping system before, and it’s very effective, using vibration and downward pressure to remove dirt. But if you are considering spending over $1,000 on Ecovacs robot vacuum and mop, the X1 Omni is the all-singing, all-dancing model you should get. </p><aside id=\"RgTdrJ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to control your robot vacuum with Alexa \",\"url\":\"https://www.theverge.com/22961597/robot-vacuum-connect-control-amazon-alexa-assistant-roomba-roborock-how-to\"},{\"title\":\"How to control your robot vacuum with Google Assistant \",\"url\":\"https://www.theverge.com/22968709/robot-vacuum-connect-google-assistant-roomba-roborock-how-to\"}]}'></div></aside><p id=\"vBcf4q\">In terms of other competition, the only robot that comes close to matching all the X1 Omni’s impressive abilities is the $1,400 Roborock S7 MaxV Ultra. And while the Roborock just edges the Deebot in overall cleaning ability, consider the X1 Omni if you want something that looks nicer in your home. Plus, the Yiko voice assistant is better at controlling the vacuum than Amazon’s Alexa or Google’s voice assistant (which it does work with), making it a good choice if don’t have (or want to have) other voice assistants in your home. </p><p class=\"c-end-para\" id=\"q1RLPe\">The X1 Omni is a very impressive device. But, even as a pioneer in this new category of home robot — where these bots can do so much more than just vacuum — it is very expensive and still has a few kinks to work out (specifically on the software side). However, the future of hands-free home cleaning is looking good — very good.</p><div><div id=\"0wGTe7\"><div data-anthem-component=\"aside:11156543\"></div></div></div><p id=\"rIksSI\"><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p><p id=\"c1Kz0l\"></p><p id=\"m2AcmR\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/m2V0tioqfYoJT04PEdaw8T8QbgQ=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23410079/jtuohy_220314_5147_0010_1.jpg",
  "description": "For $1,550 this robot vacuum better do it all",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}