{
  "title": "Deliveries package tracking app loses FedEx access, says blame shipping companies",
  "url": "https://www.theverge.com/2022/4/11/23021155/deliveries-package-app-fedex-api-services",
  "date": "2022-04-12T03:08:43.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Be7s5jI-gRmYh9vMZOiCTZmJECE=/40x0:1246x804/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70738665/1286x0w.0.png\" />        <figcaption><em>The app will no longer support tracking FedEx packages.</em> | Image: Junecloud</figcaption>    </figure>  <p id=\"U7cbjX\">The developer of Deliveries, a package tracking app that’s listed as an App Store editor’s choice and that some people here at <em>The Verge</em> rely on, has said that they’re “no longer able to maintain the same service” thanks to a lack of support from delivery companies. In <a href=\"https://junecloud.com/journal/iphone/the-future-of-deliveries.html\">an April 5th post</a> written by developer Mike Piontek, the company says that “Deliveries relies on many different shipping companies, and without their help it’s not possible for the app to continue working the way you expect.”</p><p id=\"WffPco\">The impetus for the post seems to be the fact that Deliveries is no longer able to track FedEx packages. While the app can usually let users track their package’s progress on a map, or receive notifications if something changes, the app currently doesn’t display an estimated delivery date, current location, or any other information if you put in a FedEx tracking number. Instead, it prompts you to open FedEx’s tracking page for the package in your web browser.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lZ7qp77iJi5HSc02sxjMHMF2ADw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383228/IMG_4265.jpeg\">      <figcaption><em>With other carriers you can see tracking history and delivery estimates.</em></figcaption>  </figure><p id=\"ACwGvZ\"><a href=\"https://www.macrumors.com/2022/04/08/deliveries-app-losing-functionality/\"><em>MacRumors</em> also reports</a> that a Deliveries feature that let you paste in an Amazon order link to track your package is also no longer working.</p><p id=\"8gJrwW\">Replying to a customer on April 4th, Junecloud (the company that makes Deliveries) <a href=\"https://twitter.com/junecloud/status/1511190349552701443\">tweeted</a> that FedEx will be removed from its list of supported services, claiming FedEx “made the decision to block third-party trackers such as Deliveries from their API.” <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.fedex.com%2Fen-us%2Fdeveloper%2Fannouncements.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F11%2F23021155%2Fdeliveries-package-app-fedex-api-services\" rel=\"sponsored nofollow noopener\" target=\"_blank\">FedEx’s developer website</a> doesn’t seem to mention any massive changes to its API, though it does suggest that, starting March 31st, anyone issuing or creating custom notifications for ground economy labels should instead send people to its website. </p><p id=\"QOqz6N\">There have also <a href=\"https://techcrunch.com/2022/03/21/fedex-apps-test-appears-to-show-the-ability-to-track-deliveries-from-other-services/\">been reports</a> that FedEx is working on adding the ability to track packages from other carriers to its own app, which would make it a competitor to apps like Deliveries. </p><p id=\"483olZ\">Piontek <a href=\"https://twitter.com/robotspacer/status/1511493416638722054?s=20&amp;t=5qZpaemDMZxWctqZm9d8xA\">said in a later tweet</a> that he didn’t know of anything customers could do to track FedEx packages in Deliveries. Junecloud <a href=\"https://junecloud.com/support/services.html\">does say</a> you’ll still be able to add FedEx packages to Deliveries, but you’ll only see tracking information if you go to an online view. According to its services page, this type of change has happened before with other carriers, like Royal Mail and Australia Post. </p><div class=\"c-float-right\"><aside id=\"nGc8RH\"><q>Junecloud sees more changes on the horizon making it harder for third-party tracking apps</q></aside></div><p id=\"TLfli3\">Junecloud’s post predicts that other carriers will start shutting off access to their APIs. The company says that “it’s likely that over time, more services in Deliveries will no longer show tracking information directly in the app,” and apologizes that those kinds of changes make the app less useful. Junecloud also says that it’ll do its best to keep making Deliveries as useful as it can.</p><p id=\"h1Fmgx\">As some <a href=\"https://twitter.com/jmarsh5/status/1512490770799988740?s=20&amp;t=08zzQGqo9V8sfQOSgRn8DQ\">people have commented</a>, the post does raise the question of whether this change is coming for every delivery app — are all developers going to have to drop support for tracking FedEx packages, and will shipping companies push people to their first party apps? Ivan Pavlov, the developer of package tracking app Parcel, told <em>The Verge</em> in an email that some developers may be able to deal with the changes:</p><p id=\"GLE9TJ\">“I believe that in case of FedEx they have just limited access to their tracking webpage. It became an issue for Deliveries and they stopped supporting it. FedEx continues to be supported in Parcel. Obviously there is always a chance that something might change or break in the future though.”</p><p id=\"MllROF\">However, Pavlov did agree with Junecloud’s post about carriers sometimes taking a hostile stance towards third-party delivery apps. “Supporting different carriers is a challenge and not all of them are friendly to 3rd party developers. There is no guarantee that a carrier will be always supported in any app, including mine.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ENEuhhUJ39wGOr0ARUaEZE_8bEI=/0x66:1286x739/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23383135/1286x0w.png",
  "description": "Are third-party package tracking apps going away?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}