{
  "title": "Dell XPS 17 review: big screen dream",
  "url": "https://www.theverge.com/22913150/dell-xps-17-9710-review-price-specs-features",
  "date": "2022-02-02T15:00:00.000Z",
  "author": "Dan Seifert",
  "content": "  <p>Master of the multitask</p> <p id=\"A8WKAr\">I’ve never really understood the appeal of 17-inch laptops. They are often too big to carry around easily or use on your actual lap like you might want to do with a laptop from time to time. At the same time, they have many of the same compromises of smaller laptops when it comes to power and performance, especially compared to a desktop computer.</p><p id=\"MHWw83\">But after using the latest version of Dell’s XPS 17 (the 9710 model) for a bit, I’m starting to see the appeal. The XPS 17’s spacious 16:10 17-inch screen nearly obviates the need to use an external monitor. It has powerful components that can make it ideal for coding or engineering work on the go. If you’re working from home and have limited space or your typical workspace shares duties with other tasks that make having an external monitor, mouse, and keyboard in the way very annoying, the XPS 17’s all-in-one package that’s easy to stow away might be an appealing proposition.</p><div id=\"Z57qXu\"><div data-anthem-component=\"scorecard:11007756\"></div></div><p id=\"fLAc73\">The latest version of the XPS 17, which came out in the fall of 2021, starts at $1,599.99 for an 11th Gen Core i5-11400H processor, 8GB of RAM, 512GB of storage, and Intel’s integrated graphics. I’ve been using a higher-specced version, which comes with an 11th Gen Core i7-11800H chip, 32GB of RAM, 1TB storage, a higher-resolution screen, and Nvidia’s RTX 3060 GPU running at 70 watts. It lists for $2,649.99 but is often discounted for a couple of hundred dollars less than that. You can also opt for a Core i9 chip, more RAM, and more storage — for more money, of course. Either way, this is firmly in premium laptop territory.</p><p id=\"iLCCrV\">This iteration of the XPS 17 is identical on the outside to the model <a href=\"https://www.theverge.com/21327454/dell-xps-17-2020-laptop-review-display-test-specs-price-features\">we reviewed back in the middle of 2020</a>. It has a 5.53-pound silver aluminum body, soft-touch keyboard deck, extremely minimal bezels, four Thunderbolt 4 USB-C ports, and a full-size UHS-II SD card slot. It lacks any USB-A ports or other video connections like HDMI, so you’re going to need adapters and dongles to plug in almost anything that isn’t USB-C ready (a USB-A and HDMI dongle does conveniently come in the box).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bSRsnyb7gaLfSYbHCfopGft8mlI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22885901/akrales_210922_4759_0051.jpg\">      <figcaption><em>The XPS 17’s keyboard and trackpad are roomy and comfortable, but some may miss a number pad.</em></figcaption>  </figure><p id=\"KCWfHX\">The XPS 17’s footprint isn’t much larger than some 15-inch laptops, thanks to those trim bezels around the display. But it’s noticeably more dense when moving it from place to place, and it’s not as portable as smaller laptops. It’s also a bit unwieldy to use when I’m trying to knock out some emails from the couch.</p><p id=\"l9DtlH\">The keyboard is quiet and comfortable to type on, though its travel is a bit low for my taste. I’m sure a good number of people would prefer to have a full number pad on a laptop of this size, but I don’t ever use a numpad and didn’t miss it. I like how the keyboard is centered below the display and above the trackpad, and a numpad would certainly mess up that alignment.</p><div class=\"c-float-left\"><aside id=\"ZwjBqw\"><q>The XPS 17’s trackpad is about as big as you’ll find on a Windows laptop</q></aside></div><p id=\"PUAFcU\">Speaking of the trackpad, it’s about as big as you’ll find on a Windows laptop and works quite well. The click is firm and reassuring, multi-finger tracking works as expected, and its big size didn’t present any issues with palm rejection for me.</p><p id=\"mtQarK\">The star of the show here is still the display, which can be had in either a 1920 x 1200 pixel non-touch version or the 3840 x 2400 touch model I’ve been using. Both screens are bright and colorful, but I’d probably swing towards the higher resolution model myself since text is very crisp on it. I wouldn’t upgrade just for the touch screen — this is a large, traditional clamshell laptop that doesn’t lend itself well to poking the screen with your finger — but you can’t get the resolution upgrade without touch, so it comes along for the ride.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/I9KsYjW80Yy2jiFvKo5sD1DvWNc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22885931/akrales_210922_4759_0116.jpg\">      <figcaption><em>The XPS 17’s webcam is tiny and terrible.</em></figcaption>  </figure><p id=\"4DB51s\">These display specs are nearly identical to what you can get on the smaller XPS 15, so the real advantage to the XPS 17 is how much more room it affords for multitasking. As Monica Chin pointed out in <a href=\"https://www.theverge.com/21327454/dell-xps-17-2020-laptop-review-display-test-specs-price-features\">her review of the prior model</a>, the XPS 17’s screen makes it very easy to put two windows side by side for comparison. It’s so big there’s no reason for me to zoom the text in Google Docs like I do with almost every other computer (and on my big external monitor). It’s just a big, roomy screen to stretch out and do your work on, like the Cadillac Eldorado of laptops. There’s almost no reason to use an external monitor when your laptop has a screen this big.</p><p id=\"UKISEb\">You might want to use an external webcam, though. Just like every other XPS computer of the past few years, the XPS 17’s tiny 720p webcam is terrible, with soft, grainy video and poor color reproduction. It’s hidden in the top bezel above the display (fortunately, Dell ditched the low-mounted “nose cam” a couple years ago) and supports Windows Hello facial login, but that’s about all the good I can say about it. Even the Windows Hello feature is surprisingly hit or miss, but fortunately, the keyboard deck has a reliable fingerprint scanner you can use instead.</p><div class=\"c-float-right\"><aside id=\"CB7tFN\"><q>The big screen is a dream for multitasking</q></aside></div><p id=\"RggcGD\">The deck-mounted, top-firing speakers are better than the webcam, but I suspect most people will use this computer with headphones anyways. Should you need to use them, they get plenty loud enough, but don’t expect wonderful bass reproduction.</p><p id=\"fCULVw\">As Dell’s top-tier XPS laptop, the XPS 17’s internal components are the best you can get in the lineup. Performance is unsurprisingly good for productivity tasks, and I never once ran into a slowdown or sluggishness. Flipping between dozens of tabs, multiple windows, background music streaming, and multiple virtual desktops is a breeze.</p><p id=\"LU0K08\">In more demanding creative tasks, the XPS 17 did well but didn’t lead the pack in anything. It finished our Premiere Pro 4K video export test in 3:35 — a good result, but not as fast as you can get from a MacBook Pro with an M1 Pro or Max chip or some of the more powerful gaming laptops out there. On the PugetBench Premiere Pro benchmark, it scored 940 — another strong, but not best in class, result. Fan noise is present, but it’s never obnoxious, and the large chassis does a good job keeping temperatures manageable. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MfPJ4ai-2E4A5d4O-temktWUcOY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22885903/akrales_210922_4759_0065.jpg\">      <figcaption><em>The XPS 17 has two USB-C ports on each side and a full-size SD card slot on the right but lacks USB-A or other ports.</em></figcaption>  </figure><p id=\"akPKv0\">The XPS 17 is not a gaming laptop (where’s the RGB?), but thanks to the discrete graphics card in my review unit, it can play games fairly well, so long as you’re willing to turn down the resolution and detail settings. On <em>Shadow of the Tomb Raider</em> at 1920 x 1200 resolution, the XPS 17 pulled 75FPS at the highest detail settings, complete with ray tracing. <em>Red Dead Redemption 2</em> scored 58FPS with the same settings, while <em>Horizon Zero Dawn</em> managed a similar 59FPS at 1920 x 1200 resolution and Ultra details. Trying to play any of those games at the full 4K resolution of the display will result in a choppier experience, though, as frame rates quickly fell to the 20s and 30s, even with the help of Nvidia’s DLSS when available.</p><p id=\"QXp9wq\">The point is: I wouldn’t recommend the XPS 17 for serious gamers, but if you want to use it for some casual gaming after work, it’s certainly capable.</p><p id=\"k2gng8\">Battery life averaged about six and a half hours with the brightness set to just under 50 percent (plenty bright to be comfortable to use) with my typical workload of web browsing, email, Slack, document work, and scrolling through Twitter. I’d expect better performance from a more portable computer, but since the XPS 17 isn’t likely to be moved around much and is usually going to be close to an outlet, its battery life is more than usable. </p>  <figure class=\"e-image\">        <img alt=\"The top aluminum lid of the Dell XPS 17\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mKB6i2J_A-Y1sZLQIfGtXqQP5rU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22885904/akrales_210922_4759_0091.jpg\">      <figcaption><em>Dell’s XPS design language is handsome but aging at this point.</em></figcaption>  </figure><p id=\"f75OSy\">It’s hard to compare the XPS 17 to similar computers simply because there just aren’t that many. Most other 17-inch laptops are <a href=\"https://www.theverge.com/22900362/msi-ge76-raider-review-alder-lake-17-inch-gaming-laptop\">colossal gaming rigs</a>, with terrible battery life and even more heft. <a href=\"https://www.theverge.com/22364183/lg-gram-17-2021-intel-11th-gen-iris-xe-graphics-performance-battery-review\">LG’s Gram 17</a> is unique in that it has a large screen, but it doesn’t pack the performance chops of the XPS 17. Apple’s latest <a href=\"https://www.theverge.com/22751921/apple-macbook-pro-14-16-inch-2021-m1-pro-max-review\">16-inch MacBook Pro</a> is probably the closest option, with a slightly smaller screen, better performance (outside of gaming), and a lighter chassis at a slightly higher price. But if you don’t like MacOS or just want an even bigger screen, the XPS 17 stands alone. It might just be the ideal work-from-home laptop for those without dedicated desks to work on.</p><div><div id=\"zi1sCH\"><div data-anthem-component=\"aside:11007772\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/dn15i7w_2YF1fgqqhuon_cG2VBc=/0x150:2080x1239/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22885935/akrales_210922_4759_0040.jpg",
  "description": "All the multitasking you could ask for",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}