{
  "title": "Dell’s new-look XPS 13 Plus is now available, starting at $1,299",
  "url": "https://www.theverge.com/2022/4/28/23044947/dell-2022-xps-13-plus-now-available-price-specs",
  "date": "2022-04-28T04:01:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Dell XPS 13 Plus\" src=\"https://cdn.vox-cdn.com/thumbor/_iWv2STir9-cc8SxOnmunc4N9M4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70803100/dellxps13plushero.0.jpg\" />        <figcaption><em>The XPS 13 Plus is available in silver or graphite.</em></figcaption>    </figure>  <p id=\"18EwSH\">Dell announced that the bold XPS 13 Plus <a href=\"https://www.theverge.com/2022/1/4/22865547/dell-xps-13-plus-2022-hands-on-new-design-features\">it debuted back at CES 2022</a> is now available for purchase. It starts at $1,299, and while Dell didn’t detail the exact specifications for this configuration, it’ll likely get the lowest specs listed in a spec sheet shared by the company. Those include a 13.4-inch 1920 x 1200 16:10 aspect ratio display with 500 nits of peak brightness, Intel’s 12th Gen Core i5-1240P processor (28W, 12-core, 4.4GHz boost clock), 8GB of LPDDR5 RAM clocked at 5,200MHz, and a 256GB SSD. </p><p id=\"7VxQFf\">Each model includes a 60W USB-C AC adapter and features two Thunderbolt 4 ports (but no headphone jack), a Windows Hello 720p webcam, as well as a fingerprint reader embedded in the power button.</p><div class=\"c-float-right\"><aside id=\"hgFX0C\"><q>there will also be a Developer Edition that will ship with Ubuntu 20.04</q></aside></div><p id=\"c8qGWx\">As we noted back at CES, this new version of the XPS 13 has a more futuristic-looking design than Dell’s standard model. The most notable differences include the Plus’ Touch Bar-like row of backlit function keys, as well as the keyboard, which sits flush with the chassis. Finally, there’s the new trackpad that’s invisible to the eye but takes up a similar (if not slightly larger) amount of real estate within the middle of the glass-covered wrist rest. And instead of physically clicking in, the trackpad hardware emulates the click with haptic feedback, like Apple’s recent laptops.</p>  <figure class=\"e-image\">        <img alt=\"Dell XPS 13 Plus\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PURkvJNrhwS7DvJI66OkAb9xSKw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420659/xps13plusalt.jpg\">      <cite>Dell</cite>      <figcaption><em>It certainly looks nice, but we’ll have to see in the full review whether the new keyboard and trackpad are actually enjoyable to use.</em></figcaption>  </figure><p id=\"ZbtlqX\">While Dell didn’t share pricing information for other configurations, you’ll be able to upgrade the XPS 13 Plus at the time of purchase with a 1080p touchscreen (it’s non-touch by default) or a 4K touchscreen. The highest-end display option is a 3.5K (3456 x 2160) Gorilla Glass 7-covered OLED touchscreen with 100 percent DCI-P3 color gamut coverage. </p><p id=\"0bZT8N\">In terms of processing power, Dell can go up to a 12th Gen Intel Core i7-1280P with 14 cores, as well as up to 32GB of DDR5 RAM and up to 2TB of PCIe 4.0 SSD storage. Oh, and last thing: there will be a Developer Edition of the XPS 13 Plus that will ship with Ubuntu 20.04, and it will cost $1,249.99.</p><p id=\"VaJWI0\">We look forward to testing out the XPS 13 Plus soon. <a href=\"https://www.theverge.com/2022/1/4/22865547/dell-xps-13-plus-2022-hands-on-new-design-features\">As my colleague Monica Chin wrote</a> in her hands-on back in January, we’re cautiously optimistic that all of these aesthetic changes won’t get in the way of it being a good machine. But stay tuned for the full review to find out.</p><p id=\"yvupy7\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gBybOg6d0nHBxFVyal5OGrCh2Cs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23420628/dellxps13plushero.jpg",
  "description": "It features capable 28W processors and DDR5 RAM.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}