{
  "title": "Department of Energy boosts domestic battery supply chain with billions in funding",
  "url": "https://www.theverge.com/2022/5/2/23053839/energy-department-battery-ev-clean-energy-supply-chain-biden",
  "date": "2022-05-02T20:41:15.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Volkswagen electromobility\" src=\"https://cdn.vox-cdn.com/thumbor/wLCcQk5m71fNixZVWV4eyJ5nBi4=/5x0:4796x3194/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70824161/1233388085.0.jpg\" />        <figcaption><em>A Volkswagen employee wires the battery on a line for the VW ID.3 during a press tour of Volkswagen’s Transparent Factory.</em> | Photo by Sebastian Kahnert/picture alliance via Getty Images</figcaption>    </figure>  <p id=\"jC0iJP\">The Department of Energy (DOE) opened up billions of dollars in funding today to build up domestic supply chains for batteries. Batteries will be crucial in the Biden administration’s plans to transition the nation to electric vehicles and clean energy.</p><p id=\"Kz8c6c\">The DOE says in its <a href=\"https://www.energy.gov/articles/biden-administration-announces-316-billion-bipartisan-infrastructure-law-boost-domestic\">announcement</a> that it will give $3.1 billion to companies to boost “the creation of new, retrofitted, and expanded commercial facilities” to process materials, make batteries, and recycle them at the end of their lives. Another $60 million in grants from the DOE will fund efforts to find second uses for old EV batteries. The money comes from the Bipartisan Infrastructure Law that passed last year. </p><p id=\"ajO8Iz\">The bigger picture: the Biden administration has set pretty big goals for clean energy and transportation in the US. He committed the US, under the Paris climate agreement, to <a href=\"https://www.theverge.com/2021/4/22/22394366/joe-biden-pledge-us-greenhouse-gas-emissions-2030\">halving its greenhouse gas emissions</a> this decade. To do that, the administration wants to get the power grid to run completely on <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/01/12/fact-sheet-biden-harris-administration-races-to-deploy-clean-energy-that-creates-jobs-and-lowers-costs/\">carbon pollution-free energy by 2035</a> and make sure that <a href=\"https://www.theverge.com/2021/8/5/22610501/biden-2030-ev-goal-trump-emissions-rollback\">half of all new car sales</a> are electric or hybrid vehicles by the end of the decade.</p><div class=\"c-float-right\"><aside id=\"ruqOUJ\"><q>That kind of future hinges on having the battery technology</q></aside></div><p id=\"5htnPC\">That kind of future hinges on having the battery technology to make electric vehicles more affordable as well as to store wind and solar energy so that it’s available when sunshine and winds wane. </p><p id=\"3BMlRK\">Without taking action, a DOE <a href=\"https://www.energy.gov/sites/default/files/2021-06/FCAB%20National%20Blueprint%20Lithium%20Batteries%200621_0.pdf\">analysis</a> last year found that US battery production capacity<strong> </strong>wouldn’t be able to meet even half of the projected demand for lithium-ion batteries for electric vehicles in 2028. Right now, battery supply chains are <a href=\"https://www.theverge.com/22785274/clean-renewable-energy-supply-chain-crisis-climate-mining-manufacturing\">especially vulnerable</a> because they’re <a href=\"https://www.europarl.europa.eu/RegData/etudes/ATAG/2021/696181/EPRS_ATA(2021)696181_EN.pdf\">concentrated</a> in just a handful of countries. That’s led to allegations of labor abuses, like a <a href=\"https://www.theguardian.com/global-development/2019/dec/16/apple-and-google-named-in-us-lawsuit-over-congolese-child-cobalt-mining-deaths\">lawsuit</a> against Tesla and other companies for the deaths of child workers. </p><p id=\"0RuoKx\">Today’s announcement is just the latest among a series of moves the Biden administration has made <a href=\"https://www.theverge.com/2021/6/8/22524663/us-lithium-battery-supply-chain-broken\">to get its hands on more (and better) batteries</a>. In March, Biden <a href=\"https://www.theverge.com/2022/3/31/22996690/joe-biden-defense-production-act-ev-batteries\">invoked the Defense Production Act</a> to bolster domestic mining and the processing of minerals like nickel, lithium, cobalt, graphite, and manganese that are vital for battery-making. Last June, the Department of Energy put out a “<a href=\"https://www.energy.gov/eere/vehicles/articles/national-blueprint-lithium-batteries\">national blueprint</a>” for making lithium batteries. All in all, the Bipartisan Infrastructure Law includes $7 billion for domestic battery supply chains — from gathering raw materials to making battery cells and recycling them at the end of their lives.</p><p id=\"E7XuOl\"></p><p id=\"iwBL3V\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-AoIRROM7GhcY0mfszQRHSH-FCk=/0x341:4800x2854/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23433574/1233388085.jpg",
  "description": "The Biden administration’s clean energy dreams demand a lot of batteries.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}