{
  "title": "Destiny 2: The Witch Queen’s new weapons and gear look super powerful",
  "url": "https://www.theverge.com/2022/2/1/22912334/destiny-2-the-witch-queen-exotic-weapons-grand-overture-parasite-osteo-striga",
  "date": "2022-02-01T15:50:56.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/RT_UI9iE1HYdHk0JN_x3gRQlxIQ=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70457694/l0MMDqC.0.jpeg\" />    </figure>  <p id=\"cIV1W3\">Hot off the heels of <a href=\"https://www.theverge.com/2022/2/1/22912075/sony-bungie-acquisition-fortnite-playstation-destiny-live-service-games\">Sony’s Bungie acquisition news</a>, Bungie is in full teaser mode for <em>Destiny 2: The Witch Queen. </em>The latest <em>Destiny 2</em> expansion launches on February 22nd, and it’s set to include a trio of new exotic weapons. <em>Destiny 2</em> already has some incredibly unique weapons, but these three look like they will up the ante.</p><p id=\"6NMM3E\">First up is the Grand Overture, a slug launcher that charges full auto missiles at enemies. It appears to be similar to what the Scorn enemies use in <em>Destiny 2</em> and will act like a machine gun with explosive projectiles (think Wardcliff) to wipe out hoards of Hive. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SDKJAjUeOh0HhdnAv_z44KeQ0V0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23209797/86zQjiM.jpeg\">      <cite>Image: Bungie</cite>      <figcaption><em>It looks like some type of machine gun.</em></figcaption>  </figure><p id=\"Eim35b\">Where things really start to get interesting is the new Parasite weapon: it literally launches worms with increasing damage. The brief spot in the trailer shows a worm flying through the air, much like watching a Witherhoard flying towards you before you evaporate near-instantly in <em>Destiny 2</em>’s Crucible mode. If you thought Witherhoard was annoying in player-vs-player (PvP), the Parasite will surely live up to its name.</p><p id=\"Fz6nSe\">Last in the trio is the Osteo Striga, which appears to be an exotic submachine gun. If you remember the Recluse, this looks like a spiritual successor. It has swarming projectiles that trigger a toxic burst that looks a lot like the Thorn hand cannon that exists in <em>Destiny 2</em> today.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/H4OhsgnuRQB2ItZS3FExlC065Mk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23209799/Ap5rExN.jpeg\">      <cite>Image: Bungie</cite>      <figcaption><em>Parasite will be a parasite in PvP.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6r-n6JTxha8mpSE6Yk8KRWfPy-Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23209803/Kej0mCb.jpeg\">      <cite>Image: Bungie</cite>      <figcaption><em>Hello Recluse 2.0</em></figcaption>  </figure></div></div></div><p id=\"4YD4OZ\">Alongside the exotic weapons, we also get a closer look at the new Glaive weapons that will appear in <em>The Witch Queen</em>. The titan class gets the ability to spawn a protective shield around fellow guardians, similar to the void bubble super mechanic. Space magic warlocks can deploy healing turrets with their Glaive, which will complement the healing aspects of the solar subclass for warlocks. Finally, jumpy hunters get an arc burst of chain lightning that tracks enemies in true hunter-style.</p><p id=\"8KGZ1v\">Bungie is also teasing some new exotic armor. The Hoarfrost-Z chest for titans will replace a barricade with a giant stasis wall, making it the perfect exotic armor piece to pair with the stasis subclass. Warlocks get Osmiomancy gloves, which provide an additional coldsnap with enhanced seeking. Given how annoying coldsnap grenades were in PvP when they first debuted in <em>Destiny 2: Beyond Light</em>, the warlock gloves are worrying! Hunters will also get a Blight Ranger helmet to pair with the arc subclass and reflect projectiles with increased damage. Bungie demonstrates all three new exotic armor pieces in Destiny 2’s PvP mode... gulp.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/iErP5hnDstIHDCw4sbvzumT9w5Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23209796/wCBo56o.jpeg\">      <cite>Image: Bungie</cite>      <figcaption><em>Weapon crafting is coming to Destiny 2.</em></figcaption>  </figure><p id=\"R2EDRr\"><em>Destiny 2: The Witch Queen</em> will also include weapon crafting, and Bungie teases the Mars location for how players will be able to create their own weapon rolls. The Menagerie activity in <em>Destiny 2</em> was great for choosing a masterwork on a particular gun, and it looks like players are going to be able to choose a whole lot more in The Witch Queen.</p><p id=\"uG2iHt\"><em>Destiny 2: The Witch Queen</em> debuts on Xbox, PlayStation, PC, and Stadia on February 22nd.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GKo6PA0wZjG-_WRxLsBWF8uYo5o=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23209768/l0MMDqC.jpeg",
  "description": "A trio of new exotic armor and weapons",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}