{
  "title": "Discord is finally starting to let users link their PlayStation Network accounts",
  "url": "https://www.theverge.com/2022/1/31/22911101/discord-playstation-network-account-connect-switching-experiments-rollout-partnership",
  "date": "2022-01-31T22:06:10.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6QTmCcmV0lR5VwLjlzibSz3zJlo=/129x0:1071x628/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70455291/FKdG7CxUcAE70EH.0.jpeg\" />    </figure>  <p id=\"pnDzqN\">Discord is <a href=\"https://discord.com/blog/playstation-discord-account-connection-linking-game-status\">finally rolling out</a> the ability to connect your PlayStation Network account to the chat app, following <a href=\"https://www.theverge.com/2021/5/3/22417586/sony-discord-playstation-consoles-investment-partnership\">an announcement last May</a> that it and Sony would “bring the Discord and PlayStation experiences closer together on console and mobile.” Right now, the integration is pretty limited, both in terms of what it can do and seemingly who has access to it, but it’s likely the first step for things to come later. Outside of its partnership with Sony, Discord is also working on an interesting account management feature that we’d love to see make it to everyone. </p><p id=\"yhxvjt\">Linking your accounts will let your Discord friends see what game you’re currently playing on your PlayStation, and you have the option of adding your PSN ID to your Discord profile so that other people can easily add you on the service. According to Discord’s announcement post, it’s “gradually rolling out the ability to link your PSN account from Discord,” so it may take some time before you can use it — Discord says up to a week if you’re in the US, with other countries coming next week. (Two <em>Verge</em> staff members checked their Discord accounts, and the PSN option didn’t show up for them. Perhaps that’s understandable — Sony does have a <a href=\"https://www.theverge.com/22910846/sony-bungie-acquisition-playstation-destiny-halo\">few other things going on</a> right now.)</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9dscLaE8pqtkLdnxPB4O_ixPEQo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23208456/PS_Discord1.jpg\">      <cite>Image: Discord</cite>      <figcaption><em>Discord recommends using the integration to see if your friends are playing a game with cross-platform multiplayer.</em></figcaption>  </figure><div class=\"c-float-right\"><aside id=\"Xg3lyD\"><q>The connection is gradually rolling out</q></aside></div><p id=\"NvilVu\">If you want to link your PSN and Discord accounts, open Discord and then go to User Settings &gt; Connections (on the mobile app, go to your profile, then tap Connections &gt; Add). If the PlayStation logo is among the icons in the “Connect Your Accounts” menu, you can click on it to bring up a PSN login screen. After you enter your credentials, your accounts should be linked. </p><p id=\"kBuBQm\">Connecting to PSN isn’t the only feature Discord has been working on — the company’s also been experimenting with a feature that would let you easily switch between accounts, an ability a lot of users want if <a href=\"https://twitter.com/jaypeters/status/1429875213349507078\">the likes on this request for that feature</a> are anything to go by. The company made it clear in an email to <em>The Verge</em> that account switching (which has been spotted by <a href=\"https://www.reddit.com/r/discordapp/comments/qkvegv/discord_is_adding_an_account_switcher/\">Reddit users</a> and YouTubers alike) is currently only available for a “small percentage” of desktop users. Discord <a href=\"https://support.discord.com/hc/en-us/articles/4412732047127\">even has an FAQ for the feature</a>, which currently says that the experiment is being run for a “limited period of time,” but as someone who frequently has to bounce between accounts, I’d love for it to see the light of day. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ymgH6UENKKTCNk8J_icXq0nZLeE=/1x0:1200x628/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23208094/FKdG7CxUcAE70EH.jpeg",
  "description": "Show friends what you’re playing on PlayStation.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}