{
  "title": "Disconnected: Samsung.com sales reps say the system makes them work for free",
  "url": "https://www.theverge.com/2022/4/14/23001790/samsung-online-sales-labor-customer-service-contractors-ibbu",
  "date": "2022-04-14T10:00:00.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/iJjPm8M-ceWLx0IXjY7cPC0CnKk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70747584/acastro_220405_5124_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>Independent contractors are pushed to handle customer service without compensation</p> <p class=\"p--has-dropcap\" id=\"iYAgXr\">When Samsung announced its new Galaxy S22, the biggest Android smartphone launch of the year, Jennifer Larson was ready to finally make some money. On February 9th, she logged into the Ibbu app, where she sells phones to waiting customers at Samsung.com via online chats. Typically, the yearly Galaxy Unpacked showcase is a huge sales event for Samsung and a potentially big payday for her. “They built it up like it was Christmas, I got all pumped up,” Larson says. </p><p id=\"CHalYY\">But on this product release day, <a href=\"https://www.theverge.com/2022/2/9/22925827/samsung-galaxy-s22-plus-ultra-preorder-site-down\">Samsung’s website was experiencing widespread glitches</a>; customers couldn’t complete orders, and some were getting blank screens. If they could connect to the chats at all, customers were frustrated. Larson gave up after about two hours and called it a day. </p><p id=\"P5szAW\">And really, why would she stay? She thought Unpacked would be a break from the increasingly grim reality of her job, which has been to field a growing number of completely unpaid customer service calls. Instead, it was more of the same — hours of customer complaints she wasn’t going to get paid for handling. </p><p id=\"yzlqqT\">Samsung’s experts are commission-only, with no hourly rate. So if they don’t sell anything, they don’t get paid. Originally, the money was good, but a once-promising work-from-home job has deteriorated into a confusing mess of misdirected customers and inconsistent directions from superiors, Larson and her co-workers say.</p><div class=\"c-float-right\"><aside id=\"CGh09o\"><q>Samsung gets free customer support and an increasingly desperate sales team</q></aside></div><p id=\"CgGN6I\">Meanwhile, Samsung customers looking for support may not be aware that they’ve been routed to someone whose only financial incentive is to sell them a new product. Larson and her colleagues are portrayed as subject matter experts there to help customers — think Apple’s Genius Bar — but the expert’s goal is really to close sales. Even if they want to help, they aren’t trained in customer support.</p><p id=\"NAs4UG\">But a dozen Samsung.com chat agents tell <em>The Verge</em> that they’re expected to do it anyhow. They claim the company’s trying to have it both ways: Samsung gets free customer service and an increasingly desperate sales team. </p><p id=\"3Gx48o\">Larson began working for staffing agency Ibbu in December 2019. At first, she says she was making between $800 and $1,200 a week doing sales chats for products from companies like Otterbox and Life Group. She was able to provide more financial support for her daughter at college and pay for her other kids’ sports and extracurricular activities. The money was consistently good enough that when the pandemic shut everything down, Larson quit her teaching assistant job to work for Ibbu full time. “It really helped support me through COVID,” she says.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9SRpX8GeXaUx2owvRnPalAiR9Bk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387031/unpacked_experts_lament__1_.jpg\">      <figcaption><em>Experts were seeing their customer satisfaction scores drop amid technical issues on Samsung’s website during the Galaxy Unpacked event.</em></figcaption>  </figure></div><p id=\"gXEamf\">But the steady pay evaporated as she began to encounter more and more service requests,  dealing with customers who need help but aren’t looking to buy anything. The automated chat system now regularly sends the experts customer service chats mixed in with the expected sales chats. While Ibbu tells <em>The Verge</em> that its staff are explicitly not supposed to take customer service chats, both Ibbu and Samsung allegedly encourage workers to convert customer service chats into sales. And, if experts don’t keep up their customer satisfaction score by handling those customers, they can be fired.</p><p id=\"PFRNcB\">Experts are expected to have an average customer satisfaction rating (CSAT) of at least 4.3 out of 5. They receive one point for every chat, three points anytime a customer gives them a rating over 4, and six points for every “achievement” a customer rewards them. But if they try to help a customer seeking support and the customer leaves unhappy, they can give the expert a bad rating — so experts can end up with low ratings for doing work they’re not officially supposed to be doing <em>and</em> aren’t being paid for, either.</p><p id=\"nadZLS\">If an expert’s rating drops below 4.3, they receive a warning. Larson says they used to get a 100-chat grace period to turn things around and get their rating back up, but that Ibbu has since cut it down to just 20 chats. If their CSAT doesn’t improve after three warnings, they can be terminated. </p><hr class=\"p-entry-hr\" id=\"XjYiNw\"><p class=\"p--has-dropcap\" id=\"vqgOOv\">Even when Larson’s colleagues want to help customers, they often can’t. </p><p id=\"x6pANy\">Otterbox never told Larson how to sell phone cases, with most communication coming from Ibbu representatives. It was different when she started working with Samsung products. Executives from Samsung would join them on training calls, and Larson felt like she was part of the company. “It was like ‘Oh, they want us to succeed, they’re training us,’” she said.</p><p id=\"2imlCU\">Over the past few months, though, that began to change; even when seeking answers to problems like website glitches or customer questions, Larson says “it’s like pulling teeth to get replies.” And the site is riddled with problems, she adds. One example: a bug that caused an item’s price to change when a customer put it into their shopping cart.</p><p id=\"44afAk\">“We’re supposed to deal with those problems, but we don’t have access to anything,” Larson says. “We’re like the first line of defense for customers, but they don’t train us how to deal with them or how to answer their questions. Why should I waste the customer’s time?”</p><p id=\"R6DMCP\">In the official training documents that experts receive — with both Samsung and Ibbu logos emblazoned at the top of each page — a section header specifically reads “do not answer customer service questions” and provides directions for how to handle such situations.</p><p id=\"xHLBlV\">“The ibbu chat is exclusively for online shoppers interested in BUYING something. If someone chats with you about anything else, such as product support, order support, warranty, etc., you should NOT try to respond.” </p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CGz9zWDy08iKmuLj5zhLDopl5_4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383024/ibbu_samsung.png\">      <figcaption><em>A screenshot of a Samsung Ibbu training document.</em></figcaption>  </figure></div><p id=\"KKg3eu\">Instead, the expert should direct the customer to the support link and close the chat, the instruction document reads. The document tells the experts to refer to themselves as “just a Samsung community member.” </p><p id=\"obWQn0\">But during a March 31st video call with experts, a recording of which was shared with <em>The Verge</em>, a Samsung employee described the chat platform the experts use as a “hybrid” for both customer service and sales and encouraged them to keep handling support chats even though they may not have the training.</p><p id=\"Lu8iwX\">When one expert said he wasn’t sure they should be doing customer service chats, pointing out that those chats didn’t really help with their conversion rate, she doubled down. “I want to encourage you to continue to do that.” She said providing excellent customer service would help with customer retention, which would help with the experts’ CSAT scores.</p><p id=\"javD9l\">Samsung e-commerce and e-promoters sales manager Scott Walker said on the March 31st call that the sales experts should think of their customer service work as a team effort. “You kind of have to focus on the whole team intermeshed with our brand,” Walker said. If experts “make the customer really feel good about the information that you’re telling them, they’re going to come back. You may not get that sale, but somebody else will.”</p><p id=\"a6wsxP\">While experts are supposed to get credit for a sale if a customer buys within two weeks of a chat, at least five experts told <em>The Verge</em> they aren’t always seeing that in practice.</p><p id=\"cwkxXc\">Samsung refused to comment for this story after repeated requests, directing us to Ibbu. In an email to <em>The Verge, </em>Ibbu says<em> </em>that misdirected chats represent only a small percentage of customers that the sales experts handle.</p><p id=\"tyOfZT\">The staffing agency explains: </p><blockquote><p id=\"uNN7oX\"><em>Visitor requests are pre-qualified through a chatbot that filters out and forwards purchases requests to experts while excluding Customer Service requests. However, a very limited number of visitors may still occasionally bypass our automated chatbot filters and make customer service-related inquiries. Yet these requests amount to hardly 2.5% of all conversations answered by ibbü experts.</em></p></blockquote><p id=\"9iRdqP\">But Larson and other experts said that the 2.5 percent figure was definitely lower than what they were seeing. Based on her own research, Larson estimates it’s closer to 25 percent. And several experts told <em>The Verge</em> that, in recent months, they can go an entire shift — several hours long — where they receive nothing but customer service chats.  </p><p id=\"V3oOEN\">In its email to <em>The Verge</em>, Ibbu also writes that “independent experts have full control of their schedule, work whenever they want, wherever they are, are not exclusive to any mission, do not report to anyone, and may stop using ibbü at any time.” In other words, they’re independent contractors — not employees. It’s a favorable situation for Samsung.</p><p id=\"dkAmcg\">But the experts say they’ve received direct instructions for doing their jobs from both Samsung and its staffing agency. One expert, who asked <em>The Verge</em> not to use his name for fear of retaliation, recalled being “mystery-shopped” by a Samsung executive “who is like the vice president of customer service for Samsung,” he said. After going through the shopping process, she scolded him for not using a particular tool. “She’s like ‘You can make so many more sales if you use this.’”</p><div class=\"c-float-right\"><aside id=\"fctAv9\"><q>Experts say they can’t make sales in customer service chats</q></aside></div><p id=\"okmOwL\">In general, experts we spoke to echoed Larson’s sentiment that the work used to be lucrative but isn’t what it used to be. One said he used to make between $800 and $1,300 a week when COVID restrictions first began and everyone was working from home. On the Monday after Samsung’s big February event, which he expected to be a productive day, he made only three sales after chatting with almost four dozen customers. </p><p id=\"YQJ6wb\">Another expert says he enjoys helping customers with Samsung appliance sales and doesn’t depend on the money he makes. But he agreed that things have gotten grim over the past several months and dismisses the idea that sales experts will be able to make significant money handling customer service chats. A customer who wants to cancel an order or find out when a washing machine will arrive isn’t really looking to buy anything, and he doesn’t have access to the information that might help those customers anyway. “But the Ibbu people still have an expectation that I can make a sale off that chat,” the expert says.</p><p id=\"UdGvjF\">A third expert tells us he proactively asked if the company would be more lenient when assessing the experts’ ratings during the Unpacked day glitches, and he said an Ibbu representative assured them that experts wouldn’t be penalized for the site problems.</p><p id=\"9ECA6O\">But, on Friday of that week, he received a warning that his CSAT had dropped to 4.1. And he wasn’t the only one to report a negative impact from Samsung’s Galaxy S22 launch day issues on their customer satisfaction scores.</p><hr class=\"p-entry-hr\" id=\"BcAUGB\"><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eD1ml1-j58v1SCG3wSHp81pgBag=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23386692/ibbu_warning_after_unpacked.jpg\">      <figcaption><em>An Ibbu expert received a warning even after he says he was told the company would be “lenient” because Samsung suffered an outage during Galaxy Unpacked.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"eR2KI8\">Ibbu bills itself as “an on-demand community of experts, curated specifically for your brand by iAdvize,” the parent company for Ibbu and its experts. It portrays them as brand ambassadors who can earn money on the side for their knowledge, and its website details how they’re compensated. Companies that enlist its services can optionally choose to pay workers for every chat instead of just on commission. The website explains: “Experts are paid according to different plans depending on your objectives: either per conversation or per transaction after a conversation. Whichever plan you choose, the experts are incentivized to offer the best quality of service.” </p><p id=\"J9iNtL\">But, like the other companies Ibbu contracts with, experts who sell Samsung products are paid commission only. And Larson notes that the 1.5 percent commission experts get from Samsung sales is significantly lower than the 8 percent she made from other Ibbu clients. So experts have to sell a lot of high-priced Samsung devices and appliances to earn a decent paycheck.</p><p id=\"WbxRik\">Samsung seems to have profited from the arrangement. It contracted with Ibbu parent company iAdvize in 2019. An undated case study <a href=\"https://blog.iadvize.com/en/samsung-conversational-strategy\">interview on iAdvize’s blog with Ed Billmaier</a>, director of e-commerce customer service at Samsung Electronics America, claims that since partnering with iAdvize, Samsung grew its e-commerce sales by 10x “while fulfilling its objective of giving US customers the information they need, when they need it and how they want it, when considering a purchase on Samsung’s website.”</p><p id=\"TeT15S\">Samsung declined to answer questions about its use of Ibbu experts, including why Samsung uses contractor sales experts untrained in customer service to handle customer questions. The company instead directed questions to Ibbu.</p><p id=\"HKHod8\">If the system isn’t sending them enough money-making chats and the internal communication is so confused, why continue on as an expert? Larson says she takes frequent week-long breaks and is considering leaving altogether. Another expert tells us that people stay because they remember how lucrative the chats used to be. (He remembers product launches where he earned $1,000 in one night.)</p><p class=\"c-end-para\" id=\"zTkIzO\">“You could do really well on a big sale or a product launch,” another expert added. “I don’t know how people that did this full-time stay, though. It seems like it’s not set up for people to last.”</p><p id=\"MU2OCH\"></p><p id=\"nQYgPS\"></p><p id=\"pdkaZ2\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/l-lhmg4r9xBZDMaFLHQwfqMqX0w=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387580/acastro_220405_5124_0002.jpg",
  "description": "If they don’t make sales, they don’t get paid.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}