{
  "title": "Disenchantment’s first season 4 trailer is dark and full of hellish terrors",
  "url": "https://www.theverge.com/2022/1/31/22911066/disenchantment-season-4-trailer",
  "date": "2022-01-31T21:24:10.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Bean surrounded by a number of shadowy creatures in the woods.\" src=\"https://cdn.vox-cdn.com/thumbor/Qg69eDJvMWZ0ypEJzMNbjh11_UA=/100x0:6700x4400/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70455084/EP_218_Bean_Cave_Of_Eyes_COLOR_400_RGB.0.jpeg\" />        <figcaption>Netflix</figcaption>    </figure>  <p id=\"5BSb81\">By the end of <a href=\"https://www.theverge.com/2018/8/7/17661852/disenchantment-review-netflix-bojack-horseman-big-mouth-animated-originals-comparison\"><em>Disenchantment</em></a>’s third season, Bean, Elfo, and Luci were all down for the count and left in places that made it seem like they might have been ready to call it quits on their <a href=\"https://www.theverge.com/2019/5/16/18627805/netflix-matt-groening-disenchantment-season-2-fantasy-series-return-september-20th\">journeys through Dreamland</a>. The gang’s all back in the first trailer for <em>Disenchantment</em>’s fourth “part” (read: season), though, and while things have certainly gotten bad, the story’s not over yet.</p><p id=\"WDWXJx\"><em>Disenchantment</em>’s third season closed out on Bean (Abbi Jacobson), Luci (Eric André), and Elfo (Nat Faxon) being split up as the kingdom was coming under siege by ogres, and Bean’s mother Dagmar (Sharon Horgan) reappeared to spirit her daughter away to the underworld. Though Bean struggled with becoming Dreamland’s newly crowned queen when last we saw her, <em>Disenchantment</em>’s season 4 trailer emphasizes how her trip to hell leaves her that much more committed to becoming a better leader and more accomplished magic user. </p><p id=\"vr25gE\">Slight as the new trailer is on concrete plot details, it more than makes it seem like <em>Disenchantment</em>’s going to lean even more heavily into the serious tone it began to take in season 3, and its protagonists were all pushed to grow up in different ways. Pivoting into self-seriousness can be a risky move for animated comedies built on poking fun at other series like it who’ve pulled similar stunts, but <em>Disenchantment </em>might be able to pull it off — especially if the show comes out swinging with some excellent, ambitious jokes to match.</p><p id=\"VBcyAR\"><em>Disenchantment</em>’s fourth chapter hits Netflix on February 9.</p><p id=\"C6ivo6\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7XvFiTTDW7AZcmGCY_Iz04hvAuk=/0x420:6800x3980/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23208068/EP_218_Bean_Cave_Of_Eyes_COLOR_400_RGB.jpeg",
  "description": "Disenchantment’s first season 4 trailer unleashes war on the kingdom of Dreamland.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}