{
  "title": "Dish’s upcoming wireless plan might let you buy an iPhone with crypto",
  "url": "https://www.theverge.com/2022/5/10/23066066/dish-network-boost-infinite-project-genesis-5g",
  "date": "2022-05-11T00:43:49.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3seenZeuNjab6-OjEfUuF6Q7uAI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70854742/acastro_200804_1777_dish_0001.0.0.jpg\" />        <figcaption><em>Dish is teasing a new wireless plan called Boost Infinite to launch this fall.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"cJZ19h\">Dish Network seems to be taking <a href=\"https://www.theverge.com/2022/5/4/23057401/dish-network-5g-las-vegas-oran-project-genesis-nft\">its unconventional approach to building a wireless network</a> all the way to the blockchain. Executives hosting an analyst event in Las Vegas today gave a few hints at their vision of this country’s fourth wireless carrier, and it might involve a future where you can pay for a new iPhone in Bitcoin. </p><p id=\"l4xR4z\">Stephen Stokols, CEO of Dish-owned Boost Mobile, showed off branding for a new postpaid wireless plan coming this fall called “Boost Infinite,” and, well, here’s what he said:</p><blockquote><p id=\"mIytnV\">Imagine if there was a wireless carrier that embraced digital acceleration, the web 3.0 trends, to reshape the entire wireless experience. Or imagine if you could turn your unused data into a real digital currency. </p></blockquote><p id=\"W0VgHB\">Digital currency doesn’t necessarily imply crypto, but Stokols continues: “Imagine if you could leverage decentralized financing to get the latest iconic devices. Imagine if there was a wireless carrier that actually paid you back.” </p><p id=\"OGCLpd\">First of all, what? Second of all, “leveraging decentralized financing” reads an awful lot like “paying for something with cryptocurrency,” and we have to assume that iPhones fall under the category of “the latest iconic devices.” If you need that all spelled out, this slide from the presentation literally does just that.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rgwHEHm-4mOET1RwFyWG53KEGpk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23452044/dish.jpg\">      <figcaption><em>Imagine.</em></figcaption>  </figure><p id=\"5WfjgO\">Maybe in addition to <em>paying</em> for your next phone with crypto, you’ll be able to trade in your unused anytime minutes for NFTs? Doge for your data? Apes for apps? The possibilities boggle the mind. Dish is already in the NFT game with Project Genesis, the pilot program for its 5G network buildout — <a href=\"https://www.theverge.com/2022/5/4/23057401/dish-network-5g-las-vegas-oran-project-genesis-nft\">early testers on the network are rewarded with NFTs</a>, among other things.</p><div class=\"c-float-right\"><aside id=\"9UmiGz\"><q>Doge for your data? Apes for apps? The possibilities boggle the mind</q></aside></div><p id=\"Q44dp0\">Stokols seemed to hint that Dish intends to take on the big three wireless carriers under this “Boost Infinite” branding, saying that the company intends to “take Boost from the prepaid market to the mass market.” For the moment at least, the network exists in its very early state under the Project Genesis branding, and Dish president John Swieringa says that the program will be expanding to its initial launch markets “in the coming weeks.” And it needs to — the company’s FCC deadline to cover 20 percent of the population is <a href=\"https://www.theverge.com/2022/2/24/22949389/dish-network-5g-las-vegas\">just a few weeks away</a>.</p><p id=\"APuQbh\"></p><p id=\"4hUgUn\"></p><p id=\"BHQdto\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ViVQuBhEU09OnEsL4tpNLy5D4zc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21696755/acastro_200804_1777_dish_0001.0.jpg",
  "description": "And maybe get doge for your unused data?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}