{
  "title": "Dish says its 5G buildout is going great, thanks for asking, how are you?",
  "url": "https://www.theverge.com/2022/2/24/22949389/dish-network-5g-las-vegas",
  "date": "2022-02-24T20:43:50.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/b34yvzrB4ATLey7Z_GyickCfydU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70546317/acastro_200804_1777_dish_0001.0.0.jpg\" />        <figcaption><em>Dish Network promised regulators it would build a 5G network and become the US’ fourth wireless carrier.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"kHCb9Q\">Remember when you were signing up for a new phone plan and you considered options from four major wireless carriers? You don’t — at least, not if you were shopping around in the last couple of years. In the US, we only have three major carriers while Dish Network is in the process of building what is <a href=\"https://www.theverge.com/2019/7/26/8931827/dish-carrier-plans-5g-network-tmobile-sprint-us-confirms\">supposed to be our fourth option</a>. That’s the agreement that was reached in the wake of the T-Mobile / Sprint merger, and the company is running up against a Federal Communications Commission-imposed requirement to cover 20 percent of the population by June 2022. So how’s that going? Just fine, according to Dish, even though its <a href=\"https://edge.media-server.com/mmc/p/w2vfpfbj\">2021 Q4 earnings call today</a> didn’t paint the rosiest picture of its current state.</p><p id=\"yXzyVZ\">Chairman Charlie Ergen spoke with his typical candor about a recent visit to Las Vegas, where Dish has been testing its new 5G network among “family and friends” since November. Ergen remarked that “when it works, it works pretty well,” and he went on to clarify that the company is still optimizing the network — the parts that work well are the optimized bits, and issues remain where it hasn’t been optimized. </p><div class=\"c-float-right\"><aside id=\"D7nIuG\"><q>Dish says it will expand access to the Las Vegas network “in the coming weeks”</q></aside></div><p id=\"tH5axv\">Ergen stressed that core technology hurdles have been overcome in the building of the cloud-based O-RAN network, and he called it one of the company’s greatest achievements. He also acknowledged that the buildout is behind schedule, citing some unexpected technical issues that the company didn’t anticipate having to solve, and added that the challenge in front of the company is substantial. “We have a lot of work to do to make [the network] work everywhere.”</p><p id=\"OKSZgY\">Still, the company stands by its commitment to the June deadline and says that it will expand access to the Vegas network “in the coming weeks.” After that, 25 major metro markets will be part of the broader deployment, working toward the ultimate goal of covering 70 percent of the US population by 2023. With the shaky statements given today and <a href=\"https://www.sdxcentral.com/articles/news/dish-missed-every-5g-commitment-it-made-in-2021/2021/12/\">its poor track record in 2021</a>, it’s fair to say there’s some shadow of doubt cast over Dish’s ability to hit that deadline. Ergen summed up the challenge — and his optimistic attitude toward it — thusly: “The good news is we’re going to get there. The bad news is we’re not there yet.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ViVQuBhEU09OnEsL4tpNLy5D4zc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21696755/acastro_200804_1777_dish_0001.0.jpg",
  "description": "It has a lot of work to do to meet FCC requirements.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}