{
  "title": "Dish’s 5G network is finally live in Vegas — and it has NFTs",
  "url": "https://www.theverge.com/2022/5/4/23057401/dish-network-5g-las-vegas-oran-project-genesis-nft",
  "date": "2022-05-04T21:23:18.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u3GxYnrdu2kX-b44oNDSvVrYPTI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70833110/acastro_200804_1777_dish_0001.0.0.jpg\" />        <figcaption><em>Project Gene5is lives.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"cO4R8I\">Dish Network has taken a big step forward on its journey to becoming the country’s fourth wireless carrier — one that it should have taken, oh, <a href=\"https://www.theverge.com/2021/8/9/22617029/dish-network-5g-las-vegas-wireless-service-beta\">let’s say many months ago</a>. As <a href=\"https://www.axios.com/2022/05/04/dish-network-5g-las-vegas\">reported by <em>Axios</em></a>, its <a href=\"https://www.theverge.com/2021/6/15/22535566/dish-network-5g-availability-project-genesis\">5G network, aka Project Genesis</a>, has finally launched to paying customers in Las Vegas, graduating from the beta program that began late last year. For $30 per month it includes unlimited 5G data, talk, text, and, uh, this: “Additionally, we include a white-glove delivery experience and exclusive access to the Project Genesis app where you can earn rewards.” Rewards including... <a href=\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\">NFTs</a>.</p><p id=\"RwqFwY\">As <a href=\"https://www.theverge.com/2019/7/24/20708411/dish-tmobile-sprint-carrer-merger-assets-spectrum-boost\">part of T-Mobile’s deal to buy Sprint</a>, Dish Network has been tasked by the FCC with taking Sprint’s place as our fourth carrier. It’s taking an unconventional route to get there, building its 5G network using O-RAN technology, which is open-source and relies on more off-the-shelf hardware rather than a lot of proprietary components. <a href=\"https://www.theverge.com/2022/5/3/23054285/samsung-vran-dish-network-5g-oran\">Samsung is in the mix</a>, too, supplying software and radios.</p><div class=\"c-float-right\"><aside id=\"eOPBOc\"><q>This unconventional network has a few unconventional terms</q></aside></div><p id=\"QgUkc4\">So it’s not too surprising that this unconventional network has a few unconventional terms. For example, you can’t bring your own device right now. You’ll need a Project Genesis-issued... wait for it... <a href=\"https://www.theverge.com/22992862/motorola-edge-plus-2022-review-price-specs-screen-battery\">Motorola Edge Plus (2022)</a>. That’s the only supported phone, and it’s delivered to you by a “Project Genesis ambassador” which appears to be <a href=\"https://twitter.com/Genesis5G/status/1512460263039062024?s=20&amp;t=w5QNA0QrA5DMZN4VpNWVLg\">a guy in a van wrapped with Project Genesis branding.</a></p><div id=\"NITS36\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Get ready to experience a new kind of 5G! Our team in Las Vegas is hand-delivering the first <a href=\"https://twitter.com/hashtag/ProjectGenesis?src=hash&amp;ref_src=twsrc%5Etfw\">#ProjectGenesis</a> devices to our beta members. Be one of the first to get connected: <a href=\"https://t.co/ykNQWR8cxh\">https://t.co/ykNQWR8cxh</a> <a href=\"https://t.co/BuGIsojKDH\">pic.twitter.com/BuGIsojKDH</a></p>— Project Genesis (@Genesis5G) <a href=\"https://twitter.com/Genesis5G/status/1512460263039062024?ref_src=twsrc%5Etfw\">April 8, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"u125O7\">Customers can access support through a Project Genesis app, which doubles as a gamified way to help fine tune the network. You’ll get points for your participation and, potentially, NFTs. Seriously, there’s a whole section in <a href=\"https://www.genesis5g.com/support/legal/terms-conditions\">the terms and conditions page</a> about an “Engagement App” that offers “exclusive offers and loyalty rewards” including the non-fungible tokens — and while a customer support representative tells us those <em>might</em> only be for beta testers, a <a href=\"https://www.genesis5g.com/support\">Project Genesis FAQ</a> suggests that treating the network like a game is part of the appeal:</p><blockquote><p id=\"unKT28\">The more points you earn, the more you get - from rewards like exclusive NFTs to special gear and more.</p></blockquote><p id=\"kuX5Jl\">“Project Genesis makes no representations or warranties as to quality, merchantability or value of such NFTs,” the company writes. Just so you know.</p><p id=\"HGdWNK\">Also, a lengthy bit of that terms and conditions page indicates that 911 dispatchers may not be able to see your phone number or location, and you can’t hold Dish Network responsible for anything bad that happens to you as a result. It’s also in all caps, so you know they mean business.</p><blockquote><p id=\"nHpIaR\">YOU ACKNOWLEDGE AND AGREE THAT ANY INJURY ARISING OUT OF MISROUTED 911 CALLS, REGARDLESS OF WHETHER OR NOT THE CALL WAS ROUTED BY A PUBLIC SAFETY ANSWERING POINT OR AN OFFICIAL EMERGENCY OPERATOR, IS NOT THE FAULT NOR LIABILITY OF PROJECT GENESIS AND YOU HOLD PROJECT GENESIS HARMLESS FROM ANY DAMAGES OR LIABILITIES.</p></blockquote><p id=\"cxq7QR\">The company’s documentation is also chock full of trademarks to help you understand how innovative Dish thinks its network will be. Taking a quick peek at the US Patent and Trademark Office, we can see that Dish has applied for:</p><blockquote><p id=\"1Yq3Lb\">Smart 5G</p><p id=\"1wRBmj\">Smart 5G Network</p><p id=\"LMQGnW\">Smart 5G Wireless Network</p><p id=\"XwkmRo\">Smart Wireless Network</p><p id=\"FtPlfl\">The American Smart Network</p><p id=\"injKPw\">The First American Smart Network</p><p id=\"HdOdEj\">America’s First Smart Network</p></blockquote><p id=\"ldoqeB\">Dish is hurtling toward an FCC deadline to cover 20 percent of the population with its service by June, and to that end, has <a href=\"https://launch.genesis5g.com/cities/\">released a list of over 100 cities</a> that it plans to expand to next. If your area is on the list, <a href=\"https://www.genesis5g.com/members\">you can sign up</a> to potentially become a beta tester before the service goes public. Who knows? Maybe by then you’ll have more device options than the Edge Plus.</p><p id=\"foyB4D\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ViVQuBhEU09OnEsL4tpNLy5D4zc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21696755/acastro_200804_1777_dish_0001.0.jpg",
  "description": "Early adopters, take note.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}