{
  "title": "Disney Plus is getting the Marvel Netflix shows on March 16th",
  "url": "https://www.theverge.com/2022/3/1/22955274/netflix-marvel-shows-disney-plus-release-date",
  "date": "2022-03-01T16:00:01.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XNGHXVTLjJ5vfsWhPEajkOE7Ymo=/84x0:1473x926/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70565116/DEFENDERS_Vertical_Aftermath_PRE_UK.0.jpeg\" />    </figure>  <p id=\"xsh0nM\">Just days after <a href=\"https://www.theverge.com/2022/2/23/22948263/netflix-marvel-disney-plus-canada\">Disney quietly confirmed</a> that all of <a href=\"https://www.theverge.com/2022/2/11/22929364/netflix-disney-daredevil-iron-fist-luke-cage-jessica-jones-punisher-marvel\">Netflix’s Marvel shows</a> are set to migrate over to Disney Plus for Canadian audiences this March, we now know when all six of the series will make a similar jump to Disney’s own streaming service in the US as well.</p><p id=\"iXalKb\">Today, Disney announced that in mid-March, <a href=\"https://www.theverge.com/2015/4/8/8371229/marvel-daredevil-netflix-review\"><em>Daredevil</em></a>, <a href=\"https://www.theverge.com/2015/11/19/9760514/jessica-jones-review-marvel-netflix-krysten-ritter\"><em>Jessica Jones</em></a>, <a href=\"https://www.theverge.com/2016/9/29/13111394/luke-cage-review-black-power-marvel-netflix\"><em>Luke Cage</em></a>, <a href=\"https://www.theverge.com/2017/3/8/14848336/iron-fist-review-netflix-show-marvel\"><em>Iron Fist</em></a>, <a href=\"https://www.theverge.com/2017/8/16/16146240/the-defenders-marvel-netflix-show-review\"><em>The Defenders</em></a>, <a href=\"https://www.theverge.com/2017/11/17/16670940/punisher-review-netflix-marvel-jon-bernthal-gun-violence\"><em>The Punisher</em></a>, and ABC’s <a href=\"https://www.theverge.com/2013/5/13/4326092/marvel-agents-of-shield-first-teaser-trailer-abc-coulson\"><em>Agents of SHIELD</em></a><em> </em>will begin streaming on Disney Plus alongside all of Marvel’s other superhero programming, a sign that <em>may </em>point to those characters’ futures in the MCU. In a press release shared this morning, Disney’s president of streaming, Michael Paull, framed the impending IP homecoming as a further unification of Marvel’s brand and as a sort of evolution for Disney Plus as a platform.</p><p id=\"uDWrsV\">“As we continue to build greater value for consumers seeking high-quality movies and series, we are at the same time being responsive to those changes on the platform,” Paull said. “We have experienced great success with this on Disney Plus across our global markets and will continue that here in the US as well by offering our consumers not only great content, but also a set of features that help ensure a viewing experience most suitable for them and their family.” </p><p id=\"bzAwfk\">Disney Plus’ content has generally skewed much more towards younger audiences in the US compared to other countries like Canada, where the platform includes the more adult-oriented Star content hub. Because of this, Disney is also preparing to debut a new set of parental controls, including profile-specific ratings restrictions, PIN locks for individual user profiles, and “Kid-Proof Exit” questions meant to prevent children from messing with settings put in place by adults. </p><p id=\"nqtidx\">Considering how much more graphic the former Netflix shows tend to be compared to their Marvel-produced cousins, it makes sense that Disney would take these sorts of steps. It’s interesting, though, that the studio’s opted for the Disney Plus route rather than moving the <em>Defenders</em> and co. over to Hulu, where R-rated movies and TV-MA shows featuring Marvel characters like <em>Deadpool</em> and <em>MODOK </em>currently live.</p><p id=\"4EJvll\"><em>Daredevil</em>, <em>Jessica Jones</em>, <em>Luke Cage</em>, <em>Iron Fist</em>, <em>The Defenders</em>, <em>The Punisher</em>, <em>Agents of SHIELD</em>, and all of the new parental control features are set to hit Disney Plus on March 16th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qDVOosAgcgOHzDZk_-bIgrWWByk=/0x0:1499x785/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23278084/DEFENDERS_Vertical_Aftermath_PRE_UK.jpeg",
  "description": "All of Marvel’s Netflix-produced shows are coming home to Disney Plus.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}