{
  "title": "Disney’s queer content won’t save it from being on the wrong side of history",
  "url": "https://www.theverge.com/2022/3/10/22967765/disney-dont-say-gay-bill-chapek-florida-hrc",
  "date": "2022-03-10T15:30:31.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Inside The D23 Expo Media Preview\" src=\"https://cdn.vox-cdn.com/thumbor/YCcjaAZYE8LwVwfk--mnnd_Jdus=/481x493:3742x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70603945/1163274253.0.jpg\" />    </figure>  <p>Florida’s “Don’t Say Gay” bill has passed in the Senate</p> <p class=\"p--has-dropcap\" id=\"4YSqBU\">One of the ironic things about The Walt Disney Company contributing just under $200,000 to the Florida Republicans behind <a href=\"https://www.myfloridahouse.gov/Sections/Documents/loaddoc.aspx?FileName=_h1557e1.docx&amp;DocumentType=Bill&amp;BillNumber=1557&amp;Session=2022\">HB 1557</a> — better known as the “Don’t Say Gay” bill — is the very real possibility that same bill could soon make it all but illegal for teachers to talk to their students about any of Disney’s handful of movies and shows that happen to feature queer characters. </p><p id=\"8LPu08\">Whether Disney CEO Bob Chapek had considered this before <a href=\"https://www.theverge.com/2022/3/9/22969458/disney-dont-say-gay-bill-florida-bob-chapek-ron-desantis\">multiple shareholders pressed him about this bill this week</a> during Disney’s annual investors call isn’t clear. But what has become increasingly apparent since the bill <a href=\"https://apnews.com/article/joe-biden-business-florida-gender-identity-a1daa8be12fb9ef863994240634d2782\">passed in Florida’s House of Representatives</a> last month, and <a href=\"https://apnews.com/article/dont-say-gay-bill-passes-florida-legislature-b173917e985833963e45a8d0464a4399\">in the state’s Senate</a> this past Tuesday, is that Disney was not expecting so much of the public to take note of its actions or for its own employees to tell the company directly how it’s hurting them.</p><p id=\"OFdFrS\">If signed into law by Florida Governor Ron DeSantis, the law will lay out a new set of educational standards limiting the way that teachers can acknowledge and address the existence of queer people with their students. Initially sponsored by Florida state Representative Joe Harding and state Senator Dennis Baxley, the bill bars educators from teaching about “sexual orientation or gender identity” in public school classes from kindergarten to third grade. The bill also requires that any curriculum touching on these topics with older students be deemed “age appropriate or developmentally appropriate,” and parents displeased with any perceived violations would be empowered to sue their school districts for damages.</p>  <figure class=\"e-image\">        <img alt=\"Floridians Protest Passage Of Controversial Parental Rights In Education Bill\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bwTjOQQKXJFS0og_xuVYMdF99nE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23303571/1383522747.jpg\">      <cite>Photo by Joe Raedle/Getty Images</cite>      <figcaption>Protestors demonstrating outside thew offices of Florida state Senator Ileana Garcia, who voted in favor of the “Don’t Say Gay” bill.</figcaption>  </figure><p id=\"Ocm9qa\">As <a href=\"https://www.miamiherald.com/news/local/education/article259182023.html\"><em>The Miami Herald</em></a> has pointed out, sexual orientation and gender identity are not subjects currently being taught to Florida’s primary schoolers, and the vagueness of “age appropriate or developmentally appropriate” leaves open the possibility for a very narrow set of perspectives creating a chilling effect that discourages teachers from mentioning queerness altogether. What’s obvious is that for all its sponsors’ posturing about wanting to provide children with better education, the “Parental Rights in Education” bill has a sizable amount of potential to do the exact opposite by creating educational environments that are hostile towards queer students.</p><div class=\"c-float-right\"><aside id=\"CzBIMr\"><q>It seems Disney wasn’t expecting so much of the public to notice its political contributions</q></aside></div><p id=\"IlXo4G\">Looking at the basic elements of the “Parental Rights in Education” bill, it’s easy to understand why it’s become known as the “Don’t Say Gay” bill and why Disney came under fire once its financial contributions to the bill’s architects came to light. As <a href=\"https://www.orlandoweekly.com/orlando/lgbt-activists-hold-protest-in-front-of-walt-disney-world-asking-disney-to-speak-out-against-floridas-dont-say-gay-bill/Content?oid=31118409\">protestors organized demonstrations at Disney’s parks</a> last week in response to the bill’s progress, people looked to Bill Chapek, hoping that the company’s steward might be able to account for its political contributions made under his watch. But <a href=\"https://www.hollywoodreporter.com/business/business-news/disney-florida-dont-say-gay-bill-1235103165/\">after initially stonewalling</a> in response to calls for a public statement about the bill, Chapek <a href=\"https://twitter.com/gma/status/1499569682952732672\">made the curious assertion</a> that the most impactful thing Disney as a company could do in this moment would be to continue producing “inspiring content” and to keep supporting organizations “including those representing the LGBTQ+ community.” </p><p id=\"g87uuW\">“<em>​​Encanto, Black Panther, Pose, Reservation Dogs, Coco, Soul, Modern Family, Shang-Chi, Summer of Soul, Love, Victor</em>,” Chapek listed in a very telling fashion. “These and all of our diverse stories are our corporate statements — and they are more powerful than any tweet or lobbying effort.”</p><p id=\"cbmY0d\">Setting aside the weirdness of Chapek lumping all of those movies and shows together under the “diverse” catchall, what was somewhat ridiculous about this sort of statement coming from Disney is the company’s history of patting itself on the back for queer representation that’s fairly described as hollow, thin, and of the lip-service variety. <a href=\"https://www.polygon.com/2017/3/17/14948300/beauty-and-the-beast-gay-character-le-fou\"><em>Beauty and the Beast’</em>s LeFou</a>, the minor gay character director Joe Russo — who is straight — <a href=\"https://gizmodo.com/avengers-endgames-gay-representation-is-bullshit-1834338186\">played in <em>Avengers: Endgame</em></a>, and <a href=\"https://www.hollywoodreporter.com/movies/movie-news/why-star-wars-kiss-is-a-step-back-lgbtq-representation-rise-skywalker-1264180/\">the lesbian couple seen kissing</a> at the end of <a href=\"https://www.theverge.com/2019/12/18/21026630/star-wars-the-rise-of-skywalker-review-jj-abrams-daisy-ridley-adam-driver\"><em>Star Wars: The Rise of Skywalker</em></a><em> </em>are all shining examples of Disney’s shoddily executed depictions of queerness the studio has held up as <a href=\"https://deadline.com/2019/04/avengers-endgame-marvel-first-openly-gay-character-directors-joe-russo-anthony-russo-discuss-1202601583/\">testaments to its progressiveness</a>. While Chapek’s email was referring to the entirety of Disney’s massive IP catalog, it’s no secret that Disney’s core brands and franchises — your big-screen superhero, princess, and space wizard vehicles — haven’t exactly been places where one can easily find queer characters and their stories being placed front and center.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/b89u8tayAUIqPmrc5_q8r5ia52U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23303597/Screen_Shot_2022_03_10_at_9.46.23_AM.png\">      <cite>Disney</cite>      <figcaption>Amity Blight and Luz Noceda casting a spell together in Disney’s Owl House.</figcaption>  </figure><p id=\"z1pbTo\">To its credit, Disney has made incremental progress over the years with a number of projects, like <em>Gravity Falls</em>, <em>Star Vs. The Forces of Evil</em>, and most recently, <em>The Owl House,</em> that have spotlighted queer characters to varying degrees. On Monday,<em> </em><a href=\"https://twitter.com/DanaTerrace/status/1500914620449447938?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1500914620449447938%7Ctwgr%5E%7Ctwcon%5Es1_c10&amp;ref_url=https%3A%2F%2Fwww.polygon.com%2F22965995%2Fowl-house-dana-terrace-disney-dont-say-gay-disney-bob-chapek\"><em>The Owl House</em> creator Dana Terrace posted a video</a> to her Twitter page expressing her concerns over how the “Don’t Say Gay” bill will harm children and stating that she’s “<a href=\"https://twitter.com/DanaTerrace/status/1500914620449447938?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1500914620449447938%7Ctwgr%5E%7Ctwcon%5Es1_c10&amp;ref_url=https%3A%2F%2Fwww.polygon.com%2F22965995%2Fowl-house-dana-terrace-disney-dont-say-gay-disney-bob-chapek\">fucking tired of making Disney look good</a>” with her series and its focus on an explicitly queer protagonist. </p><p id=\"YmFOmk\">One of the more notable things about <em>Owl House</em>, a series about a young girl named Luz studying to become a powerful witch, is how matter-of-fact the show has been about her evolving relationship with her rival-turned-girlfriend, Amity Blight. By the 16th episode of <em>Owl House</em>’s first season, fans had already begun to deduce from context clues that there was more to Luz and Amity’s friendship than met the eye, but the series took extra and important steps of acknowledging the girls’ romantic feelings for one another and casually framing them as important elements of their identities. </p><div class=\"c-float-left\"><aside id=\"fWw1JS\"><q>Owl House is notable for taking the important step of acknowleding its heroine’s queerness</q></aside></div><p id=\"nvcRAj\">It would be great if more of the creative teams behind Disney’s projects had the freedom and felt comfortable celebrating queerness the way <em>The Owl House </em>does. But the reality is that the bulk of the company’s attempts at queer representation are things one has to pay very close attention to pick up on, in part because of how often the studio reportedly demands that queer content be cut from drafts during the production process. In a statement obtained by <a href=\"https://variety.com/2022/film/news/disney-pixar-same-sex-affection-censorship-dont-say-gay-bill-1235200582/#recipient_hashed=6a86903b61787f5b87907fe99ff5cd3cae9fec018afc8646913ce14ae16db6f8\"><em>Variety</em></a>, “the LGBTQIA+ employees of Pixar and their allies” claim that the studio has consistently called for cuts and heavy editing to scenes featuring overt shows of affection between gay couples, regardless of how much push back from creative teams the calls are met with.</p><p id=\"hchrZr\">“We at Pixar have personally witnessed beautiful stories, full of diverse characters, come back from Disney corporate reviews shaved down to crumbs of what they once were,” the employees alleged. “Even if creating LGBTQIA+ content was the answer to fixing the discriminatory legislation in the world, we are being barred from creating it.”</p><p id=\"nZUJHO\">Receiving notes back from leadership is a normal part of the animation process. But moves like this that lead to a diminishing of queer visibility in media weakens that same media’s ability to have a positive impact on audiences. In the context of the “Don’t Say Gay” bill, that weakening takes on a new dimension because of how the legislation would largely bar teachers from at all helping their younger students understand the messages these kinds of shows and movies are trying to share.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vWfIKQLJtM1vhRoPt5_uKmOV-sA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23303633/Screen_Shot_2022_03_10_at_10.15.35_AM.png\">      <cite>Disney/Pixar</cite>      <figcaption>Greg and Manuel, two characters from Disney and Pixar’s short film, Out.</figcaption>  </figure><p id=\"0fy0he\">While the concept of Disney’s “exclusively gay moments” has become something of a joke, one could make the argument that each of them has had some innate value simply by being instances of one of the most powerful media organizations in the world affirming queer people’s existences. What’s infinitely less funny, but just as important to be mindful of in this situation, is how much of the conversation around the bill has glossed over these pitfalls and involved the stoking up of old homophobic panics about queer people <a href=\"https://theweek.com/ron-desantis/1011011/anyone-who-opposes-floridas-dont-say-gay-bill-is-probably-a-groomer-desantis\">indoctrinating or grooming children</a>. </p><p id=\"NJ8Oh8\">It’s telling that DeSantis, who has strongly signaled that he intends to sign the bill into law, has responded to criticisms of it by <a href=\"https://abc7amarillo.com/news/nation-world/in-heated-exchange-over-sex-ed-bill-desantis-says-reporter-is-pushing-false-narratives-dont-say-gay-florida-ron-republican-press-hb1557\">focusing on the pejorative name</a> its opponents have dubbed it with. The point of identifying the “Parental Rights in Education” bill as the “Don’t Say Gay” bill is to draw attention to the legitimate fears that queer people and their allies feel as they consider some of the bill’s potential real-world outcomes — outcomes Disney’s workers have tried to talk to leadership about out of a desire to prevent them from happening.</p><p id=\"N7vgrA\">Chapek wasn’t wrong in his email when he reasoned that Disney coming out expressly in favor or against the “Don’t Say Gay” bill would invite people on both sides of the debate to continue using the company as a “political football.” The operative word here, however, is “continue,” as Disney has featured in these sorts of cultural debates for years and has an established history of making political contributions to both Republicans and Democrats. </p><div><aside id=\"3Fm3h3\"><q>Much of the conversation around the bill has stoked up of homophobic panics about queer people grooming children</q></aside></div><p id=\"cw6fOZ\">What makes Disney’s involvement in <em>this</em> bill’s genesis notable is that it comes at a time when the company can’t easily distance itself from the overall messiness of the situation or obfuscate the fact that it’s only now responding defensively to criticism after the fact. From Chapek’s email to Disney’s employees and his call with investors this week, one can infer that at least some of Disney’s leadership sees this as just another ideological debate between the country’s two major political parties that Disney is playing “fairly” to by giving money away to both sides.</p><p id=\"zRSYJT\">But the “Don’t Say Gay” bill, like every other piece of legislation seemingly designed to make schools feel unsafe for queer students to exist within, isn’t just a set of ideas being bandied about by lawmakers who can’t agree on how children should be educated. The bill is, quite plainly, a set of misguided rules that are almost certain to stifle an untold number of helpful, affirming, and positive educational experiences under the auspice of preventing unhealthy interactions that truly only exist in the minds of bigoted, homophobes.</p><p id=\"XfvuXE\">Though Chapek has insisted that Disney wants to donate $5 million to the <a href=\"https://www.buzzfeednews.com/article/chrisgeidner/internal-report-major-diversity-organizational-problems-at-h#.cbAygzDnY\">Human Rights Campaign</a> and other queer advocacy organizations, the <a href=\"https://variety.com/2022/tv/news/disney-lgbtq-donation-dont-say-gay-bill-1235200027/\">HRC has said that it doesn’t want the company’s money</a> “until we see [Disney] build on their public commitment and work with LGBTQ+ advocates to ensure that dangerous proposals, like Florida’s ‘Don’t Say Gay or Trans’ bill, don’t become dangerous laws.”</p><p class=\"c-end-para\" id=\"c0rvId\">No amount of money can take back Disney’s tacit endorsement of the “Don’t Say Gay” bill, which, again, appears poised to become law as soon as DeSantis decides to sign it. These are the sorts of difficult realities that Disney, a multi-billion dollar titan of multiple industries, should be able to see coming from a distance and be ready to stand in when people decide to hold them accountable.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eU52bQOR1NjBKCX1JpUh8ROlqA8=/481x493:3862x2263/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23303443/1163274253.jpg",
  "description": "Disney’s facing even more criticism for its support of Florida’s \"Don’t Say Gay\" bill.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}