{
  "title": "Disney Plus with ads will keep the breaks down to four minutes per hour",
  "url": "https://www.theverge.com/2022/5/17/23105023/disney-plus-ad-supported-tier-streaming-fewer-ads",
  "date": "2022-05-17T23:33:19.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"disney+\" src=\"https://cdn.vox-cdn.com/thumbor/OVK_PsymDABp4d2erADmOMdX67M=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70881009/disneyplus.0.0.jpg\" />        <figcaption>Image: Disney</figcaption>    </figure>  <p id=\"LNXAM8\">When Disney Plus’ ad-supported plan goes live later this year, it will reportedly run ads for four minutes on movies or shows that last an hour or less, according to reports from <a href=\"https://variety.com/2022/tv/news/disney-plus-advertising-rules-kids-commercials-1235265430/\"><em>Variety</em></a> and <a href=\"https://www.wsj.com/articles/disney-vows-to-show-very-few-commercials-on-ad-supported-disney-11652785200\"><em>The Wall Street Journal</em></a>.</p><p id=\"Edsmu4\">As <em>Variety</em> points out, this would make Disney offer fewer ads per hour than some of its competitors. NBC’s Peacock runs no more than five minutes of ads for every hour of content, while HBO Max shows four minutes of ads per hour. Disney Plus’ planned number of ads even beats the Disney-owned Hulu, which runs anywhere from nine to 12 ads in one hour.</p><p id=\"R278ue\">As for the content of the ads themselves, the company is reportedly taking a cautious approach to maintain its family-friendly image. Disney isn’t just cutting out ads that may have adult themes, like anything related to alcohol or politics — <em>Variety</em> reports that it won’t accept any ads if they're from an entertainment competitor either.</p><div class=\"c-float-right\"><aside id=\"5VFCpT\"><q>Disney may show fewer ads than its competitors</q></aside></div><p id=\"w61XbD\">Disney plans on removing ads from all shows if it’s used by a <a href=\"https://help.disneyplus.com/csp?id=csp_article_content&amp;sys_kb_id=8acdc65ddbf33c144ade269ed39619e8\">kids’ profile</a> as well. Sources familiar with the situation tell <em>Variety</em> that Disney will remove ads on shows geared toward a preschool audience, even when a user doesn’t have a kids’ profile.</p><p id=\"z0iIdU\">In March, <a href=\"https://www.theverge.com/2022/3/4/22961433/disney-plus-subscription-ad-tier-price\">Disney announced that it would launch a cheaper, ad-supported</a> option in the US in late 2022, which will later become available to other countries next year. There aren’t any details on how much the cheaper option will cost — Disney Plus currently costs $7.99 / month without ads. Disney <a href=\"https://www.theverge.com/2022/5/11/23067551/disney-plus-q2-2022-earnings-205-million-streaming-subscribers\">says it added 7.9 million new subscribers</a> last quarter, growing its subscriber base to about 44 million people in the US and Canada.</p><p id=\"R4I7wh\">As Disney Plus’ subscriber count continues to grow, Netflix’s has shrunk (despite still sitting at 74.58 million subscribers in the US and Canada). <a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">The streaming giant lost subscribers</a> for the first time in more than a decade last quarter, and it has already devised a few plans to win users back. A note to employees indicates that Netflix could be <a href=\"https://www.theverge.com/2022/5/10/23065126/netflix-login-sharing-rollout-ads\">rolling out an ad-supported tier</a> sometime this year, and <a href=\"https://www.theverge.com/2022/4/8/23016891/dancing-with-the-stars-disney-plus-exclusive-abc\">like Disney Plus</a>, it’s also <a href=\"https://www.theverge.com/2022/5/14/23072842/netflix-looking-into-livestreaming-report\">working on a livestreaming option</a>. Netflix co-CEO Reed Hastings has spoken about clamping down on password sharing in order to cash in on streaming freeloaders (much to users’ dismay), which could come around the same time Netflix rolls out an ad-supported tier.</p><aside id=\"CwNNRa\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Now that Disney Plus is trying ads, how long until the rest of the streamers do, too? \",\"url\":\"https://www.theverge.com/2022/3/9/22967831/disney-plus-ads-hbo-max-hulu-streaming\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/UNwCDDyNGwQAeUhyZpyrem-mAUU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13412121/disneyplus.0.jpg",
  "description": "It will show only four minutes of ads per hour of content.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}