{
  "title": "Disney is placing its bets on sports streaming and the metaverse ",
  "url": "https://www.theverge.com/2022/2/9/22926245/disney-espn-sports-streaming-betting-metaverse",
  "date": "2022-02-09T23:24:29.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/bUmKEDAHe7yPKdSsX3PVqJw3JB0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70490889/acastro_190411_1777_Disney_Streaming_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ltfHjh\">Disney today reiterated its commitment to expanding its sports streaming portfolio, with Disney boss Bob Chapek confirming that the company is bidding for the NFL Sunday Ticket. Disney also plans to innovate its product around sports-centric features and its still-vague metaverse plans.</p><p id=\"U1kMC1\">Chapek confirmed the NFL Sunday Ticket news in an <a href=\"https://www.cnbc.com/video/2022/02/09/watch-cnbcs-full-interview-with-disney-ceo-bob-chapek.html\">interview with CNBC</a> during which he discussed Disney’s first quarter earnings for fiscal 2022. Asked by CNBC’s Julia Boorstin whether securing the rights is part of Disney’s roadmap, Chapek responded, “we’re bidding for it.” If the investment creates value for Disney shareholders, he added, “we’ll go ahead and do it, but the moment that it’s not, we’ll back out. And we hope it is.”</p><p id=\"itgpQZ\">During the company’s earnings call, Chapek again hammered home that sports programming is a pivotal part of the company’s streaming strategy, touting the success of programming on its subsidiary ESPN.</p><p id=\"sXX9Az\">“Sporting events continue to be the most powerful draw in television, accounting for 95 of the 100 most-watched live broadcasts in 2021. And ESPN once again set the bar this quarter with live games across each of our four major US sports, including the revolutionary <em>Monday Night with Peyton and Eli</em>,” Chapek said. Disney will add alternative programming for UFC, golf, and college football events over the course of the next three years, he added.</p><div class=\"c-float-right\"><aside id=\"YuIH9B\"><q>“It extends to sports betting, gaming, and the Metaverse.”</q></aside></div><p id=\"5R39zE\">But Disney’s sports strategy isn’t merely limited to rights acquisition and game coverage. Disney has said that betting <a href=\"https://www.theverge.com/22822590/sports-betting-streaming-wars-disney-dazn-fubo-tv-sling\">presents a huge opportunity</a> for growth and interactivity, particularly as legalization continues across the US. </p><p id=\"G0el2n\">“While multi-platform television and streaming will continue to be the foundation of sports coverage for the immediate future, we believe the opportunity for The Walt Disney Company goes well beyond these channels,” Chapek said. “It extends to sports betting, gaming, and the Metaverse. In fact, that’s what excites us: the opportunity to build a sports machine akin to our franchise flywheel that enables audiences to experience, connect with and become actively engaged with their favorite sporting events, stories, teams, and players.”</p><p id=\"4lGB1p\">Chapek also touched on Disney’s metaverse plans — something he keeps bringing up without any real specifics around what it might look like.</p><p id=\"b52OCG\">“We realize that in the future — you can call it what you want, you want to call it metaverse, you want to call it the blending of the physical and digital experiences, which I think Disney should excel at — we realize that it’s going to be less of a passive type experience where you just have playback, whether it’s a sporting event or whether it’s an entertainment offering, and more of an interactive, lean-forward, actively engaged type experience.” </p><p id=\"A5UJbf\">Product innovation, Chapek added, “is a very top-of-mind thing for us.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YN3u6ZL5he52WyFGAeyfyqHPxmw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16025342/acastro_190411_1777_Disney_Streaming_0003.0.jpg",
  "description": "Betting, interactivity, and sports programming is key.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}