{
  "title": "Disney Plus added almost 8 million new subscribers as Netflix struggles",
  "url": "https://www.theverge.com/2022/5/11/23067551/disney-plus-q2-2022-earnings-205-million-streaming-subscribers",
  "date": "2022-05-11T21:51:51.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"disney+\" src=\"https://cdn.vox-cdn.com/thumbor/9r0wopJ3OFazABE0nYSMtZIzwkE=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70858663/disneyplus.0.0.jpg\" />        <figcaption>Image: Disney</figcaption>    </figure>  <p id=\"juMwya\">Disney added 7.9 million new subscribers to its Disney Plus streaming service during the first three months of 2022, the company announced in its <a href=\"https://thewaltdisneycompany.com/app/uploads/2022/05/q2-fy22-earnings.pdf\">Q2 earnings report on Wednesday</a>. That brings the total to around 87.6 million worldwide, excluding the 50.1 million people subscribed to Disney Plus Hotstar internationally. In the US and Canada alone, Disney Plus now has 7.1 million more subscribers than it did a year ago, with 44.4 million.</p><p id=\"L3jAwH\">The company also said that the number of subscribers for all of its streaming offerings — including Hulu and ESPN Plus —  had grown to over 205 million, an increase from the 196.4 million <a href=\"https://deadline.com/2022/02/disney-plus-streaming-subscribers-million-quarter-1234929868/\">it reported in January</a>.</p><p id=\"j9wAW6\">That’s better news than Netflix’s had recently. Last month, the streaming company reported that it had <a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">lost 200,000 subscribers</a> compared to the previous quarter, its first dip in over a decade. It’s also faster growth than HBO and HBO Max, which reported <a href=\"https://www.theverge.com/2022/4/21/23036309/att-earnings-hbo-max-subscriber-growth-2021\">3 million new subscribers last quarter</a> (at around 77 million total customers, HBO is still very much trailing Disney). It’s also worth noting that Netflix still has around 222 million subscribers.</p><p id=\"Pi1hiv\">Of course, all of these companies are doing better than CNN Plus, which <a href=\"https://www.theverge.com/23043232/cnn-plus-axios-chat-shut-down-streaming-news\">launched and folded</a> within the span of a few weeks. </p><div class=\"c-float-right\"><aside id=\"2MDBtn\"><q>Disney is still losing money on Plus</q></aside></div><p id=\"LJYI3Y\">Disney also reports that it’s earning more per Disney Plus subscriber than it had been previously, at least in the US. Where its average monthly revenue per paid subscriber used to be $6.01, it’s now sitting at $6.32. Disney says this is thanks to “an increase in retail pricing and a lower mix of wholesale subscribers.” </p><p id=\"kpyAaL\">Despite this, Disney Plus is actually losing the company money at a greater clip than it was before. Disney says this is thanks to higher costs for production, advertising, and technology. Those costs seem unlikely to go down, and raising prices, <a href=\"https://www.theverge.com/2022/1/20/22893419/netflix-price-increase-q1-2022-earnings\">like Netflix did</a>, could cut off its subscriber growth. All that put together makes it obvious why Disney is <a href=\"https://www.theverge.com/2022/3/9/22967831/disney-plus-ads-hbo-max-hulu-streaming\">looking at creating an ad-supported tier</a> sooner rather than later.</p><p id=\"gE8Jta\">One last interesting note comes right at the top of Disney’s earnings. The company notes that its revenue growth happened despite the fact that it gave up a billion dollars in revenue to end a customer’s license agreement for film and television content early in order to use the content on its own streaming services. The report doesn’t specify which of Disney’s customers this deal was with, but the company was very clearly willing to take a big hit to get <em>something </em>onto Disney Plus. <a href=\"https://variety.com/2022/digital/news/disney-plus-march-2022-earnings-1235264311/\"><em>Variety</em></a> and <a href=\"https://www.hollywoodreporter.com/business/business-news/disney-q2-2022-earnings-streaming-1235144837/\"><em>The Hollywood Reporter</em></a> speculated that this could be about the Marvel shows that <a href=\"https://www.theverge.com/2022/2/11/22929364/netflix-disney-daredevil-iron-fist-luke-cage-jessica-jones-punisher-marvel\">were on Netflix</a> — before they abruptly <a href=\"https://www.theverge.com/2022/3/1/22955274/netflix-marvel-shows-disney-plus-release-date\">moved to Disney Plus in March</a>. </p><p id=\"1aRCHh\">Disney didn’t immediately respond to <em>The Verge</em>’s request for specifics on the deal. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UNwCDDyNGwQAeUhyZpyrem-mAUU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13412121/disneyplus.0.jpg",
  "description": "The company has 205 million across Plus, Hulu, and more.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}