{
  "title": "Disney Plus is adding a cheaper ad-supported subscription tier later this year",
  "url": "https://www.theverge.com/2022/3/4/22961433/disney-plus-subscription-ad-tier-price",
  "date": "2022-03-04T14:24:46.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"disney+\" src=\"https://cdn.vox-cdn.com/thumbor/5mzQVpcXdN22bE15Qd3JpufkYq8=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70578596/disneyplus.0.0.jpg\" />        <figcaption>Image: Disney</figcaption>    </figure>  <p id=\"9vy6Md\">Disney Plus will be adding a cheaper, ad-supported subscription tier sometime in “late 2022,” the company announced today. The tier will come to the US first before expanding internationally in 2023.</p><p id=\"MUNNtr\">Crucially, Disney hasn’t said how much cheaper the advertisement-supported version of Disney Plus will be compared to the standard, ad-free plan (which currently costs $7.99 per month or $79.99 per year) or when exactly it’ll be launching the new tier of service. </p><p id=\"rjhXiQ\">Adding cheaper options with ads has become increasingly popular among subscription services. HBO Max last year introduced a $10 per month plan that shaved $5 off the ad-free price, although in addition to adding commercials, the cheaper plan also is limited to HD content (and not 4K). Peacock takes a more varied approach: a smaller selection of content with ads is available completely free, with a $4.99 per month tier that offers the full library with ads, along with a $9.99 per month level that allows customers to download titles to watch offline and gets rid of (most, but not all) of the commercials.</p><p id=\"bxsuqd\">Even Hulu — which Disney now owns and operates — offers ad-free and advertisement-supported versions: Hulu with commercials costs $6.99 per month (or $69.99 per year), while the ad-free version of Hulu costs almost twice as much at $12.99 per month. </p><p id=\"8wbqCy\">Adding a cheaper, ad-supported tier for Disney Plus could help the company further expand its subscriber base, something that’s increasingly becoming a priority for the future of Disney’s media empire. Given that subscriber growth <a href=\"https://www.nytimes.com/2021/11/10/business/disney-plus-growth-slows.html#:~:text=Disney%2B%20added%2012.4%20million%20subscribers,of%20the%202024%20fiscal%20year\">has been slowing in recent months</a>, along with Disney’s ambitious goals of reaching 230 to 260 million Disney Plus subscribers by 2024 (the service currently has 129.8 million, <a href=\"https://techcrunch.com/2022/02/10/disney-outshines-netflix-with-11-8m-new-subscribers-in-q1-strong-forecast/#:~:text=Disney%2B%20has%2042.9%20million%20subscribers,Star%20India's%20existing%20streaming%20service.\">as of Disney’s Q1 2022 earnings</a>), an ad-supported price tier could help draw in another big wave of new customers in the coming months. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UNwCDDyNGwQAeUhyZpyrem-mAUU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13412121/disneyplus.0.jpg",
  "description": "Coming \"late 2022\" in the US and internationally in 2023",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}