{
  "title": "Disney CEO calls hypothetical ESPN streaming package ‘the ultimate fan offering’",
  "url": "https://www.theverge.com/2022/5/11/23067682/disney-earnings-espn-streaming-direct-to-consumer",
  "date": "2022-05-11T23:21:01.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Disney Plus ESPN Plus Hulu bundle\" src=\"https://cdn.vox-cdn.com/thumbor/nvAg-L0EHrzPGr6lmeKUIfVRl_8=/0x35:1396x966/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70859084/disney_plus.0.png\" />        <figcaption>Image: Disney</figcaption>    </figure>  <p id=\"fi4sIu\">On <a href=\"https://thewaltdisneycompany.com/disneys-q2-fy22-earnings-results-webcast/\">an earnings call earlier today</a>, Disney CEO Bob Chapek sounded like someone who has clear ideas of ESPN’s fully streaming future. He told analysts and investors that “when it comes time to actually pull the trigger,” he believes ESPN can create “the ultimate fan offering that will appeal to the superfan who loves sports,” and “I think there’s nobody but ESPN who could frankly pull that off.”</p><p id=\"GMsun5\">This isn’t the first time we’ve heard a Disney exec reference the potential of ESPN streaming — former CEO Bob Iger <a href=\"https://www.theverge.com/2015/7/27/9045639/espn-direct-consumer-sales-eventually-iger-says\">said in 2015 that it will happen eventually</a> but projected the possibility as more than five years out. In contrast, Chapek said Disney isn’t ready to <em>share</em> the specifics of its model on how long it would take to reach profitability or the impact such a shift would have on its existing cable ESPN business deals, without bothering to include any far-off timetables as reassurance for his cable partners.</p><p id=\"NvRMH6\">The conversation kicked off because one analyst asked what’s holding the company back from making ESPN Plus a fully a la carte sports network. As it is, the subscription offers occasional simulcasts of ESPN’s cable networks, as well as some exclusive streaming programming, but it can’t replace traditional ESPN for most viewers, and there’s a big reason why: money.</p><p id=\"uZ1gjX\">As Chapek acknowledged in his response, legacy linear networks like ESPN and the cable fees they bring in are “huge cash generators,” which creates Disney’s hesitancy to upset the existing business model too early. </p><div class=\"c-float-right\"><aside id=\"4vOvwD\"><q>“At some point ... we’ll be able to fully go into an ESPN DTC offering”</q></aside></div><p id=\"GsjOlc\">The not-so-slow collapse of cable companies’ subscriber numbers due to cord-cutting is no secret. At its peak in 2010, the US had around 105 million pay-TV households. A report in March <a href=\"https://www.leichtmanresearch.com/major-pay-tv-providers-lost-about-4700000-subscribers-in-2021/\">from Leichtman Research Group</a> tracking the biggest cable, satellite, and fiber pay-tv companies in the US saw their subscriber counts fall by about 5.5 million in 2021 following a loss of 5.78 million in 2020, leaving their numbers for the start of 2022 at around 68.1 million. </p><p id=\"jO04pg\">However, he continued on, “At the same time, we’re very conscious of our ability to go more aggressively into the DTC [direct-to-consumer, aka streaming] area of ESPN, so what we’re doing is sort of putting one foot on the dock, if you will, and one foot on the boat right now.”</p><p id=\"PlnDYB\">“But what we know is at some point when it’s going to be good for our shareholders, we’ll be able to fully go into an ESPN  DTC offering, the way that you describe, and we fully believe that there is a business model there for us that’s going to enable us to regain growth on ESPN Plus in a full DTC expression.”</p><p id=\"cB2b7A\">This is a balance that Disney has done plenty to upset already by shifting its focus away from cable channels with the launch of <a href=\"https://www.theverge.com/2022/5/11/23067551/disney-plus-q2-2022-earnings-205-million-streaming-subscribers\">Disney Plus</a>, and similar to the one that Warner is navigating with HBO and HBO Max. Traditional pay-TV setups (including online streaming like Disney offers via Hulu with Live TV) still have too much impact on Disney’s bottom line for Disney to bypass them and launch the full ESPN experience as its own streaming subscription <a href=\"https://www.theverge.com/2012/11/14/3643700/live-sports-tv-streaming-online-espn-war-for-tv\">as it has been for many years</a>, but the point where that will change is close enough that Chapek is comfortable openly entertaining the possibilities.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kVdMeebF3FbOyh_iAzYn-dljNCs=/0x135:1396x866/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18938524/disney_plus.png",
  "description": "ESPN Plus, but with everything that’s on ESPN?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}