{
  "title": "Disney Plus just experimented with its first livestream",
  "url": "https://www.theverge.com/2022/2/8/22924369/disney-plus-first-live-feed",
  "date": "2022-02-08T23:26:34.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"Streaming Services Photo Illustrations\" src=\"https://cdn.vox-cdn.com/thumbor/D3MPL17IGan0YAmW7HgRDPrf4ho=/0x0:3543x2362/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70486006/1238248875.0.jpg\" />        <figcaption>Photo by Jakub Porzycki/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"Jt0wkb\">Disney Plus is experimenting with live streams, dedicating its first to Academy Award nominations.</p><p id=\"BVxJQo\">“We performed a test for live streaming capabilities on Disney+ in the U.S. with this morning’s Academy Award nominations,” the company told <em>The Verge </em>in a statement. “We are pleased with the results and will continue to test as part of our ongoing and iterative approach to deliver the best user experiences to consumers.”</p><p id=\"9Ta2Bs\">This was Disney’s first live test and was accessible by all Disney Plus subscribers in the US, company spokesperson Kristie Adler told <em>The Verge</em>. The company did not have any further details to share about livestreaming in the future. The news of Disney’s first livestreaming event was <a href=\"https://techcrunch.com/2022/02/08/disney-just-ran-its-first-test-of-live-streaming-in-the-u-s/\">previously reported</a> by <em>TechCrunch</em>.</p><p id=\"enwBt7\">While Disney declined to offer more information about whether its tentpole streaming service would be offering more livestreamed events outside of the Oscars, it makes sense that a company with livestreaming sister services like Hulu and ESPN Plus would experiment with live events.</p><p id=\"jkPIcn\">The company said that it is looking into “the possibilities” of what live content could potentially look like for Disney Plus, adding that “our world-renowned content is a natural extension” of years of experience in the live content space.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_rhMkgVIBg32-r6kcAgD-eXdtHY=/0x254:3543x2109/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23227720/1238248875.jpg",
  "description": "Could more be on the horizon for Disney Plus?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}