{
  "title": "Disney employees are staging walkouts over Florida’s ‘Don’t Say Gay’ bill",
  "url": "https://www.theverge.com/2022/3/15/22979440/disney-dont-say-gay-where-is-chapek-walkout",
  "date": "2022-03-15T19:50:10.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/01fB0KU3H9HNhMbqKjEqQWSGMRs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70626773/acastro_190411_1777_Disney_Streaming_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ih9ZlT\">In the days since The Walt Disney Company first came under fire for giving money to <a href=\"https://www.theverge.com/2022/3/10/22967765/disney-dont-say-gay-bill-chapek-florida-hrc\">the politicians behind Florida’s “Don’t Say Gay” bill</a>, CEO Bob Chapek has apologized for initially having nothing to say, and he subsequently announced the corporation’s plans to “pause” its political donations in Florida for an undetermined amount of time. In the eyes of many of Disney’s queer employees, those steps are simply not enough, and now they’re taking action to make that point as clear as they can to the company’s leadership.</p><p id=\"wNljQr\">In response to Disney’s actions and Chapek’s emails, a number of Disney employees are now planning to stage a week of virtual 15-minutes walkouts beginning this afternoon, culminating in a day-long walkout on March 22nd. In <a href=\"https://www.whereischapek.com/open-letter\">an open letter</a> published to <a href=\"http://WhereIsChapek.com\">WhereIsChapek.com</a>, a website created by a number of the staffers who organized the Disney Do Better Walkout, the employees expressed their appreciation for Chapek’s apology but took to task how Disney has “<em>utterly failed to match the magnitude of the threat to LGBTQIA+ safety represented by this legislation</em>.” (Emphasis theirs.)</p><p id=\"hvs2uR\">“Those statements have indicated that leadership still does not truly understand the impact this legislation is having not only on Cast Members in the state of Florida, but on all members of the LGBTQIA+ community in the company and beyond,” the letter reads.</p><div><aside id=\"BpEEEZ\"><q>“You cannot fix this with educational seminars or token background characters — even organizations like HRC refuse your money until action is taken.” </q></aside></div><p id=\"TkouqG\">The “Don’t Say Gay” bill effectively makes it illegal for educators who teach kindergarten through 3rd grade to at all discuss queerness or queer people with their students, even though the concepts of sexual and gender identity are not actually taught at that level. Teachers would similarly be barred from broaching the topics with older students unless the subject matter is deemed “age-appropriate” or “developmentally appropriate” in ways that the bill does not specify.</p><p id=\"N6UhTK\">Chapek, as the open letter points out, <a href=\"https://twitter.com/gma/status/1499569682952732672\">originally suggested</a> that one good way for Disney to respond to real-world homophobic legislation would be to continue to tell and sell stories about fictional queer characters. Just days after Chapek’s email, though, Pixar’s employees pointed out how commonplace it is for queerness to be edited out during the production process on the studio’s projects — so much so that it often feels like <a href=\"https://variety.com/2022/film/news/disney-pixar-same-sex-affection-censorship-dont-say-gay-bill-1235200582/\">outright anti-gay censorship</a>. While the people behind the Disney Do Better Walkout understand the power of representation, they similarly understand that seeing one’s self on-screen is not the solution to this particular kind of pressing issue.</p><p id=\"SPLGKE\">“The ongoing attempts to placate the LGBTQIA+ community with subpar representation in the content produced and donations to well-meaning organizations are simply not enough,” the letter reads. “You cannot fix this with educational seminars or token background characters — even organizations like HRC refuse your money until action is taken.”</p><p id=\"wLxP2h\">When we spoke with the organizers behind the walkouts, they described the current atmosphere within Disney as one of “confusion and concern,” and said that morale among some employees has hit a marked low. While Disney has not yet responded to the walkout effort, the organizers said that the company’s Slack channels focused on pride and diversity have seen a marked uptick in activity specifically because of this issue.</p><p id=\"9oLDYP\">“The LGBTQIA+ community has obviously been the most vocal and quite a few allies have stood up to support us as well,” the organizers said. “There’s clearly a sense of ‘something has to change’ and we needed a way to direct our energy into a plan that could draw broader attention to our asks — hence our walkout effort, with clear demands.”</p><p id=\"1W9a0i\">Rather than simply doubling down on representation, the walkout’s organizers want Disney to fulfill <a href=\"https://www.whereischapek.com/demands\">a set of demands</a> meant to “regain the truth of the LGBTQIA+ community” starting with an outright commitment to “indefinitely cease all campaign donations to ... politicians involved in the creation or passage of the “Don’t Say Gay” bill. Beyond vowing not to give money to those specific politicians, the organizers are also pushing for Disney to “publicly commit to an actionable plan that protects employees” based in Florida from being directly harmed by the “Don’t Say Gay” bill. The organizers are also calling for Disney to donate to groups like The Trevor Project and to redouble its commitment to queer stories and their creators with the creation of a new in-house brand similar to <a href=\"https://deadline.com/2021/05/disney-onyx-collective-content-brand-for-creators-of-color-underrepresented-voices-hulu-tara-duncan-1234758071/\">The Onyx Collective</a> that’s specifically meant to focus on queer voices.</p><p id=\"iEzeSk\">“As a community, we have been forced into an impossible and unsustainable position and must now take action to convince TWDC to protect employees and their families in the face of such open and unapologetic bigotry,” the employees’ letter states. “The LGBTQIA+ community is no stranger to advocating for ourselves - Pride is a protest, after all. Our community in TWDC is no different and we will show you how strong we are together.”</p><p id=\"S4Ud5a\"><em><strong>Update March 15th, 4:50 PM ET: </strong></em><em>Article updated with quote the group of employees organizing the week of walkouts.</em></p><p id=\"MAiQSH\"></p><p id=\"KnLIct\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dz43oalHs8lNQDYohzQFdRKz_VE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16025344/acastro_190411_1777_Disney_Streaming_0001.0.jpg",
  "description": "Disney employees are taking a stand against Florida’s \"Don’t Say Gay\" bill.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}