{
  "title": "Disney has appointed a leader for its metaverse strategy",
  "url": "https://www.theverge.com/2022/2/15/22935445/disney-metaverse-strategy-plans-mike-white-memo",
  "date": "2022-02-15T20:00:43.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XT0d4RS4CIp7yb_G8njjpNXjF6s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70513484/acastro_190411_1777_Disney_Streaming_0003.0.0.jpg\" />        <figcaption><em>Disney’s getting serious about the metaverse.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"fEu1lf\">Disney is appointing an executive to head up its metaverse plans, according to a memo CEO Bob Chapek sent to employees (via <a href=\"https://www.reuters.com/business/media-telecom/exclusive-disney-names-executive-oversee-metaverse-strategy-memo-2022-02-15/\"><em>Reuters</em></a> and <a href=\"https://www.cnbc.com/2022/02/15/disney-appoints-executive-to-lead-metaverse-development.html\"><em>CNBC</em></a>). Mike White, who previously held the title of SVP of consumer experiences and platforms, will now be SVP of next generation storytelling and consumer experiences.</p><p id=\"PJgcW4\">“For nearly 100 years, our company has defined and re-defined entertainment by leveraging technology to bring stories to life in deeper, more impactful ways,” Chapek said in the memo, which Disney shared with <em>The Verge</em>.</p><p id=\"KJKAPm\">“Today, we have an opportunity to connect those universes and create an entirely new paradigm for how audiences experience and engage with our stories,” he continued. “This is the so-called metaverse, which I believe is the next great storytelling frontier and the perfect place to pursue our strategic pillars of Storytelling Excellence, Innovation, and Audience Focus.”</p><div class=\"c-float-right\"><aside id=\"dkbyaZ\"><q>Disney has previously signaled its interest in the metaverse</q></aside></div><p id=\"Q6AU95\">Chapek signaled Disney’s intentions to get involved with the metaverse during its <a href=\"https://www.theguardian.com/film/2021/nov/11/disney-is-latest-firm-to-announce-metaverse-plans\">earnings call in November</a> and again <a href=\"https://www.theverge.com/2022/2/9/22926245/disney-espn-sports-streaming-betting-metaverse\">during its earnings last week</a>, though the company’s plans have been vague. But even if Disney’s strategy is still unclear, given its huge stable of franchises and its willingness to put them into the physical world (theme parks) and digital formats (movies, TV shows, video games, etc.), it’s not hard to imagine why Disney is seriously exploring some kind of metaverse play. </p><p id=\"iIko9O\">“While the storytelling that will define our metaverse presence will of course emanate from our creative teams, Mike will establish our overall vision and strategy for the consumer journey through these new story worlds,” Chapek said in the memo. “As part of this, Mike will quickly assemble a structure and put in place processes to prioritize and allocate resources, explore partnerships, and facilitate knowledge sharing. Mike will also lead a taskforce that will include senior leaders from key disciplines across the company, including technology, strategy, and of course, storytelling.”</p><p id=\"1Uc2DZ\">White has worked as an exec at Disney since 2011, according to <a href=\"https://www.linkedin.com/in/michaelpwhite\">LinkedIn</a>. He also spent more than nine years at Yahoo.</p><aside id=\"fRWpG6\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"NFT makers are trying to build the next Disney\",\"url\":\"https://www.theverge.com/22785051/nft-collectibles-intellectual-property-decentralized-disney\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/YN3u6ZL5he52WyFGAeyfyqHPxmw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16025342/acastro_190411_1777_Disney_Streaming_0003.0.jpg",
  "description": "Disney is signaling that it’s serious about the metaverse.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}