{
  "title": "Disney’s ‘Don’t Say Gay’ misstep threatens to overshadow Chapek’s reign as CEO ",
  "url": "https://www.theverge.com/2022/4/11/23016948/bob-chapek-disney-dont-say-gay-florida-lgbtqia",
  "date": "2022-04-11T19:12:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/A8EI3rumoTLkN0uAzIb5ug7FsE0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70737059/acastro_190411_1777_Disney_Streaming_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"uQBgRB\">Weeks ago, facing pressure internally to speak out against Florida’s “Don’t Say Gay” bill, Disney CEO Bob Chapek took a surprising approach: he did nothing. His silence angered employees and advocacy groups to such an extent that he eventually backpedaled. But when Chapek finally did condemn the legislation, he provoked politicians and set off a weeks-long bad-faith crusade against Disney by right-wing media. The ensuing chaos is just the latest in a series of public missteps that threaten to overshadow Chapek’s tenure leading one of the most powerful entertainment companies in the world.</p><p id=\"1qQjj7\">Chapek <a href=\"https://www.theverge.com/2020/2/25/21153317/bob-iger-disney-ceo-steps-down-chapek-kevin-mayer-parks-products-succession\">replaced</a> beloved Disney boss Bob Iger as the company’s CEO in 2020 — just before the pandemic would shut down Disney’s parks and theaters. Under Chapek, a longtime Disney executive, problems emerged almost immediately. Amid pandemic closures, Parks <a href=\"https://www.hollywoodreporter.com/business/business-news/disneyland-employees-protest-shuttered-park-proposed-reopening-conditions-1300798/\">employees protested</a> over Disneyland Resort’s reopening plans. Chapek angered both theaters and talent with Disney Plus hybrid and straight-to-streaming releases, which led to a messy and <a href=\"https://www.theverge.com/22611516/scarlett-johansson-disney-lawsuit-streaming-services-transparency\">very public lawsuit</a> by <em>Black Widow</em> star Scarlett Johansson. And he reportedly aggravated staff with a <a href=\"https://www.cnbc.com/2022/03/20/disney-ceo-chapek-iger-falling-out.html\">corporate restructure</a> that snowballed into an internal power struggle.</p><p id=\"YsZT5I\">Most recently, Disney has faced upheaval over its <a href=\"https://www.theverge.com/2022/3/11/22973199/disney-bob-chapek-apology-dont-say-gay-bill-florida\">handling of the bill</a> in Florida, culminating in <a href=\"https://www.theverge.com/2022/3/15/22979440/disney-dont-say-gay-where-is-chapek-walkout\">company walkouts</a> as well as criticism of Chapek by Disney employees and creators and various advocacy groups, including GLAAD and the Human Rights Campaign. It’s one of many business decisions that deviate heavily from the way the company was run under Chapek’s predecessor, and it’s led to continued tension inside the company. It’s also made Disney the target of right-wing protesters who have called for a Disney boycott.</p><p id=\"H0yWPJ\">Disney employees who spoke with <em>The Verge</em> say there’s little chance the chaos surrounding the company’s “Don’t Say Gay” response, in particular, would have happened on the watch of Iger.</p><h2 id=\"9vtEYp\">Chapek’s reimagined Disney</h2><p id=\"ObKbSR\">Chapek’s promotion to chief of Disney coincided with a pivotal time for the company. With Disney Plus’ launch in 2019, Disney tapped its vault of decades’ worth of content to take on the streaming giants. Chapek made it clear straight out of the gate that accelerating Disney’s direct-to-consumer business was core to his vision for the company moving into its second century. </p><p id=\"wHIZDv\">But the shift in leadership style has seemingly been felt at every level of Disney, from parks employees to staff and even talent. Later the same year that Chapek took over the company, Disney’s entertainment and media divisions underwent a massive <a href=\"https://www.theverge.com/2020/10/13/21514728/disney-streaming-reorganization-plus-espn-hulu-studios-movies-network-tv-shows-pandemic\">reorganization</a> that positioned Disney Plus as a key revenue driver for the future of the company. Among the goals of this reorganization, the company said at the time, Disney’s “creative engines will focus on developing and producing original content for the Company’s streaming services.”</p><p id=\"3njUHB\">“Managing content creation distinct from distribution will allow us to be more effective and nimble in making the content consumers want most, delivered in the way they prefer to consume it,” Chapek said at the time. “Our creative teams will concentrate on what they do best — making world-class, franchise-based content — while our newly centralized global distribution team will focus on delivering and monetizing that content in the most optimal way across all platforms, including Disney Plus, Hulu, ESPN Plus, and the coming Star international streaming service.”</p><div class=\"c-float-right\"><aside id=\"X92E8c\"><q>Many of Chapek’s leadership moves appear at odds with those of former Disney boss Bob Iger</q></aside></div><p id=\"AxZknc\">While Disney positioning its streaming arm as central to its business strategy wasn’t altogether surprising, the restructure reportedly led to internal power struggles among long-employed executives, <a href=\"https://www.cnbc.com/2022/03/20/disney-ceo-chapek-iger-falling-out.html\">CNBC reported</a> last month. Citing sources familiar with the matter, CNBC reported that Chapek failed to consult Iger about the reorganization, and the move led to “a burst of internal frustration among some veteran Disney employees who no longer controlled the budgets of their divisions.”</p><p id=\"XDn3CX\">And then there was the ScarJo drama. Disney, clearly favoring its streaming service and potential subscriber growth for its marquee streaming service, released <em>Black Widow</em> on Premier Access the same day the film debuted in theaters. Johansson <a href=\"https://www.theverge.com/2021/7/29/22600396/scarlett-johansson-suing-disney-black-widow-release\">would later sue</a> the company, claiming that the hybrid release model cut into box office bonuses and, therefore, her overall earnings for the highly anticipated Marvel film. Disney responded by publicly disclosing her salary and framing her decision to collect on expected compensation as “callous” — a shocking response for a company that had, under Iger, been traditionally accommodating to talent.</p><p id=\"YaVuww\">Notably, Disney Plus launched in 2019 sans ads. Disney’s former direct-to-consumer boss Kevin Mayer said during an investors event in 2019 that “for Disney, for these brands, at this time no ads is the right call.” Under Chapek, Disney Plus plans to offer an <a href=\"https://www.theverge.com/2022/3/9/22967831/disney-plus-ads-hbo-max-hulu-streaming\">ad-supported tier</a>, which the service will roll out later this year. Additionally, Disney’s foray into <a href=\"https://www.theverge.com/2022/2/9/22926245/disney-espn-sports-streaming-betting-metaverse\">gambling</a> feels like yet another shift away from the Disney run by Iger, who, in 2019, <a href=\"https://www.yahoo.com/now/disney-iger-gambling-stance-espn-sports-betting-shows-205916843.html\">told investors</a> sports betting would not be a near-term area of focus for The Walt Disney Company.</p><p id=\"mGQ8Ru\">Many of these decisions can be pegged to Chapek’s laser focus on the success of Disney Plus and its sister services. (Disney aggressively markets the Disney Bundle, which adds ESPN Plus and Hulu at a discounted price.) While Disney Plus technically launched under Iger, it will be Chapek who ultimately answers for the company’s streaming success. The pandemic and its impact on Disney’s businesses — from production to parks to theatrical debuts — only upped the stakes for a CEO over whom his predecessor’s shadow looms heavily. And while it’s too soon to say whether his strategy is going to work, Chapek seems less concerned with alienating employees or allies if it means he pulls it off.</p><h2 id=\"od4YPw\">Chapek’s “Don’t Say Gay” misstep</h2><p id=\"F58WzC\">But Chapek’s handling of the “Don’t Say Gay” bill in Florida — and his refusal to speak out about it — has arguably been the single greatest public embarrassment for the company to date. Disney has found itself at odds with advocacy groups, politicians, and its own employees, who in March <a href=\"https://www.theverge.com/2022/3/15/22979440/disney-dont-say-gay-where-is-chapek-walkout\">staged walkouts</a> over his response — more specifically, <a href=\"https://www.theverge.com/2022/3/15/22979440/disney-dont-say-gay-where-is-chapek-walkout\">initial lack thereof</a> — to the legislation.</p><p id=\"AlVGvR\">“As we have seen time and again, corporate statements do very little to change outcomes or minds,” Chapek <a href=\"https://variety.com/2022/film/news/disney-ceo-bob-chapek-support-lgbtq-1235197938/\">wrote to employees</a> in early March in a memo obtained by <em>Variety</em>. He added that he believed “the best way for our company to bring about lasting change is through the inspiring content we produce, the welcoming culture we create, and the diverse community organizations we support.”</p><div class=\"c-float-right\"><aside id=\"VG5Qpj\"><q>Iger “would have taken a completely different stand from the get-go”</q></aside></div><p id=\"PPBPzo\">Multiple Disney parks employees based in Florida, who spoke with <em>The Verge</em> on the condition of anonymity to avoid retaliation, said that the situation that unfolded these past few weeks would have almost certainly been handled differently had Iger still been running the company. </p><p id=\"m7amQ6\">“I know that if [Iger] was still in charge of the leadership, he would have taken a completely different stand from the get-go and sided with the LGBTQ-plus community,” one worker said. “He would have done everything that it took Chapek months to do right from the get-go.”</p><p id=\"mwydOY\">It’s one of the clearest examples yet that Chapek is steering the House of Mouse in a much different direction than Iger, Disney’s visionary CEO who wooed creative talent and shepherded Disney into its streaming era. (Iger’s Disney took a <a href=\"https://variety.com/2016/biz/news/disney-marvel-boycott-georgia-anti-gay-bill-1201737405/\">radically different stance</a> to similarly discriminatory legislation in Georgia in 2016, publicly issuing a statement that it would “take our business elsewhere should any legislation allowing discriminatory practices be signed into state law.”) </p><p id=\"DbhLCz\">By the time Chapek’s initial remarks about Disney’s silence had <a href=\"https://www.hollywoodreporter.com/business/business-news/disney-ceo-bob-chapek-florida-dont-say-gay-bill-response-1235105879/\">made headlines</a> on March 7th, Iger had, for his part, already publicly condemned the bill. Quote-tweeting a statement from President Joe Biden about the bill, <a href=\"https://twitter.com/RobertIger/status/1497064238145171458\">Iger wrote</a> that if passed, the bill would “put vulnerable, young LGBTQ people in jeopardy.” Recently, <a href=\"https://www.cnn.com/2022/03/31/media/bob-iger-dont-say-gay\">Iger told CNN Plus’</a> Chris Wallace that speaking out against the bill wasn’t about politics but was instead about “what is right and what is wrong, and that just seemed wrong. It seemed potentially harmful to kids.”</p><p id=\"aXbWtd\">Parks employees say Chapek failed to recognize that this wasn’t just a Florida problem but a problem for Disney employees and their loved ones. Iger, one person said, “knew that this company really succeeds because of all its cast members and all of the employees who make everything happen — all the animators and the different studios that make these things actually happen — and it doesn’t ever feel like Bob Chapek really understands that.”</p><div class=\"c-float-right\"><aside id=\"zU3eLy\"><q>“We are doing our best to be patient and wait to see what leadership will do next”</q></aside></div><p id=\"ZnSRb7\">At the same time, the organizers of the <a href=\"https://www.theverge.com/2022/3/15/22979440/disney-dont-say-gay-where-is-chapek-walkout\">Disney Walkout movement</a> — who spoke with <em>The Verge</em> over email as a group — noted that while even lger has spoken out publicly against discriminatory legislation while leading the company, “the political donations to the Florida politicians behind the ‘Don’t Say Gay’ bill have been occurring since even Iger’s tenure as CEO.” Ceasing donations to political figures and groups that actively work to advance legislation like the “Don’t Say Gay” bill is one of the core demands of LGBTQ-plus employees behind the <a href=\"https://www.whereischapek.com/\">Where Is Chapek</a> initiative. (Amid backlash, the company said it would <a href=\"https://www.theverge.com/2022/3/15/22979440/disney-dont-say-gay-where-is-chapek-walkout\">pause political donations</a> in Florida.)</p><p id=\"yquDOS\">While Chapek is dealing with internal fallout, his flip-flopping on the company’s position has also managed to infuriate people across the political spectrum. While public figures and advocacy groups denounced Disney’s handling of the situation, conservative parents have claimed on social media that they’ll cancel their Disney Plus subscriptions or boycott Disney parks. Meanwhile, in a show of theatrics unlikely to see any real follow-through, Republican lawmakers threatened to <a href=\"https://www.miamiherald.com/news/local/news-columns-blogs/fabiola-santiago/article259897070.html\">revoke Disney’s legal privileges</a> in the state in retaliation. On top of that, a <a href=\"https://www.vice.com/en/article/v7d8ya/right-wing-grifters-continue-to-pretend-disney-is-woke\">patently homophobic rally</a> was held at Disney Studios in Burbank last week, and right-wing media has seized on the chance to blast the company.</p><p id=\"49JAEt\">While Disney has <a href=\"https://www.theverge.com/2022/3/30/23001747/disney-dont-say-gay-bill-florida-desantis\">publicly said it would like to see</a> the “Don’t Say Gay” bill repealed, the walkout organizers say that as of last week, there had been no other communication by Disney’s leadership to employees about how it’s actively working toward that goal. The group said that employees at Disney “are still incredibly frustrated.”</p><p id=\"60zGRh\">“We are doing our best to be patient and wait to see what leadership will do next, but that patience can only last so long,” the organizers told <em>The Verge</em>. “A lot of employees’ words and feelings have been carried directly into meetings with leadership at all levels, from specific sectors all the way to the C-suite.” </p><p id=\"ahMOV0\">While the group maintains that executive leadership has engaged with employees about their frustration with the company over its response to the bill, they maintain there was “a significant lack of transparency — the meetings seem to have happened with very little awareness amongst the broader employee base.”</p><p id=\"DnTmPG\">“Those participating were hand-selected by HR staff, and the list was not announced or disclosed, so the promise people were seeing in the idea of a ‘listening tour’ has waned greatly, with many feeling left out of the conversation. We can’t even be sure that those most affected by this law were actually a part of the ‘tour,’” the organizers told <em>The Verge</em>.</p><p id=\"DujIGC\">One could argue that individually, it’s unlikely that many of these management shifts would see Chapek at odds with employees at practically every level of the entire company. But taken as a whole, his missteps are impossible to ignore.</p><p id=\"CMCo6j\">Chapek’s contract is up in February of 2023. Increasingly, it appears he’ll have more than just The Walt Disney Company’s pandemic bounce-back to answer for come next year.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YN3u6ZL5he52WyFGAeyfyqHPxmw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16025342/acastro_190411_1777_Disney_Streaming_0003.0.jpg",
  "description": "The latest in a series of public blunders.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}