{
  "title": "DJI may be working a new FPV drone that you can fly indoors",
  "url": "https://www.theverge.com/2022/5/16/23076686/dji-new-fpv-drone-fly-indoors-avata",
  "date": "2022-05-16T22:15:40.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/c7WHHIkl_rpC5UV5yl_h5zYJtQU=/342x0:3342x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70876430/dji_fpv_drone_leak_1.0.jpeg\" />        <figcaption><em>The new drone will be made for indoor flight.</em> | Image: <a class=\"ql-link\" href=\"https://twitter.com/DealsDrone/status/1525772436268285952\" target=\"_blank\">@DronesDeal via Twitter</a></figcaption>    </figure>  <p id=\"qdvzPo\">New leaks suggest that DJI is working on a new FPV (first-person view) drone that you can fly indoors (via <a href=\"https://gizmodo.com/indoor-drone-dji-fpv-cinewhoop-avata-leak-mini-3-pro-1848931610\"><em>Gizmodo</em></a>). Reliable tipsters <a href=\"https://twitter.com/DealsDrone/status/1525772436268285952\">@DealsDrone</a> and <a href=\"https://twitter.com/OsitaLV/status/1525804488850030594\">@OsitaLV</a> have come forward with leaked images and details about a smaller, more compact drone that may be arriving between July and August.</p><p id=\"wD4MEv\">The drone, supposedly called Avata, will weigh 500 grams, which means users will have to register it with the Federal Aviation Administration (FAA) if they choose to fly it outside (drones that weigh more than 250 grams must be registered with the FAA). Renders from @DealsDrone show that the Avata could come with ducted propellers to help prevent any damage to the device when it (inevitably) runs into something during an indoor flight. It features a camera that @DealsDrones expects to be just as good as the <a href=\"https://www.theverge.com/23064603/dji-mini-3-pro-drone-price-specs-release-date\">recently released DJI Mini 3 Pro</a>, as well as “greatly improved” battery life.</p><div id=\"kcUTnY\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Avata is compact and weighs about 500g<br>Can fly indoors<br>The photo quality is much better (guess that the Mini 3 Pro is the same)<br>Greatly improved battery life<br>Manual mode is not supported<br>Head chase mode<br>Vibration function  <br>Touchpad for glasses menu<br>Glasses can connect to phone <a href=\"https://t.co/WUqpjXXEnK\">pic.twitter.com/WUqpjXXEnK</a></p>— 航拍世家 打手 (@DealsDrone) <a href=\"https://twitter.com/DealsDrone/status/1525772436268285952?ref_src=twsrc%5Etfw\">May 15, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"wv484A\">The Avata is also rumored to come with FPV goggles — a necessity for FPV drones — that give you a first-person perspective of where your drone is going while you pilot it. Although <a href=\"https://www.theverge.com/22308345/dji-fpv-review-first-person-drone-price\">DJI released its first-ever FPV drone</a> last year, it isn’t the most suitable for indoor flight.</p><p id=\"WD0gsS\">As <em>Gizmodo</em> points out, it looks like the Avata is meant to be a cinewhoop-style drone, or a drone with a camera that’s usually custom-built for maneuverability in small, indoor spaces. The name “cinewhoop” is a portmanteau of tiny whoop (a brand name that has evolved into a term for small drones) and “cinematic” for those amazing movie-like shots you can get with this kind of drone (like <a href=\"https://www.theverge.com/2021/3/9/22321576/fpv-drone-footage-short-film-bowling-alley-bryant-lake-bowl\">this epic sequence captured in a bowling alley</a>). </p><p id=\"tX4R7B\">In April, GoPro actually made a camera specifically for cinewhoops and other FPV drones: <a href=\"https://www.theverge.com/23021285/gopro-hero10-black-bones-drones-fpv\">the GoPro Hero 10 Black Bones</a>. GoPro requires users to solder this ultra-lightweight camera to their drone, fulfilling a huge demand for a bare-bones camera suitable for flight. If DJI does launch a readymade cinewhoop drone, this would eliminate the need for tinkering completely (at least for those who don’t want to create a DIY build) and open up the niche to a lot more people who aren’t so technically savvy.</p><p id=\"AvgI4h\"></p><p id=\"BlRcmv\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wA4fBgjVFjxCnxFdOcc2ja2KeDk=/0x130:3571x2000/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23482373/dji_fpv_drone_leak_1.jpeg",
  "description": "A small, agile drone with meant for indoor flight",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}