{
  "title": "DJI Mini 3 Pro leak shows obstacle avoidance sensors and a slightly bigger battery",
  "url": "https://www.theverge.com/2022/4/2/23007680/dji-mini-3-pro-leak-obstacle-avoidance-sensors",
  "date": "2022-04-02T17:51:09.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PnaFyq6I_kLYk73915VOHmyP4Q8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70702646/vpavic_201214_4405_0360.0.jpg\" />        <figcaption>Photo by Ryan Loughlin</figcaption>    </figure>  <p id=\"hxD1aH\">The rumored DJI Mini 3 Pro may come with some substantial upgrades over its non-Pro predecessor, including obstacle avoidance sensors and a larger battery, as indicated by leaked images and a video of the new drone (via <a href=\"https://www.techradar.com/news/huge-dji-mini-3-pro-leak-reveals-all-about-exciting-beginner-drone\"><em>TechRadar</em></a>).</p><p id=\"2eA84x\">Self-described DJI investigator Jasper Ellens posted the leaked <a href=\"https://twitter.com/DealsDrone/status/1510198441468923904?s=20&amp;t=ApUMJFAhxYgm33fUwiqkjg\">pictures</a> and <a href=\"https://twitter.com/JasperEllens/status/1510156231096385537\">video</a> to Twitter. There are two large sensors on the front of the device to help avoid obstacles, as well as two downward-facing sensors to prevent ground collisions. If true, this is a welcome addition to the beginner-friendly drone series — <a href=\"https://www.theverge.com/22277238/dji-mini-2-drone-review-price-specs-features\">the DJI Mini 2</a> only has ground detection sensors.</p><div id=\"3zc1h4\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is the new <a href=\"https://twitter.com/hashtag/DJI?src=hash&amp;ref_src=twsrc%5Etfw\">#DJI</a> <a href=\"https://twitter.com/hashtag/Mini3Pro?src=hash&amp;ref_src=twsrc%5Etfw\">#Mini3Pro</a>. It has a bigger 2453 mAh battery. Improved 3-axis gimbal and camera E24 F1.7. Huge front and ground sensors and … new backwards sensors. Weight: 249g. Time to sell your Mini 2. I expect a announcement in a few weeks. <a href=\"https://t.co/CvW9YfmkRg\">pic.twitter.com/CvW9YfmkRg</a></p>— Jasper Ellens - 27 Leaks (@JasperEllens) <a href=\"https://twitter.com/JasperEllens/status/1510138128333430786?ref_src=twsrc%5Etfw\">April 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"VhNcx4\">In terms of its camera, the leak shows a lens with a maximum aperture of f/1.7, which should result in a brighter image and improved low-light performance when compared to the f/2.8 lens on the DJI Mini 2. The camera’s mounted to a redesigned three-axis gimbal that’s placed off to one side, potentially allowing users to shoot vertical videos suitable for posting on social platforms.</p><p id=\"X3s29M\">The DJI Mini 3 Pro may have a slightly longer flight time, as the leak indicates an upgraded 2,453mAh battery. For comparison, the DJI Mini 2 has a 2,250 mAh battery and a flight time of 31 minutes, so we may see a small improvement with the Mini 3 Pro.</p><p id=\"ogaWGb\">Despite the upgrades, the DJI Mini 3 Pro will still maintain its sub-250 gram weight, letting users fly it without having to register it with the Federal Aviation Administration. It’s unclear whether the DJI Mini 3 Pro will drop its entry-level price tag for something a bit more expensive to go along with its new “Pro” label and features, or if DJI plans to release a non-Pro model as well. </p><p id=\"6y9h06\">A lot of questions still remain about the rumored drone — like its frame rate or Ocusync 3.0 support — but we may not have to wait much longer to find out. Ellens predicts DJI may announce the drone in the next few weeks.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/K6LxfB8ZMRGaAEKJvW6W5pt9YFY=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22296015/vpavic_201214_4405_0360.jpg",
  "description": "The DJI Mini 3 Pro may come with forward-facing sensors.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}