{
  "title": "DJI insisted drone-tracking AeroScope signals were encrypted — now it admits they aren’t",
  "url": "https://www.theverge.com/2022/4/28/23046916/dji-aeroscope-signals-not-encrypted-drone-tracking",
  "date": "2022-04-28T19:34:41.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/T8yUt-DQF8svQlysvQLP1vwX5xY=/0x0:1800x1200/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70806471/STRUCTURE_4_00_03_16_01_Still005_sized.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"KiM2n4\">Last month, Ukraine Vice Prime Minister Mykhailo Fedorov accused DJI of helping Russia to kill Ukrainian civilians <a href=\"https://www.theverge.com/22985101/dji-aeroscope-ukraine-russia-drone-tracking\">in an unusual way</a> — by allowing Russia to freely use a drone-tracking system called DJI AeroScope to target the exact location of Ukrainian drone pilots and, allegedly, kill them with mortar strikes and missiles. </p><p id=\"D5o7YE\">So we wrote <a href=\"https://www.theverge.com/22985101/dji-aeroscope-ukraine-russia-drone-tracking\">an in-depth explainer on what DJI AeroScope actually is</a>, how it works, what it was designed for, and what, if anything, DJI could actually do to prevent people from getting killed using its tech. But a hacker pointed out that DJI wasn’t being truthful with us on at least one point — and the company is now admitting it. The AeroScope signals broadcast by every modern DJI drone aren’t actually encrypted, DJI now says.</p><p id=\"GhVdff\">This means: governments and others with technical ability may not need an AeroScope to see the exact position of every DJI drone and the exact location of every pilot nearby.</p><p id=\"nxECVt\">To be clear, both DJI spokesperson Adam Lisberg and drone forensics expert David Kovar told us that these signals were encrypted. And when hacker Kevin Finisterre suggested to us that was wrong, we checked with DJI <em>again. </em>It was only after Finisterre <a href=\"https://twitter.com/d0tslash/status/1509414290922614784\">repeatedly</a> <a href=\"https://twitter.com/d0tslash/status/1516397818273013761?s=21&amp;t=vsW55pa31x5iB-2bpaQRYA\">debunked</a> the claim that DJI admitted to <em>The Verge</em>, almost a month later, that it wasn’t actually true. </p><div id=\"NtoPho\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">Long story short it means that <a href=\"https://twitter.com/adamlisberg?ref_src=twsrc%5Etfw\">@adamlisberg</a> needs to provide an updated comment to <a href=\"https://twitter.com/StarFire2258?ref_src=twsrc%5Etfw\">@StarFire2258</a> stating that his engineering staff misspoke &amp; that <a href=\"https://twitter.com/DJIFlySafe?ref_src=twsrc%5Etfw\">@DJIFlySafe</a> <a href=\"https://twitter.com/DJIEnterprise?ref_src=twsrc%5Etfw\">@DJIEnterprise</a> <a href=\"https://twitter.com/DJIGlobal?ref_src=twsrc%5Etfw\">@djiglobal</a> <a href=\"https://twitter.com/DJISupport?ref_src=twsrc%5Etfw\">@djisupport</a> <a href=\"https://twitter.com/hashtag/AeroScope?src=hash&amp;ref_src=twsrc%5Etfw\">#AeroScope</a> <a href=\"https://twitter.com/hashtag/DroneID?src=hash&amp;ref_src=twsrc%5Etfw\">#DroneID</a> <a href=\"https://twitter.com/hashtag/RemoteID?src=hash&amp;ref_src=twsrc%5Etfw\">#RemoteID</a> packets are NOT *encrypted*. <a href=\"https://t.co/7y9xodwIoh\">https://t.co/7y9xodwIoh</a> <a href=\"https://t.co/FJn1a2QZyV\">pic.twitter.com/FJn1a2QZyV</a></p>— KF (@d0tslash) <a href=\"https://twitter.com/d0tslash/status/1516397818273013761?ref_src=twsrc%5Etfw\">April 19, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"lw9MTq\">DJI’s Lisberg says it’s his fault but also tells us that his R&amp;D contacts in China repeatedly told him it was encrypted and that it took senior managers to step in and admit it wasn’t true. </p><p id=\"E13iMG\">It’s not entirely surprising that AeroScope signals are unencrypted, by the way: DJI originally envisioned Drone ID (now known as AeroScope) as a technology other drone companies would use, too. And governments like the United States are already planning to <a href=\"https://www.theverge.com/2020/12/28/22203398/faa-remote-id-rules-location-night-over-people\">mandate that your drone broadcasts your physical location by 2023</a> — it won’t be optional, and it’s not clear to me if those signals will be encrypted either.</p><p id=\"EkgxmE\">We pressed Lisberg on some of the other claims he made in the piece since we want to ensure other information is correct. There aren’t currently any other corrections, but he did admit that, yes, DJI could prematurely revoke an AeroScope certificate to disable it, though that would only affect stationary units that are connected to its own AWS servers — and that it could also theoretically see the GPS positions of those AeroScope receivers that way (though likely not the ones used by Russian military or the portable ones which do not connect to AWS at all).  </p><p id=\"4bbKga\">Lisberg also says, “I have been once again told that Sentinel and Supervisor do not exist,” referring to <a href=\"https://github.com/MAVProxyUser/UserPortrait\">an ominous-sounding program</a> that Finisterre found <a href=\"https://arstechnica.com/information-technology/2017/11/dji-left-private-keys-for-ssl-cloud-storage-in-public-view-and-exposed-customers/\">during a DJI data breach in 2017</a>. Finisterre has suggested that the program is evidence that, at least in China, DJI is mining data on its users, but DJI has denied that, telling <em>The Verge</em> it was simply a proposal on how DJI could theoretically do some targeted advertising but that it never actually happened.</p><p id=\"chwYmx\">Finisterre has also pointed out that <a href=\"https://twitter.com/d0tslash/status/1511215231011368965\">DJI did have a way</a> to remotely turn off the AeroScope signals that its drones broadcast until it <a href=\"https://twitter.com/d0tslash/status/1510800840658931716\">disabled that</a> in later updates. It appears <a href=\"https://twitter.com/Bin4ryDigit/status/1512785076932726791\">there may still be a way</a> to send commands to the drone to mask a pilot’s coordinates, though.</p><p id=\"hTwnsW\">Yesterday, <a href=\"https://www.theverge.com/23045059/dji-halt-drone-shipments-russia-ukraine-war\">DJI announced it’s halting all shipments of products and all after-sales support</a> for both Russia and Ukraine.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SFDzmhnnyGiia78s505DWZFNEKI=/0x129:1800x1071/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9673105/STRUCTURE_4_00_03_16_01_Still005_sized.jpg",
  "description": "It took a hacker to reveal DJI told us the wrong thing.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}