{
  "title": "DJI is halting all shipments to Russia and Ukraine to slow weaponization of drones",
  "url": "https://www.theverge.com/23045059/dji-halt-drone-shipments-russia-ukraine-war",
  "date": "2022-04-27T19:11:15.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/i6l0SLCZHbQqpVQ2RwmMxn12us8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70801174/acastro_220322_5097_0001.0.jpg\" />        <figcaption>Photography by Vjeran Pavic / Treatment by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"LjdwWU\">Chinese drone maker DJI has confirmed to <em>The Verge </em>that it is halting all shipments of its products to both Russia and Ukraine and will no longer provide aftersales support because it’s worried about its products being used for combat purposes during Russia’s invasion. </p><p id=\"6iYCqz\">It’s the first concrete action China’s DJI has taken to address the war <a href=\"https://www.theverge.com/22985101/dji-aeroscope-ukraine-russia-drone-tracking\">after Ukraine Vice Prime Minister Mykhailo Federov accused the company</a> of helping Russia kill Ukrainian civilians in a roundabout fashion (by using DJI’s AeroScope drone detection system to target Ukrainian pilots on the ground, something DJI apparently never anticipated). Both countries are using DJI drones for reconnaissance, and we’ve seen reports of Ukraine turning some of them into makeshift weapons. </p><aside id=\"hYU7DY\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"DJI drones, Ukraine, and Russia — what we know about AeroScope\",\"url\":\"https://www.theverge.com/22985101/dji-aeroscope-ukraine-russia-drone-tracking\"}]}'></div></aside><p id=\"aS6U7G\">In late March, DJI told <em>The Verge </em>that it had not stopped sales in Russia or Ukraine and didn’t intend to, despite the <a href=\"https://som.yale.edu/story/2022/over-400-companies-have-withdrawn-russia-some-remain\">hundreds of other companies that had withdrawn from Russia in protest</a>. “For 15 years, DJI has tried our best to stay out of geopolitics,” spokesperson Adam Lisberg told us. </p><p id=\"fJCBCI\">But <a href=\"https://www.reuters.com/technology/chinese-drone-maker-dji-suspends-business-activities-russia-ukraine-2022-04-26/\"><em>Reuters </em>reported today</a> that DJI has decided to halt all sales to both countries, maintaining a neutral stance, and while DJI isn’t actually in charge of sales in those regions (existing products may continue to be sold), the company confirms that shipments and support will cease. That wouldn’t keep Russia or Ukraine from using existing AeroScope drone tracking devices either, but there’s a possibility that DJI may not reauthorize any AeroScope receivers whose license expires during this period. </p><p id=\"EtiGOe\">“DJI has taken this action not to make a statement about any country, but to make a statement about our principles. DJI abhors any use of our drones to cause harm, and we are temporarily suspending sales in these countries in order to help ensure no one uses our drones in combat,” Lisberg tells us today.</p><p id=\"g6Yxrb\">Lisberg says the company had already been asking dealers not to sell to customers who would use drones for combat purposes — but they’ve seen products make it into the warzone anyhow, so this is an extra step. He also says DJI understands that it’s not a foolproof way to prevent drones from being used for military purposes — again, I’ll point out that DJI does not control sales in these countries — and that clamping down on shipments and support may penalize drone pilots in both countries using them for benign purposes. </p><p id=\"OXFeTt\">“But we have to do something, because we don’t like seeing anyone use our products to hurt people,” says Lisberg. </p><p id=\"YOBI1R\">DJI’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.dji.com%2Fnewsroom%2Fnews%2Fdji-statement-on-sales-compliance-efforts&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23045059%2Fdji-halt-drone-shipments-russia-ukraine-war\" rel=\"sponsored nofollow noopener\" target=\"_blank\">statement on its newsroom page</a> doesn’t go nearly as far, simply saying that DJI is “internally reassessing compliance requirements in various jurisdictions” and that it’s suspending business in Russia and Ukraine “pending the current review.”</p><p id=\"bHDiOD\">We don’t have enough data to know whether this move might hurt one side more than the other, but I’ll point out that Ukraine is the one publicly fundraising to afford these inexpensive consumer DJI drones to help defend its country.</p><p id=\"Sa7LLs\">This week, the Biden administration called for Congress to <a href=\"https://www.theverge.com/2022/4/25/23041869/white-house-biden-admin-counter-drone-legislation-plan-tracking\">let more agencies get access to drone-tracking tech</a>, including state and local police. </p><p id=\"WDdIvq\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/anmqxq1_5UiKnzz7q0E1vhTHROQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23337415/acastro_220322_5097_0001.jpg",
  "description": "After previously saying it wouldn’t withdraw from Russia",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}