{
  "title": "DJI drones, Ukraine, and Russia — what we know about AeroScope",
  "url": "https://www.theverge.com/22985101/dji-aeroscope-ukraine-russia-drone-tracking",
  "date": "2022-03-23T10:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FcLxFyzmpqj7IynLpBk2xrls8Ho=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70660436/acastro_220322_5097_0001.0.jpg\" />        <figcaption>Photography by Vjeran Pavic / Treatment by Alex Castro / The Verge</figcaption>    </figure>  <p>Why DJI’s drones are a hot-button issue in the Ukraine-Russia war</p> <p class=\"p--has-dropcap p-large-text\" id=\"uxKtGu\">Last week, Ukraine accused DJI — the world’s leading drone maker — of letting Russia target innocent civilians with missiles using DJI drone technology. “Are you sure you want to be a partner in these murders?” <a href=\"https://twitter.com/FedorovMykhailo/status/1504068644195733504/photo/2\">tweeted Ukraine Vice Prime Minister Mykhailo Fedorov</a> last Wednesday. “Block your products that are helping Russia to kill the Ukrainians!” </p><p id=\"8seEN9\">Reading those words, you might imagine DJI is now shipping killer drones to Russia or perhaps that Russia is using DJI drones as spotters for separate missile systems of its own. But that’s not even <em>remotely</em> what Ukraine’s request is about. It’s actually about DJI AeroScope, a system for locating drones and their operators — which Russia is now allegedly using to find Ukrainian drone pilots and wipe them out. </p><p id=\"gBGaEe\">DJI AeroScope was originally designed for public safety: if a rogue DJI drone gets near an airport runway, a stadium full of people, or, say, a political rally, law enforcement can warn people and find those drones. As part of the AeroScope system, every DJI drone broadcasts an encrypted signal that specialized receivers can use to decipher the drone’s position and the position of its pilot. If police need to monitor DJI drone activity in an area and track down their pilots, it’s as simple as planting a receiver and monitoring the signals.</p><div><div id=\"5dX9aM\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In 21 days of the war, russian troops has already killed 100 Ukrainian children. they are using DJI products in order to navigate their missile. <a href=\"https://twitter.com/DJIGlobal?ref_src=twsrc%5Etfw\">@DJIGlobal</a> are you sure you want to be a partner in these murders? Block your products that are helping russia to kill the Ukrainians! <a href=\"https://t.co/4HJcTXFxoY\">pic.twitter.com/4HJcTXFxoY</a></p>— Mykhailo Fedorov (@FedorovMykhailo) <a href=\"https://twitter.com/FedorovMykhailo/status/1504068644195733504?ref_src=twsrc%5Etfw\">March 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"ZHDDFb\">Even in peacetime, that idea might sound a little bit risky: what if a bad actor gets access to an AeroScope receiver and goes around harassing, assaulting, or stealing from people whose eyes legally <a href=\"https://www.theverge.com/22589429/how-to-fly-drone-united-states-usa-trust-faa\">have to be glued to their drones</a> in the sky? That’s why DJI says they’re only sold to valid law enforcement and security agencies. </p><p id=\"iJNQmk\">But DJI didn’t plan for what might happen when a valid buyer pairs them with a guided missile battery in wartime. Now that Ukrainian civilians and their consumer-grade drones <a href=\"https://www.washingtonpost.com/business/ukrainian-drone-enthusiasts-sign-up-to-repel-russian-forces/2022/03/04/432a0bc4-9bf7-11ec-9987-9dceee62a3f6_story.html\">have been enlisted to defend against the Russian army</a>, a deadly and possibly unforeseen consequence of Aeroscope may have emerged. If Aeroscope lets the Russian military know exactly where a Ukrainian drone pilot is standing, Russians could use that information to target an aerial strike at the pilot.</p><p id=\"upHyWS\">Importantly, we haven’t found any confirmed reports that’s actually happening, even if that’s the story that’s spreading around parts of the internet (often paired with footage of <a href=\"https://www.facebook.com/taras.troiak/posts/5315058891878431?__cft__%5B0%5D=AZVHue2PU3lC0Lsbr9sJukmR6Q99x13jmaDVURPCzVJj38j84pje3sW_rHURKGUvLdxDExYVhog1TCcf9cCXVtUI8Bcq3RBhvdWAI5TGu4SBRnpi1HqB8QHMYEqP0SHnv2hcHiaJ1ii6JPSJyPu3eF2XMVMcYnJ89e6Z2HmRKiXM8w&amp;__tn__=%2CO%2CP-R\">this drone pilot seemingly surviving a near miss</a>). But DJI has confirmed that some of Ukraine’s AeroScope receivers weren’t working properly, and Fedorov is now asking DJI to block Russia’s DJI gear. </p><p id=\"iCl3j7\">That’s likely a non-starter because DJI is a Chinese company, and China is broadly aligned with Russia, not Ukraine — to the point that <a href=\"https://www.cnn.com/2022/03/14/politics/us-china-russia-ukraine/index.html\">US officials now believe China might actually provide Russia with assistance</a> instead of staying neutral. DJI is <a href=\"https://www.washingtonpost.com/national-security/2022/02/01/china-funding-drones-dji-us-regulators/\">reportedly funded by the Chinese government</a> and has been repeatedly sanctioned by the United States; <a href=\"https://www.theverge.com/2021/12/16/22839970/dji-chinese-military-industrial-complex-investment-blacklist\">most recently</a>, the US Treasury named it one of eight “Non-SDN Chinese Military-Industrial Complex Companies,” and the USA has repeatedly accused it of helping China surveil its Uyghur population with drones. </p><p id=\"JeshWl\">Here’s everything we know about AeroScope, after chatting with DJI spokesperson Adam Lisberg; drone forensics expert <a href=\"https://twitter.com/dckovar\">David Kovar</a>; Brandon Lugo, director of operations at <a href=\"https://www.aerialarmor.com/\">Aerial Armor</a>, a prominent Aeroscope dealer in the US; and Taras Troiak, a DJI reseller who ran multiple <a href=\"https://mc.today/my-pervymi-privezli-drony-dji-teper-oni-pomogayut-biznesu-i-spetssluzhbam-taras-troyak-o-razvitii-industrii-dronov-v-ukraine/\">authorized DJI stores in Ukraine</a> and serves as administrator of the 15,000-strong <a href=\"https://www.facebook.com/groups/djiuaclub/\">Ukrainian UAV Owners Fan Club</a>, which claims that some of its pilots have been targeted by Russian airstrikes and even killed.</p><h2 id=\"j8p7Kv\"><strong>What is DJI AeroScope, and how does it work?</strong></h2><p id=\"4UHgey\">There are two main elements to the AeroScope system:</p><ol><li id=\"Uhz6z3\">An encrypted signal, automatically broadcast by every DJI drone sold since 2017, that provides the drone’s position, altitude, speed, direction, serial number, and the location of the pilot</li><li id=\"9tvPJL\">The receivers that can pick up those signals up to 50 kilometers (31 miles) away</li></ol><p id=\"0yga2T\">DJI primarily sells two different types of receivers: a short-range football of a “Portable Unit” with its own clamshell case, screen, antennas and batteries, and a long-range “Stationary Unit” that’s designed to jack into a giant omnidirectional outdoor antenna and needs to connect to a server via an Ethernet cable or cellular modem. </p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tp4Y5zTBzBJ77kKcprqJA-27KQo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23328638/aeroscope_diagram.jpg\">      <cite>Image: DJI</cite>      <figcaption><em>How DJI Aeroscope works, in a nutshell.</em></figcaption>  </figure></div><p id=\"UhRg3M\">There are multiple ways to set up a Stationary Unit, too: transmitting data to DJI’s public servers (hosted by Amazon’s AWS), to an owner’s private cloud, or even an offline server for security. No internet is technically required, says Aerial Armor’s Lugo, and the Portable Unit doesn’t even have the option. “You open the little Pelican case, you sit there, you monitor all the data locally,” he says. “The Ethernet port doesn’t even enable any sort of connectivity; it’s for programming only.”</p><p id=\"OTh7WH\">The Portable Unit only has a tenth of the quoted range of the Stationary Unit at 5 kilometers, but that 50km number is a stretch. In practice, DJI’s Lisberg says that 50 kilometers is “the upper bound of what I’ve heard, on a clear day with no solar flares, a totally rocking antenna, at the edge of the desert or something.” Lugo points out that smaller drones like the DJI Spark transmit more weakly, too, but that even in an urban environment, you should be able to spot a small drone a couple miles away with an AeroScope receiver.</p><p id=\"FLsdW6\">Prices seem to vary a lot: Lugo says he’s seen the Portable Unit going for $10,000 and a medium-range G8 Stationary kit sold anywhere between $25,000 and $150,000. DJI, meanwhile, says it should cost under $10,000 for a full installation. </p><p id=\"8DFusL\"><strong>Wait, are you telling me that every DJI drone is quietly broadcasting </strong><em><strong>my</strong></em><strong> position, not just my drone’s position, to anyone who buys one of these gadgets?</strong></p><p id=\"bEE0JQ\">Yes. “It’s essentially a system where the user of the drone is signing a EULA acknowledging that my information will be made available,” says Kovar. </p><p id=\"ROpIWK\">But it’s encrypted, and the decryption hardware is theoretically only sold to the good guys. “Since the start, we’ve made clear to all our dealers and distributors that Aeroscopes can only be sold to legitimate operators, police and security forces,” says Lisberg. “We hear reports now and then of a billionaire who gets one to watch their yacht or something, but by and large, those are the people using AeroScopes.”</p><p id=\"sPsREk\"><strong>Does Russia have a third, military version of the AeroScope receiver with longer range than Ukraine? </strong></p><p id=\"npv89l\">That’s what Troiak tells me explicitly, and Vice PM Fedorov seemingly implies it in his letter to DJI, too. “The Russian army uses an extended version of DJI Aeroscope which were taken from Syria,” writes Fedorov. “The distance is up to 50 km.” </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uMTsxmrq8c9b2bfD0wZlCqsryas=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23334370/938A5845_scaled.jpg\">      <cite>Image: DJI</cite>      <figcaption><em>The long-range DJI Aeroscope G16 has four Stationary Units and a giant cylindrical antenna array.</em></figcaption>  </figure></div><p id=\"lxmjp0\">But again, 50 kilometers is the same range that DJI already quotes for its Stationary Unit — when the right antennas are attached — and DJI’s Lisberg says he’s never heard of a longer-range military version. </p><p id=\"0uEAcr\">One thing that’s not in dispute: both Ukraine and Russia have access to AeroScope receivers, including the long-range Stationary versions. </p><p id=\"uxYLRC\"><strong>Did DJI disable or weaken Ukraine’s AeroScope receivers, then? </strong></p><p id=\"jndzPa\">That’s been <a href=\"https://twitter.com/vshymanskyy/status/1501966844118372356\">another accusation out of Ukraine</a>, but the evidence is shaky at best. Troiak —  the DJI reseller who appears to be acting as middleman between their operators and DJI, trying to get them fixed — showed me screenshots of an email conversation that allegedly depicts several AeroScope receivers stationed at nuclear power plants mysteriously going offline after Russia invaded Ukraine. But Troiak could not provide better evidence, suggesting his sources might be killed or jailed if he put them in touch, and Vice PM Fedorov’s office didn’t respond to requests for comment. </p><div class=\"c-float-right c-float-hang\"><aside id=\"aqJ0M4\"><q>Accusations are flying</q></aside></div><p id=\"LyMeZN\">While DJI does confirm that some of Ukraine’s AeroScope receivers went offline, it vehemently denies that the company had anything to do with it. </p><p id=\"l9FYyS\">“All allegations that DJI has deliberately adjusted the functionality of AeroScope to help some parties or hurt other parties are absolutely, thoroughly false,” Lisberg tells <em>The Verge</em>, suggesting they might have been down because of power or internet outages instead. “Nobody credible has alleged that the technical problems we’ve been having with AeroScopes are anything other than technical problems.” </p><p id=\"Utbzm0\">And both Troiak and Lisberg agree that DJI has already helped bring some of Ukraine’s non-working AeroScope receivers back online. “Others, we have not been able to diagnose or fix, but we continue to work with their operators,” DJI’s Lisberg says.</p><p id=\"3sryFL\"><strong>Why can’t DJI or Ukraine just shut off the Aeroscope signals so pilots aren’t targeted? </strong></p><p id=\"TNqiKo\">First off, this isn’t something that DJI can switch off over the internet — the drones themselves are broadcasting the AeroScope signals <em>locally </em>over standard 2.4GHz and 5.8GHz frequencies to any nearby receiver that’s listening. They’re not being sent over the internet.</p><p id=\"pp4cdG\">And DJI says drone owners can’t turn them off either. “This is all encoded in a data packet that’s part of the same data transmission you can use to command and control the drones,” says Lisberg. “You cannot shut that off without also losing control of the drone.”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"dji phantom 3 drone\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EHuFHf_a5jV7XUlhh8dzq7toohU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/3948892/DJI_Phantom_3_Skyscraper.0.jpg\">      <figcaption><em>Even some of DJI’s Phantom 3 drones are listed as compatible with Aeroscope.</em></figcaption>  </figure></div><p id=\"EcUvPq\">All that said, AeroScope <em>was </em>retroactively added to some early DJI drones as a firmware update, so I imagine it’s theoretically possible a new firmware update could turn it off again. But that might defeat the public safety purpose of AeroScope since DJI can’t guarantee only resistance fighters would receive the firmware. It could allow bad actors to cloak their drones as well. </p><p id=\"JY85Uk\">But perhaps just as importantly, Ukraine isn’t actually asking DJI to shut off the AeroScope signals — remember, Ukraine is using AeroScope receivers as well<em>, </em>and it wants them turned <em>on</em>. </p><p id=\"Ia3HLP\"><strong>So what is Ukraine actually asking for?</strong></p><p id=\"f6srrl\">Vice PM Fedorov wants DJI to cough up information about every DJI product in Ukraine — including where they were purchased and a map of their locations — and to explicitly block DJI products from functioning if they came from Russia, Syria and Lebanon. </p><p id=\"J7xs8Y\"><strong>Does DJI actually have that map of where its products are? </strong></p><p id=\"g21MYE\">The company says no. “We have no way of tracking where an AeroScope is,” says Lisberg. “We sell mostly through distributors, which sell to dealers, which sell to the public... there’s a big gap between the information people think we have on our users and what we actually have on our users,” he adds, when I ask if DJI might at least have sales data on its drones. </p><p id=\"oYeq2n\">Aerial Armor’s Lugo backs that up. “They don’t have immediate visibility, if any, into the clients we sell to... they might know we have an NFL stadium, but they don’t know which one or where it’s at.” </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9UylJqkqvvWeptYCGj01M0ygYig=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9673105/STRUCTURE_4_00_03_16_01_Still005_sized.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The DJI Aeroscope Portable Unit.</em></figcaption>  </figure></div><p id=\"6wydVw\"><strong>Can’t DJI see the positions of the drones? Isn’t it tracking flight data too?</strong></p><p id=\"IuP3Nb\">That was the theory in 2017, but DJI says it’s not happening at all.</p><p id=\"BLpoOM\">“I was one of the people five years ago or so who was accusing them of doing that, and at the time, they might well have been. There were strong indications that telemetry data was flowing off of the drone and through the app to some domains, likely controlled by DJI,” says Kovar, the drone forensics expert.</p><p id=\"9QAluL\">The short version: in 2017, a hacker named Kevin Finisterre discovered that DJI had left some of its Amazon AWS cloud data publicly accessible, <a href=\"https://arstechnica.com/information-technology/2017/11/dji-left-private-keys-for-ssl-cloud-storage-in-public-view-and-exposed-customers/\">with<em> Ars Technica</em> writing</a> that it included “flight logs from accounts associated with government and military domains.” That’s <a href=\"https://www.theverge.com/2017/9/6/16226698/dji-security-army-data-privacy-local-mode-bug-bounty\">when the US Army got suspicious and began to ground</a> its own DJI drones.</p><div><aside id=\"s9uuCB\"><q>“it was not done, those programs do not exist”</q></aside></div><p id=\"a0UOiV\">In 2020, Finisterre uploaded <a href=\"https://github.com/MAVProxyUser/UserPortrait\">another chunk of data from that same breach</a>, which appears to show an online heatmap of drone activity around the globe — something DJI theoretically wouldn’t be able to generate without tracking of some sort. (The ominous name “DJI Sentinel &amp; Supervisor” didn’t help.) </p><p id=\"JIA59y\">But DJI’s Lisberg says that “Sentinel &amp; Supervisor” never actually existed: it was an internal proposal that didn’t go anywhere. “[Finisterre] came across a presentation someone put together about something that could be done; it was not done, those programs do not exist,” he says. </p><p id=\"ESY66b\">And DJI firmly says it doesn’t have your flight data unless you upload it yourself. Though Finisterre has suggested that the DJI Fly app might do that automatically with its “Auto-sync Flight Records” feature, I was able to confirm that at least the current US version of the app has that feature turned off by default. </p><p id=\"ypHEmX\">While the app <em>does</em> push you into sharing the location of your own drone, hardware info, and your device’s “daily diagnostic and usage data,” you can opt out of all of those, and Kovar says he’s convinced that the company’s not siphoning off flight info now. <a href=\"https://viewpoints.dji.com/blog/no-evidence-of-unexpected-data-transmission\">Repeated independent security audits</a> by consulting firms and US government agencies also found nothing of the sort.</p><div class=\"c-float-left c-float-hang\"><div id=\"Q5XSpR\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Breaking: Yet another security examination, this time by FTI Consulting, has validated DJI's security features, concluding that no drone data is transmitted to DJI or elsewhere:<a href=\"https://t.co/O98gDBzQIM\">https://t.co/O98gDBzQIM</a> <a href=\"https://t.co/KirWcJV8jY\">pic.twitter.com/KirWcJV8jY</a></p>— Brendan Schulman (@dronelaws) <a href=\"https://twitter.com/dronelaws/status/1303690551154348034?ref_src=twsrc%5Etfw\">September 9, 2020</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"N0bxBQ\">“People have looked at the traffic, and they have been unable to come to any conclusion that there’s telemetry data flowing across the link anymore,” he says, adding that DJI has managed to convince many law enforcement agencies since 2017 that their data is safe as well. </p><p id=\"Go10vD\"><strong>Couldn’t DJI access AeroScope receivers based in Ukraine to find the data Ukraine wants? </strong></p><p id=\"zNmcHm\">Theoretically — <em>if</em> Russia or Ukraine set their Aeroscope receivers to upload their data to DJI’s public AWS cloud servers, and <em>if</em> DJI had access, then DJI would have the same information that Ukraine’s own receivers can already get on the ground. It depends on where the data is hosted. “If a stationary AeroScope customer uses our AWS server, it is theoretically possible for us to access it,” says Lisberg. And Lugo says that in his experience, AeroScope dealers tend to put their clients on the cheaper AWS “demo cloud” more often than not.</p><p id=\"TiOlbr\">That said, some of the AeroScope stations upload to a private cloud rather than AWS — and that’s the kind that you’d be likely to use to secure military data. They would only connect to DJI’s servers once a year to get a new digital certificate so they can operate, according to Kovar and Lugo.</p><p id=\"HDEbsW\">Even if DJI did have the data, it wouldn’t give it to Ukraine, says Kovar, because that would be providing military intelligence to one side of the war. “It’s a request DJI is not going to go along with because DJI is a Chinese company, and Russia is a Chinese ally.” </p><p id=\"mwti0D\"><strong>If the AeroScope receivers need a digital certificate to work, couldn’t DJI just shut them off? </strong></p><p id=\"W9iWuo\">Perhaps. While DJI tells me there’s no explicit kill switch — “it was not something that we contemplated,” says Lisberg — Lugo confirms that an AeroScope sensor will drop offline if its certificate expires, after repeatedly warning its owners that it’s time to pay up. </p><p id=\"Qe5GFO\">But it’s not clear if DJI could revoke a certificate prematurely, and they otherwise last an entire year before they expire. Lugo says the Portable Units don’t require one at all, and since many Stationary Units aren’t connected to the internet, it wouldn’t be possible to send a signal to cut them off early. </p><p id=\"AOC0lW\">Either way, shutting down the AeroScope receivers is not what Ukraine is asking for, and DJI is trying to maintain a neutral stance anyhow. </p><p id=\"SC9C0R\"><strong>Couldn’t DJI establish a neutral no-fly zone for its drones over Ukraine? </strong></p><p id=\"sebsOS\">Yes, but not a particularly effective one. DJI has the ability to set up geofences, and it’s one of the few things DJI has actually offered to do in response to Ukraine’s ask — but as DJI points out, it’s not foolproof. </p><div class=\"c-float-right c-float-hang\"><div id=\"VKo40v\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"und\" dir=\"ltr\"> <a href=\"https://t.co/ZoCXQIDOyt\">pic.twitter.com/ZoCXQIDOyt</a></p>— DJI (@DJIGlobal) <a href=\"https://twitter.com/DJIGlobal/status/1504206884240183297?ref_src=twsrc%5Etfw\">March 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"OzvsxJ\">Russian and Ukrainian pilots could dodge the geofence by not installing the latest software update. “There are software hacks that disable most of that,” too, says Kovar. Pilots could also physically block the antennas from seeing satellite signals or disable GPS positioning entirely — which is actually what <a href=\"https://www.facebook.com/100001231196056/posts/5315058891878431/?d=n\">Troiak is already recommending Ukrainian drone pilots do</a> to avoid getting spotted by Russia’s AeroScope sensors. Those drones would still broadcast an AeroScope signal, but it wouldn’t accurately provide the exact coordinates of a drone or its pilot.</p><p id=\"5H992q\"><strong>How are Ukrainians using their DJI drones in wartime, anyhow? </strong></p><p id=\"KPDkFU\">“Civilians have been using the aerial cameras to track Russian convoys and then relay the images and GPS coordinates to Ukrainian troops,” <a href=\"https://apnews.com/article/russia-ukraine-kyiv-technology-business-europe-47dfea7579cedfe65a70296eb0188212\">according to the <em>Associated Press</em></a><em>. </em>While there have also been reports on <a href=\"https://nypost.com/2022/03/10/ukrainians-develop-drone-that-drops-molotov-cocktails/\">a drone that can drop Molotov cocktails</a>, the pictures only show it dropping a beer bottle. “I think it’s mostly aspirational,” says Kovar, while adding how ISIS and others have indeed<em> </em>used DJI products to drop 40mm grenades in the past.</p><p id=\"NFWfQO\">Nevertheless, Ukraine does have some history with makeshift drone weaponry. In 2018, <em>Smithsonian Magazine</em> reported on <a href=\"https://www.smithsonianmag.com/air-space-magazine/ukraines-drones-180967708/\">the custom-made “fighting drones of Ukraine,”</a> and the Ukrainian National Guard was reportedly using DJI Mavic 2 drones to direct airstrikes and drop homemade bombs in 2020, <a href=\"https://coffeeordie.com/drone-war-ukraine/\">according to <em>Coffee or Die</em></a>. </p><p id=\"6JE1kM\">DJI drones aside, Ukraine has reportedly <a href=\"https://apnews.com/article/russia-ukraine-middle-east-africa-libya-europe-ecb9e820ea4bddb4464d7e8cb40e82fc\">also been using inexpensive military-grade drones from Turkey</a> that drop laser-guided bombs. The US is sending <a href=\"https://www.axios.com/switchblade-kamikaze-drones-ukraine-russia-b7e1be35-5fce-497a-b11e-e6bcab8d2cad.html\">100 “Switchblade” kamikaze drones</a> to Ukraine as well.</p><p id=\"CpKtvY\"><strong>Has DJI stopped sales in either Russia or Ukraine?</strong></p><p id=\"QVKtTv\">No. “We’ve always told our distributors and our dealers, you have to follow any applicable export control laws of any country where you’re operating and the US... we’ve reemphasized that guidance since this began,” says Lisberg.</p><p id=\"InMWXm\">Stopping sales of AeroScope receivers wouldn’t necessarily deter the Russian military from tracking down these drones, anyhow. Troiak believes Russia already has hundreds of them in the country. And, “state-level militaries have probably figured out how to decrypt that information as well,” says Kovar. </p><p id=\"jb7ur3\"><a href=\"https://som.yale.edu/story/2022/over-400-companies-have-withdrawn-russia-some-remain\"><strong>Over four hundred companies have withdrawn from Russia in protest</strong></a><strong>. Will DJI? </strong></p><p id=\"063zi9\">No.</p><p id=\"1A1asa\">“For 15 years, DJI has tried our best to stay out of geopolitics,” says Lisberg. </p><p id=\"dqlEVz\"><strong>What kind of oversight keeps an AeroScope station owner from, say, logging all nearby flights and selling that data? </strong></p><p id=\"3wOGPH\">Nothing, it seems. </p><p id=\"XqCypI\">“[A]s with all DJI products, your data is your data,” writes Lisberg. “We’re not a data company. We don’t want to be the repository for our customers’ data. Just like with our drones, we offer data hosting as a convenience for customers who want to use it and who have no security concerns about it. And once you generate data with our products, it’s yours to use and control and keep.” </p><div class=\"c-wide-block\"><div id=\"IcTbtF\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Tracking rogue drones with DJI Aeroscope|32988\" data-volume-uuid=\"9be5bf653\" data-volume-id=\"32988\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-687\" class=\"volume-video\" data-volume-player-choice=\"youtube\"></div></div></div><p id=\"bjganA\"><strong>In hindsight, is the AeroScope system a good idea? </strong></p><p id=\"rbaWi5\">DJI has said publicly that the situation in Ukraine goes to show that the company’s drones don’t belong in a warzone, and it’s hard to disagree. AeroScope clearly wasn’t designed for that. </p><p id=\"RKqnwq\">“In this situation, no, it’s clearly a bad idea,” says Kovar. “[AeroScope] is exposing people fighting for democracy, whose nation is under attack, who are trying to use a powerful, very commercially available drone to defend their country, to being identified and located by opposing forces. In that regard, it’s a horrible, horrible idea. But for law enforcement purposes, to protect our critical infrastructure and such, it was an excellent idea.”</p><div class=\"c-float-right\"><aside id=\"ichjBX\"><q>Unforeseen consequences</q></aside></div><p id=\"PEc7xa\">He likens it to other unforeseen uses of technology that have unfortunate implications for their owners, like how Toyota might be associated with images of insurgents with machine guns mounted to its pickups or Caterpillar with their bulldozers that have been used to demolish settlements in the West Bank.</p><p id=\"wJWYTB\">Lisberg also wants to be clear that DJI thought a technology like AeroScope was inevitable and saw government regulation heading its way if it didn’t produce it voluntarily. “The message was delivered clearly that if solutions like this weren’t developed, the government would go ahead and develop them and mandate them for us.” </p><p id=\"0NI1u1\">According <a href=\"https://www.bloomberg.com/news/features/2020-03-26/dji-s-drone-supremacy-comes-at-a-price?srnd=economics-vp&amp;sref=ExbtjcSG\">to a 2020 <em>Bloomberg Businessweek</em> feature</a>, one country that clearly delivered that message was China itself.</p><p class=\"c-end-para\" id=\"Y9C0rz\">DJI AeroScope is just part of a much larger conversation about who and what should be able to identify a drone and its owner, by the way — <a href=\"https://www.theverge.com/2020/12/28/22203398/faa-remote-id-rules-location-night-over-people\">new FAA Remote ID rules</a> could be shaking that up again soon.</p><aside id=\"kArcqH\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"In 2023, you won’t be able to fly most drones in the US without broadcasting your location\",\"url\":\"https://www.theverge.com/2020/12/28/22203398/faa-remote-id-rules-location-night-over-people\"}]}'></div></aside><p id=\"AES13s\"></p><p id=\"55krkJ\"></p><p id=\"ZCbNk1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/anmqxq1_5UiKnzz7q0E1vhTHROQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23337415/acastro_220322_5097_0001.jpg",
  "description": "Is Chinese drone detection tech getting Ukrainians killed?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}