{
  "title": "Doctor Strange in the Multiverse of Madness’ latest trailer is the stuff of nightmares",
  "url": "https://www.theverge.com/2022/4/6/23013118/multiverse-of-madness-trailer-billy-tommy",
  "date": "2022-04-06T15:27:22.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Elizabeth Olsen as Wanda Maximoff in Doctor Strange in the Multiverse of Madness.\" src=\"https://cdn.vox-cdn.com/thumbor/omRKwBnqFbZfQXHYWxYSUwbOBNA=/0x97:7815x5307/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70716951/SRV_12030_R.0.jpeg\" />        <figcaption>Elizabeth Holmes as Wanda Maximoff in Doctor Strange in the Multiverse of Madness. | Marvel Studios</figcaption>    </figure>  <p id=\"lSBheG\">Though <a href=\"https://www.theverge.com/2021/12/22/22850068/doctor-strange-in-the-multiverse-of-madness-first-trailer-benedict-cumberbatch-marvel\"><em>Doctor Strange in the Multiverse of Madness</em>’ earliest trailer</a> strongly implied that a Stephen Strange variant is going to be the movie’s big bad, the <a href=\"https://www.theverge.com/2022/2/15/22933001/doctor-strange-the-scarlet-witch-marvel\">Scarlet Witch’s presence in the story</a> and the way that <a href=\"https://www.theverge.com/22233625/wandavision-marvel-avengers-mcu-disney-plus-episode-review\"><em>WandaVision</em></a><em> </em>came to a close has also implied that Wanda Maximoff may have something to do with the multiverse shattering into a million pieces. While <em>Multiverse of Madness</em>’ newest ad spot doesn’t explicitly spell out how reality comes undone around Earth’s magical heroes, it may explain <em>why</em> by confirming the return of two interesting characters.</p><p id=\"pEdwS8\">Despite Wanda and Strange not having spent the most time on screen together up until this point, the new trailer establishes that the pair have quite a bit in common. For example, they both have recurring dreams of (what appear to be) other universes only to wake up in their home realities, which feel like nightmares. In contrast to Strange’s night terrors that all seem to revolve around apocalyptic scenarios and his love for Christine Palmer, Wanda’s dreams are haunted by visions of <a href=\"https://gizmodo.com/wandavision-just-gave-us-2-very-different-origin-storie-1846306896\">her twin sons Billy and Tommy</a>, who still exist in other dimensions apparently. <em>WandaVision</em>’s finale made it clear that, even though Wanda was forced to undo the magic that made her sons exist in that particular dimension, they were still out there somewhere in the multiverse and able to call to her. </p><p id=\"WGrLM1\">The MCU’s rules about whether people are meant to be mucking around in other realities haven’t exactly been set in stone yet. It stands to reason, though, that a grieving witch trying to get her children back by stealing copies of them from other universes isn’t the best idea. And it goes against the natural order in a way that might make <a href=\"https://www.polygon.com/22932992/doctor-strange-multiverse-of-madness-charles-xavier-tom-cruise-iron-man-illuminati\">some important people upset</a>.</p><p id=\"U5dusK\"><em>Doctor Strange in the Multiverse of Madness </em>hits theaters on May 6.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XSs-UGO0a4xExuP5dzghIwT2hHs=/155x0:2405x1178/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23371091/Screen_Shot_2022_04_06_at_10.13.37_AM.png",
  "description": "Newest Doctor Strange in the Multiverse of Madness trailer is plagued by nightmares.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}