{
  "title": "Doctor Strange in the Multiverse of Madness’ latest teaser would like you to meet the Illuminati",
  "url": "https://www.theverge.com/2022/4/29/23048572/multiverse-of-madness-illuminati-professor-x",
  "date": "2022-04-29T16:45:42.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YewtXMktu9mqVyfcYZg1Y4cXdIs=/60x0:1628x1045/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70810822/DoctorStrangeInTheMultiverseOfMadness_Teaser2_Printed_1_Sht_v4_lg.0.jpeg\" />        <figcaption>Marvel Studios</figcaption>    </figure>  <p id=\"7tM6wr\">There’s only one week left until <em>Doctor Strange in the Multiverse of Madness </em>drops, but rather than waiting for news to spread by word of mouth, Marvel’s just dropped a new teaser featuring a cameo that might change the future of the MCU.</p><p id=\"TyImXH\">Benedict Cumberbatch’s Steven Strange headlines Marvel Studios’ upcoming <a href=\"https://www.theverge.com/2022/4/6/23013118/multiverse-of-madness-trailer-billy-tommy\"><em>Multiverse of Madness</em></a>, but he isn’t the only heavy hitter slated to make an appearance in the movie. Both the <a href=\"https://www.theverge.com/2022/2/15/22933001/doctor-strange-the-scarlet-witch-marvel\">Scarlet Witch</a> and <a href=\"https://www.theverge.com/2017/1/25/14383676/marvel-comics-america-series-cover-intersectional-feminism\">America Chavez</a> will somehow factor into the second <em>Doctor Strange </em>film’s story about the entire MCU collapsing in on itself — an event that’s raised more than a few questions about the narrative territory Marvel’s journeying into. </p><p id=\"8zgeDH\">While <em>Multiverse of Madness</em>’ newest teaser doesn’t explain what’s happened to the multiverse or how Steven’s involved, it does confirm that at some point in the film, he’ll come face-to-face with the MCU’s Illuminati. In Marvel’s comics, the Illuminati are a secretive group of heroes consisting of representatives from different groups, like the Avengers, Earth’s magical community, Wakanda, Atlantis, and, perhaps most interestingly, mutants. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KsbZm1Nd7uArELhcFa1DwgmYbtY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23425830/Screen_Shot_2022_04_29_at_11.30.50_AM.png\">      <cite>Marvel Studios</cite>      <figcaption><em>Someone sitting in a yellow chair of some sort.</em></figcaption>  </figure><p id=\"jqxdDr\">A number of classic Illuminati members from the comics like Iron Man, Doctor Strange, and the Black Panther have already made appearances in the MCU. But what’s notable about this teaser is the implication that Patrick Stewart makes an appearance as a variant of Charles Xavier, a longtime educator of gifted youngsters and noted member of the Illuminati. Though you don’t see Stewart’s face, his voice is immediately recognizable, as is the Day-Glo yellow hover chair he seems to be sitting in, suggesting that <em>Multiverse of Madness</em>’ Xavier variant will bear some likeness to the Xavier of <a href=\"https://gizmodo.com/the-iconic-x-men-animated-series-is-finally-coming-back-1848047228\">the ’90s <em>X-Men </em>cartoon</a>. Interestingly, the teaser also features the <em>tiniest </em>glimpses of what seem to be a live-action <a href=\"https://gizmodo.com/what-ifs-premiere-turned-peggy-carter-into-the-first-na-1847453488\">Captain Peggy Carter</a> and a Captain Marvel who definitely favors <a href=\"https://www.vox.com/2019/3/9/18256195/captain-marvel-brie-larson-controversy-monica-rambeau\">Lashana Lynch</a> more than <a href=\"https://www.cbr.com/doctor-strange-2-superior-iron-man-debunked/\">Tom Cruise</a>.</p><p id=\"NBQzxK\">Just a few years ago, Marvel Studios wouldn’t have been teasing fans with the potential of mutants running around in the MCU due to complications with the characters’ cinematic rights that were ultimately <a href=\"https://www.vox.com/culture/2019/3/27/18280941/marvel-fox-disney-merger-x-men\">resolved in 2019 when Disney bought 21st Century Fox</a>. Wild as it is to consider, <em>Multiverse of Madness</em>’ story about heroes from different dimensions coming together in a moment of crisis is the perfect way for Marvel to introduce a bunch of “new” characters like the X-Men fans have been waiting to see.</p><p id=\"qTd4E9\"><em>Doctor Strange in the Multiverse of Madness </em>hits theaters on May 6th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WufBrIpA8EefOdDE9Ui1k4FIsIg=/0x81:1688x965/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23425710/DoctorStrangeInTheMultiverseOfMadness_Teaser2_Printed_1_Sht_v4_lg.jpeg",
  "description": "Doctor Strange meets a certain Professor in the newest Multiverse of Madness teaser.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}