{
  "title": "$1.7 million in NFTs stolen in apparent phishing attack on OpenSea users",
  "url": "https://www.theverge.com/2022/2/20/22943228/opensea-phishing-hack-smart-contract-bug-stolen-nft",
  "date": "2022-02-20T14:37:34.000Z",
  "author": "Russell Brandom",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QHH7Q4S8RXKQGAbTNHemNgBAVlI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70531158/acastro_220215_STK007_0005.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ZhRep9\">On Saturday, attackers stole hundreds of NFTs from OpenSea users, causing a late-night panic among the site’s broad user base. <a href=\"https://docs.google.com/spreadsheets/d/1XQNIXuAl2E1XO_cP8pm_vbzskI_Pka4E5sizfcrLITM/edit#gid=0\">A spreadsheet</a> compiled by the blockchain security service PeckShield counted 254 tokens stolen over the course of the attack, including tokens from Decentraland and Bored Ape Yacht Club.</p><p id=\"m92T65\">The bulk of the attacks took place between 5PM and 8PM ET, targeting 32 users in total. Molly White, who runs the blog Web3 is Going Great, estimated the value of the stolen tokens at <a href=\"https://web3isgoinggreat.com/?id=2022-02-19-1\">more than $1.7 million</a>.</p><div class=\"c-float-right\"><aside id=\"HylY4L\"><q>“They all have valid signatures”</q></aside></div><p id=\"g6GFvd\">The attack appears to have exploited a flexibility in <a href=\"https://wyvernprotocol.com/\">the Wyvern Protocol</a>, the open-source standard underlying most NFT smart contracts, including those made on OpenSea. One explanation (linked by CEO Devin Finzer <a href=\"https://twitter.com/dfinzer/status/1495245313304530952\">on Twitter</a>) described the attack in two parts: first, targets signed a partial contract, with a general authorization and large portions left blank. With the signature in place, attackers completed the contract with a call to their own contract, which transferred ownership of the NFTs without payment. In essence, targets of the attack had signed a blank check — and once it was signed, attackers filled in the rest of the check to take their holdings.</p><p id=\"qSApdB\">“I checked every transaction,” said <a href=\"https://twitter.com/Nesotual/status/1495223135800643592\">the user</a>, who goes by Neso. “They all have valid signatures from the people who lost NFTs so anyone claiming they didn’t get phished but lost NFTs is sadly wrong.”</p><p id=\"GDzNsW\">Valued at $13 billion in a recent funding round, OpenSea has become <a href=\"https://www.theverge.com/2022/2/2/22914081/open-sea-nft-marketplace-web3-fundraising-finzer-a16z\">one of the most valuable companies of the NFT boom</a>, providing a simple interface for users to list, browse, and bid on tokens without interacting directly with the blockchain. That success has come with significant security issues, as the company has struggled with attacks that leveraged <a href=\"https://www.theverge.com/2022/1/24/22899125/opensea-bug-bored-ape-nfts-smart-contract-listings-cancellation\">old contracts</a> or <a href=\"https://www.theverge.com/2021/10/13/22723092/opensea-nft-vulnerability-gift-security-researchers-wallet-hack\">poisoned tokens</a> to steal users’ valuable holdings.</p><p id=\"JAf0kP\">OpenSea was in the process of updating its contract system when the attack took place, but OpenSea has denied that the attack originated with the new contracts. The relatively small number of targets makes such a vulnerability unlikely, since any flaw in the broader platform would likely be exploited on a far greater scale.</p><p id=\"oMZudL\">Still, many details of the attack remain unclear — particularly the method attackers used to get targets to sign the half-empty contract. Writing on Twitter shortly before 3AM ET, OpenSea CEO Devin Finzer said the attacks had not originated from <a href=\"https://twitter.com/dfinzer/status/1495302786811981825\">OpenSea’s website</a>, <a href=\"https://twitter.com/dfinzer/status/1495302788791767043\">its various listing systems</a>, or <a href=\"https://twitter.com/dfinzer/status/1495302787835432961\">any emails from the company</a>. The rapid pace of the attack — hundreds of transactions in a matter of hours — suggests some common vector of attack, but so far no link has been discovered.</p><p id=\"bAvQnR\">“We’ll keep you updated as we learn more about the exact nature of the phishing attack,” said Finzer on Twitter. “If you have specific information that could be useful, please DM <a href=\"https://twitter.com/opensea_support\">@opensea_support</a>.”</p><p id=\"33heMA\"><em>Emma Roth also contributed reporting.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NyYwVURddbQk7Rc6qoag4Kt1WQ0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23248008/acastro_220215_STK007_0005.jpg",
  "description": "Yikes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}