{
  "title": "Drag Her brings drag culture to fighting games",
  "url": "https://www.theverge.com/2022/2/1/22911129/drag-her-fighting-game-kickstarter",
  "date": "2022-02-01T17:03:47.000Z",
  "author": "Alan Wen",
  "content": "      <figure>      <img alt=\"drag her\" src=\"https://cdn.vox-cdn.com/thumbor/yNMYtLNLSfxGQL7AgYBA9wVGOwI=/102x0:1626x1016/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70458079/Muscle.0.png\" />    </figure>  <p>Street Fighter meets Drag Race, now on Kickstarter</p> <p class=\"p--has-dropcap\" id=\"eohVNt\">You might not assume there’s a huge overlap between drag and fighting games. One involves dressing up to express extreme caricatures of gender expectations that’s associated with LGBTQ+ culture; the other involves knocking seven shades out of each other with hyper-violent adrenaline and where busty female characters are often designed for the gaze of pubescent boys. But perhaps fighting games, with their larger-than-life flamboyant rosters, are actually more drag than you think.</p><p id=\"egy1qO\">“Fighting games are so known for these really hyper-feminized versions of women or hyper-masculine versions of men, so it kind of plays with gender in ways that you didn’t really think of,” says Jessica Antenorcruz, narrative designer at Fighting Chance Games. “So it makes total sense to me when we talk to a lot of drag queens or kings, they look up to fighting game characters as being very dramatic and beautiful — and then kick the crap out of them!”</p><p id=\"FED3Zg\">But even if the LGBTQ+ community may embrace <em>Mortal Kombat</em>’s Sindel, who uses both her voice and hair as weapons, as a drag icon, much of that has been dependent on the audience projecting their interpretation of any scant queer-coded signifiers available. And while queer representation has been gradually improving in mainstream gaming, from Ellie in <em>The Last of Us</em> to the bisexual paradise of <em>Hades</em>, these are still games led primarily by cis-hetero men.</p><p id=\"rES1An\"><a href=\"https://www.kickstarter.com/projects/fightingchancegames/drag-her\"><em>Drag Her</em></a>, in comparison, doesn’t hide the fact that it is proudly camp and queer. It’s a 2D fighting game featuring a cast entirely of drag performers, while the core of the new indie studio behind it, Fighting Chance Games, is comprised of LGBTQ+ folk, women, and people of color, with a deep love for the drag community. More importantly, the fighters aren’t just drag characters (with the exception of Lemonade, a prototype Dolly Parton-esque country queen designed for the demo). Instead, each will be based on and voiced by real-life drag artists, many of which fans may recognize from RuPaul’s <em>Drag Race</em> or The Boulet Brothers’ <em>Dragula</em>.</p><div class=\"c-wide-block\"><div id=\"5IVNOY\"><div ><iframe src=\"https://www.youtube.com/embed/xZjAqMNI9BA?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"dfmunF\">This decision, according to the game’s art director Josie Devora, stemmed from the origins of the project when the pandemic had forced many queer businesses to close. “We wanted to combine our love for games and then something that would actually help support the community and kind of start a new revenue for it as well,” he says. “That’s what inspired Drag Her — it was a way to get the community involved while having a really fast, fun, frenetic game at the same time.”</p><p id=\"NEGh8N\">Drag might not be typically associated with violence, but battles are certainly part of drag culture, be it lip sync battles or ball culture’s verbal battles of wits, where “reading” and “dragging” an opponent is parlance for tearing someone down. <em>Drag Her</em> simply makes this literal. “It’s like dragging someone through the mud, but then they’re also in drag, so it sells the concept but also politely lets you beat the shit out of your friends,” Devora laughs. “We’re coming from a place where we’re definitely huge drag fans, but also we’re huge fighting game fans — it doesn’t make sense why nobody’s done this before!”</p><div class=\"c-float-right c-float-hang\"><aside id=\"khr00K\"><q>“It doesn’t make sense why nobody’s done this before”</q></aside></div><p id=\"NCnCrL\">Based on an early build I played, <em>Drag Her </em>really does bring the glitter and glamour of drag culture to the fighting stage with a cheeky dose of irreverence. Each fighter’s health gauge is represented by a long and gradually shrinking pink baton of lipstick. Their attacks are as distinct as striking a voguing pose, while super moves leave a rainbow trail or cut away to over-the-top magical girl-style animations. With just one playable queen in the demo, the ensuing mirror matches also provide an opportunity for the announcer (voiced with sassy relish by drag queen Meatball) crack about the two showing up in the same outfit (“how embarrassing!”) while defeated fighters fall to the shrill cry of “K-HO!”</p><p id=\"4zASe6\">In a word, it looks fabulous, and it’s fun to play, too. Producer Ian Ramsay says that the aim is to appeal to the intersection of casual fighting game players and casual <em>Drag Race</em> fans, which <em>Drag Her</em> does with a simplified control scheme — just two primary attack buttons, an assist attack a la <em>Marvel vs. Capcom, </em>which brings on another drag fighter, and no quarter or half-circle directional inputs. “The core concept when I sold this to the team was fast and frenetic and approachable,” he explains. “We’re not trying to create a <a href=\"https://www.theverge.com/2013/8/20/4640306/can-street-fighter-work-with-only-two-buttons\"><em>Divekick</em></a> one-button fighter either, so we picked a bunch of different fighting games along a continuum of where they were with complexity to find the core for our game.”</p><p id=\"mjXDcD\">Another thing Ramsay says the team agreed on was “consequence-free violence.” Along with the colorful hand-drawn art style, matches have a very playful no-harm-done tone where no one’s leaving the stage physically battered, wigs remain immaculately pinned to their heads, and even the winner’s usual victory pose ends with a dip that has them comically crashing through the floor. Even as someone whose favorite fighting game happens to be the ultra-violent <em>Mortal Kombat</em> where fighters are regularly impaled, disemboweled, or in pieces, Antenocruz is emphatic about this.</p><p id=\"5SsL6g\">“This is a community of people who have been abused for years and years and traumatized, so we wanted to make a game that’s kind of harmless in the sense that you’d beat the crap out of somebody, but it’s all a game, right?” she says. “You’re never going to see them bleeding or bruised because that can be demeaning and traumatizing to people who have lived through that. It’s like the opposite of <em>Mortal Kombat</em> — it’s kind of a weird safe space.”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"drag her\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FQ06TwPdGQDlYRrBJAeXV9ChkPE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23208173/Bitchslap.png\">  </figure></div><p id=\"KuG2lL\"><em>Drag Her</em> is also doing right by the drag community by representing it as diversely as possible. The planned roster of eight fighters may seem slim — basically the same as the original <em>Street Fighter II</em> lineup — but it’s comprised of a wide range of drag artists. These include drag king Landon Cider, Korean drag queen Kim Chi, and trans drag queen Laganja Estranja. While <em>Drag Race</em> has often been criticized for dragging its heels on inclusivity, having only featured transgender contestants in recent years but still no drag kings, Fighting Chance Games wants to show that all drag is valid.</p><p id=\"lEiA43\">“Drag artists are the mascots of not just the G of LGBTQ, or the L, or the Q — it’s a celebration of it all,” says Ramsay. “For me, drag is just putting on a show and a personality, whether it’s to help defend yourself because the world has really picked on you since you were a kid or whether it’s a celebration of everything you are or want to be.”</p><p id=\"8LxitD\">That’s also why it was important to represent real-life drag artists, who are, of course, paid for their license, not only giving them exposure to drag fans but new audiences. While the team is unable to disclose details at present, part of the game will include elements that provide more background about the drag community and the drag artists; a mixture of education, trivia, and celebration, but above all, a reminder that these are all real human beings.</p><div class=\"c-float-left c-float-hang\"><aside id=\"MliWlk\"><q>“It’s like the opposite of Mortal Kombat — it’s kind of a weird safe space.”</q></aside></div><p id=\"CWDAC0\">Nonetheless, the main aim of <em>Drag Her</em> is to deliver a fun fighting game, which also happens to be very camp and queer. But it faces stiff competition in a year when <em>Street Fighter</em> is celebrating its 35th anniversary with a surely imminent announcement for its sixth installment, while new challenger Riot Games is investing millions into the <em>Arcane</em>-inspired Project L. Of course, the studio understands that it’s very much a niche within a niche (even the game’s announcement trailer references obscure ’90s fighting game <em>ClayFighter</em>). Having designed two indie-level fighting games in the past, technical designer Matt DeLucas is naturally keeping expectations in check, especially when it comes to attracting the professional stratosphere of the fighting game community.</p><p id=\"rBRhWw\">“It’s really hard to tap that one because, for some of them, it’s a job, like they’re making thousands of dollars for every tournament, or it’s supporting a side hustle,” he says. “We’re trying to tap the more indie casual side, where they’re still playing the <em>Sailor Moon</em> fighting game on Super Nintendo. At the end of the day, it’s all about marketing, but we’re shooting for the LGBTQ+ and core fighting game overlap more than hardcore tournament goers.”</p><p class=\"c-end-para\" id=\"Cid6qH\">With a Kickstarter funding target of $69,000, it’s certainly a (nice) modest target to see whether both the drag and queer community and fighting game community will show up and, more importantly, whether publishers will step up. “One of the things I would love to implore is all of these traditional publishers that are talking a lot about diversity and all the things that they want to support, give people the chance to actually show you that those things can deliver,” says Antenorcruz. “We’re a very diverse team. First and foremost, we’re making a diverse game in a lot of different arenas, so take the chance and be about the thing that you’re talking about.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KZ_GiIqDHDA8RlFGwIvcO1CRfvU=/0x56:1728x961/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23208165/Muscle.png",
  "description": "A Kickstarter campaign launches today.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}