{
  "title": "Drones are setting down roots in wildfire-scarred landscapes",
  "url": "https://www.theverge.com/23022323/drones-wildfire-first-nation-british-columbia",
  "date": "2022-04-18T12:45:00.000Z",
  "author": "Ashley Franzen",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Aq9U16XfoAykqJcRfd6cRnVAgrI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70761744/VRG_Illo_5122_M_Mathieson_Drones.0.jpg\" />        <figcaption>Illustration by Melissa Mathieson / The Verge</figcaption>    </figure>  <p>Tree-planting efforts get a boost from drones</p> <p class=\"p--has-dropcap p-large-text\" id=\"9oGTqt\">Drones flew over a wildfire-charred landscape in British Columbia last November, dropping thousands of tree seeds on the blackened ground. The flights were part of an experimental trial to reseed First Nations forests that were lost to the monumentally destructive 2017 fire season. With drones on their side, people in the area hope that reforestation can move faster — especially as wildfires continue to worsen. </p><p id=\"9unDYT\">2017 was one of the worst fire seasons on record in British Columbia. Nearly 800,000 hectares went up in smoke, taking with them homes, cars, and trees. For the local residents and First Nations communities in the area, it was devastating. During that season, 20 different fires merged to form the Plateau Complex. (At the time, it was the largest recorded fire in the province’s history.) While forest fires are a naturally occurring hazard that have been happening for millennia, climate change and human activity have increased the prevalence of wildfires in recent decades, in addition to exacerbating how severely they scorch.</p><div class=\"c-float-right c-float-hang\"><aside id=\"iLFhRO\"><q>Some of these areas have burnt so hot that there’s no regeneration of seedlings</q></aside></div><p id=\"fTOcbL\">“A lot of these areas where there have been wildfires, some of these areas have burnt so hot that there’s no regeneration of seedlings,” Percy Guichon says. Guichon is the director of the Central Chilcotin Rehabilitation, a reforestation and land management company in British Columbia. He is from the Tŝideldel First Nation community that works in conjunction with the Tl’etinqox First Nations Government to reseed the forests where the Plateau Complex fire burned. Both are local communities that were affected by the devastating fires.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OrCFykQutHmVcll0tehXC4cVDEQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23392983/tsi_del_del_12.jpg\">      <cite>Image: DroneSeed</cite>      <figcaption><em>Drones and workers at the Tŝideldel project in British Columbia.</em></figcaption>  </figure></div><p id=\"j3RiHC\">Trees can normally regenerate due to the scatterings of pine cones by the wind or with the help of animals. But when a fire burns too hot, there is no way for seeds to survive and trees to grow back naturally in charred soils. To help forests rebuild, communities are turning to technological alternatives — including drones.</p><p id=\"ybONgx\">“We just wanted to find another method of planting that would complement our current, traditional planting methods using tree planters,” Guichon says. Manual tree planting is done in groups and is hard work: individuals carry a long-handled spade and a 40-pound sack of infant trees and alternate spearing the soil and setting the baby tree in the hole. The process is often started in the early morning when the soil is moist. Following strict quality and density guidelines, manually planting trees can yield between 1,000 and 3,000 trees a day. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7R63PO2OsdqHrQhOlMtUy2Ma6LY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23392990/tsi_del_del_17.jpg\">      <cite>Image: DroneSeed</cite>      <figcaption><em>A drone used during the Tŝideldel project.</em></figcaption>  </figure><p id=\"nQzYKo\">Drones take a different approach. For the pilot program, Guichon’s group and the<strong> </strong>government reporting entity Forest Enhancement Society of British Columbia purchased fir and pine seeds from a nursery in California and sent them to DroneSeed, a Seattle-based agrotech startup. “They put the seeds in the small vessel, the puck, which contains a mix of soil and nutrients to give the seeds the best chance at germination,” Guichon says.</p><p id=\"OcugiD\">In the first round of drone planting, about 10,000 pucks were dropped per hectare — about 52 hectares in total. The team plans to continue to monitor the growth of the pines and firs that were planted into the spring and summer to see if the seeds will germinate and “take” in the soil. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xJE2ZOf-6iy8HdMoz2pPy2CPx08=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23392993/seed_processing_03.jpg\">      <cite>Image: DroneSeed</cite>      <figcaption><em>Bushels of cones drying in the cone barn at Silvaseed, a forestry seed provider. </em><a class=\"ql-link\" href=\"https://cheddar.com/media/droneseed-acquisition-first-step-in-scaling-reforestation\" target=\"_blank\"><em>Silvaseed was recently acquired</em></a><em> by DroneSeed.</em></figcaption>  </figure><p id=\"LdVs8R\">The hope is that the half-million drone-planted seedlings will help the scorched forest rebound more quickly than it could on its own. “If it’s a kilometer to the nearest living tree, it’s going to be a long time before seed can get there, and so that’s where humans can step in, including with drone technology, to just accelerate the recovery and long-term development of the area,” says John Bailey, a professor at Oregon State University’s College of Forestry.</p><p id=\"GK197L\">While it’s unlikely that drone seeding will ever fully replace manual planting, the technology is growing increasingly popular in regions afflicted by wildfires. There have been additional reseeding efforts in British Columbia, Washington state, and other areas of the Pacific Northwest. Many of the efforts include working with foresters, local governments, and landowners who have been affected by wildfires. When it comes to drone seeding, land area surveys are easier to conduct and drones can reach places where manual planting poses difficulties, such as remote locations and sharp inclines.</p><p id=\"887pR6\">Bailey says there are key things to take into consideration when using drones to reseed forests. Some areas in particular might not be hospitable to the seeded pucks. “Lower elevation, lower latitudes, south-facing, steep slopes: they can get very hot, as well, and if you’ve lost all or most of the canopy cover to mediate the heat, that can be a really harsh environment, even for a seedling that you plant in the ground, much less a new seed germinating,” Bailey says.</p><p id=\"98kDhv\">The results of the trial in British Columbia will be coming in over the next year or so and will hopefully yield some positive — and plentiful — findings. Data from these test runs will be used to shape the future of drone-seeding surveys, puck-drop techniques, and reforestation projects. </p><p class=\"c-end-para\" id=\"d79HX2\">Even if the drone-dispersed seeds fail to take root, there’s still hope that the forest will return. It just might take a very long time. As Bailey likes to tell his students, “Those areas will be forest again, but it could just take hundreds of years.”</p><p id=\"hIapQJ\"></p><p id=\"vYK7A1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7DqweDfPoxLBkk9O4QpEVxyZXwU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366370/VRG_Illo_5122_M_Mathieson_Drones.jpg",
  "description": "Tree-planting drones take flight after devastating wildfires.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}