{
  "title": "Drop Mythic Journey review: a sturdy keyboard that can’t quite justify its price",
  "url": "https://www.theverge.com/22916025/drop-mythic-journey-review-mechanical-keyboard-switches",
  "date": "2022-02-05T14:00:00.000Z",
  "author": "Jon Porter",
  "content": "  <p>A solid keyboard, but not quite $349 solid</p> <p class=\"p--has-dropcap p-large-text\" id=\"U4gzKk\">Drop is a retailer best known for making the often-perplexing world of custom mechanical keyboards approachable to a far wider audience. Traditionally, it’s focused on individual components like custom keycaps or high-end switches, but in recent years, the retailer, which was formerly known as Massdrop, has begun selling fully assembled keyboards. These are made of similar components but come in a fully assembled and more approachable package.</p><p id=\"ap5IlD\">The <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ffeatured%2Ficon-collection&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Icon collection</a> is the retailer’s latest pre-built keyboard range. It’s split into three price tiers, which range from the relatively accessible $150 Expression series to the truly wallet-busting $499 Paragon keyboards. The Mythic Journey keyboard is from the $349 middle tier, the Signature series. It’s programmable and comes with nicer switches than the Expression that are also hot-swappable, but it doesn’t have some of the higher-end features of the Paragon. </p><p id=\"sFCkh7\">It’s a very nice keyboard. But I don’t think it’s nice enough to justify its $349 price tag.</p><div id=\"6A8D2F\"><div data-anthem-component=\"scorecard:11010735\"></div></div><p id=\"Bq7CKq\">You can’t talk about the Mythic Journey without first addressing the elephant in the room: its price. Even by the pricey standards of mechanical keyboards, $349 is a lot, and for many people, it’ll simply be out of their price range.</p><p id=\"AJXbvX\">But the Mythic Journey’s price starts to make sense when you look at its individual components, many of which are available individually from Drop with their own premium price tags. You could buy a keyboard and mod it with these aftermarket parts over time or buy everything upfront in one go. The Mythic Journey is built around <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fbuy%2Fdrop-ctrl-barebones-mechanical-keyboard&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Drop’s CTRL keyboard</a>, which is available as a barebones board for $150. For switches, it’s using Drop’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fbuy%2Fdrop-invyr-holy-panda-mechanical-switches&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Holy Pandas</a> ($105 for a pack of 90), and its keycaps are <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fbuy%2Fdrop-mito-project-mythos-pegaso-custom-keycap-set&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">DCP Pegaso</a> ($80). Throw in a set of $25 Everglide stabilizers, and you’re looking at a combined cost of around $360 to buy the Mythic Journey’s components individually, and that’s not including the fact that Drop is hand-assembling these keyboards in the USA and sells them with a 3-year warranty.</p><div class=\"c-float-right c-float-hang\"><aside id=\"CBdQk9\"><q>Its individual components total $360 when bought separately</q></aside></div><p id=\"Ge11bS\">But this isn’t a review of the Mythic Journey’s components. This is a review of the Mythic Journey, a keyboard that costs $349 as an off-the-shelf product and which therefore carries very different expectations about how functional and usable it should be.</p><p id=\"cMM9eZ\">What your $349 gets you is a tenkeyless keyboard, which means the Mythic Journey omits the numpad for a slightly more compact layout. Around the top, you’ll find not one but two USB-C ports. You can use either one to connect the keyboard to your PC, leaving the other to act as an extra USB port for your computer. It happily charged a phone I plugged in, and when I attached a second keyboard in a fit of madness, I was able to use it to type. Underneath, you get a pair of metal feet to attach and prop the keyboard up at an angle. The six-degree angle the case sits at is a little shallow, but I got used to it after a couple of weeks of use. It’s a traditional keyboard overall, without the gaskets or customizable knobs that are becoming increasingly common on modern boards.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bIhQ4kez9BY8_shIcEYYMPvsWj4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23195132/jporter_220121_4983_0010.jpg\">      <figcaption><em>Two USB-C ports can be found on top of the keyboard.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/F0JCfYnK6SOgWslCM5jV4FYZGjs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23195131/jporter_220121_4983_0009.jpg\">      <figcaption><em>The keyboard’s feet only prop it up at a slight angle.</em></figcaption>  </figure></div></div></div><p id=\"o3uKNi\">You get a nice keycap puller in the box, as well as a switch puller, a straight USB-C cable, and a carrying case, which… fine. In terms of layouts, you’re limited to US (ANSI), so European (ISO) users are out of luck if they want access to local layouts.</p><p id=\"nCOUR4\">The keyboard features RGB lighting, which shines both around the edge of its case, as well as behind its individual keys. But given the keycaps themselves don’t feature transparent lettering, the lighting isn’t especially visible from above. The keycaps are made of hard-wearing PBT plastic and with dye-sublimated legends, but I’m not a huge fan of their color scheme overall. It just feels like its colors are clashing a little. </p><div class=\"c-float-left c-float-hang\"><aside id=\"n1JoPy\"><q>Other designs and form factors are available in the Signature series</q></aside></div><p id=\"L8K4BB\">Incidentally, while the Mythic Journey itself is only available in one configuration with these exact keycaps, Drop’s Signature series (of which the Mythic Journey is a part) come with a range of different keycap designs and keyboard layouts, but all broadly use the same underlying components. The <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fbuy%2Fdrop-signature-series-captain-keyboard&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Captain</a>, for example, has a more compact 65 percent layout and retro gray keycaps, while the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fbuy%2Fdrop-signature-series-ultrasonic-keyboard&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Ultrasonic</a> has the same tenkeyless layout but in a chunkier case and with colorful GMK Laser keycaps. These are currently all available for $349, but Drop says future models may come with more premium designs and cost slightly more.</p><div class=\"c-float-right c-float-hang\"><div id=\"rPml14\"><div data-anthem-component=\"aside:11010898\"></div></div></div><p id=\"Xc0Y0b\">Using the Mythic Journey is my first time typing on Holy Panda switches, and I’m a big fan. At their core, these are tactile switches, which puts them in the same overall family as Cherry’s MX Browns. But Holy Pandas have a far larger bump that you feel with each keypress, providing a much more tactile response than what you get from an MX Brown. Combined with their slightly stiffer feel, they’re very satisfying switches to type on, similar to a Zealio but with more heft. They’re not exactly quiet, but they’re not as loud as clicky switches like Cherry’s MX Blue. Oh, and the keyboard’s stabilizers (the mechanisms under longer keys that stop them from wobbling) are sturdy, with minimal rattle.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NZ1wJjkQltW6WFI7cFu-3dmciKQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23195126/jporter_220121_4983_0004.jpg\">      <figcaption><em>The keyboard comes as standard with Holy Panda switches.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kZjeXEjz80YRqfH6XpbKuuf84uE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23218852/jporter_220121_4983_0014.jpg\">      <figcaption><em>The Mythic Journey’s hot-swappable board only supports 3-pin switches, limiting compatibility</em></figcaption>  </figure></div></div></div><p id=\"ahw44q\">Of course, if you don’t like the Holy Pandas, you can easily remove them with an included switch-puller with no need for desoldering, thanks to the Mythic Journey’s hot-swappable board. But there’s a catch, and that’s that the Mythic Journey’s circuit board only supports 3-pin (aka plate-mount) switches rather than 5-pin PCB-mount switches. Drop’s reasoning for this is that 3-pin switches are more commonly available, but ultimately, 3-pin switches can go in a 5-pin PCB, but not the other way around. And that means you might run into compatibility issues when you come to put new switches in the Mythic Journey. Yes, it’s possible to <a href=\"https://switchandclick.com/plate-mounted-vs-pcb-mounted-keyboard/\">modify 5-pin switches to get them to fit in 3-pin sockets</a>, but other hot-swappable keyboards like <a href=\"https://www.theverge.com/22662686/keychron-q1-review-price-mechanical-keyboard-features\">Keychron’s Q1</a> aren’t as fussy.</p><div class=\"c-float-right c-float-hang\"><aside id=\"rubyHh\"><q>Reprogramming the board is a little unintuitive</q></aside></div><p id=\"khz0aQ\">As well as customizing the Mythic Journey’s keycaps and switches, you can also customize its layout thanks to its support for QMK. It means that you can remap its keys however you want and have this new layout saved directly to the keyboard to be carried between whatever devices you plug it into. </p><p id=\"g0xAnF\">Although the software is powerful, QMK configurators can sometimes feel a little unintuitive to use. The best version I’ve come across is <a href=\"https://caniusevia.com/\">Via</a>, which is the configurator that <a href=\"https://www.keychron.com/blogs/archived/how-to-use-via-to-program-your-keyboard\">Keychron’s boards use</a>. But <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ftalk%2F10343%2Fhow-to-configure-your-alt-keyboard&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Drop’s instructions</a> are much less intuitive and point you towards <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fmechanical-keyboards%2Fconfigurator%2Fpreset%2Fctrl%25E2%2580%2594default&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916025%2Fdrop-mythic-journey-review-mechanical-keyboard-switches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">its own configurator</a> and <a href=\"https://github.com/Massdrop/mdloader/releases\">its own software</a> for customizing the Mythic Journey’s layout. One of the steps, which you’ll <a href=\"https://github.com/Massdrop/mdloader\">find on a separate GitHub page</a>, involves literally running a terminal command to flash your new layout to your keyboard. Drop tells me it has a simplified configurator on the way, which is good news because the current process kinda sucks.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eamLSQnnqIdMgnCJHIh0F8r3glE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23195127/jporter_220121_4983_0005.jpg\">      <figcaption><em>Dye-sublimated PBT keycaps.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Xnkh6J9VuOrIERDeLlLJIsEzMj0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23195129/jporter_220121_4983_0007.jpg\">      <figcaption><em>RGB lighting shines out the sides of the keyboard.</em></figcaption>  </figure></div></div></div><p id=\"REDRzI\">The Mythic Journey sits in kind of a weird place. Clearly, this is meant for someone who wants a keyboard that works out of the box, without any need for fiddly self-assembly. </p><p id=\"EjbFRp\">But it’s also a keyboard that carries some of the downsides of expensive custom keyboards. It has a price tag that only really makes sense in the context of what its premium components cost individually. And while I think it’s reasonable to ask someone who’s built their own keyboard to run a terminal command to flash a custom layout, I don’t think it’s reasonable to expect the same thing of someone who’s bought something off the shelf. And definitely not when they’ve paid $349. </p><p id=\"lpZOcM\">So is this a keyboard for hobbyists or for someone who just wants a decent keyboard? Arguably, neither. A lot of hobbyists are into this hobby for the satisfaction and customizability of picking out the exact components they want and putting a keyboard together themselves. And for anyone else, $349 is a steep price to pay when very good, fully assembled mechanical keyboards like the Keychron Q1 exist at half the price.</p><p class=\"c-end-para\" id=\"VKEAA8\">If the Mythic Journey cost, say, $150, then I might be willing to excuse the areas where it’s a little rough around the edges. It’s a very satisfying keyboard to type on, it’s solidly built, and its hot-swappable switches and QMK configuration fundamentally work, even if they have their quirks. But it doesn’t cost $150 — it costs $349.</p><p id=\"Orrh33\"><em>Photography by Jon Porter / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3FhAgrncs8sqziWSXURLuhjAxLI=/0x158:2040x1226/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23195124/jporter_220121_4983_0002.jpg",
  "description": "Premium components in a fully assembled package",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}