{
  "title": "Drop’s new mechanical keyboard keycaps are a different take on a familiar design",
  "url": "https://www.theverge.com/2022/4/26/23042494/drop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot",
  "date": "2022-04-26T16:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/syLJ4p5um_q4ApEZRNiahiJZGq0=/0x0:2500x1667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70795173/8895_copy_pdp.0.jpg\" />        <figcaption><em>Drop’s new white-on-black DCX keycaps.</em> | Image: Drop</figcaption>    </figure>  <p>There’s a new keycap style in town: DCX</p> <p class=\"p--has-dropcap p-large-text\" id=\"7ZOQVy\">At first glance, there’s nothing obviously special about mechanical keyboard retailer <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ffeatured%2Fdcx-keycaps&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Drop’s new collection of keycaps</a>. There’s one white set with black lettering, one black set with white letting, and one more colorful set with a combination of yellow, blue, red, and white keycaps. They’re so understated that they almost look identical to what you’d find on an off-the-shelf keyboard, rather than the wacky designs that aftermarket keycaps are generally known for. </p><p id=\"BjNzcD\">But look beyond their color, and you’ll start to see the evidence of months of painstaking toil and over $1.5 million in development work. These seemingly ordinary keycaps are the first to use <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ffeatured%2Fdcx-keycaps&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Drop’s new DCX profile</a>, an ambitious attempt by the company to compete with a manufacturer widely seen as producing the gold standard in aftermarket keycaps. In mechanical keyboard parlance, “profile” refers to the shape of the keycaps — which can range from compact little cubes to towering retro typewriter-style chunks of plastic. </p><div class=\"c-float-right c-float-hang\"><aside id=\"Eokyox\"><q>An attempt to compete with GMK</q></aside></div><p id=\"ce85li\">“We’ve focused extremely, extremely closely on getting the quality of this product to be as high as we can, which I would say is unique compared to what others offer,” Drop’s head of studio Kevin Mak tells me over Zoom. The DCX profile is more than just a new shape — it is also intrinsically tied to the quality of the lettering on each key. So the development process has also involved painstakingly going through all the keycap legends to get their sizing and spacing just so.</p><p id=\"sr9mz2\">Take a look through <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fmechanical-keyboards%2Fdrops%3Fsc%3Dkeycaps&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Drop’s catalog</a> of keycaps today, and you’ll see the same three letters cropping up again and again: GMK. For many mechanical keyboard hobbyists the name GMK — a manufacturer based in Germany that produces “Cherry profile” keycaps — is synonymous with some of the highest-quality keycaps around. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q8-tU1E66D8YFPXMGeW2fSpv6K0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23416766/DCX_first_Colorways.png\">      <cite>Image: Drop</cite>      <figcaption><em>Drop’s first three DCX colorways.</em></figcaption>  </figure></div><p id=\"hqQrfK\">There’s nothing especially fancy about the style of keycaps GMK produces. They’re not tall retro blocks that look like they belong on a 1980s computer terminal. Instead, they’re simply well-produced and sturdy in a way that mechanical keyboard enthusiasts prize. Their keycaps are made of thick, high-quality plastic, and they use a double-shot process to create their keycap lettering. So rather than printing or using a dye process to get keycap legends onto the keycaps, GMK instead uses two different plastics: one for the keycap and one for its lettering. The result is not just lettering that can never wear away with use but also legends that are remarkably crisp and bright. This is also what links the profile with the style of lettering because they’re both made by the same set of tooling.</p><p id=\"i0KZg0\">DCX isn’t meant to replace the GMK keycaps in Drop’s catalog, and the company tells me it plans to continue selling GMK keycaps for the foreseeable future. But after over a decade working with the German manufacturer, Drop’s business has slowed because of the number of other companies GMK is working with. </p><p id=\"8Skt34\">That’s the problem with GMK. As an independent manufacturer, it’s making keycaps for not just Drop but also any other designers and retailers that want to produce a set of keycaps. GMK’s popularity means that wait times of 18 months or more for its keycaps are now the norm — long enough to <a href=\"https://www.youtube.com/watch?v=aouT65ogqhU\">test the patience</a> of all but the most stoic of enthusiasts. In contrast, DCX keycaps should be able to go from idea to final shipping in <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ftalk%2F107023%2Fmuch-ado-about-mt2&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">just 4 to 6 months</a>, Drop says.</p><div class=\"c-float-left c-float-hang\"><aside id=\"6HtZKj\"><q>“We weren’t trying to copy [GMK] one-for-one”</q></aside></div><p id=\"MZUVVC\">DCX’s design, then, inherits most of what people love about GMK’s keycaps. They’re double-shot, made of high-quality ABS plastic, and the squared-off design should look at home on most off-the-shelf mechanical keyboards. “We weren’t trying to copy it one-for-one,” Mak says, noting that Drop made its 3-D models more or less from scratch, “but of course we were aiming for the same type of results.” It’s similar enough that Drop expects some GMK keycap designs to be converted to use DCX in the future. </p><p id=\"FEweXm\">It’s a design that means DCX should look familiar to anyone who’s ever used a mechanical keyboard. The keys aren’t very tall, nor are they especially low profile. They’re medium in height, and their tops have a slight dip between the left and right sides of each key (otherwise known as a “cylindrical” shape, rather than more retro “spherical” keycaps). </p><p id=\"OqcRIN\">Designing a new keycap profile from the ground up gave Drop the opportunity to address some of the long-standing annoyances with GMK’s keycaps. Mak is very careful to not claim that DCX is “better” than GMK, but he highlights some of the issues that people have with GMK’s designs. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/aKbP31JGLJ9uFp5H8TDNmiWdxbw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23416767/1649444585662.730284074404191052993187_6231copyfinal1.jpg\">      <cite>Image: Drop</cite>      <figcaption><em>Drop says it’s paid close attention to the placement and proportions of DCX’s keycap legends. </em></figcaption>  </figure></div><p id=\"x90aEF\">Take “sprue marks,” the small imperfection that’s left on a keycap where the molten plastic flowed into its mold. On GMK’s keycaps, these marks are found on the top side of each keycap, a small blemish on a set of keycaps that frequently cost well north of $100. Given the high price of the sets, it’s perhaps not surprising that Drop occasionally sees its customers citing them as a reason for returning their keycaps. Drop’s solution with DCX is simple: it’s designed its tooling so that these marks are hidden on the underside of each key where they’re completely invisible.</p><p id=\"9IAM7r\">Another long-standing issue? The lack of Mac-specific Command and Option keys, which DCX now includes. They’re words rather than symbols (a decision Mak tells me is mostly stylistic), but at least Apple users won’t have to put up with legends that are obviously meant for Windows machines.</p><p id=\"ctjebp\">But the biggest thing Drop hopes people will appreciate, even if they don’t notice it specifically, is the amount of attention it pays to every aspect of how its lettering is laid out. Its legends are aligned and equally spaced, and symbols, like the “^” on the 6 key, are much more in proportion with the lettering they share a key with.</p><p id=\"DYf3rn\">Finally, the pricing that Drop’s announced for DCX means it offers a small price discount over GMK. A set of GMK <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Fbuy%2Fgmk-white-on-black-custom-keycap-set&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">white-on-black keycaps</a>, for example, will set you back $110 as of this writing, while the base kit of an equivalent DCX set has a <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ftalk%2F107374%2Fkicking-off-with-the-classic-black-on-white&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">regular price of $99</a>. </p><div class=\"c-float-right c-float-hang\"><aside id=\"adhV4p\"><q>Lessons learned from MT3</q></aside></div><p id=\"dz7LUT\">This is the second keycap profile that Drop has manufactured in-house. Its first was MT3, a stylized keycap design <a href=\"https://matt3o.com/about-mt3-profile-and-devtty-set/\">invented by popular designer Matteo “Matt3o” Spinelli</a> that took direct inspiration from the keycaps used on old computer terminals. This time around, Drop decided to develop its new keycaps in secret as opposed to its double-shot MT3 keycaps, where the company started taking preorders as part of a “group buy” process (the keyboard community’s name for a preorder structure similar to a Kickstarter) far in advance of having anything ready to ship. It’s a decision that angered many in the community when its MT3 keycaps started facing delays.</p><p id=\"dBawjd\">“I think the biggest lesson we learned from MT3 is calibrating on our expectations,” Mak says. “We launched them as a group buy way back in 2018 and we told the community that this will take eight months… we ended up taking two years, about three times more.” The result was a lot of unhappy customers who were hit with months of uncertainty before their keycaps eventually arrived.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mhuKgHpv0tK2tqmY5cZmmCsebC4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23416772/8710_copy_pdp.jpg\">      <cite>Image: Drop</cite>      <figcaption><em>A base kit of standard DCX keycaps costs $99.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2qO4YZov3Q7fl_00LMuLYv0QH7o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23416775/FAGRnp5rSoGYYAoZEJOW_wob_PC.jpg\">      <cite>Image: Drop</cite>      <figcaption><em>Compared to $110 for an equivalent GMK set.</em></figcaption>  </figure></div></div></div><p id=\"3GvLQn\">But even deciding to develop DCX behind closed doors hasn’t prevented the new keycap profile from generating controversy. When Drop initially announced the profile, it said it planned to call it “<a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ftalk%2F106596%2Fintroducing-mt2-profile&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">MT2</a>” in an attempt to build a family of products around the MT3 profile’s naming scheme. But to Matt3o, the designer whose name MT3 riffed on and who had no involvement in (or even prior knowledge of) the design of MT2, the name felt disrespectful. </p><p id=\"5nwWVn\">“With one quick swipe Drop used the MT3 success to create a completely unrelated product and by calling it MT2 they are also claiming that the MT moniker is not related to me,” the designer <a href=\"https://matt3o.com/the-mt3-mt2-drama-not-drama/\">wrote in a blog post</a>. In a comment posted under its MT2 announcement, Drop claimed that the “MT” in the MT2 name was “used to recognize the contributions of MiTo” another popular keycap designer who had “been involved in the development and design of MT2.”</p><div class=\"c-float-left c-float-hang\"><aside id=\"yGpHuf\"><q>DCX’s original name was controversial</q></aside></div><p id=\"QepcxS\">“We were genuinely surprised,” Drop’s chief operating officer Jeffrey Holove tells me of the criticism, “We were trying to make it clear that this is part of a family of Drop products. DCX is a lower profile than MT3 so “MT2” made sense… it just so happened that the designer we were collaborating on MT2 with featured an M and a T in his name, so it just kind of fit for us.” </p><p id=\"DOVMCV\">After the outcry, which was echoed by many others in the keyboard community, Drop quickly announced a change in the name of the new keycap profile, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdrop.com%2Ftalk%2F107709%2Fthe-mt-2-name&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F26%2F23042494%2Fdrop-dcx-profile-mechanical-keyboard-keycaps-abs-double-shot\" rel=\"sponsored nofollow noopener\" target=\"_blank\">writing in a post</a> that it would be changing the name of MT2 to DCX “out of respect for Matt3o’s contribution and our desire to not dilute the uniqueness of MT3 in the eyes of the community.” Matt3o was <a href=\"https://matt3o.com/mt2-i-mean-dcx-alls-well-that-ends-well/\">quick to accept the concession</a> and suggested he’d be open to working with Drop again in the future.</p><p id=\"rfRymH\">Priced at $99 for a standard base kit, Drop’s DCX profile keycaps are unlikely to be an entryway into the niche world of mechanical keyboards. But for those already comfortable with spending the kinds of money premium GMK keycaps currently command, they have the potential to be more easily available and slightly more affordable. As for whether they actually have a chance of bettering GMK’s legendary quality?</p><p class=\"c-end-para\" id=\"NFa05e\">“We’re aiming for that” Drop’s Kevin Mak says, before adding quickly “the community gets to decide.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AigE7HTy0Y72mO-YLHO9LgC7JGE=/0x154:2500x1463/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23416761/8895_copy_pdp.jpg",
  "description": "A new competitor to GMK.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}