{
  "title": "DuckDuckGo’s privacy-centric browser arrives on Mac",
  "url": "https://www.theverge.com/2022/4/12/23021682/duckduckgo-for-mac-desktop-browser-privacy",
  "date": "2022-04-12T15:28:04.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XNfkQvKVt0Ec79a4GjBuiacn0TY=/149x0:1555x937/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740130/duckduckgo_mac_beta.0.png\" />        <figcaption>Image: DuckDuckGo</figcaption>    </figure>  <p id=\"SUMPVv\">DuckDuckGo’s privacy-focused browsing app <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\">is available in beta on Mac</a>, but you’ll have to join a private waitlist to gain access. Just like the mobile browsing app, DuckDuckGo on Mac uses the DuckDuckGo search engine by default, automatically blocks web trackers, and comes with the famous “Fire” button that burns up your browsing history and tabs in a single click.</p><p id=\"tlwuu6\">The browsing app also comes with a new feature that’s supposed to help block those pesky cookie consent pop-ups that appear when you first open a website. DuckDuckGo says it will clear them on 50 percent of sites, while automatically selecting the option that blocks or minimizes the cookies that track you.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rqukD_q7MkTXwuLQHK8-7yleYaA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23383924/ddg_privacy_feed_tracking.gif\">      <cite>Image: DuckDuckGo</cite>      <figcaption><em>DuckDuckGo’s privacy feed breaks down tracking attempts by site.</em></figcaption>  </figure><p id=\"7Oc7Tw\">You’ll also gain access to a privacy feed that appears on DuckDuckGo’s homepage. It looks quite a bit like the Privacy Report on Safari’s homepage, but instead of just showing how many trackers it blocked, it breaks down tracking by site and lets you clear data on each one. In addition, DuckDuckGo won’t load the content on sites — like Facebook — that put trackers in embedded content. It will instead show a notification that warns you about the tracking and asks if you wish to proceed.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OmtlkvuqJxWjaKdT59luPwR1sq8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23384011/ddg_embed_trackers.jpeg\">      <cite>Image: DuckDuckGo</cite>      <figcaption><em>DuckDuckGo won’t load content on sites that try to get around tracker blockers.</em></figcaption>  </figure><p id=\"9IxbA0\">Some other perks include a built-in password manager (that DuckDuckGo says it’s working on bringing to the mobile app), the ability to sync passwords, history, and bookmarks from other browsers, as well as its <a href=\"https://spreadprivacy.com/duckduckgo-smarter-encryption/\">Smarter Encryption</a> tool that directs you to sites that use encrypted HTTPS connections more often. DuckDuckGo also says it stores your bookmarks, history, and passwords locally, and the company can’t access this information. </p><p id=\"66iHf3\">As we noted in <a href=\"https://www.theverge.com/2021/12/21/22848133/duckduckgo-browser-pc-mac-beta-privacy-default-settings\">our first post</a> about DuckDuckGo’s new browser, DuckDuckGo for Mac doesn’t fork an existing browser like Chrome. It’s built off of the rendering engine used by Safari, also known as <a href=\"https://developer.apple.com/documentation/webkit/webview\">WebKit</a>. Because of this, DuckDuckGo claims its browser is faster than Chrome “on some graphics performance” measured using the MotionMark 1.2 benchmark, and it says it uses 60 percent less data than Chrome (which we all know is a RAM hog).</p><p id=\"oVSjE7\">“Beyond rendering, all the code is ours — written by DuckDuckGo engineers with privacy, security, and simplicity front of mind,” Beah Burger-Lenehan, DuckDuckGo’s senior director of product, says in the post. “This means we don’t have the cruft and clutter that has accumulated in browsers over the years, both in code and design, giving you a modern look and feel and a faster speed.”</p><p id=\"72xZpw\">To join the waitlist for the browser, download (or update) the DuckDuckGo app on mobile. Then head to Settings and select the DuckDuckGo for Desktop option from the Privacy section. You’ll have to wait to receive a notification from the app, which will contain an invite code and link you can use to download the browser on your Mac. DuckDuckGo says it’s currently letting people into the beta in waves.</p><p id=\"b9WMCX\">As for Windows, DuckDuckGo says an app — built using the operating system’s default  <a href=\"https://blogs.windows.com/msedgedev/2020/10/19/edge-webview2-general-availability/\">Chromium-based Edge rendering</a> — is “coming soon.” DuckDuckGo also hopes to bring its browser to Linux in the future but says it’s focused primarily on Windows and Mac for now. </p><p id=\"j3qJ3B\">The one thing I’m really looking forward to with DuckDuckGo’s new browser, though, is its cookie consent blocker (which it can hopefully bring to mobile at some point). I’m curious to see how many notifications it can <em>really</em> block, and if it has any impact on performance. There’s also the question of how DuckDuckGo’s browser compares to Brave, a Chromium fork that’s already available on Mac, Windows, and Linux that offers some of the same ad- and tracker-blocking capabilities. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bnwOoTWT8UqMErnSiQcEDctLPHM=/0x23:1704x915/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23383918/duckduckgo_mac_beta.png",
  "description": "DuckDuckGo’s beta on Mac is accessible via a waitlist.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}