{
  "title": "DuckDuckGo’s browsers and extensions now protect against AMP tracking",
  "url": "https://www.theverge.com/2022/4/20/23033522/duckduckgo-browsers-extensions-amp-google-tracking-privacy",
  "date": "2022-04-20T14:24:15.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mNg8pyJP167wHMwfOuuUU85a6G8=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70771211/ddglogo.0.png\" />        <figcaption><em>DuckDuckGo says it’s now preventing AMP tracking.</em> | Image: DuckDuckGo</figcaption>    </figure>  <p id=\"JxOzcR\">Privacy-oriented search engine DuckDuckGo says it will “protect” against tracking by web pages with Google’s <a href=\"https://developers.google.com/amp\">Accelerated Mobile Pages framework</a> (or AMP) enabled. “When you load or share a Google AMP page anywhere from DuckDuckGo apps (iOS/Android/Mac) or extensions (Firefox/Chrome), the original publisher’s webpage will be used in place of the Google AMP version,” the company <a href=\"https://twitter.com/DuckDuckGo/status/1516534351974092805\">said on Twitter</a>. The technology allows Google to track users, DuckDuckGo notes, and forces publishers to use AMP by prioritizing those links in its search results. </p><div id=\"J0BoQf\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">AMP technology is bad for privacy because it enables Google to track users even more (which is already a ton). <br><br>And, Google uses AMP to further entrench its monopoly, forcing the technology on publishers by prioritizing AMP links in search and favoring Google ads on AMP pages.</p>— DuckDuckGo (@DuckDuckGo) <a href=\"https://twitter.com/DuckDuckGo/status/1516535049671397379?ref_src=twsrc%5Etfw\">April 19, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"kpFpIb\">AMP was originally introduced — or so <a href=\"https://amphtml.wordpress.com/2018/03/08/standardizing-lessons-learned-from-amp/\">Google said</a> — as a way to make mobile web pages load faster. But developers and others eyed AMP with suspicion, and <a href=\"https://www.wsj.com/articles/publishers-move-to-abandon-google-supported-mobile-web-initiative-11645725640\">some took issue with how Google prioritized AMP pages</a> in search results. Improvements to mobile websites since AMP’s introduction have made it somewhat less useful to publishers in recent years, and many (including <em>The Verge</em> parent company Vox Media) don’t use the framework at all.</p><p id=\"A68ArU\">The move came as Brave, another privacy-focused browser, announced it <a href=\"https://www.theverge.com/2022/4/19/23032776/brave-de-amp-google-browser\">would also skip AMP-rendered pages</a> where possible. “And in cases where that is not possible, Brave will watch as pages are being fetched and redirect users away from AMP pages before the page is even rendered, preventing AMP/Google code from being loaded and executed,” the company said in a <a href=\"https://brave.com/privacy-updates/18-de-amp/\">blog post</a>. The tech is “harmful to users and to the Web at large,” according to Brave’s post. </p><p id=\"vsLj8B\"></p><p id=\"DFNVaC\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/cIRB3n_b0s-TiEri7Vhq-QNmfpU=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397889/ddglogo.png",
  "description": "The tech lets Google \"further entrench its monopoly,\" the company said.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}