{
  "title": "Dygma Raise: splitting the difference between gaming and ergonomics",
  "url": "https://www.theverge.com/22951481/dygma-raise-review-ergonomic-keyboard-review",
  "date": "2022-03-04T15:12:25.000Z",
  "author": "Alice Newcome-Beill",
  "content": "  <p>Dig it or quit it?</p> <p id=\"NkNhRw\">The term ergonomic gets thrown around a lot, slapped onto everything from chairs and desks, to mice and perhaps most notably, keyboards. It’s fairly easy to find split ergonomic and <a href=\"https://keyboardkings.com/complete-overview-of-an-ortholinear-keyboard/\">ortholinear</a> keyboards available from a variety of manufacturers. However, there are very few that equip their keyboards with features that would appeal to enthusiasts. Alongside the <a href=\"https://www.theverge.com/22566248/zsa-moonlander-mark-i-1-ergonomic-keyboard-mechanical-review\">Moonlander Mark I</a> from ZSA, the Dygma Raise bucks that trend, with ergonomic features combined with enthusiast customizability. </p><p id=\"93DFHJ\">The Dygma Raise is currently only available via the company’s website, with the basic model costing $319.00. The high price point is not uncommon in the split keyboard ecosystem, but the Raise is a cut above in that respect.  </p><div id=\"Dgk3X1\"><div data-anthem-component=\"scorecard:11075299\"></div></div><p id=\"WOpfeU\">Ergonomics in keyboard design is all about cutting down on the amount of repetitive movement performed by your fingers and hands. Ergonomic boards also allow you to position your hands farther apart to relieve strain on your shoulders, or tent the keyboard to relieve your wrists. The Raise is designed to accommodate both aspects.</p><p id=\"8OG0gu\">The Raise is a split layout, 60 percent, ergonomic keyboard with RGB backlighting. Split layout keyboards are exactly what they say on the tin, dividing the available keys down the middle, typically where the 6 &amp; 7 keys would be. This is meant to allow your arms to rest at 90-degree angles and provide a more ergonomic experience.</p><p id=\"8N8VKg\">These aren’t the features that set the keyboard apart however; what really makes this keyboard special are the customization options and how receptive it is to modding, thanks to its open-source software, hot-swap PCB, and its small but enthusiastic community. You only need to pay a visit to the <a href=\"https://www.reddit.com/r/DygmaLab/\">Reddit</a> or <a href=\"https://discord.com/invite/vjsgxMYxtf\">Discord</a> servers dedicated to this keyboard to realize that it has something of a following.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qOTTvrQoO_BTjIOSlbDuDFXpZYY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280858/akrales_220228_5044_0088.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The Dygma Raise comes with its own carrying case.</em></figcaption>  </figure><p id=\"28mNhV\">The founder and CEO of Dygma, Luis Sevilla, hails from an esports background, formerly serving as the coach for the Fnatic <em>League of Legends</em> team back in 2016. Working with esports athletes gave Luis a unique perspective on the challenges these players face. All too often he would see 18-year old players incapacitated by repetitive stress injuries that are typically reserved for people twice their age. This is what inspired him to develop the Raise. </p><p id=\"ZHbTUy\">Right out of the box, it’s clear that no expense was spared on this keyboard. The Raise ships in its own hardened carrying case that holds the keyboard, cables, and an odd-looking USB-C cable splitter. Another nice touch is the “enhancement kit” that ships with the keyboard, which includes samples of the additional switches that Dygma offers in addition to a selection of rubberized o-rings, a combination switch and keycap puller, and an aptly named “crap remover” (it’s a brush y’all).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/82cnZVdLD-TUBJU0ZiSuqTJtLjk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280855/akrales_220228_5044_0027.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The tools of the trade.</em></figcaption>  </figure><p id=\"49ga6t\">The Raise has an extremely lean aesthetic, helped in part by its 60 percent layout. There is no function row, number pad, directional arrows, or text navigation keys. There isn’t even any visible branding, just a brushed aluminum chassis with a pair of firm leatherette wrist rests attached to either side. The wrist rests are secured to each side with a peelable adhesive, but they can be removed and reapplied if you need to clean them. </p><p id=\"XpD36M\">The Raise presents itself as a single unit but is easily separated into two halves by pulling on either side. The two boards are secured together by a series of magnetized pins. This hardware is very sturdy and has no problem keeping both ends together even when held up by one side. Impressive, given the heft of the keyboard itself. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pcnEF7faOFO5SSVe6ZY9Cia7bJA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280863/akrales_220228_5044_0134.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Both halves of the keyboard are held together by a series of pins.</em></figcaption>  </figure><p id=\"kWirPX\">From a gaming perspective, the Raise is unique. And while it’s marketed as a gaming keyboard, with the exception of macros and RGB lighting, you won’t find many of the typical trappings you’d expect from other brands, like dedicated media controls and extended key layouts. The split design can be used to run just one half of the board as a gaming pad and move your mouse hand closer to the middle.</p><p id=\"E7VkPv\">You can configure the Raise with eight different 3rd party switches, with options ranging from Cherry MX Reds to the Kailh Speed Silver linear switches found in mine. You’re also welcome to swap in any three or five-pin switch you prefer. It can be configured to support ANSI or ISO layouts and currently ships with PBT keycaps for six region-specific layouts. All of the basic keys use a standard keycap layout, allowing you to swap in custom sets. By default, the Raise ships with a black aluminum backplate, but can also be ordered with a silver backplate and white keycaps for an additional charge.  </p><p id=\"prAqB5\">Another option is the tenting kit, which costs an additional $89. This allows you to angle each side of the board upwards in steps ranging from 10 to 45 degrees. It can also be returned to a flat position. The tenting kit shares the same build quality as the rest of the keyboard, being composed almost entirely of aluminum, with the exception of its grippy rubber feet. Like other ergonomic boards, the Raise doesn’t have any way to be tilted like regular keyboards, even with the tenting kit.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CnM55CEdLoXoOdCgSXyfTj4Yim8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283791/anbeill_220302_5044_0006.jpg\">      <cite>Photo by Alice Newcome-Beill / The Verge</cite>      <figcaption><em>The tenting kit in all its glory.</em></figcaption>  </figure><p id=\"yJmldJ\">The two halves of the Raise connect using a pair of USB-C cables that lead to the packaged USB-C terminal dubbed the “Neuron” that then connects to your PC. None of the cables used with the Raise are permanent, so they can be easily replaced if you prefer custom cables for your setup.</p><p id=\"yuteCf\">Dygma uses its own proprietary software to remap keys and macros called Bazecor. This software is available for PC, Mac, and Linux. The interface is very easy to use and encourages tinkering with your settings to make the Raise your own. Bazecor allows you to control the RGB lighting on a per-LED basis but currently doesn’t offer any animations aside from the lighting effects baked into the keyboard’s firmware.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/V7Ky9mEmu7ZfHq72O-5vfHFSgrw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283376/Screenshot_2022_03_02_134634.png\">      <cite>Image: Alice Newcome-Beill</cite>      <figcaption><em>The Bazecor interface is clean and to the point.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/L7Knt9etxQhoCIeT0nCThfdiJVM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283377/Screenshot_2022_03_02_134650.png\">      <cite>Image: Alice Newcome-Beill</cite>      <figcaption><em>Shifting to the second layer changes the lighting and reveals alternate functions.</em></figcaption>  </figure></div></div></div><p id=\"xpUx2W\">All your macros, layers, and any other custom configurations made with Bazecor are stored in the Neuron, meaning that everything will remain the same regardless if you switch the keyboard between different computers. This also means that you don’t need to keep Bazecor running in the background to keep your settings in place.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Tr2j3K0TNQKpvtq8x3aK2OKMf-Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280860/akrales_220228_5044_0097.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The brains of the operation, the “Neuron.”</em></figcaption>  </figure><p id=\"pRSp5u\">There are a couple of features that are essential to how this keyboard operates. Layers allow the keyboard to store secondary key functions under the existing 60 percent layout when you press or hold a key. This provides access to commonly used things like arrow keys and media controls.</p><p id=\"smEpjz\">The other feature is the eight-bar, a cluster of eight keys right around where you’d normally find the spacebar. While you can remap these to any function, by default these keys are used to shift between layers. In addition to unique functions, each layer can be assigned its own RGB lighting, allowing you to visibly highlight the keys you need, a clever and helpful touch.</p><p id=\"BXjj1b\">Getting the Raise set up and configured was a breeze, but getting used to its layout was far more difficult, especially as someone that typically uses full-size keyboards. But unlike what you might expect, it wasn’t the split design that tripped me up — it was the condensed 60 percent layout. I lost count of how many times I caught myself reaching for arrow keys or my number pad and suddenly realizing there were none. My first couple of days with the Raise were spent tripping over keys and reaching for functions that were no longer there, eliciting more than their fair share of frustration and audible groans. While I eventually got used to its somewhat alien layout, I still ended up glancing at my keys more often than I would’ve liked. The Raise isn’t unique in this respect — many split ergonomic boards have a steep learning curve when you first start using them and can take weeks to get acclimated to depending on your typing style and use cases.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C_hcmiDOjYPjaFoLY0vPiskYzzg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280864/akrales_220228_5044_0139.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>In the year 2022 even the keyboards socially distance.</em></figcaption>  </figure><p id=\"Fa6jMG\">While there is that steep learning curve for this keyboard, especially for anyone used to larger-sized keyboards, the skill ceiling is high. You only need to pay a quick visit to the macros page of the <a href=\"https://dygma.notion.site/Dygma-Wiki-6e8905e1f928496a8736f7dc29e432bb\">Dygma Wiki</a> or this <a href=\"https://www.reddit.com/r/DygmaLab/comments/ninu57/what_are_your_favourite_macros_share_them_here/\">Reddit thread</a> to get a feel for what’s possible if you really commit to this keyboard.</p><p id=\"iulFKA\">Here's how the Dygma Raise sounds with Cherry Silver switches:</p><div id=\"2RZoRU\"><audio controls=\"\"><source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23283693/My_recording_2.mp3\" type=\"audio/mp3\"></source></audio></div><p id=\"dmsu4R\">I fully respect that for some users this keyboard is a match made in heaven, but unfortunately for me, it felt more like a shotgun wedding. Even after spending a considerable amount of time with the Dygma Raise, I’m not entirely sure this keyboard is for me, or even for most keyboard users. You really have to commit to the ergonomic design and quirks of the 60 percent layout to enjoy using this board.</p><div class=\"c-float-right\"><div id=\"iGvI3x\"><div data-anthem-component=\"aside:9444621\"></div></div></div><p id=\"tIiAFk\">For anyone that’s intrigued by the design of the Dygma Raise, but is understandably turned off by the massive price tag, there are a number of less expensive options out there for you to experiment with. As I mentioned earlier, the Moonlander keyboard from ZSA is easily the closest analog, but still retains a relatively high price of around $270. There are a few slightly less expensive options, however, like the Kinesis Freestyle Edge that comes in at around $200.</p><p id=\"CukF5G\">Dygma also recently launched a Kickstarter campaign to fund a project that builds on the foundations of the Raise keyboard by adapting and refining it into an ortholinear design. Given the amount of care and attention that went into their initial design, I’m excited to see what they come up with next.</p><p id=\"L626ln\">While the cost of this keyboard may be prohibitive for many, the Raise does bring a different take to the typically staid ergonomic keyboard world. If you’re a 60 percent keyboard enthusiast that can overlook a colossal price tag, and is looking for your next obsession, the Dygma Raise is definitely worth considering.</p><p id=\"WrhPYZ\"></p><p id=\"YgwOdY\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ji_x-thFnwDZ-uFaNPG65EVDXZo=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23283785/anbeill_220302_5044_0001.jpg",
  "description": "A keyboard that demands both time and respect",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}