{
  "title": "Dyson’s launching a new and improved Airwrap this summer",
  "url": "https://www.theverge.com/2022/3/18/22984636/dyson-airwrap-2022-beauty-tech-hair-curler",
  "date": "2022-03-18T15:32:01.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xYpKpQbRUajrzF4NU1g6aCQjnPM=/0x86:2048x1451/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70641359/308_full_suite_newsroom.5.jpeg\" />        <figcaption>Image: Dyson</figcaption>    </figure>  <p id=\"old5lg\">It’s hard to escape the Dyson Airwrap online. Beauty influencers gush about its powers all over TikTok, Instagram, and YouTube. But you may want to hold off on investing in one. Dyson <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.dyson.com%2Fnewsroom%2Fnews%2Fproduct%2Fnew-dyson-airwrap-multistyler&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F18%2F22984636%2Fdyson-airwrap-2022-beauty-tech-hair-curler\" rel=\"sponsored nofollow noopener\" target=\"_blank\">announced</a> on Thursday that it’s coming out with a new version of the Airwrap later this summer — and this one will be able to curl hair in both directions. The new Airwrap with all the attachments will cost $599. </p><p id=\"WJuup2\">If you’re unfamiliar with the <a href=\"https://www.theverge.com/circuitbreaker/2018/10/9/17958016/dyson-airwrap-styler-vacuum-hair-curler-pricing-features-coanda-effect\">original Airwrap</a>, it’s a hair curler that relies on something called the <a href=\"https://en.wikipedia.org/wiki/Coand%C4%83_effect\">Coanda effect</a> instead of heat. It uses a high-pressure motor to pull the hair onto the barrel, allowing users to style their hair “with air” while reducing the risk of heat damage. If you’ve ever seen it in action, it almost looks like hair magically latches onto the barrel. </p><p id=\"Wqyj8w\">One of the bigger pain points, however, with the original Airwrap was that you had to switch out attachments if you wanted to change up curl patterns. (You don’t always want to curl in the same direction all across your head, for example.) However, the second iteration of the Airwrap will allow you to switch directions by twisting the flow switch on the tip of the barrel. The bi-directional barrels will come in 30mm, 40mm, 30mm long, 40mm long, and 20mm long variations.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-5iWm7mOsWG2oToLy0iZ-V5ygMk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23326949/308_full_range.png\">      <cite>Image: Dyson</cite>  </figure><p id=\"7hxgrM\">On top of bi-directional curling, the new Airwrap will also purportedly work faster and comes with a bunch of new attachments. There’s a new Coanda smoothing dryer, which seems to bring the Dyson Supersonic’s Flyaway attachment to the Airwrap. The idea is to take your hair from wet to damp while also hiding flyaways. There are also now firm and soft brushes for straighter styles.</p><p id=\"xXn6gY\">If you’ve already shelled out the big bucks for the original Airwrap, there’s some good news. You can upgrade to the new attachments without having to buy another version of the Airwrap itself. However, it’s still up in the air when exactly this summer it’ll launch. </p><p id=\"qJZrV3\">Historically, Dyson’s hair gadgets have been on the pricier side. In fact, most reviews tend to grapple with the question of whether the tech in the gadgets is worth the several hundreds of dollars each one costs. Dyson’s <a href=\"https://www.theverge.com/2016/12/21/14031190/dyson-supersonic-hair-dryer-review\">Supersonic hair dryer</a> costs $400, while its <a href=\"https://www.theverge.com/2020/3/10/21172165/dyson-corrale-hair-straightener-styling-tool-announcement\">Corrale hair straightener</a> costs $500. That steep price hasn’t stopped the Airwrap from constantly going out of stock, however. One thing’s for sure, though — the beauty influencers are <a href=\"https://vm.tiktok.com/ZTdfxxbaG/\">currently</a> <a href=\"https://vm.tiktok.com/TTPdfGtDYe/\">losing their</a> <a href=\"https://vm.tiktok.com/ZTdfswQuY/\">marbles</a> <a href=\"https://vm.tiktok.com/ZTdfsTb4Y/\">over the news</a>. </p><p id=\"coTvRc\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fMhwrIguONiy8aO7vvlqsSyCa_0=/0x232:2048x1304/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23327075/308_full_suite_newsroom.jpeg",
  "description": "You’ll be able to curl in both directions without switching attachments.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}