{
  "title": "Dyson’s bizarre new headphones have a built-in air purifier",
  "url": "https://www.theverge.com/2022/3/30/23000577/dyson-zone-noise-cancellation-headphones-built-in-air-purifier",
  "date": "2022-03-30T05:00:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/shPq4t0X16fsmFZslk9M_kg4dM8=/300x0:2922x1748/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70688257/Screen_Shot_2022_03_29_at_4.32.01_PM.0.png\" />        <figcaption>Image: Dyson</figcaption>    </figure>  <p id=\"xAy5lP\">Dyson is getting into headphones in the most Dyson way possible: <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.dyson.com%2Fwearables%2Fdyson-zone-air-purifying-headphones%2Fannouncement&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F30%2F23000577%2Fdyson-zone-noise-cancellation-headphones-built-in-air-purifier\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the Zone</a>, a pair of noise-canceling Bluetooth headphones with <a href=\"https://www.theverge.com/2020/2/4/21122107/dyson-patent-application-wearable-air-purifier-headphones\">air purification technology built in</a>, thanks to a bizarre-looking magnetic face visor. It’s both the strangest and most ambitious product that the company has ever made. </p><p id=\"wFtqfF\">Today’s announcement is just an initial reveal of the Zone headphones ahead of a fall release date, and Dyson isn’t announcing specific details like price or specifications (including how much the headphones weigh or how long the battery will last) at this time. </p><p id=\"5kVfPE\">The goal of the Zone is to make living in urban spaces more comfortable by attempting to mitigate both air and noise pollution.</p><div class=\"c-float-right\"><aside id=\"83Q6kt\"><q>No word on price yet</q></aside></div><p id=\"mxDquT\">The air purification half of the Zone doesn’t reinvent the wheel for Dyson. Instead, it miniaturizes the company’s existing air filtration technology into a unique form factor. The Zone pulls in air through each earpiece using a pair of tiny compressors. The air is then filtered and piped through the (slightly bizarre-looking) “visor” for the user to breathe in — sans most of the particles and pollutants. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tD_3P-oo5Vabffz9YQhn33rNfwM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23354868/WBbhoTS.png\">      <cite>Image: Dyson</cite>      <figcaption><em>The visor doesn’t touch your face.</em></figcaption>  </figure><p id=\"8xuqKz\">Despite what it looks like, the visor doesn’t make contact with your face like a mask would. Instead, it sits in front of your face, creating a gap where a bubble of clean air can gather and be breathed in. (The company showed off a separate attachment that could be clipped on in instances where you might need a proper full-contact face mask, too.)</p><p id=\"P2wKuf\">The visor snaps on through a series of magnets, allowing for it to be removed if you just want to use the headphones as headphones. It also has hinges that flip it down so that you can talk to people normally without having to take off the whole apparatus. The Zone’s filtration system also offers multiple settings for different levels of exertion. For example, if you’re running up a flight of stairs or trying to catch a bus, you’ll breathe heavier (and need more air) than if you’re on a leisurely stroll. There’s even an automated setting that uses accelerometers to automatically adjust the airflow. </p><div class=\"c-float-right\"><aside id=\"HgQDTm\"><q>The mask is removable, and flips down for “conversation” mode</q></aside></div><p id=\"16jyzi\">Dyson says the Zone can filter out up to 99 percent of particle pollution — although the filters aren’t reusable and will need to be replaced after about a year. (The company says the exact amount of time will depend on how much air pollution you encounter and how actively you use the headphones.) </p><p id=\"Zsk7C7\">The headphone part is a little more traditional, despite being a new product category for Dyson. The company says its goal with the Zone was to create “faithful” reproductions of a musician’s original tracks. Noise cancellation is provided through a mix of passive cancellation from the overall design and active noise cancellation through a series of microphones. </p><p id=\"P63P4G\">There are three different modes for noise cancellation on the Zone. Isolation mode has active ANC when the face visor is raised. Lowering the visor automatically shifts into conversation mode, which disables ANC so you can hear the person you’re talking to. There’s also a transparency mode, which filters out important sounds like car horns and sirens. Charging is done over USB-C, and the headphones connect to a Dyson Link app, which can provide more detailed information on the air quality around you.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_yT6FhYQihh1F9ZOdY30kO0jWOk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23353718/Screen_Shot_2022_03_28_at_8.06.57_AM.png\">      <cite>Image: Dyson</cite>      <figcaption><em>The Dyson Zone on the company’s testing platform, Frank.</em></figcaption>  </figure><p id=\"CQbC3P\">I was able to try a prototype of the Zone a few weeks ago, and it certainly seems to do what the company claims. I could feel the jets of air being pumped in front of my face — although I was indoors, so it was hard to tell just how much cleaner it was. </p><p id=\"ydMX28\">ANC worked well, too (but, again, a quiet hotel room isn’t the best test scenario), and the audio quality for music was good without particularly dramatic bass (which, arguably, was the company’s goal). </p><div class=\"c-float-right\"><aside id=\"07pg9K\"><q>Despite Dyson’s efforts, the Zone headphones are big and heavy</q></aside></div><p id=\"ojfAXD\">On the flip side, the Zone headphones are also <em>very</em> big and noticeably heavy. Dyson has done an admirable job of cramming all this technology into a pair of headphones, but they’re still comparatively bigger and bulkier than, say, a pair of Sony WH-1000XM4 headphones. Additionally, the whirring of the compressors was still slightly audible when the motors were running at faster speeds and I wasn’t listening to music to drown it out, even despite the noise cancellation. </p><p id=\"WO2H9f\">The Zone is certainly one of the most unique products from Dyson (or likely any company) that we’ll see this year. There are still a lot of crucial details we don’t know — including price and battery life. And while mask-wearing has been normalized considerably over the past two years, we’ll have to see whether customers will be willing to embrace this extremely odd-looking product. </p><p id=\"k83jnd\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tkjLypiFsZT007pwArzzVobJdVU=/0x31:3222x1718/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23353677/Screen_Shot_2022_03_29_at_4.32.01_PM.png",
  "description": "Ever wanted an air purifier with attached headphones? Boy, does Dyson have you covered.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}