{
  "title": "E-bike injuries on the rise even on well protected Dutch roads",
  "url": "https://www.theverge.com/2022/4/13/23023361/e-bike-injuries-increased-risk-netherlands",
  "date": "2022-04-13T11:53:47.000Z",
  "author": "Thomas Ricker",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8SnCOH0-eR4uoVllMTBD9Yi-s6g=/0x51:1716x1195/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70743747/risk_groups.0.jpg\" />        <figcaption><em>You’re 1.6 times more likely to end up in the emergency room on an e-bike, compared to a regular bike, says report (translated by The Verge).</em> | Image: VeiligheidNL</figcaption>    </figure>  <p id=\"RTCjVy\">A <a href=\"https://www.veiligheid.nl/verkeer/actueel/aantal-verkeersslachtoffers-met-ernstig-letsel-blijft-stijgen\">new study from VeiligheidNL</a>, a Dutch organization focused on the prevention of injuries, concludes that e-bike riders have a greater risk of injury than riders on ordinary bicycles. It concedes, however, that more research is needed to identify the underlying causes.</p><p id=\"r7Ap9z\">The Netherlands is perhaps one of the safest countries to ride a bicycle due to a preponderance of infrastructure designed to keep riders separated from other vehicle traffic. Bicycle safety is also taught to children in school, and many cities have enjoyed bicycle-first cultures for decades. </p><p id=\"xOV8rV\">Nevertheless, the report says that e-bike riders in the Netherlands were 1.6 times more likely than an ordinary bicyclist to end up in the emergency room, compared to twice as likely for racing bikes and three times for mountain bikes. The percentage of injured riders on e-bikes was also considerably higher (36 percent) compared to 2016 (19 percent). E-bike riders aged 12 to 17 were especially at risk of an emergency visit, accounting for 22 percent of victims versus just 4 percent in 2016. Women over 55 were also particularly vulnerable making up almost half of all e-bike victims (47 percent).</p><div class=\"c-float-right\"><aside id=\"ifrk7U\"><q>The main culprit in all bicycle injuries was the rider’s own behavior</q></aside></div><p id=\"7LDeEV\">Overall, the report concludes that the main culprit in all bicycle (regular and electric) injuries was the rider’s own behavior (44 percent) — a steering error, for example — while 32 percent was road conditions. And the majority of these accidents affected only the rider. Two-thirds of the 110,000 traffic victims treated in Dutch hospitals last year were cyclists, VeiligheidNL says. </p><p id=\"Xl0lTV\">Bicycle sales exploded globally during the pandemic, bringing new riders onto roadways for the first time, many on new electric bikes. In the Netherlands, a country with more bikes than people, electric bikes accounted for 52 percent of all bicycles sold in 2021, up from 29 percent in 2016, and just 15 percent in 2011, according to <a href=\"https://www.raivereniging.nl/binaries/content/assets/downloads/220310-rai-bovag-fietsverkoopstatistieken-2007-2021.pdf\">data compiled by the RAI Association</a>. More e-bike riders at least partially explains the uptick in e-bike injuries. </p><p id=\"Arwao3\">Last year in the Netherlands, 582 people died in traffic accidents (the lowest level since 2015) — 207 on regular bikes, 175 in cars, and 80 on e-bikes (up from 74 in 2020), according to <a href=\"https://www.cbs.nl/nl-nl/nieuws/2022/15/minder-verkeersdoden-in-2021\">a separate report</a> compiled by the Dutch national statistics office, CBS. Overall, 22 fewer cyclists were killed in traffic accidents in 2021 compared to the year prior.</p><p id=\"TuSxKO\">As a resident of Amsterdam for more than two decades, I’ve seen how e-bikes have transformed dedicated cycleways, especially in the last two years. In part due to the <a href=\"https://www.theverge.com/2017/6/23/15860492/vanmoof-electrified-s-2017-preview\">asshole factor</a>, there’s now a wider disparity of speeds on bicycle lanes, exacerbated by the many companies that make it trivial to bypass the EU speed limit of 25km/h (15.5mph). Those protected bike lanes are now more congested as well, due to an overall increase in bicycle usage. It’s also worth noting that the Dutch don’t wear helmets — not even amongst vulnerable groups like children or the elderly — and officials aren’t keen to mandate them because it might curtail bicycle usage, putting important environmental goals further out of reach. </p><p id=\"MCZk8Z\"></p><p id=\"fwnzL9\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/JZejzz9pZS8lwiK_zCXPqlOoBIU=/0x174:1716x1072/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23386508/risk_groups.jpg",
  "description": "1.6 times more likely to end up in the emergency room",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}