{
  "title": "EA is ditching the FIFA branding starting with next year’s soccer game",
  "url": "https://www.theverge.com/2022/5/10/23065405/ea-sports-fc-fifa-branding",
  "date": "2022-05-10T16:58:26.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/lZ00auoDnMUCY1UsX3dthZuCBdU=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70852956/image002.0.jpg\" />        <figcaption><em>EA is moving on from one of the most recognizable brands in gaming.</em> | Image: EA</figcaption>    </figure>  <p id=\"pe5BEt\">EA is officially dropping the FIFA branding for its hit soccer video games starting with next year’s release, the company announced Tuesday. The new title for the games will be <em>EA Sports FC</em>.</p><p id=\"vPAVKL\">Despite the name change, it sounds as if much of the DNA of the FIFA games will remain the same. “Everything you love about our games will be part of <em>EA Sports FC</em> — the same great experiences, modes, leagues, tournaments, clubs and athletes will be there,” EA’s Cam Weber <a href=\"https://www.ea.com/news/ea-sports-fc\">said in a blog post</a>. “Ultimate Team, Career Mode, Pro Clubs and Volta Football will all be there. Our unique licensing portfolio of more than 19,000+ players, 700+ teams, 100+ stadiums and 30 leagues that we’ve continued to invest in for decades will still be there, uniquely in <em>EA Sports FC</em>. That includes exclusive partnerships with the Premier League, LaLiga, Bundesliga, Serie A, the MLS — and more to come.”</p><p id=\"g6MiUb\">Weber said that EA will share more information about <em>EA Sports FC</em> in summer 2023. He also promised EA is “committed to ensuring the next FIFA is our best ever, with more features, game modes, World Cup content, clubs, leagues, competitions, and players than any FIFA title before.” </p><div class=\"c-float-right\"><aside id=\"TXOmgL\"><q>EA ditching the FIFA branding isn’t a total surprise</q></aside></div><p id=\"PVn4dA\">EA ditching the FIFA branding isn’t a total surprise. EA <a href=\"https://www.ea.com/news/fifa-22-and-the-future-of-football\">publicly announced last year</a> that it was “reviewing our naming rights agreement with FIFA.” And leaked comments from EA CEO Andrew Wilson indicated he was dissatisfied with the company’s branding deal with FIFA. “Basically, what we get from FIFA in a non-World Cup year is the four letters on the front of the box,” he said, <a href=\"https://www.videogameschronicle.com/news/eas-ceo-tells-staff-its-been-impeded-by-the-fifa-brand-its-four-letters-on-a-box/\">according to <em>VGC’s</em> report on the comments</a>.</p><p id=\"vMWaxT\">And EA has also shown a recent willingness to make sports games with less splashy branding. The company is <a href=\"https://www.theverge.com/2021/2/2/22262471/ea-sports-college-football-video-game-ncaa-players\">bringing back college football games without college players</a> in a new game that’s expected to release <a href=\"https://www.sportingnews.com/us/ncaa-football/news/ncaa-football-video-game-release-date-ea-sports/ey42a5w6fpbh11uvijcnuj0bq\">in the summer of 2023</a>, and EA is also working on a new golf simulation game, <em>EA Sports PGA Tour</em>, that’s <a href=\"https://www.polygon.com/22991103/ea-sports-pga-tour-delayed-release-date-masters-augusta-national\">set to come out in spring 2023</a>.</p><p id=\"yDEDgX\">FIFA still plans to work with other publishers on future games with its branding. “A number of new non-simulation games are already under production and will launch during the third quarter of this year,” the organization said <a href=\"https://www.fifa.com/tournaments/mens/bluestarsfifayouthcup/2022/media-releases/fifa-diversifies-its-gaming-rights-and-launches-new-non-sim-football-games\">in a press release on Tuesday</a>. The first will be “a tailored gaming experience” focused around this year’s World Cup, which takes place in Qatar beginning in November.</p><p id=\"e8pJoX\">The organization also said that its work with EA for this year’s FIFA title is a “short-term extension” that “grants rights for the simulation football category only.” FIFA is planning to release “a major new FIFA simulation football game title” in 2024, though says it’s “currently engaging” with publishers, media companies, and investors about the game, which seems to indicate that the details aren’t fully nailed down.</p><p id=\"bzKnst\">FIFA president Gianni Infantino, perhaps unsurprisingly, still believes strongly in the FIFA name. “I can assure you that the only authentic, real game that has the FIFA name will be the best one available for gamers and football fans,” Infantino said in a statement. “The FIFA name is the only global, original title. FIFA 23, FIFA 24, FIFA 25, and FIFA 26, and so on — the constant is the FIFA name and it will remain forever and remain <em>the best</em>.”</p><p id=\"dQ1n5Z\"><em><strong>Update May 10th, 2:35PM ET</strong></em><em>: Added details about FIFA’s plans for future games.</em></p><p id=\"RkgBhr\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eLmuyx4lWbciW3yzFTdHsLI07WM=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23450778/image002.jpg",
  "description": "The FIFA series is getting a new name.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}