{
  "title": "EA reverses decision, will launch The Sims 4 wedding pack in Russia",
  "url": "https://www.theverge.com/2022/2/16/22937697/ea-the-sims-4-my-wedding-stories-relesase-russia",
  "date": "2022-02-16T20:31:03.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/olga4Hx9twfUfm2o-S5XzltNIIw=/148x0:1750x1068/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70518070/Screen_Shot_2022_02_10_at_12.05.58_PM.0.0.png\" />    </figure>  <p id=\"BsLY8K\">After previously announcing that <a href=\"https://www.theverge.com/2022/2/10/22927278/ea-sims-4-my-wedding-stories-russia-anti-gay-law\">it would not release a new <em>The Sims 4</em> wedding pack in Russia</a> due to the country’s anti-LGBTQ laws, EA has reversed course saying it will now sell <em>My Wedding Stories</em> in Russia with all its LGBTQ content and marketing intact. </p><p id=\"BSj8mU\">In <a href=\"https://www.ea.com/games/the-sims/news/our-commitment-to-you\">a post on its website</a> <em>The Sims</em> team wrote: </p><blockquote><p id=\"gTewKV\">Last week, we shared the below update about our upcoming game pack “My Wedding Stories.” At the time, we believed that our team could not freely share the storytelling of same-sex couple Cam and Dom in Russia and decided the best way to uphold our commitment to sharing their story was to not release this pack there.</p><p id=\"BawwuL\">Since then, we’ve been listening to the outpouring of feelings from our community including both support for our decision and concern for their fellow community members. It’s equally important for us to stand by our values, including standing against homophobia, and to share stories like this with those who want and need it most. </p><p id=\"keG2aa\">With this in mind, we’ve reassessed our options and realized we can do more than we initially believed and we will now release<em> The Sims 4 </em>“My Wedding Stories” Game Pack to our community in Russia,<em> unaltered and unchanged, </em>featuring Dom and Cam.</p></blockquote><p id=\"h9LgXx\"><em>My Wedding Stories</em> is a <em>The Sims 4</em> content pack that allows players to plan every aspect of a perfect wedding. Marketing materials for the pack featured lesbian couple Camille and Dominique and the story of their walk down the aisle. In Russia, anti-LGBTQ laws ban any content that celebrates or promotes “non-traditional sexual relationships among minors.” Out of concern that the queer couple at the heart of the game’s marketing would run afoul of that law, EA decided that it would not sell the pack in Russia, earning the company both praise and criticism from<em> Sims</em> fans.</p><p id=\"1UlMoT\">Originally slated for release on February 17th, this new development will delay the game to February 23rd.</p><p id=\"vxQtWN\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zDzruc-nx1hjYyMBMRBYSxBEeaA=/0x37:1898x1031/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23250304/Screen_Shot_2022_02_10_at_12.05.58_PM.0.png",
  "description": "Love apparently won.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}