{
  "title": "eBay’s Authenticity Guarantee now includes graded trading cards over $2,000",
  "url": "https://www.theverge.com/2022/5/2/23053530/ebay-authenticity-guarantee-trading-cards-pokemon-counterfeit",
  "date": "2022-05-02T18:15:02.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YUeASQMeV8u9fF_PPZpJTw9PtCY=/249x0:945x464/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70823372/Module5_3a_d2x.0.jpeg\" />    </figure>  <p id=\"edWJgg\">eBay is expanding its authentication services to include single graded trading cards over $2,000, the company <a href=\"https://www.prnewswire.com/news-releases/ebays-authenticity-guarantee-now-includes-graded-trading-cards-through-partnership-with-psa-301537037.html?tc=eml_cleartime\">announced</a> today. The company is partnering with third-party trading card authentication and grading service Professional Sports Authenticator (PSA) for the expanded service.</p><p id=\"L6pqyc\">eBay’s Authenticity Guarantee already includes <a href=\"https://www.theverge.com/2020/10/13/21514028/ebay-sneaker-con-authentication-100-guarantee-fake-counterfeit-limited-edition\">sneakers sold for over $100</a>, watches sold for over $2,000, and handbags sold for over $500. In January, eBay <a href=\"https://www.ebayinc.com/stories/news/ebay-launches-authentication-for-trading-cards/\">announced</a> it was launching authentication services for ungraded trading cards purchased on the platform for over $750.</p><p id=\"fk7MpT\">Grading a trading card involves sending it off to a third-party service that inspects the card’s condition and assigns it a rating. Graded cards often fetch more money because they’ve been inspected and rated using a standardized system. </p><p id=\"K8jAav\">PSA, the third-party authentication company that will handle the cards from eBay, will “verify that the card matches the listing description and that the sealed plastic holder and label are authentic and have not been tampered with or counterfeited,” according to the press release. Fake trading cards are a niche but real problem for some — Logan Paul famously bought $3.5 million worth of Pokémon cards that <a href=\"https://www.insider.com/logan-paul-35-million-box-pokemon-cards-he-bought-fake-2022-1\">turned out to be fake</a>. eBay’s authentication service will eventually expand to include graded cards sold for over $250.</p><p id=\"1WQHJl\">Collecting and reselling trading cards experienced an enormous boost during the pandemic as many people were stuck at home. At one point, wait times to get a Pokémon card graded stretched into months as companies like PSA dealt were <a href=\"https://www.theverge.com/2021/4/30/22413108/pokemon-trading-card-collectors-overwhelm-grading-collecting-rating\">inundated with cards</a>. Perhaps that’s why eBay specified that the team at PSA handling its cards is separate from the people working through the backlog, which, according to an <a href=\"https://anchor.fm/thepsapod\">April 28th podcast</a>, stood at “under four million” cards.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IeVB9iAigorBHbbfl06mGadzmr0=/154x0:1040x464/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432977/Module5_3a_d2x.jpeg",
  "description": "Handbags, watches, and sneakers are also authenticated.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}