{
  "title": "Echelon persuades USPTO that Peloton’s streaming tech is unpatentable",
  "url": "https://www.theverge.com/2022/1/31/22910520/peloton-echelon-connected-fitness-streaming-patents",
  "date": "2022-01-31T21:58:45.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Pelton Bike Plus in an apartment\" src=\"https://cdn.vox-cdn.com/thumbor/UjW-TqIlWoShvFaWi5Y6kf6XXY4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70455239/akrales210108_4344_0020.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"0mhvN8\">In some more bad news for Peloton, rival Echelon Fitness has persuaded the US Patent and Trademark Office that two of Peloton’s patents related to streaming and on-demand classes aren’t actually patentable. The decision was made last week by the USPTO’s Patent Trial and Appeal Board as they were found to be “<a href=\"https://www.ipwatchdog.com/2014/02/01/when-is-an-invention-obvious/id=47709/\">obvious inventions</a>,” according to <a href=\"https://news.bloomberglaw.com/ip-law/echelon-wins-administrative-challenges-to-two-peloton-patents\"><em>Bloomberg Law</em></a>. While it may not be the biggest blow Peloton has faced in recent months, it does raise questions about the company’s tendency to be heavy-handed with patent lawsuits.</p><p id=\"zgQ6s5\">To back things up, all this came about after Peloton <a href=\"https://www.latimes.com/business/story/2019-10-08/peloton-sues-cycling-rival-echelon\">sued Echelon in 2019</a> for getting a “free ride” off its technology and thereby flooding the market with cheaper copycat imitators. If you’ve ever considered buying a connected fitness bike, you’ve probably come across Echelon as a popular Peloton alternative, as they cost a fraction of the price. (Also, Echelon had a kerfuffle with Amazon in 2020 over a supposed partnership to create a <a href=\"https://www.theverge.com/2020/9/23/21452145/amazon-prime-bike-500-disavow-echelon-fitness-peleton-competitor\">$500 Prime Bike</a>.)  However, once the legal brouhaha began, Echelon countersued and asked that two of the patents in question — Nos. 10,322,315 and 10,022,590 — be reviewed. Both relate to a “system and method for providing streaming and on-demand exercise classes.” In its final decision, the appeal board agreed with Echelon, saying the inventions weren’t unique enough compared to prior patents and therefore shouldn’t have been issued in the first place. You can read the full decisions <a href=\"https://developer.uspto.gov/ptab-web/#/search/documents?proceedingNumber=IPR2020-01187\">here</a> and <a href=\"https://developer.uspto.gov/ptab-web/#/search/documents?proceedingNumber=IPR2020-01186\">here</a>. </p><p id=\"MhJU1b\">Obviously, Echelon is pleased with the findings, with CEO Lou Lentine telling the <a href=\"https://www.timesfreepress.com/news/business/aroundregion/story/2022/jan/28/echelon-cites-wins-two-patent-cases-rival-peloton/562379/\"><em>Chattanooga Times Free Press</em></a> it’s a “big win” after spending a “lot of money fighting these guys.”<em> The Verge </em>reached out to Peloton for an official comment but didn’t immediately receive a response. It appears Echelon isn’t willing to let sleeping dogs lie: The company also told <em>The Verge </em>in an e-mail that it recently filed a separate counterclaim against Peloton that added allegations that it pushed <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.scribd.com%2Fdocument%2F556095751%2FRedacted-DI-221-Amended-Counterclaims-Against-Peloton-Interactive-Inc&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F1%2F31%2F22910520%2Fpeloton-echelon-connected-fitness-streaming-patents\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Affirm into cutting ties with competitors</a>, hampering consumer financing efforts, along with other bullying tactics.</p><div class=\"c-float-right\"><aside id=\"V3Jfof\"><q>This isn’t even Echelon’s only ongoing patent battle with Peloton</q></aside></div><p id=\"Jijfy1\">Companies are always sniping at each other over patents. This isn’t even Echelon’s only ongoing patent battle with Peloton. In November, Peloton was granted another patent for its on-demand classes. It then <a href=\"https://www.theverge.com/2021/11/15/22783952/peloton-fitness-tech-echelon-ifit-nordictrack\">sued both Echelon and iFit</a>, another rival that owns the NordicTrack brand. What makes this notable is it perhaps pokes a hole in Peloton’s strategy for handling rivals thus far: <a href=\"https://www.bloomberg.com/news/features/2021-04-16/peloton-s-revolutionary-technology-faces-test-in-patent-wars?sref=ExbtjcSG\">burying them in legal battles</a>.</p><p id=\"esnNdV\">One of the more memorable examples was when Peloton took on smaller boutique rival Flywheel. In 2018, it alleged Flywheel had <a href=\"https://www.reuters.com/article/ip-patent-peloton/peloton-picks-patent-fight-with-rival-indoor-cycling-start-up-idUSL2N1VY2AX\">copied its patented tech</a>, specifically the leaderboard which displays where a user stands in comparison to others in a given class. Flywheel lost the battle, agreeing to <a href=\"https://www.theverge.com/2020/2/5/21125153/peloton-flywheel-copy-bike-tech-ip-infringement-settlement-cycling\">nix its leaderboard</a> and eventually <a href=\"https://www.theverge.com/2020/2/19/21144268/flywheel-digital-classes-shut-down-peloton-exercise-trade-in\">shutting down its virtual classes entirely</a>. The Flywheel bikes <a href=\"https://www.theverge.com/2020/2/20/21145349/flywheel-bike-shut-down-email-user-reactions-peloton-trade-in\">were then bricked</a>, and users were only left with one real option: take up Peloton’s offer to trade in the bike for a refurbished Peloton. Ever since, Flywheel has served as a sort of cautionary tale — both for consumers looking to buy a smart exercise bike and companies in the connected fitness space.</p><div><aside id=\"l7ZFP6\"><q>But while Peloton was successful against Flywheel, the stakes are a bit different now</q></aside></div><p id=\"1WZKmo\">But while Peloton was successful against Flywheel, the stakes are a bit different now. Despite experiencing massive success during the pandemic, Peloton’s luck hasn’t <a href=\"https://www.theverge.com/22778851/peloton-growing-pains-connected-fitness-tonal-hydrow-mirror\">been good as of late</a>. One reason for Peloton’s reversed fortunes is increased competition, and it appears the <a href=\"https://www.cnn.com/2022/01/12/health/online-fitness-training-in-person-workouts-wellness/index.html\">at-home fitness trend is here to stay</a>. This lawsuit-heavy tactic may have worked a few years ago, but it’s hard to see how it will play out in Peloton’s favor when it’s currently <a href=\"https://www.theverge.com/2022/1/20/22893462/peloton-bikes-treadmills-production-connected-fitness\">mulling cost-saving measures</a> after overextending itself in 2020 and 2021, especially since this kind of patent war isn’t always smart. According to a <a href=\"https://www.bloomberg.com/news/features/2021-04-16/peloton-s-revolutionary-technology-faces-test-in-patent-wars?sref=ExbtjcSG\"><em>Bloomberg</em> report</a>, the risk with Peloton’s strategy is that it could backfire if courts deem that its “revolutionary technology” isn’t so revolutionary after all. As in, what just happened with Echelon. Should this occur on a wider scale, Peloton risks finding itself out millions of dollars and without legal protections for the core of its business. </p><p id=\"dSqneM\">Peloton is expected to present its latest earnings on February 8th, which should reveal more about its current financial health. Despite recent struggles, the company still looms large in the connected fitness space. However, we’ll have to see how it adapts to the new fitness tech landscape — and where patent wars fit going forward.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tGOO-mXtMwbXNM-_lmsgXVkHaaM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22233853/akrales210108_4344_0020.jpg",
  "description": "It’s too late for Flywheel, but this is good news for Peloton’s rivals",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}