{
  "title": "Eero’s top-of-the-line mesh Wi-Fi router is faster but flakier",
  "url": "https://www.theverge.com/23057029/eero-pro-6e-review-mesh-router-6-ghz-thread",
  "date": "2022-05-05T15:30:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "  <p>The Eero Pro 6E is the company’s first 6GHz-capable router</p> <p class=\"p--has-dropcap p-large-text\" id=\"awSKje\">As Eero’s latest top-of-the-line mesh Wi-Fi router, the tri-band <a href=\"https://www.amazon.com/dp/B091G64GVK?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Eero Pro 6E ($299 to $699)</a> is another leap forward in home Wi-Fi for the company that popularized mesh Wi-Fi systems. And the Pro 6E certainly delivers. I saw significantly faster speeds over the previous generation <a href=\"https://www.theverge.com/22193059/eero-pro-6-review-mesh-router-wifi-6-test-speeds-network\">Eero Pro 6</a> in my tests. But I also saw some network drop-offs, which Eero says is an issue around the Thread implementation — a key part of support for the coming <a href=\"https://www.theverge.com/22787729/matter-smart-home-standard-apple-amazon-google\">smart home standard Matter</a> that <a href=\"https://www.theverge.com/22741839/eero-ceo-confirms-matter-support-thread\">Eero has committed to</a>. The overall increased speed is thanks to the new 6GHz Wi-Fi band and some extra 160MHz channels on the 5GHz band. While 6GHz devices are still few and far between, lots of devices can take advantage of the 160MHz channels, and I saw speed boosts on all devices, not just those that could use the new band. </p><p id=\"LElRxB\">This is also the first Eero to support faster than gigabit speeds, so if you have a multi-gigabit connection, you can actually use it. But, as the price reflects, the Eero Pro 6E is not a pro-level router; while it supports incoming wired speeds up to 2.5Gbps, its wireless speeds top out at 1.3Gbps. So, if you have a multi-gigabit connection, you may want to consider a more powerful router. </p><p id=\"pquw0g\">If you have single gigabit speeds, you’ll want to look at the cheaper <a href=\"https://www.amazon.com/Introducing-Amazon-eero-dual-band-support/dp/B08ZK2BHP2?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Eero 6 Plus</a>  ($139 to $299) — a new dual-band (without 6Ghz) gigabit system. If you’re running under 500mbps, the <a href=\"https://www.amazon.com/dp/B085WSCTS4?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Eero 6</a> ($89 to $169) may be more your speed. All this means the Pro 6E has a slim target audience; those with gigabit speeds and who have or might have 6GHz capable devices in the future. </p><div id=\"xHpwx7\"><div data-anthem-component=\"scorecard:11176736\"></div></div><p id=\"3qbAEY\">However, If you are in that audience and are looking for an advanced plug-and-play setup for gigabit internet service, you won’t be disappointed. And, as with all Eero devices, the Pro 6E offers a super simple setup, an easy-to-use app interface, and useful features like parental controls and historical network data usage (although these are behind a paywall). </p><p id=\"jz8uId\">What you won’t get is a pro setup or management options (despite the name). You can only manage your network through the app, which is fine for most people, but not for true networking geeks. There are only two ethernet ports on each router, so if you need more, you’ll have to use a network switch. And Eero’s system is entirely cloud-based, which can make it trickier to self-troubleshoot. This also raises privacy implications for the Amazon-owned company (see Smart Home Data Privacy sidebar for more details). </p><p id=\"TXIdt4\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"A close-up photo of the white Eero Pro 6E router, connected in a home.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KMIqusXI1q_OQ_pHUJZVYzdADMU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418308/jtuohy_220426_5170_0008.jpg\">      <figcaption><em>The Eero Pro 6E adds the brand new 6GHz band to your home Wi-Fi, providing more space for more devices on your network.</em></figcaption>  </figure></div><h1 id=\"pb8gKA\">Why we need 6Ghz</h1><p class=\"p--has-dropcap\" id=\"UY2fH1\">Six years ago, Eero launched its first mesh Wi-Fi system with the promise of fixing home Wi-Fi. As one of the earliest consumer mesh routers, Eero offered a simple solution to the complicated problem of home networking. With mesh, instead of having to camp out in front of your modem to get a strong enough signal to FaceTime on your iPad, you could make video calls from the comfort of your bed. </p><p id=\"T4HixV\">Fast forward to today, and the Eero Pro 6E looks to tackle the next home Wi-Fi problem; congestion. Since Wi-Fi has become so ubiquitous and the smart home has proliferated, we’ve loaded up our networks with gadgets and gizmos galore in every corner of the house. Be it laptops, robot vacuums, televisions, wireless speakers, smart bulbs, or a smart plug or two, most of us have multiple Wi-Fi-dependent devices in our homes. With so many devices competing for coverage, it’s easy to make a mesh Wi-Fi system sweat some megabits, dragging down your network and causing real pain. </p><div class=\"c-float-right c-float-hang\"><aside id=\"98uoyK\"><q>The Pro 6E download speeds were two to six times faster</q></aside></div><p id=\"tF87ka\">The Eero Pro 6E aims to fix this by taking advantage of the <a href=\"https://www.theverge.com/2020/4/23/21231623/6ghz-wifi-6e-explained-speed-availability-fcc-approval\">new 6GHz Wi-Fi band</a>. A tri-band mesh router, it adds this new band to the existing 2.4 and 5GHz bands we’re all familiar with. Not to be confused with Wi-Fi 6 (which was more of an incremental upgrade), Wi-Fi 6E adds a whole new frequency band. With its ability to support 160MHz of bandwidth, 6E’s 6GHz band let’s traffic drive along your network at its top speeds. But, very few devices can use 6GHz yet; it’s largely limited to a few high-end smartphones and gaming laptops. </p><p id=\"hIcONq\">If you have one of those devices and aren’t satisfied with the speeds you’re getting with your current router, upgrading to a Wi-Fi 6E router is an easy choice. Still, even if you don’t, there are some reasons to consider the Eero Pro 6E, primarily that it supports 160MHz wide channels on both the 5 and 6GHz bands, which helps reduce congestion on your network and significantly improves speeds.</p><p id=\"jeSFxn\">The Pro 6E is also slightly more affordable than other tri- or quad-band 6E mesh routers, starting at $299 for a single router to cover up to 2,000 square feet, $499 for a two-pack for 4,000 square feet, and topping out at $699 for a three-pack (for 6,000 square feet). The Asus ZenWifi Pro ET8 starts at $530 for two, and Netgear’s souped-up <a href=\"https://www.theverge.com/2021/10/12/22716979/netgear-orbi-quad-band-wi-fi-6e-mesh-router-release-date-specs-price\">quad-band Orbi</a> is an eye-watering $1,500 for a three-pack. However, competition in the lower end is growing, with TP-Link jumping into the fray last month with <a href=\"https://www.theverge.com/2022/4/11/22979247/tp-link-xe75-affordable-wifi-6e-mesh-router\">a $300 option</a>.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/T_JJ6w0r_z4ttkfzx-n7qAMM7LI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418305/jtuohy_220426_5170_0003.jpg\">      <figcaption><em>Each Pro 6E device has two ethernet ports and a USB-C power connector.</em></figcaption>  </figure></div><h1 id=\"7IFUfv\">Eero Pro 6E: Specs and design</h1><p class=\"p--has-dropcap\" id=\"CQ1KQK\">The Eero Pro 6E retains the same small attractive design as the Pro 6 with just a few minor tweaks. This is a big selling point of Eeros, as they are easy to fit into your home without wanting to hide them in a cupboard. While I appreciate the lack of a “dead black spider” aesthetic here, <a href=\"https://www.theverge.com/2016/12/6/13843536/google-wifi-review-mesh-router-system-vs-eero\">Google Wi-Fi</a> is still my favorite in terms of design.</p><div class=\"c-float-right c-float-hang\"><div id=\"nqJwaZ\"><div data-anthem-component=\"aside:11176833\"></div></div></div><p id=\"cKTCvC\">Under the hood, the Pro 6E has a few key upgrades over the Pro 6, including the addition of that 6GHz channel (which replaces one of the 5GHz channels in the Pro 6, keeping the Pro 6E a tri-band system) and support for 2.5Gbps wired and 1.3Gbps wireless maximum speeds. The Pro 6E is rated as an AX5400 system, which is not quite as high as the other 6E routers on the market, which might have quad-band systems (2.4GHz, 5GHz low, 5GHz high, and 6GHz) or more advanced antenna arrays. This rating is an obtuse way to express the features and theoretical maximums of the wireless speeds from the router but doesn’t indicate what speeds you’ll actually see when you use it.</p><p id=\"1xDy46\">The Pro 6E supports over 100 devices simultaneously (compared to 75 with the Pro 6). Each Eero node is a complete router with two ethernet ports, but the Pro 6E has a 2.5GbE and a 1.0GbE port to support multi-gig internet, whereas the Pro 6 has two 1.0 GbE ports. Power comes from a USB-C wall adapter. Though the 6E can support <em>incoming</em> internet speeds of greater than one gigabit, since it doesn’t have two 2.5GbE ports, the speeds that it can send to your wired devices are capped at a gigabit.</p><p id=\"oViIqL\">Though the Pro 6E is a tri-band mesh system, like the Pro 6 before it, it doesn’t technically have a dedicated backhaul channel. Instead, Eero’s software “dynamically” chooses which band to use at any given time. The Pro 6E Eeros also support wired backhaul for directly connecting the nodes at 1Gbps speeds. </p><p id=\"O8JXVu\">As with the Pro 6, the Pro 6E doubles as a smart home hub, with a thread-capable 802.15.4 radio inside that can act as a <a href=\"https://staceyoniot.com/thread-101-what-you-need-to-know-about-this-smart-home-protocol-in-2021/\">Thread border router</a> (you can turn this on or off). It can also connect Zigbee-based lights, locks, and sensors to your network through integration with Amazon Alexa. </p><p id=\"T1wnqO\">This integration also lets you use Alexa voice control to manage your network, including turning off Wi-Fi to individual devices or profiles and setting up Routines to manage multiple actions — such as turning off the TV and the kids’ Wi-Fi at dinner time. This is a helpful feature and easy to use. The first time I attempted to pause the Wi-Fi to my daughter’s iPad, Alexa said, “Daughter’s iPad isn’t set up for Wi-Fi control. Do you want me to set it up for you and pause the Wi-Fi?” A simple “yes” and the Wi-Fi was off. To unpause Wi-Fi, you need to use the app. Unlike the Pro 6, there is <a href=\"https://support.eero.com/hc/en-us/articles/360036319531-How-to-use-HomeKit-with-your-eero-Network\">no support</a> for <a href=\"https://support.apple.com/en-us/HT210544\">Apple’s HomeKit secure router feature</a> on the Pro 6E.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3WF-SnJzoTB3UeOAimNs6CUq6WY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418311/jtuohy_220426_5170_0012.jpg\">      <figcaption><em>Eero’s rely on a wireless backhaul, although because there are two ports on each node you can setup a wired backhaul for faster, more consistent speeds.</em></figcaption>  </figure></div><h1 id=\"aXYNik\">Eero Pro 6E: Performance and speed</h1><p class=\"p--has-dropcap\" id=\"7DasIT\">The Eero Pro 6E download speeds were two to six times faster than my previous setup with the Pro 6. I tested the Eeros with a three-pack based on the company’s recommendation, even though my home is far smaller than the “6,000 square feet” of coverage the set is claimed to cover.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hUNlRCvgLjYinyhIwphI0aLth1E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23438599/Screenshot_20220504_155842_2.png\">      <figcaption><em>A speed test on the Pixel 6 connected to the 6GHz band shows the top speeds it reached (the incoming wired connection was 955Mbps).</em></figcaption>  </figure></div><p id=\"UsDG9w\">The test environment for this review was a 2,400-square-foot home built in the 1960s. It has three stories with brick walls. As a smart home reviewer, I have an unusually large number of devices on my network, averaging around 105 at any one time. That includes three computers, two smart TVs, multiple smart displays, and several gadgets such as smart light bulbs, switches, robot vacuums, door locks, and such, which are always connected but not always consuming data. </p><p id=\"6dKtDS\">I have a 1.2-gigabit Comcast cable internet connection and an Xfinity X1 modem with upload speeds of 35Mbps. I conducted speed tests with a Pixel 6 (that can use the 6GHz band), a MacBook, and an iPhone 13. All three devices saw impressive speed bumps. Standing near the gateway router, the Pixel 6 went from averages of 172Mbps to 713Mbps and — despite the Apple devices not being able to take advantage of the 6GHz band or the 160MHz channels — the iPhone 13 went from 233Mbps to 551Mbps. However, the Pixel 6, which can use both, was significantly faster than the iPhone at each of my four testing locations.</p><div id=\"LnVePf\"><div data-anthem-component=\"table:11177015\"></div></div><p id=\"NLtua3\">Interestingly, the most significant difference was when testing the furthest point from the router; the Pixel 6 saw over six times the speed compared to testing on the Pro 6, whereas the iPhone only increased three times. This indicates that a 6GHz capable and / or 160MHz capable device will get a greater boost with the Eero Pro 6, but all devices should see some benefit. </p><p id=\"X1RtHd\">I tested the Pro 6E with a wireless backhaul, as it’s not possible to easily wire the nodes directly in my home. Traditionally, this results in a significant drop in speeds, and that was the case here, too. Generally, I got half the speeds wirelessly when next to a node or gateway than I did when my Macbook was wired into the main mode.</p><div class=\"c-float-left c-float-hang\"><div id=\"189BnY\"><div data-anthem-component=\"aside:11176786\"></div></div></div><p id=\"OWhWJ1\">A big selling point of mesh is range — you should be able to walk through your house with a device and keep the same connectivity as it switches from node to node. In testing, this worked well, and I could conduct a Zoom call on my laptop in every corner of the house with no drop off as I moved from room to room. I did get some signal degradation — especially with the MacBook — as it often hung on to one node a little too long. </p><p id=\"myGMof\">The final and arguably most crucial Wi-Fi test is reliability; it doesn’t matter how fast your internet connection is if it isn’t working. Here the Eero Pro 6Es struggled with semi-regular connection drops that would sometimes last a few seconds and other times result in having to reboot the whole system. </p><p id=\"UQX7o6\">During my two-month testing period, Eero identified an issue with the Thread implementation. According to Eero, a memory leak was causing the devices to reboot briefly. It wasn’t clear if this was related to a Thread device on my network or not, although I did see similar reports of dropouts in some user reviews. Turning off the Thread radio in the app helped, and this week, Eero released a software update (6.10) to address the issue. Since the update, and with the Thread radio turned on, my network dropped briefly and reconnected three times in five days, which is still three times more than I’d like to have seen.</p><p id=\"Z0eBo1\">Because Eero’s network management is all cloud-based, when the internet did go down, I had little recourse for troubleshooting other than rebooting the devices. An option in the app ostensibly helps you diagnose network issues, but it requires an internet connection to do so. I have very spotty cellular service in my home, so, in my testing, this wasn’t helpful. </p><p id=\"uac2YY\">In that troubleshooting section, there are six options that cover common issues (slow internet, offline, red light on the Eero). These take you to a Health Check page, where it scans the network for issues. Doing this never resolved any problems for me or gave me steps to follow that resolved them, but it did give me the direct line to call Eero support. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QfaQtWBQOnH8zr6O9U_DTDbA_mw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418312/jtuohy_220426_5170_0013.jpg\">      <figcaption><em>The Eero Pro 6E has a simple design with just one reset button on the bottom and a small LED status light on top. </em></figcaption>  </figure></div><p id=\"4BdsOm\"></p><h1 id=\"agVH6q\">Eero Pro 6E: Set up and features</h1><p class=\"p--has-dropcap\" id=\"mH9H7J\">Getting set up with an Eero network is still very simple, especially if you are upgrading an existing Eero device. It does require a smartphone with an internet connection, however.</p><p id=\"eCPidb\">The entire setup process is done with the Eero app (iOS or Android), and once set up, you use it to manage connected devices, add a guest network, get notified when a new device joins your network, and receive data usage reports (useful if you have a data cap on your network). </p><p id=\"S8U6D0\">The app also shows you all the devices connected to your network at a glance. It attempts to give them identifiable names, such as iPhone, Chromecast, and Nest Hub, and is successful about 80 percent of the time. Oddly, it mainly struggled with Amazon Echo devices. While the app pulls in the name, you have to manually assign a device type, such as laptop, phone, game console, digital assistant, or oven — there are plenty to choose from. If you have a very up-to-date smart home, you might have to use a substitute type for some devices, such as a connected kitchen faucet. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Jifj2mbTeQ1iQW2kx5BDR7aQERE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23439911/eero_screenshots1__1_.jpg\">      <figcaption><em>Eero’s user-friendly app lets you identify which devices are on your network, assign them to profiles, and easily pause or resume Wi-Fi to them, or block devices.</em></figcaption>  </figure></div><p id=\"exTMdz\">You can also assign devices to profiles, which let you group them into functions or family members, helpful to see the type of network activity and pause or resume Wi-Fi to specific devices (such as your kids’ tablets at dinner time). You can also set up schedules — there’s a suggested Bedtime one — to automatically shut off and re-enable Wi-Fi at set times. There is no fee for this feature, though there is if you want actual parental controls. </p><p id=\"RijEhq\">I grouped my devices into categories such as “gaming” and “appliances,” as well as individual family members. This way, I can easily see how much data my dishwasher has been using (9.6 megabytes last month) or that robot vacuum has been uploading (108.5 megabytes).</p><p id=\"Osgy0G\">Unlike routers with more advanced management, you are not able to separate out the three networks on Eero’s routers. For smart home users, this can cause issues when trying to connect devices that only work on 2.4GHz. However, Eero has a handy feature in the troubleshooting section of the app that lets you temporarily turn off the 5GHz network if you are trying to connect a 2.4GHz device. </p><p id=\"U32uPl\">While there’s no quality of service optimization — which would let you prioritize bandwidth to your work computer over, say, your child’s Xbox — there is an option to optimize bandwidth for conferencing and gaming in the Eero Labs Beta section. WPA3 support is also in the Beta section</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rr2jvAIYzk6FvJTC7jYDV2-qsy8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23438177/eero_screenshots2.jpg\">      <figcaption><em>The Parental Controls in the app make it easy to set blanket restrictions on devices and block or allow specific sites.</em></figcaption>  </figure></div><p id=\"fVlSd8\">There are a number of features that are free on many other routers that Eero puts behind its Eero Secure paywall ($2.99 a month or $29 a year). These include content filtering, ad blocking, access to historical network data usage, and parental controls. Those controls consist of age-specific content filters you can toggle on or off. It’s a helpful selection — from blocking social media and messaging apps to shopping and streaming alongside mature websites. Choosing which are on and which are off is helpful as your child gets older, and you can let them explore more of the internet. You can also block or allow specific sites, and a list of popular apps in all categories makes it simple to block apps such as Instagram, Tik Tok, and Reddit in each profile you create.</p><p id=\"CyZDhC\">Eero Secure Plus ($9.99 monthly / $99 yearly) adds subscriptions for Encrypt.me VPN, Malwarebytes antivirus, 1Password, plus DDNS remote network access and threat blocking. That delivers you a weekly report and shows you which devices it blocked threats on and what type they were (phishing and deception, botnet, or malware).</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uOKRiY-eMVyYmdEk4QY43Qw-PcY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418310/jtuohy_220426_5170_0011.jpg\">      <figcaption><em>Eero’s nodes and routers are designed to blend in better with your home, so you don’t stick them in a cupboard.</em></figcaption>  </figure></div><h1 id=\"CbIQM4\">Eero Pro 6E: Should you buy it?</h1><p class=\"p--has-dropcap\" id=\"BhUvHg\">The Eero Pro 6E is an excellent mesh system that continues Eero’s reputation of being a simple, easy-to-use consumer router. However, if you don’t have any 6E devices, gigabit internet, or plans to upgrade your laptop or phone for a couple of years, there is no reason to upgrade to this router. </p><p id=\"WBILUr\">If you are in the market for a new mesh system, it might be wise to future-proof your setup with a 6E router. A router should last you four or five years, and by that time, 6GHz devices will likely be far more widespread, and maybe you’ll have faster home internet than you currently have. </p><p id=\"aVLuBT\">Going beyond what the Pro 6E can offer requires both spending more money and being willing to deal with a heavier management overhead. Other consumer-level Wi-Fi 6E routers do offer more management and control options, but they aren’t as easy to set up and maintain as the Eero and generally don’t have as good a reputation for reliability. Your network admin brother-in-law likely swears by Ubiquiti equipment, but that requires a significant amount of extra hardware, installation, and management to keep running and isn’t ideal for someone looking for a plug-and-play option.</p><p class=\"c-end-para\" id=\"WuysZA\">Eero has managed to carve out a niche for itself for those looking for easy-to-use, reliable Wi-Fi coverage in every corner of their home and are willing to pay a premium over basic routers for it. The Eero Pro 6E isn’t perfect, but it continues to fulfill that ideal for the next generation of Wi-Fi.</p><p id=\"SECrCn\"></p><p id=\"UKtFtJ\"><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p><div><div id=\"jqOBis\"><div data-anthem-component=\"aside:11176821\"></div></div></div><p id=\"UQ8xl2\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nkLl8hDpLEJrHTvWSpb5O9cSwKQ=/0x103:2040x1171/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23438710/jtuohy_220426_5170_0009.jpg",
  "description": "The $700 Eero Pro 6E is the company’s first 6GHz-capable mesh Wi-Fi system",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}