{
  "title": "Elden Ring patch nerfs speedrunners’ favorite weapon ability",
  "url": "https://www.theverge.com/2022/3/17/22982776/elden-ring-patch-notes-hoarfrost-stomp-mimic-tear-ashes-nerf",
  "date": "2022-03-17T15:40:18.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Q9aI0T6WUfTRGeW1rlKweRgQip4=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70635974/2022_03_09_13_03_10_Greenshot.0.jpg\" />        <figcaption>Bandai Namco</figcaption>    </figure>  <p id=\"yYsDSn\">The latest <a href=\"https://www.theverge.com/2022/3/16/22981060/fromsoftware-elden-ring-franchise-intellectual-properties-future-expansion\"><em>Elden Ring</em></a> patch nerfs two extremely popular abilities, adds some sorely needed quality of life updates, and provides a significant buff to caster builds. Late last night, Bandai Namco <a href=\"https://www.bandainamcoent.com/news/elden-ring-patch-notes-v1-03?fbclid=IwAR36uPOdSttajzxk1GbslCEVzarvRWKA5pJo54fiwRjQZaoUFGLz8i7V9j8\">announced patch 1.03 for <em>Elden Ring</em></a>. The patch fixes several bugs including one that prevented players from obtaining items after a boss kill. The developers have also seemingly heard the many complaints about the game’s lack of quest tracking, and while they didn’t add a quest log, they did make it easier for players to find the appropriate NPCs.</p><blockquote><p id=\"zwM2GP\">Added a function to record an icon and the name of an NPC on the map when you encounter that NPC</p></blockquote><p id=\"fZrKlQ\">They’ve also increased the number of situations in which you can summon an NPC which, of course, comes the day <em>after</em> I had to tackle the Godskin Noble with nothing but my trusty Jellyfish Ash for assistance. </p><p id=\"Ww3cXD\">If you’re a caster build (like yours truly) today’s patch notes also offer some excellent news. Several useful sorceries like Crystal Barrage, Comet, and more have had their stats adjusted increasing damage, decreasing FP (mana) consumption, or both. Glass canon-ing your way through the Lands Between is an attractive option if you’re looking to melt bosses before they can lay a finger on you, but some of the spells just didn’t do enough damage or were such resource hogs that they weren’t worthwhile. I’m particularly excited by the Crystal Barrage changes. You can hold down the cast button to channel the spell, unleashing a torrent of crystal bullets until your FP runs out. With the damage buff, I’m now essentially a magic machine gun turret. </p><p id=\"v1xXBd\">But where there be buffs, there must also be nerfs. If you were counting on Hoarfrost Stomp and Mimic Tear Ashes to get you through some of the game’s more difficult late-game fights, unfortunately, both have been de-powered.</p><p id=\"LVoktM\">The Mimic Tear Ashes is obtained toward the last third of the game. It summons a copy of the player that fights with the player’s own weapon, armor, and spells. In the new patch, the summon’s damage has been decreased. </p><p id=\"IUVxWS\">Hoarfrost Stomp is possibly the worst casualty in this latest patch. It’s a weapon ability first popularized by the Elden Ring speedrunning community that coats the ground in ice spikes then explodes, damaging and sometimes interrupting enemies’ attacks. Speedrunners and casual players alike took advantage of Hoarfrost Stomp’s big damage numbers and relatively short wind-up time to defeat bosses from safe distances. Bandai Namco altered both components of the Stomp, increasing the ability’s cast time and decreasing its damage. Distortion2, an <em>Elden Ring</em> speedrunner <a href=\"https://www.theverge.com/2022/3/15/22979436/elden-ring-speedrunners-world-record-race-30-minutes\">who beat the game in under 30 minutes</a>, reacted to the news in a tweet.</p><div id=\"HJI5iO\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Rip Elden Ring Speedruns <a href=\"https://t.co/cHzI91yEBX\">pic.twitter.com/cHzI91yEBX</a></p>— Distortion2   Elden Ring (@Distortion_2) <a href=\"https://twitter.com/Distortion_2/status/1504312175913062401?ref_src=twsrc%5Etfw\">March 17, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"r4Xxqf\">It’s not yet known if the Hoarfrost Stomp nerf is significant enough for speedrunners to find an alternative or what that alternative could be. But for now, unfortunately, Hoarfrost Stomp is dead. Long live Hoarfrost Stomp.</p><p id=\"vs7mIV\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_36NHNOPAdzswWkrAVgcekT8oTM=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23323628/2022_03_09_13_03_10_Greenshot.jpg",
  "description": "The patch also gives caster builds a huge buff",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}