{
  "title": "Elden Ring speedruns are now less than 10 minutes long",
  "url": "https://www.theverge.com/2022/4/12/23021804/elden-ring-speedruns-sub-ten-minutes-metronome",
  "date": "2022-04-12T18:22:04.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/i6HyrMZsZgSTnMPQTsNFC4GBBq0=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740962/elden_ring_1.0.jpg\" />        <figcaption>Image: Bandai Namco</figcaption>    </figure>  <p id=\"1649706043.147529\">The latest <em>Elden Ring</em> speedrun world record <a href=\"https://youtu.be/NTc469QNrBM\">is less than 10 minutes now</a>. It involves a <a href=\"https://youtu.be/4PljVCo7zVs\">metronome</a>, absolutely no fighting, and, in the final seconds of the run, a player torn apart by one of the game’s final bosses. It is deeply silly, and I love it.</p><p id=\"AxiQ9j\"><a href=\"https://www.youtube.com/channel/UCBaHYWh_265k73PxkgaNkrA\">Distortion2</a>, a popular Soulsborne<em> </em>speedrunner, has claimed the world record in <em>Elden Ring</em>’s <a href=\"https://www.speedrun.com/eldenring/full_game#Any_Unrestricted\">any% unrestricted category</a> with a time of 8 minutes and 56 seconds. I’ve been paying decently close attention to Distortion2 and his <em>Elden Ring</em> speedrunner colleagues, fairly certain of what to expect in this nearly 9-minute speedrun. But I started screaming excitedly in the first seconds of the speedrun when Distortion2 shot out of the starting area and bypassed the grafted scion boss, the mandatory death, and all of the Limgrave area to appear unharmed in Stormveil Castle. Shenanigans were afoot.</p><p id=\"l6Kz7b\"><em>Elden Ring</em> world records have changed dramatically in the last month. Back in March, I was picking my jaw off the floor <a href=\"https://www.theverge.com/2022/3/15/22979436/elden-ring-speedrunners-world-record-race-30-minutes\">from runs completed in under an hour</a>. Runners were teleporting to the final dungeon in the opening minutes of the game using wrong warp glitches and beating bosses with the massively overpowered Hoarfrost Stomp weapon ability. When <a href=\"https://www.theverge.com/2022/3/17/22982776/elden-ring-patch-notes-hoarfrost-stomp-mimic-tear-ashes-nerf\">FromSoftware depowered Hoarfrost Stomp</a> in a patch, runners lamented the death of the any% category, believing it’d be a while before glitch hunters and speedrun routers would find a speedy alternative to take down the game’s punishing bosses. </p><div class=\"c-float-right\"><aside id=\"u6lhrt\"><q>Shenanigans were afoot</q></aside></div><p id=\"CdLJ96\">They did, finding a glitch so powerful it would completely eliminate the need to fight bosses at all. The way to a sub-10-minute fightless speedrun involves tweaking the game’s graphic settings and using a metronome to execute what’s known as a zip glitch. Runners turn down <em>Elden Ring</em>’s graphics to their lowest setting to ensure the game outputs a consistent FPS. Then, they turn on a metronome app to 109 beats per minute while in a blocking stance facing the direction they want to go. Players wait four ticks before moving forward and, if the trick is executed with the correct timing (hence the metronome), they’ll shoot across the map.</p><p id=\"9Kckdd\">This zip glitch is the key to everything because it not only allows the player to clear massive distances that were previously covered via goat-horseback but also despawns boss arenas with bosses still in them, causing them to fall to their deaths. This is how Distortion2 was able to beat the game without beating a single enemy, bypassing even Malekith, the speedrun’s only mandatory boss fight. I’m actually a little sad about this development because one of Distortion2’s previous runs involved fighting Malekith with no leveling, the minimum amount of healing flasks, and a +4 Icerind Hatchet. It’s a fight where a single hit means instant death with Maliketh’s disgusting speed and brutal damage. Watching Distortion2 just beat him under all those constraints was phenomenal stuff. </p><div id=\"LvicFz\"><div ><iframe src=\"https://www.youtube.com/embed/3Tphe_oFKn4?rel=0&amp;start=706\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"xGyc5R\">The final, absolutely goofy, nail in this eight minute 56 second coffin is the “boss fight.” At the end of the game, runners use a difficult to execute but more powerful zip glitch to kill the final boss and end the run. Since the zip glitch allows players to fight bosses out of order (or not at all), some bosses that would normally be dead are still alive and reappear. Competing the final zip glitch requires a save and quit and, upon restarting, the player spawns in the room before the final boss arena. There’s a boss there. He’s not dead, and he’s very angry he’s been ignored. So, as Distortion2 spawns in, he is immediately set upon by this boss, dying immediately in a nasty-looking grab attack as God Slain splashes across the screen, indicating the final boss is dead and the speedrun is over. Alexa, play the <a href=\"https://youtu.be/Ag1o3koTLWM\"><em>Curb Your Enthusiasm</em> theme</a>.</p><div id=\"BMzdQE\"><div ><iframe src=\"https://www.youtube.com/embed/NTc469QNrBM?rel=0&amp;start=685\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"u6Ae3C\"><em>Elden Ring </em>is still firmly within the honeymoon phase of speedrunning. The game is fresh enough that new tricks and exploits crop up daily, pushing the limits of what’s possible. Eventually, a preferred and consistent strategy will emerge and calcify, creating a plateau of times only broken by the smallest of deviations — a quicker button press here or a difficult strat executed on the first try there. We don’t know how long this golden age of <em>Elden Ring</em> speedrunning will last or if FromSoftware will patch out the relevant glitches, initiating a new race to the bottom. But, for now, the almost-daily progress of speedruns with mind-melting glitches and unfathomable times is so much fun to watch. In fact, the speedrunning scene is moving so quickly that, during the writing of this, <a href=\"https://youtu.be/XuUEk6e1LOE\">Distortion2 posted another world record</a>, bringing the time down from 8 minutes and 56 seconds to 6 minutes and 59 seconds. I love speedrunning so much.</p><p id=\"iF51qd\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0tVSvqYiotItqKppmcRgiL_xSUQ=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23003203/elden_ring_1.jpg",
  "description": "We’re still in the golden age of Elden Ring speedrunning.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}