{
  "title": "Elden Ring speedrunners race to the bottom",
  "url": "https://www.theverge.com/2022/3/15/22979436/elden-ring-speedrunners-world-record-race-30-minutes",
  "date": "2022-03-15T17:37:36.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CrfmFxXp70PElKLkZ_sUN6_RexM=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70626158/elden_ring_1.0.jpg\" />        <figcaption>Image: Bandai Namco</figcaption>    </figure>  <p id=\"ulIgd3\"><em>Elden Ring</em> is just so massive and its bosses are so tough that the average player will probably take over 60 hours to beat it. But speedrunners, assisted by some traditional speedrunning tricks and the game’s own open design, have somehow managed to beat the sprawling game in under 30 minutes.</p><p id=\"wBRMAn\">For a speedrunning enthusiast, the first days of a game’s release are extremely exciting. New techniques and optimizations are constantly being discovered, as boss behaviors and the runner’s own luck work with or against them, making almost every run a possible world record. While every runner is ostensibly competing against the clock, two runners have emerged in the <em>Elden Ring</em> speed community, each racing to post lower and lower times.</p><p id=\"kouIdJ\">Lil Aggy is a popular member of the <em>Souls </em>speedrunning community, <a href=\"https://youtu.be/IH5WfO-J_Co\">performing runs</a> at Games Done Quick events and boasting <a href=\"https://www.speedrun.com/user/LilAggy\">second place in a number of categories</a> for <em>Sekiro: Shadows Die Twice.</em> He was the first to post an <em>Elden Ring</em> speedrun of <a href=\"https://youtu.be/QdW6Bvc14BI\">less than an hour</a>.</p><div id=\"V6zh45\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">FIRST PERSON IN THE WORLD TO COMPLETE ELDEN RING IN UNDER ONE HOUR <a href=\"https://t.co/ukIwvxn1sW\">pic.twitter.com/ukIwvxn1sW</a></p>— LilAggy (@LilAggyTV) <a href=\"https://twitter.com/LilAggyTV/status/1501542635621789706?ref_src=twsrc%5Etfw\">March 9, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"KcPVKe\">“The main glitch in the run right now is something called wrong warping,” he explained to <em>The Verge</em>. </p><p id=\"EG75ta\">To achieve this unfathomably short time, runners are tricking the game via the sites of grace to teleport them to <a href=\"https://eldenring.wiki.fextralife.com/Crumbling+Farum+Azula\">Crumbling Farum Azula</a>, a late-game dungeon. There, they can access the boss fights required to complete the game in the same time it takes regular players to acquire Torrent. </p><p id=\"AQIQsv\">But there’s an extremely wide and deadly gulf between accessing the final few bosses and defeating them when you’re a fresh-faced Tarnished. </p><p id=\"JmAlRT\">“The general strategy right now is mostly just abusing a very overpowered Ash of War called <a href=\"https://eldenring.wiki.fextralife.com/Hoarfrost+Stomp\">Hoarfrost Stomp</a> to steamroll the bosses as a relatively low level character,” he said. Hoarfrost Stomp is an ability found in Caria Manor (y’know, that lovely place where all the finger spiders are!) and is the weapon skill of the Icerind Hatchet. It covers the ground with ice spikes that explode, stunning and damaging enemies. </p><div class=\"c-float-right\"><aside id=\"0RXvdi\"><q>“The general strategy right now is mostly just abusing a very overpowered Ash of War called Hoarfrost Stomp”</q></aside></div><p id=\"6JZv7u\">From there, Aggy’s run was a matter of abusing the save and quit feature to deactivate boss AI, spamming Hoarfrost Stomp against bosses he couldn’t glitch, and hoping no stray enemy one-shots him with a lucky hit. After a couple of unfortunate deaths against the Godskin Duo and Maliketh, The Black Blade, Lil Aggy posted a run of 59:38. It was a world record that stood for a few scant hours before another runner beat him by 10 minutes.</p><p id=\"QLHRJJ\"><a href=\"https://www.twitch.tv/distortion2\">Distortion2</a> is another popular speedrunner in the <em>Souls</em> community. Like Aggy, <a href=\"https://youtu.be/Gq80PkJi4eI\">he’s appeared at GDQs</a> and holds <a href=\"https://www.speedrun.com/user/Distortion2\">several records and top 10 spots</a> in FromSoftware games. His <a href=\"https://www.youtube.com/user/dist2gaming\">YouTube channel</a> features a rapid, almost daily succession of shorter and shorter<em> Elden Ring</em> speedruns: from <a href=\"https://youtu.be/PO33S2p-L9k\">49:29</a>, to <a href=\"https://youtu.be/2NzNZkd2WVQ\">37:15</a>, <a href=\"https://youtu.be/XmjORZPIFng\">36:20</a>, <a href=\"https://youtu.be/anm0CPYpGcM\">33:55</a>, and finally, <a href=\"https://youtu.be/Ts8D0O1YYfc\">28:59</a>. </p><p id=\"Vk14Kl\">His runs feature a lot of the same elements as Aggy. They both start with the samurai class and run almost immediately to Liurnia to pick up the Raya Lucaria Academy key and the Icerind Hatchet, but overall his strategies differ a bit from Aggy’s. In addition to Hoarfrost Stomp, Distortion2 also uses the <a href=\"https://eldenring.wiki.fextralife.com/Ash+of+War:+Royal+Knight's+Resolve\">Royal Knight’s Resolve</a> Ash of War, which massively increases the damage of a player’s next hit, giving him an extra (and notably faster) edge in combat. </p><p id=\"Kp7xWV\">His progression to sub-30 minutes does feature some of the same pitfalls as Aggy, in that he will occasionally get got by a random enemy he’s running by. The Godskin Duo fight also causes problems because those enemies occasionally hit him through objects and one-shot him.</p><p id=\"bzzYIn\">It’s important to note that while these “world records” are extraordinarily impressive, they are, technically, not official. <a href=\"https://www.speedrun.com/\">Speedrun.com</a>, the widely accepted authority on video game speedrunning, has decided to keep the leaderboards for <em>Elden Ring</em> closed until March 18th. This, <a href=\"https://www.speedrun.com/eldenring/news/1082\">according to a mod post on the forum</a>, “is to give verifiers enough time to create a proper ruleset, as well as to decide which timing method and categories are appropriate.” When the leaderboards officially open, Distortion2 and Lil Aggy can submit new and possibly even shorter runs for verification. </p><p id=\"xDdLMO\">Distortion2 believes that this particular category of <em>Elden Ring</em> speedrunning can go even lower if runners can figure out how to make a specific glitch more reliable. The glitch seems to be a teleportation bug in which blocking and moving at the same time can randomly fling a character over great distances. </p><div id=\"1lNRnE\"><div ><iframe src=\"https://www.youtube.com/embed/ep4Fokhzeuw?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"fzng4h\">In the video, Distortion2 uses the glitch to bypass the Godskin Duo fight which, in these early days of <em>Elden Ring</em> speedrunning, is a required (and extremely deadly) boss fight. The only reason it’s currently not being implemented into runs is because it’s very unreliable. Distortion2 hopes glitch hunters can figure out how to make it work consistently, which could make speedruns of the game even shorter than 30 minutes.</p><p id=\"yi4jJO\">“This glitch could be honestly one of the most game-breaking things to ever be in a <em>Souls </em>game for speedrunning,” he says in the video.</p><p id=\"hqpAc9\"></p><p id=\"w3ycQo\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9XP7UiKqjNkw7HCJIhxsIyLONto=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23003228/elden_ring_1.jpg",
  "description": "Step 1. Acquire Hoarfrost Stomp. Step 2. Beat the game",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}