{
  "title": "Elden Ring PSA: Bandai Namco warns of PS5 save bug",
  "url": "https://www.theverge.com/2022/2/25/22950591/elden-ring-ps5-rest-mode-save-bug",
  "date": "2022-02-25T15:24:56.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"elden ring\" src=\"https://cdn.vox-cdn.com/thumbor/623Qwcl6aYWhaemGe765R5s_TF8=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70549682/ELDENRING_23.0.jpg\" />    </figure>  <p id=\"CNkbGz\">As <a href=\"https://www.theverge.com/2022/2/23/22946279/elden-ring-review-ps5-xbox-pc\"><em>Elden Ring</em></a><em> </em>rockets up the charts, amassing some of the most glowing reviews this side of <em>Breath of the Wild</em>, Bandai Namco <a href=\"https://en.bandainamcoent.eu/elden-ring/news/message-about-some-performance-issues-elden-ring\">has issued a PSA</a> letting players know it’s working on ironing out some of the day-one kinks.</p><p id=\"wzAC1j\">In the PSA, Bandai Namco said it’s working on correcting some issues related to mouse over-sensitivity, PC anti-cheat bugs, and frame rate / game performance issues that, somewhat annoyingly, cause the game to stutter at random moments. </p><p id=\"XFUV4o\">One of the biggest warnings concerns a game save bug on the PS5.</p><blockquote><p id=\"1GQ0aK\">If the PS5 console is unexpectedly turned off while playing a game or in rest mode, saved data may not be saved correctly. We are aware of the cause of this issue and are working on a patch to correct it, but until the patch is released, please save your game manually by exiting the game regularly.</p></blockquote><p id=\"Fmjpmn\"><em>Elden Ring</em>, like most FromSoftware games, lacks a pause feature. If a player opens the game menu, the game still goes on, making the player susceptible to attack while they fiddle with their equipment or inventory. Not having a pause feature is pretty inconvenient, and PS5 users might be tempted to use the console’s rest mode feature to circumvent that. As Bandai Namco warns, that might corrupt save data, so the best option for when short breaks are needed is to save and quit manually. </p><p id=\"YAnaY0\">Bandai Namco said it’s also working on other issues but did not say when a patch would be deployed.</p><p id=\"qeSV3t\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Y7oefKF-cYYYf2Kg2hAJA6XnsPI=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22808517/ELDENRING_23.jpg",
  "description": "Bandai Namco addresses a PS5 save bug and other issues.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}