{
  "title": "Elden Ring is a sprawling fantasy epic so good I don’t want it to end",
  "url": "https://www.theverge.com/2022/2/23/22946279/elden-ring-review-ps5-xbox-pc",
  "date": "2022-02-23T15:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/UzXrjv_R2-xhwsdbDpHGeFYBoZg=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70540551/ELDENRING_21_25120461292d8e6256c8.10110654.0.jpg\" />    </figure>  <p>After 40 hours, I’m just getting started with FromSoftware’s latest release</p> <p class=\"p--has-dropcap\" id=\"mBLM1o\">When I was a kid, I would look at paperback fantasy novels and dream. I was too young to read these tales of sex and violence, but those hand-painted covers, full of dragons and swords and ancient ruins, held a promise of adventure that captivated me. It’s a feeling I continued to chase when I went on my own fantasy quests in games dating back to the original <em>Legend of Zelda</em>. Few have been able to match my paperback-inspired imagination; they’re often too restrictive or linear to create that sense of freedom I craved. None have gotten as close to that feeling as <em>Elden Ring</em>.</p><p id=\"Rcp5nr\">The latest release from <a href=\"https://www.theverge.com/2015/4/3/8339241/bloodborne-is-a-blood-soaked-bone-splintering-masterpiece-on-ps4\"><em>Bloodborne</em></a> and <a href=\"https://www.theverge.com/2019/3/22/18277376/sekiro-shadows-die-twice-review-xbox-ps4-pc\"><em>Sekiro</em></a> developer FromSoftware, <em>Elden Ring</em> is, at its most basic, an attempt to merge the studio’s distinctive action-RPG formula with an expansive open world. Think of it like <em>Dark Souls</em> meets <a href=\"https://www.theverge.com/2017/3/2/14787082/the-legend-of-zelda-breath-of-the-wild-review\"><em>Breath of the Wild</em></a>, and you’re close. It’s an ambitious premise, but it’s also one <em>Elden Ring</em> more than lives up to. It has everything you’d expect from the developer — deep and challenging combat, complex systems, lore that’s equal parts beautiful and sad — and fuses it with an absolutely gigantic world that you can explore however you like.</p><p id=\"tqpdOB\"><em>Elden Ring</em>’s premise is, admittedly, a little generic at first. It takes place in a dark fantasy realm known as the Lands Between, a place held together by a powerful ring and a goth queen. Unfortunately, with the ring shattered and the queen missing, the land has descended into chaos, beset by monsters, ghouls, and bad vibes. You take on the role of a Tarnished, a kind of undead being intent on setting things straight. (The initial world concept was crafted by <em>Game of Thrones</em> author George R.R. Martin, but if it wasn’t part of the game’s marketing, I’m not sure I would’ve noticed his involvement.)</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ahIL27jGnRjh0TsFMz2fSj5Gxz0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23263765/ELDENRING_01_4K_15314260c26da42169f3.33853039.jpg\">  </figure></div><p id=\"aifKRq\">As with the best open-world games, this premise gives the game its basic structure — you must travel around the Lands Between to restore the Elden Ring — but it’s not really about following a linear narrative. There is a golden path that gives you some guidance to the next major boss or event (it’s a bit like the guiding wind from <a href=\"https://www.theverge.com/21323144/ghost-of-tsushima-review-ps4-game-developer-samurai\"><em>Ghost of Tsushima</em></a>), which you’re free to ignore if you really want to. There are a few roadblocks to progression, but for me, the best part of <em>Elden Ring</em> is how open it feels.</p><p id=\"zLPXG7\">There was a moment early on where this really clicked into place for me. At the outset of the game, the guiding light points you towards a castle, which, after you slaughter some guards, leads you to the first major boss. He’s a massive, deformed swordmaster with too many horns growing out of his head and a scorpion-like tail. I died so many times. No matter what strategy I tried, I couldn’t deplete even half of the big fella’s health. In most games, including past titles by FromSoftware, this would be a dealbreaker. I’d be left banging my proverbial head against a wall in order to progress.</p><p id=\"RcZ4ji\">But eventually, I realized… I could just go and do something else. I ignored the guiding light and created my own quest. I hopped on my ghostly steed and explored new areas. Ten hours later, I returned stronger and wiser, and I beat that damn boss. The thing is, I wasn’t just off grinding for experience levels and gear. I was having my own adventures. I ventured into poisonous swamps and onto hellish beaches. I invaded other castles and inched my way through underground catacombs and mines. I slayed a freaking dragon. Doing all that made my character more powerful, yes, but more importantly, it allowed me to understand the game enough to be much more comfortable in that infernal boss battle.</p><p id=\"Iq0nob\">What makes this all work is the world that FromSoftware has created. It is both absolutely massive and full of things to do and see. It seems kinda large at first, with a map that spans a sprawling continent, but it slowly reveals its full, more impressive scope the longer you play. More than just being huge, though, the Lands Between is full of interesting things to discover, from the plentiful mini-bosses prowling around to the sheer range of landscapes. One minute, you’re in a burning land with a blood-red sky — the next, you’re deep underground exploring a sunken city with inexplicable stars overhead. It can be incredibly beautiful, like when a rain of golden leaves falls down in the middle of a dark night. It’s become a cliche at this point, but <em>Elden Ring</em> really is the kind of game where you see something interesting in the background — a castle piercing the sky, a golden tree the size of a skyscraper, a giant skull carved into a mountain — and, if you’re determined enough, figure out how to get there.</p><p id=\"ou3kHi\">The scale never felt intimidating to me. To start, you don’t get a full sense of the scope right away; it isn’t until you really start exploring and finding maps that you understand just how big the world is, which gives you time to acclimate. But it’s also relatively easy to get around. You have a spirit horse-like creature you can summon anytime, which not only lets you get around faster but makes it possible to avoid battles if you’re careful. The Lands Between are also filled to the brim with what are called “sites of grace,” essentially save points that double as fast-travel locations so that you can zip back and forth between places you’ve already visited. I spent a good chunk of the game just riding around seeking these out in order to make exploring a less scary proposition; if I did run into trouble, I’d know there was somewhere nearby to get my bearings.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fKQStT-302QTj2FMo8JUbPPP5AM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23263764/ELDENRING_17_4K_15314260c26db5833200.63304758.jpg\">  </figure></div><p id=\"o4EEh7\">The world is also full of the kind of mournful stories that FromSoftware is known for, making exploration part of the narrative. The few folks who will actually talk to you are all tragic figures offering small quests in exchange for a heartbreaking story in brief. My personal favorite simply offers to give you a hug whenever you want, so she can feel your warmth. Even the monsters can feel tragic. I encountered one beast that was constantly enraged because it was trapped in a metal helmet, and I stumbled upon a beach full of skeletal creatures that I eventually figured were the survivors of a shipwreck.</p><p id=\"Wyi3az\">But the game can be delightfully weird at times, too. I spent a good hour trying to solve a problem involving a talking tree; my favorite helpful spirit to summon was a giant, floating jellyfish; and I currently have a pouch full of ovaries gathered from the carcass of a land octopus. At one point, there’s a quest that involves cleaning skulls off of a creature’s feet.</p><p id=\"Bf1Hqi\">What’s particularly great about a more open structure is that it doesn’t get rid of what makes FromSoftware games so beloved. Instead, it adds to it. The combat is still tense and rewarding, and the bosses are still massive and terrifying. Even after 40 hours, I’m still learning new things about how magic, crafting, and other in-game systems work. And while the freedom is wonderful, you still get that heart-pounding, almost claustrophobic feeling when you make your way through the many dungeons, castes, and catacombs. I’ve conquered plenty, but there always seems to be a new creature or place that I’m not quite ready for yet — which is what keeps me coming back.</p><p id=\"Wf5pMz\">This is all to say that, while this is probably the most accessible game the studio has made, it’s still incredibly demanding. It remains hard as hell, but now you have more options for dealing with the frustrating moments. And not only does it demand your focus and attention in a way few other games do, but now, because it’s so large, it demands much of your time as well. After 40 hours of exploring, I don’t think I’m even close to finishing the game; sometimes, it feels like I’m just getting started. <em>Elden Ring</em> isn’t a game you pop on for an hour a night. It’s a game that consumes you. For me, it’s becoming a lifestyle, something I still think about when I set the controller down.</p><p class=\"c-end-para\" id=\"eD9OGc\">I’m not sure if I’ll ever beat it. And honestly, I’m not sure if I want to — I’m old enough to read those books now, but I’d rather find my own story.</p><p id=\"gn98Zn\"><small>Elden Ring </small><small><em>launches February 25th on the PS4, PS5, Xbox One, Xbox Series X, and PC.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/H9o-0FF1B9mhpzYT-H3GfmQ6kdE=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23263763/ELDENRING_21_25120461292d8e6256c8.10110654.jpg",
  "description": "A mix of Dark Souls and Breath of the Wild.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}