{
  "title": "Elden Ring’s update patches infinite death loop hack on PC",
  "url": "https://www.theverge.com/2022/3/23/22993443/elden-rings-update-patches-infinite-death-loop-hack-pc",
  "date": "2022-03-23T21:50:16.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Dt0qaxTeV7SEJCyskm9fSsXYsws=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70663686/elden_ring_1.0.jpg\" />        <figcaption>Image: Bandai Namco</figcaption>    </figure>  <p id=\"H1m6oM\"><em>Elden Ring</em> has patched an exploit on PC that hackers used to trap players in endless cycles of death. In the <a href=\"https://en.bandainamcoent.eu/elden-ring/news/elden-ring-patch-notes-1032\">patch notes for update 1.03.2</a>, game publisher Bandai Namco says it includes a fix for “a bug in multiplayer that allowed players to teleport others to incorrect map coordinates.”</p><p id=\"kdQLiW\"><a href=\"https://www.theverge.com/2022/3/20/22987706/elden-ring-exploit-pc-infinite-death-loop-hack-glitch\">The exploit first emerged last week</a> after invaders started crashing players’ games and teleporting their character to an out-of-bounds location, causing them to fall to their death over and over again upon reopening the game. While some victims were able to get themselves out of the death loop by quickly teleporting to a site of grace, others reported losing dozens of hours of gameplay. You can see the effects of the hack for yourself in a video posted by <a href=\"https://twitter.com/EldenRingUpdate/status/1504958027925008387\">EldenRingUpdate on Twitter</a>.</p><div id=\"gQByGf\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">⚠️Elden Ring PSA for PC players⚠️<br><br>There's an exploit going around on PC where hackers will corrupt your save file while you're invaded. <br><br>First they will crash your game, and when you open it back up, your character will be constantly falling to their death... <a href=\"https://t.co/8et3bl8T1I\">pic.twitter.com/8et3bl8T1I</a></p>— Mordecai (@EldenRingUpdate) <a href=\"https://twitter.com/EldenRingUpdate/status/1504958027925008387?ref_src=twsrc%5Etfw\">March 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"h9X18b\">At the time, players on PC were advised against playing online. But it looks like the patch fixes things, so you should hopefully be safe from invaders who want to kill your entire game save file, not just your pride.</p><p id=\"xwVk7i\">Aside from the death loop fix, the patch also addresses a few other problems across all platforms, including a fix for a bug that made it impossible for some players to complete Nepheli Loux’s questline. It also resolves an issue that prevented the Endure Ash of War from activating, as well as a bug that caused players to die during a descent near Bestial Sanctum.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/y7C_IMCfS_oyINsiCkpx7wsSZ6c=/0x158:1920x1163/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23003228/elden_ring_1.jpg",
  "description": "FromSoftware has squashed the death loop bug.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}