{
  "title": "Elon Musk got $1 billion from Larry Ellison for his Twitter takeover",
  "url": "https://www.theverge.com/2022/5/5/23058295/elon-musk-twitter-funding-qatar-larry-ellison",
  "date": "2022-05-05T16:02:34.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6EU6pEXTuhvTEMcNnYOeEjZyki0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70835201/VRG_Illo_STK022_K_Radtke_Musk_Money.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"9V7jH2\">Elon Musk has secured $7.1 billion in new financing for his takeover of Twitter — which <a href=\"https://www.cnbc.com/2022/05/05/elon-musk-expected-to-serve-as-temporary-twitter-ceo-after-deal-closes.html\">CNBC reports</a> will include assuming the role of “<a href=\"https://www.theverge.com/e/22822392\">temporary CEO</a>” — with this round of funding coming from a group of sometimes high-profile outside investors. At the top of <a href=\"https://www.sec.gov/Archives/edgar/data/1418091/000110465922056055/tm2214608-1_sc13da.htm\">the list</a> is Larry Ellison, with the co-founder and current CTO of Oracle committing $1 billion to the purchase.</p><p id=\"uuQulA\">Ellison has said that he is “very close friends” with Musk, and he was <a href=\"https://www.theverge.com/2018/12/28/18158832/tesla-larry-ellison-board-of-directors-oracle-founder\">added to Tesla’s board</a> in 2018. As one of the richest people alive — a superlative he shares with Musk — and an estimated net worth of over $100 billion, the investment is relatively small change for him. Back in 2012, Ellison bought nearly the entire Hawaiian island of Lanai for around $500 million.</p><div class=\"c-float-right\"><aside id=\"iT8Amp\"><q>Andreessen Horowitz, Fidelity, and Saudi Prince Alwaleed bin Talal are joining, too</q></aside></div><p id=\"fCMe2I\">The new list of investors also includes the venture capital firm Andreessen Horowitz, the financial firm Fidelity, the crypto exchange Binance, and the state investment firm of Qatar.</p><p id=\"AmK165\">Saudi Prince Alwaleed bin Talal also agreed to remain invested in Twitter after the deal closes — despite initially saying that Musk’s offer doesn’t “[come] close to the intrinsic value of Twitter” and saying he <a href=\"https://twitter.com/Alwaleed_Talal/status/1514615956986757127\">would reject</a> the buyout. As the merger closes, his nearly $1.9 billion stake in Twitter will be rolled over into an investment into the private company.</p><div class=\"c-float-right\"><div id=\"7w25Tw\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">4/Elon is the one person we know and perhaps the only person in the world who has the courage, brilliance, and skills to fix all of these and build the public square that we all hoped for and deserve.</p>— benahorowitz.eth (@bhorowitz) <a href=\"https://twitter.com/bhorowitz/status/1522198628244156416?ref_src=twsrc%5Etfw\">May 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"rCZZIK\">Now, the prince <a href=\"https://twitter.com/Alwaleed_Talal/status/1522171641761046528\">tweeted</a> to his “new” friend Elon: “I believe you will be an excellent leader for Twitter to propel &amp; maximise its great potential.” Binance boss Changpeng Zhao told the <a href=\"https://www.ft.com/content/e2c6123b-eb42-41df-bc82-111f67882ac3\"><em>Financial Times</em></a> that his company’s $500 million buy-in is “more of a blank check” than an investment based on any specific plans.</p><p id=\"U5FswH\">Andreessen Horowitz co-founder Ben Horowitz posted <a href=\"https://twitter.com/bhorowitz/status/1522198624486125570\">several tweets</a> about why his firm is investing $400 million, criticizing unspecified incidents of censorship and saying “we believe in Ev and Jack’s vision to connect the world and we believe in Elon’s brilliance to finally make it what it was meant to be.” Horowitz blamed some of the problems on Twitter being a public company reliant on advertising and got a co-sign from its former CEO and co-founder Jack Dorsey, who <a href=\"https://twitter.com/jack/status/1522225373592891392\">tweeted</a> “this is true. it needs cover for a while.”</p><p id=\"siRwWm\">Musk reached an agreement with Twitter last week to <a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\">take the company private for $44 billion</a>. The new funding allows Musk to <a href=\"https://www.reuters.com/business/exclusive-musk-talks-new-twitter-financing-sources-2022-05-02/\">commit less of his own wealth</a> to the deal, which may be important for him since much of that money is tied up in Tesla stock.</p><p id=\"smjbUp\">The acquisition is expected to close later this year. Musk has thus far offered vague and sometimes lofty details about how he’ll change Twitter, from “authenticating all humans” to pulling its business away from advertising. Mostly, he’s said he wants the platform to be a forum for free speech, though it remains unclear what that means in practice.</p><p id=\"WWAumM\">Musk has also said buying Twitter “<a href=\"https://www.theverge.com/2022/4/14/23025343/elon-musk-twitter-takeover-ted-talk-quote-stock-buyout\">is not a way to make money</a>.” But he’s also reported to be <a href=\"https://www.theverge.com/2022/4/28/23047376/elon-musk-twitter-job-cuts\">considering job cuts</a> and <a href=\"https://www.theverge.com/2022/5/4/23056524/elon-musk-twitter-business-plans-charging-governments-corporations\">charging businesses and governments</a> to use the platform.</p><p id=\"yPiOKx\"><em><strong>Update May 5th, 12PM ET:</strong></em> <em>Added statements and tweets from some of the investors.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lK6QFra65ffcxA9WVjRiISVC7_8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382325/VRG_Illo_STK022_K_Radtke_Musk_Money.jpg",
  "description": "It means Musk is putting less of his personal fortune at risk.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}