{
  "title": "Elon Musk tells a judge the SEC’s ‘endless’ investigation is stifling his free speech",
  "url": "https://www.theverge.com/2022/2/17/22938823/elon-musk-sec-investigation-free-speech-tesla",
  "date": "2022-02-17T15:02:08.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Elon Musk \" src=\"https://cdn.vox-cdn.com/thumbor/Lo_8AMOwaVNjgIo0erxVhUAAo0Q=/0x86:4978x3405/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70520592/1234657348.5.jpg\" />        <figcaption>Photo by Patrick Pleul/picture alliance via Getty Images</figcaption>    </figure>  <p id=\"i93Rrq\">Tesla and SpaceX CEO Elon Musk, one of the <a href=\"https://www.theverge.com/2021/1/7/22163361/elon-musk-billionaire-richest-world-jeff-bezos-tesla-stock-spacex\">wealthiest men in the world</a> (depending on the day) says the Securities and Exchange Commission (SEC) has tried to “chill” his free speech in an “unrelenting investigation” of him and the automaker he co-founded. The SEC, Musk’s attorneys allege, “has broken its promises” in a 2018 settlement over a tweet Musk posted saying he had <a href=\"https://www.theverge.com/2018/8/7/17661178/tesla-elon-musk-private-420-share-considering\">funding secured to take Tesla private</a>.</p><p id=\"IzbKPb\">“Worst of all, the SEC seems to be targeting Mr. Musk and Tesla for unrelenting investigation largely because Mr. Musk remains an outspoken critic of the government,” the letter states, “the SEC’s outsized efforts seem calculated to chill his exercise of First Amendment rights rather than to enforce generally applicable laws in evenhanded fashion.” </p><p id=\"gYXCci\">Musk’s attorneys made the allegations in a letter to Judge Alison Nathan, who oversaw the 2018 settlement. Musk was charged with making false and misleading statements. Under the terms of the agreement, he was ordered to pay a $20 million fine and required to step down as Tesla chairman for three years. Tesla also had to pay a separate $20 million fine, and was required to monitor Musk’s statements about the company on Twitter and elsewhere. </p><div class=\"c-float-right\"><aside id=\"oPtnbF\"><q>Musk says the SEC has broken its promises</q></aside></div><p id=\"y4MYC5\">The SEC asked a federal judge to hold <a href=\"https://www.theverge.com/2019/2/25/18240568/elon-musk-tesla-sec-contempt-of-court-settlement-violation-tweet-twitter\">Musk in contempt</a> in February 2019 for a <a href=\"https://twitter.com/elonmusk/status/1098013283372589056\">tweet claiming</a> that Tesla would make “around” 500,000 cars that year. That contradicted the company’s official guidance that it would deliver between 360,000 and 400,000 total cars in 2019. The SEC said Musk was in “<a href=\"https://www.theverge.com/2019/3/18/18271914/sec-elon-musk-contempt-twitter-court-fraud\">blatant violation</a>” of the settlement; Musk said the SEC was trying to make an “<a href=\"https://www.theverge.com/2019/3/11/18260339/elon-musk-sec-twitter-filing-contempt-response\">unconstitutional power grab</a>.” Nathan <a href=\"https://www.theverge.com/2019/4/4/18295240/elon-musk-sec-tweets-judge-nyc-ruling\">ordered the two sides</a> to “come back with your reasonableness pants on” and work things out. </p><p id=\"DyMI1C\">The November 2021 subpoena takes issue with a tweet Musk posted <a href=\"https://www.theverge.com/2021/11/7/22768364/elon-musk-poll-twitter-tesla-10-percent-billionaires-capital-gains-tax\">polling his followers</a> whether he should sell 10 percent of his Tesla stake. Tesla’s shares dropped 16 percent in the trading days following the tweet. </p><p id=\"MT4y0O\">In addition to allegedly stifling his free speech, Musk’s attorneys write in the newest letter, the SEC has not yet distributed $40 million to shareholders as agreed upon in the settlement. “Mr. Musk and Tesla understood that settling with the SEC would at last end the SEC’s harassment and, importantly, make this Court, and not the SEC alone, the monitor over any perceived compliance issues going forward,” the letter states. “But the SEC has broken its promises.”</p><p id=\"QuUgR2\">Tesla did not reply to a request for comment Thursday; the company dissolved its press office and does not typically respond to media queries. The SEC did not immediately reply to a request for comment Thursday.</p><div id=\"dre9x5\"><iframe src=\"https://embed.documentcloud.org/documents/21223432-elon-musk-letter-to-judge-nathan-february-2022/?embed=1&amp;responsive=1&amp;title=1\" title=\"Elon Musk letter to Judge Nathan February 2022 (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/FvNo6b7qthX14chzvKDA52IV_84=/0x753:4978x3359/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23252117/1234657348.jpg",
  "description": "The agency has broken its promises, the Tesla CEO says",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}