{
  "title": "Elon Musk’s first Starship update in two years is next week",
  "url": "https://www.theverge.com/2022/2/3/22916863/elon-musk-spacex-starship-presentation-update",
  "date": "2022-02-03T23:40:54.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mixLeTyaoiuAT_LtZ8bgYHdFMS0=/0x0:3840x2560/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70468910/51370391111_a43a3825e5_o__1_.0.jpg\" />    </figure>  <p id=\"nOPwB3\">SpaceX CEO Elon Musk announced plans to give an update on his company’s next-generation Starship rocket next Thursday evening. The presentation will come more than two years after <a href=\"https://www.theverge.com/2019/9/28/20888978/spacex-starship-super-heavy-update-elon-musk\">Musk’s last update on the vehicle in 2019</a>.</p><p id=\"JQ8eKn\">Starship is the massive new deep-space rocket that SpaceX has been developing at the company’s test facility in Boca Chica, Texas, for the last few years. The fully reusable vehicle is designed to launch on top of a giant booster called Super Heavy, carrying people and cargo to distant destinations like the Moon and eventually Mars. So far, SpaceX has <a href=\"https://www.theverge.com/2021/5/5/22421845/spacex-starship-sn15-successful-landing\">conducted a few high-altitude test flights with the vehicle</a> but has yet to launch Starship to orbit. The company is currently <a href=\"https://www.theverge.com/2021/10/21/22738106/spacex-boca-chica-starship-launch-site-faa-town-hall-environmental-assessment\">awaiting approval from the Federal Aviation Administration</a> to launch Starship to orbit out of Boca Chica.</p><div id=\"sfBGje\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Thursday next week at 8pm Texas time</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1489358828202246145?ref_src=twsrc%5Etfw\">February 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"CCDhXQ\">Since 2016, Musk has been giving periodic presentations on his plans to build a giant rocket to send people to deep space and onto Mars someday. Those plans have certainly evolved over time, and the rocket at the heart of this endeavor has gone through various design changes and iterations as well. The vehicle’s gone by quite a few different names, too, from BFR to Mars Colonial Transporter to eventually Starship. During Musk’s last update in September of 2019, the CEO gave his presentation at Boca Chica standing in front of a full prototype of Starship. Musk’s tweet on the new presentation says it will take place on Thursday, February 10th at 9PM ET, but no other details have been given about the event.</p><p id=\"7nr5tT\">While Starship has long been Musk’s pet project, NASA also has a vested interest in the vehicle. In 2021, the space agency <a href=\"https://www.theverge.com/2021/4/30/22412771/nasa-spacex-hls-moon-lander-blue-origin-protest\">awarded SpaceX a $2.9 billion contract</a> to develop Starship as a lander to carry NASA astronauts to the surface of the Moon.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/peBAkrMZapeMz-nPTHVgfID3NT0=/0x275:3840x2285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23216699/51370391111_a43a3825e5_o__1_.jpg",
  "description": "We’ll know more about SpaceX’s next-gen rocket soon",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}