{
  "title": "Elon Musk’s plans for making money with Twitter reportedly include job cuts",
  "url": "https://www.theverge.com/2022/4/28/23047376/elon-musk-twitter-job-cuts",
  "date": "2022-04-28T23:16:55.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OLRFUOgRZATM5Vzzrg0l7nPvtac=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70807414/VRG_Illo_STK022_K_Radtke_Musk_Down_arrow.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"jjNl40\">As part of his pitch to raise funds to acquire Twitter, Elon Musk apparently “floated” the idea of cutting jobs at Twitter to improve its bottom line, <a href=\"https://www.bloomberg.com/news/articles/2022-04-28/musk-s-twitter-pitch-featured-job-cuts-other-ways-to-make-money\">according to a <em>Bloomberg</em> report</a>. “While nothing is set in stone — and Musk himself had no access to Twitter’s non-public financials at the time — he specifically mentioned job cuts” during discussions with banks, the report says. <em>The Washington Post</em> <a href=\"https://www.washingtonpost.com/technology/2022/04/28/musk-twitter-job-cuts/?utm_source=feedly&amp;utm_medium=referral&amp;utm_campaign=wp_business-technology\">reported that</a> Musk discussed making “efficiencies” at the company in the conversations with bankers, “which could include job cuts.”</p><p id=\"YmS0OO\">There are still a lot of uncertainties about what Twitter will look like under Musk’s ownership, assuming the <a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\">$44 billion deal announced Monday</a> goes through as expected. So far, the best indication of what he wants to do with the platform comes from his own words <a href=\"https://www.prnewswire.com/news-releases/elon-musk-to-acquire-twitter-301532245.html\">in a press release</a>:</p><blockquote><p id=\"RgcJCn\">Free speech is the bedrock of a functioning democracy, and Twitter is the digital town square where matters vital to the future of humanity are debated. I also want to make Twitter better than ever by enhancing the product with new features, making the algorithms open source to increase trust, defeating the spam bots, and authenticating all humans. Twitter has tremendous potential — I look forward to working with the company and the community of users to unlock it.</p></blockquote><p id=\"K5GRPO\">But potential job cuts have not been publicly discussed. Twitter didn’t immediately respond to a request for comment. </p><p id=\"zpQwxw\">Given Musk’s many tweets about opening up free speech on the platform — including ones criticizing past decisions by Twitter that <a href=\"https://www.theverge.com/2022/4/27/23044521/twitter-policy-chief-vijaya-gadde-elon-musk-policy-criticism-harassment\">have drawn negative attention to employees</a> — one area where Musk may make cuts is the company’s policy department. Musk dissolved the PR department <a href=\"https://electrek.co/2021/04/28/elon-musk-no-new-tesla-pr-department-manipulating-public-opinion/\">at Tesla</a>, so perhaps Twitter’s communications groups could be under scrutiny as well.</p><p id=\"9s2xRt\">To bankers, Musk may have discussed ways to improve the bottom line, but publicly, he’s indicated that he isn’t interested in Twitter for the money. “This is not a way to sort of make money,” <a href=\"https://www.theverge.com/2022/4/14/23025343/elon-musk-twitter-takeover-ted-talk-quote-stock-buyout\">Musk said at TED 2022 on April 14th</a>. “My strong intuitive sense is that having a public platform that is maximally trusted and broadly inclusive is extremely important to the future of civilization. I don’t care about the economics at all.” </p><p id=\"tlgdGW\"><em><strong>Update April 28th, 8:30PM ET</strong></em><em>: Added corroboration from </em>The Washington Post<em>.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VIKNVP6VyW2qm7f37Du9y35bHkk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382324/VRG_Illo_STK022_K_Radtke_Musk_Down_arrow.jpg",
  "description": "There are many uncertainties about Twitter’s future.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}