{
  "title": "Elon Musk’s silence on how he’d moderate the Buffalo shooting livestream is deafening",
  "url": "https://www.theverge.com/2022/5/16/23076428/buffalo-shooting-video-elon-musk-twitter-content-moderation",
  "date": "2022-05-16T21:57:43.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ImZf4bTlCnZNCXteVM62uRYYS5s=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70876303/1240709189.0.jpg\" />        <figcaption><em>Aaron Jordan, of Buffalo, adds to a sidewalk chalk mural depicting the names of the people killed at a mass shooting at Tops Friendly Market in Buffalo, NY. Sunday, May 15, 2022 in Buffalo, NY.</em> | Kent Nishimura / Los Angeles Times via Getty Images</figcaption>    </figure>  <p id=\"Rg0Y7X\">On May 14th, social media platforms found themselves scrambling to deal with a livestream video of a white supremacist terror attack. Yet the man who has been the nation’s loudest commentator on content moderation had nothing to say.</p><p id=\"tvEofK\">Under <a href=\"https://twitter.com/elonmusk/status/1519036983137509376\">Elon Musk’s view of content moderation</a>, any restriction on speech beyond what the law proscribes is censorship. And by that standard, the video of the attack in Buffalo — however graphic — should have remained on the platform since videos of graphic violence are not illegal speech. In practice, platforms were criticized for being too slow to remove them, and Musk found no need to weigh in on the debate.</p><p id=\"hD1Gxu\">The details of the Buffalo, New York shooting are widely known and still painful to report. Ten people were killed on a Saturday afternoon in a supermarket that was a mainstay for residents of Buffalo’s <a href=\"https://www.nytimes.com/2022/05/14/nyregion/east-side-buffalo-shooting.html\">predominantly Black East Side</a>. A gunman livestreamed the murderous violence on Twitch and <a href=\"https://www.nbcnews.com/news/us-news/buffalo-shooting-suspect-planned-continue-rampage-street-police-say-rcna28969\">planned to inflict yet more</a> before being stopped by police.</p><p id=\"Ko5Bj9\">The Buffalo gunman was, beyond doubt, radicalized online. He cited the <a href=\"https://www.theverge.com/2019/3/15/18266859/new-zealand-shooting-video-social-media-manipulation\">Christchurch mass shooter</a> as an inspiration, <a href=\"https://twitter.com/ADL/status/1526209674244247554\">copying large parts</a> of the New Zealand terrorist’s manifesto into one of his own. He was motivated by the “great replacement” theory, which holds that white people are being intentionally dispossessed from their positions of power through immigration and interracial marriage. He wrote that he had learned of the theory through 4chan, the online message board that spawned QAnon and has been <a href=\"https://www.theguardian.com/technology/2022/may/01/4chan-extremist-online-forum-raymond-spencer\">linked to many other acts of white supremacist terrorism</a>.</p><p id=\"rtKgxk\">He was also, without doubt, drawing from a playbook of mass shooters who <a href=\"https://www.theverge.com/2015/8/27/9217305/virginia-shooting-mass-murder-contagion-social-media\">engineer their massacres to spread on social media</a> and hope to exploit the viral power of extreme, graphic violence to amplify a message of hate. And while the original Twitch stream was removed in a matter of minutes, on other platforms, the video <a href=\"https://apnews.com/article/technology-shootings-new-york-social-media-d7b488e820ab0a4056995e87a16fe71e\">circulated much more widely and for longer</a>.</p><p id=\"KB3bD1\">And as America reeled from the news, Elon Musk remained silent — despite Tesla’s <a href=\"https://buffalonews.com/business/local/how-tesla-built-its-buffalo-workforce-beyond-solar-to-dodge-a-big-state-penalty/article_07e4cfae-837e-11ec-ada5-3fc7b71005dd.html\">sizable presence in Buffalo</a>. While Twitter — the company whose moderation policy he has relentlessly critiqued in the lead up to and aftermath of his <a href=\"https://www.theverge.com/23026874/elon-musk-twitter-buyout-news-updates\">acquisition deal</a> — was forced to make real-time decisions over whether <a href=\"https://fortune.com/2022/05/16/buffalo-shooting-video-twitch-twitter-facebook-reaction/\">videos of the shooting should be allowed to circulate</a> or if links to a terrorist manifesto violated content policies, its aspirational owner refrained from comment.</p><p id=\"W4XvN9\">Perhaps his focus has been elsewhere, a sympathetic reader might say. True, with stock markets wobbling, Tesla stocks down, and the <a href=\"https://www.theverge.com/2022/5/13/23070306/elon-musk-twitter-deal-on-hold-spam-inauthentic-accounts\">Twitter acquisition deal “on hold,”</a> there is a lot that could distract his attention. If he had stopped tweeting entirely over the weekend, it would be fair to suggest that he was occupied elsewhere.</p><p id=\"yS7oFS\">In reality, within hours of the shooting, Musk had posted a number of tweets, some of them even touching on content moderation. Approximately five hours after the shooting took place, he explained to users how they could access the chronological feed to avoid being “<a href=\"https://twitter.com/elonmusk/status/1525612988115320838\">manipulated by the algorithm</a>.” Later on in the evening, he found time to share a newsletter from Matt Taibbi on corporate regulation in California, some images of a recent Space X launch, and a royal portrait of King Louis XIV of France. The next day, he revisited the thread on chronological ordering with a tweet about the importance of open-source code. On Monday, he found enough time to <a href=\"https://twitter.com/elonmusk/status/1526246899606601730\">troll Twitter CEO Parag Agrawal</a> in a conversation about spam. But watchers looking for any comment on Buffalo found nothing.</p><div id=\"tobjv0\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Been hitting refresh all day waiting for Elon’s take on the Buffalo shooter’s manifesto and video being shared on Twitter. Nothing. Nada. Zip. Zilch.</p>— Dare Obasanjo (@Carnage4Life) <a href=\"https://twitter.com/Carnage4Life/status/1525945742841368576?ref_src=twsrc%5Etfw\">May 15, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"6aIuYB\">Would Elon Musk have ordered videos of the shooting to be removed? So far, he has given no answers because there is no answer that can satisfy both a common understanding of moral decency and his <a href=\"https://twitter.com/elonmusk/status/1519036983137509376\">stated position on moderation and free speech</a>. A video showing graphic violence is not in itself illegal, and the Buffalo shooter’s video will certainly be shared by police departments, government agencies, and other organizations investigating the crime. But for millions of social media users to view and share a video of a massacre for their own morbid curiosity is unconscionable, and every platform will have content policies that rightly block or heavily restrict it.</p><p id=\"yq0Z69\">Because he has failed — at least publicly — to engage with any of the numerous content moderation researchers who study violent and extremist content, Musk has shown no nuanced understanding of the range of speech that is legal but dangerous or that there is any difference between content we should ban outright and content that we should consider limiting from being broadcast on a giant, globe-spanning distribution platform.</p><p id=\"gz1tyS\">Now is a time for that discussion. In a moment when the national conversation is focused on this act of terrorism, Elon Musk has a chance to plant his flag in the ground: to commit to his vision of laissez-faire content moderation and accept the consequences or recognize that there are limits. </p><p id=\"9LBGRM\">Instead, the free speech advocate has become strangely mute.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/b3DWqRyUkZSSaDROPDtivi13UTo=/0x859:6000x4000/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23481109/1240709189.jpg",
  "description": "A weekend of tweets with no mention of the mass shooting",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}