{
  "title": "Elon Musk updates the paperwork on his shocking Twitter purchase to avoid extra SEC drama",
  "url": "https://www.theverge.com/2022/4/5/23012266/elon-musk-sec-twitter-stock-acquisition-13d-tesla",
  "date": "2022-04-05T22:56:09.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Tesla Officially Opens Gruenheide Gigafactory\" src=\"https://cdn.vox-cdn.com/thumbor/TbjNi77lNLA5rFUNM_ghGC24JdM=/0x0:4274x2849/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70714570/1239417516.0.jpg\" />        <figcaption>Photo by Christian Marquardt - Pool/Getty Images</figcaption>    </figure>  <p id=\"5QTVYe\">Within the news of <a href=\"https://www.theverge.com/2022/4/4/23009622/elon-musk-twitter-shares-free-speech\">Elon Musk taking a significant ownership stake in Twitter </a>— and the revelation that <a href=\"https://www.theverge.com/2022/4/5/23011327/twitter-edit-button-blue-test\">it really is working on an edit button for tweets</a> — many people noticed a wrinkle that seemed small at first but could cause problems later. </p><p id=\"SVhPku\">On Monday, Musk filed beneficial ownership report paperwork with the Securities and Exchange Commission (SEC) to note his ownership of 73,486,938 shares of Twitter (about 9.2 percent of its outstanding common stock and enough to make him the company’s largest individual shareholder), and the box checked on the form (<a href=\"https://d18rn0p25nwr6d.cloudfront.net/CIK-0001418091/f66f56c1-eb52-43f8-a7ff-992dc80a7396.pdf\">pdf</a>) indicated it was a Schedule 13G, which allows for a simple disclosure for investors who intend to remain “passive” in the company’s affairs. </p><p id=\"sPrAnK\">We don’t usually get into stock market minutiae, but this is important because of what happened next. This morning, Twitter and its CEO, Parag Agrawal, <a href=\"https://www.theverge.com/2022/4/5/23011256/elon-musk-twitter-board-of-directors-ownership\">announced Elon Musk is becoming a board member</a>, and that news raised eyebrows because it suggests a much more active role, which requires filing a more detailed Section 13D form about the stock purchase. </p><p id=\"jBVXPt\">Failing to have the right disclosure could result in a fine from the SEC, and as much as Elon seems to enjoy his ongoing standoffs with the federal agency (alleging <a href=\"https://www.theverge.com/2022/2/19/22942017/elon-musk-tesla-sec-claims-unrelenting-investigation-countered\">broken promises</a>, <a href=\"https://www.theverge.com/2022/2/22/22946117/elon-musk-sec-accuse-leak-information-tesla\">accusing</a> the agency of leaks, claiming he was <a href=\"https://www.theverge.com/2022/3/8/22967122/elon-musk-tesla-sec-tweet-court-subpoena-investigation\">coerced into an unjust settlement</a> over his tweets, and <a href=\"https://www.theverge.com/2022/3/29/23001516/elon-musk-eminem-tesla-sec-tweets\">citing Eminem</a> in a court filing are just a few), it looks like this is one he’s decided to avoid. At about the same time news broke about the edit button, <a href=\"https://www.sec.gov/Archives/edgar/data/1418091/000110465922042863/tm2211757d1_sc13d.htm\">an updated filing appeared,</a> amending the previous one, checking off the correct box, and seemingly avoiding an unnecessary headache for the billionaire and his new 9.2 percent toy. </p><aside id=\"AjYDdr\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Elon Musk tweeted his way onto Twitter’s board — now what? \",\"url\":\"https://www.theverge.com/2022/4/5/23011810/elon-musk-twitter-sec-board-member-moderation\"},{\"title\":\"Twitter says Elon Musk won’t get special treatment from its rules, even as a board member \",\"url\":\"https://www.theverge.com/2022/4/5/23011558/twitter-elon-musk-board-members-special-exceptions-moderation-rules\"}]}'></div></aside><p id=\"3SzCDu\">Most notably, the new form includes language relating to Musk’s plans for his stake in the company and the company overall. It references the agreement that he not try to own more than 14.9 percent of Twitter’s stock as a condition of joining the board and that other than potentially selling or buying shares, he doesn’t have plans to try and sell the company or its subsidiaries, propose a merger or take any other actions <a href=\"https://www.law.cornell.edu/cfr/text/17/240.13d-101\">listed underneath Item 4 on the form</a>. A report by <a href=\"https://www.nytimes.com/2022/04/04/business/twitter-elon-musk-directors.html?\"><em>The New York Times</em></a> indicates that, unlike some other board members, Musk did not sign an agreement promising not to influence the company’s policies.</p><p id=\"ZhDmBq\">The new filing also has considerably more detail than Monday’s form about how we got here. It indicates Musk has been buying Twitter shares almost daily since January 31st. He never bought fewer than 371,075 shares on the days he acquired them, peaked at 4,839,507 purchased on February 7th, and the last noted batch was purchased on April 1st. On April 4th, Twitter announced his new role, and one day later, we heard the news about the edit button (which Twitter says has been in the works for over a year and has nothing to do with any poll posted by its newest board member).</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5irOeTGnfAURow0Y6GTzb3hLhNY=/0x0:4274x2238/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23369973/1239417516.jpg",
  "description": "A new side gig for the Tesla boss comes with some strings",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}