{
  "title": "Elon Musk says the SEC’s investigations into Tesla are ‘like having a gun to your child’s head’",
  "url": "https://www.theverge.com/2022/4/14/23025511/elon-musk-sec-funding-secured-tesla-twitter-ted",
  "date": "2022-04-14T18:17:58.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/h6B7cXHAZEsRXMzfre-_8Ua4_V8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70749609/acastro_191204_1777_elon_legal_0001.0.0.jpg\" />    </figure>  <p id=\"omhhl5\">Elon Musk took the Securities and Exchange Commission to task during a TED appearance Thursday, claiming he had the funding to take Tesla private despite the agency concluding that he had not. </p><p id=\"y05c18\">“I should say actually... with Tesla back in the day, funding was actually secured,” Musk said. “I want to be clear about that.”</p><p id=\"yYeDMH\">Musk has been <a href=\"https://www.theverge.com/2022/3/8/22967122/elon-musk-tesla-sec-tweet-court-subpoena-investigation\">trading blows with the SEC</a> over the agency’s order that his tweets be reviewed by a lawyer before being publicly posted. The order is based on Musk’s decision to send the now-notorious “funding secured” tweet on August 7th, 2018, in which he claimed to have the finances to take Tesla private at $420 a share. (Tesla has been a publicly traded company since 2010.)</p><div class=\"c-float-right\"><aside id=\"rR3TvE\"><q>“funding was actually secured”</q></aside></div><p id=\"fWG7pC\">The SEC immediately launched an investigation, eventually concluding that, while he had held a few meetings with Saudi Arabia’s sovereign wealth fund, Musk “had never discussed a going-private transaction at $420 per share with any potential funding source, had done nothing to investigate whether it would be possible for all current investors to remain with Tesla as a private company via a ‘special purpose fund,’ and had not confirmed support of Tesla’s investors for a potential going-private transaction.”</p><p id=\"Lrv8tA\">Musk has refuted this in a litany of court documents over the past few months, and during the TED appearance, he offered more insight into why he believes the SEC is singling him out. Musk’s appearance in Vancouver was mainly a forum for him to discuss his recently announced <a href=\"https://www.theverge.com/2022/4/14/23024905/elon-musk-offers-to-buy-twitter\">hostile takeover bid of Twitter</a>, but when TED founder Chris Anderson asked whether he had “funding secured” for the Twitter deal, Musk took that as an opportunity to re-litigate his four-year battle with the SEC. </p><p id=\"vqvW0u\">“I should say like, why do I do not have respect for the SEC in that situation?” Musk said. “And I don’t mean to blame everyone at SEC but certainly the San Francisco office. It’s because the SEC knew that funding was secured, but they pursued an active public investigation nonetheless.”</p><div class=\"c-float-right\"><aside id=\"P6f3or\"><q>“the SEC knew that funding was secured, but they pursued an active public investigation nonetheless”</q></aside></div><p id=\"fKYe8j\">Musk explained that at the time, Tesla was under assault from short sellers who were betting that the company would go bankrupt. Tesla’s stock was extremely volatile, and the company was attempting to scale production of the Model 3 electric sedan, which was proving to be far more difficult than Musk and the company’s top executives anticipated. Echoing statements made by his lawyers in recent court filings, Musk said that he felt coerced into settling with the SEC in order to ensure Tesla’s banks would continue to provide capital to the company so it wouldn’t go bankrupt. </p><p id=\"zFnHfP\">“So that’s like having a gun to your child’s head,” Musk added. “So I was forced to concede to the SEC unlawfully. Those bastards.”</p><p id=\"IWH6d0\">The SEC is currently investigating whether recent stock sales by Musk and his brother Kimbal Musk <a href=\"https://www.theverge.com/2022/2/24/22949453/tesla-elon-musk-kimbal-sec-investigation-insider-trading\">potentially violated insider trading rules</a>. The investigation began late last year after Musk and his brother sold $108 million worth of Tesla shares. That sale happened the day before Elon Musk polled his Twitter followers about whether he should sell 10 percent of his stake in the company — and promised to abide by the poll’s results.</p><p id=\"fLHVUh\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lX6IqIOaAzprhNEVlMkJfyjNG4M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19435361/acastro_191204_1777_elon_legal_0001.0.jpg",
  "description": "The SEC concluded that Musk had not secured funding.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}