{
  "title": "Elon Musk tweeted his way onto Twitter’s board — now what?",
  "url": "https://www.theverge.com/2022/4/5/23011810/elon-musk-twitter-sec-board-member-moderation",
  "date": "2022-04-05T18:06:43.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"GERMANY-ECONOMY-AUTOMOBILE-TESLA\" src=\"https://cdn.vox-cdn.com/thumbor/F5CPbfb8_INTY9coGbRzFxaAp-w=/0x5:3142x2100/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70713251/1239416791.0.jpg\" />        <figcaption>Photo by PATRICK PLEUL/POOL/AFP via Getty Images</figcaption>    </figure>  <p id=\"ZW6XYO\">Ahahahahahaha fine. Longtime shitposter Elon Musk, who has a side gig as the CEO of Tesla, is on the board of Twitter, <a href=\"https://www.theverge.com/22744728/money-fandom-cryptocurrency-retail-trades-stocks\">a newly minted meme stonk</a>, after filing the wrong form with the Securities and Exchange Commission. <a href=\"https://knowyourmeme.com/memes/but-this-is-tremendous-content\"><em>Tremendous</em> content</a>.</p><p id=\"Q6lUEl\">A different style of billionaire might elect to buy a national newspaper with a storied past and re-invest in it, just like he might secretly test his dick-shaped rocket for many years before publicly taking a ride on it. But despite owning Amazon, Jeff Bezos is somehow <em>less</em> internet-poisoned than the meme lord of Dogecoin. The true platform for brain worms isn’t <em>The Washington Post</em>, despite its op-ed writers’ best efforts. It’s Twitter.</p><div class=\"c-float-right\"><aside id=\"2Gnqxm\"><q>The platform’s top shitposter already <em>has the keys to the castle</em></q></aside></div><p id=\"WXaZ3K\">Now, obviously, Musk has a <a href=\"https://www.readmargins.com/p/92-and-the-master-of-twitter?token=eyJ1c2VyX2lkIjoxODc0NDM1LCJfIjoiTm5hbk4iLCJpYXQiOjE2NDkxNzI3ODgsImV4cCI6MTY0OTE3NjM4OCwiaXNzIjoicHViLTY2ODMiLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.KduMHQ8rZQF20BP-WfAye2SuOhGTrceXl5QJ2ZaIPVc&amp;s=r\">long and storied history</a> with Twitter, from SEC violations to defamation lawsuits to threatening journalists to stealing memes. Do you think Twitter is ever gonna successfully moderate its largest shareholder and board member? Like, sure, <a href=\"https://www.theverge.com/2022/4/5/23011558/twitter-elon-musk-board-members-special-exceptions-moderation-rules\">Twitter spokesperson Adrian Zamora <em>says</em></a> they’re “committed to impartiality in the development and enforcement of its policies and rules” and that “our day to day operations and decisions are made by Twitter management and employees.” As a practical matter, we’ll find out if our friend Adrian is telling the truth, won’t we?</p><p id=\"51CToJ\">Because here’s the thing: I notice Musk is <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-04/elon-musk-bought-some-twitter\">already doing some light trolling</a> about Twitter products, with a handy assist from Twitter CEO Parag Agrawal! Specifically, Musk is <a href=\"https://twitter.com/elonmusk/status/1511143607385874434\">polling to ask if Twitter should add an edit button</a>, and Agrawal has said the poll will have <a href=\"https://twitter.com/paraga/status/1511152454418644995\">important consequences</a>. I mean, that’s not tweeting disinformation or anyone’s home address or anything that’s an obvious ToS violation — but it does suggest that some operations and decisions, um, may be made by Musk, actually. The platform’s top shitposter <em>already</em> <em>has the keys to the castle</em>, and he’s gotten them in a way that’s specifically a thumb in the eye of the SEC. We love to have fun on Twitter dot com!</p><p id=\"tXsRO0\">Let’s talk about that form for a second. If you are, let’s say, <a href=\"https://www.bloomberg.com/news/articles/2020-02-29/singer-s-elliott-is-said-to-seek-to-replace-twitter-ceo-dorsey\">Elliott Capital Management</a>, and you’ve bought into Twitter to institute some <em>shareholder activism</em>, you fill out a form 13D, in which you disclose the purpose of your buy (e.g., kicking out Jack Dorsey, making Twitter more profitable). But if you are a large institutional investor from, let’s say, the imaginary firm Ride the Lightning Capital, and you’re just going to own a chunk of Twitter passively, you fill out a form 13G. <a href=\"https://www.sec.gov/Archives/edgar/data/0001418091/000110465922041911/tm2211482d1_sc13g.htm\">Musk’s purchase was disclosed on a form 13G</a> he filed the same day as he signed the paperwork to join the board. </p><div class=\"c-float-left\"><aside id=\"xV6OU1\"><q>Twitter now has a fandom: Musk’s</q></aside></div><p id=\"lqeeDO\">Now, I can’t speak to Musk’s intent. Maybe that was an honest mistake, I don’t know! I do know that he’s tweeted that SEC is an acronym, and the E stands for “Elon’s.” He’s not <em>above</em> tweaking the SEC — he’s <a href=\"https://www.theverge.com/2018/12/14/18139544/elon-musk-60-minutes-tesla-sec-investigation-fine\">gone on <em>60 Minutes</em></a> to inform us he doesn’t respect it, you know?</p><p id=\"CTZQCp\">If Musk is trolling, though, this is sharp. Like, <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-05/elon-musk-got-a-twitter-board-seat\">maybe he’ll get a fine or something</a>, but the SEC’s job is to protect shareholders, right? It’s why Musk and Tesla <a href=\"https://www.theverge.com/2022/3/8/22967122/elon-musk-tesla-sec-tweet-court-subpoena-investigation\">got fined</a> for his <a href=\"https://www.theverge.com/2018/9/27/17911428/sec-lawsuit-elon-musk-tesla-funding-tweet\">“funding secured” tweets</a> but Musk remained as CEO — removing him would arguably harm shareholders more than letting Musk yolo his little heart out. Musk is valuable! The disclosure of his stake in Twitter <a href=\"https://www.cnbc.com/2022/04/04/twitter-stock-on-track-for-best-day-since-ipo-after-musk-buys-in.html\">sent shares up 27 percent</a>, a cute lil pop for a social media company that’s getting <em>absolutely clobbered</em> by TikTok and the company formerly known as Facebook. So if the SEC is like, “haha, you are <em>definitely</em> not going to be on the board of Twitter,” it’s probably wise to assume the stock will fall! And shareholders will get hurt! </p><p id=\"lBWELF\">See, Twitter now has a fandom: Musk’s. Musk has wandered into Twitter well after it became a public company, is a prolific — one might even say flagrant — user of its product, and presumably brings a number of retail investors trailing him. It’s not just that. <a href=\"https://twitter.com/b_fung/status/1511335664024965126\">CNN reporter Brian Fung noted</a> that Musk also has the freedom to pick fights with Twitter’s enemies under the cover of “Elon being Elon.”</p><p id=\"7SUgCH\">Well, I expect Twitter to double down on being Twitter. Spaces has been a tremendous success, especially with the cryptocurrency-curious. There’s also the NFT profile pics. Musk, of course, is known for being enamored of Dogecoin, to say nothing of Tesla’s <a href=\"https://www.theverge.com/2021/5/12/22433153/tesla-suspend-bitcoin-vehicle-purchase-cryptocurrency-elon-musk\">brief foray into Bitcoin payments</a> for its cars. Perhaps now that Dorsey is no longer CEO, Musk can get Twitter to accept <a href=\"https://www.theverge.com/2021/7/21/22587390/spacex-tesla-bitcoin-musk-dorsey-ethereum-dogecoin\">Bitcoin as payment for advertisements</a>. Maybe this will be <a href=\"https://www.theverge.com/2021/5/17/22440425/elon-musk-impersonator-cryptocurrency-bitcoin-twitter-scam-report-ftc\">the impetus Twitter finally needs</a> to get rid of Musk-related <a href=\"https://www.theverge.com/2018/3/8/17096128/twitter-vitalik-buterin-elon-musk-cryptocurrency-scams\">cryptocurrency scam spam</a>!</p><div class=\"c-float-right\"><aside id=\"s0Blwk\"><q>Musk doesn’t just have the ear of the CEO — he gets to do his performance evaluations!</q></aside></div><p id=\"UiZpVf\">I wonder if Twitter will now consider cryptocurrency users its main constituency, particularly if they are more likely to pay for its products. Rather than focusing on acquiring more users, Twitter may just try to extract money from its most lucrative users. This isn’t <em>that</em> weird of a strategy — actually, Musk’s old company, PayPal, outlined <a href=\"https://www.cnbc.com/2022/02/01/paypal-pypl-q4-2021-earnings.html\">something similar on its last earnings call</a>.</p><p id=\"ojIwP4\">On a practical level: Musk has also said that <a href=\"https://www.platformer.news/p/elon-musks-twitter-play\">he wants less moderation on Twitter</a>, which, like, may not be great for shareholder value, <em>Platformer’s</em> Casey Newton points out. (Most users like moderation, it turns out.) But now that Twitter is a meme stock, traditional measures of shareholder value, um, may not apply. It’s possible Musk’s involvement will make <a href=\"https://twitter.com/anildash/status/1511324711908777988\">journalists less likely to use the platform</a>, given his history of <a href=\"https://www.thedailybeast.com/what-its-like-when-elon-musks-twitter-mob-comes-after-you\">sparring with journalists online</a>. I’m sure there are some people out there wondering if Musk’s position on the board means he might be able to get access to their DMs.</p><p id=\"KHiNuR\">Which is sort of the crux of the thing, I guess? On the one hand: Musk has a fandom, and now Twitter has a fandom, too. On the other: Twitter is notorious as <a href=\"https://www.nytimes.com/interactive/2019/08/15/opinion/gamergate-zoe-quinn.html\">a platform for harassment</a>, and Musk has indicated that he wants <em>even less moderation</em>. On some theoretical third hand: the SEC is looming in the background. Regardless of whether people’s worst fears come to pass, this is revolutionary new territory for shitposters everywhere. Musk doesn’t just have the ear of the CEO — he gets to do his performance evaluations!</p><p id=\"sxCasT\">Still, when you make your hobbies your job, you run the risk of making something that was once fun feel like drudgery. One possible outcome is that Musk’s position on the board makes him back away from shitposting for the exact reason many people spend a lot of time on Twitter in the first place: he wants to avoid doing work.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yTmWekFdn3mJIJjJYthSua1mEyQ=/0x230:3142x1875/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23369082/1239416791.jpg",
  "description": "The board’s representative with full poster brain",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}