{
  "title": "Elon Musk offers to buy Twitter in takeover attempt",
  "url": "https://www.theverge.com/2022/4/14/23024905/elon-musk-offers-to-buy-twitter",
  "date": "2022-04-14T10:26:19.000Z",
  "author": "Thomas Ricker",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XQgzvubpNiyYvVyHVP0hMiGJovs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70747621/VRG_Illo_STK022_K_Radtke_Musk_Twitter_Upside_Down.5.jpg\" />    </figure>  <p id=\"gtQrfc\">Tesla CEO Elon Musk is making his “best and final” <a href=\"https://www.sec.gov/Archives/edgar/data/1418091/000110465922045641/tm2212748d1_sc13da.htm\">offer to buy 100 percent of Twitter</a> in an updated 13D filed Thursday with the SEC. He’s offering $54.20 per share in cash. </p><p id=\"LYySZg\">Naturally, Musk had to <a href=\"https://www.theverge.com/2018/8/7/17661178/tesla-elon-musk-private-420-share-considering\">sneak a “420” into the offer</a>.</p><p id=\"uozXnZ\">Musk is offering to “acquire all of the outstanding Common Stock of the Issuer not owned by the Reporting Person for all cash consideration valuing the Common Stock at $54.20 per share.”  The proposal was delivered in a letter to Twitter on April 13th. Musk says Twitter must go private to undergo changes that need to be made.</p><div class=\"c-float-right\"><aside id=\"oXdFji\"><q>“Twitter has extraordinary potential. I will unlock it.”</q></aside></div><p id=\"W7Y9gQ\">“I invested in Twitter as I believe in its potential to be the platform for free speech around the globe, and I believe free speech is a societal imperative for a functioning democracy,” said Musk in a letter sent to Twitter Chairman Bret Taylor. “Twitter has extraordinary potential. I will unlock it.”</p><p id=\"2ZmIQW\">“I would need to reconsider my position as shareholder,” says Musk if his offer is not accepted. </p><p id=\"uPEJ4a\">Twitter <a href=\"https://www.prnewswire.com/news-releases/twitter-confirms-receipt-of-unsolicited-non-binding-proposal-from-elon-musk-301525749.html\">issued a press release</a> confirming the offer, saying, “the Twitter Board of Directors will carefully review the proposal to determine the course of action that it believes is in the best interest of the Company and all Twitter stockholders.”</p><p id=\"RrnxfG\">Musk’s wealth hovers around $260 billion, <a href=\"https://www.bloomberg.com/news/articles/2022-04-14/elon-musk-launches-43-billion-hostile-takeover-of-twitter?cmpid%3D=socialflow-twitter-tech&amp;cmpid=socialflow-twitter-business&amp;utm_campaign=socialflow-organic&amp;utm_content=tech&amp;utm_medium=social&amp;utm_source=twitter\">according to Bloomberg</a>. Twitter’s market valuation is about $37 billion. Musk’s offer values Twitter at about $43 billion, according to <a href=\"https://www.cnbc.com/2022/04/14/elon-musk-offers-to-buy-twitter-for-54point20-a-share-saying-it-needs-to-be-transformed-as-private-company.html\"><em>CNBC</em></a>.</p><p id=\"SmO6o7\">Twitter shares are up over 13 percent pre-market on the news. Tesla shares are down 1.5 percent on fears that Twitter’s number one fan — who already leads Tesla, SpaceX, The Boring Company, and Neuralink — might become distracted by his new pet. Musk once told Twitter co-founder and ex-CEO Jack Dorsey that <a href=\"https://www.theverge.com/2015/10/6/9467685/elon-musk-jack-dorsey-ceos-two-companies\">it’s a bad idea</a> to run two companies simultaneously.</p><div class=\"c-float-right\"><aside id=\"2xFMUi\"><q>“There will be distractions ahead”</q></aside></div><p id=\"EAviZv\">The <a href=\"https://www.theverge.com/2022/4/11/23019836/elon-musk-twitter-board-of-directors-news-updates\">will he / won’t he buy Twitter saga</a> began in earnest when it became clear, just ten day ago, that the world’s richest man purchased a 9.2 percent stake in the company. Soon after Twitter announced that Musk would be appointed to its board, only for that to fall through just a few days ago, prompting Twitter CEO Parag Agrawal to tell staff, “there will be distractions ahead.” </p><p id=\"6jDmgc\">A hostile takeover will certainly be distracting for everyone involved. </p><p id=\"Rzd8cC\">Below is the full text of the letter sent by Musk to Twitter, per the SEC filing:</p><blockquote><p id=\"zOpgkD\">Bret Taylor</p><p id=\"BiPqvR\">Chairman of the Board,</p><p id=\"skNqbn\"> I invested in Twitter as I believe in its potential to be the platform for free speech around the globe, and I believe free speech is a societal imperative for a functioning democracy. </p><p id=\"Ws7CBx\"> However, since making my investment I now realize the company will neither thrive nor serve this societal imperative in its current form. Twitter needs to be transformed as a private company.</p><p id=\"Ej2vp1\">As a result, I am offering to buy 100% of Twitter for $54.20 per share in cash, a 54% premium over the day before I began investing in Twitter and a 38% premium over the day before my investment was publicly announced. My offer is my best and final offer and if it is not accepted, I would need to reconsider my position as a shareholder.</p><p id=\"VRoud0\"> Twitter has extraordinary potential. I will unlock it.</p><p id=\"RGZMX0\">Elon Musk</p></blockquote><p id=\"CTiO1d\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wew4DJfYl_UN9rKK-WYLOQ-1ep8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23389144/VRG_Illo_STK022_K_Radtke_Musk_Twitter_Upside_Down.jpg",
  "description": "Twitter needs to go private for the changes needed",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}