{
  "title": "Elon Musk cites Eminem song in latest volley with the SEC",
  "url": "https://www.theverge.com/2022/3/29/23001516/elon-musk-eminem-tesla-sec-tweets",
  "date": "2022-03-29T17:28:28.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Elon Musk\" src=\"https://cdn.vox-cdn.com/thumbor/9Unv0QPrpy9Cm9oF2EE7GUlKZeM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70685788/REC_ASA_CODE2016-20160601-220020-4523.0.0.jpeg\" />        <figcaption>Elon Musk  | Photo by Asa Mathat</figcaption>    </figure>  <p id=\"wHq4Aw\">The latest court filing in Elon Musk’s battle to wrest back control of his Twitter account from the Securities and Exchange Commission (SEC) includes a citation of the 2002 song <em>Without Me</em> by rapper Eminem. Yes, really (see the filing embedded below). </p><p id=\"gS9uky\">In the song, the rapper complains that “The FCC won’t let me be or let me be me so let me see/ They tried to shut me down.” That’s a reference to a 2002 penalty the Federal Communications Commission handed out to a Colorado radio station for playing Eminem’s 2000 song <em>The Real Slim Shady </em>(after clutching its collective pearls for a bit, the <a href=\"https://www.wired.com/2002/01/fcc-reversal-eminem-not-obscene/\">FCC ultimately decided</a> not to fine the radio station). </p><p id=\"Jkpncu\">In the Tuesday court filing, Musk’s lawyers just substituted “SEC” for “FCC” to make the comparison, noting that “the First Amendment requires that agencies proceed with caution when constitutional rights are at stake, not seek to pursue any and all novel theories that broaden their authority at the cost of individual freedom.” </p><p id=\"36aL3Z\">The <a href=\"https://www.theverge.com/2022/2/17/22938823/elon-musk-sec-investigation-free-speech-tesla\">Tesla CEO wants a judge to rescind a 2018 consent decree</a> with the SEC that requires his tweets to be reviewed by an attorney before posting to Twitter, alleging the agency is trying to “chill” his free speech as part of an “unrelenting investigation” of him and Tesla. <a href=\"https://www.theverge.com/2022/3/8/22967122/elon-musk-tesla-sec-tweet-court-subpoena-investigation\">Musk has said he felt pressured</a> to settle with the SEC because the agency’s action “stood to jeopardize the company’s financing.” The SEC fined Musk and Tesla $20 million each, but Musk argued that the agency has not yet distributed the fine money to Tesla shareholders as the agreement required. </p><p id=\"KLh0pS\">The SEC said it expected a plan to distribute the funds to receive court <a href=\"https://www.theverge.com/2022/2/19/22942017/elon-musk-tesla-sec-claims-unrelenting-investigation-countered\">approval by the end of March</a>. </p><p id=\"BrtvBp\">The consent decree came about after <a href=\"https://twitter.com/elonmusk/status/1026872652290379776\">Musk tweeted</a> in August 2018 that he had funding to take Tesla private at $420 per share. Musk is also seeking to quash an SEC subpoena seeking details about whether he and Tesla are in compliance with the 2018 decree’s disclosure requirements. <a href=\"https://www.theverge.com/2022/2/7/22921648/tesla-sec-elon-musk-subpoena-tweet-poll-shares\">The agency is investigating another Musk tweet</a> from November 2021, where the CEO <a href=\"https://www.theverge.com/2021/11/7/22768364/elon-musk-poll-twitter-tesla-10-percent-billionaires-capital-gains-tax\">polled his Twitter followers</a> to ask if he should sell 10 percent of his Tesla stake. </p><p id=\"SOAYtv\">The SEC didn’t immediately reply to a request for comment Tuesday. </p><div id=\"0w3Iuz\"><iframe src=\"https://embed.documentcloud.org/documents/21562401-03292022-musk-reply-filed/?embed=1&amp;responsive=1&amp;title=1\" title=\"03.29.2022 Musk Reply Filed (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/R1kQL9WfQDSC9A3oQ7J-HkED4c0=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6582071/REC_ASA_CODE2016-20160601-220020-4523.0.JPG",
  "description": "The Tesla CEO says his free speech is being suppressed.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}