{
  "title": "Elon Musk’s brain implant startup Neuralink denies that researchers abused monkeys",
  "url": "https://www.theverge.com/2022/2/15/22934856/neuralink-elon-musk-brain-computer-interface-denies-monkey-lab-animal-abuse-complaint-uc-davis",
  "date": "2022-02-15T17:34:35.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"A monkey in Neuralink’s in-house facility.\" src=\"https://cdn.vox-cdn.com/thumbor/KxwDxc4Gcg8yDKF79iNXQCpr_LI=/0x636:1170x1416/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70511933/blog_post_3_animal_welfare_buzz_foraging.0.jpg\" />        <figcaption>A monkey in Neuralink’s in-house facility. | Neuralink</figcaption>    </figure>  <p id=\"9VA7lX\">Elon Musk’s company Neuralink has denied claims that university researchers abused monkeys in experiments backed by the brain-computer interface startup. <a href=\"https://neuralink.com/blog/animal-welfare/\">In a statement posted online</a>, Neuralink responded to <a href=\"https://www.dropbox.com/s/kbwap1dj4e51mfe/2022-02-10%20PCRM%20USDA%20Complaint%20Re%20UC%20Davis%20and%20Neuralink%20%28with%20exhibits%29.pdf?dl=0\">a federal complaint</a> from the nonprofit Physicians Committee for Responsible Medicine (PCRM), <a href=\"https://www.pcrm.org/news/news-releases/physicians-group-files-state-lawsuit-and-federal-complaint-against-uc-davis\">which alleged that Neuralink</a> and its partners at the University of California, Davis conducted inhumane tests on animals.</p><p id=\"tPlYoI\">A PCRM statement said that monkeys at UC Davis “had their brains mutilated in shoddy experiments and were left to suffer and die.” Neuralink, by contrast, says that the lab “did and continue to meet federally mandated standards,” although it has since moved the animals to an in-house facility.</p><p id=\"0aq3jP\">The PCRM complaint, filed with the US Department of Agriculture (USDA) against UC Davis last week, is based on documents released after a public records lawsuit. The documents outline a partnership that provided the university with around $1.4 million and ran between 2017 and 2020. The researchers tested an implant “approximately the size of a quarter coin” that was anchored to the skull of macaque monkey test subjects. </p><p id=\"bCG0Qr\">The nonprofit — which opposes the use of animals in medical experiments — says that the team “failed to provide dying monkeys with adequate veterinary care, used an unapproved substance known as ‘BioGlue’ that killed monkeys by destroying portions of their brains, and failed to provide for the psychological well-being of monkeys assigned to the experiment.”</p><div class=\"c-float-right\"><aside id=\"XeA9gs\"><q>The complaint claims monkeys were “left to suffer and die”</q></aside></div><p id=\"SopomY\"><a href=\"https://twitter.com/neuralink/status/1493139001955405827?s=21\">A tweet from Neuralink</a> calls that description “misleading” and lacking context. It says that several animals with a “wide range of pre-existing conditions unrelated to our research” were euthanized so that researchers could practice the implant surgery on cadavers, and six more were euthanized because of infections related to the implant or a complication involving BioGlue, a <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4557450/\">widely used surgical adhesive</a>. (An internal email references necropsy reports for 23 animals in total, plus 10 living test subjects that were either shipped to Neuralink or removed from the project.) </p><p id=\"MGHgcx\">“All animal work done at UC Davis was approved by their Institutional Animal Care and Use Committee (IACUC) as mandated by federal law, and all medical and post-surgical support, including endpoint decisions, were overseen by their dedicated and skilled veterinary staff,” Neuralink says.</p><p id=\"enOv8c\">Neuralink called itself “absolutely committed to working with animals in the most humane and ethical way possible.” The company also said it moved its test animals to its own facility in 2020 to improve their standard of living beyond a federally mandated minimum, working with United States Department of Agriculture (USDA) inspectors and receiving accreditation from the Association for the Assessment and Accreditation of Laboratory Animal Care (AAALAC) International.</p><div class=\"c-float-right\"><aside id=\"3Jjy5U\"><q>Neuralink moved animals to an in-house facility in 2020</q></aside></div><p id=\"oCdg6c\">The blog post suggests that with sufficient options in an enclosed environment, animals could have “freedom of choice the same as they would have in their natural world” and choose to participate in trials the way a human volunteer would. “Some people want to contribute to medical research for various reasons. Some do not. Why can this not be the same for animals?” it asks. (It’s not clear how a monkey would offer informed consent for something like brain surgery.)</p><p id=\"1CfPZa\">Neuralink’s brain-computer interface (or BCI) implant is designed to let monkeys — and theoretically human subjects — control electronic systems with neural activity. While Musk has <a href=\"https://www.theverge.com/2019/7/16/20697123/elon-musk-neuralink-brain-reading-thread-robot\">floated far-future possibilities</a> of mass-market implants, Neuralink is currently following in the footsteps of other research teams that have tested BCI’s potential to let people with paralysis type words or manipulate robotic arms. The company demonstrated an early iteration of its research last year when it <a href=\"https://www.theverge.com/2021/4/8/22374749/elon-musk-neuralink-monkey-pong-brain-interface\">released video of a monkey</a> appearing to play <em>Pong </em>via its implant.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WE8XKKa689ilHjho1-2BYOLaF78=/0x720:1170x1333/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23243757/blog_post_3_animal_welfare_buzz_foraging.jpg",
  "description": "A nonprofit accused it of inhumane tests at UC Davis.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}