{
  "title": "Elon Musk, Twitter’s largest shareholder, polls followers for an edit button",
  "url": "https://www.theverge.com/2022/4/5/23011134/twitter-elon-musk-edit-button",
  "date": "2022-04-05T08:40:17.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"Tesla Officially Opens Gruenheide Gigafactory\" src=\"https://cdn.vox-cdn.com/thumbor/d9XVTtfIpDH_qj86ZXHC-KGH1YA=/0x0:4233x2822/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70711106/1387431806.0.jpg\" />        <figcaption><em>Elon Musk at Tesla’s recent factory opening in Germany.</em> | Photo by Christian Marquardt - Pool/Getty Images</figcaption>    </figure>  <p id=\"zaUGej\">Elon Musk has wasted no time making his Twitter feature priorities clear after <a href=\"https://www.theverge.com/2022/4/4/23009622/elon-musk-twitter-shares-free-speech\">becoming its biggest shareholder yesterday</a>. The Tesla CEO has <a href=\"https://twitter.com/elonmusk/status/1511143607385874434\">polled his 80 million followers</a> about whether they’d like to be able to edit their tweets after posting them. Twitter’s new CEO Parag Agrawal subsequently <a href=\"https://twitter.com/paraga/status/1511152454418644995\">quote-tweeted Musk’s poll</a> to say that “The consequences of this poll will be important. Please vote carefully.” The phrasing <a href=\"https://twitter.com/elonmusk/status/1507272763597373461\">mirrors a similar tweet from Musk</a> about free speech on March 25th, days after he acquired almost 10 percent of the company.</p><p id=\"K44QIw\">The so-called “edit button” has been one of the most commonly requested features of the social media platform. In an ideal world it would simply allow users to clean up typos after publishing their tweets, but critics claim the feature could be ripe for abuse, allowing users to substantially change the meaning of tweets after they’ve been shared across the platform. Twitter’s former CEO Jack Dorsey said that the company would “<a href=\"https://www.theverge.com/2020/1/15/21066815/twitter-edit-button-jack-dorsey-says-no\">probably never</a>” add an edit button in an interview in early 2020.</p><div id=\"YNU6Rq\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The consequences of this poll will be important. Please vote carefully. <a href=\"https://t.co/UDJIvznALB\">https://t.co/UDJIvznALB</a></p>— Parag Agrawal (@paraga) <a href=\"https://twitter.com/paraga/status/1511152454418644995?ref_src=twsrc%5Etfw\">April 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"ZD4vYh\">Responding to his poll, Twitter user “<a href=\"https://twitter.com/Erdayastronaut/status/1511201517432360965\">Everyday Astronaut</a>” suggested that the edit button only be available for a short time after first tweeting, and that edited tweets contain a link showing the edit made. In response Musk said, “<a href=\"https://twitter.com/elonmusk/status/1511216790218895361\">that sounds reasonable</a>.” Many other social media platforms already allow users to edit their posts, but as my colleague Casey Newton argued, <a href=\"https://www.theverge.com/2017/4/13/15278800/edit-tweets-twitter-hysteria-nihilism\">none have seen this feature widely abused</a>. Meta CTO Andrew Bosworth said Facebook had “<a href=\"https://twitter.com/boztank/status/1511171084560723969\">solved</a>” the edit button problem in response to Musk’s poll.</p><p id=\"qxFSS0\">The poll comes days after Twitter’s official account said “<a href=\"https://twitter.com/Twitter/status/1509951255388504066\">we are working on an edit button</a>,” but it made the statement on April Fool’s day (the most untrustworthy day of the year). However this week Twitter <a href=\"https://twitter.com/michaelsayman/status/1511119596820078603\">product lead Michael Sayman quote tweeted</a> this apparent gag, and called it the company’s “official statement” on the feature. </p><p id=\"ZeqWNY\">Musk is technically a passive shareholder of Twitter. He disclosed his investment in a Schedule 13G filing, which is normally reserved for stakes that have <em>not </em>been acquired “with any purpose, or with the effect, of changing or influencing the control of the issuer,” according to <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-04/elon-musk-bought-some-twitter\"><em>Bloomberg’s </em>Matt Levine</a>. But the <a href=\"https://www.wsj.com/articles/elon-musks-twitter-investment-raises-new-regulatory-red-flag-11649114327\"><em>Wall Street Journal</em> reports</a> that Musk’s filing didn’t include the standard certification saying he doesn’t intend to influence the company, and that the Tesla CEO simply wrote “Not Applicable” instead.</p><p id=\"vagapQ\">Musk’s tweets do not instruct Twitter to add an edit button, but his poll (which as of this writing is 73.7 percent in favor with over 2 million votes tallied) sends a pretty strong signal to Twitter about whether one should be added. “If the people vote overwhelmingly for something, it is at least *a* data point!” Musk <a href=\"https://twitter.com/elonmusk/status/1511192616662093830\">wrote in a follow-up tweet</a>, before calling crypto bots the “<a href=\"https://twitter.com/elonmusk/status/1511230314902953984\">single most annoying problem</a>” on the platform. </p><p id=\"lPX1EV\">Whatever Musk’s  intentions, Twitter’s CEO is clearly paying attention. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lxJZ1EVGeCftGcxkKHRuh6UVj5c=/0x32:4233x2248/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23368246/1387431806.jpg",
  "description": "Tweets, but editable.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}