{
  "title": "Elon Musk buys Twitter: all the news you need on one of the biggest tech deals of all time",
  "url": "https://www.theverge.com/23026874/elon-musk-twitter-buyout-news-updates",
  "date": "2022-04-29T16:48:25.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mtuKlOOwG592RboCWu9b1cewbb4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70756554/mdoying_180117_2249_twitter_0242stills.0.jpg\" />        <figcaption>Photo by Michele Doying / The Verge</figcaption>    </figure>  <p>Stay up to date with the latest in the Musk-Twitter saga</p> <p class=\"p--has-dropcap p-large-text\" id=\"oDf05i\">On Thursday, April 14th, Elon Musk announced an offer to buy Twitter for $54.20 a share. On April 25th, Twitter accepted the deal. </p><p id=\"3kC7d6\">This is a huge story with a lot of fast-moving parts to it. It’s also a story that will likely stretch out over the next few months, maybe even longer. So we thought we’d put together a guide for you, our readers, that can be updated as things continue to unfold. Because, <a href=\"https://twitter.com/elonmusk/status/1514720245113577473\">like Elon</a>, we ❤️ you.</p><p id=\"Kd54hh\">So strap in — it’s going to be a bumpy ride. </p><p id=\"1WsVWM\"><strong>The latest news:</strong></p><h2 id=\"yecpLE\"><a href=\"https://www.theverge.com/2022/4/29/23048615/elon-musk-tesla-stock-sells-twitter-takeover\">Musk sells $8.4 billion worth of Tesla shares to fund deal</a></h2><p id=\"hqa1bS\">According to SEC filings, Musk sold about 9.6 million shares in Tesla, worth around $8.4 billion, as he seeks to line up the financing for his takeover bid of Twitter. Tesla’s share price fell about 12 percent earlier in the week, but has since edged up about 3.5 percent. </p><h2 id=\"B3pwjt\"><a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\">Elon Musk buys Twitter for $44 billion</a></h2><p id=\"AB77IU\">Well, that was fast. </p><p id=\"H3WZ73\">On April 25th, Twitter’s board of directors accepted Musk’s offer of $54.20 per share, or $44 billion, for total control of the company. It was the same price he named in his initial offer on April 14th. Upon completion of the transaction, Twitter will become a private company. </p><hr class=\"p-entry-hr\" id=\"PZgaMF\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CvgY_LEtfShoyFLDoHUWQdQe1DM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390586/VRG_Illo_STK022_K_Radtke_Musk_Stock_Fire_Thumbs_Up.jpg\">      <cite>Illustration by Kristen Radtke / The Verge; Getty Images</cite>  </figure></div><p id=\"qckX6a\"><strong>The story so far:</strong></p><h2 id=\"oH4vLP\"><a href=\"https://www.theverge.com/23020401/elon-musk-twitter-board-takeover-agrawal-invest\">How did the Musk-Twitter saga begin?</a></h2><p id=\"NNPQPq\">A thousand years ago, on April 4th, 2022, Elon Musk announced that he had <a href=\"https://www.theverge.com/2022/4/4/23009622/elon-musk-twitter-shares-free-speech\">purchased 9.1 percent of Twitter</a>. The news that the world’s richest man was now (briefly) the largest shareholder in his preferred social media platform sent the stock price soaring and many a keyboard a-typing. </p><p id=\"amN10A\">Musk immediately set about soliciting suggestions about ways to improve Twitter by — what else — <a href=\"https://www.theverge.com/2022/4/5/23011134/twitter-elon-musk-edit-button\">tweeting a poll</a>. The company responded by <a href=\"https://www.theverge.com/2022/4/5/23011256/elon-musk-twitter-board-of-directors-ownership\">offering him a board seat</a>, a move that would have restricted him to <a href=\"https://www.theverge.com/2022/4/5/23011558/twitter-elon-musk-board-members-special-exceptions-moderation-rules\">owning just 15 percent of the company</a>. At first, he said yes. Then he changed his mind and <a href=\"https://www.theverge.com/2022/4/10/23019802/elon-musk-not-joining-twitter-board-announced\">said no</a>. Meanwhile, our resident Twitter and Musk experts, <a href=\"https://www.theverge.com/2022/4/6/23012831/twitter-elon-musk-parag-agrawal-ceo-board-seat-what-next\">Casey Newton</a> and <a href=\"https://www.theverge.com/2022/4/5/23011810/elon-musk-twitter-sec-board-member-moderation\">Liz Lopatto</a>, respectively, dug deeper into why Musk was flirting with Twitter and what the likely outcomes would be.</p><h2 id=\"jis9Sa\"><a href=\"https://www.theverge.com/2022/4/11/23020118/elon-musk-twitter-schedule-13d-social-media-board-of-directors-sec\">The SEC filings were the first hint that Musk may try to go big</a></h2><p id=\"xCxgit\">After declining a seat on Twitter’s board, Musk updated his filing with the Securities and Exchange Commission to indicate that he would not be a passive player in the company’s affairs. Gone was the language that he would restrict his holdings to just 14.0 percent of the company. In retrospect, this was the first clue that he may attempt something more impactful than just buying some stock of serving as a board member. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RHuy0pzwWUlfxL05m1Tfq-KroO8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382328/VRG_Illo_STK022_K_Radtke_Musk_Twitter_Shrug.jpg\">      <cite>Illustration by Kristen Radtke / The Verge; Getty Images</cite>  </figure></div><h2 id=\"8Y6aO7\"><a href=\"https://www.theverge.com/2022/4/12/23021248/elon-musk-twitter-troll-board-seat-fiduciary-vs-fun\">Musk’s offer to buy Twitter didn’t seem likely at first</a></h2><p id=\"WG7SBQ\"><em>Platformer’s </em>Casey Newton isn’t the only one who didn’t believe Musk would launch a hostile takeover of Twitter. After news broke that Musk had acquired 9.1 percent of the company’s shares, many people briefly entertained the notion that Musk might try to buy the whole company, only to eventually conclude he had already gotten everything he wanted out of Twitter. </p><p id=\"EmvUsH\">Casey was right in positing that Twitter’s poison pill provisions may not be enough to stop Musk. But he also assumed that Musk would just continue to troll the company through his tweets — which certainly still is a likely outcome. </p><h2 id=\"H9f80r\"><a href=\"https://www.theverge.com/2022/4/14/23024905/elon-musk-offers-to-buy-twitter\">Musk says his offer to buy Twitter is his “best and final”</a></h2><p id=\"EY5jGZ\">Anyone who’s been in the market to buy a house knows about “best and final” offers. In his opening salvo, Musk claims his bid to buy Twitter is exactly that. Whether that bolsters his position or ends up painting him into a corner is too early to say. But it is clear that he is offering Twitter’s shareholders a pretty fair premium: $43 billion for a company with a $37 billion market cap. </p><p id=\"FHP4EN\">Musk says that Twitter must go private in order to undergo the changes that need to be made. These include an edit feature, an open-source algorithm, less moderation, and a higher bar for removing offending tweets. </p><h2 id=\"TaG2pt\"><a href=\"https://www.theverge.com/2022/4/14/23025343/elon-musk-twitter-takeover-ted-talk-quote-stock-buyout\">Musk isn’t trying to buy Twitter to make money, in case you were wondering</a></h2><p id=\"Nyvf2M\">Musk is a very rich guy. So, naturally, he would say that he isn’t interested in buying Twitter to make money. He views Twitter as the “de facto town square” and wants to open source the social media company’s algorithm. He’s trying to frame the whole takeover bid as some sort of crusade to protect free speech. </p><p id=\"dnoDBx\">But even a free speech maximalist like Musk needs to convince shareholders that his buyout offer is in their financial self-interest. Otherwise, what are we really doing here?</p><h2 id=\"Mhbtxr\"><a href=\"https://www.theverge.com/2022/4/14/23025396/elon-musk-jack-dorsey-twitter-hostile-takeover\">Is Musk serious about buying Twitter, or is he just trolling?</a></h2><p id=\"vdeHwN\">Musk is a prolific Twitter user. He’s also a troll, and Liz Lopatto lays out what exactly he will need to do in order to get people to take him more seriously. Musk has a tendency to shoot from the hip, but several corporate governance experts told us they doubt he actually thought this whole thing out.</p><div class=\"c-float-left c-float-hang\"><aside id=\"sBKGn7\"><q>The financing to actually make the purchase hasn’t been lined up</q></aside></div><p id=\"bSVJ2I\">He hasn’t lined up the financing to buy Twitter and take it private. He is working with Morgan Stanley, but it’s anyone’s guess whether he’s actually listening to them. Musk himself said he may not win in the end. If he succeeds in pressuring Twitter to make the changes he wants, he may just retract his bid. All things are possible.</p><h2 id=\"yDZn6r\"><a href=\"https://www.theverge.com/2022/4/14/23025537/twitter-board-shareholders-elon-musk-hostile-takeover-poison-pill\">Twitter’s board views Musk’s offer as unwelcome</a></h2><p id=\"3sqAgT\">Behind the scenes, Twitter’s board members are plotting their response to the world’s richest man’s takeover scheme. There’s the poison pill, as well as previous provisions in the company’s bylaws, that could make it extremely difficult for Musk to assume control.  </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"TOPSHOT-US-AUTOMOBILE-INDUSTRY-TESLA-ECONOMY\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LUfQS66deCYEBdgzBGuQyfoomEY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23392905/1239824980.jpg\">      <cite>Photo by SUZANNE CORDEIRO/AFP via Getty Images</cite>  </figure></div><h2 id=\"3MFbgN\"><a href=\"https://www.theverge.com/2022/4/14/23025903/twitter-ceo-board-elon-musk-takeover-still-evaluating\">Twitter employees are told to strap in for a long ride</a></h2><p id=\"Ng90XR\">Twitter’s first all-hands meeting after Musk’s bid went public was a weird one. After serenading employees with Backstreet Boys and Aretha Franklin, the company said it would continue to evaluate the offer. </p><p id=\"tnh4bV\">Employees told Alex Heath they were frustrated by the lack of a more detailed response. They’re concerned about the future of the social media platform, as well as the possibility of layoffs. </p><h2 id=\"zsJlBy\"><a href=\"https://www.theverge.com/2022/4/15/23025120/elon-musk-twitter-free-speech-government-censorship\">Musk’s understanding of “free speech” is shaky at best</a></h2><p id=\"FcV1Kl\">Hours after announcing his bid to buy Twitter, Musk was on stage in Vancouver for a well-timed interview with TED Talk founder Chris Anderson. During the conversation, Musk spoke about his “obsession with the truth” and echoed comments he made in his SEC filing about wanting to protect free speech and democracy.</p><div class=\"c-float-right c-float-hang\"><aside id=\"5T19uv\"><q>Musk may be in for a rude awakening if he is able to buy Twitter</q></aside></div><p id=\"2A7H01\">But as Adi Robertson points out, his understanding of free speech appears to be nebulous at best. After examining Musk’s comments, as well as previous efforts by Twitter’s leadership to contend with speech laws around the world, she concludes that Musk may be in for a rude awakening if he succeeds in buying the social media platform. </p><div class=\"c-float-right\"><aside id=\"hKYE2E\"><q>You can not understate what a rollercoaster ride this has been so far</q></aside></div><p id=\"GUWzTe\">You can not understate what a rollercoaster ride this has been so far. He buys stock! He’s joining the board! No, wait, he’s not joining the board! He could buy more stock! No, wait, he wants to buy <a href=\"https://www.worldwidewords.org/qa/qa-mag1.htm\">the whole megillah</a>! This thing has more twists than a Shyamalan movie. And we’re not even halfway through. </p><h2 id=\"Z5LsKZ\"><a href=\"https://www.theverge.com/2022/4/15/23024978/elon-musk-twitter-buyout-offer-ownership-deal-finance\">Twitter’s board adopts “poison pill” to thwart Musk’s takeover bid</a></h2><p id=\"DqManv\">The day after Musk announced his proposal to buy Twitter, the company’s board responded with a poison pill. This is basically the board’s way of saying, “Thanks, but no thanks.” </p><p id=\"GfaGSJ\">The poison pill consists of a new “shareholder’s rights plan” to give certain shareholders the right to purchase more stock if Musk or another buyer attempts to seize control. And it signals that Twitter’s board intends to fight Musk’s bid to take sole ownership of the company.</p><h2 id=\"aWiTJP\"><a href=\"https://www.theverge.com/2022/4/21/23033445/elon-musk-twitter-bank-debt-commitment-letter\">Musk lays out financing for Twitter takeover</a></h2><p id=\"kNkNC5\">In a new filing with the Securities and Exchange Commission, Musk laid out his plan for the $46.5 billion worth of loans that will allow him to finance the buyout offer made <a href=\"https://www.theverge.com/2022/4/14/23024905/elon-musk-offers-to-buy-twitter\">on April 14th</a>. The funding will be provided through two debt commitment letters from Morgan Stanley Senior Funding, in which the bank promises a series of loans worth $25.5 billion. The remaining $21 billion will be covered by Musk himself.</p><p id=\"9mXtjd\">Notably, the filing does not list any equity partners to share the cash burden with Musk. The Tesla CEO already owns a 9 percent stake in Twitter, valued at roughly $2.9 billion.</p><h2 id=\"EXr1oR\"><a href=\"https://www.theverge.com/2022/4/22/23036479/elon-musk-twitter-bid-private-equity\">Musk finds the money to buy Twitter — now what?</a></h2><p id=\"teIT6J\">Our resident Musk whisperer Elizabeth Lopatto breaks down the details found in the billionaire’s latest filing with the Securities and Exchange Commission, and concludes that they give his proposal a lot more weight. She also explores why he hasn’t been able to line up any other investors, and whether Twitter will be able to find its own buyer in order to scare off Musk. </p><p id=\"xAqTec\">Lastly, she games out what happens if Musk succeeds, namely a lot of Twitter employees quit and Musk makes a lot of changes, and maybe even reinstates Donald Trump to the platform. Good times!</p><h2 id=\"UL0Wy7\"><a href=\"https://www.cnbc.com/2022/04/22/republicans-demand-twitter-board-save-records-on-musks-bid.html\">House Republicans demand Twitter preserve records</a></h2><p id=\"q67lbY\">Republicans are in a tizzy about Twitter’s attempts to thwart Musk’s tender offer. <em>CNBC </em>reports that House GOP members, lead by Rep. Jim Jordan (R-Ohio), are calling on the board to preserve all records of the transaction, potentially setting the ground for a future hearing if the party takes control of the House after the midterm elections. </p><p id=\"4iVikJ\">If you’ll recall, Twitter is a favorite punching bag of conservatives who claims — largely without evidence — of censorship by the social media company. </p><h2 id=\"sqsFnF\"><a href=\"https://www.bloomberg.com/news/articles/2022-04-25/twitter-on-track-to-reach-deal-with-musk-as-soon-as-monday\">Twitter on Track to Reach Deal With Musk as Soon as Monday</a></h2><p id=\"nG0WK5\">The will-he / won’t-he-buy-Twitter saga is nearing completion with a deal to be announced as soon as Monday. Twitter is in the final stretch of negotiations with Musk, reports <em>Bloomberg</em>. Multiple outlets are reporting that Twitter’s board was considering Musk’s funded offer over the weekend, with <a href=\"https://www.nytimes.com/2022/04/24/technology/twitter-board-elon-musk.html\"><em>The New York Times</em></a> saying the company’s 11 members were negotiating with Musk into the morning on Monday. Twitter is scheduled to report earnings on Thursday, by which time the company is expected to have weighed in on Musk’s bid, reports <a href=\"https://www.wsj.com/articles/twitter-re-examines-elon-musks-bid-may-be-more-receptive-to-a-deal-11650822932?mod=breakingnews\"><em>The Wall Street Journal</em></a>.</p><p id=\"k2c071\"></p><h2 id=\"S0maba\"></h2><p id=\"7TcvBp\"></p><h2 id=\"lk5EJP\"></h2><p id=\"TeLmfb\"></p><h2 id=\"2Uy8tw\"></h2>",
  "image": "https://cdn.vox-cdn.com/thumbor/dqmugsEIVf6X5Jx1N2_KQ7eCYsY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10456887/mdoying_180117_2249_twitter_0242stills.jpg",
  "description": "Our recap on all the latest in the Elon Musk-Twitter saga",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}