{
  "title": "Elon Musk says he’s ‘very much on the same page’ as the EU on social media laws",
  "url": "https://www.theverge.com/2022/5/10/23065270/elon-musk-twitter-digital-services-act-dsa-european-union-eu-speech-laws-thierry-breton",
  "date": "2022-05-10T17:37:13.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QvLtQQyFHkqsol0yvx5uJNbzvkQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70853184/VRG_Illo_STK022_K_Radtke_Musk_Stock_Smirk.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"p27jDA\">Tesla billionaire and future Twitter owner Elon Musk says he’s “very much on the same page” as the European Union about the Digital Services Act, a package of web platform regulations. Musk <a href=\"https://twitter.com/ThierryBreton/status/1523773895974612992\">appeared in a short video</a> alongside EU Commissioner Thierry Breton to confirm his support for the DSA, which — among other things — requires large platforms to police illegal content and assess the risk of harm their services pose, including from disinformation.</p><p id=\"eX32Do\">“I think it’s exactly aligned” with the future goals for the Twitter platform, Musk said in a short video posted by Breton. “It’s been a great discussion, and I really think I agree with everything you said, really. I think we’re very much of the same mind, and I think anything that my companies can do that would be beneficial to Europe, we want to do that.” Musk followed up with <a href=\"https://twitter.com/elonmusk/status/1523798885205876736\">a tweeted reply</a> to the video. “Great meeting! We are very much on the same page,” he said.</p><div id=\"6ldmvD\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today <a href=\"https://twitter.com/elonmusk?ref_src=twsrc%5Etfw\">@elonmusk</a> and I wanted to share a quick message with you on platform regulation   <a href=\"https://twitter.com/hashtag/DSA?src=hash&amp;ref_src=twsrc%5Etfw\">#DSA</a> <a href=\"https://t.co/nvP5FEXECY\">pic.twitter.com/nvP5FEXECY</a></p>— Thierry Breton (@ThierryBreton) <a href=\"https://twitter.com/ThierryBreton/status/1523773895974612992?ref_src=twsrc%5Etfw\">May 9, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"1M7Z1V\">The video reinforces past statements that Twitter moderation should “match the laws” of a country in which it’s operating, and Musk’s priorities have some clear similarities with the DSA. Both are highly concerned with transparency, for instance: Musk has suggested making Twitter’s recommendation algorithms “open source,” while the DSA would require large platforms to <a href=\"https://www.theverge.com/2022/4/23/23036976/eu-digital-services-act-finalized-algorithms-targeted-advertising\">explain their algorithms</a> to the EU. Similarly, the DSA asks platforms to assess the risk of harm that bots and fake accounts pose, while Musk has pledged to “authenticate all humans” on Twitter despite concerns from <a href=\"https://restofworld.org/2022/where-anonymity-on-twitter-is-a-matter-of-life-or-death/\">some users who operate anonymously</a> for safety reasons. And while it’s not mentioned in this video, the separate Digital Markets Act (DMA) strikes at practices like Apple attaching a 30 percent charge to App Store purchases, <a href=\"https://www.theverge.com/2021/7/30/22602231/elon-musk-apple-app-store-fees-de-facto-global-tax-internet-tim-sweeney-epic-games\">something Musk has dubbed</a> a “de facto global tax on the internet.”</p><div class=\"c-float-right\"><aside id=\"4HpWuG\"><q>The DSA’s rules could have global implications, even if they only apply in Europe</q></aside></div><p id=\"a64NUf\">But the EU will also require companies to identify and mitigate possible social risks that are posed by their platforms, potentially from legal as well as illegal content. It asks companies to work with the EU on fighting disinformation and promoting democracy, encouraging the use of “crisis protocols” that could limit the flow of inaccurate information during pandemics, earthquakes, or other natural disasters. That could require stricter moderation of users’ speech in a way that the First Amendment in the United States would not allow the government to mandate. Meanwhile, Musk’s other businesses, like Tesla, rely heavily on markets like Germany, so Twitter can’t simply ignore these regulations.</p><p id=\"YtFj10\">Musk has defined “free speech” as speech that fits the laws of a given country, regardless of what those laws permit. “If people want less free speech, they will ask government to pass laws to that effect,” <a href=\"https://twitter.com/elonmusk/status/1519036983137509376?ref_src=twsrc%5Etfw%22\">he tweeted</a> in late April. But that poses challenges on a global platform like Twitter. While the DSA only applies to users in Europe, its policies could be difficult to square with Musk’s commitment to speech maximalism in the US since moderation in one country can affect the content that people across the world see. And as Musk’s reference to his many companies suggests, he’s got a lot to lose by angering the EU if those goals conflict.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kIveMaeB5PkCFTyGqPPSWBGYHIM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390588/VRG_Illo_STK022_K_Radtke_Musk_Stock_Smirk.jpg",
  "description": "Musk confirmed his support for the Digital Services Act.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}