{
  "title": "Elon Musk says Twitter deal ‘temporarily on hold’",
  "url": "https://www.theverge.com/2022/5/13/23070306/elon-musk-twitter-deal-on-hold-spam-inauthentic-accounts",
  "date": "2022-05-13T09:57:37.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5eKdIa0Kfp8EbOGd2fHO14vKxgo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70864324/VRG_Illo_STK022_K_Radtke_Musk_Down_Arrow_Blue.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"TEcPHE\">Elon Musk says his deal to buy Twitter is “temporarily on hold” after the social network reported that false or spam accounts comprised less than 5 percent of its 226 million monetizable daily active users. The Tesla CEO, who offered to buy twitter <a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\">for $44 billion</a>, tweeted a link to a May 2nd <a href=\"https://www.reuters.com/technology/twitter-estimates-spam-fake-accounts-represent-less-than-5-users-filing-2022-05-02/\"><em>Reuters</em> report</a> on Twitter’s filing, saying he wants to see the company’s calculations.</p><p id=\"kuYFyH\">“Twitter deal temporarily on hold pending details supporting calculation that spam/fake accounts do indeed represent less than 5% of users,” Musk tweeted. However, in a follow-up tweet, he added that he’s “<a href=\"https://twitter.com/elonmusk/status/1525080945274998785\">still committed to [the] acquisition</a>,” suggesting that it’ll proceed after Twitter provides satisfactory information on its numbers. </p><div id=\"A8C3hK\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Still committed to acquisition</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1525080945274998785?ref_src=twsrc%5Etfw\">May 13, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"XTbKRM\">Twitter’s share price had plunged as much as 20 percent on news of the hold, while Tesla is up 6 percent as of this writing.</p><p id=\"YDwTSa\">Below is the relevant section of Twitter’s filing. It notes that its calculations about the number of false or spam accounts are an “estimate,” and that the real number “could be higher than we have estimated”: </p><blockquote><p id=\"jwg8pV\">We have performed an internal review of a sample of accounts and estimate that the average of false or spam accounts during the first quarter of 2022 represented fewer than 5% of our mDAU during the quarter. The false or spam accounts for a period represents the average of false or spam accounts in the samples during each monthly analysis period during the quarter. In making this determination, we applied significant judgment, so our estimation of false or spam accounts may not accurately represent the actual number of such accounts, and the actual number of false or spam accounts could be higher than we have estimated.</p></blockquote><p id=\"VAkgRD\">Twitter has had problems with math in the past. A few weeks ago it said in an earnings report that it had <a href=\"https://www.theverge.com/2022/4/28/23046170/twitter-miscounted-daily-users-three-years-q1-2022-earnings\">overcounted its daily users</a> for three years straight. The company said a technical error had lead to it counting multiple accounts as active, despite them being tied to a single user, and that this had lead to it miscounting its user numbers by as much as 1.9 million each quarter.</p><p id=\"iF529v\">Musk has made cutting down on the amount of “spam and scam bots” and “bot armies” on Twitter a key part of <a href=\"https://www.theverge.com/2022/4/26/23040879/elon-musk-twitter-plans-free-speech-bots-anonymity-algorithm-open-source\">his pitch for improving the service</a>, alongside prioritizing free speech, and open-sourcing the platform’s ranking algorithms. </p><p id=\"SUCBFt\">Putting the deal on hold represents the latest speedbump to hit Musk’s attempted takeover of the social media network. The company had initially announced a so-called “<a href=\"https://www.theverge.com/2022/4/15/23024978/elon-musk-twitter-buyout-offer-ownership-deal-finance\">poison pill</a>” measure to prevent the takeover, before eventually accepting the buyout <a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\">in late April</a>.</p><p id=\"gm6dDq\"><em><strong>Update May 13th, 8:00AM ET:</strong></em><em> Updated with Musk’s follow-up tweet. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gxKrTWDLE6RXttsACpVktddRezs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390590/VRG_Illo_STK022_K_Radtke_Musk_Down_Arrow_Blue.jpg",
  "description": "Elon Musk isn’t happy about Twitter’s user numbers",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}