{
  "title": "Elon Musk dares autoworkers union: hold a vote at Tesla’s California factory",
  "url": "https://www.theverge.com/2022/3/3/22959592/elon-musk-tesla-union-challenges-uaw-california-factory-vote",
  "date": "2022-03-03T09:56:44.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"US-SPACE-SPACEX-STARSHIP\" src=\"https://cdn.vox-cdn.com/thumbor/T0wY5_5oZZQ892IIkge87RGgPWs=/6x0:6042x4024/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70573220/1238367618.0.jpg\" />        <figcaption>Photo by JIM WATSON/AFP via Getty Images</figcaption>    </figure>  <p id=\"Oviqpe\">Elon Musk has <a href=\"https://twitter.com/elonmusk/status/1499249339671089152\">invited</a> the United Auto Workers (UAW) labor union to hold a vote to unionize at Tesla’s Fremont factory in California.</p><p id=\"vUFIGM\">Musk tweeted the challenge after President Joe Biden, speaking in his State of the Union Address, mentioned rival automakers Ford and General Motors — both of which have a strong union presence, a key component of Biden’s political base — but not Tesla.</p><p id=\"kZT0sb\">Gene Simmons, bassist and singer from iconic rock band Kiss, noted on Twitter that the snub from pro-union Biden may have been “because Tesla is non-union and moved to Texas, a ‘right to work’ state.” </p><p id=\"d9Mu8h\">Musk apparently agrees, and responded: “I’d like hereby to invite UAW to hold a union vote at their convenience. Tesla will do nothing to stop them.” Musk’s argument is that because the Bay Area has such a competitive labor market, Tesla has to “treat and compensate our (awesome) people well,” which makes unionization unattractive. </p><div id=\"30VYe6\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">Our real challenge is Bay Area has negative unemployment, so if we don’t treat and compensate our (awesome) people well, they have many other offers and will just leave!<br><br>I’d like hereby to invite UAW to hold a union vote at their convenience. Tesla will do nothing to stop them.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1499249339671089152?ref_src=twsrc%5Etfw\">March 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"am7c95\">Although Musk says he welcomes a fair vote on unionization, in the past, he and other Tesla executives have been found guilty of sabotaging union efforts. In September 2019, a California judge found the company’s management guilty of a number of illegal anti-union tactics. As <em>Vox</em> <a href=\"https://www.vox.com/identities/2019/9/30/20891314/elon-musk-tesla-labor-violation-nlrb\">reported at the time</a>: </p><blockquote><p id=\"eD1gcA\">The administrative judge, Amita Tracy, pointed to 12 company actions that violated US labor laws. That includes letting security guards harass workers who were passing out union pamphlets in the parking lot, banning employees from wearing pro-union T-shirts and buttons, repeatedly interrogating union organizers, and eventually firing one of them.</p></blockquote><p id=\"HgXwZu\">As one worker <a href=\"https://www.theguardian.com/technology/2018/sep/10/tesla-workers-union-elon-musk\">told <em>The Guardian </em>in 2018</a>: “Elon Musk says he’s neutral toward the union [...] They’ve been anything but neutral. Anything union or pro-union is shut down really fast.” Musk himself has also been <a href=\"https://www.theverge.com/2021/3/25/22351157/tesla-elon-musk-delete-anti-union-tweet-national-labor-relations-board\">ordered to delete tweets</a> that the National Labor Relations Board (NLRB) found to constitute threats to unionizing workers. Tesla is currently <a href=\"https://www.reuters.com/legal/transactional/musk-tweet-union-campaign-not-illegal-threat-says-tesla-lawyer-2022-02-02/\">appealing</a> the order.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EbKa7ryEKp-SJ1kHMqRG5b3W8to=/0x429:6048x3595/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285042/1238367618.jpg",
  "description": "Musk invites union vote after State of the Union snub",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}