{
  "title": "Elon Musk privately raged at Saudi officials over his failed plan to take Tesla private",
  "url": "https://www.theverge.com/2022/4/25/23040961/elon-musk-saudi-pif-texts-tesla-private-lawsuit",
  "date": "2022-04-25T15:32:23.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"US-SPACE-SPACEX-STARSHIP\" src=\"https://cdn.vox-cdn.com/thumbor/A796SYNBpfyXa7_dUybrM4GEp3M=/6x0:6042x4024/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70790465/1238367308.0.jpg\" />        <figcaption>Photo by JIM WATSON/AFP via Getty Images</figcaption>    </figure>  <p id=\"y7nIsH\">Elon Musk raged at the head of the Saudi sovereign wealth fund for failing to back his bid to take Tesla private in 2018, complaining that he was being thrown “under the bus,” according to newly disclosed text messages. </p><p id=\"rz1ZYJ\">“I am deeply offended,” Musk wrote to Yasir Al-Rumayyan, governor of the Kingdom of Saudi Arabia’s Public Investment Fund (PIF), on August 12, 2018. The texts were sent a few days after Musk <a href=\"https://www.theverge.com/2018/8/7/17661178/tesla-elon-musk-private-420-share-considering\">shocked the financial world by tweeting</a> that he was considering taking Tesla private at $420 a share, adding “funding secured.”</p><p id=\"q150zj\">The now infamous tweet triggered a lawsuit from Tesla shareholders, who claim that Musk lied about having the money required to delist Tesla from the stock exchange and take it private. As part of the lawsuit, a series of texts between Musk, shareholders, board members, and other relevant parties was disclosed <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.330489/gov.uscourts.cand.330489.403.0.pdf\">in a recent court filing</a>. </p><div class=\"c-float-right\"><aside id=\"bOXBhA\"><q>“This is an extremely weak statement”</q></aside></div><p id=\"Y6Gdqj\">Musk’s texts with Al-Rumayyan stand out for the ferocity on display. The billionaire CEO was incensed by news stories that claimed that PIF has “shown no interest” in helping take Tesla private, claiming that Saudi officials have told him otherwise. The news stories were “false” and “outrageous,” Musk raged. </p><p id=\"CwpghK\">“This is an extremely weak statement and does not reflect the conversation we had at Tesla,” Musk said in one of the messages, <a href=\"https://www.bloomberg.com/news/articles/2018-08-12/saudi-fund-is-said-to-be-in-talks-to-invest-in-tesla-buyout-deal\">linking to a <em>Bloomberg</em> story</a>. “You said you were definitely interested in taking Tesla private and had wanted to do so since 2016. You also made it clear that you were the decision-maker, moreover backed strongly by the Crown Prince, who regards this as strategically important at a national level.”</p><p id=\"ITp4Sf\">He added, “I’m sorry, but we cannot work together.”</p><p id=\"4Xy0fi\">“It’s up to you Elon,” Al-Rumayyan replied.</p><p id=\"55j3d0\">“You are throwing me under the bus,” Musk said. </p><p id=\"m3y4DJ\">“It takes two to tango,” Al-Rumayyan said, adding that PIF has yet to receive financial information from Musk’s team regarding the plan to take Tesla private. The PIF governor said the fund would not be able to move forward in its talks with Tesla without “sufficient information.”</p><div class=\"c-float-right\"><aside id=\"IdKXCm\"><q>“It takes two to tango”</q></aside></div><p id=\"PfnDc8\">Musk was critical of Al-Rumayyan for claiming to need more information than was already disclosed in Tesla’s regulatory filings. He texted, “Yasir, when we met at Tesla recently, you said that you were the decision-maker for PIF, that you had wanted to do the Tesla takeprivate deal for two years, and that this was supported directly by the Crown Prince. I checked with my team who were in that meeting in case I remembered something wrong and they confirmed this exactly.”</p><p id=\"qfkr9x\">He added, “You are extremely experienced financially and are well-aware of what a go-private would require, which is that there would need to be at least a 20% premium to market in order to buy out any shareholders who don’t want to remain part of the company when it is private. This is all standard practice. Nothing unusual at all.”</p><p id=\"YlksxY\">“There are many other investment funds who want to be part of this deal,” Musk continued. “We do not need your fund to get this done. I will not work with an organization who’s public statement to the media do not match their private statements to me and my team.”</p><p id=\"uVUV5V\">Al-Rumayyan reiterated the need for more information before talks could continue, while also denying that anyone at PIF had “gone to the media.” But Musk couldn’t be talked down. </p><p id=\"dSal4h\">“I read the article. It is weak sauce and still makes me sound like a liar,” Musk seethed. “It is filled with equivocation and in no way indicates the strong interest you conveyed in person.”</p><p id=\"ZCMLyK\">Al-Rumayyan insisted that they should continue the discussion in private, but Musk refused. “I am sorry, but there will be no further communication unless you fix the public perception of wishy washy support and interest from PIF,” he wrote. “That is not what you said to me and my team privately. Someone is either a friend or not a friend and no friend says one thing privately and another thing publicly. This is not right.”</p><div class=\"c-float-right\"><aside id=\"Ji9ZBr\"><q>“There will be no further communication unless you fix the public perception of wishy washy support and interest from PIF”</q></aside></div><p id=\"sZVSK1\">Musk’s tweet about taking Tesla private also triggered an investigation by the US Securities and Exchange Commission, which eventually concluded that, while he had held a few meetings with PIF, Musk “had never discussed a going-private transaction at $420 per share with any potential funding source, had done nothing to investigate whether it would be possible for all current investors to remain with Tesla as a private company via a ‘special purpose fund,’ and had not confirmed support of Tesla’s investors for a potential going-private transaction.” <a href=\"https://www.theverge.com/2022/4/14/23025511/elon-musk-sec-funding-secured-tesla-twitter-ted\">The SEC is currently in litigation with Musk</a> over the results of the investigation. </p><p id=\"gMSfCt\">Musk ultimately <a href=\"https://www.theverge.com/2018/8/24/17780714/elon-musk-tesla-staying-public\">abandoned his plan to take Tesla private</a>, concluding that it was distracting from the company’s efforts to produce its Model 3 electric sedan. Musk also said that the process of exploring his options reinforced his belief that “there is more than enough funding to take Tesla private.”</p><p id=\"zWfiSJ\">The filing also contains a slew of additional messages, including texts that Musk sent to Google co-founder Larry Page. Two days after sending his “funding secured” tweet, Musk texted Page, “Just called. Btw, this is Elon. Not sure if you have my new number.”</p><p id=\"vaKy76\">“Nope didn’t have it...am traveling. Nice block 5!” Page replied.</p><p id=\"J8fUcS\">“Thanks!” Musk said, adding, “Wanna invest in Tesla?  ”</p><p id=\"z6nrzJ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uat4syOvEkOC9fubOCKLrzawsVg=/0x429:6048x3595/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23414754/1238367308.jpg",
  "description": "The texts were disclosed as part of a shareholder lawsuit.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}