{
  "title": "Elon Musk: ‘I guess I would’ reverse Donald Trump’s Twitter ban",
  "url": "https://www.theverge.com/2022/5/10/23065413/elon-musk-donald-trump-twitter-ban-lift",
  "date": "2022-05-10T18:11:40.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/tpihBED-kJHVxN8l_x7vzYjZFLo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70853350/acastro_191204_1777_elon_legal_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"BbO7oS\">One of the questions about Elon Musk’s pending purchase of Twitter is what will happen to Donald Trump. The former president’s account <a href=\"https://www.theverge.com/2021/1/8/22218753/twitter-bans-trump-permanently-realdonaldtrump\">was banned on January 8th, 2021,</a> “due to the risk of further incitement of violence,” while Jack Dorsey was still the company’s CEO. During an interview conducted remotely during the <em>Financial Times’ </em><a href=\"https://car.live.ft.com/\">Future of the Car</a> conference and <a href=\"https://youtu.be/VfyrQVhfGZc\">livestreamed on YouTube</a>, the current Tesla and SpaceX CEO responded to a direct question about the ban and what will happen when he owns Twitter. </p><p id=\"XNb57d\">With the caveat that “I don't own Twitter yet, so this is not, like, a thing that will definitely happen,” Musk said, “I guess the answer is that I, I would reverse the permaban,” citing a shared opinion <a href=\"https://www.theverge.com/2022/4/29/23049172/elon-musk-buys-twitter-thiel-farts-jack-dorsey\">with his text messaging buddy Dorsey</a> that permabans should not exist except for bots and spam.</p><blockquote><p id=\"WI7Rxt\">I spoke with Jack Dorsey about this and he and I are of the same mind which is that permanent bans should be extremely rare and we would reserve [them] for accounts that are bots or spam/scam accounts, where there’s no legitimacy to be accountable.</p><p id=\"gVPNnu\">I do think that it was not correct to ban Donald Trump. I think that was a mistake, because it alienated a large part of the country and did not ultimately result in Donald Trump not having a voice, he is now going to be on Truth Social as will a large part of the right in the United States, and so I think this could end up being frankly worse than having a single forum where everyone can debate. So I guess the answer is I would reverse the permaban, obviously I don’t own Twitter yet so it’s not a thing that will definitely happen, because what if I don’t own Twitter? But my opinion and Jack Dorsey to be clear shares this opinion is that we should not have permabans.</p></blockquote><p id=\"a1s9Rs\">As he went on to explain further, he says his opinion is that the ban was a mistake, as it “alienated a large part of the country, and did not result in Donald Trump not having a voice.” As he put it, it’s “frankly worse” for Trump to move to his own app, Truth Social. Musk closed his response by pointing out that, at least so far, Trump claims he will only use his own app and <a href=\"https://www.theverge.com/2022/4/25/23041703/trump-truth-social-twitter-elon-musk-free-speech-platform\">won’t come back to “boring” Twitter</a> at all.</p><p id=\"HG1olp\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZJDQl_GjIInDsiqOC2OC53bdRsA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19430218/acastro_191204_1777_elon_legal_0001.0.jpg",
  "description": "Musk calls alienating Trump and his followers a mistake.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}