{
  "title": "Elon Musk’s SEC filings reserve the right to buy a larger stake in Twitter",
  "url": "https://www.theverge.com/2022/4/11/23020118/elon-musk-twitter-schedule-13d-social-media-board-of-directors-sec",
  "date": "2022-04-11T18:21:30.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Glb1QQQwt0fABNMBQ0V459FNVEA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70736811/VRG_Illo_STK022_K_Radtke_Musk_Money.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"1vdUic\">Now that Elon Musk <a href=\"https://www.theverge.com/2022/4/10/23019802/elon-musk-not-joining-twitter-board-announced\">will not be the new member of Twitter’s board of directors</a>, it means <a href=\"https://www.theverge.com/23020401/elon-musk-twitter-board-takeover-agrawal-invest\">more speculation</a> about his true intentions and, yes, more paperwork. Musk has, again, <a href=\"https://www.sec.gov/Archives/edgar/data/0001494730/000110465922044481/tm2212422d1_sc13da.htm\">updated the required filing (pdf)</a> for investors buying a significant chunk of a publicly traded company, in which investors must explain their intentions.</p><p id=\"Tj670r\">The new form confirms that any arrangement blocking Musk from trying to buy a significantly larger share of the company is gone, and it lays out various ways he may make his voice heard going forward. The result is a piece of evidence for anyone who suspects Musk’s reversal had something to do with the legal requirements that would come with serving on Twitter’s board.</p><p id=\"c8hJfF\"><a href=\"https://www.theverge.com/2022/4/5/23012266/elon-musk-sec-twitter-stock-acquisition-13d-tesla\">Last week, Musk filed a Schedule 13G form with the SEC</a> on April 4th (<a href=\"https://d18rn0p25nwr6d.cloudfront.net/CIK-0001418091/f66f56c1-eb52-43f8-a7ff-992dc80a7396.pdf\">read here</a>, pdf), which quickly came under scrutiny once his pending board seat was announced because the form is for investors who plan to remain passive in a company’s affairs — taking a board seat isn’t exactly passive. </p><div class=\"c-float-right\"><aside id=\"2bLQEx\"><q>Now Elon is Twitter’s second-largest shareholder</q></aside></div><p id=\"hqL6ds\">He cleared up that issue with an updated Scheduled 13D document (<a href=\"https://www.sec.gov/Archives/edgar/data/1418091/000110465922042863/tm2211757d1_sc13d.htm\">read here</a>, pdf) that’s appropriate for an “active” investor, detailing his stock purchases, and noted an agreement to not try to purchase more than 14.9 percent of Twitter’s shares. Still, the amended filings aren’t enough to clear up the issue of how long he waited to disclose his share purchases and any response that may draw from the SEC.</p><p id=\"YbKKn3\">Musk says he owns 9.1 percent of outstanding shares right now with 73,115,038. Interestingly, while he remains Twitter’s largest individual shareholder, he doesn’t own the largest stake in the company. <a href=\"https://www.protocol.com/bulletins/elon-musk-twitter-board-drama\"><em>Protocol</em></a> points out that The Vanguard Group mutual fund <a href=\"https://www.protocol.com/bulletins/elon-musk-twitter-board-drama\">disclosed on Friday</a> that it now owns 82,403,665 shares, which is enough for a 10.29 percent piece of the company, even though the ownership is distributed across all fund-holders.</p><p id=\"yVhSjN\">That board of directors deal is off, and now the new document is here, so what’s changed? The only significant difference is Section 4, which previously contained language limiting Musk to a 14.9 percent stake in the company. Now that language is gone, replaced by a note indicating what the Reporting Person (Musk) “might” do, and it focuses on two specific things.</p><p id=\"ZOqXQa\"><strong>What the filing said on April 5th:</strong></p><blockquote><p id=\"5QlhxT\">On April 4, 2022, the Reporting Person and the Issuer entered into a letter agreement (the “Agreement”) which provides that: (i) the Issuer will appoint the Reporting Person to the Issuer’s Board of Directors (the “Board”) to serve as a Class II director with a term expiring at the Issuer’s 2024 Annual Meeting of Stockholders; and (ii) for so long as the Reporting Person is serving on the Board and for 90 days thereafter, the Reporting Person will not, either alone or as a member of a group, become the beneficial owner of more than 14.9% of the Issuer’s common stock outstanding at such time, including for these purposes economic exposure through derivative securities, swaps, or hedging transactions. </p></blockquote><p id=\"2dxRh3\"><strong>What the updated filing says, registered on April 11th:</strong></p><blockquote><p id=\"Q6ccfN\">From time to time, the Reporting Person <strong>may engage in discussions with the Board and/or members of the Issuer’s management team</strong> concerning, including, without limitation, potential business combinations and strategic alternatives, the business, operations, capital structure, governance, management, strategy of the Issuer and other matters concerning the Issuer. The Reporting Person <strong>may express his views to the Board and/or members of the Issuer’s management team and/or the public through social media or other channels</strong> with respect to the Issuer’s business, products and service offerings.</p></blockquote><p id=\"MLDliR\">In his letter to employees Sunday night, Twitter CEO Parag Agrawal <a href=\"https://twitter.com/paraga/status/1513354622466867201\">said</a> of Musk that “we will remain open to his input,” and Elon’s letter suggests there will be plenty of it. How much of it comes in discussions with the board and management vs. social media musing may determine how much the “distraction” Agrawal warned of actually comes to pass. </p><p id=\"FhFPBU\">It’s unclear what caused Musk to inform the board on Saturday morning that he wouldn’t join them as a member, but it leaves his future plans unclear. In the document, Musk indicates that he isn’t planning to buy more shares of the company right now (that’s covered under Item 4 of the new filing, <a href=\"https://www.law.cornell.edu/cfr/text/17/240.13d-101\">as part of a series of prompts</a> for the new shareholder) but also says he “reserves the right to change his plans at any time, as he deems appropriate.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lK6QFra65ffcxA9WVjRiISVC7_8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382325/VRG_Illo_STK022_K_Radtke_Musk_Money.jpg",
  "description": "Elon Musk still might slide in the board’s DMs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}