{
  "title": "Engineers are building bridges with recycled wind turbine blades",
  "url": "https://www.theverge.com/2022/2/11/22929059/recycled-wind-turbine-blade-bridges-world-first",
  "date": "2022-02-11T17:30:00.000Z",
  "author": "Maddie Stone",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/VviGbK4AJGKwbCp6JZQIyocBAt0=/0x336:4032x3024/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70498400/IMG_6186.0.jpeg\" />        <figcaption>Construction workers install a new pedestrian bridge made with recycled wind turbine blades in County Cork, Ireland. | ReWind</figcaption>    </figure>  <p id=\"L92h9K\">On a former train track bed connecting the towns of Midleton and Youghal in County Cork, Ireland, workers recently excavated the rusted remains of an old railway bridge and installed a pedestrian one in its place. The bridge would have been an unremarkable milestone in the development of a new pedestrian greenway through the Irish countryside, if not for what it’s made of: recycled wind turbine blades.</p><p id=\"0q3JJ9\">That makes it just the second “blade bridge” in the world. The first, <a href=\"https://www.compositesworld.com/news/anmet-installs-first-recycled-wind-turbine-blade-based-pedestrian-bridge\">installed last October</a> in a small town in western Poland, officially opened in early January. The engineers and entrepreneurs behind these bridges are hopeful they represent the beginning of a new trend: <a href=\"https://grist.org/energy/todays-wind-turbine-blades-could-become-tomorrows-bridges/\">repurposing old wind turbine blades for infrastructure projects</a>. </p><p id=\"i5I26l\">It keeps them out of landfills and saves energy required to make new construction materials. When civil engineer Kieran Ruane first saw concept designs for a bridge built with wind turbine blades, he said the idea was “immediately appealing.”</p><p id=\"90vLvy\">“It was a no-brainer that this needed to be investigated and trialed, at least,” Ruane, a lecturer at Ireland’s Munster Technological University and a member of <a href=\"https://www.re-wind.info/\">Re-Wind</a>, the research network behind Ireland’s new blade bridge, tells <em>The Verge</em>.</p><p id=\"owlgsM\">Creative solutions will be necessary to deal with the wind turbine blade waste that’s coming. Averaging over <a href=\"https://www.energy.gov/eere/wind/how-wind-turbine-works-text-version\">150 feet in length</a> and weighing upwards of <a href=\"https://www.compositesworld.com/articles/wind-turbine-blades-big-and-getting-bigger#:~:text=For%20a%201.5%2DMW%20turbine,roughly%20%24250%2C000%20to%20%24300%2C000%20each.\">a dozen tons each</a>, wind turbine blades take up huge amounts of space in landfills. Once there, the ultra-sturdy, fiber-reinforced plastics they’re made of don’t break down easily. Decommissioned wind turbine blades, if they’re not just stockpiled, are often destined for landfills today. The main alternative, incinerating them for energy, creates additional pollution.</p><div class=\"c-float-right\"><aside id=\"vOvNBj\"><q>“It was a no-brainer that this needed to be investigated”</q></aside></div><p id=\"PoSps9\">That could change if ideas like blade bridges take off. Marcin Sobczyk, a product developer at Anmet, the company behind Poland’s new blade bridge, tells <em>The Verge</em> that wind blades often have decades of life left in them after a turbine is decommissioned. And the same material properties that make blades good at harnessing wind power — strength, lightweightness, and all-weather durability — also make them attractive as engineering support structures.</p><p id=\"mFsAn2\">“These constructions should be able to exist for at least a hundred years,” Sobczyk says of blade bridges, adding that most wind turbines are only designed to be in use for two to three decades. “So we really increase this period of use.” Ruane also told <em>The Verge</em> that blade bridges, like other types of bridges, can be designed to last for more than a century.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GdMScrvzLLM3aGQX-z2qrsVf5II=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23235092/271218343_462005612195989_7366409888645211402_n.jpg\">      <cite>Anmet</cite>      <figcaption><em>The world’s first wind turbine blade bridge was recently installed in western Poland.</em></figcaption>  </figure><p id=\"Fv7u10\">Originally a metals recycling company, Anmet started exploring ways to repurpose wind blades about seven years ago. Since then, it developed a small commercial business <a href=\"https://www.thefirstnews.com/article/the-green-team-turning-disused-wind-turbines-into-stylish-street-and-garden-furniture-10543\">making outdoor furniture</a> out of discarded wind turbine blades. Bridges, Sobczyk says, are the next area it would like to expand into commercially.</p><p id=\"vczzb3\">The company’s first blade bridge took about three years to test, permit, and build. After harvesting decommissioned blades from a wind farm in Germany, the blades were subjected to a battery of engineering tests in partnership with Poland’s Rzeszów University of Technology before being cut up to create the primary support structures for a pedestrian footbridge. In October, Amnet installed that bridge over a river in Szprotawa, the small town where the company is headquartered. </p><p id=\"pyPslo\">Because it was a first-of-its-kind demonstration, Anmet financed the bridge, along with a grant from the European Union to help cover the cost of the engineering tests. In the future, the company hopes to get paid by municipalities to build similar bridges across Poland, Germany, and beyond. Sobczyk believes Amnet will be able to offer a price that’s competitive with traditional steel and concrete bridges while also solving a waste problem by taking decommissioned blades off wind energy companies’ hands.</p><p id=\"qUkltI\">The team behind the new Irish blade bridge also believes they will be cost-competitive with more traditional bridges in addition to offering environmental advantages. Angela Nagle, a civil engineering Ph.D. candidate at the University College Cork and a member of the ReWind network, says that by using blades decommissioned from a wind farm in Belfast, the team avoided nearly 800 kilograms of CO2 emissions that would have occurred had they used steel girders. ReWind, she says, is exploring other ways to streamline production of future bridges, including through standardized design elements and by developing more efficient ways to evaluate the condition of used blades and “bucket them for various repurposing applications.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SPSaCiAlsukm1GpclTEcMwZOj74=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23235094/IMG_5691.JPG\">      <cite>ReWind</cite>      <figcaption><em>The ReWind bridge’s first blade bridge was test assembled before being installed along a new pedestrian greenway.</em></figcaption>  </figure><p id=\"GQQ1np\">Such efforts may be key to launching companies that can build bridges efficiently enough to turn a profit. According to Ruane, a major challenge in constructing these bridges is reverse-engineering the physical properties of the blades, which manufacturers typically consider proprietary information. For ReWind’s first bridge, the team conducted nine months of engineering and materials tests to inform the bridge’s design. Whether future testing can be streamlined to save time and scale up production is “perhaps the key question in some respects,” Ruane says.</p><p id=\"4KcR3q\">But Ruane is hopeful that as blade manufacturers and wind energy companies start to see structures like this out in the world, the repurposing market will “get more buy-in from the industry.” Ruane says he’s had preliminary conversations with a number of blade manufacturers that are “starting to get interested in what we’re doing.” </p><div class=\"c-float-right\"><aside id=\"YOC0e2\"><q>Something like these never existed</q></aside></div><p id=\"YB5VmY\">As blade bridge builders seek additional support from industries and governments alike, their first public constructions face a more imminent test: public opinion. While ReWind’s blade bridge won’t open until the spring when County Cork’s new greenway section is completed, Anmet’s bridge is already in use. Sobczyk estimates that “80 to 90 percent” of the comments he’s received on the bridge have been positive, although some locals have found its appearance a bit strange. Anmet also faced some skepticism when it first began placing repurposed wind blade furniture around town.</p><p id=\"PGVYnW\">“Some people said they don’t like it,” Sobczyk says. </p><p id=\"SeLUZJ\">But in summer, as residents began spending more time outside, Sobczyk says that negative opinions about the furniture started to shift. People started to realize “that they have something new. Something like these never existed.”</p><p id=\"OMse3m\"></p><p id=\"CTjhX1\"></p><p id=\"NFnvZB\"></p><p id=\"waqCjy\"></p><p id=\"C48aBB\"></p><p id=\"BLulwj\"></p><p id=\"HgIQtU\"></p><p id=\"ZG351I\"></p><p id=\"XUVivD\"></p><p id=\"OwDN6U\"></p><p id=\"J2woOE\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/50Gh48zeJi_hZwYEuc6ReGSRqBg=/0x724:4032x2835/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23235089/IMG_6186.JPG",
  "description": "Old blades still have a lot of life left in them.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}