{
  "title": "Epic is donating two weeks of Fortnite proceeds to Ukraine relief",
  "url": "https://www.theverge.com/2022/3/20/22986671/epic-fortnite-season-2-ukraine-relief",
  "date": "2022-03-20T06:35:44.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/UhHQ69h4LggIkWsSq6MUmAwh3Xw=/221x0:1555x889/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70647847/6_1776x889_1e64e7e8c328.0.png\" />    </figure>  <p id=\"zvlO1R\">A new season of <em>Fortnite</em> is launching today, and <a href=\"https://www.epicgames.com/fortnite/en-US/news/support-humanitarian-relief-for-ukraine\">developer Epic will be donating all of its proceeds from the first two weeks to Ukraine-related humanitarian efforts</a>. The action will last from March 20th through April 3rd, and will include all “real-money purchases” in the game, which means purchased V-bucks, subscriptions, gifted battles passes, and certain cosmetic packs. (Epic notes that “using V-Bucks in <em>Fortnite</em> will not be included as those are not real-money purchases.) It will also include retail gift card purchases so long as they’re redeemed during the two-week window.</p><p id=\"apwp2M\">As part of the effort, Microsoft will also be “committing their net proceeds for <em>Fortnite</em> during this time, so that we can get more aid to the people of Ukraine.” Funds will be donated to a few different organizations, which include Direct Relief, the United Nations High Commissioner for Refugees, the United Nations Children’s Fund, and the World Food Programme. The developer says that it will add more supported organizations “in the coming weeks.”</p><div id=\"S4AOvf\"><blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\"><a href=\"https://t.co/BADuu3pwCF\">pic.twitter.com/BADuu3pwCF</a></p>— Fortnite (@FortniteGame) <a href=\"https://twitter.com/FortniteGame/status/1505432273126146049?ref_src=twsrc%5Etfw\">March 20, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"9d1mot\">Epic says that it will be sending funds to these organizations as “quickly as we can. We’re not waiting for the actual funds to come in from our platform and payment partners, which can take a while depending on how the transaction was processed. As transactions are reported, we’ll log them and send the funds to the humanitarian relief organizations within days.”</p><p id=\"txELel\">The news comes as other gaming-related efforts have managed to raise millions of dollars for humanitarian relief following the Russian invasion of Ukraine. <a href=\"https://www.theverge.com/2022/3/8/22967069/itch-io-ukraine-bundle-support-charity\">A bundle of indie games on Itch.io</a> raised more than $6 million earlier this month, and <a href=\"https://www.theverge.com/2022/3/18/22983137/humble-bundle-stand-with-ukraine-charity-bundle-price\">a Ukraine-focused Humble Bundle</a> has already surpassed $9 million.</p><p id=\"TbWGfx\">The new season of <em>Fortnite</em> starts later today, and follows <a href=\"https://www.theverge.com/2021/12/4/22815391/fortnite-the-end-event-chapter-2-recap-highlights-news\">a dramatic event</a> that kicked off <a href=\"https://www.theverge.com/2021/12/5/22817392/fortnite-chapter-3-season-1-spider-man-new-island\">a whole new chapter</a> last December.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YaDEKCVH15Uwims4JCEMb-Rrkm0=/39x0:1737x889/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23330013/6_1776x889_1e64e7e8c328.png",
  "description": "Just in time for the new season.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}