{
  "title": "Epic isn’t satisfied by Google’s app store billing stunt",
  "url": "https://www.theverge.com/2022/3/25/22996260/epic-games-google-android-billing-pilot",
  "date": "2022-03-25T18:08:53.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jNaKgQHgWf0VP4sEm1TtlXo3_4o=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70672233/acastro_20200818_1777_epicApple_0002.0.0.jpg\" />        <figcaption><em>Google has announced a pilot to allow for alternative payment systems in Android apps.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ie0WqI\">Google announced <a href=\"https://www.theverge.com/2022/3/23/22993417/google-pilot-test-android-alternate-billing-systems-spotify\">on Wednesday</a> that it would test letting Android developers use their own billing systems in their apps, the first step in what could lead to a dramatic reshaping of the app economy. However, Epic Games, which has been a strong proponent for opening app marketplaces and sued Google after the search giant <a href=\"https://www.theverge.com/2020/8/13/21368363/epic-google-fortnite-lawsuit-antitrust-app-play-store-apple-removal\">removed <em>Fortnite</em> from Google Play</a> for including direct payments, still isn’t happy. It plans to continue advocating for an app ecosystem that offers more choices, according to a statement the company shared with <em>The Verge</em>.</p><p id=\"1648220781.379809\">“Apple and Google continue to abuse their market power with policies that stifle innovation, inflate prices and reduce consumer choice,” Corie Wright, Epic’s VP of public policy, said in the statement. “One deal does not change the anticompetitive status quo. We will continue to fight for fair and open platforms for all developers and consumers and work with policymakers and regulators to hold these gatekeepers accountable for their anticompetitive conduct.”</p><p id=\"Q9GmtX\">Under Google’s <a href=\"https://android-developers.googleblog.com/2022/03/user-choice-billing.html\">new pilot</a>, developers will be able to offer a billing option in addition to the standard Google Play system. However, Spotify is currently the only known developer in the program, and it’s unclear who else may be participating or when it will be available more widely. </p><div class=\"c-float-right\"><aside id=\"gHzpaM\"><q>Epic is not a part of the pilot</q></aside></div><p id=\"OTbUcV\">Epic is not a part of the pilot, Epic spokesperson Elka Looks told <em>The Verge</em>. She did not share whether Epic rejected an offer or simply wasn’t asked to participate. Rick VanMeter, a spokesperson for <a href=\"https://appfairness.org/\">the Coalition for App Fairness</a>, of which Epic and Spotify are members, would not confirm to <em>The Verge</em> if its non-Spotify members were approached by Google.</p><p id=\"WlWqfn\">Companies like Epic and Spotify have criticized Apple and Google’s app store policies, including what they claim are high fees, for years. However, even as Google is loosening its stance on alternative billing systems, it still sounds like Google will get <a href=\"https://www.theverge.com/22993765/google-spotify-android-user-choice-billing\">some kind of commission from Spotify</a> as part of the pilot.</p><aside id=\"PmZE6x\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Spotify might soon bypass Android billing, but Google’s still getting paid\",\"url\":\"https://www.theverge.com/22993765/google-spotify-android-user-choice-billing\"},{\"title\":\"Google will test letting Android developers use their own billing systems\",\"url\":\"https://www.theverge.com/2022/3/23/22993417/google-pilot-test-android-alternate-billing-systems-spotify\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/qvX4e62Xwf4KSZ_X0gr2qmZa2GA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21768196/acastro_20200818_1777_epicApple_0002.0.jpg",
  "description": "\"One deal does not change the anticompetitive status quo.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}