{
  "title": "Epic launches Unreal Engine 5",
  "url": "https://www.theverge.com/2022/4/5/23010007/unreal-engine-5-launch-epic-games",
  "date": "2022-04-05T15:10:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NsAMBR5ee0bMFmkwX6ndD6bx1P0=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70712311/UE5_MetaHuman_Zakari_4k.0.png\" />        <figcaption>An Unreal Engine metahuman. | Image: Epic Games</figcaption>    </figure>  <p id=\"ME42fN\">Nearly two years after <a href=\"https://www.theverge.com/2020/5/13/21256079/epic-unreal-engine-5-playstation-5-demo-next-gen-graphics-release-date\">it was first announced</a>, Epic Games has released its next-generation game engine. As part of a State of Unreal event today, the company revealed that Unreal Engine 5 is now available to download.</p><p id=\"YbhNJw\">The updated engine features a number of improvements for developers — including enhanced performance and an upgraded UI — but the most significant changes come from a handful of technologies designed for more photorealistic visuals. These include Lumen, “a fully dynamic global illumination solution” for more true-to-life lighting, and Nanite, which Epic says “gives you the ability to create games and experiences with massive amounts of geometric detail.” There are also more practical tools, like the ability to partition off sections of an open world to make it easier for teams to work on areas independently. Altogether, these tools are expected to make it easier to make large-scale games at a high fidelity; CD Projekt Red has already confirmed it’s using the tool to build <a href=\"https://www.theverge.com/2022/3/21/22989313/cd-projekt-red-new-witcher-game-unreal-engine-5-announcement\">the next <em>Witcher</em></a>.</p><p id=\"Ox91up\">While this is the first time the engine is available widely for game developers, a few major UE5 projects have already been released to the public through Epic itself. Last December, <em>Fortnite</em> moved over to Unreal 5, and at the same time, Epic released <a href=\"https://www.theverge.com/22825102/keanu-reeves-carrie-anne-moss-interview-matrix-awakens-epic-games\"><em>The Matrix Awakens</em></a>, an impressive tech demo that merged the likenesses of Keanu Reeves and Carrie-Anne Moss with a large open-world populated by <a href=\"https://www.theverge.com/2021/4/14/22382757/epic-games-unreal-engine-metahuman-creator-early-access\">the developer’s Metahuman characters</a>.</p><p id=\"ihTj8b\">“It’s very good that we can experiment with the user experience flows way before anybody else does,” Epic CTO Kim Libreri tells <em>The Verge</em>. “So actually, it’s very valuable to our customers because it means they don’t have to go through that. We don’t end up putting super unthought-out workflows in front of all users. It’s great from that perspective, especially with something as big as the <em>Matrix</em> demo and as big as <em>Fortnite</em>.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ogbq5NIPyFtTHdnaBrEln-bU7ws=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366521/UE5_Lyra_Starter_Game_02.png\">      <cite>Image: Epic Games</cite>      <figcaption><em>Lyra.</em></figcaption>  </figure><p id=\"yngPRb\">As part of today’s launch of UE5, Epic is also making a sample of <em>The Matrix Awakens</em>’ city — sans the Hollywood stars — available for game developers to build off of. “I think we’re going to see some pretty awesome stuff,” Libreri says. Epic is also releasing a sample multiplayer shooter called <em>Lyra</em>, built in UE5, which looks a lot like <em>Unreal Tournament</em> and is something the developer says can be a “hands-on learning resource” for game creators.</p><p id=\"4doURN\">Outside of gaming, engines like Unreal have also become increasingly popular for other applications, most notably film and television. <em>The Mandalorian</em>, for instance, <a href=\"https://www.theverge.com/2020/2/20/21145671/mandalorian-sets-stagecraft-epic-games-ilm-fortnite-baby-yoda-digital\">utilized Unreal for its virtual sets</a>. With tools like UE5 and a new generation of gaming hardware, Libreri believes we’ll see more of this kind of crossover between mediums. In the past, he says, creators would build “movie quality assets” that would then have to be scaled down to be used in a game. Now those lines are starting to blur, opening up all kinds of possibilities.</p><p id=\"nf9FKV\">“It really means that across media boundaries, whether you’re making a movie, a TV show, or even doing an enterprise application, you don’t really have to think anywhere near as much about making that choice,” he explains. “Obviously, if you’re going to ship on on lower-end platforms, you still have to think about how many triangles are in the scene. But on the new generation of hardware, it absolutely is a game-changer. It’s totally feasible that a scene that’s made for a streaming show at Netflix or Disney — where they’ve basically used the highest resolution assets — there’s a chance now that stuff can turn up in a game or, as we head towards the future, show up in some metaverse experience.”</p><p id=\"Ls1yFH\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8h-9ImofCr2Tw7qC8n02cUiMqMI=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366458/UE5_MetaHuman_Zakari_4k.png",
  "description": "Two years after it was announced",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}