{
  "title": "Epic Games is acquiring music platform Bandcamp",
  "url": "https://www.theverge.com/2022/3/2/22958416/epic-games-bandcamp-music-store-acquisition",
  "date": "2022-03-02T17:41:42.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JorhuOM1BXar44e4II0O4EUvMZc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70570467/acastro_20200818_1777_epicApple_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"yBCTD1\">Epic Games is acquiring independent music storefront Bandcamp. The companies announced the news today, saying that Bandcamp would “keep operating as a standalone marketplace and music community” but use Epic’s resources to expand internationally and continue adding new features.</p><p id=\"RZaRGr\">An Epic blog post <a href=\"https://www.epicgames.com/site/en-US/news/bandcamp-joining-epic-games-to-support-fair-open-platforms-for-artists-and-fans?sessionInvalidated=true\">says Bandcamp will play</a> “an important role in Epic’s vision to build out a creator marketplace ecosystem for content, technology, games, art, music and more.” <a href=\"https://blog.bandcamp.com/2022/03/02/bandcamp-is-joining-epic/\">An announcement</a> from Bandcamp co-founder and CEO Ethan Diamond, meanwhile, emphasized that the core deal for artists won’t change in the near future. “The products and services you depend on aren’t going anywhere, we’ll continue to build Bandcamp around our artists-first revenue model,” Diamond wrote. “You’ll still have the same control over how you offer your music, Bandcamp Fridays will continue as planned, and the <em>Daily</em> will keep highlighting the diverse, amazing music on the site.”</p><div class=\"c-float-right\"><aside id=\"YQFfDg\"><q>“You’ll still have the same control over how you offer your music”</q></aside></div><p id=\"PgyqWi\">But Diamond says Epic and Bandcamp will work together “behind the scenes” to push development of merchandising and payment options, mobile apps, and <a href=\"https://www.theverge.com/2020/11/18/21574128/bandcamp-live-stream-virtual-concert-tickets-merch-covid-19\">livestreaming</a>, among other features.</p><p id=\"K8KtNN\">Epic is primarily known as the publisher of <em>Fortnite</em> and the creator of the Unreal game engine, but it’s made non-gaming acquisitions before with <a href=\"https://www.theverge.com/2019/6/12/18662708/epic-games-houseparty-acquisition-fortnite-video-chat\">group video chat Houseparty</a>. The company <a href=\"https://www.theverge.com/2021/9/9/22663531/epic-games-shutting-down-houseparty-october\">shut down Houseparty last year</a> after acquiring it in 2019, and its team was apparently folded into a larger push to expand Epic’s social features. Bandcamp, however, has a much greater existing fanbase and clearer economic model than Houseparty — it’s widely beloved as an <a href=\"https://www.theverge.com/22910685/music-listening-service-spotify-apple-youtube-amazon\">alternative to streaming platforms like Spotify</a> that offer less control and smaller revenue shares for most artists.</p><p id=\"QVIOx3\">Epic describes Bandcamp as committed to “fair and open platforms,” a subtle nod to its <a href=\"https://www.theverge.com/2022/1/20/22893546/epic-apple-fortnite-appeal-app-store-restrictions\">ongoing fight</a> with mobile storefront operators Apple and Google — whose payment models it’s described as a threat as it <a href=\"https://www.theverge.com/2021/5/3/22417697/apple-epic-fortnite-app-store-antitrust-trial-day-1\">expands its gaming offerings</a> to a larger social “metaverse.” Music has been a key part of that expansion so far, mostly in the form of <a href=\"https://www.theverge.com/2021/9/28/22699014/fortnite-soundwave-series-music-concerts-mohamed-hamaki-creative-mode\">performances inside <em>Fortnite</em></a>. Now, the Bandcamp acquisition is giving it a broader foothold in the medium.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/26WMgFPN8imZyiQ2h1Lbz1VO51g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21768198/acastro_20200818_1777_epicApple_0001.0.jpg",
  "description": "Bandcamp will remain a standalone marketplace.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}