{
  "title": "Epic and Lego partner to build a metaverse for kids",
  "url": "https://www.theverge.com/2022/4/7/23014616/epic-lego-metaverse-partnership",
  "date": "2022-04-07T13:06:02.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/s8IaWVqb0MHfdfF9yPdbIGEbG-U=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70720875/Fortnite_20210807141447.0.jpg\" />        <figcaption><em>Ariana Grande performing in </em>Fortnite<em>.</em></figcaption>    </figure>  <p id=\"dpHzXV\">Two of the biggest names in entertainment are coming together to create a virtual space aimed at kids, through a new partnership between <em>Fortnite</em> developer Epic Games and Lego. “We are excited to come together to build a space in the metaverse that’s fun, entertaining, and made for kids and families,” Epic CEO Tim Sweeney said in a statement.</p><p id=\"5DcPnB\">Details are scarce — <a href=\"https://www.theverge.com/22701104/metaverse-explained-fortnite-roblox-facebook-horizon\">and the concept of a metaverse remains a murky one</a> — but the companies say that whatever it is they end up building will be designed as a family-friendly virtual space from the beginning. “The Lego Group and Epic Games will combine their extensive experience to ensure that this next iteration of the internet is designed from the outset with the wellbeing of kids in mind,” the companies explained in a press release.</p><p id=\"5w1MLd\">The pairing makes a certain amount of sense. Epic has extensive experience creating virtual worlds, primarily through the enduringly popular <em>Fortnite</em>, while Lego has had an increasingly large focus on video games, most recently with the launch of <em>Lego Star Wars: The Skywalker Saga </em>this week. Meanwhile, two of the most popular online video games — <em>Minecraft</em> and <em>Roblox</em> — offer a similar style of sandbox building as Lego bricks. <a href=\"https://www.theverge.com/2021/9/30/22702117/epic-games-children-privacy-safety-kids-web-services-free\">Epic has also spoken about creating a more child-friendly metaverse in the past</a>.</p><p id=\"GNQODk\">The new partnership joins a host of other attempts from companies building their own interpretation of the metaverse, which to date includes everyone from <a href=\"https://www.theverge.com/2021/11/8/22768925/niantic-lightship-developer-platform-john-hanke-pokemon-go\"><em>Pokémon Go</em> maker Niantic</a> <a href=\"https://www.theverge.com/2021/10/28/22745234/facebook-new-name-meta-metaverse-zuckerberg-rebrand\">to the rebranded Facebook</a> and <a href=\"https://www.theverge.com/2022/3/22/22991272/yuga-labs-seed-funding-a16z-bored-ape-yacht-club-bayc-metaverse-other-side\">major NFT brands</a>.</p><p id=\"PU9ukP\">There’s no information about what this new <em>Fortnite</em>-meets-Lego world could look like, when it will be available, or on what platforms it’s expected to launch. But the companies did announce a trio of principles they say will guide its creation: “protect children’s right to play by making safety and wellbeing a priority; safeguard children’s privacy by putting their best interests first; empower children and adults with tools that give them control over their digital experience.”</p><p id=\"3U85MI\">The news comes in the same week that <a href=\"https://www.theverge.com/2022/4/5/23010007/unreal-engine-5-launch-epic-games\">Epic launched the next-generation version of its Unreal Engine game creation tool</a>.</p><p id=\"uBaLXS\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Uydsm7JuyAwGY2FeT0TpsXTyh6A=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22771205/Fortnite_20210807141447.jpg",
  "description": "Two big names.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}