{
  "title": "Epic won’t update Fortnite to run on the Steam Deck",
  "url": "https://www.theverge.com/2022/2/8/22923163/fortnite-steam-deck-update-epic-tim-sweeney",
  "date": "2022-02-08T09:04:45.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MqrCT7K0pGuQmp4I3XoiJuFGm2c=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70482846/shollister_210805_4698_0006.0.jpg\" />        <figcaption>Photo by Sean Hollister / The Verge</figcaption>    </figure>  <p id=\"qOnc8P\">Epic Games doesn’t plan to update <em>Fortnite</em> so that it runs on SteamOS, according to CEO Tim Sweeney, meaning owners of <a href=\"https://www.theverge.com/2022/2/7/22921979/valve-steam-deck-early-reviews-handheld-gaming-pc\">the upcoming Valve Steam Deck</a> will likely have to install Windows to play the popular battle-royale game. </p><p id=\"QbjBMp\">In a series of <a href=\"https://twitter.com/TimSweeneyEpic/status/1490565925648715781\">tweets</a>, Sweeney said that the company doesn’t feel confident about its ability to combat cheating in <em>Fortnite</em> when running on custom kernel configurations. <em>Fortnite</em> isn’t on the Steam store in any case, but Sweeney’s comments rule out a Linux version that could run on the Steam Deck.</p><p id=\"9Tj9Eo\">The Steam Deck uses Valve’s SteamOS, which is based on Linux, and makes use of a compatibility layer called Proton so that Steam games compiled for Windows can run on it. Epic has made its anti-cheat software, Easy Anti-Cheat (EAC), <a href=\"https://www.theverge.com/2021/9/23/22690670/epic-eac-anti-cheat-linux-valve-steam-deck-support-games\">compatible with Linux and Proton</a>, so developers that use it should be able to make their games work on the Steam Deck without issue. For now, though, Epic itself isn’t going to be one of them, at least not with <em>Fortnite.</em></p><div id=\"kSRBuC\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">With regard to anti-cheat on the Linux platform supporting custom kernels and the threat model to a game of Fortnite's size, YES THAT'S EXACTLY RIGHT!</p>— Tim Sweeney (@TimSweeneyEpic) <a href=\"https://twitter.com/TimSweeneyEpic/status/1490759707841159174?ref_src=twsrc%5Etfw\">February 7, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"ArQnmv\">When contacted for comment by <em>The Verge</em>, Sweeney described Linux as “a terrifically hard audience to serve given the variety of incompatible configurations.” Asked whether it would be possible to enable compatibility just for SteamOS, he said “Linux is a small market already and if you subdivide it by blessed kernel versions then it’s even smaller.” It may not be worth Epic’s while to put in the work on security for what will be a comparatively tiny audience, at least at first.</p><p id=\"twwCy3\">Besides, it’s not like Steam Deck owners won’t be able to play <em>Fortnite</em> at all — there’s always the option of installing Windows on the machine. Sweeney hailed the Steam Deck as an “<a href=\"https://twitter.com/timsweeneyepic/status/1415755678849900546\">amazing move by Valve</a>” when it was first announced, calling it “an open platform where users are free to install software [of] their choosing — including Windows and other stores.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/m3_T_ZbyY1nHQ1Z725o1SlgYrLA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22766265/shollister_210805_4698_0006.jpg",
  "description": "But you can always install Windows.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}