{
  "title": "Epic Games is making hundreds of temp testers into full employees with benefits",
  "url": "https://www.theverge.com/2022/2/19/22942053/epic-games-full-time-employment-contingent-workers",
  "date": "2022-02-19T18:11:47.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5zz_nr6WGwSohyZRQH4Zxyh3p2M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70529336/acastro_20200818_1777_epicApple_0002.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"6epL5R\">Epic Games is hiring its US-based contingent workers full-time and with benefits, Epic confirmed to <em>The Verge</em>. The <em>Fortnite</em> developer is extending the offer to quality assurance (QA) testers, as well as other “eligible” contract-based employees.</p><p id=\"PhL2KE\">The news first surfaced in an employee-facing memo obtained by <em>The Verge</em>. In the memo, the company writes it will “offer full-time at-will employment to eligible US-based contingent workers,” and that “many of those offers will be effective April 4th, 2022.” But it also notes that some workers won’t receive the offer, citing “there are a few exceptions in which it makes sense for both the worker and Epic to maintain contingent worker status.”</p><div class=\"c-float-right\"><aside id=\"7gouVI\"><q>“Most but not all” are quality assurance (QA) testers</q></aside></div><p id=\"i1y3Uu\">Epic spokesperson Elka Looks told <em>The Verge</em> that the game developer will hire “a few hundred” of its contractors, and that “most but not all” are quality assurance (QA) testers. Looks confirmed that all the workers will be eligible for the company’s US employee benefits plans, and will also be directly employed by Epic Games. The studio currently contracts out QA testers and other workers through temp agencies, including Eastridge, Hays, and Nextaff.</p><p id=\"d3MUBt\">Looks also said the company will still hire contingent workers for “short-term needs,” however. She didn’t have any additional information to share about the other types of contingent workers (outside of QA testers) Epic will be hiring, and didn’t specify which workers are excluded from the offer.</p><p id=\"JKt5XQ\">Epic’s move to make its contract-based workers full-time employees comes at a time when tensions between workers and major game development studios are high; not to mention that it’s a huge step towards improving working conditions for QA testers and other workers. In December, Activision’s Raven Software <a href=\"https://www.theverge.com/2021/12/3/22816827/raven-software-qa-contractor-layoff-activision-blizzard-call-of-duty\">laid off a dozen QA testers</a>, <a href=\"https://www.theverge.com/2021/12/6/22820549/activision-blizzard-raven-software-layoffs-walkout-call-of-duty\">prompting a walkout</a>, and later <a href=\"https://www.theverge.com/2022/1/21/22894964/activision-blizzard-raven-software-employees-create-game-workers-alliance-union\">the organization of the Game Workers Alliance union</a>.</p><p id=\"YhJYar\">The game industry has become known for subjecting workers to <a href=\"https://www.theverge.com/2018/10/15/17979606/rockstar-red-dead-redemption-2-crunch-100-hour-work-week\">incredibly long hours</a> during (sometimes unpaid) periods called “crunch,” and Epic is no exception. In 2019, Epic was met with criticism after its <a href=\"https://www.polygon.com/2019/4/23/18507750/fortnite-work-crunch-epic-games\">workers revealed the long workdays</a> that go into keeping the wildly-popular battle royale, <em>Fortnite</em> on track with fans’ expectations. <a href=\"https://www.polygon.com/2019/6/21/18693475/fortnite-two-week-break-content-update-studio-close-epic-games-crunch\">Epic Games later closed its studios for two weeks</a> in response to employees’ concerns.</p><p id=\"6GoAx9\">Last year, <a href=\"https://www.bloomberg.com/news/articles/2021-10-22/epic-games-ends-alternate-friday-vacation-policy-angering-staff\">Epic Games ended its COVID-era policy that let workers take every other Friday off</a>, upsetting employees who say the extra day off is beneficial. A number of independent developers <a href=\"https://www.theverge.com/2022/1/14/22882669/video-game-studios-four-day-workweek\">have transitioned to the four-day workweek</a>, including Young Horses, Crow Crow Crow, Die Gute Fabrik, and more.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qvX4e62Xwf4KSZ_X0gr2qmZa2GA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21768196/acastro_20200818_1777_epicApple_0002.0.jpg",
  "description": "Most \"but not all\" are QA testers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}