{
  "title": "Escape Academy captures the fun of escape puzzles, without the cramped rooms",
  "url": "https://www.theverge.com/2022/5/18/23123797/escape-academy-escape-room-coin-crew-steam-cerebral-puzzle-showcase",
  "date": "2022-05-18T16:01:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/E-1r0mj4YNK_LMyXuQysm1F0f08=/0x0:1620x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883439/escapeacaddemy.0.png\" />        <figcaption>Coin Crew Games</figcaption>    </figure>  <p id=\"8Fmgo7\">Friends, it’s been exceedingly difficult to naturally produce enough feel good brain juice to function as a normal person. Even the things that I normally take so much joy in, like video games, are just not hitting like they used to for <a href=\"https://www.nytimes.com/2022/05/17/us/baby-formula-shortage-tennessee-hospitalized.html\">so many</a> <a href=\"https://www.nytimes.com/2022/05/17/us/baby-formula-shortage-tennessee-hospitalized.html\">reasons</a>. But after spending some time with <a href=\"https://store.steampowered.com/app/1812090/Escape_Academy/\"><em>Escape Academy</em></a> by playing a little and talking to the developers, I think I have the serotonin delivery system I’ve sorely needed. </p><p id=\"yV4EEQ\"><em>Escape Academy</em> by Coin Crew Games is a narrative puzzle game formatted to look and feel like real-life escape rooms. You play as an escape room enthusiast invited to a secretive academy where students can train to become the best Escapist. The people at Coin Crew games actually worked on real in-person escape rooms and, during a bout of pandemic-induced cabin fever, went looking for games that recreated that experience. But, they didn’t really find the kind of games that scratched that particular itch, so they decided to make their own back scratcher.</p><p id=\"Owsveu\">It can be difficult to take something originally designed for a physical space into a digital one. There will always be some part that can’t really be faithfully translated from real to not-real and it’s our brain’s job to suspend disbelief enough to bridge that gap. One of the most attractive things about <em>Escape Academy</em> is that it feels like an almost lossless translation of the escape room experience. I didn’t feel like I was missing something or was constrained by the fact that I wasn’t in a physical space. I remember feeling the same deeply thrilling anxiety glancing at the running timer every so often while I was wending my way through an imposing-looking room as I once had in real rooms with real people. </p><p id=\"CRW6Cj\">The <em>Ace Attorney </em>series of puzzle games I’ve enjoyed the most, but one of my biggest pet peeves, <a href=\"https://www.theverge.com/22597736/the-great-ace-attorney-chronicles-review-switch-ps4-steam\">especially the most recent release</a>, is that sometimes solutions to questions or puzzles require huge leaps in logic. It’s a lot of A+B=D and you have no idea how the game’s designers got there.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BGBFIlqYOJ0SdkThxrC9sxD1sEE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23535423/escapeacaddemy2.png\">      <cite>Coin Crew Games</cite>      <figcaption>One of my favorite puzzles in the demo.</figcaption>  </figure><p id=\"rr66l3\">But all of the puzzles I played in <em>Escape Academy</em> made sense. They weren’t too easy but nor were they so convoluted that I could not follow the game’s logic to get to the correct answer or figure out the next step in the puzzle chain as is often required in <em>Ace Attorney</em>. </p><p id=\"oZsZVG\">I love that kind of middle-of-the-road approach to puzzling because it makes you feel like a brain god. Yes, I followed the not-too-hard, not-too-simple clues to correctly solve this puzzle. I am the Mind Queen, pay homage. That kind of good feelings brain jolt is priceless and hard to come by, especially in a culture of game design that seems to delight in having <a href=\"https://www.thegamer.com/aloy-talks-too-much-horizon-zero-dawn-days-gone-tsushima-open-world/\">the player character voice what you need to do immediately</a> as you register something needs to be done. (I’m looking directly at <em><strong>you</strong></em><em> </em><a href=\"https://www.theverge.com/22929852/horizon-forbidden-west-ps5-review\"><em>Horizon Forbidden West</em></a>.) </p><p id=\"UWP3Xf\">While <em>Escape Academy</em>’s designers trust the player’s smarts enough to let them figure it out for themselves, there’s also a robust hint system that pushes players in the right direction without outright revealing solutions. I was actually a little miffed because it’s really easy to accidentally hit the “help me” button when I didn’t need it thereby dinging my score. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tWtAL5jF-QPE_FVIOy5N-sYeKfw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23535450/escapeacaddemy1.png\">      <cite>Coin Crew Games</cite>      <figcaption>I never noticed the keyhole until just now.</figcaption>  </figure><p id=\"sKZlTB\">Another peeve about <em>Ace Attorney</em> is that those games will require you to walk through every single step in a puzzle’s solution even if you’ve already figured out the answer. It’s like if I know the answer to 3x2+3=9, the game will still require me to do the work of multiplying three by two and then adding three again instead of just being able to answer nine. It’s slow, and frustrating and sometimes, at least in <em>Ace Attorney</em>, the game will make you take <em>even more</em> extraneous steps to arrive at an answer you’ve already figured out.</p><p id=\"e6MFpZ\"><em>Escape Academy</em> does not care if you can show the work, it cares that you know the answer. In my playthrough, there were puzzles I simply didn’t complete or clues I could completely ignore because the game let me skip to the answer. I appreciate that kind of “trust the player” frictionless puzzle solving. </p><p id=\"vF8SQi\">I’m the kind of person who knows they’re having fun when they start muttering to themselves. I’m a box ticker, I get extreme satisfaction ticking metaphorical boxes and I recognized that as I talked myself through the puzzles, “I need to transpose this map upside down. A move up is a move down, a move left is right,” I was ticking off boxes. These puzzles will absolutely require some pen and paper and having the tactile sensation of writing things down and crossing things off as you solve puzzles enhances the game’s already deeply satisfying gameplay loop.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/so-r0gkD_kce8g4J2NYjtWXofMw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23535482/escapeacaddemy3.png\">      <cite>Coin Crew Games</cite>      <figcaption>Escape Academy also offers some intriguing storytelling in addition to puzzle solving.</figcaption>  </figure><p id=\"mxEADE\">Escape rooms, once the pride of strip malls and the capstone to any corporate retreat, have kinda fallen out of favor recently. They had a brief, shining moment in the late teens before the pandemic made intimate gatherings in which folks expelled a lot of breath yelling puzzle solutions at each other in cramped spaces an extremely unattractive option. And even as such activities slowly make their way back into the zeitgeist — for good or ill — I don’t think the escape room industry is gonna return to its pre-pandemic glory. But the idea of escape rooms is still really seductive, which makes <em>Escape Academy</em> an early favorite for one of the most charming and timely entries in the 2022 gaming calendar.</p><p id=\"Zzn1Be\"><em>Escape Academy </em>releases on June 28th on Xbox, Xbox Game Pass, PlayStation, and PC. But! If you’re like me and in need of good brain scratchers like <em>Escape Academy</em> and more <em>right now</em>, it will be available to try from today until May 23rd as a part of <a href=\"https://www.cerebralpuzzleshowcase.com/\">Steam’s Cerebral Puzzle Showcase</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WSFJL8g3i0KBrVziB2WVH03uEiI=/0x70:1920x1075/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23535168/escapeacaddemy.png",
  "description": "Good puzzle game makes brain go, \"Brrrr!\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}