{
  "title": "Etsy hits sellers with 30 percent transaction fee increase",
  "url": "https://www.theverge.com/2022/2/24/22949707/etsy-sellers-transaction-fee-increase",
  "date": "2022-02-24T22:51:32.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"Etsy stock\" src=\"https://cdn.vox-cdn.com/thumbor/q0ZeobB84eE_FGN9kSrRNniZ3SY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70546773/etsy4_2040.0.0.jpg\" />        <figcaption>Photo: Chris Welch / The Verge</figcaption>    </figure>  <p id=\"BDuNGU\">Following a record-breaking 2021 fourth quarter, Etsy is raising seller transaction fees from 5 percent to 6.5 percent, the company announced today. In a <a href=\"https://s22.q4cdn.com/941741262/files/doc_financials/2021/q4/Exhibit-99.1-12.31.2021.pdf\">report </a>to investors today, the company says the 30 percent increase will take effect beginning on April 11th. The transaction fee is the percentage of the total order amount Etsy charges when a seller makes a sale. </p><p id=\"9g0MIG\">The added expense to sellers comes as Etsy announced a fourth-quarter revenue of $717.1 million, which the company attributes to a strong holiday shopping season. Etsy added 10 million new buyers in the fourth quarter of 2021, bringing the number of active buyers to a record 90 million. Stock prices jumped more than 15 percent after market close on Thursday following the report to investors.</p><p id=\"8CGKzo\">“We have demonstrated our ability to make improvements that directly translate into more sales for our sellers, as evidenced by record sales per seller in 2021,” Etsy CEO Josh Silverman says in the report. “Our new transaction fee will enable us to invest in key areas like marketing and support to further extend our strong momentum.”</p><p id=\"dN2X51\">Etsy says the increase in fees will mostly pay for “marketing, seller tools, and creating world-class customer experiences.” But past changes to features for sellers — like the controversial advertising program — have <a href=\"https://www.theverge.com/2020/2/26/21155193/etsy-advertising-program-angers-sellers-cut-of-sales\">not gone over well</a> with sellers, some of whom are unable to opt-out. </p><p id=\"EPpxvE\">Higher seller fees are likely to upset merchants on the platform, who for years have <a href=\"https://www.theverge.com/2020/3/13/21173710/etsy-seller-complaints-advertising-program-revenue-growth-sales\">complained</a> about changes at Etsy as the company grows. The last time Etsy raised transaction fees was in 2018, when it went from 3.5 percent to the current 5 percent, and sellers also pay $0.20 for listing an item, plus payment processing fees. </p><p id=\"5x863W\"></p><p id=\"QQrFhW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/982kXSM8XI_iAVGXG0YBcHBgHCc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3612906/etsy4_2040.0.jpg",
  "description": "Etsy last raised transaction fees in 2018 from 3.5 percent.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}