{
  "title": "EU and UK launch antitrust investigation into Google and Meta’s adtech dealings",
  "url": "https://www.theverge.com/2022/3/11/22972384/eu-uk-antitrust-investigation-google-meta-facebook-jedi-blue-adtech-deal",
  "date": "2022-03-11T10:15:16.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DRtNYa7QNdmBeu-5uytPIckxrEQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70607773/acastro_201005_1777_googleAntiTrust_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"a5eWIy\">Google and Meta are being investigated by antitrust regulators in the EU and UK over “Jedi Blue” — a deal between the two firms that critics say allowed them to block smaller tech companies from gaining a foothold in the online ad market. </p><p id=\"4DsEhZ\">In a <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_1703\">press statement</a>, the European Commission said it was concerned that the September 2018 agreement “may form part of efforts to exclude ad tech services competing with Google’s Open Bidding programme, and therefore restrict or distort competition in markets for online display advertising.” It’s therefore opening a formal antitrust investigation. </p><p id=\"bTAeUE\">The UK’s Competition Market Authority said it was also <a href=\"https://www.gov.uk/government/news/cma-investigates-google-and-meta-over-ad-tech-concerns\">investigating the deal</a>, with CMA chief Andrea Coscelli stating: “We’re concerned that Google may have teamed up with Meta to put obstacles in the way of competitors who provide important online display advertising services to publishers.”</p><div class=\"c-float-right\"><aside id=\"qILaU6\"><q>Jedi Blue is already under investigation in the US</q></aside></div><p id=\"Ndk1Ke\">The Jedi Blue deal is already <a href=\"https://nymag.com/intelligencer/2021/10/inside-jedi-blue-facebooks-secret-deal-with-google.html\">under investigation in the US</a>, where 15 state attorneys general have filed lawsuits against the two companies. These multiple legal fronts have led to a slow trickle of details about both the deal and prosecutors’ accusations. Court filings allege, for example, that Jedi Blue was reviewed and approved <a href=\"https://www.theverge.com/2022/1/14/22883987/mark-zuckerberg-sundar-pichai-ad-collusion-tx-ag-paxton-complaint\">by top executives</a> at Google and Meta, including Sundar Pichai, Sheryl Sandberg, and Mark Zuckerberg. </p><p id=\"DiDyM1\">The origins of Jedi Blue are usually traced back to a decision by Meta (then Facebook) in 2017 to support an adtech system that would rival Google’s. Lawsuits in the US claim Meta dropped its support of the technology in 2018 after Google offered the company preferential access to its bidding system for online ads. As part of the deal, Meta got to be first in the queue when buying ad real estate from Google, and afterwards stopped investment in rival adtech systems.</p><p id=\"69wcr5\">It’s a somewhat complicated backstory, but the upshot — according to US prosecutors — is that the two companies worked together to save each other money and block out rivals. </p><div class=\"c-float-right\"><aside id=\"3ssDmK\"><q>“We have not concluded yet if it’s a Google thing alone or if they were in it together”</q></aside></div><p id=\"9zw2AV\">Although regulators are investigating both Meta and Google, the European Commission says it’s possible that only Google deserves the blame. Margrethe Vestager, the EU’s competition chief, <a href=\"https://www.ft.com/content/5e9540ea-cd7e-4bbb-9fe5-2e4251118064\">told <em>The</em> <em>Financial Times</em></a><em>: “</em>We have not concluded yet if it’s a Google thing alone or if they were in it together. It’s not a given that Meta was conscious of the effects of the deal and that’s what we have to investigate.”</p><p id=\"jyXcQx\">Meta and Google <a href=\"https://www.reuters.com/technology/facebook-google-defend-advertising-deal-investigated-by-eu-uk-watchdogs-2022-03-11/\">told <em>Reuters</em></a> that the EU and UK investigations were misguided. </p><p id=\"v4Nk4V\">Google said in a statement: “The allegations made about this agreement are false. This is a publicly documented, procompetitive agreement that enables Facebook Audience Network (FAN) to participate in our Open Bidding program, along with dozens of other companies.”</p><p id=\"zE1jKB\">Meta subsidiary Facebook said in a statement: “Meta’s non-exclusive bidding agreement with Google and the similar agreements we have with other bidding platforms, have helped to increase competition for ad placements.”</p><p id=\"fjmKdE\">If Meta or Google are found to be in breach of EU competition law, they could be fined up to 10 percent of their global annual revenue. However, the investigation is likely to take years to reach a conclusion, and will give both firms plenty of opportunities to appeal any rulings. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FHowdxcJPhQZgeW6733HUvOgA8U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21938024/acastro_201005_1777_googleAntiTrust_0001.0.jpg",
  "description": "Another front in the antitrust wars",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}