{
  "title": "EU closes airspace to Russian aircraft and blocks state-backed media",
  "url": "https://www.theverge.com/2022/2/27/22953563/eu-ban-russia-aircraft-state-backed-media-ukraine-sanctions",
  "date": "2022-02-27T18:09:51.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"BELGIUM-EU-UKRAINE-RUSSIA-CONFLICT-POLITICS\" src=\"https://cdn.vox-cdn.com/thumbor/-9sXaDZhzKB9hVMpfQuTZZyqrgE=/0x0:5106x3404/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70557153/1238808491.0.jpg\" />        <figcaption><em>Von der Leyen announced a ban on the state-backed RT and Sputnik networks in the EU</em>. | Photo by STEPHANIE LECOCQ/POOL/AFP via Getty Images</figcaption>    </figure>  <p id=\"rEH2zM\">European Commission President Ursula von der Leyen <a href=\"https://twitter.com/vonderleyen/status/1497973334847414278\">announced on Twitter</a> that the European Union will ban Russian state-run media outlets from airing in the EU, as well as bar Russian aircraft from flying in EU airspace.</p><div id=\"dn9UvO\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">Second, we will ban the Kremlin’s media machine in the EU.<br> <br>The state-owned Russia Today and Sputnik, and their subsidiaries,<br>will no longer be able to spread their lies to justify Putin’s war.<br> <br>We are developing tools to ban their toxic and harmful disinformation in Europe. <a href=\"https://t.co/7RcPEn6E14\">pic.twitter.com/7RcPEn6E14</a></p>— Ursula von der Leyen (@vonderleyen) <a href=\"https://twitter.com/vonderleyen/status/1497973706831929348?ref_src=twsrc%5Etfw\">February 27, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"p4t2SV\">Von der Leyen states that RT and Sputnik — both state-backed Russian networks — along with their subsidies “will no longer be able to spread their lies to justify Putin’s war.” She also says the Commission is working on tools “to ban their toxic and harmful disinformation in Europe,” although there still aren’t any details as to what this may entail.</p><p id=\"6ONSPU\">The EU will also no longer allow Russian aircraft, including private jets owned by oligarchs, in EU airspace, taking out a number of flights that land in or travel through Europe. Several EU countries, including Germany, Spain, France, Denmark, and Italy already <a href=\"https://www.bbc.com/news/world-europe-60539303\">blocked Russia out of their airspace</a> ahead of this announcement.</p><p id=\"fYvWzu\">It remains unclear how the EU will go about banning Russian networks entirely, outside of blocking cable networks and satellite TV services from airing them. RT and Sputnik both have active YouTube channels, and RT makes some of its episodes available on its website. YouTube has <a href=\"https://www.theverge.com/2022/2/26/22952439/youtube-bans-ads-rt-russia-channels-google-ukraine\">banned Russian state-backed channels from monetizing their content</a> on the platform, but has only restricted access to their videos in Ukraine. Facebook is also targeting Russian networks by <a href=\"https://www.theverge.com/2022/2/26/22952038/facebook-russian-state-media-blocked-advertising-monetization-ukraine-conflict\">banning ads from state media</a>, while <a href=\"https://www.theverge.com/2022/2/26/22952128/twitter-pauses-ads-ukraine-russia-conflict\">Twitter has paused ads entirely</a> in Russia and Ukraine.</p><p id=\"TIFjZl\"> In addition to putting <a href=\"https://www.cnn.com/2022/02/25/business/list-global-sanctions-russia-ukraine-war-intl-hnk/index.html\">a number of sanctions on Russia</a> after its unprovoked attack on Ukraine, the US and Europe announced plans to <a href=\"https://www.theverge.com/2022/2/26/22949156/russia-expelled-swift-ukraine-sanctions\">ban select Russian banks from SWIFT</a>, an international payment network, on Saturday evening.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8_EB51HUQnjKvCcJ_3miwXMNG-o=/0x413:5106x3086/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23275527/1238808491.jpg",
  "description": "Russian aircraft can no longer fly above or land in the EU.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}