{
  "title": "EU outlines €43 billion plan to fix Europe’s chip shortage",
  "url": "https://www.theverge.com/2022/2/9/22925010/eu-chips-act-plan-43-billion-funding-shortage-supply-chain",
  "date": "2022-02-09T11:22:27.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"Semiconductor Manufacturing In Jiashan County\" src=\"https://cdn.vox-cdn.com/thumbor/fwtXVQNnp5HS6zJiIr47X5uB6rU=/0x0:5184x3456/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70487371/1320074520.0.jpg\" />        <figcaption>Photo by Guo Junfeng/VCG via Getty Images</figcaption>    </figure>  <p id=\"NokO1t\">The European Union has outlined an ambitious new industrial policy that aims to make the bloc a significant player in the global semiconductor industry. </p><p id=\"t4oTH1\">The European Chips Act, <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/IP_22_729\">adopted this week</a> by the EU Commission, bundles together €43 billion ($49 billion) in public and private funding for the sector, with an end-goal of doubling the EU’s share of global chip production from 9 percent to 20 percent by 2030. </p><p id=\"y15bJl\">For years, the EU has wanted to increase its leadership in the development and fabrication of semiconductor chips (it unveiled a similar funding package <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/IP_13_455\">in 2013</a>), but the global supply chain crisis triggered by the pandemic has sharpened the urgency of these plans. </p><div class=\"c-float-right\"><aside id=\"21P5vv\"><q>“the global shortage of chips has really slowed down our recovery”</q></aside></div><p id=\"jtLadV\">“You all know that the global shortage of chips has really slowed down our recovery,” said president of the European Commission, Ursula von der Leyen, during the announcement of the Chips Act. “We have seen that whole production lines came to a standstill, for example with cars. While the demand was increasing, we could not deliver as needed because of the lack of chips. So this European Chips Act comes absolutely at the right time.”</p><p id=\"MBKJeF\">The EU isn’t the only major economic power to realize the centrality of chips to future economic growth. Countries around the world have been outlining investment plans for the industry, and just last week the House of Representatives <a href=\"https://www.theverge.com/2022/2/4/22917942/competes-act-passes-house-usica-chips-act-funding\">approved $52 billion of federal funding</a> for the United States’ own semiconductor industry, with $39 billion of this earmarked for the development of new fabrication plants or fabs. </p><p id=\"6Yt9C8\">In comparison with the US, the EU’s funding looks significantly weaker. Although the top-line figures are similar, the EU’s €43 billion budget includes €30 billion in previously announced investments, while direct funding from the bloc constitutes <a href=\"https://www.bloomberg.com/news/articles/2022-02-07/eu-s-chips-act-to-include-less-than-15-in-direct-funding\">less than 15 percent</a> of the total. The majority of the money is instead expected to be delivered by member states, whose lawmakers have yet to approve the act. Political wrangling and national concerns may then slow down how the proposed funding reaches projects that need it.</p><div class=\"c-float-right\"><aside id=\"SAdh7V\"><q>The EU may have trouble attracting manufacturers</q></aside></div><p id=\"D2lQ8w\">Another difficulty will be simply attracting manufacturers. Currently, Taiwanese firm TSMC dominates the semiconductor industry, generating <a href=\"https://www.cnbc.com/2021/03/16/2-charts-show-how-much-the-world-depends-on-taiwan-for-semiconductors.html\">more than half of global revenue</a>. And although there have been reports TSMC is considering <a href=\"https://www.electronicsweekly.com/news/business/785461-2021-12/\">setting up a fab in Germany</a>, it’s yet to announce any definite European investments. Meanwhile, the company has confirmed it’s <a href=\"https://www.theverge.com/2022/1/13/22881576/tsmc-capital-investment-2022-chip-manufacturer-demand-increase\">building new plants</a> in the United States and Japan. </p><p id=\"u02NR6\">Any plans to boost EU’s chip output will also be slow to take root, and won’t mitigate the industry’s current disruptions, which are expected to continue at least through the end of the year. But the issue of “digital sovereignty” — maintaining technological independence from global supply chains — will be a defining interest for decades to come. </p><p id=\"dloNcy\">As von der Leyen said: “It should be clear that no country – and even no continent – can be entirely self-sufficient. This is impossible. Europe will always work to keep global markets open and to keep them connected. This is in the world’s interest; it is in our own interest, too. But what we need to tackle are the bottlenecks that slow down our growth, as we are just experiencing it right now.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EBBI_bR7O9PJQyH4k97ZFivXGow=/0x371:5184x3085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229057/1320074520.jpg",
  "description": "The Chips act takes center stage",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}