{
  "title": "EU Parliament backs off plans to phase out energy-hungry cryptocurrencies ",
  "url": "https://www.theverge.com/2022/3/14/22977132/bitcoin-european-union-parliament-ban-proof-of-work-cryptocurrencies",
  "date": "2022-03-14T23:40:25.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Inside Bitmain Technologies Ltd.’s Bitcoin Mine\" src=\"https://cdn.vox-cdn.com/thumbor/NM6sgWC1_xCgqOVzcI580rdQLtM=/1x0:4000x2666/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70623091/834392892.0.jpg\" />        <figcaption>Power cords for bitcoin mining machines are plugged into electrical outlets at a mining facility operated by Bitmain Technologies Ltd. in Ordos, Inner Mongolia, China, on Friday, Aug. 11, 2017.&nbsp; | Qilai Shen/Bloomberg via Getty Images</figcaption>    </figure>  <p id=\"dBC31g\">A de facto ban on Bitcoin and Ether died in the European Union Parliament today. The controversial proposal attempted to clean up pollution from the most energy-inefficient cryptocurrencies. But even though the proposal failed, cryptocurrencies are still likely to face scrutiny from policymakers as the EU tries to tackle twin climate and energy crises. Getting rid of their pollution has become a global game of whack-a-mole since China <a href=\"https://www.theverge.com/2021/9/24/22691472/china-central-bank-cryptocurrency-illegal-bitcoin\">banned cryptocurrencies last year</a>.</p><p id=\"9SNkLN\">The EU Parliament’s committee on economic and monetary affairs <a href=\"https://www.europarl.europa.eu/news/en/press-room/20220309IPR25162/cryptocurrencies-in-the-eu-new-rules-to-boost-benefits-and-curb-threats\">voted</a> on Monday<strong> </strong>to move forward with a legislative <a href=\"https://oeil.secure.europarl.europa.eu/oeil/popups/ficheprocedure.do?reference=2020/0265(COD)&amp;l=en\">framework</a> for regulating digital assets. In the process, it decided to drop a proposed rule in the framework that would have prohibited people in the EU from using an energy-hungry process to generate cryptocurrencies including Bitcoin.   </p><div class=\"c-float-right\"><aside id=\"txOmDN\"><q>A global game of whack-a-mole </q></aside></div><p id=\"8Fb8in\">Cryptocurrencies like Bitcoin and Ether have stirred up alarm over how much electricity they require — and the amount of<strong> </strong>planet-heating greenhouse gas emissions they generate as a result. The European Union is already grappling with an energy crisis that sent electricity rates soaring over the past year, and has become even more complex as the bloc tries to <a href=\"https://www.theverge.com/2022/3/8/22967244/european-union-russia-clean-energy-transition-gas\">wean itself off gas</a> supplies from Russia. </p><p id=\"yU8ooI\">The Bitcoin network uses more electricity in a year than Norway, and would rank <a href=\"https://ccaf.io/cbeci/index/comparisons\">27th</a> in the world for its annual electricity use if it was a country itself. Most of that electricity is used in a deliberately energy-inefficient process for verifying transactions <a href=\"https://www.theverge.com/22654785/blockchain-explained-cryptocurrency-what-is-stake-nft\">called “proof of work.”</a> To earn new tokens and verify transactions, Bitcoin miners use special computers to solve complex puzzles. Those puzzles, which are increasingly hard to solve, essentially bake energy inefficiency into the blockchain.</p><p id=\"srYod2\">Since it’s the puzzle-solving that burns through so much energy, that’s what the EU parliament considered banning. Previous versions of the framework included language that would have phased out proof of work in favor of less energy-intensive verification methods, according to <a href=\"https://www.coindesk.com/policy/2022/03/14/proposal-limiting-proof-of-work-is-rejected-in-eu-parliament-committee-vote-sources/\"><em>CoinDesk</em></a>.<strong> </strong>That sparked <a href=\"https://twitter.com/davidmarcus/status/1502678036109430789\">outrage</a> from the crypto industry, who saw it as a killer blow to Bitcoin. The rule targeting proof of work was ultimately removed from the framework today, a press officer for parliament confirmed with <em>The Verge</em> in an email. Instead, it asked the European Commission to weigh in separately on the environmental impact of cryptocurrency mining is as it works to <a href=\"https://ec.europa.eu/info/business-economy-euro/banking-and-finance/sustainable-finance/eu-taxonomy-sustainable-activities_en\">define what can be classified as a “sustainable”</a> investment. </p><p id=\"E32rc0\">The crypto industry has been trying to solve its environmental problem for a long time. For years, the Ethereum network has planned — and delayed — a move from proof of work to a different process called proof of stake that nixes puzzle-solving. Proof of stake uses a lot less energy, and is considered more environmentally friendly. Such a move would solve the energy efficiency problem for Bitcoin, too. But no one really expects Bitcoin to follow suit, since all the miners on the network would need to agree to eat losses from dumping the hardware they’ve already invested in to mine Bitcoin. Some proponents of proof of work also argue that it’s the most secure mechanism for maintaining the integrity of the blockchain. Without buy-in from miners, any ban on proof-of-work is essentially also a ban on Bitcoin. </p><div class=\"c-float-right\"><aside id=\"2XYo1D\"><q>Banning cryptocurrencies hasn’t proved to be an effective way of cutting down their greenhouse gas emissions. </q></aside></div><p id=\"8PTCyz\">Banning cryptocurrencies, however, hasn’t proved to be an effective way of cutting down their greenhouse gas emissions. China used to host the vast majority of cryptocurrency miners, until it <a href=\"https://www.theverge.com/2021/9/30/22702543/bitcoin-carbon-footprint-emissions-china\">kicked them all out</a> last year. Since then, Bitcoin’s planet-heating <a href=\"https://www.theverge.com/2022/2/28/22954859/bitcoin-mining-pollution-china-ban\">pollution has likely grown</a>, according to research published last month. Miners who used to have access to abundant hydropower in China replaced it with more gas and coal in the US and Kazakhstan, the world’s newest hubs for Bitcoin mining.</p><p id=\"GsFJTP\">To date, there’s not a whole lot of energy-intensive cryptocurrency mining going down in the EU. Ireland and Germany have the most, with just <a href=\"https://ccaf.io/cbeci/mining_map\">under five percent each</a> of the world’s share of bitcoin mining, according to the <a href=\"https://ccaf.io/cbeci/mining_map\">Cambridge Centre for Alternative Finance</a>. Those numbers are “likely significantly inflated,” Cambridge says, because of VPNs.</p><p id=\"mJeqKq\">The EU is racing to transform the power grid to meet climate and security goals, and energy-hungry blockchains<strong> </strong>could potentially make that tougher to accomplish. The EU set a <a href=\"https://ec.europa.eu/clima/eu-action/european-green-deal/european-climate-law_en\">target</a> last year of cutting its greenhouse gas emissions by more than half by the end of the decade. Russia’s invasion of Ukraine made the transition to clean energy all the more urgent, since Russia supplies the EU with <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/qanda_22_1512\">nearly half</a> of its gas imports. <a href=\"https://www.theverge.com/2022/3/8/22967244/european-union-russia-clean-energy-transition-gas\">New measures</a> set out by the European Union last week would drastically cut reliance on Russian gas in coming years — a plan that depends a lot on improving energy efficiency.</p><p id=\"IQCpz6\">The legislative framework voted on today by EU parliament isn’t yet set in stone. It’ll go to “trilogue” negotiations next, where the EU parliament, commission, and council will have to come to an agreement before the proposal can become law. There’s a <a href=\"https://twitter.com/paddi_hansen/status/1503385935056183303\">chance</a> a de-facto ban on proof of work could be brought up again during those negotiations, according to Patrick Hansen, head of strategy and business development at blockchain startup Unstoppable Finance.</p><p id=\"3cSfzP\">Members of the European Parliament today also asked the European Commission to consider where cryptocurrencies running on proof of work fit<strong> </strong>as it develops its <a href=\"https://ec.europa.eu/info/business-economy-euro/banking-and-finance/sustainable-finance/eu-taxonomy-sustainable-activities_en\">guidelines</a> for sustainable investments. There have already been <a href=\"https://www.theverge.com/2022/2/2/22914195/eu-nuclear-energy-gas-sustainable-climate-investment\">heated arguments</a> in that process over whether to classify some nuclear energy and gas-fired plants as sustainable. Now it seems that the climate controversy over Bitcoin could heat things up again.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8bE-uBwwu-eXg-CcB6cOqcAGVDw=/0x286:4000x2380/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23315944/834392892.jpg",
  "description": "It was a close call for Bitcoin",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}