{
  "title": "EU targets Big Tech with sweeping new antitrust legislation",
  "url": "https://www.theverge.com/2022/3/24/22994234/eu-antitrust-legislation-dma-digital-markets-act-details",
  "date": "2022-03-24T23:18:57.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FwatZt2KeB2pObSqNiyp2s0OyGw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70669017/acastro_1800724_1777_EU_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"On3N0W\">The EU <a href=\"https://www.europarl.europa.eu/news/en/press-room/20220315IPR25504/deal-on-digital-markets-act-ensuring-fair-competition-and-more-choice-for-users\">has unveiled its biggest ever legislative effort</a> to balance competition in the tech world. The new Digital Markets Act, or DMA, is intended to rein in the power of the largest tech corporations and allow smaller entities to compete with the mostly US-based firms. So far, the EU has tackled antitrust issues on a case-by-case basis, but the DMA is intended to introduce sweeping reforms that will address systemic issues in the whole market. </p><p id=\"bSZuLe\">Today’s announcement targets interoperability of messaging apps like WhatsApp, Facebook Messenger, and iMessage, with the EU saying that vendors will have to “open up and interoperate with smaller messaging platforms, if they so request.” The EU says that this should give users more choice in how they send messages, without having to worry about what platform the recipient is on. There’s also a requirement that users should be able to “freely choose their browser, virtual assistants or search engines.”</p><div class=\"c-float-right\"><aside id=\"eA2Ls4\"><q>The stated goal of the DMA is to make tech open and competitive</q></aside></div><p id=\"MCw2Rw\">The legislation hasn’t passed yet — the EU says the language has to be finalized and checked, at which point it’ll have to be approved by Parliament and Council. We expect to hear more about the details during a press conference broadcast from Brussels on Friday morning at 8:45AM Central European Time (that’s 3:45AM ET).</p><p id=\"lzW0jL\">The DMA could force new obligations on companies deemed to be “gatekeepers” — a category defined by the legislation as firms with a market capitalization of at least €75 billion ($82 billion); at least 45,000 active users; and a “platform” like an app or social network. Companies covered by this classification include well-known tech giants like Google, Microsoft, Meta, Amazon, and Apple, but also smaller entities like Booking.com. </p><div class=\"c-float-right\"><div id=\"d9P6Fr\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We have a deal on <a href=\"https://twitter.com/hashtag/DMA?src=hash&amp;ref_src=twsrc%5Etfw\">#DMA</a>! Last trilogue with <a href=\"https://twitter.com/Europarl_EN?ref_src=twsrc%5Etfw\">@Europarl_EN</a> and <a href=\"https://twitter.com/EUCouncil?ref_src=twsrc%5Etfw\">@EUCouncil</a> ended with a good, strong agreement. <br>Tune into our press conference tomorrow 8:45   <a href=\"https://t.co/krHHsOqG8u\">pic.twitter.com/krHHsOqG8u</a></p>— Margrethe Vestager (@vestager) <a href=\"https://twitter.com/vestager/status/1507119012328710156?ref_src=twsrc%5Etfw\">March 24, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"TN7fnc\">If the “gatekeepers” don’t follow the rules, then the financial penalties could be steep: “the Commission can impose fines of up to 10 percent of its total worldwide turnover in the preceding financial year, and 20 percent in case of repeated infringements. In case of systematic infringements, the Commission may ban them from acquiring other companies for a certain time.”</p><p id=\"BbvmzT\">As the EU’s Commissioner for Competition, Margrethe Vestager, <a href=\"https://www.theverge.com/22981261/margrethe-vestager-decoder-antitrust-eu-apple-facebook-google-jedi-blue\">told <em>The Verge</em> last week</a>, the aim is for the DMA to make the tech sector “open and contestable.”</p><p id=\"MjSvZt\">“So it depends on your ideas, your work ethics, your ability to attract capital, whether you’ll be successful with your customers or not,” said Vestager. “And unfortunately, because of the systemic nature of behavior, that’s not necessarily the case today.”</p><div id=\"v6mkJ9\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP1439221250\" width=\"100%\"></iframe></div><p id=\"oYqn15\">The DMA is broad in scope and intended to enable a range of future antitrust action, but also contains a number of specific demands for tech companies. These include:</p><ul><li id=\"ZJmCzZ\"><strong>Interoperability</strong>. Gatekeepers should allow their platforms to work with similar services from smaller third-parties. Exactly how this will be interpreted isn’t yet clear, but it could mean letting users on large messaging platforms like WhatsApp contact users on other, platforms. </li><li id=\"Lhlqhe\"><strong>The right to uninstall</strong>. Consumers are to be given more choice over software and services, particularly in mobile operating systems like iOS and Android. They should be able to uninstall any preloaded software, and be giving a choice when setting up a new device what service they want to use for applications like email and web browsing. </li><li id=\"Z0WxAh\"><strong>Data access</strong>. Businesses should be able to access data they generate for larger platforms. This would mean, for example, letting companies who sell goods on platforms like Amazon access Amazon’s analytics about their performance. </li><li id=\"GovRGw\"><strong>Advertising transparency</strong>. If a company buys adverts on Facebook, for example, they should be given the tools to independently verify the reach of their ads. </li><li id=\"mrJXQC\"><strong>An end to self-preferencing</strong>. Companies can’t use their platforms to put their products first. This means Google, for example, can’t put its shopping service at the top of its search results unless there is some sort of competitive tender for that spot. </li></ul><p id=\"fPuN4p\">If these demands sound familiar it should be no surprise. The DMA essentially gathers together a number of antitrust fights that the EU has been waging over the past decade, bundling it into a single legislative act and strengthening the power of lawmakers to enforce these terms. So, for example, you can see how the DMA’s focus on data access is tied to the EU’s past accusations that Amazon uses its analytics to <a href=\"https://www.theverge.com/2020/11/10/21558119/amazon-european-union-antitrust-charges-competition-commission-margrethe-vestager\">gain an advantage</a> over third-party sellers who use its platform. </p><p id=\"SqOL4Q\">According <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/europe-fit-digital-age/digital-markets-act-ensuring-fair-and-open-digital-markets_en#what-will-be-the-consequences-of-non-compliance\">to the draft proposal submitted in December 2020</a>, if companies break these rules then the EU can levy fines up to 10 percent of their worldwide annual revenue, periodic penalty payments of up to 5 percent of average daily turnover, and specific “behavioral and structural remedies” — that is, changes to how their business or service works, which could include measures like divesting parts of the company.</p><p id=\"DVPrbE\">It’s this last point that may worry some tech companies, as current European antitrust efforts are often criticized for only levying small fines on tech giants without forcing changes in behavior. For example, Apple was found in breach of antitrust legislation in the Netherlands regarding third-party treatment on the App Store. Rather than make any changes to its platform, Apple has instead chosen to <a href=\"https://techcrunch.com/2022/03/21/apple-acm-nine-fines/\">pay weekly fines of €5 million</a> ($5.5 million). </p><p id=\"AI4mFf\">“This is why, in the Digital Markets Act, there is a full toolbox where the sanctions become more and more severe,” Vestager told <em>The Verge</em> last week. “The fines will increase if you do not implement changes. Eventually, in the toolbox, there’s also the tool that you can actually break up a company if no change is happening, or if you are a repeat offender.” (Presumably, this would only apply to the parts of these companies based in the EU itself.)</p><p id=\"ISgTNE\">The DMA has been in the works for years, and so has attracted plenty of criticism from big tech companies. They say the measures will stifle innovation and create unwanted complications for the average consumer. Some US lawmakers have also criticized the act, <a href=\"https://www.cnbc.com/2022/02/23/lawmakers-ask-biden-to-tell-eu-to-stop-unfairly-targeting-us-tech-companies.html\">writing a letter to President Joe Biden</a> in February saying the legislation “unfairly targets American workers by deeming certain U.S. technology companies as ‘gatekeepers’ based on deliberately discriminatory and subjective thresholds.” </p><p id=\"FEz8DT\">However, in the US as well as the EU, politicians are, in general, taking a tough stance on abuses of market power in the tech sector. President Biden has nominated vocal antitrust figures like <a href=\"https://www.theverge.com/2021/3/22/22321092/lina-khan-ftc-tech-antitrust-law-regulation-amazon\">Lina Khan</a> and <a href=\"https://www.theverge.com/2021/7/20/22585590/joe-biden-jonathan-kanter-antitrust-lina-khan-tim-wu-google\">Jonathan Kanter</a> to key government positions, and pushed forward laws like a new executive order <a href=\"https://www.theverge.com/2021/7/9/22570826/president-joe-biden-executive-order-right-to-repair\">backing the “right to repair” movement</a>. In such a political environment, proponents of the DMA should find they have a strong hand to enforce these new regulations. </p><p id=\"CK0R9D\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HNPaWHizBMbmrxunsXiSQGEuFec=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11742007/acastro_1800724_1777_EU_0001.jpg",
  "description": "The EU’s next antitrust push targets messaging platforms",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}