{
  "title": "Eufy’s Dual doorbell proves two eyes on your porch are better than one",
  "url": "https://www.theverge.com/22939350/eufy-dual-video-doorbell-review-price-release-date",
  "date": "2022-02-18T21:20:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "  <p>With dual cameras and dual motion detection, this camera catches it all — just not fast enough  </p> <p class=\"p--has-dropcap p-large-text\" id=\"na8Di8\">Innovations in video doorbells are coming hot and fast. Each new product touts a “better” way to keep an eye on that precious piece of property — your front porch. With everything from dog food to diapers, smartphones to sushi being dropped at our doorsteps, keeping an eye on that precious cargo is a top priority (seriously, if anyone messes with my sushi…).</p><p id=\"PYW1Oz\">With its newest battery-powered video doorbell, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fus.eufylife.com%2Fcollections%2Fvideo-doorbell%2Fproducts%2Fe8213181&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22939350%2Feufy-dual-video-doorbell-review-price-release-date\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the Eufy Dual</a> ($250 with a HomeBase 2 or $199 as an add-on to an existing Eufy camera system), Eufy has come up with one of the best solutions so far. </p><p id=\"zbMir9\">The Dual has two cameras, one to keep an eye on the floor — where packages often land, and one in the more traditional role up top. This fixes the problem most doorbells have: they either give you a tall, skinny view so you can see packages and people, but not much context outside that. Or, you get a wider view that offers more side-to-side context but misses out on much of the doorstep itself (and the package that’s sitting there).</p><div id=\"xuavUR\"><div data-anthem-component=\"scorecard:11054929\"></div></div><p id=\"OE9BCD\">The Dual is not the first doorbell to try this trick, but it’s the best one I’ve tested. Its downward-facing 1080p camera has a 120-degree field of view with a 16:9 aspect ratio, while the 2K camera up top can see as wide as 160 degrees using a 4:3 aspect ratio. Combined, you get two video feeds that offer you a blind-spot-free view of your porch. It also has dual motion sensing, using passive infrared to detect people and radar for distance and angle. Plus, onboard machine learning can tell you if there’s a person and /or package out there and deploy some innovative tricks to keep watch over your soon-to-be possession. </p><div class=\"c-float-right\"><aside id=\"2vl0yB\"><q>Package Live Check Assistance is a valuable feature for managing deliveries</q></aside></div><p id=\"NQEz0E\">And the best part? There are no required recurring fees. You get free local storage of video on the included HomeBase 2 (16GB provides up to 90 days of clips), free smart alerts, and the AI features are free, too. There is an option for cloud storage, should you want it (starting at $3 a month), but you don’t lose any other features if you choose not to pay, unlike almost every other video doorbell.  </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KjLCMtdN0xdjDUNADpKNw7Nm9VU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242017/jtuohy_220209_5016_0002.jpg\">      <figcaption><em>The Eufy Dual comes with a mounting plate, an angled wedge, and the Eufy HomeBase 2. This acts as the hub for processing and storing video clips.</em></figcaption>  </figure></div><p id=\"cjWBVD\">But (and there had to be a but) because it’s a battery-powered doorbell, there’s a blind spot while the camera wakes up. In testing, the camera only caught people right as they got to the porch. This is fine for a visitor but less useful for a package delivery or someone with nefarious intentions as if they’re fast, the camera will only catch them walking away. This “back-of-the-head” problem plagues a lot of battery-powered buzzers. Eufy says that adjusting the detection distance (as far as 20 feet) can help, but even at the farthest setting, I still missed the beginning of most events.</p><p id=\"I6vM0g\">The Dual’s minimal 4-times digital zoom also isn’t going to help you sleuth that license plate, and the 2K video is a little dull and muddy. The doorbell camera only works on 2.4 GHz Wi-Fi, and you have to hardwire the Eufy HomeBase to a router.</p><div id=\"u0oqmD\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Eufy Video Doorbell Dual (2K, Battery-Powered)|106028\" data-volume-uuid=\"d7817a585\" data-volume-id=\"106028\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-331\" class=\"volume-video\"></div><div class=\"caption\"><em>The Eufy Dual is a battery-powered doorbell without a pre-roll feature and, as the video illustrates, can miss the beginning of a motion event while it “wakes up.”</em></div></div><p id=\"BJDr3U\">I was also disappointed in some of the AI features — the facial recognition didn’t work at all for me (apparently because I wear glasses). The Package Guard and Loitering features — which can have the doorbell say things such as “Excuse me, can I help you,” when someone approaches your package or hangs around your porch too long — were more annoying than helpful. I did like the option to activate smart responses from the live view screen in the Eufy app — you can choose from canned messages such as “Please leave it at the door” or create your own.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0je0uHT0M-Ms-RUJFbIG2npqX7Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242029/jtuohy_220209_5016_0014.jpg\">      <figcaption><em>The Eufy’s “package” cam has LED lights and 1080p video.</em></figcaption>  </figure></div><p id=\"iDKq6E\">I also liked the Package Live Check Assistance, which frames any packages in a blue box and collects recent events around the delivery for quick viewing. It worked reliably and turned out to be a valuable feature for managing deliveries. The Uncollected Package alert, which has the doorbell check for packages at a designated time if you forgot to pick something up, is also a handy option.  </p><p id=\"soBzIb\">These are nice-to-have, not must-have features for a doorbell, though. More important are video and audio quality, speed of notifications and accessing live view, and accurate motion detection (so you aren’t bombarded with notifications). </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/50il47kHxC9K7yPyVQ28dqwRrPQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23252952/844B7D96_3959_411E_8362_CC8D35F4D519.JPG\">      <figcaption><em>There are two options for viewing the cameras: picture-in-picture, as shown, or stacked on top with a black bar running between the two feeds.</em></figcaption>  </figure></div><p id=\"QjUiMx\">The Eufy Dual does well in most of these areas. The time from tapping the notification to viewing a live feed was between 3 and 5 seconds in my testing, impressive for a battery-powered doorbell, and likely due to the local storage and video processing. I didn’t get a single false person alert in testing. But it did mistake my porch chair for a package, and it struggled to spot smaller packages such as ones in flat envelopes. </p><p id=\"JMYBMD\">The view of the front door was excellent. Although the black bar separating the two camera feeds took a little getting used to, the stacked camera view gave a better overall picture than the other option — picture-in-picture. I could see my entire porch as well as clear views of the approach to my front door and the road beyond. </p><div class=\"c-float-right\"><div id=\"uhHJ3c\"><div data-anthem-component=\"aside:11056773\"></div></div></div><p id=\"R0lODp\">The audio is very good; it uses full-duplex, meaning I could easily chat with a visitor without lag or stepping over each other. However, the video quality isn’t as good as I was hoping from a 2K camera — a little dark and slightly fuzzy. In contrast, the Ring Video Doorbell 4 offers more vibrant and colorful video. </p><p id=\"Gm5Adw\">The night vision was very good — clear and bright — making it easy to decipher faces. The bottom camera doesn’t use infrared night vision; instead, two small LED lights illuminate on motion. I liked this feature because it shed some light on the porch at night without blinding visitors. </p><p id=\"JXh8IH\">There are a lot of customization options for video, including adjusting the length of recording (8 seconds up to 120 seconds, the camera won’t record 24/7) and the re-trigger time (how fast it will start recording again after a motion event — 2 seconds is the minimum) — all of which will affect battery life. You can also tweak motion detection and sensitivity and choose to be alerted to people only or all motion (there are no animal or vehicle options). Each camera can have one activity zone to alert you to events in that area only. Notifications are customizable, with the option of a thumbnail snapshot with the notification — but in testing, that only came through about two times out of 10.</p><p id=\"lq1krj\">Overall, there are a lot of settings to tinker with in the feature-packed Eufy app. However, some of them take a bit of digging to find, and the app suffers from some poor grammar and awkward English translations. There also isn’t a timeline view you can quickly scroll through when viewing the camera feed; you have to click on a separate tab to see event videos. Handily, Eufy does have a web portal for accessing video.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Sm8o7btVNQvtin-UfUfqHBvea48=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23252955/Eufy_1.jpg\">      <figcaption><em>The Eufy doorbell uses AI features to keep watch over packages and shows recent events around the delivery. The Events tab is where you view recorded footage, and there are lots of settings to tinker with to get optimal detection.</em></figcaption>  </figure></div><p id=\"5DYbfQ\">As a battery-powered doorbell, installation is straightforward. After pairing it to the app and Eufy HomeBase, you can attach the mounting bracket (straight or angled) anywhere that suits. However, there is the option to wire it to your existing doorbell wiring, doing away with the need to charge (charging the battery requires taking the entire doorbell down), and adding the option of activating your existing doorbell chime. Usually, I would recommend getting a true wired doorbell if you have wires, but Eufy’s unique video options are good enough for me to dispense with that advice here if its features appeal to you. </p><p id=\"gxQc9M\">However, this doorbell is huge, at 6.5 inches tall, it significantly larger than the giant <a href=\"https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera\">Wyze Video Doorbell Pro I reviewed recently</a>. But Eufy has put some thought into the design, and the sloped edges and rose gold ringed camera lenses make this feel less hulking. But there’s no getting away from how big this is, and if you want something more discreet and you have doorbell wiring, there are better options (the <a href=\"https://www.theverge.com/22359973/ring-video-doorbell-pro-2-review\">Ring Video Doorbell Pro 2</a> is currently our top pick).</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/t1jYgMxvlppsimUzHa4DhlOHCR0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242027/jtuohy_220209_5016_0012.jpg\">      <figcaption><em>The button has a blue LED ring that lights up when motion is detected.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kttJumiFD73CEqDQizNY_UAlRdQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242025/jtuohy_220209_5016_0010.jpg\">      <figcaption><em>The Eufy Dual can be installed with or without doorbell wiring.</em></figcaption>  </figure></div></div></div><p id=\"gfgGRU\">That size accommodates a large battery that Eufy says lasts 3 to 6 months. Based on my experience with Eufy cameras, this will hold up. In testing, it lost under 5 percent in the four days I had it on battery, with some heavy use.  </p><p id=\"i6BGax\">The Eufy has multiple options for a chime: the HomeBase itself can act as a chime, use an existing chime if you wire the Eufy, and / or pair it with Amazon’s Echo speakers to announce when someone’s at the door. The Eufy itself also makes a noise when pressed. Integration with <a href=\"https://www.theverge.com/21538043/amazon-echo-dot-4th-gen-2020-review-alexa-smart-speaker\">Amazon Alexa</a> lets you use motion or a doorbell press as a trigger for a Routine (I set one that turned a light bulb red when there was someone at the door, and it worked reliably). It works with <a href=\"https://www.theverge.com/2019/9/9/20855944/google-nest-hub-max-review-assistant-smart-display-price-specs-features\">Google Home</a> and Alexa smart displays to pull up a live feed of your doorbell on demand, although, in testing, it was slow and unreliable with the Echo Shows but worked fine with Google Nest Hub displays. </p><p id=\"h8Tgk1\">In the realm of battery-powered doorbells, the Eufy is a strong contender. Its direct competition based on price and features is the Ring Video Doorbell 4, which doesn’t give you as good a view of your porch, but doesn’t require a separate hub. The Ring also has a pre-roll feature that uses a second camera to catch more of your visitors as they approach, plus a removable battery. But Eufy’s battery life is better. In testing, I had to recharge the Ring once a month. While the Eufy is $50 more expensive, there are no monthly fees. You’ll pay $3 a month to view recorded footage with Ring. </p><p id=\"FQzFzd\">For something cheaper with a complete view of your porch and free video recording, the <a href=\"https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera\">Wyze Video Doorbell Pro</a> is $90 and includes free video storage; plus, when wired has 3 to 6 seconds of pre-roll, but there’s a monthly fee for smart alerts and restrictions on those free recorded clips. </p><p class=\"c-end-para\" id=\"CQDgc9\">Overall, the Eufy Dual solves a specific problem and does it well. A couple of the AI features need some work, but the key ones — such as package detection — are impressive. My biggest complaint is that there’s no solution for the “back of the head problem.” With that fixed, this video buzzer would be hard to beat. </p><p id=\"zogVQM\"><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p><p id=\"o6DVTp\"></p><div><div id=\"768d3U\"><div data-anthem-component=\"aside:11055884\"></div></div></div><p id=\"O3rRQy\"><em><strong>Update February 18th, 4:20PM:</strong></em><em> Added more details on Eufy’s data management practices and local storing and processing of videos.</em></p><p id=\"x2yVeY\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GWZJZZSXizwTLjcDYV1ycTEtuAo=/0x279:2040x1347/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23242026/jtuohy_220209_5016_0011.jpg",
  "description": "Eufy’s newest battery-powered doorbell camera packs twice the punch.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}