{
  "title": "Eufy’s newest doorbell camera is also a smart lock",
  "url": "https://www.theverge.com/2022/3/2/22958437/eufy-video-smart-lock-doorbell-camera-price-release-date-specs",
  "date": "2022-03-02T19:21:29.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JRcSTa9agwyOjAxq8_Xdgj9LFaM=/0x0:1500x1000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70571060/4.0.jpg\" />        <figcaption><em>Eufy’s new Video Smart Lock could solve two smart home security problems in one.</em> | Image: Eufy Security</figcaption>    </figure>  <p id=\"0fJ2my\">Anker’s smart home brand Eufy Security today launched its latest product on Kickstarter. The <a href=\"https://www.kickstarter.com/projects/eufy-security/integrating-a-2k-cam-doorbell-and-fingerprint-smart-lock\">$399 Eufy Security Video Smart Lock</a> is a video doorbell and smart lock in one and is expected to ship to backers in May 2022, with a general release in June. The somewhat unique two-in-one security device notably uses a fingerprint reader to unlock the door and can send alerts when specific people arrive or leave using facial recognition, according to the company.</p><p id=\"pdFtXo\">An apparent amalgamation of Eufy’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fus.eufylife.com%2Fcollections%2Fall%2Fproducts%2Ft8520&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F2%2F22958437%2Feufy-video-smart-lock-doorbell-camera-price-release-date-specs\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$260 Eufy Smart Lock Touch &amp; WiFi</a> and $200 <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fus.eufylife.com%2Fcollections%2Fall%2Fproducts%2Fe82101w3&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F2%2F22958437%2Feufy-video-smart-lock-doorbell-camera-price-release-date-specs\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Eufy Video Doorbell 2K</a>, the Video Smart Lock provides a slight bargain compared to shelling out for two devices, but there are obvious issues with a dual product here. </p><p id=\"I58dXA\">For starters, most people struggle with video doorbells, often not realizing they are supposed to press the camera somewhere to alert the owner there’s someone at the door. With this product, the doorbell button is on the door lock, in the place where a key would usually go. That’s likely to cause confusion.</p><p id=\"rPr02B\">Additionally, you can’t angle a door lock to get a better view of your porch, and from my testing of the main competitor in this space — <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Flockly.com%2Fpages%2Fgetvision&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F2%2F22958437%2Feufy-video-smart-lock-doorbell-camera-price-release-date-specs\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the $399 Lockly Vision</a> — the view you get from a camera in your door lock is only good for seeing people, not packages.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/K0LOLVItjpiQk9vGhH6rsNDBgzU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283234/Eufy_Video_Smart_Lock_2.jpg\">      <cite>Image: Eufy Security</cite>      <figcaption><em>The Video Smart Lock uses a rechargeable battery and comes with a plug-in chime.</em></figcaption>  </figure><p id=\"fyHjlM\">There is also no mention of expected battery life. Powering both a door lock and security camera over Wi-Fi will be a serious drain. As with Eufy’s current door lock, the Video Smart Lock will be powered by a rechargeable 10,000mAh lithium battery pack, but how long it will last, we’ll have to wait and see.</p><p id=\"YC3H8L\">But Eufy is nothing if not innovative — its newest <a href=\"https://www.theverge.com/22939350/eufy-dual-video-doorbell-review-price-release-date\">stand-alone doorbell camera boasts two lenses for seeing up top and down below</a>. So, it’s possible the company has some tricks up its sleeves for better viewing angles and longer battery life.</p><p id=\"WUXbFA\">For now, the details available show the video doorbell portion will have a 2K camera with night vision, a 160-degree field of view, and a standard rectangular 4:3 aspect ratio, plus a speaker and microphone for two-way talk. Motion detection is enabled by both PiR and radar and Eufy’s “Human Detection” AI should filter out alerts caused by cars, trees, and animals.</p><p id=\"ctgB35\">The lock will be operated by a fingerprint reader or keypad and have app and voice control. There is no physical keyed lock as on its other lock. It can also auto-lock.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/o0NuZ67ZCXy_QM4noTH6J7BFxnI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283365/1.jpg\">      <cite>Image: Eufy Security</cite>      <figcaption><em>The Video Smart Lock has a fingerprint reader that can learn to recognize your fingerprints to unlock faster.</em></figcaption>  </figure><p id=\"vumPmW\">The company is also claiming the fingerprint recognition in this lock will be much improved over its existing option (which I’ve tested and found very reliable), recognizing your print in under 0.3 seconds and using AI to learn your family’s prints for an even faster reaction time. </p><p id=\"1RWKnH\">There is no required fee for viewing recorded footage from the doorbell; as with all Eufy’s camera products, recordings are stored locally. There’s no mention of compatibility with Eufy’s Home Base 2, so it looks like this won’t be a requirement (which it is for the Eufy Dual doorbell). The lock will presumably work directly over Wi-Fi and store footage on the device (we’ve reached out to Eufy for clarification). </p><p id=\"p1fGKW\">As a battery-powered doorbell, it won’t work with an existing doorbell chime, but Eufy is including a plug-in digital chime. </p><p id=\"arJXMr\">The company launched the product on Kickstarter today, a launch strategy it’s used in the past. The <a href=\"https://www.kickstarter.com/projects/eufy-security/integrating-a-2k-cam-doorbell-and-fingerprint-smart-lock\">super early bird special is $199</a> for the first 2,000 backers, which is half off the expected launch price of $399. It will be available on Amazon and Eufy’s own store in June.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/U2WZLW84O4PSDtWINn58D0DGfb0=/0x77:1500x862/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23283364/4.jpg",
  "description": "The $399 smart security gadget offers two features in one.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}