{
  "title": "EV ads dominated the Super Bowl, but don’t expect to buy one anytime soon",
  "url": "https://www.theverge.com/2022/2/14/22933092/super-bowl-electric-car-ad-commercials-evs-available",
  "date": "2022-02-14T17:08:28.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"The Kia EV6 pictured with a city backdrop and small robot dog in the foreground. Kia is just starting production of the car, but it won’t be available for weeks or months to come.\" src=\"https://cdn.vox-cdn.com/thumbor/bMjj_kQst4r8HCh_x7lVAmJpMec=/0x156:882x744/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507609/18383_KIA_AMERICA_S_ALL_NEW_ALL_ELECTRIC_EV6_FEATURED_IN_SUPER_BOWL_LVI_SPOT__1_.0.jpg\" />        <figcaption><em>Kia advertised its upcoming EV6 with a sad robot dog during Super Bowl LVI, but the electric car won’t be available for months to come.</em> | Image: Kia</figcaption>    </figure>  <p id=\"dwVlAf\">The Super Bowl was lousy with electric car ads this year, with major automakers from General Motors to Nissan to BMW showing off their new electron-powered offerings. But before you rush down to the local dealership to check out the new EV from your favorite ad, be forewarned: don’t believe everything you see on TV.  </p><p id=\"T6vobz\">It’s a classic case of car companies putting the electric cart before the horse. Since most people are likely unaware that many of these companies actually sell EVs, the auto industry needs to build brand awareness, and that’s going to cost an insane amount of money — roughly $6.5 million for a 30-second ad, <a href=\"https://www.nbcdfw.com/news/local/super-bowl-lvi-commercials-take-lighter-approach/2888301/#:~:text=According%20to%20an%20NBC%20executive,as%20much%20as%20%247%20million.\">according to NBC</a>. </p><aside id=\"MQoWAQ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"It’s time for car companies to shut up about electric vehicles and just ship them\",\"url\":\"https://www.theverge.com/2021/12/21/22846960/electric-vehicles-car-companies-promises-ship-dates\"}]}'></div></aside><p id=\"8kJRNu\">But the EV hype cycle is all out of whack, leaving many automakers in the uncomfortable position of building buzz about cars that aren’t actually on sale now and won’t be for months to come. </p><p id=\"S4q7eT\">Let’s just go down the list, shall we? GM’s Dr. Evil ad featured five EVs: the <a href=\"https://www.theverge.com/2022/1/5/22868578/cadillac-av-concept-innerspace-ces-2022\">Cadillac InnerSpace</a>, <a href=\"https://www.theverge.com/2022/1/5/22863648/chevy-silverado-electric-truck-specs-price\">Chevy Silverado EV</a>, <a href=\"https://www.theverge.com/2020/10/20/21525290/hummer-ev-electric-truck-gmc-price-specs-range\">Hummer EV</a>, <a href=\"https://www.theverge.com/2020/8/6/21357717/cadillac-lyriq-gm-ev-suv-touchscreen-size-specs-release-date\">Cadillac Lyriq</a>, and <a href=\"https://www.theverge.com/2021/1/12/22225394/gm-brightdrop-electric-delivery-ep1-ev600-ces-2021\">BrightDrop EV600</a>. Only two of these vehicles are available to buy right now, but with some pretty big caveats. The Hummer EV started shipping <a href=\"https://www.theverge.com/2021/12/18/22843805/gm-ev-hummer-pickup-truck-delivery\">late last year</a> but in very small numbers. You can’t just mosey down to the local GMC dealer and pick one up for yourself. (At nearly 10,000 lbs, I wouldn’t advise anyone trying to pickup this massive truck.) You can reserve it, but there’s no guarantee that you’ll get one this year even. </p><div id=\"vJBMmD\"><div ><iframe src=\"https://www.youtube.com/embed/uEuEBT0TWQE?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"bNebxE\">The only other vehicle from GM’s commercial that’s available now is the EV600, an electric delivery van that I’m pretty sure is only being purchased by major commercial customers <a href=\"https://www.theverge.com/2022/1/5/22867087/walmart-brightdrop-electric-delivery-van-gm-fedex\">like FedEx and Walmart</a>. The other vehicles have release dates that range from spring 2022 (Cadillac Lyriq) to spring 2023 (Chevy Silverado EV) to spring 2000-never (Cadillac InnerSpace). </p><p id=\"oY9OsE\">Other EVs that were on display last night are a little more imminent, like the <a href=\"https://www.theverge.com/2021/6/1/22462746/bmw-ix-suv-ev-price-specs\">BMW iX SUV</a>, which featured in an ad starring Arnold Schwarzenegger as Zeus. The German automaker’s new flagship EV is supposed to be out March 2022 but most likely won’t start shipping in earnest until summer of this year. </p><div id=\"UsDroA\"><div ><iframe src=\"https://www.youtube.com/embed/nUC1QA5gRcU?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"u16Qf8\">Also in that imminent category are the <a href=\"https://www.theverge.com/2021/2/23/22296991/hyundai-ioniq-5-electric-suv-ev-battery-range-specs\">Hyundai Ioniq 5</a> and <a href=\"https://www.theverge.com/2021/3/30/22357654/kia-ev6-revealed-specs-photos-electric-car-release-date\">Kia EV6</a>, both of which started reaching customers in recent weeks. But the fact remains that anyone who saw Hyundai’s ad starring Jason Bateman as a caveman or Kia’s robot dog commercial last night and thought to themselves, “That looks cool, I’d like to buy that,” will be sorely disappointed. It will likely be a wait of several months — or even longer — before anyone can drive home in either vehicle. </p><p id=\"DJGlOK\">The Polestar 2 had a <a href=\"https://www.theverge.com/2022/2/13/22932414/polestar-super-bowl-ad-commercial-no-compromises-tesla-volkswagen\">cool ad touting the Volvo subbrand’s minimal aesthetic</a>. And the company made some subtle digs at Tesla and Volkswagen in an effort to appeal to customers who may be turned off by Elon Musk’s antics or VW’s Dieselgate scandal. But that’s playing to a very narrow band of customers who are even ambiently aware of these issues. More importantly, the Polestar 2 is available right now! You can actually buy this car! What a concept. </p><p id=\"s2XfN1\">The delays in getting these EVs to more people are the result of a confluence of factors, including the global chip shortage and supply chain disruptions. But a lot of it has to do with the glacial pace at which the auto industry is transitioning from a business largely about selling internal combustion engine vehicles to one that sells electric motors. </p><div id=\"MrYMRy\"><div ><iframe src=\"https://www.youtube.com/embed/HoNMz_OV_dI?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"EHn3nA\">It’s also the case that this transition is happening much later than a lot of people expected. It wasn’t until Tesla proved that there was an untapped well of customer demand for EVs that automakers kicked their own electrification efforts into high gear. More so than federal regulations or reducing tailpipe emissions, Tesla’s stock price has had the most impact on the industry-wide shift to EVs. </p><div id=\"BMKT22\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Most American's don't even realize some brands have EVs <br><br>via <a href=\"https://twitter.com/CoxAutomotive?ref_src=twsrc%5Etfw\">@CoxAutomotive</a> <a href=\"https://t.co/zPtHhmuWKN\">pic.twitter.com/zPtHhmuWKN</a></p>— Reilly Brennan (@reillybrennan) <a href=\"https://twitter.com/reillybrennan/status/1493239608590667780?ref_src=twsrc%5Etfw\">February 14, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"AQZ1ZB\">So now automakers are stuck in the uncomfortable position of advertising a bunch of EVs they don’t actually sell because they need people to realize that they aspire to sell EVs one day too. Just like Tesla! And building that brand awareness is going to cost them a ton of money. The Super Bowl is just the opening salvo. There will need to be a lot more in the future. </p><p id=\"X5NKnm\">Automakers want you to know they are changing their evil ways — saving the world so they can then take it over, as Dr. Evil concludes in GM’s ad — but that change is a lot taking longer than expected. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zRESbYT-SNVPuPadGNRuVuicoto=/0x219:882x681/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23240774/18383_KIA_AMERICA_S_ALL_NEW_ALL_ELECTRIC_EV6_FEATURED_IN_SUPER_BOWL_LVI_SPOT__1_.jpg",
  "description": "There was a lot of EV vaporware at the Super Bowl.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}