{
  "title": "EV company Lordstown completes $230 million sale of its Ohio factory to Foxconn",
  "url": "https://www.theverge.com/2022/5/11/23067722/lordstown-ev-factory-sale-foxconn-ohio-deal",
  "date": "2022-05-11T22:36:17.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"Lordstown Motors Headquarters Ahead Of Earnings Figures\" src=\"https://cdn.vox-cdn.com/thumbor/5q5T2HMODLbtbAKyzJVad-TQgrs=/0x2:4000x2669/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70858883/1232963360.0.jpg\" />    </figure>  <p id=\"OMn8XF\">Struggling EV company Lordstown completed the sale of its Ohio factory to Foxconn, the Taiwanese company that assembles Apple’s iPhone. The factory, which sold for $230 million, will now become the site of <a href=\"https://investor.lordstownmotors.com/news-releases/news-release-details/lordstown-motors-and-foxconn-close-asset-purchase-agreement-and\">a joint venture between the two companies</a>. </p><p id=\"aPVxpa\">The deal was <a href=\"https://www.theverge.com/2021/9/30/22702322/lordstown-motors-foxconn-ohio-electric-vehicles\">originally set to close last month</a>, but Lordstown kept pushing back the deadline. If the sale wasn’t completed before May 18th, the company would have had to pay back the $200 million that Foxconn put down as a deposit — an amount that Lordstown has said it does not have. </p><div class=\"c-float-right\"><aside id=\"XJymXw\"><q>The deal was originally set to close last month, but Lordstown kept pushing back the deadline</q></aside></div><p id=\"yZlZtL\">The new joint venture will be called MIH EV Design LLC and will be 55 percent owned by Foxconn and 45 percent by Lordstown. Foxconn will commit $100 million to the joint venture, including a $45 million loan to Lordstown, to build a lineup of electric pickup trucks. Since buying it from General Motors in 2019, Lordstown Motors has put about $240 million worth of work into getting the factory ready to build its electric pickup truck, the Endurance.</p><p id=\"XZBKSf\">The deal gives Foxconn its first automotive factory and a significant new presence in the US — one that the company will use as it tries to establish itself as a global electric vehicle automaker. Foxconn previously announced a massive LCD panel factory in Wisconsin <a href=\"https://www.theverge.com/21507966/foxconn-empty-factories-wisconsin-jobs-loophole-trump\">but has failed to live up to the myriad promises</a> it made to that state.</p><p id=\"P2wgwE\">Foxconn has spent much of the last year talking about expanding into electric vehicles as a way to diversify away from consumer electronics. It has struck deals with the likes of Geely, which is China’s largest private automaker, as well as Fisker Inc., a California EV startup that has yet to make an electric vehicle. Foxconn has also developed its own electric vehicle platform that it intends to sell to other automakers.</p><p id=\"0mpUjO\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tDpre890yvnQzyVeTUNInw949HM=/0x288:4000x2382/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23454460/1232963360.jpg",
  "description": "Foxconn will put $100 million toward a joint venture.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}