{
  "title": "Every ridiculous thing we learned today about Elon Musk’s plan to take over Twitter",
  "url": "https://www.theverge.com/2022/4/29/23049172/elon-musk-buys-twitter-thiel-farts-jack-dorsey",
  "date": "2022-04-29T22:38:34.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uCwQqQY6cq1Vb_Zb6aM7Z8JYAoo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70812767/VRG_Illo_STK022_K_Radtke_Musk_Twitter_Shrug.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"yL0Vw2\">This is the end of the first week after <a href=\"https://www.theverge.com/23026874/elon-musk-twitter-buyout-news-updates\">Twitter accepted Elon Musk’s $44 billion buyout offer</a>, and one of the strangest tech transactions ever just keeps adding new twists. A detailed report from <a href=\"https://www.wsj.com/articles/the-shadow-crew-who-encouraged-elon-musks-twitter-takeover-tesla-jack-dorsey-11651260119\"><em>The Wall Street Journal</em></a> has peeled back a few layers on the process that began with Musk accumulating Twitter stock back in January and what that might mean when he eventually closes the deal and becomes its owner. Taken with additional information from <em>The Verge</em> contributing editor <a href=\"https://www.platformer.news/p/inside-twitters-emotional-friday?s=w\">Casey Newton in <em>Platformer</em></a> and a new report from <a href=\"https://www.reuters.com/business/musk-told-banks-he-will-rein-twitter-pay-make-money-tweets-sources-2022-04-29/\"><em>Reuters</em></a>, the picture starts to become clearer.</p><p id=\"Q1QRIL\"><a href=\"https://www.reuters.com/business/musk-told-banks-he-will-rein-twitter-pay-make-money-tweets-sources-2022-04-29/\"><em>Reuters</em></a> is adding more details to earlier reports from <a href=\"https://www.bloomberg.com/news/articles/2022-04-28/musk-s-twitter-pitch-featured-job-cuts-other-ways-to-make-money\"><em>Bloomberg</em></a><em> </em>and <a href=\"https://www.washingtonpost.com/technology/2022/04/28/musk-twitter-job-cuts/?utm_source=feedly&amp;utm_medium=referral&amp;utm_campaign=wp_business-technology\"><em>The Washington Post</em></a><em> </em>about the ideas Musk pitched to bankers who will loan him some of the money he needs to buy Twitter. According to <em>Reuters’ </em>sources, he told bankers that he plans to develop revenue-growing features, and one of his examples is “charging a fee when a third-party website wants to quote or embed a tweet from verified individuals or organizations.” </p><p id=\"u8wDVi\">As the outlet notes, in some now-deleted tweets from earlier this month, Musk discussed reducing Twitter’s reliance on advertising to make money and proposed changes to the Twitter Blue subscription, such as banning ads. <em>Reuters </em>also reports Musk has reportedly already lined up a new CEO to take over <a href=\"https://www.theverge.com/2021/11/29/22808756/twitter-ceo-parag-agrawal-jack-dorsey-bluesky-moderation\">from Parag Agrawal</a> and cites a source saying he won’t make decisions on job cuts until he actually takes ownership of the company.</p><div><aside id=\"RT935h\"><q>Agrawal told employees that execs hadn’t seen the plans Musk reportedly shared with bankers</q></aside><div id=\"XoUXBs\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I listened in on Twitter’s Friday all-hands with employees. Lots of new stuff in here, including Parag Agrawal’s regrets<br><br>Yes, he said. This deal could have been avoided.<a href=\"https://t.co/JY8QJbHFam\">https://t.co/JY8QJbHFam</a> <a href=\"https://t.co/VeYUXrTnbH\">pic.twitter.com/VeYUXrTnbH</a></p>— Casey Newton (@CaseyNewton) <a href=\"https://twitter.com/CaseyNewton/status/1520111528996786176?ref_src=twsrc%5Etfw\">April 29, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"Bmeosj\">That doesn’t add up to a lot that we now know about Elon’s plans once he takes over, but according to Casey Newton’s <a href=\"https://www.platformer.news/p/inside-twitters-emotional-friday?s=w\">report in his <em>Platformer </em>newsletter</a> on Twitter’s all-hands meeting early Friday, it would be more than the company’s executives and board members knew before they voted to accept the buyout offer. Newton writes, “In fact, Agrawal said executives hadn’t even seen the plans for the company that Musk reportedly shared with bankers.”</p><p id=\"SwNtCu\">But how did we even get here, right? <a href=\"https://www.wsj.com/articles/the-shadow-crew-who-encouraged-elon-musks-twitter-takeover-tesla-jack-dorsey-11651260119\"><em>The Wall Street Journal</em></a> has some color to provide there, citing a “shadow crew” egging on Elon Musk’s bid for Twitter that included his fellow former PayPal exec Peter Thiel (<a href=\"https://www.vanityfair.com/news/2022/02/peter-thiel-maga-money\">who funded Ted Cruz’s initial primary run for Senate</a>), right-wing blogger Charles C. Johnson (<a href=\"https://www.theverge.com/2020/5/27/21272066/social-media-bias-laura-loomer-larry-klayman-twitter-google-facebook-loss\">who has previously sued Twitter</a>), and Seth Dillon, the CEO of <em>The Babylon Bee</em>, which the paper describes as a “right-leaning satirical publication modeled after The Onion.” Those links may explain things to anyone confused by a right-wing <a href=\"https://www.theverge.com/2022/4/27/23045005/conservative-twitter-follower-boost-musk-acquisition-data\">resurgence of activity on Twitter</a> and statements from figures who’ve had accounts banned from the platform, like Rep. Marjorie Taylor Greene or Donald Trump, about the possibility of returning.</p><aside id=\"5Pg1CE\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Conservative Twitter accounts got boost in followers after Musk acquisition, data shows\",\"url\":\"https://www.theverge.com/2022/4/27/23045005/conservative-twitter-follower-boost-musk-acquisition-data\"}]}'></div></aside><p id=\"sFiGdV\">However, much of the article is focused on close links connecting Elon Musk to Twitter co-founder and now-former CEO Jack Dorsey, despite the latter’s eventual decision to ban Donald Trump from the platform and Musk’s choice to represent himself in a single tweet with the phrase “I put the art in fart.” The <em>WSJ </em>reports that Dorsey, who was at the time CEO of two companies, would occasionally “appear to space out in meetings” while messaging Musk. </p><div class=\"c-float-right\"><div id=\"gEUtq0\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">*it’s also crazy and wrong that individuals or companies bear this responsibility. As I’ve said before, I don’t believe any permanent ban (with the exception of illegal activity) is right, or should be possible. This is why we need a protocol that’s resilient to the layers above.</p>— jack⚡️ (@jack) <a href=\"https://twitter.com/jack/status/1520140996641624064?ref_src=twsrc%5Etfw\">April 29, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"9WVgRZ\">After the article was published, Dorsey <a href=\"https://twitter.com/jack/status/1520140974801924096\">posted a thread of tweets</a> despite the fact that he “tried taking a break from Twitter recently.” Dorsey said, “Every decision we made was ultimately my responsibility*. In the cases we were wrong or went too far, we admitted it and worked to correct.” </p><p id=\"mFXjGb\">This sudden impulse to publicly take responsibility included a tweet in response to a question about Twitter <a href=\"https://www.theverge.com/2020/10/30/21542801/twitter-lifts-ny-post-ban-policy-changes\">temporarily and confusingly banning links to a <em>New York Post </em>story</a> about President Joe Biden’s son, where <a href=\"https://twitter.com/jack/status/1520148497252552705\">he now says</a>, “when I found out we took that action, we reversed it almost immediately. we should have also reinstated the account without requiring a delete of the tweet.” </p><p id=\"NgBFXI\">The responsibility-taking also arrives two days after Twitter’s prospective owner / Dorsey’s messaging buddy <a href=\"https://www.theverge.com/2022/4/27/23044521/twitter-policy-chief-vijaya-gadde-elon-musk-policy-criticism-harassment\">replied to a tweet criticizing Twitter policy and legal head Vijaya Gadde</a> over the incident, calling the action “obviously incredibly inappropriate,” and tweeted a meme alleging the company’s “left wing bias” that featured her face on it. <em>Financial Times </em>correspondent Dave Lee <a href=\"https://twitter.com/DaveLeeFT/status/1519082485711208448\">points out</a> that this was followed by a wave of hateful tweets targeting Gadde.</p><p id=\"qo8EQy\">For Jack, the most important point appears to be that “I don’t believe any permanent ban (with the exception of illegal activity) is right, or should be possible.” For reasons that may be buried deep in a text message thread with Elon, Dorsey believes this is the fix Twitter needs to quickly learn and improve in ways that it never has before.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PNZELOlrJ8Sw7s8zP-zUq0a7zEs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382328/VRG_Illo_STK022_K_Radtke_Musk_Twitter_Shrug.jpg",
  "description": "You might know more about it than Twitter’s execs did.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}