{
  "title": "Everything Everywhere All At Once is charming, sprawling, and completely ridiculous",
  "url": "https://www.theverge.com/2022/3/12/22974028/everything-everywhere-all-at-once-review-michelle-yeoh",
  "date": "2022-03-12T19:42:06.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"Michelle Yeoh in Everything Everywhere All At Once\" src=\"https://cdn.vox-cdn.com/thumbor/FDN8Cp7EILSLdwkH2GmGMzKh6EM=/300x0:1920x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70613859/p.0.png\" />        <figcaption>A24</figcaption>    </figure>  <p>Martial arts meets surreal sci-fi</p> <p class=\"p--has-dropcap p-large-text\" id=\"4TvUf2\">Perhaps the weirdest thing about <em>Everything Everywhere All At Once</em>, a film in which a notable plot point involves riffing on <em>2001: A Space Odyssey</em> to explain an alternate reality where humans evolved hot dogs for fingers, is that it sometimes <em>doesn’t</em> feel that weird. Directed by Daniel Kwan and Daniel Scheinert, it lies at the intersection of a frenetic music video marathon, a slapstick martial arts comedy, and a surrealist sci-fi pastiche. But it’s anchored in an earnest family drama that’s elevated by a series of great performances, particularly from central star Michelle Yeoh.</p><p id=\"InwLJz\">There’s a whole lot going on in <em>Everything Everywhere</em>, but the basic gist is straightforward. Evelyn Wang (Yeoh) is the harried owner of a failing laundromat and a messy, unsatisfying life. Her apparently milquetoast husband Waymond (Ke Huy Quan) has served her with divorce papers, her perpetually demanding father’s (James Hong) health is failing, and her daughter Joy (Stephanie Hsu) is frustrated by Evelyn’s own snippy disapproval. A ruthless IRS worker named Deirdre Beaubeirdra (Jamie Lee Curtis) is auditing her for, among countless other dubious decisions, claiming a karaoke machine as a tax expense.</p><div class=\"c-wide-block\"><div id=\"vJ8pPN\"><div ><iframe src=\"https://www.youtube.com/embed/wxN1T1uxQ2g?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"xn8968\">Then, as Evelyn is making a last-ditch attempt to save her business, Waymond’s body is suddenly possessed by a counterpart from one of near-infinite alternate realities. He tells her she’s the only person who can save the multiverse from a reality-destroying menace. And she still has to get her taxes done.</p><p id=\"eWDgOG\">As alt-Waymond acknowledges, the multiverse’s precise mechanics are complex and not always logical. “Verse-jumpers” can use earpieces to puppet the bodies of their alternate selves, and they can osmose skills from counterparts in other worlds by performing pivotal actions that set their lives on different paths. (For unexplained reasons, most of these tasks are painful or gross, like getting paper cuts or eating chapstick.) The process opens a slight psychic link between the counterparts, and for verse-jumpers who push themselves too far, comprehending this range of infinite possibilities can lead to a devastating existential crisis.</p><div class=\"c-float-right c-float-hang\"><aside id=\"mBhucJ\"><q>Everything Everywhere’s multiverse opens the door to entertaining dream logic</q></aside></div><p id=\"Ds3ilv\">The setup offers Kwan and Scheinert a chance to pinball between a host of mini-narratives and a truly dizzying number of colorful costume changes, and it justifies a series of eccentric martial arts sequences that essentially work on dream logic. <em>Everything Everywhere’s</em> fight scenes are more entertaining, more creative, and better-shot than those of many full-fledged action movies, including ones from <a href=\"https://www.theverge.com/2021/12/21/22841582/matrix-resurrections-lana-wachowski-keanu-reeves-carrie-anne-moss-review\">the very cinematic franchises</a> it’s clearly drawing on. (They’re far more fun than almost anything in the Marvel films made by the Russo brothers, who served as producers here.)</p><p id=\"R9Upij\">Yeoh’s main self is a pitch-perfect confused everywoman who can suddenly pull off incredible acrobatic feats tempered by goofy physical comedy, while her other personas showcase her effortless charisma. Quan shifts fluidly between his hapless primary-universe self and his hyper-competent alter-ego, with both tone and body language flipping in split-second transitions. Even Curtis, introduced as a snide bureaucrat, gets a menacing turn in one of her many personas.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Stephanie Hsu, Ke Huy Quan, Michelle Yeoh, and James Hong in Everything Everywhere All At Once\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MZXWqhbL5F8tFV4MoJ-lznf1UK4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23309274/p.jpeg\">  </figure></div><p id=\"SAP4bU\"><em>Everything Everywhere </em>is full of intricate connections and Chekhov’s guns that cohere more on an aesthetic level than a narrative one. It’s constantly looping back to build extended multiverse vignettes from minor details earlier in the film, including jokes that range from mild to fairly crass. (This is a good time to mention that Kwan and Scheinert also directed <em>Swiss Army Man</em>, a film that starred Daniel Radcliffe as a flatulent corpse.) A few of these callbacks feel extraneous, and based on a Q&amp;A session following the film’s SXSW premiere, that’s <em>after</em> at least one subplot was left on the cutting room floor. But they help sell the film’s humor by spinning cinematic references and throwaway gags — what if you put, like, <em>everything</em> on a bagel, man — into deadpan scenes delivered with visual flair.</p><div class=\"c-float-left c-float-hang\"><aside id=\"5qqyOU\"><q>What if you put, like, everything on a bagel</q></aside></div><p id=\"oRUxXs\">The dramatic elements still don’t always add up. <em>Everything Everywhere’s</em> sci-fi sequences can be written like they’re marking time between absurdities, peppered with expository dialogue that doesn’t gel with the more compelling and naturalistic exchanges elsewhere. The script is full of monologues about life and humanity that sound good in isolation but are shuffled around as abruptly as the film’s costumes, asserting character motivations that haven’t been well-established before that moment.</p><p id=\"7VtvAm\">Even so, the relationship between Evelyn, Joy, Waymond, and (unexpectedly) Deirdre builds up to something sweet that stays <em>just</em> a hair away from being cloying. <em>Everything Everywhere’s</em> individual personas are largely archetypes, albeit archetypes that aren’t often seen in mainstream sci-fi movies. But the film treats them as complementary facets of a single complicated person rather than a plethora of separate entities. There’s no cheap ambiguity about whether any of the film’s events are happening — the multiverse definitely exists, and it contains people whose fingers are definitely hot dogs — but its array of worlds have the vibe of fantasies that highlight aspects of the characters’ core selves, making them more than gimmicks or weirdness for its own sake.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Stephanie Hsu in Everything Everywhere All At Once\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ch2iJly2ska-Lv_7kZqYilmUl_o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23309276/p.jpeg\">  </figure></div><p id=\"3I3JCS\">This might be due less to the script than to the cast, who bring consistency to the most nonsensical scenarios. Quan gives Waymond a resilient vulnerability that comes through even when he’s dragging Evelyn around the multiverse. While Hsu gets less screen time as her original-universe character, she balances being viciously nihilistic and hopelessly lost as one of Joy’s alter egos. Deirdre is legitimately mean, but — like many real-world jerks — capable of kindness and affection.</p><p id=\"gQ1y3u\">And in a film evoking countless earlier movies about disaffected losers who discover they’re secretly heroes, Yeoh offers a poignant and magnetic take on the trope. Her protagonist is disappointed in life but still a functioning, mature human being surrounded by people who are flawed but ultimately decent. Evelyn’s plunge into the multiverse is foreshadowed by the way she navigates her multigenerational and multilingual family, her rapid-fire dialog switching between Mandarin, Cantonese, and English. One of <em>Everything Everywhere’s</em> running jokes is that its protagonist is literally the least talented possible version of herself, but the gaps between Evelyn’s selves never seem jarring — you can believe that a few decisions separate a beleaguered laundromat owner from a master chef or opera singer.</p><p class=\"c-end-para\" id=\"6jfQsH\">For all the bizarre stuff that’s thrown into <em>Everything Everywhere, </em>Kwan and Scheinert’s riskiest move is arguably picking a nearly 140-minute runtime for a comedy built around deliberate tonal whiplash, a potentially polarizing style of humor, and an exhausting pace. <em>Everything Everywhere</em> is a giant tangled yarn ball of a movie, and if it doesn’t work for you, that feeling will last for a very, very long time. If it <em>does</em> work, though, it might be one of the most charmingly ridiculous movies you see this year.</p><p id=\"1OtAwU\"><small>Everything Everywhere All At Once</small><small><em> debuts in theaters on March 25th</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9PphwbpZgFRidIVYOQbUlVKhfj0=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23309259/p.png",
  "description": "A deeply weird premise anchored by a great cast.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}