{
  "title": "Everybody’s got a gun in Avatar: The Way of Water’s first trailer",
  "url": "https://www.theverge.com/23055453/avatar-2-trailer-the-way-of-water-release-date",
  "date": "2022-05-09T14:04:46.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/q8G4BphYbnnwSTMA3v5potgmYTc=/214x0:1834x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70848260/2060b_0010_still_v01.1152.5.jpg\" />        <figcaption>Courtesy of 20th Century Studios</figcaption>    </figure>  <p id=\"42oIVe\"><a href=\"https://www.theverge.com/2022/4/27/23045116/avatar-2-the-way-of-water-title-trailer-release-date\"><em>Avatar: The Way of Water</em></a>’s first trailer is finally here, and, strangely, it’s packing a conspicuous amount of heat.</p><p id=\"QiDZbf\">When last we saw Jake Sully (Sam Worthington) in the first <a href=\"https://disneyplus.bn5x.net/c/482924/564546/9358?u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fmovies%2Favatar%2F2YOnkRN4LwZZ%3F&amp;subid1=Verge\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><em>Avatar</em></a>, he’d more or less <a href=\"https://www.theverge.com/2017/5/27/15702590/pandora-world-of-avatar-flight-of-passage-ride-review\">become the Na’vi’s savior</a> after being adopted into their tribe, forgiven for being a human spy, and ultimately deciding to side with the aliens in their fight against humanity to save Pandora. By transferring his consciousness into the body of his human / Na’vi hybrid avatar, Jake was able to start a new life on Pandora — whose atmosphere is toxic to humans — alongside his chosen Na’vi mate, Neytiri (Zoe Saldaña).</p><p id=\"CP26vx\">While Jake and Neytiri make their return in <em>The Way of Water</em>’s first trailer, this time around, it isn’t just the two of them. In the time between the first film and <em>The Way of Water</em>, Jake and Neytiri have had children, and there are a number of shots in the trailer drawing attention to how the growth of Na’vi families will be important to the movie’s story. In addition to a Na’vi child, the trailer also features shots of Jake and Neytiri caring for a seemingly human one who has to wear a special mask in order to survive on the planet. </p><p id=\"4YcIqE\">The human child’s presence raises some questions about how Earth reacted to the Na’vi fending off its attempt to rob Pandora of its valuable unobtanium, but the implication is that humanity couldn’t be deterred in the end. Along with a slew of new looks at Pandora’s coastal Metkayina reefs, the trailer also spotlights shots of Na’vi clothed in human-like combat gear and wearing guns, suggesting that the humans have only <a href=\"https://www.theverge.com/2017/5/27/15701562/pandora-world-of-avatar-disney-world-review\">doubled down on their use of avatars</a> as weapons of war. </p><p id=\"VKnnjN\">Unclear as <em>The Way of Water</em>’s plot is simply judging from the trailer, all of the necessary elements for a story about the Na’vi being forced to defend their homes from resource-hungry invaders — <em>again </em>— are present. For any other franchise, a premise that straightforward might not be enough to move people to theaters, but with all the hype <em>Avatar: The Way of Water</em>’s built up ahead of its release, it might do the trick.</p><p id=\"aEsVf3\"><em>Avatar: The Way of Water </em>hits theaters on December 16th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_vjWcvvsK5I8an-o2Z9-35DyUB0=/0x4:2048x1076/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23448112/2060b_0010_still_v01.1152.jpg",
  "description": "A battle is brewing in Avatar: The Way of Water’s first trailer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}