{
  "title": "EVs won’t save us from high gas prices",
  "url": "https://www.theverge.com/2022/3/11/22973174/gas-prices-electric-vehicles-inventory-russia",
  "date": "2022-03-11T20:29:14.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"Gas prices soar in California\" src=\"https://cdn.vox-cdn.com/thumbor/mPmNV31g03uCzLiHZTgDY3OOvsY=/0x3:3800x2536/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70610447/1239082098.0.jpg\" />        <figcaption>Photo by David Crane / MediaNews Group / Los Angeles Daily News via Getty Images</figcaption>    </figure>  <p id=\"A5TUtN\">With gas prices soaring above $4 a gallon, electric vehicles are starting to look a lot more attractive to car buyers. But a combination of supply chain constraints, the global chip shortage, higher-than-average prices, and low inventory at dealerships will conspire to keep EVs out of reach for most people. </p><p id=\"OiVrT2\">Interest in switching from gas to electric is at an all-time high. <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.edmunds.com%2Findustry%2Fpress%2Fmore-american-car-shoppers-consider-going-green-as-gas-prices-climb-to-record-highs-according-to-edmunds-data.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F11%2F22973174%2Fgas-prices-electric-vehicles-inventory-russia\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Car shopping site Edmunds</a> reports the number of people searching for hybrid, plug-in hybrid, or electric vehicles jumped 39 percent from February to March and 18 percent over the last week. </p><p id=\"xE0fdV\">Following through on that purchase is going to be tough for most people, given the scarcity of new EVs on the market. The EVs that are available are more expensive than their gas equivalent, and inventory is extremely low. The same goes for hybrids and small to midsize cars, which generally fall near the bottom in terms of supply. So for anyone looking for relief from high gas prices, the solution is either patience — more EVs are coming! — or less driving. </p><div class=\"c-float-right\"><aside id=\"IxawkJ\"><q>Following through on that purchase is going to be tough for most people</q></aside></div><p id=\"u7XyfT\">EV sales have increased exponentially year-over-year, but they still account for only 4.5 percent of new cars sold in the US. The average sale price of a new EV is still about $10,000 more than the overall industry average that includes gas and electric cars. In terms of pricing, an EV is the equivalent of an entry level luxury vehicle.</p><p id=\"3Cjvkp\">Even if you can afford a new EV, good luck finding one. US vehicle inventory levels — the number of cars that are available to buy at any given time — are down about 60 percent from a year ago and 70 percent from 2020 to roughly 1.1 million vehicles, according to Cox Automotive. EVs and hybrids only represent about 25,100 units, or 2.4 percent of that total supply, as of February 21st, according to the company.</p><p id=\"9ClUnW\">“If jumping into a new EV is a top priority for you right now, it’s not going to be particularly easy to make a purchase,” said Jessica Caldwell, executive director of insights at Edmunds.</p><div class=\"c-float-right\"><aside id=\"0Pmc6W\"><q>Automakers were slow to recognize the demand for EVs</q></aside></div><p id=\"jtyNR7\">Automakers were <a href=\"https://www.theverge.com/2021/12/21/22846960/electric-vehicles-car-companies-promises-ship-dates\">slow to recognize</a> the demand for EVs; it wasn’t until Tesla’s valuation started to skyrocket that most car companies’ EV plans really kicked into high gear. And before that, the auto industry deprioritized or phased out completely more fuel-efficient vehicles, like sedans and wagons, in favor of huge trucks and SUVs, which have higher profit margins and consume more fuel. </p><p id=\"pxVpbU\">In recent years, automakers have discontinued smaller, more fuel-efficient vehicles like the Honda Fit, Chevy Sonic, Ford Fiesta, and Toyota Yaris. In their place, we’re getting behemoths, like the <a href=\"https://www.theverge.com/2020/10/19/21522959/cadillac-escalade-2021-first-drive-safety-oversized\">Cadillac Escalade</a>, or even more midsize SUVs, like the Ford Bronco. </p><p id=\"XItoVS\">Unsurprisingly, owners of oversized vehicles are feeling the pain of higher gas prices the most. A driver of a full-size SUV is paying about $110 more each month to operate their vehicle, <a href=\"https://www.coxautoinc.com/market-insights/reality-check-the-cost-of-high-gas-prices/\">according to Cox</a>. A full-size pickup now costs $100 more a month to operate compared to March 2021. </p><p id=\"0YM1Jy\">The last time gas prices exceeded $4 a gallon, during the financial crisis of 2008, demand for huge vehicles cratered. More car buyers turned to fuel-efficient vehicles, and some stopped shopping altogether.</p><p id=\"ut5QEI\">The dynamic is different this time around. High gas prices are colliding with vehicle scarcity, supply chain constraints, and the global chip shortage, creating a perfect storm of suckiness for car buyers. The cars they would have turned to — small, fuel-efficient, or even just electric — aren’t available. What is available are huge trucks and SUVs, like the Ram 1500 or Jeep Grand Cherokee, both of which Cox Automotive says are the most readily available new vehicles right now.</p><p id=\"mClarA\">“We are living in a time like no other,” said Michelle Krebs, a senior analyst for Autotrader and Cox Automotive.</p><div class=\"c-float-right\"><aside id=\"xeIa6t\"><q>“We are living in a time like no other.”</q></aside></div><p id=\"wPlyzT\">To make matters worse, car dealers are applying huge markups to most new EVs. According to Edmunds, the average transaction price for a new EV is up 3 percent in February over the manufacturer’s suggested retail price, largely because of markups. That’s steeper than the uptick in the average transaction price for all new vehicles (gas and EV) in February, which was 1.5 percent above the average MSRP. And remember, the average MSRP for an EV is <em>already</em> more expensive: the average price of a new EV was over $60,000 in February.</p><p id=\"gzogDg\">On top of all that, raw material prices are going up. Russia’s invasion of Ukraine is driving up prices of steel, nickel, and palladium — used in body panels, exhaust-purifying catalytic converters, and EV batteries. <a href=\"https://www.bloomberg.com/news/articles/2022-03-10/evs-are-scarce-and-expensive-as-pump-prices-rise-to-record-highs?srnd=hyperdrive&amp;sref=ExbtjcSG\">According to <em>Bloomberg</em></a>, raw material costs were about 10.5 percent of the average price paid for new vehicles in January, up from 5.9 percent in April 2020. </p><p id=\"gCVg3G\">And if that wasn’t enough, earlier this week, President Joe Biden banned imported Russian oil, acknowledging it will likely send gas prices even higher. Biden said he was committed to easing the pressure on car owners, noting that more oil will be released from the emergency stockpiles to help offset the cost. </p><p id=\"M5LgAv\">But there are other things people can do to ease the pain that doesn’t involve dashing from dealership to dealership looking for that elusive EV. In the 1970s, in the midst of a gas crisis, around 20 percent of Americans shared rides on the way to work. That number is around 7 percent today. More carpooling could be on the horizon. </p><p id=\"gcABAC\">The ’70s also saw an explosion in bike sales, both as a result of high gas prices and the introduction of the 10-speed derailleur. Bike sales — especially e-bike sales — <a href=\"https://www.theverge.com/22178543/bike-bicycle-boom-covid-pandemic-2020-sales-cities-infrastructure\">soared during the pandemic</a>, spurred by lockdown orders and a desire for a safe, socially distanced way to get around. </p><p id=\"0HZ7FS\">A simple change in driving habits could also help ease the pain. Autotrader’s Krebs suggested lowering one’s driving speeds and consolidating errands into fewer trips as among the “usual gas-saving tips.”</p><p id=\"sjulNe\">You could also just get a bus pass. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RxSeuqrrVwB7ZYbeKV3fGYHd8hU=/0x274:3800x2264/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307442/1239082098.jpg",
  "description": "EVs are more expensive and less available.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}