{
  "title": "Exclusive: Sonos is about to introduce its own voice assistant",
  "url": "https://www.theverge.com/2022/5/4/23056149/sonos-voice-assistant-features-release-date",
  "date": "2022-05-04T17:30:49.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/J-xUvt2Rc3gd5LmIqXP4-DzDOSQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70831974/acastro_220503_STK084_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"bUpvbG\">Sonos is preparing to introduce its own voice assistant service within the next few weeks, according to people familiar with the company’s plans. The voice functionality will let customers play and control music on Sonos’ whole-home audio platform. </p><p id=\"lTpo25\">It will be part of a forthcoming software update set to arrive first to customers in the US on June 1st, with an international rollout to follow. Sonos Voice will serve as an alternative to Amazon Alexa and Google Assistant, which Sonos already supports on its smart speakers and voice-enabled soundbars. All Sonos products that run the company’s S2 software will support Sonos Voice Control.</p><p id=\"UhIJxm\">Sonos has recently posted <a href=\"https://g.co/kgs/kmf5Em\">job openings related to the “Sonos Voice Experience</a>,” with the company saying its ambition is to “make voice interactions fully private, more personal, and more natural.” The debut of Sonos Voice will mark a pivotal moment in Sonos’ expansion into services as the company seeks to augment its hardware business. (Sonos Radio and the paid, higher quality <a href=\"https://www.theverge.com/2020/11/12/21561020/sonos-radio-hd-announced-lossless-audio-ad-free-streaming\">Sonos Radio HD</a> were the first such forays into services.) The offering will provide core conveniences that are similar to existing competitors, allowing Sonos product owners to play specific songs, artists, or playlists with voice commands, among other functions.</p><div class=\"c-float-right\"><aside id=\"SkNoVT\"><q>Sonos Voice won’t support Spotify at launch</q></aside></div><p id=\"3MNooJ\">At launch, Sonos Voice will work with Apple Music, Amazon Music, Pandora, Deezer, and the company’s own Sonos Radio. Spotify and Google’s YouTube Music aren’t yet on board. In keeping with Sonos’ interest in privacy, the feature will not record user audio commands or relay them to the cloud for processing. “Hey Sonos” will be the wake word for Sonos Voice Control, and the company’s internal tests show it to be quicker than competing assistant services at core music tasks.  </p><p id=\"8teTPF\">Sonos declined to comment for this story, citing its policy of not commenting on rumors or speculation. But through various job listings for the voice product and an as-yet-unannounced “<a href=\"https://g.co/kgs/fiUUok\">Home Theater OS</a>,” the company has offered a glimpse at a future where it will put a much greater emphasis on software and try to establish itself as a central hub for streaming entertainment — potentially moving beyond audio to incorporate video as well. Patrick Spence, Sonos’ chief executive officer, has hinted at those objectives in interviews. “You’re always investing ahead of the curve,” he said on <a href=\"https://www.theverge.com/22955336/sonos-google-lawsuit-ceo-patrick-spence-interview\">the <em>Decoder</em> podcast</a>. “We’re hiring people in software to go into new areas that we’re not in today. It’s easier in hindsight to understand that a company has been working on all of these great things. We just didn’t see it at that moment in time.”</p><p id=\"gyvuRN\">Voice services have been a point of contention in Sonos’ rift with large tech companies including Google and Amazon. Two years ago, <a href=\"https://docs.house.gov/meetings/JU/JU05/20200117/110386/HHRG-116-JU05-Wstate-SpenceP-20200117.pdf\">Spence told US lawmakers</a> that Google refused to allow its Assistant service to operate simultaneously with Amazon’s competing product on the same device. Amazon wasn’t as restrictive, Spence has said. Sonos, Google, and Amazon continue to work together as partners despite Sonos publicly accusing both of <a href=\"https://www.theverge.com/2020/1/21/21070812/sonos-tile-basecamp-popsocket-congressional-hearing-amazon-google-apple-competition\">unfair pricing tactics</a> and <a href=\"https://www.theverge.com/2020/1/8/21055712/sonos-google-patent-lawsuit-smart-speaker-voice-assistant-platform-monopolies\">patent infringement</a>; it successfully sued Google over the latter, <a href=\"https://www.theverge.com/2022/1/6/22871304/google-home-speaker-group-volume-control-changes-sonos-patent-decision\">forcing minor changes</a> to multi-room audio playback and volume controls in some Google software. </p><div class=\"c-float-right\"><div id=\"OnbgVe\"><div data-anthem-component=\"aside:11154697\"></div></div></div><p id=\"R8kBPG\">Sonos’ development of its own voice feature hasn’t exactly been a well-kept secret. The company has signaled its interest with customer surveys, and, last year, early details about the service were discovered in the Sonos mobile app (<a href=\"https://www.protocol.com/sonos-voice-control-assistant-leak\">as noted here by <em>Protocol</em></a>). At the time, screenshots indicated that it would be possible to use the Sonos voice service alongside Alexa, with customers able to use either one by saying the respective wake word. But the images showed that Google Assistant and Sonos’ voice offering cannot be paired in the same way — another sign of Google’s tight control over how and where its services can be used. Blogger Carsten Knobloch recently published <a href=\"https://stadt-bremerhaven.de/sonos-voice-control-so-arbeitet-der-sprachassistent/\">some additional screenshots of Sonos Voice</a>, but its launch date and supported services have not been previously reported.</p><p id=\"QWZANu\">The Sonos Voice Experience will stick to the fundamentals at launch. But if people are able to use Alexa at the same time — Sonos calls this feature “voice concurrency” — they’ll be able to give the Sonos offering a shot without sacrificing smart home integrations or other more varied features that the Sonos voice service may lack. </p><p id=\"y0F9fk\">Sonos’ stated goal of making voice “fully private” could be another key way of differentiating itself from Alexa and Google Assistant, both of which heavily rely on cloud computing. Amazon says Alexa is designed with “multiple layers of privacy and security,” and Google offers similar assurances. But some consumers remain inherently wary of voice technologies and Big Tech <a href=\"https://www.theverge.com/2022/4/28/23047026/amazon-alexa-voice-data-targeted-ads-research-report\">using voice interactions for advertising purposes</a>.</p><p id=\"eXLEp1\">Last month, <em>The Verge</em> reported that the next new hardware product coming from Sonos is a budget soundbar to be priced around $250. That device, <a href=\"https://www.theverge.com/2022/5/4/23056593/sonos-ray-soundbar-name-features-price-leak\">the Sonos Ray</a>, will also be announced in the coming weeks. Unlike the company’s more expensive Arc and Beam soundbars, however, it will not have integrated mics for voice controls.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jT9p5465wuoU5HgRjAJ5n1IpGJg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437484/acastro_220503_STK084_0001.jpg",
  "description": "It wants to make voice \"fully private\" and \"more personal.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}