{
  "title": "Exclusive: this is the new budget soundbar from Sonos",
  "url": "https://www.theverge.com/2022/4/21/23035569/sonos-new-soundbar-2022-s36-fury-specs-price-release-date",
  "date": "2022-04-21T17:40:34.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rIj-_7wNKz3aEzvVjJjKoLl1TqM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70776971/SonosLede.6.jpg\" />        <figcaption><em>A 3D recreation of the upcoming Sonos soundbar.</em> | 3D product render by Grayson Blackmon / The Verge</figcaption>    </figure>  <p id=\"Q9giNz\">Sonos is nearing the release of a new entry-level soundbar, and you’re looking at it. Codenamed “Fury” and officially known as model S36, the new device is yet another soundbar that will join the company’s lineup beneath the $449 Beam and flagship $899 Arc. </p><p id=\"lCNvtD\">It appears that Sonos is no longer willing to cede the lower-cost soundbar market to Vizio and other competitors, as I can reveal that the new product is expected to sell for around $249. That’s substantially less expensive than any Sonos soundbar to date. It’s currently penciled in for release just a few weeks from now on June 7th.</p><p id=\"TvkVFf\">I’ve seen genuine photos of the new soundbar, and <em>The Verge</em> has used them to create the 3D renders for this article. It’s not an exact match but more than enough to give you the gist. (<a href=\"https://www.theverge.com/2021/3/4/22313451/sonos-roam-leak-features-specs-price-release-date\">You can trust me</a>, I think.) Like the Arc and Beam, Sonos’ budget soundbar will be offered in both black and white.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8rdeRt0eIoG6pvPQREJLtlSXvZo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23406960/Sonos2.jpg\">      <cite>3D product render by Grayson Blackmon / The Verge</cite>      <figcaption><em>Here’s a 3D recreation of Sonos’ new soundbar, giving a closer look at the design. It definitely cuts down on the number of speakers compared to the Beam and Arc.</em></figcaption>  </figure><p id=\"USlhGn\">The device is even more compact than the Sonos Beam — not a surprise given that it contains significantly fewer drivers.</p><ul><li id=\"Tqp1pK\"><strong>Sonos model S36 “Fury”:</strong> 550mm (width) x 69mm (depth) x 100mm (height)</li><li id=\"mHbdM0\"><strong>Sonos Beam (gen 2):</strong> 651mm (width) x 68.6mm (depth) x 100mm (height) </li></ul><div class=\"c-float-right\"><div id=\"Sl1SeS\"><div data-anthem-component=\"aside:11154697\"></div></div></div><p id=\"xoYZjF\">As is to be expected at a lower price, the new Sonos soundbar will omit certain features like Dolby Atmos, and it lacks built-in mics for voice assistant functionality. Sonos will position this as a soundbar for TV and music, leaving the smarts to its pricier siblings. In fact, internal specifications suggest there’s not even an HDMI port on this product (only an optical cable comes in the box). That limits the new soundbar to Dolby Digital surround sound. You’re still able to expand it to a 5.1 system if you own other compatible Sonos speakers.</p><p id=\"ikhf04\">Here’s an interesting tidbit: Sonos anticipates that a fair number of customers will use the new soundbar as paired surrounds for the high-end Sonos Arc. And so, for that reason, the company has created a wall mount that will allow Fury — again, that’s just the codename and I’m unsure of its final branding — to be mounted <em>vertically</em> in addition to the standard horizontal orientation. If you’re wondering why anyone would do that, look closer at the drivers to the sides: they’re slightly angled and theoretically, when positioned vertically, they might do a better job at routing Atmos height audio towards the ceiling than something like a Sonos One SL. </p><p id=\"mN1gC3\">Sonos has not yet announced its upcoming soundbar. So while I’m more than happy to do so for them, I’d expect we’ll all be hearing more details about model S36 and the company’s broadening home theater ambitions in the weeks to come. Reached by email about this story, a Sonos spokesperson said “we don’t comment on rumor or speculation.”</p><p id=\"0EgTdM\">Other products that remain under development at Sonos include <a href=\"https://www.theverge.com/2021/11/29/22808243/sonos-sub-mini-leaked-features-design\">a smaller, cheaper subwoofer</a> (model S37) and the company’s long-rumored wireless headphones. The latter will usher Sonos into a new product category for the first time since it expanded into portable speakers with the Move and Roam.</p><p id=\"hfyEsi\"><em><strong>Update April 21st, 2:40PM ET:</strong></em><em> The article has been updated for clarity and to include comment from Sonos.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/95a9KRif02KAp2g1lM6QPle-1zE=/0x249:2040x1317/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23406959/SonosLede.jpg",
  "description": "Sonos’ most affordable soundbar yet is coming in June.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}