{
  "title": "Exclusive: Sonos’ next soundbar will be called the Sonos Ray",
  "url": "https://www.theverge.com/2022/5/4/23056593/sonos-ray-soundbar-name-features-price-leak",
  "date": "2022-05-04T14:40:23.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2z2-27tCpwdJdIJzRhbK-MYXZtY=/118x0:1212x729/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70830457/ray1.5.jpeg\" />        <figcaption>Image: Ktronix</figcaption>    </figure>  <p id=\"VotFim\">The upcoming budget soundbar from Sonos will be marketed as the Sonos Ray, according to internal documents and people familiar with the company’s plans. Expected to cost around $249 and go on sale in a matter of weeks, the Ray will be the cheapest soundbar from Sonos yet and serve as an entry-level option beneath the pricier <a href=\"https://www.theverge.com/22701137/sonos-beam-gen-2-atmos-soundbar-review-specs\">Beam</a> and flagship <a href=\"https://www.theverge.com/21279703/sonos-arc-review-dolby-atmos-soundbar-price-specs-features\">Arc</a>. </p><p id=\"wOFN1c\"><em>The Verge</em> previously <a href=\"https://www.theverge.com/2022/4/21/23035569/sonos-new-soundbar-2022-s36-fury-specs-price-release-date\">spilled the full details and design</a> of the new device, which is model S36 and internally known by the codename Fury. The new images included here were <a href=\"https://webcache.googleusercontent.com/search?q=cache:-LNpu-3OL0wJ:https://www.ktronix.com/barra-sonidos-sonos-ray-negro/p/840136802846+&amp;cd=18&amp;hl=en&amp;ct=clnk&amp;gl=uk\">prematurely published on Wednesday by retailer Ktronix</a>, lending further legitimacy to my earlier report. That listing specifically refers to the product as the Sonos Ray.</p><p id=\"iL8Jos\">To reach the lower price, Sonos has omitted features like built-in mics, Dolby Atmos, and HDMI connectivity; the Ray also has fewer speakers than the company’s existing soundbars. However, owners of the more expensive Sonos Arc or Beam will be able to use two Rays as rear surround speakers. The soundbar is designed to be mounted vertically for that purpose, and in the vertical orientation, its slanted side drivers will route Atmos audio toward the ceiling more effectively. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0SjTEGK9V3QFCf7kIgiinNThwX0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437370/ray2.jpeg\">      <cite>Image: Ktronix</cite>      <figcaption><em>Photos of the Sonos Ray published by retailer Ktronix confirm the absence of an HDMI port.</em></figcaption>  </figure><p id=\"8q4uWI\">When used by itself, the Ray will support Dolby Digital audio and is expandable to a 5.1 setup if you pair it with other Sonos speakers. It connects to TVs via optical cable. The soundbar lacks integrated mics for voice controls, but owners will be able to bring their own voice assistant since Sonos’ platform is compatible with Amazon Echo and Google Nest speakers. </p><p id=\"uUt3UN\">Sonos CEO Patrick Spence has previously said that the company aims to introduce at least two new products each calendar year. Other devices in the pipeline for potential release in 2022 include a smaller, more affordable subwoofer and Sonos’ long-rumored wireless headphones. </p><p id=\"EbvVE2\">The company has not yet formally announced the Sonos Ray and declined comment for this story.</p><p id=\"qrQeSs\"><em><strong>Update May 4th, 10:40AM ET: </strong></em><em>The article has been updated to include new images accidentally published by retailer Ktronix, with further confirmation of the Sonos Ray branding.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vchBDNhGbj8WQ8iTaoSApCfgnBw=/0x17:1330x713/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437363/ray1.jpeg",
  "description": "Arc, Beam, and Ray.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}