{
  "title": "Explaining crypto’s billion-dollar bridge problem",
  "url": "https://www.theverge.com/23017107/crypto-billion-dollar-bridge-hack-decentralized-finance",
  "date": "2022-04-11T12:00:09.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/VzVQFi3QtLE-qgMrD_TDu27aCRQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70735130/acastro_220531_5120_00002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>What are blockchain bridges, why do they keep getting hacked, and can we ever stop it from happening?</p> <p class=\"p--has-dropcap\" id=\"XJBPWO\">On March 23rd, the Ronin blockchain network underlying the popular NFT-driven game <em>Axie Infinity</em> was hit with a hack that saw the attackers walk away with an <a href=\"https://www.theverge.com/2022/3/29/23001620/sky-mavis-axie-infinity-ronin-blockchain-validation-defi-hack-nft\">eye-popping $625 million in cryptocurrency</a>.</p><p id=\"2gQmAm\">The Ronin hack was the largest amount of money that had ever been stolen from the type of service called a “bridge,” which connects one blockchain to another so that value can be sent between them. Unfortunately, it was far from the only hack to hit a bridge: less than two months previously, another bridge platform called Wormhole was <a href=\"https://www.theverge.com/2022/2/3/22916111/wormhole-hack-github-error-325-million-theft-ethereum-solana\">exploited for close to $325 million</a>, and about six months before that, more than $600 million was stolen from another cross-chain bridge called Poly. (In a surprising twist, the hacker later <a href=\"https://www.theverge.com/2021/8/23/22638087/poly-network-600-million-stolen-crypto-hack-restored-defi\">returned Poly’s stolen funds</a>.)</p><p id=\"Y5N7mw\">In short, bridges are the weak point in a lot of cryptocurrency systems, and hackers are targeting them for <a href=\"https://www.bloomberg.com/news/articles/2022-03-30/crypto-bridge-hacks-reach-over-1-billion-in-little-over-a-year\">more than $1 billion in little over a year</a>. So it’s worth laying out exactly what they are, why they’re important, and how crypto companies can try to plug the billion-dollar hole in their pockets.</p><p id=\"CSBm6i\">If you don’t have time to read further, the short answer to the first part is “yes, they’re vulnerable but maybe less so over time.” For the second part, the story is more complex.</p><p id=\"HfnBnI\">(We’re assuming you know what a blockchain is already; if not, you can start <a href=\"https://www.theverge.com/22654785/blockchain-explained-cryptocurrency-what-is-stake-nft\">here</a>.)</p><h2 id=\"yeby4d\"><strong>So what is a “blockchain bridge”?</strong></h2><p id=\"QNkMOT\">Essentially, it’s a system for connecting different blockchains, allowing users to exchange one kind of coin or token for another. Every cryptocurrency runs on its own blockchain: there’s Bitcoin, Ethereum, and newer currencies like Tether, Ripple, Solana, and so on. There’s no simple way for these different blockchains to interact — they might all use the concept of “addresses” to send and receive currency transactions, but you can’t send ETH directly to a Solana address.</p><p id=\"eHy2Fd\">A blockchain bridge is what developers have built to make that crossover a little smoother. If you’re holding ETH and you need Solana’s SOL to sign up for a game, you can send your ETH into a bridge, get SOL in return, and use the same method to convert back when you’re done playing.</p><h2 id=\"AmAneJ\"><strong>Why are bridges particularly vulnerable to hacks?</strong></h2><p id=\"N2ogMj\">The short answer is that they’re handling a lot of complex requests and holding a lot of currency — and unlike the blockchains themselves, there’s no standard for how they’re supposed to keep everything secure. </p><p id=\"TFZnc7\">Picture a blockchain bridge as an actual bridge between two islands. Each island has different rules about the type of car you can drive (maybe there’s an EV island and a regular gas island), so they won’t let you drive your car from one side to the other directly. In fact, you drive up to one side of the bridge, leave your vehicle in a parking garage, walk across, and pick up a rental car on the other side. Then, when you’re done driving around the other island, you bring your rental back to the bridge, walk across, and they hand you the keys to your car.</p><p id=\"gn2LoE\">That means for every rental car driving around the island, there’s another car parked in the garage. Some are stored for hours, others for days, others for months, but they’re all just sitting there, and the company that operates the bridge has to keep them all safe. Meanwhile, other unscrupulous people know exactly how many cars are in the garage and are looking for ways to steal them.</p><div class=\"c-float-left c-float-hang\"><aside id=\"u1GdWz\"><q>“If you’re trying to create a bridge between N different cryptocurrencies, the complexity of that is N squared.”</q></aside></div><p id=\"ZZW762\">Functionally, this means bridges are receiving incoming transactions in one type of cryptocurrency, locking it up as a deposit, and releasing an equivalent amount of cryptocurrency on another blockchain. When bridges get hacked, the attacker is able to withdraw money from one side of the bridge without putting anything in the other side.</p><p id=\"5kMpQh\">Bridges are particularly tempting targets because of all the complex code, creating lots of opportunities for exploitable bugs. As CertiK founder Ronghui Gu explains: “If you’re trying to create a bridge between N different cryptocurrencies, the complexity of that is N squared,” — which means N more chances for bugs to creep in.</p><p id=\"emgP6u\">Crucially, these different cryptocurrencies aren’t just different units of money: they’re written in different programming languages and deployed in different virtual environments. Figuring out how these things should interact is very hard, especially for on-chain bridges that convert between multiple different coins.</p><h2 id=\"UvzbT7\"><strong>Have bridges made cryptocurrency less secure overall?</strong></h2><p id=\"2dbL60\">Probably not. Attackers are targeting bridges right now because they’re the weakest point in the system — but that’s partially because the industry has done a good job securing the rest of it. Kim Grauer, director of research at Chainalysis — a company that has <a href=\"https://twitter.com/chainalysis/status/1508871978350002180\">produced research on DeFi thefts</a> — told <em>The Verge</em> that bridge hacks are taking the place of the previous generation of damaging hacks against exchanges like <a href=\"https://www.theverge.com/2018/1/27/16940598/coincheck-hack-500-million-nem-tokens-cryptocurrency\">Coincheck</a>, <a href=\"https://www.theverge.com/2022/1/9/22874734/bitmart-crypto-hack-victims-200-million\">BitMart</a> or <a href=\"https://www.theverge.com/2018/3/22/17151430/bankruptcy-mt-gox-liabilities-bitcoin\">Mt Gox</a>.</p><div class=\"c-float-right c-float-hang\"><aside id=\"1fJGGQ\"><q>“If you looked at our ecosystem just a few years ago, centralized exchanges were the main target of hacks.”</q></aside></div><p id=\"SsYm1J\">“If you looked at our ecosystem just a few years ago, centralized exchanges were the main target of hacks. Every hack it was, ‘Centralized exchange goes down again,’ and the industry worked hard to have solutions that allowed us to overcome these hacking problems,” she says. “We’re seeing a lot of DeFi hacking, but I think the pace of it is actually slowing down. Definitely the rate at which this hacking is going on can’t continue for the industry to grow.”</p><h2 id=\"MPpmVx\"><strong>Isn’t the whole point of the blockchain to prevent this kind of attack?</strong></h2><p id=\"ntalUQ\">The problem is that many bridges aren’t on the blockchain at all. The Ronin bridge was set up to work “off-chain,” running as a system that interfaces with the blockchain but exists on servers that are not part of it. These systems are fast, flexible, and relatively lightweight — reducing some of the “N squared” complexity challenges — but can be hit with the same type of hacks that affect web services anywhere on the internet. (“This is not really blockchain,” Gu says. “These are ‘Web2’ servers.”)</p><p id=\"jwFQA3\">Without the blockchain to settle transactions, the Ronin bridge relied on nine validator nodes, which were compromised through a combination of code hacks and <a href=\"https://twitter.com/Psycheout86/status/1509134629009342467\">unspecified social engineering</a>.</p><div class=\"c-float-left c-float-hang\"><aside id=\"UjncGB\"><q>“This is not really blockchain. These are ‘Web2’ servers.”</q></aside></div><p id=\"6ZE7Id\">There are other bridge systems that operate as smart contracts — basically, the “on-chain” alternative. It’s less likely that an attacker could subvert the code of an on-chain system through social engineering, and getting majority power over the network is extremely unlikely. The drawback is that the smart contracts themselves are highly complex, and if bugs do exist, it can be hard to update the system in a timely way. (Wormhole used an on-chain system, and the big theft occurred after hackers <a href=\"https://www.theverge.com/2022/2/3/22916111/wormhole-hack-github-error-325-million-theft-ethereum-solana\">spotted security updates that were uploaded to GitHub</a> but had not been deployed to the live smart contract.)</p><h2 id=\"4e1Gdx\"><strong>How do we stop bridges from getting hacked?</strong></h2><p id=\"f1rcFR\">It’s hard. The answer that came up time and time again was “code auditing.” In the type of case described above, where a project’s development team might be working across different programming languages and computing environments, bringing in outside expertise can cover blind spots that in-house talent might miss. But right now, a surprisingly large number of projects don’t have any auditor listed.</p><div class=\"c-float-right c-float-hang\"><aside id=\"WEsZmd\"><q>“I wouldn’t call it necessarily a bubble, but it’s certainly a gold rush.”</q></aside></div><p id=\"9tl7oC\">Nick Selby, director of assurance practice at specialist security auditing company Trail of Bits, said that this is partly because of how fast the market has sprung up. Most companies are under huge pressure to grow, scale, and build new features to fend off competitors —  which can sometimes come at the expense of diligent security work.</p><p class=\"c-end-para\" id=\"DeN7o7\">“We’re in, I wouldn’t call it necessarily a bubble, but it’s certainly a gold rush,” says Selby. “I think a lot of times, executives who are trying to innovate in the space will look at the desired feature outcome and say, ‘Well, this [product] does have the features I want. Therefore, it’s good.’ And there’s a lot of things they’re not looking at, so they’re not seeing them, which is where the code audit comes in.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/67ThbimMB6bk0lw0i-SoXCpKIMI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23377203/acastro_220531_5120_00002.jpg",
  "description": "The strengths and weaknesses of one of blockchain’s hottest products",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}