{
  "title": "Facebook limits access to some Russian state-controlled media in Ukraine",
  "url": "https://www.theverge.com/2022/2/27/22953790/facebook-restricts-access-russian-state-controlled-media-ukraine",
  "date": "2022-02-27T22:10:13.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/p-ghgc3GHjeDTaBvyBNk2hCeZNY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70557725/acastro_180828_1777_facebook_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"jiEilr\"><a href=\"https://about.fb.com/news/2022/02/metas-ongoing-efforts-regarding-russias-invasion-of-ukraine/\">Facebook has blocked access</a> to a number of accounts in Ukraine, some of which are associated with Russian state-backed media outlets. It’s also reviewing other governments’ requests to restrict access to these accounts in their countries.</p><div id=\"uvF84e\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">We have been in contact with the Government of Ukraine, and at their request we have also restricted access to several accounts in Ukraine, including those belonging to some Russian state media organizations.</p>— Nick Clegg (@nickclegg) <a href=\"https://twitter.com/nickclegg/status/1498014380641951754?ref_src=twsrc%5Etfw\">February 27, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"QTQSHm\">“We have been in contact with the Government of Ukraine, and at their request we have also restricted access to several accounts in Ukraine, including those belonging to some Russian state media organizations,” Nick Clegg, the vice president of global affairs at Meta, said in <a href=\"https://twitter.com/nickclegg/status/1498014379262025737\">a thread on Twitter</a>. “We are also reviewing other Government requests to restrict Russian state controlled media.”</p><p id=\"5wajAs\">Clegg also acknowledged some Ukranians’ suggestions to ban Facebook and Instagram from Russia entirely, but said doing so “would silence important expression at a crucial time.” <a href=\"https://www.theverge.com/2022/2/25/22950874/russia-facebook-blocked-roskomnadzor-media-censorship\">Russia partially banned Facebook</a> after the platform refused to stop fact-checking and labeling Russian state-backed media outlets. The Meta-owned Facebook has since established a special operations center to respond to situations related to the invasion of Ukraine, and details the measures it's taking to address user safety, misinformation, and state-controlled media in <a href=\"https://about.fb.com/news/2022/02/metas-ongoing-efforts-regarding-russias-invasion-of-ukraine/\">a post on its blog</a>.</p><p id=\"7ohekZ\">Clegg and Facebook didn’t name the accounts that have been restricted in Ukraine, nor did they specify which governments asked for restrictions on Russian state-backed media. <em>The Verge</em> reached out to Facebook with a request for comment but didn’t immediately hear back.</p><p id=\"1ENWFB\">On Saturday, <a href=\"https://www.theverge.com/2022/2/26/22952038/facebook-russian-state-media-blocked-advertising-monetization-ukraine-conflict\">Facebook blocked Russian state media from advertising</a> and making money on the platform. <a href=\"https://www.theverge.com/2022/2/26/22952439/youtube-bans-ads-rt-russia-channels-google-ukraine\">YouTube has also demonetized accounts</a> belonging to Russian state-run media and has restricted access to these accounts in Ukraine. The European Union has taken steps towards limiting the reach of Russian state-run media as well — European Commission President Ursula von der Leyen <a href=\"https://www.theverge.com/2022/2/27/22953563/eu-ban-russia-aircraft-state-backed-media-ukraine-sanctions\">announced a block on networks like RT and Sputnik in the EU</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RjpjdR4FyTBVgpn1mvkThpnF29Y=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12793301/acastro_180828_1777_facebook_0001.0.jpg",
  "description": "At the request of the Ukrainian government.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}