{
  "title": "Facebook lost daily users for the first time ever last quarter",
  "url": "https://www.theverge.com/2022/2/2/22914970/facebook-app-loses-daily-users-first-time-earnings",
  "date": "2022-02-02T22:34:15.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"facebook stock art\" src=\"https://cdn.vox-cdn.com/thumbor/p_vsaKJguc4OZkD28_2tny6-J3Q=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70464501/acastro_180928_1777_facebook_hack_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"4y4JAC\">Since its inception, Facebook’s user growth has essentially been up and to the right. But on Wednesday, it reported its first-ever quarterly decline of daily users globally, along with lower-than-expected ad growth that sent its stock plunging roughly 20 percent. </p><p id=\"m8fhKr\">The massive stock drop, which instantly wiped out roughly $200 billion in market value, shows that Facebook’s <a href=\"https://www.theverge.com/22749919/mark-zuckerberg-facebook-meta-company-rebrand\">corporate rebrand to Meta</a> isn’t enough to distract investors from the problems in its core business of social media. Not only was user growth across Facebook, Instagram, and WhatsApp essentially flat last quarter, but the main Facebook app lost 1 million daily users in North America, where it makes the most money through advertising. That drop led to an overall decrease in daily users of Facebook globally, which a company spokesperson confirmed is the first sequential decline in the company’s history.</p><p id=\"8TDY49\">That drop to 1.929 billion daily users from 1.93 billion the prior quarter is likely a reflection of Facebook’s <a href=\"https://www.theverge.com/22743744/facebook-teen-usage-decline-frances-haugen-leaks\">increasing lack of relevance with young people</a>. Meta doesn’t break out Instagram’s user numbers, but daily users across all of its apps barely nudged higher to 2.82, adding just 10 million users from the third quarter.</p><p id=\"Wv8xlT\">Meta is still wildly profitable: it made nearly $40 billion in profit last year alone, mostly from advertising. But it’s also losing billions on Reality Labs, the division responsible for the Quest VR headset, VR software, forthcoming AR glasses, and other metaverse-related initiatives. That division lost $10.2 billion last year and reported revenue of $2.3 billion — a stat that includes sales of the Quest and its cut of VR app purchases. Meta still hasn’t disclosed the number of sales for Quest, though third-party estimates peg the number somewhere around 10 million units. On an earnings call with investors Wednesday, Zuckerberg said Meta’s <a href=\"https://www.theverge.com/2021/10/28/22749008/facebook-oculus-project-cambria-pro-vr-ar-headset\">next VR headset</a> will be released later this year and be at the “high end of the price spectrum.”</p><p id=\"YIE79Y\">He has been clear that <a href=\"https://www.theverge.com/2021/10/25/22745381/facebook-reality-labs-10-billion-metaverse\">he intends to ramp up spending</a> on Reality Labs in the years to come and that he sees a combination of AR and VR as the next major computing platform. It’s clear that the biggest problem facing Meta now is the social media business that pays for those investments.</p><div id=\"qsR1Bq\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Facebook's hands are tied<br>1—High ARPU coastal users have churned; TikTok is eating their lunch<br>2—They can't acquire because of antitrust scrutiny<br>3—They can't build because founders don't want to be there<br>4—IDFA killed their ability to target ads<br>5—The metaverse is 10yrs out<br>RIP</p>— Nikita Bier (@nikitabier) <a href=\"https://twitter.com/nikitabier/status/1489007202056634370?ref_src=twsrc%5Etfw\">February 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/XvVt25j7b4dci2iG5s3LjXFnEe4=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13177665/acastro_180928_1777_facebook_hack_0001.jpg",
  "description": "A metaverse pivot isn’t going to fix the social network’s main problems: slowing user and ad growth",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}