{
  "title": "Facebook removes Russian misinformation network pushing fake news about the war in Ukraine",
  "url": "https://www.theverge.com/2022/2/28/22954451/facebook-twitter-remove-misinformation-network-russian-propaganda-ukraine-invasion",
  "date": "2022-02-28T12:12:11.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zChIAaBS2_Bb4MGJ-koGfs_Mouc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70559358/acastro_180720_1777_facebook_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"868eS0\">Facebook says it’s <a href=\"https://about.fb.com/news/2022/02/security-updates-ukraine/\">dismantled a misinformation network</a> comprised of individuals and sites pushing fake news about the Russian invasion of Ukraine. </p><p id=\"PiHU71\">The social network’s parent company Meta said the network was “relatively small,” consisting of about 40 accounts, Pages, and Groups on Facebook and Instagram. It’s not clear how recently the group had started operating, but Meta says it had attracted fewer than 4,000 followers on Facebook and fewer than 500 followers on Instagram. </p><p id=\"nx4auB\">“It’s a sign that while these actors are trying to run these types of influence operations, they’re getting caught sooner and they’re not reaching the audiences that they would have reached even a few years ago,” Nathaniel Gleicher, Meta’s head of security policy, told <a href=\"https://www.npr.org/2022/02/28/1083401220/facebook-uncovers-disinformation-and-hacking-campaigns-targeting-ukraine\"><em>NPR</em></a>.</p><p id=\"mHZs5b\">The network was operated by individuals in Russia and Ukraine who set-up fake profiles across multiple social networks (including YouTube, VK, and Telegram, as well as Meta’s own platforms) in order to appear real to investigators. They used AI-generated headshots as profile pictures and posed as “news editors, a former aviation engineer, and an author of a scientific publication on hydrography.” </p><p id=\"cBtvjc\">According to Meta, the group “ran a handful of websites masquerading as independent news outlets, publishing claims about the West betraying Ukraine and Ukraine being a failed state.” The company says that it found links between this network and another operation that it removed in April 2020. </p><div class=\"c-float-right\"><aside id=\"O5jS5L\"><q>News sites claim Ukraine welcomed Russian troops with open arms while the army used civilians as human shields</q></aside></div><p id=\"HIk9HP\">That earlier group shared and promoted articles from media organizations that are now <a href=\"https://home.treasury.gov/news/press-releases/jy0126\">sanctioned by the US</a>. News stories on the sites currently claim that Ukrainian border guards welcomed Russian troops with open arms; that the Ukrainian army is using civilians as human shields; and deploying UN-banned phosphorus ammunition against the Russians. None of the substance of these stories is verified by news outlets outside of Russia. </p><p id=\"Kz4UsG\">In addition to the misinformation network, Meta says the accounts of Ukrainian military officials and public figures are being targeted. A threat actor known as <a href=\"https://www.mandiant.com/resources/unc1151-linked-to-belarus-government\">Ghostwriter</a>, which has been tracked by the security community and has ties to Russian-ally Belarus, has been trying to hack into accounts and post “YouTube videos portraying Ukrainian troops as weak and surrendering to Russia.” </p><p id=\"Db6f3L\">Meta says it’s alerted users who are being targeted, blocked domains used in Ghostwriter’s phishing attacks (intended to steal password credentials), and taken other unknown steps to “secure accounts.” </p><p id=\"Vz3yT0\">“There’s been a lot of speculation and interest on whether there are covert influence operations targeting public debate in Ukraine and to what degree we’re seeing cyber hacking groups targeting individuals in Ukraine,” Meta’s Gleicher told <a href=\"https://www.npr.org/2022/02/28/1083401220/facebook-uncovers-disinformation-and-hacking-campaigns-targeting-ukraine\"><em>NPR</em></a>. “This is a case where we’re seeing both of those things.”</p><p id=\"l2K51b\">Twitter says it’s also been busy removing disinformation networks linked to the Russian invasion of Ukraine. The company <a href=\"https://www.nbcnews.com/tech/internet/facebook-twitter-remove-disinformation-accounts-targeting-ukrainians-rcna17880\">told <em>NBC News</em></a> that it’s banned more than a dozen accounts sharing links to a propaganda site named Ukraine Today. </p><p id=\"CU0XqD\">“On Feb. 27, we permanently suspended more than a dozen accounts and blocked sharing of several links in violation of our platform manipulation and spam policy. Our investigation is ongoing; however, our initial findings indicate that the accounts and links originated in Russia and were attempting to disrupt the public conversation around the ongoing conflict in Ukraine,” a Twitter spokesperson told <em>NBC News</em>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BX718uWWEZPX7soTgZg9ibvEjKs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948786/acastro_180720_1777_facebook_0001.jpg",
  "description": "Russia’s invasion of Ukraine includes a misinformation war",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}