{
  "title": "Facebook is locking out people who didn’t activate Facebook Protect",
  "url": "https://www.theverge.com/2022/3/18/22984802/facebook-protect-lock-out-twitter",
  "date": "2022-03-21T13:38:12.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/C3T6vj5-CHhD6zpwWFje8mJFd74=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70641776/Facebook_ads.0.jpg\" />        <figcaption>Illustration by Alex Castro</figcaption>    </figure>  <p id=\"1vlUN0\">Early in March, a bunch of Facebook users got a mysterious, spam-like email titled “Your account requires advanced security from Facebook Protect” and telling them that they were required to turn on the Facebook Protect feature (which they could do by hitting a link in the email) by a certain date, or they would be locked out of their account. </p><p id=\"unFR4m\">The program, <a href=\"https://about.fb.com/news/2021/12/expanding-facebook-protect-to-more-countries/\">according to Facebook</a>, is a “security program for groups of people that are more likely to be targeted by malicious hackers, such as human rights defenders, journalists, and government officials.” It’s meant to do things like ensure those accounts are monitored for hacking threats and that they are protected by two-factor authentication (2FA).</p><p id=\"3z7I5f\">Unfortunately, the email that Facebook sent from the address <em>security@facebookmail.com </em>resembled a rather common form of spam, and so it’s probable that many people ignored it.</p><aside id=\"eSYt0k\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to turn on Facebook Protect\",\"url\":\"https://www.theverge.com/22965320/facebook-protect-how-to-security\"}]}'></div></aside><p id=\"3ZDpBM\">It actually wasn’t spam. In fact, it was real. The first deadline to hit for many people was Thursday, March 17th. And now, they are locked out of their Facebook accounts — and are having trouble with the process that Facebook has provided to get them back in.</p><p id=\"AEkULB\">Those who did not activate Facebook Protect before their deadline are apparently getting a message explaining why they can’t get into their accounts and offering to help them turn it on. However, it’s not always working:</p><div id=\"S8uYVx\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I got locked out from Facebook  indefinitely today because I didn’t respond to emails from FB (that looked like a scam) about its new Facebook Protect system, which I was required to enable by today. So far, the text and security key options don’t work, many report. <a href=\"https://t.co/0aXbiqzLv7\">pic.twitter.com/0aXbiqzLv7</a></p>— Liv. (@Olivia_Thiessen) <a href=\"https://twitter.com/Olivia_Thiessen/status/1504825280229253120?ref_src=twsrc%5Etfw\">March 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"8GFsrg\">There have also have been a variety of complaints on Twitter and other social networking venues that people are being locked out of their accounts even if they <em>do</em> have the appropriate safeguards. Some say that their text-based 2FA is simply not working:</p><div id=\"y0FY3b\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Dear <a href=\"https://twitter.com/facebookapp?ref_src=twsrc%5Etfw\">@FacebookApp</a>: Your new Facebook Protect, which I didn’t ask for, keeps texting me an identical two-factor verification code, which continues to not work. I’m now effectively locked out of my account. This is heightened security? Guess I’ll spend more time on Twitter… <a href=\"https://twitter.com/Meta?ref_src=twsrc%5Etfw\">@Meta</a></p>— Mike Morrell (@RealMikeMorrell) <a href=\"https://twitter.com/RealMikeMorrell/status/1504820951191539712?ref_src=twsrc%5Etfw\">March 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"eu6maW\">Others complained that they couldn’t get through the activation process even before the deadline and so are effectively locked out of their accounts:</p><div id=\"Fyukw6\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">this Facebook protect thing is so annoying because it’s not letting me turn it on and I need Facebook for work so I’m really hoping Facebook fixes the stupid code</p>— Daniela (@itzzdaniela) <a href=\"https://twitter.com/itzzdaniela/status/1504215679167172608?ref_src=twsrc%5Etfw\">March 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"oHAQu8\">We’ve contacted the company and asked if they have any suggestions for those who are locked out because their Facebook Protected accounts can’t be accessed. We’ll let you know if we hear back.</p><p id=\"hQFMpd\"><strong>Update: </strong>Nathaniel Gleicher, head of security policy at Meta, Facebook’s parent company, <a href=\"https://twitter.com/ngleicher/status/1504972281243525120?s=20&amp;t=Sm9ga-mqXS9QtxPRXmFZnA\">tweeted on March 18th that</a> “We’re looking into isolated examples where people may need help enrolling in the program.” </p><p id=\"5dN3PO\"><em><strong>Update March 21st, 2022, 9:20AM ET:</strong></em><em> This article was originally published on March 18th, 2022, and has been updated to add Facebook’s statement.</em></p><p id=\"iWGFA1\"></p><p id=\"LqgqXR\"></p><p id=\"Ry4hIn\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kwHShk6bmgqvBn9WCNva5M6_wlQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22775526/Facebook_ads.jpg",
  "description": "Protected Facebook accounts are now inaccessible to users.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}