{
  "title": "Facebook whistleblower Frances Haugen to join Jill Biden at State of the Union address ",
  "url": "https://www.theverge.com/2022/3/1/22956830/biden-state-of-the-union-address-facebook-whistleblower-frances-haugen-jill",
  "date": "2022-03-01T19:47:53.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Facebook Whistleblower Frances Haugen Testifies At Senate Hearing On Big Tech\" src=\"https://cdn.vox-cdn.com/thumbor/SI-H0d8nDV2IaQLxhM2vqo0n1rU=/0x2:6422x4283/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70566378/1356621480.0.jpg\" />        <figcaption>Frances Haugen will join the first lady at Tuesday’s State of the Union address | Photo by Alex Wong/Getty Images</figcaption>    </figure>  <p id=\"f4Fesm\">The White House announced Tuesday that Facebook whistleblower Frances Haugen will be among the guests of first lady Jill Biden at President Biden’s first official State of the Union address. </p><p id=\"LNDjbE\">Haugen, a former product manager in Facebook’s civic integrity group, leaked a trove <a href=\"https://www.wsj.com/articles/the-facebook-files-11631713039\">of internal Facebook documents</a> to <em>The</em> <em>Wall Street Journal</em> last year that showed widespread problems within the company.<em> </em>She <a href=\"https://www.theverge.com/2021/10/5/22710539/facebook-whistleblower-hearing-instagram-child-safety-congress\">testified before Congress</a> that Facebook “repeatedly” misled the public about “what its own research reveals about the safety of children and the efficacy of its artificial intelligence systems as a role in spreading divisive and extreme messages.”</p><aside id=\"YXG9ME\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Eight things we learned from the Facebook Papers\",\"url\":\"https://www.theverge.com/22740969/facebook-files-papers-frances-haugen-whistleblower-civic-integrity\"}]}'></div></aside><p id=\"Cl8hIs\">The White House release calls Haugen a “specialist in algorithmic product management” and an “advocate for more humanity and transparency across the tech and social media industry, especially as it relates to teen mental health.”</p><p id=\"0MJNd4\">During his first State of the Union, Biden is expected to speak about the Russian invasion of Ukraine, inflation, and global supply issues. The first lady’s guest list at the event will also include Oksana Markarova, US ambassador to Ukraine, Pittsburgh-area steelworker Joseph Burgess, Intel CEO Pat Gelsinger, and Virginia seventh-grader Joshua Davis, a diabetes patient who has advocated for legislation to make school safer for kids with Type 1 diabetes. </p><p id=\"gkC97D\"></p><p id=\"nlNz8D\"></p><p id=\"wZZmka\"></p><p id=\"4n9h3Q\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BlbtpCQ5ZwU69J_x3HZcZDSqqmQ=/0x461:6422x3823/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23280439/1356621480.jpg",
  "description": "Haugen released a trove of internal Facebook documents.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}