{
  "title": "Facebook rebrands News Feed after more than 15 years",
  "url": "https://www.theverge.com/2022/2/15/22935080/facebook-meta-news-feed-renaming-branding-political-content-misinformation",
  "date": "2022-02-15T18:27:42.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YEUNMvJDHr7POUJz_MX6jgPRLAU=/154x0:970x544/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70512750/Screen_Shot_2022_02_15_at_09.28.34.0.png\" />        <figcaption><em>The News Feed will now just be the Feed.</em> | Image: Facebook</figcaption>    </figure>  <p id=\"7dVE54\">Meta is changing the name of Facebook’s News Feed, the primary part of the service that users scroll through to see what their friends and family have shared. Going forward, it’ll just be called the “Feed,” according to <a href=\"https://twitter.com/facebookapp/status/1493633545444675589?s=20&amp;t=-TLBMrgm3KCVZk4sbMu66Q\">a tweet from the company</a> on Tuesday. The “News Feed” name had been in place since the feature was first introduced more than 15 years ago.</p><p id=\"Vi6nBf\">In some ways, it’s a massive change — Facebook is one of the world’s most-used platforms, and the Feed is its main interface. On the other hand, it is “just a name change to better reflect the diverse content people see on their Feeds,” according to an email sent to <em>The Verge</em> by Facebook spokesperson Dami Oyefeso. The change “does not impact the app experience more broadly.”</p><div id=\"6KzqvP\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Starting today, our News Feed will now be known as \"Feed.\" Happy scrolling! <a href=\"https://t.co/T6rjO9qzFc\">pic.twitter.com/T6rjO9qzFc</a></p>— Facebook App (@facebookapp) <a href=\"https://twitter.com/facebookapp/status/1493633545444675589?ref_src=twsrc%5Etfw\">February 15, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"Ly3Nks\">There’s a lot in a name, though, and the rebranding seems to reflect Facebook’s messy relationship with distributing news stories. Research has shown that misinformation <a href=\"https://www.theverge.com/2021/9/3/22656036/nyu-researchers-study-facebook-misinformation-engagement-election\">gets significantly more engagement on the platform</a> than fact-based reporting, and regulators have <a href=\"https://www.theverge.com/2022/2/10/22927472/klobuchar-lummis-algorithm-bill-section-230-misinformation-teenager-mental-health\">been looking into</a> how big tech companies algorithmically rank content in their feeds. For its part, Meta <a href=\"https://about.fb.com/news/2021/02/reducing-political-content-in-news-feed/\">has said</a> it’s working on reducing the amount of political content that shows up on people’s homepages — <a href=\"https://www.theverge.com/2021/9/15/22675472/facebook-wsj-leaks-news-feed-social-media-politics-polarization\">its own research</a> suggested that the News Feed’s algorithm could push even politicians to take more extreme positions.</p><p id=\"EZlPck\">Information about politics and current events, rather than posts from your cousin about their engagement, are the types of things you’d expect to find in something called a “news feed.” Personally, that makes it hard not to read the name change as a subtle reframing of how seriously I should take the content the algorithm is serving.</p><p id=\"VChwgw\">The name change could also help clear up potential confusion within the app. Over a decade and a half ago, when the News Feed was introduced, Facebook didn’t also have a News tab that users could mix it up with. In <a href=\"https://twitter.com/alexeheath/status/1493640159052582915\">a memo to employees</a>, Meta said the “News Feed” name made people think it was a place for news stories instead of posts from friends.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9CNohNyssbv9dI-MbN2LnRkwiEA=/43x0:1082x544/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23243824/Screen_Shot_2022_02_15_at_09.28.34.png",
  "description": "Meta’s changing the name of its main interface.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}