{
  "title": "Facebook is shutting down its podcast platform after less than a year",
  "url": "https://www.theverge.com/2022/5/3/23054848/facebook-shutting-down-podcast-hub-simplifying-audio-services",
  "date": "2022-05-03T10:45:06.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LQnvnfxHjGY3y8Mn9TJHq2rEuio=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70826050/acastro_190903_1777_podcasting_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"nOvDNp\">Facebook is shutting down its podcast platform less than a year after it <a href=\"https://www.theverge.com/2021/6/16/22537023/facebook-podcast-rss-feed-publish-clips-pages\">launched</a>. Creators will be unable to upload new shows to the service as of this week, and the platform will close altogether on June 3rd, reports <a href=\"https://www.bloomberg.com/news/articles/2022-05-02/facebook-is-planning-to-leave-the-podcast-business-after-a-year?sref=ExbtjcSG\"><em>Bloomberg News</em></a>. Facebook confirmed the closure of the platform to <em>The Verge </em>but not the specific date. </p><p id=\"VPatEM\">The move is part of a broader re-evaluation of Facebook’s audio products. The company is also shuttering the site’s Soundbites and Audio hubs, and integrating its live-streaming Live Audio Rooms feature (essentially a clone of once-buzzy audio app Clubhouse) into its broader Facebook Live suite. </p><p id=\"7tXSaa\">Facebook spokesperson Adelaide Coronado told <em>The Verge</em> that the changes would “simplify” the company’s audio offerings. </p><div class=\"c-float-right\"><aside id=\"t9f9bg\"><q>“we’ve decided to simplify our suite of audio tools on Facebook”</q></aside></div><p id=\"TmzvOI\">“After a year of learning and iterating on audio-first experiences, we’ve decided to simplify our suite of audio tools on Facebook,” said Coronado. “We’re constantly evaluating the features we offer so we can focus on the most meaningful experiences.”</p><p id=\"hMOmtT\">It’s not wholly unexpected news. In 2020 and 2021 the audio market was incredibly frothy: established players like <a href=\"https://www.theverge.com/22989201/siriusxm-podcasts-earwolf-stitcher-acquisition-hosts-employees-leaving\">SiriusXM</a> and <a href=\"https://www.theverge.com/2021/6/24/22549391/amazon-music-art19-hosting-platform-advertisers\">Amazon</a> were buying up podcast networks while live audio app Clubhouse was briefly (and improbably) valued at <a href=\"https://techcrunch.com/2021/04/19/clubhouse/\">$4 billion</a>. And so, Facebook — whose owners have never seen a tech trend they couldn’t copy — got involved, too. Now, after a year of experimentation, the company has apparently come to a conclusion: it’s not really worth it, so stop the tape. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1sjmP-qq-YMZrrMxgmrdGBRz6yE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19164057/acastro_190903_1777_podcasting_0001.jpg",
  "description": "Podcasts are dead; live audio rooms will live on",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}