{
  "title": "Facebook allows posts with violent speech toward Russian soldiers in specific countries",
  "url": "https://www.theverge.com/2022/3/10/22970705/russia-ukraine-moderation-facebook-instagram-hate-speech-violence-policy",
  "date": "2022-03-11T02:50:07.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5KSOPmzC_FtbVaa-eZrTLYi4i5s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70607110/acastro_180522_facebook_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"CJEFcu\">Facebook and Instagram have instituted a temporary change in policy that allows users in some countries to post content that’s usually forbidden, including calls for harm or even the death of Russian soldiers or politicians. The change first surfaced in a report by <a href=\"https://www.reuters.com/world/europe/exclusive-facebook-instagram-temporarily-allow-calls-violence-against-russians-2022-03-10/\"><em>Reuters</em></a>, citing internal emails to moderators. In them, the outlet reports mods are told that calls for the death of Russian President Vladimir Putin or Belarusian President Alexander Lukashenko will be allowed, as long as they don’t contain threats toward others or “indicators of credibility” like saying where or how the act will take place.</p><p id=\"Emtwbw\">In a statement sent to <em>The Verge</em>, Meta spokesperson Andy Stone said, “As a result of the Russian invasion of Ukraine we have temporarily made allowances for forms of political expression that would normally violate our rules like violent speech such as ‘death to the Russian invaders.’ We still won’t allow credible calls for violence against Russian civilians.”</p><p id=\"pbzClH\"><a href=\"https://www.nytimes.com/live/2022/03/10/world/ukraine-russia-war#facebook-and-instagram-allow-for-calls-for-violence-against-russian-soldiers-in-some-countries\"><em>The New York Times</em></a> confirmed this policy applies to people using the service from Ukraine, Russia, Poland, Latvia, Lithuania, Estonia, Slovakia, Hungary, and Romania. The <em>Times</em> also notes that in 2021, <a href=\"https://www.vice.com/en/article/v7exzm/facebook-says-death-to-khamenei-posts-are-ok-for-the-next-two-weeks\"><em>Vice</em></a><em> </em>reported Facebook moderators received similar temporary instructions about “death to Khamanei” content and cited a spokesperson saying that Facebook had made that particular exception in certain earlier cases as well.</p><p id=\"TMqxwr\">The Facebook community standards regarding <a href=\"https://transparency.fb.com/policies/community-standards/hate-speech/\">hate speech</a> and <a href=\"https://transparency.fb.com/policies/community-standards/violence-incitement/\">violence and incitement</a> have continued to receive updates <a href=\"https://www.theverge.com/2018/4/24/17276794/facebook-moderation-guidelines-community-standards-nudity-hate-speech\">since the company started publishing them publicly in 2018</a>. This change is just the latest example of how platforms have modified their treatment of content originating from the invading countries or relating to them since the fighting began.</p><aside id=\"3nXc42\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The secret lives of Facebook moderators in America\",\"url\":\"https://www.theverge.com/2019/2/25/18229714/cognizant-facebook-content-moderator-interviews-trauma-working-conditions-arizona\"},{\"title\":\"The tier list: how Facebook decides which countries need protection  \",\"url\":\"https://www.theverge.com/22743753/facebook-tier-list-countries-leaked-documents-content-moderation\"}]}'></div></aside><p id=\"oRi62x\">An update to the <em>Reuters </em>report includes the content of the message sent to moderators, which reads as follows:</p><blockquote><p id=\"nzNFLN\">We are issuing a spirit-of-the-policy allowance to allow T1 violent speech that would otherwise be removed under the Hate Speech policy when: (a) targeting Russian soldiers, EXCEPT prisoners of war, or (b) targeting Russians where it’s clear that the context is the Russian invasion of Ukraine (e.g., content mentions the invasion, self-defense, etc.).</p></blockquote><p id=\"sxC42J\">Typically, moderation guidelines would dictate that language dehumanizing or attacking a particular group based on its identity be removed. But the emails cited by <em>Reuters </em>claim the context of the current situation requires reading posts from the listed countries about generic Russian soldiers as a proxy for the Russian military as a whole, and absent credible statements attached, moderators are directed not to take action on them. </p><p id=\"5kOTAN\">Still, it’s unclear whether the posts would be removed even without the direction. The policy already includes many carve-outs and exceptions. It states explicitly that additional information or context is needed before the enforcement of the policy in several cases, including:</p><blockquote><p id=\"XR5lqs\">Content attacking concepts, institutions, ideas, practices, or beliefs associated with protected characteristics, which are likely to contribute to imminent physical harm, intimidation or discrimination against the people associated with that protected characteristic. Facebook looks at a range of signs to determine whether there is a threat of harm in the content. These include but are not limited to: content that could incite imminent violence or intimidation; whether there is a period of heightened tension such as an election or ongoing conflict; and whether there is a recent history of violence against the targeted protected group. In some cases, we may also consider whether the speaker is a public figure or occupies a position of authority.</p></blockquote><p id=\"u5vjVp\">The Russian government’s reaction to the report is unknown, and there haven’t been any updates from its censorship agency <a href=\"https://rkn.gov.ru/news/rsoc/news74156.htm\">Roskomnadzor</a>, which banned Facebook earlier this month.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KZxDO1rCTkVdsrrbgvcJQrA_C0E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16351508/acastro_180522_facebook_0002.jpg",
  "description": "Facebook’s policy exception applies in Ukraine",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}