{
  "title": "Facebook is getting rid of some location-tracking features due to ‘low usage’",
  "url": "https://www.theverge.com/2022/5/9/23064109/facebook-getting-rid-location-tracking-features-nearby-friends-low-usage",
  "date": "2022-05-09T20:58:31.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"The word Facebook in white against a blue background.\" src=\"https://cdn.vox-cdn.com/thumbor/vnqqP7j_2XOISW7rFFF27tbjbqs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70849899/acastro_180522_facebook_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"uZVdqv\">Facebook is discontinuing several services that tracked your real-time location — including Nearby Friends, weather alerts, location history, and background location — due to “low usage,” as spotted by <a href=\"https://9to5mac.com/2022/05/05/facebook-to-discontinue-nearby-friends-and-other-location-based-features/\"><em>9to5Mac</em></a>. In a notification sent to people who’ve used the feature in the past, Facebook says it will stop collecting data associated with these features on May 31st and will wipe any stored data on August 1st.</p><p id=\"K79DZ3\">Facebook parent company Meta confirmed the news to <em>The Verge</em>. “While we’re deprecating some location-based features on Facebook due to low usage, people can still use Location Services to manage how their location information is collected and used,” spokesperson Emil Vazquez said in an emailed statement. </p><div class=\"c-float-right\"><aside id=\"JeEFKp\"><q>This doesn’t mean that Facebook will stop collecting location data altogether</q></aside></div><p id=\"KVYAqX\">This doesn’t mean that Facebook will stop collecting location data altogether, though. As stated in its note to users, Facebook says it will “continue collecting location information for other experiences” to serve up relevant ads and location check-ins in line with its data <a href=\"https://m.facebook.com/privacy/explanation/\">policy</a>. You can <a href=\"https://www.facebook.com/help/340945230067368\">view, download, or delete any location data</a> the platform saved within the Settings and Privacy menu. Otherwise, Facebook will automatically delete any stored data related to its discontinued services on August 1st.</p><p id=\"PlHNIW\">I don’t think many of us will be sad to see these features go. (Doesn’t seem like too many people are relying on Facebook for weather alerts these days). <a href=\"https://www.theverge.com/2014/4/17/5624736/facebook-nearby-friends\">Nearby Friends, which Facebook introduced in 2014</a>, allowed the Facebook app to share your real-time location with your friends — and vice versa — with the purpose of arranging in-person hangouts with people near you. Its popularity understandably waned over the years after similar features, like Snapchat’s Snap Map and Apple’s Find My Friends, took hold.</p><p id=\"fqp9Fu\">Given that Facebook <a href=\"https://www.theverge.com/2021/4/4/22366822/facebook-personal-data-533-million-leaks-online-email-phone-numbers\">doesn’t have</a> <a href=\"https://www.theverge.com/2018/4/4/17199632/facebook-cambridge-analytica-data-collection-87-million-users-api-developer-restrictions\">the best track record</a> when it comes to keeping users’ data secure, it’s actually more of a relief that Facebook is getting rid of these location-based features. Facebook started letting users on Android <a href=\"https://www.theverge.com/2019/2/20/18233424/facebook-android-location-data-privacy-controls\">turn off background location tracking</a> in 2019 following a report that revealed <a href=\"https://www.theverge.com/2019/2/14/18225373/facebook-threat-users-tracking-monitors-employees\">Facebook tracked users’ locations if they made a “credible” threat</a>. (Apple already let users turn off location tracking for specific apps.)</p><p id=\"74mKg4\">You can read Facebook’s full message to users here: </p><blockquote><p id=\"e1Uxxj\">Because you’ve previously used Nearby Friends, Weather alerts, Location History or Background Location, we’re letting you know that these products and features will no longer be available after May 31, 2022. Information you shared that was used for these experiences, including Location History and Background Location, will stop being collected after May 31, 2022, even if you have previously enabled them. Facebook will otherwise continue collecting location information for other experiences as described in our Data Policy.</p><p id=\"jzsydA\">Update your settings</p><p id=\"DXLLcP\">You can update your current Location History and Background Location settings in the Facebook App until May 31, 2022. After this date, the settings will be disabled.</p><p id=\"qKCj0t\">Accessing your Location History</p><p id=\"1jResl\">If you want to view or delete your existing Location History, you can access your information and download your information before Aug 1, 2022. After this date, if you do nothing, your existing Location History information will be automatically deleted.</p></blockquote>",
  "image": "https://cdn.vox-cdn.com/thumbor/23l6f30_uiNn3HTHDADKZksrzqM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16351519/acastro_180522_facebook_0002.jpg",
  "description": "It’s deleting any associated data on August 1st.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}