{
  "title": "Fake cheating sites are the latest risk for remote students",
  "url": "https://www.theverge.com/2022/2/16/22937125/honorlock-remote-proctor-cheating-honeypot-fake-test-answers",
  "date": "2022-02-16T18:42:20.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/dcOdXbDKpxZylaAcjwhjDqHMaS0=/0x1:5474x3650/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70517582/1228454781.0.jpg\" />        <figcaption>Photo by Oli Scarff / AFP via Getty Images</figcaption>    </figure>  <p id=\"47qn43\">Remote testing service <a href=\"https://honorlock.com/\">Honorlock</a> is using fake answer sites to tempt and catch students who try to cheat on online exams, according to a report by <a href=\"https://themarkup.org/machine-learning/2022/02/15/a-network-of-fake-test-answer-sites-is-trying-to-incriminate-students\"><em>The Markup</em></a>. When a student visits one of these “honeypot” sites during an online test, the site automatically sends data back to the student’s remote testing software, indicating that the student is attempting to cheat.</p><div class=\"c-float-right\"><aside id=\"xjQXbv\"><q>Honorlock is used by over 300 educational institutions</q></aside></div><p id=\"6J2RmA\">As noted <a href=\"https://honorlock.com/institutions/\">on Honorlock’s site</a>, the service is used by over 300 educational institutions, including the University of Maryland, University of Florida, Arizona State University, and the University of Massachusetts Boston. At its core, Honorlock taps into students’ webcams during tests and uses AI to alert remote human proctors of any suspicious activity, such as if a student takes out their phone during an exam. </p><p id=\"4rDyQd\">But, as <em>The Markup</em> notes, it also uses what it calls “seed sites” (<a href=\"https://honorlock.com/wp-content/uploads/2021/05/May2021_Honorlock_App_Privacy_Policy.docx.pdf\">PDF</a>), where it hosts “seeded test questions to help detect use of secondary devices or other conduct prohibited by Testing Organizations.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CKIvQn2U7DsWLfpmDOBO_cWY5zc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23249538/exam_equip_honeypot_site.png\">      <cite>Screenshot: Exam Equip</cite>      <figcaption><em>Clicking on “Show Answer” doesn’t actually reveal anything.</em></figcaption>  </figure><p id=\"cc8yDL\">Kurt Wilson, the student interviewed in <em>The Markup</em>’s report, <a href=\"https://github.com/Kurtoid/honorlock-honeypot-list/blob/main/live-sites.txt\">compiled a list of honeypot site addresses</a> used by Honorlock. There are currently five active domains: <a href=\"http://examequip.com\">examequip.com</a>, <a href=\"http://buzzfolder.com\">buzzfolder.com</a>, <a href=\"http://gradepack.com\">gradepack.com</a>, <a href=\"http://quizlookup.com\">quizlookup.com</a>, and <a href=\"http://wikicram.com\">wikicram.com</a>. Each site is quite plain-looking, and all of them feature a homepage that contains a generic list of tips for students. Under their “Blog” tabs, you’ll find a collection of random test questions, with every question presenting two options: “Show Answer” and “Hide Answer.” Click either option, and you’ll hear a strange chime from your speakers — no answer is ever revealed or hidden.</p><p id=\"R0zCFS\">Honorlock even has a <a href=\"https://www.statepress.com/article/2022/01/honorlock-lockdown-browser-test-surveillance-concerns-asu\">patent for the technology</a> behind its honeypot sites, which goes into more detail about what kind of information these sites collect. When a student accesses one of these sites, it sends their IP address, device information, mouse movement, clicks, and anything they type to Honorlock’s server. <em>The Markup</em> confirmed this when digging into the sites’ source code and network activity. Its honeypot sites also claim they can detect if a student is using a secondary phone, tablet, or another device to access answers by comparing IP addresses between devices.</p><p id=\"plkeFG\">Other test proctoring tools have been criticized as well, especially as schools and instructors struggled with implementing at-home testing-taking in the midst of the COVID-19 pandemic. In 2020, one technology specialist at the University of British Columbia <a href=\"https://www.theverge.com/2020/10/22/21526792/proctorio-online-test-proctoring-lawsuit-universities-students-coronavirus\">criticized his school’s use of exam proctoring service</a>, Proctorio, and got sued by the company for exposing the ways it tracks students’ “abnormal” eye movement and records students’ rooms during exams. Another service, Examity, <a href=\"https://www.theverge.com/2020/4/29/21232777/examity-remote-test-proctoring-online-class-education\">uses live human proctors to watch students</a> take tests through Zoom. </p><p id=\"cYHe2e\">While cheating is a problem, I don’t think this level of counterespionage surveillance tactics uses the best approach to prevent it. Remote testing services can already potentially <a href=\"https://www.vox.com/recode/22175021/school-cheating-student-privacy-remote-learning\">compromise students’ privacy</a> and may fuel unnecessary anxiety, as students worry as much about trying not to seem suspicious as getting the right answers.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9-doz3TktjTdVVUyGwMN8xLNWb4=/0x392:5474x3258/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23249357/1228454781.jpg",
  "description": "Data from the sites are sent back to the service’s servers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}