{
  "title": "‘Fan token’ company Socios accused of crypto price manipulation",
  "url": "https://www.theverge.com/2022/3/12/22974337/fan-token-company-socios-accused-cryptocurrency-price-manipulation",
  "date": "2022-03-12T23:05:13.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Cryptocurrency Companies Photo Illustrations\" src=\"https://cdn.vox-cdn.com/thumbor/RD9Vj1i3Qq3zpmVvTjf_AkTKeRM=/0x0:3543x2362/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70614331/1238537158.0.jpg\" />        <figcaption>Photo illustration by Jakub Porzycki/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"NkcJCm\">Alexandre Dreyfus, the CEO and founder of fan token site Socios, has been accused of withholding payments in order to maintain the price of Chiliz (CHZ), the cryptocurrency used by the Socios community, according to a report from <a href=\"https://offthepitch.com/a/exclusive-footballs-crypto-king-and-missing-millions\"><em>Off the Pitch</em></a>. </p><p id=\"qh7nzw\">Fan tokens are tied to real-life sports teams, creators, or artists, and give token holders access to exclusive fan clubs where they can vote on decisions within their community. In Socios’ case, the platform centers around sports, with users buying Chiliz to purchase the fan tokens representing various teams in soccer, football, motorsports, and more.</p><div class=\"c-float-right\"><aside id=\"B3w8R7\"><q>Staff members, who were also supposed to receive a portion of their salary in Chiliz, weren’t so lucky</q></aside></div><p id=\"ENmon2\">As reported by <em>Off the Pitch</em>, Dreyfus allegedly failed to pay some of his advisors an agreed-upon share of Chiliz in exchange for endorsing the cryptocurrency. An unnamed tech executive told <em>Off the Pitch</em> that he only got “some portion of what was promised,” and claims Dreyfus started “avoiding all communications with the advisors” in September 2020.</p><p id=\"qmrQ6A\">His reason for not paying out advisors? An internal message from Dreyfus viewed by <em>Off the Pitch</em> indicates Dreyfus didn’t want the value of Chiliz to tank. “We also need to protect the investors,” Dreyfus writes in the screenshotted message. “When you give free tokens, people can sell at any price — it doesn't matter for them.” He then went on to note that the “real investors” who bought Chiliz could be losing money as a result of advisors selling off the currency.</p><p id=\"9i9qHW\">The tech executive referred <em>Off the Pitch </em>to three other advisors who also allegedly went unpaid, and got confirmation from one of them. Oddly enough, that one advisor reached out to Dreyfus once again — the context of their conversation unknown — and reported back to <em>Off the Pitch </em>that all four advisors had finally been paid in full. It’s unclear if there are still other Chiliz advisors that remain unpaid.</p><p id=\"y2HGvQ\">“We regret that some advisers that have worked with us in the past were not paid in a timely manner and we have rectified this with them directly and maintain good relationships today,” a Chiliz spokesperson told <em>Off the Pitch</em>. “The agreements were made when the company was pre-start up and at that time we were not able to award CHZ directly as it wasn’t listed on any exchanges. To be clear, this delay is unacceptable and not the way we want to run our business, and falls short of the standards to which we hold ourselves today.”</p><p id=\"sfjho0\">Staff members, who were also supposed to receive a portion of their salary in Chiliz, weren’t so lucky. When the value of Chiliz skyrocketed, one employee claims they were unable to cash in on the $10 million allegedly owed by Dreyfus. Chiliz later ushered in a new contract to replace the ones previously signed by employees, resulting in a smaller allotment of crypto, <em>Off the Pitch</em> reports. The employee who was owed $10 million supposedly only made off with around $60,000 as a result of the new agreement. Another staff member was reportedly fired after speaking out about the issue to the press.</p><p id=\"WUYbYN\">Chiliz responded to <em>Off the Pitch</em>’s report <a href=\"https://medium.com/chiliz/response-to-an-article-by-off-the-pitch-11-03-03-2088b534ad3c\">in a post on Medium</a>, stating that it “does not reflect the truth of the matter.”</p><p id=\"Zjcsbt\"><em><strong>Update March 12th 6:05PM ET: </strong></em><em>Updated to add the response from Chiliz.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BXDvzxW2p-9iTF_abDOdF4i6E84=/0x254:3543x2109/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23309167/1238537158.jpg",
  "description": "Socios founder reportedly withheld crypto payments to staff.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}