{
  "title": "FBI used geofence warrant in Seattle after BLM protest attack, new documents show ",
  "url": "https://www.theverge.com/2022/2/5/22918487/fbi-geofence-seattle-blm-protest-police-guild-attack",
  "date": "2022-02-05T14:00:00.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"Black Lives Matter In Seattle Holds Protest Over Jacob Blake Shooting\" src=\"https://cdn.vox-cdn.com/thumbor/6ebThjwNG1NY9Y2XM_K_uxWQiFE=/0x0:4200x2800/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70474666/1228279206.0.jpg\" />        <figcaption>Photo by David Ryder/Getty Images</figcaption>    </figure>  <p id=\"fvDpzo\">Federal investigators served Google with a geofence warrant as part of an investigation into an attempted arson against a police union headquarters in Seattle during protests of the shooting of Jacob Blake, as shown by documents unsealed today in federal court. </p><p id=\"kyXQIG\">The attempted arson took place on August 24th, 2020, one day after police officers shot Jacob Blake in Kenosha, Wisconsin, leaving him paralyzed. Amidst broader protests in Seattle and across the country, two people threw Molotov cocktails at the rear entrance of the headquarters of the Seattle Police Officers Guild (SPOG).</p><p id=\"iXe8pH\">While the building sustained little damage, the attack spurred widespread national interest: Seattle police initially posted a $1,000 reward for information, and the FBI later <a href=\"https://www.fbi.gov/contact-us/field-offices/seattle/news/press-releases/fbi-offers-20000-reward-for-information-on-arson-and-possession-of-a-destructive-device\">offered up to $20,000</a> for any tips that would help identify the people involved.</p><p id=\"6A7Cr3\">But <a href=\"https://www.documentcloud.org/documents/21197805-seattle-fbi-geofence-warrant-oct-2020\">documents unsealed on February 3rd</a> show that, before offering the reward for information, the FBI also used a controversial search technique known as a geofence warrant to request information from Google about all Android devices that had passed through the area before and after the attack.</p><p id=\"i2Stc4\">“On August 24, 2020, at approximately 11:00 p.m., two unknown suspects intentionally damaged the SPOG building using what I believe to be improvised incendiary devices,” an FBI agent told the court in the affidavit. “Based on the foregoing, I submit that there is probable cause to search information that is currently in the possession of Google and that relates to the devices that reported being within the Target Location.”</p><p id=\"AWbnzp\">The warrant is addressed to Google and requests “Location History data, sourced from information including GPS data and information about visible wi-fi points and Bluetooth beacons transmitted from devices to Google, reflecting devices that Google calculated were or could have been ... located within the geographical region bounded by the latitudinal and longitudinal coordinates, dates, and times below.”</p><p id=\"e3KOFF\">Geographical coordinates provided with the warrant cover an area of a block that contains the police guild building and various other businesses and also includes all four street intersections at the edge of the block. The timeframe of the warrant begins at 10PM PT and extends till 11:15PM.</p>  <figure class=\"e-image\">        <img alt=\"Image showing a city block in Seattle with boundary box containing warrant coordinates\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YmT0-UUWyZtgmydDHsXidg7hwP4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23219081/SPOG_warrant_area.png\">      <figcaption><em>The geographical area enclosed by the geofence warrant</em></figcaption>  </figure><p id=\"F9DYLK\">The nature of such a warrant means that any Android user passing through the area during that hour would have their information disclosed to the FBI by Google.</p><p id=\"Pknxdn\">Generally, when geofence warrants are issued, Google returns an anonymized list of devices that were present in the defined area over the given time period. If any of these devices seem to belong to suspects in the case, investigators may ask Google to release more information.</p><p id=\"Zi4JjQ\">Court records show Google complied with the warrant, as it was returned as executed the following day. However, the fact that a public appeal for information was made by the FBI months after the warrant was granted suggests that any information provided by Google did not help with the investigation. </p><p id=\"Ho3I7C\">“As with all law enforcement requests, we have a rigorous process that is designed to protect the privacy of our users while supporting the important work of law enforcement,” a Google spokesperson said.</p><p id=\"AfyZUe\">A press request sent to the FBI’s Seattle field office had not received a response by time of publication, and a spokesperson for the Seattle Police Department said she was not immediately able to comment on technical details of the investigation.</p><p id=\"p10qT5\">While some towns saw significant property damage in the wake of the Jacob Blake protests, all evidence shows the attack against the Seattle union building was ineffective and notable mostly as an affront to local police. Surveillance footage <a href=\"https://mynorthwest.com/2117542/rantz-video-shows-activists-launching-molotov-cocktails-at-seattle-police-union-building/\">released by police</a> shows two people running into the parking lot of the SPOG building and launching the flaming projectiles at the building. The video appears to show one of the Molotov cocktails extinguishing soon after being thrown while another bursts above an outdoor stairwell.</p><p id=\"uBdf5P\">The use of geofence warrants has grown rapidly across the US in recent years, with data released by Google <a href=\"https://www.wired.com/story/geofence-warrants-google/\">showing a dramatic spike from 2018 to 2020</a>. According to Google’s transparency report, the company received 11,554 of these warrants in 2020 compared to only 982 in 2018.</p><p id=\"KFVQN0\">It’s not the first time authorities have used geofence warrants in response to a Black Lives Matter (BLM) protest. Separately to the Seattle case described above, six separate warrants were issued in Kenosha, Wisconsin to <a href=\"https://www.theverge.com/22644965/kenosha-protests-geofence-warrants-atf-android-data-police-jacob-blake\">collect information on devices in proximity to protest areas</a> after the shooting of Jacob Blake.</p><p id=\"DH9TBT\"><em>Updated 10.30am ET to include Google’s statement.</em></p><div id=\"dsHLBm\"><iframe src=\"https://embed.documentcloud.org/documents/21197805-seattle-fbi-geofence-warrant-oct-2020/?embed=1&amp;responsive=1&amp;title=1\" title=\"Seattle-FBI-geofence-warrant-Oct-2020 (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div><p id=\"idvF6b\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VeqmQ_IOcFrBRURB_bTrOTdOZyQ=/0x301:4200x2500/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23219233/1228279206.jpg",
  "description": "\"I submit that there is probable cause to search information in the possession of Google.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}