{
  "title": "FCC requires new on-air disclosures for foreign-backed broadcasts",
  "url": "https://www.theverge.com/2022/3/15/22979504/fcc-jessica-rosenworcel-disclosures-foreign-broadcasts-russia-ukraine",
  "date": "2022-03-15T18:40:27.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zWRNA7Xt5QxcdB4qmc_HUZoJ0vQ=/32x0:5231x3466/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70626499/1238482549.0.jpg\" />        <figcaption><em>FCC chair Jessica Rosenworcel announced new rules for foreign broadcasting in the US.</em> | Photo by Saul Loeb/AFP via Getty Images</figcaption>    </figure>  <p id=\"C4OkWN\">On Tuesday, the Federal Communications Commission rolled out new rules requiring broadcasters to <a href=\"https://www.fcc.gov/document/fccs-foreign-sponsorship-identification-rules-go-effect\">disclose when foreign governments lease time</a> on their airwaves, an issue that has become more urgent following Russia’s invasion of Ukraine.</p><p id=\"6JeIG1\">“In light of recent events, this effort — which is all about transparency — has taken on new importance,” FCC chair Jessica Rosenworcel said in a statement Tuesday. “It is essential that audiences know when a broadcast station has been compensated to air content coming from a foreign government.”</p><p id=\"9JTqwn\">While foreign governments can purchase airwave time, they cannot directly hold a broadcasting license. Tuesday’s rules force broadcasters to provide an on-air disclosure whenever a foreign government, foreign political party, agents acting on behalf of a foreign entity, or a US-based foreign media outlet leases time on their airwaves. The rules apply to any new leasing agreements immediately and go into effect for existing agreements in about six months, the FCC said in a Tuesday press release.</p><div class=\"c-float-right\"><aside id=\"DAMUOL\"><q>“It is essential that audiences know when a broadcast station has been compensated to air content coming from a foreign government”</q></aside></div><p id=\"VVfu9V\">The FCC’s announcement comes almost three weeks after Russia’s invasion of Ukraine. Following the invasion, the National Association of Broadcasters (NAB) <a href=\"https://www.nab.org/documents/newsroom/pressRelease.asp?id=6412\">issued a statement discouraging</a> US broadcasters from running programming sponsored by Russian entities due to possible misinformation. </p><p id=\"Ep3gcB\">“While we know that airings of such programs are extremely limited, we believe that our nation must stand fully united against misinformation and for freedom and democracy across the globe,” the NAB said in the statement earlier this month. </p><p id=\"tcU2Kt\">Earlier this month, Roku and DirecTV, the largest US satellite provider, <a href=\"https://www.theverge.com/2022/3/1/22957443/roku-directv-russia-ukraine-rt\">dropped RT America</a>, a Russian-backed news channel, as a response to the invasion. Later, the media organization laid off most of its US-based staff.</p><p id=\"wDRQLB\">“Unfortunately, we anticipate this layoff will be permanent, meaning that this will result in the permanent separation from employment of most T&amp;R employees at all locations,” Misha Solodovnikov, general manager for T&amp;R Productions, which operates RT America, <a href=\"https://www.cnn.com/2022/03/03/media/rt-america-layoffs/index.html\">told staff in a memo first reported by CNN</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wh0ekHgK1RS4w7UK_tIkow7b1W4=/0x356:5262x3111/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318090/1238482549.jpg",
  "description": "The rules come after Russian’s invasion of Ukraine",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}