{
  "title": "FCC opens apartments up to more broadband competition",
  "url": "https://www.theverge.com/2022/2/16/22937733/fcc-broadband-competition-apartments-landlords-agreements",
  "date": "2022-02-16T20:28:46.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Rxsb_9RQF6rXqtl838YXWm9laug=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70518056/acastro_170711_1777_0005.0.jpg\" />        <figcaption>Image: Alex Castro / The Verge</figcaption>    </figure>  <p id=\"WWpwa0\">Many Americans living in apartment buildings only have one choice of internet provider, and there’s very little tenants can do if they want to switch companies. But consumers could soon find cheaper and hardier service after the Federal Communications Commission approved new rules to bolster competition this week.</p><p id=\"jjcHeg\">In a unanimous 4-0 vote on Tuesday, the FCC banned broadband providers like AT&amp;T and Verizon from entering into certain revenue-sharing agreements with landlords that keep competing companies from serving a building’s tenants. The rules also force broadband providers to disclose any exclusive marketing arrangements they have with landlords to people residing in their buildings. Any “sale-and-leaseback agreements” — where a provider sells its wiring to a landlord and exclusively leases it back — are also banned. The rules also unwind any past agreements landlords entered into with providers.</p><div class=\"c-float-right\"><aside id=\"9RgaZF\"><q>“In too many of these places, broadband choice can be especially hard to find.”</q></aside></div><p id=\"lhuxR0\">“One in three people in this country live in an apartment, condominium, public housing, mobile home park, or other multi-tenant environment,” Chair Jessica Rosenworcel said in a Tuesday statement. “In too many of these places, broadband choice can be especially hard to find. There’s often only one provider, and that means those who live there can wind up paying higher prices for lower quality service.”</p><p id=\"Ne07bk\">Despite the FCC banning landlords from entering exclusive service agreements with broadband providers in 2008, dominant telecom companies have exploited several loopholes in the rules to benefit themselves while scaring off any outside competition. The FCC’s new rules close some of these loopholes and could go into effect as early as the end of this year. Once effective, a tenant could subscribe to any provider that services their specific area, and their landlord would be prohibited from interfering. </p><p id=\"uzWV5E\">Still, some experts warn that there are more loopholes that the FCC needs to address in order to ensure competitive service in multi-family buildings, like anti-steering rules to prohibit landlords from pushing tenants toward specific providers. “Anti-steering is a little stronger” than what the FCC approved on Tuesday, Harold Feld, senior vice president at Public Knowledge, told <em>The Verge </em>on Wednesday.</p><p id=\"vMF4D2\">The FCC first investigated these broadband agreements in 2017 under Chairman Ajit Pai. But it wasn’t until President Joe Biden <a href=\"https://www.theverge.com/2021/7/9/22569869/biden-executive-order-right-to-repair-isps-net-neutrality\">signed an executive order</a> last summer prompting the agency to boost competition in the telecom sector that a plan finally got set into motion. </p><p id=\"W0xAx7\">Last month, the FCC made good on another Biden broadband priority by voting to require providers to offer new <a href=\"https://www.theverge.com/2022/1/27/22904705/broadband-nutrition-labels-internet-service-rosenworcel-biden-competition\">nutrition-like labels</a> disclosing an internet plan’s price, speed, and other network management practices. These labels are set to go into effect in November. </p><p id=\"vGYa7D\">While the debate to expand broadband services to all Americans has largely focused on connecting people living in rural areas to the necessary infrastructure, urban communities that have been priced out of service have often gone overlooked. <a href=\"https://www.theverge.com/2021/11/15/22783684/biden-infrastructure-bill-bipartisan-broadband-ev-electrical-grid-climate\">Biden’s infrastructure push</a> brought more energy to the issue, sparking a handful of bills that would help low-income Americans receive access. </p><div class=\"c-float-right\"><aside id=\"MioeAr\"><q>“For too long, millions of Americans living and working in multi-tenant environments have faced barriers to obtaining the best communications services and prices.”</q></aside></div><p id=\"KtwnON\">In particular, Rep. Jamaal Bowman (D-NY) authored a bill that would require the Treasury and USDA to <a href=\"https://www.theverge.com/2021/3/16/22333877/jamaal-bowman-broadband-internet-hud-subsidy\">update its utility allowance definitions</a> to include broadband so the service could be subsidized, lowering the cost of access. The bill’s language wasn’t included in the bipartisan infrastructure package, but it put $65 billion in play to connect every American by the end of the decade. </p><p id=\"qxfXK9\">“Every American should have access to high-quality, affordable modern communications services—including the one-third who live in multi-unit buildings,” Democratic Commissioner Geoffrey Starks said in a statement on Tuesday. “For too long, millions of Americans living and working in multi-tenant environments have faced barriers to obtaining the best communications services and prices.”</p><p id=\"zZ1wxL\"></p><p id=\"OCJTAh\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wB1ztThKe0NCeLA5yLuNG2FtBBg=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8839375/acastro_170711_1777_0005.jpg",
  "description": "The rules ban certain landlord-ISP agreements.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}