{
  "title": "FDA clears first smartphone app for insulin delivery",
  "url": "https://www.theverge.com/2022/2/17/22938844/fda-insulin-delivery-smartphone-app-tandem",
  "date": "2022-02-17T16:08:15.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"Close-up of woman holding an insulin pump while laying on outdoor couch.\" src=\"https://cdn.vox-cdn.com/thumbor/TpP72Nhs6XEVEoSd7hflaCoYdMc=/0x0:6720x4480/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70520870/1235021763.0.jpg\" />        <figcaption>Photo Illustration by Matt Harbicht/Getty Images for Tandem Diabetes Care</figcaption>    </figure>  <p id=\"0GiW99\">The Food and Drug Administration cleared a smartphone app from Tandem Diabetes Care to program insulin delivery for its t:slim X2 insulin pump, the company <a href=\"https://investor.tandemdiabetes.com/news-releases/news-release-details/tandem-diabetes-care-announces-fda-clearance-tslim-x2-insulin-0\">announced Wednesday</a>. It’s the first phone app for both iOS and Android to able to deliver insulin, the company said in a statement. Previously, delivery had to be handled through the pump itself. </p><p id=\"birO66\">With this update, pump users will be able to program or cancel bolus doses of insulin, which are taken at mealtimes and are crucial in keeping blood glucose levels under control. “Giving a meal bolus is now the most common reason a person interacts with their pump, and the ability to do so using a smartphone app offers a convenient and discrete solution,” John Sheridan, president and CEO of Tandem Diabetes Care, said in a <a href=\"https://investor.tandemdiabetes.com/news-releases/news-release-details/tandem-diabetes-care-announces-fda-clearance-tslim-x2-insulin-0\">statement</a>.</p><p id=\"sOOxOH\">The change could be a big improvement for people who prefer not to have pumps out in pubic settings or attach them to undergarments like bras. </p><p id=\"s9uS87\">Tandem Diabetes Care is a leading diabetes device company based in California. Its t:connect mobile app already displays users’ blood sugar trends, history of insulin delivery, and any alerts and alarms. It’s available on iOS and Android in the United States. </p><p id=\"Z85XHW\">Tandem said in the statement that it will launch the new bolus delivery update for select users this spring ahead of a wider launch this summer. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Y8JWPkh5LXNEWgj-0Zz1azY6i6g=/0x481:6720x3999/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23252202/1235021763.jpg",
  "description": "Pump users can use the app for bolus doses.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}