{
  "title": "Federal court decision could slow oil industry efforts to store carbon in the Gulf of Mexico",
  "url": "https://www.theverge.com/2022/1/31/22910757/federal-court-decision-carbon-capture-storage-gulf-of-mexico-exxonmobile",
  "date": "2022-01-31T20:20:10.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"OIL PLATFORM, GULF OF MEXICO - DECEMBER 10, 2014:&amp;nbsp;\" src=\"https://cdn.vox-cdn.com/thumbor/9YyHHZqH88F_F0PNF1ECBkDft2E=/381x0:4619x2825/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70454626/542753200.0.jpg\" />        <figcaption>OIL PLATFORM, GULF OF MEXICO - DECEMBER 10, 2014:&nbsp; | Photo DigitalGlobe via Getty Images via Getty Images</figcaption>    </figure>  <p id=\"62d0cT\">Fossil fuel companies’ hopes of sequestering captured greenhouse gas emissions at the bottom of the Gulf of Mexico hit a snag last week when a federal court revoked a gigantic oil and gas<strong> </strong>lease sale the Biden Administration held last November. ExxonMobil was the biggest spender at the time, bidding on nearly 100 leases in shallow waters. Because the areas it bid on weren’t expected to be very lucrative for oil and gas drilling, <a href=\"https://www.theverge.com/2021/11/18/22789506/exxonmobil-gulf-of-mexico-lease-sale-carbon-capture-sequestration\">experts speculated</a> that ExxonMobil would use the areas for storing captured CO2.</p><p id=\"u3dCjS\">But late last week, US District Court Judge Rudolph Contreras canceled leases issued during the November sale. The enormous sale, which auctioned off 80.8 million acres in the Gulf of Mexico, was <a href=\"https://s3-us-west-2.amazonaws.com/s3-wagtail.biolgicaldiversity.org/documents/1_Complaint_for_Declaratory_and_Injunctive_Relief_8.31.21.pdf\">challenged</a> in federal court by environmental groups when it was first announced in August. Activists criticized the Biden administration for conducting the sale even as it pledged to slash planet-heating pollution.</p><div class=\"c-float-right\"><aside id=\"TmU4HP\"><q>A “grave error” </q></aside></div><p id=\"Jo0Pgo\">In a <a href=\"https://int.nyt.com/data/documenttools/78-memorandum-opinion-1-27/b0903c94e57b0cb5/full.pdf\">court opinion</a> released late last week,<strong> </strong>Contreras writes that the Bureau of Ocean Management committed a “grave error” in deciding to hold the lease sale and should have considered how the sale of oil and gas extracted there to foreign consumers would generate greenhouse gas emissions. His decision means the Interior Department will have to conduct a new environmental review that accounts for how fossil fuels drawn from the areas auctioned off in November would contribute to climate change.</p><p id=\"hUoT2V\">ExxonMobil declined to provide comment to <em>The Verge</em> on the court’s decision and how it might affect the company’s plans to capture and store carbon dioxide. Earlier this month, the company pledged to reach net-zero emissions for its operations by 2050, a relatively limited climate commitment since it excludes emissions that come from the burning of oil and gas products the company sells. </p><p id=\"ZJhtMs\">ExxonMobil has pointed to Carbon Capture and Storage (CCS) as one strategy for reducing its pollution. CCS involves using devices to capture the carbon dioxide that power plants and industrial facilities produce and then finding places to store that CO2 underground.</p><p id=\"DyFpee\">“ExxonMobil believes the greatest opportunity for CO2 storage in the United States is in the Gulf of Mexico,” Todd Spitler, a spokesperson for Exxon’s Low Carbon Solutions business, said in an email to <a href=\"https://subscriber.politicopro.com/article/eenews/2022/01/31/ccs-in-the-gulf-climate-solution-or-green-washing-ee-00001340\"><em>E&amp;E News</em></a>. </p><p id=\"OO3azE\">ExxonMobil is working alongside Shell, Chevron, and about a dozen other companies to develop CCS technologies around Houston’s industrial area. These companies recently <a href=\"https://houstonccs.com/wp-content/uploads/2022/01/Jan-2022-Houston-CCS-Press-Release.pdf\">projected</a> that they could store up to 50 million metric tons of CO2 per year,<strong> </strong>a fraction of the amount of storage they think is available along the US Gulf Coast, by 2030, and then double the amount by 2040. The Gulf of Mexico’s proximity to industrial, oil, and gas facilities along the Houston Ship Channel and Louisiana’s chemical corridor has made it a desirable area for carbon sequestration.</p><p id=\"N6OaJ8\"></p><p id=\"zJgwOI\"></p><p id=\"ji0Fhw\"></p><p id=\"Gaf7IW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9ntJUA0UXI-1-Ef09lAGHK45dvY=/0x104:5000x2722/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23208089/542753200.jpg",
  "description": "ExxonMobil was expected to store CO2 in the seafloor.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}