{
  "title": "Feds are still using ID.me to scan your face — and human reviewers can’t keep up",
  "url": "https://www.theverge.com/2022/2/11/22928082/id-me-irs-facial-recognition-overworked-employees",
  "date": "2022-02-11T14:53:23.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wAKQaiT-SFVuwfeZw9UTxpNdl8o=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70497464/acastro_210512_1777_deepfake_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>Sources say staff at the company are stressed, overworked, and struggling to maintain standards</p> <p class=\"p--has-dropcap p-large-text\" id=\"ekSQxh\">On Monday, the IRS stated that it would be <a href=\"https://www.theverge.com/2022/2/7/22922212/irs-id-me-facial-recognition-end-privacy-concerns\">transitioning away from using third-party facial recognition services</a> provided by ID.me, ending a period of intense scrutiny for the newly prominent vendor. But inside the company, workers and executives have been dealing with a very different set of challenges.</p><p id=\"8HbRNZ\">Internal documents and former ID.me employees say the company was beset by disorganization and staffing shortages throughout 2021, as shortcomings in the automated systems created tensions among the company’s workforce, particularly the human verification workers who have to step in when the algorithms fail. Even now, the company plays a central role in how claimants access benefits across the United States — working on behalf of <a href=\"https://help.id.me/hc/en-us/categories/360004475354-Verifying-for-State-Benefits\">27 state-level uninsurance employment programs</a> to verify applicants — and the underlying issues are far from settled.</p><p id=\"FR9OWp\">Current and former employees who spoke to <em>The Verge</em> paint a picture of a company described as being in “permanent crisis mode,” changing policies rapidly to keep up with fluctuating demand for its services and fight a slew of negative press. In particular, they say a lack of human review capacity has been a chokepoint for the company, leading to stress, pressure, and a failure to meet quality standards.</p><div class=\"c-float-right c-float-hang\"><aside id=\"KxLLF7\"><q>“permanent crisis mode”</q></aside></div><p id=\"59kW3L\">It’s an unexpected challenge for a biometrics system that’s usually seen as automatic, pointing to the often-ignored workers needed to support automated systems at scale. When the automated systems fail — ID.me says roughly <a href=\"https://insights.id.me/press-releases/id-me-comments-on-adherence-to-federal-rules-on-facial-recognition-selfies-that-protect-identities-from-theft/\">10 percent of users</a> will need video chat assistance — it’s workers and subjects who are left to manage the consequences.</p><p id=\"DrTdAp\">“There are some real-world consequences to these delays and inefficiencies,” said <a href=\"mailto:Jake.Laperruque@pogo.org\">Jake Laperruque</a>, senior policy counsel at the Project on Government Oversight (POGO). “When a tech like facial recognition doesn’t work, which it disproportionately doesn’t for women and people of color, then there’s a human cost, and that cost is augmented when these types of backup systems fail.”</p><p id=\"5XLECI\">As detailed in a <a href=\"https://www.bloomberg.com/news/features/2022-01-20/cybersecurity-company-id-me-is-becoming-government-s-digital-gatekeeper\"><em>Bloomberg</em> profile</a>, ID.me was founded 12 years ago under the name TroopSwap, a Craigslist-style site aimed at the military community. (Blake Hall is himself from a military background, having served in Iraq.) But TroopSwap later pivoted into an identity verification service that would give veterans a simple way to prove their status with one trusted site and use this to claim discounts and other benefits without handing over sensitive information.</p><div><aside id=\"1QuuSi\"><q>When the automated system failed, applicants often faced long wait times to reach human reviewers</q></aside></div><p id=\"TYTSgJ\">As the company leaned into identity services, it rebranded as ID.me in 2012 and began a slow expansion that took off in June 2020 when it secured its first partnership with a state agency, the Florida Department of Economic Opportunity. With a foot in the door, many more deals with state agencies were to follow: by July 2021, it was being used in <a href=\"https://www.reuters.com/business/states-using-idme-rival-identity-check-tools-jobless-claims-2021-07-22/\">27 states</a> across the US and playing a key role in verifying the identities of unemployment insurance claimants during the pandemic surge.</p><p id=\"YHKdLR\">ID.me’s expansion also included a large federal contract with the IRS that would see it <a href=\"https://www.irs.gov/credits-deductions/2021-child-tax-credit-and-advance-child-tax-credit-payments-topic-k-verifying-your-identity-to-view-your-payments\">verifying the identity of child tax claimants</a> for the revenue agency in 2021. To keep up with demand, the company <a href=\"https://www.prnewswire.com/news-releases/idme-secures-100-million-from-fortress-to-support-record-growth-and-advance-vision-to-build-the-identity-layer-of-the-internet-301377780.html\">added 1,300 new employees</a> between January and September 2021, including 500 to be based in a new office in Tampa, Florida, dedicated to customer support.</p><p id=\"EGUpBm\">But as adoption increased, so did complaints. <a href=\"https://www.vice.com/en/article/5dbywn/facial-recognition-failures-are-locking-people-out-of-unemployment-systems\">A <em>Vice</em> report</a> found dozens of complaints from applicants who said they had been locked out of unemployment benefits when ID.me’s verification service had failed to identify them. When the automated system failed, applicants often faced long wait times to reach human reviewers, according to the report — wait times that became even more burdensome and difficult to navigate for people <a href=\"https://www.cpr.org/2021/07/07/colorado-unemployment-idme-glitch-internet-access/\">without access to reliable internet connections</a>.</p><div class=\"c-float-right c-float-hang\"><aside id=\"IYftSB\"><q>higher pay levels could not be sustained</q></aside></div><p id=\"vQrYyA\">In May 2021, as complaints about wait times were blossoming, video review staff were given a raise of $5 per hour as a bonus for dealing with an increase in workload anticipated from the new IRS contract. But the growth in video calls didn’t rise to the levels that had been projected, sources inside the company said, meaning that higher pay levels could not be sustained, and the policy was ended in September 2021, reducing salaries by around 20 percent. (Salary data <a href=\"https://www.glassdoor.com/Hourly-Pay/ID-me-Trusted-Referee-Hourly-Pay-E496774_D_KO6,21.htm\">shared on Glassdoor</a> matches sources’ assessments of the minimum and maximum pay offered to video reviewers at this time.)</p><p id=\"c922qg\">“We temporarily increased pay from May through September 20th, 2021, for both current and new customer support personnel,” said Patrick Dorton, a spokesperson for ID.me, in an email to <em>The Verge</em>. “This increase was always communicated as a temporary measure. The date ranges for the temporary pay increase were clearly communicated to all customer support personnel before it went into effect.”</p><p id=\"F73bxB\">In addition to the pay cut, sources said, many staff were unhappy about the end of work-from-home policies, which were being phased out at the company at the same time as first the delta and then omicron variants hit the US. As in-office staffing levels rose, more ID.me employees began to contract COVID at work, sources said, in some cases taking whole teams offline at once.</p><div class=\"c-float-left c-float-hang\"><aside id=\"CVTTTO\"><q>“In terms of worker treatment, it’s like the Amazon of identity protection”</q></aside></div><p id=\"3N3T2w\">“We take worker health and safety very seriously and have consistently implemented health and hygiene requirements on-site that meet or exceed state and local government legal mandates,” Dorton said. “To make the adjustment back to work easier, ID.me did increase office space capacity to allow for social distancing and a phased return to work.”</p><p id=\"syfrjb\">At the same time as bonuses for junior staff were being cut, ID.me <a href=\"https://www.prnewswire.com/news-releases/idme-secures-100-million-from-fortress-to-support-record-growth-and-advance-vision-to-build-the-identity-layer-of-the-internet-301377780.html\">announced that it had raised $120 million in financing</a> from New York-based investment management firm Fortress Investment Group. This was the company’s second funding raise of 2021, following a Series C funding round in March in which it raised another $100 million at a $1.5 billion valuation. But internally, dissatisfaction over the loss of bonuses, the end of work-from-home policies, and other factors led to many employees leaving the company towards the end of 2021, creating a higher workload for remaining employees and driving up stress within the company, according to source interviews and communications shared with <em>The Verge</em>.</p><p id=\"56iPk7\">Employees complained of target quotas that left them struggling to keep pace and disincentivized supervisors from taking the time to properly address complaints from junior staff. </p><p id=\"QmWMNI\">“In terms of worker treatment, it’s like the Amazon of identity protection,” one employee told <em>The Verge</em>.</p><div class=\"c-float-right c-float-hang\"><aside id=\"sUWncL\"><q>“Following this incident, a thorough review of existing policies was conducted,” the company said</q></aside></div><p id=\"TRTEFN\">When asked about quotas, ID.me said that performance metrics represented industry standard practice for customer service staff and that employee attrition rates at the company were also standard for the industry.</p><p id=\"JWgYFb\">Employees also shared communications that detailed radical changes to workplace policy taking place with little notice. In a Slack post seen by <em>The Verge</em>, a member of the ID.me leadership team apologizes for implementing security “floor sweeps” without informing the majority of staff and acknowledges cuts to work-from-home policies. </p><p id=\"ZszOns\">Sources familiar with the situation said that these policies partly stemmed from an instance of inappropriate conduct that took place on video calls.</p><p id=\"mmc1pp\">“Last year, an ID.me video chat agent engaged in inappropriate conduct. ID.me investigated the situation, and the company took immediate action to terminate the video chat agent,” Dorton said. “Following this incident, a thorough review of existing policies was conducted, and measures to prevent inappropriate conduct by video chat agents were strengthened.”</p><p id=\"20N8lh\">However, sources said that these quality checks have begun to fall by the wayside under the pressure of clearing through the backlog of video verification requests. Since November, employees say, quality assurance staff — whose role is to ensure that standards of customer service are being met by reviewing trusted referees’ work — have been spending 40–50 percent of their time doing basic document verification in order to help referees keep up with demand.</p><p id=\"CyfkPi\">“There have been instances where Quality Assurance staff have temporarily assisted ID.me customer teams when wait times are long,” Dorton said. “This cross-training has the added benefit of ensuring that Quality Assurance staff has access to front line information about the experience of our customers. ID.me cares deeply about experience and prioritizes adequate staffing.”</p><p id=\"WUQGSQ\">Job postings from ID.me suggest that the company is beginning to switch some of its employee base towards a temporary, contract-based staffing model in order to manage shifting demand: a <a href=\"https://www.linkedin.com/jobs/view/2814797358/\">LinkedIn posting</a> uploaded by ID.me in January 2022 offers candidates a $500 sign-on bonus for starting work as a member support representative, a job listed as a contract position with a duration of three to four months.</p><div class=\"c-float-left c-float-hang\"><aside id=\"J0hMuV\"><q>sources describe a siege mentality</q></aside></div><p id=\"qkyeMW\">On January 19th, 2022, cybersecurity journalist Brian Krebs published a post on his highly trafficked blog giving a <a href=\"https://krebsonsecurity.com/2022/01/irs-will-soon-require-selfies-for-online-access/\">detailed account of his experience</a> trying to use ID.me’s services to log in to an IRS account. Krebs was prompted to write the post after seeing an advisory message on the IRS.gov portal warning that existing login credentials would cease to work later in the year, a message that other users began to receive at around the same time.</p><p id=\"7m0yp1\">Although the IRS had <a href=\"https://www.irs.gov/newsroom/new-identity-verification-process-to-access-certain-irs-online-tools-and-services\">announced</a> in November that the agency’s existing sign-in system would be replaced by ID.me by summer 2022, Krebs’ blog post put renewed focus on the imminent change. The ACLU labeled it “<a href=\"https://twitter.com/ACLU/status/1484552049656270853\">deeply troubling</a>,” pointing to evidence that suggests facial recognition is less accurate at identifying people of color than white people; prominent AI researcher Joy Buolamwini <a href=\"https://www.theatlantic.com/ideas/archive/2022/01/irs-should-stop-using-facial-recognition/621386/\">published an op-ed in <em>The Atlantic</em></a> calling for the IRS to drop the use of biometric identification techniques; and a coalition of groups led by Fight for the Future organized a petition <a href=\"https://www.fightforthefuture.org/news/2022-01-29-groups-call-on-irs-to-dump-id-me-and-reject-all-facial-recognition/\">asking the tax agency to abandon ID.me</a>.</p><p id=\"SNqlOi\">As public scrutiny of the company increased, sources describe a siege mentality in which both internal and external criticism of the company was poorly tolerated by senior management and often deflected rather than addressed. In a message in a company Slack channel, Hall referred to negative press as a result of “competitors... pushing a false narrative to try to take away our contracts and, by extension, jobs of folks who work here.” In another message, Hall insisted that the company was “on the right side of history” after pushback against its facial recognition systems, a sentiment one employee flagged to <em>The Verge</em> as concerning.</p><p id=\"BJF8xO\">When asked about Hall’s statements, Dorton said: “Because ID.me has by far the most effective solution available, competitors like LexisNexis, which sells its data to ICE and others, have at times resorted to using inaccurate narratives.”</p><p id=\"7VDAWC\">Ultimately, the public scrutiny received in the last few weeks has led to a change of tack from ID.me. The company is now offering the option of a direct-to-human review process, but in light of inefficiencies, questions remain over the viability of the choice.</p><p id=\"toN163\">For people with limited income, internet access, or time, deciding between human verification and a face scan may be a forced decision, said Jake Laperruque of POGO.</p><p class=\"c-end-para\" id=\"OLC9CF\">“I don’t think it’s really fair to say ‘we’re giving people the option not to use facial recognition’ if there’s a huge cost in terms of time that someone has to take,” Laperruque said. “It’s not really an option if it’s quick facial recognition or manual login plus five hours of your time.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mrh9lvxY8tPoBlWb_gdhmgyFMWk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22512651/acastro_210512_1777_deepfake_0003.jpg",
  "description": "\"In terms of worker treatment, it’s like the Amazon of identity protection.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}