{
  "title": "Fewer robot cars are driving more miles in California",
  "url": "https://www.theverge.com/2022/2/10/22927660/california-autonomous-cars-miles-disengagement-waymo-cruise-2021",
  "date": "2022-02-10T20:24:07.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"Waymo Self Driving Car\" src=\"https://cdn.vox-cdn.com/thumbor/NF5imK3XKtuHRM5LDgTP39lAb_s=/0x0:5195x3463/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70494606/1324922564.0.jpg\" />        <figcaption>Photo by Smith Collection / Gado / Getty Images</figcaption>    </figure>  <p id=\"SQ237G\">California, you may have noticed more robot cars on your roads than usual over the past year. That’s because autonomous vehicle testing is booming in the state, with AV companies having driven more than 4 million miles in 2021, according to data released by the California Department of Motor Vehicles. This represents <a href=\"https://www.theverge.com/2021/2/11/22276851/california-self-driving-autonomous-cars-miles-waymo-cruise-2020\">a sharp increase over the previous two years</a>, a sign that the AV industry has come roaring back after the pandemic-influenced lockdowns of 2020. </p><p id=\"Ta17db\">There were also fewer companies testing vehicles overall, a reflection of the increased pace of <a href=\"https://www.theverge.com/22423489/autonomous-vehicle-consolidation-acquisition-lyft-uber\">mergers and acquisitions that have taken place in recent years</a>. Of the 50 companies registered with the DMV, only 22 reported testing during the year. Despite skepticism about the longer-than-expected timeline to mass adoption of AV technology, the companies say they expect to begin to roll out their first commercial services starting this year. </p><p id=\"tMlncs\">Before we get to the numbers, a quick caveat: the California DMV’s <a href=\"https://www.dmv.ca.gov/portal/vehicle-industry-services/autonomous-vehicles/disengagement-reports/\">annual “disengagement reports,”</a> which all licensed operators are required to submit, are a bit controversial. In addition to the miles driven, the reports list the frequency at which human safety drivers were forced to take control of their autonomous vehicles (also known as a “disengagement”).</p><div class=\"c-float-right\"><aside id=\"fARZc7\"><q>The disengagement reports are widely disparaged as being, at best, meaningless and, at worst, misleading</q></aside></div><p id=\"PDWlLB\">The disengagement reports are <a href=\"https://www.theverge.com/2020/2/26/21142685/california-dmv-self-driving-car-disengagement-report-data\">widely disparaged</a> as being, at best, meaningless and, at worst, misleading. Companies have a lot of discretion about when to disengage, the testing environments aren’t uniform, and it’s difficult to make an apples-to-apples comparison between companies. Media outlets tend to overhype the numbers in service of a false “race” narrative in which certain companies are outpacing others in miles driven and disengagements.</p><p id=\"H9qGnF\">But the reports can still serve as a marker of progress, especially as it relates to the number of miles driven and which companies are still reporting data. And this year, for the first time, companies that are testing their vehicles without a safety driver behind the wheel are required to report their miles and disengagements, offering the public a barebones look at how fully driverless cars are doing so far. Last year, these fully driverless vehicles traveled around 25,000 miles in total. </p><p id=\"QamDg7\">Waymo, the self-driving company spun out of Google, reported driving the most miles last year: 2.3 million, a huge increase over 2020, with 628,838 miles driven, and even the pre-pandemic year of 2019, with 1.45 million. </p><p id=\"MFZmjk\">This reflects the increased number of vehicles that Waymo has deployed in San Francisco and elsewhere in the state, as it most likely positions itself to launch a robotaxi service in California in the near future. (The company has not confirmed these plans.) Waymo recently <a href=\"https://www.theverge.com/2021/8/24/22639226/waymo-san-francisco-rides-self-driving-service\">started accepting some public riders</a> in its vehicles, but it did not report any driverless miles, as the company has yet to start that phase of testing despite having a permit to do so from the state. </p>  <figure class=\"e-image\">        <img alt=\"GM Cruise\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1o0N_NX9XZHIEwyDdQ_Gs8inLKw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23233156/1179635788.jpg\">      <cite>Photo by Smith Collection / Gado / Getty Images</cite>  </figure><p id=\"ff6A72\">During the year, Waymo’s vehicles disengaged a total of 292 times, for a rate of 0.126 disengagements for every 1,000 miles, or 1 disengagement for every 7,200 miles. That’s a worse rate than it had in 2020, in which the company reported only 21 disengagements over the course of the year, or a rate of 0.033 disengagements per 1,000 miles. The company says it experienced a higher number of disengagements because it introduced a new vehicle to its fleet: the Jaguar I-Pace electric SUV. </p><p id=\"kYfe6v\">The company with the second-most number of miles is Cruise, with a total of 876,104 miles driven. The company, which is backed by General Motors and Honda, reported 20 disengagements, or 0.003 per 1,000 miles, or 1 disengagement per 42,202 miles. Cruise also reported 6,365 driverless miles, and zero disengagements. The company recently <a href=\"https://www.theverge.com/2022/2/1/22912553/cruise-public-waitlist-robotaxi-autonomous-san-francisco\">announced a public waitlist</a> for its robotaxi service in San Francisco, which it expects to launch this year. </p><div class=\"c-float-right\"><aside id=\"b9s8Iy\"><q>Together, Waymo and Cruise drove 3.2 million miles, representing 80 percent of the total miles driven for the year</q></aside></div><p id=\"EzPzwm\">Together, Waymo and Cruise drove 3.2 million miles, representing 80 percent of the total miles driven for the year. (Last year, it was 70 percent.) The only other company to come anywhere close was Pony.ai, which reported driving 305,616 miles with 20 disengagements (0.023 per 1,000 miles). Zoox, the AV company acquired by Amazon in 2020, drove 155,125 miles with 20 disengagements (0.128 per 1,000 miles). </p><p id=\"SRw4YI\">Apple, which has been working on its own secretive car project for years, reported driving 13,272, a decrease compared to the 18,805 miles it drove in 2020. The company reported 662 disengagements, or 49.8 per 1,000 miles. </p><p id=\"9zFN1J\">Missing from the list is Tesla, which has been frustrating regulators and delighting fans with the release of its “Full Self-Driving” advanced driver assistance system. The California DMV <a href=\"https://www.theverge.com/2022/1/12/22880305/tesla-fsd-beta-california-dmv-autonomous-vehicle-letter\">recently said that it was “revisiting”</a> its decision not to regulate FSD beta, after numerous safety advocates and regulators have expressed concern about the company’s willingness to allow its untrained customers to test the Level 2 system in public. </p><p id=\"fff0z4\">Unlike other companies doing autonomous vehicle testing in the state, Tesla is using its own customers, rather than trained safety drivers, to monitor the technology. Tesla owners <a href=\"https://www.theverge.com/2022/1/7/22872865/elon-musk-tesla-raise-price-full-self-driving-software\">have to pay $12,000 for the FSD option</a>, up from $10,000 as of last month. Tesla recently disclosed that there are 60,000 customers using its FSD beta software in their vehicles. Tesla does have 32 vehicles registered with the DMV, but once again, it did not submit a report this year. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pFWL9voYIzia1gfZRsRXi6CBZbA=/0x322:5195x3042/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23233135/1324922564.jpg",
  "description": "Waymo and Cruise account for 80 percent of the miles.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}