{
  "title": "Fidelity is rolling out Bitcoin investing for 401(k) plans",
  "url": "https://www.theverge.com/2022/4/26/23043424/fidelity-rolling-out-bitcoin-investing-401-k-plans-cryptocurrency-microstrategy",
  "date": "2022-04-26T22:49:43.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/N_W3vzPaPSBOq5Sr-SxUYVSiD1A=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70797312/acastro_170726_1777_0007_v4.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"OaB794\">Fidelity will soon start allowing eligible individuals to save a portion of their 401(k) in Bitcoin, <a href=\"https://newsroom.fidelity.com/press-releases/news-details/2022/Fidelity-Investments-Advances-Leading-Position-as-Digital-Assets-Provider-With-Launch-of-Industrys-First-of-Its-Kind-Bitcoin-Offering-for-401k-Core-Investment-Lineup/default.aspx\">the company announced Tuesday</a>. Employees will only gain access to the option if their employer signs off the option, which Fidelity says will start rolling out in mid-2022. </p><p id=\"H8cngu\">While Fidelity doesn’t specify how much employees can dedicate to cryptocurrency in its release, the <a href=\"https://www.wsj.com/articles/fidelity-to-allow-retirement-savers-to-put-bitcoin-in-401-k-accounts-11650945661\"><em>Wall Street Journal</em></a> reports that employees can elect to save up to 20 percent of their retirement fund in Bitcoin. Dave Gray, Fidelity’s head of workplace retirement offerings and platforms, also told the <em>WSJ</em> that Fidelity plans on adding support for other cryptocurrencies at some point in the future.</p><div class=\"c-float-right\"><aside id=\"eL2mB1\"><q>MicroStrategy is the first to announce that it has adopted the Bitcoin retirement fund</q></aside></div><p id=\"RVi80s\">“As a leader in digital assets, we are thrilled to be the first to offer employers exposure to bitcoin for the core lineup of 401(k)s that reflects our commitment to meeting their evolving needs and our belief in the promise of blockchain technology for the financial industry’s future,” Gray said.</p><p id=\"NoDMms\">As noted by Fidelity, business intelligence company MicroStrategy is the first to announce that it has adopted the Bitcoin retirement fund option. The company, led by Bitcoin proponent Michael Saylor, acquired <a href=\"https://fortune.com/2020/08/11/buying-bitcoin-microstrategy-cryptocurrenc/\">$250 million in Bitcoin in 2020</a> and continued to buy into the cryptocurrency as part of its financial strategy. However, the Securities and Exchange Commission (SEC) objected to the way MicroStrategy accounted for its Bitcoin assets in one of its SEC filings last year. According to <a href=\"https://www.bloomberg.com/news/articles/2022-01-24/microstrategy-s-share-slide-accelerates-after-sec-objection\"><em>Bloomberg</em></a>, MicroStrategy used <a href=\"https://www.investopedia.com/terms/n/non-gaap-earnings.asp#:~:text=Commonly%20used%20non%2DGAAP%20financial,earnings%2C%20and%20funds%20from%20operations.\">non-GAAP measures</a>, or methods of reporting earnings that aren’t based on the Generally Accepted Accounting Principles (GAAP), to account for its digital assets.</p><p id=\"dRiqCb\">This wasn’t MicroStrategy’s first run-in with the SEC — in 2000, <a href=\"https://www.computerworld.com/article/2589923/update--microstrategy-executives-to-pay--11-million-to-settle-sec-fraud-ch.html\">the SEC settled with Saylor and other executives $11 million</a> over <a href=\"https://www.sec.gov/news/press/2000-186.txt\">charges of civil accounting fraud</a>, and claimed the company “materially overstated its revenues and earnings” after MicroStrategy went public in June 1998 until March 2000. The executives paid the disgorgement of $10 million and a $350,000 civil penalty for each of them, without “admitting or denying the Commission’s allegations.”</p><p id=\"cvY5d8\">Fidelity may face some pushback on its new offering. Last month, the <a href=\"https://www.dol.gov/newsroom/releases/ebsa/ebsa20220310\">US Department of Labor warned</a> fiduciaries against offering an option to save for retirement in cryptocurrency “in an effort aimed at protecting the retirement savings of U.S. workers,” citing that this type of investment presents “significant risks and challenges to participants’ retirement accounts, including significant risks of fraud, theft, and loss.” <a href=\"https://www.theverge.com/2022/3/9/22966006/cryptocurrency-regulation-white-house-biden-treasury-commerce\">President Joe Biden has also signed an executive order</a> designed to push for more crypto regulation in the US.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/o7yEw5nolnK4VnPNtYLR7DyPl3o=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8937277/acastro_170726_1777_0007_v4.jpg",
  "description": "Employees can elect to invest up to 20 percent in Bitcoin.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}