{
  "title": "FIFA Plus launches with over 40,000 free soccer matches to watch live",
  "url": "https://www.theverge.com/2022/4/13/23023300/fifa-plus-free-40000-live-matches-original-content",
  "date": "2022-04-13T07:43:46.000Z",
  "author": "Thomas Ricker",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sI5lyt4Nu1Hjibvrl90KnaVxjKo=/0x0:1013x675/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70743455/F__FIFA_com_PressRelease_16x9_Lockup.0.jpeg\" />        <figcaption><em>FIFA Plus launches globally today.</em> | Image: FIFA</figcaption>    </figure>  <p id=\"Bka3TB\">FIFA launched its free streaming service — named <a href=\"https://www.fifa.com/about-fifa/organisation/media-releases/fifa-launches-fifa-to-bring-free-football-entertainment-to-fans-everywhere\">FIFA Plus</a>, of course — that includes a mix of live soccer matches, archived content, original features, and much more. It’s available globally on the web and mobile devices, in five languages (English, French, German, Portuguese, and Spanish) with more to follow.</p><p id=\"atugtT\">The service will stream over 40,000 <a href=\"https://www.fifa.com/fifaplus/en/live\">live matches</a> per year from 100 Member Associations across all six confederations, including 29,000 men’s games and 11,000 women’s matches. FIFA promises to cover a wide range of games from “Europe’s top-flight leagues to previously unserved competitions.” Today, for example, you can stream matches from the Mongolian 2nd League, Nepal Women’s Football League, and 3F Superliga. FIFA says 1,400 matches will be streamed live in the first month, with that number accelerating over time.</p><div class=\"c-float-right\"><aside id=\"F7kZH9\"><q>Free for now, but that could change</q></aside></div><p id=\"QKsBzL\"><a href=\"https://www.fifa.com/fifaplus/en/originals\">Original content</a> at launch includes a film about Ronaldinho, a six-part documentary about Dani Alves, and a five-part docuseries featuring interviews with icons like Carli Lloyd, Lucy Bronze, and Wendie Renard. Meanwhile, <a href=\"https://www.fifa.com/fifaplus/en/archive\">archived footage</a> includes complete World Cup matches, or just the highlights, as well as collections that focus on individual players or compilations like “best goals” and “best assists.”</p><p id=\"OaeAnJ\">The ad-supported service is free for now, but that could change in time. “We’ll be strategically extending — so we will be potentially going into gaming, social community, and potentially subscription depending on where this goes and where the industry disruption heads,” said FIFA Plus head Charlotte Burr, <a href=\"https://variety.com/2022/tv/global/fifa-plus-launch-football-streaming-soccer-1235229894/\">according to <em>Variety</em></a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FH9F9Gxe1hDt841YYumBHYqUza4=/0x0:1200x628/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23386450/F__FIFA_com_PressRelease_16x9_Lockup.jpeg",
  "description": "1,400 free soccer matches will be streamed live this month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}