{
  "title": "Final Fantasy XIV: Endwalker’s next chapter starts on April 12th",
  "url": "https://www.theverge.com/2022/4/1/23006250/final-fantasy-14-endwalker-patch-6-1-release-date-notes",
  "date": "2022-04-01T18:28:30.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/bMgyzcru8eLehmzN6Dah8XhIh-Y=/103x0:1723x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70699387/FFXIV_PUB_Patch6.1_01.0.png\" />        <figcaption>Square Enix</figcaption>    </figure>  <p id=\"AsApW7\">If you’re like me and still recovering from <a href=\"https://www.theverge.com/2022/1/11/22877031/final-fantasy-xiv-endwalker-review-square-enix-pc\">the emotional devastation of <em>Final Fantasy XIV: Endwalker</em></a>, take heart; it’s time for a <em>Newfound Adventure</em>. <a href=\"https://na.finalfantasyxiv.com/endwalker/patch_6_1/\">Patch 6.1 <em>Newfound Adventure</em></a> is the first major content patch for <em>Final Fantasy XIV: Endwalker</em>. In a <a href=\"https://www.twitch.tv/videos/1442979467\">Live Letter developer presentation</a>, game director Naoki Yoshida revealed details about the patch, including new mounts, new hairstyles, new PvP battles and, of course, a new story.</p><p id=\"J3bZ4w\"><em>Newfound Adventure</em> picks up where <em>Endwalker</em> left off. Your friends, the Scions of the Seventh Dawn, have scattered across Eorzea doing their own thing now that they’ve prevented the end of all life in the galaxy. Events conspire to reunite the gang for some good old-fashioned low-stakes adventuring.</p><p id=\"xEdV8X\">While I’m excited by the prospect of my Warrior of Light returning to her dungeon-delving, treasure-hunting roots, I am ever on the lookout for the slightest hint of what might come in the next expansion. In the trailer for Patch 6.1, we hear Y’shtola Rhul hint at her research into how to travel between the different shards or instances of our world. The Live Letter presentation with Yoshida also revealed that we’d be getting new side quests with resident himbo gentleman detective <a href=\"https://finalfantasy.fandom.com/wiki/Hildibrand_Manderville\">Hildibrand Manderville</a>, who we see wash up on the purple shores of The First. My guess and hope is that future patches — if not the next expansion —might involve traveling to the other versions of Eorzea.</p><div class=\"c-float-right\"><aside id=\"UA2r0i\"><q>Tataru is the hardest-working lalafell in Eorzea. Period. </q></aside></div><p id=\"No386J\"><em>Final Fantasy</em>’s best girl Tataru Taru is getting her own adventure in patch 6.1. <a href=\"https://finalfantasy.fandom.com/wiki/Tataru_Taru\">Tataru</a> is the hardest-working lalafell in Eorzea. Period. She is a queen. She is the moment. She is the reason Eorzea still stands because she makes sure the people whose job it is to protect it have had a snack and some water and a nap. It’s about time she got her own story for a change. And while I know her role is largely administrative, I hope there’s a future in which she could dust off her arcanist tome and join us for a dungeon crawl or two. </p><p id=\"uUmbMs\">Patch 6.1 will implement the Trust system for <em>A Realm Reborn</em> dungeons, meaning instead of waiting ages in a dungeon queue, you can party up with AI-controlled NPCs to complete a dungeon instead. The <em>Final Fantasy XIV</em> team is working on slowly rolling out the Trust system across the rest of the previous expansions.</p><p id=\"bnHyFx\">There’s also a new raid, Myths of the Realm: Aglaia, which involves the 12 gods of Eorzea —something hinted at toward the end of <em>Endwalker</em>. There will also be a new PvP battle, various and sundry class changes, and for the catboys out there, new hairstyles for hrothgar.</p><p id=\"z9efri\">There’s so much going on in Patch 6.1, and it presents the perfect opportunity to engage with the game outside of the main story quest line. Patch 6.1 <em>Newfound Adventure</em> launches on April 12th.</p><p id=\"e0No9J\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/K72WlN68fahOZ05OTrIWZ3Af4QM=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23360497/FFXIV_PUB_Patch6.1_01.png",
  "description": "Tataru Taru is the hardest-working lalafell in Eorzea.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}