{
  "title": "Firefighting strategies need an extreme makeover, UN warns ",
  "url": "https://www.theverge.com/2022/2/23/22947511/firefighting-budgets-united-nations-report-climate-change",
  "date": "2022-02-23T20:03:04.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"SFChronicleCalifWildfires\" src=\"https://cdn.vox-cdn.com/thumbor/XV6ihoprZL4_CXJoksyhX1Zd4Z0=/0x0:5472x3648/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70542075/1279741560.0.jpg\" />        <figcaption>A bulldozer sits on the side of Grayback Road in the devastation that left scores of structures destroyed and thousands of acres burned by the Slater fire in Happy Camp, Calif., on Tuesday, September 29, 2020. For millennia, the local Karuk tribe has conducted traditional prescribed burns in the area, and put together a climate change adaptation plan, a big piece of which is returning traditional fire to the landscape. They want Cal Fire to allow California tribal leaders to begin a training program in controlled burning techniques used for centuries by Native Americans until Europeans arrived and halted the practice, leading to overgrown forests.&nbsp; | Carlos Avila Gonzalez/The San Francisco Chronicle via Getty Images</figcaption>    </figure>  <p id=\"HsLWux\">Nations need to spend more money learning to live with wildfires rather than burning through cash fighting them, says a new United Nations <a href=\"https://www.unep.org/resources/report/spreading-wildfire-rising-threat-extraordinary-landscape-fires\">report</a>. The report predicts a dramatic rise in “extreme” fires and warns that there needs to be a “radical” shift in how governments address them. </p><p id=\"ISer8O\">Globally, extreme wildfires are expected to increase up to 14 percent this decade and 50 percent by the end of the century. Conventional firefighting, which tackles blazes as they happen, won’t be enough to meet the new threats, says the report published today by the United Nations Environment Programme and Norwegian environmental nonprofit GRID-Arendal. </p><p id=\"r2UsBM\">To cope, the report says, two-thirds of government spending on wildfires ought to go towards preparing for and adapting to big blazes. The remainder can go towards fighting fires in the moment. It’s a significant shift from today’s priorities. The majority of funding currently goes towards responding to wildfires, with less than 1 percent funneled into planning.</p><div class=\"c-float-right\"><aside id=\"zgSfJF\"><q>“Current government responses to wildfires are often putting money in the wrong place.”</q></aside></div><p id=\"mKhENi\">“Current government responses to wildfires are often putting money in the wrong place,” Inger Andersen, UNEP Executive Director, said in a <a href=\"https://www.unep.org/resources/report/spreading-wildfire-rising-threat-extraordinary-landscape-fires\">press release</a>. “Those emergency service workers and firefighters on the frontlines who are risking their lives to fight forest wildfires need to be supported.”</p><p id=\"HdTrNW\">Supporting those firefighters, the report says, means adopting more effective strategies for taming blazes. Much of the modern western world has emphasized stomping out all fires, even those that were a natural part of the ecosystem. Ironically, fire suppression can actually lead to more intense blazes because it allows dry tinder to build up on forest floors. </p><p id=\"AQchlo\">In contrast, some indigenous peoples like the Karuk Tribe in California traditionally set small, controlled fires that kept larger, spontaneous wildfires more manageable. The UN report recommends leaning into that indigenous knowledge and focusing on controlled burns and other ways to clear<strong> </strong>away dead branches and vegetation that can fuel forest fires. That might also include thinning out forests, letting livestock graze in strategic places, and encouraging the growth of less flammable plants to create fuel breaks.<strong> </strong>It’s an argument that’s been picking up steam lately. The Joe Biden administration released a 10-year wildfire <a href=\"https://www.theverge.com/2022/1/18/22889743/us-wildfire-10-year-plan-usda-forest-service\">plan</a> in January that emphasizes better forest management, including controlled burns. </p><p id=\"7Kr8VS\">The new report also notes that populations have grown in and around fire-prone areas, which can make wildfires even more disastrous. And with climate change priming more landscapes to burn — even in unexpected places like the Arctic — those communities need to be better prepped, the report says. That includes making<strong> </strong>homes and infrastructure more impervious to fire, putting out air quality alerts for smoke, planning evacuation routes, and earmarking more money for recovery efforts. Preserving some open spaces as buffers between people and wildfires is also key. The report also suggests establishing international standards to better protect the health and safety of firefighters.</p><p id=\"XFZLCR\">Limiting climate change by sticking to the goals of the Paris Agreement will also make it easier for countries to avoid more catastrophic fires, the report’s authors say. The climate crisis has made fire seasons longer and more intense as regions become hotter and drier. To make things worse, wildfires also add to climate change by releasing carbon dioxide when trees and vegetation burn.</p><p id=\"VnprmO\">“Eliminating the risk of wildfires is not possible,” the report says. “But much can be done to manage and reduce risks.”</p><p id=\"01r98O\"></p><p id=\"xjbg2A\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8EaNjbET9WzOY0mqOlB6vyi-tik=/0x392:5472x3257/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23265994/1279741560.jpg",
  "description": "Nations need to learn to live with more extreme blazes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}