{
  "title": "Fired Peloton employees crash new CEO’s first all-hands",
  "url": "https://www.theverge.com/2022/2/9/22926095/peloton-ceo-all-hands-fired-employees",
  "date": "2022-02-09T22:54:41.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ek2nyuXV6E5EPasrfxGko1pomRI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70490713/akrales_170407_1569_0850.0.0.jpg\" />        <figcaption><em>Will this drama never end?</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"oSrejA\">New Peloton CEO Barry McCarthy’s first day is not off to a good start. </p><p id=\"YyuJm0\">The company, which announced a major leadership shakeup at its Q2 earnings call on Tuesday, held an all-hands meeting meant to welcome McCarthy. Outgoing CEO John Foley was also in attendance. The all-hands was <a href=\"https://www.onepeloton.com/press/articles/a-message-from-john-foley\">referenced in a blog</a> penned by Foley revealing he was stepping down. While this is par for the course when companies change leadership, <em>CNBC</em> is reporting the meeting was cut short when angry ex-employees — who were just terminated — crashed the party.</p><p id=\"fwYWgo\">Citing anonymous sources, the <a href=\"https://www.cnbc.com/2022/02/09/peloton-ceos-first-all-hands-meeting-cut-short-as-ex-staff-crash-it.html\"><em>CNBC</em> report</a> says that current and former staffers flung accusations of mismanagement and vented about yesterday’s terminations. As part of cost restructuring measures, Peloton <a href=\"https://www.theverge.com/2022/2/8/22923229/peloton-layoff-new-ceo-mccarthy\">let 2,800 employees go</a> globally. One staffer apparently said they’d be selling all their Peloton apparel to pay bills, while others noted it was tone-deaf to allow fired employees into the chat. It wouldn’t be the only tone-deaf thing Peloton’s done. As part of their severance package, Peloton <a href=\"https://www.theverge.com/2022/2/8/22923480/peloton-severance-package-membership-layoffs\">offered the fired employees a free yearlong membership</a>. </p><p id=\"yxoaDK\">On the plus side, the former Peloton employees have already created a public spreadsheet in a bid to help each other find jobs. As of this writing, there are names and email addresses for over 260 former employees listed.</p><p id=\"tcmn60\">McCarthy has his work cut out for him. While Foley has borne the brunt of the blame for Peloton’s misfortunes, not all of his detractors welcomed McCarthy with open arms. Activist investor Blackwells Capital <a href=\"https://www.businesswire.com/news/home/20220124005269/en/Blackwells-Sends-Letter-to-Peloton-Board-of-Directors-Calling-for-New-Leadership-and-Initiation-of-Strategic-Alternatives\">called for Foley’s dismissal</a> weeks ago. Following news of McCarthy’s hiring, Blackwells Capital unleashed <a href=\"https://www.blackwellscap.com/wp-content/uploads/2022/02/BW_Peloton_Presentation_Feb072022.pdf\">a blistering 65-page slideshow</a> excoriating the move, alleging that it did nothing to address Peloton’s woes. Other analysts that <em>The Verge</em> spoke to <a href=\"https://www.theverge.com/2022/2/8/22923434/peloton-foley-ceo-layoffs-earnings-connected-fitness\">also voiced reservations</a>, saying McCarthy had no experience as a CEO since he had previously been a chief financial officer for Netflix and Spotify. </p><p id=\"p3geip\">Right now, it’s unclear whether McCarthy was brought on to rehab Peloton back to health to operate as an independent company or for a potentially lucrative sale. What is clear is that Foley remains an influential figure at the company, with him and his crew retaining 80 percent voting power. Foley also reiterated in the earnings call and <a href=\"https://www.onepeloton.com/press/articles/a-message-from-john-foley\">in a blog</a> that he looks forward to working together with McCarthy. It was a sentiment that McCarthy also echoed in an exclusive <a href=\"https://www.wsj.com/articles/peloton-ceo-john-foley-to-step-down-become-executive-chair-11644314403\"><em>Wall Street Journal</em></a> interview. </p><p id=\"esuqjT\">“Together, we can make a complete grown-up and build a really remarkable business,” McCarthy told the <em>WSJ</em>.</p><p id=\"bxhOAY\">On top of bad morale, McCarthy will have to steer Peloton through a difficult cost restructuring process and pressure from investors to sell the company. He’ll also have to find a way to rebalance Peloton’s inventory. During the pandemic, Peloton overinvested in its North American manufacturing capabilities, failing to anticipate that demand might cool off once quarantine restrictions were lifted. And if the past few months have been any indication, it might be a while before the dust settles on the Peloton saga. </p><p id=\"T6GxEr\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MjUVOs7Dhe5xZ3a1_E0pV4UcBsk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8399079/akrales_170407_1569_0850.0.jpg",
  "description": "Incoming CEO Barry McCarthy has his work cut out for him.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}