{
  "title": "Firefox’s anti-tracking feature adds per-account VPN for more privacy",
  "url": "https://www.theverge.com/2022/2/2/22914078/mozilla-vpn-multi-account-containers-add-on",
  "date": "2022-02-02T17:27:32.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/eTj3Elnb2v_KU_dWKXT6IRRTt90=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70462824/acastro_200207_3900_firefox_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1paWKh\"><a href=\"https://blog.mozilla.org/en/products/mozilla-vpn/multi-account-containers-add-on-on-mozilla-vpn/\">Mozilla is combining its Multi-Account Containers</a> add-on with its VPN service, which lets you keep your online personas — such as your work and personal browsing histories — separate. </p><p id=\"cKNj2t\"><a href=\"https://addons.mozilla.org/en-US/firefox/addon/multi-account-containers/\">Multi-Account Containers</a> has been available as a Firefox add-on since 2017. It works to “contain” your different online lives into separate tabs that you can label with colors, icons, or names. The containers just don’t hold your browsing histories — they also store cookies and tracking information, which means you can sign into different accounts on the same site just by clicking over to another container.</p><p id=\"1SdUYi\">But using the add-on with Mozilla VPN comes with a distinct advantage (well, at least in my option): the ability to hide your location across containers. As <a href=\"https://blog.mozilla.org/en/products/mozilla-vpn/multi-account-containers-add-on-on-mozilla-vpn/\">Mozilla’s blog post explains</a>, you can connect each of your online personas with a different server — for example, if you’re traveling abroad but want to check your online bank account back home, you can use the add-on to browse for local shops in one tab and then manage your personal finances from a server near your hometown in another.</p><p id=\"PtUmm2\">When combined with the Multi-Account Containers add-on, using Mozilla’s VPN can help mask your web activity even more, as it makes it harder for servers to track you based on where you’re accessing a site from. That makes it a cool way to see what’s trending on YouTube in two different countries at once and a crucial privacy tool for avoiding prying eyes trying to find a connection between your different online personas.</p><p id=\"IVk1B9\">While <a href=\"https://www.theverge.com/2020/7/15/21325316/mozilla-vpn-android-windows-launch-firefox-private-network-price\">Mozilla VPN only came out in 2020</a>, it would’ve been nice if the add-on was supported directly from the very start, considering just how useful it is, but now it’s here.</p><div class=\"c-float-right\"><aside id=\"FE5Q8g\"><q>Multi-Account Containers work to “contain” all your different online lives into separate tabs</q></aside></div><p id=\"jKO9uJ\">As for Mozilla’s multi-hop feature — which was first <a href=\"https://blog.mozilla.org/en/mozilla/mozilla-vpn-adds-advanced-privacy-features-custom-dns-servers-and-multi-hop/\">released for the desktop VPN back in September</a> —  it lets you route your online activity through two different servers, further covering up your tracks online. Today, the organization announced it’s adding support for the multi-hop feature on the Mozilla VPN Android and iOS app.</p><p id=\"CeZNYg\">Mozilla offers instructions on <a href=\"https://support.mozilla.org/en-US/kb/use-multi-account-containers-mozilla-vpn\">how to add Multi-Account Containers to Mozilla VPN</a>, as well as <a href=\"https://support.mozilla.org/en-US/kb/multi-hop-encrypt-your-data-twice-enhanced-security\">how to turn on the multi-hop feature</a> on mobile. Although Mozilla VPN is still a fairly new service, unique features, like its Multi-Account Containers, might make the feature easily accessible to users with more serious privacy concerns.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/78RxNPEIrphXEabfHripYCBLLUA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19704536/acastro_200207_3900_firefox_0001.0.jpg",
  "description": "The Multi-Account Containers add-on is now available for Mozilla VPN.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}