{
  "title": "First Thor: Love and Thunder trailer puts Mjolnir in Jane’s mighty hands",
  "url": "https://www.theverge.com/2022/4/18/22945556/thor-love-and-thunder-teaser-trailer-mcu-disney",
  "date": "2022-04-18T14:14:30.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/I1l79XXRokJ5Cqndp37oI4wfOiU=/0x29:844x592/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70762141/thorloveandthunder_teaser_printed_1_sht_v4_lg_crop.14.jpg\" />        <figcaption>Image: Marvel.com</figcaption>    </figure>  <p id=\"qKdeJd\">Jane Foster has always been more than the Odinson’s love interest, but you might not know that just from watching any of Marvel’s <em>Thor </em>movies so far — the last of which she simply wasn’t in. <em>Thor: Love &amp; Thunder </em>wants to fix that and then some, judging from <a href=\"https://www.youtube.com/watch?v=tgB1wUcmbbw\">its first trailer</a>. </p><p id=\"41ub0y\">For the most part, Love and Thunder’s first trailer does its best to catch you up with what all Thor Odinson’s (Chris Hemsworth) been up to in the time since he and the rest of the Avengers managed to defeat Thanos in <em>Endgame</em>. With the Mad Titan gone and peace mostly restored, Thor’s been off gallivanting with the Guardians of the Galaxy, working off his depression weight, and making the best of his life as one of the last living Asgardians. It’s unclear how much time Thor’s going to spend with the Guardians, but some of <em>Love and Thunder</em>’s story seems as if it’s going to focus on Thor journeying across the universe in order to meet other races of aliens like Marvel’s Olympians.</p><div id=\"AVcWbz\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Marvel Studios' Thor: Love and Thunder arrives only in theaters July 8. ❤️ + ⚡️ <a href=\"https://t.co/cQk5qki42d\">pic.twitter.com/cQk5qki42d</a></p>— Marvel Entertainment (@Marvel) <a href=\"https://twitter.com/Marvel/status/1516054354540711939?ref_src=twsrc%5Etfw\">April 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"2Y8unB\">Interestingly, Thor doesn’t seem to have all that much interaction with Valkyrie (Tessa Thompson) and the rest of the surviving Asgardians who’ve been trying to rebuild their society in the Norweigan town formerly known as <a href=\"https://marvelcinematicuniverse.fandom.com/wiki/T%C3%B8nsberg\">Tønsberg</a>. While Thor’s off in space exploring with Korg (Taika Waititi), it appears as if Valkyrie’s new position as New Asgard’s leader has unexpectedly led to a life of bureaucratic drudgery that keeps her away from battles. In sharp contrast to Val and Thor, who both seem to be taking a much more relaxed approach to things, <em>Love and Thunder</em>’s trailer also introduces an updated Jane Foster (Natalie Portman), who calls Mjolnir to her in the middle of a battle.</p><p id=\"Q0Qb07\">When last we saw this particular Jane variant (another recently appeared in <a href=\"https://gizmodo.com/what-if-turned-thor-into-marvels-most-obnoxious-only-ch-1847722191\"><em>What If, </em>where she was voiced by Portman</a>), she and Thor were still in the midst of falling in love, Asgard was still standing, and Thanos had not yet laid waste to the entire universe. <em>Love and Thunder</em>’s clearly pulling in elements of <a href=\"https://gizmodo.com/jane-foster-as-thor-a-comic-book-primer-1836613452\">Jane’s time as Thor</a> and the only person capable of wielding Mjolnir, which is an interesting bit of lore to bring her back into the films with. Given that <em>Love and Thunder </em>comes at a time when <a href=\"https://gizmodo.com/what-superhero-movies-need-to-remember-while-embracing-1845991628?utm_content=&amp;utm_campaign=io9&amp;utm_medium=SocialMarketing&amp;utm_source=twitter\">Marvel’s going all in on its multiverse</a>, though, one of the big mysteries looming over this new Thor is which universe she’s originally from and how that might factor into her future in the MCU.</p><p id=\"3qCedZ\"><em>Thor: Love and Thunder</em> is slated to hit theaters on July 8th, 2022.</p><p id=\"X9pUpx\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uc189cEzSWQmeaPqs99IReyfB3I=/347x0:2532x1144/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397260/Screen_Shot_2022_04_18_at_10.04.07_AM.png",
  "description": "The first Love and Thunder trailer is here.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}