{
  "title": "Fitbit recalls Ionic smartwatch after 78 reports of burns",
  "url": "https://www.theverge.com/2022/3/2/22957989/fitbit-ionic-recall-burns-smartwatch-fitness-tracker-refund",
  "date": "2022-03-02T13:51:14.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hqL4zAoz6Z3n_crrspLaaScpLCw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70569061/vpavic_170925_2023_0082.0.jpg\" />        <figcaption><em>The Ionic is being recalled as its battery may overheat and cause burns. </em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"GOLN6p\">Fitbit announced today that it’s working with the Consumer Product Safety Commission to voluntarily <a href=\"https://www.cpsc.gov/Recalls/2022/Fitbit-Recalls-Ionic-Smartwatches-Due%20to-Burn-Hazard-One-Million-Sold-in-the-U-S\">recall its Ionic smartwatch</a>. The company says it’s received over 100 reports of the watch’s lithium-ion battery overheating, as well as 78 reports of burn injuries to customers. </p><p id=\"bHjJxD\">“Customer safety is always Fitbit’s top priority and out of an abundance of caution, we are conducting a voluntary recall of Fitbit Ionic smartwatches,” Fitbit said in a statement. It went on to say that the reported cases represent less than 0.01 percent of units sold. Roughly 1 million Ionic smartwatches were sold in the US, with an additional 693,000 sold internationally. </p><p id=\"ZY4aZz\">If you have an Ionic smartwatch, Fitbit recommends you stop using it immediately. The company says it’ll provide prepaid packaging for returns and will issue a refund of $299. It says it’ll also extend a 40 percent discount code for select Fitbit devices. You can call at 888-925-1764 or visit Fitbit’s online refund center <a href=\"https://www.fitbitionic.expertinquiry.com/\">here</a>. </p><div class=\"c-float-right\"><aside id=\"f3UnsS\"><q>Owners will get a $299 refund and a 40 percent discount code for a new Fitbit</q></aside></div><p id=\"6TBAnC\">According to the CPSC, Fitbit received 115 reports in the US and 59 reports internationally of the Ionic’s battery overheating. More troubling, the company received 78 reports of burn injuries in the US and an additional 40 reports internationally. Of the reported burn injuries, Fitbit received two reports of third-degree burns and four reports of second-degree burns. </p><p id=\"nxXjdC\">Launched in 2017, the <a href=\"https://www.theverge.com/2017/10/2/16392612/fitbit-ionic-smartwatch-fitness-tracker-review\">Ionic</a> was Fitbit’s first real attempt at a smartwatch after <a href=\"https://www.theverge.com/2017/2/22/14703108/fitbit-bought-pebble-for-23-millionw\">acquiring Pebble</a>. It was one of the first wearables to introduce SpO2 sensors, but the watch <a href=\"https://www.wareable.com/fitbit/fitbit-ionic-shares-tumble-stumble-2391\">disappointed in terms of sales</a> due to its lackluster design and limited smart capabilities. Ironically, reviewers praised the Ionic’s weeklong battery life as one of its best features. Fitbit discontinued the Ionic in 2020.  </p><p id=\"oRORDz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5z2-dsiuDdx-uB4_Kylb2iQ067c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9361167/vpavic_170925_2023_0082.jpg",
  "description": "Fitbit’s offering owners $299 refunds",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}