{
  "title": "Five years on, Breath of the Wild’s open world is still unmatched",
  "url": "https://www.theverge.com/2022/3/3/22959702/zelda-breath-of-the-wild-open-world-five-year-anniversary",
  "date": "2022-03-03T16:00:00.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ZCJy3ZoBz7LFAje3TA2VCDRPlP4=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70574296/NintendoSwitch_TLOZBreathoftheWild_Presentation2017_scrn22.0.png\" />        <figcaption><em>The Legend of Zelda: Breath of the Wild.</em></figcaption>    </figure>  <p id=\"h9YofQ\">When <a href=\"https://www.theverge.com/2017/3/2/14787082/the-legend-of-zelda-breath-of-the-wild-review\"><em>Breath of the Wild</em> was released five years ago today</a>, its rapturous reception didn’t just happen because of how it represented a long-overdue revamp of the <em>Legend of Zelda</em> series’ stale formula. That certainly helped. But what really made it resonate was its revolutionary approach to open-world game design. </p><p id=\"87FBio\">Unlike typical open-world games that overwhelm you with endless quests and icons on the map, <em>Breath of the Wild</em> told you the endpoint right from the start and trusted the player to make their own way there. You get more powerful in <em>Breath of the Wild</em> by exploring the freely traversable world for yourself and mastering its emergent systems. Once you feel ready, you can take on the final boss — or put it off forever because, hey, simply existing in the world is a joy unto itself.</p><p id=\"tvEIg5\"><em>Breath of the Wild </em>is undoubtedly a landmark game, but five years on, I’m surprised it hasn’t had more impact on the genre at large. Open-world games take a lot of time to create even when society hasn’t been derailed by a pandemic, of course, but in a design sense, <em>Breath of the Wild</em> still stands alone.</p><p id=\"1OHYpO\">It’s not like games haven’t attempted to imitate <em>Breath of the Wild</em> in various ways, but the similarities tend to be superficial. <em>Genshin Impact</em> is the obvious example, an extremely popular free-to-play game that lifts the aesthetic, glider, bow-and-arrow combat, and a few other elements. But the minute-to-minute experience of playing <em>Genshin</em> is completely different — it’s more of a conventional action RPG and doesn’t adopt anything about <em>Breath of the Wild’</em>s world design.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/H3wHst9GqubSaumjLo7L8neySJg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23285182/50272117098_4902e671b7_k.jpg\">      <figcaption><em>Genshin Impact.</em></figcaption>  </figure><p id=\"8pqRlh\">The same is true for Ubisoft’s <em>Immortals: Fenyx Rising</em>, a Greek mythology-themed adventure that, for all its qualities, feels like a bargain-bin knockoff. Ubisoft is as responsible as any company for codifying conventional open-world game structure with series like <em>Assassin’s Creed</em> and <em>Far Cry</em>, and despite all appearances, <em>Immortals</em> fits firmly in that category. I enjoyed it for what it was but couldn’t help thinking it learned the wrong lessons from <em>Breath of the Wild</em>.</p><p id=\"l4XTZB\"><a href=\"https://www.theverge.com/22929852/horizon-forbidden-west-ps5-review\"><em>Horizon Forbidden West</em></a>, Sony’s latest PlayStation-exclusive open-world hit, seems to have taken some inspiration from <em>Breath of the Wild</em> in its slightly freer approach to climbing and, yes, Aloy’s new gliding ability. It doesn’t quite get there, though, with traversal still feeling restricted in comparison and a broader structure that’s still beholden to the neverending barrage of map icons. </p><p id=\"IiFm93\"><em>Forbidden West </em>is an impressive game, and its world is beautiful, but its design is so constricted that I wonder about the reasons for even setting it in an open world. At no point are you ever unclear about exactly what you need to do to progress the story. Traversing the world isn’t itself particularly rewarding, even though the combat encounters along the way can be exhilarating. Ultimately, the game is a tightly controlled experience that arguably is not improved by being set in a vast environment when compared to something more focused like <a href=\"https://www.theverge.com/2018/4/12/17223854/god-of-war-review-ps4\"><em>God of War</em></a> (2018). You’re mostly experiencing a similar flow of combat and sidequests and story beats, just riding a robot sheep in between them.</p><p id=\"H5o4eZ\">I don’t think that every open-world game needs to be designed like <em>Breath of the Wild</em>, but too often, I play games where the world itself is a drag. If these quests are on a list anyway, why do I need to go somewhere to start them? If encouraging exploration and traversal aren’t priorities, why am I spending so much time on foot? Rather than offering me various ways to fast travel, wouldn’t it be better if I actually wanted to slow travel?</p><p id=\"wm18aF\">Of course, many of these open-world games are accomplished and popular, and I also often feel like playing something where the goals are spelled out for me. I just wish more open-world games delivered on the promise of their premise. A game like <em>Breath of the Wild</em> could only have been set in an open world. Its world is the entire point of the game, providing both the motivation and the reward. </p><p id=\"AyjvNF\"><a href=\"https://www.theverge.com/2019/11/1/20941606/death-stranding-review-ps4-hideo-kojima\"><em>Death Stranding</em></a> was the first game I played that made me feel like its designers might have been taking notes from <em>Breath of the Wild</em>. <em>Death Stranding</em> is aggressive about giving you hyper-specific quests and adheres to a rigid structure, so you’re not generally exploring the world for the sake of it. But the game justifies its open-world design with an extreme focus on how you actually traverse the terrain. Like <em>Breath of the Wild</em>, each area of the map is a carefully considered environment in its own right, and your ability to move through it is a sign of your progress. <em>Death Stranding</em> forces you to consistently engage with the world in a similar way to <em>Breath of the Wild</em>.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9Rl_htQm8QgRe7ihUnyjg-rwisM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23235795/Horizon_Forbidden_West_20220210105333.jpg\">      <figcaption><em>Horizon Forbidden West.</em></figcaption>  </figure><p id=\"pSed0i\">It’s early days, but so far, my time with <a href=\"https://www.theverge.com/2022/2/23/22946279/elden-ring-review-ps5-xbox-pc\"><em>Elden Ring</em></a> is coming the closest to sparking the feeling of exploration and adventure that <em>Breath of the Wild</em> inspired. FromSoftware’s latest game is deeply oriented around allowing the player to explore and approach tasks their own way, and the environments are so intimately crafted that it seems like something exciting or horrifying could be around every rock or corner. <em>Elden Ring</em> builds on the blueprint of <em>Dark Souls</em>, another exploration-focused game but one set on much smaller stages, and the evolution into open-world design is as natural and successful as anyone could have hoped for. </p><p id=\"ASAqqn\"><em>Breath of the Wild</em>, <em>Death Stranding</em>, and <em>Elden Ring</em> all share barren, mysterious, disaster-stricken settings that are ripe for exploration from the start. That doesn’t necessarily make sense for all open-world games, many of which will always need to rely on a degree of direct exposition. Games like <em>Assassin’s Creed</em> and <a href=\"https://www.theverge.com/22157995/cyberpunk-2077-cd-projekt-red-review-xbox-ps4-ps5-pc-stadia\"><em>Cyberpunk 2077</em></a>, for example, benefit from dense urban environments with a wide variety of characters to interact with, which is an inherently different experience from trawling an atmospheric wasteland. In <em>Cyberpunk</em>’s case, having the list of quests on hand even feels fitting for a mercenary character with eyeball implants. </p><p id=\"MUnCUx\">I am still just a little surprised not to have seen many games take inspiration from the things that actually made <em>Breath of the Wild</em> special. Maybe it was just lightning in a bottle, and its status as a Switch launch title certainly fanned the hype flames, but the radical nature of its design made many other open-world games look antiquated. Nintendo is still aiming to release its still-untitled sequel this year, which will hopefully advance the concept further. In the meantime, though, I’m still going to be hoping for more open-world games that hit the same spot as <em>Breath of the Wild</em>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mX5Q1-mEHPTfK3IRnXhSqiTDnYY=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285224/NintendoSwitch_TLOZBreathoftheWild_Presentation2017_scrn22.png",
  "description": "A breath of fresh air.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}