{
  "title": "Florida Gov. DeSantis revokes Disney’s special tax status",
  "url": "https://www.theverge.com/2022/4/22/23037754/disney-florida-governor-desantis-signs-bill-tax-lgbtq",
  "date": "2022-04-22T20:17:51.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Orlando Exteriors And Landmarks - 2022\" src=\"https://cdn.vox-cdn.com/thumbor/Nrd6y6T13mbEkdLP1Q7hzMQn24w=/0x2:5100x3402/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70782344/1239734980.0.jpg\" />        <figcaption>Florida’s governor has signed a bill stripping Disney of its special tax status in the state | Photo by AaronP/Bauer-Griffin/GC Images</figcaption>    </figure>  <p id=\"yQlyCT\">Florida Gov. Ron DeSantis on Friday <a href=\"https://apnews.com/article/business-travel-florida-orlando-ron-desantis-5bbb7bd13c5357877f999aab96b33651\">signed a bill</a> stripping the Walt Disney Company of its special tax status in the Orlando area. The move is widely viewed as retaliation against Disney for its <a href=\"https://www.theverge.com/2022/3/30/23001747/disney-dont-say-gay-bill-florida-desantis\">criticism of the</a> state’s “Don’t Say Gay” law, a position DeSantis took umbrage at. </p><p id=\"0Lm0xg\">Disney CEO <a href=\"https://www.theverge.com/2022/3/11/22973199/disney-bob-chapek-apology-dont-say-gay-bill-florida\">Bob Chapek apologized</a> last month to employees who protested what they viewed as a failure by the company to support its LGBTQ community. Disney then issued <a href=\"https://thewaltdisneycompany.com/statement-from-the-walt-disney-company-on-signing-of-florida-legislation/\">a press release</a> that said its “goal as a company is for this law to be repealed by the legislature or struck down in the courts, and we remain committed to supporting the national and state organizations working to achieve that.”</p><p id=\"5gcsgc\">DeSantis said Friday he was “just not comfortable having that type of agenda get special treatment in my state,” <a href=\"https://www.nytimes.com/2022/04/22/us/politics/desantis-disney-florida.html?partner=slack&amp;smid=sl-share\">according to<em> The New York Times</em></a>. </p><p id=\"ys5a0c\">The Parental Rights in Education law — its official name— bars Florida educators from talking about “sexual orientation or gender identity” with students in certain grades and allows parents to sue school districts if a teacher mentions the topics.</p><p id=\"BX58dw\">Florida’s Republican-controlled legislature took swift action on the measure to end Disney’s special tax status, with the State House voting to <a href=\"https://www.nbcnews.com/politics/politics-news/florida-house-passes-bill-dissolve-disneys-special-self-governing-stat-rcna25337\">approve on Thursday</a> 68-38, following a 23-16 vote to approve in the State Senate. </p><p id=\"sIZi8q\">The law effectively dissolves any special tax districts in Florida created since 1968, including the Reedy Creek Improvement District that Disney has controlled for 55 years. It allowed the company to control decisions about its real estate holdings in the area, which includes four theme parks, two water parks, stores and restaurants, a sports complex, and hotels. Responsibility for Reedy Creek will now likely belong to Orange and Osceola counties, including <a href=\"https://www.wsj.com/articles/florida-senate-passes-bill-to-eliminate-disneys-special-tax-district-11650473902\">nearly $1 billion</a> in long-term bond debt. </p><p id=\"DNyWFo\">The Reedy Creek district will cease to exist as of June 1st, 2023, if the law remains in place.</p><p id=\"4mj6kk\">Disney didn’t immediately reply to a request for comment on Friday. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pN7urc-QRckJINUPQ-7kGjMxcWg=/0x696:5100x3366/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23409965/1239734980.jpg",
  "description": "The law had been in effect for 55 years.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}