{
  "title": "Ford Mustang Mach-E usurps Tesla Model 3 as Consumer Reports top EV pick of the year",
  "url": "https://www.theverge.com/2022/2/17/22939085/ford-mustang-mach-e-tesla-model-3-consumer-reports",
  "date": "2022-02-17T17:25:10.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/A6dA6Mth8oRddklemdunlEurD6U=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70521292/sokane_210125_4386_0024.0.jpg\" />        <figcaption>Photo by Sean O’Kane / The Verge</figcaption>    </figure>  <p id=\"PRoXuo\"><em>Consumer Reports </em>is swapping the Tesla Model 3 for the Ford Mustang Mach-E as its new top electric vehicle pick for 2022. The designation is sure to give Ford a morale boost as it seeks to outpace Tesla in the race to become the number one EV manufacturer in the US. </p><p id=\"cZcXzk\">Tesla has long dominated <em>CR</em>’s EV rankings, with the Model 3 holding the position for the past two years. But the publication says a variety of factors, including ride quality, reliability, and the in-car user experiences, have led it to crown a new winner in the Mustang Mach-E.</p><p id=\"OZLByU\">“Make no mistake, the Model 3 is still a great choice, and Consumer Reports recommends it,” <a href=\"https://www.consumerreports.org/hybrids-evs/ford-mustang-mach-e-replaces-tesla-model-3-as-cr-ev-top-pick-a6095541654/\"><em>CR</em>’s deputy editor Jeff Bartlett writes today</a>. “But the Mustang Mach-E is also very sporty, plus it’s more practical and easier to live with. The Ford is also quieter and rides better. Both cars have large infotainment center screens, but the Mach-E’s is far easier to operate and doesn’t require multiple steps to activate routine features, such as using the defroster or adjusting the mirrors, as with the Tesla.”</p><div class=\"c-float-right\"><aside id=\"a0FnLq\"><q>“the Mustang Mach-E is also very sporty, plus it’s more practical and easier to live with”</q></aside></div><p id=\"l1iwG9\"><em>Consumer Reports</em> sends its members a survey each year to gather information regarding reliability and drive quality, as well as a host of other factors. This year, the publication’s members “reported very few problems with the Mustang Mach-E so far, giving it an important advantage over the Model Y and even the Model 3.” (<em>CR </em>notes that the Mach-E is more similar to the Tesla Model Y than the Model 3 but that the Model Y’s issues with reliability have kept it out of its top picks.)</p><p id=\"IUlk6h\">Most notably, the publication praises Ford’s decision to include a driver monitoring system in the Mustang Mach-E, earning the vehicle an extra two points in its overall score. Tesla has long resisted efforts to include a DMS in its vehicles, despite pushing more software updates for its advanced driver assist systems that would benefit from a more robust driver monitoring system. </p><p id=\"eL7y1T\">Ford recently introduced its hands-free driver-assist system, dubbed BlueCruise, via an over-the-air software update to its 2021 Mustang Mach-E vehicles. (Owners pay $600 for a three-year subscription to BlueCruise.) An infrared sensor monitors the driver’s eye movements, and the vehicle will issue a series of alerts if the driver’s attention begins to wander. In contrast, Tesla’s system only requires a hand on the wheel and has no system for monitoring the driver’s visual gaze.</p><p id=\"nBj5l2\">This isn’t the first time <em>CR</em> has soured on the Model 3. Back in May 2018, the organization said it could not recommend the electric car due to a shockingly long stopping distance during emergency braking tests. Tesla CEO Elon Musk attacked <em>CR</em>’s methods, but later, <a href=\"https://www.theverge.com/2018/5/22/17381210/tesla-model-3-consumer-reports-braking-musk\">Tesla shipped an over-the-air update</a> that improved the vehicle’s braking distance by nearly 20 feet. The update mollified <em>CR</em>, which <a href=\"https://www.theverge.com/2018/5/30/17409782/consumer-reports-tesla-model-3\">went back to recommending</a> the Model 3.</p><p id=\"RUiQbm\">The Tesla-<em>Consumer Reports</em> relationship is a veritable <a href=\"https://www.theverge.com/2017/5/24/15681470/teslas-consumer-reports-autopilot\">roller-coaster ride</a>. Back in 2015, the publication <a href=\"https://www.theverge.com/2015/8/27/9214263/tesla-model-s-p85d-consumer-reports\">broke its own rating system</a> in its effusive praise of the Model S P85D. But that love affair started going south almost immediately when it surveyed about 1,400 Tesla owners and used that data to project a “worse-than-average overall problem rate” for new buyers over the lifespan of the vehicle. As a result, <a href=\"http://www.theverge.com/2015/10/20/9576335/tesla-model-s-reliability-consumer-reports\">it pulled its coveted “recommended” rating</a> for the Model S.</p><div class=\"c-float-right\"><aside id=\"raOOwn\"><q>Tesla looms large over the legacy auto industry</q></aside></div><p id=\"OajXtg\">Tesla looms large over the legacy auto industry, with the electric automaker accounting for nearly three-quarters of all EV sales in the US. The company’s stock price, which values Tesla more than nearly all US-based automakers combined, is the envy of its competitors. </p><p id=\"yZZU0r\">Ford, in particular, has its sights set on Elon Musk’s company. In a recent earnings call, the company’s CEO Jim Farley claimed that the upcoming Ford F-150 Lightning electric truck has the potential to outsell the Tesla Model Y, which is the top-selling EV in the US.</p><p id=\"Z54vRR\">“The F-150 Lightning, if we had full production today to meet our current demand, we would rival the Model Y as the leading [battery-electric vehicle] nameplate in the US market,” Farley said. </p><p id=\"YiXGQp\">Of course, the reason the F-150 Lightning is not outselling the Model Y is that Ford, like most automakers, was late to recognizing the need to switch from internal combustion engines to electric motors. Tesla was ahead of the game, and its early bet has since paid off in dividends. But the rest of the industry has finally caught up, and now the race is really on. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/S9tJPPARLI2lEhTuwEeayLEhU5w=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22278745/sokane_210125_4386_0024.jpg",
  "description": "CR thinks the Mach-E drives better than the Model 3.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}