{
  "title": " Ford F-150 Lightning first drive: quiet storm",
  "url": "https://www.theverge.com/23065908/ford-f150-lightning-electric-truck-first-drive-specs-road-bluecruise",
  "date": "2022-05-11T10:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BrGZF2XMSA5yd0MkWrK_pes48rA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70855539/ahawkins_220504_5202_0021.0.jpg\" />        <figcaption>Photo by Andrew Hawkins / The Verge</figcaption>    </figure>  <p>Ford’s first electric truck is fun, familiar, and checks all the boxes for a great entry-level EV</p> <p class=\"p--has-dropcap p-large-text\" id=\"MRA9NB\">I am driving a pickup truck through Texas hill country. The buzzards are circling overhead, the road is empty as a moonlit prairie, and all’s right with the world. </p><p id=\"9iyFsl\">Or at least it should be. There is a noticeable lack of engine noise coming from under the hood of my truck. That’s because there is no engine, only a vast, empty space. Ford calls it the “Mega Power Frunk,” which is a very dumb name for a very cool feature, one truck owners have been clamoring for for years: secure storage space. </p><p id=\"vzPiZz\">The advantages of the frunk are just one of many noteworthy things about the F-150 Lightning, Ford’s hotly anticipated electrified pickup truck. And yes, the F-150 Lightning is likely the most important electric vehicle yet to arrive, blah blah blah. I’m sure by now you’ve heard all the reasons why this plug-in pickup is so crucial for Ford, for the auto industry, for America, for our climate, etc. Ford electrified the most popular vehicle in America because of course they did. </p><div class=\"c-float-right c-float-hang\"><aside id=\"Au6KxP\"><q>Ford electrified the most popular vehicle in America because of course they did</q></aside></div><p id=\"sUhMki\">That said, there were a few things that surprised me — and even disappointed me — about this truck. There are certainly tradeoffs to electrifying something as popular and beloved as the F-series. But thankfully, the good outweighs the bad, and there’s nothing about the Lightning that left me feeling anything but optimistic about the shift from dirty, gas-powered vehicles to zero tailpipe emissions. </p><p id=\"4f3PZe\">Most people who buy a Ford F-150 Lightning (those who are lucky enough to actually get one) won’t have many opportunities to drive it up near-vertical rocky paths, or through knee-deep puddles of mud, or even on twisty surface roads while towing an 8,000-pound motorboat. But that’s what I got to do over the course of two days in and around San Antonio, Texas, where Ford summoned members of the media to experience the F-150 Lightning for the first time. </p><p id=\"BcGHa3\">And the experience was (apologies in advance for this one) enlightening. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wLuOzHaCA0wQdcKRwmZH2VZHMdw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447768/ahawkins_220504_5202_0015.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div><h2 id=\"noQ7Y4\">Drive impressions</h2><p id=\"MDWI1M\">On surface roads, the F-150 Lightning handles like a very sporty truck, much like its namesake. (A running joke over the course of the two-day trip was that Ford missed out on an opportunity to revive the original Lightning as a smaller, sportier electric pickup.) That said, it’s easy to forget you’re driving a 6,500-pound vehicle thanks to the truck’s low center of gravity. The truck’s pouch-style lithium-ion battery cells line the floor of the vehicle, which is not unique to electric vehicles — practically every EV on the market has a similar layout — but feels unique for a pickup truck. </p><p id=\"F0lnYP\">The near-instantaneous torque — 452 horsepower in the standard range, 580 horsepower for the extended range — is also typical for an EV but totally ludicrous for a truck the size of the F-150. I’ve driven a lot of EVs but not a lot of trucks, and the combination of power, acceleration, and size of the F-150 Lightning was thrilling — and even a little unsettling. </p><div class=\"c-float-left c-float-hang\"><aside id=\"2X8c0A\"><q>the combination of power, acceleration, and size of the F-150 Lightning was thrilling — and even a little unsettling</q></aside></div><p id=\"i1Qn5c\">For context, the V8 turbocharged diesels that Ford puts in <a href=\"https://www.ford.com/trucks/super-duty/\">its Super Duty trucks</a> (think F-250 to F-450) top out around 475 horsepower. Those engines do make 1,050 pound-feet of torque, which is more than the 775 pound-feet the Lightning can do. Still, the F-150 Lightning’s ability to leap from 0–60 mph in a little more than four seconds is truly astonishing. Over two days of driving, it never really got old. </p><p id=\"RfLGUZ\">While it was a blast rocketing along the Texas back roads, I found myself a little worried about how F-150 Lightning owners will handle the instant acceleration in denser settings, like the suburban communities where most F-150 owners live. That torque can be shocking, especially for first-time EV owners. Thankfully, the brakes appear to be more than up to the task of bringing the F-150 Lightning to a full stop with room to spare. It handled perfectly on both straightaways and twisty roads. </p><p id=\"00cX7n\">While not as humongous as the Hummer EV, the F-150 Lightning is still girthy, 35 percent heavier than its gas-powered equivalent, thanks to that 1,800-pound battery. Here’s where things get tricky for the F-150 Lightning’s environmental bonafides. Heavier vehicles are inherently more polluting than lighter ones, regardless of whether they emit any tailpipe emissions. All vehicles produce non-exhaust emissions from a variety of sources, including rubber tires, road dust, and brakes. This is especially true for electric vehicles, thanks to the added weight from their batteries.  </p><p id=\"aMhryI\">We don’t know yet how much non-exhaust emissions the F-150 Lightning will create, but we’re likely to find out soon enough. </p><div class=\"p-fullbleed-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UHJf7xIjG-C52b15Iuv9ZaBJR08=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447763/ahawkins_220504_5202_0010.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wK8VTf69UUuMmbSypccTiSiVC8k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447769/ahawkins_220504_5202_0016.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Lla8MaEda7KJJKJnxuk7BADSRaQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447764/ahawkins_220504_5202_0011.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vKJ6TTdE_AM6m5-HL89dknI0yJk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447772/ahawkins_220504_5202_0019.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div></div></div><h2 id=\"gWKr8T\">Battery capacity and charging</h2><p id=\"hOmq6I\">In terms of energy capacity, I found that I was getting around 2.3 miles per kilowatt-hour of battery usage on surface roads and highways. The base version of the truck, which starts at $40,000, is rated at 230 miles (370 km) of range and 68 MPGe (miles per gallon equivalent), which is the EPA’s unit of measurement for an EV’s energy consumption level to compare with gas-powered vehicles. If you want the bigger battery pack with 300 miles of range, Ford makes you buy a bunch of other options that bring the price up to $74,000. </p><p id=\"Pc6dGN\">Obviously those range numbers drop when you load up the truck bed with cargo or attach something heavy to the hitch. (More on that later.) But ultimately, I found the range and energy usage to be adequate for most driving scenarios.</p><div class=\"c-float-right c-float-hang\"><aside id=\"TX6eS3\"><q>For most EV-curious consumers, range anxiety is giving way to charging anxiety</q></aside></div><p id=\"rksWCQ\">For most EV-curious consumers, range anxiety is giving way to charging anxiety. Ford didn’t provide us with any opportunities to charge the F-150 Lightning, so I can’t speak to the time it takes to repower the battery. Charging is still a sore spot for most EVs. The truth is, unless Ford invests in building out its own dedicated network (which it’s not), there’s only so much the company can do to make the public charging experience better.</p><p id=\"nsvTrw\">Ford’s band-aid solution is that it has coalesced a handful of disparate independent public charging networks into what it calls the FordPass Charging Network. All of these chargers show up in the FordPass smartphone app as if they are one large network, and Ford is even working with some so that owners don’t need to create new accounts or download other apps to start charging. It’s a great idea in theory, but it needs more work.</p><p id=\"kaLuz7\">At home, a 120-volt outlet will trickle 3 miles per hour into the battery, while a 240-volt outlet can add around 14 miles per hour. The real standout charging feature is exclusive to the extended range versions: Ford is selling a new 80-amp home charging station that not only fully charges the F-150 Lightning in eight hours but allows owners to easily power their entire home for around three days — or even up to 10 days with minimal usage — in the event of a power outage.</p><p id=\"KtPta1\">The ability to draw power from the battery pack isn’t limited to these extreme scenarios, though. All of the base trims of the F-150 Lightning can put out 2.4kW of onboard power, and the more expensive Lariat and Platinum trims offer a total of 9.6kW of onboard power. The more expensive F-150 Lightnings also have 11 built-in power sockets — seven in the cab and bed, including a 240V outlet, and four in the front trunk — plus a handful of USB ports. </p><p id=\"KHbtpr\">Ford began playing with this idea of turning a vehicle into a mobile generator of sorts with the F-150 hybrid, but the higher trims of the F-150 Lightning will offer even more onboard power, and they won’t use gas to generate it. That’s not only a great feature for anyone who needs power on the go, but it could be a huge benefit for fleet operators or small businesses looking to go green.</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OGWUBoG34KP1X2HGkcAT5rpadNE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447775/ahawkins_220504_5202_0022.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div><h2 id=\"ZUDYRm\">BlueCruise</h2><p id=\"Igv7Iz\">On my first day driving the F-150 Lightning, I got to experience Ford’s hands-free driver assistance system, BlueCruise. This feature comes standard of the Platinum trim level and will cost extra to upgrade for Lariat trims. F-150 owners who opt for the $1,595 Ford Co-Pilot 360 Active 2.0 package can purchase BlueCruise for an additional $600.</p><p id=\"7IVom0\">I was excited to test out this feature because this was Ford’s long-awaited answer to General Motors’ Super Cruise, which is considered the gold standard for Level 2 advanced driver assist systems. (Tesla’s Autopilot does not allow for hands-free driving, though its Full Self-Driving beta system does.) </p><p id=\"3JqCwr\">These systems work in concert with a number of distinct features, like adaptive cruise control, automatic emergency braking, lane-keep assist, blindspot detection, pedestrian monitoring, and stop sign detection. On certain divided highways (Ford says it works on “over 100,000 miles”), F-150 Lightning drivers can take their hands off the steering wheel and feet off the pedals, while infrared sensors mounted in the dash monitor their eyes to ensure they stay focused on the road ahead. </p><div class=\"c-float-left c-float-hang\"><aside id=\"vzS3n1\"><q>I found the BlueCruise system very easy to engage and disengage</q></aside></div><p id=\"GWNsqA\">As soon as you enter an approved area, a notification appears on the gauge cluster informing you that BlueCruise is available. I found the system very easy to engage and disengage, which wasn’t always the case with other Level 2 systems. After you get over the initial urge to slam on the brakes every time a car merges into your lane, you eventually get to sit back and enjoy the convenience of the system. </p><p id=\"ES6uuz\">Like other automakers, Ford markets BlueCruise as an active safety feature, but I see them more as convenience features designed to take some of the stress out of long highway trips and stop-and-go traffic. </p><p id=\"5ipDY5\">I used BlueCruise for about an hour of driving, and I only had to disengage it twice: once when the system seemed to be steering toward a row of yellow barrels that mark the barrier between the highway and the off-ramp and another time when another vehicle merged dangerously in front of me. Otherwise, it worked like a charm. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1S_LbYOEmYq7s8IJpnQ2dCDNi04=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22638197/akrales_20210526_4595_0061.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure></div><h2 id=\"k3soUK\">User experience</h2><p id=\"6zzfqF\">Inside the F-150 Lightning will be a familiar world to many truck owners — with a few caveats. F-150 owners will recognize delightful features such as the gear shift that folds down to allow for an expanded workstation in the center console, with enough space for a laptop, a pad of paper, or even your lunch. For people who spend a lot of time in their trucks — while charging, perhaps — the two front seats can fold back pretty much totally flat. I didn’t attempt a nap, but I was tempted. </p><p id=\"t6Myz4\">The center stack touchscreen — standard 12-inch landscape or optional 15.5-inch portrait style — is the heart of the interior. The portrait-style touchscreen is similar to what’s found in the Mustang Mach-E and will likely become an optional feature for all F-series trucks in the near future. </p><div class=\"c-float-right c-float-hang\"><aside id=\"P0zRs2\"><q>Sync 4A works pretty seamlessly, with minimal lag</q></aside></div><p id=\"HHLqyJ\">The screen runs Ford’s Sync 4A, which is the latest version of the automaker’s infotainment system that debuted in the Mustang Mach-E. It pretty much operates in a two-pane layout, with the top two-thirds dedicated to navigation or media controls and the bottom third for climate and other vehicle functions. It also features wireless Apple CarPlay and Android Auto if you’d rather just work with the apps on your phone. That said, Sync 4A works pretty seamlessly, with minimal lag when switching between menus. </p><p id=\"RpNwOM\">There are four drive modes: normal, sport, tow/haul, and off-road. On surface roads, I stuck to normal, occasionally switching to sport when it seemed fit. The graphic display in the instrument cluster let me know how much power I was sending back to the battery through regenerative braking, which was useful information to see. The F-150 Lightning does not feature a heads-up display, though Ford’s engineers hinted that it could be coming to future models. </p><div class=\"p-fullbleed-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Or_vSOAoN6NHTQEYxl-Cov61PrA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447770/ahawkins_220504_5202_0017.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/b6MYD-dEcHhCuxBFQLz_swA_duU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447754/ahawkins_220503_5202_0002.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div></div></div><h2 id=\"xCG9I3\">Towing/Hauling</h2><p id=\"hhKBkH\">So I’ll just come right out and say it: I suck at driving large vehicles. And when those large vehicles are attached to other equally large vehicles, my skills are questionable at best. While towing a 24-foot-long speedboat out of a winery parking lot, I practically obliterated a metal-and-plastic sign standing outside the entrance. I’m fine admitting this. It’s good to know your limitations. I took some comfort from the security guard who told me I wasn’t the only one to do this. </p><p id=\"yiUIxz\">Perhaps I was paying too close attention to the wealth of information provided on the gauge cluster to notice the sign being crushed under the wheels of the boat behind me. Ford went the extra mile in taking a lot of the guesswork out of towing, enabling owners to create a profile based on the object being towed. In the case of the 8,000-pound boat, I could see that the added weight would shave almost 100 miles off my range, from 250 miles on a full charge to 161.7 miles.   </p><div class=\"c-float-left c-float-hang\"><aside id=\"iyIXNt\"><q>The experience of driving the F-150 Lightning while towing a boat felt pretty choppy (pun intended)</q></aside></div><p id=\"jvqR0G\">The experience of driving the F-150 Lightning while towing a boat felt pretty choppy. (Pun intended!) I could feel the weight tugging on the steering wheel while accelerating along a windy road. In other words, it wasn’t effortless, nor should it be. It’s important for drivers to be aware of the weight that they’re towing. </p><p id=\"kIrRv8\">On the other hand, hauling less than a thousand pounds of plywood <em>was </em>pretty effortless. After about 15 minutes, I almost forgot the wood was strapped down in the bed of the truck. Ford says the standard range versions of the Pro, XLT, and Lariat trims can tow a maximum of 7,700 pounds, while the extended range versions can take up to 10,000 pounds. The payload is rated for either 1,850 pounds or 2,235 pounds, depending on the trim level. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TFS5KWZiVs5Xrez6cpJSqJYBN4U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451559/F_150_Lightning_Lariat_off_road_03.jpg\">  </figure></div><h2 id=\"WyxK2r\">Off-roading</h2><p id=\"0IMVqT\">Another confession: off-roading in the F-150 Lightning was very, very fun. I drove over large, beach ball-sized rocks, down extremely steep loose-gravel roads, and through several deep puddles. The truck dispatched each challenge with relative ease. (Shout out to Ford’s spotters who made sure I didn’t drive off a cliff.)</p><p id=\"6fHg8u\">The course included two large holes into which I was directed to steer the truck’s front and rear driver-side tires. I was now stuck — or so I thought. Switching on the F-150 Lightning’s electronic-locking rear differential, which is housed in the rear axle and, when activated, allows both wheels on a specific axle to turn at the same speed, did the trick. I even attempted it without the rear differential activated, and while it took a little more effort, it still made it out. Old F-150’s featured ELD as a physical knob; in the Lightning, it’s located in a submenu of the touchscreen.</p><p id=\"MNCNHB\">Naturally, off-roading is more energy-intensive than normal driving. Ford accounts for this with its off-road driving mode, which offers real-time range estimates and independent front and rear suspension. The software factors in not just weather and traffic conditions, but it also uses an onboard scale to measure the weight of any payload or towing weight.</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/naGiD1PgQMVAY2QhpjaKfZfd9lQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447753/ahawkins_220503_5202_0001.jpg\">      <cite>Photo by Andrew Hawkins / The Verge</cite>  </figure></div><h2 id=\"pECBvt\">When can we ride the lightning?</h2><p id=\"idQxtg\">Based on my limited time with it, the F-150 Lightning is a great truck. It handles well, features a lot of cool tech, and will exceed the expectations of anyone who likes towing, hauling, or off-roading. (Ford insists this includes 80 percent of its customers.) Unfortunately, most people won’t get to experience the F-150 Lightning’s unique charms — at least, not this year. </p><p id=\"6PNwmh\">The number of electric F-150s Ford planned on making in its first few years of production has been a bit of a shifting target. At first, the company was only targeting 40,000 vehicles annually, eventually telling suppliers it expected that capacity to rise to 80,000 by early 2023. Now, that number has risen to 150,000 trucks by mid-2023 — though it’s unclear how many will reach customers this year. </p><p id=\"Xoghr0\">The company is using a “wave-by-wave reservation process” to inform customers when they can go online to spec out their Lightnings. Earlier this year, Ford <a href=\"https://www.theverge.com/2021/12/9/22826469/ford-f150-lightning-ev-deposits-reservations-closed\">stopped taking reservations</a> after having collected 200,000 refundable $100 deposits for the Lightning since it debuted in May 2020. (Reservations are still closed as of the publication of this article.)</p><div class=\"c-float-right c-float-hang\"><aside id=\"JtiLZ2\"><q>The challenges of ramping up production on a hotly anticipated EV are not unique to Ford</q></aside></div><p id=\"8BA7RU\">The challenges of ramping up production on a hotly anticipated EV are not unique to Ford. The entire auto industry is struggling to meet demand for electric vehicles, especially as high gas prices have consumers casting about for more affordable options. Parts are in short supply, especially materials for lithium-ion batteries. With a starting price of $40,000 and as familiar a nameplate as F-150, Ford is uniquely positioned to gobble up that demand — if it can just make enough trucks.</p><p id=\"lv7BuF\">While stopped at a traffic light north of San Antonio, a man in a Ford Escape pulls up next to me and asks how I’m liking it. I tell him, “I’ll show you,” and as soon as the light turns green, I punch it, blasting ahead to the next light. Eventually, the man catches up and lets out a whistle of approval. </p><p id=\"A2fEwZ\">“I’d love to get my hands on that truck,” he grins. </p><p class=\"c-end-para\" id=\"tR95Fj\">Buddy, good luck to you.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ELVsxApDdIrW3DfVbblrqY7wrWk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23447774/ahawkins_220504_5202_0021.jpg",
  "description": "Ford stuck to the basics with its first electric truck, and that’s OK.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}