{
  "title": "Ford’s ‘radical’ move to split the company won’t come easy",
  "url": "https://www.theverge.com/2022/3/2/22958243/ford-split-compoany-risks-model-e-blue-ev",
  "date": "2022-03-02T21:17:01.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/z65_tU39C7rprw1AOmxCJYgHrM8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70571635/akrales_20210526_4595_0223.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"4F5RGb\">Ford’s decision to divide its business into two separate entities — one focused on electric vehicles and the other on gas-powered ones — may complicate the automaker’s efforts to recruit top-tier talent and could risk upsetting dealers already chafing under the shift to electrification, auto analysts and experts said Wednesday. </p><p id=\"otDsi6\">Ford also isn’t going so far as to spin off its EV divisions entirely as a separate business, as some major Wall Street banks advised. The automaker’s share price could suffer as a result. By keeping both divisions within the same company, Ford is entwining their fates. Ford Model E won’t succeed without the profits and efficiencies created under Ford Blue.</p><p id=\"FQiq2k\">On Wednesday, <a href=\"https://www.theverge.com/2022/3/2/22958002/ford-electric-cars-model-e-business-blue-doug-field-evs\">Ford announced the creation of two separate entities</a>: Ford Model E, focused on electric vehicles and advanced software projects; and Ford Blue, dedicated to the automaker’s much larger and profitable internal combustion engine vehicles. It’s a bold move — one analyst called it “radical” — but will come with some serious risks. </p><div class=\"c-float-right\"><aside id=\"kwYxRZ\"><q>By keeping both divisions within the same company, Ford is entwining their fates</q></aside></div><p id=\"KIOU30\">Ford isn’t trying to pit the two sides against each other. And it likely won’t have much of a visible effect for people out shopping for cars today. There won’t be two different dealerships to cross-shop the F-150 and the F-150 Lightning — at least not right away. </p><p id=\"wOLfzT\">Ford framed it as a necessary move that will help it better compete with companies like Tesla that have the luxury of focusing on only one type of vehicle technology. But as with everything that Ford does, it will come with 118 years’ worth of baggage that may hamper the company’s $50 billion EV push. </p><p id=\"BXsfta\">The move was “radical and rational,” said Jessica Caldwell, executive director of insights at Edmunds. “Right now, it’s almost as if Ford is running two companies anyway,” she added, “so it makes operational sense to draw lines between the two as it likely gives the employees more focused goals.”</p><p id=\"y9nVWR\">But that could hurt the company’s efforts to attract talent and recruit new workers. “Some might view the internal combustion engine line of business as a less exciting dinosaur of the past compared to the more compelling EV products of the future,” Caldwell said.</p><p id=\"tnERtR\">Michael Ramsey, vice president of automotive at Gartner, noted that Ford risks creating an internal imbalance, in which the Ford Blue employees are forced to watch as the profits from their work are plowed into the less profitable, more cost-intensive Ford Model E side of the business.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9zYDU3J7u_nBWA_AQReoQk8He-4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283726/unleashing_ford_plus_plan.jpg\">      <cite>Ford</cite>  </figure><p id=\"a2nfrX\">“It does get a little fraught when so much of the R&amp;D money is flowing towards a relatively small business,” he said. “It has the potential of separating the company into the good side and the bad side.”</p><p id=\"unvJud\">Ford executives faced similar questions during a call with investors Wednesday morning. Ford Blue’s newly named president Kumar Galhotra, who also serves as president of Americas and Internal Marketing Group, described the automaker’s traditional ICE business as “incredibly exciting, and as the “profit engine for the company for years to come.”</p><p id=\"ez81RQ\">Listing off all of Ford’s products that will come under the auspices of Ford Blue, such as the Bronco, Raptor, Mustang, and the top-selling F-series trucks, Galhotra said the Ford Blue employees will have a lot to be proud of and insisted that morale will be a top priority. </p><div class=\"c-float-right\"><aside id=\"xTpW0C\"><q>“It has the potential of separating the company into the good side and the bad side”</q></aside></div><p id=\"B1SPMB\">“All of these teams, literally not to be cliché, they bleed for Blue,” he added.</p><p id=\"A1bxob\">Ford claims that the two sides won’t be completely siloed off from each other. There will be synergies and shared technologies. Take, for instance, the BlueCruise advanced driver-assist system: it will be developed by software engineers on the Ford Model E side but will also come as an option to the ICE vehicles that are produced by the Ford Blue side. </p><p id=\"Btprmq\">Ford is no stranger to bifurcated corporate structures, having split off its Ford Pro commercial entity last year. But the company <a href=\"https://www.cnbc.com/2022/02/18/ford-shares-pop-on-report-of-potential-spin-off-of-ev-business.html\">resisted calls from Wall Street</a> to go further by spinning off its EV division as a completely separate business, which likely would have been a more expensive proposition that would have enriched the banks and capital lenders but done little to advance the automaker’s EV ambitions. </p><p id=\"Gwb7OO\">For example, the company has announced plans to <a href=\"https://www.theverge.com/2021/9/27/22696427/ford-ev-battery-factory-tennessee-kentucky-investment\">spend $11.4 billion</a> along with battery manufacturer SK Innovation on several new factories in Tennessee and Kentucky. Those factories will be focused on the development and production of EVs and the batteries that power them. To do so, Ford will need to invest in the raw materials needed to develop EV battery packs on a mass scale and identify a process for recycling those batteries when they reach the end of their life. It will be among the most expensive transitions ever attempted by Ford. </p><p id=\"5cWNoL\">That will depend on Galhotra and his ability to successfully cut $3 billion in “structural costs” from Ford’s profitable internal combustion engine business, the company’s executives said today. </p><p id=\"dM7lAr\">Ford also sees the split as a more efficient way to address its dealer problem. EV sales are surging, but dealers have been slow to embrace the shift. <a href=\"https://www.cnbc.com/2021/06/13/gm-ford-are-all-in-on-evs-heres-how-dealers-feel-about-it-.html\">Many have expressed concerns</a> about losing money on EV sales since electric vehicles require fewer repairs and less frequent maintenance. And they’re skeptical of over-the-air software updates, pushed out by the automakers, that could also ultimately diminish their bottom line. </p><p id=\"uIhTiy\">Ford says it is sticking with the dealer franchise model — and it really doesn’t have much of a choice. Many US states ban direct-to-consumer car sales, which is Tesla’s preferred sales model. Ford says its dealers will be encouraged to “opt in” to a revamped customer experience and transparent pricing. There will be no inventory, which shouldn’t come as a complete shock to anyone shopping for a new car today during the global chip shortage. All sales will be “order to delivery,” and pricing will be transparent — and likely non-negotiable. </p><div class=\"c-float-right\"><aside id=\"OnKlcM\"><q>Ford says it is sticking with the dealer franchise model — and it really doesn’t have much of a choice</q></aside></div><p id=\"MWo3pp\">“Those are the key tenets of that experience,” Galhotra said. </p><p id=\"mt39sQ\">Sam Abuelsamid, principal analyst for electric mobility at Guidehouse Insights, said he thinks dealers will go beyond “opting in” to Ford’s new customer experience and will actually start to specialize in EV sales. That could mean dealerships with hundreds of cars on their lot may become a thing of the past, as dealers move toward a smaller footprint, with a few cars available for test drives but most customers ordering and customizing their vehicles directly from the factory. </p><p id=\"0oqESE\">Under that model, dealers could end up saving money, even as they lose revenue on repairs and maintenance, Abuelsamid said. “Yeah, you don’t have oil changes, but there’s other service work that needs to be done and hardware that needs to be fixed,” he added. </p><p id=\"LA2oie\">Ford CEO Jim Farley said dealers should be “ready to specialize.” By cleaving its business in two to better prepare for the turbulent times to come, the company is hoping to be seen as setting the right kind of example. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/D7I7Zp__qAxln5PTHqz00U65FKY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22638209/akrales_20210526_4595_0223.jpg",
  "description": "Ford is risking it all with a \"radical\" move to split the company.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}