{
  "title": "Ford says the F-150 Lightning is more powerful than it originally announced",
  "url": "https://www.theverge.com/2022/5/2/23054313/ford-f-150-lightning-horsepower-payload-numbers-increase",
  "date": "2022-05-02T23:39:13.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5d1Vz3BpinMH_ruIMowrh0x9mBw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70824893/akrales_20210526_4595_0115.0.jpg\" />        <figcaption><em>Up to 580 buff horses.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"w0zSi8\">Ford <a href=\"https://www.theverge.com/2022/4/26/23042056/f-150-lightning-ford-ev-jim-farley\">just started shipping</a> its electric F-150 Lightning on April 26th, but it already has a surprise for soon-to-be owners: all versions of the truck will have higher horsepower than it originally announced, and the standard range model will have an even higher payload capacity, according to <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2022/05/02/f-150-lightning-more-horsepower-more-payload.html\">a press release from the company</a>. While that’s good news for anyone who’s already got a pre-order, it could end up increasing the FOMO for those who don’t, and can’t get one — Ford <a href=\"https://www.theverge.com/2021/12/9/22826469/ford-f150-lightning-ev-deposits-reservations-closed\">stopped taking pre-orders for the truck</a> in December, and is <a href=\"https://www.theverge.com/2022/4/26/23042056/f-150-lightning-ford-ev-jim-farley\">currently figuring out</a> how to reach its goal of producing 150,000 Lightnings per year.</p><p id=\"6W7sVP\">When Ford <a href=\"https://www.theverge.com/2021/5/19/22442777/ford-f-150-lightning-electric-truck-specs-price\">announced its electric pickup in May 2021</a>, the company estimated the standard battery pack version would make 426 horsepower, and the extended range version would make 563. Now that it’s actually building them, those numbers have gotten a bump: the standard range will produce 452 horsepower, and the extended will get a whopping 580 horsepower. For context, the V8 turbocharged diesels that Ford puts in <a href=\"https://www.ford.com/trucks/super-duty/\">its Super Duty trucks</a> (think F-250 to F-450) top out around 475 horsepower — though those engines do make 1,050 pound-feet of torque, which is more than the 775 pound-feet the Lightning can do. </p><aside id=\"jps9aJ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The F-150 Lightning is finally shipping — is Ford ready?\",\"url\":\"https://www.theverge.com/2022/4/26/23042056/f-150-lightning-ford-ev-jim-farley\"}]}'></div></aside><p id=\"MHcysg\">The payload capacity for the truck, or how much weight it can hold in the bed, cab, and <a href=\"https://insideevs.com/news/548283/ford-lightning-electric-truck-frunk/\">frunk</a>, has also gotten a bump. Ford’s announcement says that “properly equipped F-150 Lightning pickups can now haul an extra 235 pounds for a total 2,235 pounds of maximum available hauling capability.” There is a bit of mystery here though — when Ford announced the Lightning, it said that only the standard-range model could haul 2,000 pounds. The extended range’s extra batteries meant it was limited to a maximum of 1,800 pounds. Ford didn’t immediately respond to<em> The Verge</em>’s request for comment about whether that model is also getting a payload capacity bump.</p><p id=\"cNMeQN\">It’s also worth noting that these figures are likely to be best-case numbers. Ford’s press release notes they’re calculated from the “peak performance of the electric motor(s) at peak battery power,” so your truck may make less horsepower 250 miles into a trip than it will fresh off the charger. Ford also says that “horsepower, torque, payload, towing and targeted EPA-estimated range are independent attributes and may not be achieved simultaneously,” which again makes sense — trucks just won’t be as zippy when they’re hauling a 7,700-pound trailer (the maximum the standard-range model is rated for).</p><p id=\"86122z\">Despite those caveats, it’s still pretty neat that the F-150 Lightning is even more powerful than Ford originally predicted. That’s kind of been the story with this truck; in March, <a href=\"https://www.theverge.com/2022/3/21/22989234/ford-f150-lightning-epa-range-electric-truck\">Ford announced </a>that the extended-range Lightning could go about 30 miles further on a charge than it predicted. While it may be quite a while before you can walk into a dealership and buy one (or <a href=\"https://www.theverge.com/2022/1/8/22872969/ford-f-150-lightning-electric-pickup-resale-ban-dealerships-year-scalping-shortages\">pay a scalper for one</a>), the F-150 Lightning continues to be quite an interesting EV.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/57vZWt-dBmstdieLL2u1GTCqy2U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22638201/akrales_20210526_4595_0115.jpg",
  "description": "Ford now says it’ll make up to 580 horsepower.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}