{
  "title": "Former eBay executive pleads guilty to harassment campaign involving live insects",
  "url": "https://www.theverge.com/2022/5/14/23073054/former-ebay-executive-pleads-guilty-intense-harassment-campaign-david-harville",
  "date": "2022-05-14T22:19:00.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Ireland Rouses From Recession Woes\" src=\"https://cdn.vox-cdn.com/thumbor/_MdM1zUj_VZdaFf-_f4tbpQ3D6A=/1x0:3999x2665/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70870079/164680387.0.jpg\" />        <figcaption><em>David Harville was eBay’s former director of global resiliency.</em></figcaption>    </figure>  <p id=\"qaNyVQ\">eBay’s former director of global resiliency, David Harville, pleaded guilty to taking part in a <a href=\"https://www.theverge.com/2020/6/15/21291666/ebay-employees-arrested-journalist-harassment\">bizarre harassment campaign</a>, which involved sending live cockroaches, spiders, a bloody pig face mask, and other strange items to a Massachusetts couple (via <a href=\"https://www.theguardian.com/technology/2022/may/12/ebay-executive-guilty-boston-couple-harassment\"><em>The Guardian</em></a>). Harville is the last of seven eBay employees to plead guilty to harassing and stalking the pair.</p><p id=\"AIuwl7\">In 2020, the Department of Justice (DOJ) <a href=\"https://www.theverge.com/2020/6/15/21291666/ebay-employees-arrested-journalist-harassment\">charged former eBay employees</a> Harville, James Baugh, Stephanie Popp, Brian Gilbert, Stephanie Stockwell, Veronica Zea, and Philip Cooke with devising a harassment campaign targeting Ina and David Steiner, the publishers behind the <em>EcommerceBytes</em> newsletter. The group’s scheme was meant to intimidate the Steiners over their publication’s negative coverage of eBay. It not only involved harassing the Steiners on Twitter and doxing their address online, but later escalated to mailing grotesque items to their home and in-person surveillance.</p><div class=\"c-float-right\"><aside id=\"uXDYIc\"><q>Harville pleaded guilty to five felony counts</q></aside></div><p id=\"TPn7Qc\">Harville pleaded guilty to five felony counts during a video call with a Boston federal court judge on Thursday. According to the <a href=\"https://www.justice.gov/usao-ma/pr/six-former-ebay-employees-charged-aggressive-cyberstalking-campaign-targeting-natick\">original filing</a>, Harville allegedly took a flight from California to Boston with the intent of driving to the Steiner’s home, breaking into their garage, and attaching a GPS tracking device to their vehicle. Harville wasn’t the only higher-up involved, either — Popp served as eBay’s former senior manager of global intelligence, Gilbert was the ex-senior manager of special operations, Baugh worked as eBay’s senior director of safety and security, and Stockwell was a former manager for the company’s Global Intelligence Center.</p><p id=\"ytdE7p\">In April, <a href=\"https://www.justice.gov/usao-ma/pr/former-ebay-executive-pleads-guilty-his-role-cyberstalking-campaign\">Baugh pleaded guilty</a> in connection with the harassment scheme and faces up to 20 years in prison — his sentencing takes place on September 29th, 2022. Popp, Stockwell, Gilbert, and Cooke all pleaded guilty in 2020. <a href=\"https://www.theverge.com/2021/7/27/22596598/ebay-cyberstalking-campaign-ecommercebytes-philip-cooke-sentenced\">Cooke was subsequently sentenced to 18 months in prison</a>.</p><div id=\"aMdAMg\"><iframe src=\"https://embed.documentcloud.org/documents/22014930-david-harville-ebay-plea-agreement/?embed=1&amp;responsive=1&amp;title=1\" title=\"david-harville-ebay-plea-agreement (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/IS7RoFN47ALEwRH7YmxW3dPRy68=/0x286:4000x2380/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23467894/164680387.jpg",
  "description": "The bizarre campaign targeted a newsletter publisher.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}