{
  "title": "Fortnite’s Zero Build mode is bringing people back to the game",
  "url": "https://www.theverge.com/2022/4/15/23024470/fortnite-zero-build-mode-player-return-twitch-the-fierce-diva-sypherpk",
  "date": "2022-04-15T13:25:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5A0C434TDIBNJ74HPpIVgiCZ-eo=/12x0:1625x1075/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70752879/Fortnite_Zero_Build_Gameplay_Trailer___No_Build_Battle_Royale_0_21_screenshot.0.png\" />    </figure>  <p id=\"F6MK18\"><em>Fortnite’s</em> latest season kicked off a big shakeup: developer Epic Games <a href=\"https://www.theverge.com/2022/3/20/22987308/fortnite-chapter-3-season-2-battle-pass-doctor-strange\">removed building</a>, perhaps the game’s most iconic feature, from the core battle royale modes. It was a risky move that had the potential to lessen interest in the game. Instead, it appears to have had the opposite effect — especially for some big streamers. </p><p id=\"Ftik87\">Not everyone was on board with what Epic <a href=\"https://www.theverge.com/2022/3/29/23001300/fortnite-zero-build-mode\">now calls Zero Build mode</a> right away. “Initially, I hated it and I was absolutely furious,” <a href=\"https://www.facebook.com/thefiercedivaa/\">Michael “The Fierce Diva” Reynolds</a>, a Facebook Gaming streamer, told me in an interview. “Since I play the game so much, the way people would assess my skill is due to how I build and edit and things of that nature. But my movement and all that stuff, I’m not so good at it.” </p><div class=\"c-float-right\"><aside id=\"6iHcOv\"><q>“I thought I was initially going to hate it.”</q></aside></div><p id=\"jEIkZl\">Reynolds wasn’t the only one. “I thought I was initially going to hate it,” Twitch streamer <a href=\"https://www.twitch.tv/sypherpk\">Ali “SypherPK” Hassan</a> told me. “I thought maybe I would make a couple of videos about it and then move back to the normal building mode.”</p><p id=\"ywuL88\">But both have since come around. “Once I got used to the way you would move around the map without the builds, I had a lot of respect and appreciation for it,” Reynolds said. “I’ve been having such a great time playing that game,” Hassan said. It’s not just those two; I’ve seen a lot of streamers who hadn’t been playing much <em>Fortnite</em>, like <a href=\"https://youtu.be/N0IEVsy3Yuk\">DrLupo</a>, <a href=\"https://www.youtube.com/watch?v=nC5rhhltx6w\">TimTheTatman</a>, <a href=\"https://www.twitch.tv/videos/1449184776?filter=archives&amp;sort=time\">Nickmercs</a>, and <a href=\"https://www.twitch.tv/videos/1447293620?filter=archives&amp;sort=time\">Tfue</a>, jumping into the game once again.</p><p id=\"AcgAIf\">Removing building also makes the game more approachable, Hassan argued. “<em>Fortnite</em> was slowly becoming inaccessible for new players,’’ he said. “Anybody who was interested in playing semi seriously was just getting destroyed by people with years of experience in building and editing.” You just need to watch a bit of <em>Fortnite’s</em> official competitive matches to see <a href=\"https://www.twitch.tv/videos/1417393600\">how well</a> high-level players can build, and in my experience, getting instantly built around by experts can be deflating.</p><div class=\"c-float-right\"><aside id=\"RaoNC8\"><q>“I really enjoy mixing it up.”</q></aside></div><p id=\"XJua2b\">Both Reynolds and Hassan have seen a lot of interest in Zero Build mode. Reynolds told me that at one point when he played <em>Fortnite’s</em> Arena mode, which did <em>not</em> lose building, “people were so excited to see no build and see streamers create content around that that I had taken a hit that day.” Now that building <a href=\"https://www.theverge.com/2022/4/2/22999741/fortnite-chapter-3-season-2-building-returns-zero-build-mode\">is back in non-competitive battle royale</a>, Reynolds says he spends about three-quarters of a stream in the build mode and then switches to Zero Build. “I really enjoy mixing it up.”</p><p id=\"QUPuu4\">Hassan’s team shared some stats demonstrating how the new mode led to more viewers, and he apparently saw a 30.3 percent increase in average viewers during the first week of this season as compared to the first week of Chapter 2 Season 8. (His team didn’t share stats comparing the most recent season, Chapter 3 Season 1, because it brought <a href=\"https://www.theverge.com/2021/12/5/22817392/fortnite-chapter-3-season-1-spider-man-new-island\">a massive, island-changing overhaul</a> that meant numbers were more inflated than they typically would be.) Twitch also told me the first week of the new season had roughly 23 million hours watched — the highest <em>Fortnite</em> watch time on Twitch in over a year.</p><p id=\"krInHY\">While Zero Build mode has been popular, it’s unclear if Epic plans to keep it in the game after this season. I asked both streamers if they think Zero Build will stick around. “I want to say I do because I think that I want it to,” Reynolds said. “As long as people continue to [enjoy it], I don’t see why it wouldn’t stay. And I hope it stays, personally.”</p><div class=\"c-float-right\"><aside id=\"0DeOqp\"><q>“I think if Fortnite is smart, they’re going to be willing to experiment even more”</q></aside></div><p id=\"QBqoMv\">Hassan said that if Epic leaves the mode as-is and as a separate one that doesn’t get updated, “I think people will eventually get bored of it and want more. I don’t think it can last more than a season in its current state.” But he also talked to me about the intriguing potential for a hybrid of the build and no-build modes. “I think if <em>Fortnite</em> is smart, they’re going to be willing to experiment even more and potentially have some sort of either limited thing or ability-based building where you just press one button and it builds a box or a bridge and you can still have those building mechanics,” he said.</p><p id=\"T9Ernk\">I also asked both streamers about what makes <em>Fortnite</em> stand out now that building isn’t a requirement.</p><p id=\"ZxWM46\">“<em>Fortnite</em> has an amazing foundation compared to other traditional battle royale games on the market,” Reynolds said in an email. He mentioned how it’s easy to move around the map and pick up weapons as well, which has been enhanced by the addition of mechanics like <a href=\"https://www.theverge.com/2022/3/22/22990926/fortnite-no-building-chapter-3-season-2-epic-games\">sliding and sprinting</a>. “I think <em>Fortnite</em> is showing the industry that it doesn’t need building to be as exciting as it once was.” And on our call, he talked about <em>Fortnite</em>’s impressive cadence of weekly updates, which sometimes add <a href=\"https://www.theverge.com/2022/1/18/22888226/fortnite-update-tilted-towers-monsters-kaws\">new mechanics and locations</a>.</p><p id=\"DUmsQj\">Hassan argued that building was key to the initial success of <em>Fortnite</em>, “but what people need to realize is that <em>Fortnite</em> has come a long way since.” He brought up the many collaborations with franchises like <a href=\"https://www.theverge.com/2020/8/27/21402707/fortnite-chapter-2-season-4-marvel-nexus-war-thor-iron-man\">Marvel</a> and <a href=\"https://www.theverge.com/2021/10/15/22727951/batman-fortnite-comic-crossover-foundation-lore-story-skin\">DC</a> and the addition of the <a href=\"https://www.theverge.com/2018/12/5/18127222/fortnite-creative-mode-season-7-release-date\">Creative mode</a> that lets people make their own experiences. He also mentioned the regular updates: “A normal <em>Fortnite</em> update on any given Tuesday could be potentially comparable to an entire new season [for] another battle royale.”</p><p id=\"nXEHag\">In an email after the interview, Hassan indicated that viewership was staying up. “My chat is really enjoying Zero Build and our viewership is besting even our recent spikes,” he said. “<em>Fortnite</em> with Zero Build might not be at its previous peak, but it sure feels like we’re getting there.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/a-yWZml2AJn-OITC0jErFUzhsfA=/0x110:1635x966/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23388534/Fortnite_Zero_Build_Gameplay_Trailer___No_Build_Battle_Royale_0_21_screenshot.png",
  "description": "Some lapsed players have been returning to Fortnite.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}