{
  "title": "Fortnite’s Uncharted crossover includes Tom Holland and Nathan Drake skins",
  "url": "https://www.theverge.com/22930304/fortnite-uncharted-nathan-drake-tom-holland-chloe-frazer-skins",
  "date": "2022-02-12T10:15:28.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8XtZ1kgsKvINI8FBDRypSrXZP0E=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70501176/maxresdefault.0.jpg\" />    </figure>  <p id=\"Ing0OG\"><em>Fortnite </em>fans have solved an Epic Games puzzle to reveal an <em>Uncharted </em>crossover coming to the game on February 17th. Tom Holland will star in <em>Fortnite </em>for a second time, thanks to a new skin in his portrayal as Nathan Drake in the upcoming Uncharted movie that hits theaters on February 18th. The original Nathan Drake character and Chloe Frazier will also be available in both movie and video game forms inside <em>Fortnite</em>.</p><p id=\"2voo1L\">Epic Games started teasing the collaboration late on Friday with a <a href=\"https://www.epicgames.com/fortnite/en-US/AD8AB0\">treasure hunt website</a>, days after leakers spotted code inside <em>Fortnite </em>that pointed towards an “Uncharted treasure map.” Players had to solve a 14-character password, with <a href=\"https://twitter.com/thesquatingdog/status/1492330043686600708\">some creators</a> getting clues along the way. The password, sicparvismagna, was solved in a matter of minutes, leading to the <em>Uncharted Fortnite </em>crossover trailer.</p><p id=\"q7jXNr\">The trailer only confirms the wearable outfits so far, but there will likely be additional cosmetics as part of this collaboration. Epic Games says the <em>Uncharted </em>items will appear in <em>Fortnite</em>’s item shop on February 17th, just ahead of the Uncharted movie release.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/It2Zr2wnDqYqWkYIEizlaO0mm68=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23237323/maxresdefault.jpg",
  "description": "New Fortnite skips drop on February 17th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}