{
  "title": "Fortnite has been building towards no building for years",
  "url": "https://www.theverge.com/2022/3/22/22990926/fortnite-no-building-chapter-3-season-2-epic-games",
  "date": "2022-03-22T17:01:40.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Mxq3LrgSJmAd67-tOclXan5zG4c=/233x0:2639x1604/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657563/Fortnite_20220322115911.0.jpg\" />    </figure>  <p id=\"JGQDtk\">It all started with swimming. When <em>Fortnite</em> ushered in <a href=\"https://www.theverge.com/2019/10/15/20905428/fortnite-chapter-2-season-1-release-date-battle-pass-black-hole\">its second chapter</a> with the dramatic implosion of the game’s original island, it also added in a seemingly small feature: players could finally swim. But since then, the shooter has slowly morphed by continually making the game faster and more mobile. It may have come as a shock to some when building — one of the defining traits of <em>Fortnite</em> since its inception — <a href=\"https://www.theverge.com/2022/3/20/22987308/fortnite-chapter-3-season-2-battle-pass-doctor-strange\">was removed as part of the current season</a> (even though it’s likely a temporary change). But it’s a shift that’s been a long time coming.</p><p id=\"29Le82\">Ever since players could swim, developer Epic has continuously added new ways for people to get around in the game. There have been vehicles like planes and cars, zip lines and launch pads that speed you across the map, and even <a href=\"https://www.theverge.com/2022/1/18/22888226/fortnite-update-tilted-towers-monsters-kaws\">giant monsters</a> that would toss you into the air. <a href=\"https://www.theverge.com/2021/12/5/22817392/fortnite-chapter-3-season-1-spider-man-new-island\">Last season introduced two extremely fun new mechanics</a>: one let you slide down mountains with incredible speed, while another involved swinging through trees and buildings like Spider-Man. Not all of these things stick around permanently — I truly miss the goofy Klombo monsters — but those that remain have had a big impact on how you can navigate <em>Fortnite</em>’s world.</p><p id=\"cyM3Au\">The current season, meanwhile, is notable for a few things. For starters, it adds sprinting and climbing, which, when combined, essentially let you parkour across sections of the <em>Fortnite</em> island. There are also vertical ziplines so you can quickly reach specific areas up high. When you put this together with all of the other changes over the years, you have a game that moves very fast, especially when you compare it to the early days of <em>Fortnite</em>.</p><div id=\"dzzDzs\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Nothing’s out of reach anymore! Mantling is an all new mechanic that allows you to scale walls with ease. Jump in now to try it out. <a href=\"https://t.co/VS99IJQ2H3\">pic.twitter.com/VS99IJQ2H3</a></p>— Fortnite (@FortniteGame) <a href=\"https://twitter.com/FortniteGame/status/1505952376812830720?ref_src=twsrc%5Etfw\">March 21, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"gB9CcQ\">Which brings us to building — or the lack thereof. The iconic feature has been removed from the game, though most players agree that it’s likely a temporary change. For the uninitiated, building has long been one of the most unique traits of <em>Fortnite</em>. Players can gather resources and then build structures to reach high areas or create defensive barriers around themselves. It’s incredible to watch the best players in the world build complex structures in seconds; there’s a skill called tunneling, where players construct a tunnel around themselves so quickly that they can run through it while protected from incoming fire.</p><p id=\"mTltOC\">That’s all well and good <a href=\"https://www.theverge.com/2019/7/29/8934329/fortnite-world-cup-finals-epic-games-esports-ninja-tfue-bugha-marshmello\">if you’re competing in the World Cup</a>. But for the average player, building isn’t just complicated — it can slow things down, as you have to pause what you’re doing to start building stuff. The game’s most recent changes, though, let you do a lot of the same things but in a more intuitive way. Instead of building a ramp to reach the second floor of a building, I can now sprint and climb up. Instead of building a wall to block incoming fire, I now have a recharging shield. If nothing else, it’ll be very interesting to see how top <em>Fortnite</em> players adapt to these changes. (<a href=\"https://twitter.com/FortniteGame/status/1506304185456754690\">Regular players sure seem to be enjoying the new mechanics</a>.)</p><p id=\"IdiZVg\">But the more interesting thing will be what happens when building comes back to the game. <a href=\"https://twitter.com/FortniteBR/status/1505499219813179395\">Rumors suggest</a> that its absence will only last for the first nine days of this season, which kicked off on Sunday. So it could be a short-lived blip in <em>Fortnite</em>’s surprisingly long life. But, given developer Epic’s propensity for dramatic changes, I wouldn’t be surprised if building looked very different when it did return or if its removal eventually became permanent. One of the things that have kept the game vibrant for so long is that it’s always shifting in new ways. A single update can have a huge impact on the overall experience.</p><p id=\"feFgeA\">Building is one of <em>Fortnite</em>’s most defining features — but then again, <a href=\"https://www.theverge.com/2019/10/13/20909812/fortnite-down-black-hole-chapter-2-the-end\">so was the original island</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EaI8NpyLy7nsqp8MgN1exdvE8ss=/0x50:2872x1554/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23337013/Fortnite_20220322115911.jpg",
  "description": "A big change, even if it’s temporary",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}