{
  "title": "Foxconn halts production as Shenzhen goes into lockdown",
  "url": "https://www.theverge.com/2022/3/13/22976414/foxconn-production-shenzhen-lockdown-apple-china-covid",
  "date": "2022-03-14T03:56:48.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"Workers at Foxconn factory campus in Longhua town, Shenzhen. 20JUL16 SCMP/Nora Tam\" src=\"https://cdn.vox-cdn.com/thumbor/QV6E3YvpXoa5_zAWl8bdvBnC_6s=/0x0:5760x3840/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70618506/1096286350.0.jpg\" />        <figcaption>Photo by Nora Tam/South China Morning Post via Getty Images</figcaption>    </figure>  <p id=\"szoFQg\">Foxconn and other manufacturers are suspending operations in the Chinese tech hub of Shenzhen after authorities announced a partial lockdown due to a rise in COVID-19 cases. Businesses providing non-essential services have been ordered to close and everyone in the city of 17 million will be tested for COVID-19 following the reporting of 60 new infections on Sunday. </p><p id=\"0eOSLH\">Foxconn is the world’s biggest contract manufacturer of electronics, and the most important supplier to companies including Apple and Samsung. Many Chinese tech giants like Huawei, Tencent, and Oppo are headquartered in Shenzhen, which is situated near the border with Hong Kong. Foxconn says it’s stopping production at its Longhua and Guanlan factories until further notice, <a href=\"https://asia.nikkei.com/Spotlight/Coronavirus/China-s-new-COVID-lockdowns-hit-Apple-suppliers\"><em>Nikkei</em> reports</a>; the Shenzhen base is Foxconn’s second largest in the country.</p><p id=\"aiWR70\">China continues to take a strict approach to limiting the spread of COVID-19. It has reported a total of 4,636 deaths and 115,466 confirmed cases since the beginning of the pandemic. Shanghai, the most populous city in the country and home to major chipmaker SMIC, is also enacting new restrictions from today; buses to other provinces will be suspended and a negative PCR test will be required for anyone attempting to leave or enter the city. 64 new COVID-19 cases were reported in Shanghai on Sunday. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/l4SJF3dqpvRSFkd6Pf2IxxTroRM=/0x412:5760x3428/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23312303/1096286350.jpg",
  "description": "60 new cases of COVID-19 were reported in Shenzhen on Sunday.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}