{
  "title": "Foxconn’s Shenzhen factories resume operations after lockdown",
  "url": "https://www.theverge.com/2022/3/21/22989082/foxconns-shenzhen-factories-resume-operations-covid-19-lockdown",
  "date": "2022-03-21T15:27:49.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"Workers at Foxconn factory campus in Longhua town, Shenzhen. 20JUL16 SCMP/Nora Tam\" src=\"https://cdn.vox-cdn.com/thumbor/pUfNIffhhs78tSfjAw--Q-mbsqM=/0x0:5760x3840/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70652081/1096286350.0.jpg\" />        <figcaption>Photo by Nora Tam/South China Morning Post via Getty Images</figcaption>    </figure>  <p id=\"xjZRWs\">Foxconn, the world’s biggest contract manufacturer of electronics, says it’s “basically” resumed normal operations in Shenzhen after a partial lockdown forced its factories offline, <a href=\"https://www.reuters.com/technology/foxconn-basically-resumes-normal-operations-chinas-shenzhen-2022-03-21/\"><em>Reuters</em> reports</a>. In a statement, the company said it has “basically resumed normal work order and production operations” at its Longhua and Guanlan factories, although it added it will be “strictly implementing epidemic prevention and control” policies and that some staff will live and work in a bubble. <em>Reuters</em> notes that employees in Futian, a district of Shenzhen, are still being advised to work from home. </p><p id=\"0n3lPp\">The re-opening comes a little over a week after the company announced it was <a href=\"https://www.theverge.com/2022/3/13/22976414/foxconn-production-shenzhen-lockdown-apple-china-covid\">suspending operations in the city</a> after a spike of 60 new infections were reported. China has been following a strict “zero-COVID” strategy since the beginning of the pandemic, <a href=\"https://www.theguardian.com/world/2022/mar/19/china-reports-first-coronavirus-deaths-in-over-a-year-amid-omicron-surge\"><em>The Guardian</em> notes</a>, and has used strict lockdowns and mass testing to keep the virus at bay. On Saturday, <em>The Guardian</em> reported that the country reported its first two coronavirus deaths in over a year, bringing the country’s reported death toll to 4,638 since the beginning of the pandemic. </p><p id=\"M1qQdx\">Despite Foxconn being a major Apple supplier, the Shenzhen shutdown is unlikely to have had a huge impact on its iPhone production. <em>Reuters</em> notes that the majority of Foxconn’s iPhone production in the country is believed to take place in Zhengzhou in Henan province. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IwKrWFH_QU0PDs4BHQ5bGhQUtoM=/0x412:5760x3428/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23333706/1096286350.jpg",
  "description": "A spike in COVID cases forced them offline.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}