{
  "title": "Framework’s new laptop means the promise of modular gadgets might be coming true",
  "url": "https://www.theverge.com/23125965/framework-laptop-upgrade-intel-12th-gen",
  "date": "2022-05-19T12:00:00.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ggp9DwQXdDGmkaxtBD0F8PoRN2A=/0x180:1080x900/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70886829/Framework_Laptop_2.0.jpeg\" />    </figure>  <p id=\"95j5n9\">A little more than a year after <a href=\"https://www.theverge.com/2021/2/25/22299938/framework-laptop-features-upgrade-release-date-price\">announcing the first version</a> of its ultra-repairable, upgradeable notebook, Framework is launching the second-generation Framework Laptop. It’s meant to be substantially faster and a little more sturdy but mostly it’s a signal that Framework is serious about building truly long-lasting devices and might actually be fulfilling the often promised and rarely delivered dream of upgradeable, modular gadgets.</p><p id=\"EDlJx6\">The new laptop’s headline spec is the processor: it comes with a 12th Gen Intel Core i5 or i7 chip with the top-of-the-line, $2,049 model running the Core i7-1280P. (That’s a full generation jump from the current model, and these <a href=\"https://www.theverge.com/2022/2/23/22941383/intel-12th-gen-alder-chips-p-series-u-laptops-release-date\">new Alder Lake chips</a> promise big performance improvements and a boost in efficiency.) The base model, which runs a Core i5-1240P, starts at $1,049 fully assembled. All are available for preorder now and start shipping in July, though you shouldn’t expect one too quickly: Framework is using a preorder system to manage demand and seems to anticipate shipments taking a while.</p><p id=\"PvUYcx\">In addition to the performance jump, Framework also rebuilt the laptop’s top cover, which it says is now much more rigid than before. That’s a welcome change: when <em>The Verge’s </em>Monica Chin <a href=\"https://www.theverge.com/22587205/framework-laptop-review\">reviewed the first model</a>, the laptop’s unavoidable flimsiness was one of the device’s worst qualities. Beyond that, Framework also said it has “carefully optimized battery life,” which was only average on the last model.</p><p id=\"CAdevI\">Most of the other specs haven’t changed: the new laptop still has a 13.5-inch screen, weighs a shade under three pounds, and has the same decent keyboard and trackpad. In general, the new Framework Laptop sounds like a nice, if fairly predictable, improvement on what you can buy already. It’s worth noting, though, that even the existing model is already a meaningful upgrade over what the company launched last year: Framework has added Wi-Fi 6E support since launch and offers a handful of new dongles for its expansion ports. That’s Framework’s whole thing, really; the laptop isn’t a static device, it’s an ever-changing one.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FVHfi3qRQ41_lj6pb-tWMsLoxkM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545498/installing_mainboard_blog.gif\">      <cite><em>Image: Framework</em></cite>      <figcaption><em>The new Framework Laptop is also an upgrade to the old one.</em></figcaption>  </figure><p id=\"3SQANH\">Which raises the real question for Framework: how do you launch a new laptop when your whole company is based on letting people upgrade and improve their laptops without just having to buy a new one? </p><p id=\"g0w1LB\">That’s where Framework’s announcement gets cool: the new chipset is also going to be available in Framework’s Marketplace, meaning you can buy a mainboard with a 12th Gen chip and slot it into your existing Framework Laptop without having to buy a whole new device. Or you can opt to replace your top cover with the new stronger one without changing anything else. (The Upgrade Kit, which includes both pieces, starts at $538.) Framework is planning to continue selling the first-gen laptop at a discounted price of $899 while its inventory lasts, too, so you can start on your upgrade path whenever you want.</p><p id=\"LTpc66\">The idea behind Framework’s announcement is really more exciting than the announcement itself. Framework’s plan for building longer-lasting laptops could only work if the company stayed committed to upgradeability and made sure to do right by the users who bought its devices on the promise of future upgrades. We’ve heard that promise before, of course, whether at the beginning of <a href=\"https://www.theverge.com/circuitbreaker/2020/5/13/21256845/alienware-area-51m-r1-r2-specs-upgradable-parts-gpu-dgff-limited\">Alienware’s failed Area-51m dream</a>, <a href=\"https://www.theverge.com/2016/9/2/12775922/google-project-ara-modular-phone-suspended-confirm\">Google’s canceled Project Ara</a>, or Intel’s <a href=\"https://www.theverge.com/2021/7/29/22599092/intel-nuc-11-extreme-beast-canyon-specs-price-availability-preview\">semi-upgradable NUC Extreme</a> and abandoned <a href=\"https://www.theverge.com/2019/3/22/18277596/intel-abandons-compute-cards-pc\">Compute Card</a> initiatives. These things don’t tend to work out.</p><p id=\"ETL2tD\">It’s still very much an open question how long Framework will support its original chassis and design given how many companies have made promises about modularity and longevity only to break the system as soon as a shiny new thing came along. The new Framework Laptop is both a new thing and a thoroughly backwards-compatible thing. That’s a big deal.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FOv6y-qjsB4_07ttxIrPTp-7tVw=/0x258:1080x823/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23545494/Framework_Laptop_2.jpeg",
  "description": "The upgradeable laptop gets its first big upgrade.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}