{
  "title": "Fringe YouTubers are profiting off-platform",
  "url": "https://www.theverge.com/2022/3/22/22991073/youtube-demonetization-alt-right-cornell-study",
  "date": "2022-03-22T16:23:38.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/C5w5ZuORMSD6HEWE-C5cJrSkZfQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657368/acastro_180322_1777_youtube_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"FZAAXy\">YouTube has made a habit of stripping ads from problematic channels as a way to discourage controversial or offensive content without outright banning it. But the creators of those channels can still use their videos to promote other streams of income, like donation links and merch sales. Now, a new study shows that those options have not just allowed problematic channels to continue but may also be encouraging them to create more videos on YouTube.</p><p id=\"W6V50Q\">A new peer-reviewed study by researchers at Cornell Tech in collaboration with the Swiss Federal Institute of Technology Lausanne (EPFL) found that YouTubers, including fringe creators making alt-right and anti-feminist videos, use their channels to promote their other income streams off-platform. <a href=\"https://arxiv.org/abs/2203.10143\">The study</a>, to be presented in November, offers a large-scale look at how creators make money across platforms and how fringe creators could continue to make money even without YouTube’s ad revenue sharing program if they were demonetized.</p><div class=\"c-float-left\"><aside id=\"ZxfIkf\"><q>Channels producing alt-right, alt-lite, and misogynist content were more likely to use alternative monetization methods than their counterparts</q></aside></div><p id=\"KSiEaM\">The study looked at over 71 million English language videos from 136,00 YouTube channels crawled in 2019, with data going back to 2008. Analyzing description boxes appearing below videos, researchers looked for four alternative monetization methods: soliciting cash donations, such as through Paypal or Patreon; requesting cryptocurrency donations; selling products, like branded merch; and affiliate marketing. Researchers found that channels producing alt-right, alt-lite, and misogynist content — defined as “problematic” content channels — were more likely to use alternative monetization methods than their counterparts. </p><p id=\"aV8AHV\">“We argue that moderation through demonetization is not likely to be an effective tool in disincentivizing the production of problematic content, and may even result in a shift of content produced towards committed audiences,” the researchers write.</p><p id=\"y2VLEf\">Getting videos demonetized on YouTube doesn’t necessarily mean the content is hateful or fringe. YouTube in the past has cut revenue sharing from content it considers bad for advertisers, like <a href=\"https://www.theverge.com/2020/3/4/21164553/youtube-coronavirus-demonetization-sensitive-subjects-advertising-guidelines-revenue\">mentions of the coronavirus</a>. And alternative monetization isn’t inherently a bad thing, either: small creators who aren’t eligible for the program often ask fans to support them in other ways off-platform. </p><p id=\"C2S4GE\">Yiqing Hua, co-author of the paper, was surprised at how prevalent outside monetization efforts were as a whole: 18 percent of all videos contained an appeal, and 61 percent of channels did it at least once. It’s likely that even more creators use alternative monetization now than in 2019, when the data was collected, as subscription-based platforms like Patreon continue to grow.</p><p id=\"BYqlc6\">The rate of content creation went up after positively linked outside income streams were adopted, according to the paper: a channel’s output increased 43 percent in the first year after linking alternative monetization methods in a video description. Although researchers were unable to draw a causal connection between the two, they say their findings highlight the significant role outside monetization plays in what kind of content is created. </p><p id=\"VCpdyS\">“As platforms draft their moderation policies and execute their moderation decisions, they usually just think about their own platform, rather than thinking about the entire information ecosystem as a whole,” Hua says. “Especially for the demonetization strategy, it’s important to also think about what [creators are] doing outside of this platform.”</p><p id=\"SYD2GN\">Alt-lite, alt-right, and “manosphere” content creators use a variety of alternatives to solicit financial support, with 68 percent of channels studied using at least one. To compare fringe channels and their counterparts, researchers controlled for content category, like politics, music, or blogs, as well as video output and viewership. The biggest gap is in the use of donation solicitations, where 48 percent of these fringe channels link to platforms like Patreon, compared to only 28 percent of their counterparts. </p><p id=\"vke1sz\">Off-platform monetization can be lucrative for the fringe creators in the study: Hua found that earnings totaled thousands of dollars. Out of nearly 500 YouTube channels creating alt-lite, alt-right, and “manosphere” content, over 150 plugged a Patreon link or an Ethereum or Bitcoin address, pulling in a median income of $5,540 and $1,155, respectively. Around a dozen have earned over $100,000. </p><div class=\"c-float-right\"><aside id=\"5ULYRo\"><q>“It’s really important for society to understand what content was preferred by these platforms.”</q></aside></div><p id=\"nQnUZR\">YouTube spokesperson Kimberly Taylor says creators must meet a high bar to monetize on YouTube and are subject to an <a href=\"https://support.google.com/youtube/answer/9054257?hl=en&amp;ref_topic=9282365\">external links policy</a> that prohibits spam or otherwise violates community guidelines.</p><p id=\"4IoAje\">“We regularly review and remove channels that don’t comply with our policies,” Taylor says.</p><p id=\"DchJNc\">YouTube has cut advertising from videos as a way to punish creators for bad behavior on and off the platform, including major YouTubers like makeup artist <a href=\"https://www.theverge.com/2021/4/19/22392588/youtube-james-charles-demonetization-sexting-minors\">James Charles</a> and political pundit <a href=\"https://www.theverge.com/2019/6/25/18744246/youtube-demonetization-steven-crowder-patreon-advertising-merch\">Steven Crowder</a>. The company has used demonetization to both <a href=\"https://blog.youtube/news-and-events/our-ongoing-work-to-tackle-hate/\">punish risky creators</a> and to <a href=\"https://www.theverge.com/2019/4/5/18287318/youtube-logan-paul-pewdiepie-demonetization-adpocalypse-premium-influencers-creators\">keep advertisers happy</a> to avoid an “adpocalypse.” The study raises questions about how effective demonetization really is in disincentivizing the creation of fringe content, which is meant to send a signal to creators bumping up against the bounds of what’s acceptable on the platform. </p><p id=\"nTe0D4\">Researchers hope platforms will recognize just how widespread alternative income streams are and take findings into consideration when crafting policies for creators. More data transparency from platforms, too, is important for researchers to understand who is profiting and from what sources. </p><p id=\"sscErP\">“We don’t know about who gets demonetized, who doesn’t, and why [they] get demonetized,” Hua says. “It’s really important for society to understand what content was preferred by these platforms.”</p><p id=\"HPd1mj\"> </p><p id=\"QImmMI\"></p><p id=\"ynczye\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-X4sjZc4hjT8YMtJcabrQGpMMZA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10480483/acastro_180322_1777_youtube_0001.jpg",
  "description": "Researchers studied alt-right and \"manosphere\" creators.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}