{
  "title": "FromSoftware hopes to expand Elden Ring ‘beyond the realm of games’",
  "url": "https://www.theverge.com/2022/3/16/22981060/fromsoftware-elden-ring-franchise-intellectual-properties-future-expansion",
  "date": "2022-03-16T16:02:12.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/fXm2QryXCT4mF9DjkWGsPnltNqI=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70630546/elden_ring_1.0.jpg\" />        <figcaption>Image: Bandai Namco</figcaption>    </figure>  <p id=\"fwpF1A\"><a href=\"https://www.theverge.com/2022/2/23/22946279/elden-ring-review-ps5-xbox-pc\">FromSoftware’s <em>Elden Ring</em></a> has been nothing short of a smash hit, hitting 12 million copies sold worldwide since its release last month. But like any pop culture success in 2022, <em>Elden Ring</em> isn’t going to stop at one great game: it’s going to be a <em>franchise</em>, <a href=\"https://www.fromsoftware.jp/ww/pressrelease_detail.html?tgt=20220316_eldenring_salesdata\">with FromSoftware telling fans</a> to “please look forward to more of ‘<em>ELDEN RING’ </em>as an IP (characters and other intellectual property) in hopes of expanding beyond the realm of games.”</p><p id=\"irTi3U\">“Much effort was placed into creating ‘<em>ELDEN RING’</em> so that we could exceed the expectations of our fans worldwide. In like manner, we will continue our efforts in expanding the brand beyond the game itself, and into everyone’s daily life,” commented Yasuo Miyakawa, the president and CEO of Bandai Namco, the game’s publisher, in a press release. </p><aside id=\"M358kU\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Elden Ring is a sprawling fantasy epic so good I don’t want it to end\",\"url\":\"https://www.theverge.com/2022/2/23/22946279/elden-ring-review-ps5-xbox-pc\"},{\"title\":\"Elden Ring’s world is full of mystery, but I’d rather wait for a guide\",\"url\":\"https://www.theverge.com/2022/2/28/22954823/elden-ring-open-world-guide\"}]}'></div></aside><p id=\"cRgYSC\">What form <em>Elden Ring</em>’s next steps will take isn’t clear, but it’s easy to imagine building on FromSoftware’s famously opaque storylines in more traditional narrative formats like comics, books, or even a TV series or movie. </p><p id=\"awT3OJ\">Plus, given the popularity of video game adaptations right now, along with the involvement of noted author George R.R. Martin (who himself has no small amount of experience turning vast fantasy stories into ultra-popular television shows), there are plenty of avenues that FromSoftware could take in expanding its latest title. </p><p id=\"VbkqkE\">FromSoftware’s games are famous (or infamous) for doing much of their storytelling in the margins of titles, letting players explore the history and meaning of the events that shaped the worlds of each title on their own. <em>Elden Ring</em> is no exception, and the open-world scale of the Lands Between means that there’s even more space for FromSoftware to fill in the gaps with additional media down the line, if it chooses. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9XP7UiKqjNkw7HCJIhxsIyLONto=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23003228/elden_ring_1.jpg",
  "description": "Elden Ring isn’t stopping at one game.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}