{
  "title": "Fruit stickers are the scourge of the compost pile",
  "url": "https://www.theverge.com/23022355/produce-stickers-fruit-plastic-compost-biodegradable",
  "date": "2022-04-18T11:45:00.000Z",
  "author": "Sarah Jeong",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/A4p8yLBK18eQ_ZzrllWLvbp_WyA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70761540/VRG_Illo_5122_M_Mathieson_Compost.0.jpg\" />        <figcaption>Illustration by Melissa Mathieson / The Verge</figcaption>    </figure>  <p>When everything else decays, those little plastic stickers remain</p> <p class=\"p--has-dropcap p-large-text\" id=\"R6iFYc\">There they are again — in the compost caddy, littered through the backyard pile, stuck in the sifter, peeping out of the garden beds — the eternal bane of many home gardeners: the small, ubiquitous, and remarkably indestructible produce sticker. </p><p id=\"NmSAF8\">“I painstakingly remove every produce sticker from every piece of fruit and veg that enters our home,” says James Hohman, a professor at the University of Connecticut. But his compost pile lives on top of a compost pile used by the previous owners of his house. When Hohman’s family first moved in, he sifted the pile, removing “probably hundreds of stickers.” But more stickers kept showing up for years — in the pile and in the garden beds. </p><p id=\"beZjCp\">Joshua Simpson, who lives in Washington, knows his pain. “I have composted blue jeans well before those dumb stickers have gone away,” he says. His family also feeds their food scraps to their chickens, resulting in produce stickers “all over the yard.” </p><div class=\"c-float-right c-float-hang\"><aside id=\"tSST3F\"><q>“I have to put down the shovel and pick the stickers out by hand every other scoop.”</q></aside></div><p id=\"lLe2kD\">“I have to put down the shovel and pick the stickers out by hand every other scoop,” says Gretchen Cheverton, who constantly finds stickers in her compost pile at home in Colorado. “No gardener could sleep at night if they left them in the finished compost and spread them around the yard.” </p><p id=\"cr8bi7\">Composting is about accelerating the decomposition of organic matter. Your kitchen scraps and lawn clippings are all going to rot eventually. But a compost pile gets it done faster and, ideally, with minimal smells — finished compost smells like forest floor — and fewer greenhouse gas emissions. The same anaerobic bacteria that make rotting garbage smell so bad also emit methane; home composting focuses on boosting aerobic decomposition, which is both more sustainable and less disgusting. </p><p id=\"dMAKPN\">Home composting can be a fairly hands-off process, but the science behind it can turn this household chore into an optimization mini-game. On the subreddit r/composting, composters fuss over their nitrogen to carbon ratios and post pictures of the thermometers they’ve stuck into their piles. (A very hot pile is an achievement worth celebrating.) </p><p id=\"jyB9ha\">For home composters, vegetable scraps and fruit peels are often a source of nitrogen, an integral part of the chemistry of a compost heap. Nitrogen feeds the microorganisms that break down the compost, generating heat in the process. Too little nitrogen, and a pile will stay cold and will break down slowly. Too much, and it starts to smell very bad. Maintaining the balance between nitrogen and carbon is key to composting at home. (Other common nitrogen sources include grass clippings, used coffee grounds, and — for the open-minded home composter — urine). </p><p id=\"j0htl4\">Alas, the produce stickers ride alongside the nutrient-rich kitchen waste. They cling to a spent orange rind; they linger on a discarded banana peel; they’re brushed into the compost bucket with a pile of woody kale stems and carrot tops. It requires hypervigilance to prevent a produce sticker from entering a compost pile.  </p><div class=\"c-float-left c-float-hang\"><aside id=\"KzthWc\"><q>“I have composted blue jeans well before those dumb stickers have gone away”</q></aside></div><p id=\"cmPAEK\">It’s worth mentioning the vast range of things people successfully compost at home. While most backyard piles aren’t capable of breaking down a “compostable” bioplastic fork (which does break down sustainably but can last for years outside of an <a href=\"https://www.motherjones.com/environment/2009/04/plastic-fantastic/\">industrial composting setting</a>), people have composted popsicle sticks, fingernail clippings, bones, T-shirts, blue jeans — heck, even a copy of Ron Paul’s <em>The Revolution: A Manifesto</em>. (Hohman, who composted the book after “downgrad[ing it] from table leg support,” specifies that he first removed the cover). The bones, the T-shirt, or the book disappears and comes out as a nutrient-rich, dark brown humus. But the produce stickers remain.</p><p id=\"S2V4zo\">Produce stickers, which are often made of plastic, will maintain their shape and sometimes their bright colors, though they often wash out to a blinding white. When compost has fully broken down, they stand out like a sore thumb — perfect little ovals, circles, and rectangles contrasting sharply against the dark brown earth of finished compost. </p><p id=\"2V5PmN\">“It seems like they can get away with just not putting stickers on the fruit, and we would be OK,” says Simpson. “But I’m just some guy who eats fruit … so there might be something I don’t know.” </p><p id=\"hBtre4\">The Produce Marketing Association (PMA), which has since become the International Fresh Produce Association (IFPA), <a href=\"https://www.nytimes.com/2021/11/16/well/eat/stickers-fruits-vegetables.html\">created the Price Look Up (PLU) system</a> and its accompanying scourge of stickers starting in 1988. A PLU sticker has a number and sometimes a bar code. It exists to help a cashier correctly ring up produce at checkout. The stickers themselves consist of three components: adhesive, plastic or paper, and ink. The stickers are required to be food grade — but that isn’t the same thing as being compostable. Chewing gum, for instance, isn’t compostable, an interesting fact that has finally gotten me to stop swallowing my chewing gum. </p><p id=\"HLpla4\">“Many of the individual components that make a PLU sticker can be either recyclable or compostable,” claims the <a href=\"https://www.ifpsglobal.com/Portals/22/PLU%20Sticker%20Sustainability%20FAQs_Dec%202018.pdf?ver=2020-07-13-155550-250\">International Federation for Produce Standards</a>, a larger industry group that includes the IFPA. But what good is it for the glue to be compostable if it’s stuck to plastic that isn’t? The IFPS acknowledges that recyclers see the stickers as “contaminates to the recycling process.” </p><p id=\"dc6542\">Following the passage of laws in Europe that ban <a href=\"https://www.ifpsglobal.com/Portals/22/PLU%20Sticker%20Sustainability%20FAQs_Dec%202018.pdf?ver=2020-07-13-155550-250\">various kinds of single-use plastics</a>, the IFPA, in conjunction with other industry groups and the USDA, is now looking into developing PLU stickers that can be composted at home. This move comes after many years of <a href=\"https://modernfarmer.com/2018/03/little-produce-stickers-are-big-waste-problem/\">criticism</a> and proposed solutions, including a very fanciful idea for <a href=\"https://www.cbsnews.com/news/lasers-high-tech-labels-on-fruit/\">laser-etched fruit</a>. “Trying to create the combination of the adhesive, substrate (plastic or paper) and ink to be home compostable and durable enough to stay adhered to the produce through the supply chain is not an easy task,” Ed Treacy, vice president of supply chain and sustainability for IFPA, wrote in an email. </p><div class=\"c-float-right c-float-hang\"><aside id=\"uiIJVx\"><q>“A 10,000-year monument to that time I bought a couple over-ripe kiwis and a tomato” </q></aside></div><p id=\"GOmyUm\">Both Cheverton and Hohman think that the stickers are more of an annoyance than a real problem. “The earth would probably be fine if we didn’t fish the stickers out of the compost,” says Cheverton. “But the solution is just so easy it’s frustrating that no grower / packer is willing to just switch to biodegradable paper stickers.” </p><p id=\"CYU8dq\">“I could say it causes a little angst over the sheer amount of plastic that permeates our world,” says Hohman. “It’s symbolic of the problem.” He called the stickers “a 10,000-year monument to that time I bought a couple over-ripe kiwis and a tomato.” </p><p class=\"c-end-para\" id=\"sCBZbD\">The actual lifespan of the sticker is probably on the order of decades, or possibly centuries, after which the sticker will likely erode into microplastics that permeate the <a href=\"https://www.theverge.com/2021/1/12/22226655/microplastics-laundry-wastewater-plastic-pollution-arctic-ocean\">water</a> and the <a href=\"https://www.motherjones.com/environment/2019/03/microplastic-pollution-is-absolutely-everywhere/\">air</a> and everything around us. But that’s hardly reassuring. Oceans rise, empires fall, and the produce sticker remains — unbowed, undefeated, and thoroughly un-compostable.</p><p id=\"sQJiqD\"></p><p id=\"w4TQV1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9pZjGGl5YmwH9BiX2UENlF3PEik=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366368/VRG_Illo_5122_M_Mathieson_Compost.jpg",
  "description": "Plastic stickers have staying power in home compost piles.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}