{
  "title": "FuboTV is trying to sign people up for three-month plans, just in time for Super Bowl LVI",
  "url": "https://www.theverge.com/2022/2/7/22922523/super-bowl-lvi-streaming-winter-olympics-fubotv-testing-quarterly-plans",
  "date": "2022-02-07T22:37:32.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"Streaming Services Photo Illustrations\" src=\"https://cdn.vox-cdn.com/thumbor/0uHBfnpLolYYCGNde3xPrWWcLMs=/0x0:3543x2362/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70481707/1238248851.0.jpg\" />        <figcaption>Photo by Jakub Porzycki/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"JS0NKq\">FuboTV is temporarily testing a new quarterly format that lumps together three months at once rather than the monthly subscriptions it usually offers. The change conveniently arrives just in time for two of the biggest sports events of the year: <a href=\"https://www.theverge.com/22910839/super-bowl-streaming-issues-sports-broken-lvi\">Super Bowl LVI</a> and the Beijing 2022 Winter Olympics.</p><p id=\"rOQyL9\">The company told <em>The Verge</em> that the temporary pricing, <a href=\"https://tvanswerman.com/2022/02/06/is-fubotv-eliminating-monthly-plans/\">earlier spotted</a> by <em>The TV Answer Man</em>, launched a few days ago and is expected to conclude on February 17th. The test does not affect existing subscribers and isn’t available on every platform, but FuboTV spokesperson Jennifer Press says most of FuboTV’s new subscribers will be prompted to subscribe to the quarterly plans.</p><p id=\"Qkrn5N\">Most of FuboTV’s platforms are offering the new plans during the testing period, Press told <em>The Verge</em>. Where they’re available, the quarterly plans are offered by default. </p><p id=\"DWBKMd\">“We have temporarily made our channel packages available to new subscribers as quarterly plans,” the company said in a statement. “We’re always experimenting with our channel package offerings to better understand what our subscribers like.”</p><p id=\"wY2j46\">The tests do not impact pricing that pre-dated the test, meaning there’s no discount by subscribing to the quarterly plans versus paying a monthly rate. </p><p id=\"Re7aJz\">Paying for three months at once doesn’t necessarily have a huge impact on new subscribers who plan to stick with the service long-term — if they can afford a larger sum up front, that is. (FuboTV’s plans usually start around $65 per month.) But for anyone hoping to sign up for a month for coverage of the Super Bowl and the Winter Games, it may be a bigger hassle to try to find a workaround to the new quarterly fees.</p><p id=\"mI6G7I\">Super Bowl LVI will take place this Sunday, February 13th. The Winter Games in Beijing are <a href=\"https://www.theverge.com/2022/2/3/22916490/winter-olympics-beijing-2022-watch-live-stream-start-time\">already well underway</a> and will continue through February 20th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8JuARPE3odMjJxfVBFHv0BqWETs=/0x254:3543x2109/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23224698/1238248851.jpg",
  "description": "If you’re only signing up to watch the big game, be careful.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}