{
  "title": "Fujifilm is working on a fix for an issue that could make some files inaccessible on macOS",
  "url": "https://www.theverge.com/2022/2/5/22919108/fujifilm-macos-patch-inaccessible-files-bug-camera",
  "date": "2022-02-05T15:32:00.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/314yhfR7jnUTqi6NHQw_f8taHj4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70474951/dseifert_201001_4224_0003.0.0.jpg\" />        <figcaption>Photo by Dan Seifert / The Verge</figcaption>    </figure>  <p id=\"WIo7zD\">Fujifilm says it’s working on a patch to fix an incompatibility issue preventing the owners of certain X series and GFX series cameras from accessing some of their files on macOS, as stated in <a href=\"https://fujifilm-x.com/en-us/global-news/2022/0202_4199100/\">a notice on Fujifilm’s site</a>. According to the post, the issue only occurs when users have over 4,000 files written in-camera to a single folder on their SDXC card and then try to access these files using an internal or external card reader connected to their Mac.</p><div class=\"c-float-right\"><aside id=\"qfBsNt\"><q>The issue has been around since at least May 2021</q></aside></div><p id=\"XMJYEB\">Although Fujifilm says the problem occurs when “more than 4,000” files are stored in a single folder on the memory card, the exact amount seems to be 4,096, as indicated by <a href=\"https://www.dpreview.com/forums/thread/4588725\">user</a> <a href=\"https://www.dpreview.com/forums/thread/4578610#forum-post-65187965\">reports</a> that reach as far back as at least <a href=\"https://www.fuji-x-forum.com/topic/13135-photos-missing-from-sd-card-but-show-up-onin-camera/?do=findComment&amp;comment=73121\">May 2021</a>. In each case, the issue remains the same: users connect their memory card to their Mac, only to have just 4,096 files show up, despite having more images and videos accessible when the SDXC card is in their camera.</p><p id=\"inwcyP\">Camera models affected by the issue include the GFX100, GFX100S, GFX50S II, X-Pro3, X-T4, X-S10, X-E4, X-T30 II, X100V. There are a few other cameras that are only affected if they have a specific firmware version, including the GFX50S (version 4.00 and up), GFX50R (version 2.00 and up), and X-T3 (version 3.20 and up).</p><p id=\"1Etsq3\">In the post, Fujifilm warns customers to be extra careful to eject their memory cards properly and recommends following <a href=\"https://support.apple.com/en-us/HT204384#:~:text=To%20eject%20an%20SD%20card,the%20card%20from%20the%20slot.&amp;text=Always%20wake%20your%20computer%20and,removing%20it%20from%20your%20Mac.\">the steps outlined on Apple’s site</a>. The company says if the memory card isn’t ejected correctly and is then “directly connected and accessed a second time using macOS,” some files may get deleted. </p><p id=\"1Onk6i\">Fujifilm also asks customers with new or recently-formatted SDXC cards to avoid saving more than 1,000 frames to a single folder in-camera. Once a folder has close to 1,000 frames, Fujifilm says to create a new folder in-camera and store any additional frames there. As for SDXC cards that already have saved files, the company provides <a href=\"https://digitalcamera-support-en.fujifilm.com/digitalcameraengpcdetail?aid=000008225&amp;_ga=2.121575368.1718590533.1644066352-1359966570.1644066352\">detailed instructions</a> on how to download the files to your computer without issue.</p><p id=\"YdUGBn\">Fujifilm says it’s working on a firmware patch to “limit the number of files that can be written to a single folder.” It’ll be available as a free update to all affected X series and GFX series cameras, but it doesn’t specify when it’s planning to roll it out.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SUVUfestXKR7FFlwY65l1g5al9E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21941176/dseifert_201001_4224_0003.0.jpg",
  "description": "The issue affects some X series and GFX series cameras.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}