{
  "title": "Funding site linked to Canadian trucker protest hacked, donor info leaked online ",
  "url": "https://www.theverge.com/2022/2/14/22933772/givesendgo-funding-freedom-convoy-hacked-donor-leaked",
  "date": "2022-02-14T22:18:34.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"CANADA-AMBASSADOR BRIDGE-PROTEST\" src=\"https://cdn.vox-cdn.com/thumbor/ZgBWq6-5jwuNjxixpDzk5DOCURA=/0x0:7176x4784/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70508950/1238481639.0.jpg\" />        <figcaption>Photo by GEOFF ROBINS/AFP via Getty Images</figcaption>    </figure>  <p id=\"qxPCWT\">GiveSendGo, a crowdfunding website that was being used to source donations for the “Freedom Convoy” protest mounted by Canadian truckers, has been taken offline in an apparent hack and information about alleged donors leaked online.</p><p id=\"0sse6v\">On Sunday night, the GiveSendGo domain began to redirect to a new domain — GiveSendGone[.]wtf — and show a video loop from Disney’s Frozen, as first <a href=\"https://twitter.com/MikaelThalen/status/1493056860638773248\">noted by</a> <em>Daily Dot</em> journalist Mikael Thalen. The video was accompanied by text criticizing the fundraising site and linking it to the January 6th insurrection in the US.</p><div id=\"BPCvYb\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Here is the first half of the video uploaded by hackers who targeted the crowdfunding website GiveSendGo.<a href=\"https://t.co/uisu2xjG2U\">pic.twitter.com/uisu2xjG2U</a></p>— Mikael Thalen (@MikaelThalen) <a href=\"https://twitter.com/MikaelThalen/status/1493067759105626114?ref_src=twsrc%5Etfw\">February 14, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"82FsjW\">GiveSendGo, which brands itself “the number one Free Christian crowdfunding platform,” had already <a href=\"https://www.theguardian.com/us-news/2021/dec/17/capitol-attack-insurrectionists-fundraising-defense-money\">emerged as the go-to platform</a> for fundraising to cover legal fees for Trump supporters accused of participating in the Capitol insurrection.</p><p id=\"k0fa2Z\">It quickly became the number one fundraising choice for the self-styled “Freedom Convoy” after the more prominent platform GoFundMe <a href=\"https://www.bbc.com/news/world-us-canada-60267840\">said it would withhold millions of dollars in donations</a> to the truckers, citing police reports of violence and other illegal activity. Canadian banks had already begun to block funds linked to the convoy, with TD <a href=\"https://www.reuters.com/world/americas/td-bank-freezes-two-accounts-that-received-funds-support-canada-protests-2022-02-12/\">freezing two personal accounts</a> containing more than $1 million in donor funding.</p><p id=\"64I6zf\">As donors flocked to the new platform, a security researcher <a href=\"https://techcrunch.com/2022/02/08/ottawa-trucker-freedom-convoy-exposed-donation/\">alerted TechCrunch</a> to the fact an Amazon S3 bucket — a cloud storage service used to host files online — had been set up insecurely by GiveSendGo and exposed gigabytes of data about donors to the Freedom Convoy, including photos and passport scans.</p><p id=\"W3aYL8\">The cloud storage issue was believed to have been fixed last week after TechCrunch notified the GiveSendGo management team, and the latest hack appears to be a new compromise of the site. </p><p id=\"N1HmEA\">The leaked donor information was obtained by data leak hosting website <em>Distributed Denial of Secrets</em>, which has been giving access solely to journalists and researchers due to the presence of sensitive personal information.</p><p id=\"i4f3Ea\">A copy of the data obtained by <em>The Verge </em>contained close to 93,000 entries, including names, email addresses, ZIP codes, and country of origin. Among the email addresses listed in the database, a handful come from domains ending in “.gov,” a domain reserved for government entities, and appear to belong to employees of the TSA, Department of Justice, Bureau of Prisons, and NASA.</p><p id=\"eDuawk\">The US makes up more than half of the entries for donor country, followed by Canada and then Great Britain, giving support to concerns raised in Canadian media that <a href=\"https://www.cbc.ca/news/politics/convoy-protest-vaccine-ottawa-1.6345889\">foreign money has been backing the protest</a>.</p><p id=\"oYz6MJ\">A request for comment sent to GiveSendGo had not received a response by time of publication.</p><p id=\"z5WT8a\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZJwFJygFflRMrGD9C1xhXvVxoBw=/0x514:7176x4271/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23241698/1238481639.jpg",
  "description": "More than half of the donors appear to come from the US",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}