{
  "title": "Funimation’s anime library is moving over to Crunchyroll",
  "url": "https://www.theverge.com/2022/3/1/22956273/crunchyroll-funimation-anime-library-merge-sony",
  "date": "2022-03-01T16:14:37.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/06fpH6W8dteW-7Rwj3jDwq-r-ek=/314x132:2566x1633/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70565233/crunchyroll_funimation_merge.0.png\" />        <figcaption>Screenshot: Crunchyroll via <a class=\"ql-link\" href=\"https://youtu.be/s6MYLOvuagI\" target=\"_blank\">YouTube</a></figcaption>    </figure>  <p id=\"Ga0ggd\"><a href=\"https://www.crunchyroll.com/en-gb/anime-news/2022/03/01/funimation-content-moving-to-crunchyroll-for-worlds-largest-anime-library\">Crunchyroll is inheriting a slew of titles from Funimation</a> in a move that’s supposed to unify the two biggest anime streaming services under one subscription. This also consolidates Funimation’s French-language subsidiary, Wakanim, and the Crunchyroll-owned streaming service, VRV, into the sole Crunchyroll platform.</p><div id=\"rQFNQm\"><div ><iframe src=\"https://www.youtube.com/embed/s6MYLOvuagI?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"CxnnnR\">The consolidation of Crunchyroll doesn’t come as much of a surprise. Last August, Sony — which also owns Funimation — <a href=\"https://www.theverge.com/2021/8/9/22617356/sony-crunchyroll-att-funimation-acquisition\">completed its acquisition of Crunchyroll for $1.175 billion</a> and announced plans to unify both services under a single subscription.</p><p id=\"dYgIAz\">An <a href=\"https://help.crunchyroll.com/hc/en-us/articles/4418412542868-Funimation-Update-FAQ\">FAQ page</a> notes that Crunchyroll subscribers will now have access to simulcast content that was previously only available on Funimation and Wakanim, as well as 80 percent of Funimation and Wakanim’s “most popular existing series.” It’s unclear whether Crunchyroll will house the entire Funimation library (since there is some overlap between the content on both platforms already). Funimation will also no longer stream any new anime series starting this spring — they’ll be available on Crunchyroll from this point on — but will still add new episodes of continuing series.</p><div class=\"c-float-right\"><aside id=\"tx9aWo\"><q>Existing Funimation subscribers will get a 60-day free trial to Crunchyroll</q></aside></div><p id=\"sjKaEc\"><a href=\"https://www.crunchyroll.com/anime-news/2022/03/01/funimation-titles-now-available-on-crunchyroll\">A list</a> that Crunchyroll says will be “regularly updated” shows which Funimation series have already made their way to Crunchyroll. It, unsurprisingly, includes a number of dubs, which could be a nice option when wading through the large sub-only sea of shows on Crunchyroll. Some notable dubs coming to Crunchyroll include <em>Dr. Stone</em>, <em>Fire Force</em>, <em>My Hero Academia</em>, and <em>Tokyo Ghoul</em>. Other iconic series that were previously exclusive to Funimation, like <em>Cowboy Bebop</em> and <em>Yu Yu Hakusho</em>, are also now available on Crunchyroll.</p><p id=\"nfih2i\">Crunchyroll says it will soon send out emails to “qualified” Funimation, Wakanim, and VRV subscribers, offering a free 60-day subscription to Crunchyroll. But after the free trial, Funimation subscribers will be stuck paying a higher monthly price.</p><p id=\"kqgBEW\"><a href=\"https://funimation.8u86.net/c/482924/302280/4688?u=https%3A%2F%2Fwww.funimation.com%2Fsubscribe%2F&amp;sharedid=theverge.com\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Funimation charges</a> $5.99 / month for its cheapest plan and $7.99 / month for offline viewing and other perks. Meanwhile, <a href=\"https://www.crunchyroll.com/premium_pick_plan\">a Crunchyroll subscription</a> sits at $9.99 / month or $99.99 upfront for the whole year. Funimation also offers a $99.99 yearly option with perks, but if you’re used to paying just $5.99 / month for basic access, Crunchyroll’s $9.99 / month price might seem a little steep. Plus, the addition of new Funimation shows raises the question of whether Crunchyroll will decide to raise its price in the future.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3qHqTbZmMlUVkWeDL4GB3TUfatY=/7x132:2874x1633/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23279910/crunchyroll_funimation_merge.png",
  "description": "Crunchyroll is expanding.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}