{
  "title": "Futurama’s revival will feature the original voice of Bender after all",
  "url": "https://www.theverge.com/2022/3/2/22957871/futurama-hulu-john-dimaggio-bender",
  "date": "2022-03-02T09:14:57.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"“Futurama: Bender’s Big Score” Premiere\" src=\"https://cdn.vox-cdn.com/thumbor/5KR7TM9GEo4YQHV8Au6SE3uFYMg=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70568553/88449926.0.jpg\" />        <figcaption><em>DiMaggio with his character Bender.</em> | Image: Getty</figcaption>    </figure>  <p id=\"wQZ5Cq\">John DiMaggio is officially set to return to voice Bender in Hulu’s revival of <em>Futurama</em>, meaning all key cast members will reprise their roles in the sci-fi cartoon. The show’s return was announced <a href=\"https://www.theverge.com/2022/2/9/22925701/futurama-hulu-revival\">early last month</a>, with Billy West (Fry), Katey Sagal (Leela), Tress MacNeille (Mom, many others), Maurice LaMarche (Kif), Lauren Tom (Amy), Phil LaMarr (Hermes), and David Herman (Scruffy) all set to come back in their original roles. </p><p id=\"pzunmF\">At the time, <a href=\"https://deadline.com/2022/02/futurama-revived-new-season-hulu-original-cast-john-dimaggio-not-returning-bender-1234929844/\"><em>Deadline </em>reported</a> that DiMaggio’s role was in the process of being recast. The actor had reportedly turned down the initial offer, which he felt “was not competitive based on the success and name recognition of the original series.” Fans were outraged (obviously), and a #Bendergate hashtag emerged (obviously), and DiMaggio himself eventually <a href=\"https://twitter.com/TheJohnDiMaggio/status/1493769815353225217\">took to Twitter </a>to offer a fuller explanation.</p><div id=\"vVNZwV\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Update: <a href=\"https://twitter.com/hashtag/bendergate?src=hash&amp;ref_src=twsrc%5Etfw\">#bendergate</a> <a href=\"https://t.co/tBG7d9hQ3R\">pic.twitter.com/tBG7d9hQ3R</a></p>— John DiMaggio (@TheJohnDiMaggio) <a href=\"https://twitter.com/TheJohnDiMaggio/status/1493769815353225217?ref_src=twsrc%5Etfw\">February 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"Llfi05\">“I don’t think only I deserve to be paid more. I think the entire cast does. Negotiations are a natural part of working in show business. Everyone has a different strategy and different boundaries,” DiMaggio wrote in a statement, “It’s about self-respect. And honestly, being tired of an industry that’s become far too corporate and takes advantage of artist’s time and talent.” </p><p id=\"v7wfq0\">Unsurprisingly, DiMaggio offered a more positive statement upon the news of his return. “So damn grateful for the love and support of fans and colleagues alike during this whole time (especially my wife, Kate), and I cannot wait to get back to work with my Futurama family,” DiMaggio said. “#Bendergate is officially over.” <a href=\"https://deadline.com/2022/03/john-dimaggio-return-futurama-revival-hulu-bendergate-1234968435/\"><em>Deadline </em>reports</a> that DiMaggio’s paybump is thought to have been “minimal at best” after negotiations.</p><p id=\"QXXOt5\">The new 20-episode run, which is scheduled to come to Hulu in 2023, is the third time the sci-fi series has been revived. The show’s original run on Fox was canceled after four seasons, but was later revived in the form of four direct-to-DVD movies that were also broadcast on Comedy Central. The network then ordered new seasons of the series which again aired in 2010, before cancellation in 2013.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jxbQlumGGFbRd0vR4NMpdEU4FSA=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23282445/88449926.jpg",
  "description": "‘#Bendergate is officially over.’",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}