{
  "title": "GameStop is launching its own NFT marketplace",
  "url": "https://www.theverge.com/2022/2/3/22914855/gamestop-nft-marketplace-immutable-x-ethereum-announcement",
  "date": "2022-02-03T12:00:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hrCmIgQTziRRdYeuKj1zQQzXDX8=/0x0:2200x1467/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70466018/20170822_Sean_Hollister_Verge_2.0.jpg\" />        <figcaption>Photo by Sean Hollister / The Verge</figcaption>    </figure>  <p id=\"fBcJX3\">GameStop plans to launch its own marketplace for non-fungible tokens (or NFTs) and is co-creating an “up to $100 million” fund for game developers who use it. The marketplace will mark GameStop’s expansion from a <a href=\"https://www.theverge.com/22251427/reddit-gamestop-stock-short-wallstreetbets-robinhood-wall-street\">popular meme stock</a> to a company that dabbles in cryptocurrency and Web3 tech — although it may also provoke the wrath of gamers who are stridently opposed to NFTs.</p><p id=\"rziygl\">The new GameStop NFT marketplace is supposed to launch later this year. It’s built on Immutable X, a platform based on the popular Ethereum cryptocurrency blockchain. Designed by Immutable, the company behind the NFT trading card game <em>Gods Unchained</em>, Immutable X is intended to mitigate the biggest drawbacks of Ethereum: its massive energy consumption and the high associated “gas fees,” which can add <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.morningbrew.com%2Fdaily%2Fstories%2Fethereum-gas-fees&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F3%2F22914855%2Fgamestop-nft-marketplace-immutable-x-ethereum-announcement\" rel=\"sponsored nofollow noopener\" target=\"_blank\">exorbitant processing costs</a> to any transaction. The protocol combines hundreds of thousands of sale records into a single transaction that’s written to the Ethereum blockchain; Immutable promises to make up for the environmental costs it <em>does</em> incur by paying for carbon offsets.</p><p id=\"yP7qKO\">Immutable’s existing partnerships are supposed to give the new GameStop initiative a boost since companies that already use Immutable X will be able to feature their NFTs on the marketplace. Immutable and GameStop are also partnering to create the fund for developers. While Immutable X is used by some non-gaming-focused partners <a href=\"https://www.theverge.com/2021/9/30/22702871/lil-nas-x-tiktok-top-moments-nfts-auction\">like TikTok</a>, GameStop’s marketplace is pitched as a place to buy and sell in-game assets represented as blockchain tokens — GameStop offers the examples of digital real estate, weapons, and character skins.</p><p id=\"kPCwrd\">GameStop previously <a href=\"https://www.theverge.com/2021/10/27/22747748/gamestop-web3-gaming-nft-job-listing-nfts-ethereum\">signaled its interest</a> in blockchain tech last year, advertising for a “head of Web3 gaming” as well as a variety of NFT-based jobs. NFTs are often described as a way to prove ownership of in-game items, and they can let players trade items outside an approved marketplace like an in-game auction house. Some “play-to-earn” games like <em>Axie Infinity</em> also use cryptocurrency and NFTs to run an in-game economy that translates into <a href=\"https://restofworld.org/2021/axie-infinity/\">real money for players</a>. But their benefits are sometimes oversold — particularly claims that they will let players carry items from one game to another, a possibility that’s <a href=\"https://www.businessinsider.com/video-game-makers-explain-why-main-metaverse-promise-is-false-2022-1\">difficult and often undesirable</a> for many other reasons.</p><p id=\"XGPJJ7\">While some companies, <a href=\"https://www.theverge.com/2021/12/7/22822410/ubisoft-nfts-quartz-digits-ghost-recon-breakpoint\">particularly Ubisoft</a>, have forged ahead with NFT gaming <a href=\"https://arstechnica.com/gaming/2021/12/ubisofts-first-nft-plans-make-no-sense/\">despite criticism</a>, others have canceled plans for NFTs linked with <a href=\"https://www.theverge.com/2021/12/16/22840488/stalker-2-nft-metahuman-gsc-web3-canceled\">games like <em>S.T.A.L.K.E.R. 2</em></a> and <a href=\"https://www.theverge.com/2022/2/1/22913110/team17-worms-nft-metaworms-gaming-playtonic-overcooked\"><em>Worms</em></a>. That’s happened partly due to criticism from players but also a lack of enthusiasm from developers — who <a href=\"https://www.theverge.com/2022/1/20/22893216/gdc-annual-survey-2022-game-developers-nfts\">responded overwhelmingly negatively</a> to the phenomenon in a recent survey. But launching with buy-in from blockchain-native games could help GameStop dodge the backlash that’s followed publishers and studios delving into NFTs.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/h6HKh4hGIXlpKsPLmpZLckRqr0A=/0x158:2200x1310/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22401035/20170822_Sean_Hollister_Verge_2.jpg",
  "description": "It’s supposed to open later this year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}