{
  "title": "Garmin Vivosmart 5 review: fifth time’s the charm",
  "url": "https://www.theverge.com/23055864/garmin-vivosmart-5-review-fitness-tracker-wearable",
  "date": "2022-05-04T14:42:55.000Z",
  "author": "Victoria Song",
  "content": "  <p>The physical button makes a huge difference</p> <p class=\"p--has-dropcap p-large-text\" id=\"MeMqMI\">I wanted to love the Garmin Vivosmart 4 back when it launched in 2018. It was a chic yet capable fitness band, with a great set of fitness tracking features for the price. It was almost perfect, except for one major flaw: the touchscreen. Swipes didn’t register like they were supposed to, and the capacitive button was even more finicky. So when I first unboxed the $149.99 Garmin Vivosmart 5, I breathed a huge sigh of relief. There, at the bottom of the display, was a beautiful, physical button.</p><p id=\"2E2IVP\">Adding a button might not seem like a game-changer, but in this case, it most certainly is. The Vivosmart lineup has always been plagued by unresponsive touchscreens. Sure, the Vivosmart 4 was an improvement on the Vivosmart 3, but it was still frustrating to use. Swipes wouldn’t register properly, and sometimes you ended up smacking your wrist just to start an activity. It’s the sort of annoyance that builds up over time until one day you just leave an otherwise excellent tracker to collect dust in a drawer.</p><div id=\"CGTHvu\"><div data-anthem-component=\"scorecard:11176245\"></div></div><p id=\"SxaCEn\">Like many of Garmin’s rugged GPS watches, the Vivosmart 5 uses a combination of a touchscreen and a physical button. That means you can swipe when it makes sense, like scrolling through menus. It also means you can reliably use the button to head back to the home screen and previous menus, as well as stop an activity. It’s intuitive to use and eliminates practically all the frustrations I’ve had with previous Vivosmart models. Also, it’s more satisfying to press a button and feel that tactile click. The capacitive buttons on other fitness trackers just don’t feel as natural.</p><p id=\"w0ka0H\">Another big change is you can finally swap bands to better fit your style. Huzzah! One of the Vivosmart 4’s biggest flaws was that it had a unibody design. So while it may have been stylish, it meant you had to truly commit to what model you wanted at checkout. Swappable bands allow for more flexibility, and I appreciated how simple it was to pop the tracker in and out. No finicky pins here. The downside is you have to use Garmin’s official accessories at the moment — and the <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.garmin.com/en-US/p/834004/pn/010-13201-00#devices\" rel=\"sponsored nofollow noopener\" target=\"_blank\">selection there is limited</a>. That doesn’t mean Garmin or third parties won’t come out with additional options down the line, but it’s something to keep in mind. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/O2i-M4XhkDnSyjj-7YKq6ds6jgg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432440/vsong_220426_5173_0010.jpg\">      <figcaption><em>The selection of bands is limited at the moment, but swapping the tracker out is very easy.</em></figcaption>  </figure></div><p id=\"8rL4q7\">Otherwise, if you liked the Vivosmart 4, the Vivosmart 5 will feel familiar. Instead of completely overhauling the design, Garmin tweaked the overall vibe. Where its predecessor was elegantly chic, the Vivosmart 5 is casually sporty. It’s reminiscent of what Garmin did with the <a href=\"https://www.theverge.com/22882401/garmin-vivomove-sport-review-fitness-tracker-smartwatch-wearables\">Vivomove Sport</a>, which went from a sophisticated luxe look to one that I’d describe as fashionable athleisure. Most importantly, it’s still lightweight and comfortable to wear 24/7.</p><p id=\"AzlHGU\">The Vivosmart 5 also doesn’t add features we haven’t already seen. You still get connected GPS through your phone, blood oxygen monitoring, and continuous heart rate monitoring. You can also access Garmin-specific metrics like Body Battery, which helps you visualize how much energy you have for exercise based on your sleep quality and activity levels. This — plus basic smart features like push notifications, timers, and media controls — were all available on the Vivosmart 4. The same holds true for health features like sleep tracking, stress tracking, breathing exercises, and high/low heart rate notifications. The main thing this tracker has over its predecessor is Garmin’s safety features. That includes the company’s take on fall detection, the ability to let trusted contacts track you in real-time during an activity, and emergency SOS alerts. </p><p id=\"JtJMPg\">Instead of adding sensors, the Vivosmart 5 actually gets rid of one: the barometric altimeter. That said, it’s not a huge loss. All that means is you can’t track floors climbed, and in my experience, this is a notoriously inaccurate metric and not helpful for the average person. Otherwise, you have your standard mix of accelerometers, an SpO2 sensor, an ambient light sensor, and an optical heart rate sensor.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HXLGh_mFvMl953DRuiFAIlBbcco=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432435/vsong_220426_5173_0003.jpg\">      <figcaption><em>The only sensor missing this time around is the barometric altimeter</em></figcaption>  </figure><p id=\"1bYYVq\">Most of the changes Garmin made are smart choices. That said, I have mixed feelings about the monochrome OLED display. It’s 66 percent larger this time around, and yes, that does help with readability. It just may not be enough. I happen to be someone cursed with severe astigmatism, and although I have corrective lenses, it’s still difficult for me to read small text. Often, I ended up squinting at the display, especially when running outside in bright sunlight. It’s not a dealbreaker, per se. It works fine for quickly screening notifications. It’s inadequate, however, if you’re someone who wants to read full text messages from the wrist. </p><div class=\"c-float-right c-float-hang\"><aside id=\"3kfg0c\"><q>In 2022, many fitness bands have moved onto color OLED touchscreens</q></aside></div><p id=\"2F7lSp\">A few years ago, this wouldn’t have bothered me as much because almost every fitness band had this type of display. It was just something you dealt with if you preferred this form factor over a smartwatch. However, in 2022, many fitness bands have moved onto color OLED touchscreens. Hell, even the $79.99 <a href=\"https://www.theverge.com/22834452/amazon-halo-view-review-fitness-trackers\">Amazon Halo View</a> has one. Color displays on fitness bands tend to be much brighter, easier to read, and a better choice for someone like me. I get that not everyone needs or even wants this type of display but it’s hard to reconcile when you compare the Vivosmart 5 to the Fitbit Luxe. They have similar sensors, features, design sensibilities, and target audiences. However, the Luxe affords you a more vibrant display and a more affordable retail price of $129.95. </p><p id=\"xa4QQw\">For fitness tracking, the Vivosmart 5 is best for casual activity. It’s good for counting steps and how many minutes of intense activity you get per week. If all you want is a rough log of your physical exercise and don’t care to get too into the weeds with data, the Vivosmart 5 more than suffices. It’s also a good device for folks who feel they’re committed enough to stick with an outdoor sport like running or cycling for a long time. Compared to Fitbit, the Garmin Connect app provides much more in-depth metrics (i.e., estimated sweat loss, moving pace versus average pace, etc.) — many of which beginners don’t really need but could become helpful insights as someone progresses over time.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ng_GgG4h4Azcpf-pmXoQRcmDtWI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432437/vsong_220426_5173_0005.jpg\">      <figcaption><em>The button right here is the MVP.</em></figcaption>  </figure></div><p id=\"htji4u\">It’s also a decent tracker for outdoor GPS activities. For starters, it never takes too long for the Vivosmart 5 to connect to my phone’s GPS — though occasionally you do have to help it along and open the Garmin Connect app. I was also satisfied with its distance tracking. Sometimes with trackers that rely on connected GPS, you end up with wonky results that make it difficult to gauge your progress over time. That wasn’t the case with the Vivosmart 5. On an easy two-mile run logged in the Runkeeper app, it recorded 2.09 miles compared to the 2.0 miles logged by my Apple Watch Series 7. This is the sort of discrepancy I expect to see between these three tracking methods at this distance. Both the Vivosmart 5 and Series 7’s metrics were also on par when it came to average heart rate and step cadence. </p><p id=\"W4AHY8\">The trickier thing about trackers with connected GPS is that negligible differences on short runs tend to balloon the longer you go. For instance, I run-walked 2.3 miles with a friend and the Vivosmart 5 logged it as 2.43 miles to the 2.3 miles logged by the Series 7. A 0.13-mile difference isn’t so bad if you’re not running for long, but these gaps on tethered GPS trackers tend to widen over a longer distance. It’s easy to get up in arms over “inaccurate” results, but you shouldn’t worry about this if building a consistent routine is your goal. You’ll still be able to reliably track your progress, and get credit for your activity. This only really matters if you have precise, distance-related goals. In that case, you’d be better served in the long run by a device with built-in GPS.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6uxq_c8ijnE9dU9jhxK7M-FHmTs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432438/vsong_220426_5173_0008.jpg\">      <figcaption><em>The screen is 66% larger this time around, but the text is still small.</em></figcaption>  </figure><p id=\"wBYKIa\">As for battery life, Garmin rates the Vivosmart 5 for an estimated 7 days. That bore out in testing so long as all-day blood oxygen monitoring was turned off. Once you turn all-day monitoring on, battery life takes a major hit to 2-3 days max. Garmin will warn you about the battery drain when you enable the feature, and this is true across all Garmin devices. It just appears more drastic on a tracker with 7 days of battery, versus a rugged watch with 21 days of battery or more. </p><p id=\"uAlkvh\">That said, there’s no reason to turn on all-day blood oxygen monitoring when you can also opt to turn it on during sleep only. The feature is most useful for sleep tracking, so there’s no real reason to trade battery life for metrics you won’t likely use. Meanwhile, sleep tracking on the Vivosmart 5 is good for getting a big picture of your sleep patterns, but I wouldn’t rely on it for much more than that. My sleep scores often didn’t line up with how I felt, and occasionally the device had a hard time determining light sleep from me lying awake in a late-night staring contest with my hungry cat. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5qnOXdAuoe5Hfo3LxMgOxyswzaQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432442/vsong_220426_5173_0012.jpg\">      <figcaption><em>The screen is easier to read than on previous models, but still a bit dated in 2022.</em></figcaption>  </figure></div><p id=\"g3guDn\">At $149.99, the Vivosmart 5 is a solid fitness tracker that improves upon the flaws of its predecessors instead of introducing a host of new ones. If you were thinking about upgrading from a Vivosmart 3 or 4, do it. The physical button is worth it. For everyone else on the fence, there’s at least one reason why I’d still opt for this over a Fitbit tracker with a color display. Garmin has stated multiple times that it does not plan to lock your data behind a subscription. Fitbit, on the other hand, puts many of its best metrics behind a $10 monthly paywall. Subscriptions are an increasingly <a href=\"https://www.theverge.com/22789248/oura-ring-3-review-sleep-tracker-fitness-tracker\">popular</a> <a href=\"https://www.theverge.com/22957195/whoop-review-fitness-tracker-wearables\">business model</a> with wearables and connected fitness, so this kind of commitment is rare to see these days.</p><p class=\"c-end-para\" id=\"RSdzTX\">Ultimately for me, it was a nice break to wear the Vivosmart 5 after weeks of testing feature-laden fitness smartwatches. The heyday of the fitness band may well be behind us, but there’s something to be said for a gadget that’s not trying to be a mini phone on your wrist. While I did miss having a beautiful display, on the flip side, it also encouraged me to be more present in the moment. During runs, I was able to take in the cherry blossoms blooming on my running path because I wasn’t constantly checking my wrist. I wasn’t fiddling with settings for 15 minutes before getting out the door. I could just hit a button and go. I was less distracted by my notifications — partly <em>because</em> the screen limited what I could see to the basics. The Vivosmart 5 just faded into the background of my life until I actually wanted to use it. If that’s the type of experience you’re looking for, this tracker is for you. </p><p id=\"Lf8qHm\"><em>Photography by Victoria Song / The Verge</em></p><div><div id=\"REcptL\"><div data-anthem-component=\"aside:11176259\"></div></div></div><p id=\"nunEdB\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SCShfJ8QR6UnAg0Y-9OX4tZebVk=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432443/vsong_220426_5173_0013.jpg",
  "description": "Smart changes fix what used to be a finicky touchscreen",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}