{
  "title": "Garmin’s Vivosmart 5 might finally get the touchscreen right",
  "url": "https://www.theverge.com/2022/4/20/23030327/garmin-vivosmart-5-fitness-tracker-wearables",
  "date": "2022-04-20T11:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"The mint Garmin Vivosmart 5 on a purple yoga block.\" src=\"https://cdn.vox-cdn.com/thumbor/5ZfOjRGC2T0xvQ6sjcNrUbuhtiU=/0x2:8192x5463/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70770418/20220119_Social_FIT_1230.0.jpg\" />        <figcaption><em>The Garmin Vivosmart 5 adds a practical button to the tracker line.</em> | Image: Garmin</figcaption>    </figure>  <p id=\"UJgaCB\">If there’s one thing that Garmin seems to understand better than other wearables companies, it’s that athletes like buttons. And, it looks like the company’s finally added a practical button to its latest <a href=\"https://www.theverge.com/22985108/best-fitness-tracker\">fitness tracker</a>, the $149.99 Vivosmart 5. </p><p id=\"oTY48U\">The Vivosmart 5 is a refreshed version of the <a href=\"https://www.theverge.com/circuitbreaker/2018/8/30/17800484/garmin-vivosmart-4-fitness-tracker-release-cost-ifa-2018\">Vivosmart 4</a> that was first launched in 2018. It keeps much of the same design as Vivosmart 4, but instead of an elegant vibe, it opts for a more practical, sportier look. The band itself has a rounded edge, and there’s no more metal border surrounding the display. In its press release, Garmin also emphasized that the display is 66 percent bigger and has larger text so that it’s easier to read. But the biggest difference is that the Vivosmart 5 has a proper button, and the swipe-based touchscreen is far easier to use. </p><p id=\"IvGmKY\">I’ve tested the <a href=\"https://www.theverge.com/2017/4/12/15275422/garmin-vivosmart-3-fitness-tracker-heart-rate-breathe-strength-training\">Vivosmart 3</a> and 4, and both trackers suffered from the same problem: the display. The screen on the Vivosmart 3 appeared blurry, wasn’t easy to read in sunlight, and swipes didn’t easily register. The Vivosmart 4 fixed the blurriness, but its menu “button” didn’t always work, and the touchscreen wasn’t as responsive as it should’ve been. That made starting and ending activities tedious — especially with sweaty fingers. </p>  <figure class=\"e-image\">        <img alt=\"The white, mint, and black versions Garmin Vivosmart 5 on a black yoga mat\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ucCq55jf_kyuez3OP9rd2pDw__c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397676/20220119_Social_FIT_1220.jpg\">      <cite>Image: Garmin</cite>      <figcaption><em>The $149.99 Vivosmart 5 comes in white, mint, and black.</em></figcaption>  </figure><p id=\"4K5slL\">I’ve been playing around with the Vivosmart 5, and it seems Garmin’s addressed both these problems. The button <em>works</em> and is slightly raised from the display, making it easy to find by feel. Likewise, I’ve found the touchscreen to be much more sensitive and easy to use. I still have to put the Vivosmart 5 through its paces, but so far, this is a marked improvement to the Vivosmart line’s biggest issue.  </p><p id=\"v89F44\">Garmin’s also addressed another gripe with the Vivosmart line. Previous Vivosmart trackers had a unibody design, meaning you couldn’t swap out straps. The Vivosmart 5, however, introduced swappable straps. All you have to do is pop out the tracker. </p><p id=\"MglvJc\">While most of the Vivosmart 5’s changes come from the design, Garmin also added more software features. Namely, the Vivosmart 5 introduces abnormal heart rate alerts to the tracker line. It also includes Garmin’s personal safety features. Pushing the button for a few seconds will trigger an assistance alert to assigned emergency contacts. Otherwise, the Vivosmart 5 keeps its predecessor’s continuous heart rate monitoring, SpO2 sensors, tethered GPS, stress tracking, and 7-day battery life. </p><p id=\"z95fHb\">The $149.99 Garmin Vivosmart 5 is available starting today and comes in black, white, and cool mint. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nuJRGl1AnCwecMb8e7NfxYzTbCs=/0x588:8192x4877/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397673/20220119_Social_FIT_1230.jpg",
  "description": "Hopefully this fixes the Vivosmart line’s longstanding display problems.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}