{
  "title": "Garmin’s Instinct 2 Solar claims to have ‘unlimited’ battery life",
  "url": "https://www.theverge.com/2022/2/9/22925125/garmins-instinct-2-solar-power-fitness-tracker-smartwatches",
  "date": "2022-02-09T15:39:22.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"A shot of two people hiking with the Garmin Instinct 2S and the regular Instinct 2.\" src=\"https://cdn.vox-cdn.com/thumbor/TqQw5suZLn0uZlamOvK2SAYJ2k8=/202x0:1296x729/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70488230/Instinct_2_Series_Press_Release_Newsroom_copy_2.0.jpg\" />        <figcaption><em>Garmin’s Instinct 2 watches come in two sizes, a smaller 40mm (left) and the standard 45mm. </em> | Image: Garmin</figcaption>    </figure>  <p id=\"La3rzj\">Garmin’s back with yet another multisport smartwatch lineup. The <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.garmin.com%2Fen-US%2Fnewsroom%2Fpress-release%2Fsports-fitness%2Fstand-out-in-a-crowd-with-garmin-instinct-2-series%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F9%2F22925125%2Fgarmins-instinct-2-solar-power-fitness-tracker-smartwatches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Instinct 2 series</a> is billed for “rugged individualists,” but this time there’s an interesting twist. The company says the solar models of the smartwatch can get <em>unlimited</em> battery life thanks to improvements in their solar technology. </p><p id=\"yFvdSL\">Garmin has been tinkering around with solar charging for a while now. It introduced the feature with the Fenix 6 Series and later expanded it to other watches, including the original Instinct. When it launched the flagship <a href=\"https://www.theverge.com/2022/1/18/22883556/garmin-fenix-7-epix-gps-smartwatches-outdoors-fitness\">Fenix 7 Series</a> last month, Garmin noted it had vastly improved the solar charging tech. Now it’s bringing those advances to its mid-range Instinct 2 series.</p><p id=\"QzTOLB\">That said, unlimited battery life is a bold claim — especially for a watch that’s catering to very active outdoor enthusiasts. And, of course, there’s fine print involved.</p><p id=\"Gd4DWa\">Unlimited battery life is only available on the larger 45mm Instinct 2 Solar models when in smartwatch mode — so, monitoring health and delivering notifications, but not tracking activities like running. Also, Garmin based this “unlimited” claim off three hours per day outside in 50,000 lux conditions. For context, <a href=\"https://www.aon2.co.uk/illuminance/\">direct sunlight</a> can range from 32,000 to well over 100,000 lux. Indirect sunlight is anywhere from 10,000 to 25,000 lux. Basically, that means you don’t have to necessarily aim your wrist directly at the sun, but you probably have to be outside for several hours each day to make good on that unlimited claim. </p><p id=\"eZokoj\">Even so, the entire Instinct 2 series boasts impressive battery life. Garmin says the smartwatches get up to four weeks of continuous usage in smartwatch mode. </p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2DC_9magNJexq9tPPZD53tHaHz8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23229296/cf_lg_78970315_2323_42ac_a5a1_ec786951901b.jpg\">      <cite>Image: Garmin</cite>      <figcaption><em>The Instinct 2 Solar in electric lime.</em></figcaption>  </figure></div><p id=\"BQcCsz\">It also wouldn’t be Garmin if there weren’t <em>endless</em> versions of the Instinct 2. The watch comes in two sizes: the standard 45mm, and the 40mm Instinct 2S for people with smaller wrists. Garmin’s also putting out Surf, Tactical, and Camo editions of the watches. The Surf edition is aimed at water sport enthusiasts and adds activity profiles for surfing, windsurfing, and kiteboarding. It also updates users on the tides and ocean conditions. The Tactical edition is “popular with military personnel” and has features such as stealth mode and night vision goggle compatibility. The Camo edition... has camo patterns. We won’t get into every single color combo, because frankly, it would take too long. Garmin says the watch will be compatible with its <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.garmin.com%2Fen-US%2Fyour-watch-your-way%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F9%2F22925125%2Fgarmins-instinct-2-solar-power-fitness-tracker-smartwatches\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Your Watch, Your Way</a> program so you can customize the bezel and straps for a total of 240 design combos. </p><p id=\"tyC5j1\">All the watches feature scratch-resistant glass and are built to military standards for thermal and shock resistance. They’re also water-resistant to 100 meters. But aside from specs, the Instinct 2 Series is also getting some health upgrades. You’ll now be able to track periods and pregnancy, as well as monitor sleep and stress. Garmin is also adding metrics like VO2 max and fitness age, and more pre-installed workout activities. It’ll also include insights into your training load and recovery. For peace of mind, Garmin’s also adding the <a href=\"https://support.garmin.com/en-US/?faq=RfaXahBWkH8Q7pVFLsuUmA\">incident detection</a> feature that can message your name and location to emergency contacts. The Instinct 2 will also now support Garmin Pay. It’s a lot of watch for the price.</p><p id=\"Za4qYC\">All versions of the Instinct 2 are available now starting from $349.99, though if you want to customize your colors you’ll have to wait a little longer. Garmin didn’t specify when exactly the Instinct 2 Series would come to its Your Watch, Your Way site but said that it would be “available shortly.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eaSPlokc1nvu3J_t_lpXFodfi-g=/0x0:1296x679/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229292/Instinct_2_Series_Press_Release_Newsroom_copy_2.jpg",
  "description": "Provided you go outside for three hours a day",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}