{
  "title": "Germany shuts down servers for Russian darknet marketplace Hydra",
  "url": "https://www.theverge.com/2022/4/5/23011377/germany-servers-russian-darknet-site-hydra-bitcoin",
  "date": "2022-04-05T19:24:01.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ar-AGwfsSc8Y1P9R2tQeQuIK508=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70713730/acastro_170621_1777_0001_fin.5.jpg\" />    </figure>  <p id=\"rwXKma\">German authorities shut down the server infrastructure for the Russian darknet marketplace Hydra, seizing €23 million (~$25.2 million USD) worth of Bitcoin in the process, Germany’s Federal Crime Police Office (BKA) <a href=\"https://www.bka.de/DE/Presse/Listenseite_Pressemitteilungen/2022/Presse2022/220405_PM_IllegalerDarknetMarktplatz.html\">announced</a> on Tuesday (via <a href=\"https://www.bleepingcomputer.com/news/legal/germany-takes-down-hydra-worlds-largest-darknet-market/\"><em>Bleeping Computer</em></a>). </p><p id=\"kh0QFj\">Hydra is a large marketplace on the dark web that serves as a hub for drugs, stolen credit card information, counterfeit bills, fake documents, and other illegal goods or services. The market primarily caters to criminals in Russia and surrounding nations. “Treasuremen,” or dealers connected with the site, push drugs throughout the region by <a href=\"https://www.vice.com/en/article/g5x3zj/hydra-russia-drug-cartel-dark-web\">hiding them in geo-tagged pickup locations</a>.</p><div class=\"c-float-right\"><aside id=\"hvfE1Y\"><q>Hydra has the highest turnover rate out of any illegal market in the world</q></aside></div><p id=\"9jouXV\">With the shutdown of the German-based server, authorities are now launching an investigation into the “unknown operators and administrators” of Hydra, whom they suspect of selling narcotics and engaging in money laundering. German authorities say they have been investigating the marketplace with the help of the US since August 2021. The BKA told <em>The Verge</em> that no arrests have been made as of yet.</p><p id=\"MFuxnK\">In response to the shutdown, the US Department of the Treasury’s Office of Foreign Assets Control <a href=\"https://home.treasury.gov/policy-issues/financial-sanctions/recent-actions/20220405\">announced</a> that it has sanctioned Hydra and Russian cryptocurrency exchange Garantex. The US is also working to identify <a href=\"https://home.treasury.gov/policy-issues/financial-sanctions/recent-actions/20220405\">over 100 cryptocurrency addresses</a> with ties to the illegal marketplace.</p><p id=\"vZvrXx\">“Our actions send a message today to criminals that you cannot hide on the darknet or their forums, and you cannot hide in Russia or anywhere else in the world,” Secretary of Treasury Janet L. Yellen said. “In coordination with allies and partners, like Germany and Estonia, we will continue to disrupt these networks.”</p><p id=\"Ck6cJW\">With about 17 million customer accounts and 19,000 sellers, Germany’s BKA and Central Office for Combatting Cybercrime (ZIT) say Hydra has the highest turnover rate out of any illegal market in the world, estimating a turnover of about €1.23 billion (~$1.35 million USD) in 2020 alone. German authorities note that cryptocurrency transactions on Hydra are especially hard to track due to a crypto-concealing service called the Bitcoin Bank Mixer.</p><p id=\"sTzaV4\">Last year, <a href=\"https://www.theverge.com/2021/1/12/22227929/darkmarket-shutdown-europol-worlds-largest-illegal-marketplace\">German authorities shut down the darknet marketplace DarkMarket</a>, which had nearly half a million users at the time. Authorities across the world have long been trying to crack down on illegal marketplaces, taking down <a href=\"https://www.theverge.com/2013/10/2/4794780/fbi-seizes-underground-drug-market-silk-road-owner-indicted-in-new\">Silk Road</a>, <a href=\"https://www.theverge.com/2019/5/3/18528211/wall-street-market-silkkitie-valhalla-dark-web-takedown-police-germany\">Wall Street Market</a>, and <a href=\"https://www.theverge.com/2017/7/14/15975140/alphabay-dark-web-drug-marketplace-police-shutdown-silk-road\">AlphaBay</a> over the course of several years.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/p230_bbmfO1qQ5ZuapX9JJbHPiY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11556959/acastro_170621_1777_0001_fin.jpg",
  "description": "Authorities seized millions in Bitcoin from the illegal marketplace.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}