{
  "title": "Get a first look at Xenoblade Chronicles 3",
  "url": "https://www.theverge.com/2022/2/9/22926181/xenoblade-chronicles-3-nintendo-switch-release-date",
  "date": "2022-02-09T23:21:30.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/dgqiGQEot1bt9KXvLMc3NW1bmq8=/154x0:1839x1123/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70490868/FLMGI51XsAQsH7h.0.jpeg\" />    </figure>  <p id=\"x7DZYV\">To close out a presentation that did not feature <em>Mother 3</em> or<em> Mario Kart 9</em>, Nintendo debuted the trailer for a hotly anticipated Japanese RPG series that hasn’t had a new entry in several years. No, not <em>The Sequel To The Legend of Zelda: Breath of the Wild:</em> it’s <em>Xenoblade Chronicles 3</em>. </p><p id=\"2MkPke\">The trailer felt very much like a <em>Xenoblade</em> game, featuring agonized possible 14-year-olds ruminating on the nature of war, weapons accented with neon lights, and lots of characters running in gorgeous valleys with unfathomably large structures in the background. </p><p id=\"nFTDZW\">According to Nintendo’s press release, “Players will step into the roles of protagonists Noah and Mio amid turmoil between the hostile nations of Keves and Agnus.” </p><p id=\"BqB4gG\">Though the trailer didn’t showcase any combat, the press release highlights that there will be six characters from the warring nations and that the theme of the game will be “life.” Nintendo also promised that <em>Xenoblade Chronicles 3,</em> “will connect the futures of both <em>Xenoblade Chronicles</em> and <em>Xenoblade Chronicles 2.”</em></p><p id=\"RQzAs7\"><em>Xenoblade Chronicles 3</em> comes to the Switch in September 2022. </p><p id=\"c3a4gC\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-PKaWH_wA64LMKLQsm73qwELGT4=/0x41:1991x1083/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23230742/FLMGI51XsAQsH7h.jpeg",
  "description": "Breath of the Wild 2 got lost in the mail I guess",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}