{
  "title": "Ghostwire: Tokyo is a paranormal love letter to the city",
  "url": "https://www.theverge.com/22994538/ghostwire-tokyo-city-design",
  "date": "2022-03-25T14:30:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u_bdYr9NqyRrXhp0mmx22hBP_iM=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70671242/Ghostwire_Tokyo_Dog.0.png\" />    </figure>  <p id=\"wIpoKw\"><em>Ghostwire: Tokyo</em> is a lot of different things. It’s a paranormal buddy cop drama, a high-octane action title, and a spooky exploration game from a studio known primarily for its horror titles. But according to producer Masato Kimura, none of those elements were the starting point for the game. “The entire concept stemmed from the city of Tokyo,” he tells <em>The Verge</em>.</p><p id=\"xWxq8o\">The game takes place in a nearly empty version of the city, thanks to a mysterious event called “the vanishing” that causes the sudden disappearance of nearly every person in Tokyo. In their place are folklore creatures and evil spirits roaming the streets. Players wield magic to fight enemies while searching every nook of the city for lost spirits to save. <em>Ghostwire</em> pulls players through everywhere, from iconic locations like Shibuya Crossing to more mundane places, like back alleys and generic office buildings.</p><div class=\"c-float-right\"><div id=\"24RJI5\"><div data-anthem-component=\"aside:11112109\"></div></div></div><p id=\"IgTEJO\">According to director Kenji Kimura, much of the inspiration came from the duality of Tokyo, a city that’s both strikingly modern and rooted in history. “There are office buildings constantly under construction, but if you turn the corner, you can walk directly into a shrine,” he says. “When you walk into a shrine, the air feels different, it almost tastes different, so it feels like you’ve walked into a different plane. Sometimes you can be walking down the streets of Shibuya, turn down an alleyway, and, a few steps in, you’ll be surrounded by normal houses or a completely different setting. We wanted to take that idea of stepping into another world in a very natural way.”</p><p id=\"JZpLwx\">Given that development studio Tango Gameworks is based in Tokyo, much of the research simply involved going for lots of walks. There are plenty of games set in Tokyo — from <a href=\"https://www.theverge.com/2017/3/29/15098458/persona-5-review-ps4-ps3\"><em>Persona 5</em></a> to <a href=\"https://www.theverge.com/2018/10/12/17967590/the-world-ends-with-you-nintendo-switch-rpg-review\"><em>The World Ends With You</em></a> to every iteration of <a href=\"https://www.theverge.com/22255880/yakuza-series-xbox-game-pass-where-to-start\">the <em>Yakuza</em> franchise</a> — but one of the goals on <em>Ghostwire</em> was to show the city from a different perspective that people from the outside might not be as familiar with.</p><p id=\"GwzrmP\">“We didn’t just choose the touristy sections that are in the tour books — we also selected a lot of the cool parts that we saw and felt were interesting,” says Masato. “It’s a city that’s very modern but also very historically rooted. A lot of traditional culture can be seen in the architecture and the layout of the city. There are alleys and houses filled with trash, there are apartment complexes that are run and owned by the government — all of these different parts of Tokyo that we wanted to make it easier to access for the player, so we condensed them and stitched them closer to Shibuya so that the map is much more accessible.”</p><div id=\"7FHzwS\"><div data-anthem-component=\"gallery:11112103\"></div></div><p id=\"ZId2oE\">One of the challenges became capturing the essence of a city of over 30 million people when almost none of those people are present. Kenji says that “it took a lot of experimentation” to figure out how to nail that vibe, while Masato describes it as “a very difficult process.” <em>Ghostwire</em> livens up the empty city in a few ways, from the spirits of city dwellers that still remain to the thumping music coming from now-closed bars and restaurants to the cats and dogs that now run the streets of Tokyo. (You can, of course, pet the dogs, though it’s more challenging with cats. “Cats probably love you the same amount,” Kenji says, “but they want to maintain their distance a little more. And so we try to represent that in the game.”)</p><div class=\"c-float-right\"><aside id=\"KjKRBb\"><q>“There can be unordinary things that we can’t see.”</q></aside></div><p id=\"jbS8tN\">Capturing the mundane and familiar aspects of Tokyo was also important for the theme of the game. The idea was that, by making the city rooted in reality, it would make the more surreal and supernatural elements of the game stand out that much more. “There are things that you cannot see but actually exist and can be very important for us,” Kenji says. “We kept using this phrase during a lot of development: we want the player to experience the unordinary lurking within the ordinary. Those walks within Tokyo can feel like a normal day’s commute, but there can be unordinary things that we can’t see.” This even extends to the protagonists: the main character is a regular guy named Akito who is possessed by the spirit of a detective named KK.</p><p id=\"KgvWW7\">One thing the developers couldn’t predict, though, is how prescient a game about a city full of empty streets would be. Development on <em>Ghostwire</em> started before the pandemic, and its premise had already been locked down so that, as Kenji notes, “we weren’t creatively impacted” by it. But for players, it adds another layer of familiarity in a game full of monsters, ghosts, and urban legends. “Once the pandemic hit and we started seeing how [empty] the city actually became,” he says, “it did kind of make us feel that there will be parallels with real-life now.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EFlInCCNsAKA7oKWP2aQNWLyuXA=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23342321/Ghostwire_Tokyo_Dog.png",
  "description": "Like the regular Tokyo, only spookier.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}