{
  "title": "GitHub will require all code contributors to use two-factor authentication",
  "url": "https://www.theverge.com/2022/5/4/23056799/github-contributors-2fa-two-factor-authentication-2023",
  "date": "2022-05-04T15:10:10.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Q28bMU2CSqha7gb8pw_20uD9Szs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70831319/acastro_220504_STK121_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"22Q3LX\">GitHub, the code hosting platform used by tens of millions of software developers around the world, announced today that all users who upload code to the site will need to enable one or more forms of two-factor authentication (2FA) by the end of 2023 in order to continue using the platform.</p><p id=\"N3pf9p\">The new policy was announced Wednesday in a <a href=\"https://github.blog/2022-05-04-software-security-starts-with-the-developer-securing-developer-accounts-with-2fa\">blog post</a> by GitHub’s chief security officer (CSO) Mike Hanley, which highlighted the Microsoft-owned platform’s role in protecting the integrity of the software development process in the face of threats created by bad actors taking over developers’ accounts.</p><p id=\"xM4pm1\">“The software supply chain starts with the developer,” Hanley wrote. “Developer accounts are frequent targets for social engineering and account takeover, and protecting developers from these types of attacks is the first and most critical step toward securing the supply chain.”</p><p id=\"qmNNZG\">Even though multi-factor authentication provides <a href=\"https://www.okta.com/identity-101/why-mfa-is-everywhere/\">significant additional protection</a> to online accounts, GitHub’s internal research shows that only around 16.5 percent of active users (roughly one in six) currently enable the enhanced security measures on their accounts — a surprisingly low figure given that the platform’s user base should be aware of the risks of password-only protection. </p><div class=\"c-float-right\"><aside id=\"frLMzA\"><q>“The software supply chain starts with the developer”</q></aside></div><p id=\"drgT7V\">By steering these users towards a higher minimum standard of account protection, GitHub hopes to boost the overall security of the software development community as a whole, Hanley told <em>The Verge</em>.</p><p id=\"9zCVDg\">“GitHub is in a unique position here, just by virtue of the vast majority of open source and creator communities living on GitHub.com, that we can have a significant positive impact on the security of the overall ecosystem by raising the bar from a security hygiene perspective,” Hanley said. “We feel like it’s really one of the best ecosystem-wide benefits that we can provide, and we’re committed to making sure that we work through any of the challenges or obstacles to making sure that there’s successful adoption.”</p><p id=\"32m5Bl\">GitHub has already established a precedent for the mandatory use of 2FA with a smaller subset of platform users, having trialled it with contributors to popular JavaScript libraries distributed through the package management software NPM. Since widely used NPM packages can be downloaded millions of times per week, they make a very attractive target for malware gangs. In some cases, hackers compromised NPM contributor accounts and used them to <a href=\"https://therecord.media/malware-found-in-npm-package-with-millions-of-weekly-downloads/\">publish software updates that installed password stealers and crypto miners</a>.</p><div class=\"c-float-left\"><aside id=\"bseAVV\"><q> “We feel like it’s really one of the best ecosystem-wide benefits that we can provide”</q></aside></div><p id=\"ZlKuey\">In response, GitHub <a href=\"https://github.blog/2021-12-07-enrolling-npm-publishers-enhanced-login-verification-two-factor-authentication-enforcement/\">made two-factor authentication mandatory</a> for the maintainers of the 100 most popular NPM packages as of February 2022. The company plans to extend the same requirements to contributors to the top 500 packages by the end of May. </p><p id=\"MfMWI2\">Insights from this smaller trial will be used to smooth out the process of rolling out 2FA across the platform, Hanley said. “I think we have a great benefit of the fact that we’ve already done this now on NPM,” he said. “We have learned a lot from that experience, in terms of feedback we’ve gotten from developers and creator communities that we’ve talked to, and we had a very active dialog about what good [practice] looks like with them.”</p><p id=\"Ne4uxD\">Broadly speaking, this means setting a long lead time for making the use of 2FA mandatory site-wide, and designing a range of onboarding flows to nudge users towards adoption well before the 2024 deadline, Hanley said.</p><p id=\"uOtTUk\">Securing open-source software is still a pressing concern for the software industry, particularly after last year’s <a href=\"https://www.theverge.com/2021/12/10/22828303/log4j-library-vulnerability-log4shell-zero-day-exploit\">log4j vulnerability</a>. But while GitHub’s new policy will mitigate against some threats, systemic challenges remain: many open source software projects are still maintained by unpaid volunteers, and closing the funding gap has been seen as a <a href=\"https://stackoverflow.blog/2021/01/07/open-source-has-a-funding-problem/\">major problem for the tech industry</a> as a whole.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hPHtGchKzGX-0jtyCC9g6p7EFm0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437369/acastro_220504_STK121_0001.jpg",
  "description": "Developers will have until the end of 2023 to comply",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}