{
  "title": "Give me a bigger iPhone SE",
  "url": "https://www.theverge.com/2022/3/10/22967827/apple-iphone-se-bigger-smartphone",
  "date": "2022-03-10T18:42:54.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/iM1byEHdYGovE32ccZlsGQjDZdI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70604895/vpavic_042020_3980_0037.0.jpg\" />        <figcaption>Image: The Verge</figcaption>    </figure>  <p id=\"tqZAxW\">It’s hard to be too disappointed by the iPhone SE. It’s cute, has great specs for the price, and <a href=\"https://www.theverge.com/2022/3/8/22959072/iphone-se-3-price-screen-specs-features-release-date-a15-bionic-5g\">now has 5G</a>. It, along with the <a href=\"https://www.theverge.com/22684421/apple-iphone-13-mini-review\">iPhone 13 Mini</a>, fills that small phone niche for people with tiny hands. But as a big phone convert, I’m cheesed that the SE only comes in one size.</p><p id=\"eQniuN\">A cheaper smartphone with a big screen isn’t a novel idea. There are plenty of them out there — but not if you’re on iOS. Right now, if iPhone users want a bigger-than-standard display, they have to turn their wallets inside out for the iPhone 13 Pro Max. If you get the cheapest configuration possible, you’re looking at dropping $1,099. </p><p id=\"IOpR09\">When it came time to upgrade my phone last year, I hemmed and hawed between the 6.1-inch iPhone 12 and the 6.7-inch 12 Pro Max. I was on the <a href=\"https://www.theverge.com/2018/9/18/17871816/apple-iphone-xs-max-review-camera-processor-battery-price\">iPhone XS Max</a> and got used to its comfortable 6.5-inch screen. I didn’t <em>need</em> all the bells and whistles that come with the Pro models. I’d have loved to save a couple of hundred buckaroos. But I also didn’t want to downgrade to a smaller screen. I’d gone big, and there was absolutely no going back. Am I salty that it cost me extra? Extremely. </p><p id=\"Zemhjy\">I first joined Team Big Phone with the XS Max. My iPhone 7 had died, and like many people, I was afraid of the rise of the phablet. I worried whether it’d fit in my pockets and if I’d be able to use it one-handed. That changed the second I booted up my shiny new phone. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MGIfy4ONUBX_t2k5JUOOLKHONtM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13315987/akrales_181019_3014_0307.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The iPhone XR is proof that there’s an appetite for bigger budget phones.</em></figcaption>  </figure><p id=\"sDBjdf\">I’ve been cursed with both severe astigmatism and nearsightedness. The last time I got my prescription updated, my eye doctor hung her head and said, “Well, sometimes you have to settle for good enough.” I frequently use my phone’s camera to zoom in on signs I can’t read. Switching to a big phone made it so much easier to do everything modern life required of me. Enlarging the font size on my phone no longer looked comical. Not only that, but it was also easier for me to shoot off emails, watch YouTube videos, destroy my brain on Twitter, and read books. I went from giving myself headaches and wrinkles from squinting to the bliss of <em>not having to do that</em>. The fact that I got better battery life was just icing on the cake.</p><p id=\"V7XrQv\">I haven’t missed using my phone one-handed. Partly because I have huge hands, but also because two-handed phone use is superior any time you’re not hanging onto a subway strap. During the work-from-home era, that’s pretty much all the time. The 12 Pro Max fits easily into my back jean pocket. Plus, the fashion industry’s insidious scheme to make women’s pockets ridiculously tiny has ensured I’m always carrying a purse anyway. </p><p id=\"839038\">Unlike some of my colleagues here at <em>The Verge</em>, I don’t need the best OLED display or the fanciest cameras on my phone. (I only take pictures of my pets anyway.) All I want is a big honking screen that doesn’t look like complete garbage and good battery life. I’m not thrilled that I have to pay a premium to get that. </p><div class=\"c-float-right\"><aside id=\"J7plnv\"><q>A major reason why the iPhone SE is so popular is that it’s cheap</q></aside></div><p id=\"mbrRlb\">A major reason why the iPhone SE is so popular is that it’s cheap (even with the $30 hike in price for 5G). If you had a 6.5 or even a 6.7-inch iPhone SE that cost $500-$600, I guarantee you that’d sell like hotcakes. You only have to look as far as the <a href=\"https://9to5mac.com/2020/02/25/iphone-xr-2019-best-seller/\">iPhone XR’s stellar sales</a> to know there’s an appetite for a larger budget iPhone. True, I could’ve just opted for the iPhone 11, but I don’t want a standard-sized phone. I want the <em>biggest </em>screen I can get.</p><p id=\"7rNuQA\">And there isn’t a good reason why Apple hasn’t done this. With the SE, it repurposed the iPhone 8’s bones. It’s within Apple’s power to do the same with, say, the XS Max or the 11 Pro Max. I doubt it’s because Apple’s wary of fragmenting its lineup further. It had no problem introducing <em>four</em> iPhone 12 and iPhone 13 models to choose from. Why not take a chance by making two SEs? </p><p id=\"4clYX5\">Sure, I could switch to Android. But I’m weak and I’ve seen how my friends treat green bubbles. No, thank you. Small phone lovers have a choice between the Mini and the SE. I would <em>also</em> like to have a cheaper alternative to the Pro Max.  </p><p id=\"0YVhNi\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/A5YLya_5S4oa84rX0uZojccJGOI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19916261/vpavic_042020_3980_0037.jpg",
  "description": "Why is the iPhone SE for small phone fans only?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}