{
  "title": "Global science project links Android phones with satellites to improve weather forecasts",
  "url": "https://www.theverge.com/2022/3/26/22992890/camaliot-storm-forecast-gps-satellite-tracking-citizen-science",
  "date": "2022-03-26T13:25:00.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"Doppler Radar Truck\" src=\"https://cdn.vox-cdn.com/thumbor/2RsVXs-do9cLxteGkuKHouUybmc=/0x0:4752x3168/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70674982/174824948.0.jpg\" />    </figure>  <p id=\"H2dAnQ\">Collecting satellite data for research is a group effort thanks to this app developed for Android users. <a href=\"https://www.camaliot.org/\">Camaliot</a> is a campaign funded by the European Space Agency, and its first project focuses on making smartphone owners around the world part of a project that can help improve weather forecasts by using your phone’s GPS receiver. </p><p id=\"94SrWQ\">The <a href=\"https://play.google.com/store/apps/details?id=com.iiasa.camaliot\">Camaliot app</a> works on devices running <a href=\"https://www.theverge.com/2016/8/22/12578946/android-7-nougat-review-nexus\">Android version 7.0</a> or later that support satellite navigation. The way satellite navigation works, phones or other receivers look for signals from a network of satellites that maintain a fixed orbit. The satellites send messages with the time and their location, and once it’s received, the phones note how long each message took to arrive, then use that data to figure out where on Earth they are. </p><div class=\"c-float-right\"><aside id=\"TSe3v4\"><q>Android’s support for raw GNSS data recording is key to tracking changes in the ionosphere</q></aside></div><p id=\"9z9V3x\">Researchers think that they can use satellite signals to get more information about the atmosphere. For example, the amount of water vapor in the atmosphere can affect how a satellite signal travels through the air to something like a phone. </p><p id=\"arHEcg\">The app gathers information to track signal strength, the distance between the satellite and the phone being used, and the satellite’s carrier phase, <a href=\"https://www.camaliot.org/en/faq/\">according to Camaliot’s FAQs</a>. With enough data collected from around the world, researchers can<strong> </strong>theoretically combine that with existing weather readings to measure long-term water vapor trends.<strong> They hope to</strong> use that data to inform weather forecasting models with machine learning. They can also track changes in Earth’s ionosphere — the part of the atmosphere near space. Creating better ionospheric forecasts could be relevant in <a href=\"https://www.swpc.noaa.gov/impacts/space-weather-and-gps-systems\">tracking space weather</a> and could eventually make Global Navigation Satellite Systems (GNSS) more accurate by accounting for events like geomagnetic storms.</p><p id=\"Pfl1Vp\">Camaliot could eventually expand to include more attempts at collecting data on a massive scale using sensors present in “Internet of Things” connected home devices.<strong> </strong>“We took inspiration from the famous SETI@Home initiative, where home laptops help seek out signs of extraterrestrial life.” Vicente Navarro, an ESA navigation engineer, <a href=\"https://www.esa.int/Applications/Navigation/Turn_your_phone_into_a_space_monitoring_tool\">said in a press release</a>. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4QjOT01n8xVRUCg8RPD4-gAwD_Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23341150/Screen_Shot_2022_03_23_at_5.35.44_PM.png\">      <cite>Image: Camaliot</cite>      <figcaption>App users can compare their measurements to other Android users </figcaption>  </figure><p id=\"JNLMj3\">The project aims to gather information from all over the world — and from several different satellite constellations.<strong> </strong>There are several different Global Navigation Satellite Systems (GNSS) constellations like the US Global Positioning System (GPS), Russia’s GLONASS, China’s <a href=\"https://www.theverge.com/2011/12/27/2663364/china-beidou-positioning-system-GPS-operational\">Beidou</a>, or the <a href=\"https://www.theverge.com/2011/10/24/2510077/europe-launches-first-galileo-satellites-into-orbit\">EU’s Galileo</a>. Japan and India also operate smaller regional constellations. An <a href=\"https://www.theverge.com/2018/11/15/18097154/fcc-ajit-pai-gps-location-accuracy-galileo\">FCC order in 2018</a> allowed more devices to use GPS and Galileo signals together for increased location accuracy.</p><p id=\"ixlhTn\">While older Android phones can participate in this project, the Camaliot project <a href=\"https://docs.google.com/spreadsheets/d/1z6Yt9c4cyev1PB6VWEkbZtJGfoxAQ5UJnHyP24sFwlk/edit#gid=0\">lists more than 50 newer models</a> with dual-frequency receivers, which can simultaneously pull two GNSS signals with different satellite frequencies. Phones confirmed to contain dual-frequency receivers include the Google Pixel 4a, Samsung Galaxy S21, the Galaxy S21 Ultra — mostly those with high-end Qualcomm Snapdragon 5G chipsets. </p><p id=\"tw8cKt\">Navarro says that “the combination of Galileo dual-band smartphone receivers and Android’s support for raw GNSS data recording” work together to increase the possibility of how much data can be collected solely from people using their smartphones. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hCKv_QKSKnOvfBcPmVJIGUCmm3s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342007/Screen_Shot_2022_03_23_at_6.53.16_PM.png\">      <cite>Image: Camaliot</cite>      <figcaption>Camaliot is available only for Android users</figcaption>  </figure></div><p id=\"tKCgeE\">The use of at-home tech from outside participants for scientific exploration continues to grow as everyday devices include more processing power and better sensing capability. Besides the famous SETI project and similar attempts like <a href=\"https://www.theverge.com/2020/3/2/21161131/folding-home-volunteers-researchers-coronavirus\">Folding@Home,</a> other methods have included <a href=\"https://www.theverge.com/2018/3/16/17129586/nasa-cloud-observation-challenge-ceres-instruments\">NASA asking the public to use their phones to take photos of clouds</a> or <a href=\"https://www.theverge.com/2019/4/15/18308044/nasa-app-point-smartphone-trees-picture-height-satellite-why\">trees</a>, and science apps like iNaturalist documenting animal behavior <a href=\"https://www.theverge.com/2017/8/18/16168198/solar-eclipse-2017-plant-animal-behavior-life-inaturalist-science-app\">during a solar eclipse</a>, or <a href=\"https://www.theverge.com/2014/6/9/5793256/tag-this-species-how-smartphones-became-ecology-newest-tool\">tracking different animal species</a>. </p><h2 id=\"OUWD8z\">How to use Camaliot</h2><p id=\"QRmFIn\">Here’s how you can begin using the Camaliot app on your Android phone after <a href=\"https://play.google.com/store/apps/details?id=com.iiasa.camaliot\">downloading it from Google Play</a>: </p><ol><li id=\"qcuR2e\">Select “start logging” and place your phone in an area with a clear sky view to begin logging the data</li><li id=\"MOcOV9\">Once you have measured to your liking, select “stop logging”</li><li id=\"Ain2xm\">Then, upload your session to the server and repeat the process over time to collect more data. You can also delete your locally-stored log files at this step.</li></ol><p id=\"pG0Y6G\">In addition to being able to view your own measurements against others accumulated over time, you can also see a leaderboard showing logging sessions done by other participants. Eventually, the information collected for the study will be available in a separate portal.</p><p id=\"drTNir\">For registered users, their password, username, email address, and number of measurements will be stored in Camaliot’s database, but they won’t be used in post-study publications and products, according to <a href=\"https://www.camaliot.org/en/privacy/\">Camaliot’s privacy policy</a>. Specifically, Camaliot says that the need for extensive personal data is for scientific purposes and environmental monitoring and that its need for processing data is “necessary for the performance of a task carried out in the public interest, namely for the conduction of this scientific study.”</p><p id=\"DRBYoW\">Registered participants will also be entered into a pool for a chance to win prizes such as a dual-frequency Android phone and Amazon vouchers. The campaign will be active until June 30th. </p><div id=\"aDRIzJ\"><div ><iframe src=\"https://www.youtube.com/embed/rYJDW35R9jE?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/mFqQz-g4WZEdwI2rwPuGUbzrWj8=/0x593:4752x3081/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23345693/174824948.jpg",
  "description": "Camaliot gathers GPS data to help predict weather globally.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}