{
  "title": "Glorious GMMK Pro review: easy mode for DIY keyboards",
  "url": "https://www.theverge.com/23010455/glorious-gmmk-pro-mechanical-keyboard-review",
  "date": "2022-04-06T15:00:00.000Z",
  "author": "Alice Newcome-Beill",
  "content": "  <p>A sturdy DIY keyboard with a lot of potential</p> <p class=\"p--has-dropcap p-large-text\" id=\"KgIpkD\">When Glorious’ GMMK Pro was announced a little over a year and a half ago, there was quite a bit of excitement among keyboard enthusiasts. Here was a custom and sleek-looking 75 percent keyboard that made it easy for newcomers to jump into the hobby by providing direct access to all the various parts needed to build it. Those parts could all be ordered from the same company and assembling them required no particular skill (and no soldering). Plus, it came with an undeniably cool rotary knob — a design trait that’s been copied widely since. </p><p id=\"Wl2GZC\">Since then, the GMMK Pro has been succeeded by competitors like the Keychron Q1, which doesn’t quite have the same DIY vibe but offers similar features and designs for a lower cost. Now that we’re a little over a year past the hype cycle, we figured it was a good time to check in on the GMMK Pro and see how it holds up.</p><div id=\"PxsaF1\"><div data-anthem-component=\"scorecard:11128660\"></div></div><p id=\"L4zuzW\">The main appeal of the GMMK Pro — a DIY experience without the DIY headaches — remains the same. While it is possible to build a custom keyboard that mirrors the look and feel of the GMMK Pro, this can require a significant amount of research. You’ll also potentially have to go through multiple vendors to assemble all the necessary components. Glorious, in contrast, allows you to order everything for the GMMK Pro from the same page, all of which is guaranteed to fit together properly. </p><p id=\"YQwxmV\">The amount of choice you have when putting together a custom keyboard can be intimidating, but Glorious and the GMMK Pro are doing a passable job at introducing the uninitiated to the DIY market, warts and all. Glorious makes the process of going about building your own keyboard far less frustrating by allowing you to order all your parts from a single vendor. Obtaining all the necessary components — from the base board itself, which comes with the chassis, PCB, and an aluminum plate, to key switches, keycaps, alternative plate materials, coiled cables, and more — is a streamlined process. You can also pay additional fees to knock out grunt work like lubing switches. (This process also happens to accentuate how absurdly expensive this hobby can be.)</p><p id=\"PBympE\">The particular model I have here is relatively standard, with Kailh Speed Silver switches, a matte black chassis, black PBT shine-through keycaps, and an additional USB-C aviator cable that came in at just under $300 before shipping. However, by using the configurator on the Glorious website, you can just as easily spend upwards of $600 if you pull out all the stops. But it’s also worth noting that you can go as low as $240 for a complete keyboard, or all the way down to $169.99 if you just want the board itself without any caps or switches.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZvZDD4H8i-KTSVZUkU7ysa3XDxY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345964/anbeill_220322_5106_0007.jpg\">      <figcaption><em>That’s one good-looking keyboard.</em></figcaption>  </figure></div><p id=\"4qEOCh\">An important aspect to consider when looking at the GMMK Pro is that, while you pick out the individual components, the keyboard itself doesn’t come assembled. You’re instead shipped the chassis, switches, and keycaps separately and put everything together yourself. While this could be seen as a drawback, having everything laid out in front of you before putting it all together allows you to install aftermarket mods like dampening materials, switch pads, or stabilizers without having to break anything down. And, thanks to the hot-swap PCB, which lets you plug in switches without needing to solder them, getting everything up and running can be accomplished in the span of about 20 minutes. Doing so also provides some spectacular insight into the process for anyone looking to get into the hobby.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fdyHPP59HMx4rSsamtNjjzrLMbE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345967/anbeill_220322_5106_0017.jpg\">      <figcaption><em>The GMMK Pro comes packaged with a switch and keycap puller, but the ones pictured here are sold separately.</em></figcaption>  </figure><p id=\"U39Qqh\">Once you have it all assembled, first impressions of this keyboard are that it looks good. Even with an all-black chassis and accessories, I have to admire its incredibly clean aesthetic. The body of the keyboard doesn’t have any branding on it, save for the underside, which has “Glorious” milled into the base. The GMMK Pro features RGB lighting but it’s applied tastefully. In addition to the per-key lighting on the PCB, the chassis has a pair of light strips that run along the side. There are a wide variety of preset lighting effects (including the ability to make the side lights flash red when you’ve enabled Caps Lock), but sadly, applying multiple themes to a single set of keys isn’t possible.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mwaxNFoTiToXnL4XW4oUaYGMKdg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345966/anbeill_220322_5106_0012.jpg\">      <figcaption><em>Who makes this keyboard again?</em></figcaption>  </figure><p id=\"em0quU\">The overall look of the keyboard, with its sharp angular edges, is top-notch and obnoxiously good-looking, making everything around it look better — kind of like those impossibly beautiful workstation aesthetic photos that exist only on Instagram.</p><p id=\"Yp53at\">The body of the GMMK Pro is remarkably heavy for a keyboard, even without switches or keycaps. This is largely in part to its metal frame and distinct lack of plastic componentry. It’s nice to have a keyboard that won’t slide around your desk and feels like it could outlast time itself. But, weighing in at 3.3 pounds for just the chassis with nothing else in it, this is by far the heaviest keyboard I’ve ever used. This makes the chassis particularly resistant to any type of flexing or wobble. However, one interesting omission from the chassis is any feet to angle the keyboard. This isn’t a massive issue since the chassis angles upward at a slight angle. But there isn’t any way to change that without using something to prop the keyboard up.</p><p id=\"sXEAac\">The 75 percent layout is also something I’m fond of, and as someone that almost exclusively uses full-size keyboards, that’s saying something. The layout retains the directional arrows, function row, and five additional keys that, by default, are used for navigation. This overall layout is an excellent compromise between form and function.</p><p id=\"PuHs5F\">The overall typing experience of my Kailh Speed Silver and PBT keycaps build was quite good. I was surprised by how well everything fit together, resulting in a light and rattle-free touch-typing experience that’s made all the more impressive considering the GMMK Pro isn’t pre-assembled. While I wouldn’t say that it’s the best feeling keyboard I’ve used out of the box, the GMMK Pro is definitely up there.</p><p id=\"kVFh0e\">The chassis of the GMMK Pro comes equipped with sound-dampening foam, and the stabilizers are pre-lubed with some heavy-duty grease. This improves the acoustics of the keyboard. But whatever they use on the space bar stabilizers gives them a surprising amount of resistance, and the key can sometimes be slow to return to its normal state after being pressed. The acoustics without any additional modifications were solid, although the sound leans more toward the clacky side. (With this much dampening included I was expecting something a little more muted.) The sound when bottoming out my keystrokes wasn’t irritating or dissatisfying but was also a bit more hollow than expected. </p><div class=\"c-float-right c-float-hang\"><div id=\"x4Ebcs\"><div data-anthem-component=\"aside:11129970\"></div></div></div><p id=\"ZspMP8\">The screw-in stabilizers that come equipped with the PCB are fine but not the absolute best. Anyone looking for aftermarket options might run into some challenges as the plate has very tight tolerances and some stabilizers might not fit. Glorious also advertises the GMMK Pro as having a gasket mounted design, which is intended to provide some flex to the keys for a softer typing experience. But once it’s all assembled, everything fits together so tightly that there’s virtually no flex whatsoever. </p><p id=\"MRqWYP\">When the GMMK Pro was first announced, it was one of the first boards to include a rotary knob in its design, which has become one of the hot trends in mechanical keyboards since. By default, this is used to control the volume on your PC and play / pause media when it’s pressed but can be reprogrammed to virtually any function. The side of the knob is grippy but not rough, and the top is smooth but with a matte finish. The knob rotates in steps and has a satisfying click when pushed in. Unsurprisingly, Glorious sells optional knobs in various colors if the default black isn’t your style.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/l4k4id1kC03DgTjZdMlV3yOknAY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345963/anbeill_220322_5106_0004.jpg\">      <figcaption><em>Jokes aside, it’s a really good knob.</em></figcaption>  </figure></div><p id=\"huacgo\">The Glorious software (only for Windows, sorry Mac users) used for changing lighting and programming macros is stable and intuitive, but you came to the wrong house if you wanted a keyboard with more complex RGB patterns. This is a little disappointing, but the GMMK Pro isn’t specifically geared toward the audience that finds that aspect particularly important. In fact, Glorious only offers two sets of shine-through keycaps but nine sets of keycaps that are either solid colors or gradients.</p><p id=\"8afdej\">Besides reprogramming keys and setting up Macros, the Glorious software uses a layering system that allows you to quickly swap between keyboard layouts by pressing or holding a specific key. This system is handy but a far cry from the more intuitive layering systems found in the software for the Dygma Raise or even Razer’s Hypershift functionality. Otherwise, the software is basic but functional and doesn’t tax system resources when not in use. While I only tested the GMMK Pro with the first-party glorious software, anyone that wants a more granular experience can use tools like QMK or VIA to create and flash their own custom firmware onto the board.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ntiLmYHAF-oNicYOW5S9X69HTlM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23368624/Glorious_Core_1.png\">      <figcaption><em>The Glorious Core Software is simple and functional.</em></figcaption>  </figure><p id=\"bWD1Er\">So, is this keyboard worth the price Glorious puts on it? That depends. The GMMK Pro is a well-built keyboard with an impressive amount of customization options and offers a unique service for anyone that’s willing to pay a premium for a bespoke product. </p><p id=\"HUalLX\">But ultimately, the majority of what you’re paying for is the convenience as well as the time and effort of putting it all together. Unless you’re in love with the specific aesthetic of this keyboard, you might be better served by purchasing a less expensive keyboard with similar features, or just building your own keyboard from scratch.</p><div class=\"c-float-right c-float-hang\"><div id=\"UQiVzf\"><div data-anthem-component=\"aside:11129976\"></div></div></div><p id=\"79o4tS\">If you’re interested in building your own keyboard from scratch, which is something I definitely recommend, you can do that without spending nearly as much. In the time since the GMMK Pro launched, hot-swap PCBs have become much more common, allowing you to put together your own keyboard easier than ever. By shopping around on sites like KBDfans.com, Banggood, or AliExpress and waiting a few weeks for shipping, you can get all the parts you need for around $150 or less. The keyboard used by my colleague Antonio G. Di Benedetto at <em>The Verge</em> only set him back $135. While doing it yourself isn’t as streamlined as ordering all of your parts from the same place, you’ll save a considerable amount of cash in the long run. </p><p id=\"szCQcy\">However, if you’re interested in a 75 percent keyboard that’s ready to use out of the box but equally receptive to after-market upgrades, you might want to check out the Keychron Q1, which can be purchased fully assembled for just a few dollars more than the GMMK Pro’s barebone kit.</p><p class=\"c-end-para\" id=\"4xu7Kk\">The GMMK Pro is a good keyboard, maybe even great in some respects. But a year-plus since its release, it’s been surpassed by the shockingly fast-moving mechanical keyboard market. Glorious gets credit for providing a system to make it easy to jump into a custom board, without the usual headaches and long waits. But, ultimately, it feels like the GMMK Pro is marketed toward an audience that loves the DIY aesthetic but would rather pay someone else to do it for them.</p><p id=\"5BGUXO\"><em>Photography by Alice Newcome-Beill / The Verge</em></p><p id=\"5kozOu\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0ePPhtIMWjUXlg1v3Lhnkfahrgc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23345962/anbeill_220322_5106_0002.jpg",
  "description": "A high-quality heavyweight with a premium price.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}