{
  "title": "GM and Honda expanding their partnership to develop ‘millions’ of affordable EVs in 2027",
  "url": "https://www.theverge.com/2022/4/5/23011201/gm-honda-ev-partnership-millions-affordable-2027",
  "date": "2022-04-05T11:42:38.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TqHOJMAMVQAAqfGeIbHCsUlAHaw=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70711417/gm_honda_16x9.0.jpg\" />    </figure>  <p id=\"9PLSYK\">General Motors and Honda announced an expansion of their two-year-old partnership to include “a series of affordable electric vehicles” built on GM’s <a href=\"https://www.theverge.com/2020/3/4/21164513/gm-ev-platform-architecture-battery-ultium-tesla\">flexible EV platform with its Ultium-branded improved battery packs</a>. The companies say they will begin production of “millions” of these affordable EVs, including crossover SUVs, in 2027.</p><p id=\"I5iA10\">The automakers first announced two years ago they would work together to develop two Honda-branded electric vehicles built atop GM’s flexible Ultium powertrain. The Japanese company would design the exteriors and interiors of the new EVs, while the platform will be engineered to support Honda’s specifications. And they will be manufactured at GM’s North American plants, with sales expected to begin in the 2024 model year.</p><div class=\"c-float-right\"><aside id=\"CBpVyt\"><q>GM and Honda have a preexisting relationship when it comes to EVs</q></aside></div><p id=\"FiXHx3\">“GM and Honda will share our best technology, design and manufacturing strategies to deliver affordable and desirable EVs on a global scale, including our key markets in North America, South America and China,” said Mary Barra, GM chair and CEO, in a statement. </p><p id=\"1P50Or\">GM and Honda have a preexisting relationship when it comes to EVs. The Japanese automaker is <a href=\"https://www.theverge.com/2018/10/3/17931786/gm-cruise-honda-investment-self-driving-car\">an investor in GM’s majority-owned autonomous vehicle subsidiary Cruise</a> ($2 billion over 12 years). As part of the deal, Cruise and Honda are collaborating on a purpose-built electric autonomous vehicle, a pre-production version of which, the <a href=\"https://www.theverge.com/2020/1/21/21075977/cruise-driverless-car-gm-no-steering-wheel-pedals-ev-exclusive-first-look\">Cruise Origin</a>, was first unveiled late last year. Also, GM is <a href=\"https://www.theverge.com/2020/1/27/21083356/gm-cruise-ev-av-production-announcement-detroit-hamtramck-origin\">spending $2.2 billion to retrofit its Detroit-Hamtramck plant</a> for the production of autonomous and electric vehicles, where the new Honda EVs are likely to be built.</p><p id=\"JLZmo6\">GM and Honda aren’t the only automakers getting cozy with each other. <a href=\"https://www.theverge.com/2019/7/12/20690722/ford-vw-alliance-self-driving-argo-investment-valuation\">Ford and VW </a>are building a slate of EVs and AVs together. Car companies big and small are racing to build on Tesla’s success by mass-producing battery-powered SUVs, pickup trucks, and sedans. In tandem, many of the same companies are also testing self-driving cars, either as taxis to ferry passengers around cities or as delivery robots carrying groceries and other goods.</p><p id=\"IrHlIB\"><em>Developing...</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2viVLdi7vrgtAYSNoTu0W_0wVBs=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23368311/gm_honda_16x9.jpg",
  "description": "The companies have been working together for two years.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}