{
  "title": "GM denies reports about Spark EV battery replacements, blames supply disruption",
  "url": "https://www.theverge.com/2022/4/28/23046944/gm-denies-spark-ev-battery-replacement-reports",
  "date": "2022-04-28T19:26:06.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"2012 LA Auto Show Features Automotive Innovation\" src=\"https://cdn.vox-cdn.com/thumbor/OMfI2kaKERpMhREqWFBel2Zdccs=/0x14:3000x2014/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70806422/157097453.0.jpg\" />        <figcaption><em>Despite supply problems, it seems the Spark EV shall endure.</em> | Photo by Kevork Djansezian / Getty Images</figcaption>    </figure>  <p id=\"c9yG0e\">General Motors has denied reports that it’s no longer providing battery replacements for the all-electric version of the Chevy Spark, according to Kevin Kelly, a spokesperson for the company. Kelly told <em>The Verge</em> in an email that the company is “currently experiencing a temporary disruption in the supply of new Spark EV packs,” but that it “remains committed to providing replacement packs to Spark EV owners who need them in the future.”</p><p id=\"KrnayK\">Last week, a report from <a href=\"https://www.ev-resource.com/blog/gm-kills-support-for-the-spark-ev-no-battery-replacement-available\"><em>EV-Resource</em></a> cited an anonymous GM district executive as saying that the company was “no longer going to supply [the Spark EV’s] battery.” While GM has denied that’s the case, <em>EV-Resource</em>’s report also says that the company ran out of battery packs, which squares with Kelly’s statement.</p><div class=\"c-float-right\"><aside id=\"OtNL88\"><q>GM promises to “work with owners until we get the supply issues resolved”</q></aside></div><p id=\"OcL7mj\">When the original reports hit, there were concerns about warranty replacements. While the oldest Spark EVs, released in 2013 and 2014, are likely outside of their eight-year warranties, models from 2015 and 2016 (the year GM stopped producing the Spark EV) could very well need replacement battery packs. In his statement, Kelly said that GM will “work with owners” who need replacements until the company resolves its supply issues.</p><p id=\"EaSqK9\">Battery supply has been a hot-button topic for GM recently. As my co-worker Emma Roth <a href=\"https://www.theverge.com/2022/4/24/23039665/gm-chevy-spark-ev-no-longer-provide-battery-replacements\">wrote last week</a>, the company had to deal with <a href=\"https://www.theverge.com/2021/12/2/22814089/gm-chevy-bolt-recall-shutdown-sales-2022\">delivering replacement battery packs</a> for over 150,000 Bolt EVs and recently <a href=\"https://www.theverge.com/2022/4/7/23013855/chevy-bolt-ev-euv-production-resumes-battery-fix-recall\">started producing the car again</a> after a halt <a href=\"https://www.theverge.com/2021/7/14/22577757/gm-chevy-bolt-fires-recall-fix-software-update-not-working\">due to fires</a>. </p><p id=\"9lh6t8\">While there aren’t a lot of people who own Spark EVs — GM only sold around <a href=\"https://electrek.co/2017/02/01/gm-officially-kills-chevy-spark-ev-compliance-car-in-favor-of-bolt-ev/\">7,400 of them</a> — it’s good to hear that anyone who still has one may not have to give up on the vehicle if its battery starts to fail. Longevity has often been brought up as a concern with EVs, and it would’ve been a pretty bad look if GM had stopped providing essential components for cars that were less than a decade old.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZdWyTd4TQQpbwioZwgdFkUrHs3k=/0x229:3000x1800/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23423233/157097453.jpg",
  "description": "GM is promising to take care of owners.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}