{
  "title": "GM is selling its stake in embattled EV startup Lordstown Motors",
  "url": "https://www.theverge.com/2022/3/1/22957094/gm-sell-stake-lordstown-motors-ev-factory-foxconn",
  "date": "2022-03-01T22:38:30.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"Lordstown Motors Headquarters Ahead Of Earnings Figures\" src=\"https://cdn.vox-cdn.com/thumbor/mWLV4CtPRe_AEnikozGazjjrUTg=/0x2:4000x2669/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70567201/1232963600.0.jpg\" />    </figure>  <p id=\"8jspqk\">General Motors is selling its stake in Lordstown Motors, an electric vehicle startup that has struggled to produce its first vehicle. GM owned 7.5 million shares, or less than 5 percent of the company, with an initial equity value of $75 million. The news was first reported by the <a href=\"https://www.freep.com/story/money/cars/general-motors/2022/03/01/gm-lordstown-motors-plant-ohio/6972977001/?gnt-cfr=1\"><em>Detroit Free Press</em></a>.</p><p id=\"aBwa2J\">The sale was made during the fourth quarter of 2021 following an undisclosed lock-up period. James Cain, a spokesperson for GM, confirmed the sale, while a spokesperson for Lordstown declined to comment. </p><p id=\"6ClsCr\">The stock sale signals the beginning of the end of GM’s relationship with Lordstown. The company <a href=\"https://www.theverge.com/2020/3/11/21173309/lordstown-motors-steve-burns-interview-ceo-gm-ohio-factory-trump\">traces its origins to GM’s announcement in 2018</a> that it would be closing down its Lordstown factory. Then-President Donald Trump assailed GM over the decision, leading to the automaker’s decision to sell the plant to a struggling electric truck startup called Workhorse.</p><div class=\"c-float-right\"><aside id=\"c1S6Nj\"><q>The stock sale signals the beginning of the end of GM’s relationship with Lordstown</q></aside></div><p id=\"VfgJiQ\">Instead, Workhorse’s founder and former CEO, Steve Burns, started a new company called Lordstown Motors with the plan to build electric pickup trucks. GM invested $75 million in the company, $25 million of which was cash, and another $50 million in the form of “plant assets,” “plant permits,” and operating costs at the factory. </p><p id=\"v4RWpa\">Since buying it, Lordstown Motors has put about $240 million worth of work into getting the factory ready to build its electric pickup truck, the Endurance. It went <a href=\"https://www.theverge.com/2020/8/3/21352433/gm-lordstown-motors-electric-truck-startup-public-merger-spac\">public by merging with a special acquisition company</a>, or SPAC, last summer  — and has since run into problem after problem. </p><p id=\"E4YLqS\">The CEO was forced out <a href=\"https://www.theverge.com/2021/6/14/22532976/lordstown-motors-ceo-steve-burns-resign-short-seller-investigation\">after he was caught lying about truck preorders</a>. Initial production goals were slashed. And federal investigators <a href=\"https://www.theverge.com/2021/7/2/22560891/lordstown-motors-sdny-doj-investigation\">launched probes</a>, as the company revealed it only has enough money to survive through mid-2022.</p><p id=\"ijETVs\">With its financial struggles mounting, Lordstown announced last September that it would <a href=\"https://www.theverge.com/2021/9/30/22702322/lordstown-motors-foxconn-ohio-electric-vehicles\">sell the former GM factory to iPhone assembler Foxconn</a> for $230 million. The company later said it would <a href=\"https://www.theverge.com/2021/8/11/22620787/lordstown-motors-q2-2021-earnings-gm-factory-production-manufacturing\">loan out space</a> from Foxconn while it searched for contract manufacturers to help with the production of the Endurance. </p><p id=\"dFodA2\">The news comes after Lordstown’s executives told investors this week they were looking to <a href=\"https://www.bloomberg.com/news/articles/2022-02-28/lordstown-slumps-after-ceo-warns-of-hurdles-in-foxconn-deal?sref=ExbtjcSG\">raise $250 million</a> in order to build 500 Endurance electric trucks. They also cast doubt on the deal with Foxconn, disclosing that the factory deal was not as far along as anticipated. </p><p id=\"tdLZXZ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OjdQjHzIMS9wtxfT0ndO4v-epiE=/0x288:4000x2382/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23281126/1232963600.jpg",
  "description": "Lordstown traces it origins to the closing of a GM factory.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}