{
  "title": "GM reportedly stops providing battery pack replacements for the Chevy Spark EV",
  "url": "https://www.theverge.com/2022/4/24/23039665/gm-chevy-spark-ev-no-longer-provide-battery-replacements",
  "date": "2022-04-24T14:43:34.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"2012 LA Auto Show Features Automotive Innovation\" src=\"https://cdn.vox-cdn.com/thumbor/EH8TzEWHHg8AU00v6LcqEvmSWt4=/2x0:2998x1997/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70787004/157097457.0.jpg\" />        <figcaption><em>The Chevy Spark EV ran from 2013 to 2016.</em> | Photo by Kevork Djansezian/Getty Images</figcaption>    </figure>  <p id=\"DwR9Yb\">General Motors will reportedly no longer provide battery replacements for the all-electric version of the Chevy Spark, according to a report from <a href=\"https://www.ev-resource.com/blog/gm-kills-support-for-the-spark-ev-no-battery-replacement-available\"><em>EV-Resource</em></a> (via <a href=\"https://insideevs.com/news/581522/gm-chevrolet-spark-ev-battery-replacement-unavailable/\"><em>InsideEVs</em></a>). The Chevy Spark electric vehicle (EV) was first released in 2013, and GM continued to make new models until 2016. </p><p id=\"nRxcFY\">A GM district executive confirmed to<em> EV-Resource</em> that the company is “no longer going to supply that [the Spark EV’s] battery.” GM’s inventory of Spark EV battery packs has reportedly run out as well, and the company doesn’t plan on making any more. <em>The Verge</em> reached out to GM with a request for comment but didn’t immediately hear back. </p><div class=\"c-float-right\"><aside id=\"CTFj57\"><q>It’s unclear if GM will continue to honor the Spark EV’s battery pack warranty</q></aside></div><p id=\"aug3eb\">With the oldest model of the Spark EV reaching almost 10 years old, vehicle owners may find themselves without a working car if their battery pack fails. GM offers an eight-year / 100,000-mile <a href=\"https://media.gm.com/media/us/en/chevrolet/vehicles/spark-ev/2015.html\">warranty</a> specifically for the battery pack in its Spark EVs and <a href=\"https://www.chevrolet.com/electric/living-electric/complete-care\">other electric vehicles</a>, which means the warranty has already run out (or is very close to running out) for Spark EVs released in 2013 and 2014. It’s unclear if GM will continue to honor its warranty and somehow replace the battery pack in broken-down Sparks, or as <em>EV-Resource</em> points out, if GM will offer to buy back the vehicle instead of replacing the battery.</p><p id=\"ZME0la\">Spark EV owners might not have the best of luck finding an aftermarket battery pack either. <em>EV-Resource</em> notes that there really isn’t a market for Spark EV batteries when compared to other EVs, considering companies might not find value in providing parts for a car that’s on the more inexpensive side (the base 2016 model sold at an MSRP of <a href=\"https://media.chevrolet.com/media/us/en/chevrolet/vehicles/spark-ev/2016.html\">less than $26,000</a>). Plus, GM only managed to <a href=\"https://electrek.co/2017/02/01/gm-officially-kills-chevy-spark-ev-compliance-car-in-favor-of-bolt-ev/\">sell around 7,400 Spark EVs</a> — mainly in California, Oregon, and Maryland — before ending its three-year run.</p><p id=\"4TDFfn\">As GM works toward <a href=\"https://www.theverge.com/2021/12/2/22814089/gm-chevy-bolt-recall-shutdown-sales-2022\">making and replacing battery packs in over 140,000 electric Chevy Bolts</a> that were recalled last year due to fire risks, perhaps GM just doesn’t have the bandwidth to create battery pack replacements for the Spark EV. GM only <a href=\"https://www.theverge.com/2022/4/7/23013855/chevy-bolt-ev-euv-production-resumes-battery-fix-recall\">resumed manufacturing Bolt EVs in early April</a> following a <a href=\"https://www.theverge.com/2021/8/30/22648922/gm-chevy-bolt-ev-production-halt-recall-fire-risk\">production freeze</a> lasting several months, and also recently announced its plans to <a href=\"https://www.caranddriver.com/news/a38961880/chevy-spark-discontinued/\">discontinue the non-electric version of the Chevy Spark</a> sometime this year.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/arOe6cy1XC_KZyi7bRgxQgr1Y1c=/0x214:3000x1785/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23412860/157097457.jpg",
  "description": "GM’s supply of Spark EV battery packs may have run out.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}