{
  "title": "GM shuts downs Marketplace, the app that let you buy gas and coffee from your car’s screen",
  "url": "https://www.theverge.com/2022/2/23/22946295/gm-marketplace-shut-down-app-screen-shopping-gas",
  "date": "2022-02-23T15:23:27.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/M0q5rK-dCwfxc_gqS6WsAMh_xDA=/217x0:3697x2320/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70540656/Marketplace_FBO_Hero_4.0.0.jpg\" />        <figcaption>GM</figcaption>    </figure>  <p id=\"LAEVhD\">General Motors is shutting down its in-car shopping app, <a href=\"https://www.theverge.com/2018/4/18/17248282/chevrolet-shell-in-car-payment-gas\">Marketplace</a>, which allowed customers to buy coffee, pay for gas, or make restaurant reservations from the infotainment screen of their vehicles. The service will be discontinued March 2022. (The news was <a href=\"https://www.cnbc.com/2022/02/18/gm-discontinues-once-promising-marketplace-app-that-allowed-you-to-shop-while-driving.html\">first reported by CNBC</a>.)</p><p id=\"1D4b61\">The app, which was <a href=\"https://www.theverge.com/2017/12/5/16735264/gm-marketplace-infotainment-commerce-shopping\">first introduced in 2017</a>, was part of GM’s mission to redesign the driving experience to include more smartphone-style features, as well as create new revenue streams through partnerships with third-party companies. When it was announcedhat, GM described Marketplace as “the automotive industry’s first commerce platform for on-demand reservations and purchases of goods and services.”</p><p id=\"HjdDzj\">GM said its plans to discontinue Marketplace were the result of Xevo, a connected car software supplier, exiting the business. But this doesn’t signal the end of GM’s attempts to make in-car shopping a thing: the automaker says it will likely roll out a new service in the near future. And vehicle owners can still buy things on their infotainment screens through third-party apps. </p><div class=\"c-float-right\"><aside id=\"CtjfTF\"><q>GM said its plans to discontinue Marketplace were the result of Xevo, a connected car software supplier, exiting the business</q></aside></div><p id=\"EVXrYA\">“Based on our learnings, as well as evolving customer needs and preferences, GM is building on and expanding its existing voice, apps, and map capabilities to better integrate in-vehicle commerce opportunities,” a spokesperson said. </p><p id=\"fn2gcO\">The decision to shut down Marketplace represents the downside of the connected car future that automakers typically avoid talking about. While they like to tout the benefits of over-the-air software updates and safety benefits like vehicle-to-everything communication, they don’t address how quickly these features can be taken away if they aren’t growing customers or justifying their costs through revenue. </p><p id=\"oDkj82\">Marketplace’s baffling user experience probably didn’t do it any favors. Buying gas at a Shell station, for example, required customers to first register with Shell, then receive a PIN number that would need to be inputed at the pump to authorize the fuel purchase. There were multiple levels of authentication even for the most benign purchase. It was far removed from the coveted “frictionless” experience for which most tech companies aim. </p><p id=\"EtaTjG\"><a href=\"https://www.theverge.com/2017/11/29/16715526/intel-warner-brothers-self-driving-car-batman-vr-ar\">Brands are salivating</a> over the idea of buying up space on the screens inside connected cars. And with autonomous driving on the horizon, the idea of passengers as captive audiences is growing increasingly probable — and profitable. <a href=\"https://www.theverge.com/ces/2017/1/4/14173324/ford-amazon-echo-alexa-integration-ces-2017\">Ford</a> and <a href=\"https://www.theverge.com/2017/9/27/16372566/bmw-alexa-integration-2018\">BMW</a> are integrating Amazon’s Alexa into their latest models for shopping and smart home control, and <a href=\"http://www.businessinsider.com/r-vws-audi-steps-up-collaboration-with-chinese-tech-groups-2016-9\">Audi</a> is working with Baidu, Tencent, Alibaba, and other Chinese tech giants to build integrated services within its autonomous cars.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/U5CfvqrJACMgiDJAifLqnx89-8o=/0x136:3913x2185/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23263729/Marketplace_FBO_Hero_4.0.jpg",
  "description": "The marketplace is shut down.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}