{
  "title": "GM teases an electric Chevy Blazer SS for more plug-in performance ",
  "url": "https://www.theverge.com/2022/3/9/22968852/gm-chevy-blazer-ev-ss-tease-image-electric",
  "date": "2022-03-09T16:03:28.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6BfX9ybGFUj7qxKnf3PpyXohjJo=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70599221/2024_Chevrolet_Blazer_EV_SS.0.jpg\" />        <figcaption>Image: General Motors</figcaption>    </figure>  <p id=\"UNSVse\">General Motors teased an electric Chevrolet Blazer SS, which will make its debut later this year. The Blazer EV will be the first electric vehicle from Chevy to feature a performance SS model. </p><p id=\"tkppHN\">There’s not much to go on here except an image of the charging port illuminated by a LED ring. An accompanying video shows the charging port closing in a pretty cool fashion. And then we see the SS badge on a hubcap, which tells us that this is going to be a high performance version of the Chevy Blazer. </p><div class=\"c-float-right\"><aside id=\"Lteivz\"><q>There’s not much to go on here except an image of the charging port </q></aside></div><p id=\"NyPCTf\">Chevy’s gas-powered SS variants feature V8 engines, dynamic handling capabilities, and adjustable suspensions. The electric Blazer SS will lack the former thanks to its electric battery and motor but is likely to keep the latter features. The SS lineup was known to suffer from poor gas mileage, which also won’t be a problem for this new EV. </p><div id=\"9fivSC\"><iframe src=\"https://players.brightcove.net/1050888044001/bNJ5EPvlNA_default/index.html?videoId=6300037194001\" allowfullscreen=\"\" frameborder=\"0\"></iframe></div><p id=\"LLLJBU\">Last year, GM announced that it would be releasing electric versions of the Chevy Equinox and Blazer SUVs. <a href=\"https://www.theverge.com/2022/1/5/22868410/gm-chevy-equinox-blazer-ev-announced-ces\">Teaser images were released during the 2022 Consumer Electronics Show</a>, with GM noting that the Equinox will retail for a suggested price of $30,000 in an effort to drive broader adoption of electric vehicles in the US.</p><p id=\"8jb4nq\">The Chevy Blazer is not the most beloved SUV on the market, so it’s interesting to see GM sweetening the pot a little. The arrival of the Equinox EV and Blazer EV would put Chevy at the forefront of GM’s $35 billion push to electrify its entire lineup by 2040. In addition, the company is producing the Chevy Bolt EV and EUV, the Hummer EV pickup and SUV, the GMC Sierra EV, and the Cadillac Lyriq and Celestiq.</p><p id=\"qOLUpC\">The electric Blazer SS will make its official debut later this year and will go on sale in spring 2023. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Chpi2ejr52z3pYyylXP-hTIQrTk=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23300880/2024_Chevrolet_Blazer_EV_SS.jpg",
  "description": "Going on sale in spring 2023.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}