{
  "title": "GM’s electric delivery van just set a world record — with me riding shotgun",
  "url": "https://www.theverge.com/2022/4/22/23036448/gm-brightdrop-electric-delivery-van-guiness-world-record",
  "date": "2022-04-22T10:15:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QVK_ev9RWQMfRylmOKfcYn4Yt00=/0x84:2000x1417/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70779700/GWR3.0.jpg\" />        <figcaption>BrightDrop</figcaption>    </figure>  <p>258.85 miles in the jump seat of one of the world’s first all-electric delivery vans</p> <p class=\"p--has-dropcap p-large-text\" id=\"wBemHm\">I’m in Baltimore, riding in the passenger seat of an electric delivery van — one of the first in the world, I think — when we pass a white Rivian R1T electric pickup truck. </p><p id=\"efWjKx\">In some respects, it’s like seeing a ghost. The buzzy EV company began manufacturing the R1T last year, and since then has only <a href=\"https://www.theverge.com/2022/3/10/22971092/rivian-electric-truck-deliveries-earnings-q4-2021\">delivered around 2,500 of them</a>. Rivian is also building electric delivery vans for Amazon <a href=\"https://www.theverge.com/2021/11/8/22765853/rivian-fleet-sales-amazon-exclusivity-van-r1t-r1s\">and other companies</a>, but it won’t say how many it has made so far.  </p><p id=\"bf2Ldd\">The van I’m riding in was made by BrightDrop, an electric delivery company that <a href=\"https://www.theverge.com/2021/1/12/22225394/gm-brightdrop-electric-delivery-ep1-ev600-ces-2021\">spun-out of General Motors last year</a>. The occasion is a world record that BrightDrop is attempting to set for “the longest distance traveled by an electric delivery van on a single charge.” I’m riding shotgun, if somewhat uncomfortably. Delivery van jump seats are not meant for long roadtrips, I’m now learning. My butt is asleep, but the Rivian sighting felt like a tiny wake-up call.  </p><div class=\"c-float-right c-float-hang\"><aside id=\"vaow0H\"><q>I don’t think the R1T driver noticed us as we passed, but nonetheless I imagine them giving us a thumbs up</q></aside></div><p id=\"k7Rmfq\">I don’t think the R1T driver noticed us as we passed, but nonetheless I imagine them giving us a thumbs up. Game recognizes game. </p><p id=\"86P3GF\">Currently, there is no record for longest electric delivery van journey on a single charge for the simple reason that there aren’t any electric delivery vans. There are some hybrid vehicles, and a few electric forklifts and what not, but the vast majority of the vans delivering your Amazon and FedEx and UPS packages are powered by dirty dinosaur sludge. A lot of companies have plans to make electric vans, but the actual number of real electric vans on the road today is miniscule. </p><p id=\"j2PlQo\">BrightDrop invited me along on the journey, and I’ve been stuck in my house for the better part of two years, so honestly, why the hell not. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EkwL1KeU_yWhwtOMe1o5Vv991P8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407619/GWR4.jpg\">      <cite>BrightDrop</cite>      <figcaption>BrightDrop is one of the few companies with electric vans in service. </figcaption>  </figure></div><p id=\"j9XzXP\">The day starts bright and early at 5:30AM at a FedEx vehicle depot in Midtown Manhattan, where a gaggle of employees are gathered around the van, dubbed the Zevo 600, making preparations for the trip. The van stands out from the other FedEx vehicles parked at the facility, with its round corners, large windshield, black trim, and a slightly shorter stance than its gas-powered equivalents. While the other vans all had their hoods open for engine inspections, the Zevo 600 simply has no hood to pop. (The battery, which is located in the floor of the van, powers two electric motors found in the front and rear axle.)</p><p id=\"y9kDqQ\">After recording the battery’s state of charge (98 percent) and the odometer (391 miles), the van is ready to get on the road. In the driver seat is Stephen Marlin, a client solutions account executive at BrightDrop. For today’s trip, Marlin was cosplaying as a FedEx driver, wearing the company’s recognizable black-and-purple uniform. He must look the part, because earlier in the morning, he got chased down by a New York City resident looking for his missing package. </p><p id=\"Snz3O9\">I don’t get to wear a FedEx uniform, and I cannot begin to tell you how much that disappoints me. </p><div class=\"c-float-left c-float-hang\"><aside id=\"jvyHRH\"><q>I don’t get to wear a FedEx uniform, and I cannot begin to tell you how much that disappoints me. </q></aside></div><p id=\"QH5brw\">At 7:01AM, we hit the Lincoln Tunnel. Our cargo in the back is several boxes of organic cleaning supplies destined for the Mom’s Organic grocery store in NE Washington, DC. To be sure, this is not an actual delivery run; BrightDrop has orchestrated it for the purposes of setting the record. </p><p id=\"S9VwF3\">The van is being followed by four chase cars, none of which are electric, with photographers and a camera crew capturing every step of the way. One of the camera guys (they’re all men)  hangs out the open door of a minivan and shoots video of the Zevo 600 at 70mph. He does not die, and I am amazed. </p><p id=\"9U1qrb\">Since the cargo area is mostly empty, there’s nothing to absorb all the noise. The Zevo 600, like most EVs, is <em>itself</em> quiet. But unlike most EVs on the road today, the delivery van has a steel-lined cargo space that rattles like an empty tin can every time we hit a new bump. </p><p id=\"nsmFHI\">As he drives, Marlin receives instructions from the chase cars via walkie-talkie about when to change lanes and when to speed up or slow down. I resist the urge to grab the walkie-talkie and start yelling “Breaker breaker one nine, what’s your twenty good buddy?” </p><p id=\"xqWwBo\">The cab is spacious. My jump seat doesn’t recline, but I can cross my legs to offset the pressure on my back. Marlin and I make small talk about <em>Mad Max </em>movies and what to do with too many bananas. The Zevo 600 is speed-governed to 65 mph, so we’re passed by all the other delivery vans and trucks on the road. It’s slightly chilly in the van; Marlin wants to keep the heat off in order to maximize the battery’s range. At one point, I briefly doze off. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kwf6hEuDJIc2wC1WP_LXpLaa8QA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407624/GWR2.jpg\">      <cite>BrightDrop</cite>      <figcaption>The heat is kept off to maximize battery range. </figcaption>  </figure></div><p id=\"hOdhvc\">The Zevo 600 (previously known as the EV600) is the larger of BrightDrop’s two electric vans, with 600 cubic feet of cargo space, 250 miles of range, and a gross vehicle weight of less than 10,000 pounds. In layman’s terms, it’s a normal sized delivery van. </p><p id=\"6EQFcO\">More notably, the van’s body rests on a new EV powertrain and battery pack called Ultium that GM says will power its new generation of electric vehicles, like <a href=\"https://www.theverge.com/2020/10/20/21525290/hummer-ev-electric-truck-gmc-price-specs-range\">the Hummer EV</a>. This <a href=\"https://www.theverge.com/2020/3/4/21164513/gm-ev-platform-architecture-battery-ultium-tesla\">Ultium platform</a> is crucial to GM’s massive $35 billion investment in electric and autonomous vehicles over the next few years. It’s a flexible architecture that can extend or retract, depending on the vehicle size. And strangely enough, one of the first vehicles to roll out on the Ultium platform is a relatively nondescript delivery van. </p><div class=\"c-float-right c-float-hang\"><aside id=\"IUWEeW\"><q>Ultium is crucial to GM’s massive $35 billion investment in electric and autonomous vehicles</q></aside></div><p id=\"i17vqG\">At least, that’s what I originally thought before setting off on this trip. But I was surprised by how many passers-by were intrigued by the van, giving it a second look, even requesting to check out the interior and cargo area. Even with the FedEx logo emblazoned on the side, the Zevo 600 grabbed way more attention than I would have imagined. </p><p id=\"ApDO2M\">Electric delivery vans aren’t BrightDrop’s only products. It’s essentially an e-commerce delivery ecosystem that includes software, access to charging station providers, and even an electric propulsion–assisted pallet that can be used in the warehouse or on the street for delivery and package pickup. I got to test out this pallet, dubbed the EP1, in Brooklyn a few weeks back, and found it very similar to an electric bike or scooter in terms of its controls and handling. I was not allowed to take it home with me. </p><p id=\"tHnWNN\">In addition to FedEx, <a href=\"https://www.theverge.com/2021/12/17/22839470/fedex-gm-brightdrop-electric-delivery-van-ev600\">BrightDrop also has deals with Walmart and Verizon</a>. Walmart reserved 5,000 EVs, while FedEx has said it would reserve 2,500. BrightDrop has only delivered 5 vehicles to FedEx so far, and will deliver more as they come off the assembly line. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3nloAF_M53ZNg9m0AKMnIZ3gNIw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407627/GWR1.jpg\">      <cite>BrightDrop</cite>      <figcaption>The Zevo 600 is rated to get 250 miles on a single charge. </figcaption>  </figure></div><p id=\"fnWlZW\">When I wake, we’re at our first destination, which is Allentown, NJ, an adorable little burg a few miles outside of Trenton. We pass houses with signs in their front yards angrily denouncing all the loud truck traffic in their community. I wonder if they would be more amenable if those trucks were zero-emission like BrightDrop’s Zevo 600. </p><p id=\"3ZnvbZ\">After taking photos of the odometer and battery meter, we’re off to our next stop: Philadelphia. We arrive at Independence Hall at 9:20AM with 219 miles left on the battery. We circle Independence Hall more times than I can count, as the crew shoots video and takes drone shots. I give the same sheepish grin to the security guard outside the Hall each time we pass. </p><div class=\"c-float-right c-float-hang\"><aside id=\"3o3neW\"><q>I take another cat nap, and we’re suddenly in Baltimore</q></aside></div><p id=\"vy6mbE\">I take another cat nap, and we’re suddenly in Baltimore, doing another series of loops around Federal Hill Park. There are 134 miles left on the battery. That’s when I see the ghostly Rivian. I imagine a future in which an Amazon delivery van (made by Rivian) passes a FedEx van (made by BrightDrop), both silently in service to a world reshaped by e-commerce. </p><p id=\"ndt8Co\">The pandemic has fueled a boom in home delivery. Experts predict that the number of delivery vehicles in the largest 100 cities around the world will increase by 36 percent over the next decade. More trucks equals more tailpipe pollution, at least 36 percent, or 6 million tons, <a href=\"https://www.scientificamerican.com/article/delivery-vehicles-increasingly-choke-cities-with-pollution/\">according to the World Economic Forum</a>. </p><p id=\"q47XLr\">On the way to our final stop in Washington, I get a call from Mitch Jackson, chief sustainability officer at FedEx. FedEx has been on the hunt for a reliable EV supplier for a long time, he tells me. The company had a deal with erstwhile EV startup Chanje to buy 1,000 electric delivery vans, but was left in the lurch when Chanje failed to make good on its promise. (<a href=\"https://www.theverge.com/22822775/chanje-fdg-electric-delivery-vans-investigation-amazon\">FedEx is now suing Chanje</a>, which ran out of money and officially shut down last year.) BrightDrop, as a wholly owned subsidiary of GM, is more to FedEx’s liking as a partner. </p><p id=\"2YjgAz\">Jackson notes that what we’re doing right now — driving an electric van from New York City to DC to deliver one package — is not FedEx’s standard practices. The delivery company would use a semi truck to deliver many thousands of packages to one of its distribution hubs, and then use the electric van for the last-mile delivery. “But it’s indicative that the distance that this vehicle can travel will meet the vast needs of our route structure on a day-in and day-out basis,” he adds. </p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/K2jxb-pOfwFoRq5ZnaVO5vTEFWs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407636/IMG_4651.jpeg\">      <cite>Andrew J. Hawkins / The Verge</cite>      <figcaption>Real FedEx worker William Jones checks out the Zevo 600. </figcaption>  </figure></div><p id=\"dqSJmG\">At 1:57PM, we arrive at Mom’s Organic in Washington, DC. There are 98 miles remaining in the battery, meaning the Zevo 600 will have enough range to make the last leg to the FedEx facility in the district before needing to charge. The film crew captures footage of Marlin “delivering” the packages to a smiling Mom’s employee.</p><p id=\"y5SKr0\">The total distance for the trip is 258.85 miles — eight more miles than its rating. I sign a witness statement as an impartial observer for BrightDrop’s submission to the Guinness World Records. A spokesperson later informs me that the submission was accepted. Quick turnaround! </p><p id=\"OxAszE\">A real FedEx employee wanders over to where the van is parked, assuming Marlin is co-worker. His name is William Jones and he’s been driving for the company for 30 years. After getting a brief primer, he checks out Zevo 600’s cab and the cargo area, whistling his approval. He’s seen enough. He’s ready to go electric. </p><p id=\"sbxhA2\">“In three years I can retire,” he tells me. “Hopefully I’ll get the chance to drive one of these before then.” </p><p class=\"c-end-para\" id=\"NzDpJl\">The BrightDrop crew is ecstatic. They film his every move, and then have him sign a waiver so they can use his image in their sizzle reel. Jones shrugs. Why the hell not. He’s retiring soon anyway. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gItsF8kgh8beAIWc8wQfHDG9iJs=/0x227:2000x1274/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23407609/GWR3.jpg",
  "description": "It was the longest EV delivery trip on a single charge.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}