{
  "title": "Go read this report about the virtual doctors at an NFT clinic who can’t legally give medical advice",
  "url": "https://www.theverge.com/2022/4/26/23042736/go-read-this-nft-clinic-medical-advice-metadocs-metaverse",
  "date": "2022-04-26T18:30:17.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pO87rWCpn6cSYpbZclGEi7gxMIw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70796012/acastro_210329_1777_nft_0005.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"dc3SyF\">If combining NFTs with the medical industry doesn’t sound the most logical, this report from <a href=\"https://www.buzzfeednews.com/article/emilybakerwhite/metadocs-nfts-tiktok-instagram-celebrity-doctors\"><em>BuzzFeed News</em></a> will likely confirm your skepticism. An NFT project called MetaDocs assigns doctors / influencers, like Dr. Pimple Popper, to (somewhat unsightly) cartoon personifications of themselves, which users can then purchase to gain access to one-on-one conversations, question-and-answer sessions, or DMs. </p><p id=\"iPJhgF\">But despite MetaDocs’ goal of <a href=\"http://web.archive.org/web/20220422200940/https://twitter.com/metadocsnft/status/1514748153186070544?s=20&amp;t=AVeTi95qoXjUZakjOxhCMw\">cutting the “red tape”</a> that comes with gaining access to doctors, the MetaDocs themselves aren’t legally able to give medical advice to NFT holders. As <em>BuzzFeed</em> points out, MetaDocs doesn’t have a license to practice telemedicine, barring its doctors from giving medical advice, writing prescriptions, or virtually diagnosing patients. </p><div class=\"c-float-right\"><aside id=\"EYeuUy\"><q>“We’re hesitant to refer to anybody as a patient”</q></aside></div><p id=\"pSY1Kx\">“At this point, we’re hesitant to refer to anybody as a patient,” Dr. Dustin Portela, a MetaDocs physician and dermatologist, said in a statement to <em>BuzzFeed</em>.</p><p id=\"VnQCuU\">This disconnect is made even more obvious with the price tag of one of these NFTs. According to <em>BuzzFeed</em>, MetaDocs hasn’t determined a final price but kicked around a cost of 0.2ETH, or $570, in a recent whitepaper — a potentially higher amount than what you’d pay seeing a real general physician without insurance (depending on your location and the office, of course).</p><p id=\"m71BPK\">However, MetaDocs founder Dr. Sina Joorabachi told <em>BuzzFeed</em> that the value of the MetaDocs NFTs isn’t linked to medical care: “Our deliverable is connecting people with these doctors for a value of whatever they want to talk about or connect with.” The blurred lines between conversation about medicine and medical advice may have caused some doctors to jump ship — <em>BuzzFeed</em> reports that nine doctors, including two that say they never consented to have their names included on the project, have since been removed from MetaDocs’ documentation.</p><p id=\"1FsQHh\">In the future, MetaDocs hopes to revolutionize medical care, and that includes examining haptic suit-wearing patients in virtual reality. That may seem far off, but not to MetaDocs. If you want to get a more in-depth look at all this craziness, definitely go read <a href=\"https://www.buzzfeednews.com/article/emilybakerwhite/metadocs-nfts-tiktok-instagram-celebrity-doctors\"><em>BuzzFeed News</em></a>’ report.</p><p id=\"85SGNR\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hkt5_bHCATOcBtBq43MlRH8FpRg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22413650/acastro_210329_1777_nft_0005.jpg",
  "description": "MetaDocs isn’t licensed to practice telemedicine.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}