{
  "title": "Go read this dystopian story about patients whose bionic eyes went obsolete",
  "url": "https://www.theverge.com/2022/2/16/22937198/bionic-eye-company-defunct-ieee-spectrum-go-read-this",
  "date": "2022-02-16T20:41:55.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"“Argus ii - Bionic Eye” retina implant surgery\" src=\"https://cdn.vox-cdn.com/thumbor/denbmAyv67OqCENtwDtH8NbCDp0=/0x63:2835x1953/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70518103/480490356.0.jpg\" />        <figcaption>A patient with the Argus II.  | Photo by Dunyagoz Hospital/Anadolu Agency/Getty Images</figcaption>    </figure>  <p id=\"PqtNCO\">More than 350 blind people around the world have implants in their eyes made by the company <a href=\"https://secondsight.com/\">Second Sight Medical Products</a>, which could help partially restore aspects of sight. But the company abandoned the technology a few years ago when it was teetering on the verge of bankruptcy, according to <a href=\"https://spectrum.ieee.org/bionic-eye-obsolete\">a new investigation from <em>IEEE Spectrum</em></a>. Now, if something goes wrong with the implants, users are left stranded. </p><p id=\"Httwgf\">“It is fantastic technology and a lousy company,” Ross Doerr, a Second Sight patient, told <em>IEEE Spectrum</em>. </p><p id=\"LFegYd\">Second Sight’s implants, the Argus I and the Argus II, don’t restore normal vision; people see things in shades of gray that disappear when they move their heads. And results vary from person to person. Some users of the implants, which rolled out a decade ago, have struggled to make out even basic shapes. Others are now able to do things like ski.</p><p id=\"9PrCrp\">People who received the implants were told that there would be future updates and improvements to the technology, like software updates to boost the number of pixels in the system and thermal imaging, <em>IEEE Spectrum </em>reported this week. But those improvements never materialized. In 2019, the company said it was planning to phase out its retinal implant technology. In 2020, the CEO left the company, and most employees were laid off. Second Sight told <em>IEEE Spectrum </em>that the layoffs meant it “was unable to continue the previous level of support and communication for Argus II centers and users.”</p><p id=\"2OMzfW\">Now, Second Sight is planning a merger with a biopharmaceutical company to work on drug delivery. Argus patients still don’t know what that means for them, and fear being stuck with dead hardware that can’t be fixed.  </p><p id=\"Ws1wrM\">Read the story <a href=\"https://spectrum.ieee.org/bionic-eye-obsolete\">here</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Y32rNIxkBa4eRVzSwR776ZOxl_o=/0x266:2835x1750/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23250233/480490356.jpg",
  "description": "Users are left stranded.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}