{
  "title": "Go read former Tesla employees’ experiences with racism in their own words",
  "url": "https://www.theverge.com/2022/3/25/22996954/go-read-interview-former-tesla-employees-racism-discrimination-retaliation",
  "date": "2022-03-26T00:52:09.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ztSGEgfimTpe9AlHiwBzbMgeCIE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70673849/acastro_180524_1777_tesla_0003.0.jpg\" />        <figcaption><em>Tesla has been sued by civil rights watchdogs for racial segregation at its Fremont, California factory.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"RD4rAk\">The <em>Los Angeles Times</em> has a great piece that interviews three former Tesla employees about their experiences with racism, discrimination, and retaliation at the company, which <a href=\"https://www.latimes.com/business/story/2022-03-25/black-tesla-employees-fremont-plant-racism-california-lawsuit\">is well worth a read</a>. The story acts as a way to contextualize <a href=\"https://www.theverge.com/2022/2/10/22926851/tesla-sued-california-racially-segregated-workplace-dfeh\">a lawsuit that the automaker is currently facing</a>, where the California Department of Fair Employment and Housing alleges that the company has a “racially segregated workplace.” </p><p id=\"ecLdLM\">While the experiences described in the lawsuit and in the <em>Times</em>’ story are similar (and equally disturbing), being able to read actual interviews helps connect names, faces, and individual experiences to the situation at Tesla’s facility in California. </p><div class=\"c-float-right\"><aside id=\"V4GWQV\"><q>“They were waiting for me to make a mistake”</q></aside></div><p id=\"rokNQa\">The workers have unique stories, but they share disturbingly similar through-lines. Two employees describe being “blacklisted” or “blackballed” after reporting racist behavior to supervisors or HR. One of them describes being given a job usually done by two people — another recalls asking a supervisor “‘You’re telling me to do a four-man job by myself?’” She says the supervisor told her to do it, or she would be fired. All of them report constantly being called the n-word — sometimes by managers, and often with the word “lazy” attached.</p><p id=\"Kg5xxI\">One of the employees says that going to HR did put a stop to the harassment from coworkers — but that for months afterwards, she wasn’t given a performance review, raise, or promotion. She was later fired for an accident where she hit a sprinkler with a forklift. Another worker, she said, hit five sprinklers and got to keep his job. “They were waiting for me to make a mistake,” she said. </p><p id=\"ZEe8H1\">The other workers echoed similar sentiments. One said Tesla “began looking for a reason to fire him” after he reported his racist treatment to HR. The other said she felt like she was forced out of the company after being “badgered by supervisors.” Here’s an example she gave:</p><blockquote><p id=\"4s8da5\">HR emailed her that she was “under investigation for supposedly threatening someone,” she said. Baffled, she asked whom she had threatened, and was told it was someone on the day shift.</p><p id=\"XBveKr\">But she had worked the night shift.</p><p id=\"Is93zD\">“People on the day shift told them, ‘We don’t know her,’” Romby said. “It was just a bunch of B.S.”</p></blockquote><div class=\"c-float-right\"><aside id=\"8XOIUz\"><q>“Instead of attacking the victims of racism at their facility, Tesla should focus on taking remedial actions designed to end the racist conduct.”</q></aside></div><p id=\"9B3acx\">The company’s lawyers (it <a href=\"https://electrek.co/2021/04/28/elon-musk-no-new-tesla-pr-department-manipulating-public-opinion/\">doesn’t have a PR department anymore</a>) largely denied the allegations to the <em>Times</em>, and listed off reasons why it treated the employees the way it did. But this isn’t the first time Tesla has faced scrutiny for having a hostile workplace. Last year, a jury in California ruled that the company <a href=\"https://www.theverge.com/2021/10/5/22710279/tesla-racism-fremont-plant-137-million-judgement-owen-diaz\">would have to pay a former worker $137 million</a> in damages, after supervisors failed to do anything about his reports that he was harassed with racist graffiti and constant use of racial slurs. </p><p id=\"x1c4wF\">The company also had to <a href=\"https://www.theverge.com/2021/8/5/22611725/tesla-paid-1-million-black-former-employee-racist-slur\">pay another former employee $1 million</a> after he won an arbitration suit — he reported that his supervisor called him the n-word, and retaliated again him after he confronted him for using the slur. Other employees have <a href=\"https://www.cnbc.com/2017/11/14/tesla-class-action-lawsuit-alleges-racism-unsafe-factory-conditions.html\">accused the company of having a racist culture</a>. (Again, Tesla denied many of the allegations from these cases.)</p><p id=\"7I2AEv\">But while reading about court cases can certainly be enlightening, it’s important to also see what employees have to say about the situations they were in for themselves. It provides more context, as well as insight we might not otherwise get into how discrimination can emotionally affect people, and their lives going forward. That’s why the <em>Los Angeles Times</em> piece is important, and <a href=\"https://www.latimes.com/business/story/2022-03-25/black-tesla-employees-fremont-plant-racism-california-lawsuit\">well worth a read</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wEmS6qeSqPoyWcc1aVYbTgsWqPY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11423501/acastro_180524_1777_tesla_0003.jpg",
  "description": "Putting names and faces to conditions described in lawsuits.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}