{
  "title": "Go read this report on why Jony Ive quit Apple",
  "url": "https://www.theverge.com/2022/5/2/23053226/why-jony-ive-quit-apple-report",
  "date": "2022-05-02T14:29:19.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/B4455sGdZBEuBwjoJs3fxZnlKrE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70822203/GettyImages_1032852842.5.jpg\" />        <figcaption><em>Apple Chief Design Officer Jonathan Ive (L) poses for pictures with CEO Tim Cook during a launch event on September 12, 2018, in Cupertino, California</em> | Photo by Noah Berger / AFP via Getty Images</figcaption>    </figure>  <p id=\"mAghjg\">When Apple <a href=\"https://www.theverge.com/2014/9/9/6125873/apple-watch-smartwatch-announced\">announced the Apple Watch in 2014</a>, it did so at De Anza in Cupertino, a few miles down the road from its then-headquarters on Infinite Loop. It’s sort of a sacred site for Apple, the place Steve Jobs debuted both the original Macintosh in 1984 and the iMac in 1998. And on the 30th anniversary of the Macintosh, for the first potentially game-changing product since the death of Steve Jobs, Apple — and Jony Ive, Apple’s chief designer and Jobs’ longtime collaborator — wanted to pull out all the stops.</p><p id=\"L6wFKa\">Well, not <em>all </em>the stops, it turns out. And the fight over the event logistics and the $25 million price tag Ive asked for to pull it off was reportedly one of the moments that led Ive to eventually leave the company. That’s according to <a href=\"https://www.nytimes.com/2022/05/01/technology/jony-ive-apple-design.html\">a new report in T<em>he New York Times</em></a>, an excerpt from reporter Tripp Mickle’s new book, <em>After Steve: How Apple Became a Trillion-Dollar Company and Lost its Soul</em>. Ive was eager to portray the Watch like a fashion accessory, Mickle writes, and wanted to introduce it with the pomp and circumstance to match.</p><p id=\"HtgLWV\">Ive eventually got his way but felt unsupported by the new regime at Apple. That was reportedly the beginning of the end. After years of reports that Ive was increasingly uninvolved in the company, he eventually left to found his own design firm, LoveFrom, in 2019. (For what it’s worth, Apple CEO Tim Cook has always rejected the idea that Ive was frustrated or unhappy, and Ive continues to work with Apple through LoveFrom.) </p><p id=\"BpbcvA\">The <em>Times</em> story also goes through some of <a href=\"https://www.theverge.com/2019/6/27/18761779/apple-jony-ive-leaving-best-product-videos-iphone-ipad-imac\">Ive’s legacy and impact at Apple</a>, from the colorful iMac that Ive helped make “joyful” to the relentlessly perfectionist atmosphere at the company that Jobs and Ive both encouraged and thrived under. Over time, as Apple shifted from being a product-driven, flat-hierarchy company to the ruthlessly optimized behemoth it is today, and particularly as it emphasized services more, Ive reportedly saw a company in which he mattered less and could do less. And with him gone, Mickle argues, Apple’s products have remained “largely as they were when Mr. Ive left.”</p><p id=\"1wHOV7\">In the case of the iPhone, iPad and Watch, that definitely seems true. But the Mac is another story: with Ive gone, Apple’s laptops and desktops have gotten vastly better thanks both to the M-series chips and the fact that Apple went <a href=\"https://www.theverge.com/22974998/apple-xmac-myth-midrange-mid-tower-mac-studio\">back to its PC roots</a>. Macs have ports again! And <a href=\"https://www.theverge.com/21569603/apple-macbook-air-m1-review-price-specs-features-arm-silicon\">keyboards that actually work</a>! Better Macs have made for <a href=\"https://www.theverge.com/2022/4/28/23046890/apple-q2-2022-earnings-iphone-mac\">better-selling Macs, too</a>. And of course, there are rumors and reports that Apple is close to launching its next big thing: AR glasses. So the death of Apple’s product chops may be somewhat exaggerated.</p><p id=\"uWtLiL\"><em>After Steve</em> comes out on Tuesday, and Mickle will be a guest on this Friday’s <em>Vergecast</em>. (<a href=\"mailto:vergecast@theverge.com\">Send us questions</a>!) The whole book is worth a read, and Ive’s story in particular is a good microcosm of how the company has changed — for better and for worse — in the post-Jobs era.</p><p id=\"jFEjJ6\"></p><p id=\"mEuvua\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Pj0Grr-SVJ7du9tD95LDmw2zLuc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432859/GettyImages_1032852842.jpg",
  "description": "It all started with a fight about a tent.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}