{
  "title": "Go read this Vanity Fair piece about Grimes and her secret baby with Elon Musk",
  "url": "https://www.theverge.com/2022/3/10/22971579/grimes-elon-musk-baby-vanity-fair-go-read-this",
  "date": "2022-03-10T22:45:26.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/0V0y5tTabQJsPMq_YmFPIsPvdF0=/9x0:3000x1994/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70606319/958397822.0.jpg\" />        <figcaption>Grimes and Elon in 2018 | Photo by Theo Wargo/Getty Images for Huffington Post</figcaption>    </figure>  <p id=\"k3WVr2\">Sometimes journalists get lucky and discover information while reporting a story that they did not expect to find — a document or report, maybe even evidence of prior misdeeds. But I can’t recall ever reading a feature where the reporter discovers a previously undisclosed baby, as <a href=\"https://www.vanityfair.com/style/2022/03/grimes-cover-story-on-music-and-mars\">Devin Gordon did in his <em>Vanity Fair</em> profile of the singer Grimes</a>, the former partner (<a href=\"https://twitter.com/Grimezsz/status/1501959073591296002\">she says</a> they have split again but remain friends) of Tesla and SpaceX CEO Elon Musk. The two welcomed their first child — <a href=\"https://www.theverge.com/tldr/2020/5/7/21251107/elon-musk-baby-name-x-ae-a-12-grimes-son-pronunciation\">a son who they gave an unusual name</a> — in May 2020. </p><p id=\"69dc6z\">But as far as the general public was aware, the couple only had the one child. Gordon soon discovers otherwise. As he’s interviewing Grimes in her new home, he thinks he hears crying but brushes it off. Eventually, it’s undeniable: there’s a baby somewhere in Grimes’ house, and she knows that he knows. So like a good reporter, he goes for it.</p><blockquote><p id=\"3ffimq\"> So I brace myself to ask the strangest question of my career: <em>Do you have another baby in your life, Grimes?</em></p></blockquote><p id=\"bF2tzA\">After at first trying to evade the question, she eventually admits, yes, the couple had a baby via surrogate in late 2021, named Exa Dark Sideræl Musk, nickname Y. </p><p id=\"Kd71yV\">Besides another secret child, we also learned the following: </p><ul><li id=\"oYPnm7\">Grimes thinks of her son — who she calls X — as Paul Atreides from <em>Dune</em> and herself as Paul’s mother, Jessica</li><li id=\"TbqyaO\">Musk casually mentioned to her not long ago that he plans to leave for Mars in 10 years</li><li id=\"UrxoA3\">She does not consider the description “manic pixie dream girl” to be an insult</li></ul><p id=\"VATSk9\">From secret babies to Musk’s apparent 10-year relocation plan, this entire piece is a wild ride that’s better read than recapped. So <a href=\"https://www.vanityfair.com/style/2022/03/grimes-cover-story-on-music-and-mars\">go read <em>Vanity Fair</em>’s cover story on Grimes</a> for a master class in the celebrity profile genre, then come back here so we can talk about it some more. </p><p id=\"L9jmIO\"></p><p id=\"DAH6ce\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ysOQr57cPoI9zUOXV8VZ4WL-_sg=/0x153:3000x1724/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23304941/958397822.jpg",
  "description": "The child, a girl, is named Exa Dark Sideræl.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}