{
  "title": "Go read this report about how researchers used Google Maps to track the invasion of Ukraine",
  "url": "https://www.theverge.com/2022/2/27/22953398/go-read-this-researchers-google-maps-russian-troops-ukraine-invasion",
  "date": "2022-02-27T16:24:57.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Pvmh65tYH_6P6rtbYmsa_FYTo6M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70556903/akrales_190515_3424_0008.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"tsjSPK\">This report from <a href=\"https://www.washingtonpost.com/technology/2022/02/25/google-maps-ukraine-invasion/\"><em>The Washington Post</em></a> details how a team of researchers used a combination of Google Maps and radar imagery to track the movement of Russian troops, tipping them off to an invasion of Ukraine before the general public got word of the situation.</p><div id=\"piOAsk\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">According <a href=\"https://twitter.com/googlemaps?ref_src=twsrc%5Etfw\">@googlemaps</a>, there is a \"traffic jam\" at 3:15 in the morning on the road from Belgorod, Russia to the Ukrainian border.  It starts *exactly* where we saw a Russian formation of armor and IFV/APCs show up yesterday.<br>Someone's on the move. <a href=\"https://t.co/BYyc5YZsWL\">pic.twitter.com/BYyc5YZsWL</a></p>— Dr. Jeffrey Lewis (@ArmsControlWonk) <a href=\"https://twitter.com/ArmsControlWonk/status/1496657816740036616?ref_src=twsrc%5Etfw\">February 24, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"PhkCAf\">When Dr. Jeffrey Lewis, a professor at California’s Middlebury Institute of International Studies, noticed particularly bad traffic at 3:15AM near the Ukrainian border, he knew it wasn’t your typical rush-hour pileup. Lewis and his students discovered the “jam” on February 23rd — just before the start of the Russian invasion. They were only compelled to check Google Maps after seeing Russian tanks and other military vehicles near the same location in a radar image taken by Earth observation group Capella Space.</p><div class=\"c-float-right\"><aside id=\"tgaXUR\"><q>“Today, you can open Google Maps and see people fleeing Kyiv”</q></aside></div><p id=\"afaLmm\">“In the old days, we would have relied on a reporter to show us what was happening on the ground,” Lewis told <em>The Post</em>. “And today, you can open Google Maps and see people fleeing Kyiv.”</p><p id=\"76YdvL\">Google Maps uses real-time data from smartphones to track traffic conditions. In a <a href=\"https://twitter.com/ArmsControlWonk/status/1496657816740036616?s=20&amp;t=IlR8GtiSWwuIlJVzJqMxOA\">thread on Twitter</a>, Lewis surmises that the heavy traffic Google logged likely wasn’t from Russian soldiers carrying their phones, and was instead captured from the phones of civilians stuck at roadblocks. After Russian troops started making their way into Ukraine, <em>The Post</em> notes that Google Maps showed road closures in Kharkiv, Ukraine’s second-largest city, along with suspended subway services throughout the city.</p><p id=\"Zg5IzY\"><em>The Post</em> says it’s unclear whether Google Maps is providing <a href=\"https://support.google.com/sosalerts/\">SOS alerts</a> — a notification that warns users in the vicinity of major crises — or the locations of bomb shelters to people in Ukraine. Google Maps does, however, show information about subway stations, some of which are being utilized as shelters. Damian Menscher, a security reliability engineer at Google points out <a href=\"https://twitter.com/menscher/status/1497407833431674882\">on Twitter</a> that Google Maps usage has spiked in Ukraine since the start of the Russian invasion.</p><p id=\"FcjbKG\">Google Maps seems to have become an unlikely tool — both for civilians and soldiers on the ground in Ukraine, as well as outsiders tracking the devastating situation — and <a href=\"https://www.washingtonpost.com/technology/2022/02/25/google-maps-ukraine-invasion/\"><em>The Washington Post</em>’s report</a> really highlights this. Along with the prevalence of social media, people in Ukraine are able to get their stories out to thousands, if not millions of people from around the globe, providing insight and information that outsiders would typically have access to by way of traditional news outlets.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PgE08Axq6L1Z_zxfNRcgkPo7_E0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16278797/akrales_190515_3424_0008.jpg",
  "description": "A \"traffic jam\" appeared on Maps just before the invasion.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}