{
  "title": "Go read this STAT investigation into the risk of elder abuse in psychedelic therapy",
  "url": "https://www.theverge.com/2022/4/21/23035342/stat-elder-abuse-psychedelics",
  "date": "2022-04-21T14:57:20.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nwH9m-KaHTmJkIGc1gqnxjUA0Lo=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70776080/acastro_170726_0008_v5.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"YAo0ak\">Older adults who turn to psychedelic therapies to treat psychiatric conditions like depression and PTSD are uniquely vulnerable to financial abuse, according to a <em>STAT </em><a href=\"https://www.statnews.com/2022/04/21/psychedelic-therapist-allegedly-took-millions-from-holocaust-survivor-highlighting-worries-about-elders-taking-hallucinogens/\">investigation</a>. The substances could make people feel more emotionally connected with care providers who deliver the drugs, making them susceptible to manipulation by bad actors.</p><p id=\"ihmG2a\">The story highlights a lawsuit brought against psychedelic therapist Vicky Dulai alleging that she took more than $4 million from Holocaust survivor George Sarlo, who had turned to psychedelics to treat depression and trauma. Dulai and Sarlo met in 2002, and according to the lawsuit, she gradually took over as his personal assistant and caregiver. She had access to his bank accounts and personal documents. In 2019, the lawsuit says she introduced Sarlo to ketamine as a “control mechanism.” </p><p id=\"Ak2Y6w\">Dulai denied the allegations, and the lawsuit was settled earlier this year. But Dulai is an important figure in the world of psychedelics — a board member of the Multidisciplinary Association for Psychedelic Studies (MAPS), which advocates for the use of psychedelics as medicine. The group had not done its own investigation of the allegations, and said that they were “unsubstantiated” in a statement to <em>STAT</em>. Dulai and the MAPS founder also filed an elder abuse complaint against Sarlo’s daughters in 2021, and they in turn got a temporary restraining order against Dulai. </p><p id=\"Nf15V3\">Regardless of the back-and-forth, the situation highlights the risks of introducing psychedelics in healthcare for a population already vulnerable to abuse. Psychedelic treatments are becoming more mainstream, and they’re being considered as a strategy for end-of-life care. With a rapidly <a href=\"https://www.un.org/en/development/desa/population/publications/pdf/ageing/WPA2017_Highlights.pdf\">aging population</a> around the world, this is an issue that will only become more relevant.</p><p id=\"HZtC0N\">“These are frail, at-risk older adults who are not as able to advocate for themselves,” Donovan Maust, a geriatric psychiatrist and health services researcher at the Michigan Medicine Department of Psychiatry, told <em>STAT</em>. “They’re absolutely at a power disadvantage.”</p><p id=\"ooQA58\">Read the full story <a href=\"https://www.statnews.com/2022/04/21/psychedelic-therapist-allegedly-took-millions-from-holocaust-survivor-highlighting-worries-about-elders-taking-hallucinogens/\">here</a>. </p><p id=\"kpi357\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7N_kEKU0V75bq0Np5tj5hqY6oQs=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8937005/acastro_170726_0008_v5.jpg",
  "description": "There are risks to using these drugs in a vulnerable group.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}