{
  "title": "Go read this exposé on how FAFSA got caught sending personal info to Facebook",
  "url": "https://www.theverge.com/2022/4/29/23048305/fafsa-facebook-department-of-education-us-student-financial-aid-meta-tracking-pixel",
  "date": "2022-04-29T14:27:52.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Hd0-AsC_sU7XKl6UYU7TzDBEnw8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70810149/acastro_180828_1777_facebook_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"swYL4L\">If you applied for financial aid through Free Application for Federal Student Aid (FAFSA) in the US in early 2022, there’s a very good chance some personal information was provided to a platform that’s completely irrelevant to the process: Facebook. </p><p id=\"1eZURB\"><a href=\"https://themarkup.org/pixel-hunt/2022/04/28/applied-for-student-aid-online-facebook-saw-you\">This report from <em>The Markup</em></a> exposed that, as early as January 2022, the US Department of Education sent data from website visitors to Facebook, potentially including information submitted on forms like first and last name, country, phone number, and email address, via the “Meta Pixel” <a href=\"https://www.theverge.com/2019/7/3/20681508/tracking-pixel-email-spying-superhuman-web-beacon-open-tracking-read-receipts-location\">tracking pixel</a> — even if the person didn’t have a Facebook account. <em>The Markup</em> also notes that this data collection began “even before the user logged in to studentaid.gov.” </p><div class=\"c-float-right\"><aside id=\"L8WwoM\"><q>It’s unknown how many students had their data sent to Facebook</q></aside></div><p id=\"Z8VTCU\">When asked about this tracking, a spokesperson for the Department of Education initially denied that it was taking place, despite <em>The Markup</em> finding code that clearly indicates otherwise. Federal Student Aid COO Richard Cordray then fessed up, telling the publication that the data gathering was “part of a March 22 advertising campaign,” which had “inadvertently” sent the personal data to Facebook. The data-sharing feature was then turned off. Cordray also said the data “was automatically anonymized and neither FSA nor Facebook used any of it for any purpose,” without explaining how they were able to verify that.</p><p id=\"LUTkrB\"><em>The Markup</em> notes that it’s unknown how much data was pulled in from students. Yet, even though these students didn’t voluntarily agree to <a href=\"https://m.facebook.com/legal/terms/businesstools\">Facebook’s privacy policy</a> (namely, because FAFSA didn’t tell them they were being tracked), the publication says this policy allows the company can retain such data for years. </p><p id=\"0Du2UU\"><a href=\"https://themarkup.org/pixel-hunt/2022/04/28/applied-for-student-aid-online-facebook-saw-you\">Go read the full report for all of the details</a> and to get a better sense of just how pervasive Facebook’s tracking capabilities across the web (dubbed the “Meta Pixel”) really are.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/O3t-YbUpkAz9E1kFH_L2s4mUUUY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742467/acastro_180828_1777_facebook_0001.jpg",
  "description": "The Department of Education initially denied the tracking.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}