{
  "title": "Go read this report about long hours and stressful work conditions at TikTok",
  "url": "https://www.theverge.com/2022/5/9/23063350/tiktok-work-culture-stress-investigation-united-states",
  "date": "2022-05-09T14:51:15.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yQbQQqZfSE_diqGf7x9Otu2l_So=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70848387/acastro_190723_1777_tiktok_0002.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"oo6PbN\">A harrowing report from <a href=\"https://www.wsj.com/articles/tiktoks-work-culture-anxiety-secrecy-and-relentless-pressure-11651848638\"><em>The Wall Street Journal</em></a> gives us a look at what happens behind the scenes at TikTok, with former employees describing unusually long work hours, stressful working conditions, and a cultural disconnect between TikTok’s US and Chinese branches.</p><p id=\"OzXXQV\">Employees at TikTok’s Los Angeles-based outfit reportedly say they’ve experienced sleep deprivation caused by working late and attending meetings with fellow workers located in China. According to the<em> WSJ</em>, some employees report spending around 85 hours per week in meetings and needing to make more time to finish their work. And since Sunday in the US is already Monday in China, many workers report working on the weekends so they can be on par with their colleagues on the other side of the globe.</p><div class=\"c-float-right\"><aside id=\"GvHZ6O\"><q>Some employees described an immense amount of pressure to keep up with other colleagues</q></aside></div><p id=\"gEnEVu\">This type of working environment had an impact on employees’ emotional well-being and health, the <em>WSJ </em>reports. One employee said he got out of working “back-to-back all-nighters” after showing proof to his boss that he had developed a “potentially life-threatening condition.” Another former senior product manager, Melody Chu, <a href=\"https://medium.com/@melodychu/what-its-really-like-working-at-tiktok-part-1-956ec17e3371\">wrote on Medium</a> that she frequently worked well into the evening to meet with her colleagues in China. The imbalance between her work and personal life led to sleep deprivation and weight loss. Chu said she also had to seek marriage therapy because she was unable to spend time with her husband.</p><p id=\"4X3lj2\">As noted by the <em>WSJ</em>, some employees described an immense amount of pressure to keep up with other colleagues, especially with employees at TikTok’s China-based operations. The company reportedly had several teams rushing to finish the same project to push employees to get their jobs done faster, but this led to “paranoia about falling behind colleagues, or frustration when their projects never saw the light of day.” Another former employee, Lucas Ou-Yang, <a href=\"https://twitter.com/LucasOuYang/status/1493408438780510210\">wrote on Twitter</a> that he knew of 10 product managers who quit after one year of working at the company because they were expected to follow their Chinese colleagues’ schedules.</p><p id=\"PACATF\">Some of the information in the <em>WSJ</em>’s report isn’t new — last year, a report from <a href=\"https://www.cnbc.com/2021/05/06/tiktoks-toxic-culture-reviews-on-glassdoor-impact-hiring.html\">CNBC</a> described the same “996” work schedule mentioned by the <em>WSJ</em>. This schedule, in which employees work from 9AM to 9PM six days per week, was common practice for some companies in China until the <a href=\"https://www.reuters.com/world/china/chinese-authorities-say-overtime-996-policy-is-illegal-2021-08-27/\">Chinese government banned the schedule</a> last year. ByteDance, TikTok’s parent company, established a 63-hour workweek instead, consisting of 10AM to 7PM workdays five days per week. It’s unclear if this kind of schedule is expected outside of China, but as the <em>WSJ</em> notes, “many employees say the longer hours remain the expectation.”</p><p id=\"WCFNA1\">If you want to get a more in-depth look at TikTok’s work culture and how else workers are affected by it, it’s well worth reading the full report from the <a href=\"https://www.wsj.com/articles/tiktoks-work-culture-anxiety-secrecy-and-relentless-pressure-11651848638?mod=pls_whats_news_us_business_f\"><em>WSJ</em></a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WoV3fOT4tjDSfEZub5j0Q0nM2fo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331846/acastro_190723_1777_tiktok_0002.0.jpg",
  "description": "Some employees say working at TikTok hurt their health.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}