{
  "title": "Go read this report on a fake company that tricked real people into working for it",
  "url": "https://www.theverge.com/2022/2/21/22944137/bbc-news-fake-company-investigation-jobfished-madbird",
  "date": "2022-02-21T10:51:15.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/liz_1FCXXFBGYSrqYgsn7g5bPjQ=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70532964/image.0.png\" />        <figcaption><em>Madbird claimed to be a buzzy London-based design agency.</em> | Image: BBC News</figcaption>    </figure>  <p id=\"eIDDrw\"><a href=\"https://www.bbc.co.uk/news/uk-60387324\"><em>BBC News</em> has just published</a> an investigation into Madbird, a supposedly hip design agency led by a charismatic social media influencer called Ali Ayad. But while the company had dozens of real employees across the world, the <em>BBC</em> reports that much of its existence was faked, and used to lure real people into working for months for no pay in the hope of eventually making money after landing big projects.</p><p id=\"wpeN3e\">It’s a remarkable story, not least because of the lengths the company’s founder went to create the illusion of a buzzy and successful London-based design agency. Fake employees reportedly bulked out the company’s Zoom calls, and senior employees listed on the company’s website didn’t appear to work at Madbird at all. Even the photos the company claimed to be of its co-founder appeared to be of a beehive maker from Prague: </p><blockquote><p id=\"PcbsMj\">At least six of the most senior employees profiled by Madbird were fake. Their identities stitched together using photos stolen from random corners of the internet and made-up names. They included Madbird’s co-founder, Dave Stanfield - despite him having a LinkedIn profile and Ali referring to him constantly. Some of the duped staff had even received emails from him. Ali told one employee that if they wanted to get in touch with Mr Stanfield they should email him, because he was too busy with projects for Nike to jump on a call.</p><p id=\"TIhNi1\">Using facial recognition technology we were able to match Dave Stanfield’s headshot to its actual owner - a Prague-based beehive maker named Michal Kalis. When we tracked Michal down, he confirmed he had never heard of Madbird, Ali Ayad or Dave Stanfield.</p></blockquote><p id=\"gSNtN1\">Meanwhile, the address where Madbird claimed to have a hip London office turned out to be a residential apartment block in West London, and one of the company’s pitch documents had reportedly been plagiarized from another London-based design firm. Even a magazine ad featuring the company’s founder appears to have been photoshopped.</p><p id=\"IzA9E7\">It’s a fascinating story that highlights how it’s possible to use our new remote working culture to scam people. <a href=\"https://www.bbc.co.uk/news/uk-60387324\"><em>BBC News’</em> writeup</a> is a great read, and the corporation has also produced TV and radio documentaries about the investigation. If you’re in the UK, you can listen to the radio documentary <a href=\"https://www.bbc.co.uk/programmes/m0014psn\">on Radio 4</a> and watch the <a href=\"https://www.bbc.co.uk/programmes/m0014sbz\">TV documentary on BBC Three</a>. Meanwhile, those outside the UK will be able to find the audio documentary on the <a href=\"https://www.bbc.co.uk/programmes/w3ct3tps\">World Service Radio station</a> from tomorrow, and on World News TV from March 5th.  </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/f5mDmuM0GfGMQRUmhjTRdmpTjkA=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23260608/image.png",
  "description": "Accompanying TV and radio documentaries are coming soon.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}