{
  "title": "Go read this story about Russian cross-stitch stores getting banned from Etsy",
  "url": "https://www.theverge.com/2022/3/28/23000278/slate-russia-etsy-cross-stitch-stores-ban",
  "date": "2022-03-28T20:32:52.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"Etsy stock\" src=\"https://cdn.vox-cdn.com/thumbor/JWb2qcm4XGEIsPlTujZheK1vzAE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70682382/etsy18_2040.0.0.jpg\" />    </figure>  <p id=\"ROJZC4\">Russia’s invasion of Ukraine is affecting an unexpected community: cross-stitchers who buy patterns on Etsy. <em>Slate</em> <a href=\"https://slate.com/technology/2022/03/cross-stitch-russia-shops-etsy.html\">published a piece</a> describing how American cross-stitchers have been “devastated” by Etsy’s recent <a href=\"https://help.etsy.com/hc/en-us/articles/4688019913367-Information-for-Suspended-Sellers-in-Russia?segment=selling\">suspension</a> of Russian storefronts, including cross-stitch patterns shops that are — to the surprise of some crafters — heavily concentrated in Russia.</p><p id=\"bHdXRl\">Cross-stitch is a type of hand embroidery where crafters stitch designs on to fabric with X’s, often using a pattern as a reference. Designs range from fairly simple or incredibly intricate, and they start as low as $3 but can go for “much more” for complex pieces. Etsy is a popular place for cross-stitchers to find digital patterns, and a few weeks ago, cross-stitchers on Reddit <a href=\"https://www.reddit.com/r/CrossStitch/comments/tb9luy/chat_so_many_etsy_shops_have_disappeared_all_at/\">began to notice</a> that their favorite pattern shops had disappeared off the platform.</p><p id=\"2AZHtJ\"><em>Slate</em> spoke with Russian artists and a historian to understand why so many cross-stitch pattern operations were based in Russia in the first place. One theory was that Russian Etsy sellers were pirating virtual patterns and reselling them, but designers instead attribute it to a rich tradition of needlework in the country.</p><blockquote><p id=\"lROFgD\">Maria Demina, the owner of the popular LittleRoomInTheAttic store on Etsy, says, “The saddest part is that all the items got hidden, and nobody can see the patterns I have been working on for the last seven years.” Demina connects the popularity of this hobby and variety of digital designs in Russia not with piracy, but national traditions, which were passed through generations. “I still have two shirts that were cross-stitched by my great-great-grandfather,” she said.</p></blockquote><p id=\"fc00Im\">Etsy wouldn’t say how many Russian shops were closed, but it’s clear that cross-stitch is popular in the country, and crafters abroad have benefitted from Russian designs for sale online. Slate found around 3,000 cross-stitch groups on VK, a popular social media platform in Russia, and there are trainings and workshops that beginners can take to learn the craft. </p><p id=\"LZdL1h\">The shop owners affected by the ban are understandably upset about losing their business and connections to global audiences. Sellers say they feel like all of their hard work was wasted — with no end in sight to restrictions.</p><blockquote><p id=\"9FIBpa\">The growing isolation of Russia will hardly cause crisis in the cross-stitch business in the country and throw it back to Soviet times, given the number of designers and their knowledge. But as many pattern makers have admitted, the lack of cultural exchange and inability to get the feedback from customers internationally has already affected their motivation. “I feel bad for losing connection with people abroad, because it has encouraged me to keep working. It is about stars, comments, messages from users. It is all gone,” said Alyona.</p></blockquote><p id=\"y8wMC6\">The <a href=\"https://slate.com/technology/2022/03/cross-stitch-russia-shops-etsy.html\"><em>Slate</em> piece</a> is a fascinating example of how supply chains can break down even when the goods are digital. The story does a great job of demonstrating the unexpected effects of Russian sanctions and war through a niche but dedicated community — and the frustrations of sellers who have very little recourse. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BhaMxXLxlCldXCYaXMvcPsQ1tQk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3612880/etsy18_2040.0.jpg",
  "description": "How the war disrupted the cross-stitch supply chain",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}