{
  "title": "Go watch our GoPro Bones review",
  "url": "https://www.theverge.com/23032403/gopro-bones-fpv-drone-review",
  "date": "2022-04-20T14:00:00.000Z",
  "author": "Vjeran Pavic",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MSgbPsMCBYlPPmxRFfXD6YWyrWw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70771061/vpavic_220413_5145_0003.0.jpg\" />    </figure>  <p id=\"Vw0Lfg\">No battery, no screen, no GPS, no fan, and no metal housing? There’s a lot of stuff missing from the new GoPro Hero10 Black Bones. But then again, a normal GoPro isn’t well-suited for the acrobatics of an FPV drone. So when GoPro sent us a review unit of <a href=\"https://www.theverge.com/23021285/gopro-hero10-black-bones-drones-fpv\">its new stripped-down Hero10 Black designed for drone pilots</a>, we recruited FPV drone pilot <a href=\"http://instagram.com/inspireFPV\">Reza Kurniawan</a> to see if it’s up to snuff — and you can see his flying skills on full display in our video review above.</p><p id=\"GoNpai\">Kurniawan is the kind of drone enthusiast who inspired the Bones to begin with. He’s been de-casing Hero10 GoPros to decrease their weight from 154 grams all the way down to about 33 grams. The demand for so-called “naked GoPros” has been high enough that it has become a service he provides to his customers, and the new Bones is a 54-gram version that GoPro sells itself.</p><p id=\"c5DxF1\">The internals of this camera are the same you’d find on the Hero10 Black. It has the same GP2 processor, HyperSmooth 4.0 in-body stabilization, and image sensor capable of filming 5.3K footage up to 60fps and 4K footage up to 120fps. </p><p id=\"CzrOzM\">The $499 Bones ($399 with subscription) is the first of GoPro’s “derivative” cameras that the company announced during <a href=\"https://www.theverge.com/2022/2/3/22916798/gopro-expand-camera-lineup-q4-earnings-call-hero-max\">its last earnings call</a>, and the company tells us we’ll see more specialized cameras targeting niche audiences from GoPro in the future, too. But for now, Kurniawan and the rest of the community can put their soldering gear down. Or can they? </p><p id=\"pqzHcs\">Go watch our <a href=\"https://youtu.be/6pfF3FbGuYk\">review</a> of the Bones to find out.</p><p id=\"2vqdWm\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7ZY9YmtI8WLper8X8z03SCcnZPY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23402107/vpavic_220413_5145_0003.jpg",
  "description": "A lighter camera with just the bones — for drones.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}