{
  "title": "Godzilla and Kong are coming to Call of Duty: Warzone",
  "url": "https://www.theverge.com/2022/5/10/23065586/call-of-duty-warzone-godzilla-kong",
  "date": "2022-05-10T19:25:15.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Mv8Aj1FrTqYRTtmjz2RrwpDYekI=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70853682/COD_WZ_VGD_OPERATION_MONARCH_TOUT_HERO.0.jpeg\" />        <figcaption><em>They’re featured in a new limited time mode that kicks off on May 11th.</em> | Image: Activision</figcaption>    </figure>  <p id=\"vjqiir\">Activision is adding a wild crossover to <em>Call of Duty: Warzone — </em>the giant monsters Godzilla and Kong will appear in a new limited-time mode that kicks off tomorrow, May 11th. </p><p id=\"ON96Oa\">In the new mode, called Operation Monarch, players will compete to be the last team standing as Godzilla and Kong roam the island. While the monsters “usually don’t get too aggressive,” at certain points during a match, they might “become enraged and recklessly attack” in a “Titan Frenzy,” according to <a href=\"https://www.callofduty.com/blog/2022/05/call-of-duty-warzone-operation-monarch-limited-time-mode-guide\">a blog post</a> by Activision’s James Mattone.</p><p id=\"5Lv1gQ\">“After receiving a Titan Frenzy alert, an Operator has two options: tactically withdraw (run away) from these dangerous creatures or attempt to suppress them by dealing direct damage,” Mattone says. If you do enough damage to either monster during a Titan Frenzy or earn enough “Monarch Intel” during a match, you’ll get a Killstreak ability that lets you use powers from Godzilla or Kong. </p><p id=\"hEcnIu\">The Operation Monarch mode will be available from May 11th until May 25th. Alongside the event, Activision is also releasing a handful of Godzilla and Kong-themed in-game items, including skins. </p><p id=\"nawtaN\">The Godzilla and Kong mode is the latest mind-bending crossover in a battle royale shooter. <em>Fortnite</em>, of course, <a href=\"https://www.theverge.com/22242696/fortnite-predator-marketing-brands-cross-promotion\">is famous for its brand tie-ins</a>, but did you know that <em>PUBG Mobile</em> just introduced its second collaboration with... <a href=\"https://www.youtube.com/watch?v=J_NgVMDSrsA\">Pinkfong’s Baby Shark</a>? (<a href=\"https://www.theverge.com/2022/1/13/22881970/baby-shark-youtube-video-10-billion-views\">Yes, that one.</a>)</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ysGtx3gaSYo3nIxN6aJgjMzngE0=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23451030/COD_WZ_VGD_OPERATION_MONARCH_TOUT_HERO.jpeg",
  "description": "They’ll be in the game for a short time beginning May 11th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}