{
  "title": "Godzilla and Evangelion are forming a new Japanese cinematic universe",
  "url": "https://www.theverge.com/2022/2/15/22934422/shin-japan-heroes-universe-godzilla-ultraman-kamen-rider-evangelion",
  "date": "2022-02-15T06:34:13.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/e0fifWprCKwAXB1D3Daz6nGujVo=/0x0:1125x750/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70510238/sjhu.0.jpg\" />    </figure>  <p id=\"KHKH56\">Japanese industry titans are teaming up for a new cinematic universe based on iconic properties. Toho, Toei, Khara, and Tsuburaya Productions have <a href=\"https://m-78.jp/news/post-6227\">announced</a> the upcoming launch of the Shin Japan Heroes Universe, which will include representation from the Godzilla, Ultraman, Kamen Rider, and Evangelion franchises.</p><p id=\"Y5ptq8\">Toho is the company that created Godzilla, Toei is behind Kamen Rider, Tsuburaya produces Ultraman, and Khara is the animation studio founded by <em>Neon Genesis Evangelion</em> creator Hideaki Anno. Tsuburaya Productions’ founder, the late <em>tokusatsu</em> special effects pioneer Eiji Tsuburaya, did effects work for movies in both the Godzilla and Ultraman series.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eugCDy1bgJXbRaHjhTYiaJEvNoE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243055/post_6227_shin_japan_heroes_002_660x715.jpg\">  </figure><p id=\"ND7oqE\">Toho released the Anno-directed <em>Shin Godzilla </em>in 2016, and Anno is also directing the upcoming <em>Shin Ultraman</em> and <em>Shin Kamen Rider, </em>which look to be stylistically similar reboots. Last year’s <em>Evangelion: 3.0+1.0 Thrice Upon a Time </em>was known as <em>Shin Evangelion Gekijouban</em> in Japan and is listed alongside the other “<em>Shin</em>” movies on the new <a href=\"https://sjhu.jp\">Shin Japan Heroes Universe website</a>.</p><p id=\"TvnNFd\">So while no new projects have been announced just yet, the idea of a crossover between these properties themed around the idea of “shin,” which means “new” in Japanese, isn’t coming from nowhere. The addition of Evangelion into the mix, however, as well as the declaration of an explicit universe where the IP will interact with one another, sets the stage for some unprecedented cinematic battles. As if Tokyo-3 didn’t have enough on its plate without Godzilla turning up. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OZnlTwxm9CqkU-YrLUPVBOF2T1I=/0x81:1125x670/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23242999/sjhu.jpg",
  "description": "Enter the \"Shin Japan Heroes Universe.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}