{
  "title": "Google forces YouTube Vanced to shut down ‘due to legal reasons’",
  "url": "https://www.theverge.com/2022/3/13/22975890/youtube-vanced-app-discontinued-shutting-down-legal-reasons",
  "date": "2022-03-13T22:21:22.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NN4d20k9TKbE2vqG1mHU4RbWCn8=/10x0:1191x787/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70617302/youtubevanced.0.jpg\" />    </figure>  <p id=\"sW5naE\">The popular Vanced YouTube app is being discontinued, after a legal threat from Google. The creators of Vanced have revealed the project will be shut down in the coming days, with download links set to be removed. While the app will continue to work for anyone who currently has it installed on Android, without any future updates it’s likely to stop working at some point soon. The Vanced owners say they’ve had to discontinue the project “due to legal reasons.”</p><p id=\"r3hSPr\">Google sent the Vanced owners a cease and desist letter recently, which has forced the developers to stop distributing and developing the app. “We were asked to remove all references to ‘YouTube’, change the logo, and remove all links related to YouTube products,” says an admin from the Vanced team in a Discord message to <em>The Verge</em>.</p><div id=\"mGAj8U\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Vanced has been discontinued. In the coming days, the download links on the website will be taken down. We know this is not something you wanted to hear but it's something we need to do. Thank you all for supporting us over the years.</p>— Vanced Official (@YTVanced) <a href=\"https://twitter.com/YTVanced/status/1503052250268286980?ref_src=twsrc%5Etfw\">March 13, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"8QwHnu\"><a href=\"https://vancedapp.com/#features\">Vanced</a> is a popular third-party YouTube app for Android, particularly because it allows YouTube users to block all video ads on YouTube without a Premium subscription. Vanced also includes a true black theme, and customizations not offered in the official YouTube for Android app.</p><p id=\"po81x6\">Vanced is the latest casualty in Google’s action against third-party apps that access YouTube. Google-owned YouTube <a href=\"https://www.theverge.com/2021/9/12/22669502/youtube-discord-rythm-music-bot-closure\">forced two popular Discord music bots offline</a> last year, before starting to test ad-supported <a href=\"https://www.theverge.com/2021/9/22/22687492/discord-youtube-integration-watch-together-feature-beta\">YouTube integration into Discord</a> just weeks later. The popular Rythm and Groovy Discord music bots also avoided ads on the service, allowing Discord users to listen to music together.</p><p id=\"USpk3o\">“Vanced has been discontinued,” reads a <a href=\"https://t.me/Vanced\">Telegram message</a> from the Vanced owners. “We know this is not something you wanted to hear, but it’s something we need to do.” We’ve reached out to Google to comment on the discontinuation of Vanced, and we’ll update you accordingly.</p><blockquote><p id=\"Q7Gtxl\">“DISCONTINUATION OF THE VANCED PROJECT</p><p id=\"Dm6CG3\">Vanced has been discontinued. In the coming days, the download links will be taken down. The Discord server, Telegram chat and subreddit will stay for the time being. We know this is not something you wanted to hear, but it’s something we had to do. We want to thank you all for the support over the years.</p><p id=\"7ctl62\">Edit (1): The existing version will continue to work.<br>Edit (2): It was done due to legal reasons.”</p></blockquote><p id=\"cJ92tl\"><em><strong>Update, March 13th 9PM ET</strong></em><em>: Article updated with comment from the Vanced team on Google’s cease and desist letter.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3qAUd0m6QNqcFZqSSpbb_GG1Wog=/0x80:1200x708/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23311425/youtubevanced.jpg",
  "description": "Vanced has been discontinued and downloads will disappear.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}