{
  "title": "Google asks FDA to clear Fitbit for passive heart rhythm monitoring  ",
  "url": "https://www.theverge.com/2022/3/24/22994324/google-fitbit-heart-monitoring-afib-fda",
  "date": "2022-03-24T16:01:00.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ABsR0cIlxYqHA963C4lNk1gzf24=/182x0:1331x766/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70666789/Screen_Shot_2022_02_01_at_10.00.56_AM.0.png\" />        <figcaption>Image: Fitbit</figcaption>    </figure>  <p id=\"pIIX1l\">Google submitted data for a new Fitbit feature that would passively monitor users’ heart rhythms to the Food and Drug Administration, the company announced today. </p><p id=\"BgOe3h\">Fitbit <a href=\"https://www.theverge.com/2020/9/14/21436090/fitbit-sense-ekg-heart-fda-clearance-apple-samsung-withings\">currently</a> can only check for irregular heart rhythm periodically; users have to actively decide to take a reading. The new feature would run in the background and alert people if they’re showing signs of a condition called atrial fibrillation. It’d bring Fitbit’s EKG feature closer to the one on the Apple Watch, which checks the wearer’s heart rhythms on occasion and alerts them if it catches any irregularities. </p><p id=\"Qs5D1O\">Fitbit launched <a href=\"https://www.fiercebiotech.com/medtech/fitbit-shows-it-can-track-down-atrial-fibrillation-450-000-strong-heart-study\">a study</a> in 2020 to test its passive heart rhythm technology. Nearly half a million Fitbit users participated in the study, and it flagged around 1 percent of participants (just under 5,000 people) as having an irregular heart rhythm, according to data presented at the 2021 American Heart Association meeting. Those people were asked to set up a telehealth consultation so they could get an EKG patch, and around 1,000 did so. Of that group, a third had the diagnosis confirmed — giving the tech a positive predictive value for atrial fibrillation of 98 percent. (For comparison, the Apple Watch atrial fibrillation alert had a positive predictive value of 84 percent on a similar-sized study.)</p><p id=\"FiNDlb\">“These results are extremely promising and we think will have a real impact on early detection and treatment of this important condition,” Tony Faranesh, a research scientist at Fitbit, said in a press briefing. </p><p id=\"xF0cHK\">Atrial fibrillation is associated with a higher risk of stroke, and the hope is that this type of early detection will help prevent stroke. But it’s still unclear if monitoring for atrial fibrillation via smartwatch will actually keep strokes from happening — most research focuses on whether devices are accurate, not whether using them keeps people <a href=\"https://www.theverge.com/2022/3/2/22958156/apple-watch-heart-rhythm-detection-benefit\">healthier in the long run</a>. </p><p id=\"EPTtNr\">Faranesh said there isn’t a clear timeline for when the new feature might be available on Fitbit devices.</p><p id=\"5BwrVy\"></p><p id=\"HWR8LD\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SXpsJZO1sWtXtAJW71rzs83zqbU=/25x0:1488x766/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23210299/Screen_Shot_2022_02_01_at_10.00.56_AM.png",
  "description": "A new feature would run in the background",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}