{
  "title": "Google and Mozilla are ready for Chrome and Firefox version 100 to break some websites",
  "url": "https://www.theverge.com/2022/2/17/22938721/chrome-firefox-edge-version-100-websites-bug-compatibility-issues-mozilla-google-microsoft",
  "date": "2022-02-17T11:52:10.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9cL6aQ6BuUm7PUMVX1lhCLebqnc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70519990/acastro_180416_1777_chrome_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"eQLiM4\">Chrome, Firefox, and Edge are about to hit version 100, in a triple release that could break some websites. The move to version 100 in the coming weeks could result in bugs or compatibility issues on some websites not ready to read triple-digit user-agent strings. Google, Mozilla, and Microsoft are busy trying preempt any big issues.</p><p id=\"SLqiB5\">Mozilla, Google, and Microsoft have been warning about the upcoming version 100 release for months, which is about to drop in March for both Chrome and Edge, followed by Firefox in May. Mozilla and Google have both been running experiments to test websites and report breakages. There’s a <a href=\"https://github.com/webcompat/web-bugs/labels/version100\">running list of issues</a>, which is fairly small right now, and <a href=\"https://www.engadget.com/firefox-and-chrome-versions-100-may-break-some-websites-085422307.html?src=rss\"><em>Engadget </em>notes</a> that the notable sites affected include HBO Go, Bethesda, and Yahoo.</p><div class=\"c-float-right\"><aside id=\"Qfbc1x\"><q>The work behind the scenes is like the Y2K bug</q></aside></div><p id=\"NaDOUm\">“When browsers first reached version 10 a little over 12 years ago, <a href=\"https://maqentaer.com/devopera-static-backup/http/dev.opera.com/articles/view/opera-ua-string-changes/index.html\">many issues were discovered</a> with User-Agent parsing libraries as the major version number went from one digit to two,” explains a team of web developers <a href=\"https://hacks.mozilla.org/2022/02/version-100-in-chrome-and-firefox/\">in a Mozilla blog</a>. Much like the infamous Y2K bug that made the year 2000 indistinguishable from 1900 for some computers, browsers have different formats for user-agent strings, and “it’s possible that some parsing libraries may have hard-coded assumptions or bugs that don’t take into account three-digit major version numbers.”</p><p id=\"HUi7Ye\">While there are concerns around some websites breaking, a lot of hard work has been going on behind the scenes — much like what happened to avoid major headaches with the Y2K bug 22 years ago — to make the transition to version 100 go smoothly. Developers can enable a special flag in current versions of Chrome, Edge, and Firefox to make the browsers report as version 100 and aid in testing sites. </p><p id=\"WqBu6Z\">There are also plans in place if there are widespread issues. Mozilla says it will either hot fix broken websites or temporarily freeze Firefox’s major version at 99 if breakages are widespread and unmanageable. Google’s backup plan is to use a flag to freeze the major version at 99, and Microsoft hasn’t detailed a backup plan as far as we can tell.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8vrII42-MmhQI5d4qECJlqUBk6U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10673529/acastro_180416_1777_chrome_0001.jpg",
  "description": "There are plans in place to avoid version 100 headaches.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}