{
  "title": "Google rolls out new badges to help people avoid bad Chrome extensions",
  "url": "https://www.theverge.com/2022/4/20/23034208/google-chrome-extensions-badges-featured-established",
  "date": "2022-04-20T19:16:24.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/s5pFGVbQdjyCZXIzpMaZFxS5wIU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70772824/acastro_180416_1777_chrome_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"en8FGG\">Google is trying to make it easier for Chrome users to install useful extensions without having to scrutinize where they come from. The company says it has <a href=\"https://blog.google/products/chrome/find-great-extensions-new-chrome-web-store-badges/\">begun applying two new badges to extensions</a>. The first, Featured, looks like a prize ribbon and will be displayed on extensions that “follow our technical best practices and meet a high standard of user experience and design.” </p><p id=\"f5DRVv\">Google says this is a manual process that involves evaluating extensions for an “enjoyable and intuitive experience,” making sure developers use the latest APIs, and keeping an eye on each extension’s privacy practices and requested permissions. To receive the Featured label, extensions must also have a detailed store page that clearly outlines their purpose. And last, an extension’s core features “must be accessible without additional credentials or payments.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NYKkRGKBghgBzoDidZeUqMHTH2E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23404292/established.png\">      <cite>Image: Google</cite>      <figcaption><em>Both new badges are live in the Chrome Web Store today.</em></figcaption>  </figure><p id=\"VKIyEu\">The second badge will be shown on extensions made by Established Publishers. This one, which has a checkmark design, is given to publishers “who have verified their identity and demonstrated compliance with the developer program policies.” But identity verification alone isn’t enough to earn the badge. Google also says that extension creators must demonstrate “a consistent positive track record” with its services and not have any outstanding developer policy violations. This means that brand new extension publishers will have to prove themselves first. Google notes it “will take at least a few months of respecting these conditions to qualify.”</p><p id=\"ihMjYc\">Companies cannot pay for either of the new badges, though they can nominate an existing extension to receive the Featured one. “It has always been our mission to make it easy for users to find great extensions while recognizing the publishers who create them,” Google’s Debbie Kim said in today’s blog post detailing the badges. The labels should help people feel better about clicking the install button without worrying about malicious extensions that make their way onto the Chrome Web Store. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8vrII42-MmhQI5d4qECJlqUBk6U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10673529/acastro_180416_1777_chrome_0001.jpg",
  "description": "Featured extensions are manually picked by Google.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}