{
  "title": "Google’s iPhone app for wirelessly switching to Android will be ready for Pixel owners in a few weeks",
  "url": "https://www.theverge.com/2022/4/20/23034459/switch-to-android-google-iphone-app",
  "date": "2022-04-21T03:59:39.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GZxgAqxZIzffzRYsRy4TSWn9aIg=/133x0:2367x1489/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70774672/switch_to_android_ios_googleapp.0.jpg\" />        <figcaption>Image: Google</figcaption>    </figure>  <p id=\"43BGdM\">Anyone switching from an iPhone to an Android device has more to worry about <a href=\"https://www.theverge.com/2022/1/10/22877304/google-lockheimer-accuse-apple-imessage-holding-back-rcs-text-sms\">than just green bubbles</a>, they also want to bring along as much of the data from their phone as they can. While backing things up to Google Drive or plugging in a cable are solutions <a href=\"https://www.android.com/switch-to-android/#switch-heading-faq\">that Google can walk you through</a>, now we know Google built an iOS app called Switch to Android to get the job done wirelessly.</p><p id=\"rIwGIY\">Switch to Android <a href=\"https://www.theverge.com/2022/4/13/23024399/google-switch-to-android-iphone-app-unlisted\">popped up in the App Store last week</a>, but it’s unlisted so you’d need the link to dig it up. As <a href=\"https://techcrunch.com/2022/04/19/googles-switch-to-android-app-now-officially-rolling-out/\"><em>TechCrunch</em></a> reported, Google is starting to roll the app out to the public, but it may be a little while before you can actually use it. Google spokesperson Ivy Hunt confirmed to <em>The Verge </em>that the rollout should be complete in a few weeks. What we’re waiting for is an update to Pixel devices that allows them to work with the app. Once the devices are all ready, then the app will be available in the markets where Pixel phones are sold.</p><p id=\"Jtei9c\">Once it’s active, the Switch to Android app will be able to initiate the transfer process by popping up a QR code on the iPhone, which your Pixel can scan and start to load photos, videos, contacts, and calendar events without “fussy cables.” </p><p id=\"un0q0T\">Of course, the app is called Switch to Android, not Switch to Pixel, so you’d be right in assuming that it should work with other devices, but at first the only phones it’s working with are Pixels. There’s no word yet on when it will be ready for other Android phones, or from which manufacturers.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iJ0tY-2KCifywCSqJPz337ArBi0=/0x91:2500x1400/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23405590/switch_to_android_ios_googleapp.jpg",
  "description": "iOS to Android switchers will still need to plug in, for now",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}