{
  "title": "Google said Steam had arrived on Chromebooks, but now says it’s ‘coming soon’",
  "url": "https://www.theverge.com/2022/3/15/22979368/steam-chromeos-chromebook-valve-google-2022-alpha",
  "date": "2022-03-16T21:18:04.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_-URvXnR7v8A-cLS2c_QPi92UZY=/220x0:1372x768/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70626430/Screen_Shot_2022_03_15_at_09.35.36.0.png\" />        <figcaption><em>Steam was briefly mentioned during a developer keynote.</em> | Image: Google</figcaption>    </figure>  <p id=\"EQeX2Q\">Google announced that some ChromeOS users would finally be able to start testing Steam during its Google for Games Developer Summit but later revised that message to say that the alpha would be “coming soon.” </p><p id=\"QLoeF1\">During the keynote, Google’s product director for games, Greg Hartell, <a href=\"https://youtu.be/1oc75GQFKvg?t=843\">announced</a> that “the Steam alpha just launched” for select Chromebooks and pointed viewers to the Chromebook Community Forum for more information. At the time, the promised post didn’t seem to be there yet, but it was <a href=\"https://support.google.com/chromebook/thread/155131703/steam-to-chrome-os?hl=en\">later added with a slightly revised message</a>:</p><blockquote><p id=\"KGlSql\">Hello Chromebook Community, </p><p id=\"eHApem\">As you may have already heard, our team is working with Valve to bring Steam to Chrome OS. We are very excited to share that we’ll be landing an early, alpha-quality version of Steam on Chrome OS in the Dev channel for a small set of Chromebooks coming soon. Please come back to the forum for more information!</p></blockquote><p id=\"VW6QSq\">Anyone holding their breath for Steam on ChromeOS is probably used to it, as it’s been a long time coming — Google announced that it was working on supporting the software on Chromebooks <a href=\"https://www.theverge.com/2020/1/17/21070284/chrome-os-steam-support-linux-games\">in the beginning of 2020</a>, and there hasn’t been much info since. There have been whispers that we’d see it soon, though, as recent reports indicated that companies are working on <a href=\"https://www.theverge.com/2022/1/27/22904183/gaming-chromebooks-rgb-nvidia-rtx-leaks\">gaming-focused Chromebooks</a>.</p><div class=\"c-float-right\"><aside id=\"xFe6ry\"><q>Google talked about Steam for all of 13 seconds during its Google for Games Developer Summit keynote</q></aside></div><p id=\"o6pRhD\">Despite how long we’ve been waiting, Hartell’s announcement came as a bit of a surprise. As <a href=\"https://twitter.com/SkylledDev/status/1503773977772179460?s=20&amp;t=Mp9ks3yr68SUGpigPKO15A\"><em>9to5Google</em>’s Kyle Bradshaw tweeted</a>, people have been trying to learn more about Steam on ChromeOS for months, combing through code and developer comments — only for Google to announce it with a casual mention during a developer keynote. </p><p id=\"l6VWKR\">That keynote also went over Google’s <a href=\"https://www.theverge.com/2022/3/15/22978719/google-stadia-cloud-gaming-free-trial\">revised plans for its Stadia service</a> — the TL;DR is that it plans to introduce free demos and trials, as well as make things easier for developers. You can watch it <a href=\"https://www.youtube.com/watch?v=1oc75GQFKvg\">here</a>, or below (the Steam mention is about 14 minutes in).</p><div id=\"16gr1R\"><div ><iframe src=\"https://www.youtube.com/embed/1oc75GQFKvg?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"lrLajA\">It is understandable why Google would want to be relatively quiet about the launch; since it’s slated to arrive as an alpha, it’ll probably be a little rough around the edges. There’s also limited availability. Google didn’t mention which computers Steam will be available on, but <em>9to5Google</em> has <a href=\"https://9to5google.com/2022/02/19/steam-chrome-os-supported-chromebooks/\">a list that it discovered last month</a>. It includes the x86-powered laptops like the <a href=\"https://www.theverge.com/22451261/acer-chromebook-spin-713-2021-review\">Acer Chromebook Spin 713</a> and the <a href=\"https://www.theverge.com/22776850/asus-chromebook-flip-cx5-review-the-15-inch-chromebook-to-beat\">Asus Flip CX5</a>, along with a few other models.</p><p id=\"Q1Rykn\"><em><strong>Update, March 16th 5:18PM ET: </strong></em><em>Updated to reflect Google’s community post, which stated that the Steam alpha wasn’t immediately available and was instead “coming soon.” </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DQFXJhkaswGwSeIPs9qUyHo3hr8=/0x50:1372x768/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23317888/Screen_Shot_2022_03_15_at_09.35.36.png",
  "description": "It was first announced in early 2020.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}