{
  "title": "Google parent company Alphabet broke $200 billion in annual revenue for the first time",
  "url": "https://www.theverge.com/2022/2/1/22912196/google-alphabet-200-billion-annual-revenue-youtube-pixel-search",
  "date": "2022-02-01T21:54:43.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Wze_R23sS0KfCOOsGPrv_YvEr6M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70459590/acastro_180130_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"gNkLSD\">Google parent company Alphabet hit a new record for annual revenue in 2021, showing no ill effects from the lingering coronavirus pandemic or ongoing issues with the global supply chain. For full-year 2021, the company saw a 41 percent year-over-year jump in revenue to $257 billion. The company reported revenue of $75.3 billion in the fourth quarter of 2021, up 32 percent from the year earlier. </p><p id=\"qwDuVz\">“Q4 saw ongoing strong growth in our advertising business, which helped millions of businesses thrive and find new customers, a quarterly sales record for our Pixel phones despite supply constraints, and our Cloud business continuing to grow strongly,” Alphabet and Google CEO Sundar Pichai said in <a href=\"https://abc.xyz/investor/static/pdf/2021Q4_alphabet_earnings_release.pdf?cache=d72fc76\">a statement</a> accompanying the earnings release. The company also announced a 20-for-1 stock split that will take effect in July.</p><div id=\"ADZA5V\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Google’s annual revenue:<br><br>2021: $258 billion<br>2020: $183 billion<br>2019: $162 billion<br>2018: $137 billion<br>2017: $111 billion<br>2016: $90 billion<br>2015: $75 billion<br>2014: $66 billion<br>2013: $56 billion<br>2012: $46 billion<br>2011: $38 billion<br>2010: $29 billion<br>2009: $24 billion</p>— Jon Erlichman (@JonErlichman) <a href=\"https://twitter.com/JonErlichman/status/1488620607487070208?ref_src=twsrc%5Etfw\">February 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"ouDnfP\">The company doesn’t typically break out numbers for devices like its Pixel phones, Nest smart home products, or the Android operating system, instead including them in “Google other” under “Google Services.” The “Services” category also includes YouTube and Search, two of the company’s best-performing segments. The “Google other” category brought in $8.16 billion in revenue for the fourth quarter.</p><p id=\"qXYiOh\">Google had advertising revenue of $61.24 billion for the quarter. <a href=\"https://www.theverge.com/2021/4/27/22405474/apple-app-tracking-transparency-ios-14-5-privacy-update-facebook-data\">Apple made privacy changes in iOS last year</a>, requiring users to opt in if they wanted to allow apps to track them across other apps and on websites. Its App Tracking Transparency affected many advertisers’ ability to target ads to users, and in October, the <a href=\"https://www.ft.com/content/4c19e387-ee1a-41d8-8dd2-bc6c302ee58e\"><em>Financial Times </em>reported</a> that Facebook (now Meta), Twitter, Snapchat and YouTube lost nearly $10 billion in revenue in the second half of 2021 as a result of the new iOS settings. </p><p id=\"621hv1\">But Google collects its own data via its search traffic and YouTube, so it has been less affected by the iOS change. The company brought in $8.63 billion in revenue from YouTube ads in the fourth quarter of 2021 alone.</p><p id=\"1Rnydp\">The company posted an operating loss of $890 million on its Cloud segment on revenue of $5.54 billion. Its Other Bets segment, which includes autonomous vehicle division Waymo and life sciences division Verily, brought in $181 million in revenue. </p><p id=\"J12nXO\">Last year was the first time Alphabet surpassed $200 billion in revenue, which is almost triple the company’s revenue from 2016, just five years earlier.</p><p id=\"AJVVYP\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rO7gbGs_cP8JLPl_xk0gOSI2rDg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10125267/acastro_180130_1777_0001.jpg",
  "description": "The company also announced a 20-for-1 stock split.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}