{
  "title": "Google Search’s new highly cited label helps you get to the source of a story ",
  "url": "https://www.theverge.com/2022/3/31/23004348/google-search-highly-cited-label-rapidly-evolving-topics-notice-about-this-result",
  "date": "2022-03-31T12:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/B56eeUPR7kDzyhNFBR5-VqCQXsk=/1x0:1602x1067/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70693221/Screen_Shot_2022_03_31_at_9.20.19_AM.0.jpg\" />        <figcaption><em>The “Highly Cited” label shown on an article’s preview image.</em> | Image: Google</figcaption>    </figure>  <p id=\"75MBUo\">Google is adding a new “highly cited” label to search results frequently sourced by other publications, the company is announcing today. Anything from local news stories, to interviews, announcements, and even press releases will be eligible for the new label being added to the search result’s preview image, so long as other websites are linking to it. More info is also being added to Search’s “rapidly evolving topics” and “About this Result” notices. </p><p id=\"TSaiDN\">The search giant’s hope is that its highly cited label will help highlight original reporting, which can include important context that’s stripped out when a story gets picked up more widely. But it should also be helpful to find press releases, where you can get information directly from companies themselves. Google says it hopes the label will help readers find “the most helpful or relevant information for a news story.” It’ll launch “soon” in the US on mobile for English-speaking users, and will start appearing globally “in the coming weeks.”</p><p id=\"7Egcy8\">Alongside the highly cited label, Google is expanding its attempts to help search users critically evaluate the results they’re being shown. The <a href=\"https://www.theverge.com/2021/6/25/22550430/google-search-results-changing-quickly-warning-breaking-news\">notice it shows</a> on searches relating to “rapidly evolving topics” will now remind users to check whether a source is trusted, or simply tell them to come back later when more information is available. This change is launching today for English searches in the US. It’s also rolling out <a href=\"https://www.theverge.com/2021/2/1/22252443/google-about-this-result-information-search-results-wikipedia-vet-websites\">improvements to its “About This Result</a>” feature <a href=\"https://blog.google/products/search/evaluating-information-online-tools/\">announced last year</a> (which offer more context about each website in search results), in the coming weeks.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vWiZyS0YVVm22OVK0TRnVPgvRiw=/0x115:1602x954/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23357220/Screen_Shot_2022_03_31_at_9.20.19_AM.jpg",
  "description": "Helping searchers get to the root of a story.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}