{
  "title": "Google and Samsung join forces to make it easier to sync fitness data between apps",
  "url": "https://www.theverge.com/2022/5/15/23074015/google-samsung-health-connect-join-forces-easier-share-fitness-data-between-apps-developers",
  "date": "2022-05-15T22:04:51.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8wzBmC6Yd7zWTupXmdUdzvzuFMo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70872436/acastro_180427_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"zr207D\"><a href=\"https://android-developers.googleblog.com/2022/05/introducing-health-connect.html\">Google and Samsung have partnered</a> to create <a href=\"https://android-developers.googleblog.com/2022/05/introducing-health-connect.html\">Health Connect</a>, a platform and API (application programming interface) that gives developers a toolset to sync users’ health data between Android apps and devices. This should make it easier for users to keep track of their health and fitness data across several different platforms.</p><p id=\"ZuTHuO\">Once a user opts in, developers can compile their health data in an encrypted hub that’s located on a user’s device. Google says users will get full control over what kind of data they share and what apps they share it with. If more than one app is collecting the same type of data, such as steps taken, users can choose to share that data with one app over the others. Health Connect supports over 50 data types in a number of categories, including activity, body measurement, cycle tracking, nutrition, sleep, and vitals.</p><div id=\"HOSxG7\"><div ><iframe src=\"https://www.youtube.com/embed/d14GVcnbTeo?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"0Pb7HB\">“We’re working alongside Google and other partners to realize the full benefits and potential of Health Connect,” TaeJong Jay Yang, Samsung’s executive vice president, said in a <a href=\"https://news.samsung.com/global/editorial-breakthrough-innovation-for-health-and-wellness-enthusiasts\">press release</a>. “I’m excited to confirm that Samsung Health will also adopt Health Connect later this year. With users’ permission, this will enable app developers to take advantage of accurate and optimized data measured on Galaxy Watch for Samsung Health and use it in their apps as well.”</p><p id=\"w8idxa\">Health Connect is currently in an open beta accessible to all Android developers. In addition to Samsung, Google is also working with the developers of MyFitnessPal, Leap Fitness, and Withings in an early access program. Google Fit and the Google-owned Fitbit are set to adopt Health Connect as well, which means the tech should be available in time for <a href=\"https://www.theverge.com/2022/5/11/23064072/google-pixel-watch-fitbit-io-2022\">the Pixel Watch’s release later this year</a>. </p><p id=\"va8EQn\">As my colleague <a href=\"https://www.theverge.com/2022/5/13/23070484/google-ecosystem-pixel-watch-tablet-hardware-software\">Jon Porter points out</a>, Google has gotten where it is because of its open approach to its products, and the Health Connect API is just another example of Google’s willingness to collaborate with other companies. Unlike Samsung and Apple, Google doesn’t tend to force (or even push) users into its ecosystem — but with a Pixel Watch and <a href=\"https://www.theverge.com/2022/5/11/23065055/google-android-tablet-pixel-io-release-date\">Android Tablet on the way</a>, Google may have to subtly start nudging users towards its own products if it wants users to buy into its expanding lineup of Pixel devices.</p><aside id=\"gTJYRv\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Google’s biggest announcements at I/O 2022 \",\"url\":\"https://www.theverge.com/2022/5/11/23066583/google-io-2022-biggest-announcements-pixel-watch-6a-buds-tablet\"},{\"title\":\"Pixel by pixel: How Google is trying to focus and ship the future\",\"url\":\"https://www.theverge.com/23065820/google-io-ambient-computing-pixel-android-phones-watches-software\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/zecX0cPldoJGxd8xivCIx07sXlA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745895/acastro_180427_1777_0001.jpg",
  "description": "Health Connect is a hub for users’ health data.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}