{
  "title": "Google Fiber workers begin voting on whether to unionize",
  "url": "https://www.theverge.com/2022/3/4/22961704/google-fiber-workers-contractors-union-bds",
  "date": "2022-03-04T21:41:44.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vQr7A6sQsMFq9YZflSf3sHVg1ec=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70580971/acastro_180427_1777_0003.0.jpg\" />        <figcaption>Google Fiber workers voting whether to unionize | Illustration: Alex Castro / The Verge</figcaption>    </figure>  <p id=\"hs8qSO\">Voting is open for workers for a Google Fiber subcontractor in Missouri, who are deciding whether to unionize as part of the Alphabet Workers Union (AWU), a division of the Communication Workers of America. If successful, the 12 workers, who are employed by staffing agency BDS Connected Solutions as workers at Google Fiber stores<em>, </em>would be the AWU’s first bargaining unit to be recognized by the National Labor Relations Board (NLRB). </p><p id=\"cQoqJn\">The workers have to mail their ballots back to the NLRB by March 24th, when they’ll be counted by the agency’s regional office. </p><p id=\"8akI9y\">Google spokesperson Jennifer Rodstrom noted in an email to <em>The Verge</em> that the AWU <a href=\"https://www.nlrb.gov/case/14-RC-289222\">petition filed with the NLRB</a> mentions BDS, but not Google. “We have many contracts with both unionized and non-union suppliers, and respect their employees’ right to choose whether or not to join a union, just as we do for these employees of BDS Solutions Group,” Rodstrom wrote in the email. “We expect all our suppliers to treat and pay their employees fairly, whether they are unionized or not.”</p><p id=\"VCTaia\">BDS did not reply to a request for comment on Friday.</p><p id=\"D43AFK\">The workers originally sought to have Google parent company Alphabet and BDS listed as joint employers on their petition to the NLRB, but later changed the petition to include only BDS. </p><p id=\"NSHbCW\">Parul Koul, a software engineer at Google and executive chair of ALU, said the group did not think they’d be able to get recognition from the NLRB for Alphabet’s entire workforce but knew they wanted to include temps, vendors, contractors, and subcontractors as part of their push to organize. </p><p id=\"DV3xBQ\">“All of us at AWU are tremendously proud of the Google Fiber workers for doing the hard job of speaking to each other about their working conditions, organizing their colleagues, and deciding, collectively, to unionize,” Koul said in a statement. “We’re  we’re looking forward to this being the first of many NLRB-recognized bargaining units in the AWU family.” </p><p id=\"Sse0ng\"></p><p id=\"wEfDbY\"></p><p id=\"qSPmOQ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8prPqvLDLzqWV7wMDohjR2zgctU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745893/acastro_180427_1777_0003.jpg",
  "description": "Voting ends March 24th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}