{
  "title": "Google Maps review moderation detailed as Yelp reports thousands of violations",
  "url": "https://www.theverge.com/2022/2/2/22913976/google-maps-moderation-machine-learning-human-review-yelp",
  "date": "2022-02-02T14:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KKJFpZ2-TFFqNnVrxNWExfyj-VA=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70461772/image.0.jpeg\" />    </figure>  <p id=\"bGLRIb\">Google explains how it keeps user-created reviews on Google Maps free of fraud and abuse in a new <a href=\"https://blog.google/products/maps/how-google-maps-reviews-work/\">blog post</a> and <a href=\"https://www.youtube.com/watch?v=TMjezeeGVfY\">accompanying video</a>. Like many platforms dealing with moderation at scale, Google says it uses a mix of automated machine learning systems as well as human operators. </p><p id=\"DFXwnd\">The details come amidst growing scrutiny of user reviews on sites like Google Maps and Yelp, where businesses have been hit with bad reviews for implementing COVID-related health and safety measures (including mask and vaccine requirements) often beyond their control. Other reviews have criticized businesses for supposedly leading them to contract COVID-19 or for not keeping to usual business hours during a global pandemic.</p><p id=\"K0UruK\">Earlier today, <a href=\"https://blog.yelp.com/news/yelp-releases-trust-and-safety-report-2021/\">Yelp reported</a> that it removed over 15,500 reviews between April and December last year for violating its <a href=\"https://www.yelp-support.com/article/How-do-I-remove-a-review?l=en_US\">COVID-19 content guidelines</a>, a 161 percent increase over the same period in 2020. In total, Yelp says it removed over 70,200 reviews across nearly 1,300 pages in 2021, with many resulting from so-called “review bombing” incidents where coordinated reviews are submitted from users who haven’t actually patronized a business.</p><div class=\"c-float-right\"><aside id=\"AMzLip\"><q>“We need both the nuanced understanding that humans offer and the scale that machines provide”</q></aside></div><p id=\"rYIhzt\">Google explains that every review posted on Google Maps is checked by its machine learning system, which has been trained on the company’s content policies to weed out abusive or misleading reviews. This system is trained to check both the contents of individual reviews, but it’ll also look for wider patterns — like sudden spikes in one- or five-star reviews — both from the account itself, as well as other reviews on the business.</p><p id=\"iwViCs\">Google says that human moderation comes into play for content that’s been flagged by end users and businesses themselves. Offending reviews can be removed, and in more severe cases, user accounts can be suspended and litigation pursued. “We’ve found that we need both the nuanced understanding that humans offer and the scale that machines provide to help us moderate contributed content,” Google’s product lead for user-generated content, Ian Leader, writes.</p><p id=\"Vqqn0W\">It’s an interesting look at the steps Google takes to keep Maps reviews usable. You can read more in the <a href=\"https://blog.google/products/maps/how-google-maps-reviews-work/\">full blog post</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sqyV5buWkfqTMVpObeENUfTWHXw=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23212396/image.jpeg",
  "description": "Featuring a mix of machine learning and human moderation.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}