{
  "title": "Google will start distributing a security-vetted collection of open-source software libraries",
  "url": "https://www.theverge.com/2022/5/17/23097529/google-assured-open-source-software-security-vetted-libraries",
  "date": "2022-05-17T16:44:40.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WDr8tfTEufPnvrfL0LOHt74jnrs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70879226/acastro_180508_1777_google_IO_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"nQ6Nmt\">Google announced a new initiative Tuesday aimed at securing the open-source software supply chain by curating and distributing a security-vetted collection of open-source packages to Google Cloud customers.</p><p id=\"0wrX9r\">The new service, branded Assured Open Source Software, was introduced in a <a href=\"https://cloud.google.com/blog/products/identity-security/introducing-assured-open-source-software-service\">blog post</a> from the company. In the post, Andy Chang, group product manager for security and privacy at Google Cloud, pointed to some of the challenges of securing open-source software and stressed Google’s commitment to open source.</p><p id=\"26fik7\">“There has been an increasing awareness in the developer community, enterprises, and governments of software supply chain risks,” Chang wrote, citing last year’s <a href=\"https://www.theverge.com/2021/12/10/22828303/log4j-library-vulnerability-log4shell-zero-day-exploit\">major log4j vulnerability</a> as an example. “Google continues to be one of the <a href=\"https://opensource.googleblog.com/2020/08/open-source-by-numbers-at-google.html\">largest maintainers, contributors, and users of open source</a> and is deeply involved in helping make the open source software ecosystem more secure.”</p><p id=\"p2Ynif\">Per Google’s announcement, the Assured Open Source Software service will extend the benefits of Google’s own extensive software auditing experience to Cloud customers. All open-source packages made available through the service are also used internally by Google, the company said, and are regularly scanned and analyzed for vulnerabilities.</p><div class=\"c-float-right\"><aside id=\"MGHowm\"><q>“There has been an increasing awareness in the developer community, enterprises, and governments of software supply chain risks.”</q></aside></div><p id=\"j1enz7\">Currently, a list of the 550 major open-source libraries being continuously reviewed by Google is <a href=\"https://github.com/google/oss-fuzz/tree/master/projects\">available on GitHub</a>. While these libraries can all be downloaded independently of Google, the Assured OSS program will see audited versions distributed through Google Cloud — mitigating against incidents where developers intentionally or unintentionally <a href=\"https://www.theverge.com/2022/1/9/22874949/developer-corrupts-open-source-libraries-projects-affected\">corrupt widely used open-source libraries</a>. At present, this service is in early access mode and is expected to be made available for wider customer testing in Q3 2022.</p><p id=\"01RzVi\">The announcement from Google comes as part of an industry-wide drive to improve the security of the open-source software supply chain and one that has also been supported by the Biden administration.</p><p id=\"pcqcEE\">In January, a group of some of the nation’s largest tech companies met with representatives of federal agencies including the Department of Homeland Security and the Cybersecurity and Infrastructure Security Agency <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/01/13/readout-of-white-house-meeting-on-software-security/\">to discuss open-source software security</a> in the wake of the log4j bug. Since then, a recent meeting of the companies involved resulted in a <a href=\"https://techcrunch.com/2022/05/16/white-house-open-source-security/\">pledge of more than $30 million in funding</a> to boost open-source software security.</p><p id=\"CsIPxO\">Besides contributing funding, Google is also putting engineering hours toward keeping the supply chain secure. The company recently announced the formation of an <a href=\"https://blog.google/technology/safety-security/shared-success-in-building-a-safer-open-source-community/\">“Open Source Maintenance Crew”</a> that would work with the maintainers of popular libraries to improve security.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BLAD8BQU4bvCfUrKfizzP7q4zCE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10802091/acastro_180508_1777_google_IO_0003.jpg",
  "description": "Customers will benefit from the tech giant’s extensive auditing experience.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}