{
  "title": "Google sues scammer for ‘puppy fraud’",
  "url": "https://www.theverge.com/2022/4/11/23019726/google-puppy-fraud-aarp-scammer-basset-hound-dog",
  "date": "2022-04-11T13:51:48.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"Crufts 2017 - Day One\" src=\"https://cdn.vox-cdn.com/thumbor/0hydm9xT7o85FMiONF4KG7wz504=/0x23:4000x2690/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70735510/650432264.0.jpg\" />        <figcaption>Photo by Matt Cardy/Getty Images</figcaption>    </figure>  <p id=\"YbAzrw\">On Monday, <a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23381905/1_main.pdf\">Google sued a scammer</a> for allegedly running an online “puppy fraud scheme,” defrauding vulnerable people, including the elderly, out of thousands of dollars with false promises of purebred puppies. </p><p id=\"hplfa2\">The complaint, filed Monday, accuses Nche Noel of Cameroon of using a network of fake websites, Google Voice phone numbers, and Gmail accounts to pretend to sell purebred basset hound puppies to people online. In one instance, a victim paid Noel $700 in “electronic gift cards” to purchase a puppy. After sending the gift cards, Noel continued to string along the victim, telling them that the delivery company needed an additional $1,500. According to the complaint, the puppy never arrived. </p><div class=\"c-float-right\"><aside id=\"035zxK\"><q>“Sadly, this scam disproportionately targeted older Americans”</q></aside></div><p id=\"nZ90ie\">“The actor used a network of fraudulent websites that claimed to sell basset hound puppies — with alluring photos and fake customer testimonials — in order to take advantage of people during the pandemic,” Mike Trinh, Google’s senior counsel, wrote <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__blog.google_technology_safety-2Dsecurity_hounding-2Dscammers-2Dlitigation_&amp;d=DwMFaQ&amp;c=7MSjEE-cVgLCRHxk1P5PWg&amp;r=HNNpVffGdDpwb__vVTedbxA45oxwn1GdeQ8euhDLKmk&amp;m=GNdCoVUnQAewZkahaRJnGJoUkix-4bSbUf9C3tg3UL7oR4ANZhawtkbOsGFGCoTG&amp;s=QyzzOqtceR3btFL_WQ1LBL7dvg8yuQ5koYjzcIMjs_w&amp;e=\">in a Monday blog post</a>. “Sadly, this scam disproportionately targeted older Americans, who can be more vulnerable to cyberattacks.”</p><p id=\"uPQqoE\">Beyond using Google’s services to communicate with victims, Google accused Noel of running a Google Ads campaign to promote the fraudulent websites. </p><p id=\"uzFhzG\">In the complaint, Google says that the AARP, an elderly issues group, alerted the company about the scam last September. Later, in November, the AARP published a report detailing the puppy fraud scams, writing that criminals <a href=\"https://www.aarp.org/money/scams-fraud/info-2021/pet-scammers-pandemic-puppies.html\">were exploiting isolated consumers</a> who were looking for companionship during the height of the COVID-19 pandemic. </p><p id=\"7vszKm\">Online scams skyrocketed during the pandemic as people spent more time on social media. Last April, <a href=\"https://www.ftc.gov/news-events/news/press-releases/2021/04/ftc-testifies-congress-its-work-curb-covid-19-scams-warn-consumers-about-pandemic-related-frauds\">the Federal Trade Commission reported that</a> it had issued over 100 alerts and called for more than 350 companies to remove deceptive claims from the internet. </p><p id=\"47W2Ky\">Google’s lawsuit claims that Noel violated the company’s terms of service in conducting the alleged scam. Google is seeking statutory relief for damages. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lfhPGtXP9SMmfw-DP5OJfcLTY5E=/0x309:4000x2403/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23381722/650432264.jpg",
  "description": "Online fraud skyrocketed during the pandemic.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}