{
  "title": "Google Maps will start estimating tolls and display more details to help you find your way",
  "url": "https://www.theverge.com/2022/4/5/23010726/google-maps-toll-cost-route-navigation-detail-traffic-lights-stop-signs",
  "date": "2022-04-05T16:00:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/G1PPzam3sxFUNjTdswFEs2J6Zh4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70712590/acastro_180427_1777_0003.0.jpg\" />        <figcaption>Illustration: Alex Castro / The Verge</figcaption>    </figure>  <p id=\"legP7M\">Google is announcing a handful of updates to Google Maps, including one that will show toll prices before you start navigating to where you want to go.</p><p id=\"opoGpm\">“We look at factors like the cost of using a toll pass or other payment methods, what the day of the week it is, along with how much the toll is expected to cost at the specific time you’ll be crossing it,” Google said in a blog post. If a toll-free route is available, that will be shown as an option as well. The feature will begin rolling out on Android and iOS for “nearly 2,000” toll roads in the US, India, Indonesia, and Japan this month. The feature will come to more countries “soon.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PFA7UMjbPJ917druacohApT4g9o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23367608/Tolls_gif.gif\">  </figure><p id=\"sYUf0E\">Google is also adding more detail to its navigation maps. “You’ll soon see traffic lights and stop signs along your route, along with enhanced details like building outlines and areas of interest,” the company says. In “select cities,” there will be additional added detail like “the shape and width of a road, including medians and islands.” These improved maps will begin rolling out in the “coming weeks” on Android, Android Auto, iOS, and Apple’s CarPlay software.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ALiERyLi9DH0UuQO13heWp-3Xsk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23368839/Detailed_Navigation_1.png\">      <cite>Image: Google</cite>      <figcaption><em>You’ll soon be able to see traffic lights and stop signs while navigating.</em></figcaption>  </figure><p id=\"raiA4B\">Google Maps users on Apple devices are getting some targeted updates as well. There will be a new widget for the iOS app that lets you access trips pinned to the Go tab, and it will be available in the coming weeks. The Google Maps Apple Watch app will also let you get directions to any of your Google Maps shortcuts — places like Home and Work — just by tapping the shortcut on your watch. (Previously, you needed to start those trips from the iOS app.) This feature will roll out starting in “a few weeks.” </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/d0C9pQeEmonnA-8qV6TxYdvvzZk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23368825/apple_watch_widget.png\">      <cite>Image: Google</cite>      <figcaption><em>Start a trip home right from your watch.</em></figcaption>  </figure>",
  "image": "https://cdn.vox-cdn.com/thumbor/8prPqvLDLzqWV7wMDohjR2zgctU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745893/acastro_180427_1777_0003.jpg",
  "description": "New Google Maps details can help you find where to turn.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}