{
  "title": "Google updates Android Auto to better fit all the different sized touchscreens in cars today",
  "url": "https://www.theverge.com/2022/5/12/23067090/google-android-auto-update-io-car-touchscreens-size",
  "date": "2022-05-12T16:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pPE0Q1yogyqf_MqWhUSQxyqq8pA=/125x0:1475x900/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861451/Ah5CCSOKrbqtmVWAeX7uKbI1Q1vQTcSM5Hp1Zr0B6uFBr6R7jHOu1sqho0zvwdN8h2cFZpTm8FtwdJX9U34D8iLJMZXfHa_tahJVseFYm08Fsk_clY0JADUpmLub791P1nN1qNG2EKADLrOJEVter5k.0.jpeg\" />    </figure>  <p id=\"vCuMAI\">Android Auto is getting another refresh, this time with a focus on the evolving nature of vehicle touchscreens. </p><p id=\"ob8isl\">Google says the new split-screen display will be standard for all Android Auto users, allowing them to access key features like navigation, media player, and messages — all from one screen. Previously, the split-screen display was only available to owners of certain vehicles. Now, it will be the default user experience for all Android Auto customers. </p><p id=\"AhWHnH\">“We used to have a different screen mode that was available in a very limited amount of cars,” said Ron Lopez, lead product manager at Android Auto. “Now this is available no matter what type of display you have, what size, what form factor, and it’s a really, really exciting update.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_4nSmdKWB3HC2XcQO5OXZE1-eD4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23455732/7Gk8z2aoFWL5LeZzuq_FNlZw4MjLX2QCtT64cWgLtZMuR7A2oV3IWX77qFxKQGNXwNNRhPRDYG1SOU8eUDEW1hTMtGTNN9SKhG6KU_MrJi0Aephp5ZyNFhVaK9_zQ8_O0_KkbvCQk5gYpXK34jDYmYc.jpeg\">  </figure><p id=\"AFnhCH\">Android Auto will also adapt to any type of touchscreen, no matter what size. Automakers are starting to get creative with the size of their infotainment display, installing everything from large portrait-style screens to long vertical ones shaped like surfboards. Google says that Android Auto will now conform seamlessly to all of those varieties. </p><p id=\"ldDxaI\">“We’ve seen some really interesting innovation from the industry, going to these very large portrait displays going into these extremely wide landscape displays,” Lopez said. “And you know, the coolness is Android Auto will now support all of them, and will be able to adapt, giving you all of these features at your fingertips as a user.”</p><div class=\"c-float-right\"><aside id=\"zXKPtZ\"><q>“We’ve seen some really interesting innovation from the industry”</q></aside></div><p id=\"MuxXSY\">Lopez acknowledged that screens in cars are getting bigger, especially in luxury vehicles like the Mercedes-Benz EQS, with its 56-inch wide Hyperscreen (which is actually three separate screens embedded in one pane of glass), or the Cadillac Lyriq’s 33-inch LED infotainment display. He said that Google has been partnering with automakers to better adapt Android Auto to this trend. </p><p id=\"v6oXqV\">“That was part of the new motivation behind this redesign, was being able to adapt our product better to these vehicles that are coming out with these massive portrait displays and massive widescreen displays,” Lopez said. “And so our approach has been working really closely with these OEMs [original equipment manufacturers] to make sure that things make sense and they work.”</p><p id=\"iDG0X4\">As the screens get bigger, the likelihood that drivers will get more distracted by their displays also grows. A recent <a href=\"https://trid.trb.org/view/1694794#:~:text=Self%2Dreported%20data%20suggested%20that,Android%20Auto%20and%20Apple%20CarPlay.\">study</a> found that drivers selecting music with Apple CarPlay or Android Auto had slower reaction times than those who were high from smoking pot. <a href=\"https://www.theverge.com/2018/11/29/18117046/android-auto-new-features-updates-music-playback-messaging-safer-less-distraction\">Google has been trying to work its way through this problem</a> for several years now, but they have yet to arrive at a definitive solution.</p><p id=\"QtREAy\">Lopez said that safety is “top of mind” for the Android Auto product team, which motivates them to work closely with OEMs to ensure that the experience is fully integrated into the car’s design to minimize distraction. </p><p id=\"eUWnih\">In addition to adapting to different sized screens, Google is also rolling out several other updates. Users will now be able to respond to text messages with standardized replies that they can send with just one tap. </p><p id=\"GBrZwz\">There are also more entertainment options. Android Auto will now support Tubi TV and Epix Now streaming services. And Android phone owners can cast their own content directly onto their car’s screen. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dpabrh1fYVGXmAhtrssyb5bSDdE=/0x31:1600x869/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23455730/Ah5CCSOKrbqtmVWAeX7uKbI1Q1vQTcSM5Hp1Zr0B6uFBr6R7jHOu1sqho0zvwdN8h2cFZpTm8FtwdJX9U34D8iLJMZXfHa_tahJVseFYm08Fsk_clY0JADUpmLub791P1nN1qNG2EKADLrOJEVter5k.jpeg",
  "description": "Hyperscreens and large portrait displays alike.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}