{
  "title": "Google’s Privacy Sandbox ad-tracking overhaul clears major regulatory hurdle",
  "url": "https://www.theverge.com/2022/2/11/22814204/google-chrome-third-party-cookies-privacy-sandbox-uk-competition-and-markets-authority-regulator",
  "date": "2022-02-11T08:45:41.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_jdezt6pO1Z-Nwbxup4_LhvSan0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70496596/acastro_180427_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"zezcHD\">Google’s plan to <a href=\"https://www.theverge.com/2021/6/24/22547339/google-chrome-cookiepocalypse-delayed-2023\">phase out third-party cookies</a> and replace them with a bundle of new standards referred to as the “Privacy Sandbox” just overcame a key regulatory hurdle. The UK’s competition regulator, the Competition and Markets Authority (CMA), has formally accepted Google’s commitments about how it’ll develop the new standards so they don’t harm competition or unfairly benefit the search giant’s own advertising business, the <a href=\"https://www.gov.uk/government/news/cma-to-keep-close-eye-on-google-as-it-secures-final-privacy-sandbox-commitments\">regulator announced today</a>.</p><p id=\"uzs2Ic\">Google’s plans are still in flux, and it’s not yet clear exactly what technologies Privacy Sandbox will use to replace third-party cookies. Just last month, <a href=\"https://www.theverge.com/2022/1/25/22900567/google-floc-abandon-topics-api-cookies-tracking\">Google abandoned one planned approach, FLoC</a>, in favor of a new system called Topics API. Today’s approval is for Google’s <em>approach</em>, rather than any one specific technology. The regulator notes that in the next phase it will “supervise Google to ensure the Privacy Sandbox is developed in a way that benefits consumers.”</p><p id=\"V18urd\">Now that they’ve been formally accepted, Google’s commitments become legally binding, and the search giant has said it’ll apply them globally. The commitments include developing the Privacy Sandbox proposals transparently, and to publish test results. Google has also said it won’t remove third-party cookies until the CMA is satisfied that the new alternatives don’t raise competition concerns, and Google has also said it won’t unfairly share data within its business to gain an advantage over competitors.</p><div class=\"c-float-right\"><aside id=\"9TJjNf\"><q>“We will keep a close eye on Google as it continues to develop these proposals”</q></aside></div><p id=\"yqgWvE\">“The commitments we have obtained from Google will promote competition, help to protect the ability of online publishers to raise money through advertising and safeguard users’ privacy,” the CMA’s chief executive Andrea Coscelli said in a statement. “While this is an important step, we are under no illusions that our work is done. We will keep a close eye on Google as it continues to develop these proposals.”</p><p id=\"08nofM\">The proposals have been controversial, with critics claiming that they could entrench Google’s dominance of the digital advertising market and make it harder for online publishers and other advertising companies to make money. As a result, at the beginning of 2021 the CMA said it would be <a href=\"https://www.gov.uk/government/news/cma-to-investigate-google-s-privacy-sandbox-browser-changes\">formally investigating the proposals</a>, and later started <a href=\"https://www.theverge.com/2021/6/14/22532862/google-uk-regulator-competition-and-markets-authority-privacy-sandbox-floc\">working with Google</a> directly to design and develop them in a way that wouldn’t harm competition.</p><p id=\"emTHmh\">The result of the collaboration was a <a href=\"https://blog.google/around-the-globe/google-europe/update-our-privacy-sandbox-commitments/\">series of commitments from Google</a>, which the CMA <a href=\"https://www.gov.uk/government/news/cma-secures-improved-commitments-on-google-s-privacy-sandbox\">provisionally approved in late November</a>. Google will appoint a CMA-approved monitoring trustee who will have access to Google’s systems to verify it’s not unfairly harming rivals. Last June, Google said it would not use first-party data collected from Chrome or Android to track users across the web after third-party cookies are phased out, the <a href=\"https://www.ft.com/content/6e0e3776-0f85-43b8-94ac-1b906c330c2d\"><em>Financial Times</em> previously noted</a>.</p><p id=\"Pb5B1W\">Problems with Google’s approach have already led it to abandon one of its ideas for replacing third-party cookies called FLoC, or Federated Learning of Cohorts. In January the company <a href=\"https://www.theverge.com/2022/1/25/22900567/google-floc-abandon-topics-api-cookies-tracking\">proposed an alternative called Topics API</a>, which attempts to pinpoint five of your interests, and store them in your browser. Critics claimed that FLoC could have created privacy risks, and competing browsers <a href=\"https://www.theverge.com/2021/4/16/22387492/google-floc-ad-tech-privacy-browsers-brave-vivaldi-edge-mozilla-chrome-safari\">including Edge and Firefox refused</a> to use it.</p><p id=\"51vk2u\">Google’s Chrome won’t be the first browser to phase out third-party cookies (others like <a href=\"https://www.theverge.com/2020/3/24/21192830/apple-safari-intelligent-tracking-privacy-full-third-party-cookie-blocking\">Safari</a> and <a href=\"https://www.theverge.com/2019/9/3/20848629/firefox-69-block-third-party-tracker-default-enhanced-tracking-protection-android-windows-mac-os\">Firefox</a> already block them by default), but Chrome’s dominate market share means it’s likely to have the largest impact on the digital advertising market. The current plan is to block third-party cookies by default <a href=\"https://www.theverge.com/2021/6/24/22547339/google-chrome-cookiepocalypse-delayed-2023\">by the end of 2023</a>. </p><p id=\"7zHH2p\"></p><p id=\"vq0dio\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zecX0cPldoJGxd8xivCIx07sXlA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745895/acastro_180427_1777_0001.jpg",
  "description": "As the search giant pushes ahead with its cookie phase-out.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}