{
  "title": "Google disables Maps traffic data in Ukraine to protect citizens",
  "url": "https://www.theverge.com/2022/2/28/22954426/google-disables-maps-traffic-data-in-ukraine-to-protect-citizens",
  "date": "2022-02-28T10:22:03.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"UKRAINE-RUSSIA-CONFLICT\" src=\"https://cdn.vox-cdn.com/thumbor/XE9EORtlbrDZYBgYlII3xtsNILI=/4x0:4617x3075/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70559021/1238803596.0.jpg\" />        <figcaption>Ukrainian Territorial Defence fighters patrol the streets after the fight in Kharkiv on February 27, 2022 | Photo by SERGEY BOBOK/AFP via Getty Images</figcaption>    </figure>  <p id=\"HirNwq\">Google has temporarily disabled live traffic features offered by Google Maps in Ukraine to protect users’ safety as the country is invaded by neighboring Russia. </p><p id=\"XU7s2t\">The features use anonymous location data collected from Android smartphones to show where there are traffic delays on roads and which businesses and stores are busy. Experts say such data could offer insight into the progress of the invasion. One open source intelligence (OSINT) expert said he saw <a href=\"https://twitter.com/ArmsControlWonk/status/1496657816740036616?\">signs of the Russian invasion</a> early last Thursday after spotting unusual “traffic jams” at the Ukrainian border on Google Maps. </p><p id=\"uGbbBV\">“I think we were the first people to see the invasion,” OSINT expert, Professor Jerry Lewis of the Middlebury Institute, <a href=\"https://www.vice.com/en/article/xgd7dd/google-maps-live-traffic-showed-the-russian-invasion-of-ukraine\">told <em>Motherboard</em></a> last week. “And we saw it in a traffic app.”</p><p id=\"XmRmth\">Google said the decision to disable these features was made to protect local users’ safety after consultation with Ukrainian authorities, report <a href=\"https://www.reuters.com/article/ukraine-crisis-alphabet-idCAKBN2KX036\"><em>Reuters</em></a> and <a href=\"https://www.vice.com/en/article/5dgjka/google-maps-ukraine-live-traffic-russia-invasion\"><em>Vice</em></a>. The features have been disabled from global access, but Google says live traffic information will still be available to drivers using turn-by-turn navigation features in the region. It’s not clear if Google has ever disabled these features during previous conflicts or wars.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SQwXyoS6tMM9AuhpepbpZUwsBak=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23276877/Screenshot_2022_02_28_at_10.07.49.png\">      <cite>Image: Google Maps</cite>      <figcaption><em>Google Maps shows traffic data in many European countries (left) but not in Ukraine (right). </em></figcaption>  </figure><p id=\"ewqUw1\">Location data collected by mapping services often offers these sorts of unexpected insights. For example, when fitness tracking app Strava released a map in 2017 of users’ activity, it accidentally revealed the location of several US military bases, showing where soldiers had been <a href=\"https://www.theguardian.com/world/2018/jan/28/fitness-tracking-app-gives-away-location-of-secret-us-army-bases\">running laps around airfields</a>. Similarly, Snapchat’s geolocation features have been used to <a href=\"https://mashable.com/article/snapchat-breaking-news\">collect images and videos from the frontline</a> in the Iraq War. And with or without location data, information shared in warzones via social media has become a vital tool for open-source investigators, journalists, and others. </p><p id=\"sqzR8J\">Usually, this data has to be combined with other sources to provide reliable info. In the case of the traffic jams spotted outside of Ukraine last Thursday, for example, investigators were already examining the area using satellite imagery. The smartphone data itself probably come from civilians stopped at roadblocks, not soldiers using Android phones. </p><p id=\"7uO3nA\">“I think big data companies often don’t want to face squarely how useful their data can be,” OSINT investigator Lewis <a href=\"https://www.vice.com/en/article/xgd7dd/google-maps-live-traffic-showed-the-russian-invasion-of-ukraine\">told <em>Motherboard</em></a> last week. “I mean, it’s cool when we do it, right? It’s maybe less cool if the Russians were able to do something similar to, you know, spotting an offensive from Ukranians.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_V-0QBHrYfUArsP_H_v_58omMpI=/0x329:4620x2748/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23276853/1238803596.jpg",
  "description": "Google Maps data can inadvertently reveal location of troops and civilians",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}