{
  "title": "Google’s Fitbit Ionic recall doesn’t go far enough, lawsuit says",
  "url": "https://www.theverge.com/2022/5/2/23054210/fitbit-ionic-recall-burns-wearable",
  "date": "2022-05-02T23:29:03.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H_NQDm8RbVQOQb-oyp0buEX_bUE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70824870/vpavic_170925_2023_0207.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"clCYNe\">In March, Google announced it was <a href=\"https://www.theverge.com/2022/3/2/22957989/fitbit-ionic-recall-burns-smartwatch-fitness-tracker-refund\">voluntarily recalling 1.7 million Fitbit Ionic smartwatches</a> following reports of 78 burns. Now, a recently filed <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.scribd.com%2Fdocument%2F572566908%2FCase-5-22-cv-02638-SVK&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F2%2F23054210%2Ffitbit-ionic-recall-burns-wearable\" rel=\"sponsored nofollow noopener\" target=\"_blank\">lawsuit</a> says the recall didn’t go far enough, claiming that the same defect affects all of Google’s Fitbit devices. </p><p id=\"S4uNFE\">According to the court documents, all Fitbit smartwatches and fitness trackers share the same defect — a tendency to overheat, thereby causing burns or creating fire hazards. The complaint also accuses Fitbit of trying to deflect blame onto “consumer hygiene” when incidents are reported, and that the recall doesn’t adequately compensate Ionic owners. </p><p id=\"e6TcM9\">“Reasonable consumers,” the complaint reads, “purchase the Products to burn calories — not their skin — and to safely pursue a healthy lifestyle with the aid of a smartwatch.” The lawsuit’s seeking class-action status.</p><p id=\"5SzMuh\">The two plaintiffs in the case had both bought devices from the Versa lineup — a Versa Lite and a Versa 2 — not the Ionic. Additionally, the complaint shows photos of burns from users who had other devices, including the Sense, Versa 3, Blaze, Inspire, and Inspire 2. It also includes multiple accounts of Fitbit owners being ghosted by the company’s customer support.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uKx8LUSVjK62g6c1OzXO0muxTJY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9361157/vpavic_170925_2023_0068.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The Ionic was Fitbit’s first smartwatch in 2017.</em></figcaption>  </figure><p id=\"yiuj81\">The crux of the lawsuit is an allegation that while Fitbit did recall the Ionic, it hasn’t done so for its other devices even though they may also burn users. As a result, customers may be unaware that they are carrying a potential fire hazard. Specifically, the case stokes fears that customers might wear a smartwatch on a flight, not knowing that the battery may be defective. It also notes that while Fitbit offered full refunds to Ionic owners, the company is dragging its feet when it comes to issuing those refunds.</p><div class=\"c-float-right\"><div id=\"1ZpNDF\"><div data-anthem-component=\"aside:11173911\"></div></div></div><p id=\"AQSq46\">I can’t say I’m terribly surprised to see these allegations. While I have never experienced the issue while reviewing Fitbit’s devices, I’ve seen multiple complaints pop up on Reddit and other social media platforms over the years, where various Fitbit products allegedly <a href=\"https://www.reddit.com/r/fitbit/comments/g39p19/anyone_else_ever_have_this_problem_burn_marks/\">burned</a> <a href=\"https://www.reddit.com/r/fitbit/comments/e3p56y/fitbit_versa_2_burned_my_wrist/\">or</a> <a href=\"https://www.reddit.com/r/fitbit/comments/tn7ml2/fitbit_burned_me_physically_now_theyre_just/\">irritated</a> users’ skin. While anecdotal, many of those accounts also referenced Fitbit taking months to issue refunds or even respond. </p><p id=\"0qAcBW\">The court documents similarly include several screenshots of replies to the @FitbitSupport Twitter where customers were frustrated with l<a href=\"https://twitter.com/search?q=fitbit%20ionic%20recall&amp;src=typed_query\">ong waits and unresponsive customer service</a> while trying to get refunds for the recently recalled Ionic. We’ve also independently heard from a tipster that the Ionic recall process has been slow going. </p><p id=\"CRt4VK\">Fitbit didn’t immediately respond to a request for comment.</p><p id=\"36UGOQ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VTZcenxqJhLRgNf5Mhnn7XFEX6s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9361181/vpavic_170925_2023_0207.jpg",
  "description": "Plaintiffs claim the issue isn’t limited to the Ionic, either",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}