{
  "title": "Google’s changing its performance reviews to waste less time",
  "url": "https://www.theverge.com/2022/5/5/23058790/google-employee-performance-review-changes-ratings-pay",
  "date": "2022-05-05T19:24:37.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IQG7ax8kCRZc34OsS3_I0w32Zdc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70836791/acastro_201005_1777_googleAntiTrust_0001.0.0.jpg\" />        <figcaption><em>The number of annual reviews is being cut in half.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"DbuR7l\">Google is hoping to make its performance reviews less of a burden to employees by making it so they only happen once a year instead of twice a year, requiring less paperwork, and changing the way employees are rated. According to <a href=\"https://www.theinformation.com/articles/google-overhauls-performance-review-system-after-employee-criticism\">a report from <em>The Information</em></a>, 47 percent of Google employees didn’t think that their time was well spent with the previous performance review system.</p><p id=\"OoFbHj\">It’s often hard to point to how internal changes can affect end users, but Google, as a company, has a reputation for either <a href=\"https://killedbygoogle.com\">pulling the plug on products</a> or letting them wither without getting proper attention. At some point, though, actual humans had to work on those projects — it’s always possible that if employees can focus on their actual jobs instead of having to worry every few months about proving they deserve a raise, we could see Google products getting more of the support they deserve.</p><p id=\"ARiIAa\">(Plus, of course, it’s good to know that workers aren’t having a bad time when their labor benefits us.)</p><div class=\"c-float-right\"><aside id=\"L6FiX0\"><q>Google will look at how much of an impact employees make</q></aside></div><p id=\"ZqIGfj\">According to <a href=\"https://buildyourfuture.withgoogle.com/resources/grad/\">a public site</a>, Google’s switching to its new system this month. It calls it GRAD, which stands for Googler Reviews and Development. The page explains that employees will still check in with their managers throughout the year to get feedback and plan career development but that they’ll only receive performance ratings once a year. Google says that its new scale will “reflect the fact that most Googlers deliver significant impact every day.”</p><p id=\"VOjGRt\">According to <em>The Information</em>, the whole system is based on the impact employees make with rankings ranging from “not enough impact” to “outstanding” or “transformative” impact. Significant impact is right in the middle. </p><p id=\"Sd69uu\">This isn’t necessarily how many other ranking systems work. For example, Microsoft used to use a “stacked” ranking system, where management had to designate specific amounts of employees as over and underperforming. At the time, former employees said that it made their work feel like a competition; instead of focusing on what would make the product best, they had to focus on what would make them <em>look</em> the best compared to their co-workers. Microsoft <a href=\"https://www.theverge.com/2013/11/12/5094864/microsoft-kills-stack-ranking-internal-structure\">overhauled its performance review system in 2013</a>, doing away with ratings so it could focus on impact and growth.</p><p id=\"uRFINy\">There are harsher systems, too. In 2021, it was reported that Amazon aims to weed out about 6 percent of its employees per year through <a href=\"https://www.theverge.com/2021/7/9/22570579/amazon-performance-focus-plans-hidden-employees\">an opaque system of performance improvement plans</a>. Employees reported not being told that they would have to make improvements if they wanted to stay with the company.</p><p id=\"dIBvtP\">For its part, Google says that, while it’s cutting back the number of performance reviews, it’ll still do promotions twice a year. Pay has been something of a controversial topic among some employees at the company recently. In an all-hands meeting late last year, Google’s VP of compensation said that the company <a href=\"https://www.theverge.com/2021/12/10/22828132/google-employee-wages-inflation-2021-record-profits\">wouldn’t do across-the-board</a> raises to keep up with inflation. Rising costs have <a href=\"https://www.vox.com/22996474/inflation-federal-reserve-nairu-ngdp-powell\">only gotten worse since then</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FHowdxcJPhQZgeW6733HUvOgA8U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21938024/acastro_201005_1777_googleAntiTrust_0001.0.jpg",
  "description": "It could be good for users and employees alike.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}