{
  "title": "Google’s tweaking the Play Store to make it better for tablets and folding phones",
  "url": "https://www.theverge.com/2022/3/17/22982161/google-play-store-big-screen-tablets-chromeos-games",
  "date": "2022-03-17T17:53:57.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/855QUTc4S2SXsPbC5a3NBJ6KSBc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70636713/acastro_191014_1777_google_pixel_0004.0.0.jpg\" />        <figcaption><em>The company’s been focusing a lot on big screens lately...</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"pazqKG\">Google is making some tweaks to the Play Store to make it easier for people with big screen devices to find apps that’ll take advantage of the display real estate. According to <a href=\"https://android-developers.googleblog.com/2022/03/helping-users-discover-quality-apps-on.html\">a post on its Developers blog</a>, the company has some changes planned for how apps are ranked and promoted, how reviews are displayed, and the alert messages you might see if you’re browsing apps on a tablet, foldable, or Chromebook.</p><p id=\"OV2su3\">In the post, Google says that it will update how the Play Store ranks and features apps on big-screen devices, with the logic taking account of factors like the support of different device orientations, keyboard support, and more. The company says that the change, which will take place “in the coming months,” is meant to “prioritize high-quality apps and games” and help make sure the first apps people find are ones that will work well on their device.</p><div class=\"c-float-right\"><aside id=\"PzusPk\"><q>Google’s been giving large screen devices a lot of love lately</q></aside></div><p id=\"hmYvxE\">Google’s post also mentions that the Play Store will start showing people reviews and ratings from devices in the same category — e.g., phone users will see reviews left by other phone users, tablet users will see reviews left by tablet users, and so on, so they can get a better idea of how well the app will work on their type of device. The company <a href=\"https://www.theverge.com/2021/8/23/22638189/google-play-store-app-review-changes-country-device-type\">announced this change was coming</a> last summer, but it’s good to hear that it’s still being worked on. Google says developers can see which reviews and ratings a user with a specific device will see in the Play Store console. </p><p id=\"th2k09\">Finally, Google says it’ll be changing the alerts for apps that don’t meet compatibility requirements to make sure big screen device users know how something will run after they install it. Its post is vague on what this actually means, saying that it’ll “provide additional communications on this change” later this year. </p><p id=\"DbITCs\">Google has been giving tablets and larger-screen phones a lot of attention recently. Its <a href=\"https://www.theverge.com/2022/3/7/22965155/android-12l-update-release-devices-lenovo-microsoft-samsung-google\">Android 12L update</a> is focused on improving the big-screen experience with changes to the notification and Quick Settings shades and the addition of a taskbar. There have also been some <a href=\"https://www.theverge.com/2022/1/28/22904891/google-android-tablets-focus-rich-miner-cto\">interesting developments</a> at its Platforms and Ecosystems team, where one of Android’s original founders is working on developing Android for large screens.</p><p id=\"mqGIfD\">Google’s push on big screen devices is interesting, given that it makes no tablets, no folding phones, and <a href=\"https://www.theverge.com/2019/10/25/20931476/google-pixelbook-go-review-the-price-of-simplicity\">all of one Chromebook</a> (which was introduced in 2019). Of course, it’s got plenty of partners that make them, but if I were in the business of predicting what a company was working on, I think my ears would be perked up at this point. There are rumors of <a href=\"https://www.theverge.com/22735454/google-foldable-phone-pixel-fold-pixel-6-samsung\">an upcoming Pixel foldable</a>, and maybe that’s all we’ll see — but maybe Google will make Android so good for tablets that it’ll just <em>have</em> to make one of its own.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9FEQvhbrbKEau-PYlMIcpzSWt-8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19287011/acastro_191014_1777_google_pixel_0004.0.jpg",
  "description": "Google’s been giving tablets some love lately.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}