{
  "title": "Google Meet is getting in-meeting emoji reactions and a picture-in-picture mode",
  "url": "https://www.theverge.com/2022/3/31/23002320/google-workspace-meet-emoji-reactions-picture-in-picture-livestream-youtube-spaces",
  "date": "2022-03-31T16:00:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Rl5grXzxLdPjmw5lQPBprSW_8_8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70694317/acastro_180427_1777_0003.0.jpg\" />        <figcaption>Illustration: Alex Castro / The Verge</figcaption>    </figure>  <p id=\"G5zX9W\">Google is announcing a whole bunch of Workspace updates intended to improve virtual collaboration. But as a <a href=\"https://www.theverge.com/21327599/how-to-make-emoji-yawning-face-waffle-proposal-unicode\">big fan</a> <a href=\"https://twitter.com/jaypeters/status/1415679948442914818\">of emoji</a>, I have to say the new feature I’m most excited about is in-meeting emoji reactions in Google Meet.</p><p id=\"zgxpdY\">With these reactions, you’ll be able to drop emoji like a heart or a thumbs-up to show how you’re feeling during a meeting. The emoji will show up in video tiles or in a list that floats up on the side of your screen. Here’s a GIF from Google that gives an idea of what to expect:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YINFkfICTtvasujynNJM2KbbCrA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23354092/Meet_Reactions_EndlessLoop.gif\">  </figure><p id=\"wo2NKM\">Zoom has a similar feature that I find really useful. It’s a great tool to indicate how I’m feeling about something without having to unmute and disrupt an entire meeting, and I think they’ll be handy in Meet as well. Google says these in-meeting reactions will roll out in April. </p><p id=\"SXgJhu\">Google is also adding a picture-in-picture mode to Meet, which could be a useful feature to let you see who’s speaking even when you aren’t in the active Meet tab. This will be available starting in April when you’re using Meet in the Chrome browser.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AQV83m6V-XvvD_w_c-u2nc-m8Ak=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23354166/Google_Meet_PiP_v04___5mo_.gif\">  </figure><p id=\"ED986T\">If you want to see people more easily while you’re working on a Google Doc, Sheet, or Slide, you’ll soon be able to start or bring a Meet call to one of those applications, where you’ll see meeting participants right next to what you’re working on. This feature will be available in the coming weeks. And if you’ve wanted the ability to livestream Meet calls to YouTube, that will be arriving in the coming months for Enterprise Standard, Enterprise Plus, Education Plus, and Teaching &amp; Learning Upgrade Workspace customers.</p><p id=\"7YHSll\">Google is also planning to add optional end-to-end encryption for Meet conversations later this year for all Workspace customers. Client-side encryption will be available in May for Business Plus, Enterprise Plus, and Education Plus customers.</p><p id=\"LD9PHY\">Meet isn’t the only product getting some improvements; Google is introducing some updates to Spaces, its Slack-like collaboration product, too. One likely welcome feature is in-line threading, which will let you split off conversations into their own thread without clogging up a main channel. In-line threading will be available in the coming weeks. (<a href=\"https://www.theverge.com/2021/7/27/22595603/discord-threads-feature\">Discord recently added threads as well</a>.) And Google is increasing Spaces team size limits to 8,000 people. By the end of this year, that maximum will be 25,000 people.</p><p id=\"hIx4bB\">You can read more about Google’s announcements in <a href=\"https://cloud.google.com/blog/products/workspace/announcing-new-features-in-google-workspace-for-hybrid-work\">this blog post</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8prPqvLDLzqWV7wMDohjR2zgctU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745893/acastro_180427_1777_0003.jpg",
  "description": "Show how you’re feeling with an emoji.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}