{
  "title": "Google’s latest Roboto variant is a font customizable to its core",
  "url": "https://www.theverge.com/2022/5/6/23059186/google-roboto-flex-variable-font-web-design",
  "date": "2022-05-06T19:59:57.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_LEz6sUr2QGNqCV_n2JryBkjr5o=/590x0:2486x1264/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70841050/Screen_Shot_2022_05_06_at_12.17.31.0.png\" />    </figure>  <p id=\"AbCu0K\">As someone who is really into fonts, I know that most people don’t share my passion — but I genuinely think that anyone who cares at all about typography will have some interest in <a href=\"https://material.io/blog/roboto-flex\">what Google announced on Thursday</a>. If you’ve <a href=\"https://www.theverge.com/2015/5/26/8661415/google-roboto-font-typeface-open-source\">ever used anything made by Google</a>, you’ve seen Roboto. Now, Google’s introducing something called Roboto Flex. As the name implies, it’s a version of its famous font that you can tweak and customize in a ton of ways.</p><p id=\"WWzWHt\">I can sense I might be about to lose a lot of people, so let’s try this: here’s a gif showing all the customizable parameters Roboto Flex has. There’s no trickery going on — I’m not changing a raster image with Photoshop or anything. Everything you see is built into the font itself and can be changed as easily as the font size.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wU1v_NzKIWP2rvu1bkatPTEJiFY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441470/Flex_Animated_Image__Large_.gif\">      <figcaption><em>Of course, you can combine as many of these changes as you’d like.</em></figcaption>  </figure><p id=\"bVAvVP\">Pretty cool, right? (If you just said “no” to your computer screen, you have my permission to leave now. This isn’t going to get any more interesting for you.)</p><p id=\"t4tQti\">Basically, what’s happening is that Roboto Flex is a “variable font,” meaning that you don’t have to manually load separate files to make changes to its weight, slant, or other variables. Flex goes further than just the basic changes, though; Google says there are 12 different ways you can tweak it, including changing its width, stroke thickness, and even the heights of ascending and descending stems (like are found on the letters “d” and “p,” respectively).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BSrvxFu4Mhbc5jkNUq4LA8Gk8Ko=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23442915/unnamed_2.jpg\">      <cite>Image: Google</cite>      <figcaption><em>This is all the same font.</em></figcaption>  </figure><p id=\"1jvnIL\">These types of fonts have been around for a while — even Roboto Flex has been <a href=\"https://github.com/googlefonts/roboto-flex\">publicly in the works for a year or so</a>, but it’s cool to see that Google’s making it readily available to anyone that wants to use it.</p><p id=\"N99PAe\">Roboto Flex also has a few other interesting features that aren’t directly related to making it look cool. In <a href=\"https://material.io/blog/roboto-flex\">its blog post</a>, Google says it’s put a lot of balancing into the font to make sure that it looks right at specific sizes, so the text will look properly bold or thin, whether it’s taking up an entire page or is just a teeny footnote. Google’s announcement also gets into how the font’s designers (a studio called Font Bureau) made sure tiny details were right. Apparently, the circles used in the percent symbol are proportionally the same as the numeral 0. That is some hardcore font nerdery, and I love it.</p><p id=\"uZYUms\">What this all means in practice is that designers have a lot of control over how their text ends up looking without having to do a lot of work (assuming the application they’re working with <a href=\"https://v-fonts.com/support\">actually supports variable fonts</a>). It’s also great for web designers who want a standard-looking font that they can tweak to make sure their headings and titles stand out, both from the rest of the text on the page and from other websites. It also doesn’t hurt that, because it’s a Google Font, you can add it to your site with one or two lines of code.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CAuJnGB8CqSY9YZjGr7Ma2WAZXg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23443213/Screen_Shot_2022_05_06_at_12.40.09.png\">      <figcaption><em>It’s easy to import Roboto Flex to use on your website (though I think it would take someone with more advanced Google Font API knowledge than me to navigate the settings).</em></figcaption>  </figure><p id=\"IvJWT6\">Plus... look, this may be going out on a limb here, but I couldn’t help but think about all the fun UI things you could do if this were the font on, say, a phone with a folding display. You know, like the one <a href=\"https://www.theverge.com/22735454/google-foldable-phone-pixel-fold-pixel-6-samsung\">Google’s supposedly working on</a>? It’s easy to imagine visual tricks like the font stretching while you fold open your phone or where text keeps the same proportions when you go from the small front screen to the larger inside screen. That type of thing would be much easier to implement if you’re working with a flexible font and would be really fun to see in practice (and Google’s <a href=\"https://www.theverge.com/22708720/android-12-review-features-pixel-update-software\">all about fun in Android now</a>, right?) </p><p id=\"hOTUz7\">This isn’t the only interesting font Google’s made recently. It also announced a <a href=\"https://www.theverge.com/2022/2/18/22940753/google-roboto-serif-font-typeface-design-easier-reading-retro\">seriffed version of Roboto</a>, which would seem like heresy if it didn’t actually look really nice, and it even <a href=\"https://9to5google.com/2022/04/29/google-noto-emoji-blobs/\">brought back the beloved blobs</a> in its Noto Emoji font. It’s not the only one playing around with variable fonts either — Apple’s <a href=\"https://developer.apple.com/fonts/\">SF Pro</a>, which is used as the default font on pretty much all of its devices, supports variable optical sizes, and Microsoft’s programmer-focused <a href=\"https://github.com/microsoft/cascadia-code\">Cascadia Code</a> supports variable weights.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_Ird6Nrv2sD-YiN9zFEjU8rEsLg=/284x0:2698x1264/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23443116/Screen_Shot_2022_05_06_at_12.17.31.png",
  "description": "Roboto Flex gives you tons of design options.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}