{
  "title": "Google offers employees free electric scooters to get them back to the office",
  "url": "https://www.theverge.com/2022/4/4/23004667/google-unagi-electric-scooter-subscription-return-office",
  "date": "2022-04-04T13:17:25.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/AJXAwNtWPcoE6gQ6jJwYGwtE94s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70707432/jbareham_181112_3077_0009.0.jpg\" />        <figcaption>Photo by James Bareham / The Verge</figcaption>    </figure>  <p id=\"5w1f7Z\">Google is preparing to bring its employees <a href=\"https://www.theverge.com/2022/3/2/22958702/google-bay-area-employees-return-to-office-april-hybrid\">back to the office this week</a>, and as an added bonus, it’ll be offering them free electric scooters to help ease the transition. </p><p id=\"ypvNeb\">The tech giant is teaming up with e-scooter maker Unagi to launch a new program called “Ride Scoot,” in which most of Google’s US-based workers can get reimbursed for the full cost of a monthly subscription to Unagi’s stylish Model One scooter. The Model One, which retails for $990, is a lightweight dual-motor scooter with a top speed of 20mph and a range of 15.5 miles. </p><p id=\"Ap4Olw\">Unagi founder and CEO David Hyman said the idea was to help Google employees get to work — or even just to the closest bus stop. (Google famously provides <a href=\"https://www.businessinsider.com/google-cafeteria-sf-shuttle-buses-operating-again-july-12-2021-6\">free shuttle bus service</a> to its employees in Silicon Valley.)</p><p id=\"Pgw1Sa\">“They know there’s apprehension amongst employees,” Hyman said. “People got really accustomed to working from home. And they’re just trying to do everything they can to improve the experience of coming back.” (A spokesperson for Google did not respond to a request for comment.)</p><div class=\"c-float-right\"><aside id=\"f027dr\"><q>“People got really accustomed to working from home”</q></aside></div><p id=\"dH4F9C\">Two years after the pandemic upended work patterns, employers are doubling down on office real estate, bringing them into conflict with a workforce that has grown accustomed to working at home. Google spent billions on expanding its footprint over the course of the pandemic, a sign that it is bullish about employees eventually returning to work. And just in case it runs into any friction, Google has shown a willingness to spend money on perks to entice workers back. </p><p id=\"x7X73L\">Google has landed on free scooters as one possible incentive and has found a willing partner in Unagi. In addition to raising over $10 million in venture capital funding last year, the Oakland-based company also <a href=\"https://www.theverge.com/2021/3/17/22334608/unagi-electric-scooter-subscription-expansion-cities-price\">launched a subscription</a> as an <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Funagiscooters.com%2Fpages%2Funagi-all-access-scooter-subscription&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F4%2F23004667%2Fgoogle-unagi-electric-scooter-subscription-return-office\" rel=\"sponsored nofollow noopener\" target=\"_blank\">alternative to ownership</a>. For $49 a month, customers in select cities can get one of <a href=\"https://go.redirectingat.com/?xcust=___vg__p_21116593__t_w__r_google.com__d_D&amp;id=66960X1514734&amp;xs=1&amp;url=https://unagiscooters.com/products/the-scooter&amp;referrer=theverge.com&amp;sref=https://www.theverge.com/2020/8/5/21352552/unagi-electric-scooter-subscription-price-cities\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Unagi’s Model One</a> delivered to their front door. There’s also a $50 sign-up fee, but maintenance and insurance from scooter theft or damage are included in the monthly fee.</p><p id=\"Ji0yZI\">Unagi won’t just be handing out free scooters to every Google employee, though. Unagi plans on setting up booths at various Google offices to sign up employees for a monthly scooter subscription at the discounted rate of $44.10 per month, plus the $50 enrollment fee — the total of which will be fully reimbursable by Google. Scooter subscriptions will also be added as a transportation option to Google’s internal employee portal. And Google and Unagi will host demo days for employees to try out the Model One at various office locations. </p><div class=\"c-float-right\"><aside id=\"b91z04\"><q>Employees must also use the scooter for at least nine commutes per month to get fully reimbursed for their monthly subscription</q></aside></div><p id=\"bMm7sl\">Employees must also use the scooter for at least nine commutes per month to get fully reimbursed for their monthly subscription. (Google plans on using the honor system and won’t be tracking employees’ scooter usage.) In addition to Google’s main headquarters in Mountain View, other eligible locations include Seattle, Kirkland, Irvine, Sunnyvale, Playa Vista, Austin, and New York City. </p><p id=\"ZXlQgo\">Hyman said that Unagi has made deals with other large employers, including Salesforce, to add electric scooters as a possible transportation perk for employees, either as a reimbursement or at a discounted rate. He is also working with a number of hotels and residences to place Unagi’s scooters in the lobby for customers. </p><p id=\"s2pCCk\">“What we hope is other companies follow suit,” Hyman said. “We think it’s a great office perk.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EC0Xzc1dxjOAiYuCV71k_ihNVG8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13432083/jbareham_181112_3077_0009.jpg",
  "description": "Google employees are going back to the office.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}