{
  "title": "Google joins Samsung in working with iFixit on a self-repair program",
  "url": "https://www.theverge.com/2022/4/8/23016233/google-pixel-smartphones-ifixit-repair-program",
  "date": "2022-04-08T15:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QvAa248VWcc0c-JdLm2AZxC_sn8=/0x0:1405x937/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70726358/Screen_Shot_2022_04_08_at_9.26.40_AM.0.jpg\" />    </figure>  <p id=\"esZujC\">Google has become the latest manufacturer to partner with DIY repair specialists iFixit to offer spare parts for its devices, the <a href=\"https://www.blog.google/outreach-initiatives/sustainability/pixel-phone-repairs\">search giant announced today</a>. It’s a deal that should make it far easier for the average customer to get parts to repair their own Pixel smartphone if it breaks. Parts like batteries, displays, and cameras will be available to purchase in the US, Canada, Australia, the UK, and other European countries where the phones are sold. Parts will be available to purchase “later this year,” Google says.</p><p id=\"nq4D1E\">Spare parts will be available for an impressive range of Pixel phones, including the latest Pixel 6 devices and going all the way back to 2017’s Pixel 2. That means parts should be available for the kinds of aging phones people might actually want to repair this year. In contrast, <a href=\"https://www.theverge.com/2022/3/31/23004309/samsung-self-repair-service-program-ifixit-right-to-repair-galaxy\">Samsung’s equivalent partnership with iFixit</a> will, at launch, only cover select devices dating back to the 2020 Galaxy S20 (though it says it plans to expand the program over time). </p><div class=\"c-float-right\"><aside id=\"dF2wgf\"><q>Launching “later this year”</q></aside></div><p id=\"Iw19K6\">Easy repairs are essential if Google wants customers to use its devices for as long as it’s planning to support them with software. As of the Pixel 6, <a href=\"https://www.theverge.com/2021/10/19/22735485/google-pixel-6-three-years-android-updates-security-feature\">Google is promising</a> three years of Android updates and five years of security updates, which could see the phones being used into late 2026. At that point, it’s all-but-guaranteed that a phone will need a battery replacement or some kind of repair at least once over its lifetime, which makes easy access to spare parts vital.</p><p id=\"Zu5eur\">Pixel spare parts will be sold both individually as well as in “Fix Kits,” which come with tools to carry out the repairs. If you’d rather not do the repairs yourself, Google already has partnerships with a number of <a href=\"https://support.google.com/pixelphone/answer/10227672?hl=en-GB\">professional repair shops</a>. There are also trade-in and recycling programs available when you no longer want to keep using a device.</p><p id=\"G8ePvE\">The consumer tech industry as a whole has gotten more serious about self-repairs in recent years. As well as Samsung and Google, <a href=\"https://www.theverge.com/2021/12/14/22833120/ifixit-microsoft-surface-repair-tools-partner-professional-service\">Microsoft</a> and <a href=\"https://www.theverge.com/2022/3/4/22962087/ifixit-steam-deck-replacement-parts-summer\">Valve</a> are also working with iFixit to offer spare parts for their Surface devices and Steam Deck, respectively. Even Apple, which has historically <a href=\"https://www.theverge.com/2017/8/3/16087628/apple-e-waste-environmental-standards-ieee-right-to-repair\">made it difficult</a> for customers to repair their own devices, <a href=\"https://www.theverge.com/2021/11/19/22787245/apple-iphone-mac-self-service-program-repair-diy\">announced a self-service repair program</a> late last year. These companies are unlikely to be the last as right to repair legislation gathers <a href=\"https://www.theverge.com/2021/7/21/22587331/right-to-repair-apple-iphone-ftc-lina-khan-open-meeting\">pace</a> around the <a href=\"https://www.theverge.com/2020/11/25/21719701/european-parliament-right-to-repair-resolution-hardware-eu-commission-2021\">world</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DypOuTHAbpT1pPwpjosZBUNcq-8=/0x101:1405x837/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23375848/Screen_Shot_2022_04_08_at_9.26.40_AM.jpg",
  "description": "Spare batteries, displays, and cameras will be available.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}