{
  "title": "Google made a smart lamp that you’ll probably never be able to buy",
  "url": "https://www.theverge.com/2022/2/13/22932202/google-smart-lamp-d-light",
  "date": "2022-02-13T22:51:13.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/cfNBBZ-JhuAmNNrsFim_KoG3rG4=/199x0:1401x801/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70505294/google_d_light_lamp.0.jpeg\" />        <figcaption><em>The dLight comes with built-in support for the Google Assistant.</em> | Image by Google via <a class=\"ql-link\" href=\"https://twitter.com/bengold/status/1491982105332666390\" target=\"_blank\">Ben Gold</a></figcaption>    </figure>  <p id=\"9imPiY\">If you’re in the market for a Google Assistant-supported smart lamp, you’ll be sorely disappointed to know that Google created one, but it’s only for employees, as reported by <a href=\"https://9to5google.com/2022/02/11/google-dlight-lamp/\"><em>9to5Google</em></a>. Google designer Ben Gold tweeted out an image of the lamp, cleverly called the dLight, noting it “will likely never be for sale outside of the company.”</p><div id=\"cc6Ho3\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Google lamp is called the “dLight” and I confirmed that it’s not confidential. Again, this product will likely never be for sale outside of the company. <a href=\"https://t.co/fMmDXdr6Yk\">pic.twitter.com/fMmDXdr6Yk</a></p>— Ben Gold (@bengold) <a href=\"https://twitter.com/bengold/status/1491982105332666390?ref_src=twsrc%5Etfw\">February 11, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"vUUCW8\">The ultra-modern lamp features a circular base and thin post that houses a cylindrical light, and, admittedly, its bright white color almost makes it look like something you’d find at an Apple store. As noted by Gold, you can move the light into different positions, letting you point the light downwards towards your desk or at your face during video calls. It also comes with several lighting presets, as well as the ability to change the temperature of the light.</p><p id=\"vhHVxz\">The lamp’s <a href=\"https://fccid.io/2AVY2GED7\">FCC documents</a> indicate internet connectivity and support for Google Assistant, as <a href=\"https://fccid.io/2AVY2GED7/Label/Label-and-location-5550397\">its label</a> has the “Hey Google” logo stamped on it. And while you can’t see the USB-C port in any of the provided images, Gold says it does come with one, and that it also gets over-the-air updates.</p><p id=\"hN5NOo\">Sadly, those of us who aren’t employed by Google won’t be able to get our hands on the dLight. But as <em>9to5Google</em> points out, this isn’t the first time Google has made an employee-only product — in 2017, <a href=\"https://www.theverge.com/circuitbreaker/2017/4/26/15436544/google-fcc-over-ear-bluetooth-headphones-photos-rumors\">the company developed a pair of Google-branded over-the-ear headphones</a> for its workers.</p><p id=\"8WMNDz\">Gold says employees located in the US can order the dLight for free (although he notes it’s currently on backorder) through the company, as part of Google’s efforts to improve the work from home experience. <a href=\"https://www.theverge.com/2021/12/2/22814879/google-return-to-office-covid-omicron-hybrid-work-plans-2022\">Google’s employees still aren’t obligated to return to the office</a> due to the pandemic.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GIg-HDKQysIJI_xkYij7pXxRkjE=/35x0:1565x801/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23239454/google_d_light_lamp.jpeg",
  "description": "Only employees can get the dLight.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}