{
  "title": "Google Play Store cracks down on outdated apps",
  "url": "https://www.theverge.com/2022/4/7/23014518/google-play-store-cracks-down-on-outdated-apps",
  "date": "2022-04-07T10:22:26.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3EaFmcJoKNuf93QgoREPAOchtQA=/0x0:1197x798/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70720264/Android_New_policy_update_to_strengthen_Google_Play_social.0.jpg\" />        <figcaption>Image: Google</figcaption>    </figure>  <p id=\"yQ6eFU\">Google is preparing to limit the availability of outdated apps on the Play Store, <a href=\"https://android-developers.googleblog.com/2022/04/expanding-plays-target-level-api-requirements-to-strengthen-user-security.html\">the company has announced</a>. From November 1st, all existing apps in the store should aim to target an API level within two years of the latest major Android OS release. If they don’t, Google says it’ll place limits on which users are able to discover or install them.</p><p id=\"06loKP\">The changes are meant to ensure that software available from the Play Store makes use of Android’s latest privacy and security features. Device owners “expect to realize the full potential of all the privacy and security protections Android has to offer,” Google product management director Krish Vitaldevara writes <a href=\"https://android-developers.googleblog.com/2022/04/expanding-plays-target-level-api-requirements-to-strengthen-user-security.html\">in a blog post</a>. “Expanding our target level API requirements will protect users from installing older apps that may not have these protections in place.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tYh8YTFdlnKetBcwrKNfOJO81ko=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23373436/image2.jpg\">      <cite>Image: Google</cite>      <figcaption><em>Apps must target an API level within two years of the latest major Android OS release.</em></figcaption>  </figure><p id=\"W3qV2E\">There are a couple of important caveats to note. First is that the restrictions will only apply when a device is running a version of Android more recent than the app’s API level. So anyone still using an older version of Android OS will still be able to download apps made with their (old) version of Android in mind. Secondly, Google says users will be able to re-download and install any apps they’ve previously downloaded from the Play Store. </p><p id=\"PLzXGQ\">Developers can apply for a six-month extension if their software won’t be ready in time for the November 1st deadline.</p><p id=\"LY0WGc\">Google already has a similar policy in place for new and updated apps that are submitted to the Play Store for review. Currently an app needs to target an API level from within one year of the last major Android OS release in order to be published. What this new policy does is expand coverage to existing, or possibly abandoned apps on the Play Store, rather than just those still receiving updates. </p><p id=\"tKTBIP\">In the past, some surprisingly big names continued to target old Android APIs in an apparent attempt to avoid newer and more restrictive privacy and security policies. In 2017, <a href=\"https://arstechnica.com/gadgets/2017/12/google-fights-fragmentation-new-android-features-to-be-forced-on-apps-in-2018/\"><em>Ars Technica</em> reported</a> that the Facebook app was targeting an API that was two years old at the time, while Snapchat was targeting one that was almost three years out of date. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9fuZoE8kw_iZS-nWvXbX84Pqt9M=/0x86:1197x713/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23373435/Android_New_policy_update_to_strengthen_Google_Play_social.jpg",
  "description": "So apps are using Android’s latest security features.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}