{
  "title": "Google account hacks dropped by half after pushing two-step authentication by default",
  "url": "https://www.theverge.com/2022/2/8/22923618/google-account-hacks-dropped-half-two-step-authentication",
  "date": "2022-02-08T17:27:28.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-6s5LgA0r2e9m_K3rYa44gY_k70=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70484327/acastro_180507_1777_android_privacy_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Eh75IG\">Nudging users toward security works.</p><p id=\"TcOd10\">That’s the top-line finding four months into Google’s initiative to enroll users in two-factor authentication by default, detailed in a <a href=\"https://blog.google/technology/safety-security/safer-internet-day-2022/\">blog post</a> to coincide with Safer Internet Day on February 8th.</p><p id=\"KHhpsS\">In October 2021, the company announced plans to <a href=\"https://www.theverge.com/2021/10/5/22710421/google-security-2fa-inactive-account-management\">turn on two-factor authentication by default</a> for 150 million Google users who were not currently using the service and to require 2 million YouTube creators to use it. In the latest post, Google says it <a href=\"https://blog.google/technology/safety-security/reducing-account-hijacking/\">observed a 50 percent decrease</a> in accounts being compromised among that test user group.</p><p id=\"YrrPuE\">The strategy shows the power of a tech giant like Google to provide security by default and fits into a years-long project to move users toward a more robust security model — eventually aiming at a <a href=\"https://blog.google/technology/safety-security/a-simpler-and-safer-future-without-passwords/\">future without passwords</a>, according to another blog post published by the company last year.</p><p id=\"e9qm63\">Two-factor authentication, or “two-step verification” (2SV) as Google terms it, is a core pillar of this strategy, since account security is significantly increased by the requirement for a physical item like a security key, or phone to receive codes via app or SMS. But historically, the problem has been one of adoption.</p><div class=\"c-float-right\"><aside id=\"qmgAGK\"><q>“There is a lot of educating that needs to happen with 2SV”</q></aside></div><p id=\"Nl97Hs\">In 2018, a Google engineer revealed that more than 90 percent of active Gmail accounts <a href=\"https://www.theverge.com/2018/1/23/16922500/gmail-users-two-factor-authentication-google\">were not using two-factor authentication</a>, prompting questions as to why Google wouldn’t make the two-step authentication process mandatory. Since then, the company has been on a path to make 2SV a default option for a greater share of users and a mandatory step for some.</p><p id=\"427AsK\">According to Google representatives, one of the remaining barriers is a lack of understanding about the full benefits of additional authentication procedures.</p><p id=\"tGKnEy\">“There is a lot of educating that needs to happen with 2SV and we want users to understand what it is and why it’s beneficial,” said Guemmy Kim, director of account security and safety at Google. </p><p id=\"v9LUDA\">“We also need to make sure that users’ accounts are set up correctly with a recovery email and phone number so they can avoid account lockouts once 2SV is enforced. We’ve already enrolled users that we deem to be early adopters and whose accounts were 2SV ready,” Kim said.</p><p id=\"mv2PWt\">Although the number of web services supporting two-factor authentication has grown steadily, consumer adoption still remains low. Twitter, which rolled out two-factor authentication in 2013, revealed in 2020 that <a href=\"https://www.bleepingcomputer.com/news/security/twitter-reveals-surprisingly-low-two-factor-auth-2fa-adoption-rate/\">only 2.3 percent of active accounts had enabled it</a>; at Facebook, the figure was <a href=\"https://www.wired.com/story/facebook-protect-two-factor-authentication-requirement/\">around 4 percent</a> adoption in 2021.</p><p id=\"9t4aoW\">Where adoption exists, the most common 2FA option is to send one-time codes via SMS — which security experts consider the <a href=\"https://www.cnet.com/tech/services-and-software/do-you-use-sms-for-two-factor-authentication-heres-why-you-shouldnt/\">method most vulnerable to interception</a>. Ideally, two-factor authentication should make use of an authentication app, like Google Authenticator or Authy, or a physical device like a <a href=\"https://www.theverge.com/22458935/two-factor-security-key-how-to-yubico\">hardware security key</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RKMb5JFO3Yd3l7QzbvoVevuj9II=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10793469/acastro_180507_1777_android_privacy_0001.jpg",
  "description": "\"There is a lot of educating that needs to happen with 2SV.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}