{
  "title": "Google will let you request fewer ads about weight loss and dating",
  "url": "https://www.theverge.com/2022/4/28/23045673/google-limit-youtube-ads-sensitive-categories-pregnancy-dating-weight-loss",
  "date": "2022-04-28T12:00:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PaRr9dtZTtP_vMwnwqcVPyVb8dc=/0x147:1244x976/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70803748/Screen_Shot_2022_04_27_at_16.54.35.0.png\" />        <figcaption><em>More choices about the ads you see.</em> | Image: Google</figcaption>    </figure>  <p id=\"UgYC8c\">Google is expanding its sensitive ad categories options, letting users limit how many ads they see about dating, pregnancy, parenting, and weight loss, and making those settings apply to more places. The feature was introduced as a way to let people see fewer ads on YouTube about potentially <a href=\"https://www.theverge.com/2020/12/10/22168280/google-ad-policy-gambling-alcohol-ban-limit-monetization\">addictive gambling or alcoholic products</a>, but now it seems that Google is expanding it to cover other potentially uncomfortable or traumatic subjects.</p><p id=\"VxIkEB\">Your settings will now apply to all of Google’s Display network, not just YouTube ads, according to Elijah Lawal, a spokesperson for the company. <a href=\"https://ads.google.com/intl/en_id/home/resources/reach-larger-new-audiences/\">Google says</a> the network is “a group of more than 2 million websites, videos, and apps” that advertisers can target users across. </p><p id=\"lXwjeC\">To access the feature, go to your <a href=\"https://adssettings.google.com/\">Ad Settings</a> page and scroll to “Sensitive ad categories on YouTube.” From there, you can click the “See Fewer” button next to whatever categories you prefer. The page will warn you that you’ll still see the same number of ads overall, and ask you to confirm the choice. You can also “Allow” categories you’ve previously limited in the past.</p><div class=\"c-float-right\"><aside id=\"5GqYfV\"><q>Google isn’t promising a foolproof solution</q></aside></div><p id=\"voRrpS\">Google’s <a href=\"https://support.google.com/ads/answer/10261289?hl=en\">support page for the sensitive ad categories feature</a> does note that, while it should show you fewer ads for products in each category you’ve chosen to limit, the topics may still appear in other ads. It gives the example of “an airline ad featuring someone drinking a glass of champagne.” The company also notes that it “does not allow advertisers to personalize ads based on certain topics, like alcohol and gambling, but you may see ads about these things based on related interests,” such as beer makers targeting sports fans.</p><p id=\"GrPM7v\">While gambling and drinking probably don’t make a ton of appearances in general-audience ads, some of the newly added categories could be trickier to avoid. An ad for gum may <a href=\"https://www.youtube.com/watch?v=NemtQx0m0Ss\">feature people in a relationship</a>, or an ad for razors may <a href=\"https://www.youtube.com/watch?v=7kLypuCI2MU\">bring up the idea of fatherhood</a>. Google’s support page implies that you could still see these types of ads even if you’ve asked to limit them — you just shouldn’t get ads for, say, a dating app or diapers (unless, of course, the video you’re watching has a sponsor spot for those things baked in).</p><p id=\"OKgC6s\">Even with those limitations, it’s good to see that Google’s working to give people “more control over their ads experience,” as the company’s group product manager for ads privacy Karin Hennessy put it in a statement emailed to <em>The Verge. </em>It’s the type of improvement that’s good for Google and its users; you can choose to see fewer ads that potentially make you uncomfortable, and advertisers can better target a receptive audience.</p><p id=\"Td8uBa\">Hennessy also said that Google will “continue to listen to user feedback and study which categories to expand this feature to in the future.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/j9wf3c1RViZzkjdaq7OvpB-0N94=/0x204:1346x909/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23421469/Screen_Shot_2022_04_27_at_16.54.35.png",
  "description": "Google’s expanding on a feature it added in 2020.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}