{
  "title": "Google’s Pixel 6A appears at FCC, hinting at May release ",
  "url": "https://www.theverge.com/2022/4/12/23021861/google-pixel-6a-fcc-may-release-io",
  "date": "2022-04-12T15:23:04.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1GUoQeOGW8vPbzI9Lyo2kSsiGhM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740106/ajohnson_210813_4713_0002.0.jpg\" />    </figure>  <p id=\"9wXkYT\">Last year’s Pixel 5A was <a href=\"https://www.theverge.com/22628205/google-pixel-5a-review-price-screen-battery-specs\">a fantastic product</a>, but like the Pixel 4A before it, the phone’s August release didn’t do it any favors. Google’s original A-series budget phones — the Pixel 3A and 3A XL — shipped around the same time as the company’s I/O conference in May, a more sensible mid-year release that gave them more time to shine before the next flagship Pixel arrived. </p><p id=\"M9wqW5\">But supply chain issues and remote work challenges pushed both the 4A and 5A deep into the summer. Last year’s $449 Pixel 5A wasn’t even sold by any carriers or retailers other than Google itself. </p><p id=\"71fdE8\">However, it seems like Google is getting things back on track in time for the upcoming Pixel 6A. <a href=\"https://www.droid-life.com/2022/04/12/google-pixel-6a-fcc-models/\">As noted by <em>Droid Life</em></a>, the next budget Pixel recently <a href=\"https://apps.fcc.gov/oetcf/eas/reports/ViewExhibitReport.cfm?mode=Exhibits&amp;RequestTimeout=500&amp;calledFromFrame=Y&amp;application_id=bV3YrITVpmfHdmwsfJHpVQ%3D%3D&amp;fcc_id=A4RGX7AS\">passed through the FCC</a>. There’s not of note in the actual filings (other than confirmation that at least one SKU of the 6A will support millimeter-wave 5G), but the timing of the FCC documentation suggests that the phone isn’t far off. The 5A popped up at the FCC in July before its launch a month later. And what do you know: Google’s virtual I/O 2022 conference <a href=\"https://www.theverge.com/2022/3/16/22981868/google-i-o-2022-may-11th-12th-online-virtual\">kicks off on May 12th</a>. </p><p id=\"2F3oGe\">The Pixel 6A is expected to feature a design modeled after the flagship Pixel 6 and Pixel 6 Pro, retaining a similar camera bar on the back. We’ve seen <a href=\"https://www.androidpolice.com/google-pixel-6a-retail-box-leak/\">purported images of its packaging</a>, and some <a href=\"https://www.pocket-lint.com/phones/news/google/160730-google-pixel-6-pro-face-unlock\">early benchmarks</a> indicate it might offer performance that’s similar to the pricier Pixels. I just hope Google can preserve the impressive marathon battery life of the 5A along with its appealing price. It’d also be nice to see the 6A sold in more countries and getting attention from mobile carriers and retailers again. There are multiple versions of the 6A included in the FCC docs, so that’s a good sign for wider distribution.</p><p id=\"6SejIW\">We should know much more about the Pixel 6A in a matter of weeks. Sure beats waiting until August.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bW4IvO287mHq6C_fWcXJQIvaX-A=/0x138:2040x1206/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23027101/ajohnson_210813_4713_0002.jpg",
  "description": "A mid-year launch makes way more sense than summer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}