{
  "title": "Google’s Nest Doorbell can’t take the cold",
  "url": "https://www.theverge.com/2022/2/18/22941018/google-nest-video-doorbell-nest-cam-cold-weather-charging-woes",
  "date": "2022-02-18T18:46:26.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LEJhR2ZX-Bcjq6yrqbwiQXjEYVc=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70526363/dseifert_4748_nest_doorbell_cam_battery_1.0.jpg\" />        <figcaption><em>Google Nest camera users have been complaining about cold-weather charging issues.</em> | Photo by Dan Seifert / The Verge</figcaption>    </figure>  <p id=\"vjkbht\">Has your Google Nest Doorbell been draining its battery faster than normal or stopped working altogether, even when hooked up to your doorbell wires? That’s because it doesn’t like being left out in the cold. A <a href=\"https://support.google.com/googlenest/answer/11830989?hl=en&amp;ref_topic=9360834\">new support page</a> published this week by Google, confirms that Google’s newest smart video doorbell, the <a href=\"https://www.theverge.com/22710545/nest-doorbell-battery-cam-battery-test-review-price-specs-features\">Google Nest Doorbell (Battery)</a>, and its <a href=\"https://www.theverge.com/22710545/nest-doorbell-battery-cam-battery-test-review-price-specs-features\">Google Nest Cam (Battery)</a>, can’t charge at temperatures below 32 degrees Fahrenheit. </p><p id=\"MZ8wA9\">The update comes on the heels of <a href=\"https://www.googlenestcommunity.com/t5/Cameras-and-Doorbells/Cold-weather-concerns-with-Nest-Doorbell-Battery/m-p/65933\">complaints by users in the Google Nest forum</a> that their Nest Doorbells were draining their batteries faster than normal this winter, even when hooked up to doorbell wiring to maintain their charge. Cold weather will also affect the batteries in the new Google Nest Cam. But Google says if the camera is connected to a wired power source (it sells a weatherproof power adaptor for $35), there won’t be any charging issues at lower temperatures, as the wire powers the camera directly.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HqeekfdgJaaS6wZuu0YFVTkwtjw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22902339/dseifert_4748_nest_doorbell_cam_battery_9.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>The Google Nest Cam works off battery power or can be wired to a power adaptor. In the latter case, it will continue to stay powered even in lower temps.</em></figcaption>  </figure><p id=\"HSV8X3\">The reason for the doorbell problem is based on a small but important distinction between battery-powered and “true” wired doorbells. Battery-powered doorbells hooked up to doorbell wires aren’t being powered by your home’s electrical wiring; the battery is being “trickle charged” by the power from the doorbell wiring. If that battery is too cold to hold a charge, it will eventually run down. The same is true if you use a solar panel to keep your Google Nest Cam charged. That trickle charges and doesn’t power the camera directly, so it will run out of juice in the cold, says Google.</p><p id=\"lddJ6L\">While its battery-powered cameras (Nest’s first in the category) can operate in temps as low as -4 degrees Fahrenheit, Google’s new support page now lists a minimum charging temperature of 32 degrees Fahrenheit. The support article states that the battery can still power the device at lower temperatures, but it won’t charge and may drain faster. Google warns that at the minimum operating temperature, the battery could have less than half the life it does in warmer weather.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dJSUrPOyfeN0T41F4b3SpmukijM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22902335/dseifert_4748_nest_doorbell_cam_battery_5.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>You can wire the Google Nest Doorbell to your doorbell wiring, but it will only trickle charge the battery, not power the doorbell camera directly.</em></figcaption>  </figure><p id=\"69sJD8\">So what can you do if you bought a Nest Doorbell and live in a part of the country with sub-freezing temps? Google says you should take the entire doorbell down and bring it inside “to a warm place” to charge (something you likely already do if it’s not hooked up to doorbell wiring). </p><p id=\"votPo5\">If you’re not sure if your device is affected, you can check in the Google Home app where the device will say “charging paused” or “charging slowly” with a long estimated charge time if your doorbell is too chilly.</p><p id=\"FGSo5m\">This is not a problem unique to Nest’s battery-powered cameras. Rechargeable lithium-ion batteries struggle in colder weather. Ring has a <a href=\"https://support.ring.com/hc/en-us/articles/115005939463-Cold-Weather-and-Battery-Powered-Ring-Devices?utm_source=Braze&amp;utm_medium=Email&amp;utm_campaign=CRM4195_ColdWeather_OPEX_RET_US_Q221&amp;utm_content=Variant_1&amp;utm_campaignid=61f1af3846b1c7aab79cd1c6987502ad\">support article on its site</a> detailing how its doorbell and camera batteries are affected when temps drop. However, most Ring cameras have the advantage of swappable, removable batteries that are easier to bring indoors to charge.  </p><p id=\"iZvtUA\">For those of us in warmer climes, Google says not to worry: the Nest camera batteries can still be charged up to 104 degrees Fahrenheit. </p><p id=\"wxD8uo\">​​</p><p id=\"6rkIRJ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/te92P8dVJgLtnAZJjeb1GHm2PFQ=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22902331/dseifert_4748_nest_doorbell_cam_battery_1.jpg",
  "description": "If it's below 32 degrees you’ll have to knock",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}