{
  "title": "Google Docs will start nudging some users to write less dumbly",
  "url": "https://www.theverge.com/2022/4/1/23005972/google-docs-assisting-writing-active-voice-concise-inclusive-language-inappropriate-words",
  "date": "2022-04-01T08:33:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sVwugZrs837a0Cs7ZdD-8P9KdPw=/0x0:1355x903/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70697231/Untitled_4.0.jpg\" />        <figcaption><em>Users will have the option of turning the suggestions off.</em> | Image: Google</figcaption>    </figure>  <p id=\"3e22zO\">Google Docs could soon suggest ways to improve the quality of your writing in addition to fixing straightforward <a href=\"https://www.theverge.com/2018/7/24/17607912/google-docs-grammar-checker-announced\">grammar</a> and spelling errors, the <a href=\"https://workspaceupdates.googleblog.com/2022/03/more-assistive-writing-suggestions-in.html\">company has announced</a>. A purple squiggly line will appear under suggestions to help make your writing more concise, inclusive, active, or to warn you away from inappropriate words. </p><p id=\"M84f10\">These new Google suggestions have long been available via third-party services like <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.grammarly.com%2Fblog%2Fgoogle-docs-beta-chrome%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F1%2F23005972%2Fgoogle-docs-assisting-writing-active-voice-concise-inclusive-language-inappropriate-words\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Grammarly</a>, which is able to integrate with Google Docs and aims to help improve the quality of your writing. Depending on the quality of Google’s native suggestions, it could vastly reduce the need for these third-party services. Does it count as “<a href=\"https://www.howtogeek.com/297651/what-does-it-mean-when-a-company-sherlocks-an-app/\">sherlocking</a>” when someone other than Apple does it?</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_dkhL6sxyrE4ZjUpWD9A8QY0Vso=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23359851/pasted_image_0_4.jpg\">      <cite>Image: Google</cite>      <figcaption><em>The purple underlines in action.</em></figcaption>  </figure><p id=\"vuksXG\">The catch is that Google isn’t rolling out these assistive writing features to all of its Workspace plans. It says the “Tone and Style” suggestions will be available for “Business Standard, Business Plus, Enterprise Standard, Enterprise Plus, [and] Education Plus” subscribers. Meanwhile, “Word Warnings” will be available on “Business Standard, Business Plus, Enterprise Standard, Enterprise Plus, Education Fundamentals, Education Standard, Education Plus, [and] Teaching and Learning Up” plans. That means if you’re on a more basic plan like Google Workspace Essentials, you won’t get either set of features.</p><p id=\"A3gwrE\">Google has been on a bit of a tear recently with new Google Docs features. Just this week it announced <a href=\"https://www.theverge.com/2022/3/29/23002138/google-docs-markdown-support-formatting-update\">Markdown support</a> to the delight of anyone who likes to use text shortcuts rather than keyboard shortcuts to format their writing. And last month it started rolling out a new <a href=\"https://www.theverge.com/2022/2/16/22935824/google-workspace-pageless-smart-canvas-ai-sheets-office-docs-sheets\">“pageless” view for Docs</a>, which formats your document to the size of your window rather than an (increasingly hypothetical) piece of paper. If you’re like me and rarely, if ever, actually print out your work, I’d thoroughly recommend giving it a go. </p><p id=\"YyIKDE\">Both sets of assistive writing features are rolling out over the next couple of weeks for rapid release domains, but most customers will see them gradually roll out in the second half of April. They’ll be on by default, but can be turned off by workspace admins or end users. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/d8KKFx10AP4TcOBr_FZtM73RlIc=/0x98:1355x807/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23359850/Untitled_4.jpg",
  "description": "Or suggest you use active voice.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}