{
  "title": "Google debuts Android 13 with its first developer preview",
  "url": "https://www.theverge.com/2022/2/10/22926874/android-13-features-developer-previewlanguage-controls",
  "date": "2022-02-10T18:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/i6i2ziIvEzAEk9D67B5p7WQ6LZk=/0x0:1500x1000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70493723/Untitled.0.jpg\" />        <figcaption><em>Material You’s dynamic app icons are being extended beyond Google’s apps.</em> | Image: Google</figcaption>    </figure>  <p id=\"u1GmHU\">Android 13’s first developer preview has just been released, and it offers a couple of interesting hints about Google’s focus for this year’s big mobile OS update. The <a href=\"https://android-developers.googleblog.com/2022/02/first-preview-android-13.html\">new features</a> include upgraded theming options and privacy features, new language controls, and, of course, plenty of back-end updates. These early previews are meant for developers rather than end users, so it’s best to hold off on upgrading until the software is in a more finished state.</p><p id=\"StHmI3\">After <a href=\"https://www.theverge.com/22708720/android-12-review-features-pixel-update-software\">Android 12’s heavy focus</a> on Material You customizable themes, Android 13 is expanding the dynamic app icons to all apps rather than just Google’s. The themed icons feature lets app icons take on a color tint that compliments your wallpaper so long as app developers supply a compatible monochromatic app icon. The feature is coming first to Pixel devices, but Google says it’s working with other manufacturers to release it more widely.</p>  <figure class=\"e-image\">        <img alt=\"Animated gif of what turning on themed icons and dark mode icons looks like.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VGsIx6RhN_br5kVexTh60ZuVb1Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23233153/themed_app_icons.gif\">      <cite>GIF: <a class=\"ql-link\" href=\"https://developer.android.com/about/versions/13/features\" target=\"_blank\">Google</a></cite>      <figcaption><em>Themed icons can make a big difference to your home screen’s aesthetic.</em></figcaption>  </figure><div class=\"c-float-right\"><aside id=\"kUPmuM\"><q>Permissions and security are also being tweaked</q></aside></div><p id=\"I13wYY\">There are also tweaks to how Android handles permissions and security. A new photo picker will let users share photos and videos with an individual app without the app needing permission to see all the photos you have on your device. Google plans to eventually bring this feature to all phones running Android 11 and up. </p>  <figure class=\"e-image\">        <img alt=\"Animated gif of Android 13’s photo picker.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AYFkKIKlpIIEKhMdJlImRy_wJgg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23233165/picker_multi_highres.gif\">      <cite>GIF: <a class=\"ql-link\" href=\"https://android-developers.googleblog.com/2022/02/first-preview-android-13.html\" target=\"_blank\">Google</a></cite>      <figcaption><em>The system-provided photo picker is meant to help with privacy — and is themed, of course.</em></figcaption>  </figure><p id=\"B2CIVI\">Of course, there’s also a lot going on under the hood with this new developer preview, with changes that are likely to be less obvious in everyday use. For example, a new Wi-Fi permission will allow apps to discover and connect to Wi-Fi points without needing location permissions, and language preferences will now have the option of being set on a per-app basis (handy for multilingual users). Google also says it’s continuing to invest in its <a href=\"https://www.theverge.com/2019/5/7/18531350/google-android-q-project-mainline-security-updates-play-store-io-2019\">Project Mainline initiative</a> to deliver more updates via Google Play rather than at the OS level. </p><p id=\"Gr1Ga5\">Google says that it intends to release Android 13’s developer previews over the course of February and March and transition to beta releases around April. It expects Android 13 to be stable by around June or July, ahead of an official release later in the year. Hopefully, this year’s update goes more smoothly than Android 12, which was <a href=\"https://www.theverge.com/22881882/android-12-google-pixel-6-pro-bugs-oneplus-oxygenos-12-samsung-one-ui-4-update\">plagued with stability issues</a> on many devices. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6WJqugGtkJOOO8HZMtsvcAEbVcs=/0x108:1500x893/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23231900/Untitled.jpg",
  "description": "Hinting at what’s to come in this year’s Android update.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}