{
  "title": "# Google Docs is getting more Markdown support",
  "url": "https://www.theverge.com/2022/3/29/23002138/google-docs-markdown-support-formatting-update",
  "date": "2022-03-29T22:19:51.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WWARwphbD5_QRenUfQ-UT1GXwDk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70687150/acastro_180427_1777_0001.0.jpg\" />        <figcaption><em>There are a few gotchas though.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"aesyaw\">Google is adding Markdown support to Google Docs on the web, letting you format your document using text shortcuts rather than keyboard ones. In <a href=\"https://workspaceupdates.googleblog.com/2022/03/compose-with-markdown-in-google-docs-on.html\">a blog post announcing the feature</a>, Google says it’s doing this through its autocorrect feature, so it will automatically format the text for you after you type it in Markdown format. For example, if you type “# Google Docs is getting more Markdown support” it’ll automatically get converted to a level one heading. </p><p id=\"QE2M18\">Google says that Docs already supported a few Markdown autocorrections for bulleted and numbered lists, and checkboxes. It’s adding much wider support, though — you can now use Markdown to add headings, bold and italicize text (or <em><strong>do both</strong></em>), strikethrough (though it’s done using a - on either side of your content, rather than the traditional ~), and links. That’s a far from <a href=\"https://www.markdownguide.org/basic-syntax/\">complete implementation of Markdown</a>, but at least it covers most of what I personally use the language for.</p>  <figure class=\"e-image\">        <img alt=\"Screenshot of the Google Docs preferences pane, with the “Automatically detect Markdown” option selected.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ExAa_J_HbpjFuBA5adwTrtZEUvQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23353863/Screen_Shot_2022_03_29_at_13.36.53.png\">      <figcaption><em>A new option has appeared!</em></figcaption>  </figure><p id=\"9EhM21\">To activate the feature, go to Tools &gt; Preferences, and check the “Automatically detect Markdown” box. If you don’t see it, it may not be rolled out for your account yet — Google says it could take “longer than 15 days” for the feature to show up for everyone (personally, I had to try three different Google accounts before I found one that had it).</p><p id=\"BPiWIT\">If you’re used to writing in Markdown in other applications, Google Docs’ implementation is probably going to take some getting used to (even ignoring the seemingly non-standard strikethrough syntax and absent options). Rather than showing you your marks in plain text, it uses them to automatically apply formatting and then gets rid of them. That’s different from how most other text editors display Markdown by default — usually, you’ll still be able to see the marks, with the editor also adding some type of formatting to give you an idea of how it’ll look when you publish.</p>  <figure class=\"e-image\">        <img alt=\"A screenshot of how Google Docs, IA Writer, TextEdit.app, and Obsidian handle displaying Markdown text.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qBEP0GmAIlVb5TdVpsC-wAX7ZVU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23353795/Screen_Shot_2022_03_29_at_14.06.52.png\">      <figcaption><em>A look at the various ways you can display Markdown — clockwise from top left: with no marks in Google Docs, with marks and formatting in iA Writer, showing marks for the line being edited and formatting everywhere else in Obsidian, and with marks and no formatting in TextEdit.</em></figcaption>  </figure><p id=\"EPWMES\">Whether you like this approach or not is probably a personal preference. Google’s implementation probably won’t appeal very much to the people who use Markdown to get complete control of their text (without having to bother with HTML’s annoying closing tags). But for anyone who just wants the ability to use Markdown as a shortcut to formatting, and doesn’t care about fussing around with plaintext, Google’s way could be relatively approachable — instead of selecting text and pressing Command / Control + L to insert a link, you can just type a few brackets and parentheses. </p><p id=\"AUt7oL\">(It’s also probably worth noting that this implementation is much friendlier for when you share a document with a coworker who doesn’t know what Markdown is.)</p><p id=\"pM10Xt\">Google says the feature is off by default — probably a good choice, as it’s easy to imagine a lot of people getting confused if typing a pound sign in front of something automatically switched it to be a header — and that it’s coming to “Google Workspace customers, as well as legacy G Suite Basic and Business customer,” alongside personal accounts. Now if you’ll excuse me, I think it’s time to start a campaign to get Google to add a Vim mode to Docs, since it’s getting into the habit of adding fun nerdy features.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zecX0cPldoJGxd8xivCIx07sXlA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745895/acastro_180427_1777_0001.jpg",
  "description": "But it may take some getting used to",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}