{
  "title": "Google changes how it decides which product reviews come up in Search",
  "url": "https://www.theverge.com/2022/3/24/22995014/google-search-results-product-reviews-update",
  "date": "2022-03-24T20:13:12.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ntj9lO90_a77V6ofjqO8FErPEJY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70668250/acastro_180508_1777_google_IO_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"OrFjGm\">Google <a href=\"https://blog.google/products/search/more-helpful-product-reviews/\">announced Wednesday</a> it’s making some improvements to how it decides which product reviews it shows in Search results. The idea behind these and other recent <a href=\"https://developers.google.com/search/blog/2021/12/product-reviews-update-and-your-site\">product reviews updates</a> is to ensure that reviews you see are high quality and actually include helpful information about a product you might be considering buying.</p><p id=\"wfmjl2\">The improvements build on earlier updates “to make sure that product reviews in Search meet certain criteria,” Google’s Perry Liu said in a blog post. Here are some examples of the criteria Liu says the company is looking for:</p><blockquote><p id=\"r2bnFD\">Include helpful in-depth details, like the benefits or drawbacks of a certain item, specifics on how a product performs or how the product differs from previous versions</p><p id=\"Hd0p48\">Come from people who have actually used the products, and show what the product is physically like or how it’s used</p><p id=\"AwUQ3n\">Include unique information beyond what the manufacturer provides — like visuals, audio or links to other content detailing the reviewer’s experience</p><p id=\"0wEszm\">Cover comparable products, or explain what sets a product apart from its competitors</p></blockquote><p id=\"I3VYB9\">The updates announced Wednesday will roll out “over the next few weeks” and “may impact the rankings of English-language product reviews across many sites,” Google said <a href=\"https://developers.google.com/search/blog/2022/03/product-review-ranking-one-year-on\">in a separate post</a>. The company also plans to “open up product review support for more languages” in the future.</p><p id=\"361uak\">The updates arrive amidst some criticism that Google’s search results <a href=\"https://dkb.io/post/google-search-is-dying\">aren’t quite as useful as they used to be</a>. We’ll have to wait and see if these product review changes make it easier to find quality reviews, but they seem like they could be a small step in the right direction.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ur79HGb9ir4zq0hf6rrbqClBA0s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10801249/acastro_180508_1777_google_IO_0002.jpg",
  "description": "The Search updates will roll out over the next few weeks.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}