{
  "title": "Google will send air raid alerts to Android phones in Ukraine",
  "url": "https://www.theverge.com/2022/3/10/22971213/google-ukraine-android-air-raid-alerts",
  "date": "2022-03-10T20:27:22.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rKVhfoWSSaqzq1rEpUSCvf0v0q4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70605514/acastro_180413_1777_android_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"p8qHBa\">Android users in Ukraine will get air raid alerts directly on their phones before expected attacks happen near them, Google announced today. In an <a href=\"https://blog.google/inside-google/company-announcements/helping-ukraine/\">updated blog post</a>, the company said it’s working with the Ukrainian government to roll out an alert system for Android phones in the country. The feature was first <a href=\"https://www.xda-developers.com/apk-teardown-google-air-raid-alerts/\">spotted by <em>XDA-Developers</em></a>.</p><p id=\"yuRUJF\">“Tragically, millions of people in Ukraine now rely on air strike alerts to try to get to safety,” Google says in the announcement. The Android pings will be based on the alerts already being sent by the Ukrainian government, and it’s adapted from a system built for quickly sending <a href=\"https://www.theverge.com/2020/8/11/21362370/android-earthquake-detection-seismometer-epicenter-shakealert-google\">warnings about earthquakes</a>, <a href=\"https://twitter.com/davey_burke/status/1501996359875891216\">according</a> to Dave Burke, vice president of engineering for Android. </p><p id=\"1pQuo9\">Google has already been highlighting the <a href=\"https://play.google.com/store/apps/details?id=com.ukrainealarm\">Ukrainian Alarm</a> app on the Google Play Store, which sends air raid notifications to Ukrainians in regions with active alerts. The new alerts system begins rolling out today and will ramp up to all Android phones in Ukraine in the coming days, Burke says.</p><p id=\"XciBnb\">Since Russia’s invasion of Ukraine, Google has scaled back its presence in Russia, including <a href=\"https://www.theverge.com/2022/3/4/22961302/google-pauses-all-ad-sales-russia-search-youtube\">pausing all ad sales</a> and removing Russian state-funded media apps from Google Play in Europe. </p><p id=\"Yckp5m\">“The Russian invasion of Ukraine is both a tragedy and a humanitarian disaster in the making,” Google wrote on March 1st. The company said it was working to “support people in Ukraine through our products, defend against cybersecurity threats, surface high-quality, reliable information and ensure the safety and security of our colleagues and their families in the region.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RqOS4nKvRSt2fVr7eK9XOCW0QJY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10646769/acastro_180413_1777_android_0001.jpg",
  "description": "The alert system begins rolling out today",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}