{
  "title": "Google’s crackdown on third-party Android call recorders may finally be complete",
  "url": "https://www.theverge.com/2022/4/21/23036078/google-android-call-recording-apps-accessibility-loopholes-play-store-rules",
  "date": "2022-04-21T20:52:51.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/n-gDRn1ojc0RGxwl5ch7s5XLPR4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70778038/acastro_180507_1777_android_privacy_0001.0.jpg\" />        <figcaption><em>But Google’s own app can still record calls.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"r8JMcO\">Google is changing its Play Store policy to clamp down on a workaround that call recording apps were using, potentially closing the final loophole that allowed these apps to exist (<a href=\"https://www.reddit.com/r/Android/comments/u81i7b/google_will_kill_call_recording_apps_once_and_for/\">via NLL-Apps on Reddit</a>). On May 11th, a <a href=\"https://support.google.com/googleplay/android-developer/answer/11899428#accessibility_preview\">rule clarifying</a> that “the Accessibility API is not designed and cannot be requested for remote call audio recording” will go into effect, making it so that apps won’t be able to record audio from a call.</p><p id=\"U6bFq6\">As <a href=\"https://www.xda-developers.com/google-kill-third-party-call-recording-apps-android/\"><em>XDA</em> points out</a>, Google has been playing whack-a-mole with call recording methods after it removed the official API with Android 6. In an email to <em>The Verge</em>, Google spokesperson Dan Jackson said the reason for the change is that call recording was an inappropriate use of the accessibility API. “Only services that are designed to help people with disabilities access their device or otherwise overcome challenges stemming from their disabilities are eligible to declare that they are accessibility tools. It should be obvious when reading the Google Play Store description of an accessibility tool who those users are and how the app helps them meet the challenges they face,” he said.</p><p id=\"ZcY6zI\">Here are the new guidelines:</p><blockquote><p id=\"Ij6LEo\">The Accessibility API is not designed and cannot be requested for remote call audio recording. </p><p id=\"974fxy\">The use of the Accessibility API must be documented in the Google Play listing.</p><p id=\"h6b4WV\"><strong>Guidelines for IsAccessibilityTool</strong></p><p id=\"e0IC3K\">Apps with a core functionality intended to directly support people with disabilities are eligible to use the IsAccessibilityTool to appropriately publicly designate themselves as an accessibility app.</p><p id=\"2ODoCh\">Apps not eligible for IsAccessibilityTool may not use the flag and must meet prominent disclosure and consent requirements as outlined in the <a href=\"https://support.google.com/googleplay/android-developer/answer/10144311?hl=en&amp;ref_topic=9877467\">User Data policy</a> as the accessibility related functionality is not obvious to the user. Please refer to the <a href=\"https://support.google.com/googleplay/android-developer/answer/10964491?hl=en\">AccessibilityService API</a> help center article for more information.</p><p id=\"y4QoKm\">Apps must use more narrowly scoped <a href=\"https://developer.android.com/privacy/best-practices#permissions\">APIs and permissions</a> in lieu of the Accessibility API when possible to achieve the desired functionality. </p></blockquote><p id=\"WtCXsw\">While it’s understandable that Google wouldn’t want apps using accessibility features outside their intended purpose, it seems unlikely that this crackdown will help preserve privacy given that Google’s own phone app <a href=\"https://support.google.com/phoneapp/answer/9803950?hl=en\">lets you natively record calls</a>. (Other default phone apps, <a href=\"https://www.sammobile.com/tips/how-to-record-calls-samsung-galaxy-smartphone/\">like Samsung’s</a>, will be allowed to keep their call recording functionality, too, as they’re not using the accessibility API to get the call’s audio.) </p><div id=\"qeLIVR\"><div ><iframe src=\"https://www.youtube.com/embed/d21mg8JxxU0?rel=0&amp;start=2990\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"IoZLys\"><em>A developer webinar with more details on its policy updates, including the one affecting call recorders.</em></p><p id=\"nHEKl4\">Google’s app does warn both parties when a call is being recorded, which is legally required in some areas. While third-party apps may not, it seems like Google could force them to by building the functionality into a call recording API for Android. Google was <a href=\"https://www.xda-developers.com/android-11-call-recording/\">reportedly working on one for Android 11</a>, but it <a href=\"https://arstechnica.com/gadgets/2022/04/googles-accessibility-crackdown-bans-call-recording-apps-from-the-play-store/\">didn’t officially make it into the OS</a>.</p><p id=\"q3OOJ1\">This change may not stop potential malware from secretly recording your calls either. The API will still be there, and it seems unlikely that hackers are concerned with Play Store rules. However, legitimate call recording apps could end up having updates rejected if they use this workaround come May — and could even face removal from the store.</p><p id=\"6wLpWR\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RKMb5JFO3Yd3l7QzbvoVevuj9II=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10793469/acastro_180507_1777_android_privacy_0001.jpg",
  "description": "Google and Samsung’s phone apps will keep the feature.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}