{
  "title": "Google’s Pixel team is making an Android tablet",
  "url": "https://www.theverge.com/2022/5/11/23065055/google-android-tablet-pixel-io-release-date",
  "date": "2022-05-11T18:54:46.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gvmOHF9aSh_ilUWCjvn60TfHsDY=/36x0:1598x1041/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70857833/Google_tablet.5.jpg\" />        <figcaption>One of the few glimpses so far of Google’s upcoming Android tablet. | Image: Google</figcaption>    </figure>  <p id=\"Wgk2Ik\">Google is getting back in the tablet game. The company’s internal hardware division plans to release an Android-powered tablet in 2023, senior vice president of devices and services Rick Osterloh announced on Wednesday at its I/O developer conference. Osterloh was light on details, except to say it’ll run on the same Tensor processor inside Google’s latest Pixel phones and that he imagines it as a consumer-focused gadget focused on entertainment and consumption rather than work. (<em>The Verge</em>’s Dan Seifert, who briefly saw a picture during a product briefing ahead of I/O, immediately said “it looks like an old Samsung tablet.”) But Osterloh’s overall message is clear: Google cares about Android tablets. For real this time.</p><p id=\"yLkucm\">The announcement is a huge about-face from Google’s recent history. In 2019, when Osterloh himself said Google was <a href=\"https://www.theverge.com/2019/6/20/18693399/google-abandoning-tablets-pixel-slate-failure\">getting out of the tablet business</a>. “Hey, it’s true,” <a href=\"https://twitter.com/rosterloh/status/1141791243128590336?lang=en\">he tweeted</a> in response to rumors that Google was shutting down its existing tablet products, “Google’s HARDWARE team will be solely focused on building laptops moving forward,” though he again said the software teams still care about supporting tablets. That announcement seemed to chill the market, as if signaling that Google was never going to get serious about tablets. Since then, few companies outside of Samsung have continued to make Android slates.</p><div id=\"Ia0GEq\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hey, it's true...Google's HARDWARE team will be solely focused on building laptops moving forward, but make no mistake, Android &amp; Chrome OS teams are 100% committed for the long-run on working with our partners on tablets for all segments of the market (consumer, enterprise, edu)</p>— Rick Osterloh (@rosterloh) <a href=\"https://twitter.com/rosterloh/status/1141791243128590336?ref_src=twsrc%5Etfw\">June 20, 2019</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"LnzUds\">So why the change of heart? “We see it as a critical part of how people are interacting with media and computers at home, especially,” Osterloh said in an interview ahead of I/O. Google seems to think of Chrome OS as mostly a tool for work and school, while Android is the consumer product. (Osterloh did say Google plans to make more Pixelbooks, by the way, but he wouldn’t say when.) And the pandemic made it clearer than ever to Google that tablets have a unique place in users’ lives as entertainment, gaming, and general consumption devices. (You’d think a decade-plus of Apple’s iPad success would have made that clear already, but alas.) “And certainly, we think we want to design something that’s a perfect companion for Pixel with a larger form factor,” he said.</p><div class=\"c-float-right\"><aside id=\"qw8nwI\"><q>Google’s building a tablet to show the world it cares about Android tablets</q></aside></div><p id=\"U7dShb\">One way to understand the Pixel lineup in general is less as a product organization designed to sell lots of devices and more as a showpiece of Google’s intentions. Google isn’t just building a flagship tablet it hopes lots of people will buy; it’s building a flagship tablet so that Android developers in and out of Google will believe Google actually cares about these devices and will have a reason to care about how their apps look on a larger screen. Google can’t build a great tablet if it can’t start that flywheel. Solving its tablet problem will take more than great hardware and even more than dedicated focus from the entire team at Google. It requires the whole ecosystem to decide it’s worth giving a crap when Google has given them a decade of reasons not to.</p><p id=\"h7hlT8\">Luckily, Google knows that better than anyone. In the early days of Android, back when Google’s in-house hardware projects were called Nexus rather than Pixel, the Nexus 7 and Nexus 10 were some of the best tablet hardware on the market. But Android tablets never caught on, in large part because Android was never well-suited to tablets and Google never seemed to care. Apps mostly treated tablets like “phones with humongous screens” rather than a device category unto themselves, so they showed up big and misfit and generally didn’t work right. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xH4TpntTT6yR8eftlG-fh82grEs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453917/lcimg_ee2960f4_44ac_4db8_a5cf_b119a8a787cc.jpeg\">      <cite>Image: Google</cite>      <figcaption><em>Google’s tablet will fit into the broader Tensor-powered Pixel lineup.</em></figcaption>  </figure><p id=\"T4ustp\">Internally, at least, that appears to be changing. “The Android team has been investing a ton in the space,” Osterloh said. Starting with Android 12L and continuing with some new features in Android 13, like an updated taskbar with an app drawer that makes it easier to use two apps side by side, the OS is at long last starting to look optimized for larger screens. The Pixel Tablet (or whatever it’s called) will be a showcase for that work. “We wanted to make sure people knew about it so that they knew not only is this a big thing for the Android team, but it’s a big thing for our team, too. And we intend to be in this category, starting then and going forward forever.”</p><p id=\"Jj4D4B\">Trystan Upstill, a VP of engineering on the Android team, said that his team has also been working with third-party developers on adapting their apps to the larger displays. “We have TikTok, Zoom, and Facebook building out new apps this year for tablet,” he said in an interview, “and many more coming as well.” Google’s also updating 20 of its own apps — Google Maps, Google Messages, YouTube Music, and more — for tablets over the next few weeks. That’s a strong sign of progress, but the fact that those updates are only coming now says a lot about Google’s history in the space.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OMuk3qZwdS2AGr9ljVtrFp10UFo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450321/7._Multi_tasking_on_Android_tablet.gif\">      <cite>Image: Google</cite>      <figcaption><em>Android 13 makes multitasking much easier on larger screens.</em></figcaption>  </figure><p id=\"CvfyUe\">Google’s focus on tablets may also have something to do with the state of smartphones. As foldable phones become more popular, they’re also becoming one of the most compelling reasons to pick an Android device over an iPhone. Except, all too often, Android doesn’t work great on the larger foldable screens, either. “The distinction, of course, is they have two screens,” Upstill said. “And the layout changes make a big difference. But what we’re doing for tablets is translating directly to improvements for foldables as well.”</p><p id=\"BFJyzL\">And if you’re rooting for Android tablets to be great, you should be rooting for foldables to be successful. Because it’s not hard to imagine a world in which Google really tries to make Android tablets work again only to discover that Apple’s iPad and Microsoft’s Surface are so far ahead that it’s going to be impossible to catch up and decide to just move on to something newer and shinier. Foldables could keep Google’s focus on big screens much longer, though, if they are indeed the next big thing in smartphones.</p><p id=\"53CuS5\">Osterloh seems to be serious about bringing the Pixel shine to the Android tablet world. But if Google’s going to pull off a successful launch next year, it’s going to need help. And fast.</p><p id=\"2vRrnm\"></p><p id=\"g4rEBV\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/D_aoezQdCuSxbKJTVHmDoMjQs8k=/0x94:1633x949/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23453915/Google_tablet.jpg",
  "description": "After years of not caring about big screens, Google’s back in the game.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}