{
  "title": "Googling ‘March Madness’ still defaults to men’s games",
  "url": "https://www.theverge.com/2022/3/25/22996358/google-march-madness-womens-sports-basketball",
  "date": "2022-03-25T18:17:32.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"NCAA BASKETBALL: MAR 21 Div I Womens Championship - Second Round - UCF at UConn\" src=\"https://cdn.vox-cdn.com/thumbor/tamrECXmk8aveFk1BmivaVE1-aM=/0x5:3900x2605/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70672258/1239416138.0.jpg\" />        <figcaption>UConnn’s Paige Bueckers faces off against UCF players Tay Sanders and Alisha Lewisin in the second round of the tournament.  | Photo by M. Anthony Nesmith/Icon Sportswire via Getty Images</figcaption>    </figure>  <p id=\"xTInWY\">Sweet Sixteen games in this year’s March Madness tip off tonight and tomorrow — all exciting games (like reigning national champions Stanford vs. Maryland) and one that is going to be deeply stressful for me personally (Connecticut vs. Indiana — go Huskies). </p><p id=\"uc41yQ\">You’d be forgiven for thinking that the games started yesterday, though. As of this writing, searching “sweet sixteen march madness” pulls up a schedule box for the men’s tournament, which did have that round start yesterday. The women’s games are relegated to a ribbon at the bottom.</p><p id=\"qr9PyN\">This is the <a href=\"https://www.si.com/college/2021/09/29/ncaa-use-march-madness-branding-2022-womens-tournament\">first year</a> that the women’s college basketball tournament is able to use the high-profile March Madness branding. The change came<strong> </strong>after an <a href=\"https://www.washingtonpost.com/sports/2021/03/19/ncaa-women-basketball-weight-room/\">uproar over the embarrassingly inequitable conditions</a> at last year’s women’s games and another few months spent highlighting the many, many ways the NCAA has <a href=\"https://www.npr.org/2021/08/03/1024481199/report-ncaa-undervalues-womens-basketball-prioritizes-mens-teams\">failed</a> <a href=\"https://www.washingtonpost.com/sports/2021/03/25/ncaa-women-basketball-tournament-revenue/?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=wp_sports\">its female</a> athletes. It should be a year to right some of the wrongs of the past iterations of the tournament and to put the women’s game on the equal footing it has deserved for a long time. </p><p id=\"XvQ3we\">But things still aren’t caught up on Google. When I searched for “March Madness” in Google, the first thing that came up is a box with the schedule for the men’s tournament. The sidebar on the right is also for the men’s tournament. Scroll down, and there’s the results ribbon for the women’s games, but no real links to more information. “College basketball championship” only pulls up the men’s games, as well. </p><p id=\"NVsrNE\">Google spokesperson Ned Adriance said in a statement to <em>The Verge</em> that search takes things like trending searches and game times into account when it tries to understand which teams or games people are looking for and that Google has made <a href=\"https://blog.google/products/search/basketball-and-brackets-march-love-story/\">improvements</a> around March Madness. “When people come to Search to find women’s sports info and primarily find details for men’s teams, we know that’s not a great experience,” he said. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/d25Y7BKho24vth3u_TfcLYvlWJc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23344998/Screen_Shot_2022_03_25_at_12.17.32_PM.png\">      <figcaption>A screenshot taken on March 25.</figcaption>  </figure><p id=\"xCT1oG\">It’s a frustrating experience for sports reporter Claire Watkins, who writes the newsletter for <em>Just Women’s Sports </em>and also primarily sees men’s scores pop up in her search results.<strong> </strong>The ribbon tacked on to the bottom of the men’s tournament box doesn’t include important details or links for women’s games. If she wants the detailed information box for the women’s tournament, she has to specifically add on “women” for any March Madness searches. </p><p id=\"iiOXin\">“I never want to type ‘women’ at the end of a search ever again,” Watkins <a href=\"https://twitter.com/ScoutRipley/status/1506317007196676101\">tweeted</a>. </p><p id=\"JDT7vh\">The same thing happens when I search for other sports using supposedly gender-neutral search terms: Champions League (which has both men’s and women’s iterations), US Soccer (which has a women’s and men’s team, and the women’s team is <a href=\"https://www.nytimes.com/2019/07/07/sports/soccer/uswnt-world-cup-final.html\">far more successful</a>). For both, the men’s schedule is up first. Watkins told me that her searches for things like “Notre Dame ACC” correctly figure out that she’s looking for information about basketball — but gives her results for the men’s team. </p><p id=\"NBLtuQ\">Adriance said that it’s sometimes hard for Google<strong> </strong>Search to disentangle sports information for reasons other than gender (like when multiple sports teams have the same name), and that sometimes, the women’s iteration of a sport comes up first (like on searches for gymnastics or beach volleyball teams). Search also pulls up results based on the prevalence of a type of content online — so if there’s more “relevant, timely, and high-quality media” coverage of a men’s sport, that can influence search results. “That said, when it comes to our sports features, this is something we’re actively working to improve,” he said.</p><p id=\"7s5tWD\">It’s frustrating to see something like Google make the argument that they might not show women’s sports because there might not be as much information available about them. Women’s sports are still trying to shake off decades of being undercut by organizations like the NCAA and underinvested in by networks and media. It’s a choice to follow behind that baseline de-prioritization rather than take active steps to counteract it. Interest and viewership follow from TV networks’ and tech companies’ choices around what to promote. When those groups properly invest in and promote the women’s game, treating it as a <a href=\"https://www.washingtonpost.com/sports/2021/04/01/womens-sports-growth-ratings-business/\">product in its own right</a> rather than a <a href=\"https://digiday.com/media/why-growth-of-womens-sports-coverage-and-advertiser-interest-is-bogged-down-by-small-steps-forward/\">second-class subject</a>, <a href=\"https://twitter.com/ESPNPR/status/1441050474724081667\">people</a> <a href=\"https://twitter.com/ESPNPR/status/1506679762072317961\">watch</a>. </p><div id=\"xk0aXq\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The greatest lie the <a href=\"https://twitter.com/NCAA?ref_src=twsrc%5Etfw\">@NCAA</a> ever told was that fans for <a href=\"https://twitter.com/MarchMadnessWBB?ref_src=twsrc%5Etfw\">@MarchMadnessWBB</a> didn't exist. Watch what happens as they start giving women equal promotion, airtime, and those NIL checks keep pouring in. <a href=\"https://t.co/V9sdbqJobe\">https://t.co/V9sdbqJobe</a></p>— Alexis Ohanian 7️⃣7️⃣6️⃣ (@alexisohanian) <a href=\"https://twitter.com/alexisohanian/status/1506273650260938752?ref_src=twsrc%5Etfw\">March 22, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"V3NQVB\">Google search does this well with tennis — searching for a tournament generates a score box with the option to toggle between the men’s and women’s matchups, and it’s easy to find what you’re looking for. Adriance didn’t say if that was a consideration for March Madness.</p><p id=\"8tq1R6\">Personally, I think it would be fun to just swap things around and have March Madness pull up women’s sports only and force people to type in “men’s” if that’s the tournament they want to find. But I’ll settle for just not having to type in “women’s.” When I search for basketball this month, the games I’m interested in shouldn’t need that qualifier. </p><p id=\"WDt6vE\"></p><p id=\"g8qj14\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Bo_ZTX0D0GEuo11BpDk_Me5mC_g=/0x284:3900x2326/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23345036/1239416138.jpg",
  "description": "I shouldn’t have to specify \"women’s.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}