{
  "title": "Google is buying the cybersecurity company that uncovered the SolarWinds hack",
  "url": "https://www.theverge.com/2022/3/8/22966907/google-buying-mandiant-cybersecurity-outfit-5-4-billion",
  "date": "2022-03-08T12:04:06.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KHwIzJPfZ2UrhBYWJrXLNIenLQI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70593057/acastro_180427_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"uzPIbs\">Google is <a href=\"https://www.googlecloudpresscorner.com/2022-03-08-mgc\">buying cybersecurity company Mandiant</a> in an all-cash transaction valued at approximately $5.4 billion. </p><p id=\"brcT74\">Mandiant’s operations, which draw on the work of more than 600 security consultants and more than 300 intelligence analysts, will be folded into Google Cloud to create an “end-to-end security operations suite.” A range of services will be offered, from consulting on cybersecurity to detecting upcoming threats and testing company’s digital defenses. </p><p id=\"MgQ0rv\">“Organizations around the world are facing unprecedented cybersecurity challenges as the sophistication and severity of attacks that were previously used to target major governments are now being used to target companies in every industry,” Google Cloud’s CEO Thomas Kurian said in a <a href=\"https://www.googlecloudpresscorner.com/2022-03-08-mgc\">blog post</a>. “We look forward to welcoming Mandiant to Google Cloud to further enhance our security operations suite and advisory services, and help customers address their most important security challenges.”</p><div class=\"c-float-right\"><aside id=\"EtopvR\"><q>Mandiant is perhaps best known for uncovering the devastating SolarWinds attack</q></aside></div><p id=\"bOM0GI\">Mandiant is perhaps best known for uncovering the <a href=\"https://www.theverge.com/2021/1/26/22248631/solarwinds-hack-cybersecurity-us-menn-decoder-podcast\">devastating SolarWinds attack</a> — a massive operation thought to be sponsored by the Russian government that compromised computers across the US federal government. The attack went unnoticed for the best part of a year until Mandiant reported details of the operation in December 2020.</p><p id=\"tfyMge\">Previously, Microsoft had been rumored as a <a href=\"https://www.bloomberg.com/news/articles/2022-02-08/microsoft-is-said-to-pursue-deal-for-cybersecurity-firm-mandiant\">potential buyer of Mandiant</a>. Microsoft and Google have been competing to control the lucrative cloud services market, where cybersecurity plays an increasingly prominent role.</p><p id=\"0JetUA\">“There has never been a more critical time in cybersecurity. Since our founding in 2004, Mandiant’s mission has been to combat cyber attacks and protect our customers from the latest threats,” Mandiant CEO Kevin Mandia said in a press statement. “To that end, we are thrilled to be joining forces with Google Cloud. Together, we will deliver expertise and intelligence at scale, changing the security industry.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zecX0cPldoJGxd8xivCIx07sXlA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745895/acastro_180427_1777_0001.jpg",
  "description": "Microsoft was previously rumored as a buyer",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}