{
  "title": "Google now lets you search for things you can’t describe — by starting with a picture",
  "url": "https://www.theverge.com/2022/4/7/23014141/google-lens-multisearch-android-ios",
  "date": "2022-04-07T13:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/W-1rH9OzOc7n1c5oqoEPUYkMIdI=/0x28:957x666/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70720769/Multisearch_in_Lens_dress.0.jpg\" />    </figure>  <p id=\"476L8S\">You like the way that dress looks but you’d rather have it in green. You want those shoes but prefer flats to heels. What if you could have drapes with the same pattern as your favorite notebook? I don’t know how to Google for these things, but Google Search product manager Belinda Zeng showed me real-world examples of each earlier this week, and the answer was always the same: take a picture, then type a single word into Google Lens. </p><p id=\"IXCiYR\">Today, Google is launching a US-only beta of the Google Lens Multisearch feature <a href=\"https://www.theverge.com/2021/9/29/22698014/google-lens-update-text-search-desktop-chrome\">it teased last September</a> at <a href=\"https://youtu.be/MXru-ftigYk?t=676\">its Search On event</a>, and while I’ve only seen a rough demo so far, you shouldn’t have to wait long to try it for yourself: it’s rolling out in the Google app <a href=\"https://apps.apple.com/us/app/google/id284815942\">on iOS</a> and <a href=\"https://play.google.com/store/apps/details?id=com.google.android.googlequicksearchbox&amp;hl=en_US&amp;gl=US\">Android</a>. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/D-ld0X-G4IxB90meXCJ1p_MCIAI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372849/multisearch3.gif\">      <cite>GIF: Google</cite>      <figcaption><em>Take a screenshot or picture of a dress, then tap, type “green,” and search for a similar one in a different color.</em></figcaption>  </figure><p id=\"a2pR07\">While it’s mostly aimed at shopping to start — it was one of the most common requests — Google’s Zeng and the company’s search director Lou Wang suggest it could do a lot more than that. “You could imagine you have something broken in front of you, don’t have the words to describe it, but you want to fix it... you can just type ‘how to fix,’” says Wang. </p><p id=\"6OQaa1\">In fact, it might already work with some broken bicycles, Zeng adds. She says she also learned about styling nails by screenshotting pictures of beautiful nails on Instagram, then typing the keyword “tutorial” to get the kind of video results that weren’t automatically coming up on social media. You may also be able to take a picture of, say, a rosemary plant, and get instructions on how to care for it. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pIHKXBylEFJNNu85Zq-taCsOgdo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372822/multisearch2.gif\">      <cite>GIF by Sean Hollister / The Verge</cite>      <figcaption><em>Google’s Belinda Zeng showed me a live demo where she found drapes to match a leafy notebook.</em></figcaption>  </figure><p id=\"9kURin\">“We want to help people understand questions naturally,” says Wang, explaining how multisearch will expand to more videos, images in general, and even the kinds of answers you might find in a traditional Google text search. </p><p id=\"Heog5F\">It sounds like the intent is to put everyone on even footing, too: rather than partnering with specific shops or even limiting video results to Google-owned YouTube, Wang says it’ll surface results from “any platform we’re able to index from the open web.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tk2Xn1cOGSO7BIR6lNpQY19At74=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372860/ties_google.jpg\">      <cite>Screenshot by Sean Hollister / The Verge</cite>      <figcaption><em>When Zeng took a picture of the wall behind her, Google came up with ties that had a similar pattern.</em></figcaption>  </figure><p id=\"znWk0F\">But it won’t work with everything — like your voice assistant doesn’t work with everything — because there are infinite possible requests and Google’s still figuring out intent. Should the  system pay more attention to the picture or your text search if they seem to contradict? Good question. For now, you do have one additional bit of control: if you’d rather match a pattern, like the leafy notebook, get up close to it so that Lens can’t see it’s a notebook. Because remember, Google Lens is trying to recognize your image: if it thinks you want more notebooks, you might have to tell it that you actually don’t. </p><p id=\"6HZpCw\">Google is hoping AI models can drive a new era of search, and there are <a href=\"https://www.theverge.com/2021/9/29/22698504/google-search-on-event-ai-mum-google-lens-update-changes\">big open questions about whether context</a> — and not <a href=\"https://www.theverge.com/2021/5/26/22454513/google-future-of-search-conversation-ai-mum-lamda\">just text</a> — can take it there. This experiment seems limited enough (it doesn’t even use its latest MUM AI models) that it probably won’t give us the answer. But it does seem like a neat trick that could go fascinating places if it became a core Google Search feature.</p><aside id=\"WikxF8\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Google search’s next phase: context is king\",\"url\":\"https://www.theverge.com/2021/9/29/22698504/google-search-on-event-ai-mum-google-lens-update-changes\"},{\"title\":\"Google isn’t ready to turn search into a conversation\",\"url\":\"https://www.theverge.com/2021/5/26/22454513/google-future-of-search-conversation-ai-mum-lamda\"},{\"title\":\"Google is using AI to help users explore the topics they’re searching for — here’s how\",\"url\":\"https://www.theverge.com/2021/9/29/22696268/google-search-on-updates-ai-mum-explained\"}]}'></div></aside><p id=\"OV2eL4\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sOwDjV5KMKsHsJoWIvFkPalb9L8=/0x97:957x598/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23372803/Multisearch_in_Lens_dress.jpg",
  "description": "Google Lens Multisearch is now in beta",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}