{
  "title": "Google’s Russian branch plans to file for bankruptcy",
  "url": "https://www.theverge.com/2022/5/18/23124143/google-russian-branch-bankruptcy-ukraine",
  "date": "2022-05-18T17:53:34.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Storefronts And General Views Of Munich\" src=\"https://cdn.vox-cdn.com/thumbor/WU-_7gMKMOqsOEHfXhBuc9HUyak=/0x0:6829x4553/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883864/1317337382.0.jpg\" />        <figcaption>Photo by Jeremy Moeller/Getty Images</figcaption>    </figure>  <p id=\"RJ5pFr\">Google’s Russian subsidiary will file for bankruptcy, according to <a href=\"https://www.reuters.com/markets/europe/googles-russian-subsidiary-files-bankruptcy-document-2022-05-18/\">a report from <em>Reuters</em></a>, with the company stating it can no longer keep the branch. The Russian branch reported making 134.3 billion roubles (about $2.086 billion USD) in Russia in 2021 and employed <a href=\"https://www.politico.com/news/2022/03/04/u-s-tech-russia-money-00014067\">over 100 workers</a>.</p><p id=\"Iq36kw\">“The Russian authorities’ seizure of Google Russia’s bank account has made it untenable for our Russia office to function, including employing and paying Russia-based employees, paying suppliers and vendors, and meeting other financial obligations,” a Google spokesperson said in a statement to <em>The Verge</em>. “Google Russia has published a notice of its intention to file for bankruptcy.”</p><p id=\"KC0yBP\">In March, <a href=\"https://www.theverge.com/2022/3/4/22961302/google-pauses-all-ad-sales-russia-search-youtube\">Google suspended the sale of ads in Russia</a> shortly after Russia invaded Ukraine. The Google-owned YouTube also <a href=\"https://www.theverge.com/2022/2/26/22952439/youtube-bans-ads-rt-russia-channels-google-ukraine\">moved to ban ads on channels</a> owned by Russian state-backed media and later <a href=\"https://www.theverge.com/2022/3/11/22972911/youtube-rt-russian-sputnik-block-state-media-globally\">blocked these channels completely</a>.</p><p id=\"1ISBQJ\">Last December, <a href=\"https://www.theverge.com/2021/12/24/22852827/google-100-million-fine-russia-banned-content-big-tech-regulation\">Russia fined Google 7.2 billion roubles</a> ($98 million USD at the time of writing) after it failed to remove content Russia considers illegal from its platforms. The fine made up about 8 percent of Google’s revenue in Russia.</p><p id=\"nTq3JY\">In addition, <em>Reuters</em> reports that a Russian TV channel claimed authorities seized 1 billion roubles (about $15 million USD) from Google in April after it didn’t reinstate access to the channel’s YouTube account. <a href=\"https://www.theverge.com/2022/3/30/23002909/russia-youtube-google-illegal-content-roskomnadzor-ukraine-war-regulator-fine\">Russia’s communication regulator also threatened</a> to slap Google with a more modest 8 million rouble fine (about $95,000 USD at that time of writing) after it removed “illegal” videos from YouTube. It’s unclear how much Russia has seized from Google in total.</p><div class=\"c-float-right\"><aside id=\"wk0Tsl\"><q>Google’s free services will still be available</q></aside></div><p id=\"4Kd6XD\">A note posted to Russia’s official financial registry, viewed by <em>Reuters</em>, detailed Google's intention to file for bankruptcy, saying: </p><p id=\"NEnOyG\">“Since March 22, 2022, it foresees its own bankruptcy and inability to fulfill its monetary obligations, demands to pay severance payments and (or) the remuneration of staff working or previously working under an employment contract, and (or) the obligation to make mandatory payments within the prescribed period.”</p><p id=\"qDDXfF\">So far, Google appears to be the first big tech company to file for bankruptcy in Russia as a result of the war on Ukraine. Other companies, like <a href=\"https://www.theverge.com/2022/3/1/22957000/apple-russia-ukraine-invasion-halt-product-sales-app-store\">Apple</a>, <a href=\"https://www.theverge.com/2022/2/26/22952038/facebook-russian-state-media-blocked-advertising-monetization-ukraine-conflict\">Meta</a>, and <a href=\"https://www.theverge.com/2022/3/4/22961445/microsoft-russia-ukraine-sales-ban-xbox-azure-windows-office\">Microsoft</a> have all suspended operations in the country but haven’t had their Russian branches declare bankruptcy. <a href=\"https://www.bloomberg.com/news/articles/2022-03-17/russia-backed-delivery-app-buyk-files-for-bankruptcy-in-n-y\">Russian-backed food delivery startup, Buyk, filed for bankruptcy</a> in March as a result of the economic sanctions put on the country. On Monday, <a href=\"https://www.npr.org/2022/05/16/1099079032/mcdonalds-leaving-russia\">McDonald’s announced it would leave Russia</a> and sell its fast-food restaurants after more than 30 years in the country.</p><p id=\"Jd3i1F\">Although Russia didn’t go so far as to ban Google’s services in the country, it did <a href=\"https://www.theverge.com/2022/3/21/22988955/russia-facebook-instagram-putin-meta-whatsapp-ban-ukraine\">ban the Meta-owned Facebook and Instagram</a>. Google says its free services will still be available in the country.</p><p id=\"bjhd3K\">“People in Russia rely on our services to access quality information and we’ll continue to keep free services such as Search, YouTube, Gmail, Maps, Android and Play available,” the Google spokesperson added.</p><p id=\"im406R\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/I0ZwwS1aQV7fqr5y-lqTMEIQPC8=/0x978:6829x4553/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23537114/1317337382.jpg",
  "description": "Google’s free services will remain available.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}