{
  "title": "Google, Apple, Meta and others call on Texas to drop anti-trans legislation",
  "url": "https://www.theverge.com/2022/3/11/22972413/google-meta-apple-microsoft-texas-anti-trans-legislation-opposition",
  "date": "2022-03-11T11:37:18.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/luvzDKdJRtMkLaa6T8G4V9Tpyo0=/192x0:1566x916/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70607932/Screenshot_2022_03_11_at_10.22.01.0.png\" />        <figcaption><em>The top line of the advert placed in the Friday edition of the</em> Dallas Morning News.</figcaption>    </figure>  <p id=\"dpeC7p\">Google, Apple, and Meta are among <a href=\"https://www.hrc.org/press-releases/gender-affirming-care-setting-the-record-straight-as-extremist-politicians-in-texas-and-other-states-continue-doubling-down-on-attacking-trans-youth-2\">more than 60 companies</a> asking Texas governor Greg Abbott to abandon recent legislation that defines gender-affirming medical treatments for transgender minors as “child abuse.”</p><p id=\"KARJ6c\">In a full-page advertisement published in the Friday edition of the <em>Dallas Morning News, </em>the companies call on leaders in Texas to “abandon efforts to write discrimination into law.” </p><p id=\"HoTMnI\">“This policy creates fear for employees and their families, especially those with transgender children, who might now be faced with choosing to provide the best possible medical care for their children but risk having those children removed by child protective services for doing so,” states the ad. “It’s not just wrong, it has an impact on our employees, our customers, their families, and our work.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/f-sYR2UhU9cnpa2ZNxVZYiMkOsQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23306236/dallas_morning_news_ad1024_1.jpg\">      <figcaption><em>The advertisement is signed by more than 60 companies. </em></figcaption>  </figure><p id=\"yCR38G\">Signatories for the letter include major tech businesses like Microsoft, Salesforce, IBM, and PayPal, as well as blue chip corporations like Johnson &amp; Johnson, Ikea, and Gap. Around the same time that news of the ad was published, Apple CEO Tim Cook tweeted his own thoughts on this and other anti-LGBTQ legislation currently being passed in the US: </p><div id=\"J2yrPG\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As a proud member of the LGBTQ+ community, I am deeply concerned about laws being enacted across the country, particularly those focused on our vulnerable youth. I stand with them and the families, loved ones, and allies who support them.</p>— Tim Cook (@tim_cook) <a href=\"https://twitter.com/tim_cook/status/1502092765265420289?ref_src=twsrc%5Etfw\">March 11, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"SNosX5\">The Texas legislation in question is a directive <a href=\"https://gov.texas.gov/uploads/files/press/O-MastersJaime202202221358.pdf\">issued by Abbott on February 22nd</a> that calls on state agencies to “conduct a prompt and thorough investigation” of any reports of minors undergoing “elective procedures for gender transitioning.” The directive charges members of the public as well as professionals like teachers, nurses, and doctors to report any such cases, and threatens individuals who fail to do so with “criminal penalties.”</p><p id=\"WcU2tk\">The order — which many experts say is <a href=\"https://www.bu.edu/articles/2022/latest-texas-anti-transgender-directive-explained/\">illegal</a> — is part of a wave of anti-LGBTQ legislation being pushed by Conservative lawmakers <a href=\"https://www.equalityfederation.org/tracker/anti-transgender-medical-care-bans\">across the US</a> ahead of midterm elections. In Florida, lawmakers recently <a href=\"https://www.nbcnews.com/nbc-out/out-politics-and-policy/dont-say-gay-bill-florida-senate-passes-controversial-lgbtq-school-mea-rcna19133\">passed a law</a> that bans discussions of sexual orientation or gender identity in schools (dubbed the <em>Don’t Say Gay</em> bill by opponents).</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/JIQ019vynxVN1A2DCdM3xDwOBow=/4x0:1754x916/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23306221/Screenshot_2022_03_11_at_10.22.01.png",
  "description": "Tech companies unite against Texan anti-trans policy",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}