{
  "title": "Google’s AR translation glasses: it’s really not that simple",
  "url": "https://www.theverge.com/2022/5/13/23068759/google-io-2022-ar-glasses-translation-concept-challenges-vaporware",
  "date": "2022-05-13T12:00:00.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4m7R-5viErDCQ4COIkp-BUcHrvA=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70864578/2022_5_11_google_io_895_11_42_58.0.jpg\" />        <figcaption><em>Of course it’s simulated.</em> | Image: Google</figcaption>    </figure>  <p id=\"Sv1OP7\">At the end of its I/O presentation on Wednesday, Google pulled out a “one more thing”-type surprise. In <a href=\"https://www.youtube.com/watch?v=lj0bFX9HXeE\">a short video</a>, Google <a href=\"https://www.theverge.com/2022/5/11/23067426/google-ar-glasses-live-translate-io\">showed off a pair of augmented reality glasses</a> that have one purpose — displaying audible language translations right in front of your eyeballs. In the video, Google product manager Max Spear called the capability of this prototype “subtitles for the world,” and we see family members communicating for the first time.</p><p id=\"Nqo2uT\">Now hold on just a second. Like many people, we’ve used Google Translate before and largely think of it as a very impressive tool that happens to make a lot of embarrassing misfires. While we might trust it to get us directions to the bus, that’s nowhere near the same thing as trusting it to correctly interpret and relay our parents’ childhood stories. And hasn’t Google said it’s finally breaking down the language barrier before?</p><div id=\"dqyjKj\"><div ><iframe src=\"https://www.youtube.com/embed/lj0bFX9HXeE?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"wDtYCb\">In 2017, Google marketed real-time translation as a feature of its original Pixel Buds. Our former colleague Sean O’Kane <a href=\"https://www.theverge.com/2017/11/16/16659314/google-pixel-buds-review-bluetooth-headphones\">described the experience</a> as “a laudable idea with a lamentable execution” and reported that some of the people he tried it with said it sounded like he was a five-year-old. That’s not quite what Google showed off in its video.</p><p id=\"MVPwzp\">Also, we don’t want to brush past the fact that Google’s promising that this translation will happen <em>inside a pair of AR glasses</em>. Not to hit at a sore spot, but the reality of augmented reality hasn’t really even caught up to Google’s <a href=\"https://www.youtube.com/watch?v=9c6W4CCU9M4\">concept video from a decade ago</a>. You know, the one that acted as a predecessor to the much-maligned and <a href=\"https://www.theverge.com/2013/5/28/4372928/using-google-glass-at-the-indy-500-and-coca-cola-600\">embarrassing-to-wear</a> Google Glass?</p><p id=\"3B2jxp\">To be fair, Google’s AR translation glasses seem much more focused than what Glass was trying to accomplish. From what Google showed, they’re meant to do one thing — display translated text — not act as an ambient computing experience that could replace a smartphone. But even then, making AR glasses isn’t easy. Even a moderate amount of ambient light can make viewing text on see-through screens <a href=\"https://www.theverge.com/2019/2/14/18223593/focals-smart-glasses-north-review-specs-features-price\">very difficult</a>. It’s challenging enough to read subtitles on a TV with some glare from the sun through a window; now imagine that experience but strapped to your face (and with the added pressure of engaging in a conversation with someone that you can’t understand on your own).</p><div class=\"c-float-right\"><aside id=\"EjYlYQ\"><q>Even a moderate amount of ambient light can make viewing text on see-through screens very difficult</q></aside></div><p id=\"3xal9i\">But hey, technology moves quickly — Google may be able to overcome a hurdle that has <a href=\"https://www.theverge.com/2022/3/10/22969007/magic-leap-2-augmented-reality-headset\">stymied its competitors</a>. That wouldn’t change the fact that Google Translate is not a magic bullet for cross-language conversation. If you’ve ever tried having an actual conversation through a translation app, then you probably know that you must speak slowly. And methodically. And clearly. Unless you want to risk a garbled translation. One slip of the tongue, and you might just be done. </p><p id=\"uKduym\">People don’t converse in a vacuum or like machines do. Just like we code-switch when speaking to voice assistants like Alexa, Siri, or the Google Assistant, we know we have to use much simpler sentences when we’re dealing with machine translation. And even when we do speak correctly, the translation can still come out awkward and misconstrued. Some of our <em>Verge</em> colleagues fluent in Korean pointed out that <a href=\"https://drive.google.com/file/d/15q3e6oO8o8ypCzyXJmpdXOSSfCi-8Wkn/view\">Google’s own pre-roll countdown for I/O</a> displayed an honorific version of “Welcome” in Korean that nobody actually uses. </p><p id=\"WsHgu1\">That mildly embarrassing flub pales in comparison to the fact that, according to tweets <a href=\"https://twitter.com/tha_rami/status/1524448087581806592?s=20&amp;t=MhWEZ73_aoWMOZr0lIeKyQ\">from Rami Ismail</a> and <a href=\"https://twitter.com/DHammarskjold/status/1524495881633865728\">Sam Ettinger</a>, Google showed over half a dozen backwards, broken, or otherwise incorrect scripts on a slide <em>during its Translate presentation</em>. (<a href=\"https://www.androidpolice.com/google-translation-mistake-io/\"><em>Android Police</em> notes</a> that a Google employee has acknowledged the mistake, and that it’s been corrected in the YouTube version of the keynote.) To be clear, it’s not that we expect perfection — but Google’s trying to tell us that it’s close to cracking real-time translation, and those kinds of mistakes make that seem incredibly unlikely.</p><div id=\"LHhE3l\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Congrats to <a href=\"https://twitter.com/Google?ref_src=twsrc%5Etfw\">@Google</a> for getting Arabic script backwards &amp; disconnected during <a href=\"https://twitter.com/sundarpichai?ref_src=twsrc%5Etfw\">@sundarpichai</a>'s presentation on *Google Translate*, because small independent startups like Google can't afford to hire anyone with a 4 year olds' elementary school level knowledge of Arabic writing. <a href=\"https://t.co/pSEvHTFORv\">pic.twitter.com/pSEvHTFORv</a></p>— Rami Ismail (رامي) (@tha_rami) <a href=\"https://twitter.com/tha_rami/status/1524448087581806592?ref_src=twsrc%5Etfw\">May 11, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"raLSgF\">Google is trying to solve an <em>immensely </em>complicated problem. Translating words is easy; figuring out grammar is difficult but possible. But language and communication are far more complex than just those two things. As a relatively simple example, Antonio’s mother speaks three languages (Italian, Spanish, and English). She’ll sometimes borrow words from language to language mid-sentence — including her regional Italian dialect (which is like a fourth language). That type of thing is relatively easy for a human to parse, but could Google’s prototype glasses deal with it? Never mind the messier parts of conversation like unclear references, incomplete thoughts, or innuendo.</p><div><aside id=\"sL5T89\"><q>Google is trying to solve an immensely<em> </em>complicated problem</q></aside></div><p id=\"QebtUi\">It’s not that Google’s goal isn’t admirable. We absolutely want to live in a world where everyone gets to experience what the research participants in the video do, staring with wide-eyed wonderment as they see their loved ones’ words appear before them. Breaking down language barriers and understanding each other in ways we couldn’t before is something the world needs way more of; it’s just that there’s a long way to go before we reach that future. Machine translation is here and has been for a long time. But despite the plethora of languages it can handle, it doesn’t speak human yet. </p><hr class=\"p-entry-hr\" id=\"Gezl2R\"><h2 id=\"4rKxEc\">Related:</h2><div id=\"kE6dJ9\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Google io 2022|107116\" data-volume-uuid=\"322c5ac05\" data-volume-id=\"107116\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-684\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/NH6n530-9kHdUM4aeyPghJJVwB8=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23456238/2022_5_11_google_io_895_11_42_58.jpg",
  "description": "Live translations are much messier than Google lets on.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}