{
  "title": "Google Domains is finally out of beta after more than seven years",
  "url": "https://www.theverge.com/2022/3/15/22979998/google-domains-out-of-beta",
  "date": "2022-03-15T22:50:51.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FYegVRo-8wIPJqCb8mqbRN4mzJk=/162x0:1935x1182/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70627740/JSL001_GoogleDomains_Social_Keyw.0.jpeg\" />        <figcaption><em>These people seem really thrilled about their websites.</em> | Image: Google</figcaption>    </figure>  <p id=\"wPIc0m\">Google Domains, the company’s domain registration service, is losing the beta tag after first launching more than seven years ago, <a href=\"https://blog.google/outreach-initiatives/entrepreneurs/register-a-domain-google-domains/\">Google announced Tuesday</a>. The service is now generally available in 26 countries, and the company says it already has “millions of active registrations.” </p><p id=\"CcG1PV\">If you register with Google Domains, you can pick from more than 300 different domain endings, have access to “high performance DNS” (Google says it’s the same infrastructure it uses for itself), “around-the-clock customer support from real people,” and more. The company is also offering a 20 percent discount off “any single domain registration or transfer-in to Google Domains” for new and returning users with the code DOMAINS20.</p><p id=\"VK749N\">However, if you register a domain with Google Domains, you’ll still need to actually build a website to use with it. Google unsurprisingly suggests its Google Sites product but also recommends its “premium partners,” which include Wix, Shopify, Squarespace, Weebly, and Bluehost.</p><p id=\"UqCpUA\">Google Domains has been in development for quite a while — it first launched in an invite-only beta <a href=\"https://www.theverge.com/2014/6/23/5835560/google-launches-domain-registration-service\">in June 2014</a> and was opened up to a public beta in the US <a href=\"https://www.theverge.com/2015/1/13/7538197/google-domains-now-available-to-everyone-in-united-states\">in January 2015</a>. Even Gmail wasn’t in beta <a href=\"https://www.theverge.com/2014/4/1/5570694/gmail-10-years-old-today\">for that long</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jnJohxDHG-P7gc-aQ_flPUQCaBw=/0x43:2096x1140/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23319020/JSL001_GoogleDomains_Social_Keyw.jpeg",
  "description": "Is this Google’s longest beta?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}