{
  "title": "Google’s CTO of Android tablets sees tablet sales passing laptops ‘in the not too distant future’ ",
  "url": "https://www.theverge.com/2022/3/10/22970747/android-tablets-rich-miner-google-12l",
  "date": "2022-03-11T00:56:35.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/V7N1OkZRsVyQ2aV78fRQGDfJobI=/14x0:1388x916/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70606813/android_show_miner.0.jpg\" />        <figcaption>Image: Google, The Android Show</figcaption>    </figure>  <p id=\"NAjlGb\">After seemingly forgetting that Android tablets existed for a while, Google is suddenly very invested in the market. <a href=\"https://www.theverge.com/2021/10/27/22746599/android-12l-feature-drop-big-screens\">Android 12L</a> is in development to support larger-screened devices, and one of the platform’s co-founders, Rich Miner, has rejoined the team <a href=\"https://www.theverge.com/2022/1/28/22904891/google-android-tablets-focus-rich-miner-cto\">with the title “CTO of Android tablets.”</a> Now, speaking to developers <a href=\"https://www.youtube.com/watch?v=CQV95EN0CmY\">during an episode of Google’s The Android Show</a>, Miner explained the opportunity the company is seeing (via <a href=\"https://9to5google.com/2022/03/09/tablet-first-android-apps/\"><em>9to5Google</em></a>).</p><p id=\"CYkkN5\">Miner references the introduction of Android tablets in 2011 and how apps like media players scaled to fit them easily without much investment, but then growth “kind of stagnated.” Now, he cites data showing growth took off pre-COVID in late 2019 and has continued to rise, with more keyboard peripherals and developments in software and hardware by third-party manufacturers to make them better tools to create instead of consuming.</p><p id=\"XkRpSk\">The other reason he cites is that tablets can be “very capable, less expensive than a laptop.” That spurred Google’s work on Android 12L to optimize its system UI for use on bigger devices, as well as the way it formats apps to fit on big screens.</p>  <figure class=\"e-image\">        <img alt=\"Android 12L displays notifications and settings side by side to take advantage of big screens\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Wh4XzX-CzGgeSpd0r3vRnYShKug=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23305256/12l_notification_settings.jpg\">      <cite>Image: Google</cite>      <figcaption><em>Android 12L displays notifications and settings side by side to take advantage of big screens</em></figcaption>  </figure><p id=\"haaBX9\">Miner is making the pitch for developers to look at their apps and consider taking advantage of the tools Google’s building to improve tablet support or even building apps that approach the market as a tablet-first experience. He points to 2020 sales data, where “tablet purchases actually started to approach the number of laptop shipments... I actually think there’s going to be a crossover point at some point in the not too distant future where there are more tablets sold annually than there are laptops. I think once you cross over that point, you’re not going to be coming back.”</p><p id=\"jEfy8x\">We’ll need to see more action before we can believe Google’s renewed tablet push will avoid the trap of stagnation, with increased support for developers and new apps that make us want to pick up tablets again. Come through on that front, and we’ll be ready if a bigger (and <a href=\"https://www.theverge.com/22735454/google-foldable-phone-pixel-fold-pixel-6-samsung\">possibly foldable</a>?) Pixel is in the works.</p><aside id=\"em79u3\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Where is Google’s foldable phone? Everything we know so far \",\"url\":\"https://www.theverge.com/22735454/google-foldable-phone-pixel-fold-pixel-6-samsung\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/KmEyiqjeILjqHAIW0Aj7Ukm-5ow=/0x110:1440x864/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23305213/android_show_miner.jpg",
  "description": "Google’s Android 12L push is starting to make more sense",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}