{
  "title": "Google Messages users in India are reportedly drowning in ads",
  "url": "https://www.theverge.com/2022/5/18/23121150/google-messages-india-rcs-ads",
  "date": "2022-05-18T10:51:41.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uPVf7ffuCjxdtmQ40z6Pl-zX9Gk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70882121/rcs_static.0.png\" />    </figure>  <p id=\"SHRw4F\">Indian users of Google Messages are facing a deluge of ads within Android’s default messaging app, <a href=\"https://9to5google.com/2022/05/17/google-messages-rcs-ads-india/\"><em>9to5Google </em>reports</a>. Users are reporting being sent <a href=\"https://twitter.com/ishanagarwal24/status/1526200768398692353\">multiple ads a day</a>, even if they <a href=\"https://www.reddit.com/r/Android/comments/umh8pv/comment/i82gafx/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">enable the app’s Spam Protection feature</a>, and blocking and reporting the offending accounts doesn’t appear to prevent ads from different companies appearing. Many of the worst offenders appear to be ads for personal loans, gambling companies, and life insurance. </p><p id=\"cTS9EG\">As <em>9to5Google</em> notes, companies appear to be <a href=\"https://jibe.google.com/business-messaging/\">abusing an RCS feature</a> designed to let businesses contact their customers with rich, interactive media. Example’s listed on Google’s site include sending customers QR-code tickets, or letting them make online orders. Instead, some accounts that Google identifies as “Verified Business” are sending users in India a barrage of ads.</p><div id=\"Exo9b9\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">If you're wondering just how bad the ads in Google Messages can get, I got all these in just the last 7 hours. Amazing.<br><br>No normal consumer should have to face this on a basic &amp; necessary phone app.<a href=\"https://twitter.com/lockheimer?ref_src=twsrc%5Etfw\">@lockheimer</a>, is this what RCS &amp; Chat features are meant to be? <a href=\"https://t.co/a2i7H6xRYW\">https://t.co/a2i7H6xRYW</a> <a href=\"https://t.co/KqxFATDwwG\">pic.twitter.com/KqxFATDwwG</a></p>— Ishan Agarwal (@ishanagarwal24) <a href=\"https://twitter.com/ishanagarwal24/status/1526543220166930432?ref_src=twsrc%5Etfw\">May 17, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"O72XGj\">It’s unclear how widespread the issue currently is, but Indian-based Ishan Agarwal — whose recent tweets have drawn attention to the issue — tells <em>The Verge </em>that for him the problem has been growing worse over the course of 2022, and that he receives an average of between two and five ads a day now. <a href=\"https://www.androidpolice.com/sms-text-spam-google-messages-rcs-how-to-get-rid/\"><em>Android Police</em> reports</a> that the problem has been around for about a year, and complaints appear to be coming overwhelmingly from users based in India. </p><p id=\"LAqxXl\">Although blocking and reporting accounts prevents specific companies from continuing to send you spam, <em>Android Police</em> reports that the only way to stop receiving ads entirely is to disable Messages’ support for RCS (under “chat features” in settings). It’s a pretty damning measure to have to take considering <a href=\"https://www.theverge.com/2019/6/17/18681573/google-rcs-chat-android-texting-carriers-imessage-encryption\">how hard Google has been pushing RCS</a> as a successor to SMS and MMS. </p><p id=\"Vu8pjo\">Google did not respond to <em>The Verge</em>’s request for comment.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1N03UofPVCmNejlH61XsnbZNYLU=/0x344:4800x2857/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23522429/FS9e8sCUYAAGXBG.jpg",
  "description": "Including ads for gambling sites and personal loans.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}