{
  "title": "Google is releasing an open source harassment filter for journalists",
  "url": "https://www.theverge.com/2022/3/8/22966204/google-jigsaw-perspective-ai-twitter-moderation-harassment-manager-journalists",
  "date": "2022-03-08T10:00:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7BOOaFuMQhaSiI-easkwZpODswM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70592823/acastro_181017_1777_brain_ai_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"gVzkhG\">Google’s Jigsaw unit is releasing the code for an open source anti-harassment tool called <a href=\"https://github.com/conversationai/harassment-manager\">Harassment Manager</a>. The tool, intended for journalists and other public figures, employs Jigsaw’s Perspective API to let users sort through potentially abusive comments on social media platforms starting with Twitter. It’s debuting as source code for developers to build on, then being launched as a functional application for Thomson Reuters Foundation journalists in June.</p><p id=\"Q4Ok6Z\">Harassment Manager can currently work with Twitter’s API to combine moderation options — like hiding tweet replies and muting or blocking accounts — with a bulk filtering and reporting system. <a href=\"https://www.theverge.com/2017/2/23/14713496/google-jigsaw-perspective-software-ai-machine-learning-developers\">Perspective checks messages’ language</a> for levels of “toxicity” based on elements like threats, insults, and profanity. It sorts messages into queues on a dashboard, where users can address them in batches rather than individually through Twitter’s default moderation tools. They can choose to blur the text of the messages while they’re doing it, so they don’t need to read each one, and they can search for keywords in addition to using the automatically generated queues.</p>  <figure class=\"e-image\">        <img alt=\"A picture of the Harassment Manager dashboard as described in the post\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oKZLdoGZ0CXu-cCd5U_c-bbGHZg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23296479/Harassment_Manager_UI_Home.png\">      <cite>Google</cite>  </figure><p id=\"8nzP2X\">Harassment Manager also lets users download a standalone report containing abusive messages; this creates a paper trail for their employer or, in the case of illegal content like direct threats, law enforcement. For now, however, there’s not a standalone application that users can download. Instead, developers can freely build apps that incorporate its functionality and services using it will be launched by partners like the Thomson Reuters Foundation.</p><p id=\"iGy7FP\">Jigsaw announced Harassment Manager on International Women’s Day, and it framed the tool as particularly relevant to female journalists who face gender-based abuse, highlighting input from “journalists and activists with large Twitter presences” as well as nonprofits like the International Women’s Media Foundation and the Committee To Protect Journalists. <a href=\"https://medium.com/@JigsawTeam/5edcac127872\">In a Medium post</a>, the team says it’s hoping developers can tailor it for other at-risk social media users. “Our hope is that this technology provides a resource for people who are facing harassment online, especially female journalists, activists, politicians and other public figures, who deal with disproportionately high toxicity online,” the post reads.</p>  <figure class=\"e-image\">        <img alt=\"A screenshot of the reporting option in Jigsaw’s Harassment Manager\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rIXBwuMh-UIDw1Bfcyaboh59y9s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23296755/Harassment_Manager_UI_Edit_Report_Details.png\">  </figure><p id=\"de2vqm\">Google has harnessed Perspective for automated moderation before. In 2019 it <a href=\"https://www.theverge.com/2019/3/14/18265851/alphabet-google-jigsaw-tune-chrome-extension\">released a browser extension called Tune</a> that let social media users avoid seeing messages with a high chance of being toxic, and it’s been used by <a href=\"https://venturebeat.com/2021/02/08/jigsaws-ai-powered-toxic-language-detector-is-now-processing-500-million-requests-daily/\">many commenting platforms</a> (including Vox Media’s Coral) to supplement human moderation. But as we noted around <a href=\"https://www.theverge.com/2017/2/23/14713496/google-jigsaw-perspective-software-ai-machine-learning-developers\">the release of Perspective</a> and Tune, the language analysis model has historically been far from perfect. It sometimes misclassifies satirical content or fails to detect abusive messages, and Jigsaw-style AI can <a href=\"https://venturebeat.com/2021/12/09/how-bias-creeps-into-the-ai-designed-to-detect-toxicity/\">inadvertently associate terms</a> like “blind” or “deaf” — which aren’t necessarily negative — with toxicity. Jigsaw itself has also been criticized for a <a href=\"https://www.vice.com/en/article/vb98pb/google-jigsaw-became-toxic-mess\">toxic workplace culture</a>, although Google has disputed the claims.</p><p id=\"5lfX1a\">Unlike <a href=\"https://www.wired.com/story/twitter-instagram-unveil-new-ways-combat-hate-again/\">AI-powered moderation</a> on services like Twitter and Instagram, however, Harassment Manager isn’t a platform-side moderation feature. It’s apparently a sorting tool for helping manage the sometimes overwhelming scale of social media feedback, something that could be relevant for people far outside the realm of journalism — even if they can’t use it for now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UF6s847b-bMflVSekT969wAXZ9Q=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13292777/acastro_181017_1777_brain_ai_0001.jpg",
  "description": "An AI tool for fighting Twitter dogpiles.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}