{
  "title": "Google wins court battle with Genius over song lyrics",
  "url": "https://www.theverge.com/2022/3/11/22973282/google-wins-court-battle-genius-song-lyrics-copyright",
  "date": "2022-03-11T23:05:47.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BDsAPW1EKelJ9GjL2efCa2Tkhqo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70611238/acastro_210104_1777_google_0001.0.jpg\" />        <figcaption>Google won its court fight with Genius  | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"tz8ZAV\">Google has once again prevailed in an ongoing legal battle with song lyrics website Genius, which claimed that Google was using its transcribed lyrics without permission in search results.</p><p id=\"ixksv8\">Genius sued Google in 2019, arguing that Google was scraping lyrics from its website in violation of Genius’ copyright. Genius has a large database of song lyrics, and bills itself as “the world’s biggest music encyclopedia.”  It tried to demonstrate that Google was scraping info from its website by putting watermarks on its lyrics, which it said then appeared in Google searches but without any link back or attribution to Genius.</p><p id=\"xf8L2e\">Google <a href=\"https://blog.google/products/search/how-we-help-you-find-lyrics-google-search/\">said in a blog post</a> at the time that it did not “crawl or scrape websites to source” song lyrics. Canadian lyrics licensing site LyricFind, also a defendant in the Genius lawsuit, licenses its lyric transcriptions to Google. </p><p id=\"R28NSi\"><a href=\"https://www.theverge.com/2020/8/11/21363692/google-genius-lyrics-lawsuit-scraping-copyright-yelp-antitrust-competition\">Judge Margo Brodie ruled in August 2020</a> that while Genius’ claims of scraping appeared credible, they didn’t constitute a copyright violation since Genius isn’t the actual copyright holder of the lyrics, which she said belonged to the musicians who wrote them. Genius licenses the lyrics, adding to them through derivative works such as annotations, but Brodie said that didn’t give Genius ownership over the actual lyrics themselves. </p><p id=\"PT0pcr\">On Thursday, a three-judge panel in the 2nd Circuit affirmed the earlier decision, writing that the lyrics are protected by copyrights that Genius doesn’t own. </p><div id=\"pWgrUH\"><iframe src=\"https://embed.documentcloud.org/documents/21410167-google-genius-copyright-lyrics-case/?embed=1&amp;responsive=1&amp;title=1\" title=\"google genius copyright lyrics case (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/Vmabvy_JzygMs_5vzL_RDZQ8GOY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22215403/acastro_210104_1777_google_0001.jpg",
  "description": "The lyrics’ copyrights don’t belong to Genius",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}