{
  "title": "Google Assistant is not rolling out to the Galaxy Watch 4 today",
  "url": "https://www.theverge.com/2022/4/20/23034335/google-assistant-samsung-galaxy-watch-4-wear-os",
  "date": "2022-04-20T21:02:48.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Most of the pre-installed apps on the Galaxy Watch 4 come from Samsung.\" src=\"https://cdn.vox-cdn.com/thumbor/sSjI2ZhP6USwF5gC2IPjwzl93B8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70773395/dbohn_210816_4717_0002.0.jpg\" />        <figcaption><em>The Google Play Store was a big reason why Samsung made the switch to Wear OS.</em> | Photo by Dieter Bohn / The Verge</figcaption>    </figure>  <p id=\"ppiyrT\">There was one notable omission when the Samsung Galaxy Watch 4 lineup launched last year: Google Assistant. As for when it would arrive, Google and Samsung have avoided giving firm dates, but there was reason to hope the digital assistant might arrive sooner than expected. Earlier today, Verizon update logs for both the <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.verizon.com/support/samsung-galaxy-watch4-update/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Galaxy Watch 4</a> and <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.verizon.com/support/samsung-galaxy-watch4-update/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Galaxy Watch 4 Classic</a> indicated Google had arrived in an update. However, Google has told <em>The Verge </em>that this is not the case.</p><p id=\"YW4pyy\">“To confirm, Assistant is not rolling out to Galaxy Watch 4 and we don’t have an update on timing,” Google spokesperson Ivy Hunt told <em>The Verge </em>in an email. </p><p id=\"B9LaKr\">The Verizon update logs, which were first <a href=\"https://9to5google.com/2022/04/20/galaxy-watch-4-assistant-update/\">spotted by <em>9to5Google</em></a>, refer to a software update released today. As for Google Assistant, the logs say, “If you have Google Assistant downloaded, it will show up in the settings menu under ‘Google Accounts.’” There’s also a <a href=\"https://scache.vzw.com/content/dam/support/softwareupdateimages/samsung/galaxy-watch4/su4/google-assistant.png\">grainy screenshot</a> showing that you can head to Settings &gt; Google &gt; Google Assistant to access setting toggles for the wake phrase and speech output. </p><div><aside id=\"v374Op\"><q>“To confirm, Assistant is not rolling out to Galaxy Watch 4 and we don’t have an update on timing.”</q></aside></div><p id=\"RT8Zex\">Despite the report, <em>The Verge</em> was unable to confirm the update ourselves. We checked our Bluetooth and Wi-Fi review units, and no Google Assistant update had arrived. We also checked the Google Play Store. Nothing there, either. Given Google’s comment, it appears this whole thing may have been a big ole error.</p><p id=\"GvTgX9\">We’ve reached out to Verizon and Samsung for further clarification but did not immediately receive a response. </p><p id=\"p4zJii\">The ability to choose between applications was a key highlight when Google and Samsung announced <a href=\"https://www.theverge.com/2021/5/18/22440483/samsung-smartwatch-google-wearos-tizen-watch\">their Wear OS partnership</a> last year. Previous versions of the Galaxy Watch ran on Samsung’s proprietary Tizen operating system. That meant users were shoehorned into using Samsung-specific features like Samsung Pay and... Bixby. For Samsung, switching over to Wear OS was meant to broaden access to third-party apps — a major weak point of its Tizen smartwatches. Case in point, Galaxy Watch 4 and Watch 4 Classic owners who prefer Google Pay can now opt to use that instead of Samsung Pay.</p><div class=\"c-float-right\"><aside id=\"yMHhRJ\"><q>For Samsung, switching over to Wear OS was meant to broaden access to third-party apps</q></aside></div><p id=\"es8AvO\">The Galaxy Watch 4 lineup still comes preinstalled with Bixby, Samsung’s own digital assistant. Bixby is... Bixby. While some Samsung users don’t mind Bixby, others have loudly <a href=\"https://www.reddit.com/r/samsung/comments/8eudcc/dear_samsung_your_bixby_sucks/\">expressed their distaste</a>. Regardless of your feelings, Bixby is nowhere near as popular as Amazon Alexa, Siri, or Google Assistant. Meanwhile, Google Assistant has long been one of the most useful Wear OS features. </p><p id=\"LtEzBM\">These are major reasons why Google Assistant’s arrival on Wear OS 3 is one of the most anticipated updates for the platform. While it’s not coming today, there’s a chance we might hear something at next month’s Google I/O. That said, Samsung was purposefully vague when it reassured users in February that Google Assistant would be <a href=\"https://www.theverge.com/2022/2/7/22921615/samsung-galaxy-watch-4-wear-os-google-assistant-wearables-smartwatch\">available “in the coming months.”</a> At least that part doesn’t seem to have changed.</p><aside id=\"TtrBm3\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Galaxy Watch 4 review: welcome to Samsung’s garden\",\"url\":\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/bYcLW_0oZhZHZKWkBcdVWOsW8X4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22787996/dbohn_210816_4717_0002.jpg",
  "description": "You’re still going to have to wait.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}