{
  "title": "Google Stadia has reportedly been demoted, but it might show up in your Peloton ",
  "url": "https://www.theverge.com/2022/2/4/22917999/google-stadia-white-label-peloton-bungie-capcom",
  "date": "2022-02-04T18:58:19.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KgmTUORdJk2buj2PQEeggJkZDqI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472190/akrales_191113_3779_0309.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"8u1yrj\">One year after Google revealed it now saw Google Stadia cloud gaming idea <a href=\"https://www.theverge.com/22260994/google-stadia-platform-white-label-option\">as a mere  “technology platform for industry partners”</a> rather than a true rival to Sony, Nintendo, and Microsoft, <a href=\"https://www.businessinsider.com/google-stadia-stream-plan-partnerships-peloton-bungie-gaming-service-2022-2?r=US&amp;IR=T\"><em>Business Insider</em> is reporting</a> that some Stadia gamers’ fears have come true: the entire Stadia project has been demoted within Google, and its new priority is to power experiences from companies including Peloton, Bungie, and Capcom rather than attracting more games to Stadia itself.</p><p id=\"TiE1zg\">In fact, Peloton bike owners might have already experienced the fruits of those labors — <em>BI </em>reports that Peloton’s very first video game, <em>Lanebreak</em>, was actually powered by Google’s cloud gaming technology, now dubbed Google Stream. (That’s one way to put a game inside your exercise machine!)</p><p id=\"I6e280\">But if you were hoping that Google Stadia’s own cloud gaming platform would pull itself out   of its current precarious situation (where only Ubisoft is continuing to contribute its latest and greatest games),<em> BI</em>’s sources suggest that’s not likely:</p><blockquote><p id=\"vgY4Ge\">Current and former employees said the priority was now on proof-of-concept work for Google Stream and securing white-label deals. One estimated about 20% of the focus was on the consumer platform.</p><p id=\"Q246Nk\">“There are plenty of people internally who would love to keep it going, so they are working really hard to make sure it doesn’t die,” they said. “But they’re not the ones writing the checks.”</p></blockquote><p id=\"FDA1pn\">Two sources told <em>BI </em>that Google Stadia boss Phil Harrison now reports to Jason Rosenthal, Google’s vice president of subscription services, instead of directly to Google hardware boss Rick Osterloh. That’s a demotion for the entire Stadia division, though that’s perhaps not too much of a surprise: Stadia wasn’t meeting Google’s internal expectations, drastically missing sales targets, despite paying tens of millions of dollars per game just to secure ports for the platform, <a href=\"https://www.theverge.com/2021/2/26/22303496/google-stadia-struggle-wired-bloomberg-reports-studios\">according to reports last year</a>.</p><p id=\"s5aOWb\">Peloton isn’t the only company that’s been quietly using Google Stadia as a white-label service: <a href=\"https://www.theverge.com/2021/10/21/22738550/arkham-knight-google-stadia-att\">AT&amp;T confirmed that its free browser-based access to <em>Batman: Arkham Knight</em> last October ran on Stadia tech</a>. Capcom is in talks to do the same with web-based demos of its games, too, according to the new report. And <em>Destiny </em>developer Bungie, <a href=\"https://www.theverge.com/22910846/sony-bungie-acquisition-playstation-destiny-halo\">which Sony is currently buying for $3.6 billion</a><em>, </em>was looking to build its own streaming platform on top of Google Stream, according to <em>BI</em>. </p><p id=\"ImqNJ6\">White-labeling isn’t necessarily a bad fate for Google Stadia, <a href=\"https://www.theverge.com/22260994/google-stadia-platform-white-label-option\">as I wrote a year ago</a>. But it’s a reason to think twice about buying a game on Google Stadia’s consumer cloud gaming platform when it’s ever clearer that Google’s heart isn’t in that part of the business. At least, not until <a href=\"https://www.theverge.com/2021/6/23/22547334/cloud-gaming-xbox-xcloud-microsoft-streaming-google-stadia-amazon\">some of the hard questions get answered</a>. </p><p id=\"am71HT\">Google spokesperson Patrick Seybold provided us with this statement on the matter:</p><blockquote><p id=\"KRpqdS\">We announced our intentions of helping publishers and partners deliver games directly to gamers last year, and have been working toward that.  The first manifestation has been our partnership with AT&amp;T who is offering Batman: Arkham Knight available to their customers for free.  While we won’t be commenting on any rumors or speculation regarding other industry partners, we are still focused on bringing great games to Stadia in 2022. With 200+ titles currently available, we expect to have another 100+ games added to the platform this year, and currently have 50 games available to claim in Stadia Pro.</p></blockquote><p id=\"YltC9M\">Peloton wouldn’t comment to <em>The Verge</em>.</p><aside id=\"axIQ8f\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The writing’s on the wall for Google Stadia\",\"url\":\"https://www.theverge.com/22260994/google-stadia-platform-white-label-option\"},{\"title\":\"To succeed, cloud gaming needs to disappear\",\"url\":\"https://www.theverge.com/2021/6/23/22547334/cloud-gaming-xbox-xcloud-microsoft-streaming-google-stadia-amazon\"},{\"title\":\"Hands-on: Nvidia’s GeForce Now just leapfrogged Google Stadia\",\"url\":\"https://www.theverge.com/22750246/nvidia-geforce-now-rtx-3080-google-stadia-cloud-gaming\"},{\"title\":\"Google Stadia’s director of games has left for Google Cloud\",\"url\":\"https://www.theverge.com/2021/9/9/22665805/google-stadia-jack-buser-games-cloud\"}]}'></div></aside><p id=\"7ek6PW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/cO5FcxHSZFnj_PQXAOYZVtELiik=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19376603/akrales_191113_3779_0309.jpg",
  "description": "Bungie and Capcom might be interested, too.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}