{
  "title": "Google Play Store’s app privacy labels start appearing",
  "url": "https://www.theverge.com/2022/4/26/23042343/google-play-store-safety-section-android-data-collection-security",
  "date": "2022-04-26T15:30:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/z-8j66--c9OXHMZCa3AllRiREw4=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70795036/Landing_Page_GIF.0.jpg\" />        <figcaption><em>Google Play’s new safety section.</em> | Image: Google</figcaption>    </figure>  <p id=\"oP8IJJ\">Google is rolling out a new safety section in the Play Store designed to show users more detail about the data apps collect and how it is used, the company has announced. The section will be gradually rolling out for users over the coming weeks, and app developers have until July 20th to add the information to their listings — so the section may not immediately appear for everyone. The initiative was <a href=\"https://www.theverge.com/2021/5/6/22422894/google-play-app-privacy-info-apple-app-store-labels\">first announced last year</a>.</p><p id=\"y6lpD6\">According to Google, the section is an attempt to give users more information and context. It’ll list the data each developer is collecting, if they share it, and their security practices (such as whether they encrypt the data while in transit). There will also be information on whether a developer follows Google Play’s Families Policy as well as if their security practices have received third-party validation. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DDxfgHWeoTvNuZ0HloAgX9XWJ4Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23416669/Expanded_view_GIF.jpg\">      <cite>Image: Google</cite>      <figcaption><em>Sections can be expanded to see more info.</em></figcaption>  </figure><p id=\"ZFFjoW\">More information on what developers need to disclose can be found <a href=\"https://support.google.com/googleplay/android-developer/answer/10787469?hl=en\">on this support page</a>. According to the page, misrepresenting an app’s data collection practices or otherwise failing to fill out this section could mean that an app’s updates are blocked, and it may even be removed from the Play Store. “Even developers with apps that do not collect any user data are required to complete this form and provide a link to their privacy policy,” the page says. </p><p id=\"IQTl8H\">The Play Store’s newfound transparency follows the launch of a <a href=\"https://www.theverge.com/2020/12/14/22174017/apple-app-store-new-privacy-labels-ios-apps-public\">similar feature on Apple’s App Store</a> in late 2020. But Google’s support page notes that its safety section is not necessarily a one-to-one counterpart to Apple’s, so developers cannot expect to provide exactly the same information to both. “The taxonomy and framework of the Data safety section on Google Play may differ materially from those used in other app stores,” the page reads.</p><p id=\"anmh4z\">The initiative is part of Google’s ongoing attempts to ensure that Play Store apps respect user privacy. Earlier this month it announced plans to <a href=\"https://www.theverge.com/2022/4/7/23014518/google-play-store-cracks-down-on-outdated-apps\">restrict the availability</a> of outdated apps on the Play Store in an attempt to ensure that those available for download are using Android’s latest privacy and security features.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iwi7LNVssmZKM1hh5qdx67erw3Q=/0x113:1920x1118/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23416668/Landing_Page_GIF.jpg",
  "description": "Developers have until July 20th to submit their info.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}