{
  "title": "Google Stadia is subtly reinventing itself to attract new games and gamers",
  "url": "https://www.theverge.com/2022/3/15/22978719/google-stadia-cloud-gaming-free-trial",
  "date": "2022-03-15T16:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/g2vS2qvkkR9zJSFdcXr81MrVpgU=/0x0:1475x983/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70625541/stadia.0.jpg\" />        <figcaption>Image: Google</figcaption>    </figure>  <p id=\"wDPvkS\">Google’s Stadia cloud gaming service <a href=\"https://www.theverge.com/2019/11/18/20970297/google-stadia-review-gaming-streaming-cloud-price-specs-features-chrome-pixel\">didn’t stick the landing</a>, and it’s been <a href=\"https://www.theverge.com/2022/2/4/22917999/google-stadia-white-label-peloton-bungie-capcom\">a rough ride since</a>. But today, at the <a href=\"https://gamedevsummit.withgoogle.com/\">Google for Games Summit</a>, it feels like Stadia might be moving in a promising direction — one that gives both gamers and game developers a reason to pay attention. And the magic word is “free.” Free demos, free trials, free for developers to offer, and hopefully free of <a href=\"https://www.theverge.com/2021/6/23/22547334/cloud-gaming-xbox-xcloud-microsoft-streaming-google-stadia-amazon\">the friction</a> that made Stadia a difficult investment to start.</p><p id=\"pJfcdu\">I want to start off with something I wrote last February, <a href=\"https://www.theverge.com/22260994/google-stadia-platform-white-label-option\">when I explained</a> how Google had drastically reduced its Stadia ambitions from what was effectively “become a game company” to “offer a white-label service to game publishers” instead. I wrote:</p><blockquote><p id=\"19sOAZ\">There’s nothing inherently wrong with white-labeling. </p><p id=\"O6jbpk\">Done properly, it might even unlock one of the most magical things about cloud gaming: the ability to instantly try a game no matter where you are. While companies like Google already claim games are “instantly available,” what they really mean is “after you sign up, log in, and sometimes buy a game.” That’s partly due to the complex web of licensing agreements that game publishers make cloud services sign. But if game publishers were in charge of their own games, they might feel differently. They could give you Gaikai-esque instant access game demos again, ones where you could tap a YouTube advertisement for a game and <em>actually</em> start playing it, no friction whatsoever.</p></blockquote><p id=\"mbqAGs\">Everything Google is announcing today points Stadia in that general direction.</p><p id=\"Nl1ndJ\">This year, Google will:</p><ul><li id=\"EelUOM\">Let any Stadia game developer offer an instantly accessible free trial of their game that will no longer require you to log into a Stadia account to play — just a couple of clicks from YouTube, a Google Search ad, social media, etc.</li><li id=\"fodWZm\">Let people actually browse the Stadia store for those free trials, outright free games, and games to purchase without even needing to log into a Google account, much less Stadia</li><li id=\"9tv3TW\">Let developers port their Unreal Engine and Unity games to Stadia more easily, with tools like <a href=\"https://github.com/doitsujin/dxvk\">DXVK</a> to automatically translate DirectX APIs — “so developers don’t have to modify their game renderer at all,” writes Stadia rep Justin Rende</li><li id=\"R7AZsF\">Let white-label partners like AT&amp;T <a href=\"https://games.withgoogle.com/resources/collections/immersivestreamform/\">sign up</a> to take Google’s technology to offer free demos and paid games of their own, a B2B offering now dubbed “Immersive Stream for Games”</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vOnUOKdLxIoGWbljxjqpUlM0N9E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23317072/stadia_onboard_free_trial.gif\">      <cite>GIF by Google</cite>      <figcaption><em>Google suggests trying a game is this easy now — easier if you click a direct link instead of browsing.</em></figcaption>  </figure><p id=\"9kAeYG\">The pitch, in short, sounds like this: For developers, it’s free and easy to bring your games to Google’s cloud platform and put them in front of anyone instantly. For gamers, Stadia is now a place to browse games you might like to try-before-you-buy, no risk whatsoever — and if you like what you’re playing, you can continue playing it as long as you like, wherever you like, for one simple payment at the end of your free trial.</p><div class=\"c-float-right\"><aside id=\"M4vhrt\"><q>No, Google isn’t bringing Windows games to Stadia</q></aside></div><p id=\"ClSNL0\">There is one thing you shouldn’t necessarily expect, though, even though Google will be talking about it today: the company <em>isn’t</em> making its own emulator <a href=\"https://www.theverge.com/2022/3/9/22969081/google-windows-games-stadia-emulator\">to bring Windows games to Stadia</a>. I got a peek at the presentation, and it’s more of a suggestion and a tutorial on how to use binary translation techniques than anything else. “This is not a reveal of a finished product or feature available to Stadia developers,” the company writes.</p><p id=\"OCLvNL\">Without that, the big question is how much friction still remains. I definitely have no experience porting games between platforms, so I can’t comment there, but even the free trial experience for players doesn’t <em>quite</em> like the instantaneous dream since you’ll still need to be logged into a Google account for now. But Stadia spokesperson Justin Rende also says the company is still “continuing to experiment with the goal of removing friction where we can,” and not having to verify a Google account when diving into Stadia would be a big step <a href=\"https://www.theverge.com/2021/10/26/22747836/google-stadia-cloud-gaming-free-trial-30-minutes\">compared to Google’s early free trials in October</a>. The fewer clicks, the better.</p><p id=\"dEsZRb\">And it’s hard to beat free.  </p><p id=\"aqxSRp\">I suppose it’s not <em>that</em> hard to find free<em> games</em> these days — the Epic Games Store gives some away every Friday, and free-to-play titles like <em>Fortnite</em> and <em>Genshin Impact</em> dominate the world. But finding a free cloud gaming PC to play them on, when you’ve only got a phone or a tablet or a weak laptop, is another thing entirely. I’d have killed for that as a kid. </p><p id=\"7iWXbN\">If your internet connection is up for it, you can already play <em>Crayta, Destiny 2</em>, <em>Hitman</em>, <em>PUBG, Super Bomberman R Online</em>, and a handful of big game demos like <em>Rainbow Six: Extraction</em> and <em>Resident Evil Village</em> for free on Stadia. Today, it’ll bring a free timed trial of <em>Risk of Rain 2</em> as well, and Google says AT&amp;T will soon announce another game beyond <a href=\"https://www.theverge.com/2021/10/21/22738550/arkham-knight-google-stadia-att\">the free <em>Batman: Arkham Knight</em> sessions it offered last October</a>.</p><p id=\"gbsngf\">I’ll be eager to see if Google’s changes entice companies to bring a whole lot more free stuff to Stadia — and how all of it might tie into <a href=\"https://www.theverge.com/2021/8/19/22631907/google-gaming-vision-android-windows-mac-cross-screen-controller\">its once-secret vision to become the world’s largest games platform</a>. </p><p id=\"C7ATrG\">If you’re interested, <a href=\"https://gamedevsummit.withgoogle.com/\">you can watch the Google for Games Summit here</a>.</p><aside id=\"EmlEd4\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"To succeed, cloud gaming needs to disappear\",\"url\":\"https://www.theverge.com/2021/6/23/22547334/cloud-gaming-xbox-xcloud-microsoft-streaming-google-stadia-amazon\"},{\"title\":\"Google secretly had a giant gaming vision that includes bringing games to Mac\",\"url\":\"https://www.theverge.com/2021/8/19/22631907/google-gaming-vision-android-windows-mac-cross-screen-controller\"}]}'></div></aside><p id=\"bP03DU\"></p><p id=\"ot2Ngs\"></p><p id=\"Yx3DaM\"></p><p id=\"u8AELJ\"></p><p id=\"mUyv8U\"></p><p id=\"hsAYj2\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WYSvnh90XBzw6OMgUihH7vXIymg=/0x134:1475x906/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972837/stadia.jpg",
  "description": "But it doesn’t have a Windows emulator up its sleeves",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}