{
  "title": "Google’s making a free Workspace tier for businesses that don’t need its email",
  "url": "https://www.theverge.com/2022/2/3/22916599/google-workspace-essentials-starter-business-email-collaboration",
  "date": "2022-02-03T22:58:02.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3lv14JGvFseVbLB0sY3YbPBAzkA=/99x0:1301x801/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70468785/unnamed.0.png\" />        <figcaption><em>Workspace Essentials Starter is basically Workspace without Gmail.</em> | Image: Google</figcaption>    </figure>  <p id=\"Fgefck\">Google <a href=\"https://cloud.google.com/blog/products/workspace/unlock-collaboration-with-google-workspace-essentials\">has announced</a> a new, free tier of its Workspace suite, Workspace Essentials Starter. Basically, it lets workers use tools like Google Docs, Sheets, Chat, etc. with their co-workers without requiring them to switch over to Gmail if they’re already using something like Exchange or Zoho. While employees have long been able to replicate this use case with personal Google accounts, having an official product for it could help with security and make it easier to manage a team of people working together.</p><p id=\"aIcTwr\">According to <a href=\"https://cloud.google.com/blog/products/workspace/unlock-collaboration-with-google-workspace-essentials\">Google’s blog post</a>, users will be able to sign up for Essentials Starter using their existing email accounts and will then be able to invite their co-workers to work on projects with them. Google’s providing 15 GB of Drive storage for each user, which isn’t a ton of room for sharing media files but should be able to hold plenty of text documents, slide shows, and spreadsheets. And even though the plan doesn’t provide email, employees will still be able to talk to each other using Chat and Meet.</p><div class=\"c-float-right\"><aside id=\"GCPMAc\"><q>Essentials Starter could be a Trojan horse into IT departments</q></aside></div><p id=\"OubVNl\">Google says Workspace Essentials Starter is designed to make it “easy for employees to choose their own productivity tools and bring modern collaboration to work.” That seems nice for employees, but perhaps a bit of a hassle for IT. <a href=\"https://techcrunch.com/2022/02/03/google-workspace-goes-all-in-on-shadow-it/\">As <em>TechCrunch</em> points out</a>, it does seem like the plan could act as a sort of Trojan horse — since it doesn’t require (or even allow for) the intense administrative control that IT departments sometimes hold over workplace tools, Workspace Essentials Starter could be a way to get workers used to and using Google’s tools. </p><p id=\"PF1OJs\">According to <a href=\"https://support.google.com/a/users/answer/7681288\">a Google support page about the plan</a>, teams are limited to 25 people, but an unlimited number of teams in an organization can sign up. There are also, of course, limits on what you get access to using the free version — you’re not going to get support from Google, and Meetings and Chats all have some limitations when compared to the paid Enterprise Essentials plan. Google says that Essentials Starter is “rolling out over a multiple-week period and might not be available in some regions until mid-February, 2022.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0I32TaViWKyvUiZfVgyPbu_u9Mw=/0x35:1400x768/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23216532/unnamed.png",
  "description": "A way to get teams using Docs and Chat, but not Gmail",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}