{
  "title": "Government surveillance, Elon Musk, and free speech, with EFF executive director Cindy Cohn",
  "url": "https://www.theverge.com/23041249/elon-musk-free-speech-decoder-interview-podcast-cindy-cohn",
  "date": "2022-04-26T14:15:00.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gi9pTZr4GYQDXIjYBK0iCFpyWXU=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70794635/VRG_ILLO_Decoder_Cindy_Cohn.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>On the frontier of fighting the NSA</p> <p class=\"p--has-dropcap p-large-text\" id=\"cshOHc\">Cindy Cohn is the executive director of the <a href=\"https://www.eff.org\">Electronic Frontier Foundation</a>, or EFF. If you’re an internet user of a certain age like me, you know the EFF as the premier civil liberties group for the internet. The EFF has fought pitched battles against things like government surveillance, digital rights management for music and movies, and government speech regulations that would violate the First Amendment. These fights were important and shaped the internet as we know it today.</p><p id=\"8ryV91\">But now the EFF is 32 years old, and a lot of those controversies aren’t really about the government anymore. Private platform companies like Twitter and Apple and Google have an enormous amount of power over what people do on the internet, and government regulation doesn’t seem like nearly as much of a threat in comparison. So, I wanted to talk to Cindy about balancing between consumer advocacy and civil liberties in a time of giants. </p><p id=\"0zAKTY\">That’s a tricky balance, and it’s repeated across the entire industry right now — maybe most of all in content moderation, where the First Amendment prevents the government from passing moderation standards for social media companies. <em>But</em> those same social media companies are under a ton of pressure to increase and decrease their moderation all at once. So, you know we talked about Elon and Twitter. It’s a good one.</p><p id=\"qZIEN6\">Okay, Cindy Cohn, the executive director of the Electronic Frontier Foundation. Here we go. </p><p id=\"c9w3hC\"></p><div id=\"5fkt4V\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP4229156205\" width=\"100%\"></iframe></div><p id=\"EGD3ra\"><em>This transcript has been lightly edited for clarity.</em></p><p id=\"5jaIDD\"></p><p id=\"oxOm65\"><strong>Cindy Cohn is the executive director of the Electronic Frontier Foundation or </strong><a href=\"https://www.eff.org\"><strong>EFF</strong></a><strong>. Welcome to </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"P2seG9\">Thank you.</p><p id=\"eoXKzT\"><strong>I have been dying to talk to you forever. I went from being a sort of hopeless college student to knowing I wanted to be a lawyer, then to this career because the EFF showed up in my life at a very formative moment. It all happened in the Napster era.</strong></p><p id=\"HTDb0N\">Nice.</p><p id=\"1JlJFQ\"><strong>It is a bit of a thrill to talk to you. I just need to do a good job by the audience of </strong><em><strong>Decoder</strong></em><strong> and start at the beginning, not fall deeply into the weeds of the EFF right away. Tell people what the EFF is and what it does.</strong></p><p id=\"EdxpN7\">So the Electronic Frontier Foundation is 32 years old. We are the first, the oldest, and the biggest digital rights organization in the world. We were founded by some very forward-looking folks who realized that as the world moved online, we were going to need people who were there to stand up for users and for basic civil liberties and rights. I sometimes say, “We make sure that when you go online, your rights go with you.” </p><p id=\"ExljKj\">That is how we started. We have about 100 people now, and we have three big strains: We have lawyers, we have activists, and we have technologists. We work together on things to try to bring about a better digital world than the one we might otherwise have.</p><p id=\"XWuYs7\"><strong>That is really interesting. Usually when you think about rights, you think about governments. I really want to talk to you about the interplay between users, giant corporations, and governments, which seems more complicated than ever. You said you have three big strains: lawyers, activists, and technologists. Is that how you are structured? Do you have a legal division, an activism division, and a technology division?</strong></p><p id=\"pgtEOg\">Yep, absolutely. Then we have our creative types, artists on staff who kind of sit in the middle and help all of us.</p><p id=\"hKgoHi\"><strong>So you have 100  people who are lawyers, activists, technologists, and some artists. Where does the money come from?</strong></p><p id=\"79CbgS\">EFF is member-supported. We have somewhere in the neighborhood of 45,000 members who give us their hard-earned cash to make sure that users’ rights are protected. We also have some support from big philanthropy, like the MacArthur Foundation and the Open Society Foundations. We actually have our own podcast, <a href=\"https://www.eff.org/taxonomy/term/11579/\"><em>How to Fix the Internet</em></a>, which is supported by the Sloan Foundation. So we have some foundation support and a little bit of corporate support, but over half of our money comes from individuals. Then over half of that comes from people who give us $1,000 or less. </p><p id=\"A3hcre\">We are not beholden to anybody. Our job is to say what’s best in the public interest. Luckily, our funding is broad enough that if somebody wants to come to us and have some strings attached about what we might do, we just tell them no. That does happen.</p><p id=\"0RPF3b\"><strong>One of the interesting things about talking to folks in your position is that I get to ask questions like, “What is the job like?” Depending on the setting, sometimes people say, “There is a big side to this. I didn’t realize this whole job was about raising money.” Though sometimes we are on a stage and it’s just, “The job is great.” Is that the background for you as executive director? Are you out raising money a lot?</strong></p><p id=\"Vp976Z\">I would say it is about a third of what I do. I am pretty lucky because EFF is a membership organization, and we have a membership team. Most of the money does not come through me as the executive director meeting with somebody important and shaking their hand. There is a piece of that, but most of our money comes from people who see what we do out in the world, come to our website, and donate. </p><p id=\"xm0Dhb\">We also go to tech conferences. If you go to Def Con or any hacker conferences, there is usually an EFF booth there. People will come by and sometimes just throw cash at us because they do not want their name associated. Sometimes there are other things.</p><p id=\"iLGqFe\">I don’t have to do as much as other executive directors because of the way EFF works. I get to do other things, and directly participate in a good chunk of our work. I am the lawyer on the top of the pleadings on things that we do, and in the background, I really just help feed the cats. EFF is 100 very committed, very smart, very good activists. Making sure that they are all pointed in the same direction and get all the care and feeding that they need to be able to focus on their jobs is a whole other chunk of what happens in my day.</p><p id=\"ChNHvA\"><strong>Let’s talk about that group of people, your lawyers and activists. Are the lawyers filing lawsuits all day, are they writing amicus briefs? What are they actually doing with that time? How do you structure that?</strong></p><div class=\"c-float-right c-float-hang\"><div id=\"ynv0YZ\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"p7lJsc\">It really depends on what the issue needs, but yes. We do direct representation of people and have taken at least one case to the Supreme Court; we have been amicus in almost every case that has tech in it that you have ever heard of. We have a whole support network of cooperating attorneys who help people get counsel if it is not a case that we can handle. </p><p id=\"ZFQH4f\">We also get engaged in policy debates as well, so we have a legislative team. We work in Congress and in the state legislatures, especially in California, because so much of tech is based there. If you have a good law in California, you protect a lot of people. We have a very involved international team.<a href=\"https://www.theverge.com/22981261/margrethe-vestager-decoder-antitrust-eu-apple-facebook-google-jedi-blue\"> The EU right now is increasingly regulating tech</a>, and we try to have a voice in that, as well as other places around the world.</p><p id=\"k96R7E\">I think on an average day, it is hard to predict what the lawyers will be doing. We do the whole range of things and try to take a look at the topic and figure out, “Okay, which of the tools in our toolbox is the right one for this problem?” We are not afraid to actually stand up in front of the judge and say, “This is the way the Constitution should be interpreted.” I think for every single one of our lawyers, a core piece of why you come to EFF is that you get to do that work. You get to stand up for the public interest in the judicial branch, but we don’t leave the other two branches out.</p><p id=\"UhY8sM\"><strong>I feel like I can probably guess that the way you measure success there is by wins and losses in court. That’s pretty easy for lawyers, but you also mentioned activists. What do the activists do and how do you measure their success?</strong></p><p id=\"giUcmp\">The activists will run campaigns, like “write your congressman.” There are a couple of bad copyright bills right now in Congress, and our activists are trying to get people’s voices heard to make sure that Congress understands where the public interest lies. If you sit in Congress, you hear from all the different business groups. Then there is the civil society — the voice that is the users — which is either just a couple people or nobody at all. You might begin to think that certain situations are just about one company versus another. </p><p id=\"UtKhor\">We saw that in the copyright fights, often when we go to Congress, they would think, “Well, isn’t this just a fight between technology companies like Google, and the content industry or Hollywood?” We would respond, “No, actually, the users are here.” People want to be able to make videos and they want to be able to play with their culture. That voice has to be there.</p><p id=\"aydpw5\">The activists run a lot of that work. They also help make sure that what the lawyers and the technologists are doing gets out into the world, whether that is through blog posts, press releases, or events. Occasionally, we will do big splashy things to try to draw attention. When <a href=\"https://www.theverge.com/22617554/apple-csam-child-safety-features-jen-king-riana-pfefferkorn-interview-decoder\">Apple decided that it was going to scan people’s devices</a> for a couple different reasons — one of them they have now dropped, thanks to work from us and others — we actually hired a plane and flew a banner over the Apple headquarters in Cupertino in one infinite loop saying, “Apple, don’t scan our phones.” That is not the centerpiece of what we do, but occasionally, you have got to have fun and draw attention to things.</p><p id=\"JVVEPR\"><strong>This is like the classic </strong><em><strong>Decoder</strong></em><strong> question. You are filing lawsuits, you are international — there are different kinds of laws in this country versus another — you are doing activism, and you are flying planes. How do you make decisions on how to do all that stuff or how to prioritize that stuff?</strong></p><p id=\"kYyHus\">Well, there are two things that are important. First, it is an art, not a science. There is not an algorithm or rubric that we go to. We ask, “Where can our skills do the most good at the level that we can do them?” Second, we ask, “Is this something that if we don’t do, it might not get done?” </p><p id=\"tc18gF\">Occasionally, we will decide, “The whole civil society community is going to gather together to do this thing, and we want to be a part of that.” That’s probably third on the list. But our first thing is to do the thing that nobody else is doing. That is how we look at it. </p><p id=\"csMhAf\">People come to us all the time with issues, and we look at, “Is this case going to help this one person or is it going to help a whole lot of people? Is it the size that we can do?” If you do not have $1 million for some kinds of litigation, like patents, don’t even try. While we do a lot of work in the patent space, we cannot do direct patent litigation because it is just too expensive. Same with antitrust. That is where the legal system has to be fixed, so that little guys can play before EFF can really make a difference. We work on lots of other ways to try to make that world happen, but we do not do the direct litigation. It is a conversation.</p><div class=\"c-float-right c-float-hang\"><aside id=\"3HZryH\"><q>“I think the best people to make the decisions about what to do are the people who are doing the work.”</q></aside></div><p id=\"x3OKNP\">The other piece of it is that the people doing the work are the ones who decide. My lawyers decide what the right cases are. It is not an outside committee. It is not even our board of directors, because the people who live this all day long are the right people to decide. Same with the technology. EFF builds a few technologies. We have technologists that decide what they need to do next and what is the best use of our resources. We have processes to make sure people do not wander off and that we stay on mission, but in general, I think the best people to make the decisions about what to do are the people who are doing the work. That is the way EFF is structured.</p><p id=\"t4rAtB\"><strong>That is fascinating.</strong><em> </em><strong>When I was younger and I first started paying attention to the greater happenings of the internet, I would read about the EFF and the different positions they were taking stands against. I think it was easier back then because every conversation was about expanding copyright or expanding surveillance and the right position was to not expand copyright or surveillance. And I think it has become much harder now. Back then it was </strong><a href=\"https://www.eff.org/cases/viacom-v-youtube\"><em><strong>Viacom v. YouTube</strong></em></a><strong>, or the government wants to spy on you. Those were strike zones for the EFF. In every article, there would be someone quoted from the EFF since they had a position. I had a “Free the Mouse” sticker on my laptop to protest the Mickey Mouse Protection Act, also known as the </strong><a href=\"https://en.wikipedia.org/wiki/Copyright_Term_Extension_Act\"><strong>Sonny Bono Copyright Term Extension Act</strong></a><strong>. </strong></p><p id=\"ptmWf2\"><strong>Things have gotten exponentially more complicated since then. I am not sure that the positions on issues like that are as simple as they used to be. We can actually use Mickey Mouse as an example because, like the addict I am, I was looking at Twitter just before we started the show. Republicans in Florida are trying to punish Disney, which has come out vocally against the “Don’t Say Gay” bill. That seems like a pure exercise of free speech by Disney, and the Republican legislature is passing some laws to remove its special tax district. They are saying, “We are going to do some stuff about copyright law. We have gotten too many copyright extensions, and the next thing we will do is take that away.” That is a real ends-justifies-the-means moment, right? That is the thing I have been thinking about.</strong></p><p id=\"Q18Arr\"><strong>How are you balancing that and saying, “The copyright extensions have gotten out of control at Disney’s behest, but here it is just pure retaliation so we don’t want to get involved?”</strong></p><p id=\"uVVWHX\">Basically what I tell corporate folks all the time is that when you do the right thing we will stand with you, and when you do the wrong thing we are going to be your strongest critics. We don’t decide whether we like Disney or not, but we look at, “What is Disney doing and is it the right thing?”</p><p id=\"5qi1ot\">When they are doing the right thing, we stand with them. When they are not, we are not. This has happened for us with Apple, for instance. When Apple stood up against the FBI and said, “We are not going to break into people’s phones,” we were right there with them. We were big and loud and we participated. Recently, again, Apple decided it was going to change course and scan people’s phones for certain purposes, and we were the biggest, loudest voice against them.</p><p id=\"HnaG5I\">I think, similarly for Disney, the retaliation is not something that we are ever going to support. We are going to say what we think about copyright term extensions, which is that they are bad. We are not going to change our position just because the people advocating for them are people we disagree with on other things. </p><p id=\"UyYYYJ\">I think that holding your principles throughout the changing political winds is part of the reason why people trust us and why they give us money. We are not going to wave in the wind, we are going to say what we think, and if the topic comes up, we are going to talk about it. You can look to our history to see what we are going to say most of the time. We cannot be bought; nobody is going to come and give us money to do this kind of thing, and I am not going to accept that kind of money. We will say what we think no matter what the political wins are. I just think in the long term that is how you build a trustworthy organization.</p><p id=\"UBeFfT\"><strong>I buy you on trust. I think my question is how do you build a politically effective organization in this environment? It is so complicated. When you have notably bad actors in the Florida case openly retaliating with a thing that good-faith actors have wanted for a long time, that thing itself gets poisoned.</strong></p><p id=\"fmzJOg\">It is a problem. It is a huge problem in free speech as well. In the context of the Florida thing, I think it is less of a worry because copyright is federal. I don’t know what the state of Florida is going to do. There are some state copyrights, but they are preempted and I don’t think that is going to go away. While it is an interesting thought experiment, if it grows to be a real problem, then we will have to confront some hard issues, but I think it is unlikely to. </p><div class=\"c-float-left c-float-hang\"><aside id=\"V9Q3jB\"><q>“We have cared about free speech for a very long time, and we actually know what it means.“</q></aside></div><p id=\"a44lFe\">We have cared about free speech for a very long time, and we actually know what it means. Every time somebody tells you that you have said something rotten, it does not mean that they have violated your free speech. That is true whether they are a company or an individual.</p><p id=\"i1omCs\">I feel like right now in this world, people are looking for something they can trust. They’re looking for something that doesn’t waver in the wind of politics. If you want an organization that wavers in the wind of politics, then find somebody else other than EFF; there are plenty of them. We are a nonpartisan 501(c)(3), and we make our stances based on the issues. I believe that will serve us in the long run. It may put us in some uncomfortable positions in the short run, but I think that in the fullness of time, those positions end up being vindicated and we are better off with that. </p><p id=\"2KSK3F\">It is weird to be somebody who stands on principle in this time, when the currency of the day is about what tribe you are in. We are doing something different. Happily, I think our membership supports that, and I think we have continued to grow and be stronger. It may mean that in a particular instance we are put in a slightly uncomfortable position, but in the long run I think it serves us.</p><p id=\"TK5SSI\"><strong>Let’s talk about another one of these balancing acts that you may have to do. You mentioned Apple. They hate it when you call it scanning the phone, but it is the quickest way of describing what they are doing. </strong></p><p id=\"CsYThR\">Well, that is actually what they are doing. I mean, it is called client-side scanning for a reason. Client-side means your phone, people. Don’t let that cover you; they are scanning your phone.</p><p id=\"eD1FF3\"><strong>I will just accept the emails when they come in. I just know they are going to come, so I will accept them.</strong></p><p id=\"9fNebu\">Yeah. Tell them to send them to me. We have had these conversations. We have conversations with them privately, like with most of the tech companies. If what you are doing is correctly described, that is what we’re going to call it.</p><p id=\"3OBeOh\"><strong>Fair enough. So Apple is doing that. They are looking on your phone for images and then potentially doing something if they match a database. That is sort of the small definition of surveillance. Historically, you think about the government surveilling you, but big, private companies surveilling you is something different. It is not necessarily something you can necessarily point a lawyer at unless you can find some statute that says it is illegal, but there do not appear to be too many of those. You have got to point activism at that. </strong></p><p id=\"ahAavE\"><strong>On the flip side, if the government were to write a bunch of regulations determining what these companies could do, you might end up with some things that infringe on their rights, or the rights of users. Phone scanning is one you cannot just point lawyers at. I would say social network moderation is definitely right in the crosshairs. If the government starts writing speech regulations about what moderation policies are acceptable, that seems like a very bad outcome.</strong></p><p id=\"6jX1Wx\">We have those, like the must-carry laws in Texas and in Florida. This is absolutely happening.</p><p id=\"ZJXBqK\"><strong>We want those companies to behave better because they are the actual power that the users see. I think more people are aware of YouTube’s copyright policy than the speed limit five miles away from their house. They encounter them more. How are you balancing that? How do you think about keeping the government away from this when there is no countervailing pressure — aside from raw activism — that ever gets these companies to change?</strong></p><p id=\"53BerP\">You’re exactly right. EFF has developed something called the <a href=\"https://santaclaraprinciples.org\">Santa Clara Principles</a>, which are basically how to apply due process and fairness in the context of content moderation. We use the bully pulpit to yell at them and try to get them to do the right thing. There are many people inside these organizations who want the companies to do the right thing. We try to give an outside point of reference for the right thing to do. </p><p id=\"TnQ1TG\">We have seen some changes, but I do not think that there can be a regulatory structure on content moderation that will not violate the First Amendment, at least not the ones that I have seen proposed so far. There are some possibilities around 14th Amendment anti-discrimination laws where you could see a few things going, but it is pretty hard.</p><p id=\"qRdXTB\">Our shift on this is that we yell at the companies and make as much noise as we can, especially around the way content moderation disproportionately affects marginalized people. I think sometimes — because of the way the media works internationally — we know more about the four or five conservative people who have been subject to content moderation than we do about the millions of people who are not rich, white conservatives that are silenced every day. </p><p id=\"B0r278\">If you count the number of heads being censored globally, it is much bigger among marginalized people than it is among people who already have big access to the megaphone. I think that is the thing to keep in mind. If you are setting your answer based upon an unclear vision about where the problem happens, you are going to end up in the wrong place. That is what these <a href=\"https://www.theverge.com/2021/9/9/22661626/texas-social-media-law-hb-20-signed-greg-abbott\">must-carry laws</a> are doing; they are responding to a minority concern, not a majority concern about censorship.</p><p id=\"hakwZC\">We pound on them, and we look for angles for things that we can do. There have been many attempts to try to sue the big content companies claiming that they are somehow like the government, so they should act like the government. We stand with them on that; they are not the government and we should not treat them like the government. I 9also think some of the people bringing those cases would not like the outcome if we treated them like the government anyway. I think the common-carry kinds of arguments are not only wrong, but will not do what the people who are putting them forward think they will do.</p><p id=\"iRvcVc\">We participate all over the map on these kinds of things. The other thing that we kind of realized a few years ago is that the answer to having a dictatorship by a bunch of big companies is not to put different people in the chair of being the dictator, but to get rid of the dictators. A lot of the work that we are doing is about how to reintroduce competition in things we rely on like social networking, messaging, and app stores. Replacing Zuckerberg as king with somebody else should not be our strategy. Our strategy is to not have any kings anymore.</p><p id=\"CzyT6H\"><strong>I think I would do a great job in that role, I just want to be perfectly clear.</strong></p><p id=\"GCt2bv\">We all would. I certainly would. What did George W. Bush say? “If this were a dictatorship it would be a heck of a lot easier.” A benevolent dictatorship is fabulous, but we really don’t have any Richard Vs, the good kings. We need no kings. I am an American, and the king-based strategy is not the right strategy. Making billionaires into kings is not the right way forward. What we need is a bunch of different options, and that puts you in some different places. It makes you start thinking about antitrust law, and we support a lot of the reforms to antitrust law that is happening right now.</p><p id=\"bJJuHK\">We also think about things like interoperability, real adversarial interoperability. This is something that gets a little geeky pretty fast, but you should have a bunch of different ways to interact with your social media information and you should be able to pick the community that you want to do it with. Mark Zuckerberg should not be in charge of what you see in your social media feed. You could pick Mark’s if you want, but you ought to have 100 other options, including your local Kiwanis club or the hacker space down the road. </p><p id=\"p3Npy2\">You should be able to pick and choose what your interface looks like, what the recommendation engine is prioritizing, and how that works. That means we have to build a network that looks a little more like the original internet and not like these gigantic platforms that we have evolved into. EFF has this mix of lawyers and technologists — people who are deeply engaged with the technology — and has really championed this as a piece of the story about how we get out of the problem of social media. There are some tech things that we could harness. </p><p id=\"2mACZB\">We all were able to have the home internet revolution because AT&amp;T was required by the FCC to let you plug something else into the wall. AT&amp;T said, “If anything gets plugged into our phone network other than our phones, the security will go crazy and the world will fall apart.” The FCC said no, which is a set of decisions called <a href=\"https://en.wikipedia.org/wiki/Carterfone\">Carterfone</a>. That was the first one that let us plug our modems into the telephone line and get the internet into our houses. We have done this before. It was a mix of regulation and innovation. </p><p id=\"eOHyie\">I know this is kind of a long digression from where you started, but it is because the problem of trying to fix social media at scale is so hard. If we really want to get back to a place where we have privacy and free speech that includes empowering marginalized voices, then we need to start thinking about how to have real competition in these technologies.</p><div><aside id=\"ZW4oMs\"><q>“If we really want to get back to a place where we have privacy and free speech that includes empowering marginalized voices, then we need to start thinking about how to have real competition in these technologies.”</q></aside></div><p id=\"yHxhha\"><strong>I just want to push on that a little bit. I’m with you. It is a strange turn for a civil liberties organization to say, “Actually, what we need to do is deploy state power to regulate large corporations.” It takes you away from the user and directly into the fray of one corporation versus another corporation. Epic Games would love for the antitrust laws to be rewritten in this country. I do not think they have a civil liberties posture in mind at the end of that.</strong></p><p id=\"FVU5gS\">Well, no. As with many things, people can have different values that they go into the conversation with. I think from our perspective, it is a civil liberties problem when free speech and privacy are beholden to just a few gigantic companies that have a business model. I throw privacy in here — we talk about free speech a lot because it takes up all the air in the room, and it’s not unimportant. But the surveillance business model is why these companies are so profitable and why it is so hard to take them down. I think that if you care about civil liberties, you just cannot ignore the problem. As a couple friends say — Cory Doctorow is one of them — the internet has become five giant tech companies using screenshots of the other four.</p><p id=\"sgSyIT\">We have to create competition if we want to create the preconditions for real civil liberties. Does that involve governments? I don’t think it has to, but I think there are ways that governments can be involved, just like with the Carterfone decision. It is not a question of whether to regulate or not, so much as whether the regulation stands with users and spurs innovation. I would love to have Facebook decide they were going to open up their APIs and let you build a front end to look at all your social media at once. A little company called Power Ventures built that a few years ago, and they got sued into a smoking hole by Facebook using the anti-hacking laws. Laws are here. Facebook protects its monopoly by having laws.</p><p id=\"GWvGmD\">If we want to undo that monopoly, we are going to have to look at some of the laws that they use to protect themselves. As somebody who came up on the internet in the ‘90s, it is definitely the case that government can do really dumb and awful things. In the ‘90s, it was because they did not understand at all what people were doing online. Now, it is a little different. They often do understand, but they get swayed by one big company or another. I would be very happy to have a more competitive future in this context, but I think a lot of laws and structures are keeping us feeling stuck in this time. It is fair to inquire about whether we could do something better. What would Carterfone for social media look like?</p><p id=\"kCuIbz\"><strong>I want to talk about that a little bit more, but first I want to grab onto something you said. You said, “take them down,” in relation to the big companies. Is the goal to take them down?</strong></p><p id=\"SVbrqB\">Not necessarily, but if we have to take them down in order to achieve the goal of empowering users and putting them back in the driver’s seat, I am not opposed to it. I think that is different, but it may take you to the same place. I do not have a problem with companies being big or rich, but the side effects of whether people can speak on their privacy in the digital world that we are living in, I want to fix that. You know, <em>How to Fix the Internet</em>. If we cannot fix the internet while having the current tech giants and billionaires in charge, then we have to get them out. The question is how we get to the end goal where users are empowered, people have real choices, and people have privacy again.</p><p id=\"CvAfHh\">Then you see where that takes you. As I said, we did not really decide to get into thinking about competition at EFF because we needed a bigger mandate. We decided because we started seeing intractable problems that we felt were not going to be fixable unless we started talking about how to bring competition back to digital services. Facebook trying to do content moderation at scale is not working, and I think everybody agrees it is not working in very different directions. I think it is over-censoring marginalized voices, and it may be under-censoring other kinds of voices. There is no due process and people do not understand. </p><p id=\"XoA9nw\">YouTube is another one. People may feel like <a href=\"https://www.theverge.com/22606296/youtube-shorts-fund-neal-mohan-decoder-interview\">YouTube’s copyright policy is tremendously important to them</a>, but boy is it opaque. You can’t figure it out. We have to help people all the time who get taken down for weird reasons. The fact that we have a hotline to YouTube to say, “Look, you just did this dumb thing,” does not scale. We grew out of those problems. Honestly, how do you protect people’s privacy with the surveillance business model? Back to a thing you said, government surveillance and corporate surveillance are very different things as a legal matter, but corporate surveillance is feeding government surveillance, absolutely.</p><p id=\"INDb49\">I have been suing over the NSA tapping into AT&amp;T’s phone network since 2006 and 2007, but they also show up at Google’s front door and do a reverse IP lookup warrant. They know all of the innocent people who were in the vicinity of a crime, despite having no probable cause against them. That is because Google has all that information and is subject to government request for it. </p><p id=\"w1vsKY\">I know I am getting far afield again, but people sometimes ask me, “Are you more worried about government surveillance or corporate surveillance?” I respond with, “If you don’t think that government surveillance relies on corporate surveillance, then you have not been paying attention, my friend. They are not two distinct categories anymore, and have not been for a very long time.” Sorry, I went off from your question.</p><div><aside id=\"SlWYvF\"><q>“If you don’t think that government surveillance relies on corporate surveillance, then you have not been paying attention, my friend.”</q></aside></div><p id=\"v17WDl\"><strong>No, I think this is the heart of it. In almost every issue that you can think of in tech right now — whether it is surveillance, privacy, interop, copyright law, or however anyone wishes to define free speech at this moment in time — there is a set of powerful corporate actors that are the first touch points for users, and the users care about their actions more. Then there is the legal framework that they operate in. The government is much more theoretically restricted in what it can do than any of the companies.</strong></p><p id=\"ZWm2cy\">Yes.</p><p id=\"jbfomN\"><strong>I think this also makes the regulation that they can impose much more potentially restricted, especially when it comes to speech, surveillance, and security.</strong></p><p id=\"mC59l7\">Yes. They have a big range inside the realm of contract law, those click-throughs, to do a whole bunch of stuff. This is not the only thing we do. There are also a lot of laws supporting them that I think we need to inquire about. </p><p id=\"RYb41d\">EFF has spent years working on the <a href=\"https://en.wikipedia.org/wiki/Computer_Fraud_and_Abuse_Act\">Computer Fraud and Abuse Act</a>, which Facebook used — along with some state laws — to crush a competitor that was offering users a different interface into Facebook. There is a little company called HiQ that was sued by LinkedIn for offering a service that was based on scraping publicly available information off of LinkedIn. We were able to get the Supreme Court to interpret the Computer Fraud and Abuse Act in a better way, and the Ninth Circuit confirmed that scraping a public website in order to create a competing product is not a violation of the anti-hacking laws. </p><p id=\"UPmVkt\">On the one hand, the companies have a lot of space in their contractual and other areas to do things, but it is important to remember that they rely on laws sometimes to protect their monopolies. We need to start talking about that as well.</p><p id=\"VWH7oD\"><strong>One thing you have mentioned a few times now is true interoperability. A theme on </strong><em><strong>Decoder</strong></em><strong> over the last few months is Web3, the blockchain. We just had Chris Dixon on, who is spending billions of dollars to tell you that the future of the web is interoperable and based on blockchains. Is that something that the EFF is involved in? Is it something you are advocating in? Is it something your technologists are building?</strong></p><p id=\"ar1Az9\">We are not building anything right now, but we are paying attention to decentralization. In some ways, to make sure that all this money that is flooding in here does not end up creating new bosses the same as the old bosses. Yes, we are interested in the possibility that the blockchain and decentralized services could be one of the pieces of helping us create a better world. There are ways in which it can. My friend Brewster Kahle at the Internet Archive has been convening a lot of things around a decentralized web to try to help get out of some of these problems.</p><p id=\"A9O1CR\">We think that there is promise here, and an awful lot of grift, too. We are trying to make sure that we recognize the babies in the bath water and don’t throw the whole thing out, while at the same time making sure those babies actually survive the big-grift, Ponzi-scheme feel of a lot of what is going on in this world. We feel like we need to do it. We obviously have a choice to pick what we do, but this is big and it is important. We would end up in a better place if we could vindicate some of the values here, but it is not guaranteed. If we and other people of goodwill are not in there trying to make sure that this thing ends up creating good — not just creating bad or fleecing people — then I am not sure it will automatically happen.</p><p id=\"JEI9hh\">I think it is one of those situations where we feel like we have something to say. We feel like we understand the difference between what is possible and good, and what is not. It would be unethical in terms of our values to just walk away, because there is so much grift going on. </p><div class=\"c-float-left c-float-hang\"><aside id=\"A61TBf\"><q>“When people want to make interoperable things, we want to support them.”</q></aside></div><p id=\"DIMlNl\">When people want to make interoperable things, we want to support them. We have a whole set of what we do, called Coders’ Rights. I think a lot of these efforts to try to build a decentralized social network run into problems with the law. We try to help people where we can, especially people who have open-source projects or may be building something that the world needs to have, but do not have money for lawyers. So we are involved. We have been trying to be the sensible people in the room who understand the potential of the technology, but also the pitfalls.</p><p id=\"hlD1T3\"><strong>We only have a few minutes left. Let me add all of this up and then add the absolute chaos-bomb of Elon Musk to the equation.</strong></p><p id=\"B4vt4z\">Always.</p><p id=\"tdhKU1\"><strong>We are in a spot right now where </strong><a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\"><strong>Elon is talking about buying Twitter</strong></a><strong>; we will see if he can do it or not. (Editor’s note: this interview was conducted before the board approved Musk’s proposal to purchase Twitter.) He thinks that Twitter should change its content moderation policies in some way. It is totally undefined, but has more free speech, whatever that means in that context. We assume he means less moderation. The current CEO of Twitter, Parag Agrawal, is saying maybe Twitter should be a protocol. They have a thing called Bluesky — that Jack Dorsey has endorsed — that will attempt this. That is a lot of swirl around a core social networking product that is run by one billionaire or another. Does EFF engage on that? Is that just beyond the office gossip distraction? Is that where you say, “Okay, we are a user rights organization, we have a lot of thoughts on all these things, so we can and should engage here and try to push towards an outcome,” or are you just waiting for the chips to fall?</strong></p><p id=\"nsjhEI\">We are engaged a little, just on the issues that we know. I do not hang out with billionaires, so it’s not like I can meet them in the club and tell them what I think.</p><p id=\"96rF8D\"><strong>I think a lot of billionaires are EFF fans. I feel like you could definitely get in the game if you want to.</strong></p><p id=\"UuYPJU\">Well, Jack certainly has said that on occasion. Bluesky does have the original idea of turning Twitter back into a protocol. They used to have TweetDeck and all these other ways. They had an open API, and you could have a different front end to it, but they locked all that down a few years ago. For a long time, we have called on Twitter to go back to being open API. To allow not just interoperability, but adversarial interoperability, which we call competitive compatibility. You want people to not have to come to you on bended knee for permission, because that ends up giving the main player too much power.</p><p id=\"x8EYru\">So yeah, we called on Twitter to do the thing. When Jack announced Bluesky, it did seem like he had heard us — and we weren’t the only ones — say, “You need to think about your role differently and move away from the platform mentality towards a protocol mentality.” All credit is due to my friend, Mike Masnick, who really first coined the “protocols, not platforms” framing of this, which I think is right. We think that is the right thing. There are a lot of dragons along the way, and ways that it could not happen. Musk is saying he wants interoperability, and I think a couple of the prominent crypto people have said they want that too. I think that is great, but we could do this right and we could do this wrong. If we just meet the new boss the same as the old boss with less content moderation, we will not have done this right.</p><p id=\"Z8Gfp2\">Many people have pointed out that there have been lots of attempts to have platforms with less content moderation. They pretty much either fail, because people do not want to be in a place with all that dreck, or they end up being just echo chambers for a few people who agree with each other. That is okay. I don’t mind those little echo chambers, but they do not end up being the dominant place because people run and hide from a place that is so toxic.</p><p id=\"9xh7gM\">Musk is going to find out that you have to have content moderation and that it is very hard to do it at scale. I think that it would be a very good thing if Twitter really does turn itself into an open protocol that lets people choose their own adventure and leave when they want to. There are pitfalls along the way, but we would like to see something like that happen. I am not so sure our vision is the same as Musk’s, but honestly I have never talked to him. What he said about it is so cryptic that I don’t want to be unfair and just assume one way or the other. Just because somebody says interoperability, does not mean they are on the side of empowering users. There is a lot more to the story.</p><p id=\"tqE6d2\"><strong>Doesn’t this all just come back to the tension that we have been circling around? You certainly do not want the government writing a content moderation guideline. You do not want the government going beyond the boundary of the First Amendment that restricts it from writing speech regulations, and saying, “Here are the content moderation guidelines for social networks in the United States.” You do not want that to happen.</strong></p><p id=\"sBzCxn\"><strong>On the other hand, it seems like billionaires just deciding any way they want is a bad idea. Somewhere in the middle is a somewhat hazy, but coming into focus, notion of, “There should be protocols for social networks.” You should be able to pick your client, and maybe pick your filter. If you are an unhinged person, you can pick no filter and take the full fire hose of crazy. Most people will pick a default, or maybe you will pay a company. There will be market competition for user interfaces and content moderation.</strong></p><p id=\"jlgTbd\">I think there should be a nonprofit sector of that as well, and maybe even a public sector. My friend, Ethan Zuckerman, says, “Well, maybe we have a public TV version of social networking too.” I think there is a possibility here. Sorry, I cut you off as you were getting to the question part.</p><p id=\"3c93kg\"><strong>It just seems like to get to that place, you have to tell the government, “You are not allowed to do speech regulations, but get in there and tell these companies exactly what to do.” The market is not going to take you to that place on its own. It seems like the EFF is in a weird spot of being an activist, telling the government to do one thing but not another.</strong></p><p id=\"Gfr8zj\">I just think that is the reality of the world we live in. Again, the law exists; the Computer Fraud and Abuse Act exists. It helps support their monopolies right now. Even if your frame is that all government is always bad, that lever is already being used to support the monopoly. We have to be smarter than that. We have to think about how the government can foster innovation. It ought to in the places that it can, and it ought not to in the places that it cannot. It cannot write the rules for content moderation, but it can create incentives, as well as rules around blocking and diminishing competitors. It ought to do those. It is not the only thing to bring to bear though, honestly. We need more funding heading into people who are trying to build competitors to the big companies. If you talk to the VCs, there has been this idea that you just cannot support anything that might compete with Google or Facebook.</p><p id=\"TOD3VB\">There is work for people outside the government too. I just don’t want to put the government off the list of things we have to do. We need to pressure the VCs. We need to support the people who are trying to build innovations. We need to intervene like EFF did in the <a href=\"https://www.eff.org/cases/facebook-v-power-ventures\"><em>Facebook v. Power Venture</em>s</a> case, to protect small competitors who find themselves being crushed. There are some governmental things, but there are also a lot of non-governmental things we need to do. We need to really envision the world we want to make and then find the levers where we can push toward it.</p><p id=\"DCLSB7\">Some of it may be for people to just build the thing and use the thing, the next new project. We used to have this cycle of innovation, where a technology company would come along and it would own the world one day. Yahoo owned search, then MySpace owned social networking. Then the next one would come along with the next innovation, and they would just eat their lunch. That cycle has stopped. We have the same companies that we had 15, 20 years ago still in charge of our online experience.</p><p id=\"ih02r3\">We need to do a whole bunch of things to shake that up. It was not just one thing that got us into it, so it is not going to be just one thing that gets us out. I think users are feeling hopeless and helpless. I guess part of what I’m trying to hopefully do with our podcast, and with coming on and talking to you about this, is to help people feel like they have choices. We are not stuck in this world. We do not have the solutions yet, but we have some ways out, and we should begin to work towards them.</p><p id=\"mj8nMo\"><strong>Cindy, this has been an incredible conversation. I know you have to go, but we will have you back on </strong><em><strong>Decoder</strong></em><strong> soon. Thank you so much for joining us.</strong></p><p id=\"SFS6ve\">I would be delighted. Thanks.</p><aside id=\"MahR9T\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe Now!\",\"url\":\"https://pod.link/decoder\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/mMduL7-qCbHxPGI1VVPkDLuS7Bc=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23415131/VRG_ILLO_Decoder_Cindy_Cohn.jpg",
  "description": "Running headfirst into fights for users’ rights on the internet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}