{
  "title": "Gran Turismo 7’s developers apologize for the grind, promise fixes and a million free credits",
  "url": "https://www.theverge.com/2022/3/25/22996282/gran-turismo-7-polyphony-digital-grind-credits-changes-sell-cars-endurance",
  "date": "2022-03-25T20:01:40.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8YxkFmUa6jRk5IkKhg8wvp1J3-M=/0x0:3240x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70672729/Gran_Turismo__7_20220223165350.0.jpg\" />        <figcaption>Screenshot: Cameron Faulkner / The Verge</figcaption>    </figure>  <p id=\"41h4xh\"><em>Gran Turismo 7</em> developer Polyphony Digital is <a href=\"https://blog.playstation.com/2022/03/25/gran-turismo-7-an-update-from-polyphony-digital/\">apologizing for the changes recently introduced to the game’s economy</a> and is promising improvements, along with a million free credits. These changes come after the game had a <a href=\"https://www.theverge.com/2022/3/17/22983882/ps5-gran-turismo-7-update-1-0-7-server-outage-hours\">massive outage last week</a>, which was the result of an update that also made changes to how players could earn credits by actually playing the game rather than through microtransactions.</p><p id=\"quI602\">In a <a href=\"https://blog.playstation.com/2022/03/25/gran-turismo-7-an-update-from-polyphony-digital/\">post on the PlayStation Blog</a>, Polyphony president Kazunori Yamauchi apologized for “the frustration and confusion caused last week with our patch updates which resulted in, not only a server outage but also adjustments to the in-game economy which were made without a clear explanation to our community.” As a “goodwill gesture,” the company promises to give players “a non-paid credit pack of 1 million” credits.</p><div class=\"c-float-right\"><aside id=\"gEgxBp\"><q>The company wants to “reestablish the reward system with greater balance throughout the game”</q></aside></div><p id=\"jly5If\">The post says that users should see the credits in their accounts “shortly” and that they’ll only be given to people who owned the game before the post was published. While I don’t seem to have gotten mine yet, the deadline for logging in and receiving them is a ways out —  Polyphony says the offer is good until April 25th.</p><p id=\"8WJrfF\">The post explains that the changes to the in-game economy were made to “provide more accurate rewards based on time investment and completion,” something Yamauchi touched on before when talking about the outage. At the time, he said he couldn’t explain any upcoming changes in detail, but Friday’s post seems to be that explanation. </p><p id=\"JezSla\">The post describes a patch that’s coming out in the beginning of April, meant to “reestablish the reward system with greater balance throughout the game to benefit all players.” After the update, players should notice:</p><ul><li id=\"xgY2v0\">Approximately doubled rewards for “the events in the latter half of the world circuit”</li><li id=\"L0Rr5q\">“High rewards” for getting all gold and all bronze in the circuit experience</li><li id=\"3JG9Uk\">Increased rewards for online races</li><li id=\"lehGJP\">Eight new one-hour endurance race events in missions, which will have “higher reward settings</li><li id=\"pjBS5s\">A higher cap on how many non-paid credits users could have, up to 100 million from 20 million</li><li id=\"TsUWdq\">More used and legend cars being sold at a time</li></ul><aside id=\"kZ7MCG\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Gran Turismo 7 is back online after a 30-hour outage\",\"url\":\"https://www.theverge.com/2022/3/18/22984770/gran-turismo-7-down-outage-back-online\"},{\"title\":\"There’s still nothing quite like Gran Turismo\",\"url\":\"https://www.theverge.com/22958005/gran-turismo-7-review-ps5-ps4\"}]}'></div></aside><p id=\"Du3mql\">The post also outlines that will be coming in the “near-term” — though it doesn’t specify a date for these changes or more details. Those changes are:</p><ul><li id=\"gVKyj0\">Increased payout value of limited-time rewards</li><li id=\"h68aL5\">More additions to world circuit events</li><li id=\"Fba1b8\">Endurance races are being added to missions, including 24-hour races</li><li id=\"e2lCE5\">Online time trials are being added, with rewards being given “according to the player’s difference with the top ranked time”</li><li id=\"EvaGH3\">Players will be able to sell their cars (consider your days numbered, 1965 Mini Cooper)</li></ul><p id=\"uEQMFt\">From the looks of the <a href=\"https://www.reddit.com/r/granturismo/comments/tnh14h/gran_turismo_7_an_update_from_polyphony_digital/\"><em>Gran Turismo</em></a> and <a href=\"https://www.reddit.com/r/PS5/comments/tnh0p7/gran_turismo_7_an_update_from_polyphony_digital/\">PS5</a> subreddits, users generally seem happy with the changes, especially the fact that you can sell your cars (though there are some questions about whether you’ll be able to sell gifted cars and whether you’ll get GameStop prices for them). One big bugbear that remains unaddressed, though, is the game’s reliance on internet connectivity to function. Last week’s server maintenance <a href=\"https://www.theverge.com/2022/3/18/22984770/gran-turismo-7-down-outage-back-online\">put the game into offline mode for over a day</a>, which <a href=\"https://www.theverge.com/2022/3/17/22983882/ps5-gran-turismo-7-update-1-0-7-server-outage-hours\">severely limited</a> how you could play it. </p><p id=\"gBWXHw\">Given that Friday’s post refers to <em>GT7</em> as a “live service,” it doesn’t seem like we should hold our breath for any changes that would make the game more offline-focused. Still, the updates that we know we’ll be getting are exciting, both in terms of making the game more enjoyable and in adding new (if grueling) experiences to it. </p><p id=\"wmLTMN\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jmGfbebz8Wd14AIJUPQI-2-hEkY=/0x283:3240x1979/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23278017/Gran_Turismo__7_20220223165350.jpg",
  "description": "There’s an update coming in early April.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}