{
  "title": "Gran Turismo 7’s new trailer shows off PS5 features and chill music mode",
  "url": "https://www.theverge.com/2022/2/2/22911417/gran-turismo-7-modes-multiplayer-graphics-cars-trailer-state-of-play",
  "date": "2022-02-02T22:30:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Gran Turismo 7\" src=\"https://cdn.vox-cdn.com/thumbor/a0nIOET2CAwwVbMZY0HFeiCpkgY=/0x0:1930x1287/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70464478/gt7hero.0.jpg\" />        <figcaption><em>A still captured from PS5 footage provided by Sony.</em> | Sony</figcaption>    </figure>  <p id=\"BLShlK\">Sony’s latest State of Play presentation offered a closer look at the cars, tracks, and game modes that <em>Gran Turismo 7</em> will deliver when it launches on PS5 and PS4 on March 4th, 2022. Beyond offering a deep car simulator experience with a hefty amount of customization options for each car, there are some new and returning features that should give returning fans (or first-time players) plenty to do. </p><p id=\"hu0k7y\">Starting with some key highlights from the show, the game will offer over 400 cars on launch day, along with 34 racing locales and 90 track layouts. It’ll have two-player split-screen multiplayer (along with online play), and like most PS5 games, <em>Gran Turismo 7</em> includes a frame rate mode for 60 frames per second performance or a ray tracing mode that caps at 30 frames per second. Sony didn’t share any technical details about the PS4 version of the game.</p>  <figure class=\"e-image\">        <img alt=\"Gran Turismo 7\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3IMqMgNx3S2TVRgEQ3Rro8aJ0h4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23210589/BrandCentral_02.jpg\">      <cite>Sony</cite>  </figure><p id=\"ioNOWz\">The game will have some other PS5-exclusive capabilities. The DualSense controller’s haptics will feel different depending on the surface you’re driving on. The haptics will also be impacted by the engine and drivetrain vibrations, along with the general resonance of the car body. The controller’s adaptive triggers will be utilized to simulate each car’s unique brake system, as well as pulsing to simulate anti-lock brake systems.</p>  <figure class=\"e-image\">        <img alt=\"Gran Turismo 7\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RbQCCo11qq8FA0De485Bm12cTt8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23210544/WorldMap.jpg\">      <cite>Sony</cite>  </figure><p id=\"DSzEqJ\">In addition to a campaign, where you’ll rise through the ranks and earn credits to spend on nicer cars, there’s a Café mode where you can complete car-specific objectives while learning insights about each historic model from the people responsible for designing them. Whether you’re new to car culture or a fan who wants to learn more, this seems like a more laid-back section of the game.</p><p id=\"HJmtjS\"><em>Gran Turismo 7</em> puts an emphasis on music with the introduction of two features, Music Replays and the mode Music Rally. For Music Replays, you can save a replay of a race that’s set to music with randomized camera locations. The replay cuts and pans to the music that’s set as a backing track to make them more exciting to watch. </p>  <figure class=\"e-image\">        <img alt=\"Gran Turismo 7\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Rvv7pswHcNTJzWSCRs1ZBcgr0Vk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23210551/musicrally.jpg\">      <cite>Sony</cite>  </figure><p id=\"7s5WOX\">Music Rally is, perhaps, the most arcade-y mode to come to <em>Gran Turismo</em> yet. The objective of this game mode is to simply enjoy music while driving. You start the race, and to keep the momentum going, there are checkpoints where you replenish a timer that winds down. Time-attack challenges aren’t <em>exactly </em>my idea of a relaxing time, but we’ll see how this turns out in the final product. I was hoping for more of a <em>Flight Sim</em>-like free drive that eliminates the heads-up display entirely, with some music playing in the background.</p><p id=\"BbSStd\">The State of Play didn’t discuss whether <em>Gran Turismo 7</em> will have realistic damage modeling for cars — a feature that long-time fans have clamored for — though the game is offering deeper cosmetic customization. You’ll be able to add stickers and decals to cars, as well as tweak the racing suit and helmet to your liking. Your creations can be shared with other players via an in-game platform. </p><p id=\"I35KiF\">Given that this was Sony’s big presentation on <em>Gran Turismo 7</em>, we may not hear much more about it until the game releases. But since launch is in early March, at least you won’t have too long to wait. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CxT6XuBvWm-yZUj1rUFNpO8Fkeo=/0x139:1930x1149/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23210636/gt7hero.jpg",
  "description": "Check out the State of Play show here.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}