{
  "title": "Gran Turismo 7 is back online after a 30-hour outage",
  "url": "https://www.theverge.com/2022/3/18/22984770/gran-turismo-7-down-outage-back-online",
  "date": "2022-03-18T15:13:43.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/i7DAQjTnoPhiBK54md_YjLHRhHI=/160x0:1888x1152/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70641259/49996342761_297d9102c8_k.0.jpg\" />        <figcaption>Image: Polyphony Digital</figcaption>    </figure>  <p id=\"l6bo0u\"><em>Gran Turismo 7, </em>one of the biggest PlayStation 4 and PlayStation 5 games of the year so far, is back online after a 30-hour outage. A broken update resulted in longer than expected server maintenance yesterday, leaving players frustrated at the limited offline mode available in <em>Gran Turismo 7</em>.</p><p id=\"IUpFqh\">Much of <em>Gran Turismo 7</em>, including its career mode and multiplayer, was unplayable for 30 hours, and developer Polyphony Digital took more than 24 hours to provide an update on the problems after the maintenance extension. Polyphony Digital has now apologized for the problems, and the game is back online with a new and functional 1.08 update.</p><p id=\"DJrt6d\">“Immediately before the release of the 1.07 update, we discovered an issue where the game would not start properly in some cases on product versions for the PS4 and PS5,” <a href=\"https://www.gran-turismo.com/gb/gt7/news/00_3802725.html\">explains Kazunori Yamauchi</a>, game designer and Polyphony Digital CEO. “This was a rare issue that was not seen during tests on the development hardware or the QA sessions prior to the release, but in order to prioritize the safety of the save data of the users, we decided to interrupt the release of the 1.07 update, and to make a 1.08 correctional update.”</p>  <figure class=\"e-image\">        <img alt=\"CE-21071 error displayed by Gran Turismo 7\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3BN3RWn7iy0OySztXGHu8QeRmtA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23326792/17f9d468bd030_screenshotUrl.jpg\">      <cite>Image: Cameron Faulkner</cite>      <figcaption><em>The error displayed by Gran Turismo 7.</em></figcaption>  </figure><p id=\"GCl88c\">The problematic update also adjusted the rewards system for some events, meaning <em>Gran Turismo 7</em> players get fewer credits. That makes it even more difficult to save up in-game currency for the top cars, and makes the game a lot more of a grind for players.</p><p id=\"qZin22\">“In <em>GT7 </em>I would like to have users enjoy lots of cars and races even without microtransactions,” says Yamauchi. “At the same time the pricing of cars is an important element that conveys their value and rarity, so I do think it’s important for it to be linked with the real world prices. I want to make GT7 a game in which you can enjoy a variety of cars lots of different ways, and if possible would like to try to avoid a situation where a player must mechanically keep replaying certain events over and over again.”</p><p id=\"HmYnSv\">It’s not clear what future changes to <em>Gran Turismo 7</em> will be implemented on the credit side, but Yamauchi says it “pains” him that he can’t explain them in detail yet. “We would really appreciate it if everyone could watch over the growth of <em>Gran Turismo 7</em> from a somewhat longer term point of view.”</p><p id=\"V1ff9B\"><em>Gran Turismo 7</em> players might not be that patient, though. Many have flocked to <a href=\"https://www.metacritic.com/game/playstation-5/gran-turismo-7\">Metacritic to leave negative reviews</a> of the game, pushing its user score down to just 3.2.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5R0lZd7PezRcN_tkCYc8GJNKnpQ=/0x40:2048x1112/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23326937/49996342761_297d9102c8_k.jpg",
  "description": "Players were left with a very basic offline mode.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}