{
  "title": "Gran Turismo 7 is fully playable again after server problems cut off major features for more than 24 hours",
  "url": "https://www.theverge.com/2022/3/17/22983882/ps5-gran-turismo-7-update-1-0-7-server-outage-hours",
  "date": "2022-03-18T15:00:15.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vbYUQcn_eRtmfDgWPVW4E4AHKkw=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70638429/i1yUwuUQyq9FluH.0.jpeg\" />        <figcaption><em>It has extended server maintenance due to an issue.</em> | Image: Sony</figcaption>    </figure>  <p id=\"lf1yxE\"><em>Gran Turismo 7, </em>one of the biggest PlayStation 4 and PlayStation 5 releases of the year so far, suffered through server maintenance for over a day because of an issue found with the game’s latest update. “Due to an issue found with Update 1.07, we are extending the current server maintenance period,” reads a notice on the <em>Gran Turismo</em> website <a href=\"https://twitter.com/thegranturismo/status/1504421309320728583\">from Thursday morning</a>. “We will confirm the completion time as soon as possible.” </p><p id=\"VZaXC3\">On Friday morning, a 354MB 1.08 patch was released and has been downloaded by players on PS5 and PS4 systems. However, even after downloading it and waiting through a lengthy installation/copying process, the game still wouldn’t connect to its servers. We tried it on our systems and could confirm it still showed an error message, even after the update. </p><p id=\"A8ohHU\">Finally, as of 10:45AM ET or so, Polyphony Digital CEO Kazunori Yamauchi <a href=\"https://www.gran-turismo.com/us/gt7/news/00_3802725.html\">posted an explanation / apology</a> on the game’s website, and now players are finally able to access their Career mode and multiplayer racing. According to Yamauchi, “This was a rare issue that was not seen during tests on the development hardware or the QA sessions prior to the release, but in order to prioritize the safety of the save data of the users, we decided to interrupt the release of the 1.07 update, and to make a 1.08 correctional update.”</p><p id=\"E9zSrg\">He also responded to players’ issues with the changes to the in-game economy, saying, “In GT7 I would like to have users enjoy lots of cars and races even without microtransactions. At the same time the pricing of cars is an important element that conveys their value and rarity, so I do think it’s important for it to be linked with the real world prices. I want to make GT7 a game in which you can enjoy a variety of cars lots of different ways, and if possible would like to try to avoid a situation where a player must mechanically keep replaying certain events over and over again.”</p>  <figure class=\"e-image\">        <img alt=\"CE-21071 error displayed by Gran Turismo 7\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3BN3RWn7iy0OySztXGHu8QeRmtA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23326792/17f9d468bd030_screenshotUrl.jpg\">      <cite>Image: Cameron Faulkner</cite>  </figure><div class=\"c-float-right\"><aside id=\"17Upe7\"><q>Update 1.07 adjusted rewards for some races</q></aside><div id=\"xk3vMs\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Due to an issue found in Update 1.07, we will be extending the Server Maintenance period. We will notify everyone as soon as possible when this is likely to be completed. We apologize for this inconvenience and ask for your patience while we work to resolve the issue. <a href=\"https://twitter.com/hashtag/GT7?src=hash&amp;ref_src=twsrc%5Etfw\">#GT7</a></p>— Gran Turismo (@thegranturismo) <a href=\"https://twitter.com/thegranturismo/status/1504435541038833665?ref_src=twsrc%5Etfw\">March 17, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"Vid8A1\">The maintenance meant that much of <em>Gran Turismo 7</em>, including its career mode and multiplayer, was unplayable until services were restored Friday morning.</p><p id=\"oN2v3d\">According to <a href=\"https://www.gran-turismo.com/gb/gt7/news/00_1764433.html\">Polyphony’s patch notes</a>, Update 1.07 adds a number of fixes and changes, including a new <a href=\"https://www.gran-turismo.com/gb/gt7/news/00_5186203.html\">broadcast mode</a> that removes all licensed music tracks. However, Polyphony says it also adjusted the rewards for some events, and players <a href=\"https://www.reddit.com/r/granturismo/comments/tg5hzl/update_details_107_rally_licensesmissionscircuit/\">appear to have found</a> that for many races, you now get fewer credits, making it more difficult to save up in-game currency for more expensive cars. </p><p id=\"7B3ZqN\">Scanning through the <em>Gran Turismo</em> subreddit, it’s clear that <a href=\"https://www.reddit.com/r/granturismo/comments/tggvx0/update_complaints_mega_thread_17322/\">many fans are particularly unhappy</a> with the credits changes in the patch. Sony does sell in-game credits for real-world dollars that could help you get the cars you want, but those microtransactions are on top of the $60 or $70 you’re already paying just to buy the game (depending on if you get it for PS4 or PS5). It’s unclear if Polyphony will be making changes to the credit payouts in response to fan outcry.</p><p id=\"9bL18w\"><em><strong>Update March 18th, 9:49AM ET:</strong></em><em> Added information about 1.08 patch release and status of the ongoing server outage.</em></p><p id=\"xyq0Pd\"><em><strong>Update March 18th, 10:58AM ET:</strong></em><em> Added statement from Polyphony Digital CEO and updated article to reflect the current server status.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CcRvmGfacH_sj2olHZHPdQ88nGc=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23325167/i1yUwuUQyq9FluH.jpeg",
  "description": "GT7 is back after an outage that lasted more than a day.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}