{
  "title": "Great Scott! DeLorean sets a date for its electric resurrection (again)",
  "url": "https://www.theverge.com/2022/4/4/23010039/delorean-electric-concept-reveal-pebble-beach-date",
  "date": "2022-04-04T18:53:46.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/39w-SIKbSfvTucDs2LJ3Je0Ga1k=/0x450:2700x2250/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70709157/DeLorean.0.jpeg\" />        <figcaption>DeLorean Motor Company</figcaption>    </figure>  <p id=\"qkxUwt\">The DeLorean is an iconic vehicle — stainless steel body, gull-wing doors — and maybe the most famous movie car of all time. It’s also a brand name that many people have tried to resurrect over the years, with varying degrees of success. </p><p id=\"bmlv8N\">So you’d be remiss if you thought you were traveling back in time (yuk yuk) when you saw a headline claiming the DeLorean was about to be reborn as an electric vehicle and thought to yourself, “Didn’t I read that already?”</p><p id=\"1NQMPI\">Just to recap: The company that owns the branding rights and supplies parts to the several thousand vintage DeLorean sports cars that still exist <a href=\"https://www.prnewswire.com/news-releases/delorean-announces-new-reveal-date-with-teaser-image-301516437.html?tc=eml_cleartime\">announced</a> that it will be revealing an electric concept car at the Pebble Beach Concours d’Elegance in August. It also revealed a teaser image showing off the rear taillights. </p><div class=\"c-float-right\"><aside id=\"v3yL4F\"><q>“The Future was never promised”</q></aside></div><p id=\"nwBjNr\"><a href=\"https://www.delorean.com/\">The DeLorean Motor Company</a>, which is based in Texas, began teasing the reveal early this year, launching a social media campaign in February with the slogan “The Future was never promised,” which, for a car that is mostly associated with a movie about time travel, seems like a huge whiff. </p><p id=\"iNceX3\">We’ve been down this road before. The company released a <a href=\"https://www.theverge.com/2016/2/5/10923394/delorean-motor-company-tv-ad-video\">teaser video in 2016</a> promising a reborn DeLorean — but nothing came of it. In 2019, a group of Stanford scientists made <a href=\"https://news.stanford.edu/2019/12/20/autonomous-delorean-drives-sideways-move-forward/\">an autonomous DeLorean do donuts</a>, which was fun but also reminded us of what we’ve been missing. This latest version could also disappear in a cloud of smoke (or vapor) if we’re not too careful. </p><div id=\"qtSWBg\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let’s clear things up a bit. The next generation of DeLorean is coming into focus August 18, 2022. For more information read the press release here: <a href=\"https://t.co/Q4Rax2aBC1\">https://t.co/Q4Rax2aBC1</a> <a href=\"https://twitter.com/hashtag/DeLorean?src=hash&amp;ref_src=twsrc%5Etfw\">#DeLorean</a> <a href=\"https://twitter.com/hashtag/DeloreanEVolved?src=hash&amp;ref_src=twsrc%5Etfw\">#DeloreanEVolved</a> <a href=\"https://twitter.com/hashtag/firstlook?src=hash&amp;ref_src=twsrc%5Etfw\">#firstlook</a> <a href=\"https://t.co/H0t0i4ODqv\">pic.twitter.com/H0t0i4ODqv</a></p>— DeLorean Motor Company (@deloreanmotorco) <a href=\"https://twitter.com/deloreanmotorco/status/1511007352723542021?ref_src=twsrc%5Etfw\">April 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"bfPLvz\">This reimagined take on the original DMC-12 (which is the actual name of the vehicle that most people just call “The DeLorean”) will be a concept car, which is a polite way of saying “vaporware.” There’s no indication that the current DeLorean company has the money or manufacturing capacity to start churning out electric versions of John Z. DeLorean’s classic coupes. </p><p id=\"uXV4M6\">The company scored a win last year when the National Highway Traffic Safety Administration gave the green light to low-volume production of vintage replica cars, meaning there’s a better chance we get brand new replica DMC-12s before the electrified DeLorean hits the road. </p><p id=\"JxF9re\">That said, the DeLorean Motor Company does appear to be willing to milk this sucker for everything it’s worth. Not only is the company planning on parking its no-doubt bomb-looking EV on the lawn at Pebble Beach, but it is also planning three days of “activations and events” to generate hype leading up to the reveal. The official reveal will take place August 18th.</p><div class=\"c-float-right\"><aside id=\"irhAG4\"><q>the DeLorean Motor Company does appear to be willing to milk this sucker for everything it’s worth</q></aside></div><p id=\"Rs5BQg\">But before you start dusting off your 80s-era puffy vests and Nike high-tops, it’s worth noting that DeLorean says it’s working with Italdesign, a prestigious design shop that’s owned by Volkswagen. </p><p id=\"hmMm4E\">Not only that but the DeLorean company is headed by Joost de Vries, a former executive of Karma, the Chinese-owned automaker, which has produced gas-powered and hybrid vehicles based on IP bought from the bankrupt Fisker Automotive. </p><p id=\"0DETDV\">What happens when you combine the parent company of Audi and Lamborghini, which is working on its own lineup of EVs based on the flexible MEB architecture, with a company that owns the branding rights to an iconic (if problematic) vehicle? We may just need to speed up to 88mph so we can peak into the future and find out. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WU-94gnlzmrpQHG7QghOQPiy7ys=/0x643:2700x2057/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366496/DeLorean.jpeg",
  "description": "We’ve been down this road before.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}