{
  "title": "Green phones, ranked",
  "url": "https://www.theverge.com/2022/3/11/22970820/apple-iphone-13-pro-alpine-green-samsung-s22-compared-ranked",
  "date": "2022-03-11T14:00:00.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Pj_ZAP50NcNETWqQabfrekXZICA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70608426/ajohnson_220310_5073_0001.0.jpg\" />        <figcaption><em>Green phones are having a moment.</em> | Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p id=\"yP3NHV\">“So, is there some kind of promotional tie-in?” My husband was searching for answers. “No. They’re just green phones.” This was not a satisfying answer, so he continued.</p><p id=\"fmjIep\">“Is it an environmental thing? Like are they made out of recycled plastic or something?”</p><p id=\"q58Y8p\">Also no, I informed him. They’re just regular phones, but green.</p><p id=\"Q3t9QI\">“Oh, I bet it’s for St. Patty’s Day!” It also seemed unlikely that Apple would time the release of a new phone color for what is more or less an unofficial binge drinking holiday in this country, but I conceded that it was possible, given the mid-March timing.</p><p id=\"t7E7n5\">Earlier this week, Apple <a href=\"https://www.theverge.com/2022/3/8/22965564/apple-event-iphone-se-ipad-air-m1-ultra-mac-studio-display-biggest-announcements\">announced some really interesting new hardware</a>, including <a href=\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\">a new desktop for creatives</a> and <a href=\"https://www.theverge.com/2022/3/8/22962052/apple-studio-display-specs-price-release-date\">a display that doesn’t cost a fortune</a>. It also announced new iPhone 13 colors: regular green for the regular iPhone 13 and <em>alpine</em> green for the 13 Pro Max. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9B7r_J_sp_PhVU9BXTl9A7qaQW0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23304856/ajohnson_220310_5073_0002.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>“Alpine green” on the left, and just “green” on the right.</em></figcaption>  </figure><p id=\"xaM8rZ\">I set the two green iPhones on the dining room table alongside another recent green flagship phone: the Samsung Galaxy S22. I <a href=\"https://www.theverge.com/22955139/samsung-galaxy-s22-plus-review\">reviewed it earlier this month</a>, and I was caught a little off guard by just how much I liked the green treatment. </p><p id=\"dZKAkX\">So now, I am now confronted with three different shades of green on three different phones. The regular green on the standard iPhone is a little more saturated, more Kelly green than I was expecting. It also makes the Apple logo stand out more than I like. Alpine green is a bit softer and more muted. And sitting side by side by side, they both make the green S22 look much less green than I thought it was and more of a deep blue-green. </p><div class=\"c-float-right\"><aside id=\"uTj820\"><q>a green phone just looks different, but not in an attention-hungry kind of way</q></aside></div><p id=\"DiiQE1\">I’m not sure what it is about the green phone or why they’re suddenly having a moment. They’re not the first green smartphones by any means — Apple sold the iPhone 11 in a playful mint green and the 11 Pro in a dark “Midnight Green.” OnePlus has also offered “glacial” and “pine” green color options in recent history. But it’s noteworthy when the two top phone makers in the US suddenly both offer their flagships in various green treatments. Was there a memo the rest of us missed? Who decides these things? Green isn’t even the <a href=\"https://www.pantone.com/color-of-the-year-2022\">Pantone color of the year</a>.</p><p id=\"ilAiC2\">In any case, a green phone just looks different, but not in an attention-hungry kind of way. It’s a subtle statement, something that makes you wonder about the person carrying it. They probably really have their shit together. Like maybe they’ve already filed their taxes, and they drink enough water every day. Maybe they’ve figured something out that the rest of us haven’t. It’s also the color of American money.</p><p id=\"R4RI45\">Anyway, the iPhone 13 Pro is the current best green phone, followed by the standard iPhone 13, and the Galaxy S22 ranks third.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-sEh7WjvA6T_zQ-OGvrl4KBeGNU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23304855/ajohnson_220310_5073_0001.jpg",
  "description": "A totally objective assessment of three green flagships.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}