{
  "title": "GTA Online’s next-gen version is prettier and easier to get into",
  "url": "https://www.theverge.com/22978906/gta-online-ps5-xbox-series-x-s-version-next-gen-career-missions-graphics",
  "date": "2022-03-16T19:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"GTA Online\" src=\"https://cdn.vox-cdn.com/thumbor/GQPddMGnooR29HoffFaMFmaC5AY=/0x0:3240x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70631674/gtaonlineps5hero.0.jpg\" />        <figcaption>Image: Rockstar Games</figcaption>    </figure>  <p id=\"1WfZSA\">With this week’s launch of the next-gen versions of <em>GTA Online</em> for the Xbox Series X and PS5, Rockstar has made it easier and faster to jumpstart your life of crime in the best-looking and best-playing version of its online open-world mode. All of the same graphical and quality-of-life changes that recently arrived in <em>GTA V</em>, <a href=\"https://www.theverge.com/2022/3/16/22980756/grand-theft-auto-5-gta-next-gen-ps5-xbox-hands-on\">which my colleague Andrew Webster reported on here</a>, can also be found in <em>GTA Online</em>.</p><p id=\"YemAbd\">Whether you’re a new player, or you’re migrating a character from a previous console, one of my favorite improvements is that it’s easier to be funneled into the kind of content you want to play. From the main menu, you can enter heists, free mode (where you can just roam about with no immediate objective), or be directed to new content, <a href=\"https://www.theverge.com/2021/12/8/22823997/gta-online-update-story-missions-franklin-dr-dre-music-missions\">like “The Contract” missions featuring Dr. Dre and <em>GTA V</em>’s<em> </em>Franklin</a>. </p><div class=\"c-float-right\"><aside id=\"A4ArN4\"><q>GTA Online’s heap of content is offered in a more streamlined way</q></aside></div><p id=\"IQC6mR\">New players will first need to complete a few small, get-your-feet-wet missions before they can access the wider slew of content types. The game keeps out other online players until you reach level five, which requires about 25 minutes of play. That may annoy some who are hoping to jump in immediately with friends, but it could be key for keeping new players engaged instead of frustrated by repeat kills from more experienced and kitted-out players.</p>  <figure class=\"e-image\">        <img alt=\"GTA Online\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q0SfUvJaTeIedo8GZkoxEBrLjfY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320792/17f8e2e3abc16_screenshotUrl.jpg\">      <cite>Image: Rockstar Games</cite>  </figure><p id=\"znYUIs\">These changes provide a clear sense of what <em>GTA Online</em> offers at any given time, and it’s great that Rockstar is delivering the online mode’s heap of content in a more streamlined manner. Previously, jumping into <em>GTA Online</em> felt too aimless, yet simultaneously overwhelming for me, as the game tried to point me in several directions at once. </p><p id=\"icOG4c\">But after jumping in for the first time in a couple of years, it feels more guided with the introduction of the new mode select screen, as well as clever onboarding for new players. And with the myriad graphical and quality-of-life improvements surrounding load times, it feels like a minor reinvention for an online game that really needed one.</p>  <figure class=\"e-image\">        <img alt=\"GTA Online\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QKH9O7dHgrZjXf64zdOsLbSr4rQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320689/17f8e2e00a72_screenshotUrl.jpg\">      <cite>Image: Rockstar Games</cite>  </figure><p id=\"YjbWIH\">Another big update to <em>GTA Online</em> will be seen immediately by new players, or those who want to start a new character. Instead of being cut loose from the start and, more or less, having to find your own fun, you’ll first choose a career path (basically, a class), ranging from a real estate-focused executive and nightclub owner to a straight crime-focused biker or gunrunner — and that will put you on a fast track for accessing the kind of gameplay style and content that you may like most. </p><p id=\"3zaZ9p\">I chose the biker class, and the game tasked me with starting a weed farm and making transactions on the dark web. Within the first 10 minutes of playing, I’m told that I am the president of my biker gang, which I’ve named “Schweppes” in honor of the best seltzer brand, and I can appoint several others to run the circus with me, if I want.</p><p id=\"mhOu8Y\">You’ll get $4 million GTA bucks from the start, which you can spend on a clubhouse, business, vehicle, weaponry, and more before you even get out of jail. The game actually won’t let you proceed unless you spend at least $3 million of their startup cash injection, presumably to keep some semblance of balance for its online economy. It’s great to have guns, cars, and a motivation to keep going after five minutes of playing the game. </p>  <figure class=\"e-image\">        <img alt=\"GTA Online\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5__y456pthK_02AeuprJSbS5nZs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320705/17f8e2e133c26_screenshotUrl.jpg\">      <cite>Image: Rockstar Games</cite>  </figure><p id=\"sQoxim\">I don’t know how seriously I want to commit to the biker pathway that <em>GTA Online</em> has put me on, but it’s having me try out things I would have never thought to do before. Compared to my previous experiences with <em>GTA Online </em>(first, at launch in 2013, then again when the PC version debuted in 2015), I actually want to keep playing this time. I’m still less interested in investing and managing property than I am in racing and engaging in gun fights, yet the underlying structure and variance in the gameplay gives <em>GTA Online</em> more depth to match its new coat of paint. </p><p id=\"8mJqUU\">For PS5 and Xbox Series X / S owners who want to check out the latest version of <em>GTA Online</em>, <a href=\"https://www.theverge.com/2022/3/8/22967316/gta-v-ps5-xbox-series-x-s-next-gen-preload-preorder-cost\">it’s available as a standalone purchase for the first time since its 2013 debut</a>. It’s free to play for <a href=\"https://www.playstation.com/en-us/games/grand-theft-auto-v/?msclkid=60149d05a54b11ecb2db59392bb66041\">PS5 owners</a> until June 14th, 2022 (and <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.xbox.com%2Fen-US%2Fgames%2Fstore%2Fgrand-theft-auto-online%2F9NKC1Z4Z92VN%2F0010&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22978906%2Fgta-online-ps5-xbox-series-x-s-version-next-gen-career-missions-graphics\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$9.99 for Xbox</a> until that date), but it will eventually cost $19.99 for both console platforms.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1frLrcHjdwJsN-ejxIHDtbK42pA=/0x232:3240x1928/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320684/gtaonlineps5hero.jpg",
  "description": "The game hands you $4 million at the start.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}