{
  "title": "GTAV’s improved next-gen load times make the game so much faster",
  "url": "https://www.theverge.com/2022/3/16/22980756/grand-theft-auto-5-gta-next-gen-ps5-xbox-hands-on",
  "date": "2022-03-16T14:50:58.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pNbiLIt-SBD5ZZT3M4dtkbCRclw=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70630056/GTAV_Gen9_004.0.jpg\" />    </figure>  <p id=\"ETc4Ww\">For all of its open-world excess, <em>Grand Theft Auto V</em> is also a game about repetition: you go through missions multiple times, trying to finally complete that high-speed pursuit or violent shootout successfully. This can often mean reloading the same mission repeatedly, and — in previous iterations of the game — that time could add up quite a bit and become a frustrating nuisance. But after replaying the first few hours of the game’s new next-gen release, the thing that has struck me most is just how fast things move.</p><p id=\"yYT2Aj\"><em>GTAV</em> is out now on the PlayStation 5 and Xbox Series X / S (I’ve been playing the PS5 version), and it features the usual assortment of next-gen upgrades. That means support for 4K visuals, ray tracing, and 60fps gameplay, which you can access through a handful of visual modes: fidelity, performance, and performance RT. The smoother gameplay is nice, but I’ve mostly been playing in fidelity mode.</p><p id=\"xXMxJF\">Even now, nearly a decade after launch, <em>GTAV</em>’s open-world rendition of Los Santos is still impressive, and now, the console versions look on par with a high-end PC through more lifelike textures and lighting. The water, in particular, looks stunning. If it weren’t for the dated character models — particularly for everyone who isn’t part of the main cast — you could almost mistake it for a brand-new game.</p><div id=\"CL2yej\"><div ><iframe src=\"https://www.youtube.com/embed/lqiZdynJmag?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"7S7yst\">It looks great, and I’ve spent much of my time just driving around, watching the sunset while listening to the radio. It’s extremely chill. But when I do dip into the story, the experience is much-improved, thanks to the faster loading times. I am a bad <em>GTA</em> driver, which usually means it takes a few tries to track down a stolen yacht or help a paparazzi snap the perfect photo of a couple in a limo. Now, it takes just a few seconds to retry a mission, which is important for keeping you in the zone. It helps alleviate a lot of the frustration that comes from repeating the same sequence a bunch of times.</p><p id=\"8FBOGj\">The same goes for one of the game’s marquee features, the ability to swap between its trio of lead characters at almost any time. Previously, this involved a very long, very cool-looking animation where the map zooms from one character to the other. It looked great, but it also took forever, and the hassle usually meant I stuck with one character until I had no choice but to change. But I’ve found myself swapping back and forth between Michael and Franklin constantly this playthrough, simply because it’s so fast and easy to do so.</p><p id=\"DEk9nx\">(I should note that I haven’t been able to test two things: the ability to migrate saves from your previous console or <em>GTA Online</em>’s new streamlined onboarding. We’ll have more on the <em>Online</em> component soon.)</p><p id=\"8Zrm6u\">The game is still fundamentally the same, of course. The technical upgrades don’t impact the mission structure or storytelling or questionable satire. But they do make this the best version of a game that has aged surprisingly well over the years. There have been many, many open-world games since <em>GTAV</em> first launched in 2013, but there’s still nothing quite like its impeccably detailed modern setting filled with all-out mayhem. This update takes that experience, makes it a little prettier, and speeds it up significantly — and it should help fill the void while we all sit and wait for <a href=\"https://www.theverge.com/2022/2/4/22917783/rocstar-games-gta6-active-development-gta5-ps5-xbox-series-x-patch\">the inevitable launch of <em>Grand Theft Auto VI</em></a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4LLycTuM1TNdODYZ8T6XpHz7DJ8=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320149/GTAV_Gen9_004.jpg",
  "description": "The new version is out now on PS5 and Xbox.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}