{
  "title": "Habitat for humanity: how a classic MMO got a second life",
  "url": "https://www.theverge.com/23025168/habitat-for-humanity-mmo-game",
  "date": "2022-04-19T11:45:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Pw7gi1WR8J1AtgeIuhcelYDJ21c=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70762939/VRG_Illo_5122_M_Mathieson_Video_Game.0.jpg\" />        <figcaption>Illustration by Melissa Mathieson / The Verge</figcaption>    </figure>  <p id=\"BDRlz9\"><a href=\"https://www.theverge.com/2016/7/9/12134996/lucasfilm-games-habitat\"><em>Habitat</em>, the world’s first MMO</a> developed for the <a href=\"https://www.theverge.com/2012/8/31/3279757/commodore-64-turns-30-inspired-generation-programmers\">Commodore 64 personal computer</a>, went offline in 1992. It came back online in 2017 through the efforts of <a href=\"https://www.themade.org/about\">MADE</a>, the Museum of Art and Digital Entertainment.</p><p id=\"4Ccv3m\">Founded by Alex Handy in 2011, MADE “seeks to legitimize the preservation of video games as both a historic and artistic medium within the context of our time.” To that end, MADE amassed a collection of working video game consoles and a library of old games for patrons to play. </p><p id=\"QsG0WP\">“We do exhibits, we do preservation activities to preserve old systems, old code, and old games,” Alex Handy told <em>The Verge</em> via Zoom. </p><p id=\"DTBKrU\">But what’s exactly involved in bringing an MMO back from the dead? A generous donation, a lot of luck, and an absurd amount of guts.</p><div id=\"aHxjaW\"><div ><iframe src=\"https://www.youtube.com/embed/VVpulhO3jyc?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h3 id=\"XxG0jy\"><strong>A Generous Donation</strong></h3><p id=\"kRL10x\"><a href=\"https://journals.tdl.org/jvwr/index.php/jvwr/article/view/287/241\"><em>Habitat</em></a> was an online world that could support upwards of 15,000 users who could run businesses, play games, solve mysteries, found religions, or just hang out. Released in 1986, <em>Habitat </em>predated the likes of <a href=\"https://www.polygon.com/gaming/2012/9/25/3407476/ultima-online-celebrates-15th-anniversary-by-deposing-its-king\"><em>Ultima Online</em></a> and <a href=\"https://www.theverge.com/2012/1/31/2761608/everquest-goes-free-to-play-in-March\"><em>EverQuest</em></a> (the games many people think of when they think of “the first MMO”) by more than a decade. </p><p id=\"S2p0VH\">As online communities emerged from the primordial pre-modern internet soup of the late ‘70s and ‘80s, games that these communities could play together swiftly followed. <a href=\"https://en.wikipedia.org/wiki/MUD#:~:text=A%20MUD%20(%2Fm%CA%8Cd,interactive%20fiction%2C%20and%20online%20chat.\">MUDs</a>, or multi-user dungeons, were the first online multiplayer games and were wholly text-based. <em>Habitat</em> was inspired by MUDs and took its concept of a shared online gaming space one step further.</p><p id=\"A24jKe\">“MUDs were a thing,” Handy said. “But the idea of a graphical world you could walk around that was static and interact with other human beings within it was a new concept.”</p><div class=\"c-float-right\"><aside id=\"k6w7t2\"><q>Habitat was an online world that could support upwards of 15,000 users</q></aside></div><p id=\"Sz1QR0\">Developed by <a href=\"https://www.theverge.com/2013/4/3/4179386/disney-shuts-down-lucasarts-plans-to-license-star-wars-brand-to-others\">Lucasarts</a> with the talents of video game pioneers Chip Morningstar and Randy Farmer, <em>Habitat</em> ran on the Commodore 64 personal computer and connected players online via Quantum Link, the precursor to the America Online internet service. <em>Habitat</em> launched in beta from 1986 to 1988. Budget considerations forced Lucasarts to prune features for a rebrand in 1988 as <em>Club Caribe,</em> which lasted until its end in the early ‘90s.</p><p id=\"ijFvqQ\">“<em>Club Caribe</em> was sunset sometime between ‘91 and ‘92,” Handy said. “But the IP was sold to Fujitsu around then, and they ported it to all manner of other platforms and servers. <em>Habitat 2</em>, for example, <a href=\"https://youtu.be/WBsvYe594es\">is on the Sega Saturn Japan</a>.”</p><p id=\"LQmvZD\">Handy and his cohorts at MADE didn’t set out specifically to resurrect <em>Habitat</em>. It wasn’t a long-term passion project or the result of a concerted effort. “It was a great target of opportunity,” Handy said. “And we have not been presented with a good target of opportunity ever since.”</p><p id=\"9Cgk8S\">In 2013, Handy made plans to set up a MADE exhibit at the Game Developers Conference, a video game industry event for developers to talk about their games. Chip Morningstar, a former Lucasarts developer, was also planning to attend this GDC.</p><p id=\"UYyTk8\">Handy said, “I contacted Chip and asked, ‘Hey, do you have anything we could show at the conference? Any source code or anything like that?’” According to Handy, Morningstar sent him<em> Habitat</em>’s source code as a kind of joke, thinking there wouldn’t be much Handy could do with 27-year-old code. Undaunted, Handy responded to Morningstar, asking the developer what it would take to get the code working again as the game it once was. </p><p id=\"J3IOYL\">“​​He just laughed in my face,” Handy said.</p><h3 id=\"KQYYFN\"><strong>A Lot of Luck</strong></h3><p id=\"woWcAY\">Handy earned that incredulous laugh because, in addition to <em>Habitat</em>’s code being prehistoric in video game terms, it required what he described as an extremely obscure proprietary server and operating system, Stratus VOS, in order for it to work.</p><p id=\"A8Gd9B\">The Stratus problem was two-fold. Handy needed the software OS and a compatible piece of hardware to run it. Solving the hardware part of the equation involved a great deal of luck. Technology companies have come and gone, and if one survived into the present day, it usually isn’t making or maintaining products from nearly 30 years ago. But <a href=\"https://en.wikipedia.org/wiki/Stratus_Technologies\">Stratus Technologies</a>, the company that made the Stratus servers and operating system was, miraculously, still around. And, perhaps even more miraculously, it was still maintaining its old hardware. So when Handy asked for a server, they sent one.</p><p id=\"y4PA4Z\">The software problem was trickier. Any attempts to track down the Stratus VOS were met with confusion. </p><p id=\"nYCK68\">“When I contacted the Computer History Museum about Stratus after we had gotten our Stratus computer,” Handy said, a representative from the museum responded, “Oh my god, we forgot about Stratus!”</p><p id=\"8okntm\">Unable to obtain a copy of the Stratus VOS, Handy decided to tap connections and pool resources to see if it could be rebuilt from scratch.</p><p id=\"iQNpBA\">“I got together some modern day programmers, some guys who were really into the Commodore 64,” he said. “We got all these guys together with Chip and Randy in a room with this computer [...] and we just let them go for a day, and at the end of the day, they got a server up.”</p><p id=\"5PMy2D\">Handy had the game’s source code and had cobbled together a server that could host the code. The next step was enabling this ancient game to run on a modern internet, which is when Handy was met with his biggest obstacle yet: lawyers.</p><h3 id=\"P7H2ky\"><strong>An Absurd Amount of Guts</strong></h3><p id=\"Ym3poo\">If you wanted to play <em>Habitat</em> in 1986, you needed a Commodore 64 and a subscription to the <a href=\"https://en.wikipedia.org/wiki/Quantum_Link\">Quantum Link</a> (or Q-link) internet service provider. <em>Habitat</em> was exclusive to that service, and it contained code necessary for <em>Habitat </em>servers and Commodore 64 computers to work together. Essentially, without Q-Link then or now, <em>Habitat</em> will not work. Q-Link rebranded in 1989 to America Online and, through a series of ownership changes over the years, fell into the possession of Verizon. </p><p id=\"PMfTlu\">Handy, summoning the same pluck it took to ask Chip Morningstar for source code and Stratus Technologies for a computer, cold-called the head of Verizon’s legal department and asked for the old Q-link software libraries. Luck struck again: not only did Verizon still have those software libraries but it also seemed amenable to giving them up for Handy’s cause.</p><div class=\"c-float-right\"><aside id=\"LUYXXr\"><q>We just let them go for a day, and at the end of the day, they got a server up</q></aside></div><p id=\"Y5Pk4X\">“We thought we were gonna get them,” Handy said. “I literally had a guy put these on a USB stick, and was waiting for approval from legal.”</p><p id=\"wtBrzP\">But for reasons he could guess at, legal didn’t approve Handy’s request. “Even though it’s 30-year-old software, that company considers that to be at the core of its security, I guess. And so they would never open that up.”</p><p id=\"QJaErQ\">Handy now had two choices. <em>Habitat</em> would not work without Q-link, so he either needed to abandon his quest or find a way to get around the Q-link requirement. Sidestepping Q-link was technologically simple. Handy already had a cadre of developers who were capable of creating a program that would insert between <em>Habitat</em>’s servers and players’ computers, essentially functioning as the old Q-link service had. But the problem arose in the form of a complicated law designed to prevent that specific kind of sidestepping. It is <a href=\"https://www.theverge.com/2020/10/20/21525481/twitch-streamers-dmca-takedown-notices-riaa-copyright\">the bane of Twitch streamers</a> and <a href=\"https://www.theverge.com/2016/6/3/11852146/music-industry-fighting-youtube-dmca\">YouTubers</a> and <a href=\"https://www.theverge.com/2021/3/3/22311871/sinking-city-valve-steam-dmca-pirated-frogwares-nacon\">the enforcement tool of the entertainment industry</a> — the Digital Millennium Copyright Act, or DMCA.</p><p id=\"D2ovWi\">Broadly, the DMCA protects copyrighted material from unauthorized distribution. Buried within that law is section 1201, which “makes it unlawful to circumvent technological measures used to prevent unauthorized access to copyrighted works, including copyrighted books, movies, videos, video games, and computer software.”</p><p id=\"nqMAFW\">Nowadays, developers embed programs within video games called digital rights management, or DRM, to protect them from unauthorized use. Even though Q-link existed before DRM as we think of it today, it is essentially DRM protection for <em>Habitat. </em>Because section 1201 of the DMCA prohibits any attempt at circumventing a protection measure, getting around the Q-link roadblock would be technically illegal. </p><p id=\"lL0DTB\">However, the DMCA does make exceptions; making the case that circumventing a protection measure serves public interest, the <a href=\"https://www.theverge.com/2021/10/27/22747310/us-copyright-office-dmca-section-1201-exemption-rulemaking-report\">US Copyright Office grants 1201 exemptions</a> to organizations. Handy petitioned the office for an exemption to create the program that would get around Q-link.</p><p id=\"mJNB1D\">“In the end, the exemption that they gave us was basically, ‘You can preserve an MMO, and you can circumvent those validation mechanisms, but only if the MMO is locked in a room and you are sitting on a computer directly next to it.’ You can provide absolutely no internet access to the thing,” Handy explained.</p><p id=\"262HK6\">Handy finally had all the pieces he needed to bring <em>Habitat</em> back online, but he was prevented from actually doing so. Without the “O” in MMO, the “MM” portion falls apart. The game was technically alive — but functionally and spiritually worthless.</p><p id=\"HCXSC4\">So what happened? How is it that anyone can play it now?</p><p id=\"0ZK5JX\">“We don’t care,” Handy said with a simple laugh.</p><p id=\"ypnEGC\">Though Handy’s exemption specifically stated that <em>Habitat</em> could not be hosted online, he decided to put it online anyway. He was quick to stress that playing the game itself is not an illegal act. He got the source code from its creators and obtained permission from the Japanese rights holder to do whatever with it.</p><p id=\"Rg85WZ\">“We didn’t get the computer software libraries that allow for the interconnect, the Q-link middle piece, and specifically the circumvention of that is what is illegal,” Handy pointed out.</p><p id=\"fLoHtb\">Handy didn’t seem at all concerned about any potential legal ramifications of his guerilla act of video game preservation.</p><p id=\"oHXsUO\">“If [Verizon] wants to come and be upset about it, they can,” he said. “We tried to talk to you about it, let’s resume the discussion.” Ultimately, Handy made the decision to ask for forgiveness, not permission.</p><div id=\"Oxx777\"><div ><iframe src=\"https://www.youtube.com/embed/aI0qRkCdRQ8?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h3 id=\"n3UJfu\"><strong>The World’s First MMO</strong></h3><p id=\"xa1LuW\">You can play <em>Habitat</em> online right now for free at <a href=\"http://neohabitat.org/\">neohabitat.org</a>. The game’s source code <a href=\"https://github.com/frandallfarmer/neohabitat\">is available on GitHub</a>, and there’s a video on YouTube that gives tips and tricks on how to play. Though <em>Habitat</em> was, at one time, capable of supporting tens of thousands of players, Handy said there’s nowhere near that many playing now, but the world is alive and people still use it. </p><p id=\"luUOuT\">“People just meet up now you know,” he said. “You see 2, 3, 4 people shot pop in.” He even shared that a Swedish club of Commodore 64 enthusiasts once hosted a meetup in the new <em>Habitat.</em></p><p id=\"jvLaqu\">When we think of MMOs today, we think of <em>World of Warcraft</em> and <em>Final Fantasy XIV</em>. MMOs come equipped with standard features like customizable avatars representing individual players, in-game currencies to earn and use on virtual goods, and numerous social activities  — like quests, dungeons, and player combat. All these MMO standards came from <em>Habitat</em>. Before Meta or Google or Amazon ever dreamed of a metaverse, indeed before any of them existed as companies, <em>Habitat</em> was the first metaverse. </p><p id=\"26CheA\">Despite being every bit the cultural institution movies, books, art, and music are, video games often do not get the same consideration as their cultural peers. We enshrine works of art in libraries, archives, and museums. We support art financially and dedicate entire academic fields to its preservation and study. But, for the most part, video games are bereft of such support, left at the mercy of continuous technological advancements that render new video game hardware and software obsolete every decade. The result is the decay of an incalculable wealth of video game history at a rate that outpaces the gaming community’s efforts to save it. </p><p id=\"3asQoG\"><em>Habitat</em> is a game to which all modern MMOs — some of the biggest, most popular games on the planet — owe tribute. But without Handy’s passion, MADE’s resources, and the developers’ foresight to hold onto their source code, <em>Habitat</em> would be one more of the many games lost to time, neglect, and technology.</p><p id=\"GChu30\"></p><p id=\"0gNWnF\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/og3nmuBXKHh5nYkJG0gQJt5LUkg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366369/VRG_Illo_5122_M_Mathieson_Video_Game.jpg",
  "description": "Before EverQuest or Ultima Online, there was Habitat.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}