{
  "title": "Hacking group posted fake Ukrainian surrender messages, says Meta in new report",
  "url": "https://www.theverge.com/2022/4/7/23013983/fake-ukrainian-surrender-messages-meta-threat-report",
  "date": "2022-04-07T12:01:37.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ydl0cjXrtGwrwZ1gTgr7UFxovx4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70720566/acastro_211101_1777_meta_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"mPxLst\">A Belarus-aligned hacking group has attempted to compromise the Facebook accounts of Ukrainian military personnel and posted videos from hacked accounts calling on the Ukrainian army to surrender, according to a <a href=\"https://about.fb.com/news/2022/04/metas-adversarial-threat-report-q1-2022/\">new security report</a> from Meta (the parent company of Facebook).</p><p id=\"4DB18F\">The hacking campaign, previously labeled “Ghostwriter” by security researchers, was carried out by a <a href=\"https://www.mandiant.com/resources/unc1151-linked-to-belarus-government\">group known as UNC1151</a>, which has been linked to the Belarusian government in research conducted by Mandiant. A February <a href=\"https://about.fb.com/news/2022/02/security-updates-ukraine/\">security update</a> from Meta flagged activity from the Ghostwriter operation, but since that update, the company said that the group had attempted to compromise “dozens” more accounts, although it had only been successful in a handful of cases. </p><p id=\"GciQBb\">Where successful, the hackers behind Ghostwriter had been able to post videos that appeared to come from the compromised accounts, but Meta said that it had blocked these videos from being shared further.</p><p id=\"ii9220\">The spreading of fake surrender messages has already been a tactic of hackers who compromised television networks in Ukraine and <a href=\"https://www.nytimes.com/2022/04/05/us/politics/ukraine-russia-hackers.html\">planted false reports of a Ukrainian surrender</a> into the chyrons of live broadcast news. Though such statements can quickly be disproved, experts have suggested that their purpose is to erode Ukrainians’ trust in media overall.</p><div class=\"c-float-right\"><aside id=\"4PyVMi\"><q>The company said that the group had attempted to compromise “dozens” more accounts</q></aside></div><p id=\"2Fx0B5\">The details of the latest Ghostwriter hacks were published in the first installment of Meta’s quarterly Adversarial Threat Report, a new offering from the company that builds on a similar <a href=\"https://about.fb.com/news/2021/12/metas-adversarial-threat-report/\">report from December 2021</a> that detailed threats faced throughout that year. While Meta has previously published regular reports on <a href=\"https://www.theverge.com/2021/9/16/22677732/facebook-coordinated-authentic-inauthentic-behavior-moderation-policy\">coordinated inauthentic behavior</a> on the platform, the scope of the new threat report is wider and encompasses espionage operations and other emerging threats like mass content reporting campaigns.</p><p id=\"E7GMar\">Besides the hacks against military personnel, the latest report also details a range of other actions conducted by pro-Russian threat actors, including covert influence campaigns against a variety of Ukrainian targets. In one case from the report, Meta alleges that a group linked to the Belarusian KGB attempted to organize a protest event against the Polish government in Warsaw, although the event and the account that created it were quickly taken offline.</p><div class=\"c-float-right\"><aside id=\"e2bRtZ\"><q>“While much of the public attention in recent years has been focused on foreign interference, domestic threats are on the rise globally.”</q></aside></div><p id=\"vyKnfB\">Although foreign influence operations like these make up some of the most dramatic details of the report, Meta says that it has also seen an uptick in influence campaigns conducted domestically by repressive governments against their own citizens. In a conference call with reporters Wednesday, Facebook’s president for global affairs, Nick Clegg, said that attacks on internet freedom had intensified sharply.</p><p id=\"CTXF43\">“While much of the public attention in recent years has been focused on foreign interference, domestic threats are on the rise globally,” Clegg said. “Just as in 2021, more than half the operations we disrupted in the first three months of this year targeted people in their own countries, including by hacking people’s accounts, running deceptive campaigns and falsely reporting content to Facebook to silence critics.”</p><p id=\"idiZOw\">Authoritarian regimes generally looked to control access to information in two ways, Clegg said: firstly by pushing propaganda through state-run media and influence campaigns, and secondly by trying to shut down the flow of credible alternative sources of information. </p><p id=\"mAfkSm\">Per Meta’s report, the latter approach has also been used to restrict information about the Ukraine conflict, with the company removing a network of around 200 Russian-operated accounts that engaged in coordinated reporting of other users for fictitious violations, including hate speech, bullying, and inauthenticity, in an attempt to have them and their posts removed from Facebook.</p><p id=\"ZAhBEs\">Echoing an argument taken from Meta’s <a href=\"https://www.theverge.com/interface/2020/2/19/21142478/facebook-regulation-content-moderation-singapore-pakistan\">lobbying efforts</a>, Clegg said that the threats outlined in the report showed “why we need to protect the open internet, not just against authoritarian regimes, but also against fragmentation from the lack of clear rules.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7_DEKXgLohyHzTf_PYfUHXUlRqE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22977157/acastro_211101_1777_meta_0003.jpg",
  "description": "The Belarus-linked \"Ghostwriter\" operation targeted dozens of accounts.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}