{
  "title": "Hackers breached Mailchimp to phish cryptocurrency wallets",
  "url": "https://www.theverge.com/2022/4/4/23010317/hackers-mailchimp-trezor-cryptocurrency-phishing",
  "date": "2022-04-04T19:21:05.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1XbUmRIMVppR4EajUHwZ2iogKkE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70709284/acastro_210218_1777_mailchimp_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"blvpHm\">Mailchimp, the veteran email marketing platform, has confirmed that hackers used an internal tool to <a href=\"https://techcrunch.com/2022/04/04/mailchimp-internal-tool-breach/\">steal data from more than 100 of its clients</a> — with the data being used to mount phishing attacks on the users of cryptocurrency services.</p><p id=\"XcemXV\">The breach was confirmed to the press by Mailchimp on Monday, but it had come to light over the weekend when users of the Trezor hardware cryptocurrency wallet reported being targeted by sophisticated phishing emails.</p><div id=\"dg7paw\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">MailChimp have confirmed that their service has been compromised by an insider targeting crypto companies.<br><br>We have managed to take the phishing domain offline. We are trying to determine how many email addresses have been affected. 1/</p>— Trezor (@Trezor) <a href=\"https://twitter.com/Trezor/status/1510558771944333312?ref_src=twsrc%5Etfw\">April 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"WelGAD\">In a statement sent to <em>The Verge</em>, Mailchimp CISO Siobhan Smyth said that the company had become aware of the breach on March 26th when it detected unauthorized access of a tool used by the company’s customer support and account administration teams. Although Mailchimp deactivated the compromised employee accounts after learning of the breach, the hackers were still able to view around 300 Mailchimp user accounts and obtain audience data from 102 of them, Smyth said.</p><p id=\"DJrtF8\">“We sincerely apologize to our users for this incident and realize that it brings inconvenience and raises questions for our users and their customers,” Smyth said. “We take pride in our security culture, infrastructure, and the trust our customers place in us to safeguard their data. We’re confident in the security measures and robust processes we have in place to protect our users’ data and prevent future incidents.”</p><p id=\"jaEmxs\">However, details of the hack show that the compromise of Mailchimp’s internal tools was just one piece in a bigger puzzle. As <em>Bleeping Computer</em> reports, one of the stolen email lists was used to <a href=\"https://www.bleepingcomputer.com/news/security/fake-trezor-data-breach-emails-used-to-steal-cryptocurrency-wallets/\">send a fake data breach notification</a> to Trezor customers, prompting them to download a new version of the Trezor Suite desktop application. In fact, the email directed users to a phishing site that hosted a fake version of the application, designed to steal the seed phrase that would allow hackers to gain total control over a user’s cryptocurrency wallet. It’s currently unclear whether any Trezor users had funds stolen by the attack.</p><p id=\"NHB5Gx\">In a <a href=\"https://blog.trezor.io/ongoing-phishing-attacks-on-trezor-users-edd840b17304\">blog post</a> published Monday, Trezor said that the attack was “exceptional in its sophistication and ... clearly planned to a high level of detail,” with the cloned version of the Trezor Suite app presenting a realistic functionality to anyone who installed it. SatoshiLabs, the makers of the Trezor wallet, have not yet responded to further questions sent by <em>The Verge</em>.</p><p id=\"CqkjAZ\">So far, Mailchimp’s analysis has concluded that the attackers focused on obtaining data from users in the cryptocurrency and finance sectors. Unfortunately for Trezor users — and for customers of every other organization whose data was compromised — it’s safe to say that a skilled threat actor now has knowledge of the users’ email contact details and potentially the type of crypto hardware and software they are using.</p><p id=\"vWatnf\">Users of Trezor devices have been advised to report any new phishing attempts directly to <a href=\"mailto:security@trezor.io\">security@trezor.io</a>. Mailchimp has stated that the owners of all other compromised accounts have been informed, so more notifications from affected entities will likely appear soon.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/riT1SdxszA_ul-sQBNM3ZP0sF44=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22328056/acastro_210218_1777_mailchimp_0001.jpg",
  "description": "Trezor said the attack was \"exceptional in its sophistication.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}