{
  "title": "Halo’s first season is a Flood of bold bets and tangled plot points",
  "url": "https://www.theverge.com/23132662/halo-tv-series-season-1-review-paramount-plus",
  "date": "2022-05-20T19:00:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1oKOAeDgOAfN0n4sYPDOL-iaJ10=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70893249/silver_team.0.png\" />        <figcaption>Image: CBS / Paramount Plus</figcaption>    </figure>  <p>The show’s reach exceeds its grasp</p> <p class=\"p--has-dropcap p-large-text\" id=\"XR3y8U\">The <a href=\"https://www.theverge.com/2022/3/23/22991842/paramount-halo-show-review\"><em>Halo</em> TV series’</a> season finale premiered yesterday, bringing the first season to an interesting if incomplete end. With a full season in the tank, I’m finally able to fully judge the show as a complete entity, and I gotta say: it’s complicated.</p><p id=\"kf6C0I\">The <em>Halo</em> TV series is complicated like a toxic hook-up is complicated. Is this person bad for you? Yes. Is the sex great? Meh. But are you intrigued <em>just enough</em> to keep them around to see where it goes? Absolutely.</p><p id=\"nrnEJT\">Despite the fact that I don’t really feel <em>Halo</em> is either a good season of television or a good exploration of the <em>Halo </em>canon, I’m not ready to yeet it into the <a href=\"https://www.halopedia.org/Halo:_Glasslands\">glasslands</a> <a href=\"https://www.theverge.com/2021/12/9/22827010/cowboy-bebop-netflix-live-action-cancel\">the way Netflix did</a> my <a href=\"https://www.theverge.com/22776962/cowboy-bebop-review-netflix\">beloved but troubled <em>Cowboy Bebop</em></a>.</p><p id=\"nCeXLo\">There were just so many good, well-executed concepts swirling around in <a href=\"https://www.halopedia.org/Slipstream_space\">slipspace</a> just waiting for the right <a href=\"https://www.halopedia.org/Shaw-Fujikawa_Translight_Engine\">Shaw-Fujikawa engine</a> to get them where they need to be. </p><p id=\"4avkBh\">Pablo Schreiber was a good Master Chief. He made some weird decisions (or rather, the writers made some weird decisions for him) but, overall, he struck the correct tone as John-117. He’s got the gravitas of a natural leader and a competent soldier. He’s also stoic but not too serious. If anything, he might have been a little too staid and could have used some more one-liners to lighten him up to the appropriate Master Chief level. Remember the crack in <em>Halo 2 </em>about giving the Covenant back their bomb? More of that, please.</p><div class=\"c-wide-block\"><div id=\"eUs9Ir\"><div ><iframe src=\"https://www.youtube.com/embed/WiwZY9B6EjM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"1gtN87\">But competent as Schreiber was, he was outshone by almost every principal female character. </p><p id=\"WvIARU\">Atrocious haircut aside, I really enjoyed Yerin Ha as Kwan Ha, the orphan human colonist fighting to save her world from the UNSC bootlicker played by Burn Gorman. There was so much promise with her character and the Master Chief in the first episode. If the entire series had been about Master Chief getting in touch with his humanity with help from Kwan while he taught her how to be a better soldier and leader in the wake of her father’s murder, this would have been a much better show. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yoEbRS34VqnwIJTLd1x-iuko1us=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23577452/Kwan_Ha_wood.png\">      <cite>Image: CBS / Paramount Plus</cite>  </figure><p id=\"QAL4jw\">Natascha McElhone’s Dr. Halsey was a gross, almost cartoonishly evil caricature of her character from the games, but it worked. The showrunners basically transposed Cortana’s motivations at the end of <a href=\"https://www.theverge.com/2015/10/26/9614274/halo-5-review\"><em>Halo 5: Guardians</em></a> — essentially, “I will save you through your utter subjugation” — onto her human progenitor. While an explicit departure from her canon character, it makes sense. Dr. Halsey has done some unspeakably evil things that she justified by saying it was for the greater good. The showrunners simply took this ethos to its natural conclusion that McElhone played to chilling perfection.</p><p id=\"lXs7uG\">I’m actually really disappointed in the showrunners’ treatment of Makee, the Human Covenant spy played by Charlie Murphy (the Irish actress from <em>Peaky Blinders —</em> <em>not</em> Eddie Murphy’s brother). She would have been another great foil for John since this is a woman who is his sworn enemy, even more than Kwan Ha. But because of their shared connection to the artifacts everyone is after, they become so close <a href=\"https://www.theverge.com/2022/5/12/23069343/paramount-plus-halo-tv-show-master-chief-sex-scene\">they wind up as lovers</a>. The idea of John having a girlfriend is unfathomably weird, but why the hell not? It’s an idea that’s never been explored in the canon (his evident but platonic love of Cortana aside), and the showrunners had already <a href=\"https://www.theverge.com/2022/3/24/22994651/paramount-plus-halo-tv-show-halo-lore\">played fast and loose with John’s characterization</a>, so why not let him have a girlfriend? I would have loved to see more of Makee and John exploring and learning the elements of romantic love — an emotion neither of them has experience with — especially a romantic love fraught with the anxieties of two people raised on opposite sides of a war. The enemies to lovers fanfiction writes itself!</p><p id=\"6xxVbJ\">But the writers didn’t want us to have nice things. Even after Makee’s double-cross at the end of episode eight, it was still clear she and John cared for one another and that she would be willing to abandon the Covenant again for his sake. But when he’s seconds away from convincing her to join him once again, Kai-125 (Kate Kennedy) shoots and kills her. </p><div class=\"c-float-right c-float-hang\"><aside id=\"VP2lnX\"><q>The enemies to lovers fanfiction writes itself</q></aside></div><p id=\"KFb7nk\">Makee was wasted potential. It was like the showrunners didn’t really know what to do with her beyond her status as a plot device, and they had no better imagination for her than dropping the big ol’ <a href=\"https://en.wikipedia.org/wiki/Women_in_Refrigerators\">metaphorical fridge</a> on her head. There is a chance she could come back in season two, so all this hand-wringing may be for nothing, but we’ll just have to see.</p><p id=\"tqV0YE\">Of all the women who act circles around Schreiber, none were better than Miranda Keyes (Olive Gray) and Kate Kennedy. They were amazing in every scene they were in, and the one scene they were in together was probably the best, most heartfelt, and cutest moment in the show. </p><p id=\"XgkW0k\">I love what they did with Miranda. She got to be an actual person with more emotion and motivation than her video game counterpart, who barely stepped beyond the confines of being an emotionless, “honor and duty” soldier of the UNSC. I felt for her in the moments in which she tried to connect with her mother Dr. Halsey, wishing to be both respected and loved by her while also wanting nothing to do with her “by any means necessary” cruelty. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ltGCWdpU7mHFPapQ5t3SeIECDQc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23577447/Dr._Halsey_and_Miranda_.png\">      <cite>Image: CBS / Paramount Plus</cite>  </figure></div><p id=\"4hRrHS\">And Kai? Kai’s just the best actor in the show. Period. Season two could be nothing but Kai bench pressing warthogs and geeking out over Covenant language with Miranda, and it would be a perfect show. When Kai followed John’s example and removed her emotion suppressant pellet, she came into her humanity much more naturally and believably than John. She is the most like the Spartans I know from the books and games. She’s got the sniping skills of <a href=\"https://www.halopedia.org/Linda-058#:~:text=Petty%20Officer%2C%20First%20Class%20Linda,and%20scout%20of%20Blue%20Team.\">Linda-058</a> and the devil may care attitude of <a href=\"https://www.halopedia.org/Frederic-104\">Fred-104</a> and <a href=\"https://www.halopedia.org/Edward_Buck\">Edward Buck</a>.</p><p id=\"xyYQtq\">Seeing Kai so well-written puts her at odds with the rest of her team, who I felt were left behind. I would have liked the show so much better if Riz-028 and Vannak-134 got the same treatment Kai and John did. Silver Team was so disjointed with Kai and John on one side and Riz and Vannak on the other: they often tried but failed to be a believable team, and I felt like the showrunners didn’t quite understand that the core appeal of Spartan teams is their camaraderie. <em>Halo</em> fans would have forgiven a lot of the show’s plot missteps if the Spartans of Silver Team were more like <a href=\"https://www.halopedia.org/Blue_Team\">Blue Team</a> or <a href=\"https://www.halopedia.org/NOBLE_Team\">Noble Team</a> or even <a href=\"https://www.halopedia.org/Fireteam_Osiris\">Fireteam Osiris</a>. </p><p id=\"yoOAIA\">Great performances aside, the plot of the <em>Halo</em> TV show was a jumbled mess. The Kwan Ha and Soren-066 subplot quickly became tedious and extraneous. It either needed to be better integrated into the main plot somehow or jettisoned — not kept on like it was to slow the more interesting bits of the story down. A nine-episode season is supposed to be quick and tight, and yet we got filler. Also, there are several moments throughout the season when the camera switched perspectives to first-person like it is in the games. Stop that. It’s bad. It’s always jarring and ugly and immersion-breaking. It didn’t work in <em>Doom</em> all those years ago, and it doesn’t work now. Stop it.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/g476RSD1NR5hCk5xRVgIzg_QkSw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23577441/more_kai.png\">      <cite>Image: CBS / Paramount Plus</cite>  </figure><p id=\"tw113X\"> </p><p id=\"hxNWF0\">The Covenant as the villains were just fine. Though all the aliens save the Prophets looked laughably bad in a low-budget, “presented by SyFy” kind of way, it was good that they weren’t the main focus of the season. One of the things I appreciated the most about the show, and the reason why I’m willing to give it another chance, is that it wasn’t the masturbatory celebration of military propaganda that it could have so easily been. </p><p id=\"h0aZxL\"><em>Halo</em> could have just been nine episodes of good upstanding soldiers in power armor punching the shit out of hyper-religious alien zealots because, for the most part, that’s what the first three games are. While I can’t agree with all of the choices the showrunners made, I at least respect the hell out of their, “Fuck it, anything goes” approach to <em>Halo</em>’s story. The <em>Halo</em> universe has such a richness to it that hasn’t yet been thoroughly explored from new angles. We’ve never really seen the Master Chief meaningfully tangle with what he is or what he was created to do, and we’ve definitely never seen him as a man with desires. The <em>Halo</em> writers tried to give us those new perspectives in a clumsily executed but earnest fashion. They took big risks playing around with one of the most beloved franchises in video game history, and I appreciated their unsuccessful attempt to do something different more than I would have a successful attempt at something easy. </p><p class=\"c-end-para\" id=\"EyxZBR\">This isn’t the end of <em>Halo</em>. The show has already been <a href=\"https://www.theverge.com/2022/2/15/22936201/halo-tv-show-paramount-plus-season-two-renewed\">approved for a second season</a>. There’s a good show here buried in superfluous plotlines and embarrassingly bad CGI. If the showrunners can find it, I believe they can <a href=\"https://youtu.be/MxnL7PIxW14\">deliver hope</a> of a better season two. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/W74NXjVLD0MbbSfEW77QXa6e-AA=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23577437/silver_team.png",
  "description": "Halo reaches for greatness but falls short.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}