{
  "title": "Halo Infinite’s long-awaited campaign co-op mode is slated for August",
  "url": "https://www.theverge.com/2022/4/22/23038049/halo-infinite-co-op-campaign-mode-forge",
  "date": "2022-04-22T23:28:44.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3ZVQ9xP2wL-W1A9_2H2zsPLmxvQ=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70783109/HaloInfinite_SpartanLineup_Header.0.jpeg\" />        <figcaption><em>Some of the new armor customization options in </em>Halo Infinite’s<em> second season.</em> | Image: 343 Industries</figcaption>    </figure>  <p id=\"rUgTG6\"><em>Halo Infinite </em>developer 343 Industries is targeting a “late August” launch for the game’s long-awaited network co-op campaign mode, the game’s head of creative Joseph Staten says in <a href=\"https://www.halowaypoint.com/news/halo-infinite-update-april-2022\">a new Halo Waypoint blog post</a>. As part of a new roadmap included in the post, Staten also shared that 343 is targeting an open beta for <em>Halo Infinite’s</em> Forge mode in September.</p><p id=\"WLZGyv\">343 Industries announced months ahead of <em>Halo Infinite’s</em> December release that co-op and Forge mode <a href=\"https://www.theverge.com/2021/8/20/22634448/halo-infinite-co-op-campaign-forge-delay-launch\">wouldn’t be available at launch</a>. The developer then said it was aiming to ship campaign co-op <a href=\"https://www.theverge.com/2021/11/19/22791487/halo-infinite-campaign-co-op-season-2-may-2022-forge\">“with” season 2</a>, and then pushed that target <a href=\"https://www.theverge.com/2022/3/6/22964321/halo-infinite-campaign-co-op-season-two-may\">to “later” in season 2</a>.</p><p id=\"hUiGoK\">Split-screen campaign co-op, which lets you play the campaign with your friends on the same TV, is even further away. Based on the roadmap, 343 Industries doesn’t expect to launch split-screen co-op until sometime during the game’s third multiplayer season, which begins November 8th. And it seems that estimate could still shift, as the roadmap says split-screen co-op’s timing is “TBD.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tf-io8WAKfIlLeA3DzqvtNxALw4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23410484/HaloInfinite_2022Roadmap_April.jpeg\">      <cite>Image: 343 Industries</cite>      <figcaption><em>343 Industries’ 2022 roadmap for </em>Halo Infinite<em>.</em></figcaption>  </figure><p id=\"CrcEBS\">As for Forge, here’s what Staten discussed about how 343 is planning to jump right into an open beta:</p><blockquote><p id=\"J1OvXb\">We want to get the Forge toolset into your hands sooner rather than later so that awesome community maps and modes can more rapidly make their way into the game. To make this happen, we’re targeting a Forge open beta later in Season 2. We’ve successfully had Forge in private flighting with a limited audience for some time, so we’ve decided to forgo a large-scale formal flighting program and go right to open beta. With this approach, we can get the core Forge tools out to everyone quicker while also remaining focused on our core priority of continuing to improve foundational aspects of <em>Halo Infinite</em>. Forge will persist from the open beta onwards, evolving and growing over time.</p></blockquote><p id=\"SlM8jX\">According to the roadmap, 343 Industries is also targeting a late August release for a feature that lets you replay campaign missions, <a href=\"https://www.theverge.com/2021/12/6/22821522/halo-infinite-campaign-levels-replay-mission-select-343-industries-microsoft\">which was a notable omission at launch</a>.</p><p id=\"vkXecM\">While it might be frustrating to hear that you’ll have to be waiting a while longer for many of these features, Staten stressed that the company is taking the time it needs to develop the features at a pace that’s good for the team’s health. “We know we need to deliver more content and more features more quickly,” Staten said. “Staying true to priority zero means that sometimes we need to slow down in order to stay healthy and move faster later.” Staten also noted that 343 is planning to introduce in-season quality-of-life improvements in what it calls “Drop Pods.”</p><p id=\"LjBPtq\"><em>Halo Infinite’s </em>second multiplayer season begins on May 3rd, and it will add <a href=\"https://www.polygon.com/23026634/halo-infinite-season-2-maps-breaker-catalyst-preview-release-date\">new maps</a> and <a href=\"https://www.polygon.com/23036025/halo-infinite-season-2-game-modes\">new modes</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LrGILPQU2ItX5mUJCw2rUmpAY14=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23410494/HaloInfinite_SpartanLineup_Header.jpeg",
  "description": "But that’s only online co-op. Split-screen is coming later.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}