{
  "title": "Halo Infinite’s Big Team Battle is fixed, again, maybe",
  "url": "https://www.theverge.com/2022/2/3/22916398/halo-infinite-patch-update-fix-big-team-battle-matchmaking",
  "date": "2022-02-03T19:17:44.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"Halo Infinite multiplayer\" src=\"https://cdn.vox-cdn.com/thumbor/dHYSBPh12TkQZkIawlMD6VT3UpE=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70467827/Halo_Infinite_Multiplayer_4_4K_3840x2160_scaled.0.jpg\" />        <figcaption>Image: 343 Industries</figcaption>    </figure>  <p id=\"xfGfDC\">If you ask me, the best part of <em>Halo Infinite</em> is Big Team Battle, an epic 24-player mode that lets you squad up with up to 11 friends across Xbox, <a href=\"https://www.theverge.com/2021/6/28/22554267/microsoft-xcloud-game-streaming-xbox-pass-ios-iphone-ipad-pc\">cloud</a>, and Windows PC — but it’s been <a href=\"https://www.theverge.com/2022/1/10/22877515/microsoft-halo-infinite-big-team-battle-matchmaking-fix-343\">riddled with matchmaking bugs</a> that keep games from starting, kick out your buddies, or even crash the game. Today, 343 Industries is taking another stab at making things better <a href=\"https://twitter.com/Halo/status/1489303178311086080\">with a new patch that’s now live</a>.</p><p id=\"uspORe\">The February 3rd patch’s changelog is pretty basic, primarily just saying that there have been unspecified “service improvements” to Big Team Battle’s matchmaking and that “[p]layers should find full matches quicker and more consistently.” </p><p id=\"w42PqM\">But 343 Industries had previously telegraphed that today might be the substantial fix we’ve been waiting for. Here’s what a developer <a href=\"https://forums.halowaypoint.com/t/halo-infinite-update-jan-28/496961\">wrote on the Halo Infinite forums six days ago</a>:</p><blockquote><p id=\"qcb571\">Using the telemetry we received from the hotfix on January 19, we were able to make a new build with an update that we believe should address the core issue impacting the BTB playlist. The studio ran a successful playtest today and plans to send it off for certification on Monday. After it’s sent off, it will take some time to go through the certification process and to find out if it’s approved. Once it’s approved, we’ll begin preparing to release it to the public. Since there’s still a little more of the internal release process to go through, the earliest we’d expect this hotfix to land would be next Thursday, February 3.</p></blockquote><p id=\"4m8XIZ\">Today’s February 3rd, and here’s a Big Team Battle matchmaking patch right on schedule. </p><p id=\"ZbITSy\">Whether it’ll actually be <em>the </em>fix is still in question: <a href=\"https://www.theverge.com/2022/1/19/22891256/halo-infinite-multiplayer-big-team-battle-patch-update-problems\">343 thought it’d nailed it on January 19th, too</a>, only to be disappointed to find it wasn’t resolved. But I’ve got to give them huge kudos for being so transparent with players, quickly admitting that it needed more work. <a href=\"https://twitter.com/joestaten/status/1488649778812502018\">And speaking of communication</a>:</p><div id=\"UeAfq9\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hey folks. In November, I said we'd have a <a href=\"https://twitter.com/hashtag/HaloInfinite?src=hash&amp;ref_src=twsrc%5Etfw\">#HaloInfinite</a> update on our Seasonal roadmap, Co-Op, and Forge in January. We need more time to finalize our plans so what we share is something you can rely on. This work is my top priority, and we'll have an update as soon as we can.</p>— Joseph Staten (@joestaten) <a href=\"https://twitter.com/joestaten/status/1488649778812502018?ref_src=twsrc%5Etfw\">February 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"5YeHRO\">I won’t know if Big Team Battle until tonight, when maybe I can convince my buddies to try Big Team Battle once more. They’d sworn it off after one too many tempbans for quitting a match in solidarity with others who got kicked due to the bugs. </p><p id=\"K15jBU\">Here’s the rest of today’s changelog, which only covers multiplayer and should come in at a 1.1GB download:</p><blockquote><p id=\"LuTzOq\">Matchmaking service improvements for Big Team Battle (BTB). Players should find full matches quicker and more consistently. </p><p id=\"iA5eOx\">Scorpion Tanks and Wraiths will appear more frequently on BTB maps. </p><p id=\"WO2jjQ\">Fireteam members in BTB matches will have the selected Fireteam Marker color, but may still start the match in different areas of the map. </p><p id=\"ztcNaU\">Join in progress rules updated to avoid matchmaking into games which are nearly complete.</p><p id=\"hB0K64\">Changes to Oddball in both Ranked and Arena Multiplayer playlists: If the score is tied when a round’s timer runs out, one minute is added back to the timer. If the score is tied at the end of the additional minute, then the round will be declared a tie. The match will end if two separate rounds end in a tie and the victory will go to the team with more rounds won.  </p><p id=\"5yUAl9\">Halo Championship Series (HCS) variant of Free-For-All Slayer added to the Custom Game modes list. </p><p id=\"Wpac4d\">In Custom Games, changes to Free-For-All Slayer, FFA Oddball, Neutral Flag and Tactical Slayer game options update correctly. </p></blockquote><p id=\"Mf41t7\">More Scorpion tanks and flying Wraiths on Big Team Battle maps? Thumbs up from me.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/S2V8oFYmyd_Y2eiZfWMztstj9CI=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23180093/Halo_Infinite_Multiplayer_4_4K_3840x2160_scaled.jpg",
  "description": "Here’s hoping",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}