{
  "title": "Halo Infinite’s campaign co-op won’t arrive with season two in May",
  "url": "https://www.theverge.com/2022/3/6/22964321/halo-infinite-campaign-co-op-season-two-may",
  "date": "2022-03-06T21:26:27.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hBdGsvk-CEiN--4Jnj1MPHxJzQA=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70586718/HaloInfinite_Campaign04_3840x2160_WM.0.png\" />        <figcaption><em>A screenshot of Halo Infinite’s campaign.</em> | Image: 343 Industries</figcaption>    </figure>  <p id=\"1u8Um1\"><em>Halo Infinite</em>’s second season won’t ship with online campaign co-op when it launches on May 3rd, 343 Industries <a href=\"https://www.halowaypoint.com/news/halo-infinite-update-march-2022\">announced</a>. It’s set to launch “later” during season two, with no word on an exact release date.</p><div class=\"c-float-right\"><aside id=\"rDBAEA\"><q>“It’s going to take more time to land a high-quality, full-featured 4-player network co-op experience”</q></aside></div><p id=\"Joqnkc\">Joseph Staten, the head of creative on <em>Halo Infinite</em> says 343 is “aiming to deliver Campaign network co-op later in Season 2,” but won’t be bundling it at launch. It’s unclear whether split-screen and online campaign co-op will release simultaneously, though, as Staten only mentions network co-op as slated for release during season 2.</p><p id=\"jLtYiA\">“It’s going to take more time to land a high-quality, full-featured 4-player network co-op experience in the massive, wide-open world of <em>Halo Infinite</em>,” Staten explains in the post. “We’re also committed to a great 2-player split-screen co-op experience on all Xbox consoles, from the original Xbox One through Xbox Series X — the non-linear, wide-open sections of the Campaign present some big challenges for split-screen that have taken us more time to solve.”</p><p id=\"u1fEUT\">Staten also provides an update on Forge, which is still on track for a season three release. A small group of players is currently testing out the level editor, Staten says, with public flights planned for “later this year.” At launch, season two will bring new arena and Big Team Battle maps called Catalyst and Breaker, respectively. In addition to the much-anticipated return of King of the Hill, season two will also introduce two new game modes: Land Grab and Last Spartan Standing, which 343 describes as “a free-for-all elimination mode.”</p><p id=\"s0wYT6\"><a href=\"https://www.theverge.com/2021/12/6/22820011/halo-infinite-campaign-review-xbox-series-x\"><em>Halo Infinite</em> officially launched</a> last December <a href=\"https://www.theverge.com/2021/8/20/22634448/halo-infinite-co-op-campaign-forge-delay-launch\">without Forge and campaign co-op</a>. 343 Industries initially timed campaign co-op for a season two release, but its launch was pushed back further after <a href=\"https://www.theverge.com/2021/11/19/22791487/halo-infinite-campaign-co-op-season-2-may-2022-forge\">developers decided to extend season one until May</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/xlYxF0uK__Iinfz0L0Jdh_umOTs=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23066591/HaloInfinite_Campaign04_3840x2160_WM.png",
  "description": "Campaign co-op is coming during season two, not with it.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}