{
  "title": "Halo Infinite’s next update will bring back the campaign’s secret ultrapowered gun",
  "url": "https://www.theverge.com/2022/5/13/23071831/halo-infinite-bring-back-tank-gun-update",
  "date": "2022-05-13T23:52:21.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rrLzA5GhaQ4fnkr0nytngjEOz8M=/25x0:295x180/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70867872/apps.39125.14330850369313893.5f5.0.jpg\" />        <figcaption><em>It’s not this sniper rifle, but it can shoot pretty dang far.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"j7N6mi\"><em>Halo Infinite’s</em> glitched and overpowered “tank gun” will be added back to the game’s campaign in a forthcoming update, <a href=\"https://forums.halowaypoint.com/t/halo-infinite-update-may-13/517056\">developer 343 Industries announced Friday</a>.</p><p id=\"7vbNeQ\">The tank gun is an extremely powerful weapon — essentially a portable version of a Scorpion tank’s cannon that has unlimited ammo — and it’s been popular with speedrunners and as a way to make the game a lot easier. But even though you need to know <a href=\"https://www.youtube.com/watch?v=XhzxM7yF21c\">exactly where to look</a> to find the gun (which is invisible, by the way), <em>Halo</em> senior community manager John Junyszek said in April that <a href=\"https://twitter.com/Unyshek/status/1515016006845939715\">343 would be removing the “tank gun glitch”</a> alongside the game’s second season, which launched May 3rd. That decision wasn’t <a href=\"https://www.reddit.com/r/halo/comments/ui6wb5/sodid_i_just_see_343_literally_just_kill_the/\">a very popular one with the community</a>, and it seems there’s been enough blowback that 343 has decided to bring the tank gun back.</p><div id=\"U7sJ6r\"><div ><iframe src=\"https://www.youtube.com/embed/XhzxM7yF21c?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"v1gZNu\">343 will also be adding back some skill jumps to the game’s multiplayer maps. The hard-to-pull-off jumps (<a href=\"https://www.youtube.com/watch?v=eyLSKw3LGWc\">like the “Pizza” jump</a>) could give players an advantage in a heated battle, but it seems they may have done so in a way the developers didn’t intend. </p><p id=\"njgoVh\">“We originally identified these jumps as falling into a couple of categories: Places where the environment was poorly communicating the traversal options of the game world, places that created a combat imbalance, or a combination of both,” Junyszek said on Friday on the <a href=\"https://forums.halowaypoint.com/t/halo-infinite-update-may-13/517056\">Halo Waypoint forums</a>.</p><p id=\"xFzV6s\">343 made some adjustments that removed some skill jumps with the season 2 patch, but the community outcry has been loud enough that 343 is planning to add many of them back in. “Players have made it clear that our analysis of these jumps was off target, and we value the feedback,” Junyszek said.</p><p id=\"YFbdGW\">Junyszek had indicated last week that 343 Industries was considering changes in response to player feedback after the season’s launch. “We’ve seen the feedback around changes that impacted various multiplayer jumps and campaign speedrun strategies,” <a href=\"https://twitter.com/Unyshek/status/1522333217268899843\">Junyszek said on May 5th</a>. “We’re not at the point where we can promise anything yet, but want to be transparent and say that we’re taking the feedback seriously and reviewing options internally.”</p><p id=\"NqAACu\">Halo Infinite head of creative Joseph Staten had acknowledged the complaints as well. “Hey Spartans, this week has been bumpy,” Staten said, <a href=\"https://twitter.com/joestaten/status/1522336606505512960\">quote-tweeting Junyszek</a>. “That definitely wasn’t our goal.”</p><div class=\"c-float-right\"><aside id=\"AG3lv4\"><q>The reversals are just the latest speed bumps for Halo Infinite</q></aside></div><p id=\"TuVn3F\">Junyszek on Friday didn’t provide a specific date for the new update, but it sounds as if it might arrive soon. “Our team has been working hard to get as much as we can in this update as quickly as we can, but there are still a few more steps we need to take before we can release it out in the wild,” he said. “We’ll share more on this update’s specific release timing in the next few days.”</p><p id=\"UtMIvC\">The reversals are just the latest speed bumps for <em>Halo Infinite</em>, which has had <a href=\"https://www.theverge.com/2022/2/3/22916398/halo-infinite-patch-update-fix-big-team-battle-matchmaking\">a rocky go of things</a> since its launch late last year. And we’ll be waiting awhile for some core features to be added to the game; 343 announced <a href=\"https://www.theverge.com/2022/4/22/23038049/halo-infinite-co-op-campaign-mode-forge\">last month</a> that it’s <em>targeting</em> a late August release for online campaign co-op and a September launch for an open beta of Forge mode.</p><aside id=\"6KHwkp\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Clippy is in Halo Infinite\",\"url\":\"https://www.theverge.com/2022/5/4/23056969/clippy-halo-infinite-emblem-charm-unlockable\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/iOoTNy4nYBs6-GQXiZkAipCIz94=/0x6:320x174/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23464803/apps.39125.14330850369313893.5f5.jpg",
  "description": "The tank gun is coming back.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}