{
  "title": "Harley Quinn’s Kite Man is getting his own spinoff",
  "url": "https://www.theverge.com/2022/4/27/23045281/harley-quinn-kite-man-spinoff",
  "date": "2022-04-27T21:21:01.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Oh65nJBf3thN3I37NHEY3XFxld0=/19x0:1573x1036/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70801901/unnamed.0.jpeg\" />        <figcaption>Kite Man and another Gothamite knocking back a few beers at Noonan’s. | HBO Max</figcaption>    </figure>  <p id=\"W1VBcM\">Between his lack of superpowers and proper fighting skills, the Kite Man of <a href=\"https://www.theverge.com/21317621/harley-quinn-review-season-2-dc-universe-superheroes\">HBO Max’s <em>Harley Quinn </em>series</a> is barely <a href=\"https://gizmodo.com/in-defense-of-kite-man-harley-quinns-high-flying-himbo-1844247582\">anyone in Gotham’s idea of a real supervillain</a>, but that isn’t stopping him from starring in his own spinoff show.</p><p id=\"qqK6BF\">Ahead of <em>Harley Quinn</em>’s upcoming third season, HBO Max announced today that Kite Man (Matt Oberg) will soon also feature in <em>Noonan</em>’s, a new 10-episode comedy from Justin Halpern, Patrick Schumacker, and Dean Lorey about Gotham’s seediest dive bar. <em>Noonan</em>’s will focus on Kite Man as he partners up with the villainous <a href=\"https://dc.fandom.com/wiki/Lisa_Snart_(Prime_Earth)\">Golden Glider</a> to make a new name for himself in the time after Poison Ivy dumps him for Harley. In a press release about the show, Warner Bros. Animation executive vice president of alternative programming Peter Girardi intoned that while Kite Man will be one viewers’ introduction to <em>Noonan</em>’s, he won’t be the only classic DC character — heroic or villainous — to appear.</p><p id=\"QMEt0m\">“‘<em>Harley Quinn</em>’ unlocked a world of hilarious possibilities with the iconic super heroes and super-villains of the DC Universe,” Peter Girardi said. “Exploring this world further with our partners at HBO Max and DC is going to be a lot of fun. Plus, after getting dumped by Poison Ivy, the least we could do was give Kite Man his own show.”</p><p id=\"pdMvEw\">There’s no word currently on when <em>Noonan</em>’s is set to begin production or when the series might premiere, but <em>Harley Quinn</em>’s third season is slated to air sometime this summer.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jiB-oP0JVVKHB7E2joKCQqVMcYE=/0x102:1591x935/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23420994/unnamed.jpeg",
  "description": "Kite Man’s rebounding with a new animated series.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}