{
  "title": "HBO Max and Discovery Plus will merge into one app",
  "url": "https://www.theverge.com/2022/3/14/22976876/hbo-max-discovery-plus-merge-app-confirmed",
  "date": "2022-03-14T15:22:04.000Z",
  "author": "Alex Cranz",
  "content": "      <figure>      <img alt=\"The HBO Max logo against a dark background with white circles around it.\" src=\"https://cdn.vox-cdn.com/thumbor/XPKdRmQg6j_bnVfUDYgWDTGOFRM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70620296/acastro_200602_1777_HBOMax_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"GHhiIm\">It really shouldn’t surprise anyone that when the merger of Discovery and WarnerMedia closes, the two companies’ streaming apps will experience a merger of their own. <a href=\"https://variety.com/2022/tv/news/hbo-max-discovery-plus-combined-streaming-service-bundle-1235204060/\">As noted by <em>Variety</em></a>, Discovery CFO Gunnar Wiedenfels confirmed the move when speaking at the Deutsche Bank 30th Annual Media, Internet, &amp; Telecom Conference (that’s a mouthful) on Monday.</p><p id=\"oZjhWW\">This was our first real glimpse of what this new company’s content plan looks like. Wiedenfels gave a very loose roadmap for the streaming app situation post-merger. Before the two apps merge into one mega app, there will be some bundling options. (Think how Disney often bundles Disney Plus, Hulu, and ESPN.) Then, at some point, the two will be combined into one massive and potentially unwieldy beast of a product.</p><p id=\"uqKAoI\">I say unwieldy because despite being a service I watch every dang day, HBO Max is buggy as hell. Frequently, at least on the Apple TV, you have to restart the app if you try to navigate directly to a show from Apple’s Up Next feature. Other times, just choosing a show to watch in the app directly will lead to a restart or crash. And if you want to watch something as soon as it airs, good luck. During the <em>Euphoria</em> premiere a few weeks ago, <a href=\"https://variety.com/2022/digital/news/hbo-max-crashes-euphoria-season-2-finale-1235191382/\">the app repeatedly crashed for many users</a> trying to find out how mad Cassie was at her sister for her autobiographical stage musical. (Spoilers, she was super mad.)</p><div class=\"c-float-right\"><aside id=\"nQe5o7\"><q>HBO Max is buggy as hell</q></aside></div><p id=\"hzf3Uw\">HBO had one of the first streaming apps to simulcast streams with over the air content, and you would think it would have figured out how to handle the mad rush to watch a season finale after it broke during multiple premieres and the finales of <em>Game of Thrones</em>, <em>Mare of Easttown</em>, and others. But no, in 2022, HBO Max still crashes if more than 12 people decide to tune in at the same time. Okay, it probably takes considerably more than 12 people trying to watch a stream at once to crash it — but you get the point. This is a technological cockup that HBO should have resolved years ago.</p><p id=\"U8pExr\">It’s unclear which part of the new company will take ownership of designing this new combined content app. It’s also unclear how much the new app will cost. Discovery Plus and HBO Max both currently maintain ad-supported and ad-free tiers, with Discovery Plus’ going for $4.99 a month and $6.99 a month, and HBO Max’s going for $9.99 a month and $14.99 a month. If the new company opts to mash prices together as it mashes apps and content, then that would mean a service going for approximately $14.99 and $21.99 a month. Netflix, for reference, ranges in price from $9.99 to $19.99 a month depending on the number of screens and quality of streams. Netflix also has the best-looking app in the streaming business with an algorithm that suggests content one would actually want to watch. The DiscoHBO app will need more than the next season of <em>Euphoria</em> if it wants to charge more than $20.</p><p id=\"mZJrsb\">But I’m not sure the new company actually understands this. Wiedenfels’ presentation was oriented largely around content — not the quality of the app. “The combination could not make more sense than what we’re doing here. We have HBO Max, with a more premium, male-skewing positioning, and then you’ve got the female-positioning on the Discovery side,” he said. He went on to express enthusiastic excitement at seeing the combined metrics because “in theory, the acquisition power of HBO Max, combined with the retention power of the Discovery content I think is going to make for a blowout DTC product.”</p><p id=\"Tw5mBk\">Yes, the merging of content will be super appealing, but not if people can’t watch it because the app is buggy. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IJzXsmciYYDeQsZ_q-uAm8QDmuU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20015310/acastro_200602_1777_HBOMax_0003.0.jpg",
  "description": "There’s no word if the new app will be less buggy.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}