{
  "title": "HBO Max will soon begin streaming US soccer matches",
  "url": "https://www.theverge.com/2022/3/2/22958781/hbo-max-us-soccer-federation-deal",
  "date": "2022-03-02T21:30:46.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"2022 SheBelieves Cup - Iceland v United States\" src=\"https://cdn.vox-cdn.com/thumbor/bCCp2AoKd5LKuqKzew0s3lq3YfI=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70571687/1372469137.0.jpg\" />        <figcaption>Photo by Erin Chang/ISI Photos/Getty Images</figcaption>    </figure>  <p id=\"O0xn1k\">HBO Max is adding more sports coverage to its programming slate. Turner Sports, an arm of WarnerMedia, has reached a deal with the US Soccer Federation to air matches exclusively on TNT, TBS, and HBO Max.</p><p id=\"zcAbM1\">As part of the eight-year agreement that will begin in 2023, HBO Max will stream more than 20 matches for the men’s and women’s national teams each year, <a href=\"https://pressroom.warnermedia.com/us/media-release/turner-sports-and-united-states-soccer-federation-reach-multimedia-rights-agreement\">WarnerMedia announced</a> Tuesday. WarnerMedia-owned linear channels TNT and TBS will simultaneously air roughly half of those, while the other half will stream exclusively on HBO Max.</p><p id=\"xC4O6l\">Turner Sports and its division Bleacher Report will have exclusive rights to live coverage of the matches as part of the agreement. Additionally, the deal positions Turner Sports as the exclusive English-language home of various events for the women’s and men’s national soccer teams in the US, including US National Team World Cup qualifiers, the SheBelieves Cup, and National Team friendlies, among others.</p><p id=\"HNL2pR\">Sports programming is not new to the streamer — WarnerMedia <a href=\"https://www.theverge.com/2021/4/27/22405964/hbo-max-nhl-live-hockey-turner-sports-warnermedia\">inked a deal</a> with the National Hockey League last year to bring coverage to HBO Max — but it builds on the company’s commitment to diversifying its portfolio and better positions HBO Max to more directly compete with services in the sports space, including Peacock, Prime Video, and Paramount Plus. It also makes HBO Max a service just as much for sports fans as it is for film and TV enthusiasts, where it needs to improve to take on Netflix (which continues to avoid live sports <a href=\"https://www.theverge.com/2022/1/20/22893419/netflix-price-increase-q1-2022-earnings\">even as its prices climb ever higher</a>).</p><p id=\"Ll4oMx\">“This is a significant milestone for Turner Sports and WarnerMedia, further demonstrating our commitment to the distribution of premium live sports content on HBO Max, while simultaneously fueling our leading entertainment networks, digital and social assets,” Turner Sports president Lenny Daniels said in a statement.</p><p id=\"nz8tv3\">Daniels added that the deal further allows the company to engage with the teams’ “avid, young and diverse fan bases through all of our Turner Sports and Bleacher Report platforms.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2EgrhccVAUWf-iSVAuZq1Y2Ca8g=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23283772/1372469137.jpg",
  "description": "HBO Max will stream more than 20 matches each year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}