{
  "title": "HBO Max is getting a better Apple TV app, finally",
  "url": "https://www.theverge.com/2022/4/7/23015321/hbo-max-new-app-apple-tv-tvos",
  "date": "2022-04-07T19:21:36.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"The HBO Max logo against a dark background with white circles around it.\" src=\"https://cdn.vox-cdn.com/thumbor/eG3uEGdTYwMNPwvQT3pB5rLvygQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70722959/acastro_200602_1777_HBOMax_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"KZvxaO\">HBO Max is promising a long-overdue fix to its busted tvOS app.</p><p id=\"2mYa3v\">Apple TV users know that HBO Max’s streaming app is subject to frequent crashing and glitches and is often overloaded during important premiere dates. In an overhaul that will continue through next week, the company billed the new app as completely redesigned with some useful new features (although <em>Variety</em>, which <a href=\"https://variety.com/2022/digital/news/hbo-max-apple-tv-update-1235226901/\">earlier reported</a> the news, said the two apps were not too visually dissimilar).</p><p id=\"m6jGy2\">According to the company, the new app will have easier sign-in and sign-up protocols, as well as an “enhanced” homepage with a scrollable hero. The company also says the app will have an editable “My Stuff” experience so that users can better manage their Continue Watching and My List categories. Lastly, the company promises better “binge mode” experiences, which <em>Variety</em> said will include skipping credits.</p><p id=\"9WrEgg\">The new app is pegged to WarnerMedia’s 2020 acquisition of You.i, which specializes in cross-platform development tools. WarnerMedia described the acquisition as “a key piece to our growth strategy,” noting that the following are already on the new tech stack: Roku, Playstation, Android, Samsung, LG, Vizio, Vodafone, Comcast, and Cox.</p><p id=\"I2Cvys\">HBO Max said the new Apple TV app will roll out “slowly” through this week and into next week. And not a moment too soon.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IJzXsmciYYDeQsZ_q-uAm8QDmuU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20015310/acastro_200602_1777_HBOMax_0003.0.jpg",
  "description": "And not a moment too soon.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}