{
  "title": "Hear me out: browser tabs in music player apps ",
  "url": "https://www.theverge.com/2022/2/4/22918410/browser-tabs-music-player-apps",
  "date": "2022-02-04T21:44:53.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"Spotify Stock\" src=\"https://cdn.vox-cdn.com/thumbor/lGn6wgHdoXNRGjubu11czs5MszU=/0x0:1820x1213/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70473061/acastro_180213_1777_0004.0.jpg\" />        <figcaption>Alex Castro / The Verge</figcaption>    </figure>  <p id=\"QZhi9T\">All right, listen. This is not for those of you with Dewey Decimal mental filing systems or expertly curated music playlists that easily identify the music contained therein. But hear me out: we need music browser tabs in our music player apps.</p><p id=\"YdEG9N\">I can’t, unfortunately, take credit for this proposed — and tremendously useful! — addition to our music player interfaces. It was actually <em>The Verge</em>’s deputy editor Dan Seifert who <a href=\"https://twitter.com/dcseifert/status/1489679435959873543\">first tweeted</a> the idea, which I enthusiastically threw my support behind. We’re not the only two nerds who think this would be a handy feature, either. Wearables reviewer Victoria Song chimed in that she, too, would like a tabs-like feature in her music players. (A good and correct opinion.)</p><div id=\"pzALU7\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">i need browser tabs in my music player app so i can remember what i want to listen to after i’m done listening to what i’m currently listening to</p>— dan seifert (@dcseifert) <a href=\"https://twitter.com/dcseifert/status/1489679435959873543?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"OzoITc\">A problem with modern music apps like Spotify and Apple Music is that they’re already jumbled from the jump. The second you open one, you’re bombarded with promotional columns, “made for you” playlists you may not even use, new releases, and stuff you’ve recently listened to and may never want to hear again. It makes it that much harder to remember where you left off yesterday when you open the app.</p><p id=\"M4HdyC\">Now, we’re not talking here about tabs in a browser window — that’s chaos. (Can you imagine having 15 Spotify tabs open in Chrome while trying to do the 200 other things you’re already juggling? Immediately no.) The tabs we’re proposing would be integrated into device apps themselves, meaning that, when you open Spotify on your computer, you’d be able to easily tab through music you’ve been meaning to listen to.</p><p id=\"PmfZqr\">Before anyone tries to argue that this already exists with queues, it’s not the same. Adding a song or songs to a “Liked” playlist isn’t the same as isolating a discography or artist or even a single release. And with playlists, arguably the thing closest to a tabs function, they can become quickly cluttered without a pristine filing system. (Not to mention — who wants to make a playlist for a <em>single song</em>?) I have no idea what’s included in my own playlist titled “Daily Mix 1” (something I must have saved from one of Spotify’s algorithmic playlists ages ago), just as playlists I titled “Perfect” and “Good” have been collecting dust for, I presume, years.</p><p id=\"TTftUt\">As Dan points out, another problem with the queues argument is that they will play music in the order you add to them, whereas with tabs, you’d have the ability to choose what you’d want to listen to when you’re ready.</p><div class=\"c-float-right\"><aside id=\"7YuA2n\"><q>Tabs are ideal for listening to that new album when you have time to later on</q></aside></div><p id=\"TAUIyk\">What tabs would be particularly useful for is new music discovery, like an album you’ve been wanting to get around to hearing but haven’t yet had the time. I bump into this problem quite a bit. Adding a new album to my “Liked” songs on Spotify shuffles it in with all of my favorite stuff, and decluttering that playlist later is a hassle. Making a new album a playlist almost assures that it’ll be forgotten about. My decrepit, goldfish memory doesn’t have the space to remember to return to a playlist of an album two weeks later.</p><p id=\"icDHeo\">As my colleague Victoria notes, she’s always “forgetting what I’m supposed to listen to next.” You know what would help with that? Tabs. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4RBkpEcbeZBFBM3w6g6bVEtKbUg=/0x131:1820x1084/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19556817/acastro_180213_1777_0004.jpg",
  "description": "Keeping track of stuff is a nuisance — here’s how we fix it.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}