{
  "title": "Heardle is like Wordle for pop music",
  "url": "https://www.theverge.com/2022/3/4/22961799/heardle-wordle-inspired-pop-music-guessing-game",
  "date": "2022-03-04T20:11:12.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4DPbVhLRvVvjxUtZP1IX7qX-sT8=/197x0:1994x1198/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70580410/Screen_Shot_2022_03_04_at_09.49.04.0.png\" />        <figcaption><em>It’s hard to guess a song in the first few seconds.</em></figcaption>    </figure>  <p id=\"1zBNnB\">If you’ve finished your Wordle, <a href=\"https://worldle.teuteuf.fr\">Worldle</a>, and <a href=\"https://octordle.com\">Octordle</a> and have more room in your heart for <a href=\"https://www.theverge.com/tldr/2022/1/11/22877996/wordle-spoofs-alternatives-letterle-sweardle-queerdle\">more Wordle-alikes</a>, may I suggest trying out <a href=\"https://www.heardle.app\">Heardle.app</a>? It’s a guessing game where you’re given progressively longer snippets of a pop song and get six tries to figure out what it is. It’s a fun twist on the Wordle format, especially for those of us who are significantly more interested in music than <a href=\"https://www.theverge.com/tldr/2022/2/14/22933007/wordle-new-york-times-harder-words-debunk-guesses\">words like</a> “knoll” or “vivid.”</p><p id=\"HJt2ai\">An interesting twist with Heardle is that it gives you a skip button. Mechanically, it makes sense — with Wordle, you’re only going to get closer to the answer by guessing a word and seeing what letters are or aren’t in the correct answer. But when you’re guessing a song, hearing a new snippet will give you more information regardless of whether you’ve made a guess. </p><p id=\"AfGyes\">Heardle also, of course, has a similar sharing feature that lets you copy a series of emoji to your clipboard so you can tell people how quickly you guessed the song.</p><div id=\"XfrNcl\"><blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Heardle?src=hash&amp;ref_src=twsrc%5Etfw\">#Heardle</a> #7<br><br>   ⬜️⬜️⬜️⬜️<a href=\"https://t.co/XtoYi10jrj\">https://t.co/XtoYi10jrj</a></p>— Mitchell (@strawberrywell) <a href=\"https://twitter.com/strawberrywell/status/1499815622405865476?ref_src=twsrc%5Etfw\">March 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"ZRDCqt\">Heardle’s about screen says that it pulls songs from “a list of the most streamed songs in the past decade,” which hopefully means you won’t be stuck trying to identify <a href=\"https://www.youtube.com/watch?v=pXda95Vlbjc\">some song that only 1,000 people have heard</a>. That also makes it a lot easier to guess — without giving <em>too </em>many spoilers, I thought that today’s answer might have been some sort of ambient soundtrack song after hearing the first few seconds. But once I realized it was looking for a pop song, I found the answer to be pretty obvious.</p><p id=\"n0Yf7v\">The about screen also says that Heardle is pulling the songs from Soundcloud, which is good to hear — while Wordle <a href=\"https://www.theverge.com/2022/2/1/22912711/wordle-web-save-download-webpage-local-personal\">has all its answers stored in a text file</a>, doing something like that with clips of pop songs is a good way to get DMCA’d off the internet real quick. And I’d hate for that to happen because I think Heardle might be the game I end up checking back in with every day. I’ve always suspected I’d be good at game shows like <em>Name that Tune</em> or <em>Beat Shazam</em>, and Heardle is a way to prove it (or privately embarrass myself).</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3IKI8YiIQdQQneFp5t1EdLbGPAQ=/0x26:2190x1173/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23288923/Screen_Shot_2022_03_04_at_09.49.04.png",
  "description": "For those more interested in Britney than the dictionary",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}