{
  "title": "Her Majesty’s Treasury is working on a new kind of mint: NFTs",
  "url": "https://www.theverge.com/2022/4/4/23010457/uk-royal-mint-nft-her-majestys-treasury-crypto-regulation-legislation",
  "date": "2022-04-04T22:16:34.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mGJW4xZW_3DswznLagXYw8WeUCk=/0x0:1508x1005/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70710059/FPgAoYsXMAE8laZ.0.jpeg\" />        <figcaption><em>It’s unclear what the exact plan for the Royal Mint NFT is.</em> | Image: Her Majesty’s Treasury</figcaption>    </figure>  <p id=\"hkXJaj\">The United Kingdom’s treasury minister has tasked the Royal Mint with creating an NFT as “an emblem of the forward-looking approach” Her Majesty’s Treasury says it’ll take toward cryptocurrencies and blockchains. The project was announced <a href=\"https://twitter.com/hmtreasury/status/1510966085054451714\">in a speech</a> by John Glen, the Economic Secretary to the Treasury, who said at a summit that more details on the mint’s mint would be coming “very soon.”</p><p id=\"NFmVVh\">While countries like Ukraine have <a href=\"https://www.theverge.com/2022/3/25/22996168/ukraine-ministry-digital-transformation-nft-crypto-drop-fundraising-war-timeline\">issued NFTs before</a>, this particular announcement feels a bit different — for one, it’s coming from one of the highest levels of the British government. It’s also supposed to be carried out by the entity in charge of printing the country’s money.</p><div id=\"MZ6RxB\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Chancellor <a href=\"https://twitter.com/RishiSunak?ref_src=twsrc%5Etfw\">@RishiSunak</a> has asked <a href=\"https://twitter.com/RoyalMintUK?ref_src=twsrc%5Etfw\">@RoyalMintUK</a> to create an NFT to be issued by the summer.<br><br>This decision shows the the forward-looking approach we are determined to take towards cryptoassets in the UK. <a href=\"https://t.co/cd0tiailBK\">pic.twitter.com/cd0tiailBK</a></p>— HM Treasury (@hmtreasury) <a href=\"https://twitter.com/hmtreasury/status/1510971092072079360?ref_src=twsrc%5Etfw\">April 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"QDnYV6\">That’s not to say that UK citizens should expect the government to replace the pound with HerMajesty’sCoin anytime soon. The announcement’s complete lack of details makes it easy to see it as just a PR exercise — a way for the treasury to show that it really is serious about making the UK a hotbed of financial innovation and getting “in on the ground floor” with crypto (by, you know, announcing an NFT over a year after Taco Bell <a href=\"https://www.theverge.com/2021/3/8/22319868/taco-bell-nfts-gif-tacos-sell\">came out with its own crypto token</a>). </p><aside id=\"r0UkXi\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"NFTs, explained\",\"url\":\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\"}]}'></div></aside><p id=\"Kbc4h8\">To be fair, it seems like the UK government is taking crypto seriously. Glen announced that the treasury is asking a legal task force to consider the “legal status of decentralized autonomous organizations” (or <a href=\"https://www.theverge.com/2022/3/25/22994795/apecoin-yuga-labs-sec-regulation-utility-token\">DAOs</a>). He also rounds up a lot of what the government is currently working on regarding crypto — <a href=\"https://twitter.com/hmtreasury/status/1510966085054451714\">the talk</a> is 21 minutes long (though there’s a good amount of fluff), and you can watch it in full below. </p><p id=\"GVHRO5\"><em>Reuters</em> does a good job of <a href=\"https://www.reuters.com/business/finance/uk-says-it-will-regulate-stable-coin-payments-2022-04-04/\">breaking down the major components</a>, but as a TL;DR: the UK’s treasury is <a href=\"https://www.gov.uk/government/news/government-sets-out-plan-to-make-uk-a-global-cryptoasset-technology-hub\">working on regulating some stablecoins</a> (cryptocurrencies whose value is, <a href=\"https://www.theverge.com/22620464/tether-backing-cryptocurrency-stablecoin\">in theory</a>, largely tied to the price of fiat currencies), will be having a lot of meetings around crypto regulation and is still working on its “regulatory sandbox” to let crypto companies “test products and services in a controlled environment.”</p><div id=\"6bIMGG\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Watch live as Economic Secretary to the Treasury <a href=\"https://twitter.com/JohnGlenUK?ref_src=twsrc%5Etfw\">@JohnGlenUK</a> tells the <a href=\"https://twitter.com/InnFin?ref_src=twsrc%5Etfw\">@InnFin</a> Global Finance Summit the steps we are taking to position the UK as a global hub for cryptoasset technology. <a href=\"https://t.co/qJMXHpK01p\">https://t.co/qJMXHpK01p</a></p>— HM Treasury (@hmtreasury) <a href=\"https://twitter.com/hmtreasury/status/1510966085054451714?ref_src=twsrc%5Etfw\">April 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"Nlp2kY\">As for the treasury’s crypto project, it’s hard to know what to expect. Will it be a collectible that crypto enthusiasts across the UK will want to have in their wallets? Or will it just be a single NFT (the announcement tweet somewhat implies that there’ll be only one) stored on a hardware wallet locked up in Buckingham Palace or the Tower of London? </p><p id=\"N913SH\">Honestly, that’s probably not the important part. While NFTs are buzzy (or at least were at one point), crypto’s future will likely be shaped more by how countries with a big stake in global finance choose to regulate them rather than any particular project — even if that project is from the Royal Mint. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/038xZ84sYPgzQDI1K9EBq4A-ylg=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23367111/FPgAoYsXMAE8laZ.jpeg",
  "description": "The UK wants to be in \"on the ground floor\" with crypto.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}