{
  "title": "Here’s what you can expect from GTAV on PS5 and Xbox Series X",
  "url": "https://www.theverge.com/2022/3/4/22960309/grand-theft-auto-5-ps5-xbox-series-x-s-update-graphics-online",
  "date": "2022-03-04T14:59:54.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ioyo4qzo4593CMYDb7zbomnjnu4=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70578732/Grand_Theft_Auto_V___3_4_2022___Image_2.0.jpg\" />    </figure>  <p id=\"nNXm81\">The PS5 and Xbox Series X / S versions of <em>Grand Theft Auto V</em> will launch on Tuesday, March 15th, as will a separate version of <em>GTA Online</em> that — for the first time — won’t require the base game to play. </p><p id=\"6re2xn\">Rockstar Games shed some light on <a href=\"https://www.theverge.com/2022/2/4/22917783/rocstar-games-gta6-active-development-gta5-ps5-xbox-series-x-patch\">what’s coming a few weeks ago when it teased that development on <em>GTAVI </em>was underway</a>. But today, it’s providing <a href=\"https://www.rockstargames.com/newswire/article/172872k8a375k8/gtav-and-gta-online-coming-march-15-for-playstation-5-and-xbox-series\">some more details</a> of what you can expect from the updated games and how character migration will work if you’re a fervent <em>GTA Online</em> player.</p><p id=\"5vBOTv\">As for <em>GTAV</em>, there will be graphical touchups throughout, and it will offer three graphics settings: a 4K fidelity mode with ray tracing, a comparatively stripped-back, upscaled 4K (1080p on Series S) performance mode that runs faster at 60 frames per second (fps), as well as a “performance RT” mode on PS5 and Series X that targets 60 fps but without removing ray tracing. Rockstar says that loading times are faster, water reflections have been improved, and there’s a higher traffic density — you know, typical new-gen console stuff. The game also features improved anti-aliasing, “highly detailed” explosions, and more.</p><p id=\"J8ftKV\">One unexpected bonus is that some vehicles have higher top speeds on newer consoles, thanks to their ability to stream in the world’s data faster than previous consoles. On PS5, <em>GTAV </em>will take advantage of the DualSense controller’s haptics, as well as its adaptive triggers. Rockstar says that haptics will let you feel things like weather effects, directional damage, rough road surfaces, and explosions.</p><div id=\"XzKHF6\"><div data-anthem-component=\"gallery:11078019\"></div></div><p id=\"p5wnD2\">Now that <em>GTA Online</em> will be separate from <em>GTAV</em> on Xbox and PlayStation, Rockstar has apparently put in some extra work to make onboarding new players faster than before. The new Career Builder feature will give you $4 million of in-game currency to get you started. The online mode also has a “newly designed” intro and tutorial for new players. And from the new main menu, you can easily jump directly into various game modes. There will also be new vehicles, as well as a mode that lets you test drive pricey cars for free.</p><p id=\"Lj1S1e\">The developer is also hoping to welcome back lapsed players with the ability to migrate your <em>GTAV </em>story progression, as well as your <em>GTA Online</em> character, to these new versions. (PC players will be excluded from migrating their characters to the new versions.) Its new migration tool supports cross-gen, cross-platform platforms, meaning it will let Xbox players transfer to PlayStation and vice versa, whether you’re on current-gen or last-gen consoles. </p><p id=\"Hpl6fn\">It’s worth noting, though, that your purchased <em>GTA Online</em> currency can only be transferred from PS4 to PS5 or from Xbox One to Xbox Series X / S. However, any in-game currency you’ve earned through the game itself will transfer, regardless of platform.</p><p id=\"wfg0c2\">PS5 players will be able to download and play <em>GTA Online</em> free for the first three months from launch (so, three months from March 15th). As for pricing outside of that window of time or for Xbox players from day one, Rockstar hasn’t nailed that down yet. It also hasn’t disclosed the cost for the new <em>GTAV </em>version or if there’s an upgrade path for previous owners of the game (of which there are many, many of us).</p><p id=\"JwZt5F\">This new port to the “Gen 9” consoles, as they’re sometimes referred to, is coincidentally launching in the ninth year of <em>Grand Theft Auto V</em>’s existence. The game’s new coat of polish for the PS5 and Xbox Series X / S consoles should give it a little more life, and perhaps, it’ll be just enough to keep fans busy until we hear more about <em>Grand Theft Auto 6</em>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iNSaPvkI5SMTyI8bPXz4QOk5E5g=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23287880/Grand_Theft_Auto_V___3_4_2022___Image_2.jpg",
  "description": "Coming out on March 15th",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}