{
  "title": "Here are some great games to sideload onto your Playdate",
  "url": "https://www.theverge.com/2022/4/26/23042607/playdate-best-games-sideloading",
  "date": "2022-04-26T16:08:05.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NaO5siahhKcIjv9vD87dyovvYdU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70795247/vpavic_220415_5149_0101.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"6goh5x\">If you’ve managed to get your hands on a Playdate <a href=\"https://www.theverge.com/2022/4/18/22955640/panic-playdate-handheld-ship-date-launch\">or have one on the way</a>, <a href=\"https://www.theverge.com/2022/4/26/23041825/panic-playdate-season-one-two-release-model\">you’re guaranteed a full “season” of 24 games</a> delivered to your device over the span of 12 weeks. And there are some great ones included — <a href=\"https://www.theverge.com/23025390/playdate-handheld-portable-gaming-console-review\">check out my full Playdate review for a round-up of my favorites</a>. But there’s also more to the device than just those games, thanks to sideloading. Playdate maker Panic has made it very easy to get games onto your device. You can check out the process <a href=\"https://help.play.date/games/sideloading/\">here</a>, but essentially, you just need to download a file — usually from somewhere like <a href=\"http://Itch.io\">Itch.io</a> — and then either load it onto your device via USB or load them wirelessly by adding them to your account on the Playdate website.</p><p id=\"tJYHfQ\">It’s a pretty painless process, and there are already some interesting, weird, and fun experiences available to try out. Here are a few great games and apps to get you started.</p><div id=\"HWabWj\"><div ><iframe src=\"https://www.youtube.com/embed/jjwEr3sQCzI?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h3 id=\"wdSG9H\"><a href=\"https://rngpartygames.itch.io/bloom\"><em>Bloom</em></a></h3><h4 id=\"1Xmb4T\">By RNG Party Games</h4><p id=\"uZ2qSe\"><em>Bloom</em> might actually be my favorite Playdate game so far. It’s a bit like if <em>Stardew Valley</em> was also a slice of life drama told primarily through text messages. You play as Midori, who is starting up a new flower business via a rooftop garden instead of going to school like her parents think. One half of the game involves growing and selling flowers, steadily earning money to expand your space and purchase better seeds. The other half has you stuck to your phone, replying to messages from your friends, partner, landlord, and (gulp) parents. The writing feels very real, to the point that I dreaded waiting on a response from Midori’s dad, but it paints a vivid picture of the challenges of starting a new life.<em> Bloom</em> also takes place in real time, making it the kind of game you’ll check in on a few times a day rather than something to binge.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q6WJ4uH-c9ck0PP7cadhaKxsEEg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417062/t6P8XV.png\">      <figcaption><em>Sketch, Share, Solve.</em></figcaption>  </figure><h3 id=\"5wdjHG\"><a href=\"https://r-d-k.itch.io/sketch-share-solve\"><em>Sketch, Share, Solve</em></a></h3><h4 id=\"r7iisC\">By RDK</h4><p id=\"4W9N8k\"><em>Sketch, Share, Solve</em> is a fairly straightforward collection of nonogram puzzles, which involve filling in space on a grid to create an image. (Some people might be more familiar <a href=\"https://www.theverge.com/2019/4/29/18522564/picross-s3-review-puzzle-games-nintendo-switch\">with them under the <em>Picross</em> name</a>.) This iteration doesn’t do anything dramatically different with the formula, but it turns out that style of logic puzzle is a great fit for the Playdate’s low-fi, black-and-white screen. It feels like solving sudoku or crossword puzzles in a newspaper, only without the pen. <em>Sketch, Share, Solve </em>comes with 99 puzzles but also has a built-in editor so you can make your own and share them with other players, so its future may depend on the kind of community that forms around it.</p><div id=\"uxttWh\"><div ><iframe src=\"https://www.youtube.com/embed/F7Gc6cTXloE?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h3 id=\"y7bjyn\"><a href=\"https://kamibox.itch.io/a-joke-thats-worth-099\"><em>A Joke That’s Worth $0.99</em></a></h3><h4 id=\"Fyl2L2\">By Kamibox</h4><p id=\"jd46y6\">A new platform means novelty games, and none match the Playdate’s vibe better than the aptly named <em>A Joke That’s Worth $0.99</em>. In the game, you use the crank to help keep a little dude with a bouncy butt in the air for as long as possible while also collecting stars that appear. Meanwhile, an incredibly catchy / obnoxious theme song blares in the background. But with each new star, you get the next line in what I presume is a funny joke, but I haven’t gotten far enough to tell yet. That’s because this game is <a href=\"https://www.theverge.com/2014/2/11/5402688/flappy-bird-mobile-game-rise-and-fall\"><em>Flappy Bird</em></a>-level hard, and so far, I’ve only managed to hear four lines of the joke. But it’s fun enough that I just keep bouncing and failing.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/85hPOsX_s4KBqYjn9V10EGp1Ro4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417137/4OF_Y_.gif\">      <figcaption><em>Tetris for Playdate.</em></figcaption>  </figure></div><h3 id=\"TSkWiU\"><a href=\"https://thacuber.itch.io/tetris-for-playdate\"><em>Tetris for Playdate</em></a></h3><h4 id=\"GgmSX0\">By ThaCuber</h4><p id=\"CSBohw\">In terms of hardware, <a href=\"https://www.theverge.com/22587172/playdate-hands-on-preview\">the Playdate is a lot like the original Game Boy if it came from a different dimension</a>, from the monochrome screen to the simple D-pad and two face buttons for controls. And a Game Boy isn’t complete without <em>Tetris</em>. This version is a barebones version of the iconic block-falling puzzle game — but it gets the job done. There aren’t any extra features, but it plays well and even gives you the option to rotate blocks using the crank. (I don’t recommend this, but it’s fun to try.)</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KAAK-31Vuuhm4iP2XBNzponRDa4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417176/SEIest.png\">      <figcaption><em>Mash Gadget.</em></figcaption>  </figure></div><h3 id=\"6IUnn4\"><a href=\"https://bipedaldog.itch.io/mgd\"><em>Mash Gadget</em></a></h3><h4 id=\"vHTmPl\">By Bipedal Dog</h4><p id=\"WlPq9l\">With its extra clicky buttons and built-in crank, the Playdate is a gaming handheld that doubles as a great fidget device, the kind of thing to keep your hands busy during a long meeting or phone call. <em>Mash Gadget</em> isn’t exactly a game, but it adds some game-like elements to your fidgeting. There’s a mode that tasks you with mashing the A button as many times as possible in 10 seconds and a safecracking mini-game where you rotate the crank in search of three numbers. The modes are basic but strangely satisfying, and they remind me of something you’d find on an old digital watch from the ’90s.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_J8RQY0NkigApWF6b6T7nlJhF5o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417249/zkE2UH.gif\">      <figcaption><em>Pictode Collection.</em></figcaption>  </figure><h3 id=\"gILtve\"><a href=\"https://visualother.itch.io/pictode-collection\"><em>Pictode Collection</em></a></h3><h4 id=\"sewqVb\">By Visual Other</h4><p id=\"N55HGw\"><em>Pictode Collection</em> is a bundle of five strange puzzle games that fit the Playdate’s retro aesthetic quite well. The five games are all pretty different — one is a sliding block puzzle, another is a digital take on pachinko, and my favorite is an odd Rubik’s Cube spread out flat — but they all utilize the same cryptic symbols for various purposes. The most interesting thing about the collection might be that it doesn’t explain anything; you have to figure out how each of the puzzles works before you can start solving them. Oh, and it has some excellent chiptune music that almost necessitates a pair of headphones.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ar6w3I6D5wYq8Ij7i_vepcOQZlc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23396650/vpavic_220415_5149_0101.jpg",
  "description": "A few places to get started",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}