{
  "title": "Here’s why Google highlighting KakaoTalk on Wear OS 3 matters",
  "url": "https://www.theverge.com/2022/5/12/23067720/google-io-kakaotalk-wear-os-samsung",
  "date": "2022-05-12T15:28:38.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CphlnEr6cfL0UDNoQPDh8OpLVN8=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861301/2022_5_11_google_io_702_11_10_22.0.jpg\" />        <figcaption><em>There’s a reason why KakaoTalk is one of the featured apps on highlighting Wear OS’ expanded reach..</em> | Screenshot: The Verge</figcaption>    </figure>  <p id=\"IyTTHr\">During yesterday's Google I/O keynote, there was a moment that stood out to me that may have been lost on a lot of folks. While giving examples of new apps featured on Wear OS 3, Google took the time to call out KakaoTalk. I won’t lie. I stood up, pointed my finger at my computer monitor, and screeched some version of “AHA! I was <em>right!”</em></p><p id=\"sqOEW0\">If you already know what KakaoTalk is, you likely are Korean, Korean-American, have a ton of Korean friends, love K-pop and K-dramas, or have lived / are living in Korea. You can see where I’m going here. KakaoTalk is the number one messaging app in Korea. The easiest way I can describe it is that KakaoTalk is Korea’s version of WeChat or WhatsApp. According to <a href=\"https://www.statista.com/statistics/746249/south-korea-kakaotalk-monthly-active-users/#:~:text=During%20the%20fourth%20quarter%20of,million%20in%20the%20previous%20quarter.\">Statista</a>, more than 47 million South Koreans were active monthly users on the app in Q4 2021. The current population of South Korea is roughly 51 million. </p><p id=\"saTOvV\">In my family, only the iPhone users actually text each other. The rest of the time, it’s KakaoTalk. That’s where the family group chat is. It’s how I call and text my aunt. If I call my aunt the “normal” way, she is much less likely to pick up than if I call her over KakaoTalk. When my parents were alive, it was the main app we used to communicate, send pictures, and share videos. I sometimes hear the KakaoTalk ringtone in my dreams. </p>  <figure class=\"e-image\">        <img alt=\"Most of the pre-installed apps on the Galaxy Watch 4 come from Samsung.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YrznZlqdrp50UtpFcuoRBVtmXaM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22787996/dbohn_210816_4717_0002.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>KakaoTalk is available as a Wear OS 3 app for the Galaxy Watch 4 now.</em></figcaption>  </figure><p id=\"FTB6hN\">While Tizen, Samsung’s proprietary wearable OS, had its strengths, it didn’t have a good selection of third-party apps. What third-party apps it did have were infrequently updated. Meanwhile, Apple and less technologically impressive Wear OS watches had a much more robust app ecosystem. Fixing this weakness was the main reason Samsung made the switch to Wear OS. </p><p id=\"uC1P1h\">I doubt Samsung would ever admit it, but my theory is that <a href=\"https://gizmodo.com/the-extremely-korean-reason-why-samsung-might-ditch-tiz-1846885056\">Kakao’s refusal to make a Tizen app</a> drove home the point that Samsung would have to abandon the platform if it wanted to grow its smartwatch business. Samsung is the most powerful company in the country. It accounts for roughly 20 percent of South Korea’s GDP — and it could not get KakaoTalk, the country’s most popular messaging and social media app, to develop a dedicated Tizen app. Reportedly, the reason KakaoTalk gave boiled down to <a href=\"https://m.mt.co.kr/renew/view.html?no=2021051116213884773\">Tizen’s market reach not being worth the effort</a>. To rub salt in the wound, KakaoTalk had already created Android, iOS, and watchOS versions of its app. Samsung was, in essence, getting dissed on its home turf. </p><p id=\"5xHttu\">KakaoTalk actually developed its <a href=\"https://9to5google.com/2021/10/28/kakaotalk-wear-os-app/\">Wear OS app back in October</a>, but it’s another thing for it to be singled out at I/O. This actually isn’t the first time KakaoTalk has been featured in Wear OS promotional materials. The app was also thrown up <a href=\"https://9to5google.com/2021/05/18/wear-os-3-0/\">on the screen at Google I/O last year</a> when Google announced it was <a href=\"https://www.theverge.com/2021/5/18/22440483/samsung-smartwatch-google-wearos-tizen-watch\">collaborating with Samsung</a> on Wear OS 3.<strong> </strong>I have to imagine this was Google helping Samsung out in appealing to the Korean market, where <a href=\"https://gs.statcounter.com/os-market-share/mobile/south-korea\">72 percent of the population uses Android</a> and <a href=\"https://www.zdnet.com/article/samsung-takes-back-smartphone-market-share-from-apple-in-korea/#:~:text=Cho%20Mu%2Dhyun%20covers%20global,and%20technology%20news%20in%20Asia.&amp;text=Samsung%20controlled%2067%25%20of%20South,firm%20Counterpoint%20Research%20on%20Wednesday.\">67 percent uses Samsung phones</a>. (Google <em>did</em> also use <a href=\"https://www.maangchi.com/recipe/japchae\">japchae</a> during the keynote to demo “<a href=\"https://www.theverge.com/2022/5/11/23063809/google-lens-multisearch-feature-ai-io-near-me-scene-exploration\">multisearch near me</a>,” and you cannot underestimate Korean national pride at stuff like that.) </p><div><aside id=\"6XIKdY\"><q>Kakao’s refusal to make a Tizen app drove home the point that Samsung would have to abandon the platform to grow its smartwatch business</q></aside></div><p id=\"I4Gjca\">This is Samsung signaling to the Asian market that it’s got the apps they want now. Apps that have been on the Apple Watch for a long, long time. For instance, <a href=\"https://line.me/en/\">LINE</a>, another Korean-made chat app that is <em>hugely</em> popular in Japan, was also included as one of the featured Wear OS 3 apps. And while Google may not decide to bring the Pixel Watch to the Asian market, these additions <em>do</em> help Samsung smartwatches appear more appealing in arguably its most important market — Asia. </p><p id=\"NYAo9T\">So this feels like<strong> </strong>one of those times where Google trotting out KakaoTalk as a selling point wasn’t meant for American or European markets at all. And judging by how I reacted, I’d say it was pretty effective.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yaBdnouHcdPKtABvXTJhAbM9yuI=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23454572/2022_5_11_google_io_702_11_10_22.jpg",
  "description": "It’s one of the reasons Samsung may have ditched Tizen.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}