{
  "title": "Here’s what Twitter’s still-in-development edit button looks like",
  "url": "https://www.theverge.com/2022/5/2/23054193/twitter-edit-button-how-it-works-looks-like",
  "date": "2022-05-02T22:03:25.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/L8fV6sr1qNK_aRrg2JuvEXeOoFw=/7x0:1063x704/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70824555/edit_tweet.5.jpg\" />    </figure>  <p id=\"VcuWWY\">Twitter’s edit button has been a joke for longer than I can remember, but <a href=\"https://www.theverge.com/2022/4/5/23011327/twitter-edit-button-blue-test\">it’s finally officially becoming a reality</a> — and Jane Manchun Wong, who makes it her mission to find hidden features in companies’ code, has just given us our first real glimpse at what it might look like. </p><p id=\"dVuTtH\">As you’d expect, the editing part is pretty simple: you press a button called “Edit Tweet” in the drop-down context menu, and then you can edit a tweet. Currently, it looks like you’ll get 30 minutes after you publish a tweet to hit that button; it’ll open a window with your entire original content laid out in front of you, and you can publish whatever you like — delete the whole thing and start over if you want. It’s not just for typos. </p><div id=\"QdqZI5\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">the current unreleased version of Edit Tweet reuploads media (images, videos, GIFs, etc) instead of reusing them. an inefficient use of the bandwidth and media processing power, might be lossy too. plus it turns my video into an image (mishandling media type) <a href=\"https://t.co/HjoIA0CZhO\">pic.twitter.com/HjoIA0CZhO</a></p>— Jane Manchun Wong (@wongmjane) <a href=\"https://twitter.com/wongmjane/status/1521229356827246592?ref_src=twsrc%5Etfw\">May 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"AcPEQH\">The bigger question, of course, is what happens afterward — how can readers tell if you messed with your tweets after the fact and what you messed with? That’s also fairly simple: there’s a little “Edited” button that’ll show up next to the timestamp, and you can click it to go to an Edit History page that should theoretically show all the previous versions of that tweet. </p><div id=\"pel9UI\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">How an edited Tweet looks like on Twitter Web App: <a href=\"https://t.co/boouYlvhA3\">pic.twitter.com/boouYlvhA3</a></p>— Jane Manchun Wong (@wongmjane) <a href=\"https://twitter.com/wongmjane/status/1521210790996447233?ref_src=twsrc%5Etfw\">May 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"MxpiTg\"><em>(Ignore the “edit: soup” bit in the tweet above, Wong added that for dramatic effect.)</em></p><p id=\"6eh0Ev\">Importantly, <a href=\"https://www.theverge.com/2022/4/16/23028111/twitter-upcoming-edit-button-tweet-history\">as Wong mentioned a few weeks back</a>, Twitter appears to be making each individual tweet immutable — every version has its own ID, none of them get deleted, and it’s not clear whether Twitter’s backend will automatically propagate the newest version across the web. If you’re, say, reading a <em>Verge</em> story with an old embedded that got rewritten, will you now see the new tweet or the old one? Unclear! </p><p id=\"9YDI0g\">But even if you’re looking at the old, unedited version of the tweet, Twitter will tip you off about that. See the “There’s a new version of this Tweet” below? If you click that, it should take you to the newest version right away.</p><div id=\"hJ23Pj\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">How an old Tweet edit looks like on Twitter Web App: <a href=\"https://t.co/CdPqhW99S8\">pic.twitter.com/CdPqhW99S8</a></p>— Jane Manchun Wong (@wongmjane) <a href=\"https://twitter.com/wongmjane/status/1521215565691449349?ref_src=twsrc%5Etfw\">May 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"EJGKzM\">Sum it up, and Wong tells me she thinks it’ll<em> probably </em>work this way:</p><blockquote><p id=\"QURDg9\">trump originally tweets “covefe”, the tweets get ID #1, people embed the ID #1</p><p id=\"BJkCMw\">then trump creates a new edit “coffee”, the new edit (technically a new tweet) gets ID #2, while the original tweet (#1) becomes the first version of the Tweet</p><p id=\"Jc22y7\">and then in the embedded tweet which still points to #1, now shows “there’s a new version of this Tweet” indicator</p></blockquote><p id=\"L47rU5\">Makes sense to me. And it sure sounds a lot like the solution <a href=\"https://www.theverge.com/2017/4/13/15278800/edit-tweets-twitter-hysteria-nihilism\">that <em>Verge</em> contributing editor Casey Newton suggested</a> in 2017: </p><blockquote><p id=\"OZMhGR\">I propose an option in a tweet’s inverted-caret drop-down menu that reads thus: “edit tweet.” Tap it and you can correct any mistake and republish. The new version is served across Twitter wherever the tweet exists, including retweets and quote-tweets. Next to the tweet’s timestamp, a prominent new word appears: “edited.” Tap the word and Twitter displays the previous versions of the tweet underneath the latest one.</p></blockquote><p id=\"zaJeHI\">Except here, it sounds like Edit History <a href=\"https://twitter.com/wongmjane/status/1516841712018083842\">may be a different page</a> rather than neatly unrolling underneath. </p><p id=\"Vaucd0\">Keep in mind that Wong hasn’t been able to publish any completed, edited tweets to Twitter’s actual backend quite yet, so these findings are <em>very </em>tentative. She sleuthed it all out by running the app client-side, letting her see the user interface in action.</p><aside id=\"E0TBpJ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Elon Musk buys Twitter: all the news you need on one of the biggest tech deals of all time\",\"url\":\"https://www.theverge.com/23026874/elon-musk-twitter-buyout-news-updates\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/pZ7wA6yYmlVS588s4IvCQ1Nx0Zg=/0x72:1069x632/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23433963/edit_tweet.jpg",
  "description": "Almost exactly as predicted",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}