{
  "title": "Here’s how Microsoft’s new One Outlook email app will work",
  "url": "https://www.theverge.com/2022/5/18/23125532/microsoft-new-one-outlook-beta-feature-details-loop-to-do-calendar",
  "date": "2022-05-18T20:11:50.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/g81IdiklgLKOxFZwFKXV8uK0qp0=/149x0:2843x1796/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70884774/Loop.0.png\" />        <figcaption><em>The new Outlook will feature support for Loop components.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"JSrFjR\">Microsoft <a href=\"https://insider.office.com/en-us/blog/the-new-outlook-for-windows-helps-you-be-more-productive-and-in-control-of-your-inbox\">has announced</a> the beta for the new Outlook for Windows, which will make the desktop email client a lot more like the web version. While screenshots and an entire build of the app were <a href=\"https://www.theverge.com/2022/5/6/23060682/microsoft-outlook-redesign-windows-web\">recently leaked</a>, Microsoft’s announcement gives us a good look at what kind of features we can expect to see coming to our inboxes.</p><p id=\"LElWbW\">According to Microsoft’s Tuesday post, Outlook will be getting quite a few new features in addition to an updated design. For starters, it’ll integrate with Loop, Microsoft’s system for <a href=\"https://www.theverge.com/2021/11/2/22758951/microsoft-loop-fluid-components-office-collaboration-app\">collaborating on things like polls, task lists, and more</a> throughout Office. There’s also a new system for attaching files. If you’ve got something stored in the cloud, you can type the “@” symbol and then the filename, and you’ll get a list of matching files ready to add to an email.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bBsEfmVXdgY7LfR3wN8DMxBx9iA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545066/At_docs_search.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>You’ll be able to search for files you have stored in the cloud by @ing them.</em></figcaption>  </figure><p id=\"cBYORs\">Microsoft’s also added a few calendar and to-do features. Some of them are simple, like the ability to pin emails to the top of your inbox so they’ll stay in your face until you deal with them. You’ll be able to drag emails over to a panel and set them as to-do items or as calendar events if you want to book time to respond — and after you’ve done that, you can look at the new calendar view that shows your task lists, notes, and various other customizable pieces of information alongside an actual calendar.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oiwYwKn2UAYgbe4DbdqCKPtB3k8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545104/To_Do_drag_and_drop.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>On the left, you can see a pinned message. And on the right, you can see the UI for using an email to create a task.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/t9FbXuzy64e6JH0dLaK-XAdHmHA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545097/Calendar__Board_view.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>Microsoft’s calling the customizable view the “calendar board.”</em></figcaption>  </figure><p id=\"M7JaWQ\">I don’t want to make it seem like Microsoft’s reinventing email here. The app is still decidedly Outlook, even if it seems like it’ll just be a <a href=\"https://twitter.com/tomwarren/status/1526825733984866305?s=20&amp;t=1ovkD_l-qluL902sIhLyvg\">very fancy web view</a>. But a few of these features remind me of what got me so excited about the <a href=\"https://www.wired.com/2015/12/dropbox-kills-carousel-and-mailbox-as-it-turns-toward-businesses/\">now-defunct</a> Mailbox app that <a href=\"https://www.theverge.com/2013/3/15/4108640/dropbox-acquires-email-app-mailbox\">Dropbox bought</a> way back in the day. I’m also happy to see a revamp of the calendar interface; I’ve always hated the one that’s in the current desktop version of Outlook.</p><p id=\"DLcUYQ\">Microsoft’s post mentions myriad other features, too. For example, when responding to a calendar invite, you can specify whether you’ll be attending in person or virtually; the inbox-cleaning Sweep feature will be included in the app; and Outlook will pin messages that it thinks are important if you seem to have missed them. You can see the full list of features, along with screenshots and descriptions, <a href=\"https://insider.office.com/en-us/blog/the-new-outlook-for-windows-helps-you-be-more-productive-and-in-control-of-your-inbox\">on Microsoft’s page</a>.</p><p id=\"ROf90g\">As always with apps based on web technology, I do have a little bit of trepidation around this future update, especially its performance. I also assume that longtime Outlook users will have to endure one heck of an adjustment period, especially if it’s the main app they spend their days in. But, at the same time, I very much like the idea of Outlook having the same functionality on the web and in the desktop app, rather than making us use two substantially different UIs. Plus, the features that Microsoft’s showing off mesh very well with how I view email. So, color me cautiously optimistic. </p><p id=\"2VGLvM\">If you feel the same, you may be able to try it out yourself — though you will need a commercial or educational Microsoft account. If you’ve checked that box, you can <a href=\"https://insider.office.com/en-us/join/windows\">sign up to be an Office Insider and join the Beta Channel</a>. Once you’ve done that and updated to the latest version of Outlook, there should be a toggle letting you switch to the new version. Of course, do keep in mind that it is a <em>beta</em>; be sure you’re comfortable with running your email through a program that’s still in the works.</p><p id=\"ZSrjhW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/H8rlFNJsp3mAmOylS2fmMfEMCbY=/0x115:2992x1681/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23545128/Loop.png",
  "description": "There’s a new calendar view and Loop components.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}