{
  "title": "Here’s how the new iPhone SE compares to Apple’s iPhone 13 lineup",
  "url": "https://www.theverge.com/22966973/apple-iphone-se-2022-vs-iphone-13-comparison",
  "date": "2022-03-08T23:13:51.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8ycr4m6lQvabJsAoarAujkJYOso=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70596590/iphone_se_2022_horizontal.0.jpg\" />        <figcaption><em>The new iPhone SE for 2022 maintains the longstanding home button with Touch ID.</em> | Image: Apple</figcaption>    </figure>  <p id=\"jhgFm4\">Now that the <a href=\"https://www.theverge.com/2022/3/8/22965564/apple-event-iphone-se-ipad-air-m1-ultra-mac-studio-display-biggest-announcements\">dust has settled</a> from <a href=\"https://www.theverge.com/2022/3/7/22961404/apple-event-peek-performance-iphone-se-ipad-air-announcements-news-products\">Apple’s “Peek Performance” event</a>, we know that the latest entry in the iPhone lineup is the <a href=\"https://www.theverge.com/2022/3/8/22959072/iphone-se-3-price-screen-specs-features-release-date-a15-bionic-5g\">iPhone SE (2022)</a>. It’s a new iteration of the budget model from 2020, and it’s set to launch March 18th with preorders opening on March 11th. This new iPhone SE rounds out the entry-level offering from Apple, coming in at a slightly higher price of $429 (an increase of $30) and equipped with the latest A15 Bionic CPU, 5G compatibility, a slightly larger battery, and more durable glass on the front and rear. </p><p id=\"HQFtGp\">There’s a lot to like in the 2022 iPhone SE — especially if you love a Touch ID fingerprint sensor and home button — even if it still has a dated design with a smaller 4.7-inch screen and big bezels. So how does it stack up to the iPhone 13 line? Can the budget darling compete with the big guns at the flagship level that share its processor? Let’s dive into what specs the new iPhone SE has and compare it to each model in the iPhone 13 lineup, specifically the <a href=\"https://www.theverge.com/22684421/apple-iphone-13-mini-review\">iPhone 13</a>, <a href=\"https://www.theverge.com/22684421/apple-iphone-13-mini-review\">iPhone 13 Mini</a>, <a href=\"https://www.theverge.com/22684033/apple-iphone-13-pro-max-review\">iPhone 13 Pro</a>, and <a href=\"https://www.theverge.com/22684033/apple-iphone-13-pro-max-review\">iPhone 13 Pro Max</a>.</p><aside id=\"vtff64\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The 7 biggest announcements from Apple’s Peek Performance event\",\"url\":\"https://www.theverge.com/2022/3/8/22965564/apple-event-iphone-se-ipad-air-m1-ultra-mac-studio-display-biggest-announcements\"},{\"title\":\"Apple iPhone SE gains 5G, A15 processor, and a higher $429 price tag\",\"url\":\"https://www.theverge.com/2022/3/8/22959072/iphone-se-3-price-screen-specs-features-release-date-a15-bionic-5g\"}]}'></div></aside><h2 id=\"jHVHfv\">iPhone SE (2022): what’s new, what’s the same</h2><p id=\"RJ9557\">I assure you, your eyes do not deceive you. The new iPhone SE does indeed look just like the iPhone SE of 2020, which pretty much looked like the iPhone 8 of 2017. It’s got that familiar, 4.7-inch Retina LCD display with 1334 x 750 resolution, chunky bezels, glass rear that allows Qi-compatible wireless charging, and it comes in three colors (midnight, starlight, and red). </p><p id=\"rfqwwk\">In addition to sharing the same A15 Bionic CPU as all of the iPhone 13 models, Apple managed to squeeze in a bigger battery, a 5G sub-6GHz modem, and stronger glass coverings. The front and rear glass of the SE is said to match the rear glass of the iPhone 13, so while it’s not Ceramic Shield for better drop resistance, Apple claims it’s “the toughest glass in a smartphone on the front and back.” The 2022 iPhone SE may be tougher, but it only maintains the IP67-rated water and dust resistance of the previous model.</p><p id=\"USiC9S\">Another holdover from the 2020 SE is camera hardware. The lenses and sensors are the same, but the inclusion of the A15 enables a newer software generation of computational photography with Smart HDR 4. We’ll have to see how much of a difference that makes in real-world use once we review the phone. But in the meantime, it’s all sounding pretty familiar.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mKcPn-P6q6tTmT2YU4_oDqmTS2E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298592/2022_3_8_apple_98_10_54_14.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>The iPhone SE (2022) in its three colors: starlight, midnight, and Product (Red).</em></figcaption>  </figure><h2 id=\"XEE63n\">iPhone SE (2022) versus iPhone 13</h2><p id=\"aom4AO\">Compared to all that, what do you get by opting for a more premium device in the iPhone 13 line? Each model of iPhone 13 has a larger screen than the iPhone SE (yes, even the iPhone 13 Mini) as well as better quality displays with OLED panels across the line. The Pro models even step up the viewing experience with faster screens that support up to 120Hz, allowing for extra-smooth scrolling and animations. The biggest changes aside from the displays are how you interact with them, as all iPhone 13 models use Face ID and gesture controls as opposed to the SE’s Touch ID and home button. The iPhone 13 line also boasts newer camera hardware, with dual-lens modules in the base 13 and Mini while the Pros have triple-camera arrays with a macro mode for close-up shots. </p><div class=\"c-float-right\"><aside id=\"OGMRbk\"><q>All the extras and accouterments of the iPhone 13 line come at much steeper costs</q></aside></div><p id=\"mvBKaD\">So if you prefer the budget-friendliness of the iPhone SE, you have to be okay with a single wide-angle camera and lens. But all the extras and accouterments of the iPhone 13 line come at much steeper costs, each starting at 128GB of storage with the option to go up from there for more money. The 6.1-inch iPhone 13 starts at $829, while the iPhone 13 Mini dips lower to $729, thanks in part to its smaller 5.4-inch screen and lower-capacity battery.</p><p id=\"PL6msH\">Stepping up to the Pros means spending $999 on a 6.1-inch iPhone 13 Pro or $1,099 on a chunky, 6.7-inch iPhone 13 Pro Max. The new iPhone SE? While it’s gotten more expensive, it’s still cheaper than the base iPhone 13 and the higher-end models, with the 64GB variant starting at $429. You can opt for 128GB or 256GB, but it will cost you $479 and $579, respectively. It all comes down to what you value in your iPhone decision and what works with your budget.</p><p id=\"16Wdyg\">Take a look at our detailed, spec-to-spec comparison below to see how the new iPhone SE stacks up against Apple’s iPhone 13 line.</p><div id=\"IMf4jc\"><div data-anthem-component=\"table:11084462\"></div></div><p id=\"92Ozgk\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7tE-gvBK7p6pRmNKDen1o7fI7Nw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23299515/iphone_se_2022_horizontal.jpg",
  "description": "What do you sacrifice with the budget option from Apple?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}