{
  "title": "Here are the best tablet deals right now",
  "url": "https://www.theverge.com/good-deals/22916033/best-tablet-deals",
  "date": "2022-04-18T23:38:06.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"The Surface Pro 8\" src=\"https://cdn.vox-cdn.com/thumbor/WrU8WjK5fxzUNeg9ZBmgbaeucGc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70638781/bfarsace_210921_4770_0010.0.jpg\" />        <figcaption><em>Microsoft is currently discounting the Surface Pro 8, dropping the entry-level configuration to $949.99.</em> | Image by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"CUjacD\">Tablets exist in a space between phones and laptops that is becoming increasingly muddled. As phones become more powerful and gain larger displays, laptops continue to get lighter. Tablet manufacturers haven’t been resting on their laurels, though. Many of the more recent tablets we’ve seen are looking to bridge the gap in terms of performance and, in select cases, handle some tasks more efficiently than both phones and laptops.</p><p id=\"9FlGBw\">The tablet spectrum is varied, too. Inexpensive models like the Amazon Fire HD 10 make for excellent media streaming devices, while those in Microsoft’s versatile Surface lineup can easily serve as ad-hoc laptops when paired with an optional folio-style keyboard. Then there’s the ubiquitous iPad, a slate that has become the go-to tablet for anyone searching for something in the Apple ecosystem (and for many outside of it).</p><p id=\"Ed0RyT\">Below, we’ve rounded up deals for a number of Android, iPadOS, and Windows tablets. We’ve also broken down the deals by manufacturer to make things easier, and we will continue to update this post regularly as new discounts and sales become available.</p><aside id=\"9eRJCi\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Here are the best iPad deals right now\",\"url\":\"https://www.theverge.com/21280354/best-ipad-deals-apple\"},{\"title\":\"iOS 15.4 now live as Universal Control comes to iPads and Macs\",\"url\":\"https://www.theverge.com/2022/3/14/22976606/ios-15-4-mask-compatible-face-id-emoji-tap-to-pay-airtags-stalking-update-release-date-features\"}]}'></div></aside><h2 id=\"smntxb\">Amazon tablet deals</h2><h3 id=\"g7ddx9\">Amazon Fire HD 8 Kids</h3><p id=\"PBGlPG\">Amazon’s tablet may not be the best choice for getting work done when you’re away from a laptop or desktop, but the kid-friendly model of the <a href=\"https://www.amazon.com/Fire-HD-8-Kids-Edition-tablet/dp/B07WDDT3G5?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Fire HD 8</a> and <a href=\"https://www.amazon.com/Fire-HD-8-Kids-Pro-tablet/dp/B08H5R1SH6?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">HD 8 Pro</a>, with its ruggedized, kid-proof case, is perfect for media streaming and light app usage. Currently, neither tablet is available at a true discount; however, you can save $84 on your total at checkout when you purchase two or more of the HD 8 or 8 Pro. This lowers the cost of a pair from $279.98 to $195.99. You can even mix and match models and colorways.</p><p id=\"v9umUT\">The key difference between the standard and Pro model is that the latter features a slimmer case and browser with fewer restrictions. Otherwise, however, the hardware is the same. The kid-friendly version of the Fire HD 8 uses the same 8-inch display and 2GB of RAM and offers up to 12 hours of battery life. The storage is limited to just 32GB but can be expanded with up to an additional terabyte of storage via a microSD card. Another selling point is the tablet’s two-year extended warranty, which will have Amazon send you a new tablet if your current one stops working for any reason.</p><p id=\"lV5zXE\">If you’re in the market for just one of these tablets, Amazon is currently offering a 20 percent discount on the purchase of a single Fire tablet <a href=\"https://www.amazon.com/b/?ie=UTF8&amp;node=10825011011\">with an eligible trade-in</a>. As an added bonus, you’ll also receive an Amazon gift card equal to the appraised value of your old device. Besides older model Fire tablets and Kindles, other devices eligible for trade include tablets from Apple, Samsung, and Microsoft. Even some select models of graphing calculators are accepted if you’re looking to really stretch your dollar.</p><div id=\"tAqV6K\"><div data-anthem-component=\"productcard:10648106\"></div></div><div id=\"uhNePC\"><div data-anthem-component=\"productcard:11149536\"></div></div><h2 id=\"B8waHm\">Apple tablet deals</h2><h3 id=\"4cfT1G\">2020 iPad Air</h3><p id=\"X8cK0e\">The recent announcement of a <a href=\"https://www.theverge.com/22979828/apple-ipad-air-2022-review\">new iPad Air</a> has led Apple to significantly discount its last-gen predecessor, the 2020 iPad Air. The older model may lack Apple’s blazing-fast M1 chip, but its A14 Bionic processor is still capable of delivering plenty of power and should be fast enough for the vast majority of apps. The tablet is also compatible with various iPad Air accessories, which allow you to transform it into an ad-hoc laptop using add-ons like Apple’s Magic Keyboard. The 10.9-inch tablet offers a terrific Retina display with 2360 x 1640 resolution and a wide color gamut as well, not to mention a USB-C port for charging. Normally $749, the 256GB, Wi-Fi-equipped iPad Air is <a href=\"https://www.amazon.com/dp/B08J6LJMT4?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">on sale at Amazon</a> in all colorways for $599.99. <a href=\"https://www.theverge.com/21525780/apple-ipad-air-2020-review\"><strong>Read our review.</strong></a>  </p><div id=\"QLEPB2\"><div data-anthem-component=\"productcard:11132191\"></div></div><h3 id=\"qorU9B\">2021 iPad Mini</h3><p id=\"iwVFqp\">The latest model of the 64GB iPad Mini usually sells for $499.99 but can currently be found at both <a href=\"https://www.amazon.com/2021-Apple-iPad-Mini-Wi-Fi/dp/B09G91LXFP?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and <a href=\"https://goto.walmart.com/c/482924/565706/9383?u=https%3A%2F%2Fwww.walmart.com%2Fip%2FApple-iPad-Mini-2021-Wi-Fi-64GB-Space-Gray%2F168720858%3F&amp;subid1=VergeDealsRoundup032222\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Walmart</a> for $459.99. This is matching the lowest price yet for the miniature, Wi-F-centric Apple tablet. This model brings a number of welcome changes to the hardware, including removing the home button to make room for a larger display and adopting the USB-C charging standard instead of Apple’s proprietary Lightning connector. </p><p id=\"FFihkE\">The 8.3-inch display has a resolution of 2266 x 1488 and 500 nits of brightness, along with True Tone technology that allows you to fine-tune the display based on the lighting in your environment. The Mini also features back- and front-facing 12MP cameras and can capture 4K video at 60 frames per second. All this is powered by Apple’s A15 Bionic CPU. Until Apple releases an iPad Mini with an M1 chip — or some variation thereof — the latest Mini is the one to beat.  </p><p id=\"1Vzqwq\">While it is compatible with the second-gen Apple Pencil, note that this version of the iPad Mini won’t work with Apple’s Smart Keyboard or Magic Keyboard Folio. It can, however, work with a number of third-party Bluetooth keyboards if you need a larger typing surface. <a href=\"https://www.theverge.com/22696652/ipad-mini-2021-6th-gen-review\"><strong>Read our review</strong></a>.</p><div id=\"CvTP1v\"><div data-anthem-component=\"productcard:10743705\"></div></div><h3 id=\"3tXUjV\">12.9-inch iPad Pro (2021)</h3><p id=\"pzG4dH\">In many ways, the iPad Pro is the scaled-up version of the most recent iPad Air. The 12.9-inch Pro features Apple’s M1 chip, the same all-aluminum form factor, and the option for 5G connectivity. The 12-inch iPad Pro includes a larger Mini LED display, though, along with a superior camera array, support for Face ID, and a variable refresh rate. </p><p id=\"Hkh4eG\">The 128GB model with Wi-Fi normally costs $1,099.99 but can currently be found at <a href=\"https://www.amazon.com/dp/B0932BKSLP/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and <a href=\"https://shop-links.co/cgO4PR6t1uI\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> for around $999. The current discount is appealing, but bear in mind that this particular model has maintained this price for several months, so we wouldn’t recommend paying more than $1,000 if you’re planning to pick one up. <a href=\"https://www.theverge.com/22442084/ipad-pro-2021-review-features-screen-mini-led-m1-processor\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review</strong></a>.</p><div id=\"2QUxAs\"><div data-anthem-component=\"productcard:10474637\"></div></div><aside id=\"z5fxda\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Verge Deals on Twitter\",\"description\":\"Join our over 46,000 followers, and keep up with our best daily tech deals with @vergedeals\",\"label\":\"Follow us!\",\"url\":\"http://bit.ly/2JzR5Ud\"}'></div></aside><h2 id=\"xGz0lF\">HP tablet deals</h2><p id=\"6nW8Ly\">If you can’t decide between a laptop or a tablet, the HP Chromebook x2 11 is a great way to compromise. Usually available for $599.99, <a href=\"https://shop-links.co/cg3RxswUIuB\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy has discounted this model to just $299.99</a>, its lowest price to date. This 11-inch tablet features a built-in kickstand and comes packaged with a keyboard folio and pen to provide a more laptop-adjacent experience.</p><p id=\"Ebg8M7\">The x2 is powered by ChromeOS, lending it similar functionality to the other Android tablets on our list, but features a display resolution of 2160 x 1440, a cut above what's offered by some of the more expensive tablets here. Some other specs to take note of include the tablet’s Snapdragon 7c Gen 1 processor, 8GB of RAM, and 64GB of expandable memory. In addition to a microphone and 5MP camera, the tablet is also equipped with a pair of USB-C ports and a microSD card slot that can be used for data transfer or storage. The USB-C ports don’t have Thunderbolt 4 support, however, so the x2 won’t play well with an external dock.</p><p id=\"jtrHyz\">Overall, the HP Chromebook x2 11 offers good bang for your buck. We only scored it a 5.5 out of 10 in <a href=\"https://www.theverge.com/22838058/hp-chromebook-x2-11-lenovo-chromebook-duet-5-tablet-review-comparison-head-to-head\" rel=\"sponsored nofollow noopener\" target=\"_blank\">our review</a> last year — namely due to its cramped keyboard and occasionally choppy performance — but the tablet is far more appealing now that it’s half the price. If you’re looking for a tablet that’s great for browsing and comes packaged with a stylus for note-taking, the x2 11 is certainly not a bad way to go at this price. <a href=\"https://www.theverge.com/22838058/hp-chromebook-x2-11-lenovo-chromebook-duet-5-tablet-review-comparison-head-to-head\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review</strong></a>. </p><div id=\"1pG3dq\"><div data-anthem-component=\"productcard:11148854\"></div></div><h2 id=\"4MwURd\">Lenovo tablet deals</h2><h3 id=\"taBmvp\">Lenovo Yoga Tab 13</h3><p id=\"rUIjBp\">This is a bit of an odd one here. The Lenovo Yoga Tab 13 departs from the typical design conventions used by other tablets, but these differences allow for some interesting applications that other tablets might struggle to replicate. I’ll tell you more about it below, but here’s the deal: normally, the Yoga Tab 13 sells for $679.99, but it’s <a href=\"https://shop-links.co/cg3V35ztjwS\" rel=\"sponsored nofollow noopener\" target=\"_blank\">currently discounted to just $399.99 at Best Buy</a>. That’s not the lowest price we’ve ever seen this tablet go for, but it remains a solid discount nonetheless.</p><p id=\"MVoT2X\">In addition to being larger than the average tablet with a 13-inch screen, the most distinctive feature of the Yoga Tab 13 is its large, adjustable handle. Besides providing a convenient way to hang the tablet on a variety of surfaces, this also allows the tablet to serve as an external monitor for any device that can be connected either via mini-HDMI or USB-C. The extended area that juts from the tablet also houses the large stereo speaker, lending it a much broader sound profile.</p><p id=\"LYsTvr\">The 13-inch touchscreen display has a resolution of 2160 x 1350 with a refresh rate of 60Hz and Dolby Vision, which allows for greater depth of color. While some of these features may give the Yoga Tab 13 the appearance of a laptop, it's still powered by the Android 11 OS and running on a Snapdragon 870 mobile CPU, even though its 8GB of RAM makes it slightly more capable when running several apps in tandem. One important note regarding the specs, however, is that the tablet is limited to 128GB of RAM, and without a microSD card slot, you’ll have to rely on external storage if you find yourself in need of additional space.</p><div id=\"I4m8gJ\"><div data-anthem-component=\"productcard:11132040\"></div></div><h2 id=\"FbvGr0\">Microsoft tablet deals</h2><h3 id=\"E5GEFK\">Microsoft Surface Pro 8</h3><p id=\"52oAbj\">If you don’t mind a limited port selection and are in need of a tablet that offers plenty of performance in a lightweight chassis, Microsoft’s high-powered Surface Pro 8 might fit the bill. The attractive, modern slate feature a 13-inch touchscreen, along with 2880 x 1920 resolution and a 120Hz refresh rate — a rarity outside of the gaming sphere. It’s also a great teleconferencing device thanks to its far-field studio microphones and 5MP front-facing camera. Best of all, it serves as a competent stand-in laptop when using the integrated kickstand and the optional keyboard cover.</p><p id=\"eh5Vki\">Right now, the Surface Pro 8 is <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24542&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fstore%2Fconfigure%2FSurface-Pro-8%2F8QWCRTQ8V8XG\" rel=\"sponsored nofollow noopener\" target=\"_blank\">on sale at Microsoft for $949.99</a>, a cool $152 off the normal list price. Note that this particular model comes with an 11th Gen Intel Core i5 CPU, 8GB of RAM, and a 128GB SSD. But it isn’t packaged with the Microsoft Surface keyboard. If you need a little extra built-in storage, the <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24542&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fstore%2Fconfigure%2FSurface-Pro-8%2F8QWCRTQ8V8XG\" rel=\"sponsored nofollow noopener\" target=\"_blank\">512GB configuration is also discounted</a> from its regular price of $1,399.99 to $1,199.99, though you can always expand the storage of this tablet with microSD cards. <a href=\"https://www.theverge.com/22709876/microsoft-surface-pro-8-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review.</strong></a></p><div id=\"qiWfQ0\"><div data-anthem-component=\"productcard:10771697\"></div></div><h2 id=\"yzpSeE\">Samsung tablet deals</h2><h3 id=\"9WMufH\">Samsung Galaxy Tab S7 FE and S7 Plus</h3><p id=\"QIdVky\">The Samsung Galaxy Tab S7 FE and S7 Plus still manage to hold their own, even with the recent release of the <a href=\"https://www.theverge.com/23014720/samsung-galaxy-tab-s8-s8-plus-tablet-android-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Tab S8 series</a>. Both can run on Android 12, feature quad-speaker systems, and come packaged with Samsung’s S Pen. While both tablets are roughly the same size, the S7 Plus is clearly the more powerful tablet, one that boasts a more powerful Snapdragon 865+ chip, a better camera array, more RAM, and an OLED display. The S7 FE, by comparison, uses an LCD panel with a 778G Snapdragon processor and is limited to 4GB of RAM in its 64GB configuration.</p><p id=\"V2SrHM\">Although we’ve seen the standard 64GB S7 FE with Wi-Fi retail for as low as $429.99, it’s currently available at <a href=\"https://www.amazon.com/gp/product/B09972N6QJ?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and <a href=\"https://shop-links.co/cg30XDEm78D\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> for $479.99, about $50 off its original retail price. The S7 Plus, meanwhile, is also on sale at Amazon, where you can <a href=\"https://www.amazon.com/SAMSUNG-12-4-inch-Android-Bluetooth-fast-charging/dp/B08FBPRY3N?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">pick up the 128GB, Wi-Fi-equipped model for $683 instead of $849.99</a>. We’ve seen steeper discounts on both models in the past; however, given the recent introduction of the S8 line, we don’t expect retailers — including Samsung — to offer either model much longer. <a href=\"https://www.theverge.com/21444688/samsung-galaxy-tab-s7-plus-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our S7 and S7 Plus reviews</strong></a>.</p><div id=\"ciRO39\"><div data-anthem-component=\"productcard:11149322\"></div></div><div id=\"tf07dm\"><div data-anthem-component=\"productcard:11097080\"></div></div><h3 id=\"RelzUy\">Samsung Galaxy Tab A7 Lite</h3><p id=\"na79hy\">If you’re in the market for a barebones entertainment device — whether for yourself or your kids — the Samsung Galaxy Tab A7 Lite is a tablet to consider. The A7 Lite is currently available on <a href=\"https://www.amazon.com/Samsung-Lite-Gray-32GB-SM-T220NZAAXAR/dp/B094Q89NKH?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a>, <a href=\"https://shop-links.co/cg31adHHCC1\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a>, and <a href=\"https://goto.walmart.com/c/482924/565706/9383?veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https%3A%2F%2Fgoto.walmart.com%2Fc%2F482924%2F565706%2F9383%3Fveh%3Daff%26sourceid%3Dimp_000011112222333344%26u%3Dhttps%253A%252F%252Fwww.walmart.com\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Walmart</a> for $119 instead of its typical $159.99. The tablet is a smaller and less powerful version of the standard A7. The 8.7-inch display offers just 1340 x 800 resolution, and, like the larger model, the base configuration comes with 32GB of storage and 3GB of RAM. While less powerful, it’s also difficult to find a tablet with these specs that’s available at this price point.</p><div id=\"zGI8pw\"><div data-anthem-component=\"productcard:10869140\"></div></div><aside id=\"eZwGck\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"deals\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/Pl-4_Tqhat-Gz5TAlpFC8-Qy8CM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22868459/bfarsace_210921_4770_0010.jpg",
  "description": "All the savings you can find on today’s tablets.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}