{
  "title": "Honda teases upcoming Prologue, its first electric SUV to be sold in the US",
  "url": "https://www.theverge.com/2022/5/18/23075754/honda-prologue-electric-suv-ev-us",
  "date": "2022-05-18T17:30:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9tNNJp4BJ9abECCnqTwxWauRlgo=/0x185:1200x985/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883793/Honda_Prologue_Teaser_Sketch_Final_with_logo.0.jpg\" />        <figcaption>Honda</figcaption>    </figure>  <p id=\"J9gigL\">Honda released a teaser image of the <a href=\"https://www.theverge.com/2021/6/28/22550655/honda-prologue-electric-vehicle-ev-2024\">upcoming 2024 Prologue electric SUV</a>, the company’s first battery-electric vehicle to be sold in the US. The company also touted its hybrid vehicles as a way to address questions that it has been slow to roll out an EV strategy as compared to its rivals. </p><p id=\"cNraD6\">The Prologue will be the first of two vehicles that Honda is <a href=\"https://www.theverge.com/2020/4/2/21206074/gm-honda-ev-electric-vehicle-deal-battery-year-release\">co-developing with General Motors</a>, using the US automaker’s Ultium battery packs. The other vehicle will carry the Acura nameplate and will also be developed jointly with GM, but the company hasn’t revealed any new information about it at this time. The Prologue, which will go on sale in 2024, also marks the beginning of a wave of 30 hybrid, battery-electric, and fuel-cell vehicles that Honda says it will release by 2030. </p><p id=\"PhjOeL\">These EVs will be built on a variety of EV architectures that Honda is building, some in collaboration with General Motors. The Honda Prologue and Acura EV will be built on GM’s Ultium platform, which is also powering the Detroit-based automaker’s Hummer EV pickup truck and Cadillac Lyriq SUV.</p><div class=\"c-float-right\"><aside id=\"ZTC5Kd\"><q>Honda’s other EVs will be built on the Honda e architecture, which the company plans to introduce in 2026</q></aside></div><p id=\"PGKf7P\">Honda’s other EVs will be built on the Honda E architecture, which the company plans to introduce in 2026. In 2027, Honda plans on rolling out a slate of “affordable” EVs, including a compact SUV. Those vehicles will be based on a new EV architecture it is co-developing with GM. </p><p id=\"96tdM8\">Honda is setting the goal of selling 60,000 Prologue SUVs in the US in 2024, 70,000 units in 2025, and 300,000 in 2026, said Mamadou Diallo, vice president of sales for American Honda Motor. More broadly, the company says it wants 40 percent of its sales to be comprised of battery-electric and fuel-cell vehicles by 2030, 80 percent by 2035, <a href=\"https://www.theverge.com/2021/4/23/22399212/honda-gas-car-phase-out-2040-electric-vehicle\">and 100 percent by 2040</a>.</p><p id=\"kLp7O7\">As seen in the teaser image, the Prologue is taking some subtle design cues from the well-loved Honda E city car. Honda is also stressing the vehicle’s long wheelbase and short overhang, or the length of the vehicle that extends beyond its wheelbase. The Prologue was designed at the Honda Design Studio in Los Angeles in collaboration with a  design team in Japan.</p><p id=\"nC32Ie\">“We wanted to ensure that Prologue represents both a true Honda EV and something that would look right at home in the showroom right next to the rest of our SUV lineup,” Diallo said. </p><p id=\"RhlUrx\">Honda’s current electric lineup is extremely limited as compared to other automakers. The company recently <a href=\"https://www.usatoday.com/story/money/cars/2020/03/09/honda-clarity-electric-vehicle-killed-honda-discontinues-ev/5001659002/\">discontinued its Clarity EV</a>, though it will continue to sell hydrogen and plug-in hybrid versions of the vehicle. And the Honda E is only available in Japan and Europe.</p><p id=\"xvxU15\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hB0PX1dwLY0KXLS5xLLS_aPBXM4=/0x271:1200x899/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23475718/Honda_Prologue_Teaser_Sketch_Final_with_logo.jpg",
  "description": "The Prologue has design cues from the Honda E city car.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}