{
  "title": "Honey, I decapitated the MacBook",
  "url": "https://www.theverge.com/22965732/macbook-decapitation-slabtop-mod-mac-studio-event-rumor-keyboard-computer-diy",
  "date": "2022-03-26T12:00:00.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Hx1MRiTRATCrogtdb5T77vVXuy8=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70674767/VRG_ILLO_5107_MacBookAir_Decapitation.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>Converting a laptop into a ‘slabtop’ is surprisingly freeing</p> <p class=\"p--has-dropcap\" id=\"zWxYaL\">People had a lot of questions when I pulled out my M1 MacBook Air at a party over the weekend: “What is that?” “What happened to your laptop?” “Is that the new Mac?” This was to be expected, as there certainly was something different about mine. See, my MacBook Air doesn’t have a screen — and I made it that way.</p><p id=\"x68UX4\">Don’t worry — it’s not broken. All I did was take apart my laptop without, you know, re-attaching the display. It has now been simplified into just its bottom half: an aluminum slab with an embedded keyboard and trackpad. I’m calling it a “slabtop” now. And I kind of like it.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kA3W_js_PKna1EiDMAIcrO_jqNI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345954/ushakir_220324_5107_0008.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>Behold! I present to you my slabtop.</em></figcaption>  </figure></div><p id=\"gKpdTg\">It’s a whole-ass computer inside a keyboard, not unlike PCs of yesteryear like the Apple II and Commodore 64. But this M1-powered slabtop is different from those relics; it’s got a trackpad, a long-lasting battery, and it has AirPlay.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\"Steve Wozniak with an Apple IIe\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oqT0lixS7IodMQsbOlnbSGmgFYk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23343266/685195449.jpg\">      <cite>Photo by © Roger Ressmeyer/CORBIS/VCG via Getty Images</cite>      <figcaption><em>The Apple IIe. Even Woz likes a good slabtop.</em></figcaption>  </figure></div><p id=\"D6mx7Y\">It sounds silly, but I swear a slabtop is more fun to use than a laptop. It’s freeing at a party where you can wirelessly connect to a TV with the keyboard in your lap — your hands freely flailing without smacking your screen during a Drawful game session with friends.</p><p id=\"x0ABo2\">What inspired me to decapitate my Mac was Apple’s <a href=\"https://www.imore.com/apple-just-patented-completely-brand-new-type-mac\">patent published last month</a> for a Mac embedded inside a keyboard, and the word that <a href=\"https://ioshacker.com/news/people-in-china-are-using-macbook-pro-without-screen-and-now-i-want-one\">China has already turned this idea into a cottage industry</a>. Rumor had it we would see a Mac like this at Apple’s event last week, but instead, we got the externally boring but <a href=\"https://www.theverge.com/22981815/apple-mac-studio-m1-ultra-max-review\">actually amazing</a> new Mac Studio. I must say, I was a bit smitten by the raw performance Apple was promising and began slapping my wallet nervously in my palm — but instead of choosing consumerism, I chose violence.</p><p id=\"FzI72y\">Look, I’m not crazy — I don’t go around looking at laptops and wondering how they would look with their heads chopped off, but I’ve probably replaced over a hundred display clamshells during my time as an Apple “Genius,” and I’m comfortable with it. The idea that plenty of people <a href=\"https://twitter.com/sicmatr1x1/status/1500801170624843780?s=21&amp;t=lR2czk8QZpiQE4yeCuldVA\">beat me to it</a> also didn’t hurt: it’s been <a href=\"https://twitter.com/duanrui1205/status/1500747070093008899\">trending on Twitter</a> and <a href=\"https://www.reddit.com/r/apple/comments/t1432n/mac_within_a_keyboard_concept_was_revealed_by_the/\">discussed on Reddit</a> ever since that patent was published. Someone even made a slabtop <a href=\"https://twitter.com/nsampre/status/1500837062794227717\">with the forsaken Touch Bar</a>, retaining at least one screen on their lap.</p><div><aside id=\"n7nbFN\"><q>I chose violence</q></aside></div><p id=\"whpB3Z\">You do lose some functions when you delete the screen; hopefully, you’ll never need to fix your computer because you can’t see the recovery mode screen on an external monitor. Also, if you want to wirelessly stream to your TV, you’ll need to first physically plug the slabtop into a display to get to the AirPlay controls. You’ll also lose the built-in webcam, so if you’re doing any Zoom sessions, you’ll need an external one.</p><p id=\"bFJmse\">You could <em>also</em> lose access to Wi-Fi on certain older MacBook Pro models from 2008–2010 because the AirPort card and antennas were embedded in the display hinge. Thankfully, many of those models still have built-in Ethernet jacks from the era before Apple started taking away ports. (<a href=\"https://www.theverge.com/2022/3/10/22967995/apple-mac-studio-usb-a-ports-display-macbook-pro-imac-2022-connectivity\">Ports are back, BTW</a>.)</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jzIxnL1FTXc_w-mmMxyW5yA2AVE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342460/IMG_2B63280EFD14_1.jpeg\">      <cite>Image: Umar Shakir / The Verge</cite>      <figcaption><em>Bless my cousin’s heart for straight trusting me.</em></figcaption>  </figure></div><p id=\"fzrikO\">If you have a MacBook, you know, just sitting around, chillin’, happy as a clam...shell... you could make your own slabtop! Or you could be me and volunteer your cousin’s 2009 15-inch MacBook Pro while they aren’t around to supervise it. </p><p id=\"Jvaah5\">But if your cousin isn’t as forgiving as mine, perhaps the eBay route is your best bet. I found recently sold listings for broken Touch Bar MacBook Pros going for around $400, either because they had cracked screens or a <a href=\"https://www.theverge.com/2019/3/19/18271733/flexgate-display-problem-macbook-pro-apple\">problem with the flexible display ribbon cables</a>. But, hey, who needs flex cables anyway when we’re dropping dead weight?</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yINhXfl2ieJNjz6cNIGo4Vq1iVo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23344623/IMG_1898BB1E233A_1.jpeg\">      <figcaption><em>You can find plenty of MacBooks on eBay that have broken screens but are otherwise completely functional.</em></figcaption>  </figure></div><p id=\"5vYKmy\">Before we get started, make sure you have a toolkit with all the needed screwdriver bits: a pentalobe P5 to open up most MacBooks made 2012 or later, a Phillips 00 to open up most MacBooks 2012 or earlier; either way, you’ll want a full Torx set sizes 3-8 for various internal parts. You might also want a tri-wing Y1 driver to remove many 2010–2012 MacBook batteries (to avoid accidentally turning on your MacBook while working) or, in the case of the 2009 MacBook Pro, a pentalobe P6. It’s also nice to have a nylon pry tool and tweezers to safely pluck connectors and collect screws, or you could just grow your nails out for a few days as a substitute.</p><p id=\"ACz7xx\">You’ll also need to have a monitor or TV to use your slabtop and a means to physically connect them. If your Mac only has USB-C ports like my M1 MacBook Air, get a USB-C to HDMI cable or a USB-C hub / dock that has a video output. But if your Mac is a bit older like that 2009 MacBook Pro, you’ll need a cable that goes from mini DisplayPort to whatever your external monitor uses, such as HDMI, full DisplayPort, maybe even DVI.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nWW8BKTRemcxc_mkjCSGq9AxJ4I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345948/ushakir_220307_5107_0003.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>Here’s my cousin’s 2009 MacBook Pro plugged into monitor using a mini DisplayPort to HDMI cable.</em></figcaption>  </figure></div><p id=\"FSeAJO\">While I took apart the computers <em>using sheer instinct</em>, I did find a very good <a href=\"https://www.ifixit.com/Guide/MacBook+Air+13-Inch+Late+2020+Display+Replacement/142554\">M1 MacBook Air display removal guide</a> at iFixit and <a href=\"https://www.ifixit.com/Guide/MacBook+Pro+15-Inch+Unibody+Mid+2009+Display+Replacement/1725\">another one</a> for the 15-inch 2009 MacBook Pro. If you’re opening up a different MacBook or maybe even another laptop entirely (heck, you could make a Chromebox from a Chromebook if you wanted to), you should look for a guide online on how to take it apart — or be like me and don’t, that’s up to you! Please be advised: I take no responsibility for any damage or injury caused by your attempt.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/D3COej2Nzr5OrVZZG4RqcE4ex9U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345946/ushakir_220307_5107_0001.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>2009 MacBook Pro: The fan started spinning because I accidentally turned the computer on during surgery. Don’t forget to disconnect the battery.</em></figcaption>  </figure></div><p id=\"OTO3gv\">For the past decade’s worth of MacBooks, the first step is to open the bottom case. Flip the MacBook upside-down and remove all the bottom screws (as many as 10) with either the pentalobe or Phillips driver, depending on the model. Be sure to note where each screw goes since some are longer than others, and the wrong ones could cause damage.</p><p id=\"j88tHA\">You may still need to pry slightly before it opens — with my M1 MacBook Air and the 15-inch 2009 MacBook Pro, I just needed to grab the aluminum base at the back edge near the vents and pull — you’ll feel a couple snaps from clamps holding them together, but don’t worry, it comes off easily. Most other MacBook models released come apart the same way — except for one major anomaly in the 12-inch Retina MacBook. That model has its battery and logic board attached to the bottom case with sensitive ribbon cables connected between the slabs. For that, I would recommend following <a href=\"https://www.ifixit.com/Guide/Retina+MacBook+2015+Battery+Replacement/108512\">this guide</a> closely to avoid damage to the cable or battery.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UH9DHhhZC-gSMCRMAkvm2sFPpjU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345949/ushakir_220309_5107_0004.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>Disconnecting the M1 MacBook Air’s battery is as easy as flipping up the metal pull tab and pulling up.</em></figcaption>  </figure></div><p id=\"DJibaR\">The second step is to disconnect the battery. I made the mistake of skipping this step on the 2009 MacBook Pro and accidentally turned it on during surgery — better on my cousin’s MacBook Pro and not my MacBook Air, am I right? Anyway, for the 2009 MacBook Pro, I removed three pentalobe screws (tri-wing for the next few model years up), lifted the battery halfway up with its handy pull tab, then disconnected the battery.</p><p id=\"kgSsMK\">The 2011 MacBook Pro’s battery is much easier to disconnect; you don’t even need to take the battery out. Ditto the M1 MacBook Air’s battery: all it takes is a flip-up and pull of the metal locking handle of the battery connector. (See image above.)</p><p id=\"RayzSu\">The third step is to disconnect and remove anything that comes in the way of getting to the display hinge screws, including internal video connectors, antenna connectors, and — in the case of my M1 MacBook Air — even the antennas themselves. Don’t worry — after the display is removed, you can put the antenna back and still keep Wi-Fi connectivity for your slabtop, unlike my cousin’s machine. Removing all these parts can be tricky, so you might want to follow an online guide for your particular model.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZgLAZmhponVX6Zmabf4BwT9lIwc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345950/ushakir_220309_5107_0005.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>Disconnecting the antenna cables in the M1 MacBook Air. Don’t worry — these will go back when we finish up so you can keep Wi-Fi.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hn0rNFMn7iKiYYeF30ei18jncCw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345951/ushakir_220309_5107_0006.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>I removed a metal shield to reveal this display connector. Disconnect it and be mindful of it when taking out the antennas.</em></figcaption>  </figure></div></div></div><p id=\"cTR8oV\">The fourth step is to remove the display clamshell. For my M1 MacBook Air: with the display cable disconnected and the antennas out of the way, I pick up the laptop and open the clamshell <em>to </em>its widest point, maybe 130 degrees. I then place the laptop upside down with the keyboard slab fully on the desk’s top and the display clamshell hanging down and off the edge of the desk like a wing. Hold it so it doesn’t slide off the table while you perform the next steps!</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1jR_iEjnNIJ-JkDYrURbjQHoV5A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345952/ushakir_220309_5107_0007.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>Clamshell and antenna array removed from the M1 MacBook Air.</em></figcaption>  </figure></div><p id=\"Z55vOE\">With the Air, there are six Torx screws holding the clamshell to the keyboard slab — three on each side — I removed two from each side and then only removed the last two screws after I was sure I could keep the lid from falling. The screen won’t necessarily pop off, though. You’ve got to dislodge the hinge from the frame first, and my trick is basically just to push the laptop screen as if I’m closing it while it’s upside down on the desk. It should pop out when the lid is nearly perpendicular to the base.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lQ1cgvG6-u_YwdXYm-PnGbuK5_8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345947/ushakir_220307_5107_0002.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>2009 MacBook Pro: Small pieces were returned so the bottom case can be reinstalled.</em></figcaption>  </figure></div><p id=\"K0NWaw\">By the way, that step is a bit easier on the 2009 MacBook Pro. I kept the display open at a 90-degree angle off the desk instead of fully opening it, removed the screws, and then lifted the display straight up and off without any pushing or sliding.</p><p id=\"RKtjpG\">The slabtop is almost ready, but you’ll need to put a few pieces back in if you want to close it up again and have Wi-Fi. With my M1 Air, all the non-display parts, including the antenna and its connectors, went back in. I even put the display hinge screws back in for safekeeping. I then reconnected the battery and firmly pressed the bottom case cover back on, and it gave a satisfying snap. Now I’m only 10 screws away from the final product — my new slabtop!</p><div class=\"c-float-right\"><aside id=\"pb49MA\"><q>Command + F1 is your friend</q></aside></div><p id=\"uCBkBJ\">Did you succeed as well? If so, let’s go plug it in! You can connect it to a monitor or TV with the right cable, power it on, and you should get a picture on-screen in about the same amount of time it took on your built-in one — though, if it’s an M1 MacBook, you might not get a picture until it’s finished booting up. If the monitor gets to the login screen but only shows a wallpaper with nothing to click, it’s because the slabtop has phantom limb syndrome and thinks it should output to the primary built-in display, but you can hit Command + F1 to switch to mirror mode, which should then reveal the main screen. You can also now mirror your screen wirelessly to an AirPlay-compatible TV or streaming box. Once it appears on the TV, disconnect the cable and enjoy the freedom of a slabtop on your couch!</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yGbei_2I5TesoWfH7vLGTEJyH5M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345956/ushakir_220325_5107_0010.jpg\">      <cite>Photo by Umar Shakir / The Verge</cite>      <figcaption><em>A clean break.</em></figcaption>  </figure></div><p id=\"KDd46g\">And as you walk over to the couch, you could take a moment to appreciate how unexpectedly lightweight the slabtop is and how the design sort of intrigues the mind and invites you to carry it around. I could see this actually become a real product Apple makes someday, maybe with a design that includes some sort of handle like Apple’s <a href=\"https://apple-history.com/ibook\">colorful iBook</a> from 1999. A handle for the slabtop would compel you to carry it around and develop a bond — which reminds me of the decision Nintendo made in 2000 to add a <a href=\"https://gcelite.tripod.com/Focus.html\">handle to the GameCube</a>.</p><p id=\"LtWycv\">So am I keeping my slabtop? My wife asked me when I plan to put my laptop back together, and it’s a tough decision — I really enjoy holding my slabtop, carrying it around, and showing it to people as they gaze at it in child-like wonder. I did find out that I can’t easily carry it in a backpack because any key that gets pressed will power it on unintentionally during transport. </p><p class=\"c-end-para\" id=\"jtrCc2\">But it’s OK for now; I’m having a great time watching videos, reading articles, and, yes, <a href=\"https://www.theverge.com/2022/3/8/22958569/apple-mac-studio-m1-max-ultra-display-preorder-how-to-buy-price-release-date\">pricing out</a> a Mac Studio with Studio Display, all from the comfort of my couch.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WPc-7xfz83EqWo49XifRRK3Ly9w=/0x318:3000x1889/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23345435/VRG_ILLO_5107_MacBookAir_Decapitation.jpg",
  "description": "Headless MacBooks have a bright future",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}