{
  "title": "Honor Magic4 Pro review: hardware highs, software stumbles",
  "url": "https://www.theverge.com/23068438/honor-magic4-pro-review",
  "date": "2022-05-12T20:00:00.000Z",
  "author": "Jon Porter",
  "content": "  <p>This flagship has some neat ideas, but it’s lacking polish</p> <p class=\"p--has-dropcap p-large-text\" id=\"WOWevH\">Once a sub-brand of Chinese phone giant Huawei, Honor has been going it alone since being <a href=\"https://www.theverge.com/2020/11/16/21570744/huawei-honor-sale-announced-us-sanctions\">spun out in late 2020</a>. So far, it’s released the <a href=\"https://www.theverge.com/22752483/honor-50-review-108-megapixel-quad-camera-120hz-oled-display\">midrange Honor 50 globally</a>, but various difficulties have prevented the company from coming out with a true flagship smartphone in the west since becoming an independent company. It even went as far as to announce global pricing for the <a href=\"https://www.theverge.com/2021/8/12/22621367/honor-magic-3-pro-plus-price-specs-features-cameras\">Magic3 last August</a>, but the phone ended up only being available in China. </p><p id=\"PA5d5n\">That changes with this year’s Magic4 Pro, which will be available to preorder in the UK from May 13th and will ship on May 27th from £949.99. (Honor says it currently has no plans to release the phone in the US.) It’s a price point that sees Honor’s phone compete directly with Samsung’s excellent <a href=\"https://www.theverge.com/22955139/samsung-galaxy-s22-plus-review\">Galaxy S22 Plus</a>, the 256GB storage variant of <a href=\"https://www.theverge.com/22750387/google-pixel-6-pro-review\">Google’s accomplished Pixel 6 Pro</a>, and <a href=\"https://www.theverge.com/22684033/apple-iphone-13-pro-max-review\">Apple’s ever-reliable iPhone 13 Pro</a>. Those are three excellent choices for prospective phone buyers and represent tough competition for Honor’s latest. </p><p id=\"uGExTI\">On paper, the Magic4 Pro is competitive. It’s got a trio of high-resolution rear cameras, super-fast 100W wired charging, <em>and</em> support for 100W wireless charging, as well as a big bright, colorful screen with a fast refresh rate. But while I liked a lot of these features individually, Honor’s software struggles to hold up its end of the bargain. </p><div id=\"uSgwy5\"><div data-anthem-component=\"scorecard:11188323\"></div></div><p id=\"lWqdzF\">From the front, the Honor Magic4 Pro looks like most other Android flagships in 2022. It’s got a large 6.81-inch OLED display with a resolution of 1312 x 2848, a peak brightness of 1000 nits, and a maximum refresh rate of 120Hz. It gets plenty bright, and it’s lovely and colorful. There’s a pill-shaped hole-punch cutout on the top left for a 12-megapixel selfie camera and 3D face unlock hardware, and there’s an ultrasonic fingerprint sensor around two-thirds down the display. </p><p id=\"iGEhc8\">Honer is calling this a “quad-curved” screen, but it only really curves around the left and right sides of the phone, and I wish it wasn’t curved at all. Sure, the curves arguably give the phone a more premium feel, and I didn’t have any problems with accidentally touching its sides like with some curved screen phones. But ultimately, I just ended up losing the sides of apps and the top and bottom of videos around the curved edges, with very little benefit. The phone has an IP68 rating for dust and water resistance, which means you shouldn’t have any issues using it in the rain. </p><p id=\"ylEQGr\">Out of the box, the Magic4 Pro runs Android 12, but Honor is only committing to two years of Android updates and two years of security updates. In contrast, Samsung now offers up to <a href=\"https://www.theverge.com/2022/2/9/22923577/samsung-galaxy-unpacked-android-upgrades-4-years\">four years of Android updates</a>, <a href=\"https://www.theverge.com/2021/10/19/22735485/google-pixel-6-three-years-android-updates-security-feature\">Google offers three</a> (or five if you include security updates), and Apple is still releasing new iOS updates for 2015’s iPhone 6S. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dBbzIfc5u4x14jlKliJoB8XIuyY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447750/jporter_220505_5197_0007.jpg\">      <figcaption><em>The display curves round the left and right sides of the phone.</em></figcaption>  </figure></div><p id=\"s2n6tK\">I don’t normally spend much time talking about the biometric security options built into phones these days, but the absolutely terrible time I had setting up fingerprint unlock on the Magic4 Pro is worth mentioning. During initial setup, I encountered a software bug that led to my attempts to register my right thumbprint failing over a dozen times. Curiously, when I manually added three more fingerprints in settings after initial setup, I didn’t encounter any such issues, so I suspect the problem is software-based rather than with the Qualcomm 3D Sonic Sensor Gen 2 that Honor’s using in this phone. </p><p id=\"4zYTb0\">The Magic4 Pro’s 3D face unlock feature is more seamless and, in a side-by-side test with an iPhone 12 Pro, was only a fraction of a second slower in ideal conditions. But when conditions were more challenging, such as when unlocking in a dark room, when looking from an angle, or when wearing a hat, Honor’s face unlock would sometimes stumble, and overall, its implementation didn’t feel as reliable as Apple’s.</p><div class=\"c-float-right c-float-hang\"><aside id=\"uEcciq\"><q>Face unlock is fast in good conditions</q></aside></div><p id=\"9CRDsQ\">Battery life with the 4,600mAh cell is reliable, and the phone’s 100W fast charging is even more so. I averaged a little over five hours of screen on time out of the Honor Magic4 Pro and would routinely end the day with over 40 percent of charge left. It took a day of heavy usage, including a half-hour video call and an hour and a half of using the phone for cycling directions, for me to see the phone reach zero at around 11PM. When I did a charging test, the 100W charger that Honor provides in the box did a great job. It hit the 46 percent mark just 15 minutes after I put it on charge at 0 percent (aka just enough time to take a shower) and reached 100 percent just after the half-hour mark. </p><p id=\"as4UXR\">The Honor Magic4 Pro also does 100W wireless fast charging, which in my test charged the phone to 54 percent in just 15 minutes of charging and to 100 percent at the 31-minute mark. But I’d be surprised if many people actually make use of this feature because actually getting these speeds involves buying both Honor’s 100W wireless charging stand <em>and</em> its 100W-capable power brick separately (the power brick that comes in the box for the wireless charging stand can only handle 80W fast charging). Honor did not respond to questions about the pricing of these two accessories, but I’d wager they’re unlikely to come cheap.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hZUWjIhwr28fQIITlLCF46nQKDg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447751/jporter_220505_5197_0008.jpg\">      <figcaption><em>It’s a relatively large phone in the hand.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/iIhqx7e3OOJw9PV6JvnXWMfm04A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447749/jporter_220505_5197_0006.jpg\">      <figcaption><em>USB-C, no headphone jack.</em></figcaption>  </figure></div></div></div><p id=\"C1Y5DC\">Honor’s Magic UI 6 software adds a couple of interesting features to Android 12, but for the most part, I got frustrated at the bloat. For starters, the phone comes pre-installed with around half a dozen third-party apps of questionable utility, such as Booking.com, TrainPal, Trip.com, and WPS Office, alongside first-party Honor apps like Honor Store and Honor Club. In other places, I consistently stumbled into supposedly helpful shortcuts when I wasn’t looking for them. For example, the phone asks you to slide your finger up on the display to access the home screen once it’s unlocked. But if you start your swipe too far down, you’ll instead open a shortcut menu with links to a voice recorder app and calculator, and I accidentally activated this shortcut an annoying amount.</p><div class=\"c-float-left c-float-hang\"><aside id=\"79Xjl0\"><q>One feature attempts to make phone calls inaudible to others</q></aside></div><p id=\"rLg51R\">Another feature is a phone calling technology it calls “Just Say to Me,” which aims to adjust the sound coming out of the phone’s earpiece during calls to make it inaudible to those around you. Honor says the feature works using “AI Directional Sound” technology, using the screen itself to transmit low and medium-frequency sounds, leaving the earpiece to handle high frequencies, allegedly resulting in less sound leakage. To my ear, it sounds like it’s adjusting the EQ of the incoming voice, reducing the volume of lower frequencies that might carry further. The catch is that it only works when you have the phone’s call volume set to 60 percent or below. I recorded myself using it, and it was certainly harder to hear the person on the other end of the call with the feature turned on, but it’s hard to know exactly how much of this was just down to the fact that I had to turn the volume down to get the feature to activate. </p><p id=\"h4gG7Z\">In some cases, it was possible to tweak away some of my annoyances with Honor’s software. There’s a simple toggle to reintroduce the standard Android app drawer (disabled by default), and SwiftKey is easy enough to replace with Gboard. Honor’s software also aggressively shuts down apps running in the background if it doesn’t think you’re using them, which tripped up a jogging app I was using to keep time — but thankfully, you’re able to manually exclude all or just some apps from this behavior. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mNI7hY8FXfp3ExyedqfPd_G15gc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447752/jporter_220505_5197_0009.jpg\">      <figcaption><em>Its camera bump is a love-it-or-hate-it affair.</em></figcaption>  </figure></div><p id=\"FhBmT9\">But even when I tweaked its software to my liking, using Honor’s Magic UI often didn’t feel like I was using a smartphone costing almost £950 equipped with Qualcomm’s latest flagship Snapdragon 8 Gen 1 processor. Its app drawer stuttered slightly when I flipped it open, and apps would sometimes get confused and have to reload their contents when I switched to them quickly. They’re small hiccups, but given how good midrange phones have gotten, it’s not great seeing these crop up in a premium flagship. Internally, the Magic4 Pro has 8GB of RAM and 256GB of storage, which puts it on par with the Pixel 6 Pro. </p><p id=\"2C7jSY\">This neatly brings us to the Honor Magic4 Pro’s camera system, which is housed within a large circular camera bump on the rear of the phone. People who I showed the phone to were split on the design, but I like the way it makes a statement out of its rear camera bump rather than trying to minimize it. You get three rear cameras on the Magic4 Pro: a 50-megapixel main; a 50-megapixel ultrawide with a 122-degree field of view; and a 64-megapixel telephoto with a 3.5x optical zoom. It’s nice to see Honor buck the trend of manufacturers pairing a high-resolution main sensor with much lower resolution secondary cameras. </p><div id=\"DFNU94\"><div data-anthem-component=\"gallery:11188339\"></div></div><p id=\"d8de3m\">In practice, daylight photography is good, which is where most smartphone manufacturers are at in 2022. Honor’s tuning tends to prioritize punchy colors and sharp edges, but with its well-specced sensor, it’s got enough detail to work with that I think the effect works. It even does a good job with faces, leaving my skin tone looking natural rather than overly brightened. The hi-res sensors behind the ultrawide and telephoto lenses mean this performance continues with the secondary cameras. Where other phone cameras might get grainy or low-detail, Honor’s shots maintain the same quality level. </p><p id=\"vpphKf\">I was less impressed with performance in low light, where I struggled to get the same amount of detail out of the Honor Magic4 Pro. It did a good job with color accuracy, and at first glance, I was impressed by the lack of visible noise. But look closer, and it looks like Honor’s software is trying to smooth out as much film grain as it can, and it can make images look like soft watercolors when you look closely. Switch to the ultrawide or telephoto cameras, and performance is roughly the same as the main camera’s, which is actually pretty good going considering the degraded performance you often get from the secondary cameras in other phones.  </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4yZycQmfx2D0JpQOVqF2q_gGg4s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447746/jporter_220505_5197_0003.jpg\">      <figcaption><em>It took some tweaking before I had the phone set up to my liking.<span class=\"ql-cursor\">﻿</span></em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6GVnqV4Yud1xV7pG6F4e6mHRmq4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23447747/jporter_220505_5197_0004.jpg\">      <figcaption><em>Honor promises just two years of updates.</em></figcaption>  </figure></div></div></div><p id=\"oCF4yy\">Honor has done a good job at speccing out the hardware of the Magic4 Pro. Its cameras are high resolution, it charges incredibly fast, its screen is beautiful (curved edges notwithstanding), and overall, the device’s hardware succeeds at having that premium flagship feel. If you want a phone that can wirelessly charge faster than many other phones can do over a wired connection, then the Honor Magic4 Pro is very happy to oblige. </p><p class=\"c-end-para\" id=\"1pT1qw\">But I was never won over by the experience of actually using the Honor Magic4 Pro. Whether it was the occasional software hiccups, the aggressive background app management, or the lock screen shortcut that got in the way too often, it often felt like wearing a pair of shoes that were just half a size too big. When a phone costs as much as a Samsung or Apple flagship, you might find a better fit elsewhere. </p><div><div id=\"q910fA\"><div data-anthem-component=\"aside:11188336\"></div></div></div><p id=\"oFKnMg\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8LFCC5F-683xN30R3RiXq6fTpwg=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23447748/jporter_220505_5197_0005.jpg",
  "description": "Not quite a fully cohesive package",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}