{
  "title": "Horizon Forbidden West’s incredible world is easy to get lost in",
  "url": "https://www.theverge.com/22929852/horizon-forbidden-west-ps5-review",
  "date": "2022-02-14T08:01:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DaKtPDfy11Tpy-nSZil01cMom5M=/0x0:3240x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70506191/Horizon_Forbidden_West_20220210162112.0.jpg\" />    </figure>  <p>Where most open world games can offer a paralyzing amount of choices, Horizon Forbidden West doesn’t feel too overwhelming</p> <p class=\"p--has-dropcap\" id=\"3LNsdE\">I didn’t much care for Aloy, the main character of <em>Horizon Forbidden West</em>. I think she’s the least interesting person in the cast of characters who surround her, and her serious-yet-aloof nature doesn’t really endear her to me. And though the world <em>Horizon</em> presents is intriguing, the story constructed for it falls victim to some late-game twists that defy explanation. And yet, despite being less than enamored with the story and characters, the thing I primarily play video games for, I willingly and enthusiastically spent 64 hours across two weeks hunting, exploring, crafting, and fighting and would happily do so again.</p><p id=\"cVBtGf\"><em><strong>This review contains light spoilers.</strong></em></p><p id=\"eT1XNP\"><em>Horizon Forbidden West</em> picks up six months after the end of <a href=\"https://www.theverge.com/2017/2/20/14665114/horizon-zero-dawn-review-ps4\"><em>Horizon Zero Dawn</em></a>. Aloy, faced with a new threat to the planet, leaves her friends behind and heads west, looking for the clues she needs to save the world. One of the most impressive things about <em>Forbidden West — </em>and the thing that sucked me in immediately — is the world itself. </p><p id=\"D47wzu\">There’s a fascinating seamlessness to it. You could, at any time, start at the bottom of a sandy gorge and just climb up until you’re at the top of a snowy mountain, then climb back down and wind up in a jungle marsh. So much of my gameplay time came from this kind of exploration. Since the actual plot left a lot to be desired, I was content to essentially make my own game. I would look at a mountain or tall ridge and wonder what’s up there, running into platforming puzzles and mini-quests where I’d save some random travelers from a pack of machines before I continued my journey up. Then, at the top of whatever peak, I’d take a bunch of pictures, damn near moved to tears by the skybox, before coasting down on Aloy’s paraglider — excuse me, <em>shieldwing</em> — taking a bunch more pictures because holy crap, this game is <em>beautiful</em>. (A little note about me: I love the sky. Looking at a sky — real or rendered — makes me very emotional, and <em>Horizon Forbidden West</em> has some of the best skyboxes I’ve ever seen.)</p><div id=\"GMcrqW\"><div data-anthem-component=\"gallery:11026773\"></div></div><p id=\"7TwcLo\">Maybe it’s because we’re still in a pandemic, making outside activity damn near verboten. Or it could be because I’m currently covered under a foot of snow. But even the facsimile of going somewhere or seeing any color other than stark, icy white gives me a capital “E” emotion. I would often stop whatever quest I was working on to absorb the sheer natural beauty of the world, awed by the incredible power of my PS5. There’s a moment early in the game in which Aloy’s standing on the top of a tower in the rain, and I could see the individual raindrops pinging off her breastplate and hear the “plink plink plink” sound coming from the DualSense. It was a sensory experience unlike anything I’ve seen before and definitely makes a case for <em>Forbidden West </em>being a bona fide “next-gen” console experience. </p><p id=\"19sZZ0\">My fascination with<em> Forbidden West</em> extends beyond its technical beauty to the inhabitants of the world itself. I am intrigued by the machine animals that roam the land fulfilling some ecological need and how humans have organized themselves in this post-apocalyptic world blissfully ignorant of the knowledge of the civilizations that came before. Once again, I created a game within a game. Aloy, instead of the self-tortured clone of Elizabet Sobeck, becomes a traveling vagabond — learning the songs of the pastoral Utaru people or the creation myths of the warlike Tenakth. She’d set right the wrongs that plagued them before disappearing at duty’s end, moving on to the next village.</p><div class=\"c-float-right\"><aside id=\"qsu9al\"><q>I could see the individual raindrops pinging off her breastplate and hear the “plink plink plink” sound coming from the DualSense</q></aside></div><p id=\"Hl3qq6\">The machines that roam the land make each encounter a self-contained puzzle that really clicked for me. You could, if you wanted to, brute force your way to victory by beating them down with the armory of weapons Aloy has at her disposal. Or, you could try to solve the puzzle the enemy presents. Each machine has different strengths and weaknesses. Using the <em>Forbidden West</em> version of a smartphone called a Focus, you can scan your enemies, revealing information about what kind of elemental weaknesses it has and whether or not it contains any components necessary for upgrading your gear. Then, in the fight, you can maximize that knowledge to defeat enemies efficiently and lucratively. I got a lot of satisfaction using elemental effects to my advantage, doing single-digit damage to enemies with the weaker status-effect arrows before unleashing holy hell once their elemental resistance was fully depleted. When I didn’t want to roll out arrows blazing, I also got the biggest kick stealth killing my way to victory. I could leap out of tall grasses, deploying one-hit kills, or destroy my targets with an extremely satisfying “boom” by laying traps in an unsuspecting — and honestly rather stupid — enemy’s path. There are a lot of ways to kill in <em>Forbidden West,</em> and all of them are fun. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LDLoOzNo_uloTelUaBdfUl_l1tg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23236406/hfw2.jpg\">      <figcaption>Sniping a machine from stealth makes for a satisfying kill.</figcaption>  </figure></div><p id=\"pTbhj4\">As much as I don’t care for Aloy as she’s written, she controls like a dream. I appreciate that <em>Forbidden West</em>’s platforming doesn’t require you to push a button to latch onto surfaces; she naturally clings to them. And I love how she climbs, occassionally snapping her body like a wet towel to leap between horizontal surfaces, whereas other platformer “heroes” (<em>cough</em> Nathan Drake <em>cough</em>) have to shimmy their arms like dirty plebes. </p><p id=\"e7fFsr\">The platforming puzzles are fun to complete but can be frustratingly obtuse. There were many points where I got stuck for longer than I thought acceptable because the way forward didn’t make sense within the context of the puzzle or was simply invisible. If I am in a ruined building, trying to get to an unreachable ledge, the way to reach that ledge should be within the building or its immediate perimeter, not so far outside the building as to be completely invisible or missable to the player. I am convinced the developers are not seeing heaven because of a puzzle that required me to interact with a switch that was both too far outside the puzzle area to be considered relevant <em>and</em> didn’t initiate an interact prompt until I was almost on top of it. </p><div class=\"c-float-right\"><aside id=\"T9PCLv\"><q>There are a lot of ways to kill in <em>Forbidden West,</em> and all of them are fun. </q></aside></div><p id=\"PCh6Ls\">I wanted to like the plot of <em>Forbidden West</em>. Some of its best moments reminded me of <em>Mass Effect 2</em>. Throughout the game, you “recruit” people to help you in your quest to save the world. In the first quarter of the game, you unlock a Normandy SR2-esque base of operations that your companions slowly transform into a cozy home. There you can chat with the friends you accumulated, hear more about their people and motivations, learn more about the world pre-Zero Dawn, or just chill, playing the <em>Forbidden Wes</em>t equivalent of chess. You can even accept personal quests akin to <em>Mass Effect 2</em>’s loyalty missions that help your companions grow. (Don’t worry, not completing any of these quests won’t result in an unsuspecting death during the final mission.) My only wish is that your companions could actually accompany you out in the field beyond their personal errands. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-WB-CQYtuquEKdGFYL7nNWqKG7c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23236409/hfw3.jpg\">      <figcaption>Kotallo is one of my new favorite companions.</figcaption>  </figure></div><p id=\"vKw0zN\">There was one companion that I could not spare time of day for: Erend. I felt bad because he was one of Aloy’s OG friends from the first game, but I found myself more attracted to the new people. There’s Zo, the cool Black lady who refuses to meekly accept death at the hands of the bio-plague like the rest of her people, or Kotallo, the prickly Tenakth who hates you at your first meeting but soon comes to respect you as a valuable ally. During the game’s final mission, you’re paired up with Erend, and I felt better because we’d finally get some face time. But I quickly learned I was right to neglect him. Erend. Is. The. Worst. Throughout our time together, all he did was bitch. When I was hiding in the grass going for a stealth kill, he would incessantly nag me, “Aloy, ready when you are,” or “Aloy, can we kill them yet.” When I’d get turned around, he’d badger me, “Aloy, let’s go already.” Erend made me regret that there’s no friendly fire in <em>Forbidden West</em>.</p><p id=\"dJVy8F\">There are a lot of things that frustrated me about <em>Forbidden West</em>’s story that I won’t reveal because of spoilers. There’s a particular relationship billed as the “heart and soul” of the game, but I got neither heart nor soul out of it at all. Aloy, even at her best, keeps her friends at arm’s length and carries this tortured, “woe is me, I have such a burden” vibe. The story reveals that Aloy gets it honest from her genetic ancestor Elisabet Sobeck, but even presented with this information, Aloy doesn’t seem to learn from it. Her interactions with her companions don’t get any warmer. You’re not given prompts to interact with their dialogue as you can in other conversations in the game, so you can’t joke with them or confide in them. When she talks with them, it feels like a maintenance check-in akin to, “I am asking how you are doing to perform the bare minimum of friendship.” Meanwhile, her friends are falling in love with each other or trading barbs across the base, while Aloy herself seems distant from it. </p><div class=\"c-float-right\"><aside id=\"NuW6eR\"><q>Erend made me regret that there’s no friendly fire in <em>Forbidden West</em></q></aside></div><p id=\"PbzmEJ\">In the final mission of the game, the story takes an extremely hard left turn. There are sudden but inevitable betrayals, and those who the game presents as the villains are supplanted at the last minute by bigger, more powerful villains. It’s a case of power creep that becomes absurdly comical when you realize you and all your allies are armed with metal-plated sticks and stones. It’s good that I didn’t play this game for the story — it would have let me down.</p><p id=\"XDUtdw\">Open-world games tend to overwhelm me as I’m the kind of person who likes to keep her inbox zeroed out and her notifications cleared. When I see all the little symbols indicating the 51 million different things you can do, find, or fight on a fuck-off huge map, I feel a panic attack coming on. With that in mind, <em>Horizon Forbidden Wes</em>t shouldn’t be my kind of game. </p><p class=\"c-end-para\" id=\"vZytzS\">But after completing <a href=\"https://www.theverge.com/2022/1/11/22877031/final-fantasy-xiv-endwalker-review-square-enix-pc\"><em>Final Fantasy XIV: Endwalker</em></a>, I’ve been searching for something to take up the time that game occupied in my life. I needed something meaty that entertained me while not asking me to invest too much emotion. I wanted something I could play through without being totally mentally present as I recovered from <em>Endwalker’</em>s emotional ravishing, and <em>Horizon Forbidden West</em> perfectly filled that need. It was the video game equivalent of the post-coital cigarette that I’m looking forward to smoking for another 60 hours.</p><p id=\"YQ0Zzo\"><small>Horizon Forbidden West </small><small><em>launches on February 18th on the PS4 and PS5.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0IBV82ABzj03j2Ki6AoxItzhDRQ=/0x128:3840x2138/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23238942/Horizon_Forbidden_West_20220210162112.jpg",
  "description": "The skyboxes in this game are so pretty I almost cried.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}