{
  "title": "Hori’s Split Pad Pro Attachment for the Switch costs $20 too much",
  "url": "https://www.theverge.com/23007610/hori-split-pad-pro-attachment-nintendo-switch-price-features-review",
  "date": "2022-04-04T18:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "  <p>The pads are still an essential accessory — but the attachment? Not so much</p> <p id=\"7AdwXA\">You might already know about Hori’s $59.99 Split Pad Pro, which reimagines the Nintendo Switch’s Joy-Con controllers as if they got jacked in the gym. Hori launched the controller <a href=\"https://www.theverge.com/2019/9/18/20871866/hori-split-pad-pro-controller-nintendo-switch-daemon-x-machina-review\">a couple of years ago</a> alongside <em>Daemon X Machina. </em>It’s made for people with big hands, or rather, anyone whose hands feel cramped using the Switch’s included controls. Like Joy-Cons, the Split Pad Pro slides into the sides of your Switch, but it’s about twice as wide, thicker, and has ergonomic grips and contours. Every button, trigger, and stick is larger and, thus, easier to control. With those changes, the Switch feels like an entirely different (and better) console to play on the go.</p><p id=\"wdiJPu\"><a href=\"https://www.amazon.com/Nintendo-Switch-Split-Ergonomic-Controller-Handheld/dp/B09KYCT1RJ/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Since it debuted in late 2019, Hori has released several colorways</a>, but this week, the company launched an entirely new accessory. It’s called the Split Pad Pro Attachment, which bundles the Joy-Con-like gamepads with a wired USB attachment that can let them be used with your Switch while it’s in docked mode. </p>  <figure class=\"e-image\">        <img alt=\"Hori Split Pad Pro Attachment\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7Q0o6qgx31EWoU_1EYzO1EgigGE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23334094/cfaulkner_141231_5091_0001.jpg\">      <figcaption><em>The headphone jack is mounted on the bottom of the attachment, with buttons to adjust volume close by.</em></figcaption>  </figure><p id=\"lLoM8h\">The attachment is light on extra features considering <a href=\"https://www.amazon.com/HORI-Nintendo-Switch-Split-Pad-Attachment/dp/B09Q5QBRZV?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">its $79.99 price</a>, outside of giving you a wired controller option. It offers a headphone jack, and there are buttons to adjust volume or mute your headphones’ mic, if it has one. That’s really the entire pitch for this new bundle, and strangely, the attachment can’t be purchased separately.</p><p id=\"SO9I7M\">There’s little reason for current Split Pad Pro owners to feel compelled by the attachment, but it’s more alluring for first-time buyers. Although, if you spend more time using the Switch on the go than docked, I’d suggest just getting the gamepads to save some money. For such a pricey accessory, it feels limiting to be connected to the Switch via a cable, not to mention that headphones will dangle another cable between you and the TV. And depending on your gaming setup, the nearly 10-foot-long cable may not be long enough.</p><div id=\"kRE5WH\"><div data-anthem-component=\"scorecard:11125672\"></div></div><p id=\"QXhuDu\">Hori would likely make the valid argument that the $79.99 price matches the cost of buying a set of Joy-Con controllers. But even so, the Split Pad Pro pads themselves are seriously compromised in terms of features compared to Nintendo’s Joy-Con. They can’t work wirelessly (as in, while detached from your Switch), and they lack rumble, NFC for Amiibo, and gyroscopic aiming for games that support it. (Though each features a remappable rear paddle for when they’re connected directly to your Switch.) As far as customization goes, the paddle on the left gamepad can be mapped to any function on the left Split Pad Pro, save for the minus and screenshot buttons. It’s similar on the right side, only omitting the plus and home buttons. </p><p id=\"KB6EZs\">Yet, despite its flaky value, I enjoy using the Split Pad Pro Attachment — largely because of how good it feels to use. If you love <a href=\"https://www.theverge.com/circuitbreaker/2017/2/24/14699044/nintendo-switch-pro-controller-hands-on-preview\">Nintendo’s wireless Switch Pro controller</a> as much as I do, this Hori controller emulates it nicely as a comfy, regular-sized gamepad. The Split Pad Pro’s analog sticks, triggers, and buttons feel just as responsive as Nintendo’s, with the added benefit (or annoyance, depending on the person) of being wired and never needing to recharge.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Hori Split Pad Pro Attachment\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0GqvOGJidyX57NNJqBvhcyjk3C0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23334095/cfaulkner_141231_5091_0002.jpg\">      <figcaption><em>The Split Pad Pro remains an excellent purchase, with big buttons and comfy grips.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Hori Split Pad Pro Attachment\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UTC1aKyu5jwios8i_Us1ISgfAUY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23334096/cfaulkner_141231_5091_0003.jpg\">      <figcaption><em>The attachment’s cord is around 10 feet long, which may or may not be suitable for your gaming setup.</em></figcaption>  </figure></div></div></div><p id=\"2Mg8do\">Oddly enough, I also enjoyed using it as a PC gamepad to play games like <em>Elden Ring</em>. With that game, I didn’t mind this product’s lack of vibration. Steam recognized it right away, and if you can get past some of the face buttons not matching up with what’s on-screen, it’s a seamless experience — at least in terms of controls. While the attachment can increase or decrease the volume in Windows, audio passthrough with its headphone jack doesn’t work. It’s tough to call that a flaw in a product that’s meant more as a Switch accessory, but it’s disappointing nevertheless.</p><p id=\"fX0A5I\">Whenever I showed the Split Pad Pro Attachment to people in our office, the initial delight became confusion as I explained the pricing and just how little the attachment itself is capable of. It’d be a slightly different story if Hori started to include it alongside the Split Pad Pro for a smaller price difference. But as it stands, the Split Pad Pro pads are the only essential aspect of this bundle, not the attachment.</p><p id=\"MZbe6H\"><em>Photography by Cameron Faulkner / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1rsrS7LjCn3HZ8O6OpOWFOJAgWs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23334097/cfaulkner_141231_5091_0004.jpg",
  "description": "Too few new features with a high $79 price.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}