{
  "title": "Hot Pod Summit is back at On Air Fest 2022!",
  "url": "https://www.theverge.com/2022/2/16/22933033/hot-pod-summit-on-air-fest-2022-event",
  "date": "2022-02-16T15:16:34.000Z",
  "author": "T.C. Sottek",
  "content": "      <figure>      <img alt=\"Ashley Carman, editor of Hot Pod, pictured next to the hot pod logo \" src=\"https://cdn.vox-cdn.com/thumbor/T32n0y4CszCS_J5fYZdbzvEDmlY=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70516644/Hot_Pod_Site_Post.0.jpg\" />        <figcaption>Ashley Carman, editor of Hot Pod</figcaption>    </figure>  <p id=\"I4vZjJ\">We’re thrilled to announce that <a href=\"http://onairfest.com/sessions/hot-pod-summit\">Hot Pod Summit</a> — our invite-only event for the people pushing the audio industry forward — is returning to <a href=\"http://onairfest.com/\">On Air Fest</a> at the gorgeous Wythe Hotel in New York City. The day-long gathering on February 24th will be hosted by <em>The Verge’s </em>senior reporter Ashley Carman and will feature programming on the biggest topics in audio, including podcast subscriptions, competing with big tech, moderation, and more.</p><p id=\"dCqfvv\">This is <em>The Verge’s </em>first Hot Pod Summit since acquiring the newsletter in 2021, and we couldn’t be more excited to keep this important event going. We’re putting on the event with <a href=\"http://workxwork.com/\">our partners at work x work</a>; this marks their 5th consecutive year producing the event. And if you want to see what On Air Fest is all about, tickets are on sale and available at <a href=\"http://onairfest.com/\">OnAirFest.com</a>, with speakers including <em>Radiolab</em>’s Jad Abumrad, Jane Goodall, <em>Object of Sound’</em>s Hanif Abdurraqib, <em>Death, Sex &amp; Money’</em>s Anna Sale,<em> For Colored Nerds’</em> Eric Eddings and Brittany Luse, <em>Keep It’</em>s Ira Madison III, and many more.</p><p id=\"vlAroI\">Of course, Hot Pod Summit is just one part of experiencing everything we have to offer on the future of audio. To stay in the loop with industry-leading analysis, reporting, and more, be sure to subscribe to the Hot Pod newsletter below:</p><aside id=\"vXiOFg\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside><h2 id=\"thtkn0\">Hot Pod Summit programming</h2><h3 id=\"BnSIqA\">New money in audio: subscriptions, audiobooks, and IP</h3><p id=\"0vqtUt\">In just the past year, the two biggest podcast platforms — Apple and Spotify — introduced subscriptions widely to their users. Is this the start of a new era? Plus, can selling IP build a business, and what can the industry learn from audiobooks? Pushkin Industries CMO Heather Fain, QCODE CEO Rob Herting, and Tenderfoot TV co-founder Donald Albright join to discuss. </p><h3 id=\"xVEy5U\">Competing with Big Tech: how to recruit and retain talent when you’re up against the giants</h3><p id=\"nt5DFG\">More tech companies are entering the podcast space and with that comes not just competition for shows and listeners’ attention, but also for talented employees. What can public media and independent shops offer new recruits? LWC Studios founder and CEO Juleyka Lantigua Williams, Multitude CEO Amanda McLoughlin, and PRX CEO Kerri Hoffman discuss mission statements, unions, and sharing ad revenue, among other ideas.</p><h3 id=\"LiA9Tk\">Automated ads: The move to programmatic and how it might change podcasting forever</h3><p id=\"6oKN8V\">The podcasting industry has often relied on host-read ads, brokered by personal relationships between podcasters and brands. But the industry is looking to scale and part of that journey hinges on automating and targeting ads. There will inevitably be bumps along the way and bigger questions around how this might change podcasting forever. Oxford Road CEO and founder Dan Granger and Acast head of automation for the Americas Elli Dimitroulakos discuss. </p><h3 id=\"CCCNA3\">YouTube formally enters the podcasting arena: now what?</h3><p id=\"GrOGMB\">Lots of podcasters already use YouTube to distribute their shows, but late last year, the company made its first official podcast hire seemingly in an effort to take on a larger role in the space. In this chat, we’ll talk to popular tech YouTuber and <em>Waveform: The MKBHD Podcast</em> host Marques Brownlee and Rooster Teeth’s head of The Roost Podcast Network AJ Feliciano about what podcasters even need or want from YouTube and what the platform could do.</p><h3 id=\"gD1el1\">Should podcast platforms be doing more to moderate?</h3><p id=\"yBcYEu\">As the podcast industry grows and more people listen, concerns around what’s being shared and promoted on podcast apps are intensifying. What obligation do podcast platforms have to moderate the shows they distribute? How does that change when platforms sign exclusive deals? <em>Platformer</em>’s Casey Newton joins journalist Evelyn Douek for a panel discussion.</p><h3 id=\"ET2A1L\">Independent creators making it work</h3><p id=\"p645D9\">Although corporations increasingly see money-making opportunities in podcasting, various podcasters have set out on their own, appealing directly to their fans. We’ll chat with the podcasters who are paving their way — maintaining Discords, running Patreons, and recording bonus content — in the space.</p><p id=\"rjOLGh\"><a href=\"https://www.theverge.com/2022/2/15/22934828/the-verge-and-on-air-fest-announce-hot-pod-summit-lineup\">Read our full press release for Hot Pod Summit here.</a></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/toqjJKSxoieO_H_ghFzMzVCMRkI=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22876078/Hot_Pod_Site_Post.jpg",
  "description": "Audio industry leaders will be joining us at the Wythe Hotel in Brooklyn on February 24th, 2022.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}