{
  "title": "How to wipe your Android phone before selling or trading it in",
  "url": "https://www.theverge.com/21419919/delete-data-android-phone-sell-trade-how-to",
  "date": "2022-03-24T16:02:39.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"Android Pie’s multitasking menu on the Google Pixel 3 XL\" src=\"https://cdn.vox-cdn.com/thumbor/tZ4oTC8phsX9AIZkT3-hhHISWOM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/67347797/vsavov_pixel3_multitasking.0.jpg\" />        <figcaption>Photo by Vlad Savov / The Verge</figcaption>    </figure>  <p id=\"aB3E5w\">About to buy <a href=\"https://www.theverge.com/22955139/samsung-galaxy-s22-plus-review\">the latest Samsung phone</a> or are you <a href=\"https://www.theverge.com/22750387/google-pixel-6-pro-review\">more of a Pixel person</a>? Whether you plan to trade in your old Android phone for a discount on your new phone, sell it on eBay, give it away to a friend, or drop it off for recycling, you’re going to want to wipe it of all your data first by resetting it to factory conditions. Luckily, that’s pretty easy to do.</p><p id=\"C1Jx0m\">Before you start, be aware that these instructions were tested on a Pixel 3 running Android 12, but the process for most current Android phones should be pretty much the same. Needless to say, first make sure that all of your data is transferred to your new phone, backed up, or both. Once your old phone has reset, there’s no going back.</p><div id=\"yrc5oQ\"><div data-anthem-component=\"gallery:6348266\"></div></div><ul><li id=\"GBQXy2\">Go to <strong>Settings</strong></li><li id=\"PyxsYb\">Select <strong>System</strong> &gt; <strong>Reset options</strong></li><li id=\"q1MvW3\">You will be presented with four choices. <strong>Reset Wi-Fi, mobile &amp; Bluetooth</strong> is sometimes useful if you’re having trouble with connectivity. <strong>Reset app preferences</strong> will restore all of your app and notification defaults, among other things. <strong>Erase downloaded SIMs</strong> will help you delete any digital SIMs you no longer need. However, none of these will delete the data on your phone. That’s the job of the last choice, <strong>Erase all data (factory reset)</strong>, and that’s the one you’re going to select.</li><li id=\"8CCXmQ\">The next screen will tell you what is going to be erased, and which accounts you’re signed into. Select <strong>Erase all data</strong>.</li><li id=\"fjmiVY\">If you have a PIN or some other security setup, you’ll be asked to enter it</li><li id=\"VDEuAZ\">You’ll get another screen asking if you’re sure this is what you want to do. Are you sure? Then hit the <strong>Erase all data</strong> button.</li></ul><p id=\"hnVjhF\">That’s it! The process usually takes only two or three minutes. Your phone will reboot and begin with the usual opening questions, such as language, account, network, etc. Once you see those, you’ll know that it’s worked.</p><p id=\"nyEkyN\">There are a few things to be aware of. First, if you’ve got a Samsung phone, you may be asked for your Samsung account password before you can reset (provided you’ve created one and added it to the phone). </p><p id=\"0gXHL1\">If you’ve got an Android phone that is using an earlier version of the OS (say, before version 8), the reset may, after it reboots, ask for your login. This could be awkward if you’ve already sent the phone to someone else. As a result, if you’ve got an older phone, it’s a good idea to turn off your screen lock (by going to <strong>Security</strong> &gt; <strong>Screen lock</strong> and selecting <strong>None</strong>) and deleting your Google account (which you’ll find at <strong>Settings</strong> &gt; <strong>Account</strong> &gt; <strong>Google</strong>) before you start the reset. (In fact, that may be a good idea in any case.)</p><p id=\"jODVhC\">There is evidence that some data may remain on a phone <a href=\"https://www.theverge.com/2015/5/26/8661461/android-factory-reset-disk-encryption-resale\">even after it’s been reset</a>. To be extra careful, you can encrypt the phone before resetting it:</p><ul><li id=\"I4nm1k\">Go to <strong>Settings</strong> &gt; <strong>Security</strong> &gt; <strong>Encryption &amp; credentials</strong> and select <strong>Encrypt phone</strong></li><li id=\"9R0Yok\">Go back to your settings and start the reset process</li></ul><p id=\"U9R1Eo\">Of course, if you want to be <em>really</em> sure, and you don’t intend to give the phone to anyone, you could always grab a hammer.</p><p id=\"R5GgId\"><em><strong>Update September 3rd, 2020, 10:50AM ET:</strong></em><em> This article was originally published on May 22nd, 2019, and has been updated to mention more recent phones and to update a menu selection.</em></p><p id=\"eFagm4\"><em><strong>Update March 24th, 2022, 11:40AM ET:  </strong></em><em>Updated to mention more recent phones and update instructions for Android 12.</em></p><p id=\"pjV0YP\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jNZDnRjOOlZgANW1jYqevcud6XY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16278803/akrales_190515_3399_0018.jpg",
  "description": "Before you give your device away, delete your personal data.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}