{
  "title": "How to play Steam games in any room of your house",
  "url": "https://www.theverge.com/22962051/steam-games-remote-play-windows-ios-android-macos-streaming",
  "date": "2022-03-10T20:04:31.000Z",
  "author": "Stefan Etienne",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/EdPMEcxoiJXH5nr3obo_YbbR_Os=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70605378/acastro_180509_1777_steam_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"fMB5m9\">What happens if you’re gaming on your desktop Windows PC but want to continue the game from a different part of the house — or even out of the house? If you’re using <a href=\"https://store.steampowered.com/\">Steam</a>, Valve’s PC gaming destination, you can get around the first part of this dilemma by using <a href=\"https://www.theverge.com/2019/3/14/18265818/valve-steam-link-anywhere-personal-cloud-service-gaming-pc-gdc-2019\">Steam Link</a>, an in-home game streaming solution that uses your local network. And now, there’s a way around the second as well — with some caveats. </p><p id=\"2fbZWA\">While the <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">recent release of the Steam Deck</a> has provided gamers with a new way to play games away from their desktop, the Steam Link feature lets you stream your games from anywhere using an Android or Apple device with an internet connection (<a href=\"https://www.theverge.com/circuitbreaker/2018/11/19/18103672/valve-discontinues-steam-link-streaming-set-top-box\">R.I.P Steam Link Box</a>). Even though Steam Link has been out of beta for some time, the service can still be an uphill battle even for power users, so don’t be surprised if you experience inconsistent connectivity or performance. </p><p id=\"JnGeDq\">So, let’s get started on setting up Steam game streaming from one desktop to another or between your desktop and your mobile device. </p><h2 id=\"Utgcva\">Make sure you’ve got a good router or wired ethernet</h2><p id=\"s47i8T\">This should maybe go without saying, but your network needs to be robust — if your Wi-Fi is weak, slow, congested, or there’s too much interference, you won’t see great results. With a wired ethernet connection on both ends, Steam streaming can feel practically seamless inside your own home, but it can be completely unplayable with a poor wireless link. Just keep that in mind. </p><div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QBFn3RIUTbCgf5IaG61H7bbQlcA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289658/steam_2.png\">      <cite>Image: Alice Newcome-Beill</cite>      <figcaption>The Steam settings menu</figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-5rWr9tIb4IeDtOWxI3l64WPZ4o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289664/steam_4.png\">      <figcaption><em>The Remote Play menu</em></figcaption>  </figure></div><h2 id=\"quG2eQ\">Setting up your Steam client apps for streaming </h2><ul><li id=\"22prYo\">Before you do any streaming (in-home or otherwise), you’ll probably want to download or update to the <a href=\"https://steamcommunity.com/groups/SteamClientBeta\">latest version of the Steam desktop client</a> for the best experience. If you want to stream games to your phone, download the Steam link client to your <a href=\"https://play.google.com/store/apps/details?id=com.valvesoftware.steamlink&amp;hl=en_US&amp;gl=US\">Android</a> or <a href=\"https://apps.apple.com/us/app/steam-link/id1246969117\">Apple</a> device. If you’re streaming to another Windows MacOS computer, all you need is to have the latest Steam client installed there as well, with no additional software required. </li><li id=\"dh8Ul8\">If you’re streaming to a mobile device, go to the Steam Link app settings on your phone and select “Other Computer.” A four-digit PIN will appear on your screen that you’ll enter on the desktop to complete the pairing process. If you’re using two PCs, you won’t need to pair them in order to stream in-home; just sign in to the same account on the same network.</li><li id=\"CUh8eL\">Using the desktop Steam client, from the “Remote Play” menu, select “Pair Steam Link,” and then enter the code seen on your phone. Make sure you’re on the same network and follow the setup wizard until the pairing process is complete. </li></ul><p id=\"sq4JqE\"></p><p id=\"gv3vNH\"></p><ul><li id=\"DugAFf\">At this point, you <em>could </em>start streaming, but first, I’d recommend that you set a four-digit PIN to secure your connection between any remote apps and your PC. After all, you’re handing full remote control over your computer to another device, so you should practice good security measures. Here’s how to set a PIN for Steam Link:</li><li id=\"5DZXi2\">On the same “Remote Play” settings page from earlier, select the “Set Security Code” button.</li><li id=\"k1SUaw\">Next, set a four-digit PIN by entering it into both fields, then click on the “OK” button. </li></ul><p id=\"ljziju\">From now on, whenever you attempt to stream in-home or remotely, you’ll be required to enter the PIN. </p><p id=\"xjHFc3\">You’re finally through the setup process! As long as you stay logged in to both Steam clients, you should be able to quickly use Steam Link streaming when you’re on your own local network — or over the public internet, from your phone. More on that below.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YSnhTOFqyLFPbd20ddFG-Qdyi1M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289668/steam_5.png\">      <figcaption><em>Setting up a PIN for Steam Link on desktop</em></figcaption>  </figure><h2 id=\"T5N3X9\">How to stream games remotely using Steam Link </h2><ul><li id=\"aIGnZk\">First, you’re going to need an internet connection with excellent upload speeds. Even if Comcast is giving you 150Mbps down, 5Mbps uploads aren’t going to cut it when you’re uploading a high-res video stream to the cloud.</li><li id=\"2DMlWn\">Assuming you’ve got that connection and your devices are paired (see earlier steps), you can start streaming games over the internet. </li><li id=\"cXl0b6\">For streaming from mobile, start up the Steam Link app and select the computer you added earlier.</li><li id=\"Z0acT8\">Select “Start Playing,” enter your four-digit PIN, and press “Connect.” Assuming your host PC isn’t asleep, it should transition to Steam Big Picture mode while simultaneously delivering a stream to your phone. In my experience, there is a slight delay in camera and input controls when used over an LTE connection on mobile, but that can vary depending on your network and location. </li><li id=\"Tg4Umn\">Additionally, you can select different control methods within the Steam Link mobile app. From the start screen of the app, tap on Settings, followed by “Controller.” From here, you can stick with Steam’s surprisingly robust and customizable touch input or pair a controller to your phone that the host PC will recognize. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SfOOvV5VewN2uKymhED9PbOKQSc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289762/Screenshot_2022_03_04_15_58_04_11_652cbb0d9d1e9145730c5cd6d82a4617.jpg\">      <figcaption><em>The default controls can be cumbersome for some titles</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hiD8cBv7G6jO37Ehx-aIJFpv81M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23289766/Screenshot_2022_03_04_16_35_24_81_652cbb0d9d1e9145730c5cd6d82a4617.jpg\">      <figcaption><em>You can fine tune many of the touch controls in the Steam Link app</em></figcaption>  </figure><h2 id=\"sWKwSo\">How to stream games in-home using Steam Link</h2><ul><li id=\"y2P1xE\">Streaming games on your in-home network is basically identical to streaming over the internet. You simply need to be logged in to Steam (using the same account and network) on both devices, whether they be mobile or desktop.</li><li id=\"8lHvQS\">With your host Windows or PC (where the game streams from) and your stream destination (Android phone, another PC, etc.) set up, simply select a game from your library on the receiving device. On Windows or macOS desktops, this would involve going to your game library and clicking “Stream” on any of your games. On the Steam Link app, simply hit the “Start Playing” button.</li><li id=\"VAABrV\">Both the host PC and receiver should now display identical streams of the game in question. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pCjYOzTDi2ZdiB85nYLSt0FXnCU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/16000442/Annotation_2019_04_01_103346.jpg\">      <figcaption><em>Steam Link even lets MacOS stream from Windows machines</em></figcaption>  </figure><p id=\"IiQ8kl\"><em><strong>Update March 7th, 2021, 2:20PM ET:</strong></em><em> This article was originally published on April 3rd, 2019; the directions and the screenshots have been updated.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/B9ZfkJtlkeqL84fWvWnFkUJHeAc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10817765/acastro_180509_1777_steam_0001.jpg",
  "description": "Access your Steam library from anywhere",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}