{
  "title": "How to pick the best sleep tracker for you",
  "url": "https://www.theverge.com/23013600/best-sleep-tracker-wearables",
  "date": "2022-04-07T13:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H069d93ohwgp8m_z0baPC0IzJCI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70720829/akrales_190903_3635_0139.0.jpg\" />        <figcaption><em>Fitbit has great sleep tracking insights.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"4PCIEZ\">Getting a good night’s sleep is one of the best things you can do for your health. And yet we live in the age of Netflix binges, a never-ending scroll of TikToks, and late-night video gaming marathons<em>. </em>But if you’re determined to build better sleeping habits, you can always try tracking your sleep.</p><p id=\"AdC35q\">Before we dive in, a quick note: sleep tracking can be a helpful tool, but there are limitations as to what it can do. The jury is out on <a href=\"https://www.hopkinsmedicine.org/health/wellness-and-prevention/do-sleep-trackers-really-work\">how accurate sleep trackers are</a>, and you shouldn’t treat your results as an official diagnosis for any sleeping disorders, especially since these devices are not cleared by any regulatory body. Instead, you should view these devices as a means of learning about your sleep habits to help improve your sleep hygiene. If you think you may be prone to <a href=\"https://www.health.com/condition/sleep/what-is-orthosomnia\">orthosomnia</a> — or a preoccupation with getting “perfect” sleep — you may also want to steer clear. With that in mind, here’s how to pick the best sleep tracking method for you.</p><h2 id=\"gF7ej0\">Types of sleep trackers</h2><p id=\"VcUwln\">Broadly speaking, you can divide sleep trackers into two categories: wearable and non-wearable. </p><p id=\"rPkiIh\">Wearable sleep trackers are primarily fitness trackers and smartwatches that happen to also track sleep. These include Apple Watches, Garmins, Fitbits, etc. But there are also more niche wearable sleep trackers that you don’t wear on the wrist, like the <a href=\"https://www.theverge.com/22789248/oura-ring-3-review-sleep-tracker-fitness-tracker\">Oura Ring</a>. Meanwhile, the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fchoosemuse.com%2Fmuse-s-guided-bundle%2F%3Futm_source%3DGoogle%26utm_medium%3DPaidSearch%26utm_campaign%3DNon-Brand%26gclid%3DCjwKCAjw9LSSBhBsEiwAKtf0n3gWojEvzAqETmTV3Ceh5lPGAERJzcqhSOMeGuyUmI-hMjwYXNTX2xoC1qwQAvD_BwE&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013600%2Fbest-sleep-tracker-wearables\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Muse S</a> and <a href=\"https://www.theverge.com/22915014/kokoon-nightbuds-wearable-sleep-tracker\">Kokoon Nightbuds</a> are devices that are worn on your head.</p>  <figure class=\"e-image\">        <img alt=\"The Oura Ring Gen 3, close up\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DaZ75ckiqSQpV07TJFJiF9BOEUE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23035226/vsong_211117_4890_0007.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Oura Ring may be a more comfortable sleep tracker for people who don’t like wearing watches to sleep.</em></figcaption>  </figure><p id=\"ceFuO9\">Non-wearable sleep trackers include smartphone apps, smart mattress pads, bedside monitors, or even entire smart <em>beds</em>. A few examples include the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.withings.com%2Fus%2Fen%2Fsleep&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013600%2Fbest-sleep-tracker-wearables\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Withings Sleep</a>, the <a href=\"https://www.theverge.com/22357214/google-nest-hub-2nd-gen-2021-assistant-smart-display-review\">Google Nest Hub</a>, and the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.sleepnumber.com%2Fpages%2F360&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013600%2Fbest-sleep-tracker-wearables\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sleep Number 360 Smart Bed</a>.</p><p id=\"v0USuG\">The main thing is figuring out whether you’ll feel comfortable wearing something while you sleep. While some people have no problem wearing a watch to bed, others can’t stand it. A sleep tracker that you rip off in the middle of the night isn’t any help. In that case, something like the Oura Ring or a non-wearable tracker is the better bet. If you’re unsure, try sleeping with a regular watch for a few days to see how it feels. </p><h2 id=\"SQt6D0\">Wearable sleep trackers</h2><p id=\"KVP6IY\">These are the sleep trackers you’re likely most familiar with. These are good options for people who want to look at sleep as a part of their overall health. There’s a wide range of prices, with wearable sleep trackers ranging anywhere from $50 to $1,000. When shopping for a device, you should ask yourself the following questions:</p><ul><li id=\"bRe1SU\">Do I want the sleep tracker to do anything else?</li><li id=\"s1wLFZ\">What aspect of my sleep do I want to track?</li><li id=\"UyfWOd\">How’s the battery life?</li><li id=\"g2j919\">How much am I willing to spend?</li></ul><p id=\"QjZfAG\">This should help narrow down your choices quite a bit. For instance, if all you want is a dedicated sleep tracker that gives incredibly detailed information and can last multiple days on a single charge, the Oura Ring and <a href=\"https://www.theverge.com/22957195/whoop-review-fitness-tracker-wearables\">Whoop 4.0</a> fit the bill. But if you want something that’s going to multitask — say, track your workouts, take phone calls, or deliver notifications — a smartwatch or fitness tracker is the better choice. </p>  <figure class=\"e-image\">        <img alt=\"Screenshot of the sleep tracking screen in the Halo app\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JNa_B72dE5MebzwoHmXHYlfb0Bk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23076147/akrales_211207_4912_0116.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>With wearables, you can view your detailed sleep results in a companion app.</em></figcaption>  </figure><p id=\"kZcTHt\">Most smartwatches and fitness trackers these days track sleep in some capacity. However, your mileage will vary. The <a href=\"https://www.theverge.com/22722533/apple-watch-series-7-review-screen-watchos-features\">Apple Watch</a>, for instance, <a href=\"https://www.theverge.com/2020/6/22/21294434/apple-watchos-7-features-sleep-tracking-face-sharing-fitness-apps-2020\">introduced native sleep tracking</a> with watchOS 7, but it was fairly bare-bones. While it lets you easily see how long you slept, there’s no information about sleep stages or how well you recovered during the night. Also, with an estimated 18 hours of battery life, it’s not the best for people who forget to charge their devices. </p><p id=\"aKDbOB\"><a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeSleepTracker040622/https://www.fitbit.com/global/us/home\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Fitbit</a> offers a lot more granularity and a holistic look at how your sleep impacts the rest of your health. You can see sleep stages, how your sleep habits compare to other people in your demographic, as well as receive a sleep score. Fitbit Premium subscribers can also get a Daily Readiness Score, which evaluates your sleep and other metrics to determine how much activity you should get that day. Fitbits also get around five to seven days of battery life.</p>  <figure class=\"e-image\">        <img alt=\"The Whoop 4.0 on someone’s wrist\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PJOlY5P-d8STO07AAwA2vjwm9d0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277334/vsong_220225_5048_0004.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>Whoop 4.0 is tracker that focuses on how sleep affects athletic performance.</em></figcaption>  </figure><p id=\"S50Z5O\">These are just two examples. Rugged sports watches from Garmin and Polar also track sleep, have long battery life, and give sleep scores. However, the data you get from these watches tends to be much more focused on how your sleep impacts your athletic performance. Whoop 4.0 is another example of a sleep tracker that’s primarily aimed at athletes.</p><p id=\"xgKx6Y\">Each wrist-based sleep tracker will present its sleep data in a different way, but you don’t have to do anything special for the device to track your sleep. So long as you’re wearing the device, you can just go to bed normally. Here are some tips to get started.</p><ul><li id=\"8kjXI9\">Once you pair your tracker with your phone, check the sleep settings within the device’s smartphone app. If your tracker supports it, this is where you’ll find how to customize sleep tracking settings, alarms, sleep goals, and bedtime reminders. </li><li id=\"S8iJa4\">Make sure your battery is charged to at least 50 percent before bed. </li><li id=\"HZnjzN\">Sync your data soon after waking up in the morning.</li><li id=\"8LlhFh\">If the sleep tracker is not working, try cleaning the sensors, restarting the device, and re-pairing. You can also try wearing it in a slightly different position. If all else fails, check the manufacturer’s FAQs.</li></ul><h2 id=\"FrJcK8\">Smartphone apps</h2><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Sleep Cycle app screenshot showing sleep quality\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0fIrMHVuE18TuR0PWdoWB0eEiec=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371757/Sleep_Cycle_9_Sleep_Quality.jpg\">      <cite>Image: Sleep Cycle</cite>      <figcaption><em>The Sleep Cycle app is a popular option if you’d rather use your smartphone.</em></figcaption>  </figure></div><p id=\"LMrGsA\">Another popular method for sleep tracking uses something you already have — your smartphone. Sleep tracking apps generally monitor your movements and ambient sounds (e.g., snoring, coughing, etc.) to determine your sleep quality. Many also offer smart alarm capabilities, sleep insights, and coaching tips. They may also include digital sleep logs in which you can note any factors that may have impacted your sleep. </p><p id=\"2xnKQ3\">These apps don’t get quite as detailed as wearables, but even so, they can be helpful for identifying short-term and long-term sleep patterns. They’re also a good option if you suspect snoring may be keeping you up, as they can also record audio. With apps, there is one thing you have to be mindful of. If you want the best results, you’ll need to make sure that you start <em>and</em> stop a sleep session in the app, rather than just letting it run.</p><p id=\"tLIQxH\">There are hundreds of sleep apps out there for both iPhone and Android phones, but here are a few popular options to get you started:</p><ul><li id=\"IkSk49\">Sleep Score (<a href=\"https://apps.apple.com/us/app/sleepscore-go-beyond-tracking/id1364781299\">iOS</a>, <a href=\"https://play.google.com/store/apps/details?id=com.sleepscore.drive&amp;hl=en_US&amp;gl=US\">Android</a>) </li><li id=\"62zGzf\">Sleep Cycle (<a href=\"https://apps.apple.com/us/app/sleep-cycle-sleep-tracker/id320606217\">iOS</a>, <a href=\"https://play.google.com/store/apps/details?id=com.northcube.sleepcycle&amp;hl=en_US&amp;gl=US\">Android</a>)</li><li id=\"0w0cG9\">Pillow (<a href=\"https://apps.apple.com/app/pillow-sleep-cycle-alarm-clock/id878691772\">iOS</a>)</li><li id=\"zM2QSp\">PrimeNap: Sleep Tracker (<a href=\"https://play.google.com/store/apps/details?id=com.primenap&amp;hl=en_US&amp;gl=US\">Android</a>)</li></ul><h2 id=\"Qmdh51\">Contactless sleep tracking gadgets</h2><p id=\"GENiJ4\">If neither a wearable nor a smartphone app appeals to you, consider contactless sleep trackers. These primarily consist of mattress mats, smart beds, and bedside monitors. These gadgets are attractive options for people who want a truly unobtrusive tracker — but beware: these can be much more expensive than wearables and apps. </p><p id=\"geGKQf\">Mattress mats are exactly what they sound like — a mat with sensors that you slip under or over your mattress. One example is the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.withings.com%2Fus%2Fen%2Fsleep&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013600%2Fbest-sleep-tracker-wearables\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Withings Sleep</a>. This particular mat is capable of measuring your breathing rate, heart rate, and movement. Withings also claims that it’s able to detect snoring and can be used with <a href=\"https://ifttt.com/\">IFTTT</a> to program an ideal sleep environment (i.e., dimming smart lights, lowering smart thermostats, etc.). Other examples are the <a href=\"https://tempurpedic.pxf.io/c/482924/1070808/13723?u=https%3A%2F%2Fwww.tempurpedic.com%2Fother-products%2Ftempur-pedic-sleeptracker%2Fv%2F3397%2F&amp;subid1=VergeSleepTracker040622\">Temper-Pedic Sleep Tracker</a>, the <a href=\"https://www.amazon.com/gp/product/B06VXH15YC/ref=ox_sc_act_title_1?smid=A27JCKJA7G9XKC&amp;psc=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Beautyrest SleepTracker</a>, and the <a href=\"https://eight-sleep.ioym.net/c/1141873/607198/9942?u=https%3A%2F%2Fwww.eightsleep.com%2Fproduct%2Fpod-pro-cover%2F%3F&amp;subid1=VergeSleepTracker040622\">Eight Pro Cover</a>. Keep in mind that these devices range widely in price — the Withings Sleep retails for $100, for example, while the Eight Pro Cover will set you back at least $1,600, depending on your mattress size. </p><p id=\"AusvPk\">The next step up is smart beds. These are actual mattresses that often feature adjustable positions, firmness, and temperature. Many also offer biometric health tracking. A couple of examples include the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.sleepnumber.com%2Fpages%2F360&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013600%2Fbest-sleep-tracker-wearables\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sleep Number 360 Smart Bed</a> and the <a href=\"https://eight-sleep.ioym.net/c/1141873/607198/9942?u=https%3A%2F%2Fwww.eightsleep.com%2Fproduct%2Fpod%2F&amp;subid1=VergeSleepTracker040622\">Eight Sleep Pod</a>. As you might imagine, this isn’t the most cost-effective way to track sleep — smart beds can cost thousands of dollars. However, if you have the means, smart beds can also be customized to your personal preferences for a more comfortable night of sleep. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hJdNJzPSzjVxgF_YU2Aluv4GtM0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22399112/dseifert_20210323_4485_0013.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>The second-gen Google Nest Hub introduced sleep tracking.</em></figcaption>  </figure><p id=\"Xx3Mvl\">Lastly, there are bedside monitors. These are devices that sit on your nightstand and monitor your sleep. The most recognizable example is the <a href=\"https://www.theverge.com/22357214/google-nest-hub-2nd-gen-2021-assistant-smart-display-review\">Google Nest Hub</a>. The second-generation hub added sleep tracking via Soli radar sensors in the smart display’s bezel. It can track your movement, breathing patterns, and snoring. It also monitors how much time you spend in bed, as well as the temperature and light in your room. </p><p id=\"2rNvVi\">Another option is the <a href=\"https://shop.sleepscore.com/collections/shop-all/products/sleepscore-product\">SleepScore Max</a>, which tracks many of the same metrics and can generate a report for your doctor. Price-wise, these are some of the most affordable contactless options. The Nest Hub runs for about $100, while the SleepScore Max goes for about $150. </p><p id=\"GDD0vj\">Hopefully, you now have an idea of what type of sleep tracker is best for you. Sweet dreams, and happy sleep tracking. </p><p id=\"8IIUAo\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dBi-w1xVe7TqMhXYLFGeCzbOuGE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19168637/akrales_190903_3635_0139.jpg",
  "description": "For when you need help catching some Zzz’s",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}