{
  "title": "How to put the Windows 11 Start menu back where it belongs",
  "url": "https://www.theverge.com/22684671/windows-11-microsoft-start-menu-how-to",
  "date": "2022-04-18T13:04:27.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ClCbBuO0Gjyguk3pBcR7RYmAtQE=/8x0:2552x1696/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/69889116/twarren__windows11main_1.0.jpg\" />        <figcaption>Photo by Tom Warren / The Verge</figcaption>    </figure>  <p id=\"T5Thwy\">When you upgrade from Windows 10 to Windows 11, one of the first things you may do is wonder: where the heck is my Start menu? Traditionally, the Windows Start menu has been in the lower-left corner of the screen, but when your new version of Windows appears, you’ll find the Start icon among a group of icons in the center of your taskbar at the bottom of the screen. </p>  <figure class=\"e-image\">        <img alt=\"The Windows 11 Start menu is now a small icon in the center of the taskbar.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UV3BYnWrdkbDe3--xDj1Rmf7YtU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22867032/Screenshot__7_.png\">      <figcaption><em>The Windows 11 Start menu is now a small icon in the center of the taskbar.</em></figcaption>  </figure><p id=\"SDCe0H\">Click on the Start menu icon, and things will look very different as well. Instead of the large square Live Tiles that used to pop up, you have a much more modest set of app icons, mostly showing Microsoft-related apps pinned to the main page. Click on “All apps” on the top right corner (just below the search field), and you get the familiar A-to-Z listing of apps. But no tiles.</p><p id=\"OVPJLr\">Look below the app icons, and you’ll find a “Recommended” section, which offers apps that Microsoft thinks you should try (such as Teams) and, if you click on the “More” button, some of the files or apps you may have used recently.</p>  <figure class=\"e-image\">        <img alt=\"Clicking on the search field offers immediate access to several popular apps.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ReSjcCcMS3g2GEWZxHLRLcTpZqI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22867098/Screenshot__12_.png\">      <figcaption><em>Clicking on the search field offers immediate access to several popular apps.</em></figcaption>  </figure><p id=\"SJ9dGZ\">By the way, that search field? Click in that, and the Start menu will open up, giving you immediate access to File Explorer, settings, and other apps. </p><p id=\"20teRv\">While some may appreciate this more puritanical version of the Start menu, others who have gotten used to the more configurable version in Windows 10 may want to know how they can go back to the more familiar, and more personal, version.</p>  <figure class=\"e-image\">        <img alt=\"You can move the Start icon to the left using the Taskbar alignment option in your setup menu.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ARWcH79s26rDxObk_7UdhDSCXWY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22867042/Screenshot__1_.png\">      <figcaption><em>You can move the Start icon to the left using the taskbar alignment option in your setup menu.</em></figcaption>  </figure><p id=\"P3ceG8\">You can get some of the way there by moving the centered apps to the left of the taskbar:</p><ul><li id=\"kSbuWv\">Right-click on the taskbar and click on “Taskbar settings”</li><li id=\"NEijmh\">Select “Taskbar behaviors”</li><li id=\"gsR825\">Look for “Taskbar alignment” and click on the button on the right where it says “Center.” Select “Left” instead.</li><li id=\"1yMLuh\">Close the settings window, and you’ll see that the app icons in the taskbar have moved to the left, with the Start menu icon in the corner.</li></ul>  <figure class=\"e-image\">        <img alt=\"Now the Start menu icon is in the left corner, but the menu itself is unchanged.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ehJQnjDhrKnHt7zz_r7OnlJO3BU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22867047/Screenshot__22_.png\">      <figcaption><em>Now the Start menu icon is in the left corner, but the menu itself is unchanged.</em></figcaption>  </figure><p id=\"OFlR5U\">While this will place the Start menu back where you expected it, it will not restore the one you were used to. To get that back, you’re going to have to go to a third-party app.</p><p id=\"Dqasxh\">There are a couple available. Stardock, a company whose Start10 app allows Windows 10 users to keep their beloved Windows 7 menu UI, has a <a href=\"https://www.theverge.com/2021/8/11/22619930/stardock-start11-windows-11-start-menu-beta\">Start11 app</a>, which it says will bring back the classic Windows 10 Start menu. The app has a starting price of $5.99 for one active install. </p><p id=\"M2mOPC\">A second is <a href=\"https://www.startallback.com/\">StartAllBack</a>, which lets you tweak a number of Windows 11’s UI aspects, including the Start menu and the taskbar. StartAllBack offers a 30-day trial period; after that, a license for a single PC costs $4.99.</p><p id=\"eibHrR\"><em><strong>Update April 18th, 2022, 9:05AM ET:</strong></em><em> This article was originally published on September 21st, 2021; information about the Start11 app has been updated, info about StartAllBack has been added, and mention of some now-unusable regedit hacks has been deleted.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/JuvIZwKaAaCQx-ftwKKzdjHnsOk=/0x178:2560x1518/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22690959/twarren__windows11main_1.jpg",
  "description": "The Windows 11 Start menu is now centered in the taskbar.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}