{
  "title": "How to type special characters on a Windows 11 PC",
  "url": "https://www.theverge.com/23034476/windows-11-pc-how-to-type-special-characters",
  "date": "2022-04-26T20:20:51.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pm36Uv33l648zdAI-Ju1bs4tjbg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70796614/mchin_190527_4449_0006.0.jpg\" />        <figcaption>Photo by Monica Chin / The Verge</figcaption>    </figure>  <p id=\"nBtPSS\">Here’s the situation: you’re typing a report for work, and you suddenly have to write the phrase “Jones née Berkowitz.” Or you are adding a phrase in Spanish and need to use the word “años.” How do you add the special characters to the letters with your Windows 11 PC?</p><p id=\"2JFT5W\">Special characters (also known as <a href=\"https://en.wikipedia.org/wiki/Diacritic\">diacritical marks</a>) may be more common in certain languages, but there are plenty of circumstances in which English speakers may need to use them. But because they are so rare in English, native English speakers may not have learned how to add those marks to documents, emails, or other writings. It’s not difficult to add them to your Windows document, although it’s not quite as smooth an operation <a href=\"https://www.theverge.com/22347140/apple-mac-special-characters-how-to\">as on a Mac</a>, where all you have to do is hold the appropriate key down. (In fact, once upon a time, you would have had to look up the symbol character codes.)</p><p id=\"fF1bsM\">Here are various ways to add special characters when you’re using a Windows 11 computer.</p><aside id=\"0OL3wA\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to type special characters on a Windows 10 PC\",\"url\":\"https://www.theverge.com/22351023/windows-pc-special-characters-how-to\"}]}'></div></aside><h2 id=\"F2UXCI\">Use the touch keyboard</h2><p id=\"cK212s\">The easiest way to add diacritical marks to a document is to enable the Windows touch keyboard. (Thanks to <a href=\"https://www.zdnet.com/article/windows-10-tip-get-easy-access-to-symbols-emojis-and-other-special-characters/\">Ed Bott from <em>ZDNet</em></a> for first leading me to this method.) The touch keyboard automatically appears if you’re using a Windows tablet or a PC in tablet mode. If you don’t have a touchscreen, you can use the keyboard icon that appears in the taskbar on the right side near the date. Don’t see it? This is how you get it:</p><ul><li id=\"3mKSNx\">Click on the search icon in the toolbar and search for “touch keyboard.” Or go to <strong>Settings &gt; Time &amp; language &gt; Typing &gt; Touch keyboard</strong>.</li><li id=\"guGqAk\">Check <strong>Show the touch keyboard when there’s no keyboard attached</strong>.</li></ul>  <figure class=\"e-image\">        <img alt=\"Enable the touch keyboard.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MqwOlqEqReM7IJfE5XaCSLvygew=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407139/Screenshot__219_.png\">      <figcaption><em>Enable the touch keyboard.</em></figcaption>  </figure><p id=\"isigzU\">Now, when you want to use a special character:</p><ul><li id=\"MiArSp\">Click on the touch keyboard icon. (You’ll usually find it on the right side of the taskbar.)</li><li id=\"vkiOjM\">The touch keyboard will appear. Long press (with your mouse button or, if you have a touchscreen, your finger) on the letter you want to use. </li><li id=\"mxWCG7\">You’ll now see several extra keys showing the ways you can type that letter with different symbols. Select the one you want, and it will appear on your document.</li><li id=\"YsM2S5\">If you want to add an emoji or a GIF, click on the emoji button. (It’s the icon with the heart located on the upper left of the keyboard.)</li></ul>  <figure class=\"e-image\">        <img alt=\"Long press on the touch keyboard to reveal the letter with various diacritical marks.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C2bbnZMmhRZwAjUZPWTPaK39tCU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407097/Screenshot__1_.png\">      <figcaption><em>Long press on the touch keyboard to reveal the letter with various diacritical marks.</em></figcaption>  </figure><h2 id=\"3KuFuR\">Use the emoji keyboard</h2><p id=\"Ias5hY\">Another keyboard that you can access and that can let you easily add special characters to your text is Windows’ emoji keyboard. Yes, it is mainly for adding emojis to your text, but it’s got other uses as well. And it’s simple to use.</p><ul><li id=\"YHAmrI\">Hold down the Windows key and hit the period key.</li><li id=\"yERfP0\">The emoji keyboard will pop up. Click on the symbols tab on top (the fourth from the left).</li></ul><p id=\"BJ3QHU\"><em>The emoji keyboard also lets you access special characters.</em></p><ul><li id=\"RBvuoy\">Scroll down until you find the character you want. You can also jump to various types of characters by using the categories (such as “General punctuation” or “Currency symbols”) on top.</li></ul><h2 id=\"blWVk1\">Use the character map</h2><p id=\"MX8CIZ\">If you’d like to try a more old-fashioned method of adding special characters to Windows, you can use the character map, which is a less polished and more complicated version of the touch keyboard but offers a similar service.</p><p id=\"rCcyqh\">To access it on your Windows 11 system:</p><ul><li id=\"QyOOxs\">Select the search icon in your taskbar, type “character” in your search field, and then select the Character Map app.</li><li id=\"2thjaB\">You’ll get a pop-up map showing a bunch of special characters for a specific font. You can change the font by clicking on the drop-down font menu at the top.</li></ul>  <figure class=\"e-image\">        <img alt=\"The character map lets you access a wide variety of special characters.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/t7GknZWGbXmLDWNLFDoIqxsW84U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22397981/special4.png\">      <figcaption><em>The character map lets you access a wide variety of special characters.</em></figcaption>  </figure><ul><li id=\"4Xgqtz\">Click on the letter(s) or special characters that you want to use in your document, and then click on the “Select” button. They’ll appear in the <strong>Characters to copy</strong> field.</li><li id=\"XN5Maf\">Once you’ve selected all the characters you want, click on the <strong>Copy</strong> button, and then paste the character(s) into your document.</li></ul><h2 id=\"TyzBrw\">Use the US International Keyboard</h2><p id=\"xFd69h\">If you’re an English speaker who is multilingual and uses special characters a lot, you may want to try the US International Keyboard, which maps your keyboard to more easily allow you to add special characters. (Thanks to “shiroledat” for the tip.)</p><p id=\"7zIVkO\">First, you need to add the US International Keyboard to Windows:</p><ul><li id=\"L4pshC\">Go to <strong>Settings &gt; Time &amp; Language &gt; Language &amp; region</strong>.</li><li id=\"xnVyk8\">Look for <strong>Preferred languages</strong> and (assuming you’re an English speaker in the US) click on <strong>English (United States)</strong>. Then select the three dots at the right and choose <strong>Language options</strong>.</li><li id=\"rGKWxs\">Look for the <strong>Keyboards</strong> section, which (if you’ve never been there before) will probably only contain a single keyboard icon labeled <strong>US / QWERTY</strong>. That’s the keyboard map you’re now using. Click on the <strong>Add a keyboard</strong> button to the right of <strong>Installed keyboards</strong>.</li></ul>  <figure class=\"e-image\">        <img alt=\"Look for the list of your installed keyboards.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_-q2pVAzZDH6yI3w3z5oQN6zFvI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417964/Screenshot__226_.png\">      <figcaption><em>Look for the list of your installed keyboards.</em></figcaption>  </figure><ul><li id=\"p6aTp5\">In the pop-up menu that appears, scroll to <strong>United States-International / QWERTY</strong> and click on it.</li></ul>  <figure class=\"e-image\">        <img alt=\"When you click on “Add a keyboard,” you get a list of possible keyboards.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/aGTKCoIXIW6sqBgqJROfWXtH5sc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417965/Screenshot__228_.png\">      <figcaption><em>When you click on “Add a keyboard,” you get a list of possible keyboards.</em></figcaption>  </figure><p id=\"DLJYiS\">Now, you always have the choice of using either the standard US keyboard or the US International Keyboard. You can see which one is active in the lower-right side of your taskbar near the date. It will either read <strong>ENG / US</strong> or <strong>ENG / INTL</strong>. Click on that (or just hit <strong>Windows key+space bar</strong>) and a pop-up menu will let you switch from one to the other.</p>  <figure class=\"e-image\">        <img alt=\"Your chosen keyboard will be shown on the right side of the taskbar; select it to change your keyboard.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gS9IAbYzZSIJWNqsfm0jrcGC1EU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417973/Screenshot__229_.png\">      <figcaption><em>The current keyboard will be shown on the right side of the taskbar; select it to change your keyboard.</em></figcaption>  </figure><p id=\"EZgsPc\">The US International Keyboard gives you two ways to add a special character:</p><ul><li id=\"gyKMWW\">Use the right-hand Alt key in combination with the appropriate letter to get one of the more common combinations. For example, <strong>Alt+e</strong> will result in <strong>é</strong>.</li><li id=\"CRWm4n\">Press the symbol you want to use and then the letter you want to use it with. For example, if you first press the <strong>~</strong> symbol and then the <strong>n</strong> key, you’ll get <strong>ñ</strong>.</li></ul><p id=\"0URckU\">Washington State University <a href=\"https://slcr.wsu.edu/help-pages/microsoft-keyboards-us-international/\">has published a useful chart</a> showing all of the symbols you can get using the US International Keyboard.</p><h2 id=\"F8Ftnt\">Use the Unicode value</h2><p id=\"cLBy3k\">Remember the character map? If you look at the lower right-hand corner of the character map after you’ve chosen a letter or special character, you’ll see the word <strong>Keystroke</strong> followed by <strong>Alt</strong> and a four-digit number. This number represents the <a href=\"https://en.wikipedia.org/wiki/Unicode\">Unicode value</a> of the symbol, and it’s the time-honored standard for adding characters.</p><p id=\"SKmqL4\">If you use a few special characters consistently, it can be faster to simply add the character you want using your usual keyboard. There are several ways to do this; here are two of the easiest (each of which has its limitations):</p><ul><li id=\"dMoLKy\">Press the Alt key and then type the four-digit Unicode value. For this to work, you need to have a separate number pad on your keyboard, and the NumLock key should be enabled.</li><li id=\"PrXVUY\">If you’re working with Microsoft Word, WordPad, Outlook, or another Microsoft app, you can type in the Unicode value and then type <strong>Alt-X</strong>.</li><li id=\"Hnw0dE\">You can also press the Control key plus a symbol and then the letter you want to accent. For example, <strong>Ctrl+’</strong> and <strong>e</strong> will result in <strong>é</strong> — assuming you’re in a Microsoft app.</li></ul>",
  "image": "https://cdn.vox-cdn.com/thumbor/2QKO2bNugmP4qprg0DG9hmadt0M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22341483/mchin_190527_4449_0006.jpg",
  "description": "There are two ways to add special characters to a Windows PC.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}