{
  "title": "How to update Google Chrome",
  "url": "https://www.theverge.com/22949383/google-chrome-update-how-to-mac-pc",
  "date": "2022-02-25T15:00:00.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/aVfmo8w84aBr3HQ88WPYp-K-1RE=/433x0:2218x1190/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70549465/Screen_Shot_2022_02_24_at_4.42.34_PM.0.png\" />    </figure>  <p id=\"BgcQ4M\">Okay, let’s start with the obvious: it’s important to keep a browser — any browser — up to date so that it can stay ahead of any malware or other nasties that are out there. It also helps you keep up with new features and interface improvements.</p><p id=\"4cSxNN\">If you’re a Chrome user, it’s likely that your browser will automatically update itself to the latest available version when it’s restarted. However, if you (like me) have a tendency to keep your browser open for long periods of time, it’s possible that it will not update. In that case, you can do it manually.</p><p id=\"438KF0\">How will you know whether your browser needs updating? Because when you look at the three dots in the upper right corner (which Google calls “More”), you won’t just see those three dots — you’ll see the word “Update” against a green, yellow, or red background. According to Google, green means there was an update less than two days ago, yellow means an update was released about four days ago, and red means it’s been at least a week since the last update.</p><p id=\"tQ8AxX\">If you see the “Update” word there — or if you simply want to see when your system was last updated — just follow these directions:</p><ul><li id=\"hCNHW7\">Click on the three dots</li><li id=\"Kj6dXQ\">Go to “Help” &gt; “About Google Chrome” </li></ul>  <figure class=\"e-image\">        <img alt=\"You can find out if you need to update in “About Google Chrome”\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rIyVHu-JvkpLUK11EvEoGbhVKl4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23268878/Screenshot__140_.png\">      <figcaption><em>You can find out if you need to update in “About Google Chrome”</em></figcaption>  </figure><ul><li id=\"PepWRx\">If your browser needs updating, there will be a button that says “Update Google Chrome.” (If no update is available, there won’t be any button.) </li><li id=\"YgxqdX\">It’s possible that an update has been downloaded, but your browser needs to be relaunched in order to enable it. If that’s the case, there will be a button that says “Relaunch.”</li></ul>  <figure class=\"e-image\">        <img alt=\"If you need to relaunch in order to update Chrome, there will be a Relaunch button.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7q0DFHppEc2zMZyELmf_W9z9TpQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23268875/Screen_Shot_2022_02_24_at_2.36.13_PM.png\">      <figcaption><em>If you need to relaunch in order to update Chrome, there will be a Relaunch button.</em></figcaption>  </figure><p id=\"jKBdYr\">If, for some reason or other, the update won’t work, or there are other problems, you may be asked to re-install Chrome. Here’s how you go about it:</p><p id=\"XuXX9K\">If you only use Chrome on one computer, it’s not a bad idea to backup your bookmarks first:</p><ul><li id=\"La72Qv\">From the three dots in the upper right corner, select “Bookmarks” &gt; “Bookmark Manager.”</li><li id=\"Q7Ancn\">Click on the three dots next to the search field, and select “Export bookmarks” </li><li id=\"7WMslb\">Choose where you want the file to be saved, and click on “Save”</li></ul>  <figure class=\"e-image\">        <img alt=\"Export your bookmarks before uninstalling Chrome, just in case.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/w1tlTc5Z9_Nlc6moT9cc6z2OEsw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23268982/Screenshot__141_.png\">      <figcaption><em>Export your bookmarks before uninstalling Chrome, just in case.</em></figcaption>  </figure><p id=\"E9eQAx\">Okay, now you can uninstall your current version of Chrome (the process depends on what type of system and OS you’re working with; <a href=\"https://support.google.com/chrome/answer/95319\">here are Google’s directions</a>). Once it’s uninstalled, download and install Chrome again. If you sign in with your usual account, you should get all your bookmarks, extensions, etc. back again — if you don’t, you can import your backup by going to those three dots and selecting “Bookmarks” &gt; “Import Bookmarks...” and choosing “Bookmarks HTML File.”</p><p id=\"sfaskv\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZuLRAGAfV4lQ60pn7IXATQSwKe8=/189x0:2462x1190/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268989/Screen_Shot_2022_02_24_at_4.42.34_PM.png",
  "description": "You can help your Chrome browser update manually.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}