{
  "title": "How to change the font on your Samsung Galaxy phone",
  "url": "https://www.theverge.com/23014763/samsung-galaxy-phone-change-font-a53-s22-plus",
  "date": "2022-04-07T15:46:17.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/B5CCDyYxX0Oa5MndEz1w_6yzFL0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70721840/vpavic_220201_5008_0023_Edit.0.jpg\" />        <figcaption><em>Follow a few quick steps to download and apply a new font to your Galaxy phone.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"Weg72t\">One of the best things about a Samsung Galaxy phone is that it isn’t a “one size fits all” experience. Case in point: your phone’s font. If you’re not happy with the default choice, you can change it to something that’s easier to read or something that expresses your personal style a little more. After all, you probably spend hours every day checking your phone, so you should really like the font you’re looking at. Here’s how to change and adjust the font on a Samsung Galaxy phone.</p><p id=\"8X9hxJ\">I used a <a href=\"https://www.theverge.com/2022/3/17/22978286/samsung-galaxy-a53-5g-price-specs-screen-battery\">Samsung Galaxy A53 5G</a> running One UI 4.1 for the following steps:</p><ul><li id=\"cxiDDL\">Go to <strong>Settings</strong> &gt; <strong>Display</strong>. </li><li id=\"cz0l01\">Scroll down and select <strong>Font size and style</strong>. On this menu page, you can choose to bold the current font, which might spice up the look of your font enough for your taste. You can also adjust the font size, too. But if you want to change the font itself, you’ll want to proceed and tap <strong>Font style</strong>. </li><li id=\"ogjEYj\">Here, you can choose from a couple of other pre-loaded options, but for more choices, tap <strong>Download fonts</strong>. This will take you to the Galaxy Store app. </li><li id=\"uViEhM\">The top option, called Samsung Sans, doesn’t require you to log into the app store to install it, but other options will. Most of them are from a third-party developer and cost a small fee ($1.79 or $2.99, mostly). </li><li id=\"jx5dTO\">If you don’t like the idea of paying for a font, you can tap the <strong>Top free</strong> option at the top of the screen. There aren’t too many to choose from, but if you’re feeling feisty, the Samsung-developed Cool Jazz is kind of fun. Otherwise, Samsung Sans is the safe, sophisticated choice.</li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6NdHUrTf38LaPXGqFdhIjc1x1TY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23373982/Screenshot_20220406_200522_Settings.jpg\">      <figcaption><em>You can find fonts you’ve already downloaded in display settings, or tap “Download fonts” to add more.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dTYClsuQ0LUu1fRehxd3emhRHqk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23373989/Screenshot_20220407_081536_Galaxy_Store.jpg\">      <figcaption><em>New fonts can be downloaded from the Galaxy Store. Some are free, but most cost about $2.</em></figcaption>  </figure></div></div></div><p id=\"353zHD\">For the paid options, you can actually sort of “try before you buy” to get a better feel for them. </p><ul><li id=\"KG5lbX\">Tap on one of the options to get to the app store page for that font. </li><li id=\"YyW9Dk\">You can select <strong>See sample</strong> to look at all of the characters and experiment with different sizes, or tap <strong>Try it out</strong> to take it for a little test drive. A mock text chat will pop up, and you can type your own sample text to see how it looks in action.</li></ul><p id=\"85pHfy\">You picked a new font. Congrats! Now what? For starters, know that you won’t see it absolutely everywhere on your phone. All of the text in system menus, on your home screen, and your notifications will appear in your new font of choice. The change will even apply to some text in certain apps, like Facebook and Netflix. But in other places, you’ll see text in a default font. (That’s too bad because I was really hoping to <a href=\"https://www.theverge.com/2022/4/5/23011810/elon-musk-twitter-sec-board-member-moderation\">read Elon Musk’s tweets in Cool Jazz</a>.)</p><p id=\"Wa1LMr\">If and when you grow tired of your new typeface, you can always go back to the default. And you won’t have to make another trip to the Galaxy Store if you change your mind and want to reinstate your new font again — it will appear among the options on the font menu page. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/E9bVETTHI2Yx8Vx-26bcVhyjDms=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23227005/vpavic_220201_5008_0023_Edit.jpg",
  "description": "Serif? Sans Serif? It’s your world.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}