{
  "title": "How to choose a fitness tracker",
  "url": "https://www.theverge.com/22940671/fitness-tracker-how-to-choose-specs-price-features-smartwatch",
  "date": "2022-02-18T15:39:12.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DwelG8opLPZlN74-1-Fpy8x_n7Q=/0x85:2040x1445/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70525391/jpeters_210910_4757_0001.0.jpg\" />        <figcaption>Photo by Jay Peters / The Verge</figcaption>    </figure>  <p>There’s more to consider beyond specs and price</p> <p class=\"p--has-dropcap p-large-text\" id=\"fzfWNf\">Picking a fitness tracker is a deeply personal choice. Unlike most gadgets, you’re meant to wear these all the time. And while many of us share similar health goals, our bodies and needs are highly individualized. The fitness tracker that everyone else raves about may not work for you and vice versa. </p><p id=\"Be10oc\">That’s what makes buying a fitness tracker tricky. But don’t worry. Here are a few things to consider when you’re deciding which tracker to buy.</p><h2 id=\"PDwGEE\">Find your “why” and go from there</h2><p id=\"kIaVHI\">Fitness instructors love to bang on about “<a href=\"https://lifehacker.com/do-the-why-exercise-to-find-your-deepest-motivation-1729421488\">finding your why</a>,” but it’s also the first thing you should ask yourself when buying a tracker. Why do you want a fitness tracker to begin with? To lose weight? Train for a marathon? Improve your sleeping habits? Fitness trackers are a motivational tool, but they can’t help if you’re unclear about your goals.</p><p id=\"N3eiCn\">Once you’ve got your why, it’s easier to figure out what specs and features you should prioritize. For example, say your big why is to train for a marathon. Regardless of skill level, that means you’re going to need something that can track GPS distance, monitor heart rate, and comes with long battery life. But if your ultimate goal is to improve your sleep, you may not need a tracker with built-in GPS at all. You’ll want long battery life, perhaps a SpO2 sensor, and a tracker that’s capable of providing detailed sleep insights.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/v0C2gDJgcgpeBoRbjtuI8WrxZTg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22864049/jpeters_210914_4757_0008.jpg\">      <cite>Photo by Jay Peters / The Verge</cite>      <figcaption><em>The Fitbit Charge 4 (left) and Charge 5 (right) belong to one of the most popular fitness tracker lines.</em></figcaption>  </figure></div><h2 id=\"Xw7DTM\">Understanding sensors and fitness jargon</h2><p id=\"MS3UpW\">Spec sheets and fitness buzzwords can be overwhelming. But no matter what fancy marketing a company might use, they all boil down to the same basic sensors and metrics.</p><p id=\"IRFhht\">First off, all fitness trackers have a combination of accelerometers and gyroscopes to detect motion. Some will add altimeters and barometers to measure elevation or how many stairs you’ve climbed in a day. </p><p id=\"5OlaIn\">For health tracking, nearly all modern trackers have a photoplethysmography (PPG) sensor. These are green LEDs that shine light through your skin to measure heart rate. There are also an increasing number of trackers that include red LEDs or SpO2 sensors to measure blood oxygen levels. </p>  <figure class=\"e-image\">        <img alt=\"Close up of Garmin Fenix 7S sensor array\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6EqgPplirDKLJ8hxiLBzDAg3HwM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242339/vsong_220209_5015_0004.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The sensor array on the Garmin Fenix 7S</em></figcaption>  </figure><p id=\"dG3sQF\">More advanced or specialized trackers will include a few extra sensors. For instance, if you see a tracker has EKG capabilities, that means it has an electrode. Meanwhile, Samsung’s <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4</a> has a 3-in-1 sensor that measures heart rate, enables EKGs, and analyzes body composition. The <a href=\"https://www.theverge.com/21450123/fitbit-sense-review\">Fitbit Sense</a> also has an electrodermal activity sensor, which measures minuscule levels of sweat on your skin to determine your stress levels. Meanwhile, the <a href=\"https://www.theverge.com/22789248/oura-ring-3-review-sleep-tracker-fitness-tracker\">Oura Ring</a> has body temperature sensors to help determine your sleep quality.</p><div id=\"pTVhQq\"><div data-anthem-component=\"productcard:9603483\"></div></div><p id=\"QT8sSI\">Some fitness trackers will also opt for built-in GPS, which means the watch can directly connect to GPS systems without your phone. Others will use your phone’s GPS. </p><p id=\"pRZxeo\">The sensors in a device will partially determine the data you can track. However, some companies have developed more complex algorithms to offer in-depth analysis. You can generally sniff out the more full-featured trackers by the number of sensors they have and the type of metrics they track. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Apple Watch Series 7 charges faster but has the same overall battery life.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C9NguEoxluYKwrSjCZzXL_9ZraI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22908901/vpavic_211006_4796_0032_Edit.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The Apple Watch Series 7 has an advanced sensor array that also enables EKGs.</em></figcaption>  </figure></div><p id=\"tO4LGL\">If you want more advanced fitness insights, three metrics you should know are heart rate variability (HRV), VO2 Max, and SpO2. </p><ul><li id=\"1LxttQ\">HRV is a metric measuring the fluctuations of time between heartbeats. It’s often used as a measure of how well you’ve recovered from a workout or to estimate stress levels. </li><li id=\"9EKvRa\">SpO2 is often used interchangeably with pulse oximetry. The gist is that it measures how oxygenated your blood is. Companies are still figuring out how to best utilize this metric, but you frequently see it pop up in sleep and recovery tracking. </li><li id=\"dqSuYW\">VO2 Max is a metric that measures the maximum amount of oxygen your body can use during intense exercise. It’s often used to measure your overall cardio fitness and your training progress. </li></ul><h2 id=\"RAGec4\">Overall health versus hardcore training</h2><p id=\"T3fCXK\">There’s a wide range of trackers for all sorts of fitness levels and goals. </p><p id=\"0VQQe1\">Companies like Garmin and Polar, for example, are well known among outdoors enthusiasts and triathletes. They also have entry-level devices, but that’s not where their main strengths are. </p><p id=\"ci67O0\">Fitbit offers more general use devices that are better suited to people who prioritize overall health. </p>  <figure class=\"e-image\">        <img alt=\"Screenshot of the sleep tracking screen in the Halo app\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JNa_B72dE5MebzwoHmXHYlfb0Bk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23076147/akrales_211207_4912_0116.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The Amazon Halo View is another example of an inexpensive tracker, though it tracks some questionable metrics. </em></figcaption>  </figure><p id=\"9XSOKb\">Health-oriented trackers often come with breathing reminders, guided meditation, hydration and food logging, and period tracking. Aesthetically, they also tend to be more pleasing and have multiple style options. </p><div id=\"UQDnJr\"><div data-anthem-component=\"productcard:11056890\"></div></div><p id=\"wnIMMy\">Hardcore fitness watches are more likely to prioritize durability, downloadable maps, turn-by-turn navigation, and in-app training programs. They’ll also have activity profiles for more obscure sports. For example, Garmin just added kiteboarding on the <a href=\"https://www.theverge.com/22934516/garmin-epix-2-review\">Epix 2</a> and <a href=\"https://www.theverge.com/2022/1/18/22883556/garmin-fenix-7-epix-gps-smartwatches-outdoors-fitness\">Fenix 7 Series</a>. And if you’re a swimmer, you’ll want something with at least 5ATM of water resistance. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"A normal ring, the Oura Ring Gen 3 (center), and the Oura Ring Gen 2 (left)\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JB3x_MgJbOVJuv8rks-1RyStRCk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23035230/vsong_211117_4890_0010.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Oura Ring Gen 3 (middle) and Oura Ring Gen 2 (right) are examples of non-wrist based sleep trackers</em></figcaption>  </figure></div><p id=\"n7P0m0\">Meanwhile, there’s also a growing category of dedicated recovery trackers. These trackers focus on telling how well your body’s recovered from exercise so you can better plan your training. The Oura Ring and Whoop 4.0 are good examples in this area. These are more passive trackers that focus on advanced sleep tracking and how it relates to your overall activity. They don’t have screens, and you won’t be getting any notifications or smart features on them.</p><p id=\"FtP00n\">Of course, there will be overlap. A <a href=\"https://www.theverge.com/22680300/fitbit-charge-5-review-fitness-tracker\">Fitbit Charge 5</a>, for example, can get you a ton of wellness features, built-in GPS, and a new Daily Readiness feature that gauges your recovery. That said, it’s still not going to be as in-depth with your activity metrics as a Garmin would. </p><h2 id=\"dEAu7l\">Do you actually want a smartwatch instead?</h2><p id=\"T3JzQw\">The thing about fitness trackers is they’re often lacking on the connectivity front. You’re likely not going to find them including LTE, robust third-party apps, contactless payments, or a digital assistant. Or if you do, it might be one or two of those — but certainly not all of them.</p><p id=\"N3zTGi\"></p>  <figure class=\"e-image\">        <img alt=\"The Galaxy Watch 4 has a sensor for measuring body fat percentages\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KDiVcplrsCFyP1eccFHu_JF93us=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22787997/dbohn_210816_4717_0003.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>The Samsung Galaxy Watch 4 is a competent health and fitness tracker with some novel features, like body composition analysis.</em></figcaption>  </figure><p id=\"i923tV\">If you’re looking to leave your phone at home, you might be better off with a smartwatch that has decent health features. The <a href=\"https://www.theverge.com/22722533/apple-watch-series-7-review-screen-watchos-features\">Apple Watch Series 7</a> is a great example of this. It has a ton of health tracking and wellness features but also cellular models so you don’t need to carry your phone while you exercise. You can stream music directly to your wrist, take or make calls, and ask Siri to look up things for you. After you’re done exercising, you can also use the watch to pay for a bottle of water at the local deli. Samsung’s Galaxy Watch 4 is a good alternative for Android users and offers many of the same features. </p><div id=\"kWwwz5\"><div data-anthem-component=\"productcard:10933315\"></div></div><div id=\"URlKJK\"><div data-anthem-component=\"productcard:10875994\"></div></div><p id=\"WAXuv7\">The trade-off is terrible battery life. The Series 7 and Galaxy Watch 4 don’t last much longer than a day (maybe two) on a single charge. That makes them less than ideal for sleep tracking or anyone who wants to track more than three hours of GPS activity. Meanwhile, Fitbits, Garmins, and Polar devices can often go for at least a week — if not several.</p><h2 id=\"EnM1V4\">Don’t forget about comfort</h2><p id=\"hWR5Jy\">When browsing your options, don’t forget to check the size and thickness of the watch, as well as the materials it’s made from. If your fitness tracker isn’t comfortable, you’re not going to wear it. End of story. </p><p id=\"30IiBh\">Comfort is especially important if sleep tracking is a priority. You don’t want to buy a big hulking tracker, only to wake up in the middle of the night determined to take it off. Many people often have trouble sleeping with wrist-based trackers, so you might also want to look into non-wrist-based sleep gadgets like the Oura Ring. (They’re not as common, however.)</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/km8-YT9l2rHnAPMsdq9mZojeYYw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242334/tricker_220129_5015_0001.jpg\">      <cite>Photo by <a class=\"ql-link\" href=\"https://www.instagram.com/gatomena/\" target=\"_blank\">Rodrigo Mena Landshut</a></cite>      <figcaption><em>This 47mm Garmin Epix 2 will fit some people fine, and be too uncomfortable for others.</em></figcaption>  </figure></div><p id=\"DcpUGM\">A bad fit can also warp your data. If a tracker isn’t snug against your skin during exercise, you might get inaccurate heart rate readings. If it’s sliding up and down your arm, your movement data may also be borked. </p><p id=\"McmH0k\">This isn’t as big of a problem for people with larger wrists. However, if you’ve got smaller wrists, it’s not a good idea to buy a watch that’s over 42mm. This is not as much of an issue with casual trackers, but it becomes important once you get into multisport GPS watches. Those watches often measure from 45mm to 47mm, but I’ve tested ones that go up to 51mm, like the Fenix 6X Pro Solar. Many companies don’t offer smaller options for advanced fitness watches, but a handful do. Garmin, for example, tends to offer multiple sizes for each product.</p><h2 id=\"vraXIa\">Price</h2><p id=\"VVlfxi\">A fitness tracker can be as cheap as $60 or as expensive as $1,000. The more features you want, the more it will cost you. On the lower end, you tend to see no-frills fitness bands like the Mi Band 6 and Fitbit Inspire 2. They have simpler screens and a smaller feature set but <em>tons</em> of battery life. On the higher end is where you’ll find luxury smartwatches and premium multisport GPS watches. The Garmin Fenix 7 lineup, for example, starts at $699.99 and goes all the way up to $999.99.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nftwUDOcInF6oGnIY6znOZ3FB74=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23162060/vsong_220110_4962_0004.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Garmin Vivomove Sport is an excellent example of an affordable tracker at $179.99</em></figcaption>  </figure><p id=\"zGS2JB\">For most people, the sweet spot is in the $150 to $350 range. Trackers under $250 have gotten a lot more advanced in the past few years as well. The Fitbit Versa 3 retails for $229.95, but you can often find it on sale for less. It’s a good example of a fitness tracker that tracks a wide range of health features but has some smartwatch-like features like a digital assistant. </p><div id=\"KJ2f8K\"><div data-anthem-component=\"productcard:11056921\"></div></div><p class=\"c-end-para\" id=\"FCIQIM\">The other thing to look out for is subscriptions. Unfortunately, more wearable makers are shifting toward a subscription model. Some, like Fitbit, give you an option. You could pay $9.99 for Fitbit Premium, but you don’t have to. The catch is the best features are often locked behind that paywall. Fitbit’s Daily Readiness Score metric, for instance, is exclusive to Fitbit Premium subscribers. Other companies make subscriptions a requirement. Whoop, for example, charges $30 for a monthly membership. That said, there are still excellent subscription-less trackers out there. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/50x7zcbQTQyC-zHVGAqcMQH11pY=/0x231:2040x1299/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22864043/jpeters_210910_4757_0001.jpg",
  "description": "Here’s what to consider when buying a fitness tracker.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}