{
  "title": "How the Buffalo shooting livestream went viral",
  "url": "https://www.theverge.com/2022/5/17/23100579/buffalo-shooting-twitch-livestream-viral-content-moderation",
  "date": "2022-05-17T18:46:41.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rW0bwfcDW12Q953Id3wsJghnOZo=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70879876/acastro_220516_5229_0001_01.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"sE4oZ1\">When a gunman pulled into the parking lot at a grocery store in Buffalo, New York, on Saturday in a racist attack targeting a Black community, his camera was already rolling.</p><p id=\"5SU673\">CNN reports that <a href=\"https://www.cnn.com/2022/05/15/us/payton-gendron-buffalo-shooting-suspect-what-we-know/index.htmlh-livestream-buffalo-massacre/index.html\">a livestream on Twitch</a> recorded from the suspect’s point of view showed shoppers in the parking lot as the alleged shooter arrived, then followed him inside as he began a rampage that killed 10 people and injured three. Twitch, popular for gaming livestreams, removed the video and suspended the user “less than two minutes after the violence started,” according to Samantha Faught, the company’s head of communications for the Americas. <a href=\"https://www.washingtonpost.com/technology/2022/05/16/buffalo-shooting-live-stream/\">Just 22 people</a> saw the attack unfold in real time online, <em>The Washington Post </em>reports.</p><p id=\"y38toy\">But millions saw the livestream footage after the fact. Copies and links to the reposted video proliferated online after the attack, spreading to major platforms like Twitter and Facebook as well as lesser-known sites like Streamable, where the video was viewed more than 3 million times, <a href=\"https://www.nytimes.com/2022/05/15/business/buffalo-shooting-social-media.html\">according to <em>The New York Times</em></a><em>.</em></p><p id=\"GL0iSJ\">This isn’t the first time perpetrators of mass shootings have broadcast their violence live online with footage subsequently spreading. In 2019, a gunman attacked mosques in New Zealand’s Christchurch, live streaming his killings on Facebook. The platform said it <a href=\"https://www.theverge.com/2019/3/17/18269453/facebook-new-zealand-attack-removed-1-5-million-videos-content-moderation\">removed 1.5 million videos</a> of the attack in the 24 hours following. Three years later, with footage from Buffalo reuploaded and reshared days after the deadly attack, platforms continue to struggle with stemming the tide of violent, racist, and antisemitic content created from the original.</p><p id=\"XzrPvz\">Moderating livestreams is especially difficult as things unfold in real time, says Rasty Turek, CEO of Pex, a company that creates content identification tools. Turek, who spoke to <em>The Verge </em>following the <a href=\"https://www.theverge.com/2019/3/15/18267424/new-zealand-shooting-youtube-video-reupload-content-id-livestream\">Christchurch shootings</a>, says if Twitch was indeed able to disrupt the stream and take it down within two minutes of its beginning, that response would be “ridiculously fast.” </p><p id=\"ZIBX7u\">“That is not only not industry standard, that is an achievement that was unprecedented in comparison to a lot of other platforms like Facebook,” Turek says. Faught says Twitch removed the stream mid-broadcast but did not respond to questions around how long the alleged shooter was broadcasting before violence began or how Twitch was initially alerted to the stream.</p><div class=\"c-float-right\"><aside id=\"eX42YQ\"><q>“The challenge is what happens with that video afterwards.”</q></aside></div><p id=\"D6krUM\">Because live streaming has become so widely accessible in recent years, Turek acknowledges that getting moderation response time down to zero is impossible — and perhaps not the right framing to think about the problem. What matters more is how platforms handle copies and reuploads of the harmful content. </p><p id=\"9YnIU8\">“The challenge is not how many people watch the livestream,” he says. “The challenge is what happens with that video afterwards.” In the case of the livestream recording, it spread like a contagion: according to <em>The</em> <em>New York Times</em>, Facebook posts linking to the Streamable clip racked up more than <a href=\"https://www.nytimes.com/2022/05/15/business/buffalo-shooting-social-media.html\">43,000 interactions</a> as the posts lingered for more than nine hours.</p><p id=\"LCRebK\">Big tech companies have created a content detection system for situations like this. The Global Internet Forum to Counter Terrorism (GIFCT), created in 2017 by Facebook, Microsoft, Twitter and YouTube, was formed with the goal of preventing the spread of terrorist content online. After the Christchurch attacks, the coalition said it would <a href=\"https://www.theverge.com/2021/7/26/22594067/gifct-facebook-twitter-youtube-microsoft-far-right-terrorism-manifestos-banned\">begin tracking</a> far-right content and groups online, after previously focusing mostly on Islamic extremism. Material related to the Buffalo shooting — like hashes of the video and manifesto the shooter allegedly posted online — were <a href=\"https://gifct.org/2022/05/14/cip-activated-buffalo-new-york-shooting/\">added</a> to the GIFCT database, in theory allowing platforms to automatically catch and take down reposted content. </p><p id=\"gUDc76\">But even with GIFCT acting as a central response in moments of crisis, implementation remains a problem, Turek says. Though coordinated efforts are admirable, not every company participates in the effort and its practices aren’t always clearly carried out. </p><p id=\"lcUEic\">“You have a lot of these smaller companies that essentially don’t have the resources [for content moderation] and don’t care,” Turek says. “They don’t have to.”</p><p id=\"dsg9qN\">Twitch indicates it caught the stream fairly early — the Christchurch shooter was able to <a href=\"https://www.washingtonpost.com/technology/2019/03/21/facebook-reexamine-how-recently-live-videos-are-flagged-after-christchurch-shooting/\">broadcast for 17 minutes</a> on Facebook — and says it’s monitoring for restreams. But Streamable’s slow response means that by the time the reposted video was removed, millions had viewed the clip and a link to it was <a href=\"https://www.nytimes.com/2022/05/15/business/buffalo-shooting-social-media.html\">shared hundreds of times across Facebook and Twitter</a>, according to <em>The New York Times</em>. Hopin, the company that owns Streamable, did not respond to <em>The Verge</em>’s request for comment.</p><p id=\"kHsWfZ\">Though the Streamable link was taken down, portions and screenshots from the recording are easily accessible on other platforms like Facebook, TikTok, and Twitter, where it’s been reuploaded. Those major platforms have then had to scramble to remove and suppress the reshared versions of the video.</p><div class=\"c-float-left\"><aside id=\"YWXXTL\"><q>Days after the shooting, portions of the video that users reuploaded to Twitter and TikTok remain</q></aside></div><p id=\"3Woo7S\">Content filmed by the Buffalo shooter has been removed from YouTube, says Jack Malon, a company spokesperson. Malon says the platform also is “prominently surfacing videos from authoritative sources in search and recommendations.” Search results on the platform return news segments and official press conferences, making it harder to find any reuploads that do slip through.</p><p id=\"zQfCrg\">Twitter is “removing videos and media related to the incident,” says a company spokesperson who declined to be named due to safety concerns. TikTok did not respond to multiple requests for comment. But days after the shooting, portions of the video that users reuploaded to Twitter and TikTok remain.</p><p id=\"oQTUcJ\">Meta spokesperson Erica Sackin says multiple versions of the video and the suspect’s screed are being added to a database to help Facebook detect and remove content. Links to external platforms hosting the content are permanently blocked.</p><p id=\"Emxi0c\">But even into the week, clips appearing to be from the livestream continued to circulate. On Monday afternoon, <em>The Verge </em>viewed a Facebook post with two clips from the alleged livestream, one showing the attacker driving into the parking lot talking to himself and another showing a person pointing a gun at someone inside a store as they screamed in terror. The gunman mutters an apology before moving on, and a caption overlaid on the clip suggests the victim was spared because they were white. Sackin confirmed the content violated Facebook’s policies, and the post was removed shortly after <em>The Verge </em>asked about it.</p><p id=\"U9UG26\">As it’s made its way across the web, the original clip has been cut and spliced, remixed, partially censored, and otherwise edited, and its widespread reach means it will likely never go away. </p><p id=\"lWNj8f\">Acknowledging this reality and figuring out how to move forward will be essential, says Maria Y. Rodriguez, an assistant professor at the University of Buffalo School of Social Work. Rodriguez, who studies social media and its effects on communities of color, says moderation and preserving free speech online take discipline, not just around Buffalo content but also in the day-to-day decisions platforms make.</p><p id=\"zf0fFt\">“Platforms need some support in terms of regulation that can offer some parameters,” Rodriguez says. Standards around how platforms detect violent content and what moderation tools they use to surface harmful material are necessary, she says.</p><p id=\"cfEBRo\">Certain practices on the part of platforms could minimize harm to the public, like sensitive content filters that give users the option to view potentially upsetting material or to simply scroll past, Rodriguez says. But hate crimes aren’t new and similar attacks are likely to happen again. Moderation, if done effectively, could limit how violent material travels — but what to do with the perpetrator is what has kept Rodriguez awake at night.</p><p id=\"Wq2H1K\">“What do we do about him and other people like him?” she says. “What do we do about the content creators?”</p><p id=\"QhfbkT\"></p><p id=\"4e7TGR\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rdZctNAmxCPFB7DZ9VJ63Y0szWU=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23519612/acastro_220516_5229_0001_01.jpg",
  "description": "A deadly broadcast has now been viewed by millions.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}