{
  "title": "How Our Flag Means Death’s creator made a period romance disguised as a pirate comedy",
  "url": "https://www.theverge.com/2022/4/15/23024365/our-flag-means-death-david-jenkins-interview",
  "date": "2022-04-15T15:00:22.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/J11U4s6ItVELoHPqGQUVLBhUwKE=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70753252/rhys_darby_taika_waititi_5.0.jpeg\" />    </figure>  <p>David Jenkins opens up about everyone’s favorite queer pirate show</p> <p class=\"p--has-dropcap\" id=\"RVPxaz\">For many people, <a href=\"https://www.polygon.com/reviews/22960695/our-flag-means-death-review-taika-waititi-rhys-darby\"><em>Our Flag Means Death</em></a> was an unexpected history lesson about the adventures of Stede Bonnet, the real 18th-century pirate who loved the high seas almost as much as he loathed <a href=\"https://www.smithsonianmag.com/history/the-gentleman-pirate-159418520/\">the “discomforts” of married life</a> with his wife. <em>Our Flag Means Death</em>’s first season often leaned into the absurd as it followed Rhys Darby’s interpretation of Bonnet putting together a crew of vagabonds willing to serve under a soft and inexperienced member of the landed gentry playing a pirate. But what makes the show’s story work — aside from how much of it really does borrow elements from the real Bonnet’s life — is how it’s really only about piracy in the most roundabout sense.</p><p id=\"IAoWWn\">Surprised as many viewers were to learn that the real Stede and Blackbeard did spend a significant amount of time traveling together, what ended throwing many of <em>Our Flag Means Death</em>’s viewers for a loop was the revelation that its Stede and Blackbeard were falling in love. Of all the clever tricks — or fuckery, if you’d prefer — <em>Our Flag Means Death </em>managed to pull off, few were impressive as its ability to disguise the fact that it was <a href=\"https://www.polygon.com/23006926/bridgerton-x-our-flag-means-death-sex\">a period romance</a> all along, something series creator David Jenkins partially attributes to the expectations we bring to TV. When we spoke with Jenkins recently, he said that while it’s been great watching fans embrace <em>Our Flag Means Death</em>, the surprised responses to its character arcs speak to the importance of using genre fiction to better reflect and play with the realities of our world.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3pXDMd9maMBu7yCC5C-UdDjz6oo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23392122/kristian_nairn_nathan_foad_matthew_maher_joel_fry_samson_kayo_taika_waititi_will_arnett.jpeg\">      <cite>HBO Max</cite>      <figcaption>The crew of the Revenge along with Ed and Calico Jack.</figcaption>  </figure><p id=\"X8F8fw\"><strong>Before we talk about Stede and Ed, let’s talk about David and Taika as showrunner and executive producer.</strong></p><p id=\"9hCdrT\">David Jenkins: For me, the joy of having an EP like Taika is that you know he’s there and is going to come direct the pilot, but then he just leaves me alone, and I get to make the show as weird as I want to make it. We get to take it in the writers room in directions that interest us, and no one’s trying to get in there and fuck with it too much. The great thing about Taika is that he comes back. He does actually direct the pilot — he doesn’t float away — and he decides that it’s well-written enough that he wants to be in it. And then he performs your fucking writing! </p><p id=\"fdj9BV\">There’s moments of improvisation, but like the amount that he’s served those scripts and the amount that he’s served my vision for what the show should be is humbling. When you’re looking at this person who’s incredible and it’s like, “Ah, man. They’re playing my notes. Oh my god, this is incredible.” It’s immensely gratifying.</p><p id=\"LH5BVj\"><strong>Is that something one hopes for, but one doesn’t bank on happening?</strong></p><p id=\"Gnckk6\">It’s rare, but I think that’s why he’s a very good producer. I don’t know a ton about his relationship with Sterlin [Harjo] on <a href=\"https://www.vox.com/22675835/reservation-dogs-hulu-fx\"><em>Reservation Dogs</em></a>, but that’s Sterlin’s thing. He conceived it with Taika, but Sterlin is the driving force behind that show and <a href=\"https://www.vulture.com/article/reservation-dogs-review-fx-on-hulu-series.html\">what it looks like</a>, and I think part of being a good producer is knowing when to go away and when to come back. Setting people up whose sensibilities you like, and then championing them, and supporting them without trying to control it too much is an amazing skill that I think very few people of his stature have.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NlsHEEY6hTpN93FjGEQvELqcFzk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23392128/rhys_darby_taika_waititi_2.jpeg\">      <cite>HBO Max</cite>      <figcaption>Blackbeard showing Stede how to take a sword to the gut (sensually) without dying</figcaption>  </figure><p id=\"GK6m7L\"><strong>What is it about Our Flag Means Death that made it so easy for people to really sort of miss the early queer subtext that’s barely subtext?</strong></p><p id=\"xnA3Gt\">I’m the wrong person to ask because I, well, I know a lot more now than I did a month ago, and I know a lot more now than I did two weeks ago based on how this show was going to roll out. I thought it was pretty clear to me that you get halfway through, and you’re like, “Oh, OK. These people have feelings for each other. And they’re attracted to each other.”</p><p id=\"K11EhP\"><strong>Little bit, yeah. </strong></p><p id=\"zG6yCO\">And it’s clear. I think I didn’t realize — because I see myself represented on camera, and I see myself falling in love in stories — I didn’t realize how deep the queer baiting thing goes. Being made to feel stupid by stories, I guess.</p><p id=\"iZTkDp\"><strong>How do you mean?</strong></p><p id=\"9lOXc1\">As we were breaking the season and looking at how it would go, part of me knew that, yes, Stede and Ed’s romance was going to be real. But one part of me felt like, “We’re going to do this story, and they’re going to kiss, and maybe that’s not even going to be that big a deal. Maybe it’ll just be a blip.” But then, looking at how people were kind of afraid to let themselves believe that we were doing that was a surprise to me, and it’s heartbreaking.</p><p id=\"nzHGF5\">I understand it much better now, and it’s like, oh, you were made to feel stupid by a bunch of shows — unintentionally, by and large, I think — but made to feel like “maybe I’m going to be up there. Maybe that’ll be me in this story.” And then at the end of it feeling like, “Aw. No, it’s not me. I’m not in this one.” That fucks with you at any age, I think, but especially when you’re young and impressionable. I know it would make me feel that I didn’t belong, and I think that’s part of where the response to the show comes from.</p><p id=\"w3mi1V\"><strong>Take me back to when you were first breaking the season and carving out your take on Stede and Ed. What was the key to building out romance between the two of them that felt organic and honest to them both? Not as historical figures but as characters taking shape in your mind?</strong></p><p id=\"zQer4F\">I’d never written a romance before this one, but I think with Ed and Stede, the question’s always “what’s the need for each other?” I think the need for Stede is pretty apparent in the beginning because he’s just this poor man who doesn’t know at all what he’s doing. Ed, I think, is at a point in his life where he needs to see somebody who’s a bit of an outsider artist who has a fresh take on piracy. Once you figure out what these kinds of characters are missing — what they’re looking for in each other — their stories start to take on their own lives, and they reveal things to you. Like, Stede’s such a great character because he unwittingly seduces this person by being his neat self and doing stuff in a slightly different way.</p>  <figure class=\"e-image\">        <img alt=\"A roughhewn pirate with a massive beard taking a cup of tea from a fey man in a dressing gown and a night coat.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AAcL4FWBJYpP-q1S7n78aRXSh3s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390613/rhys_darby_taika_waititi_3.jpeg\">      <cite>HBO Max</cite>      <figcaption>Stede offering Ed a cup of tea.</figcaption>  </figure><p id=\"yAW9Cg\"><strong>This is the first time I’ve heard anyone talk about the show through the Stede-as-seducer lens, but you’re totally right. There’s that one line </strong><strong> where he asks Blackbeard if he “fancies a fine fabric,” and it killed me because that’s a whole 18th-century pickup line. He’s cruising.</strong></p><p id=\"aBULa0\">It’s an unintentional seduction, I think, but yeah.</p><p id=\"zSO59E\"><strong>Talk to me about that — the unintentionality of Stede’s seduction and leading with that from a writing perspective.</strong></p><p id=\"mKsnpe\">It’s just that undeniable chemistry between two people falling in love at first sight, essentially. When they see each other, it’s that Beach Boys “Our Prayer” song that our editor Daniel Haworth pitched, and it’s just fantastic in that moment. I don’t know. I love looking at them as having a modern relationship where, you know, maybe you’ve heard about each other before you met, and then you’re kind of into what the other person’s doing, and then it turns out that they’re into what <em>you’re </em>doing. And then you <em>see </em>each other, and there’s <em>chemistry</em>?</p><p id=\"BgXM2k\">But then also, I think there’s something interesting about an amateur going up against the ultimate professional. I’m sure you’ve seen it, too — you’re overworked. But when you see someone who’s writing for fun, and you’re fucking tired and jaded, and you had a bunch of stupid shit happen, but you see that people who’s still <em>feeling</em> it? You remember, “Oh, right. That’s why I do it. This is what I need to get back to. Like, what the fuck? What am I doing?” </p><p id=\"u3vlr5\"><strong>Definitely.</strong></p><p id=\"hARReb\">I think “do you fancy a fine fabric” is unintentional, but it’s when he tucks the fabric into Blackbeard’s shirt and tells him that he wears fine things well that makes it work. That’s such a kind thing to say and such a perceptive thing for him to say in that moment, and sometimes you meet somebody and you can just see them like that.</p><p id=\"ELIrBV\"><strong>You’ve talked in the past about framing Stede as a really naive person with an immature sense of love before meeting Ed because he’d just never really experienced it before. What about Ed’s sense of love and romance, though? He’s this worldly person who’s already exhausted and put upon by his life Pre-Gentleman Pirate.</strong></p><p id=\"fbG5PE\">Yeah, I think they’re both very undeveloped in certain ways, but I think this is Ed’s first time falling in love, too, honestly. He’s more experienced, and he’s, I think, probably more physically experienced than Stede. But they’re these two middle-aged men who are underdeveloped in a certain way in terms of romantic emotional health as we understand it. It made sense to have that love be almost like a teenage version of falling in love — one with all these intense and conflicting feelings. They’re middle-aged, but Stede’s young. Ed’s young. Emotionally, they’re like 16, and they’ve both got a lot to learn.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/prC1dUwm6Yhyl-dZeEZ4obOxkVs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390627/taika_waititi_rhys_darby_0.jpeg\">      <cite>HBO Max</cite>      <figcaption>Ed and Stede attending an elite party.</figcaption>  </figure><p id=\"rEYXOu\"><strong>I want to talk to you about the final episode of the first season and that sort of pointed change that we see both of them go through once that classic misunderstanding has sort of been introduced, right? Stede’s “Crap, I do love him. I have to go get him.” Ed’s like, “He’s left me.” And that sort of feels as if they’ve branched off into two defined states that aren’t just going to be temporary. In that moment when they are sort of not in sync with each other anymore, what do they mean to each other?</strong></p><p id=\"5Kofvk\">I mean, I think it’s two sides of the same coin, which is why we use montage a couple of times at the end of that episode, and why it was important to me that it was scripted that way. Stede’s realizing he’s in love and finding out that he is actually in love is a surprise to him. It didn’t even occur to him that he got it right, and then Mary has to kind of tell him. I think Blackbeard feels like he’s never been rejected in this way before. So in a weird way, Stede’s feeling love — like a more mature version of love than he’s ever felt, and Blackbeard’s feeling a more profound, mature version of rejection. Because he’s never put himself out there like this, and it’s deranging him because he’s a highly emotional person. </p><p id=\"PpTipD\"><strong>There’s so many moments where Izzy’s opposition to Stede can be read as like, “Please stop fucking with my boss. You’re ruining our good thing here,” but that in and of itself also reads as a form of love between Izzy and Ed. As you were building out Izzy’s arc, what were the really important beats that you wanted for him to sort of land on as he keeps sort of being this thorn in the side of this burgeoning romance?</strong></p><p id=\"iHPypQ\">I think the key was casting Con. The part was written before we got him, and then we had a few scripts left to go, and I knew we had Con, and I would actually watch his audition to get back to Izzy’s center. He plays an exhausted quality that’s really lovely because this character could just be generically evil, and the way Con plays, it is like, he’s credible. I believe that he can do some damage if he wanted to. My favorite thing I’ve seen about the show is somebody saying that Con’s playing the only human with a bunch of Muppets. It does feel like that a bit where he’s like Charles Grodin in The Great Muppet Caper.</p><p id=\"2TRgFo\"><strong>There’s a lot of </strong><em><strong>Muppet Treasure Island</strong></em><strong> here.</strong></p><p id=\"HzBV98\">Yeah! And then and then, at the same time, I think Izzy’s deeply in love with Blackbeard, and it’s a very dysfunctional kind of love, and he’s like the jilted spouse who’s losing his man to fucking Stede Bonnet, and he can’t believe this is happening. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VJ1A1WfQRyHFuPP5IdFYyjyKll4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390631/con_o_neill_0.jpeg\">      <cite>HBO Max</cite>      <figcaption>Con O’Neil as Izzy.</figcaption>  </figure><p id=\"wvAQIh\"><strong>So much of this show is about romance, but it’s also like a very clever deconstruction of our ideas about masculinity. What sort of conversations did you have with the other writers about making sure that this was always going to be a show about pirates inhabiting different modes of being as opposed to, you know, Men On the High Seas? </strong></p><p id=\"5wtedu\">I feel like, particularly over the last five years, we’ve been treated to this burlesque of masculinity.</p><p id=\"Whw2LN\"><strong>How do you mean?</strong></p><p id=\"76MoLL\">Well, it’s meaningless, but you look at people going “look at President [Trump],” and they’re drawing him like a stereotypical macho man, but in actuality, he’s this doughy sack of shit in a suit. You look at Fox News, which is also an interesting burlesque of straight femininity and masculinity, but it’s done through this really distorted, almost pro-wrestling-like lens. It always felt oppressive to me growing up, and now we’ve hit this place where some people are really trying to hang onto these outdated ideas about gender, but society’s actually moving on and past them. I think just to take this very hetero, whitewashed genre and write into it more of what it actually was. There were a lot of pirates who were genderfluid, like <a href=\"https://en.wikipedia.org/wiki/Anne_Bonn\">Anne Bonny</a> and <a href=\"https://en.wikipedia.org/wiki/Mary_Read\">Mary Read</a>, who were doing the pirate thing before anyone was really talking about women getting into piracy. And then, as we were writing more into the ship’s queer culture, we realized that this is just more of what it was.</p><p id=\"uZM3PN\"><strong>Do you think of the show as a reexamination of the record in that sense?</strong></p><p id=\"MuW3qA\">Well, no, because at the same time, you wouldn’t want to meet the real Blackbeard. The real Blackbeard was a rapist who handed women over to his crew. The real Stede Bonnet was a slave owner. When we tell these stories, we have to be clear with what we’re doing because all of these people were despicable. To make a fictionalized version of this history, though, I think you have to try to staff a room where people have lived-in experiences that they can bring to the story, and we have to talk about things we’re experiencing now because these stories are timeless.</p><p id=\"dkFvLa\">In talking to the room while we were building it, we kept asking, “What do we want the show to be?” And the consensus in that very diverse room was that we wanted to show that isn’t just wallowing in trauma. We don’t have to do a coming out scene or focusing on the trauma of it — not to say that those stories aren’t valid. But we wanted a show where these characters can exist in a fantasy world and their race or gayness doesn’t automatically lead to a traumatic storyline for them. We have a lot of shows where... </p><p id=\"wgvw2d\"><strong>That’s the point? </strong></p><p id=\"KfIpf7\">Yeah, someone’s sexuality in a period piece is met with dire consequences. We have a lot that, you know? So what if we just didn’t do it.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jpShfvfulcjxjrt_RBuTD6EzqBw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390640/selenis_leyva_vico_ortiz.jpeg\">      <cite>HBO Max</cite>      <figcaption>Selenis Leyva as The Nun and Vico Ortiz as Jim.</figcaption>  </figure><p id=\"oDtD4z\"><strong>When you meet the nun who raised Jim in “This Is Happening,” she’s so matter-of-fact about them having always been more or less the way they are and raising them to seek revenge.</strong></p><p id=\"y6O9u0\">We had so many different permutations of the nun, and it was just great. Like, I’m old, man, so when I’m talking about these things, I’m trying to keep up with everyone and understand and ask the right questions. When you staff your room well, they’ll lead you there if you listen and say, “What can we do with this nun beyond the obvious?”</p><p id=\"c7KahS\"><strong>I feel like that’s very much a thing creators talk about now — the importance of making sure that their rooms have that kind of dynamism and diversity in them, but I’m curious to hear what those things mean to you as the creator of something like </strong><em><strong>Our Flag Means Death</strong></em><strong>.</strong></p><p id=\"0lNA0F\">I don’t know how anyone else does it, but for me, I think gender balance is great in a room, and non-binary writers are a part of that. The first thing is, can you write? Do I want to go on a 20-week car trip with you and vice versa? “Yes, and” is the most important thing in the room because if you get people who are “no, but,” the work is heavier on everyone’s shoulders, and then it is really just being like, “Who were the most interesting writers out there?” There is a demographic component to it that I think people shy away from, but it is what it is. I know that I want X, Y and Z perspectives in the room.</p><p id=\"O8ZHn4\"><strong>The show about the slave-owning pirate should probably have some people of color in the writers’ room.</strong></p><p class=\"c-end-para\" id=\"7AEyeg\">Right, and it’s not checking off a diversity list with a golf pencil but really being honest with yourself and asking, “Do I have the perspectives and terms of race, gender, sexuality to create a shared sociological imagination?” It’s fucked up because you write a show and a lot of the plaudits go to you, the showrunner, and it’s like you’re using all of these brains. You know, you have this horsepower of all of these writers like this. The season is the function of all of these brains coming together and creating one sociological imagination.</p><p id=\"QlfyBw\"><em>Our Flag Means Death </em>is now streaming on <a href=\"http://voxmediapartner.go2cloud.org/aff_c?offer_id=2&amp;aff_id=1&amp;source=VergeOurFlag&amp;aff_unique1=https://www.hbomax.com/a/grw-ofd\" rel=\"sponsored nofollow noopener\" target=\"_blank\">HBO Max</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XewY9CIgYAxEXjt9QF2kBXRMcc8=/0x103:1478x877/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390862/taika_waititi_rhys_darby_0.jpeg",
  "description": "David Jenkins opens up about everyone’s favorite queer pirate show",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}