{
  "title": "How to block a number on Apple’s iPhone",
  "url": "https://www.theverge.com/23053288/how-to-block-number-apple-iphone",
  "date": "2022-05-03T18:00:05.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"The iPhone 12 Pro Max is huge, but it has the best camera system on a smartphone\" src=\"https://cdn.vox-cdn.com/thumbor/xTav71m7M85LC8lV-bJma2h_ljs=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70827928/bfarsace_201106_4269_002.0.0.jpg\" />        <figcaption>Photo by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"oVB2Dn\">Whether you’re trying to get rid of spam or avoid hearing from a former friend or ex, blocking someone’s phone number is a vital tool for helping to preserve your privacy. We’ve covered various methods of <a href=\"https://www.theverge.com/21327304/spam-calls-how-to-stop-block-robocalls-robots-scam-iphone-android\">protecting yourself from robocalls</a>, spam, and other daily annoyances. But blocking a number is often the quickest and easiest way of shutting down unwanted digital intrusions.</p><p id=\"XW11Yw\">When you block a number, you’ll no longer receive phone calls, texts, or FaceTime requests that come in from the blocked number. The person at the other end will go straight to voicemail whenever they call you, but this is their only clue that they’ve been blocked. Texts will still appear to go through as normal — even though you don’t have to deal with them. </p><p id=\"yf2QrG\">Blocked numbers are still able to leave voicemails, but these won’t be shown in the standard visual voicemail list. Instead, they’re separated into a “blocked messages” section that you can choose to ignore completely. </p><p id=\"wbD4i8\">On an iPhone, there are multiple methods for blocking a number, but I’m going to cover the two apps where you’d most often want to do so. </p><h2 id=\"gbsI4N\">How to block a number from the iPhone’s Phone app</h2><ul><li id=\"IYRFMI\">Open the <strong>Phone</strong> app.</li><li id=\"uOnJ1D\">Tap on the <strong>Recents</strong> tab.</li><li id=\"NKJ9iD\">When you see the number you wish to block, tap the encircled <strong>i </strong>on the right side of the screen. </li><li id=\"r5qFKB\">At the bottom of the next screen, you’ll see the option to <strong>Block this Caller.</strong> Tap on that, and the number will be unable to reach you.</li></ul><h2 id=\"CsfF0L\">How to block a number from the iPhone’s Messages app</h2><p id=\"QkVpKt\">If someone is annoying you via text (or you want to cross off another source of spam), it’s easy to block a number directly from Apple’s Messages app.</p><ul><li id=\"uNgLpA\">Tap the sender’s information at the top center of the conversation. </li><li id=\"HqN7a6\">Then tap on <strong>Info</strong>. </li><li id=\"04sAQm\">Again, at the bottom of this page, you’ll see the option to <strong>Block this Caller</strong> in red text.</li></ul><aside id=\"q2ChsF\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to block and report text spam\",\"url\":\"https://www.theverge.com/22555521/spam-text-block-security-iphone-android\"},{\"title\":\"How to stop annoying robocalls on your iPhone or Android phone \",\"url\":\"https://www.theverge.com/21327304/spam-calls-how-to-stop-block-robocalls-robots-scam-iphone-android\"}]}'></div></aside><h2 id=\"ZPyGz9\">How to unblock a number on an iPhone</h2><p id=\"Ffxlwf\">If you want to restore someone’s ability to reach you, it’s easy to remove any number from your blocked list.</p><ul><li id=\"AMc6pe\">Open the <strong>Settings</strong> app.</li><li id=\"KoIumB\">Then tap on <strong>Phone</strong>. </li><li id=\"CIlTtD\">Select <strong>Blocked Contacts.</strong></li><li id=\"1V69g3\">On the next screen, you’ll see a list of numbers you’ve blocked. There are two ways to remove one. You can either tap the <strong>Edit</strong> option and then the red minus symbol next to the number you wish to unblock, or, as a faster alternative, you can swipe left across any number to unblock it.</li></ul>",
  "image": "https://cdn.vox-cdn.com/thumbor/XqWoIWxURC1j93r1ILvVdXn_ACY=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22022582/bfarsace_201106_4269_002.0.jpg",
  "description": "An easy way to avoid people you don’t want to hear from.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}