{
  "title": "How to delete your TikTok account",
  "url": "https://www.theverge.com/22933815/how-to-delete-tiktok-account-backup-data-recover",
  "date": "2022-02-16T15:30:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"The TikTok music note logo against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/NzZZuqv1Z1t6iOOoF66TJAIhb0s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70516683/acastro_190723_1777_tiktok_0003.0.0.jpg\" />        <figcaption><em>The process is relatively simple.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"uytqYk\">If you’ve decided to delete your TikTok account for whatever reason, there’s good news — it’s relatively easy to do and should only take a few minutes (provided you’re already logged in or remember your password). <a href=\"https://support.tiktok.com/en/account-and-privacy/deleting-an-account\">The process</a> can be done either in the app or on the web — here’s how:</p><h2 id=\"g8wOB7\">Deleting your TikTok through the app</h2><p id=\"KkrktL\">TikTok makes it relatively easy to delete your account through the iOS or Android app. </p><ul><li id=\"G4VNls\">Go to your profile, then tap the three lines in the top right corner, which should open the “Settings and privacy” screen.</li><li id=\"Vjv6uY\">Once you’re there, go to Manage account &gt; Delete account. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FVP7tvl3vhL3nNoIL0xsgpL8Tso=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242556/Screen_Shot_2022_02_14_at_17.41.41.png\">      <figcaption><em>If you don’t want to answer this question, you are able to skip in. Otherwise, you’ll be presented with some extra information and potentially a support article link pertaining to your choice.</em></figcaption>  </figure><ul><li id=\"EOOi87\">The app asks you why you’re leaving TikTok, and you can select an option or choose to skip the question using the button in the top right corner. </li><li id=\"Ef1WZb\">After that, it’ll ask you if you want to download your data before deleting your account, and you’ll have to tap the acknowledgment at the bottom that you want to continue deleting your account. (We will cover backing up your TikTok data in the section below.)</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_bLf635aRCog9Hh9oGL7JMOwAtU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242557/Screen_Shot_2022_02_14_at_17.42.39.png\">      <figcaption><em>You’re able to recover your account for up to 30 days after deleting it.</em></figcaption>  </figure><ul><li id=\"e2X7MN\">You’ll be shown a screen saying that you’ll have 30 days to reactivate your account if you change your mind and describing all the things you’ll lose access to after deleting your account (which includes access to the videos you’ve posted). </li><li id=\"jF1z5E\">Tapping “Continue” will lead you to an account verification screen. TikTok will send you a code that you have to enter if you have a standard account or will ask you to sign in with the service that you used to create your account (such as Apple, Google, etc.).</li><li id=\"doAKYR\">After verifying, tap the “Delete account” button and confirm your decision one last time to mark your account for deletion. The app will refresh, and you’ll be taken back to the login screen.</li></ul><h2 id=\"tHaWfL\">Deleting your TikTok through the web</h2><p id=\"0AMHly\">You can also delete your TikTok account through the TikTok.com website. </p><ul><li id=\"3tda9A\">After logging in, hover over your profile picture in the top right corner, then click on Settings. </li><li id=\"BNsvyw\">If you’re not already on the “Manage account” screen, select it from the left sidebar. </li><li id=\"GINkje\">You can then click the “Delete” button under Account control and follow the process. </li></ul><h2 id=\"nezHJQ\">Backing up your data</h2><p id=\"ZQStww\">To request a backup of your data:</p><ul><li id=\"OlDMxs\">Using the TikTok mobile app, go to your profile &gt; Settings and privacy &gt; Privacy &gt; Download your data. </li><li id=\"oQ5am7\">If you select “TXT” as an option, you’ll end up with a human-readable text file. If you select “JSON,” you’ll get a text file that’s formatted like Javascript, making it easier to feed it into computer programs. </li><li id=\"ybB6hL\">Once your file’s been created, it’ll be on the “Download your data” screen in the Download data tab. TikTok warns that it could take a few days before your data is available to download, so you’d be advised to wait a bit before deleting your account. </li></ul><p id=\"UcJflt\">The file you get can include data like your profile information, video and comment history, and settings info — but it doesn’t include your videos. If you want to keep those, you’ll have to download them manually. </p><p id=\"cfhH8k\">To download one of your TikToks to your phone:</p><ul><li id=\"AxLGLb\">Go to your profile and select the video you want</li><li id=\"ew1s8O\">Tap the “...” button and select “Save video.”</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zW5_z3WJXm2sfIQjn6Sw8W2fUBw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242466/photo_2022_02_14_17.13.11.jpeg\">      <figcaption><em>If you log in within 30 days of deleting your account, you’ll have the option to stop the process. </em></figcaption>  </figure><h2 id=\"n0ffpy\">Recovering a deleted account</h2><p id=\"OUNOAe\">As TikTok mentions when you delete your account, you can stop the process by logging back in within 30 days. If you do so, you’ll get a message saying your account has a deactivation pending. Tapping the “Reactivate” button will let you back in and cancel the deletion process, while tapping the “Log out” button will allow the deletion process to continue.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/G77pE8z25QsJ10zp_NJUapTQmXo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331845/acastro_190723_1777_tiktok_0003.0.jpg",
  "description": "You’ll also have 30 days to change your mind.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}