{
  "title": "How to change (or eliminate) your Windows 11 sign-in",
  "url": "https://www.theverge.com/23032097/windows-11-sign-in-password-biometrics-how-to-change",
  "date": "2022-04-20T13:52:34.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/c8x3wq0Y4fDwMfFZLV4XYToWhOU=/8x0:2552x1696/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70771018/twarren__windows11main_1.0.jpg\" />        <figcaption>Photo by Tom Warren / The Verge</figcaption>    </figure>  <p id=\"iQBs7n\">If you mainly use your Windows 11 computer at home, and you don’t have curious children or roommates who might mess with it, then having to sign in with a password can be a pain in the neck — especially if you have a long, secure, and complicated password. </p><p id=\"znlfFg\">Thankfully, you have alternatives. If you do take your Windows laptop out occasionally, there are several other ways you can sign in to your laptop that are a little simpler. We’ll also show you how to remove your password altogether (although, to keep your device secure, we recommend that you go with one of the options above rather than eliminating any kind of sign-in).</p><p id=\"nwlV3f\">You also have the option to use a <a href=\"https://www.theverge.com/22458935/two-factor-security-key-how-to-yubico\">physical security key</a> (usually a USB key) to sign in, but you’ll have to purchase that key separately. Here are the methods you can use to sign in without any additional equipment.</p><h2 id=\"ETRAxN\">Access your sign-in settings</h2><p id=\"jctjSo\">You will find all your various sign-in options by clicking on <strong>Start icon &gt; Settings &gt; Accounts &gt; Sign-in options.</strong></p>  <figure class=\"e-image\">        <img alt=\"Under “Sign-in options,” you’ll see several different methods for signing in, including using your fingerprint, a PIN, or a picture password.  \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/N_m3cka6sG6V4cjx_zE517veGyw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401331/Screenshot__196_.png\">      <figcaption><em>Under “Sign-in options,” you’ll see several different methods for signing in, including using your fingerprint, a PIN, or a picture password.</em>  </figcaption>  </figure><p id=\"3W6KIC\">There, under <strong>Ways to sign in</strong>, there are several ways that you can adjust how to sign in to your device. The methods that Windows offers include:</p><ul><li id=\"s8xLsz\">Facial recognition (using Windows Hello)</li><li id=\"i8GpRC\">Fingerprint recognition</li><li id=\"RQgoCz\">Using a PIN (can be a combination of numbers or numbers and letters)</li><li id=\"HoxSEQ\">Using a physical security key</li><li id=\"mEggmQ\">Typing in your password</li><li id=\"hne2BR\">Using a picture password (you’ll be presented with a photo and will need to draw three different swipes on the photo to unlock)</li></ul><p id=\"wg7Lyx\">To enable any of these methods, just select the one you’re interested in and then click on <strong>Add. </strong>Windows will then walk you through the process of creating that method of signing in to your computer. Once you’ve added it, you can come to the same place to manage it or remove it. </p><p id=\"7fHlhv\">A couple of things to be aware of:</p><p id=\"T7Kqpu\">If one of the sign-in options is not available (for example, if your camera is not capable of using Windows Hello for facial recognition), there will be a notice of that underneath the name of the option. </p><p id=\"egdrj8\">Note that you will need to set up a PIN first before you can set up either facial recognition or fingerprint recognition (the PIN acts as backup in case the biometric systems don’t work).</p><h2 id=\"gQFgOs\">Adjust when you need to sign in again</h2><p id=\"dtmZGy\">If you occasionally walk away for a few minutes, you may find it irritating to have to sign in again because your system has gone to sleep. You can adjust how often you need to sign in again.</p><ul><li id=\"yLniG7\">Beneath <strong>Ways to sign in</strong> is a section called <strong>Additional settings</strong>, where you can find additional security settings — one of which adjusts when your device asks you to sign in again after you’ve been idle. </li><li id=\"XanP5Y\">Look for <strong>If you’ve been away, when should Windows require you to sign in again?</strong> and click on it. </li><li id=\"xOxN8R\">The associated drop-down menu lets you select from a range of options, from every time the system has gone dark to if it’s been dark for 15 minutes. You can also select <strong>Never</strong>.</li></ul>  <figure class=\"e-image\">        <img alt=\"You can avoid having to log in each time your system goes to sleep.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PkRqH32qgF7OGqjeiql1iELUJfk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401338/Screenshot__198_.png\">      <figcaption><em>You can avoid having to log in each time your system goes to sleep.</em></figcaption>  </figure><p id=\"E3qAVo\">(Note: It’s possible that this particular feature will be grayed out — as happened to me. In order to use it, I had to disable fingerprint recognition. Thank you to <a href=\"https://www.tenforums.com/tutorials/11129-turn-off-require-sign-wakeup-windows-10-a.html\">TenForums</a> for helping me solve this issue.)</p><h2 id=\"qfcrqx\">Remove a password altogether</h2><p id=\"KSS8OA\">Typing in your password can be a hassle, which is why there are alternative sign-in methods. If you want to go an extra step further, you can remove your password altogether. (Of course, disabling your password altogether is a security risk — using at least a simple PIN is a better move.)</p><p id=\"qhaJOI\">However, if you’re determined on losing that password, here’s how you can do it.</p><ul><li id=\"FT1ptB\">Click the <strong>Start</strong> icon</li><li id=\"TNdKAD\">Search for and open <strong>netplwiz</strong></li></ul>  <figure class=\"e-image\">        <img alt=\"Open up “netplwiz” to disable your password.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/F71Dpyef5ckwIitKPupK4DKZH08=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401340/Screenshot__200_.png\">      <figcaption><em>Search for the “netplwiz” command to disable your password.</em></figcaption>  </figure><ul><li id=\"plzOp6\">A window will open. Uncheck the box next to <strong>Users must enter a user name and password to use this computer</strong>.</li></ul>  <figure class=\"e-image\">        <img alt=\"Here, you can remove the password requirement.  \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uAsJJdTHJcZwRXytkAlxYRVO5lI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401378/Screenshot__201_.png\">      <figcaption><em>Here, you can remove the password requirement.</em>  </figcaption>  </figure><ul><li id=\"7nCMAW\">Then click <strong>Apply</strong></li><li id=\"qfyXoq\">Enter your password twice in the pop-up window and click <strong>OK</strong></li><li id=\"435xn1\">Click <strong>OK</strong> again</li></ul><p id=\"Wn18t5\">The changes will go into effect after you restart your device. Note that this doesn’t get rid of your password, but makes it so you don’t need it to start the system. Also, it means that only your login will not need a password; if there are multiple logins to the system, you will have to go through the same process for each login. And if you find you feel safer with a password:</p><h2 id=\"GKvHsI\">Enable your password again</h2><ul><li id=\"TeofG6\">Open up <strong>netplwiz</strong></li><li id=\"aqUNUM\">Check the box next to <strong>Users must enter a user name and password to use this computer</strong></li><li id=\"Y7grtm\">Then click <strong>Apply</strong></li><li id=\"VdbVYi\">Click <strong>OK</strong></li></ul>",
  "image": "https://cdn.vox-cdn.com/thumbor/JuvIZwKaAaCQx-ftwKKzdjHnsOk=/0x178:2560x1518/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22690959/twarren__windows11main_1.jpg",
  "description": "You don’t have to remember a password.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}