{
  "title": "How to set up Emergency SOS on your smartwatch",
  "url": "https://www.theverge.com/23123590/smartwatch-emergency-sos-how-to-apple-samsung-google-garmin",
  "date": "2022-05-18T15:45:39.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Emergency SOS call screen on an Apple Watch Series 7\" src=\"https://cdn.vox-cdn.com/thumbor/uyzF6z3n0jvcgJ-CXSb1ltPgXrY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883325/IMG_2990.0.jpg\" />        <figcaption><em>Several smartwatches will allow you to make emergency calls.</em> | Photo by Victoria Song / The Verge</figcaption>    </figure>  <p id=\"llHFdT\">While smartwatches have always been able to relay notifications, the ability to make emergency calls was a big step forward in making them standalone devices. </p><p id=\"EmBNTY\">Generally, Emergency SOS features have two functions. The first is to call local emergency responders if you find yourself in a bind. For instance, if you take a nasty spill and can’t make it to the phone, your watch can call 911. The second is to relay your location to a select group of trusted contacts. For folks who want to leave their phone at home, these features can ensure that your loved ones will be able to find you if you’re injured or need help. </p><p id=\"Paqvgb\">You don’t necessarily need a cellular watch to make use of Emergency SOS. However, a cellular watch is the best option if you want Emergency SOS to be available at all times. Otherwise, you’ll need to have your phone nearby or your watch will need some sort of internet connectivity via Wi-Fi. </p><p id=\"MjNchJ\">Just because you have a device that’s capable of Emergency SOS calls, however, doesn’t mean it’s automatically set up. For instance, you’ll have to designate people as your emergency contacts if that’s a relevant feature for you.</p><p id=\"iTJNRN\">With that in mind, here’s how to set up and use Emergency SOS features on some of the most popular smartwatches.</p><h2 id=\"PkeYiV\">Apple Watch</h2><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dzWWHtpEFI3Egk-tllLJJzQ9YA8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23534450/IMG_877354671737_1.jpeg\">      <cite>Screenshot: Victoria Song / The Verge</cite>      <figcaption><em>You can edit settings in the Watch app on your iPhone.</em></figcaption>  </figure></div><p id=\"ww85c9\">The Apple Watch has comprehensive emergency calling features. When you use the Emergency SOS feature, the Watch will call and send your location to local emergency services. This isn’t necessarily limited to your home country, either. If you have an Apple Watch SE or a Series 5 or later, you can access emergency services internationally as well. (You should check which <a href=\"https://www.apple.com/watchos/feature-availability/#branded-international-emergency\">countries are supported</a> ahead of any trip, however.) </p><p id=\"L0AOgw\">To make an emergency call from your wrist:</p><ul><li id=\"mKeEfU\">Press and hold the side button. This is the flat button underneath the digital crown.</li><li id=\"1uoiql\">You should see three sliders: <strong>Power off</strong>, <strong>Medical ID</strong>, and <strong>Emergency SOS</strong>.</li><li id=\"uXuLRJ\">Drag the <strong>Emergency SOS </strong>slider to start a call.</li><li id=\"jTIJ5q\">You can also simply hold the side button until a countdown begins.</li></ul><p id=\"lHLabT\">If you want the Watch to also notify your trusted contacts, you’ll have to set aside time to designate who those contacts are. To add / remove emergency contacts:</p><ul><li id=\"gbilPU\">Open the <strong>Health</strong> app on your iPhone.</li><li id=\"XMALPC\">Tap your profile icon in the upper-right corner.</li><li id=\"vaksSN\">Tap <strong>Medical ID</strong>.</li><li id=\"MKpHPy\">Select <strong>Edit</strong> and scroll down to <strong>Emergency Contacts</strong>.</li><li id=\"YEUXur\">Tap the “+” button to add a contact.</li><li id=\"1LT67f\">Select someone from your contacts who you trust.</li><li id=\"wKTe1L\">You’ll be prompted to describe their relationship to you.</li><li id=\"tzRpYB\">Tap <strong>Done</strong>.</li><li id=\"emy3ui\">When in Edit mode, you can also hit the “-” button to remove someone as an emergency contact.</li></ul><p id=\"ogupgU\">Tips and things to remember: </p><ul><li id=\"HUVs4T\">If you make an emergency call, the Apple Watch will continually share your location with your emergency contacts. It’ll periodically send you a notification to remind you of this. You can stop this by tapping <strong>Stop Sharing</strong> when the reminder pops up.</li><li id=\"sr7xPJ\">If you tend to <a href=\"https://www.theverge.com/2018/3/18/17129440/emergency-sos-iphone-apple-watch-accident\">accidentally press the side button</a>, you can disable it from automatically calling emergency services when held. Just go to the <strong>Watch</strong> app on your iPhone, select the <strong>My Watch</strong> tab, select <strong>Emergency SOS</strong>, and turn off the <strong>Hold Side Button to Dial </strong>toggle. This only turns off the shortcut to trigger an automatic call countdown. You can still hold the side button to bring up the <strong>Emergency SOS</strong> call slider.</li><li id=\"mbIPQW\">If you use the Emergency SOS feature abroad, your emergency contacts will not be notified. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FzujOlYTxA_ur7IhcqW65CJT0nM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23534624/2022_5_11_google_io_698_11_56_19.jpg\">      <cite>Image: The Verge</cite>      <figcaption><em>Emergency SOS calls will come to Wear OS 3 later this year.</em></figcaption>  </figure><h2 id=\"x2VKyw\">Wear OS </h2><p id=\"Yse5df\">At this year’s Google I/O keynote, the company noted that <a href=\"https://www.theverge.com/2022/5/11/23064072/google-pixel-watch-fitbit-io-2022\">Emergency SOS would be a feature on Wear OS 3</a>. That means the forthcoming Google Pixel Watch and any other Wear OS 3 watches will be able to support emergency calling. We’ll update this section once the Pixel Watch and Wear OS 3 upgrades arrive in fall 2022.</p><h2 id=\"H01uun\">Samsung smartwatches</h2><p id=\"9My73t\">Emergency SOS is not set up by default on Samsung’s smartwatches, including the most recent <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4 lineup</a>. It’s also not available on the Galaxy Fit or Galaxy Fit 2. If you see the message <strong>Emergency calls only</strong> on your Samsung smartwatch, that’s a sign you haven’t set up cellular connectivity and that the feature will only work if you have your phone on you. </p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PfW6wlwygUXfGlOXoRmarh_tl0Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23534676/WRBLS_SW_GW4_GW_Use_your_smartwatch_on_emergency_situation.png\">      <cite>Image: Samsung</cite>      <figcaption><em>Emergency SOS is not set up by default on Samsung smartwatches. You’ll have to enable it yourself.</em></figcaption>  </figure></div><p id=\"tIfWOd\">However, Samsung’s Emergency SOS currently will not call local emergency services (though this may change when Emergency SOS features arrive on Wear OS 3 in the fall). Instead, it will call and notify your pre-selected emergency contacts of your location. Once you set up your contacts, you can activate Emergency SOS by quickly pressing the Power button three times.</p><p id=\"FMZLWU\">Here’s how to get started: </p><ul><li id=\"DtbPKh\">Open the <strong>Galaxy Wearable</strong> app.</li><li id=\"NOhIIv\">Tap <strong>Watch Settings</strong>.</li><li id=\"LWyzAH\">Select <strong>Advanced Features</strong>.</li><li id=\"CBbmij\">Tap <strong>SOS</strong>.</li><li id=\"17rSVa\">Turn on the toggle labeled <strong>When Home Key pressed 3 times</strong>.</li><li id=\"W02HQI\">There is an additional <strong>Count down before sending</strong> toggle. When enabled, this will add a five-second delay so you can cancel in case of accidental presses.</li><li id=\"lGyKFf\">You can also optionally turn on the toggle <strong>When hard fall detected</strong>.</li><li id=\"HEkd80\">To select emergency contacts, tap <strong>Create Contact</strong> or <strong>Select From Contacts</strong>.</li><li id=\"Yo5Y5i\">Under the <strong>Emergency Contacts</strong> menu, you can also designate contacts to send texts and calls to.</li><li id=\"sgQA8i\">To designate who will receive texts, select <strong>Send messages to</strong> and choose a contact. </li><li id=\"ByeTr5\">For calls, select <strong>Make SOS call to</strong> and then select a contact.</li></ul><h2 id=\"WipY8H\">Garmin wearables</h2><p id=\"IIdklA\">Garmin, a popular wearable brand with outdoor enthusiasts, has a version of emergency calling called Assistance. However, Assistance is not turned on by default. Also, only certain Garmin smartwatches or trackers, like the Forerunner 945 LTE, have LTE capability — most Garmin devices will require you have your phone in the vicinity to alert your emergency contacts. Your phone will also need to have a viable cellular signal, which is something to keep in mind if you plan on hiking, biking, or running in an area without good reception. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QeUENfC91BeKlFRYhmx6jshRW10=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23534831/IMG_FA3FDE2CD48D_1.jpeg\">      <cite>Image: Victoria Song / The Verge</cite>      <figcaption><em>The Safety Features menu in the Garmin Connect app.</em></figcaption>  </figure></div><p id=\"I5Loyt\">Additionally, iOS users must have the Garmin Connect app open and running in the background. Even if your device is connected via Bluetooth, if the Garmin Connect app is not open, this feature will not work. </p><p id=\"E4LZYz\">Because Garmin devices come in such a wide variety of form factors, there isn’t one universal way to send emergency alerts. Generally, you can activate an alert on a Garmin watch by holding down the top-left button for about seven seconds. For trackers, you usually hold down the button until the watch vibrates three times. Even so, double-check the trigger for your specific device <a href=\"https://support.garmin.com/en-US/?faq=Ots03L9cFf98el3a0ioSk9\">here</a>. </p><p id=\"aZc3B1\">To set up Assistance:</p><ul><li id=\"Es7NUj\">Open the <strong>Garmin Connect</strong> app on your smartphone.</li><li id=\"Iribfp\">If you’re an Android user, select the <strong>three-bar icon</strong> in the upper left. If you’re an iOS user, select the <strong>More</strong> tab in the lower right.</li><li id=\"AiJ8AV\">Scroll down to <strong>Safety &amp; Tracking</strong>.</li><li id=\"YL2Ksl\">Tap <strong>Safety Features</strong>.</li><li id=\"WfSJXr\">Tap <strong>My Information</strong> and enter your details.</li><li id=\"S2hxkt\">Return to the previous menu and select <strong>Emergency Contacts</strong>.</li><li id=\"CZ7OII\">You can add up to three contacts by tapping <strong>Add Emergency Contact</strong>. Garmin recommends adding more than one.</li><li id=\"nV5FYR\">In the <strong>Emergency Calling</strong> menu, you can add a number to call if the Assistance feature is triggered. However, your phone needs to be nearby and paired to your device for this feature to work.</li></ul><p id=\"EG5MQ0\">Now that you’re all set up, here’s one quick reminder: make sure you periodically review who your designated emergency contacts are. It’s a good idea to do this whenever you buy a new watch, move to a new city, experience a breakup, have a falling out, or if a trusted contact passes away. Remember: this shouldn’t be a feature that you set up once and forget about. </p><p id=\"kSzp4g\"></p><p id=\"OnRt2I\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QTF8Yevcpe3B35xMSSdkN4cZ9Eg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23534240/IMG_2990.jpg",
  "description": "For a little extra peace of mind.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}