{
  "title": "How the Anchor protocol helped sink Terra",
  "url": "https://www.theverge.com/2022/5/20/23131647/terra-luna-do-kwon-stablecoin-anchor",
  "date": "2022-05-20T15:20:00.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/fbjZRTR0XnRlsQjC3jKqfHnJp-Q=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70892236/acastro_210329_1777_nft_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"prS8RP\">If Do Kwon didn’t exist, someone would have had to invent him. For instance, there’s the bets he made — <a href=\"https://www.theblockcrypto.com/linked/137832/terraform-labs-ceo-do-kwon-seals-10-million-bet-over-luna-price\">worth $11 million in total</a> and <a href=\"https://www.theblockcrypto.com/post/137687/terraform-labs-do-kwon-bets-1-million-on-lunas-future-price\">held in escrow by Crypto Twitter influencer Cobie</a> — that his token Luna would be worth more in a year than it was in March 2022. Fond of insults such as “<a href=\"https://twitter.com/stablekwon/status/1501552275919015941\">continue in poverty ser</a>,” “<a href=\"https://twitter.com/stablekwon/status/1506411835934732293\">u still poor?</a>,” and “<a href=\"https://twitter.com/stablekwon/status/1410491186196795398\">I don’t debate the poor on Twitter</a>,” Kwon is the boisterous, combative co-founder of Terraform Labs, best known for the ongoing disaster that is Terra / Luna.</p><p id=\"D4T3ux\">As of this writing, Luna is worth less than a cent, and its sister token Terra, which was meant to be pegged to a dollar as a stablecoin, is worth 6 cents. An investor, who told <a href=\"https://en.yna.co.kr/view/AEN20220516006151315?section=search\">reporters from Yonhap News Agency</a> he’d lost 2 to 3 billion won (about $2.3 million), was arrested for trespassing after he entered Kwon’s apartment complex, looking for the master of stablecoin. Kwon’s wife requested police protection after the incident.</p><div class=\"c-float-right\"><aside id=\"AMAZTI\"><q>This isn’t actually Kwon’s first failed stablecoin</q></aside></div><p id=\"wWsWM7\">At the Washington Nationals ballpark, Terra’s logo is visible on the seats behind home plate — and the stadium’s luxury dining lounge is called Terra Club, <a href=\"https://www.coindesk.com/business/2022/05/15/at-nationals-ballpark-terras-bad-week-never-happened/\">according to <em>CoinDesk</em></a>. Terra paid <a href=\"https://www.coindesk.com/business/2022/02/09/washington-nationals-to-explore-ust-stablecoin-in-dao-approved-partnership-deal/\">$38.5 million</a> for that advertising, which seems like it’ll outlive the protocol. </p><p id=\"WD8YdJ\">This isn’t actually Kwon’s first failed stablecoin. That would be Basis Cash, which was also supposed to be worth $1, and which <a href=\"https://coinmarketcap.com/currencies/basis-cash/\">also capsized</a>. He’s also dodged <a href=\"https://www.bloomberg.com/news/articles/2021-11-12/sec-turns-up-heat-on-cryptocurrency-in-probe-of-terraform-labs\">two Securities and Exchange Commission subpoenas</a>.</p><p id=\"GPo7uH\">While Kwon’s obnoxious Twitter personality lured a number of retail investors into Luna, they weren’t the only ones taken in. Jump Crypto and Three Arrows Capital bought into Luna; Coinbase Ventures, Lightspeed Venture Partners, Galaxy Digital, and Pantera Capital backed Terraform Labs. Mike Novogratz, the head of Galaxy Digital, <a href=\"https://fortune.com/2022/05/18/galaxy-mike-novogratz-terra-luna-crypto/\">even got a Luna tattoo</a>, which he now says will be “a constant reminder that investing requires humility.” Kwon will also have his own permanent reminder: <a href=\"https://twitter.com/stablekwon/status/1515501798442008577\">he named his daughter Luna</a>. </p><div id=\"gWRtIx\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I’m officially a Lunatic!!!  Thanks <a href=\"https://twitter.com/stablekwon?ref_src=twsrc%5Etfw\">@stablekwon</a>   And thank you my friends at Smith Street Tattoos. <a href=\"https://t.co/2wfc00loDs\">pic.twitter.com/2wfc00loDs</a></p>— Mike Novogratz (@novogratz) <a href=\"https://twitter.com/novogratz/status/1478535972560195585?ref_src=twsrc%5Etfw\">January 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"2WQGb7\">Kwon’s rise and fall was fairly rapid, even by cryptocurrency standards. Luna emerged as a bright spot in the markets in December and reached its peak valuation, a touch over $116, in April; Luna was worth more than $40 billion, all told. During that time, a lot of crypto, including Bitcoin and Ethereum, was sliding. Luna’s popularity was due to a lending program, Anchor, that promised annual percentage yields (APY) of almost 20 percent — obscenely high.</p><p id=\"hmxTNv\">The Anchor protocol worked like this, <a href=\"https://www.anchorprotocol.com/docs/anchor-v1.1.pdf\">according to its white paper</a>: </p><p id=\"YvuD1J\">Let’s say I wanted a higher rate of return than I could get in a regular savings account or by buying (for instance) <a href=\"https://www.treasurydirect.gov/indiv/products/prod_ibonds_glance.htm\">government bonds</a>. So I deposited $10,000 worth of Terra, the dollar-pegged coin in the system. Anchor then turns around and loans out my deposit to another investor, who we’ll call Lars. But to make sure he’s good for the loan, he’s got to put down some of his own assets as collateral. Some of the yield from Lars’ collateral comes back to me, as does some of his interest. Crucially, the deposits <em>and</em> the interest are in Terra.</p><div class=\"c-float-right\"><aside id=\"1a3J8w\"><q>Where did the money come from?</q></aside></div><p id=\"R7I0tP\">This is not especially revolutionary, and it’s also why I don’t understand the 20 percent interest rate since borrowers were <a href=\"https://twitter.com/Route2FI/status/1497276285814554624\">also getting rewarded for borrowing</a>. Where did the money come from? Back in January, people were already warning that <a href=\"https://cointelegraph.com/news/anchor-protocol-s-reserves-head-toward-depletion-due-to-lack-of-borrowing-demand\">Anchor was unsustainable</a> because there weren’t enough borrowers.</p><p id=\"yPw6dx\">The most charitable thing you could say about that 20 percent rate is that maybe it was meant as a customer acquisition strategy, and the APY was going to be revised lower later. Other people said other things. For example, some said it looked like <a href=\"https://www.bloomberg.com/news/articles/2022-03-23/terra-s-promise-of-20-defi-return-raises-sustainability-concern\">an obvious Ponzi scheme</a>, where money from later investors was paid to earlier investors as “interest.” I’m sympathetic to this argument since even Bernie Madoff didn’t consistently give <a href=\"https://www.wsj.com/articles/SB122909929808301893\">his investors 20 percent interest rates</a>.</p><p id=\"rQav0O\">Regardless, a lot of Terra was deposited in Anchor — as much as <a href=\"https://decrypt.co/98482/we-need-to-talk-about-terras-anchor\">72 percent of Terra</a>, according to <em>Decrypt</em>. Anchor created demand for Terra. Unlike stablecoins such as Tether and USDC, Terra wasn’t directly backed by reserves. Instead, it was known as an “algorithmic stablecoin,” which attempts to stay at $1 through a process of arbitrage with a sister token, Luna.</p><p id=\"5xTmYU\">The arbitrage works like this: let’s say I notice that Terra is trading at 99 cents. Oh, hell yeah! I then burn my coins, removing them from circulation and converting them to Luna. By lowering the supply of Terra, I raise the price. Let’s say I got too excited, though, and the price is now at $1.01. Lars comes along and burns his Luna to get the equivalent amount of Terra, lowering the price back to $1.</p><div class=\"c-float-right\"><aside id=\"rJhoHT\"><q>The problem with algorithmic stablecoins is that they fail</q></aside></div><p id=\"UGucnx\">The problem with algorithmic stablecoins is that they fail. They fail because they rely on things <a href=\"http://www.wakeforestlawreview.com/2021/10/built-to-fail-the-inherent-fragility-of-algorithmic-stablecoins/\">they can’t control</a>: investor demand; people who will perform the stabilizing arbitrage; and reliable price information. In the specific case of Terra, it seems likely that an <a href=\"https://twitter.com/4484/status/1524006086147252227\">unusually large withdrawal</a> knocked the system out of balance. After that, there was a death spiral — just like with Kwon’s other project, Basis. Similarly, non-Kwon-related algorithmic stablecoins like <a href=\"https://cointelegraph.com/news/iron-finance-bank-run-stings-investors-a-lesson-for-all-stablecoins\">Iron</a> and <a href=\"https://blockworks.co/algorithmic-stablecoin-usdn-is-on-the-brink-of-failure/\">Neutrino</a> have also tanked in the past. If there’s one thing I’ve learned about cryptocurrency over the years, it’s that no one especially is interested in history, even very recent history. </p><p id=\"yoMCcg\">Here’s how Anchor weighed investors down: people who had deposited their money couldn’t remove it when Terra failed.</p><p id=\"5Va1En\">People who knew better — who saw the warning signs, even — did little to stop naive investors. Sam Bankman-Fried, the founder of FTX, <a href=\"https://www.coindesk.com/markets/2022/05/13/luna-ust-still-available-on-ftx-and-other-exchanges-despite-terra-blockchain-halt/\">listed Luna and Terra</a> on his exchange despite having a pretty good idea of what was going to happen. Here’s him discussing it <a href=\"https://www.bloomberg.com/news/articles/2022-04-25/odd-lots-full-transcript-sam-bankman-fried-and-matt-levine-on-crypto\">on the <em>Odd Lots</em> podcast</a>: </p><blockquote><p id=\"K7daNL\">If you do zoom out, right, and you say, ‘This is a stable coin, backed by volatile assets, what’s gonna happen in a big market move.’ Right? Like, you know how this plays out. </p></blockquote><p id=\"ljFMFC\">Unfortunately, a lot of people did not know how this would play out! Take, for example, investors who were unwise enough to place money with Stablegains, a <a href=\"https://www.ycombinator.com/companies/stablegains\">Y Combinator-backed startup </a>that promised to make “earning with DeFi simple and safe for consumers and businesses alike.” It had promised 15 percent yield <a href=\"https://blog.stablegains.com/stablegains-earns-you-yield-by-accessing-anchor-protocol-what-is-anchor-and-how-does-it-work-f259870998de\">because of its relationship with Anchor in August 2021</a>. Now, it’s <a href=\"https://mobile.twitter.com/stablegains/status/1525499074983514114\">tweeting</a>, “Users can continue to hold UST in Anchor via Stablegains. Please be aware that UST might lose further value and continued access depends on the Terra blockchain and Anchor Protocol remaining operational.” </p><div class=\"c-float-right\"><aside id=\"kmda3Z\"><q>Once you’re the villain, it’s just about impossible to break the type-casting</q></aside></div><p id=\"G2a1Sh\"><a href=\"https://cryptobriefing.com/yield-app-stablegains-faces-lawsuit-after-losing-44m-on-ust/\">A lawsuit says</a> that Stablegains lost $44 million in investors’ money. Stablegains isn’t alone; <a href=\"https://members.delphidigital.io/reports/learnings-from-last-week\">investor Delphi Digital noted</a> that it had concerns about Luna <em>but invested anyway.</em> It lost $10 million. A South Korean venture fund lost $3.5 billion, <a href=\"https://www.coindesk.com/markets/2022/05/19/terra-backers-delphi-digital-and-hashed-lick-their-wounds-after-ust-and-luna-collapse/\">according to <em>CoinDesk</em></a>. Binance, another Terraform Labs investor, bought in at $3 million, and its holdings are now worth $3,000, <a href=\"https://www.nytimes.com/2022/05/18/technology/terra-luna-cryptocurrency-do-kwon.html\">according to <em>The New York Times</em></a><em>.</em></p><p id=\"Hnmcs8\">But there were winners, and those winners were insiders. Pantera Capital, for instance, made $170 million on a $1.7 million investment, <em>The New York Times </em>reported. Another investor, Hack VC, got out of Luna in December. Venture firm CMCC Global sold off in March.</p><p id=\"Alqgm9\">People aren’t wrong to be mad at Kwon. Kwon voluntarily assumed the persona of a villain, because much like reality star <a href=\"https://www.thedailybeast.com/how-spencer-pratt-cast-himself-as-a-villain-and-we-bought-it\">Spencer Pratt</a>, he understood that being the villain guarantees you more attention. But as Pratt eventually discovered, once you’re the villain, it’s just about impossible to break the type-casting. That means Kwon will take most of the blame for this, while Y Combinator, Stablegains, Bankman-Fried, and others could walk away without a scratch. </p><p id=\"OK97xc\">“I am heartbroken about the pain my invention has brought on all of you,” Kwon tweeted on May 13th in what seemed like an abrupt departure of tone. Since then, he’s practically groveled. He wants to get “the ecosystem” back on its feet. He’s even come up with a new proposal for doing so.</p><p id=\"cYPSHM\">That proposal has been <a href=\"https://www.coindesk.com/tech/2022/05/18/do-kwon-pushes-on-chain-proposal-live-even-as-92-vote-no-in-online-poll/\">rejected by the community of Lunatics</a>. I guess they weren’t crazy about it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IVL0qTILLdUK0KGUt8E3CQahHro=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22413649/acastro_210329_1777_nft_0004.jpg",
  "description": "People who knew better — who saw the warning signs, even — did little to stop naive investors.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}