{
  "title": "How to deactivate your Twitter account",
  "url": "https://www.theverge.com/22227076/twitter-delete-app-how-to-deactivate",
  "date": "2022-04-14T14:10:20.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"Twitter-app-stock-Dec2015-verge-05\" src=\"https://cdn.vox-cdn.com/thumbor/oRXixVcQuYbKG2f8J43m-eai0nM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/68668682/Twitter-app-stock-Dec2015-verge-05.0.0.jpg\" />    </figure>  <p id=\"uTAiqb\">There’s no questioning the benefits of Twitter. It’s a convenient way to get your memes, world news, and pop culture hot takes all in one place. </p><p id=\"kYyM65\">But being an active Twitter user requires sifting through a daily deluge of toxic characters, including <a href=\"https://www.theverge.com/2021/1/12/22226503/twitter-qanon-account-suspension-70000-capitol-riots\">QAnon</a>, <a href=\"https://www.theverge.com/interface/2019/5/30/18645004/twitter-white-supremacy-research-nazi-ban-gadde-dorsey\">white supremacists</a>, <a href=\"https://www.theverge.com/2020/2/21/21147096/twitter-bot-thought-leaders-ai-venture-capital-real-human-language\">bots</a>, <a href=\"https://www.theverge.com/2020/2/20/21145827/twitter-test-misinformation-politicians-tweets\">deepfakes</a>, and more (although you <a href=\"https://www.theverge.com/2021/1/8/22218753/twitter-bans-trump-permanently-realdonaldtrump\">can’t find Donald Trump there anymore</a>). Plus, there’s no denying the stress and anxiety that the fast pace of Twitter’s news cycle and the strain of constantly debating reply guys can bring. </p><p id=\"MkRgnr\">Hear me out on this: you don’t actually have to use Twitter. I know it might seem like everyone else is using it, but you can be the change you want to see in the world. You can just delete your account. </p><p id=\"Ikj35m\">Don’t worry: it doesn’t have to be permanent. If you find yourself feeling empty and directionless after doing this, you can get your account back up to 30 days after the fact. But if it ever gets to be too much again, just come back to this article and follow the steps. There’s a whole world outside of your timeline to explore. </p><h3 id=\"r5FE88\">Deactivate your Twitter account in a browser</h3><p id=\"ymkgC4\">If you’re on a computer or in a mobile browser, go to <a href=\"http://Twitter.com\">Twitter.com</a> and log in to your account. To deactivate: </p><ul><li id=\"SaQ0Gk\">On the web, click the <strong>More</strong> item on the bottom-left of the screen. On the mobile browser, tap your profile icon.</li><li id=\"dTd7QL\">Select <strong>Settings and Privacy</strong> and then <strong>Your account</strong></li></ul>  <figure class=\"e-image\">        <img alt=\"Select “Settings and Privacy” and then “Your account” \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zhMlkSnOwPg7m258g2nO7-KvI84=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22235732/Screen_Shot_2021_01_14_at_12.52.49_PM.png\">      <figcaption><em>Select “Settings and Privacy” and then “Your account.” </em></figcaption>  </figure><ul><li id=\"KzWYhW\">At the bottom of the list, tap <strong>Deactivate your account</strong></li></ul>  <figure class=\"e-image\">        <img alt=\"At the bottom of the list, tap “Deactivate your account” \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7LitA3jIQZVaxs3NSYRlmbS_cko=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22235744/Screen_Shot_2021_01_14_at_12.55.06_PM.png\">      <figcaption><em>At the bottom of the list, tap “Deactivate your account.”</em></figcaption>  </figure><ul><li id=\"7UxMcI\">Go to the bottom of the page to find the <strong>Deactivate</strong> link</li></ul><p id=\"1jEiWI\">There’s going to be a lot of information on the page before you get to that link, some of it pretty useful. There’s a full description of what will no longer be viewable (your display name, @username, and public profile), an assurance that you can restore your account “for some time” if it was accidentally or wrongfully deleted, and a way to reactivate after 30 days or 12 months (useful if you’re being besieged and want to take a vacation from Twitter rather than delete your account entirely). </p>  <figure class=\"e-image\">        <img alt=\"There are a lot of options to choose from before you reach the “Deactivate” link.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LtAaV6R7_sMNjeMkOZ2IsY6INxI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22235751/Screen_Shot_2021_01_14_at_11.06.57_AM.png\">      <figcaption><em>There are a lot of options to choose from before you reach the “Deactivate” link.</em></figcaption>  </figure><p id=\"coUwfO\">There are also links if you just want to change your name, use your current name with a different account, or download your Twitter data. This last one is always a good idea before you delete any account; <a href=\"https://twitter.com/settings/your_twitter_data\">here’s the link</a>.</p><h3 id=\"OS6jMH\">Deactivate your Twitter account in the Twitter app</h3><p id=\"WI5dGE\">If you’re using a smartphone, go to the Twitter app and make sure you’re logged in. </p><ul><li id=\"oQJUEj\">Tap your profile icon in the top-left corner. A menu will pop out from the side. Tap <strong>Settings and privacy</strong> on the bottom. </li><li id=\"egstsW\">Tap <strong>Your account</strong> at the top. On the <strong>Your account</strong> page, select <strong>Deactivate Account</strong> at the bottom. </li></ul><div id=\"YtgEPI\"><div data-anthem-component=\"gallery:9139315\"></div></div><p id=\"MQHpZx\">A few things to note: </p><ul><li id=\"gRqd7k\">To reiterate: your account won’t be permanently gone after this process. Twitter retains your information for 30 days before deleting it permanently. To restore your account, log back in and confirm that you want to reactivate your account. </li><li id=\"RPMWaZ\">If you plan to create a new Twitter account with the same username and email address as the account you’re deactivating, switch the current account to a different username and email address before you deactivate</li><li id=\"B1jAzJ\">If you want to download your Twitter data, do that <em>before</em> deactivating. Twitter can’t send data from inactive accounts. </li><li id=\"qQfvC8\">Google and other search engines cache results, meaning your old profile and tweets may still pop up in response to search queries on occasion. However, anyone who clicks them will get an error message.</li></ul><p id=\"aSkgiw\">Deactivating your account can be a hassle, but to Twitter’s credit, it’s much more straightforward than the process of deleting some other services, such as <a href=\"https://www.theverge.com/2020/2/20/21145313/uber-lyft-delete-apps-how-to-ethical-transportation-ride-share\">Uber and Lyft</a>. </p><h3 id=\"d8VNLq\">But where will I get my news and memes now?</h3><p id=\"WsSkop\">So Twitter is gone from your life. Congratulations! But what will you do now that you don’t have a never-ending barrage of tweets to scroll through? Here are some other things to try with your newfound free time. </p><ul><li id=\"I7sgQI\"><a href=\"https://joinmastodon.org/\"><strong>Mastodon</strong></a><strong>.</strong> Mastodon is a <a href=\"https://www.theverge.com/2017/4/7/15183128/mastodon-open-source-twitter-clone-how-to-use\">decentralized version of Twitter</a>, which journalists have praised as <a href=\"https://www.vice.com/en_us/article/783akg/mastodon-is-like-twitter-without-nazis-so-why-are-we-not-using-it\">“Twitter without Nazis.”</a> Rather than one giant hot mess of a website, you log in to different “instances” of Mastodon, which are communities with varying purposes and themes. Instead of tweets, you post “toots,” and they have a 500-character limit. There’s also a built-in content warning feature. </li><li id=\"OLU8Wp\"><a href=\"https://www.reddit.com/\"><strong>Reddit</strong></a><strong>.</strong> There are certainly some toxic places on Reddit, but unlike Twitter, you’re not forced to pay attention to them. You can follow and subscribe to subreddits about anything that strikes your interest, from <a href=\"https://www.reddit.com/r/startrek/\"><em>Star Trek</em></a> to <a href=\"https://www.reddit.com/r/furby/\">Furbies</a>. Each subreddit has a clear set of rules, and they’re usually enforced. And if you get tired of a subreddit, you can leave it without leaving the website. </li><li id=\"DqAlcx\"><a href=\"https://www.tumblr.com/\"><strong>Tumblr.</strong></a> Tumblr is similar to Twitter in many ways, but it has a couple of key differences. For one, follower counts aren’t public, so certain members aren’t privileged over others in discussions or debates because of their audience’s size. Replies to other people’s posts don’t show up on your feed, so you don’t have to watch other users’ arguments devolve. And there’s no character limit, so you can add some nuance to the opinions you post. </li><li id=\"E72XBD\"><a href=\"https://www.facebook.com/\"><strong>Facebook.</strong></a> Yes, there are a lot of horrible, terrible, no good, very bad things about Facebook. But if you miss the ability to keep up with family and friends on Twitter, you can do that on Facebook, too. You won’t be constrained by the character limit, and you won’t have to worry about anyone outside of your friends list seeing your content. </li><li id=\"YPYT1z\"><strong>Newspapers.</strong> This might shock you, but plenty of media companies still sell physical newspapers and magazines. You can pick them up at newsstands, bookstores, and coffee shops and even have them delivered right to your mailbox if you buy a subscription. Rather than being bombarded all day, you’ll get your news in a digestible chunk each morning. The best part: you’ll look cool and sophisticated to everyone around you. </li><li id=\"XzW8SJ\">Just go to <a href=\"https://www.theverge.com/\"><em>The Verge</em></a><em>.</em> Don’t worry. We’re always here for you. </li></ul><p id=\"iCI8At\"><em><strong>Update April 14th, 2022, 10:10 AM ET:</strong></em><em> This article was originally published on February 25th, 2020, and has been updated to account for interface changes.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/h6AM8dhl6nSpyw2-A-qGFs95p-E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/5231517/Twitter-app-stock-Dec2015-verge-05.0.jpg",
  "description": "You can get it back later if you change your mind.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}