{
  "title": "How to convert your Xbox Live subscription into Game Pass Ultimate",
  "url": "https://www.theverge.com/23068983/xbox-game-pass-ultimate-pc-convert-xbox-live-gold-36-months-how-to",
  "date": "2022-05-16T15:23:10.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"The Xbox logo (a white sphere with an X through it) against a dark green background.\" src=\"https://cdn.vox-cdn.com/thumbor/BYnUI0KJF2cCgh4-vsCZRpylNPY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70874604/acastro_190530_1777_xbox_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"A4q38w\">Microsoft’s Xbox Game Pass Ultimate and <a href=\"https://www.theverge.com/2021/12/9/22827140/microsoft-pc-game-pass-naming-rebrand\">PC Game Pass</a> offer a lot of value if you want to play all kinds of games via subscription. The service normally costs $14.99 per month for Xbox Game Pass Ultimate (which covers both Xbox and PC) or $9.99 per month for PC Game Pass and includes AAA titles like <em>Halo Infinite</em> and <em>Forza Horizon 5</em> as well as rotations of major third-party games and indies.</p><p id=\"Psfcx3\">If you want to try it out, there’s an introductory price that gives you <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24542&amp;u1=vergehowto&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fxbox-game-pass-ultimate%2Fcfq7ttc0khs0%3Factivetab%3Dpivot%253aoverviewtab\" rel=\"sponsored nofollow noopener\" target=\"_blank\">one month of Xbox Game Pass Ultimate for $1</a>. But before you redeem it, you should know that it’s possible to use the trial as a way to save a <em>lot</em> of money on Game Pass Ultimate for up to three years. </p><div class=\"c-float-right\"><aside id=\"ZbaqiB\"><q>Activating the $1 trial can save you hundreds of dollars</q></aside></div><p id=\"6RD9oE\">Microsoft allows Xbox players to order up to 36 months of prepaid Xbox Live Gold service. And activating the $1 trial will automatically convert future months of Gold service to the more expensive Xbox Game Pass Ultimate, saving you hundreds of dollars. For some context on how much money you can save: it costs about $180 for three years of Xbox Live Gold. Add the $1 promotion, and you’re getting three years of Xbox Game Pass Ultimate for about $181 — whereas if you paid the full $14.99 per month for Game Pass Ultimate, those three years would cost you almost $540.</p><p id=\"BPWYNj\">It’s worth noting that this is really designed to be a one-time offer. If you’ve already used the offer to get a month for $1, you’ve used up your opportunity to convert Xbox Live Gold to Game Pass Ultimate without fully canceling Game Pass or letting it expire. (You must turn off auto-renewal on your account.) Resubscribing after that will charge the full $14.99 for the first month, instead of the $1 introductory price. </p><p id=\"hx7hNt\">So, if you haven’t used this conversion yet, here’s how to get the biggest bang for your buck.</p><h2 id=\"5MYpdf\">How to convert your Xbox Live service to Game Pass Ultimate</h2><ul><li id=\"iCSYa0\">To get in on this complimentary conversion, you’ll first need to buy an Xbox Live Gold subscription (assuming you don’t have one already). Microsoft may end the sale of Xbox Live Gold at some point as it funnels players into buying Game Pass Ultimate. But, <a href=\"https://news.xbox.com/en-us/2021/01/22/update-on-xbox-live-gold-pricing/\">for now</a>, you can still buy digital codes for the service from Amazon and other retailers in <a href=\"https://amzn.to/2RnMLcY\" rel=\"sponsored nofollow noopener\" target=\"_blank\">three</a>-, <a href=\"https://amzn.to/2FjhF11\" rel=\"sponsored nofollow noopener\" target=\"_blank\">six</a>-, or <a href=\"https://amzn.to/2KoFkS7\" rel=\"sponsored nofollow noopener\" target=\"_blank\">12-month</a> increments. </li><li id=\"zCgrJX\">The next step is to activate the Xbox Live Gold codes on your account, either through Microsoft’s website or directly through your Xbox One or Series X / S console. Microsoft states <a href=\"https://support.xbox.com/en-US/billing/xbox-subscriptions/xbox-game-pass-ultimate-faq#c169eab6f06940a7bbea6e289de77e37\">that the terms of this promotion are subject to change</a>, so I’d do this sooner than later as there’s no indication if it may one day stop converting Xbox Live Gold into Game Pass Ultimate.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CMKJgtRfPPX2mMFczVjNRvAVZvY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23457111/Xbox_Game_Pass_subscription_account.jpg\">      <figcaption><em>Once you buy the $1 Game Pass Ultimate trial, your prepaid months of Xbox Live Gold will automatically convert.</em></figcaption>  </figure><ul><li id=\"eqE7p1\">It’s now safe to take advantage of <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24542&amp;u1=vergehowto&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fxbox-game-pass-ultimate%2Fcfq7ttc0khs0%3Factivetab%3Dpivot%253aoverviewtab\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the $1 Game Pass Ultimate trial</a>. Once you redeem the offer, you’ll see something similar to the image above when you click the “Services &amp; subscriptions” tab of your account on Microsoft’s site.</li></ul><p id=\"Der1fR\">While this conversion is not possible with PC Game Pass, the Xbox Game Pass Ultimate plan covers both Xbox and PC. That makes this conversion from Xbox Live Gold an even better value if you play on both platforms.</p><p id=\"dRKytA\"><em><strong>Update May 16th, 2022, 11:23AM ET:</strong></em><em> This article was originally published on June 18th, 2019, and has been updated to reflect the current offer.</em></p><p id=\"cR98ef\"></p><p id=\"vJhj33\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5N_tmiuc4pIkeAG1f87JMBSUYdQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16309944/acastro_190530_1777_xbox_0001.0.jpg",
  "description": "The conversion from a Xbox Live Gold account is the key.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}