{
  "title": "How to play music on your smartwatch",
  "url": "https://www.theverge.com/22959795/music-smartwatch-apple-samsung-fitbit-garmin-wear-os",
  "date": "2022-03-03T15:59:10.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TnRp9Mitya3O1Q7nrKME4ac6FrA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70574288/akrales_190903_3635_0013.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"QL1lwD\">For a lot of people, music is an integral part of working out. But not everyone wants to schlep their phone around while hitting the trails or working up a sweat. That’s where smartwatches can come in pretty handy. While nearly every smartwatch lets you control music on your phone, a good number can also play music on-device.</p><p id=\"ec47Sn\">Whether it’s an Apple Watch, Samsung Galaxy Watch 4, Garmin, Fitbit or Wear OS watch, you’ve got a lot of options for listening to music. Much of it will depend on which service is supported and what OS your watch runs on. Some will have options for offline playback, either through downloadable playlists or onboard music storage. If your smartwatch has LTE, you may also be able to stream music directly to your wrist.</p><p id=\"PRhEek\">Keep in mind that you’ll likely need a pair of Bluetooth headphones, as not every smartwatch has a speaker. Also, if you want to download playlists for offline playback, you’ll almost certainly need a subscription to the music service of your choice. That’s not to say you can’t listen to music for free. You can, but your phone-free options will be much more limited. </p><p id=\"3g6g8u\">Here’s a breakdown of the major players by platform, and how to start listening.</p>  <figure class=\"e-image\">        <img alt=\"A new Apple Watch watch face\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AmL1Q5yBLXhEBEyzJ8Pw5lDfez4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21925616/vpavic_200929_4216_0171.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The Apple Watch has a lot of third-party music app options as well.</em></figcaption>  </figure><h1 id=\"DmK90t\">Apple Watch</h1><p id=\"JgqkpX\">First, you’ll want to make sure you have an <a href=\"https://www.theverge.com/2017/9/20/16334066/apple-watch-series-3-lte-new-features-review-2017\">Apple Watch Series 3</a> or later, running the latest possible version of watchOS. While you can listen to music on the Series 2, you can’t install the latest OS versions on it; Apple stopped support with watchOS 7. Also, the Series 2 is also five years old so you’re not likely to have a good experience. You can check<strong> </strong>if you’re up to date on watchOS<strong> </strong>by heading to the Watch app on your iPhone, selecting General, and then Software Update. </p><p id=\"FzY1yn\">The easiest way to stream music on the Apple Watch is with, you guessed it, Apple Music. Not only is it preinstalled onto the watch, but if you have an LTE watch with an Apple Music subscription you can stream straight to the wrist. All you have to do is ask Siri to play an artist or song title. You can also browse your library directly from the Music app on the watch. If you don’t have an LTE watch, you have the option to download playlists for offline playback.</p><p id=\"UHrIUf\">You can also hop into the Watch app on your phone, scroll down to the Music app menu, and from there you can load your playlists and albums. This might be an easier option if you like setting things up on a larger screen.</p><p id=\"i8bITk\">In addition, Apple has a ton of third-party apps in case you already subscribe to a different service. After years of customer complaints, Spotify has now added support for offline playlists and downloads on the Apple Watch. All you have to do is go to the watch’s on-wrist App Store, download the Spotify app, and log in. Spotify also works with Siri as long as you add “on Spotify” to the end of your request.</p><p id=\"JwAsHb\">While Apple Music and Spotify are the two most common music apps for the Apple Watch, there are plenty of other options. Pandora and Deezer also support offline playlists. There are also apps like TuneIn and iHeart Radio if you prefer radio. Overcast, Spotify, and Apple Podcasts are also good options if you’d rather listen to podcasts. </p><p id=\"adaNsT\">Just be aware that not all third-party Apple Watch apps are created equally. While some work flawlessly, others haven’t been specifically optimized for a good watch experience. Also, not every app will support offline playback, and those that do often require subscriptions.</p>  <figure class=\"e-image\">        <img alt=\"Most of the pre-installed apps on the Galaxy Watch 4 come from Samsung.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YrznZlqdrp50UtpFcuoRBVtmXaM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22787996/dbohn_210816_4717_0002.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>The Galaxy Watch 4 Classic gives you access to the Google Play Store.</em></figcaption>  </figure><h1 id=\"XPvqvy\">Samsung Galaxy Watches</h1><p id=\"fV7UZX\">If you have Samsung’s <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4 or Watch 4 Classic</a>, you can just skip down to the Wear OS section below. The process is a little different if you’re still on a Tizen OS watch.</p><p id=\"ESrOoT\">Spotify was one of the few partner apps available on Tizen watches, but it’s been a while since it’s been updated. (And it likely won’t get updated, given that Samsung has gone all-in on Wear OS.) Users have <a href=\"https://www.reddit.com/r/GalaxyWatch/comments/9eqqnj/is_the_spotify_app_for_tizen_abandoned/\">complained</a> <a href=\"https://community.spotify.com/t5/Ongoing-Issues/Spotify-on-Samsung-Galaxy-Watch-not-working-and-loading/idi-p/5323019\">on</a> <a href=\"https://www.reddit.com/r/GearS3/comments/al2esh/is_spotify_finally_usable_on_tizen_4/\">forums</a> about a degraded experience, so we don’t recommend using the app. </p><p id=\"uLkejU\">Many of Samsung’s older Tizen watches — the <a href=\"https://www.theverge.com/21368752/samsung-galaxy-watch-3-review-price-specs-features\">Galaxy Watch 3</a>, <a href=\"https://www.theverge.com/2019/3/7/18253561/samsung-galaxy-watch-active-review-smartwatch-fitness-specs-features-price\">Galaxy Watch Active</a> and <a href=\"https://www.theverge.com/2019/10/8/20903452/samsung-galaxy-watch-active-2-review-fitness-tizen-apps-features-android-price\">Active 2</a>, and the <a href=\"https://www.theverge.com/2018/8/31/17793094/samsung-galaxy-watch-review-iteration-over-innovation\">Galaxy Watch</a>, for example — have onboard storage so you can directly load music files onto them. </p><p id=\"WQq5Eq\">How Android users can add music via the Galaxy Wearable app:</p><ul><li id=\"yPQhxA\">Load the songs you want onto your phone</li><li id=\"bmx0mH\">Hit <strong>Watch settings </strong>and then <strong>Manage content </strong>or <strong>Add content to your watch</strong></li><li id=\"GSCoe5\">Tap <strong>Add tracks</strong></li><li id=\"sIxBuC\">Select the files you want, or hit <strong>All</strong> in the upper left corner.</li><li id=\"G5f857\">Once you hit <strong>Done</strong> you can play music on your watch via the Music app.</li></ul><p id=\"3Kp7XA\">iOS users need to have an iPhone 6 or later running at least iOS 12: </p><ul><li id=\"ufNWET\">Load the songs you want onto your phone</li><li id=\"mZg9L1\">Open the <strong>Galaxy Watch app</strong> </li><li id=\"YroNYc\">Navigate to the <strong>Home</strong> tab in the bottom left</li><li id=\"JVeeIe\">Select <strong>Add content to your watch</strong></li></ul><p id=\"OB8SZ8\">Samsung supports MP3, M4A, AAC, OGG, and WMA files. However, you can’t export music from streaming services like Spotify or Google Play, which use encrypted files.</p>  <figure class=\"e-image\">        <img alt=\"The Fossil Gen 6 is a large watch, but looks good on my wrist\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/v8NsSJOuLXuZQT6diYSek0oTbq4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22996110/dbohn_211105_4864_0002.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>Fossil’s Gen 6 smartwatch runs Wear OS 2, which has slightly more limited music options.</em></figcaption>  </figure><h1 id=\"azmmrf\">Wear OS watches</h1><p id=\"mn6Qh8\">If you’ve got a Samsung Galaxy Watch 4 or Watch 4 Classic, this will be easy. These watches are the first (and for now, only) watches to run Wear OS 3. That means they’ve got the Google Play Store right out the box. </p><p id=\"2dr3su\">Right now your best app choices are Spotify and YouTube Music, both of which support offline playback. (Though you do need to be a paying subscriber.) Android users can also follow the steps outlined in the previous section to physically load music onto the watch. The Galaxy Watch 4 and Watch 4 Classic do not, however, support iOS.</p><p id=\"Z4XkE9\">Right now, non-Samsung Wear OS watches run Wear OS 2. It’ll stay that way until we get a new batch of Wear OS watches or Google finally releases the update sometime later this year.</p><p id=\"tBC7Y5\">For a while, Wear OS 2 users didn’t really have any good options for listening to music after Google shuttered Google Play Music. The Spotify app for Wear OS 2 is also… not great. It’s more of a glorified remote control than an actual music app. But now, Google’s finally <a href=\"https://www.theverge.com/2021/9/27/22695976/youtube-music-wear-os-2-app-offline-downloads\">brought YouTube Music to Wear OS 2</a>. Keep in mind that you’ll need a subscription and you can only have offline downloads — no streaming. </p><p id=\"LQ14vL\">To get started:</p><ul><li id=\"kR9AJA\">Navigate to the <strong>Google Play Store</strong></li><li id=\"QK27sa\">Download <strong>YouTube Music</strong> onto your watch</li><li id=\"dpvrXP\"><strong>Sign in</strong> to your YouTube Music account</li><li id=\"Ate8Ea\">Tap the song or playlist you want to download</li><li id=\"rr4Ih6\">Hit the download icon</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/f0YdRuBPU9Jgg1a37sHWgiuNl2g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19168630/akrales_190903_3635_0013.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Spotify, Deezer, and Pandora are some of the major music services on Fitbit smartwatches.</em></figcaption>  </figure><h1 id=\"3pPeOO\">Fitbit</h1><p id=\"Sll1XE\">By far the easiest way to listen to music on a Fitbit smartwatch is to use Spotify, Deezer, or Pandora. </p><p id=\"lL3jU7\">The Spotify app is more of a music control app. It doesn’t support offline playback, so your phone needs to be nearby with the Fitbit app running in the background and connected to the internet. You also need a Spotify Premium account.</p><p id=\"M7Ulif\">Pandora and Deezer come preloaded on the <a href=\"https://www.theverge.com/2017/10/2/16392612/fitbit-ionic-smartwatch-fitness-tracker-review\">Fitbit Ionic</a> (which was <a href=\"https://www.theverge.com/2022/3/2/22957989/fitbit-ionic-recall-burns-smartwatch-fitness-tracker-refund\">recently recalled</a>), Sense, and <a href=\"https://www.theverge.com/2018/3/26/17163210/fitbit-versa-smartwatch-review-wearable-tech-apple-watch\">Versa</a> <a href=\"https://www.theverge.com/2019/9/9/20855458/fitbit-versa-2-review-fitness-tracker-smartwatch-price-specs-features\">series</a> (with the exception of the Versa Lite). You need to have a paid subscription to either service, as well as a Wi-Fi connection. Deezer users can download their playlists, while Pandora users can download their most-played stations or popular curated Workout stations.</p><p id=\"MVKzJ7\">You can also use the Fitbit Connect app to transfer your own files onto your device (the only exceptions are the <a href=\"https://www.theverge.com/21450123/fitbit-sense-review\">Fitbit Sense</a>, Versa Lite Edition, and Versa 3). The app is free to download <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.fitbit.com%2Fglobal%2Fus%2Fsetup&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22959795%2Fmusic-smartwatch-apple-samsung-fitbit-garmin-wear-os\" rel=\"sponsored nofollow noopener\" target=\"_blank\">here</a> — just scroll all the way down to the bottom of the page. </p><p id=\"fvyeoJ\">Fair warning: this is a tedious process that Fitbit outlined <a href=\"https://help.fitbit.com/articles/en_US/Help_article/2251.htm\">here</a> under the “How do I download playlists to my Fitbit watch?” section. Once you expand that section, scroll down to the Mac or Windows drop-down menus to see step-by-step instructions.</p>  <figure class=\"e-image\">        <img alt=\"The Garmin Fenix 7S on top of a book and next to coffee.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Oa28-dHJ0yOxb3lQ25Xj7uYX86o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242337/vsong_220209_5015_0001.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>You can load music from the Connect IQ store, or via the Garmin Express app.</em></figcaption>  </figure><h1 id=\"oEw4Y5\">Garmin</h1><p id=\"tEcgNi\">Right now, Garmin supports four major music streaming services: Spotify, Amazon Music, Deezer, and iHeartRadio. You can download all the apps via the <a href=\"https://apps.garmin.com/en-US/\">Connect IQ</a> store. (Again, you’ll need to have a subscription.) But once you’ve downloaded the app in question, navigate to your watch’s music/media widget. From there you can select your service of choice and you’ll be prompted to log in to your account. Once that’s done, you can begin syncing your music and playlists. </p><p id=\"S9PSj3\">The majority of Garmin watches come with music storage; you can check out the list <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.garmin.com/en-US/blog/general/which-garmin-smartwatches-have-music-storage/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">here</a>. But as with Fitbits, loading your personal libraries onto the watch can be a tedious process. You’ll have to download the <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.garmin.com/en-US/software/express/mac/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Garmin Express</a> app onto your computer and from there, follow Garmin’s detailed <a href=\"https://support.garmin.com/en-US/?faq=1ZDlVH09XB1169yYD5FIWA\">step-by-step instructions</a> for both Mac and Windows users on how to manage your music and audio files. </p><p id=\"ZkOFeh\"></p><p id=\"p7KqrN\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AGFCMyuwYcI8fyS5d_uVGDYv_AM=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19168630/akrales_190903_3635_0013.jpg",
  "description": "Loading your tunes onto your wrist is easy",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}