{
  "title": "How Ukrainians are fundraising in cryptocurrency",
  "url": "https://www.theverge.com/2022/2/26/22952357/ukraine-bitcoin-ethereum-donation-vitalik-buterin",
  "date": "2022-02-26T20:29:04.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mcqJ54YgZM6luarjiL3ieQ2ytho=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70554916/jbareham_180313_1777_bitcoin_cryptocurrency_0002.5.jpg\" />        <figcaption>Illustration by James Bareham / The Verge</figcaption>    </figure>  <p>More than $15 million has been donated so far</p> <p class=\"p--has-dropcap p-large-text\" id=\"qHxfw6\">More than $15 million in cryptocurrency has been donated to Ukrainian groups since Russia attacked the country on February 24th, <a href=\"https://www.elliptic.co/blog/live-updates-millions-in-crypto-crowdfunded-for-the-ukrainian-military\">according to research firm Elliptic</a>. Decentralized autonomous organizations (DAOs) have formed to support Ukrainians. NFTs have been sold to raise money for the Ukrainian people and military. The country’s official Twitter account has said it accepts Bitcoin, Ether, and Tether.</p><div id=\"FcVWJp\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Stand with the people of Ukraine. Now accepting cryptocurrency donations. Bitcoin, Ethereum and USDT.<br><br>BTC - 357a3So9CbsNfBBgFYACGvxxS6tMaDoa1P<br><br>ETH and USDT (ERC-20) - 0x165CD37b4C644C2921454429E7F9358d18A45e14</p>— Ukraine / Україна (@Ukraine) <a href=\"https://twitter.com/Ukraine/status/1497594592438497282?ref_src=twsrc%5Etfw\">February 26, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"InDpci\">Donations like these are ordinarily made the old-fashioned way: through banks. In tech-savvy Ukraine, crypto has emerged as a quick and easy way to handle this money. It’s not just money flowing into the country, either — <a href=\"https://www.theverge.com/22620464/tether-backing-cryptocurrency-stablecoin\">stablecoin Tether is supposed to be pegged to the US dollar</a>. But demand in Ukraine is so high that it’s broken its peg, and <a href=\"https://kuna.io/markets/usdtuah\">is trading above the dollar</a> — at $1.10, as of this writing.</p><p id=\"Refxmf\">“Coming from Ukraine, it’s totally normal to have stacks of dollars in physical proximity,” says Illia Polosukhin, a Ukrainian cofounder of NEAR Protocol, a competitor to Ethereum. He has family in Kharkiv, which was being bombarded as we spoke.  “You don’t trust the local currency and on top of that, you don’t trust banks.” That makes Ukraine a natural place for cryptocurrency adoption.</p><div><aside id=\"YtBuGC\"><q>Tether is particularly popular, partly because so many Ukrainians were used to working with the dollar as a reserve currency</q></aside></div><p id=\"NzZIdQ\">Ukraine is <a href=\"https://www.theinformation.com/articles/tech-companies-race-to-move-workers-out-of-ukraine-hubs\">known for its tech talent,</a> with more than 200,000 tech workers, and its IT export business did <a href=\"https://www.wsj.com/articles/ukraines-booming-tech-outsourcing-sector-at-risk-after-russian-invasion-11645749755\">$6.8 billion in volume last year</a>. It also officially <a href=\"https://fortune.com/2021/09/09/el-salvador-bitcoin-rollout-legal-currency-crypto-ukraine/\">legitimized Bitcoin and other cryptocurrencies last year</a>, in a law regulating digital financial assets and providing fraud protection for Ukrainians. (Previously, crypto existed in a gray area where people could transact but companies and exchanges doing so attracted law enforcement attention.)</p><p id=\"78gH4L\">The country <a href=\"https://blog.chainalysis.com/reports/2021-global-crypto-adoption-index/\">ranked fourth on Chainalysis’ Global Crypto Adoption Index</a>, behind only Vietnam, India and Pakistan, and about $8 billion of cryptocurrency passes through the country annually. “The big idea is to become one of the top jurisdictions in the world for crypto companies,” Alexander Bornyakov, the deputy minister at Ukraine’s Ministry of Digital Transformation, <a href=\"https://www.nytimes.com/2021/11/14/business/crypto-ukraine.html\">told <em>The New York Times </em>last year</a>.</p><p id=\"qfJUfq\">When Polosukhin was in Ukraine last year, he was surprised to see that crypto had proliferated widely, even among people who aren’t working on crypto projects. He noted that Tether is particularly popular, partly because so many Ukrainians were used to working with the dollar as a reserve currency. There was another factor: the relative paucity of investment options. Besides the real estate market, “the only other opportunity to invest is actually crypto.”</p><p id=\"hJh6SH\">That may explain why so many cryptocurrency and Web3 proponents have rallied around the country since the February 24th invasion. Though there are concerns that <a href=\"https://www.nytimes.com/2022/02/23/business/russia-sanctions-cryptocurrency.html\">Russian companies may also use cryptocurrency to evade sanctions</a>, <a href=\"https://www.coindesk.com/policy/2022/02/16/bank-of-russia-proceeds-with-digital-ruble-renews-push-for-crypto-ban/\">the Bank of Russia has been pushing for a ban on cryptocurrencies</a>. (Instead, it favors the digital ruble.) So when Ukraine’s central bank suspended digital cash transfers and limited cash withdrawals, crypto — alongside the dollar, gold, and silver — became a viable option for making transactions.</p><div class=\"c-float-right c-float-hang\"><aside id=\"OXVDa0\"><q>“It really restores your faith in how people and community and technology can do so much.”</q></aside></div><p id=\"YXPMz0\">Broadly, the international crypto community has reacted<a href=\"https://www.vice.com/en/article/v7dx39/crypto-community-rushes-to-ukraines-defense-armed-with-nfts-daos\"> with messages of support for Ukraine</a>. Vitalik Buterin, the creator of Ethereum, <a href=\"https://twitter.com/VitalikButerin/status/1496695424387801090\">tweeted that the invasion was “a crime”</a> against Ukrainian and Russian people, adding “Glory to Ukraine.” Later, Buterin retweeted <a href=\"https://twitter.com/Unchainfund/status/1497380711288152067\">an announcement from Unchain.fund, aimed at humanitarian relief</a>. Nine people have to sign off on the funds being dispersed; NEAR’s Polosukhin is <a href=\"https://twitter.com/Unchainfund/status/1497380735485116416\">one of the signers</a>. After we spoke, Polosukhin sent me <a href=\"https://docs.google.com/document/d/1weC27Ng9Gq7OG3iFugcWEwZtwHYOelrlRB2u4dvrgiI/edit#\">a document with ways to donate</a>.</p><p id=\"xP6LK8\">It’s not just Polosukhin. A member of Russian performance art group Pussy Riot <a href=\"https://decrypt.co/93787/pussy-riot-trippy-labs-pleasrdao-launch-ukraine-dao\">created UkraineDAO</a>, to use “the power of web3 tech and community to raise funds.” There’s also <a href=\"https://reli3f.xyz/\">RELI3F,</a> “a humanitarian aid initiative founded by NFT/web3 artists collaborating to support the people of Ukraine.” On Twitter, <a href=\"https://twitter.com/SBF_FTX/status/1496980981617946624\">the CEO of the cryptocurrency exchange FTX</a> announced that the company “just gave $25 to each Ukrainian on FTX. Do what you gotta do.”</p><p id=\"GO48FD\">Yev Muchnik, a Ukrainian-born lawyer who’s lived in the US since 1988, has been working on Ukraine United DAO with developers from <a href=\"https://piefi.io/\">PieFi</a>. “Everyone’s kind of banding together to figure out ways they can help,” she told me. “It really restores your faith in how people and community and technology can do so much.” Among the DAO’s goals: creating peer-to-peer mesh networks to preserve internet connectivity, even if centralized internet service providers go down.</p><div id=\"TFKu0b\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">My Ukrainian credit cards don't work anymore. I'm safe physically in Kazakhstan, but all my savings are gone.<br><br>Crypto is the only money I still have, and today I can say without exaggeration that <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a>, <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>, and <a href=\"https://twitter.com/hashtag/NFT?src=hash&amp;ref_src=twsrc%5Etfw\">#NFT</a> are going to save my life while I can't come back home.</p>— ARTYOM FΞDOSOV    (@usleepwalker) <a href=\"https://twitter.com/usleepwalker/status/1497255981851496449?ref_src=twsrc%5Etfw\">February 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"sdIYW9\">“The missing link is trying to figure out what people on the ground need,” Muchnik says. She thinks that blockchain technology will make it easier to make sure that funds that are raised for Ukrainians actually go where they’re supposed to. Her understanding now from people on the ground in Ukraine is that people are withdrawing money from their bank accounts and trying to find alternative ways to transact.</p><p id=\"595JXk\">The collective coordination effort demonstrates how crypto can be used as a public good, Muchnik says. She’s coordinating with people in Ukraine and Poland to verify and authenticate the organizations that spring up. The blockchain also means that the flow of funds is traceable; anything unused can be returned.</p><div class=\"c-float-left c-float-hang\"><aside id=\"xCuDgl\"><q>“It’s pretty, pretty scary, actually.”</q></aside></div><p id=\"nQzzuc\">Oleksii Stoiko runs a popular Telegram channel in Ukraine about cryptocurrency, which he created after being inspired by <a href=\"https://banklesshq.com/\">Bankless</a>, a media organization focused on crypto. It exploded in popularity about a year and a half ago, he told me from his home in the western part of the country. It doesn’t surprise him that Ukrainians have taken to crypto. “Ukrainians are natural when it comes to coordination,” he says.</p><p id=\"bqstgl\">On February 24th, Stoiko felt too frightened to leave his house, even though there were no Russian troops nearby. “It’s pretty, pretty scary, actually,” he says. Right before he and I spoke, he was reinforcing the windows in his apartment with duct tape. </p><p id=\"yHXjG7\">When we spoke on the 25th, things in Stoiko’s area were mundane, except for the empty shelves in big supermarkets — the most popular foods are all gone — and a lot of people running around with suitcases. But the outreach from the cryptocurrency community has helped him feel less alone. “It really warms my heart to read all these kind words and support for me personally and for all Ukrainian people,” he says.</p><p class=\"c-end-para\" id=\"Bd89RY\">Polosukhin’s focus right now is on making sure that those in need are taken care of — whether that’s in cryptocurrency or not. It’s easy to send crypto, he notes, but it’s not necessarily easy for people to receive it if the internet or power is cut off. When we spoke, the only thing working in Kharkiv were mobile providers, and Polosukhin wasn’t sure when they’d fail too. For those who had it, cash was still the best strategy.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/teEVxppIZ_JTW-LSIR-MzRcovdk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10418913/jbareham_180313_1777_bitcoin_cryptocurrency_0002.jpg",
  "description": "\"You don’t trust the local currency and on top of that, you don’t trust banks.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}