{
  "title": "How to watch Elon Musk’s Starship presentation live",
  "url": "https://www.theverge.com/2022/2/10/22925244/elon-musk-starship-presentation-watch-how-to-start-time",
  "date": "2022-02-10T18:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IoXxfXLfQttNlq_kFze9CGNG8As=/0x0:3840x2560/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70493730/51370391111_a43a3825e5_o__1_.0.jpg\" />        <figcaption><em>SpaceX stacking its Starship spacecraft on top of a Super Heavy booster at the company’s launch site in Boca Chica, Texas.&nbsp;</em> | SpaceX</figcaption>    </figure>  <p id=\"eHJdIr\">This evening, SpaceX CEO Elon Musk will give a presentation about his company’s next generation Starship system — a massive new rocket that SpaceX has been developing over the last few years to take humans to the Moon and eventually Mars. It’ll be Musk’s first presentation on the vehicle since 2019 and his fifth one overall since 2016.</p><p id=\"yGorgM\">Starship is by far SpaceX’s most ambitious project to date. The design calls for a giant spaceship and rocket combo that would be more powerful than the Saturn V rocket that took humans to the Moon. Starship, the passenger part of the vehicle, is meant to launch to space on top of a gargantuan booster rocket known as the Super Heavy. Starship is supposed to be capable of landing on the surface of the Moon and back on Earth, while Super Heavy is also meant to land itself back on Earth, making the entire system reusable.</p><h2 id=\"NUsJ0g\"><strong>HOW DO I WATCH ELON MUSK’S STARSHIP PRESENTATION?</strong></h2><p id=\"Tp6CXL\">SpaceX plans to livestream Musk’s presentation to its YouTube channel, which will be embedded above.</p><h2 id=\"kXpvAf\"><strong>WHAT TIME DOES THE SPACEX LIVESTREAM START?</strong></h2><p id=\"XanXlB\">Musk said the presentation would begin at 8PM Central time, but given his record on past performances, it’d be wise to give that start time some padding.</p><p id=\"2vRK5P\"><strong>Scheduled start time:</strong> New York: 9PM / San Francisco: 6PM / London: 2AM / Berlin: 3AM / Moscow: 5AM / New Delhi: 7:30AM / Beijing: 10AM / Tokyo: 11AM / Melbourne: 1PM</p><h2 id=\"i0i5rc\"><strong>WHAT WILL ELON TALK ABOUT?</strong></h2><p id=\"LXiNAf\">SpaceX and Musk have provided little detail about what exactly will be discussed during today’s update, but there are a few items that seem likely to come up. Perhaps the most pressing topic is the Federal Aviation Administration’s ongoing review of SpaceX’s proposed launch facility in Boca Chica, Texas — the site of Musk’s talk. </p><p id=\"zefePY\">SpaceX is very eager to launch its Starship vehicle to orbit from the Texas location. It’s the primary place where SpaceX has been building prototypes of the rocket, and it’s the place where the company has conducted a few high-altitude test flights of the vehicle. But in order to go orbital from Texas, the company first needs the green light from the FAA. The agency is responsible for issuing licenses for rocket launches to orbit, to ensure they don’t damage uninvolved people or property.</p><div class=\"c-float-right\"><aside id=\"MpMqyF\"><q>The FAA is now considering whether to give Starship a license to launch out of Boca Chica</q></aside></div><p id=\"LQzRhj\">The FAA originally conducted a review of the Boca Chica site back in 2014, creating a full environmental impact statement, or EIS, that looked at how the facility might affect the surrounding area (which is notably part of a wildlife refuge). The assessment didn’t find any major problems, but that was back when SpaceX proposed launching its much smaller Falcon 9 and Falcon Heavy rockets out of Boca Chica. SpaceX has abandoned the idea of launching its Falcon vehicles from the facility now, and is only focused on launching Starship there. Meanwhile, the proposed launch site has significantly expanded in scope, and even <a href=\"https://techcrunch.com/2021/10/08/the-mystery-of-elon-musks-missing-gas/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAFoLP9CjVxEVqTihzYwQRLG7Y7CxhioNC7_WpHtLaSk7yOENsfgIisI__LOOXLt-PXZnN_WRVN-eYMjiNz3x-bPEDt1FZcf2_9PLYGQ87Iba9begJhnAL_A8fJmNfKAr-OCNsWCJ0IFxRtmW1zxswCQoyEy5w9IrS4aoo2o4OBHg\">includes major modifications like a natural gas plant for pretreating methane</a>, one of the main propellants needed for Starship’s primary Raptor engines.</p><p id=\"UlUbV2\">The FAA is now <a href=\"https://www.faa.gov/space/stakeholder_engagement/spacex_starship/\">considering whether to give Starship a license</a> to launch out of Boca Chica. As part of that decision-making process, SpaceX <a href=\"https://www.faa.gov/space/stakeholder_engagement/spacex_starship/media/Draft_PEA_for_SpaceX_Starship_Super_Heavy_at_Boca_Chica.pdf\">provided a draft assessment</a> detailing what it plans to do with the site in the future. When that assessment was released, <a href=\"https://www.theverge.com/2021/10/21/22738106/spacex-boca-chica-starship-launch-site-faa-town-hall-environmental-assessment\">the FAA invited the public to give their opinions on the proposal</a> and received a whopping 18,000 public comments. The opinions ranged from extreme enthusiasm for the project to harsh criticism, with some critics calling for the FAA to conduct another EIS based on SpaceX’s proposed updates. And it’s possible the FAA may do that. The agency can come up with one of three findings: that SpaceX’s updates will have no significant impact on the area, that SpaceX must take certain steps to mitigate its impact on the surrounding area, or that the FAA must conduct another EIS, a process that could take many months or even years as the agency interviews more people, collects more data, and does extensive research in cooperation with other federal agencies like NASA.</p>  <figure class=\"e-image\">        <img alt=\"SpaceX CEO Elon Musk Gives Update On Starship Launch Vehicle At Texas Launch Facility\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1PXqx4wkbV3sonuKi6caKHblGVc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23230290/1171856943.jpg\">      <cite>Photo by Loren Elliott/Getty Images</cite>      <figcaption><em>Elon Musk giving his last Starship presentation in Boca Chica, Texas in 2019.</em></figcaption>  </figure><p id=\"Au95zG\">The FAA said it should make its decision by the end of February. The decision was initially supposed to be finalized by late December, but it’s taken both the FAA and SpaceX considerably more time than expected to respond to the sheer volume of public comments. With that February deadline coming up, the timing of Musk’s presentation this month doesn’t feel like a coincidence. Musk has a history of putting public pressure on the FAA when the regulator doesn’t make the decisions he likes with regards to his rocket launches. It’s possible the FAA might come up tonight, and if not, it will certainly be the elephant in the room.</p><p id=\"n2XM3h\">Musk may also give updated timelines for Starship milestones, which he usually does during these presentations. Past timelines have always been incredibly aspirational and, in hindsight, unrealistic. During his last presentation in September of 2019, Musk said SpaceX was going to try to launch Starship to orbit <a href=\"https://www.theverge.com/2019/9/28/20888978/spacex-starship-super-heavy-update-elon-musk\">within the next six months</a>. Clearly, that didn’t happen. Musk’s latest prediction in November for Starhip’s orbital launch was <a href=\"https://spacenews.com/musk-predicts-first-starship-orbital-launch-in-early-2022/\">January or February</a>, but given the FAA’s decision timetable, March is the absolute earliest plausible timeframe — and that’s <em>if</em> the federal agency’s decision comes down in SpaceX’s favor. It also remains to be seen if SpaceX is actually ready for a March launch.</p><div class=\"c-float-left\"><aside id=\"NQDr3f\"><q>Timelines have always been incredibly aspirational</q></aside></div><p id=\"8ZqqxZ\">There’s also the topic of SpaceX’s ongoing partnership with NASA. Last year, the space agency <a href=\"https://www.theverge.com/2021/4/16/22387887/elon-musk-spacex-win-nasa-lunar-lander-contract-artemis\">awarded SpaceX $2.9 billion</a> to develop Starship as a human lunar lander that can take NASA astronauts to and from the surface of the Moon in support of its Artemis program. As of now, NASA is aiming to conduct its first human landings with Starship as early as 2025, though that date is also considered fairly aspirational. Any updates on NASA and SpaceX’s working relationship would be useful.</p><p id=\"Xgm4pe\">One thing that would be nice for Musk to talk about is <a href=\"https://www.theverge.com/2019/10/4/20895056/elon-musk-starship-spacex-human-health-life-support-radiation\">any updated plans for human survival on Starship</a>. Most of the presentations in the past have revolved around the impressive specs and mechanics of the vehicle, while Musk usually brushes aside questions about life support systems, radiation shielding, and other technology related to human comfort. But Starship is primarily a passenger vehicle, and those sorts of technologies are going to become necessary as SpaceX makes its way through the development process.</p><p id=\"IuSblz\">However, Starship isn’t just intended for human use. SpaceX also has grand plans to use the spacecraft to launch its next generation satellites for its Starlink project, a massive mega-constellation of satellites in low Earth orbit designed to provide broadband internet services to the ground below. SpaceX filed an updated license with the Federal Communications Commission last year to launch its upgraded, larger Starlink satellites on Starship. And a recent email from Musk to the company <a href=\"https://www.theverge.com/2021/11/30/22809720/elon-musk-spacex-raptor-engine-crisis-bankruptcy-starship\">indicated that Starship is pretty vital to Starlink’s overall success</a>.</p><p id=\"kWmj3q\">As for updates on the vehicles themselves, it’s hard to know what Musk could say that isn’t known already. SpaceX’s operations in Boca Chica have become fairly public, as teams of enthusiasts have started camping out around the facility, livestreaming views of daily operations there. Perhaps Musk has something new up his sleeve, but it’s pretty hard to keep secrets at the facility these days. </p><p id=\"xSP932\">If nothing else, the presentation should have a fairly impressive display. SpaceX has fully stacked its latest Starship prototype on top of a Super Heavy booster for the talk’s backdrop. Though it might be hard to get the full vehicle in the shot.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/peBAkrMZapeMz-nPTHVgfID3NT0=/0x275:3840x2285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23216699/51370391111_a43a3825e5_o__1_.jpg",
  "description": "An overdue update on SpaceX’s biggest project",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}