{
  "title": "How Facebook twisted Canada’s trucker convoy into an international movement",
  "url": "https://www.theverge.com/2022/2/19/22941291/facebook-canada-trucker-convoy-gofundme-groups-viral-sharing",
  "date": "2022-02-19T14:00:00.000Z",
  "author": "Ryan Broderick",
  "content": "      <figure>      <img alt=\"Snow covers the protest convoy. Ottawa Police handed out papers telling the truckers to leave or face arrest there was no movement on Wellington Street in front of Parliament Hill\" src=\"https://cdn.vox-cdn.com/thumbor/FqoH5efpZWOmh5SfXZKDscf5dW4=/0x0:4980x3320/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70528747/1238598228.0.jpg\" />        <figcaption>Photo by Steve Russell / Toronto Star via Getty Images</figcaption>    </figure>  <p>A labyrinth of Facebook groups and right-wing media</p> <p class=\"p--has-dropcap p-large-text\" id=\"f1x1AK\">After more than two weeks of chaotic protest, this week, the Canadian government pushed back. On Tuesday, Canadian Prime Minister Justin Trudeau <a href=\"https://www.cnn.com/videos/world/2022/02/15/canada-trudeau-emergencies-act-protests-newton-pkg-intl-ovn-vpx.cnn\">invoked</a> the country’s Emergencies Act, enabling new financial restrictions on the protests and signaling harsh new penalties against anyone involved. </p><p id=\"KFZ3hF\">For many Canadians, it’s an overdue end to a chaotic protest that has <a href=\"https://www.freep.com/story/news/local/michigan/2022/02/15/ambassador-bridge-blockade-caused-nearly-300-m-losses/6789134001/\">stifled trade</a> and brought <a href=\"https://theweek.com/protests/1010183/canadian-mounties-seize-weapons-cache-arrest-13-in-alberta-freedom-convoy-blockade\">alarming weaponry</a> into otherwise quiet communities. But right-wing supporters have a wildly different view of events: figures like Tucker Carlson have <a href=\"https://www.foxnews.com/opinion/tucker-carlson-canada-working-class-rebelled\">portrayed the convoy</a> as a working-class rebellion, and Trudeau’s response has been treated as enacting martial law, leading Elon Musk <a href=\"https://fortune.com/2022/02/17/elon-musk-twitter-justin-trudeau-hitler-meme-freedom-convoy-truckers/\">to tweet</a> (and then delete) a meme comparing Trudeau to Adolf Hitler. </p><p id=\"ZjNp2L\">It’s a shocking split, arguably the single most important factor in the protests, and much of it originates in the fractured way information travels online. Convoy supporters are getting their news from a tangle of Facebook groups, Telegram channels, and random influencers, which is all then amplified and expanded by right-wing broadcasters like Carlson, <em>The Daily Caller</em>, or Canadian right-wing media network Rebel News. These channels promote a sanitized version of movements like the Freedom Convoy, amplifying its hashtags and turning its obscure extremist leaders into celebrities. </p><div class=\"c-float-right c-float-hang\"><aside id=\"BF8qyn\"><q>From physical protest to social media to establishment outlets</q></aside></div><p id=\"akzKss\">This pipeline — from physical protest to social media to establishment outlets — is what has helped the convoy evolve from a local standoff into a televised event that can raise millions from supporters thousands of miles away. Almost all of that infrastructure pre-dates the convoy itself, drawing from anti-vaxx groups, QAnon, and other fringe communities. And while the convoy itself may soon be broken up by the Canadian government, those online pathways are much stickier.</p><p id=\"RnyUoZ\">To understand how this echo chamber works, we have to start with the Ottawa protest itself. The “Freedom Convoy’’ started as a loosely affiliated group of Canadian truck drivers led by a group called Canada Unity, <a href=\"https://www.theguardian.com/world/2022/feb/08/canada-ottawa-trucker-protest-extremist-qanon-neo-nazi\">founded</a> by far-right activist and QAnon conspiracy theorist James Bauder. But over the last 30 days, Bauder has managed to build a coalition of fed-up truck drivers, fringe Canadian political party members, <a href=\"https://www.cbc.ca/news/canada/edmonton/edmonton-area-mp-under-fire-for-photo-of-him-near-flag-bearing-nazi-symbol-1.6333266\">neo-Nazis</a>, anti-vaxxers, and an international coterie of scammers, grifters, and low-level online creators that has been able to generate major headlines around the world. </p><p id=\"GVZRG9\">The convoy’s spread across Facebook didn’t gain any real momentum until a <a href=\"https://rumble.com/vstzg3-freedom-convoy-2022-let-it-roll-down-the-highway-ottawa-we-are-coming.html\">video about the protest</a> was posted on Rumble, a right-wing video platform, on January 18th by a user named Ken Windsor and started to get a few thousand shares. In the caption of the video, Windsor shared links to a page called “<a href=\"https://www.facebook.com/realFreedomConvoy2022/?ref=page_internal\">Freedom Convoy 2022</a>,” which had been started four days earlier, according to Facebook’s page transparency tools. Windsor had posted several videos on Rumble about truck drivers planning to protest Canadian COVID mandates before this. But the post on January 18th, according to social analytics tool Buzzsumo, was the most-shared piece of convoy content during this first week after <a href=\"https://www.facebook.com/100286905896085/posts/102738958984213\">it was posted</a> to the Freedom Convoy 2022’s page. </p><div class=\"c-float-left c-float-hang\"><aside id=\"KMyHkf\"><q>“The Freedom Convoy has had connections to the Canadian far-right from the beginning”</q></aside></div><p id=\"2e79e4\">Windsor’s Rumble video also linked out to a right-wing Canadian video creator named <a href=\"https://www.facebook.com/therealpatking/\">Pat King</a>, who was active in Canada’s Yellow Vests protests, and also promoted the movement’s now-defunct GoFundMe page. Following Windsor’s video, between January 14th and January 23rd, several other Facebook pages and groups were created to support the truckers, including the first sizable Facebook group for convoy supporters, which was initially called <a href=\"https://www.facebook.com/groups/228652602692350\">Freedom Convoy 2022</a> but has since changed its name to “Convoy For Freedom 2022         ”. The group <a href=\"https://www.facebook.com/photo/?fbid=463259888641049&amp;set=g.228652602692350\">was also a major initial supporter</a> of the GoFundMe page, with users sharing it on the very first day the Facebook page <a href=\"https://www.facebook.com/photo/?fbid=463112201989151&amp;set=g.228652602692350\">was launched</a>. </p><p id=\"oqAT3g\">According to <a href=\"https://www.antihate.ca/the_freedom_convoy_is_nothing_but_a_vehicle_for_the_far_right\">AntiHate.ca</a>, the GoFundMe was run by Tamara Lich, another former Canadian Yellow Vest who works for a Canadian separatist party, and B.J. Dichter, a right-wing commentator known for Islamophobic rhetoric. </p><p id=\"BpRtee\">Paris Marx, a PhD candidate based in Canada and host of the podcast <em>Tech Won’t Save Us</em>, told <em>The Verge</em> that the Freedom Convoy’s connections to the country’s far-right significantly outweigh its connections to actual Canadian truckers.</p><p id=\"fEaL7o\">“It’s been pretty well-documented at this point that the Freedom Convoy has had connections to the Canadian far-right from the beginning, including having been behind the initial GoFundMe fundraiser,” he said. “It also never really represented a broad swath of truckers — 90% of whom are vaccinated and whose trade organizations distanced themselves from, if not outright opposed, the convoy.”</p><p id=\"48p5DA\">On January 25th, the Trucking for Freedom group officially <a href=\"https://www.facebook.com/truckingforfreedomfilm/posts/107864951806198?__cft__%5B0%5D=AZXTAnUr9v9BZi8EVpIFQfP-TFsd7l_1WaXqqbff_XwNS4rGQ_gJT_0XuySr2Yef77YRRR9czdgLVPNwh5AGDujJdPl6UCf32Fu0ggnnMd0EGS_zZ3ST3KGzrn3OaJcX0hSiMze0NQIK5FjE1Lj85tuJ&amp;__tn__=%2CO%2CP-R\">connected</a> with the organizers of the trucker’s protest, Canada Unity, and the group’s founder, James Bauder. Trucking for Freedom would become something like the group’s official documentarians during these early weeks. King’s livestreams and high-res photography from the road were distributed through the Trucking for Freedom group. From there, they were shared through a series of small Canadian Facebook pages and groups like <a href=\"https://www.facebook.com/Freedom-Convoy-2022-Manitoba-Info-103484238907833/\">Freedom Convoy 2022 Manitoba Info</a> and <a href=\"https://www.facebook.com/VIFreedomconvoy2022/\">VI Freedom Convoy 2022 Bearhug Ottawa</a>. </p><div class=\"c-float-right c-float-hang\"><aside id=\"MaE3k6\"><q>Five convoy groups were created by a single hacked account</q></aside></div><p id=\"zXF2cC\">The reach on this content, though organic, was small. Many of Pat King’s videos, for instance, <a href=\"https://www.facebook.com/watch/?v=630023884960392\">have been watched</a> less than 100,000 times. In January, posts tagged things like <a href=\"https://www.facebook.com/hashtag/freedomconvoy?__eep__=6&amp;__cft__%5B0%5D=AZWvd-WnrHgfazpu30Lyp9I6hXo4oRAuzpe-Wn62BeOojg4n3eUuQNC1847j5FAZOmalfLZ4jtojr-VZI4A4_Krf99CqqRLgEt5ZVUM1rILeeHav_NXznYOOf5UxPFqrhSwtI2a7cNMWQWQ2igkynXqd&amp;__tn__=*NK-R\">#FreedomConvoy</a>, <a href=\"https://www.facebook.com/hashtag/freedomconvoy2022?__eep__=6&amp;__cft__%5B0%5D=AZXrTZncWZcHONNuFyKOGaYLMMYHRARFH_GVubM8b8pMnkksIEhJqzCHLlQFI0cPZ25jeKmUIDaXj8VBG_ya2nG3AQjRClinVGHdRJXuqJSryPtBuv2XHO3M6fzFP2vAR3OOa7pMNdC6rd4rrbHGypPi&amp;__tn__=*NK-R\">#freedomconvoy2022</a>, and <a href=\"https://www.facebook.com/hashtag/truckersforfreedom?__eep__=6&amp;__cft__%5B0%5D=AZUEkjQkgBip_4LT4wk7Ay82qxlghXrRr2N4h5rJ9W5WwBKxz-LQnePCI1sQfkr6EuzxMQK3SYRJVqC1UBpoSV8FxsXEWK2wq4mwJ5rC4mYkCbrLh2RYCmXBJT0g9v4ZskAkUoD6BuGVKteRtq_twsaw&amp;__tn__=*NK-R\">#TruckersForFreedom</a> were unquestionably local, like an <a href=\"https://www.facebook.com/continentalcattlecarriers/posts/1645536309133379\">emotional post</a> from the page for the Continental Cattle Carriers, Ltd., in Alberta, Canada, or a viral <a href=\"https://www.facebook.com/jlmunro/posts/10160101899841303\">photo album</a> of children cheering on the truckers.</p><p id=\"EViE6W\">According to Buzzsumo, the total mentions for “convoy” across the web jumped 195 percent between Tuesday, January 25th, and Saturday, January 29th, peaking on that Saturday with 1,920 total mentions, which coincided with other large groups popping up like “<a href=\"https://www.facebook.com/groups/365900044869618/\">Convoy to Ottawa 2022</a>”. But this was also the last moment the truckers convoy would still be entirely Canadian. From here, it would travel south to the United States but also beyond North America entirely, gaining support from right-wing pages across Europe. </p><p id=\"rvWv45\">With that international attention, convoy groups also began to attract scammers and counterfeits. An <a href=\"https://www.grid.news/story/misinformation/2022/02/08/the-hacked-account-and-suspicious-donations-behind-the-canadian-trucker-protests/\">investigation</a> from <em>Grid News</em> found that five convoy groups were created by a single hacked account (formerly belonging to a woman from Missouri) and a Facebook spokesperson <a href=\"https://www.nbcnews.com/tech/internet/us-trucker-convoy-picks-momentum-foreign-meddling-adds-fray-rcna15932\">told NBC News</a> that content farms as far as Bangladesh and Vietnam were promoting convoy memes. For instance, on January 28th, a page currently called <a href=\"https://www.facebook.com/wearefreedompeople/?ref=page_internal\">Freedom People</a>, run out of Bulgaria, created a convoy Facebook group called, “Freedom Convoy Worldwide,” which currently has 9,000 members. (The Freedom People page currently uses the “Freedom Convoy Worldwide” group as a way to advertise a PayPal donation page for itself.) </p><div><aside id=\"bHF6c8\"><q>“Users in Telegram chats are being bombarded with conflicting maps, routes, dates, and times that seem to evolve by the hour”</q></aside></div><p id=\"MaUtV0\">The movement’s international spread also introduced it to Facebook’s larger universe of anti-vaxxers and conspiracy theorists. On January 24th, a Facebook page run by four people based in the United States posted its first <a href=\"https://www.facebook.com/2020TheRealTruth/videos/1810473889148715\">video</a> about the convoy. And based <a href=\"https://www.facebook.com/watch/?v=1850086528527879\">on shares</a>, the page has become so viral that it may be possibly the center of the entire convoy movement online right now. It’s called “<a href=\"https://www.facebook.com/2020TheRealTruth/\">2020: What’s the Real Truth</a>,” and, according to Facebook’s page transparency tools, it was originally titled, “2012: What’s the Real Truth,” seemingly based on the 2012 doomsday conspiracy. It then changed its name in January 2021 and pivoted to hardcore anti-vaccine and anti-mask content, posting multiple times a day, advocating for a global revolution against COVID protocols.</p><p id=\"ZlaJ2b\">But by the end of January, Canadians were no longer leading the convoy — at least when it comes to the movement’s online presence. It was around this time that what is possibly the largest still-active convoy group was created, and it doesn’t appear to be run by any Canadians at all. It’s called “<a href=\"https://www.facebook.com/groups/2711696262309046\">The People’s Convoy - Official</a>,” and it has 87,000 members. The group has five administrators, all of which show ties to the US on their Facebook profiles.</p><p id=\"hVwXqX\">This disorganized second phase of the movement has created real confusion for supporters, according to Sara Aniano, a misinformation researcher who has contributed to the Global Network on Extremism &amp; Technology.</p><p id=\"FDU7XV\">“Users in Telegram chats are being bombarded with conflicting maps, routes, dates, and times that seem to evolve by the hour, and many have expressed confusion,” Aniano said. “I’ve read comments about wanting to see liberal enemies hanging from nooses, but I’ve also read comments about having a big party and bringing food trucks. Again, they’re not on the same page.”</p><div class=\"c-float-left c-float-hang\"><aside id=\"LUWMuG\"><q>“Fox News has an interesting way of filtering very local events through the prism of its own culture wars”</q></aside></div><p id=\"5P5ix7\">But based on Facebook metrics, the core of the Freedom Convoy was never really anything more than a small collection of local conspiracy theorists who were then suddenly given a megaphone by America’s powerful right-wing disinformation machine. Their campaign was first supercharged by Facebook’s algorithm, which currently favors content shared within local groups, and was then blasted out into every feed and screen possible by ravenous conservative tabloids. American right-wing publisher <em>The Daily Wire</em>, founded by conservative commentator Ben Shapiro, latched on to the story at the end of January and published 66 articles featuring the keyword “convoy” between January 28th and January 31st. And the most popular story of theirs from this time period <a href=\"https://www.dailywire.com/news/convoy-to-dc-facebook-group-amasses-90k-followers-calls-on-american-truckers-to-form-nationwide-protest-against-vax-mandates\">actually promotes</a> a Facebook group that would eventually get <a href=\"https://www.foxnews.com/media/facebook-dc-trucker-page-freedom-convoy-censorship\">shut down</a> by the platform after barely four days for repeatedly violating Facebook’s policies around QAnon.</p><p id=\"QTsTKk\">Amplifying small right-wing political movements like this has become a powerful piece of the conservative toolkit — particularly in the time of COVID. Case in point, <a href=\"https://twitter.com/AmarAmarasingam/status/1491821734554656769\">over the last month</a>, Fox News aired over eight hours of programming about the Freedom Convoy, warning that an American version was on its way. </p><p id=\"Vdelga\">“Fox News has an interesting way of filtering very local events through the prism of its own culture wars, which creates the impression for their followers that they are part of some transnational grassroots uprising,” Amarnath Amarasingam, a professor at Queen’s University and senior fellow at the International Center for the Study of Radicalisation and Political Violence, told <em>The Verge</em>. </p><p id=\"FvWZOy\">But <em>The</em> <em>Daily Wire</em> may have succeeded in putting the convoy on Fox News’ radar. The bulk of the Facebook activity around <em>Daily Wire</em> stories has actually come from a network of larger collaborator pages associated with <em>The</em> <em>Daily Wire</em> itself. Crowdtangle data shows that one January 31st story about the 90,000-member convoy Facebook group was able to get a lot of interactions on the platform because it was shared to Shapiro’s personal page twice, twice to the personal page of a <em>Daily Wire</em> commentator Michael Knowles, twice to the personal page of another <em>Daily Wire</em> collaborator Matt Walsh, and once to <em>The</em> <em>Daily Wire</em>’s main Facebook page. The American media attention around the movement accelerated its lifecycle and, in the end, just turned it into another meaningless Facebook meme. </p><p id=\"zo9Kcu\">The last real moment of cohesion within the movement was when GoFundMe shut down the convoy’s donation page on February 5th, causing a massive spike in activity. And engagement hasn’t really come back. In many ways, the GoFundMe shutdown was the defining event of the entire convoy. But it also exposes an ugliness that’s been part of the movement since the very beginning. According to a statement from GoFundMe, the convoy’s fundraiser was shut down after the company was given evidence from Canadian law enforcement that protesters were planning to occupy Ottawa.</p><p id=\"AWAUPW\">Amarasingam said Fox News’ coverage has given a huge boost to fringe anti-government figures like Bauder and King, who would not have been influential enough to spark global interest on their own. As the convoy tails off, he worries those figures will use their new profile to drag followers even further toward the fringes, drawing on the same network of Facebook groups and willing right-wing amplifiers.</p><p class=\"c-end-para\" id=\"dRruIo\">“The activism on the ground has probably peaked, but the movement I think is here to stay,” he said. “The organizers will continue to be active on the fringes of the Canadian right, but they are now basically minor celebrities and influencers.”</p><p id=\"VrX2O8\"><small><em>Ryan Broderick is a freelance tech writer and publishes a newsletter about web culture called </em></small><a href=\"https://www.garbageday.email/\"><small><em>Garbage Day</em></small></a><small><em>.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/B9icTMGmvZ8y2XuSuaa7ZUiFUCg=/0x500:5184x3214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23255916/1238598228.jpg",
  "description": "It’s a mess out there.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}