{
  "title": "How to sell or trade in your old Android phone",
  "url": "https://www.theverge.com/22666545/android-pixel-samsung-galaxy-sell-trade-how-to-google",
  "date": "2022-03-14T18:23:27.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Google Pixel next to Google Pixel 2\" src=\"https://cdn.vox-cdn.com/thumbor/CogPkUXbGT37svqJiHkPL4h09Iw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/69844389/pixel_pixel2_vladsavov.0.jpg\" />        <figcaption>Photo by Vlad Savov / The Verge</figcaption>    </figure>  <p id=\"YTcT3i\">There are a plethora of new and exciting smartphones that have just come onto the market (or are about to), and it wouldn’t be at all surprising to find out that you are planning to upgrade from your current phone. Samsung has introduced two new high-end phones, the <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.samsung.com/us/smartphones/galaxy-s22/buy/?modelCode=SM-S901UIDAXAA&amp;nrtv_cid=dafba75e5c27f4614fba485f6672277982a3fcf1f2525214a1090bfdc2f37f6e&amp;cid=opmc-ecomm-nrtiv-mob-042720-142014-verge-10638959&amp;utm_source=verge&amp;utm_medium=narrativ&amp;utm_campaign=10638959&amp;utm_content=mob&amp;nrtv_as_src=1\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Galaxy S22 and S22 Plus</a>, that our reviewer Allison Johnson says are <a href=\"https://www.theverge.com/22955139/samsung-galaxy-s22-plus-review\">the default Android phones to buy</a>. Meanwhile, Google is still going strong (although with occasional glitches) with <a href=\"https://www.theverge.com/22750387/google-pixel-6-pro-review\">its latest flagships</a>, the <a href=\"https://store.google.com/magazine/google_pixel_6?hl=en-US\">Pixel 6 and Pixel 6 Pro</a>.</p><p id=\"qPirAZ\">Whether you want to go with Samsung, Google, or a different manufacturer, trading in your old phone — or selling it — is a smart way to do that, especially since there are those who will decide instead to buy a lightly used phone from an older generation that will suit their needs without breaking the bank. </p><p id=\"UzeqwI\">If you’ve got an older model and are ready for an upgrade, here are a few steps to take in order to get your device ready to sell, followed by how much cash you can expect to earn back. We’re going to concentrate on Samsung and Google Pixel phones here, but you can probably expect similar results with phones from other vendors.</p><h2 id=\"oxubhS\">Inspect your phone</h2><p id=\"CXxopT\">If your old device is in good condition, you shouldn’t have much of a problem finding a new owner. As mentioned in our guide on selling your iPhone, having a phone in good condition is crucial to finding a buyer who’s willing to pay top dollar.</p><p id=\"9pUgLB\">Even if your phone isn’t in the best shape, you should still be able to get <em>something </em>for your trade. Take into consideration its blemishes, including scratches, dents, cracks, and any other quirks that the next owner should know about. Be honest, or else it will probably come back to bite you.</p>  <figure class=\"e-image\">        <img alt=\"Samsung Galaxy S9 Plus\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cy72DksdWbHnEwgc9w6d_ltmINw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10287027/jbareham_180220_2271_0118.jpg\">      <cite>Photo by James Bareham / The Verge</cite>      <figcaption><em>Samsung Galaxy S9 Plus</em></figcaption>  </figure><h2 id=\"OGt0Dv\">Erase your phone</h2><p id=\"ffByZn\">There are three steps involved in securely wiping your Android phone. These steps can vary slightly depending on whether you have a Samsung, a Pixel, or a phone from another manufacturer. </p><p id=\"ws0xuU\">First, instructions for a Samsung running Android 11:</p><ol><li id=\"XYw9xt\"><strong>Disable Factory Reset Protection.</strong> This feature prevents your phone from being wiped if it’s stolen. To disable it, all you have to do is turn off your Screen Lock. (You’ve had your Screen Lock set, right?) Navigate to “Settings” &gt; “Lock Screen\t” &gt; “Screen lock type” and select “None.”</li><li id=\"TaEHML\"><strong>Remove your account. </strong>Navigate to “Settings” &gt; “Accounts and backup” &gt; “Managed accounts” and tap on the account (or accounts, if you have more than one) that’s listed there. Then tap on “Remove account.” (Incidentally, if you haven’t backed up your phone recently, you can go to “Accounts and backup” &gt; “Backup” to get that done.) </li><li id=\"dD1Ir5\"><strong>Factory reset the phone. </strong>The next step is to factory reset the phone to completely wipe it of all your data. Back at the main settings menu, select “General management” &gt; “Reset” to take you to the final step. Select “Factory data reset.” You will get a warning page listing the data that will be erased, any accounts you’re still signed into (and you should go back and remove them), and which apps will be removed. Ready? Tap on “Reset” (you’ll be prompted to put in your Samsung account password).</li></ol><p id=\"cnZ8rV\">The instructions here are for a Pixel running Android 12:</p><ol><li id=\"CvdFUj\"><strong>Disable Factory Reset Protection.</strong> This feature prevents your phone from being wiped if it’s stolen. To disable it, all you have to do is turn off your Screen Lock. (You’ve had your Screen Lock set, right?) Navigate to “Settings” &gt; “Security” &gt; “Screen lock” and select “None.”</li><li id=\"uOXeGA\"><strong>Remove your account. </strong>Using Android 12, erasing your phone starts with navigating to “Settings” &gt; “Passwords &amp; accounts” and tapping on the account (or accounts, if you have more than one) that’s listed there. Then tap on “Remove account.” You’ll get a warning pop-up. Tap on “Remove account” again.</li><li id=\"9aIV6A\"><strong>Factory reset the phone. </strong>The next step is to factory reset the phone to completely wipe it of all your data. Back at the main settings menu, select “System.” If you haven’t backed up your phone to Google Drive recently, you can go to “Backup” and select “Back up now.” Otherwise, going into “Reset options” will take you to the final step. Select “Erase all data (factory reset).” You will get a warning page listing the data that will be erased, and if you’ve neglected to sign out of any accounts, it will be listed there (and you should go back and remove it). Otherwise, tap on “Erase all data.” </li></ol><h2 id=\"odtDGL\">Trade your phone in?</h2><p id=\"AVX9Bj\">When you trade in your phone to a manufacturer or carrier, you may be trading price for convenience. It’s up to you which you choose. </p><p id=\"1qWtJb\">At the time of publish, Samsung says it is offering up to an $850 trade-in “enhanced trade-in credit.” Interestingly, Samsung’s offers tend to be relatively generous. For example, a <a href=\"https://www.theverge.com/2018/3/8/17093588/samsung-galaxy-s9-plus-phone-review\">Galaxy S9</a> will give you a credit of $275, a <a href=\"https://www.theverge.com/2018/8/17/17703434/samsung-galaxy-note-9-review-battery-specs-price-pen-stylus\">Galaxy Note 9</a> goes up to $375, as does a <a href=\"https://www.theverge.com/2019/3/1/18245446/samsung-galaxy-s10-plus-android-phone-review-price-specs-features\">Galaxy S10 Plus</a>, while if you’re trading in a <a href=\"https://www.theverge.com/2020/2/27/21155012/samsung-galaxy-s20-ultra-review-5g-screen-camera-space-zoom-price\">Galaxy S20 Ultra</a>, you can score $825 in trade.</p><p id=\"Sfjc84\">To test Google’s trade-in for a Pixel 6, I pretended to have a <a href=\"https://www.theverge.com/2019/10/21/20923660/google-pixel-4-xl-review-camera-radar-face-unlock-90hz-display-telephoto\">Pixel 4 XL</a> with 128GB storage that was in working condition and free of cracks, and I was offered $115, while a <a href=\"https://www.theverge.com/22628205/google-pixel-5a-review-price-screen-battery-specs\">Pixel 5a </a>with 128GB brought a quote of $150. A <a href=\"https://www.theverge.com/2018/10/15/17973484/google-pixel-3-xl-review-camera-features-screen-battery-price-photos\">Pixel 3</a> with 128GB storage got me an offer of $56, and finally, an original unlocked Pixel with 32GB or 128GB was worth a big $25.01.</p><p id=\"HRrsai\">You may be able to get a good deal with a carrier as long as you read the small print. For example, as this was being written, Verizon was offering a discount of up to $1,000 on <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.verizon.com/shop/online/5g-cell-phones/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">specific new phones</a> if you trade in one of a long list of phones (and commit yourself to its 5G Unlimited plan). </p>  <figure class=\"e-image\">        <img alt=\"Google Pixel\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SKRlvf9eArN3Ol07bbdn5fMD118=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/7291315/google-pixel-phone-8829.0.jpg\">      <cite>Photo by Sean O’Kane / The Verge</cite>      <figcaption><em>Original Google Pixel</em></figcaption>  </figure><h2 id=\"MW7paS\">Sell your phone?</h2><p id=\"ZZSXwS\">As for where you can sell your old phone, <a href=\"http://swappa.com/\"><strong>Swappa</strong></a> is a top pick with a healthy community of buyers and sellers. With Swappa, you create a listing along with a price; when your device is sold, you receive payment from Swappa and then ship the phone directly to the buyer. Swappa charges a fee from the buyer, depending on the price of the phone, but you are responsible for shipping costs. </p><p id=\"sdPOfD\">Since what you can get from a site like Swappa can vary, I looked at the lowest price being asked for.</p><p id=\"51DlVZ\">First, Samsung. Someone selling a Galaxy S9 in fair condition with 64GB was asking a low price of $114; a Galaxy Note 9 rated a low price of $200; a Galaxy S10 Plus bottomed out at $206, while a Galaxy S20 5G started at $215. </p><p id=\"tTZ4VX\">Meanwhile, an original Pixel XL with 32GB of storage brought a low asking price of $76, while an unlocked Pixel 2 with 64GB rated a low price of $52; the 2 XL version was quoted with a low price of $62. An unlocked Pixel 3 with 64GB in good condition had a low price of $71; the 3 XL version in good condition brought a low selling price of $73. Finally, you could score a Pixel 4 XL in fair condition with 64GB for $160.</p><p id=\"EE4Ox7\">There are, of course, other sites where you can sell your phones. </p><p id=\"ofjsLE\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.decluttr.com%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22666545%2Fandroid-pixel-samsung-galaxy-sell-trade-how-to-google\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Decluttr</strong></a> buys the phone from you and then resells it. The company gives you a price online; you then ship your phone to Decluttr within 28 days. The phone will be inspected; if there are issues, you will be offered a revised price which you will have 14 days to accept or decline. </p><p id=\"4xczo9\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.gazelle.com%2Ftrade-in&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22666545%2Fandroid-pixel-samsung-galaxy-sell-trade-how-to-google\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Gazelle</strong></a> works in much the same way: the company gives you a price online, and you then ship your phone to Gazelle within 30 days. The phone will be inspected; if there are issues, you will be offered a revised price. </p><p id=\"C6JQzg\"><a href=\"https://bestbuy.7tiv.net/c/482924/614286/10014?u=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fservices%2Fbest-buy-trade-in%2Fpcmcat133600050011.c&amp;sharedid=theverge.com\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Best Buy</strong></a> lets you either mail in your phone or bring it to your nearest Best Buy retail store; either way, you can trade it in for an e-gift card. </p><p id=\"5F5SmE\"><a href=\"https://flipsy.com/\"><strong>Flipsy</strong></a> deals with a variety of retail sites; it will let you know what vendors offer how much, and then you get 14 days to ship the device. The vendor pays for shipping. If the vendor doesn’t agree with your assessment, they will send a revised offer; since each vendor has its own return policies, it’s a good idea to check before you ship. </p><p id=\"e3Gx6n\">And, of course, there’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fpages.ebay.com%2Fseller-center%2Findex.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22666545%2Fandroid-pixel-samsung-galaxy-sell-trade-how-to-google\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>eBay</strong></a><strong>.</strong> Selling here can be a bit complicated, but basically, you get up to 250 listings for free each month; once you sell your item, there is a 12.9 percent fee for items up to a final value fee of $7,500 plus a $0.35 transaction fee. </p><p id=\"ktxNwU\">Other places where you can sell your phone free of charge (except, of course, for shipping fees) include <a href=\"https://www.facebook.com/marketplace/selling/\"><strong>Facebook Marketplace</strong></a> and <a href=\"https://craigslist.org/\"><strong>Craigslist</strong></a>. </p><p id=\"Tb6JxY\">Whether you use one of the resources listed here to make up the cost of a new Google Pixel 6 or decide that the convenience of trading in the phone is worth the extra bucks is up to you.</p><p id=\"Qhd5sS\"><em><strong>Update March 14th, 2022, 2:24PM ET:</strong></em><em> This article was originally published on September 11th, 2021, and has been updated to reflect changes in prices and phone models.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/c9qOwItyqsM5RzSLrZUI1wpDkfs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9493625/pixel_pixel2_vladsavov.jpg",
  "description": "Here are the best options to get the most cash back.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}