{
  "title": "How to learn a language online",
  "url": "https://www.theverge.com/22933094/language-learn-online-apps-duolingo-pimsleur-rosetta-stone-hellotalk",
  "date": "2022-02-15T19:36:49.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/r44xtEkhuxGAxNVMQvnXKbhTJ9k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70513305/acastro_20200723_1777_duolingo_0001.0.jpg\" />        <figcaption><em>The owl is cute, though.</em> | Illustration by Alex Castro/The Verge</figcaption>    </figure>  <p id=\"cVp6ud\">Last year, I decided to start learning Korean. It was entirely on a whim — I don’t live in Korea and have no reason I’d ever need to go there. Nonetheless, it’s been an incredibly rewarding experience, and I’ve gotten to a point where I can speak, read, and write comfortably much faster than I ever thought I could. </p><p id=\"FZ53Q9\">That’s entirely due to the wealth of apps and online services out there that I’ve been able to take advantage of. Without easy access to native speakers or in-person classes, much of my early journey involved scouring the internet for resources and trying every one I could find. Here, I’m going to briefly discuss my experience with each one and whether I’d recommend it for its price. </p><p id=\"XethCJ\">It’s important that I make a few caveats here:</p><ul><li id=\"QkywhU\">While I am a language nerd, I am in no way a language expert. While this article is meant to reflect my own experience with these products, it’s one data point. What’s effective or ineffective for you could certainly differ. </li><li id=\"CsSE5A\">The quality of any product will often vary by the language you’re using it for. I’ve used many of these services for multiple languages (like I said, I’m a language nerd) and will draw from those experiences here, but the best way to figure out if an app will work for you (as is the case with many products, in general) is to try it out yourself. </li><li id=\"uAgskk\">This article is tailored to native English speakers (because I am one). If you speak another language fluently, make sure you’re looking into additional options for speakers of that language. </li><li id=\"EBwc8I\">In addition to these resources, you should make sure you’re looking into resources specific to the language you’ve chosen. Reddit can be a good place to find these — many languages have specific subreddits where learners can share what they’ve been using.</li></ul><p id=\"LEAuU0\">One last thing before we dive in. My primary advice for online language learners like myself is to avoid going all-in on one resource (at least, at the start). Not only has using multiple apps at a time helped to reinforce the things I’m learning, but it’s also given me a broader picture than I’d otherwise have. Most languages will have multiple ways to say common phrases (i.e., in English, you might say “Hey,” “Hi,” “Hello,” etc.), and different courses might teach different ones. Different resources may also skim over concepts that others explain in more detail. I recommend that you diversify your learning portfolio, at least until you’ve found one option that you’re confident is comprehensive and works for you. </p><p id=\"0ho1Tb\">With that, here are some apps I’ve tried.</p><h2 id=\"wHUfDh\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.pimsleur.com%2Flearn-french%2Fsubscription-all-access&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22933094%2Flanguage-learn-online-apps-duolingo-pimsleur-rosetta-stone-hellotalk\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Pimsleur</a></h2><p id=\"25neRc\"><em><strong>Price:</strong></em><em> $20.95 per month.</em></p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Pimsleur app playing a lesson.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UaKvp3gGrXBc99-e7XmkpxltG6s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243664/273487125_1034275727435173_5113970662317343568_n.jpg\">      <figcaption><em>This is an audio lesson.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Quick Match exercise in the Pimsleur app. The English phrase reads “There are four hundred fifty kilometers” with four Hangul options below.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hT30ce7RHdW584jN0GlLLKA5AYY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243666/273533316_630502224848896_6974758667013521355_n.jpg\">      <figcaption><em>This is one of the few exercises where you can turn off the romanizations.</em></figcaption>  </figure></div></div></div><p id=\"cLX9Hx\">Pimsleur is an almost entirely audio-based course. Every day (well, you can do it how often you want, but daily is the recommended pace), you play through a 30-minute audio track. The track puts you in various roles — a tourist asking for directions, a customer ordering beer at a restaurant, a shopper haggling over a price, a worker scheduling a lunch with a colleague — and essentially has you play that role in a simulated conversation. Your fictional conversation partner speaks to you in the target language, you’ll respond in that language, and then a native speaker will say the correct answer, which you’ll repeat a couple times after them. The (English-speaking) narrator will sprinkle in new words and phrases for you to learn every so often, which you’ll also repeat a number of times. As you learn more phrases, the simulated conversations gradually grow more advanced. </p><p id=\"74iqI3\">When it comes to pronunciation, Pimsleur is hands-down the best resource I’ve ever tried. I’m often complimented on my accent in languages I’m working on, and Pimsleur is 100 percent of the reason why. The app forces you to repeat words and phrases immediately after a native speaker over and over. While this can be boring, it’s invaluable in terms of perfecting your pronunciation. </p><p id=\"5DHCeC\">Pimsleur is also a very pragmatic option if you’re trying to learn survival phrases for an upcoming trip. The first phrases Pimsleur teaches you are common tourist phrases (“Do you speak English?” “Excuse me,” “How much does this cost?” etc.). It also teaches you a lot of words very quickly. A majority of Korean words I currently know, I learned from Pimsleur.</p><p id=\"EVZU9c\">Pimsleur has a major hole, though — reading and writing. The app has some supplemental reading exercises (there are flashcards, short quizzes, and a few games), but they’re fairly bare-bones. The Korean course also uses romanizations in some of its games, rather than <a href=\"https://www.britannica.com/topic/Hangul-Korean-alphabet\">Hangul</a>, while pretty much any other Korean resource gets you away from romanizations as quickly as possible. While this is a Korean-specific problem, it emphasizes that even Pimsleur’s written resources are more focused on speaking than they are on actual reading and writing. Pimsleur’s real strength is as an audio tool — if you’d also like to learn to read and write, you should supplement it with something else.</p><p id=\"dWRT59\">Pimsleur is also a bit more of a time commitment than other resources you might find. It asks for 30 minutes a day, and that’s without the flashcards and other bells and whistles you’ll find in the app. It can be a nice commute companion (and there’s a special screen for use while driving), but that’s about as much multitasking as my brain can handle. I know people who will put Pimsleur on while they’re cooking or cleaning, but that’s never worked for me personally — I find myself forgetting things unless I’m able to devote 30 minutes to Pimsleur entirely.</p><p id=\"pdwueN\">The final problem here is that Pimsleur is pricey. If it’s out of your budget, that’s totally fair — you can still have a great language-learning experience with the more affordable resources mentioned here. I will say, though, that if you have the money to pay for one resource and you have the time to set aside, I would strongly recommend that you pay for this one. While other resources will spend more time on grammatical rules and complex mechanics, there’s nothing else I’ve found that teaches so much usable material so quickly. Of the various pricey apps I tried at the start of my journey, this is the one I’m still paying for.</p><h2 id=\"IFgQCP\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.rosettastone.com%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22933094%2Flanguage-learn-online-apps-duolingo-pimsleur-rosetta-stone-hellotalk\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Rosetta Stone</a></h2><p id=\"iy6dKI\"><em><strong>Price: </strong></em><em>$11.99 per month or $299 for a lifetime membership</em>.</p>  <figure class=\"e-image\">        <img alt=\"A screenshot of the Rosetta Stone mobile app displaying a Hangul word with photographs of a car, two pens, and three bicycles below.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_eKMSFABz0CV4jjmoI6xe5xdrI8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23241870/272869382_643955453534816_2200059326781989672_n.jpg\">      <figcaption><em>Here’s Rosetta Stone.</em></figcaption>  </figure><p id=\"OegLMJ\">The nice thing about Rosetta Stone is that it doesn’t use any English. It shows you pictures, describes them in your target language, and then has you practice doing the same, cutting out the translation middleman. The course incorporates speaking, writing, listening comprehension, grammar, and vocabulary. The elements have their own separate lessons, and there are also cumulative lessons that incorporate all of them. The lessons vary in length — some take less than five minutes, while others can be close to the 30-minute mark.</p><p id=\"xXimxa\">Of the resources described here, I would say Rosetta Stone’s content is the most similar to what you might learn in, say, a high school language class. It starts by teaching you basic vocabulary that you’d imagine kids might learn (“cat,” “dog,” “tree,” etc.) and basic descriptive grammatical constructs (“the boy drinks milk,” “the woman drives a car,” etc.) rather than the conversational phrases you start with in Pimsleur. It’s also more focused on hammering precise grammatical rules. Pimsleur will tell you things like, “This sentence should technically have an object marker, but it’s fine for you to omit it,” where you’ll never hear that from Rosetta Stone.</p><p id=\"f6DUNF\">I actually think that, due to their very different approaches, Pimsleur and Rosetta Stone complement each other really well. But they are the two most expensive courses here, and I recognize that many folks won’t want to pay for both. If you’re deciding between the two as your primary course, I would go for Pimsleur if you’re learning for a trip, if you’re actually hoping to converse with native speakers of your target language, or if you just want to see very immediate results. I’d go for Rosetta Stone if you’re looking for a really comprehensive long-term foundation or if you want to practice reading and writing.</p><h2 id=\"wwRFhS\"><a href=\"https://www.duolingo.com/plus\">Duolingo</a></h2><p id=\"6jnYeq\"><em><strong>Price:</strong></em><em> Free. The ad-free tier is $6.99.</em></p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Duolingo app displaying the word Friend with five Hangul options below.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Tsc08_xBn3Reo_mJsgbMHvbW10c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243681/273198430_442806314237695_1341007925078698459_n.jpg\">      <figcaption><em>Here’s Duolingo.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Duolingo app displaying a Hangul word with the options I, Korean, a, the, newspaper, and message below.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mTq4FL_ALzhmu2-FvR6Kh94RgLE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243682/273000602_487192339630657_5866265114044402322_n.jpg\">      <figcaption><em>I used a free trial of Duolingo Plus to jump forward, like, seven levels to get out of Hangul-learning mode.</em></figcaption>  </figure></div></div></div><p id=\"213K3L\">Duolingo reinforces basic grammar and vocabulary through bite-sized lessons (they take me about two minutes on average) with a fun and colorful interface. You’ll learn or practice a few words per lesson; you’ll read them, write them, and say them.</p><p id=\"xJn8ej\">Duolingo’s usefulness varies highly by language. I recommend reading reviews, checking out your language’s subreddit, or speaking to other learners you know to find out whether it’s a good choice for your target tongue — <em>especially</em> if you’re considering paying for it.</p><p id=\"KEBcyF\">For example, I found Duolingo very effective for Danish, which I used it for a while back, and Mandarin, which I played around with more recently. In both languages, it started with useful words (“Hello,” “Thank you,” etc.), and the words stuck. I was surprised at how many Chinese characters I picked up in a brief time period. The app is not great for Korean, however. It’s been mostly teaching me to read basic Hangul, one letter at a time, for months now — most Korean learners I know needed at most a couple days to get Hangul down. And the vocabulary it’s starting with is somewhat bizarre; it’s been hammering home “ant” and “seed” for a while now. </p><p id=\"3brHrt\">Still, since Duolingo is free, my general attitude is: “Why not?” While it may not be the most helpful or comprehensive resource, the nice thing about it is that you can whip it out at any time. Waiting for the subway, do some Duolingo. Waiting at a crosswalk, do some Duolingo. If nothing else, it’s a good way to keep your mind on your target language throughout the day and sneak in some practice where you can. But I wouldn’t use it on its own.</p><h2 id=\"AJMMRU\">Zoom classes</h2><p id=\"mpCG7P\"><em><strong>Price: </strong></em><em>Varies.</em></p><p id=\"nwqxGb\">Zoom classes can be a great way to learn a language online, especially as a beginner. The massive benefit I’ve found from taking them isn’t in the lectures so much as the practice opportunities. Many language learners will tell you that conversing with native speakers is an essential part of learning your target language. But as a beginner, that can be an incredibly intimidating prospect — you may understandably be afraid to enter a conversation with a native speaker where you may make all kinds of mistakes and look silly.</p><p id=\"ntR6AJ\">That’s what I think is great about Zoom classes: they offer you an environment where you can chat with a fluent speaker (the instructor), and being riddled with mistakes isn’t only acceptable but expected. The practice is really valuable. Conversing with a teacher in a classroom replicates some of the pressure of a real-world situation (compared to, say, talking to Pimsleur’s imaginary people) but allows you to make mistakes with no consequence. It also gives you many opportunities to practice asking real people questions like “Hello, what’s your name?” many, many times without looking weird. </p><p id=\"lgfH2J\">Many teachers also make themselves available for general questions during the duration of their course. This can be useful because if you’re pairing a Zoom class with another resource that doesn’t explain a ton (like Pimsleur or Rosetta Stone), your teacher can be a resource for questions those might bring up. For example, Pimsleur taught me two different words for “and” in its first few lessons — I emailed my Zoom teacher to ask what the difference was. And a human teacher, particularly if they’re a native speaker, can likely provide more up-to-date context than apps can provide. I’ve often had Zoom teachers say things like, “My parents pronounced this word this way, but my generation pronounces it this way, and younger people pronounce it this way.” That’s more detail than Pimsleur will ever get into.</p><p id=\"8ayouv\">That said, as I’m sure many current college students can tell you, Zoom classes really are what you put into them. You can get quite a bit out of them, but it’s also pretty easy to just leave them running while you go off and do something else. </p><p id=\"qzGRRj\">For that reason, unless you’re very confident in your concentration, I recommend making sure the class you sign up for has homework assignments and assessments. While you may effectively learn grammar from a Zoom lecture, vocabulary is harder to learn that way. The bulk of my vocabulary learning from the Zoom class I took came from studying it before the final exam. </p><p id=\"jD36av\">And if you really want to learn a lot quickly, doing a bit of Pimsleur and Rosetta Stone every day is likely going to teach you more (and is certainly more cost-effective) than attending a Zoom lecture once a week. The primary reason to pay for a Zoom class, in my opinion, is access to the teacher and the extra accountability for studying that assessments might provide.</p><p id=\"8nqSP3\">If you decide to take a Zoom class, put some thought into whether you want to study with a native speaker or a non-native speaker. They have pros and cons. A native speaker, as I mentioned above, can provide unique cultural context and valuable insight into how the language is really spoken. But a non-native speaker (who’s had the experience of learning your target language as you are) will likely have a better understanding of what an English speaker might struggle with and where they should focus their time. Ultimately, it’ll come down to your learning goals.</p><h2 id=\"Yrc2ek\"><a href=\"https://www.hellotalk.com/?lang=en\">HelloTalk</a></h2><p id=\"0efshT\"><em><strong>Price:</strong></em><em> Free. The VIP tier (which unlocks multiple languages, unlimited translations, and some other features) is $6.67 per month or $149.99 for a lifetime membership</em>.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the HelloTalk app listing a number of potential language partners.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_G-6Zf5w9Pwfa4HEbp2WgfFJGSY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23241876/272764253_1934766413376995_1914117723449865020_n.jpg\">      <figcaption><em>You can find language partners on HelloTalk.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of a conversation in the HelloTalk app. A menu hovers above one selected message including options for Translate, Correction, Speak, Transliteration, AI Grammar, Reply, Copy, Favorite, and More.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YoThxxR94K-Sa3Be0FKEwqLQkpE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243709/273521759_521369955959845_8454481921524543282_n.jpg\">      <figcaption><em>Names and pictures have been blurred.</em></figcaption>  </figure></div></div></div><p id=\"E08O5y\">HelloTalk isn’t primarily a study tool, but I do think it’s great for language learning. It’s an app that pairs up people who are learning each other’s native languages and helps them chat with each other — so it would pair me, an English speaker who’s learning Korean, with a Korean speaker who’s learning English. </p><p id=\"SaLq1F\">The chat interface includes some useful tools. In particular, the Correction feature allows you to easily red-pen each other’s messages in real time. There’s also a tool that allows you to translate a message to your language with a single tap, though you can only do this a few times a day with the free version.</p><p id=\"GiCzLc\">You won’t want to use HelloTalk right away — I think it’s most useful when you’re confident you can get through a basic introductory conversation without needing anything translated. Once I got to that level, I found this app a lot of fun. It’s good practice, and I’ve made real friends who are also willing to answer questions when I have them. That said, make sure you’re prepared to help your partners out with English as well — it’s a two-way street.</p><h2 id=\"17ByiL\"><a href=\"https://quizlet.com/upgrade?source=footer\">Quizlet</a></h2><p id=\"jsTnmF\"><em><strong>Price:</strong></em><em> Free. The Plus tier (which unlocks some extra study features) is $35.99 per year.</em></p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Quizlet app displaying the word “to rest” with four Hangul options below.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/G4yfXL9bs9dPAl6BmCNytf-2QNI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243714/259713093_248056410862658_5814580478980102777_n.jpg\">      <figcaption><em>This is “Learn” mode in the Quizlet app.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Quizlet app displaying the word “More”. Below is a text box with the instructions “Type the Answer” and a “Don’t know” button.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_tSHhgabmcYcjQDzJg-SOfpUc-g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243715/271666673_1068440663732343_2258962601967227897_n.jpg\">      <figcaption><em>This is “Write” mode.</em></figcaption>  </figure></div></div></div><p id=\"DKewHp\">Quizlet isn’t a language course, but it’s the best app I’ve found for learning flashcards. Specifically, if you need to brute-force yourself into learning a ton of vocab in a short period of time, Quizlet is the one to use. It offers various different ways to learn and practice the decks you create — there’s a “Learn” mode that works you through your set a few words at a time, there’s a mode where you practice dictation, there are some fun games where you can compete with other users, etc. I used Quizlet obsessively in high school and college, and I still haven’t found a free service that works as well for me. </p><h2 id=\"BmAEIc\"><a href=\"https://apps.ankiweb.net/\">Anki</a></h2><p id=\"LEoHuL\"><em><strong>Price:</strong></em><em> The Android, web, and desktop versions are free. The iOS version is $24.99. </em></p>  <figure class=\"e-image\">        <img alt=\"Anki has a clunky interface that really mirrors physical flashcards.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1jdbEjCCxSJn8q_4mmi3zO_Qvjw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243455/Screen_Shot_2022_02_15_at_10.12.28_AM.png\">      <figcaption><em>Anki’s interface really mirrors physical flashcards.</em></figcaption>  </figure><p id=\"YM1RzU\">I tried this but did not end up paying for it. I generally study on my iPhone (that’s where I have a Hangul keyboard set up), and I prefer not to pay $25 when I can use Quizlet for free. It has a somewhat clunky interface that really mirrors physical flashcards in its functionality — there aren’t as many fun and interesting variations as you’ll find on Quizlet. But many language learners swear by it. </p><p id=\"Lf9asU\">Anki’s specialty is spaced repetition; that is, after you create a deck, Anki shows you a certain number of cards every day and will show you a card less frequently the more often you get it right. It aims to make you practice a term right before you’re about to forget it. It’s less beneficial for quick acquisition (where Quizlet shines) and more beneficial for helping you hold onto words over time. </p><h2 id=\"v5H0LD\"><a href=\"https://app.memrise.com/premium/\">Memrise</a></h2><p id=\"LVvoCa\"><em><strong>Price:</strong></em><em> $8.99 per month, $44.99 per year, or $139.99 for a lifetime membership. </em></p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Memrise app displaying the word Chong (Gun) with Hangul options below.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CFBqToqGPtuf7Xgot1kuZhG84vk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243721/272784659_736298680688608_489930471780643415_n.jpg\">      <figcaption><em>Early Memrise also includes spelling.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A screenshot of the Memrise app with a Hangul prompt, translated as Let’s Do it! And a microphone button with the instructions “Tap to record yourself” and a button to “Skip this phrase”.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kor37R1_u9RHOLdKN_EwkL4WJJk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243723/272727807_954601758778760_7344619782852332130_n.jpg\">      <figcaption><em>You can slow the speaking down.</em></figcaption>  </figure></div></div></div><p id=\"SgfvIZ\">This is another iOS app I free-trialed but did not end up paying for. It’s very vocabulary-focused, offering both curated decks and user-created decks. It shows you video and audio clips of native speakers saying words or short phrases, tasks you with translating those words and short phrases into English, and does so on a similar spaced repetition schedule to Anki — get a word consistently right, and it shows up less frequently. There’s a writing component as well. </p><p id=\"Fxn7O9\">But the flashcard format still seems mostly useful for growing vocabulary and less useful for grammatical structures and being able to converse and create sentences. Memrise is close in price to Rosetta Stone, which effectively combines those things with vocabulary-building. If you’re shopping around this price point, I’d just go for Rosetta Stone. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uubkyHXntMbItLEumzkgEB56yiU=/0x86:2040x1154/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20533796/acastro_20200723_1777_duolingo_0001.jpg",
  "description": "Here’s which apps are worth your money.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}