{
  "title": "How to upgrade your Nintendo Switch storage and migrate your games ",
  "url": "https://www.theverge.com/22960596/upgrade-nintendo-switch-oled-storage-saves-games-transfer-microsd-card",
  "date": "2022-03-04T19:47:00.000Z",
  "author": "Stefan Etienne",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/dI4uzfUICKuBzLNwe9V03SdrQeo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70580279/jbareham_190301_3267_0016.0.jpg\" />    </figure>  <p id=\"OXh7Tx\">The Nintendo Switch only comes with 32GB of internal storage, which is minuscule if you plan on having more than just a handful of games and apps downloaded to your handheld console. The solution is to use a microSD card to expand the Switch’s storage. But what’s the easiest way to do that? And if you already have a microSD card and want to use a new one with more capacity, how do you migrate your files? Don’t worry; we’ll walk you through it all. </p><p id=\"lwGPei\">Before you begin, it’s always a good idea to back up your games to a desktop computer using a microSD card. Of course, any title downloaded from the Nintendo eShop (they’re tied to your account) can be archived and downloaded again directly, if needed. But it takes a lot longer to download your whole library; having a local copy will save time. </p><p id=\"1cpVHL\">Game saves (like your completed run of <em>The Master Trials</em> in <em>Breath of the Wild) </em>are saved locally to the Switch’s internal memory. As long as you archive and don’t delete game data on the Switch, you won’t lose your valuable saved data. </p><aside id=\"a6xkvo\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The Nintendo Switch changed what I want from video games\",\"url\":\"https://www.theverge.com/2022/3/3/22958526/nintendo-switch-five-year-anniversary-console-gaming\"}]}'></div></aside><p id=\"fFqxUc\">To get started, you’ll need: a computer (the OS doesn’t matter as long as you have storage space), a microSD card adapter (if your computer doesn’t have a microSD slot), and finally, a microSD card. Nintendo recommends using a single microSD card that’s <a href=\"https://www.sdcard.org/developers/sd-standard-overview/bus-speed-default-speed-high-speed-uhs-sd-express/\">UHS-I (Ultra High Speed Phase I)</a> compliant, with transfer speeds of 60 to 95 MB/s; the higher, the better. Don’t use multiple microSD cards with different games on the same Switch because that can cause conflicts. </p><p id=\"TmgMCU\">The setup process should be performed in handheld mode (i.e., not docked) alongside your computer since you will require access to the storage slot underneath the kickstand. This process is the same regardless of whether you’re performing this with the original Nintendo Switch or the newer OLED model. The more portable Switch Lite, unfortunately, lacks a microSD card slot and is limited to its stock 32GB of memory. </p><div id=\"hELY8m\"><div data-anthem-component=\"gallery:5997480\"></div></div><h2 id=\"FYuR02\">Move your games from the Switch to a microSD card</h2><p id=\"Edcq1x\">If you don’t have a microSD card already installed and your Switch’s internal memory is full, here’s how you can migrate the data to a microSD card. To test this, I moved <em>Super Smash Bros. Ultimate </em>from local storage to a <a href=\"https://www.amazon.com/SanDisk-MicroSDXC-Nintendo-Switch-SDSQXAO-128G-GNCZN/dp/B07KXQX3S3?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">128GB microSD SanDisk microSDXC UHS-I card</a> for Nintendo Switch. </p><ul><li id=\"MZkg41\">Turn off your Switch by holding down the power button, scrolling down to Power Options, and then selecting Turn Off. </li><li id=\"RKoKjM\">Turn the handheld over, then lift the kickstand next to the right Joy-Con controller. Underneath the plastic stand, you’ll find a microSD card slot. </li><li id=\"yp1qo5\">Insert your new microSD card into the slot. You should hear a slight click once it’s securely docked. </li><li id=\"O0JjqV\">Power on your Nintendo Switch. Navigate to the System Settings gear icon on the bottom right and press the “A”  button (or double-tap with your finger).</li><li id=\"O7r7ck\">Scroll down (using the touchscreen or Joy-Con controller) to select Data Management. Your cursor will transition to the storage management screen.</li><li id=\"hwAHw8\">Navigate to and select Manage Software, right beneath Quick Archive. </li><li id=\"J2mH00\">From here, you can peruse the list and figure out which games / apps are stored locally and which are stored on the microSD card. There is no straightforward transfer tool between the Switch’s internal storage and the microSD card, so you have to archive your game(s) first — one game at a time. </li><li id=\"nYOfdp\">Once you’ve decided which game(s) you want to migrate, highlight and select the first one from the list.</li><li id=\"ooUjVd\">From the game data information screen, scroll down to Archive Software and select it. A confirmation pop-up should appear warning that the game data will be archived; however, your saved data and game icon will remain on the Switch’s home screen. Confirm your selection by hitting Archive. </li><li id=\"jzEO3c\">There’s an alternative method for game archiving: Instead, highlight the game in question on your home screen, hit the “+” button on the right Joy-Con, scroll down to Manage Software, then select Archive Software. Finally, confirm your selection by hitting Archive from within the pop-up. </li><li id=\"NO0GsV\">Either way, now press the Home button on the right Joy-Con to go to the home screen. From there, navigate to the game icon that you just archived. Hit the “A” button so that a confirmation pop-up appears. Confirm it by pressing Download, then wait for the download to finish. </li><li id=\"Hptwle\">Press the Home button again for the home screen, then navigate to the System Settings page like you did earlier. Head down to Data Management, then navigate to the game that you just downloaded. You should see the storage amount immediately next to the microSD card icon, right underneath the game / app title. </li><li id=\"jBE4wK\">Repeat as necessary for each game that you want to download straight to the microSD card. Future purchases and downloads will correctly route to the microSD card instead of the internal storage. </li></ul><div id=\"gsypYG\"><div data-anthem-component=\"gallery:5997483\"></div></div><h2 id=\"02UoyP\">Move games on your existing microSD card to another one</h2><p id=\"QMHma9\">If you already have a microSD card installed and want to swap it for, say, a faster or larger card, then you’ll need a computer (with a microSD slot or adapter) to back up your files.</p><ul><li id=\"SHWxBD\">Turn off your Nintendo Switch by holding the power button, selecting Power Options, and then selecting Turn Off. Eject your old microSD card (located underneath the kickstand on the right-hand side) by gently pressing down on it; it should pop out easily. </li><li id=\"qEXDGT\">Insert the microSD card into your computer’s slot or into an adapter connected to your system. (If you don’t already have an adapter, you can try something like the <a href=\"https://www.amazon.com/SanDisk-MobileMate-microSD-Card-Reader/dp/B07G5JV2B5?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">SanDisk MobileMate USB 3.0 PCard Reader</a> because it also doubles as an SD card adapter). Once the microSD card is recognized, head to File Explorer on Windows or Finder on a Mac. You should see the mounted USB device as a form of external storage (its name depends on your hardware). Within the drive, there should be a folder named Nintendo. Your precious files are inside! </li><li id=\"g4txXB\">Highlight the “Nintendo” folder, then drag and drop it to your desktop. Once it’s highlighted, you can also hit the Ctrl + C keys on Windows or the cmd + C keys on a Mac to copy the folder. To paste it to your desktop, press Ctrl + V on Windows or cmd + V on a Mac. Wait for the folder to transfer to your computer — since it contains several folders and files, it’s usually more than a few gigabytes in size. </li><li id=\"3FZcha\">Now that all your game files are backed up to your computer, you can remove the microSD card from the slot (or the adapter). </li><li id=\"rDI1SH\">Swap your old microSD card for the new one, inserting it into your computer’s slot or the adapter. Head to your File Explorer or Finder and navigate to the mounted storage device. Since the new card is empty, you naturally won’t see any folders or files.</li><li id=\"vY8jwf\">Copy the “Nintendo” folder you saved to your desktop, transferring them over to the new microSD card as is (don’t change any file names or folders). You can drag and drop or use the copy / paste function. </li><li id=\"cSI61q\">Wait for the transfer to finish. Remove the adapter from your computer’s port or the microSD card from the slot. </li><li id=\"019Wo1\">Insert your new microSD card into the powered-off Switch’s card slot. </li><li id=\"DBT0Y7\">Turn on your Switch. Navigate to System Settings &gt; Data Management &gt; Manage Software one more time. Scroll through the list, making sure that your games were successfully migrated to the microSD card. </li><li id=\"lHCyjP\">You can also clearly tell the files are on the card by glancing at the Free Space indicator on the right-hand side, underneath System Memory.</li></ul><p id=\"e7eWV6\">In the event that your files didn’t successfully transfer to the new microSD card or aren’t recognized by the Switch, you can always delete the transferred files from the card using your computer’s file manager. You’ll have to re-download the games / apps from the Nintendo eShop, using the Nintendo account they’re associated with. If they don’t automatically save to your microSD card, use the archive and download trick we described earlier. </p><p id=\"HtQzhV\">There you have it! You’ve successfully migrated your Switch files from one microSD card to another and / or added a microSD to expand your game library.</p><p id=\"CBbDNp\"> <em><strong>Update March 4th</strong></em><em><strong>: </strong></em><em>This article was originally published on March 8th, 2019, and was updated to explain that the process is the same for the Nintendo Switch OLED and that the storage for the Nintendo Switch Lite can’t be upgraded.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WOt0N9q6bsfwVvZcF1qJv0zF6MM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15861438/jbareham_190301_3267_0016.jpg",
  "description": "Free up some real estate on your Switch",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}