{
  "title": "How to monitor and limit your data usage on an Android phone",
  "url": "https://www.theverge.com/22991599/data-usage-android-google-phone-how-to",
  "date": "2022-03-23T18:38:59.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/esPPi56O7-hvhP1XT8kVN5rocNo=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70662804/VRG_photo_Android_12_HowTo.5.jpg\" />        <figcaption>Photo by The Verge</figcaption>    </figure>  <p id=\"vBkuiD\">Although many data plans these days are <a href=\"https://www.theverge.com/2019/8/2/20750716/verizon-unlimited-plans-new-four-5-price-cut-get-more-start-do-play-5g-data\">advertised as “unlimited,”</a> most actually have a cut-off point when your data stream is going to slow radically. If you don’t want to pay the premium prices that “unlimited” plans demand, then it’s even more important that you avoid going beyond your maximum data allowance, or there will be high penalties to pay. Either way, it’s smart to monitor your data flow — not only to make sure you don’t pass your limits but also to find out if you need to rethink your current data plan.</p><p id=\"zjK1NB\">It’s not hard to do this using tools baked into current versions of Android or a third-party app. Here are a few strategies that you can try. (Note: these directions are for a Pixel 6 running Android 12. The interface of your phone may vary somewhat, depending on the manufacturer, model, and OS version.)</p><h2 id=\"OFcDy3\">Set a data limit</h2><p id=\"nsIOhI\">You can have your phone issue a warning if you’re nearing your data limit before the end of your monthly billing cycle. You can even set a limit beyond which your phone won’t use any data. </p><ul><li id=\"1YSUMc\">Go to <strong>Settings</strong></li><li id=\"uyNLXi\">Go to <strong>Network &amp; internet</strong> &gt; <strong>Internet</strong> and tap on the gear icon next to your carrier’s name</li><li id=\"S8Cnkb\">You’ll see the amount of data you’ve used so far in your current payment cycle on top. Scroll down to and select <strong>Data warning &amp; limit</strong>.</li><li id=\"ZVfkNd\">Tap on <strong>Mobile data usage cycle</strong>. This will let you set the day that your account starts its monthly cycle. Your current cycle is probably set to sync with your carrier’s, but if you want to change it, go ahead and then tape on <strong>Set</strong>.</li><li id=\"p83NQ8\">Toggle <strong>Set data warning</strong> on. You can then enter the data limit — say, 4GB — that you want for your phone.</li></ul><div id=\"G7s8rq\"><div data-anthem-component=\"gallery:8806705\"></div></div><p id=\"uO3CMb\">On the same page, you can toggle <strong>Set data limit</strong> on. This will turn off your mobile data completely when it hits whatever limit you set. </p><h2 id=\"AqRN26\">Use Data Saver mode</h2><p id=\"VkJiED\">Unless you have a much older version of Android (earlier than 8.0), your phone should come equipped with Data Saver mode, which kicks in when you’re not on Wi-Fi and ensures that apps and services that are not being actively used won’t be able to stream data in the background. It can slow things down a bit, but if you’re worried about passing your data limit for the month, it can come in handy. </p><p id=\"SDUY5P\">It’s very easy to turn Data Saver mode on and off.</p><ul><li id=\"sJTMJ9\">Go to <strong>Settings</strong> &gt; <strong>Network &amp; internet</strong> &gt; <strong>Data Saver </strong></li><li id=\"okTRMS\">Toggle <strong>Use Data Saver</strong> on</li></ul><p id=\"e4WLpE\">There may be specific apps that you want to allow to use background data, even when Data Saver mode is on. For example, you may want to get Twitter notifications no matter where you are.</p><ul><li id=\"9tnSzh\">On the <strong>Internet</strong> page, tap on <strong>Unrestricted data</strong></li><li id=\"qSQTlN\">Scroll down to any apps that you want to enable for background data use even when Data Saver mode is on. Toggle them on.</li></ul><div id=\"cI5K8L\"><div data-anthem-component=\"gallery:8806743\"></div></div><h2 id=\"gfT0nA\">Limit data usage on specific apps</h2><p id=\"TLJ6NQ\">Data Saver mode is useful but can also be an irritation if it limits apps too much. Instead of turning it on and specifying which apps should not be limited, you can decide which apps are using the most data and just limit those.</p><p id=\"buegVP\">Again, these directions work for a Pixel 6 running Android 12; your mileage may vary depending on your specific mobile device.</p><ul><li id=\"z1M0V3\">Go to <strong>Settings</strong> &gt; <strong>Network &amp; internet</strong> &gt; <strong>Internet</strong></li><li id=\"HXGsVN\">Scroll down to and select <strong>Non-carrier data usage</strong></li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Non-carrier data usage gives you a list of data-hungry apps.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Vowa4A5G57eQcovJjbkNo3jQ73w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339473/Screenshot_20220323_101639.jpg\">      <figcaption><em>Non-carrier data usage gives you a list of data-hungry apps.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Select specific apps to find out details and disable its use of background data.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GCX19x1uJNUi9URWGLh2kCJkWr0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339471/Screenshot_20220323_101703.jpg\">      <figcaption><em>Select specific apps to find out details and disable its use of background data.</em></figcaption>  </figure></div></div></div><p id=\"2YIhM2\">You’ll get a list of all the apps that are have used data over the last month and how much they have used. (You can change the period of time to look at by tapping on the time range at the top of the page.) </p><p id=\"mc62e7\">To see if an app is using background data, tap on the specific app. You’ll get details on how much data the app has used; you can also turn the use of background data on or off and decide whether it should still have unrestricted data usage if Data Saver is on.</p><p id=\"j3eBSc\"><em><strong>Update March 23rd, 2022, 2:20PM ET:</strong></em><em> This article was originally published on August 22nd, 2019, and has been edited to accommodate operating system updates.</em></p><p id=\"FWTSGz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/do95pDHQKdEg8c_Phie6BIb4hSo=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23040242/VRG_photo_Android_12_HowTo.jpg",
  "description": "Keep your data usage within desired limits",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}