{
  "title": "How to take advantage of Android 12’s new privacy options  ",
  "url": "https://www.theverge.com/22634128/privacy-android-12-dashboard-apps-sensors",
  "date": "2022-02-28T22:06:52.000Z",
  "author": "JR Raphael",
  "content": "      <figure>      <img alt=\"Android 12\" src=\"https://cdn.vox-cdn.com/thumbor/Bi2nWiys1f38Ptr8LN5ZzUQ_N30=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/69754580/VRG_1777_Android_12_002.0.jpg\" />    </figure>  <p id=\"eoCcjO\">Privacy is probably one of the biggest buzzwords in tech these days, and even the data-loving Google is getting in on the action.</p><p id=\"sZo9mH\">The Android 12 update boasts a handful of privacy-related additions you’d be wise to explore. Some of them are under the hood and automatic — such as the new <a href=\"https://www.theverge.com/2021/5/18/22436367/google-io-android-private-computer-core-machine-learning-data-privacy\">Private Compute Core</a> that’ll allow certain types of sensitive computing to happen in an isolated environment, entirely on your device. But others are more on the surface. And that means it’s up to you to take advantage of them — or at least understand what they’re doing.</p><p id=\"A1WUkx\">Here are the three most significant privacy-related additions in Android 12 and what you need to know in order to take advantage of them. (Note that these directions are for Pixel phones; on other devices, directions may vary.)</p><h2 id=\"mPCfiA\">Privacy Dashboard</h2><p id=\"Gk2htd\">First and foremost in the Android 12 privacy lineup is Google’s shiny new Privacy Dashboard. It’s essentially a streamlined command center that lets you see how different apps are accessing data on your device so you can clamp down on that access as needed.</p><p id=\"b3PPkP\">In Google’s version of Android, you can get to the Privacy Dashboard in three easy steps:</p><ul><li id=\"bKuCAA\">Open up your system settings (by swiping down twice from the top of the screen and tapping the gear-shaped icon on the panel that appears).</li><li id=\"VEvrUI\">Scroll down and tap the Privacy section.</li><li id=\"qcO2iF\">Tap the “Privacy Dashboard” entry at the top of the screen.</li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The new Privacy Dashboard in Android 12. \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/w7a0xXt-xmDfDEqvzhDayI8UKpM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22795021/android_12_privacy_dashboard.jpg\">      <figcaption><em>The new Privacy Dashboard in Android 12. </em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A timeline of data access is never more than a tap away. \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zU31T4ntdzXxohO_UcQwXaSA4I8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22795023/android_12_privacy_dashboard_list.jpg\">      <figcaption><em>A timeline of data access is never more than a tap away. </em></figcaption>  </figure></div></div></div><p id=\"UBwdG6\">From the Privacy Dashboard, you can drill down into any specific type of feature (such as “Location” or “Camera”) and you’ll get a timeline that tells you exactly which apps have been accessing that feature when. (If you’re looking for a feature other than location, camera, or microphone, you may need to tap on “See other permissions” at the bottom of the screen.)</p><p id=\"rqyR4O\">After that, if anything seems amiss to you, all it takes is one more tap to get into any app’s permission list and pull back on what it’s able to do. </p><h2 id=\"gBsXBW\">Sensor access indicators</h2><p id=\"ck7ZMV\">Next on the Android 12 privacy list is a feature you’ll occasionally see on your screen but whose message might not always be obvious. Whenever an app is accessing your phone’s camera or microphone — even if only in the background — Android 12 will place an indicator in the upper-right corner of your screen to alert you.</p><p id=\"Rk98r3\">When the indicator first appears, it shows an icon that corresponds with the exact manner of access. But that icon remains visible only for a second or so, after which point the indicator changes to a tiny green dot.</p><p id=\"p809BU\">So how can you know what’s being accessed and which app is responsible? The secret is in the swipe down: Anytime you see a green dot in the corner of your screen, swipe down once from the top of the display. The dot will expand back to that full icon, and you can then tap it to see exactly what’s involved.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Android 12’s access indicators start out as icons, but then change to tiny green dots.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-DtKvRdBgQimBBKq4pM-uLcMi1Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22795138/android_12_access_indicator.jpg\">      <figcaption><em>Android 12’s access indicators start out as icons, but then change to tiny green dots.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"A swipe and a tap will reveal any current and recent past sensor access.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JlDGNVhME3OdnW3nEHIgl7M_ENg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22795463/android_12_access_indicator_details_2.jpg\">      <figcaption><em>A swipe and a tap will reveal any current and recent past sensor access.</em></figcaption>  </figure></div></div></div><p id=\"2bZLdw\">Tapping on any app’s name in that pop-up will take you directly to that app’s permission page, where you can reassess what types of access it does and does not allow.</p><h2 id=\"bKYzoY\">Fast-toggle sensor switches</h2><p id=\"oeBXvp\">Last but not least is a new series of toggles that let you turn your phone’s camera, microphone, or GPS sensor completely off with a single fast tap.</p><p id=\"CkUsP7\">The toggles live within Android’s Quick Settings panel, and they might be hidden by default. To uncover them:</p><ul><li id=\"ZigVyP\">Swipe down twice from the top of your phone’s screen.</li><li id=\"DkNKlg\">Tap the pencil-shaped icon in the lower-left corner of the Quick Settings panel. If you’re using a phone other than a Pixel, you might have to tap a three-line menu icon and then look for an “Edit” command there instead.</li><li id=\"CDnMMN\">Scroll all the way down to the bottom of the list and look for the tiles labeled “Camera access,” “Mic access,” and “Location.”</li><li id=\"NzCsIf\">One by one, press and hold each tile for a second, then slide your finger up to move it into the active area of your Quick Settings panel. The higher up you go, the higher it’ll appear in the list.</li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The new camera, microphone, and location access toggles can easily be moved...\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WgJykj6-jNa80pXo956nz9pnuog=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22795464/android_12_sensor_toggles.jpg\">      <figcaption><em>The new camera, microphone, and location access toggles can easily be moved...</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"...into the active and visible area of the Android Quick Settings panel.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ece5XVNTl9bZCWf0c0cbPfMSmEw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22795465/android_12_sensor_toggles_2.jpg\">      <figcaption><em>...into the active and visible area of the Android Quick Settings panel.</em></figcaption>  </figure></div></div></div><p id=\"E7zaxo\">Once you’ve got all three in place, just tap the arrow in the upper-left corner of the screen. The fast-toggle switches will now be present and accessible in your regular Quick Settings area. And all it’ll take is a swift swipe down and a tap on the right tile to disable any associated sensor at a moment’s notice.</p><p id=\"AKCuRg\"><em><strong>Update February 28th, 2022, 5:06PM ET:</strong></em><em> This article was originally published on August 20th, 2021, and was written using the beta version of Android 12; those references have been removed.</em></p><p id=\"c7vcqm\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ponI5l50Gxu8fkc53tW22GOWlDs=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22311483/VRG_1777_Android_12_002.jpg",
  "description": "Guard your privacy with new Android 12 features.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}