{
  "title": "How to use your Apple Watch to unlock your Mac",
  "url": "https://www.theverge.com/22993480/apple-watch-auto-unlock-mac",
  "date": "2022-03-24T14:55:15.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jpt7mm1p3I8XlT1s5OGjzYpv7zk=/0x151:1813x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70666323/IMG_2741.0.jpg\" />        <figcaption><em>Now you don’t have to enter a password when you wake up your Mac</em> | Photo by Victoria Song / The Verge</figcaption>    </figure>  <p id=\"4J9ZOI\">When Apple introduced the ability to unlock iPhones with an Apple Watch, it <a href=\"https://www.theverge.com/22403738/iphone-unlock-watch-ios-14-5\">was a lifesaver</a> for anyone wearing a mask during the pandemic. But the handy feature isn’t limited to your smartphone. You can also use your Apple Watch to unlock your Mac and to securely approve app requests.</p><p id=\"66tczY\">The feature is called Auto Unlock, and technically, it came to Macs long before Apple decided to apply it to iPhones. That said, you may not have heard of it if you’ve just bought a shiny new Apple Watch or are a recent convert to the Apple ecosystem. </p><h2 id=\"5efJbp\">Prepare your Mac</h2><p id=\"2AhPYR\">To get started, you’ll want to make sure all your devices are compatible. Your Mac should be a model from mid-2013 or later and running macOS Sierra at the very least. Here’s how you check to make sure:</p><ul><li id=\"M4N1e8\">Click the<strong> Apple icon</strong> in the top-right corner of your screen</li><li id=\"jYHXVp\">Select <strong>About This Mac </strong>to see what year your Mac is from</li><li id=\"cDz3O0\">If you’re still unsure, select<strong> System Report </strong>in the <strong>About This Mac</strong> menu </li><li id=\"lOBS5K\">From there, click <strong>Network</strong> &gt; <strong>Wi-Fi</strong>. Look in the <strong>Interfaces</strong> category to see whether <strong>Auto Unlock</strong> is supported.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VgS0-Ch4ocRE6MOFvX8CSRxSjlM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23340673/Screen_Shot_2022_03_23_at_2.25.07_PM.png\">      <figcaption><em>This is an alternate way to check if your Mac is compatible using the System Report menu</em></figcaption>  </figure><p id=\"MxReRl\">Once you’re sure your Mac is compatible, there’s one more thing to do: </p><ul><li id=\"8jV27O\">Make sure that <strong>Bluetooth and Wi-Fi are enabled</strong>. The feature won’t work if you’ve only got one turned on and not the other.</li></ul><h2 id=\"9x1w7V\">Set up your Watch</h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hfvVYArjpnffHO1FHAWnGFsIh70=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342170/IMG_2738.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>Don’t forget to add a passcode</em></figcaption>  </figure><p id=\"nddZkJ\">First, make sure you’re logged into iCloud using the same Apple ID on both your watch and Mac. If you don’t know how to do that, you can check out our guide <a href=\"https://www.theverge.com/22215571/factor-authentication-2fa-apple-microsoft-google-how-to\">here</a>.</p><p id=\"Nd62W1\">Next, check what version of watchOS you’re running. You can do this on your wrist:</p><ul><li id=\"bNJ6aJ\">Navigate to <strong>Settings &gt; General &gt; About</strong></li><li id=\"OuEP3N\">Make sure you’ve enabled two-factor authentication for your Apple ID</li></ul><p id=\"qyvX6c\">Okay, now you’re ready to set up your Watch. If you’re running watchOS 6 or earlier:</p><ul><li id=\"dLxHYH\">Head to <strong>System Preferences</strong> on your Mac</li><li id=\"uqNTH0\">Click <strong>Security &amp; Privacy</strong></li><li id=\"jXFMwY\">Navigate to the <strong>General</strong> menu</li><li id=\"oFQwBz\">Select <strong>Allow Apple Watch to unlock your Mac</strong></li></ul><p id=\"Gr75bJ\">If you’re running watchOS 7 or later, the steps are the same but there’s one additional requirement: make sure you’re using a passcode with your Apple Watch. You can do this in the Watch app on your iPhone under <strong>Passcode</strong>, or on your wrist under <strong>Settings</strong>. </p><p id=\"PfbzC0\">Once all this is finished, you should be able to wake up your computer just by wearing your Apple Watch in its vicinity. No passwords needed! </p><h2 id=\"KMle4p\">Approve app requests</h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qBDfLigu1tz6PrdLnS_dLz_1CSM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23340653/Screen_Shot_2022_03_23_at_2.24.28_PM.png\">      <cite>Screenshot: Victoria Song / The Verge</cite>      <figcaption><em>You’ll see slightly different text if your gear supports approving app requests.</em></figcaption>  </figure><p id=\"AU9ki0\">Users running watchOS 6 or later also have the option of approving app requests. (The feature will automatically be enabled when you enable Auto Unlock, so you don’t have to do anything extra.) This means that whenever an app requires authentication, you’ll just have to double-click the side button of your Apple Watch. This includes requests like unlocking preferences, viewing passwords, and approving app installations. </p><p id=\"joBfXf\">Some Apple Watch apps also make use of this feature. For example, you can use this <a href=\"https://support.1password.com/apple-watch-mac/\">in conjunction with 1Password</a>.</p><h2 id=\"n9L4jc\">Any problems?</h2><p id=\"VRXecD\">If you’re having issues with the unlocking feature, here are some extra troubleshooting tips:</p><ul><li id=\"ZUEZbp\">Make sure both Wi-Fi and Bluetooth are enabled. If they are, try toggling them on and off.</li><li id=\"crJPL2\">Restart your computer</li><li id=\"7DX0ja\">Make sure you’re not sharing your screen or using internet sharing. You can check to see this on your Mac in <strong>System Preferences &gt; Sharing</strong>.</li><li id=\"ZF16IV\">If you’ve restarted your computer, keep in mind that you’ll still have to re-enter your password the first time you log in</li></ul><p id=\"9MqyPQ\"></p><p id=\"OTsGJU\"></p><p id=\"wa0ed4\"></p><p id=\"2NHw8N\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RKk-ayRJ-O2nevun0ukh1xn9fUg=/0x411:1813x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23342166/IMG_2741.jpg",
  "description": "The Apple Watch can unlock more than your phone",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}