{
  "title": "How to use Xbox PC Game Pass on your Windows PC",
  "url": "https://www.theverge.com/22965787/how-to-use-xbox-pc-game-pass-on-your-windows-11-10-pc",
  "date": "2022-03-11T20:04:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/lPfCPg1vBN43PxL06UQL-s0W1LM=/170x0:4105x2623/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70610290/663b1bef_b65b_4b2a_a9c6_d1bbcd3fcd44.0.jpg\" />        <figcaption>Microsoft</figcaption>    </figure>  <p id=\"YpjE9f\">Microsoft’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.xbox.com%2Fen-US%2Fxbox-game-pass&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22965787%2Fhow-to-use-xbox-pc-game-pass-on-your-windows-11-10-pc\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Xbox Game Pass</a> is a subscription service that offers on-demand access to dozens of games. It’s a great value if you like to play and discover new games, and <a href=\"https://www.theverge.com/2019/5/30/18644977/microsoft-xbox-games-pass-pc-subscription-service-launch\">now that it’s on PC</a> instead of solely being a console experience, your subscription can follow you from your Xbox console to your Windows desktop. </p><p id=\"pCkhiC\">However, the expansion to Windows PCs hasn’t been seamless. While an Xbox lets you easily access your Game Pass right on the home dashboard, finding Game Pass games on a PC is a whole other story. </p><p id=\"xPq3i5\">There are two ways to find Game Pass games on PC. The first and easiest requires you to download a free app, though I think it will be worth the effort. The second method doesn’t require any additional installations, but finding compatible Game Pass games is more cumbersome.</p><h2 id=\"T4Ebmo\">First, get PC Game Pass</h2><p id=\"jALLjv\">If you already subscribe to Game Pass Ultimate, congratulations, you already have access to PC Game Pass, and you can skip this step. For everyone else, start here. </p><p id=\"huf98u\">You can purchase a subscription to either <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24542&amp;u1=vergehowto&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fxbox-game-pass%2FCFQ7TTC0KGQ8%2F0002\" rel=\"sponsored nofollow noopener\" target=\"_blank\">PC Game Pass for $9.99 per month</a> or to <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24542&amp;u1=vergehowto&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fxbox-game-pass-ultimate%2Fcfq7ttc0khs0%2F0007\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Game Pass Ultimate for $14.99 per month</a>. The latter is Microsoft’s everything-in-one bundle subscription that also includes Xbox Live Gold for online multiplayer on consoles and Game Pass for Xbox One consoles, as well as PC Game Pass. If you’re a new subscriber, it’s worth noting that you can get your first month of PC Game Pass for just $1.</p><h2 id=\"WNy5Mk\">Access Game Pass games on PC via the Xbox app</h2><p id=\"VF6BP7\">This is the easiest, most user-friendly method of finding Game Pass games that will play on a PC. </p><ul><li id=\"XeZ64C\">First, download the new Xbox app on the Microsoft Store on either Windows 10 or 11. Head to the Microsoft Store and search for the Xbox app, or <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=24542&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fxbox%2F9mv0b5hzvk9z\" rel=\"sponsored nofollow noopener\" target=\"_blank\">find it at this link</a>.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LZwAuJ-DgfbtF7GBfmLXO5sCFuE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295808/PC_Game_Pass_4.png\">      <figcaption><em>The Xbox App in the Microsoft Store</em></figcaption>  </figure><ul><li id=\"4TnQxJ\">Log in with your Microsoft account. You’ll be treated to a more luxurious user interface than the Microsoft Store provides. Better yet, it surfaces Game Pass games on the first screen that you see, and unlike the Store’s default view, everything that the Xbox app displays can be played on PC.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VgkdXl9WeHiKdxVbz_L5r2dicXQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295824/PC_Game_Pass_1.png\">      <figcaption><em>The home screen of the GamePass app</em></figcaption>  </figure><p id=\"ygwhXv\">Once you’ve installed the games that you want to play, you can start them via the Xbox app or through a shortcut created during installation. </p><h2 id=\"32ZWt6\">Access Game Pass games on PC via Microsoft Store</h2><p id=\"eOAzAW\">All of the PC games that are currently playable on Game Pass can be found in the Microsoft Store, which is on every Windows computer by default — no extra installation necessary.</p><p id=\"WOSgR1\">As I mentioned earlier, this is the slightly more confusing method for finding Game Pass games that work on PC. I recommend downloading the Xbox app listed above, but this option works if you’re in a rush and don’t want to deal with a download.</p><ul><li id=\"kd7Rvd\">Open the Microsoft Store.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DQsiwvTGOvqZpIWYkVj_t9185j4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23295867/PC_Game_Pass_5.png\">      <figcaption><em>“My Library” shows you a list of all your apps and can sort your purchased or GamePass titles</em></figcaption>  </figure><ul><li id=\"M3LOC9\">On the Store homepage, click the menu button on the bottom-left section of the window, then select “Library” to see all of the apps that you own.</li><li id=\"PtYOh9\">You can then use the filter at the top to show only games, but this view doesn’t distinguish between purchased games or titles you’ve downloaded via GamePass.</li><li id=\"e38U90\">This view also includes games that can only be played exclusively on the Xbox console. And there isn’t a way to filter the view to make Xbox One games disappear. </li></ul><p id=\"usHYwx\">Did I mention that the Xbox app for Windows is just way better?</p><p id=\"FbtCW6\"><em><strong>Update March 8th, 2022, 2:20PM ET:</strong></em><em> This article was originally published on August 12th, 2019; the info about the Game Pass and some of the screenshots have been updated.</em></p><p id=\"sNDuPo\"></p><p id=\"Fxtm4H\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/q1pbm5HcvUEtfx0VO3_YXdtoA4Y=/0x193:4274x2431/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18962806/663b1bef_b65b_4b2a_a9c6_d1bbcd3fcd44.jpg",
  "description": "Our guide to where you can find and download your games",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}