{
  "title": "How to force Google Messages to use SMS texts when RCS fails",
  "url": "https://www.theverge.com/23009900/google-messages-chat-text-android-rcs-sms",
  "date": "2022-04-04T18:35:32.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CnK8XEt3lQizKqHT2BE0e_d-6QY=/409x0:2335x1284/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70709069/Screen_Shot_2022_04_04_at_1.52.37_PM.0.png\" />        <figcaption>Screenshot: Google</figcaption>    </figure>  <p id=\"oS2Q2V\">Just this morning, I was sitting in my car waiting for Alternate Side of the Street parking to end (a dance that <a href=\"https://www.westsiderag.com/2020/09/07/column-the-street-sweeper-cometh-or-an-ode-to-alternate-side-parking\">many car-owning New Yorkers go through</a>) and texted my partner to come take his turn. As normal, I used the Messages app on my Pixel 6 phone to contact him and waited for the usual reply (“On my way!” or “Be there in a few!”), but after about four minutes or so, I realized that I hadn’t had a response. When I checked the app, I saw that the text hadn’t been sent — instead, there was a tiny message saying my partner’s phone was off and asking if I wanted to send an SMS / MMS instead.</p><p id=\"9n4erw\">What?</p><p id=\"FkCE0X\">I chose to send the SMS and got an immediate reply (proving that the phone was <em>not</em> off). What was the problem? I’m not absolutely sure, but Google Messages uses RCS, <a href=\"https://www.theverge.com/2018/12/12/18137937/rcs-rich-communication-service-messaging-explainer-what-is-google-chat\">an online protocol</a> that Google has been trying to make a standard — and for some reason, the app had apparently decided that my partner’s Pixel was not available.</p><p id=\"NW26iR\">Google has been making a lot of noise about Messages lately and has even <a href=\"https://www.theverge.com/2022/3/10/22970470/android-ios-messages-emoji-reactions\">made it more friendly when messaging with iPhones</a>. But obviously, there are still kinks.</p><p id=\"mEAp3G\">If you use Google Messages for your chats (rather than <a href=\"https://www.theverge.com/2021/6/21/22538240/google-chat-allo-hangouts-talk-messaging-mess-timeline\">Chat, or Hangouts, or whatever</a>) and, for some reason, your Messages app decides that you can’t send an RCS text, here’s a feature that you may want to enable — just in case. It will ensure that you don’t have to check whether or not your text has gone out; instead, it will automatically send your message via the less-secure but still-available SMS / MMS protocol. Once RCS is available again, it will switch back. (These directions are for a Pixel 6 with Android 12 — as usual with Android, YMMV.) </p><ul><li id=\"6jXE6s\">Open the <strong>Messages</strong> app, tap the three dots in the top right corner of the main screen, and select <strong>Settings</strong></li><li id=\"a8mev6\">Select <strong>Chat features</strong></li></ul><div id=\"184WHi\"><div data-anthem-component=\"gallery:11128218\"></div></div><ul><li id=\"6yBn4K\">Find <strong>Automatically resend as text (SMS/MMS)</strong> and toggle it on</li><li id=\"xzoKF8\">When you toggle on the feature, you’ll get a warning that messages sent as SMS/MMS aren’t end-to-end encrypted but that messages will switch back when the chat features reconnect. If that’s okay with you, select <strong>Allow</strong>.</li></ul><p id=\"E7k3PF\">And that’s it! I like the security and media features that come with the Message app’s RCS protocol, but when I send a text, I definitely want it to go through asap. (Otherwise, I’d send an email — or maybe a nice snail mail note.) If you agree, you may want to make sure that this feature is toggled on.</p><p id=\"091Gtv\"></p><p id=\"u2iLTA\"></p><p id=\"GuLUnJ\"></p><p id=\"FQ54Fh\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/k4qb46g5Zj5OTBexGC2utYbP8v0=/146x0:2598x1284/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366751/Screen_Shot_2022_04_04_at_1.52.37_PM.png",
  "description": "Sometimes RCS can be quirky; send an SMS text instead.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}