{
  "title": "How Microsoft built its smart Surface camera",
  "url": "https://www.theverge.com/2022/3/22/22990673/microsoft-surface-hub-2-smart-camera-interview-report",
  "date": "2022-03-22T12:00:00.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YX634NrJpmeOaqjPaiyOhZHOlL0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70655942/SH_Smart_Camera___Live_2.0.jpg\" />    </figure>  <p>Microsoft always wanted to upgrade the Surface Hub 2 camera</p> <p class=\"p--has-dropcap p-large-text\" id=\"dPCFkb\">“From day one of Surface Hub 2, we knew we were going to make our cameras smart,” explains Steven Bathiche, who oversees all hardware innovation for Microsoft devices, in an interview with <em>The Verge</em>. Microsoft’s surprise <a href=\"https://www.theverge.com/22980664/microsoft-surface-hub-2-smart-camera-price-release-date-features\">$799.99 Surface Hub 2 Smart Camera</a> debuted last week, offering automatic reframing without the warping and distortions you might typically see on other conference room cameras.</p><p id=\"wwNNsO\">It can detect faces and bodies, in an effort to make sure everyone in a room is visible during meetings whether they’re close to the camera or up to eight meters away. The Surface Hub 2 Smart Camera is able to pretty much see an entire conference room thanks to its 136-degree field of view, which keeps the people at the front in focus alongside those in the back.</p><p id=\"MW63fj\">Microsoft had always planned to upgrade its Surface Hub 2 camera before the pandemic put hybrid meetings into focus, that’s why it’s modular and can be detached from the top of the 55- or 85-inch displays. “We knew we were going to evolve the experience. We didn’t know exactly how, but we knew that was going to change and needed to change with people’s needs, the evolution of the conference room, and even how our culture will essentially adapt towards meetings,” says Bathiche.</p><p id=\"EnQfiS\">Large devices like the 85-inch Surface Hub 2 presented challenges for capturing everyone in a meeting room with a traditional camera. “We needed a camera to handle bigger rooms,” says Bathiche, so Microsoft got to work.</p><div class=\"c-wide-block\"><div id=\"bMS8VW\"><div ><iframe src=\"https://www.youtube.com/embed/sgv_TeT8RB8?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"nq7OSx\">Bathiche and his team have created Microsoft’s own optics, AI model, and edge computer to go into the Surface Hub 2 Smart Camera and power its computational photography. “It has onboard compute, 1 teraflops of compute that essentially houses a really large AI model that we’ve built,” says Bathiche. “It includes the autoframing application, it resides in the camera, so what comes out is just a 4K image so it literally looks like a webcam to the Surface Hub.”</p><p id=\"8asv0b\">That means that all of the AI work is done on the camera itself, and never sent to the cloud or even over the wire to the Surface Hub 2 to process. The camera runs the AI model, processes all the data, and makes the decision to crop the image accordingly. While the automatic framing can capture everyone in a room automatically, the Smart Camera will also use tilt compensation to adjust the image for the camera position and create more natural eye contact instead. It’s also able to remove the fish eye effect from wide-angle lenses so people don’t look distorted or stretched inside meeting rooms.</p><p id=\"SRIYND\">“We designed an 11 element, completely glass lens with super sharp focus and basically close to the refraction limits,” explains Bathiche. Behind the lens is a 12-megapixel sensor (4000 x 3000) with an f/1.8 aperture that all generates the 4K cropped image. “The actual lens is a 184-degree field of view, so the camera can look behind itself.”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8Ie0uoziGs0aR6H4rIX-vHuUxq4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23336434/SH_Smart_Camera___1.jpg\">      <cite>Image: Microsoft</cite>      <figcaption><em>Microsoft built custom parts for its Surface Smart Camera.</em></figcaption>  </figure></div><p id=\"cb3ZR2\">All of this hardware is nothing without the AI models that power the Surface Smart Camera, though. Microsoft started this project before the pandemic, but it had to train its AI models <em>during</em> the pandemic, which presented the obvious challenges of filling meeting rooms with people.</p><p id=\"NdZCy2\">“We went to New Zealand because they had zero COVID-19 cases and we had offices there,” explains Bathiche. “We hired actors and actresses to do data collection in all sorts of rooms. Our data set is absolutely massive.”</p><p id=\"xs970d\">Microsoft trained its AI model on faces and bodies to ensure it’s fully inclusive and will detect people that aren’t always facing the camera. It even used synthetic people and faces to improve its diversity across situations and people. “We have a really cool internal technology that can generate synthetic data, so we were able to generate synthetic people and faces,” adds Bathiche. </p><p id=\"03i5nx\">The Smart Camera isn’t trained to detect pets or animals, though. So that should mean it won’t try to automatically reframe a meeting if an office cat or dog steps into view. Microsoft has also applied its <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=24542&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fai%2Fresponsible-ai\" rel=\"sponsored nofollow noopener\" target=\"_blank\">responsible AI principles</a> to this project, which include a committee and set of tools to ensure the fairness and inclusiveness of AI.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/b40taeMW-vyBOoTkXqF6B84BUH0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23336437/SH_Smart_Camera___Live_3.jpg\">      <cite>Image: Microsoft</cite>      <figcaption><em>The Surface Smart Camera has on-board compute.</em></figcaption>  </figure></div><p id=\"hSFFsW\">“If you look at our data set, it’s absolutely amazing across the board in terms of disparity between the different groups: race, gender, skin tone, hair styles, etc,” explains Bathiche. “I think one of the things that’s built into the camera that people might not see on the box is that robustness and inclusiveness that the model has.”</p><p id=\"sMoFJ4\">Bathiche says Microsoft has “sat there and tuned the heck” out of the autoframing capabilities of its Smart Camera over the past year to make sure it’s not too jumpy or too slow to miss content. “Every frame that the camera gets, it decides whether it’s worth it to move or recrop the image.” </p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qoJou6J6AVYoi9r3mgG_afXcAKw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23336448/SH_Smart_Camera___8.jpg\">  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/q6XLLhaisKhY-KUb6qYTWziDc24=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23336446/SH_Smart_Camera___9.jpg\">  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/X61Ex-zKZYO1YqQdOpPmntvvS-w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23336445/SH_Smart_Camera___Live_1.jpg\">  </figure></div><p id=\"5VSQwM\">You might be wondering if you could use this $799.99 camera on a regular Windows PC, but it’s not quite that simple. While all the compute and AI models are housed inside the Surface Hub 2 Smart Camera, it’s not really designed to be a regular webcam. “Its design point was specifically for Hub. The elevation, the angles, and the AI was designed for multiple people near and far,” explains Bathiche. “While you could technically design a mount and plug it into a PC, I don’t think it’ll work as good as you want it to.”</p><p id=\"U6ghTj\">This isn’t the first time Microsoft has focused on improving its webcams and cameras, either. The Surface Pro X already has an <a href=\"https://www.theverge.com/2020/7/22/21334622/microsoft-eye-contact-surface-pro-x-video-chat-ai-correction-feature-rolling-out\">AI-powered eye contact feature</a> that makes it appear like you’re always making eye contact no matter what you’re looking during a video call. Apple added a similar FaceTime Attention Correction feature to iOS 13. “The algorithms we used in eye contact [for the Surface Pro X] are the same algorithms for the faces that we use inside this camera,” says Bathiche.</p><p class=\"c-end-para\" id=\"DASETl\">Microsoft clearly designed this Smart Camera for the Surface Hub 2, but with persistent rumors around Surface-branded webcams, it’s possible we’ll see a powerful webcam from Microsoft one day instead of the <a href=\"https://www.theverge.com/22381422/microsoft-new-webcam-headsets-usb-c-speaker-features-price-specs-release-date\">affordable ones that exist today</a>. “This area of using computation to bring people together and make people feel like they’re in the same room... I think is something we’ve always been passionate about and will continue being passionate about, and we’ll continue evolving our devices as you see in the Surface Pro X,” says Bathiche.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1Y8BbC9okOlSiDeZof7JHSUQpno=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23336442/SH_Smart_Camera___Live_2.jpg",
  "description": "Microsoft built its own smart AI features and hardware.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}