{
  "title": "How one Ukrainian startup is adapting its app during a time of war",
  "url": "https://www.theverge.com/2022/3/2/22957920/ukraine-startup-reface-app-adapt-russia-invasion",
  "date": "2022-03-02T14:39:32.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"GERMANY-RUSSIA-UKRAINE-CONFLICT\" src=\"https://cdn.vox-cdn.com/thumbor/ZMuOL04lljN1rWNVb_fiJkqsb3A=/0x0:7224x4816/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70569441/1238871309.0.jpg\" />        <figcaption>Photo by JOHN MACDOUGALL/AFP via Getty Images</figcaption>    </figure>  <p>From face swaps to information drops</p> <p class=\"p--has-dropcap p-large-text\" id=\"BIjWra\">Like so many Ukrainians, Dima Shvets was awoken last Thursday by the sound of bombs. At around 5AM local time, Russian troops began shelling key targets in his country, escalating a military assault that had begun eight years ago into a full-fledged invasion. As air raid sirens rang out in cities across Ukraine, Shvets reached out to friends, family, and colleagues to find out what was happening. </p><p id=\"jwdirD\">“The first two days were super tough,” Shvets tells <em>The Verge</em>, and he and those around him were forced to adapt to this new and terrifying reality. On the one hand, everything they knew had changed forever; on the other, life had to continue — there was no other choice. </p><p id=\"cMkNQW\">For Shvets, continuity meant his company: a startup based in Ukraine called Reface that makes a popular face-swapping app of the same name. As CEO, Shvets watched over Slack and Telegram channels as the firm’s staff, many of whom were already working remotely, headed to bomb shelters and basements for protection against the initial bombardment. </p><p id=\"z8qxRx\">Ksenia Maslova, a member of the company’s comms team, says she found her way to her local subway station in central Kyiv on Friday and was there until Monday with around 50 others. “We had our sleeping bags, warm clothes and other emergency things in — we call them — ‘anxious bags,’” Maslova tells <em>The Verge</em>. “It was crazy because even though we had food with us, we didn’t know if we’d be able to come out again on Monday.” </p><div>  <figure class=\"e-image\">        <img alt=\"UKRAINE-RUSSIA-CONFLICT\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7DqTW8S_pS1KHjmx-ZoEkRR3RLs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23282649/1238871439.jpg\">      <cite>Photo by Genya Savilov/AFP via Getty Images</cite>      <figcaption><em>Citizens of the Kyiv have been sheltering in the city’s underground metro stations. </em></figcaption>  </figure></div><p id=\"mGb2nW\">As the days passed and the initial shock of the invasion subsided, staff began to move further afield, keeping an eye on reports of Russian troop movements as they did. Some headed for the border and many to friends and family in the West, where fighting is less intense. “The war forced us to split up,” says Shvets, who is himself now in Western Ukraine.</p><p id=\"xmAJnX\">A few members of Reface’s team members quickly volunteered to join Ukraine’s Territorial Defense Forces, a military branch of civilian reservists that’s been carrying out auxiliary tasks for the army: transporting food and fuel, making Molotov cocktails, and setting up armed roadblocks. And as the Reface team shared news of these departures, Shvets began to think about what his company could do to help the war effort. </p><p id=\"R2rg2e\">“We told our people they shouldn’t work now,” he says. “We should work on the freedom and health of our country instead.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"f52RZB\"><q>“We should work on the freedom and health of our country instead.”</q></aside></div><p id=\"iDRqiX\">With a little over 200 employees, Reface is hardly a tech giant, but it’s a well-known startup in Ukraine’s once-booming IT sector. Despite threats of war and the pandemic, Ukraine’s tech exports <a href=\"https://www.atlanticcouncil.org/blogs/ukrainealert/ukraines-booming-it-sector-defies-the-coronavirus-crisis/\">grew by 20 percent in 2020</a>, and Reface itself (formerly known as Doublicat) has both <a href=\"https://techcrunch.com/2020/12/01/google-plays-best-of-2020-awards-highlight-the-stressful-year-its-been/\">won awards</a> and <a href=\"https://techcrunch.com/2020/08/17/deepfake-video-app-reface-is-just-getting-started-on-shapeshifting-selfie-culture/\">topped app download charts</a> around the world since its release. </p><p id=\"KSyYDu\">The app uses machine learning to swap users’ faces into GIFs and videos of movies and memes — essentially producing domesticated deepfakes for entertainment on social media. And while that essential functionality still remains, the Reface team has since conscripted its app into Ukraine’s wider information war.</p><p id=\"jIREnT\">The first step, explains Shvets, was to leverage the app’s popularity in Russia. Working sometimes from bomb shelters and basements, he and his colleagues compiled a video that showed the invasion as it had happened, using the same clips and images that were circulating on social media. In some ways, it felt like work as normal, says Maslova, but it was a routine conducted under extraordinary conditions. “Sometimes someone took a task and then texted the channel: ‘Oh, sorry, I need to go to my bomb shelter because there are sirens,’” says Maslova. “And we would say, ‘Okay, okay, sure, just tell us whether you’re safe.’” </p><p id=\"Nmke1Y\">After the video and accompanying text were prepared, Reface’s team sent out millions of push notifications to the app’s users in Russia and around the world, calling on viewers to join protests and stand with Ukraine.  </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KbM4rN_RgLTtS3z6c6iedQkB7KU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23282633/Screenshot_2022_03_02_at_13.56.34.png\">      <cite>Image: Reface</cite>      <figcaption><em>Screenshots of the push notification Reface sent to users and the embedded video. </em></figcaption>  </figure><p id=\"JJlkdh\">Daria Kravets, Reface’s comms manager, says key motivation was to reach Russian viewers by bypassing traditional channels of communication. Twitter and Facebook have been restricted in Russia, and the state has gone to great efforts to limit news of the war from reaching the people. “We understand Russians don’t have access to the real situation here because independent media is blocked,” Kravets tells <em>The Verge</em>. “But we have 5 million users [in Russia], and we sent out 2 million push notifications. We continue to send them. And in that push notification, we added footage of the real situation, and we encouraged people to go protest because that’s the only way to change the situation.” </p><p id=\"pbNH4j\">It’s impossible to know the impact of such work, but rallying resistance is certainly not a trivial matter. Analysts say Russia’s media blackout was a key part of <a href=\"https://warontherocks.com/2022/02/interpreting-the-first-few-days-of-the-russo-ukrainian-war/\">the country’s military strategy</a>: to strike fast and hold territory before domestic politics could disrupt an unpopular invasion or Western powers could stir themselves to help. Ukraine has stymied these efforts on two fronts: first, by offering stiff opposition to Russian troops on the ground and, second, by <a href=\"https://www.washingtonpost.com/technology/2022/03/01/social-media-ukraine-russia/\">flooding social media</a> with memes, images, and videos that emphasize the brutality of the invasion and the bravery and humor of ordinary Ukrainians.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eg56JdIcgUEslTaFsKHILux3aE8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23282641/IMG_4256.PNG\">      <cite>Image: The Verge</cite>      <figcaption><em>The app now lets users swap their face into videos of Ukraine’s President Volodymyr Zelenskyy.</em></figcaption>  </figure></div><p id=\"rlblLO\">For Reface, push notifications were just the start, and the company has since given its app a patriotic makeover. The app’s icon now shows the blue and yellow of the Ukrainian flag, while a banner on the welcome screen tells users “Ukraine Needs Your Support,” directing them to donate to the war effort. Most conspicuously, Reface has added a new character to its roster of face-swapping stars: Ukraine’s president Volodymyr Zelenskyy, who has become a key figure in the country’s media war, sharing defiant videos to counter Russian misinformation about his surrender. In Reface’s app, anyone can place their face over Zelenskyy’s as he walks with soldiers and addresses the nation, telling viewers: “Slava Ukraini!”’<em> </em>— “Glory to Ukraine!” </p><p id=\"S8bsgW\">As Shvets puts it: “Before, the main heroes on the app were Jack Sparrow, Hulk, and Iron Man. But today’s heroes are our people, our military forces, and our president Zelenskyy.” </p><p id=\"pMN09H\">Shvets says that up until the moment that bombs started falling, he hadn’t ever thought his world would look like this. He says he only wanted to start Reface to make fun tools for creators. “Frankly speaking, I could never have imagined doing this with the app,” he says. </p><p id=\"7hQyrc\">But like so many Ukrainians, Reface and its team have adapted their skills to what they say is an existential threat to their country and freedom. Other members of the tech industry have made similar efforts — volunteering for the so-called “<a href=\"https://www.forbes.com/sites/thomasbrewster/2022/03/01/ukraine-propaganda-machine-might-be-winning-against-russia/?sh=175d2489536d\">cyber resistance</a>” and agitating on social media. Despite these new concerns, Shvets is adamant that Reface will continue to exist whatever happens next with the invasion. As well as sending push notifications to Russians, he’s been busy securing servers outside of Ukraine to keep the app running whatever happens next. “Our app is not dead; it’s developing, and it’s going to be fine,” he says.</p><p id=\"iSyrAn\">More immediately, though, Reface’s team members say that adapting the app, even in relatively small ways, has given them a sense of purpose. “Fear was replaced by the feeling that I am not alone and surrounded by such [...] focused and brave people,” says Kravets. </p><p id=\"v8QNDS\">As Maslova puts it, during times of war, everyone has to find their niche. “If you have a medical degree, you go and help medical institutions,” she says. “If you have communication skills, you try and prepare these texts.”</p><p class=\"c-end-para\" id=\"uqRDf9\">When asked how she feels about Reface’s new direction, she pauses for a second and then gives a heartfelt sigh. “United,” she says. “It’s the most important thing. And useful. We have our own piece of the battleground.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CQeVDc53AhdDdPlCUwQd8skZTBM=/0x81:7848x4190/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23282607/1238871309.jpg",
  "description": "Conscripting a face-swapping app for Ukraine’s war efforts.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}