{
  "title": "How to migrate your games from the Bethesda game launcher",
  "url": "https://www.theverge.com/23046452/bethesda-game-launcher-how-to-migrate-games",
  "date": "2022-04-28T20:40:07.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/L2m_tI-r2yr2aeYxBHLNdOBTCuk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70806740/acastro_199529_1777_bethesda_0002.0.0.jpg\" />        <figcaption><em>The Bethesda game launcher is no more.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"VReAPT\">The Bethesda.net game launcher is <a href=\"https://www.theverge.com/2022/2/22/22945874/bethesda-launcher-steam-migrate-games-wallet\">giving up the ghost as of May 11th</a>, so Bethesda is allowing anyone who has purchased games on their exclusive platform to migrate their purchases to Steam. The launcher and your library will remain accessible after May 11th, but Bethesda has recommended that users begin the process as soon as possible.</p><p id=\"jzAXFO\">In the process of migrating your games, Bethesda has noted that your entire game library and wallet will be accompanied by all of your saved games — meaning that you shouldn’t have to worry about losing your 500-plus-hour playthrough of <em>Fallout 76. </em>However, we’d recommend backing up those files wherever applicable before you start the process.</p><p id=\"EpGXOr\"><a href=\"http://Bethesda.net\">Bethesda.net</a> logins will still be a thing, however, and your credentials will remain unchanged for titles that require an account like <em>Doom Eternal</em> and <em>Fallout 76</em>.</p><div class=\"c-float-left\"><div id=\"W4zD0e\"><div data-anthem-component=\"aside:11166270\"></div></div></div><p id=\"SHIJcG\">If you’re unsure of whether you actually have any games on the <a href=\"http://bethesda.net/\">Bethesda.net</a> launcher, here’s a summarized list of affected games that have been available on the platform. This can be a little confusing, especially considering many of these games have been hosted on Steam simultaneously.</p><p id=\"OQihpN\">To find any saves you might have and back them up, Bethesda has provided <a href=\"https://help.bethesda.net/#en/answer/55036\">this handy guide</a> that shows the default location for any saves made through the <a href=\"http://Bethesda.net\">Bethesda.net</a> launcher.</p><p id=\"cE2YN6\">Thankfully, beyond locating any saves you might have lurking around, the process for migrating your games is remarkably easy. Just log into your account on <a href=\"http://Bethesda.net\">Bethesda.net</a>, and click on the “transfer library” button. </p><p id=\"NzgEd8\">If you haven’t done so already, this utility will prompt you to link and verify your Steam account. Once you’ve done that, you just have to confirm which games are making the move, and you’re good to go.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/o3wdaGJxC6nP-m7x91KbcQlePd0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23423412/Bethesda.net_launcher2.jpg\">      <figcaption><em>What you should see after a successful transfer.</em></figcaption>  </figure><p id=\"FnHw3o\">The whole process is fairly straightforward, but Bethesda has also provided an FAQ that offers <a href=\"https://bethesda.net/en/article/2RXxG1y000NWupPalzLblG/sunsetting-the-bethesda-net-launcher-and-migrating-to-steam\">a more comprehensive list of specific questions</a> you might have.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RI5urapDeYJLui15gWsAWpuaK3Q=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16309946/acastro_199529_1777_bethesda_0002.0.jpg",
  "description": "All games and saves can be transferred to Steam.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}