{
  "title": "How to manage your iPhone lock screen",
  "url": "https://www.theverge.com/22981336/how-to-change-iphone-lock-screen-control-center-today-view-wallpaper",
  "date": "2022-03-17T12:00:00.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rhrfaEJyf7icJbWQWjXUf_XFnU8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70634720/ajohnson_221103_5070_0004.0.jpg\" />        <figcaption><em>From your wallpaper to the functions in your control center, you’ve got lots of options to make your iPhone lock screen feel more you.</em> | Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p id=\"pko2XW\">Compared to Android, iOS has historically been the less customizable, more you-get-what-you-get operating system. While that remains true to an extent, it has come a long way, with customization options that didn’t exist three or four years ago. For example, these days, you can do a lot more with your lock screen than you might realize. </p><p id=\"UX2VHl\">Here’s how to customize what you see — and how it looks — on your iPhone lock screen. (This was tested on an iPhone running iOS 15.3.)</p><h2 id=\"iFK5Xc\">First: the basics. </h2><p id=\"CSoFYV\">Your lock screen shows the time, date, and current notifications on the default view. We all know and love it. </p><p id=\"8d3hS7\">Other features can be accessed on the lock screen if they’re enabled in settings. To choose which features appear, go to <strong>Settings</strong> &gt; <strong>Face ID &amp; Passcode</strong> (or <strong>Touch ID &amp; Passcode</strong> on a phone with Touch ID). Scroll down, and you’ll find a list of features that can be disabled until you unlock your phone, including the control center, Today View, and other things like the ability to reply to a text right from the lock screen. By default, they’re all enabled except for USB accessories.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yv19okzLD3nXRCiHlkyoYjc7ZJQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23321288/lockscreen_access.jpg\">      <figcaption><em>Decide which features are available to you when your phone is unlocked.</em></figcaption>  </figure></div><p id=\"Z1JwoB\">Assuming it’s enabled, swiping down from the top right of the screen on a phone with Face ID, or the bottom up on a phone with Touch ID, reveals the control center. That’s where you’ll find quick access to things like screen brightness, volume, and Wi-Fi.</p><p id=\"gY3qR6\">Swiping down from the middle of the lock screen brings up search and Siri suggestions, which are the phone’s best guesses as to what apps you might be looking for at that particular time. In the opposite direction, swiping up from the middle of the screen reveals older notifications. A right-to-left swipe gets you into the camera, and a left-to-right swipe brings up Today View. You’ve got some customization options for all of these features, and Today View is just ripe for personalization because… widgets!</p><h2 id=\"UFHeH8\">Today View</h2><p id=\"GqMwLh\">The Today View panel is where you can add widgets and other things you might want to see at a glance without unlocking your phone. In addition to the usual suspects like weather and calendar, you can add a particular note or featured photos from your iPhone gallery. Some widgets require the phone to be unlocked to use them, like Google’s widget to perform a quick search in Chrome, but others offer content that can be enjoyed without unlocking the device, like the <a href=\"https://apps.apple.com/us/app/reddit/id1064216828\">Reddit app’s cat calendar</a>. (It’s just a daily calendar with a picture of a cat. It’s great.)</p><p id=\"FZNt53\">Today View is also available from the home screen, and that’s where you’ll need to go to start customizing it and adding more widgets. On your home screen, swipe right to access Today View. From there:</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JXBXlwoZ1ydqv0NKSS1eympxUxA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23321300/today_view_widgets.jpg\">      <figcaption><em>Today View widgets can be viewed without unlocking your screen.</em></figcaption>  </figure></div><ul><li id=\"6SLLqB\">Touch and hold one of the widgets on Today View and tap <strong>Edit Home Screen</strong> when a little menu appears.</li><li id=\"HdMFUl\">Tap the plus sign at the top left of the screen </li><li id=\"Anx7CW\">From here, you can use the search bar to look for a particular app or widget or scroll down and browse some suggested widgets</li><li id=\"2Gg23l\">Tap one of the widgets or one of the items in the list of apps below it to see all of the options available for that specific widget</li><li id=\"6N7M9t\">Swipe through the options and tap <strong>Add Widget </strong>to put it on your Today View screen</li><li id=\"UFsN6A\">Once a widget is on Today View, you can touch and hold to drag it around the screen and place it where you want</li></ul><h2 id=\"V63Qdl\">Control Center</h2><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9pTBgWz2ZmSuZnJMVhLUTKMCM1c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23321304/control_center.jpg\">      <figcaption><em>Control center lets you toggle quick settings and access certain features from the lock screen.</em></figcaption>  </figure></div><p id=\"xC3S8j\">If you’ve enabled access to the control center from your lock screen, then it is another place you can add quick access to more functions, though they’re a little more utilitarian in nature than “cat calendar.” By default, you’ll find your flashlight and connectivity settings here, among others, but you can add more functions to have available on your lock screen. Just go to <strong>Settings</strong> &gt; <strong>Control Center</strong> and scroll down to see your options.</p><p id=\"RXCtrv\">Once you have your favorites selected, you can rearrange the order they appear in on the control panel. In your list of included controls, touch and hold the three bars to the right side of the feature you want to move, then drag it up or down the list. Controls appear in rows of four below the Focus mode, brightness, and volume controls, starting with whatever’s at the top of your list in the upper left position. </p><p id=\"YEdhIF\">Pro tip: some of your control center controls can do more for you if you press and hold them. Some will bring up additional options this way — the camera icon offers quick access to start the camera app in portrait mode or to record video, for example.</p><h2 id=\"rdlT0C\">Notifications</h2><p id=\"kLGLjR\">For many of us, the reason we reach for our phones roughly five thousand times a day is to check the notifications on our lock screens. You can customize them, both in terms of what they look like and where they appear. </p><p id=\"aNEog2\">To change the settings for any individual app’s notifications, go to <strong>Settings</strong> &gt; <strong>Notifications</strong> and scroll down to the <strong>Notification Style </strong>section. Select the app you want to adjust the notifications for, and you’ll find another screen of options. Here, you can toggle that app’s notifications off completely. Or, if you want that app to stop nagging you with notifications but you don’t want to use that nuclear option, you can fine-tune using the options below that.</p><p id=\"5arG27\">For example, you can choose how you’re alerted when a notification arrives. If you tap the little blue checkmark underneath the <strong>Lock Screen</strong> alert option, you’ll turn off lock screen notifications for that app. If the <strong>Notification Center</strong> option next to it is checked, then those notifications will be quietly delivered to the notification center without popping up on your lock screen. Kind of a handy way to reduce the notification noise in your life.</p><p id=\"mWaaip\">You might want certain notifications from some apps delivered immediately and the rest sent to the notification center — things like “your DoorDash order has been delivered” versus “get $5 off your next DoorDash order,” for example. That’s what the <strong>Time Sensitive Notifications</strong> toggle does – urgent notifications will always appear on your lock screen when they’re delivered, regardless of the alert style that you set. (Note: not all apps offer this option.) </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/U-2wUhmAANyZt23L0X9AeQMP5R8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23321343/notification_options.jpg\">      <figcaption><em>You can customize each app’s alert style to minimize lock screen clutter.</em></figcaption>  </figure><p id=\"bwvRlI\">There are a few other customization options for notifications, but as far as the lock screen is concerned, you have one more option: preview on or off. Notifications appear with previews always on by default, meaning you’ll see the full text of the notification whether or not the phone is unlocked. You can choose to have the preview appear only once the phone is unlocked if you’d like a little more privacy, so only the app icon appears – not the full text of the notification – or disable previews completely. </p><p id=\"6xPYA4\">Another option to reduce the notification clutter on your lock screen is to have certain app notifications delivered in a daily summary. You specify the apps and the time you’d like to receive them. Time-sensitive notifications from those apps will still go straight to you, but the rest will be collected quietly and sent to you in your summary. </p><p id=\"bwRg3E\">To set up the scheduled summary, go to <strong>Settings</strong> &gt; <strong>Notifications</strong> &gt; <strong>Scheduled Summary</strong>, toggle it on and then follow the prompts to select apps and set up your summary time and frequency. </p><h2 id=\"I2TSYn\">How to change your lock screen wallpaper</h2><p id=\"vdjS03\">Ah, the lock screen wallpaper. Maybe it’s the modern equivalent of having your kid’s class picture in your wallet. Or maybe it’s your favorite picture from a hike you took five years ago that brings you a temporary moment of calm when you see it. Or you go for high-impact graphics without any nostalgia attached. It’s your world, and here’s how you can customize it:</p><p id=\"LGUPR9\">Go to <strong>Settings</strong> &gt; <strong>Wallpaper</strong> &gt; <strong>Choose a New Wallpaper</strong></p><p id=\"ZqV3Y1\">From here, you can pick one of Apple’s Still or Dynamic, moving wallpapers, or pick a photo from your phone gallery. Tap the one you want, zoom the image how you like it, and press set. You’ll have the option to display it on your lock screen, home screen, or both. Then go forth, and enjoy a lock screen that’s a little less get-what-you-get and a little more you.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HQXsiexYpf6tSuTeTaSApXy4_Sg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307885/ajohnson_221103_5070_0004.jpg",
  "description": "Do more before you even unlock your phone.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}