{
  "title": "How a high-tech twist on a 19th-century process could clean up steel and cement making",
  "url": "https://www.theverge.com/2022/2/22/22945975/rondo-energy-decarbonize-steel-cement-making-renewable",
  "date": "2022-02-22T21:34:17.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"EVRAZ ZSMK steel mill\" src=\"https://cdn.vox-cdn.com/thumbor/donZR47i-ynaWYcfURa9xfejLEQ=/0x2:3707x2473/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70538236/1232999714.0.jpg\" />        <figcaption>MAY 14, 2021: A blast furnace attendant at the EVRAZ ZSMK steel mill.&nbsp; | Photo by Sergei Bobylev\\TASS via Getty Images</figcaption>    </figure>  <p id=\"sDCCjY\">Greenhouse gas emissions need to virtually disappear within the next few decades to avoid the worst effects of climate change, and the most difficult emissions to erase could come from industries like steel and cement set to play a big role in new, green infrastructure. Wind <a href=\"https://www.usgs.gov/faqs/what-materials-are-used-make-wind-turbines#:~:text=According%20to%20a%20report%20from,aluminum%20(0%2D2%25).\">turbines</a>, for example, are made mostly of steel — but, at least until now, it’s been almost unheard of<strong> </strong>to make that steel using renewable energy. </p><p id=\"IbKhOR\">That could start to change if a startup developing a “heat battery” can successfully move from the lab to the real world. It’s what Oakland, California-based Rondo Energy aims to do with <a href=\"https://www.rondo.energy/news/y6xtbqi9413lcmajpegzd4yiypdlnq\">$22 million</a> in new funding from Bill Gates’ climate investment fund, Breakthrough Energy Ventures, and utility-backed investment firm Energy Impact Partners. </p><p id=\"Q52tY1\">The heat battery is supposed to be able to supply heavy industry with extreme heat generated by renewable energy, a solution that could help clean up the pesky industrial operations that make up about a <a href=\"https://www.climateworks.org/programs/industry/\">third</a> of global greenhouse gas emissions. The company thinks its technology can cut down global emissions by 1 percent over the next decade<strong>.</strong></p><div class=\"c-float-right\"><aside id=\"2qcF5E\"><q>The company thinks its technology can cut down global emissions by 1 percent over the next decade</q></aside></div><p id=\"WVJmyf\">Until recently, a lot of efforts to cut planet-heating carbon dioxide emissions have focused on getting the power sector to run on clean energy and then electrifying other sources of pollution like cars and buildings. But that doesn’t necessarily slash pollution that comes from making many construction materials, chemicals, and fertilizers. </p><p id=\"qPGzJZ\">Those industries have been called “hard to decarbonize” because they often rely on coal, oil, or gas to fire up kilns or furnaces to extremely high temperatures. Steelmaking, for instance, conventionally involves heating up coal to about 1,800 degrees Fahrenheit. As a result of this dirty process and steel’s ubiquity in construction, the steel industry alone makes up about <a href=\"https://www.mckinsey.com/industries/metals-and-mining/our-insights/decarbonization-challenge-for-steel\">8 percent</a> of global greenhouse gas emissions.</p><p id=\"6FHoUU\">To change that, Rondo Energy has found a new way to use old tricks. Its battery draws on renewable energy to heat up a sort of brick that’s similar to refractory bricks already used in blast furnaces for steel.</p><p id=\"TCCLSO\">Rondo Energy CEO John O’Donnell describes his company’s battery as a large “insulated shoebox full of brick.” Electricity heats the brick rapidly. As air passes through the array of bricks, it gets superheated — reaching about 2,000 degrees Fahrenheit. That heat can be used directly or turned into high-pressure steam often used in manufacturing.</p><p id=\"nZCGQz\">“Because it’s simple and boring, [the technology] can go to a very large scale with economics driving it and attack a big problem,” O’Donnell tells <em>The Verge</em>. </p><p id=\"3obSbW\">O’Donnell founded Rondo Energy in 2020 after starting a couple other companies that tapped solar energy to generate steam for industrial processes. Others are taking slightly different approaches to the problem. At least one company has sought to harness the sun for cement and steel by <a href=\"https://grist.org/article/this-company-wants-to-make-steel-and-cement-with-solar-power-heres-how/\">concentrating sunlight</a> to reach extremely high temperatures. Earlier this year, Breakthrough Energy Ventures funded a company called Boston Metal that aims to decarbonize <a href=\"https://grist.org/energy/boston-metal-taking-coal-out-of-steel/\">steelmaking using electrolysis</a>. And some steel mills already use electricity — often coming from coal-fired power plants — to transform scrap steel.</p><p id=\"gYz0wg\">On top of cutting pollution from heavy industry, Rondo Energy’s brick can also take advantage of excess renewable energy that might otherwise overwhelm the grid or go to waste. In sunny California, daytime solar energy prices can sometimes drop so low — into negative territory — that utilities lose money on it. Rondo’s batteries, however, can soak up and store the energy so that it can be used later. There’s a lot of research going into big lithium batteries that can hook up to the grid to play a similar function.</p><p id=\"MsuzjW\">The company still has to figure out how to turn its grand plans into reality. Until now, its prototypes have just proven themselves in the laboratory. The $22 million in funding it received this month will go towards the first manufacturing lines to make the batteries at scale. Some demonstration projects will take place this year in California’s Kern County. O’Donnell didn’t share what they’ll be used for, but county planning director Lorelei Oviatt told <a href=\"https://www.bakersfield.com/news/thermal-heat-projects-slated-for-deployment-in-kern/article_330340a6-8920-11ec-b653-3740d0978b13.html\"><em>The Bakersfield Californian</em></a> that the technology could potentially be used for “everything from green steel to conventional manufacturing and cement that needs both renewable energy as well as high-temperature heat.”</p><p id=\"qga2Tn\">Crucially, the heat battery also provides an alternative to two controversial solutions for tackling the industrial emissions problem. Hydrogen fuel and technologies that capture carbon dioxide from smokestacks have so far gotten the most attention for their potential to clean up heavy industry. But they’ve faced a lot of pushback from skeptics worried that they might distract from efforts to turn away from fossil fuels. Most hydrogen today is <a href=\"https://www.nytimes.com/2021/08/12/climate/hydrogen-fuel-natural-gas-pollution.html\">made using gas</a>, although it can also be made using renewable energy. Carbon capture technologies, meanwhile, allow polluting facilities to continue burning fossil fuels and still claim that they’re going green by drawing down CO2 — even if other pollutants remain. </p><div class=\"c-float-left\"><aside id=\"bQsNgr\"><q>“If you want to go fast, make it boring”</q></aside></div><p id=\"e5apVT\">Carbon capture and hydrogen also need to prove that they can be deployed at scale. They’re currently very expensive and still need a lot more investment in R&amp;D and infrastructure, including a new network of pipelines to move hydrogen and captured carbon. Rondo’s technology is relatively simpler and cheaper to roll out, according to O’Donnell, in part because it builds on older, established techniques. </p><p id=\"51tBF4\">“It’s cheaper because it’s boring,” O’Donnell says. “If you want to go fast, make it boring; use stuff that you can count on.”</p><p id=\"zEdy3v\">Rondo’s heat battery does face a similar challenge to other battery technologies: becoming scrap at the end of its life cycle. The entire system has a lifespan of 50 years, although O’Donnell says many of its individual components can last for decades longer and be recycled or disposed of like similar materials already used in steelmaking.</p><p id=\"Ls0stB\"></p><p id=\"vFIDN9\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/50O0Z8bb6LZ4EMTsnJY0YKYofFM=/0x267:3707x2208/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23263710/1232999714.jpg",
  "description": "A heat battery could cut down industrial pollution.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}