{
  "title": "How Android 12 lets you control your phone with facial gestures",
  "url": "https://www.theverge.com/22649045/android-12-facial-gestures-accessibility-how-to",
  "date": "2022-02-25T21:34:53.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"Android 12\" src=\"https://cdn.vox-cdn.com/thumbor/b2-h7Z7MoiSJKcKXVegDNs-e49M=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/69802559/VRG_1777_Android_12_002.0.jpg\" />    </figure>  <p id=\"koRjta\">An accessibility feature that was introduced with Android 12 allows you to control your screen using facial gestures: raise eyebrows, smile, open mouth, look up, look left, look right. This feature, called “Camera switches,” uses the phone’s camera to watch for these gestures and allows them to signal simple screen operations. These operations include: go to the next actionable screen object, select an object, go to the previous object, touch and hold, scroll forward, and scroll backward; you can also pause the camera switch itself. </p><p id=\"VmzBWL\">It’s not a long list: it only includes six facial gestures and not all that many actions. However, it’s a beginning, and it could be useful if you can’t use your hands to work your phone’s screen.</p><p id=\"av01cN\">If you do have a Pixel loaded with Android 12, here’s how you start using the “Camera switches” feature.</p><ul><li id=\"r5dZwU\">On your phone, go to “Settings”  &gt; “Accessibility” &gt; “Switch Access”</li><li id=\"PKYNED\">Toggle on “Use Switch Access.” It will probably ask you to allow it to view and control your screen and interact with apps.</li><li id=\"dBADsf\">You’ll then be asked to choose a switch type. You can use a physical switch via USB or Bluetooth, but we’re going to go with Camera Switch instead. You’ll be asked for permission to take pictures and record video, and may need to download about 10 MB of data.</li><li id=\"be3ni4\">Next, the app asks you to choose between using one switch or two. This is a little confusing: what it really means is that you can either just use a single gesture to start auto-scanning what’s on the screen and then perform that same gesture to select it (one switch), or you can use two or more gestures to perform a variety of functions (two switches). I selected the second; either way, once you’ve made your choice, tap “Next.”</li><li id=\"ODnKOR\">You now need to select one of three ways that you will be able to move through your actionable items using facial gestures. Linear scanning means that each gesture will move forward item by item; row-column scanning will let you select a row of items and then drill down; group selection will assign all items a different color — you use facial gestures to choose which color you want and drill down from there. I chose linear scanning, but you may want to try out all three to see which works for you.</li></ul><p id=\"UbdIml\"></p><div id=\"nNtKDF\"><div data-anthem-component=\"gallery:10727839\"></div></div><ul><li id=\"9HjKkA\">The three subsequent screens let you choose switches for three actions:  next, select, and pause (in other words, temporarily pause or unpause the use of facial gestures). You can use one or more facial gestures for each — for example, you can assign both eyebrows up and eyes right to “next.” But you can only use each gesture for one action; so if you choose to raise your eyebrows to indicate “next,” then “raise eyebrows” will be grayed out for any other actions.</li></ul><div id=\"irjMw3\"><div data-anthem-component=\"gallery:10727861\"></div></div><ul><li id=\"63nwas\">The next screen is called “Camera Switch settings.” Toggle it on to enable it. It has a “Try it” button that you can use to see if your camera can properly catch your smile, upraised eyebrows, etc.</li><li id=\"HlMiM1\">On this page, you can also tweak your face gesture settings to better suit your needs. For example, if you tap on “Open Mouth,” you can set how big the gesture needs to be (in other words, how open your mouth has to be), how long you need to hold it, etc. You can also set the amount of time the gesture should hold — for example, if you raise your eyebrows for a moment, you may not want your cursor to immediately think you want to choose “Next.”</li></ul><div id=\"yOCLXg\"><div data-anthem-component=\"gallery:10727943\"></div></div><h2 id=\"j6x7WF\">Try it out</h2><p id=\"0QAiRe\">At this point, it’s a good idea to leave setup and try it out. I did, and while I found it slow going (and realized very early on that I had neglected to assign the “previous” switch), it worked pretty well. I even had little trouble using raised eyebrows to indicate “next,” despite my rather heavily framed glasses. (Of course, they’re reading glasses that I often wear low on my nose, so it’s possible glasses might be a problem for others.)</p><p id=\"lz5kOk\">Some things you may want to keep in mind:</p><ul><li id=\"wAM8l5\">If you want to go back and tweak your settings, you can go back to “Settings” &gt; “Accessibility” &gt; “Switch Access” &gt; “Settings.” There you can reassign facial gestures either by going through the guided setup again (look for “Open setup guide”) or running through the various menu options.</li><li id=\"2R8c8F\">A blue smiley face at the top of your screen will appear when the camera switches are active. When the switches are paused, you’ll see a blue “pause” symbol.</li><li id=\"vpY91h\">When you go through your home screen using camera switches, a “Menu” button will appear next to the smiley face. This will bring up a quick menu of action items such as home, back, notifications, power options, etc. You can edit the menu to include the items you want to use.</li><li id=\"EgIalo\">One handy feature is the “Switch Access shortcut” which you can find on the main “Switch Access” page. The shortcut — a little green icon — will stay on your screen at all times, letting you turn switch access on and off at will. If it’s getting in your way, swipe it toward the edge of the screen to minimize it.</li></ul><div id=\"hsoiGX\"><div data-anthem-component=\"gallery:10727953\"></div></div><p id=\"dqzXLf\">Granted, Android 12’s Camera Switch Access feature takes a while to set up and can be a little complex to tweak. In addition, I only used it for a few hours, and so I’m not a fair judge on how ultimately useful it would be to someone who may find it difficult to interact with their phone using touch. But if it is something that you might find useful, take a look.</p><p id=\"l0dsFs\">One additional note if you’re using Android 10 or 11: since this feature is built into the Android Accessibility Suite, which is already part of Android 10 and 11, there is a possibility that it will eventually become available to those versions of Android as well. According to sites such as <a href=\"https://www.xda-developers.com/android-camera-switches-control-phone-with-face/\"><em>XDA-Developers</em></a>, if you’re comfortable sideloading APKs on your phone, you can access it now via sites such as <a href=\"https://www.apkmirror.com/apk/google-inc/android-accessibility-suite/android-accessibility-suite-12-0-0-381995842-release/android-accessibility-suite-12-0-0-381995842-android-apk-download/\">APKMirror</a>. Otherwise, stay tuned and watch for updates.</p><p id=\"OFQcac\"><em><strong>Update February 25th, 4:35PM ET:</strong></em><em> This article was originally published on September 1st, 2021; the introduction and some of the directions have been updated.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ponI5l50Gxu8fkc53tW22GOWlDs=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22311483/VRG_1777_Android_12_002.jpg",
  "description": "You can use your face to control an Android 12 phone.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}