{
  "title": "How to turn your Android phone into a digital picture frame",
  "url": "https://www.theverge.com/23023832/android-google-photos-screen-saver-how-to",
  "date": "2022-04-13T18:55:23.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wQkGd-tdNwdt7U3_1VCCmVGKjcc=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745642/DSC02131.0.jpg\" />        <figcaption><em>Use your phone’s screen saver feature to show off your favorite images saved to your Google Photos.</em> | <em>Photo by Allison Johnson / The Verge</em></figcaption>    </figure>  <p id=\"xKKUuA\">If you have more images in your Google Photos app than you know what to do with, why not put your phone to work displaying them? With a few simple steps, you can use your Android phone’s screen saver feature to turn your phone screen into a digital picture frame while it charges. </p><p id=\"PhehAv\">This works especially well for phones with wireless charging (so you can see your photos with the phone propped up on a charger), but it will work with any kind of charging mode or if you connect your phone to a dock. It’s built right into the operating system, and it’s a neat, easy way to show off some of your favorite photos.</p><p id=\"6cghEW\">I used a <a href=\"https://www.theverge.com/2022/2/3/22914918/motorola-2022-moto-g-stylus-refresh-90hz-display-battery-processor-camera\">Motorola Moto G Stylus (2022)</a> for the steps below, but the process is very similar on a Samsung or Pixel phone. You’ll need to have the photos you want to display in a Google Photos album.</p><ul><li id=\"n2cMtD\">Go to <strong>Settings &gt; Display</strong>.</li><li id=\"JU0eek\">Tap <strong>Advanced</strong> to reveal more menu options (if you need to) and select <strong>Screen saver</strong>.</li><li id=\"Vdxoqz\">Tap <strong>Current screen saver</strong> and choose the Google Photos app icon. This will take you back to the main screen saver menu page. From there, tap the <strong>gear icon</strong> next to <strong>Current screen saver</strong>.</li><li id=\"l1a3RY\">From here, you can access some preferences, like turning the animated zoom effect on or off. To select which photos the screen saver will show, choose your Google account to bring up a list of your Google Photos albums. (You may also see a list of the albums you have on your device.) Place a checkmark next to the ones that you want to include.</li><li id=\"v5QNco\">Navigate back to the main screen saver menu page and tap <strong>When to start </strong>to choose when the screen saver will turn on — either while charging, docked, or both.</li><li id=\"fpjSje\">Navigate back to the main screen saver menu page, and tap <strong>Start now</strong> (or <strong>Preview</strong>) to see what it will look like.</li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UQQNUkzT8XUBMFqVOA-XmCPxGIQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387802/Screenshot_20220413_111628.png\">      <figcaption><em>Find the screen saver option on the display settings page. It may be nested under “Advanced” settings.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wYcp0sRss6Nz4sAdHNWpP2Y6aEc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387804/Screenshot_20220413_111546.png\">      <figcaption><em>You can choose which albums to show and tweak a few display preferences.</em></figcaption>  </figure></div></div></div><p id=\"yGNa3M\">You’re done! Here are a few additional pointers for your brand-new, no-additional-cost digital photo frame:</p><ul><li id=\"uTwzQq\">Obviously, vertically oriented photos will look best.</li><li id=\"E6M2EY\">Choose photos in which the subject is centered, or else they might be cropped right out of the picture.</li><li id=\"ygtEeS\">If you do have a lot of horizontally oriented photos, turning off the “photos fill screen” option will help, but your images will look quite small on your display.</li></ul><p id=\"9YlSZ1\">The screen saver will always start with the first photo in the album and continue showing them in whatever order the album is sorted in. If that sounds a little too repetitive, you can create an auto-updating album. Here’s how to do it:</p><ul><li id=\"wJ0Qxd\">Start a new album in Google Photos. In the app, you’ll tap the <strong>Library</strong> tab at the bottom of the screen and select the plus sign for a new album. Or, choose an existing album by going to the same Library tab and selecting an album.</li><li id=\"fx3lb4\">Give your new album a title, and under add photos tap <strong>Select people &amp; pets</strong>. Pick the subjects you want to include in the album. Google will automatically identify them in new images uploaded to Google Photos and add them to your album.</li><li id=\"WIOaVF\">If you’re using an existing album, tap on the three dots in the upper-right corner, select <strong>Options</strong>, and under <strong>Automatically add photos</strong>, tap the plus sign and select who you want to include. Check <strong>Also add existing photos</strong> if you want.</li><li id=\"w2CS0x\">New images will appear at the beginning of the album, so they’ll be the first to display when your screen saver starts.</li></ul><p id=\"1Ggtl7\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5UrTbJcy-QT7XELEFrAKxkY2Nik=/0x290:3000x1861/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387760/DSC02131.jpg",
  "description": "Wireless charging, but make it adorable.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}