{
  "title": "How to track your menstrual cycles on a smartwatch",
  "url": "https://www.theverge.com/23058888/smartwatch-menstrual-cycle-how-to",
  "date": "2022-05-05T19:24:19.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OSnvo5GsYtmftEdBNo1QrbDNmMc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70836789/IMG_2897.0.jpg\" />        <figcaption><em>Apple introduced Cycle Tracking on the Series 5.</em> | Photography by Victoria Song / The Verge</figcaption>    </figure>  <p id=\"ipWv9v\">Although modern smartwatches and fitness trackers have been around for almost a decade, period tracking didn’t arrive until 2018. These integrations shared familiar features with your standard period-tracking app — but a big difference was that instead of having to pull out your phone, you could view or input data from your wrist. And, because these features were part of a wearable platform, users could see how their health trends correlated to their menstrual cycles in one place.</p><p id=\"PzVZVL\">Tracking your menstrual cycles digitally can be more convenient than having to pull out a physical calendar or inputting dates into a spreadsheet. But before you get started, there are a few things to take into account. </p><p id=\"L7L3SI\">First and foremost, you must acknowledge that you are handing sensitive health data — including data about your sexual activity — over to a third party. It’s a smart idea to brush up on a wearable maker’s health data privacy policy and seriously consider whether you’re comfortable with the <a href=\"https://www.consumerreports.org/health-privacy/what-your-period-tracker-app-knows-about-you-a8701683935/\">potential consequences</a> and <a href=\"https://www.vox.com/the-goods/2018/11/13/18079458/menstrual-tracking-surveillance-glow-clue-apple-health\">shortcomings</a> of these features. </p><p id=\"rgTJtV\">Secondly, while you can use these features to guide fertility planning, you should never use them as your sole method of contraception. No smartwatch period tracking feature is cleared by the FDA for that purpose. (Though there are <a href=\"https://www.theverge.com/22335858/birth-control-app-clue-natural-cycles-fda\">two cycle tracking apps</a> that have been.) They are intended to help you monitor your own bodily trends. </p><p id=\"MOn0zY\">Not every wearable platform natively supports period tracking. That said, here are some that do and how you can get started. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ou_p6Qsph42IuH2_3zkwZwTUlGQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440690/IMG_2898.jpg\">      <cite>Photography by Victoria Song / The Verge</cite>      <figcaption><em>You can log a host of symptoms and other factors from the wrist.</em></figcaption>  </figure><h2 id=\"2txwku\">Apple Watch</h2><p id=\"GlVozU\">First off, here’s where you can find Apple’s Health app <a href=\"https://www.apple.com/legal/privacy/data/en/health-app/\">privacy policy</a> and an additional <a href=\"https://support.apple.com/en-us/HT209519\">support page</a> on the company’s policy regarding health records. </p><p id=\"Kvj65L\">While you can absolutely download a third-party period tracking app onto your Apple Watch, you can also opt to use Apple’s native option: Cycle Tracking. Cycle Tracking will allow you to log your period, as well as symptoms, sexual activity, and spotting. You can also log other factors that may affect your menstrual cycles, like whether you’re pregnant, lactating, or using a contraceptive. You’ll also be able to see a summary that includes a period prediction and cycle history. </p><p id=\"S10JBi\">You do have the option of logging your period information directly into the Health app if that’s what you prefer. That’s because it’s a feature available to everyone, not just Apple Watch owners. Certain things, like marking whether you’re pregnant, must be done from your iPhone. </p><p id=\"QDRILY\">That said, it can be helpful to log your symptoms as they happen on your wrist — lest you forget the details later. Cycle Tracking is one of the apps that’s preloaded on the Watch, so you don’t have to download it. </p><p id=\"Islc3l\">To log your period straight from the wrist:</p><ul><li id=\"uShYaP\">Hit the digital crown to bring you to the grid or list view of your apps</li><li id=\"gPMOas\">Navigate to the <strong>Cycle Tracking</strong> app</li><li id=\"JJBtmU\">At the top, you can swipe left or right to pick a day. The default is the current day.</li><li id=\"YgwzBU\">To add data, hit + next to the field of your choice. You can select <strong>Period</strong>, <strong>Symptoms</strong>, <strong>Sexual Activity</strong>, or <strong>Spotting</strong>.</li><li id=\"3KIvXP\">Within the individual menus, tap the data you’d like to log. (Eg. Period &gt; Had Flow / No Flow &gt; Light Flow / Medium Flow / Heavy Flow.) </li><li id=\"sAfZHF\">Tap <strong>Done</strong> in the top right corner</li><li id=\"HRzf9o\">Scroll down to view a Summary of your <strong>Period Prediction</strong>, <strong>Last Menstrual Period</strong>, and <strong>Ongoing Factors</strong>. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qYeK8WO4vNawBUf7bnIdNUoJMx4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19655351/fitbit_versa_period_screen_1532373342_4XhK_full_width_inline.jpg\">      <cite>Image: Fitbit</cite>  </figure><h2 id=\"83FPUq\">Fitbit</h2><p id=\"oKbVRV\">Here’s Fitbit’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.fitbit.com%2Fglobal%2Fus%2Flegal%2Fprivacy-policy&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23058888%2Fsmartwatch-menstrual-cycle-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Privacy Policy</a>, which includes its health data sharing policy.</p><p id=\"thCDKO\">Unlike the Apple Watch, Fitbit only allows you to view your period data from the wrist. You can’t log directly using the watch or tracker itself. You can, however, log your cycles, symptoms, ovulation test results, sexual activity, fluids, and whether you took the morning after pill within the phone app. </p><p id=\"k4YWhC\">To view period data on the wrist, you must first set up menstrual health tracking in the Fitbit app.</p><ul><li id=\"0SPscX\">In the Fitbit app, hit the <strong>Today</strong> tab</li><li id=\"aGX6dA\">The <strong>Menstrual Health</strong> tile should look like a pink droplet. </li><li id=\"blofOu\">If the tile isn’t already there, hit the <strong>Edit</strong> button in the top right.</li><li id=\"rHYizl\">Scroll down and tap the <strong>Menstrual Health</strong> tile to add it</li><li id=\"mxWpwJ\">You’ll then be prompted to answer a few questions about your cycle for its prediction and fertile window features. </li></ul><p id=\"HxJHaK\">Within the Menstrual Health tile, you can view your cycles in either a Calendar or Trends view. In the Calendar view, your predicted period dates will be highlighted in pink. Your fertile window will be highlighted in blue. To log details, you can hit the green + button on the lower right-hand side. You may also be occasionally asked to confirm whether your period data is correct. The Trends tab will show you your cycle history, along with a few stats about your average period length, average estimated ovulation, and average cycle length.</p><p id=\"u4lHHb\">To view this data on your wrist:</p><ul><li id=\"yrQvCC\">Swipe up from the clock face</li><li id=\"JfRH5s\">This should bring up a summary dashboard of Today’s stats</li><li id=\"9ojxMq\">Scroll down to the <strong>Menstrual Health</strong> tile. You should be able to see when your next predicted period is. </li></ul><h2 id=\"bq3Gl6\">Garmin</h2><p id=\"xYLp8m\">You can find Garmin’s privacy policy <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.garmin.com/en-US/privacy/global/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">here</a>. </p><p id=\"vBCEPx\">If you’re an athlete, you may want to take your period into consideration when setting up a training regimen. While the Apple Watch and Fitbits offer fitness tracking, they aim for a more general audience. While Garmin caters to them, too, it also offers another level of data for hardcore athletes. For instance, the app gives insights into which supplements may be helpful in stopping cramping. </p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pm5_AlO-T84lhcHk8Qm6H8u9mIc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440702/vivoactive3m_fba897a3cf8b5a5ea0909bfdeea91d64.png\">      <cite>Image: Garmin</cite>      <figcaption><em>Garmin also has a menstrual health tracking feature.</em></figcaption>  </figure></div><p id=\"kHe94B\">The Menstrual Cycle card within the Garmin Connect app will tell you what day of your period you’re on and which cycle phase you’re in and offer a prediction for when your next cycle will begin. You can also log personal notes, as well as record your flow, physical symptoms, mood, discharge, ovulation, sexual activity, and sex drive. You can also get period and fertility predictions, as well as set up period reminders. </p><p id=\"ND7k5H\">You can log your period within the Garmin Connect app or on a compatible Garmin device. (You can see a list <a href=\"https://apps.garmin.com/en-US/apps/bf2dfeea-5b3f-47ac-96e8-40cbd1be40b5\">here</a>.) Compatible Garmin trackers have a Menstrual Cycle Tracking widget, which lets you check your cycle data as well as log symptoms. </p><p id=\"hH5vHj\">When you pair your device to your smartphone, Garmin should walk you through setting up various features, including menstrual health tracking. If not, or you need to skip the tutorial and set up later, here’s how to get started.</p><ul><li id=\"KXXlNP\">Open the Garmin Connect app</li><li id=\"wtFjeB\">Hit the <strong>More</strong> tab in the bottom right</li><li id=\"uWOj1W\">Select <strong>Health Stats</strong></li><li id=\"7vltLv\">Scroll down and select <strong>Menstrual Cycle</strong></li><li id=\"5eBrmm\">Tap <strong>Get Started</strong> and answer the prompts about your period — and that’s it!</li></ul><p id=\"rSpfMV\">To view and log symptoms from the wrist, you must have already followed the steps above. </p><ul><li id=\"Aw4GCT\">First, check to see if your device already has the <strong>Menstrual Cycle Tracking</strong> widget pre-installed.</li><li id=\"pHXHDM\">If not, you can <a href=\"https://apps.garmin.com/en-US/apps/bf2dfeea-5b3f-47ac-96e8-40cbd1be40b5\">download the widget</a> from the <strong>Garmin Connect IQ</strong> store. </li><li id=\"meR5Qs\">The widget requires you to grant access to run in the background, send and receive information, push notifications, and Garmin Connect fitness profile</li><li id=\"yrYFSH\">You should now be able to navigate to the widget on your watch</li><li id=\"ihTRHz\">Tap to open the widget</li><li id=\"NPdiQp\">From here, you can see where you are in your cycle, as well as log physical symptoms</li></ul><p id=\"Z3uujf\">Garmin is unique in that it allows you to track pregnancy in a more in-depth way. For instance, pregnant users can get information about their baby’s size and weight guidelines and log symptoms, blood glucose, and baby movements. It also provides explainers about how pregnancy may affect Garmin’s other metrics and training features. </p><p id=\"EWLXRf\">To enable pregnancy tracking: </p><ul><li id=\"hzYY1U\">Open the <strong>Garmin Connect</strong> app</li><li id=\"bK2Qwh\">Tap the <strong>More</strong> tab in the bottom right</li><li id=\"psw4pv\">Select <strong>Settings</strong>, and then <strong>User Settings</strong></li><li id=\"Nh6cnt\">Scroll down and tap <strong>Women’s Health </strong></li><li id=\"UM5YMd\">Tap <strong>Cycle Type</strong> and select <strong>Pregnancy</strong> </li><li id=\"Pmqblv\">From there, you will be prompted to select your due date, hydration goals, weight gain goals, and the option to pause your training status</li></ul><h2 id=\"juB5UF\">Samsung</h2><p id=\"mqL5er\">You can find Samsung’s privacy policy <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.samsung.com/us/account/privacy-policy/#:~:text=with%20your%20consent.-,Information%20Sharing,to%20comply%20with%20legal%20requirements.\" rel=\"sponsored nofollow noopener\" target=\"_blank\">here</a>. </p><p id=\"Qij0nC\">Samsung was late to add period tracking to its wearables, only adding the feature in 2020. With the Galaxy Watch 4, Samsung has also switched over to Google’s WearOS platform, meaning you have access to the Google Play Store. That gives you the option of downloading a third-party period app if you prefer that. Samsung partnered with Glow for this feature, and it should be noted that <em>Consumer Reports</em> found <a href=\"https://www.consumerreports.org/mobile-security-software/glow-pregnancy-app-exposed-women-to-privacy-threats-a1100919965/\">serious privacy vulnerabilities</a> with Glow’s app in 2016. The company has since said it’s fixed that issue, but it’s something to keep in mind. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3-Br9W0alMhh8oWn63dMtsI383c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440725/log_period.PNG\">      <cite>Image: Samsung</cite>      <figcaption><em>Samsung introduced period tracking in 2020 on the Galaxy Watch 3.</em></figcaption>  </figure></div><p id=\"HpSRek\">Samsung’s menstrual health tracking is similar to those from other wearable makers. You can track your periods, receive cycle predictions, log symptoms, and record your moods and sexual activity. </p><p id=\"kvid83\">To view and add period data from the wrist:</p><ul><li id=\"kv5lUp\">Open the Samsung Health app on your watch</li><li id=\"b6HYcS\">Scroll down to <strong>Women’s Health</strong></li><li id=\"fMJ3Yi\">From here, you can tap <strong>Enter Period</strong> to log your start date</li><li id=\"xdEOK0\">Under the Daily Log heading, tap <strong>Add Log</strong> to record your symptoms and other factors</li><li id=\"U2Xuzd\">Select <strong>Save</strong> to finish</li></ul><p class=\"c-end-para\" id=\"69sfC0\">Period tracking can be a helpful tool in monitoring your health, but at the end of the day, it’s also optional. Even if you decide to track your period digitally, you don’t <em>have</em> to input every symptom or your sexual activity if it makes you uncomfortable. It’s also perfectly OK to opt out or choose analog options as well. </p><p id=\"BYKA4G\"></p><p id=\"A3Hu9g\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LvOOv2IcjmmGSYx-S7TRMuadcL4=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23440688/IMG_2897.jpg",
  "description": "You can now log symptoms from the wrist.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}