{
  "title": "How to connect your video doorbell to your smart display  ",
  "url": "https://www.theverge.com/22949565/doorbell-video-nest-echo-show-alexa-google-how-to",
  "date": "2022-02-25T17:00:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/iBRCtSFipZE0BWZ3eXH_tmKfpXU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70550229/jtuohy_220217_5036_0008.0.jpg\" />        <figcaption><em>This Echo Show 10 is displaying a feed from the Blink Video Doorbell.</em></figcaption>    </figure>  <p id=\"17WWXg\">Video doorbells are handy devices, alerting you to events at your front door via your smartphone, wherever in the world you are. But when you’re just chilling out at home it’s often easier to turn to your <a href=\"https://www.theverge.com/22521948/amazon-echo-show-8-2nd-gen-2021-review\">Echo Show</a> or <a href=\"https://www.theverge.com/22357214/google-nest-hub-2nd-gen-2021-assistant-smart-display-review\">Google Nest Hub</a> to see what’s going on outside, rather than pulling out your phone — or actually getting off the sofa. </p><p id=\"zTVGMq\">Many smart doorbell cameras can connect to Alexa or Google smart displays, including third-party options from companies like <a href=\"https://www.theverge.com/2018/7/26/17616560/lenovo-smart-display-review-google-assistant-smart-speaker-screen\">Lenovo</a> and <a href=\"https://www.theverge.com/22732472/facebook-portal-go-10-inch-2021-review\">Facebook</a>, as well as Fire TV and Chromecast enabled TVs. This lets you bring up a live view of your doorbell camera on a bigger screen with a simple voice command. Then you can see, hear, and, in some cases speak to your visitor or check on that package on your porch. </p><p id=\"ayxEpZ\">It’s easy to connect your smart doorbell to your smart display — we’ll walk you through the steps.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FD8lOYOC700nWlTKYByj-F0Yk4A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262921/jtuohy_220216_5036_0002.jpg\">      <figcaption><em>A Google Nest Hub Max displaying a live feed from a Eufy doorbell camera. The Eufy has two cameras, so the second is shown as a picture-in-picture.</em></figcaption>  </figure><h2 id=\"1dE7b7\">Stream your video doorbell camera to your Google Nest smart display</h2><p id=\"TZ3lOL\">A Google Nest smart display, including the <a href=\"https://www.theverge.com/22357214/google-nest-hub-2nd-gen-2021-assistant-smart-display-review\">Google Nest Hub</a> and <a href=\"https://www.theverge.com/2019/9/9/20855944/google-nest-hub-max-review-assistant-smart-display-price-specs-features\">Google Nest Hub Max</a>, can announce when someone rings your video doorbell and show you a live feed from the camera. You can also view some camera streams on your Chromecast-enabled TV. Currently, doorbell cameras from Eufy, Arlo, <a href=\"https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera\">Wyze</a>, and Nest are compatible with Google displays, along with others listed <a href=\"https://support.google.com/googlenest/answer/9137164#zippy=%2Ccameras-that-work-with-hey-google\">here</a>. (Ring and Blink doorbells do not work with Google.)</p><ul><li id=\"ygNkhI\">Add your doorbell to the Google Home app on your phone or tablet by tapping + on the main screen. Select “Set Up Device.” Then select “Works with Google.” (For a Google Nest doorbell, choose “New Device”).</li><li id=\"Sqx1gn\">Choose your camera manufacturer from the list and connect your account. (If you have previously installed a different device from that manufacturer, there’s no need to reconnect your account — just tap “Check for New Devices.”)</li><li id=\"qxNJxW\">Follow the steps to finish the setup process. These will include naming your doorbell (choose something you will easily remember) and adding it to a room. (I suggest Front Door for the room and Doorbell for the name, so the phrase “Hey Google, show me the Front Door” or “Okay Google, show me the Doorbell” will bring up the feed.)</li></ul><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FfeVDf4uNJ5GR-48iWmO0u7_fdM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262922/jtuohy_220216_5036_0003.jpg\">      <figcaption><em>The smart display will indicate which camera is being viewed as it pulls up the live feed.</em></figcaption>  </figure></div><ul><li id=\"OmrweR\">Once connected, tap the doorbell’s icon in the Home App. This is where you can turn off or on voice notifications for connected Google Nest speakers (if your doorbell is compatible),</li><li id=\"VfmblD\">You can now use voice commands to stream a live video and audio feed from your doorbell. Use the doorbell name and the name of the Google Nest display or Chromecast TV (i.e., “Hey Google, show my doorbell on living room TV”). If the display is voice-enabled, you can simply say “Hey Google, show the doorbell.” </li><li id=\"DxLWBL\">If you have a Google Nest doorbell, you will be able to speak to the visitor through the smart display, as well as see and hear them.</li><li id=\"M2nJKV\">To end the live view, say “Hey Google, stop.”</li><li id=\"V2XXJS\">If you want to view the camera without a voice command, swipe down from the top of the Google Nest display, tap Cameras, and select the doorbell.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OOjSRve85JWaWL9SXjSAV5Ie15w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262924/jtuohy_220216_5036_0005.jpg\">      <figcaption><em>A wall-mounted Echo Show 15 displaying video for a Ring Video Doorbell 4.</em></figcaption>  </figure><h2 id=\"EjAwnV\">Stream your video doorbell camera on your Amazon Echo smart display</h2><p id=\"jyRNSd\">A lot of smart video doorbells work with Alexa, and most (but not all) can use the <a href=\"https://www.amazon.com/s?k=echo+show&amp;i=amazon-devices&amp;crid=2TU2H3DYCKL7Q\">Echo Show family</a> (Echo Shows 5, 8, 10 and 15) and Fire TV-enabled televisions to view a live feed of your doorbell. Some well-known video doorbells that work with Amazon’s smart displays include those by <a href=\"https://www.theverge.com/22939350/eufy-dual-video-doorbell-review-price-release-date\">Eufy</a>, Arlo, Ring, Blink, and Wyze, among others. </p><ul><li id=\"SvIjMM\">Add your doorbell to the Alexa app on your phone or tablet. Go to Devices, select + in the top right corner, select Add Device, choose Camera from the list, and select your doorbell manufacturer.</li><li id=\"JbxteF\">Follow the onscreen instructions, which vary depending on the manufacturer, but should include linking an Alexa Skill and directing Alexa to Discover Devices.</li><li id=\"UM1tGR\">Once the device is discovered, go into your Devices list in the Alexa app, tap “Discovered Devices” at the top, and tap on the name of your new device.</li><li id=\"9TWn97\">Here you can edit the name and, if offered, turn on and off Motion Announcements and Doorbell Press Announcements. These use your Echo speakers to announce when there’s motion at your doorbell or when someone presses the button. You can also select which Echo devices make the announcements. </li><li id=\"ffJHaH\">Now you can view a live stream on your Echo Show or Fire TV device by saying, “Alexa, show [doorbell name].”</li></ul><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BdWmNzxvu_5I9Rse83KW7ShvbR4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262939/jtuohy_220222_5036_0015.jpg\">      <figcaption><em>An Echo Show 8 with a live stream from a doorbell in picture-in-picture and the smart home control panel open on the main screen.</em></figcaption>  </figure></div><ul><li id=\"XubbYL\">To stop the stream, say “Alexa, go home” or “Alexa, stop.”</li><li id=\"fYEkS0\">Some doorbell cameras, including those from Ring, have the option to talk to the visitor through the smart display by tapping on the mic on/off button on the display.</li><li id=\"LOfXVw\">If you don’t want to use your voice to view the feed, swipe down from the top of your Show device, tap Smart Home, and select your doorbell camera from the list.  </li><li id=\"d9yIJd\">The live feed will stay on the screen for a default amount of time (set by the camera manufacturer) — for most wired doorbell cameras, it’s about 30 minutes. (Tip: If you tap the live view, it will revert to Picture-in-Picture; from here, you can close the feed by tapping on the X.)</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kjTrVh0nkP6WtX8tMoC_iKHI2Tc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262928/jtuohy_220217_5036_0010.jpg\">      <figcaption><em>An Echo Show 10 with a live view of the Ring Video Doorbell 4. The microphone in the bottom left corner indicates you can talk to a visitor through the display.</em></figcaption>  </figure><h2 id=\"q6yEtd\">Have your Echo Show automatically display your Ring video doorbell feed</h2><p id=\"RCdeBl\">All <a href=\"https://www.theverge.com/22359973/ring-video-doorbell-pro-2-review\">Ring video doorbells</a> have the ability to automatically pull up a live feed on an Alexa smart display when the doorbell is pressed. </p><p id=\"z9kePy\">To enable this, navigate to your doorbell settings in the Alexa app, tap “Announcement Devices,” and select your desired display. The feature currently works on Echo Show devices and some newer Fire TVs. Now, when a visitor rings the doorbell a live video intercom will pop up on your smart display and you can see and talk to your visitor.</p><p id=\"JwI6a0\"></p><p id=\"OhB05K\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fADWJzytzX38mhlKWw3VtCIkBKs=/0x267:2040x1335/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262926/jtuohy_220217_5036_0008.jpg",
  "description": "See your porch on a bigger screen",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}