{
  "title": "How to create a signature for PDF documents on a PC ",
  "url": "https://www.theverge.com/22323097/pdf-signature-windows-pc-adobe-how-to",
  "date": "2022-05-09T15:40:50.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/AHVkxZFrbDlbQLGMzcYCx2L9ZnM=/0x567:1360x1474/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/68948215/akrales_220426_5143_0035.5.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"ALZBsW\">These days, more and more official papers are being turned into PDF documents. (PDF stands for Portable Document Format; it is a standard created by Adobe in the early 1990s that allows paper documents to be turned into exact digital copies.) In fact, hard copy paperwork is fast becoming the exception rather than the rule. However, even digital documents have to be signed. You can do it the long way — print those documents out, sign them, and then scan them back into your computer — or you can create a digital signature and place it directly on the PDF.</p><p id=\"isjki5\">Windows doesn’t offer a built-in PDF signing feature <a href=\"https://www.theverge.com/22321383/signature-pdf-mac-pdf-how-to-preview\">the way a Mac does</a>. However, you can use Windows’ built-in browser, Microsoft Edge, to sign a PDF document. There are also third-party apps you can download that will give you the same ability. </p><p id=\"Z7Ufzw\">In this article, I’ll first go over how to use Edge to add a signature, and then I’ll do the same using Adobe Acrobat Reader DC, which is Adobe’s free PDF reader. </p><h2 id=\"48UahT\">Use Microsoft Edge to create a signature</h2><ul><li id=\"XaiP5q\">Find your PDF file in the file manager. Right-click on the file and open it using Microsoft Edge.</li><li id=\"SWoqip\">The file will open in Edge’s PDF reader. Click on the Draw icon (it looks like a pencil facing downward).</li><li id=\"QRckNJ\">If you’ve got a touch screen, it will automatically enable the Draw with Touch option (the icon looks like a hand)</li><li id=\"QSXp8u\">Use your cursor (or, if you’ve got a touch screen, your finger) to sign the PDF, and then save the document.</li></ul>  <figure class=\"e-image\">        <img alt=\"You can sign a PDF in Edge, but you can’t save your signature.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CliD63oM5Q0McFJa_BSdzTsDbV0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22982850/Screenshot__133_.png\">      <figcaption><em>You can sign a PDF in Edge, but you can’t save your signature.</em></figcaption>  </figure><p id=\"TrnRXm\">While this is a good, quick way to sign a PDF document, it means you have to go through the same process every time. It would be a lot simpler if you could simply pop your signature into the document.</p><p id=\"pecqMl\">One way to do this is to write a signature, photograph it, and download it as a PDF or graphic file. </p><h2 id=\"HKFLZW\">Use Adobe Acrobat Reader DC to create a signature</h2><ul><li id=\"SgeMF3\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fget.adobe.com%2Freader%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22323097%2Fpdf-signature-windows-pc-adobe-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Download Adobe Acrobat Reader DC</a>. Adobe has the unfortunate tendency to encourage people to download excess apps, so make sure you uncheck all the additional installations that may pop up on the page: in my case, it was two McAfee apps and Acrobat’s Chrome extension. (You can install this last one later if you think it might be useful.) </li><li id=\"fyH4Ve\">After you click on “Download Adobe Reader,” you can start the install by clicking on the downloaded .EXE file.</li></ul>  <figure class=\"e-image\">        <img alt=\"It’s a good idea to uncheck Adobe’s promotional offers before downloading Acrobat Reader\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/niGsIsy1D5YvmE7KouzVOkm-ru0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22360298/adobe1___Copy.png\">      <figcaption><em>It’s a good idea to uncheck Adobe’s promotional offers before downloading Acrobat Reader.</em></figcaption>  </figure><p id=\"IgaRQ4\">Once it’s installed, Acrobat Reader will open. There will be a list of any PDFs you may have recently opened. If the file you want to use is among them, highlight the file. On the right, there should now be a column with a thumbnail of the document, along with several functions, one of which will be <strong>Fill &amp; Sign</strong>. Select that, and your document will open within the Fill &amp; Sign feature.</p>  <figure class=\"e-image\">        <img alt=\"Click on “Fill &amp;amp; Sign” and then on “Select a File” to choose a PDF file to work on. \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/854NWSY_k8elQZvVSYH6tDAZa9Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22982492/Screenshot__121_.png\">      <figcaption><em>Click on “Fill &amp; Sign” and then on “Select a File” to choose a PDF file to work on. </em></figcaption>  </figure><ul><li id=\"71mubA\">If the file is not there, go to the left-hand menu and click on <strong>My Computer</strong> to find the PDF file you want to sign, and double-click it to move it into Acrobat’s editing window.</li><li id=\"R3cvjj\">Look to see if there is a small “Ab” next to your cursor. If not, find the <strong>Fill &amp; Sign</strong> icon on the lower right (it looks like a pencil) and make sure it is highlighted. </li><li id=\"Mh7hgo\">Once activated, click where you want the signature to appear; you’ll see a small box that will let you sign by typing your name into your form.  (if there is a line for a signature anywhere in the document and you click near it, the box will automatically align with the line. </li><li id=\"j44JO2\">If you want to sign by actually drawing your signature or save a typed or drawn signature, tap on <strong>Sign yourself</strong> just above the main screen.</li></ul>  <figure class=\"e-image\">        <img alt=\"Select “Add Signature.” Once you’ve saved your signature, it will appear on this drop-down menu.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lImQxdduh6w81mRdMHEHpwnt25I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22982506/Screenshot__126_.png\">      <figcaption><em>Select “Add Signature.” Once you’ve saved your signature, it will appear on this drop-down menu.</em></figcaption>  </figure><ul><li id=\"JdYWBB\">You will have the option to <strong>Add Signature</strong> or <strong>Add Initials</strong>. For now, click on <strong>Add Signature</strong>.</li><li id=\"EdgQjv\">A pop-up window will give you three ways to sign your document: type your name (Adobe supplies you with several handwritten-looking fonts), draw your signature (either using your touchpad or directly on a touchscreen), or upload an image of your signature. Make sure <strong>Save signature</strong> is checked if you don’t want to have to write it again.</li></ul>  <figure class=\"e-image\">        <img alt=\"There are several ways you can create a signature\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HGmXg75kGQyZue77CYS5TfEVabI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22360374/adobe7.png\">      <figcaption><em>There are several ways you can create a signature.</em></figcaption>  </figure><ul><li id=\"ImiYmj\">Once you’ve hit <strong>Apply</strong>, your PDF document will be back. Place your new signature where you want it on the document and left-click. You can then change the size or placement of the signature if you wish.</li></ul>  <figure class=\"e-image\">        <img alt=\"Now place your signature where you want it.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lAy1LTw9E94MjePMZFsXxhfX6wI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22982513/Screenshot__129_.png\">      <figcaption><em>Now place your signature where you want it.</em></figcaption>  </figure><p id=\"ldRjRL\">And you’re done! Now, if you want to add your signature to a PDF, just open your document using Adobe Acrobat Reader and click on the <strong>Sign yourself</strong> icon. You can then select your saved signature and place it where you need it on your PDF document. (The <strong>Add Initials</strong> option works just the same but gives you less space, so you can only add initials.) If you want to change your signature, just click the minus sign next to the signature and try again.</p>  <figure class=\"e-image\">        <img alt=\"Your signature is now available whenever you need it.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/F8nuPxlBO8ti2jgE7a3pCbIoOH0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22982516/Screenshot__131_.png\">      <figcaption><em>Your signature is now available whenever you need it.</em></figcaption>  </figure><p id=\"IZA5PB\">Adobe has also made available <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.adobe.com%2Facrobat%2Fonline%2Fsign-pdf.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22323097%2Fpdf-signature-windows-pc-adobe-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">an online app</a> that allows you to fill and sign a PDF. Bring it up in your browser and either drag and drop a PDF into the window or click on the <strong>Select a file</strong> button. At that point, you will be asked to either sign in or register with an Adobe, Facebook, Apple, or Google account. You can then either type in or sign your document the same way as you would the desktop app.</p>  <figure class=\"e-image\">        <img alt=\"Adobe’s online signature tool\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lzj5kHuS48AyKDniulelyWMBYAg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448090/Screenshot__288_.png\">      <figcaption><em>The online version of Adobe’s Fill &amp; Sign is very similar to the app.</em></figcaption>  </figure><h2 id=\"bLvagz\">Other options</h2><p id=\"ojzgTu\">Adobe Acrobat Reader DC is not the only app that you can use to read and / or edit a PDF document for free, although there are fewer alternatives out there than there used to be. For example, <a href=\"https://www.signwell.com/\">SignWell</a> lets you sign up to three documents a month free of charge. Adobe Reader doesn’t have any limitations on your ability to sign documents, but if you want to create a PDF or export it to another format, you’ll have to get the Pro version.</p><aside id=\"01pJvJ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to create a signature for PDF documents on a Mac\",\"url\":\"https://www.theverge.com/22321383/signature-pdf-mac-pdf-how-to-preview\"},{\"title\":\"How to create a PDF file \",\"url\":\"https://www.theverge.com/22321091/pdf-adobe-how-to-create-mac-windows\"}]}'></div></aside><p id=\"wlpCD1\"><em><strong>Update May 9th, 11:40AM ET:</strong></em><em> This article was originally published on March 11th, 2021. On November 3rd, 2021, directions on how to sign a PDF using Microsoft Edge were added. More recently, some of the directions of the Adobe app have changed, several free alternatives have disappeared, and a description of the online Adobe app has been added.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4TaNsxZ5aNt2cF62JTgjMH8NdDA=/0x664:1360x1376/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23422509/akrales_220426_5143_0035.jpg",
  "description": "Adobe’s free Acrobat Reader for Windows PCs can create PDF signatures.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}