{
  "title": "How the new Pixel Buds Pro measure up to Google’s A-Series earbuds",
  "url": "https://www.theverge.com/23065279/google-pixel-buds-comparison-a-series-vs-pro-specs-price",
  "date": "2022-05-11T21:07:03.000Z",
  "author": "Sheena Vasani",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/aa0bkYKDML9TnvnyqUJIaAOlA9w=/45x0:1995x1300/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70858477/BudsLifestyle.0.jpg\" />        <figcaption><em>Google’s new Pixel Buds Pro sell for $199, while the Pixel Buds A-Series go for $99.</em> | Image: Google</figcaption>    </figure>  <p id=\"d67Yj7\">During its annual developer conference, Google I/O, Google announced a new pair of true wireless earbuds, the <a href=\"https://www.theverge.com/e/22829145\">Pixel Buds Pro</a>, which will be <a href=\"https://store.google.com/us/product/pixel_buds_pro?hl=en-US\">available for preorder starting on July 21st</a> and in stores on July 28th. The new Buds Pro offer more features than last year’s Pixel Buds A-Series, however, at $199, they’re also twice the price. So are they worth the extra cost or should you stick with the entry-level $99 Pixel Buds A-Series?</p><p id=\"sfJBQe\">To give you a better idea of which might be a better fit for you, we’ve compared the features and specs of both models. Note that <a href=\"https://www.theverge.com/22465651/google-pixel-buds-a-series-earbuds-review-features-price\">while we have reviewed the Pixel Buds A-Series</a>, we’ve not tested the Pixel Buds Pro as of yet. Hopefully, we’ll be able to get some hands-on time with the earbuds ahead of their launch this summer.</p><aside id=\"5Ga2Rc\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Google’s biggest announcements at I/O 2022\",\"url\":\"https://www.theverge.com/2022/5/11/23066583/google-io-2022-biggest-announcements-pixel-watch-6a-buds-tablet\"},{\"title\":\"Here’s when you can preorder Google’s new devices\",\"url\":\"https://www.theverge.com/2022/5/11/23067097/google-preorder-pixel-6a-watch-buds-pro-how-to-buy-price-release-date\"}]}'></div></aside>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XCWt7JSKYo9WltCc8Tv7f11ffb4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450454/PixelBudsPro.jpg\">      <cite>Image: Google</cite>      <figcaption><em>The Pixel Buds Pro come in more colors than the Pixel Buds A-Series.</em></figcaption>  </figure><h2 id=\"THYbdi\">Audio and voice</h2><p id=\"5jOerN\">Aside from the price, the fact that the Pixel Buds Pro offer active noise cancellation while the Pixel Buds A-Series don’t is perhaps the most significant difference between the two sets of earbuds. As a result, you can dull background noises with the Buds Pro — a feature that could help improve focus while working from home or let you drown out ambient noise while commuting. That could be a welcome change to some, given we found that the Pixel Buds A-Series don’t offer much in the way of passive noise isolation. </p><p id=\"Yntl5U\">The Pixel Buds Pro also feature an optional transparency mode for when you want to hear what’s going on around you or chat with someone, which is a feature the Pixel Buds A-Series lack. In addition, Google says the Pixel Buds Pro will support spatial audio head tracking later this year. The forthcoming update will make listening to select content feel more immersive, as the feature re-creates an experience similar to a surround-sound setup without the need for multiple speakers. The Pro also feature a new audio trick called Volume EQ, which will automatically adjust the tuning of the highs, mids, and lows as you change the volume.</p><p id=\"BNwbzA\">On paper — and according to Google — the Pixel Buds Pro should perform well on calls. Google says your voice should be clear regardless of where you are, thanks to noise suppression of background distractions like traffic and features like wind-blocking mesh covers. The Pixel Buds Pro also come with three microphones in each earbud. The Pixel Buds A-Series only offer dual beamforming mics in each, however, we found they still perform well on calls even while in noisy environments. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/z3CWAnAE-vIe0slq75QDJnkshnI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22555559/cwelch_20210528_4608_0007.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>The Pixel Buds A-Series can also connect to Android phones with Fast Pair.</em>  </figcaption>  </figure><aside id=\"Xg5MsF\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How do the new Google Pixel 6A’s specs stack up to the pricier Pixel 6 models?\",\"url\":\"https://www.theverge.com/23065263/google-pixel-phone-comparison-6a-vs-6-pro-5a-specs\"}]}'></div></aside><h2 id=\"wGYCVz\">Connectivity</h2><p id=\"SDvJdx\">Multipoint Bluetooth connectivity is also a feature only the Pixel Buds Pro offer. That means the earbuds can automatically switch between your last two connected devices, including laptops, TVs, tablets, and Android and iOS phones. However, no matter which you buy, both share the Fast Pair feature, so you can easily pair your Bluetooth devices with supported Android products. For the unfamiliar, Fast Pair makes it possible to turn on the buds near the device and pair them by simply tapping a notification that pops up. While both earbuds also work with iOS, they’re best used with Android devices, which can take advantage of their many features. That’s namely because there’s no Pixel Buds app for iOS that allows Apple users to adjust settings like EQ, no matter which pair you buy.</p><h2 id=\"VSjb9X\">Battery life and charging</h2><p id=\"FQmSZ7\">Battery life is another area where the Pixel Buds Pro outperform Google’s Pixel Buds A-Series — at least on paper. Google claims the Pixel Buds Pro charge wirelessly via the included charging case and provide up to 11 hours of continuous listening with active noise cancellation disabled or 31 hours with the charging case. However, when ANC is enabled, you’ll still be able to get seven hours. In contrast, the included case for the Pixel Buds A-Series lacks the ability to charge wirelessly and, instead, relies on USB-C. The latter earbuds also only offer up to five hours of listening time and only up to 24 hours with the case.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JprIbZQtLv-ZddaMR1ZD2rFk5Jc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451492/Pixelbudspro.png\">      <cite>Image: Google</cite>      <figcaption><em>The Pixel Buds Pro offer IPX4 water and sweat resistance.</em></figcaption>  </figure><h2 id=\"Xiq2no\">Design and fit</h2><p id=\"L0TBSH\">No matter which one you buy, you’ll have the choice of three sizes of ear tips — small, medium, and large — which come in the box for a better fit. However, it looks like, on paper, the Pixel Buds Pro offer a few more features to improve comfort. Google says it added new sensors to measure and relieve the pressure in your ear canal to increase comfort, which is a claim we have yet to test. The buds also sit deeper in your ear canal than the Pixel Buds A-Series.</p><p id=\"RWBW8G\">In terms of weight and size, the Pixel Buds Pro are slightly heavier and weigh 6.2 grams in comparison to the Pixel Buds A-Series, which weigh 5.02 grams. The new earbuds are also slightly bigger (22.33 x 22.03 x 23.72mm) as opposed to the Pixel Buds A-Series (20.7 x 29.3 x 17.5 mm).</p><p id=\"K8hL5C\">If color matters to you, the Pixel Buds Pro offer more variety, including black, blue, green, and red colorways. In contrast, the Pixel Buds A-Series are only available in either white or green. While they look similar, the Pixel Buds Pro seem to offer more microphone inlets around the exterior as well. However, neither offers swipe forward / back gestures for controlling volume, meaning you have to tap to do so, which is something we weren’t fans of while reviewing the A-Series.</p><p id=\"3JCTiJ\">On the durability front, the Pixel Buds Pro and Pixel Buds A-Series both offer IPX4 water and sweat resistance, which comes in handy if you work out often. Both also allow for hands-free “Hey Google” voice commands, so you can get directions, set reminders, or access music and messages without touching the phone via Google Assistant.</p><h2 id=\"ZXOgV4\">Google Pixel Buds Pro versus Google Pixel Buds A-Series</h2><p id=\"lkghj7\">Of course, this comparison is just an overview of some of the major differences between the two pairs of true wireless earbuds. If you’re curious about raw specs and want to dig deeper, you can explore some of the finer details in the table below.</p><div id=\"esf9HT\"><div data-anthem-component=\"table:11185284\"></div></div><p id=\"rN1rwm\"><em><strong>Correction May 11th, 8:58PM ET:</strong></em><em> An earlier version of this article stated that Volume EQ automatically adjusts the volume loudness of the Pixel Buds Pro based on your surroundings. This is incorrect; Volume EQ optimizes the frequency curve as you change volume to ensure a full sound. The other feature is known as </em><a href=\"https://support.google.com/googlepixelbuds/answer/9642077?hl=en\"><em>Adaptive Sound</em></a><em>, which the Pixel Buds Pro do not have. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8OabU_LiVgJVZKBa19TWhm8PxuE=/0x116:2040x1184/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23450375/BudsLifestyle.jpg",
  "description": "Google’s first noise-canceling earbuds are coming.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}