{
  "title": "How to clear up space on your iPhone when you’re running out of storage",
  "url": "https://www.theverge.com/22990011/apple-iphone-storage-full-clear-up-space",
  "date": "2022-03-28T17:38:53.000Z",
  "author": "Sheena Vasani",
  "content": "      <figure>      <img alt=\"The iPhone 13 Mini and iPhone 13\" src=\"https://cdn.vox-cdn.com/thumbor/gY97iIfU-tSvleu74EdiNakB0ys=/0x0:2002x1335/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70681486/vpavic_210916_4760_0240.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"L6CfeS\">Our iPhones are so much more than just phones. Sure, they’re where we store our photos, books, music, and movies, but they also have the apps we use daily for work, socializing, ordering groceries, transportation, managing finances, and even our health. Used for so many different things, it’s easy to quickly take up all of the phone’s storage — which can become a nightmare.</p><p id=\"mzinot\">But don’t panic. If you’re on the verge of running out of space, you’re not doomed, and you don’t necessarily need to delete every photo or upgrade your phone. Here we’ll guide you through nine things you can do to create space, many of which are free, quick, and easy. </p><aside id=\"sXiQXW\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple will reportedly sell the iPhone as a subscription service\",\"url\":\"https://www.theverge.com/2022/3/24/22994814/apple-iphone-hardware-subscription-bundle-report\"}]}'></div></aside><h2 id=\"wMJhPf\">First, figure out what’s eating up your storage</h2><p id=\"G35Qnk\">Check what’s taking up the most of the space on your iPhone by heading to <strong>Settings</strong>, clicking on <strong>General</strong>, and tapping <strong>iPhone Storage</strong>. There, you’ll find a helpful breakdown of the files, media, and apps eating up your space so you can start working on deleting accordingly. At a minimum, aim to delete at least 2GB of storage, so you’ll have space to install more apps and take photos.</p><div id=\"TKbUEN\"><div data-anthem-component=\"gallery:11112879\"></div></div><h2 id=\"Vi15Cd\">Back up your photos and videos with a cloud storage service</h2><p id=\"Iln5SG\">In all likelihood, you’ll soon find that photos and videos are gobbling up a good chunk of your space. If you don’t want to delete these forever, back up your photos and videos to a cloud storage service, like Apple’s iCloud (you can <a href=\"https://www.theverge.com/22673693/iphone-apple-backup-ios-icloud\">learn exactly how to do that here</a>). That way, you’ll still have copies of your memories safely stored away before deleting them from your iPhone. </p><p id=\"I1LnCK\">Be mindful, however, that while the first 5GB of iCloud storage is free, you’ll have to pay 99 cents every month for up to 50GB. There are also other, more expensive plans available if you need more space, which you can <a href=\"https://support.apple.com/en-us/HT201238\">learn more about here</a>.</p><p id=\"3OYtCP\">After you delete the photos, you should also be aware that the Apple stores pictures you deleted in the past 30 days are in the <strong>Recently Deleted</strong> folder in your Photos app — and will still be taking up space, so make sure you delete them there, too. You can do that by heading to the <strong>Albums</strong> tab and looking for <strong>Recently Deleted. </strong>Tap the <strong>Select</strong> button in the upper right corner and click on <strong>Delete All</strong>. </p><p id=\"AhAxHM\">You can also set up your iPhone so that it saves smaller photos while storing the original, larger resolution images in iCloud, thus saving space. Under <strong>Settings</strong>, head to <strong>Photos</strong> and make sure there’s a checkmark next to <strong>Optimize iPhone Storage</strong> to turn that option on.</p><aside id=\"2Bffs8\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to move all your data to your new iPhone\",\"url\":\"https://www.theverge.com/22671906/iphone-data-transfer-ios-icloud-upgrade\"},{\"title\":\"Google Photos updates its library and sharing tabs to make photos easier to find\",\"url\":\"https://www.theverge.com/2022/3/22/22990987/google-photos-update-library-sharing-tabs\"}]}'></div></aside><h2 id=\"8vkvL1\">Delete photos and videos you sent or received from others</h2><p id=\"h0GHse\">If you don’t have time to decide what to delete or back up to iCloud, and you just want a quick and easy way to start freeing up some space, head on back to <strong>Settings</strong>, tap on <strong>General</strong>, and click <strong>iPhone Storage</strong>. When you’re there, click on <strong>Review Large Attachments</strong>, which is located below the<strong> </strong>color-coded bar that shows how much storage apps, photos, the system, and other settings are taking up. Here, you’ll see a list of photos and videos you’ve sent or received in messages, which you can delete by placing your thumb on one, swiping to the left, and clicking the red <strong>Delete </strong>button.</p><p id=\"DcB3TK\">Prioritize getting rid of the first couple at the top, which will likely be videos, as those occupy the most amount of storage. In my experience, I have found that deleting these sometimes gives me just the bit more storage I need if I’m on the go and don’t have a lot of time to think through which apps, photos, or videos I really don’t need anymore.  </p><div id=\"MntUZ1\"><div data-anthem-component=\"gallery:11112756\"></div></div><h2 id=\"cMUOyT\">Get rid of old text messages</h2><p id=\"Lmm5uS\">On the topic of text messages, click on your <strong>Messages</strong> app and delete old conversations you don’t need anymore. Your iPhone can also automatically delete messages if you’d like. Just head to <strong>Settings,</strong> scroll down and tap on<strong> Messages,</strong> and then click on the <strong>Keep Messages</strong> option under <strong>Message History</strong>. There, you’ll be able to choose whether you’d like your phone to keep messages for 30 days, one year, or forever.</p><div id=\"dV1utt\"><div data-anthem-component=\"gallery:11114209\"></div></div><h2 id=\"mQwXM6\">Delete or offload apps you’ve not used for awhile</h2><p id=\"sq064o\">When you <em>do</em> have the time, you should definitely delete or offload apps you no longer want or use. Apple conveniently shows you the last time you used certain apps when you head to <strong>Settings</strong>, select <strong>General</strong>, and click <strong>iPhone Storage</strong>, so that can help make this process faster and easier.</p><p id=\"xTzDHy\">If you don’t want to lose data associated with the app, you can offload them instead. By doing that, your documents and data will still be available when you reinstall it. To offload, you just need to head back to <strong>Settings</strong>, click on <strong>General</strong>,<strong> </strong>and once again tap on <strong>iPhone Storage</strong>. Click on the app and select <strong>Offload App</strong>. </p><div id=\"cjPh7f\"><div data-anthem-component=\"gallery:11114346\"></div></div><p id=\"S5Cc3k\">While you’re at it, prevent your iPhone from running out of space in the future by heading to the <strong>App Store</strong> option under <strong>Settings</strong> and toggling on the <strong>Offload Unused Apps</strong> switch.</p><div id=\"y1fy15\"><div data-anthem-component=\"gallery:11114361\"></div></div><h2 id=\"w1idm6\">Add site links to your home screen instead of keeping apps</h2><p id=\"YSl7CZ\">Back in the day, when I had an ancient 32GB iPhone and constantly ran out of storage, I had no choice but to delete pretty much all of my apps. It made me realize there were a few I only used because they stored certain files I needed, like Google Drive. </p><p id=\"HtEpdw\">It dawned on me that I could instead just add links to the files I needed to my home screen, so I could access them as if they were apps instead. In fact, it was even easier and faster to access those files this way, rather than constantly opening up and digging through Google Drive for them. I started adopting this approach to other apps, too, adding links to news sites instead of using news apps, for instance, which saved me some space. </p><p id=\"aVa4zr\">So if there’s information you can easily look up on the web or with a Google search, you may want to consider adopting this approach. Just use your <strong>Safari app</strong> to head to the site, go to the bottom of the screen and click on the <strong>square icon with an arrow </strong>inside, then click on the <strong>Add to Home Screen</strong> option located towards the bottom of the list. Tap on <strong>Add</strong>, and then you should be able to find it somewhere on your screen.</p><div id=\"urZjh9\"><div data-anthem-component=\"gallery:11114381\"></div></div><aside id=\"NyPtB3\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to customize your iPhone’s home screen with widgets and app icons\",\"url\":\"https://www.theverge.com/21448712/customize-iphone-home-screen-app-icons-widget-ios14\"}]}'></div></aside><h2 id=\"affWQb\">Remove videos, books, and music stored on your phone</h2><p id=\"wP41Cc\">Sometimes what’s taking up the most amount of storage are the data and documents stored within an app on your phone. You can find out if that’s the case by once again heading to <strong>Settings &gt; General &gt; iPhone Storage</strong> and then clicking on an app. A page will appear that tells you how much space is taken up by both <strong>Documents &amp; Data</strong> and the <strong>App Size</strong> itself. That’s information you can use to, say, delete ebooks you’ve finished reading, close tabs in your browser, or remove specific podcast episodes you no longer need, as opposed to getting rid of the entire app itself. </p><div id=\"B7cqdn\"><div data-anthem-component=\"gallery:11114402\"></div></div><h2 id=\"wuWljX\">Clear your cache</h2><p id=\"XJnKA3\">Deleting apps, photos, and videos will free up a good chunk of your storage, but clearing your web browser cache can also give you a bit more space if you’re in a crunch. Just note you will be signed be out of websites if you go down this route. </p><p id=\"3fIMv1\">If you’re a Safari user, head over to <strong>Settings &gt; Safari &gt; Clear History and Website Data</strong> clear your cache. </p><div id=\"gc50mN\"><div data-anthem-component=\"gallery:11114421\"></div></div><p id=\"A09bAv\">There are a few more steps involved if you use Google Chrome. First, open up the browser and click on the three dots at the bottom. Tap on <strong>History &gt; Clear Browsing Data,</strong> where you’ll see a list of what you can clear. You’ll be able to select options that will let you delete browsing history, cached images and files, cookies and site data, saved passwords, and autofill data or you can delete everything. You can also delete your browsing history from the last hour, the last 24 hours, a week, the last four weeks, or from all time by clicking the appropriate option under <strong>Time Range</strong>. After you’ve made your selections, click <strong>Clear Browsing Data</strong> at the bottom.</p><div id=\"qWvgU7\"><div data-anthem-component=\"gallery:11114426\"></div></div><h2 id=\"ZdBwJk\">Use Snapchat to take photos</h2><p id=\"TAW7eD\">I rarely ever use Snapchat — I only use it as a second camera and private storage space. I downloaded it once while traveling because I was just about to run out of local space to take pictures. Thankfully, despite the fact my iPhone storage was technically full, I was able to use Snapchat to take and store both videos and photos since the app saves its Memories in the cloud. So if you’re on the go, this could be a good hack if you need to take pictures and don’t have the time to clear up space. </p><aside id=\"0ZpEsc\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to delete Twitter’s storage cache from your iPhone\",\"url\":\"https://www.theverge.com/2020/3/3/21163015/twitter-storage-data-cache-iphone-ios-delete-how-to\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/27VKu8-Ksg-_56gYnQl0K3SqZhI=/0x144:2002x1192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863273/vpavic_210916_4760_0240.jpg",
  "description": "Easy ways you can quickly declutter your iPhone",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}