{
  "title": "How to use AirDrop on Apple’s iPhone and iPad",
  "url": "https://www.theverge.com/23030163/airdrop-iphone-ipad-how-to-use-apple",
  "date": "2022-04-18T15:03:17.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yP15pWvS-nPVozukA29bwzAlmaQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70762339/akrales_190913_3628_0327.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"Xg0nAy\">Apple’s AirDrop is a hugely convenient feature for transferring photos, videos, documents, and other files between the company’s devices, including <a href=\"https://www.theverge.com/22684421/apple-iphone-13-mini-review\">iPhones</a>, <a href=\"https://www.theverge.com/22979828/apple-ipad-air-2022-review\">iPads</a>, and <a href=\"https://www.theverge.com/22981815/apple-mac-studio-m1-ultra-max-review\">Macs</a>. You can easily send something to a friend — or use AirDrop as a handy way of transferring files between your own products. </p><p id=\"WQDccs\">What’s great about AirDrop is its simplicity. Instead of trying to clumsily share files using Dropbox, Google Drive, or some other cloud storage, it’s an immediate transfer from one device to another that (in most cases) takes only seconds. </p><p id=\"cVu03q\">With AirDrop, Apple creates a peer-to-peer Wi-Fi connection between the two devices in an AirDrop exchange. These devices communicate directly and aren’t required to be using the same internet connection.</p><aside id=\"9MKNXb\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to use AirDrop on a Mac\",\"url\":\"https://www.theverge.com/23012088/mac-airdrop-apple-macos-iphone-ipad-how-to\"}]}'></div></aside><h2 id=\"5eKqxC\">TO USE AIRDROP, YOU MUST:</h2><ul><li id=\"zfoVxX\">Be near the person or device you want to share something with. </li><li id=\"6ZanHr\">Both parties must have Wi-Fi and Bluetooth enabled — you <em>don’t</em> have to be on the same Wi-Fi network, however — and have the Personal Hotspot feature switched off.</li></ul><h2 id=\"j5QIS6\">HOW TO SHARE WITH AIRDROP ON YOUR IPHONE OR IPAD:</h2><ul><li id=\"JttfzU\">When you’re in any app that has a file you want to send via AirDrop, tap the Share icon.</li><li id=\"sK2W9d\">Tap AirDrop. If you and the recipient have an iPhone 11 or later, you can point your iPhone in their direction to prioritize them in the list of nearby AirDrop users.</li><li id=\"Q1rNIh\">If you’ve got an older iPhone, you’ll see a list of potential AirDrop recipients that are within range. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jXgvwmzg1pBNVaeSIMNikimNtng=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397294/airdrop1.jpg\">  </figure><ul><li id=\"ZZ8ToS\">Known contacts appear in the People row. Select the person you want to share your file with. You’ll also see your own Apple gadgets in the Devices row. Choose one of those if you’re just trying to send something from one device to another. Nearby AirDrop users will show up in the Other People row.</li><li id=\"PbrliM\">The recipient will receive a notification with a preview of the content being shared. From here, they can accept or deny the file transfer. (Note that you won’t see this when sending files across your own Apple devices.)</li></ul><h2 id=\"04wOGg\">HOW TO RESTRICT WHO CAN REACH YOU WITH AIRDROP:</h2><p id=\"bjCJYN\">Some people get a kick out of sending memes — or more unwelcome, lewd content — to complete strangers with AirDrop. Thankfully, Apple gives you a few different options for limiting how easily you can be reached with the feature. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/u8Cl_-qe-XQd-iNQM2xAa78Rsdk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397281/airdrop.jpg\">      <figcaption><em>AirDrop settings are easily accessible from Control Center.</em></figcaption>  </figure><ul><li id=\"a5dwRE\">On either iOS or iPadOS, open Control Center and long-press on the Wi-Fi icon.</li><li id=\"xzB5hM\">In the next menu, select AirDrop.</li><li id=\"iiwfE3\">From here, you can choose to fully disable AirDrop, limit it to known contacts, or open up yourself to everyone nearby. If you choose “Contacts Only,” you must have the recipient’s Apple ID email address or phone number assigned to their contact info for them to appear in AirDrop.</li></ul>",
  "image": "https://cdn.vox-cdn.com/thumbor/pkXWXEfy9jiaTPWl_Cg61cGphuA=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19206341/akrales_190913_3628_0327.jpg",
  "description": "Share photos, videos, and other files in seconds.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}