{
  "title": "How to delete your Instagram account",
  "url": "https://www.theverge.com/22786305/how-to-delete-restore-instagram-account-web-app-temporarily-suspend",
  "date": "2022-02-08T22:25:10.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4KRVrxN_dx5jL4JDmZSptwcOqTs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70155416/acastro_190919_1777_instagram_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"PU0Ji4\">If you’ve made the decision to delete Instagram, whether because you’ve outgrown the need for a certain finsta or because its parent company <a href=\"https://www.theverge.com/2021/11/9/22773038/meta-detailed-targeting-ads-facebook-instagram-messenger\">Meta is courting controversy again</a>, doing so isn’t as quick or easy as it should be. Up until recently, it couldn’t even be done from within the Instagram app.</p><p id=\"GXkBWc\">Go ahead and take a moment to make an obligatory “I’m deleting Instagram” post if you’d like. After that, you have two ways you can go about it.</p><h2 id=\"ZnlHHx\">Deleting Instagram using the iOS or Android App</h2><p id=\"5kaerh\">The easiest way, of course, would be through the Instagram app on your phone, though currently, the option isn’t available for everyone. To check if it is, go to your profile, tap the hamburger menu in the top right, and select Settings. Then go to Account, and scroll down to the bottom of the menu. You may see a “Delete Account” button under the “Branded Content” button. </p><p id=\"nKzpIg\">If you have it, tapping on it will bring up a menu asking if you want to delete or disable your account — you can read more about those other options in the “Temporarily suspending your Instagram account” section of this how-to. Pressing the “Delete account” button will bring up a message saying that you can stop the deletion process by a certain date if you log back in. Tap the red “Continue deleting account button,” and the app will walk you through the rest of the process. </p><p id=\"67eIUR\">If you don’t have the “Delete Account” option, you can try it on the web, as follows.</p><h2 id=\"3Ytff4\">Deleting Instagram on the web</h2><p id=\"fupkMg\">If you can’t use the app to delete your account, you’ll have to follow these steps to ditch your account — they can be followed using either a computer or phone, as long as you’re using a browser.</p><ul><li id=\"gvs2T0\">First, you’ll have to go to Instagram’s special account removal request page, <a href=\"https://instagram.com/accounts/remove/request/permanent/\">which can be found here</a>, or by following the link in Instagram’s <a href=\"https://help.instagram.com/370452623149242/\">account deletion help article</a>. If you’re not logged into Instagram for the web (most people won’t be), you’ll have to enter your credentials. In fact, it’s very likely you’ll have to put in your password twice throughout the deletion process, so now’s probably a good time to make sure you know what it is.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uh9c-B37qHQe67LtRBNDZr1XaIc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23021933/Screen_Shot_2021_11_17_at_08.29.28.png\">      <figcaption><em>Instagram will clearly show you what account you’re about to delete, and ask you why.</em></figcaption>  </figure><ul><li id=\"zM0tgA\">You should end up on a page with the old Instagram logo and a dropdown asking you why you want to delete your account. Depending on which option you choose, you may be shown various links to Instagram’s help center promising to fix your issues or a message helpfully reminding you to check which account you’re deleting. </li><li id=\"NmkzRk\">Whichever you pick, there’ll be a box below the links that asks you to reenter your password. After you do, tap or click the button that says “Delete (your account name),” and confirm that you’re sure.</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XgRtnT6Doz5Bz_o0BuV0wIIHOV8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23021908/Screen_Shot_2021_11_17_at_08.29.59.png\">      <figcaption><em>Tapping the delete button after entering your password will give you one last confirmation pop-up.</em></figcaption>  </figure><p id=\"6Mvlqk\">As Instagram says a few times on the account deletion page, your data won’t be immediately erased — Meta will keep it around for 30 days. But your profile and posts will be hidden on the site.</p><p id=\"8KTPKH\">If you’re completely breaking up with Instagram, don’t forget to remove the app from your phone as well. Doing so will save you a little space and will also put a little bit of friction between you and signing back up for the service.</p><h2 id=\"M73fM8\">How to un-delete your Instagram account</h2><p id=\"jSovZG\">Be aware that you won’t be able to bring your account back if it’s been over 30 days since you asked Instagram to delete it. You’ll have to recreate your account (your username will be freed up after your account’s deleted, but it’s possible someone could’ve taken it).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sJMjMbjXaV2KREIEB_LNHpZIXYY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23021936/Screen_Shot_2021_11_17_at_08.34.26.png\">      <figcaption><em>You can restore your account within 30 days by logging back in.</em></figcaption>  </figure><p id=\"X7znk6\">However, if you’re within that 30-day time period, you can get your account back, along with its posts and DMs. To do so, simply go back to Instagram and log in with your credentials. You’ll see a message saying that you requested your account be deleted, along with the date your data will be gone. To keep that from happening, just press the “Keep Account” button.</p><h2 id=\"dsYjWz\">Temporarily suspending your Instagram account</h2><p id=\"5K7FJt\">If you want to remove your account from public view, but don’t want to permanently delete all your photos and messages, you can suspend your account instead.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lqzlKmWmRn0El9bl-HzDsx-jnJ8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23021984/IG_Suspend_Account.gif\">      <figcaption><em>The screen to suspend your account is relatively easy to access, but you’ll have to do it through a web browser.</em></figcaption>  </figure><p id=\"EVZr6c\">Again, Meta makes you use the web version of Instagram, instead of the app, but at least you won’t have to get a link from a help article. </p><ul><li id=\"wXlcLh\">After logging into Instagram.com, go to your profile and click the Edit Profile button (if you’re using a mobile browser, you’ll have to tap the settings cog to get the option).</li><li id=\"EaspiW\">From there, go to “Edit Profile”&gt; “Temporarily disable my account” (it’ll be an option at the very bottom). As with deleting your account, you’ll have to select a reason why you’re suspending your account, and put in your password. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NZtuYJFC0UDwGIfrCizFESpAmIc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23021966/Screen_Shot_2021_11_17_at_08.40.08.png\">      <figcaption><em>Instagram’s “Temporarily disable account” screen.</em></figcaption>  </figure><p id=\"mKFdXV\">To re-enable your account, simply log back in using the app or the website. You’ll only be able to suspend your account once a week, so if you accidentally log back in your profile, your posts will be back online and visible to followers, at least for a little while. </p><p id=\"vfknlE\"><em><strong>Update February 8th, 2022, 5:25PM ET:</strong></em><em> </em>This article was originally published November 17th, 2021. Updated to add instructions for deleting your account through the app.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AhEDh8cXLzPzD8FmGa8EbJmzzbs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19228500/acastro_190919_1777_instagram_0001.0.jpg",
  "description": "It may be the only time you use Instagram on the web.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}