{
  "title": "How to use Twitter’s content warnings when sharing sensitive images",
  "url": "https://www.theverge.com/23009802/twitter-content-warning-violence-sensitive-content-nudity-how-to",
  "date": "2022-04-04T15:08:26.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/fcEyI0YieEa73K9Gs0Geold352s=/0x0:1170x780/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70707996/IMG_2190.0.jpg\" />        <figcaption><em>An example content warning.</em> | Image: Twitter</figcaption>    </figure>  <p id=\"nkD6wT\">As Russia’s war with Ukraine continues, horrific images are starting to emerge of the civilian casualties of President Vladimir Putin’s invasion. Images of bodies lying in the streets or inside shelled-out homes have been widely shared on Twitter, in addition to being published in major news outlets. </p><p id=\"aCuv4C\">When shared sensitively, such images can shed new light on the horrors of war and galvanize support for the people who need it. They can also provide important contributions toward documenting what’s happening in conflict areas. But as fact-checking and open-source intelligence group <a href=\"https://www.bellingcat.com/resources/how-tos/2018/10/18/prevent-identify-address-vicarious-trauma-conducting-open-source-investigations-middle-east/\">Bellingcat notes</a>, repeated exposure to such graphic imagery can contribute to a sense of secondary trauma. <a href=\"https://www.poynter.org/ethics-trust/2019/good-editors-must-be-thoughtful-when-showing-readers-hard-truths-like-photos-of-dead-bodies/\"><em>Poynter</em> argues</a> these images should be shared with care, and the National Association of Hispanic Journalists previously described the decision of <em>The Associated Press </em>to share a sensitive image via its Twitter feed as “<a href=\"https://nahj.org/uncategorized/nahj-condemns-exploitation-of-deceased-family-at-the-border/\">exploitative and dehumanizing</a>.”</p><p id=\"FkAbRp\">One compromise is to use a recently released Twitter feature that allows you to <a href=\"https://www.theverge.com/2022/2/25/22951334/twitter-sensitive-content-warning-individual-tweet-update-ios-android-web\">tag sensitive imagery</a>, which hides it behind a warning about its content. Here’s how to use it:</p><div id=\"Xyrj1T\"><div data-anthem-component=\"gallery:11127872\"></div></div><ul><li id=\"m9KMel\">Add a photo or video as you would normally. </li><li id=\"adBlsf\">On mobile, tap anywhere on the photo or video to open its editing menu. The paintbrush icon on the bottom right does the same thing. On the web, you can use the edit button on the bottom right of an image. </li><li id=\"JWeWtp\">From this editing menu, tap the flag icon on the bottom right on mobile or top right on the web. </li><li id=\"cX5aMP\">Select which content warning best describes the imagery: <strong>Nudity</strong>, <strong>Violence</strong>, or <strong>Sensitive</strong>. Twitter allows you to select more than one category at a time. Select <strong>Done</strong> on mobile. </li><li id=\"i1qLea\">Select <strong>Save</strong> from the top right of the editing menu. </li><li id=\"bXrcTD\">Publish the tweet.</li></ul><p id=\"xlMDHE\">There’s no simple answer for how and when images depicting the horrors of war should be used. But content warnings like these — which have long been used in other mediums like TV to warn when reports contain upsetting content — can help viewers prepare themselves for what they’re about to see. </p><p id=\"VktDMc\">Please note that there’s also some imagery that Twitter deems too extreme to be allowed on its platform at all. Its support page notes that it <a href=\"https://help.twitter.com/en/rules-and-policies/contact-twitter-about-media-on-a-deceased-family-members-account\">doesn’t allow</a> “images or videos where a reasonably identifiable person is clearly deceased.” It also prohibits the sharing of images or videos where people are shown dying or where images are shared for “sadistic purposes.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FiFvbhgyiYL58KozqLLt9civ1FQ=/0x84:1170x697/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366138/IMG_2190.jpg",
  "description": "Options for \"violence,\" \"sensitive content,\" and \"nudity\" are available.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}