{
  "title": "How to use your iPhone’s Back Tap feature",
  "url": "https://www.theverge.com/23058569/iphone-back-tap-how-to-ios-14-iphone-8",
  "date": "2022-05-05T18:16:55.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"The iPhone 13 Pro Max battery lasts a very, very long time. Screen-on time can clear 10 hours.\" src=\"https://cdn.vox-cdn.com/thumbor/85LXb96U_Zq0OJeNtsTrwtZYjkU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70836493/akrales_210917_4760_0331.0.jpg\" />        <figcaption><em>All recent iPhones — dating back to iPhone 8 — can take advantage of the Back Tap feature.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"LzpsPA\">Back Tap is one of the easiest ways to put an iPhone function you use all the time literally at your fingertips. It is exactly what it sounds like: a way to access different phone features by tapping the back of your phone — kind of like an extra, user-customizable button. It was <a href=\"https://www.theverge.com/2020/6/23/21300157/ios-14-hidden-feature-back-tap-accessibility-custom-commands\">introduced with iOS 14</a>, and the feature works on devices as old as the iPhone 8, which was launched five years ago — so it’s highly likely that you’ve got a compatible phone. </p><p id=\"WGHTFP\">Here’s how to set up Back Tap. For reference, I followed these steps on an iPhone 13 Pro Max running iOS 15.4.1.</p><ul><li id=\"hKE3sC\">Go to <strong>Settings &gt; Accessibility &gt; Touch &gt; Back Tap</strong></li><li id=\"Ky2esX\">Choose <strong>Double Tap</strong> or <strong>Triple Tap </strong>to set a custom function for those gestures</li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0zZcMvmWQgO0Q0lsoQepU5LJV7k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440431/IMG_1908.jpg\">      <figcaption><em>Scroll down find Back Tap in the touch menu options.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xk6HV9AmO3J3jpPfURvWUH1rpwo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440432/IMG_1909.jpg\">      <figcaption><em>There are a wide range of system functions you can assign to Back Tap.</em></figcaption>  </figure></div></div></div><h2 id=\"Kq2MB4\">What you can do</h2><p id=\"2L4IpF\">For either double or triple tap, you have a lot of options — too many to list here. For starters, you can assign any of your shortcuts to Back Tap, which opens up a bunch of possibilities. You can tap the back of your phone to order your afternoon Flat White from your neighborhood Starbucks, start your daily Spanish lesson in <em>Duolingo</em>, or send a text to someone in your contacts. There are <a href=\"https://www.theverge.com/2018/10/25/17871898/siri-shortcuts-ios-12-iphone-apple-how-to-best-tips-tricks-search\">tons of things you can do with shortcuts</a> and, in turn, tons of things you can do just by tapping the back of your iPhone.</p><p id=\"R6BZaB\">In addition to shortcuts, here are some of the other ways you can customize Back Tap:</p><ul><li id=\"0jmcRL\">You can access system functions like launching the camera, turning on your flashlight, taking a screenshot, or muting your phone. These are all great candidates for quick access.</li><li id=\"DvkPGe\">There are accessibility options, too. You can use Speak Screen to have Siri read on-screen text, Magnifier to use your phone’s camera as a magnifying glass, or Background Sounds to play white noise. </li><li id=\"AcQzf0\">You can also scroll up or down by assigning those functions to Back Tap.</li></ul><p id=\"68cvEq\">Back Tap can also launch your Accessibility Shortcut. This is another customizable feature in the accessibility menu that assigns one (or several) accessibility features to launch when you triple-click your phone’s side button. If you like, you can also assign these features to Back Tap — you’ll just need to set it up separately. Here’s how to do that:</p><ul><li id=\"Fuquyf\">Go to <strong>Settings &gt; Accessibility </strong></li><li id=\"6HeGxw\">Scroll down to the <strong>General</strong> section and tap <strong>Accessibility Shortcut</strong></li><li id=\"0fUl7T\">Tap the options you want to assign to the shortcut</li></ul><p id=\"5zhKjo\">If you have multiple functions assigned, a menu will pop up, prompting you to pick one when you launch Accessibility Shortcut, either by triple-clicking the side button or using Back Tap. You can change the order they appear in, too — when selecting your accessibility functions, long press the three bars to the right of each option to move them higher or lower in the list. </p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/u82ukrxC9LpEMnmyTE6iH78BbdQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440435/IMG_1910.jpg\">      <figcaption><em>Multiple functions can be assigned to the Accessibility Shortcut.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ktvdsv2LKPiaHeINNkJ6KBvIxLo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440436/IMG_1911.jpg\">      <figcaption><em>The functions you select will appear in a menu when you launch Accessibility Shortcut.</em></figcaption>  </figure></div></div></div><p id=\"XD3Iko\">Some of these options can be assigned directly with Back Tap, but there are additional functions you won’t find there, like the ability to increase screen contrast and turn on voice control.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jtJlixvNM2zkTfs_3Mj-lbDgcxo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863261/akrales_210917_4760_0331.jpg",
  "description": "The best feature on your iPhone that you’re not using",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}