{
  "title": "How to turn on Facebook Protect",
  "url": "https://www.theverge.com/22965320/facebook-protect-how-to-security",
  "date": "2022-03-07T15:13:11.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mNEEezm8Jwt3_CgSmh-m9bF0Pb0=/280x0:2383x1402/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70588897/Screen_Shot_2022_03_07_at_9.06.17_AM.0.png\" />    </figure>  <p id=\"STzsuX\">Last weekend, I was scrolling through my email, listening to the rain and wondering whether I was feeling too lazy to vacuum the rug, when I came across one with the subject line “Turn on Facebook Protect.” </p><p id=\"h39Enz\">“Your account requires advanced security from Facebook Protect,” it said and proceeded to tell me that if I didn’t enable Facebook Protect by a certain date, I would be locked out of my account until I enabled it. I was instructed to click on the big blue button labeled “Turn on Facebook Protect” to get started.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yQpL50seaEHLDJ6bHOLhe_xLiPc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23294821/Screen_Shot_2022_03_07_at_8.39.37_AM.png\">  </figure><p id=\"jqYP34\">I was sure it was a phishing email. Until I found out it wasn’t.</p><p id=\"o65GAK\">It turned out that <a href=\"https://www.facebook.com/help/1052552578831700\">Facebook is pushing higher security</a> for “certain people in the public eye,” and so is encouraging those on its list to adopt better security methods such as two-factor authentication. The company’s interpretation of “public eye” seems to be rather generous — for example, I, and several colleagues of my <em>Verge</em> colleagues who received it, don’t have particularly high Facebook followings. But this is not a bad thing, and if you happen to fall into Facebook’s interpretation of somebody who qualifies for this program and you receive an email from “security@facebookmail.com,” you can be pretty sure it’s legit.</p><p id=\"GgecJy\">If you do get one but don’t want to press on mysterious blue buttons, you can start the process this way:</p><ul><li id=\"c6rqlh\">Go to your Facebook page. (You may get a pop-up notice about Facebook Protect.) </li><li id=\"8Wu9UK\">Click on the arrow in the upper right corner (desktop) or on the three-line “hamburger” icon (mobile)</li><li id=\"TU1kLC\">Select <strong>Settings &amp; Privacy</strong> &gt; <strong>Settings</strong></li><li id=\"hoka9V\">Select <strong>Security and Login</strong> (desktop) or <strong>Password and Security</strong> (mobile)</li><li id=\"tFWQV8\">Under <strong>Facebook Protect</strong>, you’ll see a note that “FaceBook Protect is Off.” Click on <strong>Get Started</strong> (desktop) or tap on the arrow (mobile)</li></ul><div id=\"5mi0u9\"><div data-anthem-component=\"gallery:11082047\"></div></div><p id=\"YgMNBp\">After that, just follow the directions. If you have a reasonably strong password and have already enabled 2FA, then you won’t have anything else to do; you’ll simply get a message that says that you’re all set. </p><p id=\"cXLzQx\">Incidentally, if you don’t get one of those emails and don’t see “Facebook Protect” in your Facebook security area, <a href=\"https://www.theverge.com/22215571/factor-authentication-2fa-apple-microsoft-google-how-to\">you can still enable 2FA</a> in the “Security and Login” or “Password and Security” sections — it’s a good idea for everyone. </p><p id=\"Vq8ZdM\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/aFWA3nFozgnFY2rd7nAruawgDG4=/0x4:2662x1398/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23294824/Screen_Shot_2022_03_07_at_9.06.17_AM.png",
  "description": "The process is quick and easy — and a good idea.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}