{
  "title": "How to opt out of Venmo’s new arbitration clause",
  "url": "https://www.theverge.com/23040916/venmo-arbitration-class-action-sue-how-to",
  "date": "2022-04-25T18:52:27.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"Venmo stock\" src=\"https://cdn.vox-cdn.com/thumbor/f2DDWs8tz_v46BJeESwMPn2gifU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70791708/venmo1_2040.0.0.jpg\" />        <figcaption>Image: Venmo</figcaption>    </figure>  <p id=\"20RNmS\">If you use the Venmo app, you probably recently received an email explaining that the company is making changes to its user agreement — including a fairly onerous arbitration clause that, among other things, has you agree that you will not become part of any kind of class action suit. You can opt out of it, but it’s not easy.</p><p id=\"oMw1AZ\">We’ll tell you how you can opt out — but first, a little info about arbitration clauses.</p><p id=\"6r3Zj1\">Arbitration clauses have become extremely popular in agreements between companies and consumers. (For example, here’s a 2019 article explaining how to opt out of the arbitration clause that emerged when <a href=\"https://www.theverge.com/2019/8/20/20813800/apple-card-pay-arbitration-clause-goldman-sachs-credit-how-to-opt-out\">Apple added a credit card</a>.) It’s not surprising. When you agree to arbitration, you are basically putting most of the advantages in the company’s court. For example, most arbitration clauses deny you the opportunity to become part of a class action suit or to individually sue the company. Instead, an arbitrator (often chosen by the company) reviews the case and then makes a ruling that cannot be appealed.</p><div class=\"c-float-right\"><aside id=\"GGIdlb\"><q>Most arbitration clauses deny you the opportunity to become part of a class action suit </q></aside></div><p id=\"dESnFP\">And, in fact, this is exactly what the arbitration clause that Venmo is adding is meant to do. It certainly isn’t surprising that such a clause would eventually be added; PayPal, which owns Venmo, <a href=\"https://www.citizen.org/news/opt-out-of-paypals-forced-arbitration-clause/\">added a similar arbitration clause back in 2012</a>. Venmo <em>did</em> have an arbitration clause in its <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fvenmo.com%2Flegal%2Fus-user-agreement%2Ffebruary&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23040916%2Fvenmo-arbitration-class-action-sue-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">previous user agreement</a>, which included a class action waiver. However, the terms of that clause seem, on a lay reading, to be less onerous.</p><p id=\"3UTeqQ\">One thing to keep in mind: while many companies have added arbitration clauses to their user agreements, there has been some legal pushback; for example, <a href=\"https://casetext.com/case/szetela-v-discover-bank\">there have been cases</a> in which judges decided that arbitration clauses that forbid class action suits are “unconscionable and unenforceable” because the amount that an individual could sue for would be so small that it would not be economically viable. </p><p id=\"jE5ksv\">All that being said, you may decide that you want to opt out of Venmo’s arbitration clause and retain your right to sue in court and / or to join in a class action suit if necessary. The directions of how to do so are laid out in <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fvenmo.com%2Flegal%2Fus-user-agreement%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23040916%2Fvenmo-arbitration-class-action-sue-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the new user agreement</a>; if you don’t feel like wading through the entire thing, here’s the short version of what you need to do:</p><ul><li id=\"AGEeEW\">Download and print out the <a href=\"https://help.venmo.com/hc/en-us/articles/360062640153\">Venmo Opt-Out Notice Form</a></li><li id=\"LUr7OA\">Fill out the entire form</li><li id=\"UKCxfZ\">Mail it (yes, the kind of mail with an envelope and a stamp) to: </li></ul><blockquote><p id=\"xVpiWR\">PayPal, Inc.<br>Attn: Litigation Department<br>Re: Venmo Opt-Out Notice<br>2211 North First Street<br>San Jose, CA 95131</p></blockquote><p id=\"qxPIjF\">Two notes: first, there is a time limit here, which is laid out at the bottom of the form. In short, if you accepted the user agreement for the first time on or after May 23rd, 2022, then your form has to be postmarked up to 30 days after that date. If you’ve been a Venmo member for longer, you have until June 22nd, 2022. </p><p id=\"7OgTGh\">And second: if you want to be really sure, it’s probably a good idea not to just drop the form into the mailbox. Instead, send it so it can be traced or, even better, so somebody has to sign for it. This will cost more, but if you foresee yourself possibly needing to take Venmo to court anytime in the future (especially if you plan to use the service extensively), then it pays to be sure.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/aPHNmUhvmpFxXlPcQq2-ywRMMO4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6404477/venmo1_2040.0.jpg",
  "description": "Keep your right to sue Venmo, if necessary.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}