{
  "title": "How to decide which laptop to buy",
  "url": "https://www.theverge.com/22960434/laptop-buying-guide-how-to-price-specs-screen-ports",
  "date": "2022-03-04T18:20:14.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"The Gigabyte Aero 16 open on a black table. The screen displays The Verge homepage.\" src=\"https://cdn.vox-cdn.com/thumbor/6kazosdJOaT9hzp7DiROlDNWbrs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70579927/akrales_220228_5027_0124.0.jpg\" />        <figcaption><em>Here’s the Gigabyte Aero 16, an option for creators with deep pockets.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"eAaxZC\">The thing nobody tells you about working as a professional laptop reviewer is that everyone in your life who you are even somewhat acquainted with will, at some point, ask you what laptop they should buy. </p><p id=\"uQa8N6\">There are variations, of course. There’s “Which laptop should I buy for my son?” or “Which laptop should I buy for my sister?” or “Which laptop should I buy to start my podcast?” I’ve heard them all. I imagine most laptop reviewers on the internet can say the same. </p><p id=\"6mrLHO\">My answers are very often disappointing. I think people often expect that because I use these things for my job, I’ll be able to give them the perfect recommendation immediately. But — as I imagine many gadget reviewers will tell you — that’s much harder than you think. </p><p id=\"fhE9GO\">Here’s the reality: I spend all day thinking about what the best laptops are <em>for most people</em>. But the laptop that’s best for most people is not necessarily going to be the best laptop for you. That recommendation is going to depend on a ton of questions to which you know the answers much better than I do. </p><p id=\"nXHF5g\">Below, I’m going to give you an idea of how to approach the laptop-buying process. I really believe that if you’ve thought through all the variables I’ve outlined here, you shouldn’t have too much trouble finding a good product on your own. But if you are going to come to me (or a laptop reviewer you know, or an IT worker you know, or a tech-savvy person you know) asking what laptop you should buy, you <em>must </em>have definitive answers to these questions ready. Otherwise, we will not be able to help you. (Or, at least, not as well as we’d like to.)</p><p id=\"LVnam2\">Before we dive in, a quick note: this article is largely targeted towards shoppers who prefer to use Windows. If you prefer ChromeOS, much of this will also apply — I’ve noted a couple of places where Chromebooks might differ. If you’re looking for macOS, your only option is a MacBook, so you should just take a look at <a href=\"https://www.apple.com/shop/buy-mac/macbook-pro\">Apple’s options</a> directly.</p><p id=\"MVqmXQ\">Finally, I’m not recommending specific models here. If you’re looking for those, please take a look at our <a href=\"https://www.theverge.com/21250695/best-laptops\">Best Laptop</a>, <a href=\"https://www.theverge.com/22295181/best-gaming-laptop\">Best Gaming Laptop</a>, <a href=\"https://www.theverge.com/21296102/best-chromebooks\">Best Chromebook</a>, <a href=\"https://www.theverge.com/22652565/best-cheap-laptops\">Best Budget Laptop</a>, and <a href=\"https://www.theverge.com/21369381/best-student-laptops-school-high-college\">Best Student Laptop</a> articles. Those articles will be more helpful to you if you’ve thought through all of these questions first. </p>  <figure class=\"e-image\">        <img alt=\"The Asus ROG Zephyrus G14 on a green plush ottoman. The screen displays The Verge homepage.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XHABRfjQ1kF4JYFjj6jC2qsVZSc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250319/akrales_220215_5022_0181.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Here’s the Asus ROG Zephyrus G14, which gamers might consider.</em></figcaption>  </figure><h1 id=\"4Mim4M\">Price</h1><p id=\"GOAsw9\">Price range is <em>the most important </em>consideration when you decide what laptop to buy. If you come to me asking for recommendations but don’t know how much you’re able to spend, I’m a sitting duck. It’s fine if your price range is conditional (i.e., “I’ll go up to X for an OLED screen, but otherwise am capped at Y”), but you need to have a clear one. That price range will dictate your options going forward. </p><p id=\"EHEd9u\">The price for what generally would be considered a “nice” laptop has been steadily creeping up over the years. There are some reviewers who still consider $500 and below to be the “affordable laptop” line, but I’m personally starting to see the $800 mark as the point above which I expect laptops to be really, really great, with state-of-the-art build quality, top-notch performance, and no major flaws. That certainly doesn’t mean that every laptop above $800 has state-of-the-art build quality, top-notch performance, and no major flaws — but if that’s what you’re looking for, it’s the place to set your eye.  </p><p id=\"bCAych\">That said, it is worth noting that better-built laptops generally last longer. I know people who are still using <a href=\"https://www.theverge.com/2013/10/30/5044874/13-inch-macbook-pro-with-retina-display-review-2013\">MacBook Pro models from 2013</a>; I have a friend who has gone through two <a href=\"https://www.theverge.com/22632318/hp-pavilion-aero-13-2021-amd-review\">HP Pavilions</a> in the past four years. This isn’t to say that everyone needs to spend thousands of dollars on a notebook — it’s to say that a device that’s super cheap up front may not actually save you money in the long term. </p><p id=\"u6S3pt\">Given that, in most circumstances, I recommend that adults looking for a primary Windows driver stay above the $500 mark if they can afford it. That doesn’t mean you need to be spending $1,000 — there are plenty of well-built options between $500 and $1,000.</p><p id=\"I1fBBJ\">This is all different if you’re looking for something more specialized. For one, none of this applies to Chromebooks — most people should not be spending over $1,000 on a Chromebook in the current market. </p><aside id=\"9UScLv\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The best Chromebook for 2022\",\"url\":\"https://www.theverge.com/21296102/best-chromebooks\"},{\"title\":\"Best gaming laptop in 2022: seven laptops to get your game on\",\"url\":\"https://www.theverge.com/22295181/best-gaming-laptop\"}]}'></div></aside><p id=\"FLPSh8\">Gaming laptops also run more expensive. The fanciest ones cost many thousands of dollars. That said, if you don’t have very specific gaming laptop requirements and are fine with bumping down settings now and again, you shouldn’t feel like you need to spend over $1,500. If there are specific things you’re looking for (tons of RGB, special ports, QHD screen, etc.), add a bit onto the price for each feature.</p><p id=\"eMVQ25\">And business laptops are also in a higher price tier. Companies tend to have their own deals with manufacturers and are generally not paying sticker price. You will find some of the absolute nicest laptops on the market in the business category, but I generally recommend that consumers stay out of this sphere unless money is really no object or you have specific software needs. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0cz3dG3KlIOjWlmHgG4Z1S15NfA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23241973/akrales_220209_4997_0208.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Here’s the HP Spectre x360 16, a multipurpose premium driver.</em></figcaption>  </figure><h1 id=\"tMYZYw\">Screen Size</h1><p id=\"aCk6NQ\">Your main options are a 13-incher, a 15-incher, or a 17-incher. There are options above and below those sizes, but they’re unusual and have pretty specific audiences. </p><p id=\"14P4gV\">If you aren’t sure what screen size you need or are buying for a first-time laptop user, I would start with a 13-incher or a 14-incher. If you’ve used one of these before and it seems too small, or if you require more power than most 13-inchers can offer, a 15-incher is probably your move. These are generally geared more towards heavy use cases than 13-inchers, so you’ll likely see more powerful chips here at the expense of some efficiency and portability. </p><p id=\"DpFdXL\">I generally don’t recommend that most people get 17-inchers unless they have a specific use case where they need as large a screen as possible. There are some good options in that size category, but your selection will be much smaller than it would be in the 13-inch and 15-inch spheres.</p><p id=\"1vgRmb\">While we’re on the subject of displays, you should think about your aspect ratio. While some laptops do come in multiple aspect ratios, most are only available in one, so it’s best to have one in mind before you shop. An aspect ratio of 16:9 has been the most common one the past few years — it’s good for media viewing but can be cramped for productivity and multitasking. Aspect ratios of 3:2 and 16:10 give you a taller screen with more space. I’ve written <a href=\"https://www.theverge.com/2021/1/19/22238671/16-9-aspect-ratio-hp-elite-folio-dell-latitude-lenovo-thinkbook-plus-legion-7\">my in-depth thoughts on aspect ratios</a> elsewhere if you’d like to dive deeper into that.</p><p id=\"87AbYR\">Okay, now that you’ve figured out your size and price range, it’s time to start looking at some models. Look at up-to-date Best Laptop pages, check out what’s selling well on Amazon and the like, ask your friends what models they have. Once you’ve found a selection of products that you like the sound of, it’s time to pick your favorite. </p>  <figure class=\"e-image\">        <img alt=\"The MSI GE76 Raider open on a wooden table seen from the right. The screen displays The Verge homepage.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gpirITaiLMxI7I1oXq5dlImKpMg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23191838/akrales_220124_4985_0037.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The MSI GE76 Raider is worth considering if you’re gaming and you really need the best of the best.</em></figcaption>  </figure><h1 id=\"wa7l2h\">Specs</h1><p id=\"vRqBAL\">It is now time to reflect on why you’re buying a new laptop. More specifically, what’s not working about your current one? </p><p id=\"3xOOBI\">If your old driver is still working very well for everything that you need it to do, and your issue has to do with its chassis, you can probably get a new laptop with the most up-to-date versions of that laptop’s specs. (By specs, I largely mean the processor, the storage, and the RAM. You can find out what these are on your current model in Device Manager.) </p><p id=\"ZRHyyE\">Very briefly (and I’m simplifying quite a bit here — <em>Laptop </em>has <a href=\"https://www.laptopmag.com/articles/cpu-comparison\">literature for you</a> if you really want to get into the processor weeds), most people shopping in the consumer space will have the option of a Core i3, Core i5, Core i7, or Core i9 from Intel or a Ryzen 3, Ryzen 5, Ryzen 7, or Ryzen 9 from AMD. There are various chips of different names within each of those categories, but you don’t need to stress about that too much as a consumer. I generally recommend that people who aren’t sure what they need start with a Core i5 or a Ryzen 5. Those are sort of the default “This works fine” chips in each line. </p><p id=\"KDlcCk\">If there are tasks where your current laptop is falling short, that’s where you might need to upgrade. If it’s slowing down when you open too many Chrome tabs, you may want more memory. If things are generally sluggish, you should upgrade your CPU and storage. If your games look bad, look into better graphics. </p><p id=\"A1vFnI\">And look at how much storage space you’re currently using, which you can find in Storage Settings. If you’ve got a lot left, you can probably go for the same amount again; if you’re almost full and you think you’ll be downloading more stuff, think about getting more on your next model.</p><p id=\"HtldPK\">You should also think about connectivity here. Does your current system have any ports you never use? Are there things you wish you could plug in that you can’t? You may not be able to find a laptop with the exact ports you need, so prioritizing which ones you need the most will help. </p><p id=\"XU5f5d\">Dongles are, of course, a thing. Many companies that ship laptops with limited port selections will include dongles in the box. But as someone who has had to spend many hours using USB-C-only laptops, I assure you that dongles are still annoying. They can be hard to keep track of, and they’re an extra step in your day. That doesn’t mean needing to use them should be a dealbreaker; it’s just another thing to think about.</p>  <figure class=\"e-image\">        <img alt=\"A user navigates on the Lenovo Chromebook Duet 5 in a conference room.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Iqt2IARo8w8l78xibYl_ji7mX4k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23086474/akrales_211207_4906_0123.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Try the Lenovo Chromebook Duet if you’re on a tighter budget and like Chrome OS.</em></figcaption>  </figure><h1 id=\"Hvrssi\">Battery life</h1><p id=\"NgEiiJ\">At this point, you should have your selection narrowed down to a few choice models. Here’s where I’m going to ask you to read some reviews of those models. </p><p id=\"WdIbWE\">I know, I know, laptop reviews can be long and technical. You don’t need to read the whole thing, I promise — just Ctrl+F “battery life” and read that part carefully. You <em>need </em>to make sure you’re okay with the battery life a laptop can provide before you buy it. </p><p id=\"TMxB2i\">I know this is tricky because every review you read will have different battery results. I can tell you firsthand that it’s far from an exact science. Here’s my advice: Read a few reviews (I’d say at least three). If all the reviewers got more time to a charge than you think you’ll need, you’re good to go. If they’re all complaining about how terrible the battery life is, you should take a closer look. Take note of how each reviewer tested the laptop, the kind of tasks they did, the brightness and power profiles they used, and any other conditions. Pinpoint the reviewer whose process matches your typical conditions most closely. Assume you’ll get something roughly similar to their result. Figure out if that’s something you can live with. </p><p id=\"JyM4mP\">Once you’ve been through these steps, you can move on to even more specific criteria. How’s the audio? How are the microphones? How’s the customer service? Keep looking at more factors and comparing them to each other until you’ve narrowed your choice down to one. Good luck!</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dLw44s13J7tsByO3-dpapY0pqLw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23281081/akrales_220228_5027_0124.jpg",
  "description": "If you’re about to ask me which laptop to buy, read this first.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}