{
  "title": "How to buy a PlayStation 5",
  "url": "https://www.theverge.com/22777072/sony-ps5-playstation-5-console-where-how-to-buy-tips-restock",
  "date": "2022-02-11T18:32:21.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/aJ3igneIh2JMqWWTmeAUhrMGtR4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70498744/vpavic_4278_20201030_0041.0.jpg\" />        <figcaption><em>A year after launch, Sony’s PlayStation 5 remains (almost) as elusive as ever.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"5NBYdi\">While both the PS5 and PS5 Digital Edition have been available for more than a year now, supply hasn’t caught up with the massive demand for Sony’s next-gen consoles, namely due to the <a href=\"https://www.theverge.com/2022/2/2/22913870/sony-earnings-q3-2021-ps5-sales-vs-ps4\">ongoing global supply chain issues</a> that have impacted everything from cars to consoles. So, how are you supposed to get your hands on either system without resorting to the secondhand market — or worse — scalpers? After all, the consoles are often gone in a matter of minutes, regardless of when and where the restock takes place. </p><aside id=\"fmHy9d\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Why the global chip shortage is making it so hard to buy a PS5\",\"url\":\"https://www.theverge.com/2021/8/31/22648372/willy-shih-chip-shortage-tsmc-samsung-ps5-decoder-interview\"},{\"title\":\"Why the PS5 paywall isn’t worthwhile at Amazon, Walmart, or Best Buy\",\"url\":\"https://www.theverge.com/2021/11/19/22771984/ps5-restock-xbox-best-buy-walmart-amazon-subscription\"}]}'></div></aside><p id=\"TH9Doo\">Thankfully, there are ways to keep on top of restocks, which will increase your chances of securing the popular next-gen machine. And with a little patience, determination, and luck, you can still get a PlayStation 5 for the standard retail price instead of paying upwards of $800 to a reseller. We’ve rounded up a few tips below, many of which are the same strategies we at <em>The Verge </em>employ to keep you in the loop on a weekly basis.</p><hr class=\"p-entry-hr\" id=\"fwVora\"><h2 id=\"c0Z8Dx\">PlayStation 5 vs. PlayStation 5 Digital Edition</h2><hr class=\"p-entry-hr\" id=\"rndLk1\"><p id=\"D5J2dU\">There are currently two iterations of the PS5: the PS5 ($499.99) and the PS5 Digital Edition ($399.99). There is very little difference between the two — the Digital Edition just lacks the ability to play disc-based games. Both models still feature the same 825GB SSD, CPU, and GPU. There are some more granular differences, like power draw, but there is very little separating the two consoles. Given that the Digital Edition lacks a disc drive, it’s a little smaller and lighter than the $499.99 model.</p><hr class=\"p-entry-hr\" id=\"l7stXI\"><h2 id=\"hNTRg8\">Where is the best place to buy a PS5?</h2><hr class=\"p-entry-hr\" id=\"C8wEVY\"><p id=\"Sn5KNV\">Each retailer has a slightly different approach to how it handles restock events. Given the ongoing scarcity of Sony’s console, retailers have each adopted their own methods to circumvent bots and scalpers, which typically involve digitally queueing at a storefront and logging in with a specific account.</p><p id=\"I3cfJO\">Here, we’ve outlined how each of the major retailers currently handles console restocks, with some additional tips to help you with the ins and outs. In our experience, we typically see at least one restock per major retailer on a weekly basis, and these usually happen earlier in the day and rarely occur on the weekend. To help speed things up, we’ve also included a table that will take you directly to PS5 landing pages for each retailer.</p><div id=\"kUCdFU\"><div data-anthem-component=\"table:10861617\"></div></div><h3 id=\"peDGM0\">Amazon</h3><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wtYsskflXb8tyyToK41f7Og_5e0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23035272/Amazon.jpg\">      <cite>Illustration by Kristen Radtke</cite>  </figure></div><p id=\"JedYsP\">Currently, Amazon doesn’t have any special type of checkout system for the PS5, meaning consoles are available on a first-come, first-serve basis. Sometimes, they’re only available for Prime subscribers, while other restocks don’t have restrictions.</p><p id=\"Hl25Kj\">If you <a href=\"https://www.amazon.com/b/?ie=UTF8&amp;node=23572434011&amp;ref_=tt_dp_mn_hp\">sign up for notifications for Amazon’s Treasure Truck</a>, however, you’ll occasionally receive texts regarding PS5 restocks in addition to other offers. These notifications are typically a few steps behind the actual restock, however, they’re still worth looking into. While Amazon’s Treasure Truck was originally a physical truck that operated in select cities, it's now just the name Amazon uses to announce limited-time offers on its website. You don’t have to be an Amazon Prime member to take advantage of the deals, either, though keep in mind that Treasure Truck deals can sell out within a matter of minutes.</p><div id=\"6PltlK\"><div data-anthem-component=\"productcard:11024172\" data-anthem-component-data='{\"layout\":\"buttons_only\"}'></div></div><h3 id=\"5eHBVa\">GameStop</h3><p id=\"uT9UfH\">Gamestop is another solid option for snagging a PS5, one that hosts restock events both in-person and online. The in-person events are typically signaled a week or two in advance via the <a href=\"https://newsletter.gamestop.com/\">retailer’s newsletter</a>, with consoles distributed on a first-come, first-serve basis. Many of the events that take place online, however, require a subscription to <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=24348&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Fpoweruprewards%2F\" rel=\"sponsored nofollow noopener\" target=\"_blank\">GameStop’s PowerUp Rewards Pro program</a>. The membership costs $14.99 a year and provides you with early access to select console drops, in addition to discounts, monthly rewards, and an annual <em>Game Informer </em>subscription.</p><p id=\"YXHaSH\">It’s also worth noting that Gamestop occasionally sells the PS5 exclusively in bundles that include games, extra controllers, and even gift cards. These bundles cost about the same as if you’d purchased these items separately, but can raise the price to as much as $750.</p><div id=\"0qwesL\"><div data-anthem-component=\"productcard:11024174\" data-anthem-component-data='{\"layout\":\"buttons_only\"}'></div></div><h3 id=\"endeot\">Best Buy</h3><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NTjjINqLBZjfXk1GgYB-sGRhrUw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23035273/Best_Buy.jpg\">      <cite>Illustration by Kristen Radtke</cite>  </figure></div><p id=\"3ySvWQ\">If you’re planning to snag a PS5 via an in-store event, Best Buy typically hands out vouchers on a first-come, first-serve basis. They only distribute as many vouchers as there are consoles, so if you manage to get one, you’re golden. The success of this method relies entirely on how early you can get to a participating store. If you’re buying online, however, you may need to be a member of <a href=\"https://shop-links.co/cgBTRzqjgnK\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy Totaltech</a>, a subscription “service” that grants you exclusive access to some console restocks, as well as discounts, two-day shipping, and a handful of other perks. A Totaltech membership costs $199.99 a year and is only available as an annual subscription.</p><p id=\"SRuwaK\">Thankfully, not all PS5 restocks at Best Buy require a Totaltech membership to access, and regardless of whether you’re a member or not, everyone gets funneled through the same queue. Once you click the “Add to Cart” button, you’ll be placed in line with an estimated wait time. Theoretically, once the timer hits zero, you should be able to check out, but the entire process can be hit-or-miss in our experience. </p><p id=\"YxkJwF\">Best Buy also tends to schedule its restocks in waves, so if you fail on your first attempt, it's certainly worth dusting yourself off for a second, third, or even fourth try. Typically, these waves come in 10-minute intervals.</p><div id=\"qtTWVJ\"><div data-anthem-component=\"productcard:11024182\" data-anthem-component-data='{\"layout\":\"buttons_only\"}'></div></div><aside id=\"9lspC6\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"8 great games for your new 2021 PlayStation 5\",\"url\":\"https://www.theverge.com/22825859/ps5-best-games-playstation-5-sony-2021\"},{\"title\":\"Here are the accessories you’ll need for your new PlayStation 5\",\"url\":\"https://www.theverge.com/21550907/ps5-wireless-controller-ssd-hard-drive-accessories-sony\"}]}'></div></aside><h3 id=\"daIkqh\">Costco and Sam’s Club</h3><p id=\"fjDdDK\">Both of these big-box chains require a membership to take advantage of their restocks, whether in-store or online. If you aren’t a member yet, just note that an annual membership to Costco currently starts at $60, while Sam’s Club charges $45 for yearly access. Beyond being a member, there isn’t much else you need to do. Just keep in mind that Costco and Sam’s Club restock the PS5 less frequently than other big-name retailers and that they often bundle the console with items you may not necessarily need, thus increasing the price.</p><div id=\"iy7dxH\"><div data-anthem-component=\"productcard:11023130\" data-anthem-component-data='{\"layout\":\"buttons_only\"}'></div></div><h3 id=\"dw2o3F\">Target</h3><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sMAdvpwD1r2blYgsRrGGjzNk3hs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23035271/Target.jpg\">      <cite>Illustration by Kristen Radtke</cite>  </figure></div><p id=\"No2WZ0\">There appears to be far less throttling or lining up at this particular retailer. Unfortunately, as a result, we’ve seen the lowest level of success with Target when we’ve attempted to check out. There is something of a silver lining, however. Because the process isn’t metered or moderated, you don’t need an account or subscription to check out.</p><p id=\"U7tG1g\">The lack of any apparent queue system or wave-based restocks means that consoles at Target tend to sell out faster than they do through their competitors, but the retailer is always worth investigating considering there is no barrier for entry.</p><div id=\"DZZrgq\"><div data-anthem-component=\"productcard:11024188\" data-anthem-component-data='{\"layout\":\"buttons_only\"}'></div></div><h3 id=\"gPYkrc\">Sony</h3><p id=\"Ih1kYM\">If you’re buying from Sony directly, you’ll need to <a href=\"https://www.playstation.com/en-us/ps5/register-to-buy/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">pre-register for an invitation</a> to purchase a PlayStation. This is the slowest method, but arguably the most reliable since you’ll be buying directly from the manufacturer. Once you’ve signed up, you just need to wait for an email from Sony, but there are no promises of when that could be. When you receive an email regarding an upcoming restock event, you’ll be provided with a time-sensitive link that allows you to check out with the system you pre-registered for. </p><p id=\"cKmysq\">Sony does occasionally have restocks available for those who haven’t pre-registered, so you should still keep an eye out. This method is similar to what other retailers are doing in that it will open a digital queue that will count down and, provided there are still units available, eventually take you to Sony’s checkout page.</p><h3 id=\"VVCKB7\">Walmart</h3><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uADcjYGrcb6rihQ3WAs7rWlNpTI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23035270/Walmart.jpg\">      <cite>Illustration by Kristen Radtke</cite>  </figure></div><p id=\"rmeZja\">Walmart shares a similar stance with Best Buy in that you'll sometimes need to be a member of <a href=\"https://goto.walmart.com/c/482924/565706/9383?u=https%3A%2F%2Fwww.walmart.com%2Fplus%3F&amp;subid1=VergePS5021122\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Walmart Plus</a> to participate in some restock events. If you aren’t a Walmart Plus member yet, an annual membership costs $98, but a monthly subscription is also available for $12.95. But regardless of your membership status, the process is the same. Typically, clicking the “Add to cart” button puts you in the virtual queue with a countdown signaling when you’ll be able to checkout. We’ve seen the queue last as long as 40 minutes, but if you get past that, you’re often good to go. Just don’t be disappointed if the counter reaches zero and there's no console, as this isn’t a guarantee that you’ll get one. One final note, Walmart’s landing pages for the PlayStation 5 occasionally redirect to higher-priced third-party sellers but will be replaced with the first-party models when they become available. </p><div id=\"PeuGQC\"><div data-anthem-component=\"productcard:11024193\" data-anthem-component-data='{\"layout\":\"buttons_only\"}'></div></div><hr class=\"p-entry-hr\" id=\"UBFgcg\"><h2 id=\"veHans\">A few essential tips to keep in mind</h2><hr class=\"p-entry-hr\" id=\"Vnq1yw\"><p id=\"AmZHdv\">While we’ll always do our best to keep you informed of restock events when we receive advance notice or discover consoles available online, there are a handful of tips that will help you improve your odds of securing a standard PS5 or the disc-less edition.</p><h3 id=\"kOQ29G\">Sign up for retailer accounts</h3><p id=\"ang7xm\">Our first recommendation is to create accounts with retailers like Sony, Best Buy, Amazon, and Walmart. The digital queue that most retailers rely on to keep things somewhat organized will require you to have a login, and if you’ve set this up with the appropriate credentials, you’ll already be a step ahead of the person that foolishly didn’t.</p><div class=\"c-float-right\"><aside id=\"qlWfAL\"><q>... most retailers won’t hold your console while you’re in the checkout line</q></aside></div><p id=\"YqWDtZ\">Setting up and verifying this information in advance will also allow you to automatically import your billing and delivery info during the checkout process, thus allowing you to save precious seconds. This is crucial given most retailers won’t hold your console while you’re in the checkout line.</p><h3 id=\"UTZaa0\">Double down using the mobile app</h3><p id=\"Kxkbrw\">If possible, we also recommend trying to buy a PS5 using retailer apps in addition to a desktop or mobile browser. Not only will this increase your chances by giving you a second means by which to procure a console, but we’ve found that dedicated apps for Best Buy, Walmart, and other retailers are often faster than using a traditional browser.</p><div id=\"fXx6wc\"><div data-anthem-component=\"table:11016786\"></div></div><h3 id=\"DYQReI\">Subscribe and follow  </h3><p id=\"I6RNLf\">The next bit of advice we can offer is to set up alerts for yourself by following stock alert accounts on platforms like Twitter and Discord, as well as bookmarking sites that provide live updates for any retailer that's previously carried the console.</p><h4 id=\"eexFIa\">Twitter</h4><p id=\"WkDNeI\">Getting Twitter notifications is easy enough. Simply find the Twitter handle of one of the accounts below and give it a follow. Just make sure to turn on push notifications for the account if you aren’t obsessively checking your feed.</p><p id=\"LWm9HU\">The accounts we recommend below are almost exclusively tied to restocks of the PS5. However, <a href=\"https://twitter.com/Wario64?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@Wario64</a> casts a much wider net, notifying you of solid deals and price breaks for a variety of products, including games, headsets, and action figures.</p><p id=\"EbnYf6\"><a href=\"https://twitter.com/mattswider\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@mattswider</a> is an established personality in the tech journalism space, but has pivoted to covering restocks of the PlayStation 5 and other high-demand items full-time.</p><ul><li id=\"JI1sZl\"><a href=\"https://twitter.com/Wario64\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@Wario64</a></li><li id=\"NSqom3\"><a href=\"https://twitter.com/PS5RestockAlert\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@PS5RestockAlert</a></li><li id=\"pOe04X\"><a href=\"https://twitter.com/PS5StockAlerts\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@PS5StockAlerts</a></li><li id=\"2CQck3\"><a href=\"https://twitter.com/iloveps_5\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@iloveps_5</a></li><li id=\"7ORZOk\"><a href=\"https://twitter.com/PS5Drop\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@PS5Drop</a></li><li id=\"qM4BWD\"><a href=\"https://twitter.com/mattswider\" rel=\"sponsored nofollow noopener\" target=\"_blank\">@mattswider</a></li></ul><h4 id=\"Gg10sg\">Discord</h4><p id=\"wtaozx\">If you’re unfamiliar, Discord is a platform that allows you to join community-driven chat servers. These servers closely resemble online forums but are better at communicating up-to-the-minute information. While they aren’t always super intuitive, most stock alert servers have done a decent job of automating the joining process for new members and signing up for the restock alerts of your choosing. All of the servers we recommend below offer alerts for the PS5 and the PS5 Digital Edition, but you can also subscribe to receive notifications for everything from an Oculus Quest 2 to toilet paper (yes, really).</p><p id=\"KNNdaj\">You can have these alerts delivered to your desktop as long as you have the app open, or have them set up as push notifications on your phone if you download the Discord app.</p><ul><li id=\"a9C7yZ\"><a href=\"https://discord.com/invite/txGSPMqCrP\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Ameers Restock Group</a></li><li id=\"ZKTgcl\"><a href=\"https://discord.gg/aJhQJDjjaD\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Stock Alert</a></li><li id=\"zzklWY\"><a href=\"https://discord.com/invite/8Q53KHF\" rel=\"sponsored nofollow noopener\" target=\"_blank\">StockDrops</a></li></ul><h4 id=\"gGmzmT\">Websites</h4><p id=\"sx2cwE\">The websites <a href=\"https://www.nowinstock.net/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">NowInStock</a> and <a href=\"https://www.stockinformer.com/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Stock Informer</a> provide current stock and pricing updates from a variety of retailers. Not just for the PS5, but virtually any product you can find on the internet. While you can use either site without an account, you won’t be able to receive updates via email or pop-up notifications in your browser or on your phone unless you have one.</p><ul><li id=\"OpTAhd\"><a href=\"https://www.stockinformer.com/checker-ps5-console-playstation-5\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Stock Informer</a></li><li id=\"N3nbA6\"><a href=\"https://www.nowinstock.net/videogaming/consoles/sonyps5/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">NowInStock</a>    </li></ul><h3 id=\"dXnkDR\">Opt for a bundle</h3><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9bKI0m4Vxx7Lh9K16shAj0CQhro=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23182970/Screenshot_2022_01_20_163448.png\">      <cite>Image: GameStop</cite>      <figcaption>GameStop’s PS5 bundles include a variety of add-ons, including extra controllers and gift cards.</figcaption>  </figure></div><p id=\"1vx9Wb\">Recently, many retailers have introduced high-priced console bundles that include the PS5 in addition to a handle of accessories. GameStop, for instance, often sells bundles that include extra controllers, games, and even gift cards. Bundles can vary in price, however, they often sell for as much as $750. While they cost more upfront, they’re not any more expensive than if you were to purchase the console and items separately.</p><p id=\"3hK7zS\">The added benefit of the higher price tag is that the bundles typically don’t sell out as quickly as standalone consoles. If you’re not opposed to spending a little more at checkout, bundles are typically a solid value and shouldn’t be overlooked. </p><h3 id=\"6iiXYd\">Sit tight</h3><p id=\"SOjVnH\">Lastly, you just need a bit of patience. There's no set schedule of when restocks occur, but once you’ve set up the proper notifications, you'll have a good shot of landing yourself a console.</p><h3 id=\"u3GyXe\">The last resort...</h3><p id=\"dp0xcG\">If you’re going to pay more than MSRP for a Playstation 5, there is always the option of purchasing one through reputable resellers like <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ebay.com%2Fb%2FSony-PlayStation-5-Consoles%2F139971%2Fbn_7117648159%3Fmkcid%3D1%26mkrid%3D711-53200-19255-0%26siteid%3D0%26campid%3D5338794975%26customid%3DVergePS5021122%26toolid%3D10001%26mkevt%3D1&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22777072%2Fsony-ps5-playstation-5-console-where-how-to-buy-tips-restock\" rel=\"sponsored nofollow noopener\" target=\"_blank\">eBay</a> and <a href=\"https://stockx.pvxt.net/c/482924/530344/9060?u=https%3A%2F%2Fstockx.com%2Fplaystation&amp;subid1=VergePS5021122\" rel=\"sponsored nofollow noopener\" target=\"_blank\">StockX</a>. While we don’t recommend it, sites like these will at the very least provide you with a secure transaction and ensure that you get what you pay for.</p><aside id=\"qRzRmq\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"deals\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/m95_8IUIZ7cVe5zZkFUaeoh4H8o=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22015295/vpavic_4278_20201030_0041.jpg",
  "description": "Haven’t been able to get a PS5 yet? These tips should help.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}