{
  "title": "How to check which version of Chrome OS you’re running",
  "url": "https://www.theverge.com/23125531/chrome-os-chromebook-version-how-to",
  "date": "2022-05-19T18:58:04.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"Best Chromebook 2020: Asus Chromebook Flip C434\" src=\"https://cdn.vox-cdn.com/thumbor/W9s1wCj9TX2A4qPRy5wE22dgXxk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70888848/vpavic_190731_3630_0080_result.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"jInCo5\">I once picked up a Chromebook that hadn’t been used for a while in order to try out what was then a relatively new Chrome OS feature: virtual desktops. But when I hit the key that was supposed to bring those desktops up on my screen, I didn’t see anything. I did some checking around, and I found that the feature was expected to be available as of version 77 of Chrome OS — several iterations after the version I was running.</p><p id=\"TB5oOE\">While Chromebooks pretty much run on their own, and you can usually ignore which version of the operating system your device is running, you may want to have that information available just in case you do need it. All you have to do is follow these steps:</p><ul><li id=\"80wXPk\">Click on the clock in the lower right corner of your screen.</li><li id=\"j0eVT5\">Select the “Settings” icon (the gear in the upper row of the pop-up window).</li><li id=\"0TFpel\">Find “About Chrome OS” on the bottom of the left-hand menu and select it.</li></ul>  <figure class=\"e-image\">        <img alt=\"About Google OS page\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9s-2JokzB6X1aYAwR0TNXhbC1qY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23573954/Screenshot_2022_05_19_9.21.50_AM__1_.png\">      <figcaption><em>Your version number will be just below Google Chrome OS on top of the window. </em></figcaption>  </figure><p id=\"s0kJez\">Your version number will be just below the Google Chrome OS title on top of the window. A button on the right of that number will let you check for any new updates or install any updates that have been recently downloaded but not yet installed. You will also see a number of other options on this page (they may vary) to check out what’s new in your current version of Chrome OS, go to Google’s help pages, report an issue, among others.</p><p id=\"KrF0zG\">You can get additional information about the inner workings of Chrome OS by selecting  <strong>Additional details</strong>. For example, if you want to know <a href=\"https://www.theverge.com/2019/10/15/20914110/chromebook-how-to-change-chrome-os-channels-unreleased-features-settings\">which channel your Chromebook is running</a> — in other words, the setup of your operating system — select <strong>Change channel</strong>. You can choose from Stable (the default, safe version of the OS), Beta (which receives new features about a month before the Stable channel), and Developer - unstable (which lets you try out features that are still being tested).</p>  <figure class=\"e-image\">        <img alt=\"Change channel pop-up\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qGZ0nkMNIRkTnkgyBtPWhvjj6vQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23573961/Screenshot_2022_05_19_9.25.23_AM.png\">      <figcaption><em>You can also choose which channel your OS will use.</em></figcaption>  </figure><p id=\"FiHjnk\">On the <strong>Additional details</strong> page, you’ll also find the details of the current OS build and find how long your Chromebook will get software and security updates (usually six years).</p>  <figure class=\"e-image\">        <img alt=\"Additional details page\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_RM7Hm4kEmxgt_M-fgTCbHNGVoQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23573962/Screenshot_2022_05_19_9.24.37_AM.png\">      <figcaption><em>There is other info on the “Additional details” page.</em></figcaption>  </figure><p id=\"ONqy4k\"><em><strong>Update May 19th, 2022, 10:20AM ET:</strong></em><em> This article was originally published on October 16th, 2019, and has been updated to account for changes in the OS.</em></p><p id=\"fdqfJt\"></p><p id=\"WRLDaw\"></p><p id=\"YGXj13\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OIbo1BjmK9imVnHwEdbNLh9xw9w=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19138755/vpavic_190731_3630_0080_result.jpg",
  "description": "It can be useful to know which version of ChromeOS you’re running.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}