{
  "title": "How to measure heart rate on your smartwatch",
  "url": "https://www.theverge.com/23004703/heart-rate-ekg-smartwatch",
  "date": "2022-04-01T13:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Mn6azXHk2wl-hP1YAy4P2DNBr3I=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70697842/dseifert_200930_4217_0013.0.0.jpg\" />        <figcaption><em>The Apple Watch has several heart-related health features.</em> | Photo by Dan Seifert / The Verge</figcaption>    </figure>  <p id=\"Kz7cU3\">Modern smartwatches have a wide array of heart-rate monitoring features. That includes passive all-day monitoring as well as spot checks for specific metrics. Some will even alert you if your heart rate suddenly spikes when it shouldn’t. The most advanced devices also have FDA-cleared electrocardiograms that may help detect atrial fibrillation. </p><p id=\"KW3oTH\">These are impressive features considering that, just a decade ago, smartwatches were basically pedometers. In practice, heart rate monitoring can be a helpful tool for people hoping to understand more about their bodies or measure their fitness progress over time. For instance, some athletes prefer to train in heart rate zones — which is hard to do unless you can check it in real time. There have <a href=\"https://www.macrumors.com/2021/11/27/apple-watch-lifesaving-heart-alerts/\">also</a> <a href=\"https://www.macrumors.com/2021/02/04/apple-watch-life-saving-story/\">been</a> <a href=\"https://www.cnet.com/tech/mobile/apple-watch-lifesaving-health-features-read-5-peoples-stories/\">several</a> <a href=\"https://www.zdnet.com/article/how-apple-watch-saved-my-life/\">stories</a> of people who say their smartwatches saved their lives thanks to abnormal heart rate alerts.</p><p id=\"rzlcf4\">That said, it’s important to remember that these <a href=\"https://www.theverge.com/2022/3/2/22958156/apple-watch-heart-rhythm-detection-benefit\">aren’t medical devices</a>. At the end of the day, they’re not capable of diagnosing you with any sort of condition. And, even if they were, doctors are <a href=\"https://www.theverge.com/22733073/smartwatch-wearable-health-impact-doctors\">still on the fence</a> about how to handle wearable data that consumers collect on their own. </p><p id=\"NBJW7M\">There are nuances to how these features work and plenty of reasons why you might get inaccurate readings.<strong> </strong>First, we’ll cover how heart rate monitoring works and how to measure your heart rate. Then we’ll get into what EKG-capable smartwatches can and cannot do and how to use the EKG feature with the current crop of smartwatches.</p>  <figure class=\"e-image\">        <img alt=\"The sensor array on the bottom is different because of the new blood oxygen monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5xI5_E4QwRXtrfSzYb2Rls8Z3cQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21925620/vpavic_200929_4216_0119.jpg\">      <cite>Vjeran Pavic / The Verge</cite>      <figcaption><em>The sensor array on the back of the Series 6 is capable of both EKGs and PPG heart rate monitoring.</em></figcaption>  </figure><h2 id=\"Ncgtj6\">How optical heart rate sensors work</h2><p id=\"9COFhF\">The vast majority of wearables use a photoplethysmography (PPG) sensor — the green LEDs you see when you flip the device over. The LEDs shine light into your skin; the light that’s refracted back is translated by an algorithm into heart rate data. That includes your resting heart rate but also other metrics like VO2 Max and heart rate variability.</p><p id=\"L78xb5\">While optical heart rate sensors have gotten better over the years, wrist-based PPG sensors still aren’t always accurate. A <a href=\"https://www.theverge.com/2022/1/21/22893133/apple-fitbit-heart-rate-sensor-skin-tone-obesity\">recent study</a> found that these sensors didn’t work as well on darker skin or people with obesity. The wrist is also not the best place for a PPG sensor. There’s a lot of noise from your arm movements, and a company’s algorithm has to be able to effectively filter that out. That’s why you could wear the same smartwatch on each arm and still get slightly different readings.</p><p id=\"tRcDL5\">Fit is also an important factor. It varies from smartwatch to smartwatch, but here are a few general tips for getting the most accurate data possible.</p><ul><li id=\"ryGd6P\">Wear the watch about one finger length above your wrist bone</li><li id=\"zLE9vn\">Make sure there’s good contact between the sensor array and your skin</li><li id=\"M8FZjT\">Tighten the strap during exercise. You may also want to wear the device higher on the wrist.</li><li id=\"THVObR\">Wipe the sensor array clean whenever it gets dirty</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-ViogBDcBf6g-WRkXfJ2f3N3LaM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23324671/vsong_220317_5089_0005.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>Many smartwatches, including the Fitbit Versa 3, will allow you to view heart rate from your watchface</em></figcaption>  </figure><h2 id=\"9ZoCpw\">Viewing heart rate and settings</h2><p id=\"fGZGUr\">Once you’ve paired your smartwatch, you should dive into the settings in your watch’s companion app. That’s where you’ll get to customize how often your watch measures your heart rate. Some watches<strong> </strong>measure heart rate continuously by default; others will measure periodically to help extend battery life. </p><p id=\"QWK3XJ\">For example, the Apple Watch measures your heart rate periodically when you’re still and while walking. It only measures continuously when you’re in a workout and for the three minutes after during recovery. You don’t have the option to change that. However, other devices like Garmin and Samsung watches may let you have more of a say. Each smartwatch maker designs their app differently, but you can usually find heart rate settings in your device’s settings or a health settings menu. </p><p id=\"7THFGk\">Your watch may also be capable of low and high heart rate alerts. This means you’ll get a notification if, while at rest, your heart rate goes below or above a certain threshold. So if you’re sitting still and your heart rate spikes to 120 beats per minute, you might get a notification. Many watches will let you customize the range for these alerts.</p><p id=\"VGTAWO\">Below, we’ve outlined how to access these settings for some of the most popular devices and how to measure your heart rate.</p><h3 id=\"ZkwKOB\">Apple Watch</h3><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NgXdcEwbrpEZBY_mIsZHpH3XgrQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23357743/IMG_2764.PNG\">      <cite>Screenshot: Victoria Song / The Verge</cite>      <figcaption><em>Accessing heart rate settings in the Watch app is easy</em></figcaption>  </figure></div><p id=\"9FN5pT\">To access heart rate settings, open the <strong>Watch</strong> app and scroll down the list of installed apps to <strong>Heart</strong>. From here, you can enable a variety of health measurements:</p><ul><li id=\"5kwOFe\">Toggling on <strong>Cardio Fitness Notifications</strong> will tell you when it deems your cardio fitness is low. </li><li id=\"zKS7mp\">Enabling <strong>Irregular Rhythm</strong> notifications means you’ll get notified if the watch identifies heart rhythms that may indicate atrial fibrillation. </li><li id=\"N0d09a\">You can also set ranges for <strong>High Heart Rate</strong> and <strong>Low Heart Rate</strong> notifications. These notifications alert you when you’ve passed an abnormal threshold while you’re inactive. </li></ul><p id=\"PdGRKe\">Again, none of these are diagnostic features.</p><p id=\"bFCIwQ\">To measure heart rate:</p><ul><li id=\"49WZE3\">Click the digital crown to bring up your apps</li><li id=\"mnBmb3\">Tap the <strong>Heart</strong> app (The app features a red background with a heart on it.)</li><li id=\"eeCiKW\">From there, you can manually start a heart rate reading</li><li id=\"DVAuff\">You can also scroll down to view your resting heart rate and walking average heart rate</li></ul><h3 id=\"h5MENh\">Fitbit trackers and smartwatches</h3><p id=\"Bq2dQX\">To access heart rate settings:</p><ul><li id=\"t4HPss\">Tap your profile icon in the upper left corner</li><li id=\"GxI0CR\">Scroll down to <strong>Settings</strong></li><li id=\"PbofW6\">Tap <strong>Activity &amp; Wellness</strong></li><li id=\"Ws4hwZ\">Tap <strong>Heart Settings</strong></li><li id=\"8yHDCY\">From here, you can set customized high and low heart rate alerts, as well as heart rate zones for exercise</li></ul><p id=\"Wipq2w\">Here’s another method: </p><ul><li id=\"fRqzWI\">Tap your profile icon in the upper left corner</li><li id=\"kIOFwj\">Select the device’s profile</li><li id=\"cwkCGR\">Tap <strong>High &amp; Low heart rate</strong> to customize these alerts.</li></ul><p id=\"VetPJd\">To view heart rate:</p><ul><li id=\"HhbIQ1\">From the clock face, swipe up to see current heart rate</li><li id=\"kKzUF1\">You can also view your rate in the <strong>Exercise</strong> app during exercise</li><li id=\"aTiQV8\">Certain clock faces will also feature heart rate as a complication</li><li id=\"hqW124\">You can also view in further detail from the Fitbit app dashboard</li></ul><h3 id=\"uxZqhj\">Samsung Galaxy Watches</h3><p id=\"Wspw4S\">To access heart rate settings on the Galaxy Watch 4 and Watch 4 Classic:</p><ul><li id=\"n6Dmui\">Head to the <strong>Samsung Health</strong> app on your watch</li><li id=\"zgxYqj\">Swipe down to <strong>Settings</strong></li><li id=\"5upQqr\">Tap <strong>Measurement</strong> and select the <strong>Heart Rate</strong> section</li><li id=\"aCxJOb\">From here, you can select whether you want to measure continuously, periodically (once every 10 minutes while still), or manually only</li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/iCUwctNi-R4VJSWpEBeBiHiGLiE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/15944628/DSCF1373.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Measuring heart rate on the Samsung Galaxy Watch Active</em></figcaption>  </figure><p id=\"y9K77e\">On Samsung’s Tizen watches:</p><ul><li id=\"5Arp1A\">Press the power button on the watch</li><li id=\"GMf4q4\">Head to the <strong>Samsung Health</strong> app</li><li id=\"uXuZrB\">Swipe to <strong>Heart Rate</strong> and scroll to the bottom of the screen</li><li id=\"KHHaKl\">Tap <strong>HR and stress measurement</strong> </li><li id=\"qYkzGy\">After that, the options should be the same as above</li></ul><p id=\"0HgKpq\">To set up high / low heart rate alerts:</p><ul><li id=\"lMsVIt\">Head to the <strong>Samsung Health</strong> app</li><li id=\"aPmiAj\">Tap <strong>Heart rate</strong></li><li id=\"PNeixb\">Scroll down to <strong>HR and Stress Management</strong> or <strong>Auto HR settings</strong></li><li id=\"RbZLzC\">Set your watch to measure heart rate continuously</li><li id=\"rRqELM\">Tap <strong>More Options</strong> or the three dots</li><li id=\"tQiabd\">Tap <strong>HR alert settings</strong></li><li id=\"A6leAa\">From here, you can customize your alerts</li></ul><p id=\"sAwl4y\"> To manually measure heart rate:</p><ul><li id=\"41xUet\">In the Samsung Health app, tap <strong>Heart rate</strong></li><li id=\"Aa6gqs\">Tap <strong>Measure</strong></li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3Vvo6rg6Y6guELKTtY72S_jyfl4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21900762/akrales_200916_4186_0036.0.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The Withings ScanWatch’s EKG feature was recently cleared by the FDA</em></figcaption>  </figure><h2 id=\"OJM8Hz\">About EKGs</h2><p id=\"dIGqWI\">There are only a handful of smartwatches that have been cleared by the FDA to measure EKGs in the US. So even if the smartwatch you buy supports this feature, you’ll have to check whether it’s been granted regulatory clearance in your country. </p><p id=\"77ortt\">Assuming it has, EKGs on smartwatches work by reading electrical signals from your heart. The smartwatch’s heart rate monitor acts as an electrode, and by touching your finger to the case / digital crown, you create a closed circuit. After a short period of time, you’ll be told whether your heart rhythm for <em>that</em> particular reading — and only that reading — shows a normal rhythm or signs of atrial fibrillation.</p><p id=\"Ms1zRc\">It bears repeating: no watch can give you an actual medical diagnosis. The most that you can do with this information is export it to a PDF that you can then share with your doctor. If you’ve got a clean bill of health from your doctor, you may not need to use this feature at all, and that’s perfectly fine! </p><p id=\"ATb48b\">You should also be aware that you may get a few inconclusive readings. There are several reasons why that can happen. First, you generally have to remain very still to take these EKG readings — if you’re fidgety, that could result in an inconclusive result. Likewise, your skin might be a little wet, and <em>that</em> can screw up a reading. </p><p id=\"VGOPIo\">Each smartwatch maker will have its own suggestions for how to troubleshoot, but the gist is to relax and keep still while using the EKG feature.</p><h2 id=\"Fig5Pe\">Apple Watch</h2><p id=\"bOD8H2\">You can only take EKGs on the Apple Watch Series 4, 5, 6, and 7. </p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/B6YrLMbe7clkCw-pehIWW3rxA08=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23357750/IMG_2766.PNG\">      <cite>Screenshot: Victoria Song / The Verge</cite>      <figcaption><em>EKG results in the Health app</em></figcaption>  </figure></div><p id=\"wy6HtD\">How to get started:</p><ul><li id=\"Pg9iGP\">Open the <strong>Health</strong> app on your phone and follow the prompts, or tap <strong>Browse &gt; Heart &gt; Electrocardiograms &gt; Set Up ECG app</strong></li><li id=\"WWkhMx\">You should then see the EKG app on your watch</li><li id=\"Qvkt6p\">Tap the EKG app on your wrist</li><li id=\"AK8cdB\">Touch the Digital crown with a finger from your opposite hand</li><li id=\"SgFCzp\">Wait 30 seconds for the watch to take a reading</li></ul><p id=\"jdteNJ\">To export your results:</p><ul><li id=\"38JwwC\">Open the <strong>Health</strong> app</li><li id=\"n5w6ph\">Tap <strong>Browse &gt; Heart &gt; Electrocardiograms</strong></li><li id=\"yHuUjE\">From there, you should see a list of your readings</li><li id=\"Lukuqm\">Tap the one you want to generate a report for</li><li id=\"ZgqWTy\">Tap <strong>Export a PDF for your doctor</strong></li><li id=\"d8aSuG\">You can also tap the <strong>Share</strong> button to print or email the PDF, as well as upload it to services like Dropbox</li></ul><p id=\"WDOn8y\"></p><h2 id=\"gO9PMd\">Samsung Galaxy Watch </h2><p id=\"W1Pgil\">Only the Samsung Galaxy Watch Active 2, Galaxy Watch 3, and Galaxy Watch 4 support EKG readings.</p><p id=\"0dEPYi\">How to get started:</p><ul><li id=\"DKZEnH\">First, make sure your watch and phone are on the latest software</li><li id=\"2Mz0T3\">Open the <strong>Samsung Health Monitor</strong> app on your watch</li><li id=\"vXyQJV\">Tap <strong>Download App</strong>. This should bring up the app download page on your phone.</li><li id=\"clMDtH\">Tap Install </li><li id=\"JPkfJg\">Launch the <strong>Samsung Health Monitor </strong>app</li><li id=\"XbaK4d\">Tap continue and fill out information prompts</li><li id=\"CMW2US\">Tap <strong>Finish</strong>. You should see a button that says <strong>Get Started.</strong></li><li id=\"EmS9A3\">You’ll then have to follow some more onscreen prompts</li><li id=\"nfqWUr\">Select which wrist you’ll wear the watch on</li><li id=\"kVQiDB\">Hit <strong>Done</strong></li><li id=\"T1V8Qz\">You should now be able to take an EKG on your watch</li></ul><p id=\"LEy8Wg\">To export your results:</p><ul><li id=\"4MbSi5\">Open the <strong>Samsung Health Monitor</strong> app on your phone</li><li id=\"BP1vtu\">Tap <strong>ECG</strong> and select <strong>View History</strong></li><li id=\"a2raDA\">Select the report you want to export</li><li id=\"P5QFHo\">Tap <strong>Share This Report</strong></li><li id=\"g9nHkN\">Select the format you’d like to send (PDF, email, etc.)</li></ul><h2 id=\"wnJm1c\">Fitbit Sense and Charge 5</h2><p id=\"LfsIlj\">Only the Fitbit Sense and Charge 5 can take ECG readings at this time. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OwJ5LJF8kJkhnHwX8XyXIBKM0q8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23357758/IMG_2765.PNG\">      <cite>Screenshot: Victoria Song / The Verge</cite>      <figcaption><em>You can export your EKG results to a PDF and send it to your doctor</em></figcaption>  </figure></div><p id=\"MXTKWF\">The <strong>ECG</strong> app should already be on your watch or tracker, but if not, here’s how to install (or uninstall) the app:</p><ul><li id=\"8BsxJg\">Tap your profile icon in the upper left corner</li><li id=\"I6WuV9\">Select device profile</li><li id=\"dvhgcn\">Tap <strong>Gallery</strong></li><li id=\"a0ihAQ\">You should see the <strong>High/Low</strong> heart rate app and the <strong>EKG</strong> app</li><li id=\"vFZoMx\">Tap the app icon to install / uninstall</li></ul><p id=\"YLHUJn\">How to get started: </p><ul><li id=\"2g7qjp\">Head to the <strong>Discover</strong> tab in the Fitbit app</li><li id=\"dg2Awv\">Scroll down to <strong>Assessments &amp; Reports</strong></li><li id=\"hkzCcY\">Select <strong>Heart Rhythm Assessment </strong></li><li id=\"t1VmIJ\">Read through the educational materials</li><li id=\"GKV61x\">Open the <strong>ECG</strong> app on your watch or tracker. </li><li id=\"pJvzf3\">Place your finger and thumb on the edges of the case</li><li id=\"b1VZbD\">Wait 30 seconds and then view your results</li></ul><p id=\"aEMjHS\">To export your results:</p><ul><li id=\"yzdCDz\">Tap the <strong>Discover</strong> tab in the Fitbit app</li><li id=\"fB46SO\">Scroll down to <strong>Assessments &amp; Reports</strong></li><li id=\"VWORWO\">Select <strong>Heart Rhythm Assessment</strong></li><li id=\"9mo4VY\">Tap <strong>View Results</strong></li><li id=\"vijDXG\">Select which one you want to generate a report for</li><li id=\"yU1tBH\">Tap <strong>Export a PDF</strong> for your doctor</li></ul><h2 id=\"zXlcTR\">Withings ScanWatch</h2><p id=\"RkqELf\">While Withings has multiple EKG-capable watches, only the ScanWatch is cleared for use in the US.</p><p id=\"DgBQhX\">How to get started:</p><ul><li id=\"sI8y5e\">Open the <strong>Health Mate</strong> app</li><li id=\"5nv86s\">Select <strong>Devices</strong>, then <strong>ScanWatch</strong></li><li id=\"jTK6wv\">Tap <strong>More Settings</strong>, and then <strong>ECG</strong></li><li id=\"8iOYBf\">Select which wrist you’re wearing the watch on</li><li id=\"j7i5Md\">On your watch, use the side button to scroll to <strong>ECG Mode</strong></li><li id=\"NQsSsS\">Press the side button</li><li id=\"Jyndfg\">Place your fingers on the top ring for 30 seconds</li></ul><p id=\"u4aZRS\">To export your results:</p><ul><li id=\"zBlat7\">Your results should automatically appear in your Health Mate app feed</li><li id=\"yYOT4V\">Tap your results</li><li id=\"qUax3T\">Scroll down to <strong>Share a Health Report</strong> and follow the prompts to create a PDF</li></ul><p id=\"7cPyDA\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jzT0X_QzQQCWfJuAiW1mKpDVMJY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21928299/dseifert_200930_4217_0013.0.jpg",
  "description": "Modern smartwatches offer a ton of heart health features",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}