{
  "title": "How to activate and use Google Chat",
  "url": "https://www.theverge.com/22533079/google-chat-rooms-gmail-how-to",
  "date": "2022-02-10T21:04:28.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2RAjBG6BUaHLxhWcMClP6Ky3fw0=/259x0:2158x1266/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/69463132/Screen_Shot_2021_06_14_at_9.27.20_AM.0.png\" />    </figure>  <p id=\"Kznv7R\">Real-time collaborative chat, as exemplified by apps such as Slack, has become a common way to communicate between colleagues and friends, especially since early 2020, when so many of us transitioned to working from home. In mid-2021, Google apparently took note of this and pit itself against Slack by taking two of the features from its corporate Workplace app suite — Chat and Spaces (previously called Rooms) — and integrating them into its standard Gmail app.</p><p id=\"8I4aj7\">Google Chat allows you to hold chat sessions with friends and groups of friends either on an informal or formal basis. The former can be done just between two people or between several in what Google calls a group conversation. The latter is done via a separate area that Google currently calls a Space. </p><p id=\"tJR9xO\">What’s the difference? <a href=\"https://support.google.com/chat/answer/7659784?hl=en\">According to Google</a>, chat is simply a way for two or more people to chat together without any formalities — for example, if you wanted to quickly talk about where you were going to meet for lunch, you’d create a group conversation among your friends. Once the conversation is done, it’s done, and it will be deleted after five days (if you’re using a personal rather than a Workspace account).</p><p id=\"gliRcM\">A space, on the other hand, is for more long-term conversations. Each space has its own name, remains available for people to leave and rejoin, will send out notifications, and can share files. It’s for work projects, party planning, or any other activity where you want to keep the conversation going over the course of days, weeks, or longer.</p><p id=\"vkUrX7\">If this sounds useful to you, then the first thing you need to do is activate Google Chat for your Gmail account. Currently, at least, you need to do it separately on your browser and on your mobile device.</p><h2 id=\"gQ7jOG\">Activate Chat on a mobile app</h2><ul><li id=\"zVHWsU\">Tap the three-line icon at the top-left corner. Scroll down and select “Settings.”</li><li id=\"s2RMES\">Select your account</li><li id=\"Mmujm6\">Scroll down to “General” </li><li id=\"lAJF5L\">If you’re using an Android phone, check off “Show the chat and spaces tabs.” If you’re using an iPhone or iPad, toggle “Show the chat and spaces tab” on.</li></ul><p id=\"wJUlit\">On the bottom of the screen, instead of just Mail and Meet icons, you’ll now also have Chat and Spaces icons. </p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Activate Chat and Spaces in the General section of Settings.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UpsR-2OppuTZmLBMdPumEzyn1So=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130043/Screenshot_20211228_094545.jpg\">      <figcaption><em>Activate Chat and Spaces in the General section of Settings.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"There will now be four icons at the bottom of your Gmail app.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OLDdJTzGQsaefkImivLFBQTnDS8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130044/Screenshot_20211228_095005.jpg\">      <figcaption><em>There will now be four icons at the bottom of your Gmail app.</em></figcaption>  </figure></div></div></div><h2 id=\"Azi11N\">Activate Chat on a browser</h2><ul><li id=\"oWenT2\">Go to your Gmail account and go to settings (the gear icon in the upper-right corner)</li><li id=\"qBQYol\">Select “See all settings”</li><li id=\"Ade7aX\">In the top menu, select “Chat and Meet”</li><li id=\"rXItCy\">You have the choice of selecting “Google Chat,” “Classic Hangouts,” and “Off.” Assuming you want to try Chat, click on that.</li><li id=\"d0w0Fg\">Usually, Chat will appear on the left side of your Gmail screen, but you can choose to have it appear on the right side instead</li><li id=\"D1ZOT9\">By the way, “Chat and Meet” lets you hide the Meet section in Gmail if you want to</li><li id=\"rNj6gp\">Click on “Save Changes”</li></ul>  <figure class=\"e-image\">        <img alt=\"On your browser, go into Settings and look for the “Chat and Meet” section.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PeCCdgUaTrDcfHylJPNrc0bJXnk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130226/Screen_Shot_2021_12_28_at_9.56.47_AM.png\">      <figcaption><em>On your browser, go into Settings and look for the “Chat and Meet” section.</em></figcaption>  </figure><p id=\"kKO0Wf\">Instead of the Meet and Hangouts boxes that used to be on the left-hand side of your Gmail screen, you’ll now have a Chat box, a Spaces box, and a Meet box. Any contacts with whom you previously had chats with via Hangouts will appear in the new Chat box; click on their names, and a small pop-up window in the lower left will show you those previous chats. (Note that if you blocked anyone in Hangouts previously, that blocking isn’t going to carry over to Chat.) And note the button on the right of the search box that lets you choose to be active, away, or undisturbed; you can also type in your own status.</p>  <figure class=\"e-image\">        <img alt=\"A box on the upper right lets you set your chat status.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oFsecI-vkCJf5O6ua2CJ0_U9Ois=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130237/Screen_Shot_2021_12_28_at_11.32.49_AM.png\">      <figcaption><em>A box on the upper right lets you set your chat status.</em></figcaption>  </figure><h2 id=\"qhM2oJ\">Begin a chat on the web</h2><ul><li id=\"NESiN8\">To start a new Chat, click on the plus sign in the corners of the Chat or Spaces boxes. You’ll get a drop-down menu.</li><li id=\"f6dwYH\">If you want to just chat with a single person, type their name into the top field, and you will be taken into a small pop-up chat box. (You can maximize it if you want.) If you want to chat with more than one person, then select “Start group conversation.” You’ll then be able to list the people you want to chat with.</li><li id=\"qHKk4Z\">The same menu also lets you start a space (more on that later), browse existing spaces, or search for message requests (in other words, search for previous requests for chats from other people).</li></ul>  <figure class=\"e-image\">        <img alt=\"You’ll now find Chat and Spaces in the left column. \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_LhkihaEeTdy4pJYajC08uC9pQQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130244/Screen_Shot_2021_12_28_at_11.30.59_AM.png\">      <figcaption><em>You’ll now find Chat and Spaces in the left column. </em></figcaption>  </figure><h2 id=\"Eh7Dld\">Begin a chat on a mobile app</h2><ul><li id=\"CPJqO8\">Tap on the Chat icon and then on the small “New chat” popup in the lower-right corner </li><li id=\"693sJQ\">You can type in the name of a person here (there will be a list of your frequent contacts below the links), or you can create a space or browse existing spaces. </li><li id=\"CtshOl\">If you want to create a group conversation (in other words, have a chat with several people), type in the name of the first person you want to chat with (or choose their name from the drop-down list), then tap on the group icon that will appear in the same field you’re typing in, and add any other names.</li></ul><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"After you click on “New chat,” you can create a chat or a space with one or more people.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AvxVfLQHk_6VReQSrOdw_Pl_rhE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130451/Screenshot_20211228_114427.jpg\">      <figcaption><em>After you click on “New chat,” you can create a chat or a space with one or more people.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"You can include photos and other media with your chat.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/x-AmZHIM6HQ_5H0lnQHeoi6BIrY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130452/Screenshot_20211228_114526.jpg\">      <figcaption><em>You can include photos and other media with your chat.</em></figcaption>  </figure></div></div></div><p id=\"U4jayJ\">People who are invited to your chat will get an email with a link, and will have the option of joining the conversation or blocking it; if they are on Hangouts or Chat, they will get a notification. </p><p id=\"GuXN46\">Whether you’re using the web or a mobile app, to add a new message, type into the field at the bottom of the screen. A series of icons (where they’re located depends on whether you’re using the mobile or web app) lets you add emoji or a photo, start an audio or video meeting (essentially, starting Google Meet), and schedule an event, among others. On the mobile app, if you tap the plus sign to the left of the bottom field, you are given a number of things you can add to your chat message, including a GIF, a calendar invite, or a Google Drive file; on the web app, most of these are available on the right side of the field.</p>  <figure class=\"e-image\">        <img alt=\"Once you expand your web chat, you can also add a number of features to it.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6ZuO3OvLK-G6HJpESNlbgkOmeGY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130461/Screen_Shot_2021_12_28_at_1.31.42_PM.png\">      <figcaption><em>Once you expand your web chat, you can also add a number of features to it.</em></figcaption>  </figure><h2 id=\"pT3Cfi\">Create a Space</h2><ul><li id=\"LfBO79\">On the web, go to the Chat box or the Space box on the left of Gmail and click on the plus sign. In the mobile app, tap on the Spaces icon.</li><li id=\"6KXG1E\">Select “Create space.”</li></ul>  <figure class=\"e-image\">        <img alt=\"When you create a space, you name it and add participants.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/K2Fv836E7vxSOYNrccSmLK6Swag=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130469/Screen_Shot_2021_12_28_at_11.54.05_AM.png\">      <figcaption><em>When you create a space, you name it and add participants.</em></figcaption>  </figure><ul><li id=\"KnBLiM\">Create a space name and add the people you want to include. (If they’re not on your contact list, you can just type in their email address.) Click “Create.” You’ll be taken into the new space. </li><li id=\"0rvt04\">The people who are invited will get an email with a link. When they click on the link, they will be shown the new space and given the opportunity to either join it or block it. (If they haven’t joined Chat yet, they will get notifications from Hangouts.)</li><li id=\"YhA8oH\">To add a new message, type into the field at the bottom of the screen. Like Chat, a series of icons on the right of the field (on the web) or via the plus sign (on mobile) lets you add emoji, upload a file, add a file from Google Drive, start an audio or video meeting (which is essentially starting Google Meet), and schedule an event. </li></ul>  <figure class=\"e-image\">        <img alt=\"A space can include images, emoji, and tasks — but it’s not as temporary as a chat.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SIkKEvDyNEDZAkuw2Xq4PvIlhN0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23130302/Screen_Shot_2021_12_28_at_11.56.04_AM.png\">      <figcaption><em>A space can include images, emoji, and tasks — but it’s not as temporary as a chat.</em></figcaption>  </figure><p id=\"oWymr0\">A couple of notes about spaces: if you’ve created a space using a personal account (as opposed to a business account), anyone in the space can change its name. There are a few other rules as to the use of spaces that can be found on a <a href=\"https://support.google.com/chat/answer/7659784?hl=en\">Google support page</a>.</p><p id=\"dVj6Q4\"><em><strong>Correction: </strong></em><em>An earlier version of this story stated that “You can even have rooms within rooms.” That is not an available feature, and the line has been deleted. We regret the error.</em></p><p id=\"aniMAt\"><em><strong>Update December 28th, 2021, 1:50PM ET:</strong></em><em> This article was originally published on June 21st, 2021 and has been updated to reflect Google’s switch from the term “Rooms” to “Spaces,” along with a few other minor changes.</em></p><p id=\"CMe8Ll\"><em><strong>Update February 10th, 2022, 4:00PM ET: </strong></em><em>The introduction to this article has been updated to reflect changing times.</em></p><p id=\"bEOx11\"></p><p id=\"lAnjOi\"></p><p id=\"H6PJbD\"></p><p id=\"Lhx44T\"></p><p id=\"XhctjT\"></p><p id=\"uG0tpS\"></p><p id=\"JPofI9\"></p><p id=\"P9hFs5\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/d4g3I2epvGItXzYEJ1En7KWZDV0=/0x1:2416x1266/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22660863/Screen_Shot_2021_06_14_at_9.27.20_AM.png",
  "description": "Start using Google’s new Chat and Rooms apps.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}