{
  "title": "How to use Expert RAW on your Samsung Galaxy phone",
  "url": "https://www.theverge.com/22958552/samsung-expert-raw-galaxy-s22-ultra",
  "date": "2022-03-03T14:00:00.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gtoAi2asG-9oWhy78RvAa3CSL1s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70573732/ajohnson_220216_5032_0003.0.jpg\" />        <figcaption><em>The Galaxy S22 Ultra is one of the first phones to fully support Samsung’s new Expert RAW app.</em> | Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p id=\"2vCeq7\">Samsung <a href=\"https://www.theverge.com/2021/11/24/22800655/samsung-expert-raw-app-beta-telephoto-pro-mode\">introduced its Expert Raw app in beta</a> at the end of 2021; currently, it is only available for the S21 Ultra. The app allows you to control manual exposure settings for all four of the rear cameras, which is nice, but the more interesting thing it allows you to do is shoot multi-frame RAW files. Here’s what you need to know about Expert RAW – what it is, why it’s useful, and how to use it.</p><h2 id=\"uGvsoA\">What is multi-frame RAW?</h2><p id=\"mfQ6RI\">The short answer is that it’s RAW but better. In general, RAW shooting saves more data than a JPEG image file, which is a huge benefit if you prefer to fine-tune things like white balance and exposure photo editing software. JPEGs are smaller and more easily shareable, but those kinds of settings are “baked in” to save space, and they’re much less flexible for post-processing. Plenty of smartphones offer a traditional RAW shooting mode – but with a major disadvantage to shooting a standard JPEG image. </p><p id=\"z8Lh0f\">When you take a photo in your phone’s native camera app, the resulting JPEG (or HEIC) file often includes data from multiple frames that were captured very quickly when you pressed the shutter button. This allows the phone to create a single image file with wider dynamic range, making a backlit subject brighter without adding a whole lot of ugly noise, for example. </p><div class=\"c-float-right\"><aside id=\"m70dFq\"><q>The best of both worlds: data from multiple frames in a single file, plus flexibility for editing</q></aside></div><p id=\"QKVILU\">Traditional RAW mode on a smartphone (or any camera) captures a single frame that’s more flexible for editing than a typical JPEG but loses out on the computational benefits that come with the multi-frame processing you’d get with the JPEG. This makes shooting RAW on a smartphone kind of pointless, to put it bluntly. Smartphones have very small sensors and lenses relative to traditional cameras, and they use these computational tricks to capture more image data and compensate for that size disadvantage. As a result, it’s usually better to just let your phone do its thing and take a JPEG. </p><p id=\"iqW8JO\">Multi-frame RAW, which several phone manufacturers (<a href=\"https://www.theverge.com/2020/12/14/22174433/apple-ios-14-3-pro-raw-iphone-12-pro-max-update-features\">including Apple</a>) have introduced, makes RAW much more useful, especially when you’re taking a photo with your phone. You get the best of both worlds: data from multiple frames recorded into a single file, plus plenty of flexibility for editing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qJXpdB6Y_Vfsjl2s7Z2y7FqTyJ4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256281/ajohnson_220216_5032_0008.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>All three Galaxy S22 devices can use Expert RAW.</em></figcaption>  </figure><h2 id=\"W8WW5r\">Which Samsung phones offer Expert RAW?</h2><p id=\"1c70Rz\">The Galaxy S22 series, including the standard S22, S22 Plus, and S22 Ultra, have all supported Expert RAW as of February 25th. Samsung plans to expand support to some older models, but there are certain hardware requirements a phone has to meet to be able to run Expert RAW, so only a handful of other top-tier devices will offer it. That list includes:</p><ul><li id=\"fEo9SW\">Galaxy S21 Ultra, full release from beta expected sometime in March </li><li id=\"3OdsH2\">Galaxy Z Fold 3, support expected in April</li><li id=\"U8flp5\">Galaxy S20 Ultra, Note 20 Ultra, and Z Fold 2, support expected in the first half of 2022</li></ul><h2 id=\"5CozxZ\">How do you shoot photos in Expert RAW?</h2><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FJQ9INaE3eKpPg_qCGwPRsZ5-I8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283433/ER_shoot.jpg\">      <figcaption><em>The Expert RAW app provides manual exposure controls for all three of the S22’s rear cameras.</em></figcaption>  </figure></div><p id=\"WxP9zw\">The feature isn’t included in the standard Samsung camera app; it’s actually an entirely separate app that needs to be downloaded from the Galaxy Store. Open the store app and search for Expert RAW. Once you’ve downloaded it and agreed to give it access to your camera and microphone, you’re ready to start shooting multi-frame RAW files.</p><p id=\"KqsyH2\">The Expert RAW interface is similar to the Pro mode in the standard camera app, including the letter icons at the bottom of the screen that indicate the 0.6x, 1x, and 3x lens options. When you press the shutter, you’ll see text urging you to hold the phone still while the phone grabs multiple frames. Related: Expert RAW isn’t something you’ll want to use for moving subjects. </p><p id=\"XXChgK\">The resulting files are big – around 30MB to 40MB each in my testing. There’s a high-efficiency RAW option you can toggle on if you tap the settings icon on the shooting screen, but it only saved me a couple of MBs per image. Unless you bought a phone with massive storage, you’ll want to stick to using Expert RAW when it will really make a difference, not all the time.</p><h2 id=\"qyy1vO\">How do you edit Expert RAW images?</h2><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/g0eBk3cqGSn6XbRpb7R_Q-kVrqM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283436/ER_edit.jpg\">      <figcaption><em>Expert RAW files tolerate an extreme edit like lifting deep shadows better than a single-frame RAW.</em></figcaption>  </figure></div><p id=\"eGltll\">Expert RAW files are saved as standard DNG files, so you can take them into any RAW processing software that you like. Samsung includes a Lightroom shortcut in the Expert RAW app, but if you want to go that route, you’ll need to download Lightroom from the Galaxy Store and log in with an Adobe account. Downloading from the Galaxy Store entitles you to a two-month free trial, but after that, you’ll need to pony up for the $119 annual subscription. </p><p id=\"MH8YWA\">In any case, you can tap the share icon when reviewing your image to take your photo into a free app like Snapseed or save it to cloud storage to edit on a desktop.</p><p id=\"fchroq\">With your image in the editing software of your choice, you’ll enjoy more freedom to push shadows or pull back highlights than with a standard RAW file. I took a standard RAW and a multi-frame RAW of the same backlit scene for comparison purposes, and the difference is significant. Pushing the shadow slider all the way +100 on both photos, there’s some clear banding in the standard RAW, while the Expert RAW looks much cleaner. </p><p id=\"UV0zn4\">So when you’re shooting a scene with a wide dynamic range, this is definitely the better RAW mode to use – just don’t get too trigger-happy if you want to go easy on your phone’s storage.</p><p id=\"ewoKdu\"></p><p id=\"jnHfNw\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/xRtvFgjYWnukQfRe8tFZMpWBa_8=/0x15:2040x1083/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23256273/ajohnson_220216_5032_0003.jpg",
  "description": "Get ready for a trip to the Galaxy Store.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}