{
  "title": "How to use your own controllers to play Google Stadia",
  "url": "https://www.theverge.com/22982878/google-stadia-controller-how-to-pair-bluetooth-ps4-ps5-xbox",
  "date": "2022-03-18T14:30:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/duxdMQ0e-bEGreAtbua7QSWuGF4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70640953/akrales_191113_3779_0284.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"XRwsUb\">The <a href=\"https://www.theverge.com/2020/4/8/21213679/google-stadia-free-pro-trial-launch-price-features\">free tier of Google Stadia</a> launched back in 2020, so access to Google’s cloud game streaming service is readily available to a wide range of people <a href=\"https://support.google.com/stadia/answer/9338852?hl=en\">across a list of countries</a>. If you want to try it out yourself but don’t feel like ponying-up the $69 for the official Stadia Controller, you thankfully don’t need to let that stop you. </p><p id=\"6uvYpE\">You can, of course, <a href=\"https://store.google.com/us/product/stadia_controller?hl=en-US\">buy one from Google</a> if you choose to. And if you want to play wirelessly on the Chromecast Ultra, the company’s Stadia Controller is currently your only option to do that. But on PC and mobile, the service also works wirelessly with most popular console gaming controllers, including the Xbox Series X / S controller and the PlayStation 4’s DualShock 4 controller. Even controllers dating back to the Xbox 360 will work. </p><div class=\"c-float-right\"><aside id=\"bAokuN\"><q>Google’s Stadia Controller is the only one that works with Chromecast Ultra</q></aside></div><p id=\"GJ9bVJ\">For the most part, the wired and wireless controller support in Stadia is good, though not perfect. For instance, Stadia has support for some wireless controllers, but others might need to be physically plugged in to work as intended. And whether it works wirelessly or not might come down to which device you’re playing on: a Windows 10 / Windows 11 / Linux / macOS PC running Google Chrome or <a href=\"https://support.google.com/stadia/answer/9578631\">one of the few supported devices running Android 10 or later</a>.</p><p id=\"ip0BSt\">It’s all a little complicated, but below, we try to make it easy with some steps to get popular controllers connected to Stadia on any device that is supported.</p><aside id=\"SmllBj\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to pair a PS4 or Xbox controller with your iPhone, iPad, Apple TV, or Android device\",\"url\":\"https://www.theverge.com/2019/10/1/20893268/ios-13-ipados-tvos-android-pair-ps4-xbox-one-controller-gaming-apple-arcade-google-play-pass\"},{\"title\":\"How to connect your Xbox controller to a PC or phone and swap back to your console\",\"url\":\"https://www.theverge.com/22273528/how-to-xbox-series-x-controller-swap-connection-phone-pc\"}]}'></div></aside><h2 id=\"3ARYAX\"><a href=\"https://www.theverge.com/2019/12/2/20978071/playstation-dualshock-controllers-modern-shape-design-ps5-25th-anniversary\">PlayStation DualShock 4 controller</a></h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/f9GuqEvt2EN62yNy9WrRrDFuuRA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13712123/akrales_190123_3174_0105.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"dSB1fv\">Sony’s aging controller for the PlayStation 4 works wired or when connected via Bluetooth with your computer running Google Chrome (version 77 or greater). This controller also works with phones running Android 10 or later in wired or Bluetooth mode. Sadly, the newer <a href=\"https://www.theverge.com/21562206/ps5-dualsense-controller-review-games-features-vibrations\">PlayStation 5 DualSense controller</a> does not share this Stadia compatibility. So if you kept your DualShock 4 around, you’re covered until maybe future updates from Google enable DualSense support.</p><p id=\"QM3jwf\">To use a DualShock 4 with Stadia via a wired connection, just find a Micro USB to USB-A cable and link the two sources. The drivers should download automatically.</p><p id=\"lymDxb\">To connect it wirelessly via Bluetooth to either your computer or a phone, make sure the device that will host Stadia is in Bluetooth pairing mode. Then, on the DualShock 4, press and hold its “Share” button just to the left of the touchpad, then hold the middle “PlayStation” button with the logo on it. The light bar at the top of the controller will start to blink, an indicator that it’s looking for a device to pair up with. They should find each other. If not, try it again.</p><div id=\"IvUPhD\"><div data-anthem-component=\"productcard:11100866\"></div></div><h2 id=\"oxlukD\"><a href=\"https://www.theverge.com/21452750/microsoft-xbox-series-x-controller-1tb-expansion-cards-hands-on\">Xbox Series X / S and Xbox One controllers</a></h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jOvMyoqUYxKCLfBJrV5_ap6qsC8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21904643/twarren_xboxseriesxcontroller_VLS_3616_2_4.jpg\">      <cite>Photo by Tom Warren / The Verge</cite>  </figure><p id=\"kuct2X\">It’s the exact same story for the Microsoft Xbox Series X / S controller and older Xbox One controllers. Stadia supports these controllers on PC (on Chrome with version 77 or later installed) whether it’s wired or if you’re connected via Bluetooth. Phones that can run Stadia will also support the controller, either wired or wire-free.</p><p id=\"sXf8wz\">The Xbox One controller, just like the DualShock 4, has a Micro USB port, while the newer Xbox Series controller got the upgrade to USB-C. You can connect any of them to your PC with the corresponding cable. They’re fairly easy and cheap to find, and you probably already own one or a few.</p><p id=\"NzFsns\">Before trying to connect your Xbox One controller via Bluetooth, ensure that it’s Bluetooth-ready to begin with. Microsoft has made a few different models of that controller, one of which doesn’t support Bluetooth. Thankfully, there’s an easy way to tell: if your gamepad has glossy plastic surrounding the Xbox button, it does not support Bluetooth. If it has a 3.5mm headphone jack on the bottom, it’s another indication that it has Bluetooth and will work. If you have the newer Xbox Series controllers, fear not, as all of them support Bluetooth.</p><p id=\"bTxEje\">To start pairing the controller, turn it on by holding down the Xbox button in the middle. Once it lights up, click and hold the connect button on the top edge of the controller until the Xbox logo blinks faster. This indicates that you’re ready to pair. Now, just make sure your target device (be it a phone or PC) is in pairing mode.</p><div id=\"gFLwrX\"><div data-anthem-component=\"productcard:11100937\"></div></div><h2 id=\"zP3ieN\"><a href=\"https://www.theverge.com/circuitbreaker/2017/2/24/14699044/nintendo-switch-pro-controller-hands-on-preview\">Nintendo Switch Pro controller</a></h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6yrravQwglpzWOC1tZVT479bwzQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8028811/jbareham_170221_1475_0010.0.jpg\">      <cite>Photo by James Bareham / The Verge</cite>  </figure><p id=\"xxkYFf\">The Switch Pro controller will work with Google Chrome on your PC, either wired or via Bluetooth. If you want to connect it with a wire, Nintendo’s controller plugs in with a USB-C cable. </p><p id=\"Yp3TRr\">To use it with phones running Android 10 or later that support Stadia, Google lists the Switch Pro controller as not compatible with it either as a wired or wireless controller. That said, it worked fine as a Bluetooth controller in our experience. Your experience may vary, but it’s worth a try if you already own one.</p><p id=\"OrFRwu\">To set it up, just click and hold the small sync button near the Switch Pro controller’s USB-C port. Then pair it in your device’s Bluetooth settings. (Oddly, the pairing LEDs on the controller keep running back and forth as if it didn’t connect, but it worked with any Stadia game that I tried.)</p><div id=\"StfDQB\"><div data-anthem-component=\"productcard:11100944\"></div></div><h2 id=\"umCz8k\"><a href=\"https://www.theverge.com/circuitbreaker/2019/3/19/18273461/google-stadia-cloud-gaming-service-controller-hands-on-gdc-2019\">Google Stadia Controller</a></h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QWqFcYqEf7A94fqBf1lGwblPJ_4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19376603/akrales_191113_3779_0309.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"Jt5ikQ\">Google’s Stadia Controller is currently the only controller that will work wirelessly on a TV with a Google Chromecast Ultra hooked up to it. Initially, it couldn’t work wirelessly with PCs or Android 10 devices, but thankfully, both of those limitations have been addressed. <a href=\"https://www.theverge.com/2020/5/5/21248769/google-stadia-controller-wireless-computers-desktop-laptop\">It can now be used wirelessly with your PC</a>. Also, back in June 2020, Google released an update that allows it to <a href=\"https://www.theverge.com/2020/6/30/21308374/google-stadia-controller-wireless-android-mobile-support\">connect wirelessly to phones running Android 10 or later</a>.</p><div id=\"0G2Aiz\"><div data-anthem-component=\"productcard:11100957\"></div></div><h2 id=\"stnCxQ\"><a href=\"https://www.theverge.com/2019/10/31/20926499/microsoft-xbox-elite-wireless-controller-series-2-review-price-specs-features\">Other controllers</a></h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Kfpt1JyQtKlkjOblg8nGq5jUnPQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/12901257/akrales_180817_2578_0006.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"iOj2kd\">Google’s support page lists other controllers, like the Xbox One Elite controller, Xbox Adaptive Controller, and even the Xbox 360 controller, that will work with Stadia. You can see the <a href=\"https://support.google.com/stadia/answer/9578631?hl=en\">running list of controllers here</a>, which also shows their level of wired and wireless support currently allowed by Stadia.</p><p id=\"KUPmY7\">Google notes that its list of tested controllers isn’t exhaustive and that you might experience luck with other models. My <a href=\"https://www.theverge.com/good-deals/2019/11/26/20984123/valve-steam-controller-discontinued-sale-price\">Steam Controller</a> worked nearly perfectly with its wireless adapter plugged into my PC, as well as wired, but I couldn’t get Stadia on my Pixel 3 to notice it. On the other hand, my wired PDP Faceoff controller for Nintendo Switch didn’t work. So if you aren’t seeing the controller you own on this list, give it a try anyway. It may work.</p><div id=\"yhR90E\"><div data-anthem-component=\"productcard:11100964\"></div></div><p id=\"JHN9BY\"><em><strong>Update June 30th, 2020, 4:55PM ET:</strong></em> <em>Google updated the Stadia Controller to work wirelessly with Android 10 devices, so you no longer need to tether the controller to your phone to play on the go.</em></p><p id=\"3eI257\"><em><strong>Update March 18th, 2022, 10:30AM ET:</strong></em><em> This article was originally published on April 10th, 2020, and has been updated to account for changes in the various operating systems and newly compatible products.</em></p><p id=\"kj7CJt\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tMWeGxufOIyCMOv3Ri-D0fpyfjM=/0x261:2040x1329/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19376602/akrales_191113_3779_0284.jpg",
  "description": "DualShock 4 and Xbox controllers work wired or wirelessly.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}