{
  "title": "HP has a Center Stage clone in one of its monitors ",
  "url": "https://www.theverge.com/2022/5/14/23072682/hp-center-stage-clone-monitors-z24m-video-conferencing",
  "date": "2022-05-14T15:42:10.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CqneXhBpfbP0ijl-EGFgNYrn-Jw=/0x0:1887x1258/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70869443/hp_z24m_webcam_monitor.0.png\" />        <figcaption>The Z24m comes with a 5MP tiltable webcam. | Image: HP</figcaption>    </figure>  <p id=\"uNTtRB\"><a href=\"https://press.hp.com/us/en/press-releases/2022/z-by-hp-powers-todays-professionals-create-without-limitation.html\">HP’s upcoming 23.8-inch Z24m monitor</a> is geared toward creative professionals and comes with a webcam that tracks your movement to keep you in the frame during video calls, much like Apple’s Center stage feature in its Studio Display and some iPads (via <a href=\"https://arstechnica.com/gadgets/2022/05/hp-monitors-built-in-5-mp-webcam-keeps-you-in-frame/\"><em>Ars Technica</em></a>). The Z24m’s 5MP tiltable webcam sits at the top of the monitor, which, as <em>Ars Technica </em>points out, is supposed to put its focus on you even if other people are in the background of the shot.</p><p id=\"AmvoV1\">An HP spokesperson also told <em>Ars Technica</em> that you can adjust the webcam’s settings to make it track you quicker. And while you can’t remove the webcam from the monitor, you can push it down to hide it from view. The Z24m also has dual noise-canceling microphones and dual speakers that could eliminate the need to use external headphones and a microphone. As for the display itself, the Z24m has an IPS panel with a resolution of 2560 x 1440, a fairly fast 90Hz refresh rate, a 5ms response time, as well as support for HDR.</p><div class=\"c-float-right\"><aside id=\"X89MZk\"><q>The Z24m is set for release in July</q></aside></div><p id=\"BdFknA\">The monitor supports HP’s <a href=\"https://support.hp.com/us-en/document/ish_5824936-5824987-16\">Auto Lock &amp; Awake</a> functionality as well. This feature uses a built-in proximity sensor — not the webcam — to detect when you’re in front of the screen. If you enable the feature, the monitor should automatically lock itself when you walk away and turn itself back on when you’re back.</p><p id=\"qjVyfX\">It’s unclear how HP’s webcam tracking feature compares to <a href=\"https://support.apple.com/en-us/HT212315\">Apple’s Center Stage</a>, which uses machine learning technology to help keep you (and anyone else in the frame with you) in the center of the screen. The 27-inch Studio Display comes packed with the iPhone 11’s <a href=\"https://www.theverge.com/2022/3/9/22968960/apple-studio-display-a13-spatial-audio-center-stage-hey-siri\">A13 Bionic chip</a> to help power the 12MP webcam’s Center Stage functionality, among other features. There have been some issues with the webcam’s image quality, however — Apple has <a href=\"https://www.theverge.com/2022/4/26/23042940/apple-studio-display-webcam-beta-fix-release-image-quality\">pushed a software update</a> to address this, but it <a href=\"https://www.theverge.com/23044788/apple-studio-display-webcam-update-testing-comparison\">still hasn’t been fully fixed</a>.</p><p id=\"5jyLXz\">The Z24m is set for release in July, and there isn’t any pricing information available just yet. HP is also releasing the Z24q for $347 this month, a monitor with very similar specs but no video conferencing features. If that’s any indication of the Z24m’s price, it will likely sit far below the Studio Display’s $1,599 price tag, potentially existing as a more affordable alternative.</p><aside id=\"IGASPw\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"HP’s ZBook Studio G9 puts an RTX 3080 Ti in an ultraportable chassis \",\"url\":\"https://www.theverge.com/2022/5/12/23067671/hp-zbook-studio-g9-workstation-laptop-rtx-3080-ti-specs-price\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/z6gDn_4ucnaX8v-Zs5G8M6vY7eo=/0x0:1986x1040/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23467556/hp_z24m_webcam_monitor.png",
  "description": "The Z24m’s webcam keeps you in the frame.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}