{
  "title": "HP’s ZBook Studio G9 puts an RTX 3080 Ti in an ultraportable chassis",
  "url": "https://www.theverge.com/2022/5/12/23067671/hp-zbook-studio-g9-workstation-laptop-rtx-3080-ti-specs-price",
  "date": "2022-05-12T12:00:00.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"A user works at a desk on the HP ZBook Studio G9 connected to an external monitor. \" src=\"https://cdn.vox-cdn.com/thumbor/JwtxZac_rVYzb_xXZFPzWK80mlc=/0x0:8688x5792/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70860301/ZBook_Studio_Creator_Workflow.0.jpg\" />        <figcaption><em>That’s the Studio on the right.</em> | Image; HP</figcaption>    </figure>  <p id=\"Ocdj4Q\">HP’s ZBook Studio is widely acknowledged as one of the best workstation laptops on today’s market. Last year’s model came with a stunning OLED touchscreen, a customizable RGB keyboard, and a versatile set of features that you’ll be hard-pressed to find in too many other business lines. Most impressively, it takes the powerful specs many professionals need and crams them into a chassis that’s under three pounds.  </p><p id=\"O5VEsv\">Studio fans will be happy to hear that HP has refreshed the device. The new ZBook Studio G9 can be configured up to a GeForce RTX 3080 Ti or an RTX A5000. (The two are comparable in terms of raw power, but the A5000 is meant for heavier production workloads like machine learning and simulation.)</p><p id=\"nRqvvC\">HP says that ZBook Studio models will start at 3.81 pounds (1.73 kg), but that “weight varies by configuration and components.” That means we don’t know exactly how light the RTX 3080 Ti and RTX A500 models specifically will be, but it seems reasonable to expect that they might weigh in under four pounds. For machines intended to handle 3D design and machine learning, that’s quite impressive. I did lift one up in HP’s demo area, and can confirm that it doesn’t feel much like picking up a <a href=\"https://www.theverge.com/23010080/gigabyte-aero-16-review-creator-laptop-price-specs-features\">heavy-duty workstation</a>.</p>  <figure class=\"e-image\">        <img alt=\"A user works on an HP ZBook Studio G9 connected to two external monitors also branded with a Z at a desk with a whiteboard in the background.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0OLuLlBEkPVfp8_whw-67pNjTb4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454762/ZBook_Studio_G9_Data_Science.jpg\">      <cite>Image; HP</cite>      <figcaption><em>The logo is something different.</em></figcaption>  </figure><p id=\"VvYqCY\">The other thing I’ve always liked about the ZBook Studio is the RGB keyboard. That’s not generally something you expect to see anywhere near a business laptop. This isn’t one of those <a href=\"https://www.theverge.com/22287698/razer-book-13-review-design-specs-price-features\">classy RGB keyboards that looks like it’s trying to be office-appropriate</a>, either — it’s per-key, customizable, and as flashy and bright as the gaming rigs of old. The idea, I assume, is that you may want to use the device for some gaming at home when you’re done with your data science workload, or whatever, for the day. </p><p id=\"ESp2oT\">The universally praised OLED screen returns to the 2022 ZBook Studio but, in more welcome changes, the device has been moved to 16:10 — an objectively better aspect ratio than the previous 16:9, sorry haters. <em>Verge </em>writer Cameron Faulkner used the words “stunning,” “brilliant,” and “a treat to look at” to describe this panel in his review of<a href=\"https://www.theverge.com/22671603/hp-zbook-studio-g8-laptop-business-gaming-review\"> last year’s model</a>. In even better news, this year’s screen has a 120Hz refresh rate, whereas last year’s buyers had to choose between the OLED and 120Hz.</p>  <figure class=\"e-image\">        <img alt=\"A user sits at a desk with an HP ZBook Fury G9 connected to a Z-branded monitor in an office speaking to a coworker to their left.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KB205s304UOpfg3aJxS168KlTg0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454829/Product_Dev.jpg\">      <cite>Image; HP</cite>      <figcaption><em>This is the ZBook Fury G9, which looks very similar.</em></figcaption>  </figure><p id=\"J8Rvoh\">Professionals who don’t mind a bit more heft may be more interested in the ZBook Fury G9, also refreshed for 2022. This laptop, which starts at 5.4 pounds, will be powered by what HP describes as “a desktop class 55W Intel CPU,” which we can safely assume means that it will be in the first wave of laptops to incorporate <a href=\"https://www.theverge.com/2022/5/10/23065131/intel-core-i9-12950hx-mobile-laptop-processor-16-cores-55-watts\">Intel’s brand-new 12th-Gen HX series</a>. These are expected to be both the most powerful and most power-hungry mobile processors on the market. Graphics options don’t appear to be available yet; HP’s datasheet for the Fury helpfully states that it will include “Nvidia RTX laptop GPUs or AMD Radeon RX GPUs.” </p><p id=\"Y4QGfx\">Both the ZBook Studio and the ZBook Fury are expected in June with pricing still to be announced. They are, let’s say, unlikely to be cheap. Our 2021 Studio configuration, which had an RTX 3070, was almost $5,000.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1SNP2OE989H7anCYO6aJTkc63Pg=/0x987:8688x5536/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23454742/ZBook_Studio_Creator_Workflow.jpg",
  "description": "It’ll be one of the lightest workstations you can buy.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}