{
  "title": "Huawei gets into e-readers with the 10.3-inch MatePad Paper",
  "url": "https://www.theverge.com/2022/2/28/22954498/huawei-matepad-paper-e-reader-e-ink-price-news-features-m-pencil-stylus",
  "date": "2022-02-28T15:43:22.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OnXAbGB_ZaQdWZkKwPpD5cfWXEY=/0x1:6000x4001/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70560250/MatePad_Paper.0.jpg\" />        <figcaption><em>The Huawei MatePad Paper.</em> | Image: Huawei</figcaption>    </figure>  <p id=\"pfTP73\">Huawei has announced its first ever e-reader, the MatePad Paper. But this is a little different from a typical Kindle. For starters, it’s compatible with Huawei’s M-Pencil stylus, so it can be used for taking notes in addition to just reading <a href=\"https://www.theverge.com/21403489/remarkable-2-e-ink-paper-tablet-review\">like the reMarkable 2</a> or <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fshop.boox.com%2Fproducts%2Fnoteair2&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F28%2F22954498%2Fhuawei-matepad-paper-e-reader-e-ink-price-news-features-m-pencil-stylus\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Onyx Boox Note Air 2</a>, and there’s also a built-in microphone for voice recording. It also has a larger 10.3-inch E Ink display compared to the roughly 7-inch screens found on most Kindles.</p><p id=\"ls6gWG\">These specs mean that the MatePad Paper has the potential to be a productivity device, in addition to a device aimed purely at consumption. It’s almost more like an Android tablet that happens to be equipped with an E Ink screen, right down to the fact that it’s running Huawei’s HarmonyOS software and comes pre-installed with the company’s App Gallery. </p><div class=\"c-float-right\"><aside id=\"gp4l5O\"><q>Yes, it charges via USB-C</q></aside></div><p id=\"khGGp1\">If you’re looking to use the device purely as an e-reader, then Huawei advertises that it’s equipped with the company’s own Huawei Books store, which offers access to 2 million books. Huawei adds that it’s compatible with PDF files as well as other standard e-reader formats. But popular ebook marketplaces like Amazon’s Kindle app and Google Play Books aren’t currently listed on Huawei’s App Gallery, which might mean your existing library of e-books won’t seamlessly carry over.</p><p id=\"nBhvMx\">Huawei says the MatePad Paper has a fingerprint sensor built into its power button, a USB-C port for charging and data transfer, 4GB of RAM, 64GB of built-in storage, and a backlight with 32 brightness levels. Its battery can last four weeks on standby, according to Huawei. The company hasn’t provided any specific details on which technology it’s using to allow the M-Pencil to write on the display, but given the stylus requires a charger, we’re assuming it’s using an AES-style drawing layer like an iPad, rather than EMR like its E-Ink rivals.</p><p id=\"V8lGhE\">All these features don’t come cheap, with the Huawei MatePad Paper at a recommended retail price of €499 (around $558). That’s a lot compared to the starting price of around €90 for Amazon’s Kindles, but it’s more in line with a comparable Android tablet like the Onyx Boox Note Air 2, which retails for €499 in Europe. At least Huawei is including an M-Pencil and cover as standard with the MatePad Paper. Huawei has yet to announce a release date or markets for its debut e-reader, but a US release seems unlikely.</p><p id=\"Ss7teh\">The MatePad Paper has been announced alongside a range of new Huawei devices at this year’s Mobile World Congress in Barcelona. There’s the MateBook X Pro laptop, the MateBook E 2-in-1, the MateStation X all-in-one PC, a laser printer called the Huawei PixLab X1, and a portable Bluetooth speaker called the Sound Joy. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nzFWWaOxYaeEcdvlVISJ4JosP8M=/0x431:6000x3572/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23276955/MatePad_Paper.jpg",
  "description": "Priced at €499.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}