{
  "title": "Hulu subscribers can score three months of PC Game Pass for free",
  "url": "https://www.theverge.com/2022/5/12/23068445/hulu-pc-game-pass-deal-three-free-months",
  "date": "2022-05-12T18:00:00.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DdOatS9e60jmzRtCuMPy4uRkS6E=/263x0:1823x1040/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861891/6Krbuy0.0.jpg\" />        <figcaption><em>Get three months of Xbox Game Pass for free by redeeming this offer through Hulu.</em></figcaption>    </figure>  <p id=\"5VJhMK\">It's getting increasingly difficult to recommend Microsoft’s Game Pass subscription to anyone without also sounding like an absolute shill. The latest promotion to offer an accessible introduction to this awesome service comes courtesy of Hulu. <a href=\"https://help.hulu.com/s/arrival?c__campaignName=hulu.xbox.gamepass\">Current Hulu subscribers will be able to get a free three-month subscription to PC Game Pass and can redeem this offer through July 23rd</a>. Note that this promotion is valid only for PC Game Pass, not Game Pass Ultimate, and may only be redeemed by new Game Pass subscribers.</p><aside id=\"dtwvL7\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Xbox Game Pass is reportedly getting a family plan\",\"url\":\"https://www.theverge.com/2022/3/31/23004950/xbox-game-pass-family-plan-rumors\"}]}'></div></aside><p id=\"cRctra\">Normally, PC Game Pass costs $9.99 a month, but there’s no obligation to continue your subscription after the promotional period expires, so this is a great chance to try out not just AAA titles but also maybe some indie hits you may have slept on. Some of the standout titles offered by Game Pass include <em>Halo Infinite</em>, <em>Forza Horizon 5</em>, <em>Tunic</em>, and <em>Boyfriend Dungeon</em>.</p><p id=\"5dpM3V\">PC Game Pass allows you to access a rotating library of titles from a variety of developers. Game Pass Ultimate offers many of the same features but also allows you to access many of the same titles on your Xbox console and stream them to mobile devices. Subscribing to either service also nets you access to EA Play. Once a standalone service, EA Play includes titles like <em>The Sims 4, It Takes Two, </em>and<em> Star Wars Jedi: Fallen Order</em>. </p><p id=\"Q0xcrb\">For more awesome deals on games, accessories, and other neat tech, make sure to <a href=\"https://twitter.com/VergeDeals\">follow </a> <a href=\"https://twitter.com/VergeDeals\">@VergeDeals on Twitter</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mCVm-pO1CNmJnqHCRMmSjBf5Ulk=/50x0:2036x1040/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16328613/6Krbuy0.jpg",
  "description": "This offer is valid for current subscribers until July 23rd.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}