{
  "title": "Hulu with Live TV is adding unlimited DVR for free",
  "url": "https://www.theverge.com/2022/3/11/22973002/hulu-with-live-tv-unlimited-dvr-youtube",
  "date": "2022-03-11T19:00:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/aiEdNRT9Z7HFrjrOeo8IsTJvUm8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70609984/acastro_200320_1777_huluStock_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"CNlWS4\">Hulu with Live TV is giving its users unlimited DVR starting next month at no additional cost — a feature that’ll allow it to compete more directly with cord-cutting rival YouTube TV.</p><p id=\"wKM1Rt\">The feature will apply to all Hulu with Live TV subscriptions beginning April 13th and will support ​​playback and fast-forwarding on recordings for up to nine months (the same storage period <a href=\"https://support.google.com/youtubetv/answer/7129564\">supported by YouTube TV</a>). Previously, Hulu with Live TV supported up to 50 hours of DVR storage but could upgrade to up to 200 hours of storage through add-ons that ranged in price from $10 per month to $15 per month. </p><p id=\"2MYEa6\">Those customers who opted into add-on packages that supported additional DVR space will no longer be charged for the added storage beginning April 13th.</p><p id=\"tgC4tb\">Unlimited DVR space has long been one of the most attractive features of YouTube TV, and its addition to Hulu with Live TV is one of a handful of recent changes to the service that help Hulu with Live TV stay competitive in the pay-TV space. In December of last year, Hulu with Live TV bumped its base tier up to <a href=\"https://www.theverge.com/2021/11/19/22792286/hulu-live-tv-price-increase-70-disney-bundle\">$70 per month</a> from $65 per month — the price of YouTube TV — but bundled in Disney Plus and ESPN Plus at no additional cost.</p><p id=\"8YB1Vj\">Hulu with Live TV features over 80 channels, whereas YouTube TV features more than 100 in its base plan. While Hulu with Live TV is slightly more expensive, nuking its paid DVR plans and adding two separate services that cost $15 between the two of them adds a ton of value for households, particularly for families.</p><p id=\"eqnmI3\">“Through one single subscription, users get access to 80+ live channels — including all the major broadcast networks — as well as Hulu, Disney+, ESPN+, and soon Unlimited DVR,” Joe Earley, president of Hulu, said in a statement. “Guided by our relentless focus on delivering the consumer a high-quality user experience, we will be one of the only pay TV providers — traditional or streaming — to offer this feature as part of the base plan at no additional cost.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mM12mFGMZ55sF3_kH8Mu8an-5cQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19821428/acastro_200320_1777_huluStock_0003.0.jpg",
  "description": "Unlimited DVR space arrives April 13th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}