{
  "title": "Humble’s indie lineup includes Monaco 2 and a musical RPG",
  "url": "https://www.theverge.com/2022/3/17/22981048/humble-games-indie-showcase-monaco-2-stray-gods",
  "date": "2022-03-17T15:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"Monaco II\" src=\"https://cdn.vox-cdn.com/thumbor/lJt9MxBCUC2oqCI82sUNqK3cemo=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70635756/Monaco_Screenshot_05.0.jpg\" />    </figure>  <p id=\"XEVt1E\">It may be best known for its regular bundles of games and other entertainment, but Humble Games is also an indie publishing label. And today the company detailed its upcoming slate of games which includes everything from a sequel to the classic heist game <em>Monaco</em> to a roleplaying musical called <em>Stray Gods</em>.</p><p id=\"brna3c\">We don’t know much about <em>Monaco 2</em> — it doesn’t have a release date yet — but it is once again being developed by Pocketwatch Games, and is described as a game that “will test players’ skills in brain-bending 3D environments, procedurally generated by an AI mastermind designed to concoct high-stakes challenges and infinite sneaky, stealy fun.”</p><p id=\"ijk2sE\"><em>Stray Gods</em>, meanwhile, was previously known under the name <a href=\"https://www.fig.co/campaigns/chorus-an-adventure-musical\"><em>Chorus</em></a>, and is being developed by Summerfall Studios, led by David Gaider, lead writer on the first <em>Dragon Age</em>. It sounds... pretty out there. Here’s the official description and trailer:</p><blockquote><p id=\"HMt4tg\">In a modern fantasy world where the Greek gods live hidden among us, Grace is granted the power of a Muse to draw others into musical numbers… power that she’ll need to find out the truth behind her predecessor’s death before time runs out. Unravel the mystery of the last Muse through your choices in a beautifully hand-illustrated roleplaying musical. </p></blockquote><div id=\"AE5NJv\"><div ><iframe src=\"https://www.youtube.com/embed/vyFbt8dffKk?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"JAQ3s8\">Other games include <em>Coral Island</em>, a farm-sim about ocean conservation (no release date or platforms were announced); <em>Moonscars</em>, a dark fantasy action game (due out this summer on PC); <em>Ghost Song</em>, a spooky <a href=\"https://www.theverge.com/2017/9/14/16303016/metroid-nintendo-influence-legacy\">metroidvania</a> (PC, no release date); a “classic survival horror experience” called <em>Signalis</em> (PC and Xbox, out this fall); the rhythm RPG <em>Infinite Guitars</em> (no announced release date or platforms); the <em>Carmen Sandiego</em>-style adventure game <em>Chinatown Detective Agency</em> (out April 7th on PC, Xbox, and Switch); and a turn-based tactical RPG called <em>The Iron Oath</em> (out on Steam early access on April 19th).</p><div id=\"Laepd1\"><div data-anthem-component=\"gallery:11098315\"></div></div><p id=\"pCVP0d\">It’s an eclectic lineup, and one that helps solidify Humble Games’ place in <a href=\"https://www.theverge.com/2018/4/4/17199388/indie-game-publishers-double-fine-annapurna-devolver-skybound\">the small-but-growing list of notable indie publishing labels</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/17PpEDyfysKbesjbhgKnCCqC3_Q=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320496/Monaco_Screenshot_05.jpg",
  "description": "The label has some range.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}