{
  "title": "Hummer EV recalled over faulty taillight software — and quickly fixed",
  "url": "https://www.theverge.com/2022/3/18/22984911/hummer-ev-recall-taillight-software-fixed",
  "date": "2022-03-18T17:11:16.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FRlqTAZlypRJGYlIBp3UqF2vp6g=/99x0:1169x713/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70642018/hummer_ev_suv_001.0.jpg\" />    </figure>  <p id=\"5SAzug\">The 2022 Hummer EV was barely out of the starting gate before it got hit with its first recall. General Motors issued a recall last week for at least 10 of the electric pickup trucks after determining that there was something wrong with the software that powers the taillights. (Yep, you read that right. Cars are basically just rolling computers now.)</p><p id=\"T0ddSG\">The official cause of the problem is the “[e]mbedded software in the microcontroller in the taillamp assembly,” according to <a href=\"https://static.nhtsa.gov/odi/rcl/2022/RCLRPT-22V141-4804.PDF\">the recall notice</a> filed with the National Highway Traffic Safety Administration. </p><div class=\"c-float-right\"><aside id=\"6wmqC9\"><q>The software bug can affect one or both of the taillights</q></aside></div><p id=\"aWJlEr\">The software bug can affect one or both of the taillights, causing them to be partially illuminated or all-the-way ineffective. That extends to the brake light, turn signals, backup lamp, side marker, and clearance lamp. In some cases, the taillight remained on even after the vehicle was turned off. </p><p id=\"RRpEi4\">The problem was discovered by two GM employees based on field reports of the Hummer EV, which only just started shipping late last year. The automaker said it received three complaints about malfunctioning taillights from January 8th through February 7th, though there have been no crashes reported as a result of the defect. </p><p id=\"xP19hg\">Apparently, the fix is so easy it’s already been taken care of. A spokesperson for <a href=\"https://www.motor1.com/news/574250/gmc-hummer-ev-taillight-recall/\">GMC told <em>Motor1</em></a> that the company has reached out to all the affected owners and swapped out the faulty taillights. Other Hummers that have yet to ship were fixed prior to delivery. </p><p id=\"Py0Rzq\">“All customer vehicles have been fixed and we apologize for any inconvenience this issue caused our customers,” a GM spokesperson said in an email. The spokesperson added that the 10 impacted vehicles do not represent the entire population of Hummer EVs that have been delivered to customers. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7I8KHI0uZkc2PYiC3V5RDpLjsgw=/0x25:1268x689/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22419271/hummer_ev_suv_001.jpg",
  "description": "The fix is already in.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}