{
  "title": "Hyper Light Breaker is the new 3D co-op successor to the acclaimed Hyper Light Drifter",
  "url": "https://www.theverge.com/2022/4/1/23006014/hyper-light-breaker-sequel-drifted-announcement-steam-early-access-spring-2023",
  "date": "2022-04-01T10:43:10.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OzLcWgV7HSCet_rKPG0vPUeUJAk=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70697398/ss_c7fd637170fa8b9049f5a4998c67c859117cc672.0.jpg\" />    </figure>  <p id=\"qoR5EM\">Heart Machine, developers of the acclaimed, stylish, and difficult 2D action RPG <em>Hyper Light Drifter, </em>have announced a new game set in the same universe: <em>Hyper Light Breaker</em>.</p><p id=\"mf1KOY\">Available via Steam Early Access some time in Spring 2023, <em>Hyper Light Breaker</em> is a 3D title with single player and co-op modes. As per <a href=\"https://store.steampowered.com/app/1534840/Hyper_Light_Breaker/\">the game’s Steam page</a>, players will:</p><blockquote><p id=\"fOPiGc\">Enter the Overgrowth, a new land in the world of Hyper Light. Play alone or with friends to explore massive biomes, defeat brutal monsters, create new builds, survive the mysterious Crowns and overthrow the almighty Abyss King in this action rogue-lite adventure from the creators of Hyper Light Drifter.</p></blockquote><p id=\"BxS0ET\">An announcement trailer only shows a few glimpses of pre-alpha gameplay after an animated fight scene that matches the balletic action style of the original <em>Hyper Light Drifter</em>. Screenshots show a few different biomes, snaps of combat, and the main character tearing around on a hoverboard. The title card also shows a few different character silhouettes — perhaps different options for the game’s co-op mode. </p><div id=\"2SshZW\"><div data-anthem-component=\"gallery:11123989\"></div></div><p id=\"3wDYfJ\">Heart Machine isn’t calling this a sequel explicitly, and there’s no clear indication what the story will look like. It isn’t the studio’s first foray into 3D, though: that would be last year’s <em>Solar Ash. </em>Fans will no doubt be hoping that the team <a href=\"https://www.theverge.com/2021/12/6/22820899/solar-ash-impressions-annapurna-interactive-heart-machine\">learned the lessons of that title</a>, which offered some fantastic movement mechanics but was let down by sterile world-building.</p><p id=\"wqRfIZ\">Gearbox Publishing is working with Heart Machine to publish <em>Hyper Light Breaker</em>. The game will be available on PC, with no other platforms mentioned in the announcement.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SBPkzCRvcArKlm0PFu3c6PRYcvs=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23359893/ss_c7fd637170fa8b9049f5a4998c67c859117cc672.jpg",
  "description": "A 3D successor to the beloved Hyper Light Drifter.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}