{
  "title": "I do not fear Jurassic World Dominion’s dinosaurs or its raptor-infested future",
  "url": "https://www.theverge.com/tldr/22927445/jurassic-world-dominion-dinosaur-future-raptor-fight-battle-win",
  "date": "2022-02-11T13:48:33.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/h1NKYbHGsvvIqk_YwqaFyCKdFqs=/310x0:2146x1224/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70497176/Screen_Shot_2022_02_11_at_8.11.32_AM.0.png\" />    </figure>  <p id=\"tygBjB\">The latest trailer for <a href=\"https://www.theverge.com/2022/2/10/22927076/jurassic-world-dominon-trailer\"><em>Jurassic World Dominion</em> has arrived</a>, picking up on the cliffhanger from <a href=\"https://www.theverge.com/2018/6/6/17434496/jurassic-world-fallen-kingdom-review-chris-pratt-bryce-dallas-howard\"><em>Jurassic World: Fallen Kingdom</em></a> and showing off a (jurassic) world that is now full of feral dinosaurs, roaming the fields, streets, and forests. </p><p id=\"wbTOoD\">This, the movie seems to be positing, is a bad thing, one that might see the dinosaurs move to displace man from its place on the top of the evolutionary food chain. “Humans and dinosaurs can’t coexist!” Laura Dern’s returning Dr. Ellie Sattler explains in a voiceover, amidst shots of T-rexes running wild. “We’re racing towards the extinction of our species” adds Jeff Goldblum’s Dr. Ian Malcolm in a subsequent shot.</p><aside id=\"ojE2HT\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The dinos have already won in Jurassic World Dominion’s new trailer\",\"url\":\"https://www.theverge.com/2022/2/10/22927076/jurassic-world-dominon-trailer\"}]}'></div></aside><p id=\"ndwI5g\">Ignoring the fact that having dinosaurs running around everywhere would be, objectively, cool as hell, this entire attitude is bullshit. (Dinoshit?) I do not fear <em>Jurassic World</em> or its raptors running rampant, and neither should you. Here’s why. </p><p id=\"Oi0P2s\"><em>(Disclaimer: I am not a paleontologist.) </em></p><p id=\"5GwfgR\">First, we need to address how we got here. Dinosaurs were extinct, then brought back for a theme park (where people ended up getting eaten), then some other movies happened (more people eaten), then brought back for another theme park (maybe not the best idea, people were eaten). <em>Jurassic World: Fallen Kingdom</em> picks up with the dinos — threatened by a volcano — rescued from the island, when they’re attempted to be sold on the black market. Hijinks ensure, the dinos get out, and now we’re stuck with them. </p><p id=\"2wv8nG\"><em>Jurassic World Dominion</em> picks up four years later, with humans attempting to coexist with dinosaurs, which are somehow immune to cold now (you know, the thing that messed ‘em up real good the first time around). How we got from the relatively few dinosaurs that escaped in <em>Fallen Kingdom</em> to the worldwide dinosaur infestation that <em>Dominion</em> has is left as an exercise for the viewer — I’m just going to go with the fact that the world has lots of dinosaurs, and that’s the situation. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kMeRJkvBkA-oLRZ1QA4MmL34cIA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23234943/Screen_Shot_2022_02_11_at_8.11.52_AM.png\">      <figcaption>There is nothing to be concerned about in this scene.</figcaption>  </figure><p id=\"zWG4Es\">But that’s exactly where the movie loses me. Wild animals — even really, really big ones — are not exactly a massive threat to humankind in the modern era. Humans have things like armies and weapons and walls and cities. We’ve grown pretty good at the whole “keeping animals away from us” strategy. Sure, <em>Jurassic Park</em> posits that a <a href=\"https://www.youtube.com/watch?v=dnRxQ3dcaQk\">raptor could open a door</a> — but can it eat through concrete? Can it successfully use the weird electronic swipe card that I need to get into our office building? Can it fix the lock on my apartment building door? (No seriously, can it?)</p><p id=\"XUjAjM\">Even large animals — think mountain lions, bears, or elephants — do not pose an overly large threat to mankind. The most deadly animals to humans <a href=\"https://www.cnet.com/pictures/the-24-deadliest-animals-on-earth-ranked/24/\">annually are <em>mosquitos</em></a>, which kill around a million people a year by transmitting various diseases. Snakes and dogs are also high on the list (one due to being venomous, the other by being extremely prevalent in human society), but putting insect-borne diseases aside, the most dangerous creature on earth to people is... other people. </p><p id=\"YNP3SA\">One possible argument that the dinosaurs in <em>Jurassic World</em> would pose a bigger threat to humans is that unlike wolves, deer, bears, tigers, and the other animal inhabitants of our world, they haven’t learned through eons that human cities aren’t a safe place to hang out, and would be more likely to roam around Rome. But there’s a good reason that wolves aren’t prowling the streets of major cities — because the <em>ones that did died.</em> </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/COJaOvq4M-Pz2ivOq85sa6eSAI4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23234946/JurassicWorld.0.jpeg\">  </figure><p id=\"dqHKfb\">Could an elephant (or, say, a very large dinosaur like a brontosaurus) theoretically barrel through your wall? Probably. Would a T-rex, or the genetically engineered super-dinos of the movies, make you a tasty snack, given the chance? Also yes. But I wouldn’t give them great odds against things like “New York City traffic” or the sheer stopping power of modern weaponry. </p><p id=\"XFwHRU\">(It’s important to remember that dinosaurs, contrary to what the <em>Jurassic Park</em> franchise would have you believe, <a href=\"https://www.theverge.com/2018/6/19/17478458/dinosaurs-bulletproof-jurassic-world-fallen-kingdom-indoraptor-chris-pratt\">were not even a little bit bulletproof</a>.) </p><aside id=\"OqJgzU\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Were real dinosaurs as bulletproof as the one in Jurassic World: Fallen Kingdom? \",\"url\":\"https://www.theverge.com/2018/6/19/17478458/dinosaurs-bulletproof-jurassic-world-fallen-kingdom-indoraptor-chris-pratt\"}]}'></div></aside><p id=\"Ob62QD\">The idea that dinosaurs returning would somehow be an existential threat to humanity is patently absurd. Look at all the animals that mankind <a href=\"https://en.wikipedia.org/wiki/Category:Species_made_extinct_by_human_activities\">completely offed just by <em>accident</em></a>! (A list that doesn’t even count the ones <a href=\"https://en.wikipedia.org/wiki/Category:Species_made_extinct_by_deliberate_extirpation_efforts\">that we <em>intentionally </em>wiped out</a> over the course of human history.) [<em>Editor’s note: To be clear, this is a bad thing that humanity should not be proud of.]</em></p><p id=\"zolewl\">But even putting aside all the benefits of modern technology, building materials, and the general improvements of human civilization, I <em>still </em>would give myself good odds against a raptor. At the end of the day, we’re talking about something with the brainpower of a very smart chicken here — I like my chances. Also, raptors can’t read, so I am not overly concerned about them finding this post and discovering my brilliant stratagems ahead of time.</p><div class=\"c-float-right\"><aside id=\"BcPjxN\"><q>Also, raptors can’t read</q></aside></div><p id=\"lFay1O\">Some might say that this is sheer overconfidence. Those are also the kind of people who said “maybe don’t build a theme park full of gigantic, lethal dinosaurs” in the first place. But, like the illustrious John Hammond, if I am to be defeated by an army of out of control dinosaurs, it will not be because of a lack of hubris. </p><p id=\"bbqK7v\"><em>Jurassic World Dominion</em> opens in theaters on June 10th, 2022, assuming the dinosaurs survive in the wild that long. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nN2sNqX5V_vjx11tOzoSiKN-qh4=/59x0:2397x1224/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23234945/Screen_Shot_2022_02_11_at_8.11.32_AM.png",
  "description": "Ignoring the fact that a dinosaur-filled world would be, objectively, awesome",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}