{
  "title": "I saw Samsung’s first-ever QD-OLED TV, and it’s impressive",
  "url": "https://www.theverge.com/2022/4/4/23009841/samsung-qd-oled-tv-s95b-preview",
  "date": "2022-04-04T15:00:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wrqfQQa4q2tMwy2JPyWBDf6oz04=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70707925/cwelch_220331_5121_0016.0.jpg\" />    </figure>  <p>QD-OLED isn’t some revelatory improvement, but you can see the difference</p> <p id=\"BEbWMn\">It’s April, which means we’ve reached shipping season for the latest and greatest TVs announced back at CES. I recently had a chance to get a preview of Samsung’s 2022 lineup in person. Samsung is the number one TV maker in the world by market share, and the reason for that success is that Samsung sticks closely to its smartphone strategy: there are TVs at every price point, whether you want a giant 8K TV — there’s still no reason to buy one of those, people — or a budget 4K set that’s far more sensible in price. </p><p id=\"XJbs9a\">Last year, Samsung hopped on the big trend of Mini LED TVs, which offer better brightness and contrast than past models by shrinking down the local dimming zone LEDs and cramming in way more of them. There are new versions of those TVs coming out this year, but I’m way more excited about the company’s <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.samsung.com/us/televisions-home-theater/tvs/oled-tvs/55-class-s95b-oled-4k-smart-tv-2022-qn55s95bafxza/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">first-ever QD-OLED set, the S95B</a>. </p><p id=\"51J4Lm\">Yes, joining the rest of Samsung’s 2022 lineup is a new 4K OLED TV available in 65- and 55-inch sizes. Samsung <em>dabbled</em> in OLED TVs like… a decade ago… but ever since then, the dominant player has been LG and, in particular, LG Display. That’s the company that produces the OLED TV panels for LG Electronics, Sony, Vizio, and other brands. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/udRg-Fck-gVuidrG4nIHhL81BAQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360328/cwelch_220331_5121_0014.jpg\">      <figcaption><em>Samsung’s S95B 4K OLED comes in 55-inch and 65-inch sizes.</em></figcaption>  </figure></div><p id=\"QOE8HE\">You might be wondering why Samsung, a major supplier of OLED screens for phones, tablets, and laptops, has completely ceded the OLED TV market to LG. There are a couple reasons. The main issue is that these two companies are fierce competitors, and Samsung wasn’t about to stick an LG OLED inside one of its TVs. It’s also been trying to look beyond OLED with futuristic concepts <a href=\"https://www.youtube.com/watch?v=QN9XI0ll_Us\">like The Wall and Micro LED</a>. </p><p id=\"7YHqET\">But what’s changed recently is that  Samsung Display — the sister company of Samsung Electronics — has come up with its own TV-sized OLED panel. And it’s said to be more advanced than the LG panels that already offer phenomenal picture quality and get such rave reviews year after year. Samsung is using what’s called QD-OLED. The QD stands for “quantum dot” and gives away how this display technology differs from LG’s W-OLED, also known as WRGB OLED. </p><p id=\"e0AWBR\">The differences here can get pretty technical, but as a short overview, all OLED screens are self-emissive, meaning each pixel can create its own light without the backlight systems that LCD TVs need. They can also individually shut off, which is how you get those perfect blacks that OLED is known for. At the base level, LG Display’s OLED panels mix blue and yellow to create white sub-pixels that then go through a color filter to create red, green, and blue. But that color filter absorbs some of the brightness, so LG adds a white sub-pixel to make up for that. Even so, one weakness of OLED is that it can’t reach the same peak brightness or HDR highlights as the best LCD TVs. A lot of people don’t care, but if your TV is going in a very sunny room, you might. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zbqwk74xEeoPmBYa5IuHI0dUlF0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360326/cwelch_220331_5121_0012.jpg\">      <figcaption><em>It uses a QD-OLED panel from Samsung Display.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oiA5GfGTmkGqvwObPaDSiGKHanw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360327/cwelch_220331_5121_0013.jpg\">      <figcaption><em>The QD-OLED panel can produce richer colors at higher brightness levels.</em></figcaption>  </figure></div></div></div><p id=\"2gLRn1\">QD-OLED doesn’t offer any major brightness breakthroughs, unfortunately. But there are other legitimate improvements. Samsung Display starts with blue pixels and runs those through quantum dots to create red and green, with those original pure blue sub-pixels also passing through. It’s way more efficient than the color filter method, and so there’s no need for a white sub-pixel to help bring brightness back up. It might sound like a subtle change in approach, but it makes all the difference. That’s because one of the biggest advantages of QD-OLED is improved color brightness and saturation. Colors still look vivid even during <em>very</em> bright scenes, and reds, greens, and blues come off the screen as deeper and just more pure to your eye. </p><p id=\"hhCnpq\">That said, I’m not talking about some huge difference here. It’s the sort of thing that’s only noticeable in side-by-side comparisons. And Sony, which is also using these new QD-OLED panels in one of its high-end 2022 TVs, let me do just that a few weeks ago. Granted, this was a very controlled demo, but the QD-OLED TV did hit saturation levels of red and green that Sony’s older TV, with an LG Display OLED, couldn’t quite match. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MEmysllUi9bGXzrGP6GjQkRqvl0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360325/cwelch_220331_5121_0011.jpg\">      <figcaption><em>Like other OLED TVs, Samsung’s S95B has a very thin design.</em></figcaption>  </figure></div><p id=\"K9Odgr\">Sony told me that while it’s not seeing substantial brightness upgrades in terms of nits, our eyes perceive the QD-OLED screen as brighter overall because of the superior color brightness. Off-angle viewing, which is already fantastic on OLED TVs, is another thing that’s ever so slightly better on QD-OLED. So by early accounts, QD-OLED could further refine what are already the best TVs you can get. </p><p id=\"IyXne7\">But the strange part about all this is that Samsung Electronics isn’t really hyping the OLED much. It’s not putting any special attention on the QD-OLED panel in its marketing. It’s just calling this the Samsung OLED TV. And technically, it’s not even the company’s flagship TV for 2022. I think this low-key introduction is partly because Samsung has spent <em>years</em> ragging on OLED as not being the best fit for TVs. It <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.samsung.com/uk/support/tv-audio-video/what-is-burn-in/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">made a whole website</a> about the risk of burn-in and proudly said that its LCD TVs were unaffected by it. </p><p id=\"eQRuit\">So it’s a little awkward for Samsung to now do an about-face and bring an OLED TV to market. Samsung Display has claimed that QD-OLED screens should have even better resistance to burn-in than other panels. It’s still technically possible but unlikely on most OLED TVs nowadays — including recent sets from LG and others.  </p><p id=\"fslj4f\">As for pricing, I’m actually pleasantly surprised. The 65-inch S95B costs $3,000, while the 55-inch size runs $2,200. That’s expensive, sure, but comparable to what LG is charging for its own flagship G2 OLED this year, which features a brighter panel than ever before. So despite having a first-generation panel inside, Samsung isn’t demanding some huge premium. Sony’s TV with the QD-OLED screen will inevitably cost more, but I’d also expect it to have better image processing — and it supports Dolby Vision, which Samsung continues to ignore because it’s hell-bent on making HDR10+ happen. I’m at least glad that all four HDMI ports are now 2.1 and support 4K at 120Hz. (Samsung’s top-tier LCD TVs can  go all the way up to 144Hz this year.)</p><p id=\"VGWDfP\">Long story short, if your goal is to get a TV with the best possible picture quality, OLED remains the answer in 2022. And I’m not just talking about this year’s stuff: there’s nothing wrong with older models if you can find a deal — and <a href=\"https://www.theverge.com/22371561/best-4k-tv-deals-sale-lg-samsung-sony-tcl\">we’ve got you covered there</a>.</p><p id=\"AZ3a9x\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/W28a1G3IWgX9fjZoe9CuKnO700k=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23360330/cwelch_220331_5121_0016.jpg",
  "description": "It’s not a revelation, but you can see the improvements.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}