{
  "title": "iFixit’s Steam Deck replacement parts will be available beginning this summer",
  "url": "https://www.theverge.com/2022/3/4/22962087/ifixit-steam-deck-replacement-parts-summer",
  "date": "2022-03-04T22:02:03.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vsTMNxpOL2iBuw4PHktD9OgrBuw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70581122/vpavic_220210_5030_0021.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"k2Jkq9\">iFixit plans to start offering Steam Deck replacement parts this summer, iFixit’s Kevin Purdy tells <em>The Verge</em>. Valve first announced <a href=\"https://www.theverge.com/2022/2/15/22935171/valve-steam-deck-replacement-parts-teardown-ifixit\">in February</a> that the repair experts at iFixit would be one of the authorized sellers of replacement parts but did not give a specific timeline as to when they would be available. The vast majority of consoles aren’t easily user repairable, so making official Steam Deck replacement parts available, even if they aren’t out just yet, is a good thing for consumers. And hopefully, it will push other hardware makers to do the same in the future. </p><p id=\"DC1Bc2\">We’ve asked iFixit if it can share information about which parts you’ll be able to get and how much they’ll cost. In <a href=\"https://www.theverge.com/2021/10/6/22713075/valve-steam-deck-teardown-repair-open\">Valve’s official Steam Deck teardown video from October</a>, the company said “thumbsticks, SSDs, and possibly more” would be available, so it’s possible those will be listed at iFixit.</p><div class=\"c-float-right\"><aside id=\"UgT2Yq\"><q>Valve has strongly cautioned against opening the Steam Deck</q></aside></div><p id=\"HSwVON\">However, in that video, Valve <em>strongly</em> cautioned against opening up a Steam Deck. “Even though it’s your PC — or it will be once you’ve received your Steam Deck — and you have every right to open it up and do what you want, we at Valve really don’t recommend that you ever open it up,” the video’s narrator said. “The Steam Deck is a very tightly designed system, and the parts are chosen carefully for this product with its specific construction, so they aren’t really designed to be user-swappable.” But if you’re willing to roll the dice to swap something out of your Deck, it sounds like you’ll be able to get official replacement parts from iFixit this summer.</p><p id=\"hq1CdZ\">Earlier this week, it felt like there might be an urgent need for replacement parts when a few of the first Steam Deck owners reported seeing thumbstick drift, a problem best known to happen with some <a href=\"https://www.theverge.com/21504741/nintendo-switch-joy-con-drift-problem-explained\">Nintendo Switch Joy-Con controllers</a>. Fortunately, Valve said <a href=\"https://www.theverge.com/2022/3/1/22956866/valve-steam-deck-stick-drift-replacement\">the drift was a software bug</a> — not a hardware issue — and shipped a fix within hours. Three people who had been experiencing drift told <em>The Verge</em> that the update looked to have fixed things.</p><p id=\"PHuQ5c\">If you want to be notified when iFixit’s Steam Deck official replacement parts are available, you <a href=\"https://ifixit.activehosted.com/f/62?utm_content=buffer90757&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer\">can enter your email on a waitlist</a>. And while you wait, consider checking out iFixit’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ifixit.com%2FNews%2F57101%2Fsteam-deck-teardown&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F4%2F22962087%2Fifixit-steam-deck-replacement-parts-summer\" rel=\"sponsored nofollow noopener\" target=\"_blank\">official teardown of the device</a>. </p><hr class=\"p-entry-hr\" id=\"yBT5wp\"><h2 id=\"mSheGy\">Related:</h2><div id=\"gqSIXF\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Steam Deck|106078\" data-volume-uuid=\"fef96bfb9\" data-volume-id=\"106078\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-689\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/RmCve0YjWPYqIqv49hJSMBrwrOw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23269997/vpavic_220210_5030_0021.jpg",
  "description": "We don’t know which parts will be available, though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}