{
  "title": "I’m done with Wyze",
  "url": "https://www.theverge.com/23003418/wyze-cam-v1-vulnerability-no-patch-bitdefender-responsible-disclosure",
  "date": "2022-03-30T23:13:23.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GpJRwYT8oKTCarx_Z96NnwE6P4M=/0x0:1080x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70692066/wyze_cam_6.0.jpg\" />        <figcaption>Image: Wyze</figcaption>    </figure>  <p id=\"2XoChp\">I just threw my Wyze home security cameras in the trash. I’m done with this company. </p><p id=\"ttCVtQ\">I just learned that <em>for the past three years</em>, Wyze has been fully aware of a vulnerability in its home security cameras that could have let hackers look into your home over the internet — but chose to sweep it under the rug. And the security firm that found the vulnerability largely let them do it.</p><div class=\"c-float-right\"><aside id=\"WGQyYd\"><q>Three years</q></aside></div><p id=\"jySnem\">Instead of patching it, instead of recalling it, instead of just, you know, <em>saying something</em> so I could stop pointing these cameras at my kids, <a href=\"https://www.theverge.com/2022/1/27/22904844/wyze-discontinues-smart-security-camera-wyzecam-v1\">Wyze simply decided to discontinue the WyzeCam v1</a> this January without a full explanation. But on Tuesday, security research firm Bitdefender <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.bitdefender.com%2Fblog%2Flabs%2Fvulnerabilities-identified-in-wyze-cam-iot-device%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23003418%2Fwyze-cam-v1-vulnerability-no-patch-bitdefender-responsible-disclosure\" rel=\"sponsored nofollow noopener\" target=\"_blank\">finally shed light</a> on why Wyze stopped selling it: because someone could access your camera’s SD card from over the internet, steal the encryption key, and start watching and downloading its video feed. </p><p id=\"3CSzAR\">Nowhere is Wyze saying anything like that to customers like me. Not when it discontinued the camera, not in the three years since Bitdefender brought it to Wyze’s attention in March 2019, and possibly not ever: Wyze spokesperson Kyle Christensen told me that as far as the company is concerned, it’s already been transparent with its customers and has “fully corrected the issue”. But Wyze only corrected it for newer versions of the WyzeCam, and even then it only finished patching the v2 and v3 on January 29th, 2022, <a href=\"https://www.bleepingcomputer.com/news/security/wyze-cam-flaw-lets-hackers-remotely-access-your-saved-videos/\">according to <em>BleepingComputer</em></a>.</p><p id=\"ov2pzU\">As far as being transparent, the most I’ve seen Wyze tell customers was that “your continued use of the WyzeCam after February 1, 2022 carries increased risk, is discouraged by Wyze, and is entirely at your own risk.” It also sometimes sends vague emailed messages like this to its customers, which I used to appreciate but am now retroactively questioning:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sz3CdFXZNAI9qe_quUByAEQOr24=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23356619/wyze_security_update.jpg\">      <cite>Screenshot by Sean Hollister / The Verge</cite>      <figcaption><em>From a January 6th email titled “Terms of Service and Security Updates”</em></figcaption>  </figure><p id=\"1sC6EG\">When I read those words about “increased risk” in <a href=\"https://www.theverge.com/2022/1/27/22904844/wyze-discontinues-smart-security-camera-wyzecam-v1\">our <em>Verge</em> post</a> regarding the WyzeCam v1’s discontinuation, I remember thinking it just referred to <em>future</em> security updates — not a major vulnerability that already exists.</p><hr class=\"p-entry-hr\" id=\"zfO3HZ\"><p id=\"uEgMGP\">Here’s another question, though: Why on earth would Bitdefender not disclose this for three whole years, when it could have forced Wyze’s hand?</p><div class=\"c-float-right\"><aside id=\"3iRBAy\"><q>Why are we just hearing about this now?</q></aside></div><p id=\"6aIx5M\">According to the security research firm’s <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.bitdefender.com%2Ffiles%2FNews%2FCaseStudies%2Fstudy%2F413%2FBitdefender-PR-Whitepaper-WCam-creat5991-en-EN.pdf&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23003418%2Fwyze-cam-v1-vulnerability-no-patch-bitdefender-responsible-disclosure\" rel=\"sponsored nofollow noopener\" target=\"_blank\">own disclosure timeline (PDF)</a>, it reached out to Wyze in March 2019 and didn’t even get a <em>response</em> until November 2020, a year and eight months later. Yet Bitdefender chose to keep quiet until just yesterday.</p><p id=\"e1FF4B\">In case you’re wondering, no, that is not normal in the security community.  While experts tell me that the concept of a “responsible disclosure timeline” is a little outdated and heavily depends on the situation, we’re generally measuring in <em>days</em>, not years. “The majority of researchers have policies where if they make a good faith effort to reach a vendor and don’t get a response, that they publicly disclose in 30 days,” Alex Stamos, director of the Stanford Internet Observatory and former chief security officer at Facebook, tells me.  </p><p id=\"kkISuH\">“Even the US government has <a href=\"https://vuls.cert.org/confluence/display/Wiki/Vulnerability+Disclosure+Policy\">a 45-day default disclosure deadline</a> to prevent vendors from burying bug reports and never fixing them,” writes Katie Moussouris, founder and CEO of Luta Security and co-author of the international ISO standards for vulnerability disclosure and vulnerability handling processes.</p><p id=\"5rqvyx\">I asked Bitdefender about this, and PR director Steve Fiore had an explanation, but it doesn’t sit well with me. Here it is in full:</p><blockquote><p id=\"OlsJvT\">Our findings were so serious, our decision, regardless of our usual 90-day-with-grace-period-extensions-policy, was that publishing this report without Wyze’s acknowledgement and mitigation was going to expose potentially millions of customers with unknown implications. Especially since the vendor didn’t have a known (to us) a security process / framework in place. Wyze actually implemented one last year as a result of our findings (<a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__www.wyze.com_pages_security-2Dreport&amp;d=DwMGaQ&amp;c=7MSjEE-cVgLCRHxk1P5PWg&amp;r=XbPQjtdhJg1hC5-IccTkDxSrqhL0VWnmU2huSyK6TFc&amp;m=IHfVj1B1xk0xaQ4xlN6yxWyjwHIrYSILDBSgY1Vjy4uupMoH4Qjf1ApQmk1nLtl1&amp;s=M83u9C9XVhGEAZPmAMfKTlvAQWf8UHZ3Wc78Ua7YX-0&amp;e=\">https://www.wyze.com/pages/security-report</a>).</p><p id=\"iJk3db\">We have delayed publishing reports (iBaby Monitor M6S cameras) for longer periods for the same reason before. The impact of making the findings public, coupled with our lack of information on the capability of the vendor to address the fallout, dictated our waiting.</p><p id=\"hbjLqc\">We understand that this is not necessarily a common practice with other researchers, but disclosing the findings before having the vendor provide patches would have put a lot people at risk. So when Wyze did eventually communicate and provided us with credible information on their capability to address the issues reported, we decided to allow them time and granted extensions.</p></blockquote><p id=\"MFvorA\">Waiting sometimes makes sense. Both of the experts I spoke to, Moussouris and Stamos, independently brought up <a href=\"https://www.theverge.com/2018/1/11/16878670/meltdown-spectre-disclosure-embargo-google-microsoft-linux\">the infamous Meltdown computer CPU vulnerabilities</a> as an example of where balancing security and disclosure was difficult — because of how many people were affected, how deeply embedded the computers might be, and how difficult they are to fix. </p><p id=\"8ZnEqt\">But a $20 consumer smart home camera just sitting on my shelf? If Bitdefender put out a press release two years ago that Wyze had a flaw it’s not fixing, it’s damn easy to stop using that camera, not buy any more of them, and pick a different one instead. “There’s an easy mitigation strategy for affected customers,” Stamos says.  </p><p id=\"ITOVD3\">The iBaby Monitor example that Bitdefender brings up is a little ironic too — because there, Bitdefender actually <em>did</em> force a company to action. When <a href=\"https://www.pcmag.com/news/exclusive-popular-baby-monitor-wide-open-to-hacking\">Bitdefender and PCMag revealed </a>that the baby monitor company hadn’t patched its security hole, the resulting bad publicity pushed them to fix it <a href=\"https://www.vox.com/recode/2020/2/26/21152920/ibaby-hacking-smart-baby-monitors-bitdefender\">just three days later</a>. </p><p id=\"q4kCWC\">Days, not years. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KjyynlIH-HKujcnJVTj9EO-QzNo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23356659/IMG_2070.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Not joking.</em></figcaption>  </figure><p id=\"21DRUM\">Now if you’ll excuse me, I need to go say goodbye to <a href=\"https://www.theverge.com/22787814/wyze-buds-pro-review-earbuds-headphones-audio-price\">those Wyze earbuds I liked</a>, because I’m serious about being done with Wyze. I was willing to write off <a href=\"https://www.theverge.com/2019/12/30/21042974/wyze-server-breach-cybersecurity-smart-home-security-camera\">the company’s disastrous leak of 2.4 million customers’ data</a> as a mistake, but it doesn’t look like the company made one here. If these flaws were bad enough to discontinue the camera in 2022, customers deserved to know that back in 2019.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BczQs_dsq7q-6YUFIwqSJN7C9io=/0x99:1080x664/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23199420/wyze_cam_6.jpg",
  "description": "Why are we only hearing about a huge security flaw now?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}