{
  "title": "I’m obsessed with a stick in Destiny 2: The Witch Queen",
  "url": "https://www.theverge.com/2022/2/28/22954604/destiny-2-the-witch-queen-glaive-review",
  "date": "2022-02-28T16:39:02.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JHBnJ7D4I5HzoFybxVAVWnRs90s=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70560532/2022_TWQ_Gear_Large15.0.jpg\" />        <figcaption>Image: Bungie</figcaption>    </figure>  <p id=\"dX1Yrl\">I’m obsessed with a stick in <em>Destiny 2: The Witch Queen</em>. That’s a sentence I never thought I’d utter before the new glaive weapon arrived in the game last week. Released as part of <em>The Witch Queen</em> expansion, the glaive is a powerful and versatile... stick. Or “stabby stabby murder sticks,” as Bungie <a href=\"https://www.bungie.net/en/Explore/Detail/News/51124\">described the glaives last week</a>. You can melee with it and slay enemies at close range, shoot a projectile from afar, or block an attack. </p><p id=\"1lB6Zq\">I’ve been hooked on the glaive ever since it dropped at the beginning of <em>The Witch Queen</em> campaign. I feel truly invincible with the glaive in <em>Destiny 2</em>, and it’s the first new weapon type in years that has made such an immediate impact on the way I play the game. </p><p id=\"eO0RfN\">When I first started using the glaive, it felt intriguing and unique, allowing me to perform attacks and wipe out enemies in ways I’ve never been able to in <em>Destiny 2</em> before. The projectile takes some mastering and skill, and I found the blocking perfect for when I was about to reload without cover, or when I underestimated the enemy shrieker that blasts you from above.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Nt7BXBhQ9oCQWvidCMAeUWaCrKU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277217/glaiveweapon.gif\">      <cite>Tom Warren / The Verge</cite>      <figcaption><em>The glaive lets you wipe out enemies with ease.</em></figcaption>  </figure><p id=\"2R0Mga\">The one thing I was really disappointed about was how slow it was to reload and use effectively. But there are more powerful perks you can unlock to overhaul how a glaive feels. Where the new Enigma glaive really gets interesting is when you start leveling it up and unlocking these perks thanks to <em>Destiny 2</em>’s new weapon crafting system. I picked the impulse amplifier and frenzy perks, which dramatically improve the reload speed, projectile speed, handling, and damage.</p><p id=\"qUb9XP\">The glaive feels totally different thanks to these perks, and my favorite pastime in <em>Destiny 2</em> is now running at a group of enemies and deleting them with melees from a stick. I find myself barely using any other weapons now. I’ve become a glaive addict.</p><p id=\"r2aVT8\">When you melee using the glaive, you don’t even use special ammo, so it’s a really effective way of clearing out a group of enemies at little cost. I’ve found an even more effective way to achieve this, too; I’ve equipped the “suppressing glaive” perk from the seasonal artifact. This transforms the glaive once again, by allowing you to suppress enemies just with a glaive melee.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/p2yr4RJL6Z-YZKdE36rhrb68KTQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277166/2022_TWQ_Gear_Large21.jpg\">      <cite>Image: Bungie</cite>      <figcaption><em>I can’t wait for the exotic glaives.</em></figcaption>  </figure><p id=\"coQbJg\">This suppression works on practically every enemy type, including high-level challenging enemies. So you can run at a group and stun the yellow-bar enemies, before working your way through the rest with just your glaive. Once you’re done, return to the yellow bars and finish them off, just as they’re recovering from being suppressed. It doesn’t work against most bosses, but for the rest it makes clearing activities a lot easier.</p><p id=\"PSOBo5\">I can’t wait to unlock the exotic versions of the glaives. Each class will get their own unique exotic glaive. The titan class can use its exotic glaive to spawn a protective shield around fellow guardians, similar to the void bubble super mechanic. Warlocks can deploy healing turrets with their glaive, which will complement the healing aspects of the solar and void subclasses for warlocks. Hunters will unleash an arc burst of chain lightning that tracks enemies with their glaive.</p><p id=\"qTTvJX\">There’s just something very satisfying about beating down enemies at close range in first-person, and <em>Destiny 2</em>’s swords don’t provide that same level of satisfaction. I’m sure the exotic glaives will only further my obsession with <em>Destiny 2’s </em>new stabby stabby sticks.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vWRW5Ve5L0tCpI6nhCq994DDBQY=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23277163/2022_TWQ_Gear_Large15.jpg",
  "description": "The new glaive weapon transforms Destiny 2.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}