{
  "title": "In controversial move, EU says nuclear power and gas can be green investments",
  "url": "https://www.theverge.com/2022/2/2/22914195/eu-nuclear-energy-gas-sustainable-climate-investment",
  "date": "2022-02-02T19:06:12.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Nuclear power plant Unterweser\" src=\"https://cdn.vox-cdn.com/thumbor/6A9RJOJlbrVEWeqrrLUE9cSQJ6A=/27x0:4940x3275/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70463384/1238132585.0.jpg\" />        <figcaption>02 February 2022, Lower Saxony, Stadland: The Unterweser nuclear power plant (KKU), which has already been decommissioned and has been in the process of being dismantled since 2018, stands behind photovoltaic panels of a solar park. | Photo by Hauke-Christian Dittrich/picture alliance via Getty Images</figcaption>    </figure>  <p id=\"8yq9WM\">The European Commission inflamed tensions over what role nuclear energy and gas should play in the clean energy transition when it proposed new <a href=\"https://ec.europa.eu/info/publications/220202-sustainable-finance-taxonomy-complementary-climate-delegated-act_en\">rules</a> today on what can be labeled a “green investment.” After more than a year of heated debate, it decided to consider gas and nuclear “sustainable” under certain conditions. </p><p id=\"ZrFseI\">“Taking account of scientific advice and current technological progress, the Commission considers that there is a role for private investment in gas and nuclear activities in the transition,” the Commission said in its <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_711\">announcement</a>. </p><p id=\"38UDcs\">The EU has <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/european-green-deal_en\">committed</a> to producing no net greenhouse gas emissions by 2050 — a target <a href=\"https://www.ipcc.ch/sr15/chapter/spm/\">research</a> has shown is necessary worldwide to prevent the worst effects of climate change. By 2030, the EU plans to slash emissions by more than half compared to 1990 levels. </p><div class=\"c-float-right\"><aside id=\"EcZWN0\"><q>“We need to use all the tools at our disposal”</q></aside></div><p id=\"ZM3B36\">To reach those goals, the bloc will need a grid that runs on carbon-free energy. But how much of that mix will consist of renewables like wind and solar versus more controversial energy sources like nuclear energy and gas is still up for debate. Nuclear energy comes with concerns about accidents and what to do with radioactive waste. The gas industry, meanwhile, has sold itself as a cleaner-burning alternative to other fossil fuels — but recent research has shown that it’s <a href=\"https://www.theverge.com/2021/5/6/22422824/natural-gas-infrastructure-methane-emissions-climate-change-air-pollution\">more polluting</a> than previously thought because of methane leaks. Methane, which makes up a majority of ‘natural gas,’ is a greenhouse gas <a href=\"https://www.epa.gov/gmi/importance-methane#:~:text=Methane%20is%20more%20than%2025,due%20to%20human%2Drelated%20activities.\">more than 25 times as potent</a> as carbon dioxide.</p><p id=\"CAQoQH\">“We need to use all the tools at our disposal,” Mairead McGuinness, commissioner for financial services, financial stability, and Capital Markets Union, said in a press statement. “Today we are setting out strict conditions to help mobilise finance to support this transition, away from more harmful energy sources like coal.”</p><p id=\"bu7aL3\">Under the Commission’s new rules, certain nuclear and gas projects can be labeled sustainable “transitional activities.” That means they’re supposed to help phase out dirty energy sources. The provisions outlined by the Commission include a 2030 deadline to get construction permits for new gas projects that limit their emissions and replace coal. New nuclear plants eligible to qualify as a sustainable investment would need to secure their construction permits by 2045. </p><p id=\"q3731S\">These new requirements represent an effort to classify nuclear energy and gas according to the EU Taxonomy, a set of guidelines for investors that’s meant “<a href=\"https://ec.europa.eu/commission/presscorner/detail/en/qanda_22_712\">to prevent greenwashing”</a> by <a href=\"https://ec.europa.eu/info/business-economy-euro/banking-and-finance/sustainable-finance/eu-taxonomy-sustainable-activities_en\">defining</a> what’s considered sustainable. </p><p id=\"4XJCOZ\">Those in favor of considering nuclear and gas sustainable under the right conditions say the technologies are needed to provide a consistent source of power when there isn’t abundant sunshine and wind. In the future, advanced batteries could solve that limitation with solar and wind energy. But in the meantime, there are already existing nuclear and gas power plants that can step in to keep the grid reliable, proponents say. </p><p id=\"SUXK20\">Nuclear and gas industries have also been promising technological advances to quell environmental and safety concerns. Small modular nuclear reactors under development, for instance, might require less fuel than older, less advanced reactors. Fossil fuel companies have also sold carbon capture technologies as a way to draw down planet-heating pollution coming from power plants. But the high costs of deploying these technologies have raised concerns about their feasibility and how they might affect customers’ utility bills. Energy prices are already volatile in Europe as countries phase out coal and grapple with a tight gas supply that <a href=\"https://www.npr.org/2022/02/01/1077198344/what-could-make-russia-turn-its-energy-sector-into-a-weapon\">Russia could squeeze</a> further as a political bargaining tool. </p><div class=\"c-float-left\"><aside id=\"BkxtK0\"><q>France against Germany and Austria</q></aside></div><p id=\"JRDVKv\">The controversy swirling around nuclear energy, in particular, pits France against Germany and Austria. France already sources more than 70 percent of its electricity from nuclear plants (making it more reliant on nuclear energy than any other country in the world), and it <a href=\"https://apnews.com/article/climate-business-europe-emmanuel-macron-environment-and-nature-541530ed81a84ef90860c9970f0a5517\">plans to build even more nuclear reactors</a> to hit its climate targets. Germany, on the other hand, plans to shut down all of its nuclear plants by the end of the year. Austria, which has also opposed an expansion of nuclear energy, threatened to <a href=\"https://www.france24.com/en/europe/20220202-austria-to-challenge-eu-s-proposed-nuclear-green-label-in-court\">take legal action</a> against the new rules.</p><p id=\"QtVs5N\">The new rules will go into effect in 2023 unless enough member states or Members of the European Parliament vote to block them. So far, about 250 MEPs have committed to blocking the rules,<em> </em><a href=\"https://www.reuters.com/business/sustainable-business/eu-proposes-rules-label-some-gas-nuclear-investments-green-2022-02-02/\"><em>Reuters</em> reports</a>. At least 353 votes are needed to stop the measures from moving forward. </p><aside id=\"TBrd2q\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Former Nuclear Regulatory Commission chair argues nuclear power isn’t a climate solution \",\"url\":\"https://www.theverge.com/2022/1/27/22904943/nuclear-power-climate-change-solution-gregory-jaczko\"}]}'></div></aside><div id=\"44oVOK\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Is it time to say goodbye to the gas stove?|101118\" data-volume-uuid=\"ab04c6075\" data-volume-id=\"101118\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-453\" class=\"volume-video\" data-volume-player-choice=\"youtube\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/LPIqLxF2mFvERJcO-5vwR6K-yzA=/0x338:4966x2938/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23213228/1238132585.jpg",
  "description": "Both power sources face fierce criticism.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}