{
  "title": "In the first trailer for Alex Garland’s Men, an ex-wife guy follows",
  "url": "https://www.theverge.com/2022/2/9/22925148/alex-garland-men-trailer",
  "date": "2022-02-09T15:01:37.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"A person standing in a tunnel and creating an optical illusion that looks a lot like a human skull.\" src=\"https://cdn.vox-cdn.com/thumbor/wHds0S6hr_zL3XKTc7Wz-Lv6zOk=/4x335:810x872/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70488052/slack_imgs.0.jpg\" />        <figcaption>A24</figcaption>    </figure>  <p id=\"AHxgz1\"><em>Men, </em><a href=\"https://www.theverge.com/2018/11/26/18112720/a24s-library-stream-available-free-kanopy-filmstruck\">A24</a>’s upcoming horror thriller from <a href=\"https://www.theverge.com/2018/2/21/17029500/annihilation-ex-machina-director-alex-garland-sci-fi\"><em>Annihilation </em>director Alex Garland</a>, tells the story of a woman attempting to put some literal and metaphorical distance between herself and a devastating loss by escaping to the English countryside only to find herself being followed by something or someone dead set on catching her. <em>Men</em>’s first trailer didn’t quite explain who the person tailing Harper (Jessie Buckley) is, but it more than seems like it may be her recently deceased ex-husband.</p><p id=\"L6gaqm\">In contrast to its title, <em>Men</em>’s first trailer seemingly only features one man — a guy looking much worse for wear than any living, breathing person — silently chasing after Harper through the lush landscape she was hoping to be able to enjoy. After first seeing the figure on the other side of a long tunnel, Harper begins spotting him everywhere she goes, looming with the sort of menacing energy that would make any person run screaming for their lives, even if there was no one around to hear or help them.</p><p id=\"DK1gYZ\"><em>Men </em>also stars Rory Kinnear and Paapa Essiedu and is slated to hit theaters on May 20th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GpJS3bt2noZjOdj-QjWhqvNWdB4=/0x416:810x840/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229208/slack_imgs.jpg",
  "description": "Men, A24’s new feature from Alex Garland, sees a woman on the run.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}