{
  "title": "In the latest Halo episode, Master Chief does the Covenant",
  "url": "https://www.theverge.com/2022/5/12/23069343/paramount-plus-halo-tv-show-master-chief-sex-scene",
  "date": "2022-05-12T21:14:51.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/HlM9c5s6gjv6OLOGC3VobKpo04c=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70862744/MasterchiefCensored.0.jpg\" />        <figcaption>Microsoft / Alex Castro / The Verge</figcaption>    </figure>  <p id=\"7hVC5E\">This week’s episode of Paramount Plus’ <a href=\"https://www.theverge.com/2022/3/23/22991842/paramount-halo-show-review\"><em>Halo</em> TV show</a> is incredible in the strictest definition of the term. I literally cannot believe what I have witnessed. </p><p id=\"vp5kBX\"><em><strong>Spoilers for Halo follow</strong></em></p><p id=\"8MYUEN\">Are you still here?</p><p id=\"jShERV\">Are you sitting down?</p><p id=\"Dp7b4p\">OK.</p><p id=\"aukiue\">In the latest episode of <em>Halo</em>, Master Chief Petty Officer John-117 fucks. He has sex with an undercover human Covenant spy after the two have bonded over their shared magical abilities surrounding the mysterious artifacts both the humans and Covenant have been after for most of the series. Apparently, the Master Chief is such a skilled lover that Makee, the Covenant spy, is all set to renounce her allegiance to humanity’s enemies. However, a series of misunderstandings and violent interactions with the UNSC leads Makee to change her mind about changing her mind, setting into motion events that could possibly precipitate the fall of the <a href=\"https://www.theverge.com/2019/12/4/20995409/halo-reach-steam-most-played-game-launch\">planet Reach</a>.</p><p id=\"XxTxKe\">In short: the Chief clapped cheeks, then came the <a href=\"https://www.halopedia.org/Fall_of_Reach\">Fall of Reach</a>.</p><p id=\"Y5IVEc\">I am unable to pick a side on this. I vacillate wildly between stunned incredulity and reverent awe at what the showrunners have done here. Even for a show <a href=\"https://www.theverge.com/2022/3/24/22994651/paramount-plus-halo-tv-show-halo-lore\">that’s pretty clear it wants nothing to do with the games</a> and offers completely new takes on established characters, it still feels wholly inappropriate to have the Master Chief fuck. We’re talking about a man who was kidnapped as a very young child and molded to be an emotionless super soldier dedicated to the preservation of humanity at all costs. Not only does this guy <em>not</em> fuck — I’m not convinced he would even know how.</p><div class=\"c-float-right\"><aside id=\"aMDgjd\"><q>In short: The Chief clapped cheeks, then came the Fall of Reach</q></aside></div><p id=\"YnhFyA\">The moment itself didn’t really read as a love scene but more like a comedy, especially because, as the camera fades away from John and Makee, it cuts to a wide-eyed Cortana — the AI in John’s head — who is forced to watch the sex unfold with this look of longing on her face. It was unintentionally hilarious. I laughed a full minute, upsetting my napping dog and my working partner.</p><p id=\"Y5A44u\">Whether the Master Chief and Spartans in general fuck is a relatively new question, traceable to, of all things, a dril tweet.</p><div id=\"nuyAXr\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">my main issue with \"master chief fucks cortana\" is if you read the halo novels youd know the space suit automatically jacks master chief off</p>— wint (@dril) <a href=\"https://twitter.com/dril/status/862757324305334273?ref_src=twsrc%5Etfw\">May 11, 2017</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"q5qpG6\">With dril’s brand of unhinged tweeting as the catalyst, people <a href=\"https://www.reddit.com/r/halo/comments/9czbmc/is_this_seriously_canon/\">started posting fake images </a>of pages from Eric Nylund’s <em>The Fall of Reach</em> featuring a passage describing that the functions of a Mjolnir power suit also include a “sexual stimulant.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vv7njwBX9yOHpqSykiyMJ1uaVFs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23457000/Screen_Shot_2022_05_12_at_4.46.11_PM.png\">  </figure><p id=\"RIbri4\">Though the images were fake, <a href=\"https://kotaku.com/no-master-chiefs-suit-does-not-jerk-him-off-1828786018\">a write-up of the incident at the time in <em>Kotaku</em></a> noted that <em>Halo</em> developers did not confirm or deny if Mjolnir armor is ribbed for Spartans’ pleasure. However, according to <em>The Fall of Reac</em>h, Spartan IIs — the generation of Spartans to which John belongs — are embedded with an emotion suppressant chip, a fact the <em>Halo</em> showrunners decided to stick with. When John removed that chip in the show, it became one of my favorite moments as I was touched by his sheer emotion at seeing the everyday things I take for granted. </p><p id=\"hZjtli\">While I’m still on the fence on how I feel about all this, I do think there are reasonable, canon-compliant explanations why the Master Chief got down with his Master Beef. It is internally consistent that a John, bereft of his emotional regulator, would be curious about sex. His training as a Spartan would have provided basic sex ed but only from a perfunctory, scientific approach. Also, the series has already shown him as highly emotional and vengeful about being denied a relationship with his parents. Outside of them, the only person with whom he’s had a real connection with outside of his Spartan life was Makee. I think, with his new emotions, he’d want to explore every facet of being human, which, for some people, includes sex.</p><p id=\"wbeNfe\">It is also correct that John, in his capacity as a Spartan, would do anything to complete his mission. Makee’s status as a Covenant insider and her more powerful connection with the artifacts make her important to the UNSC’s mission of finding the Halo weapon before the Covenant can. However, Makee doesn’t trust the UNSC enough to cooperate. That is until after she has sex with John. The Master Chief is the consummate soldier; he will use whatever tool necessary — including his own — to get the job done.</p><p id=\"4p8PEh\">As a <em>Halo</em> lore fan, I can’t say I have ever given too much thought to whether or not the Master Chief fucks. I obviously can’t speak for all <em>Halo</em> fans, but a quick look at the game’s AO3 section tells me other fans really haven’t either. There are about 2,000 fanfics under the <em>Halo</em> tag (1,400 when you remove all the crossover fics), and only about 400 of those are rated for sexual content. The most popular relationship is, of course, Master Chief and Cortana. But equal space is also given to pairings that don’t involve John at all, focused instead on side characters like Sarah Palmer, named Covenant characters, and my personal favorite <em>Halo</em> pairing, Tom-B292 and Lucy-B091. </p><p id=\"skeKu4\">While the <em>Halo</em> TV show doesn’t have its own tag yet, I can already see fics cropping up featuring John and Makee, John and Cortana, and, to my great pleasure, Miranda Keyes and Spartan Kai-125. This week’s episode was rife with interpersonal angst, which is catnip to fic writers so I expect more fics, especially ones that go into *ahem* <em>detail</em> about John and Makee’s lovemaking, to be up soon. Just don’t ask me to write any of them.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UIFt0LYRc_plo8CGI0CGcz_rll8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23457004/MasterchiefCensored.jpg",
  "description": "Master Chief’s game is so powerful it might destroy Reach.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}