{
  "title": "Influencers beware: promoting the wrong crypto could mean facing a class-action lawsuit",
  "url": "https://www.theverge.com/2022/2/18/22941470/bitconnect-ponzi-bitcoin-securities-act-sec-lawsuit-influencers-youtube-tiktok",
  "date": "2022-02-19T03:15:20.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_PAz-Z9vEI14k8rJUbZUYkree2g=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70527990/acastro_170726_1777_0007_v4.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"DZxxam\">The story of BitConnect doesn’t include any <a href=\"https://www.theverge.com/2022/2/8/22923772/doj-irs-bitfinex-hack-bitcoin-recovery-encrypted-files-razzlekhan\">rapping <em>Forbes </em>bloggers slash money launderers</a> or <a href=\"https://www.theverge.com/2022/2/10/22926057/celebrity-nft-disclosure-marketing-reese-witherspoon-gwyneth-paltrow\">dubiously-obtained ape JPGs</a>, but this “pyramid-on-Ponzi” case has spawned a court ruling (<a href=\"https://media.ca11.uscourts.gov/opinions/pub/files/202011675.pdf\">PDF</a>, embedded below, via <a href=\"https://twitter.com/stephendpalley/status/1494775036254859265\">@stephendpalley</a>) that should serve as a warning for influencers: they could be held liable for peddling shady crypto investments. </p><p id=\"A1baM3\">In case you’ve forgotten this particular scam, BitConnect’s promoters told its victims that if they handed over their Bitcoin for a period of time, their crypto would be used by an automated trading bot that would return huge profits. None of that was true, and the operators instead paid off older investors with funds from the new ones, bringing in $10 million per week at its peak. All told, the scam took in more than $2 billion worth of investments. </p><div class=\"c-float-right\"><aside id=\"mxbdxS\"><q>Soliciting investments using social media is still soliciting — and potentially breaking federal securities laws</q></aside></div><p id=\"DrMJhI\">In 2018, some investors filed a class-action lawsuit against BitConnect and several of its most prominent promoters, attempting to hold them liable under a violation of the 1933 Securities Act that blocks soliciting investments in unregistered securities. Glenn Arcaro, who had called himself BitConnect’s “number one promoter” and <a href=\"https://www.theverge.com/2021/11/18/22789507/crypto-scam-government-bitconnect-56-million-victim-reimbursement\">has already pleaded guilty to federal wire fraud charges</a>, argued successfully in district court to dismiss the case, as the court ruled that the investors' allegations did not amount to Arcaro actively trying to persuade them to invest.</p><p id=\"5zxiAd\">However, the investors appealed, and now the 11th Circuit Court of Appeals has now ruled in their favor to reinstate the section 12 claim they cited, allowing the case to proceed against Arcaro and one of his regional promoters, Ryan Maasen. </p><p id=\"hLSG20\">The appeals court found that “when the promoters urged people to buy BitConnect coins in online videos, they still solicited the purchases that followed.” In their opinion, Judge Grant wrote, “Securities Act precedents do not restrict solicitations under the Act to targeted ones [...] We never added that those efforts at persuasion must be personal or individualized.”</p><p id=\"vSsk8c\">An attorney for the plaintiffs, David Silver, <a href=\"https://twitter.com/dcsilver/status/1494754047340990465\">tweeted</a> after the ruling that “the law is clear: promote on social media, you can and will be held liable.” </p><p id=\"FTljJb\">In a statement sent to<em> The Verge</em>, Silver added: “The appellate court today confirmed what so many of the BitConnect promoters themselves have conceded in their guilty pleas to the criminal charges brought against them: the BitConnect investment program is a fraud, and soliciting investors through social media channels does not exempt that fraud from the federal securities laws.” </p><p id=\"90GKQ9\">Now, the attorney is inviting anyone who bought into a cryptocurrency, ICO, or “other investment” based on an online solicitation to reach out to him as well. How might this ruling apply to some of the tweets, TikToks, and YouTube videos you’ve seen? That could <a href=\"https://www.sec.gov/news/press-release/2017-131\">depend on regulators’ view</a> of<a href=\"https://www.investopedia.com/terms/h/howey-test.asp\"> what counts as a security</a>. Cryptocurrency like Bitcoin <a href=\"https://www.cnbc.com/2018/06/14/bitcoin-and-ethereum-are-not-securities-but-some-cryptocurrencies-may-be-sec-official-says.html\">could qualify as a commodity</a> and be in the clear in this instance, but ICOs, DAOs, and other products are on shakier ground. </p><div id=\"U5h9W2\"><iframe src=\"https://embed.documentcloud.org/documents/21270282-bitconnect-11-circuit-court-of-appeals-ruling/?embed=1&amp;responsive=0&amp;title=1&amp;onlyshoworg=1\" title=\"Bitconnect 11 Circuit Court of Appeals ruling (Hosted by DocumentCloud)\" width=\"700\" height=\"600\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/o7yEw5nolnK4VnPNtYLR7DyPl3o=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8937277/acastro_170726_1777_0007_v4.jpg",
  "description": "Committing securities fraud on YouTube is still bad",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}