{
  "title": "Inside Sonos’ decision to sue Google — and how it won",
  "url": "https://www.theverge.com/22955336/sonos-google-lawsuit-ceo-patrick-spence-interview",
  "date": "2022-03-01T15:45:00.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kdKGR3ydD2XiGDB6EPiKa34IvGE=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70565032/VRG_ILLO_Decoder_Patrick_Eddie_s.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>Protecting your patents against tech giants</p> <p class=\"p--has-dropcap p-large-text\" id=\"rmxdZH\">Sonos has long accused other tech giants of stealing its patents and technology, but in 2020, it actually <a href=\"https://www.theverge.com/2020/1/7/21055048/sonos-google-lawsuit-sues-speakers-assistant-amazon\">sued Google for patent infringement</a>. Sonos said that it had disclosed details about how its technology worked during negotiations to integrate Google’s voice assistant and that Google had copied the tech and then released cheaper products it subsidized with revenue from search advertising. Sonos recently won that lawsuit at the US International Trade Commission, which ruled that Google infringed all five patents Sonos brought to court. In response, Google had to change how some of its speakers worked, including reducing some functionality. Google is, of course, appealing, but you just don’t see this very often. </p><p id=\"Z3xvxq\">To talk about when a company like Sonos makes the decision to head to the courts and, increasingly, Congress, I sat down with Patrick Spence, the CEO of Sonos, and Eddie Lazarus, his chief legal officer. Software patents are pretty controversial to begin with, so I wanted to understand how Patrick and Eddie decided to take the risk of a lawsuit here. Sonos claims Google actually infringes over 150 patents, so how did they pick <em>five </em>to sue over? </p><p id=\"iXOGL5\">Patrick and Eddie have also both testified before Congress in the past few years, specifically about competition and antitrust issues. Sonos is a small public company compared to the tech giants, and they both say their tech gets ripped off all the time. It’s a big claim, and I wanted to push on it a little — and push on when that kind of lobbying effort becomes important enough to spend time on.</p><p id=\"C0wQUu\">This is a fun one. Patrick and Eddie are pretty direct, even though interviewing a CEO with his lawyer in the room sometimes got a little dicey.</p><p id=\"Vlu78d\">Okay. Patrick Spence and Eddie Lazarus from Sonos. Here we go.</p><div id=\"LGQhW2\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP8814279021\" width=\"100%\"></iframe></div><p id=\"wUVZbk\"><strong>Patrick Spence you are the CEO of Sonos. Welcome to </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"78V03K\"><strong>PS:</strong> Thanks, Nilay. Great to be back.</p><p id=\"j2gNrH\"><strong>Great to talk to you again. We also have Eddie Lazarus, the chief legal officer at Sonos. Welcome.</strong></p><p id=\"K80S1y\"><strong>EL:</strong> Hey there. Good to be here.</p><p id=\"MVQdvN\"><strong>I’m glad to have you both. Sonos is in the middle of a few big policy issues in tech: the ever-present patent litigation discussion that happens, and antitrust law. You both have testified before Congress in the United States recently, and </strong><a href=\"https://www.theverge.com/2021/8/13/22623977/sonos-google-patent-lawsuit-itc-judge-initial-ruling-infringement\"><strong>won part of a patent lawsuit </strong></a><strong>against Google that resulted in Google speakers changing some functionality. </strong></p><p id=\"DjI4wy\"><strong>I want to talk about all of that, as well as how you make decisions to engage that function as part of your company’s operations as the CEO and chief legal officer, but we have to ask the </strong><em><strong>Decoder</strong></em><strong> questions first. Patrick, you took over in 2017 as CEO.</strong></p><p id=\"W07dxP\"><strong>PS: </strong>Correct.</p><p id=\"HiqfJX\"><strong>You and I have spoken many times since then. One of the things you have mentioned to me over the years is your desire to change the culture of Sonos when you first started: You wanted to make it a more nimble organization that innovated faster. The phrase you used was, “biased to action,” — which I have ruthlessly stolen, by the way. How was Sonos structured when you took over? How have you changed that structure?</strong></p><p id=\"MipE4g\"><strong>PS: </strong>We really set out an ambition to deliver two new products a year. At that point, I think we were releasing one product over the past couple of years and kind of haphazardly. It was really this intentional bias to action to ship products that we felt could add to the system and be of high quality while at the same time avoiding the cycle that some companies are in, just shipping the same stuff every year. I felt that was a good balance for really what we try to do. We structured the entire organization around that.</p><p id=\"bLnedS\">At my leadership level, we have four different product leaders in the conversation. We made it very product-centric in terms of what we’re doing. You can see it’s working in our results and our model — our system is working. </p><p id=\"sJTnDR\">The biggest thing at the end of the day is how we’re different from everybody else out there with our business model. We bring out products which our existing customers buy more of. They tell their friends and family to join Sonos. Then we keep introducing at least two new products a year that help bring more people in, increasing the products per home. We have this flywheel that goes and goes through it.</p><p id=\"2t5adK\">It’s been cultural change throughout the entire organization, whether it’s product or go-to-market. We’ve really ramped up our activity. We’ve just moved faster, quite frankly. </p><div class=\"c-float-right\"><div id=\"maCAIu\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"N6H9Wx\">Obviously, we started to get into new categories as well. That’s an important part of it. We’ll do roughly $2 billion in sales this year. The global audio market is $89 billion a year in sales. There’s a lot of room for us to seize more opportunities. We do it in a unique way. I keep saying, we’re the story of software eating audio. That’s a lot of room to run to take more and more of that $89 billion.</p><p id=\"p3RucV\">The team’s done an incredible job. It was probably an advantage that we were distributed from the start, starting simultaneously in Santa Barbara, Boston, adding Seattle along the way, and obviously Amsterdam. We’ve had China in the mix and Malaysia now as well. When the pandemic struck, we were able to more easily shift because we were already using video chat. All of the things that so many companies picked up in the pandemic were already a normal course of operating for us. We didn’t lose any steam during the pandemic in terms of our new product introductions. We’ve been doing two new products a year. The team’s done an incredible job.</p><p id=\"jgv2iS\">Actions speak louder than words. Just look at our track record and the actions we have taken over the last five years. I’m super proud of the team. We’re just at the beginning of the opportunity ahead with such a big market to go after and a lot of new categories we don’t play in yet.</p><p id=\"tjb9eE\"><strong>NP: You mentioned the pandemic and, obviously, remote work. Have you changed where you’re hiring? Are you still hiring in Santa Barbara and Boston or are you hiring for software jobs anywhere now?</strong></p><p id=\"ThblTF\"><strong>PS: </strong>Yeah, we shifted that. I’ll say a couple things about that. One is that we started to hire from anywhere and that’s been tremendous in terms of tapping into new talent pools. A lot of people have reevaluated where they want to work. I think we have an advantage in that. We have a really great culture. We build a product that people love and are proud to share with their friends and family. We’ve been able to pick up some talent we never would’ve been able to before. It’s been a real advantage for us.</p><p id=\"4sGasU\">Our attrition has stayed steady through this period. We’re not seeing a great resignation. In fact, I think it’s an advantage for us. Prior to the pandemic, we had 15% working from home. We have these amazing people inside the organization. Our strategy was, “have a conversation with your manager about where you can be most effective going forward.” We’ll have roughly 60% working from home, post-pandemic. We’re building great hardware and some of these things, so some people need to be in the office.</p><p id=\"CghpFd\">In this day and age, the kind of people we hire will know where they can be most effective. We don’t need to lay out some one-size-fits-all rule. Our team will figure out how to work most effectively. But that is a pretty big shift in terms of what we’re doing from work from home. We’ll need to make sure that we’re doing the kind of things that the office helped serve a purpose for, for connection in particular. </p><p id=\"sDeuCI\">That’s one of those things that we’re being very thoughtful about: how we bring people together. I just had my team together in person last week. There’s still nothing like that for certain conversations, discussions, debates — just having dinner and lunch and breaking bread together.</p><p id=\"rwWmVg\">It’s going to look very different. Anybody who says they know exactly what it’s going to look like a year or two from now is just fooling themselves. We’re going to learn and iterate as we go through this, but I am so excited about the fact that we’re adding a lot of people throughout the country. We’ve taken the shackles off of where our offices are located and we’re picking up great talent to add to our already amazing team.</p><p id=\"Q46bpM\"><strong>How big is the Sonos team? How many people do you have?</strong></p><p id=\"KDVpr6\"><strong>PS: </strong>1,719.</p><p id=\"i4yHPL\"><strong>Down to the one. That’s pretty impressive.</strong></p><p id=\"Vff67V\"><strong>PS: </strong>I try to know all the names and the backgrounds as much as I can. I try to keep it as small as possible in terms of that feeling, culturally, but it’s hard at this number, certainly.</p><p id=\"RXb8yB\"><strong>You mentioned hardware. What’s the split between the people who work on hardware and the people who work on software?</strong></p><p id=\"0eU5fj\"><strong>PS</strong>: It’s about two-thirds software and about a third hardware right now. That’s kind of the mix on the engineering side. That’s a surprise to most people in terms of the team, but it is the magic of Sonos. It’s the way the system works together. It really is the core of the system and why we can introduce new products that make the system better over time.</p><p id=\"sE8oxG\"><strong>Once you commit to that mindset — the magic is the software — your software cost tends to grow. We had the CTO of John Deere on the show. John Deere now employs more software engineers than tractor mechanical engineers, which is utterly surprising if you think about it. But it does seem like once you make that decision, it is inevitable that you will employ and spend more resources on software than hardware.</strong></p><p id=\"jwf5Ao\"><strong>PS: </strong>From everything I’ve seen, I think that is right. We’ve created a world in which customer expectations continue to increase as well. You want to be bringing out new features and functions and making sure you’re making it better over time. Wi-Fi networks are changing all of these things. It is an evergreen investment.</p><p id=\"rdEidL\">Then the other thing that most companies like ours are thinking about is other areas you can go. You’re always investing ahead of the curve as well. We’re hiring people in software to go into new areas that we’re not in today. It’s easier in hindsight to understand that a company has been working on all of these great things. We just didn’t see it at that moment in time.</p><p id=\"vrmvCg\"><strong>How many blockchain engineers do you have at Sonos?</strong></p><p id=\"HDviEk\"><strong>PS:</strong> We’re watching the whole Web3 area to see what its impact on music and the industry will be at this point. For me, the real test with Web3, blockchain, all of these areas, is, “what’s been built that solves a customer problem in a better way?” </p><p id=\"hchg4u\">I hear a lot about the technology. Obviously, from my perspective, I get into that. I love to see the new technology and talk about some of the possibilities, but at the same time, I’m really looking for those customer problems to solve. I just haven’t seen the technology yet applied in a way that there’s an “aha!” moment for consumers.</p><p id=\"WSfHHx\">We’ll keep an eye on it, see what develops in that particular area. But that’s kind of what I’m looking for: actual customer problems being solved by this, as opposed to technologies that potentially hold a lot of promise. Over the last 20 years, you and I have seen that there are always lots of technologies and lots of philosophical discussions about what they might do, but when it comes down to brass tacks, what problems are we actually solving? That is something I’m still trying to figure out with some of the Web3 technologies.</p><p id=\"GnPkZi\"><strong>NP: I think that is true for many of us. It’s easy to see on a spreadsheet that investing in engineers and hardware tooling will pay off and generate revenue if you get it right. Poor Eddie’s over there — the lawyers just cost you money. They rarely make money for any company, unless you run a law firm. How do you think about allocating resources for Eddie to go talk to Congress to fight patent lawsuits? Eddie, how big is your team?</strong></p><p id=\"hsnS9A\"><strong>EL:</strong> Around the world, we have 26.</p><p id=\"KE8S1J\"><strong>NP: 26. Then you obviously have outside counsel and things like that too.</strong></p><p id=\"0YmbAg\"><strong>EL:</strong> We have more lawyers than you can shake a stick at, yes.</p><p id=\"eHrzjJ\"><strong>NP: Do you sit in a yearly budgeting meeting deciding how much to spend on hardware engineering versus legal services? How do you make that decision?</strong></p><p id=\"fdghcV\"><strong>PS:</strong> Innovation is at the core of everything we do. We have a long conversation on innovation and how much we need to be investing to continue to drive our business and grow our business. We’re proud that we’ve been able to do that for the going on 17 years we’ve shipped products. Despite all the new entrants jumping into what we knew would be a big growing market, we continue to grow and be successful in that. That is job one. That is where 99% of my time goes.</p><p id=\"RdIOz2\">Then Eddie and I have a conversation with Brittany [Bagley], our CFO, around the right investments to make. It’s really led from the strategy of, “What do we want to achieve in that particular area?” </p><p id=\"x7fw04\">Eddie obviously looks at what we need to serve the business, but then we also ask ourselves, for instance, “what do we need to do to stand up in the Google situation for our intellectual property?” Remember, a big part of Eddie’s team is on the intellectual property side — actually patenting the inventions that are there and collaborating with the engineering team. That’s why your intellectual property people are here, they love the products as much as all of us do, and they want to make sure that we are protecting those inventions. We know that this is a big, exciting space and more and more people may want to copy those. Eddie, I don’t know if you want to add anything. </p><p id=\"3r1fG4\"><strong>EL:</strong> We have an incredibly small team that works on this. We don’t have a single lobbyist — not one Sonos employee on the ground in Washington, DC. We don’t have any regulatory people in Europe. It’s really the Sonos story that does the work for us.</p><p id=\"YJu8Fp\">I have one fellow on my team who works part-time with me on the policy stuff. Otherwise, it’s just me. I guess I have the advantage of having been born and raised in Washington, DC, but the Sonos story resonates. That’s why we’ve been asked to testify on the Hill. That’s why we’ve been asked to go in to see people in the White House. That makes my job a lot easier and it lowers our investment costs. </p><p id=\"Xgsa0N\">Yes, we have lots of lawyers that we hire to litigate around the world, but our cost in telling our story on the antitrust front or to the extent we do media around the IP work and how we defend our innovations — frankly, it’s a very small band.</p><p id=\"vykA29\"><strong>NP: This is a totally random question. This might be the only business podcast where anyone ever asks this question. How do you pick a law firm? What’s your process? Are you like, “I just vibe with these guys,” or do they do decks? How does that work?</strong></p><div class=\"c-float-right\"><aside id=\"aCAcOG\"><q>“I pick lawyers, not law firms.”</q></aside></div><p id=\"V4S1W6\"><strong>EL: </strong>I pick lawyers, not law firms. I think it’s a very important distinction, because there are lots of wonderful law firms, but it’s really about who the thought partner will be at the firm. We need someone who’s really going to appreciate and understand the nature of our business and then apply all the appropriate legal principles — a person or a team that I have a lot of faith in.</p><p id=\"fDapM3\">On the IP side, we’ve been joined at the hip with a small boutique in the Midwest that comes from where Mark Triplett, our head of IP, resides. They understand our patent portfolio at an incredibly deep level. Then we coupled them with a major firm, Orrick, which has a reputation as one of the very best, if not the absolute best, IP firm in the country. I’ve known one of the senior partners there in this area for about 30 years now. It’s that combination of expertise and relationship, because the relationship’s crucial.</p><p id=\"3NQHfM\"><strong>NP: Patrick, you mentioned Sonos has been around for a long time. The business model in the early days was very simple: You made some speakers. I would go acquire some MP3s from wherever I acquired them from — ideally legally. I’d put them on my desktop computer. I would run a Sonos server application on my desktop and stream them to your speakers. That was it. Now we live in a totally services-based world. All the music comes from me paying Apple or Spotify or Amazon or potentially paying you for your radio service. That’s a lot of partnership work.</strong></p><p id=\"L9p3a4\"><strong>PS:</strong> Yes.</p><p id=\"lfWECH\"><strong>NP: At the end of the day, you need to have deals with Apple, Spotify, Google, and whoever else. How much time do you spend tending to those partnerships?</strong></p><p id=\"EFbImd\"><strong>PS:</strong> A good deal of time making sure that we have the partnerships that we need. Obviously, we have a team of people who are working on a daily basis to stay on top of those partnerships, and any changes in technology as well, APIs — all of the things that need to be done in order to deliver a reliable service. </p><p id=\"OoFT8R\">The other part of it is understanding what’s happening in the industry and being able to make that shift, for instance, from digital downloads to streaming — knowing how important it is to be engaging with all of those partners because we want to be there for our customers. Remember, the most important thing for us is being open and supporting all the services that matter to our customers.</p><p id=\"o4MvBh\">We want to stay abreast of any of those changes. If something does happen in Web3 and there’s a transition or a shift in terms of how music is delivered or serviced, we will be there to support it for our customers. Staying tight with all of today’s streaming services and technology leaders, plus trying to tap into new startups as well and understanding what’s happening in the space — that’s where my team and I spend time trying to figure out the landscape. Every day I’m trying to figure out the landscape, consuming and reading as much as I can about what’s happening in all of the audio spaces and technology beyond that. The pace of it all is so fast in this day and age — just making sure that we’re going to continue to stay ahead of the curve.</p><p id=\"QVLgfA\">Obviously, my growing up inside of Blackberry creates a healthy paranoia in terms of making sure that we’re building Sonos in a way that it will be here, and make any kind of pivots or turns that it needs to be successful, for decades to come. That is the most important thing to me. </p><p id=\"0OeHgI\">I think the real testament to my leadership is, long after I’m gone, is Sonos growing, relevant, and still around? That’s what I think about every day. That leads how I work with the team, how I think about the industry, and who I engage with outside of Sonos. All of that is kind of the guiding light for where we need to go and how I spend my time, quite frankly.</p><p id=\"V1FBgJ\"><strong>NP: This is the </strong><em><strong>Decoder</strong></em><strong> question. How do you make decisions? What’s your decision-making framework?</strong></p><p id=\"BxGz0k\"><strong>PS:</strong> How do I make decisions? I guess it depends what the decision is, ultimately, in terms of where we are. </p><p id=\"eGLtR5\">I would start with trying to build Sonos for decades to come and working back from there. What investments are we going to make today that position us well into the future? What talent do we need on the team? How are we working as a team together? Where are we setting our priorities? It’s pretty collaborative in terms of working closely, probably because I’m Canadian. I spend a lot of time with my leadership team, both as a group and then one-to-one in terms of working through some of those issues — trying to find the best talent, trying to unleash the talent inside the organization, and making those decisions when you have to.</p><p id=\"ykBJuR\">Sometimes you also need to think about which decisions need to get made when. Oftentimes, people will jump to make decisions too soon. I think one of key jobs for a CEO is to determine when you actually need to make a decision on something. </p><div class=\"c-float-left\"><aside id=\"azJeOh\"><q>“My goal is not to make any decisions.”</q></aside></div><p id=\"OWRFOp\"> In a perfect world, if I’ve built the team in such a way that I have leaders that are all better than me in their particular area, what I’m doing is trying to support them, guide them, and be a sounding board in terms of making those decisions. It’s my ultimate goal not to have to make any decisions because I’ll have built a team that can make all of those decisions for the organization. And try to train the organization so that the person closest to the action has the ball on the decision because they will know more than anybody else.</p><p id=\"M2tf1i\">Something I’ve learned over my career is how to set up the organization to do that. Key decisions are things like who you hire and where you point the organization. There’s two things that I say I spend my time on. One is strategy. The second is culture. A big part of culture is making sure we have the right team and the team’s set up in the right way to be successful. That’s the way I think about decisions and the world.</p><p id=\"747FOU\"><strong>Let’s pick out one decision because I think it will be illuminating in a variety of ways. Sonos recently launched one of your newest products: a radio service. There’s a free tier as well as a premium tier that costs $8 a month, adds a bunch of features, and takes out the ads. That’s a big decision — you’re now in the content business. You have all these partners that you have to tend to that make the product work, but now you’re competing with them. How did you make that call?</strong></p><p id=\"wOgqCR\"><strong>PS:</strong> Looking at the experience we were delivering on the radio service, as we looked at the service that we were providing, which was basically a directory of radio stations and those kind of things, one of the teams internally came up and said, “Hey, this just doesn’t fit with the kind of experience that we deliver. We want to create something that we’re more proud of as an organization.” </p><p id=\"yYH8Fy\">We felt like we could do it. It was an area where I felt it would be complementary to what a lot of our partners are doing as opposed to anything that is really competitive. What we really wanted to do was just reinvent it and learn and see what we could learn because I do think being in the space as well helps us better serve and direct our partners.</p><p id=\"CZIUaO\">Being transparent with our partners was key. We were upfront with all of our partners and let them know what we were doing ahead of time so they understood where we felt it fit. Most of our homes listen to both a radio service and then have an on-demand streaming service as well. We also said, “It’s not at the exclusion of.” That’s been our experience as well. A lot of people have Sonos Radio and listen to it, I think it’s our third-most-listened-to service at this point, but they’re still listening to Spotify, Apple Music, YouTube Music — whatever they subscribe to for on-demand as well.</p><p id=\"Xyl58a\">People have liked the curated station. You will see stations there that are all about Sonos — whether it’s the jazz station that Kareem Abdul-Jabbar is doing or Erykah Badu. We put out a couple every quarter. It’s really us, as well, sharing with our customers our perspective on the world, to some degree, and the kind of artists that we think should be celebrated.</p><p id=\"o6oKTE\">We had some conversations internally of how it fits with everybody else out there, but it’s something I’ve felt like we needed to do to keep growing as an organization and that it would be complementary to the other services offered. So far, that’s been the learning as well — okay, people will listen to both. They want to lean back and then at the same time, they want an on-demand service.</p><p id=\"RcN06E\"><strong>NP: Every tech company that veers into programming lands in this place where you have to pay Kareem and Erykah Badu. That’s important. That’s a big cost. But now you’re also responsible for what they say or do or program, which I think has been shocking to many tech companies. I’ll just pick on Spotify. I think they’ve gone through a long road here — a journey of discovery on what it means to be the programmer. Have you thought about that? Are you ahead of that curve? Do you have standards and practices for your radio station?</strong></p><p id=\"n2iNFN\"><strong>PS: </strong>It fits with the brand. We’re probably not ahead of the curve necessarily in terms of what’s there, but we’re certainly thoughtful about what we’re putting out there. You’ll see we’re not into podcasts in terms of what’s on Sonos Radio today.</p><p id=\"40vPeJ\"><strong>NP: Anything can happen on a show. Who knows?</strong></p><p id=\"PcuKO3\"><strong>PS:</strong> That’s right. I think people can choose whether to listen or not. They can choose another service. If somebody decides, “Hey, I don’t want service A,” for whatever reason they choose, they can go to service B. They can make that choice. That’s why being open about that’s really important. </p><p id=\"a9Wy1Z\">Then we’re just thoughtful about what it says about Sonos based on the artists that we’re bringing onto the platform. I do feel a responsibility for that, for sure. It reflects on us, of course, just like any of the other platforms’ choices reflect on the company.</p><p id=\"SwccZ5\"><strong>NP: Obviously you guys have a lot of partnership deals with the platforms — the Spotifys and Apples of the world. Going to the labels for access is a different layer of the music rights stack. Eddie, is that a preset package that the labels have? Did they offer some bulk licenses for people who want to start a radio station, or did you have to hammer out custom licenses for your product?</strong></p><p id=\"yGFSHm\"><strong>EL: </strong>It’s somewhere in the middle. It’s largely a commoditized circumstance, but we have some licensing folks who get into it with the major labels, but it’s not been a source of any contention or anything like that. It’s pretty standard.</p><p id=\"XtAzds\"><strong>PS: </strong>It’s pretty well-defined at this point.</p><p id=\"KvXZRG\"><strong>NP: This is kind of the opening to, “How do you compete with the tech giants?” I look at your pricing tiers, and it’s free, and then if you want lossless HD radio, higher-quality music — and I mean file quality, so higher bit rate music, lossless music — then you have to pay. My assumption has always been that it’s because the labels charge higher rates for that higher quality. But then I look at Apple, and they just roll it out for free at the same price. My assumption is that Apple’s just taking the hit because they can afford it. Spotify or Sonos maybe can’t. Do you see that as a competitive dynamic?</strong></p><p id=\"vrMl8Y\"><strong>PS:</strong> I think there’s probably something to that, but I also think the labels are pretty smart, like Eddie said, about trying to keep it a pretty level playing field in terms of what’s there and not simply let it become a loss leader either. It’s probably somewhere in the middle in terms of where that is. We feel like for our customers and what we’re offering with Sonos Radio, that is a good price point. We’re thinking about a consumer that’s probably going to pay for an on-demand streaming service as well. But I think it’s a pretty level playing field from the labels for the most part from what we’ve seen.</p><p id=\"pI8xxm\"><strong>NP: But the labels don’t care; they just want to get paid. They’re just charging the same rights to everyone. It’s the price to the consumer where it seems that, in order to not be a money-losing proposition, you have to charge an appropriate rate with an appropriate margin.</strong></p><p id=\"rYRwq5\"><strong>PS:</strong> Absolutely.</p><p id=\"AZ8i6e\"><strong>NP: Whereas Apple can just wave away a zero margin. They will just keep the same price, because their lossless is cheaper than Amazon’s lossless or whoever else.</strong></p><p id=\"0R4S6e\"><strong>PS: </strong>I don’t know. There are some conditions in terms of the different pricing. I don’t know that you can just offer those kinds of things for free, necessarily. </p><p id=\"5JMZyk\"><strong>EL: </strong>The only thing I would just add about that is the issue of cross-subsidization and pricing. It’s very pervasive. This is not just a radio music licensing question. We face this all the time on the hardware front where certain players make copycat-style products. They flood the market with them at probably below cost because they’re actually not looking to make money on those products. They’re feeding into whatever that dominant business is, whether it’s search or e-commerce or whatever it happens to be.</p><p id=\"qvS89K\"><strong>NP: Search, you say?</strong></p><p id=\"7WsS3c\"><strong>EL: </strong>I just happened to mention that one, but kidding aside, that is a major problem — this issue of cross-subsidization and whether that ought to be considered anti-competitive.</p><p id=\"iZhKZ5\"><strong>NP: Let’s get into it. This was the opening. It seems like I can just look at the pricing of music services and say, “Okay, it seems like there’s cross-subsidization here.” It’s way harder to look at the price of a Google Home and say, “I know how much that should cost and this is cheaper than it should be.” When you’re putting together your lawsuit against Google, how do you go about making a determination where you are confident that, “this seems really unfair and potentially illegal, and we’re going to go make that case?”</strong></p><p id=\"krFlTV\"><strong>EL: </strong>We haven’t tried to make a case on cross-subsidization, frankly, because the law on that topic, on predatory pricing — over the years the standard’s become pretty much impossible to meet. One of the things we’re advocating for on Capitol Hill is that they actually make some adjustments to the standard to modernize the law. But just in terms of, “how do you figure it out,” we don’t have to figure it out because some of the top executives admitted that they were selling below cost when they testified in Congress. The proof’s right there in the testimony.</p><p id=\"s6yqcy\"><strong>NP: Let’s talk about the actual Google case — the patent case. You have multiple partners, Amazon and Google for voice assistance. You want them both on your speakers. We have talked several times, Patrick, about wanting them both to be active at once. It seems like Google did not want that to happen. Then they potentially infringed on some of your technology to make their speakers go. Now you have a decision that says, actually it did infringe. Let’s start all the way back at the beginning. You’re in that situation. When do you go to Eddie and say, “I think we should sue Google,” or Eddie, when do you come to Patrick and say, “I think we should sue Google?”</strong></p><p id=\"A4Lx01\"><strong>PS:</strong> We never want to get in a lawsuit.</p><p id=\"pSzVuf\"><strong>NP: But you weren’t wandering the halls of Sonos saying, “I never want to be in a lawsuit,” and then you tripped and accidentally sued Google. You made a decision. When did you do it?</strong></p><p id=\"QhxAUS\"><strong>PS: </strong>No, absolutely. After all other avenues had come to a position where it didn’t feel like we were making progress. As you might imagine, this was not a decision I took very lightly. It involved Eddie, my leadership team, and the board all deciding it’s time to do this. </p><p id=\"XkuuV8\">We had tried to address this constructively. Others in the industry are more constructive in their conversations with us. It got to a point where I didn’t feel it was constructive anymore and we needed to take action to both stand up for both consumers, in terms of having that ability to use this concurrently because we’ve shown we can do that, and ourselves as well. We had to stand up for all the inventions that we’ve had. We have over 1,000 patents. Google, I think, infringes over 100 of those today.</p><p id=\"GbX5xe\"><strong>EL: </strong>Over 150.</p><p id=\"oXfajw\"><strong>PL: </strong>It felt like it was the time to say, “No, I’m not going to let you get away with simply infringing on everything we do.” We decided then to take the path that we have.</p><p id=\"lQrGOc\"><strong>NP: When you said you had to engage your board, you go to the board meeting and you say “We’re going to do this.” What is the case you lay out? Or is it just, “I think we have to do it,” everyone nods, and then you’re off to the races?</strong></p><p id=\"9EIFsx\"><strong>PS: </strong>It’s something that we talked about a lot on the way to the decision as well. I’m keeping the board up to date on our partnerships, our conversations with all of our key partners as we go through this, and kind of where we are. So they weren’t surprised when I came to them, because they knew I felt like it wasn’t heading in a constructive direction. </p><p id=\"rLbUYv\">Fundamentally, their job is to help decide whether to keep me on or fire me, and then be a sounding board on strategic questions. They were a great sounding board. We had a fantastic discussion and debate about the pros and cons. Then they fundamentally said, “All right, Patrick, call the shot in terms of where we’re going.”</p><p id=\"vaeQfK\">I felt very confident given some of our earlier experience with this. Then the fact that I knew we had invented the space and the category. Obviously I’m watching what’s happening in the industry as well. Beyond my responsibilities as CEO of Sonos is to be watching what’s happening a little broader in the industry and notice patterns. </p><p id=\"Yx34ZM\">Google took out all the photo sharing services back when they made Google Photos free. They drove out a business and then — whoa, imagine that! They actually put a price on Google Photos! What Google did to Eero in terms of copying their technology and underpricing them and kind of driving them out of business — there’s a pattern.</p><p id=\"kcLBpD\">I tried to address that constructively and then said, “Look, we’re in a position because of the business we’ve built and the innovation we continue to drive, that we can take this. It’s the right thing for Sonos. And it’s the right thing for tech more generally to take them on.”</p><p id=\"4BdMd5\"><strong>NP: The argument there is Sonos has been around for a long time. It’s invented a lot of stuff. You have a large patent portfolio that maybe a younger company like Eero had not acquired or built. And Eero eventually had to sell itself to Amazon. You’re saying, “This is our tool. This is our leverage to go into these conversations and get Google, or whoever, to come to the table in a more fair way.” That’s the strategy. Tactically, Eddie, you’ve got to go into that patent portfolio and pick some to litigate. How do you make that call?</strong></p><p id=\"SHjRAf\"><strong>EL: </strong>That’s a really good question. It’s such an unusual circumstance where you have the luxury of being able to choose. The situation where a competitor has come into your space and basically taken a huge percentage of your patents and infringed them, that’s highly, highly, highly unusual. </p><p id=\"HwJCOh\">Usually the choice is made for you because you’ve just got a few patents at issue, but here we decided we would take our first-generation patents first. That’s setup, the synchronization of speakers, group volume, stereo pairing — the things that really were part of that first generation of multi-room home audio discovery that Sonos pioneered back in the early part of the company’s history.</p><p id=\"iNEt1S\">Later on, we actually filed a second case on a second generation of patents, which are our direct control and zone scenes patents. That’s pending in federal court now because it’s not really just about that original conception. We’ve been solving problems and innovating generation after generation of this company. Every generation of that innovation is being infringed by Google. It’s not just been one set of choices, we’ve done it twice. </p><p id=\"mQvgW8\">From our perspective, my job was to assess the strength of the case, to make sure that we were rock-solid if Patrick wanted to move forward in this way. I know you mentioned that legal departments are a cost center as opposed to a value generator, but we wouldn’t have done this if we didn’t think that there was going to be a very substantial return on investment, maybe not in the immediate future, but in the relatively near future — measured by litigation, which is several years, of course.</p><p id=\"OThZGk\"><strong>NP: That’s actually interesting because you litigated some of those patents before with Denon.</strong></p><p id=\"y8u27g\"><strong>EL: </strong>Correct.</p><p id=\"Xd7dNU\"><strong>NP: They had a system called HEOS — you kind of knew those were good. You’ve taken them to court. You’ve won with them. They’re solid. There are others that you are putting at risk. Google’s going to say that these patents are invalid or that they’re not infringing. The court might agree. How do you make that call between the ones you’ve won with before versus the ones that you’re going to put at risk?</strong></p><p id=\"DNQefY\"><strong>EL:</strong> I was new to Sonos when we started making these decisions. I started here at the beginning of 2019. Discussions with Google had been going on for some time before I arrived. One of the first things as a kind of outsider to the culture that I wanted to get comfortable with is that our portfolio was just as strong as we internally felt it was, and as the law firm in Chicago that helped us build that portfolio thought it was. I actually brought in a second firm to make an independent assessment so that I made sure we weren’t just drinking our own Kool-Aid about the strength of our portfolio.</p><p id=\"2rhPZt\">It was a combination of expert judgment that led me to the strong conviction that our patents were going to survive an unbelievable onslaught by Google. Every one of them survived, five for five. Winning validity on all the patents that are up very rarely happens. And we won on infringement on all five as well. It’s important to recognize how unusual that is. That just shows that the preparation, the careful thought that went into this, the reflection, and the ultimate taking of the action — it’s been vindicated in court. We expect that to continue in other cases.</p><p id=\"Rmnf2d\"><strong>NP: We have spent a lot of time talking about Google — that’s obviously who you’re suing. Amazon is right there; they run the same playbook. People have the same complaints about Amazon. Previously you have said, “Well, we can’t sue them both.” Are the conversations there different? Are they meaningfully better or are you just seeing how this one goes before you turn your attention to Amazon?</strong></p><p id=\"eCooMd\"><strong>PS:</strong> I’d take you back to my point about the decision to sue Google and take this path. We came to the end of the road on constructive conversations. You can imagine that we will only go to that pretty drastic measure if we’re not having constructive conversations with anyone. And everybody in the smart speaker space is infringing on our intellectual property.</p><div class=\"c-float-right\"><aside id=\"TG4Qzt\"><q>“Software patents are contentious in our industry.”</q></aside></div><p id=\"aieQ7w\"><strong>NP: I feel like I can hear some of my listeners already. Software patents are contentious in our industry. These are all fundamentally software patents. They’re already screaming in their cars, “You should not be able to patent controlling the volume on multiple speakers at once. You should not be able to patent a setup flow.” I realize the actual patents are much more detailed and specific about how those things work, but conceptually, you should not be able to monopolize that kind of idea in the way the patent system currently allows. How would you respond to that?</strong></p><p id=\"UK1njA\"><strong>EL:</strong> I think that’s just wrong. I think these are fundamental inventions that solved problems that nobody else had been able to solve before. </p><p id=\"EL5ZAQ\">You can go all the way back to the US Constitution. It recognizes the fact that inventorship deserves IP protection. That’s the key: a problem no one else has solved before that you solve in a unique way. You don’t have unlimited scope as to what those patents can say. They have to be very specific. And if somebody else just comes in and basically rips that off, that’s wrong. They ought to pay you royalty for it. That’s all we’ve ever sought: Give us fair value for this. </p><p id=\"Kc82UU\">Google markets its speakers every day on things that Sonos actually invented and that they took from us. That’s just wrong. For one of the largest companies in the history of the world to do that is wrong. So we’re going to hold them to account in court until they’re willing to come to the table and give us a fair royalty.</p><p id=\"S74t4T\"><strong>PS: </strong>People look at innovations in hindsight. They say, “Oh, well, that? Of course. That thing’s obvious.” It wasn’t when we invented it — the hard work that went into creating it, bringing it to life, and bringing that product there. The system is designed so that those that invent can go and build on those inventions and go create businesses and employ lots of citizens, not for people to simply use their balance sheet to copy and try to destroy other companies. </p><p id=\"hiMrF9\">I think it’s very easy with hindsight to say, “Oh, well, that’s obvious,” but it wasn’t at the time. These are all inventions. I think people need to step back from that potential knee-jerk reaction and understand why we have a system the way we do and the way that it’s being abused right now to eliminate competition.</p><p id=\"BzmrGN\">Some people will say, “Well, that’s great, because now they’re selling it under cost.” As we saw with Google Photos, they will sell it under cost until they’ve driven competition out of the market. And then they will gouge customers. That just is the way that these things work.</p><p id=\"U1wJRx\"> It’s easy with hindsight to look at it and be cynical, but as you play it forward as well, it gets to, what kind of society do we want? Do we want all of this coming down to a couple of companies that have all the power? Fundamentally, while it may not be today that the prices rise and that as consumers we’re paying the price, it will be in the future. </p><p id=\"MngafT\">Just think about where this goes and why the system was set up the way that it was. It was done by very smart people trying to help create some guardrails and rules that help build society.</p><p id=\"hFJBpR\"><strong>EL: </strong>It’s certainly true that patent litigation has been abused at times. You have companies who will just buy up patent portfolios and sue people to make a quick buck. That’s a problem, but that’s not a problem that should be solved by punishing companies that are truly innovative — have solved problems that no one else had solved before and who are facing a competitor who is actually taking those inventions. </p><p id=\"AXBtfo\">The patent troll issue, as it’s generally known, is a real one. We get sued by trolls not infrequently, but solving that by undermining the value of innovation is really not the way to go about it.</p><p id=\"E7FpVC\"><strong>NP: Actually, I’ve got to bring up your Blackberry history here. I’ve been saying the lawyers are not a revenue generator, but you look at tech giants of the past like Blackberry, and their final form is luxury patent troll. That’s where they just end up. “We don’t make any products anymore, but we have this huge portfolio.” You are licensing — what you want out of Google is a revenue stream. You have a revenue stream from some of these other companies that you’ve litigated with. Is that meaningful? Is that material to you? Is that something you want to extend?</strong></p><p id=\"WUP55J\"><strong>PS:</strong> I would step back from it and say, we want to make sure that we’re properly compensated for the inventions, but it is so that we can fuel more innovation, hire more people, create more products. Let’s not forget why we’re doing this at the end of the day. </p><p id=\"iaHmhb\">Through this entire period, again, we’ve been continuing to innovate and introduce new products. That is where the bulk of our investment and our time and our energy goes. I think the other side of that coin is that, hey, if we are inventing things, people shouldn’t just be able to copy those things and put those out into the world and do that. It’s just plain wrong. </p><p id=\"TsIZRl\">I mean, we even published our patents publicly. Everybody knows what patents we have. You can go see those and you can work around them if you want to invent.</p><p id=\"Q5ChJ7\"><strong>NP: Right, but I’m saying that the patent is a deterrent for bad actors. I get that part. The patent portfolio as a revenue stream is the other part. I’m curious if you’re thinking about that part as important to your business.</strong></p><p id=\"AIZFZO\"><strong>EL:</strong> It will never be. In fact, we just talked about this at our offsite at Patrick’s house this week. This should never be thought of as the fundamental aspect of our business. </p><p id=\"05z2Qq\">This is something that can help, as Patrick said, drive our investment in the business, increase our R&amp;D budgets. But the core of Sonos’ business is never going to be to litigate and get a bunch of patent royalties. This is just trying to level the playing field with the big actors and not let them abuse the competitive situation by just taking what we invented for free, because it wasn’t free for us to invent it, I’ll tell you that.</p><p id=\"B0nNpF\"><strong>NP: You’ve got a portfolio, but patents expire, so that portfolio needs to be refreshed. Eddie, I don’t think most people have any conception of how that works. How does a company like Sonos take what engineers and designers make and turn them into patents?</strong></p><p id=\"lm8rFC\"><strong>EL:</strong> One of the most fun aspects of the business for my IP team is meeting with the engineers regularly in these brainstorming sessions. By the way, they think of themselves as inventors in and of themselves — some of my lawyers are actually inventors on patents. </p><p id=\"ITjDwR\">It’s a symbiotic relationship with the engineering teams. The engineers are in a room whiteboarding, and if there’s something that really feels novel enough and interesting enough to go think about an actual patent, then the engineers and lawyers start working on it together. That’s the fun stuff that occurs out of everybody’s line of sight — the generational process of capturing one wave of innovation after the other. We’ve had three or four waves of innovation here at Sonos. We’re tackling the next set of problems as we speak.</p><p id=\"bkSLhR\">We even have an OKR — objective and key result, to use the jargon — around how many of these inventive sessions we’re going to have with the product team every year. We actually measure that because it’s a statistic by which we can assess whether we’re keeping that vitality in the company.</p><p id=\"qsdSe2\"><strong>NP: Obviously, you’re suing Google. We talked a little bit about partnerships and how you need them. How has this litigation affected your relationship with Google? Has it strained it? Has it made it better? Is that siloed? How does that work?</strong></p><p id=\"TgELYk\"><strong>PS: </strong>It’s pretty siloed from their side. YouTube Music continues to go along. We continue to have Google Assistant. I think they know, obviously, with us testifying in Congress and Congress being very supportive of making sure that there’s no retaliation for doing that, they’ve been on their best behavior as well.</p><p id=\"53yqQ1\"><strong>NP: Have there been talks like, “We’re just going to do both assistants at once and settle these cases?”</strong></p><p id=\"WTax3k\"><strong>PS: </strong>We remain open to trying to solve this in other ways.</p><p id=\"qBwYNP\"><strong>NP: I’ve never had a CEO with their lawyer in the room. The audience can’t see this, but I can see them. Eddie just shot you a look. He was like lasering “No comment!” into your brain. It was impressive.</strong></p><p id=\"iGj5h9\"><strong>EL:</strong> I don’t know why Patrick would listen to that any more than anything else — he’s got his own mind about what he wants to say.</p><p id=\"7inE79\"><strong>NP: It’s way more intense than when the PR person is there. The actual lawyer is right there. </strong></p><p id=\"36je9T\"><strong>Both of you have testified before Congress. It’s a reasonably high-stakes event: you’ve got to look good, you’ve got to prepare. How does that begin? Do you call a congressperson or a staffer and say, “I want to testify?” What is that process like?</strong></p><p id=\"GM9LIZ\"><strong>EL:</strong> There’s not one way to go about that. It was no secret that Congress was opening up a series of inquiries into big tech and competition. We did feel it was important at least to plug into that process and understand what was going on. That’s how it starts. </p><p id=\"3Zi2ub\">Then, as I said earlier, it’s the Sonos story that does the work. Once people hear the origins of Sonos, what it did, what it’s experiencing in the business environment in its relationships with some of the larger platform players, then it shifts. We’re not going to them. They’re coming to us because they understand that having real-world, detailed examples — that are frankly, kind of easily understood — is very important. </p><p id=\"4Ww1NS\">The Sonos story, with respect to competition, is very straightforward. That’s why we’ve been asked to tell it several times.</p><p id=\"ti0xYC\"><strong>NP: Now the Sonos story involves some amount of political positioning. I would say competition laws are maybe not as heated as other elements of our politics, but the issue still is not necessarily totally bipartisan. A range of companies now have taken political positions against the tech giants. Epic, Spotify, and Sonos come to mind. How did you make the decision to have political activism become part of that Sonos story?</strong></p><p id=\"lfxMwO\"><strong>EL:</strong> I don’t know that it really is political activism on our part. First of all, I’d say it is totally bipartisan. On the Senate side, the two major antitrust bills were voted out of committee overwhelmingly — I think 16 to six in one case, and I think an even bigger margin in the second case. It is bipartisan. And it’s a real problem. </p><p id=\"uYJqkL\">We’re not thinking about it in terms of Republican or Democrat. We think that there is an overwhelming sense that the antitrust laws need to be refurbished for the digital age — and indeed brought back to some of the theorizing that gave rise to those laws in the first place a hundred and something years ago. For us, it’s just a straight policy matter and one where we think our relationship with the big tech companies is a good example of why there should be some modernization and exactly what that modernization should be.</p><p id=\"AeNbmZ\">We focus on the anti-self-preferencing. It should just be a level playing field for everybody, kind of a golden rule of, do unto others as you would do unto yourself. Second is interoperability. If you don’t have greater interoperability, the smart home and other very important new markets are going to devolve down to just a very few huge players. We think that’s horrible for the consuming public. It’s bad for innovation. Sonos has a kind of a central role in all that as one of the very few choice-oriented OSs. That’s why we felt it was important to tell our story.</p><p id=\"GhC95w\"><strong>NP: Google spent $9.6 million lobbying in 2021. Apple, Amazon, they all spent similar amounts. Do you feel outgunned? I think commonly people think that the money just wins.</strong></p><p id=\"CduqQB\"><strong>EL:</strong> I certainly hope not, because the smaller companies can never compete with the big players on money. As cynical as I am by dint of being a lawyer, I am enough of an optimist that I really believe, in this case, narrative is going to win. It’s just self-evident that the law needs to change — in ways that won’t compromise these large companies. They’re still going to be trillion-dollar market cap companies whether these laws pass or not, but it’s going to allow the smaller players more oxygen and a fairer environment. </p><p id=\"E9kW4D\">Everybody should be for that. We just think the self-evident nature of this, once people understand what’s really happening, is going to carry the day.</p><p id=\"KC1w07\"><strong>NP: Patrick, I’m curious for your perspective on this. There is the broader perception of the company that you have to tend to. Then there’s your personal time. Between partnerships, thinking about blockchain, looking at the products, and dealing with me asking for Atmos support — I take up a lot of your minutes — how do you say, “I’m going to go spend my time on this. We’re going to devote some percentage of the company’s mindset and perception out in the world to this?”</strong></p><p id=\"GBmoNK\"><strong>PS: </strong>It is, again, keeping it in perspective of what we’re trying to achieve overall. That’s why 99% of my time goes into innovation, what are we doing for customers, all of those things. This is something that we feel like we need to do for the greater society, and also for all of our people, all of the companies trying to compete, all the new startups, and some of those that have been impacted by the bad actions of some of the players that are here. I try to keep it pretty focused in terms of the amount of time that I will put into this. It has been pretty minimal from my side because Eddie and the team do a great job on this front. </p><p id=\"UtpJM9\">I stay really, really focused on that strategy side, which is largely around the innovation and where we need to take the product roadmap and the culture internally. If I’m doing both of those things, this is part of it — standing up for our people, and the fact that we are inventing things here. And we’re not just going to let somebody get away with copying those things. </p><p id=\"s0UhWd\">Again, at the biggest level, that’s just not the spirit of competition and America at the end of the day. This is a place where we should stand up for what’s right. It is not right if somebody’s just going to copy what you make and try to underprice you and try to drive companies out of the space. I do feel a responsibility to stand up for that, but my number one responsibility is to Sonos continuing to grow and innovate. That’s why that’s where I spend 99% of my time.</p><p id=\"NgF2BX\"><strong>NP: Do you think these issues are existential for Sonos or companies like Sonos? If there’s not change, if these lawsuits don’t work and get Google to the table appropriately, are these existential issues for you?</strong></p><p id=\"Kw0BwS\"><strong>PS:</strong> I think we will continue to innovate. We’ve kind of hit an escape velocity that enables us to continue to build on where we are. I feel very bullish about the future as I think about the whole size of the audio market and where we are today. We have a ton of runway for growth and we’re in a good position. </p><p id=\"Op0W6d\">I think that we should be paid for our inventions. That should help us hire more people, drive more innovation. That’s the right thing from the overall spirit of what we’re trying to do. </p><p id=\"Adtoha\">It’s probably even more existential for a lot of startups, quite frankly, that are trying to compete and go into new spaces because there’s a very clear playbook now, where in these new areas, certain companies will jump in and they’ll use their other kind of dominant monopoly area to cross-subsidize and really suck the oxygen out of the room.</p><p id=\"m8kfpo\">In other areas, Web3 might be an area, or a metaverse or VR or AR, whatever you want to talk about. I do think it’s existential as a society that we make sure that we have the right guardrails in place to spur competition and make sure that we can foster innovation in the country. I do think it’s existential as a country that we do that. </p><p id=\"dXpdCr\">I guess it’s a choice, Nilay, at the end of the day, of, are we okay with the ultimate result where it is going to be one or two companies and we all work for those companies and we all buy our stuff from those companies? Or are we going to put guardrails in place that foster competition? I think the country would be better off with thousands of companies that are innovating and employing more and more people than enabling all that power in a few hands. We’ve always found in history that it’s dangerous to have all that power in just a few hands.</p><p id=\"UXhLUF\"><strong>NP: Well, that’s a good place to wrap it up, but we’re not going to wrap it up because I’m just going to ask you about new products. I can’t let you go. You said two products a year. Are you making headphones? When are they coming?</strong></p><p id=\"FKL3QL\"><strong>PS:</strong> We are so excited about our roadmap, Nilay, and I can’t wait to talk to you about it.</p><p id=\"a1dFFQ\"><strong>NP: Eddie is proud of you. He’s like, “He doesn’t even need the help.” You just bought a company called T2. Is that to help you make headphones?</strong></p><p id=\"65zM1y\"><strong>PS:</strong> We are working on some really exciting stuff that I can’t wait to tell you about, Nilay.</p><p id=\"jXmVJS\"><strong>NP: Oh my gosh. Are you going to support lossless audio on Apple Music?</strong></p><p id=\"eyk79d\"><strong>PS: </strong>We are working on some really exciting stuff that I can’t wait to tell you about.</p><p id=\"xwnDZT\"><strong>NP: See, you start doing the lawsuits. You start going to Congress. You used to be a person, man.</strong></p><p id=\"cbdZai\"><strong>PS:</strong> I assure you, I still am a person. I’m just learning. </p><p id=\"pX1lWb\"><strong>NP: All right, Patrick and Eddie, thank you so much for being on </strong><em><strong>Decoder</strong></em><strong>. This was great.</strong></p><p id=\"YpWUV2\"><strong>PS:</strong> Thanks, Nilay.</p><p id=\"WF4uQU\"><strong>EL:</strong> Thank you. </p><aside id=\"6ypTzr\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe now!\",\"url\":\"https://podcasts.apple.com/us/podcast/decoder-with-nilay-patel/id1011668648?i=1000496212371\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/RdfsoTsOiIcnA6NGunKPOWJWrww=/0x145:2050x1218/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23279523/VRG_ILLO_Decoder_Patrick_Eddie_s.jpg",
  "description": "From the courts to Congress, Sonos is fighting for its patents.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}