{
  "title": " Inside the fight to save video game history",
  "url": "https://www.theverge.com/2022/3/21/22988902/nintendo-wiiu-3ds-eshop-closure-dmca-section-1201",
  "date": "2022-03-21T15:12:54.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WmB3T6pTJ-95uVy2aeornjyuaJM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70652007/acastro_eshop.0.jpg\" />        <figcaption>Alex Castro / The Verge</figcaption>    </figure>  <p>Publishers and preservationists are fighting over how old video games can be saved from digital obsolescence</p> <p id=\"TPSHQn\">In February, Nintendo announced <a href=\"https://www.theverge.com/2022/2/15/22936552/nintendo-eshop-wii-u-3ds-no-new-purchases-late-march-2023\">it would shut down its 3DS and Wii U storefronts</a>. While the closure is an inevitable part of the life cycle of those long since sunset consoles, the move sparked anger, disappointment, and even fear as fans lamented the loss of access to digitally exclusive 3DS and Wii U titles. With console gaming entering its ninth generation, the digital storefronts from the previous generations <a href=\"https://www.theverge.com/2017/9/29/16385622/nintendo-wii-shop-channel-january-2019-shut-down-download-games\">are slowly disappearing</a>, taking with them thousands of digital-only games and DLC. Combined with the decline of physical media in favor of <a href=\"https://www.theverge.com/2020/4/30/21242479/microsoft-xbox-game-pass-subscribers-phil-spencer-comments\">subscription</a> <a href=\"https://www.theverge.com/2021/12/3/22816087/sony-playstation-5-game-subscription-service-xbox-games-pass-now-spartacus\">services</a> and <a href=\"https://www.theverge.com/2021/6/10/22527420/microsoft-xbox-tv-app-streaming-stick-xcloud\">digital</a> <a href=\"https://www.theverge.com/2020/7/16/21326797/microsoft-xcloud-launch-xbox-game-pass-ultimate-free\">distribution</a>, it’s getting <a href=\"https://kotaku.com/why-some-video-games-are-in-danger-of-disappearing-fore-1789609791\">harder for people to play older games</a> and harder still for the games of the present to be preserved for the future. </p><p id=\"CP0YVN\">That is, if you want a legal way to play them. As games age and as companies continue to remove the means to properly purchase and download them, people are looking at other, <a href=\"https://kotaku.com/so-called-pirates-are-doing-the-work-when-publishers-fa-1846533244\">less than legitimate options</a> to continue to play the games they enjoy. It’s created tension between players and companies. While it’s unrealistic to expect publishers to maintain their prolific libraries in perpetuity, it’s also not ideal that large swathes of games can, at any time, just disappear <a href=\"https://www.theverge.com/2021/4/19/22392126/sony-ps3-ps-vita-stores-open-backtrack-psp-july-2nd-mistake\">on the whims of the store operator</a>. </p><p id=\"XDJJJw\">So how can we ensure that older games can be enjoyed by future generations without the expense of maintaining aging digital infrastructure or violating existing copyright laws? Video game preservationists are doing the work at the intersection between these two points. </p><p id=\"moIAD0\">Frank Cifaldi and Kelsey Lewin are co-directors of the <a href=\"https://gamehistory.org/\">Video Game History Foundation</a>, a non-profit organization dedicated to the preservation of gaming’s relatively short but impactful history. </p><p id=\"SqUhuY\">“We believe video games are part of our culture and that people should be able to have the tools and resources to study them,” Lewin told <em>The Verge</em>. </p><p id=\"SsE2CG\">Institutions like The Video Game History Foundation and the <a href=\"https://www.themade.org/\">Museum of Art and Digital Entertainment</a> (MADE) work to preserve games in a number of ways. They maintain physical copies of older games and the hardware needed to play them. They also copy software for preservation on hard drives saving them from <a href=\"https://kotaku.com/why-some-video-games-are-in-danger-of-disappearing-fore-1789609791\">fragile physical cartridges</a>. They even alter a game’s source code so games with online requirements can still be played after their authentication servers have gone offline.</p><p id=\"jPOEtc\">Games are an interactive medium. In order for any of this work to mean something, the games that have been rescued from the great digital garbage heap need to be available for people to play. In other words, there’s no point in saving a game if nobody can play it — and this is where video game preservationists and video game publishers clash. </p><div class=\"c-float-right\"><aside id=\"AKiymE\"><q>“We believe video games are part of our culture and that people should be able to have the tools and resources to study them.”</q></aside></div><p id=\"ybIBEE\">It’s a fight over access. Video game archivists have done the work of preserving old games, and they want to share those games. On the other side, video game companies want to protect their interests by limiting the ability to play these games to a narrow scope. These two sides are embroiled in a legal cold war submitting petitions and comments, each arguing against the other over who can provide access, how access is facilitated, and whether access is even necessary in the first place. </p><p id=\"2PCLPZ\">Archives and museums can let people study their collections because of <a href=\"https://www.copyright.gov/fair-use/\">fair use rules</a>. These rules essentially state that the unlicensed use of copyright-protected material is allowed under certain circumstances like academic research. However, video game archives and preservationists also have to contend with the Digital Millennium Copyright Act (DMCA), specifically a portion of the DMCA known as Section 1201.</p><p id=\"rUg7gN\">Section 1201 “makes it unlawful to circumvent technological measures used to prevent unauthorized access to copyrighted works, including copyrighted books, movies, videos, video games, and computer software.”</p><p id=\"p4LCAW\">Imagine a video game trapped inside a burning building, and on the door of that building is a lock. Video game preservationists want to rescue the video game before it goes up in flames, but in order to get to it, they have to break the lock. Section 1201 essentially states that even though all the archivists want to do is get the game out before it burns, if they break the lock, they’re breaking the law. </p><p id=\"dmylEt\">Kendra Albert, a clinical instructor at the Harvard Law School Cyber Law Clinic, explains. </p><p id=\"KuqDJr\">“Even when the uses that someone is making of a work are fair — for example, a museum taking a copy of a video game and transferring it from a CD to a hard drive — Section 1201 says there’s still legal risk involved in doing that if you need to circumvent digital rights management (DRM) or a technological protection measure in order to do so,” they told <em>The Verge</em>.</p><p id=\"e6uRlc\">This means that some of the acts of physically preserving a game, like emulating a piece of software on PC because its hardware is obsolete, can expose an organization to legal risk.</p><p id=\"7f9sCP\">“It’s really hard to get archival and preservation institutions to preserve software with this 1201 risk,” Albert said. </p><p id=\"uH7jY6\">Albert explained that the reason most museums and libraries haven’t really gotten involved with video games is that they’re generally risk-averse. </p><p id=\"nEzXb1\">“If someone comes to them with a novel software preservation idea, they look at the risk under 1201 and say ‘No way, we don’t want to touch this.’” This risk aversion is part of the reason why video game preservation work is the domain of a tiny number of very small institutions. </p>  <figure class=\"e-image\">        <img alt=\"Wii U\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fWkdBEHI_PXHNfKMPj-5MLSf8b4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/12007695/WiiU_Report.0.jpeg\">      <figcaption><em>Wii U</em></figcaption>  </figure><p id=\"3nv56H\">Section 1201 allows for the preservation of video games not currently being sold but limits their access to the preserving institution’s physical location. Because of Section 1201, the only way to make use of MADE or the Video Game History Foundation’s archives is to be physically present at their locations. Despite the fact that these games can be loaned and distributed digitally, with all kinds of protections to ensure legitimate use, off-site access is not allowed. This creates a serious burden for video game scholars and makes these archives essentially unusable.</p><p id=\"LEpi5X\">Laine Nooney, an assistant professor of media industries at NYU, elaborated.</p><p id=\"KTEtrq\">“For people who are trying to do software history that is based on release histories, trying to produce histories of developments in game design, or trying to understand differences that emerge between games over time, or even trying to understand a company’s entire game catalog, or what kinds of software was available [...] ​​the inability to access that software, obviously generates a whole bunch of problems.”</p><p id=\"g4vuXs\">Video game history is imperiled because the pool of available resources is incredibly small, there’s a legal disincentive to create additional resources, and the history that has been saved is so restricted that it cannot practically be shared. </p><div class=\"c-float-right\"><aside id=\"zY0xdu\"><q>Video game preservation right now is just engaging in triage</q></aside></div><p id=\"nnM6DY\">It’s not totally hopeless, however. Organizations have successfully argued for an exemption to the 1201 rule, which would allow them to digitally share software for academic purposes.</p><p id=\"mgoxdw\">In 2021, the Software Preservation Network (SPN), the organization Albert represents, petitioned for an exemption for all kinds of software preservation, including programs <em>and</em> games. And they got it, but only for programs.</p><p id=\"NaTXWw\">The <a href=\"https://www.theesa.com/\">Electronic Software Association</a> is why they didn’t get games.</p><p id=\"bOUpf9\">The ESA is like a trade organization for video game publishers. It represents the interests of Sony, Microsoft, Nintendo, and other major game publishers. The ESA, acting on behalf of its members, <a href=\"https://www.copyright.gov/1201/2021/comments/opposition/Class_14b_Opp'n_Entertainment%20Software%20Association.pdf\">opposed the Software Preservation Network’s petition for a 1201 exemption</a> in 2021 for video games. The ESA’s position is that allowing institutions the ability to provide online access to their collections would undermine copyright holders’ ability to make money. “There is substantial market demand for legacy games [...] and providing the public access to legacy games for purposes of recreational gameplay is the prerogative of the copyright owner,” the ESA said in its objection to the SPN’s 1201 exemption.</p><p id=\"c0KNlT\">The ESA also suggested that publishers already engaged in the work preservationists are doing: </p><blockquote><p id=\"w8pVj6\">“Video game companies have strong economic motivations to preserve their video game assets themselves. [...][T]hey do not routinely discard works that in many cases they paid millions of dollars to create. And like other copyright owners of valuable entertainment content, video game companies increasingly reissue works from or based on their back catalogs. [...] In fact, publisher-authorized emulators of legacy games are an important existing and potential market for video game copyright owners. For example, Nintendo offers legacy games for purchase through its Virtual Console Games portal.”</p></blockquote><p id=\"mgZPNo\">Albert acknowledged that publishers do engage in preservation activities, but the scope is nowhere close to what’s needed. “The amount of video game history that’s being lost is so much more than what anyone is able to preserve,” they said.</p><p id=\"Isl46j\">They also said that while companies rerelease content in the form of remasters and other products, that’s no substitute for having access to the original game. When Nintendo released the Nintendo 64’s <em>The Legend of Zelda:</em> <em>Ocarina of Time</em> for Nintendo Switch Online, <a href=\"https://www.theverge.com/2021/10/26/22746897/nintendo-switch-online-n64-emulation-quality-bad\">fans panned the game</a> for being laggier and less visually faithful to the original. </p>  <figure class=\"e-image\">        <img alt=\"Comparison shots of Japanese Zelda Ocarina of Time Wii U vs Switch\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4fP_RHJB2qS1ldF-7Ys2wIJjaB4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22957631/zeldacompare.jpg\">      <figcaption><em>Comparison shots of Japanese</em> Zelda Ocarina of Time<em> Wii U (left) vs. Switch (right) Tweeted by @moriyoshijon and confirmed by @zfg111</em></figcaption>  </figure><p id=\"USweW5\">And it’s ironic for the ESA to use Nintendo’s Virtual Console as an example of publishers preserving its own games. Nintendo essentially discontinued that service in the transition from the Wii U to the Switch, it offers significantly fewer retro games on the Switch itself, and 3DS and Wii U users won’t be able to purchase older games when those storefronts shut down in 2023.</p><p id=\"0D31Qw\">The way things are, consumers are at the mercy of publishers who get to pick and choose which legacy games they want to resurrect, which sucks if you’ve been hoping for a rerelease of <em>Elite Beat Agents</em>.</p><p id=\"9ye9ZW\">Video game preservationists and publishers are at an impasse. So what should be done and by who? In the <a href=\"https://en-americas-support.nintendo.com/app/answers/detail/a_id/57847#s1q1\">FAQ regarding the shop closures</a>, <a href=\"https://twitter.com/ethangach/status/1493755634436558853\">Nintendo included</a> — <a href=\"https://twitter.com/ethangach/status/1493757193530839040?s=20&amp;t=npph2jgE7ioASSm11qtp5Q\">then deleted</a> — a section on what obligations Nintendo had to support older games. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_a263cc3QcYoqcz2wc0v67zJgio=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23333510/FLricBVUUAEuavo.png\">      <cite>Nintendo</cite>  </figure><p id=\"46u8J9\">“I don’t know that it is necessarily the role of a company to keep the stuff around,” Cifaldi said. But he does believe a company’s obligation lies in figuring out a way forward amenable to both publishers and preservationists. </p><p id=\"XSZL3P\">When Nintendo announced its decision to shut down its 3DS and WiiU shop, the Video Game History Foundation <a href=\"https://twitter.com/GameHistoryOrg/status/1494398068346654720\">tweeted in response</a>:</p><p id=\"KkQo28\">“Not providing commercial access is understandable, but preventing institutional work to preserve these titles on top of that is actively destructive to video game history. We encourage ESA members like Nintendo to rethink their position on this issue and work with existing institutions to find a solution.”</p><p id=\"yDmChb\">Albert understands the business decision involved in taking down a digital storefront, but they take issue with this kind of “if we decide we’re not selling it, you just don’t get to have it” mentality. “So when they shut down access to these stores [...] after having made it much more difficult for preservation institutions to effectively preserve the games, it comes off as really offensive,” they said.</p>  <figure class=\"e-image\">        <img alt=\"3ds eshop\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0Qevqkxg9NvvUnvUXyG9CxDl4rc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/assets/1085590/DSC01142.jpg\">  </figure><p id=\"YtiOmt\">There’s a fundamental disconnect between how publishers and preservation institutions view games. Maintaining games as something commercial instead of cultural allows publishers to claim that their preservation work is sufficient and others’ preservation work is infringing. Every preservationist in the ESA’s estimation is a potential pirate waiting to turn libraries of old games into online arcades, damaging the industry’s ability to make a profit.</p><p id=\"UjwZA3\">“Organizations like the ESA and the video game industry more generally, have sort of characterized people who just want to play old games as potentially ‘evil infringers,’” Albert said.</p><p id=\"Na2GYQ\">This strategy has made it so that the conversation regarding access to preserved games centers only on academic purposes. Organizations are only fighting for their scholarly use because that’s their best bet for obtaining the legal permissions to preserve them even though no such limitations exist on other forms of art. You don’t need a purely academic- or research-related reason to read an out-of-print book. But there’s still a long way to go before recreational use could even be considered, and in that time, as console generations advance, more games are being lost.</p><p id=\"1mknEt\">“Video game preservation right now is just engaging in triage,” Albert said.</p><p id=\"wi84tb\">Despite being a relatively young form of media, video games have undergone several massive technological revolutions. Unlike a book, whose information can be accessed forever so long as we can understand the language it’s written in, it’s difficult to play games made even 10 years ago, let alone those made at the dawn of the medium. Without the work of video game preservationists, the arrival of each new console generation would effectively mean the loss of a previous one. This erosion of video game history is exacerbated by the industry’s own actions in taking down aging storefronts and its efforts to control and curtail how old video games can be preserved and accessed. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PH2bXtn_Y3EUSe2bcCUAReud070=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23333489/acastro_eshop.jpg",
  "description": "Video game history is lost faster than we can preserve it.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}