{
  "title": "Inside Galactic Starcruiser, Disney’s hotel where everyone becomes a Star Wars character",
  "url": "https://www.theverge.com/22949905/star-wars-galactic-starcruiser-hotel-interactive-disney-world-photos-price",
  "date": "2022-02-25T15:07:12.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/490MqtitXH5A2cYaroLMxWdDAX0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70549591/cgartenberg_220224_5039_0049.0.jpg\" />        <figcaption><em>Galactic Starcruiser invites guests to live in the Star Wars universe for a two-day trip.</em></figcaption>    </figure>  <p>A galaxy far, far away gets a whole lot closer — for $6,000 per stay</p> <p class=\"p--has-dropcap p-large-text\" id=\"rxeoDf\">I walked into Star Wars: Galactic Starcruiser prepared to pretend. I was going to be Ch’aim Garteenbar, a reformed smuggler celebrating going straight with a luxurious cruise trip on the Halcyon, pride of Chandrila Star Line. </p><p id=\"O9w5dy\">Unfortunately, due to the compressed nature of the media preview, I spent most of my time aboard Disney’s biggest bet in years in my usual guise of “Chaim Gartenberg, reporter.” Part hotel, part LARP, part theme park, Star Wars: Galactic Starcruiser wants to be nothing less than the ultimate <em>Star Wars</em> experience, one that sucks you into a living, breathing sci-fi story unfolding around you — and for the price that Disney is placing on it, one that has a <em>lot</em> of expectations to live up to. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MpnScnqnfzf-WJZcTTL6dR4EV5M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269155/cgartenberg_220224_5039_0041.jpg\">      <figcaption><em>The main Atrium of the Halcyon and what you’ll see when you first step on board.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"uRGEYn\">To be extremely clear from the start: this is not a review of the full Galactic Starcruiser experience. The media preview I attended was a four-hour curated “sampler platter” of what guests will get over a two-day stay. I didn’t get to sleep at the hotel, and my time “on board” was focused on seeing the major set pieces and interactive components in group settings instead of the choice-based, smaller storylines that guests will get to build out over the full two-day trip. </p><p id=\"mdnwjA\">As such, this is not an assessment of whether the whole package is worth the eye-watering $4,809 <em>starting </em>price that Disney is charging for a Galactic Starcruiser stay. (<a href=\"https://www.theverge.com/2021/8/4/22609764/disney-star-wars-hotel-galactic-starcruiser-pricing-2022-interactive-immersive\">The exorbitant price tag</a> was never far from my mind when I was touring the “ship,” though.)</p><p id=\"LEUYz1\">While I can’t tell you everything about the minute-to-minute details of the branching, interactive storylines that Galactic Starcruiser is putting so much emphasis on, I did get to travel aboard the Halcyon and see some of the greatest hits and unique elements of the experience. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RcVbuQxhAoKdZj5W98QJIsk9-Yc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269127/cgartenberg_220224_5039_0008.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5MTAaDIx8ZgxEglKkaSb4trH2Tw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269133/cgartenberg_220224_5039_0015.jpg\">  </figure></div></div></div><p id=\"5x4Vzd\">Galactic Starcruiser, much like Galaxy’s Edge before it, isn’t just a creation for Disney theme parks. The modern desire to connect every element of media and storytelling together is a part of the Galactic Starcruiser experience, and Disney is already working to seed the luxury liner across decades of <em>Star Wars</em> history. </p><p id=\"q863Ni\">The Halcyon<em> </em>plays a role in the <a href=\"https://www.theverge.com/2020/2/25/21152444/star-wars-the-high-republic-books-comics-jedi-knights-publishing-interconnected\">ongoing <em>High Republic</em> multimedia storyline of books</a>; there’s <a href=\"https://www.marvel.com/comics/issue/96844/star_wars_the_halcyon_legacy_2022_1\">already a comic book series</a> that explains the backstory and shows iconic characters like Anakin Skywalker, Padme Amidala, and Lando Calrissian’s stays aboard the ship. There’s also the recently announced novel <a href=\"https://www.starwars.com/news/star-wars-the-princess-and-the-scoundrel\"><em>The Princess and the Scoundrel</em></a>, which will reveal the untold story of Han and Leia’s honeymoon on the Halcyon. At the current rate of Galactic Starcruiser tie-ins, I’d put even odds on the ship appearing in an episode of a Disney Plus show before the year is out. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Nim2Ew5kGmJp5Zj2DrHA1rnZIso=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269160/cgartenberg_220224_5039_0047.jpg\">  </figure><p id=\"xjtNGz\">Establishing the Halcyon as a key part of <em>Star Wars</em> lore isn’t just Disney not-so-subtly building hype and marketing for its pricey hotel, though. It’s a foundation for a key part of the sales pitch to guests. You don’t just get to live in a <em>Star Wars</em>-<em>ish</em> story for a day or two; your time aboard the Halcyon is part of <em>the</em> <em>Star Wars</em> saga — as much a part of canon as any of the movies, video games, or books. </p><div class=\"c-float-right c-float-hang\"><aside id=\"6NvHfV\"><q>You’re participating in events but never really shaping them</q></aside></div><p id=\"1PdkSh\">That idea of living in an interactive hotel experience has seen Galactic Starcruiser draw a lot of <a href=\"https://www.theverge.com/2017/7/16/15729120/star-wars-immersive-hotel-westworld-disney-d23-expo-2017\">comparisons to Westworld</a>, the eponymous theme park from the HBO series. The two have a lot in common: a promise of total immersion in a fictional world (complete with factions and costumes), the idea that guests can forge their own stories within the setting, and the sky-high price tag that limits attendance to guests with exceptionally deep pockets. Galactic Starcruiser even has its own AI companions and roving robots (although they’re far less murderous than those in Westworld’s.)  </p><p id=\"ayFQ5h\">But Westworld’s impossible park promises a place where you can do anything or be anyone in the Wild West. Galactic Starcruiser puts more emphasis on “choice” over “agency.” A character can bring you to help sabotage the engine or rescue Chewbacca, but you won’t be the one making those decisions. Guests will have some control over which storylines they participate in and which side they’re on, but you’re still just a side character; you’re participating in events but never really shaping them.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sGRL29_BDYhFOPzcG9Rzrphkdi4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269152/cgartenberg_220224_5039_0038.jpg\">  </figure><p class=\"p--has-dropcap\" id=\"FOt31E\">The Galactic Starcruiser experience starts at a spaceport where you’ll ride a transport pod up to the Halcyon proper — the lines between “hotel” and “ride” blurring together from the start. </p><p id=\"p9c1BY\">Exiting the pod takes you to the Atrium, the Halcyon’s “lobby,” where you’ll run straight into guests and cast members alike milling around, ready to draw you into the plot. In quick succession, I met Gaya (the visiting galactic pop star), her manager Raithe Kole, an aspiring musician named Sandro Alimander (who, like me, was on his first trip off-planet), and the ship’s captain Riyola Keevan. Everyone had a story and, more importantly, wanted to try to involve me in it. Despite the elaborate costumes and setting, it still threw me off balance at first. I had to take a few minutes to figure out how I’d be fitting into the roleplaying. </p><div id=\"yaMZwq\"><div data-anthem-component=\"gallery:11066198\"></div></div><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9asr-7G0KCOfZaTq3xe_g4Y4uyY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269124/cgartenberg_220224_5039_0005.jpg\">  </figure></div><p id=\"zUqHBf\">In some ways, the “ship” is a little <em>too</em> polished and clean. At a panel, Brad Schoeneberg, Disney’s vice president of brand merchandising, said it was inspired by “taking a look at the finer side of life in <em>Star Wars,</em>” like the royal halls of Naboo, and (more oddly) the luxury yacht of crime lord Dryden Vos and the problematic halls of Canto Bight. It seemed like the visual language occasionally leaned more toward the gleaming ships of <em>Star Trek</em> than the lived-in style that’s the hallmark of <em>Star Wars.</em> There’s a glossy plastic look that never quite lets you forget you’re in what’s essentially a very large, very long theme park ride. </p><p id=\"4PeWRB\">The Halcyon is also smaller than you might expect. The main dining cabin is about the size of a medium-sized restaurant, while the atrium’s neon-soaked bar offers seating for a couple dozen people at most. (And only a single sabacc table!) There are “restricted” spaces that open up for story elements, like the cargo hold, brig, and engineering bay, but there are really only two or three main “public” spaces to spend time in outside of those plot moments.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/n65aOj1peTDdUJhwXZ0me4x5yko=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269143/cgartenberg_220224_5039_0026.jpg\">      <figcaption><em>A room at Galactic Starcruiser isn’t big, but you’re probably not going to want to spend much time there anyway.</em></figcaption>  </figure><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TR8nXeawejaMGjpHDtJ7LlHHT7I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269145/cgartenberg_220224_5039_0028.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fw-trs28QMs0m5Vp9nelnfdpVFk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269144/cgartenberg_220224_5039_0027.jpg\">  </figure></div></div></div><p id=\"ieZ3Qf\">The rooms I saw were pretty compact, too. There’s space for a bed, a slide-out table, and enclosed bunk beds built into one of the walls. It looks to have leaned too far into emulating the space-sensitive designs of an actual cruise ship. I’ve never stayed in a $2,000-per-night hotel room, but I would expect a lot more than this. </p><p id=\"JDv7p0\">No one will mistake Galactic Starcruiser for a traditional luxury hotel by Earth standards. There’s not much in the way of normal amenities — no pools, gyms, or spas, and virtually no natural light. (There is a single outdoor space, branded the “Climate Simulator” to avoid breaking character.) Sure, you wouldn’t go to Galactic Starcruiser for a regular hotel experience, but the price still feels like a miss.</p><p id=\"N4YjHU\">Disney is putting plenty of emphasis on the food and drink aboard (both included in the ticket price, although specialty and alcoholic drinks are not). The presentation aims to go above and beyond a standard hotel menu. Much like <a href=\"https://www.theverge.com/2017/5/28/15702620/pandora-world-of-avatar-drink-vs-unicorn-frappucino-starbucks\">Pandora</a> or <a href=\"https://www.polygon.com/2019/5/31/18638513/disneyland-star-wars-land-what-to-eat-drink-food-photos-galaxys-edge\">Galaxy’s Edge</a>, food features unique shapes, colors, and textures to evoke a galaxy far, far away from our own, like colorful blue shrimp (allegedly sourced from Felucia) or black lava-rock bread evoking the volcanic world of Mustafar. </p><p id=\"7eQdjK\">At the <em>Star Wars</em> hotel, even the food has lore. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5I4QFSIJ5x8cQA_po4UWoYOWJR8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269161/cgartenberg_220224_5039_0048.jpg\">      <figcaption><em>The Crown of Corellia Dining Room.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SXEi00B3NMOyfypZFbYxSyuRay8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269146/cgartenberg_220224_5039_0030.jpg\">  </figure></div></div></div><p class=\"p--has-dropcap\" id=\"5UkF17\">Each trip on Galactic Starcruiser will follow the same broad story arc. Guests are passengers aboard the 275th anniversary trip of the luxury starcruiser, the Halcyon, which is emulating its original voyage from Chandrila to Batuu. Set in between <em>The Last Jedi </em>and <em>The Rise of Skywalker</em>, the ship runs afoul of the First Order — <em>Star Wars</em> drama ensues. </p><p id=\"Tgar9q\">Storylines, we’re told, will develop organically over the two-day trip, based on how players interact and react to cast members and the actions they take along the way. There are multiple branching paths, only some of which I got to take part in: smuggling a Resistance ally on board and sneaking into the engine room to reboot the ship’s systems — but there were other plots that appear at the finale event, like stealing access codes or unlocking a Jedi holocron, that weren’t in my (brief) journey. Someone else playing through a Resistance story might have seen more of those adventures, while a First Order-aligned guest would have had their own interactions to try to foil those plots. </p><p id=\"DUwew3\">The whole thing culminates in an action-packed live stage show finale — it wouldn’t be <em>Star Wars</em> without a lightsaber duel (one which includes <a href=\"https://www.theverge.com/2021/5/4/22418959/disney-real-lightsaber-reveal-video-star-wars-galactic-starcruiser-hotel\">the spectacular-looking “real” lightsaber prop</a> the company <a href=\"https://www.theverge.com/2021/11/17/22788415/disney-star-wars-real-lightsaber-galactic-starcruiser\">showed off a few months ago</a>). “You may all be watching the same big events, but you’re not watching the same things,” said Cory Rouse, a creative director for Walt Disney Imagineering, noting that a guest who sided with the Resistance will see payoffs that might not make sense to a scoundrel character, while a First Order ally will experience the finale in yet another light. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/c57spmzF_GVzcGuDYO5c3CORkvk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269150/cgartenberg_220224_5039_0035.jpg\">      <figcaption><em>Disney’s movie magic comes to life when Rey wields her “real” retractable lightsaber in the event’s finale.</em></figcaption>  </figure><p id=\"SNfsXo\">Immersion is the name of the game here: each sign is written in both English and the fictional Aurebesh alphabet; every cast member, waiter, room service attendant, and bartender is in character the entire time; and elaborately costumed guests chat with you about their own lives to help draw you into the world. As you’d expect from a Disney park experience, there’s incredible attention to detail. All the doors on the ship are sliding, instead of on hinges, to better fit into the <em>Star Wars</em> universe.</p><p id=\"iQTctQ\">But that level of theater is table stakes for Disney World. Galactic Starcruiser aims to take things a step further by actively looking to draw in guests. Visitors are encouraged to dress up in full <em>Star Wars</em> cosplay to inhabit the world, at least for a day or two. (Disney, of course, is happy to sell you <em>Star Wars</em>-themed attire if you don’t already have it.) And the key differentiator is the ability to participate in the adventure. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MiW-Q7S5Z27TN7LIXq_x7Y8XHP0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269138/cgartenberg_220224_5039_0020.jpg\">      <figcaption><em>Disney will happily sell you any accessories or outfits you’ll need at The Chandrila Collection gift shop.</em></figcaption>  </figure><p id=\"z3vE41\">The average <em>Star Wars</em> movie is about two hours long. Two seasons of <em>The Mandalorian</em> on Disney Plus will take you about half a day. Galactic Starcruiser aims for a far bigger scope: two days’ worth of <em>Star Wars</em> story. That means turning a lot of the ordinary parts of your day — including eating and sleeping — that you wouldn’t find in a movie into something more special and <em>Star Wars</em>-y. </p><p id=\"YUk7T6\">“[Movies] are a slice of life with all the boring cuts part out,” Rouse told <em>The Verge</em>. “Whenever we’re trying to build a world like this, we actually want you to have all of the extra — what we call the magical mundane,” turning those “boring parts” into something more. That might be a comment from your (in-character) server at the bar about the ongoings aboard the ship or a glimpse of a character like Rey gesturing at you from around a corner to help her with a mission.</p><div class=\"c-float-left c-float-hang\"><aside id=\"zqtx1T\"><q>“Do you want to play Star Wars?”</q></aside></div><p id=\"NvTLUe\"> “What they’re really asking you is ‘Do you want to play Star Wars?’” Rouse says. </p><p id=\"RApuSQ\">The word that Disney uses for most of Galactic Starcruiser’s more unique aspects is an “invitation.” As Ann Morrow Johnson, executive producer and creative director at Walt Disney Imagineering, noted in a press panel, “I think so much of this experience lives in these smaller subtler moments where these characters are existing, they’re living their lives, and they’re inviting you to come and play with them, if you want to.” </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/E66z65j3m0000Q56c9dSZd8-l4M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269141/cgartenberg_220224_5039_0023.jpg\">      <figcaption><em>Playing some sabacc at the Sublight Lounge bar.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/letcQ5QKMkIrQmUQeUVOUvQ9oA4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269147/cgartenberg_220224_5039_0031.jpg\">  </figure></div></div></div><p id=\"UpWPdd\">At one point in our abridged trip, a few members of my group were pulled aside by a crew member to assist in a jailbreak for a captured Resistance member. Together, we hacked a terminal, passed the brig override code across a room in a short game of telephone, and unlocked the door so that they could escape. Presumably, I could have decided not to help if I wanted to aid the First Order instead. </p><p id=\"e802L4\">Galactic Starcruiser asks a lot of its guests. You’re basically diving into a giant improv exercise with dozens of strangers. And what you’ll get out of the experience is largely what you put in. In my short time there, it was hard to shake the feeling that I was just going through the motions for the particular story track my group was assigned. Maybe the smaller groups, added time, additional context, and more gradual pace of storytelling that the full experience has help make the process feel more organic. But that guided nature that slots you into specific roles is at least part of the point. </p><div class=\"c-float-right c-float-hang\"><aside id=\"3wDlKE\"><q>Galactic Starcruiser asks a lot of its guests</q></aside></div><p id=\"a7DszT\">According to Sara Thacher, a senior R&amp;D Imagineer and the creative director behind all the branching narrative choices on board, Galactic Starcruiser is intended so that “you can show up and not have a character, not have to know any lines, not have to know anything about the story” and still have a good time. She described it almost like a traditional video game: players fall into a role from the game, and they can make choices but still have the framework and guidance they need to have fun. My short time on board didn’t really give me the chance to make those decisions for myself, however. </p><p id=\"HrxIAJ\">Disney also wants to make sure guests are able to <em>understand</em> what choices they’re making: Thacher explained that an important goal is making sure that when you make a decision (to help someone or not), it’ll be clear what the broader outcome is: “We want you to know, ‘Yes, this means if I do this, I’m helping the Resistance,’ and presenting those choices as clearly as we can and really, as often as we can, as you as you encounter different pieces of the story, different pieces of the narrative.” In other words, if you’re looking to fight with the Resistance, you shouldn’t have to worry that talking to the wrong person will get you stuck for your whole trip as a First Order sympathizer. </p><p id=\"zsMcxw\">“Real choice means I have to understand the stakes,” Thacher adds. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/za7GP2vaCJ-bQ76henhZcUrz9u8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269157/cgartenberg_220224_5039_0042.jpg\">      <figcaption><em>Learning the ways of the Jedi in the ship’s lightsaber training pod activity.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"Nw9tJL\">There are a few ride-like activities on the Halcyon, like the lightsaber training pod or the bridge, and the overall vibe here is more cruise ship than theme park — albeit a cruise ship that’s been ripped out of the <em>Star Wars</em> universe. </p><p id=\"GKEUIs\">The lightsaber training was (unsurprisingly) the best of them. Guided by a Saja (a Jedi-like follower of the Force), guests are given a lightsaber to spin and slash around to block blaster bolts. The effects and haptics here make the activity — not just light and sound, but you can actually <em>feel</em> the saber blocking each bolt as it flashes in the real world. </p><p id=\"K3Y4EM\">The bridge area, meanwhile, is a more cooperative group activity in the vein of the Millennium Falcon: Smugglers Run ride at Galaxy’s Edge, with four different roles that guests rotate between. Bouncing across the different stations let me take a turn blocking asteroids, aligning the ship’s sensors by matching buttons and switches, blasting lasers, and more.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/to8K-x6o7rITGmJrI1e-hKiHSt0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269158/cgartenberg_220224_5039_0045.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QxyUZMdwsZL-JyHFyCinVOP0mMs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269136/cgartenberg_220224_5039_0018.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NZzduHn0a9Z2nge9tnSykqk0UoY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269125/cgartenberg_220224_5039_0006.jpg\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dFZc42xTLO3Omo0T1JxnBQWbFLA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269153/cgartenberg_220224_5039_0039.jpg\">  </figure></div></div></div><p id=\"RGxSA1\">Those shipboard activities, in addition to offering entertainment in their own right, help serve as catalysts for drawing guests further into those story arcs. A bridge training exercise, for example, might end with helping the ship’s captain on a clandestine rescue mission in an asteroid belt. </p><p id=\"1P48gS\">Guests will also journey down to the Galaxy’s Edge park in Disney World proper, where they’ll be able to ride the Millennium Falcon: Smugglers Run and Rise of the Resistance rides (Galactic Starcruiser guests will get to use the premium-purchase “<a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fdisneyworld.disney.go.com%2Ffaq%2Fgenie%2Flightning-lane-overview%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22949905%2Fstar-wars-galactic-starcruiser-hotel-interactive-disney-world-photos-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Lightning Lanes</a>” to avoid waiting in line, of course), along with accomplishing their own missions given to them from characters on the ship through the smartphone-based “Datapad” built into the Play Disney Parks app. Disney says those activities will also tie into guests’ individual, ongoing storylines when they come back aboard the ship. </p><div class=\"c-float-left c-float-hang\"><aside id=\"piArYq\"><q>A franchise that you can not just love, but live in</q></aside></div><p id=\"lddD1l\">The integration of narrative, traditional theme park rides, live entertainment, and a hotel stay make Galactic Starcruiser a blend of virtually every aspect of a Disney World trip all at once. It feels like the next step for the modern, all-encompassing pop culture machines that have come to dominate entertainment: a franchise that you can not just love, but live in. </p><p id=\"eVPzmI\">It’s also important to remember that Galactic Starcruiser is just the <em>first</em> of the company’s efforts here, one that will, like the parks it’s set in, presumably grow and change over time. And it’s easy to imagine that both Disney (and its competitors) will be thinking about how to bring this kind of first-hand fan experience to more properties in the future. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/U8XFjhwwxTAExtZ5uOYwstrlDDo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269142/cgartenberg_220224_5039_0024.jpg\">      <figcaption><em>“Traveling through hyperspace ain’t like dusting crops.”</em></figcaption>  </figure><p class=\"p--has-dropcap\" id=\"ZgnFmJ\">That immersive experience comes at a very literal cost, though. When Disney first announced pricing, a two-night stay was quoted as starting at $4,809 for two adults, while a family of four (three adults, one child) was $5,999. That only includes the “basic” — relatively speaking — Galactic Starcruiser experience. Things like alcoholic or “specialty” drinks, outfits to better fit into the<em> Star Wars</em> universe you’re joining for your stay, and experiences like Savi’s Lightsaber Workshop on Baatu are extras you’ll have to budget in, too, additions to dive even deeper into the world. </p><div class=\"c-float-right c-float-hang\"><aside id=\"NugGVJ\"><q>All this comes at a very literal cost</q></aside></div><p class=\"c-end-para\" id=\"AjlKno\">The end of our Galactic Starcruiser trip ended much in the same way that any day at Disney World does: a grand fireworks show celebrating a successful voyage. The explosions are bright and colorful, with shapes and designs far beyond anything terrestrial fireworks could do. But they’re also fake: they’re digital illusions playing on the massive “viewport” screens on the bridge, masked by the soaring John Williams score and the heightened reality you’re in. </p><p id=\"TkYXZR\"><em>Photography by Chaim Gartenberg / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HP8dMAq0if0_QFulGM9GeJbTgxY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23269162/cgartenberg_220224_5039_0049.jpg",
  "description": "What you’ll do, who you’ll meet, and where you’ll stay.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}