{
  "title": "Instagram is begging you to stop reposting TikToks to Reels",
  "url": "https://www.theverge.com/2022/4/20/23034356/instagram-ranking-reels-original-content-tiktok",
  "date": "2022-04-20T20:55:20.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"Instagram Reels\" src=\"https://cdn.vox-cdn.com/thumbor/wFt9_bRTApvQe8RFZd_odPuMvk8=/79x0:3127x2032/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70773346/Reels_IOSX_3.0.png\" />        <figcaption>Image: Instagram</figcaption>    </figure>  <p id=\"ez8ywx\">Instagram is making a few new creator-focused changes to its platform, which Instagram head Adam Mosseri said are meant to “make sure that credit is going to those who deserve it.” </p><p id=\"Ne1n7W\">The new stuff is made up of three changes: product tags are now available to everyone, so you can tag a product in your post; you can assign yourself to a category like “Photographer” or “Rapper” and have that category show up every time you’re tagged in a post; and Instagram is going to start more heavily promoting original content on the platform.</p><p id=\"Me8Sbh\">“If you create something from scratch,” Mosseri said in a video explaining the new features, “you should get more credit than if you are re-sharing something that you found from someone else. We’re going to try and do more to try and value original content more, particularly compared to reposted content.” Valuing original content isn’t a new thing, of course, but Mosseri said Instagram is going to lean more heavily in this direction.</p><p id=\"LTRZIZ\">Translation? Please, please, please stop just posting your favorite TikToks to Reels. We’re begging you.</p><div id=\"aMPbFs\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">  New Features  <br><br>We’ve added new ways to tag and improved ranking: <br><br>- Product Tags<br>- Enhanced Tags <br>- Ranking for originality <br><br>Creators are so important to the future of Instagram, and we want to make sure that they are successful and get all the credit they deserve. <a href=\"https://t.co/PP7Qa10oJr\">pic.twitter.com/PP7Qa10oJr</a></p>— Adam Mosseri (@mosseri) <a href=\"https://twitter.com/mosseri/status/1516811952235769860?ref_src=twsrc%5Etfw\">April 20, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"hsynIV\">Meta has made it clear that it sees Facebook and Instagram as creator-focused platforms going forward, rather than as tools for people to connect with their friends. So both platforms have invested in shopping tools, ways for creators to build audiences, and lots of other things they hope will entice creators to stop being TikTokers and YouTubers and start being Instagrammers and Facebookers. </p><p id=\"cnxh9m\">Reels, in particular, <a href=\"https://www.theverge.com/2022/2/22/22945800/meta-facebook-reels-tiktok-clone-global-launch\">is central to this effort</a>. Meta CEO Mark Zuckerberg called the short-form videos “<a href=\"https://www.facebook.com/4/posts/reels-is-already-our-fastest-growing-content-format-by-far-and-today-were-making/10114335272495801/\">our fastest growing content format by far</a>,” and they’re now available across Facebook and Instagram. But anyone who uses Reels knows it can feel like a TikTok clone, often with the same content just reposted — TikTok logo and all — from elsewhere. One way for Instagram to disincentivize that practice? Bury it in the rankings. And that’s exactly what Mosseri seems to be planning to do.</p><p id=\"UMjUZV\">As for how Instagram will determine what counts as original, Mosseri said only that it’s hard, and “we will iterate over time.” The change is likely to be a huge problem for aggregator accounts, many of which are hugely popular sources of memes and trends but are often accused of stealing content and credit from creators. “As we lean more into recommendations it’s becoming increasingly important that we don’t overvalue aggregators,” Mosseri tweeted, “as that would be bad for creators, and therefore bad for Instagram long term.”</p><p id=\"kWyXCz\">The push for original content on Meta’s social products is nothing new, nor is the fact that the most popular stuff on Facebook and Instagram <a href=\"https://www.theverge.com/2021/8/27/22644126/the-most-popular-posts-on-facebook-are-plagiarized\">tends to be plagiarized</a>. Meta’s platforms have the largest audiences, but TikTok, Twitter, and others tend to be where new memes and trends are created. If Instagram and Facebook want to be successful creator platforms, they’ll have to find a way to flip that. And starting by turning its most powerful knob — the ranking algorithm that decides what billions of people see every day — is a pretty serious first move. One other idea would be to pay creators more, but given that Meta appears to be <a href=\"https://www.theverge.com/2022/4/6/23013399/instagram-reels-payments-cuts\">cutting its Reels payouts</a>, that may not be coming anytime soon.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Si4eMdo4o1uyM5K8jYUe2MvoH1A=/0x177:3206x1856/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21698434/Reels_IOSX_3.png",
  "description": "Down with resharing, up with original ‘grams.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}