{
  "title": "Insteon’s troubles are a smart home tale as old as time",
  "url": "https://www.theverge.com/23032451/smart-home-troubles-insteon-ihome-shutdown-matter",
  "date": "2022-04-20T19:18:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CV7im2Wa2lRoMYT8AOGO8I_VJe0=/37x0:2106x1379/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70770644/IMA_hero_1_iphone11pro.0.png\" />        <figcaption><em>Smart home company Insteon appears to have closed up shop with no warning to its customers.</em> | Image: Insteon</figcaption>    </figure>  <p id=\"6ECajD\">Revolv, Iris, Insignia, Staples Connect, Wink, and now Insteon and iHome: the graveyard of dead or dying smart home ecosystems that promised so much yet failed to deliver is getting crowded. Smart home company Insteon has turned off its cloud servers, as first reported <a href=\"https://staceyoniot.com/insteon-is-down-and-may-not-be-coming-back/\">by Stacey on IoT</a>, and device maker <a href=\"https://twitter.com/Homekitgeek/status/1499900568743165952\">iHome has also shut down its servers</a>, confirming to <em>The Verge</em> that its iHome cloud services were terminated on April 2nd. </p><p id=\"ww7QwL\">This feels like a good time for a reflection on the state of the smart home. Is it all over? Or is this cloud carnage simply necessary to clear the way for a brave new world, one where the smart home is no longer a curiosity but something that actually matters?</p><p id=\"oTgMWE\">What those companies mentioned above have in common is a reliance on a proprietary cloud server to deliver at least part of the experience customers signed up for. When the company’s business model changed and the cost of running that cloud was deemed unnecessary, consumers were left in the lurch. </p><p id=\"4qZsRa\">The <a href=\"https://www.theverge.com/2016/4/4/11362928/google-nest-revolv-shutdown-smart-home-products\">Revolv smart home hub was bought and then shut down by Google</a>, <a href=\"https://www.theverge.com/2019/2/2/18208407/lowes-iris-smart-home-platform-shutting-down-march-2019\">Iris</a> and <a href=\"https://www.theverge.com/2019/9/6/20853671/best-buy-connect-insignia-smart-plug-wifi-freezer-mobile-app-shutdown-november-6\">Insignia’s</a> clouds were switched off by Lowes and Best Buy, respectively, Staples pulled the plug on its Connect hub, and <a href=\"https://www.theverge.com/2020/7/8/21317739/smart-home-platform-wink-monthly-subscription-price-date\">Wink has pivoted</a> from a free to a paid service. A fact many manufacturers seem to overlook when jumping on the smart home bandwagon is that maintaining a cloud-based smart home service costs money — a lot of it, for a long time.</p>  <figure class=\"e-image\">        <img alt=\"Revolv home automation hub\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xX1jbL6DzMfjj4K3yHjP3Vs0U08=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/2797458/RevolvHub-App_HiRes.1384265971.jpg\">      <figcaption><em>The Revolv hub was one of the first high-profile smart home companies to turn out the lights.</em></figcaption>  </figure><p id=\"ZlplFO\">While most of those examples are ancient history, in the last few weeks, the cloud carnage has begun again. On April 2nd, device manufacturer iHome shut down its iHome app and iHome cloud service, announcing this quietly with only an in-app notification. The action ends support for several of its iHome branded smart plugs, its smart monitor, motion sensor, leak sensor, and door window sensor. </p><p id=\"48tSfy\">While the smart plugs and smart monitor will still work with the Apple Home app thanks to their HomeKit compatibility, beyond that, these devices are essentially junk. Astonishingly, <a href=\"https://www.amazon.com/iHome-iSB01-WI-FI-Motion-Sensor/dp/B076TC9WN4/ref=cm_cr_arp_d_product_top?ie=UTF8&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">many are still being sold,</a> but as they require the iHome app, which no longer exists, they simply will not work.</p><div><aside id=\"dGSSsi\"><q>The weak link is the proprietary cloud</q></aside></div><p id=\"n5JvPg\">Then, late last week, users of Insteon, a smart home ecosystem that relies on a proprietary communication protocol, started reporting that the hubs that control their Insteon smart light switches, outlets, sensors, thermostats, and other devices, were offline. The company, which has been in business since 2005 and was one of the earliest smart home pioneers, has gone completely dark. </p><p id=\"nc8b8E\">There was no official word from the company ahead of the shutdown, and no advanced warning to users — which is inexcusable. And while the Insteon system status is still cheerily announcing that all services are online, the only official response so far is <a href=\"https://www.insteon.com/news2022\">this cryptic “message to the Insteon community” on its site</a>, which discusses the company’s financial troubles. It doesn’t explain what’s happening with its services or what its customers can do. </p><p id=\"TTUkyj\">Interestingly, because Insteon was originally built as a locally controlled system, owners can switch their existing devices and hub to an open-sourced home automation system such as <a href=\"https://www.home-assistant.io/integrations/insteon/\">Home Assistant</a> or <a href=\"https://community.hubitat.com/t/insteon-users-some-help-to-keep-you-going/92510\">Hubitat</a>. So, while it’s a significant inconvenience, they aren’t completely out of luck, unlike non-Apple iHome users. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dP-JiGkUVt297FeWjw0_sq7T3E8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401004/81tV91SAgtL._AC_SX466_.jpg\">      <cite>Image: iHome</cite>      <figcaption><em>iHome’s smart home app has shut down, leaving users of some of its smart devices with no way to control them.</em></figcaption>  </figure><p id=\"rHRdGG\">The weak link here is the proprietary cloud. A cloud-connected device has a myriad of benefits — most notably away-from-home control, over-the-air updates, and easier setup and programming. But its instability, especially if you’re taking a bet on a bootstrapped startup, is a major downside. The end-user has no control if the company that owns it decides to stop running the servers. This is a major reason why many people are wary of the smart home in its current form. Why spend money on something that could become a very expensive paperweight one day? That Revolv hub cost $300. Many Insteon customers spent hundreds or thousands of dollars on their systems.</p><div class=\"c-float-right\"><aside id=\"FaCPh8\"><q>Smart devices need a unified system to connect them, one that isn’t dependent on the fortunes of individual companies</q></aside></div><p id=\"7GRBc2\">The solution, as appealing as it might be in the moment, isn’t to abandon the smart home. Most connected devices offer a significant upgrade over their non-smart counterpart. A smart door lock can tell you exactly who unlocked your door and when; a connected sprinkler controller won’t water your garden if it’s going to rain; smart light bulbs can mimic the natural cycle of sunlight to help you feel more energized or more relaxed; and smart thermostats know when you’ve left and can stop wasting energy heating an empty home. And these are just a few examples.</p><p id=\"6lOr9M\">The solution is to make smart home devices the norm, not the exception. For this to happen, they need a unified system to connect them, one that isn’t dependent on the fortunes of individual companies. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HAO-0dAm26f9FDGi-imwh5_zSQg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23153061/nxp_advances_iot_connectivity_with_industrys_first_secure_tr.0.jpg\">      <cite>Image: NXP</cite>      <figcaption><em>Matter devices will have the Matter logo on to show they're compatible with the new standard.</em></figcaption>  </figure><p id=\"6CRD3x\">Here is where the promise of <a href=\"https://www.theverge.com/22787729/matter-smart-home-standard-apple-amazon-google\">Matter</a> comes in. When it arrives, the new smart home interoperability protocol backed by most of the big (and small) names in the industry (but notably not Insteon or iHome) should allow devices to work locally in your home without relying on a single cloud service to operate. </p><p id=\"MXtT8w\">Instead, the expectation is that they will work with or without a cloud service, communicate with devices from different manufacturers locally, and, if you want the benefits of cloud control, work with whichever compatible platform you choose. If one service or ecosystem goes away, you should be able to just choose another way to control your devices. </p><p id=\"Rwe6Sd\">“In cases like this, where manufacturer support ends, it is expected that devices that support Matter will continue to work locally with others in the home and be discoverable and controllable from other smart home systems and apps,” confirms Michelle Mindala-Freeman of the <a href=\"https://csa-iot.org/\">Connectivity Standards Alliance</a>, the organization that oversees Matter. “This is another benefit of Matter’s Multi-Admin capability.” Multi-admin allows devices to use multiple platforms simultaneously, so your light bulb can be controlled by HomeKit and Alexa, for example. </p><aside id=\"VchyB5\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Matter’s plan to save the smart home\",\"url\":\"https://www.theverge.com/22787729/matter-smart-home-standard-apple-amazon-google\"}]}'></div></aside><p id=\"QAapBK\">However, <a href=\"https://www.theverge.com/2022/3/17/22982166/matter-smart-home-standard-postponed-fall-2022\">Matter has been repeatedly delayed</a>, and we still don’t know exactly how it will work in practice because no one has actually used it yet (note Mindala-Freeman’s use of the word “expected”). When it does arrive (currently scheduled for fall 2022), it will be too late to help iHome and Insteon customers. But it is clear that the smart home is at a major tipping point right now. </p><p id=\"FIFwRS\">Which company will be next to shut off its servers? Smart lighting manufacturer LIFX’s parent company has <a href=\"https://buddy.com/wp-content/uploads/2022/04/Appointment-of-Receivers-and-Managers.pdf\">gone into receivership</a>, and despite the <a href=\"https://www.reddit.com/r/lifx/comments/u3uz66/the_lights_are_still_on/\">company’s protestations on Reddit</a> that all is fine, it’s hard not to worry. In reality, any small company that relies on a cloud server, doesn’t charge a monthly subscription fee, and lacks deep pockets, is potentially at risk. </p><p id=\"XzIV6s\">The safest bet for building your smart home today is to stick with the bigger names with good track records and solid companies behind them. Or sit around for a while under dumb light bulbs and wait patiently for Matter.</p><p id=\"peZMD5\"><em><strong>Update, Wednesday, April 20th, 3:18 PM: </strong></em><em>Updated the article to include a response from Insteon posted on its website regarding the company’s situation.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4skwl0-dJolr8HTYYdLnh661VCg=/0x164:2321x1379/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23400978/IMA_hero_1_iphone11pro.png",
  "description": "More cloud carnage this month highlights just how much the smart home is in need of saving. Is Matter the answer?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}