{
  "title": "Instagram adds new tagging options to credit creators",
  "url": "https://www.theverge.com/2022/3/8/22967484/instagram-enhanced-creator-tags",
  "date": "2022-03-08T19:30:39.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/eE1K2hBl8cBXbkanYXRaAcX6bGo=/376x0:6496x4080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70595346/download.0.png\" />        <figcaption>Image: Instagram</figcaption>    </figure>  <p id=\"vD7sxc\">Instagram has introduced <a href=\"https://business.instagram.com/creators/blog/instagram-enhanced-tags-creator-credits-announcement\">new tagging options</a> that can display more detail about a person to help credit collaborators. Enhanced tags will show the roles of collaborators — like photographers, artists, writers and others — who work on content but aren’t always immediately visible unless mentioned by a post’s creator.</p><p id=\"RX4EGQ\">In announcing the updated tagging options, the company acknowledged that many collaborators’ work goes into creating the content users see on the app. </p><p id=\"E1NmFX\">“For many Black and underrepresented creators, crediting is an entryway to building a sustainable career as a creator, while combating cultural appropriation and ensuring the world knows who is driving culture,” Instagram says in its announcement.</p><p id=\"Sg9OSf\">Instagram suggests the feature will be used to highlight behind-the-scenes creators who sometimes go unnoticed or unacknowledged, like makeup artists or songwriters. </p><p id=\"7C14Ow\">The enhanced tags are a more official way to display what some creators have already made a habit of doing. Instagram users have found several DIY methods of crediting the people involved in content creation. Some users specify roles in the caption of posts and tag collaborators there, while others have tagged a flurry of handles directly on the photo or video posted. </p><p id=\"qHO4hd\">Users can tag contributors when uploading content by tagging accounts and tapping “show profile category” to display their role.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z3V1VWrfuZx5dPFGDL-7tRUosdM=/0x329:6496x3730/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23298605/download.png",
  "description": "Roles like photographer or stylist will be visible on tags.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}