{
  "title": "Instagram now lets all users tag products in their posts",
  "url": "https://www.theverge.com/2022/3/22/22990744/instagram-product-tag-posts-shopping",
  "date": "2022-03-22T15:01:12.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/fUjMKLL-mQPRrWeq07hRvJ4DSfg=/0x150:3600x2550/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70656872/instagram_product_tag_1.0.jpg\" />        <figcaption><em>US-based users on Instagram can now tag products in their posts. </em> | Image: Instagram</figcaption>    </figure>  <p id=\"VPddgL\">Instagram is opening its product tagging feature to all users in the US, which means you no longer need a business or creator account to tag products in your posts. Starting today, the feature will start rolling out to everyone “over the next few months.” Instagram has transformed into an app where just about everything can be shoppable, and now you can purchase the same look that your friend is wearing in their posts.</p><p id=\"yIj3ll\">The platform <a href=\"https://business.instagram.com/blog/shopping-on-instagram/\">first rolled out product tagging in 2016</a> as part of its initial push into e-commerce, later supporting product tags in <a href=\"https://www.theverge.com/2018/11/15/18095679/instagram-shopping-product-collection-video-posts\">video posts</a> and <a href=\"https://www.theverge.com/2018/6/12/17453930/instagram-stories-shopping-update\">stories</a> (and, eventually, <a href=\"https://www.theverge.com/2020/12/10/22165957/instagram-reels-shopping-update-global\">Reels</a>). As Instagram’s shopping experience continued to evolve, the platform added <a href=\"https://www.theverge.com/2019/3/19/18271840/instagram-checkout-shopping-facebook-business\">a native checkout feature</a> that lets you buy products directly from tags and also <a href=\"https://www.theverge.com/2019/4/30/18523637/instagram-camera-redesign-create-mode-shopping-tags-facebook-f8-2019\">gave creators the ability to tag products</a> in their posts. </p><p id=\"ICoTog\">To tag a product, start by creating a post like you normally would. After choosing your filter and making any adjustments, proceed to the next page and tag the brand of the products in your post using the “Tag people” option. From here, you’ll see “Tag products” where you can tap the product in your photo or video, and then search for that brand’s product to add a tag. Other users will be able to see the product tags in your post and can tap them to make a purchase. Meta spokesperson Anne Yeh told <em>The Verge</em> that influencers won’t receive a kickback from any purchases made through product tags, but the platform is currently testing <a href=\"https://creators.instagram.com/earn-money/affiliate\">an affiliate program</a> with select creators that lets them earn a commission through tagged products.</p><p id=\"CTFuga\">Instagram already has an impressive number of users tagging products in their posts, with 1.6 million people tagging at least one product per week. Expanding the feature to its entire userbase — which is <a href=\"https://www.theverge.com/2021/12/14/22834571/instagram-2-billion-active-users\">rumored to be 2 billion strong</a> — will help expand the visibility of products through organic, non-sponsored posts that could open an entirely new market of users wanting to share the products they use with friends and family on the app.</p><div class=\"c-float-right\"><aside id=\"JSUW3A\"><q>1.6 million users tag at least one product every week</q></aside></div><p id=\"aAVRWF\">Instagram says business owners will receive a notification when one of their products is tagged — posts with tagged products appear in a business’ tagged tab on their profile. Brands will also get the option to turn tags from everyone on the platform on or off from their account settings.</p><p id=\"JQjvXL\"><em><strong>Update March 22nd 12:10PM ET: </strong></em><em>Updated to clarify that users need to tag a brand before tagging a product, and also added more information regarding earning a commission from tagged products.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/moRNEWYtr2Qp9IJMtg9WXFSBFsE=/0x408:3600x2293/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23336657/instagram_product_tag_1.jpg",
  "description": "Universal product tagging is rolling out to users in the US.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}