{
  "title": "Instagram says it’ll stop supporting the IGTV app",
  "url": "https://www.theverge.com/2022/2/28/22955646/instagram-shuts-down-separate-igtv-app-video-changes-reels-ads",
  "date": "2022-03-01T01:01:14.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/AsBIHZRWtcgEK8vsHHvGQRN_Su8=/46x0:586x360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70562988/IMG_1866.0.jpg\" />        <figcaption><em>RIP, IGTV.</em> | Image: Instagram</figcaption>    </figure>  <p id=\"99F2CQ\">Instagram <a href=\"https://business.instagram.com/creators/blog/instagram-reels-creators-simplify-video\">has announced</a> that it will no longer be supporting the separate IGTV app, saying in a blog post that it will instead focus on keeping all video in the main Instagram app (<a href=\"https://techcrunch.com/2022/02/28/instagram-is-shutting-down-its-standalone-igtv-app\">via <em>TechCrunch</em></a>). While the writing’s been on the wall for Instagram’s YouTube competitor for a while, the official shutdown announcement marks the end of an era for one of Instagram’s forays into video.</p><p id=\"UsgUvD\"><a href=\"https://business.instagram.com/creators/blog/instagram-reels-creators-simplify-video\">In its post</a>, Instagram says that it’s getting rid of the standalone IGTV app as “part of [its] efforts to make video as simple as possible to discover and create.” The post also says that any videos in the main app will have a full-screen viewer and tap-to-mute, and that Instagram is working on a consistent way to share the different types of videos (such as video posts or Reels). The company is also planning on “testing a new ad experience on Instagram, which will allow creators to earn revenue from ads displayed on their reels” later this year. </p><div class=\"c-float-right\"><aside id=\"dSvMKr\"><q>IGTV failed to catch on, and has had its role diminished over the years</q></aside></div><p id=\"ZCChnL\">The standalone IGTV app was <a href=\"https://www.theverge.com/2018/6/20/17484436/instagram-igtv-video-app-launch\">announced in 2018</a>, and was meant to go toe-to-toe with YouTube by acting as a place to post long-form vertical videos. Less than a year later, IGTV content was <a href=\"https://www.theverge.com/2019/2/7/18215601/instagram-igtv-video-previews-feed-main-app\">being heavily promoted</a> in the main Instagram app, with videos showing up on the Explore page, and previews showing up in stories and on the main feed. In 2020, Instagram <a href=\"https://www.theverge.com/2020/1/20/21073680/instagram-igtv-button-home-screen-app-interface-long-form-video\">removed the button</a> that took you to IGTV content in the main app, citing the fact that very few people used it, and late last year <a href=\"https://www.theverge.com/2021/10/5/22710638/instagram-tv-igtv-rebrand-video-formats-tiktok-reels\">the company announced</a> that IGTV was being rebranded as “Instagram TV,” and that IGTV’s hour-long time limit would be coming to regular videos too.</p><p id=\"chdoa3\">While the IGTV app is going away, along with <a href=\"https://www.facebook.com/business/ads-guide/video/instagram-instream-videos/video-views\">the In-Stream ads</a> that were inserted into videos over a minute long, Instagram has made it very clear that it still intends to focus heavily on video. Monday’s blog post announcing IGTV’s retirement is titled “Continuing our video investment on Instagram,” and last year Instagram’s lead <a href=\"https://www.theverge.com/2021/6/30/22557942/instagram-no-longer-photo-app-video-entertainment-focus\">said that it was no longer a photo app</a> — instead, it’s going after competitors like TikTok and YouTube in a bid to become a general entertainment app. </p><p id=\"iZ0wBR\">Since then, we’ve seen Meta <a href=\"https://www.theverge.com/2021/11/12/22777899/instagram-reels-bonus-program-35000-dollars-creators-tiktok-competitors\">offer creators up-to $35,000 bonuses</a> to post Reels, and there have been plenty of new video features added to the main Instagram app (though <a href=\"https://www.theverge.com/2021/12/13/22832529/instagram-reels-visual-replies-feature-tiktok-copy\">many of them are copied from TikTok</a>).</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KrvmrIZ4WwSocUUv0fkvtxsk69s=/0x15:631x345/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19613618/IMG_1866.jpg",
  "description": "Instagram wants all its video content in one place",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}