{
  "title": "Instagram’s new chronological mode is exactly what a feed should be",
  "url": "https://www.theverge.com/2022/3/23/22991852/instagram-favorites-following-chronological-feed-return",
  "date": "2022-03-23T15:00:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JQd5Ru4gm75f_iBI5IepfbDhW74=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70661582/p.0.png\" />        <figcaption><em>Instagram says it’s giving users more control over their feeds.</em> | Image: Instagram</figcaption>    </figure>  <p id=\"CWIH3D\">Instagram <a href=\"https://about.fb.com/news/2022/03/two-new-ways-to-control-your-instagram-feed/\">announced on Wednesday</a> that it’s adding two new modes that change how the main feed works, bringing back the much-awaited reverse-chronological view. The company calls the two new modes “Following” and “Favorites,” and says they’re designed to “give you more choice and control over what you see” while using the app (that is, let you avoid things like suggested posts and <a href=\"https://www.theverge.com/2016/6/3/11853026/instagram-algorithm-feed-global\">algorithmic sorting</a> based on <a href=\"https://www.theverge.com/2018/6/1/17418254/instagram-algorithm-how-it-works-posts-downrank\">who and what the app thinks you like</a>).</p><p id=\"aHtjc8\">Instagram’s description for the “Following” feed is truly something to behold: “See the latest posts from accounts that you follow, in the order they were posted.” And to that, I say <em>yes. </em>That’s exactly what I want every social network to be!</p><div class=\"c-float-right\"><aside id=\"LpTfPM\"><q>Instagram says it’ll go on to make the main feed even less linear</q></aside></div><p id=\"bVluU7\">Instagram also details the Favorites mode in its announcement — basically, you’ll be able to star up to 50 accounts, and posts from them will show up higher in your main feed. You’ll also be able to view those posts in a separate “Favorites” feed, which Instagram says starts with the most recent posts. </p><p id=\"b7CTcm\">Instagram spokesperson Seine Kim told <em>The Verge</em> in an email that “your Favorites list is private to you and will not be visible to anyone else,” which will hopefully keep it from becoming a social battleground like <a href=\"https://www.reddit.com/r/nostalgia/comments/7zj62y/remember_ranking_your_myspace_top_8_friends/\">Myspace’s top eight feature</a>.</p><aside id=\"cRcbEr\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Myspace Tom got it right\",\"url\":\"https://www.theverge.com/2021/4/29/22407403/myspace-tom-legacy-tech-execs-zuckerberg-dorsey\"}]}'></div></aside><p id=\"hzyv2q\">Of course, everything has a price. In the press release announcing the change, Instagram head Adam Mosseri writes: “Over time, we’re going to add more recommendations to your feed based on your interests.” To me, that sounds like the main, default feed is going to start having more and more content from people I’m not following (which is exactly the complaint that a lot of people have had with the current version of the feed). </p><p id=\"Gu9SRb\">As long as the Following feed stays in place, though, that should be bearable. If I have to do a few more taps to get to what I want, it is what it is — just as long as that lovely chronological feed doesn’t go away (though if it does we might see the <a href=\"https://www.theverge.com/2022/3/14/22977782/twitter-default-home-algorithmic-timeline-feed-reverse-chronological\">same outcry</a> that happened when Twitter made its chronological feed harder to access).</p><p id=\"I53png\">These modes have been in the works for a while: Adam Mosseri <a href=\"https://www.theverge.com/2021/12/8/22824609/instagram-chronological-feed-adam-mosseri\">talked about it</a> a <a href=\"https://www.theverge.com/2021/12/10/22828773/instagram-chronological-feed-details-mosseri-two-versions\">few times last year</a>, and some users have <a href=\"https://www.theverge.com/2022/1/5/22868889/new-instagram-chronological-feed-algorithm-tests\">gotten to test it</a>. Instagram even <a href=\"https://twitter.com/instagram/status/1506311059958759429?s=20&amp;t=wDL-RMMm0R-tZ9x88aZeww\">teased that it was coming on Twitter</a> yesterday. Now, though, it should finally be on its way to everyone. To get to either of the alternative feeds, tap on the Instagram logo in the top left corner when you're in the home tab, and bask in the chronological bliss.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/feLYfWRTOkgNPuTn4YBVczPlEEk=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23338176/p.png",
  "description": "The chronological feed returns to Instagram.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}