{
  "title": "Instacart says it’s adding a fuel surcharge to help drivers paying high gas prices",
  "url": "https://www.theverge.com/2022/3/18/22985380/instacart-fuel-surcharge-gas-prices-delivery-rideshare-lyft-uber",
  "date": "2022-03-18T20:57:49.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Instacart\" src=\"https://cdn.vox-cdn.com/thumbor/kztOV3jHKXfeKjAzbN5FSDLGhjA=/0x2:5194x3465/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70643379/1147794851.0.jpg\" />        <figcaption>Instacart is adding a fuel surcharge to defray the high price of gasoline | Photo by Smith Collection/Gado/Getty Images</figcaption>    </figure>  <p id=\"fNwoXw\">Grocery delivery platform Instacart <a href=\"https://www.instacart.com/company/shopper-community/supporting-shoppers-with-fuel-assistance/\">announced Friday</a> that it was joining the list of companies adding a temporary fuel surcharge to customers’ orders, intended to help offset higher-than-normal gas prices its driver-shoppers are paying. </p><p id=\"sAVT8z\">In a blog post on its website, the company said it would implement the $.40 per order charge “over the next month,” but not when it takes effect. The post states that “every cent of the new, temporary fuel surcharge will be passed directly onto the shopper” and that it will launch “in the coming days.” Company spokesperson Charlotte Healow said in an email to <em>The Verge</em> that the policy would be in effect for one month after implementation. Asked if the charge would apply to electric or hybrid vehicles as well, Healow said the shopper’s vehicle was not a factor.</p><aside id=\"6YCR5J\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"EVs won’t save us from high gas prices\",\"url\":\"https://www.theverge.com/2022/3/11/22973174/gas-prices-electric-vehicles-inventory-russia\"}]}'></div></aside><p id=\"Sj5xI3\">“While shoppers on our platform tend to spend more time shopping and less time driving, we know that there is still an acute need to address rising gas prices and make sure we’re supporting shoppers during this time,” Tom Maguire, Instacart vice president of operations and care, said in the blog post.</p><p id=\"VHorjh\">Rival food delivery company <a href=\"https://doordash.news/dasher/announcing-gas-rewards-program-for-dashers-to-offset-rising-costs-at-the-pump/\">DoorDash launched a rewards program</a> for drivers earlier this week, which will give drivers 10 percent back on gas purchases when they use its Dasher Direct prepaid debit card. It will also add cash bonuses for drivers who travel 100 miles or more per week making DoorDash deliveries. Both programs will stay in effect at least through April, DoorDash said in a blog post. </p><p id=\"nBqvGa\">And rideshare companies Lyft and Uber have both announced temporary fuel surcharges as well, which both say will go directly to drivers. <a href=\"https://www.theverge.com/2022/3/11/22973474/uber-temporary-fuel-surcharge-fee-ev\">Uber’s surcharge</a> — in effect for 60 days as of March 11th—  applies to its rideshare and Uber Eats food delivery platform. Uber passengers will pay either $0.40 or $0.55 per trip; Uber Eats customers will pay either $0.35 or $0.45 per order, depending on the customer’s location. <a href=\"https://www.theverge.com/2022/3/14/22977744/lyft-temporary-fuel-surcharge-fares-uber\">Lyft’s surcharge</a> will go into effect sometime next week and stay in place for 60 days. It will add $0.55 per ride. Both companies said the surcharges would also apply even for its drivers who use electric vehicles. And both said the surcharges won’t apply to drivers in New York City, citing the 5.3 percent pay increase for drivers that <a href=\"https://9to5mac.com/2022/02/15/uber-and-lyft-pay-rise-nyc/\">took effect March 1st.</a></p><p id=\"zVkHHO\">The price of gas has <a href=\"https://gasprices.aaa.com/declining-oil-price-pushes-pump-prices-down/\">decreased slightly</a> over the past week, according to the American Automobile Association (AAA), after hitting $4 per gallon and higher across the US earlier this month. </p><p id=\"EVZmcf\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XQKnJUa5OqLaHxv1d3JLr21gBNk=/0x374:5194x3093/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23327903/1147794851.jpg",
  "description": "The fuel surcharge will take effect \"in the coming days.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}