{
  "title": "Instagram will let you reply to DMs directly from your feed",
  "url": "https://www.theverge.com/2022/3/31/23004407/instagram-dms-update-reply-feed-song-previews-messenger-integration",
  "date": "2022-03-31T16:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gkoUZv6VEdk7VhWmb4x_IohtqhA=/0x0:1200x800/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70694319/15._Q1_Bundle___1_A__1200x675_.0.jpg\" />        <figcaption><em>From left to right: reply from feed, the new reshare menu, and online indicators.</em> | Image: Meta</figcaption>    </figure>  <p id=\"rOhT6g\">Instagram is giving users a host of new options when sending direct messages (or DMs to you and I) on its platform. The most useful is a new option to quickly reply to a DM directly from your feed without having to go into your inbox and lose your place. There are also new share options as well as the ability to send song previews and conduct polls in group chats.</p><p id=\"doPv6m\">The platform’s head, Adam Mosseri, announced Instagram’s intention to focus on messaging this year in a <a href=\"https://www.instagram.com/reel/CYCWNztgL6v/?utm_source=ig_web_copy_link\">video posted at the end of December</a>. “Messaging is one of the primary ways that people — actually it is <em>the</em> primary way people connect online at this point,” Mosseri said. “Instagram needs to embrace the fact that messaging is that primary form of communication.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IRBaRA9uIcMWYnSaDrXuD1ZLeYM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23357279/15._Q1_Bundle___1_B__1200x675_.jpg\">      <cite>Image: Meta</cite>      <figcaption><em>From left to right: the @silent command, polls, and song previews.</em></figcaption>  </figure><p id=\"FzHxkL\">The song previews feature will offer short 30-second clips of tracks and is offered thanks to integrations with Apple and Amazon’s music streaming services, with support for Spotify coming soon. There’s also a new menu accessible from the main Instagram feed with a long-press of the share button that’ll let you quickly reshare a post to four of your closest friends.</p><p id=\"lR7HR2\">Other features bring Instagram’s DMs in line with what’s already offered in Facebook Messenger, which shouldn’t come as too much of a surprise given the company’s work to <a href=\"https://www.theverge.com/2021/9/30/22702367/facebook-instagram-messenger-cross-app-group-chats\">make these two chat platforms</a> cross-compatible. Instagram is adding a similar row of profile pictures at the top of its inbox to show which of your contacts are currently online, and it’s also inheriting Messenger’s polls feature. As <a href=\"https://messengernews.fb.com/2022/03/29/everyone-introducing-shortcuts-on-messenger/\">previously announced</a>, Messenger’s new shortcut for quietly sending messages without generating notifications for your contacts is also coming to Instagram in the form of a new @silent command.</p><p id=\"4n0PWb\">Instagram says most of these features are now available globally, and that its music sharing is rolling out from today. However, Instagram spokesperson Christine Pai says that in Europe the platform is not able to offer features like @silent, polls, or show who’s active at the top of your inbox, due to <a href=\"https://about.fb.com/news/2020/12/changes-to-facebook-messaging-services-in-europe/\">laws in the region</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KaP5WNv2tmuaEMBmzZulc5DChjk=/0x86:1200x714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23357276/15._Q1_Bundle___1_A__1200x675_.jpg",
  "description": "And one or two features inherited from FB Messenger.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}