{
  "title": "Instagram is reportedly removing shorter daily time limit options from its app",
  "url": "https://www.theverge.com/2022/2/21/22944603/instagram-daily-time-limit-options-removed-30-minutes",
  "date": "2022-02-21T20:15:46.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Y2OZYbaEFno3alr4GuBL7-h441w=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70534442/acastro_190919_1777_instagram_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"sgShmd\">Instagram is discontinuing some app time limit options and encouraging users to update their settings, according to a report from <a href=\"https://techcrunch.com/2022/02/21/instagram-limits-daily-time-limits/\"><em>TechCrunch</em></a>. Originally, users were able to select a time limit <a href=\"https://www.theverge.com/2018/11/14/18095734/instagram-your-activity-dashboard-time-spent\">as low as five minutes a day</a>, while the new options begin at 30 minutes and go up to three hours.</p><p id=\"OOY9aY\">In screenshots sent to <em>TechCrunch</em> by an Instagram user who had previously set a 10-minute daily limit, a popup now appears at the top of their feed urging them to set a new daily limit value in accordance with an app update. Though the popup says the user can keep their existing limit if they want, clicking the edit button directs them to select a preset option, the lowest of which is 30 minutes. An additional popup on the activity page in the app says the 10-minute value is “no longer supported.” The app had sent reminders to change the setting for a couple of weeks, the user says, and they were only able to avoid picking a new limit by force quitting the app.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PSJ9q0pl340qmcA-KFA8OXldt8g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23261299/IMG_8209.jpg\">      <figcaption>A screenshot taken from the Instagram app showing the current options for daily time limits</figcaption>  </figure></div><p id=\"x5QEfB\">A test by a US-based reporter at <em>The Verge</em> found that the options currently available are 30 minutes, 45 minutes, one hour, two hours, and three hours. Meta, which owns Instagram, did not immediately respond to questions sent by <em>The Verge</em>.</p><p id=\"kyFeFO\">Instagram introduced the option to <a href=\"https://www.theverge.com/2018/8/1/17636944/facebook-instagram-dashboards-time-well-spent-reminders\">set daily time limits</a> in 2018, with company representatives saying they wanted time on the app to be time well-spent. Time limiting features were rolled out as a response to criticism tech companies received about the effect their products had on the well-being of users. </p><p id=\"huOYht\">“We want to empower people to make intentional decisions about how much time they spend, and how they want to engage with the app,” Ameet Ranadive, who lead a user wellbeing team at Instagram, told The Verge in 2018. The changes to daily time limit settings come just a few months after Instagram introduced the Take a Break feature, where users can opt into getting periodic reminders if they’ve been on the app continuously. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/V6qUMc-7fj4CD2_348LGlwI5Gbc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23261337/Screen_Shot_2022_02_21_at_2.52.54_PM.png\">      <figcaption>Instagram’s original daily time limit options from 2018</figcaption>  </figure><p id=\"T5Ayw4\">This commitment to empowering users seems at odds with the decision to remove shorter time limits from the app. In November, when the “Take a Break” feature was <a href=\"https://www.theverge.com/2021/11/10/22774827/instagram-take-a-break-feature-test-meta-facebook\">in testing</a>, Instagram head Adam Mosseri emphasized that “you know what’s best for you when it comes to how you use the app.” A slightly longer time limit might not be a dealbreaker for most people on Instagram. But it’s a change that signals Instagram may be more concerned that users aren’t spending enough time on the platform rather than making sure their time is being spent well. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AhEDh8cXLzPzD8FmGa8EbJmzzbs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19228500/acastro_190919_1777_instagram_0001.0.jpg",
  "description": "Previously, time limits could be as low as five minutes",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}