{
  "title": "Intel buys Tower Semiconductor for $5.4 billion so it can make more chips for other companies",
  "url": "https://www.theverge.com/2022/2/15/22934628/intel-tower-semiconductor-acquisition-chips-third-party-foundry",
  "date": "2022-02-15T14:20:45.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-B-CyBITKeQ-fxcRtbfQLJIHyGs=/161x0:1079x612/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70511012/Screen_Shot_2022_02_15_at_8.59.52_AM.0.png\" />    </figure>  <p id=\"SHZD3Z\">Intel has announced that <a href=\"https://www.intel.com/content/www/us/en/newsroom/news/feb-2022-corporate-news.html#gs.p69lll\">it’s buying Tower Semiconductor</a>, an Israeli chipmaking company that focuses on specialty products like radio frequency (RF) chips, CMOS image sensors, and power management parts, for $5.4 billion. </p><p id=\"6HWG4N\">The deal is specifically intended to bolster the company’s fledgling Intel Foundry Service division, which Intel created last year to apply its chipmaking techniques and manufacturing facilities to build chips for other third-party companies. Once the deal closes, the goal is that Tower and IFS will be integrated together as a “fully integrated foundry business.” </p><p id=\"4zFJYf\">Intel has made no bones about its plans to rapidly ramp up production capabilities, with recent news of a $20 billion investment to expand its existing Arizona manufacturing facilities, along with a second $20 billion bet to <a href=\"https://www.theverge.com/2022/1/22/22895447/intel-ohio-chip-fab-manufacturing-cpu-processor-explained\">build an entirely new complex in Ohio</a> that it claims will be the “largest silicon manufacturing location on the planet.” </p><aside id=\"8P6nHB\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"What we know about Intel’s $20 billion bet on Ohio\",\"url\":\"https://www.theverge.com/2022/1/22/22895447/intel-ohio-chip-fab-manufacturing-cpu-processor-explained\"}]}'></div></aside><p id=\"eU8Mq8\">Intel Foundry Services was originally announced back in March 2021 as part of <a href=\"https://www.theverge.com/2021/3/23/22347250/intel-new-factories-arizona-20-billion-chips-outsourcing-foundry-services-manufacturing\">Intel’s IDM 2.0 strategy</a>, which was debuted by its newly installed CEO Pat Gelsinger as an attempt to right the ship at Intel and re-establish the company as a major force in the chipmaking world. IFS has already announced several major partnerships: it’ll start building chips for Qualcomm using Intel’s upcoming 20A process, while Amazon Web Services will be relying on Intel’s packaging technologies. </p><p id=\"rgI8WY\">The Tower Semiconductor deal will allow for Intel to further expand IFS’s offerings to new and more specialized products, which, in turn, will allow the eventually combined group to offer a more comprehensive chipmaking solution to companies down the line. The addition of Tower Semiconductor also will help expand Intel’s manufacturing network, with Tower’s collection of fabs (located in Israel, California, Texas, and Japan) and the more specialized products they offer joining Intel’s existing manufacturing sites.</p><p id=\"2a13Js\">“We are building Intel Foundry Services to be a customer-first technology innovator with the broadest range of IP, services and capacity,” commented Dr. Randhir Thakur, president of Intel Foundry Services, in the announcement. “Tower and IFS together will provide a broad portfolio of foundry solutions at global scale to enable our customers’ ambitions.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SKsLbCLByFrRayMSDpntdsdDLfw=/36x0:1205x612/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23243336/Screen_Shot_2022_02_15_at_8.59.52_AM.png",
  "description": "Intel has big foundry ambitions.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}