{
  "title": "Intel’s 12th Gen Alder Lake chips for thinner and lighter laptops have arrived",
  "url": "https://www.theverge.com/2022/2/23/22941383/intel-12th-gen-alder-chips-p-series-u-laptops-release-date",
  "date": "2022-02-23T16:00:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u9SC_WO7SWFlDxLRxyqvmnB_AP4=/313x0:3688x2250/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70540801/12thgen_chip_p_28w_pose_3_4000px.0.jpg\" />    </figure>  <p id=\"8qEI1d\">Intel launched the first wave of its 12th Gen Alder Lake chips at CES 2022 — but only for its <a href=\"https://www.theverge.com/2022/1/4/22855915/intel-12th-gen-alder-lake-chips-ces-2022-h-series-laptops-gaming-performance\">H-series lineup of chips</a>, destined for the most powerful and power-hungry laptops. And now, it’s rolling out the <em>rest</em> of its Alder Lake laptop lineup: the P-series and U-series models it briefly showed off in January, which are set to power the thinner, lighter, and cheaper laptops of 2022. </p><p id=\"hKjae2\">In total, there are a whopping 20 chips fit for a wide range of hardware across the P-series, U-series (15W), and U-series (9W) categories, with the first laptops powered by the new processors set to arrive in March. </p><div id=\"k976pW\"><div data-anthem-component=\"gallery:10960187\"></div></div><p id=\"ImMoEp\">Like their more powerful H-series cousins (and the Alder Lake desktop chips that Intel launched in late 2021 and at CES 2022), the new P-series and U-series chips have a lot more cores than <a href=\"https://www.theverge.com/2020/9/2/21408718/intel-11th-gen-tiger-lake-cpu-processor-announcement-laptops-fall\">2020’s 11th Gen models</a>, with a hybrid architecture approach that combines performance and efficiency cores to maximize both power and battery life. </p><p id=\"zk8KvL\">And Intel is promising some big improvements focused around those boosted core counts, touting up to 70 percent better multi-thread performance than previous 11th Gen (and AMD) hardware. The company also says that it wins out in benchmarks against chips like Apple’s M1 and M1 Pro (although not the M1 Max), and AMD’s Ryzen R7 5800U in tasks like web browsing and photo editing — although we’ll have to see how that performance holds up ourselves when the first chips arrive next month. </p><div class=\"c-float-right\"><aside id=\"NJBeCl\"><q>Intel’s chip revolution comes to more laptops</q></aside></div><p id=\"Qu7DS1\">Intel is rethinking how it labels its ultraportable line of chips this year, with the 28W models (previously under the U-series umbrella) getting broken out into its own P-series brand. The P-series chips, while drawing less power than their H-series counterparts, are similar in a lot of respects, including core count: the top-tier Core i7-1280P has the same 14-core (six performance, eight efficient) breakdown as the top i9 and i7 models on the H-series lineup, although with (obviously) lower clock speeds and overall performance. </p><p id=\"WuSXDt\">The U-series models, meanwhile, will feature fewer cores than the P-series, with all the U-series models only offering two performance cores, regardless of which chip your laptop has or how much wattage it uses. Total core count (between six and 10) will depend on how many efficient cores each model has. </p><aside id=\"BiHCzU\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Intel’s 12th Gen Alder Lake chips arrive at CES 2022 for its most powerful laptops ever\",\"url\":\"https://www.theverge.com/2022/1/4/22855915/intel-12th-gen-alder-lake-chips-ces-2022-h-series-laptops-gaming-performance\"}]}'></div></aside><p id=\"VRnHMn\">The new chips also feature Intel’s integrated Iris Xe graphics (while manufacturers can, in theory, add discrete GPUs, including Intel’s upcoming Arc graphics, it’ll be a rare addition on the new models). There’s support for a variety of modern laptop standards, including Wi-Fi 6E, Thunderbolt 4, and PCIe 4.0 (although, notably, not HDMI 2.1). </p><p id=\"AKQQBo\">In her review of the first Alder Lake laptop, <a href=\"https://www.theverge.com/22900362/msi-ge76-raider-review-alder-lake-17-inch-gaming-laptop\">the ultra-premium MSI GE76 Raider</a>, <em>The Verge</em>’s Monica Chin noted the H-series versions of the chips largely held up to Intel’s big performance claims, although she noted concerns over battery life — which will certainly be something to keep an eye on when the first P-series and U-series laptops debut in March. </p><p id=\"90NCJ0\">The new P-series and U-series chips will also be part of <a href=\"https://www.theverge.com/2022/1/4/22856046/intel-evo-laptop-standard-foldable-laptops-h-series-project-athena-ces-2022\">Intel’s third-generation Evo standard</a>, which adds new “intelligent collaboration” requirements that include at least a 1080p webcam and Wi-Fi 6E networking, along with the existing battery, fast charging, and other requirements.</p><aside id=\"992bFa\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Intel updates its Evo laptop standard for better video calls and foldable laptops\",\"url\":\"https://www.theverge.com/2022/1/4/22856046/intel-evo-laptop-standard-foldable-laptops-h-series-project-athena-ces-2022\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/llEfcoOi7VpnotYR-6wmJvkdGr4=/0x78:4000x2172/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23264149/12thgen_chip_p_28w_pose_3_4000px.jpg",
  "description": "More cores for more power",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}