{
  "title": "Intel’s first Arc GPUs are launching today for laptops",
  "url": "https://www.theverge.com/2022/3/30/23000576/intel-arc-gpu-a-series-laptop-gaming-release-date",
  "date": "2022-03-30T15:00:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vmtCeHU2rpYX0lG3yneHUyF0wqI=/0x200:1713x1342/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70689535/Untitled.10.jpg\" />    </figure>  <p id=\"9xDJE3\">Intel’s <a href=\"https://www.theverge.com/2021/8/16/22626912/intel-arc-gpu-brand-alchemist-codename-release-date\">discrete GPU revolution</a> is finally beginning after months of previews and teasers, with the company launching its first Arc A-series GPUs for laptops today. They bring support for DirectX 12, dedicated ray-tracing hardware, and — at least for the first batch of GPUs — only around twice the power of Intel’s integrated Xe graphics. </p><p id=\"zzIVaM\">Today’s launch is just a small taste of what Intel’s full picture for Arc will look like, though: to start, the company is only launching its least powerful Arc 3 series GPUs: the A350M, which has six Xe-cores and six ray-tracing units, and the A370M with eight Xe-cores and eight ray-tracing units. Given the 25W to 50W range for power, they’re meant for ultraportable devices that intend to offer more graphical firepower than integrated graphics alone, not dedicated gaming machines. Anyone looking for a true gaming laptop will have to wait for the Arc 5 and Arc 7 GPUs — which will offer significantly more graphics cores, ray-tracing units, memory, and power —  set to arrive later this year in “early summer.” </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Vsyqt80eNVpE29ttoIIhxsgDGHE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23353289/Screen_Shot_2022_03_29_at_1.58.45_PM.png\">  </figure><p id=\"el85BL\">Also not available at launch: <a href=\"https://www.theverge.com/2021/8/19/22631061/intel-arc-gpu-alchemist-xe-ss-super-sampling-ai-architecture-day-preview\">Intel’s XeSS</a> AI-powered super-sampling system for upscaling games to a higher resolution on the fly, which the company says <a href=\"https://www.theverge.com/e/22765842\">will also be available</a> in a similar “early summer” window. <em>Death Stranding: Directors Cut, </em>for example, launched today without the feature in tow, despite <a href=\"https://www.theverge.com/2022/1/4/22866918/death-stranding-directors-cut-pc-epic-games-store-steam-kojima-productions\">serving as one of Intel’s key demos</a> for XeSS back at CES 2022. </p><p id=\"GhqqNe\">Customers are also still waiting for desktop versions of Arc GPUs, too, which the company previously promised <a href=\"https://www.theverge.com/2022/2/17/22939025/intel-geforce-now-arc-gpu-q2-project-endgame-desktop-laptop\">would finally arrive in Q2 2022</a>, with workstation cards following sometime in Q3. There’s also “Project Endgame,” <a href=\"https://www.theverge.com/2022/2/17/22939025/intel-geforce-now-arc-gpu-q2-project-endgame-desktop-laptop\">a mysterious service</a> that will let customers access Arc GPUs “for an always-accessible, low-latency computing experience” sometime later this year. </p><p id=\"lmbfpN\">That all makes today’s Arc announcement feel a little more like a trial run than the grand debut of Intel’s next big platform.</p><div class=\"c-float-right\"><aside id=\"1A2Ihy\"><q>How good <em>are</em> Intel’s new GPUs?  </q></aside></div><p id=\"XnWr8a\">But that still leaves the biggest question: how good <em>are</em> Intel’s new GPUs? </p><p id=\"W4XpBq\">The answer, at least for now, is “better than Intel’s integrated Xe graphics,” which was the primary comparison that the company gave as part of its announcement. Unfortunately, Intel glaringly <em>didn’t</em> provide benchmarks on how any of its Arc GPUs, present or future, might compare to competing discrete Nvidia or AMD or against the integrated GPUs in Apple’s M1-series chips. </p><p id=\"KmF22c\">“We’re focused on delivering a good experience,” Roger Chandler, Intel VP and GM of client graphics products and solutions, tells <em>The Verge</em>, “and there’re going to be some benchmarks where we lose and some benchmarks where we win.” </p><div id=\"EbJlwH\"><div data-anthem-component=\"gallery:11119729\"></div></div><p id=\"E6fCOD\">Instead, Intel focused on the performance that its Arc GPUs will offer compared to its own Iris Xe integrated graphics (specifically, those found in its Core i7-1280P chip from earlier this year). The Arc 3 hardware, as you might expect, handily outdoes the integrated Iris graphics in both gaming and creative tasks, sometimes by nearly twice as much — something that’s certainly good to see. On the other hand, the Arc GPUs also draw nearly as much power as Intel’s CPUs do. </p><div class=\"c-float-right\"><aside id=\"xadiHY\"><q>Intel isn’t showing benchmarks against Nvidia or AMD yet</q></aside></div><p id=\"nFB7dr\">And it’s important to remember that this is just the first and least powerful version of Intel’s dedicated GPU hardware. And we’ll have to wait and see how well performance scales up to the more powerful laptop models (and the desktop versions), along with how Intel’s chips compare to AMD and Nvidia’s existing GPUs later this year.</p><p id=\"wnqbZz\">One thing that does seem certain, though, is that Intel’s best GPUs — at least this year — won’t be aiming to be the absolute best graphics you can get on a laptop. “We’re not going to be scaling it to, like, the absolute ultra performance, that type of thing,” says Chandler. “It’s really kind of that mainstream performance where you can a really solid gaming experience [and a] great creator experience.” Intel has made similar comments around its desktop hardware, too, noting that it won’t have a product to “address the ultra-enthusiast segment” until its third-gen “Celestial” GPUs. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/38cCMM-8w2P56TX2KTBlrSvbpTg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23353579/Screen_Shot_2022_03_29_at_3.54.46_PM.png\">  </figure><p id=\"B6BlgJ\">All the Arc GPUs will feature some innovative features beyond sheer power, though, that may help them stand out from competitors. Intel is including full AV1 hardware acceleration support (a first for the industry, according to the company), enabling faster video encoding in a variety of apps — one example shown was how AV1 encoding would make for smoother game streaming using XSplit. </p><p id=\"KvwLw2\">Another key part of all the Arc GPUs will be Intel’s Deep Link technology, which leverages the complete hardware stack of Intel processors and graphics cards to optimize power-sharing (based on whether the CPU or GPU needs more juice for a given task). Deep Link will also let the computer do things like harness both the integrated and discrete GPUs simultaneously for faster media encoding or machine learning-based image processing. It’s not a wholly unique approach, either: <a href=\"https://www.theverge.com/22865535/nvidia-3080-ti-3070-ti-mobile-laptop-max-q-intel-amd-alder-lake-rembrandt\">Nvidia’s latest 3080 Ti and 3070 Ti laptop GPUs</a> have a similar feature, too. </p><p id=\"KCLEoH\">There’s also a new Arc Control app, which will let customers handle game driver updates, tweak and monitor performance, stream gameplay, and more. It’ll also offer in-game overlays, so you’ll be able to keep an eye on your graphics performance while playing and won’t require that customers make an account to use. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mhk0pWUBlBHXZPD8fmXhDio5ylM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23353577/Screen_Shot_2022_03_29_at_3.53.54_PM.png\">  </figure><p id=\"wTgA5Y\">Intel is kicking off its Arc era today with the Samsung Galaxy Book2 Pro, the first laptop to offer Arc 3 GPUs as an option. The company promises a lot more designs will trickle out in the coming weeks and months, calling out partners like Acer, Asus, Dell, HP, Lenovo, MSI, and more, with Arc laptops set to start as low as $899. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yIzOvAFaFgalCl5lJePK53Y-l7Q=/0x323:1713x1220/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23355389/Untitled.jpg",
  "description": "More powerful Arc GPUs will arrive this summer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}