{
  "title": "Intel shows off its first Arc desktop GPU, coming summer 2022",
  "url": "https://www.theverge.com/2022/3/30/23003097/intel-arc-desktop-gpu-release-date-preview-summer-2022",
  "date": "2022-03-30T15:34:46.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/s7zq9CIhaUY_A6Kko5sMWCrmYp4=/189x0:2097x1272/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70689769/Screen_Shot_2022_03_30_at_11.02.53_AM.0.png\" />    </figure>  <p id=\"vEW95a\"><a href=\"https://www.theverge.com/2022/3/30/23000576/intel-arc-gpu-a-series-laptop-gaming-release-date\">Intel’s Arc GPUs</a> debuted today for laptops, but the company hasn’t forgotten its highly anticipated re-entry into the world of desktop graphics cards, either: the company showed off a first look at the final Arc hardware, along with a reveal that the first GPUs will arrive this summer as a “limited edition” release.</p><p id=\"52RFuK\">The company isn’t offering too many details on the desktop Arc cards beyond the quick glimpse of the hardware itself, although presumably, more details will arrive before the summer. The video does show that the Arc card has a dual-fan design, along with a single HDMI port and three DisplayPort ports on the side, although it’s not clear what the specifications for those ports are from appearance alone. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7SiFetWrsMSjKiINGqkj-2QWCoE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23355320/Screen_Shot_2022_03_30_at_11.02.14_AM.png\">  </figure><p id=\"pw7SlZ\">Intel is also calling the new Arc card a “limited edition.” However, it’s not clear whether that means the company will have a limited stock of cards when they launch this summer or if it’s an appellation for its in-house GPUs (similar to Nvidia’s Founder’s Edition branding). </p><p id=\"MaBPEi\">The desktop Arc GPUs won’t be the only Arc products arriving this summer: Intel’s more powerful Arc 5 and Arc 7 laptop GPUs, as well as its <a href=\"https://www.theverge.com/2022/3/30/23001801/intel-xess-ai-upscaling-arc-gpu-release-date\">XeSS AI-based super-sampling</a>, are also set to arrive in “early summer,” too. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/spSyTwlFAl1we2MJWobUsyYGnGI=/0x38:2286x1235/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23355327/Screen_Shot_2022_03_30_at_11.02.53_AM.png",
  "description": "A first look at the final Arc GPU hardware",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}