{
  "title": "Intel details staggered release schedule for long-anticipated Arc GPUs",
  "url": "https://www.theverge.com/2022/5/10/23064887/intel-arc-gpus-release-roadmap-china-system-builder-oem",
  "date": "2022-05-10T09:02:12.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/bHZmW7QdR84XKaSqWyZe_wll9NY=/188x0:2096x1272/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70851171/Screen_Shot_2022_03_30_at_11.02.14_AM.0.png\" />        <figcaption><em>An Arc graphics card.</em> | Image: Intel</figcaption>    </figure>  <p id=\"hxBDSn\">Intel has provided more details on the release roadmap for its long-awaited discrete Arc GPUs <a href=\"https://community.intel.com/t5/Blogs/Products-and-Solutions/Gaming/Engineering-Arc-5-9-2022/post/1383055\">in a new blog post</a>. The company plans to use a staggered approach, which will prioritize system builders and OEMs in China when it comes to its desktop graphics cards. Meanwhile its <a href=\"https://www.theverge.com/2022/3/30/23000576/intel-arc-gpu-a-series-laptop-gaming-release-date\">laptop chips</a> are currently exclusive to Samsung laptops <a href=\"https://twitter.com/IntelSupport/status/1512264698842222604\">in South Korea</a>, but the hope is to expand to other manufacturers and markets soon. </p><p id=\"ishkiW\">Intel says it’s working with other laptop manufacturers like Lenovo, Acer, HP, and Asus to get their laptops released with its entry-level Arc 3 GPUs “ASAP.” Laptops with the more powerful Arc 5 and Arc 7 GPUs are planned for “early summer.” The company says it had hoped availability would be “broader” at this point, but blamed software development and supply chain issues for the delay. </p><div class=\"c-float-right\"><aside id=\"FP36bQ\"><q>Starting in China with its least powerful GPUs</q></aside></div><p id=\"IRlNWb\">On the desktop side of things, Intel is sticking to Q2 as its rough release window. It says its first desktop GPUs will be its entry-level A3, made available to Chinese system builders and OEMs initially (so it won’t be available as an off-the-shelf component to slot into a self-built machine) before expanding worldwide and to self-builders. “Later this summer,” Intel plans to release its more powerful Arc A5 and A7 desktop cards, again starting with professional system builders before expanding.</p><p id=\"wRcRwB\">It’s a much more nuanced roadmap than what the company <a href=\"https://twitter.com/IntelGraphics/status/1494335839685398540?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1494335839685398540%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F17%2F22939025%2Fintel-geforce-now-arc-gpu-q2-project-endgame-desktop-laptop\">announced back in February</a> when it simply said the GPUs would come to notebooks in Q1, desktops in Q2, and workstation machines in Q3. But Intel gives a couple of reasons for this staggered approach. First, by starting with systems builders, it can focus on making its GPUs work with a select number of other components, rather than whatever a home builder might throw at it. And second, the Chinese market apparently has “strong demand” for these kinds of entry-level GPUs, and it’s physically closer to the factories making the components for the boards at a time when transportation costs have skyrocketed. </p><p id=\"Gzw0r5\">Reasoning aside, the result is that home PC builders in the US and EU aren’t likely to be getting their hands on Intel’s new desktop graphics cards until at least the end of the summer. With Nvidia expected to release a new 4000 series of graphics cards later this year, that could mean Intel’s fledgling GPUs will face some stiff competition from a very established player at launch.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PE64F4cuD6f5ZC6oZsoGtmYbnu0=/0x38:2284x1234/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23355320/Screen_Shot_2022_03_30_at_11.02.14_AM.png",
  "description": "Prioritizing professional system builders and OEMs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}