{
  "title": "Intel looks on track to fix its core problems",
  "url": "https://www.theverge.com/2022/3/23/22992681/intel-ceo-pat-gelsinger-semiconductor-processor-strategy-idm-2-0-one-year",
  "date": "2022-03-23T15:00:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/57-InMJM28t6IdrZTCeVIdkns4k=/8x0:2632x1749/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70661581/tomwarren_corei9_12900K_1.0.jpg\" />        <figcaption>Photo by Tom Warren / The Verge</figcaption>    </figure>  <p id=\"mWprsX\">Intel is finally on the right track again.</p><p id=\"ewPWKR\">That’s the biggest takeaway of the first year of the company’s reboot, brought on by its new CEO Pat Gelsinger when he took over the reins in early 2021. Intel has a new vision for the future: its <a href=\"https://www.theverge.com/2021/3/23/22347250/intel-new-factories-arizona-20-billion-chips-outsourcing-foundry-services-manufacturing\">“IDM 2.0” approach</a>. Its introduction was exactly a year ago today. That makes today a great time to check in and see how the new Intel — which looks a lot like the old Intel — is shaping up. </p><p id=\"GT6cAM\">Intel’s past decade or so prior to its recent reinvention was a series of misplaced bets and product misses, culminating in a <a href=\"https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo\">disastrous summer in 2020</a> that saw nearly everything go wrong for the company: another delay for its next major manufacturing node, departures of top executives, and the loss of one of its most premium partners all struck within a few weeks of each other. </p><aside id=\"jkJINf\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The summer Intel fell behind\",\"url\":\"https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo\"}]}'></div></aside><p id=\"5bjvth\">Even Intel seemed to realize that something had to be done: former CEO Bob Swan was <a href=\"https://www.theverge.com/2021/1/13/22228702/intel-ceo-bob-swan-pat-gelsinger-technical-financial\">replaced by Gelsinger</a> — a veteran Intel chip designer who had helped develop some of the company’s earlier critical chip innovations. </p><p id=\"6ssJWU\">Intel spent years and resources on expensive and flashy new market bets, like <a href=\"https://www.theverge.com/2014/1/6/5282474/intel-at-ces-2014\">wearable devices in 2014</a>, <a href=\"https://www.theverge.com/2015/1/6/7505803/intel-realsense-technology-can-make-every-device-self-aware\">drones and robots in 2015</a>, <a href=\"https://www.theverge.com/2016/8/16/12503948/intel-project-allow-vr-headset-cordless-mixed-reality\">VR in 2016</a>, <a href=\"https://www.theverge.com/2017/8/9/16119000/intel-mobileye-self-driving-cars-level-4\">self-driving cars in 2017</a>, <a href=\"https://www.theverge.com/2018/2/5/16966530/intel-vaunt-smart-glasses-announced-ar-video\">smart glasses in 2018</a>, and <a href=\"https://www.theverge.com/2019/3/4/18250061/intel-qualcomm-m-2-5g-modules-computer-pc-laptop\">5G in 2019</a>. But those days are over. The way forward was going to be chips and, specifically, IDM 2.0. Intel would rethink how and for who it would make processors. And it’d emphasize its strength as one of the few full-stack integrated device manufacturers left in the world that designed, manufactured, and sold semiconductor products. </p><p id=\"3axPDi\">IDM 2.0 would consist of three aspects: beefing up Intel’s in-house manufacturing, expanding use of third-party foundries starting in 2023, and Intel Foundry Service — a new standalone business unit that would see Intel build chips for other fabless chipmakers like Qualcomm, something it had never really done before in its history. </p><div class=\"c-float-right\"><aside id=\"JPMitj\"><q>Intel’s 2021 finally feels like a company on time and on track</q></aside></div><p id=\"ghinNg\">Intel’s 2021 finally feels like a company on time and on track. The company was able to debut its Alder Lake chips (for both laptops and desktops) after years of delays, with its new hybrid architecture and <a href=\"https://www.theverge.com/22763042/intel-core-i9-12900k-review\">some of its most</a> <a href=\"https://www.theverge.com/22900362/msi-ge76-raider-review-alder-lake-17-inch-gaming-laptop\">powerful processors in years</a>. It set an extremely ambitious roadmap to try and retake silicon supremacy by 2025 with a return to the rapid cadence of technological advances that the company used to be known for, with its Alder Lake chips already starting that process off. And it announced plans for billions of dollars of investments to expand its semiconductor production: $20 billion in its existing facilities in Arizona, another $20 billion to build an entirely new site in Ohio, and €17 billion for another new fab in Germany.</p><p id=\"nBourX\">After spending 2020 on the brink of disaster, Intel seemed to spend the entirety of 2021 doing and saying all the right things. And 2022 — and Gelsinger’s second year as CEO — seems full of potential, too: <a href=\"https://www.theverge.com/2022/2/17/22939025/intel-geforce-now-arc-gpu-q2-project-endgame-desktop-laptop\">Intel’s Arc GPUs</a> are poised to launch in the coming months for laptops and desktops, launching the company into a new product category where it could (eventually) start to take on long-time gaming heavyweights like AMD or Nvidia. And the company is set to finally start production on its long-delayed 7nm node that was the cause of so much drama over the years (although it will come curiously branded as “Intel 4” to better position its products against competitors). </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lIWakE-ylqzCe_8uUPLBL9w9QxA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22741569/Screen_Shot_2021_07_26_at_4.45.01_PM.png\">      <cite>Image: Intel</cite>  </figure><p id=\"AgMFh3\">Other areas, like Intel’s use of third-party foundries from TSMC and Samsung, still have yet to really come to fruition. Intel’s upcoming Arc GPUs will be built by TSMC on its more advanced 6nm node, though, one of the highest-profile Intel products to be built by an external partner to date. And presumably, we’ll hear more on that front in the coming months as we get closer to that initial 2023 date. </p><p id=\"XMVc06\">Similarly, Intel Foundry Service is still ramping up business, and Intel has announced some big deals on the front, too: it’ll <a href=\"https://www.theverge.com/2021/7/26/22595002/intel-qualcomm-chips-foundry-services-amazon-aws-20a\">make Qualcomm chips</a> in the future on its upcoming next-generation 20A process (which is due to debut sometime in 2024 at the earliest), in addition to offering packaging solutions for Amazon’s AWS. </p><p id=\"mBHgYM\">All in all, it really does seem like Intel has managed to stop its downward spiral and could be surging upwards again. Its products are starting to come out on time, and its roadmap looks encouraging, with a rapid cadence of product releases the likes of which Intel hasn’t managed in over a decade. </p><div class=\"c-float-right\"><aside id=\"5p9ZJh\"><q>There’s still a lot of work to be done</q></aside></div><p id=\"jnpH5C\">But there’s still a lot of work to be done. Intel’s competition from AMD and Apple has never been stronger. AMD announced <a href=\"https://www.theverge.com/2022/2/17/22935783/amd-ryzen-6000-h-radeon-rx-processor-graphics-launch-asus-g14-benchmarks\">fresh laptop chips</a> at CES 2022 and is gearing up for its next generation of <a href=\"https://www.theverge.com/2022/1/4/22856151/amd-ryzen-7000-desktop-cpu-5nm-next-gen-zen-4-release-date-ces-2022\">Ryzen 7000 desktop chips</a> later this year, both of which aim to outdo Intel’s best at performance and power efficiency. And Apple’s excellent M1 chips have made the jump to even more <a href=\"https://www.theverge.com/22981815/apple-mac-studio-m1-ultra-max-review\">powerful desktop models</a> with the <a href=\"https://www.theverge.com/2022/3/8/22958174/apple-silicon-m1-ultra-chip-soc-processor-cpu-gpu-update\">M1 Ultra</a>. The Cupertino company is now one computer away from completing its transition away from Intel’s processors. </p><p id=\"VXuKWc\">There’s also Intel’s technological disadvantage. As of today, Intel does not make the most advanced semiconductors in the world, having long since ceded that title to TSMC and Samsung. Its competitors use more advanced manufacturing techniques (like extreme ultraviolet lithography) that Intel has only just started to adopt and build chips with more transistors than Intel’s most advanced products. Intel’s renewed ambition to catch up is a good sign, and its impressive roadmap goalposts reflect that. But it is still playing catch up to competitors like TSMC, <a href=\"https://www.bloomberg.com/news/articles/2021-04-01/tsmc-to-invest-100-billion-over-three-years-to-grow-capacity\">whose plans for a <em>$100 billion </em>investment</a> in expanding production over the next three years far outstrips even Intel’s own ambitions. </p><p id=\"b2xdgY\">Plus, there’s the <a href=\"https://www.theverge.com/2021/10/21/22739192/intel-chip-shortage-q3-2021-earning-laptop-revenue\">ongoing semiconductor shortage</a> to contend with. Demand for chips still far outstrips supply, and Intel’s big plans to ramp up production and build all these new fabs will take time — the Arizona expansions won’t be up and running until 2024, the Ohio plant in late 2025, and the Germany fab in 2027. That means it’ll be years before we’ll be able to see if those billion-dollar bets really paid off or not. </p><p id=\"qVvgIx\">Looking at the next year of Intel’s latest lease on life is a far more encouraging prospect than it was a year ago. And while plenty of challenges still remain for the company — especially when it comes to actually hitting its roadmap goals — it finally feels like things are moving in the right direction again for Intel. </p><p id=\"uyC2L6\"></p><p id=\"xFXmGS\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wzn2OLURV--bBckJdm1_zutPej0=/0x184:2640x1566/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22957885/tomwarren_corei9_12900K_1.jpg",
  "description": "A look back at Intel’s encouraging year",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}