{
  "title": "Intuit owes you money if it tricked you into paying for TurboTax “Free Edition”",
  "url": "https://www.theverge.com/2022/5/4/23057463/intuit-141-million-agreement-new-york-attorney-general-turbotax-free",
  "date": "2022-05-04T22:20:31.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"Intuit Said In Talks To Buy Mailchimp For $10 Billion-Plus\" src=\"https://cdn.vox-cdn.com/thumbor/BMCllnRRhZuQ1rHS_iqWdMxnhys=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70833367/1235036842.0.jpg\" />        <figcaption><em>But will I have to claim that as income on my taxes?</em></figcaption>    </figure>  <p id=\"jtgA77\">Intuit, the company behind TurboTax, has agreed to pay out $141 million after it “cheated millions of low-income Americans out of free tax filing services,” in the words of New York Attorney General Letitia James. Most of that money will go to consumers that were tricked into paying for its service. This comes as the result of <a href=\"https://ag.ny.gov/press-release/2022/attorney-general-james-secures-141-million-millions-americans-deceived-turbotax\">an agreement it made with the AG</a> (and officials from all 50 states and DC), which will also require the company to change its marketing practices.</p><p id=\"QGAmsQ\">According to <a href=\"https://ag.ny.gov/press-release/2022/attorney-general-james-secures-141-million-millions-americans-deceived-turbotax\">the Attorney General’s press release</a>, Intuit will owe people $30 for every year they were tricked into paying for TurboTax between 2016 and 2018. The document notes that “impacted consumers will automatically receive notices and a check by mail.”</p><p id=\"B2h6ld\">TurboTax has long been maligned for being opaque and having deceptive marketing. For years there were two versions of its tax preparation software that had “free” in the name: TurboTax Free Edition, and TurboTax Free File. Intuit, according to the AG, heavily marketed the Free Edition as being, well, free (the press release points out that some ads used the word “dozens of times in as short as 30 seconds”). But around 4.4 million people ended up owing Intuit money when using it. </p><div class=\"c-float-right\"><aside id=\"QlRdm4\"><q>The company owes customers around $30 for each year it tricked them into paying for filing</q></aside></div><p id=\"LLKQSO\">What they should’ve used was the hard-to-find Free File version, which was part of the Internal Revenue Service’s Free File program. The program came from a partnership between the government and tax companies that <a href=\"https://en.wikipedia.org/wiki/Free_File_Alliance\">included Intuit</a>. It was supposed to make sure the majority of Americans would have access to a free version of tax preparation software like TurboTax. It also, as the press release notes, prevented the IRS from creating its own competing service. </p><p id=\"GIiQI3\"><a href=\"https://www.theverge.com/2021/7/17/22581587/turbotax-parent-company-intuit-opts-out-irs-free-file-program\">Intuit stopped participating in Free File in 2021</a> citing “limitations” and “conflicting demands from those outside the program.” This was after the IRS <a href=\"https://www.theverge.com/2020/1/1/21045779/irs-turbotax-free-file-h-r-block-tax-preparation-new-rules\">changed the rules of the program</a>, forbidding tax companies from hiding their actually free products from search engines (something <a href=\"https://www.theverge.com/2019/4/26/18518211/turbotax-free-tax-filing-hidden-google-search-results\">Intuit and H&amp;R Block reportedly did</a>). The rule change also allowed the IRS to make its own free filing system, but so far it hasn’t.</p><p id=\"0Fu7FC\">Intuit’s involvement with the program has <a href=\"https://www.theverge.com/2022/4/18/23027618/senator-warren-taxes-turbotax-intuit-lobbying-free-file\">drawn scrutiny from lawmakers like Sen. Elizabeth Warren</a> (D-MA). Last month, Warren sent a letter to the company, accusing it of “lobbying to protect its shady business practices.” The letter also said that TurboTax products “scam American taxpayers into paying for services that should be free.”</p><aside id=\"RIaSv9\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Sen. Warren pushes TurboTax for answers about its efforts to block free tax filing\",\"url\":\"https://www.theverge.com/2022/4/18/23027618/senator-warren-taxes-turbotax-intuit-lobbying-free-file\"}]}'></div></aside><p id=\"C84eBi\">Consumers won’t be receiving the full $141 million — the AG’s press release notes that “roughly $2.5 million will be used for administrative fund costs.” Aside from agreeing to fork over the money, Intuit has also said it will:</p><ul><li id=\"rEMgft\">Stop misrepresenting its online tax preparation products</li><li id=\"AHqHao\">Improve the disclosures in its ads and marketing for its free products</li><li id=\"eZ8P1a\">Make it clearer in TurboTax itself whether you’ll be eligible for free filing</li><li id=\"N2XogU\">Not make customers start over if they switch from a paid product to a free one</li></ul><p id=\"jkRhcU\">The points about advertising are especially interesting, because the Federal Trade Commission <a href=\"https://www.ftc.gov/news-events/news/press-releases/2022/03/ftc-sues-intuit-its-deceptive-turbotax-free-filing-campaign\">recently sued the company</a> over its usage of the word “free” in a bid to “put an immediate halt to Intuit’s false advertising.” The FTC’s complaint, which was filed in March, says that there’s a hearing scheduled for the matter in September.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n-qBQdlVJ279Uqn5MwxR50T6DoM=/0x0:4000x2094/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23438703/1235036842.jpg",
  "description": "The company is on the hook for $141 million.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}