{
  "title": "iOS 15.5 arrives ahead of Apple’s annual developer conference",
  "url": "https://www.theverge.com/2022/5/16/23070297/ios-15-5-update-apple-cash-podcasts-wwdc-2022",
  "date": "2022-05-16T17:41:27.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/cVSf-qVN2dJY7C2qD7j5GkDdqNQ=/0x0:1886x1257/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70875192/vpavic_210916_4760_0087.0.jpg\" />        <figcaption><em>Last year’s iPhone 13 Mini and iPhone 13.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"Fu64D3\">Apple has released iOS 15.5, the latest version of its iPhone operating system. It’s short on user-facing enhancements but could help appease regulators concerned with Apple’s dominant control over in-app purchases.</p><p id=\"WGA5i9\">New iOS 15.5 features include a pair of buttons added to the Wallet app, which allows Apple Cash card users to quickly request or send money, as well as a new setting in the Apple Podcasts app that lets you place limits on the number of episodes stored in your phone. According to Apple’s release notes, the update also includes various bug fixes, including one that should improve the reliability of home automations triggered by people arriving and leaving. </p><p id=\"l1F8Gy\">The full release notes read:</p><blockquote><p id=\"rmmYSe\">iOS 15.5 includes the following improvements and bug fixes:</p><p id=\"0QGRBA\">Wallet now enables Apple Cash customers to send and request money from their Apple Cash card</p><p id=\"RrSfmD\">Apple Podcasts includes a new setting to limit episodes stored on your iPhone and automatically delete older ones</p><p id=\"cUnPI8\">Fixes an issue where home automations, triggered by people arriving or leaving, may fail</p><p id=\"MECrb3\">Some features may not be available for all regions or on all Apple devices. For information on the security content of Apple software updates, please visit this website:</p><p id=\"FoFjmz\"><a href=\"https://support.apple.com/kb/HT201222\">https://support.apple.com/kb/HT201222</a></p></blockquote><p id=\"exJaQ1\">Alongside its latest iOS update, Apple has also released an update for macOS. Monterey 12.4 is notable for being the version of macOS that <a href=\"https://www.theverge.com/23044788/apple-studio-display-webcam-update-testing-comparison\">includes a fix</a> for <a href=\"https://www.theverge.com/22981744/apple-studio-display-5k-monitor-webcam-speakers-review\">Apple’s Studio Display monitor’s</a> poor webcam quality. In our tests with the beta update, we found that webcam performance is still far from perfect, but the update reduced the amount of visible noise in the image, improved contrast, and boosted color accuracy. We’ll naturally be re-testing the webcam now that its software is final to see if anything has changed.</p><p id=\"8S9f7A\">Although iOS 15.5 is short on user-facing changes, <a href=\"https://9to5mac.com/2022/04/06/ios-15-5-includes-support-for-apps-with-external-purchases-to-satisfy-regulators-code-confirms/\"><em>9to5Mac </em>previously reported</a> that it contains references to “external purchases,” suggesting the update lays the groundwork for select apps to be able to link out to external purchasing systems, in line with the <a href=\"https://www.theverge.com/2022/3/30/23003503/apple-reader-app-developer-external-link-guidelines-announced-entitlements\">changes Apple announced last month</a>. Apple generally requires developers to use its own in-app payments system for digital in-app purchases (often earning it a 30 percent commission), but this policy is facing increasing scrutiny from regulators around the world. In some countries, like <a href=\"https://www.theverge.com/2021/8/31/22643800/apple-google-south-korea-app-store-payment-legislation-passes\">South Korea</a> and <a href=\"https://www.theverge.com/2021/12/24/22852966/apple-netherlands-dating-apps-match-tinder-app-store-competition\">the Netherlands</a>, Apple has been ordered to allow various developers to link out to external payment systems. </p><p id=\"iWP6St\">The release of iOS 15.5 comes less than a month before Apple is expected to announce its forthcoming iOS 16 update at its <a href=\"https://www.theverge.com/2022/4/5/22984508/apple-wwdc-2022-event-date-software-updates-ios-ipados-macos\">annual developer conference</a>. Instructions on how to update your iPhone can be <a href=\"https://support.apple.com/en-gb/HT204204\">found on Apple’s site</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bOmpMuXB-anDHplqsUbDquRdCa8=/0x136:1886x1123/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863271/vpavic_210916_4760_0087.jpg",
  "description": "With features for Wallet and Podcasts",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}