{
  "title": "iOS 15.4 makes Shortcut automations way less annoying to use",
  "url": "https://www.theverge.com/2022/2/7/22921682/ios-15-4-beta-shortcut-automations-annoying-notifications-disable",
  "date": "2022-02-07T15:51:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6cjCnkHVtqBJ8yE8RVJDbjq-FLQ=/128x0:1073x630/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70479683/1200x630wa.0.png\" />    </figure>  <p id=\"VHj0Nk\">Apple’s <a href=\"https://www.theverge.com/22906798/ios-iphone-15-4-face-id-mask-test-beta\">upcoming iOS 15.4 software update</a> appears to have quietly added a massive quality of life change for its Shortcuts app: the ability to disable the incredibly annoying notifications for personal automations that users have set up on their devices, as spotted by Fjorden developer Florian Bürger on Twitter. </p><p id=\"yXV0Ad\">For those who don’t use Shortcuts regularly, the automations feature is one of the most useful and powerful tools that Apple gives its users access to. At its heart, it lets users set up basic “if / then” triggers for a variety of conditions on an iPhone, be it a specific time of day, arriving at a location, getting an email or text from a specific contact, joining a Wi-Fi network, tapping an NFC tag, opening an app, or when your phone hits a certain level of battery life. </p><div id=\"DVHtHb\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">iOS 15.4 Beta allows you to remove the notification (&amp; delay) when running personal automations via Shortcuts…<br><br>This means, opening Fjorden (or any other camera app) from the lock screen is now super quick and almost seamless   <a href=\"https://t.co/Ez2JGeVo6l\">pic.twitter.com/Ez2JGeVo6l</a></p>— Florian Bürger (@FlorianBuerger) <a href=\"https://twitter.com/FlorianBuerger/status/1490623051549061122?ref_src=twsrc%5Etfw\">February 7, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"GtZrz2\">Used properly, Shortcuts is incredibly useful, allowing things like disabling notifications when your Kindle app is open so you can read in peace, automatically turning on low power mode when your phone’s battery dips below 50 percent, or disabling rotation lock when you open the Apple TV app so your shows enter full-screen mode properly. </p><p id=\"GzbZBu\">But up until iOS 15.4, Apple had previously rendered the feature virtually unusable for common tasks by instituting mandatory notifications every single time the conditions were triggered. The new update fixes that, though, by adding a toggle that allows users to disable those notifications makes Apple’s Shortcut automations vastly more usable for day-to-day tasks by allowing you to remove <a href=\"https://www.theverge.com/2021/5/9/22424463/apple-shortcuts-notifications-toggle-user-settings\">the spammy notifications that used to appear</a> every time you triggered one. </p><p id=\"8VUcJE\">To disable the notifications, simply tap on the automation and switch off the new “notify when run” toggle that’ll appear if you’re running the latest iOS 15.4 beta. You’ll have to do it for each notification, but once you’ve set it up right, you’ll never be bothered by the Shortcuts notification bar for your automations again.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dtevLpOun4HU6P7QTGf5QB07DhE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23223517/Untitled.png\">      <figcaption><em>The new “notify when run” toggle to disable automation notifications in Shortcuts</em></figcaption>  </figure><p id=\"CuFjAc\">There are a few caveats here, though: the new setting is <em>only</em> for Shortcuts automations, not all Shortcuts. That means that if you’re using Shortcuts as a workaround for custom iOS icons, there’s still no way to remove the pop-up banner when you open an app with that method, for example. </p><p id=\"TugRCx\"><a href=\"https://www.theverge.com/22906798/ios-iphone-15-4-face-id-mask-test-beta\">iOS 15.4</a> also adds the option to <a href=\"https://www.theverge.com/2022/2/2/22912677/apple-face-id-mask-update-ios-15-4-beta-hands-on-impressions\">use Face ID on newer iPhones</a> while wearing a mask and a <a href=\"https://www.theverge.com/2022/1/27/22904966/emoji-14-ios-15-4-biting-lip-bubbles-unicode\">slew of new emoji</a>. The update is still currently in public beta but should see a broad release in the coming weeks — hopefully with these exciting new features still available. </p><aside id=\"W3C7Fb\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to install the iOS 15.4 public beta\",\"url\":\"https://www.theverge.com/22906798/ios-iphone-15-4-face-id-mask-test-beta\"},{\"title\":\"Apple’s Face ID with a Mask works so well, it might end password purgatory\",\"url\":\"https://www.theverge.com/2022/2/2/22912677/apple-face-id-mask-update-ios-15-4-beta-hands-on-impressions\"},{\"title\":\"The biting lip emoji coming in iOS 15.4 will instantly make conversations awkward\",\"url\":\"https://www.theverge.com/2022/1/27/22904966/emoji-14-ios-15-4-biting-lip-bubbles-unicode\"}]}'></div></aside><p id=\"nbDC0b\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/cqaTEScLAP7SKPMavI12tlU2MKY=/0x1:1200x629/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23223522/1200x630wa.png",
  "description": "A huge change for iOS power users",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}