{
  "title": "iOS 15.4 now live as Universal Control comes to iPads and Macs",
  "url": "https://www.theverge.com/2022/3/14/22976606/ios-15-4-mask-compatible-face-id-emoji-tap-to-pay-airtags-stalking-update-release-date-features",
  "date": "2022-03-14T17:15:17.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"The iPhone 13 Mini and iPhone 13\" src=\"https://cdn.vox-cdn.com/thumbor/o2MOD8Q2Ol4tTnY3eYqGEbn0h0M=/0x0:2002x1335/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70621002/vpavic_210916_4760_0240.0.jpg\" />        <figcaption><em>The iPhone 13 Mini and iPhone 13.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"AGoOHF\">iOS 15.4, the latest version of Apple’s iPhone operating system, has been released and should soon be available to download ahead of the Friday release of Apple’s new <a href=\"https://www.theverge.com/2022/3/8/22959072/iphone-se-3-price-screen-specs-features-release-date-a15-bionic-5g\">third-generation iPhone SE</a> and <a href=\"https://www.theverge.com/2022/3/8/22959215/apple-iphone-13-mini-new-colors-green-alpine-price-release-date\">green iPhone 13</a>. The update includes big new features like the ability to <a href=\"https://www.theverge.com/2022/2/2/22912677/apple-face-id-mask-update-ios-15-4-beta-hands-on-impressions\">use Face ID while wearing a mask</a>, alongside smaller additions like a <a href=\"https://www.theverge.com/2022/1/27/22904966/emoji-14-ios-15-4-biting-lip-bubbles-unicode\">handful of new emoji</a>. The new version of iOS launches alongside iPadOS 15.4 and macOS 12.3, which add support for Apple’s new <a href=\"https://www.theverge.com/2021/6/7/22523322/apple-wwdc-impressive-drag-and-drop-universal-control-demo\">Universal Control feature</a>. </p><p id=\"grw60O\">Universal Control allows you to use a Mac’s keyboard and mouse to control an iPad completely wirelessly, including the ability to drag and drop files from the tablet back to a computer. Universal Control requires your Mac to be running macOS Monterey 12.3, which was also released Monday, and iPad to be running iPadOS 15.4. </p><div class=\"c-float-right\"><aside id=\"LwIYDi\"><q>New anti-stalking measures are coming for AirTags</q></aside></div><p id=\"nDJIMr\">We already have a pretty good idea of how Apple’s new mask-friendly Face ID implementation should work after trying it out in beta. You can read our <a href=\"https://www.theverge.com/2022/2/2/22912677/apple-face-id-mask-update-ios-15-4-beta-hands-on-impressions\">full thoughts here</a>. In short, it does a decent job of recognizing faces even when the nose and mouth are covered with a mask but can still get tripped up by glasses, sunglasses, and floppy hats. Apple does warn that turning the new feature on could make Face ID less accurate overall. </p><p id=\"zBXBQS\">Other features include new <a href=\"https://www.theverge.com/2022/2/23/22947063/airtags-anti-stalking-ios-15-4-beta-4-privacy-notice\">anti-stalking features for Apple’s AirTag</a> trackers as well as a <a href=\"https://www.theverge.com/2022/2/23/22947150/ios-15-4-quinn-siri-voice-5-american\">new, more gender-neutral Siri voice</a>. There’s also support for a new Tap to Pay feature that lets <a href=\"https://www.theverge.com/2022/2/8/22923463/apple-iphone-tap-to-pay-contactless-shopify-nfc\">iPhones accept contactless payments</a>, though third-party providers <a href=\"https://stripe.com/gb/terminal/tap-to-pay-on-iphone\">like Stripe</a> will have to add support to make it useful. </p><p id=\"pcW7rm\">iOS 15.4 will be available for all iOS 15-compatible devices, which means anything from the iPhone 6S up is covered. iPadOS 15.4, meanwhile, is available for all iPad Pro models, the iPad Air second generation and up, the iPad mini fourth generation and up, and everything from the fifth generation of base iPad and later. </p><p id=\"qTkDSc\">Finally, macOS Monterey 12.3 is supported on the following: iMac (late 2015 and newer), iMac Pro (2017 and newer), Mac Pro (late 2013 and newer), Mac Mini (late 2014 and newer), MacBook Pro (early 2015 and newer), MacBook Air (early 2015 and newer), MacBook (early 2016 and newer).</p><p id=\"nkgXLO\">You can check for the update on your iPhone or iPad by going to Settings &gt; General &gt; Software Update. On Mac, you can go to System Preferences &gt; Software Update. </p><p id=\"mF3Nwo\"><em><strong>Update March 14th, 1:15PM ET: </strong></em><em>Added information about macOS 12.3, which has also been released.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/27VKu8-Ksg-_56gYnQl0K3SqZhI=/0x144:2002x1192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863273/vpavic_210916_4760_0240.jpg",
  "description": "iOS 15.4 is coming to the iPhone 6S and up.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}