{
  "title": "Ireland fines Meta for bad record-keeping ",
  "url": "https://www.theverge.com/2022/3/16/22979540/meta-facebook-gdpr-privacy-data-ireland-data-protection-commission",
  "date": "2022-03-16T18:52:58.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1YdhvSCYOJItzcRZqMlD4WJbpm4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70631639/acastro_211101_1777_meta_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Ng7gp5\">In 2018, <a href=\"https://www.dataprotection.ie/en/news-media/press-releases/data-protection-commission-announces-decision-meta-facebook-inquiry\">Ireland’s Data Protection Commission</a> (DPC) was alarmed when Facebook notified the commission, between June and December, of 12 separate data breaches that affected up to 30 million users, <a href=\"https://techcrunch.com/2022/03/15/facebook-2018-breaches-dpc-decision/\"><em>TechCrunch </em>reports</a>. The DPC began to investigate and now Meta, Facebook’s parent company, has been fined 17 million euros ($18.6 million USD). </p><p id=\"ZlriXU\">The DPC concluded from its investigation into the breaches that Meta violated Europe’s <a href=\"https://www.theverge.com/2018/3/28/17172548/gdpr-compliance-requirements-privacy-notice\">General Data Protection Regulation</a> (GDPR). According to its press release, the DPC identified 12 data breach notifications that occurred between June and December 2018. “As a result of its inquiry, the DPC found that Meta Platforms failed to have in place appropriate technical and organisational measures which would enable it to readily demonstrate the security measures that it implemented <em>in practice</em> to protect EU users’ data,” the DPC said in its press release. </p><p id=\"V1BmWS\">In a statement to <em>TechCrunch</em>, a Meta spokesperson objected to any characterization of this fine being related to the breaches themselves: </p><blockquote><p id=\"rK67fB\">This fine is about record keeping practices from 2018 that we have since updated, not a failure to protect people’s information. We take our obligations under the GDPR seriously, and will carefully consider this decision as our processes continue to evolve.</p></blockquote><p id=\"uRVWxB\">Ireland’s initial draft decision was objected by two authorities, <a href=\"https://techcrunch.com/2022/03/15/facebook-2018-breaches-dpc-decision/\"><em>TechCrunch</em> reported</a>. However, it did not disclose who those authorities were and whether their objections actually affected the DPC’s ultimate decision.</p><p id=\"H9tE0E\">Meta is quick to point out this is related to record-keeping practices, but that’s not a minor problem. In fact, adequate record-keeping kind of feels like a consistent problem for the company. Last year, Facebook was at the center of a <a href=\"https://www.theverge.com/2021/4/7/22372707/facebook-responds-533-million-data-leak-notify-users\">data leak that affected 533 million accounts</a> that affected users from 106 countries. Sometime after that, Facebook noted that those affected wouldn’t be notified, saying they weren’t confident about which users to notify and not much could be done about their data being online. </p><aside id=\"3u9b6k\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Everything you need to know about GDPR\",\"url\":\"https://www.theverge.com/2018/3/28/17172548/gdpr-compliance-requirements-privacy-notice\"}]}'></div></aside><p id=\"BKOstg\">Last month, Meta <a href=\"https://www.theverge.com/2022/2/15/22935147/meta-facebook-privacy-like-tracking-data-settlement\">paid a settlement</a> of $90 million with a lawsuit filed in 2012 that accused Facebook of tracking the data of its users even after they’ve logged out of their accounts. The settlement also required Meta to delete all of the data wrongfully collected during that time. Last year, Meta’s messaging service WhatsApp <a href=\"https://www.theverge.com/2021/9/2/22653747/whatsapp-fine-amount-europe-gdpr-privacy\">was fined $267 million by the DPC</a> for mishandling the personal data of its users. But the service’s privacy policy was targeted by lawmakers for its lack of transparency with gathering consent from users to share data.   </p><p id=\"gYp7jd\">A company found to not comply with GDPR rules is subject to a fine of up to 4 percent of its annual revenue. Meta’s fine is substantially less than the maximum amount.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_wZV6QhjvS43T94AxGKXf0cp5i4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22977156/acastro_211101_1777_meta_0002.jpg",
  "description": "The decision was announced by the IDPC on Tuesday",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}