{
  "title": "iRobot adds new features to its robot vacs, including Siri support",
  "url": "https://www.theverge.com/2022/3/17/22982578/irobot-software-update-roomba-robot-vacuums",
  "date": "2022-03-17T11:00:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uKH7jR5IfQP3Ew7n5mym-9eAIJ4=/0x0:5120x3413/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70634609/Roomba_Siri_Integration.0.jpg\" />        <figcaption><em>A software update for iRobot’s line of vacuuming and mopping robots is coming this spring.</em> | Image: iRobot</figcaption>    </figure>  <p id=\"AepwlZ\">Roomba robot vacuums have worked with Google Assistant and Amazon Alexa voice commands for a while, and now Apple’s Siri is getting in on the party. Today, iRobot announced native Siri Shortcut integration for its line of vacuums and mops, joining <a href=\"https://www.theverge.com/22901270/roborock-s7-plus-robot-vacuum-and-mop-review\">Roborock</a> as one of only a handful of smart vacuum manufacturers to work with Apple’s voice assistant. </p><p id=\"dkSISl\">The update is part of iRobot’s version 4.0 of its iRobot Genius Home Intelligence software, which was <a href=\"https://www.theverge.com/2020/8/25/21377585/irobot-ai-software-update-home-intelligence-genius-app\">described by CEO Colin Angle</a> at its launch in 2020 as “a lobotomy and replacement of the intelligence systems in all of our robots.” </p><p id=\"htcpxw\">The rollout of Genius 4.0 includes about a half dozen new features for the company’s connected Roomba robot vacuums and Braava Jet robot mops. In addition to Siri support and <a href=\"https://www.theverge.com/2022/3/10/22967391/irobot-roomba-i3-update-smart-mapping\">adding smart mapping to its lower-priced self-emptying vacuum the i3</a>, the software update will bring room-specific cleaning preferences, a Do Not Disturb feature, and a Child and Pet Lock option.</p><p id=\"Lkfopa\">Alongside the new software updates, <a href=\"https://www.amazon.com/iRobot-Roomba-Wi-Fi-Connected-Vacuum/dp/B08C4JXBPF?ots=1&amp;slotNum=4&amp;imprToken=7cbfcb7b-aaed-d15d-dde&amp;th=1&amp;tag=theverge02-20&amp;ascsubtag=%5B%5Dvg%5Bp%5D22731432%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the Roomba i3 EVO and i3 Plus</a> get a $50 price cut, dropping to $349 for the i3 and $549 for the i3 Plus (the Plus indicates the model comes with an auto-empty charging base that sucks the dirt out of the robot’s bin for you).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TT_K0clwpycF_ZuZc6XWtWkTsKk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23323164/Roomba_j7__Object_Detection.jpg\">      <cite>Image: iRobot</cite>      <figcaption><em>The Roomba j7 and j7 Plus will soon recognize the clothing you leave on the floor, in addition to socks, cables, and pet waste.</em></figcaption>  </figure><p id=\"Zdgkxm\">Siri voice commands will initially be limited to start, stop, pause, resume, and send home. This means no room-specific cleaning commands, which are available with the other voice assistants. But iRobot’s Ryan Schneider tells <em>The Verge</em> more commands are coming. It’s a native integration in the iRobot app, so you can set up the voice commands without using Apple’s Shortcuts app.</p><p id=\"txPV5D\">Another feature that will bring Roomba’s software up to speed with competitors like Roborock is room-specific cleaning preferences. With any smart mapping robot (which includes the s9, j7, and i3 vacuums and the <a href=\"https://www.amazon.com/iRobot-Ultimate-Connected-Precision-Recharges/dp/B07QNM91NQ?ots=1&amp;slotNum=7&amp;imprToken=7cbfcb7b-aaed-d15d-dde&amp;tag=theverge02-20&amp;ascsubtag=%5B%5Dvg%5Bp%5D22731432%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Braava Jet m6 mop</a>), users can now determine exactly how it will clean each room or zone. </p><p id=\"qGZYyU\">For example, you will be able to set the vacuum to take two passes in the hallway but just one in the guest bedroom. And for models with different suction levels (such as the s9), you can select the intensity it uses on a room-by-room basis. </p><p id=\"3Bqdv5\">For the Braava Jet m6 mopping robot, there will be the choice of three levels of liquid dispensing and three “mopping overlap” levels. This determines how close the mopping bot gets to where it previously cleaned; a looser mopping pattern provides a lighter, quicker clean and a tighter pattern with more overlap gets a deeper clean but takes longer.</p><p id=\"6bptrT\">Room-specific cleaning preferences can be set per job and saved for the next job. Users will also be able to tailor the preferences individually for scheduled jobs and favorite routines.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tGXUZ9pju6n8s_M8ijq782ZaQts=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23323162/Roomba_Pet_Lock.jpg\">      <cite>Image: iRobot</cite>      <figcaption><em>Good news, you can now prevent your dog from vacuuming your house.</em></figcaption>  </figure><p id=\"MDUGRy\"><a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\">The Roomba j7</a>, iRobot’s first robot vacuum that can intelligently identify and avoid certain objects to prevent being stopped in its tracks up by common household clutter, can now identify more stuff. Genius 4.0 adds clothing and towels to the bot’s list of machine learning capabilities, joining shoes, socks, cords, headphones, and poop.</p><p id=\"iuPyeQ\">Roombas are also getting a Child and Pet Lock capability (yes, apparently <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.rover.com%2Fblog%2Flabrador-figured-turn-off-roomba-now-wont-stop-video%2F%23%3A%7E%3Atext%3DShasta%2520the%2520red%2520fox%2520Labrador%2Cthing%2520in%2520the%2520living%2520room&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F17%2F22982578%2Firobot-software-update-roomba-robot-vacuums\" rel=\"sponsored nofollow noopener\" target=\"_blank\">some dogs have figured out how to turn robot vacuums on and off</a>) and a Do Not Disturb feature, so you or sleeping members of your family won’t be woken up by a bot that decided to finish its job at 2 am.</p><p id=\"YBbzWS\">The software updates will be staggered over the next few months, <a href=\"https://www.theverge.com/2022/3/10/22967391/irobot-roomba-i3-update-smart-mapping\">with the Roomba i3 smart mapping feature</a> rolling out now in the USA and arriving globally by the end of Q3. The other updates are scheduled for release globally by the end of June 2022, except for Do Not Disturb, which is available everywhere now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8FATZ01T2vd72ZHddBtNbycwcOE=/0x0:5120x2681/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23323161/Roomba_Siri_Integration.jpg",
  "description": "Software updates will arrive by the end of June",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}