{
  "title": "IRS will end use of facial recognition after widespread privacy concerns ",
  "url": "https://www.theverge.com/2022/2/7/22922212/irs-id-me-facial-recognition-end-privacy-concerns",
  "date": "2022-02-07T19:50:46.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4X7S_f9tSGv5MQr9OgZTxvCTp8I=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70480873/acastro_180730_1777_facial_recognition_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"DO5nlT\">The Internal Revenue Service has announced that it will transition away from the use of third-party facial recognition services for the verification of taxpayers’ identities, effectively ending a contract with facial recognition company ID.me that had received widespread criticism.</p><p id=\"lsDm4n\">The announcement was made in a <a href=\"https://www.irs.gov/newsroom/irs-announces-transition-away-from-use-of-third-party-verification-involving-facial-recognition\">press release</a> published by the agency today. It follows weeks of intense public criticism after the agency announced in January that by summer 2022, <a href=\"https://www.theverge.com/2022/1/20/22893057/irs-facial-recognition-taxes-online-idme-identity\">ID.me would be the only way for taxpayers to log in</a> when managing tax accounts online, requiring that all users upload a selfie to access their account at irs.gov.</p><p id=\"TjPIcR\">“The IRS takes taxpayer privacy and security seriously, and we understand the concerns that have been raised,” said IRS Commissioner Chuck Rettig. “Everyone should feel comfortable with how their personal information is secured, and we are quickly pursuing short-term options that do not involve facial recognition.”</p><p id=\"AELbkU\">The IRS said it would bring online an additional authentication process that does not involve facial recognition to avoid disruption to taxpayers.</p><p id=\"Z6Jvnt\">Privacy advocates began to raise concerns over the use of ID.me’s technology almost immediately after the IRS’s initial contract with ID.me was announced, and the revenue agency reportedly <a href=\"https://www.theverge.com/2022/1/29/22907853/irs-idme-facial-recognition-alternatives-privacy-concerns\">began to look for alternatives soon after</a>.</p><p id=\"eIpeBX\">Criticism increased after ID.me <a href=\"https://www.theverge.com/2022/1/26/22903437/id-me-facial-recognition-databases-irs-match\">walked back an initial claim</a> that its facial recognition systems did not use a one-to-many matching technique. Having initially called one-to-many matching “complex and problematic,” CEO Blake Hall admitted <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6892131524746326016/\">in a LinkedIn post</a> that ID.me did use the matching technique in certain circumstances.</p><p id=\"UzRLmD\">“If companies and the government have to lie about facial recognition in an effort to avoid public scrutiny, they shouldn’t be using it,” said Caitlin Seeley George, campaign director for Fight for the Future, at the time.</p><p id=\"bPC6wt\">Senator Ron Wyden (D-OR), a longtime privacy advocate, <a href=\"https://twitter.com/RonWyden/status/1490715667468890112\">called for the IRS to end its plan to require facial recognition</a> in an open letter just hours before the news was announced.</p><p id=\"kiAUzP\">“This is big: The IRS has notified my office it plans to transition away from using facial recognition verification, as I requested earlier today,” Wyden <a href=\"https://twitter.com/RonWyden/status/1490761333423452161\">tweeted</a> in response to the latest news. “While this transition may take time, the administration recognizes that privacy and security are not mutually exclusive.”</p><p id=\"hYvuRy\">An ID.me spokesperson declined to comment on the news when contacted by <em>The Verge</em>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z3Gjy0H1piCdsZr0DUViD1L1CjQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12322327/acastro_180730_1777_facial_recognition_0003.jpg",
  "description": "\"We understand the concerns that have been raised,\" said IRS Commissioner Chuck Rettig.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}