{
  "title": "Is “realityOS” Apple’s newest operating system?",
  "url": "https://www.theverge.com/22925038/apple-realityos-augmented-reality-headset-operating-system-rumors",
  "date": "2022-02-09T11:49:44.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JHdlIc3mlOYgL4uNhcrhZj_M7Mg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70487411/acastro_180604_1777_apple_wwdc_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"4NgRch\">Apple’s long-rumored virtual or augmented reality headset might not launch until 2023, but developers have spotted additional mentions of a new “realityOS” that could power it. First referenced as “rOS” in 2017 by <a href=\"https://www.bloomberg.com/news/articles/2017-11-08/apple-is-said-to-ramp-up-work-on-augmented-reality-headset\"><em>Bloomberg News</em></a>, realityOS was also spotted as part of some pre-release iOS 13 builds. <a href=\"https://9to5mac.com/2022/02/09/realityos-apple-headset/\"><em>9to5Mac </em>reports</a> that developers have now found references to realityOS in GitHub repos and in App Store upload logs.</p><p id=\"jwPkf1\">“What is Apple’s realityOS doing in the App Store upload logs?” asks iOS developer <a href=\"https://twitter.com/renssies/status/1483038609208975360?ref_src=twsrc%5Etfw\">Rens Verhoeven</a>. Fellow developer <a href=\"https://twitter.com/stroughtonsmith/status/1491266972226490368\">Steve Troughton-Smith says</a> a GitHub repo <a href=\"https://github.com/apple-oss-distributions/dyld/blob/5c9192436bb195e7a8fe61f22a229ee3d30d8222/common/MachOFile.cpp#L578\">referencing realityOS</a> confirms it “has its own OS &amp; binaries... and has a realityOS simulator.” He also speculates this could simply be “a remnant of somebody’s pull request from a fake account.”</p><div class=\"c-float-right\"><aside id=\"ijci5W\"><q>realityOS is reportedly based on iOS</q></aside></div><p id=\"D6PJGp\">The original <em>Bloomberg</em> report that referenced rOS in 2017 noted that the operating system is based on iOS. Apple is a fan of using the OS shorthand for its operating systems, including iOS, watchOS, tvOS, iPadOS, and macOS. Geoff Stahl, an Apple veteran, was reportedly one of the directors in charge of the realityOS software group in 2017.</p><p id=\"cYyXfE\">The new references to realityOS come months after analyst Ming-chi Kuo claimed Apple’s first AR headset would arrive later this year with “<a href=\"https://www.theverge.com/2021/11/26/22802981/apple-ar-headset-m1-processor-release-date-specs\">the same level of computing power</a>” as an M1 Mac. Kuo also suggests the headset will be a standalone platform, which could further explain the need for a dedicated operating system. RealityOS could be a codename Apple has been using for five years, but Bloomberg reporter <a href=\"https://twitter.com/markgurman/status/1477877991375925252\">Mark Gurman says</a> the codename for the OS is actually “Oak,” so realityOS could be the final name. Either way, the continued references suggest it’s a project that’s key to its headset.</p><p id=\"sn5izB\"><em>Bloomberg</em> has since reported that Apple’s headset <a href=\"https://www.theverge.com/2022/1/14/22883790/apple-virtual-augmented-mixed-reality-ar-vr-headset-launch-2023\">may not release until 2023</a>, and that the company had planned to reveal it at this year’s Worldwide Developers Conference (WWDC). Apple is reportedly facing challenges with overheating, cameras, and software that could push back the headset reveal. But it’s also possible Apple might want to get the software development kits for realityOS in the hands of developers ahead of its debut.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/W4T_cOXSKByy6vwN8c-FcH-1S4A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477051/acastro_180604_1777_apple_wwdc_0003.jpg",
  "description": "The new OS is likely based on iOS.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}