{
  "title": "Is streaming just becoming cable again? Julia Alexander thinks so",
  "url": "https://www.theverge.com/23010559/decoder-streaming-platforms-cable-netflix-disney-apple",
  "date": "2022-04-05T15:00:24.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Tc6BDIsHx7aDGD3z6lXBQgdhQu4=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70712279/VRG_ILLO_Decoder_Julia_Alexander.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p id=\"OAVhhp\">Julia Alexander is a senior strategy analyst at Parrot Analytics, a company that helps streaming companies do better at… streaming. She also hosts the downstream podcast, which is about the business of streaming. Since we are a couple years into a huge shift to streaming entertainment in Hollywood. It’s clear the streamers are here to stay, while the legacy media companies are in the middle of huge transformations. </p><p id=\"kUER36\">On the one side, Apple just won the Oscar for Best Picture for a film it bought out of Sundance called CODA. Amazon now owns MGM. Netflix is investing in games and hinting at advertising for the first time.</p><p id=\"jPxmtP\">On the other side is Disney: a company with a new CEO in Bob Chapek, who is reorganizing the company around streaming — in the process, irritating big stars like Scarlett Johansson and its own major studios like Pixar by sending movies directly to Disney Plus instead of the theaters. But on the flip side, Encanto became a sensation only after it left theaters and hit the app. So I wanted to ask Julia how that shift was going and how Chapek’s restructure was playing out after the storied tenure of his predecessor Bob Iger. Decoder is a podcast about org charts, after all.</p><p id=\"6aYYR4\">Quick disclosures: NBCUniversal is an investor in Vox Media, Vox Media has shows on some of these streaming platforms, and <em>The Verge</em> itself is working on a show for Netflix. That said, I don’t have any inside information as to what is going on at the streaming companies at large.</p><p id=\"BTzYvV\"></p><div id=\"Fs7IlN\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP8522834297\" width=\"100%\"></iframe></div><p id=\"VeHBU6\"><em>An excerpt of the transcript follows. A full transcript will be available soon. This transcript has been lightly edited for clarity.</em></p><p id=\"LtOIT5\">So it seems like Bob Chapek is losing control of the kingdom, versus Bob Iger had control over it. But what I think gets lost in that is that Bob Chapek is just over two years into his tenure as CEO, and his first job was pulling the company out of the pandemic and focusing on how to just survive it. Now he’s being tasked with carrying the company very publicly in a way that generates support from the shareholders, from the consumers, and from his employees. That’s easier said than done, especially for someone who’s so new to the role.</p><p id=\"vGhceS\"><strong>I feel like this pattern of the visionary CEO who leaves and then hands it over to the best operator of his crew instead of another visionary is fairly common. I would actually make the direct comparison to Apple. Steve Jobs is the visionary. He hands over the company to Tim Cook, who’s an operator. Tim Cook is massively successful as a CEO if you measure the business performance of Apple, obviously, but no one’s running around saying Tim Cook is a product visionary. I think he’s been good at carrying the cultural legacy and the moral position of Apple as well. I don’t think there’s any question there. But no one thinks that Tim Cook invented the AirPods. It’s just not the role we ascribe to him. Do you think Chapek is a creative visionary the way that Bob Iger was? Because Iger had credibility because all the creatives believed in him.</strong></p><p id=\"Lzc6uz\">Exactly and no. I also think Chapek would argue that he’s not a creative visionary in the way Bob Iger was — which is fine in a tech world where your major concern is the product and this kind of consumer experience in a very intimate way. If we think of how devices in our lives exist — which I know you do, you think about quite often — Chapek is this guy who is tasked with moving Disney as a creative company into a tech-oriented role while remaining very, very in line with creatives. It’s the creative power that makes Disney what it is.</p><p id=\"cbctGE\">If we look at Scarlet Johansson and her lawsuit when she sued Disney for how she felt she was treated with <em>Black Widow</em> moving to Disney Plus during the pandemic, that is, at its core, the first moment people realized this Bob Chapek is not like Iger. And that’s going to become an issue when Disney is fighting for top talent for its franchises, for its new franchises, for what it’s trying to do, especially with the theatrical landscape having a revolution — in a positive, also in a negative way — and within the studio landscape. </p><p id=\"n4QQyc\">The idea of where do movies exist and how do we compensate talent? How do we think about the power of a movie in a theater versus what it looks like if we send it directly to Disney Plus? That is something that’s happening with Pixar. Their movies are being sent to Disney Plus, and that leads to jokes about Pixar being the next direct-to-video brand for Disney, which is a studio that costs them $7 billion and really pulled Disney animation out of the red in many ways.</p><p id=\"xRXhbT\">So when we see the “Don’t Say Gay” bill, there’s a disconnect between how Chapek views his fiduciary duty, which is promising Wall Street and his shareholders things like “we’re going to get to 230 to 260 million subscribers by 2024” — which is a daunting promise, a daunting projection. At the same time, Chapek has to carry the brand that is Disney, that stands up for the right reasons, that stands up in political and social issues and humanitarian issues, that engages with artists and creatives, and really understands how to talk to artists and creatives. Because talking to distributors and your executive team [is] very different from talking to someone who’s poured their heart into a role or into directing or into writing a film.</p><p id=\"ZBWIAj\"></p><p id=\"vGodUV\"></p><p id=\"Yy46z5\"></p><p id=\"UzNXpk\"></p><p id=\"vN8wzu\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DTY-rOZSbd0yjE-lTHs8BGJzHko=/0x115:2050x1188/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366695/VRG_ILLO_Decoder_Julia_Alexander.jpg",
  "description": "On sports, superhero movies, and the business of streaming",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}