{
  "title": "Is Samsung the latest Android device maker throttling apps?",
  "url": "https://www.theverge.com/2022/3/3/22959600/samsung-app-throttling-game-optimizing-service-gos",
  "date": "2022-03-03T10:14:43.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-TBrc7hA2QlZS5TCMz0oF1Njefc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70573234/ajohnson_220216_5032_0008.0.jpg\" />        <figcaption><em>There are conflicting reports about whether Samsung’s S22 series devices are affected.</em> | Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p id=\"89vqLj\">Some of Samsung’s smartphones include software that appears to be artificially limiting, or throttling, the performance of thousands of popular apps, <a href=\"https://www.androidauthority.com/samsung-gos-throttling-apps-3125885/?utm_source=feedly&amp;utm_medium=webfeeds\"><em>Android Authority </em>reports</a>. Reports about the behavior have been gathering steam on <a href=\"https://twitter.com/GaryeonHan/status/1499009797035008002\">Twitter</a>, as well as <a href=\"https://r1.community.samsung.com/t5/%EA%B0%A4%EB%9F%AD%EC%8B%9C-s/gos-%EC%A0%95%EB%A7%90-%EC%B6%A9%EA%B2%A9%EC%9D%B4%EB%84%A4-%E3%84%B7%E3%84%B7%E3%84%B7%E3%84%B7/m-p/15538133\">Samsung’s</a> <a href=\"https://r1.community.samsung.com/t5/%EA%B0%A4%EB%9F%AD%EC%8B%9C-s/gos-%EC%82%AC%ED%83%9C-%ED%95%B4%EA%B2%B0%ED%95%B4%EC%A3%BC%EC%84%B8%EC%9A%94/m-p/15537807\">Korean</a> <a href=\"https://r1.community.samsung.com/t5/%EA%B0%A4%EB%9F%AD%EC%8B%9C-s/%EC%82%BC%EC%84%B1%EB%AC%B4%EC%84%A0%EC%82%AC%EC%97%85%EB%B6%80%EC%9D%98-%EB%AA%B0%EB%9D%BD-gos%EA%B2%8C%EC%9D%B4%ED%8A%B8/m-p/15535231\">community</a> forums. </p><p id=\"4a8dT1\">At the core of the issue is Samsung software called Game Optimizing Service (GOS), which is reportedly throttling the performance of 10,000 apps. This list includes popular apps like Instagram, Netflix, TikTok, and even Samsung’s own apps like Secure Folder and Samsung Pay. Crucially, however, it doesn’t appear to include benchmarking apps like 3DMark and GeekBench, which means they might not give an accurate picture of the performance of a phone. So a benchmarking app will run just fine, but when you actually come to use an app like TikTok, you might not get the full performance you expect (and, arguably, deserve). </p><div class=\"c-float-right\"><aside id=\"JrfJo0\"><q>Benchmarking apps reportedly aren’t affected</q></aside></div><p id=\"lexRIf\">A test done by one <a href=\"https://www.youtube.com/watch?v=Vtt2g3BlwM8\">Korean YouTuber</a> shows the extent of the impact this can have. Simply by renaming a benchmarking app that wouldn’t usually be throttled (3DMark) to the name of a popular game that is (Genshin Impact) they were reportedly able to trick the phone into throttling 3DMark’s Wild Life Extreme benchmark, reducing its overall score from 2618 to 1141. </p><p id=\"bOZTku\">What’s unclear at the moment is which phones are equipped with this Game Optimizing Service. <em>Android Authority</em> reports that it didn’t find the software on its Galaxy S22 devices, the Galaxy S20 FE, or the Galaxy S10E, but that they <em>did</em> find it on the Galaxy S21 Plus. But, confusingly, <a href=\"https://9to5google.com/2022/03/02/samsung-throttling-android-apps-accusation/\"><em>9to5Google</em> reports</a> that the software was installed on their Galaxy S22 Plus. The Korean Youtuber cited above appears to be showing the software running on a Galaxy S22 Ultra.</p><p id=\"emcDLr\">If the story of an Android device maker throttling app performance sounds familiar to you then that might be because OnePlus was caught in a <a href=\"https://www.theverge.com/2021/7/8/22568107/oneplus-9-pro-battery-life-app-throttling-benchmarks\">very similar situation last year</a>, where it was diverting popular apps like Chrome and Twitter (but not benchmarking apps) away from its phone processor’s high performance CPU cores. <a href=\"https://forums.oneplus.com/threads/insight-into-oneplus-9-series-processor-and-app-optimization.1467338/\">OnePlus justified the decision</a> by saying it was optimizing for battery life and heat, but users were rightly annoyed that they weren’t told about this behavior up front.</p><p id=\"NN18km\">Samsung is yet to respond to <em>The Verge</em>’s request for comment on what it’s Game Optimizing Service is meant to achieve, though if it’s similar to OnePlus it seems likely it’s also aimed at improving battery life. But what’s less clear is why users aren’t given the option of disabling the behavior, or why Samsung hasn’t told them about it in the first place. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kEjwo_VgrC2qoaarloemP5SNVmU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23256281/ajohnson_220216_5032_0008.jpg",
  "description": "OnePlus was caught in a similar situation last year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}