{
  "title": "It’s hard to believe Samsung’s new, matte The Frame is actually a TV",
  "url": "https://www.theverge.com/2022/4/4/23009799/samsung-the-frame-2022-preview-matte-display-artwork",
  "date": "2022-04-04T15:00:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4Xni3OBU-3uyUGBYyymAs3LY7no=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70707955/cwelch_220331_5121_0003.0.jpg\" />    </figure>  <p>A matte finish makes The Frame’s signature trick even more convincing</p> <p id=\"ZQ0Ouk\">Not everyone cares about having the absolute best TV specs or pristine picture quality. It turns out there are a lot of people who <em>hate</em> having a traditional TV — this ugly black rectangle — disrupting the vibe and decor of their living room. Those are the same people who have turned Samsung’s The Frame TV into such a big hit. I’ve got family members and co-workers who’ve all bought The Frame in the last year because of how well it disguises itself as a piece of art when not being used. You can customize the TV’s bezels and swap between different options to get exactly the look you want when it’s on your wall. </p><p id=\"pjSBhr\">However, some of those folks might soon wish they’d waited a little bit longer to buy. Because, for 2022, <a href=\"https://shop-links.co/cgXWvpMwt6R\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Samsung has introduced a matte display</a> that cuts way back on glare and makes artwork showcased by The Frame almost look like canvas. I recently got the chance to check out the matte Frame and compare it side by side with last year’s model, and even though the older Frame by no means had what I’d consider a “glossy” display, the difference was pretty remarkable. It was to the point where I questioned whether I was looking at an actual TV set and had to get up close to hunt for pixels. They were indeed there.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sSqzy15x4s6H5W7yENaO0zBLmD8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360320/cwelch_220331_5121_0006.jpg\">      <figcaption><em>Samsung’s 2021 The Frame (left) compared to the matte 2022 edition (right).</em></figcaption>  </figure></div><p id=\"Fc1yQu\">The new Frame still has the same customizable bezels and <a href=\"https://shop-links.co/cgXWvVe1HKS\" rel=\"sponsored nofollow noopener\" target=\"_blank\">now comes in more sizes</a>, ranging from 43 inches ($999.99) to an 85-inch giant that’s over $4,000. All feature a 4K resolution. If you care about gaming, stick with 55 inches and above because you lose the fluid 120Hz refresh rate if you go smaller. The TV’s ports are still separated into a breakaway box that connects to The Frame with a thin cable.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gf5CpqPczFDX2bqYnK-7Eh-mTmQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360321/cwelch_220331_5121_0007.jpg\">      <figcaption><em>The Frame still offers customizable bezels made from materials including wood.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wxiWeozbOMoinYp_WY1Vwc9l7cg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360319/cwelch_220331_5121_0005.jpg\">      <figcaption><em>Yes, there are pixels. This is in fact a TV.</em></figcaption>  </figure></div></div></div><p id=\"eNpbWP\">But that matte screen is the star of the show. Samsung’s art store has thousands of pieces to pick between, and the artwork looks more real and convincing than ever before. The effect is aided by The Frame’s ability (when in ambient mode) to optimize both display brightness and white balance for whatever room and environment it’s in.</p><p id=\"Fxur1r\">That said, I’m curious about whether switching to a more matte finish will affect the TV’s clarity and sharpness. Samsung told me that it doesn’t expect any major tradeoffs, but I suspect The Frame won’t rival <a href=\"https://www.theverge.com/e/22773882\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the company’s new OLED</a> or latest Mini LED TVs in terms of picture quality when you’re actually watching content. Maybe the target market for The Frame doesn’t care much either way.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/W6SYj6qlqZKPFlI7ln__0DEbuE8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360315/cwelch_220331_5121_0001.jpg\">      <figcaption><em>The matte screen’s benefits are even more obvious when viewed off angle.</em></figcaption>  </figure></div><p id=\"BedYqA\">Even putting that question aside, The Frame still isn’t the most impressive TV on paper: there’s no local dimming whatsoever, which is definitely a bummer at these prices. But it does support 4K gaming at 120Hz, so… things could be worse? The Frame is fundamentally a <em>good enough</em> TV that looks way classier than any of its competition. My LG OLED has an art mode on it, but no one’s mistaking it for a framed print. Samsung is owning this market so far.</p><p id=\"16NjFl\">Personally, I’m someone who can tolerate having a regular TV in my living room and would take an OLED set over The Frame every time. But for the contingent of customers who just refuse to go that way, the 2022 edition of Samsung’s wall art TV is an impressive feat, and I’m looking forward to reviewing it in the weeks ahead.</p><p id=\"2levrT\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Vrwc-JbByIys8hiRq0-2gVHu2IY=/0x86:2040x1154/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23360317/cwelch_220331_5121_0003.jpg",
  "description": "The 2022 edition of The Frame could be a massive hit.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}