{
  "title": "Ja Rule’s NFT fans aren’t worried about another Fyre Fest",
  "url": "https://www.theverge.com/2022/2/23/22946223/ja-rule-nft-fyre-festival",
  "date": "2022-02-23T14:30:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"Times Square New Year’s Eve 2022 Celebration\" src=\"https://cdn.vox-cdn.com/thumbor/2JwIZ3DFCQ0iwwKxcKI1epydVAg=/1x0:3742x2494/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70540460/1362154823.0.jpg\" />        <figcaption>Photo by Arturo Holmes/Getty Images</figcaption>    </figure>  <p id=\"6Z5wg8\">Rapper, actor, and serial celebrity endorser Ja Rule has attached his name to many things. There was that random <a href=\"https://www.newsweek.com/ja-rule-papa-cristos-commercial-1512581\">Greek restaurant</a>, <a href=\"https://www.complex.com/music/2020/01/ja-rule-gets-roasted-after-promoting-tax-preparation-company\">a tax prep company</a>, and, of course, his ill-fated ventures with fraudster Billy McFarland as a co-founder of the infamous Fyre Festival. And last year, long before the wave of recent celebrities jumped in on the craze, Ja Rule added an NFT project to his portfolio — without much fanfare or media coverage.</p><p id=\"slNY3H\">The project, called Club Cards, is basically a series of NFT trading cards of other NFT projects’ characters. Each “wave” of releases is in partnership with another NFT series. Ja Rule is <a href=\"https://www.clubcards.cc/#/\">listed as a co-founder</a> on the Club Cards website, and he frequently tweets about the project and its releases. Members can register for giveaways, too, including physical merchandise like <a href=\"https://twitter.com/jarule/status/1494726305534955528\">clothing</a> and badges, and, in the case of one lucky club member, an all-expenses-paid trip to New York City to see Ja Rule perform.</p><div class=\"c-float-left\"><div id=\"KElk9Q\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ClubCards are your WL pass to the Rascals!!! Coming soon…     thanks for all the support!!! ❤️ <a href=\"https://t.co/GPYSH6h8Nc\">pic.twitter.com/GPYSH6h8Nc</a></p>— Ja Rule (@jarule) <a href=\"https://twitter.com/jarule/status/1494863180891369473?ref_src=twsrc%5Etfw\">February 19, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"6TXTt0\">So, how’s that going?</p><p id=\"4CWTUo\">Apparently, better than Fyre Festival. Paul Hawron, a 22-year-old recent college graduate in Arkansas, was the winner of the first New York trip and had a nice time with his girlfriend, who he brought as a plus one — much more manageable than the 500 festival attendees brought to the island of Great Exuma. Hawron and his girlfriend were scheduled to fly out on a Thursday in January to make it in time for a Ja Rule concert that evening.</p><p id=\"RGTInA\">Asked if he was nervous about the trip given Ja Rule’s track record of disastrous getaways, Hawron says he didn’t initially make the connection with Fyre Festival.</p><p id=\"36LGev\">“I forgot he was like an investor part of that until I told one of my friends about the trip,” Hawron says. “And they’re like, ‘Is Ja Rule the Fyre Fest guy?’”</p><p id=\"Esukeb\">Hawron is someone who likes to have his schedule locked down ahead of time — he wants to know when the flight is, how they’ll get to the hotel, and where they’ll eat. Communication with Ja Rule’s camp was sporadic and occasionally delayed, but Hawron says he trusted they’d be taken care of. That night, Hawron and his girlfriend saw Ja Rule perform at Sony Hall and met the artist and his entourage after the show.</p><p id=\"nVndnv\">“He’s really nice; he seems really genuine,” Hawron says about Ja Rule. “When we walked back there, he was just like, ‘NFTs!’”</p><p id=\"Bj9V8M\">The couple was put up in a hotel in Times Square and spent the next day shopping, taking pictures, and walking through Central Park. </p><div class=\"c-float-right\"><aside id=\"H2brhK\"><q>“With all the NFT stuff, most of it will eventually be worthless.”</q></aside></div><p id=\"JAA7Bh\">Hawron says he approaches NFTs with a healthy dose of skepticism — he hasn’t made millions flipping tokens for profit and mostly buys them as a hobby. Some projects end up pittering out, or the creators abandon them — he spent the end of 2021 consolidating the NFTs he owned, mostly selling off tokens for a loss.</p><p id=\"RayAXy\">“With all the NFT stuff, most of it will eventually be worthless,” Hawron says. “They’re just kind of riding a trend that isn’t sustainable.”</p><p id=\"TaFAb8\">But he feels differently about the handful of Club Cards he holds, purchased for 0.05 ETH (around $150, a steal compared to a Fyre Festival ticket). Though Hawron’s cards haven’t increased in value since he purchased them, it’s a project he intends to hold on to. The project’s founder and creative director, Josh, is active in the Discord, Hawron says, and seems to have a vision for the future — including <a href=\"https://twitter.com/jarule/status/1494697047269777419\">another New York trip</a> to see Ja Rule live.</p><p id=\"5YR7MT\">The project has sold nearly 700 NFTs so far, according to Josh, and the community is still relatively small — a couple hundred people or so. Josh says Ja Rule’s involvement in Club Cards has been instrumental in its success. </p><p id=\"r1j35L\">“A lot of celebrities tend to dip in and out, and for those who have been in the space for a while, it’s often very obvious,” Josh says. “But Ja has maintained his presence in the NFT space and actively invests in both the art and the communities / people involved.”</p><p id=\"siirrU\">So far, Club Cards has had three “waves” of releases, all featuring collaborations with either Ja Rule or another NFT project. Next on the horizon is their own characters called the Rascals, which are at the center of Club Cards’ mission: “To unite a new era of digital hypebeasts by growing the Rascals brand together as a community.” </p><p id=\"CbiSoA\">And Ja Rule is happy, as always, to cosign what’s to come: “So much Utility with this project it’s insane!!!” he tweeted. “LFG WAGMI [let’s fucking go we’re all gonna make it].”</p><p id=\"JpH41Y\"></p><p id=\"y6Agx1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6YO3q8-L5HA2nxkPufZNWililPM=/0x0:3742x1959/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23264126/1362154823.jpg",
  "description": "The project has sold nearly 700 NFTs for around $150 each",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}