{
  "title": "Jack Dorsey says ‘Elon is the singular solution I trust’ for Twitter’s future",
  "url": "https://www.theverge.com/2022/4/25/23042172/jack-dorsey-elon-musk-twitter-lbo-radiohead",
  "date": "2022-04-26T03:32:34.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"US-BITCOIN-CONFERENCE\" src=\"https://cdn.vox-cdn.com/thumbor/lD4abpdnh8gPzGvgnvrzyEisWCY=/0x0:4993x3329/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70793262/1233272334.0.jpg\" />        <figcaption>Photo by MARCO BELLO/AFP via Getty Images</figcaption>    </figure>  <p id=\"hVfdSV\">You know what, I’m into it. Let’s go full, unkempt beard for this one. The Gen-Xers are <em>online</em> and they are <em>posting Radiohead on main.</em></p><div id=\"5ewPdM\"><blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\"><a href=\"https://t.co/jeNtFyRrpR\">https://t.co/jeNtFyRrpR</a></p>— jack⚡️ (@jack) <a href=\"https://twitter.com/jack/status/1518767238081171456?ref_src=twsrc%5Etfw\">April 26, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"VBAjqE\">It did fill me with nostalgia to see Twitter co-founder, former CEO, and newly-minted “<a href=\"https://www.theverge.com/2022/4/22/23037963/jack-dorsey-block-head-ceo\">Block Head</a>” Jack Dorsey post Radiohead’s “Everything In Its Right Place” (he linked to niche music service Tidal, which is owned by Block) like he was setting an early-2000s AIM status about soon-to-be-Twitter-owner Elon Musk, who is one of the site’s more prolific users. Musk is also the CEO of Tesla and SpaceX, which make cars and rockets, respectively. He also founded a company, Neuralink, to i<a href=\"https://www.theverge.com/2020/9/29/21493224/elon-musk-neuralink-neuroscience-brain-machine\">mplant devices in people’s heads</a>.</p><div id=\"5gPtzT\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The idea and service is all that matters to me, and I will do whatever it takes to protect both. Twitter as a company has always been my sole issue and my biggest regret. It has been owned by Wall Street and the ad model. Taking it back from Wall Street is the correct first step.</p>— jack⚡️ (@jack) <a href=\"https://twitter.com/jack/status/1518772754782187520?ref_src=twsrc%5Etfw\">April 26, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"AaE9jO\">Dorsey followed up his cryptic tweet with a short thread explaining why he’s so happy that he’s posting songs from an album about being a human being in a world ruled by technology: “Twitter as a company has always been my sole issue and my biggest regret,” he wrote. “It has been owned by Wall Street and the ad model. Taking it back from Wall Street is the correct first step.” This seems to imply Dorsey thinks Musk’s ideas about building Twitter’s subscription business are on the right path; on the other hand, Musk has said the deal “is not a way to make money.” Fun!</p><p id=\"iSMnK4\">Anyway, think more expansively. “Twitter is the closest thing we have to a global consciousness,” Dorsey wrote. “Solving for the problem of [Twitter] being a company however, Elon is the singular solution I trust. I trust his mission to extend the light of consciousness.”</p><div id=\"TzfAxQ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Elon’s goal of creating a platform that is “maximally trusted and broadly inclusive” is the right one. This is also <a href=\"https://twitter.com/paraga?ref_src=twsrc%5Etfw\">@paraga</a>’s goal, and why I chose him. Thank you both for getting the company out of an impossible situation. This is the right path...I believe it with all my heart.</p>— jack⚡️ (@jack) <a href=\"https://twitter.com/jack/status/1518772757340639232?ref_src=twsrc%5Etfw\">April 26, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"BRKUZA\">Right on, the light of consciousness. Dorsey is endorsing Musk’s takeover. The <a href=\"https://www.prnewswire.com/news-releases/elon-musk-to-acquire-twitter-301532245.html\">press release noted</a> that the board’s decision was unanimous. Dorsey’s tweets note that he “chose” Parag Agrawal to succeed him as CEO, which perhaps signals that Agrawal will stay on after Musk takes over. Agrawal is on that board, after all!</p><p id=\"VLMlJ2\">“In principle, I don’t believe anyone should own or run Twitter,” Dorsey goes on. He thinks the service is a public good. But because it is a company, someone must own it; this is the tragedy of founding a business, I guess. “Thank you both for getting the company out of an impossible situation,” he wrote. “This is the right path... I believe it with all my heart.” </p><p id=\"wLeNyN\">Musk recently tweeted an unflattering photo of Bill Gates with the caption, “in case u need to lose a boner fast.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ls47FszxaaVqlIWRsts0sWAYCls=/0x0:4993x2614/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23416493/1233272334.jpg",
  "description": "Also he chose Parag Agrawal to be CEO, thanks",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}