{
  "title": "Jack Thompson still has a grudge",
  "url": "https://www.theverge.com/2022/3/10/22956300/jack-thompson-interview-violent-games-gta-doom-attorney",
  "date": "2022-03-10T16:00:00.000Z",
  "author": "Luke Winkie",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/J6AOHhpjrVTBVtgt7waYbNqt_rc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70604043/VRG_Illo_M_Rohn_5076_Jack_Thompson.0.jpg\" />        <figcaption>Illustration by Michelle Rohn / The Verge</figcaption>    </figure>  <p>At age 70, the infamous attorney hasn’t changed his mind about violent video games</p> <p class=\"p--has-dropcap\" id=\"k0E0qG\">When the video game industry is valued at $300 billion, a <em>Halo </em>TV series trailer is occupying prime real estate during the AFC Championship, and a <em>GTA </em>facsimile like <em>Free Guy </em>is one of the top-grossing films of the year, it is clear that Jack Thompson lost the fight. For those who don’t remember, Thompson was the attorney who led the charge against violent video games and helped morph a fringe topic into a dominant wedge issue of the mid-2000s. He has since vanished from the public eye as the outrage ran dry, and everyone moved on.</p><p id=\"mTghyK\">Looking back, the imagery of the zeitgeist — think <a href=\"https://video-images.vice.com/_uncategorized/1520475759309-DAI-25hUMAAK8BT.jpeg\">Joe Lieberman brandishing a light-gun live on CSPAN</a> or Hillary Clinton <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2015/04/21/hillary-clintons-history-with-video-games-and-the-rise-of-political-geek-cred/\">equating first-person shooters to tobacco and alcohol</a> — is rendered strange and atemporal in the harsh light of the 2020s. Yes, the affair still earns some perfunctory attention, usually engineered by the NRA in response to yet another mass shooting, but I think everyone who was once involved in the gaming panic knows that the jig is up. Degenerate classics like <em>Mortal Kombat, Doom, </em>and <em>Grand Theft Auto </em>seep deeper into the marrow of our culture with each passing day with no real objection from the nation’s lawmakers. Hell, Rep. Madison Cawthorn, one of the young stars of the MAGA movement, is actively petitioning for <a href=\"https://twitter.com/repcawthorn/status/1448287339105636367?lang=en\">American military technology to better resemble the arsenal in <em>Halo</em></a>. Where have all the true believers gone?</p><p id=\"i6hivp\">Thankfully, Jack Thompson was kind enough to answer his phone on a sunny Friday afternoon in South Florida. It only took a few minutes for him to unleash a salvo of takes, forever cocked and loaded for anyone willing to listen. He asserts an association between the rise of crime in New York City to Take-Two, the publisher behind <em>Grand Theft Auto. </em>After all, he explained, Take-Two <em>is</em> headquartered in Manhattan. Thompson is never going to betray his heart, for better or worse.</p><div class=\"c-float-right c-float-hang\"><aside id=\"eSQv1s\"><q>“I’m still here. I haven’t died yet.”</q></aside></div><p id=\"muuitH\">“Americans are famous for moving on,” he told me. “We have the attention span of a mosquito. Churchill said that when most people stumble across the truth, they pick themselves up, dust themselves off, and move on as if nothing happened. What pissed people off about me is that I didn’t do that. I’m 70. I’m still here. I haven’t died yet.”</p><p id=\"SLebyg\">I believe I first became acquainted with Jack Thompson in an ancient issue of <em>Electronic Gaming Monthly</em>. I was 14 years old and proudly self-identifying as a gamer. To be fully ensconced within that community in the early 2000s, one was encouraged to hold a special hatred for a litigious attorney in Florida who had filed numerous grievances against the games industry. The cases were usually built around the specious premise of a depersonalizing psychological force that trained impressionable teenaged PlayStation owners to commit random acts of violence. In eighth grade, I did not possess any ethical grounding beyond one core thesis: those who wanted to take my video games away were the enemy. Thus, for a large portion of my youth, there was nobody I hated more than Jack Thompson.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1JKexbXin4X85_M0rH0b7JFQ7eE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301361/0000003296.jpg\">      <figcaption><em>Grand Theft Auto III.</em></figcaption>  </figure></div><p id=\"ojI3P1\">The breadth of Thompson’s portfolio is impressive and almost impossible to recount in full. He’s a career moral agitator; before video games, he attempted <a href=\"https://www.miaminewtimes.com/news/jack-thompson-2-live-crews-greatest-nemesis-disbarred-6562017\">to restrict the sale of 2 Live Crew albums</a>, and <a href=\"https://www.nexttv.com/news/wbzx-pulls-stern-over-indecency-complaint-107749\">he has a longstanding feud with Howard Stern</a>. But Thompson’s life changed forever in 1999 when he filed his first gaming lawsuit, claiming that the perpetrator of the Heath High School shooting was desensitized by a collection of computer games. (<em>MechWarrior, Resident Evil, </em>and <em>Redneck Rampage, </em>to name a few.) That case didn’t go anywhere, but it put Thompson in a prime position to pounce on the burgeoning hysteria that would soon swallow up the then-forthcoming <em>Grand Theft Auto III. </em>Rockstar’s opus was gruesomely sculpted out of futuristic 128-bit tech and possessed an unapologetically nihilistic spirit. In an age where video games had not yet fully assimilated into mainstream society, the levy was destined to break.</p><p id=\"p9TCRb\">“It made me sick to my stomach,” said Thompson when I asked about the first time he saw <em>Grand Theft Auto </em>up close. “I was in my house, I put [<em>Grand Theft Auto III</em>] in a video game console, and it was disturbing. You weren’t passively watching something; you were participating in it.”</p><p id=\"rl4GBo\">By the middle of the decade, Jack Thompson had filed lawsuits targeting nearly every tendril of the video game supply chain. He sued Best Buy after claiming that his 10-year-old son purchased a copy of <em>Grand Theft Auto Vice City </em>from a store clerk. (Best Buy <a href=\"https://web.archive.org/web/20060529115657/http://www.law.com/jsp/article.jsp?id=1105364082606\">affirmed its existing policy</a> to only sell M-rated games to those 17 or older.) He sued Take-Two on multiple occasions, usually in conjunction with some sort of homicide trial involving underaged gamers. (All were dismissed.) He became histrionic, almost revivalist, in his allegations, fashioning himself as a modern-day crusader.</p><div class=\"c-float-left c-float-hang\"><aside id=\"F2j6q6\"><q>“It’s a rocket ride. But eventually you come back down to earth.”</q></aside></div><p id=\"hk0Cfp\">Thompson once postulated that the DC sniper was a radicalized gamer, based on the fact that investigators found a Tarot card inscribed with the words “Call me god” at one of the crime scenes. (“You go to video game chat rooms, and you have the proclamation ‘I am God’ all over the place,” <a href=\"https://www.cnn.com/2002/US/10/12/sniper.media/\">he said, on a 2002 episode of <em>The Today Show</em></a><em>.</em>) After the release of <em>Bully, </em>a 2006 game set in a Northeast preparatory school, Thompson discovered that the male main character had the ability to kiss another boy. “We just found gay sexual content in<em> Bully</em>,” he <a href=\"https://usatoday30.usatoday.com/tech/gaming/2006-11-03-news-bytes_x.htm\">wrote in a letter to the ESRB</a>. “Good luck with your Teen rating now.” (The board responded, saying they were already aware of the scene when rating the game.)</p><p id=\"3dngjh\">Thompson’s relentlessness, charisma, and cosmic belief in his cause made him a fixture on the cable-news salon circuit. He has sat down with Chris Matthews, Glenn Beck, and Rebecca Quick and was once prominently featured in an episode of <em>60 Minutes. </em>The message boards I regulared were speckled with primordial Jack Thompson memes, casting the man as the singular existential threat to the hobby I loved. It feels strange to say this in our era of millionaire Twitch streamers and international esports leagues, but for a period of time, you could make the argument that Jack Thompson was legitimately the most famous person in video games. Over the phone, Thompson allows that maybe, some of that fame went to his head.</p><p id=\"3ZdmUx\">“I enjoyed being the center of attention. We’re all egocentric to a certain extent. To be on cable news, to do <em>60 Minutes, </em>to be on Opera … it’s fun,” he said. “It’s a rocket ride. But eventually, you come back down to earth.”</p><p id=\"sk7213\">Thompson was disbarred by the Florida Supreme Court in 2007 after being accused of 31 different lawyerly violations. The charges are bleak and <a href=\"https://www.cnet.com/news/report-jack-thompson-game-industry-scourge-disbarred/\">include allegations like</a> sending “hundreds of pages of vitriolic and disparaging missives, letters, faxes, and press releases,” and “publicly accusing a judge as being amenable to the ‘fixing’ of cases.’” Thompson has not practiced law since, and he still regards the disbarment as a devastating derailment of his video game activism. Does he admit guilt? Not really, though he does have some regrets. Thompson believes he was too angry when dealing with his adversaries, which encouraged them to play hardball with him in return. But overall, I get the sense that Thompson believes he is a martyr of his convictions. Nobody is ever going to convince him that he wasn’t in the right.</p><p id=\"0ZxFT9\">“The plan was to disbar me so I wouldn’t be relevant, and that by and large happened,” he says. “It was a terrible experience. … You can be a felon in Florida and get your law license, but you can’t be Jack Thompson and ever get it back. Even if I had an epiphany that everything I did was wrong, and that I was a scumbag, and that I’m sorry, that doesn’t result in any remedy.”</p><p id=\"oBvs7l\">The irony is that Thompson’s wish is coming true. In many ways, he’s finally getting the congressional scrutiny over video games he’s always petitioned for — though not in the form he imagined. In 2019 the <a href=\"https://www.theverge.com/2019/2/22/18236352/loot-box-video-game-ftc-workshop-hassan-congress\">FTC held a workshop centered around loot boxes</a>, the pernicious, habit-forming scheme designed to drip-feed randomly assorted new items into players’ inventories in the hopes that they’ll keep spending money for more. The World Health Organization concurred with those anxieties when it added <a href=\"https://www.npr.org/2019/05/28/727585904/is-gaming-disorder-an-illness-the-who-says-yes-adding-it-to-its-list-of-diseases\">video game addiction to its list of diseases</a> that same year. For the first time in my life, there is a groundswell of momentum to ethically regulate the predatory economic practices of the games industry. Thompson and I both agree that publishers need to keep kids safe, but he has not abandoned his fundamental principle that a violent video game might entice troubled kids to commit violence themselves. That leaves him permanently out of step with mainstream cultural and <a href=\"https://www.theguardian.com/games/2020/jul/22/playing-video-games-doesnt-lead-to-violent-behaviour-study-shows\">scientific momentum</a>. If only he knew the revolution was already upon us.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YtPKX9y0rLCMPFWHaJ6GueBuMKQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23301344/ss_c8f0c20768412066cd1e182705b14d26acc4beb0.jpg\">      <figcaption><em>Doom.</em></figcaption>  </figure></div><p id=\"wLRvr4\">Thompson anticipates a reckoning. Someday, he says, the defense team in a murder trial is going to argue that their client was revved into a frenzy due to, in part, an inveterate video game habit. The jury will buy it, and the suspect will escape the death penalty. At last, all of Thompson’s warnings come home to roost, and the real villains — Tommy Vercetti, Niko Bellic, and Carl Johnson — will be unmasked for all to see. It’s hard for me to even conceptualize the scenario that Thompson describes, but I suppose that anyone still committed to dismantling <em>Grand Theft Auto </em>in 2022 must engage in some degree of magical thinking.</p><p id=\"Nn3kok\">“It’s going to work, and that’s going to get people’s attention,” said Thompson. “People are going to freak out. They’re going to say, ‘Wait a minute, somebody can kill somebody and only be convicted of manslaughter by virtue of a video game defense?’ … [they’ll want to] do something about the games and their distribution.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"pKV55R\"><q>“I don’t want anyone’s apology, but I have this hope, this unshakable idea.”</q></aside></div><p id=\"tmrQ37\">But until that day comes? Who knows. Thompson is considering writing another book but was slowed down two summers ago when he had a heart attack after teeing off on the first hole of a round of golf. “I had a 100 percent blockage in what’s called the Widowmaker artery,” he said. Thompson’s moral alignment has also evolved in realms outside of the video game business in some surprising ways. He’s a proud evangelical Christian and tells me he voted for Trump in 2016. “It became pretty clear that was a big mistake,” he said. Thompson re-registered as a Democrat in 2020 and voted for Joe Biden in the Florida primary. People can change, even Jack Thompson. “We’ve all been affected by Black Lives Matter and what happened in Minneapolis,” he said. “There’s no reason to trust the Republican party anymore about anything… I think they’ve completely screwed up by hitching their wagon to Trump.”</p><p id=\"GrAlLH\">In fact, I think it is safe to say that Jack Thompson is at peace. He’s retired, he’s playing golf every day, and he only relitigates the culture war when a journalist calls him up on the phone. Thompson holds onto one longshot; maybe, someday, he’ll be reinstated to the Florida bar. “I don’t want anyone’s apology, but I have this hope, this unshakable idea. That’d be a nice thing,” he said toward the end of our conversation. Perhaps the last <em>Grand Theft Auto </em>crusader can pick up where he left off, and a brand new generation of gamers can hate his guts.</p><p class=\"c-end-para\" id=\"1t83Sw\">“I’ve got everything I need,” finishes Thompson. “Except more time.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MkNme_9wahDJtGDyOSNHbQzarbw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23301302/VRG_Illo_M_Rohn_5076_Jack_Thompson.jpg",
  "description": "Catching up with the infamous attorney",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}