{
  "title": "Jeep rehashes last year’s all-electric concept with Magneto 2.0",
  "url": "https://www.theverge.com/2022/4/8/23016872/stellantis-jeep-magneto-2-all-electric-concept-returns",
  "date": "2022-04-08T21:45:47.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/dIn5CZiAdQt0Kbtop2C0nC1DIUA=/74x0:1945x1247/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70728539/CN022_007JP4frirnvh38gkl59j1p0gpih696_2048x1247.0.jpg\" />        <figcaption><em>The all-electric Jeep Magneto 2.0 concept is based on a two-door Wrangler.</em> | Image: Stellantis</figcaption>    </figure>  <p id=\"8L9pcj\">Jeep <a href=\"https://media.stellantisnorthamerica.com/newsrelease.do?id=23691&amp;mid=1\">unveiled an updated Magneto 2.0 concept EV</a> that renews its teasing of what the iconic off-roader could look like as a fully electric vehicle. Jeep didn’t mention any hardware upgrades for its custom-built motor but appears to have made some significant performance refinements <a href=\"https://www.theverge.com/2021/3/22/22344578/jeep-wrangler-magneto-concept-ev-manual-transmission-stellantis\">from last year’s model</a>.</p><p id=\"u2Ionv\">The Magneto 2.0’s motor operates at a lower RPM now, with higher peak amperage that it’s now capable of delivering for up to 10 seconds. It offers up to 850 pound-feet of torque — more than triple from last year — and 625 horsepower.</p><div class=\"c-float-right\"><aside id=\"lGemn0\"><q>quicker than a Tesla Model X Plaid and Rivian R1S</q></aside></div><p id=\"RnbMkc\">Jeep Magneto 2.0 carries the same mutant villain nameplate from last year’s prototype and still has a six-speed manual transmission — rare for an EV but similar to what was <a href=\"https://www.theverge.com/2019/11/5/20950148/ford-electric-mustang-manual-prototype-stick-shift-lithium-sema-2019\">in Ford’s concept Mustang in 2019</a>. It also retains the “electrified” blue and white coloring, but the 2.0 looks a bit more like a performance vehicle without the bulky winch last year’s concept packed in its front bumper.</p><p id=\"7vW57V\">There are several other visual changes to the Magneto 2.0: the front grille is now painted black, there’s a custom bikini top with a sunroof, white stripes were added along the sides that transition into blue to the rear, and a subtle “2.0” badge was added to the Magneto branding. The Magneto 2.0 is also rocking 20-inch rims with 40-inch tires vs. last year’s 35-inch tires, and the vehicle has also been lifted three inches instead of two.</p><div id=\"BpqKPW\"><div data-anthem-component=\"gallery:11135400\"></div></div><p id=\"MtBDo2\">The wheels and lift changes accompany an extended wheelbase, which the Mopar team was able to stretch 12 inches from the gas Wrangler model, allowing space for the electric drivetrain. With these adjustments, the Jeep Magneto 2.0 now has enough clearance to safely rock-climb and trail-blaze and is said to have proportions similar to the 2004 “LJ” Wrangler Unlimited.</p><p id=\"TQcD47\">The 70 kWh battery system in the Magneto 2.0 is like the original: split up into four parts and distributed around the Wrangler body to give some even weight distribution. The Magneto 2.0 is about 3.5 times quicker than the original, though, with a 2-second 0-60 mph time. That makes the Magneto 2.0 concept quicker than a Tesla Model X Plaid, Rivian R1S, Ford Mustang Mach-E GT, and GMC Hummer EV (and for many of them, <a href=\"https://www.theverge.com/2021/12/21/22846960/electric-vehicles-car-companies-promises-ship-dates\">about as easy to get</a>).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/TQ_2hk7_aHGid2zcymGwjC_ryLc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23377040/CN022_011JPmah7mg0an3s8k67c3r7r8emutn_2048x1171.jpg\">      <cite>Image: Stellantis</cite>      <figcaption><em>Jeep Grand Cherokee 4xe Trailhawk PHEV</em></figcaption>  </figure><p id=\"t0K8A1\">No details on the estimated battery range were shared, which is a shame since it would be a great metric to compare to the real fully electric Jeep <a href=\"https://www.theverge.com/2022/3/1/22956861/jeep-electric-suv-2023-ram-1500-ev-truck\">planned for next year</a>. The Stellantis-owned brand is still tip-toeing into the electrification of its vehicle lineup, offering only plug-in hybrids, including the Chrysler Pacifica mini-van and 4xe versions of the Jeep Wrangler and Grand Cherokee.</p><p id=\"GgTenJ\">For now, we’ll have to settle for the Jeep Magneto 2.0 concept, which joins several other concepts shown off today by the Jeep Performance Parts Mopar team, including a Trailhawk-styled Jeep Grand Cherokee 4xe Plug-in Hybrid. The collection of concepts and customs are heading to the annual Moab Easter Jeep Safari in Utah from April 9th through the 17th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/19ez1IDzky3do5RVRNSUOL8IakM=/0x96:2048x1168/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23376955/CN022_007JP4frirnvh38gkl59j1p0gpih696_2048x1247.jpg",
  "description": "The Magneto 2.0 is Jeep’s latest EV concept.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}