{
  "title": "JetBlue launches hostile takeover of Spirit after its earlier acquisition was rejected",
  "url": "https://www.theverge.com/2022/5/16/23074907/jetblue-spirit-hostile-takeover-budget-airline-frontier",
  "date": "2022-05-16T15:34:11.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"coronavirus Boston\" src=\"https://cdn.vox-cdn.com/thumbor/Q0aLIP3QM67SpMz-_LsgQEHXBX4=/82x0:1918x1224/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70874668/1217657907.0.jpg\" />        <figcaption>Staff Photo By Matt Stone/MediaNews Group/Boston Herald</figcaption>    </figure>  <p id=\"lsROE5\">JetBlue launched a hostile takeover of Spirit Airlines after its earlier acquisition offer was rejected. The New York-based airline said in <a href=\"https://otp.investis.com/clients/us/jetblue_airways/usn/usnews-story.aspx?cid=981&amp;newsid=83287\">a release</a> that its tender offer for $30-per-share was “all-cash” and “fully financed.” </p><p id=\"1LWAbu\">Earlier this month, Spirit’s board of directors rejected JetBlue’s $32-a-share bid to acquire the airline in favor of <a href=\"https://www.theverge.com/2022/5/2/23053292/spirit-merger-frontier-jetblue-airline\">an existing merger agreement with Frontier</a>, one of its ultra-low-cost competitors. The board cited antitrust issues and “an unacceptable level of closing risk” to its shareholders as its reasons for rejecting the JetBlue bid. </p><p id=\"4if2oY\">But JetBlue is still intent on acquiring Spirit, whether it wants to go ahead with the deal or not. The airline has said that absorbing Spirit would allow it to better compete with the “Big Four” carriers by increasing the size of its fleet and roster of trained pilots. </p><div class=\"c-float-right\"><aside id=\"M8ch8a\"><q>JetBlue is still intent on acquiring Spirit whether it wants to go ahead with the deal or not</q></aside></div><p id=\"s6xCuk\">“JetBlue offers more value — a significant premium in cash — more certainty, and more benefits for all stakeholders,” JetBlue CEO Robin Hayes said in a statement. “Frontier offers less value, more risk, no divestiture commitments, and no reverse break-up fee, despite more overlap on non-stop routes and their own regulatory challenges.”</p><p id=\"OL3aiv\">JetBlue is urging Spirit shareholders to vote against the Frontier deal. The company also said it remains open to a “consensual transaction at $33” but will proceed with its hostile takeover in the meantime. Either combination would create the fifth largest airline in the US. </p><p id=\"cs049P\">Spirit’s reference to antitrust concerns relates to JetBlue’s involvement with American Airlines since 2000 under the umbrella of the North American Alliance (NEA), an initiative to combine services in New York City and Boston. The NEA aims to make it <a href=\"https://news.aa.com/news/news-details/2021/American-Airlines-and-JetBlues-Northeast-Alliance-Will-Give-Customers-Access-to-the-Largest-Flight-Schedule-on-the-Most-Connected-Network-in-2022-NET-RTS-11/\">easier for passengers</a> to board connecting flights from either airline and is supposed to bring more routes to both cities. </p><p id=\"THHZYw\">While both companies claim the NEA increases competition, the Department of Justice <a href=\"https://www.justice.gov/opa/pr/justice-department-sues-block-unprecedented-domestic-alliance-between-american-airlines-and\">filed an antitrust complaint</a> against the alliance last September 2021, stating it “will not only eliminate important competition in these cities, but will also harm air travelers across the country by significantly diminishing JetBlue’s incentive to compete with American elsewhere, further consolidating an already highly concentrated industry.”</p><p id=\"d4TqdI\">JetBlue calls Spirit’s antitrust concerns “a smokescreen to distract from the fact that its merger with Frontier faces similar regulatory risk, yet offers no shareholder protections.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HKjnL8BCXzw0wuYnCgDFyDMEFNU=/0x89:2000x1136/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23470914/1217657907.jpg",
  "description": "JetBlue calls Spirit’s antitrust concerns a \"smokescreen.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}