{
  "title": "Joe Biden invokes Defense Production Act for EV batteries and clean energy",
  "url": "https://www.theverge.com/2022/3/31/22996690/joe-biden-defense-production-act-ev-batteries",
  "date": "2022-03-31T15:49:55.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"President Biden Announces Ban Of Russian Oil Imports Amid War In Ukraine\" src=\"https://cdn.vox-cdn.com/thumbor/XjvgdiXiXFSj04f8pGXt9mCjf4E=/0x0:3744x2496/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70694288/1383091481.0.jpg\" />        <figcaption>WASHINGTON, DC - MARCH 08: U.S. President Joe Biden speaks in the Roosevelt Room of the White House March 8, 2022 in Washington, DC. During his remarks, Biden announced a full ban on imports of Russian oil and energy products as an additional step in holding Russia accountable for its invasion of Ukraine. | Photo by Win McNamee/Getty Images</figcaption>    </figure>  <p id=\"3rcgFB\">The Biden administration plans to use the Defense Production Act (DPA) to ramp up the mining and processing of key minerals used in batteries for renewable energy and electric vehicles. That could include nickel, lithium, cobalt, graphite, and manganese, according to the <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/03/31/fact-sheet-president-bidens-plan-to-respond-to-putins-price-hike-at-the-pump/\">White House fact sheet.</a></p><p id=\"qfaE0l\">“The President is also reviewing potential further uses of DPA – in addition to minerals and materials, to secure safer, cleaner, and more resilient energy for America,” the fact sheet says. </p><div class=\"c-float-right\"><aside id=\"IV96Vc\"><q> That could include nickel, lithium, cobalt, graphite, and manganese</q></aside></div><p id=\"PdgFNz\">Biden made the announcement as part of a broader set of actions aimed at addressing soaring energy prices. The move is also part of an immediate pivot away from Russian imports since Vladimir Putin’s invasion of Ukraine. And it serves the Biden administration’s long-term <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/22/fact-sheet-president-biden-sets-2030-greenhouse-gas-pollution-reduction-target-aimed-at-creating-good-paying-union-jobs-and-securing-u-s-leadership-on-clean-energy-technologies/\">climate goals</a> of slashing greenhouse gas emissions this decade and achieving a clean power grid by 2035. </p><p id=\"AeHSBi\">The Defense Production Act allows the president to respond to a national emergency by requiring that companies prioritize federal contracts for whatever goods or materials it deems necessary. Biden has already invoked the act to <a href=\"https://www.theverge.com/2021/1/21/22242472/biden-defense-production-act-covid-vaccine-mask\">respond to the COVID-19 pandemic</a> with masks, tests, and vaccines.</p><p id=\"DBx4lp\">This time, the act prioritizes the production of materials for batteries that are essential for cleaning up two of the biggest sources of climate pollution: transportation and the power grid. Batteries made with things like lithium and nickel power electric vehicles and store wind and solar energy. </p><p id=\"l48wfD\">Securing nickel in particular has become a bigger headache since Russia’s invasion of Ukraine. Earlier this year, the US added nickel to its official list of <a href=\"https://www.usgs.gov/news/national-news-release/us-geological-survey-releases-2022-list-critical-minerals\">critical minerals</a>. High-purity nickel is a key component of rechargeable batteries, and about 20 percent of the world’s nickel supply <a href=\"https://www.wsj.com/articles/russia-can-hold-nickel-hostage-metals-mining-environment-china-class-domestic-electric-vehicles-11647287911\">comes from Russia</a>. The US has one high-grade nickel mine operating in Michigan that could run out of deposits by 2025, <a href=\"https://www.wsj.com/articles/russia-can-hold-nickel-hostage-metals-mining-environment-china-class-domestic-electric-vehicles-11647287911\"><em>The Wall Street Journal</em></a> reports.</p><p id=\"a4uPK3\">But proposals to tap new deposits of nickel and other minerals deemed critical for the nation’s energy security and climate goals have some advocates on alert. “More than a century of reckless mining has poisoned the air, water, and land of too many communities, many of them Indigenous,” Lauren Pagel, policy director of the nonprofit Earthworks, said in a <a href=\"https://www.commondreams.org/newswire/2022/03/24/clean-energy-cannot-be-built-dirty-mining#:~:text=Quote%20from%20Lauren%20Pagel%2C%20Earthworks%20Policy%20Director%3A&amp;text=More%20than%20a%20century%20of,to%20ramp%20up%20new%20mining.\">press release</a>.</p><div class=\"c-float-left\"><aside id=\"hjDBT5\"><q>“The clean energy transition cannot be built on dirty mining.”</q></aside></div><p id=\"BhsBhi\">“The clean energy transition cannot be built on dirty mining. Expanding mining without addressing the shortcomings of our archaic mining laws would be disastrous,” Pagel said. To minimize environmental damage and prevent further injustices, the Department of Interior <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/02/22/fact-sheet-securing-a-made-in-america-supply-chain-for-critical-minerals/\">announced</a> in February that it plans to update mining laws that haven’t changed much since the late 1800s.</p><p id=\"DcryYw\">Some lawmakers and advocacy groups have urged Biden to use the Defense Production Act to promote more technologies that support a transition to clean energy. Over 200 environmental and humanitarian groups sent a <a href=\"https://www.stand.earth/BidenDPASignOn\">letter</a> to Joe Biden on March 9th, asking him to invoke the Defense Production Act to boost the production and deployment of renewable energy technologies.</p><p id=\"NwKWo7\">Democratic senators, including Elizabeth Warren, Cory Booker, and Ed Markey, sent a <a href=\"https://www.markey.senate.gov/imo/media/doc/202203.23executiveactionsoneecleantechletter.pdf\">letter</a> to Biden on March 23rd suggesting the US harness the Defense Production Act to “support and increase manufacturing capacity and supply chain security for technologies that reduce fossil fuel demand.” That letter emphasized manufacturing electric heat pumps in particular for the US and Europe. Electric heat pumps could cut down the need for gas and oil to heat buildings. Biden has already <a href=\"https://www.whitehouse.gov/briefing-room/press-briefings/2022/03/08/background-press-call-on-announcement-of-u-s-ban-on-imports-of-russian-oil-liquefied-natural-gas-and-coal/\">banned</a> oil and gas imports from Russia. The EU, which is far more reliant on fossil fuels from Russia than the US, plans to deploy 10 million heat pumps over the next five years as part of an <a href=\"https://www.theverge.com/2022/3/8/22967244/european-union-russia-clean-energy-transition-gas\">effort to cut down Russian gas imports</a>.</p><p id=\"LP8r6X\">“Due to the humanitarian, energy, and economic crises caused by Russia’s invasion of Ukraine, we urge you to use all the tools and authority at your disposal to provide relief to our residents and allies and take preemptive steps to limit future instability caused by climate change and conflict funded by fossil fuel profits,” the senators wrote.</p><p id=\"XTTYWb\"><a href=\"https://www.theverge.com/22785274/clean-renewable-energy-supply-chain-crisis-climate-mining-manufacturing\">Securing supply chains</a> for metals and critical minerals was already a <a href=\"https://www.theverge.com/2021/5/5/22421081/critical-minerals-climate-change-goals-clean-energy\">top priority</a> for clean energy advocates before the war in Ukraine stoked even greater concern. Lithium, cobalt, and nickel are needed to build batteries. Wind turbines need rare earth elements and aluminum. Solar panels are built with copper, silicon, and silver, to name a few crucial building blocks. </p><p id=\"vPU9TQ\">The problem is that the mining and processing of these materials are often concentrated in a handful of countries, including some where conflict and alleged human rights abuses have <a href=\"https://www.theverge.com/22858437/2021-mining-critical-minerals-clean-energy-renewables-climate-change\">tainted supply chains</a>. That’s all added pressure on the Biden administration to shore up domestic supply chains, whether that’s through mining or better recycling of these materials. </p><p id=\"8hl1U2\">Biden’s actions today also boost oil and gas, at least in the short term. Biden announced the largest ever release of oil from the US’s Strategic Petroleum Reserve after blocking Russian fossil fuel imports earlier this month. He is also pushing for more domestic oil production, the White House says, to alleviate sky-high prices at gas pumps. Biden plans to ask Congress to make fossil fuel companies pay fees on wells that “they are hoarding without producing,” according to the fact sheet. The US has also increased its exports of liquified natural gas to Europe as the <a href=\"https://www.theverge.com/2022/3/8/22967244/european-union-russia-clean-energy-transition-gas\">EU tries to wean itself off</a> its dependence on Russian energy products. </p><aside id=\"Oq2UES\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Clean energy faces its own supply chain crisis \",\"url\":\"https://www.theverge.com/22785274/clean-renewable-energy-supply-chain-crisis-climate-mining-manufacturing\"}]}'></div></aside><aside id=\"5ZqxWz\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"2021 was the year clean energy finally faced its mining problem \",\"url\":\"https://www.theverge.com/22858437/2021-mining-critical-minerals-clean-energy-renewables-climate-change\"}]}'></div></aside><aside id=\"Q3O5sy\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"New climate goals are going to need a lot more minerals \",\"url\":\"https://www.theverge.com/2021/5/5/22421081/critical-minerals-climate-change-goals-clean-energy\"}]}'></div></aside><p id=\"RyBKHC\"></p><p id=\"5RWyG1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_xUvkChIFwIWU78j7ecq_y9CdWY=/0x268:3744x2228/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23345874/1383091481.jpg",
  "description": "The US wants to get its hands on more nickel, lithium",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}