{
  "title": "Judge dismisses Donald Trump’s Twitter ban lawsuit",
  "url": "https://www.theverge.com/2022/5/6/23060642/california-judge-dismisses-trump-twitter-ban-lawsuit-first-amendment-section-230",
  "date": "2022-05-06T22:14:06.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GHnRft_UfO4n09V0MZKzuPtt-s0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70841611/mdoying_180117_2249_twitter_0255stills.0.jpg\" />        <figcaption>Illustration by Michele Doying / The Verge</figcaption>    </figure>  <p id=\"vDaO0F\">A district judge in California has dismissed Donald Trump’s lawsuit against Twitter, saying the former president’s <a href=\"https://www.theverge.com/2021/1/8/22218753/twitter-bans-trump-permanently-realdonaldtrump\">2021 ban from the platform</a> appears entirely legal. <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.387133/gov.uscourts.cand.387133.165.0_6.pdf\">The order</a>, handed down today, gives Trump and a group of other banned users until May 27th to file an amended complaint.</p><p id=\"sVzdeU\">But while it leaves the door open for an appeal, the order is highly critical of the lawsuit’s claims — suggesting any amended version will face an uphill battle. In particular, the order dismisses Trump’s claims that Twitter violated the First Amendment and rejects a claim that Section 230 of the Communications Decency Act is unconstitutional. </p><p id=\"fVeWN9\">“Plaintiffs are not starting from a position of strength,” Judge James Donato notes in the first paragraph of his analysis. For Trump and his fellow Twitter exiles, it doesn’t get any better from there.</p><p id=\"SGbYU5\">Trump <a href=\"https://www.theverge.com/2021/7/7/22566729/trump-lawsuit-facebook-twitter-google-social-media-censorship\">filed the suit in Florida</a> last year, but it was later moved to Twitter’s home state of California, as were similar suits against YouTube and Meta (then Facebook). Trump failed in <a href=\"https://www.theverge.com/2021/10/2/22705584/trump-sues-reinstate-twitter-account-jan-6-riot-protest\">an early attempt</a> to make Twitter restore his account as the trial proceeded, and filed an amended complaint attempting to strengthen his case.</p><div class=\"c-float-right\"><aside id=\"CD4FqN\"><q>“There is nothing cagey or misleading about these provisions.”</q></aside></div><p id=\"rHrYKI\">But Judge Donato determined that Twitter was not operating as a state actor when it banned Trump — a claim Trump made by noting that some lawmakers had called on Twitter to remove him from the platform. </p><p id=\"07iFfa\">“Legislators are perfectly free to express opinions without being deemed the official voice of ‘the State,’” the ruling says, dismissing a “grab bag” of allegations quoting various Democratic elected officials calling for a ban. Even strident congressional commentary, it concludes, “fits within the normal boundaries of a congressional investigation, as opposed to threats of punitive state action.”</p><p id=\"8l5IXY\">The Section 230 claim failed because Trump and his co-plaintiffs hadn’t demonstrated any connection between the law and their ban. They likewise couldn’t convince the judge to apply a Florida-based deceptive trade practices rule in California court, and the order concludes Twitter probably didn’t violate it, either. “The [terms of service] expressly states that Twitter may suspend or terminate an account ‘at any time for any or no reason,’” Judge Donato notes. “It also states that Twitter may remove or refuse to distribute any content. There is nothing cagey or misleading about these provisions.”</p><p id=\"vVRFmq\">Trump wasn’t any more successful trying to apply Florida’s Stop Social Media Censorship Act, a rule that’s <a href=\"https://www.theverge.com/2021/6/30/22558086/florida-social-media-theme-park-law-preliminary-injunction-lawsuit\">currently tied up in courts</a> anyway.</p><p id=\"s4Y9eh\">Trump can’t add new claims to an amended filing, and barring a dramatic shift in the judge’s reasoning, the final decision will look a lot like this one. Twitter could still voluntarily restore Trump’s account — and <a href=\"https://www.theverge.com/23026874/elon-musk-twitter-buyout-news-updates\">after its upcoming purchase</a> by billionaire Elon Musk, it’s a plausible outcome. But the case continues a <a href=\"https://www.theverge.com/2020/5/27/21272066/social-media-bias-laura-loomer-larry-klayman-twitter-google-facebook-loss\">long string of legal failures</a> for people who sue social networks for banning them.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MLg-KJOHltjonYlTNrO70mmmnro=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10456869/mdoying_180117_2249_twitter_0255stills.jpg",
  "description": "Trump gets one more shot at amending the complaint.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}