{
  "title": "Judge orders Amazon to reinstate warehouse worker unlawfully fired over safety protests",
  "url": "https://www.theverge.com/2022/4/19/23031665/amazon-warehouse-worker-gerald-bryson-jfk8-reinstate-job-protest-safety",
  "date": "2022-04-19T10:11:05.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/C-MZUFxB-6yTdWOvG8vkZXpEfcc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70765676/ngarun_181114_1777_amazon_0001.0.jpg\" />        <figcaption>Photo by Natt Garun / The Verge</figcaption>    </figure>  <p id=\"mBlF7s\">Amazon has been <a href=\"https://www.nlrb.gov/case/29-CA-261755\">ordered</a> to reinstate an employee unlawfully fired by the company two years ago for his involvement in safety protests at a Staten Island warehouse. </p><p id=\"sDIYob\">Gerald Bryson was protesting outside the Amazon facility known as JFK8 on April 6th 2020, when he got into an argument with an employee on a break. Court filings (which include transcripts of the incident taken from videos as appendixes B and C) show that both Bryson and the employee used profanities and insults against one another. Bryson said Amazon should shut down the warehouse for failing to adequately protect workers against COVID-19, while the employee replied “it’s the only fucking job open so appreciate it.”</p><div class=\"c-float-right\"><aside id=\"qjXDH8\"><q>Amazon fired Bryson for abusive language, but not the other party in the dispute</q></aside></div><p id=\"MvAPKx\">Amazon investigated the incident and fired Bryson for violating the company’s policy against using “abusive, vulgar, or harassing language,” while giving the other worker a written warning.</p><p id=\"7PHx3l\">In March, the National Labor Relations Board (NLRB) <a href=\"https://www.theverge.com/2022/3/17/22983692/nlrb-amazon-labor-activism-gerald-bryson-jfk8-warehouse-injunction\">took up Bryson’s case</a>, arguing that he was actually fired as retaliation for protesting safety conditions. On Monday, administrative law judge Benjamin W. Green <a href=\"https://www.nlrb.gov/case/29-CA-261755\">agreed with this analysis</a>, ruling that Amazon had “unlawfully discharged” Bryson, and must reinstate his job as well as pay him two years’ lost earnings. </p><p id=\"pGq6H0\">Looking at the evidence submitted by both sides, Green said there was “considerable evidence that [Amazon’s] stated reason for discharging Bryson was mere pretext.” Amazon conducted a “skewed investigation” into the incident, said Green, interviewing selective sources, and issuing a biased judgement — firing Bryson and not the other employee, even though, said Green, Amazon didn’t show how the pair’s conduct was “meaningfully different.”</p><p id=\"U0wKmM\">Details from the dispute include Bryson being told to “go back to the Bronx.” Green notes in his summary: “Bryson could reasonably construe the comment as racial since he is African-American and might question why, other than his race, someone would assume he is from the Bronx.”</p><p id=\"osbJq0\">Amazon says it will appeal the decision, with spokesperson Kelly Nantel <a href=\"https://apnews.com/article/covid-health-business-national-labor-relations-board-new-york-city-a3c0e9ed9119e4bcc1fbe51e77a93254\">telling <em>APNews</em></a>: “We strongly disagree with this ruling and are surprised the NLRB would want any employer to condone Mr. Bryson’s behavior.” But the case comes as Amazon is facing increasing resistance from employees across the US, who are organizing over pay, working conditions, and safety. The facility where Bryson was fired, JFK8, became <a href=\"https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win\">the first Amazon warehouse to unionize</a> on April 1st, while another union in Alabama is <a href=\"https://www.cnbc.com/2022/04/07/amazon-illegally-interfered-in-alabama-warehouse-vote-union-alleges.html\">currently in contention</a>. </p><p id=\"byaMqE\">Bryson <a href=\"https://www.nytimes.com/2022/04/18/business/amazon-protest-firing-ruling.html?\">told <em>The New York Times</em></a> on Monday that his victory would rally Amazon employees eager to unionize. “For me to win and walk back through those doors changes everything,” said Bryson. “It will show that Amazon can be beat. It will show you have to fight for what you believe in.”</p><p id=\"UfT76R\">You can read the ruling from judge Green in full below:</p><div id=\"Uu1t4T\"><iframe src=\"https://embed.documentcloud.org/documents/21649345-amazon-nlrb-gerald-bryson-re-instatement/?embed=1&amp;responsive=1&amp;title=1\" title=\"Amazon NLRB Gerald Bryson Re-instatement (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/EA9kBosXnS2HSu51GeC4LRNtuW0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13442905/ngarun_181114_1777_amazon_0001.jpg",
  "description": "Amazon is appealing the decision",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}