{
  "title": "Judge orders the release of alleged Bitcoin launderer Razzlekhan on bail  ",
  "url": "https://www.theverge.com/2022/2/14/22933904/razzlekhan-heather-morgan-bail-hearing-dc-bitcoin-bitfinex",
  "date": "2022-02-15T01:40:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zhFqRKdI1qKywvPk0CBEgcnjiUU=/236x0:2645x1606/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70509726/Screen_Shot_2022_02_14_at_16.47.45.0.png\" />        <figcaption><em>Heather Morgan will have to follow several conditions while awaiting trial.</em> | Image: Razzlekhan</figcaption>    </figure>  <p id=\"w3GoGE\">On Monday, a judge ruled that Heather Morgan, aka Razzlekhan, should be released on bail after she and her husband <a href=\"https://www.theverge.com/2022/2/8/22923772/doj-irs-bitfinex-hack-bitcoin-recovery-encrypted-files-razzlekhan\">were arrested</a> for allegedly helping to launder billions of dollars worth of stolen Bitcoin. Morgan and her husband Ilya “Dutch” Lichtenstein were already granted bail last week by another judge, but the government got an emergency stay on the previous order, saying that the couple could potentially use millions of dollars worth of un-seized Bitcoin to flee the country. </p><p id=\"AU8soY\">Monday’s hearing took place to review the release order and consider further prosecution and defense evidence. You can read both of the written arguments below, which largely reflect what the parties argued in court. The presiding judge decided that Morgan could await her trial at home if she made bail, but she didn’t overturn the stay for Lichtenstein, meaning that he would stay in custody. </p><div class=\"c-float-right\"><aside id=\"mIDFEK\"><q>The government claims the couple still has access to substantial funds</q></aside></div><p id=\"4q6WeT\">The couple was arrested on allegations that they tried to launder some of the 119,754 Bitcoin stolen in the 2016 Bitfinex hack. While the government seized most of that crypto (worth around $3.6 billion last week), it claims in court documents that there are still millions of dollars worth that it hasn’t been able to get its hands on yet. It also says that the couple purchased 70 gold coins with funds linked to the attack, which it didn’t find while searching the couple’s apartment (it did discover empty hollowed-out books, a bag of burner phones, and several hardware cryptocurrency wallets).</p><aside id=\"bxtreB\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"What I learned from the words and rhymes of alleged Bitcoin launderer Razzlekhan\",\"url\":\"https://www.theverge.com/22924237/razzlekhan-bitfinex-hack-laundering-bitcoin-explained-rapper-heather-morgan\"}]}'></div></aside><p id=\"yceeXO\">Following her arrest, Morgan <a href=\"https://www.theverge.com/22924237/razzlekhan-bitfinex-hack-laundering-bitcoin-explained-rapper-heather-morgan\">got a lot of attention on social media</a> after it was discovered that she’d been posting rap music, videos, and fashion content under the name Razzlekhan. Clips of particularly cringe-worthy moments from her music videos have been shared online since the news of her arrest, alongside incredulous comments that the person rapping about being the “Crocodile of Wall Street” was involved with the Bitfinex hack. </p><p id=\"Uc6s31\">During Monday’s hearing, the government argued that Morgan and Lichtenstein could use the un-seized funds or gold to escape to a country that wouldn’t be particularly willing to extradite them, such as Russia or Ukraine (Lichtenstein was born in Russia and renewed his passport in 2019, according to the government). It also argued that they’d be motivated to do so, given that they could face substantial financial penalties and 25 years in prison if convicted of fraud and money laundering. </p><p id=\"42iZYl\">The couple’s lawyer argued that they were unlikely to flee for several reasons — Morgan is currently recovering from surgery, and both her and Lichtenstein’s parents had posted their houses as collateral for their bail. He also argued that if they had wanted to flee, they would’ve done so in the week or two leading up to the arrest, asserting they would’ve realized the government was on to them after receiving notice of a subpoena from an ISP, and seeing the funds seized. The prosecution responded by saying that it was very unlikely the couple realized how much evidence the government had until they were arrested, given that much of it was obtained by cracking encrypted files Lichtenstein had stored on a cloud service.</p><p id=\"DDjEDD\">The judge said that Lichtenstein wouldn’t be granted bail because the government’s evidence alleges he was largely in control of the funds — Morgan, she reasoned, was less likely to have access to funds that would help her escape. She said that Morgan would have to follow the conditions outlined in the original release order, which include house arrest, an ankle bracelet for location monitoring, restrictions on computer use, and a ban on carrying out cryptocurrency transactions. </p><p id=\"BMyJXs\"><em>The argument for why Lichtenstein and Morgan should be allowed bail, prepared by their lawyers</em></p><div id=\"PM3GcL\"><iframe src=\"https://embed.documentcloud.org/documents/21208566-opposition-to-stay-of-release-for-lichtenstein-and-morgan/?embed=1&amp;responsive=1&amp;title=1\" title=\"Opposition to stay of release for Lichtenstein and Morgan (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div><p id=\"OnMGBl\"><em>The government’s argument why Lichtenstein and Morgan shouldn’t be allowed bail</em></p><div id=\"bcbQjK\"><iframe src=\"https://embed.documentcloud.org/documents/21208567-argument-for-lichtenstein-and-morgan-stay-of-release/?embed=1&amp;responsive=1&amp;title=1\" title=\"Argument for Lichtenstein and Morgan stay of release (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/7I1SALi3puYVthkOyH0PNov3Bko=/0x49:2880x1557/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23242219/Screen_Shot_2022_02_14_at_16.47.45.png",
  "description": "Heather Morgan is allegedly a rapper and a crypto criminal",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}