{
  "title": "Justin Bieber’s NFT ape sure looks like monkey business",
  "url": "https://www.theverge.com/2022/2/10/22926057/celebrity-nft-disclosure-marketing-reese-witherspoon-gwyneth-paltrow",
  "date": "2022-02-10T14:45:00.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/witKZdZSFm3u5ZVXnD9Fi5bQuoQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70492722/acastro_211115_4866_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>Inside the weird world of celebrity NFTs</p> <p class=\"p--has-dropcap p-large-text\" id=\"BQFUL3\">Famous people have <a href=\"https://www.washingtonpost.com/arts-entertainment/2022/02/04/celebrities-cryptocurrency-nfts/\">embraced the NFT world lately,</a> and for those of us who grew up reading women’s magazines — and thus know that celebs get an <a href=\"https://blog.hollywoodbranded.com/dismissing-the-celebrity-swag-bag-opportunity\"><em>awful lot of free swag</em></a> — naturally, the first question is: did they really pay for those Bored Apes?</p><p id=\"mhaHH7\">If a celebrity gets an NFT for free, the most likely motive is that they’re getting it to create buzz, driving up demand for that project through the endorsement. The question then becomes: what forms of celebrity shilling are legal? And uh, what exactly is going on with Justin Bieber’s Bored Ape?</p><p id=\"zkCeNm\">Let’s start simple. Take Gwyneth Paltrow, whose <a href=\"https://twitter.com/GwynethPaltrow/status/1489619084786290688\">new profile pic is an NFT</a> from the Flower Girl collection. Now, an endorsement from Paltrow is big business — it’s part of how she shaped Goop as a lifestyle brand. Liking something, buying it, and showing it off? Legal.</p><div class=\"c-float-right c-float-hang\"><aside id=\"QaO46R\"><q>What forms of celebrity shilling are legal? </q></aside></div><p id=\"QQJ71I\">But cryptocurrency is very public in a way the rest of the Goop brand is not. In order for Paltrow’s NFT profile picture to be displayed, her Twitter account has to be associated with a specific wallet. Clicking on her avatar will show you the <a href=\"https://etherscan.io/address/0x2efa07cac3395599db83035d196f2a0e7263f766\">NFT’s contract address on Etherscan</a>, through which you can figure out her wallet address. And one quirk of cryptocurrency wallets is that it’s possible to “airdrop” stuff into any known wallet without the owner’s involvement. Airdrops are <a href=\"https://www.coindesk.com/learn/what-is-a-crypto-airdrop/\">an important part of marketing cryptocurrency projects</a> and are commonly used to build a user base.</p><p id=\"IidvQt\">So once Paltrow’s wallet is known, it’s simple for any NFT project to airdrop NFTs into the wallet. If she gets one she likes and wants to use it as her new avatar, does she have to disclose that she got it for free?</p><p id=\"4l5zW9\">Because celebrity marketing is so powerful, the FTC has come up with a series of regulations around influencer endorsements on social media platforms. The onus is on the poster to disclose that they received something as a promotional consideration or that they are getting paid to advertise a product. Any financial, personal, employment, or family relationship must be disclosed <a href=\"https://www.ftc.gov/system/files/documents/plain-language/1001a-influencer-guide-508_1.pdf\">under these guidelines</a>.</p><p id=\"XBjvqo\">So I emailed the FTC to ask what that might mean for airdrops. While FTC spokesperson Juliana Gruenwald said the agency can’t comment on any specific celebrity or scenario, there’s a general principle at play: if consumers might be unaware of a connection between a marketer and a celebrity, that should be disclosed. “So the relevant questions include whether the celebrity is actually endorsing a product or service on behalf of a marketer, whether any connection is expected by the endorser’s followers, and would knowing about the connection affect what the followers think about the endorsement,” she wrote in an emailed statement.</p><div><aside id=\"EkZ0Qz\"><q>“A celebrity could receive an NFT for their birthday and have no connection between them and a marketer of NFTs.”</q></aside></div><p id=\"6FVPB5\">A scenario where a celebrity doesn’t need to disclose might be, for instance, an ad: you don’t have to be a genius to figure out Matt Damon got paid to <a href=\"https://www.youtube.com/watch?v=9hBC5TVdYT8\">compare trading cryptocurrency to the Wright Brothers building an airplane</a> for Crypto.com. But receiving something for free is murkier: “A celebrity could receive an NFT for their birthday and have no connection between them and a marketer of NFTs,” Gruenwald notes. Disclosures are required when a person receives payment, a gift of the product endorsed, or an in-kind payment in exchange for the endorsement.</p><p id=\"PGZ1ki\">So if I had an NFT project to promote, it might be worth my time to airdrop gifts to celebrities, on the off chance one of them likes it and talks about it. That doesn’t seem to be a violation of FTC guidelines, any more than swag bags at award shows are. But it does make it harder for a consumer to tell who they can trust.</p><p id=\"IoiARR\">Let’s be honest: celebrities exist to market things, and that’s why they were invented by 20th century Hollywood. They’re useful in the business world, too. Financial vehicles called special purpose acquisition companies, or <a href=\"https://www.nytimes.com/2021/02/27/style/SPACS-celebrity-craze.html\">SPACs, have featured celebrity sponsors</a>, such as the Golden State Warriors’ Steph Curry, Hall of Fame basketball player Shaquille O’Neal, former Speaker of the House Paul Ryan, and Billy Beane of <em>Moneyball</em> fame. Celebrities make it easier to fundraise and get media attention. This is as true of NFTs as anything else.</p><p id=\"9CTetu\">In fact, it may be even more true of NFTs than of anything else. That’s because NFT projects, when they are successful, hinge on the promise of a community, and celebrities usually come with a fandom in tow.</p><div class=\"c-float-left c-float-hang\"><aside id=\"vnbHuP\"><q>Murky financial relationships go hand in hand with the celebrity marketing machine</q></aside></div><p id=\"rsigjk\">We’ve seen a spattering of celebrity interest in NFTs: Brie Larson <a href=\"https://www.justjared.com/2022/02/06/brie-larson-called-out-by-fans-after-purchasing-an-nft/\">owns a Flower Girl NFT</a>, for instance. Also in the space: <a href=\"https://www.coindesk.com/markets/2021/04/16/im-obsessed-paris-hilton-on-nfts-empowering-female-creators-and-the-future-of-art/\">Paris Hilton</a>, <a href=\"https://www.polygon.com/22904893/nft-explainer-why-celebrities-buy-bored-ape-yacht-club-jimmy-fallon-paris-hilton\">Jimmy Kimmel</a>, <a href=\"https://www.hollywoodreporter.com/business/business-news/logan-paul-investment-endeavors-pokemon-cards-1235044945/\">Logan Paul</a>, and <a href=\"https://fortune.com/2022/01/03/eminem-nft-bored-ape-yacht-club/\">Eminem</a>. I don’t mean to suggest these people aren’t excited about NFTs. In fact, I expect they are. The best celebrity marketing occurs when said celebrity <em>actually likes something</em> — this was, after all, the point of <a href=\"https://www.oprahdaily.com/life/a38004111/oprah-favorite-things-2021/\">Oprah’s favorite things</a>. </p><p id=\"2Z2Oyt\">While it’s possible to trace transactions on the blockchain, this is only partial information about the provenance of a celebrity’s NFT. Much more human interaction takes place off-chain, and there’s a small army of people orbiting the A-listers — their agents, hairdressers, personal assistants, and so on. A lot of people make their money on celebrity, one way or another, and there are even professional organizations devoted to this specific niche. These relationships are important because the inner circle has the celebrity’s ear, but we as the public have no idea what’s being said.</p><p id=\"aSKnGK\">That means murky financial relationships go hand in hand with the celebrity marketing machine. As Max Read points out, a lot of celebrities in the NFT world are <a href=\"https://maxread.substack.com/p/mapping-the-celebrity-nft-complex\">connected to Creative Artists Agency (CAA</a>), a huge talent agency. As a practical matter, I think it’s unlikely that any A-list celebrity exists without a first- or second-degree connection to CAA, period. So this web of connections may not be <em>that </em>meaningful.</p><div class=\"c-float-right c-float-hang\"><aside id=\"2uz1Xs\"><q>These kinds of connections don’t really fall under the FTC’s purview</q></aside></div><p id=\"cBY6Qh\">Let’s say there is at least one person at CAA who is enthusiastic about NFTs, which would explain the investment. That person may very well have had dinner with some celebrity clients and excitedly talked about their new hobby of NFT collecting, leading to the celebrities themselves deciding to take up a new hobby, too. This isn’t the same thing as CAA deploying celebrities to talk up its investment — something that would likely require disclosure.</p><p id=\"KaEFOi\">For instance: When investor Katie Haun, then of a16z crypto (and now striking out on her own), <a href=\"https://fortune.com/longform/katie-haun-crypto-fund/\">had dinner with a bunch of women in entertainment,</a> it didn’t take place on the blockchain. Had it not been reported by <em>Fortune</em>, I wouldn’t know about it at all. That single dinner was enough to get Mindy Kaling and, apparently, Paltrow into NFTs. </p><p id=\"vPq49d\">These kinds of connections don’t really fall under the FTC’s purview, even though the results can be lucrative. A celebrity NFT owner can make projects more valuable simply by associating themselves with the project — for instance, Reese Witherspoon endorsed the World of Women NFT project in October. In January, the project generated more than <a href=\"https://www.rollingstone.com/culture/culture-news/world-of-women-nfts-reese-witherspoon-1283724/\">$40 million in just two weeks</a>, partly because of celebrity sales.</p><p id=\"e44Pdm\">A <a href=\"https://dirtybubblemedia.substack.com/p/who-paid-for-reese-witherspoons-nft\">transaction map</a> of the wallet associated with Witherspoon’s NFTs shows a complex funding web. Links between other wallets that, in turn, funded Witherspoon’s wallet suggest an entity that’s got access to at least $180 million in on-chain assets. The person who made the map has suggested that Witherspoon is in violation of FTC disclosure guidelines. That’s possible, but I’m not entirely convinced.</p><div><aside id=\"ZyfizP\"><q>One of the downsides of being a celebrity is that people like to snoop</q></aside></div><p id=\"YQPSqR\">There’s another explanation for this map of transactions, which doesn’t involve an FTC violation. This may be an attempt to preserve Witherspoon’s financial privacy on a public blockchain since one of the downsides of being a celebrity is that people like to snoop. If Witherspoon is using a service to try to anonymize some of her transactions — the same way many celebrities <a href=\"https://money.cnn.com/2016/05/11/news/emma-watson-panama-papers-offshore-company/index.html\">buy houses using shell companies</a> — she may not need to disclose it. But the web of transactions itself isn’t enough to definitively say what’s going on.</p><p id=\"8z9vRR\">There’s one service I thought of instantly: MoonPay, which has been used by Snoop Dogg, Diplo, and Jimmy Fallon. Witherspoon isn’t a MoonPay customer, says spokesperson Justin Hamilton, so there goes that possible explanation for Witherspoon’s strange transaction map. </p><p id=\"vbfguD\">But it can explain bizarro transactions for other celebrities since MoonPay <em>has </em>been used by <a href=\"https://decrypt.co/86135/biggest-celebrity-nft-owners-bored-ape-yacht-club\">a number of celebrities</a>, including Paltrow, to bypass the fiddly parts of buying NFTs. Hamilton says MoonPay’s celeb service grew out of CEO Ivan Soto-Wright’s social circle. Soto-Wright had been getting calls from famous friends, asking for help in getting into the NFT space, like a C-suite customer service rep. (Soto-Wright’s attitude toward it was, “This is cool, but this is not scalable.”) So the company — which is primarily a b2b connection between fiat currency and cryptocurrency —  built a consumer-facing service.</p><div class=\"c-float-left c-float-hang\"><aside id=\"zNGPKV\"><q>The payment took place outside of the blockchain record because it was made in the almighty dollar, baby</q></aside></div><p id=\"oLGA4x\">MoonPay’s concierge service isn’t for people who are already comfortable in the cryptocurrency ecosystem. It’s for people just dipping their toes in. So a user tells MoonPay what asset they want. MoonPay buys it, helps the customer set up their own wallet, does the know-your-customer and anti-money-laundering compliance, then drops the asset into the customer’s wallet. Then, they bill the customer in fiat. That’s the big deal for customers and part of MoonPay’s broader, non-consumer-focused business: letting people pay for digital assets with credit cards. </p><p id=\"HlWodo\">It also explains why some celebrity wallets seem to show that a celebrity got an NFT for free. They didn’t — but the payment took place outside of the blockchain record because it was made in the almighty dollar, baby.</p><p id=\"NmDhro\">MoonPay has made one celebrity endorsement deal: <a href=\"https://www.youtube.com/watch?v=Tc0tLGWIqxA\">a video</a> with Post Malone and The Weeknd. But all those celebs you see tweeting about the concierge service? They’re just satisfied customers, Hamilton says. And those tweets aren’t an FTC violation.</p><p id=\"V4BuVc\">Justin Bieber is another MoonPay customer. But his non-MoonPay transactions look <em>even</em> <em>weirder</em>, and I am not going to pretend I know what’s going on.</p><div class=\"c-float-right c-float-hang\"><aside id=\"Zz3XsZ\"><q>How does any of this fit into the FTC influencer endorsement framework?</q></aside></div><p id=\"dkORfC\">A Bieber-associated wallet — not his MoonPay one — bought a Bored Ape Yacht Club NFT for 500 ETH, or about $1.3 million at settlement. However, that was well above the floor price set by the seller, of 100 ETH. Bieber posted an image of the ape to his Instagram but did not say that <em>he</em> bought it. </p><p id=\"eQhYz8\">I’m pointing out Bieber’s language because I’m not sure the money came from Bieber himself. (Some people have suggested, on the same evidence I find inconclusive, <a href=\"https://dirtybubblemedia.substack.com/p/justin-bieber-bought-an-nft-for-13\">that Bieber didn’t buy his ape</a>.) The trail of transactions flows back to another wallet, which is associated with an NFT project called InBetweeners. Bieber was gifted InBetweeners NFTs in December and bought more later. It’s unclear what the relationship is between InBetweeners and Bieber. Did someone else buy Bieber a Bored Ape as a payment in kind for his <a href=\"https://www.coindesk.com/layer2/2022/01/31/nfts-celebrities-and-perverse-deal-making/\">promotional service with InBetweeners</a>? Did Bieber lean on his friends to make a transaction for him to maintain some of his financial privacy? Something else? And how does any of this fit into the FTC influencer endorsement framework?</p><p id=\"MC3n54\">Let’s say you believe what Bieber is doing isn’t legal. Outside of an FTC investigation, there’s no way to know for sure. When it comes to questionable endorsements, the means of recourse available to the average person are just about non-existent.</p><div class=\"c-float-left c-float-hang\"><aside id=\"VOeanX\"><q>What… is being endorsed here?</q></aside></div><p id=\"CiIXPA\">Look, the more I think about celebrities and NFTs, the crazier I feel. Take, for instance, the Cozimo de Medici Twitter account, which has just shy of 200,000 followers as of this writing. Last September, the account said it would reveal “<a href=\"https://twitter.com/CozomoMedici/status/1438617782585724934\">my real life celebrity status</a>” to bring more attention to NFTs. And then America’s stoner uncle, Snoop, tweeted from his own account that <em>he </em>was Cozimo de Medici, a claim that may or <a href=\"https://slate.com/technology/2021/09/snoop-dogg-nft-crypto-cozomo-medici-twitter.html\">may not be true</a>. (Both <em>Slate</em> and <em>Vice</em> claim that the Cozimo account’s tweets suggest <a href=\"https://www.vice.com/en/article/7kvnba/shocking-snoop-dogg-is-not-a-white-nft-influencer-in-italy\">Snoop isn’t Cozimo</a>.)</p><p id=\"MBYQRF\">Just for funsies, let’s assume the de Medici account is <em>not</em> Snoop. In that hypothetical scenario, yes, a deception is happening. So then what? The FTC guidelines just don’t seem to fit. The guidelines suggest that if a celebrity is endorsing something on behalf of a marketer, that relationship should be disclosed if it isn’t obvious. But for starters: what… is being endorsed here? A pseudonym? The pseudonym’s investments? Does being affiliated with a celebrity in this indirect way violate any FTC rules? <em>What exactly is going on? </em></p><p class=\"c-end-para\" id=\"pH5snm\">And this is just the celebrities, mind you. Influencers have similar networks, which are, if anything, murkier. Good luck regulating that.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9nKn-JgESItCgiXJZyDtrulIAKY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23018794/acastro_211115_4866_0001.jpg",
  "description": "And why are Justin Bieber’s transactions so weird?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}