{
  "title": "Justice Department pledges not to charge security researchers with hacking crimes",
  "url": "https://www.theverge.com/2022/5/19/23130910/justice-department-cfaa-hacking-law-guideline-limits-security-research",
  "date": "2022-05-19T17:10:35.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/L7KYvDJlgg3TfQ2Y_oIYieRvxHI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70888370/akrales_220309_4977_0232.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"Z3CxOf\">The US Department of Justice says it won’t subject “good-faith security research” to charges under anti-hacking laws, acknowledging long-standing concerns around the Computer Fraud and Abuse Act (CFAA). Prosecutors must also avoid charging people for simply violating a website’s terms of service — including minor rule-breaking like embellishing a dating profile — or using a work-related computer for personal tasks.</p><p id=\"Km8Won\">The <a href=\"https://www.justice.gov/opa/press-release/file/1507126/download\">new DOJ policy</a> attempts to allay fears about the CFAA’s <a href=\"https://www.theverge.com/2013/1/18/3888528/after-aaron-swartz-how-antiquated-computer-laws-enable-the\">broad and ambiguous scope</a> following <a href=\"https://www.theverge.com/2021/6/5/22491859/supreme-court-van-buren-cfaa-hacking-law-scope-narrowed\">a 2021 Supreme Court ruling</a> that encouraged reading the law more narrowly. The ruling warned that government prosecutors’ earlier interpretation risked criminalizing a “breathtaking amount of commonplace computer activity,” laying out several hypothetical examples that the DOJ now promises it won’t prosecute. That change is paired with a safe harbor for researchers carrying out “good-faith testing, investigation, and/or correction of a security flaw or vulnerability.” The new rules take effect immediately, replacing old guidelines <a href=\"https://www.eff.org/ru/document/doj-cfaa-charging-memo-2014\">issued in 2014</a>.</p><div class=\"c-float-right\"><aside id=\"oh3wdo\"><q>The Supreme Court accused prosecutors of criminalizing a “breathtaking amount” of computer use</q></aside></div><p id=\"tb7J0X\">“The policy clarifies that hypothetical CFAA violations that have concerned some courts and commentators are not to be charged,” <a href=\"https://www.justice.gov/opa/pr/department-justice-announces-new-policy-charging-cases-under-computer-fraud-and-abuse-act\">says a DOJ press release</a>. “Embellishing an online dating profile contrary to the terms of service of the dating website; creating fictional accounts on hiring, housing, or rental websites; using a pseudonym on a social networking site that prohibits them; checking sports scores at work; paying bills at work; or violating an access restriction contained in a term of service are not themselves sufficient to warrant federal criminal charges.”</p><p id=\"9qVbab\">These guidelines reflect a newly limited interpretation of “exceeding authorized access” to a computer, a practice criminalized by the CFAA in 1986. As <a href=\"https://www.lawfareblog.com/supreme-court-reins-cfaa-van-buren\">writer and law professor Orin Kerr explained in 2021</a>, there’s been a decades-long conflict over whether people “exceed” their access by violating any rule laid down by a network or computer owner — or if they have to access explicitly off-limits systems and information. The former interpretation has led to <a href=\"https://www.eff.org/cases/united-states-v-drew\">cases like <em>US v. Drew</em></a>, where prosecutors charged a woman for creating a fake profile on Myspace. The Supreme Court leaned toward the latter version, and now, the DOJ theoretically does, too.</p><p id=\"yw0mbz\">The policy doesn’t settle all criticisms of the CFAA, like its potential for <a href=\"https://www.theverge.com/2018/12/10/18131024/ddos-attack-telescope-forum-cfaa-prison\">disproportionately long</a> prison sentences. It doesn’t make the underlying law any less vague since it only affects how prosecutors interpret it. The DOJ also warns that the security research exception isn’t a “free pass” for probing networks. Someone who found a bug and extorted the system’s owner using that knowledge, for instance, could be charged for performing that research in bad faith. Even with these limits, though, the rulemaking is a pledge to avoid slapping punitive anti-hacking charges on anyone who uses a computer system in a way its owner doesn’t like.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tz3yGa-u28L15Qj2LEGeXC6tuO4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318435/akrales_220309_4977_0232.jpg",
  "description": "It won’t press charges against security researchers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}