{
  "title": "Keywords from hallucinogenic experiences can help find parts of the brain affected by drugs",
  "url": "https://www.theverge.com/2022/3/16/22977973/hallucinogenic-drug-testimonials-brain-regions-mental-health",
  "date": "2022-03-16T18:00:00.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pn7P6sfNHwLOZqxh9m3U_zOP4NI=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70631295/acastro_170726_1777_0008_v2.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"9OgtXK\">People have vast, spiraling experiences on psychedelic drugs, often returning from a hallucinogenic trip full of new outlooks on their life or even changes to their personality. They describe the trips with vivid, emotional language — which might be able to tell researchers what parts of their brains are reacting to the drugs.</p><p id=\"QrOdw2\">In order to figure out how and why hallucinogenics trigger certain experiences, a research team used machine learning to pull common words and phrases out of people’s testimonials about their trips. Then, in a new study published Wednesday, the researchers linked those words to the parts of the brain impacted by the drugs. </p><p id=\"5PfHhu\">It’s a different approach to studying drugs and the brain: normally, researchers looking to understand how substances map onto brain regions would ask people to take the drug before having their brain scanned. This strategy, though, focused more on how the drugs made people feel, and then worked backward to find the areas most likely to be responsible for that feeling. </p><p id=\"dFwFBL\">Efforts to use hallucinogenic drugs as psychiatric therapies have focused on their ability to achieve an experience called “ego dissolution” — a sense of detachment and loss of sense of self, which <a href=\"https://www.mic.com/life/could-killing-your-ego-with-psychedelics-be-the-key-to-mental-wellness\">advocates think</a> can help people reset their expectations and grapple with stressors. Ego dissolution has<strong> </strong>typically been associated with LSD, or acid, and psilocybin, the compound found in psychedelic mushrooms. Those drugs target a receptor in the brain called 5-HT2A.</p><p id=\"E2MJPR\">But this <a href=\"https://www.mcgill.ca/neuro/channels/news/largest-ever-psychedelics-study-maps-changes-conscious-awareness-neurotransmitter-systems-338389\">study</a>, published in the journal <em>Science Advances,</em> found that drugs working on other receptors in the brain, like the D2 receptor, were linked with similar feelings. That opens other targets for scientists or pharmaceutical companies trying to make new drugs that could try to create the same experience, or for researchers trying to understand the roots of mental health challenges. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/o2xonbCv74nsNrTHdrMAdj0Wybo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23317655/Capture.JPG\">      <cite>Image: Danilo Bzdok</cite>      <figcaption><em>Patterns in language, drugs, and receptors linked with ego dissolution.</em></figcaption>  </figure><p id=\"hH3nSL\">The analysis screened 6,850 testimonials from people who took 27 different hallucinogenic drugs — each of which was already<strong> </strong>associated with a slightly different set of interactions with receptors and regions in the brain. It pulled keywords like visuals, reality, nausea, pitch, and dancing from the testimonials to create clusters of similar experiences, then compared them to what’s known about the ways the drugs in each testimonial interacted with the brain. </p><p id=\"2zwGcT\">Along with the findings on ego dissolution, the study also identified drugs and brain receptors linked with visual and auditory experiences, fear, physical experiences, and the passage of time. It found that optical hallucinations might be linked to brain regions that aren’t typically associated with vision, for example. They also found that people’s internal clocks react different ways to different types of drugs — some stretched time out, others compressed it. </p><p id=\"ybbhBA\">People often have different reactions to taking the same drug, the authors noted in the paper. But this study, and its use of machine learning to pull out commonalities between those experiences, shows that it’s possible to identify consistent themes that might apply from person to person.</p><p id=\"sH4OI9\">“Our study provides a first step, a proof of principle that we may be able to build machine learning systems in the future that can accurately predict which neurotransmitter receptor combinations need to be stimulated to induce a specific state of conscious experience in a given person,” study author Danilo Bzdok, a researcher at the Montreal Neurological Institute-Hospital, said in a <a href=\"https://www.eurekalert.org/news-releases/946321\">statement</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0FjNG3rgLEfINMXJEFINlxYnWkY=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8937001/acastro_170726_1777_0008_v2.jpg",
  "description": "A new study used machine learning on drug testimonials.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}