{
  "title": "Kia’s all-new 2023 Niro EV is practical by design",
  "url": "https://www.theverge.com/2022/4/13/23024244/kia-2023-niro-ev-new-york-international-auto-show",
  "date": "2022-04-13T22:04:07.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2vycZoA2kO911m91M9j8OuJhTcw=/0x0:6088x4059/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70746393/18701_2023_Niro_EV.0.jpg\" />        <figcaption><em>2023 Kia Niro EV</em></figcaption>    </figure>  <p id=\"Eh6Fxj\">Kia is bringing its <a href=\"https://www.kiamedia.com/us/en/media/pressreleases/18798/designed-for-a-sustainable-future-the-all-new-2023-kia-niro-debuts\">refreshed electrified Niro compact SUV lineup</a> to North America for 2023 with new exterior styling and more interior space. The company is debuting three new Niro models at the New York International Auto Show this week: the hybrid Niro HEV, the plug-in hybrid Niro PHEV, and the fully electric Niro EV. Kia plans to release them nationwide, including the fully electric Niro EV that previously could only be purchased in select states.</p><p id=\"54cUbT\">The Niros all share dark-colored door cladding and an “aero blade” profile panel that combined give the car a swoosh-like appearance. New daytime running lights and a “tiger-nose” grille adorn the front, while the rear taillights are now boomerang-shaped and no longer intersect with the hatch. The changes enable a new low drag coefficient of 0.29 to make these front-wheel-drive CUVs even more efficient.</p><p id=\"D03IZH\">The new fully electric Kia Niro EV in particular has improved range, now 253 miles over the previous model’s 239. Previously, the Niro EV had an option for a smaller 39 kWh battery, but now, it will only come in a larger 64.8 kWh pack option. The battery doesn’t get in the way of space, though; you get eight more cubic feet of passenger room and a sizable 22.8 cubic feet of cargo space — though it’s <a href=\"https://www.tesla.com/ownersmanual/modely/en_us/GUID-E47C4A6D-528E-419C-8C57-FD3864644C34.html\">less than the Tesla Model Y’s at 30.2 cubic feet</a>.</p><div id=\"wub01S\"><div data-anthem-component=\"gallery:11142861\"></div></div><p id=\"qD3fjc\">The Niro EV also has the vehicle-to-load (V2L) capability that the Kia EV6 has, letting you run appliances off of the Niro EV’s battery pack. But this uses an older platform instead of the EV6’s <a href=\"https://www.theverge.com/2021/2/23/22296991/hyundai-ioniq-5-electric-suv-ev-battery-range-specs\">Hyundai-developed E-GMP platform</a> that enables up to 350 kW DC fast charging. Instead, the Niro EV will max out at 85 kW DC fast charging, which is good enough to get you from 10 to 80 percent charge state in about 45 minutes.</p><p id=\"GPzLtg\">At this time, the redesigned Niro EV has not been priced, but the previous model started just shy of $40,000 — which is <a href=\"https://www.theverge.com/2022/1/26/22901555/kia-ev6-pricing-electric-vehicle\">not significantly cheaper</a> than the sportier Kia EV6’s starting price of about $42,000. But if you like the look of cars that don’t try to stand out too much and just want the practicality of a modern CUV, then the new Kia Niro EV might shine.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RwWTm8YqrgAya-m8vpCdl1sQMnw=/0x437:6088x3624/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23388194/18701_2023_Niro_EV.jpg",
  "description": "Kia’s Niro EV is the practical electric CUV.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}