{
  "title": "Kingdom Hearts 4 is an opportunity to win back lapsed fans",
  "url": "https://www.theverge.com/2022/4/11/23020338/square-enix-kingdom-hearts-4-reboot-hope",
  "date": "2022-04-11T18:31:31.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"Kingdom Hearts 3\" src=\"https://cdn.vox-cdn.com/thumbor/Rm77aLW5_MSPI7vMJfPaS4qs-cY=/197x0:1817x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70736845/KH3_Sora_Donald_Goofy.0.png\" />    </figure>  <p id=\"x3dinW\"><em>Kingdom Hearts 4</em> needs to be a reset.</p><p id=\"kMJNm0\">There was a time when news of a new <em>Kingdom Hearts</em> entry would have sent me into paroxysms of joy. But the announcement that <a href=\"https://www.theverge.com/2022/4/10/23018977/kingdom-hearts-iv-announced-20th-anniversary-event-square-enix\"><em>Kingdom Hearts 4</em> is in the works</a> barely inspired a “huh, that’s neat.” I’ve been a faithful devotee of the Church of the Keyblade from the moment I heard Hikaru Utada’s “Simple and Clean.” <em>Kingdom Hearts</em> and <em>KH2 </em>were <em>my games</em>, one of the foundational texts at the core of my identity as a gamer. But the spinoffs began to fragment across consoles I didn’t own, and the story devolved into a quagmire of characters and plot points (<a href=\"https://knowyourmeme.com/memes/aqua-got-norted\">Aqua got ‘norted!</a>) that even I, with my years of training in the gladiator pits of weird-ass <em>World of Warcraft</em> and <em>Final Fantasy</em> lore, could not untangle. <em>Kingdom Hearts</em> lost me, culminating in me dropping <em>Kingdom Hearts 3</em> somewhere mid-game disappointed and oh-so-very sad that the franchise so formative to my youth had become utterly unrecognizable to me.</p><p id=\"KY9nha\"><em>Kingdom Hearts 4</em> then represents a chance for me and my beloved franchise to reconcile. The game needs a clean slate, and <em>Kingdom Hearts 4</em> could be the jumping-on point me and other lapsed keyblade wielders desperately need. The story, as it is, is completely inscrutable. Even the most concise <a href=\"https://docs.google.com/document/u/1/d/e/2PACX-1vQgJT19xfHJtEnIiZ-c55ClvAXn95ODUQBDYFtWF8GtPzHvTUTQhbH3brFk290zaQ/pub\">write-ups</a> and <a href=\"https://youtu.be/lwEwxKkCGJE\">video essays</a> doing the herculean (heh) task of explaining the lore acknowledge this story is weird and convoluted even by permissive RPG standards.</p><p id=\"l1XUvs\">Even though we’re talking <em>Kingdom Hearts 4, </em>it is actually the 16th game in the franchise. That fact, taken on its own, is fine. It happens all the time. ( <strong>Cough</strong> <em>Final Fantasy</em> <strong>cough</strong>.) Where the series loses me and others is when every single one of those 16 games is canon and wholly necessary to understanding what’s going on. Imagine if you had to play the first 14 <em>Final Fantasy</em> games in order to understand <em>Final Fantasy XV</em>. Why would anyone even bother? Even Square Enix seemed to understand <a href=\"https://www.theverge.com/2018/6/14/17462782/kingdom-hearts-3-confusing-story-nomura-e3\">things have gotten Out Of Hand</a> when it released a collection of <em>Kingdom Hearts</em> games titled <a href=\"https://kingdomhearts.fandom.com/wiki/Kingdom_Hearts_-_The_Story_So_Far\"><em>The Story So Far</em></a>.</p><p id=\"QVo2ub\">The result of all this twisty-turny, timey-wimey storytelling is a lack of coherence that manifests in the games. <a href=\"https://www.polygon.com/reviews/2019/1/24/18195478/kingdom-hearts-3-review-xbox-one-playstation-4\"><em>Kingdom Hearts 3</em> was not great</a>. Multiple reviews of the game pointed to the game’s overwrought story as a contributing factor to its poor reception. (That and the fact that we’re <em>still</em> dealing with the Gummi Ship despite it being almost universally reviled by the fanbase.) </p><p id=\"Zt84KX\">It doesn’t have to be that way with <em>Kingdom Hearts 4</em>. The <em>Kingdom Hearts</em> franchise is like a library with a bunch of overdue books. As time went on, spinoffs accrued like compounding late fees to the point that they got so intimidating that the library morphed from a font of joy to a source of shame. All <em>KH4</em> has to do is grant lore amnesty, releasing fans from the burden of trying to understand what came before. And just like <a href=\"https://www.theatlantic.com/ideas/archive/2020/12/why-some-libraries-are-ending-fines/621445/\">libraries with late-fee forgiveness programs</a>, people (me included) will come back in droves. </p><p id=\"gQykSC\">Though there’s very little in the trailer that leads me to believe <em>KH4</em> will push the giant reset button, I remain optimistic. If Square Enix can get rid of <a href=\"https://kotaku.com/sora-kh4-kingdom-hearts-square-enix-trailer-shoes-big-g-1848775066\">Sora’s giant clown shoes</a>, it signals at least some willingness to, as Elsa would say, “let it go.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Su8_CnH4eZiIm990jxm2FbDXWbI=/0x4:1920x1009/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13641958/KH3_Sora_Donald_Goofy.png",
  "description": "No more ‘norting, please.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}