{
  "title": "Kirby and the Forgotten Land is as sweet and slight as cotton candy",
  "url": "https://www.theverge.com/2022/3/23/22991829/nintendo-switch-kirby-and-the-forgotten-land-review",
  "date": "2022-03-23T12:01:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9QgPwz_ZFM4gc2sXpuuFEikqPDw=/0x0:1080x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70660702/2022032214224500_336DB1DA8BDC3BF38ED8609901964A6B.0.jpg\" />        <figcaption>Nintendo</figcaption>    </figure>  <p>A very joyful game belies a kinda empty one </p> <p class=\"p--has-dropcap\" id=\"EIXsmC\"><a href=\"https://www.theverge.com/2022/1/12/22879956/post-apocalyptic-kirby-game-release-date-trailer-nintendo-switch\"><em>Kirby and The Forgotten Land</em></a> feels like the kind of game made for this moment in 2022. I imagine a dark basement at Nintendo HQ where a group of people are monitoring world affairs and whenever it gets too dire, they hit a big red button that says “UNLEASH THE CUTE.” It happened with <em>Animal Crossing: New Horizon</em>s at the <a href=\"https://www.theverge.com/22188452/animal-crossing-new-horizons-coronavirus-pandemic-year-2020\">onset of the pandemic</a> in 2020 and it’s happening again now. But, unlike <em>Animal Crossing</em>, I don’t feel like <em>Kirby and The Forgotten Land</em> has the same kind of staying power to get us through this particular grim bit of world history. It’s a nice distraction that’s fun to play for a couple of hours but it doesn’t really have enough to keep you hooked.</p><p id=\"EH5Ugv\">In <em>Kirby and the Forgotten Land</em>, you play as the titular pink blob of indeterminate origin, power, and motivation. As he merrily goes about, doing whatever it is a God-child of indescribable power does, he’s swept up in a storm that takes him to a land that looks like a post-apocalyptic Earth analogue. There, he learns long-time enemies now erstwhile friends Waddle Dees have been captured by a pack of beasts and it’s up to him to save them. Along the way, God-child Kirby makes use of his prolific appetite to swallow all kinds of objects that help him rescue his friends.</p><p id=\"qI3T0U\">I’ll confess that I’ve never played a <em>Kirby </em>game (although, oddly, he is my go-to in <em>Smash Bros</em>.). I don’t know why, outside of nostalgia, people have an affinity for this franchise. But I think, after my time with <em>Forgotten Land</em>, I do have a bit of an understanding: this is the cutest damned video game I have played since… <em>Animal Crossing</em>. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7IZV8AIAPQk69icsmNcSlfJwkk0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23338689/2022031920390800_336DB1DA8BDC3BF38ED8609901964A6B.jpg\">      <cite>Nintendo</cite>      <figcaption>Mood</figcaption>  </figure></div><p id=\"vF9t4a\">There is such joy in this game that it’s infectious. Kirby is always smiling and laughing. As your home base slowly fills with the Waddle Dees you save, Kirby goes around town, waving enthusiastically at his wards with a childish high-pitched “Hi!” You can’t help but squee along with him. <em>Kirby and The Forgotten Land </em>is a tactical cruise missile of unabashed happiness, expertly designed to make you smile no matter how bad you feel. It’s the video game equivalent of puppy videos and, I’ll admit, I needed its brightness. </p><p id=\"SY8ppC\">I just wish its gameplay inspired as much joy. <em>Forgotten Land</em> is an aggressively fine platformer. Each level has a list of parameters — some already known, some you only find out once you complete it — in order to earn more hidden Waddle Dees. The secret Waddle Dees are usually gated behind not-that-hidden pathways and special platforming puzzles that really aren’t that challenging.</p><div class=\"c-float-right c-float-hang\"><aside id=\"lfRb7X\"><q>It’s the video game equivalent of puppy videos and, I’ll admit, I needed its brightness</q></aside></div><p id=\"PCGbCM\">In addition to regular levels that progress the game, there are side-levels on what’s called the Treasure Road in which Kirby must complete a special platforming stage with a specific power-up, much like those rotating block levels in <em>Super Mario Sunshine</em>. Completing a level within the time limit earns Kirby a rare stone. Rare stones, when combined with not-really-that-hard-to-find blueprints that are scattered about the levels, are used to upgrade his power-ups into their more powerful forms. </p><p id=\"SlUVr7\">Kirby has his standard power-ups to choose from like fire, ice, wind, and gun learned from his ability to vore his enemies. (Do not Google that.) While Kirby’s powers make dealing with enemies trivial, they aren’t all that fun or powerful. Is it cool smashing up bosses with Meta Knight’s sword? Sure. But Kirby’s base level star-spit power does significantly more damage to bosses such that it’s not really worth it to use all the powers you worked so hard to obtain and improve.</p><p id=\"YIRt9B\">Kirby’s special Mouthful Mode powers add a sorely needed bit of variety to gameplay. I love every single Mouthful Mode power. That’s not only because Kirby looks <em>so friggin’ adorable</em> stretched around cars, traffic cones, and lightbulbs but that each power adds a surprisingly unique twist on the game’s standard platforming. I don’t have to think when I’m playing as regular Kirby. Mouthful Mode forces me to engage my brain <em>just enough</em> that the game becomes fun instead of me going through the motions.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rBVEZj0kfijU9mtcoAMmGnu3yIM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23338609/mouthful_mode.png\">      <cite>Nintendo</cite>      <figcaption>A smattering of the Mouthful Powers</figcaption>  </figure><p id=\"wl9QI8\">When Kirby swallows a lightbulb, the level darkens, forcing me to keep the light on so I don’t step off a narrow path while also attracting enemies I can’t fight while in that form. Seeing cracked pavement makes me hunt for a traffic cone to swallow so I can smash through, freeing whatever treasure, Waddle Dee, or collectible hidden beyond. </p><p id=\"GBHbBN\">Back on the homefront, the Waddle Dees you save assemble at Waddle Dee Town. The more you save, the more amenities and mini-games you unlock. There’s a cafe game that has Kirby serving the correct order to an ever faster-moving line of Waddle Dees. Another mini-game has you using Switch gyro controls to pilot Kirby through a maze to reach the end. For the <em>Kirby Battle Royale </em>fans, there’s also a coliseum in which you fight a boss rush against the clock to earn weapon blueprints and other rewards.</p><div id=\"gh8C0Y\"><div data-anthem-component=\"gallery:11109617\"></div></div><p id=\"OY528F\">Waddle Dee Town feels empty. Even stuffed with waving Waddle Dees and its handful of attractions, it feels like a carnival to visit for a short time before going home. The mini games aren’t that interesting beyond a single playthrough and don’t seem to offer rewards beyond cash to buy items for Kirby to take on his journey. Kirby has a home that you can “decorate” with collectible statues found in the world or paid for from a little gacha machine in town, but his walls remain mostly bare. I had hoped the statues you found would slowly fill your one-room house, but you can only ever put three on your mantle. </p><p id=\"0VYvPD\">My biggest beef with <em>Forgotten Land</em> is that, as a heretofore non-<em>Kirby</em> player, Kirby kinda comes off as a dick. The developers made a huge miscalculation in enemy design. I can’t bring myself to harm the little puppy/fox looking things that sometimes show up to bark, growl, and otherwise mildly harass Kirby. They are so cute I actively avoided them so as not to draw their attention and whenever I did, as much as my health would allow, I would ignore them. (Thankfully, they are kinda dim so a quick hover over them and they’d careen off into the distance.) They’re called Awoofies for the love of god! You want me to fight something that looks very much like my dog with a name that sounds like a five-year-old made it up in a game of pretend? <em>Awoofies</em>. Absolutely not.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kHRHAb996i94jRhXmQCeCbfQRhc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23338582/awoofie_vs_ein.png\">      <cite>Nintendo / The Verge</cite>      <figcaption>Accurate comparison or a naked attempt to just show you my dog? You be the judge.</figcaption>  </figure></div><p id=\"8egdFF\">I kept waiting for the twist that showed me the Awoofies are actually the good guys, forced to serve the whims of King Dedede under duress. It never happened. Nintendo 100-percent committed to having you kill these cute-as-shit animals that sometimes don’t even fight Kirby to instead lie sleeping, snot bubble and all. What the hell Nintendo?</p><p id=\"fVyfW7\">Awoofies aside, I’ve also never been able to understand why Kirby has a significant and abiding grudge against trees such that whenever he sees one, it’s hands (err, mouth) on sight. Fighting cute dogs, trees, and fluffy bunnies doesn’t sound like hero behavior to me. </p><p id=\"WEfJ7V\"><em>Forgotten Land</em>’s other sin is that it has a low replayability factor. You can retry levels to aim for the Waddle Dees you missed, but there’s no sense that doing so will reward you beyond checking an extra box. There’s nothing to uncover, no branching path to possibly find, only the satisfaction of saving a poor… whatever the hell a Waddle Dee is and another super cute two-second cutscene of Kirby and the Waddle Dee rejoicing in freedom. (Which actually might not be that insignificant of a reward since their little happy dance is <em>so damned cute</em>, the feel-good brain chemicals you get from seeing it kinda makes the extra effort worth it.)</p><div class=\"c-wide-block\"><div id=\"J3hXJy\"><div ><iframe src=\"https://www.youtube.com/embed/rmSFQExudbs?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"8yYzOP\">Unfortunately, the game takes too long to get going. It terminally slowly ratchets up the difficulty with platforming and Waddle Dee puzzles that by the time I got to the final stage and boss fight, it was finally enough of an interesting challenge. I would have much preferred if the game had started with that kind of difficulty and stayed at that level for the entire game. There are harder bonus levels post end credits that really test your puzzle solving/secret finding skills that I wish had made up the game’s core. That said, <em>Forgotten Land</em> feels like it’s more for younger kids and their parents so I understand why its level of difficulty might be a little too slow for me. </p><p id=\"wv6tPT\">I feel like <em>Kirby and the Forgotten Land</em> just doesn’t do enough. You save Waddle Dees, defeat the bosses, and move on. Save enough Waddle Dees to upgrade the town and unlock various attractions that overall don’t do much to hold your attention beyond a couple of attempts. There doesn’t seem to be a reason to keep playing the cafe game beyond beating your high score. Sure, that’s incentive enough for the folks who like to keep their initials at the top of their local <em>Pac-Man</em> cabinet, but for casual players there’s nothing interesting beyond a first attempt.</p><p class=\"c-end-para\" id=\"kdlZzS\">There’s a cotton candy allegory to be drawn here. Much like the carnival confection, Kirby is fluffy, cute, pink, and very sweet. It looks attractive and is so very fun to eat but the minute you put it in your mouth it dissolves. Gone so quickly, you barely noticed it was there. That’s what it’s like playing<em> Kirby and The Forgotten Land</em>; fun for the moment, but lacking any real substance. And that’s okay! <em>Kirby and the Forgotten Land</em>’s surgically deployed cuteness is more than enough to outstrip its relative emptiness. </p><p id=\"iolw4M\"><small>Kirby and The Forgotten Land</small><small><em> launches on March 25th on the Nintendo Switch.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/k6h8Qms-NVEZmPid5rGKu0irw4s=/0x17:1280x687/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23338612/2022032214224500_336DB1DA8BDC3BF38ED8609901964A6B.jpg",
  "description": "You won’t be able to bring yourself to hurt the awoofies",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}