{
  "title": "Knotwords mashes Wordle with crossword puzzles",
  "url": "https://www.theverge.com/2022/4/25/23037899/knotwords-wordle-crossword-puzzle-game-zach-gage-iphone-android-pc",
  "date": "2022-04-25T19:11:07.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"knotwords\" src=\"https://cdn.vox-cdn.com/thumbor/d7bdsjoX75EO7MNMIXydzFf9My0=/0x0:1620x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70791769/raw_6.0.png\" />    </figure>  <p id=\"m6B3Hr\">For years, designer Zach Gage has been enamored with the works of famed Japanese game publisher Nikoli. The company is best known for popularizing sudoku, and is renowned for its minimalist takes on puzzles like nonograms (which Nintendo fans might recognize as <a href=\"https://www.theverge.com/2019/4/29/18522564/picross-s3-review-puzzle-games-nintendo-switch\"><em>Picross</em></a>). For Gage, creating that kind of clean, straightforward, and accessible puzzle was a long sought-after goal. He describes it as a “kind of obsession,” one that “feels like a really great design challenge because it’s so hard to do.” He tried plenty of ideas but eventually landed on a solution: the humble crossword.</p><p id=\"vusqrw\">This week Gage and partner Jack Schlesinger are releasing <em>Knotwords</em> on iOS, Android, Mac, and PC. It’s a game built on the premise that the most interesting part of a crossword puzzle isn’t actually all of the clever clues, but the grid of letters itself. “There’s this kind of weird thing with crosswords, which is that if you talk to crossword players about crosswords, it’s all about the clues and the structure of the clueing,” Gage says. “But the thing is, the actual grid of letters is incredibly complicated… but as a player, it’s like this little side effect that you’re not even focusing on.”</p><p id=\"kspJJP\"><em>Knotwords</em> uses that grid as the basis for a word-focused puzzle game. Each <em>Knotwords</em> puzzle looks like a crossword, but instead of utilizing cryptic clues to solve what are essentially trivia questions, you solve the puzzle by creating valid words from predetermined groups of letters. Each puzzle is divided into zones, and in each zone, you can only use specific letters. The challenge comes from figuring out ways to use those specific arrangements of letters to create the correct words, which fill up the grid just like in a crossword puzzle. For those who can’t visualize that, check out the GIF below, or the trailer above:</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fPEr-gaEj-3d2ylAQxFfjBwhZfo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23410229/unnamed.gif\">      <figcaption><em>Knotwords.</em></figcaption>  </figure></div><p id=\"MXc7Np\">If Gage’s name sounds familiar, that’s probably because, over the last few years, he’s released a series of apps that aim to reinvent or reimagine classic games. This includes the likes of <a href=\"https://www.theverge.com/2016/10/13/13262994/really-bad-chess-zach-gage-iphone-ipad\"><em>Really Bad Chess</em></a>, <a href=\"https://www.theverge.com/2017/11/9/16629238/flip-flop-solitaire-iphone-zach-gage\"><em>Flipflop Solitaire</em></a>, and <a href=\"https://www.theverge.com/2018/5/24/17386358/pocket-run-pool-zach-gage-iphone\"><em>Pocket-Run Pool</em></a>. He even designed a new version of <em>Snake</em> for <a href=\"https://www.theverge.com/23025390/playdate-handheld-portable-gaming-console-review\">the just-released Playdate handheld</a>, and in 2020 he teamed up with Schlesinger in an attempt <a href=\"https://www.theverge.com/21334116/good-sudoku-iphone-ipad-app-game-zach-gage\">to create a better digital version of sudoku</a>. The concept for <em>Knotwords</em> actually predates <em>Good Sudoku</em>: the pair originally put the project on hold to work on the sudoku game. As part of that experience, they found new inspiration from KenKen, a sudoku derivative that divides the puzzle grid into zones that each has a math equation attached, so you not only have to solve the traditional sudoku puzzle but also get the arithmetic correct. Schlesinger came up with the idea of applying that to their word game prototype.</p><p id=\"NJeRGN\">“That really struck a chord because when I had been working on <em>Good Sudoku</em>, my mom was really trying to get me to make a KenKen game instead,” Gage says. “She said ‘sudoku is really boring. KenKen is really interesting because in sudoku, you’re just applying patterns. But in KenKen, every situation is unique and you have to sort of think through the possibilities of the space.’” Gage says that when he applied the zone idea to <em>Knotwords</em> “it worked instantly.” The pair then split up; Gage began hand-crafting puzzles, while Schlesinger developed a puzzle generator. They would then compare notes to figure out how to generate ideal puzzles for the final game.</p><div id=\"eIHeVl\"><div data-anthem-component=\"imageslider:11160190\"></div></div><p id=\"gc7Y25\">Of course, you can’t talk about a word game in 2022 without mentioning the six-letter-long elephant in the room: <a href=\"https://www.theverge.com/22892044/wordle-free-game-online-how-to-puzzle\"><em>Wordle</em></a>. Calling Josh Wardle’s daily word guessing game a sensation would be putting it lightly. Gage says that seeing Wordle’s breakout success — which includes, among many other things, <a href=\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\">being acquired by<em> the New York Times</em></a><em> — </em>“has been inspiring,” and influenced a number of aspects of<em> Knotwords</em>. Perhaps the most notable is the structure; one of <em>Wordle</em>’s defining traits is that there’s only a single puzzle each day, creating a ritual of sorts for players. The free version of <em>Knotwords</em> will similarly offer a new puzzle each day along with 10 additional puzzles each month. (The game will be free to download, but a one-time in-app purchase of $11.99, or a yearly subscription of $4.99, will give players access to the full experience, including an archive of past puzzles.)</p><div class=\"c-float-right\"><aside id=\"aZeVLt\"><q>“It’s enjoyable to have a thing in your life that is sort of like a ritual.”</q></aside></div><p id=\"CZspEu\">The idea was to stay away from the retention-driven nature that’s so common in games — things like the daily quests that dominate most live-service experiences — and instead find a structure that encourages players to fit <em>Knotwords</em> into their life in a more natural way. “I am interested in making games that are designed to be played in a certain kind of way and celebrate people who like to play games in that way,” Gage explains. “It’s enjoyable to have a thing in your life that is sort of like a ritual where you play one of these every day, or you wake up and do this thing before breakfast, or you wake up and solve your crossword with breakfast.”</p><p id=\"vSB1sq\">The other big thing <em>Wordle </em>did was find an ingenious way for players to share the experience; we’ve all seen our social feeds flooded with squares representing that particular day’s puzzle. It’s a distinct visual that’s intriguing for those who aren’t playing, but also has extra meaning for those who have made <em>Wordle</em> a part of their routine. <em>Knotwords</em> goes in a slightly different direction. Because the game also works as a pen-and-paper game, when you solve a puzzle you really love, you can share a blank, printable version of that puzzle that people on your feed can take and solve even if they don’t have it installed. “Why not share the puzzle to the internet and sort of say, ‘I really love this puzzle today. This was a really good one. Check it out.’”</p><p id=\"MHWGS3\">That pen-and-paper nature could also point to the game’s future. Much like crosswords and sudoku have become prevalent in part because of newspaper syndication, Gage thinks that <em>Knotwords</em> could follow a similar pattern. This, in turn, creates the potential for localized versions of the game; while it’s currently only available in English, Gage envisions a future where puzzle creators design their own puzzles for local markets. “If this is something that’s successful,” he says of <em>Knotwords</em>, “going after a syndication market is something that we’re really interested in because I do think it works really well as a pen and paper game.”</p><p id=\"AteXLJ\">For now, though, the focus is on the digital version of the game, which launches on April 28th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vC_KfRPUMY40elLiVY1d5eGvxhU=/0x21:1920x1026/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23414852/raw_6.png",
  "description": "A new twist on word games.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}