{
  "title": "Kogonada’s After Yang finds beauty in the quiet dystopia of grief",
  "url": "https://www.theverge.com/2022/3/4/22956531/after-yang-kogonada-review",
  "date": "2022-03-04T15:00:45.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pYvq1yDdnsiUPnUiuKJcOBAJJ3I=/199x0:2602x1602/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70578786/Screen_Shot_2022_03_03_at_3.31.28_PM.0.png\" />    </figure>  <p>Justin H. Min stars as Yang, an android at the end of his life</p> <p class=\"p--has-dropcap\" id=\"zAxEnX\">In A24’s <a href=\"https://www.theverge.com/2022/2/1/22912211/after-yang-a24-trailer-kogonada\"><em>After Yang</em></a><em> </em>from <em>Columbus </em><a href=\"https://www.theverge.com/2022/1/27/22902494/sundance-film-festival-2022-best-movies\">director Kogonada</a>, the <a href=\"https://www.theverge.com/2021/10/27/22746679/soul-machines-metaverse-digital-humans-labor\">anthropomorphization of technology</a> has long since given rise to machines that think, feel, and live alongside their flesh and blood makers. It’s been so long since the birth of “technosapiens” that there’s much about them the general public has forgotten, and strict governmental regulations make it difficult for many humans in the present day to see them as much more expensive, recyclable assistants. At first, all of these details make <em>After Yang </em>seem like yet another sci-fi feature about machines pondering what it means to be human. But as the movie’s opening credits start rolling, <em>After Yang</em>’s story makes short work of revealing itself to be a moving reflection on what it means to love someone when you know you’re about to lose them.</p><p id=\"5ddqvp\">Adapted from author Alexander Weinstein’s short story <em>Saying Goodbye After Yang</em>, <em>After Yang </em>tells the tale of Jake (Colin Farrell), Kyra (Jodie Turner-Smith), their adopted daughter Mika (Malea Emma Tjandrawidjaja), and their son Yang (Justin H. Min), a sophisticated android designed to help adoptive parents raise their Chinese-born children. Though Mika and Yang see each other as siblings and share a comfortable, easy love, Jake and Kyra’s feelings about their son — a somewhat loaded term for them — are complicated both by what Yang is and by their decision to purchase him in the first place. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-mcpzuIMcyk8LRSqAG2s8JHUdlU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23286265/Screen_Shot_2022_03_03_at_3.31.28_PM.png\">      <cite>A24 / Showtime</cite>      <figcaption><em>Jake, Kyra, Mika, and Yang posing together for a family photo</em></figcaption>  </figure><p id=\"pU0VnD\">Because Kyra, a scientist, and Jake, the proprietor of a specialized tea shop, work full time, having someone around to watch over Mika is a huge benefit. But as one of the many different kinds of android siblings manufactured by the Brothers &amp; Sisters Inc. megacorporation, Yang isn’t just a caretaker. He’s a companion, a protector, and most importantly, a teacher whose neverending “Chinese fun facts” are part of how he provides Mika with a connection to her Chinese heritage. That’s something neither of her parents — who are Black and white — really feel equipped to do. After years of living together as a family, their futuristic Benetton ad of a life begins to fall apart when Yang starts malfunctioning without warning. The question on everyone’s minds as <em>After Yang </em>opens is whether Jake can fix him.</p><p id=\"Tl6DIV\">Though you can see remnants of the natural disasters and man-made calamities that once devastated the larger world of <em>After Yang</em>, the family’s grief and the emotional dystopia it creates within their home is what Kogonada’s script is most focused on. The idea that Yang might die is heartbreaking in and of itself. But it’s the prospect of finding someone willing to fix him that disturbs Jake because of how the process forces him to confront many difficult truths about himself as a father. </p><div class=\"c-float-right\"><aside id=\"FB3gKY\"><q>The family’s futuristic Benetton ad of a life falls apart when Yang starts malfunctioning</q></aside></div><p id=\"MidKgj\">As much as <em>After Yang </em>is a film about death, race and racism are the other specters that loom large throughout its story. Jake’s search brings him to people like his pro-cloning neighbor George (Clifton Collins Jr.) and Cleo (Sarita Choudhury), a researcher specializing in technosapiens like Yang. Rather than simply using androids as a metaphor for persecuted minorities, <em>After Yang </em>very explicitly identifies the widespread anti-Asian bigotry that defines its vision of a near-future America for what it is. In doing so, <em>After Yang </em>raises a number of complicated questions about all of its characters — Jake and Yang in particular, who the film presents as two embodiments of how people in this strange yet familiar world relate to and think about people of Chinese descent and China as a country.</p>  <figure class=\"e-image\">        <img alt=\"Yang and Mika napping together on the couch in a flashback.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yNk6opgW9TYZU32NGZjL9bqBdx8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23286268/Screen_Shot_2022_03_03_at_3.29.20_PM.png\">      <cite>A24 / Showtime</cite>      <figcaption><em>Yang and Mika napping on the couch</em></figcaption>  </figure><p id=\"sTg4Le\">Compared to the short story, <em>After Yang </em>gives its titular character a much richer interior life that’s explored through a number of flashbacks that each reveal new shades of Min’s multifaceted yet staid performance. Min inhabits Yang with a guilelessness that reads less like an android struggling to perform humanity and more like a person butting up against existential limitations placed on him by those who can’t bring themselves to see him as anything but a <em>thing</em>. </p><div class=\"c-float-left\"><aside id=\"jIl7js\"><q><em>After Yang </em>gives its titular character a richer interior life than the story it’s based on</q></aside></div><p id=\"2BGaZL\"><em>After Yang </em>contrasts the warmth and genuine exchange of love between Mika and Yang with a thoughtful and significant uneasiness between Yang and Jake that speaks volumes about the latter, whose character is also expanded upon from his literary counterpart. You’re meant to sympathize with Jake as he grapples with the idea of Yang dying and his growing emotional distance from his wife and daughter. But <em>After Yang</em> also<em> </em>carefully lays out how, despite seeing himself as being “better” than his overtly racist peers, a very overt kind of orientalism shot through with a warped sense of reverence is a large part of Jake’s identity.</p><p id=\"uz8xdL\">Much in the same way that Yang isn’t a mere appliance to be turned on and off, Jake isn’t exactly <em>After Yang</em>’s villain, per se, even though some of the family’s turmoil stems from his actions. Rather, Jake’s just a person working through the messiness of his life and being reminded of the fact that he has and will continue to play a direct role in what becomes of his family as a unit. Farrell plays Jake with an earnest adriftness evocative of someone on the brink of profound loss who’s also realizing how out-of-touch he’s become — and perhaps always has been — from the people he cares about most.</p>  <figure class=\"e-image\">        <img alt=\"Kyra, Jake, and Mika discussing Yang’s fate over dinner at the dinner table.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GGZhcJJc36RmWkeWY19lMrOJD-A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23286281/Screen_Shot_2022_03_03_at_3.30.47_PM.png\">      <cite>A24 / Showtime</cite>      <figcaption><em>Kyra, Jake, and Mika discussing Yang’s fate over dinner</em></figcaption>  </figure><p id=\"uZ2Oxk\">For all of its seriousness and focus on death, <em>After Yang</em>’s is also a strikingly gorgeous film that frequently teases out just enough of its outside world to make you want to know more about it. Almost as if in response to the sharp, hard edges of its fictional past, <em>After Yang </em>envisions a somewhat <em>Her</em>-like future marked by soft technology that’s crafted with both humans and nature in mind. None of the film’s inconspicuous techno-organic gadgets of tomorrow amaze anyone because they’ve long since become everyday parts of life. </p><p class=\"c-end-para\" id=\"KTLR5V\">But that unfazed-ness is also one of the many ways <em>After Yang </em>reminds you how surviving a loved one has a way of draining the world of its vibrance and wonder. It’s those sorts of almost imperceptible details that end up making <em>After Yang </em>feel like such a sci-fi masterwork that understands the power of restraint and precision within the genre.</p><p id=\"uFGXb1\"><small><em>After Yang </em></small><small>also stars Haley Lu Richardson, Ritchie Coster, Orlagh Cassidy, and Lee Wong. The movie simultaneously hits theaters and begins streaming on Showtime March 4th.</small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OHkx5wh8chXEDoyqywvA-faGDHo=/0x12:2850x1504/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23286313/Screen_Shot_2022_03_03_at_3.26.58_PM.png",
  "description": "A24’s After Yang tells the story of a family working through loss",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}