{
  "title": "Lawsuit claims Google’s ‘Order Online’ button directs customers away from restaurants’ sites",
  "url": "https://www.theverge.com/2022/3/14/22977512/google-lawsuit-bait-switch-tactic-customers-away-restaurants",
  "date": "2022-03-14T21:47:42.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nRvbw6cxlMomUSMdZpHVOZD6nKA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70622631/acastro_210121_1777_google_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"LLEdQ6\">Google is facing a lawsuit from a Florida restaurant chain owner that accuses the company of directing users to “unauthorized” Google-branded food ordering webpages, where it uses restaurants names “without their approval,” as first reported by <a href=\"https://arstechnica.com/tech-policy/2022/03/google-hijacked-millions-of-customers-and-orders-from-restaurants-lawsuit-says/\"><em>Ars Technica</em></a>.</p><p id=\"CXMXyo\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/03/Left-Field-Holdings-v-Google.pdf\">A copy of the lawsuit</a> alleges Google employs “bait-and-switch” tactics by placing its “Order Online” button at the top of restaurants’ profile panels on the search engine. The large blue button redirects users to a <a href=\"http://food.google.com/\">food.google.com</a> page where they can select items from a restaurant’s menu and then place an order through a variety of third-party services, like Postmates, DoorDash, and UberEats — not through the restaurant itself. These services take a commission from participating restaurants, which, for example, ranges anywhere from 15 to 30 percent with <a href=\"https://merchants.ubereats.com/us/en/pricing/\">UberEats</a>. </p><div class=\"c-float-right\"><aside id=\"3RsTHs\"><q>The lawsuit claims that Google “prominently features” restaurants’ names on its ordering pages</q></aside></div><p id=\"llpkcM\">The lawsuit claims that Google “prominently features” restaurants’ names on its ordering pages with the alleged goal of “deliberately confusing consumers into entering and interacting with its websites.” If a customer places an order through this page using a third-party service, the restaurant gets charged a fee, and the lawsuit alleges Google gets “a cut-of-the-action.”</p><p id=\"zRxARc\">The lawsuit is seeking class-action status on behalf of other restaurants that may have lost orders to Google’s button.</p><p id=\"5ET7eI\"><a href=\"https://www.theverge.com/2019/5/23/18636836/google-search-maps-assistant-food-orders-delivery-pickup-doordash-postmates-slice-chownow\">Google first rolled out its “Order Online”</a> button in 2019. On <a href=\"https://support.google.com/business/answer/10842217\">Google’s support page</a>, it tells restaurants that they can turn the ordering feature on or off, but it remains unclear whether it’s toggled on by default.</p><p id=\"wnPoxz\">Google spokesperson Ashley Thompson said in an emailed statement to <em>The Verge</em> that the lawsuit represents a “mischaracterization” of the product and that the company will defend itself “vigorously.” </p><p id=\"E9GeHN\">“Our goal is to connect customers with restaurants they want to order food from and make it easier for them to do it through the ‘Order Online’ button,” Thompson said. “We provide tools for merchants to indicate whether they support online orders or prefer a specific provider, including their own ordering website. We do not receive any compensation for orders or integrations with this feature.”</p><p id=\"sXuC5D\">In 2019, <a href=\"https://www.theverge.com/2019/6/28/19154220/grubhub-seamless-fake-restaurant-domain-names-commission-fees\">Grubhub was criticized for buying thousands of domain names</a> that closely resembled those of particular restaurants without the restaurants’ involvement. These sites would feature a restaurant’s name, menu, and sometimes even its logo, along with an online form to order through Grubhub. Last year, <a href=\"https://www.theverge.com/2021/8/27/22644880/chicago-doordash-grubhub-lawsuit-tipping-phone-order-fee-cap\">the city of Chicago sued Grubhub and DoorDash</a> for “unfair and deceptive” practices, and fake websites were just one of the lawsuit’s allegations.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vVk-v8ybfbDgOFHvxi7yuMmaP2M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22250976/acastro_210121_1777_google_0001.jpg",
  "description": "Google faces a lawsuit for using \"bait-and-switch\" tactics.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}