{
  "title": "Leatherface refuses to be canceled in Texas Chainsaw Massacre’s first trailer",
  "url": "https://www.theverge.com/2022/1/31/22910452/netflix-texas-chainsaw-massacre-trailer-release-date",
  "date": "2022-01-31T18:40:21.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Leatherface striking a pose with his signature chainsaw.\" src=\"https://cdn.vox-cdn.com/thumbor/P1YDmv9gFDBPKACSrlfcd9PseCg=/245x369:4286x3063/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70453996/TCM_D25_04163_V2.0.jpeg\" />        <figcaption>Netflix/Legendary</figcaption>    </figure>  <p id=\"ThjdJ9\"></p><p id=\"KrvdgK\">All <a href=\"https://www.theverge.com/2014/6/22/5833378/texas-chainsaw-massacre-4k-version\"><em>Texas Chainsaw Massacre</em></a>’s Leatherface has really wanted deep down is to be unbothered by the outside world and left to his murderous hobbies. But the first trailer for Netflix and Legendary’s upcoming sequel makes clear that almost 50 years later, the iconic serial killer still knows no peace despite his attempts to go looking for it.</p><p id=\"i6p6Rs\">What the new <em>Texas Chainsaw Massacre </em>lacks in terms of having a unique title, it may make up for with its premise, which directly connects it to director Tobe Hooper’s original 1974 feature of a similar name. Though most everyone living near Harlow, Texas is familiar with the story of how Sally Hardesty (Olwen Fouéré) narrowly managed to escape Leatherface’s (Mark Burnham) clutches, <em>Texas Chainsaw Massacre’s </em>out-of-towner protagonists have no idea what they’re talking into when they journey to the town. Because Melody (Sarah Yarkin), her sister Lila (Elsie Fisher), and their friends Dante (Jacob Latimore) and Ruth (Nell Hudson) are all focused on opening up a new business together and not exactly learning about their new town, none of them realize how much danger they’re in when they wander into Leatherface’s home where he’s hidden himself away.</p><p id=\"OjgPmU\"><em>Texas Chainsaw Massacre</em>’s first trailer gives you the sense that, ignorant as its protagonists are about Leatherface, the movie’s going to spend a significant amount of time digging into what makes him tick and how this generation of victims truly isn’t prepared to deal with his brand of psychopathy.</p><p id=\"4lR0hh\"><em>Texas Chainsaw Massacre </em>hits Netflix on February 18th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OxpKZwX8vgmWG53SaWpSF45u6fw=/0x657:4595x3063/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23207563/TCM_D25_04163_V2.jpeg",
  "description": "After all these years, Leatherface is back in Netflix’s Texas Chainsaw Massacre.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}