{
  "title": "Leftist gimmick accounts want their tweets to influence politics, too  ",
  "url": "https://www.theverge.com/2022/4/28/23045158/leftist-gimmick-accounts-twitter-accidentally-based-libs-of-tiktok-meme",
  "date": "2022-04-28T12:30:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"Twitter’s blue bird silhouette logo is seen on a black background.\" src=\"https://cdn.vox-cdn.com/thumbor/x1SFMheFwv0OHQGTYmwzuieM2Ec=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70803966/acastro_180827_1777_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"7iwWLc\">The rapid rise of the Twitter account <a href=\"https://twitter.com/BasedByAccident\">Accidentally Based</a> surprised even the person who created it. One of many so-called gimmick accounts, Accidentally Based was started as a left-wing response to conservative meme accounts that the creator noticed tended to grow quickly. Just a month after making Accidentally Based, the account had 100,000 followers, the owner estimates, and was getting retweeted by Twitter users with hundreds of thousands of followers themselves. What began as an experiment soon proved to be a reliable way to get content in front of millions.</p><p id=\"8cVxNE\">“I figured it was worth a shot, and maybe I’d be able to have some influence on the left,” the account creator says about starting Accidentally Based. “It didn’t feel like there were many left-wing accounts like that.” </p><p id=\"1ifMWg\">But despite millions of impressions and efforts to build relationships with power players on and offline, the account’s real-world influence is minuscule, the account’s owner says. Influencers and politicians on the left rarely, if ever, respond to their messages offering help and proposing collaborations. And they’re worlds away from their right-wing counterparts that are influencing public policy and media cycles, like the <a href=\"https://twitter.com/TaylorLorenz/status/1518988205839699968\">ongoing firestorm</a> around the <a href=\"https://www.washingtonpost.com/technology/2022/04/19/libs-of-tiktok-right-wing-media/\">viral Libs of TikTok account</a>.</p><div id=\"V7j99a\"><blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\"><a href=\"https://t.co/5UlkgQzk6b\">pic.twitter.com/5UlkgQzk6b</a></p>— accidentally based (@BasedByAccident) <a href=\"https://twitter.com/BasedByAccident/status/1514369761576112137?ref_src=twsrc%5Etfw\">April 13, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"UVfiau\">Accidentally Based reposts screenshots of right-wing and conservative social media posts that inadvertently make a progressive or leftist point. The topics range from anti-trans rhetoric to whether the US should raise the minimum wage, but the common thread is that the poster is oblivious to the fact that their argument benefits the other side. The tweets regularly rack up hundreds of thousands of likes and retweets, becoming easy fodder to point and laugh at.</p><p id=\"Jie3tZ\">In <a href=\"https://twitter.com/BasedByAccident/status/1377644200238399492/photo/1\">one post</a>, a TikTok user with a Blue Lives Matter profile picture questions why pads and tampons should be free just because half the population uses them. By that standard, the commenter asks sarcastically, shouldn’t food and water be free, too, if everyone needs it? Unbeknownst to the TikTok commenter, Accidentally Based and its followers would agree.</p><p id=\"2cxDbr\">Accidentally Based is just one example of a type of anonymously run Twitter account, often referred to as gimmick accounts. The accounts typically have a specific kind of content they repost and are usually pulled from a variety of sources — Facebook comments, tweets, TikTok videos, and elsewhere — and much of it is user submitted. The crowdsourced nature of the content means celebrities and elected officials might be featured alongside someone’s QAnon uncle without a public platform.</p><p id=\"6SKux7\">Aggregation accounts exist across the political spectrum and for more benign topics, too, like <a href=\"https://twitter.com/PoorlyAgedStuff\">Poorly Aged Things</a> or <a href=\"https://twitter.com/BrandsOwned\">Brands Getting Owned</a>. Other accounts like <a href=\"https://twitter.com/RacismDog\">Racism Watchdog</a> and <a href=\"https://twitter.com/YesYoureRacist\">Yes, You’re Racist</a> are often summoned by followers underneath racist tweets, sort of like a bat signal to have them weigh in and bring attention to the offending post.</p><div class=\"c-float-right\"><aside id=\"KRB80F\"><q>While Libs of TikTok has been embraced by the right, Accidentally Based says their own efforts on the left have been rebuffed</q></aside></div><p id=\"3MV14X\">Many of these accounts are run anonymously despite enormous followings, and some of them have played a central role in politics beyond racking up retweets. Libs of TikTok, a viral account <a href=\"https://www.mediamatters.org/facebook/march-libs-tiktok-was-top-twitter-user-amplifying-anti-lgbtq-hate-now-these-attacks-are\">amplifying anti-LGBTQ talking points</a>, has been credited with inspiring <a href=\"https://www.mediamatters.org/twitter/anti-lgbtq-twitter-account-libs-tiktok-seemingly-inspired-attacks-florida-governors-press\">legislation</a> like Florida’s “Don’t Say Gay” bill. When a <a href=\"https://www.washingtonpost.com/technology/2022/04/19/libs-of-tiktok-right-wing-media/\">story by <em>The Washington Post</em></a><em> </em>revealed the identity of the Libs of TikTok creator last week, <a href=\"https://twitter.com/RepMTG/status/1516624036507406337\">right-wing politicians</a> and <a href=\"https://twitter.com/DonaldJTrumpJr/status/1516751160228683776\">influencers</a> quickly jumped to creator Chaya Raichik’s defense.</p><p id=\"uVSzpb\">Celebrities like Lil Nas X and political advocacy groups like the Gravel Institute are among Accidentally Based’s followers, but the creator of the account says they’ve struggled to get influencers and politicians to acknowledge them the way the right has incorporated Libs of TikTok into its platform and talking points. While Raichik’s account has been embraced by the right, the Accidentally Based account owner says their own efforts on the left have been rebuffed — they’ve messaged politicians, influencers, and other political actors and offered to strategize on social media messaging and spread policy goals to their enormous audience but rarely get a response, much less interest.</p><p id=\"E1RXeD\">Another person, who runs the left-wing gimmick Twitter account <a href=\"https://twitter.com/TheRightCant\">The Right Can’t Meme</a>, told <em>The Verge</em> via DMs that though they haven’t reached out to left-wing influencers or politicians themselves, they would be happy to help if there’s interest — it just hasn’t happened yet. </p><p id=\"b4SYTs\">Meanwhile, the right has mechanized the use of gimmick accounts as another conduit for their politics in a way that left-wing contemporaries aren’t able to do so far.</p><p id=\"eQHlt0\">“It actually bothers us a bit how the right-wing ecosystem seems geared towards pumping up these accounts and making them as popular as possible,” Accidentally Based says. Other right-wing meme accounts have received boosts in the past, they say, with influencers and political operatives retweeting, mentioning, and coming to their defense. When <a href=\"https://twitter.com/DefiantLs\">Defiant L’s</a> — an account that shares composite memes of liberal politicians and influencers appearing to contradict themselves — was briefly suspended earlier this year, <a href=\"https://twitter.com/benshapiro/status/1493747911363948547\">the right</a> <a href=\"https://twitter.com/ggreenwald/status/1494009944697409544\">rallied</a> <a href=\"https://twitter.com/Cernovich/status/1494020060096069637\">around it</a>.</p><p id=\"PSN3be\">“The thing they’re doing with Libs of TikTok now, they did a month ago with the Defiant L’s account,” Accidentally Based says.</p><div class=\"c-float-left\"><aside id=\"b0wMHM\"><q>“I don’t feel like I’ve done much actual real-world good with it.”</q></aside></div><p id=\"3xPApR\">The person who runs Accidentally Based has made multiple viral gimmick accounts — they also run <a href=\"https://twitter.com/cons_owned\">Conservatives Getting Owned</a>, followed by more than 380,000 people. Despite their enormous digital reach (a combined one million followers, plus tens of millions of impressions a month), the person running Accidentally Based feels their influence is largely untapped. For one, they don’t make money off of their following beside a Ko-fi account that has pulled in about $10. The dopamine hit of selecting posts destined to go viral is satisfying, but the ripple effects are contained on the platform. </p><p id=\"8Af2ov\">“I don’t feel like I’ve done much actual real-world good with it,” they say about the account. But the potential is there. </p><p id=\"2uJiix\">For Accidentally Based, the Libs of TikTok effect is both a model and a warning. They’d like to see leftist gimmick accounts have the same influence as their right-wing counterparts, but they draw a line at sharing false or misleading information, as <a href=\"https://www.theguardian.com/us-news/2022/mar/29/nebraska-lawmaker-litter-boxes-claim-debunked\">Libs of TikTok did</a>. Libs of TikTok’s prior anonymity didn’t bother Accidentally Based as much as the pipeline from false information to public policy — and Accidentally Based remains anonymous to avoid harassment spilling into their private life. The same applies to the random individuals featured on their feed: when someone who was featured in one of their posts messaged them that they were receiving harassment, Accidentally Based went back and deleted the tweet.</p><p id=\"8de7Yf\">“I really don’t post anything that controversial, but since I am political, people on Twitter are really crazy and insane.”</p><p id=\"b92H1W\">To the person who runs The Right Can’t Meme, the pipeline itself isn’t an issue, saying there’s little distinction between an account like Libs of TikTok and influencers like Dave Rubin or Tim Pool. If anything, they say they’d like to see the left utilize the network of accounts more.</p><p id=\"33DNpd\">“I don’t think my account is the type that could exert such influence because I pretty much exclusively post memes, but it would be awesome if the left had more influential accounts like that.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/31wcDz-dd7XKS5dJnkQVko0eII0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645609/acastro_180827_1777_0002.jpg",
  "description": "Leftist political accounts reach millions of users a month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}