{
  "title": "Lenovo debuts both its most powerful and slimmest 16-inch Legion gaming laptops",
  "url": "https://www.theverge.com/2022/5/10/23055647/lenovo-legion-7-7i-slim-specs-features-price-release-date-gaming-laptop",
  "date": "2022-05-10T15:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Lenovo Legion Slim 7\" src=\"https://cdn.vox-cdn.com/thumbor/jP7pzjgTrryTc5V7Ld8h2ci_eo0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70852375/legionslim7hero.0.jpg\" />        <figcaption><em>The Slim 7 and 7i can impressively be configured with a 99.99Wh battery.</em> | Image: Lenovo</figcaption>    </figure>  <p id=\"S3TAzo\">Lenovo’s highest-end gaming laptops for 2022 have been unveiled. The 16-inch Legion 7 and 7i (the “i” denotes Intel CPUs) can be configured with the current best of the best in terms of processors and graphics. The Legion 7 is one of a few gaming laptops that can be configured with AMD’s Ryzen 9 6900HX processor along with Radeon RX6850M XT graphics. On the Intel side, it can be configured with up to Intel’s 12th Gen Core i9-12900HX and with Nvidia’s RTX 3080 Ti graphics card, which has an impressive 175W of total graphics power.</p><p id=\"6e5ssx\">In addition to being more powerful, the Legion 7-series machines present a couple of additional upgrades over the <a href=\"https://www.theverge.com/2022/1/5/22859802/lenovo-legion-5-5i-pro-amd-ryzen-9-intel-12th-gen-rtx-3070-ti-specs-gaming-laptop\">2022 Legion 5 Pro</a>. It has a 1080p webcam instead of a 720p one, and it has a bigger 99.99Wh battery. Each model includes a QHD 16:10 aspect ratio display that has a 165Hz refresh rate and Dolby Vision HDR as well as support for either Nvidia G-Sync or AMD FreeSync Premium depending on whether you get the Intel-based Legion 7i or the AMD-based Legion 7. You also have the option to bump the screen up to a 240Hz QHD panel that supports variable refresh rate (VRR).</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Lenovo Legion 7\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HcvYD5QlyEcGdsD0USGl4jvQqb0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437284/legion7front.jpg\">      <cite>Image: Lenovo</cite>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Lenovo Legion 7\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hbvFCcxviGvRlmZu1_TiWKNkjno=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437285/legion7rear.jpg\">      <cite>Image: Lenovo</cite>  </figure></div></div></div><p id=\"PdA4MC\">One more cool feature to focus on with the Legion 7i specifically is its RAM overclocking capability. The base clock speed for its DDR5 RAM is 4,800MHz, but if you elect to get the model with 32GB of RAM (the most that it can support), it can be overclocked to an impressive 5,600MHz.</p><p id=\"8xdpBE\">The Legion 7i will be the first to launch, coming in May at a starting price of $2,449. The Legion 7 will follow it up in June with a smaller starting price of $2,059.</p><p id=\"uPblaC\">The other half of Lenovo’s set of announcements is the Legion Slim 7 and 7i (pictured at the top of the post), which retain many of the same features as the Legion 7 but in a slimmer chassis with — predictably — less power. Similarly, Lenovo is staggering their release, starting with the Slim 7i in May for $1,589 and the Slim 7 for $1,519 in June.</p><p id=\"CKjU1v\">Impressively, the Legion Slim 7 and 7i can be configured with the same selection of high-end Intel and AMD CPUs. In terms of graphics, the Slim 7i can go up to the RTX 3070 with a total graphics power of 100W, while the AMD-based model can support up to AMD’s <a href=\"https://www.theverge.com/2022/1/4/22865816/amd-radeon-6000s-6000m-gpu-laptops-ces-2022\">Radeon RX 6800S graphics</a>.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yOU638OnlSwGqwPvQU_YSW_jKjA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437286/legionslim7side.jpg\">  </figure><p id=\"vn4U15\">The Intel-based Slim 7i is getting the more interesting display options here, with a QHD Mini LED being among the choices available. Otherwise, the display options are comparable to what’s available in the Legion 7 and 7i, with the exception of having a lower starting resolution of 1920 x 1200.</p><p id=\"Vfn0t7\">Some other specs that caught my eye with the Slim 7 and 7i include support for a 99.99Wh battery, though it starts with a 71Wh option. Also, I think this is the only Legion laptop released in 2022 to feature an SD card reader — a spec that, ideally, should have wider support in Lenovo’s gaming-focused lineup.</p><p id=\"DbU6eB\">Several gaming laptops that debuted at CES 2022 are now available, but many more are still on the way. So far, there have been far more options available with Intel’s 12th Gen processors, but we should start seeing more coming with <a href=\"https://www.theverge.com/2022/2/17/22935783/amd-ryzen-6000-h-radeon-rx-processor-graphics-launch-asus-g14-benchmarks\">AMD’s Ryzen 6000 H-series</a> processors and its new discrete graphics.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XDspu438pSq9CTRgVU7k4MTWlq8=/0x185:2040x1253/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437281/legionslim7hero.jpg",
  "description": "These machines will begin to ship in May 2022.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}