{
  "title": "Lenovo’s newest ThinkPads feature Snapdragon processors and 165Hz screens",
  "url": "https://www.theverge.com/2022/2/28/22951154/lenovo-thinkpad-x1-extreme-x13s-laptops-specs-price",
  "date": "2022-02-28T08:00:00.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"The Lenovo ThinkPad X1 Extreme open on a white table. The screen displays a desert night scene with a bright orange ribbon running through it.\" src=\"https://cdn.vox-cdn.com/thumbor/-ApMPivKtXhAMI8F2FBFan99v6Y=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70558839/mchin_200512_5050_0009.0.jpg\" />        <figcaption><em>Here’s the new ThinkPad X1 Extreme.</em> | Photo by Monica Chin / The Verge</figcaption>    </figure>  <p id=\"bYVcfa\">Lenovo has dumped a whole bunch of new ThinkPads into the world, and there’s some exciting stuff in there. We’re getting a brand-new ThinkPad X13s powered by Snapdragon chips, a fifth-generation ThinkPad X1 Extreme with a WQXGA 165Hz screen option, and new additions to the P-series and T-series as well.</p><p id=\"2fjM1P\">The news I’m personally most excited about is the screen shape. A few months ago, Lenovo told me that much of its portfolio would be moving to the 16:10 aspect ratio this year. They appear to be keeping their word. Across the board, the new models are 16:10 — taller and roomier than they were in their 16:9 eras. </p><p id=\"syo1bJ\">Some news that’s a bit more... intriguing is the all-new ThinkPad X13s, which is the first laptop to feature the Snapdragon 8cx Gen 3 compute platform. Qualcomm made some lofty claims about this platform upon its release, including “60 percent greater performance per watt” over competing x86 platforms and “multi-day battery life.” The company has touted AI improvements as well, including better autofocus, auto-white balance, and auto-exposure in video calls. This will be an interesting system to test, as we’ve seen mixed results from the battery life and performance of the <a href=\"https://www.theverge.com/22620111/hp-elite-folio-2021-review-arm-windows-10-apps-features-specs-price\">8cx Gen 2</a>. These sorts of chips are generally found in devices with thinness and lightness as their top priority, rather than the high-powered machines I’d generally associate with the ThinkPad category.</p><p id=\"Zx6cwr\">Processor aside, the X13’s big calling card is portability. At 2.35 pounds (1.06kg), it’s not quite comparable to the lightest ThinkPads we’ve ever seen, but it’s still quite light for a laptop. It was quite easy to carry around Lenovo’s demo area with one hand. There’s no fan (which probably helps with the size and weight), but Snapdragon chips are designed to be quite efficient in the absence of heavy-duty cooling. </p><p id=\"RZSqwX\">Various parts of the chassis also include recycled materials, including the top and bottom covers, which are 90 percent recycled magnesium. This didn’t have a material impact on build quality that I observed in my brief time with the X13s — it felt as sturdy and well-built as any portable ThinkPad. </p>  <figure class=\"e-image\">        <img alt=\"The Lenovo ThinkPad X13s open on a white table angled to the left. The screen displays a blue ribbon pattern on a light blue background.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/A4ItBOAAPm6QJlZ_nZOr6V1CZN8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23275687/mchin_200512_5050_0006.jpg\">      <figcaption><em>Here’s the ThinkPad X13s.</em></figcaption>  </figure><p id=\"AyDqt6\">The big news on the workstation front is the ThinkPad X1 Extreme. This powerful multimedia machine has been bumped up to Intel’s 12th Gen Core i9 H-series processors supporting Intel’s vPro platform. It also has a 165Hz 16:10 display option for the first time (there’s a 4K offering as well). The cramped 16:9 screen was one of my few complaints about the <a href=\"https://www.theverge.com/22351156/lenovo-thinkpad-x1-extreme-gen-3-review-design-specs-price-features\">last X1 Extreme I reviewed</a>, so this is a big improvement in my book. </p>  <figure class=\"e-image\">        <img alt=\"The Lenovo ThinkPad T14s open on a white table angled to the right. The screen displays a crescent moon.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/A8xcHQTsG67tc1KikGBHcjn5QlA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23275685/mchin_200512_5050_0002.jpg\">      <figcaption><em>Here’s the new T14s.</em></figcaption>  </figure><p id=\"WDTSEq\">The T-series and P-series have been outfitted with 16:10 screens and FHD cameras across the board. They’ve also been bumped to new Intel processors; the T-series is also available with AMD’s Ryzen Pro 6000 chips. Both lines have 14-inch and 16-inch models. </p>  <figure class=\"e-image\">        <img alt=\"The Lenovo ThinkPad T16 on a white table open, angled to the left. The screen displays a mountain range from across a lake.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xB48s7LerpXVqiOPlm7ecdEECkE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23275686/mchin_200512_5050_0004.jpg\">      <figcaption><em>And here’s the new T16.</em></figcaption>  </figure><p id=\"fTSXE9\">Pricing and availability are a bit of a hodge-podge. Here’s the timeline: the P-series models and Intel T-series models will all be here in April, with prices ranging from $1,399 to $1,419. The X13s (starting at $1,099) will follow in May, as will the AMD T14s ($1,399). June will then bring the X1 Extreme Gen 5 ($2,049) and the rest of the AMD T-series models ($1,299). </p><p id=\"3h3Chi\">Photography by Monica Chin / The Verge</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n3JA10pUda0pfC5rdxUbzV4QGxg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23275689/mchin_200512_5050_0009.jpg",
  "description": "Plus, 16:10 across the board.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}