{
  "title": "Lenovo’s Slim 7i Carbon has 12th Gen chips and weighs just 2.13 pounds",
  "url": "https://www.theverge.com/2022/5/5/23055295/lenovo-slim-7i-carbon-9i-pro-x-laptop-release-date-specs-price",
  "date": "2022-05-05T11:00:00.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"The Lenovo Yoga Slim 7i Carbon on a white table in front of a blue background open and angled to the right. The screen displays a dark hallway with neon pink outlines.\" src=\"https://cdn.vox-cdn.com/thumbor/QsdbPUqA6zgdIcVDzSPcPD05R6s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70834524/mchin_200722_5194_0002.0.jpg\" />        <figcaption><em>This is the Slim 7i Carbon.</em></figcaption>    </figure>  <p id=\"67iWUs\">Lenovo has refreshed a number of models in its Slim line (known as Yoga Slim in some markets). A model I find interesting is the Slim 7i Carbon, one that Lenovo has subtitled “The Art of Mobility” in its press release. </p><p id=\"9FLVIo\">If that name sounds familiar, it’s because this looks to be a similar package to the AMD-powered <a href=\"https://www.theverge.com/2021/9/8/22661307/lenovo-ideapad-slim-7-carbon-oled-screen-light-laptop\">IdeaPad Slim 7 Carbon</a> (or Yoga Slim 7 Carbon outside of North America), which made a splash upon its announcement last year as the lightest 14-inch laptop to feature an OLED screen. (It’s 2.37 pounds.) Not only did that panel have a 90Hz refresh rate, but it could reach 600 nits of brightness, which is exceptionally bright for a consumer laptop (and especially for an OLED — those tend to be on the dimmer side). </p><p id=\"DndA7N\">With the Intel-equipped Slim 7i Carbon, Intel is demonstrating a bit of a shift in priorities. The 600-nit OLED screen is gone — the 7i has a still-fine-but-less-unique 2560 x 1600 IPS panel that can reach 400 nits, per Lenovo. This device, instead, is all about its portability. The Slim 7 Carbon had a 14-inch screen and was 2.37 pounds; the 7i is a 13.3-incher and weighs just 2.13 pounds. That means it will likely be one of the lightest laptops you can buy this season. </p>  <figure class=\"e-image\">        <img alt=\"The Lenovo Slim 7i Carbon on a white table seen from above. The screen displays a dark hallway with neon pink outlines.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CjozhmHIFv-ZRVjrjZjSnoS6Cq0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23438011/mchin_200722_5194_0003.jpg\">      <figcaption><em>An edge-to-edge keyboard makes the most of the small chassis.</em></figcaption>  </figure><p id=\"QwPkmW\">I spent a bit of time with the device, and was struck by how light it was. Lifting it really feels like lifting nothing — you could’ve fooled me into thinking I was holding a hollow chassis. </p><p id=\"DNZ1Ug\">But the Slim is made of “aerospace-grade magnesium alloy reinforced with multi-layer carbon fiber”, and didn’t feel flimsy as laptops of this size and weight sometimes do. While I didn’t want to try too hard to flex the chassis in Lenovo’s hands-on area, I wasn’t depressing the keyboard while I typed. I was also surprised by how nice the keys and touchpad felt when I tried them, since the device is just over half an inch thick. Both were roomy and comfortable to use. Those are hard to comment on without more extensive testing, but I didn’t see any red flags as I played around. </p><div class=\"c-float-right\"><aside id=\"gl23IR\"><q>I didn’t see any red flags as I played around. </q></aside></div><p id=\"qyd3F5\">This new release is in tune with a trend we’ve been seeing in small consumer laptops across the board these past few years: Thin is in. Last year’s <a href=\"https://www.theverge.com/22335874/lenovo-thinkpad-x1-nano-laptop-windows-business-intel-review-price-specs\">ThinkPad X1 Nano</a>, at 1.99 pounds, was the single lightest laptop Lenovo has ever released, and one of the lightest 13-inchers of all time. This year’s <a href=\"https://www.theverge.com/2022/1/4/22862528/lenovos-thinkpad-z-series-z13-z16-business-laptop\">ThinkPad Z Series</a> (which is supposed to be coming out soon), an entirely new segment of the ThinkPad line, is also hyper-focused on the thin and light build, and has compromised for that goal in areas where other ThinkPads generally don’t.</p><p id=\"x5JDMd\">Elsewhere, the 7i Carbon comes in three color options: “Moon White”, “Cloud Grey”, and “Storm Grey”. On the inside, the device includes Intel’s 12th Gen Core processors, including the Core i5-1240P and the Core i7-1260P. The latter was included in the <a href=\"https://www.theverge.com/23045104/samsung-galaxy-book2-pro-360-15-inch-review-a-light-and-bright-convertible\">Samsung Galaxy Book2 Pro 360 I just reviewed</a>, and demonstrated quite good performance and battery life. RAM can be configured up to 32GB with 1TB of storage. </p><p id=\"bhuPlv\">I will also note that while the screen is not an OLED one, it did look quite good. I actually asked the Lenovo team if I was looking at a real screen or a picture when I first saw the device from afar because of how crisp it looked. </p><p id=\"HwPzKI\">The Slim 7i Carbon will be available in June with a starting price of $1,299.</p>  <figure class=\"e-image\">        <img alt=\"The Lenovo Slim 7 Pro X on a white table in front of a blue wall angled to the right and open. The screen displays a puffin in front of a dark background.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LX1BvF1MNFVvWQfA8c4BDR53BnY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23438013/mchin_200722_5194_0005.jpg\">      <figcaption><em>And this is the Slim 7 Pro X.</em></figcaption>  </figure><p id=\"XKCm56\">Other interesting releases from Lenovo today include the Yoga Slim 7i Pro X and Yoga Slim 7 Pro X. These devices are much heavier than the Carbon, but still fairly portable at 3.5 pounds — and, more impressively, they can pack a discrete RTX 3050 GPU into that chassis. Such a combination isn’t unheard of in gaming laptops — models like <a href=\"https://www.theverge.com/22938516/asus-rog-zephyrus-g14-gaming-laptop-review\">Asus’s ROG Zephyrus G14</a> and <a href=\"https://www.theverge.com/22347032/acer-predator-triton-300-se-review-price-features-specs\">Acer’s Predator Triton 300 SE</a> have better GPUs and are not too much heavier — but it is a unique amount of power to see in a compact consumer-facing device. </p><p id=\"2NV0Sm\">I briefly played around with this as well, and I was surprised to hear how much it weighed — it felt pretty portable. As someone who carries their laptop around quite a bit, I’d rather have it in my backpack than a Triton. The rounded edges, in particular, give it a bit more of an office-y look and feel than some other GPU-equipped options you might find at this size.</p><p id=\"qacvtT\">If you do want an OLED screen, you may be more interested in the more expensive Slim 9i, which will include an OLED with either 2.8K or 4K resolution. This one appears to be more business oriented, coming equipped with AI-powered security features that include “hardware-level encryption engineered to help protect the device from root and ransomware attacks”. (The AI can also automatically adjust fan speed and performance settings, though this sort of thing <a href=\"https://www.theverge.com/22559671/gigabyte-aero-15-review-creator-laptop-price-specs-features\">can sometimes be more annoying than helpful</a> if it doesn’t adjust to your preferences.) The device’s sound is by Bowers &amp; Wilkins, the same firm that tuned the exceptional audio on the consumer-facing <a href=\"https://www.theverge.com/22569871/lenovo-yoga-9i-14-inch-laptop-review\">Yoga 9i</a>. </p><p id=\"YBVvk7\">The Slim 9i will stat at $1,799, while the Slim 7i Pro X and Slim 7 Pro X will start at $1,699 and $1,499 respectively. All three are expected in June. </p><p id=\"wSloqr\"><em>Photography by Monica Chin / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0E6YqPsAUph0jwigagI5gnhsu0Y=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23438010/mchin_200722_5194_0002.jpg",
  "description": "It’s got a 90Hz 2.5k touchscreen.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}