{
  "title": "Lenovo’s IdeaPad Duet 3 is a mid-sized Chrome OS tablet",
  "url": "https://www.theverge.com/2022/2/28/22954524/lenovo-11-inch-duet-3-chrome-os-tablet-ideapad-flex-5i-3i-chromebook-specs-price",
  "date": "2022-02-28T14:55:09.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Lenovo Chromebook Duet 3\" src=\"https://cdn.vox-cdn.com/thumbor/1QM7BIgGd2g5MXT7d34Lm_LG8AE=/0x0:4627x3085/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70559964/duet3.0.jpg\" />        <figcaption><em>The 11-inch Duet 3’s taller aspect ratio should make it more natural to use in portrait mode.</em> | Image: Lenovo</figcaption>    </figure>  <p id=\"BFRq9N\">Lenovo has announced a new Chrome OS tablet at Mobile World Congress 2022 that seems like a stellar value, along with a wave of other promising Chromebooks in its IdeaPad productivity lineup. The IdeaPad Duet 3 tablet seems to deliver more of what we liked about the 13-inch <a href=\"https://www.theverge.com/22838058/hp-chromebook-x2-11-lenovo-chromebook-duet-5-tablet-review-comparison-head-to-head\">Duet 5</a> tablet, but smaller. It’s an 11-inch tablet, which should make it easier to lug around, and to hold in your hands. Lenovo says it’s the successor to <a href=\"https://www.theverge.com/21262694/lenovo-chromebook-duet-review-tablet-chromebook-chrome-os-price\">the well-liked 10.1-inch Duet from 2020</a>.</p><p id=\"dbJPZI\">Compared to the larger Duet 5, the Duet 3 bumps the screen’s resolution from 1080p to 2K, while providing a slightly taller aspect ratio at 5:3 compared to 16:9 in the Duet 5. This should make the Duet 3 feel a little more natural to hold and view in portrait mode. The most notable difference between the two, apart from size, is that the Duet 3 has an LCD instead of an OLED — one of the Duet 5’s most alluring features.</p>  <figure class=\"e-image\">        <img alt=\"Lenovo Chromebook Duet 3\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4u4opnVKXfPUi1PvkLerYhsxRvg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277065/duet3keyboard.jpg\">      <cite>Image: Lenovo</cite>      <figcaption><em>A top-down view of the Duet 3 and its included keyboard.</em></figcaption>  </figure><p id=\"RN63xf\">Internally, much about the Duet 3 is similar to the Duet 5. It runs on Qualcomm’s Snapdragon 7c Gen 2 processor, and it can be configured with up to 8GB of RAM and 256GB of internal space. It has two USB-C ports with video, data, and charging capabilities, though you still won’t find a headphone jack here. Lenovo claims that the Duet 3 can last for 12 hours per charge.</p><p id=\"jI4wRs\">In the box, you’ll get a detachable keyboard that Lenovo says has water-resistant, anti-pry keys. Sadly, the company still isn’t including a stylus in the box, though its touchscreen display supports them.</p><p id=\"6cgzKD\">Lenovo plans to launch the Duet 3 in May 2022, starting at $399.99. </p><div id=\"QyzKlM\"><div data-anthem-component=\"imageslider:11070974\"></div></div><p id=\"Nt7voH\">Chromebook power users who want 2-in-1 flexibility should keep tabs on the 14-inch Flex 5i and 15.6-inch 3i. Their designs have a lot in common with <a href=\"https://www.theverge.com/22451261/acer-chromebook-spin-713-2021-review\">Acer’s Chromebook Spin 713</a>, the <a href=\"https://www.theverge.com/21296102/best-chromebooks\">reigning champ in the world of Chromebooks</a>, and the Flex 5i seems like a suitable competitor, with a 16:10 aspect ratio IPS display, a generously sized trackpad, and what sounds like promising performance: the 5i can go up to Intel’s Core i5-1235U processor (the base configuration stocks the Pentium 8505). The Flex 3i has a 16:9 aspect ratio screen, and starts with a Celeron N4500 processor, but it can be bumped up to the Pentium N6000. </p><p id=\"wBlxiT\">The 5i offers fingerprint biometrics, along with a 1080p webcam (720p in the Flex 3i). Given the Flex 3i’s larger screen size, its chassis has room for more keys, including a full number pad. Each model comes in a blue or silver colorway, though the specific hues vary depending on the model.</p>  <figure class=\"e-image\">        <img alt=\"Lenovo Chromebook IdeaPad Flex 5i\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Wo5LePzxTokI3mRRN8aSFekV32A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277080/flex5i.jpg\">      <cite>Image: Lenovo</cite>      <figcaption><em>A fingerprint sensor is one of a few perks available on the Flex 5i.</em></figcaption>  </figure><p id=\"jspgaP\">While neither is flush with ports, the Flex 5i and 3i include one USB-C 3.2 Gen 2 port, a USB-A 3.2 Gen 1 port, and a microSD card slot on the left side (it’s baffling that Lenovo didn’t include at least one Thunderbolt 4 port for the higher-spec configurations). The 5i features one more USB-C (3.2 Gen 1) port on its right side, next to its power button and volume rocker, whereas the 3i includes another USB-A port and an HDMI port.</p><p id=\"0TRwfo\">The Flex 5i will be released in June 2022, starting at $499.99. The bigger Flex 3i will come out a little earlier, in May, and will start at $399.99.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1vxDq0Yx2rWoYZHxIqNdPK-SpYk=/0x332:4627x2755/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23277061/duet3.jpg",
  "description": "These new Chromebooks will launch starting in May.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}