{
  "title": "Leonor Will Never Die is what true love of cinema looks like",
  "url": "https://www.theverge.com/22913161/leonor-will-never-die-review",
  "date": "2022-02-04T14:30:00.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hw55hFDQf9NG7YK8WSMJ3i1SDNQ=/443x0:4454x2674/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70470931/Screen_Shot_2022_02_01_at_4.37.29_PM.0.png\" />        <figcaption>Sheila Francisco as Leonor Reyes.</figcaption>    </figure>  <p id=\"Ryaxxm\">The elderly heroine of writer / director <a href=\"https://www.sundance.org/blogs/leonor-will-never-die-offers-a-genre-bending-ride/\">Martika Ramirez Escobar’s <em>Leonor Will Never Die</em></a> may not be the image that comes to mind when you think of an auteur filmmaker whose imagination is filled with an untold number of fantasies all yearning to be turned into blockbuster features. But the movie wants you to ask yourself: why not? Why can’t a retired lola from Manilla who’s perpetually late paying her electricity bill also be one of the most brilliant action directors of her era <em>and</em> someone who can only process existential crises by turning them into films within her mind?</p><p id=\"5hGsem\">Throughout <em>Leonor Will Never Die, </em>Leonor (Sheila Francisco) herself rarely stops to ponder these questions because of how essential filmmaking continues to be to her identity. Even though she’s long since stopped working professionally by the time we meet her, writing and dreaming up new worlds still comes as naturally to her as breathing and her reputation as one of the greats of the Pinoy action movie canon. Leonor tells herself that she’s comfortable living in her small apartment alongside her resentful-yet-caring son Rudy (Bong Cabrera), but both of them are constantly aware of how dysfunctional their relationship’s become following the death of Rudy’s brother (and Leonor’s favorite child in life), “Dead” Ronwaldo (Anthony Falcon).</p>  <figure class=\"e-image\">        <img alt=\"Rudy realizing that his mother hasn’t been keeping up with her bills again, as his dead brother Ronwaldo looks on.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gTlFPU31tzBc_VOQ57eUftnqCys=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215211/Screen_Shot_2022_02_03_at_8.41.53_AM.png\">      <cite>Cercamon</cite>      <figcaption><em>Rudy realizing that his mother hasn’t been keeping up with her bills again, as his dead brother Ronwaldo looks on</em></figcaption>  </figure><p id=\"g4n2bO\">Though Dead Ronwaldo is no longer among the living, he features largely throughout <em>Leonor Will Never Die </em>both as a kind of symbol for his family’s grief and as a translucent spectre who regularly talks and interacts with his still-living family members as if it’s no big deal. <em>Leonor Will Never Die </em>is purposefully opaque about how much of its heightened reality can be attributed to any actual supernatural forces and how much of it is a reflection of Leonor’s and her family’s shared love of overwrought storytelling. Leonor’s frustrations with her sons and her estranged husband, Valentine, as just as important as her love for them in their dynamic as a family unit, but all of their petty issues fall to the wayside after a freak accident involving a falling television leaves Leonor in a coma no one is certain she’ll wake from.</p><p id=\"jib1Za\">As alarming as Leonor’s accident is, it’s also <em>Leonor Will Never Die</em>’s major turning point and one of the earliest signs of the true brilliance and ambition of Escobar’s script. While everyone in the waking world is busy worrying about whether Leonor will survive, her coma transports her mind into the fantasy world of “Ang Pagbabalik ng Kwago” (The Return of Kwago), a dream reality with a 4:3 aspect ratio and an overarching narrative pulled from one of Leonor’s unfinished, semi-autobiographical screenplays.</p><p id=\"rojZDU\">All of the unarticulated pain and longing for creative freedom that Leonor hides from her family is laid bare as she giddily wanders through her personal fever dream with an uncanny omniscience that puts characters like a fictionalized version of Ronwaldo (Rocky Salumbides) on edge. Leonor herself isn’t entirely sure what to make of her newfound ability to exist in her own unfinished stories, but after spending so much time having her innate desire to create stifled and dismissed, she can’t help but dive headfirst into the escape and adventure “Ang Pagbabalik ng Kwago” promises to be.</p>  <figure class=\"e-image\">        <img alt=\"Leonor having a conversation with the fictionalized version of her son in front of a mirror.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/A5ys40Kfu4t94qKFC325paxSdxM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215214/Screen_Shot_2022_02_03_at_8.46.25_AM.png\">      <cite>Cercamon</cite>      <figcaption><em>Leonor bonding with a fictionalized version of her son Ronwaldo</em></figcaption>  </figure><p id=\"yn2wpq\"><em>Leonor Will Never Die </em>plays more of a playful celebration of classic Pinoy action features rather than a self-series love letter to the genre because of how thoroughly it picks apart and plays with its narrative elements before piecing them back together — almost as if to remind you how singular stories can be told in a variety of different ways. As Leonor, Francisco charms her way through scenes in the movie’s first half with an affability and ease that belies the danger lurking everywhere in “Ang Pagbabalik ng Kwago” and the perilousness of her situation in the real world. </p><p id=\"7nWJxG\">The deeper Leonor descends into her fantasy, the more energy <em>Leonor Will Never Die</em> puts into drawing your attention to the intricacy of its multiple stories-within-stories, all of which end up fitting together in a way that gives you a sense of Escobar’s own personal relationship to the filmmaking process. <em>Leonor Will Never Die </em>takes a turn towards the postmodern in its final moments that may confound viewers hoping for the film to close out by tying up every single one of the interesting threads it lays out. <em>Leonor Will Never Die </em>does end with an air of completeness and clarity — not necessarily for you as a viewer, or even for Escobar as a storyteller, but definitively for Leonor as a figure who achieves a kind of moving immortality befitting an artist of her undeniable talent.</p><p id=\"tSUTiX\">We caught <em>Leonor Will Never Die </em>as part of this year’s <a href=\"https://www.theverge.com/2022/1/27/22902494/sundance-film-festival-2022-best-movies\">Sundance International Film Festival</a>, where it won the Special Jury Award for Innovative Spirit. Currently, the movie is still being shopped around for a theatrical release.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/I7PTBmr-X5sFr-a9QFSipF-433w=/0x0:5107x2674/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23211025/Screen_Shot_2022_02_01_at_4.37.29_PM.png",
  "description": "Leonor Will Never Die is about achieving immortality through a singular love of cinema.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}