{
  "title": "Lincoln’s new electric concept car uses lo-fi beats and ‘fragrances’ to elevate your state of mind",
  "url": "https://www.theverge.com/2022/4/20/23034812/lincoln-electric-ev-2025-star-concept-reveal",
  "date": "2022-04-21T02:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yi0S-oCaQIEOL-msADBjaQMpbsE=/653x0:4253x2400/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70774436/Lincoln_Star_Concept_exterior_01.5.jpg\" />    </figure>  <p id=\"TZouuG\">Lincoln, Ford’s luxury brand, says it will release four new electric vehicles by 2026, by which point 50 percent of its global sales will be EVs. The company also revealed its Lincoln Star Concept as a way to introduce the new design language that will come to define its upcoming electrified lineup.  </p><p id=\"7AY4pr\">And what a concept it is! Carriage doors, a frunk that extends out like a drawer for added storage, a full-suite of sensory interior moods, and a sleek, aerodynamic profile that feels more Faraday Future than Ford. The Lincoln Star Concept is designed to be “the ultimate sanctuary” for wealthy elites who prefer to be chauffeured through the teaming megalopolises of the future. </p><div class=\"c-float-right\"><aside id=\"gVi3DL\"><q>Lincoln has been mulling plans to electrify its portfolio for months</q></aside></div><p id=\"r6cIuu\">Lincoln has been mulling plans to electrify its portfolio for months. The company had hoped to work with buzzy EV startup Rivian on an electric SUV, <a href=\"https://www.theverge.com/2020/4/28/21240212/ford-lincoln-cancel-rivian-suv-ev-coronavirus-pandemic-investment\">but that plan was thrown off by the pandemic</a>. Later, Lincoln considered introducing at least five new battery-powered SUVs through 2026, according to a <a href=\"https://www.reuters.com/technology/exclusive-fords-lincoln-brand-launch-full-slate-electric-suvs-by-2026-sources-2022-02-10/\">report in Reuters</a> last February. That includes battery-electric models to replace or supplement the Lincoln Corsair, Nautilus, Aviator, and Navigator, the newswire reported. </p><div id=\"KUNRZw\"><div data-anthem-component=\"gallery:11153734\"></div></div><p id=\"GIpp7a\">That appears to be have slightly paired back in this current iteration: three new fully electric vehicles by 2025, and a fourth by 2026. Lincoln also notes that it recently reported its best annual global sales in 21 years, up 7 percent over 2021. The company says it plans to “build on its momentum with the recent launches of the all-new Zephyr in China and the new Navigator in North America.”</p><p id=\"ccCBjX\">The Lincoln Star Concept is also meant to excite customers about what’s coming down the pike. The automaker claims the concept will use “design, light, displays, scents and sounds to create an immersive experience for clients.” That will include three distinct mood settings that combine digital graphics, lighting, and a variety of fragrances to help transport passengers to a calmer state of mind.</p><p id=\"et6Raf\">The mood settings include: </p><blockquote><p id=\"aZagA5\">Coastal Morning uses gentle, oceanic sounds, a fragrance of sea mist and the soft, warm glow of the sun with dynamic lighting throughout to replicate a stroll on the beach at sunrise.</p><p id=\"pNqQf5\">Mindful Vitality is meant to reenergize the senses, with invigorating, upbeat audio, dynamic abstract artwork, soft, glowing lighting and a flowery fragrance throughout.</p><p id=\"8PSLZF\">Evening Chill mirrors dusk using a calming night soundtrack coordinated with night sky video and an evergreen fragrance.</p></blockquote><p id=\"wHg8i8\">As it’s just a concept, Lincoln isn’t releasing any details about powertrain, battery, range, or charging. We can assume that the luxury brand will work hand-in-glove with its parent company, Ford, which is gearing up to start delivering its hotly anticipated F-150 Lightning pickup truck to customers. </p><p id=\"OldIhX\">Ford already has two EV platforms that could be used for future electric luxury SUVs. It seems possible that the company could announce an electric Navigator based on <a href=\"https://www.theverge.com/2021/6/7/22522488/ford-f-150-lightning-electric-pickup-truck-first-look-photos\">the F-150 Lightning</a> (which would be an interesting answer to <a href=\"https://www.theverge.com/2021/12/18/22843805/gm-ev-hummer-pickup-truck-delivery\">GM’s electric Hummer</a>) and a crossover based on the <a href=\"https://www.theverge.com/22265570/mustang-mach-e-review-electric-ford-ev-photos-video\">Mustang Mach-E</a> sometime in the near future. The automaker has said it expects to spend $30 billion on EVs and batteries through 2030. </p><p id=\"7RT3oU\"></p><p id=\"GEFfXO\"></p><p id=\"jW1lpy\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KVUSSK5fOLJ0YUrI0XWqsN7_DuI=/108x0:4692x2400/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23405244/Lincoln_Star_Concept_exterior_03.jpg",
  "description": "The Lincoln Star Concept is a tease of what’s to come.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}