{
  "title": "Logitech’s Lift is a low-cost vertical mouse that might convert you",
  "url": "https://www.theverge.com/2022/4/19/23030160/logitech-lift-ergonomic-vertical-wireless-mouse-price-features",
  "date": "2022-04-19T07:01:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Logitech Lift\" src=\"https://cdn.vox-cdn.com/thumbor/ufo-ToMq7lG5e3bWYW_16I_9LME=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70765512/akrales_220414_5141_0010.0.jpg\" />        <figcaption><em>Only the graphite-colored model pictured here is available in both left and right-handed options.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"oVaYYo\">Logitech has announced Lift, a $69.99 wireless vertical mouse that’s launching today in multiple colorways, as well as with both right- and left-handed options. The Lift features a vertically oriented design that puts your hand at a 57-degree angle for better ergonomics. Compared to using a traditional mouse, using mice like the Lift may help to greatly reduce wrist strain since you’re holding your wrist at a similar angle to shaking someone’s hand. At least, that’s what I experienced. Last year, I made the shift to a split ergonomic keyboard, and a mouse like the Lift completes the setup.</p><p id=\"tCLxVe\">For those keeping track, the Lift isn’t quite as fully featured as the <a href=\"https://www.theverge.com/circuitbreaker/2018/8/20/17724854/logitech-mx-vertical-mouse-ergonomic-design\">pricier $99.99 MX Vertical</a>, but it could be a good starting option if you don’t want to spend that much. It lacks USB-C charging, instead running off of a single AA battery that Logitech claims can (impressively) last up to two years. </p><div id=\"DtvOCD\"><div ><iframe src=\"https://www.youtube.com/embed/kWEbfrHi65A?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"bK9KbY\">The Lift ditches the elegant design of the MX Vertical for something that’s more simplified and playful (plus, you can get it in graphite, silver, or pink). It retains the rubber grip to keep it snug in your palm, and most of the same key functionality is here. The mouse has two main buttons, a scroll wheel that emphasizes smooth, quiet scrolling, a DPI switching button, and two thumb buttons. On its bottom, there’s a button for toggling between one of three devices that you can connect the Lift to (holding it doubles as the Bluetooth pairing button).</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\"Logitech Lift\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/D4B91RXPSoKfDgaOgzKYCB0Ynuc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390682/akrales_220414_5141_0035.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure></div><p id=\"WuQmy9\">This mouse supports Logitech Flow, the company’s unique software feature that allows the mouse to be used simultaneously on multiple computers — even if they run a different OS. You’ll need the Logi Options Plus app running on both computers; then, the cursor can travel from one PC to the other. The app can also be used to easily copy and paste files between machines. I’ve seen a hands-on demo of this software working, but it just wouldn’t cooperate with me at home.</p><p id=\"tUlIKW\">Logitech includes its new Bolt USB receiver with the Lift for quickly connecting to a PC that has a USB-A port. Compared to its previous unifying receiver, <a href=\"https://www.theverge.com/2021/9/1/22651973/logitech-logi-bolt-usb-dongle-bluetooth-security-le-keyboard-mouse-accessories\">this one boasts better security</a>. Or, you can utilize its Bluetooth function, which doesn’t require using a receiver. </p><p id=\"r0pLjc\">I’ve had just a couple of days alone with the Lift as my primary mouse, but the transition from a standard mouse has gone smoother than I anticipated. Aside from accidentally knocking my hand into the Lift and tipping it over (it’s much taller than your average mouse), the learning curve isn’t too bad since this mouse has a similar button layout to mice that I’m accustomed to using. If you’ve been curious about vertical mice, the Lift could be a good option to start with since it costs well under $100.</p>  <figure class=\"e-image\">        <img alt=\"Logitech Lift\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/h-V_9m5IS5W9zIFXuvRaUB0I0CU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390684/akrales_220414_5141_0046.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The Lift is very comfortable to use, thanks in part to the rubberized grip.</em></figcaption>  </figure>",
  "image": "https://cdn.vox-cdn.com/thumbor/xhwWVkmvwM-LDIKqzjFUKPZuGtc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390681/akrales_220414_5141_0010.jpg",
  "description": "It’s available for right and left-handed people.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}