{
  "title": "Looming oil crisis has energy watchdog begging people to drive less",
  "url": "https://www.theverge.com/2022/3/18/22985024/international-energy-agency-oil-crisis-drive-less",
  "date": "2022-03-18T20:10:32.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Mind The Gap Sign In London\" src=\"https://cdn.vox-cdn.com/thumbor/emQBJg3JWME650jYW_srsK6PB94=/0x0:5123x3415/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70643125/1239004614.0.jpg\" />        <figcaption>Mind the gap tube platform warning sign on a London Underground station platform on 5th March 2022 in London, United Kingdom.&nbsp; | photo by Mike Kemp/In Pictures via Getty Images</figcaption>    </figure>  <p id=\"sO3EdL\">With gas prices painfully high, there’s a new plea coming from the international agency established to secure the globe’s oil supply: drive less to avoid a deeper energy crunch. That was the key takeaway from a 10-point <a href=\"https://www.iea.org/reports/a-10-point-plan-to-cut-oil-use\">plan</a> the International Energy Agency (IEA) released today as the world nears peak oil demand season.</p><p id=\"j5rZaf\">“As a result of Russia’s appalling aggression against Ukraine, the world may well be facing its biggest oil supply shock in decades, with huge implications for our economies and societies,” IEA Executive Director Fatih Birol said in a <a href=\"https://www.iea.org/news/emergency-measures-can-quickly-cut-global-oil-demand-by-2-7-million-barrels-a-day-reducing-the-risk-of-a-damaging-supply-crunch\">press release</a>. “We can also take action on demand to avoid the risk of a crippling oil crunch.”</p><div class=\"c-float-right\"><aside id=\"BL4oOh\"><q>“The world may well be facing its biggest oil supply shock in decade”</q></aside></div><p id=\"4c8apl\">If advanced economies — which account for nearly half of global oil demand — can cut back on their oil habit,<strong> </strong>they could slash demand by 2.7 million barrels a day within four months, the agency says. That would be like erasing the demand for oil from<strong> </strong>all the cars in China, according to the IEA. </p><p id=\"A1MBik\">Some of the fixes that cut down on gas demand the most, per the IEA, are surprisingly simple. For starters, carpool. Of course, you could take public transport, walk, or bike instead. The IEA asks public transit operators to reduce their fares to encourage more people to take buses and trains.</p><p id=\"xdTXEf\">The IEA also proposes working from home several times a week to avoid the commute. Perhaps the biggest lift it proposes is for cities to designate “Car-free Sundays.” At the bottom of the list is a suggestion to “Reinforce the adoption” of electric and more efficient vehicles — electric cars <a href=\"https://www.theverge.com/2022/3/11/22973174/gas-prices-electric-vehicles-inventory-russia\">can’t save consumers</a> from soaring costs anyway.  </p><p id=\"Ckp7gF\">If you do need to take your old gas-guzzler somewhere, the IEA suggests you take other measures to improve fuel efficiency — like turning the air conditioning to a lower setting and monitoring your car’s tire pressure. Don’t drive as fast; the IEA recommends lowering speed limits. And of course, cars aren’t the only vehicles to use<strong> </strong>oil — when it comes to flying, the IEA recommends taking a train or other modes of transportation instead.</p><p id=\"nnyTbj\">While these measures were spurred by the immediate crisis of war, it’s worth getting used to these changes in the long run. After all, oil dependency is making other crises worse. “Reducing oil use must not remain a temporary measure,” the IEA <a href=\"https://www.iea.org/news/emergency-measures-can-quickly-cut-global-oil-demand-by-2-7-million-barrels-a-day-reducing-the-risk-of-a-damaging-supply-crunch\">said</a> today. “Sustained reductions are important not only to improve countries’ energy security but also to tackle climate change and reduce air pollution.”</p><p id=\"4RdAgK\"> </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/aXOGnhhVhW3a21ZrsYslT7L7ytM=/0x367:5123x3049/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23327872/1239004614.jpg",
  "description": "Drive less, energy watchdog says",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}