{
  "title": "Lost Ark is a grindy MMO that’s perfect to while away the hours",
  "url": "https://www.theverge.com/2022/2/18/22937386/lost-ark-amazon-games-free-to-play-mmo-diablo-clone",
  "date": "2022-02-18T22:19:48.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TW5loBRaBLyi1B699sPzWyCEPTQ=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70527370/LA_SS_02_XL.0.jpg\" />    </figure>  <p id=\"7RpqNE\">Debuting only a week ago, <em>Lost Ark</em> has <a href=\"https://www.theverge.com/2022/2/12/22930757/lost-ark-steam-most-played-game-launch\">shot to the top of the Steam charts</a>, amassing over 1 million concurrent players making it <a href=\"https://www.aboutamazon.com/news/entertainment/lost-ark-shatters-records-at-launch\">the most played game on Steam</a> (based on number of concurrents) of all time. Developed by Smilegate RPG, <em>Lost Ark</em> is a Korean MMO that debuted there in 2018 before being localized in English and brought to the west via a partnership with Amazon Games. Though it’s only been around in the US and Europe for a short time, it has over 200,000 viewers on Twitch right now and has beaten games like <em>Dota 2</em>, <em>CS:GO</em>, and <em>PUBG</em> in all-time number of concurrent players on Steam. </p><p id=\"1nOW6W\">So what the hell is a <em>Lost Ark</em> anyway? I spent a week investigating this new gaming hotness, eager to see if it has what it takes to become my newest obsession or something I’m content to let others obsess over. <em>Lost Ark</em> is a free-to-play MMO that plays like <em>Diablo</em>. It’s an isometric, action RPG that has all the cultural hallmarks of a free-to-play MMO including wildly underdressed female models and a game chat filled with spam from gold farmers. <em>Lost Ark </em>is mindless fun that won’t punish you for not taking it too seriously.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ue8BS5JFbLdDSVo1rSYPYPfnwIE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256025/lost_ark_screeenshot_008_1920x1080.jpg\">  </figure><p id=\"reV5HY\">I’m mostly satisfied with the character creator. A rainbow color wheel ensures you can be more than just a couple of shades of Black, and there are tons of sliders to fiddle with to make your character look exactly as you want. <em>Lost Ark</em> also correctly understands that there are more kinds of ethnic hairstyles than dreadlocks and afros; however, it doesn’t have more than a couple styles for kinky-haired people like me. When you start the game, you pick your class before you get to the character customization, and I find it very strange that some classes in <em>Lost Ark</em> are gender locked. If I want to play as a warrior, I have to play as a male, or if I want to play a mage, I’m locked into a female avatar. Each class has a number of specialized subclasses that you must choose immediately after picking your primary class. Since I wanted to play as a lady, I chose the sorceress subclass of the mage job, but I really wasn’t fond of her abilities. They felt weak and lacking an interesting “oomph,” so I created a new character, choosing a berserker warrior, and haven’t looked back since. </p><div class=\"c-float-right\"><aside id=\"6GNAf0\"><q>Lost Ark has all the cultural hallmarks of a free-to-play MMO, including wildly underdressed female models and a game chat filled with spam from gold farmers</q></aside></div><p id=\"L9tlNX\">Combat feels pretty decent. You’re given a number of abilities at the start that you can chain together to unleash some powerful combos, which are necessary in dungeons when enemies outnumber you 20-to-1. It’s satisfying hitting a bunched-up group of trolls with a devasting sword blow, felling them all in a single hit. It’s equally fun to spin in a circle, pulverizing the enemies dumb enough to approach my whirlwind of death. The most challenging aspect of <em>Lost Ark</em>’s combat is simply ensuring your abilities hit your enemies as intended. Using a mouse to move will oftentimes face you in the wrong direction, making your attacks bounce harmlessly into space (and, thankfully, if click-to-move doesn’t work for you, <em>Lost Ark</em> has controller support). If there are mechanics involved in sussing out an enemy’s weakness, then using that to your advantage to win, I haven’t found it. Bosses don’t really present a challenge. From what I’ve seen, they are merely damage sponges with multiple health bars to chew through. Though graphically flashy and powerful feeling, combat in <em>Lost Ark</em> doesn’t get complicated beyond point, click, win.</p><p id=\"6a8QvB\">The game throws an overwhelming number of systems and bars at you to keep track of, but most can be comfortably ignored. There’s a standard experience bar and a roster bar that oversees all your characters on a given server granting slight health and strength bonuses whenever it levels up. Throughout your travels, you can earn a dizzying number of items. Beyond normal loot like armor, weapons, and potions, there are also story items you can pick up that serve no purpose beyond right-clicking them to add them to your journal. </p><p id=\"2Y65xQ\">I sometimes don’t understand what <em>Lost Ark</em> is telling me. It’s a little too much information to absorb, and the game doesn’t make it seem like you’re missing too much by not reading tooltips too closely. Skippable mechanics abound. There’s an interesting rapport system by which you can increase how much NPCs like you by giving them gifts or simply emoting at them. I was at first excited by the prospect of forming a romantic relationship with an NPC, but it seems rapport is another meter to max out in order to win loot. Bummer.</p><div class=\"c-float-right\"><aside id=\"2FrzCp\"><q><em>Lost Ark</em> doesn’t get complicated beyond point, click, win</q></aside></div><p id=\"1CvBZ5\">The story seems as simple as the combat. You’re an adventurer come to a new land to find the titular lost ark object d’ power to fend off an army of demons. There’s more to it, I’m sure, but I’m going to be honest — I don’t care. You’re also probably not going to care — <em>Lost Ark</em> doesn’t feel like a game one plays for the story. It’s a clickfest where the numbers go up, and your enemies explode in all sorts of brain-pleasing ways. And that’s okay! Sometimes the body just needs something to do, a game for going through the motions. <em>Lost Ark </em>serves that up just fine. I really did try to absorb and understand everything the game was shepherding me through, but after the fourth quest of “talk to this person, then click this thing right next to them, then talk to them again, then click the thing again,” I gave up. I had a far more pleasing experience when I dispensed with trying. Instead, I thoughtlessly clicked my way through dungeons and quests while the third season of <em>Downton Abbey </em>played on my second monitor. </p><p id=\"36ONhr\"><em>Lost Ark</em>’s sudden and precipitous rise might be because it fills the <em>Diablo IV</em>-shaped hole in the hearts of those still waiting on that game’s release date. I’d be surprised if it can maintain its popularity beyond its first couple weeks of “newness,” but then again, <a href=\"https://www.polygon.com/22700460/new-world-server-mmo-queue-times-amazon-game-studios\"><em>New World</em></a> (another Amazon-published game) is still going on quite strong despite <a href=\"https://www.polygon.com/22760062/new-world-post-launch-bugs-exploits-chat-gold-duping\">its post-launch hiccups</a>.</p><p id=\"KfBEYI\">If you’re looking for a rich world you can get lost in or challenging combat that makes decent use of your grey matter, maybe skip <em>Lost Ark</em>. But if you need something to do for an hour or two and nothing else seems to interesting enough try, then give it a go.</p><p id=\"CFvBUE\"></p><p id=\"KC7jqh\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VcgPgcNZ83vojd4hvbzlBGoqAew=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23256029/LA_SS_02_XL.jpg",
  "description": "Got nothing to do and time to kill? Try Lost Ark.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}