{
  "title": "Lucid raises its EV prices as the company continues to struggle with production ",
  "url": "https://www.theverge.com/2022/5/6/23059976/lucid-motor-ev-price-increase-q1-2022-earnings",
  "date": "2022-05-06T17:04:43.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Gs_mF2j730YhZU3jEOKWuLsdzOI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70840409/ahawkins_210623_4646_0005.0.jpg\" />        <figcaption>Photo by Andrew Hawkins / The Verge</figcaption>    </figure>  <p id=\"og1lzz\">Lucid Motors is raising the prices of its luxury electric vehicles, as the company continues to struggle with production. The company reported delivering only 360 vehicles to customers in the first quarter of 2022.</p><p id=\"vCyAdQ\">As of June 1st, Lucid’s newly increased prices will be $154,000 for the Air Grand Touring (previously $139,000), $107,400 for Air Touring (up from $95,000), and $87,400 for Air Pure (up from $80,000). That represents an average increase of around 11 percent. The new Lucid Air Grand Touring Performance model, <a href=\"https://www.theverge.com/2022/4/12/23022720/lucid-air-grand-touring-performance-1050hp\">announced just two weeks ago</a>, will remain priced at $179,000. (All of Lucid’s vehicles are eligible for the $7,500 federal EV tax credit as well as any available state and local incentives.)</p><p id=\"BvWNCg\">In a call with investors, Lucid CEO Peter Rawlinson said the company would be honoring the original prices for existing reservation holders, addressing a key point that caused an uproar when Rivian announced a similar price increase. </p><div class=\"c-float-right\"><aside id=\"KY1kNO\"><q>“The world has changed dramatically from the time we first announced Lucid Air back in September 2020.”</q></aside></div><p id=\"i3apB5\">“The world has changed dramatically from the time we first announced Lucid Air back in September 2020,” Rawlinson said on the call. “And I want to assure our existing reservation holders that we will be honoring current pricing for all existing customers as well as new reservations made before the end of the month. In order to ensure fairness and prioritization, we will be reaching out to reservation holders to facilitate order configurations in order to lock in pricing as their specified model becomes available.”</p><p id=\"0OTG5U\">The company reported a loss of $81 million in the first quarter of 2022 on sales of $58 million. Last year, when the company had almost zero revenue flowing in, Lucid reported a loss of $2.9 billion.</p><p id=\"AnGCt6\">Lucid also said the number of reservations for its luxury Lucid Air sedan now exceeded 30,000, reflecting $2.9 billion in potential sales. The company had previously said it had received 25,000 reservations.</p><p id=\"VHAiVU\">Lucid has struggled to get cars off the factory floor amid supply chain woes and other disruptions caused by the COVID-19 pandemic. Last quarter, the Newark, California-based company announced it was revising down its annual production expectations to 12,000 vehicles from the original prediction of 20,000 vehicles.</p><p id=\"51WA9p\">Rawlinson also touted a 100,000 vehicle purchase agreement by the Kingdom of Saudi Arabia. “This is one of the single largest electric vehicle purchases that I am aware of and we are delighted to be supporting Saudi Arabia in achieving its sustainability goals and net zero ambitions by bringing our advanced luxury EVs to Saudi Arabia,” he said. </p><p id=\"X8NeNF\">Saudi Arabia’s sovereign wealth fund is a majority owner of Lucid, after having poured a $1 billion investment in the company back in 2017. Lucid said it has $5.4 billion in cash reserves to keep it running through 2023. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0E8Z76vjNQOs_Fz3V0WoWJFPB28=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22677727/ahawkins_210623_4646_0005.jpg",
  "description": "Lucid made 360 vehicles last quarter.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}