{
  "title": "Lucid brings a Performance upgrade to its most expensive electric car",
  "url": "https://www.theverge.com/2022/4/12/23022720/lucid-air-grand-touring-performance-1050hp",
  "date": "2022-04-12T23:05:55.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BBDUquJUx3W1hj_BbKTUklMsB_Y=/0x7:1920x1287/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70742373/gt_gray_desert.0.jpg\" />        <figcaption><em>Lucid Air Grant Touring Performance with “Aero Sport” rims.</em> | Image: Lucid</figcaption>    </figure>  <p id=\"dyppUe\">Lucid has a new high-performance version of its luxury all-electric sedan. The new <a href=\"https://www.lucidmotors.com/media-room/lucid-announces-grand-touring-performance/\">Lucid Air Grand Touring Performance</a> announced today (<a href=\"https://www.cnbc.com/2022/04/12/lucid-air-grand-touring-performance-debuts-with-1050-horsepower-446-mile-range.html\"><em>via CNBC</em></a>) can be selected as a variant via the company’s online configurator, which tops the standard Grand Touring’s 819 horsepower with 1,050.</p><p id=\"6wujMx\">This new model is actually not the most powerful of Lucid’s Air vehicles — that crown goes to the company’s 1,111 horsepower “Dream Edition” performance model, which is now sold out after a limited edition run. That performance Dream Edition model was touted as the only production electric vehicle to <a href=\"https://www.theverge.com/2020/9/2/21418065/lucid-motors-air-fastest-electric-car-quarter-mile-time-record\">achieve a quarter-mile time under 10 seconds</a> in 2020, which bested Tesla’s quickest Model S available at the time.</p><div class=\"c-float-right\"><aside id=\"ACeeMk\"><q>This performance model can’t quite beat the Tesla Model S Plaid</q></aside></div><p id=\"RaFD2R\">The new trim is hardly a performance downgrade from the Dream Edition, though. You still get 0–60 mph acceleration in 2.6 seconds, compared to the discontinued model’s slightly quicker 2.5 seconds. It’s also a notable improvement over the 3-second 0–60 mph time of the standard Grand Touring. And while the performance model can’t beat the Tesla Model S Plaid’s 1.99-second time, it can travel about 100 miles further on a single charge with its 446-mile range.</p><p id=\"BBBL7R\">That range is a bit less than the 516-mile range offered with the standard Grand Touring model, but Lucid includes unique 21-inch “Aero Sport” rims for the Air Grand Touring Performance, and it mounts staggered summer performance tires on them from the factory. All the added sportiness of the performance model will set you back $179,000 — a $40,000 premium over the standard Grand Touring model that makes it Lucid’s most expensive offering.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IZ9DPn9HYCvvssndFE62J75qFjU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385558/gt_launch_pr_hero.jpg\">      <cite>Image: Lucid</cite>      <figcaption><em>Lucid Air Grand Touring options</em></figcaption>  </figure><p id=\"0cwbuY\">Lucid has been slower with the rollout of production electric vehicles than it projected; it had to <a href=\"https://www.theverge.com/2022/2/28/22955518/lucid-motors-q4-2021-earnings-ev-air-deliveries\">cut up to 8,000 vehicles off its 2022 production forecast</a> due to supply chain challenges. The Newark, California-based company, as of February, only delivered about 300 vehicles on over 25,000 reservations to customers and employees.</p><p id=\"3D3dXY\">Lucid CEO Peter Rawlinson said that the new Air Grand Touring Performance answers to “the strong demand we continue to see for higher-performance versions of the Lucid Air.” And since Lucid builds its own motors and batteries, Rawlinson says the company can bring it to market in “remarkable speed.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bgP42zhLhIESAlQR5Bq-e5OjdWw=/0x145:1920x1150/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385469/gt_gray_desert.jpg",
  "description": "Lucid’s Air Grand Touring has a new Performance variant.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}