{
  "title": "Luminary’s CEO says the subscription podcast model ‘is working’",
  "url": "https://www.theverge.com/2022/3/8/22966998/hot-pod-luminary-ceo-interview-amazon-amp",
  "date": "2022-03-08T14:30:00.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ROSIswCqU2LjxVLQzzUxiZ3iBtY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70593606/akrales_190422_3386_0017.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"HGx0nv\">Hi again, everyone. With today’s issue, I’ve officially completed my first week as guest writer for Hot Pod. I want to thank everyone who’s been emailing me news and responses already — it’s made this newsletter a blast to write. Aria will be back for this week’s Insiders, but you’ll be hearing more from me soon enough. Now, for today’s news…</p><p id=\"MzHSYD\"><strong>Amazon launches its Clubhouse competitor</strong></p><p id=\"j5gymh\">Amazon finally announced its entrance into the live audio space this morning, with the launch of a new app called Amp.</p><p id=\"32cAl1\">Amp is <em>a lot </em>like Clubhouse — live broadcasts, a bunch of speakers hanging out in a room together — but it has one key difference: Amazon negotiated music licensing deals with the major labels and a bunch of indies, unlocking the ability for hosts to stream “tens of millions” of songs, no subscription required.</p><p id=\"4budRq\">Getting people to use a brand new social app is never an easy feat… and the live audio space is <em>pretty </em>crowded at this point, so I don’t want to make any prognostications about runaway success here. That said, I think the concept is pretty compelling. Everyone thinks they have great taste in music, and some people actually do. If Amazon can convince those people to start their own shows, it’s got a shot at turning Amp into a place for tastemakers to build an audience.</p><p id=\"3yXGZU\">A bunch of celebrity guests will be coming on to host shows to get people to sign up. That includes Nicki Minaj, Pusha T, and Travis Barker — but also, more relevant for this newsletter, some radio hosts, including Guy Raz, Zach Sang, and Kat Corbett.</p><p id=\"YBpzfy\">The app is launching a fairly limited beta for now. I have the full details in <a href=\"https://www.theverge.com/2022/3/8/22966229/amazon-amp-live-audio-radio-dj-clubhouse-competitor-ios-app\">a story right here</a>.</p><p id=\"Zj1LoK\"><strong>Luminary has much more to come</strong></p><p id=\"sudmkF\">Last week, Luminary announced a new investment, a new CEO, and a new partnership with Dave Chappelle. It was the first burst of good news — really any news — for the company in some time, and it was a suggestion that maybe Luminary’s subscription-only podcast model still has legs. I covered the news in <a href=\"https://hotpodnews.com/luminary-shakes-things-up/\">last week’s Hot Pod Insider</a>, but I wanted to include some more excerpts with my conversation with Luminary’s team here for everyone.</p><aside id=\"OmZot4\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside><p id=\"aR49dC\">Newly appointed Luminary CEO Rishi Malhotra told me “the model is working from a revenue basis” and that the service’s subscriber numbers continue to grow. (Though he declined to share if the service is profitable.) There’s some evidence of this externally, too. When Apple released a <a href=\"https://www.apple.com/newsroom/2021/11/apple-podcasts-presents-the-best-of-2021/\">list of top subscription podcast networks</a> in late November, Luminary was number two. The service now has “a couple hundred thousand” subscribers across platforms, Malhotra said.</p><p id=\"pE37RA\">Luminary has a lot of work to do to keep growing, though. I scanned the company’s website before my chat with Malhotra, and nearly all of the shows featured on the front page hadn’t posted new episodes in the past six months. In fact, if you look around Luminary’s website, it’s hard to find <em>any </em>shows that have updated recently. That’s a tough sell for a service with a monthly subscription fee.</p><p id=\"jGNFp0\">Malhotra says “a more regular cadence” will start up again in April, but he believes the catalog’s existing “depth” is enough to retain and gain subscribers for the time being. The company is now prioritizing new content focused on “music, sports, and comedy.” That includes several shows from Chappelle’s Pilot Boy Productions, which has a new show launching soon and “a couple” more in development, says Luminary co-founder Matt Sacks.</p><p id=\"QFsUQu\">But Luminary shows will continue to start and stop publishing throughout the year, Malhotra said, being produced in seasons more like a TV show. The team is thinking about developing an “evergreen pipeline of originals” backed up by new product features, Malhotra said.</p><p id=\"KkcANH\">Luminary got to the subscription podcast game early and didn’t make many friends with its controversial app strategy. But a few years down the road, subscription shows feel less out of place — plenty of other networks are signed up on Apple Podcasts, and a number of shows are making huge figures over on Patreon. From that perspective, Luminary has a head start in building out a rich network of subscriber-only shows. Now, it just needs to make more of them.</p><p id=\"MPLspF\"><strong>Yeah, YouTube wants more podcasts</strong></p><p id=\"JfuFr4\">YouTube is offering cash grants to podcasters to start filming their shows and putting them on the service, our good friend Ashley Carman writes <a href=\"https://www.bloomberg.com/news/articles/2022-03-04/youtube-offers-up-to-300-000-to-get-podcasters-to-make-videos\">over at <em>Bloomberg</em></a>. The company is reaching out to specific shows and networks, offering individual shows $50,000 and networks up to $300,000.</p><p id=\"KYgsY3\">As Ashley has covered here previously, YouTube became one of the biggest destinations in podcasting without even really trying. And now, I think it’s very clear the company is trying. (YouTube declined to comment.)</p><p id=\"VsWSAO\">The big hurdle, I suspect, will be the video investments necessary for a podcast to feel YouTube-native. YouTube may have once been full of poorly captured, goofy videos, but viewers today demand a degree of polish from creators. Some folks hanging out in a studio is all you need footage-wise, but that still requires an investment in cameras and the time and personnel to capture and edit it.</p><p id=\"HwW4lf\">As <a href=\"https://www.theverge.com/2022/3/1/22956382/hot-pod-summit-2022-recap-takeaways\">discussed at Hot Pod Summit</a> the other week, there’s a lot of potential upside for networks that do it right. And from the sound of it, YouTube is trying to lift that barrier to entry by covering the startup costs. If it works, surely the shows will stick around — and more will come. </p><p id=\"XeQhZa\"><strong>Netflix suspends service in Russia; TikTok suspends new video uploads</strong></p><p id=\"vctfGn\">Citing “the circumstances on the ground,” <a href=\"https://www.theverge.com/2022/3/6/22964565/netflix-shuts-down-services-russia-ukraine-invasion\">Netflix suspended its service</a> in Russia on Sunday. Around the same time, <a href=\"https://www.theverge.com/2022/3/6/22964418/tiktok-suspends-creation-new-video-content-russia-ukraine\">TikTok announced</a> it would “suspend livestreaming and new content,” citing the country’s new “fake news” law, which threatens prison time for anyone publishing what the state considers to be false information about the military.</p><p id=\"bzcPbS\">The law had <a href=\"https://www.nytimes.com/2022/03/04/business/western-media-operations-russia.html\">already led</a> news outlets including <em>Bloomberg </em>and the BBC to suspend the work of journalists operating in Russia, and networks including ABC and CNN announced they would stop broadcasting there. Now we’re seeing it start to impact large tech platforms over fears that even content that isn’t explicitly <em>news</em> could land them in trouble.</p><p id=\"mDVyDc\">There are a lot of deeply concerning implications here, but specific to this newsletter, I think it’s worth considering how long it’ll be before podcast platforms feel the same pressure to shut down. Podcast directories may only <em>list </em>shows, but could that constitute disseminating false information if one of the shows covers Ukraine? And what happens for a service like Spotify that hosts its own content if, say, Joe Rogan were to get in on covering the war? I’m not sure how long a company with employees in the region can stick around to find out.</p><p id=\"xVnIUB\"><strong>Parcast Union raises the temperature on Spotify</strong></p><p id=\"aE531y\">It’s been 17 months since Spotify recognized the Parcast Union, and the two parties are still negotiating a contract. Last week, the Parcast Union started to amp up pressure on Spotify, <a href=\"https://twitter.com/ParcastUnion/status/1499179691361456131\">publicizing an open letter</a> criticizing the company for rejecting its proposal to increase job candidate diversity. The proposal called for half of all candidates past the phone interview stage to come from underrepresented backgrounds, which the Parcast Union says would “align” with what Spotify agreed to for its other unions at The Ringer and Gimlet.</p><p id=\"YybrOF\">(Here’s also where I need to say, <em>disclosure</em>: the Parcast Union is organizing with the Writers Guild of America, East, the same union that represents editorial staff at <em>The Verge</em>.)</p><p id=\"voXqfN\">For what it’s worth, first contracts tend to take a while — it took two years for the Gimlet Union to nail down a contract with Spotify; The Ringer Union’s contract went quicker, but the two negotiations seemed to be happening in tandem in that case. Coming out of Spotify’s recent controversies around Joe Rogan, though, I can imagine the Parcast Union seeing provisions like these as more urgent than ever. Spotify declined to comment.</p><hr class=\"p-entry-hr\" id=\"A4EA3M\"><p id=\"sndPwF\">Thanks for sticking with me, everyone. We’ll have more for Insiders on Thursday and Friday.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RQ-9e5V9au59B3BjVztmD_ceRhk=/0x279:2040x1347/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16181958/akrales_190422_3386_0017.jpg",
  "description": "After all the drama, subscription podcasts are in vogue.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}