{
  "title": "Lyft brings carpooling back to more US cities",
  "url": "https://www.theverge.com/2022/5/5/23057729/lyft-shared-rides-carpool-expand-cities",
  "date": "2022-05-05T16:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Fa4BYUR4mKAHRafF377b0YKodko=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70835765/acastro_180927_1777_lyft_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"654pH0\">Lyft Shared rides, the ride-hail company’s carpooling service, is returning to more US cities this month. The return of carpooling comes as the company struggles to rein in its spending in response to an ongoing driver shortage and high gas prices. </p><p id=\"F4Tp5T\"><a href=\"https://www.theverge.com/2020/3/17/21183276/uber-uberpool-suspension-coronavirus-us-canada-carpool-pandemic\">Lyft suspended carpooling</a> in March 2020 in response to the COVID-19 pandemic to help curb the spread of the virus. About 16 months later, shared rides slowly returned to a small number of markets. And now, it’s returning to even more cities. (Uber started <a href=\"https://www.theverge.com/2021/11/4/22764246/uber-pool-prices-shared-ride-covid-earnings\">bringing its Uber Pool service back to cities</a> last fall.)</p><p id=\"OBkX8A\">In May, Lyft Shared rides will return to five US cities: San Francisco, San Jose, Denver, Las Vegas, and Atlanta. The company has been operating its carpooling service in Philadelphia and Miami since last summer. </p><div class=\"c-float-right\"><aside id=\"2Fb0Ug\"><q>San Francisco, San Jose, Denver, Las Vegas, and Atlanta</q></aside></div><p id=\"WJAYQR\">Lyft said it has made some changes to shared rides to make it better and more reliable for passengers and drivers alike. Before the pandemic, carpooling was often the cheapest option on Lyft’s platform. But many drivers hated it, complaining about low customer ratings, an inefficient algorithm, and roundabout directions that tend to annoy riders despite the low fare.</p><p id=\"V1aroE\">Lyft says shared rides will be optional for drivers in 2022 “without penalty,” meaning drivers can opt out of shared rides without sacrificing their rating or access to the platform. Lyft is also restricting each shared ride to just two passengers, which the company argues will help make the rides more efficient and cut down on unnecessary detours. </p><p id=\"JP3vWk\">“As one of our most in-demand and affordable ride options, we look forward to gradually bringing Shared rides back,” said Lyft’s Head of Rideshare, Ashwin Raj. “We recognize the world has changed and our offerings need to evolve with it. That’s why we are bringing Shared rides back in phases and listening to feedback along the way–all so we can continue to deliver the best possible service for our riders and drivers.”</p><p id=\"CxOLtc\">Along with its rival Uber, Lyft has been struggling to recover from the COVID-19 pandemic, as drivers fled the platform, wait times increased, and the cost of rides soared. High gas prices continue to wreak havoc on the ride-hailing platform, with some drivers working less or not at all. The company said it will need to spend more on driver incentives, sending its <a href=\"https://www.businessinsider.com/surging-gas-prices-lyft-uber-spending-more-lure-drivers-back-2022-5\">stock price tumbling over 25 points this week</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-MppLVXjRYxo-R6eV-46Zj0lgzw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13175191/acastro_180927_1777_lyft_0003.jpg",
  "description": "Lyft made changes to make it less annoying for drivers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}