{
  "title": "Madden players can’t quit the game they hate",
  "url": "https://www.theverge.com/22921824/madden-nfl-football-trash-talk-youtube-backlash",
  "date": "2022-02-09T15:00:00.000Z",
  "author": "Kevin Nguyen",
  "content": "      <figure>      <img alt=\"A screenshot of Madden 22, the only licensed NFL video game on the market. Fans don’t have any other choice if they want to play a football video game, and they seem to love and hate the annual franchise in equal measures.\" src=\"https://cdn.vox-cdn.com/thumbor/a-mHVPN-umCqOtO_CTQlHv9xN6E=/0x0:3456x2304/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70488033/FHDpwPOXMAUQIu1.0.jpeg\" />        <figcaption><em>EA Sports’ Madden 22 in action.</em> | Image: EA Sports</figcaption>    </figure>  <p id=\"OWAEEx\">Andrew Belton makes a living playing <em>Madden</em>, a game he does not particularly like.</p><p id=\"mk1Cao\">In his videos, he challenges “trash-talkers” who leave him insulting Instagram DMs, arguing, with colorful language, that they could kick his ass in the game. So Belton spends his time beating up on randos — and the occasional pro athlete — all while teasing and taunting them back for his YouTube audience. This is the part he does like: winning, especially when it’s against people who are so disrespectful. He goads them into risky passes and encourages them to go for it on fourth down when the sensible decision would be a punt.</p><p id=\"ASm4nq\">Watching Belton’s channel, <a href=\"https://www.youtube.com/c/ABGotGame/videos\">ABGotGame</a>, the only thing he roasts more than his opponents? <em>Madden</em> itself. Common refrains: “This game is trash” or “this game is <em>so</em> bad.” Throughout any video, Belton is cursing the game’s developer, EA Sports, like it is some kind of malevolent god. An errant throw? “EA!” Taking a sack? “EA!!” Missing an easy interception? “EA!!!!!!!!! This game is trash!!!!!!!!!!!” </p><div class=\"c-float-right\"><aside id=\"t7xBcf\"><q>“This game is trash”</q></aside></div><p id=\"2GbCmI\">In January 2022, he posted a video titled <a href=\"https://www.youtube.com/watch?v=87DP4__bpQQ\">“I’ve never seen this before...You win EA...I’m never playing Madden again…”</a> But a week later, Belton posted another <em>Madden</em> video. If you’d been following his channel for a while, as I had, you knew he was never going to quit.</p><p id=\"NLbJzM\">What’s funny about <em>Madden </em>— the sole NFL licensed video game franchise, now 34 years going — is that despite its massive popularity, all you ever hear is people complaining about it.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/E3dvc5gqP8XohyHCSqKWAH_qRkc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23223745/mad22_diggs_16x9.jpg.adapt.crop16x9.818p.jpg\">      <cite>Image: EA</cite>  </figure><p id=\"WZeFxf\">The main criticism, repeated often, is that each year’s new version is just a slight upgrade over the last. Since EA Sports has the exclusive license, it is the only company that can make a “simulation-style” NFL game. Thus springs an argument that the developer is under no pressure to meaningfully improve the game each year. In 2020, a viral Twitter campaign urged the league to release EA as its partner — #NFLDropEA. But even with the social media outrage, which also involved coordinated review-bombing of the game’s Metacritic page, <a href=\"https://www.polygon.com/2020/9/16/21436929/madden-nfl-21-review-scores-sales-figures-ea-2k-sports-nba-2k21-metacritic\"><em>Madden 21 </em>sales were way up</a>. This year’s <em>Madden 22</em> did well, too, and the series continues to be the best-selling sports franchise of all time.</p><p id=\"24lQC9\">The critics come from a vocal minority, but a minority whose job it is to be extraordinarily vocal. I’m talking about YouTubers, who make a living streaming and recording themselves playing a game they claim they hate.</p><p id=\"6Azugu\">The sprawl of different YouTuber focuses speaks to just how large the game is these days. There are YouTubers like Belton who post footage of themselves playing; there’s a wide selection of people uploading tips and tricks; then there are those dedicated to dunking on <em>Madden</em>.</p><p id=\"ekmslS\">Last fall, one channel called SOFTDRINKTV posted a 14-minute video titled “The Worst Madden of All Time,” followed a week later by a 19-minute video called “Madden NFL 22 is NOT GOOD - Review.” They returned to a similar well recently with one titled <a href=\"https://www.youtube.com/watch?v=q9iyWGEwHos\">“Everything Wrong with Madden NFL 22 (in 16 minutes).”</a> The narration of that one opens memorably, if not somewhat dramatically: “This is the kind of game that makes you want to stick a thumbtack in your eyeballs. When you play <em>Madden 22</em>, the gift of life becomes a curse. You will no longer want to be alive. It causes existential dread.”</p><p id=\"NlFm5b\">Like any subculture, <em>Madden</em> has its own slang. Precise throws are “lasers” (self-explanatory). Often a good throw is a “dot” — you get “dotted up” — which somehow mutated from “dart” (less self-explanatory). Similarly, strong defensive coverage used to be “bagged,” though recently, I’ve heard YouTubers saying “booked.” The only one that makes sense to me is “mossing” somebody, which is when a receiver leaps over a corner to snatch the ball out of the air, inspired by Randy Moss.</p><div id=\"hgZVf2\"><div ><iframe src=\"https://www.youtube.com/embed/87DP4__bpQQ?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"qUsFVq\">But hating <em>Madden</em> seems to be just as big a part of the culture, even if it appears somewhat performative at times. The subreddit <a href=\"https://www.reddit.com/r/Madden/\">r/Madden</a> is almost entirely “rants” about why the game sucks, usually just a video clip of a glitch or bug. The <a href=\"https://www.tiktok.com/tag/madden22?lang=en\">#Madden22 tag on TikTok</a> is equal parts highlights, equal parts calling out busted plays that EA should fix.</p><p id=\"3uuGhx\">Of course, if you hate a video game so much, why keep playing it, year in and year out?</p><p id=\"mncxHu\">For Andrew Belton, <em>Madden</em> earns him his keep. He’s been playing since the 2005 <em>Madden</em>, but more crucially, YouTubing since the 2018 <em>Madden</em>. His channel has grown to the point where he makes a living doing it — enough to move out of his parents’ place and into an apartment in Brooklyn. (He also sells ebooks with <em>Madden</em> tips through his Patreon, which he estimates makes a third of his revenue.)</p><div class=\"c-float-right\"><aside id=\"2xe7bq\"><q>Why keep playing it, year in and year out?</q></aside></div><p id=\"dbw7de\">The trash-talking concept didn’t originate with Belton. Though he’s probably the most prominent person doing it on YouTube for <em>Madden</em>, trash-talk videos are popular in other sports games like <em>NBA 2K</em>. (Another game that Belton hates: “I thought <em>Madden</em> was infuriating, but <em>2K</em> actually makes me... I can’t play it; that’s how angry it makes me.”)</p><p id=\"ZYDhsn\">For the channel, Belton plays a few games a week — and tosses any that are too boring to post. Finding the right trash-talkers is an art of sorts. “I’ve noticed with these trash-talkers: the more trash they talk, the worse they are at the game,” Belton says. For good videos, he needs an opponent to both be good at the game and to be obnoxious as possible.</p><p id=\"Auu0ij\">But outside of making videos for his YouTube channel, Belton rarely plays <em>Madden</em> for fun. Most of his day is spent editing. A game lasts under an hour, but editing that video takes another eight.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gOaoWB-paiwmyfCcYlQDKkVU4zU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23223748/FHjoD7wXIAIXxIp.jpeg\">      <cite>Image: EA</cite>  </figure><p id=\"4GjHPf\">He tells me he wants to start a new channel — one where he plays different games. </p><p id=\"tgb0Sn\">“I love <em>Call of Duty: Warzone</em>. I’m just getting back into <em>Fortnite</em>. I’m getting beat up every game, but I like it. And then I want to try other games, like PC games, scary games, stuff like that,” he says.</p><p id=\"qd4Ys2\">But, unfortunately, the game he is good at — the one in which he can consistently torch the competition — is still <em>Madden</em>.</p><p id=\"sWzMQ6\">I ask him if it’s possible that he’s just soured on the game since it’s his source of income or whether he really thinks the issue is the quality of the game.</p><p id=\"icv9po\">“No, no, no, I think it’s 100 percent because of <em>Madden</em>,” he says. “If this wasn’t my job, I wouldn’t play the game at all.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1Pz98TmcZ8AzZ1g_r6iazAojyZA=/0x0:4096x2145/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23223742/FHDpwPOXMAUQIu1.jpeg",
  "description": "The series continues to be the best-selling video game sports franchise of all time.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}