{
  "title": "Major exchanges delist Terra stablecoin as price collapse continues",
  "url": "https://www.theverge.com/2022/5/13/23070853/crypto-exchanges-delist-terra-stablecoin-luna-binance",
  "date": "2022-05-13T15:59:49.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Y6csFBQF8zSlruAUGBUkAZkKKNo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70865653/acastro_210319_1777_nft_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"0WUjBX\">As the Terra crisis draws on, some of the largest cryptocurrency exchanges in the world have begun to delist Terra’s UST stablecoin and its linked Luna token, citing a need to protect users from risk.</p><p id=\"PgMvGv\">Binance, the largest cryptocurrency exchange by trading volume, <a href=\"https://techcrunch.com/2022/05/12/binance-halts-luna-and-ust-trading-across-most-of-its-spot-pairs-following-meltdown/\">halted the trading of Luna and Terra</a> on Thursday. The OKX exchange — one of the top 10 by volume — <a href=\"https://www.coindesk.com/markets/2022/05/13/okx-delists-terras-luna-and-ust-citing-user-protection/\">took the same action</a> shortly afterward. The FTX exchange and other smaller exchanges <a href=\"https://www.coindesk.com/markets/2022/05/13/luna-ust-still-available-on-ftx-and-other-exchanges-despite-terra-blockchain-halt/\">continue to list and trade</a> the Luna and UST tokens.</p><p id=\"6frCEa\">The delistings come in response to <a href=\"https://www.theverge.com/2022/5/12/23069232/terra-luna-collapse-stablecoins-crypto-crash-bitcoin\">a broader collapse</a> in the economics of the Terra project. After the UST stablecoin fell well below its dollar peg on May 9th, an algorithmic process meant to balance the price at close to $1 triggered hyperinflation in the Luna token, crashing its price from $100 to less than 1 cent.</p><p id=\"jbtI4e\">In responding to the crisis, the operators of the Terra blockchain have repeatedly <a href=\"https://twitter.com/terra_money/status/1524935730308456448\">halted</a>, then <a href=\"https://twitter.com/terra_money/status/1525095111389945857\">unpaused</a> the network, compounding the frustration of investors in the project. (When a network is not processing new blocks, no transactions can be made with any assets hosted on that blockchain.)</p><p id=\"MHLmYO\">Binance CEO Changpeng Zhao posted a <a href=\"https://twitter.com/cz_binance/status/1525060769771048960\">Twitter thread</a> explaining the rationale behind suspending trading of the Luna from the platform.</p><p id=\"WVrxxI\">“An exponential amount of new LUNA were minted due to flaws in the design of the Terra protocol. Their validators have suspended their entire network, resulting in no deposits or withdrawals possible to or from any exchange,” Zhao said.</p><p id=\"K00SZu\">“Some of our users, unaware of the large amounts of newly minted LUNA outside the exchange, started to buy LUNA again, without understanding that as soon as deposits are allowed, the price will likely crash further. Due to these significant risks, we suspended trading,” he said.</p><p id=\"e9yKuY\">Some exchanges also have also been caught off-guard by the frantic scramble to cash out from users invested in the Terra project.</p><div class=\"c-float-right\"><aside id=\"3IZ4dN\"><q>“Due to these significant risks, we suspended trading.”</q></aside></div><p id=\"MlLpz4\">The Crypto.com exchange issued a statement Friday highlighting an incident in which users who traded Luna were quoted an incorrect price.</p><p id=\"TGI7FV\">“All impacted trades (buy and sell) will be reversed, and affected users will be credited USD $10 in [Crypto.com token] CRO for the inconvenience caused,” the statement said. Crypto.com also said that all Luna trading would be halted until further notice, though a Twitter post from the exchange stated that users could <a href=\"https://twitter.com/cryptocom/status/1525118635282513920\">withdraw the Luna token</a>.</p><p id=\"f7K4Nf\">Elsewhere, another group of investors trying to move their money out of Terra ran into problems <a href=\"https://cryptoslate.com/coinbase-users-lose-wormhole-luna-ust-after-sending-it-to-the-exchange/\">sending UST to the Coinbase exchange in an unsupported format</a>, resulting in lost funds. As of May 13th, an <a href=\"https://help.coinbase.com/en/coinbase/getting-started/crypto-education/ust\">advisory</a> on the Coinbase site said that the exchange supported UST but not UST in the wrapped Wormhole form.</p><p id=\"IscOq5\">Shockwaves from the Terra crash continue to ripple across the cryptocurrency markets, which have experienced <a href=\"https://www.cnn.com/2022/05/12/investing/premarket-stocks-trading/index.html\">significant losses and panicked trading in the past week</a>. But, as of Friday, there were signs that other cryptocurrencies could be insulated from Terra’s woes: Bitcoin prices rallied to reach $30,000 after failing to trade above $25,000 on the previous day.</p><p id=\"YkM5yB\">Other stablecoins seem to have escaped Terra’s fate: Tether, the largest stablecoin by market capitalization, has <a href=\"https://www.cnbc.com/2022/05/13/tether-usdt-stablecoin-regains-peg-after-3-billion-in-withdrawals.html\">regained its dollar peg</a> after dropping as low as 95 cents on Thursday.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VlKzUjc5jhaHb2tdRHikzBpddu0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22383046/acastro_210319_1777_nft_0001.jpg",
  "description": "\"Due to these significant risks, we suspended trading.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}