{
  "title": "Mars helicopter spots wreckage from Perseverance landing ",
  "url": "https://www.theverge.com/2022/4/29/23044697/mars-nasa-ingenuity-helicopter-perseverance-space",
  "date": "2022-04-29T14:27:01.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/10LWNpZSlyvsTpdBBoGBC3IdLXY=/0x37:1734x1193/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70810147/Screen_Shot_2022_04_28_at_11.36.07_AM.0.png\" />        <figcaption>Ingenuity captured images that shows debris from the Mars landing site featuring Perseverance’s parachute and backshell | Image: NASA/JPL-Caltech</figcaption>    </figure>  <p id=\"YLQUnr\"><a href=\"https://www.jpl.nasa.gov/news/nasas-mars-helicopter-spots-gear-that-helped-perseverance-rover-land\">New pictures</a> from the Ingenuity helicopter offer a fresh perspective of the wreckage left behind when the Perseverance rover landed on Mars last year, NASA said<strong> </strong>on Wednesday. </p><p id=\"CVvP7J\">Launched in 2020, the Perseverance rover <a href=\"https://www.theverge.com/2021/2/18/22289668/nasa-mars-perseverance-rover-success\">successfully landed</a> on the Red Planet in 2021, with the mission of finding ancient signs of life on Mars. The rover carried the<strong> </strong>Ingenuity helicopter onboard — an experimental project that scientists on Earth hoped would be able to see sights that the rover couldn’t. </p><p id=\"odFhBt\">Perseverance went through a grueling process known as the seven minutes of terror to descend onto the Martian surface. As it entered the atmosphere, a heat shield helped protect the rover from the blistering heat of reentry and slowed it down dramatically. After that, the massive parachute deployed out of the backshell (a cone-shaped part of the descent vehicle), slowing it down even more. At that point, the backshell and parachute separated from Perseverance and let the descent stage take over, using rocket thrusters and a “sky crane” to gently lower the rover to a smooth landing. </p><div id=\"5upkeh\"><div ><iframe src=\"https://www.youtube.com/embed/4czjS9h4Fpg?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"57ADMX\">On April 19th,<strong> </strong>Ingenuity took photographs that captured the remains of<strong> </strong>Perseverance’s parachute and the rover’s protective backshell, a cone-shaped part of the descent vehicle that carried<strong> </strong>the parachute and helped protect the rover on its way to the surface. Strewn around the site were<strong> </strong>debris from where the two crashed into the surface after separating from the rover. The backshell ended up hitting the ground at about 78 miles per hour, according to NASA. From the pictures, it appears that the parachute, the lines connecting the parachute to the spacecraft, and the coating on the outside of the backshell all survived the trip to the surface, NASA says, though more analysis of the pictures will happen in the coming weeks. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OqNPs8jgnTBSNrXYqL5pjHJT2Zs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23422964/Screen_Shot_2022_04_28_at_11.36.07_AM.png\">      <cite>Image: NASA/JPL-Caltech</cite>      <figcaption><em>Ingenuity captured images that show debris from the Mars landing site featuring Perseverance’s parachute and backshell.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-untkkYUtYzyM7TslnTK85ZPhJQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23422981/Screen_Shot_2022_04_28_at_11.36.16_AM.png\">      <cite>Image: NASA/JPL-Caltech</cite>      <figcaption><em>The photos were captured during Ingenuity’s flight on April 19th.</em></figcaption>  </figure><p id=\"jDwdsW\">“Perseverance had the best-documented Mars landing in history, with cameras showing everything from parachute to inflation to touchdown,” Ian Clark, former engineer of the Jet Propulsion Laboratory, <a href=\"https://www.jpl.nasa.gov/news/nasas-mars-helicopter-spots-gear-that-helped-perseverance-rover-land\">said in a NASA blog post</a>. “Ingenuity’s pictures offer a different vantage point. If they either reinforce that our systems worked as we think they worked or provide even one dataset of engineering information we can use for Mars Sample Return planning, it will be amazing. And if not, the pictures are still phenomenal and inspiring.” </p><p id=\"J9Tpm2\">The <a href=\"https://www.theverge.com/2021/3/22/22345034/nasa-mars-rover-perseverance-ingenuity-helicopter\">Ingenuity helicopter</a>, deployed a month after Perseverance, was the first object to <a href=\"https://www.theverge.com/2021/4/19/22391496/nasa-ingenuity-helicopter-mars-flight-success\">achieve powered flight on another world</a>. After it became clear that this could be achieved, <a href=\"https://www.theverge.com/2021/4/30/22412154/nasa-ingenuity-aces-fourth-flight-mars-advance-new-testing\">Ingenuity’s mission was extended</a>, and now it’s working alongside Perseverance for scientific observations. </p><p id=\"v9q5py\">The Perseverance team is now<strong> </strong>looking to use Ingenuity to help them decide which path<strong> </strong>Perseverance should take<strong> </strong>to get to the top of a dry river delta in Mars’ Jezero Crater, which scientists think is its best chance to search for signs of ancient life on the planet. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YH1kdwstRJeFUYHMWXaF-uebeeE=/0x161:1734x1069/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23422964/Screen_Shot_2022_04_28_at_11.36.07_AM.png",
  "description": "The new photos show images taken on April 19th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}