{
  "title": "Marvel Studios is licensing Stan Lee’s likeness from the company he sued before his death",
  "url": "https://www.theverge.com/2022/5/18/23123057/marvel-studios-stan-lee-likeness-pow-entertainment",
  "date": "2022-05-18T19:58:01.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Nqln2bxnwBtnG3FcXRlXvAeHoCA=/267x0:2049x1188/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70884703/Screen_Shot_2022_05_18_at_9.48.33_AM.0.png\" />        <figcaption>Stan Lee as he appeared in Avengers: Age of Ultron. | Image: Marvel Studios</figcaption>    </figure>  <p id=\"6R2ACL\">Even though <a href=\"https://www.theverge.com/2018/11/12/18088554/stan-lee-death-obituary-marvel-comics\">Stan Lee has been dead since 2018</a>, a new deal between Marvel Studios and POW! Entertainment may be a sign that the legendary comics creator’s going to be appearing in more than a few Marvel-branded projects in the near future.</p><p id=\"MSE1cj\">POW! Entertainment, the production house Stan Lee co-founded in 2001 and <a href=\"https://gizmodo.com/stan-lee-sues-company-he-co-founded-for-1-billion-for-1826138252\">subsequently sued in 2018</a> for allegedly forging his signature on legal documents, has entered a licensing agreement with Genius Brands and Marvel Studios granting the Hollywood giant the right to use Lee’s likeness in its upcoming projects. In <a href=\"https://www.gnusbrands.com/news/press-releases/detail/1162/genius-brands-signs-20-year-deal-with-marvel-studios-to\">a press release</a> about the 20-year deal, Genius Brands CEO and chairman Andy Heyward expressed feelings of pride and stewardship for “the incredibly valuable rights to Stan Lee’s name, likeness, merchandise, and intellectual property brand.”</p><p id=\"jrqWfl\">“There is no better place than Marvel and Disney where Stan should be for his movies and theme park experiences,” said Heyward. “As we enter the centennial year of Stan’s birthday, December 28th, 2022, we are thrilled to see his memory and legacy will continue to delight fans through this new long-term agreement with Marvel.”</p><p id=\"dANxb9\">In the years and months leading up to Lee’s death in 2018, his life was marked by <a href=\"https://gizmodo.com/report-stan-lees-stolen-blood-stolen-was-used-to-sign-1825022655\">scandalous allegations</a> of <a href=\"https://gizmodo.com/report-the-stan-lee-saga-is-only-getting-stranger-and-1825149805\">elder abuse</a> as well as financial woes that seemingly stemmed from his being surrounded by <a href=\"https://gizmodo.com/stan-lees-saga-continues-with-a-restraining-order-again-1826807400\">people looking to cash in on the X-Men co-creator’s name</a>. Lee <a href=\"https://www.hollywoodreporter.com/business/business-news/stan-lee-files-1b-lawsuit-pow-entertainment-stealing-his-name-likeness-1112313/\">filed a suit against</a> POW! co-founder Gill Champion and CEO Shane Duffy in 2018 for finalizing a deal — using a signature said to have been stolen — to use his likeness that the 95-year-old believed to be nonexclusive at the time. <a href=\"https://deadline.com/2018/05/camsing-stan-lee-lawsuit-pow-entertainment-preposterous-claim-1202392907/\">POW! insisted</a> that Lee’s claims were “completely without merit,” and the lawsuit <a href=\"https://www.hollywoodreporter.com/business/business-news/stan-lee-drops-1b-pow-lawsuit-stealing-name-likeness-1125572/\">was ultimately dropped</a> just months before Lee’s death. Champion said of Lee in today’s press release that he sees the licensing deal as a way of honoring him.</p><p id=\"bYCOnr\">“As Stan’s longtime business partner and friend, I’m looking forward to commemorating his work in this new way,” Champion said. “Building a connection with his fans is important to us and it’s a privilege to get to do that on his behalf.”</p><p id=\"eT1fNs\">The writing’s been on the wall for some time now that Hollywood is more than keen on using digital facsimiles of dead celebrities to keep their living fans engaged and consuming content, but it’s unclear whether Lee will continue to cameo in Marvel’s movies going forward. Speaking with <em>The Hollywood Reporter</em>, <a href=\"https://www.hollywoodreporter.com/movies/movie-news/stan-lee-marvel-studios-licensing-deal-1235149039/\">Heyward said</a> that while he and others always field offers with a focus on protecting legacies, what will determine how the public receives future depictions of Lee is the intentionality behind it.</p><p id=\"PshKfY\">“The audience revered Stan and if it’s done with taste and class, and respectful of who he was, it will be welcomed,” said Heyward. “He is a beloved personality and long after you and I are gone, he will remain the essence of Marvel.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hyHrRUcoNqkXCZKyYz5NJLY4JNE=/24x0:2293x1188/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23531828/Screen_Shot_2022_05_18_at_9.48.33_AM.png",
  "description": "Lee filed a suit against POW! Entertainment in 2018 for allegedly forging his signature.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}