{
  "title": "Marvel’s Fantastic Four movie just lost its director",
  "url": "https://www.theverge.com/2022/4/29/23049370/marvel-fantastic-four-jon-watts",
  "date": "2022-04-29T23:02:35.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/iEw49cQWtjwV4Wz9UtFpjnHsaAA=/38x0:2513x1650/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70812866/Fa.0.jpeg\" />        <figcaption>Marvel Studios</figcaption>    </figure>  <p id=\"MyCqDA\">Director Jon Watts’ involvement in <a href=\"https://www.theverge.com/2021/12/14/22834061/spider-man-no-way-home-review-tom-holland-marvel-multiverse\">Marvel’s wildly successful <em>Spider-Man </em>movies</a> from the past few years made Kevin Feige’s 2019 announcement that Watts would be helming <a href=\"https://www.theverge.com/2020/12/10/22168833/the-fantastic-four-marvel-studios-cinematic-universe-jon-watts\">the studio’s upcoming <em>Fantastic Four </em>movie</a> make more than a bit of sense. It seems now, though, that the plans for Marvel’s First Family returning to the big screen have hit a snag.</p><p id=\"Qbz3gR\"><a href=\"https://deadline.com/2022/04/spider-man-jon-watts-exits-marvel-fantastic-four-film-1235013110/\"><em>Deadline</em> reports</a> that Jon Watts has amicably walked away from the upcoming <em>Fantastic Four </em>movie out of a very understandable desire to take a well-deserved break from making superhero movies. In a public statement, Kevin Feige expressed that working with Watts on the past three <em>Spider-Man </em>films was a joy and that the studio would very much like to collaborate with him in the future.</p><p id=\"GX5Glo\">“We were looking forward to continuing our work with him to bring the Fantastic Four into the MCU but understand and are supportive of his reasons for stepping away,” Feige said. “We are optimistic that we will have the opportunity to work together again at some point down the road.” </p><p id=\"giZsKl\">Watts added that working with Marvel on his <em>Spider-Man </em>movies “was an incredible and life changing experience,” and it’s easy to understand why he might want to take a step back from the franchise machine, if only to recharge his creative batteries. Given that the next <em>Fantastic Four </em>will be the characters’ major introduction to the MCU following <a href=\"https://www.theverge.com/2019/3/20/18273142/disney-fox-acquistion-final-hulu-marvel-streaming-21st-century\">Disney’s acquisition of 21st Century Fox</a> — who previously held their cinematic rights — there’s little question that Marvel’s already working to find another director. Currently, the next <em>Fantastic Four </em>does not have a projected release date.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/focQuF7IpEBIU1n9sQej9xtwx0w=/0x158:2550x1493/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23426935/Fa.jpeg",
  "description": "An MCU Fantastic Four movie is still coming, but Marvel will have to find a new director.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}