{
  "title": "Marvel’s Protectors of Wakanda reveals the origins of the Black Panther’s Dora Milaje",
  "url": "https://www.theverge.com/23053264/black-panther-protectors-of-wakanda-dora-milaje-nehanda",
  "date": "2022-05-02T18:05:22.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/llJvHkYfPta9CRwS0sFkIi1vjeU=/18x76:1563x1106/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70823348/Protectors_of_Wakanda___A_Training_Manual_for_the_Dora_Milaje_INTERIORS_352727_Approved_for_Promotion_9.0.jpeg\" />        <figcaption>Sheeba Maya / Marvel</figcaption>    </figure>  <p id=\"gR2Wb7\">In both Marvel’s comic books and its movies, the Dora Milaje — an elite outfit of highly trained warrior women — are so much more than just the Black Panther’s bodyguards. They are Wakanda’s spies, diplomats, and a testament to the secretive country’s belief in tradition — tradition that Marvel’s adding new dimension to with <a href=\"https://www.marvel.com/articles/culture-lifestyle/dora-milaje-protectors-of-wakanda-karama-horne\"><em>Protectors of Wakanda: A History and Training Manual for the Dora Milaje</em></a>, a new book from writer Karama Horne.</p><p id=\"l39W4e\">As its title suggests, <em>Protectors of Wakanda </em>delves into important elements of the country’s past as a means of impressing upon young Dora Milaje-in-training what their organization has represented to the nation throughout its history. In addition to refreshers about Wakanda’s existing lore, which has largely focused on the lives of the various men who’ve held the Black Panther mantle, <em>Protectors of Wakanda </em>explores the connection between the Dora Milaje and Queen Nehanda, one of the first women to bear the title. </p><p id=\"mP0UiB\">When we spoke with Horne recently about <em>Protectors of Wakanda</em>, she explained how her own curiosity about previous Panthers’ legacies — Nehanda’s in particular — led to her wanting to explore the Black Panther’s role in founding the Dora Milaje.</p><p id=\"gqj0I6\">“I am fascinated by the fact that in the comics there are 16 Black Panthers, including T’Challa,” Horne said. “Two of them were women, Queen Turkana and Queen Nehanda, and I loved the way Ta-Nehisi Coates developed Nehanda’s mythos during his Black Panther run. So I knew going into this I was going to make Nehanda the Dora’s founder.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/f4leCnV018c2zMhJAi1eYgjRsGw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432539/Protectors_of_Wakanda___A_Training_Manual_for_the_Dora_Milaje_INTERIORS_352727_Approved_for_Promotion_6.jpeg\">      <cite>Image: Alitha Martinez / Marvel</cite>      <figcaption><em>Queen Nehanda flanked by two of the first Dora Milaje.</em></figcaption>  </figure><p id=\"MMKzuc\">Along with establishing how Nehanda created the Dora Milaje,<em> Protectors of Wakanda </em>details how other elements of her life, like being one of the first rulers of Wakanda to venture outside the nation, made Nehanda a legend in her time much like T’Challa has been in his. In order to understand what all the Black Panther embodies as Wakanda’s protector, Horne said, one has to have a deep understanding of the Dora Milaje, as the two couldn’t be more powerfully connected.</p><p id=\"9B04D2\">“If the Dora Milaje’s main purpose is to protect Wakanda and its leader, then the Dora’s origin story is inexorably linked to the history of the Black Panther,” Horne said. “Weaving my way in and out of Marvel Comics canon I was able to expand upon existing stories through the eyes of the Dora Milaje. It was so much fun!”</p><p id=\"8A6PWk\"><em>Protectors of Wakanda: A History and Training Manual for the Dora Milaje</em> hits stores on September 13th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ALIYyAKtmCsENttYkH7uxu_i5ww=/18x187:1563x996/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432529/Protectors_of_Wakanda___A_Training_Manual_for_the_Dora_Milaje_INTERIORS_352727_Approved_for_Promotion_9.jpeg",
  "description": "The history of the Dora Milaje expands in Marvel’s Protectors of Wakanda.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}