{
  "title": "Maserati unveils new luxury EV lineup, commits to going fully electric by 2030",
  "url": "https://www.theverge.com/2022/3/17/22982745/maserati-ev-2030-folgore-granturismo-grecale",
  "date": "2022-03-17T15:30:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/RfR7yN9LpoiRPpD1gyc3XoLpHTI=/0x395:9449x6694/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70635923/01_Folgore_GranTurismo.0.jpg\" />        <figcaption>The Maserati GranTurismo will be the Italian automaker’s first electric vehicle.  | Maserati</figcaption>    </figure>  <p id=\"OSfltE\">Italian luxury automaker Maserati announced an all-electric range of vehicles called Folgore, including a next-generation GranTurismo sports coupe, an electric version of the best-selling Levante, the all-new Grecale SUV, and several other luxury sports cars and convertibles. The company said it would offer electric versions of all of its models by 2025 and shift to EV-only sales by 2030. </p><p id=\"04DiJA\">In a press conference with reporters, Maserati CEO Davide Grasso said that the automaker will also aim to completely phase-out sales of its internal-combustion engine vehicles by 2030 — though that will depend on individual markets and customer demands. </p><p id=\"uPmXCM\">“That’s the landing spot,” Grasso said of the target date of 2030. “It will affect different parts of the world with a different type of speed, depending on how fast the different markets will move towards a future of electrification, which is already upon us.”</p><div class=\"c-float-right\"><aside id=\"DyI9uW\"><q>“That’s the landing spot”</q></aside></div><p id=\"UeexbW\">With that timetable in mind, Maserati claims to be the “first luxury brand to complete its electric lineup by 2025.” To be sure, other luxury sports car brands, like <a href=\"https://www.theverge.com/2019/11/27/20983836/porsche-taycan-turbo-electric-car-first-drive-hands-on-photos-video-range\">Porsche</a>, <a href=\"https://www.theverge.com/2018/1/16/16897770/ferrari-electric-supercar-suv-marchionne-tesla\">Ferrari</a>, and <a href=\"https://www.theverge.com/2021/5/18/22440143/lamborghini-ev-electric-supercar-hybrid-models-announce\">Lamborghini</a>, have announced their own electrification plans. (Porsche has already released its first model with the Taycan.) But the shift to electrification has been comparatively slower among luxury automakers, as most still place a premium on loud, grumbling V8 and V12 engines.</p><p id=\"DjyXCe\">For years, Maserati was no different. The company has been <a href=\"https://www.theverge.com/2016/10/7/13204676/maserati-electric-car-development-2020\">rumbling about making an electric car</a> for a while but has never really followed through. This is likely due to the apathetic attitude of its parent company, Fiat Chrysler (now Stellantis), which, under the leadership of the late Sergio Marchionne, largely ignored EVs. </p><p id=\"B2LyVQ\">In 2019, Maserati changed course, <a href=\"https://www.greencarreports.com/news/1125266_maserati-outlines-upcoming-evs-and-hybrids-underscores-italian-production\">announcing a range of electric models</a>, including battery-powered versions of its GranTurismo sports coupe and GranCabriolet convertible, as well as an unnamed electric sports car and an electric SUV. Last year, Maserati announced a hybrid version of the Ghibli sedan, which will only be sold in Europe.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/saqFyaQzDfNZFhDCvGW9DVetngo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23323663/16676_MaseratiGhibliHybrid.jpg\">      <cite>Maserati</cite>      <figcaption>The hybrid Ghibli was released last year, but in Europe only. </figcaption>  </figure><p id=\"q2oYgk\">Those plans are now coming more into focus. The GranTurismo coupe will be the first EV to come out of the Folgore product lineup. The electric sports coupe will be produced at Maserati’s Mirafiori plant in Turin, Italy, which recently received a 700 million euro (approximately $807 million) upgrade to prepare it for production of electric vehicles. The GranTurismo, which will use powertrain technology derived from Formula E, will go on sale in 2023.</p><p id=\"7LSRZT\">Based on the initial specs, the electric GranTurismo sounds like it will be a high-performance beast: “way over” 1,200 horsepower; 0-100 km/h (62 mph) in a little over 2 seconds; a top speed of 300 km/h (186 mph). The vehicle will be made from lightweight material to enhance its speed. And three distinct electric motors will enable “best in class” handling, Maserati said. </p><div class=\"c-float-right\"><aside id=\"29HNAr\"><q>the electric GranTurismo sounds like it will be a high-performance beast</q></aside></div><p id=\"VhpVLE\">Later this month, Maserati will unveil a brand new EV, the Grecale SUV. Details are scant now, but the vehicle is expected to also go on sale in 2023. Francesco Tonon, global head of product planning, said the Grecale “will be a benchmark in terms of range, performance, acceleration, charging time, top speed — everything.”</p><p id=\"I7veDs\">The rest of the Folgore range will be filled out in the coming months, including the MC20 Spyder, a sister vehicle to the automaker’s ultra-luxury sports car, the new Quattroporte four-door sport sedan, and an electric version of the automaker’s best-selling Levante SUV.</p><p id=\"eno2jN\">Like all sports car brands, Maserati will have to confront the loss of noisy engines, one of its key characteristics, as it shifts to electric vehicles. Some automakers have added artificial sounds to account for the absence of a growling internal-combustion engine — but Maserati said it won’t go that same route. “The Maserati sound is not fake,” Tonon said, “because we are about authenticity.”</p><p id=\"LbrCTi\">The company also confirmed plans to develop Level 3 autonomous technology for its Quattroporte sedan — meaning the vehicle will be able to drive itself, without human supervision, on certain roads, most likely highways. </p><p id=\"RaU18S\">“Someone may think that because it’s a car for drivers, we are not considering autonomous driving, but actually, it is the opposite,” Tonon said. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tyveNUlvHdTRVFJrgSDNEMdy7ms=/0x1071:9449x6018/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23323542/01_Folgore_GranTurismo.jpg",
  "description": "The automaker will have an all-electric lineup by 2025.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}