{
  "title": "Match Group is suing Google over Android’s in-app payment monopoly",
  "url": "https://www.theverge.com/2022/5/9/23064305/match-group-suing-google-over-in-app-payment-policy",
  "date": "2022-05-09T23:47:57.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9p-nPUo2kXYKWBNbpqRwjQ5ZleI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70850304/acastro_180413_1777_android_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"VcJV7j\">Match Group, the company behind popular dating apps such as Tinder, Match, and OkCupid, is suing Google over its restrictive billing policies on the Play Store. In its <a href=\"https://www.courtlistener.com/docket/63296813/1/match-group-llc-v-google-llc/\">complaint</a>, Match Group claims Google “illegally monopolized the market for distributing apps” on Android by forcing apps to use Google’s own billing system and then taking a cut of the payments.</p><p id=\"HTu7iI\">Match Group’s complaint plays off an earlier lawsuit <a href=\"https://www.theverge.com/2020/8/13/21367963/epic-fortnite-legal-complaint-apple-ios-app-store-removal-injunctive-relief\">Epic Games filed against Apple in 2020</a>, alleging that Apple engaged in “anti-competitive” behavior by demanding a 30 percent commission on in-app purchases in the iOS app store, among other charges. Although <a href=\"https://www.theverge.com/2021/9/12/22667694/epic-v-apple-trial-fortnite-judge-yvonne-gonzalez-rogers-final-ruling-injunction-breakdown\">the final ruling was mixed</a>, Judge Yvonne Gonzalez Rodgers was particularly skeptical of the payment monopoly claims, saying that Apple has the right to license its intellectual property with a fee and that it “accomplishes this goal in the easiest and most direct manner” with its payment system.</p><p id=\"5Ik5hd\">While Google says it always required certain types of in-app payments to be carried out through its billing service, <a href=\"https://android-developers.googleblog.com/2020/09/listening-to-developer-feedback-to.html\">the company made it clear in 2020</a> that it wants <em>all</em> apps selling digital goods to use its billing system. This, of course, lets Google collect up to a 30 percent commission. Google did, however, slash that percentage to 15 percent for the <a href=\"https://www.theverge.com/2021/3/16/22333777/google-play-store-fee-reduction-developers-1-million-dollars\">first $1 million</a> a developer makes in March 2021 and later did the same for <a href=\"https://www.theverge.com/2021/10/21/22738370/google-play-cut-music-streaming-apps-10-percent-regulation\">music streaming apps and subscriptions</a> last October. Even so, Match Group accuses Google of employing “bait and switch tactics” for allegedly misleading developers about its payment policies.</p><div class=\"c-float-right\"><aside id=\"EWeAcK\"><q>“Ten years ago, Match Group was Google’s partner. We are now its hostage”</q></aside></div><p id=\"dD52eX\">“Google lured app developers to its platform with assurances that we could offer users a choice over how to pay for the services they want,” Match Group’s complaint reads. “But once it monopolized the market for Android app distribution with Google Play by riding the coattails of the most popular app developers, Google sought to ban alternative in-app payment processing services so it could take a cut of nearly every in-app transaction on Android.”</p><p id=\"GtbgH8\">Match Group further asserts that Google wants to impose a so-called app store “tax” that it says “comes out of the pockets of consumers in the form of higher prices and the revenue that app developers would and should otherwise earn for the sale of their services.” It also claims Google also benefits from “monopolizing the in-app payment processing market,” as it lets the company get its hands on users’ credit card information and identities that it can use to its advantage.</p><p id=\"KdjGQB\">Match Group is a part of the Coalition of App Fairness, a group of companies that also includes Spotify and Tile, among others. Its goal is to fight policies it deems anticompetitive, such as both Apple and Google’s rule that bars developers from using third-party payment processors. In March, <a href=\"https://www.theverge.com/2022/3/23/22993417/google-pilot-test-android-alternate-billing-systems-spotify\">Google announced that it will start testing</a> a way for Android developers to use their own payment systems, starting with Spotify. However, <a href=\"https://www.theverge.com/22993765/google-spotify-android-user-choice-billing\">it’s unclear if Google will still take a commission</a> from those sales and, if it does, how much it will charge.</p><p id=\"8ggdeD\">Google spokesperson Dan Jackson issued the following statement in response to Match Group’s complaint: </p><blockquote><p id=\"1EB6YO\">This is just a continuation of Match Group’s self-interested campaign to avoid paying for the significant value they receive from the mobile platforms they’ve built their business on. Like any business, we charge for our services, and like any responsible platform, we protect users against fraud and abuse in apps. Match Group is currently attracting <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__www.ftc.gov_news-2Devents_news_press-2Dreleases_2019_09_ftc-2Dsues-2Downer-2Donline-2Ddating-2Dservice-2Dmatchcom-2Dusing-2Dfake-2Dlove-2Dinterest-2Dads-2Dtrick-2Dconsumers-2Dpaying&amp;d=DwMFaQ&amp;c=7MSjEE-cVgLCRHxk1P5PWg&amp;r=BNBxCHAXbQh36ojJhS0bgFa1B4VDwdnVWcDtoqjuqjw&amp;m=lAo282eqxwVjaZ7wUPMQ1ty6TIAsfRLiaZoTsvEChmW5S-FaWowt88FOJ_pcsNGg&amp;s=pv4tNLoNtdAOBRwFj-XdSYw38xsuEKGVcKgBbKpT5w0&amp;e=\">regulator concerns</a> over things like deceptive subscription practices, and with this filing they continue to put money ahead of user protection. Match Group’s apps are eligible to pay just 15% on Google Play for digital subscriptions, which is the lowest rate among major app platforms. But even if they don’t want to comply with Google Play’s policies, Android’s openness still provides them multiple ways of distributing their apps to Android users, including through other Android app stores, directly to users via their website or as consumption-only apps.</p></blockquote><p id=\"XsPQbr\">Match Group’s complaint comes as both Apple and Google face scrutiny from companies and government agencies worldwide. US lawmakers are tackling the issue of in-app payments with <a href=\"https://www.theverge.com/22914479/open-app-markets-act-legislation-senate-committee-markup-explained\">the Open App Markets App</a>, a piece of legislation that the Senate Judiciary Committee passed in February. If signed into law, it will let developers use their own billing systems, as well as change other potentially anticompetitive behavior waged by Apple and Google, such as punishing a developer for offering its app for a better price elsewhere. </p><p id=\"XpW4IL\">Outside of the US, <a href=\"https://www.theverge.com/2021/8/31/22643800/apple-google-south-korea-app-store-payment-legislation-passes\">South Korea passed a bill</a> last August that requires Apple and Google to allow developers to use other billing services on their apps. In addition, the Netherlands is still engaged in a seemingly <a href=\"https://www.theverge.com/2021/12/24/22852966/apple-netherlands-dating-apps-match-tinder-app-store-competition\">never-ending legal battle</a> with Apple over its policies that block third-party payment processors for Dutch dating apps.</p><div id=\"ucOY44\"><iframe src=\"https://embed.documentcloud.org/documents/21954175-match-group-google-lawsuit/?embed=1&amp;responsive=1&amp;title=1\" title=\"match-group-google-lawsuit (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div><p id=\"TL1Wfz\"><em><strong>Update May 9th, 7:47PM ET:</strong></em><em> Updated to add a statement from a Google spokesperson.</em></p><p id=\"lyHsIr\"></p><p id=\"oBCDyE\"></p><p id=\"Qb1opi\"></p><p id=\"kZGiIN\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RqOS4nKvRSt2fVr7eK9XOCW0QJY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10646769/acastro_180413_1777_android_0001.jpg",
  "description": "Google’s billing policies come under fire yet again.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}