{
  "title": "Matter’s delays mean fewer new smart home products today",
  "url": "https://www.theverge.com/2022/3/24/22994597/matter-delay-nanoleaf-essentials-eve-wemo",
  "date": "2022-03-24T21:45:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"Nanoleaf Essentials A19 bulb and Essentials Lightstrip in a bedroom scene.\" src=\"https://cdn.vox-cdn.com/thumbor/zPuY1GzWAM_kt4iEnQm_eSRlE1o=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70667809/Essentials_Bedroom_with_Homepod_mini.0.jpg\" />        <figcaption><em>Nanoleaf’s existing Essentials light bulb and light strip work with Thread, but won’t be updated to support Matter.</em> | Image: Nanoleaf</figcaption>    </figure>  <p id=\"OhBXwf\">You shouldn’t be concerned about the delay of Matter, the new smart home interoperability standard, because we’re not. That’s the message from smart home device makers Eve Systems and Nanoleaf, who have been involved with developing the protocol that promises smart home nirvana since its earliest days. “I think the three-month delay might actually be a good thing,” says Gimmy Chu CEO of Nanoleaf. “I feel that now there’s more certainty across the industry that we’ll have unity at time of launch.” </p><p id=\"ZOLL8a\">While there may be more certainty in the industry, current smart home owners are still in a quagmire of uncertainty around which products to buy and when. Especially now that Chu has confirmed to <em>The Verge</em> that Nanoleaf’s Thread-enabled A19 smart light bulb and light strip won’t work with the standard. “[They] will require a different chip,” says Chu. “We hope to launch a new Essentials A19 and a new light strip when Matter arrives this year.” This is a blow to owners who bought the products thinking that being Thread-enabled meant they would be upgradable to Matter. The devices will continue to work with HomeKit over Thread, however, and with other platforms either over Bluetooth or over Thread using a cloud-to-cloud integration, says Chu. </p><div><aside id=\"1aROpu\"><q><em>Nanoleaf won’t launch some products until Matter arrives... whenever that is.</em></q></aside></div><p id=\"hqOWPM\">Announced in 2019 by Amazon, Apple, Google, and Samsung, <a href=\"https://www.theverge.com/22787729/matter-smart-home-standard-apple-amazon-google\">Matter is the result of a collaboration by much of the industry</a>. Its purpose is to allow devices from any manufacturer to work with devices from any other manufacturer, seamlessly. As I reported last week, the standard was originally going to launch in June of this year, but <a href=\"https://www.theverge.com/2022/3/17/22982166/matter-smart-home-standard-postponed-fall-2022\">the timeline has shifted to a more nebulous date of “fall 2022.”</a> </p><p id=\"FzDpz1\">While the big smart home platforms have been bullish on Matter since the beginning, with Amazon, Google, and Samsung SmartThings pledging their full support, exactly how that will manifest itself in their apps and other control devices has been murky. Nanoleaf’s Chu singled out Apple, whom Nanoleaf worked closely with on the launch of its Essentials A19 bulb to coincide with the arrival of the HomePod Mini. “We know nothing about what Apple plans to do with Matter,” he says. “But we do know around September sometime they launch a new iOS. If Matter had launched in the summer, would Apple have been ready, or would it have waited?”</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JwlmvtgBMBNaGlAnHdJXf0npLwM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342608/Nanoleaf_Essentials__Bulb___3_Pack_Product_Shot.jpg\">      <cite>Image: Nanoleaf</cite>      <figcaption><em>Nanoleaf will release a new Matter-compatible version of its Essentials A19 light bulb when the standard arrives. </em></figcaption>  </figure></div><p id=\"uDMR8I\">All the major players being all-in on Matter is key to the success of the standard, which Chu says is the solid foundation the smart home desperately needs in order to move beyond early adopters and into the mainstream. “In reality, customers shouldn’t even know if a device is using Matter versus HomeKit versus cloud-to-cloud communication, it will just work,” he says.</p><p id=\"PlNZWK\">Tim Böth of Eve Systems agrees that Matter is crucial to the smart home and if we have to wait to get it right, so be it. “Making sure everything works — that’s the promise of Matter and it would be really bad if on day one, it didn’t.” The Connectivity Standards Alliance, which oversees Matter, says the main reason for the latest delay is <a href=\"https://csa-iot.org/newsroom/matter-march-update/\">tweaking the way the standard will work with the platforms</a>, which has been made more complicated as more OS and chipset makers have jumped on board with Matter than anticipated. </p><div class=\"c-float-right\"><aside id=\"pa7XCJ\"><q>‘It would be really bad if on day one it didn’t [work].’</q></aside></div><p id=\"Ht7tXN\">It also seems there is still a lot of “hammering out” of exactly how existing ecosystems will adopt Matter. “Ecosystems manufacturers will want to position themselves in Matter with a unique functionality, this will be a competitive landscape,” says Böth. “They’ll try to convince everybody that there’s value in making tailor-made things for their platform.” In short, everyone came together to make Matter happen, but as it gets closer, companies are scrambling for ways to stand out from the crowd.</p><p id=\"qvLxXl\">But while the manufacturers wait for the ecosystems and platforms to play catch up, the consumer is losing out. I’ve heard from many readers that they are holding off on buying devices for their smart home, because they want to know it will work with Matter. We’ve now been waiting nearly three years. And, despite assurances from the CSA that it is working on bringing existing devices into the Matter fold, it seems increasingly likely that we’ll need to buy new devices if we want Matter-capable products.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OGosK-wNQKbmb0AQN0xIZ4S4ZkA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342487/Elements_7x_Dining_Winter_4000x2250px.jpg\">      <cite>Image: Nanoleaf</cite>      <figcaption><em>The Nanoleaf Elements lighting panels are Thread border routers, but it hasn’t been decided if they will be upgraded to Matter.</em></figcaption>  </figure><p id=\"Jb2I0G\">Nanoleaf has “a couple of new lighting products” coming that will work with Matter, Chu told me. In fact, these have been ready to go since last year, when Matter was originally supposed to launch, but Nanoleaf held them back when the launch of the standard was delayed. “We don’t plan on launching these new products until the final spec is here,” he says. “We don’t want to launch something that, three months later, becomes obsolete.” </p><p id=\"MNvouu\">Do it once, and do it right is Nanoleaf’s approach now. But as Matter’s timeline keeps shifting, Chu admits it’s been challenging. “We would love to have recognized that revenue earlier and be building out that aspect of our business,” he says. “But we’re in it for the long game.” </p><p id=\"ldyXjh\">Nanoleaf also has a number of products that work as Thread border routers, a device that connects a Thread network to other IP-based networks, such as Wi-Fi or Ethernet. Thread and Matter will go hand in hand when it launches. But Chu says the company hasn’t decided if it will upgrade the Shapes, Lines, and Elements lighting panels to Matter, although the right hardware is there to do it. “I haven’t found a user-centric reason to upgrade them to Matter. They work with Alexa, Google, and HomeKit, what would upgrading it do for the customer?” The Nanoleaf border routers will support Thread devices whether they’re on HomeKit or Matter, he says. </p><p id=\"gMeoJ8\">The delay has had no impact on Eve's plans. “We are pretty chill about it,” says Böth. “We have been prepared for a while and we have an existing business that’s working well so this doesn’t change what we’re doing. It’s just going to be even more awesome.” <a href=\"https://www.theverge.com/2021/12/10/22827727/eve-matter-thread-upgrade-smart-shades-release-date\">The company has been rolling out entirely new Thread-versions of all its products</a> that are part of the first Matter specification, including a door and window sensor, a smart plug, and a water leak sensor. Böth says they will all be upgradeable to Matter. “We were willing to spend money to future-proof these devices by including components that are not used today but will be when Matter arrives,” he says. </p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KVl3zhBVme3bb_zhh1twoHOquQU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342494/79E67CD7_5D49_47CA_AAC0_4EE02F52F0DF.jpeg\">      <cite>Image: Eve Systems</cite>      <figcaption><em>Eve recently released a Thread-enabled version of its Water Guard leak detector, which first launched in 2020.</em></figcaption>  </figure></div><p id=\"PWvSho\">Unfortunately, it means if you have existing Eve devices that just use Bluetooth, you’ll need to buy the newer Thread versions if you want to switch to Matter, as the older ones won’t support it.<em> </em>It also means Eve is having to wait even longer to realize its expansion plans. Currently, its devices only work with HomeKit, limiting its customer base to iPhone users. When Matter arrives, the devices will work with Android phones, expanding Eve’s potential market dramatically.</p><p id=\"kYtaOV\">The same is true for Belkin Wemo’s customers. Its existing smart switches and plugs won’t work with Matter, but the company has ​​<a href=\"https://www.theverge.com/2022/1/4/22865546/wemo-homekit-video-doorbell-price-specs\">new Thread versions of its smart plug, light switch, and dimmer switch</a> coming this year, and it recently updated its <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.belkin.com%2Fus%2Fsmart-home%2Fwemo%2Fwemo-stage-scene-controller-with-thread%2Fp%2Fp-wsc010%2F%3Firgwc%3D1%26clickid%3DSQvwX93sZxyITFU23zQqUXqzUkGQWyUlyXRtSc0%26utm_campaign%3DOnline%2520Tracking%2520Link%26utm_medium%3Daffiliate%26utm_source%3Dimpactradius%26utm_content%3DONLINE_TRACKING_LINK_214281&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F24%2F22994597%2Fmatter-delay-nanoleaf-essentials-eve-wemo\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Stage Scene Controller</a> to support Thread. A number of these products also only work with HomeKit, but Belkin has said it plans to <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.belkin.com%2Fus%2Fresource-center%2Fthread-networking-2022-mesh-technology-for-smart-homes-and-devices%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F24%2F22994597%2Fmatter-delay-nanoleaf-essentials-eve-wemo\" rel=\"sponsored nofollow noopener\" target=\"_blank\">upgrade them all to Matter</a>. </p><p id=\"g2VmqP\">While there are some existing smart home devices that <a href=\"https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer\">we’ve been told will be upgraded to Matter</a> – such as the fourth generation Echo speaker, the Google Nest Hub, the HomePod Mini, the Philips Hue smart lighting bridge – it’s increasingly looking like it’s the early adopters who will be footing the bill for Matter to power the smart home into the mainstream. But, if it means we get the smart home that “just works,” it may well be worth it.</p><p id=\"EWzOGy\"><em><strong>Update: Thursday, March 24th 5:45PM:</strong></em> Clarified that existing Eve Bluetooth-only devices won’t be upgradable to Matter, only the newer Thread versions will support Matter.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/I3STcqrB23204UN3R3pehJmUHE0=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23342529/Essentials_Bedroom_with_Homepod_mini.jpg",
  "description": "Take the time to get it right, say Nanoleaf and Eve",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}