{
  "title": "Mazda head units are getting bricked by a local NPR station in Seattle",
  "url": "https://www.theverge.com/2022/2/9/22925619/mazda-head-units-bricked-npr-seattle-need-ota-updates",
  "date": "2022-02-09T22:37:41.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"Economy In Poland\" src=\"https://cdn.vox-cdn.com/thumbor/DP2Hv0zOuKq8CSm5iB9d2-8GNBc=/0x0:3543x2362/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70490629/1237857230.0.jpg\" />        <figcaption><em>Frozen Mazda</em> | Photo by Jakub Porzycki/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"9sqSRW\">Some Mazda drivers in and around Seattle this week discovered they could no longer change the radio station or play anything else in their cars after listening to the local NPR station KUOW (<a href=\"https://www.geekwire.com/2022/youre-listening-to-kuow-like-it-or-not-mysterious-glitch-has-mazda-drivers-stuck-on-public-radio/\"><em>via GeekWire</em></a>).</p><p id=\"5p0Gat\">The issue affected owners of various Mazda vehicles with model years ranging from 2014 to 2017 that were tuned in to the station. According to KUOW, it’s been happening for weeks.</p><div id=\"67CWmI\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Over the past couple of weeks, some people who listen to KUOW in their Mazdas say their car radio is permanently stuck on 94.9 FM. It’s only affecting KUOW, Mazdas from 2016, and we have no idea why. <a href=\"https://t.co/ffzJASFNBJ\">https://t.co/ffzJASFNBJ</a></p>— KUOW Public Radio (@KUOW) <a href=\"https://twitter.com/KUOW/status/1491260568463945730?ref_src=twsrc%5Etfw\">February 9, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"dpWjif\">What the unsuspecting commuters tuning in discovered was a bug in the car’s infotainment software that crashed after trying to load the HD Radio broadcast image KUOW submitted. The image file was missing an extension, and the infotainment software could not decode it and had no process for handling it.</p><div class=\"c-float-right\"><aside id=\"uE94sB\"><q>a software bug that could have been fixed through an update</q></aside></div><p id=\"1K0mld\">According to some Reddit users, the <a href=\"https://www.reddit.com/r/mazda3/comments/sia9f5/anyone_else_have_their_radio_corrupted_by_a/\">issue sounds even worse</a>. Some owners reported losing Bluetooth connectivity and the ability to play CDs, as well as a disabled backup camera and <a href=\"https://www.reddit.com/r/mazda/comments/skk7oh/infotainment_system_constantly_rebooting/\">powerless USB ports</a> for charging phones. One user warned against disconnecting the car’s 12-volt battery when troubleshooting, as you can lose the ability to even listen to KUOW.</p><p id=\"4CBXkA\">This all sounds like something that could have been fixed with a software update, but it turns out the solution is to replace the CMU, which is the $1,500 hardware computer component of the infotainment system.</p><div class=\"c-float-left\"><aside id=\"T7X43h\"><q>The good news is the fix won’t cost anything for affected customers</q></aside></div><p id=\"uoGIXm\">The good news is that Mazda is telling dealerships this repair should be submitted as a “good will” repair, which means it should not cost anything for customers affected by it. The bad news is the part is not available anywhere due to chip shortages, so it could take weeks or months.</p><p id=\"CYS61L\">In the end, the issue is a software bug that could have been fixed through an update. Although some of the Mazdas here are too old to have OTA updates, it should at least have a way for dealerships to install updates for customers.</p><p id=\"3Ycw0X\">This should serve as a warning for all manufacturers to start implementing a software update system and save a few headaches for dealerships and customers. Companies like Tesla have <a href=\"https://www.theverge.com/2012/9/24/3385506/tesla-model-s-over-the-air-car-firmware-update\">pioneered</a> the ability to add new features and fix bugs, and <a href=\"https://www.theverge.com/2022/2/4/22917857/jaguar-land-rover-alexa-ota-software-update\">most recently</a>, Jaguar Land Rover added Amazon Alexa through an OTA update.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1I-QiTn89VV9F0pGVIMnYzHmp1A=/0x254:3543x2109/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23230269/1237857230.jpg",
  "description": "Mazdas in Seattle get broken infotainment after NPR bug",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}