{
  "title": "MediaTek beats out Qualcomm to become the new Android processor king in the US",
  "url": "https://www.theverge.com/2022/3/1/22956593/mediatek-qualcomm-android-processor-smartphone-marketshare-united-states-dimensity",
  "date": "2022-03-01T19:21:39.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3iRbeT46MRWn4xARO7CXS_lBA84=/364x0:2035x1114/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70566236/Screen_Shot_2022_03_01_at_1.34.08_PM.0.png\" />    </figure>  <p id=\"FY54Rd\">MediaTek now has the biggest market share of any chipmaker for Android phones in the United States, beating out Qualcomm, which has long held the title. </p><p id=\"6fDKNb\">The news comes from IDC’s quarterly mobile phone sales tracker, which reports as of Q4 2021 that MediaTek chips now account for 51 percent of all Android phones in the United States, compared to 47 percent for Qualcomm, <a href=\"https://www.pcmag.com/news/now-no-1-chip-in-us-android-phones-mediatek-plans-midrange-millimeter-wave\">as spotted by <em>PCMag</em></a>. Those numbers are a stark inversion from the previous quarter, where MediaTek had a 41 percent market share to Qualcomm’s 56 percent. </p><p id=\"vBiGlH\">MediaTek isn’t as much of a household name for smartphone processors as Qualcomm (which has long been the dominant force for Android phones in the US, especially for high-end flagships). But the company has been steadily building out its presence in the US in low- and mid-range devices, including the <a href=\"https://www.theverge.com/2020/9/3/21295764/t-mobile-lg-velvet-mediatek-dimensity-1000-soc-processor-5g\">LG Velvet</a> or <a href=\"https://www.theverge.com/2021/10/7/22709569/motorola-moto-g-pure-mediatek-4g-price-specs-features\">the Moto G Pure</a>. </p><aside id=\"ackdnC\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"MediaTek’s new Dimensity 9000 flagship could compete with Qualcomm’s top-tier Snapdragon chips\",\"url\":\"https://www.theverge.com/2021/11/18/22790189/mediatek-dimensity-9000-flagship-chip-qualcomm-snapdragon-competition-arm\"}]}'></div></aside><p id=\"Hl8UBv\">The trick for MediaTek is convincing manufacturers and customers alike that its more premium chips — <a href=\"https://www.theverge.com/2021/11/18/22790189/mediatek-dimensity-9000-flagship-chip-qualcomm-snapdragon-competition-arm\">like its flagship Dimensity 9000</a>, which the company says is more powerful than Qualcomm’s Snapdragon 888 — are worth trying out as it continues to try to break into the high-end Android device market. </p><p id=\"6oUhBm\">That said, MediaTek isn’t resting on its laurels, either: the company has announced a trio of new chips that will look to further its aims of offering more powerful 5G chips. At the top of the market are the Dimensity 8100 and Dimensity 8000, which are trickle-down cousins to the more powerful Dimensity 9000 flagship. </p><p id=\"7JAc7v\">While both of those chips be built on TSMC’s 5nm node (instead of the 4nm process used by the Dimensity 9000) and use less powerful CPU and GPU cores, they’ll offer some of the AI and 5G features debuted on the higher-end platform. Additionally, the company also announced a new 5G-capable Dimensity 1300 chipset, an upgraded version of the company’s Dimensity 1200 model with improvements for AI performance. </p><p id=\"TyTUoW\">All three of the new chips are set to debut in smartphones sometime in the first quarter of 2022 — where they’ll presumably look to help MediaTek defend (and extend) its market share lead in the months to come. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_VmPubVnMyQ_ekMNtjp3-6yUzZ0=/135x0:2263x1114/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23280351/Screen_Shot_2022_03_01_at_1.34.08_PM.png",
  "description": "Qualcomm falls to second place.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}