{
  "title": "Meet Earendel, the most distant star ever detected",
  "url": "https://www.theverge.com/2022/3/30/23002980/earendel-hubble-most-distant-star-gravitational-lensing-jwst",
  "date": "2022-03-30T15:00:00.000Z",
  "author": "Rafi Letzter",
  "content": "      <figure>      <img alt=\"An image of galaxies against a dark background. An orange line arcs through the middle of the image. \" src=\"https://cdn.vox-cdn.com/thumbor/vyodqW6xI3gMayHtXXYHP9K_KYw=/0x120:720x600/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70689509/sunrisearc_unlabeled.0.png\" />        <figcaption>The Sunrise Arc, and Earendel | NASA/ESA, B. Welch, D. Coe</figcaption>    </figure>  <p id=\"GqOOta\">The most distant star — or possibly pair of stars — that astronomers have ever seen was just revealed thanks to the Hubble telescope and a massive cluster of galaxies. Far from Earth, the universe bends around the vast bulk of a galaxy cluster, creating a gravitational lens in spacetime much like the curved lens in a magnifying glass. Like a magnifying glass, it revealed something small and hidden: a star system from the early universe. </p><p id=\"ijcAVP\">The far-away star system takes the official name WHL0137-LS, but the astronomers who found it nicknamed it “Earendel” from the Old English word meaning “morning star” or “rising light.”</p><p id=\"puN9LA\">Earendel system as we’re seeing it today was shining within just 900 million years of the Big Bang, according to the authors of a <a href=\"https://www.nature.com/articles/s41586-022-04449-y\">new paper in the journal <em>Nature</em></a> describing the discovery. Fully 12.8 billion years passed before that light reached the Hubble Space Telescope, magnified by a lucky trick of gravity to appear as a tiny smudge of photons on Hubble’s image sensor. Earendel is 8.2 billion years older than the Sun and Earth and 12.1 billion years older than our planet’s first animals. </p><p id=\"1OJ9LJ\">Even by the standards of ancient stars, Earendel stands out: astronomers observed the previous record holder, nicknamed Icarus, as it appeared 9.4 billion years ago — 3.4 billion years more recently than this new record-holder. Even the oldest known supernovas, usually the brightest and most easily-spotted individual objects across the immensity of spacetime, are younger than Earendel.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wvIcxvsqTe_OJku-7b22HHN8dq8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23355186/hubbleicarusimage1stscihp1813am2000x1333.png\">      <cite>NASA, ESA, and P. Kelly (University of Minnesota)</cite>      <figcaption>An image of Icarus, the previous record holder for the the farthest individual star ever seen. The left image shows the massive galaxy cluster that sits between Earth and Icarus. From NASA: “The panels at the right show the view in 2011, without Icarus visible, compared with the star’s brightening in 2016.”</figcaption>  </figure><p id=\"T2CUWv\"><strong>Seeing through the gravity lens</strong></p><p id=\"z7TXg3\">Earendel’s home galaxy, the Sunrise arc, takes its name from that gravitational lensing effect that made this discovery possible.</p><p id=\"yfCcJj\">“This galaxy appears magnified and stretched into a long, thin crescent shape due to the gravitational lensing effect of a massive cluster of galaxies in the foreground,” said Brian Welch, a Johns Hopkins University astronomer and lead author of the <em>Nature</em> paper.</p><p id=\"zpQmdj\">Welch told <em>The Verge</em> that he stumbled across Earendel while he was studying the gravitational lens itself.</p><p id=\"8tc5nl\">Gravitational lenses, like magnifying glasses, tend to warp and twist images and have areas of higher and lower magnification. If you have a magnifying glass at home, the best magnification is likely<strong> </strong>at the center of a simple circle. Gravitational lenses are trickier to use.</p><div class=\"c-float-right\"><aside id=\"0SBSVR\"><q>Gravitational lenses, like magnifying glasses, tend to warp and twist images and have areas of higher and lower magnification</q></aside></div><p id=\"g9AxGE\">In a gravitational lens, there’s a line called the “critical curve” where the magnification is most intense. Objects seen through the lens get reflected across the critical curve, appearing multiple times. And the more closely they line up with the line of the curve from our perspective on Earth, the more magnified they get.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lsGLoxLeEZuuGOKS8yqc7ClctW4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23355420/hubble_earendel_annotated.png\">      <cite><strong><em>Science: NASA, ESA, Brian Welch (JHU), Dan Coe (STScI); Image processing: NASA, ESA, Alyssa Pagan (STScI)</em></strong></cite>      <figcaption>An annotated image showing Earendel in relation to the Sunrise arc</figcaption>  </figure><p id=\"VqXRgb\">“I was creating a model of the lensing effects of the galaxy cluster, with the goal of measuring the magnification of the Sunrise Arc,” Welch said. “The models kept predicting that this one bright point on the arc should have an extremely high magnification.”</p><p id=\"CJ2SEo\">Welch realized that this bright point was an object very closely aligned with the critical curve — so close and so small that even Hubble’s sharp eye resolved its doubled, reflected image across the line as a single smear. That proximity to the critical curve also meant that whatever it was, it had already been magnified somewhere between 1,000 and 40,000 times before reaching Hubble. However small and faint it appeared to Hubble, it was, in fact, much smaller — tiny on the scale of the Sunrise Arc galaxy.</p><p id=\"FJ8i6P\">“As I looked into it more, I found that the source was too small to be anything other than an individual star (or binary system),” Welch said.</p><p id=\"bsAgFG\"><strong>The ancient universe</strong></p><p id=\"Yc5D9O\">Welch and a large international team of coauthors spent three and a half years studying Earendel across multiple Hubble observations to confirm that they were seeing something real and not a transient effect of the light.</p><p id=\"nlXe6L\">That time and effort was worth it, Welch said, because these very old stars can teach us things about the history of the universe.</p><p id=\"8SzXd2\">“With distant objects, we are seeing into the universe’s past and into a time when the universe looked very different than it does today,” Welch said. “We know that galaxies look different at this early time, and we know that there have been relatively few generations of stars that came before.”</p><div class=\"c-float-right\"><aside id=\"UfYzVB\"><q>“With distant objects, we are seeing into the universe’s past and into a time when the universe looked very different than it does today.”</q></aside></div><p id=\"EZoknG\">Stars are the factories of heavy elements in our universe, formed when lighter atoms like hydrogen and helium fuse together through nuclear fusion to form heavier material like carbon, oxygen, and even iron. Earendel, at that early stage in our universe’s history, probably had very little material heavier than helium in its system, Welch said.</p><p id=\"AVnBqF\">“Studying this lensed star in detail gives us a new window into what stars in these early days were like and how they differ from stars in the nearby universe,” Welch said.</p><p id=\"AXJy5t\">The James Webb Space Telescope (JWST), launched in December 2021, is currently gearing up for science operations. Its optics, sharper than Hubble’s, should be able to confirm their conclusion that Earendel is a single star system and not a cluster of star systems lumped together, the authors wrote in the paper. They also hope to see whether Earendel was a solitary star or binary system, learn more about the star’s temperature and mass, among other properties. </p><p id=\"vKq9ig\">JWST will be busy making its way through a scientific wish list that has grown long in the years astronomers spent anticipating the launch, <a href=\"https://www.theverge.com/22789561/nasa-jwst-james-webb-space-telescope-priorities-astronomy-astrophysics-exoplanets\">as<em> The Verge </em>previously reported</a>. That will include studying exoplanets as well as the ancient universe — including star systems like Earandel that glowed at the dawn of time. </p><p id=\"N0Iy2a\"><em><strong>Update 12:07 PM ET:</strong></em><em> This article has been updated with an additional image of Earandel and the Sunrise arc. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GFyJCbth2Eq1XbwFfqnaxlHfNY8=/0x172:720x549/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23355156/sunrisearc_unlabeled.png",
  "description": "A star system from the early universe",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}