{
  "title": "Mental health apps have terrible privacy protections, report finds",
  "url": "https://www.theverge.com/2022/5/2/23045250/mozilla-mental-health-app-privacy-analysis",
  "date": "2022-05-02T08:00:00.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/g_KXyBePdqmMRMtA1OGf2XQfr2g=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70821118/acastro_181017_1777_brain_ai_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"2jgiVg\">As a category, mental health apps have worse privacy protections for users than most other types of apps, according to a new analysis from researchers at Mozilla. Prayer apps also had poor privacy standards, the team found. </p><p id=\"wtK04d\">“The vast majority of mental health and prayer apps are exceptionally creepy,” Jen Caltrider, the Mozilla<em> *Privacy Not Included</em> guide lead, said in a statement. “They track, share, and capitalize on users’ most intimate personal thoughts and feelings, like moods, mental state, and biometric data.”</p><p id=\"PguIYD\">In the latest iteration of <a href=\"https://foundation.mozilla.org/en/privacynotincluded/categories/mental-health-apps/\">the guide</a>, the team analyzed 32 mental health and prayer apps. Of those apps, 29 were given a “privacy not included” warning label, indicating that the team had concerns about how the app managed user data. The apps are designed for sensitive issues like mental health conditions, yet collect large amounts of personal data under vague privacy policies, the team said in the statement. Most apps also had poor security practices, letting users create accounts with weak passwords despite containing deeply personal information. </p><p id=\"CKjJyO\">The apps with the worst practices, according to Mozilla, are Better Help, Youper, Woebot, Better Stop Suicide, Pray.com, and Talkspace. The AI chatbot Woebot, for example, says it collects information about users from third parties and shares user information for advertising purposes. Therapy provider Talkspace collects user chat transcripts. </p><p id=\"zNJNww\">The Mozilla team said in a statement that it reached out to the companies behind these apps to ask about their policies multiple times, but only three responded. </p><p id=\"ThzrQ5\">In-person, traditional mental health care can be hard for many people to find — most therapists have long waiting lists, and navigating insurance and costs can be a major barrier to care. The problem got worse during the COVID-19 pandemic when more and more people started to need care. Mental health apps sought<strong> </strong>to fill that void by making resources more accessible and readily available. But that access could come with a privacy tradeoff, the report shows. </p><p id=\"HRJlyP\">“They operate like data-sucking machines with a mental health app veneer,” said Mozilla researcher Misha Rykov in a statement. “In other words: A wolf in sheep’s clothing,” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2_fYPSyvvHSDJ0NIvrahsyHWiO8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13292779/acastro_181017_1777_brain_ai_0002.jpg",
  "description": "They’re responsible for deeply personal information.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}