{
  "title": "Mercedes-Benz announces high-performance AMG version of its EQE electric sedan",
  "url": "https://www.theverge.com/2022/2/15/22934863/mercedes-benz-amg-eqe-electric-sedan-ev",
  "date": "2022-02-15T23:01:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/efmNnU8gBG_PKlFfiS_lSNl8Vtg=/0x0:4961x3307/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70514480/2022_01_14_Image_21C0616_014.0.jpg\" />    </figure>  <p id=\"A3saq9\">Mercedes-Benz continues to make good on its promise to go all-electric by 2030 with the announcement of the AMG EQE, a high-performance version of <a href=\"https://www.theverge.com/2021/9/5/22657836/the-mercedes-benz-eqe-is-a-more-approachable-luxury-electric-car\">the automaker’s electric E-class sedan</a>. </p><p id=\"J84Mkk\">The AMG EQE is the second battery-electric production car from the automaker’s in-house performance AMG subsidiary, following <a href=\"https://www.theverge.com/2021/9/5/22654508/mercedes-benz-amg-eqs-electric-performance-specs-iaa\">the AMG EQS sedan</a> announced last September. Both cars will be built on Mercedes’ EVA2 platform, which underpins the EQS, the smaller EQE, and several SUV sister models. The EVA2 is designed for medium and large vehicles, while the automaker’s MMA (Mercedes Modular Architecture), debuting in 2025, will be for electric compact cars such as the EQA and EQB.</p><div class=\"c-float-right\"><aside id=\"IaD5i9\"><q>The new Mercedes-AMG EQE will be wicked fast</q></aside></div><p id=\"3jlP8H\">The new Mercedes-AMG EQE will be wicked fast, boasting a 0–60mph acceleration of 3.2 seconds as a top speed of 149 mph with the Dynamic Plus package (3.4 seconds and 1347 mph without the package). Its dual electric motors put out 677 horsepower and 738 ft-lbs of torque when equipped with the AMG Dynamic Plus package and boost function. (Without the Dynamic Plus package, the AMG EQE will still put out a still-respectable 617 horsepower.)</p><div id=\"9kVBBY\"><div data-anthem-component=\"gallery:11039613\"></div></div><p id=\"oFiVyU\">The 328-volt battery has a usable energy content of 90.6kWh and consists of 10 modules with a total of 360 pouch cells. The estimated range is between 444-518 km, which translates to 275-321 miles  — although Mercedes says that US-specific measurements will be released closer to launch.</p><p id=\"Ejq8vs\">Mercedes says it has reduced the cobalt content of the battery’s chemistry to 10 percent. Cobalt is the most expensive material used in batteries, so eliminating it from the mix is expected to help EVs become as affordable as those that run on gas. It has also been called the “blood diamond of batteries” because it’s been mined in a way that’s endangered child workers and wrecked the environment in the Democratic Republic of Congo.</p><div class=\"c-float-right\"><aside id=\"tYtz0V\"><q>Mercedes says the AMG EQE will go on sale in the US in early 2023</q></aside></div><p id=\"gfEgAW\">Like with the AMG EQS, Mercedes says the EQE’s battery management system is also configured specifically for AMG. In the Sport and Sport Plus driving modes, the focus is on performance, while Comfort mode focuses on operating range. </p><p id=\"AUEDPJ\">Mercedes says the AMG EQE will go on sale in the US in early 2023. The company didn’t disclose any pricing information, but we can imagine it will cost less than the AMG EQS and EQS sedan, which sells for over $100,000. </p><p id=\"d14dRB\">If the AMG EQS looks like a worthy competitor to <a href=\"https://www.theverge.com/2021/6/11/22528963/tesla-model-s-plaid-ev-price-specs-range-speed\">Tesla’s Model S Plaid</a>, the AMG EQE is likely about trying to offer a somewhat more affordable and approachable way into what Mercedes-Benz is doing at the high end with its electric cars. And as long as it fulfills its promises, the AMG EQE could be a more promising entrant into the market than some of Mercedes-Benz’s other early attempts, like the EQC, which was full of compromises due to being built on a combustion engine platform instead of being a ground-up electric vehicle — one of the goals that it established when it <a href=\"https://www.theverge.com/2019/9/10/20858555/mercedes-benz-vision-eqs-concept-frankfurt-motor-show-2019\">first revealed the Vision EQS concept in 2019</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MlaMky8C_dcackobcQhycVYx9Rw=/0x356:4961x2953/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23243549/2022_01_14_Image_21C0616_014.jpg",
  "description": "On sale in the US in early 2023",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}