{
  "title": "Mercedes-Benz Vision EQXX concept car traveled over 1,000 km on a single charge",
  "url": "https://www.theverge.com/2022/4/13/23024041/mercedes-benz-vision-eqxx-ev-distance-battery-charge-test",
  "date": "2022-04-13T22:01:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7NF3l2Pn4gmwfLRnxI0a2oJiTkc=/0x208:4961x3515/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70746387/22C0141_030.0.jpg\" />    </figure>  <p id=\"bD7hTE\">Mercedes-Benz announced that its electric concept car, <a href=\"https://www.theverge.com/2022/1/3/22855555/mercedes-benz-vision-eqxx-ev-range-ces-2022\">the Vision EQXX</a>, successfully completed a long-range test of over 1,000 km on a single battery charge. It was among the longest distances covered by an electric vehicle on a single charge. </p><p id=\"qZDAQQ\">The trip took place across several European cities, starting in Germany, then on to Switzerland and Italy, and finally to its destination, the port town of Cassis near Marseille in the South of France. Temperatures ranged from 3 to 18 degrees Celsius (37 to 64 degrees Fahrenheit), and the vehicle traveled at an average speed of 54 mph. </p><p id=\"7wfOxp\">The distance covered was “over” 1,000 km, or about 621 miles. That is more than twice the typical range that most EVs on the road today can travel. According to Mercedes, the Vision EQXX’s state of charge on arrival was around 15 percent, leaving the vehicle with a remaining range of around 140 km (87 miles). The average consumption was a record-breaking low of 8.7 kWh per 100 km (7.1 kWh per 62 miles). </p><div class=\"c-float-right\"><aside id=\"hiudU8\"><q>The distance covered was “over” 1,000 km, or about 621 miles</q></aside></div><p id=\"mx5n16\">Mercedes first introduced the Vision EQXX earlier this year as primarily an experiment in battery efficiency. With its sporty intentions and sleek, futuristic design, the concept car will likely serve as the basis for a production car that could end up rivaling other luxury EVs like the <a href=\"https://www.theverge.com/2019/11/27/20983836/porsche-taycan-turbo-electric-car-first-drive-hands-on-photos-video-range\">Porsche Taycan</a>, <a href=\"https://www.theverge.com/2021/11/23/22798695/audi-rs-etron-gt-review-ev-specs-price\">Audi E-tron GT</a>, and <a href=\"https://www.theverge.com/2017/11/17/16669024/tesla-roadster-2017-fastest-car-world\">Tesla Roadster</a>.</p><p id=\"jvEyVd\">The real-world range test is a boon for Mercedes, which previously claimed that the Vision EQXX will consume energy at a rate of 10kWh per 100 kilometers, or more than 6 miles per kWh. Those tests were based on a simulation of real-world traffic conditions, an estimate the Vision EQXX bested under actual<em> </em>real-world conditions. </p><div id=\"iZEJZ1\"><div data-anthem-component=\"gallery:11142743\"></div></div><p id=\"XsEQEl\">At the time, Mercedes said the Vision EQXX’s superior range is “completely realistic” and that many of its technological advancements will be integrated into future production vehicles through the Mercedes-Benz Modular Architecture. The results from the real-world tests will serve to bolster those claims. </p><p id=\"NF689z\">Of course, a range estimate is still just that: an estimate. It will be up to the Environmental Protection Agency in the US, as well as Europe’s Worldwide Harmonized Light Vehicle Test Procedure (WLTP), to certify any EV range independently. Most electric vehicles on the market today have a range that falls between 200 and 300 miles, while some earlier models have less than that. The latest <a href=\"https://www.theverge.com/2019/9/9/20857217/volkswagen-vw-id3-electric-price-specs-mile-range-frankfurt-motor-show-2019\">crop</a> <a href=\"https://www.theverge.com/2020/8/6/21357717/cadillac-lyriq-gm-ev-suv-touchscreen-size-specs-release-date\">of EVs</a> has ranges of 250–300 miles.</p><p id=\"jwfdvh\">Of course, EV range is highly subjective. Even the EPA’s rating system is only meant to present a snapshot under the specific conditions of the agency’s testing process. It typically excludes factors such as steep hill climbing and the effects of cold weather, which can wear down a vehicle’s battery much faster than when driving on flat surfaces or in warmer weather.</p><p id=\"8ABGcN\">To Mercedes’ credit, the company didn’t perform its range test under anything resembling perfect conditions. The route included a variety of steep, mountainous conditions, as well as construction work and other hazards. The wide range of temperatures, from chilly mountain air to more temperate conditions, helped show off the Vision EQXX’s performance in a variety of settings. The vehicle did not encounter snow or any freezing conditions, <a href=\"https://www.theverge.com/2019/2/10/18217041/electric-car-ev-extreme-weather-polar-vortex\">which has been known</a> to suck energy out of an EV battery. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yqneKXKExTDQBuOkI9jY_PlybOs=/0x563:4961x3160/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387865/22C0141_030.jpg",
  "description": "Over 1,000 km on a single charge",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}