{
  "title": "Mercedes-Benz announces EQS SUV, its first electric sport utility for the US",
  "url": "https://www.theverge.com/2022/4/19/23030202/mercedes-benz-eqs-suv-electric-ev-specs",
  "date": "2022-04-19T10:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PRUcR-HGopOCSR844ACHF_DwU2Y=/0x0:4961x3307/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70765637/2022_02_27_Image_22C0128_026.0.jpg\" />    </figure>  <p id=\"TsVI47\">On Tuesday, Mercedes-Benz unveiled the EQS SUV, an all-electric seven-seater that shares a platform with the automaker’s <a href=\"https://www.theverge.com/2021/4/11/22375877/mercedes-benz-eqs-ev-s-class-specs-hands-on\">recently released luxury EQS sedan</a>. With an estimated range of 373 miles (600 km), the Mercedes-Benz EQS SUV will go toe to toe with the Tesla Model X and BMW iX when it goes on sale in the US later this year. </p><p id=\"Kk7sM4\">Mercedes isn’t releasing pricing information yet, but the SUV is expected to retail for $110,000 to $130,000, depending on the trim level. It will be the German automaker’s first electric SUV to reach the US after the EQC SUV’s release was delayed indefinitely. </p><p id=\"0j7BCD\">In many respects, the EQS SUV is simply a larger EQS: same 56-inch, pillar-to-pillar Hyperscreen (for the higher trim level), same 107.8kWh battery, same design language. Acceleration is likely to be different, though Mercedes isn’t disclosing the EQS SUV’s 0–60mph time quite yet. </p><div class=\"c-float-right\"><aside id=\"Rt7tTv\"><q>In many respects, the EQS SUV is simply a larger EQS</q></aside></div><p id=\"3HKqar\">Mirroring the EQS sedan lineup, there will be two trim levels: the 450+ with rear-wheel drive and the dual-motor sporting 580 4MATIC. The 450+’s 265kW rear-axle motor will put out 265kW of energy, enabling 355 horsepower and 419 pound-feet of torque. The 580 4MATIC configuration’s front and rear-axle motors put out a combined 400kWh, for 536 horsepower and 633 pound-feet of torque. In the 4MATIC model, the Torque Shift function ensures “continuously variable distribution of drive torque between the rear and front electric motors,” Mercedes says. </p><div id=\"94C9AA\"><div data-anthem-component=\"gallery:11149793\"></div></div><p id=\"Y409iH\">Only the 4MATIC model will come with the 56-inch Hyperscreen. Those who opt for the less expensive trim will still get a digital gauge cluster and a 12.8-inch portrait-style touchscreen.  (When I tested the EQS sedan last year, I marveled at the hugeness of the Hyperscreen but also worried about the lack of physical knobs and the possibility of distractions. The company claims drivers can find “90 percent” of what they’re looking for on the first layer of the screen without having to scroll through menus or use the voice assistant.)</p><p id=\"1bnh2t\">Obviously, a major difference between the EQS and EQS SUV is size. The EQS SUV is an SUV and, by definition, is larger than a sedan. While both have the same sized wheelbase (126 inches), the ESQ SUV is over 7.8 inches higher than the sedan. At 202 inches long, 77 inches wide, and 68 inches tall, the EQS SUV is slightly slimmer and shorter than the 2022 Mercedes GLS-Class. </p><div class=\"c-float-right\"><aside id=\"QRbMD8\"><q>Obviously, a major difference between the EQS and EQS SUV is size</q></aside></div><p id=\"ESpHOJ\">Another thing that distinguishes the SUV from the sedan is off-roading capabilities. The EQS SUV will come with an OFFROAD driving mode, in which the AWD distribution is “optimized for unpaved roads, inclines and terrain.” Hummer EV with Crab Mode this thing ain’t, but it is cool to think about bouncing along some gravel roads while fully ensconced in a German-made luxury interior. That said, most people who buy this EV aren’t the types to seek out challenging back-road drives. </p><p id=\"p4WllY\">Like the EQS sedan, the SUV will come with Plug and Charge capabilities. That means the EQS SUV will be compatible with about 90 percent of the public charging stations in the US without the need to download an app or sign up for an individual charging service. Mercedes didn’t provide information about SUV architecture’s voltage, but it did say that the battery will charge from 10 percent to 80 percent in 31 minutes when plugged into a 110kW-or-more DC fast charger. The EQS SUV’s peak output is 265kW. </p><p id=\"ypeEjQ\">Something that caught my eye in the 55-page (!!) press release about the EQS SUV is the description of the SUV’s interior as “avant-garde.” Apparently, the contrast between the massive Hyperscreen and an ultra-thin vent band that spans the width of the dashboard, as well as “circular ambient lighting,” are the two interior design elements that qualify as avant-garde to Mercedes-Benz. I’ll leave it up to the art critics to determine whether that meets the standard from their perspective. </p><p id=\"LUATW2\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QiE9haMYJoHkTBIkZy9XGL4Xcnw=/0x356:4961x2953/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397258/2022_02_27_Image_22C0128_026.jpg",
  "description": "Less range but more headroom",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}