{
  "title": "Messenger gets new shortcuts that let you send silent replies",
  "url": "https://www.theverge.com/2022/3/29/23001776/messenger-shortcuts-commands-silent-replies-everyone-pay-gif-shrug-table",
  "date": "2022-03-29T18:47:18.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pxdPGC4_o1MrXTEpydnQnEksLIs=/2x0:766x509/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70686126/Silent_Shortcut.0.jpeg\" />        <figcaption><em>The new shortcuts give you new tools for your chats.</em> | Image: Meta</figcaption>    </figure>  <p id=\"eFoOUq\">Meta, the parent company of Facebook, is introducing <a href=\"https://messengernews.fb.com/2022/03/29/everyone-introducing-shortcuts-on-messenger/\">Slack-like shortcuts to Messenger</a> that let you do things like send a message silently or quickly call up a GIF while you’re chatting with your friends.</p><p id=\"G1vBP1\">Two of the shortcuts are available today, March 29th, according to Meta: @everyone and /silent. @everyone will let you notify everyone in a chat, which could be useful if you want to make sure to get everyone’s attention. (On behalf of your friends’ notifications, I beg you to please use this one responsibly.) However, if you want to send a message <em>without</em> pinging the whole group, you’ll be able to use the /silent shortcut, Meta says.</p><p id=\"OCbwFo\">In “the coming weeks,” there will be a few more shortcuts. /pay will let you send or request money right from the Messenger chatbox and will be available soon on iOS and Android in the US. Type /gif and a topic of something you want a GIF of to see some potential options to drop in the chat. This feature will be available soon on iOS. And /shrug and /tableflip, which will also be available soon on iOS, will let you drop the classic ¯\\_(ツ)_/¯ and (╯°□°）╯︵ ┻━┻ emoticons without having to type them out yourself.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6kTu1zzw2HNuWy9cYyIw3c69Xm4=/0x54:768x456/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23353330/Silent_Shortcut.jpeg",
  "description": "And soon, /shrug and /tableflip.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}