{
  "title": "Meta even brings up the metaverse when rebranding its payment system",
  "url": "https://www.theverge.com/2022/5/12/23069251/meta-facebook-pay-rebrand",
  "date": "2022-05-12T21:22:16.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u20df3SlCxUNPoOEE_ls2iH_9iA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70862762/acastro_211101_1777_meta_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"VEECUF\">Meta is continuing the Meta-fication of its brands by renaming Facebook Pay, its <a href=\"https://www.theverge.com/2019/11/12/20961447/facebook-pay-whatsapp-instagram-messenger-features\">payment system</a> available across Facebook, Messenger, Instagram, and WhatsApp, to Meta Pay. The change is set to happen “soon,” according to <a href=\"https://medium.com/@skasriel/where-the-metaverse-can-take-fintech-a936e6bd6987\">a blog post</a> from Stephane Kasriel, Meta’s head of commerce and financial technologies, and is the latest indication that the company formerly known as Facebook <a href=\"https://www.theverge.com/22588022/mark-zuckerberg-facebook-ceo-metaverse-interview\">is all in on the metaverse</a>.</p><p id=\"sPHlY8\">“We’re focused on enhancing the payments experiences we already provide with Facebook Pay where we’re seeing good adoption,” Kasriel wrote. “And with this, an emphasis on quality in the countries that we are already in, rather than expanding to new countries right now.” People in businesses in 160 countries use Meta’s platforms to make payments, according to Kasriel’s post.</p><p id=\"Xvl29I\">Meta is also looking at how to simplify the payments experience on its platforms. While Kasriel painted a broad picture, he didn’t share much in the way of specifics:</p><blockquote><p id=\"N6pp7V\">We view this as a single wallet experience for people to use to represent who they are, what they own, and how they pay. We’re in the very early stages of scoping out what a single wallet experience might look like and will have more to say further down the line. But to break down our early thinking, we’re looking at: how you can prove who you are and carry that identity into different experiences in the metaverse; how you can store the digital goods you own and take them with you wherever you go; and how you can pay easily and with the payment method you want, whether that’s to a friend or buying from a business or creator.</p></blockquote><p id=\"fRMUZM\">Kasriel also discussed how Meta is thinking about Web3 technologies like blockchain and NFTs. “Imagine a world where entertainers or athletes can sell NFTs that fans purchase to display in their virtual Horizon Homes,” he wrote in one example. (Horizon Worlds is Meta’s social metaverse platform.) “Or imagine all of this coming together when your favorite artist is playing a concert in the metaverse and shares an NFT you can buy to get a backstage pass for after the show.</p><p id=\"e6CJiu\">“Beyond NFTs, there’s a multitude of other Web3 tokens that we think are compelling — social tokens, community tokens, governance tokens — as well as tokenized real-world assets,” he added. “There are a lot of opportunities here, and we’re taking steps to understand them better and what they could mean for the metaverse.” Meta is already dipping its toes in the water with NFTs — it announced <a href=\"https://www.theverge.com/2022/5/9/23063514/nfts-coming-to-instagram-meta-digital-artwork\">this week</a> that it would begin testing the ability to share NFTs on Instagram, and CEO Mark Zuckerberg said that “similar functionality” is coming to Facebook soon. </p><p id=\"5gP3kc\">Kasriel took over for David Marcus, who headed up Messenger and then Meta’s stalled cryptocurrency project, after he <a href=\"https://www.theverge.com/2021/11/30/22810220/facebook-crypto-david-marcus-novi-diem-meta\">left Meta at the end of last year</a>. While Meta called it quits on that cryptocurrency project <a href=\"https://www.theverge.com/2022/1/31/22911426/meta-diem-cryptocurrency-confirms-sale\">in January</a>, based on Kasriel’s blog published Thursday, it’s clear that the company still sees many other opportunities in payments and blockchain. Marcus is still involved in cryptocurrency, by the way; on Thursday, <a href=\"https://twitter.com/davidmarcus/status/1524826813096112128\">he announced</a> his newest company, <a href=\"https://www.lightspark.com/\">Lightspark</a>, which was created to “explore, build and extend the capabilities and utility of Bitcoin.”</p><p id=\"25spkH\">Despite its vocal metaverse ambitions, Meta is slightly reducing its investment in the idea. <em>Reuters</em> reported Wednesday that the company is telling staffers in its Reality Labs division <a href=\"https://www.reuters.com/technology/exclusive-facebook-owner-meta-tells-hardware-staffers-prepare-cutbacks-2022-05-11/?utm_medium=Social&amp;utm_source=twitter\">to prepare for cutbacks</a> (though no layoffs are planned). But the company is still pushing hard on virtual reality, with Zuckerberg showing off Meta’s upcoming high-end virtual reality headset in a short demo video <a href=\"https://www.theverge.com/2022/5/12/23068536/meta-project-cambria-vr-ar-demo-mark-zuckerberg\">earlier on Thursday</a>, and has <a href=\"https://www.theverge.com/23022611/meta-facebook-nazare-ar-glasses-roadmap-2024\">big plans for augmented reality hardware</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iK-KTeHZYspkC6uhIxui7MfT2VY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22977158/acastro_211101_1777_meta_0004.jpg",
  "description": "Meta is also looking at how to simplify payments.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}