{
  "title": "Meta’s policy lead Nick Clegg gets a presidential new title",
  "url": "https://www.theverge.com/2022/2/16/22937673/meta-policy-lead-nick-clegg-promoted-new-title-policy",
  "date": "2022-02-17T00:10:39.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"Conclusion of the DLD Innovation Conference\" src=\"https://cdn.vox-cdn.com/thumbor/oezwcOZBhdtHmoDSRvJaaBjfMew=/0x62:5342x3623/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70518465/1194882390.0.jpg\" />        <figcaption>Photo by Lino Mirgeler/picture alliance via Getty Images</figcaption>    </figure>  <p id=\"FF5pdt\">Nick Clegg — Meta’s head of policy and communications — is getting a fancy new title: he’s being upgraded from <em>vice president</em> of global affairs to <em>president</em> of global affairs. The move seems less about elevating Clegg’s responsibilities and more about positioning him (rather than CEO Mark Zuckerberg or COO Sheryl Sandberg) front and center for Meta’s major policy decisions and interactions with governments. </p><p id=\"MiF47a\">“For the last three years, Nick has managed some of the most complex issues our company faces — including content policy, elections, the establishment of the Oversight Board, and more,” Zuckerberg wrote <a href=\"https://www.facebook.com/4/posts/10114319077261181/?d=n\">in a post announcing the move</a>. “Nick will now lead our company on all our policy matters, including how we interact with governments as they consider adopting new policies and regulations, as well as how we make the case publicly for our products and our work.”</p><p id=\"1nYZa0\">Facebook confirmed Clegg’s responsibilities over communications and policy for Meta will remain the same<em>. </em>His new role will see him jointly report to Zuckerberg and Sandberg, Meta’s chief operating officer, instead of to just Sandberg alone. Clegg had previously worked as a politician in the United Kingdom and served as the Deputy Prime Minister from 2010 to 2015 <a href=\"https://www.theverge.com/2018/10/20/18002056/nick-clegg-facebook-whatsapp-brazil-election\">before joining Facebook in 2018</a>. </p><aside id=\"krOG1v\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Facebook hired a new public defender, and he should start with WhatsApp\",\"url\":\"https://www.theverge.com/2018/10/20/18002056/nick-clegg-facebook-whatsapp-brazil-election\"},{\"title\":\"Facebook hires former UK deputy prime minister Nick Clegg to run global affairs\",\"url\":\"https://www.theverge.com/2018/10/19/17999308/facebook-nick-clegg-global-affairs-gdpr-uk-parliament\"}]}'></div></aside><p id=\"0uHq34\">The move also appears intended to shift Zuckerberg’s focus and responsibility on major policy decisions more fully over to Clegg, who had already been handling much of that work in the public eye. The goal, ostensibly, is to give Zuckerberg more time to help build out Meta’s metaverse ambitions while spending less time in front of congressional committees under fire for how Facebook does or does not moderate content. </p><p id=\"k6JRyq\">“As Nick takes on this new leadership role, it will enable me to focus more of my energy on leading the company as we build new products for the future, and it will support Sheryl as she continues to focus on the success of our business,” Zuckerberg’s note adds. </p><p id=\"J5kj3q\">Meta and its products — which include Facebook, WhatsApp, and Instagram — have seen no shortage of controversy over policy decisions, with debates over how the company has <a href=\"https://www.theverge.com/2021/10/30/22754046/facebook-tighter-restrictions-vaccine-misinformation-children\">handled things like COVID-19 misinformation</a>, the <a href=\"https://www.theverge.com/2021/11/24/22800901/instagram-chief-adam-mosseri-testify-congress-facebook-meta-zuckerberg\">mental health of younger Instagram users</a>, and the <a href=\"https://www.theverge.com/2021/6/4/22519073/facebook-trump-ban-2-year-oversight-board-decision-political-figures-newsworthiness\">contentious decision to bar President Donald Trump from its platforms</a>. Having a higher-level executive like Clegg who can serve as a public face when addressing these issues and who directly reports to Meta’s CEO and COO could help streamline some of that process, especially with Meta heading towards another US election season this fall. </p><p id=\"QU8kFk\"><em><strong>Correction February 16th, 7:10PM ET: </strong></em><em>An earlier version of this story cited Joel Kaplan as saying Nick Clegg would retain the same responsibilities over communications and policy. In fact, Facebook confirmed Clegg will retain those responsibilities over Kaplan. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/23xT9UcUnlj2YyAL_in_Hqc7Uuc=/0x531:5342x3328/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23250354/1194882390.jpg",
  "description": "From vice president to president",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}