{
  "title": "Meta is reportedly making ‘Zuck Bucks’",
  "url": "https://www.theverge.com/2022/4/6/23013896/meta-facebook-zuck-bucks-finance-financial-services-products",
  "date": "2022-04-06T22:54:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yfpIz0bIztv1WO1tiac5vT2nxqw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70719213/VRG_ILLO_3512_001.0.jpg\" />        <figcaption><em>Libra / Diem may be shut down, but “Zuck Bucks” could be coming next.</em> | Illustration by William Joel / The Verge</figcaption>    </figure>  <p id=\"MnWZaD\">Meta <a href=\"https://www.theverge.com/2022/1/31/22911426/meta-diem-cryptocurrency-confirms-sale\">may have given up on its Diem cryptocurrency</a>, but the company is still exploring finance products, according to a <a href=\"https://www.ft.com/content/50fbe9ba-32c8-4caf-a34e-234031019371\">new <em>Financial Times</em> report</a>. The parent company of Facebook and Instagram reportedly has a few irons in the fire, including virtual currency employees have apparently taken to calling “Zuck Bucks.”</p><p id=\"GqLTKz\">Zuck Bucks, seemingly named for Meta founder, chairman, and CEO Mark Zuckerberg, are “unlikely” to be a cryptocurrency. “Instead, Meta is leaning towards introducing in-app tokens that would be centrally controlled by the company, similar to those used in gaming apps such as the Robux currency in popular children’s game <em>Roblox,” </em>according to the <em>FT</em>. <em>Roblox</em> has built a <a href=\"https://www.theverge.com/2020/11/19/21578491/roblox-ipo-announced-dau-increase-pandemic\">huge business</a> selling Robux, and Meta could try to emulate some of that success on its own platforms. </p><p id=\"bVqCT0\">Meta hasn’t totally distanced itself from blockchain products, as the company is also looking into posting and sharing NFTs on Facebook. The <em>FT</em> says the company plans to launch a pilot for doing just that in mid-May, according to a memo, and soon after, Meta will test allowing “membership of Facebook groups based on NFT ownership and another for minting” NFTs. The <em>FT</em> previously <a href=\"https://www.ft.com/content/2745d50b-36e4-4c0a-abe0-e93f035b0628\">reported on</a> some of Meta’s NFT plans for Facebook and Instagram <a href=\"https://www.theverge.com/2022/1/20/22892917/meta-facebook-instagram-plans-make-show-case-sell-nfts\">in January</a>, and Zuckerberg announced in March that <a href=\"https://www.theverge.com/2022/3/15/22979926/instagram-nfts-meta-zuckerberg-sxsw-metaverse\">NFTs would be coming to Instagram</a>.</p><p id=\"B1kHWK\">In addition, Meta is exploring “social tokens” or “reputation tokens,” which “could be issued as rewards for meaningful contributions in Facebook groups, for example,” the <em>FT</em> reports. The company is also apparently looking into traditional financial services like small business loans. </p><p id=\"ilYZ1e\">“We have no updates to share today,” Meta spokesperson Lauren Dickson said in a statement to <em>The Verge</em>. “We continuously consider new product innovations for people, businesses, and creators. As a company, we are focused on building for the metaverse and that includes what payments and financial services might look like.”</p><p id=\"EzBUqq\">We’ll have to wait and see how Zuck Bucks or other rumored projects pan out and if they can help Meta overcome some of its <a href=\"https://www.theverge.com/2022/2/2/22914970/facebook-app-loses-daily-users-first-time-earnings\">recent troubles</a>. But one high-profile person appears to be a big fan of Facebook’s plans: <a href=\"https://twitter.com/jack/status/1511820835182546949\">former Twitter CEO Jack Dorsey</a>.</p><div id=\"grqdxX\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">insanely great™️<br><br>(please let this be real)</p>— jack⚡️ (@jack) <a href=\"https://twitter.com/jack/status/1511820835182546949?ref_src=twsrc%5Etfw\">April 6, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"z0rzQ4\"></p><p id=\"t2upqq\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yuDBII8tpczgtZPvToli-BuZJ-E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16677181/VRG_ILLO_3512_001.jpg",
  "description": "They’re one of a few finance projects in the works at Meta.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}