{
  "title": "Meta freezes hiring for shopping team, Messenger Kids, and other products",
  "url": "https://www.theverge.com/2022/5/18/23125571/meta-hiring-freeze-commerce-messenger-kids-facebook-gaming",
  "date": "2022-05-18T23:34:33.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-KuihCfGUDeF1cfKVkxC_bRtti8=/0x1:6056x4038/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70885583/verge_vjeran_pavic_meta_3_20211028.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"FML38w\">Meta is pulling back its investments in a number of products, including the teams it spun up early in the pandemic to compete with Zoom and build shopping features, <em>The Verge </em>has learned. In addition to a hiring freeze for certain engineering roles, the company also recently paused the hiring of recruiters and low-level data scientists.</p><p id=\"jGZTxO\">While the hiring freezes have caused employees to fear that layoffs are around the corner, CEO Mark Zuckerberg said in an internal all-hands meeting last Thursday that job cuts are not being planned. “I can’t sit here and make a permanent ongoing promise that as things shift that we won’t have to reconsider that,” Zuckerberg said, according to a recording of the meeting obtained by <em>The Verge</em>. “But what I can tell you is that as of where we sit today, our expectation is not that we’re going to have to do that. And instead, basically what we’re doing is we’re dialing growth to the levels that we think are going to be manageable over time.”</p><p id=\"Usn1em\">Here’s what that dialing back looks like so far: Meta’s leaders have in recent days started telling specific teams that they won’t be able to hire new engineers or receive internal transfers. It’s a sign that those specific products don’t make money or aren’t strategically important enough to keep investing in while <a href=\"https://www.theverge.com/2022/4/27/23045274/zuckerberg-says-meta-will-slow-spending-first-quarter-earnings\">Meta’s stock price is down 43% this year</a>. Product teams already impacted by an engineering freeze including Facebook Dating and Gaming, Messenger Kids, the Commerce team, and the Remote Presence team created during the pandemic to build video and audio calling features to better compete with Zoom.</p><p id=\"zlgAVV\">Joe Osborne, a Meta spokesperson, confirmed the engineer hiring pullbacks for the specific teams, and said the company is still actively recruiting for machine learning and AI roles. “As we alluded to in our recent earnings, we’re evaluating key priorities across the company and putting energy behind them especially as they relate to our core business and Reality Labs,” he said in a statement shared with <em>The Verge</em>.</p><p id=\"Rxxkid\">Inside Reality Labs, which makes the metaverse software and hardware Zuckerberg is betting the company’s future on, CTO Andrew Bosworth recently told employees that some projects will be deprioritized in favor of others, as first reported by <a href=\"https://www.reuters.com/technology/exclusive-facebook-owner-meta-tells-hardware-staffers-prepare-cutbacks-2022-05-11/\"><em>Reuters</em></a><em>. </em>Employees won’t be moved out of the division, which already totals over 17,000 people, and the specific team changes haven’t been communicated internally yet.</p><p id=\"TUbLh7\">Meta has been hurt by a combination of the rise of TikTok, a broader sell-off in tech stocks, and Apple’s ad tracking changes that are costing the company billions of dollars in lost ad revenue, Zuckerberg told employees last week. At the same time, he tried to assure them that the company, with its rich balance sheet and billions of dollars in quarterly profit, is in a strong place to navigate what many on Wall Street believe could be a protracted downturn in the stock market.</p><p id=\"9J0klP\">“Whenever we bring growth targets down, I think that you always hear a bunch of speculation around like, “Okay, are we in trouble? Or is something more dramatic going to happen?’” he said during the internal all-hands meeting. “And look, obviously if everything was going exactly the way we planned we wouldn’t be changing this. But I do want to be clear that we’re in a very strong position and have a very healthy business, and we’re still growing quickly.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4ECl1MgKXJDJ_pRPP6p4u_NPCaQ=/0x434:6056x3605/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22964001/verge_vjeran_pavic_meta_3_20211028.jpg",
  "description": "Mark Zuckerberg downplayed the possibility of layoffs",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}