{
  "title": "Meta will no longer allow the sharing of ‘publicly available’ private home addresses",
  "url": "https://www.theverge.com/2022/4/10/23019046/meta-no-longer-allow-private-residential-address-doxxing-facebook-instagram-oversight-board",
  "date": "2022-04-10T16:51:50.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sepJ8am2KwIZnYXwY-utNgBYM2E=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70732954/acastro_180522_facebook_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"WrFnkx\">Meta is following the Oversight Board’s recommendation to remove an exception that permitted users to share a person’s residential address as long as it’s “publicly available,” the Facebook parent company announced in an <a href=\"https://transparency.fb.com/pao-private-residential-information-policy/\">updated post</a> (via <a href=\"https://www.engadget.com/meta-facebook-response-tooversight-board-doxxing-235953823.html\"><em>Engadget</em></a>).</p><p id=\"d08aAx\">Meta’s response comes about a year after the company asked the Oversight Board to weigh in on its handling of private residential information. The <a href=\"https://www.theverge.com/2022/2/8/22923388/facebook-doxxing-oversight-board-home-address-sharing-policy\">Board issued a response in February</a>, calling on Meta to tighten its policies surrounding the sharing of private home addresses over concerns about doxxing.</p><p id=\"RFyrm7\">Although Facebook and Instagram already have rules in place to bar users from sharing someone’s home address, the Meta-owned platforms take no action against posts containing “publicly available addresses.” By Meta’s standards, this means any addresses that have been published in five or more news outlets or have been made available in public records. Meta says it will end this exception “by the end of the year.”</p><div class=\"c-float-right\"><aside id=\"7jmDQZ\"><q>Meta’s decisions should add an additional layer of protection for victims of doxxing</q></aside></div><p id=\"TfR3V0\">“As the board notes in this recommendation, removing the exception for ‘publicly available’ private residential information may limit the availability of this information on Facebook and Instagram when it is still publicly available elsewhere,” Meta writes. “However, we recognize that implementing this recommendation can strengthen privacy protections on our platforms.”</p><p id=\"63QM5K\">Additionally, Meta is changing its response to posts that include photos of the outside of private homes. The company says it won’t take action if “the property depicted is the focus of a news story,” unless it’s “shared in the context of organizing protests against the resident.” It will also permit users to share the exterior of publicly-owned residencies belonging to “high ranking officials,” like heads of state or ambassadors, and will, conversely, allow users to organize protests at these locations. And while Meta says it will continue to let users post their own addresses, it won’t follow the Board’s recommendation to let other users reshare them, citing that it’s “often impossible to know whether a resident has consented to allowing another person to share their private address.”</p><p id=\"RoY1F3\">Moreover, Meta didn’t fully commit to implementing tools that make it easier for users to report a privacy violation. It’s assessing the feasibility of the Board’s recommendation to simplify the process of requesting the removal of private information on Facebook and Instagram. The company says it’s testing a way to make the “Privacy Violation” reporting option easier to find. Instead of clicking through two menus and searching for the specific option, Meta says it will test making the option more “prominent.”</p><p id=\"ajDKFX\">The Board suggested creating a “specific channel” to handle reports of doxxing as well, but Meta declined to take action. Meta replied by saying it’s “actively building new channels for users to get support,” and that it already partners with over 850 organizations victims can contact to get help, like the Revenge Porn Helpline in the UK and the National Network to End Domestic Violence in the US.</p><p id=\"qXvnjJ\">Meta’s planned policy changes, particularly its decision to close off the residential address exception, should add an additional layer of protection for <a href=\"https://www.vox.com/first-person/2017/7/13/15960394/online-sexual-harassment-doxxing-craigslist\">victims of doxxing</a>. Doxxing is the act of revealing a person’s name, phone number, email address, or home address online with the purpose of waging a harassment campaign against them. This also marks the first time Meta has responded to the Oversight Board’s policy advisory opinion.</p><p id=\"RJExox\"><a href=\"https://www.theverge.com/2020/1/28/21111750/facebook-oversight-board-launch-date-members-moderation\">The Oversight Board was launched in 2020</a>, and includes a diverse set of members who provide external guidance on Meta’s moderation decisions and policies across all its platforms. Meta isn’t bound to any of the decisions made by the Oversight Board, but must respond to each of its recommendations as it did here.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KXAhazZGGRE0A7ta_MEox0_A80k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11105269/acastro_180522_facebook_0001.jpg",
  "description": "Meta will end the exception that let users dox private addresses.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}