{
  "title": "Meta launches Reels in Facebook globally, with more ads and editing features",
  "url": "https://www.theverge.com/2022/2/22/22945800/meta-facebook-reels-tiktok-clone-global-launch",
  "date": "2022-02-22T17:00:00.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2nipIKceIqat5ZLqAdFjPind9bQ=/0x166:1100x899/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70536900/Facebook_Reels_Ads.0.png\" />    </figure>  <p id=\"Vm845q\">Meta is launching its TikTok-clone Reels <a href=\"https://about.fb.com/news/2022/02/launching-facebook-reels-globally/\">worldwide on Facebook</a>, making the feature available through the service’s iOS and Android apps in more than 150 countries. </p><p id=\"pqiSyA\">In addition to expanding access to Reels, the social media conglomerate is adding new editing features to the Facebook version of the platform and expanding advertising options. Most of these features are already available on Facebook Reels <a href=\"https://www.theverge.com/2021/8/19/22632223/facebook-reels-update-app-test-launch\">in the US and elsewhere</a> and in Instagram Reels <a href=\"https://techcrunch.com/2020/08/05/instagram-reels-launches-globally-in-over-50-countries-including-u-s/\">in the US and more than 50 countries</a>.</p><p id=\"5RNZcz\">Facebook Reels users will be able to “remix” others’ videos (duet them) and upload clips up to 60 seconds in length, just as with Instagram Reels. They’ll also be able to save drafts, and Meta will be adding new video clipping tools in the coming months “that will make it easier for creators who publish live or long-form, recorded videos to test different formats.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3sauyvfRJBpziE4iHwkeBSdd6PU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262940/Facebook_Reels_Experience.png\">      <cite>Image: Meta</cite>      <figcaption><em>Users will be able to share the short-form video reels to more places in Facebook, including the platform’s Stories and Watch features. </em></figcaption>  </figure><p id=\"2jRB8O\">Meta is also adding more monetization adverts to Facebook Reels — aka, more ads. There’ll be two new formats: banner ads that appear “as a semi-transparent overlay at the bottom of a Facebook Reel” and static sticker ads “that can be placed by a creator anywhere within their reel.” The company will also be giving creators in “nearly all countries where in-stream ads are available” access to its automatic <a href=\"https://www.facebook.com/creators/tools/in-stream-ads\">ad-placement program</a> and rolling out paid Stars (a way for fans to directly donate to creators).</p><p id=\"YAQGuP\">Meta says that “over the coming weeks,” users will be able to share Reels in more places on Facebook, including in Stories and the platform’s Watch tab. </p><p id=\"8DGLxu\">Notably, the company did not share any new statistics for the success of its Reels platform. Although Meta has been extremely successful in cloning some rivals’ features (like copying Snapchat’s Stories function on Instagram), its ability to challenge TikTok in the short-form video world is still uncertain.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eG7YDJ4sDBenF8y-_hLeMT4I4lA=/0x244:1100x820/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262938/Facebook_Reels_Ads.png",
  "description": "Facebook’s TikTok clone gets a wider launch.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}