{
  "title": "Meta reportedly breaks up the 300-person team that was building a hybrid VR / AR OS",
  "url": "https://www.theverge.com/2022/2/25/22950710/meta-vr-ar-os-team-xros-breakup-hyper-tuned-focus",
  "date": "2022-02-25T18:02:13.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/b2Q8pyoPrHA12aFntcJb_F5fTls=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70550683/acastro_211101_1777_meta_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"DPfebV\">Meta has reportedly broken up the around 300-person team tasked with working on an OS for AR and VR headsets, moving some of the engineers to teams working on <a href=\"https://www.theverge.com/2020/9/16/21439929/facebook-ar-smart-glasses-ray-ban-announcement\">AR glasses</a> and Oculus (<a href=\"https://www.theverge.com/2021/10/28/22751220/facebook-portal-oculus-quest-meta-horizon-renaming\">er, Quest</a>) headsets, according to <a href=\"https://www.theinformation.com/articles/meta-platforms-dissolves-team-developing-new-ar-and-vr-operating-system\">a report by <em>The Information</em></a>. This comes <a href=\"https://www.theverge.com/2022/1/5/22868388/meta-xros-vr-ar-os-development-canceled\">after recent reports</a> — which Meta denied at the time — that the company had halted work on the team’s project creating a unified custom operating system for its VR and AR headsets.</p><p id=\"32dKm2\">In January, reports surfaced that <a href=\"https://www.theverge.com/2022/1/5/22868388/meta-xros-vr-ar-os-development-canceled\">Meta canceled</a> the “XROS” project the team was working on (XR is a term used to refer to both augmented and virtual reality). After the reports came out, <a href=\"https://www.theverge.com/2020/8/25/21399752/oculus-connect-7-date-renamed-facebook-reality-labs-new-quest\">Reality Labs</a> Vice President Gabriel Aul tweeted that the company was “growing this team, not shrinking it,” and included a link to the Meta careers page. Aul also said that the company is “still working on a highly specialized OS for our devices.”</p><div class=\"c-float-right\"><aside id=\"Qo4PjS\"><q>A move from “a highly specialized OS” to “solutions that are hyper-tuned for each product line”</q></aside></div><p id=\"ImeVPc\">Meta is hoping to “speed up the development of solutions that are hyper-tuned for each product line” by “embedding more OS engineers directly into [its] AR and VR teams,” according to a statement emailed to <em>The Verge</em> on Friday by Meta spokesperson Sheeva Slovan. Without confirming the breakup, this suggests Meta’s current approach prioritizes each team’s OS customizations for its own projects, instead of a centralized team and new software platform.</p><p id=\"HnRUXa\">Some engineers from the XROS team are assigned to teams <a href=\"https://www.theverge.com/2021/8/25/22641894/facebook-project-aria-augmented-reality-ar-research-glasses-user-manual\">working on AR glasses</a>, Quest VR headsets, and other XR tech involving hand- and eye-tracking through computer vision, according to <em>The Information</em>. The report says that it isn’t clear where every employee from the XROS team will end up. </p><div class=\"c-float-right\"><aside id=\"cKbn0p\"><q>Meta wants employees to “move fast together”</q></aside></div><p id=\"kdKzzF\">This specific restructuring comes as Meta works on changing its image overall — the obvious example is <a href=\"https://www.theverge.com/2021/10/28/22745234/facebook-new-name-meta-metaverse-zuckerberg-rebrand\">its recent name change</a> to signify a focus on “<a href=\"https://www.theverge.com/22701104/metaverse-explained-fortnite-roblox-facebook-horizon\">the metaverse</a>” and plans for a virtual world that heavily involves VR and AR products. The company also <a href=\"https://twitter.com/alexeheath/status/1493656663366246401?s=21\">recently updated its values</a>, telling employees they should “move fast together” and “focus on long term impact.”</p><p id=\"HjTc27\">Currently, headsets like the Oculus Quest 2 use an operating system based on Android. At the moment it isn’t clear what future headsets like the <a href=\"https://www.theverge.com/2021/10/28/22749008/facebook-oculus-project-cambria-pro-vr-ar-headset\">upcoming “Project Cambria”</a> will use — but given what seems to be happening to the XROS team, it seems unlikely that we’ll see a brand-new OS unveiled with Meta’s <a href=\"https://www.theverge.com/2021/10/13/22724876/facebook-zuckerberg-vr-prototype-photos-research-redmond-metaverse\">next generation</a> of VR headsets. </p><p id=\"bB94qH\">Statement from Meta spokesperson Sheeva Slovan:</p><blockquote><p id=\"LIwuhP\">We are always evolving our team structures to help us bring great products to market quickly. By embedding more OS engineers directly into our AR and VR teams, we can speed up the development of solutions that are hyper-tuned for each product line. As we’ve said before, there are several technical directions we’re pursuing to build these and we remain committed to building highly specialized systems. We continue to invest and optimize to move fast so we can deliver against the aggressive goals we’ve set.</p></blockquote>",
  "image": "https://cdn.vox-cdn.com/thumbor/7_DEKXgLohyHzTf_PYfUHXUlRqE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22977157/acastro_211101_1777_meta_0003.jpg",
  "description": "From a centralized OS to \"hyper-tuned\" solutions",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}