{
  "title": "Meta is opening its first retail store next month",
  "url": "https://www.theverge.com/2022/4/25/23037875/meta-retail-store-burlingame-ray-ban-stories-portal-quest-hours-location",
  "date": "2022-04-25T15:00:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"A woman using a Meta Quest 2 headset (formerly the Oculus Quest 2)\" src=\"https://cdn.vox-cdn.com/thumbor/wUagdhIyzb7XURoOZaZoxpdq_H0=/0x0:2200x1467/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70790276/Meta_Store_Quest_2_Demo_1_scaled.0.jpeg\" />        <figcaption>Meta</figcaption>    </figure>  <p id=\"cjEaL9\">Meta is launching its first hardware retail store on its campus in Burlingame, California. The store, <a href=\"https://about.fb.com/news/2022/04/meta-retail-store/\">which opens May 9th</a>, will let visitors try out and buy Meta’s Portal videophones and Quest virtual reality headsets. They’ll also be able to demo <a href=\"https://www.theverge.com/2021/9/9/22662809/facebook-ray-ban-stories-camera-smart-glasses-hands-on\">the Ray-Ban Stories smart glasses</a> that debuted last year and get help ordering them online.</p><p id=\"SP1AFF\">Meta’s store will include a demo area for Portal where users can test its <a href=\"https://www.theverge.com/22732472/facebook-portal-go-10-inch-2021-review\">video calling features</a> with a store employee. There’s a space to test several Quest 2 demos, including <em>Beat Saber</em>, <em>GOLF+</em>, <em>Real VR Fishing</em>, and <em>Supernatural</em>, and visitors will take home a 30-second mixed reality clip showing them playing a game. They can also try on different styles of the Ray-Ban glasses, which capture and share video with built-in cameras, and test their capabilities before buying. Meta is also adding a “Shop” tab to its website, making it easier to find all its products in one place online.</p>  <figure class=\"e-image\">        <img alt=\"An image of the Meta Store from the entrance, featuring shelves of Quest and Portal devices\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YORmm4Z4hN68YX6H7UrSCzrHgSY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23414596/Entrance_scaled.JPG\">  </figure><p id=\"DXlDZt\">The move is a significant foray into hardware sales for Meta, following the footsteps of companies like Google, which <a href=\"https://www.theverge.com/2021/6/16/22535909/googles-first-retail-store-hardware\">opened its first retail establishment</a> last year after several more limited pop-up stores. Meta has previously <a href=\"https://www.theverge.com/2017/2/8/14550488/best-buy-oculus-rift-vr-demo-station-closure\">partnered with Best Buy</a> on demo stations for its VR headsets, and Ray-Ban Stories have appeared in the sunglasses company’s own stores. The new store opens another opportunity to sell people on still-unusual virtual and augmented reality (sometimes characterized as “metaverse”) tech, a <a href=\"https://www.theverge.com/23022611/meta-facebook-nazare-ar-glasses-roadmap-2024\">major area of focus</a> for the company.</p><p id=\"4UiJqK\">It’s also, however, a pretty limited one. The small 1,550-square-foot storefront is opening near Meta’s Reality Labs headquarters (at 322 Airport Boulevard in Burlingame) rather than a major metropolitan area like Google’s store in Manhattan. It will be open from 11:00AM to 6:00PM Monday through Friday, which isn’t exactly prime shopping hours. Meta store head Martin Gilliard says in a statement that the Burlingame location “gives us more opportunity to experiment and keep the customer experience core to our development,” lessons from which will “help define our future retail strategy.”</p><p id=\"iqlu6w\">Meta’s last big product release was last year, but the retail store seems likely to provide a staging ground for showing off future VR / AR projects as they develop, including more advanced mixed reality glasses and control systems. It also gives Meta an up-close look at how people will respond to this hardware — much of which raises significant privacy concerns — in a real-world setting.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/g2GQK9UEo5JdG0Io76zzcoQKFYI=/0x0:2200x1152/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23414585/Meta_Store_Quest_2_Demo_1_scaled.JPG",
  "description": "On the Meta campus in Burlingame, California.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}