{
  "title": "Meta is adding a ‘personal boundary’ to VR avatars to stop harassment",
  "url": "https://www.theverge.com/2022/2/4/22917722/meta-horizon-worlds-venues-metaverse-harassment-groping-personal-boundary-feature",
  "date": "2022-02-04T16:04:45.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4w9AJgCASTp48ClXRKb9grT6jUo=/61x0:720x439/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70471422/273246623_1080678522782326_9079771974877224143_n.0.png\" />    </figure>  <p id=\"xKL2Fp\">Meta is adding a “personal boundary” system to its Horizon virtual reality experiences, aiming to stop harassment in VR. The new feature is being turned on by default in the Horizon Worlds creation platform and the Horizon Venues live event service. It creates an invisible virtual barrier around avatars, preventing other people from getting too close — although you can apparently still stretch your arm out to give someone a fist-bump or high five.</p><p id=\"7FVCOh\">The boundary system builds on an existing feature that could make users’ hands disappear if they got too close to another avatar. <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=43993&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.oculus.com%2Fblog%2Fintroducing-a-personal-boundary-for-horizon-worlds-and-venues%2F\" rel=\"sponsored nofollow noopener\" target=\"_blank\">As described by Meta</a>, it gives everyone a two-foot radius of virtual personal space, creating the equivalent of four virtual feet between avatars. Meta spokesperson Kristina Milian confirmed that users can’t choose to disable their personal boundaries since the system is intended to establish standard norms for how people interact in VR. However, future changes could let people customize the size of the radius.</p><p id=\"yuQ4EQ\">If someone tries to walk or teleport within your personal space, their forward motion will stop. However, Milian says that you can still move past another avatar, so users can’t do things like use their bubbles to block entrances or trap people in virtual space.</p><p id=\"iYudMu\">Meta’s changes are rolling out two months after Horizon Worlds <a href=\"https://www.theverge.com/2021/12/9/22825139/meta-horizon-worlds-access-open-metaverse\">opened to the public</a> following a long period of beta testing. During that period, at least one beta user complained that her <a href=\"https://www.techdirt.com/articles/20211227/16032748188/grope-metas-space.shtml\">avatar had been groped</a> by a stranger. While the user mentioned eventually engaging the block feature to stop the harasser, Meta determined that she hadn’t taken full advantage of the available options and expressed a desire to make features like the block button “trivially easy and findable.”</p><p id=\"oGpGAm\">Personal space bubbles are a standard option on older VR social spaces like VRChat and Rec Room, although users have the ability to change their size or turn them off on those services. Some games like QuiVR — which was home to <a href=\"https://www.technologyreview.com/2021/12/16/1042516/the-metaverse-has-a-groping-problem/\">one of the first reported instances</a> of VR sexual harassment — have also implemented custom gestures that let you “push” an avatar away from you.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/TD02HAYiAOg8yA7LfmPYNRd7DJw=/0x16:780x424/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23218020/273246623_1080678522782326_9079771974877224143_n.png",
  "description": "A Horizon beta user complained of being groped in VR.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}