{
  "title": "Meta’s Quest 2 Super Bowl ad takes a retired animatronic dog into the metaverse",
  "url": "https://www.theverge.com/2022/2/12/22930776/metas-quest-2-super-bowl-metaverse-ad-animatronic-dog-virtual-reality",
  "date": "2022-02-12T22:57:58.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3ZgUzPjizhYRiLUZ1D1uLmkraLA=/110x0:1880x1180/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70502906/meta_super_bowl_ad_animatronics.0.png\" />        <figcaption>Image: Facebook</figcaption>    </figure>  <p id=\"LsOGCh\">Meta has debuted <a href=\"https://youtu.be/Z8lthAAjxZc\">its Quest 2 Super Bowl ad</a> ahead of the big game, and it’s hard to get a grasp on how exactly it’s supposed to promote the metaverse (via <a href=\"https://www.wsj.com/articles/metas-super-bowl-ad-leans-on-an-animatronic-dog-to-promote-metaverse-11644503400?mod=pls_whats_news_us_business_f\"><em>Wall Street Journal</em></a>). It evokes a strange mix of nostalgia — and the slight fear — associated with a childhood spent around unsettling animatronics, all while simultaneously giving off <em>Five Nights at Freddy’s</em> and <em>Black Mirror</em> vibes.</p><p id=\"IipDcz\">The commercial opens in a Chuck E. Cheese-esque environment — so cleverly called Questy’s — with a fuzzy animatronic dog, a pink six-armed creature, and two penguins performing Simple Mind’s “Don’t You (Forget About Me)” on stage at the arcade. Soon after, a moving crew drags the lifeless bodies of the animatronic band out of the building as the location shuts down for good.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jdt2WeZ4_an0W-XCD6FRCQ1UyTk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23238050/meta_super_bowl_trash_compactor.png\">      <cite>Image: Meta</cite>      <figcaption><em>The animatronic dog lays helplessly in a trash compactor.</em></figcaption>  </figure><p id=\"9D2qOn\">The dog (which falls directly on the line between cute and creepy) winds up staring out the window at a pawn shop, sans the rest of its animatronic crew, and takes on different roles as it's passed around among owners. After a brief appearance as a mini-golf course decoration, it’s seen getting flung out of the back of a pickup truck, and then laying helplessly inside of a trash compactor — until it’s miraculously pulled out just as the machine starts closing in on its head.</p><p id=\"19BI0r\">The same woman who pulled the dog out of the trash compactor puts the animatronic on display at a space center, fixing it in a stationary pose pointing towards the cafeteria. A young man trying out the center’s VR exhibit takes off his Quest 2 headset and somehow gets the idea to strap it on the animatronic dog. </p><p id=\"t5cmCe\">Well, here’s where it gets <em>Black Mirror</em>-y — the dog gets transported into Meta’s virtual reality, where he meets up with his old band members and is able to perform once again, a theme you might remember from the “<a href=\"https://www.theverge.com/2017/9/17/16324368/black-mirror-emmys-2017-netflix-writing-award-win\">San Junipero</a>” episode, which features a virtual world where the elderly and consciousnesses of dead people thrive.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2_vrXDoEifjuc_dkUBkigmfljW4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23238049/meta_super_bowl_animatronics_vr.png\">      <cite>Image: Meta</cite>      <figcaption><em>All four animatronic friends are reunited in virtual reality.</em></figcaption>  </figure><p id=\"H855xN\">In the second-to-last scene, “Don’t You (Forget About Me)” resumes playing, and the ad shows all four friends — each at new locations — happily dancing with Quest 2 headsets on, as the words “Old friends. New fun,” pop up on the screen. It ends with the animatronic dog, still outfitted with Quest 2, howling in the now-closed space center.</p><p id=\"JIGoSt\">Am I supposed to feel happy at the end of that commercial? The reality that the animatronic dog is likely to get his headset ripped off as soon as the space center opens has left me feeling empty inside — or maybe I’m just reading too much into it. This may be the reality that Meta wants to rebuild, but, if anything, it’s that depressing realization this ad draws attention to even more.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OrVjXOoFjzm8_sGqEZk52tMR0oU=/0x69:1990x1111/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23237960/meta_super_bowl_ad_animatronics.png",
  "description": "It’s kind of hard to see how it promotes the metaverse.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}