{
  "title": "Meta tells employees to stop discussing abortion at work",
  "url": "https://www.theverge.com/2022/5/19/23131714/meta-ban-abortion-discussion-at-work-facebook-workplace-roe-v-wade",
  "date": "2022-05-20T02:24:11.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"The Meta logo looks like the symbol for infinity.\" src=\"https://cdn.vox-cdn.com/thumbor/Vd-DS_VsqQzRM2H4N8k3FJUcKMQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70890384/DSCF7682.0.jpg\" />        <figcaption>The Meta sign outside the company’s headquarters in Menlo Park, California. | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"o2dkv8\">A Meta executive told employees on Thursday that they are prohibited from talking about abortion on Workplace, an internal version of Facebook, citing “an increased risk” that the company is seen as a “hostile work environment.”</p><p id=\"wvxP7Y\">The policy, which Meta put in place in 2019 but hasn’t been reported until now, prohibits employees from discussing “opinions or debates about abortion being right or wrong, availability or rights of abortion, and political, religious, and humanitarian views on the topic,” according to a section of the company’s internal “Respectful Communication Policy” seen by <em>The Verge</em>. Some employees have called on management to do away with the policy in the aftermath of a leaked Supreme Court draft opinion <a href=\"https://www.theverge.com/2022/5/5/23058316/roe-v-wade-repeal-future-of-abortion-pills-mifepristone-misoprostol\">that would overturn <em>Roe v. Wade</em></a>, arguing that the ban is at odds with employees being allowed to talk “respectfully” about issues like Black Lives Matter, immigration, and trans rights.</p><div class=\"c-float-right\"><aside id=\"kGHY7Y\"><q>Meta calls abortion a “unique topic” that can “leave people feeling like they’re being targeted”</q></aside></div><p id=\"eM3kvr\">During an all-hands meeting with employees Thursday, Meta’s VP of HR, Janelle Gale, said that abortion was “the most divisive and reported topic” by employees on Workplace. She said that “even if people are respectful, and they’re attempting to be respectful about their view on abortion, it can still leave people feeling like they’re being targeted based on their gender or religion,” according to a recording of her comments obtained by <em>The Verge</em>. “It’s the one unique topic that kind of trips that line on a protected class pretty much in every instance.”</p><p id=\"oM8Jbz\">A spokesperson for Meta didn’t have a comment for this story by press time.</p><p id=\"MJuvI8\">Most large companies have yet to clearly state their stance on abortion bans, though several have signaled their opposition. Amazon and Tesla have said they would <a href=\"https://www.theverge.com/2022/5/5/23058911/abortion-access-employers-amazon-supreme-court-roe\">cover some expenses</a> for pregnant employees who need to travel for an abortion, and Salesforce told employees in September that it <a href=\"https://www.theverge.com/2021/9/12/22669774/salesforce-relocate-employees-abortion-access-benioff-texas-sb8\">would assist with moving expenses</a> if they wanted to leave Texas due to its abortion ban. Lyft and Uber have promised to cover legal bills for drivers who are <a href=\"https://www.theverge.com/2022/4/30/23050662/uber-lyft-extend-legal-fee-coverage-drivers-sued-over-oklahoma-restrictive-abortion-law\">sued under state laws</a> for driving a person seeking an abortion. One of the strongest stances taken has been by Yelp CEO Jeremy Stoppelman, <a href=\"https://www.fastcompany.com/90749901/yelp-ceo-why-companies-need-to-take-a-stand-on-reproductive-rights\">who argued in an op-ed</a>  that “companies need to take a stand on reproductive rights.”</p><p id=\"YrqzZk\">After <a href=\"https://www.politico.com/news/2022/05/02/supreme-court-abortion-draft-opinion-00029473\"><em>Politico </em>published</a> the leaked Supreme Court draft opinion seeking to overturn abortion rights at a federal level, Meta’s number-two executive, Sheryl Sandberg, called abortion “one of our most fundamental rights” on her <a href=\"https://www.facebook.com/sheryl/posts/10166165694830177\">public Facebook page</a>. “Every woman, no matter where she lives, must be free to choose whether and when she becomes a mother,” she wrote. “Few things are more important to women’s health and equality.”</p><div class=\"c-float-left\"><aside id=\"NmnfcR\"><q>The policy has caused division among employees</q></aside></div><p id=\"7XQCKE\">But Meta proceeded to push back on discussion of abortion internally soon thereafter. The day after Sandberg’s public comments, one of Meta’s most senior executives, Naomi Gleit, wrote in an internal post seen by <em>The Verge</em> explaining why the company had placed restrictions around discussion of abortion. “At work, there are many sensitivities around this topic, which makes it difficult to discuss on Workplace,” Gleit wrote. She said that employees were only allowed to discuss abortion at work “with a trusted colleague in a private setting (e.g. live, chat, etc.)” and in a “listening session with a small group of up to 5 like-minded people to show solidarity.” She encouraged employees to use Meta’s social apps to share their views in their personal capacity, and that the company “will continue to offer our employees access to reproductive healthcare in the U.S. regardless of where they live.”</p><p id=\"zW5ljq\">The policy banning discussion of abortion has caused division among employees in recent weeks, with some supporting it and others sharing their frustration about having posts on the topic removed, according to screenshots of Workplace posts and comments seen by <em>The Verge</em>. During the all-hands meeting led by Sandberg, Gale, and other execs Thursday, several comments about the policy were posted by employees underneath the livestream and removed as the meeting progressed.</p><p id=\"wFF5Nb\">In an internal post earlier this month titled “Support &amp; Silence,” a female employee who has been at the company for 10 years wrote that the policy had led her to feel a “strong sense of silence and isolation on Workplace.” She wrote that an earlier version of her post had been taken down and that the new version had “much of the content removed.”</p><p id=\"lCMmxd\">“The same policy explicitly allows us to discuss similarly sensitive issues and movements including immigration, trans rights, climate change, Black Lives Matter, gun rights / gun control, and vaccination,” she wrote. “The argument about why our policy treats one issue quite differently than other sensitive issues feels flimsy and unconvincing to me. The entire process of dealing with the Respectful Communication policy, being told why my post is violating, and crafting this new post has felt dehumanizing and dystopian.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Kc8bQObUKvnZlK-9LT1Z9xxiZyU=/0x86:2040x1154/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22964096/DSCF7682.jpg",
  "description": "Meta says the topic can \"leave people feeling like they’re being targeted based on their gender or religion.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}