{
  "title": "Meta’s Quest hand tracking can now detect high-fives and clapping",
  "url": "https://www.theverge.com/2022/4/19/23031996/meta-quest-vr-ar-hand-tracking-api-presence-platform-update-gestures",
  "date": "2022-04-19T17:02:08.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"A virtual hand manipulating a cube\" src=\"https://cdn.vox-cdn.com/thumbor/S3cdlaV_w3AVc4Por4nITHXbLHU=/57x0:1122x710/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70767345/Screen_Shot_2022_04_19_at_12.53.22_PM.0.png\" />        <figcaption>Meta</figcaption>    </figure>  <p id=\"6tkZXm\">Meta is updating its mixed reality hand tracking system with support for more types of motion, including gestures like clapping. A new version of its Presence Platform API is launching for everyone after a limited preview with a few developers, promising more sophisticated and reliable interactions on the Meta (formerly Oculus) Quest headset.</p><p id=\"chyADj\">The Presence Platform update is designed to improve Quest hand tracking — which uses cameras mounted in the headset to replace the default hardware controllers — across the board. In addition to general reliability updates, it focuses on recognizing movement when part of your hand is blocked from the camera’s view. It’s now supposed to catch clapping, high-fives, crossed hands, and other gestures that involve occlusion. The thumbs-up motion, as well as more abstract interface interactions like pinching, grabbing, and poking, are supposed to be improved as well. Developers who have built custom gestures (punching a bag in a virtual reality boxing game, for instance) might see those get better, too.</p><div id=\"QlsGJ6\"><div ><iframe src=\"https://www.youtube.com/embed/frG4fM5Df_A?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"rhadLM\">Camera-based hand tracking isn’t necessarily Meta’s endgame for interactivity — although the press release briefly references using the Presence Platform’s system on “future devices” as well as the Quest. The company is <a href=\"https://www.theverge.com/23022611/meta-facebook-nazare-ar-glasses-roadmap-2024\">working on an augmented reality wristband</a> that reads neural activity from your arm, based on tech it acquired from the startup CTRL-Labs in 2019. It’s also <a href=\"https://www.theverge.com/2021/11/16/22782860/meta-facebook-reality-labs-soft-robotics-haptic-glove-prototype\">testing a haptic glove</a> that can produce tactile feedback in addition to capturing motion. But these systems are years down the road, while <a href=\"https://www.theverge.com/2020/5/18/21260554/oculus-quest-anniversary-hand-tracking-third-party-games-beat-saber-tracks\">camera-based hand tracking</a> doesn’t require anything except software updates for standard VR headset sensors. It’s one of the things that’s helped push the Quest from a purely VR-focused device to one that <a href=\"https://www.theverge.com/2021/10/28/22749567/facebook-presence-platform-oculus-quest-mixed-reality-api\">blends physical and virtual worlds</a> — even if it’s still not the primary way many people will interact with the platform.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CtN_9nG2z1MDHprSn7RxzV1FmwM=/0x47:1178x664/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23400559/Screen_Shot_2022_04_19_at_12.53.22_PM.png",
  "description": "The changes were tested with a small group of developers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}