{
  "title": "Meta’s social VR platform Horizon hits 300,000 users",
  "url": "https://www.theverge.com/2022/2/17/22939297/meta-social-vr-platform-horizon-300000-users",
  "date": "2022-02-17T23:00:45.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/38dtCjmLAHM7uG6MWL0N4fgxv_s=/63x0:738x450/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70523060/Horizon_Worlds.0.jpg\" />        <figcaption>A clubby experience in Horizon Worlds. | Image: Meta</figcaption>    </figure>  <p id=\"GdPYyf\">Facebook has bet its future on virtual reality and the metaverse, rebranding to Meta and spending billions a year to build hardware and software that extends beyond traditional social media. But the company has, at least so far, shared little with the public about how well its early bets are performing.</p><p id=\"qcppVy\">Meta’s highest-profile bet right now is a social VR platform for the Quest headset called Horizon Worlds. It was recently <a href=\"https://www.theverge.com/2022/2/12/22930776/metas-quest-2-super-bowl-metaverse-ad-animatronic-dog-virtual-reality\">featured in Meta’s Super Bowl ad</a>, and Zuckerberg called it “core to our metaverse vision” on the company’s most recent earnings call. During a virtual Meta all-hands earlier this week — <a href=\"https://twitter.com/alexeheath/status/1493656663366246401?s=21\">yes, the Metamates one</a> — the company’s chief product officer, Chris Cox, gave employees a previously unreported update on Horizon’s user growth. </p><div class=\"c-float-right\"><aside id=\"39pXc3\"><q>Since early December, its monthly user base has grown by a factor of 10x</q></aside></div><p id=\"76y6Wr\">He said that since Horizon Worlds was <a href=\"https://www.theverge.com/2021/12/9/22825139/meta-horizon-worlds-access-open-metaverse\">rolled out to all Quest users in the US and Canada</a> in early December, its monthly user base has grown by a factor of 10x to 300,000 people, according to an employee who heard the remark. Meta spokesperson Joe Osborne confirmed the stat and said it included users of Horizon Worlds and Horizon Venues, a separate app for attending live events in VR that uses the same avatars and basic mechanics. The number doesn’t include Horizon Workrooms, <a href=\"https://twitter.com/horizonworlds/status/1494007916990373895?s=21\">a VR conferencing experience</a> that relies on an invite system.</p><p id=\"jg8sja\">Before its December rollout, Horizon Worlds was in a private beta for creators to test its world-building tools. Similarly to how the gaming platform Roblox or Microsoft’s <em>Minecraft</em> works, Horizon Worlds lets people build custom environments to hang out and play games in as legless avatars. Meta announced this week that 10,000 separate worlds have been built in Horizon Worlds to date, and its private Facebook group for creators now numbers over 20,000 members.</p><div id=\"cenWGb\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It’s time. 10,000 worlds have already been created. Drop in and play, build or just hang out. The possibilities are endless. <a href=\"https://t.co/VWc83PkuDV\">pic.twitter.com/VWc83PkuDV</a></p>— Horizon Worlds (@HorizonWorlds) <a href=\"https://twitter.com/HorizonWorlds/status/1494007916990373895?ref_src=twsrc%5Etfw\">February 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"pDPnvE\">Given that it has only been a few months since Horizon Worlds was made widely available, it’s too early to tell if the platform’s rapid growth will continue or whether it will be able to retain users over time. Monthly users for social products are always higher than daily users, which Cox didn't disclose to employees. And a <a href=\"https://techcrunch.com/2022/01/06/meta-had-a-good-holiday-as-its-oculus-vr-companion-app-gained-2m-downloads-since-christmas/\">holiday season boost in sales</a> for the Quest headset certainly helped drive interest in people trying Horizon.</p><p id=\"EFprQn\">Meta still hasn’t disclosed how many Quest headsets it has sold to date, which makes it hard to gauge Horizon’s success relative to the underlying hardware platform it runs on. But several third-party estimates peg sales at over 10 million for the Quest. Zuckerberg recently said that Meta would release a version of Horizon for mobile phones later this year to “bring early metaverse experiences to more surfaces beyond VR.”</p><p id=\"UhwGiS\">“So while the deepest and most immersive experiences are going to be in virtual reality, you’re also going to be able to access the worlds from your Facebook or Instagram apps as well, and probably more over time,” the CEO said on Meta’s last earnings call. Bringing Horizon to mobile would position it as even more of a competitor to Rec Room, <a href=\"https://techcrunch.com/2021/12/20/rec-room-raises-145m-at-a-3-5b-valuation-for-its-user-generated-immersive-gaming-platform/\">a well-funded, social gaming app</a> with 37 million monthly users across gaming consoles, mobile phones, and VR.</p><p id=\"gP2i9o\">Even though Horizon Worlds doesn’t make money for Meta yet, the pressure is on for it to be successful, especially given how the company’s stock has tanked as investors question its expensive metaverse push. </p><p id=\"LXo3fs\">Beyond solving the <a href=\"https://www.buzzfeednews.com/article/emilybakerwhite/meta-facebook-horizon-vr-content-rules-test\">problems with content moderation</a> and <a href=\"https://www.washingtonpost.com/technology/2022/02/07/facebook-metaverse-horizon-worlds-kids-safety/\">underage users in VR</a>, Meta has to make Horizon reliable enough for millions to use. Lots of people were unable to join a <a href=\"https://twitter.com/kentbye/status/1493092806222516224?s=21\">recent <em>Foo Fighters </em>concert held in Venues</a> after the Super Bowl, and Horizon has yet to introduce ways for creators to make money. But if its early user growth is any indicator, Horizon has a shot at being big.</p><p id=\"iDhaTB\"></p><p id=\"PsZUx3\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RzPmFV_sVdsuObwXkVlPq98Kj-Q=/0x16:800x435/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23252569/Horizon_Worlds.jpg",
  "description": "People are flocking to try Facebook’s early bet on the metaverse.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}