{
  "title": "Meta is working on a web version of its Horizon Worlds metaverse platform",
  "url": "https://www.theverge.com/2022/4/14/23025899/meta-horizon-worlds-web-version-metaverse-platform",
  "date": "2022-04-14T22:15:29.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/d8uyn3Bi0ZcqwuZQ5BpbuwJTL8Q=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70750741/acastro_211101_1777_meta_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ogQKCe\">Meta is planning to bring its Horizon Worlds social metaverse platform to the web, Meta CTO Andrew “Boz” Bosworth said <a href=\"https://twitter.com/boztank/status/1514666741183311872\">in a tweet on Thursday</a>. Being available on the web would mark a major expansion for the platform, which is currently only available on its Quest VR headsets.</p><p id=\"2Px3Gn\">A web version isn’t the only one in the works — this week, Meta VP of Horizon Vivek Sharma <a href=\"https://www.theverge.com/2022/4/11/23020684/meta-horizon-worlds-test-creators-sell-virtual-items-monetization\">told <em>The Verge</em></a><em> </em>that it’s working on bringing Horizon to mobile phones later this year and is in “early discussions” about bringing it to game consoles. However, it’s still unclear exactly when Horizon might expand to the web, and Meta spokesperson Iska Saric said there were “no timing details to share at this time” when we asked.</p><p id=\"bFOIIq\">Boz’s tweet was included <a href=\"https://twitter.com/boztank/status/1514666410043064322\">in a thread</a> defending Horizon’s newly-announced fee structure for creators, which has come under some scrutiny. On Tuesday, Meta revealed that for Horizon purchases, it would take a 25 percent cut of the percentage left <em>after</em> any platform fees.</p><p id=\"S9UPS4\">For the Horizon web app, this means that Meta would only take 25 percent, as Boz pointed out. But for platforms with a 30 percent fee, like Meta’s own Quest Store, it would take 25 percent of 70 percent. That means that for goods sold in Horizon on a Quest VR device, Meta will take an eye-popping 47.5 percent of each transaction.</p><div id=\"9KF9Ei\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">When Horizon’s web version launches, the Horizon platform fee will only be 25%—a much lower rate compared to other similar world-building platforms.</p>— Boz (@boztank) <a href=\"https://twitter.com/boztank/status/1514666741183311872?ref_src=twsrc%5Etfw\">April 14, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"NuAFYL\">Boz claims that rate is lower than some other “world-building platforms” — a shot that seems to be aimed in part at Roblox, which has also come <a href=\"https://www.youtube.com/watch?v=_gXlauRB1EQ\">under criticism</a> for how it pays developers. In a chart showing “the estimated utilization of each dollar spent on Roblox,” <a href=\"https://developer.roblox.com/en-us/articles/developer-economics#cash-payout-structure\">Roblox indicates</a> that it pays developers just 28.1 percent of each dollar, meaning Meta’s Horizon cut, even from purchases on Quest headsets, seems to be lower than what Roblox takes on its platform. And in expanding from VR to platforms like mobile and the web, Meta will be taking Roblox head-on, so this might not be the last time we see Meta make some pointed words in Roblox’s direction.</p><p id=\"rgAJcH\">Meta has also <a href=\"https://www.theverge.com/2020/8/14/21369169/facebook-paid-live-events-ios-android-apple-app-store-fees-fortnite-epic\">often criticized</a> Apple for taking a 30 percent cut of many App Store transactions — Boz did so <a href=\"https://twitter.com/boztank/status/1514666410043064322\">in his thread on Thursday as well</a> — and Apple had some of its own sharp language for Meta. “Meta has repeatedly taken aim at Apple for charging developers a 30% commission for in-app purchases in the App Store — and have used small businesses and creators as a scapegoat at every turn,” Apple spokesperson Fred Sainz said to <a href=\"https://www.marketwatch.com/story/facebook-parent-meta-set-to-take-nearly-50-cut-from-virtual-sales-within-its-metaverse-11649885375\"><em>MarketWatch</em></a>. “Now — Meta seeks to charge those same creators significantly more than any other platform. [Meta’s] announcement lays bare Meta’s hypocrisy. It goes to show that while they seek to use Apple’s platform for free, they happily take from the creators and small businesses that use their own.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jTeBaUlQTE8jROTY0IFCLJ8mGVw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22977155/acastro_211101_1777_meta_0001.jpg",
  "description": "There are no details on when, though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}