{
  "title": "Meta will let Horizon creators sell virtual items",
  "url": "https://www.theverge.com/2022/4/11/23020684/meta-horizon-worlds-test-creators-sell-virtual-items-monetization",
  "date": "2022-04-11T22:00:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/g4sRuBQyrnjB4ap4RNxpx1lA1xg=/0x27:799x560/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70737826/273679953_1143087219766144_8853510490766117219_n.0.jpeg\" />        <figcaption><em>Horizon Worlds is testing some monetization options.</em> | Image: Meta</figcaption>    </figure>  <p id=\"oIpOPi\">Meta is testing new features to let creators make money within Horizon Worlds, the company’s social metaverse platform for Quest VR headsets that is soon coming to mobile phones and possibly game consoles.</p><p id=\"23PGik\">Most notably, a “handful” of Horizon creators will be able to sell virtual items and effects in the worlds they create for others to explore. The idea is that creators can sell everything from access to a VIP section of their world to virtual items like jewelry or a special basketball, according to Meaghan Fitzgerald, the product marketing director for Horizon. Participants in the US will also be able to earn money from a $10 million creator fund Meta recently set up to reward creators with the most engaging worlds.</p><p id=\"OU2ZLR\">With this test of “in-world purchases,” Meta is following in the footsteps of other 3D social platforms like Roblox and Rec Room, which both <a href=\"https://developer.roblox.com/en-us/articles/How-to-Make-Shirts-and-Pants-for-Roblox-Characters\">let</a> <a href=\"https://www.roadtovr.com/rec-room-sell-items-tokens-economy/\">creators</a> sell items that they make. Roblox has built a <a href=\"https://www.theverge.com/2020/11/19/21578491/roblox-ipo-announced-dau-increase-pandemic\">huge business</a> from this model, while Rec Room is growing quickly and prioritizing creator monetization as well.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/E-mlxjCW8TvQHPhD5Qz92gpAoes=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382460/IWP_1920x1080.png\">      <cite>Image: Meta</cite>      <figcaption><em>An in-world purchase notification.</em></figcaption>  </figure><p id=\"nlZnRR\">Meta will be taking a cut of what creators sell, though exactly what that take can be is a bit complex. For Horizon purchases, Meta is taking a 25 percent cut of the percentage that’s left after a platform fee. For platforms with a 30 percent fee, like Meta’s own Quest Store for VR titles, the creator will be left with a little over half of the sale price (the math there being that Meta is taking 25 percent of 70 percent).</p><div class=\"c-float-right\"><aside id=\"QtcX7l\"><q>“We think it’s a pretty competitive rate in the market.”</q></aside></div><p id=\"P4WvfZ\">“We think it’s a pretty competitive rate in the market,” Vivek Sharma, Meta’s VP of Horizon, tells <em>The Verge</em>, adding that “We believe in the other platforms being able to have their share.” (Even still, Meta has repeatedly called out Apple’s 30 percent take rate as being too aggressive for the iPhone ecosystem and intentionally lowered its rate on mobile for certain in-app purchases.)</p><p id=\"wGC1sG\">Horizon currently doesn’t have advertising beyond a <a href=\"https://www.thedrum.com/news/2022/03/30/wendy-s-unveils-wendyverse-within-meta-s-horizon-worlds\">recent Wendy’s-themed world</a> cringely referred to as “Wendyverse.” While the focus is on monetization for creators now, ads “may be an area we want to explore in the future,” says Fitzgerald.</p><p id=\"CgCNhY\">Meta is also rolling out a “goal-oriented bonus program” to encourage creators to use its tools and build out their worlds. These bonuses will not be subject to fees and will be paid in full. They are determined largely based on the engagement a creator’s world receives, according to Sharma.</p><p id=\"4xKavL\">Creators using in-world purchases and taking creator bonuses will be required to abide by the company’s VR conduct policy and prohibited content policy for Horizon Worlds. Fitzgerald says that creators who don’t follow those rules will be removed from the program.</p><p id=\"EB5Hac\"><em>The Verge</em> reported in February that Horizon Worlds <a href=\"https://www.theverge.com/2022/2/17/22939297/meta-social-vr-platform-horizon-300000-users\">hit 300,000 monthly users</a> in VR during its first few months of availability, and the company has publicly announced that <a href=\"https://twitter.com/HorizonWorlds/status/1494007916990373895\">10,000 worlds had been created</a>. Meta didn’t have an update to share on usage numbers, but Sharma did touch on plans for expansion. The company is planning to bring Horizon Worlds to mobile phones later this year and is in “early discussions” about being on game consoles, Sharma says.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FWGcyiX-UdzLeHN11ra5sMjD_bE=/0x84:799x502/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382451/273679953_1143087219766144_8853510490766117219_n.jpeg",
  "description": "Meta is also opening up a bonus program for creators.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}