{
  "title": "Mexico’s cultural appropriation ban is off to a messy start",
  "url": "https://www.theverge.com/22924327/mexico-cultural-appropriation-law-indigenous-and-afro-mexican-communities",
  "date": "2022-02-12T14:00:00.000Z",
  "author": "Chantal Flores",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/SQrs292y1rOAE1y1lUUaeYJbCF8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70501606/ClaudiaCAkole_TheVerge_MIW3_MexicoCulturalAppropriationLaw_01v02_RGB300HD.0.jpg\" />        <figcaption>Illustration by Claudia Chinyere Akole</figcaption>    </figure>  <p>A law meant to protect Indigenous art might just be lip service</p> <p class=\"p--has-dropcap p-large-text\" id=\"imVdzC\">The first embroidery stitch María Méndez Rodríguez learned at the age of 7 was the chain stitch. It’s the same one that, years later, she would teach to her seven children. At 42, Méndez has mastered advanced stitches like the closed buttonhole and rococo. She’s now diving back into the drawing process, trying to evolve from the traditional motifs of flowers and leaves she embroiders on blouses to better reflect the flora in her community.</p><p id=\"iDmrBZ\">Like many of the Tzeltales women in the community of Aguacatenango, in the southern Mexican state of Chiapas, Méndez spends hours every week embroidering a single blouse. Back pain, finger pain, and eyestrain are common. Despite the long hours and creative details that their designs entail, the creations of Méndez and other artists in the community often go underappreciated. A small blouse can take between 30 to 40 hours to make and might sell for as low as 200 pesos (less than $10 USD). For many Indigenous women, their textiles are the main source of income. </p><p id=\"FgGCwB\">While sales are slow for Méndez and others in her community, Indigenous patterns have exploded in popularity elsewhere: major companies like Zara, Anthropologie, Carolina Herrera, and Mango have incorporated similar designs into their clothing under the pretext of inspiration. Fashion <a href=\"https://www.reuters.com/world/americas/mexico-accuses-zara-anthropologie-patowl-cultural-appropriation-2021-05-30/\">houses</a> have <a href=\"https://wwd.com/fashion-news/fashion-scoops/zara-pulls-mexican-clutch-amid-claims-of-cultural-appropriation-1203671818/\">profited</a> without acknowledging the origin of the designs or compensating communities.  </p><div class=\"c-float-right c-float-hang\"><aside id=\"thmCWu\"><q>“It becomes very complicated because the instruments to implement it are not explained”</q></aside></div><p id=\"VAwt0N\">But now, Mexico’s Indigenous and Afro-Mexican communities are being sold a solution — or, at least, something that looks like one. To fight back against the plagiarism and dispossession of Indigenous art, Mexico has approved a law meant to protect and safeguard the cultural heritage of Indigenous and Afro-Mexican peoples and communities. It recognizes the collective right to intellectual property of these communities, calls for the creation of a National Registry of Cultural Heritage, and allows the government to prosecute theft of a cultural work. On the surface, it’s a bold step toward dealing with cultural appropriation and remedying some of the ways these communities continue to be marginalized.</p><p id=\"5xFIef\">Whether the law actually works is another question. Indigenous defenders and legal experts have raised concerns about implementation of the law — the Federal Law for the Protection of the Cultural Heritage of Indigenous and Afro-Mexican Peoples and Communities — and whether Indigenous and Afro-Mexican peoples were able to actively participate in its crafting. </p><p id=\"tsVQOn\">Legal experts have criticized the law’s broad and vague provisions on ownership, coupled with the fact that it doesn’t specify how the compensation for theft will be distributed. Intellectual property lawyer José Dolores González says that the law seems very ambitious, but it fails to clarify how it will be anchored in practice.  </p><p id=\"WPZvCy\">“For example, every Mexican has the right to a house, every Mexican has the right to a decent job,” explains González. “These rights, in their content, in their human spirit, are very good. But in the daily practice of the law it becomes very complicated because the instruments to implement it are not explained.”</p><div><aside id=\"agl6sH\"><q>Cultural works are continually being recreated and revised</q></aside></div><p id=\"ktYL4Q\">Mexico’s law, which came into effect last month, grants Indigenous and Afro-Mexican communities the authority to grant temporary licenses to companies to use their designs and get paid for it. It’s not clear, however, who in the community can give this authorization. Likewise, the law says that any contracts or agreements made by any member individually will be null.</p><p id=\"cdsRPN\">“It says that the community must authorize, but who is the community? And that the people have to give authorization; who is the people? You get stuck here,” adds González. “Who are the people? Five people? Twenty people? The oldest person in town? One thousand people? The ejido commissioner?”</p><p id=\"c8NWCC\">In addition to the challenges of determining who represents the communities, there is the problem of using the term “cultural heritage” to define what is being protected. Patricia Basurto, an academic at the Institute of Legal Research at the National Autonomous University of Mexico, warns that the law could generate social conflicts since several communities can claim the use of the same cultural heritage item.</p><p id=\"YXq2j5\">Establishing the origin of a cultural expression is complex since they are passed down from generation to generation, and are constantly being re-created and revised within the communities. Méndez, for instance, has spent the last two years innovating and creating new designs, inspired by local birds and fruits, with the help of one of her sons. “Each artisan puts an idea into it … even if it’s the same stitches, but maybe it could be a different drawing or different colors,” says Méndez.</p><div class=\"c-float-left c-float-hang\"><aside id=\"BxDVWH\"><q>“The public domain, as it is, it’s the back door for any company to avoid jail”</q></aside></div><p id=\"X0m4Dw\">The law establishes penalties for the reproduction and commercialization of Indigenous and Afro-Mexican cultural expressions without approval from the community. The government can ban the sale of the designs, and prosecute, through the attorney general’s office, national and foreign companies that breach agreements or copy cultural heritage items. Penalties range from up to 20 years in prison and fines of up to 4 million pesos (around $200,000 USD). </p><p id=\"AATMxO\">The attorney’s general office will receive the fine, but it’s unclear how it will be transferred to the communities and who will manage the money. A section of the law stipulates that in cases where there’s a dispute, government bodies focused on culture and Indigenous communities will determine the resolution. But that answer worries Basurto and González, who warn that it threatens the right to autonomy and self-determination of Indigenous peoples. </p><p id=\"9iPwxP\">In Mexico, the majority of Indigenous iconography is so old it has fallen into the public domain, and thus anyone can use them without having to seek the consent of the creators. That poses yet another problem for communities looking for protections under the law.</p><p id=\"sFPaEC\">“This law would have to clarify what is going to happen with work that has fallen into the public domain, and what will happen with the Indigenous work that is in the domain of individuals,” adds González. “The public domain, as it is, it’s the back door for any company to avoid jail.”</p><div><aside id=\"P5zvmy\"><q>Major fashion retailers have repeatedly been accused of appropriating Indigenous designs</q></aside></div><p id=\"uSqgXF\">Social media has amplified concerns over the appropriation of Indigenous designs in recent years. In 2018, <a href=\"https://www.eldiario.es/desalambre/plagio-zara-comunidad-indigena-mexico_1_1930303.html\">Zara</a>, the Spanish fast-fashion retailer, sold a blouse with a strikingly similar design to an embroidery used by the women of Aguacatenango. Méndez and other artisans found out when they were contacted by Impacto, an organization that supports Indigenous artisans and their work. To this day, the artists have received neither a response nor any compensation. Inditex, which owns Zara, did not respond to <em>The Verge</em>’s request for comment.</p><p id=\"sT0OaK\">The Mixe people of Santa María Tlahuitoltepec, in the southern state of Oaxaca, had a similar experience in 2015 when they <a href=\"https://www.theguardian.com/global-development-professionals-network/2015/jun/17/mexican-mixe-blouse-isabel-marant\">accused</a> Parisian designer Isabel Marant of plagiarizing iconography distinctive to their blouse. In 2020, Marant again was accused, this time by the Mexican government, of appropriating a pattern unique to the Purépecha community in Michoacán state. Marant only responded with an apology, saying she wanted to pay tribute to the original designs.</p><p id=\"WaBXUM\">“The saddest thing is that each garment takes weeks,” says Méndez. “Perhaps a brand made it with a machine and then they are better paid. And we who work on that embroidery daily are underpaid.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"90rTgw\"><q>“We want this benefit to be extended to all communities”</q></aside></div><p id=\"kPVuTV\">Andrea Bonifaz, project coordinator at Impacto, worries that the new law could become an exclusive tool for certain groups, such as artisanal groups that are better positioned or have previously participated in government projects. As an organization, Impacto has been following the development of the law, but Bonifaz says they have not seen the inclusion of Indigenous communities in crafting it.</p><p id=\"muJVkG\">“We want this benefit to be extended to all communities, for a woman who works in the mountains of Chiapas or in the mountains of Oaxaca to have access to this information and make use of it without being subjected to bureaucratic processes that also sometimes hinder more than they could help,” explains Bonifaz. </p><p id=\"8GXTSq\">There are nearly 17 million Indigenous people in Mexico, representing around 15 percent of the total population, and over 2.5 million Afro-Mexicans. At least 68 Indigenous languages, and over 350 variations of them, are spoken. That makes the context surrounding Indigenous communities in Mexico complex, to put it lightly. And at times, it has been the Mexican state that profited from the Indigenous and Afro-Mexican aesthetic repertoire — textiles, ceramics, dances, and more — through international fairs and museum exhibitions, says Ariadna Solis, art historian and PhD candidate at UNAM. The conversations and alliances that the government is seeking are with the brands and not with the communities, making the law even more hypocritical, Solis says.</p><p id=\"4R8azI\">“Those who have promoted all these policies and commercial interests at a global level have been alien to the communities and their interests,” Solis says. It’s a problem that’s been consistent over time.</p><div class=\"c-float-left c-float-hang\"><aside id=\"INslre\"><q>“When we use these textiles, we are marked by a whole colonial history of violence”</q></aside></div><p id=\"lEZqib\">This new law was also created outside of the communities. For Basurto, it’s problematic that the government didn’t fully engage with Indigenous and Afro-Mexican communities during its crafting. Instead, Mexico’s culture ministry organized an Indigenous <a href=\"https://original.cultura.gob.mx/wp-content/uploads/2021/11/Presentacion-1.pdf\">fashion fair</a> at the Los Pinos former presidential residence in Mexico City that was criticized for being more of a public relations stunt than an attempt to listen to the communities the law was theoretically being crafted to help.</p><p id=\"O8i2Uu\">“They have wanted to support this law by making a number of forums, in fact, before the Senate approved it they created that notorious event at Los Pinos,” says Basurto. “It’s a way in which they are legitimizing, or want to give that legitimacy. The fact that some artisans have been given the use of their voice does not mean that it has that social validity that is required.” </p><p id=\"8axYYI\">Mexico’s identity was built in part through the erasure of Indigenous languages and the appropriation of Indigenous culture, but Indigenous and Afro-Mexican peoples and communities remain systematically oppressed and excluded. It was only recently, in 2019, that the term “Afro-Mexican” was added to the constitution, and poverty often prevents Indigenous women from having access to the same health and well-being measures as non-Indigenous women. Thus, it’s harder for women like Méndez to have the means to medically treat their back and finger pain.  </p><p id=\"AYaa10\">Solis explains that Indigenous women, especially when wearing traditional textiles, become highly visible in cities, like Mexico City, which leads to them becoming a target of racism. It is easier, says Solís, for a white woman to wear a waisted cotton blouse “inspired” by these communities’ colorful embroidery, than a heavy, expensive huipil (a traditional loose-fitting tunic worn by Indigenous women), which does not mark the female figure and is hard to wash.</p><p class=\"c-end-para\" id=\"eN2V23\">“When we use these textiles, we are marked by a whole colonial history of violence,” says Solis. “White women add this exotic, colorful part of their lives one day, and by taking off that garment, or even having it on, they never recognize all the degrees of violence that racialized women experience every day.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MyJ_-H2YLgopBot2UJrJL_OsyG4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229474/ClaudiaCAkole_TheVerge_MIW3_MexicoCulturalAppropriationLaw_01v02_RGB300HD.jpg",
  "description": "\"It becomes very complicated because the instruments to implement it are not explained.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}