{
  "title": "MGM is now part of Amazon",
  "url": "https://www.theverge.com/2022/3/17/22979800/amazon-mgm-merger-completed-prime-studios",
  "date": "2022-03-17T17:58:33.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"MGM Logo\" src=\"https://cdn.vox-cdn.com/thumbor/Q3pZ-jnNorOf0ZfTQz289y_iaXg=/0x43:1024x726/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70635328/mgm-logo.0.jpeg\" />        <figcaption>Image: Metro Goldwyn Mayer</figcaption>    </figure>  <p id=\"1YrdIi\">Amazon’s <a href=\"https://www.aboutamazon.com/news/entertainment/mgm-joins-prime-video-and-amazon-studios\">purchase of MGM for $8.45 billion is complete</a>, without a public response from the FTC on whether or not it will challenge the deal. Reports have suggested for months <a href=\"https://www.theverge.com/2021/7/9/22570797/ftc-amazon-mgm-investigation-probe-lina-khan\">that the FTC was considering a challenge</a>, and <a href=\"https://www.wsj.com/articles/amazon-moves-to-force-ftc-antitrust-decision-on-mgm-deal-11646341124\"><em>The Wall Street Journal</em></a> noted earlier this month that Amazon certified it had given the FTC all necessary information, setting a mid-month deadline that it would close the deal, with or without a response from the agency and its new leader, Lina Khan.</p><p id=\"v9JsQD\">After initially declining to comment on the deal’s closure, the FTC did send a statement to <em>The Verge</em>. The FTC’s office of public affairs director, Lindsay Kryzak, says “The FTC does not comment on any particular matters. However, we reiterate that the Commission does not approve transactions and may challenge a deal at any time if it determines that it violates the law. Additionally, this summer the FTC announced that it will send pre-consummation warning letters in connection with deals it cannot fully investigate within the timelines established by the HSR Act. These letters alert merging parties that their transactions remain under investigation, and warn that consummation occurs at their own risk.”</p><p id=\"zp0tlG\">The FTC did not comment on whether or not Amazon has received such a letter.</p><p id=\"9zNCrV\">Earlier this week, the European Union’s antitrust commission <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_1762\">gave Amazon’s purchase the green light</a>, noting the “transaction would raise no competition concerns,” as the “overlaps” between both companies are “limited.” Amazon seems to have taken that as approval enough and has closed the deal nearly a year after <a href=\"https://www.theverge.com/2021/5/26/22441644/amazon-mgm-acquisition-prime-video-subscription-service-james-bond\">both companies first signed off on it</a>.</p><div class=\"c-float-right\"><div id=\"KT0Abg\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">So excited to share that MGM is now part of Prime Video and Amazon Studios<a href=\"https://t.co/M3eR5C0kjJ\">https://t.co/M3eR5C0kjJ</a></p>— MGM Studios (@mgmstudios) <a href=\"https://twitter.com/mgmstudios/status/1504446010264723460?ref_src=twsrc%5Etfw\">March 17, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"jvJnrP\">Amazon’s landmark acquisition of the entertainment giant behind <em>James Bond</em>, <em>Rocky</em>, <em>The Addams Family</em>, <em>The Handmaid’s Tale</em>, and a host of other iconic shows and movies should help bolster Amazon’s existing Prime Video library. Amazon senior vice president Mike Hopkins said in a statement that “We welcome MGM employees, creators, and talent to Prime Video and Amazon Studios, and we look forward to working together to create even more opportunities to deliver quality storytelling to our customers.”</p><p id=\"BxY0s6\">The addition of MGM’s massive collection — not to mention the possibility for more originals — may help Amazon’s streaming service get an edge on Netflix, HBO Max, and Disney’s family of services. As it stands, Prime subscribers pay a (<a href=\"https://www.theverge.com/2022/2/17/22939115/amazon-prime-price-increase-annual-monthly\">newly increased</a>) fee of $139 / year fee to gain access to the over <a href=\"https://www.justwatch.com/us/provider/amazon-prime-video\">26,000 movies and 2,700 series</a> available on Prime Video, along with other perks like free two-day shipping on any purchases from the site.</p><p id=\"T3p0j4\">This news comes as other media behemoths are looking to shake things up in the streaming industry. Last year, AT&amp;T announced that it’s <a href=\"https://www.theverge.com/2021/5/17/22439964/at-t-warnermedia-discovery-merger-spin-off\">merging WarnerMedia with Discovery</a> in a move that encompasses shows from major networks including HBO, CNN, Cartoon Network, HGTV, TLC, Food Network, and more. The merger <a href=\"https://www.theverge.com/2022/2/9/22925327/discovery-warnermedia-att-merger-antitrust-clearance-ftc\">just got approved by the US government in February</a>, and <a href=\"https://www.theverge.com/2022/3/14/22976876/hbo-max-discovery-plus-merge-app-confirmed\">HBO Max and Discovery Plus will be combined into one app</a> as a result.</p><p id=\"Emo989\"><em><strong>Update March 17th, 1:57PM ET: </strong></em><em>Added statement from the FTC.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yij3Vb_LEUahhVudAmktT6SPzZc=/0x116:1024x652/fit-in/1200x630/cdn.vox-cdn.com/assets/1062283/mgm-logo.jpeg",
  "description": "Amazon’s $8.45 billion deal to buy MGM is done.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}