{
  "title": "Microsoft reportedly wants to bring ads to free-to-play Xbox games",
  "url": "https://www.theverge.com/2022/4/16/23027934/microsoft-report-ads-free-to-play-xbox-games",
  "date": "2022-04-16T15:27:12.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"The Xbox logo (a white sphere with an X through it) against a dark green background.\" src=\"https://cdn.vox-cdn.com/thumbor/9SCj245c8-QY8ps2XclZkAfgiRU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70757091/acastro_190530_1777_xbox_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1G2jxH\">Microsoft is reportedly working on a program that will let brands showcase advertisements within free-to-play Xbox games, according to a report from <a href=\"https://www.businessinsider.com/microsoft-is-building-an-advertising-program-for-xbox-2022-4\"><em>Insider</em></a>. Sources familiar with the situation told <em>Insider</em> that the ads wouldn’t disrupt gameplay and may appear on a billboard in a racing game, for example.</p><p id=\"Geqq8Z\">It’s not immediately clear how else Microsoft plans on implementing ads, such as having them show up as avatar skins or as videos inside game lobbies. But as <em>Insider</em> notes, Microsoft is reportedly concerned that the ads could “irritate” players, and is planning on building a “private marketplace” to let only select brands into the program.</p><div class=\"c-float-right\"><aside id=\"73jgRd\"><q>Microsoft reportedly doesn’t intend to take a cut of the ad revenue</q></aside></div><p id=\"oxr3Pg\">Sources also told <em>Insider</em> that Microsoft doesn’t intend to take a cut of ad revenue, and will instead allow the game developer and advertising company to share the funds. It’s possible that Microsoft may just want to use this as a way to attract more developers of free-to-play games to the platform, as this would open up another stream of revenue outside of microtransactions.</p><p id=\"ZsaDHA\">According to <em>Insider</em>, Microsoft won’t use the data it collects from Bing and other services for targeted ads on Xbox. The outlet also doesn’t know whether Microsoft has floated the idea to advertisers yet, but its sources claim ads will start appearing on Xbox as soon as the third quarter of this year.</p><p id=\"PuZFuE\">“We are always looking for ways to improve the experience for players and developers but we don’t have anything further to share,” a Microsoft spokesperson said in a statement to <em>Insider</em>. Microsoft didn’t immediately respond to <em>The Verge</em>’s request for comment.</p><p id=\"ypBNiE\">In-game advertisements on console games aren’t a new concept — game companies experimented with them in paid games quite a bit in the mid to late 2000s. Around this time, <a href=\"https://www.gamespot.com/articles/ea-signs-up-for-more-in-game-ads/1100-6175614/\">EA Games</a> <a href=\"https://www.gamesindustry.biz/articles/ea-signs-massive-in-game-ad-deal\">partnered with</a> the (now-defunct) Microsoft-owned advertising company Massive, letting companies place ads in <em>Madden NFL</em>, <em>Skate</em>, <em>NHL</em>, and <em>NASCAR </em>franchises, as well as in <em>Burnout Paradise</em>. If you played any of these games at the time, you might remember seeing <a href=\"https://www.nbcnews.com/id/wbna27184857\">digital Obama ads</a> plastered in digital sporting arenas or on billboards. <em>Saints Row 2 </em>even had real-life ads on billboards, like <a href=\"https://www.flickr.com/photos/pvera/3643032326/in/photostream/\">this one for Netflix</a>.</p><p id=\"XREsxn\">In-game ads for real-life products might have been a novelty back in the day, but with some <a href=\"https://www.theverge.com/2020/9/16/21440542/ps5-games-price-69-playstation-5-sony\">next-gen games costing close to $70</a>, players expect an ad-free experience — this is likely the reason why Microsoft is reportedly rolling out the initiative for free-to-play games only. More recently, <a href=\"https://www.theverge.com/2020/9/6/21425170/ea-apologizes-ads-ufc-4-gaming\">EA attempted to slip an unskippable, full-screen commercial</a> into <em>UFC 4</em> in 2020. Fans who paid for the $60 game obviously weren’t happy, resulting in EA pulling the ad.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5N_tmiuc4pIkeAG1f87JMBSUYdQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16309944/acastro_190530_1777_xbox_0001.0.jpg",
  "description": "The advertising program could go live later this year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}