{
  "title": "Microsoft rides the cloud, Office and Windows to sustained growth in Q3 2022",
  "url": "https://www.theverge.com/2022/4/26/23043334/microsoft-q3-2022-earnings-revenue-cloud-windows-xbox-gaming-surface",
  "date": "2022-04-26T20:14:10.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"microsoft logo stock\" src=\"https://cdn.vox-cdn.com/thumbor/3TxLaxHj_8u6RGpzct3z4coPsis=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70796552/DSCF1189.0.0.jpg\" />    </figure>  <p id=\"D6iltV\">Microsoft’s third quarter 2022 financial results <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=24542&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Finvestor%2Fearnings%2Ffy-2022-q3%2Fpress-release-webcast\" rel=\"sponsored nofollow noopener\" target=\"_blank\">are here</a>, and the company’s posting double-digit growth yet again: revenue of $49.4 billion and net income of $16.7 billion. Revenue is up 18 percent, and the profit represents an 8 percent jump year over year. Microsoft is crediting a chunk of this quarter’s growth to the cloud, with server and cloud services revenue up 29 percent specifically, and Microsoft Cloud up 32 percent to $23.4 billion.</p><p id=\"l8uwYl\">There was plenty of reason to suspect Microsoft would still sport a smile this quarter. While <a href=\"https://www.theverge.com/2022/4/11/23021029/pc-market-decline-chromebooks-post-pandemic-hit-idc-gartner\">the PC industry has started to decline</a> from its pandemic highs, it was flagging Chromebook sales — not Microsoft Windows machines — that were responsible for the entirety of the recent dip. Meanwhile, the Xbox <a href=\"https://www.theverge.com/2022/4/25/23040875/xbox-series-x-s-sales-nintendo-switch-ps5-npd-march-2022\">just had its best sales in 11 years</a>, handily beating the <a href=\"https://www.theverge.com/2022/4/19/23031309/nvidia-amd-gpu-price-in-stock-retail-ebay\">relatively supply-constrained PS5</a>. </p><p id=\"m6n1wS\">Sure enough, Microsoft says its “more personal computing” business, including Windows and Xbox, was up 11 percent to $14.5 billion in Q3 — and “Windows OEM revenue growth,” which should include the price manufacturers pay to put Windows 11 on the laptops and desktops you buy, was up 11 percent specifically. “Enterprises are adopting [Windows 11] at a higher pace than any previous release,” said CEO Satya Nadella on the earnings call.</p><p id=\"FvfETZ\">Xbox hardware revenue was up 14 percent, with a 4 percent jump for Xbox content and services revenue “driven by growth in Xbox Game Pass subscriptions and first-party titles,” for an overall 6 percent boost for gaming revenue to $3.74 billion. Nadella boasted about taking gaming market share on the earnings call as well, and<a href=\"https://t.co/kmB2LTrtWk\"> says 10 million people have now streamed games from Microsoft’s cloud</a> — one of the first concrete numbers we’ve had for cloud gaming’s popularity, since Google Stadia doesn’t share numbers and Nvidia’s GeForce Now numbers include anyone who’s ever used its free trial. PlayStation Now had 3.2 million subscribers as of last May, but Sony recently decided to roll it <a href=\"https://www.theverge.com/2022/3/30/23003225/sony-playstation-plus-essential-extra-premium-complicated\">into a larger subscription service</a>.</p><p id=\"l75iP4\">Xbox Game Pass subscribers also played 45 percent more over the past twelve months, said Nadella — adding up to “billions of hours” across the year. </p><p id=\"hsFOJ4\">We were also eager to see if Microsoft’s big Office and cloud businesses also stayed rosy as some employees return to physical offices, and the answer is definitely yes: 17 percent revenue growth in “Productivity and Business Processes” segment this quarter, with Office up 12 percent and 11 percent in the commercial and consumer divisions, respectively. Office 365 is now at 58.4 million consumer subscribers, up 2 million over last quarter and up 8 million since this time last year. “Intelligent Cloud” revenue was up 26 percent overall to $19.1 billion. </p><p id=\"LkxPz0\">And LinkedIn is still experiencing dramatic growth, up 34 percent this quarter, after growth of 37 percent, 42 percent, and 46 percent the three previous quarters, respectively.</p><div class=\"c-float-right\"><aside id=\"SRW0rY\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Microsoft Q2 2022 earnings\",\"url\":\"https://www.theverge.com/22901252/microsoft-q2-2022-earnings-revenue-cloud-services-surface-gaming-xbox\"},{\"title\":\"Microsoft Q1 2022 earnings\",\"url\":\"https://www.theverge.com/2021/10/26/22747241/microsoft-q1-2022-earnings-revenue-cloud-services-surface-gaming-xbox\"},{\"title\":\"Microsoft Q4 2021 earnings\",\"url\":\"https://www.theverge.com/2021/7/27/22596578/microsoft-q4-2021-earnings-revenue-xbox-cloud-services-surface-gaming\"}]}'></div></aside></div><p id=\"j5Hr86\">Microsoft’s Surface devices are also seemingly doing well at a 13 percent revenue increase after its revenue <a href=\"https://www.theverge.com/22901252/microsoft-q2-2022-earnings-revenue-cloud-services-surface-gaming-xbox\">surprisingly increased 8 percent last quarter</a> (surprising because the company previously warned of a dip). 2022 is the 10th anniversary of the Microsoft Surface, and we expect the company has more up its sleeves than <a href=\"https://www.theverge.com/22996164/microsoft-surface-laptop-se-review-education\">the lackluster Surface Laptop SE</a> and this <a href=\"https://www.theverge.com/2022/3/22/22990673/microsoft-surface-hub-2-smart-camera-interview-report\">fascinating and fancy teleconferencing camera</a>.</p><p id=\"hjPnFE\">Here’s one image with all the relative gains (and one loss) for Microsoft’s individual businesses:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ApdI_JnGLXWgN56nfyA-JgFVzVM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418371/microsoft_q3_businesses_gains.jpg\">  </figure><p id=\"tmngXn\">And here’s how much each of the named businesses did this past quarter in terms of dollars (note: measured in millions):</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RYgs95FKatKUZdS5P_EcY5LMTIE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418421/microsoft_milliions.jpg\">  </figure><p id=\"P2xnFb\"><a href=\"https://www.theverge.com/2022/1/18/22889421/microsoft-acquires-activision-blizzard-call-of-duty-warcraft-king-gaming-buy-news-reports\">Microsoft’s purchase of Activision Blizzard</a>, which is set to make Microsoft the “third-largest gaming company by revenue, behind Tencent and Sony,” didn’t feature in these earnings — the deal isn’t likely to close until next year.</p><p id=\"RW2igx\">Next quarter, Microsoft says to expect more revenue growth — though now single-digit growth in some businesses — with “roughly a $110 million impact on revenue and minimal impact on operating expenses” from the war in Ukraine, and a note that Chinese production shutdowns might impact Windows, Surface and Xbox hardware. Gaming revenue should actually decline, said Microsoft CFO Amy Hood, because of “lower engagement hours year over year as well as constrained console supply.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5qoL1RwEWmLe6aiKy0VNNgWpeqs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3468192/DSCF1189.0.jpg",
  "description": "Surface up 13 percent and Windows up 11 percent, but cloud leads.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}