{
  "title": "Microsoft’s Adaptive Controller was a success for the modding community",
  "url": "https://www.theverge.com/2022/5/17/23094665/microsoft-adaptive-controller-modding-community",
  "date": "2022-05-17T16:12:43.000Z",
  "author": "Alex Cranz",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/x6Xnl0kYo3Fy9xjn78P97TVNO8s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70879039/acastro_220511_5125_controller_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"3EUYdn\">For Ben Heck, it started as a kindness. He was an engineer who made cool things and a veteran reached out to see if he could make him an Xbox controller that would let him play video games with one hand. Twenty years later, he’s still making controllers for people with limb differences. But he’s not the only one. </p><p id=\"7sFHN4\">In the two decades since Heck started modding Xbox controllers for accessibility purposes, a community of controller modders have sprung up. The challenge of making hardware accessible is that everyone has a different need, and often times those needs can be at odds with one another. One person may need a super sensitive joystick while another might need a joystick that responds to the most intense of inputs. Modding a controller to meet both those needs at once is near impossible.</p><aside id=\"heYZ7H\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Microsoft’s Adaptive Accessories are designed to be customizable inputs \",\"url\":\"https://www.theverge.com/2022/5/10/23064121/microsoft-adaptive-accessories-mouse-buttons-hub-disabilities\"}]}'></div></aside><p id=\"hquTp2\">So, some modders might mod controllers to do the former while others do the latter. There’s an entire community of modders out there tweaking existing controllers to make them a little more usable for people with a wider variety of needs — and its thanks to people like Heck, who publicized his own mods on his website, Twitter, and his popular YouTube channels. He showed, in minute detail, what was possible with a factory-fresh Xbox controller.</p><div id=\"A4ARPN\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP5139460909&amp;light=true\" width=\"100%\"></iframe></div><p id=\"kO6SOc\">But things changed in 2018. That’s when <a href=\"https://www.theverge.com/2018/5/17/17363964/microsoft-xbox-adaptive-controller-announced-price-release-date\">Microsoft introduced its Adaptive Controller</a>, a super customizable controller that’s intended to account for as wide a variety of input needs as possible. Since then, some other controller makers have made their own attempts at building more accessible products. <a href=\"https://www.theverge.com/2019/11/18/20970294/logitech-adaptive-gaming-kit-xbox-controller-microsoft-accessibility-gamers-with-disabilities\">Logitech created a range of accessories for the Adaptive Controller</a>, and <a href=\"https://stores.horiusa.com/flex-controller-for-nintendo-switch/?showHidden=true\">Hori made a third party accessible controller for the Switch</a>. It’s an enormous step in the right direction for an industry that can struggle with inclusivity.</p><p id=\"sM9HcC\">For the last few weeks, I’ve been speaking with creators who built whole communities around cool gadgets that the bigger tech companies have ignored or let languish. I spoke with <a href=\"https://www.theverge.com/23053738/mechanical-keyboard-mainstream-evolution-history\">mechanical keyboard lovers</a> who want to see the mechanical keyboard go mainstream and <a href=\"https://www.theverge.com/2022/5/10/23065171/ploopy-trackball-open-source-vergecast-podcast\">open-source gadget enthusiasts</a> who want everyone to participate in a gadget revolution. In this final episode, I wanted to explore a community where the big companies actually caught on and, instead of challenging the creators in the space, actually worked with them. So I naturally spoke with Heck about the game controller mod community. And then I spoke with Bryce Johnson, one of the inventors of Microsoft’s Adaptive Controller.</p><aside id=\"1lw5nw\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"The Vergecast\",\"description\":\"The podcast you need to make sense of the week in tech news\",\"label\":\"Subscribe\",\"url\":\"https://pod.link/430333725\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/ViZdamG9Kt05wPam6T0VT683SG4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23454455/acastro_220511_5125_controller_0002.jpg",
  "description": "Co-inventor Bryce Johnson explains some inspirations.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}