{
  "title": "Microsoft Surface Laptop SE review: just get a Chromebook",
  "url": "https://www.theverge.com/22996164/microsoft-surface-laptop-se-review-education",
  "date": "2022-03-25T17:17:45.000Z",
  "author": "Monica Chin",
  "content": "  <p>A cute look can’t hide the slow processor</p> <p class=\"p--has-dropcap\" id=\"YZPcYU\">When I review a particularly ugly Windows laptop, I’ll often refer to it as having a “laptop cart” look. If you were a student at any point after the early 2000s, you probably understand why. The laptops that schools provide to elementary and middle school kids are famously ugly, old, and terrible in all kinds of ways. </p><p id=\"bhGYQE\">With the Surface Laptop SE, which is tailor-made for education and being sold only to schools, Microsoft is trying a different tack. The Surface Laptop SE is a cute laptop. It looks like a miniature version of the company’s flagship <a href=\"https://www.theverge.com/22392778/microsoft-surface-laptop-4-15-inch-review\">Surface Laptop line</a>, complete with the recognizable logo on the lid and bottom bezel. It’s quite light, at just 2.45 pounds. Unlike many clunky school models out there, this is a device I can easily see appealing to adults in the consumer space. </p><p id=\"zXcBLK\">If it weren’t so dang slow. </p><div id=\"WiXlNY\"><div data-anthem-component=\"scorecard:11113809\"></div></div><p class=\"p--has-dropcap\" id=\"5U9Caa\">I’m not gonna hold back here: this is the slowest computer I’ve ever used. I’ve tested all kinds of Chromebooks, tablets, and budget Windows laptops in my tenure as a hardware reviewer, and <em>man</em>, this thing crawls. I know Intel’s budget-oriented Celeron N4120 is basically what’s available at this price point (<a href=\"https://www.theverge.com/2021/11/9/22771778/microsoft-surface-laptop-se-features-price-release-date\">my model is $329</a>, though I’m sure schools will be negotiating bulk prices and such), but boy, it is slow. It takes a solid while for pages to load and for windows to resize to where I need them to be. Hopping between the dozen or so Chrome tabs that I usually use was a pain, and typing in Google Docs was quite laggy.</p><p id=\"q3CT1i\">“Slow,” of course, is a relative and somewhat subjective term. The speed expectations of an adult laptop reviewer who sits on Zoom all day are probably quite different from those of the average third grader. So I called up a few teachers and asked what exactly their students do on their school-issued devices and how much power they realistically require. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Surface Laptop SE displaying The Verge homepage.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dofTTLxVB1Fw1VeYmwwTP5cCyy8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312851/akrales_220311_5058_0078.jpg\">      <figcaption><em>You might not expect to find a Celeron in here.</em></figcaption>  </figure></div><p id=\"cLmFQ7\">Whitney Rancourt, a Texas-based elementary school reading teacher, says her students complete many of their assignments in Google Classroom, as well as a few other education softwares that I wasn’t able to download and test because the Laptop SE doesn’t allow users to download things on their own (good for schools, a hassle for me). Rancourt allows them to play background music while they work and to play math games or listen to audiobooks if they finish early. Her students are generally doing one thing at a time and don’t need multiple tabs open.</p><p id=\"uuBtCN\">For this kind of thing, the Laptop SE is certainly good enough. One tab or app, while not speedy, will be fine. And good news for students: I did try out Prodigy, a math game that Rancourt’s pupils like to play. It ran just fine, though my poor performance was a stark reminder of how long it’s been since I took algebra. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Surface Laptop SE closed, seen from above, on the edge of a wooden table.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LDwbHhU3a7VtKTVJ5RNe9psmc8I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312843/akrales_220311_5058_0024.jpg\">      <figcaption><em>Maybe Microsoft should market this as a “Prodigy-playing machine”.</em></figcaption>  </figure><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The lock slot on the left side of the Surface Laptop SE.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1w5ViILZVQEw83aK_0aW5h5WGhI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312844/akrales_220311_5058_0037.jpg\">      <figcaption><em>Lock slot on the left.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The ports on the right side of the Surface Laptop SE.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GO6eHYBjLmX-xQxMW18MB8Lbe7A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312845/akrales_220311_5058_0040.jpg\">      <figcaption><em>Audio jack, charging port, USB-C, USB-A on the right.</em></figcaption>  </figure></div></div></div><p class=\"p--has-dropcap\" id=\"hJFXPm\">For older kids, I’m a bit more skeptical. British Columbia middle school health teacher Robert Puharich generally has his students using their laptops to do research on the internet — reading articles, Googling, and so on. They make frequent use of Microsoft Word as well and may occasionally edit images in Photoshop. They typically run as many as five browser tabs at a time during these research sessions, Puharich says. </p><p id=\"YMGcPZ\">Five tabs would be pushing it on this laptop, I think, especially if you have limited time to get your assignment done before it goes back on the cart. If I were doing that level of multitasking, I’d much rather be on the $349 <a href=\"https://www.theverge.com/22400085/lenovo-ideapad-flex-3-chromebook-review-price-screen\">Lenovo Flex 3 Chromebook</a> (also Celeron-powered), on which I was able to run over a dozen Chrome tabs with no problem. </p><p id=\"r5EuSR\">Microsoft’s own apps, such as Word and Paint, are unsurprisingly much smoother on the Laptop SE than any of the browser-based G-Suite things I used. Chrome usually took several seconds longer to open and load documents thant Word did.</p><p id=\"WVKavf\">The Laptop SE is also not great for video calling, which Puharich’s students sometimes have to do. During every Zoom call I ran on the SE, I at some point got a notification that its CPU was overloaded. Audio was crackly, and colleagues often told me I was frozen. </p><p id=\"AZmZGt\">When I’m reviewing a computer, I religiously use that computer for everything I do during that testing period, regardless of how bad that computer is. The SE is the first time I’ve made an exception and done some important video calls on another device because I couldn’t trust this Celeron not to screw up. Students certainly don’t need perfect webcam quality, but they should reliably be able to hear what their teacher is saying without distortion.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The Surface Laptop SE keyboard seen from above.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QtXMNMgGRTpXRgJTQDGhGiBfHys=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312842/akrales_220311_5058_0016.jpg\">      <figcaption><em>All apps immediately launch in full screen — also handy for younger kids, and probably more of a nuisance as they age.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The Microsoft logo on the bottom bezel of the Surface Laptop SE.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vmQvR_ULOijOc6FhvtG5ZoheYUs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312849/akrales_220311_5058_0065.jpg\">      <figcaption><em>Can’t deny it’s a nice logo.</em></figcaption>  </figure></div></div></div><p class=\"p--has-dropcap\" id=\"MiOcl9\">So when it comes to performance, the SE is a bit of a mixed bag. In other areas that Rancourt and Puharich feel are important, results also varied. </p><p id=\"7h08BF\">For example: durability. This is the quality that both educators marked as most important for a student laptop to have. After all, these devices are used all day, every day, by many different students who may not be particularly invested in their longevity. “They need to be able to withstand a lot of drops and poor treatment,” says Rancourt, whose students use Chromebooks in class. “Even when we teach and re-teach how to carry the laptop from one class to another, slips and drops happen.”</p><p id=\"EtpNzG\">The Laptop SE is definitely sturdy. I was intentionally rough on it during my week of use, tossing it around, battering it in backpacks, and eating and drinking nearby. (Sorry, Microsoft!). No scratches or dents. </p><p id=\"B7KQYR\">I also appreciate that the SE is <a href=\"https://www.youtube.com/watch?v=fVjjSqfp75g\">quite repairable as well</a>, with seven screws on the bottom that are easy to access and remove. Microsoft has said that it will sell spare parts through its authorized service providers, allowing IT administrators to replace components on site rather than having to ship devices elsewhere for repair. This is probably the biggest benefit the Laptop SE has over most devices of its size.</p><p id=\"VLYWDt\">But that white keyboard deck… I don’t know about that. It’s very pretty. But after just one week of my testing, it already had a few visible stains on it. I can’t imagine it won’t be visibly filthy with dozens of hands smudging it every week. </p>  <figure class=\"e-image\">        <img alt=\"The Surface Laptop SE lid closed.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wYPhneuPHFurnH8XhiYY_199Sdo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312846/akrales_220311_5058_0048.jpg\">      <figcaption><em>Rounded corners don’t poke you like laptop corners are wont to do.</em></figcaption>  </figure><p id=\"xNAqi7\">Both educators also mentioned battery life. A student’s laptop dying in the middle of class can be disruptive, and a device showing up to a class dead because it didn’t charge properly on the cart leaves teachers a unit short. Unfortunately, the Surface Laptop SE didn’t reliably last a full school day of continuous work — I sometimes saw over six hours from one charge, but often got closer to five and a half.  </p><p id=\"0IJ54V\">Boot time also came up a few times in my conversations with teachers. Getting a classroom full of kids set up on laptops is enough of an undertaking already without needing to wait ages for those computers to turn on. With Puharich’s school’s current Windows laptops (which are “horrible,” he says), “by the time you get the cart unloaded, start up the computer, and find all the problems, then you have to clean them up.” He added, “if you can get the thing loaded up as fast as possible, that would solve the majority of our problems.” </p><p id=\"jP7PTx\">I’m sure that the SE boots faster than the ancient machines Puharich is using, but I still wasn’t blown away by the speed. From power-down, the SE could take over 30 seconds to pull up the Windows login screen and another 15 seconds or so to get from there to the desktop. Even a budget Chromebook or an older iPad should be up and running in less than half that time. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The Surface Laptop SE webcam.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/G-vssXa6FRuelV4N2b1t_JXSXFg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312847/akrales_220311_5058_0058.jpg\">      <figcaption><em>Microsoft apps like Teams, Office, and OneNote come pre-installed.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The Surface Laptop SE half open on the edge of a wooden table.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UpJDlVQ2Od0puMNagaApSVkGTrE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312848/akrales_220311_5058_0063.jpg\">      <figcaption><em>Only IT admins can download and install apps.</em></figcaption>  </figure></div></div></div><p id=\"1IY10I\">But the biggest issue I have with the Surface Laptop SE is its screen size. Puharic and Rancourt recognize the value of portability, but they also both feel strongly that 11.6 inches is too small. They’ve both worked with students with visual impairments or learning disabilities who need text to be very large. I constantly had to zoom out on the Laptop SE (making text small) in order to see the content that I needed to — a device of this size would probably not serve those students well. (The screen is also quite low-resolution, at just 1366 x 768.)</p><div class=\"c-float-right c-float-hang\"><div id=\"7rOgWm\"><div data-anthem-component=\"aside:11113877\"></div></div></div><p class=\"p--has-dropcap\" id=\"1ZvtPf\">Ultimately, I think the main arguments for the Surface Laptop SE are its design and its repairability. It looks and feels several notches nicer than most clunky Windows laptops that schools are currently handing out. It’s capable of doing the work that an elementary school student might be doing. And I don’t want to undersell the replacable parts — that’s huge for IT departments, and it’s great to see Microsoft committing to such a big repairability effort.</p><p id=\"0CE2wL\">But in evaluating this device, customers will need to figure out how to balance the needs of its IT administrators with the needs of its teachers and students. That calculus may look different for every school. But the older a kid gets and the more internet-savvy they become, the more their load might be pushing this processor. There are Chromebooks and iPads out there with faster performance, faster boot time, and better battery life that are worth looking at as well.</p><p id=\"ScRYPd\">And at the end of the day, I’d urge schools to spend more money on larger-screened, higher-resolution devices if they can, because accessibility for all students is worth investing in. </p><div><div id=\"kRnLK9\"><div data-anthem-component=\"aside:11114050\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/oQnuKPPP2BCuqlwDOEY22bX_5q8=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23312850/akrales_220311_5058_0076.jpg",
  "description": "Fine, but Chromebooks are a better deal.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}