{
  "title": "Microsoft is integrating its Windows 365 Cloud PCs into Windows 11",
  "url": "https://www.theverge.com/2022/4/5/23011183/microsoft-windows-365-11-integration-cloud-pcs-features",
  "date": "2022-04-05T15:00:00.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/a0DtZ078EJ853A2T25UgzC7xelc=/120x0:3720x2400/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70712252/Windows_365_Switch_Still.0.png\" />        <figcaption><em>Windows 365 will soon be part of Windows 11.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"FMEe19\">Microsoft put <a href=\"https://www.theverge.com/2021/7/14/22575064/microsoft-windows-365-cloud-pc-launch-date-price-features\">PCs in the cloud with Windows 365</a> last year, and now it’s integrating these Cloud PCs directly into Windows 11. Windows 365 lets businesses access Cloud PCs from anywhere to stream a version of Windows 10 or Windows 11 inside a web browser. It’s something Citrix and many others have been doing for years, but now Microsoft will allow Windows 11 PCs to boot straight to Windows 365 Cloud PCs or easily switch between them using Windows 11’s virtual desktops feature.</p><p id=\"gGanMw\">It’s part of a hybrid work push for Windows, allowing businesses to support a mix of working remotely on traditional devices or through virtual cloud-powered ones. Microsoft is working on three new Windows 365 features that will be deeply integrated into Windows 11. </p><p id=\"bYHGab\">The first is Windows 365 Boot, which will enable Windows 11 devices to log directly into a Cloud PC instance at startup instead of the local install of Windows. It’s designed for devices that are shared between multiple people or for businesses that allow employees to bring your own device (BYOD) to work. “It allows different users to log in directly to their own personal and secure Windows 365 Cloud PC with their credentials,” explains Wangui McKelvey, general manager of Microsoft 365.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PlI2LFoHLVG8MTDQX__t3tifNGQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23368288/windows365switch.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>The Windows 365 Switch feature.</em></figcaption>  </figure><p id=\"66KU79\">Windows 365 Switch is the second option being added. Like the name implies, this integration will let Windows 365 users switch between a local desktop and a Cloud PC within Windows 11. It will be integrated into the Task View (virtual desktops) feature of Windows 11, and all of the same keyboard shortcuts and swipe gestures will be supported. </p><p id=\"sUrcSr\">Microsoft is also working on a Windows 365 offline feature, which will allow you to work locally when you don’t have connectivity to access a Cloud PC. “When connectivity is restored, the Cloud PC will automatically resync with the Windows 365 service without data loss so the user experience and workflow are persistent,” says McKelvey.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZZquYqsO_oXrIGLF9PHz4Jh8MTs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23368298/windows365offline.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>Windows 365 will soon include offline support.</em></figcaption>  </figure><p id=\"fXco0k\">Lastly, Windows 11 is also getting a native Windows 365 app. This will allow Windows 11 users to power up a Cloud PC from the Task Bar or Start menu without having to head into a browser.</p><p id=\"LFYxnP\">Microsoft’s Windows and Surface chief, Panos Panay, describes these latest features as “just the beginning of our Windows and Microsoft cloud integration.” These changes could signal a new direction for Windows, as Microsoft looks to continue to blend Windows 365 and Windows 11 together in the future.</p><p id=\"4j46eE\">“Over the last two years, the organizations that thrived were those that embraced digital transformation,” says Panay. “We cannot always predict what’s coming, but we can ensure that Windows stays at the forefront of technology and experiences — from cloud to intelligence to devices — empowering your organization to embrace whatever comes next.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qHQykx4YPpE60T8W7Xw8EiVP9S0=/0x195:3840x2205/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23368277/Windows_365_Switch_Still.png",
  "description": "Businesses can boot straight into Cloud PCs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}