{
  "title": "‘Micronova’ explosions spotted on distant zombie stars",
  "url": "https://www.theverge.com/2022/4/20/23032402/micronova-white-dwarf-stars-explosions-magnetic-fields-discovery",
  "date": "2022-04-20T15:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9HfcofcwDFCB3QcSa0XTNM5wBPg=/0x27:1280x880/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70771390/eso2207b.0.jpeg\" />        <figcaption><em>An artistic impression of a micronova explosion on a white dwarf.</em> | Image: <a class=\"ql-link\" href=\"http://www.markgar\" target=\"_blank\">Mark Garlick</a></figcaption>    </figure>  <p id=\"14H3Wd\">Star explosions can happen on very different scales, from massive supernovae to plain old novae. Now, scientists think they’ve identified an even smaller way for a star’s surface to explode — dubbed the “micronova.” It’s a type of explosion that occurs in just one region on the surface of some stars, lasting for hours at a time but still packing quite a punch.</p><p id=\"7nYYtq\">Specifically, micronovae occur on a type of zombie star known as a white dwarf. These odd objects are actually the leftover cores of dead stars, remnants of celestial bodies like our Sun that have used up all their fuel and blown most of their materials out into space. White dwarfs are quite small but incredibly dense, sometimes the size of Earth but with the same mass as the Sun. They’re<strong> </strong><a href=\"https://www.theverge.com/2016/3/31/11338590/white-dwarf-star-oxygen-atmosphere-stellar-death\">fairly enigmatic objects</a> that often exhibit some weird behavior, and under the right conditions, micronovae may occur on their surface.</p><p id=\"vaw8Li\">It’s a type of phenomenon scientists didn’t really know existed until now (though the term micronova has been used <a href=\"https://www.syfy.com/syfy-wire/no-theres-no-such-thing-as-a-solar-micronova\">to describe other <em>thing</em>s</a>.) The discovery, <a href=\"https://www.nature.com/articles/s41586-022-04495-6\">detailed today in <em>Nature</em></a>, could change our understanding of the various ways stars can explode. “It goes to show how dynamic the night sky is,” Simone Scaringi, an astronomer at Durham University and lead author of the <em>Nature</em> study, tells <em>The Verge</em>. “How things change really quickly if you’re not looking at the right spot at the right time.”</p><div class=\"c-float-right\"><aside id=\"l9JDU1\"><q>“It goes to show how dynamic the night sky is.”</q></aside></div><p id=\"mMyfsO\">Scaringi and his team stumbled upon this strange phenomenon by chance. They had been working with NASA’s TESS spacecraft, a space-based telescope launched in 2018 that is designed to look for planets outside our Solar System orbiting around stars relatively close to Earth. However, the team wasn’t looking for exoplanets; they were using the telescope to study the variations in brightness of hundreds of stars.</p><p id=\"2vv2qF\">Scaringi is mostly interested in studying white dwarfs, especially those that have neighboring stars close by. Most stars in the Universe actually come in pairs — stars that orbit around each other. The binary stars that Scaringi studies consist of a white dwarf orbiting around a star like our Sun. When this configuration occurs, the super dense white dwarf will actually act almost like a vacuum; its huge gravitational pull will start sucking up hydrogen from the nearby star.</p><p id=\"Gq77DA\">Eventually, the entire surface of the white dwarf will be covered in a layer of hydrogen. And, at some point, the pressure of that layer gets so high that it sparks a thermonuclear explosion. “The whole layer ignites in a bright flash and burns all of the mass that it has accumulated,” Scaringi says. The white dwarf still remains once the event is over, but the layer of hydrogen it stole burns away. This type of event is known as a nova, and scientists have known about it for centuries.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6O7YjtBgXjHX7x0aZErGtIUAW5g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23403262/eso2207a.jpeg\">      <cite>Image: ESO/M. Kornmesser, L. Calçada</cite>      <figcaption><em>An artistic impression of a white dwarf in a binary system, where a micronova might occur.</em></figcaption>  </figure><p id=\"lgpajC\">But when Scaringi and his team watched these specific white dwarf systems, they saw something different. The team noticed that one white dwarf would brighten for a short amount of time — just 10 hours or so. “It was very bright and occurred kind of sporadically in this one object,” Scaringi says. “We had no clue what we were looking at for about a year.” The bright bursts were too dim and too short to be a typical nova, which usually lasts for weeks at a time.</p><p id=\"IaPh4E\">Then the team noticed the same short brightening events happen with two other white dwarfs, also in binary systems. That’s when they started to put the pieces together. They realized that all three of these white dwarfs had very intense magnetic fields. The team wondered if the hydrogen that the white dwarfs were pulling off of their neighboring stars was getting funneled onto the stars’ magnetic poles.</p><div class=\"c-float-left\"><aside id=\"Wn6xTQ\"><q>“We had no clue what we were looking at for about a year.”</q></aside></div><p id=\"Rp2XyJ\">An analogy for how this process works can be found here on Earth with the aurora. Our planet also has a magnetic field, powered by the movement of Earth’s liquid iron core. Charged particles streaming out from our Sun will often get trapped in our magnetic field, where they are then transported to our planet’s northern and southern magnetic poles. That’s what generates the aurora — also known as the<strong> </strong>Northern or Southern Lights: the charged particles from the Sun clashing with our atmosphere in those two locations.</p><p id=\"7YvhRl\">Scaringi’s team thinks something similar is happening with these white dwarfs, just with much more explosive effects. The white dwarfs’ magnetic fields direct the material streaming off its companion toward very small regions near the poles. As the material builds up in these localized spots, it eventually triggers a thermonuclear explosion — except they’re much smaller than a regular nova and much more centralized. The researchers think these events are about 1 million times less bright than a regular nova, but they still burn through a lot of material (about the size of a giant asteroid in our Solar System).</p><p id=\"DlcGAE\">The researchers considered other possible explanations for the brightness, including solar flares, but none quite fit their observations. Of course, nothing is 100 percent certain in science, especially when it comes to a new discovery. And, there are still quite a few unknowns about these phenomena, such as the exact mechanism that would trigger a micronova explosion. It’s also unclear how frequently they occur, though the researchers think they could be happening more often than we expect. “Many systems may do them, and they may do them over and over again,” says Scaringi. “But because they only last for about 10 hours, maybe 12, if you’re not looking at that object at that time, it will never reveal itself.”</p><p id=\"JKiVQw\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4QX7TH3Od3g8y9NOBL2wu3g9Puo=/0x118:1280x788/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23403269/eso2207b.jpeg",
  "description": "There’s supernova, and nova — and now micronova.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}