{
  "title": "Microsoft will let IT admins send Windows 11 desktop or taskbar messages",
  "url": "https://www.theverge.com/2022/4/5/23011254/microsoft-windows-11-it-admins-send-messages-desktop-taskbar",
  "date": "2022-04-05T15:00:00.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OOaUNH8XLz3la40NW08EYdMyuRo=/0x0:838x559/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70712228/Messaging_end_user.0.png\" />    </figure>  <p id=\"MV04ZS\">If you’re an IT admin and you’ve always wanted to send messages to your Windows users, Microsoft is opening up a new option soon. IT admins will soon be able to send organizational messages to Windows 11 PCs, and they can appear on a lock screen, desktop, or above the taskbar.</p><p id=\"HCL10F\">“With the shift to hybrid workplaces, we can see that organizations need to better connect with employees in a way that is tailored to individual situations,” explains Heena Macwan, principal group product manager for Windows. “In a future release we will enable IT to target specific users with organizational messages that can appear on Windows surfaces such as a lock screen, desktop, or above the taskbar.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/39RGl2zZYNyU5z2I3iZFtd-D1Xk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23368376/itadminsmessages.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>IT admins can generate Windows 11 messages.</em></figcaption>  </figure><p id=\"OwnlTe\">IT admins can configure these messages in Microsoft Endpoint Manager and customize how messages appear, who sees them, and how frequently they appear. A company logo can appear alongside the message, and they can also include web links to company URLs. These could be useful for training material or as a quick blast to alert employees to something company-wide.</p><p id=\"UFlqXe\">Microsoft has used similar messages like these to <a href=\"https://www.theverge.com/2017/3/17/14956540/microsoft-windows-10-ads-taskbar-file-explorer\">entice Windows users into using Edge</a>, and the company has previously never allowed app developers or third parties to generate these types of messages above the taskbar. These messages are certainly an improvement over the net send command from the Windows XP era, which allowed IT admins to send a pop-up message to PCs.</p><p id=\"qQJGBM\">As with any messages, these could be met with criticism from end users or security researchers if they’re overused by organizations. Apart from being distracting, cybercriminals often mimic Windows dialog boxes to try to encourage users to click and download malware from webpages.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Cx35gPXA5Bw7eIbDS4A0g0xoWes=/0x61:838x500/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23368389/Messaging_end_user.png",
  "description": "The messages can appear above the taskbar or on lock screens.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}