{
  "title": "Microsoft announces open app store rules to prove it’s okay with new laws",
  "url": "https://www.theverge.com/2022/2/9/22925544/microsoft-open-app-store-principles-windows-xbox",
  "date": "2022-02-09T20:00:37.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"microsoft logo stock\" src=\"https://cdn.vox-cdn.com/thumbor/RKMQX9bJnu5k6Whmk9ckxZ0zYp4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70489681/DSCF1179.0.0.jpg\" />        <figcaption>Photo by Sam Byford / The Verge</figcaption>    </figure>  <p id=\"QBNblO\">Microsoft has announced a set of best practices <a href=\"https://blogs.microsoft.com/on-the-issues/2022/02/09/open-app-store-principles-activision-blizzard/\">called the Open App Store Principles</a> for its Windows app store and future game console marketplaces They amount to Microsoft directly promising not to do things that Google and particularly Apple have been accused of — like gaining unfair advantages over the developers that rely on their app stores. The principles are intended to allay fears about <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">Microsoft’s recent Activision Blizzard acquisition</a> and to distance the tech giant from two of its biggest rivals, whose app store restrictions have spurred lawsuits and legislation.</p><p id=\"MlZDzm\">Microsoft says the Open App Store Principles are “grounded in app store legislation being considered by governments around the world,” including the United States and European Union. “We want regulators and the public to know that as a company, Microsoft is committed to adapting to these new laws, and with these principles, we’re moving to do so,” reads a post outlining the new policies. </p><p id=\"pOQa1o\">Notably, they don’t just cover Windows, where Microsoft has already made concessions <a href=\"https://www.theverge.com/2021/6/24/22549222/microsoft-store-developers-windows-11-revenues-games\">like letting developers use their own payment systems</a> and opening up its Windows store <a href=\"https://www.theverge.com/2021/9/28/22698196/microsoft-store-third-party-app-stores-epic-games-amazon\">to third-party app stores</a> as well as <a href=\"https://www.theverge.com/2021/4/29/22409285/microsoft-store-cut-windows-pc-games-12-percent\">reducing its cut of Windows games</a>. Microsoft is <a href=\"https://www.theverge.com/2022/2/9/22925591/microsoft-xbox-store-open-policies-business-model-changes-hints\">now hinting that it will eventually open up its Xbox store as well</a>: “Just as Windows has evolved to an open and broadly used platform, we see the future of gaming following a similar path.” </p><aside id=\"qXTk6l\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Microsoft hints it will open up Xbox store, changing its entire business model\",\"url\":\"https://www.theverge.com/2022/2/9/22925591/microsoft-xbox-store-open-policies-business-model-changes-hints\"}]}'></div></aside><p id=\"rAA7FL\">Overall, the principles cover four areas:</p><ul><li id=\"NTisSe\"><strong>Quality, Safety, Security &amp; Privacy:</strong> Microsoft promises privacy controls for users and support for all developers that meet “reasonable and transparent standards”</li><li id=\"d2mLrx\"><strong>Accountability:</strong> Microsoft will hold its own apps to the same standards as third-party apps, and it won’t use private analytics data about third-party apps to compete with them</li><li id=\"c5nkAt\"><strong>Fairness and Transparency:</strong> Microsoft won’t deliberately rank its own apps over competing ones and will apply consistent, transparent moderation rules</li><li id=\"faISlX\"><strong>Developer Choice:</strong> Developers don’t have to use Microsoft’s payment system for in-app purchases; Microsoft won’t disadvantage them if they do; Microsoft won’t require them to provide more favorable terms to Microsoft than other app stores; developers communicate with developers directly about pricing offers</li></ul><p id=\"uCxLZv\">When it comes to putting other app stores on notice, the last set is probably the most significant: while Apple and Google already claim to be fair, transparent, accountable, and offer privacy and security controls, both of Microsoft’s rivals have held fast on their in-app payment systems and are fighting tremendous battles in court <a href=\"https://www.theverge.com/2022/1/28/22907106/epic-games-v-apple-amicus-briefs-states-eff-microsoft-appeal\">like the <em>Epic v. Apple</em> case</a>.</p><p id=\"KiEOvD\">However, the rules are similar to ones Microsoft <a href=\"https://blogs.windows.com/windowsexperience/2021/06/24/building-a-new-open-microsoft-store-on-windows-11/\">announced last year</a> for Windows, and they closely mirror the language of proposals <a href=\"https://www.theverge.com/22914479/open-app-markets-act-legislation-senate-committee-markup-explained\">like the Open App Markets Act</a>, which passed a US Senate committee vote last week. Microsoft president Brad Smith <a href=\"https://twitter.com/BradSmi/status/1489395484808466438\">lauded the Open App Markets Act vote</a>, tweeting that it would “promote competition and ensure fairness and innovation in the app economy.” Today’s post reiterates Microsoft’s support for legislation.</p><p id=\"cc1ziF\">But as it’s done previously, Microsoft isn’t holding its Xbox platform to the same standard as Windows. The current Xbox store will follow the principles in the first three sections but not the rules about developer choice — which contain the most controversial and potentially costly policies and the ones Apple and Google have fought most strongly. “We’re committed to closing the gap on the remaining principles over time,” the announcement reads, saying they’ll apply to “the next-generation marketplaces we will build for games.”</p><div class=\"c-float-right\"><aside id=\"xLeyYM\"><q>“Emerging legislation is not being written for specialized computing devices, like gaming consoles”</q></aside></div><p id=\"DfjI5x\">That’s convenient for Microsoft since the company has a popular, valuable store on Xbox, one where it strikes special deals with certain companies (<a href=\"https://www.theverge.com/c/22611236/epic-v-apple-emails-project-liberty-app-store-schiller-sweeney-cook-jobs\">see number 2 here</a>), but it has had trouble getting users to accept its Windows store even after many years and has no mobile platform at all after the <a href=\"https://www.theverge.com/2017/10/10/16452162/windows-phone-history-glorious-failure\">failure of Windows Phone</a>. </p><p id=\"8pP87u\">For now, the company has committed to specific decisions that bolster openness in the gaming ecosystem, including one that may appease gamers who are worried about the Microsoft—Activision Blizzard deal: Microsoft is promising to <a href=\"https://www.theverge.com/2022/2/9/22925510/microsoft-activision-sony-nintendo-app-store-antitrust-policies\">keep <em>Call of Duty</em> and other Activision Blizzard titles on PlayStation consoles “beyond the existing agreement</a>.” But it’s apparently making these commitments on a case-by-case basis.</p><p id=\"QLF1A2\">Microsoft outlined its reasoning for the discrepancy between Windows and Xbox. “It’s important to recognize that emerging legislation is being written to address app stores on those platforms that matter most to creators and consumers: PCs, mobile phones, and other general purpose computing devices,” it says. “Emerging legislation is not being written for specialized computing devices, like gaming consoles, for good reasons.” The Open App Markets Act, for instance, effectively exempts consoles from its proposed rules.</p><p id=\"x6T2mq\">Microsoft’s reasons include a key argument from <em>Epic v. Apple</em>, where Epic <a href=\"https://www.theverge.com/2021/5/5/22421570/epic-apple-trial-iphone-xbox-console-specific-general-purpose-pc-testimony-day-3\">needed to distinguish iOS</a> from the comparably closed Xbox ecosystem. “Gaming consoles, specifically, are sold to gamers at a loss to establish a robust and viable ecosystem for game developers. The costs are recovered later through revenue earned in the dedicated console store,” it says.</p><p id=\"HxVvoG\">In other words, the console business model requires a walled garden, and courts and lawmakers haven’t said otherwise. For now, Microsoft is making a timely commitment to openness but not upending its games ecosystem just yet.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mBjxdWD82lblh7-vP2zbOnQisTw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3468188/DSCF1179.0.jpg",
  "description": "Before governments force its hand.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}