{
  "title": "Microsoft hints it will open up Xbox store, changing its entire business model",
  "url": "https://www.theverge.com/2022/2/9/22925591/microsoft-xbox-store-open-policies-business-model-changes-hints",
  "date": "2022-02-09T19:02:18.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ISlJzU-jzpHTNjsFUHa5sjGjVkE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70489312/acastro_180604_1777_xbox_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Irx95U\">Microsoft has long argued that its Xbox store should be treated differently than the app store ecosystem around PCs or phones. The software giant takes a 30 percent cut on digital game purchases through its Xbox store, just like Apple takes from software purchased on its App Store. While <a href=\"https://www.theverge.com/2021/5/6/22422691/microsoft-xbox-consoles-profit-software-services-revenue-apple-epic-games-trial\">Microsoft defended this business model</a> during the <em>Epic v. Apple</em> trial last year, the Xbox maker is now hinting that it needs to make its Xbox store more open in a move that could change its Xbox console business model in the future.</p><p id=\"QVY7iI\">Microsoft has unveiled a series of app store principles today that are similar to the ones it <a href=\"https://www.theverge.com/2020/10/8/21507682/microsoft-apple-app-store-policies-principles-list\">laid out two years ago</a>. The principles are designed to “ensure we’re providing the best possible experience for creators and customers of all sizes,” <a href=\"https://blogs.microsoft.com/on-the-issues/2022/02/09/open-app-store-principles-activision-blizzard/\">according to Microsoft president Brad Smith</a>. Most of the principles only apply to Microsoft’s Windows store, and not its Xbox store, though.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/W0DN3YLKHox-Y6n8pD_B0j9i-JI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22012237/vpavic_201103_4275_0163.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The Xbox store could be a little more open soon.</em></figcaption>  </figure><p id=\"C73qKX\">Microsoft’s reasoning behind why the Xbox store should be treated differently will be familiar if you’ve heard the company <a href=\"https://www.theverge.com/2021/5/5/22421570/epic-apple-trial-iphone-xbox-console-specific-general-purpose-pc-testimony-day-3\">argue in Epic’s favor before</a>. Smith says legislation is being written to address app stores across PCs and phones but not game consoles like the Xbox. “Emerging legislation is <em>not</em> being written for specialized computing devices, like gaming consoles, for good reasons,” says Smith. “Gaming consoles, specifically, are sold to gamers at a loss to establish a robust and viable ecosystem for game developers. The costs are recovered later through revenue earned in the dedicated console store.”</p><p id=\"7InXB8\">Microsoft has previously revealed it <a href=\"https://www.theverge.com/2021/5/6/22422691/microsoft-xbox-consoles-profit-software-services-revenue-apple-epic-games-trial\">doesn’t earn any profit on sales of Xbox consoles alone</a>, and that thanks to a hardware subsidy model, “profits are generated in game sales and online service subscriptions.” This model is particularly lucrative for games like <em>Fortnite</em>, <em>Call of Duty: Warzone</em>, and other popular free-to-play games that rely on in-game purchases for monetization. Microsoft takes a cut of all of these purchases, and we’ve seen the impact <a href=\"https://venturebeat.com/2018/07/19/fortnite-helps-xbox-revenue-jumps-39-to-2-29-billion/\"><em>Fortnite </em>can have on Xbox revenue</a> alone.</p><p id=\"LxKmXF\">Despite this lucrative business model, Microsoft says it will need to change, as it seeks to assure regulators that are looking closely at its <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">$68.7 billion acquisition of Activision Blizzard</a>. “We recognize that we will need to adapt our business model even for the store on the Xbox console,” admits Smith. Microsoft will apply seven of its 11 principles to the Xbox store today, including treating apps or games equally, transparency about promotion or marketing of apps and games, and holding its own apps or games to the same standards imposed on others.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2PI9_HHzg41WVeMfG0vBhNWBzS0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22679148/microsoft_store_windows_11_1.jpg\">      <figcaption><em>The Microsoft Store has already seen some big changes with Windows 11.</em></figcaption>  </figure><p id=\"8hRA2e\">Crucially, one big principle won’t be applied to the Xbox store yet: not requiring developers to use its own in-app payments system on Windows. “We’re committed to closing the gap on the remaining principles over time,” says Smith, but there’s no firm commitment to when the Xbox store will be more open.</p><p id=\"nyoMcc\">Microsoft is <a href=\"https://www.theverge.com/2022/2/9/22925510/microsoft-activision-sony-nintendo-app-store-antitrust-policies\">also committing</a> to keeping popular Activision Blizzard games like <em>Call of Duty</em> and <em>Overwatch</em> on PlayStation, too. This commitment will even extend to Nintendo, in what looks like a move to position Microsoft as a game publisher across Xbox, PlayStation, PC, and Nintendo Switch, beyond <em>Minecraft</em> and existing Bethesda games.</p><p id=\"l8PuMt\">It certainly feels like a strategic shift for Microsoft, even if it’s not clear when the Xbox store will be more open. Microsoft says it’s now building a “next-generation game store” based on these new principles. Could that include a reduction of its Xbox store cut? Possibly. This is something it has previously explored. Documents in the <em>Epic v. Apple</em> trial revealed <a href=\"https://www.theverge.com/2021/5/2/22415712/microsoft-xbox-store-cut-epic-games-court-documents\">Microsoft had been planning to reduce its Xbox store cut</a> to just 12 percent, a move that would shake up console gaming.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FRi_gTQLnvvi-jQ2uG0R5LwkboY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19992183/VRG_ILLO_4030_Windows_10_Guide_001.jpg\">      <figcaption><em>Microsoft shook up the PC gaming industry last year.</em></figcaption>  </figure><p id=\"3sSrEi\">Instead, Microsoft <a href=\"https://www.theverge.com/2021/4/29/22409285/microsoft-store-cut-windows-pc-games-12-percent\">shook up the PC gaming industry</a> with its announcement last year to match the cut that Epic Games takes: 12 percent. It puts more pressure on Valve, which still takes a 30 percent cut on Steam purchases and was also designed to <a href=\"https://www.theverge.com/2021/5/1/22411686/microsoft-windows-store-game-fees-change-apple-app-store-epic-games-eu\">crank up the Apple pressure</a>.</p><p id=\"RACcWe\">A similar move on Xbox would have far-reaching consequences for console pricing, game development, marketing, and the future of subscriptions. Regulators will undoubtedly want more clarity on these open principles for the Xbox store, particularly as Microsoft is attempting to shift its business model toward subscriptions and its Xbox Game Pass service. </p><p id=\"e1ypvt\">That future business model is key here because, at the same time, these principles continue to put pressure on Apple. Microsoft would much prefer a world where it doesn’t have to pay 30 percent to Apple to get Xbox games or Office subscriptions on more than 1 billion active iPhone and iPad devices. It certainly looks like it’s now more willing to upend its Xbox console business model to get there.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/42ej3mdIIijjy63TWR0wD5Wl6HQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11515155/acastro_180604_1777_xbox_0001.jpg",
  "description": "A future Xbox store might be a lot more open.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}