{
  "title": "Microsoft’s Xbox app now lets you install PC games to any folder",
  "url": "https://www.theverge.com/2022/3/1/22956279/microsoft-xbox-app-windows-install-games-custom-folders",
  "date": "2022-03-01T14:41:14.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7fP_SODWQmsqh8bdUjtbvJRWZtQ=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70564629/Xbox_App_Preview_11_17_21.0.jpg\" />        <figcaption><em>The new Xbox app update is available now.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"SDGpGC\">Microsoft is finally allowing games from the Windows store to be installed to any folder that can be accessed freely. The software giant started <a href=\"https://www.theverge.com/2021/11/19/22791013/microsoft-xbox-app-windows-install-folders\">testing this functionality last year</a>, and it’s now rolling out in the Xbox all for all Windows 10 and Windows 11 users today.</p><p id=\"kJvjdy\">This will greatly improve the game install process from the Windows store, allowing PC gamers to install titles into any folder of their choice with unrestricted access to game files. It should address the many headaches of installing games from PC Game Pass, and Windows users should be able to backup game files and restore them in the future.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lZoAKxG_cbtOxdD-FhzKp8JNJBQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23026936/dKIC0Le.jpeg\">      <figcaption><em>The new install features on the Xbox app.</em></figcaption>  </figure><p id=\"clcGo4\">Microsoft previously forced Windows users to install PC games from its app store into a dedicated WindowsApps folder at the root of a drive. While additional storage drives were supported, you couldn’t install games into a folder of your choice or freely move them around or modify files. </p><p id=\"VlQ5cY\">You won’t need to re-install your existing games to take advantage of this update, either. You can right-click on games in the Xbox app and select manage and then enable the new installation and game management features. Any games you install in the future will include the ability to choose which folder you install them to.</p><p id=\"raSjzj\">These changes will also open up the ability to mod more games from the Windows store and overall make the Xbox app a lot more Steam-like. The new Xbox app update is available immediately from the Windows store.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/T4MtJchih4KJyQv4ngsmIEDD_LU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23026940/Xbox_App_Preview_11_17_21.jpg",
  "description": "Some of the Windows store headaches are going away.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}