{
  "title": "Microsoft teams up with VW to make HoloLens work in cars",
  "url": "https://www.theverge.com/2022/5/5/23058193/microsoft-hololens-moving-platform-cars-boats-vehicles-volkswagen-driving-hud",
  "date": "2022-05-05T15:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6WeKAAVytywz1_jKCNxZSCTwwG4=/164x0:1784x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70835505/20220428_HoloLens_Still_Navigation_mit.0.jpeg\" />        <figcaption><em>HoloLens showing a driver an upcoming left turn.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"u6l8sU\">Microsoft has officially announced a new “moving platform” feature for the HoloLens 2, which is designed to let the augmented reality headset work in places like cars. It addresses a long-standing HoloLens issue of moving environments confusing the headset’s sensors. The enhancement was developed in collaboration with Volkswagen, which has been experimenting with using the headset as a heads-up display in its vehicles.</p><p id=\"189Ysg\">As Microsoft’s blog post explains, its augmented reality headset tracks movement using a combination of camera sensors and an <a href=\"https://en.wikipedia.org/wiki/Inertial_measurement_unit\">inertial measurement unit</a> (which typically includes accelerometers and gyroscopes). But in a car, the readings from these two sensors can conflict; the headset senses movement but sees a static environment. In other words, it was getting car sick. </p><div class=\"c-float-right\"><aside id=\"wL6BCb\"><q>HoloLens would get car sick</q></aside></div><p id=\"ZnVoBc\">That’s what VW discovered after it started investigating the use of augmented reality headsets to teach drivers how to get around a racetrack faster. It started collaborating with Microsoft to fix the sensor problem in 2018, and, eventually, the two developed a prototype system that allowed a car to display real-time information on a connected headset. </p><p id=\"Mo3ZoA\">The system allows virtual objects to be placed both inside and outside of the vehicle. One image released by Microsoft (above) shows the HoloLens 2 projecting a virtual map onto the dashboard of a car, with navigation arrows appearing ahead at key intersections. A second shows it alerting the driver to an upcoming pedestrian crossing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-ZiIPV3jtZfRWfbpBfL4RBvey-0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23439593/20220428_HoloLens_Still_Pedestrian_Warning_mit.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>HoloLens alerting a driver to an upcoming pedestrian crossing.</em></figcaption>  </figure><p id=\"KF5CEg\">VW’s existing cars already integrate some augmented reality elements. Its recent ID electric cars feature an <a href=\"https://www.volkswagen.co.uk/en/electric-and-hybrid/software-and-technology/driving-technology/augmented-reality-head-up-display.html\">augmented reality heads-up display</a> that projects data from the car — including current speed and navigation instructions — onto the windshield, where it’s easier for the driver to see without taking their eyes off the road. </p><p id=\"fAlKV4\">Unsurprisingly, given Microsoft is firmly targeting the <a href=\"https://www.theverge.com/2019/2/24/18235460/microsoft-hololens-2-price-specs-mixed-reality-ar-vr-business-work-features-mwc-2019\">$3,500 HoloLens 2 at enterprise users</a>, there’s no sign of it getting a consumer rollout anytime soon. (Although Microsoft’s Marc Pollefeys, who worked on the project, says it’s interested in consumer use cases “in the longer term.”) Instead, Microsoft suggests the first beneficiaries of the new functionality could be maritime companies that can connect workers with remote mechanical experts who can look through a worker’s HoloLens 2 to diagnose a problem.</p><p id=\"RHgHVI\">Perhaps most importantly, it’s clear that Microsoft is still actively developing its augmented reality headset platform despite reports from earlier this year that the project was <a href=\"https://www.businessinsider.com/microsoft-hololens-3-metaverse-mixed-reality-strategy-confusion-rivalries-2022-2?r=US&amp;IR=T\">experiencing difficulties</a>. The company has <a href=\"https://www.wsj.com/articles/microsoft-hit-by-defections-as-tech-giants-battle-for-talent-to-build-the-metaverse-11641819601?AID=11557093&amp;PID=6415797&amp;SID=bi%7C61f8750c76b9e748ad0f8954%7C1643996447696uzuhmu5s&amp;subid=Business+Insider&amp;cjevent=650b0e8a85e311ec823a94f60a18050e&amp;tier_1=affiliate&amp;tier_2=moa&amp;tier_3=Business+Insider&amp;tier_4=3861930&amp;tier_5=https%3A%2F%2Fwww.wsj.com%2Farticles%2Fmicrosoft-hit-by-defections-as-tech-giants-battle-for-talent-to-build-the-metaverse-11641819601\">reportedly lost 70 employees from its HoloLens team</a> over the past year, with over 40 heading to Meta to support its attempt to pivot into a metaverse company. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ObMd0zG4utrUPSYq5Ozl_MwA0h0=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23439595/20220428_HoloLens_Still_Navigation_mit.png",
  "description": "Previously, it would basically get car sick.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}