{
  "title": "Microsoft to remove AltspaceVR social hubs and tighten up safety and moderation",
  "url": "https://www.theverge.com/2022/2/16/22937192/microsoft-altspacevr-social-hubs-safety-changes",
  "date": "2022-02-16T16:00:00.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9T877-YsJwSybGc3ItpkkiIBTCc=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70516768/maxresdefault.0.jpg\" />        <figcaption><em>Microsoft acquired AltspaceVR in 2017.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"rkWc0r\">Microsoft is removing all social hubs hosted in AltspaceVR and requiring users to log into the virtual reality app using a Microsoft account. The changes are designed to improve safety and moderation on AltspaceVR, and Microsoft will also turn its existing safety bubble feature on by default and mute attendees joining meetings in AltspaceVR by default.</p><p id=\"jIRhdL\">“As platforms like AltspaceVR evolve, it is important that we look at existing experiences and evaluate whether they’re adequately serving the needs of customers today and in the future,” <a href=\"https://altvr.com/making-altspacevr-a-safer-space/\">explains Alex Kipman</a>, head of Microsoft’s mixed reality efforts. “This includes helping people better connect with those who have shared common interests while also ensuring the spaces they access are safe from inappropriate behavior and harassment.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8GFMXBCEO6pfd6Hy_oumyRnwLyY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23249507/1_GL3mGYnNHpkEE40a5_qr1A.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>The AltspaceVR campfire is going away.</em></figcaption>  </figure><p id=\"svgEOp\">The social hubs in AltspaceVR were designed “to help foster new friendships” and act as an entry point to get familiar with AltspaceVR itself. You could explore the spaces freely, and speak openly to other AltspaceVR users in them. They were also useful for people to invite fellow AltspaceVR users into private spaces or meetings. The lack of moderation in these open social spaces could lead to harassment or unwanted attention, which is the main reason Microsoft is shutting them down.</p><p id=\"qZ45gD\">While social hubs like the Campfire, News, and Entertainment Commons will be removed immediately within AltspaceVR, the requirement for a Microsoft account to use the app will be implemented in the coming weeks. Microsoft first started testing its account integration with <a href=\"https://altvr.com/microsoft-account-integration/\">AltspaceVR a year ago</a>, and it seemed like it would eventually become a requirement.</p><p id=\"F6sf5z\">The Microsoft account requirement will mean AltspaceVR will be tightly integrated into Microsoft Family Safety in the coming months, allowing parents to approve or limit access to AltspaceVR if it’s downloaded from the Microsoft Store.</p><p id=\"qaj0S6\">It’s clear Microsoft is trying to get ahead of moderation issues in its broader metaverse push. After <a href=\"https://www.theverge.com/2017/10/3/16408626/altspacevr-microsoft-acquisition-vr-community\">acquiring AltspaceVR in 2017</a> when it was about to shut down, Microsoft hasn’t made any substantial changes to the service like it’s doing today. The software maker is pushing to make mixed reality and the idea of a metaverse a reality, and Kipman now describes AltspaceVR as “a building block for the future of the metaverse.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RAUR7TrRriIaoK3MeSylGp3QrDU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22979285/teamsmesh.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>Microsoft is now focused on Teams immersive meetings.</em></figcaption>  </figure><p id=\"sPSrPc\">That appears to suggest AltspaceVR is simply a part of Microsoft’s broader effort for the metaverse, rather than the key to its future. The company has been <a href=\"https://www.theverge.com/2021/11/2/22758974/microsoft-teams-metaverse-mesh-3d-avatars-meetings-features\">building Microsoft Teams immersive meetings</a> and an entire <a href=\"https://www.theverge.com/22308883/microsoft-mesh-virtual-reality-augmented-reality-hololens-vr-headsets-features\">Microsoft Mesh platform</a> over the past year, just as  Mark Zuckerberg <a href=\"https://www.theverge.com/22588022/mark-zuckerberg-facebook-ceo-metaverse-interview\">bets Facebook’s future</a> on the metaverse. Facebook <a href=\"https://www.theverge.com/22749919/mark-zuckerberg-facebook-meta-company-rebrand\">rebranded to Meta</a> in October, and has poured at least <a href=\"https://www.theverge.com/2021/10/25/22745381/facebook-reality-labs-10-billion-metaverse\">$10 billion in 2021 alone</a> into building the metaverse.</p><p id=\"n5glG8\">Microsoft CEO Satya Nadella is equally bullish about the metaverse. “We feel very well positioned to be able to catch what I think is essentially the next wave of the internet,” said Nadella, <a href=\"https://www.theverge.com/22901252/microsoft-q2-2022-earnings-revenue-cloud-services-surface-gaming-xbox\">during Microsoft’s earnings call last month</a>. “I think the next wave of the internet will be a more open world where people can build their own metaverse worlds, whether they’re organizations, game developers, or anyone else.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IOZhDk3kq6kpbIFMD5nY-Z4P7iY=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23249433/maxresdefault.jpg",
  "description": "Microsoft is getting ready for metaverse moderation.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}