{
  "title": "Microsoft says more than 10 million people have streamed games on Xbox Cloud Gaming",
  "url": "https://www.theverge.com/2022/4/26/23043678/microsoft-xbox-cloud-gaming-10-million-people-streamed",
  "date": "2022-04-26T22:32:50.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/G_YB5X2HIZ7t7kfG365D1wHZYAU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70797191/acastro_190530_1777_xbox_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"w4NzPR\">More than 10 million people have streamed games over Xbox Cloud Gaming, Microsoft CEO Satya Nadella said Tuesday during the company’s third-quarter earnings call. Cloud gaming is a feature that’s only available as part of the $14.99 per month Xbox Game Pass Ultimate tier, so the figure shared Tuesday indicates that a lot of people are checking it out. It’s also a concrete stat in a field where there have been few — Google doesn’t break out numbers for Stadia, and any numbers shared by Nvidia for GeForce Now include people who have used a no-strings-attached free trial.</p><p id=\"ZdoUta\">Game Pass has proven to be popular, as Microsoft said in January that the service <a href=\"https://www.theverge.com/2022/1/18/22406059/xbox-game-pass-subscribers-25-million-microsoft-activision\">grew to have 25 million subscribers</a>, which was <a href=\"https://www.theverge.com/2021/1/26/22250795/xbox-game-pass-subscribers-growth-microsoft\">up from 18 million the year before</a>. That said, it’s unclear how Microsoft is defining what counts as a streamed game from Xbox Cloud Gaming, so we don’t know exactly what the stat might represent, how many current subscribers are included in that streamed games count, or how much playtime is required for the company to count it as a stream. It’s also worth noting that you can technically sign up for a month of Xbox Game Pass Ultimate for just a dollar and then cancel, and it’s unclear how many people who did that and streamed a game might also be counted in Microsoft’s figure shared Tuesday.</p><p id=\"6e6kzO\">Microsoft has invested heavily into Xbox Cloud Gaming, launching first <a href=\"https://www.theverge.com/2020/9/14/21436006/microsoft-xbox-xcloud-game-list-pass-ultimate-streaming\">on Android</a>, <a href=\"https://www.theverge.com/2021/6/28/22554267/microsoft-xcloud-game-streaming-xbox-pass-ios-iphone-ipad-pc\">then iOS and PC</a>, and then to <a href=\"https://www.theverge.com/2021/11/17/22787396/xbox-cloud-gaming-consoles-series-x-s-one\">Xbox consoles</a>, which all means that you can now stream a big library of Xbox games across a wide range of devices. (I’ve even used it to play <em>Psychonauts 2</em> <a href=\"https://www.theverge.com/22985166/xbox-cloud-gaming-steam-deck-microsoft-edge-beta\">on my Steam Deck</a>, and it worked like a charm.) And as of October, the service is <a href=\"https://www.theverge.com/2021/10/7/22714067/xbox-cloud-gaming-custom-xbox-series-x-hardware-upgrade\">fully powered by custom Xbox Series X hardware</a>, which improved framerates and load times, making it that much better to use. </p><p id=\"nt4KqT\">But the company has also seen strong hardware sales, with Xbox just having its <a href=\"https://www.theverge.com/2022/4/25/23040875/xbox-series-x-s-sales-nintendo-switch-ps5-npd-march-2022\">best March sales performance in 11 years</a> and next-generation Xboxes becoming much more readily available. Microsoft said Tuesday that Xbox hardware revenue <a href=\"https://www.theverge.com/2022/4/26/23043334/microsoft-q3-2022-earnings-revenue-cloud-windows-xbox-gaming-surface\">is up</a> 14 percent. However, Microsoft CFO Amy Hood warned that Chinese production shutdowns could affect future hardware sales, including “constrained console supply.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-GUazH8inXV-xyYp-bOmKFPOLEk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16309942/acastro_190530_1777_xbox_0003.0.jpg",
  "description": "Microsoft has invested heavily in game streaming.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}