{
  "title": "Microsoft might make it harder to share Xbox clips to Twitter",
  "url": "https://www.theverge.com/2022/3/18/22985073/microsoft-xbox-clips-twitter-harder-to-share-insider",
  "date": "2022-03-18T18:21:46.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zFVbvdpanh0uF_Un0Mkfxan1GeM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70642451/vpavic_4275_20201030_0036.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"nfllyO\">Microsoft may be making it more difficult to share your gameplay captures to Twitter, based on changes to Xbox Insider builds <a href=\"https://www.windowscentral.com/latest-xbox-insider-ring-removes-twitter-sharing-game-dvr-clips-some-reason\">reported by <em>Windows Central</em></a>. Right now, on my Xbox Series X, I can post a screenshot or video directly to Twitter through the Xbox’s interface, but according to <em>Windows Central</em>, Insider builds have removed that option and instead direct you to share from your phone.</p><p id=\"uXlgp6\">Sharing Xbox captures from your phone isn’t new — I actually find it to be a pretty smooth experience. If you select a capture on your Xbox and then the option to share to mobile, your phone should pop a notification directing you right to that capture in the Xbox app so you can save and post it wherever you’d like. </p><div class=\"c-float-right\"><aside id=\"MRsXYx\"><q>You might have to tweet clips from your phone instead</q></aside></div><p id=\"6EXFsk\">But with the seemingly impending change that removes the ability to share to Twitter right from your Xbox, posting from your phone becomes your <em>only</em> option. That may not be ideal if, say, you have your phone in another room while you’re playing a few rounds of <em>Halo Infinite</em>. Microsoft didn’t immediately reply to a request for comment. </p><p id=\"IjvTXW\">Nintendo and Sony let you post directly to Twitter from the Switch and PS5, making the feature’s potential removal from Xbox a downside to using Microsoft’s consoles (that is, if the change rolls out to everyone). However, both <a href=\"https://www.theverge.com/2020/11/30/21754584/nintendo-switch-update-11-screenshot-video-sharing-phone-pc\">Nintendo</a> and <a href=\"https://www.theverge.com/2022/2/23/22947722/sony-playstation-ps5-captures-screenshots-videos-app\">Sony</a> have also added features to make it easier to share clips from your phone, perhaps recognizing that many people probably prefer to post things to Twitter from their phone anyway.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ajgczLmaR_09u0WihZt3jdbHAIY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22012260/vpavic_4275_20201030_0036.jpg",
  "description": "You might have to post from your phone instead.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}