{
  "title": "Microsoft’s new ‘One Outlook’ email client for Windows is starting to leak out",
  "url": "https://www.theverge.com/2022/5/6/23060682/microsoft-outlook-redesign-windows-web",
  "date": "2022-05-07T01:00:00.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/RXJprgVFr8CmwIL3oFiN7PXtHjI=/0x0:1320x880/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70841696/oneoutlookapp.0.jpg\" />        <figcaption>Image: Microsoft</figcaption>    </figure>  <p id=\"sPys0c\">Microsoft’s new Outlook email client for Windows, the <a href=\"https://www.theverge.com/2021/1/4/22213300/microsoft-one-outlook-app-windows-10-mail-app-calendar-replacement\">so-called “One Outlook” project</a> the company has been working on for some time, appears to be almost ready for prime time. Some users have been able to download the new app, as first <a href=\"https://www.windowscentral.com/first-look-microsofts-new-one-outlook-email-client-windows-11\">spotted by <em>Windows Central</em></a>, though it seems to only function for work and educational accounts right now. Those who can get in are finding... well, it’s pretty much exactly what you’d expect.</p><p id=\"IZfOQ6\">We’ve long heard that the future of Microsoft’s mail clients would look a lot like the Outlook web app, and indeed, the new app appears to be just that. It’s much lighter and simpler than previous versions of Outlook for Windows and much more powerful than the built-in Mail app it is also slated to eventually replace. The app is fully hosted online, too, as Microsoft continues to move its services to the web rather than run them exclusively as native apps.</p><div id=\"SRcUI1\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Microsoft’s new One Outlook email client has leaked. It’s a web-based version that will eventually replace the built-in Mail app on Windows and even win32 Outlook itself. I’m expecting a public beta at Build, and full Outlook replacement in a couple of years. Image: Temmie <a href=\"https://t.co/6c3aqxC7L9\">pic.twitter.com/6c3aqxC7L9</a></p>— Tom Warren (@tomwarren) <a href=\"https://twitter.com/tomwarren/status/1522518208321835008?ref_src=twsrc%5Etfw\">May 6, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"uangZ3\">“We appreciate the excitement for our next update and will have more to share in the coming weeks,” Scott Stiles, the vice president of product management for Outlook, told <em>The Verge </em>in a statement. “The version available for download is an early unsupported test version of Outlook for Windows and is missing some of the features and enhancements that will be available for our beta testers. We encourage our customers to wait for the beta version to be released.” </p><p id=\"TvdHyo\">The app was reportedly supposed to be in testing in 2021, with plans to eventually replace the other clients this year. Now, it seems likely Microsoft will announce the new app officially at its Build developer conference at the end of this month and move to replace Mail, Calendar, and eventually other versions of Outlook after that. As for how it performs? We’ll have to wait until we can get our hands on the new app to see, but it’s safe to say that desktop apps that act as shells for web apps have a bit of a spotty history. But with Microsoft’s <a href=\"https://www.theverge.com/2018/2/7/16987842/microsoft-progressive-web-apps-pwa-edge-windows-10\">long-standing push for Progressive Web Apps</a>, it seems that the future is coming one way or another.</p><p id=\"P8bzlv\">The transition won’t be easy since so many Outlook users have a long history with the way the app has worked, and an experience based on the sparser, cleaner web app will feel like a huge departure. Which means, at least for a while, Microsoft is likely to continue to have multiple versions of Outlook available to users. Its path forward is clear, though: in the future, there is only One Outlook. And it starts with the web.</p><p id=\"iigKzo\"><em><strong>Update May 6th, 9:00PM ET: </strong></em><em>Updated with comment from Microsoft.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Cka1WetMFY5ihzMPjcTuPX9lE_U=/0x95:1320x786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22212869/oneoutlookapp.jpg",
  "description": "The web app is taking over Microsoft’s email clients.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}