{
  "title": "Microsoft Flight Simulator can now run on Xbox One thanks to Xbox Cloud Gaming",
  "url": "https://www.theverge.com/2022/3/1/22956247/microsoft-flight-simulator-xbox-cloud-gaming-launch",
  "date": "2022-03-01T14:24:10.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/B3EOVY_lE5EedXySTvYWOxRoSnE=/94x0:1107x675/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70564556/xCloud_Microsoft_Flight_Simulator.0.jpg\" />    </figure>  <p id=\"WX7hG4\">Microsoft Flight Simulator is launching on Xbox Cloud Gaming today, allowing Xbox One owners to access the game for the first time. The Xbox Series X / S exclusive was previously only playable on the latest Xbox consoles, but you can now play Microsoft Flight Simulator through a web browser, on Android and iOS devices, and on Xbox One consoles.</p><p id=\"mwiqqr\">Microsoft Flight Simulator first launched on PC in 2020, before arriving on Xbox Series X / S <a href=\"https://www.theverge.com/2021/6/13/22527483/microsoft-flight-simulator-xbox-series-x-s-launch\">nearly a year later</a>. It was missing from the Xbox Cloud Gaming part of Xbox Game Pass Ultimate and is now available in the cloud thanks to <a href=\"https://www.theverge.com/2021/10/7/22714067/xbox-cloud-gaming-custom-xbox-series-x-hardware-upgrade\">Xbox Series X hardware upgrades</a> that Microsoft has made to its datacenters. Before the upgrades, Xbox Cloud Gaming (xCloud) was powered by Xbox One S consoles, and the improved hardware has unlocked 1080p and 60fps streams across the service. We’re still waiting on Microsoft to offer 4K streaming, though.</p><p id=\"H962w0\">Xbox Game Pass is also <a href=\"https://news.xbox.com/en-us/2022/03/01/xbox-game-pass-march-update-2022/\">getting some new additions</a> this month. Microsoft is bringing <em>Marvel’s Guardians of the Galaxy </em>and <em>Young Souls </em>to Xbox Game Pass on March 10th. <em>Far: Changing Tides</em> is also launching on the service today.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rgcVn3vTa9Wk8Emc7G6D6Z-BO40=/0x24:1200x652/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23279605/xCloud_Microsoft_Flight_Simulator.jpg",
  "description": "You can access Microsoft Flight Simulator from any device.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}