{
  "title": "Microsoft rebrands its Android Your Phone companion app to Phone Link",
  "url": "https://www.theverge.com/2022/3/31/23004352/microsoft-phone-link-rebranding-windows-11-design-update",
  "date": "2022-03-31T15:00:00.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TNFz5NOaGgTHy7le3FN6UaQjRK0=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70694035/phonelink.0.png\" />        <figcaption><em>Phone Link is the new Your Phone.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"9jMSbT\">Microsoft is rebranding its Your Phone app to Phone Link and updating it with a Windows 11 design overhaul. Your Phone launched more than three years ago as a key way to link an Android phone to Windows and avoid picking up your device to check calls or notifications. Phone Link is naturally a better description for the app, and it has <a href=\"https://blogs.windows.com/windowsexperience/?p=176947\">now been updated</a> to match the Windows 11 design changes.</p><p id=\"dBy9cO\">Phone Link now places the notification panel upfront, and the notifications tab is now pinned to the left-hand side panel. Microsoft has also moved the Messages, Photos, Apps, and Calls sections into a navigation bar that sits at the top of Phone Link. The notifications section has also been cleaned up to make it easier to see the notifications that matter.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yYnL1Nd9r277HwmPYOUQK_O6AAQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23357229/phonelink.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>The new Phone Link interface on Windows 11.</em></figcaption>  </figure><p id=\"DrctR7\">The updated Phone Link app includes a color palette and design that matches Windows 11, with refreshed controls, illustrations, and iconography. The Your Phone Companion app for Android is also being rebranded to Link to Windows, and both apps will share the same icon.</p><p id=\"t8Vbhg\">Beyond the changes in design, Microsoft is also making Phone Link available in China thanks to a partnership with Honor. Phone Link now supports the Honor Magic V, Magic 4 series, and Magic 3 series of devices. Otherwise, the best Phone Link features are still largely limited to Samsung handsets and Microsoft’s Surface Duo devices.</p><p id=\"BhIOyI\">The latest Phone Link update is <a href=\"http://aka.ms/phonelink\">available today</a>, and with the next Windows 11 update, you’ll also be able to enable Phone Link just by scanning a QR code during setup.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zU6W1b0nMxeja5FuG6youJfHBfQ=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23357226/phonelink.png",
  "description": "Phone Link gets some important changes to notifications.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}