{
  "title": "Microsoft pulls the plug on ‘new’ sales of products and services in Russia",
  "url": "https://www.theverge.com/2022/3/4/22961445/microsoft-russia-ukraine-sales-ban-xbox-azure-windows-office",
  "date": "2022-03-04T14:51:25.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/i6cg_K-fmgU7-52bzZnYT0ooeQM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70578703/acastro_180507_1777_microsoft_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"r5ilK9\">In a <a href=\"https://blogs.microsoft.com/on-the-issues/2022/03/04/microsoft-suspends-russia-sales-ukraine-conflict/\">blog post</a> published Friday morning, Microsoft president Brad Smith confirmed the company “will suspend all new sales of Microsoft products and services in Russia.” </p><p id=\"Eamjxd\">It didn’t go into further detail about what that looks like or specify what meaningful financial impact the move will have on its businesses, <a href=\"https://www.theverge.com/2022/3/3/22959975/cd-projekt-red-gog-cuts-off-sales-russia-belarus-mykhailo-fedorov\">as CD Projekt Red did yesterday</a> while announcing a ban on services to Russia and Belarus. In response to a request for more information by <em>The Verge</em>, a spokesperson said the company had nothing more to share at this time.</p><div class=\"c-float-right\"><aside id=\"yyvuHI\"><q>“we are coordinating closely and working in lockstep with the governments of the US, EU, and the UK”</q></aside></div><p id=\"Wmixd8\">Microsoft is only the latest tech company to announce a stop in some of its services to Russia following Russia’s invasion of Ukraine. Since the fighting started, many politicians worldwide have called for bans targeting Russia’s economy and ability to connect to the world, in addition to sanctions on Russian banks and state-operated media outlets.</p><p id=\"r8IJZq\">Microsoft’s announcement targets new sales specifically, leaving existing service contracts unmentioned. The company didn’t go into the reasons behind its decision, but Microsoft’s recent focus on cloud services and support services means that cutting off existing contracts would be particularly devastating for both organizations and individuals using Windows, Office, Microsoft 365, Azure, and even Xbox products in Russia. </p><p id=\"R3ZY8m\">According to Smith, “we are coordinating closely and working in lockstep with the governments of the United States, the European Union and the United Kingdom, and we are stopping many aspects of our business in Russia in compliance with governmental sanctions decisions.” </p><p id=\"GFSnE3\">This is in addition to its cybersecurity efforts, where Smith says, “Since the war began, we have acted against Russian positioning, destructive or disruptive measures against more than 20 Ukrainian government, IT and financial sector organizations. We have also acted against cyberattacks targeting several additional civilian sites. We have publicly raised our concerns that these attacks against civilians violate the Geneva Convention.”</p><p id=\"HL2nXE\">Apple <a href=\"https://www.theverge.com/2022/3/1/22957000/apple-russia-ukraine-invasion-halt-product-sales-app-store\">shut down sales of its products in Russia on March 1st</a>, and Google <a href=\"https://www.theverge.com/2022/3/4/22961302/google-pauses-all-ad-sales-russia-search-youtube\">put a pause on selling ads there</a> as of this morning. The growing list of blocks and bans started small but is slowly putting a digital wall between Russia and companies based in the US and Europe.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_1IPXhdaNmamW8YvuhgVIcjD6vg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10793347/acastro_180507_1777_microsoft_0003.jpg",
  "description": "Microsoft calls Russia’s invasion \"unprovoked and unlawful.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}