{
  "title": "Microsoft announces a new tablet-friendly taskbar for Windows 11",
  "url": "https://www.theverge.com/2022/2/24/22949381/microsoft-windows-11-tablet-touch-friendly-taskbar-changes",
  "date": "2022-02-24T19:01:32.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/m_q4kLRYN2Ohrq9MMCONFXcUYro=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70545845/bfarsace_211004_4777_0007.0.jpg\" />        <figcaption>Photo by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"fmYTnu\">Microsoft is making the Windows 11 taskbar a little more tablet-friendly soon. The software giant has started testing a new taskbar that’s designed for tablet use, with a smaller collapsed state that only shows critical information like the time and date or network and battery status.</p><p id=\"ST9Yrk\">This tablet taskbar looks a lot less cluttered, thanks to app icons, search, Widgets, and the Start button being hidden. A new setting will automatically hide the taskbar when you’re using a device as a tablet, and it will provide more screen space for Windows 11 tablet users. If you wipe up to reveal the full taskbar, the widgets, Start button, search, and app icons are all a lot larger and easier to touch.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qONTbRcG_3oi4mUdb0SZnKJzLSc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23268499/tablet_taskbar_graphic.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>Windows 11’s new tablet taskbar.</em></figcaption>  </figure><p id=\"zzXddx\">Alongside the taskbar changes, Microsoft is also tweaking how widgets work in Windows 11 soon. Today’s new Dev Channel test build also includes more information and dynamic content in widgets. </p><p id=\"0AHhrw\">“This should make it easier for you to discover and engage with new widgets and news content through your feed,” <a href=\"https://blogs.windows.com/windows-insider/2022/02/24/announcing-windows-11-insider-preview-build-22563/\">explains the Windows Insider team</a>. “This release focuses on making widgets discoverable from the feed and over time we plan to make the feed even more personalized.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0XipYK6EjyRm3X5Wu6G5HYl-O58=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23268505/widgetsnew.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>The new widgets changes in Windows 11.</em></figcaption>  </figure><p id=\"njAhWf\">Microsoft is also testing 37 new emoji in Windows 11, including the troll, beans, and melting face emoji that are also making their way to Android, <a href=\"https://www.theverge.com/2022/1/27/22904966/emoji-14-ios-15-4-biting-lip-bubbles-unicode\">iOS</a>, and other platforms with Emoji 14.0. </p><p id=\"rKCO5j\">This latest Windows 11 test build will also include improvements to make it easier to snap the most relevant windows next to each other, with suggested Microsoft Edge tabs appearing in snap assist. You’ll now see the three most recent Edge tabs when you attempt to snap a window, and this can be disabled in the Windows 11 settings section.</p><p id=\"lUS2ii\">As always, these new Windows 11 features will be tested and tweaked and may not appear in the operating system for months. Microsoft’s Windows and devices chief, Panos Panay, revealed recently that the company will <a href=\"https://www.theverge.com/2022/2/15/22934562/microsoft-windows-11-february-2022-update-android-apps-taskbar-improvements\">add more features to Windows 11 in the coming months</a> instead of waiting on a big annual release.</p><p id=\"TEFVKa\">“Over time, you’ll see us release new features into Windows 11 for end users more frequently in addition to our annual update,” says Panay. “We will leverage the variety of update mechanisms we have in place, including servicing and Microsoft Store updates. Our goal is to deliver continuous innovation, providing you with the best experiences year-round.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nHfq7I0ZXRvxvOZ5NCV2FIGp8xk=/0x345:6016x3495/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268499/tablet_taskbar_graphic.png",
  "description": "Tablet mode is back — kind of.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}