{
  "title": "Microsoft’s Adaptive Accessories are designed to be customizable inputs ",
  "url": "https://www.theverge.com/2022/5/10/23064121/microsoft-adaptive-accessories-mouse-buttons-hub-disabilities",
  "date": "2022-05-10T15:00:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H8nXNLSjGa3YrTvNBUXiNgGdNjk=/0x375:9000x6375/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70852395/Microsoft_adaptive_accessories_1_JPEG.0.jpg\" />        <figcaption><em>Microsoft will make an adaptive mouse and buttons.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"WhLF3Q\">Microsoft has <a href=\"https://news.microsoft.com/ability-summit-2022\">announced a lineup of adaptive accessories</a> which are meant to augment or replace the regular keyboards and mice that people with disabilities could struggle to use. The lineup consists of three different devices: the Adaptive Mouse, Adaptive Buttons, and the Adaptive Hub. The mouse and buttons are made to support 3D-printed accessories so you can customize them to work the way you want them to. </p><p id=\"n9eqNN\">The mouse core that houses the buttons and sensor is a small, square-shaped puck that’s designed to clip into a palm rest. The “tail” Microsoft makes for the mouse can act as a palm rest. There’s also a thumb rest that you can flip around, letting you use the mouse with your right or left hand. You can also easily attach 3D-printed tails designed around specific needs. </p><p id=\"dtPqkS\">The adaptive buttons let you add eight programmable inputs to your computer. That doesn’t mean you have to have eight physical buttons, though — the company showed a version with just two large, easy-to-press buttons. But because the mouse can also be used as, say, a joystick or as an eight-way D-pad, Microsoft says you can set the inputs to act as macros or complicated keyboard shortcuts, which could be difficult to execute for those with motor disabilities. And as with the mouse itself, you can also add 3D-printed toppers or accessories to the buttons to make them fit your specific needs.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1NS-9PFt_JBoCH214bG-rXN2nYc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23449029/Microsoft_adaptive_accessories_2.jpg\">      <cite>Image: Microsoft</cite>      <figcaption><em>The Microsoft Adaptive accessories, including the mouse core in the bottom left.</em></figcaption>  </figure><p id=\"xN9NTD\">You can wirelessly connect up to four buttons to the Adaptive Hub, which then sends instructions to your computer or phone. The Hub also has several 3.5mm jacks (we didn’t have an exact number at press time) for connecting wired accessories, like the ones <a href=\"https://www.theverge.com/2019/11/18/20970294/logitech-adaptive-gaming-kit-xbox-controller-microsoft-accessibility-gamers-with-disabilities\">made by Logitech</a> or <a href=\"https://www.theverge.com/2018/5/17/17363964/microsoft-xbox-adaptive-controller-announced-price-release-date\">Microsoft’s Xbox adaptive controller</a> (which itself can <a href=\"https://support.xbox.com/en-US/help/account-profile/accessibility/connect-adaptive-controller-to-pc\">be connected to a PC</a>).</p><p id=\"xUsGhl\">Microsoft says that its adaptive accessories will be launching in the fall, though there isn’t yet info on how much the devices will cost yet. </p><p id=\"RsgWlT\">It’s good to see that Microsoft’s continuing to pay attention to the disability community. Last year, the company released <a href=\"https://www.theverge.com/2021/9/22/22686149/microsoft-surface-adaptive-kit-laptop-accessibility\">its Surface Adaptive Kit</a>, which was designed to make its existing input devices easier to use. And while that’s helpful, there’s always going to be people who would have difficulties using traditional input devices at all. For them, Microsoft’s adaptive accessories could be really helpful, provided they come at a reasonable price and see enough adoption so that designs and parts for them are easy to find.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XHDtORb_KdtQ-Kij5gQHIBrF1eU=/0x1019:9000x5731/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23449059/Microsoft_adaptive_accessories_1_JPEG.jpg",
  "description": "They’re designed to fit with 3D-printed add-ons.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}