{
  "title": "Microsoft and Amazon are battling to entice game developers to the cloud",
  "url": "https://www.theverge.com/2022/3/23/22992432/microsoft-azure-game-dev-vm-amazon-aws-for-games",
  "date": "2022-03-23T18:00:00.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MrAVaO4Q7SlVm45LHplBMjVQm2s=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70662584/acastro_210429_1777_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"TWaxjg\">Microsoft and Amazon are both appearing at the Game Developers Conference (GDC) this week with a simple pitch: use our cloud services to build your game. Both companies have been battling to get businesses to switch to the cloud in recent years, and now the focus is truly on game developers during a pandemic that has challenged the norms of creating games.</p><p id=\"t8VKQU\">“Every few years, the games industry undergoes a transformation — a reinvention of itself,” says Sarah Bond, corporate vice president of game creator experience and ecosystem at Microsoft. “New platforms and new technologies make way for new genres, new gameplay and new IP. Today, we’re in the midst of one of those transformative moments.”</p><p id=\"SNjWhy\">Amazon agrees. “Game developers are embracing industry-wide transformation,” says Chris Lee, head of game tech services at Amazon. </p><p id=\"f8Z7KN\">While Microsoft and Amazon have been trying to entice game developers over to their cloud services for years, they’re both making an even bigger push in 2022. Amazon is launching AWS for Games today, a collection of AWS services and solutions that will help developers build, test, and even grow their games. At the same time, Microsoft is launching Azure Game Development Virtual Machine to allow developers to build games on powerful PCs in the cloud.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JbmRal6kPm5J2gszXoCaxz_m6kg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339169/igEKU2l.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>Some of the games that run on Azure PlayFab.</em></figcaption>  </figure><p id=\"vdAMEz\">Game studios, both big and small, have struggled to shift to remote game production, and in the early days of the pandemic, developers had to <a href=\"https://www.theverge.com/2020/4/16/21222465/coronavirus-game-developers-work-from-home-bungie-riot\">learn how to make games from home</a>. That’s led to stories of developers lugging huge gaming PCs and testing rigs home, a frantic rush to get laptops for developers, or even <a href=\"https://youtu.be/ENNWGpvoIxY\">studios like Bungie</a> relying on Google Stadia to test big game releases like <em>Destiny 2: The Witch Queen </em>remotely.</p><p id=\"GtEatc\">Amazon already offers cloud game development workstations and virtual machines, and Microsoft’s new Azure Game Development Virtual Machine is the company’s own take on game production in the cloud. It’s an Azure offering that includes powerful compute and graphics processing paired with tools like Visual Studio, Unreal Engine, Parsec, Blender, and much more. Both Microsoft and Amazon’s offerings are designed for game studios to quickly spin up powerful PCs in the cloud to develop and test games from anywhere.</p><p id=\"aKN3HX\">Amazon is also making it easy for game developers to add its new GameSparks SDK to game clients to handle things like messaging or authentication. AWS GameKit is also launching today as an open-source solution for game developers to add cloud-based features like game saves or achievements to games. Microsoft has similar tools under its Azure PlayFab product, designed specifically for game studios to build and run live games. Some big games like <em>Roblox</em>, <em>Tom Clancy’s Rainbow Six Siege</em>, and Microsoft-owned <em>Minecraft </em>all use PlayFab.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Uzryyitl0RC42n-0xZLLppa4Duo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339173/2MPZW9w.jpeg\">      <cite>Image: Bungie</cite>      <figcaption><em>A Bungie developer working from home.</em></figcaption>  </figure><p id=\"SFJAY5\">Microsoft is also launching ID@Azure today, designed to entice independent game developers to use the company’s cloud services. ID@Azure includes free tools and resources for independent game developers and even up to $5,000 in Azure credits. Microsoft doesn’t care whether developers are building a Nintendo Switch game, something for the PS5, or an Xbox and PC title — the cloud services are there regardless.</p><p id=\"dLJSYf\">All of these announcements come as both Microsoft and Amazon seek to further capitalize on game studios moving to the cloud and adopting AI and machine learning. Amazon claims 90 percent of the largest game companies are already building with AWS, while Microsoft points to all of its first-party studio games now using Azure PlayFab. It looks like the battle for the future of game development is truly on.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jhUjLv0PgI9EVx6dTSB6j28bsf0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22478772/acastro_210429_1777_0003.jpg",
  "description": "Two tech giants are focused on games in the cloud this year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}