{
  "title": "Microsoft to block Office VBA macros by default",
  "url": "https://www.theverge.com/2022/2/7/22922032/microsoft-block-office-vba-macros-default-change",
  "date": "2022-02-07T18:23:42.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rMl-jztG2YxNPFxu1GSvfp0yB1Q=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70480502/acastro_180226_0001.0.jpg\" />        <figcaption>Image by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"BZD6P5\">Microsoft is finally planning to block Visual Basic for Applications (VBA) macros by default in a variety of Office apps. The change will apply to Office files that are downloaded from the internet and include macros, so Office users will no longer be able to enable certain content with a simple click of a button.</p><p id=\"n9kN7t\">“The default is more secure and is expected to keep more users safe including home users and information workers in managed organizations,” <a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/helping-users-stay-safe-blocking-internet-macros-by-default-in/ba-p/3071805\">explains Kellie Eickmeyer</a>, a principal PM at Microsoft.</p><div class=\"c-float-right\"><aside id=\"HL9EIz\"><q>Macros can be a security headache for IT admins</q></aside></div><p id=\"dHOory\">Hackers have been targeting Office documents with malicious macros for years, and while Office has long prompted users to click to enable macros running, this simple button could lead to “severe including malware, compromised identity, data loss, and remote access.” Instead of a button, a security risk banner will appear with a link to a Microsoft support article, but no easy way to enable macros.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HXH1TRHWoRC6AslN-BTDcFYsbv0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23223972/VBAMacrosBlockedTrustBar.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>Microsoft’s new security banner.</em></figcaption>  </figure><p id=\"IO0jaZ\">Microsoft is planning to preview the change with its Current Channel (Preview) users in early April, before rolling out to its regular Microsoft 365 customers. The change to block VBA macros from the web will affect Access, Excel, PowerPoint, Visio, and Word on Windows. Microsoft also plans to update Office LTSC, Office 2021, Office 2019, Office 2016, and even Office 2013 to block internet VBA macros.</p><p id=\"1dAL9v\">This is a big change that could impact a lot of genuine use cases for VBA macros, and it means that Office users will only be able to enable the macros by specifically ticking an unblock option on the properties of a file. That’s a lot more steps than usual, and ones that Microsoft is hoping will help prevent security issues in the future.</p><p id=\"rGslkG\">“Macros account for about 25 percent of all ransomware entry,” explains security researcher and former Microsoft employee <a href=\"https://twitter.com/GossiTheDog/status/1490740535849623552\">Kevin Beaumont</a>. “Keep derisking macros and macro functions. It’s really important. Thank you all the people behind the scenes doing this.” Marcus Hutchins, a security researcher best known for halting the global WannaCry malware attack, also <a href=\"https://twitter.com/MalwareTechBlog/status/1490749863750823939\">celebrated Microsoft’s changes</a> but noted the company has “decided to do the bare minimum” after years of malware infections.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hpes8tr1sPZGMmIaIUT1aJhlAdI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10300141/acastro_180226_0001.jpg",
  "description": "It’s a new security push from Microsoft.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}