{
  "title": "MIT is reinstating SAT and ACT requirements for incoming students",
  "url": "https://www.theverge.com/2022/3/28/23000545/mit-sat-act-standardized-test-coronavirus-pandemic",
  "date": "2022-03-28T22:57:30.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"MIT campus\" src=\"https://cdn.vox-cdn.com/thumbor/VjWba28TtK9nHAum5sTS5Vgn5Mg=/0x0:5095x3397/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70682894/1255079629.0.jpg\" />        <figcaption>MIT will once again require standardized test scores for admission | Photo by Maddie Meyer/Getty Images</figcaption>    </figure>  <p id=\"5RqDQq\">The Massachusetts Institute of Technology (MIT) said Monday it’s reinstating requirements that students provide scores from the SAT or ACT standardized tests for future admissions. At the start of the pandemic, many schools waived standardized test requirements for incoming students or, like MIT, made reporting them <a href=\"https://mitadmissions.org/blogs/entry/we-are-suspending-our-sat-act-requirement-for-the-2020-2021-application-cycle/\">optional.</a> </p><p id=\"dcY3zE\">The temporary change was meant to relieve some of the unprecedented stresses and obstacles students graduating from US high schools in 2020, 2021, and 2022 were facing. In 2020, the <a href=\"https://newsroom.collegeboard.org/college-board-asks-colleges-show-flexibility-admissions-year-reduce-stress-students-citing\">College Board, which administers the SAT</a>, said millions of students had been unable to take the test as scheduled in the spring of 2020 due to COVID-19 restrictions. It asked colleges and universities to be flexible in their admissions processes. The nonprofit that administers the ACT admissions test also <a href=\"https://leadershipblog.act.org/2020/07/act-postpones-online-testing-for-fall.html\">announced disruptions</a> for students taking that test. </p><div class=\"c-float-right\"><aside id=\"vuKT7j\"><q>The SAT plans to go all-digital for US students in 2024</q></aside></div><p id=\"CVFIQO\">But MIT Dean of Admissions and Student Financial Services Stu Schmill wrote in a new blog post that its assessment of incoming students is improved when it has access to the students’ test results.</p><p id=\"7WgLb9\">“Our research shows standardized tests help us better assess the academic preparedness of all applicants, and also help us identify socioeconomically disadvantaged students who lack access to advanced coursework or other enrichment opportunities that would otherwise demonstrate their readiness for MIT,” Schmill wrote. “We believe a requirement is more equitable and transparent than a test-optional policy.” He added that standardized test performance “is not the central focus of our holistic admissions process,” and said MIT will give consideration to students who may still be unable to safely take one of the standardized tests. </p><p id=\"zQxKyC\">It remains to be seen how many other schools may follow MIT’s example and reinstate their own standardized test requirements. According to nonprofit education organization FairTest, more than <a href=\"https://www.fairtest.org/more-1815-schools-do-not-require-actsat-scores-cur\">1,800 schools made standardized test scores an optional part</a> of their admissions process for the high school class of 2022. </p><p id=\"jRapuu\">The College Board has also tried to make taking the SAT more practical in other ways. The organization <a href=\"https://newsroom.collegeboard.org/digital-sat-brings-student-friendly-changes-test-experience\">said in January</a> that it’s doing away with the old-fashioned pencil and paper exams, and will go all-digital for future tests, starting in 2024 in the US and 2023 for other countries. Students will take the test at testing centers, and the length of time to take the test will be reduced from three hours to two hours. The College Board also said it will allow more time per question, and reading passages “will reflect a wider range of topics that represent the works students read in college.” Calculators will be allowed during the SAT’s math section, and the test results will be available to students more quickly.  </p><p id=\"0xDfyJ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/TFcqBBuQlgfdV8AWiWBAwweR_9M=/0x349:5095x3017/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23351400/1255079629.jpg",
  "description": "The school says the tests help more fully assess applicants",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}