{
  "title": "MLB The Show is making its Nintendo Switch debut on April 5th",
  "url": "https://www.theverge.com/2022/1/31/22910793/mlb-the-show-nintendo-switch-release-date-port-april-5th",
  "date": "2022-01-31T18:26:01.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uTLCZbKLiTub1weqpMS0OIeKpjY=/128x0:1505x918/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70453945/ce8f795665cb5abb0ba190973dbd4b80fb25ecb4.0.png\" />    </figure>  <p id=\"Fswk81\"><em>MLB The Show </em>made its <a href=\"https://www.theverge.com/2021/2/1/22260091/mlb-the-show-21-playstation-ps5-xbox-series-x-s-release-date\">debut on Xbox last year</a>, and it’s now making its way to the Nintendo Switch. <em>MLB The Show 22 </em>will be released on April 5th on PlayStation 4, PlayStation 5, Nintendo Switch, Xbox One, and Xbox Series X / S. This is the first entry in the <em>MLB The Show</em> series for Nintendo’s Switch console, and it will include full cross-platform progression, cross-saves, and online multiplayer between PlayStation, Xbox, and Switch consoles.</p><p id=\"X27k9Q\">The cover athlete this year is Shohei Ohtani, who had an incredible 2021, hitting 46 home runs and 100 runs batted in. The Japanese baseball star is “the only obvious choice to grace the cover of <em>MLB The Show 22,” </em><a href=\"https://blog.playstation.com/2022/01/31/shohei-ohtani-unanimous-al-mvp-is-your-mlb-the-show-22-cover-athlete/\">says Ramone Russell</a>, brand strategist at Sony’s San Diego studio, on the PlayStation blog.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ta-Rk6qmOzv3ENQp1wCxz0w3JbE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23207583/ce8f795665cb5abb0ba190973dbd4b80fb25ecb4.png\">      <cite>Image: Sony</cite>      <figcaption><em>Shohei Ohtani is 2022’s cover athlete.</em></figcaption>  </figure><p id=\"7tUdMr\">Nintendo Switch owners will be pleased to hear <em>MLB The Show </em>is making its way to the Switch, especially after seeing it arrive on Xbox last year and previously needing to play the game on PlayStation for years. “This is a very exciting moment for all of us, as the storied franchise continues to welcome more players,” says Russell. </p><p id=\"8uutd7\">The standard editions of the game are priced at $59.99 on Xbox One, Nintendo Switch, and PS4. The same standard edition will be priced at $69.99 on the PS5 and Xbox Series X / S. If you purchase the PS4 edition and are planning to upgrade to a PS5, you’ll need to purchase the digital edition to take advantage of a $10 upgrade offer. </p><p id=\"WLcXuK\">Collector’s editions of <em>MLB The Show 22</em> will also be revealed later this week, and will include dual entitlement to both last-gen and current-gen versions of the game. Microsoft has <a href=\"https://news.xbox.com/en-us/2022/01/31/mlb-the-show-22-cover-athlete-and-xbox-game-pass-announce/\">also announced</a> that <em>MLB The Show 22 </em>will be available day one on Xbox Game Pass.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YUrlKkGnt9M2OfPwrVo2EfR6oVI=/0x32:1632x886/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23207583/ce8f795665cb5abb0ba190973dbd4b80fb25ecb4.png",
  "description": "A year after MLB The Show debuted on Xbox",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}