{
  "title": "Moon Knight ends strong by getting straight to the action",
  "url": "https://www.theverge.com/23056704/moon-knight-season-1-finale-review-marvel-disney-plus",
  "date": "2022-05-04T17:02:25.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/iW1nVleGl4WKxPbWYrZsRKlmy88=/290x0:2702x1608/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70831879/etk0390_105_comp_bas_v0023_3543e57e.5.jpeg\" />        <figcaption>Image: Marvel Studios</figcaption>    </figure>  <p id=\"gk6V5l\">Marvel’s <em>Moon Knight</em> has taken a meandering path to its big, boisterous finale. Over the first five episodes, there have been detours into the afterlife, the fractured psyche of <a href=\"https://www.theverge.com/2022/4/27/23031165/moon-knight-dissociative-identity-disorder-marvel-disney-plus\">a man suffering from dissociative identity disorder</a>, and locales ranging from the great pyramids of Egypt to a museum gift shop in London. It’s been about as confusing and disjointed as you’d expect for a show about a mercenary possessed by the spirit of an ancient, vengeful god. After all, the show has had to explain <em>a lot</em>: the history behind the multiple personalities; the motivations of two competing, powerful deities; the machinations of a cult-like militant organization. There’s even a backstory for a seemingly innocuous catchphrase.</p><p id=\"YfPt0C\">If you stuck it out, though, the finale moves past most of that to focus on some good old fashioned MCU action — though it also hints at even more confusion to come.</p><p id=\"VURNYh\"><em>This article contains spoilers for the first season of </em>Moon Knight<em>.</em></p><div class=\"c-float-right\"><div id=\"ONAj7P\"><div data-anthem-component=\"aside:11176395\"></div></div></div><p id=\"hFClQc\">For those catching up, <em>Moon Knight </em>follows Marc Spector and Steven Grant (both played by Oscar Isaac) as two personalities sharing the same body. Marc is an American mercenary who is also the avatar of Khonshu (F. Murray Abraham), a moon god with confidence issues and a strong desire to kill any evil-doer. Steven, in contrast, is a mild-mannered employee at a London gift shop with <a href=\"https://www.theverge.com/22889548/marvel-moon-knight-trailer-english-accent-villains\">a curious accent</a> and a lot of holes in his memory.</p><p id=\"WnVXTx\">In addition to being a story about the Moon Knight’s two opposing personalities, the show is also about two opposing concepts of justice. Khonshu uses Marc to kill evil-doers after the fact. But Arthur Harrow (Ethan Hawke) is the leader of a group of zealots that worship the goddess Ammit and believe that she can decide if someone is good or evil before they commit an act.<strong> </strong>It’s kind of like an ancient version of the precogs from <em>Minority Report</em>. It’s also an idea of justice that means lots of seemingly innocent people are killed for reasons they don’t understand. While Harrow is able to use something called the scales of justice to judge people, his ultimate goal is to revive Ammit and let her cause some real destruction.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/u4VMHqrOLpd73z_SyRa-IScB0_g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23437378/etk0390_105_comp_bas_v0023_3543e57e.jpeg\">      <cite>Image: Marvel Studios</cite>      <figcaption><em>Khonshu and Marc’s version of the Moon Knight.</em></figcaption>  </figure><p id=\"AL4h8c\">Which is all to say there’s a lot going on, and the first five episodes don’t always explain things in a smooth or coherent way. The confusion may be intentional given the premise of the show, but it doesn’t always make for the best TV. In the penultimate episode, for instance, viewers learn some important and occasionally upsetting details about Marc’s life that help clarify who he is as well as his relationship with Steven. We even learn about that accent. But it’s told through a contrived setup that involves Marc exploring his memories in order to balance his heart for entrance to the afterlife. Rather than a deep exploration of the pair’s past, it comes off like a strange quest to collect the right number of memories before you can move on to the final level.</p><p id=\"qWWB3y\">Still, uneven as those episodes were, they left the finale in a pretty good place. With most of the explanations out of the way, the sixth and final episode of <em>Moon Knight</em> becomes an action-packed spectacle. There are two main battles going on. A newly-revived Marc / Steven takes up the Moon Knight mantle again to fight Harrow, now in possession of a powerful weapon that helps even the odds, while his acolytes start judging everyone in Cairo, resulting in a wave of deaths. Marc’s wife, Layla El-Faouly (May Calamawy), teams up with the hippo goddess Taweret (Antonia Salib) to become a superhero herself. At the same time, the gods Khonshu and Ammit (now successfully brought to Earth) have grown huge and are battling across the city like Godzilla and King Kong wreaking havoc on Tokyo.</p><p id=\"ivHItA\">It’s a hectic battle, which in the MCU often means confusing action sequences filled with lots of glowy magical superpowers blasting everywhere. Despite all of its supernatural elements — and the two massive gods — <em>Moon Knight</em>’s action feels surprisingly grounded and easy to follow. More importantly, it’s <em>fun</em>. Layla is able to be a key part of the action after spending most of the season on the sidelines, while Marc and Steven manage to finally work together to satisfying effect. The show also does a great job of jumping between two very different scales of battle. <em>Moon Knight</em> is a goofy mix of superheroes and ancient gods, and the finale makes that as entertaining as it should be.</p><p id=\"m7HAnZ\">Really, the finale made me wish <em>Moon Knight</em> was a solid two-hour movie instead of a prolonged mini-series, something with a better balance between introspection and action. <a href=\"https://www.theverge.com/22999812/moon-knight-review\">It starts out interesting</a> but gets bogged down in minutia in the middle before coming out strong at the end. Disney hasn’t confirmed whether there will be a second season of the show, though the post-credits scene makes it clear there’s at least one more mystery to explore, as is the Marvel way. What form that takes is unclear. But hopefully now that (most) of the setup is done, Marc and Steven have some more interesting adventures ahead of them.</p><p id=\"0fcu2R\"><small><em>The first season of</em></small><small> Moon Knight </small><small><em>is streaming now on Disney Plus.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/X0aUHCFCWF3VftiOGUBadFbUnQs=/385x0:3456x1608/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437218/emt1010_105_comp_fra_v0090_71d72d8d.jpeg",
  "description": "A solid finale after a rocky season.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}