{
  "title": "Moonfall is a hollow, galaxy-brained spectacle",
  "url": "https://www.theverge.com/22915761/moonfall-review-roland-emmerich",
  "date": "2022-02-03T18:10:23.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Astronauts Jocinda Fowler and Brian Harper in Moonfall gazing at the destruction the moon has wrought on the Earth.\" src=\"https://cdn.vox-cdn.com/thumbor/h-HgCbr_Q-NPz8UhGahlBTFECHg=/84x0:1595x1007/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70467466/moonfall_gallery_06.0.jpeg\" />        <figcaption>Halle Berry as Jocinda Fowler and Patrick Wilson as Brian Harper in Moonfall. | Lionsgate</figcaption>    </figure>  <p id=\"pD6jJz\">For movies like <a href=\"https://www.theverge.com/2021/9/2/22654021/moonfall-trailer-date-halle-berry-roland-emmerich\">Roland Emmerich’s <em>Moonfall</em></a> that are ostensibly about mysteries meant to keep you guessing, it’s never a good sign when the studios behind them more or less spoil their own plots with overstuffed trailers. If you’ve caught any of <a href=\"https://www.theverge.com/2021/9/5/22658609/new-trailers-moonfall-the-wheel-of-time-belfast-no-time-to-die-amazon\"><em>Moonfall</em>’s bombastic TV spots</a> or seen some of its busier print ads, you’ll probably see each of the film’s uninspired twists coming long before any of its characters do. But that might not be enough to prepare you for how breathtakingly bad <em>Moonfall </em>— a movie that feels like it could have been great — ends up being.</p><p id=\"b9i2pR\">Like many of Emmerich’s far better action / disaster epics, <em>Moonfall</em>’s story orbits around a small group of embattled heroes who step up to the challenge of saving humanity when no one else will. During a routine space station repair mission years before the Moon begins its titular descent of destruction, astronauts Jocinda Fowler (Halle Berry) and Brian Harper (Patrick Wilson) become the only two survivors of a seemingly chance encounter with a mysterious force that swims through the void like a sentient cloud reminiscent of <em>Fantastic Four: Rise of the Silver Surfer’s </em>Galactus. Because Fowler’s almost immediately knocked out when a wave of debris causes their spacecraft to begin to spin wildly, she has no real recollection of what happened or how Harper managed to safely stabilize them using only their ship’s auxiliary thrusters.</p>  <figure class=\"e-image\">        <img alt=\"Harper and Fowler’s space shuttle in orbit around the Earth with the moon looming in the background.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RwOr-l42R7z6E9BEkWzbmgvvwAw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215865/moonfall_gallery_03.jpeg\">      <cite>Lionsgate</cite>      <figcaption>Harper and Fowler’s space shuttle in orbit around the Earth.</figcaption>  </figure><p id=\"3S3T6S\">Though neither Berry nor Wilson convey it all that well through their performances, <em>Moonfall </em>vaguely gestures towards the idea of how their ordeal in space derailed their lives following their eventual return to Earth, where they were met with confusion and questions they simply had no real answers for. As <em>Moonfall</em>’s central story in the present day kicks off, Fowler’s still working with NASA, and Harper’s become the sort of disgraced space hero who lives right next to observatories just so that he can show up to them late for scheduled appearances to speak with schoolchildren. </p><p id=\"uA3GZo\">Under any other circumstances, the two astronauts might have wound up toiling away in obscurity with no understanding of their connection to the imminent danger the Earth is in when the Moon’s orbit begins to shift. Their fates take a turn, however, when Harper’s accosted by KC Houseman (John Bradley), a SpaceX stan and amateur astronomer who literally asks himself “what would Elon do?” at one point in the film and is somehow able to gain access to classified information about what’s happening to the Moon while slacking off at his day job at a drive-through deli.</p><p id=\"0FuRiY\">By the time that <em>Moonfall </em>starts to pull its central trio of characters together in order for them to become its heroes, the initial dangerous consequences of the Moon’s descent have already begun, and for a brief moment, it seems almost like the movie’s about to put itself on the right course. The Moon’s new proximity to the Earth and the altered gravitational pull between the two celestial bodies begin to manifest as alarming and promising Emmerichian set pieces like the sudden flooding of North America’s coasts as the seas rise and become unnaturally erratic. But whenever <em>Moonfall </em>gets too busy with being interesting, it repeatedly stops to introduce multiple thinly-fleshed out characters like Harper’s wayward son Sonny (Charlie Plummer) and Fowler’s military general ex-husband Doug (Eme Ikwuakor), who serve no real purpose other than to deliver stilted lines that pull focus from what audiences actually show up to these sorts of movies to see.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gxm_hWFtUFdJDcn6cB2ESiAh4VE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215869/moonfall_gallery_07.jpeg\">      <cite>Lionsgate</cite>      <figcaption>Moonfall’s blood moon rising once again.</figcaption>  </figure><p id=\"8AE4LV\">As a movie about the Moon seemingly deciding to ram itself into the Earth and humanity struggling to save itself from destruction, <em>Moonfall </em>is surprisingly light on sustained sequences that make you feel just how dire and fundamentally hopeless that sort of situation might actually feel. While you might come into <em>Moonfall </em>expecting for it to evoke an almost <em>Majora’s Mask</em>-like ever-present sense of dread, it actually ends up having a bit more in common with <em>Breath of the Wild</em>: a game in which you can stand around and do nothing until the evil Moon comes back around on an accelerated timeline to mess up your peace and quiet.</p><p id=\"sUgQAd\">In its final third, <em>Moonfall </em>almost seems to gain a new level of self-awareness about how paltry its internal sense of logic is. But rather than bothering to course correct, Emmerich and co-writers Harald Kloser and Spenser Cohen’s script piles on even more nonsense that doesn’t work as dumb fun because of how hollow and airless the movie is as a whole. While budding conspiracy theorists may get a kick out of the handful of bones <em>Moonfall </em>tosses them in its pursuit of subreddit stardom with the anti-science set, it’s fair to say that the movie’s a miss and then some, which is wild given how easy a target this should have been to hit.</p><p id=\"12Kkzv\"><small>Moonfall</small><small><em> hits theaters on February 4th.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/v4ZLUajhTD8JR0kX_b82Jg_u4fc=/84x0:1701x847/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215076/moonfall_gallery_06.jpeg",
  "description": "Roland Emmerich’s Moonfall is a hollow bore for the conspiracy theory set.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}