{
  "title": "Morbius is one long quick time event about battling bad habits",
  "url": "https://www.theverge.com/23003719/morbius-review-jared-leto",
  "date": "2022-03-31T18:56:07.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Michael Morbius standing in a freezer full of blood bags as his vampiric side struggles to break free.\" src=\"https://cdn.vox-cdn.com/thumbor/MeITPqhk37WWwNvGXxOLe4IdEPs=/0x0:2682x1788/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70695167/MORBIUS_Trailer_02_cp.0.jpg\" />        <figcaption>Jared Leto as Michael Morbius, the Living Vampire. | Columbia Pictures</figcaption>    </figure>  <p>Sony’s latest Spider-Man villain feature will drain you</p> <p class=\"p--has-dropcap\" id=\"JyDUtI\">One of the reasons Sony keeps making <a href=\"https://www.theverge.com/2020/1/13/21062568/morbius-trailer-jared-leto-marvel-sony-pictures-venom-michael-keaton-vulture\">movies like <em>Morbius</em></a> — another <a href=\"https://www.theverge.com/2018/10/2/17929154/venom-movie-review-tom-hardy-marvel\"><em>Venom</em></a>-like feature about <a href=\"https://www.theverge.com/2017/3/28/15086734/spider-man-homecoming-trailer-vulture-michael-keaton\">a classic Spider-Man villain</a> that doesn’t actually <a href=\"https://www.theverge.com/2021/11/29/22807636/tom-holland-spider-man-trilogy-marvel-mcu-sony-pictures-amy-pascal\">involve Spider-Man</a> at all — is that, over in Marvel’s comics, many have led interesting lives outside of the time they’ve spent battling the quippiest Avenger. There is more to Michael Morbius than his run-ins with Peter Parker, and <a href=\"https://www.theverge.com/2017/3/24/15049350/life-movie-review-daniel-espinosa-jake-gyllenhaal-ryan-reynolds-space-horror\">director Daniel Espinosa</a> obviously wanted his new film to illustrate that fact. Unfortunately, most everything about <em>Morbius, </em>from its plot and pacing to its lead actors’ performances, feels ill-conceived. And the movie as a whole calls into question Sony’s grand project of <a href=\"https://gizmodo.com/spumc-1843200536\">building an entire cinematic universe</a> on Spider-Man’s back.</p><p id=\"IP1I0n\"><em>Morbius </em>dives headfirst into the already-in-progress origin story of its titular ghoul, Michael Morbius (Jared Leto), a brilliant scientist and lifelong sufferer of a chronic blood disorder. Though Morbius has found success and fame, thanks to his creation of a synthetic blood-like substance that revolutionized medicine, he would give all of it up in a heartbeat if it meant being able to restore both his own health and that of his extravagantly wealthy childhood friend, Lucien (Matt Smith), who suffers from the same blood disorder. </p><p id=\"XhA7p5\">Morbius’ deep affection for Lucien — who begrudgingly accepts being called “Milo” after Morbius saves his life in a flashback to their youth — is why the film opens on him journeying to Costa Rica in search of a remote cave filled with vampire bats. After years of researching in vain to find a cure for their disease, Morbius strongly believes that by isolating certain elements of vampire DNA and mixing it with his own, he might be able to combat the degenerative effects of his condition. <em>Morbius </em>doesn’t really try to detail how bat DNA is supposed to factor into Morbius’ condition or explain how he manages to transport hundreds of bats back to his laboratory after willingly walking into a swarm of them in the dramatic scene from the movie’s trailers. All <em>Morbius </em>wants is for you to understand that, batshit as it seems, Morbius’ idea works — at first, just with animal test subjects, but soon, with him as well.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SZH-ZDFAiKqVJGb6H5RKUKZU5uY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23358045/img7.jpeg\">  </figure><p id=\"3mZ2cz\">One could be forgiven for not immediately noticing it, but a surprising amount of <em>Morbius</em>’ major beats are pulled from <a href=\"https://www.polygon.com/2018/6/27/17511010/spider-man-morbius-movie-powers-jared-leto\">his early appearances in <em>The Amazing Spider-Man</em></a><em> </em>during the early ’70s. This is when the Comics Code Authority’s ban on supernatural creatures first lifted, freeing Marvel up to create characters like a “living vampire.” Like in the comics, Morbius’ treatment and transformation take place on a boat while his colleague Martine Bancroft (Adria Arjona) and a group of hired soldiers watch over him, and everyone save for Martine ends up dead and drained of their blood after Morbius becomes a vampire. Unlike Marvel’s early comics featuring Morbius, though, which tended to skew a bit more whimsical and focus on the fact that Spider-Man had six arms at the time, <em>Morbius </em>takes itself so seriously that it’s just shy of laughable.</p><p id=\"Np53O1\">For a time, <em>Morbius </em>attempts to style itself as a horror about a mad scientist battling against the monster of his own making that lives inside him. As fantastic as his new bat-enhanced physiology is, it comes at the cost of a powerful hunger for blood that often plays like addiction. It makes Morbius realize that, through his self-experimentation, he’s traded one kind of ailment for another. One of <em>Morbius</em>’ few genuinely interesting ideas comes in the form of bags of blue synthetic blood that are always on hand in the scientist’s lab and easy enough to find in any of the city’s ambulances. </p><p id=\"HaECQH\">Because Morbius can feel how his bloodlust drives him to kill, he sates his hunger by guzzling heavy hits of the cerulean liquid in scenes that feel cribbed from <em>True Blood</em>’s old playbook — making fake blood look like the most delicious thing in the world. In another universe, <em>Morbius </em>would<em> </em>dig a bit deeper into what might have been an interesting premise: the eccentric founder of a synthetic blood company becomes a pseudo-vampire who also moonlights as a superhero. But in this universe, the movie opts for the road more traveled — one paved with flashy VFX, opaque character motivations, and a climactic action sequence that plays like an overlong quick time event.</p><p id=\"HcmZRX\">Super science in pursuit of curing ailments gone wrong is not unique to Morbius the character. But what does feel distinct to <em>Morbius </em>as a movie is the degree to which it’s willing to depict disabled people as frail, weak victims whose entire lives are defined in relation to the able-bodied. Whereas the Morbius of the comics is just straight-up a vampire whose power weakens when he’s hungry or in direct sunlight, <em>Morbius</em>’ version of the character becomes more feral, and his paraplegic symptoms come back with a vengeance. From the very first moment you see them on-screen, it is often difficult watching Leto and Smith affecting disabilities they do not have. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KtPUMqLwLwjFV3tgirpcCJWHkqQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23358042/mor_dtlr7_still_02.jpg\">  </figure><p id=\"SfkCE6\">It is wholly unsurprising when Lucian / Milo is “revealed” to be <em>Morbius</em>’ version of a big bad, and after a bit of slap-fighting with their new vampire powers, he and Morbius reach an emotional impasse because of their differing senses of right and wrong. Something else that’s notable about <em>Morbius</em> is how the movie sort of sidelines Michael’s canonical romance with Martine in favor of focusing on the friendship he shares with Lucian / Milo. More Robert Pattinson in <em>The Batman </em>than himself in <em>WeCrashed</em>, Leto consistently plays Morbius like a brooding recluse of few words, and Smith’s Lucian / Milo shifts between simpering dandy and obtuse <em>Doctor Who </em>villain over the course of the movie. Nothing in particular about the two actors’ performances sells you on the idea of them being friends. But there is something about the way the script wraps them up in each other’s lives that smacks of the subtextual queerness often present in vampire narratives.</p><p id=\"RD2P4C\">Perhaps what’s most unfortunate about <em>Morbius </em>is how, despite not working at all as its own movie, you can see how many pieces of its story could readily lend themselves to much better projects — and not just features that would involve Jared Leto fighting Tom Holland. Inexplicable as the trails of colored smoke that follow Morbius around as he’s flipping through the air, some of his smaller, more acrobatic fight scenes are pretty cool. (And <em>Morbius </em>actually does a much better job than the <em>Venom </em>movies of giving you the sense that it takes place in a larger world rather than a metropolitan bubble.)</p><p id=\"Nd8U9v\">The problem, at least in Morbius’ case, is that it’s entirely too aware of its existence within a cinematic universe of the Schrodinger variety — one that both does and does not exist. In the end, that awareness feels like it might be responsible for how <em>Morbius </em>closes out feeling both distinctly pleased with and ashamed for even daring to utter Spider-Man’s box office-breaking name. The implication, of course, being that <a href=\"https://variety.com/2022/film/news/kraven-the-hunter-christopher-abbott-everything-we-know-aaron-taylor-johnson-1235196638/\">Sony’s not through yet</a>.</p><p class=\"c-end-para\" id=\"exzcXc\"><small><em>Morbius </em></small><small>also stars Tyrese Gibson, Al Madrigal, Charlie Shotwell, Jared Harris, and Michael Keaton. The movie hits theaters on April 1st.</small></p><p id=\"J5EGkQ\"></p><p id=\"He9Cxr\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/U7fM4yg83l1opa_muyDI56lZR5U=/0x327:2790x1788/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23356402/MORBIUS_Trailer_02_cp.jpg",
  "description": "Director Daniel Espinosa’s Morbius",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}