{
  "title": "More than 50 gig workers have been killed while working in the US since 2017 ",
  "url": "https://www.theverge.com/2022/4/6/23012229/rideshare-delivery-drivers-killed-gig-workers-death",
  "date": "2022-04-06T15:00:00.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"App driver pick up and drop off\" src=\"https://cdn.vox-cdn.com/thumbor/fL3484COTpQe-7Aq1oPTI-rh0Ec=/0x0:2000x1333/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70716792/1335977295.0.jpg\" />        <figcaption>A new report highlights the dangers of driving for gig companies.  | Staff Photo By Stuart Cahill/MediaNews Group/Boston Herald</figcaption>    </figure>  <p id=\"RVDAOB\">Isabella Lewis was driving for Lyft on a Sunday in Plano, Texas, last August when she was <a href=\"https://www.fox4news.com/news/private-vigil-planned-for-garland-lyft-driver-killed-by-suspected-terrorist\">carjacked and killed by her passenger</a>. As her family tried to piece together what happened, they kept receiving calls from an insurance company they didn’t recognize, but finally realized it was Lyft’s insurer, who wanted to inspect Lewis’ car in order to determine whether it would pay to fix the damaged windshield and clean up her blood. </p><p id=\"M8Dnne\">To date, however, her family says it has not had any communication from anyone with Lyft’s corporate office.</p><p id=\"kwIaF0\">“The only thing we have heard from Lyft is when they said in the Dallas newspaper that their hearts were with us,” Lewis’ sister Allyssa said in an interview with <em>The Verge</em>. “I wish [Lyft]  had handled the situation with more empathy. We didn’t feel like anyone had our back, as her family.” The fare for the ride was only $15, Allyssa added. Her family had to raise money for Isabella’s funeral service on GoFundMe. </p><p id=\"uaM7yI\">Lyft spokesperson Gabi Condarco-Quesada said in an email to <em>The Verge</em> that the company has “built safety into every part of the Lyft experience. We are committed to doing everything we can to help protect drivers from crime, and will continue to take action and invest in technology, policies and partnerships to make Lyft as safe as it can be.” Her email did not answer a specific question about Lewis’ case.</p><p id=\"rtPVJP\">Lewis is one of the more than 50 gig worker drivers killed on the job since 2017, according to a <a href=\"https://www.gigsafetynow.com/\">new report from advocacy group Gig Workers Rising</a>, compiled using publicly available information, including news articles, police reports, and GoFundMe campaigns. It highlights the risks of gig work and how families often have little or no communication from the companies involved other than platitudes offered to the media.</p><div class=\"c-float-right\"><aside id=\"IWsNKL\"><q>families of many drivers killed on the job turned to GoFundMe for funeral costs</q></aside></div><p id=\"Uu24hf\">The report found that more than 63 percent of app-based workers killed in the past five years were people of color, even though they compose less than 40 percent of the US workforce.</p><p id=\"C7j8td\">The numbers in the report are consistent with the limited self-reporting from individual platforms. In <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.lyft.com%2Fblog%2Fposts%2Flyfts-community-safety-report&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F6%2F23012229%2Frideshare-delivery-drivers-killed-gig-workers-death\" rel=\"sponsored nofollow noopener\" target=\"_blank\">a community safety report from 2021</a>, Lyft reported 10 fatal attacks against drivers from 2017 through 2019. <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.uber.com%2Fus%2Fen%2Fabout%2Freports%2Fus-safety-report%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F6%2F23012229%2Frideshare-delivery-drivers-killed-gig-workers-death\" rel=\"sponsored nofollow noopener\" target=\"_blank\">In 2019</a>, Uber reported 19 fatal attacks over the preceding two years.</p><p id=\"scEPGt\">Cherri Murphy, one of the report’s authors and a former Lyft driver, said in an interview with <em>The Verge</em> that she was motivated to research gig workers’ deaths on the job by her own lived experience, which included driving during the height of the pandemic without any workers comp or unemployment benefits available to her. Lyft, Uber, DoorDash, and other gig work companies consider drivers independent contractors ineligible for most benefits. </p><p id=\"icjGBM\">“No death should be happening as a result of companies not protecting their workers,” Murphy said. She was appalled to discover that many drivers killed on the job had to turn to GoFundMe, like Lewis’ family, to cover funeral costs. “Why is there no support, no call from their employer?”</p><p id=\"0XkxNP\">Before Wednesday’s report, there were already numerous reports of rideshare companies failing to help families after a loved one is killed on the job; in January, the family of <a href=\"https://www.theverge.com/2021/12/16/22837475/afghan-refugee-uber-killed-san-francisco-family\">Ahmad Fawad Yusufi, a refugee from Afghanistan</a>, said Uber had tried to skirt responsibility for his death during a botched robbery attempt last year. </p><p id=\"FxI8a6\">Female drivers are particularly likely to experience safety problems while working; a <a href=\"https://www.theverge.com/2022/1/18/22878214/uber-lyft-women-drivers-sexual-assault-harassment-safety\"><em>Verge </em>report earlier this year</a> found women who drive for rideshare companies don’t feel protected by the companies they drive for. More than two dozen women drivers interviewed described incidents with passengers who exposed themselves, made sexual advances, or otherwise threatened them.</p><p id=\"vW83ym\">In its first-ever safety report released in 2021, Lyft reported <a href=\"https://www.theverge.com/2021/10/22/22740609/lyft-safety-report-2017-2019-physical-sexual-assault-death\">4,000 sexual assault claims</a> between 2017 and 2019. A similar <a href=\"https://www.theverge.com/2019/12/5/20997939/uber-safety-report-2018-sexual-assault-ride-hailing-platform-stats\">safety report from Uber in 2019</a> — its most recent— revealed more than 3,000 sexual assault claims between 2017 and 2018. Roughly <a href=\"https://www.vox.com/2019/12/7/20998646/uber-safety-report-sexual-assault-lyft-cases\">half of the claims came from drivers</a>.</p><p id=\"7jF9Gg\">DoorDash spokesperson Julian Crowley said in an email to <em>The Verge</em> that the company “takes the safety of our community extremely seriously. While negative incidents are incredibly rare, we’re constantly working to improve safety for all those who use our platform.” He added that Dashers— which is what the company calls its drivers — have access to in-app safety features and are covered by the company’s occupational accident insurance. “We know there is always more to be done and we’re committed to listening, learning and evolving to help make Dashers and the communities we serve safer.”</p><p id=\"jB5e0G\">As part of a day of action Wednesday, driver groups are planning protests in Boston, Chicago, Los Angeles, San Diego, and outside the San Francisco-area home of Uber CEO Dara Khosrowshahi. The groups are demanding changes in how app-based companies treat workers, including compensation for workers injured or killed while on the job, and an end to forced arbitration that requires workers to agree to out-of-court settlements in the event of a legal dispute. They want legislators to compel the companies to report data about injuries and deaths on the job publicly. Also on their wish list: the right for workers to organize unions. </p><p id=\"KIhZ29\">For her part, Allyssa Lewis said she would like to see more screening of passengers for rideshare companies; the man who authorities say killed her sister had no criminal record but was under investigation by the FBI at the time of the shooting. “You always hear about the drivers, how they screen them to protect passengers’ safety, but what about the drivers’ safety? These companies should think about keeping them safe as well.” </p><p id=\"XGgKxK\"><em><strong>Update April 6th 11:34AM ET:</strong></em><em> Adds comment from Lyft spokesperson. </em></p><p id=\"1cl3m4\"><em><strong>Update April 6th 11:56AM ET: </strong></em><em>Adds comment from DoorDash spokesperson</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mG9eaLfFYE2h8zgF2XLI0gLlXvw=/0x95:2000x1142/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23370204/1335977295.jpg",
  "description": "Worker advocates are seeking more protections for app-based drivers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}