{
  "title": "More accurate wind forecasts can save Americans millions in energy costs",
  "url": "https://www.theverge.com/2022/5/20/23130791/accurate-forecast-wind-energy-cost-savings",
  "date": "2022-05-20T18:18:43.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Exploring California Southern Desert Regions\" src=\"https://cdn.vox-cdn.com/thumbor/EdRgkmt0Ctg3Z9zt4q7FxSzbL-4=/133x0:5497x3576/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70893108/1397779053.0.jpg\" />        <figcaption><em>An array of electricity producing wind turbines (aka the San Gorgonio Pass wind farm) are viewed along Interstate 10 on May 11, 2022, near Palm Springs, California.</em> | Photo by George Rose/Getty Images</figcaption>    </figure>  <p id=\"fr40V9\">Better wind forecasting can save American consumers millions of dollars a year on their collective<strong> </strong>utility bills, a new <a href=\"https://research.noaa.gov/article/ArtMID/587/ArticleID/2876/NOAA-wind-forecasts-result-in-150-million-in-energy-savings-every-year\">study</a> finds. Wind energy costs have already <a href=\"https://www.statista.com/chart/26085/price-per-megawatt-hour-of-electricity-by-source/\">plummeted</a> thanks to more efficient turbines, but there’s still a major hurdle to overcome when it comes to renewable energy: intermittency. Unlike coal and gas-fired power plants, wind and solar farms can only churn out as much electricity as the weather will allow. </p><p id=\"6iy9sl\">So, accurate weather forecasts are crucial for utilities to be able to plan how much wind energy they’ll have on hand on any given day. Wind energy has grown quickly to power nearly 10 percent of the US electricity <a href=\"https://www.eia.gov/tools/faqs/faq.php?id=427&amp;t=3\">mix</a> today. The Biden administration has a goal of reaching a carbon pollution-free energy grid by 2035, and more accurate forecasts could help wind become an even bigger part of the mix.</p><div class=\"c-float-right\"><aside id=\"adAgAD\"><q>Utilities are constantly trying to balance power supply with demand, and that’s where forecasts come in</q></aside></div><p id=\"nx1hx9\">To avoid outages, utilities are constantly trying to balance power supply with demand, and that’s where forecasts come in.<strong> </strong>If forecasts predict a windy day, utilities bank on being able to tap that energy to meet consumer demand. They’ll typically choose the most affordable source of energy, and wind is one of the <a href=\"https://www.energy.gov/eere/wind/advantages-and-challenges-wind-energy\">cheapest</a> in the US. (Renewables are now <a href=\"https://www.irena.org/newsroom/pressreleases/2021/Jun/Majority-of-New-Renewables-Undercut-Cheapest-Fossil-Fuel-on-Cost\">cheaper than fossil fuels</a> in a majority of the world.) On the flip side, if forecasts warn of weak winds, utilities plan to procure electricity from other, potentially more expensive, energy sources. </p><p id=\"z2dIF6\">Miscalculations are costly. If less wind energy is available than initially forecast, utilities might have to pay extra high prices to buy electricity on short notice to meet customer demand. And if more wind energy is available than initially forecast, a utility might needlessly<strong> </strong>purchase more expensive electricity from a coal-fired power plant. The costs associated with those poor weather predictions typically get passed on to customers as higher energy bills. </p><p id=\"oV2JtV\">Thankfully, forecasting has improved with dedicated research. In 2015, the Department of Energy launched a four-year <a href=\"https://journals.ametsoc.org/view/journals/bams/100/9/bams-d-18-0036.1.xml\">study</a> into the atmospheric processes that affect wind power forecasts. That research informed an important weather model from the National Oceanic and Atmospheric Administration (NOAA) that provides hourly forecasts on wind conditions. </p><p id=\"QApA2Z\">The model, called the <a href=\"https://rapidrefresh.noaa.gov/hrrr/#:~:text=The%20High%2DResolution%20Rapid%20Refresh%20(HRRR)&amp;text=The%20HRRR%20is%20a%20NOAA,grids%20with%203km%20radar%20assimilation.\">High-Resolution Rapid Refresh (HRRR)</a>, has been updated a couple times since 2015. Consumers would have saved $384 million between 2015 and 2018 had the most updated version of the model been running the entire time, the new study finds. That shows how valuable it is to keep improving weather forecasts. To conduct the study, the researchers compared the model’s predictions to real-time observations to see how forecasts improved over time. Then, they estimated the potential cost savings for utilities and their customers.</p><div class=\"c-float-left\"><aside id=\"KD2Syc\"><q>Those gains could grow </q></aside></div><p id=\"ujf3j5\">Spread out across the US (with an estimated population of 329 million),<strong> </strong>the savings are small for<strong> </strong>each individual household. But those gains could grow as forecasting improves and<strong> </strong>more affordable wind energy comes online in the US.<strong> </strong></p><p id=\"fvDTtK\">Researchers are still working to make renewable energy forecasts even better. Newer versions of HRRR should be able to better predict wind ramps, which occur when wind speeds change very rapidly. The researchers say another study is underway to see how more accurate forecasts of cloud cover could also boost solar energy and trim down energy costs.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7Szivqy71jrprKH-H2ncPmyl0WY=/0x315:5629x3262/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23576889/1397779053.jpg",
  "description": "Better forecasting can boost wind and solar energy.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}