{
  "title": "Motorola’s latest Moto G Stylus gets the basics right",
  "url": "https://www.theverge.com/23025548/motorola-moto-g-stylus-2022-review-specs-screen-battery-price",
  "date": "2022-04-15T13:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p>Not the latest and greatest, but that’s not a problem</p> <p class=\"p--has-dropcap p-large-text\" id=\"IE4SNa\">The 2022 edition of the Moto G Stylus has a clearance rack vibe, since it’s probably one of the last new phones to be sold in the US without 5G. But if Motorola is clearing out space for a new season of 5G devices, then it makes the 2022 G Stylus a heck of a good bargain.</p><p id=\"JSe0gP\">The G Stylus, in theory, costs $299, but it’s on what seems likely to be a permanent markdown to $279. That’s right on pace with last year’s version of the G Stylus, but Motorola has made some upgrades to this year’s edition, including a bigger 5,000mAh battery, a bump from 4GB to 6GB of RAM, and a 90Hz screen for faster refreshing. </p><p id=\"BSCMYy\">It still offers a huge 6.8-inch 1080p screen and, of course, its namesake built-in stylus. There’s a different processor — a MediaTek Helio G88 — which takes the place of last year’s Snapdragon 678 chipset. A headphone jack, microSD card slot to augment the 128GB storage, and in-box charger are all included, handy features that are being slowly phased out by manufacturers starting with flagships and trickling down to the midrange. Get ‘em while you can.</p><div id=\"W9GUxN\"><div data-anthem-component=\"scorecard:11144229\"></div></div><p id=\"xOHGnt\">Generally speaking, not including 5G is a bit of a drawback. 5G networks in the US are starting to get much better, and that will continue over the next few years. But depending on your carrier, where you live, and how you use your phone, having a 4G-only phone might not be a big deal at all. That’s the clearance rack value proposition; it’s not the latest and greatest, but if it’s the right fit for you, then it just might be a winner.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/exupepktApYiQyWFy5QUaXPP8pM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385634/ajohnson_220411_5138_0004.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>Removing the stylus opens Motorola’s basic note-taking app.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"QO78yI\">For its namesake feature, the 2022 Moto G Stylus offers a massive canvas: a 6.8-inch 1080p panel with a 90Hz refresh rate. It’s an LCD panel, and it’s on the dim side. I used the phone indoors more than out, but I still needed the brightness cranked up to 80 or 90 percent at all times. Visibility isn’t great in direct sunlight, but it’s just good enough to see what you’re doing. The faster-than-standard refresh rate is nice, and you’ll notice a little extra smoothness as you scroll.</p><p id=\"xKVTQc\">As you might have guessed, that huge screen makes the whole phone big. Really big. There’s no chance of using this thing comfortably with one hand, and it looks ridiculous sticking out of the pocket of my joggers. I got used to it over a few days, and the big screen certainly fits a lot of content, but it’s definitely a lot of phone.</p><p id=\"9rBZIj\">The stylus feature set covers all the basics. There’s a straightforward note-taking app that’s the first thing you’ll see when you pop the stylus out of its silo on the bottom of the phone. There’s also a coloring book and a shortcut to capture a screenshot so you can notate or doodle on the image. Nothing as fancy or as advanced as the much, <em>much</em> more expensive <a href=\"https://www.theverge.com/22941246/samsung-galaxy-s22-ultra-review-price-screen-specs-stylus\">Samsung Galaxy S22 Ultra</a> can do but a nice tool to have when you want to jot something down without unlocking your phone, even if you don’t end up using it often. In fact, my own mother, a Motorola devotee and G Stylus 2021 owner, sealed hers up with a case that covers the stylus silo entirely. She’s perfectly happy with her phone sans stylus. To each their own.</p><div class=\"c-float-left c-float-hang\"><aside id=\"uLkHVT\"><q>The stylus is a nice tool to have, even if you don’t end up using it often</q></aside></div><p id=\"LotkS3\">Motorola claims that the G Stylus’ 5,000mAh battery will last up to two days on a single charge, so I took that as a challenge. After the first day I spent testing the phone, the battery was down around 50 percent, but I didn’t recharge overnight and trusted it to last through the next day. It did and, in total, I got about 6.5 hours of screen-on time and was down to 18 percent by the end of day two. I spent a lot of that time on Wi-Fi, which probably helped, but I did bump the screen refresh rate up to the highest setting to push it a little. Either way, that’s impressive stamina, and even heavy users would likely get through a full day without needing to top off the battery.</p><p id=\"kDPRed\">Overall performance is good, too. There are stutters and slight hesitations here and there as I open apps and scroll through video and image-heavy screens but nothing that impacts my daily use. The phone’s 6GB of RAM keeps lots of apps running in the background, and I’m impressed by how easily I can switch back to an app I was using hours ago and pick up right where I left off. You <em>can</em> run a graphics-intensive game like <em>Genshin Impact</em>, just expect to see some noticeable stuttering and dropped frames. But that’s not really what this phone is for anyway.</p><div class=\"c-float-right c-float-hang\"><aside id=\"xHiWFN\"><q>Most new phones in 2022 are shipping with Android 12, but the G Stylus is still pre-loaded with Android 11</q></aside></div><p id=\"jp1q93\">Most new phones in 2022 are shipping with Android 12 at this point in the year, but the G Stylus is still pre-loaded with Android 11. Motorola says the phone will get upgraded to Android 12 — that will be its only OS version upgrade — but isn’t offering any specifics on timing. The company also promises three years of security updates on an every-other-month schedule, which is one year longer than it promised with last year’s model. That’s an improvement but still falls short of Samsung’s commitment of four years (and <a href=\"https://security.samsungmobile.com/securityPost.smsb\">even five years for some of its A-series budget phones</a>). </p><p id=\"Dm1V8R\">This is normally when I’d cover which 5G bands this phone can use, but, in this case, it’s an easy answer: none of them. Unlike a year or two ago, 5G connectivity is something you should consider when buying a new phone. T-Mobile’s 5G network is already fairly strong; likewise, Verizon and AT&amp;T’s networks will improve over the next couple of years. For the most part, that will mean noticeably faster speeds compared to 4G, so that’s something the Moto G Stylus won’t be able to take advantage of. </p><p id=\"yTdy4a\">It’s a strike against the Moto G Stylus but not a dealbreaker. The 5G expansion in the US will be focused on major cities at first, so if you live somewhere more rural, having a 5G device probably isn’t a priority now or in the near future. And, if you’re otherwise happy with 4G speeds or spend most of your time on Wi-Fi anyway, then you’ll be just fine with a 4G device for the next few years. The Moto G Stylus isn’t really designed to last much longer than that anyway. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/a2gILJnT3TdTups-sLcdAyyMdjE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385632/ajohnson_220411_5138_0002.jpg\">      <figcaption><em>The Moto G Stylus includes a 50-megapixel main camera and an 8-megapixel ultrawide on the rear panel.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"5xzYme\">There appear to be three cameras on the G Stylus’ rear panel, but one of them is a 2-megapixel depth sensor that you can ignore. There’s a 50-megapixel f/1.9 standard wide camera and an 8-megapixel ultrawide, plus a 16-megapixel selfie camera. Last year’s model had a dedicated macro camera; this time, the ultrawide does double duty as the macro sensor.</p><div id=\"a6mNWF\"><div data-anthem-component=\"gallery:11144672\"></div></div><p id=\"3BxL8Q\">Overall, the G Stylus’ cameras produce well-balanced images without going overboard on color saturation or HDR effects in high-contrast scenes. Both rear cameras do a good job in good lighting, but there’s some noticeable noise in images from the 8-megapixel ultrawide taken in moderately low light. There’s also some noticeable lag between when you tap the shutter and when it actually takes a photo, which is fairly common for a budget phone. Night vision is helpful in very low light if your subject isn’t moving. It doesn’t work miracles, but at least this budget phone has a night mode — <a href=\"https://www.theverge.com/22975531/apple-iphone-se-2022-review-price-specs-screen-battery\">unlike another I recently reviewed</a>.</p><p id=\"vhe5Zc\">Video recording is only available at 1080p, which is unusual. (Most phones these days can shoot 4K video.) There’s a fairly aggressive crop, too, even if you turn electronic stabilization off. I don’t imagine the lack of 4K resolution video will bother a lot of people buying this phone, but 4K is more or less the new standard for high-resolution video, so that’s something to note if video is important to you. Otherwise, 1080p clips are just fine, and the smaller file sizes are easier to share anyway.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jdBp-puVR9oTbiaiEOJz1rdcJ30=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385633/ajohnson_220411_5138_0003.jpg\">      <figcaption><em>If you can live without 5G over the next few years, then the Moto G Stylus is a good bargain.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"PSooqi\">You’re not going to find the Moto G Stylus on the shelves at a Verizon or T-Mobile store. The major carriers are far too interested in getting 5G phones into their customers’ hands to waste any of that valuable retail space on a 4G device. And it’s not all marketing bluster anymore; true 5G really is arriving, and it really will be faster than 4G. But just because the carriers think it’s the right time to put a 5G device in your hand doesn’t mean you absolutely have to buy one. If you’re fine with 4G and will be over the next few years, then the Moto G Stylus is a great deal.</p><p id=\"3yEikr\">For under $300, it offers good performance, a huge screen, competent enough cameras, and excellent battery life. That’s not even considering its headline feature: the stylus. It’s handy, and even if it doesn’t get much use, the phone is still well-priced even without it. </p><p id=\"Hhw2Fu\">If you do want something a little more future-proofed, <a href=\"https://www.theverge.com/2021/6/12/22529760/samsung-galaxy-a32-5g-review-price-screen-specs\">the Samsung Galaxy A32 5G is a good option</a> while it’s still in stock. For the same price as the Moto G Stylus, it offers similar performance and equally good battery stamina. On the downside, its screen is smaller and lower res, it only comes with 64GB of storage, and, of course, there’s no stylus.</p><p class=\"c-end-para\" id=\"shL5L1\">If you’re not concerned about future-proofing for the next generation of wireless technology and a big phone with a big screen is just your size, then the Moto G Stylus is the bargain rack deal for you.</p><p id=\"po58L3\"><em>Photography by Allison Johnson / The Verge</em></p><div><div id=\"uxtYqP\"><div data-anthem-component=\"aside:11144281\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/aOJST_Cld9uODv23ZPSYhLq7teM=/0x144:2040x1212/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385631/ajohnson_220411_5138_0001.jpg",
  "description": "No 5G, but not a bad deal.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}