{
  "title": "Motorola Moto G Stylus 5G (2022) review: stylus and substance ",
  "url": "https://www.theverge.com/23054028/motorola-moto-g-stylus-5g-2022-price-screen-specs-battery",
  "date": "2022-05-03T12:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p>A Galaxy Note Light</p> <p class=\"p--has-dropcap\" id=\"4vaCQK\">The Motorola Moto G Stylus 5G gets some significant upgrades in this year’s model, taking it firmly into midrange territory. If you’re looking for a well-performing stylus phone but the Samsung Galaxy S22 Ultra feels like overkill, then the G Stylus 5G is what you want.</p><p id=\"OjxWG2\">Don’t confuse the Moto G Stylus 5G (2022 edition) with <a href=\"https://www.theverge.com/22538663/motorola-moto-g-stylus-5g-review-specs-screen-price\"><em>last</em> year’s Moto G Stylus 5G</a> or <a href=\"https://www.theverge.com/23025548/motorola-moto-g-stylus-2022-review-specs-screen-battery-price\">this year’s non-5G Moto G Stylus (2022)</a>. Somehow, these are all distinctly different phones. While the previous Moto G Stylus 5G wasn’t much of a step up spec-wise from last year’s 4G-only G Stylus, it’s a different story this year. This time around, the G Stylus 5G includes an upgraded Qualcomm chipset, a stabilized main camera, and more RAM. That doesn’t sound like much, but those improvements help to really set the G Stylus 5G apart from the $300-and-under budget class.</p><div id=\"cBStzz\"><div data-anthem-component=\"scorecard:11173562\"></div></div><p id=\"rQN5Mw\">Naturally, those upgrades come with a higher price: $499 for the unlocked version with 256GB of storage and 8GB of RAM, a steep increase from last year’s $399. But I think that extra $100 makes the Stylus G 5G into a worthwhile midrange phone rather than a forgettable device on the high end of the budget range. It’s more of a Galaxy Note Light rather than an inexpensive phone that happens to have a stylus tucked inside.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_1syCMHXxpy9GtZPssFlrKq2Ies=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432425/ajohnson_220425_5166_0004.jpg\">      <figcaption><em>The G Stylus 5G’s 6.8-inch screen is an LCD panel with a fast 120Hz maximum refresh rate.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"haVT4T\">The G Stylus 5G features a huge 6.8-inch screen with good-enough 1080p resolution and a fast 120Hz refresh rate. Scrolling and animations look smooth as a result, and the phone does use that top 120Hz rate fairly often in auto mode, which is easier on battery life than leaving 120Hz enabled at all times.</p><p id=\"DFW8v8\">This screen is an LCD, so blacks are not as dark, and contrast isn’t as rich as on an OLED. Video playback quality is fine but not as nice of an experience as you’ll get with a more expensive device (or even some other budget and midrange models that now have OLED screens). What bothered me more was that the screen is hard to see outdoors in bright sunlight — in theory, LCD technology has an advantage over OLED in bright conditions. This wasn’t the case with the G Stylus 5G, as I squinted at the screen in bright daylight. Indoors, I usually had screen brightness cranked up to 80 or 90 percent, which is all to say that this screen isn’t the very brightest.</p><p id=\"ACcGYm\">That massive screen makes the phone look a little ridiculous in the side pocket of a pair of yoga pants, but it’s just the right size for all of the device’s stylus-centric features. Pop the stylus out of its built-in silo, and you’ll see a shortcut menu pop up with icons leading you to Motorola’s note-taking app, GIF-maker, and coloring book app, among others. A stylus isn’t necessarily essential for any of these, but the added accuracy helps. </p><p id=\"pKWObv\">The note app is a bit simpler than what you’ll find on the <a href=\"https://www.theverge.com/22941246/samsung-galaxy-s22-ultra-review-price-screen-specs-stylus\">Samsung Galaxy S22 Ultra</a>. Rather than giving you access to all of the tools all at once, individual notes have separate tabs for doodling, text entry, images, and voice memos. It’s more limited, but it’s also less overwhelming. You can choose from a few different background options for your digital page, like a pastel blue with grid lines or a soft gray with dots. They’re inviting the way a new, blank journal is. </p><div class=\"c-float-right c-float-hang\"><aside id=\"EISnwC\"><q>the unlocked version of the phone includes a very healthy 8GB of RAM</q></aside></div><p id=\"bCwKle\">Outside of the notes app, the stylus plays more of a supporting role. You can use it to crop images in a freeform style, add handwriting to a screengrab, or fill in some Disney character-esque coloring book templates. It’s a capacitive stylus, so there’s no pressure sensitivity, and it lacks the connected features of Samsung’s S Pen, like gesture-based Air Actions to control certain functions without touching the screen. Still, there’s a little bit of weight to it, and it feels precise and responsive enough for note-taking and sketches.   </p><p id=\"kaHY46\">Overall phone performance is very good. The Snapdragon 695 is a cut above the 400-series chipset used by last year’s model, and the unlocked version of the phone includes a very healthy 8GB of RAM. There are ways in which I can definitely see all of that power at work: apps stay open for a relatively long time in the background, and I can run a very graphics-heavy game like <em>Genshin Impact</em> fairly smoothly. Performance isn’t flawless; some apps, like the camera app, are a little slow to open on initial startup. But overall, the G Stylus 5G provides good performance that often exceeded my expectations of a $500 Android phone.</p><p id=\"zcYIV4\">Battery stamina is healthy, too. Some of Motorola’s budget phones will truly run for days on a single charge if you’re a light or moderate user — the G Stylus 5G isn’t quite on that level, but it will get most users safely through a full day of use. Even on a day of heavy use, I was still at 20 percent by bedtime. Battery life isn’t exceptional, but it shouldn’t be something that owners of the device will need to worry about.</p><p id=\"OcyOJu\">A quick word on 5G: the unlocked version of the phone can use Verizon and T-Mobile’s sub-6GHz 5G networks, and Motorola spokesperson Stephanie Stiltz says that other carriers will be available “in the coming months.” Presumably, that means AT&amp;T. The G Stylus 5G supports the n77 C-band frequency that Verizon and AT&amp;T are using to upgrade their long-range 5G networks, so it should be able to take advantage of it when more of that spectrum comes online over the next couple of years.</p><div class=\"c-float-left c-float-hang\"><aside id=\"zsCMuJ\"><q>the G Stylus 5G will get one OS platform upgrade and three years of security updates</q></aside></div><p id=\"ki8XdG\">The Moto G Stylus 5G ships with Android 12 installed, as it should because Android 13 is coming just around the corner. Motorola’s implementation of Android remains one of my favorites, including the “peek” notifications on the lock screen that are useful without being disruptive. The system will prompt you to opt into a suggested app feature on the home screen powered by a company called Branch. In my testing, its suggestions aren’t all that smart, and it just takes up space, but it’s easy enough to just not opt in to that particular feature. </p><p id=\"uY5hG9\">Motorola’s Stiltz says that the G Stylus 5G will get one OS platform upgrade and three years of security updates. That’s an improvement over the company’s previous policy of supporting phones for two years, though not as good as Samsung’s five-year policy for some of its budget phones, like <a href=\"https://www.theverge.com/23015400/samsung-galaxy-a53-5g-review-specs-price-screen-camera\">the Galaxy A53 5G</a>. Still, it’s progress, and if you like to trade in your old device for a new one every few years, then it will be enough.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oxlfeKqV01ppsfM_IG7MOXBjVRw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432424/ajohnson_220425_5166_0003.jpg\">      <figcaption><em>The phone’s main rear camera includes optical stabilization, which helps keep shots in dim light sharper.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"u0YisY\">As far as camera quality goes, the Moto G Stylus 5G feels like it doesn’t really live up to its potential. At times, image quality is good, and the main camera’s optical stabilization does seem to help maintain more detail in photos taken in dim lighting. But Motorola hasn’t dialed in its image processing, and photos sometimes look overly bright with neon greens and reds.</p><div id=\"jPNtxO\"><div data-anthem-component=\"gallery:11173621\"></div></div><p id=\"HLpURg\">The G Stylus 5G’s rear camera system consists of a 50-megapixel f/1.9 standard wide, an 8-megapixel ultrawide, and a 2-megapixel depth sensor that helps out with portrait mode photos. There’s also a 16-megapixel f/2.2 selfie camera with a very aggressive face-smoothing beauty filter that can be disengaged, thankfully.</p><p id=\"kluyZv\">Portrait mode photos are generally good, though sometimes prone to errors like blurring over a subject’s ear. Macro photos are courtesy of the ultrawide lens, which is actually much nicer than using a low-res dedicated macro camera because you actually get autofocus. Photos in dim and low light sometimes look overly smoothed and other times look dark and contrasty. It’s just hard to know what you’re going to get. Video recording tops out at 1080/30p, and for $500, this phone really should shoot 4K. As it stands, video clips tend to look over-brightened, though stabilization is good.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BbMJvUO3r_X1V8s1kB99fdcY38M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432423/ajohnson_220425_5166_0002.jpg\">      <figcaption><em>This year’s Moto G Stylus 5G is a worthwhile upgrade over the LTE-only model.</em></figcaption>  </figure></div><p id=\"MnT9o7\">If you want a phone with a stylus that keeps up with demanding tasks and camera quality isn’t a priority, then the G Stylus 5G is a compelling option. Not everyone needs the power of the Galaxy S22 Ultra, and the Moto G Stylus 5G stands up as a much less expensive alternative with healthy performance. The LTE-only Moto G Stylus is an even lower cost option at $279, which is a good option if your budget is tight. But if you can spare the extra $200-plus, the 5G model is a worthwhile upgrade for its faster performance. </p><p id=\"wYrNwy\">It’s not a phone I’d recommend as an all-around pick in its price range, though. If you’re not a stylus devotee, then the Galaxy A53 5G is altogether a better package. Its 120Hz OLED screen is nicer, camera quality is better and more consistent, and it’s scheduled to get five years of security updates. You don’t get as much storage or RAM, but it’s also $50 cheaper.</p><p class=\"c-end-para\" id=\"5j3m6i\">With LG out of the mobile phone market, we’re down to just two manufacturers making stylus phones. The S22 Ultra sits much, much higher and is worth its high price if you’re looking for a stylus <em>and</em> the best of the best. The G Stylus 5G feels like a good middle ground for stylus fans, as long as you’re not too picky about image quality.</p><div><div id=\"CGL148\"><div data-anthem-component=\"aside:11173630\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/PYVcbUbGMEyQHD4p23UHF1IIqgQ=/0x103:2040x1171/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432426/ajohnson_220425_5166_0005.jpg",
  "description": "Stylus fans get a legitimate midrange option",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}