{
  "title": "Mountain Everest Max review: peak performance",
  "url": "https://www.theverge.com/22996700/mountain-everest-max-keyboard-review-gaming",
  "date": "2022-03-28T18:26:38.000Z",
  "author": "Alice Newcome-Beill",
  "content": "  <p>A keyboard with a lot of great ideas, well executed</p> <p class=\"p--has-dropcap p-large-text\" id=\"A3UpQF\">With just about every gaming keyboard I’ve tested, there’s always something missing — a feeling of “if this keyboard only had this or that, it would be perfect.” The Mountain Everest Max feels like an answer to this exact conundrum. It’s like the designers of this keyboard were tired of dealing with all the dumb oversights and omissions in mainstream gaming keyboards and decided to take something of a kitchen sink approach.</p><p id=\"EqYxOy\">What resulted is a full-size gaming keyboard with a unique modular capability. The Everest Max isn’t trying to reinvent the wheel, but it comes with an impressive list of features that feels like the keyboard I would make if I was given a team of engineers and carte blanche to make whatever I wanted.</p><div id=\"LMbRA3\"><div data-anthem-component=\"scorecard:11117746\"></div></div><p id=\"nIcLW3\">The Mountain Everest Max sits on the higher end of the spectrum in terms of cost, but that’s offset somewhat by the ability to buy certain parts of the keyboard piecemeal. The model I tested pulls out all the stops in terms of amenities, and its price tag reflects that, coming in at a spicy $249.99. It comes with an attachment that provides media controls as well as a numpad, making it a full-size keyboard.</p><p id=\"p2EaIh\">Mountain also offers a $149.99 model without the media dock and number pad called the Everest Core, in addition to the aptly named $129.99 Everest Core Barebone, which provides you with a fully assembled shell and hot-swap PCB with sound-dampening foam but requires you to bring your own set of switches and keycaps. </p><p id=\"wvSnAW\">However, if you do order the Everest Max, it comes delivered in what can only be described as a small dresser, complete with drawers for all your accessories. This only deserves a mention because it’s the first keyboard box where I didn’t feel immediately compelled to discard it.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WSpOUGFUhhhWg-GS7xNGXcykKq0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23346028/anbeill_220322_5105_0040.jpg\">      <figcaption><em>A monumental unboxing experience</em></figcaption>  </figure><p id=\"XIqQg4\">In addition to the accessories that come packaged with the Everest Max, Mountain’s storefront has a fairly extensive list of additional add-ons to choose from, from different keycap sets and switches to <a href=\"https://us-mountainggshop.com/collections/cables/products/coiled-aviator-usb-cable-space-cables\">trendy aviator-style cables</a>. However, the Everest ecosystem is extremely receptive to aftermarket mods and accessories. In my case, I swapped out the Cherry Brown switches for a set of Kailh Silvers (lubed and filmed, mind you) and added switch pads to the PCB for a little extra “thock.” I also replaced the standard ABS keycaps with an aftermarket PBT phantom keycap set from Razer, accented with some pink rubberized keycaps and a resin cast escape keycap from Amazon.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/X3eDs40-aijry6hDSTyebnqSSDQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23346027/anbeill_220322_5105_0034.jpg\">      <cite>Photo by Alice Newcome-Beill / The Verge</cite>      <figcaption><em>The Everest Max is equipped with a hot swap PCB</em></figcaption>  </figure><p id=\"K2JyUc\">Not being locked into a single ecosystem of accessories is extremely refreshing to see outside of the fully custom market, and being provided with a variety of price points to start with helps reduce the barrier to entry and makes the whole experience far more accessible.</p><p id=\"B9b0R6\">The body of the Everest Max is a milled aluminum top plate that’s available in either gray or black and feels extremely sturdy. The keyboard lacks the typical flip-out feet to incline the typing surface and instead relies on a collection of magnetic discs with rubberized bottoms to prop it up. This is certainly a little less convenient than the more traditional solution and needs a little more time to set up, but it does provide what feels like a more secure typing surface. </p><p id=\"2QhQDM\">The underside of the chassis includes a number of cable routing channels and a single detachable USB-C cord that provides power to the keyboard, its USB-A passthrough, and any add-ons you’ve attached. It was a little disappointing to see that while there are a number of USB-C ports available, they’re meant to be used exclusively with add-ons in the Everest ecosystem. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Dvkmdoik2j2Cd4o0NvKuylMlIPs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23346024/anbeill_220322_5105_0022.jpg\">      <figcaption><em>The number pad can be easily removed and attached to either side of the keyboard</em></figcaption>  </figure><p id=\"vyC2za\">On that note, the two things you’ll notice if you opt for the Everest Max are the standalone number pad with some extra buttons and something that looks like it could pass for a communicator in Star Trek. The number pad is fairly self-explanatory: a small switch on the bottom allows you to extend a USB-C connection to the left or right, giving you the option of adding it to either side of your keyboard, which is secured into place with magnets. The number pad can also be propped up with its own collection of magnetic feet, identical to those on the rest of the keyboard.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NYdGDMXic3DSnThSi215FCUEiK8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23346025/anbeill_220322_5105_0027.jpg\">      <figcaption><em>The magnetic feet allow you to prop up the number pad and keyboard</em></figcaption>  </figure><p id=\"T49uSz\">You’ll also notice a quartet of buttons on the top of the number pad that become LED screens once connected to the keyboard. These can be bound to functions like controlling media playback, opening specific applications, or running macros. You can even customize each button with unique icons from your own library using Everest’s desktop software. And while the Everest Max itself is compatible with Macs, the software, unfortunately, isn’t.</p><p id=\"dc0RVv\">The other peripheral that comes packaged with the Everest Max is the Media Dock. This interesting bit of hardware plugs into the top of the keyboard on either the left or right-hand side via a USB-C connection. As you might expect, the media dock has four buttons that are meant to control media playback and an additional button to let you navigate the dial-based menu.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/i6qPs6X-Dv4EZUoJhtwDCKFNEiY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23346021/anbeill_220322_5105_0010.jpg\">      <figcaption><em>The detachable media dock with its multi-function display</em></figcaption>  </figure></div><p id=\"a4amm8\">The dial on the Media Dock has an LED screen built into it that rotates with a satisfying click. You’ll mainly be using this display to navigate various functions like adjusting volume, switching keyboard profiles, or changing RGB lighting. However, the display can also be used to show other useful information, like a clock, usage of system resources, and even your actions per minute if that’s what you’re into. Beyond that, the functionality is somewhat limited, but it’s still neat. This is reminiscent of what <a href=\"https://www.theverge.com/2020/10/1/21494314/corsair-k100-gaming-mechanical-keyboard-optical-switches-opx\">Corsair introduced on the K100</a>, but because the Media Dock is much more intuitive, it’s something I’m more inclined to use.    </p><p id=\"knUpJB\">The typing experience out of the box is solid, and in addition to the typical offering of Cherry MX Brown, Red, and Blue switches, Mountain offers Silent Red and Speed Silver switches as well. The hot-swap PCB is compatible with three-pin switches, which let me easily swap out the stock Browns for Kailh Silvers. If you’ve got a five-pin switch you’re hoping to use, you’ll need to clip the extra plastic legs off before it will fit in the Everest. The acoustics without any additional changes are good thanks to the sound-dampening foam, and the pre-lubed stabilizers are a welcome addition and help combat rattle.</p><div class=\"c-float-right c-float-hang\"><div id=\"GLMVKl\"><div data-anthem-component=\"aside:11114438\"></div></div><div id=\"vZAwSa\"><div data-anthem-component=\"aside:11114443\"></div></div></div><p id=\"wkHcMj\">Mountain offers keycaps in ANSI and ISO layouts, but these are made of ABS by default, not PBT. However, you do have the option of adding PBT keycaps to your order for an additional $29.99. The wrist rest that comes packaged with the Everest Max is firm and attaches to the keyboard magnetically. It wasn’t particularly bad, but I’ve yet to meet a pre-packaged wrist rest that I actually wanted to use. Fortunately, it’s easy enough to remove.    </p><p id=\"Xajfyd\">The only features missing from the Everest Max that are offered by the more mainstream competition are wireless connectivity, optical switches, and some absurdly high polling rate. So unless these features are at the top of your list of necessities in your next gaming keyboard, Max likely has you covered.</p><div class=\"c-float-left c-float-hang\"><div id=\"eIq9e2\"><div data-anthem-component=\"aside:11114422\"></div></div></div><p id=\"q8aBmO\">With all the good things this keyboard has going for it, it’s curious that the Everest Max isn’t more popular. The keyboard has been around for a year but hasn’t managed to carve out a niche for itself. The only theory I’ve come up with is that its customizability is lost on a demographic that would rather build something from scratch anyway. And the high price makes it difficult to justify the cost for someone that would buy a gaming keyboard from Razer or Corsair that has similar features but is far less expensive.</p><p id=\"Y0cGpe\">So what are the downsides here? Mountain’s proprietary controller software, aptly named Basecamp, clearly still needs a fair bit of work to keep pace with other programs like Corsair iCue and Razer Synapse. While it’s a functional and intuitive program, it has very few RGB lighting profiles. Basecamp currently only supports six built-in lighting effects and offers little flexibility for custom effects as each key can only retain a single lighting effect at any time. Basecamp is compatible with Razer Chroma Connect, which allows Razer’s Synapse app to control the lighting effect of the keyboard… kind of. This only works occasionally, and while it allows you to sync lighting effects with other Razer accessories, it doesn’t effectively translate more complicated lighting effects.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XJZDggZDNUmtvHzt9kiHBPdZx7k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23350525/Base_Camp_Software.png\">      <figcaption>The Basecamp software is functional, but is a little rough around the edges</figcaption>  </figure><p id=\"v90tFT\">The one positive note here is that Basecamp doesn’t need to run in the background to maintain custom profiles; all of your macros and lighting schemes are saved directly to the memory on the keyboard with space for up to five separate profiles. You also have the option to go without the software altogether — the Everest lineup has a small handful of lighting effects out of the box and can record macros without having to tax your system’s resources.</p><p id=\"Mv70MK\">The other drawback is, like most gaming keyboards with a feature list this big, the Everest Max is expensive (not the most expensive keyboard I’ve laid my hands on — that auspicious award still belongs to the <a href=\"https://www.theverge.com/22951481/dygma-raise-review-ergonomic-keyboard-review\">Dygma Raise at around $315</a>). But spending $250 on a keyboard is a considerable investment for most people. Still, the Mountain Everest Max represents an excellent value for gamers when you consider the features attached to many of the gaming keyboards currently available at a similar price. Compare it to the Corsair K100 ($250), the Asus ROG Strix Flare II Animate ($220), or Asus ROG Claymore II ($262), and the Everest Max’s price is more understandable.       </p><p id=\"ZD50Og\">Frankly, I was a bit surprised to see a keyboard of this caliber available at such a low price point. Just from a perspective of the amount of care and attention that went into this keyboard and its peripherals, I would’ve expected a substantially higher price tag.</p><p class=\"c-end-para\" id=\"bqvT9a\">“Endgame” is a term that gets thrown around a lot in the realm of keyboard enthusiasts, the idea of a singular perfect keyboard that ticks all the boxes in terms of design and aesthetics. This doesn’t represent a singular goal for everyone, and that can change over time. But for me, the Mountain Everest Max represents an excellent intersection of what I’ve been wanting in a keyboard for years.</p><p id=\"3Bvk0R\"><em>Photography by Alice Newcome-Beill / The Verge</em> </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/E5TzLvt1cr-5phKL6-MKvHNj7vo=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23346017/anbeill_220322_5105_0004.jpg",
  "description": "The Everest Max is a transformative gaming keyboard.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}