{
  "title": "MoviePass’ CEO wants in on the metaverse",
  "url": "https://www.theverge.com/22929876/moviepass-stacy-spikes-interview-metaverse",
  "date": "2022-02-12T15:00:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/EQrVEL4iveBJn5TkNx8QIG9dQTQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70501751/acastro_210813_1777_theater_0002.0.jpg\" />    </figure>  <p id=\"PPULR7\">MoviePass is set to return this summer after being swooped up and resuscitated by its original co-founder Stacy Spikes. During a launch presentation on Thursday, Spikes took the stage in New York to hype the relaunch of his embattled movie ticket subscription service. There was plenty of fanfare and, somewhat bizarrely, references to Web3 technology. But one thing that Spikes didn’t mention on stage was MoviePass’ metaverse aims.</p><p id=\"JUMghm\">“Some of the players in the metaverse right now are a little game-y, when I feel like you want to just watch the movie,” Spikes tells <em>The Verge</em>. “You don’t need fake popcorn; you don’t need tomatoes; you don’t need other things that are in there. And that’s where we’re looking at it, and it’s something we’re taking seriously that we feel we will have a presence in.”</p><p id=\"iPiyd5\">During the Thursday launch event, Spikes pitched a product that felt a little less like a potential bomb than <a href=\"https://www.theverge.com/2019/9/19/20872984/moviepass-shutdown-subscription-movies-helios-matheson-ted-farnsworth-explainer\">the beloved but disastrous dirt-cheap, unlimited viewing iteration</a> of the service. And he’s ready to tap just about every avenue, including digital currency and the metaverse, to bring the memesub back to life. The problem is, it’s unclear whether consumers — or heck, even <em>theaters</em> — are prepared for MoviePass 2.0. A moviegoing subscription relying on VR and decentralized technologies gives the same energy as <a href=\"https://www.theverge.com/2021/11/12/22779137/amc-theaters-movie-tickets-cryptocurrency-bitcoin-cash-ethereum-litecoin\">AMC getting into crypto</a>. Fine, but <em>why</em>?</p><p id=\"69VgH7\">“What’s great about going to the movie is it’s uninterrupted. You can’t stop it, you need to pay attention, and if not, you’re going to waste your money,” Spikes says. “And what we like about that is, it’s event viewing. And I think that event viewing can happen in the metaverse.”</p><div class=\"c-float-right\"><aside id=\"JhjM4q\"><q>“It’s a bit of a concept shift — it’s less about the price point and more creating flexibility”</q></aside></div><p id=\"2DtM4E\">Spikes didn’t share specifics about the company’s metaverse ambitions. He mentioned concerts and live events as an area of interest — “We look at ourselves as a live event company,” Spikes tells me — but it sounds like longer-term thinking for now.</p><p id=\"GQ6zDb\">Despite all the buzzwords, Spikes’ ultimate goal for MoviePass hasn’t changed. The service’s core function is still putting people in physical seats at cinemas, and Spikes says the new MoviePass will give users more flexibility and a better experience, all while helping theaters.</p><p id=\"daUbOh\">The way the old MoviePass worked was with a debit card-like system that allowed members to see a certain number of movies every month for a fixed fee. A lot has yet to be clearly laid out about the new MoviePass — pricing, for example, has yet to be announced, and Spikes declined to share a ballpark range when I asked. But Spikes says the new subscription service will be tiered, and users will additionally be able to <a href=\"https://www.theverge.com/2022/2/10/22927812/moviepass-back-relaunch-stacy-spikes\">earn extra moviegoing credits</a> by viewing ads through Spikes’ existing venture, PreShow. </p><p id=\"yoESFt\">This time around, Spikes says, members will also have more flexibility to be able to do things like bringing a friend — something that was not an option with the last MoviePass. Based on slides shared during the presentation this week, the number of credits per movie will vary based on factors like peak moviegoing hours and perhaps even title popularity and location. Spikes is insistent that this is a pivotal differentiator between this new MoviePass and the one that <a href=\"https://knowyourmeme.com/memes/sites/moviepass\">spurred 1,000 memes</a> for how <a href=\"https://www.theverge.com/2019/7/5/20683218/moviepass-shutdown-weeks-app-upgrade-recapitalize\">poorly it was mismanaged</a>.</p><div class=\"c-float-left\"><aside id=\"rcobSN\"><q>“Those who don’t have a plan have a lot of interest in working with us.”</q></aside></div><p id=\"b4lYlc\">“It’s a bit of a concept shift — it’s less about the price point and more creating flexibility that people can go in where they want, and then even if you’re mid-month, and you want to go more, you’ll be able to get more credits and go upstream. So it’s adding a lot of flexibility into it, where the previous model was kind of one-size-fits-all,” Spikes says. “We think that the one-size-fits-all rigidity is something that needs to change.”</p><p id=\"wYfPYi\">That flexibility could be a huge benefit to MoviePass 2.0 at a <a href=\"https://www.theverge.com/2021/8/25/22641318/hybrid-film-releases-cinemacon-theater-exclusivity\">rocky time</a> for the theater industry. Exhibitors are <a href=\"https://www.theverge.com/22622638/movie-theaters-streaming-amc-cinemark-regal-exclusive-windows\">beginning to claw back</a> their exclusivity windows, and recent releases like <em>Spider-Man: No Way Home</em> have signaled that audiences are <a href=\"https://www.theverge.com/2021/12/17/22843051/movie-theaters-spider-man-no-way-home-records-amc-regal-cinemark\">increasingly comfortable</a> with returning to auditoriums for film premieres. But pandemic releases are still very much in flux, and while things are starting to return to normal, streaming executives have been coy about fully returning to pre-COVID release models.</p><p id=\"xBccdA\">Spikes’ launch event this week reads like a love letter to cinemas. In fact, it seemed at times like he was speaking <em>directly to</em> them. (He might very well have been — MoviePass has yet to announce any exhibition partners, but Spikes tells <em>The Verge</em> the company has “very advanced conversations that we’re very comfortable with.”) If MoviePass is going to succeed, it needs theaters, and the landscape of the moviegoing industry has changed drastically in the years since the old MoviePass went up in flames. </p><p id=\"CJwJRU\">Many theaters, for example, now have their own subscription services that reward power users with discounts. When I ask Spikes about how MoviePass fits in a world where subscriptions like Alamo Season Pass and AMC Stubs A-List exist, he says smaller theaters have expressed interest, while bigger chains are taking the wait-and-see approach.</p><div class=\"c-float-right\"><aside id=\"XRxjvM\"><q>“We’re excited about the opportunity of rebuilding where we were”</q></aside></div><p id=\"ZniAK7\">“I mean, obviously those who don’t have a plan have a lot of interest in working with us. Those who do have a plan are, I think, waiting to see what we do,” he says. “It’s an ongoing conversation, but definitely the lower 50 percent who don’t have millions of dollars to put out the technology that we have are leaning in and like, ‘Hey, we saw how you affected our business, when can we engage?’”</p><p id=\"AwaEz8\">Still, Spikes seems to believe that MoviePass can revolutionize the theater industry. Spikes said during his presentation that MoviePass 2.0’s “moonshot” goal is to double the annual revenue and attendance of the movie industry at large with a “30 by 30” initiative. In essence, Spikes wants subscriptions (to any service, not just MoviePass) to account for 30 percent of all domestic ticket sales revenue across the industry by 2030. </p><p id=\"jUsmZH\">To reach anything close to the manufactured success of early MoviePass — the subscription service had <a href=\"https://www.theverge.com/2020/1/29/21113645/moviepass-bankruptcy-helios-and-matheson-subscribers-owed-millions\">millions of users</a> at its peak, thanks to its economically unviable $10 price point — the new MoviePass will need to win back consumer trust. Before Spikes back <a href=\"https://www.theverge.com/2021/11/11/22776299/moviepass-co-founder-relaunch-bankruptcy-stacy-spikes-film-app-service\">bought the company</a> last year, MoviePass’ previous parent Helios and Matheson Analytics did a bang-up job with <a href=\"https://www.theverge.com/2018/4/27/17291242/moviepass-unlimited-movie-deal-repeat-viewings-theater-blackouts\">enraging customers</a> and allegedly <a href=\"https://www.businessinsider.com/inside-story-moviepass-rise-fall-2019-8\">purposefully borking the system</a>. </p><p id=\"Saa815\">When I ask Stacy about Helios and Matheson Analytics executives Ted Farnsworth and Mitch Lowe, who ultimately fired Spikes from the company he co-founded, he says he thinks there’s potential for companies whose original founders return to the business to build back trust. But he also credits former MoviePass subscribers who “kept the spirit alive” with motivating him to relaunch the business.</p><p id=\"Kz9HHv\">“In regards to Mitch and Ted, I’ve never spoken to them since. When I was let go, I got an email. And we’ve never had words, ever,” he says. “You know, that’s fine. We’re excited about the opportunity of rebuilding where we were and reestablishing the brand to help the movie industry.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/b9sRKq0RSCPZMf2V0u6epsXwEkc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22805150/acastro_210813_1777_theater_0002.jpg",
  "description": "Can the metaverse bring the memesub back to life?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}