{
  "title": "MoviePass is officially coming back",
  "url": "https://www.theverge.com/2022/2/10/22927812/moviepass-back-relaunch-stacy-spikes",
  "date": "2022-02-10T21:24:30.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/G3UXWMcZTSPh-ratRuE43_VCgwI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70494950/vpavic_180125_2283_0037.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"SjyjKq\">Two years after the wildly popular subscription service MoviePass crashed and burned, its co-founder Stacy Spikes is determined to bring it back. Spikes says MoviePass will return this summer.</p><p id=\"wjsNP3\">The company, recently bought by Spikes after his <a href=\"https://www.businessinsider.com/inside-story-moviepass-rise-fall-2019-8\">unceremonious ouster</a> from MoviePass in 2018, held its launch event today at the Walter Reade Theater Lincoln Center in NYC. Spikes began by wasting absolutely no time addressing the Helios and Matheson Analytics-shaped elephant in the room. The firm is now infamous for being the parent company of MoviePass that managed to blow the entire thing up shortly after the firm bought the startup, which became famous for offering unlimited movie tickets for a monthly fee.</p><p id=\"qpyozn\">“A lot of people lost money, a lot of people lost trust,” Spikes said, claiming he was among those who were hurt by the company’s mismanagement. During the opening moments of the event, Spikes oscillated between addressing the disappointment of being pushed out of his company, joking about MoviePass’ loyal consumers — as well as its power users, who Spikes cracked are the reason the company went out of business — and finally, the process of snapping the company back after <a href=\"https://www.theverge.com/2020/1/29/21113645/moviepass-bankruptcy-helios-and-matheson-subscribers-owed-millions\">its parent company went bankrupt</a> in 2020.</p><div id=\"ns1AaU\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Real screenshot from the Moviepass presentation. Gotta respect it. <a href=\"https://t.co/66dGouhZP8\">pic.twitter.com/66dGouhZP8</a></p>— Nando (@NandovMovies) <a href=\"https://twitter.com/NandovMovies/status/1491867312156291074?ref_src=twsrc%5Etfw\">February 10, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"VmuInU\">“We’re looking at this from another point of view,” Spikes said of the company’s relaunch, adding that he now plans to run the business like a “co-op.” Spikes added that MoviePass users will be able to hold partial ownership of the company, with its most premium tier inclusive of a lifetime subscription. </p><p id=\"4B3ud4\">The event was at times a little bizarre, with muted clapping audible when Spikes paused to make sure his jokes and proposals were landing with live attendees. Spikes sounded at times more like he was delivering an enthusiastic Ted Talk about theatrical releases than a product launch. He hyped the relaunch under his new vision, which, he says, will be “powered by web3 technology.” </p><p id=\"8xNNTn\">“Moviegoing is not going anywhere; cinema is not going anywhere,” Spikes said.</p><p id=\"8rIOVw\">The company’s original engineering team is returning for the business’s relaunch, according to Spikes, and the service will launch this summer. Under the new model, MoviePass will run on tradable credits that roll over month to month. Subscribers will also be able to use their credits to bring a friend, a markedly different approach from the single-user card system that MoviePass used previously, which could prove annoying for non-cardholders. </p><p id=\"avpRsz\">MoviePass 2.0 will also work on a tiered system, Spikes said. Spikes shared images of a beta version of the new app and the credit-based system, which will vary based on things like peak moviegoing hours. MoviePass’ ambitions for subscribers are, charitably, ambitious. Spikes wants to claim 30 percent of the moviegoer market by 2030, MoviePass’ “moonshot” goal.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lXA3ohV0_yvu0fNzy5XZRLrCHX4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23233326/Screen_Shot_2022_02_10_at_12.30.48_PM.png\">      <cite>Image: MoviePass/YouTube</cite>  </figure><p id=\"LY1SPW\">Somewhat unsurprisingly, MoviePass will incorporate aspects of Spikes’ existing business PreShow, a technology that has been used to allow gamers to <a href=\"https://techcrunch.com/2021/04/29/preshow-interactive/\">trade ad views</a> for in-game currency. (This sort of format for moviegoing was <a href=\"https://www.businessinsider.com/inside-story-moviepass-rise-fall-2019-8\">previously teased</a> by Spikes to <em>Insider</em>.) The way that PreShow works is that you have to actually <em>view</em> the ad — it tracks whether your attention is trained on your phone. Once users “complete the PreShow,” they’ll be awarded credits that can then be used to buy tickets through the MoviePass platform.</p><p id=\"01WrTo\">Spikes told attendees at the event that MoviePass’ most loyal fans will be “deputized” to beta users and will be able to use the experience for its first year for free. At some point during the summer, these users will be contacted about the beta programming. </p><p id=\"kRiaXA\">Launched in 2011 with a small team of developers and headed by co-founder Spikes, MoviePass’ second life follows a series of comically disastrous failures under the direction of Helios and Matheson Analytics. The firm <a href=\"https://www.theverge.com/2017/8/15/16150628/moviepass-pricing-subscription-fee-theaters\">bought a majority stake</a> in the company in 2017 and, subsequently, ran it straight into the ground. </p><div class=\"c-float-right\"><aside id=\"eUNS04\"><q>“Moviegoing is not going anywhere; cinema is not going anywhere.”</q></aside></div><p id=\"MbRzqa\">Spikes was <a href=\"https://www.businessinsider.com/inside-story-moviepass-rise-fall-2019-8\">fired from his own company</a> by Helios and Matheson Analytics executives Ted Farnsworth and Mitch Lowe in 2018, reportedly for raising concerns about the service’s unsustainable $10-per-month payment structure (which was <a href=\"https://www.businessinsider.com/moviepass-cofounder-on-what-led-to-firing-2019-4\">meant to be temporary</a>, according to Spikes). Shortly thereafter, the service began imploding — it was hemorrhaging money, the service underwent abrupt changes, and the app sometimes didn’t work at all (which was <a href=\"https://www.businessinsider.com/inside-story-moviepass-rise-fall-2019-8\">later reported</a> to be intentional). The service <a href=\"https://www.theverge.com/2019/9/13/20864873/moviepass-app-shutdown-out-of-business-movies-subscription\">eventually shut down</a> in 2019, and Helios and Matheson Analytics <a href=\"https://www.theverge.com/2020/1/29/21113645/moviepass-bankruptcy-helios-and-matheson-subscribers-owed-millions'\">filed for bankruptcy</a> the following year.</p><p id=\"VDbLGL\">Then, last winter, Spikes <a href=\"https://www.theverge.com/2021/11/11/22776299/moviepass-co-founder-relaunch-bankruptcy-stacy-spikes-film-app-service\">bought back the company</a> and announced plans to relaunch the service. Speaking at the time with <em>Insider</em>’s Jason Guerrasio, who covered the MoviePass saga extensively, Spikes said that the decision to buy back the brand he helped form “was encouraged by the continued interest from the moviegoing community.”</p><p id=\"FgftOj\">He added, “We believe, if done properly, theatrical subscription can play an instrumental role in lifting moviegoing attendance to new heights.”</p><p id=\"vW0vwp\">Spikes seemed to shrug off existing subscriptions launched by individual theater chains, instead suggesting that MoviePass would offer more options and more flexibility than a single exhibitor could. Since MoviePass folded, plenty of theaters have launched their own power user subscription models that will compete directly with a now-late-to-the-party MoviePass. MoviePass will also have to convince these exhibitors to sign on, something they were initially prickly about in a pre-pandemic market. </p><p id=\"kCoOd8\">A lot has changed for movie theaters since MoviePass shut down in 2019 — and a lot will have to change for MoviePass, too, if it wants this second run to have a better ending.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SvaorCBvDy3CAscAiIwtzEhyR9k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10212737/vpavic_180125_2283_0037.jpg",
  "description": "MoviePass is back, baby.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}