{
  "title": "Ms. Marvel’s first trailer teases a cosmic take on Kamala Khan",
  "url": "https://www.theverge.com/2022/3/15/22979069/ms-marvel-disney-plus-trailer",
  "date": "2022-03-15T14:55:11.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Kamala Khan fantasizing about herself as a superhero at a dance.\" src=\"https://cdn.vox-cdn.com/thumbor/dAvpLNGHKySSh1lki58osthHtLE=/714x0:3126x1608/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70625199/101_A124C003_210301_CNEE_di01_R.0.jpg\" />        <figcaption>Marvel Studios</figcaption>    </figure>  <p id=\"6uKUxH\">Unlike her fellow Jersey teens who insist that superheroes aren’t cool, Kamala Khan, the heroine of <a href=\"https://www.theverge.com/2019/8/23/20830377/ms-marvel-tv-series-kamala-khan-live-action-disney-plus-g-willow-wilson-bisha-k-ali\">Marvel’s upcoming <em>Ms. Marvel </em>series</a>, thinks capes are the flyest thing in the world. Naturally, she wants to become one of them herself, and in <em>Ms. Marvel</em>’s first trailer, the young girl’s wish starts to come true.</p><p id=\"Km3Gp1\">From series creator Bisha K. Ali<em>, Ms. Marvel </em>tells the story of how Kamala Khan (Iman Vellani), a diehard Carol Danvers stan, first discovers her own burgeoning superpowers and starts putting them to good use as supervillainy begins to take root in Jersey City. Similar to her comics counterpart, the MCU’s Kamala doesn’t hide the fact that she’s something of a  fanfiction-writing nerd, something that few of her peers really understand other than her friend Bruno Carrelli (Matt Lintz). </p><p id=\"fItxIU\">But unlike comics Kamala, who develops the power to embiggen parts of her body through the Inhuman terrigenesis process, <em>Ms. Marvel</em>’s Kamala’s abilities are apparently more cosmic in nature and involve her making energy constructs.</p><p id=\"vjhmos\">Insignificant as the changes to Kamala’s power set may seem now, they may be a sign of how she’s going to eventually cross paths with her idol and Monica Rambeau for director <a href=\"https://deadline.com/2020/08/captain-marvel-sequel-nia-dacosta-director-1202992213/\">Nia DaCosta’s <em>The Marvels</em></a>, which is still quite a ways out. You won’t have to wait all that long to meet Kamala, though, as <em>Ms. Marvel </em>hits Disney Plus on June 8th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mXsmnlhwC12NuZzsbLPYsIkqVc8=/385x0:3456x1608/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23317424/101_A124C003_210301_CNEE_di01_R.jpg",
  "description": "The first Ms. Marvel trailer establishes a new spin on Kamala’s powers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}