{
  "title": "MSI GS76 Stealth review: big-screen gaming for a better price",
  "url": "https://www.theverge.com/22916188/msi-gs76-stealth-review-17-inch-gaming-laptop-qhd",
  "date": "2022-02-03T18:29:48.000Z",
  "author": "Monica Chin",
  "content": "  <p>A big gaming laptop with a price tag that’s only kind of extravagant</p> <p id=\"0K0ADc\">If you like the look of MSI’s powerhouse, RGB-packed <a href=\"https://www.theverge.com/22900362/msi-ge76-raider-review-alder-lake-17-inch-gaming-laptop\">GE76 Raider</a>, but the price tag and the massive chassis are too much for you to stomach, the GS76 Stealth may be more your speed. This laptop is the GE76 junior, in specs, weight, and also price. </p><p id=\"55ad7k\">The GS76 is not the most powerful gaming laptop you’ll ever find, nor is it the quietest or most efficient. But it still brings a number of great features — including a superb QHD, 240Hz screen and a fun RGB keyboard — in addition to a powerful RTX 3070 GPU that can handle whatever games you need. While not the best 17-incher on the market, it’s worth considering if you’re looking for a big-screen gaming laptop and should serve plenty of people well, especially if you can find it at a discount.</p><div id=\"Z6aOvM\"><div data-anthem-component=\"scorecard:11010907\"></div><div id=\"u93oeB\"><div data-anthem-component=\"aside:11010912\"></div></div></div><p id=\"E5E9Vf\">Among 17-inch gaming laptops, this product is in an attractive spot price-wise. The configuration I have, with a Core i9, 1TB of storage, and 32GB of RAM, is currently going for $2,199 at Best Buy. The <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.mobileadvance.com%2Fmsi-ge76-raider-11uh-053-17-3-360hz-gaming-laptop-intel-core-i9-11980hk-rtx3080-32gb-1tb-nvme-ssd-win10%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22916188%2Fmsi-gs76-stealth-review-17-inch-gaming-laptop-qhd\" rel=\"sponsored nofollow noopener\" target=\"_blank\">most comparable GE76 Raider model I can find</a> is about $1,000 more — it has an RTX 3080 GPU and a higher refresh rate, but a lower screen resolution, which I don’t think is a great trade outside of fairly specific use cases. An <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.dell.com/en-us/shop/dell-laptops/alienware-x17-gaming-laptop/spd/alienware-x17-r1-laptop/wnr1x17fclxs\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Alienware X17</a> with similar specs (also with a lower-resolution screen, and with a Core i7 instead of an i9) is several hundred bucks more expensive than the GS76.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The MSI GS76 Stealth half open facing away from the camera on a dark wooden table.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/H3s7Hb2T2TEGNQpSGGtVhAD34ok=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890514/akrales_210928_4764_0091.jpg\">      <figcaption><em>MSI calls the chassis color “core black”.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The MSI GS76 Stealth open, angled to the left on a wooden table. The screen displays The Verge homepage.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8ofvJKd6AZ4GESW3KB1PTbVSNN8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890877/akrales_210928_4764_0023.jpg\">      <figcaption><em>“Just like the king of metropolis,” MSI says of this laptop.</em></figcaption>  </figure></div></div></div><p id=\"mUdYMd\">So, the frame rates. At the GS76’s native QHD resolution, <em>Red Dead Redemption 2 </em>ran at 55 frames per second on its maximum preset. Bumped down to 1080p (just for comparison’s sake — there’s no reason you’d actually need to do this), that frame rate rose to 70 frames per second. The benchmark looked fine in both cases, with no visible stuttering.</p><p id=\"6AkmNs\"><em>Shadow of the Tomb Raider </em>registered 51 frames per second with ray tracing on Ultra (highest preset) and 80 frames per second with ray tracing off in QHD. Lowering to 1080p resolution brought those averages up to 77 and 114 frames per second, respectively. That’s another strong result, though it’s solidly below what we saw from the 1080p GE76 Raider. </p><p id=\"jBsVuO\">The more recent <em>Cyberpunk 2077 </em>was the only game where I would’ve considered bumping any settings down. (<em>Cyberpunk </em>doesn’t have a benchmark, so this was just me playing around with it for a bit.) With ray tracing on, the GS76 was only able to average 20 frames per second in QHD and 40 frames per second in 1080p. Turning ray tracing off bumped those numbers up to 42 and 65 frames per second, respectively. Of course, Nvidia’s DLSS can help smooth things out if ray tracing in QHD is a priority for you. And by contrast, the CPU-heavy <em>CS:GO </em>could take full advantage of the 240Hz screen, averaging 336 frames per second in QHD and a wild 431 frames per second in 1080p. </p><p id=\"A9QBDu\">To illustrate the delta between the GS76 and a more expensive 17-incher: the GE76 Raider averaged at least 20 frames per second better on almost of these titles. That said, most of these games are still playable without much compromise on the GS76. Personally, as someone who likes immersive visuals, I’ll take a QHD panel over a 1080p experience (which our Raider test unit had) with a few extra frames per second any day.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The MSI GS76 Stealth keyboard seen from above, illuminated in green and pink.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/reFzIZ6AAHhulX10a6Q6d85gZsA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890937/akrales_210928_4764_0133.jpg\">      <figcaption><em>Have some RGB, as a treat.</em></figcaption>  </figure></div><p id=\"dnWDo3\">The GS76 was also good, but not chart-topping, when it came to other sorts of work. It took two minutes and 27 seconds to export a 50-minute, 33-second 4K video, losing to the GE76 but beating the <a href=\"https://www.theverge.com/22765258/alienware-x17-review-4k-17-inch-gaming-laptop\">Alienware X17</a> by almost a full minute. It also got a reasonable score of 817 on the Puget Systems Benchmark for Premiere Pro, which tests both playback and export performance. While that doesn’t touch the market’s top performers (the GE76 Raider still holds the highest score I’ve ever seen from a test unit), it does come fairly close to the Alienware X17 with an RTX 3080. </p><p id=\"IFxu8x\">And, of course, my regular Chrome, Zoom, and Slack workload went just fine on this device. The GS76 had no problem running a Zoom call over a huge dump of Chrome tabs, even with Battery Saver on. There are a few different fan profiles that you can swap between with F8. It is worth noting that the most active Extreme Performance setting, which you’d presumably want to use during gaming and heavy work, is <em>loud</em>. Even when I wasn’t doing anything, the GS76 sounded like a box fan whenever this profile was on and was very audible from other rooms. </p><p id=\"PPJ08M\">The other considerable drawback is, as you may be able to guess, battery life. Battery life is never the top priority with these sorts of laptops that are unlikely to get moved around much. Still, I only averaged four hours and 15 minutes using this device as my primary work driver at 200 nits of brightness (though the times were somewhat variable, and I saw up to five and a half with lighter workloads — our battery test average is always an approximation). You could likely get better battery life if you turned down the resolution and refresh rate. But that, of course, has a detrimental effect on image quality. Charging was also on the slower side — the GS76 juiced up 50 percent in an hour.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The speaker on the left side of the MSI GS76 Stealth.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q9SrgxnZzBwvWIRTaREfNm9unMc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890510/akrales_210928_4764_0052.jpg\">      <figcaption><em>The speakers actually sounded decent and clear.</em></figcaption>  </figure></div><p id=\"EKaIAq\">Moving on to the chassis: While hardly petite, it is fairly practical as 17-inch gaming laptops go, at 5.4 pounds and 0.8 inches thick. The chassis is refreshingly subdued (even the RGB keyboard is fairly unobtrusive on most settings) — you could absolutely use it in public without turning every head in the room. I will note that while the keyboard deck was okay in this regard, the lid was an absolute fingerprint magnet. </p><p id=\"CavLlS\">The port selection has no devastating omissions. There’s a power jack, an RJ45 Ethernet port, two USB-A, a headphone jack, an SD slot, two USB-C, and an HDMI. There’s no dedicated DisplayPort, but the USB-C does support it. Gaming laptops of this size are starting to stick ports on the rear of the chassis, but the GS76 still has them all on the sides. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The number pad on the MSI GS76 Stealth keyboard. The keys are illuminated in green and purple.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/acb4T-6lR2CTkiHNSwisclXAXXM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890934/akrales_210928_4764_0080.jpg\">      <figcaption><em>Number pad is handy, though a bit small.</em></figcaption>  </figure></div><p id=\"35HgZY\">The keyboard is quite comfortable, though there is one… oddity. I didn’t hit my fastest typing speeds ever, but the keys have solid travel and a click that’s not too loud. The per-key RGB is neat and not too big of a distraction. </p><p id=\"85XhGC\">The main nitpick I have is that the GS76’s Fn key is in a weird location. It’s crammed to the right of the spacebar, between the \\ and Ctrl keys. It’s not at all convenient to reach while you’re typing — in order to press it, I had to either move my whole right hand off the keyboard or do some Twister-style contortions with my pinky. The reason this is annoying is that you have to press Fn to toggle basically anything — volume, brightness, keyboard profiles, fan profiles, airplane mode, etc. You can invert this, but then you’ll still need to hit Fn when you want to access the arrow keys, which is where the volume and brightness toggles are. Either way, it’s a pain not to have Fn accessible.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The ports on the left side of the MSI GS76 Stealth.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uIG0rBZVrKh7kgg9rR_0O1bFZ98=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890944/akrales_210928_4764_0102.jpg\">      <figcaption><em>Ethernet, audio jack, two USB-A, and power port on the left.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The ports on the right side of the MSI GS76 Stealth.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3tG1qNcXq9RHMlp4NwJwevMMbEs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890943/akrales_210928_4764_0113.jpg\">      <figcaption><em>HDMI, two USB-C, and an SD reader on the right.</em></figcaption>  </figure></div></div></div><p id=\"QHWxob\">Two other notes for potential buyers: One, the touchpad, while smooth to scroll on, has a bit of a thin click that takes some getting used to. In addition, the 720p IR webcam is terrible. It’s so grainy and full of noise that I just ended up turning it off most of the time. It also made my face look weirdly bright red (which I confirmed with my phone camera is not actually how it looks). It does support Windows Hello facial recognition, which is handy. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Stickers on the right palm rest of the MSI GS76 Stealth that read Intel Core i9 and Nvidia GeForce RTX.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/D3_WXxCp_Pg6UPliRRcdLfiPAGU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890508/akrales_210928_4764_0061.jpg\">      <figcaption><em>In case you forgot what’s inside here.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Sticker on the MSI GS76 Stealth bottom bezel that reads QHD 240Hz Ultra Fast Gaming Display.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FAhVqLDLpY1R6PeZI8nZsma3AkU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22890509/akrales_210928_4764_0057.jpg\">      <figcaption><em>Don’t forget the refresh rate, either!</em></figcaption>  </figure></div></div></div><div><div id=\"EkQcNK\"><div data-anthem-component=\"aside:11010950\"></div></div></div><p id=\"e6M1yu\">Ultimately, the GS76 hits a sweet spot of portability, affordability, and power that I appreciate. I can’t promise that you’ll never have to knock down a single setting, but I encountered very few gaming hiccups. And the QHD panel combined with the 240Hz refresh rate make for a gorgeous gaming experience. Even when doing regular work or browsing through Twitter, text and pictures looked noticeably crisper, and scrolling was quite smooth. I wish the aspect ratio were taller than 16:9, but that’s not nearly as much of a problem for productivity on a 17-inch display as it is on a smaller machine. </p><p class=\"c-end-para\" id=\"mUqRGf\">But it still won’t be everyone’s 17-inch gaming laptop of choice. The battery life is unfortunate, and that dampens the benefit of the thin and light chassis, as you’ll need to lug the 230W charger most places you’re going. The poor webcam, the funkiness of the keyboard, and the volume of the fans may be turnoffs for those who are looking to double a device as a primary driver. Still, MSI has managed to put decent gaming performance in a chassis that’s not a big haul to carry around, and that’s worth not overthinking too much. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FyeWDk8AZjSt00_zef7oFRF3OdE=/0x272:2040x1340/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22890935/akrales_210928_4764_0003.jpg",
  "description": "Portable performance, in QHD",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}