{
  "title": "My big fat Italian vampire-slaying family",
  "url": "https://www.theverge.com/2022/3/5/22960148/vampire-survivors-game-pc-mac-italian-names-lore-head-canon",
  "date": "2022-03-05T17:00:00.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Y6ZAb6CDUDEUXV36gAyuW5MOuX4=/0x0:2254x1503/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70583353/vampiresurvivors_italianflag_nologo.0.png\" />        <figcaption><em>The Vampire Survivors start screen, now in its true colors.</em> | Photo illustration by Antonio G. Di Benedetto</figcaption>    </figure>  <p id=\"k9gKup\">I was floored as soon as I got to the main menu of <a href=\"https://store.steampowered.com/app/1794680/Vampire_Survivors/\"><em>Vampire Survivors</em></a>. I knew this hot indie darling sounded up my alley when I heard it described as a reverse-bullet hell blended with a roguelike, but I was not prepared for it to hit so close to home. While the main menu looks low-rent and the Castlevania-inspired aesthetics seems at first like a poor imitation, what stopped me in my tracks was the starting character. Antonio Belpaese: the first in a lineup of four Belpaese family members and a menagerie of other characters with incredibly Italian-sounding names. Even before playing a minute of the game, I was enthralled by my namesake taking the lead. As I struggled through the first few runs and slowly unlocked more characters, I felt like this game represented me and my big Italian-American immigrant family in a small way that elevated the whole experience like few games I have ever played.</p><p id=\"RXng4G\">When people talk about <em>Vampire Survivors,</em> it’s all about how much fun the mechanics of the game are and how it’s blown up on Steam for the cheap Early Access price of just $3. The gameplay is indeed exceptional. You try to survive an onslaught of increasing numbers of baddies using only auto-firing weapons, slowly improving your arsenal with pickups and passive power-ups. It’s a roguelite that gives that dopamine hit as the numbers go up and is completely devoid of a story, but it is rich in culture. Specifically, my family’s culture.</p><p id=\"lHH0ZG\"><em>Vampire Survivors</em>’ creator, Luca Galante, <a href=\"https://www.theverge.com/2022/2/19/22941145/vampire-survivors-early-access-steam-pc-mac-luca-galante\">told my colleague Jay Peters in an interview</a> that he often gets stuck coming up with lore, backstories, and meaning for the characters in his games. “The technical aspects are what [I] understand properly, but stuff like writing a story, especially for the video games medium, is something so difficult that I don’t have the skills to do it.” Luca is an Italian who moved to the UK to be a game developer, working in the gambling industry before making his breakout hit. He left <em>Vampire Survivors</em> without any story mode, intro cutscene, or even vampires in favor of focusing on the action and gameplay loop. There’s a short blurb on the <a href=\"https://poncle.itch.io/vampire-survivors\">itch.io site</a> about the game’s premise, and it’s almost nonsensical: “The year 2021, Rural Italy, there lived an evil person named Bisconte Draculó, whose many evil magics created a bad world filled with famine and suffering. It’s now up to the members of the Belpaese family to end his reign of terror and return good food to the table.”</p><div class=\"c-float-left\"><aside id=\"g8JtZi\"><q>I couldn’t help myself from creating my own personal head canon for some of the cast of <em>Vampire Survivors</em></q></aside></div><p id=\"aOoA3x\">But I felt an instant connection to these characters. It’s not every day you see a cast of Italian characters in a video game, outside of high profile examples like Mario and Luigi or Ezio of Assassin’s Creed games. But Mario and Luigi are caricatures created by a Japanese developer consisting mostly of cheesy accents, bushy mustaches, and a blue-collar trade. <em>Assassin’s Creed II</em> tried the historical fantasy thing with Ezio in 15th-century Italy, but it certainly dipped into <a href=\"https://www.youtube.com/watch?v=RJcPc6OQ384\">some cringe</a>. <em>Vampire Survivors</em> offers something different.</p><p id=\"4I7BcA\">So here are my unofficial backstories and explanations for some of the game’s embedded Italian-ness. Let’s take a look at the stars of the game and those (chef’s kiss) fantastic names.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CI0MTifP10Xi7DIEBZdGV2E8YC4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23285870/vampiresurvivors_characters.png\">      <cite>Screenshot by Antonio G. Di Benedetto</cite>      <figcaption><em>No, this is not the starting lineup of the Italian national soccer team. Though I’d love to see them all in Azzurri-blue.</em></figcaption>  </figure><p id=\"iAbo9v\"><strong>Antonio Belpaese:</strong> Obviously, this is me. Also, my grandfather, my grandmother (Antonia), and nearly half a dozen more members of my extended family spanning the USA, Italy, and Argentina. Italians love reusing names within the family, so why not keep using <em>the best one</em> — and for the best character in the game. (Note: please ignore the unfortunate fact that Antonio is not the best character in the game).</p><p id=\"sK4mN4\"><strong>Imelda Belpaese:</strong> In addition to being a brand of cheese, the family name Belpaese is also a nickname for Italy, meaning “beautiful country.” It’s kind of like how Americans call the USA the home of the brave, or Germans referring to their homeland as <a href=\"https://www.youtube.com/watch?v=ZOziWm_MJ9k&amp;t=25s\">the land of chocolate</a>. Imelda sounds like a very old-timey name, and she starts with a magic wand that she probably used to discipline my older cousins when they were children. Wait, is that magic wand made of wood and shaped like a spoon?</p><p id=\"l7ztEl\"><strong>Pasqualina Belpaese:</strong> The gender-swap of my real-life cousin and godfather. Pasqualina means “little Easter,” so I assume she bakes some great bread and savory pie with cheese and sausage (<a href=\"https://www.insidetherustickitchen.com/pizza-rustica/\">it’s delicious</a>, I assure you). Pasqualina was born in the USA but speaks perfect Italian (unlike me) and goes by “Patty.” Did you know Italian-Americans often have Americanized nicknames to prevent Americans from butchering their beautiful pronunciation? No, that doesn’t mean you have permission to call me Tony.</p><p id=\"pDYRCj\"><strong>Gennaro Belpaese:</strong> There are a few Gennaros in my family, all named after San Gennaro, the patron saint of Napoli. If you’re in the New York area, you may know <a href=\"https://sangennaronyc.org/\">The Feast of San Gennaro</a>. It’s when Italian-Americans gather in lower Manhattan to fly little red-white-and-green flags and parade around the half a city block that makes up Little Italy. There may or may not be a Joe Pesce look alike there, posing for pictures, but you most likely bought an overpriced calzone from a street vendor and a replica Italian national team soccer jersey with Ciro Immobile’s name on it — spelled with too many L’s and not enough M’s.</p><p id=\"61ch47\"><strong>The Ladonna family:</strong> The second family of <em>Vampire Survivors</em> is Ladonna (meaning “the woman”). There’s Arca Ladonna, Porta Ladonna, and Lama Ladonna. Their clothing and hair are a little edgier — very reminiscent of Alucard from Castlevania. They probably disappoint their parents by dressing like goths and listening to metal. But if you forget to call their dad on his birthday, you will feel a guilt trip like you’ve never known possible before. (Side note: Porta Ladonna may be a riff on “porca madonna,” which is something I can say in front of my mom or my aunts if I want to get slapped.)</p><p id=\"7Hd7U9\"><strong>Poe Ratcho:</strong> A play-on-words for poveraccio, meaning “poor guy” or someone you take pity on. Poe Ratcho is an old man with a big white beard and a cane, and he starts the game with the garlic weapon aura. This is me in the future, when I reek even more of garlic but I’m past the point of caring. Also, by then, the mole on my neck will grow big enough to scare my nieces and nephews before it one day kills me.</p><div class=\"c-float-right\"><aside id=\"gucfEl\"><q>The Mario of Super Mario Bros. became a Catholic priest and went to rural Italy to fight hordes of bats, skeletons, mummies, and ghouls</q></aside></div><p id=\"8GjadU\"><strong>Dommario:</strong> Father Mario. Yes, the Mario of Super Mario Bros. became a Catholic priest and went to rural Italy to fight hordes of bats, skeletons, mummies, and ghouls instead of stomping turtles. Does that sound ridiculous? Sure. But I bet it will still be better than <a href=\"https://www.theverge.com/2021/11/23/22799382/chris-pratt-voice-super-mario-movie-nintendo-illumination-ceo\">whatever the hell that Chris Pratt movie is going to be</a>.</p><p id=\"Tf45Ou\"><strong>Krochi Freetto:</strong> An evil demon whose name may loosely mean crocifisso (crucifix) or croce fritta (fried cross). Regardless, my mother would quietly recite three Hail Marys and two Our Fathers to herself if she saw me play as Krochi. Also, for some reason, I’m suddenly hungry for some <a href=\"https://www.racioppistaralles.net/\">extra spicy taralles</a>.</p><p id=\"Y8p9ql\"><strong>Mortaccio:</strong> One of the best characters in the game. He’s a walking skeleton with a halo who throws bones at the monsters. If I were a kid again today, I would totally want a Mortaccio action figure to play-fight against all my Saint Michael statues (he was the <a href=\"https://upload.wikimedia.org/wikipedia/commons/6/68/Guido_Reni_031.jpg\">badass archangel with a sword</a>).</p><p id=\"KuzIjM\"><strong>Peachone: </strong>Not a character, but a weapon in the game. You think it’s a lovely dove assisting you? No, it’s just a lowly piccione (pigeon). Too bad it doesn’t steal bread for you from enemies.</p><div id=\"JYOtiO\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"vampire_survivors_clip|106218\" data-volume-uuid=\"3386665d9\" data-volume-id=\"106218\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-382\" class=\"volume-video\"></div><div class=\"caption\"><em>My first time completing a stage with Antonio was a hallmark moment, leading to lots of screaming and self high-fives for this real-life Antonio. I died right as I crossed the 30:00 mark. (note: clip has no audio)</em></div></div><p id=\"QGcT43\">There’s a lot in a name, obviously. And while it can be fun to make stuff up about any game or piece of entertainment (<em>Vampire Survivors</em> fanfic, anyone?), there’s just no denying that a connection to something when you feel even somewhat seen creates a bond unlike anything else. </p><p id=\"ZoAmyg\">This game has become something very special for me, like a bonded connection that I just can’t help feeling a bit warm and fuzzy over — sort of like a nostalgia trip, but it cuts much deeper into the fiber of my being. Everyone should get to have that experience with a game they love playing, being able to <a href=\"https://www.vice.com/en/article/wx534n/god-of-war-ragnarok-shows-how-games-can-get-black-hair-right\">see themselves represented in the characters</a> as more than just a player analog. Even if it just gives them a chance to lean into the joyous silliness of their culture that helped shape them growing up.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VNe3259dIJocOMKoR1dunUQyg8A=/0x162:2254x1342/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285856/vampiresurvivors_italianflag_nologo.png",
  "description": "Vampire Survivors is an indie hit quietly brimming with culture.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}