{
  "title": "My favorite thing about the Steam Deck is its ultra-portable case",
  "url": "https://www.theverge.com/2022/4/6/23013265/valve-steam-deck-carrying-case-review",
  "date": "2022-04-06T18:27:49.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/p06IlB66RjWzbgT85rECfsjaFgA=/0x116:3684x2572/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70718038/Steam_Deck_case.0.jpg\" />        <figcaption>Image: Valve</figcaption>    </figure>  <p id=\"FO5tN5\">The best thing about the <a href=\"https://www.theverge.com/22579493/valve-steam-deck-gaming-handheld-pc\">Steam Deck</a> has nothing to do with its <a href=\"https://www.theverge.com/2021/7/15/22578917/valve-steam-deck-nintendo-switch-xbox-series-x-ps5-spec-comparison\">specs</a>. Rather, its carrying case is my favorite non-feature feature that vastly improves the Deck’s esteem in ways its technical capabilities haven’t yet. </p><p id=\"isWU47\">My first delightful surprise was the arrival of the case itself. I did not expect to get a carrying case when my Steam Deck arrived last week. For all that’s been said about the Deck’s technical performance — we wrote <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">two</a> <a href=\"https://www.theverge.com/22960536/steam-deck-faq-valve-one-month-later\">reviews</a> — there hasn’t been much discussion of the case. I therefore thought, like with a Nintendo Switch or 3DS, that cases were available but sold separately. </p><p id=\"1kykgf\">The case is hard-shelled with a soft velvety interior and a molded form for the Deck to sit inside so it’s not bouncing around while zipped up in its case. The case’s zippers are special too. While I was initially annoyed trying to remove the zip tie holding the zippers closed, I realized it’s actually a neat safety feature. The dual zippers have interlocking holes that could easily accommodate a luggage lock. It’s not gonna stop a determined individual from getting inside, but if you’ve got young children or meddlesome roommates you want to keep away from your Steam Deck, the zipper’s interlocking design gives you that option.</p><p id=\"b72j7f\">My favorite feature of the case, though, is the elastic band that stretches across the back. The Steam Deck case has handles, but I’ll never use them — this elastic band is the MVP. I love it specifically because it enables hands-free carrying. I decided to test the Steam Deck’s performance in outside light (which is how I excuse going outside to play video games all day after being inside playing video games all day). It was also time to walk my dog. That elastic band made my dog walk / impromptu <em>Persona 4 Golden </em>in the park session a breeze. I didn’t have to juggle my dog’s leash or his poop bags with a game case in my other hand. I simply slipped the case up my arm and was ready to go. It was — if you’ll pardon the pun — a game-changer.</p><div id=\"zRn466\"><div data-anthem-component=\"gallery:11131881\"></div></div><p id=\"ZSj9I1\">I realize it’s a little strange to rave specifically about the carrying case of one of the most anticipated gaming electronics, but this little incidental feature means so much to the ethos of the Deck itself. The Steam Deck is supposed to be portable. Portability doesn’t only mean small and handheld — it also means convenience. My Switch is small and handheld, and it’s a pain in the ass to take around with me. It’s way too large to fit inside my coat pockets, and most cases only come with dinky handle straps. </p><p id=\"t42I4f\">It feels like a lot of gaming-specific carrying cases are designed to be put in other, more convenient carrying cases. That’s okay for longer trips in which I’m already bringing with me a suitcase or an overnight bag, but it’s a bit of a pain for short jaunts. I live in an extremely walkable part of town with a coffee shop a block away from my house. I have to bring a bulky drawstring backpack whenever I want to have a short Switch gaming session with a cup of coffee. </p><p id=\"ntFRCq\">The Steam Deck’s case, specifically its elastic band, is sublimely perfect for a walk to my local coffee shop or dog park. I don’t have to carry it in another bag or in my hand; I can just sling my Steam Deck up my arm and go, my hands free to fiddle with my phone or dog leash. Overall, the Steam Deck itself is still a work in progress. After my short time with it, I’d suggest waiting for the technology and developer adoption to improve. But I love the convenience of its carrying case. It was a feature I didn’t know I needed but am thrilled to have. </p><p id=\"MXlPmM\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/j6TnsQXbwiyB1vypD3ZkyRZtqfY=/0x380:3684x2309/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22720898/Steam_Deck_case.jpg",
  "description": "Lots of little thoughtful design elements went into this case.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}