{
  "title": "N64 classic F-Zero X comes to Switch this week with online play",
  "url": "https://www.theverge.com/2022/3/9/22968406/f-zero-x-nintendo-switch-online-release-date",
  "date": "2022-03-09T05:10:18.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TOCDynfR1bE7BX-hhz1vLKmklwQ=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70597468/44480_03.0.jpg\" />    </figure>  <p id=\"7Qm1eF\">F-Zero X is coming to the Nintendo Switch Online Expansion Pack library on Friday March 11th. The futuristic racing game now comes complete with online multiplayer, which of course was not included with the original version on the Nintendo 64.</p><p id=\"XcSOr4\">The sequel to popular SNES racer <em>F-Zero</em>, <em>F-Zero X</em> was released in 1998. It wasn’t the most visually lavish game even by N64 standards, but that was by design. Nintendo’s focus was making sure that the fast-paced game could run at 60 frames per second with 30 racers on the track, which was a technical achievement at the time.</p><p id=\"IPtNqr\">F-Zero X will be the thirteenth N64 game to be added to the $49.99-a-year Expansion Pack tier of Nintendo Switch Online. Last month saw the release of <a href=\"https://www.theverge.com/2022/2/18/22940427/majoras-mask-nintendo-switch-online-release-date\"><em>The Legend of Zelda: Majora’s Mask</em></a>, while future confirmed titles include <em>Pokémon Snap</em>, <em>Mario Golf</em>, and <em>Kirby 64: The Crystal Shards. </em>The Expansion Pack also gives you access to some Sega Genesis games, <em>Animal Crossing</em> DLC, and future track updates for <em>Mario Kart 8 Deluxe</em>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DaqX1jBxHE-mh_D22dzj0ZlRwqM=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23300242/44480_03.jpg",
  "description": "The 13th N64 game to hit Nintendo Switch Online.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}