{
  "title": "Namecheap ends service for Russian customers due to government’s ‘war crimes’ ",
  "url": "https://www.theverge.com/2022/3/1/22956581/russia-ukraine-namecheap-ends-service-war-crimes",
  "date": "2022-03-01T18:16:56.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mravMu8R5orLgVZoSaWGhS8r1Q4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70565936/VRG_Illo_STK010_K_Radtke_Russia_Glitch.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"C1qNz9\">Domain registrar and hosting provider Namecheap is terminating service provision for customers based in Russia in the face of what it describes as “war crimes” committed in Ukraine.</p><p id=\"V3czDU\">An email sent Monday from Namecheap to customers, and <a href=\"https://twitter.com/guar47/status/1498540413002690560\">shared online</a> by various customers of the company, reads:</p><p id=\"mKvLbA\">“Unfortunately, due to the Russian regime’s war crimes and human rights violations in Ukraine, we will no longer be providing services to users registered in Russia. While we sympathize that this war may not affect your own views or opinion on the matter, the fact is, your authoritarian government is committing human rights abuses and engaging in war crimes so this is a policy decision we have made and will stand by.”</p><p id=\"7thOrL\">The original email gave customers until March 6th to transfer domains to another provider, and states that Namecheap will assist them in the process; Namecheap has since revised this deadline to March 22nd.</p><div class=\"c-float-left\"><aside id=\"lVFOHW\"><q>“Unfortunately, due to the Russian regime’s war crimes and human rights violations in Ukraine, we will no longer be providing services to users registered in Russia”</q></aside></div><p id=\"j217F2\">Shortly after Russian military action in Ukraine began, Namecheap declared support for the people of Ukraine. In a <a href=\"https://twitter.com/NamecheapCEO/status/1497665532081889287\">tweet</a>, CEO Richard Kirkendall claimed his company opposed the Russian invasion, and “stands firmly against Russian aggression and war crimes being committed against the people of Ukraine.”</p><p id=\"NP2s8g\">Kirkendall also noted that Namecheap team members on the ground were being directly affected. On the Namecheap website, a banner link also directed visitors to a Ukrainian website sharing information on how foreign supporters could help. </p><p id=\"mHsNW5\">A <a href=\"https://domaininvesting.com/namecheap-takes-action-in-wake-of-russian-aggression/\">post</a> on the specialist DomainInvesting.com blog noted that Namecheap has a large footprint in Ukraine: at publication time, the company <a href=\"https://web.archive.org/web/20220301155853/https://www.namecheap.com/careers/location/ukraine/openings/\">listed more than 30 job openings</a> in the country, based in the cities of Kharkiv and Lviv. In the past few days Kharkiv has come under attack from Russian rockets and artillery fire, resulting in <a href=\"https://www.bbc.com/news/world-europe-60567162\">at least 10 civilian deaths and the destruction of many buildings</a>.</p><p id=\"gyHGkP\">Besides expressing opposition to the Russian invasion, the intended impact is unclear. On Twitter, many Namecheap customers expressed anger at the decision, claiming that it would impact many ordinary Russians who had no influence over the country’s military action.</p><p id=\"aQRNxg\">In one case, Moscow-based journalist Alexey Kovalyov <a href=\"https://twitter.com/Alexey__Kovalev/status/1498398243037847553\">tweeted</a> that an archive of his work since 2015, including award-winning investigative news stories, would need to be hosted at a new location.</p><p id=\"LdVosI\">Following pushback, a Namecheap spokesperson told <em>The Verge </em>that an updated policy had been communicated to Russian customers under which exceptions would be made for “all anti-regime media, protest resources, and any type of websites that are helping to end this war and regime.” Exceptions would also be made for Russians who were “no longer a resident of Russia and do not support the regime in any way,” the policy said, though it is unclear how support for the regime would be assessed.</p><div class=\"c-float-right\"><aside id=\"4xxVMO\"><q>Exceptions would be made for “all anti-regime media, protest resources, and any type of websites that are helping to end this war and regime”</q></aside></div><p id=\"3lRc9s\">Increasingly, web infrastructure organizations that have historically championed political neutrality are being forced to take sides. On February 28th, a Ukrainian official asked the Internet Corporation for Assigned Names and Numbers (ICANN) — a nonprofit organization that manages the allocation of top-level domains like .com — to revoke the .ru, .рф and .su domains, a move that would <a href=\"https://www.rollingstone.com/politics/politics-news/ukraine-icann-russia-internet-runet-disconnection-1314278/\">disconnect much of Russia from the global internet</a>.</p><p id=\"WCBAIZ\">In the US, social media companies have been able to take more carefully targeted action against Russian strategic assets: YouTube has now <a href=\"https://www.theverge.com/2022/3/1/22956114/youtube-blocks-russian-media-rt-russia-today-sputnik-europe\">blocked the Russian news channels RT and Sputnik</a>, following a <a href=\"https://www.theverge.com/2022/2/28/22955542/facebook-meta-blocks-rt-sputnik-eu-instagram\">similar policy implemented by Meta</a> across Instagram and Facebook.</p><p id=\"OswiKJ\">In Russia, some figures within the commercial technology sector are taking stands against the war. In one example, Lev Gershenzon, former head of news at Russia’s largest search engine Yandex, implored his ex-colleagues to do more to highlight the war in Ukraine.</p><p id=\"BjS32c\">“Today is the sixth day that, on the main page of Yandex, at least 30 million Russian users are seeing that there is no war,” Gershenzon wrote, according to a <a href=\"https://twitter.com/ichbinilya/status/1498633863114936321\">translation</a> by journalist Ilya Lozovsky. “Today, Yandex is a key element in hiding information about the war. Every day and hour of such ‘news’ costs human lives. And you, my former colleagues, are also responsible for this.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/f7KJr2aheHc7wDPf0i8I7FXDIG0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268168/VRG_Illo_STK010_K_Radtke_Russia_Glitch.jpg",
  "description": "CEO Richard Kirkendall said team members in Ukraine were directly affected by the war.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}