{
  "title": "NASA astronaut Mark Vande Hei scheduled to return to Earth in Russian space capsule",
  "url": "https://www.theverge.com/2022/3/29/22996778/nasa-astronaut-mark-vande-hei-russian-soyuz-return-space-station",
  "date": "2022-03-29T20:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yWsUuybNIV5UEohAmoK4ubvwbVs=/0x0:5568x3712/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70686448/iss066e139638_0.0.jpeg\" />        <figcaption><em>Mark Vande Hei on board the ISS</em> | Image: NASA</figcaption>    </figure>  <p id=\"7YhRYQ\">Record-breaking NASA astronaut Mark Vande Hei is set to return to Earth from the International Space Station on early March 30th, <a href=\"https://blogs.nasa.gov/spacestation/2022/03/28/trio-set-to-go-home-wednesday-first-private-astronaut-mission-nears/\">coming back in a Russian Soyuz rocket</a> along with two Russian cosmonauts. His scheduled journey back to the planet has been an ongoing source of strife these last few weeks, as tensions have dramatically soured between the United States and Russia after the latter’s invasion of Ukraine.</p><p id=\"L7sFMc\">Vande Hei has been on the ISS since April 2021, when he launched from Kazakhstan on another Soyuz rocket. He was originally going to stay on board for just six months, the standard length of stay for most astronauts on the ISS. But in September, <a href=\"https://twitter.com/Astro_Sabot/status/1437827415032614917\">NASA announced that Vande Hei’s stay had been extended</a> to better accommodate a few visiting tourists and a Russian movie crew that Russia sent to the ISS at the end of last year. Thanks to the extension, Vande Hei will hold the record for the longest continuous stay in space by an American: 355 days.</p><div class=\"c-float-right\"><aside id=\"55afpB\"><q>The plan has always been for Vande Hei to return in a Russian Soyuz</q></aside></div><p id=\"Rz7XsF\">The plan has always been for Vande Hei to return back to Earth in a Russian Soyuz, though he’ll be returning in a different capsule than the one he launched in. But after Russia began its invasion of Ukraine in February, some quickly wondered what that would mean for Vande Hei’s trip. Early into the invasion, <a href=\"https://www.theverge.com/2022/2/24/22947884/nasa-russia-space-cooperation-international-space-station-invasion\">NASA assured the public</a> that the space agency and Russia’s state space corporation, Roscosmos, continued to work together to maintain normal operations of the space station. And NASA noted that Vande Hei was still coming home in a Soyuz as planned.</p><p id=\"NImbqV\">However, things took a turn on March 5th when RIA Novosti, a Russian state news program, shared a video on Telegram that included footage of Vande Hei on the ISS, as well as Anton Shkaplerov and Pyotr Dubrov, the two Russian cosmonauts with whom he’s supposed to return to Earth. The video was edited in such a way to make it seem like the cosmonauts were going to leave Vande Hei behind in space. The video then depicted the entire Russian portion of the space station detaching from the rest of the ISS.</p><div id=\"ui8Beh\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/3. RIA Novosti published in social networks a video, described as \"comic\", made by Roscosmos TV studio. In this video, the cosmonauts say goodbye to the astronauts (including Mark Vande Hei)...⤵️ <a href=\"https://t.co/WKnsfDHsYS\">https://t.co/WKnsfDHsYS</a> <a href=\"https://t.co/z09BUQYhLb\">pic.twitter.com/z09BUQYhLb</a></p>— Katya Pavlushchenko (@katlinegrey) <a href=\"https://twitter.com/katlinegrey/status/1500143357716320259?ref_src=twsrc%5Etfw\">March 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"CbfbFq\">RIA Novosti described the video as a joke, but some media outlets took the depictions seriously, interpreting the footage as Russia threatening to strand Vande Hei in space. It didn’t help that Dmitry Rogozin, the head of Roscosmos, also shared the video to his Telegram channel. <a href=\"https://www.theverge.com/2022/2/25/22950498/russia-nasa-international-space-station-dmitry-rogozin-roscosmos-ukraine-iss\">Rogozin has been making a myriad of wild threats</a> about the Russian-US space partnership since the invasion began, at one point insinuating that the ISS could come crashing down on Earth if Russia pulled out of the program.</p><p id=\"N31PO5\">After <a href=\"https://www.goodmorningamerica.com/news/video/russia-threatens-abandon-american-space-83362556\"><em>Good Morning America</em></a> and <a href=\"https://video.foxnews.com/v/6300389605001#sp=show-clips\">Fox News</a> speculated about Vande Hei being left on the ISS, <a href=\"https://www.theverge.com/2022/3/14/22977362/russia-roscosmos-nasa-space-station-mark-vande-hei\">Russia officially denied the speculation</a>. “The US astronaut due to return to Earth soon will do so as scheduled on board Russia’s space capsule vehicle on March 30,” a report in TASS, another Russian state news organization, wrote. </p><div class=\"c-float-left\"><aside id=\"Fwcpwh\"><q>“We’re aware of what’s going on, but we are able to do our job to continue operations.” </q></aside></div><p id=\"fP7QKm\">NASA also reiterated that operations would continue as normal in a press conference on March 14th. “The reality is Mark Vande Hei is coming home on March 30th with Anton [Shkaplerov] and Pyotr [Dubrov]. Period,” Joel Montalbano, the ISS program manager at NASA, said during the conference when asked about the video’s supposed threat. “There’s really not much to add on that. We have confirmation from our Russian colleagues.” Montalbano also stressed that NASA and Roscosmos need each other to continue operating the space station, and that there were no immediate plans to end that partnership. “We’re not seeing any impacts of what’s going on around us. ... We’re aware of what’s going on, but we are able to do our job to continue operations,” he said.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UUkCbMuemEsxYRd_V6JBR9BaPhk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23353429/Screen_Shot_2022_03_29_at_1.49.18_PM.png\">      <cite>Image: NASA</cite>      <figcaption><em>Vande Hei and Shkaplerov share a hug after the change of command ceremony</em></figcaption>  </figure><p id=\"lFFMbJ\">Vande Hei and his two cosmonaut crewmates will say their farewells to the rest of the astronauts on the ISS around 12AM ET, before entering the Soyuz and closing the capsule’s hatch. The Soyuz will then detach from the space station around 3:21AM ET and slowly distance itself from the ISS. The capsule will eventually perform a burn of its thrusters to take itself out of orbit, setting itself on course to land in Kazakhstan under parachutes at around 7:28AM ET. Once on the ground, Vande Hei will return back to Houston, Texas, on a NASA Gulfstream jet — the same procedure for all previous astronauts returning from the ISS in the Soyuz. NASA plans to provide live coverage of each major milestone <a href=\"https://www.nasa.gov/press-release/nasa-to-provide-live-coverage-of-record-setting-us-astronaut-return\">starting at 11:30PM ET tonight</a>.</p><p id=\"EK73KI\">Despite ongoing concern about how geopolitical relations may be filtering into space, the crew of the ISS showed their unity ahead of the Soyuz’s scheduled return. On Tuesday, the crew conducted <a href=\"https://www.youtube.com/watch?v=uG7Dk4oPIrg\">a change of command ceremony</a>, with former commander Shkaplerov handing over the symbolic key to the space station to NASA astronaut Tom Marshburn ahead of the Soyuz return. During the ceremony, Shkaplerov hinted at the struggles happening on Earth. “I [am] proud I was the commander of this excellent crew,” he said. “People have problems on Earth. On orbit... we are one crew.”</p><p id=\"xXvJuN\"></p><p id=\"vdmxvv\"></p><p id=\"EYETNe\"></p><p id=\"zrjrEW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KT88guPDGoKC25365ZL47Ea5qSM=/0x399:5568x3314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23353042/iss066e139638_0.jpeg",
  "description": "Despite problems on the ground, US and Russia still continue to work together in space",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}