{
  "title": "NASA reveals first images from its new X-ray mission ",
  "url": "https://www.theverge.com/2022/2/15/22934793/nasa-supernova-ixpe-cassiopeia-stars-images",
  "date": "2022-02-15T19:35:55.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"Photo showing the imaging x-ray polarimetry explorer that launched in space early Thursday morning\" src=\"https://cdn.vox-cdn.com/thumbor/I9OyDQfAQ4h7quLMyAzIlOYGr8E=/313x0:3688x2250/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70513303/ixpe_003.0.jpeg\" />        <figcaption>Image: NASA</figcaption>    </figure>  <p id=\"LX5LuL\">On Monday, NASA <a href=\"https://www.nasa.gov/mission_pages/ixpe/news/nasa-s-ixpe-sends-first-science-image.html\">released</a> the first science images from its new Imaging X-ray Polarimetry Explorer, or IXPE. A look at the Cassiopeia A supernova — the bright remnants of a star that exploded in space in the 17th century — the image provides a first glimpse of what the space agency’s new X-ray mission will teach us about some of the most extreme events in the cosmos,<strong> </strong>like supernova explosions and cosmic collisions.</p><p id=\"b64y7w\"><a href=\"https://www.theverge.com/2021/12/9/22825940/spacex-nasa-ixpe-telescope-launch-mission-space\">Launched in early December</a>, IXPE is NASA’s first mission dedicated to studying X-ray polarization, or X-ray light whose vibrations are all aligned in a single direction. The explorer builds on the work of the Chandra X-ray Observatory by using polarization to help explain exactly where the X-ray light produced from space events comes from.</p><p id=\"NJEgiH\">The first image presented by NASA shows X-ray emissions of various intensities IXPE mapped across the supernova in mid-January. Researchers will study the data to create a first-of-its-kind X-ray polarization map of Cassiopeia A, which will provide insights into X-ray production at Cassiopeia A.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9NFANelw3SAhUj23yZ5DTRQWWLE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243742/full.png\">      <cite>Image: NASA</cite>  </figure><p id=\"255SlR\">“IXPE’s future polarization images should unveil the mechanisms at the heart of this famous cosmic accelerator,” Roger Romani, an IXPE co-investigator, said in a press release. “To fill in some of those details, we’ve developed a way to make IXPE’s measurements even more precise using machine learning techniques. We’re looking forward to what we’ll find as we analyze all the data.”</p><p id=\"idXu9p\">A second image shows the Cassiopeia A supernova in bright magenta and blue. The image uses combined data collected from both the IXPE (the magenta region) and the Chandra X-ray Observatory (the blue regions). Chandra’s data, collected shortly after that telescope first launched in 1999, revealed evidence of an object like a black hole or neutron star at the center of the supernova remnant.  </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0XLi3ar0lRXcsiQenhAccmBc0Bk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243544/chandra_ixpe_v3magentahires.jpeg\">      <cite>Image: NASA</cite>  </figure><p id=\"pWo0rB\">Cassiopeia A is the <a href=\"https://www.nasa.gov/mission_pages/ixpe/overview.html\">first of about 40 objects</a> NASA says it will study during IXPE’s first year. In addition to exploring supernovae, the mission could answer questions about objects like black holes, including how they spin and whether the black hole that sits in the center of our Milky Way once fed on surrounding material. Since space events can’t be recreated in a lab, IXPE can be a tool to answering key questions, small and large, about the physics of extreme environments.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GbDaWkCEAkG2l2OqTf0QFFJWoDA=/0x78:4000x2172/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23076162/ixpe_003.jpeg",
  "description": "The spacecraft’s first target was a famous supernova.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}