{
  "title": "NASA and SpaceX say lagging parachutes on Dragon capsule are not a problem",
  "url": "https://www.theverge.com/2022/2/4/22914726/spacex-crew-dragon-lagging-parachutes-nasa-landing",
  "date": "2022-02-04T19:57:41.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1Gdfz0Z-KNTBUIPNU4TNFp5RAB4=/218x0:2315x1398/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472526/Screen_Shot_2022_02_04_at_1.36.24_PM.0.png\" />        <figcaption><em>A screengrab of the livestream during the Crew-2 landing, showing the one lagging parachute</em> | Image: NASA</figcaption>    </figure>  <p id=\"5JF9ek\">NASA and SpaceX say they are looking into a recurring issue with lagging parachutes on SpaceX’s Crew Dragon capsule — critical features the spacecraft needs to land when it returns from orbit. However, the two spaceflight partners are downplaying the seriousness of the problem, claiming that the parachutes are still behaving safely despite the behavior.</p><p id=\"YeqdXV\">The parachute issue cropped up during the two most recent landings of SpaceX’s Crew Dragon capsule. During each of those descents to Earth, one of the four main parachutes on the spacecraft was slower to fully inflate than the other three. The lagging parachute was clearly visible during a livestream of a November landing, in which the Crew Dragon carried four astronauts home from the International Space Station. A January landing, which returned cargo from the ISS, was not livestreamed, <a href=\"https://spacenews.com/nasa-and-spacex-say-lagging-dragon-parachute-may-be-normal-phenomenon/\">but a report in <em>Space News</em> revealed</a> that one of the Dragon’s parachutes lagged there as well.</p><p id=\"bQzM9J\">Today, personnel from both NASA and SpaceX held a press conference to discuss the parachutes ahead of SpaceX’s next crew launch on the Dragon. NASA and SpaceX claimed that they are reviewing the data to understand the behavior better.</p><div class=\"c-float-right\"><aside id=\"1jdmaF\"><q>“You could have one parachute fully missing and still be certified to land.”</q></aside></div><p id=\"x3Jsdn\">During the November landing, the fourth parachute took 75 seconds longer to inflate than the other three, while the sluggish parachute on the January landing took 63 seconds longer to inflate. Despite that, NASA said the vehicles descended at a rate that was considered normal. NASA and SpaceX also claim that the Dragon can land just fine even if the fourth parachute never inflated at all. “You could have one parachute fully missing and still be certified to land,” Steve Stich, manager of NASA’s Commercial Crew Program, which oversees Dragon, said during the press conference.</p><p id=\"wl7sOo\">While the Dragon teams plan to do a full review of the parachutes, they don’t anticipate needing to make any major hardware or design changes to the Dragon vehicles. “This is more of a learning exercise of how we can improve our design and engineering understanding of parachute operation,” Bill Gerstenmaier, vice president for build and flight reliability at SpaceX, said during the presser.</p><p id=\"nt078G\">SpaceX’s Crew Dragon capsule is an essential piece of hardware for NASA, used to maintain the International Space Station. The capsule is just one of two spacecraft capable of carrying astronauts to and from the ISS at the moment. A similar version of the spacecraft is also responsible for ferrying cargo to the station.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SpQzpnUBwvcRKvnizyJdJJEntf0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23218734/51668490813_2cd4da11f5_o.jpg\">      <cite>Image: SpaceX</cite>      <figcaption><em>The Crew-2 astronauts after splashing down in the Crew Dragon</em></figcaption>  </figure><p id=\"H9AQwj\">Despite a failed cargo mission in 2015, SpaceX has been safely delivering Dragon capsules to and from the station for years now, with its first passengers flying on the vehicle in May of 2020. In November, <a href=\"https://www.theverge.com/2021/11/10/22772552/spacex-crew-3-dragon-launch-nasa-interenational-space-station-success\">SpaceX successfully launched a new four-person crew</a>, called Crew-3, to the station on Crew Dragon, just a few days after bringing home another crew, called Crew-2. During the nighttime landing of Crew-2, <a href=\"https://www.theverge.com/2021/11/8/22769970/spacex-crew-2-dragon-capsule-splash-down-success\">viewers noticed that one of the four parachutes was more sluggish to inflate</a> than the others as the vehicle dropped through the air. The slow chute eventually inflated before the Crew Dragon splashed down in the Gulf of Mexico, and all four of the astronauts exited the vehicle in good health.</p><p id=\"Qsh0K3\">After the splashdown, NASA and SpaceX implied the behavior was normal. “These parachutes have exhibited this behavior,” Stich said during a press conference following the splashdown, adding that NASA “looked at that data, and it was within the family of some of our testing.” SpaceX also said it reviewed video and data from the landing extensively before launching Crew-3 but said the behavior was expected. “It performed essentially the way it was designed to perform,” Gerstenmaier said during the November press conference after that landing.</p><p id=\"6qV4qe\">The issue arose again during the recent return of a cargo version of the Dragon, a mission known as CRS-24, which came back from the ISS on January 24th. NASA did not provide a livestream of that landing, so the lagging parachute was not public knowledge for about a week. Kathy Lueders, the associate administrator for space operations at NASA, said during today’s press conference that the space agency stopped doing livestreams of the cargo landings because of costs, but the agency now plans to do press conferences following the end of cargo missions in the future.</p><p id=\"mP2CEP\">At today’s presser, NASA and SpaceX doubled down on the claim that they’ve seen this happen before. “This lagging parachute phenomenon is something that we see with these large ring-cell parachutes,” Stich said. “We have actually seen it in other tests and other [cargo] flights, as well.” Personnel believe it’s possible that when the parachutes deploy, three of the chutes aerodynamically “shade” the other parachute, causing it to deploy more slowly.</p><div class=\"c-float-right\"><aside id=\"L6sHES\"><q>“We don’t see this as a worsening condition.”</q></aside></div><p id=\"n1F5Pp\">In addition to reviewing the data again to understand the behavior better, NASA and SpaceX say they plan to visit the vendor that supplies SpaceX’s parachutes and lay out the chutes to see if anything looks off. They also plan to do an “inflation analysis” to see if all of the cargo landing parameters were well within expectations. If that all goes well, NASA will work to clear SpaceX to fly its next crewed mission, called Crew-4, which is targeting a launch on April 15th. SpaceX also plans to fly a private crew of astronauts to the International Space Station for the company Axiom at the end of March.</p><p id=\"7LxwBl\">As for the Crew-3 Crew Dragon capsule currently docked with the International Space Station, SpaceX and NASA don’t see any changes needed. That capsule, whose parachutes couldn’t really be modified anyway, will be bringing home a crew of four this spring. </p><p id=\"XRe8DE\">When asked if the Crew Dragon was capable of landing with two parachutes, Gerstenmaier declined to answer. Instead, he noted that during testing of the parachutes, SpaceX simulated the failure of one parachute and found that the three other parachutes picked up the slack. In fact, the failed parachute helped to ensure that the three other parachutes did inflate, he argued. “We don’t see this as a worsening condition,” he said. “In fact, it’s potentially a self-correcting condition.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IDhSFohaPMsibwbmKMwgwQ4luSA=/0x36:2532x1362/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23218721/Screen_Shot_2022_02_04_at_1.36.24_PM.png",
  "description": "Two recent Dragon landings have seen the same issue.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}