{
  "title": "NASA would get $26 billion in new budget request",
  "url": "https://www.theverge.com/2022/3/28/22999641/nasa-budget-biden-request-artemis-lunar-lander",
  "date": "2022-03-28T15:18:06.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xPZfa45bDrZsNzgd7ohCzsAAh9M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70680944/lgrush_220317_5079_0015.0.jpg\" />        <figcaption>Photo by Loren Grush / The Verge</figcaption>    </figure>  <p id=\"YPHtTO\">President Joe Biden is requesting a whopping $26 billion for NASA for 2023, <a href=\"https://www.theverge.com/2022/3/9/22968740/nasa-omnibus-spending-bill-human-lunar-lander-space-station\">roughly $2 billion more</a> than the space agency received for the current fiscal year, <a href=\"https://www.whitehouse.gov/wp-content/uploads/2022/03/budget_fy2023.pdf\">according to newly released budget documents from the White House</a>. If enacted as is, a third of that budget would go toward NASA’s Artemis program – the agency’s ambitious initiative to send humans back to the Moon.</p><p id=\"AOChQY\">Roughly $7.5 billion is being set aside for Artemis, which aims to send the first woman and first person of color to the Moon as early as 2025. Part of that funding will go toward the development of a new lunar lander capable of taking humans to and from the lunar surface— a recent addition to the Artemis master plan.</p><div class=\"c-float-right\"><aside id=\"qbzzrn\"><q>Roughly $7.5 billion is being set aside for Artemis</q></aside></div><p id=\"FmM8Ib\">To get humans back to the Moon, NASA has been working on three key pieces of hardware. The first two include a mega-rocket called the Space Launch System, or SLS, and a crew capsule called Orion. The pair have been in development for the last decade and are designed to work together to take humans to the vicinity of the Moon. The third critical item needed to complete the journey is a lunar lander. Last year, NASA awarded SpaceX a $2.9 billion contract to develop the company’s new Starship vehicle into a lander for Artemis.</p><p id=\"P10gNP\">However, just last week, NASA announced plans to partner with another commercial company <a href=\"https://www.theverge.com/2022/3/23/22993287/nasa-second-human-lunar-lander-moon-artemis-spacex\">to develop a <em>second</em> lunar lander</a>. The agency had originally wanted to select two companies to build human landing systems for Artemis but was forced to only choose one <a href=\"https://www.theverge.com/2021/9/29/22689729/blue-origin-moon-lunar-lander-price-nasa-hls-foia\">after receiving just a fraction of the funding it asked for from Congress</a>. Now, NASA is requesting funds for the second lunar it wanted from the start, though the exact amount was not immediately disclosed in the new budget documents.</p><p id=\"AjL4tO\">Along with hardware for human missions, the new budget request calls for an additional $480 million to fund robotic lunar missions to help better understand the Moon’s terrain. One such mission would include a “rover to investigate ice deposits that could provide future astronauts with fuel and oxygen.” Some of that funding will also go toward NASA’s established partnerships with private companies like Intuitive Machines and Astrobotic, which are sending robotic landers to the Moon as early as this year.</p><p id=\"X4CdiT\">Apart from Artemis, the White House is setting aside $224 million to encourage the development of new commercial space stations in low Earth orbit, where the International Space Station currently resides. At the end of last year, the Biden administration announced plans to continue operations of the ISS through 2030. But eventually, that program will end, and the agency wants private space stations to be ready as replacement destinations for astronauts when that time comes.</p><div class=\"c-float-left\"><aside id=\"tmHz1c\"><q>$224 million to encourage the development of new commercial space stations</q></aside></div><p id=\"dPzypv\">Complicating matters, Russia has only agreed to keep operating the ISS through 2024. The ISS’s lifetime beyond that date is also in question lately, with Russia’s ongoing invasion of Ukraine. After the United States sanctioned Russia over the invasion, the head of Russia’s space program has made hostile threats about potentially ending the country’s partnership on the ISS program. Since the space station is designed to be run jointly by both Russia and the United States, the country’s departure after 2024 could potentially bring an early end to the ISS. While NASA has begun the process of <a href=\"https://www.nasa.gov/press-release/nasa-selects-companies-to-develop-commercial-destinations-in-space\">partnering with three private companies to develop space stations</a>, those projects are likely several years away from being ready.</p><p id=\"pRWFFN\">Also within this budget, nearly $8 billion is being set aside for science, with $2.4 billion going toward Earth science and the study of climate change with satellites in orbit around the planet. The White House is calling on the creation of a new Earth System Observatory with the new satellite missions to be funded, providing a “three-dimensional, holistic view of Earth that is needed to better understand natural hazards and climate change.” NASA is also being tasked with enhancing its monitoring of greenhouse gas emissions and sharing that data with other agencies. </p><p id=\"YX6PIn\">Meanwhile, $822 million is being set aside for NASA to work on getting samples back from Mars. Last year, the agency successfully landed its Perseverance rover on the Red Planet, a bot designed to collect samples of Martian terrain and leave them on the surface of the planet. Now, NASA is working with Lockheed Martin and the European Space Agency to develop a suite of vehicles that can bring those samples back to Earth, so that scientists can study them in greater detail and potentially understand if Mars ever once hosted life.</p><p id=\"wdufRz\"><em>Developing...</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GD_jWIBXmpfZjBbeyr0D_0Tnwr0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23326746/lgrush_220317_5079_0015.jpg",
  "description": "Tucked in there is money for a second human lunar lander",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}