{
  "title": "NASA’s new monster rocket set to roll out after more than a decade of delays",
  "url": "https://www.theverge.com/2022/3/17/22978972/nasa-sls-monster-rocket-roll-out-florida-history",
  "date": "2022-03-17T16:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Njj01-wkMBAIjPbhcH6e8IEjbNs=/0x103:1920x1383/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70636073/NHQ202203160003_large.0.jpg\" />    </figure>  <p>The rocket is headed to the launch pad with a lot of baggage</p> <p id=\"rT81BA\">After more than a decade of painstaking development and numerous delays, NASA’s new mega-rocket, the Space Launch System, will <a href=\"https://blogs.nasa.gov/artemis/2022/03/16/artemis-i-stack-ready-to-rocket-and-roll/\">roll out into the open Florida air this afternoon</a>, fully stacked and nearly ready to fly to space. Once in the great outdoors, it will embark on an 11-hour journey to its primary launchpad in Cape Canaveral, where it will undergo testing ahead of its debut flight beyond the Moon, set to occur sometime this year.</p><p id=\"pRGEtD\">It’s a major milestone that could herald the beginning of NASA’s return to the lunar surface. Designed to carry people and cargo into deep space, the Space Launch System, or SLS, is set to play a starring role in NASA’s Artemis program, the space agency’s major initiative to put the first woman and the first person of color on the Moon by the mid-2020s.</p><div class=\"c-float-right c-float-hang\"><aside id=\"KS46wN\"><q>today’s debut comes with<strong> </strong>a long and fraught history</q></aside></div><p id=\"UzHnLU\">That’s the rosy picture of SLS’s future — but today’s debut comes with<strong> </strong>a long and fraught history. SLS is perhaps best known for being perennially delayed, with the rocket’s rollout always just over the horizon. SLS was conceived in 2010 and originally promised to fly as early as 2017, only to have that target date pushed back again and again. Its tardiness has garnered the rocket plenty of critics, who also balk at the vehicle’s enormous price tag. A recent budget estimate by NASA’s inspector general puts <a href=\"https://oig.nasa.gov/docs/IG-22-003.pdf\">the cost of the rocket’s first four flights at $4.1 billion <em>each</em></a><em>, and </em>the long-term operational cost is still something of a mystery. Plenty have called for the program’s cancelation in favor of funding faster and more cost-efficient alternatives to deep space, notably those being built by nimbler commercial companies.</p><p id=\"3zjH9R\">Despite all the naysayers, the SLS team has continued to push toward the finish line.<strong> </strong>It’s paid off: the rocket is no longer a CGI animation created by NASA’s animators, but an actual rocket — engines, tanks, tubes and all — and its launch may finally be imminent. “It is good to see it actually rolling out after all the trials and tribulations,” Cristina Chaplain, a space analyst and former director of the US Government Accountability Office that audited the SLS, tells <em>The Verge</em>. “That’s what happens with a lot of these programs. They go through a lot of ups and downs, some more than others, but they get there. Twice the cost, and twice the time, but they get there.”</p><p id=\"rwtVPR\">The rocket still has a lot to prove to its critics, though, many of whom felt that the vehicle should never have existed in the first place. Even as the rocket creeps to its launch pad, there are other comparable vehicles being built — notably SpaceX’s future Starship rocket — that could do what SLS does, potentially for a much lower cost.</p><h2 id=\"FXs1fW\"><strong>Creating SLS</strong></h2><p id=\"AOQWxi\">SLS’s origins date back to 2010, when NASA was transitioning from one major human spaceflight program to another. The Space Shuttle, NASA’s primary vehicle for getting humans to and from orbit for the previous three decades, was coming to an end in 2011. Meanwhile, the space agency was working on a new initiative to return to the Moon called Constellation, a program sparked by a directive from President George W. Bush.</p><p id=\"CP25fm\">But before Constellation really got into full swing, its life was cut short. Constellation promised to use many of the same contractors and flight hardware from the Shuttle program, but its projected costs were growing quickly. A comprehensive analysis of the entire program showed that it was simply unsustainable within NASA’s projected budgets, <a href=\"https://www.nasa.gov/pdf/396093main_HSF_Cmte_FinalReport.pdf\">likely costing about $145 billion from 2010 to 2020</a>. So the incoming Obama Administration <a href=\"https://www.nbcnews.com/id/wbna35209628\">canceled it</a> in favor of promoting the development of rockets among the private sector.</p><p id=\"4zL33e\">That didn’t sit well with plenty of folks, especially the Shuttle (and Constellation) contractors who’d been relying on those jobs for decades — as well as the lawmakers who oversaw the districts where those jobs were located. “It was the industry — along with NASA people and the Hill — who wanted to take advantage of us canceling Constellation to extend the contracts and do something even bigger,” Lori Garver, NASA’s former deputy administrator who oversaw SLS’s creation, tells <em>The Verge</em>.</p><div id=\"kN05wL\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As I briefed <a href=\"https://twitter.com/POTUS?ref_src=twsrc%5Etfw\">@POTUS</a> &amp; <a href=\"https://twitter.com/Cabinet?ref_src=twsrc%5Etfw\">@Cabinet</a> today: with <a href=\"https://twitter.com/NASA_SLS?ref_src=twsrc%5Etfw\">@NASA_SLS</a> &amp; <a href=\"https://twitter.com/NASA_Orion?ref_src=twsrc%5Etfw\">@NASA_Orion</a> leading the way back to the moon and with support of our commercial partners – the U.S. is keeping high skilled jobs &amp; advancing us in the <a href=\"https://twitter.com/hashtag/NextFrontier?src=hash&amp;ref_src=twsrc%5Etfw\">#NextFrontier</a>. <a href=\"https://t.co/vpaBykfIBV\">pic.twitter.com/vpaBykfIBV</a></p>— Vice President Mike Pence Archived (@VP45) <a href=\"https://twitter.com/VP45/status/971876888447725568?ref_src=twsrc%5Etfw\">March 8, 2018</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"KwtCY8\">Garver says she was told that NASA <em>needed</em> to have a big rocket for the agency’s human spaceflight program — and NASA <em>needed</em> to be the one to oversee the rocket’s development. This was supposed to be a much more efficient and streamlined option than relying on commercial options for deep space missions. At the time, private US rockets — like ULA’s Atlas V and Delta IV, or SpaceX’s fledgling Falcon 9 rocket — would have needed to launch multiple rockets to meet NASA’s goals. NASA wanted one big rocket instead.</p><p id=\"UiUsV9\">“Each launch is an opportunity for failure,”<strong> </strong>Daniel Dumbacher — the executive director of the American Institute of Aeronautics and Astronautics who oversaw SLS’s initial development while serving as a deputy associate administrator of NASA — tells <em>The Verge</em>. “It was very clear to us that that multiple launch vehicle option was not going to be sustainable in the long haul.”</p><div class=\"c-float-right\"><aside id=\"HDXqp6\"><q>“It was sort of built on the ashes of Constellation.”</q></aside></div><p id=\"QWAq8h\">Thus a new idea was born: resurrect a big chunk of the dead Constellation program. Specifically, the plan was to morph one of the rockets designed for Constellation, called Ares V, into the SLS, a giant monster rocket that could take people into deep space. The rocket’s engines would be the same ones that propelled the Shuttle.<strong> </strong>A crew capsule called Orion, already under development for Constellation, would sit on top of the SLS and carry people into space. Constellation and Shuttle were partially revived, just under a new name.</p><p id=\"nfAREm\">The argument was that using all of these heritage designs and hardware would make development cheaper and quicker. “I think that was the biggest concern, that it kept parts [of Constellation], and what we were told at the time was, that was going to keep it from costing too much or taking too long,” Garver says. However, she wasn’t convinced that was going to work. “You’re telling us that these parts which were put together mainly for the Shuttle — which was so expensive we retired it — are now going to all of a sudden become cheap?” she remembers thinking.</p><p id=\"rmIdQW\">Ultimately, Garver and her colleagues were overruled. In 2010, after some intense lobbying by the aerospace industry, Congress mandated that NASA create the Space Launch System and Orion in the <a href=\"https://www.congress.gov/bill/111th-congress/senate-bill/3729\">2010 NASA Authorization Act</a>. And without much competition, two main contractors who’d worked on Shuttle and Constellation got the jobs: Boeing would create the bulk of the SLS and Lockheed Martin would create Orion. “It was sort of built on the ashes of Constellation,” says Chaplain.</p><h2 id=\"2PJLmJ\"><strong>A longer road than expected</strong></h2><p id=\"j0QUhM\">The journey for SLS has been long and bumpy ever since. Plenty of the promises that were made at the rocket’s inception have fallen apart. In 2014, NASA committed to Congress that development of the SLS rocket <a href=\"https://www.cbsnews.com/network/news/space/home/spacenews/files/082714_sls_commit.html\">would cost roughly $7 billion through the rocket’s first launch</a>. In November of 2021, <a href=\"https://www.theverge.com/2021/11/9/22772427/nasa-artemis-program-moon-lunar-landing-2025-delay\">the agency said development would run $11 billion</a> — and that’s just for the rocket. Orion and the ground infrastructure needed to launch the vehicles are over budget too.</p><p id=\"ZAiJjl\">Then there’s that $4.1 billion per launch price tag, which NASA’s inspector general called “unsustainable.” NASA estimated a <a href=\"https://www.space.com/17556-giant-nasa-rocket-space-launch-cost.html\">flight cost of roughly $500 million back in 2012</a>, so this new price was a big sticker shock. However, not everyone agrees that the estimate is accurate. “Those numbers are very susceptible to how they’re calculated, what’s included and what’s not,” Dumbacher says. “It also does not account for flight rate, so that as my production rate goes up, my cost comes down.”</p><p id=\"qVQ4Cz\">While the final costs may be arguable, what isn’t up for debate is that the SLS has suffered significant delays. Its<strong> </strong>first flight is five years behind schedule, and the subsequent flights have also been pushed back.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ttVJCOF1B4lNn36glks9AFwxEAU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23323537/block_1_crew_in_fligh_srb_nasaworm_eas_r4.jpg\">  </figure><p id=\"FtEEt3\">Multiple audits by <a href=\"https://oig.nasa.gov/docs/IG-20-012.pdf\">NASA’s inspector general</a> and the <a href=\"https://www.gao.gov/products/gao-19-716t\">Government Accountability Office</a> have tried to pinpoint this problem. One big culprit, they say, has been flat budgets; NASA’s bottom line has not increased significantly since SLS and Artemis were announced. Back in the 1960s, when NASA was directed to put a human on the Moon by the end of the decade, Congress gave the agency a big boost in funding to meet the directive. Not so for SLS. </p><p id=\"JKRCED\">“To operate on a flat budget, it’s making you do things a little differently that can have consequences,” Chaplain says. Without a boost in funding, the project had no cost reserves, she says, and managers started putting off tasks that needed to be addressed in a timely manner.</p><div class=\"c-float-right\"><aside id=\"sqV340\"><q>“Doing programs like this — the incentives are backwards.”</q></aside></div><p id=\"LX4Yo4\">But even with a limited budget, SLS was supposed to be cheap and easy because it came from contracts that had been more or less in operation for decades. That didn’t quite work out either, says Chaplain; SLS was a new type of vehicle, and there was a bit of a workforce gap after Shuttle ended. “If you think about Constellation, they never got to the point of having to do all that welding and building,” she says. “So when you’re actually doing that kind of production and manufacturing work, it’s a skill set that I think they struggled with.” </p><p id=\"JnDDTi\">Various audits also found welding issues, damaged tanks, and other mishaps throughout SLS development that have caused significant delays. And Boeing’s management of the program has also been repeatedly criticized. “It’s a challenging development, of course, but we did see very poor contractor performance on Boeing’s part — poor planning and poor execution,” Paul Martin, NASA’s Inspector General, said during a recent House subcommittee hearing. Dumbacher admits that it would have been better to have even more contractors in the mix for these contracts. “Frankly, one of the things we could have done early on in NASA was to do it in a way where we had more competition up front.”</p><p id=\"7cqP9T\">Auditors and others have often pointed to the SLS and Orion contracts as a major source of strife. To build this rocket, NASA awarded the contractors a cost-plus contract. It’s a type of partnership that affords the space agency significant oversight over vehicle development while also paying the contractor more and more money for the program as needed. So the longer the project takes to complete, the more money the contractor receives. Award fees are supposed to reward efficient work.</p><p id=\"bAjeLK\">But critics say such a cost structure doesn’t incentivize contractors to do their best. NASA didn’t help out much either. Despite Boeing missing its deadlines, the agency continues to give millions of dollars in award fees. “Doing programs like this — the incentives are backwards,” Garver says. “You pay contractors more the longer they take. And that’s just not how we should be doing things that we know how to do.” </p><h2 id=\"6po9Cx\"><strong>SLS’s future</strong></h2><p id=\"NjUuhC\">So what does the future of SLS hold? First, it has to pass its big test of actually going to space. Sometime this summer, if all goes well, NASA will launch the vehicle with an empty Orion capsule on top, sending it around the Moon. Astronauts will step on board the next flight, eventually culminating in a return to the Moon.</p><p id=\"ECneo0\">The long-term timeline is much murkier beyond those first lunar landings for Artemis. Still, NASA has zero plans to cancel SLS any time soon, and the rocket benefits from strong support in Congress; people all over the country work on the vehicle, garnering support from plenty of lawmakers in various districts.</p><div class=\"c-float-right\"><aside id=\"EqqBYs\"><q>“I think it’s going to be the last rocket that’s done by the government, surely.”</q></aside></div><p id=\"6yKasU\">But as SLS takes its first big strut, some say the future of deep-space exploration will soon be in the hands of the private sector. SpaceX is currently building its massive new Starship vehicle in Texas, a rocket system that could be more capable than SLS when complete. SpaceX CEO Elon Musk claims it will be cheaper to develop, too, <a href=\"https://www.youtube.com/watch?v=3N7L8Xhkzqo\">costing about 5 or 10 percent of the cost of NASA’s Saturn V rocket</a>, which took humans to the Moon. It’s unclear what exact number he was referencing, but the Planetary Society estimates that <a href=\"https://www.planetary.org/space-policy/cost-of-apollo\">the US spent roughly $66 billion (adjusted for inflation) on the Saturn V</a>. Just 10 percent of that is still cheaper than SLS.</p><p id=\"aFPN6h\">That’s all based on Musk’s predictions, though, which aren’t always accurate. And there’s still quite a lot that SpaceX needs to do to prove that Starship works. It needs to launch to orbit, and it needs to prove it can be refueled in space. Unlike SLS, Starship will need multiple propellant refillings to reach the Moon, and SpaceX has never tested such a technology before.</p><p id=\"yQPd2E\">Still, NASA has decided to take a big bet on SpaceX, <a href=\"https://www.theverge.com/2021/4/16/22387887/elon-musk-spacex-win-nasa-lunar-lander-contract-artemis\">giving the company a $2.9 billion contract</a> to develop Starship as a lander that can take people to and from the lunar surface. And the contract is fixed-price, meaning SpaceX puts in its own money for development, while NASA hands over one lump sum. The expectation is that it’ll help incentivize SpaceX to keep down costs since the company’s business is on the line. </p><p id=\"C6mmyO\">It’s still very early days, but now that SpaceX and others are becoming more advanced, it’s possible that programs like the SLS will be the way of the past. “I think it’s going to be the last rocket that’s done by the government, surely,” Dumbacher says. “With the experience we’ve seen with SpaceX and Blue Origin and emerging space economy, there is no need to go do another launch vehicle the way we started one in 2010.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VFVUNl1wZVT5LGpivmAFJWX_n84=/0x241:1920x1246/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23323447/NHQ202203160003_large.jpg",
  "description": "SLS is delayed, over budget, and about to make its big debut.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}