{
  "title": "NASA engineers trying to figure out strange readings from aging interstellar spacecraft",
  "url": "https://www.theverge.com/2022/5/20/23132419/nasa-jpl-voyager-1-spacecraft-data-readings-interstellar-space",
  "date": "2022-05-20T16:35:42.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7qwUZjI3-HUPSbFGIWmcPgqRl0o=/82x0:961x586/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70892606/voyager_illustration_with_stars_1041.0.jpeg\" />    </figure>  <p id=\"xUWv1y\">The engineering team operating the Voyager 1 spacecraft — NASA’s robotic planetary explorer currently zooming through interstellar space — is trying to figure out <a href=\"https://www.jpl.nasa.gov/news/engineers-investigating-nasas-voyager-1-telemetry-data\">why the spacecraft is sending back data readouts that don’t match</a> what the vehicle is actually doing. It’s a mystery that does not seem to be putting the Voyager 1 spacecraft in any immediate jeopardy, but NASA is trying to figure it out nonetheless.</p><p id=\"nucpBM\">Launched in 1977, Voyager 1 has been exploring the cosmos for nearly half a century. It has a twin, Voyager 2, that was launched 16 days prior in the same year. Both spacecraft did tours of the outer Solar System, flying by planets and photographing moons before eventually traveling outside the boundary of our cosmic neighborhood. In 2012, Voyager 1 <a href=\"https://voyager.jpl.nasa.gov/mission/interstellar-mission/#:~:text=On%20Aug.,billion%20kilometers)%20from%20the%20sun.\">passed the heliopause</a> — the boundary where the Sun’s solar wind ends and the interstellar medium begins. At a distance of 14.5 billion miles from Earth, <a href=\"https://solarsystem.nasa.gov/missions/voyager-1/in-depth/\">Voyager 1 is the farthest human-made object in space</a>.</p><div class=\"c-float-right\"><aside id=\"kHgtrd\"><q>It’s a mystery that does not seem to be putting the Voyager 1 spacecraft in any immediate jeopardy</q></aside></div><p id=\"paV2Bh\">But the farther Voyager 1 gets from Earth, the likelihood for weird things to happen with the spacecraft goes up. Right now, the spacecraft’s attitude articulation and control system, or AACS, is acting up. It’s the system that’s responsible for maintaining the vehicle’s orientation in space as well as pointing the probe’s high-gain antenna, which is used to send and receive signals from Earth. The AACS is still working as it should as far as the engineers can tell. But it’s returning data that doesn’t accurately describe what the system is doing, according to NASA. “For instance, the data may appear to be randomly generated, or does not reflect any possible state the AACS could be in,” NASA wrote in a press release.</p><p id=\"FV7Lse\">Voyager 1 still<strong> </strong>seems okay in all other respects. It’s in communication with the engineering team and it’s collecting science data as it’s supposed to, NASA says. And the AACS issue hasn’t prompted the spacecraft to go into safe mode, a type of operating procedure in which the spacecraft powers down most of its instruments and only focuses on its most essential functions to stay alive.</p><p id=\"0AbvAG\">So, basically, the team is forging ahead while trying to figure out what’s going on<strong> </strong>in the meantime. “A mystery like this is sort of par for the course at this stage of the Voyager mission,” Suzanne Dodd, project manager for Voyager 1 and 2 at NASA’s Jet Propulsion Laboratory, said in a statement. “The spacecraft are both almost 45 years old, which is far beyond what the mission planners anticipated. We’re also in interstellar space – a high-radiation environment that no spacecraft have flown in before.” </p><p id=\"U9F3YR\">A fix could come in the form of a software patch. Or the Voyager 1 team may just learn to deal<strong> </strong>with it. Adapting is a way of life for the Voyager teams. The power on both Voyager 1 and Voyager 2 is <a href=\"https://voyager.jpl.nasa.gov/news/details.php?article_id=114\">diminishing over time</a> since the nuclear batteries that keep the spacecraft running are slowly decaying. The teams have already had to turn various systems off on the spacecraft — but somehow the science instruments are still running, even after all this time.</p><p id=\"oW9i1h\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kv13CUWiCuYmBguaqjbZ32jJORg=/0x21:1041x566/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23577247/voyager_illustration_with_stars_1041.jpeg",
  "description": "Voyager 1 is doing one thing and saying another.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}