{
  "title": "NASA’s human Moon lander program finally gets full funding in new budget bill",
  "url": "https://www.theverge.com/2022/3/9/22968740/nasa-omnibus-spending-bill-human-lunar-lander-space-station",
  "date": "2022-03-09T19:42:59.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"NASA VAB. Vehichle assembly building\" src=\"https://cdn.vox-cdn.com/thumbor/qAMoOjP-4irzdIhdSjrsuWSTV3I=/284x0:4615x2887/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70600623/1031868478.0.jpg\" />        <figcaption>Photo by Jonathan Newton / The Washington Post via Getty Images</figcaption>    </figure>  <p id=\"mVRqhQ\">If Congress’ sweeping new spending bill is signed, it would finally provide full funding to some major NASA projects that have been underfunded over the last few years. Notably, NASA’s program to develop a new human lunar lander would be fully funded as the president’s budget requested, as will a program to develop new commercial space stations in low Earth orbit.</p><p id=\"Ty667D\">Overall, <a href=\"https://docs.house.gov/billsthisweek/20220307/BILLS-117RCP35-JES-DIVISION-B.pdf\">NASA would receive $24.041 billion for 2022 in this new bill</a>, which will fund the US government for fiscal year 2022.<strong> </strong>NASA’s portion is roughly $800 million less than the $24.8 billion that <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/fy2022_congressional_justification_nasa_budget_request.pdf\">President Joe Biden’s budget request called for in May of 2021</a>. However, NASA would still see a slight bump from its total funding for fiscal year 2021, which sat at $23.27 billion.</p><p id=\"kvhjCN\">Though Congress’s plan would not fully meet the president’s budget request, there are a few projects that House and Senate lawmakers are finally agreeing to fund in their entirety. The bill would give NASA’s human landing system the full $1.195 billion that the request asked for. Currently, NASA is developing a new human lunar lander as part of its Artemis program, an initiative to send the first woman and first person of color to the Moon. Previously, Congress showed its reluctance to give NASA the money it requested for the lander. For 2021, <a href=\"https://spacepolicyonline.com/news/final-fy2021-nasa-funding-provides-only-25-percent-of-hls-request/\">appropriators only provided $850 million</a> of the <a href=\"https://www.theverge.com/2020/11/10/21558572/nasa-senate-appropriations-artemis-program-moon-landers\">requested $3.4 billion for the lander</a>.</p><div class=\"c-float-right\"><aside id=\"P8sqBx\"><q>a few projects that House and Senate lawmakers are finally agreeing to fund in their entirety</q></aside></div><p id=\"4wN3q7\">As a result of the cash shortfall, NASA made some changes to its Artemis plans. Originally, the space agency hoped to choose at least two commercial companies to build human lunar landers for Artemis as a way to spark competition and have redundancy. But with only a fraction of the money for the program, <a href=\"https://www.theverge.com/2021/4/16/22387887/elon-musk-spacex-win-nasa-lunar-lander-contract-artemis\">NASA selected only one company</a>, SpaceX, to develop its Starship vehicle into a lander, <a href=\"https://www.theverge.com/2021/9/29/22689729/blue-origin-moon-lunar-lander-price-nasa-hls-foia\">citing the company’s low price tag</a> as a big consideration in that decision. </p><p id=\"61368P\">Now, if NASA receives the money it requested for the landing system this year, Congress is calling on the space agency to “deliver a publicly available plan explaining how it will ensure safety, redundancy, sustainability, and competition” in the human lunar lander program, within 30 days of the bill’s signing. Congress is also asking NASA to provide a detailed list of resources it needs through 2026 to meet those goals. The wording does not explicitly say that NASA must pick a second company to develop a human lander, though an <a href=\"https://spacepolicyonline.com/news/house-appropriators-want-second-hls-but-offer-meager-money/\">earlier version of a House appropriation bill</a> expressed concern at the agency’s decision to pick just one company.</p><p id=\"qhnVf8\">Another area at NASA that has been notoriously underfunded is the agency’s program to develop a successor to the International Space Station. Residing in low Earth orbit, the ISS is funded<strong> </strong>through 2024, though the Biden administration <a href=\"https://blogs.nasa.gov/spacestation/2021/12/31/biden-harris-administration-extends-space-station-operations-through-2030/\">announced plans to extend operations through 2030</a>. (It’s unclear whether Russia will hop on board with that, <a href=\"https://www.theverge.com/2022/2/25/22950498/russia-nasa-international-space-station-dmitry-rogozin-roscosmos-ukraine-iss\">considering the current circumstances</a>.) Regardless, once the space station program ends, NASA hopes to have nurtured the private space industry into developing their own commercial space stations that would take over the domain of low Earth orbit. They could provide platforms for NASA’s astronauts to visit in the post-ISS era.</p><p id=\"Yd4p8Y\">However, NASA has struggled to get money for this transitional program. For 2020 and 2021, NASA requested $150 million for both fiscal years, but Congress only appropriated $15 million and then $17 million. For 2022, however, NASA requested $101.1 million for this year, and appropriators allotted the full amount in the new bill.</p><p id=\"6ZOvNB\">As for NASA’s other programs, funding is staying relatively stable. NASA’s biggest human spaceflight projects, the Space Launch System rocket and Orion crew capsule, would receive their full funding amount, with a little more than requested for SLS. Science is receiving $7.614 billion, less than the budget request but up from last year. The space agency would also receive the full $653 million it requested to work toward a Mars sample return, which would work to bring samples collected by NASA’s Perseverance rover back to Earth. Additionally, NASA’s SOFIA program, a flying observatory on a modified Boeing 747, still continues to receive funding <a href=\"https://spacenews.com/astrophysics-decadal-survey-recommends-nasa-terminate-sofia/\">despite calls for its cancelation</a>.</p><p id=\"28CRUW\">There are shortfalls in other areas, too. But notably, even the big-budget items — including the human lunar lander and commercial space station development — can’t use all of their money just yet. The bill says that these projects and others can only receive 40 percent of the allotted amounts until NASA’s administrator submits a multi-year plan for Artemis and NASA’s Moon efforts that includes dates for major milestones, partnerships, and more, along with funding estimates to achieve these milestones. So while some NASA programs are seeing a boost in funding, there’s still more work to be done before that money can be put to use.</p><p id=\"czJX4N\"></p><p id=\"7S0zQa\"></p><p id=\"Glufzp\"></p><p id=\"2tTLL0\"></p><p id=\"OiA4bG\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7snxMmmtaZMK6L9iN8kDzuMD844=/0x162:4898x2726/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23301731/1031868478.jpg",
  "description": "It still needs to be signed, though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}