{
  "title": "NASA’s InSight lander detects largest ‘marsquake’ yet on Red Planet",
  "url": "https://www.theverge.com/2022/5/10/23065073/nasa-insight-lander-marsquake-red-planet",
  "date": "2022-05-10T15:01:43.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/k8cA5tyKqJWz31ANZoBFRYDeA6M=/0x71:3508x2410/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70852418/InSight_Nature_papers.0.jpg\" />    </figure>  <p id=\"685Cpw\">NASA’s beleaguered InSight lander on Mars has detected a magnitude 5 “marsquake” — the <a href=\"https://www.jpl.nasa.gov/news/nasas-insight-records-monster-quake-on-mars\">largest one the spacecraft has felt yet</a> since <a href=\"https://www.theverge.com/2018/11/26/18112781/nasa-insight-mars-lander-landing-success-supersonic-parachute\">landing on the planet in November of 2018</a>. It’s a major moment that comes during a fraught time for InSight, as the spacecraft’s solar panels continue to gather dust that will eventually bring an end to the vehicle’s life on Mars.</p><p id=\"kqQGSR\">InSight’s mission on the Red Planet has been to <a href=\"https://www.theverge.com/2018/5/3/17304842/nasa-insight-mission-mars-lander-quakes-seismology\">probe the interior of Mars</a>, primarily by sensing for tremors from the surface. Unlike quakes here on Earth, which are typically caused by shifting tectonic plates, “marsquakes” are thought to be caused by the cooling of Mars over time, which causes the planet’s crust to become more brittle and crack. Equipped with an extremely sensitive seismometer built by France’s space agency, InSight has detected more than 1,313 quakes since landing three and a half years ago, according to NASA.</p><div class=\"c-float-right\"><aside id=\"0j8YQJ\"><q>“we’ve been waiting for ‘the big one’”</q></aside></div><p id=\"Knl6lG\">The initial quakes that InSight felt were <a href=\"https://www.theverge.com/2020/2/24/21150737/nasa-marsquakes-mars-earthquake-lander-insight-research\">relatively low-magnitude</a>. Before now, the largest marsquake the spacecraft had detected was a magnitude 4.2. This latest 5-pointer, detected on May 4th, is still pretty weak compared to those we sometimes experience on Earth, but NASA says it’s close to the strongest kind of quake scientists expected to see on Mars. Now, the InSight team will dive into the data from the quake to learn more about its origin and scope. “Since we set our seismometer down in December 2018, we’ve been waiting for ‘the big one,’” Bruce Banerdt, InSight’s principal investigator at NASA, said in a statement. “This quake is sure to provide a view into the planet like no other.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tq219AZW-yai-ZRjT5HGTV47UXo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450517/S1222a_spectrogram1_hKYMbXU.jpeg\">      <cite>Image: NASA</cite>      <figcaption><em>A spectrogram of the magnitude 5 marsquake detected by InSight.</em></figcaption>  </figure><p id=\"fgHCYs\">It’s a win for InSight, which has struggled ever since its landing. The mission’s first major issue arose when the spacecraft tried to deploy one of its main instruments shortly after landing: a heat probe called the “mole.” Designed to dig itself underneath the Martian surface to measure the internal temperature of the planet, the mole could never acquire the right friction it needed to burrow deep into the soil. Intended to reach a depth of up to 16 feet, the mole barely made it just below the surface. Finally, after two years of trying, NASA <a href=\"https://www.nasa.gov/feature/jpl/nasa-insight-s-mole-ends-its-journey-on-mars\">decided to end the mole’s burrowing attempts</a> in order to focus on InSight’s overall mission.</p><div class=\"c-float-right\"><aside id=\"w6VBhT\"><q>InSight has also been having a difficult time of late</q></aside></div><p id=\"TtCRYu\">But InSight has also been having a difficult time of late. In January, <a href=\"https://mars.nasa.gov/news/9110/nasas-insight-sees-power-levels-stabilize-after-dust-storm/?site=insight\">a particularly thick Martian dust storm</a> blocked enough sunlight from reaching InSight’s solar panels, decreasing the spacecraft’s power supply. In response, InSight entered safe mode, a type of operating procedure in which the spacecraft ceases all but the most essential tasks it needs to perform to survive. Eventually, InSight exited safe mode and started producing full power again. But dust continues to accumulate on InSight’s solar panels, and the vehicle doesn’t have a way to significantly clean its hardware (though NASA has tried a <a href=\"https://mars.nasa.gov/resources/25952/insights-robotic-arm-helps-remove-solar-panel-dust-trickles-sand-in-the-wind/?site=insight\">few unconventional techniques</a>). Since there hasn’t been any particularly strong winds to blow off the dust, InSight will eventually stop producing enough power to continue functioning, which is <a href=\"https://spacenews.com/insight-recovers-from-dust-storm-as-landers-power-continues-to-wane/\">expected to occur sometime later this year</a>.</p><p id=\"kkR1zE\">Despite all of this, InSight has performed its major goals as expected. Its primary mission ended in December of 2020, and the lander is currently in its extended mission, which lasts until December of 2022. As of now, there’s still time left to detect more marsquakes until the power runs out.</p><p id=\"oy9rSP\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4hcViz4W3oJK9W57fv7q2UcTIjo=/0x322:3508x2159/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23450525/InSight_Nature_papers.jpg",
  "description": "A big win for InSight as it slowly gathers dust",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}