{
  "title": "NASA picks Lockheed Martin to build rocket that can launch samples of dirt off of Mars",
  "url": "https://www.theverge.com/2022/2/8/22923320/nasa-lockheed-martin-mars-sample-return-mav-rocket-perseverance",
  "date": "2022-02-08T15:28:07.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/q6uAwto7nHST0fa3elrRTDT1FX8=/0x0:5333x3555/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70483782/PIA23496___MAV_Launch.0.jpg\" />        <figcaption><em>An artistic rendering of what the MAV could look like launching from Mars</em> | Image: NASA</figcaption>    </figure>  <p id=\"fx3XSE\">NASA has <a href=\"https://www.nasa.gov/press-release/nasa-selects-developer-for-rocket-to-retrieve-first-samples-from-mars\">picked space and defense contractor Lockheed Martin</a> to build a small rocket capable of lifting off from the surface of Mars carrying samples of the Red Planet’s rocks and other materials. The decision is a big step in a long journey to eventually bring pristine pieces of Mars back to Earth so that scientists can study them in greater detail. If successful, Lockheed Martin’s rocket could become the first to launch from another planet.</p><p id=\"ZdV0ld\">The rocket that Lockheed Martin is charged with building is known as the “Mars Ascent Vehicle,” or the MAV. It’s a key part of NASA’s plan to retrieve samples of Martian dirt that are currently being gathered by the space agency’s Mars rover, Perseverance. Last year, NASA <a href=\"https://www.theverge.com/2021/2/18/22289668/nasa-mars-perseverance-rover-success\">successfully landed Perseverance on Mars</a> with the explicit goal of gathering samples of the Martian environment <a href=\"https://www.theverge.com/2020/7/28/21307109/nasa-mars-rover-perseverance-launch-date-alien-life\">while looking for signs of life</a>. Perseverance has gathered a handful of samples so far and will eventually leave them on the surface of Mars to be picked up later.</p><div class=\"c-float-right\"><aside id=\"QdcTrb\"><q>For decades, scientists have been dreaming about returning samples from Mars</q></aside></div><p id=\"n8xZIg\">For decades, scientists have been dreaming about returning samples from Mars to learn more about what’s going on in the Martian dirt, including if the planet ever hosted alien life. Studying the Martian environment with robots from afar can only tell us so much — we need to study samples of Mars here on Earth with sophisticated laboratory instruments. But Mars sample return is an incredibly complex kind of mission. It entails landing a rocket on the Red Planet that can take off again — something that’s never been done before. </p><p id=\"hcqZr2\">NASA says it is giving Lockheed Martin a cost-plus contract to make the MAV, potentially worth up to $194 million. The contract will span six years, beginning no later than February 25th, NASA says. Under its agreement with NASA, Lockheed Martin will develop multiple test units of the MAV as well as the final flight unit. Creating the MAV is going to be a big engineering challenge since it has to be small enough to fit on a lander but hardy enough to withstand the harsh Mars environment.</p><p id=\"ggGNz0\">The MAV is only one piece of the <a href=\"https://mars.nasa.gov/msr/\">much larger Mars sample return puzzle</a> — plenty of other spacecraft will need to be built, too. NASA envisions building a lander called the Sample Retrieval Lander, which would carry the MAV to the surface of the Red Planet. NASA and the European Space Agency, ESA, are also <a href=\"https://mars.nasa.gov/news/9096/nasa-begins-testing-robotics-to-bring-first-samples-back-from-mars/\">planning to build a separate rover</a> that would go pick up the samples that Perseverance left behind and bring them to the Sample Retrieval Lander. Those samples would then be transferred to the rocket before it blasts off with its precious cargo in tow. Once in space, the MAV would rendezvous with <em>another</em> spacecraft, being built by ESA, which would then carry the samples to Earth.</p><p id=\"DbBtwR\">It’s a lot of moving parts that are going to take the better part of a decade to come together. Right now, NASA estimates that the Sample Retrieval Lander will land by 2026 at the earliest, and the samples won’t arrive at Earth until the early 2030s. But if NASA and ESA — and now Lockheed Martin — <em>can</em> pull this off, pristine Mars samples will be returned to Earth. That would put us one step closer to answering the ultimate question: does life exist on other worlds?</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5Jv7vDGN1KbOAsJxeq0fM6uBZ1M=/0x224:5333x3016/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23226302/PIA23496___MAV_Launch.jpg",
  "description": "A key part of NASA’s plan to study pieces of Mars on Earth",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}