{
  "title": "NASA announces plans to develop second Moon lander, alongside SpaceX’s Starship",
  "url": "https://www.theverge.com/2022/3/23/22993287/nasa-second-human-lunar-lander-moon-artemis-spacex",
  "date": "2022-03-23T21:47:25.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/i1pavlwXAAGWuJpzpqnR4GrsbDk=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70663678/taking_in_the_view_surface_from_hls.0.jpeg\" />    </figure>  <p id=\"AR6Kwu\">Today, NASA announced <a href=\"https://www.nasa.gov/press-release/nasa-provides-update-to-astronaut-moon-lander-plans-under-artemis\">plans to develop a second human lunar lander</a> for its Artemis program, the agency’s major spaceflight initiative to send humans back to the Moon. To build the vehicle, the space agency is calling on commercial space companies to propose concepts for landers that can take people to and from the Moon’s orbit and the lunar surface, with the goal of having them ready by 2026 or 2027 at the earliest.</p><p id=\"GI2yXL\">NASA already holds a contract with commercial partner SpaceX to develop a lunar lander for Artemis, which aims to land the first woman and the first person of color on the Moon. In 2021, the space agency <a href=\"https://www.theverge.com/2021/4/16/22387887/elon-musk-spacex-win-nasa-lunar-lander-contract-artemis\">awarded a sole contract to SpaceX worth $2.9 billion</a> to develop the company’s future Starship vehicle into a lander that can take humans to and from the lunar surface. As of now, both NASA and SpaceX are working toward conducting the first Artemis lunar landing as early as 2025, <a href=\"https://oig.nasa.gov/docs/IG-22-003.pdf\">though that timeline is considered unlikely</a>.</p><div class=\"c-float-right\"><aside id=\"FBBtJi\"><q>NASA had originally wanted to pick two companies to develop human lunar landers</q></aside></div><p id=\"ZufGw5\">NASA had originally wanted to pick two companies to develop human lunar landers for Artemis in order to inspire competition and keep down costs. The agency was going to pick the two winners from three finalists: SpaceX, Blue Origin, and Dynetics. But the agency ultimately chose one, <a href=\"https://www.theverge.com/2021/9/29/22689729/blue-origin-moon-lunar-lander-price-nasa-hls-foia\">primarily due to budget constraints</a>. For the year 2021, NASA had requested $3.4 billion from Congress to fund the development of Artemis lunar landers but <a href=\"https://spacepolicyonline.com/news/final-fy2021-nasa-funding-provides-only-25-percent-of-hls-request/\">only received $850 million</a>, just 25 percent of what was asked. As a result, NASA went with SpaceX, in part because the company had offered the most affordable bid.</p><p id=\"sSFeLh\">However, the decision to simply pick one company didn’t sit well with the losing finalists. Blue Origin proceeded to <a href=\"https://www.theverge.com/2021/8/16/22623022/jeff-bezos-blue-origin-sue-nasa-lawsuit-hls-lunar-lander\">sue NASA in federal court over the selection</a>, though the company <a href=\"https://www.theverge.com/2021/11/4/22763384/blue-origin-lawsuit-nasa-spacex-lost-human-lunar-lander-artemis\">ultimately lost its case</a>. Despite the lawsuit, NASA administrator Bill Nelson <a href=\"https://spacenews.com/nelson-remains-hopeful-congress-will-provide-additional-lunar-lander-funding/\">expressed his desire to eventually have two lunar lander providers</a>, with hopes that Congress would fund the initiative. And at one point, it looked as if Congress would direct NASA to make that happen. In October, the Senate Appropriation Committee introduced a bill that <a href=\"https://spacenews.com/senate-appropriators-direct-nasa-to-select-second-artemis-lunar-lander/\">would direct NASA to pick a second company to develop a lunar lander for Artemis</a>. However, the most recent budget bill that was signed for 2022 did not force NASA to do that, but it did give the space agency the <a href=\"https://www.theverge.com/2022/3/9/22968740/nasa-omnibus-spending-bill-human-lunar-lander-space-station\">full $1.195 billion it asked for to develop lunar landers</a>.</p><div class=\"c-float-left\"><aside id=\"Oj2Hxj\"><q>“I promised competition, so here it is.”</q></aside></div><p id=\"3irwBz\">Now, ahead of President Joe Biden’s budget request expected next week, NASA is announcing official plans to select another company’s lunar lander, as the agency had wanted to do all along. “Competition leads to better, more reliable outcomes,” Nelson said during a press conference announcing the news. “It benefits everybody. It benefits NASA. It benefits the American people.” Nelson added: “I promised competition, so here it is.” NASA now plans to put out a draft call for proposals at the end of the month, with plans to release a final call later this spring. Everyone but SpaceX will be able to compete in this new competition for a contract.</p><p id=\"LNFpnS\">In light of this announcement, NASA says it will make some changes to SpaceX’s existing contract. NASA’s original contract with the company has SpaceX conducting an uncrewed landing on the Moon as a demonstration test before conducting the first crewed landing in the mid-2020s. That first landing, which will mark NASA’s return to the Moon with humans since the 1970s, will be called Artemis III and should receive plenty of attention. After that, SpaceX would have moved on to a new operational contract with NASA, where the space agency would buy individual flights of the Starship lander to continue going back to the Moon.</p><p id=\"nhsSrY\">Now, NASA plans to work with SpaceX under its original contract to conduct a possible third crewed landing after Artemis III. Then after that, SpaceX and the new company that NASA picks would presumably compete for upcoming Artemis missions — that is, if the providers are ready.</p><p id=\"mrTgGV\">A lot of this depends on buy-in from Congress, which may happen since some lawmakers indicated their desire for NASA to pick a second lunar lander. NASA would not say how much it plans to ask for in development funding, but with President Biden’s budget request <a href=\"https://www.bloomberg.com/news/articles/2022-03-18/biden-to-issue-2023-government-spending-plan-on-march-28\">scheduled for release on March 28th</a>, the numbers should be available fairly soon. Nelson says he expects the funds to materialize. “We’re expecting to have both Congress support and that of the Biden administration, and we’re expecting to get this competition started in the fiscal year 2023 budget.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dSdfKIzLc6ea8xak4UkiheUhoaM=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340810/taking_in_the_view_surface_from_hls.jpeg",
  "description": "NASA is going with its original plan.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}