{
  "title": "NASA delays dress rehearsal of new megarocket",
  "url": "https://www.theverge.com/2022/4/3/23009017/nasa-dress-rehearsal-delay-artemis-space-launch-system-megarocket",
  "date": "2022-04-03T23:25:38.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NtOl9aZWRg7Cy-nSq5f0Hg2OIAs=/0x0:2048x1365/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70705876/nasa_artemis_i_dress_rehearsal.0.jpg\" />        <figcaption>Image: NASA/Joel Kowsky via <a class=\"ql-link\" href=\"https://www.flickr.com/photos/nasahqphoto/51979615973/\" target=\"_blank\">Flickr</a></figcaption>    </figure>  <p id=\"NFoTzL\">Today, NASA suspended the last major test of its Space Launch System (SLS) rocket after pressurization issues prevented technicians from safely loading propellants into the rocket. The test — known as a wet dress rehearsal — has been postponed until Monday, April 4th at the earliest, NASA announced in <a href=\"https://blogs.nasa.gov/artemis/2022/04/03/artemis-i-wet-dress-rehearsal-scrub/\">a post on the Artemis I live blog</a>.</p><p id=\"AM7AV5\">“Teams have decided to scrub tanking operations for the wet dress rehearsal due to loss of ability to pressurize the mobile launcher,” NASA explained. Some fans on the mobile launcher — the platform that provides support for the rocket up until launch — were unable to maintain positive pressure, which is crucial in warding off hazardous gases. As a result, NASA technicians couldn’t “safely proceed” with the fuel-loading process. </p><div id=\"G03jXd\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">For safety, we've stopped the <a href=\"https://twitter.com/hashtag/Artemis?src=hash&amp;ref_src=twsrc%5Etfw\">#Artemis</a> I wet dress rehearsal. Teams are meeting now to assess next steps. We are looking at Monday, April 4 as the next opportunity to resume operations, and will have a media briefing later today. Check here for updates. <a href=\"https://t.co/pweviGRjwg\">https://t.co/pweviGRjwg</a></p>— NASA (@NASA) <a href=\"https://twitter.com/NASA/status/1510650025260445696?ref_src=twsrc%5Etfw\">April 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"4PjAIw\">This type of dress rehearsal gets its “wet” label since it’s essentially a run-through of all the procedures NASA will have to carry out when the first actual launch of SLS takes place, including filling the 322-foot rocket with 700,000 gallons of propellant. In a <a href=\"https://youtu.be/9jPTnp7BEvw\">press conference</a> on Sunday evening, NASA said its team is currently on the launchpad attempting to troubleshoot the issue. The agency says it’s on track to resume the wet dress rehearsal tomorrow.</p><p id=\"Ukgeq1\"><a href=\"https://www.theverge.com/2022/4/1/23004668/nasa-space-launch-system-rocket-wet-dress-rehearsal\">The test originally began on April 1st</a> at the Kennedy Space Center in Florida and was supposed to wrap up on Sunday. NASA encountered some rough weather Saturday night, as <a href=\"https://blogs.nasa.gov/artemis/2022/04/02/teams-proceeding-with-overnight-operations-for-artemis-i-wet-dress-rehearsal/\">lightning struck</a> the towers around the SLS’s launchpad. Jeremy Parsons, the deputy program manager at NASA’s Exploration Ground Systems, said one of these strikes was one of the strongest NASA has seen since installing the lightning protection system. “It hit the catenary wire that runs between the 3 towers,” Parsons <a href=\"https://twitter.com/NASAGroundSys/status/1510583474595450884\">wrote in a tweet</a> from the EGS Twitter account. “System performed extremely well &amp; kept SLS and Orion safe.”</p><p id=\"LEsYFv\">The SLS is supposed to carry the Orion spacecraft on an uncrewed mission around the Moon as part of <a href=\"https://www.nasa.gov/feature/around-the-moon-with-nasa-s-first-launch-of-sls-with-orion\">the Artemis program</a>, a flight called Artemis I. That mission, tentatively scheduled for this summer, is supposed to get the rocket — and NASA — ready for the mission that <a href=\"https://www.theverge.com/2021/11/9/22772427/nasa-artemis-program-moon-lunar-landing-2025-delay\">will eventually carry humans to the lunar surface</a>. </p><p id=\"rUyHgb\">You can keep checking back for updates on the test on <a href=\"https://blogs.nasa.gov/artemis/\">NASA’s live blog</a>, as well as on the agency’s <a href=\"https://twitter.com/NASA\">Twitter</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-r9UxYc2Fae8cKGopzrieK172kE=/0x33:2048x1105/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23364831/nasa_artemis_i_dress_rehearsal.jpg",
  "description": "NASA will resume the test on Monday.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}