{
  "title": "NASA to conduct elaborate dress rehearsal with new megarocket this weekend",
  "url": "https://www.theverge.com/2022/4/1/23004668/nasa-space-launch-system-rocket-wet-dress-rehearsal",
  "date": "2022-04-01T18:19:59.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/k9QQrW_Uc75i8GmGir8Pmxy5gro=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70699365/lgrush_220318_5079_0054.0.jpg\" />        <figcaption>NASA’s Space Launch System on the launchpad at Kennedy Space Center | Photo by Loren Grush / The Verge</figcaption>    </figure>  <p id=\"X6KLxh\">For the next three days, NASA is staging an elaborate dress rehearsal with its massive new rocket, the Space Launch System — practicing all of the major steps the agency will have to perform when the vehicle launches for the very first time. It’s a major milestone for the rocket’s development and one of the last major tests it must undergo before the vehicle can be cleared to fly sometime this summer.</p><p id=\"tWdwjj\">The Space Launch System, or SLS, is the agency’s new flagship rocket, designed to carry people and cargo into deep space. It’s meant to play a lead role in NASA’s Artemis program, the agency’s initiative to send the first woman and the first person of color to the Moon by the mid-2020s. Capable of lifting nearly 60,000 pounds of cargo to orbits beyond the Moon, SLS is designed to launch NASA’s new crew capsule called Orion, which will carry future astronauts bound for the lunar surface.</p><div class=\"c-float-right\"><aside id=\"w0gF2h\"><q>NASA wants to go through all the steps leading up to launch</q></aside></div><p id=\"fVagQL\">But before all that can happen, SLS just needs to launch. Its first flight, called Artemis I, is also something of a rehearsal. The rocket will launch Orion — without any crew inside — <a href=\"https://www.nasa.gov/feature/around-the-moon-with-nasa-s-first-launch-of-sls-with-orion\">on a four- to six-week-long mission around the Moon</a>, showcasing the vehicle’s capabilities. But before <em>that</em> can happen, NASA wants to go through all the steps leading up to launch, what is known as a wet dress rehearsal. The term “wet” refers to the fact that NASA flight controllers plan to go through the entire countdown of launch, even filling up the rocket’s tanks with ultracold liquid propellant, just as they will on launch day. “It closely follows launch countdown,” Charlie Blackwell-Thompson, NASA’s Artemis launch director, said <a href=\"https://www.youtube.com/watch?v=pdWuXq-umzg\">during a press conference about the rehearsal</a>. “There are a couple of minor differences, but they are, in fact, minor.” Of course, the main difference is that the countdown will not actually reach T-minus zero, so there won’t be an actual launch.</p><p id=\"GjA8K1\">It’s a test that’s been nearly <a href=\"https://www.theverge.com/2022/3/17/22978972/nasa-sls-monster-rocket-roll-out-florida-history\">a decade in the making</a>. NASA and its primary contractor Boeing have been working on SLS since the early 2010s, and there have been plenty of delays and cost overruns along the way. The SLS rocket <a href=\"https://www.theverge.com/2022/3/18/22984243/nasa-sls-rocket-roll-out-launchpad-photos\">finally rolled out of NASA’s iconic Vehicle Assembly Building</a> on March 17th, fully stacked, and slowly made its way to its primary launchpad at Kennedy Space Center in Florida. Called LC-39B, the launchpad was used for an Apollo launch as well as multiple launches of the Space Shuttle.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lERJQ8z2De0mLxZeRvWPo-7gLNg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360759/ksc_20180531_mobilelauncher_0.jpeg\">      <cite>Image: NASA</cite>      <figcaption><em>NASA’s mobile launch platform at KSC</em></figcaption>  </figure><p id=\"qmrlg6\">Now it will be the primary home of the SLS, and NASA wants to ensure that the infrastructure surrounding the SLS can all work together for the first time. That includes all of the ground support systems — such as the massive mobile launch platform that is used to stabilize the rocket during launch, as well as the various tanks and structures used to funnel the cryogenic propellant into the rocket. “There’s thousands of components on the mobile launcher that need to perform,” Tom Whitmeyer, deputy associate administrator for common exploration systems development at NASA, said during the press conference. </p><p id=\"CyHn3V\">Along with testing the technology, NASA is also testing the abilities of the large army of flight controllers. Since this is the first time everyone will be working with this equipment and going through these procedures, there’s bound to be a few kinks to be worked out.</p><p id=\"KDC9gV\"><a href=\"https://blogs.nasa.gov/artemis/2022/03/31/artemis-i-wet-dress-rehearsal-preparations-underway%e2%80%af%e2%80%af/\">Things will get underway this afternoon at 5PM ET</a>, when the launch team arrives at their stations. Soon after that, the flight controllers will power up both SLS and Orion. The excitement doesn’t really begin, however, until the morning of Sunday, April 3rd, when the team decides if they are ready to proceed with fueling the vehicle. If they are “go” for that, they’ll begin filling up the SLS’s tanks with cryogenic liquid oxygen and liquid hydrogen and continue to replenish the tanks over the course of the day as the propellant inevitably boils away.</p><p id=\"W0xbWb\">After fueling, flight controllers will count down to a predetermined “launch” time, eventually reaching terminal count. At just six minutes before T-minus zero, the support teams will switch Orion to internal power, followed by the rocket itself. The countdown will continue ticking down to T-minus 33 seconds, at which point the teams manually cut off the launch. They’ll then go through a recycle, when they’ll try to go through the last part of the countdown again, testing out the team’s abilities to try a second launch attempt in case there’s a delay on launch day. Again, they’ll go through terminal count and eventually reach T-minus 10 seconds before cutting things off again.</p><h2 id=\"5e86k7\"><strong>How to follow</strong></h2><p id=\"lnds9S\">For those wishing to follow along with the test, NASA plans to provide detailed updates on <a href=\"https://blogs.nasa.gov/artemis/\">its Artemis blog</a>, as well as <a href=\"https://twitter.com/NASAGroundSys\">provide dispatches on Twitter</a>. Live views of the SLS rocket will <a href=\"https://www.youtube.com/watch?v=OCDwDrnrePo\">stream on one of NASA’s YouTube channels</a>.</p><p id=\"4ERKbo\">However, in a somewhat controversial move, NASA will not be providing live commentary or live audio of the countdown loop for the rehearsal. The agency cited restrictions surrounding the release of information about how rockets operate, which falls under the purview of ITAR, or International Traffic in Arms Regulation. Enforced by the US State Department, ITAR is used to control the export of certain technologies that can be used to make weapons. Typically, if a technology is listed on what is known as the US Munitions List, you either cannot export that technology to a foreign country or foreign national, or you need to get approval to do so.</p><div class=\"c-float-left\"><aside id=\"l2kAxd\"><q>“we have to be very careful when we share data, particularly for the first time.”</q></aside></div><p id=\"zayAQV\">Rockets are featured on the US Munitions List, as many of the same technologies used to build rockets are also used to create intercontinental ballistic missiles capable of transporting nukes. And while NASA does not plan on physically exporting the SLS rocket to another country, ITAR also does regulate the release of what is known as “technical data” — basically the blueprints and other knowledge used to make and operate rockets. </p><p id=\"aufeS0\">With regards to the SLS, NASA says it’s concerned about releasing valuable information about its countdown sequence, as adversaries may use that information to create weapons of their own. “Typically, what they’re looking for is timing and sequencing data, flow rates, temperatures, how long it takes to do certain tasks,” Whitmeyer said. “That’s considered to be important information by other countries. And so we have to be very careful when we share data, particularly for the first time.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OfsPWH6gCc0xAQ2p2zytJI1GRr4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360770/NHQ202203170056_large.jpeg\">      <cite>Image: NASA</cite>      <figcaption><em>Charlie Blackwell-Thompson in the firing room at KSC</em></figcaption>  </figure><p id=\"0H2v3B\">It’s a curious position for a few reasons. For one, the SLS runs on liquid propellants, while most ICBMs these days run on solid propellants. Also, commercial companies like SpaceX and the United Launch Alliance (which both use liquid propellants in their spacecraft) have made their countdowns public for the last decade without running afoul of ITAR. Within ITAR, the regulations do say that there are exceptions for releasing technical data if they’re already in the public domain.</p><p id=\"1Zyhdv\">“The existence of liquid rocket fuel can be found in any number of patent filings and publications,” Jack Shelton, a lawyer specializing in ITAR at Aegis Trade Law, writes <em>The Verge</em> in an email. “But there are certainly a lot of other bits of information relating to the SLS that aren’t in the public domain. Many of these are technological secrets that the US government might not want China to get its hands on.”</p><div class=\"c-float-right\"><aside id=\"0j25zW\"><q>“these are technological secrets that the US government might not want China to get its hands on.”</q></aside></div><p id=\"TwnsD9\">NASA notes that ITAR restrictions have become stricter since the agency used to launch the Space Shuttle. It’s also entirely<strong> </strong>possible that NASA received new guidance from the State Department about not releasing this kind of technical data to the public. There may be a definition for technical data, but it’s still pretty vague and always subject to interpretation, which can certainly evolve based on current events and emerging technologies. The agency could get in trouble if it releases information that the State Department decides falls under<strong> </strong>ITAR.</p><p id=\"IgoWJR\">NASA is also blaming the lack of public information on the fact that the SLS is very new, but the agency does plan to expand its coverage for the eventual Artemis I launch by releasing air-to-ground communications. “We’re actually going to talk to the export control people and share with them what we think is acceptable data, and then they are going to verify that it is acceptable data, and we hope by the time we get to the launch, we’ll have a really good understanding,” Whitmeyer said.</p><p id=\"CDA8vA\">For this weekend, hardcore fans can follow along with updates online. It’s also a dress rehearsal for NASA’s social team, which will certainly be working overtime when Artemis I does launch.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IVIWwjnTODxTblqF1Q0Itqn0DuE=/0x103:2040x1171/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23327093/lgrush_220318_5079_0054.jpg",
  "description": "The agency will provide updates online, but it won’t release audio publicly.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}