{
  "title": "NASA’s megarocket, the Space Launch System, rolls out to its launchpad",
  "url": "https://www.theverge.com/2022/3/18/22984243/nasa-sls-rocket-roll-out-launchpad-photos",
  "date": "2022-03-18T14:41:45.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ociiEFVE1LXoiyM0uIAtwpPgNxQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70641055/lgrush_220317_5079_0030_grain.10.jpg\" />        <figcaption>Photo by Loren Grush / The Verge</figcaption>    </figure>  <p>At last, the rocket has arrived</p> <p id=\"aUNF60\">On Thursday, NASA’s new giant rocket, the Space Launch System, emerged out into the Florida air, embarking on a torturously slow 11-hour journey to its primary launchpad at Kennedy Space Center. It was a big moment for NASA, <a href=\"https://www.theverge.com/2022/3/17/22978972/nasa-sls-monster-rocket-roll-out-florida-history\">having spent more than a decade on the development of this rocket</a>, with the goal of using the vehicle to send cargo and people into deep space.</p><p id=\"srZcz5\">The rollout of the SLS was just a taste of what’s to come. The rocket will undergo what is known as a wet dress rehearsal in April, going through all the operations and procedures it will go through during a typical launch, including filling up its tanks with propellant. If that goes well, then the rocket will be rolled back to NASA’s Vehicle Assembly Building, the giant cavernous building where the SLS was pieced together. Following a few more tests, the rocket will be rolled back out to the launchpad ahead of its first flight, scheduled for sometime this summer at the earliest.</p><p id=\"BeZPsM\">So there’s still some time before this megarocket actually sees space. But NASA employees, guests, and media got a treat yesterday seeing the vehicle for the first time with their own eyes, after years of only seeing what the rocket would look like as an animation. Check out photos from the SLS’s big debut.</p><div id=\"5pjnRh\"><div data-anthem-component=\"gallery:11101982\"></div></div><p id=\"RECSkb\"></p><p id=\"9hWg8Y\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kRaKtIMqrqvNE_peOQtBYABOTUM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23326928/lgrush_220317_5079_0030_grain.jpg",
  "description": "Watching a rocket roll down slowly on the gravel way",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}