{
  "title": "Netflix is releasing a Tekken anime series this year, here’s the first teaser trailer",
  "url": "https://www.theverge.com/2022/3/19/22986995/tekken-bloodlines-anime-netflix-teaser-trailer-streaming",
  "date": "2022-03-20T01:06:30.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Tekken: Bloodline\" src=\"https://cdn.vox-cdn.com/thumbor/QmeKlhLCnqVmiftMVRw1FEO6DPs=/0x0:1538x1025/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70647329/tekken_bloodline_logo.0.jpg\" />        <figcaption><em>Tekken: Bloodline</em> | Image: Netflix</figcaption>    </figure>  <p id=\"IHz0ic\">Netflix just announced one more title for its swelling library of original anime series. It plans to release <a href=\"https://www.netflix.com/title/81002441\"><em>Tekken: Bloodline</em></a> later this year and revealed the series with a <a href=\"https://www.youtube.com/watch?v=WTc2xXcJFwU\">one-and-a-half-minute “official teaser” trailer</a>. There’s no exact date or mention of episode count, but the summary reveals it will focus on Jin Kazama, who joined the series as a character in <em>Tekken 3</em>.</p><p id=\"b7p63i\">Unlike some other late 90s game franchises with sales of more than 50 million copies, the Tekken series has only had a few attempts at translating the story for movies or TV. Those attempts did manage to include a completely forgettable 2010 live-action flick that is most notable for being <a href=\"https://en.wikipedia.org/wiki/List_of_films_with_a_0%25_rating_on_Rotten_Tomatoes\">one of 43 movies on Rotten Tomatoes to earn a zero percent rating</a> <a href=\"https://www.rottentomatoes.com/m/tekken\">based on reviews from critics</a>. At one point, the producer/director of the Tekken games, Katsuhiro Harada, <a href=\"https://www.destructoid.com/tekken-boss-calls-tekken-film-terrible/\">tweeted that it was terrible</a>, saying, “We were not able to supervise that movie; it was a cruel contract. I’m not interested in that movie.”</p><div class=\"c-float-right\"><div id=\"xLYD0I\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Check this out! <a href=\"https://t.co/59LHtI1Msz\">https://t.co/59LHtI1Msz</a></p>— Katsuhiro Harada (@Harada_TEKKEN) <a href=\"https://twitter.com/Harada_TEKKEN/status/1505321955658186752?ref_src=twsrc%5Etfw\">March 19, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"ESWtkr\">The conditions surrounding this adaptation may be better, as Harada <a href=\"https://twitter.com/Harada_TEKKEN/status/1505321955658186752\">invited fans to check out the new trailer</a>. If it follows the games, the show will tie together The King of Iron Fist fighting tournament that includes control of a powerful corporation as its prize, the intergenerational power struggle of the Mishima family that runs the corporation and the tournament, and the supernatural powers/corruption of the Devil Gene mutation shared by  Heihachi Mishima (who also appears in the trailer), his son Kazuya Mishima, and Kazuya’s son Jin Kazama.</p><p id=\"3Utr8W\">Jin’s mother, Jun Kazama, was also a character in the games, and the trailer appears to show her training him when they’re attacked by another boss from the games, the monstrous Ogre. These events will lead him to enter the tournament full of familiar faces — faces that may or may not wear jaguar masks the entire time — and flashes during the trailer show off at least some of the characters we can expect to appear.</p>  <figure class=\"e-image\">        <img alt=\"Tekken: Bloodline\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lxknL8p1NF5SHWC4lMCRc7ShDrw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23330773/tekken_bloodline_netflix.jpg\">      <cite>Image: Netflix</cite>      <figcaption><em>Tekken: Bloodline</em></figcaption>  </figure><blockquote><p id=\"jacU0d\">“Power is everything.” Jin Kazama learned the family self-defense arts, Kazama-Style Traditional Martial Arts, from his mother at an early age. Even so, he was powerless when a monstrous evil suddenly appeared, destroying everything dear to him, changing his life forever. Angry at himself for being unable to stop it, Jin vowed revenge and sought absolute power to exact it. His quest will lead to the ultimate battle on a global stage — The King of Iron Fist Tournament.</p></blockquote><p id=\"nVcCdp\">Even after failing to deliver a <a href=\"https://www.theverge.com/2021/12/9/22827010/cowboy-bebop-netflix-live-action-cancel\">live-action <em>Cowboy Bebop</em></a><em> </em>that it deemed worthy of a second season, Netflix continues to focus on adapting anime and games for new content. Its <em>League of Legends</em>-based anime series <em>Arcane</em><a href=\"https://www.theverge.com/22763818/netflix-league-of-legends-arcane-review\"> received a rave review here</a> (even if its <em>Dota 2</em>-linked anime <em>Dragon’s Blood</em> <a href=\"https://www.theverge.com/22346867/dota-dragons-blood-netflix-anime-review\">did not</a>), while <em>The Witcher </em>live-action TV show has done well enough <a href=\"https://www.theverge.com/2021/9/25/22692068/netflix-tudum-season-3-anime-film-kids-family-series\">to earn a third seaso</a>n, a second anime movie, and upcoming kids show. A <a href=\"https://www.theverge.com/2021/11/9/22773096/netflix-one-piece-cast-straw-hats-live-action-show\">live-action adaptation of <em>One Piece</em></a> started production earlier this year, and Netflix also has anime adaptations of <a href=\"https://www.theverge.com/2022/1/7/22872921/scott-pilgrim-anime-adaptation-in-development-netflix\"><em>Scott Pilgrim</em></a> and <a href=\"https://www.theverge.com/2021/2/26/22303713/netflix-terminator-anime-production-ig-announced-tv-series\">the Terminator series</a> in the works.</p><p id=\"r3yjXp\"><em>Disclosure: </em>The Verge<em> is currently producing a series with Netflix.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AzbSFJnhVSfyjG7QgTMB_TXjN4w=/0x51:1678x930/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23330773/tekken_bloodline_netflix.jpg",
  "description": "The series will follow Jin Kazama on a path of revenge that leads to The King of Iron Fist tournament.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}