{
  "title": "Netflix’s 2022 movie slate looks absolutely stacked",
  "url": "https://www.theverge.com/2022/2/3/22914120/netflix-2022-movie-slate",
  "date": "2022-02-03T16:11:13.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"The Adam Project (L to R) Zoe Saldana as Laura and Ryan Reynolds as Big Adam.\" src=\"https://cdn.vox-cdn.com/thumbor/rH01BLjzBd3LXzwojChE37mQpY4=/43x0:7254x4807/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70466918/TAP_20201211_03483r2.0.jpeg\" />        <figcaption>Netflix</figcaption>    </figure>  <p id=\"OniSeF\"><a href=\"https://www.theverge.com/2022/1/27/22904260/netflix-google-pixel-6-pro-5a-hdr-support\">Netflix </a>has never been one to slump during <a href=\"https://www.theverge.com/2021/4/27/22404701/netflix-summer-movie-preview-2021\">summer movie season</a>, but it would be fair to say that the streaming studio’s been gearing up to make sure that you won’t be able to turn around without seeing one of its new feature-length projects this year. The good news is, more than a few of the new movies Netflix announced today sound like they might be worth tuning in to.</p><h3 id=\"9WAbst\">The Adam Project</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jdUkcNSx7T0JTnaghw0-z-OhTWE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212725/TAP_20201211_03483r2.jpeg\">      <cite>Netflix</cite>      <figcaption>Zoe Saldana as Laura and Ryan Reynolds as Big Adam.</figcaption>  </figure><p id=\"ccN1l0\">Director Shawn Levy’s (<em>Free Guy</em>) <em>The Adam Project </em>bucks <a href=\"https://www.theverge.com/2015/7/11/8830811/the-paradox-of-popping-back-in-time-bbc-future\">conventional time-traveling wisdom</a> with the story of Adam (Ryan Reynolds), a pilot who journeys into the past in order to save the future with the help of a younger version of himself and their father, who’s already died in the older Adam’s time. <em>The Adam Project </em>also stars Zoe Saldaña, Mark Ruffalo, Jennifer Garner, Walker Scobell, and Catherine Keener<em>, </em>and is slated to premiere on March 11th.</p><h3 id=\"cJUl0F\">Day Shift</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MTsXHsNoNURhupWK5Fo9pm_2Cec=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215370/Screen_Shot_2022_02_03_at_10.02.42_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"Gi6yCX\"><em>Day Shift </em>from director JJ Perry (<em>F9: The Fast Saga</em>, <em>Bloodshot</em>) and writers Tyler Tice and Shay Hatten (<em>Army of the Dead</em>) stars Jamie Foxx as an unassuming single father who spends his days looking after her daughter and traveling around the San Fernando Valley where he works as a pool cleaner. The man’s nights, however, are consumed by his actual job: slaying ghouls as a member of the world’s international union of vampire hunters. <em>Day Shift </em>also stars Dave Franco, Karla Souza, Meagan Good, Natasha Liu Bordizzo, Oliver Masucci, Snoop Dogg, Steve Howey, Scott Adkins, and Zion Broadnax.</p><h3 id=\"21Ds5I\">Spiderhead</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XTc3zAb2VDumWOggxN7gUTAJzWU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215372/Screen_Shot_2022_02_03_at_10.03.42_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"9wQdHe\">Based on George Saunders’ short story “<a href=\"https://www.newyorker.com/magazine/2010/12/20/escape-from-spiderhead\">Escape from Spiderhead</a>,” <em>Spiderhead </em>from director Joseph Kosinski imagines a near future where convicted criminals like Rachel (Jurnee Smollett) and Jeff (Miles Teller) are offered the chance for shorter prison stays in exchange for participating in experimental drug trials overseen by warden Abnesti (Chris Hemsworth). </p><h3 id=\"x8Px7X\">Slumberland</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vKV8dzxzG0tZnHdWRCMcNUY_Ppk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23213041/S_20210317_06079CR.jpeg\">      <cite>Netflix</cite>  </figure><p id=\"adIxcG\">When a young girl happens upon a map of Slumberland, a world made up of everyone’s dreams, she embarks on a journey — presumably along with a faun played by Jason Momoa — in search of her late father, who she believes is still somewhere out there. <em>Slumberland </em>is directed by Francis Lawrence, and also stars Marlow Barkley, Chris O’Dowd, Kyle Chandler, Weruche Opia, India de Beaufort, and Humberly Gonzalez.</p><h3 id=\"OmOlqB\">Pinocchio</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FB-z1GkcwzIq5_myLOVe6uW9CZQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212734/Screen_Shot_2022_02_02_at_10.21.50_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"3DjjrX\">Of the many <em>Pinocchio </em>adaptations debuting this year, Guillermo del Toro’s is almost guaranteed to be the darkest with its slightly different take on the little living puppet who dreams of becoming a real boy. Whether or not this Pinocchio dreams of becoming a flesh and blood human child almost seems to be beside the point here, as his main focus is getting into the sorts of mischief his father Geppetto desperately wants to keep him out of. <em>Pinocchio </em>stars Gregory Mann, Ewan McGregor, David Bradley, Tilda Swinton, Christoph Waltz, Finn Wolfhard, Cate Blanchett, John Turturro, Ron Perlman, Tim Blake Nelson, and Burn Gorman.</p><h3 id=\"GXBHhm\">They Cloned Tyrone</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/aDpJmQ2mlCV098FkRlZxAm82GTE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215446/Screen_Shot_2022_02_03_at_10.14.57_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"3PPY83\">After Fontaine (John Boyega), Yo-Yo (Teyonah Parris), and Slick Charles happen upon an unbelievable discovery exposing a vast, nefarious secret the government is hiding, they soon realize that they can’t trust anyone but each other to keep themselves alive. <em>They Cloned Tyrone </em>is directed by Juel Taylor and co-written by Taylor and Tony Rettenmaier.</p><h3 id=\"NuFlMT\">The School for Good and Evil</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/31bTX2p13UFmb2IWSEIzGb0qRfE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23213033/SGE_20210510_10368_RV2.jpeg\">      <cite>Netflix</cite>  </figure><p id=\"eRyPqY\">As in Soman Chainani’s bestselling book series, <em>The School for Good and Evil </em>from director Paul Feig (<em>Bridesmaids</em>) revolves around Agatha (Sofia Wylie) and Sophie (Sophia Anne Caruso), two best friends whose relationship is put to the ultimate test after they begin matriculating at a magic school for fairytale heroes and villains. <em>The School for Good and Evil </em>also stars Charlize Theron, Kerry Washington, Laurence Fishburne, Michelle Yeoh, Sir Ben Kingsley, Patti LuPone, Rachel Bloom, Peter Serafinowicz, and Rob Delaney.</p><h3 id=\"E72N0u\">Enola Holmes 2</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9b5MZ20zg2Sq-vIxhHwVTDCLnkk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215450/Screen_Shot_2022_02_03_at_10.13.53_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"DSSxRh\">Millie Bobby Brown returns as Sherlock Holmes’ plucky younger sister in a new story about her very first official case — a mystery about what happened to a missing girl. <em>Enola Holmes 2 </em>is directed by Harry Bradbeer, and also stars Henry Cavill, Louis Partridge, Helena Bonham Carter, David Thewlis, Susan Wokoma, Adeel Akhtar, Sharon Duncan-Brewster, Hannah Dodd, Abbie Hern, Gabriel Tierney, and Serrana Su-Ling Bliss.</p><h3 id=\"BwCjP9\">We Have a Ghost</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/O1mHfPS-2CD_PxBw032JBhFBIok=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215391/Screen_Shot_2022_02_03_at_10.07.21_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"PWSZwD\">When a family discovers that their new home is being actively haunted by a ghost named Ernest, they do the smart thing and tell the world about it, and before long their spectral boarder turns them all into social media celebrities and targets of the CIA. <em>We Have a Ghost </em>is directed by Christopher Landon, and stars Anthony Mackie, David Harbour, Jahi Di’Allo Winston, Tig Notaro, Jennifer Coolidge, Erica Ash, Isabella Russo, Niles Fitch, Faith Ford, and Steve Coulter.</p><h3 id=\"Yz6FBw\">Wendell &amp; Wild</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Qw8VKNLdlOSfdCOoIzdZSXa3MgE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215413/Screen_Shot_2022_02_03_at_10.11.27_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"wiwJRK\">As two demons, Wendell (Keegan-Michael Key) and his brother Wild (Jordan Peele) can’t cross over into the Land of the Living without being summoned by someone already there, which is precisely why they set their sights on a guilt-ridden 13-year-old who just might be their key to getting out of their native hell dimension. <em>Wendell &amp; Wild </em>is directed by Henry Selick, who also co-wrote the movie with Peele.</p><h3 id=\"kl4hrH\">The Mothership</h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zPr9S8HbmhDhuTn7IeQCYAFJXmg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215419/Screen_Shot_2022_02_03_at_10.07.40_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"A04IoZ\">Director Matt Charman’s <em>The Mothership </em>finds Sarah Morse (Halle Berry) still reeling a year after the sudden and inexplicable disappearance of her husband (Omari Hardwick) somewhere out on their remote, rural farm. Though Sarah knows that moving on might be what her kids (Jaiden J. Smith, Quinn McPherson) need, when she comes across what appears to be an alien object on their property, she realizes that there may be more to their family’s story than any of them know.</p><h3 id=\"7nYOJV\">Knives Out 2 </h3>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9tstGxFJximPxS7OT41hTrj7e4k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215422/Screen_Shot_2022_02_03_at_10.08.16_AM.png\">      <cite>Netflix</cite>  </figure><p id=\"XImBsl\">No matter where detective Benoit Blanc (Daniel Craig) goes, he always ends up smack dab in the middle of another ridiculous mystery, and Rian Johnson’s <em>Knives Out 2 </em>will see the gumshoe investigating yet another group of suspicious characters who might not be as innocent as they make themselves out to be. <em>Knives Out 2 </em>also stars Edward Norton, Janelle Monáe, Dave Bautista, Kathryn Hahn, Leslie Odom Jr., Kate Hudson, Jessica Henwick, Madelyn Cline.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4o6ZuMhI5g3-TsmySaBx9wpR3Ws=/0x494:7296x4314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23213407/TAP_20201211_03483r2.jpeg",
  "description": "Knives Out 2, They Cloned Tyrone, and Guillermo del Toro’s Pinocchio are just some of Netflix’s upcoming movies.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}