{
  "title": "Netflix tried and failed to build fandom with Tudum",
  "url": "https://www.theverge.com/2022/5/6/23059261/netflix-tudum-layoffs-fandom-fan-site-streaming-bridgerton",
  "date": "2022-05-06T14:30:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xHcrtmrOlTQrjmTsN_rooZt6YYA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70839671/acastro_181101_1777_netflix_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1vjr6h\">When news broke of <a href=\"https://www.theverge.com/2022/4/28/23047113/netflix-tudum-editorial-layoffs-streaming\">layoffs at the Netflix-owned fan site Tudum</a> last week, responses tended to come in two parts: First, of course, was that it sucked for the workers affected. But also, <em>what even is Tudum</em>?</p><p id=\"ppxT5f\">Launched less than six months ago, Tudum was envisioned as a home for bonus content related to popular Netflix titles, like interviews with stars, news about renewals and trailers, and also bigger, meatier stories that could contextualize shows and films. A former writer who lost their job last week compared Tudum to DVD special features and investments that other companies have made into supplementary material — “a Criterion Collection for normal people,” as they put it.</p><p id=\"zedKH5\">“It kind of builds on an already existing culture of fandom around Netflix shows and is just something that acts as a companion piece,” the former staffer says. “[Tudum was] where Netflix owned their own content.”</p><p id=\"tqczeU\">But Tudum has quickly become the latest example of Netflix failing to nurture those fandoms. The company has a history of shutting down shows if they don’t quickly reach internal goals, and it seems to have treated Tudum the same way, cutting off a large chunk of its staff after it didn’t immediately produce a sizable return on investment. Interviews with current and former employees suggest Netflix changed its mind about what it actually wanted from the slew of journalists it brought on. The staff was met with moving goalposts and a marketing department that felt unresponsive to writer and editor feedback.</p><p id=\"r3wgiQ\">Netflix’s goals, simply, were unclear to everyone involved. In an interview with <em>The Verge</em>,<em> </em>one former writer joked that they still don’t even know the exact way to pronounce the site’s name.</p><p id=\"wLfwvT\">For one, staff was told Tudum would be the place to drop exclusive content before other media could, says a writer who asked not to be identified because they are still employed at the company. But even that was a problem at Tudum, the current and the former writers say. Tudum staffers would watch as other outlets snagged interviews with stars that even Tudum couldn’t get or get time with talent they were supposed to have exclusive access to.</p><p id=\"q2FyaI\">“What’s the fucking point of acting like we have exclusive access when we have less access than other places?” the former staffer says.</p><div class=\"c-float-right\"><aside id=\"A8gIia\"><q>Even topics that Netflix shows address head-on, like <em>Cheer </em>star Jerry Harris’ arrest for child pornography charges, were off-limits</q></aside></div><p id=\"Ckt8Mo\">Another tension that grew over time was what kind of work writers were allowed to produce and what kind of content fans wanted to see. Writers knew the job wouldn’t be “capital-J journalism,” says another former writer who was also laid off. Still, they were assured during the interview process that they would be able to write about Netflix titles with a critical eye.</p><p id=\"auNR8c\">But writers soon found that wasn’t the case.</p><p id=\"nCIzOc\">Netflix PR representatives often sit in on interviews with stars of shows, and writers are given lists of topics to avoid discussing that were seen as controversial, current and former staff say. According to multiple people, even topics that Netflix shows address head-on, like <em>Cheer </em>star Jerry Harris’ arrest for child pornography charges, which the show dedicated an entire episode to, were off-limits for Tudum. Netflix declined to comment on this policy and did not respond to other questions from <em>The Verge </em>about Tudum’s operations.</p><p id=\"ScfiD7\">“If you’re trying to create a site and a brand that has any sort of credibility within this landscape, these are things that you have to address. These are things that you have to write about,” the second former writer says. Instead, the writer says, the sense staff got was that Netflix wanted “nice” stories and for Tudum to be a “space for joy” — good in theory for PR but a limiting way to expect fans to talk about and engage with their favorite titles.</p><p id=\"6HdmwP\">Tudum is just one piece of a seemingly ever-expanding push by Netflix to build fandoms around its content. The site shares a name with a <a href=\"https://www.theverge.com/2021/9/25/22691543/netflix-tudum-trailers-news-witcher-sandman-cowboy-bebop-bridgerton\">giant virtual fan event</a> Netflix held last fall. There are live <a href=\"https://www.nytimes.com/2022/03/22/business/media/bridgerton-netflix-live-events.html\"><em>Bridgerton</em> events</a> held around the country where fans do their best Regency-era cosplay under twinkling chandeliers, with footage going viral on TikTok the next day. The company runs an array of social media handles curated for different audience segments and content, including <a href=\"https://twitter.com/NetflixGeeked\">Geeked</a>, dedicated to sci-fi, fantasy, and other fans.   </p><p id=\"m5iPhK\">“We don’t have this legacy of 40 years of established I.P. We’re creating these new stories, these new worlds and these new fandoms,” Max Mills, Netflix’s editorial and publishing manager, <a href=\"https://www.protocol.com/netflix-marketing-to-targeted-audiences\">told <em>Protocol</em> in 2020</a>. “We’re able to look at it: what is that next generation of geekdom, the next generation of fandom?”</p><p id=\"mSbWRE\">But the company has at times cut off those fandoms before they could grow. Fan favorites like <em>The OA</em> or <em>The Babysitter’s Club, </em>canceled after just a couple seasons, have <a href=\"https://www.vulture.com/article/why-the-baby-sitters-club-was-canceled-at-netflix.html\">fallen victim</a> to <a href=\"https://www.theverge.com/2019/9/12/20860801/netflix-canceled-shows-tuca-bertie-the-oa-streaming-wars-disney-apple-warnermedia-amazon\">internal metrics</a> that viewers — and even creators of shows — aren’t privy to. When the service canceled <em>Sense8</em>, it took a <a href=\"https://www.hollywoodreporter.com/tv/tv-news/sense8-still-canceled-netflix-tells-fans-1012024/\">prolonged fan backlash</a> for the service to greenlight a finale.</p><p id=\"SyQyY0\">Building new fandoms can be a heavy lift that takes more than just press releases or even a full-fledged marketing website staffed by culture and entertainment writers. But the premise that Tudum could be <em>the </em>place to read about your favorite show would require real investment — why limit promotion to a site built from scratch?</p><div class=\"c-float-left\"><aside id=\"ojwgXD\"><q>“People can be smart in many different ways, but they are absolute idiots at this.”</q></aside></div><p id=\"Fu9m8J\">Though writers say Tudum wasn’t meant to be a direct competitor with independent entertainment publications, the company seemed to lack an awareness of what Tudum would need to succeed as a go-to source for the Netflix obsessed. On multiple occasions, the staff asked Netflix management why Tudum didn’t have its own social media presence to build readership or even let people know it existed. When Tudum finally got some space on Netflix itself, a title card was crammed in at the end of episodes — far from prime real estate.</p><p id=\"MmdhDX\">“The people that are doing it have no clue at all how to actually achieve this goal,” a former writer says. “People can be smart in many different ways, but they are absolute idiots at this.”</p><p id=\"YjJMFI\">When writers and editors brought forward questions about the strategy and goals for the fansite, higher-ups responded vaguely about still figuring things out, the second former writer says. Content strategy changed regularly based on what bosses said audiences were responding to, leaving writers and editors scrambling to provide what they were told fans wanted.</p><p id=\"YKDXuM\">“They were trying to figure it out themselves,” the former writer says of marketing and strategy heads. “They put the cart before the horse.” The sense they got, absent clear answers from Netflix, was that SEO marketing content was what was wanted from writers.</p><p id=\"wxyPIF\">That aligns with where the layoffs were focused. Around 25 people across marketing lost their jobs, including eight people on Tudum’s culture and trends team, as well as at least one person focused on content strategy, according to former staff. As to why culture and trends was targeted specifically, staff can only guess: the team had a lower output than news, for example. Some surmise that Netflix didn’t want anything that could be too fiery, even though deeper pieces are often what capture the attention and intrigue of a fanbase.</p><p id=\"lK6q9V\">“It makes sense in terms of what [Netflix is] trying to figure out. What’s the thing that makes this a worthwhile endeavor?” a former staffer says. “We’re just not the investment that they needed.”</p><p id=\"Ea5cKw\">It makes little sense for Netflix to confine coverage of its shows to its in-house fan blog — why wouldn’t the company want a feature in <em>The</em> <em>New York Times</em>?<em> — </em>nor is it a good thing for cultural criticism to be limited to what a streamer’s marketing department approves. But whatever levers needed to be pulled to give Tudum access to Netflix’s own stars was clearly not finessed, writers say. Just a few months after the site went live, Bozoma Saint John, the executive who <a href=\"https://about.netflix.com/en/news/meet-tudum-your-backstage-pass-to-the-netflix-stories-you-love\">launched Tudum</a>, <a href=\"https://www.hollywoodreporter.com/business/digital/netflix-bozoma-saint-john-marian-lee-marketing-1235103761/\">departed</a> the company.</p><p id=\"Hz96Ah\">Laid-off Tudum staffers are now fighting for some stability following the sudden gutting of the culture and trends team. Two affected writers told <em>The Verge </em>that a group of workers has asked Netflix to increase the two weeks of severance pay the company offered to four months. Former staff are currently negotiating with Netflix.</p><p id=\"pn4DeB\">Some workers who lost their jobs see the fallout as a result of Netflix’s company-level panic. The company <a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">lost subscribers</a> for the first time in over a decade last quarter and estimates it will lose even more people this quarter. </p><p id=\"mp36Jf\">One of Tudum’s former writers has their own prescription for how Netflix can stop the losses. “Stop canceling shows that people like, stop green-lighting so many ridiculous shows that nobody’s gonna watch, and stop raising the price,” they say. “That’s what’s making people get rid of their subscriptions. And they’re doing everything else but that.”</p><p id=\"eVygIx\"></p><p id=\"OhDCPI\"></p><p id=\"CjFlEx\"></p><p id=\"2Tky20\"></p><p id=\"hi1Uz4\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iexRnvKTJwll810C7TgDaqIFq9M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18956934/acastro_181101_1777_netflix_0002.jpg",
  "description": "Tudum is just one piece of Netflix’s push to create fandoms",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}