{
  "title": "Netflix is rolling out a Two Thumbs Up button",
  "url": "https://www.theverge.com/2022/4/11/23017274/netflix-double-thumbs-up-button-recommendation-curation",
  "date": "2022-04-11T16:15:20.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/X2mbZnCoCTogOJ1wN39U8aNMR-I=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70736265/acastro_181101_1777_netflix_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"4WhpG9\">Netflix is introducing a new button to help the streaming service curate your homepage with even better recommendations: Two Thumbs Up.</p><p id=\"tJMPYp\">The new feature will join the existing Thumbs Up and Thumbs Down controls that already help Netflix understand what to show individual subscribers. But Two Thumbs Up will allow users to indicate that they <em>really</em> liked something, and the company says that it’s been a highly requested feature within the experience.</p><p id=\"dVlTwN\">“Members have never had as many great entertainment options as they have right now,” Christine Doig-Cardet, director of product innovation and personalization experiences at Netflix, tells <em>The Verge</em>. “Being able to find the shows and movies that you’re going to love is really important. We want to continue to make Netflix the place where it’s easiest to choose something to watch.”</p><p id=\"bjZWRp\">Netflix ditched its <a href=\"https://www.theverge.com/2017/3/16/14952434/netflix-five-star-ratings-going-away-thumbs-up-down\">five-star rating system</a> in 2017 for the Thumbs Up and Thumbs Down system. Doig-Cardet says users didn’t feel that indicating which titles they liked and disliked was sufficient, and the new button should help subscribers better navigate Netflix’s gargantuan library of shows and movies by offering them a more nuanced way of liking titles.</p><p id=\"1KCBRR\">Netflix currently serves up one of the most user-focused experiences in the streaming space, and it’s constantly testing new features and tools that help users find stuff to watch. The company introduced a <a href=\"https://www.theverge.com/2020/2/24/21151327/netflix-top-10-list-homepage-subscribers-originals-licensed-movies-tv-shows\">Top 10 row</a> in 2020, launched a <a href=\"https://www.theverge.com/2021/4/28/22407467/netflix-play-something-shuffle-feature-launch-tv-movie\">Play Something</a> feature in 2021, and widely rolled out the ability to edit the <a href=\"https://www.theverge.com/2022/2/1/22912474/netflix-continue-watching-row-remove-tv-shows-movies-update\">Continue Watching row</a> on all devices earlier this year. According to Doig-Cardet, users can expect to see more customization tools and features coming down the pipeline.</p><p id=\"0ezoRG\">“We hope to end choice fatigue with new features that we’re adding this year,” Christine Doig-Cardet says. “It’s a huge part of where we want to invest — providing those mechanisms to give more of the control back to the user to help tailor their experience to their personal taste.”</p><p id=\"EWSkHw\">The new Two Thumbs Up button can be found next to the Thumbs Up and Thumbs Down buttons on Netflix’s web, TV, Android, and iOS interfaces beginning today.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z7NKhXwT3kSZUT8D0tQmI_Moz74=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13370033/acastro_181101_1777_netflix_0001.jpg",
  "description": "Thumbs Up and Thumbs Down didn’t cut it on their own.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}