{
  "title": "Netflix is beefing up its audio description and subtitling accessibility features",
  "url": "https://www.theverge.com/2022/5/19/23130179/netflix-accessibility-audio-descriptions",
  "date": "2022-05-19T14:34:01.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/j-uw8ALeAlTo5tKVuw_o2AARcIk=/240x0:2619x1586/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70887537/Screen_Shot_2022_05_19_at_8.26.09_AM.0.png\" />        <figcaption>Netflix</figcaption>    </figure>  <p id=\"05Hadp\"><a href=\"https://www.theverge.com/2022/5/6/23059261/netflix-tudum-layoffs-fandom-fan-site-streaming-bridgerton\">Netflix</a>’s closed captioning, subtitles for deaf and hard of hearing (SDH), and audio descriptions (AD) are all powerful tools designed to help make films and television shows more accessible to people with disabilities. But those kinds of features have also become integral parts of how <a href=\"https://www.theverge.com/2022/5/17/23103131/netflix-layoffs-tudum-streaming-subscriber-loss-email\">people from all walks of life</a> consume the streaming platform’s content, and Netflix is <a href=\"https://www.theverge.com/2022/5/18/23125424/netflix-losing-long-term-subscribers-streaming\">planning to give its subscribers</a> more of <a href=\"https://www.theverge.com/2022/5/10/23065126/netflix-login-sharing-rollout-ads\">what they want</a>.</p><p id=\"DZFp0s\">In celebration of Global Accessibility Awareness Day, <a href=\"https://about.netflix.com/en/news/celebrating-global-accessibility-awareness-day\">Netflix is gearing up</a> to expand its accessibility features across the globe and launching a new collection highlighting stories focused on people living with disabilities. <em>Celebrating Disability with Dimension </em>will function much like the platform’s other special collections that pull from Netflix’s catalog of existing content with the goal of promoting their visibility as users browse the service. In addition to the new collection, Netflix is also beefing up its AD and SDH offerings in more languages, including Spanish, French, Korean, and Portuguese.</p><div id=\"hKi8O0\"><div ><iframe src=\"https://www.youtube.com/embed/RJNnghJpfrM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"8WaFgt\">When we recently spoke with Netflix’s director of accessibility, Heather Dowdy, she explained how, typically, people’s ability to use AD and SDH have depended on whether the networks airing content took the initiative to provide the features in multiple languages. While shows produced in France like <em>Lupin </em>might have those features available in French, for example, English-speakers hoping to watch the series with English AD or SDH would only be able to do so if that accessibility was prioritized by the platform airing it. </p><p id=\"NBdxt3\">Dowdy said that while providing those features to those who need them is the core of the work she’s done at Netflix, one of the big reasons the platform’s been planning for this expansion is the fact that more subscribers are watching content from across the globe. </p><p id=\"EHSYiw\">“We’re adding more titles because we recognize that folks are finding these inclusive stories all over the world,” Dowdy said. “We have some global hits when you think about with <em>Squid Game</em> and <em>La Casa de Papel</em>, and we want our members and others in other countries to be able to access that content as well.”</p><p id=\"i3LCNy\">Netflix says that 40 percent of its global user base regularly uses subtitles and that people have been watching hundreds of thousands of hours worth of shows like <em>Lucifer</em>, <em>Ozark</em>, and <em>Seinfeld </em>with their audio descriptions turned on. Dowdy, who herself is a CODA, explained that Netflix also worked with members of the disability community to develop more robust AD guidelines meant to make the platform’s approach to accessibility more inclusive.</p><p id=\"QtLWhZ\">“Things like race, gender, hair texture, skin tone — things that really bring our characters to life,” Dowdy said. “That’s evident visually, but then we’re able to put that in the audio description as well so that our members are involved in the conversations that we’re having around these characters.”</p><p id=\"7V5XDS\"></p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EEAmMIIPlAmaD8lsSIYBFI-7wI0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23574683/Screen_Shot_2022_05_19_at_8.26.09_AM.png\">  </figure><p id=\"vKO77p\">Netflix’s efforts have <a href=\"https://www.theverge.com/22252580/bridgerton-netflix-82-million-households-biggest-show-ever-caveats\">paid off with series like <em>Bridgerton</em></a>, which the platform says is its number one most-watched show or film with subtitles in six countries. But the story’s been somewhat different from other global phenomenons like <em>Squid Game</em>, whose <a href=\"https://www.vice.com/en/article/wx5wqx/netflix-squid-game-subtitles-wrong\">English subtitles came under fire for being woefully inaccurate</a>. Dowdy didn’t specify what steps Netflix plans to take as part of its new initiative to ensure that shows and movies’ original voices are maintained as the streamer localizes them. She did say, however, that the <em>Squid Game </em>situation was a learning opportunity for Netflix that came as a direct result of viewers’ critical feedback.</p><p id=\"nPGAkb\">“If our members with disabilities aren’t even able to access that title and give us the feedback to improve the SDH, then we aren’t serving all of the members the best way that we can,” Dowdy said. “So I think that’s an example of our continuously listening to members and incorporating that feedback to get better, which is something that Netflix is really good at doing.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/M7-INwxaNi3gfWFR7oMtWMTDH0Q=/0x45:2858x1541/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23573635/Screen_Shot_2022_05_19_at_8.26.09_AM.png",
  "description": "More and more Netflix users are using its accessibility features.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}