{
  "title": "Netflix is laying off 150 employees and cutting dozens from its Tudum fansite",
  "url": "https://www.theverge.com/2022/5/17/23103131/netflix-layoffs-tudum-streaming-subscriber-loss-email",
  "date": "2022-05-17T21:02:29.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XXTnK8Oe0sNLWu3TglEcQDqbrOc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70880478/acastro_181101_1777_netflix_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"VRYAOS\">Netflix is laying off around 150 employees as well as dozens of contractors following a disappointing earnings report, citing “slowing revenue growth,” <a href=\"https://variety.com/2022/digital/news/netflix-layoffs-150-employees-1235269678/\">as first reported by <em>Variety</em></a>. </p><p id=\"q44mF3\">A source familiar with the situation tells <em>The Verge</em> the cuts include at least 26 contractors working on the company’s fan-focused Tudum website, which serves as a supplement to Netflix’s content. Prior to this recent round of layoffs, <a href=\"https://www.theverge.com/2022/5/6/23059261/netflix-tudum-layoffs-fandom-fan-site-streaming-bridgerton\">Netflix cut ar</a><a href=\"https://www.theverge.com/2022/4/28/23047113/netflix-tudum-editorial-layoffs-streaming\">o</a><a href=\"https://www.theverge.com/2022/5/6/23059261/netflix-tudum-layoffs-fandom-fan-site-streaming-bridgerton\">und 25 marketing roles</a>, including close to a dozen who worked on Tudum. The 26 workers laid off today were informed of the move in a mass email, which Netflix spokesperson Erika Masonhall said was sent by the contracting company.</p><aside id=\"Mnywau\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Netflix tried and failed to build fandom with Tudum \",\"url\":\"https://www.theverge.com/2022/5/6/23059261/netflix-tudum-layoffs-fandom-fan-site-streaming-bridgerton\"}]}'></div></aside><p id=\"5MeHQY\">The streaming giant told <em>The Verge</em> that most employees affected by the layoffs are located in the US. Masonhall issued the following statement in response to <em>The Verge</em>’s request for comment, noting that the layoffs were mainly driven by financial issues, rather than performance:</p><blockquote><p id=\"WJPpMH\">As we explained on earnings, our slowing revenue growth means we are also having to slow our cost growth as a company. So sadly, we are letting around 150 employees go today, mostly US-based. These changes are primarily driven by business needs rather than individual performance, which makes them especially tough as none of us want to say goodbye to such great colleagues. We’re working hard to support them through this very difficult transition. A number of agency contractors have also been impacted by the news announced this morning. We are grateful for their contributions to Netflix.</p></blockquote><p id=\"EBN6l2\">Last quarter, <a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">Netflix reported losing around 200,000 subscribers</a> — the first time Netflix has lost subscribers in over a decade. It also expects to lose an additional 2 million in the next quarter. Russia’s invasion of Ukraine is partially to blame for the loss in subscribers, <a href=\"https://www.theverge.com/2022/3/6/22964565/netflix-shuts-down-services-russia-ukraine-invasion\">as Netflix shut down its services in Russia in March</a>. Netflix had a low-key quarter with fewer huge Hollywood hits released on the platform, which didn’t help either.</p><p id=\"gpnfRQ\">Spencer Neumann, Netflix’s chief financial officer, said during last quarter’s <a href=\"https://s22.q4cdn.com/959853165/files/doc_events/2022/04/Netflix-Inc.-Q1-2022-Pre-Recorded-Earnings-Call-Apr-19-2022.pdf\">earnings call</a> that the company will be pulling back on spending for the next two years or so. </p><p id=\"YBzTJ7\">The streaming giant has told employees <a href=\"https://www.theverge.com/2022/5/10/23065126/netflix-login-sharing-rollout-ads\">a cheaper, ad-supported option</a> will launch later this year as well as a <a href=\"https://www.theverge.com/2022/4/19/23032643/netflix-password-sharing-subscribers-100-million\">crackdown on password sharing</a> as it attempts to reignite subscriber growth.</p><p id=\"KP5cve\"><em>Disclosure: </em>The Verge<em> is currently producing a series with Netflix.</em></p><p id=\"GSwt1K\"><em>Additional reporting by Mia Sato.</em></p><p id=\"8MyZpu\"><em><strong>Correction May 17th, 6:40PM ET: </strong></em><em>The Tudum workers who lost their jobs were contractors, not Netflix employees, as this story originally stated.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z7NKhXwT3kSZUT8D0tQmI_Moz74=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13370033/acastro_181101_1777_netflix_0001.jpg",
  "description": "Today, there were more layoffs at Netflix.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}