{
  "title": "Netflix’s Resident Evil invites you to New Raccoon City",
  "url": "https://www.theverge.com/2022/5/12/23067252/netflix-resident-evil-teaser",
  "date": "2022-05-12T14:45:13.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7VGVEsV0G8MKG1na7kT6dKCvcs4=/273x26:1227x662/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861010/EN_US_ResidentEvil_S1_Teaser_JoyPill_Vertical_27x40_RGB_PRE.0.jpeg\" />        <figcaption>Netflix</figcaption>    </figure>  <p id=\"K6m6tl\">The <a href=\"https://www.theverge.com/2022/3/2/22958218/capcom-resident-evil-remake-ray-tracing-ps4-xbox-series-pc-update-graphics\"><em>Resident Evil </em>franchise’s</a> Umbrella Corporation <a href=\"https://gizmodo.com/resident-evil-villages-moldy-lore-is-keeping-the-undead-1847019202\">always presents itself</a> to the public as a benevolent organization committed to creating a better future for humanity through pharmaceuticals. But the first trailer for <a href=\"https://www.theverge.com/2022/3/17/22982722/resident-evil-series-netflix-teaser-release-date\">Netflix’s upcoming live-action <em>Resident Evil </em>series</a> is a reminder that every promise the Umbrella Corporation makes should also be understood as a very serious threat.</p><p id=\"woiWdu\">Netflix’s <em>Resident Evil</em> from creator Andrew Dabb tells the story of how Jade Wesker (Ella Balinska) comes to be one of the last humans fighting to survive in the apocalypse after a viral cataclysm originating from Umbrella ravages the world. As the daughter of Albert Wesker (Lance Reddick), Jade has a somewhat direct connection to the event in New Raccoon City that ultimately led to the planet succumbing to zombies in the year 2026. But more than trying to figure out how Umbrella’s research led to what’s likely to be another T-Virus outbreak, Jade’s far more focused on her long-lost sister, who she hopes is still somewhere out there.</p><p id=\"wdTphV\">Netflix’s <em>Resident Evil </em>also stars Adeline Rudolph, Paola Nuñez, Ahad Raza, Connor Gossatti and Turlough Convery. The series debuts on July 14th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Bc-uUE_fSR_Is7-dTAuH0JRSUMk=/85x0:2790x1416/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23455769/Screen_Shot_2022_05_12_at_10.29.23_AM.png",
  "description": "Netflix’s Resident Evil envisions yet another zombie apocalypse in the first trailer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}