{
  "title": "Netflix is making a live-action BioShock movie",
  "url": "https://www.theverge.com/2022/2/15/22935020/netflix-bioshock-movie-film-adaptation-2k-take-two",
  "date": "2022-02-15T17:50:05.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vLPtahNKR8mvBDB-_-OTa2SrbyA=/0x0:4096x2731/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70512001/FLpouLGWQAcK7GW.0.jpeg\" />        <figcaption><em>Details are light right now.</em> | Image: Netflix</figcaption>    </figure>  <p id=\"rHvAjm\">Netflix, 2K, and Take-Two Interactive announced Tuesday that they will be partnering to <a href=\"https://twitter.com/NetflixGeeked/status/1493631219405307904\">make a live-action film adaptation of <em>BioShock</em></a><em>. </em>While it’s a potentially exciting announcement, details beyond the existence of the movie are extremely light.</p><p id=\"lgBMh9\">There’s no release date, and <a href=\"https://variety.com/2022/film/news/bioshock-movie-netflix-1235182423/\">according to <em>Variety</em></a>, it doesn’t have a director or a cast yet. And Netflix’s website says the movie is an adaptation of the <em>BioShock</em> <em>franchise</em>, which leaves open the possibility that it could feature characters and locales from the underwater city of Rapture from <em>BioShock 1</em> and <em>2,</em> as well as the sky city of Columbia from <em>BioShock Infinite</em>. </p><p id=\"ZlKdwB\">However, Netflix did share a press image featuring a creepy Little Sister and an imposing Big Daddy, so it seems like a safe bet that those iconic <em>BioShock</em> characters will show up in some way. </p><div id=\"7EiSMk\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">\"We all make choices, but in the end our choices make us.\" <br><br>Netflix + BioShock. Would you kindly stay tuned? <a href=\"https://t.co/Ke1oJQileX\">pic.twitter.com/Ke1oJQileX</a></p>— Netflix Geeked (@NetflixGeeked) <a href=\"https://twitter.com/NetflixGeeked/status/1493631216788066310?ref_src=twsrc%5Etfw\">February 15, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"MMTr93\">2K, which is owned by Take-Two, is also <a href=\"https://www.theverge.com/2019/12/9/21002587/bioshock-2k-new-studio-cloud-chamber\">working on</a> the “next iteration” of a <em>BioShock</em> game, though in its December 2019 announcement of the game, <a href=\"https://ir.take2games.com/news-releases/news-release-details/2k-announces-newly-formed-studio-cloud-chambertm-developing-next\">2K said</a> it would be in development for “the next several years.” Given the continued development of that game and this upcoming movie, it seems that 2K and Take-Two wants to make <em>BioShock</em> an even bigger franchise than it already is.</p><p id=\"0vHOhw\">“Netflix is among the best and most forward-thinking storytellers in all of entertainment today,” Take-Two Interactive CEO Strauss Zelnick said in a statement. “We are thrilled that they share our vision and commitment to the <em>BioShock</em> franchise, which is beloved by millions of fans around the world. 2K’s Cloud Chamber studio is deep in active development on the next iteration of the series, and coupled with our partnership with Netflix, we remain highly confident that <em>BioShock</em> will continue to captivate and engage audiences like never before.”</p><p id=\"o98C6q\">At one point, Universal had the rights to make a <em>BioShock</em> movie, and <em>Pirates of the Caribbean</em> director Gore Verbinski <a href=\"https://collider.com/bioshock-movie-ending-gore-verbinski/\">was attached to the project</a>, but it was <a href=\"https://screenrant.com/bioshock-movie-gore-verbinski-failed-explained/\">eventually canceled</a>. </p><p id=\"QgGl9U\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5E0RXc1B_Rjc524GIioIRLoQqd8=/0x289:4096x2434/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23243825/FLpouLGWQAcK7GW.jpeg",
  "description": "Another video game adaptation for the streaming service.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}