{
  "title": "Netflix says its new trivia show might ‘push more people into games’",
  "url": "https://www.theverge.com/2022/2/24/22948094/netflix-launches-trivia-game-bandersnatch-creators",
  "date": "2022-02-24T13:00:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TsH2lmFsGrJOv_efEj11EEh2-9c=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70544194/Cat_Burglar_00_00_08_15.0.jpg\" />        <figcaption>Image: Netflix | COURTESY OF NETFLIX</figcaption>    </figure>  <p id=\"Bs3ORk\">Netflix’s latest game is an addictive trivia title from the creators of <em>Bandersnatch</em> — an interactive experience called <em>Cat Burglar</em> where correct choices help move the story forward. More of this hybrid game-based storytelling is on the way, and Netflix thinks it could help push more of its users to think of the service as a place for games.</p><p id=\"FyVgxq\">“You can only do this on Netflix,” Netflix VP of comedy and interactive lead Andy Weil tells <em>The Verge</em>. “You can’t do this on any other platform because we’re a tech company, and that’s in the DNA of Netflix all along. The idea that you can interact with the content is something that we are exploring across all genres, all types of things.”</p><p id=\"tNNiRd\"><em>Cat Burglar</em> is an animated series from Charlie Brooker and Annabel Jones — the creators of <em>Bandersnatch</em>, arguably Netflix’s biggest interactive title to date. The cartoon, which debuted Tuesday, has a nostalgic look and feel similar to that of <em>Looney Toons, </em>with its stars being a museum-burgling cat named Rowdy and a security dog named Peanut. The show is intended for adults, though, with one round of trivia asking about the easiest things to do while drunk, for example.</p><p id=\"lTY3rV\">The show has six core endings, Weil tells me, meaning Netflix has created incentives for users who beat it to return and play again (the whole thing only takes about 15 minutes). But like <em>Bandersnatch</em>, there are many, many permutations depending on how you play the game through. Each round of trivia is unrelated to the story itself — and it changes with each round — which ups the stakes for players trying to watch the cartoon <em>and</em> advance to the next vignette. The experience is available in nine languages, with each round of trivia custom-tailored to the chosen language. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/X-faZc2oYnxA9CyYilrITNoksCA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23266606/Screen_Shot_2022_02_23_at_1.52.32_PM.png\">      <cite>Image: Netflix/The Verge</cite>      <figcaption>Cat Burglar<em>’s trivia is meant to be cheeky — and throw you off your game.</em></figcaption>  </figure><p id=\"7vVGe2\">This kind of interactive content is among a handful of ways Netflix is expanding on its <a href=\"https://www.theverge.com/22770244/netflix-gaming-app-launch-android-ios-future\">ventures into interactive content</a> — Netflix currently has <a href=\"https://help.netflix.com/en/node/121442\">about a dozen</a> different playable mobile games now — and it has been experimenting with <a href=\"https://about.netflix.com/en/news/interactive-storytelling-on-netflix-choose-what-happens-next\">interactive programming</a> for years (think <em>You vs. Wild</em> or <em>Puss in Book: Trapped in an Epic Tale</em>). But <em>Cat Burglar</em> confirms Netflix is willing to take a more expansive view of what a game can look like, and we’re going to see more of these interactive stories appearing on the service soon, Weil says.</p><p id=\"Z5kVtn\">“This is definitely more of like a fun experiment,” he says while adding that “we are going to do kind of more direct trivia stuff coming up.”</p><p id=\"sWxRn8\">Netflix wouldn’t share details about what these future interactive or trivia-based titles are going to look like — or how many we can expect to see even this year — but spokesperson Ebony Turner told me Netflix will have “something coming up soon that builds on top of this.”</p><p id=\"OUcvAI\">The neat thing about this type of interactive content is that it creates a gaming-like experience right alongside Netflix’s other original titles. It also offers up a world of possibilities for keeping Netflix users engaged. After about 20 minutes of playing the game Tuesday, I was already ready to play it through again just a day later. That could help Netflix introduce people to its games who might otherwise overlook them. Netflix does, after all, ultimately want to convince you it’s more than just a streaming service.</p><p id=\"oYSof2\">“The animation looks incredible. The score is Chris Willis, who is an amazing composer. It’s a live orchestra. It’s a great piece of entertainment — whether or not it’s interactive,” Weil says. “So I think the idea is to get people interacting. Instead of just sitting back with a passive experience, maybe we’ll push more people into games. They’ll be aware that there’s more on Netflix than just TV and movies.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GNLskpSdd5I-9_v4SMwhH19M834=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23266559/Cat_Burglar_00_00_08_15.jpg",
  "description": "A new and interactive trivia show is just the start.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}