{
  "title": "Netflix’s Pacific Rim anime wraps up in April",
  "url": "https://www.theverge.com/2022/3/23/22992513/pacific-rim-the-black-netflix-anime-season-2-release-date",
  "date": "2022-03-23T14:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/V6meqNd2Zbeyvn2nDEFRwEn5ByE=/94x0:657x375/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70661302/PRA203_09_001_00_check.0.jpg\" />    </figure>  <p id=\"9XPSfn\">Last year, Netflix debuted an anime spinoff set in the mech-vs.-kaiju world of <em>Pacific Rim</em>, and next month, the series will be coming to an end. The second and final season of <em>Pacific Rim: The Black</em> is coming to the streaming service on April 19th and is described as the “epic conclusion” for the story.</p><p id=\"DyPHzo\"><em>The Black</em> follows a pair of twins in Australia who end up utilizing a training Jaeger — those gigantic mechs from the live-action films — to fight monsters and seek the relative safety of Sydney. <a href=\"https://www.theverge.com/2021/3/4/22313221/pacific-rim-the-black-netflix-anime-polygon-pictures-interview-kaiju\">In an interview with <em>The Verge</em> last year</a>, supervising director Hiroyuki Hayashi explained that one of the goals of the show was to show the impact of the kaiju invasion from a different perspective.</p><p id=\"U0Ce40\">“The people in <em>Pacific Rim: The Black</em> are survivors who have been abandoned by the magic of advanced technology,” he said. “If anything, they are depicted to have a technology level closer to what we have today, except for the Jaeger technology.”</p><p id=\"xX0AT1\">Season 2 will continue the story, which involves everything from human / kaiju hybrids to a monster-obsessed cult. In the meantime, you can get a brief taste in the teaser images below.</p><div id=\"WGyLNQ\"><div data-anthem-component=\"gallery:11110003\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/WgvPGxdzzdCyQVrqdddHNip2Nhc=/17x0:733x375/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23339221/PRA203_09_001_00_check.jpg",
  "description": "A conclusion to the spinoff story",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}