{
  "title": "Netflix is launching a daily trivia series called Trivia Quest",
  "url": "https://www.theverge.com/2022/3/3/22960212/netflix-daily-series-trivia-quest",
  "date": "2022-03-03T18:51:13.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_Xb4_HxgNG4GyfAmDuUj5YMv_TA=/0x118:1080x838/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70575149/ENUS_TriviaQuest_S1_4x5_PRE_RGB.0.jpeg\" />        <figcaption>Image: Netflix</figcaption>    </figure>  <p id=\"M7LRk0\">Netflix’s foray into trivia continues with its newly announced series <em>Trivia Quest</em>, an interactive experience that will launch April 1st.</p><p id=\"w1f7zY\">Much like its other interactive series like <a href=\"https://www.theverge.com/2019/1/2/18165182/black-mirror-bandersnatch-netflix-interactive-strategy-marketing\"><em>Black Mirror: Bandersnatch</em></a> or Netflix’s similarly trivia-centered <a href=\"https://www.theverge.com/2022/2/24/22948094/netflix-launches-trivia-game-bandersnatch-creators\"><em>Cat Burglar</em></a> — which launched last month — <em>Trivia Quest</em> is a narrative interactive experience, meaning each “win” will help move the story along. For <em>Trivia Quest</em>, correctly answering the game’s questions will also help free the friends of the protagonist, Willy, who vows to save hostage citizens of Trivia Land captured by a knowledge-hungry villain named Evil Rocky.</p><p id=\"Wh4EOn\"><em>Trivia Quest </em>is the latest show to join Netflix’s growing slate of <a href=\"https://help.netflix.com/en/node/62526\">interactive titles</a>. It’s the second game, after <em>Cat Burglar</em>, to include a trivia element — something that Netflix VP of comedy series and interactive programming Andy Weil told <em>The Verge</em> last month the company plans to experiment with more as it expands its <a href=\"https://www.theverge.com/22770244/netflix-gaming-app-launch-android-ios-future\">gaming initiative</a>. </p><div class=\"c-float-right\"><aside id=\"ld24si\"><q>Trivia Quest joins a growing list of interactive series on Netflix</q></aside></div><p id=\"4ealCU\">A new episode of <em>Trivia Quest</em> will hit the service every day throughout April, with 30 episodes in total. (Before you ask, <a href=\"https://about.netflix.com/en/news/trivia-quest\">Weil writes</a> that “no, this isn’t an April Fool’s Joke.”) Each episode will include 24 trivia questions (12 easy and 12 hard) in a multiple choice-style format. Categories include science, entertainment, sports, art, geography, and history. The game is based on Etermax’s <em>Trivia Crack</em>, which <em>The New York Times</em> reports <a href=\"https://www.nytimes.com/2022/03/03/crosswords/history-trivia-netflix.html\">was licensed</a> by Netflix. </p><p id=\"roSUUm\">Players will be able to replay the quizzes to rack up points and correctly answer questions they may have previously missed. Weil additionally writes that each individual quiz “features a definitive ending but we don’t want to tell you too much about that just yet. You’ll have to play to see.”</p><p id=\"vYsyn3\"><em>Trivia Quest</em> arrives on Netflix next month on Android phones and tablets; iPhones, iPads, and iPod Touches; supported smart TVs, set-top boxes, and consoles; as well as on web. Devices that are not currently supported include Apple TV, some Chromecast devices (not including those with Google TV), Tesla touch screens, browsers using Silverlight, and the Netflix app on Windows. A full list can be <a href=\"https://help.netflix.com/en/node/62526\">found right here</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Bre9wsPR3xEgaBBj00TzLsPKfGA=/0x145:1080x710/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285898/ENUS_TriviaQuest_S1_4x5_PRE_RGB.jpeg",
  "description": "A new trivia game is arriving on Netflix on April 1st.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}