{
  "title": "Netflix says it will not stream Russian propaganda channels ",
  "url": "https://www.theverge.com/2022/2/28/22955398/netflix-russian-propaganda-channels-ukraine-invasion",
  "date": "2022-02-28T22:34:23.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-pTk3_RroJd3D_T6UZZRitfvCGo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70562403/acastro_181101_1777_netflix_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"PY4mV4\">Netflix will not distribute a number of state-run channels in Russia as mandated by a new law, the company says, following reports that it could soon be forced to carry the networks.</p><p id=\"EuLu5p\"><em>Variety</em> <a href=\"https://variety.com/2022/tv/global/netflix-russian-propaganda-channels-1235192082/\">reported Monday</a> that Netflix was among a number of services added to a register maintained by Russian media regulator Roskomnadzor of content distributors that reached over 100,000 subscribers. The new law, which <em>Variety</em> reports has not yet fully gone into effect, requires large streamers to carry 20 Russian broadcast channels, including state-funded Channel One. </p><p id=\"cL7lfX\">Channel One was among a number of channels <em>The</em> <em>Associated Press</em> cited last week as <a href=\"https://apnews.com/article/russia-ukraine-entertainment-media-europe-moscow-a760a2b6dcf5ef820cee7138336a5b3b\">skewing the narrative</a> to align with the Kremlin’s messaging around Russia’s invasion of Ukraine. Other channels named by <em>Variety</em> include NTV as well as Spa, a channel associated with the Russian Orthodox Church.</p><p id=\"Zh6tfY\">However, a Netflix spokesperson told <em>The Verge</em> that it does not plan to carry the channels.</p><p id=\"xEjSJp\">“Given the current situation, we have no plans to add these channels to our service,” said the spokesperson, who asked not to be named because of safety concerns. </p><p id=\"gELdrn\"><em>Politico Europe</em> <a href=\"https://www.politico.eu/article/us-streaming-giant-netflix-set-to-broadcast-putin-propaganda/\">reported last week</a> that Netflix may be forced to broadcast the channels when the law goes into effect, citing <a href=\"https://www.themoscowtimes.com/2021/12/29/russia-to-require-netflix-to-stream-state-television-broadcasts-a75949\">a report from<em> The Moscow Times</em></a> in December that said the mandate would extend to Netflix. Netflix does not currently support livestreaming in any of its markets.</p><p id=\"Zzb4wH\">Reporting on when and how the law will be enforced has been conflicting. While <em>Variety</em> reported the law has yet to be fully implemented, <em>Politico Europe </em>reported the new rules would apply to Netflix as of March 1st. </p><p id=\"09KPVR\"><em>The Wall Street Journal</em> on Monday <a href=\"https://www.wsj.com/articles/netflix-wont-add-russian-channels-to-service-defying-new-regulation-11646076964?mod=djemalertNEWS\">cited a source</a> familiar with the matter as saying that Netflix had been informed in December it would be expected to comply with the new mandate. It’s unclear how Netflix plans to address any such mandate if or when the rules are enforced by Russian regulators.</p><p id=\"zik0hZ\">Following Russia’s <a href=\"https://www.theverge.com/2022/2/28/22954857/russia-invades-ukraine-news-updates\">attack on Ukraine</a>, tech companies are being pressured to answer for how they’ll continue to operate their businesses in the country. Last week, Facebook was <a href=\"https://www.theverge.com/2022/2/25/22950874/russia-facebook-blocked-roskomnadzor-media-censorship\">partially “restricted”</a> in Russia after its parent company Meta failed to comply with demands by Roskomnadzor that it stop fact-checking Russian state-owned media entities.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z7NKhXwT3kSZUT8D0tQmI_Moz74=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13370033/acastro_181101_1777_netflix_0001.jpg",
  "description": "Netflix won’t carry some 20 Russian channels on its service.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}