{
  "title": "Netflix is reportedly looking into livestreaming",
  "url": "https://www.theverge.com/2022/5/14/23072842/netflix-looking-into-livestreaming-report",
  "date": "2022-05-14T17:37:59.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7xl7c8AVW0WwT0ZS8IH9heIwb8k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70869646/acastro_181101_1777_netflix_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"pCn5Tf\">Netflix may be expanding into livestreaming. According to a report from <a href=\"https://deadline.com/2022/05/netflix-live-streaming-1235023539/\"><em>Deadline</em></a>, Netflix is currently working on a livestreaming option for stand-up specials and other live content. </p><p id=\"GeyWH4\">As pointed out by <em>Deadline</em>, support for livestreams could open up the possibility for Netflix to air live reunions, like the one recently held by the real estate reality show <em>Selling Sunset</em>, as well as enable live voting for competition shows. </p><p id=\"yQNkbA\">Netflix could also use the feature to air live comedy specials. This year, Netflix held its first-ever live and in-person comedy festival, called the <a href=\"https://www.netflixisajokefest.com/\">Netflix Is a Joke Fest</a>. The Los Angeles-based event spanned several days and featured over 130 popular comedians, including Ali Wong, Bill Burr, Jerry Seinfeld, John Mulaney, and more. Netflix is <a href=\"https://about.netflix.com/en/news/netflix-is-a-joke-the-festival-announces-new-specials\">set to start airing</a> some of the shows it taped at the event later this month and into June, but a live option could give users at home the ability to watch shows as they unfold (that is if Netflix chooses to bring the festival back next year).</p><div class=\"c-float-right\"><aside id=\"7oZSFo\"><q>Adding a livestreaming feature could help Netflix keep up with its competitors</q></aside></div><p id=\"hvyw9A\">So far, we don’t know much about the upcoming feature yet, and Netflix didn’t immediately respond to <em>The Verge</em>’s request for comment. Disney Plus, one of Netflix’s biggest rivals, has already gotten into livestreams. In February, <a href=\"https://www.theverge.com/2022/2/8/22924369/disney-plus-first-live-feed\">Disney Plus aired a live showing of the Academy Awards,</a> a first for the service. It has also become the new home of the <a href=\"https://www.theverge.com/2022/4/8/23016891/dancing-with-the-stars-disney-plus-exclusive-abc\">celebrity dance competition series, <em>Dancing With the Stars</em></a>, which is set to debut as a live series on the platform later this year.</p><p id=\"gM9y44\">In Netflix’s most recent earnings report, the <a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">streaming service reported losing subscribers</a> for the first time in over a decade, while Disney Plus managed to <a href=\"https://www.theverge.com/2022/5/11/23067551/disney-plus-q2-2022-earnings-205-million-streaming-subscribers\">add 7.9 million new users</a> in the first quarter of 2022. To help counter a dip in revenue and subscribers, Netflix has hinted at potentially <a href=\"https://www.theverge.com/2022/4/19/23032643/netflix-password-sharing-subscribers-100-million\">cracking down on password sharing</a>, as well as adding <a href=\"https://www.theverge.com/2022/5/10/23065126/netflix-login-sharing-rollout-ads\">a cheaper ad-supported streaming option</a>.</p><p id=\"YEdt7y\"><em>Disclosure: </em>The Verge<em> is currently producing a series with Netflix.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iexRnvKTJwll810C7TgDaqIFq9M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18956934/acastro_181101_1777_netflix_0002.jpg",
  "description": "Netflix may want to start streaming live comedy shows.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}