{
  "title": "New company run by former NASA leader aims to build robotic outpost near the Moon",
  "url": "https://www.theverge.com/2022/2/3/22914873/quantum-space-lunar-robotic-outpost-nasa-artemis",
  "date": "2022-02-03T15:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jUeHsLCMZYFxWwbzo8nBQ_Y9YWE=/625x0:7375x4500/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70466623/quantum_splash_012822.0.jpg\" />        <figcaption><em>An artistic rendering of the robotic outpost, servicing satellite, and other pathfinder vehicles that Quantum Space hopes to build.</em> | Image: Quantum Space</figcaption>    </figure>  <p id=\"tFBxUN\">A new startup run by a former acting NASA administrator hopes to capitalize on the recent zeal for lunar space exploration by building robotic outposts and spacecraft to send to space near the Moon. Their goal is to create a fleet of robotic helpers that can do a variety of tasks near the Moon, such as providing internet capabilities, collecting data, refueling spacecraft, and assembling structures in lunar space.</p><p id=\"2aSjSo\">The company <a href=\"https://quantumspace.us/\">called Quantum Space</a> was formed in 2021. At the helm is Steve Jurczyk, who served as NASA’s associate administrator beginning in 2018, before becoming the agency’s acting administrator when President Biden was inaugurated. After retiring in May, Jurczyk decided to team up with three additional entrepreneurs and experts in the space industry to create this new company based out of Maryland.</p><p id=\"lPkrl2\">Jurczyk, who is the president and CEO of the company, says Quantum Space is focused on the Moon since NASA is also focused on returning there. The space agency’s primary human spaceflight enterprise at the moment is Artemis, a massive initiative to send the first woman and the first person of color to the lunar surface. Along with performing a series of human landings, NASA is also partnering with various commercial companies to send a fleet of landers and rovers to the Moon to explore the environment. Given all of these proposed lunar missions, Quantum Space felt like there was an opportunity to create vehicles that could be useful in the area.</p><p id=\"OvGyov\">“We know there’s going to be a lot of activity around and on the Moon in the coming decade, primarily driven by Artemis,” Jurczyk tells <em>The Verge</em>. “But you know, national security — where civil spaces goes, national security will have to go also.” Jurczyk anticipates Space Force and other military entities might leverage NASA’s lunar exploration and become customers in the future.</p><div class=\"c-float-right\"><aside id=\"mdr7D8\"><q>“We know there’s going to be a lot of activity around and on the Moon in the coming decade.”</q></aside></div><p id=\"LbkjDk\">Jurczyk says he envisions multiple types of vehicles that Quantum Space can build in the coming years to aid with the future influx of Moon missions. First, the company hopes to create a robotic outpost that could potentially help with communication in the region of space between regular Earth orbits and the Moon, known as cislunar space. NASA has a concept for creating an internet-like system of communications infrastructure around the Moon called LunaNet, which would be less reliant on Earth technologies for navigation, communication, and data relays. Jurczyk says his company’s robotic outpost could be involved. “We believe we can be a node or nodes in that network, for both spacecraft in orbit as well as spacecraft on the surface,” he says.</p><p id=\"bH2mLk\">Along with communications, the outpost could also do observations of Earth or the lunar surface, as well as host payloads for collecting data on the lunar environment. The company also envisions providing space traffic services for spacecraft traveling around the Moon. There are also options to observe the climate of Earth from a unique vantage point, as well as characterize near-Earth objects like asteroids. Quantum Space sees its outpost being at a specific point in space between the Earth and the Moon known as an Earth-Moon Lagrange point, where the gravity and centripetal forces between the two bodies are just right for spacecraft to remain relatively stable. The particular Lagrange point that Quantum Space is aiming for is called L1, and <a href=\"https://www.nasa.gov/mission_pages/themis/news/artemis-orbit.html\">it’s about 38,100 miles from the Moon’s surface</a>.</p><p id=\"TW7ASz\">In the long term, Quantum Space also wants to create its own robotic servicing spacecraft — essentially, a satellite mechanic that can refuel the outpost and other nearby vehicles, as well as conduct repairs. That way the outpost can have an extended lifetime in cislunar space. Such an idea would leverage the capabilities of the growing satellite servicing industry, which is already trying to create servicing robots that can fix satellites in orbit around the Earth.</p><div class=\"c-float-left\"><aside id=\"OIcp64\"><q>“We can sort of be a first mover to establish capabilities and services in cislunar.”</q></aside></div><p id=\"SPpe7f\">Quantum Space’s focus on deploying robots in cislunar space gives it a unique advantage, according to Jurczyk. Plenty of commercial space companies are focused on building passenger space stations that can live in Earth’s orbit, as NASA plans to eventually retire the International Space Station and move beyond that area of space to the Moon. Quantum Space’s outpost will only be robotic, so no people can live on board. And Jurczyk says there aren’t many companies with a history of building vehicles for the lunar environment.</p><p id=\"aILzVY\">“There’s really no legacy systems to compete with there,” says Jurczyk. “we can sort of be a first mover to establish capabilities and services in cislunar.”</p><p id=\"uIhNQS\">Since Quantum Space is a fledgling company, there’s still a long road ahead — one that begins with fleshing out the design of their spacecraft. As for a budget, the initial seed funding is coming from one of the four co-founders, Kam Ghaffarian. Ghaffarian, CEO of investment firm IBX, has helped fund various other space ventures like Axiom Space, Intuitive Machines, and more.</p><p id=\"Ie9rgW\">Right now, the company is working toward a pathfinder mission that would send a test robot to the Earth-Moon Lagrange point as early as spring of 2024. The goal would be to demonstrate many of the capabilities that Quantum Space’s future outpost would do, such as Earth and lunar observations, communication capabilities, and more. </p><p id=\"19biS6\">It’s a lot to do within the next two years, but there may be quite a bit more time before NASA’s exploration of the Moon picks up. The space agency was eyeing its first human lunar landing in 2024, <a href=\"https://www.theverge.com/2021/11/9/22772427/nasa-artemis-program-moon-lunar-landing-2025-delay\">but recently delayed that to 2025 at the earliest</a>. With key rockets and hardware for Artemis facing repeated delays, there should be ample time to flesh out the cislunar space economy.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lIP-7uIW9xxFPd-MxnHZcnxwiCw=/0x156:8000x4344/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215195/quantum_splash_012822.jpg",
  "description": "Creating a fleet of robotic helpers that can do variety of tasks near the Moon",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}