{
  "title": "New Google Classroom tool gives hints on tough homework problems",
  "url": "https://www.theverge.com/2022/3/16/22980116/google-classroom-practice-sets-beta-release-education",
  "date": "2022-03-16T16:00:00.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/65K6jpqmUXO4ULN_PYWElW3weNE=/130x0:1752x1081/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70630488/1763_GDU_UI__4_BW_V2_01__2_.0.png\" />        <figcaption><em>Here’s a resource a student might pull up.</em> | Image: Google</figcaption>    </figure>  <p id=\"5UYRrO\">Imagine if your old trig worksheets stepped in to help you out when you were stumped on a question. That’s Practice Sets, the newest Google Classroom tool, in a nutshell. </p><p id=\"KHn86P\">Google Classroom, for folks who went to school before the internet was everything, is a widely used gaggle of web tools that allows teachers to post assignments, students to submit them, and teachers to return them online. With Practice Sets, not only will teachers be able to send out problem sets, but they’ll be able to make those problem sets interactive. </p><p id=\"7uFzOw\">An algorithm will provide hints to students who seem stumped. It will automatically grade the sets as well. Shantanu Sinha, head of product efforts for Google Education, says the algorithm will recognize when students write “equivalent answers” — so if a question needs an answer of “.5,” for example, a student who writes “1/2” should still get credit.</p><p id=\"yELcV9\">“If you’re playing basketball and throwing the ball incorrectly for a day, it’s clearly not as useful as the coach right then and there giving you input.” Sinha tells <em>The Verge. “</em>I think the same thing is true when students are working through problems.”</p><p id=\"oCYBXc\">If you’re a teacher, you’ll write each question out, and Google’s AI will figure out the nature of your question (“algebra,” “polynomial equation,” etc.) to attach appropriate hints and resources. (Don’t worry, the hints can be turned off.) When it’s finished, you can assign it straight from the Google Classroom interface. </p><p id=\"yKXyM8\">If you’re a student, you’ll write or type your answer to each question, press the “check” button, and get your grade right away. If you’re wrong on the first try, you’ll get a hint. If you’re totally lost, a “resources” sidebar will display relevant videos and notecards that Google’s algorithm thinks might be useful. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QHcRJXCy6Hv2v43PIMMOEn43orI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23319281/Teacher_creation_experience_Frame_3.png\">      <cite>Image: Google</cite>      <figcaption><em>Here’s what it looks like when a teacher creates a question.</em></figcaption>  </figure><p id=\"zCNf54\">When the teacher gets the assignments back, they’ll see where the AI marked each student right or wrong. If a student made multiple attempts at a question, the teacher will see each one. Google will also provide insights, such as particular questions that everyone struggled with. </p><p id=\"HMfz1d\">While some may find homework of this sort less rigorous than assignments of old, Sinha believes it’s important that students feel they can succeed. “When you’re trying to do a problem, and you don’t see any way you can do it, it can be very demoralizing for students,” he says. “When they get that help, and they feel, ‘Oh, I actually can do this, this is something that’s within my reach,’ it really starts to build confidence.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eNglSnaYV_NJ1YiDXW7aGz-MlzU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23319532/Teacher_insights_dashboard_Frame_1.png\">      <cite>Image: Google</cite>      <figcaption><em>Here’s what it looks like when the teacher gets all the assignments back.</em></figcaption>  </figure><p id=\"NThkq6\">Practice Sets is not the first tool to offer algorithm-based evaluation and grading. While other such platforms have proven to be a time-saver for teachers and a handy tool for remote learning over the past few years, they’ve also faced their share of controversy. Losing credit due to faulty technology can be frustrating for students — <a href=\"https://www.change.org/p/williamson-county-schools-williamson-county-schools-online-program-stop-grading-our-students-until-issues-are-fixed?use_react=false\">families in some district</a><a href=\"https://www.theverge.com/2020/9/2/21419012/edgenuity-online-class-ai-grading-keyword-mashing-students-school-cheating-algorithm-glitch\">s</a><a href=\"https://www.change.org/p/williamson-county-schools-williamson-county-schools-online-program-stop-grading-our-students-until-issues-are-fixed?use_react=false\"> revolted</a> against the use of one such platform, Edgenuity, in the early days of the COVID-19 pandemic, after various technological hiccups impacted students’ grades.</p><p id=\"r11o8S\">But Practice Sets is in beta, which will hopefully give students and teachers ample time to complain about issues with the automated grading, as well as give Google time to fix any bugs. I look forward to hearing stories of crafty kids finding ingenious ways to fool the algorithm, which will no doubt be frustrating for teachers and highly entertaining for the rest of us. Good luck to all. </p><p id=\"fKwQ3M\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ljp0iSbSRqVGs13AJw5r-dUw7-0=/0x76:1920x1081/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23319278/1763_GDU_UI__4_BW_V2_01__2_.png",
  "description": "Stumped students, your help is here.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}