{
  "title": "New Windows 11 controller shortcut is a simpler way to launch recent games",
  "url": "https://www.theverge.com/2022/5/6/23059741/controller-bar-windows-11-gamepad",
  "date": "2022-05-06T11:41:05.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/D83rl9Xijsa85uJDnNC3-E1Pt1Q=/45x0:1727x1121/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70838912/image.0.png\" />        <figcaption><em>The controller bar appears with a press of the Xbox button.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"uolGiH\">Microsoft is testing a new feature for Windows 11 that lets you use a controller to launch recently-played games, avoiding the need to use a mouse and keyboard. The feature is <a href=\"https://blogs.windows.com/windows-insider/2022/05/05/windows-insiders-can-now-try-out-an-early-preview-of-controller-bar/\">called the “controller bar,”</a> and is accessible by pressing the central Xbox button on a controller when you’re not currently in a game. It’s designed to show up to three recently-played games, alongside a selection of game launchers like Steam. </p><p id=\"UpRzwY\">As someone whose gaming PC is permanently plugged into his TV, I can see the feature being very useful for people like me. Currently, even if I’m playing a controller-based game, I first need to use a wireless keyboard and trackpad to launch it from Windows. But in the future I might be able to skip this step, and boot up recent games with just a controller. Once you’re in a game, Microsoft says pressing the Xbox button will continue to launch the <a href=\"https://www.theverge.com/2019/5/22/18635709/microsoft-xbox-game-bar-windows-10-release\">more in-depth Xbox Game Bar</a>, rather than the new controller bar.</p><p id=\"iBbyyi\">Microsoft says the controller bar feature is currently in testing for Windows Insiders on its Dev and Beta channels, and warns that there could be bugs (like some games failing to appear, or others appearing multiple times). Instructions on how to enable the new feature can be found in <a href=\"https://blogs.windows.com/windows-insider/2022/05/05/windows-insiders-can-now-try-out-an-early-preview-of-controller-bar/\">Microsoft’s blog post</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VXbTlDydpByk22dnOM1qNd3f6E0=/0x98:1771x1025/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23442071/image.png",
  "description": "Perfect for living room PCs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}