{
  "title": "New York Times pressures ‘unauthorized’ Wordle Archive into shutting down",
  "url": "https://www.theverge.com/2022/3/16/22980713/new-york-times-wordle-archive-takedown",
  "date": "2022-03-16T14:54:15.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Wordle Smartphone Game\" src=\"https://cdn.vox-cdn.com/thumbor/bVajkWzsEOJQ9b2jhlrm6QHW5UQ=/0x0:5123x3415/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70630070/1239008963.0.jpg\" />        <figcaption><em>The New York Times</em> said the Wordle Archive’s use was “unauthorized.” | Photo by Mike Kemp / In Pictures via Getty Images</figcaption>    </figure>  <p id=\"dOni8H\">The Wordle Archive, which let you play Wordles of days past, has been forced offline at the request of <em>The New York Times</em>, according to a report from <a href=\"https://arstechnica.com/gaming/2022/03/new-york-times-takes-down-third-party-wordle-archive/\"><em>Ars Technica</em></a>. Navigating to the <a href=\"https://metzger.media/games/wordle-archive/?puzzle=251\">Wordle Archive</a> yields a disappointing message: “Sadly, the New York Times has requested that the Wordle Archive be taken down.”</p><p id=\"y2iwhw\">It’s still unclear what went down legally between the <em>NYT</em> and the Wordle Archive, but a spokesperson for the news outlet vaguely told <em>Ars Technica</em> that the archive’s “usage was unauthorized, and we were in touch with them.”</p><p id=\"oAd4mD\">The Wordle Archive previously displayed a list of old playable puzzles that were great for when you finished your daily Wordle just a little too fast and were left wanting more. Luckily, our old friend the Web Archive has <a href=\"https://web.archive.org/web/20220305013106/https://metzger.media/games/wordle-archive/\">frozen the Wordle Archive</a> in time, albeit leaving it stuck on Day 257, March 3rd, 2022. But hey, you still get over 200 playable puzzles, stretching back to June of last year (that is, if you haven’t already exhausted the entire archive).</p><div class=\"c-float-right\"><aside id=\"q68kE2\"><q>What if the NYT wants to make its own archive?</q></aside></div><p id=\"MoXwc1\"><a href=\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\">The <em>NYT</em> purchased Wordle</a> for an unspecified seven-figure sum in January, much to the dismay of many fans who thought this would result in Wordle getting trapped behind a paywall. Some players even opted to <a href=\"https://www.theverge.com/2022/2/1/22912711/wordle-web-save-download-webpage-local-personal\">save the original Wordle game to their computer</a> so they can play it in its pre-<em>NYT</em> form. Things have been going okay so far, although the <em>NYT</em> <a href=\"https://www.theverge.com/2022/2/15/22934587/wordle-solutions-changed-new-york-times\">made some edits to the original list of Wordle solutions</a>. And it isn’t forcing users into a subscription (yet), but the removal of the Wordle Archive looms ominously over the <a href=\"https://www.theverge.com/tldr/2022/1/11/22877996/wordle-spoofs-alternatives-letterle-sweardle-queerdle\">Wordle clones floating around on the web</a>.</p><p id=\"arMy68\">As <em>Ars Technica</em> points out, the <em>NYT</em> can go after games that blatantly use or closely resemble the “Wordle” name for copyright infringement, since the <em>Times</em> filed for a trademark immediately after its purchase of the game. However, it may struggle to take legal action against games that use similar mechanics, as <a href=\"https://www.cnbc.com/2022/02/24/wordle-kind-of-rips-off-lingo-a-copyright-lawyer-says-thats-ok.html\">something like that is more difficult to patent</a> (otherwise, Wordle would’ve been sued by the creators of Lingo by now). The Apple App Store has already done some of the legwork shortly before the <em>NYT</em>’s takeover by <a href=\"https://www.theverge.com/2022/1/11/22879295/wordle-clones-app-store-removal-online-backlash-copycats\">putting the kibosh</a> on a number of fake Wordle apps <a href=\"https://www.theverge.com/2022/1/11/22878752/wordle-app-store-review-copies-advertisements-in-app-purchase\">trying to cash in on its success</a>. But this is the first time the <em>NYT</em> itself has begun its copyright crackdown since assuming ownership.</p><p id=\"mVBMpl\">While this may be the start of an <em>NYT</em>-led takedown spree, it could also be a sign that the <em>NYT</em> wants to create an archive of its own, and doesn't want some third-party Wordle archive taking all of its glory. It would only make sense — the <em>NYT</em> already has an <a href=\"https://help.nytimes.com/hc/en-us/articles/360051947672-New-York-Times-Crossword-Archive\">archive for its crossword puzzles</a> that you can access from its app and webpage. You have to be a paying subscriber to use the archive, of course, as you do for its full-fledged crossword puzzles. Maybe it’s a bit of a stretch, but if the <em>NYT</em>’s treatment of its crosswords are any indication of what it will do with Wordle, an official archive (that you hopefully won’t have to pay for) doesn’t seem too unrealistic.</p><p id=\"phxbeE\"><em>The Verge</em> reached out to the <em>NYT</em> with a request for comment but didn’t immediately hear back.</p><aside id=\"Z5X578\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to play Wordle\",\"url\":\"https://www.theverge.com/22892044/wordle-free-game-online-how-to-puzzle\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/9CFhamcz4-cHTewm4wJyHKn3phU=/0x698:5123x3380/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320088/1239008963.jpg",
  "description": "The New York Times begins its Wordle copyright crackdown.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}