{
  "title": "New York says Amazon doesn’t accommodate pregnant and disabled workers",
  "url": "https://www.theverge.com/2022/5/18/23124882/amazon-pregnant-disabled-workers-complaint-managers-new-york-governor",
  "date": "2022-05-18T18:34:20.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/YuPXaAe0ncGsc6kFF7y-E2jmlNY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70884148/acastro_181114_1777_amazon_hq2_0001.0.jpg\" />        <figcaption><em>An investigation will follow the complaint.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"nYH6gt\">The New York State Division of Human Rights has filed a complaint against Amazon for failing to accommodate reasonable changes requested by workers who were pregnant or disabled, according to <a href=\"https://www.governor.ny.gov/news/governor-hochul-announces-complaint-filed-against-amazon\">a Wednesday press release</a> from Governor Kathy Hochul. </p><p id=\"Q6uHwL\">Even in cases where the company agreed that workers should be accommodated, the complaint alleges that managers would still force them to do work they shouldn’t be doing. According to one example listed <a href=\"https://www.governor.ny.gov/news/governor-hochul-announces-complaint-filed-against-amazon\">in the press release</a>, a pregnant worker filed a request to avoid strenuous activity, specifically lifting boxes over 25 pounds. Amazon approved the request, but the worker’s manager allegedly refused to adhere to the accommodation, and Amazon didn’t intervene despite internal complaints. The press release says the worker was ultimately injured and had to take unpaid leave after Amazon wouldn’t accommodate the injury.</p><div class=\"c-float-right\"><aside id=\"Zorg1V\"><q>The complaint alleges that Amazon’s Accommodation Consultants changed their recommendations</q></aside></div><p id=\"sNZm1m\">There are also reports of workers having their accommodation requests denied. In another example shared by Hochul, Amazon’s internal Accommodation Consultant recommended a worker have their schedule modified due to a disability that affected their sleep schedule. When the manager refused to change the worker’s schedule (despite the fact that the worker had already been trading shifts with another co-worker to make things work), the Accommodation Consultant allegedly changed their recommendation, saying that there wasn’t enough medical documentation to approve the request. According to the release, the consultant had received documentation prior to approving the request the first time.</p><p id=\"2vB8Ld\">Amazon didn’t immediately respond to <em>The Verge</em>’s request for comment on the allegations.</p><p id=\"VGGwBf\">Now that the complaint has been filed, the New York State Division of Human Rights will investigate and determine whether there’s probable cause to hold a hearing. Depending on the outcome, Amazon may have to “cease its discriminatory conduct” and “adopt non-discriminatory policies” around reasonable accommodation requests as well as implement training on human rights laws. The company could also face civil fines and penalties. </p><p id=\"6UkIKD\">As <a href=\"https://www.cnbc.com/2022/05/18/new-york-files-discrimination-complaint-against-amazon.html\">CNBC notes</a>, Amazon has faced lawsuits over pregnancy discrimination before — some plaintiffs even said they were fired after they couldn’t meet their productivity goals without accommodation. Six US senators have also asked the federal Equal Employment Opportunity Commission to investigate the company for pregnancy discrimination.</p><p id=\"1hcuDc\">Still, Amazon has successfully fended off similar claims before. In 2021, New York’s Attorney General Letitia James sued Amazon, claiming it didn’t keep its warehouse workers sufficiently safe during the pandemic. Earlier this month, the suit was <a href=\"https://www.reuters.com/legal/litigation/appeals-court-dismisses-new-york-lawsuit-against-amazoncom-over-worker-safety-2022-05-10/\">dismissed by a state appeals court</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/y-L6MHvt0CtVVEz71kNdDVgrdQ4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443460/acastro_181114_1777_amazon_hq2_0001.jpg",
  "description": "Managers allegedly refused recommended changes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}