{
  "title": "New AirTags anti-stalking measures appear in iOS 15.4 beta",
  "url": "https://www.theverge.com/2022/2/23/22947063/airtags-anti-stalking-ios-15-4-beta-4-privacy-notice",
  "date": "2022-02-23T09:23:14.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"A bunch of AirTags\" src=\"https://cdn.vox-cdn.com/thumbor/Dg3WGeubJQ4rSF23h6Y8IdUqAG4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70539766/vpavic_4547_20210421_0131.0.jpg\" />        <figcaption><em>Apple’s AirTag trackers.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"yl9JPq\">The latest beta for iOS 15.4 includes new features designed to prevent Apple’s AirTags from being used to stalk people, <a href=\"https://9to5mac.com/2022/02/22/ios-15-4-beta-4-adds-anti-stalking-alerts-to-airtag-and-other-find-my-accessories/\"><em>9to5Mac</em> reports</a>. Most notably, there’s a new privacy notice during their setup which warns that using AirTags to track someone without their consent could be a crime, and that law enforcement can request details on an unknown AirTags’ owner. “AirTag is Linked To Your Apple ID,” the notice reads.</p><p id=\"pDQ9A8\">Apple announced a collection of new safety features for its AirTags <a href=\"https://www.theverge.com/2022/2/10/22927374/apple-airtag-safety-update-stalking\">earlier this month</a>, after a spate of news reports found they’d been used to track individuals without their consent. At the time, Apple didn’t provide an exact release date for the new safety features, noting only that they’d arrive “later this year.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gUZDZEB_US9sdCjtvL5I6FGmLY4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23232651/AirTag_privacy_message_in_pairing_flow.png\">      <cite>Image: Apple</cite>      <figcaption><em>The privacy notice announced by Apple earlier this month.</em></figcaption>  </figure><p id=\"LmvIue\">Alongside the new privacy notice, <em>9to5Mac</em> notes that iOS 15.4 can now specify when an unidentified pair of AirPods is found traveling with you. Previously, AirPods would generate a more general “Unknown Accessory Alert” notification, which caused confusion for some users, <a href=\"https://www.macrumors.com/2022/02/22/ios-15-4-beta-4-airtags-anti-stalking/\"><em>MacRumors</em> reports</a>. The option to preemptively disable safety alerts when a tracker is detected in your vicinity has also been removed, and new tracking notification settings have been added to the Find My app. </p><p id=\"WLv7Bj\">Other anti-stalking AirTag features announced by Apple earlier this month include alerting users sooner when an unknown AirTag is detected in their presence, and allowing them to use the precise ultrawideband tracking in newer iPhones to find an AirTag that’s not their own (previously, this was only available to an AirTags’ owner). Tracking notifications shown on an iPhone will also be synced with the alert noise made by an AirTag, to make them more noticeable, Apple said.</p><p id=\"bNGbqU\">As well as the new anti-stalking features, iOS 15.4’s fourth beta also includes a new American Siri voice that <a href=\"https://www.axios.com/apple-gives-siri-less-gendered-voice-d4b2ab56-67c9-4728-b195-8bc14d163672.html\"><em>Axios</em> notes</a> is less gendered than the voice assistant’s existing options. This joins other new iOS 15.4 features, including <a href=\"https://www.theverge.com/2022/2/2/22912677/apple-face-id-mask-update-ios-15-4-beta-hands-on-impressions\">Face ID support while wearing masks</a>, and Apple’s <a href=\"https://www.theverge.com/2022/1/27/22904957/apple-universal-control-ipados-15-4-macos-monterey-12-3-betas\">new Universal Control feature</a>. An exact release date for iOS 15.4 is yet to be announced, but it’s expected to get a widespread release next month.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OSgFFOqae4lBP8DEoaxaYAYStFw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22461476/vpavic_4547_20210421_0131.jpg",
  "description": "They were announced earlier this month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}