{
  "title": "New Steam Deck orders won’t ship until at least October",
  "url": "https://www.theverge.com/2022/3/7/22965793/valve-steam-deck-reservation-q3-order-window-october-countries-expansion",
  "date": "2022-03-07T19:19:43.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/E74gWtxRykKhsteoY1PqDM5RS7o=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70590241/vpavic_220210_5030_0096.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"0VuSMm\">If you’re interested in a Steam Deck but haven’t reserved one yet, you might want to make a reservation sometime soon. Valve has updated the Steam Deck page to show that any reservations placed now won’t be able to actually make an order until sometime “after Q3 2022,” which means you shouldn’t expect to get one of the handheld gaming PCs of your own until at least October. </p><p id=\"JeFjrk\">If you have any interest in a Steam Deck, I recommend putting down the $5 required to make a reservation and secure your spot in line. While my colleague Sean Hollister <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">explains in his review</a> that the Steam Deck, at least right now, is “basically an early access game console,” there was a lot about the device he really liked, and hopefully, many of the kinks will be ironed out by that “after Q3” availability window. And if you decide not to follow through with an order, the $5 deposit will be refunded.</p><div class=\"c-float-right\"><aside id=\"Rn8aBD\"><q>There’s good news for the “after Q2 2022” crew</q></aside></div><p id=\"0mLGfF\">Previously, new reservations had an “after Q2 2022” window, so it seems demand is high enough that Valve is pushing the order timeline further into the year. However, for those who already had a reservation with that “after Q2 2022” window, there’s some good news: Valve is <a href=\"https://store.steampowered.com/news/app/1675200/view/3131695559741076638\">beginning to show</a> that some should now expect to be able to make orders in Q3. (You can check <a href=\"https://store.steampowered.com/steamdeck\">the Steam Deck page</a> to see if there’s any update on your order — my own reservation is now in the Q3 group.)</p><p id=\"ABMFjJ\">Valve took the first batch of Steam Deck orders on February 25th, and it sent a second batch of order emails on Monday. The company plans on sending <a href=\"https://www.theverge.com/2022/2/25/22951492/steam-deck-order-email-q1-q2-after\">new rounds of order emails</a> every Monday, and when you get your email, you’ll have 72 hours to make your purchase. Those with a Q1 order window will get an email by the end of March, and starting in April, “we’ll start going through the Q2 queue in a similar fashion,” Valve said <a href=\"https://store.steampowered.com/news/app/1675180/view/3113680716504852534\">in February</a>. </p><p id=\"Xyt1wm\">On Monday, Valve also announced that it’s planning to expand Steam Deck availability to more countries, “including Japan,” by the end of 2022. It’s unclear which countries in addition to Japan might be able to order the device. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dIO0nXzaN_CaSOK_keS2gUkG7zc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270015/vpavic_220210_5030_0096.jpg",
  "description": "You’ll be waiting a long time to actually buy the device.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}