{
  "title": "New EU rules would require chat apps to scan private messages for child abuse",
  "url": "https://www.theverge.com/2022/5/11/23066683/eu-child-abuse-grooming-scanning-messaging-apps-break-encryption-fears",
  "date": "2022-05-11T13:21:28.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/V6R6V2z8y3OaAZQcMjeqKiyGxTs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70856119/akrales_220309_4977_0292.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"T2wVBD\">The European Commission has proposed <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_2976\">controversial new regulation</a> that would require chat apps like WhatsApp and Facebook Messenger to selectively scan users’ private messages for child sexual abuse material (CSAM) and “grooming” behavior. The proposal is similar to plans mooted by Apple last year but, say critics, much more invasive. </p><p id=\"R3BGaz\">After a draft of the regulation leaked earlier this week, privacy experts condemned it in the strongest terms. “This document is the most terrifying thing I’ve ever seen,” <a href=\"https://twitter.com/matthew_d_green/status/1524094474187644933\">tweeted cryptography professor Matthew Green</a>. “It describes the most sophisticated mass surveillance machinery ever deployed outside of China and the USSR. Not an exaggeration.”</p><p id=\"bYy1to\">Jan Penfrat of digital advocacy group European Digital Rights (EDRi) <a href=\"https://twitter.com/ilumium/status/1523997316184694785?cxt=HHwWgoCz3YHfqaYqAAAA\">echoed the concern</a>, saying, “This looks like a shameful general #surveillance law entirely unfitting for any free democracy.” (<a href=\"https://draftable.com/compare/tgFqNFFwFmYF\">A comparison of the PDFs</a> shows differences between the leaked draft and final proposal are cosmetic only.) </p><div class=\"c-float-right\"><aside id=\"GAwRhR\"><q>The biggest burden would fall on popular chat apps</q></aside></div><p id=\"BSdnEC\">The regulation would establish a number of new obligations for “online service providers” — a broad category that includes app stores, hosting companies, and any provider of “interpersonal communications service.” </p><p id=\"4gxnym\">The most extreme obligations would apply to communications services like WhatsApp, Signal, and Facebook Messenger. If a company in this group receives a “detection order” from the EU they would be required to scan select users’ messages to look for known child sexual abuse material as well as previously unseen CSAM and any messages that may constitute “grooming” or the “solicitation of children.” These last two categories of content would require the use of machine vision tools and AI systems to analyze the context of pictures and text messages. </p><p id=\"Y9dVHt\">(In contrast, Apple’s proposal last year to scan messages to find child abuse material would only have looked for <em>known</em> examples of CSAM, which limits the scope for error. After facing <a href=\"https://www.theverge.com/2021/8/10/22613225/apple-csam-scanning-messages-child-safety-features-privacy-controversy-explained\">widespread criticism</a> that its proposal would damage the privacy of users, Apple <a href=\"https://www.theverge.com/2021/12/15/22837631/apple-csam-detection-child-safety-feature-webpage-removal-delay\">removed references to the feature</a> from its site and indefinitely postponed its rollout.)</p><p id=\"2inLe4\">“Detection orders” would be issued by individual EU nations, and the Commission claims these would be “targeted and specified” to reduce privacy infringements. However, the regulation is not clear about how these orders would be targeted — whether they would be limited to individuals and groups, for example, or applied to much broader categories.</p><div class=\"c-float-right\"><aside id=\"hF4oAF\"><q>“It completely leaves the door open for much more generalized surveillance.”</q></aside></div><p id=\"2Y32LG\">Critics of the regulation say such detection orders could be used in a broad and invasive fashion to target large swaths of users. “The proposal creates the possibility for [the orders] to be targeted but doesn’t require it,” Ella Jakubowska, a policy advisor at EDRi, told <em>The Verge</em>. “It completely leaves the door open for much more generalized surveillance.”</p><p id=\"fsjKoH\">Privacy experts say the proposal could also seriously undermine (and perhaps even break) end-to-end encryption. The proposal does not explicitly call for an end to encrypted services, but experts say that requiring companies to install in their systems any software the EU deems necessary to detect CSAM would make robust end-to-end encryption effectively impossible. Because of the EU’s influence on digital policy elsewhere in the world, these same measures could also spread around the globe, including to authoritarian states. </p><p id=\"8CRNDA\">“There’s no way to do what the EU proposal seeks to do, other than for governments to read and scan user messages on a massive scale,” Joe Mullin, senior policy analyst at the digital rights group Electronic Frontier Foundation, <a href=\"https://www.cnbc.com/2022/05/11/eu-plan-to-fight-online-child-sexual-abuse-raises-privacy-concerns.html\">told CNBC</a>. “If it becomes law, the proposal would be a disaster for user privacy not just in the EU but throughout the world.”</p><p id=\"TE1Cg1\">In addition to problems with encryption, the Commission’s decision to target previously unknown examples of CSAM as well as “grooming” behavior has also been criticized. Finding this content would require the use of algorithmic scanners, which the Commission says would preserve the anonymity of targeted users. But experts say such tools are prone to error and would lead to innocent individuals being surveilled by their government.</p><p id=\"ZxxXfm\">“There was uproar when Apple was suggesting something similar for finding known [CSAM] content. But if you introduce ambiguity and these context-dependent scenarios, in which AI based tools which are notoriously unreliable, the challenges are much greater,” said EDRi’s Jakubowska. “You only have to look at how dodgy spam filters are. They’ve been around in our email for 20 years, but how many of us still get spam in our inboxes and miss legitimate emails? That really shows the limitation of these technologies.”</p><p id=\"1KuyDP\">Said Jakubowska, “This whole proposal is based around mandating technically infeasible — if not impossible — things.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QdizJKzcCcLEYg8eNF6Jg9HQepU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318437/akrales_220309_4977_0292.jpg",
  "description": "Critics say the EU’s plans would break encryption.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}