{
  "title": "News with a Capital B: CEO Lauren Williams on why we need news for and by Black people ",
  "url": "https://www.theverge.com/22922029/capital-b-ceo-lauren-williams-black-news-founder-startup-media-local",
  "date": "2022-02-08T15:08:07.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/iX3omDipR2uCo14ULCjjtdydNBk=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70483690/VRG_ILLO_Decoder_Lauren_Williams_s.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>How a Black news startup was born from a racial justice reckoning</p> <p class=\"p--has-dropcap p-large-text\" id=\"FdNGqp\">Lauren Williams is the co-founder and CEO of <a href=\"https://www.capitalbnews.org/\"><em>Capital B</em></a>, a new nonprofit media company dedicated to news for Black audiences. <em>Capital B</em> launched on January 31st, with both a national news site and a local newsroom dedicated to Atlanta — and the company plans to expand to more cities over time.</p><p id=\"4FPxQb\">This interview is a little looser and chattier than usual since Lauren used to be the editor-in-chief and senior vice president of <em>The Verge</em>’s sister site, <a href=\"http://Vox.com\">Vox.com</a>. We were co-workers for a long time, and we’re still friends. So while I did my best to ask all the <em>Decoder</em> questions, we might have made each other laugh a little more than usual.</p><p id=\"4Ya3kN\">I wanted to know why Lauren decided to go and found a startup, what the last year of building that startup ahead of launch has been like, and how she thinks about standing out in a media business where the pressures of social media and search traffic kind of make everything look the same. And, of course, I wanted to know how she plans to grow. Now that she’s the CEO, how is she making decisions about <em>Capital B</em>’s path forward?</p><p id=\"4fBEFp\">Lauren was just on the podcast <a href=\"https://www.vox.com/recode-media-podcast\">Recode Media with Peter Kafka</a>, where she talked in more detail about the editorial vision for <em>Capital B</em>. That conversation is great, and you should listen to it, but it’s not what we talked about. I wanted to spend more time on, well, <em>Decoder</em> stuff: being a founder, raising money, and making decisions. Lauren is a really sharp leader, and I think you’re going to like this one.</p><p id=\"ogs3cw\">Okay. Lauren Williams, co-founder and CEO of <em>Capital B</em>. Here we go. </p><div id=\"xgfKm4\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP5428151992\" width=\"100%\"></iframe></div><p id=\"X5wShx\"><em>This excerpt has been lightly edited for clarity. A full transcript will be available soon.</em></p><p id=\"N0aGni\"><strong>It’s hard to remember what that moment felt like, particularly in media. Almost two years ago now — it was around the time of the George Floyd protest — we were in the middle of the pandemic; there was an election coming up. It did feel like the media was failing. It had failed to tell some important story, and a lot of people were just opting out of the traditional media ecosystem. Do you think that </strong><em><strong>Capital B</strong></em><strong> sits as a part of that traditional ecosystem? Does it sit next to it? Are you aiming to build something else entirely?</strong></p><p id=\"yWVEea\">I think it sits next to it, but it is, in that sense, a part of that movement of [thinking] something here is not working. Something here in traditional media is too constrained or too set in its ways to respond to — either from a business perspective or from an editorial perspective — the needs of the moment. That is, I think, really, really seen in local news, which is failing across the country and desperately needs refreshing. That is a business issue for local news. It’s a cultural issue as well. There’s an enormous trust problem, and those business issues and those trust issues really do go hand in hand. They’re aligned, and the effects of those issues are one and the same. Misinformation and disinformation are rising, lack of local news contributes to polarization, and we need new ideas to respond to those issues.</p><p id=\"QiPDIt\"><strong>You left Vox in February of 2021. It’s now February of 2022. You’ve been building for a year. What has that process been like?</strong></p><p id=\"W9JvWI\">It’s been a lot of really intense fundraising for most of it. We needed to raise a lot of money to do what we wanted to do. Our idea is ambitious: to have a national newsroom and also launch a local newsroom. We want to have a centralized business function that’s going to be able to support not just our first local newsroom, which is in Atlanta, but also our subsequent local newsrooms. That’s not cheap. And we want to be able to do the kind of journalism that we want to do for our audience and that we feel like our audience deserves — that’s also not cheap. We have to raise a lot of money, and it’s hard to raise a lot of money, and it took a while before we could start hiring and making the plans we needed to make to actually launch.</p><p id=\"lEjsy4\"><strong>I feel like a very underappreciated part of a founder’s life is just the amount of time spent on raising money. What did that look like for you? What were those meetings like? Were you going after people you thought you could win? Were you going after everybody? How did you make that strategy?</strong></p><div class=\"c-float-right c-float-hang\"><div id=\"Yp5bZ9\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"Gkdkch\">Well, you asked earlier why we decided to do this now, and I gave a true answer, but one of the things that I left off was that in 2020, there was an enormous new will to address racial equity issues in our country. Every industry, every corner of business had their own reckoning, and philanthropy was no different. We also know that those things are fleeting, and it really did seem like we needed to jump on that moment before it went away so that we could raise money for <em>Capital B</em>. While we were raising money last year, all these foundations had their racial equity funds that they had created and were really, really, really interested in two Black women founders who were starting a news organization like ours. </p><p id=\"z9qv7c\">That created a lot of opportunities for us and doors that were open to us that would not have been opened otherwise. It was still really hard raising money. Foundations are really interesting. On their homepage, they’ll have this big, splashy “we care about racial equity” kind of thing. Then once you get down to finding the contact to get a meeting, they’ll say, “Don’t call us, we’ll call you. No unsolicited grants. We don’t take meetings. We identify for ourselves the people we want to give grants to.”</p><p id=\"O70yr0\">How does this work if you don’t know anyone? That’s something that we ran into a lot. Particularly for me. I was at <em>Vox</em> for almost seven years. I’m not from the philanthropy world. I did not have any contacts in this space at all. You hit a lot of brick walls because you do have to know someone to get into these rooms.</p><p id=\"RcAlGg\"><strong>There is not just one party where all the billionaires are?</strong></p><p id=\"eHWESv\">There is not one party where the billionaires are. And at the big foundations, you have to get an introduction somehow. If you’re not in, you’re not in.</p><p id=\"GDAMNQ\"><strong>Do you think that process was made easier or harder with the amount of remote work that everyone has been doing? I feel like it could go either way.</strong></p><p class=\"c-end-para\" id=\"y6EWIr\">I think it was actually easier. I think that three years ago, you had to fly places for these meetings, and now they’re all on Zoom. I think that will continue. I think everyone’s happy. I think everyone involved is happier about that.</p><aside id=\"axXkno\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe now!\",\"url\":\"https://podcasts.apple.com/us/podcast/decoder-with-nilay-patel/id1011668648?i=1000496212371\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/sge5QIrCAy42IFc_-_K7Qeyl2C8=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23223559/VRG_ILLO_Decoder_Lauren_Williams_s.jpg",
  "description": "Capital B was born from a racial justice reckoning.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}