{
  "title": "NFT money laundering is a small but growing sector, says Chainalysis report",
  "url": "https://www.theverge.com/2022/2/2/22914056/nft-money-laundering-chainalysis",
  "date": "2022-02-02T14:56:28.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/oQnyJgLOwVyxX1Sp7VmZjYqaeNc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70462023/acastro_210329_1777_nft_0005.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"6bGuSj\">Money laundering through the buying and selling of NFTs is a small but growing sector of criminal activity, according to a <a href=\"https://blog.chainalysis.com/reports/2022-crypto-crime-report-preview-nft-wash-trading-money-laundering/\">Chainalysis report</a> released Wednesday.</p><p id=\"UkucCc\">The report found a small but growing portion of activity on NFT marketplaces that could be attributed to money laundering, which quantified this amount by tracking value sent to NFT marketplaces from cryptocurrency addresses known to be associated with scams, theft, malware operators, and accounts under legal sanctions. In total the amount tracked was small — around $1.4 million in Q4 2021 — but had grown significantly from the beginning of the year.</p><div id=\"wpUmPn\"><iframe title=\"Illicit value received by NFT platforms, 2020-2021\" aria-label=\"Stacked Column Chart\" id=\"datawrapper-chart-Aw0ag\" src=\"https://datawrapper.dwcdn.net/Aw0ag/1/\" scrolling=\"no\" frameborder=\"0\"  height=\"500\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script></div><p id=\"xkbfpt\">“All of this activity represents a drop in the bucket compared to the $8.6 billion worth of cryptocurrency-based money laundering we tracked in all of 2021,” the report’s authors write. “Nevertheless, money laundering, and in particular transfers from sanctioned cryptocurrency businesses, represents a large risk to building trust in NFTs, and should be monitored more closely by marketplaces, regulators, and law enforcement.”</p><p id=\"ASLTti\">The same Chainalysis report also points to a growth in wash trading, the practice of NFT owners “selling” an NFT by sending money to themselves from a cryptocurrency wallet that they control, and creating a false impression of value. Wash trading has long been a problem for cryptocurrency exchanges — where it gives a misleading sense of trade volume — but it is now increasingly a problem for NFT marketplaces too. </p><div class=\"c-float-right\"><aside id=\"G86p8r\"><q>“This activity represents a drop in the bucket compared to the $8.6 billion worth of cryptocurrency-based money laundering we tracked in all of 2021”</q></aside></div><p id=\"ymAm4o\">Chainalysis identified thousands of cases of NFTs bought from self-financed addresses, meaning instances where either the wallet address that purchased the NFT had first been sent money by the selling address of the NFT, or a common address had sent funds to both buyer and seller addresses. </p><p id=\"aCykxX\">The most prolific wash seller found by Chainalysis had reportedly made 830 such sales. And 262 users were identified as making self-funded sales more than 25 times; the total profit made by this group was about $8.9 million.</p><p id=\"SnPYN4\">Wash trading also has an impact on the perceived relationship between marketplaces. Last week, NFT marketplace LooksRare surpassed OpenSea by trade volume, but analysts found that <a href=\"https://decrypt.co/91510/looksrare-has-reportedly-generated-8b-ethereum-nft-wash-trading\">over $8 billion of trades</a> could have been users selling NFTs to themselves.</p><p id=\"6SqSss\">In general, the ease with which cryptocurrency can be sent and received anonymously has led to concerns over money laundering since the creation of Bitcoin. Mixer services (which split transactions into many small fractions and then reassemble them into “clean” cryptocurrency) have emerged as a thorn in the side of law enforcement.</p><p id=\"O9SKjT\">In response, agencies have aggressively targeted money laundering in the cryptocurrency space, taking down services like <a href=\"https://www.theverge.com/2021/4/29/22409501/feds-arrest-founder-bitcoin-mixer-laundered-cryptocurrency\">Bitcoin Fog in 2021</a>, <a href=\"https://www.theverge.com/2020/2/13/21136749/doj-ohio-helix-bitcoin-darknet-cryptocurrency-laundering-crime\">Helix in 2020</a>, <a href=\"https://www.bleepingcomputer.com/news/security/bestmixerio-service-shut-down-for-laundering-200-million-/\">BestMixer in 2019</a>, and even launching a sting in 2018 that saw federal agencies taking over operations of <a href=\"https://www.theverge.com/2018/6/27/17509444/dark-web-drug-market-money-laundering-hsi-dark-gold\">a money-laundering service</a> to gather evidence.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hkt5_bHCATOcBtBq43MlRH8FpRg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22413650/acastro_210329_1777_nft_0005.jpg",
  "description": "The amount tracked was relatively low, but showed significant increase since 2020.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}