{
  "title": "NFTs will be on Instagram soon, according to Mark Zuckerberg",
  "url": "https://www.theverge.com/2022/3/15/22979926/instagram-nfts-meta-zuckerberg-sxsw-metaverse",
  "date": "2022-03-15T22:48:08.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H5OoTHPx50EJz98JhM7dH-MMQUE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70627724/acastro_211101_1777_meta_0003.0.jpg\" />        <figcaption><em>He provided some details, but didn’t talk specific features.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"sotCNn\">Mark Zuckerberg said that Meta would add NFTs to Instagram, <a href=\"https://www.engadget.com/mark-zuckerberg-confirms-nf-ts-are-coming-to-instagram-204435805.html?src=rss\">according to <em>Engadget</em></a> and <a href=\"https://www.thedailybeast.com/meta-boss-mark-zuckerberg-says-nfts-are-coming-to-instagram-in-a-big-way-at-sxsw\"><em>The Daily Beast</em></a>. While he didn't describe exactly what that would look like, he said <a href=\"https://schedule.sxsw.com/2022/events/PP1141589\">during a session at South By Southwest</a> that \"over the next several months, the ability to bring some of your NFTs in, hopefully over time be able to mint things within that environment.\"</p><p id=\"YKS3wY\">There have been rumblings that this was coming. Last year, Instagram lead Adam Mosseri <a href=\"https://twitter.com/LibraryNft/status/1472205264971608076?s=20\">said</a> the team was \"actively exploring NFTs\" but didn't have any actual announcements. In January, we <a href=\"https://www.theverge.com/2022/1/20/22892917/meta-facebook-instagram-plans-make-show-case-sell-nfts\">heard a report</a> that teams at Facebook and Instagram were working on NFT integrations. The report mentioned that there was progress on features to let you use an NFT as a profile and mint NFTs on the platform and discussions around creating a marketplace. </p><div class=\"c-float-right\"><aside id=\"G7a4vM\"><q>Instagram’s NFT integration could be relatively limited at first</q></aside></div><p id=\"Z755Hk\">Those first two features gel well with what Zuckerberg mentioned onstage, but it's still not exactly clear what minting an NFT on Instagram would mean. Could you sell a popular post as an NFT, perhaps? Or mint NFTs that act as passes to let people see specific stories? Meta isn't saying yet, though it does seem that minting capabilities won't be coming until further down the line. The idea for a marketplace seems like it could be even further off, as it seemingly didn't get a direct reference from Zuckerberg, though the <a href=\"https://www.theverge.com/2022/2/2/22914081/open-sea-nft-marketplace-web3-fundraising-finzer-a16z\">massive valuation of sites like OpenSea</a> likely makes it a tempting business venture.</p><div class=\"c-float-left\"><div id=\"IXyqUc\"><div data-anthem-component=\"aside:10374749\"></div></div></div><p id=\"ZrMaow\">Of course, there's also a metaverse angle here as well. Zuckerberg reportedly talked about minting your avatar's clothing as an NFT and taking \"it between your different places.\" Zuckerberg has <a href=\"https://www.theverge.com/22749919/mark-zuckerberg-facebook-meta-company-rebrand\">talked about NFTs and the metaverse before</a>, saying that he could see them as part of the digital world's governance. Now, it seems like he's thinking about them as digital objects, something <a href=\"https://www.coindesk.com/business/2021/10/28/facebooks-metaverse-will-support-nfts/\">brought up by Meta before</a>.</p><p id=\"gNg6pQ\">He did note on Tuesday that \"a bunch of technical things that need to get worked out before that'll really be seamless to happen.\" For one, Meta would have to make sure the objects integrated well on different platforms, which <a href=\"https://twitter.com/tha_rami/status/1480404367459168258\">isn't particularly easy</a>. It'd also have to, you know, actually, <a href=\"https://www.theverge.com/22701104/metaverse-explained-fortnite-roblox-facebook-horizon\">build a metaverse</a> for that to happen in (which does seem like a small technical hurdle).</p><p id=\"IgmZEG\">Instagram won't be the first major social network with an NFT integration. Earlier this year, Twitter <a href=\"https://www.theverge.com/2022/1/20/22893502/nft-twitter-profile-picture-crypto-wallet-opensea-coinbase-right-click\">introduced a feature</a> that let some users set an NFT they own as their profile picture. They then show up as hexagons, and anyone interested can click through to see the NFT's metadata. Given how often TikTok features <a href=\"https://www.theverge.com/2021/12/13/22832529/instagram-reels-visual-replies-feature-tiktok-copy\">end up with a near carbon-copy on Instagram</a>, it wouldn't be surprising to see Meta's photo-sharing (er, <a href=\"https://www.theverge.com/2021/6/30/22557942/instagram-no-longer-photo-app-video-entertainment-focus\">\"entertainment\"</a>) app do something similar.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7_DEKXgLohyHzTf_PYfUHXUlRqE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22977157/acastro_211101_1777_meta_0003.jpg",
  "description": "Zuckerberg also wants NFTs in his metaverse",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}