{
  "title": "NFTs seized by UK tax authorities for the first time",
  "url": "https://www.theverge.com/2022/2/14/22932824/hmrc-nft-seizure-fraud-investigation",
  "date": "2022-02-14T11:51:40.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8IarWbOMhYZRUPAr2GwpU8S03kc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70506372/acastro_211115_4866_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"LvS428\">The UK’s tax department, Her Majesty’s Revenue and Customs (HMRC), says it’s the first authority in the country to seize an NFT, <a href=\"https://www.bbc.co.uk/news/business-60369879\"><em>BBC News </em>reports</a>. The seizure was made as part of a £1.4 million (roughly $1.9 million) fraud case, in which three individuals have been arrested. The authority seized £5,000 worth of crypto assets (around $6,762) alongside three NFT artworks which have yet to be valued. </p><p id=\"kwQC6b\">As cryptocurrencies have exploded in price, high profile seizures by authorities have become increasingly common. Just this month the USA’s Department of Justice <a href=\"https://www.theverge.com/2022/2/8/22923772/doj-irs-bitfinex-hack-bitcoin-recovery-encrypted-files-razzlekhan\">seized $3.6 billion worth of cryptocurrency</a> linked to the 2016 Bitfinex hack. But this is one of the first high profile seizures of NFTs, digital assets that attempt to serve as proof of ownership of media like images or songs.</p><div class=\"c-float-right\"><aside id=\"uFivBl\"><q>HMRC hopes it “serves as a warning to anyone who thinks they can use crypto assets to hide money”</q></aside></div><p id=\"4uxEjN\">According to HMRC’s deputy director of economic crime, Nick Sharp, the authority “constantly adapt[s] to new technology to ensure we keep pace with how criminals and evaders look to conceal their assets.” He told <em>BBC News</em> the seizure “serves as a warning to anyone who thinks they can use crypto assets to hide money from HMRC.”</p><p id=\"sTLZbY\">The suspected fraud is alleged to have involved 250 fake companies, and the three suspects apparently used everything from fake addresses, pre-paid phones, VPNs, and stolen identities to hide their activities from HMRC. <a href=\"https://news.sky.com/story/hmrc-officials-seize-nft-crypto-assets-as-three-arrested-on-suspicion-fraud-12541831\"><em>Sky News</em> reports</a> that HMRC has not taken control of the NFTs, but that it is using a court order to prevent them from being sold.</p><p id=\"kmv2vH\">This is unlikely to be the last time we hear about authorities seizing NFTs. Recently an IRS special agent noted that the agency is increasingly focusing on crypto-assets because of the “mountains” of fraud it’s seeing in the area, <a href=\"https://www.bloombergquint.com/onweb/irs-seeing-mountains-and-mountains-of-fraud-with-crypto-nfts\"><em>Bloomberg Quint </em>reported</a>. With individual NFTs <a href=\"https://www.theverge.com/2021/3/11/22325054/beeple-christies-nft-sale-cost-everydays-69-million\">being sold for millions</a> as part of an <a href=\"https://www.bloomberg.com/news/articles/2022-02-10/seemingly-ubiquitous-nfts-make-up-only-1-of-crypto-universe\">industry valued at around $16 billion</a>, it’s inevitable that authorities will start becoming more involved.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9nKn-JgESItCgiXJZyDtrulIAKY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23018794/acastro_211115_4866_0001.jpg",
  "description": "Three NFTs were seized alongside cryptocurrency.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}