{
  "title": "Night Sky is a warm, comforting sci-fi with too much filler",
  "url": "https://www.theverge.com/23124019/night-sky-review-amazon-prime-video",
  "date": "2022-05-18T18:27:07.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2HodEDITcQdxAmOvtQvUNgWE0YU=/0x2:3600x2402/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70884075/NSKY_S1_UT_108_210921_HODCHU_00299R2C_V2.0.jpg\" />        <figcaption><em>J.K. Simmons and Sissy Spacek in </em>Night Sky<em>.</em> | Image: Chuck Hodes / Amazon Prime Video</figcaption>    </figure>  <p id=\"9zE4eO\">Irene and Franklin York are a lot like other older couples. They keep on top of each other about following doctor’s orders, joke about their complicated daily intake of pills, and, when the mood is right, they put on some Sam Cooke and dance in the living room, just like in the good old days. In short, they’re adorable. But there’s one key difference between the Yorks and most retired couples: hidden away in their shed right behind a wooden sign that says “to the stars” is a portal to another world.</p><p id=\"1aPcA1\">This is the basic setup for <em>Night Sky</em> on Amazon Prime Video. The show’s first episode debuts this week and, early on, follows Irene (Sissy Spacek) and Franklin (J.K. Simmons) as they go about their life, which just so happens to include the occasional visit to outer space to take in the view. Irene is using a wheelchair as she recovers from a recent fall, and Franklin is struggling with his memory. With all of these challenges, Irene has made the mystery of their space shed a huge priority. She can’t stop thinking about it, and she refutes Franklin’s efforts to tell anyone else about it. “It was meant for us,” she says “It’s our riddle to solve.”</p><p id=\"rrDLbl\">The first episode of <em>Night Sky</em> feels so refreshing primarily because of Spacek and Simmons. In the three decades since <em>Cocoon</em>, science fiction stories centered on older people are still pretty rare. There’s not much in the way of action. Outside of contending with the mystery of the cosmos — which, it should be noted, is becoming a bit boring for Franklin; after more than 800 visits, he’d rather watch the ball game — the couple are exceedingly normal. The day after a trip to the stars, Franklin gets mad at his neighbor for mowing across his property line. Irene uses a friend’s Alzheimer’s disease as an excuse to finally tell <em>someone</em> about what’s going on.</p><p id=\"Y6CTz2\">The show is warm, sweet, and occasionally heartbreaking — but, unfortunately, much of that gets overshadowed as the story gets increasingly complicated.</p><div id=\"l9n9M0\"><div ><iframe src=\"https://www.youtube.com/embed/XLnhAbbMkEY?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"HEziem\">Starting with an important cliffhanger at the end of the first episode, <em>Night Sky</em> steadily becomes another puzzle box of a show. It’s a genre that’s been well-represented of late through the likes of <a href=\"https://www.theverge.com/22891108/yellowjackets-season-1-teen-survival-showtime\"><em>Yellowjackets</em></a>, <a href=\"https://www.theverge.com/23015650/severance-season-1-review-apple-tv-plus\"><em>Severance</em></a>, and <a href=\"https://www.theverge.com/23057187/outer-range-season-1-review-amazon-prime-video\">Amazon’s own <em>Outer Range</em></a>. After the quiet, contemplative opening, <em>Night Sky</em> gets busy and complicated. There’s a strange man living with the Yorks; a nosy neighbor determined to find out what’s going on in the shed; cults and secret societies tied to the portal; a mother and daughter in Argentina guarding an old temple; and all kinds of seemingly alien technology of unknown origin.</p><p id=\"j658m0\">There’s nothing wrong with a good, complex mystery, of course. I’ve spent quite a bit of time thinking about the baby goats from <em>Severance</em> and <em>Outer Range</em>’s big hole. The problem in <em>Night Sky</em> is that none of these side stories are anywhere as interesting as Irene, Franklin, and their space shed. Instead, they’re mostly unsatisfying detours. Sometimes these detours provide some interesting new context — this is particularly true when it comes to their temporary roommate Jude (Chai Hansen), who becomes tightly intertwined with the Yorks — but, just as often, they focus on underdeveloped characters and plot lines that don’t really go anywhere.</p><p id=\"Hmvigc\">This is especially frustrating because, when the show does center on Franklin and Irene, it’s wonderful. Simmons and Spacek bring a natural warmth to their relationship that’s just a pleasure to watch, even when things take a dark turn later in the season. Their charm can even help paper over some of the show’s problems. <em>Night Sky</em> is a story where characters make decisions and keep secrets for reasons that seem designed only to move the plot forward rather than being something an actual human would do. (Seriously, <em>everyone</em> lies about <em>everything</em>, even when they have no reason to.) It’s frustrating but can be easier to ignore when you’re in the cozy embrace of the York household.</p><p id=\"GwoqWa\">Ultimately, <em>Night Sky</em> is a show for people who thought Rose and Bernard were the best part of <em>Lost</em>. (Also known as people with correct opinions.) The presence of Spacek and Simmons, along with the core central mystery, is largely enough to propel the show through its eight episodes. Thankfully, the season ends on a note that really evokes that wonderful first episode — but there’s a lot of filler between those two bookends.</p><p id=\"oqi6gk\"><small>Night Sky </small><small><em>starts streaming on Amazon Prime Video on May 20th.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KgbfPZtWIJq8KuUfJZCnwa4j4-M=/0x260:3600x2145/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23536828/NSKY_S1_UT_108_210921_HODCHU_00299R2C_V2.jpg",
  "description": "An uneven first season.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}