{
  "title": "Nike restocks the hard-to-find Go FlyEase slip-on sneakers  ",
  "url": "https://www.theverge.com/2022/5/2/23053345/nike-flyease-go-accessiblity-restock",
  "date": "2022-05-02T15:52:52.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Nike Go FlyEase\" src=\"https://cdn.vox-cdn.com/thumbor/wNdsLFGjqrTt8WEorNMwTHzpbeE=/320x0:1601x854/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70822595/c748bc50_64f5_11eb_bfed_408b02ac5810.0.jpeg\" />        <figcaption><em>Nike’s Go FlyEase sneakers feature a bistable hinge that allows you to put them on hands-free.</em> | Image: Nike</figcaption>    </figure>  <p id=\"7FiThc\">Nike’s Go Flyease sneakers are <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.nike.com/t/go-flyease-shoes-V7n8cS/CW5883-400\" rel=\"sponsored nofollow noopener\" target=\"_blank\">back in stock</a>. Normally, sneaker restocks are something you don’t expect anyone other than hypebeasts to get excited about, but it’s a bit different with Nike’s hands-free shoes. While praised for its accessible design, the $120 Go FlyEase has also been notoriously hard to find for the people who would benefit from them the most.</p><p id=\"EQwpep\">The <a href=\"https://www.theverge.com/tldr/2021/2/1/22260179/nike-go-flyease-shoes-hands-free-pricing-release-day\">Go FlyEase</a> made a splash when it was first introduced thanks to its bistable hinge. The design allows the shoe to switch between an “open” and “closed” position, making it possible for someone to simply step into the shoe without having to use their hands. The issue was Nike didn’t handle the launch well. A combination of limited availability and hype led to resale sites marking up prices to over $400 from the original $120 price tag. Those with limited mobility <a href=\"https://twitter.com/LeoInLaurent/status/1388739788522627072?s=20\">shared their difficulties</a> finding the shoes on social media, which then led to Nike being accused of using <a href=\"https://www.npr.org/2021/03/28/981197687/nike-accused-of-using-disability-to-hype-new-hands-free-sneaker\">accessibility as a marketing scheme</a>.</p><p id=\"TJk71A\">It doesn’t help that new versions of FlyEase tech tend to also be limited editions — if they’re even available to the average consumer at all. For the Beijing Winter Olympics earlier this year, Nike designed the <a href=\"https://www.theverge.com/2022/1/21/22894903/nike-olympics-paralympics-flyease-gaiadome\">ACG Gaiadome FlyEase Boot</a> for Team USA. The boot could be put on one-handed and was designed for those who may have limited dexterity. However, while the rest of the Team USA gear was available for purchase, the FlyEase boot was an athlete exclusive.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nDCAG_YaE6CwVv0zs0UUlFdAqCk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432823/Screen_Shot_2022_05_02_at_11.29.11_AM.png\">      <cite>Screenshot: Victoria Song / The Verge</cite>      <figcaption><em>Folks are definitely snapping the shoes up — but how many of them are resellers?</em></figcaption>  </figure><p id=\"X3XVGp\">Given that context, it’s good to see that shoes are finally back in stock — though there’s no indication of just how <em>much</em> stock there is. As of this writing, some sizes and colorways have already sold out.</p><p id=\"u53iVB\">Nike’s page explicitly describes the Go FlyEase as “great for people with limited mobility seeking ease of entry,” so there’s no denying who the target audience is. As Nike also notes, the shoes are also a good option for people who needs a quicker way to take shoes on or off. That’s because inclusive design generally benefits everyone. Hopefully, resellers don’t ruin it for the folks who genuinely need accessible shoes — and Nike continues to expand availability going forward.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WalV5iBOwWCbcm2MBRW-V4yheLU=/145x0:1776x854/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22694879/c748bc50_64f5_11eb_bfed_408b02ac5810.jpeg",
  "description": "The hands-free shoes aren’t easy to find for people who need them.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}