{
  "title": "Nintendo squeaks past Switch sales target but forecasts further slide",
  "url": "https://www.theverge.com/2022/5/10/23064853/nintendo-earnings-q4-2021-switch-sales-forecast-2022",
  "date": "2022-05-10T07:16:05.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sJeWcykMLa72Rt03yjLO1j2E9-0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70851111/acastro_190530_1777_switch_0001.0.0.jpg\" />        <figcaption>Illustrations by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ck1fg0\">Nintendo shipped 4.11 million Switch consoles in its January-March quarter, bringing its total to 23.06 million for the financial year, just enough to meet its revised forecast of 23 million. The company had originally predicted 25.5 million units for the year, then 24 million, before reaching its final forecast three months ago. The figure represents a 20 percent decline on the previous year’s figure of 28.83 million consoles shipped, with Nintendo citing shortages of semiconductors and other components.</p><p id=\"8KC3Im\">Nintendo has now shipped 107.65 million Switch consoles in total since its launch in March 2017. It’s the company’s most successful home console, having <a href=\"https://www.theverge.com/2022/2/3/22915715/nintendo-earnings-q3-2021-switch-sales-forecast\">recently overtaken the Wii</a>, though if you consider it a handheld system it still has some way to go to catch up to the Nintendo DS’ figure of 154.02 million units or the Game Boy’s 118.69 million. </p><div class=\"c-float-right\"><aside id=\"M9dAun\"><q>Switch sales may well have peaked</q></aside></div><p id=\"ZZlGAk\">As for software, <em>Pokémon Legends: Arceus</em> made a strong debut last quarter, with 12.64 million units shipped to date. For comparison, the previous quarter’s <em>Pokémon</em> remakes <em>Brilliant Diamond</em> and <em>Shining Pearl</em> debuted with 13.97 million units and have now shipped 14.65 million in total, so <em>Arceus</em> is essentially performing in line with traditional <em>Pokémon</em> games.</p><p id=\"VXjtCC\">Nintendo’s forecast for its current fiscal year, which began on April 1st, is to ship 21 million Switch consoles, suggesting sales for the system may well have peaked. The company’s revenue and operating profit are also expected to decline by 5.6 percent and 15.6 percent respectively.</p><p id=\"S0D8d9\">The first-party release schedule for the year includes upcoming Switch games like <em>Splatoon 3</em>, <em>Xenoblade Chronicles 3</em>, and <em>Pokémon Scarlet</em> and <em>Violet</em>. The much-anticipated sequel to <em>The Legend of Zelda: Breath of the Wild</em> is set for a spring 2023 release date, which may or may not fall in the current financial year ending March 31st.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hO199axij5tmUNFM_iSgRbAbJNs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16309933/acastro_190530_1777_switch_0001.0.jpg",
  "description": "Switch sales may well have peaked.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}