{
  "title": "Nintendo Switch Sports isn’t a must-own, but it’s a great party game",
  "url": "https://www.theverge.com/2022/4/27/23044617/nintendo-switch-sports-wii-sports-party-game",
  "date": "2022-04-27T15:45:38.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4VwRKACrnus0jTe_Hw627DeZFTI=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70799988/chambara.0.png\" />        <figcaption>Nintendo</figcaption>    </figure>  <p>Your kids will love this — your arms will not</p> <p id=\"v8TnOI\"><a href=\"https://www.theverge.com/2022/4/11/23014891/nintendo-switch-sports-wii-bowling-features-mini-games-price-release-date-hands-on\"><em>Nintendo Switch Sports</em> is a great party game</a>. All six minigames are massively fun, perfect for families or a date night in. But unlike its spiritual predecessor, <a href=\"https://www.theverge.com/2019/8/5/20750161/wii-sports-speedrunning-nintendo\"><em>Wii Sports</em></a> — the most popular title of the entire Wii library — <em>Nintendo Switch Sports</em> doesn’t feel like a must-own game, but merely a good one to have around in case company comes over.</p><p id=\"v2zCys\">In <em>Nintendo Switch Sports</em>, there are six sport minigames: soccer, badminton, tennis, bowling, volleyball, and chambara. Each game supports solo or multiplayer, with some games permitting up to four players at a time.</p><p id=\"NF2VFZ\">Before starting a game, players can create their own character by either selecting from a menu of customization options or importing a Mii. There are not a lot of choices available (there’s only one natural hair option, boo), but it does seem like there will be a way to potentially earn more outfits and hairstyles, even though I didn’t come across that as I played. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/p1Tk7Usqujk32V3tYXDFbXkpRxI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420107/clothing_options.png\">      <cite>Nintendo</cite>      <figcaption>I have the feeling you can maybe earn more clothing options via online play which was not permitted during the review period</figcaption>  </figure><p id=\"LQCS0f\">Since <em>NSS </em>is a party game, I threw a party. My partner has a niece and nephew, Jane and Jude, and I invited them over to help me play. I wanted to see how kids experienced the game since I figured a majority of people interested in <em>Nintendo Switch Sports</em> will be families with children. They loved it. Jude, the younger sibling, is the gamer of his household, so he took to the game immediately. It took Jane, the chill older sister, a little bit for her to “get it,” but by the end, she was smiling and shouting along with her brother. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/snQD8gF4WrCMm4c8ntewiPd1WCo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420071/jane_jude.png\">      <cite>Ash Parrish / The Verge</cite>      <figcaption><em>Jane projects the image of the too cool for school, older sister, but even she got into Nintendo Switch Sports.</em></figcaption>  </figure><p id=\"8unjDk\">Of the six games, Jane and Jude declared clear winners and losers. They didn’t seem to like tennis too much. The game requires you to play doubles, and putting them in control of two characters at the same time got confusing. I thought volleyball wouldn’t earn high marks either, as the controls for bumping, setting, and spiking seemed a little complicated even to me, but that was one of their favorites. </p><p id=\"B5IJQ1\">Both kids liked soccer but thought the controls were too fussy. <em>NSS </em>soccer involves chasing an oversized ball throughout a high-sided pitch (kinda like <em>Rocket Leagu</em>e), requiring a complete Joy-Con controller setup for each player. It was a lot of chasing down a runaway ball, ricocheting shots off the walls and goalposts with very few points scored. But soccer wasn’t all ho-hum. It’s one of the few games that have special game modes, and the shoot-out mode is where all the fun is hidden. Jude got a kick (heh) out of flailing in my living room, physically kicking the ball by way of the Joy-Con strapped to his leg. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3Wl_fBD0zIFtpePiQM6-Xg6Mcuo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420064/judesoccer.png\">      <cite>Ash Parrish / The Verge</cite>      <figcaption><em>Jude really enjoyed using the Joy-Con to kick the ball.</em></figcaption>  </figure><p id=\"KbXDMN\">Chambara is the <em>NSS</em> version of sword fighting. In it, you must remove your opponent from an elevated arena before time runs out. Each successful strike knocks your opponent back toward the arena’s edge, and each successful block stuns your opponent for a few seconds, leaving them vulnerable to attack. </p><p id=\"BQYaSc\">Chambara was the uncontested champion of the six minigames. It made for some of the most exciting matches with my volunteer playtesters, with plenty of swift defeats and protracted duels decided in the final seconds. Chambara is the most strategy-dependent minigame, and that’s where most of its appeal lies. The other games are knock-down, drag-out point bonanzas rewarding whoever is the most aggressive player. Try that strategy in chambara, and you’ll be stun-locked into a swift defeat. </p><p id=\"pM95eQ\">Chambara requires you to read your opponent’s body language and make split-second decisions. It’s a thinking person’s game that also requires you to be ungodly fast with your sword arm. I swung my arms sore playing chambara with the kids and loved every second of it. If you are an older gamer and feel the need to humble yourself about your decades of gaming experience, play chambara with a 12-year-old.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mTlg6LlGlwOIiMts-pBtk5qlZsw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420088/ash_jude.png\">      <cite>Ash Parrish / The Verge</cite>      <figcaption>Is this my most flattering picture? No. Am I having fun getting stomped on in chambara by a 12-year-old? Very yes.</figcaption>  </figure><p id=\"ok5DUJ\">Bowling was fun, if unremarkable, for the kids, but it ended up being one of the better games my partner and I enjoyed on our own. My partner was on the bowling team in high school and still is pretty damn good. His bowling in real life looks like magic to me. My mind just can’t comprehend how he can throw a ball straight down the middle of a lane, then have it suddenly veer left or right just as it reaches the pins. It’s witchcraft — I should have him burned at the stake. And somehow, someway, he can do the same thing in a video game. It’s wild.</p><div id=\"YNCkCt\"><div ><iframe src=\"https://www.youtube.com/embed/mnmG3BCfXQM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"wNGzWG\">In bowling, you can choose between playing on either a traditional flat lane or a special lane with obstacles that change with each frame. Playing the special course made the most use of my partner’s ball-bending abilities. Just like in real life, a twist of his wrist would hook the ball around barriers in the middle of the lane as though he were directing its movement with his mind. He destroyed me easily, and I didn’t even mind; I was simply in awe of my partner’s bowling ability and the fidelity with which this particular minigame was made.</p><p id=\"MVHGQn\">One of the most glaring annoyances of <em>Nintendo Switch Sports</em> is inconsistency with its tutorials. With chambara, soccer, and volleyball, you’ll have the option to play through a tutorial or skip it. With tennis, and badminton, and bowling, you’re thrown into a game immediately, and it’s up to you to figure out how to play. </p><p id=\"69Eu8G\">That’s okay for the most part. At least with bowling, a little pop-up will occasionally remind you to hold down the Z trigger during your wind-up and release, and there’s an always-on control legend at the bottom to remind you how to line up and angle your shots.</p><p id=\"mITjEI\">Tennis and badminton have no such hints. There are several different ways to hit the ball / shuttlecock with varying speeds and trajectories, and the game refuses to explain how to affect the direction or speed you may want. You just swing your arm and hope.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XGwwCjGDIR4hiWGx_xJV0jqyuLE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23420117/badminton.png\">      <cite>Nintendo</cite>      <figcaption>Your guess is as good as mine on how to play badminton or tennis effectively.</figcaption>  </figure><p id=\"e3qSOt\">In both games, there’s a colored streak that trails behind the projectile depending on how it was hit. A normal hit gives a blue streak. A poor hit will send the projectile wobbling high in the air with a purple streak. A yellow streak seems to indicate a faster, more aggressive hit, and a pink streak means “you’ll be damn lucky to hit this.” Without a tutorial, I have no idea how to trigger a non-standard hit. When my opponent sends a wobbly, high-in-the-air lob at me, perfect for a pink-streaked volley, no matter how hard I swing the controller or time when I hit the projectile, it’s completely random the kind of hit I get. The games are still fun, but I wish I could have had more strategy to play them than “swing your arm and pray.”</p><p id=\"eGr988\"><em>Nintendo Switch Sports</em> feels like it’s come a bit too late. <em>Wii Sports</em> was a launch title and solidified that the Wii was <em>the</em> motion control console. And while the Switch has some of that DNA, it feels like games designed to take advantage of that control scheme are afterthoughts. I enjoyed <em>Nintendo Switch Sports</em> — it’s a neat little game that’ll be a hit with kids, but it feels like something designed to remind people the Switch has motion controls that are actually pretty good.</p><p id=\"GaIkqW\"><em>Wii Sports </em>was critical to the Wii’s massive success. While I don’t think <em>Nintendo Switch Sports</em> will have the same impact on the Switch, I know it will come in handy for a party.</p><p id=\"yEfITr\"></p><p id=\"DRhXjr\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/X8Le8soWxbUU4gbZh2Eh9FpWl0M=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23419987/chambara.png",
  "description": "Time to dig out those Joy-Con straps — you’ll need them.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}