{
  "title": "Nomad’s Base One Max adds an Apple Watch stand to its fancy MagSafe wireless charging pad",
  "url": "https://www.theverge.com/2022/4/12/23020947/nomad-base-one-max-magsafe-wireless-charger-apple-watch-price-specs-features",
  "date": "2022-04-12T16:00:00.000Z",
  "author": "Dan Seifert",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ka7WlQulVlocyjfVs-yi0Sfet3c=/0x72:4990x3399/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740295/856500011745_03.0.jpg\" />        <figcaption><em>Nomad’s Base One Max is better-looking than most wireless chargers.</em> | Image: Nomad</figcaption>    </figure>  <p id=\"vMBUTu\">Nomad is expanding the range of its MagSafe charging accessories with the new Base One Max. The Max follows the <a href=\"https://www.theverge.com/2022/3/1/22937394/nomad-magsafe-charger-base-one-price-mfi-iphone\">Base One from March</a> and adds an Apple Watch charger to the heavily weighted MagSafe pad. It retails for a similarly heavy $149.95 and is <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://nomadgoods.com/products/base-one-max-silver\" rel=\"sponsored nofollow noopener\" target=\"_blank\">available to purchase starting on April 12th</a>.</p><p id=\"kRhSb8\">The Base One Max effectively looks like what happens when you double the width of the Base One and add an integrated Apple Watch charger. Unlike the MagSafe section, which remains flat, the Apple Watch charger sits vertically so your Watch can display its nightstand mode and show the time. Made out of aluminum, glass, and soft-touch rubber, the Base One Max weighs a beefy 900 grams (just under two pounds).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8PvUfIpwF-awCsC3TbmiMo50pcE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382951/856500011516_01.jpg\">      <cite>Image: Nomad</cite>      <figcaption><em>The upright position of the Apple Watch charger supports the nightstand mode to view the time, date, and upcoming alarms.</em></figcaption>  </figure><p id=\"KrMNMk\">There’s one USB-C port on the back of the Base One Max, and a six-foot braided USB-C cable comes with the unit. But you’re on your own for a charging brick. And, if you want the fastest charging speeds, Nomad recommends using a charger with at least 30W of power. That’ll let your iPhone charge at the full 15W MagSafe charging speeds. The Apple Watch charger does not support fast charging on a Series 7 Watch, however.</p><p id=\"g1BO7g\">Unlike Nomad’s <a href=\"https://www.theverge.com/2021/12/14/22833200/nomad-base-station-magnet-edition-wireless-charger-price-features\">other multi-device chargers</a>, the Base One Max is only going to charge one iPhone and one Apple Watch. There are no extra ports on the back to plug in other devices. That said, it is much nicer looking than most multi-device chargers, and its hefty weight lends an air of perceived value while also providing a stable base to plop your phone at the end of the day.</p><p id=\"vNCqu4\">Nomad is offering the Base One Max in either silver or black color options.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7vTmw9deI5ciMIQ6VyPy_eOHQ88=/0x429:4990x3042/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382947/856500011745_03.jpg",
  "description": "Just $75 per charger.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}