{
  "title": "Nope’s first trailer is a hard yes",
  "url": "https://www.theverge.com/2022/2/13/22929576/nope-superbowl-trailer-jordan-peele",
  "date": "2022-02-13T12:17:13.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5hruZFa8YgDWBIKlcamSi3dh0vI=/385x0:2170x1190/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70503836/Screen_Shot_2022_02_11_at_2.34.04_PM.0.png\" />        <figcaption>Universal Pictures</figcaption>    </figure>  <p id=\"48GvhK\">Universal’s <a href=\"https://www.theverge.com/2021/7/22/22588907/jordan-peele-nope-movie-poster-daniel-kaluya-steve-yeun-keke-palmer\"><em>Nope</em></a><em> </em>from director Jordan Peele is one of the rare modern movies with this much hype around it to make it this close to its release date without the public knowing basically anything about it. </p><p id=\"xtUUQC\">Building up that sort of suspense is a huge gamble on the studio’s part that could go either way, but <em>Nope</em>’s first trailer certainly creates the impression that Peele’s gone and done it again — “it” here meaning “dreamed up something terrible and turned it into a work of art we’re all going to become obsessed with.”</p><p id=\"CwHJzG\"><em>Nope</em>’s first trailer introduces Daniel Kaluuya and Keke Palmer’s two cattle ranching characters who spend their days working with horses on farms while dreaming of making it big as professional horse handlers for film productions. Just when it seems as if the pair might be on the verge of a big break, a strange atmospheric anomaly touches down that starts to spook the local animals, and at least some of the humans begin to think of the thing as a “bad miracle.” The <em>briefest</em> of shots of what appears to be a UFO of some sort may point to <em>Nope </em>being a film about aliens making contact with Earth, but it’s just as possible that the story could just be about a bunch of people truly being terrorized by a killer cloud that horses want no business with.</p><p id=\"zyeRhR\"><em>Nope </em>also stars Steven Yeun, Barbie Ferreira, Brandon Perea, and Michael Wincott. It hits theaters on July 22nd.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jIeZhcWcwSwp8oQpKQL4aAl1IHE=/141x0:2414x1190/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23235934/Screen_Shot_2022_02_11_at_2.34.04_PM.png",
  "description": "In first trailer, Jordan Peele’s Nope reveals some of its plot.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}