{
  "title": "Nothing’s first smartphone is aimed at Apple, not OnePlus",
  "url": "https://www.theverge.com/2022/3/23/22992424/nothing-phone-1-smartphone-carl-pei-apple-ecosystem",
  "date": "2022-03-23T14:28:50.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2H6Uuq0dtsDrpmXgY4d2kZ4afgs=/0x0:1620x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70661424/Home_Screen___First_Iteration__not_final_.6.jpg\" />        <figcaption><em>The Nothing OS home screen.</em> | Image: Nothing</figcaption>    </figure>  <p>Carl Pei wants to take on Apple’s walled garden this summer</p> <p class=\"p--has-dropcap\" id=\"22kAKb\">Nothing will launch its debut smartphone this summer, its CEO and former OnePlus co-founder Carl Pei announced today during a live stream. It’ll be called the Phone 1, run Android, and be powered by a Qualcomm Snapdragon processor. And yes, it was this phone that Carl Pei was <a href=\"https://www.theverge.com/tldr/2022/3/7/22965385/nothing-ceo-smartphone-leaks-qualcomm-pei-amon\">photographed showing Qualcomm CEO Cristiano Amon</a> — albeit wrapped in a privacy-protecting case.</p><p id=\"rOFRpn\">The Phone 1 will be the company’s second product following the release of its <a href=\"https://www.theverge.com/22598920/nothing-ear-1-earbuds-review-features-specs\">Ear 1 true wireless earbuds</a> last year. A short teaser trailer released today suggests that the phone could have a series of light strips built into its back, while a <a href=\"https://www.theverge.com/2022/3/2/22958333/carl-pei-nothing-oneplus-android-smartphone-launch\">previous report claimed</a> it could feature transparent design elements like the company’s earbuds.</p><div id=\"cdfOzi\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You’ve speculated, and now you know.<br><br>Nothing phone (1) is officially coming.<br><br>It’s unlike anything else.<br><br>Summer 2022.<br><br>Sign up for the latest updates on <a href=\"https://t.co/pLWW07l8G7\">https://t.co/pLWW07l8G7</a>. <a href=\"https://t.co/Lo4UPkk7MT\">pic.twitter.com/Lo4UPkk7MT</a></p>— Nothing (@nothing) <a href=\"https://twitter.com/nothing/status/1506638947555979272?ref_src=twsrc%5Etfw\">March 23, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"vF839e\">But Nothing isn’t ready to talk specs or price. During an interview with <em>The Verge</em> ahead of today’s event, Pei was even coy about what function these light strips could serve in the final device. Could we be looking at a new take on the notification light, which was once a standard issue across numerous Blackberry and Android phones, <a href=\"https://www.theverge.com/2018/3/28/17152840/oneplus-6-notch-size-android-flagship\">including some from OnePlus</a>?</p><p id=\"yEBR4i\">“Maybe,” Pei teases with a grin.</p><p id=\"tSvhBY\">But when it comes to software, the CEO is more forthcoming. Today, Nothing is releasing a series of images of Nothing OS, the Android skin it plans to ship on the Phone 1. The images don’t reveal much about what the software might be able to do, but Pei is keen to emphasize its look, which very consciously lines up with the rest of Nothing’s branding. The interface is a sea of black, white, and red that leans heavily on the dotted font that Nothing uses for its logo.</p><p id=\"rlUXf1\">Pei’s also very into the sound of the phone, an area he thinks is often overlooked. “Our sound design is really cool,” he says, “so definitely check that out.” </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8iWzy7xAqWUaj376g0lnvJ5EoEY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339140/Widgets___First_Iteration__not_final_.jpg\">      <cite>Image: Nothing</cite>      <figcaption><em>Nothing OS home screen and widgets.</em></figcaption>  </figure></div><p id=\"II9u6V\">“A lot of organizations have big silos between different teams,” Pei says, explaining how the product team will often work separately from the design team, who’ll be separate from the software and marketing teams. Nothing, he says, wants to offer a “singular vision” across its devices, which seems like it could be a challenge when the startup already has design teams working in the UK, Sweden, and China.</p><p id=\"cCnjzJ\">Nothing’s press release says the Phone 1’s Nothing OS will distill Android to “just the essentials, where every byte has a purpose.” However, don’t expect the phone to evoke the ghost of the <a href=\"https://www.theverge.com/2017/8/18/16165040/essential-phone-review-android-andy-rubin\">Essential Phone</a>, even though Nothing <a href=\"https://www.theverge.com/2021/2/15/22284363/nothing-company-essential-brand-acquisition-news\">acquired the rights to the brand</a> early last year. Pei tells me the acquisition was just about acquiring its trademarks back when “Nothing” could have been called “Essential.” In the end, though, “we decided Nothing was probably better,” Pei says (cue the “better than Nothing” jokes). </p><div class=\"c-float-left c-float-hang\"><aside id=\"JIrHIZ\"><q>Don’t expect to see any Essential Phone DNA</q></aside></div><p id=\"61Q19L\">Nothing’s aim, Pei says, is to create products with a singularly focused design language across everything from hardware to software so that there could never be any confusion about them coming from another company. It’s a tall order in a world of increasingly indistinguishable smartphones. Pei cites Dyson’s designs as having the kind of individuality he’d like Nothing to emulate — it’s no coincidence that Dyson’s former design head, Adam Bates, recently joined Nothing to serve as its design director. </p><p id=\"PgT3tO\">“Because [Adam Bates] had a very senior role at Dyson, he’s able to bring a lot of his old team with him,” Pei tells me. “So we probably have one of the best industrial design teams in the world.” Bates is working alongside Teenage Engineering’s Jesper Kouthoofd and Tom Howard, who are focused on the high-level direction of Nothing’s design. </p><p id=\"cZqx1i\">While the look of the Phone 1’s Nothing OS is clearly a priority, what’s more important to the company is what the device represents: a crucial step in Nothing’s attempt to build out an ecosystem of interconnected devices. The strategy isn’t new — Pei talked about it <a href=\"https://www.theverge.com/2021/1/27/22250653/nothing-brand-oneplus-carl-pei-announcement-consumer-technology-smart-devices\">when launching the company last year</a> — but with the unveiling of the smartphone, the ecosystem now has a central device to anchor itself to.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UBz2L7ebTdJkiI6amucyncRg2Sk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339141/Lock_Screen___First_Iteration__not_final_.jpg\">      <cite>Image: Nothing</cite>      <figcaption><em>Nothing OS lock screen.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oVx7Eq5kvR-CQ1xqjyYnfslM7JI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339144/Always_on_Display___First_Iteration__not_final_.jpg\">      <cite>Image: Nothing</cite>      <figcaption><em>The always-on display.</em></figcaption>  </figure></div></div></div><p id=\"fE5KAs\">The aim here is less about competing with other Android phones like those Pei launched when he was part of OnePlus. Instead, his desire is to compete with Apple and the broad ecosystem often referred to as its “<a href=\"https://www.theverge.com/2020/8/11/21362820/apples-big-sur-news-xcloud-walled-garden\">walled garden.</a>” Pei specifically cites Apple’s <a href=\"https://www.theverge.com/2022/3/16/22980566/universal-control-ios-macos-mac-ipad-hands-on\">impressive</a> Universal Control as the kind of feature he’d like to see Nothing’s products eventually be capable of, referencing the WWDC 2021 keynote in which Apple <a href=\"https://www.theverge.com/2021/6/7/22523322/apple-wwdc-impressive-drag-and-drop-universal-control-demo\">demonstrated dragging and dropping a photo</a> from an iPad onto an iMac using a third, separate, MacBook — all completely wirelessly and without any prior configuration.</p><p id=\"hQrs08\">Similar to Apple, whose ecosystem mixes first-party devices like phones, laptops, and true wireless earbuds with third-party products via platforms like HomeKit, Nothing plans to produce some of these devices itself while relying on integrations with partners to bulk out its ecosystem. So, Nothing wants its phone to seamlessly control its Nothing-branded earbuds while also being able to control other products like a Tesla car or Apple’s AirPods. </p><div class=\"c-float-right c-float-hang\"><aside id=\"SyzrMx\"><q>An Apple alternative</q></aside></div><p id=\"Vja13n\">Competing with an ecosystem from a company worth more than $2 trillion, though, won’t be easy. For starters, Nothing doesn’t own nearly as much of its own technology stack as Apple. A feature like Universal Control is tricky enough for a company that controls all the pieces to pull off, let alone a startup like Nothing that’s building on top of another company’s operating system.</p><p id=\"1r3fWO\">Pei doesn’t have a clear answer for me about how Nothing plans to pull these sorts of ecosystem integrations off, but he thinks the company has something to lure other companies in.</p><p id=\"QPsAmK\">“I think we have a much easier time convincing partners because we help them do a lot of the work that they can’t do themselves,” Pei says. In effect, he sees Nothing as one day acting almost as external consumer tech consultants to companies looking to launch new products, helping out with everything from design to supply chains and engineering. “This is an end-to-end capability that we’re infusing our partners with.” </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/j2XvtBj7IRt09aXZfAKMAmA1Jck=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339138/Carl_Pei_CEO_and_Co_founder_2022.jpeg\">      <cite>Image: Nothing</cite>      <figcaption><em>Nothing CEO Carl Pei.</em></figcaption>  </figure></div><p id=\"ChpDIy\">The CEO stops short of saying Nothing will produce white-label products for other companies to sell (“I think we’re going to be very adamant about equity ownership,” he says when I ask). But if, say, a legacy sports brand wanted to get into releasing wearables, then Pei wants Nothing to be the company they could turn to for help. It sounds a lot like the approach that <a href=\"https://hbr.org/2021/09/how-xiaomi-redefined-what-it-means-to-be-a-platform\">Chinese tech giant Xiaomi has pioneered</a>, which has seen it blend elements of corporate venture capital investing with an ecosystem approach to growing its formidable company.</p><p id=\"pnK0gQ\">Controlling an entire ecosystem can have its downsides, like the consumer lock-in that comes with Apple’s infamous walled garden. One of the nice things about a company that only produces headphones is that it’s motivated to make its accessories work with everything. But that can change if you suddenly start producing both phones and earbuds. “[Nothing earbuds] will work better with the Nothing smartphone because it’s integrated on the system level and not just the app level,” Pei tells me.</p><p class=\"c-end-para\" id=\"02gVad\">Launching a smartphone is one thing, but attempting to build an entire tech ecosystem to compete with the likes of Apple is an even taller order for a company that’s only released one product so far — especially when that product, the Ear 1 earbuds, had some rough edges at launch. But although Pei has big ambitions for Nothing, in the more immediate future, he says the company is taking things one step at a time. That means the next step is the most important one of all: actually launching the Phone 1.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FdXsWKUdJ2MaxCaeazp_1g8LJNQ=/0x116:1620x964/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23339142/Home_Screen___First_Iteration__not_final_.jpg",
  "description": "It plans to launch the Phone 1 this summer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}