{
  "title": "Now non-Tesla EVs can use its Superchargers in the UK, Spain, Sweden, and Austria",
  "url": "https://www.theverge.com/2022/5/18/23125391/tesla-supercharger-electric-vehicle-charging-pilot-expansion-uk-spain",
  "date": "2022-05-18T22:45:40.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"Electrc car charging - London\" src=\"https://cdn.vox-cdn.com/thumbor/QdveJCh7D896P4ng5n8dXIi3qts=/0x0:7087x4725/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70885445/1239009221.0.jpg\" />        <figcaption>Photo by John Walton/PA Images via Getty Images</figcaption>    </figure>  <p id=\"PAo9oe\">Tesla is expanding its open Supercharger pilot program in Europe that lets owners of non-Tesla EVs take advantage of the company’s extensive charging network. Previously, the pilot consisted of <a href=\"https://www.theverge.com/2021/11/1/22757159/tesla-supercharge-ev-pilot-netherlands\">select stations in The Netherlands</a>, Norway, and France, but now it’s also available in the UK, Spain, Sweden, Belgium, and Austria.</p><p id=\"JSt8Ge\">Non-Tesla owners in both Belgium and Germany originally could only take advantage of Tesla’s network if traveling to a country that has the open Superchargers. With Belgium now added to the program, German residents remain the only oddity that can use them outside of its borders, but not domestically.</p><div id=\"p2DlZM\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Non-Tesla vehicles can now charge at select Superchargers in Austria, Belgium, Spain, Sweden and the UK via the Tesla app.  Learn more at <a href=\"https://t.co/HZePe24Kbl\">https://t.co/HZePe24Kbl</a></p>— Tesla Charging (@TeslaCharging) <a href=\"https://twitter.com/TeslaCharging/status/1526911776280952833?ref_src=twsrc%5Etfw\">May 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"2lfogl\">Elon Musk has been talking about extending the program to the US <a href=\"https://www.theverge.com/2021/7/28/22596337/tesla-supercharger-elon-musk-open-network-charging-stations\">since last year</a> but didn’t provide any specifics on how it will be implemented due to the prominence of Tesla’s proprietary chart port used in North America. But <a href=\"https://www.youtube.com/watch?v=VfyrQVhfGZc\">in an interview with <em>Financial Times</em> last week</a><em>, </em>Musk said that <a href=\"https://www.teslarati.com/tesla-to-add-ccs-connectors-to-us-superchargers/\">Tesla is planning to add standardized connectors</a> for other EVs to US Supercharger stations. </p><p id=\"ck6Fe4\">Right now, North American Tesla models and Superchargers don’t use the CCS2 standard that largely all EVs in Europe (including Teslas) support, relying instead on Tesla’s proprietary charging plug. To make matters worse, other North American EVs are mostly equipped with a CCS1 connector, and EVs like the Nissan Leaf complicate things further by relying on the CHAdeMO standard.</p><p id=\"1HmuO8\">If you’re living in one of the pilot countries, you can take advantage of the Tesla network and find participating stations by using the Tesla app. If you own both a Tesla and another EV, you can monitor Supercharging for both vehicles in the app. Non-Tesla vehicles might incur additional fees on top of the electricity rates that are shared in the app.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-StOudSFHe6Ka-o655CPEIa3nqI=/0x508:7087x4218/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23545538/1239009221.jpg",
  "description": "More Tesla European Superchargers open to more EVs",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}