{
  "title": "Now Apple’s iPhone car key will unlock certain 2022 Genesis and Kia models",
  "url": "https://www.theverge.com/2022/3/23/22993073/apple-digital-car-keys-hyundai-kia-genesis-gv60-g90-niro",
  "date": "2022-03-23T19:12:54.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"SKOREA-AUTO-ELECTRIC-GENESIS\" src=\"https://cdn.vox-cdn.com/thumbor/cx4fvg4ohu9cTL3YsM0VhOXGM9Y=/68x0:4549x2987/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70662962/1235636035.0.jpg\" />        <figcaption>Photo by JUNG YEON-JE/AFP via Getty Images</figcaption>    </figure>  <p id=\"UOQPAM\">Apple’s digital car keys are arriving on the 2022 Kia Niro, 2022 Genesis 690, and the all-electric 2022 Genesis GV60. As spotted by <a href=\"https://www.macrumors.com/2022/03/23/iphone-car-key-feature-2022-genesis-kia/\"><em>MacRumors</em></a>, Apple added a key symbol next to all three vehicles <a href=\"https://www.apple.com/ios/carplay/available-models/\">in a list on its site</a>, indicating support for the feature.</p><p id=\"e8bOI4\">It’s not clear when Apple first updated the list or if the feature is immediately available on any of these cars. There hasn’t been an official announcement from Apple or either car company yet, so there may be more steps involved in the rollout. Kia and Genesis have reportedly been working to integrate Apple’s digital car keys <a href=\"http://www.businesskorea.co.kr/news/articleView.html?idxno=58446\">since</a> <a href=\"https://www.macrumors.com/2021/09/21/genesis-digital-car-keys-code/\">last year</a>. Samsung has also announced a partnership with Genesis (along with Audi, Ford, and BMW) to create a phone-based digital car key of its own.</p><p id=\"ihOCIh\">A Kia spokesperson told <em>MacRumors</em> that the company will have “more information” about digital keys “in the coming weeks.” Apple and Genesis didn’t immediately respond to <em>The Verge</em>’s request for comment, while Kia declined to comment.</p><p id=\"jeCtRw\"><a href=\"https://www.theverge.com/2020/6/22/21299182/apple-carkey-ios-14-13-digital-key-unlock-car-iphone-wwdc-2020\">BMW was previously the only carmaker</a> to support Apple’s digital car keys, which let users lock or unlock their cars by holding their Apple Watch or iPhone near the car’s door handles or when in close proximity to the car. The availability of either feature depends on whether the car supports NFC or the <a href=\"https://www.theverge.com/2021/1/14/22230569/bmw-digital-key-plus-iphone-unlock-u1-chip-ultra-wideband\">iPhone’s ultra wideband (UWB) tech</a> available in the iPhone 11 and later, which makes it possible to lock and unlock a car with your phone in your pocket or purse. Users can also use digital keys to lock, unlock, or start their cars remotely (if supported by the vehicle).</p><p id=\"jk0COX\">Apple’s digital car keys are part of the company’s broader push to minimize the number of items you carry around in your pockets or purse. Today, Apple announced that <a href=\"https://www.theverge.com/2022/3/23/22992745/apple-wallet-license-arizona-colorado-hawaii-real-id\">users in Arizona can use their Wallet</a> to carry their driver’s license or state ID and has plans to expand this feature to a number of other states in the near future. Apple also lets users staying in select Hyatt hotels <a href=\"https://www.theverge.com/2021/12/8/22824367/apple-wallet-hyatt-hotel-key\">unlock their rooms with a digitally-stored key</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AnXEr403wcczE6Y8R2FG1BrAqbs=/0x286:4616x2703/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340028/1235636035.jpg",
  "description": "Apple’s digital car keys expand beyond BMW.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}