{
  "title": "Now that Disney Plus is trying ads, how long until the rest of the streamers do, too?",
  "url": "https://www.theverge.com/2022/3/9/22967831/disney-plus-ads-hbo-max-hulu-streaming",
  "date": "2022-03-09T11:00:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/roSSy_MSdjqMOW-lMTknzNU0Vvk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70597874/acastro_190411_1777_Disney_Streaming_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Eh4Z9N\">Disney Plus’ big ad experiment will arrive on the service later this year, meaning that users will have the option of sitting through advertisements in exchange for a slightly cheaper plan. On the one hand, that’s great news for streamers on a budget. Ad-supported plans give consumers a lot of flexibility to sign up for pricey services they may otherwise pass over. But it’s also a nice little workaround for boosting subscribers fast — something services are keenly aware of as they fight for our attention and our money.</p><p id=\"TMLa3j\">“We’re seeing an evolution of the market away from the monolithic business models of old,” Paul Erickson of research firm Parks Associates tells <em>The Verge</em>. “A lot of the players in the market, they’re not going to just operate on SVOD basis. They’re going to mix a little bit.”</p><p id=\"mKB8P2\">We don’t know a lot yet about what <a href=\"https://www.theverge.com/2022/3/4/22961433/disney-plus-subscription-ad-tier-price\">Disney Plus’ ad plan</a> will look like. Pricing hasn’t been announced, and it isn’t clear whether the new ad-supported tier will mirror the ad experience of sister service Hulu or look closer to those of HBO Max or Peacock, which offer discounted ad plans that limit access to some content. </p><p id=\"6sHk2G\">What we do know is that Disney believes that the new tier — which is expected in late 2022 — will help the service reach between 230 million and 260 million subscribers by 2024. That’s Netflix-level subscriber numbers (the streaming giant most recently reported having nearly 222 million active users). And speaking during Morgan Stanley’s Technology, Media and Telecom Conference this week, senior executive vice president and CFO of The Walt Disney Company, Christine McCarthy, said the company views the ad plan as being “a win-win for the consumers who want it, the consumers who couldn’t afford [Disney Plus] otherwise.” </p><div class=\"c-float-right\"><aside id=\"8PCAcR\"><q>“It will be a different ad-supported platform than a lot of others out there...”</q></aside></div><p id=\"EWt7KQ\">Ads are not new for Disney as a company. Disney’s subsidiary Hulu knocks $6 of its ad-free plan (normally $13) if you don’t mind sitting through a handful of commercials during your streams. Disney’s sports service ESPN Plus <a href=\"https://www.theverge.com/2019/10/25/20929372/espn-plus-pre-roll-advertising-app-bugs-crashes-subscribers\">also serves up ads</a>. But while Hulu — Disney’s “grown-up” streaming service — has some flexibility with the kinds of ads it can run against <em>The Handmaid’s Tale</em> or <em>Archer</em>, Disney knows it needs to be extraordinarily picky about the types of advertising it’s throwing on its kids and family service.</p><p id=\"Evtai9\">“It is a family audience,” McCarthy said. “We will be very careful about the ads we take, how we put them into our content.”</p><p id=\"YCf3Nf\">How and when ads will appear as part of the viewing experience is also something Disney is thinking about. McCarthy noted that linear programming like TV shows often lends itself to natural breaks, but movies can be a little trickier. But McCarthy claims the ad experience won’t be “jarring and off-topic or off-brand.” </p><p id=\"oiA4Lg\">“We’re going to be very, very mindful of this, and it will be a different ad-supported platform than a lot of others out there just because the nature of the service we’re providing is a family-oriented one,” McCarthy said.</p><p id=\"2Sbe0R\">Disney does also have its image to keep in mind. When HBO Max announced its <a href=\"https://www.theverge.com/2021/5/19/22444063/hbo-max-ad-supported-tier-announced-pricing-release-date\">ad-support tier</a> last year, there was some question about whether ads would cheapen the prestige of legacy HBO. Erickson doesn’t think this is going to be a problem for Disney. Instead, ads should make Disney Plus more accessible to a wider number of households. It’s reasonable to expect that Disney Plus, which launched in 2019 at $7 per month and now costs $8 per month, will only continue to crank up its monthly cost. The ad tier is a counterbalance to the impact that’s going to have on subscribers’ wallets (because every other service is jacking up their prices, too).</p><div class=\"c-float-right\"><aside id=\"Rl8LaM\"><q>“We’ll probably see a few other players ... hybridize their business model as well.”</q></aside></div><p id=\"AesIDz\">“In the end, they’re reaching further and deeper into society than they were able to before,” Erickson says. And Disney would sure <em>like</em> to be in every household — company boss Bob Chapek has harped on Disney Plus’ appeal to even <a href=\"https://www.reuters.com/article/us-walt-disney-streaming/disney-ceo-says-households-without-kids-have-boosted-streaming-success-idUSKCN2AU02Z\">households without kids</a>. </p><p id=\"Tnl457\">Already, Disney is one of the largest streaming services in the US. But seeing that two leading services, HBO Max and Disney Plus, launched without ads and are now leaning on advertising-based streaming to help grow their numbers signals a bit of a shift in the premium service space. Erickson says it’s possible we’re going to see more streamers shift to this model as well. (Many recently launched services, like Peacock and Paramount Plus, baked ad tiers into their plans straight out of the gate.) </p><p id=\"ZeUNYW\">“Maybe not Netflix because they’ve got such a strong market position. But we’ll probably see a few other players — the big ones that as of yet have not done so — hybridize their business model as well. It’s a natural trend in the market,” Erickson says.</p><p id=\"TBfrRn\">For a long time, ads felt like a lazy carry-over from the cable days. But with a veritable buffet of streaming options available, ad-supported tiers can help consumers avoid having to choose between so many of them. And even if Netflix is <a href=\"https://twitter.com/JBFlint/status/1501284099364773889\">still on the fence</a> about slapping ads on its content anytime soon, other streamers are aware there’s a huge market for viewers who are willing to sit through a couple of minutes of chatter if it means their streaming bill goes down by a few bucks every month. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dz43oalHs8lNQDYohzQFdRKz_VE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16025344/acastro_190411_1777_Disney_Streaming_0001.0.jpg",
  "description": "Disney Plus gets a cheaper ad-supported tier later this year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}