{
  "title": "Number go down",
  "url": "https://www.theverge.com/2022/5/9/23064269/bitcoin-sell-plunge-crypto",
  "date": "2022-05-09T22:06:18.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Fn4mDKoLchIIxoJTnDVhV8EurGE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70850137/acastro_181126_1777_bitcoin_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"beHZd3\">People will say all kinds of things about what Bitcoin is: digital gold, the successor to the dollar as a reserve currency, the future of money, whatever. The thing about Bitcoin, though, is that it’s volatile — and thus, risky. And right now, the market is feeling risk-averse. Bitcoin’s price in dollars has fallen by more than a third since January 1st.</p><p id=\"HwTtY0\">A drop this dramatic doesn’t have just one cause, though it probably didn’t help that we’ve been exiting zero interest rate policy (ZIRP). For a while, the US central bank had set interest rates quite close to zero in order to stimulate the economy. In that environment, it doesn’t make sense to keep money in your savings account — your savings won’t earn enough interest to keep up with inflation. Less-risky assets — bonds, treasury bills — look unattractive.</p><div class=\"c-float-right\"><aside id=\"jS5pCy\"><q>If they’re de-risking their portfolio, they’re selling Bitcoin</q></aside></div><p id=\"OifPJo\">So people begin to do weird things: <a href=\"https://www.theverge.com/21502700/spac-explained-meaning-special-purpose-acquisition-company\">SPACs</a>,<a href=\"https://www.theverge.com/22251427/reddit-gamestop-stock-short-wallstreetbets-robinhood-wall-street\"> meme stocks</a>, <a href=\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\">NFTs</a>. Why not? There’s so much money sloshing around, and risky assets have higher rates of returns. Besides, some people think risk is fun! That’s the entire point of the gambling industry, after all.</p><p id=\"T9hii7\">But the ZIRP world came to an end. Last week, the Fed <a href=\"https://www.cnbc.com/2022/05/04/fed-raises-rates-by-half-a-percentage-point-the-biggest-hike-in-two-decades-to-fight-inflation.html\">increased interest rates by half a percentage point</a>, the biggest since 2000, and indicated that it wasn’t done with rate hikes. Some other weird stuff has happened — Russia’s invasion of Ukraine, for instance — that has generally sobered up the markets, too. And so, though Bitcoin is supposed to be independent of the Fed, investors generally aren’t. If they’re de-risking their portfolio, they’re selling Bitcoin.</p><p id=\"dyatfV\">And investors are <em>definitely</em> selling. “About $475 million in long Bitcoin positions were liquidated over a 24-hours period, according to <a href=\"https://www.coinglass.com/LiquidationData\">data</a> from Coinglass,” <a href=\"https://www.bloomberg.com/news/articles/2022-05-06/bitcoin-testing-of-lows-has-traders-wary-of-break-below-32-000?srnd=cryptocurrencies-v2&amp;sref=M8H6LjUF\"><em>Bloomberg</em> noted</a>.</p><p id=\"8NpyYh\">It’s not just Bitcoin. Ethereum’s price has also dropped by a third this year. An algorithmic stablecoin called Terra, which is supposed to be fixed at $1, broke its peg twice since Saturday and is, as of this writing, <a href=\"https://coinmarketcap.com/currencies/terrausd/\">trading at 93 cents</a>. An entry-level Bored Ape Yacht Club NFT has <a href=\"https://decrypt.co/99822/bored-ape-yacht-club-ethereum-nft-prices-plummet-crypto-market-crashes\">fallen 55 percent in just 10 days</a>, <em>Decrypt</em> points out. This kind of chaos is hard for retail investors to ride out.</p><p id=\"kHzz2s\">Unlike regular assets, crypto markets never close. If there’s a run on stocks, the end of a trading day or a weekend can give investors enough breathing room to re-assess their strategy rather than just panic selling. But this is cryptocurrency, where you can get rekt while you sleep. Good luck out there! You’ll need it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/altkKN7BnaLUpbAVPi6j4xmC2Ug=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13546110/acastro_181126_1777_bitcoin_0001.jpg",
  "description": "Bitcoin is getting rekt.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}