{
  "title": "Nvidia says its ‘proprietary information’ is being leaked by hackers",
  "url": "https://www.theverge.com/2022/3/1/22957212/nvidia-confirms-hack-proprietary-information-lapsus",
  "date": "2022-03-02T01:53:55.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"Nvidia Acquisition ARM Failed\" src=\"https://cdn.vox-cdn.com/thumbor/T8IXbyMexL_a-XXOVLHw4PJjsgE=/0x2:3680x2455/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70567840/1238281392.0.jpg\" />        <figcaption><em>The company confirms it was hacked.</em> | Photo credit should read Costfoto/Future Publishing via Getty Images</figcaption>    </figure>  <p id=\"7w8mub\">Nvidia has confirmed that it was hacked — and that the actor behind <a href=\"https://www.theverge.com/2022/2/25/22951376/nvidia-incident-alleged-cyberattack-february-2022\">last week’s “incident”</a> is leaking employee credentials and proprietary information onto the internet. In a statement to <a href=\"https://www.pcmag.com/news/nvidia-confirms-company-data-was-stolen-in-hack\"><em>PCMag</em></a>, <a href=\"https://www.bloomberg.com/news/articles/2022-03-01/nvidia-says-hackers-stole-data-from-network-and-posted-it-online\"><em>Bloomberg</em></a>, and <a href=\"https://videocardz.com/newz/nvidia-confirms-their-systems-were-compromised-but-no-business-disruptions-are-anticipated\"><em>VideoCardz</em></a>, the company says it became aware of the breach on February 23rd, and that it does “not anticipate any disruption to [its] business or our ability to serve our customers as a result of the incident.”</p><p id=\"kdc0tC\">Hacking group Lapsus$ has claimed responsibility for the attack, and has demanded that Nvidia make its drivers open-source if it doesn’t want more data leaked. Nvidia hasn’t necessarily agreed to those demands; the company says it’s made improvements to its security, notified law enforcement, and is working with cybersecurity experts to respond to the attack.</p><div class=\"c-float-right\"><aside id=\"c8yZBB\"><q>“We request that NVIDIA commits to COMPLETELY OPEN-SOURCE (and distribute under a foss license) their GPU drivers”</q></aside></div><p id=\"skOe0B\">Lapsus$ claims to have around a terabyte of data from Nvidia, <a href=\"https://www.pcmag.com/news/nvidia-confirms-company-data-was-stolen-in-hack\">according to <em>PCMag</em></a>. In a message seen by <em>The Verge</em>, the hackers say the hardware folder alone is 250GB, and contains information on “all recent Nvidia GPUs” including <a href=\"https://www.theverge.com/2022/2/14/22932832/nvidia-rtx-3090-ti-delay-issues\">the mysterious RTX 3090 Ti</a>. In an earlier message, the group threatened to leak the files if Nvidia doesn’t remove the limitations on its recent graphics cards that are <a href=\"https://www.theverge.com/2021/5/18/22441847/nvidia-rtx-3080-3070-ethereum-mining-drivers-limit-cryptocurrency\">meant to make them less appealing to cryptominers</a>. Lapsus$ updated its demands today, adding the condition that Nvidia permanently make its GPU drivers completely open-source, and said that the company had until Friday to make a decision.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZoCCGkrSGZBzi5QtIJjklMyfsYI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23281306/image.png\">      <figcaption><em>A message from the hacking group, updating its demands to Nvidia.</em></figcaption>  </figure><p id=\"rzqnC1\">After Nvidia confirmed it was looking into an incident, there was speculation that ransomware was involved, and that the attack could be linked to <a href=\"https://www.theverge.com/2022/2/28/22954857/russia-invades-ukraine-news-updates\">the conflict between Russia and Ukraine</a>. However, Nvidia says there’s no evidence that either of those things are  true. </p><p id=\"A81kaS\">Toby Lewis, Head of Threat Analysis at dark web intelligence firm Darktrace, told <em>The Verge</em> that the alleged hacking group’s “previous targets and near-native use of Spanish and Portuguese in previous ransom notes suggest that [it] operates out of South America.” He also said that the group is “highly secretive,” and that its attack on Nvidia seems to be it taking advantage of the confusion caused by everything going on, rather than it being motivated by connections to the Russian government. </p><p id=\"hm7dhg\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6oz5QadR_tKaRA16hQ65nDbB63I=/0x265:3680x2192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23281179/1238281392.jpg",
  "description": "Supposed hackers demand removal of cryptomining limits",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}