{
  "title": "Nvidia pays $5.5 million for allegedly hiding how many gaming GPUs were sold to crypto miners",
  "url": "https://www.theverge.com/2022/5/6/23059930/nvidia-sec-charges-fine-settlement-gaming-gpu-crypto-mining",
  "date": "2022-05-06T15:21:50.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/t6urDITOPhSkmh9oLJ9TnQQ0gsI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70839969/acastro_180529_1777_nvidia_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"NsWdy0\">Nvidia will pay $5.5 million to settle charges that it unlawfully obscured how many of its graphics cards were sold to cryptocurrency miners. The US Securities and Exchange Commission <a href=\"https://www.sec.gov/news/press-release/2022-79-0\">announced the charges and a settlement</a> with the company today. <a href=\"https://www.sec.gov/litigation/admin/2022/33-11060.pdf\">Its order claims</a> Nvidia misled investors by reporting a huge boost in revenue related to “gaming,” hiding how much its success relied on the far more volatile crypto market. Nvidia isn’t admitting to wrongdoing as part of the settlement, but it agrees to stop any unlawful failures to disclose information.</p><p id=\"I4YnTf\">The charges stem from Nvidia’s fiscal year 2018 financial reports. The SEC notes Nvidia saw an explosion in crypto mining-related sales in 2017, when the rewards of mining Ethereum grew dramatically. Crypto mining was widely reported as a cause of <a href=\"https://www.theverge.com/2021/1/12/22227040/nvidia-amd-gpu-shortage-rtx-3080-3070-3060-ti-3090-rx-6800-xt\">GPU scarcity</a>, and Nvidia launched a separate CMP line specifically for mining, <a href=\"https://www.theverge.com/circuitbreaker/2021/2/18/22290362/nvidia-will-not-reduce-3060-ti-3070-3080-3090-eth-mining\">attempting to prevent shortages</a> for gamers. But employees apparently acknowledged that many gaming GPUs were still going to miners. “The company’s sales personnel, in particular in China, reported what they believed to be significant increases in demand for Gaming GPUs as a result of crypto mining,” the order says.</p><div class=\"c-float-right\"><aside id=\"mbOdM3\"><q>Investors “routinely” asked how much Nvidia relied on crypto mining</q></aside></div><p id=\"tAvTVo\">Given the boom-and-bust nature of cryptocurrency, this meant Nvidia’s sales numbers didn’t necessarily indicate reliable future growth, making investing in it riskier. “NVIDIA’s analysts and investors were interested in understanding the extent to which the company’s Gaming revenue was impacted by crypto mining and routinely asked senior management about the extent to which increases in gaming revenue during this time frame were driven by crypto mining,” the SEC alleges.</p><p id=\"1NAXTs\">Despite this, Nvidia didn’t mention mining-related sales as a factor in its gaming division’s success. Meanwhile, it mentioned crypto as an important factor in other markets, which suggested to the SEC that it was being deliberately deceptive. And investors’ anxieties turned out to be well-founded. A crypto crash in late 2018 (along with a weakening Chinese market) led it to <a href=\"https://www.theverge.com/2019/1/28/18200667/nvidia-q4-revenue-earnings-projection-cut-500-million\">slash its quarterly earnings projections</a> by $500 million and spurred a <a href=\"https://schallfirm.com/cases/nvidia-corporation/\">shareholder lawsuit</a>.</p><p id=\"m9q39O\">“NVIDIA’s disclosure failures deprived investors of critical information to evaluate the company’s business in a key market,” says SEC Crypto Assets and Cyber Unit head Kristina Littman. “All issuers, including those that pursue opportunities involving emerging technology, must ensure that their disclosures are timely, complete, and accurate.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PYB8ZwG57loFFEaX-OxZ0iHb-po=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11447603/acastro_180529_1777_nvidia_0001.0.jpg",
  "description": "Investors \"routinely\" asked about its crypto sales.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}