{
  "title": "NYT’s new WordleBot tries to gamify something that probably doesn’t need it",
  "url": "https://www.theverge.com/2022/4/8/23016527/wordle-wordlebot-analytics-data-puzzle-game-efficiency",
  "date": "2022-04-08T16:39:50.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Wordle Smartphone Game\" src=\"https://cdn.vox-cdn.com/thumbor/rdpIkmcPvbpa1hcH5kCJ5dO9ISA=/0x0:5123x3415/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70727003/1239008641.0.jpg\" />        <figcaption>photo by Mike Kemp/In Pictures via Getty Images</figcaption>    </figure>  <p id=\"L2ew5e\">We are several months <a href=\"https://www.theverge.com/22892044/wordle-free-game-online-how-to-puzzle\">into our new Wordle era</a> (along with an expanded universe of clones like <a href=\"https://worldle.teuteuf.fr/\">Worldle</a>, <a href=\"https://www.heardle.app/\">Heardle</a>, <a href=\"https://www.thenumble.app/\">Numble</a>, <a href=\"https://poeltl.dunk.town/\">Poeltl</a>, and many others) and a little over two months into <em>The</em> <em>New York Times</em> acting as stewards of the game <a href=\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\">after a “low seven figures” purchase</a>. Besides <a href=\"https://www.theverge.com/2022/2/15/22934587/wordle-solutions-changed-new-york-times\">altering the word list</a>, the <em>Times </em>is introducing its biggest change yet by adding <a href=\"https://www.nytimes.com/interactive/2022/upshot/wordle-bot.html?smid=tw-nytimes&amp;smtyp=cur\">WordleBot</a>, a tool that serves as a “daily companion” for your new favorite puzzle game.</p><p id=\"Un9K2A\">Like Wordle itself, WordleBot operates in the browser and runs locally, evaluating the completed puzzles on whatever computer and stored session you’re using to play. <a href=\"https://www.nytimes.com/2022/04/07/upshot/wordle-bot-introduction.html\">As <em>The</em> <em>New York Times</em> describes it</a>, the bot started as an attempt to mathematically prove the best starting word, developed with its The Upshot section that focuses on data visualizations for the news. </p><div>  <figure class=\"e-image\">        <img alt=\"Wordle ratings for No.291\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3-wt4AC4Wx15gbY4EomoMav6PbU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23376507/wordle_analysis.jpg\">      <cite>Image: The New York Times via Kim Lyons</cite>  </figure></div><div class=\"c-float-right\"><aside id=\"tj1RMY\"><q>Wordle is now in its advanced stats era</q></aside></div><p id=\"YzPENN\">Of the 4,500 five-letter English words WordleBot chooses from, the <em>NYT </em>says “crane” in easy mode and “dealt” in hard mode are the ones that get the bot to the answer in the fewest number of guesses. However, you may play differently and know different words, which doesn’t make them the best starting guesses for you.</p><p id=\"o5Vwyh\">WordleBot tries to take into account both skill and luck. It has the list of all Wordle answers but doesn’t know which one is the answer on a particular day. As a result, what they’ve built is a kind of standardized comparison to measure how well you did at figuring out the day’s puzzle and suggest ways for you to improve or compare who did better even when you used the same number of guesses. Yes, analytic breakdowns are now a part of Wordle.</p><p id=\"OcxW90\">If you’re obsessed with efficiency and welcome the optimization advanced stats can provide, then pressing a button and seeing what the bot thinks of your process could make the game even more satisfying. Perhaps one day, Wordle Ranked competition will launch, and you’ll need this breakdown to climb the worldwide leaderboards or eventually make a Wordle Hall of Fame case, proving to the voters that you truly were among the best players in your era before rule changes emphasized downfield passing, three-point shooting, and they banned the shift, completely ruining comparisons to old numbers.</p><p id=\"wEPzbm\">But if you’re playing a bit more casually, then maybe it’s good enough to get to the solution (or not) and simply give the game up until a new word comes tomorrow, efficiency be damned.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-kxxBonnB20qfuJV6Zy9DvHWbSI=/0x367:5123x3049/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23376502/1239008641.jpg",
  "description": "Wordle players, meet advanced statistical analysis.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}