{
  "title": "Obama’s plans to fight disinformation are better than most",
  "url": "https://www.theverge.com/2022/4/21/23036525/president-barack-obama-disinformation-ideas",
  "date": "2022-04-22T00:10:52.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"COP26 Adaptation, Loss and Damage - Day Nine\" src=\"https://cdn.vox-cdn.com/thumbor/lm9JdZ6g2MNVKtf_yUSbQHAigEA=/0x0:4205x2803/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70778705/1352102251.0.jpg\" />        <figcaption>Photo by Jeff J Mitchell/Getty Images</figcaption>    </figure>  <p class=\"p--has-dropcap\" id=\"vUOOAe\">A former president of the United States has their pick of big problems to tackle once they leave office. Jimmy Carter worked on housing. Bill Clinton spent much of his time working to fight HIV and AIDS. Barack Obama, who has been out of office for six years, has so far led a fairly quiet post-presidency. But in recent weeks, he has begun drawing attention to an issue that advisers say has become<a href=\"https://www.cnn.com/2022/04/10/politics/obama-birtherism-big-lie-disinformation/index.html\"> increasingly important to him</a>: disinformation, and the broader problems with our fractured information ecosystem.</p><p id=\"Rlh53Q\">In the months after President Donald Trump was dislodged from office, what could feel at times like an all-consuming focus on disinformation in the tech and political press began to fade into the background. The shift is understandable: Trump had been the most prominent spreader of disinformation in the world, and once he lost access to the Oval Office and his Twitter account, dozens of false claims that the media would otherwise have spent all day running down simply disappeared from the headlines.</p><p id=\"VJWhPC\">At the same time, Trumpism — particularly its false claim that the election was rigged for Joe Biden — has remained an ugly, powerful current in American life. More than a year after Biden’s inauguration, Republican politicians continue to repeat the Big Lie, using it successfully as a pretext for stripping away voting rights. On occasion, this kind of disinformation even seeps into the mainstream of the American press — as when a Michigan outlet this week described “<a href=\"https://www.mlive.com/public-interest/2022/04/meet-the-republican-secretary-of-state-hopefuls-planning-to-tackle-voter-fraud-and-department-backlogs.html\">the Republican Secretary of State hopefuls planning to tackle voter fraud</a>,” <a href=\"https://twitter.com/jayrosen_nyu/status/1517145593839190018\">normalizing</a> the idea that elections might be stolen otherwise.</p><p id=\"RwBkpP\">On one hand, the decay of our information environment is plain to see: tech platforms that historically have been all but indifferent to the quality of information they promote; a decline in journalism jobs, particularly at local and regional publications, across the country; and a polarized citizenry that increasingly doubts the legitimacy of American democracy.</p><p id=\"lEA5IQ\">On the other, as I wrote yesterday, <a href=\"https://www.platformer.news/p/the-research-on-social-networks-is?s=w\">it can be easy to over-rotate on the idea that information quality alone is at the root of our problems</a>. Another way of putting it, as Matt Yglesias did at <em>Slow Boring</em> this week, is that disinformation is <a href=\"https://www.slowboring.com/p/misinformation?s=r\">too easily used as a scapegoat by Democrats seeking to gloss over some rather unsexy political problems</a>. Yglesias calls it “a self-exculpatory cope” and worries that it’s an electoral dead end:</p><blockquote><p id=\"X6Hayr\">Less-educated people are less knowledgeable and less media literate, and that’s not ideal. But Democrats need to read the correlation in the correct direction and try harder to appeal to their values, not write them off as too misinformed to be reached.</p></blockquote><p id=\"t6MBlZ\">Over the past two weeks, I’ve had two chances to see Obama make his case for the urgency of addressing disinformation. The first was at <a href=\"https://www.theatlantic.com/ideas/archive/2022/04/barack-obama-interview-disinformation-ukraine/629496/\">a fireside chat with Jeffrey Goldberg at a conference organized by <em>The Atlantic</em> in Chicago</a>. In that conversation, Obama said that he had been surprised at how vulnerable American institutions are to those who would flood the airwaves with lies. And he worries that those lies pose an existential threat to democracy.</p><p id=\"Zkp2yh\">“It’s very difficult for us to get out of the reality that is constructed for us,” he told Goldberg. “And that is part of the reason why the stakes of this issue are so important, because it is difficult for me to see how we win the contest of ideas if in fact we are not able to agree on a baseline of facts that allow the marketplace of ideas to work.”</p><p id=\"oP4AOR\">On Thursday, I got to hear the more refined version of this argument. Obama paid a visit to Stanford University in Palo Alto, and <a href=\"https://www.washingtonpost.com/technology/2022/04/21/obama-disinformation-stanford/\">delivered an hourlong keynote address</a> at a conference titled “Challenges to Democracy in the Digital Realm.”</p><p id=\"6zmkKG\">Typically when a politician wanders into this realm, I brace myself for the inch-deep thoughts and half-baked solutions that almost always follow. But Obama has clearly done the reading — his talk today demonstrated an excellent command of the scope and significance of our problems online, while also owning up to the limits of an approach focused solely on removing disinformation to repair our democracy.</p><p id=\"GxPwvy\">Notably, he preceded his critique by talking up the power and potential of a free and open internet — something that seems to have fallen into disfavor among both Democrats and Republicans. And he acknowledged that social platforms helped to power his own rise.</p><p id=\"QVyUdf\">“I might never have been elected president if it hadn’t been for — and I’m dating myself here — websites like MySpace, Meetup, and Facebook — that allowed an army of young volunteers to organize, raise money, and spread our message,” he said. “And since then, we’ve all witnessed the way activists use social platforms to register dissent, shine a light on injustice, and mobilize people on issues like climate change and racial justice.”</p><p id=\"O5ubL7\">The problem, he said, is that “our new information ecosystem is turbocharging some of humanity’s worst impulses.” Some of that is intentional, he said, and some isn’t. But ultimately it requires a society-level response. Otherwise, he said, America could be doomed to one day more closely resemble modern-day Russia, in which an autocrat rises to power, clamps down on information flows, and gradually undoes our democracy.</p><p id=\"pg3Jri\">Obama acknowledged that social divisions predate Facebook and Twitter. And efforts to regulate speech will often run afoul of the First Amendment, for which he affirmed his strong support.</p><div><aside id=\"EKRdz4\"><q>“People are dying because of misinformation.”</q></aside></div><p id=\"0AX5ta\">But something must be done, Obama said, citing perhaps the most grim statistic in the entire COVID-19 pandemic: around 1 in 5 Americans refuse to get vaccinated under the false belief it is likely to cause them harm. “People are dying because of misinformation,” he said.</p><p id=\"ViOOVZ\">In part that’s because of the way platforms are designed to promote scandal and outrage, he said. In part that’s because they have paid too little attention to the quality of the information that is traveling the farthest and the fastest. And in part it’s because lawmakers have not implemented meaningful regulations.</p><p id=\"wXk7kQ\">So what to do? Like most people who venture into these waters, it’s here that Obama has the most trouble. Not because his ideas are bad — they’re better than most of what I’ve heard Congress suggest — but because they are so limited. It’s possible to imagine all of the president’s most practical suggestions being implemented and still wonder how they could reverse a global slide into autocracy.</p><p id=\"GoCmYM\">Still, he makes several worthy suggestions. Platforms should describe their algorithmic recommendation systems in greater detail, so that we understand who benefits the most (and who doesn’t). (“If a meat-packing company has a proprietary technique to keep our hot dogs fresh and clean, they don’t have to reveal to the world what that technique is,” he said. “But they do have to tell the meat inspector.”)</p><p id=\"Fqh0Ab\">They should add “circuit breakers” that slow the spread of viral posts to give fact-checkers a chance to review them, he argued. They should offer academics access to their systems to enable more meaningful research. They should fund nonprofit newsrooms.</p><p id=\"3qOTjw\">And, Obama says, we should regulate tech platforms. He talked briefly about at least considering reform of Section 230, the law that exempts tech companies from legal liability in most cases for what their users post online. (I wish he had said more, particularly about how such reforms would pass First Amendment scrutiny.)</p><p id=\"D6AtmU\">Obama also called on platform employees to advocate for changes like these — and to quit if none are made.</p><div class=\"c-float-right\"><aside id=\"LkB4xH\"><q>Obama is encouraging employees to fix the platforms — or leave</q></aside></div><p id=\"NY1xCu\">“These companies need to have a north star other than just making money and increasing partisanship,” he said. “To fix a problem they helped create, but also stand for something bigger. To the employees of these companies … you have the power to move things in the right direction. You can advocate for change. You can be part of this redesign — or you can vote with your feet and go work for the companies that are trying to do the right thing.”</p><p id=\"O3Si7W\">As a set of problems, I continue to worry that disinformation is downstream of certain grim electoral realities. If Republicans don’t have to win a majority of voters through persuasion or compromise, and can simply brute-force their way into office by curtailing voting rights, why would Steve Bannon and his ilk ever temper the false claims that make that easier? How can platforms and media companies effectively respond to a party that does not recognize the legitimacy of fair elections?</p><p id=\"lvZ83K\">When power is unaccountable, power is abused. I don’t know how you solve that at the platform level.</p><p id=\"KdyGKU\">But platforms undoubtedly could play a dramatic role in improving our information ecosystem. They could do so by massively funding nonprofit or public media. They could use the template of their COVID response to promote high-quality information sources wherever they are showing news, and demote hyperpartisan outlets. They could slow the speed of viral posts to give the truth a chance to catch up.</p><p id=\"xy3v4g\">They could end “trending topics.” They could promote positive interactions and community building that cuts across political parties. They could form public-private partnerships to disseminate data about state-level actors who are conducting information operations here and around the world.</p><div class=\"c-float-left\"><aside id=\"rz6lAb\"><q>Platforms that ignore the fate of democracy do so at their own peril</q></aside></div><p id=\"NcjjXH\">Or they could largely ignore these threats in favor of focusing on shorter-term goals: the next milestone on the product road map, the next set of quarterly earnings.</p><p id=\"nGSPE1\">If they do, though, they would do well to remember the fate of internet platforms in Russia once autocracy was complete: disappearing one by one, like lights blinking off in a rolling power outage.</p><p id=\"o1ggt8\">“We won’t get it right all at once,” Obama said. “That’s how democracy works. … We continue to perfect our union.”</p><p id=\"30x4Ve\">Of course, it’s one thing to deliver a speech, and another thing to see these ideas through. Both platforms and Congress have been resistant to major changes for years now, and it’s unclear what levers Obama will have to pull even if he were still president.</p><p class=\"c-end-para\" id=\"61BsO9\">Still, as we head into the midterm elections, the purposeful use of lies and hoaxes to justify seizing power deserves a fresh look. Obama clearly understands the stakes. If ever there were a moment for change we can believe in, it’s now.</p><div id=\"6CZO88\"><iframe src=\"https://www.platformer.news/embed\" width=\"480\" height=\"320\"  frameborder=\"0\" scrolling=\"no\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/eBH6AnMSFPQ8Hpq56-5eaB_Ftng=/0x104:4205x2306/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23407729/1352102251.jpg",
  "description": "Several worthy suggestions, but we need more",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}