{
  "title": "Offshore wind’s ship problem is growing ",
  "url": "https://www.theverge.com/2022/2/3/22916065/offshore-wind-energy-demand-installation-vessels-supply",
  "date": "2022-02-03T18:31:44.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Dominion Energy hired the Luxembourg-flagged vessel Vole Au Vent to construct a pilot project off the shores of Virginia.\" src=\"https://cdn.vox-cdn.com/thumbor/gh8jGki8HXB4Vfbnx6130BO-gq0=/313x0:3688x2250/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70467602/CVOW_Turbine_2_Install_1.0.jpg\" />        <figcaption><em>Dominion Energy hired the Luxembourg-flagged vessel Vole Au Vent&nbsp;</em> | Image: Dominion Energy</figcaption>    </figure>  <p id=\"APPfof\">The short supply of ships capable of deploying giant wind turbines at sea is becoming an even bigger problem as offshore wind ambitions grow. By 2024, demand for wind turbine installation vessels will likely outpace supply, according to a recent <a href=\"https://www.rystadenergy.com/newsevents/news/press-releases/Super-sized-offshore-wind-installations-could-suffer-bottlenecks-from-2024-as-vessels-remain-lightweight/\">analysis</a> by Norwegian firm Rystad Energy. That’s even sooner than a <a href=\"https://www.rystadenergy.com/newsevents/news/press-releases/the-world-may-not-have-enough-heavy-lift-vessels-to-service-the-offshore-wind-industry-post-2025/\">prediction</a> the firm made back in 2020 when it said that the global fleet wouldn’t be enough to meet demand after 2025.</p><p id=\"jpeSvM\">Massive, specialized vessels are required to carry wind turbine components out to sea and install them. With just over 30 of these vessels navigating the world’s seas in 2020, according to Rystad, offshore wind projects already have to vie for time with a limited number of ships. A growth spurt in turbine technology will exacerbate the problem even further.</p><p id=\"WFD3Ma\">Taller turbines can reach stronger winds, while longer blades can harness more power. New turbines are the size of skyscrapers, dwarfing previous designs. Between 2010 and today, the amount of wind power turbine can harness, on average, has more than doubled from 3 MW to 6.5 MW. By the end of the decade, more than half of turbines installed globally are projected to be even larger than 8 MW.</p><div class=\"c-float-right\"><aside id=\"t03PMZ\"><q>That’s quickly making more ships — even those just built this decade — obsolete</q></aside></div><p id=\"lvBxm2\">That’s quickly making more ships — even those just built this decade — obsolete. Only four of the turbine installation ships in operation<strong> </strong>are capable of carrying behemoth next-generation turbines, according to Rystad’s 2020 analysis. The firm measures demand for the ships in “vessel years” that represent how much time is needed with the vessels to build offshore wind projects. Rystad says demand for vessels capable of installing turbines larger than 9 MW was “nonexistent” in 2019. By 2030, it expects demand for such ships to reach 62 vessel years.</p><p id=\"1bb0Vb\">The US, which has recently <a href=\"https://www.theverge.com/2021/10/13/22725234/biden-offshore-wind-boost-united-states-coastlines\">opened up waters along much of its coastlines</a> for offshore wind development, <a href=\"https://www.theverge.com/22296979/us-offshore-ships-wind-boom-installation-vessels\">faces even steeper challenges</a>. American offshore wind projects have to comply with the Jones Act, which mandates that ships moving between two points in the US be built, owned, crewed, and registered in the US. So far, none of the existing installation vessels strong enough to haul the largest wind turbines are Jones Act compliant. The first compliant vessel is supposed to be ready by late 2023. But it’s also vastly more expensive to build such ships in the US.<strong> </strong>Still, the Biden administration aims to ramp up domestic offshore wind energy capacity from just 42 megawatts today to <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/29/fact-sheet-biden-administration-jumpstarts-offshore-wind-energy-projects-to-create-jobs/\">30,000 by 2030</a>. </p><p id=\"HXAXrg\">Ambitions for offshore wind are starting to take off around the globe as economies transition to clean energy. The amount of offshore wind capacity added each year needs to more than <a href=\"https://www.iea.org/reports/tracking-offshore-wind-2020\">quadruple</a> by the end of the decade in order to meet the goals of the Paris Climate Agreement, according to the International Energy Agency. To reach that goal, the world is going to need more ships — and fast.</p><aside id=\"Eyh6QI\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The US offshore wind boom will depend on these ships\",\"url\":\"https://www.theverge.com/22296979/us-offshore-ships-wind-boom-installation-vessels\"}]}'></div></aside><p id=\"3PjEpb\"></p><p id=\"0esU93\"></p><p id=\"QcbGae\"></p><p id=\"MLuUfJ\"></p><p id=\"do9S9C\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_M8d4NdeeIF6ME6cndjzDFUDS90=/0x78:4000x2172/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22322863/CVOW_Turbine_2_Install_1.jpg",
  "description": "An older fleet can’t haul turbines as big as sky-scrapers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}