{
  "title": "Oklahoma governor pushes for $700 million rebate package to lure a company he can’t name",
  "url": "https://www.theverge.com/2022/4/19/23032627/oklahoma-governor-luring-company-state-incentives-panasonic-battery-factory-tesla",
  "date": "2022-04-19T23:01:50.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"US-POLITICS-TRUMP-VIRUS-HEALTH\" src=\"https://cdn.vox-cdn.com/thumbor/rFqPdktV_jAjP3tjPypPcNlK86Y=/0x0:4268x2845/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70769086/1221049623.0.jpg\" />        <figcaption>Governor Kevin Stitt is bound by a non-disclosure agreement, preventing him from revealing the company’s name. | Photo by SAUL LOEB/AFP via Getty Images</figcaption>    </figure>  <p id=\"ARCXeH\">Governor Kevin Stitt of Oklahoma called on lawmakers to approve an enormous financial incentives package that’s supposed to coax an unnamed company with ties to the electric vehicle (EV) industry to the state, according to a report from <a href=\"https://fortune.com/2022/04/19/oklahoma-governor-wants-lawmakers-approve-massive-incentives-lure-tech-company-nda/\"><em>Fortune</em></a> and local media outlet <a href=\"https://www.news9.com/story/625de32b74f7640726b30ea7/gov-stitt-seeks-tax-breaks-in-exchange-for-largest-manufacturing-investment-in-state-history-\">News 9</a>. A non-disclosure agreement barred Governor Stitt from revealing the name of the company and the amount of money pledged to the package — but there’s good reason to believe that this company may be Panasonic.</p><p id=\"YN4hf4\">“Tens of billions of dollars are going to be invested over the next five to seven years in this space, and we want Oklahoma to be the spot that these folks land,” Governor Stitt said in a <a href=\"https://youtu.be/m7Xs8fWw0PQ\">press conference</a>. “But I’ll tell you this, if I don’t get it passed, it’s not happening.”</p><p id=\"vgZFuc\">Shortly after Stitt’s pitch to state lawmakers, the Oklahoma House Joint Committee on Appropriations and Budget advanced <a href=\"http://www.oklegislature.gov/BillInfo.aspx?Bill=HB4455&amp;Session=2200\">HB 4455</a> to the Senate, a bill that provides $698 million in rebates and incentives to companies that meet certain thresholds linked to job creation and capital expenditure.</p><div id=\"ch68dZ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Oklahoma is at the one-yard-line of securing a multi-billion dollar investment that will make a generational impact for our state.<br><br>Lets work together to push this thing across the goal line and get it done! <a href=\"https://t.co/DNJrCeJizc\">pic.twitter.com/DNJrCeJizc</a></p>— Governor Kevin Stitt (@GovStitt) <a href=\"https://twitter.com/GovStitt/status/1516145870974361602?ref_src=twsrc%5Etfw\">April 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"OmFU6J\">In March, an anonymous source told Japanese news group <em>NHK </em>(via <a href=\"https://www.bloomberg.com/news/articles/2022-03-03/panasonic-to-build-u-s-battery-plant-to-supply-tesla-nhk-says\"><em>Bloomberg</em></a>) that Panasonic is looking to build a factory in either Kansas or Oklahoma to manufacture lithium-ion car batteries for Tesla. <a href=\"https://www.reuters.com/technology/panasonic-begin-mass-producing-new-tesla-battery-by-end-march-2022-02-28/\">Panasonic previously announced plans to start mass-producing Tesla’s new batteries</a> by the end of March 2024, boosting output by building two additional production lines at its Wakayama factory in Japan. <em>The Verge</em> reached out to Panasonic with a request for comment but didn’t immediately hear back.</p><p id=\"GIawax\">As noted by <em>Fortune</em>, even other representatives aren’t privy to the company Oklahoma’s laying out the red carpet for, leaving some frustrated. </p><p id=\"s8nAlo\">“The governor has not spoken to us about the bill, and it’s very concerning he would ask us to support something without giving us the bill number or language,” said Emily Virgin, Oklahoma House Minority Leader (via <em>Fortune</em>).</p><p id=\"Ia6o1s\">Oklahoma is competing with neighboring Kansas to land the purported Panasonic factory deal. In February, <a href=\"https://kfor.com/news/oklahoma-legislature/house-advances-mega-deal-bill-touted-by-gov-stitt-to-incentivize-companies-moving-to-oklahoma/\">Kansas Governor Laura Kelly signed off on a bill for a $4 billion “mega-project plan”</a> offering incentives to large corporations. <a href=\"https://www.theverge.com/21375891/tesla-tulsa-cybertruck-factory-elon-musk-statue-memes\">Oklahoma launched a massive (meme-filled) campaign</a> to bring a Tesla Gigafactory to the state in 2020 and lost out to Texas.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RirjihreP_APp4rz5aH9o4cbmJI=/0x0:4338x2271/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23401269/1221049623.jpg",
  "description": "Oklahoma wants to be the site of the next Panasonic plant.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}