{
  "title": "Okta hack puts thousands of businesses on high alert",
  "url": "https://www.theverge.com/2022/3/22/22990637/okta-breach-single-sign-on-lapsus-hacker-group",
  "date": "2022-03-22T18:39:12.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/USVmEJ6NdU4dqatTUSoKxOqMIJA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70655647/acastro_170629_1777_0008_v2.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"f3y7fe\">Okta, an authentication company used by thousands of organizations around the world, has now confirmed an attacker had access to one of its employees’ laptops for five days in January 2022 — but claims its service “has not been breached and remains fully operational.” </p><p id=\"3nudKQ\">The disclosure comes as hacking group Lapsus$ has posted screenshots to its Telegram channel claiming to be of Okta’s internal systems, including one that appears to show Okta’s Slack channels, and another with a Cloudflare interface. </p><p id=\"RMLZMI\">Any hack of Okta could have major ramifications for the companies, universities, and government agencies that depend upon Okta to authenticate user access to internal systems. </p><p id=\"Wc5eJR\">But <a href=\"https://www.okta.com/blog/2022/03/updated-okta-statement-on-lapsus/\">in a statement on Tuesday afternoon</a>, Okta now says that an attacker would only have had limited access during that five-day period — limited enough that the company claims “there are no corrective actions that need to be taken by our customers.” </p><p id=\"3dmavm\">Here’s what Okta chief security officer David Bradbury says is and isn’t at stake when one of its support engineers is compromised:</p><blockquote><p id=\"trWZF1\">The potential impact to Okta customers is limited to the access that support engineers have. These engineers are unable to create or delete users, or download customer databases. Support engineers do have access to limited data - for example, Jira tickets and lists of users - that were seen in the screenshots. Support engineers are also able to facilitate the resetting of passwords and <a href=\"https://www.okta.com/products/adaptive-multi-factor-authentication/\">MFA</a> factors for users, but are unable to obtain those passwords.</p></blockquote><p id=\"EWACk9\">Writing in its Telegram channel, the Lapsus$ hacking group claims to have had “Superuser/Admin” access to Okta’s systems for two months, not just five days, that it had access to a thin client rather than a laptop, and claims that it found Okta storing AWS keys in Slack channels. The group also suggested it was using its access to zero in on Okta’s customers. <a href=\"https://www.wsj.com/articles/okta-investigates-reports-of-a-digital-breach-11647931174?mod=hp_lista_pos2\"><em>The Wall Street Journal</em> notes</a> that in a recent filing Okta said it had over 15,000 customers around the world. It lists the likes of Peloton, Sonos, T-Mobile, and the FCC as customers <a href=\"https://www.okta.com/customers/\">on its website</a>. </p><p id=\"7ZshUK\">In a earlier statement sent to <em>The Verge</em>, Okta spokesperson Chris Hollis said the company has not found evidence of an ongoing attack. “In late January 2022, Okta detected an attempt to compromise the account of a third party customer support engineer working for one of our subprocessors. The matter was investigated and contained by the subprocessor.” Hollis said. “We believe the screenshots shared online are connected to this January event.”</p><p id=\"U6ZX7m\">“Based on our investigation to date, there is no evidence of ongoing malicious activity beyond the activity detected in January,” Hollis continued. But again, writing in their Telegram channel, <a href=\"https://twitter.com/_mg_/status/1506117831095586818?s=21\">Lapsus$ suggested</a> that it had access for a few months. </p><div id=\"wl4ESe\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is our 3rd attempt at sharing the 5th - 8th photo. LAPSUS$ displayed a lot of sensitive information and/or user information, so much so we end up missing to censor some.<br><br>Photos 5 - 8 attached below. <a href=\"https://t.co/KGlI3TlCqT\">pic.twitter.com/KGlI3TlCqT</a></p>— vx-underground (@vxunderground) <a href=\"https://twitter.com/vxunderground/status/1506117725571137536?ref_src=twsrc%5Etfw\">March 22, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"guZe5y\">Lapsus$ is a hacking group that’s claimed responsibility for a number of high-profile incidents affecting <a href=\"https://www.theverge.com/2022/3/1/22957212/nvidia-confirms-hack-proprietary-information-lapsus\">Nvidia</a>, <a href=\"https://www.theverge.com/2022/3/7/22965220/samsung-hack-lapsus-galaxy-source-code-confirmed-nvidia\">Samsung</a>, <a href=\"https://twitter.com/vxunderground/status/1506099203977666563?t=paj7AEhXegjG83peqUVY5w&amp;s=19\">Microsoft</a>, and <a href=\"https://www.theverge.com/2022/3/11/22972768/ubisoft-cyber-security-incident-hack\">Ubisoft</a>, in some cases stealing hundreds of gigabytes of confidential data. </p><p id=\"Hir9HL\">Okta says it terminated its support engineer’s Okta sessions and suspended the account back in January, but claims it only received the final report from its forensics firm this week. </p><p id=\"LQeBeh\"><em><strong>Update, 2:38PM ET: </strong></em><em>Added Okta’s statement and claims that the hack was very limited, with no corrective actions that need to be taken.</em></p><p id=\"v63IWB\"><em><strong>Update, 2:58PM ET: </strong></em><em>Added the Lapsus$ hacker group’s claim that it had access to a thin client rather than a laptop, that it found Okta storing AWS keys in Slack channels.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nMu32hOmEMBEexVd-Wh7rIx6Nzc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9281305/acastro_170629_1777_0008_v2.jpg",
  "description": "\"There are no corrective actions that need to be taken by our customers.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}