{
  "title": "OlliOlli World captures the essence of skateboarding, and then makes it weird",
  "url": "https://www.theverge.com/22915054/olliolli-world-review-switch-ps5-xbox-pc",
  "date": "2022-02-03T14:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_5bYiFa_bg7Rqt_zO5QEwnkjxFg=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70466338/OOW_ReviewsScreenshot_SunshineValley.0.jpg\" />    </figure>  <p id=\"PgNzLn\"><em>OlliOlli World</em> might be the strangest skateboarding game of all time. It takes place in a fictional realm called Radlandia, which is ruled by skate gods, where players train continuously to become a skate wizard by grinding their way through haunted deserts and mystical forests. It looks and sounds like a long-lost animated series on Adult Swim. But even with all of the oddball humor and bizzaro levels, <em>OlliOlli World</em> still manages to capture the soul of skateboarding — and it’s a hell of a lot of fun.</p><p id=\"SC3vte\">The <em>OlliOlli</em> series dates back nearly a decade, and is probably best-described as <a href=\"https://www.theverge.com/2014/1/21/5328852/olliolli-ps-vita-review\">a side-scrolling take on <em>Tony Hawk’s Pro Skater</em></a>. You control a tiny skater in a 2D world, skating your way through intricately-designed levels in search of a high score and, occasionally, secrets. The controls are surprisingly intuitive, primarily using the two analog sticks to pull off grinds and tricks, and the games do a great job of steadily ramping up the complexity. The previous two games took place in a fairly traditional, modern urban setting, so the biggest change for <em>OlliOlli World</em> is its strange new world.</p><p id=\"8u9A7N\">The setting impacts a few things. For starters, there’s an actual story. You’re guided through the world by a handful of quirky skaters, who set you on a quest to meet all of the rad deities and become a skate wizard. I’m not entirely sure what that means, but the story mode takes you across five very different biomes and subjects you to a lot of skateboarding puns. (There’s a character who is named simply “Dad,” so you know the jokes are bad.) It’s charming and cute, though it can get a little chatty at times; thankfully you can skip through most of the dialogue if you want.</p><div id=\"h0OGPW\"><div ><iframe src=\"https://www.youtube.com/embed/IopOsBOMF2Y?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"vHAX3P\">More importantly, though, the fantasy universe really adds life to the franchise, which was previously full of drab, utilitarian urban environments. Everything in <em>OlliOlli World</em> is bursting with color and energy. You’ll roll through deserts with walking cacti in the background, and factories filled with disturbing industrial goo. The final world is a surreal take on Las Vegas. It’s a lot of fun just to look at, but it has also given the level designers the liberty to go wild. Initially levels are fairly straightforward, but eventually you’ll have to deal with moving platforms, destructible bridges, moving trains, branching paths, and giant purple crystals. The scale can be incredible; often times I was holding my breath as I chained together tricks across impossible distances.</p><p id=\"SsiwYW\">Part of the game’s story involves reaching a place called Gnarvana, which, silly as the pun may be, suits the game perfectly. <em>OlliOlli World</em>, like all skateboarding games, is at its best when you reach that zen-like state where you’re reacting instead of thinking. The simplified control scheme and smartly-designed levels work together to help you get there. Basic tricks are extremely simple to do, but the challenge is chaining them together with various forms of movement — jumps, grinds, wallrides, etc. — so that you’re constantly speeding through a level.</p><div class=\"c-float-right\"><div id=\"OlkfMZ\"><div data-anthem-component=\"aside:9355637\"></div></div></div><p id=\"kBWMln\">Sometimes this requires trial-and-error; I died <em>a lot </em>during my time with the game. But each level is short, has multiple checkpoints, and restarting is nearly instantaneous, so things rarely got frustrating for me. On the few occasions I did find myself stuck, I was able to find a different route or simply go to another level to clear my brain. And when you do finally pull off one of those seemingly impossible runs, it’s incredibly satisfying.</p><p id=\"A3Efnw\">The other thing the new, more vibrant setting gives the game is a sense of style — and not just in the cool levels and interesting characters. One of my favorite parts of the game has been the clothing you steadily unlock. There’s so much of it, and it ranges from classic skater looks to oddball gear like gas masks and ice cream sundae hats. I’ve probably spent as much time perfecting my look as perfecting my runs. And while I love a high score, I’ve been replaying levels more to get new decks and shoes.</p><p id=\"UObr7N\">Maybe the most important thing about <em>OlliOlli World</em> is that it’s playful. It encourages experimentation, whether it’s with how you approach an obstacle or how you want your character to look. That’s really the essence of skate culture: creativity on a board. <em>OlliOlli World</em> captures that — and then puts its own bizarre twist on it.</p><p id=\"sTDaGi\"><small>OlliOlli World </small><small><em>launches February 8th on the Switch, PS4, PS5, PC, and Xbox.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4erc3dJM9sXTlmjZWAWYqoNbd8c=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23214102/OOW_ReviewsScreenshot_SunshineValley.jpg",
  "description": "The series makes a colorful comeback.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}