{
  "title": "One in five reptile species threatened with extinction ",
  "url": "https://www.theverge.com/2022/4/27/23044391/reptile-species-threatened-extinction",
  "date": "2022-04-27T15:00:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"A Nile crocodile (Crocodylus niloticus) pictured in its...\" src=\"https://cdn.vox-cdn.com/thumbor/z3W6Oh8vGk0RSHnx6qzGhiloDIA=/5x0:4996x3327/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70799705/1233272000.0.jpg\" />        <figcaption><em>A Nile crocodile (Crocodylus niloticus) pictured in its enclosure at Faunia zoo park.</em> | Photo by Marcos del Mazo/LightRocket via Getty Images</figcaption>    </figure>  <p id=\"HFQPi2\">More than one in five of the world’s reptile species are threatened with extinction, researchers have determined in a new <a href=\"https://www.nature.com/articles/s41586-022-04664-7\">paper</a> that marks the culmination of more than 20 years of slow-going research. On top of facing human-caused threats to their survival, the scaled creatures have fallen victim to bias in conservation priorities.</p><p id=\"8hMqS2\">Conservationists with limited resources have had to play catch-up in their efforts to assess threats to turtles, crocodiles, lizards, snakes, and <a href=\"https://www.doc.govt.nz/nature/native-animals/reptiles-and-frogs/tuatara/\">tuatara</a> (the last in an ancient lineage of reptiles that roamed the Earth with dinosaurs). Similar comprehensive assessments for birds, mammals, and amphibians (all categorized as tetrapods, or four-limbed vertebrates) were completed over a decade ago. </p><p id=\"K78euS\">Why has there been a dearth of data for reptiles in particular? They just haven’t gotten the same sort of sympathy from funders as their fluffier counterparts, say authors of the new paper published today in the journal <em>Nature.</em></p><div class=\"c-float-right\"><aside id=\"l8fTbM\"><q>“There’s just been a lot more focus on some of the more furry or feathery species”</q></aside></div><p id=\"1Pplgh\">“Reptiles to many people are not charismatic, and there’s just been a lot more focus on some of the more furry or feathery species of vertebrates for conservation,” Bruce Young, co-lead of the study<em>, </em>said on a press call. “But through persistence, we were able to find the funding needed to complete the study.”</p><p id=\"s6jH2z\">With the new global assessment of reptiles, conservationists have a clearer picture of which species need the most help. The iconic King Cobra, for instance, surprised researchers. It’s currently ranked as “vulnerable” by the International Union for Conservation of Nature (IUCN). But without this new assessment, conservationists wouldn’t have known that “it’s very close to extinction,” Neil Cox, another co-lead of the study, said on the call. The study also discovered that 31 reptile species have gone extinct already.</p><p id=\"sB0gxS\">To figure out how endangered reptiles are around the world, scientists started their assessment of 10,196 species back in 1996. The bulk of the data, however, came from 48 separate workshops that were convened between 2004 to 2019. During the workshops, reptile experts pulled together information that was vital for determining different species’ extinction risk. But since it’s taken so long to do all this, about 15 percent of the data they collected can already be considered outdated. </p><p id=\"oSoWgd\">What’s more, their assessments came up inconclusive for nearly 15 percent of the species because there wasn’t enough information about their distribution, population status, or threats faced. That’s <a href=\"https://www.theverge.com/23032327/wildlife-photos-ai-conservation-research\">a problem across conservation efforts</a> for all sorts of animals because this type of research takes a lot of time and money. </p><p id=\"CvBZez\">Over 20,000 species on the <a href=\"https://www.iucnredlist.org/\">Red List of threatened species</a> are considered “data deficient.” That list is put together by the IUCN, which led the newly published research on reptiles alongside environmental organizations NatureServe and Conservation International.</p><div id=\"2VQuIG\"><iframe title=\"Extinction risk in tetrapods\" aria-label=\"Bar Chart\" id=\"datawrapper-chart-ybDcX\" src=\"https://datawrapper.dwcdn.net/ybDcX/2/\" scrolling=\"no\" frameborder=\"0\"  height=\"233\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script></div><p id=\"la4SHQ\"></p><p id=\"wQoVZH\">Reptiles, amphibians, mammals, and birds are all in the same rocky boat when it comes to the threat of extinction. Roughly 41 percent of amphibians, 25 percent of mammals, and 14 percent of birds are categorized as either vulnerable, endangered, or critically endangered on the IUCN’s Red List. </p><p id=\"BON4v8\">While this new research has determined that an alarming 21 percent of reptile species — 1,829 individual species — face the risk of extinction, this could very well be an underestimate. With biodiversity generally in decline across the globe, species with outdated assessments are likely in even more dire straits now, the study suggests. </p><p id=\"o1uID5\">That includes turtles and crocodiles, which face some of the highest risk of extinction among reptile species and were more likely to have outdated assessments. About 58 percent of turtles and 50 percent of crocodiles were found to be threatened with extinction. </p><p id=\"nBCOzF\">Complicating matters, the study was limited to threats faced over the next ten years or three generations (whichever is longest), which meant that longer-term threats like climate change were difficult to quantify.</p><div class=\"c-float-right\"><aside id=\"HLnVTS\"><q>The biggest danger turtles and crocodiles face is hunting</q></aside></div><p id=\"NQkD9i\">Targeted efforts are needed for some of the most vulnerable species that face unique threats. The biggest danger turtles and crocodiles face, for instance, is hunting (which includes the animal / pet trade). But the biggest threats to all reptiles, the researchers found, are agriculture, urban development, and logging — since a majority of reptile species can be found in forests. That means that broader conservation efforts for other forest-dwelling creatures — including birds, mammals, and amphibians — can go a long way in helping out their unfortunately less-beloved reptile neighbors.</p><p id=\"iLyHxh\"></p><p id=\"eBFj8L\"></p><p id=\"veeZlc\"></p><p id=\"mA1Tn6\"></p><p id=\"nxoKgR\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IWTXLTp1jozRtecbbcb5mhs5QPw=/0x355:5000x2973/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23419866/1233272000.jpg",
  "description": "Turtles and crocodiles are in dire straits.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}