{
  "title": "OnePlus Nord N20 5G review: a better budget phone",
  "url": "https://www.theverge.com/23044768/oneplus-nord-n20-5g-review-price-screen-specs-camera-battery",
  "date": "2022-04-28T13:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p>An inexpensive phone that feels like it should cost more than $300</p> <p class=\"p--has-dropcap p-large-text\" id=\"1UKLqp\">The OnePlus Nord N20 5G is OnePlus at its best. While the company <a href=\"https://www.theverge.com/23003212/oneplus-10-pro-review-screen-price-specs-battery\">hasn’t quite mastered the flagship</a>, it has dialed in the recipe for a stellar budget phone. </p><p id=\"6ixb0D\">For $282, the N20 delivers performance that feels like you’re getting away with something. It’s not perfect, but it strikes an excellent balance of price and features that makes it easy to recommend — if you’re on T-Mobile.</p><p id=\"W4DTqd\">That’s one of a few “ifs” that makes it difficult to recommend the N20 5G to absolutely anyone looking for a budget Android phone. As it’s being introduced in the US, the N20 5G will only be sold through T-Mobile. OnePlus says it plans to sell the phone unlocked at a later date, but a company spokesperson, Spenser Blank, wouldn’t offer any comment on whether the company will seek 5G certification on Verizon and AT&amp;T when it does.</p><div id=\"KZkZa4\"><div data-anthem-component=\"scorecard:11164104\"></div></div><p id=\"v2UQFD\">There’s also the fact that OnePlus is being a little disingenuous by saying that the N20 5G offers a triple rear camera array. Sure, there are technically three image sensors back there, but only one of them is worth caring about. </p><p id=\"aUneic\">There are some minor trade-offs to be aware of, too, like the fact that the phone doesn’t shoot 4K video and has a low-grade built-in speaker. But overall phone performance is a strength, along with a good OLED screen in a category stacked with mediocre LCD panels. Those are important things to get right, and the N20 does just that.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/z_vJnK3EsRR8Y8OIKywuKo4grww=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418317/ajohnson_220425_5165_0002.jpg\">      <figcaption><em>There’s no fast refresh rate, but the 1080p OLED on the N20 is a standout in the budget class.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"dQXQ6c\">One of the N20 5G’s standout specs is its 6.43-inch 1080p OLED with a standard 60Hz refresh rate. More expensive phones offer contrast-rich OLEDs <em>and</em> faster refresh rates, but a budget phone can’t have both — at least not right now. While other manufacturers like Samsung and Motorola have opted for lower-contrast LCDs that offer higher 90Hz refresh rates, OnePlus went the other way with the N20 and skipped the fast refresh rate to offer an OLED.</p><p id=\"DAIFnR\">The difference in refresh speeds is really only something you’ll notice if you’re coming from a phone with a fast refresh rate screen. Animations will look just a little bit choppier compared to the smooth motion of a 90Hz or 120Hz display. But for everything else, this OLED panel is just nicer to look at than a mediocre LCD. Colors look a little punchier, and watching video is more enjoyable, especially when it’s something with a lot of dimly lit scenes (looking at you, <em>The Batman</em>). I think this is a trade-off a lot of people can appreciate.</p><p id=\"dZGoS5\">The screen’s 1080p resolution is above average, too, since 720p is more common in the budget class. For a screen this big, you really do need that higher resolution to keep images looking sharp. This isn’t the brightest OLED I’ve used, but it does get bright enough to be usable in direct sunlight. </p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yF9Z_A9QsWFrzV7pFw5Gye-BYy8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418319/ajohnson_220425_5165_0004.jpg\">      <figcaption><em>The N20’s in-display fingerprint sensor is a rarity in the budget class.</em></figcaption>  </figure></div><p id=\"4D4fiT\">One of the N20’s best features is embedded in that display: a fingerprint sensor — a <em>good</em> in-display fingerprint sensor. It’s quick and reliable even with wet fingers or outside in bright sunlight. A flaky fingerprint reader is an annoying thing to have to deal with a hundred times per day, and a good in-display sensor in a phone under $300 is very uncommon. </p><p id=\"73XYFs\">The Nord N20 5G uses a midrange Snapdragon 695 5G chipset, which is a cut above the budget-level 400-series Snapdragons and 700-series MediaTek chips commonly found in this class. It’s also paired with 6GB of RAM, another improvement over the 4GB more typical of budget phones. </p><p id=\"o9qQPA\">These are great specs for a $300 phone, and the N20’s performance reflects that. It runs graphics intensive games like <em>Genshin Impact </em>reasonably well (with some noticeable stuttering but nothing that impacted gameplay). In day-to-day use, jumping from app to app is quick, and I’m rarely left waiting for the phone to catch up as I switch from scrolling Instagram to typing an email or taking a picture. I do notice apps closing in the background but not to the point that it’s bothersome. Turning high-performance mode on seems to help a bit but doesn’t totally solve the problem.</p><p id=\"fhw3ZD\">There’s just one downward firing built-in speaker on the N20 5G, and it’s really easy to cover with your finger when holding the phone. It’s also just not a good speaker. But you can’t have everything on a budget phone, and this seems like a reasonable trade-off.</p><div><aside id=\"2EiKSn\"><q>I’m rarely left waiting for the phone to catch up as I switch from scrolling Instagram to typing an email</q></aside></div><p id=\"aUlDgt\">The N20 includes a healthy 128GB of built-in storage, which can be expanded by way of the microSD card slot. There’s also a real, live headphone jack on this phone, and it ships with a fast charger in the box. That completes the trifecta of features that are quickly disappearing from flagship and midrange phones but that you can still find in the budget class. </p><p id=\"r0OCyL\">OnePlus’ trademark fast charging (with Oppo’s SuperVOOC branding) is included in the N20 5G, and it’s another standout feature in the under-$300 class. The phone supports 33W wired charging with the included charger (but, unsurprisingly, no wireless charging). With the phone powered off and the battery completely depleted, it charged up to 30 percent in a mere 20 minutes. In total, the phone charged from flat to 100 percent in an hour and 15 minutes in my testing — at least 15 minutes faster than the typical budget phone. Most of the time, you can get to a very usable 90 percent much sooner, as charging slows down considerably for the last 10 percent of battery.</p><p id=\"BSIkGj\">The N20’s 4500mAh battery isn’t the biggest in the class, but it does power the phone through a full day of use — even heavy use. With the always-on display and high-performance mode enabled, a mix of Wi-Fi and 5G usage, and some battery-hungry activities mixed in, like downloading and playing 20 minutes of <em>Genshin Impact,</em> I’ve gotten close to 3.5 hours of screen-on time in the last 24 hours and I’m down to 20 percent battery. Based on those numbers, it’s fair to say that the N20 5G will easily get a light or moderate user through a full day of use.</p><div class=\"c-float-right c-float-hang\"><aside id=\"DgpijG\"><q>With the phone powered off and the battery completely depleted, it charged up to 30 percent in a mere 20 minutes</q></aside></div><p id=\"xDuKd8\">Google <a href=\"https://www.theverge.com/2022/4/26/23042395/android-13-public-beta-media-file-permissions-error-reporting-audio-routing\">has started taking its Android 13 beta public</a>, but the N20 5G is still back on Android 11. OnePlus says it will get an update to Android 12, but it couldn’t give an estimated timeframe for it. In the meantime, OnePlus’ version of Android 11 (and 12 for that matter) is a little more minimalist and a little less whimsical than the Samsung or Google versions. It’s easy to navigate, and there are mercifully few pre-downloaded T-Mobile apps.</p><p id=\"0P7FAX\">OnePlus says that Android 12 will be the only OS platform upgrade for the N20, which is a bummer with the next OS version right around the corner, and that it’s scheduled to receive three years of security updates. Three years of support isn’t the <em>worst</em> policy among Android device makers, but it’s not the best — that honor would go to Samsung, with four or five years of support depending on the phone. I’d love to see OnePlus commit to additional years of software support for its devices, but three years strikes me as sufficient for a lot of people.</p><p id=\"8CoBT6\">When OnePlus introduces an unlocked version of the N20, its story of which 5G bands it supports will get a little more complicated. The n77 C-band frequency, which Verizon and AT&amp;T rely on a lot, isn’t on the spec sheet, for example. So if it does get 5G certification on those carriers, it may only be for the slower might-as-well-be-LTE variety. But for now, the story is simple: the N20 5G supports T-Mobile 5G. While Verizon and AT&amp;T are hurrying to build out their mid-band 5G networks (read: the good 5G) T-Mobile got a big head start years ago when it bought Sprint. Long story short: it’s really good, and it’s good <em>now, </em>not in a year or two. </p><p id=\"hHQgRo\">It’s been a little while since I used a 5G phone on T-Mobile, and I’m seriously impressed by the speeds I saw both at home and out in my neighborhood around T-Mobile’s corporate backyard of Seattle. I’ve been able to pick up T-Mobile’s faster <a href=\"https://www.theverge.com/22914668/5g-uw-uc-icon-meaning-verizon-att-t-mobile\">Ultra Capacity 5G signal</a> fairly often, and I get download speeds of 300–500Mbps when I do. For comparison’s sake, my home Wi-Fi is around 100Mbps on a good day. All this is to say that the N20 is in great shape to take advantage of a very fast network if you happen to live somewhere with good T-Mobile 5G coverage.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cM4ruL1mBvhOiU9USvUhPTx0yZ8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418318/ajohnson_220425_5165_0003.jpg\">      <figcaption><em>Two of the N20’s three rear cameras are of limited usefulness.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"QsTv7e\">There are two large camera modules on the back of the N20 5G, which might lead you to think that there are two important cameras on this phone. There are not. The top camera is a 64-megapixel f/1.8 standard wide, and the module below it is a 2-megapixel macro camera — the same kind of small, low-grade macro camera found on many other budget phones. Its relatively large housing is just window dressing. The third, smaller lens belongs to a 2-megapixel monochrome sensor, which is the only thing more pointless than a tiny macro camera.</p><p id=\"mWJOnL\">The good news is that the 64-megapixel main camera is good. Images taken outdoors in good lighting are pleasant; exposures are balanced, and colors look a little warmer than on Google’s Pixel phones but less saturated than on Samsung’s Galaxy devices. It’s a nice sweet spot. I’m impressed with the 2x digital zoom on this camera, too. In good lighting, details are surprisingly sharp. It’s not a lot of reach, but it’s good enough that I’d use it in a pinch when getting closer to my subject isn’t possible.</p><p id=\"CWymZP\">Images taken indoors in less good lighting can look a little artificially bright, as is common with other OnePlus phones. Night mode has a habit of taking this a step further, with color saturation that tends to look artificial. But given the choice, I’d take just about any night mode <a href=\"https://www.theverge.com/22975531/apple-iphone-se-2022-review-price-specs-screen-battery\">over no night mode</a> at all. </p><div id=\"ERhgUK\"><div data-anthem-component=\"gallery:11164140\"></div></div><p id=\"SM2B51\">The macro camera is about the same as any other smartphone macro camera: very low res and not very useful. To even enable it, you need to tap “more” in the camera app and pick it out of a grid of options where it’s dead last in the third row after “text scanner.” Maybe OnePlus is hoping you won’t find it. I wish this camera were an ultrawide instead.</p><p id=\"hxwoN2\">As for the monochrome sensor, OnePlus quietly phased it out of its flagship phones, but it’s still hanging around here in the budget class. Supposedly, it supplies additional image information when you’re shooting in the black-and-white filter mode. Covering the sensor with my finger produces an image that looks exactly the same as with it uncovered. Counting this sensor as the phone’s third rear camera is definitely a stretch.</p><p id=\"zQJ7pn\">Video, as mentioned above, is limited to a maximum resolution of 1080p. That’s too bad since 4K has really become the standard for high-resolution video. As it is, the 1080p clips are good, if a little noisy in low light. There’s an aggressive crop, but as a trade-off you get some fairly good electronic image stabilization.</p><p id=\"3vbYu9\">No $300 phone is going to take great photos in every situation, but it feels like the N20 5G could do better here. Swapping out the macro and monochrome sensors with even a mediocre ultrawide would have been a worthwhile exchange in my book; at least an ultrawide is tangibly useful. The main camera does fine in the right lighting conditions. It’s just a shame that it’s doing all of the legwork on the N20.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0f9d5a44QG3p3EKvl4NI3S6xRNw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418320/ajohnson_220425_5165_0005.jpg\">      <figcaption><em>The in-box charger and signature red cable help the N20 stand out among $300 phones.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"jTIoA5\">The OnePlus N20 5G is an excellent deal <em>if —</em> these are important “ifs”: you’re on T-Mobile and camera quality isn’t your top priority. If so, it’s just a pleasure to use. The screen is rich and detailed, performance is good, the fingerprint scanner is quick, and wired charging is seriously fast. </p><p id=\"1u2CSv\">In this price bracket, <a href=\"https://www.theverge.com/2021/6/12/22529760/samsung-galaxy-a32-5g-review-price-screen-specs\">the Samsung Galaxy A32 5G</a> is more or less the default recommendation. The N20 doesn’t quite overtake it, but it’s a very worthwhile alternative. The A32 offers an ultrawide in addition to its standard wide camera and shoots 4K video, so it’s a better choice if image quality is a priority. It’s almost a year old at this point, but it’s still scheduled to get three more years of security updates. It’s already getting Android 12, too, so it’s a step ahead on the software side.</p><p class=\"c-end-para\" id=\"jhWlDC\">But the N20 is a better choice if you’re looking for a great screen and a more sophisticated software experience. You’ll also get double the built-in storage and 2GB more RAM than the 64GB / 4GB RAM version of the A32 5G sold in the US. We interact with our phones roughly a million times per day, so it’s worth making sure the device you pick is one that you enjoy using. Personally, I’d find a way to live without an ultrawide camera and pick the N20 over the A32 just based on its enjoyability factor. It’s OnePlus at its finest — delivering an experience that feels like it cost more than it actually did.</p><p id=\"kQVPn6\"><em>Photography by Allison Johnson / The Verge</em></p><div><div id=\"RyKYhv\"><div data-anthem-component=\"aside:11164083\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/9RP_HJXOUcpguMqZrAEYMoBbYQk=/0x182:2040x1250/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23418316/ajohnson_220425_5165_0001.jpg",
  "description": "OnePlus doing what it does best.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}