{
  "title": "OnePlus Nord Buds review: very affordable, perfectly capable",
  "url": "https://www.theverge.com/23130957/oneplus-nord-buds-budget-earbuds-review",
  "date": "2022-05-19T18:05:28.000Z",
  "author": "Chris Welch",
  "content": "  <p>These budget earbuds don’t disappoint for their under $40 price</p> <p class=\"p--has-dropcap p-large-text\" id=\"p0h3V7\">You can’t expect the world from $39 earbuds. After reviewing a series of much pricier products, I’ve spent the last few days trying out the new OnePlus Nord Buds. There’s something unflattering about the name to me; “Nord Buds” sounds like a prop that would’ve been used on <em>Mork &amp; Mindy</em> circa 1979. But it matches the branding of OnePlus’ budget phone lineup, <a href=\"https://www.theverge.com/23123355/oneplus-nord-2t-review\">which has proven to be impressive</a>, so it makes sense for the company to expand the brand to budget earbuds. Regardless, the features and performance of these inexpensive buds are more relevant than what they’re called. </p><p id=\"VfLPDs\">The budget category of wireless earbuds is inundated with options from Skullcandy, JBL, Anker Soundcore, JLab, and countless brands you’ll find on Amazon. Most stick to the basics and aim to deliver a decent fit, sufficient battery life, and a lively, bass-heavy sound profile that can partially mask their underlying audio quality compromises. With the Nord Buds, OnePlus has checked off pretty much all of these fundamentals. </p><div id=\"TB4AaO\"><div data-anthem-component=\"scorecard:11251750\"></div></div><p id=\"dzrI5P\">They’re comfortable to wear, can last for up to seven hours on a single charge, and their 12.4-millimeter drivers amplify bass and treble enough to make the Nord Buds perfectly enjoyable for uncritical listening. They’re also rated IP55 for dust and water resistance, which is more durable than <a href=\"https://www.theverge.com/23123317/sony-linkbuds-s-earbuds-headphones-review\">what $200 Sony earbuds</a> will give you. OnePlus definitely picks up points there.</p><p id=\"FcsLoG\">Like other companies, OnePlus reserves a few software features exclusively for owners of its own smartphones — but they’re fairly minor in the grand scheme of things. OnePlus phones can take advantage of a low-latency gaming mode and are able to adjust earbud settings, customize controls, and make EQ changes with the built-in Bluetooth menu. If you’ve got an Android phone from a different brand, you can install the <a href=\"https://play.google.com/store/apps/details?id=com.heytap.headset&amp;hl=en_US&amp;gl=US\">HeyMelody</a> app to access the same functions; you’re really only losing out on the low-latency trick in that case. There’s even a <a href=\"https://apps.apple.com/ae/app/heymelody/id1564626893\">HeyMelody app for iPhone</a>, which is admirable when companies like Google and Samsung have abandoned iOS software support for their earbuds. HeyMelody for iPhone hadn’t yet been updated to support the Nord Buds at the time of this review, but that should change soon enough.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4ANHGN9HEFlJABdS1nMq1Vu9mU4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23575038/DSCF8004.jpg\">      <figcaption><em>In the box, you get a USB-A to USB-C cable.</em></figcaption>  </figure></div><p id=\"iowvUb\">The Nord Buds don’t look as cheap as they cost: the earbud piece is glossy, but the outer stem is matte with a circular chrome accent that doubles as the touch surface for controls. The stems are shaped like popsicle sticks, which is enough to make them feel less like AirPod clones than earlier OnePlus earbuds. You get the status quo trio of silicone tip sizes in the box, and the large pair managed to keep them firmly in my ears with a good seal and decent noise isolation. The latter is an important factor, as the Nord Buds don’t include active noise cancellation, so a tight seal is crucial to cut down on outside clamor. Comfort is an area where I’ve got no complaints; the Nord Buds gave me no soreness or irritation after a couple days of using them at length at the coffee shop and office.</p><p id=\"nwTpm6\">These earbuds have a very bass-forward sound that also emphasizes treble frequencies. The highs are raised a little more than I’d like and can come off sharp on an odd track here and there. That’s something you can dial back with the EQ adjustments on Android, and you’ll probably want to bring up the mids while doing so. The Nord Buds aren’t shy about their <a href=\"https://en.wikipedia.org/wiki/Smiley_face_curve\">smiley face EQ curve</a>, but they still make for pleasant listening. You might be under the assumption that $39 earbuds would sound muffled or indistinct, but the Nord Buds manage to overdeliver in this regard. They lack the fidelity, presence, and detailed soundstage of earbuds in the premium bracket, but if you told me I’d be stuck with these for a few weeks, I wouldn’t be terribly upset about it. That’s a good place for $39 earbuds to be. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UsV8gL3Z24NRIlfZ8tkcSacTBvc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23575040/DSCF8002.jpg\">      <figcaption><em>The Nord Buds are quite comfortable.</em></figcaption>  </figure><p id=\"G9mB9s\">The no-frills, matte charging case for the Nord Buds avoids any flimsiness; its pill-shaped lid has a sturdy mechanism and no annoying wiggle. But the case is on the taller side. No matter which way you slide it into a pocket, there’s going to be some bulge. Hopefully OnePlus can shave off some millimeters next time. The magnets do a competent job of holding the earbuds in place, though you can shake them loose with some force. The case charges over USB-C, and to absolutely no one’s surprise considering the $39 asking price, there’s no wireless charging on offer. But, on the plus side, it charges quickly. OnePlus claims you can get five hours of playback after just 10 minutes of charging time. </p><p id=\"Ozul4q\">OnePlus says the Nord Buds can hit up to seven hours of continuous playback, and my time with them so far hasn’t given me reason to question that estimate. The case will get you another 30 hours of total listening time.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/r7hQALykMETHG4G4sTDajQHkGjM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23575041/DSCF8012.jpg\">      <figcaption><em>The earbuds can last for up to seven hours on a charge.</em></figcaption>  </figure></div><p id=\"lh6CPZ\">There’s got to be a consequential downside <em>somewhere</em> for $39 earbuds, right? Of course there is, and with the Nord Buds, that weakness is mic performance. You’re just not going to want to use these for voice calls or Zoom meetings. They’re not competent at the task, with people reporting that my voice sounded garbled and hard to make out on test calls if I was anywhere with even moderate background noise. It’s also disappointing that while the Nord Buds support OnePlus’ proprietary quick pair, they don’t take advantage of Google’s Fast Pair for instant setup with many other Android phones.</p><div><div id=\"kZr1w2\"><div data-anthem-component=\"aside:11251725\"></div></div></div><p class=\"c-end-para\" id=\"mpex4u\">But those are really the only failures on the Nord Buds report card. Their Bluetooth 5.2 connection has been reliable, and the earbuds never got in the way or exhibited frustrating bugs over several days of use. They cover the basics admirably, are a solid budget effort, and lend more credibility to the Nord lineup. Even if the Nord Buds end up mainly appealing to the OnePlus faithful, they’re a good value at 39 bucks that, <a href=\"https://www.theverge.com/23044768/oneplus-nord-n20-5g-review-price-screen-specs-camera-battery\">in the words of my colleague Allison Johnson</a>, can make you feel like you’re getting away with something — just like other Nord hardware. And even if I have the urge to say “nanu nanu” every time I mention their name.</p><p id=\"zkGYl2\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/JgqCYKykOUJ4FlNa1m7eAvumIJY=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23575042/DSCF8022.jpg",
  "description": "Budget buds that don’t skimp on sound.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}