{
  "title": "OnePlus’ Nord Buds wireless earbuds promise long battery life and Dolby Atmos for $40",
  "url": "https://www.theverge.com/2022/5/12/23067798/oneplus-nord-buds-wireless-earbuds",
  "date": "2022-05-12T10:00:00.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/v8Vv44lGKneC1ULnEIhMdd3RAXc=/0x171:8500x5838/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70860012/OnePlus_Nord_Buds.0.jpeg\" />    </figure>  <p id=\"JYJfqL\">OnePlus’ latest set of wireless earbuds is also the first to get its Nord branding, which the company uses for its cheaper products. The new Nord Buds are being announced today alongside teases for <a href=\"https://forums.oneplus.com/threads/eu-launch-event-are-you-ready-to-live-fast.1581662/\">two new entries to OnePlus’ European Nord smartphone lineup</a>: the Nord 2T 5G, and the Nord CE 2 Lite 5G. </p><p id=\"TrAsk6\">The Nord Buds actually have a fair amount going for them, even at $39.99. They don’t have active noise cancellation, and they only have two mics in each stem rather than three like the <a href=\"https://www.theverge.com/2021/12/16/22839608/oneplus-buds-z2-price-release-date-true-wireless-earbuds-features-battery-life\">$99 Buds Z2</a>, but they’re rated for the same seven hours of battery life (38 hours combined with the case), and promise the same low latency — especially when connected to a OnePlus phone with ProGaming mode on — and fast charging. </p><p id=\"5Y5R1X\">The Nord Buds also have 12.4mm drivers, Dolby Atmos support, “AI powered noise reduction algorithms” for phone calls, and a new design OnePlus says makes them even more comfortable for long listening sessions.</p><p id=\"wTQxjy\">One way to think about it is the Nord Buds are the AirPods to the Buds Z2’s AirPods Pro. (Which I guess makes the $150 Buds Pro, which also add wireless charging and adaptive noise cancellation, the AirPods Max? This isn’t a perfect analogy.) The Nord Buds are meant to be the entry-level model in the lineup, though now that you can buy <a href=\"https://www.theverge.com/2020/10/14/21515636/oneplus-buds-z-earbuds-announced-features-price\">the last-generation Buds Z</a> for the same price, the OnePlus catalog is starting to get a bit confusing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uNgkXObjhDjG8bCLwSQMLpcdTj4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23455331/image001_2.jpg\">      <cite>Image: OnePlus</cite>      <figcaption><em>A teaser image for OnePlus’ upcoming European Nord smartphone launch.</em></figcaption>  </figure><p id=\"Mqew1T\">And that’s just when it comes to wireless earbuds. OnePlus is also pre-announcing two new Nord smartphones for the European market today — the OnePlus Nord 2T 5G, and the OnePlus Nord CE 2 Lite 5G. The Nord 2T is meant as a spec bump to <a href=\"https://www.theverge.com/22586815/oneplus-nord-2-5g-review-specs-price-camera-screen\">last year’s Nord 2</a>, and now features 80W fast-charging, up from 65W last time. Meanwhile the Nord CE 2 Lite is being pitched as a step-down model compared to the Nord CE 2, which was <em>itself</em> a step down from the Nord 2 (it’s ok to be confused). OnePlus plans to properly launch both phones on May 19th, when we can expect pricing and release date information. </p><p id=\"CWeA1t\">While OnePlus is still mostly known as a phone brand, its headphones tend to outshine their price. The Verge’s Chris Welch <a href=\"https://www.theverge.com/2021/8/23/22637548/oneplus-buds-pro-review-specs-price-features\">found the Buds Pro</a> both comfortable to wear and impressive in their audio quality, and they’ve earned a spot on our list of <a href=\"https://www.theverge.com/21309820/best-wireless-earbuds\">the best wireless earbuds you can buy</a>.</p><p id=\"PTa1xB\">In general, we’re seeing a huge drop in the cost of a pair of half-decent wireless earbuds. While it seems unlikely the Nord Buds will best some of the higher-end models on the market, and even competing with slightly more expensive models like the Jabra Elite 3 is a big ask, it wasn’t that long ago that $100 was the bare minimum for a decent pair. It’s encouraging to see that price dip all the way down to $40. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RCRQrpCXAPu7miBxiFSq-h2nZJo=/0x779:8500x5229/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23454607/OnePlus_Nord_Buds.jpeg",
  "description": "Fast charging, long battery life, and sadly no noise cancellation",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}