{
  "title": "OnePlus 10 Pro review: settling in",
  "url": "https://www.theverge.com/23003212/oneplus-10-pro-review-screen-price-specs-battery",
  "date": "2022-04-14T21:12:11.000Z",
  "author": "Allison Johnson",
  "content": "  <p>It’s a likable device, but OnePlus still has some work to do</p> <p class=\"p--has-dropcap p-large-text\" id=\"gC62MH\">The 10 Pro is OnePlus all grown up. The days of a scrappy upstart challenger are gone — that much was clear with last year’s 9 and 9 Pro, with true flagship specs and prices to match. </p><p id=\"ek7IAE\">This year, OnePlus has sharpened its vision of a legitimate flagship phone to challenge the big brands, and the result is a sophisticated, sleek device. It’s not just a cheaper flagship; it’s a real alternative to Samsung and Google, with an identity all its own.</p><p id=\"8GCZOK\">That’s not to say that OnePlus has entirely closed the gap between itself and the big Android brands. The 10 Pro’s $899 price makes more sense than last year’s $1,069 9 Pro. (There was a less expensive version, but it never came to the US.) But at the same price, there are good reasons to consider the Pixel 6 Pro or the $999 Galaxy S22 Plus over the 10 Pro. OnePlus has some work to do to catch up to those competitors in the camera department, for one. And it still hasn’t worked things out with AT&amp;T, so there’s no support for that carrier’s 5G network — just 4G. </p><div id=\"sE0z9W\"><div data-anthem-component=\"scorecard:11121170\"></div></div><p id=\"YvKPE6\">Those are some major considerations, and they keep me from freely recommending the 10 Pro to just anyone looking for a premium Android phone. But I’m encouraged by the direction the company is taking with the 10 Pro, and if this is indeed the new OnePlus, I like where it’s headed.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/E2O9zZJSaavSldxWDXPaQaJAh7o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23337239/ajohnson_220321_5096_0004.jpg\">      <figcaption><em>The 10 Pro’s 6.7-inch screen is a little taller than the competition and offers a fast 120Hz refresh rate.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"EBvUba\">With a 6.7-inch screen, the OnePlus 10 Pro is no doubt a big phone. It features a 1440p LTPO OLED panel that’s gently curved on the long edges. Its 20:9 aspect ratio is a hair taller than the S22 Plus and Pixel 6 Pro’s displays, and it matches their top refresh rate of 120Hz. Side by side, I can see that the display doesn’t get quite as searingly bright as the Galaxy S22 Plus’ when they’re both exposed to direct sunlight, but it’s bright enough to use comfortably, even outdoors.</p><p id=\"CBRN5b\">The 10 Pro features an aluminum frame along with Gorilla Glass Victus on the front and Gorilla Glass 5 on the back panel. OnePlus took a page out of Samsung’s book and blended the metallic camera bump housing into the side rails of the phone, and it’s a good look. They may be cribbing someone else’s work, but at least it’s one of the smart kids in the class. </p><p id=\"NV9pt9\">OnePlus is doing that thing again where the carrier version of the phone — only sold through T-Mobile in the US — has an IP68 rating, but the unlocked version doesn’t. OnePlus says there’s no build quality difference between the unlocked phone and the one on T-Mobile’s shelves. Do with that information what you will.</p><p id=\"sCI4h8\">The physical size differences between the 10 Pro and any other big flagship Android phone are small — just a few millimeters in either direction, depending on what device you’re comparing it to. That said, it feels a little sleeker and easier to handle, owing partly to that taller screen. It’s easier for me to wield than the Pixel 6 Pro, which just feels needlessly chunky the more I use it. The 10 Pro’s in-display optical fingerprint sensor is fast and responsive, too, which is an advantage versus the Pixel’s slow fingerprint scanner. All around, it’s an enjoyable phone to carry and use, even for this small phone fan.</p><div><aside id=\"73G0AO\"><q>The 10 Pro’s in-display optical fingerprint sensor is fast and responsive</q></aside></div><p id=\"5Z7c7u\">The OnePlus 10 Pro uses this year’s top Qualcomm chipset, the Snapdragon 8 Gen 1. At launch, the only variant sold in North America will be the 128GB version with 8GB of RAM — OnePlus says its 256GB / 12GB RAM will be available in the US at a later date. These specs offer plenty of processing power for day-to-day tasks. I noticed some very occasional stutters with heavier tasks like playing <em>Genshin Impact</em>, but for all intents and purposes, this is a speedy device that delivers flagship-level performance. </p><p id=\"01EWOp\">Like any other 2022 flagship phone, the 10 Pro offers 5G connectivity. It’s just sub-6GHz 5G, no super-fast millimeter wave (mmWave), which isn’t a problem for the vast majority of people. There’s full low- and mid-band 5G support on T-Mobile and Verizon, but the 10 Pro doesn’t work on AT&amp;T’s 5G network, and there’s no plan to add support for it at a later date. That means the phone will be stuck on 4G even as AT&amp;T lights up new mid-band spectrum over the next couple of years that should make a big improvement to its 5G speeds. The Galaxy S22 Plus and Pixel 6 Pro both offer full 5G support on all three major carriers with no caveats, so that’s a substantial miss for the 10 Pro, especially if you’re hoping to use it on AT&amp;T.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/96JQY3Y1infQLhu0UHS4vi2rHi4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23337238/ajohnson_220321_5096_0003.jpg\">      <figcaption><em>The 10 Pro’s big 5,000mAh battery easily lasts a day with moderate use.</em></figcaption>  </figure></div><p id=\"AKBCub\">The 10 Pro includes a big 5,000mAh battery that, in my experience, easily gets me through a day of moderate (and even some heavy) use. Using the Galaxy S22 Plus, I felt like I had to keep an eye on my battery percentage and was down into the single digits by the end of the day. That’s not the case with the 10 Pro, though I will qualify that claim by saying that, since I’m on Verizon, I wasn’t able to test it on 5G for this review. Prior to its on-sale date, the 10 Pro wasn’t certified to use Verizon 5G — just 4G — but <a href=\"https://www.theverge.com/2022/4/14/23025473/oneplus-10-pro-verizon-5g-uw-c-band\">that has since changed</a>. </p><p id=\"S8DL5x\">I <em>did </em>enable every battery-draining setting I could think of, including the phone’s high-performance mode, 1440p screen resolution, Always on Display enabled, and the fastest screen refresh rate available. Even on a day mostly spent off of Wi-Fi, with some 4K video recording and navigation in the mix, I never ended up in uncomfortably low battery percentages.</p><div class=\"c-float-left c-float-hang\"><aside id=\"UAIKOT\"><q>At no point while I was testing this phone did I wish that it would charge faster</q></aside></div><p id=\"XvXSaJ\">There’s more good news on the battery front: the OnePlus 10 Pro supports fast charging, and there’s a fast charger provided right in the box. You definitely won’t get that with a Samsung or Google phone. In the US, the phone supports 65W charging, while other regions can charge at up to 80W. OnePlus says that this only accounts for a two-minute difference in the total time it takes to charge the phone, and realistically, 65W is plenty fast — just over 30 minutes to bring the battery from 0 to 100 percent. At no point while I was testing this phone did I wish that it would charge faster. </p><p id=\"7kZOg2\">All this is to say, you probably won’t need to recharge the 10 Pro in the middle of the day unless you spend a lot of time gaming or streaming video. But if you do need to top the battery off, you’ll be able to do so quickly and without having to spend another $30–$50 to get a fast charger.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wrdbBkCzdGDyQL8mc7vwTA0eJko=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23355545/shelf.jpg\">      <figcaption><em>The Shelf now features a system-wide search feature called Scout.</em></figcaption>  </figure></div><p id=\"FMnjEE\">The 10 Pro ships with OnePlus’ version of Android 12. It <a href=\"https://www.theverge.com/2021/12/10/22828553/oneplus-buggy-oxygenos-android-12-update-9-pro\">got off to a rough start when it was released for the 9 and 9 Pro</a>, but the launch bugs seem to have been resolved, and I haven’t noticed any significant issues. The Shelf is back — that’s a home screen page where you can put your widgets and an inspirational message / daily affirmation / <a href=\"https://www.imdb.com/title/tt0117998/\">quote from a ’90s disaster movie</a>. It now features OnePlus’ search feature called Scout, which is similar to Spotlight on the iPhone. It’s not <em>new</em> new, but this is the first time the feature has appeared in a phone sold in the US. It’s a nice way to quickly find contacts, apps, and settings without scrolling through menu pages. </p><p id=\"ZRj4c3\">I’ve seen other device makers embrace Android 12’s focus on interface customization, but OnePlus doesn’t seem as keen on it. With a Pixel or Galaxy phone running Android 12, you can choose a color palette inspired by your wallpaper to apply to system-wide controls and app icons. OnePlus offers a fair amount of personalization options, but they’re a little more limited, and they all have more of a “OnePlus” flavor to them. You can have the phone sample colors from a photo in your camera gallery and apply them to a stylized, graphic wallpaper. It’s neat but a decidedly different vibe — one that’s a little more grown up and a little less playful.</p><p id=\"dHSJsM\">OnePlus has boosted its support policy to provide three major OS updates and four years of security updates for the 10 Pro. That’s not as good as what Samsung and Google offer, but it’s getting closer. Google also promises three major OS updates for its own devices but has extended security support to up to five years. Samsung still offers the best support among Android device makers, with four years of OS upgrades and five years of security updates. OnePlus isn’t matching that, but it’s taking a step in the right direction.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nBV1u2lAfCIx_tkmer2yQM-t8-8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23337241/ajohnson_220321_5096_0006.jpg\">      <figcaption><em>There are three rear cameras on the 10 Pro, and they’re broadly the same as last year’s.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"RCezdj\">There are three rear cameras on the 10 Pro. The fourth cutout on the camera bump belongs to the flash, not a silly monochrome sensor or something like that, thank goodness. There haven’t been any major updates to the rear camera hardware compared to the 9 Pro, but the selfie camera is upgraded with double the resolution.</p><ul><li id=\"lSR1lk\">Main: 48-megapixels f/1.8 with OIS</li><li id=\"GSVcg7\">Ultrawide: 50-megapixel f/2.2</li><li id=\"G0kTAD\">Telephoto: 8-megapixel f/2.4 with OIS</li><li id=\"IxDg2n\">Front: 32-megapixel, fixed focus</li></ul><p id=\"VWYo1T\">This isn’t exactly the same camera system as last year, and there are some software-based improvements. There’s now an option to shoot in HEIF (High Efficiency Image Format), a compressed still photo format with 10-bit color that Apple has also adopted. It’s not on by default, but you can enable it for all three rear cameras. Provided you’re viewing a HEIF image on a display that supports it, you’ll see a subtle improvement in the range of color it can reproduce compared to a standard 8-bit JPEG. The 10 Pro can shoot 8K video at 24p, albeit with a fairly heavy crop, and offers 4K shooting up to 120p for slow motion.</p><p id=\"5YrCVc\">OnePlus has introduced a new RAW shooting mode, too, called RAW Plus, which is accessible in the camera app’s Pro mode. It’s a computational RAW mode, like Apple’s ProRAW and Samsung’s Expert RAW. Unlike standard RAW shooting, computational RAW modes include data from multiple frames to give you a final RAW image with more flexibility for post-processing. </p><p id=\"NQBve3\">I’m glad to see it on the 10 Pro, though in the limited testing I’ve been able to do with it, I’m not seeing the noticeable improvements over standard RAW shooting that I saw using Samsung’s version. The RAW Plus file sizes aren’t substantially bigger than the standard RAWs either, which leads me to believe it’s not compiling a lot more information into that computational RAW file. Maybe this feature is a work in progress. In any case, RAW Plus gives you standard DNG files, so you can tinker with them in any RAW processing software like Lightroom or an app like Snapseed.</p><div id=\"ceuv0t\"><div data-anthem-component=\"gallery:11121228\"></div></div><p id=\"yj7gAn\">There are a few more additions to the camera feature set, including three new color filters called Master Styles named for Hasselblad ambassadors, a long exposure mode, and manual exposure controls for video recording. OnePlus has also tweaked its image processing for noise reduction and dynamic range.</p><p id=\"FvikRq\">This list of updates is frankly a little underwhelming, especially considering that OnePlus’ camera capabilities were already lagging behind that of Samsung and Google. Samsung’s phones now produce some of the best portrait mode photos from any phone, and Google just updated its very good Pixel camera system with all-new hardware. The images I’ve taken with the 10 Pro are good, and the ultrawide camera is still better than most, but I can’t say I’m impressed otherwise. </p><p id=\"rbTaCt\">Night mode photos are weirdly over-brightened, and the camera sometimes has a tendency to overexpose images, even in moderate indoor lighting. Portrait mode photos look okay, but side by side with the S22 Plus, it’s obvious how much further ahead Samsung is. I hope OnePlus will put a little more effort into the next iteration of its camera rather than relying so much on its Hasselblad partnership to do the leg work.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/J7Ddm71YHxyRQtwduyhhlHOH8lU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23337240/ajohnson_220321_5096_0005.jpg\">      <figcaption><em>A minimalist vibe and sleek software make the OnePlus 10 Pro a likable device.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"iMn0xo\">There are a lot of things I like about the OnePlus 10 Pro, starting with the day-to-day experience of using the phone. It just <em>looks</em> nice. Its software is nice. It isn’t fussy or loaded with a lot of apps I don’t need. It’s pleasant to use, like a phone should be.</p><p id=\"0sJHia\">OnePlus has taken another step in the evolution of its flagship offerings, and it’s a good one. This feels like a device that knows what it is and who it’s for, more so than the 9 and 9 Pro. But it’s tough to recommend this phone when the Pixel 6 Pro is right there, at the same price, with full 5G support on every carrier and a much better camera system. The Galaxy S22 Plus is a little more expensive, but it also has a better camera system, broader 5G support, and will get an additional year of OS upgrades, so that extra $100 might be money well spent in the long run.</p><div><aside id=\"06xvMP\"><q>It’s tough to recommend this phone when the Pixel 6 Pro is right there</q></aside></div><p class=\"c-end-para\" id=\"4M1UCw\">Camera quality and 5G compatibility are likely major considerations for someone buying a premium Android phone in 2022, so it’s a shame that the OnePlus doesn’t measure up in those categories. But there’s a likability factor, too. And depending on your priorities, that might be more important than taking better portrait mode photos. The new OnePlus has some more work to do, but it definitely knows how to make a likable phone that feels one of a kind.</p><p id=\"zeMTcY\"><em>Photography by Allison Johnson / The Verge</em></p><p id=\"tvEE3L\"><em><strong>Update April 14th, 5:00PM ET:</strong></em><em> </em><a href=\"https://www.theverge.com/2022/4/14/23025473/oneplus-10-pro-verizon-5g-uw-c-band\"><em>Verizon has certified the OnePlus 10 Pro</em></a><em> to use its 5G network. The review has been updated with this information.</em></p><div><div id=\"75gosd\"><div data-anthem-component=\"aside:11121248\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/fjmCNH9Mvj9WOibzjg9URUDZGmE=/0x229:2040x1297/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23337236/ajohnson_220321_5096_0001.jpg",
  "description": "The new OnePlus is headed in the right direction.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}