{
  "title": "OnePlus Nord 2T review: minor improvements to a masterful midranger",
  "url": "https://www.theverge.com/23123355/oneplus-nord-2t-review",
  "date": "2022-05-19T14:20:00.000Z",
  "author": "Jon Porter",
  "content": "  <p>Another reliable entry in OnePlus’ Nord range</p> <p class=\"p--has-dropcap p-large-text\" id=\"J9dOAS\">In 2022, there are two radically different sides to Oppo’s sub-brand OnePlus. On the premium end, it has the <a href=\"https://www.theverge.com/23003212/oneplus-10-pro-review-screen-price-specs-battery\">OnePlus 10 Pro</a>: a flagship-priced, flagship-specced handset that struggles to offer truly flagship-level performance. But things are going a lot better for its Nord lineup, whose few shortcomings are justified by their midrange price tags.</p><p id=\"69LnvJ\">OnePlus’ latest Nord device for Europe is the OnePlus Nord 2T. It’s priced starting at £369 (€399, around $458) for a version with 8GB of RAM and 128GB of storage and rising to £469 (€499, around $582) for 12GB of RAM and 256GB of storage (the model I’ve been using). It’s a device that plays to OnePlus’ usual strengths with speedy 80W fast-charging, a colorful 90Hz OLED display, and a physical alert slider switch for hopping into silent and vibrate modes. </p><p id=\"1fnuDd\">The changes are minor compared to last year’s <a href=\"https://www.theverge.com/22586815/oneplus-nord-2-5g-review-specs-price-camera-screen\">OnePlus Nord 2</a>. But with a £30 lower starting price, it’s hard to complain about what’s on offer here. In the UK, the OnePlus Nord 2T is available to preorder from today and will ship on May 24th.</p><div id=\"TjHgpw\"><div data-anthem-component=\"scorecard:11243763\"></div></div><p id=\"AVeArD\">OnePlus’ Nord lineup has quickly gotten crowded and complicated since its debut just two years ago, and it now roughly consists of two groups of phones: one for Europe and India, and another for North America. The Nord 2T sits in the former category and is best thought of as a souped-up version of last year’s Nord 2 (similar to what the <a href=\"https://www.theverge.com/21514174/oneplus-8t-review\">OnePlus 8T</a> was compared to the <a href=\"https://www.theverge.com/2020/4/14/21219278/oneplus-8-review-specs-features-camera-battery-screen-price-photos-video\">OnePlus 8</a> or the <a href=\"https://www.theverge.com/2019/9/26/20881638/oneplus-7t-review-specs-features-price-availability\">OnePlus 7T</a> to the <a href=\"https://www.theverge.com/circuitbreaker/2019/5/29/18642345/oneplus7-review-price-release-date\">7</a>). I asked OnePlus whether we’ll see a Nord 3 this year, but it wasn’t willing to divulge its unannounced product roadmap. So the 2T is effectively the European Nord flagship for now.</p><p id=\"sXArhu\">So, if the Nord 2T is a spec-bumped Nord 2, then which specs have actually been bumped? </p><p id=\"0hJcrv\">From the front, it doesn’t look like much has changed at all. The 90Hz 1080p OLED display is still exactly 6.43 inches in size, and there’s still a small hole-punch notch in the top left with a 32-megapixel selfie camera behind it. And while the rear of the device may look different — with a strange combination of two camera circles containing three sensors — the specs of these cameras are exactly the same as the last time around. </p><p id=\"IxT9Ts\">I like the OnePlus Nord 2T’s screen. It feels nice and slick thanks to its 90Hz refresh rate, which is plenty fast for ordinary phone tasks like scrolling through social media feeds. Whites are bright, colors are nice, and blacks are black — it’s an OLED panel after all. An in-display fingerprint sensor handles biometric security quickly and reliably.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fIQRQF_GKwA9cT751QYYb2FURXc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23522034/jporter_220516_5224_0003.jpg\">      <figcaption><em>The finish on the gray model is oddly slippery.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8njmiKwkp6gLNhQNeukyQH2Pxfw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23522039/jporter_220516_5224_0008.jpg\">      <figcaption><em>USB-C — but no headphone jack.</em></figcaption>  </figure></div></div></div><p id=\"cyLceq\">Sound is less impressive. Although the Nord 2T puts out sound in stereo, it’s using a downward-firing speaker on one side and its earpiece for the other. The result is empty and hollow sounding, even if it’s able to get loud at maximum volume. There’s no headphone jack here, just like last time, and no official IP rating for dust and water resistance.</p><p id=\"RNsH6w\">While I think the Nord 2T strikes a nice balance between having a large screen in a thin and light form factor, I don’t love the finish on the gray model. There’s nothing wrong with a phone at this price point having this design in theory (Gorilla Glass 5 on its front and back with a plastic frame around the sides). But, in practice, the finish on my review sample is incredibly slippery in the hand. This won’t matter if you use the transparent case that OnePlus includes in the box, but it could be annoying for all of you Never Casers out there. In contrast, it looks like the green version of the 2T has a more standard glossy finish that I’ve had less of a problem with in the past, but I haven’t been able to use it in person. </p><div class=\"c-float-right c-float-hang\"><aside id=\"pkXSHl\"><q>From zero to 100 percent charged in under 30 minutes</q></aside></div><p id=\"pGEham\">One obvious spec that’s been bumped is the phone’s processor, but, in practice, its benefits seemed to relate more to battery life than raw performance. The OnePlus Nord 2T uses a MediaTek Dimensity 1300 processor, which is a step up from the Dimensity 1200-AI used in the Nord 2. It has a more power-efficient design, and it averaged a little under six hours of screen-on time between charges, up from around five hours last time — despite having the same-sized 4,500mAh battery. I would typically put the Nord 2T on to charge at the end of the day with upwards of 40 percent of its battery remaining.</p><p id=\"AmJITp\">Charging speeds are an easy spec improvement to point toward, but the differences in practice are less than you might expect. The Nord 2T now supports 80W SuperVOOC wired charging, up from 65W last time around, and you still get the charger in the box. I was able to charge the Nord 2T from zero to 63 percent in 15 minutes and to 100 percent in just under half an hour. For comparison, last year, I could charge the Nord 2 from zero to 99 percent in 35 minutes — not a whole lot slower. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZHzCd25KFF0feVusFaMqnngNu3E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23522038/jporter_220516_5224_0007.jpg\">      <figcaption><em>With its 6.43-inch screen, the Nord 2T is firmly medium-sized.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ELWAhe90a3RhKg-mx8rijrnUdak=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23522033/jporter_220516_5224_0002.jpg\">      <figcaption><em>OxygenOS continues to be a nice clean take on Android.</em></figcaption>  </figure></div></div></div><p id=\"esHzVF\">The Nord 2T ships with OxygenOS 12.1, based on Android 12, and the company is promising two major Android updates and three years of security updates. That’s not terrible, but it’s a little less than what we’re seeing from the likes of Google, Samsung, and Apple these days: <a href=\"https://www.theverge.com/2021/10/19/22735485/google-pixel-6-three-years-android-updates-security-feature\">five years</a>, <a href=\"https://news.samsung.com/global/samsung-sets-the-new-standard-with-four-generations-of-os-upgrades-to-ensure-the-most-up-to-date-and-more-secure-galaxy-experience\">five years</a>, and <a href=\"https://www.theverge.com/2021/6/8/22523351/ios-15-iphone-6s-plus-se-compatibility\">six years</a> of security updates, respectively. If your hope is to use your midrange phone for as long as possible, an <a href=\"https://www.theverge.com/22975531/apple-iphone-se-2022-review-price-specs-screen-battery\">iPhone SE</a> or Google’s forthcoming <a href=\"https://www.theverge.com/2022/5/11/23064495/google-pixel-6a-price-specs-screen-tensor-io\">Pixel 6A</a> might be a better choice. </p><p id=\"xspwLv\">I continue to like OxygenOS’s take on Android. It feels crisp and clean, and the features it offers on top of regular Android (such as its <a href=\"https://forums.oneplus.com/threads/software-feature-reveal-optimized-charging.1161761/\">Optimized Charging feature</a>, which stops your phone from idling at 100 percent charge for long periods when charging overnight) are helpful without ever getting in the way. Most importantly, it’s nice and responsive to use.</p><div class=\"c-float-left c-float-hang\"><aside id=\"QvC8Lm\"><q>One useful and two unnecessary rear cameras</q></aside></div><p id=\"VVrnlq\">The camera setup of the Nord 2T won’t surprise anyone familiar with its predecessor. Around back, there’s a trio of cameras: a 50-megapixel main, an 8-megapixel ultrawide, and a 2-megapixel monochrome sensor for black and white shots. And no, I also have no idea why OnePlus continues to include these near-useless monochrome sensors, especially when the black and white mode is buried within a sub-menu in the camera app. The 32-megapixel selfie camera uses the same hardware as last year. </p><p id=\"5jZ8HV\">The similar hardware means you can expect very similar photography quality here as with the Nord 2. In daylight, the Nord 2T prioritizes a punchy look with plenty of contrast. Shadows and highlights both leap off the screen, and colors are deep and rich (though not overwhelmingly so). Optical image stabilization (OIS) on the main camera makes it relatively easy to get crisp, sharp images of still subjects. Faces look a tad overly sharp and bright from the rear camera, but selfie shots with the lower-resolution 32-megapixel sensor fare a lot better and come out clean and clear.</p><div id=\"VQHjrL\"><div data-anthem-component=\"gallery:11243906\"></div></div><p id=\"VIPWji\">The same can’t be said for the quality of the phone’s ultrawide shots, which are blurry and desaturated in comparison. And the less said about the useless monochrome sensor the better. It’s a shame that smartphones are all expected to have multiple lenses these days because I’d be really curious to see what the camera bump of the Nord 2T would look like with just a single sensor. But I guess a bad quality ultrawide is better than no ultrawide at all.</p><p id=\"EGYXGI\">Even without using the Nord 2T’s night photography mode, the shots you get from the Nord 2T in low light are quite bright, and I like the amount of detail they offer. There seems to be a little bit of smoothing going on to reduce visual noise, but I can’t argue with the overall effect, and faces end up looking clear and relatively natural. Just don’t expect much from the ultrawide camera in the dark, where detail completely falls apart. </p><p id=\"T29Euz\">On the video side, the Nord 2T can shoot up to 4K at 30fps or 1080p at 60fps. But in practice, the footage the phone is capable of capturing is average, and, despite OnePlus claiming it can shoot in HDR, its dynamic range isn’t great. With accurate colors and reliable focus, it’s not terrible, but it’s also not anything special. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HyTAfg_U7RzGuEgpRUJ2nwFxLHQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23522035/jporter_220516_5224_0004.jpg\">      <figcaption><em>Two camera circles, three camera sensors.<span class=\"ql-cursor\">﻿</span></em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jgecsb7FlixVzUzIu3qaKThGIi8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23522040/jporter_220516_5224_0009.jpg\">      <figcaption><em>An alert slider lets you easily put the phone on silent or vibrate.</em></figcaption>  </figure></div></div></div><p id=\"vOz4i9\">With a starting price of £369, it’s easy to forgive the Nord 2T’s few issues. This is a phone that is slim in the hand, feels fast to use, and has a screen that looks great to boot. Battery life is good, charging speeds are better, and the phone feels like a cohesive package. </p><p id=\"rDuaUx\">In typical OnePlus fashion, the only real thing you’re compromising on with the Nord 2T is camera quality, and it might be worth holding out for the upcoming Pixel 6A if that’s your priority on a midrange device. And, regardless of camera quality, doing so will also get you longer software support, which is important if you’re the kind of buyer who wants to get the most out of every phone purchase. </p><p id=\"4lsCIh\">The OnePlus Nord 2T isn’t a huge step forward compared to last year’s model. But at this point, it doesn’t have to be. It performs well and is enjoyable to use, and if you’re not concerned about having the best camera around, it’s an easy phone to recommend… so long as you live in one of the markets where OnePlus is actually selling it. </p><p class=\"c-end-para\" id=\"2IBvvJ\"><em>Photography by Jon Porter / The Verge</em></p><div><div id=\"O0gDZm\"><div data-anthem-component=\"aside:11243985\"></div></div></div><p id=\"VT7DrD\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hh_lYFo7KSwKyXw_590kUpshreY=/0x91:2040x1159/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23522032/jporter_220516_5224_0001.jpg",
  "description": "A similar feature set doesn’t spoil this capable performer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}