{
  "title": "OneWeb turns to SpaceX for help after Russia refused to launch company’s satellites",
  "url": "https://www.theverge.com/2022/3/21/22988867/oneweb-spacex-launch-agreement-russia-roscosmos-soyuz",
  "date": "2022-03-21T14:43:53.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"Spaceport Cornwall Opens Exhibition On Satellites At Newquay Airport\" src=\"https://cdn.vox-cdn.com/thumbor/OI9My04kvWqji5DnKQ9MAHW-zpk=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70651846/1331949355.0.jpg\" />        <figcaption><em>A model of a OneWeb satellite on display</em> | Photo by Hugh Hastings/Getty Images</figcaption>    </figure>  <p id=\"knFK1o\">Internet-from-space provider OneWeb says it will resume launching its satellites on the rockets of its competitor SpaceX, with the first launch expected sometime this year. The deal was struck after OneWeb’s original launch provider, Russia’s state space corporation Roscosmos, refused to continue launching the company’s satellites <a href=\"https://www.theverge.com/2022/3/2/22958082/russia-roscosmos-oneweb-soyuz-launch-demands-ukraine-invasion\">unless OneWeb cowed to a list of significant demands</a>.</p><p id=\"40T5Ur\">The British company OneWeb is currently <a href=\"https://www.theverge.com/2019/2/27/18242120/oneweb-650-satellite-constellation-arianespace-soyuz-launch\">building out a mega-constellation of 648 satellites</a> in low Earth orbit to provide broadband Internet coverage to customers all over the planet. It’s similar to SpaceX’s Starlink initiative, which aims to launch tens of thousands of satellites to also provide global broadband Internet coverage. </p><p id=\"0BTqNo\">So far, OneWeb has successfully launched 428 of its satellites, all of which were exclusively launched on Russia’s Soyuz rocket, arranged through a partnership agreement with European launch provider Arianespace. OneWeb was set to launch another batch of 36 satellites on a Soyuz in the early morning hours of March 5th out of Kazakhstan. But after Russia began its invasion of Ukraine, OneWeb’s launch was thrown into turmoil as Roscosmos began retaliating in various ways against sanctions placed on Russia by the United Kingdom and other nations.</p><div class=\"c-float-right\"><aside id=\"JYsqf2\"><q>OneWeb’s launch was thrown into turmoil as Roscosmos began retaliating</q></aside></div><p id=\"XRqGhQ\">Just a few days before the launch was set to take place, Dmitry Rogozin, the head of Roscosmos, demanded that Russia would only launch OneWeb’s satellites if the company promised that the spacecraft would not be used for military purposes. Rogozin also demanded that the British government divest its entire stake in OneWeb. In 2020, the UK <a href=\"https://www.theverge.com/2020/7/3/21312456/uk-oneweb-500-million-space\">invested roughly $500 million in OneWeb</a> in order to save the company from bankruptcy, and the UK government became a major shareholder along with Indian telecommunications company Bharti Global.</p><p id=\"yBjZTv\">OneWeb and the UK refused to submit to the demands, and the company wound up <a href=\"https://www.reuters.com/business/aerospace-defense/uk-satellite-company-oneweb-suspends-baikonur-launches-2022-03-03/\">suspending all further launches of its satellites from Kazakhstan</a>. Roscosmos rolled back the Soyuz rocket carrying the 36 OneWeb satellites from its launchpad, and the satellites have yet to be returned to OneWeb. The company isn’t sure what happened to the spacecraft or if they’ll ever be returned. “The thing about the satellites is honestly they’re the least of our problems,” Chris McLaughlin, chief of government, regulatory, and engagement at OneWeb, tells <em>The Verge</em>. “We make two a day in the factory in Florida. So we can find ways to get a resilient solution.” </p><p id=\"vaaY5b\">What OneWeb didn’t have were any immediate options for getting its remaining 220 satellites into orbit. Now, it seems that SpaceX is answering the call, though the exact terms of the deal are “confidential,” according to OneWeb. McLaughlin declined to say whether the new agreement would cover all launches of the remaining satellites. It’s also unclear if this will include more than one launch and if SpaceX’s Falcon 9 or Falcon Heavy will be used.</p><div class=\"c-float-left\"><aside id=\"g00BPl\"><q>“The thing about the satellites is honestly they’re the least of our problems.”</q></aside></div><p id=\"QwlRvb\">“We thank SpaceX for their support, which reflects our shared vision for the boundless potential of space,” Neil Masterson, OneWeb CEO, said in a statement about the news. “With these launch plans in place, we’re on track to finish building out our full fleet of satellites and deliver robust, fast, secure connectivity around the globe.”</p><p id=\"vxFCWq\">The move may seem strange, as SpaceX and OneWeb are often viewed as direct competitors. However, McLaughlin argues that is not the case, with SpaceX more focused on serving individual customers and OneWeb focused on selling its service to governments. “We see them as being a broad-based consumer internet supplier,” McLaughlin says. “They do a very good job there. We see ourselves as a more niche, government, polar enterprise service. Very, very different products.”</p><p id=\"Ce72df\">While SpaceX has started rolling out its Starlink service to customers in the United States and other countries, OneWeb is still primarily in the testing phase with its constellation. OneWeb has activated service above the 50th parallel north, and McLaughlin says the company has only started the testing process in Alaska and Canada, while testing has just begun in the UK. Meanwhile, OneWeb has been making agreements with various companies and governments to distribute its service. In October, <a href=\"https://oneweb.net/resources/neom-tech-digital-holding-company-and-oneweb-sign-200m-jv-satellite-network\">OneWeb signed a $200 million deal with the Saudi Arabia-backed company NEOM</a> to distribute OneWeb’s service in the Middle East.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zxzrY-QhPwWbuItMBC_MPH3LjLA=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23333598/1331949355.jpg",
  "description": "The exact terms of the new deal are under wraps.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}