{
  "title": "Only athletes should give a whoop about Whoop",
  "url": "https://www.theverge.com/22957195/whoop-review-fitness-tracker-wearables",
  "date": "2022-03-02T17:54:55.000Z",
  "author": "Victoria Song",
  "content": "  <p>That $30 monthly subscription is hard to swallow</p> <p class=\"p--has-dropcap p-large-text\" id=\"VV5BsH\">Whenever a friend or colleague asks me whether they should get a Whoop tracker, I heave a big sigh. Not because it’s a bad product — I sigh because it’s one of <em>those</em> gadgets. You know, the expensive ones with slick Instagram ads and a devoted, niche fan base — and a feature set that doesn’t make sense for the average person. </p><p id=\"xLwSe7\">Like the <a href=\"https://www.theverge.com/22789248/oura-ring-3-review-sleep-tracker-fitness-tracker\">Oura Ring</a>, Whoop is a buzzy fitness tracker worn by the rich and famous. LeBron James and Michael Phelps were <a href=\"https://www.secretleaders.com/episodes/how-to-land-lebron-james-michael-phelps-in-your-first-100-customers-will-ahmed-founder-of-whoop\">among the first</a> to get on the Whoop train. In 2020, the company was <a href=\"https://www.cnbc.com/2020/10/28/wearable-fitness-company-whoop-raises-100m-during-pandemic-.html\">valued at $1.2 billion</a>, thanks in part to celebrity investors like champion golfer Rory McIlroy, NFL quarterback Patrick Mahomes, and NBA star Kevin Durant. But while it’s been around for years, this weird recovery-focused tracker got a lot more mainstream attention once the pandemic struck. Suddenly, it was in the news as one of the many devices researchers used to study whether <a href=\"https://gizmodo.com/can-a-smart-watch-detect-covid-19-1833409102\">trackers could predict infectious diseases</a> like COVID-19.</p><p id=\"Xh4nrt\">That’s a lot of lore for such an unassuming tracker — especially one that charges you a $30 monthly membership to do exactly one thing.</p><div id=\"xYNI48\"><div data-anthem-component=\"scorecard:11074576\"></div></div><p id=\"grZY49\">That buzz has propelled this fitness tracker to its fourth generation. The Whoop 4.0 I tested is 33 percent smaller than its predecessor but still manages to cram in five LEDs, four photodiodes, and a body temperature sensor. It’s also got <a href=\"https://www.theverge.com/2021/9/8/22662979/whoop-fitness-tracker-sila-silicon-anode-battery-electric-cars\">a new battery that uses a silicon anode</a> that purportedly delivers 17 percent higher energy density than the previous generation. But these are internal upgrades. On the surface, not much has changed.</p><p id=\"CCqE7b\">Whoop’s missing nearly all of the features you’d expect from a modern wearable. It doesn’t track steps, stairs climbed, or active minutes. It doesn’t do notifications either. There isn’t even a screen to view notifications on. It can’t tell you the time, so forget timers. Contactless payments and mindfulness reminders are also a no-go. Its “smartest” feature is the ability to set a single haptic alarm. The only things the Whoop tracks are cardiovascular strain, recovery, and sleep. </p><p id=\"CxtrqV\">While it’s easy to poke fun at Whoop, there’s a reason it’s stuck around for so long. Sure, it doesn’t do much, but what it does do, it does well. That’s true for the data insights it provides, as well as its design.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Whoop 4.0 in the middle of someone’s hand\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qjLaC6f6aMK-MkgTKFAJzZ7hYrY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277332/vsong_220225_5048_0002.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>This is the actual tracker.</em></figcaption>  </figure></div><p id=\"wtLhmQ\">The actual tracker is quite small, but that’s not the innovative part. What’s unique about Whoop is it can be worn in multiple ways. The default is either a wristband or bicep band. Both resemble a woven bracelet and are quite comfortable when you’re wearing it. You barely notice you’re wearing anything. Alongside the Whoop 4.0, the company also launched a line of athletic wear fitted with pods that you can slot the Whoop tracker into. That includes leggings, underwear, and sleeves for your arms and knees. </p><p id=\"ZoMdjJ\">Whoop sent me one of their sports bras, which has a pod for the tracker sewn into the left side near the ribs. I’ll admit to being skeptical, but I was pleasantly surprised by how comfortable the experience was. While running, it didn’t feel like I was wearing a tracker at all — and I can’t say the same for other devices like chest straps or bulky fitness watches.</p><p id=\"IKxRln\">It’s no surprise that recovery trackers like Whoop and the Oura Ring are thinking outside the box when it comes to <em>where</em> we can wear wearables. Accurate recovery tracking necessitates wearing the device 24/7, and the wrist isn’t always an ideal spot for that. Not only is it less accurate for heart rate tracking, but many people also find it uncomfortable for sleep. It might also not be feasible for people with limb differences or mobility issues. In that sense, Whoop is far ahead of the competition.</p>  <figure class=\"e-image\">        <img alt=\"The Whoop 4.0 in a special pocket in a sports bra\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Fr8noYceG-2TmDvFmuwXzPr5czs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277333/vsong_220225_5048_0003.jpg\">      <figcaption><em>The pod in Whoop’s sports bra where you can stick the tracker</em></figcaption>  </figure><p id=\"gMh1FD\">But while Whoop gets kudos for expanding the ways you can wear its device, I’ve got one major gripe. Switching between straps and other accessories is a pain in the ass. Whoop’s wristband has possibly the worst buckle I’ve had the misfortune of fiddling with. It’s secure when snapped shut, but holy moly, it completely falls apart whenever you take it off. And once it falls apart, putting it back together isn’t always intuitive.</p><p id=\"2jeXmh\">Kvetching about the buckle might sound like making a fuss over nothing. It’s not. A good strap shouldn’t be difficult to put on one-handed. That extra inconvenience almost discouraged me from exploring all the different ways you can wear a Whoop. In fact, I’d have worn the Whoop sports bra for every workout if it wasn’t so tedious switching between it and the wristband for everyday wear.</p><p id=\"Gijz7i\">Another accessory I’m iffy on is Whoop’s battery pack. However, it’s not the design that’s the issue. The pack slides onto the tracker itself, and you can actually charge the device while you’re wearing it. It’s great for people who hate that one- to two-hour gap in data when charging their trackers. The new version is waterproof, so you can also charge while in the shower or washing dishes. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Whoop 4.0 with the battery pack \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/W_givj4hp2KhXA2QEw8KZDwkgUY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277337/vsong_220225_5048_0007.jpg\">      <figcaption><em>The battery pack slides onto the Whoop 4.0 so you can still wear it while charging.</em></figcaption>  </figure></div><p id=\"OKNQO4\">But while I appreciate how clever it is, there are a ton of drawbacks. First, it’s <em>so</em> easy to lose, replacing it costs $49, and there’s no other way of charging the tracker. Second, it’s not clear when you’re fully charged if you’re not looking at your phone. The LED battery indicator lights are in a hard-to-see spot on the side of the tracker. Also, a green light could mean anything between a 50 and 100 percent charge. Third, I was never able to get multiple charges out of the pack. That feels antithetical to how these things are supposed to work.</p><p id=\"mw12To\">As for overall battery life, Whoop says you ought to get five days on a single charge. That’s broadly true. Aside from an initial charge during setup, I’ve only had to charge the Whoop twice over a 14-day period. </p><p id=\"8ZIFcp\">Despite my quibbles, Whoop’s hardware is solid. However, hardware is only half the equation. The real draw is Whoop’s app and the insights it provides. On that front, Whoop delivers but in the most convoluted way possible.</p>  <figure class=\"e-image\">        <img alt=\"A shot of the Whoop app\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Uc4NBEvcJjavvOgtyl-9M6uCbLU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277335/vsong_220225_5048_0005.jpg\">      <figcaption><em>One of Whoop’s charts. While the app is slick, it might take newcomers a bit to understand all the proprietary terms.</em></figcaption>  </figure><p id=\"liDa4C\">You’d think that since Whoop only tracks a handful of metrics, there’d be less to look at. Nope. The app may look slick, but there are a lot of graphs that you have to stare at to decipher your insights. It’s gotten slightly better since the last-gen device. There’s now a Strain coach tab that spells out how much activity you should take on for optimal performance. Likewise, there’s also a sleep coach that breaks down how much sleep you need to be your best self — or at least someone who can passably function. </p><p id=\"l0idVi\">Whoop isn’t the only wearable company guilty of a confusing app interface and data overload. (I’m looking at you, Polar and Garmin.) But Whoop also uses proprietary terms that you have to read up on to fully understand why you’re getting certain recommendations. For instance, strain is measured by how much time you spend in certain heart rate zones, which, in turn, is based on your maximum heart rate. Meanwhile, recovery is based on four factors: your heart rate variability, resting heart rate, respiratory rate, and how many hours you slept. </p><p id=\"6wuk0w\">Unlike most sleep trackers, Whoop doesn’t give you a score to evaluate your sleep quality. Instead, it compares how much sleep you got versus how much sleep your body needed. The latter is based on your strain and recovery. You can still see a breakdown of your sleep stages, but it’s less in-depth than what you’d get with the Oura Ring or even Fitbit.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"A shot of the Whoop 4.0’s buckle\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kbDtAIl0gCk7ckkLD7NobJeey8I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277336/vsong_220225_5048_0006.jpg\">      <figcaption><em>I hate this buckle. It fell off a few times while taking this photo.</em></figcaption>  </figure></div><p id=\"vE3vVn\">Each morning, you sync your tracker to learn how well you slept and your daily recovery score, which is graded on a scale of 1 to 100 percent. The higher the number, the better prepared you are to crush it in training. Before you get your results, you can also “journal” factors that may have impacted your sleep. The list of options is… extensive. This is a small sampling, but you can track each dose of the COVID-19 vaccine, your period, whether a cat or dog slept in your bed, if you took magnesium supplements, smoked a blunt, or had a tough day at work. I get that this is so you can see how your behaviors impact your sleep long-term, but while I dutifully journaled every day, I can’t say I felt compelled to see what trends emerged.</p><div class=\"c-float-right c-float-hang\"><aside id=\"AE7bEa\"><q>Whoop totally whiffed it for strength training</q></aside></div><p id=\"JtdPeV\">A finicky interface would be fine if the data you got was solid. Again, that’s a mixed bag. Strain is graded on a separate scale of 1 to 21. Since this is all based around heart rate data, it’s most accurate for cardio activities. The Whoop correctly evaluated my weekday 5-mile training runs at around 14 on the strain scale — which is on the border of moderate to high intensity. It also accurately determined that my 7-mile and 8-mile long runs wiped me out at 17 and 18, respectively. However, Whoop totally whiffed it for strength training and low-intensity aerobic exercise. Didn’t matter if my arms were sore and I wasn’t up for working out the next day — Whoop said my recovery was high and my body ready for strain. Bottom line: recovery insights will be top-notch if you’re primarily into cardio-intensive exercise. For every other activity, not so much. </p><p id=\"9ceZzw\">It’s also not great if you want more than your heart rate data from a tracked activity. A runner might be able to record a run from the Whoop app, but the information you get is simple to a fault. You only get distance, pace, and duration. The type of athlete that would want something like Whoop probably wants a little more granularity than that. </p>  <figure class=\"e-image\">        <img alt=\"The Whoop 4.0 on someone’s wrist\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PJOlY5P-d8STO07AAwA2vjwm9d0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277334/vsong_220225_5048_0004.jpg\">      <figcaption><em>It’s actually quite comfortable to wear and secure once the buckle is snapped shut.</em></figcaption>  </figure><p id=\"I8rztK\">Lastly, it takes a while for Whoop to get going. You need to wear it for four days before you get any real insights, and it takes about a week to establish a baseline. That’s good for accuracy over the long-term, but it’s something to keep in mind if you’re injured or under the weather when you start using Whoop. </p><p id=\"JI1LrR\">Between Whoop’s single-minded focus and the lack of on-device features, it’s best as a secondary tracker for most people. That’s tough to swallow when you consider the price. While Whoop gives you the hardware for “free,” you pay a monthly membership fee of $30 or $360 a year. If you pay annually upfront, it’s $288 or $24 a month. That’s more expensive than some gym memberships and mid-range smartwatches. </p><div><aside id=\"ouDpHT\"><q>While Whoop gives you the hardware for “free”, you pay a monthly membership fee of $30</q></aside></div><p id=\"RPxcTB\">Your other options are to invest in a more traditional fitness tracker or, if you really want to focus on recovery, the Oura Ring. Both can be more economical options in the long run. Two years of Whoop will cost you anywhere between $576 and $720. And that’s if you don’t buy extra accessories. Meanwhile, a $600 Garmin smartwatch works out to about $25 a month over the same time period. Garmin’s also adamant that they have <a href=\"https://twitter.com/Garmin/status/1494691378445570048?s=20&amp;t=nCBQywkO43_poyUgFs-VgA\">zero plans to charge customers extra for health data</a>. Plus, Garmin has a Body Battery feature that pretty much does the same thing as Whoop’s whole schtick. Other wearable makers, like Fitbit and Polar, also incorporate stress and recovery features into their newer devices. And the coup de grace? These devices can not only tell time — they can deliver notifications and other smart features alongside your fitness insights. Simply put, a tracker or fitness watch will get you a lot more bang for your buck.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Whoop 4.0 on top of a notebook\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JR5hDpCcG8HEAhQcaXg_sLOzJEA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277331/vsong_220225_5048_0001.jpg\">      <figcaption><em>This is ultimately an experimental wearable for first adopters.</em></figcaption>  </figure></div><p id=\"FTcWS5\">The Oura Ring costs $299 for the ring itself, and after a 6-month trial period, you pay $6 monthly for a subscription. That’s a little over $400 for two years. I tested the third-gen Oura Ring and Whoop 4.0 simultaneously. There are distinct differences — Oura emphasizes overall wellness while Whoop has a more athletic bent. But as far as gauging recovery? The results were nearly identical, as was the overall experience. If you struggle to consistently log 150 minutes of moderate activity per week, the Oura Ring is the better bet.</p><div class=\"c-float-left c-float-hang\"><aside id=\"esHGJh\"><q>For a small subset of wealthy athletes, Whoop is one of the best wearables you can buy</q></aside></div><p id=\"V92uxR\">I don’t want it to seem like Whoop isn’t worth it to somebody. The flexibility to wear Whoop’s tracker in multiple places is forward-thinking and accessible. The device is super comfortable to wear. The data is solid if you care about performing at the highest possible level at a cardio-intensive sport. For a small subset of wealthy athletes, Whoop is one of the best wearables you can buy. And when you think about it that way, Whoop’s clientele makes a lot more sense. </p><p class=\"c-end-para\" id=\"jKfJnw\">The bottom line is Whoop is a weird, experimental wearable. Ideally, a lot of what it’s doing now will eventually make its way back into more mainstream devices. In fact, that’s already happening as more wearable makers focus on recovery and switch to subscription models. But for now, the only people who should give a whoop about Whoop are athletes. </p><p id=\"C6gdXq\"><em>Photography by Victoria Song / The Verge</em></p><div><div id=\"mVL2vY\"><div data-anthem-component=\"aside:11074618\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/7a5-NHmlihXigUbLKlQ-Zka6Ja8=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23277338/vsong_220225_5048_0008.jpg",
  "description": "Would you use a tracker that costs $30 a month?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}