{
  "title": "OpenSea launches new contract-clearing system to protect against recent bug",
  "url": "https://www.theverge.com/2022/2/4/22917814/opensea-contract-clearing-system-nft-marketplace-bug",
  "date": "2022-02-04T20:48:03.000Z",
  "author": "Russell Brandom",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/r0ZQ3fFA92_98JNCW94l8R1iWJA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472790/acastro_210329_1777_nft_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"72Qoqg\">On Thursday evening, blockchain platform OpenSea launched a new system that will help users clear out unclaimed sale offers, set to roll out over the next two weeks. <a href=\"https://opensea.io/blog/announcements/announcing-a-contract-upgrade/\">In an announcement post</a>, CEO Devin Finzer described the changes as made to “ensure old, inactive listings expire.”</p><p id=\"BFIP6W\">The move comes after a bug that <a href=\"https://www.theverge.com/2022/1/24/22899125/opensea-bug-bored-ape-nfts-smart-contract-listings-cancellation\">allowed attackers to exploit old contracts</a> to buy tokens for hundreds of thousands of dollars below market price. In one particularly attention-getting case in January, a Bored Ape Yacht Club token was purchased for less than $2,000 and resold immediately for over $192,000. </p><p id=\"kUQfst\">The bug was a result of how OpenSea’s platform interacts with the Ethereum blockchain, often saving gas fees by listing offers locally rather than coding them into the broader chain. An oversight in that system allowed old contracts to sometimes linger on the blockchain without appearing in the OpenSea interface. By making offers against those contracts, which were often years old, attackers could take advantage of badly out-of-date prices — usually taking token-owners by surprise.</p><p id=\"qkWnx7\">As described by OpenSea, the new system will enable users to cancel all unfilled contracts while incurring only minimal gas fees. A separate change looks to make signatures clearer, hopefully preventing users from mistaking contract terms in the future. The new system is expected to take 15 days to fully roll out, at which point users will be invited to switch their accounts onto the new system.</p><p id=\"18Y1s6\"><a href=\"https://www.theverge.com/2022/2/2/22914081/open-sea-nft-marketplace-web3-fundraising-finzer-a16z\">The largest platform for trading and bidding on NFTs</a>, OpenSea has been immensely successful over the course of the recent boom. At the same time, the company has struggled to secure and moderate the influx of new activity on the marketplace. <a href=\"https://www.theverge.com/2022/2/2/22914056/nft-money-laundering-chainalysis\">A recent Chainalysis report</a> found a small but growing amount of money-laundering activity in NFT marketplaces, although the problem is not specific to OpenSea.  </p><hr class=\"p-entry-hr\" id=\"jIWkYh\"><h2 id=\"mekKTY\">Related:</h2><div id=\"KtA6UQ\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"The $13B casino of NFTs|104335\" data-volume-uuid=\"d82d68ac5\" data-volume-id=\"104335\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-905\" class=\"volume-video\"></div></div><p id=\"jkDGt5\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bqkSINq8vW6604RWyrGwOcXVZps=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22413647/acastro_210329_1777_nft_0002.jpg",
  "description": "The massive marketplace has a new way to protect users.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}