{
  "title": "Opera browser now allows emoji-only web addresses",
  "url": "https://www.theverge.com/2022/2/14/22932918/opera-browser-emoji-only-web-addresses-urls-yat",
  "date": "2022-02-14T15:00:00.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/99TeO7YaLjIT3aQ8u_sacjgd8Nk=/91x0:1711x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507012/PR_visual_03_desktop_03_05.0.png\" />        <figcaption>The Opera browser will allow emoji-only web addresses | Opera</figcaption>    </figure>  <p id=\"mfr0uV\">Web browser company Opera said Monday it will enable emoji-only based web addresses “to bring a new level of creativity to the internet.” The integration is part of a partnership with Yat, a company that sells URLs with strings of emoji in them.</p><p id=\"LW8jg1\">“It’s been almost 30 years since the world wide web launched to the public, and there hasn’t been much innovation in the weblink space: people still include .com in their URLs,” Jorgen Arnesen, executive vice president of mobile at Opera, said in a press release. </p><p id=\"R7sTao\">Yat pages are unique domains generated when someone purchases a string of emoji (which itself is called a Yat). The owner of a Yat can create an NFT of their emoji string, and the company plans to eventually let users connect their Yats to electronic payments. According to the company, musicians are among the early adopters of Yats; for instance, singer Kesha’s Yat page is the emojis Rainbow Rocket Alien (<em>editor note: Vox’s CMS doesn’t allow rendering of emojis), </em>followed by y.at,<em> </em>which redirects to her Kesha’s World website. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hCKu9PAPXqHRZv-alUCp5vW5arE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23240516/kesha_yat.PNG\">      <cite>Screengrab/Yat</cite>      <figcaption><em>Kesha’s Rainbow, Rocket, Alien Yat page redirects to her website.</em></figcaption>  </figure><p id=\"Y5ib9a\">Yat co-founder Naveen Jain said Yat emoji domains let users personalize their internet identity, potentially giving creators, artists, and others, more visibility online. The company introduced Yat pages on February 1st. </p><p id=\"6eY3sf\">With the Opera integration, users won’t have to type in the y.at part of the Yat page web address as they do in other browsers — so to get to Kesha’s Yat page in Opera, you’d just type in the Rainbow Rocket Alien emojis.</p><p id=\"4mtneX\"></p><p id=\"YPlQ63\"></p><p id=\"5gJ3aY\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/e-Qy1XRvS92MIXDEjr_H-7pJ6ws=/0x75:1920x1080/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23240463/PR_visual_03_desktop_03_05.png",
  "description": "The new emoji-only URLs rolled out February 1st.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}