{
  "title": "OtterBox’s MagSafe battery pack outdoes Apple’s",
  "url": "https://www.theverge.com/2022/2/24/22949219/otterbox-magsafe-battery-pack-apple",
  "date": "2022-02-24T19:20:41.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_aRXmPElQNboKM0xT95IRufqNNA=/50x0:950x600/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70545920/otterbox_wireless_charger_2.0.jpg\" />        <figcaption><em>The battery pack can attach to a phone and dock at the same time</em> | Image: Otterbox</figcaption>    </figure>  <p id=\"lK9Vwn\">When Dieter Bohn <a href=\"https://www.theverge.com/22588777/apple-magsafe-battery-review-size-iphone-12-mini\">reviewed Apple’s MagSafe battery pack</a>, he wasn’t exactly thrilled with its performance. Unfortunately, the relatively small battery pack didn’t have enough juice to top off an iPhone 12 even once. And, like most things from Apple, it came with an unusually high price tag and only worked with a proprietary Lightning cable for charging. </p><p id=\"u9KCDu\">Since then, other manufacturers like Anker have produced MagSafe battery packs with friendlier features and better capacity. Now, the case makers at Otterbox have joined that trend with a pair of wireless MagSafe power banks that cost less than Apple’s model but provide better capacity and features. Otterbox’s lineup includes both a 5,000mAh and  3,000mAh model that cost $69.99 and $49.95, respectively.  </p><p id=\"W6nJbB\">The double-sided magnets allow the battery to sandwich itself between any compatible MagSafe charging case and a dock, allowing you to top off your phone and the battery pack simultaneously. The battery pack itself is compatible with any iPhone or iPhone case from either Apple or Otterbox with MagSafe charging.</p><p id=\"SbeWT9\">Another feature that sets this battery pack apart from the Apple model is the USB-C port, which allows the pack to serve as an external battery for other devices. According to the specs listed on the Otterbox website, the output is listed as a 5W Qi-charging standard, which should allow it to wirelessly charge other Qi-compatible devices as well.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/p_68NDvjjYM2IUjT_7bffNtutxc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23268465/otterbox_wireless_charger_1.jpg\">      <cite>Image: Otterbox</cite>      <figcaption><em>The battery pack uses a USB-C charging standard</em></figcaption>  </figure><p id=\"QAYffs\">This list of features combined with the competitive pricing gives the Otterbox battery pack an edge over Apple’s model, which uses a less versatile charging standard and still costs around $99.99 at retail. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dnkEG-DmL7wi56u8Ld-4g--gBbg=/0x38:1000x562/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268464/otterbox_wireless_charger_2.jpg",
  "description": "The battery pack costs less and has better features.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}