{
  "title": "Our memories of the iPod",
  "url": "https://www.theverge.com/2022/5/14/23071036/ipod-memories-20-years-discontinued-mini-shuffle-classic",
  "date": "2022-05-14T14:00:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/dVu3wGogs3AFpajacVc_lh5kcWI=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70869150/VRG_ILLO_5220_iPod_Memories.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge; Getty Images</figcaption>    </figure>  <p id=\"KhMiUY\">It’s official: the iPod is over. After 20 years, Apple announced this week that it was <a href=\"https://www.theverge.com/2022/5/10/23065412/apple-ipod-touch-canceled-discontinued\">discontinuing the final product</a> in the brand that defined music players in the mid-2000s and <a href=\"https://www.theverge.com/2022/5/11/23065643/apple-ipod-iphone-revitalization-mobile-devices\">helped catapult Apple to mainstream success</a>.</p><p id=\"p8HymC\">A lot of us at <em>The Verge</em> have fond memories of our days spent using the music players over that two-decade run, so we decided to write some of them down to reflect not just on what a great music player it was but also what an important device it was in our lives at the time. Plus, we’ve got a lot of scars from these things getting destroyed or “going missing.”</p><p id=\"gwl6Bk\">Here are our memories of buying iPods, rediscovering them, nurturing them back to life, and sometimes just losing them.</p><hr class=\"p-entry-hr\" id=\"FuZuTS\"><p id=\"KMX5SR\">I have two iPod stories: one about the first one I ever got and another about the last one I purchased new.</p><p id=\"rV71Xe\">My first MP3 player was actually a <a href=\"https://www.sony.com/electronics/support/digital-music-players-other-digital-music-players/nwz-s616f\">2GB Walkman</a>, but as soon as I saw the <a href=\"https://www.youtube.com/watch?v=Wdep-3ANSgI\">“Nano-chromatic” ad</a> for the fourth-gen iPod Nano, I decided I was going to buy it. The main problem was that I was 12, and $149 was a <em>lot</em> of money for me — so I spent months scraping together allowances, money from mowing lawns, and gift cards. When I finally had enough, I marched into Toys R Us and picked out a blue one. Finally, I was about to get my first iPod.</p><div class=\"c-float-right\"><aside id=\"LSDfB7\"><q>The greatest act of kindness I’d experienced in my young life</q></aside></div><p id=\"dqJ31M\">I hadn’t considered sales tax and was short a few dollars. The cashier must’ve realized how shattered I was because they offered to cover the rest in what was almost certainly the greatest act of kindness I’d experienced in my young life. I still have that iPod, though its battery no longer holds a charge.</p><p id=\"RAPPcg\">Fast forward a few years, and I was a stereotypical techy teen with a jailbroken and modded iPod Touch fourth gen. At one point, I uninstalled something that was apparently essential using the jailbreaking tool Cydia and was completely unable to restore the iPod back to working condition. After a few months, I decided to dig the device out of my closet and give restoring it another shot. Miraculously, it worked, and my iPod was back to running stock iOS 5.</p><p id=\"hBtaX0\">The next day, as I was getting out of my very cool minivan, it slid out of my pocket and fell onto the concrete driveway, shattering the screen. RIP to a real one. <strong>– Mitchell Clark</strong></p><hr class=\"p-entry-hr\" id=\"YwOEjL\"><p id=\"CMFXBm\">The iPod was the first “cool” gadget I ever owned. I had a string of crappy other MP3 players, a Diamond Rio and an Archos Jukebox, but then I bought a gold iPod Mini. It held four gigs of music, which even back then felt like less than some of its competitors, but it was tiny and fast and the thing felt like magic. Most of all, it didn’t skip every time the car hit a bump like a bunch of the other hard drive-based players I had.</p><p id=\"8nsPYa\">The Mini went everywhere with me for years until it was stolen out of my car in my high school parking lot. (I can still picture exactly where my car was parked, the weather that day, everything about the moment I discovered it was gone.) I couldn’t afford another one, so I went back to my other devices, all of which now seemed lousy even though they actually held quite a bit more music. But I kept the white headphones because as long as I had those, it kind of felt like I still had an iPod. Until I hit a pothole and the thing skipped tracks. <strong>– David Pierce</strong></p><hr class=\"p-entry-hr\" id=\"NfMbD7\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/S_SKpUtXhExZOCVHDqVqtNwxavc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/12901295/akrales_180817_2578_0107.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption>A fifth-generation iPod.</figcaption>  </figure><p id=\"jkNd4E\">My first iPod was the fifth-gen iPod Video. The first-gen iPod came out in my freshman year of high school, and I watched enviously for years as all the rich kids showed theirs off between classes. In my junior year, I basically put together a PowerPoint for my dad, detailing my grades and all my silly high school achievements. My dad didn’t say anything, and I sulked off, resigned to my fate.</p><p id=\"c7Bjv2\">I was completely surprised when, a few weeks later, a package from Apple arrived at our door. My dad had a smirk on his face. It was the black version, too, since he knew I was a goth teen. (This was despite the fact he wished I’d stop being goth with every fiber of his being). My dad was a stoic man, so he didn’t really say much other than “enjoy.” Needless to say, I loaded that baby up with as many movies and songs as it would hold. It was my companion for late-night study sessions and hour-long commutes to school. More often than not, however, it was what I turned to as my parents muddled their way through a messy breakup. </p><div class=\"c-float-left\"><aside id=\"5LyET3\"><q>Something about my poor, loyal iPod Video lying shattered on a sidewalk made me tear up</q></aside></div><p id=\"wJ54R7\">You could probably say something about sulky teens listening to emo music as their parents split up in explosive fashion. But it was an immense comfort to slip on my headphones and play my music, uninterrupted by notifications and apps.</p><p id=\"nmo1Sl\">My iPod Video lasted me about three years, until one day, I dropped it on the sidewalk and it split open. By that time, I was very much over its buggy interface and a click wheel that didn’t want to cooperate anymore. I wanted a newfangled iPod Touch. But something about my poor, loyal iPod Video lying shattered on a sidewalk made me tear up.</p><p id=\"6MrN1m\">I took it home and kept it in a box for years. I couldn’t throw it out. I then forgot about it for almost a decade and, strangely, found it when cleaning out my junk in 2018. My dad had just died, but there, when I was missing him most, was one of the most precious gifts he ever gave me — a reminder of how much he loved me even if he couldn’t express it. And maybe, just maybe, me finding it that day was my dad comforting me from beyond the grave.<strong> – Victoria Song</strong></p><hr class=\"p-entry-hr\" id=\"aMP6wF\"><p id=\"GciRao\">My “first iPod” story is a lot like David’s. My first MP3 player was a Rio that could hold just a handful of songs, and for some reason, I have a very strong memory of one of those being a James Bond theme remix. My iPod Mini — in its glorious baby blue color — was a massive upgrade. It could hold way more songs than my Rio, and it was just fun to use. I still miss the scroll wheel! (I don’t know if I put that James Bond song on it.) It’s one of my favorite devices ever, and I wish I still had it. <strong>– Jay Peters</strong></p><hr class=\"p-entry-hr\" id=\"0kbw84\">  <figure class=\"e-image\">        <img alt=\"Apple Ipod Mini at the Apple Computer store in Soho.,\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/N-oEMJgbOgp0sfApA9khDDUD6oQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23464361/97250599.jpg\">      <cite>Photo by Andrew Savulich/NY Daily News Archive via Getty Images</cite>      <figcaption>An iPod mini.</figcaption>  </figure><p id=\"dv0Nrf\">The iPod Mini was my first iPod, and I’m pretty sure that it aided in some minor hearing loss. I used it every day, nestled into its handy plastic cradle and tucked into my waistband, to drum to the beat of my favorite music as I was learning how to play, a hobby that further aided in said hearing loss. This iPod also joined me aboard my family’s tractor when I had to mow our lawn every week, a chore that probably contributed to hearing loss, too. I have no incredible tales to tell about my ownership of this iPod, other than it went everywhere with me and dutifully did its job as a no-nonsense music player that also had <em>Brick Game</em> built-in. <strong>– Cameron Faulkner</strong></p><hr class=\"p-entry-hr\" id=\"kxP3Dg\"><p id=\"Qpibz9\">My first iPod was the very first iPod — and it was bought in a sweet attempt by my mom to cheer me up. I was excited to have so much storage on one device and to have an MP3 player that worked out of the box with iTunes. I used it constantly, sometimes plugged into one of those terrible tape decks and sometimes into one of those terrible FM transmitters. The tunes carried me along 12-hour drives back and forth from college, and having all my music in one place took the sting out of the loss of my favorite sleeve of mix CDs in a Dillard’s parking lot in Tullahoma, Tennessee.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\"A screenshot of a conversation from iMessage. The sender asks: “Peter, it’s been 20 years, did you take my first gen iPod and sit on that secret for decades?” Peter responds with an SNL gif of Stefon saying “Yes,” then later replies “lol no.”\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WBcouorZWn8Mso2Ia3oBVd72jjM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23463125/unnamed.jpg\">      <cite>Screenshot: Alex Cranz</cite>      <figcaption>Investigating a disappearance.</figcaption>  </figure></div><p id=\"M29GlH\">Then, one day, it vanished. It wasn’t in any of my purses. It wasn’t in my car. It wasn’t in my bedroom. I was home on summer break from college, so it definitely wasn’t in my dorm room. It was simply gone. I got a much cheaper iPod Shuffle to replace it, and it wasn’t nearly as good. For years I’ve wondered if my younger brother secretly took it so he could look cool to the other high schoolers. </p><p id=\"NX6GID\">I recently attempted to investigate this long lingering mystery, but the results of my investigation have been inconclusive. <strong>– Alex Cranz</strong></p><hr class=\"p-entry-hr\" id=\"kkuU0K\"><p id=\"j0xm4S\">My first iPod was the 40GB click wheel model. I bought it in like-new condition off eBay in 2005. My favorite thing about it wasn’t the large storage space, the shiny finish that I protected in a Griffin clear case, or the plain cool factor. My favorite thing about it was a top-mounted FM radio transmitter accessory called iTrip. It looked like a water tank that plugged into the headphone jack yet somehow also looked like a natural extension of the iPod. Since it ran off the iPod battery, I could jump into a friend’s car and just have them tune to 87.9, which was great since many cars did not have an aux jack or Bluetooth yet.</p><p id=\"0I7xg7\">When the iPod with video came out, I knew I had to have it. So I sold my iPod on eBay and bought my first brand new Apple product: a black 60GB fifth-generation iPod. I really wanted to protect this iPod, so I took it to a mall kiosk that applies clear vinyl protectors — big mistake. They used a razor blade to cut around the iPod wheel and completely scratched it up. They didn’t take responsibility for it, so, in my sorrow, I sold it on eBay at a loss. I couldn’t get myself to buy another new Apple device for a long time, but in the meantime, I played MP3s on Windows Mobile devices like the <a href=\"https://www.phonescoop.com/phones/phone.php?p=800\">Cingular / HTC 2125</a> and on a <a href=\"https://youtu.be/FHg3fgEAGGo?t=95\">Game Boy Advance licensed MP3 player accessory</a> that came with a 32MB compact flash card. <strong>– Umar Shakir</strong></p><hr class=\"p-entry-hr\" id=\"knJHTx\"><p id=\"7Y3GDC\">I grew up an Apple hater as a kid with a silly predisposition to dislike its products because I was all about gaming and PCs. I initially scoffed at the early iPods in favor of my Discman. I was the embodiment of this <a href=\"https://www.penny-arcade.com/comic/2003/05/28/a-penny-saved#\"><em>Penny Arcade</em> comic strip</a>. I didn’t try or use an iPod for the longest time, but I piggy-backed on some of the “well, actually”-style rhetoric I overheard about them not even having good sound quality. When downloading MP3s became a way of life, my eyes were trained on weird players from other brands like <a href=\"https://en.wikipedia.org/wiki/IRiver#/media/File:IRiver_H340.jpg\">iRiver</a> and even <a href=\"https://www.amazon.com/Intel-Pocket-Concert-Digital-Player/dp/B000059ZYA\">Intel</a>. (How fitting, as an annoying PC fanboy, to think “Intel!”)</p><div class=\"c-float-left\"><aside id=\"Y5LjaP\"><q>I loved it despite its flawed, buttonless design</q></aside></div><p id=\"pAK8DC\">I couldn’t afford any of them in high school, but, in early college, I landed on a <a href=\"https://en.wikipedia.org/wiki/Creative_Zen#/media/File:NomadNenNxBattery.jpg\">Creative Nomad Jukebox Zen</a> that was basically a laptop hard drive in an ugly plastic shell with a small monochrome screen. That thing was like a small tank of cheap removable storage that once got me openly mocked at a friend’s drunken basement party when it was my turn to plug into the speakers. I definitely did not talk shit back to them while being secretly envious of their sleek iPods. Nope, not at all.</p><p id=\"WUtIb2\">My strong and misguided opinions toward Apple’s products began to soften when I started using Macs in my college photography classes, and I eventually picked up my first and only iPod — a <a href=\"https://www.amazon.com/Apple-shuffle-Green-Generation-MODEL/dp/B002M3SONS\">lime green third-gen iPod Shuffle</a>. I bought it for cheap on eBay to use while running, and that didn’t pan out, of course. But I loved it despite its flawed, buttonless design. I still have it to this day, and if I ever find the annoying 3.5mm to USB charger, maybe I’ll power it on and see if I can remember the earbud button sequences to control play, pause, skip, and rewind.</p><p id=\"FMLIip\">Or maybe I shouldn’t because I shudder to think what cringe music might still live on it. <strong>–Antonio G. Di Benedetto</strong></p><hr class=\"p-entry-hr\" id=\"tR0ofj\"><p id=\"hDYJQ3\">My first iPod was a hand-me-down from my older sister. It was a black iPod Classic filled with angsty songs that 7th graders probably shouldn’t have had access to, like Panic! At the Disco’s <em>Lying Is the Most Fun a Girl Can Have Without Taking Her Clothes Off</em>.</p><p id=\"0e9KmX\">That little machine was with me through the entirety of my most awkward (and attempted emo) phase. When I eventually got my very own second-gen blue iPod Nano, things didn’t change. I plugged it into the family computer and loaded it up with my sister’s collection of emo songs from iTunes, getting myself a copy of all the <em>P!ATD</em>, <em>The Academy Is</em>, and <em>Taking Back Sunday</em> songs a preteen girl could hope for. </p><p class=\"c-end-para\" id=\"F08Hnk\">My iPod is now collecting dust somewhere in my parents’ house. Wherever you are iPod, I hope you’re cozy in <a href=\"https://apple.fandom.com/wiki/IPod_Socks\">the blue sock</a> I bought you. <strong>– Emma Roth</strong></p><p id=\"TQq0Uc\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ocw3qv-jrfRuXhEq1f99ny_9eEM=/0x239:3000x1810/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23463704/VRG_ILLO_5220_iPod_Memories.jpg",
  "description": "The Verge’s staff remembers our good (and bad) times with Apple’s iconic MP3 player.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}