{
  "title": "Outlook bad for Starbucks’ anti-union lawyers",
  "url": "https://www.theverge.com/2022/2/24/22949417/outlook-crash-error-delay-starbucks-anti-union-lawyers-new-york-deadline",
  "date": "2022-02-24T21:56:13.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/EBP5isekii3NTG7hFC1snJ7hw1I=/0x26:635x449/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70546569/Screenshot_2022_02_24_145750.0.png\" />        <figcaption><em>Starbucks workers continue to organize amidst attempted stall</em> | Image: Starbucks Workers United</figcaption>    </figure>  <p id=\"0JYDdo\">There’s been an interesting development in the ongoing unionization efforts of Starbucks baristas in upstate New York to join Starbucks Workers United. The legal team hired by the coffee chain to upset the organization of its workers experienced something of a hiccup thanks to an unfortunate software malfunction on February 11th.</p><p id=\"2djNOm\">The firm Littler Mendelson, who has been representing Starbucks’ anti-union efforts, failed to submit a dispute with the National Labor Relations Board on time due to an untimely crash in the firm’s Microsoft Outlook.</p><p id=\"1T7WDt\">The dispute, called a statement of position, was aimed at stalling the organizational voting of several upstate New York stores. The dispute stated that holding elections for individual stores would be inappropriate and should instead tally votes on a regional basis. In order to be considered valid, this paperwork needed to be submitted to the NLRB by noon on February 11th but didn’t find its way to the appropriate inbox until 12:08PM.</p><p id=\"YORmRp\">In a <a href=\"https://big.assets.huffingtonpost.com/athena/files/2022/02/22/6214da78e4b0ef74d7263e0f.pdf\">filing</a> made by Alan I. Model, a lawyer for Littler Mendelson, he explained the firm’s position by stating that the included files were too large and caused Outlook to crash. This argument was countered later in a filing by Ian Hayes, a labor lawyer employed by Worker’s United, which stated that Starbucks shouldn’t be able to present its case due to the missed deadline. </p><p id=\"TMhwyX\">The regional director of the NLRB, Linda M. Leslie, ultimately sided with the union in this regard, stating in an <a href=\"https://big.assets.huffingtonpost.com/athena/files/2022/02/19/62104b58e4b060c5c1ec8314.pdf\">order</a> that “[h]aving carefully considered the matter, I find that the Employer’s failure to timely serve its Statement of Position precludes it from litigating any of the issues raised in its untimely Submission.”</p><p id=\"JeoEY2\">If the delaying statement had been submitted on time and found in favor of Starbucks, it could’ve potentially delayed efforts by several weeks. These delaying actions are among many union-busting tactics and give companies more time to persuade employees to vote against the formation of a union. </p><p id=\"lajqOJ\">While some stores have already managed to unionize, for others, the fight continues in part to the increasing pressure of <a href=\"https://one.starbucks.com/\">anti-union campaigns</a> put in place by Starbucks.</p><p id=\"Au8rBf\">If the store votes for a union, it will join the ranks of two other stores in Buffalo that organized last year and will become part of a growing effort to improve the representation of employee interests with Starbucks.  </p><p id=\"WITgYI\">           </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7ZXmjPZ8qtVfy2sZ4XujCv7LQBE=/0x71:635x403/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268701/Screenshot_2022_02_24_145750.png",
  "description": "The crash caused the firm to miss an important deadline.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}