{
  "title": "Overtaxed: Public accountants are deducting themselves from their jobs",
  "url": "https://www.theverge.com/2022/1/31/22903016/public-accountants-big-quit-memes-reddit",
  "date": "2022-01-31T13:00:00.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"Calculator on fire, displaying “I Quit” on it’s cracked screen. \" src=\"https://cdn.vox-cdn.com/thumbor/1IJz1_eQ_mKMARqsYhFnPHGeJ-g=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70452534/acastro_220128_4980_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>Busy season is here — but some public accountants aren’t</p> <p class=\"p--has-dropcap p-large-text\" id=\"nnOf71\">Browsing r/Accounting, two things become apparent: first, we are entering what accountants call “busy season,” and second, a lot of public accountants are triumphantly quitting. In <a href=\"https://www.reddit.com/r/Accounting/comments/s1mh7u/put_in_my_notice_i_am_fleeing_public_accounting/\">one recent post</a>, titled “Put in my notice, I am fleeing public accounting baby!!,” commenters congratulate the poster on their escape. “I think I am about to be done,” <a href=\"https://www.reddit.com/r/Accounting/comments/s1qfj4/i_think_i_am_about_to_be_done/\">reads another post</a>. “When is the best time to bail from PA?” <a href=\"https://www.reddit.com/r/Accounting/comments/s1h6fz/when_is_the_right_time_to_bail_from_pa/\">asks a third.</a></p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\"A man applies clown paint as he tells himself “It’s ok the senior left, we have another. It’s ok he left too. We have a manager. It’s ok he’s out of the country, I know what to do. This is a learning opportunity.”\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0dI_L3VBFJoUHZbMvDb99RWEozs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23197549/Screen_Shot_2022_01_26_at_1.59.53_PM.png\">      <cite><a class=\"ql-link\" href=\"https://www.reddit.com/r/Accounting/comments/rhs132/this_busy_season_will_be_better/\" target=\"_blank\">Reddit</a></cite>      <figcaption>A meme from r/Accounting</figcaption>  </figure></div><p id=\"EaL7M3\">The Great Resignation has come for accounting, and public accountants — people who help many clients prepare documents, as opposed to the internal accountants at a specific firm who work only on that firm’s financials — have been feeling the pain. In a normal pre-pandemic year, about 15 percent of staff leaves public accounting firms below the Big Four, which are Ernst &amp; Young (EY), PricewaterhouseCoopers (PwC), Deloitte, and KPMG. While there isn’t yet any hard data, turnover seems higher, says Michael Platt of Inside Public Accounting, who is in the middle of doing surveys for the 2021 calendar year. “Everybody we’ve talked to said that their turnover rates in the last couple of months have been significantly different than in previous years,” Platt says.</p><p id=\"apak7V\">Public accounting has always been a difficult job. Many young accountants are recruited as undergraduates. They go into the field understanding that they will work long hours during “busy season,” when most companies and people file their taxes, which begins in January and ends in April. (There is a secondary busy season in the fall when there’s another tax deadline.) Some of the accountants I spoke to explained that 70- or 80-hour weeks were the norm during the busy season. Those hours strain people’s mental health and relationships.</p><div><aside id=\"RumaXO\"><q>“Generally, like, everyone feels those frustrations, everyone feels burned out.”</q></aside></div><p id=\"3A7FKf\"><a href=\"https://www.reddit.com/r/Accounting/comments/rhs132/this_busy_season_will_be_better/\">On r/Accounting</a>, <a href=\"https://www.reddit.com/r/Accounting/comments/ruci0t/when_the_break_is_coming_to_an_end_and_you/\">users are already</a> <a href=\"https://www.reddit.com/r/Accounting/comments/s23x5o/busy_season_goes_brrrr/\">posting memes</a> <a href=\"https://www.reddit.com/r/Accounting/comments/pfgmlg/college_students_checking_out_the_subreddit/\">about busy season</a>. Some users swapped tips about <a href=\"https://www.reddit.com/r/Accounting/comments/rljdul/what_are_busy_season_must_haves_in_your_cubicle/\">what to bring to the office</a> to make the late nights comfortable if the heat shuts off: blankets, space heaters, electric heating pads. There are <a href=\"https://www.reddit.com/r/Accounting/comments/rwocu1/you_guys_were_right_busy_season_at_b4_is_truly/\">several posts</a> with a <a href=\"https://www.reddit.com/r/Accounting/comments/rwocu1/you_guys_were_right_busy_season_at_b4_is_truly/\">general theme</a> of “wow, you guys were not exaggerating <a href=\"https://www.reddit.com/r/Accounting/comments/rymdig/yall_werent_kidding_about_busy_season/\">about busy season</a>.” In response to an <a href=\"https://www.reddit.com/r/Accounting/comments/rwa2if/how_do_you_stay_in_shape_during_busy_season/\">inquiry about how to stay in shape during busy season</a>, one person wrote about a diet of Adderall, water, and junk food, while another chimed in, “Vyvanse and protein shakes.” A third suggested busy season was the best time to be on a diet; a fourth said they were too stressed to eat.</p><p id=\"FdDlmz\">On Reddit, many people are “more unfiltered with their frustrations,” says Joan, who quit her position at EY in November 2021, and who asked to use a pseudonym out of fear of retaliation. She’s also a user of r/Accounting. “So it perhaps seems like it’s a little bit harsher than what people might be talking about amongst themselves. But generally, like, everyone feels those frustrations, everyone feels burned out.”</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\"A penguin’s top half facing right, captioned “met the best senior I could hope for in b4.” The penguin’s bottom half, facing left, says “she quit in 1 month.”\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8t3OwYYt_Juhd8YIYzW3C_PcW3g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196923/Screen_Shot_2022_01_26_at_11.00.00_AM.png\">      <cite><a class=\"ql-link\" href=\"https://www.reddit.com/r/Accounting/comments/s962bb/she_actually_make_audit_bearable/\" target=\"_blank\">Reddit</a></cite>      <figcaption>Reddit meme</figcaption>  </figure></div><p id=\"ZdeiKW\">Few outside the industry think of accounting as a job hit particularly hard by the pandemic. But on top of all of the logistical problems and work-life balance issues that many white-collar employees struggled with, accountants also found themselves with swelling workloads as companies looked to them to figure out how to get aid through the economic relief packages passed in 2020 and 2021. Meanwhile, staffing shortages meant longer hours for many accountants — but without the camaraderie or job perks that made those hours easier. Combine all that with wages that haven’t changed much in decades, and it’s a recipe for rage-quits.</p><p id=\"r3RLHm\">“It’s pretty clear that churn and burn or burn and churn is kind of the MO of the public accounting firm,” Joan says. She says she was surprised that there wasn’t more effort made to retain her when she quit because so many other people were also leaving. “It just seemed like, every week, you were getting one of those goodbye emails from someone.”</p><p id=\"6Kfr4U\">Deloitte, EY, and KPMG didn’t respond to multiple emailed requests for comment. </p><p id=\"1dn7Cf\">PwC has made efforts to prioritize their employees’ well-being, such as free mental health support, $2,000 reimbursements for childcare, reduced work schedules, and $1,200 a year to help pay back student loans, according to the company’s Deputy People Leader, Yolanda Seals-Coffield. “We also remain committed to competitive pay,” she said, pointing to a 5 percent salary increase for US and Mexico full-time employees and a new skill-based bonus. And last April, PwC workers got an extra week of pay as a “thank you” bonus, she said.</p><div><aside id=\"ceBG1C\"><q>“You’re working a lot of hours, you’re not getting paid enough, and that causes people that have the skillset to sit there and say, ‘I’m not being appreciated.’”</q></aside></div><p id=\"56mRai\">Over the last 20 years, the pay in accounting has stagnated, even as audits have gotten more arduous, says Joe Schroeder, an associate professor of accounting at Indiana University’s Kelly School of Business. Before entering academia, he worked at EY, beginning in 2003 as an intern before being hired full-time as a public accountant in 2004. The passage of the Sarbanes-Oxley Act and standards from the Public Company Accounting Oversight Board, a nonprofit body that oversees audits, have required more documentation from accountants, he says. That extra work cuts into the profit margin at accounting firms — meaning there’s less money for raises.</p><p id=\"iya1Xq\">When Schroeder left public accounting in 2008 for academia, starting salaries for accountants were $52,000 in Indianapolis. In 2014, during his first term as a professor at Indiana University, where he is now the PwC Faculty Fellow, he asked his students how much the starting salaries for accountants were. They told him $52,000.</p><p id=\"daN8xm\">“You’re working a lot of hours, you’re not getting paid enough, and that causes people that have the skillset to sit there and say, ‘I’m not being appreciated,’” says Schroeder.</p><p id=\"SxiTsO\"></p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\"A man in clown makeup faces a mirror. The image is titled “Me getting ready for work when there’s a chick selling her farts in a jar for 50k a week.”\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/A_JTdKiHrYK7vIk6TiTgkEwCG2o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196918/Screen_Shot_2022_01_26_at_10.56.48_AM.png\">      <cite><a class=\"ql-link\" href=\"https://www.reddit.com/r/Accounting/comments/s23x5o/busy_season_goes_brrrr/\" target=\"_blank\">Reddit</a></cite>      <figcaption>Reddit accounting meme</figcaption>  </figure></div><p id=\"dXIdez\">But he doesn’t blame the accounting firms. They can’t easily raise rates on their audit and tax services since they’re a commodity, Schroeder says. If one firm raises rates, their clients may simply go to another firm. </p><p id=\"3r5JV2\">Schroeder’s academic research has shown that accountants’ pay has <a href=\"https://link.springer.com/article/10.1007/s11142-018-9458-y\">direct effects on the quality of audits</a>. When accountants are paid lower salaries, they are more likely to make mistakes on their clients’ financial statements — resulting in restatements later.</p><p id=\"cX5b4c\">And according to Schroeder, burnout also affects audit quality. (<a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3095057\">At least one study</a> has found that poor work-life balance leads to worse audits.) During a pandemic, it can be difficult to do on-site audits and other methods for fraud prevention. In the case of the <a href=\"https://www.wsj.com/articles/SB122651368234821319\">famous fraud ZZZZ Best</a>, Barry Minkow’s company went to great lengths to trick auditors — even <a href=\"https://www.latimes.com/archives/la-xpm-1987-09-06-mn-6256-story.html\">showing them buildings</a> as a charade. Now, if an auditor is on-site virtually, fraudsters may not have to go to such lengths.</p><div><aside id=\"zz6moR\"><q>“If I was committing fraud before the pandemic, I’d view the pandemic as the greatest gift I could ever receive.”</q></aside></div><p id=\"AKRSc3\">“If I was committing fraud before the pandemic, I’d view the pandemic as the greatest gift I could ever receive, right?” Schroeder says. “Because I could sit there and unwind the fraud and then blame it on the pandemic.” Accountants might simply be too overworked to notice.</p><p id=\"d9SzuO\">Accountants who are also studying for the CPA exam have it even worse. Deion Scott, a Redditor who was working for PwC until April of 2021, says that during 2020’s busy season, he got up at 6:30AM, studied for the CPA exam until 8AM, and then had coffee and breakfast. Then, he worked at his job until 4PM, when he’d order food. At 6:30PM, he’d go back to work until 10:30PM or 11PM. “I’d go to sleep, then do it again the next day,” he says. Weekends, he aimed to work six hours on Saturday and tried to take Sunday off.</p><p id=\"bEpWCO\">As of the beginning of the pandemic, in May 2020, there were 1.2 million people employed as accountants, and they made a mean salary of $81,660, according <a href=\"https://www.bls.gov/oes/current/oes132011.htm\">to the US Bureau of Labor Statistics</a>. And before COVID-19, there were perks. One was travel; some accountants told me that travel was a part of the job they enjoyed. Another perk was free dinner on days accountants worked late in the office. There was camaraderie — plus, it was easier to learn from experienced accountants in-person, several people said. </p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\"An image of a person altering a COVID-19 test to show a positive result, captioned “Staff when they get selected for a 12/31 inventory count.”\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gyxN3xlQQ9ntp4BAeRNM59dqE8A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196932/Screen_Shot_2022_01_26_at_11.02.23_AM.png\">      <figcaption>Reddit meme</figcaption>  </figure></div><p id=\"kdmV4U\">Jennifer Wilson, who runs ConvergenceConsulting, a consulting firm focused on accounting, says staff shortages are a particular pain point for accounting firms. “There isn’t any doubt that the accounting profession has been touched by the great resignation, or the great migration, or the big quit, or whatever,” says Wilson. </p><p id=\"lNIT8k\">And clients have needed accountants more than usual during the pandemic — both to try to guess what to do next but also to help them wade through pandemic-related legislation such as the Cares Act and PPP. “The CPA profession is the first financial responder of the pandemic,” Wilson says. </p><div><aside id=\"4woLEl\"><q>“It seemed like we communicated even less on a social or personal basis, which was kind of weird to me.”</q></aside></div><p id=\"Ggofme\">Working from home was a big shift. If anything, accountants worked longer hours at home because they felt like they were always on call. Inexperienced accountants found it harder to ask for help from more experienced colleagues, and <a href=\"https://www.reddit.com/r/Accounting/comments/s7s7lq/as_an_a1_im_not_a_big_fan_of_the_wfh_environment/\">some found it lonely</a>. “It seemed like we communicated even less on a social or personal basis, which was kind of weird to me,” Joan says. “It really felt like we were all trying to row the boat but not knowing what everybody else — what pace they were going, what direction they were going in. And so that was extremely difficult.”</p><p id=\"GGRCGh\">Clients also tended to be shorter with her, Joan says. No one likes talking to an auditor anyway, but without face-to-face interaction, people were more abrupt or rude.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\"A picture of a frightened-looking dog captioned “When the break is coming to an end and you realize tomorrow is the start to your busy season… “\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RLsk2K_5SOab8hUYhb-Z7aOcgIs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196920/Screen_Shot_2022_01_26_at_10.57.00_AM.png\">      <cite><a class=\"ql-link\" href=\"https://www.reddit.com/r/Accounting/comments/ruci0t/when_the_break_is_coming_to_an_end_and_you/\" target=\"_blank\">Reddit</a></cite>      <figcaption>Reddit meme</figcaption>  </figure></div><p id=\"uItWeF\">When Scott worked in person at PwC, he could expense a $25 dinner if he was in the office for 10 hours. When he moved to working from home during the pandemic, the free food vanished, he says. He also found it more difficult to focus at home — he didn’t have a separate room for work. Though PwC did send a $250 stipend for work-from-home adjustments in October 2020, Scott didn’t receive the raise he expected in July.</p><p id=\"xIPKN2\">He wasn’t alone. Accountants were working harder during the pandemic, and yet almost two-thirds of accountants <a href=\"https://www.imanet.org/-/media/b60f79f4b1a04f8b8b88ae1760e24231.ashx?la=en\">surveyed by the Institute of Management Accountants</a> said they didn’t receive a raise in 2020, and 29 percent had their salaries or bonuses cut or were given furloughs. A third of public accountants who responded to the survey said their pay was cut.</p><p id=\"bM8Pni\">Scott got a raise in January 2021 — an attempt to make up for the one skipped in July 2020, he says. But he didn’t stick with public accounting. Once he got his CPA, he’d done everything he’d wanted to achieve, so he took a job working for the investment firm Norwest Venture Partners as a tax associate. “I love tax,” Scott says. </p><p class=\"c-end-para\" id=\"KTl1b8\">Joan now works for a local government, where the pay is much better than what she made at EY. “That’s totally counterintuitive, right?” she says. “Nobody thinks you’re going to make more money in government. But they understand that they need to attract better candidates. And the easiest way is with a bigger salary.”</p><p id=\"8Rnc1V\"><em><strong>Update, Jan. 31 10:23AM</strong></em><em>: Adds the name of PwC’s deputy people leader, whose remarks a spokesperson sent to us.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3xmZIKsp_XwoBWlDbgvAsHEMhbs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23202312/acastro_220128_4980_0001.jpg",
  "description": "\"It just seemed like every week, you were getting one of those goodbye emails from someone.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}