{
  "title": "Overwatch developers confirm my conspiracy theory about Lúcio’s hair ",
  "url": "https://www.theverge.com/2022/4/18/23030890/overwatch-2-lucio-hair-conspiracy-theory",
  "date": "2022-04-18T21:04:41.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/RWDlfFpuv2RtaYtDsapRkbXgWYY=/60x0:1860x1200/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70764055/Lucio_008.0.jpg\" />        <figcaption>Blizzard Entertainment</figcaption>    </figure>  <p id=\"SXDWy1\">At long last, I’ve finally uncovered the truth behind an <em>Overwatch</em> question that’s plagued me for six years: what the hell is going on with Lúcio’s hair? </p><p id=\"Gp2Oj7\">Last week, <a href=\"https://www.theverge.com/2022/4/14/23025227/overwatch-2-sojourn-blizzard-closed-beta\">I talked with <em>Overwatch 2</em> developers Geoff Goodman and Dion Rogers about Sojourn</a>, the game’s first Black female hero. Since this was the rare chance to be alone with a couple of <em>Overwatch</em> developers, I took the opportunity to ask a burning question about another Black <em>Overwatch</em> hero: Lúcio</p><p id=\"bhJawY\">Lúcio is my favorite pre-Sojourn <em>Overwatch</em> character both for his gameplay and his story. He’s a healer with unique movement and healing abilities. He was one of the first and only characters I devoted myself to mastering (with dubious, less-than-mastered results) despite not being big on team-based shooters. He’s also this cool, quadruple platinum, Afro Brazilian DJ with an affinity for frogs who decided to join a group of international freedom fighters to stop the corporate gentrification of his favela. I was drawn to him instantly. But one thing that always <em>bothered</em> me about this Beyonce-with-a-gun character was his hair.</p><p id=\"syWEw9\">I’m <a href=\"https://www.theverge.com/2022/2/25/22951205/elden-rings-character-creator-black-hairstyles\">obsessed</a> <a href=\"https://kotaku.com/i-spent-three-hours-in-baldur-s-gate-3-s-character-crea-1845328223\">with</a> <a href=\"https://kotaku.com/cyberpunk-2077-s-character-creator-the-kotaku-review-1845882374\">Black hair</a> in video games as, for Black women in particular, hair is such a sensitive topic. A couple of weeks ago, we could not stop talking about <a href=\"https://www.theroot.com/oscars-2022-on-will-smith-chris-rock-and-the-slap-he-1848714623\">an event</a> that was, at its core, <a href=\"https://www.theroot.com/alopecia-jada-pinkett-smith-her-hair-loss-disorder-e-1848723271\">about a Black woman’s hair</a>. There were <a href=\"https://en.wikipedia.org/wiki/Tignon_law\">laws written in the 18th century</a> legislating how Black women could wear their hair. Even today, in the supposed “enlightened age” of 2022, we’re passing <a href=\"https://www.thecrownact.com/\">laws protecting Black people from hair discrimination</a> after people were <a href=\"https://www.vox.com/2018/4/18/17242788/chastity-jones-dreadlock-job-discrimination\">losing job opportunities</a> and <a href=\"https://www.freep.com/story/news/local/michigan/2021/09/16/lawsuit-girl-haircut-teacher-mount-pleasant/8364089002/\">kids were having their hair cut against their will</a>.</p><p id=\"SdRqiw\">So much of my own self-worth has been tied to my hair. I’ve rocked wigs, extensions, and dreadlocks. I’ve worn my hair straightened, natural, and, now, cut short. So I’m particularly sensitive to how Black hair is represented in video games, which brings us to Lúcio and the case of his bewildering hair.</p><p id=\"31e7sb\">You see, he’s got these huge — <em>huge </em>— dreadlocks that looked so odd and unnatural that I crafted this elaborate conspiracy theory that it’s not actually his hair at all but, rather, a piece of performance art. Yes, I’m a Lúcio hair truther. I’ve had dreadlocks before. I know how capital “B” big they can get depending on how you maintain them (or don’t). But Lúcio’s locks didn’t seem real to me. They looked like they were made out of foam rather than something that grew out of his head.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/k3ImmpsL2azWVXQIMYRvfHXOi0I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23398507/lucio.jpg\">      <cite>Image: Blizzard Entertainment</cite>  </figure><p id=\"8w9xMy\">Where most Black video game hairstyles fail is when creators don’t account for hair texture. It’s why a lot of the afro styles you can pick in a game’s character creator look like these big, matte balls of not-sure-what-that-is-but-it’s-not-hair or why the afro style in <em>Tiny Tina’s Wonderlands</em> looks like the armor model for <em>Elden Ring</em>’s Loathsome Dung Eater. </p><div id=\"vwTPl5\"><blockquote class=\"twitter-tweet\"><p lang=\"und\" dir=\"ltr\"><a href=\"https://t.co/CRcu2ekSKj\">pic.twitter.com/CRcu2ekSKj</a></p>— Ash Parrish (@adashtra) <a href=\"https://twitter.com/adashtra/status/1508899388512477185?ref_src=twsrc%5Etfw\">March 29, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"MxH5jX\">I understand that creating any kind of hair texture in a video game is a laborious process, so I’m usually willing to chalk up a bad texture to time constraints and the limitations of a game’s engine. But Lúcio’s style of flat-against-the-head cornrows that bloomed into big, bouncy… things??? was just so weird that I rejected that premise in favor of going full tin foil hat, literally. In my hypothesis, Lúcio’s hair is actually a hat that he wears as part of his DJ persona. It’s like Daft Punk or Deadmau5’s helmets. It’s a theory I’ve held for years until I finally had the chance to ask the <em>Overwatch</em> developers and confirm my suspicions. </p><p id=\"A7G0e6\">“Yeah, your theory is correct,” said Rogers, art director for <em>Overwatch</em>. Sweet, sweet vindication. Rogers also shared that, with <em>Overwatch 2</em>, Lúcio’s hair would get an update. </p><p id=\"eqrEHI\">“We improve that for <em>Overwatch 2</em>,” Rogers said. “A big part of the research that we did was trying to create more culturally correct ethnic hair. You can see that improvement in his <a href=\"https://overwatch2.playoverwatch.com/en-us/explore/new-look\"><em>Overwatch 2</em> concept art</a>. The foam loc headpiece is replaced with more natural (and texturized!) hair that still pays homage to his DJ persona, ending in bright neon coils that remind me of <a href=\"https://www.google.com/search?q=cybergoth+wig&amp;oq=cybergoth+wig&amp;aqs=chrome..69i57.3420j0j7&amp;sourceid=chrome&amp;ie=UTF-8\">cybergoth wigs of the late 2000s</a>.  </p><div id=\"7130O1\"><div data-anthem-component=\"imageslider:11149672\"></div></div><p id=\"YDh6pj\">While I’m glad to have my long-held suspicions finally put to rest, I’m equally glad Rogers and his team understood hair is important to a character’s identity, especially Black characters like Sojourn and Lúcio.</p><p id=\"umNn7A\">“Something that I think is pretty cool about the art team is that we have people dedicated to improving the perception of hair on ethnic characters,” Rogers said.  </p><p id=\"1tI5gP\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rbRwdePHhOaB_Sh-SDWQWTYxx4k=/0x98:1920x1103/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23398483/Lucio_008.jpg",
  "description": "I am a Lúcio hair truther.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}