{
  "title": "Oversight Board tells Meta to crack down on Facebook address doxxing",
  "url": "https://www.theverge.com/2022/2/8/22923388/facebook-doxxing-oversight-board-home-address-sharing-policy",
  "date": "2022-02-08T15:23:50.000Z",
  "author": "Russell Brandom",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-QYbDI5Actu-16GOGcSwVjtVVIg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70483760/acastro_180828_1777_facebook_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Dqrdp2\">In <a href=\"https://oversightboard.com/news/673967193790462-oversight-board-publishes-policy-advisory-opinion-on-the-sharing-of-private-residential-information/\">an opinion issued on Tuesday</a>, the Oversight Board called on Facebook and Instagram to place tighter restrictions on sharing the addresses of private homes, intended as a protection against doxxing and targeted harassment.</p><p id=\"HVIcAY\">The opinion comes in response to a request issued by Meta (the parent company of Facebook and Instagram) in April 2021. Currently, Facebook prohibits the sharing of private information broadly but makes a general exception for information that is “publicly available” — defined as having been published in five separate news outlets.</p><p id=\"znQmb1\">The board recommends crafting a tighter policy specifically for information on private residences. It urges removing the exception for publicly available information and creating a specific enforcement channel to prioritize reports of doxxing, including from targets who are not users of Facebook or Instagram.</p><p id=\"7LPvV7\">The board emphasized that the platforms should still allow for protests at publicly owned official residences and not take down posts in which a user is sharing their own address. Still, the overall effect is to tighten moderation on posts containing addresses or street-side imagery of homes.</p><p id=\"Bt8KZx\">“The Board understands that the sharing of private residential addresses and images represents a potentially serious violation of the right to privacy,” the board wrote in a summary of the decision. “As the potential for harm is particularly context specific, it is challenging to develop objective and universal indicators that would allow content reviewers to distinguish the sharing of content that would be harmful from shares that would not be. That is why the Board believes that the Privacy Violations policy should be more protective of privacy.”</p><p id=\"gDdRUc\">Meta declined to comment on the board’s new opinion.</p><p id=\"qY3dWu\"><a href=\"https://www.theverge.com/2016/6/21/11982928/what-is-doxxing-explainer-internet-security\">A long-standing feature of online harassment campaigns</a>, doxxing uses the disclosure of personal information like addresses and phone numbers to coordinate actions against a particular target. Home addresses are linked to the most dangerous types of harassment, from swatting to physical attacks. At the same time, the information involved in doxxing is, by definition, available on the internet, and doxxing groups often defend their actions as merely the sharing of publicly available data.</p><p id=\"DmmN1B\"><a href=\"https://www.theverge.com/2020/5/6/21249427/facebook-oversight-board-nobel-peace-prize-instagram-snowden\">Launched in 2020</a>, the Oversight Board functions as an external review panel for the moderation policies set by Facebook, Instagram, and other Meta platforms. While funded by a grant from the company, it operates under an independent charter, with opinions formed by an international panel of legal scholars. Crucially, Meta is not legally bound by the board’s recommendations and may ignore or delay implementation at its own discretion.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/O3t-YbUpkAz9E1kFH_L2s4mUUUY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742467/acastro_180828_1777_facebook_0001.jpg",
  "description": "You can still share your own address, though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}