{
  "title": "Overwatch 2’s new hero Sojourn was a long time coming",
  "url": "https://www.theverge.com/2022/4/14/23025227/overwatch-2-sojourn-blizzard-closed-beta",
  "date": "2022-04-14T19:00:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sj_-WNFrr6Etk1OY2AvqwiTkENo=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70749813/sojourn.0.png\" />        <figcaption>Blizzard Entertainment</figcaption>    </figure>  <p>An exclusive chat with developers about Overwatch’s first Black female hero</p> <p id=\"5c1zcL\">Ahead of <a href=\"https://www.theverge.com/2022/3/18/22984763/overwatch-2-beta-release-date-faq-activision-blizzard\"><em>Overwatch 2</em> starting its closed beta</a> (and amid the <a href=\"https://www.theverge.com/2021/7/28/22597113/activision-blizzard-california-sexual-harassment-lawsuit-discrimination-employee-action\">ongoing litigation against its publisher</a>, Activision Blizzard), the <em>Overwatch</em> team would like you to meet <a href=\"https://www.theverge.com/2022/3/10/22970734/blizzard-overwatch-2-closed-beta-alpha-annoucement-sojourn\">Sojourn</a>. In an exclusive interview with <em>The Verge</em>, Sojourn’s creators talked about what it took to bring the game’s 33rd character and first Black woman hero to life.</p><p id=\"Y0AKHF\">“She’s been around in our hearts and in our game in some form for so long,” said Geoff Goodman, <em>Overwatch 2</em>’s lead hero designer. “It’s amazing to get her out there.”</p><div id=\"WIOpbn\"><div ><iframe src=\"https://www.youtube.com/embed/rPNNTMu4iko?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"L3LcFw\">Sojourn is a damage hero, and damage characters in <em>Overwatch</em> are typically split into two categories: hitscan and projectile, each with their own strengths, weaknesses, and skill levels. Sojourn is a bit of an all-rounder, with both projectile and hitscan damage. “She has this projectile weapon that builds up a lot of your damage,” Goodman said. “And her alternate fire, like the core of her kit, is this is awesome railgun attack.”</p><p id=\"sZT81v\">Her weapon’s primary fire shoots a projectile that needs to be carefully aimed. Successful hits power up her weapon’s secondary fire, a railgun that fires a blast that can do massive damage the more energy it has. Sojourn’s disruptor shot ability snares and slows enemies while juicing up her secondary fire. Her power slide allows her to quickly dodge under protective shields to better get at the soft underbelly of enemy healers. Sojourn’s ultimate ability, Overclock, supercharges her railgun’s secondary fire, allowing her to fire it multiple times at max damage for a short duration. According to the <a href=\"https://playoverwatch.com/en-us/news/23789252/heroes-aren-t-born-they-re-made-an-in-depth-introduction-to-sojourn/\"><em>Overwatch </em>blog post introducing Sojourn</a>, Overclock is if Genji’s Dragon Blade ability used a gun instead of a sword. </p><p id=\"AgKOrw\">Her designers wanted Sojourn to be accessible to casual players while also having a high skill ceiling for advanced players and professionals. </p><p id=\"oXqDvI\">“In our play tests when we play Sojourn she’s the answer,” said art director Dion Rogers. “Like if we’re not dealing enough damage, switch to Sojourn and she starts to finish people off. If healers are too protected, switch to Sojourn and she’ll deal with them. There’s a bit of flexibility in her.”</p><p id=\"ky8elE\">In addition to <em>Overwatch 2</em>’s closed beta starting on April 26th, the fifth season of the Overwatch League will begin on May 5th. Sometimes it takes a long time for a new hero to see League play, if players and coaches decide to use a character at all. (There are a handful of characters that are so underutilized that it becomes an event if they see playtime.) Sojourn seems to be shaping up to make an opening-day appearance.</p><p id=\"XrhP7M\">“It was exciting to watch pro players experiment with Sojourn during the alpha and see all the ways her kit can turn the tides of a team fight,” competitive operations lead Brad Ross told <em>The Verg</em>e via email. “While the meta and team strategies will assuredly be fluid throughout the season, our prediction is that Sojourn’s presence in OWL will be felt quickly.”</p><div id=\"BVxfrG\"><div ><iframe src=\"https://www.youtube.com/embed/yrOQs_8litU?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"cHkpom\">Sojourn has been a long time coming, <a href=\"https://kotaku.com/overwatch-has-had-a-black-female-character-in-developme-1834244190\">too long</a> for <a href=\"https://www.kotaku.com.au/2019/01/overwatch-fan-writes-letter-to-jeff-kaplan-about-black-women-gets-heartfelt-response/\">the game’s Black female fans</a>. In a game that’s pretty explicitly about people from all walks of life teaming up to fight evil, a Black woman was nowhere to be found, rarer than four robots, two sentient animals, and two different cowboy characters. </p><p id=\"fcnL0n\">Rogers acknowledged this and gave an explanation <em>why</em> it took so long.</p><p id=\"3vXQxN\">“When we started making this game, we made a pretty detailed history and lore for the world of the game. It helps us create [character] designs,” Rogers said. “The initial group of <em>Overwatch</em> that Sojourn was a part of, was a history that was before the game started.”</p><p id=\"JLne42\">As heroes were added to <em>Overwatch</em>, a lot of times they were created to answer a specific question or fulfill a need. The famous example of this was Brigitte back in 2018. In the Overwatch League and on the game’s competitive ladder, teams overwhelming adopted a style of play that favored a quick, hit-and-run style of attack starring Tracer. Brigitte, with her stun abilities, was then added to counterbalance that playstyle’s power.</p><p id=\"ipmj0G\">Part of the reason why Sojourn took so long to arrive in <em>Overwatch</em> was that the developers wanted to ensure her addition could adequately portray the significance of her character to the game’s story. Sojourn isn’t meant to be a check against a particular style of play; she is meant to be a central, important figure. </p><p id=\"nuCAdx\">“We created this timeline, and we wanted Sojourn — especially since she’s the first Black female character of the game —  to not just be a random addition to the game,” Rogers said. </p><div class=\"c-float-right\"><aside id=\"ivRSX0\"><q>Sojourn isn’t meant to be a check against a particular style of play; she is meant to be a central, important figure</q></aside></div><p id=\"koodSZ\">The difficulties of <a href=\"https://www.theverge.com/2021/11/2/22760118/activision-blizzard-delays-overwatch-2-and-diablo-4-again\"><em>Overwatch 2</em>’s protracted development</a>, then, made it impossible to add Sojourn sooner without diluting her importance to the story. </p><p id=\"bip7lF\">“She had a deep, lore connection to the game world,” Rogers said. “She moves the storyline forward when she’s introduced.”</p><p id=\"DyB3pB\">A concern for spoilers and surprises made learning any details about who Vivian “Sojourn” Chase is as a person difficult. Her designers did share that they took inspiration from Angela Bassett’s commanding presence and Serena Williams’ power and speed when creating her look. </p><p id=\"L70xmx\">“We definitely wanted to make a Black woman that felt authentic,” Rogers said.</p><p id=\"pxLtrS\">That authenticity shows in her hairstyle, which features the best hair texture heretofore unseen in other games that feature Black hair. But that authenticity wavers a bit when we examine her clothes. Sojourn is a Black Canadian. It gets cold in Canada; in fact, the new Toronto map that will be introduced in <em>Overwatch 2</em> features heavy snow and ice. Sojourn is wearing shorts. Black folks, for the most part, Canadian or otherwise, do not wear shorts in the snow.</p><p id=\"le9YRo\">“She has bionic legs,” Rogers laughed. “So they’re heated.”</p><p id=\"0sZ8QD\">Speaking of legs, the developers are also prepared for the inevitable thirst tweets that will follow Sojourn’s arrival in <em>Overwatch 2</em>. </p><p id=\"tfKoXC\"></p><p id=\"wwbw8a\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OZ_C7qYpLY8-YP12bVYnF5ZUd7k=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23389824/sojourn.png",
  "description": "Serena Williams and Angela Bassett inspired Sojourn’s look.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}