{
  "title": "Overwatch 2’s new ping system gives players more ways to communicate",
  "url": "https://www.theverge.com/2022/3/24/22994901/overwatch-2-ping-system-closed-beta",
  "date": "2022-03-24T19:25:11.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/0lYeNpZdWIXt5xqq959ZKuNFT8M=/0x22:1280x875/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70667904/overwatch2.0.jpg\" />        <figcaption>Blizzard Entertainment</figcaption>    </figure>  <p id=\"fObzXz\">In the wake of the <a href=\"https://www.theverge.com/2022/3/18/22984763/overwatch-2-beta-release-date-faq-activision-blizzard\"><em>Overwatch 2</em> beta date announcement</a> and <a href=\"https://youtu.be/GgaWQMkS0AI\">an apologetic video</a> from game director Aaron Keller promising the team would give <a href=\"https://www.theverge.com/2022/3/10/22970734/blizzard-overwatch-2-closed-beta-alpha-annoucement-sojourn\">more consistent updates on progress</a>, the <em>Overwatch 2</em> news floodgates have officially opened. In this latest update, we’re offered a glimpse of <em>Overwatch 2</em>’s overhauled ping system.</p><p id=\"S5WPwp\">“We wanted to create a system that would enhance voice communication as well as provide alternative ways to share information with your team,” systems designer Gavin Winter says <a href=\"https://news.blizzard.com/en-us/overwatch/23785337/an-inside-look-at-the-ping-system-in-overwatch-2\">in the blog post</a>. </p><p id=\"N1V2gF\">New features include character-specific callouts in which, when a player makes a ping, their teammates hear that notification in that player’s hero’s voice. The blog gives an example: “if you’re playing Tracer and ping an enemy Reaper, your teammates will hear Tracer call out that Reaper’s location.” The blog goes into further detail about how pings will show the last-known location for moving enemies, giving players more information on how to move through maps without worry of getting ambushed. There’s also a new feature that’ll ping a teammate’s location on the mini-map and allow players to respond to pings based on choices made in a new communication wheel. Now, whenever a team’s Genji starts spamming “I need healing,” the game will actually show friendly healers that Genji’s location on the mini-map so they can heal and thus shut him the hell up. </p><aside id=\"WDaQxP\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Activision Blizzard faces lawsuit and employee backlash over sexual harassment \",\"url\":\"https://www.theverge.com/2021/7/28/22597113/activision-blizzard-california-sexual-harassment-lawsuit-discrimination-employee-action\"}]}'></div></aside><p id=\"CllpOk\">An improved ping system has been a long-time ask from <em>Overwatch</em> players. Not only does it improve a team’s ability to communicate, but it’s also an important accessibility tool for players who can’t (<a href=\"https://www.thegamer.com/most-women-disguise-their-gender-when-gaming-online-to-avoid-sexual-harassment/\">or won’t</a>) participate in voice chat. The developers did note that the new ping system is a work in progress and subject to change as the game’s closed beta nears. </p><p id=\"I9pkm8\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/33QiUOFlGjI38v4OjfmHzRpWD58=/0x113:1280x783/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23343084/overwatch2.jpg",
  "description": "Ping as in in-game communication, not server ping",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}