{
  "title": "Panic isn’t sure if people will like the Playdate’s seasonal model",
  "url": "https://www.theverge.com/2022/4/26/23041825/panic-playdate-season-one-two-release-model",
  "date": "2022-04-26T15:18:31.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BbcK9KUtbmzxavVKxsvkUJtLdbs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70794991/vpavic_220415_5149_0080.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"WU6NNs\">Panic has just begun shipping the Playdate, its unusual new gaming handheld. Part of the Playdate’s appeal is its quirky hardware: in an era where new handhelds have glorious OLED screens or are powerful enough to play your library of Steam games, the Playdate is a tiny device that has a crank and can only display games in black and white. But the Playdate is also interesting because of its “season” release model for games.</p><p id=\"jhPTfk\">Everyone who purchases a Playdate will get access to a full season of 24 games, though you won’t be able to play all of them right away. Instead, you’ll get two games when you first set up the device, and after that, Panic will send you two new games on Mondays in an almost TV show-like release cadence. </p><div class=\"c-float-right\"><aside id=\"APAoh4\"><q>“I think I would want to take my time with each of them”</q></aside></div><p id=\"fqqv0a\">“We’ve been excited about the idea of the delivery over time because getting 24 games at once on a device to me, for me personally, I would bet would be sort of overwhelming,” Greg Maletic, director of special projects at Panic, told me in an interview. “I think I would want to take my time with each of them. And the delivery over time kind of enforces that.” </p><p id=\"VW6zN7\">It’s an intriguing idea. Sony, Microsoft, and Nintendo all offer their own collections of games via their subscription services, but the sheer volume of titles available can make deciding to play and stick with any one game a formidable task. It’s akin to being paralyzed when trying to find something to watch on Netflix. And I’ve just come to accept that I’ll never catch up on my backlog of purchased games that I’ve never finished (or, in some cases, even started). Panic’s approach, in contrast, means you’ll be getting two games every week for about three months no matter when you buy a Playdate, so you’ll have a more limited selection to start with even if you’re getting a Playdate months after release. </p><p id=\"gbfu7D\">Panic isn’t sure how people will respond to the staggered releases, though. “Do people like that, or do they find that kind of annoying? We actually don’t really know yet,” Maletic said. The original intention was to release a “fully synchronized season for every owner,” <a href=\"https://help.play.date/games/season/\">Panic said on its website</a>. But to make that work, Panic would somehow have to ensure that a whole lot of people could all get their Playdates at the same time, which would prove challenging given things like <a href=\"https://www.theverge.com/2021/8/31/22648372/willy-shih-chip-shortage-tsmc-samsung-ps5-decoder-interview\">the global chip shortage</a> (which has <a href=\"https://www.theverge.com/2021/11/11/22776649/panic-playdate-delay-2022-handheld-battery-chip-shortage\">already affected the Playdate</a>).</p><aside id=\"3CcVa9\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Playdate review: all it’s cranked up to be\",\"url\":\"https://www.theverge.com/23025390/playdate-handheld-portable-gaming-console-review\"}]}'></div></aside><p id=\"9nlPyc\">Panic is also working on an app called Catalog, where you’ll be able to browse games right on Playdate, which could be a useful way to find new non-season games. “It’s going to be a curated selection of games that we like, that we’ve written, that we’ve commissioned… just found,” Maletic said. “We want to make them visible to the Playdate audience.” He noted that developers won’t need to be in the Catalog to sell Playdate games. (There are a handful of titles <a href=\"https://itch.io/search?q=playdate\">available right now on itch.io</a>, for example.) But with Catalog, “we wanted to be able to surface the [games] that we really wanted people to pay attention to.” Maletic said Catalog will be “hopefully coming out soon.”</p><p id=\"SY8iC9\">In the meantime, you can sideload games, which could be important for the device’s future. If Panic never makes a second season or if Catalog doesn’t prove to be a success, sideloading means you can download or buy games from other places even if Panic hasn’t explicitly approved or curated them.</p><p id=\"VJ5rcQ\">Given the experimental nature of the release schedule, Panic isn’t committing to a second season just yet. “But certainly, if people like it, then we will absolutely try and make it happen,” Maletic said.</p><div><div id=\"IdJDB6\"><div data-anthem-component=\"aside:11160992\"></div></div></div><p id=\"L8xY6b\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/l3vQR_6CKB6WiLgqL_gchkVa_g4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23396647/vpavic_220415_5149_0080.jpg",
  "description": "The seasonal release schedule is an intriguing idea.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}