{
  "title": "Panic’s first Playdate handhelds begin shipping Monday",
  "url": "https://www.theverge.com/2022/4/18/22955640/panic-playdate-handheld-ship-date-launch",
  "date": "2022-04-18T17:00:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PBGJbb8gxeIBn3ABRw7Ltk8cXKk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70762868/vpavic_220415_5149_0038.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"IIODVG\">Panic’s Playdate, its quirky Game Boy-like handheld with a crank, will finally begin shipping today, April 18th,<strong> </strong>the company announced.</p><p id=\"QbNw65\">“The first Playdate systems for customers in Group One will be shipped out gradually today and in the coming weeks,” Panic said in a press release. “Panic will be reaching out to customers in Group One when their units are shipping, and will also be in communication with any updates on when pre-order holders in other Groups can expect their Playdate systems to ship.”</p><div class=\"c-float-right\"><aside id=\"xGJCyJ\"><q>It’s unclear when the orders in Group One will be fulfilled</q></aside></div><p id=\"zhUvt4\">It’s unclear exactly how many Playdates will ship in the first round, but spokesperson Jurge Cruz-Alvarez did confirm to <em>The Verge</em> that shipments will start more slowly and then ramp up. Panic estimates that all Group One orders will have shipped by around late May, but that could be subject to change, Cruz-Alvarez said.</p><p id=\"KBui5f\">“We’ll ramp up our shipping volume every day to make sure all of our systems are working smoothly,” <a href=\"https://twitter.com/playdate/status/1516099272218923022\">Panic said in a tweet</a>. “We think we can get Group One out the door during the next month.”</p><div id=\"cdqx5v\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">You'll be emailed the moment yours is sent. We'll ramp up our shipping volume every day to make sure all of our systems are working smoothly. We think we can get Group One out the door during the next month. And remember, your season of games begins when you set up your Playdate.</p>— Playdate (@playdate) <a href=\"https://twitter.com/playdate/status/1516099272218923022?ref_src=twsrc%5Etfw\">April 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"CBW7Wd\">The first preorders for the device were originally supposed to ship at <a href=\"https://www.theverge.com/2021/7/22/22587193/playdate-preorder-how-to-panic-teenage-engineering-handheld-console\">the end of 2021</a>, but that timeline was pushed in November after Panic found the initial finished units had a <a href=\"https://www.theverge.com/2021/11/11/22776649/panic-playdate-delay-2022-handheld-battery-chip-shortage\">major battery issue</a>. </p><p id=\"naLMLf\">Everyone who gets a Playdate will have <a href=\"https://www.theverge.com/2021/8/4/22609923/playdate-handheld-crank-panic-game-season-one\">access to its first season of 24 games</a>. Two games will be delivered each week for 12 weeks, though those deliveries begin when you first connect your device to Wi-Fi, meaning that not everyone will have access to the same games at the same time.</p><p id=\"moX0SS\">You will be able to sideload games, and if you want to make your own, Panic has already released <a href=\"https://twitter.com/playdate/status/1498427655175159822\">a software development kit (or SDK</a>) and <a href=\"https://www.theverge.com/2022/1/19/22892269/panic-playdate-pulp-in-browser-game-builder-available-now-public-beta\">a browser-based game-making tool called Pulp</a>. Panic also announced a “Catalog” app today that will let you find or buy apps beyond what will be available in the first season.</p><p id=\"pY4QVr\">“Since we know that developers are going to want to sell their games and people are going to want to buy them, we’ve started work on Catalog, a brand new Playdate app where you’ll be able to easily buy curated games directly on your Playdate,” Panic co-founder Cabel Sasser said <a href=\"https://www.youtube.com/watch?v=BmrtkBmFSn4\">a in a video</a>. “Or, find some amazing games being sold elsewhere. We’ll keep you posted about Catalog when we have something more to talk about there.”</p><div class=\"c-float-right\"><aside id=\"Ax9OUT\"><q>New orders won’t ship until 2023</q></aside></div><p id=\"MH8GSm\">If you’re interested in learning more about the device, check out <a href=\"https://www.theverge.com/e/22789431\">Andrew Webster’s review</a>. However, if you place a new order right now, it won’t ship until sometime in 2023, according to Panic, and, depending on <a href=\"https://help.play.date/shipping/countries/\">where you live</a>, you’ll want to make sure that Panic can actually ship a Playdate to you. </p><p id=\"z6Vvhb\">Valve’s Steam Deck, its handheld gaming PC, also released later than originally planned — with initial orders for reservation holders finally opening up <a href=\"https://www.theverge.com/2022/1/26/22902930/valve-steam-deck-release-date-gaming-handheld-pc\">on February 25th</a>. Analogue got its first orders of the <a href=\"https://www.theverge.com/22831589/analogue-pocket-review\">Pocket handheld</a> out the door <a href=\"https://www.theverge.com/2021/11/22/22796303/analogue-pocket-preorder-ship-date\">at the end of 2021</a>, though, like with the Playdate, new orders won’t ship until 2023.</p><aside id=\"wqW1SU\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Playdate review: all it’s cranked up to be\",\"url\":\"https://www.theverge.com/23025390/playdate-handheld-portable-gaming-console-review\"}]}'></div></aside><p id=\"37hqUI\"><em><strong>Update April 18th, 1:48PM ET</strong></em><em>: Added information about Catalog.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Xo4r6afeRF-1X20Bu_65Ho9VlBo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23396642/vpavic_220415_5149_0038.jpg",
  "description": "It’s almost time to turn that crank.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}