{
  "title": "Paramount won’t stop making Star Trek NFTs",
  "url": "https://www.theverge.com/2022/4/6/23013716/paramount-nft-marketplace-star-trek-collectable-ships",
  "date": "2022-04-06T20:01:39.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/n0SuQHAcofx3O8a2XbmC2y0e2L0=/226x0:2407x1454/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70718489/Screen_Shot_2022_04_06_at_12.24.04.0.png\" />        <figcaption><em>Are you ready for the Star Trek metaverse?</em> | Image: Paramount</figcaption>    </figure>  <p id=\"CBfg8l\">Paramount is launching its NFT marketplace / metaverse / annoying marketing stunt that <a href=\"https://twitter.com/StarTrek/status/1511077401098293254\">fans are already angry about</a> with Star Trek non-fungible tokens (or NFTs.) The company partnered with Recur to create a platform called Paramount.xyz, which it says will “bring Paramount’s beloved entertainment entities, brands and characters to the metaverse.”</p><p id=\"xZ19MS\">Paramount is aping what’s worked for big NFT projects in the past; the Star Trek NFTs will depict “algorithmically-generated starships” and can be purchased at the low, low price of $250 per pack. Packs, by the way, contain a single ship — which only has around an 11 percent chance of looking like the Enterprise. You can (but absolutely should not) guarantee that you’ll get a cool ship by buying the “Admiral pack” instead of the “Captain pack,” but you can only get those if you’ve shelled out for a Recur pass — another NFT that costs at least $290. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0149UQ3iBok5TWXURo-vIFZsGQg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372180/pack_odds.png\">      <cite>Image: Paramount</cite>      <figcaption><em>Pictured: definitely not predatory gambling tactics.</em></figcaption>  </figure><p id=\"mh7VrY\">The ships are stored in what Paramount is calling “Star Trek Continuum,” which is what the company describes as “an experiential hub that will house this first and all future seasons of Star Trek NFTs.” Those “future seasons” will involve collecting crewmates and doing vague, unspecified missions according to Paramount’s roadmap.</p><aside id=\"OzWsVf\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"NFTs, explained\",\"url\":\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\"},{\"title\":\"What is the metaverse, and do I have to care?\",\"url\":\"https://www.theverge.com/22701104/metaverse-explained-fortnite-roblox-facebook-horizon\"}]}'></div></aside><p id=\"ul8MKM\">In terms of what that “metaverse” or those experiences will actually look like, Paramount’s press release has a lot of words that basically add up to a hand wave: “Recur and Paramount are building a roadmap of in-real-life utility over the course of this multi-year partnership and Continuum holders will get access to exclusive perks, events and content expanding on the utility of the NFTs digitally and in-real-life.”</p><p id=\"yAbPak\">This isn’t the first time we’ve seen Star Trek NFTs. The brand has been put on the blockchain in the form of <a href=\"https://www.theverge.com/2021/11/23/22798955/funko-digital-pop-star-trek-nfts-why\">digital Funko Pops</a> and in <a href=\"https://medium.com/veve-collectibles/star-trek-the-next-generation-series-1-d7ed1260fe65\">licensed offerings on other platforms</a>. And, as my colleagues, Chaim Gartenberg and Adi Robertson pointed out, each time it happens it feels like a bit of a slap in the face to everything that <em>Star Trek</em> is <em>actually</em> about. (I’m sure it’s just a coincidence that every video essayist describing post-scarcity “luxury automated space communism” uses <em>Star Trek</em> imagery to describe it.) </p><p id=\"UWT4VJ\">This time around, though, Paramount is going all in. It’s pitching Star Trek Continuum as just the beginning of Paramount.xyz, and threatens... er, promises that it’ll add franchises from Nickelodeon and Paramount Pictures next. Yes, that does mean that we could see SpongeBob NFTs next. And yes, I guess that does mean I’ve gotten to the point in adulthood where I get to see my childhood pillaged. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/y3KT-wmDV98TfF7Bjs53goCn3p8=/0x38:2632x1416/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23372105/Screen_Shot_2022_04_06_at_12.24.04.png",
  "description": "Warp me to a galaxy where this doesn’t exist.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}