{
  "title": "Paramount Plus is still figuring out Paramount Plus",
  "url": "https://www.theverge.com/2022/3/5/22962196/paramount-plus-first-year-yellowstone-star-trek-1883-spongebob",
  "date": "2022-03-05T14:00:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"West Hollywood Exteriors And Landmarks - 2021\" src=\"https://cdn.vox-cdn.com/thumbor/TLgWS4aLzP64m9k28sioJ-K5pnA=/0x99:4100x2832/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70582848/1231635819.0.jpg\" />        <figcaption>Photo by AaronP/Bauer-Griffin/GC Images</figcaption>    </figure>  <p id=\"t4gR25\">Paramount Plus celebrated its first birthday yesterday. During its first year, the service debuted a <em>SpongeBob </em>movie, added original shows like <em>1883</em>, and occasionally surprised us with exclusives like the second season of <em>Evil</em>, which was originally a CBS exclusive show. Plus, Paramount Plus managed to swipe the highly anticipated live-action <em>Halo</em> series — set to debut this month — from sister service Showtime.</p><p id=\"k3QvZs\">But a year after its launch, Paramount Plus is still suffering an identity crisis: the streaming service has yet to prove why we should care about Paramount Plus beyond its big <em>Star Trek</em> catalog and obsession with <em>Yellowstone</em>. So far, it’s seemed as though Paramount has struggled to find the sweet spot between propping up its existing business arms while also investing in its tentpole streaming service. </p><p id=\"IrWTe9\">“I think they’re afraid to make hard choices. That’s the thing that sticks with me,” Andrew A. Rosen, <a href=\"https://parqor.com/about/\">PARQOR founder</a> and a former Viacom digital media executive, tells <em>The Verge</em>. “There’s basic questions that are not unreasonable to ask that they don’t have answers for.”</p><p id=\"lRJ5zV\">Many of those questions pertain to Paramount Plus’ thus-far unusual content strategy — a kind of anti-Netflix approach. When the service rebranded from CBS All Access in March of 2021, it promised to serve up a “mountain of content” that brought all of <a href=\"https://www.theverge.com/2022/2/15/22936147/viacomcbs-rebrands-paramount-streaming-focus\">Paramount’s assets</a> under a single roof. Live sports, live news and entertainment, and a backlog of programming — from BET, CBS, Comedy Central, MTV, Nickelodeon, Paramount Pictures, and the Smithsonian Channel — promised to give ostensible “fans” of CBS All Access even more to watch while also appealing to a wider audience.</p><div class=\"c-float-right\"><aside id=\"vwlPh0\"><q>“The issue is they have no high-acquisition title. All their high-acquisition titles are elsewhere.”</q></aside></div><p id=\"gZFoCp\">The problem is that some of the content owned by Paramount (née ViacomCBS) that <em>should</em> have driven viewers to the service hasn’t been available to stream there. <em>South Park</em>, for example, currently lives on HBO Max after the streamer <a href=\"https://variety.com/2019/tv/news/south-park-stream-exclusively-hbo-max-1203387212/\">won a bidding war</a> for the series just over two years ago. Another popular Paramount title, <em>Yellowstone</em>, currently premieres new episodes on the Paramount Network cable channel and, confoundingly, Peacock. </p><p id=\"QY3ll6\">Tanya Giles, chief programming officer of streaming at Paramount, <a href=\"https://deadline.com/2022/02/yellowstone-streaming-paramount-chief-addresses-peacock-1234924290/\">recently explained</a> the <em>Yellowstone </em>issue at least. She told <em>Deadline</em> that then-ViacomCBS “had content licensing deals well before [Paramount Plus] was thought of and our solution to that, our great solution, was to create a broad universe of <em>Yellowstone</em> by bringing <em>1883</em>, its prequel, exclusively to [Paramount Plus].” Its licensing business no doubt generated short-term gains, but it doesn’t jibe well with a long-play streaming strategy. </p><p id=\"9wChnf\">That leaves Paramount Plus in a bind. It’s had a couple of grabby names to date, like <em>Star Trek</em> and <em>SpongeBob</em> spinoffs. But up against services like Disney Plus and Netflix that debut a ton of new originals regularly and are dumpling billions into content for their platforms, the question becomes: Where are Paramount Plus’s other flashy originals? Where is its <em>Strangers Things</em> or <em>WandaVision</em>?</p><p id=\"pK2Boy\">“Across the entire board, they have one of the best libraries,” says Julia Alexander, a senior strategy analyst at Parrot Analytics and former reporter at <em>The Verge</em>. “The issue is they have no high-acquisition title. All their high-acquisition titles are elsewhere.”</p><p id=\"OFZ0vB\">Paramount Plus has decades’ worth of crime procedurals, comedy, and kids’ programming — all of which is quite good — but Paramount Plus has yet to have its very own <em>Stranger Things</em> moment, which could help it position itself as a streaming competitor in earnest. Alexander adds that even with that great back catalog of franchise programming, in order to stay competitive, Paramount Plus needs to take the chance another of its shows can be the next <em>Yellowstone</em> and therefore must live on Paramount Plus to bring new subscribers in.</p><p id=\"uYKdbC\">To its credit, the company does seem to realize that the content and licensing strategies it had in place when ViacomCBS launched Paramount Plus a year ago are no longer going to work if it wants to operate a successful streaming business. The company underwent a <a href=\"https://www.theverge.com/2021/6/24/22549252/viacomcbs-leadership-restructure-paramount-plus-streaming-service\">major executive restructure</a> last summer, and Paramount boss Bob Bakish said during a <a href=\"https://ir.paramount.com/static-files/8e4932d4-89c0-4ad9-882b-529bc31a44a8\">recent earnings event</a> that the company plans to claw back some of its older titles, including <em>South Park</em>, in the coming years — signaling that Paramount does, at least immediately, plan to stay competitive in the streaming space.</p><div class=\"c-float-right\"><aside id=\"FcDXAW\"><q>“It’s too early to discount Paramount Plus in the way it’s too early to discount any of them”</q></aside></div><p id=\"DDYuMe\">At the same time, Paramount is starting to fix its flashy content problem. The service will debut a number of highly anticipated titles this month, including <em>Star Trek: Picard</em> and <em>Halo</em>; it also <a href=\"https://www.youtube.com/watch?v=qps9IS0msy8\">recently teased</a> upcoming projects from <em>Yellowstone</em> creator Taylor Sheridan. And the company last fall introduced a <a href=\"https://www.theverge.com/2021/9/21/22686594/paramount-plus-showtime-bundle\">bundle with Showtime</a>, which at $12 per month for essential and $15 per month for premium, is a hell of a steal for two premium services that usually cost between $5 and $11 per month, respectively.</p><p id=\"SnFoek\">Some of this will take time. <em>South Park</em> won’t be on the service until 2025, and satiating the appetite for even more <em>Yellowstone</em> projects will take a minute. Until then, the service will have to get by on the strength of its back catalog and the occasional big name.</p><p id=\"ykPy4L\">“They haven’t built a Netflix competitor, but they built something that’s useful to fans of different types of content of theirs worldwide — and they have real audiences worldwide,” Rosen says. “To claim that they’ve failed is a bit rough. But at the same time, to claim that they’ve got a competitor to Netflix is also a bit of an overstatement.”</p><p id=\"DSywme\">Paramount Plus is growing. The service reported 32.8 million subscribers on its most recent earnings call. (Disney Plus, which launched in 2019, had around 73 million paid subscribers in its first year.) Alexander also says it’s too early to write Paramount Plus off, adding that it could take anywhere from six to eight months to see the effects of Paramount’s evolving business strategy</p><p id=\"tNspq4\">“I think it’s too early to discount Paramount Plus in the way it’s too early to discount any of them,” Alexander says. “They’re all still trying to figure it out.”</p><p id=\"YXzmPh\">Even with a shoddy content strategy straight out of the gate, Paramount Plus has shown it <em>does</em> have value in the streaming space. It just has to prove to us that it’s worth sticking around for.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5K05ZeSpq5CxP86FdbgIC8gu_1Q=/0x392:4100x2539/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23289676/1231635819.jpg",
  "description": "It has so far taken the anti-Netflix approach to streaming.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}