{
  "title": "Paramount’s reportedly spinning up a Beyblade movie with Jerry Bruckheimer",
  "url": "https://www.theverge.com/2022/2/24/22949623/paramount-beyblade-movie-jerry-bruckheimer-producer",
  "date": "2022-02-24T23:33:05.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/91hhq0MecHKyZ9yfhc9XRImI7i4=/236x0:2645x1606/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70547014/Screen_Shot_2022_02_24_at_16.28.04.0.png\" />        <figcaption>Image: Hasbro</figcaption>    </figure>  <p id=\"YB3jqc\">Paramount is reportedly making a live-action movie based on Beyblade fighting tops, which <a href=\"https://deadline.com/2022/02/jerry-bruckheimer-beyblade-toys-movie-paramount-1234959192/\"><em>Deadline</em> says</a> will be produced by Jerry Bruckheimer (who’s had a hand in the <em>Pirates of the Caribbean</em> and <em>National Treasure</em> franchises, and has produced movies like <em>Bad Boys</em> and <em>Black Hawk Down</em>). For those unfamiliar, Beyblades are toys that you fling together into an arena using a specialized launcher, hoping to knock your opponent’s Beyblade out of the ring or stop it from spinning. They also feature in several manga series (the first came out around the same time as the toys in 1999), some of which have been turned into animated TV shows. </p><p id=\"nbSr6Z\"><em>Deadline</em> says the movie is still in “early production,” but the idea of a Beyblade movie has been floating around for awhile. In 2015, <a href=\"https://deadline.com/2015/05/beyblade-movie-paramount-hasbro-transformers-mary-parent-1201433742/\"><em>Deadline</em> reported</a> that Paramount had purchased the rights to make a live-action Beyblade movie produced by Mary Parent (who’s worked on projects like <em>Pacific Rim</em>, <em>Detective Pikachu</em>, and <em>Dune</em>). Now, <em>Deadline</em> reports that writers Neil Widener and Gavin James have been attached to the project, along with Bruckheimer.</p><p id=\"oYyYSs\">If you’re not familiar with Beyblade, here’s a trailer for one of the recent anime series:</p><div id=\"PIecJm\"><div ><iframe src=\"https://www.youtube.com/embed/uH5uQAcSSz8?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"Fsbzs4\">Adaptations based on children’s toys aren’t a new phenomenon; the <em>Transformers</em> movies <a href=\"https://en.wikipedia.org/wiki/Transformers_(film_series)#Box_office_performance\">brought in billions of dollars</a> for Paramount, and the <em>Lego</em> movies and <em>My Little Pony</em> shows are relatively well-known. And that’s not even mentioning media based on card games like <em>Pokémon</em> and <em>Yu-Gi-Oh! </em>Of course, basing something on a popular toy isn’t an instant recipe for success — the 2012 film <em>Battleship</em> was hardly a cultural touchstone, and when was the last time you saw a <em>Bionicle</em> movie? </p><p id=\"rLrBuN\">Given the lack of details on the Beyblade adaption, it’s hard to predict whether it’ll be worth a spin. Sure, it’s hard to imagine how you could make a movie about top fighting interesting, but the writers won’t be the first ones to try — let’s just hope it’s better than the <a href=\"https://www.youtube.com/watch?v=hDbeBqYZtUA\">one commercial with a Beyblade rap song</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rGXEHmh-4M90wsCtkSjKrGNVGkc=/0x49:2880x1557/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23269193/Screen_Shot_2022_02_24_at_16.28.04.png",
  "description": "The next Transformers, or the next Battleship?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}