{
  "title": "Parcast union contract with Spotify includes pay raises and diversity promises ",
  "url": "https://www.theverge.com/2022/4/18/23030244/parcast-union-contract-spotify-pay-raise-diversity",
  "date": "2022-04-18T16:00:23.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xTZ-58f0IQvx3buKbzkd6abmL8g=/0x0:600x400/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70762634/parcastunion.0.jpg\" />        <figcaption>Parcast Union</figcaption>    </figure>  <p id=\"caqJoE\">Unionized workers at Parcast, a podcast production company owned by Spotify, shared details of their new three-year employment contract today. The contract covers workplace issues like pay, diversity, healthcare, severance, and more. It’s rare for a tech company to have one union, let alone <a href=\"https://www.theverge.com/2020/9/2/21417146/parcast-spotify-union-writers-guild-america-east\">three</a>, as is the case with Spotify. The Parcast unionization follows successful drives at Gimlet Media and <em>The Ringer, </em>which <a href=\"https://www.theverge.com/2021/4/7/22327090/gimlet-media-union-spotify-contract-agreement\">ratified contracts</a> with Spotify last year.</p><p id=\"lj8x1R\">The Parcast union announced in early April that it had <a href=\"https://twitter.com/ParcastUnion/status/1511908472652140549\">reached a deal</a>. The union, like Gimlet and <em>The Ringer</em>, is represented by the Writers Guild of America, East. (Disclosure: WGAE represents Vox Media’s editorial staff, which includes <em>The Verge</em>.)</p><div class=\"c-float-right\"><aside id=\"uaXVxg\"><q>The lowest-paid employees will receive a raise between 10 percent and 25 percent</q></aside></div><p id=\"Ru7Gy7\">The deal was announced on April 6th, just days after Parcast employees threatened to <a href=\"https://www.bloomberg.com/news/articles/2022-04-04/spotify-podcast-union-is-ready-to-strike-over-contract-terms\">walk off the job</a> after 15 months of bargaining. At the time, 97 percent of the unit signed a strike pledge. </p><p id=\"umeqJt\">Some of the terms of the contract revealed today include demands that the union previously said were stumbling blocks. A proposal that would require half of all job candidates who progress past a phone interview be from an underrepresented group was previously rejected, the <a href=\"https://twitter.com/ParcastUnion/status/1499179691361456131/photo/1\">union said in March.</a> This agreement is included in the contract, with the metric to be reached by the end of the three-year term. The union also got a $100,000 annual diversity committee budget. </p><p id=\"30dIO9\">Workers at Parcast, which produces popular true crime and mystery podcasts, won raises for all employees, with the lowest-paid employees receiving a raise between 10 percent and 25 percent. The contract also includes a 2 percent guaranteed annual salary bump and overtime protections, minimum severance of 11 weeks, and a commitment to no changes or cost increases to health benefits.</p><p id=\"puVqpi\">“We’re very happy with the terms of our new Union contract, which we all fought together to achieve,” the Parcast bargaining committee says in the release. “Our unit demonstrated amazing solidarity, all the way to the point of signing a strike pledge, and we’re pleased to be able to move forward together into the next chapter of our effort.”</p><p id=\"XDxfrE\">One issue not addressed by the contract is intellectual property, which the <a href=\"https://twitter.com/ParcastUnion/status/1301173344088264707\">union named</a> as a key area of improvement it was fighting for. Contracts between Gimlet and <em>The Ringer </em>unions also came up short on the topic of IP, a sticking point for Spotify. </p><p id=\"hF0Ygg\">The ratified Parcast contract is part of a larger wave of unionization at tech companies from producers to warehouse workers. It comes just weeks after the historic Amazon warehouse vote earlier this month when workers in Staten Island voted to create the company’s <a href=\"https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win\">first-ever union</a> in the US.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qpzQvn6EqzI_pfDDfqlF5NUgAfY=/0x43:600x357/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21847477/parcastunion.jpg",
  "description": "Spotify’s third union details its ratified contract.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}