{
  "title": "Parisian car ban now planned for 2024  ",
  "url": "https://www.theverge.com/2022/2/18/22940512/paris-car-ban-2024-city-center-cycling-pollution",
  "date": "2022-02-18T10:21:06.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"FRANCE-TRANSPORT-BICYCLE\" src=\"https://cdn.vox-cdn.com/thumbor/LqVyyiTjTJjuiAXO_NefaZPxWHE=/1x0:5371x3580/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70524295/1227837311.0.jpg\" />        <figcaption><em>Paris added many new dedicated bicycles lanes in 2020.</em> | Photo by CHRISTOPHE ARCHAMBAULT/AFP via Getty Images</figcaption>    </figure>  <p id=\"UQ2Qvk\">Paris officials plan to ban private vehicles from the historic heart of the city by early 2024 in a move designed to decrease congestion and improve air quality in the French capital, the <a href=\"https://www.paris.fr/pages/paris-cree-une-zone-apaisee-dans-le-centre-de-la-capitale-20426\">city has announced</a>. Targeting 2024 represents a two year delay on the original 2022 timeline, which was <a href=\"https://www.bloomberg.com/news/articles/2021-05-13/new-paris-car-ban-will-target-through-traffic\">announced last May</a> by the city’s mayor, and French presidential hopeful, Anne Hidalgo. The ban is part of a wider push to improve conditions in the city ahead of it hosting the 2024 Olympic Games.</p><p id=\"pd8FRo\">The so-called “tranquil zone” will focus on the city’s first four arrondissements, <a href=\"https://www.thelocal.fr/20220217/paris-to-delay-city-centre-car-ban-by-two-years/\">according to <em>The Local</em></a>, and includes the city’s two islands on the Seine which host the Notre-Dame cathedral and Sainte-Chapelle. City authorities say that the current plan is to enforce the zone with random spot checks of vehicles exiting the area.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_FwRplupU7r8io9w65cy43TBTBM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23254662/Plan_Paris_Centre_Saint_Germain___web.jpg\">      <cite>Image: Paris.fr</cite>      <figcaption><em>A map of the proposed area.</em></figcaption>  </figure><p id=\"bgZ0LQ\">Rather than banning all private vehicles, it will target through-traffic that’s thought to make up around half of vehicles on the roads in the area. Delivery drivers will still have access, and people will still be able to drive into the area to visit friends, or access amenities like shops or the theater according to the city’s deputy mayor David Belliard. It’s estimated that the ban will take over 100,000 cars off the roads daily, <a href=\"https://www.bloomberg.com/news/articles/2021-05-13/new-paris-car-ban-will-target-through-traffic\">according to <em>Bloomberg</em></a>.</p><p id=\"4wo7MH\">The ban is part of a wider array of measures aimed at reducing the amount of cars, and the pollution they produce, in Paris. Mayor Anne Hidalgo has pushed for the city to become less car-centric and more cycle-friendly, creating over 100 miles of new bike paths in the city during coronavirus lockdowns in 2020, as well as banning cars from some highways along the Seine.</p><p id=\"ySiVUI\">But the city’s transformation into a Copenhagen-style cycling metropolis has faced growing pains, the <a href=\"https://www.nytimes.com/2021/10/02/world/europe/paris-bicyles-france.html\"><em>New York Times</em> reports</a>, with residents complaining that many cyclists are ignoring the rules of the road. And the new network of cycle lanes has also faced criticism for bad layouts that can penalize cyclists who obey the rules. Authorities have responded by adding more police to fine cyclists not obeying the rules, and better educating children about the rules of the road.</p><p id=\"PsBgT7\"><a href=\"https://twitter.com/David_Belliard/status/1494336284298412034\">In a tweet</a>, Paris’ deputy mayor Belliard said that of the 7243 respondents to the first consultation phase, 78 percent were in favor. The plan will now go through an impact study and public inquiry ahead of implementation.</p><aside id=\"mfItgz\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Cities are transforming as electric bike sales skyrocket\",\"url\":\"https://www.theverge.com/2020/5/14/21258412/city-bike-lanes-open-streets-ebike-sales-bicyclist-pedestrian\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/jikXF1GhtiEuaF6_eNI_6y4f1rw=/0x768:5371x3580/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23254667/1227837311.jpg",
  "description": "To reduce congestion and improve air quality.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}