{
  "title": "Patreon suspends NGO account collecting money for Ukrainian military",
  "url": "https://www.theverge.com/2022/2/25/22950408/patreon-ukraine-russia-come-back-alive-military-assistance",
  "date": "2022-02-25T10:14:27.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DwQ5dGELwdlBSoVPlTMIEhZz2JI=/361x0:2152x1194/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70548425/FMX7cGtXwAUqODW.0.jpg\" />        <figcaption><em>Save a Life’s Patreon tiers were named after military equipment.</em> | Screenshot: Patreon</figcaption>    </figure>  <p id=\"z3OXna\">Patreon says <a href=\"https://www.patreon.com/policy/guidelines\">it’s suspended the crowdfunding page for “Come Back Alive,”</a> a Ukrainian NGO that was collecting money to support the the country’s military in response to Russian aggression. In a statement <a href=\"https://www.cnbc.com/2022/02/24/patreon-suspends-come-back-alive-page-for-ukrainian-army-donations.html\">given to <em>CNBC</em></a>, the platform said it “does not allow any campaigns involved in violence or purchasing of military equipment, regardless of their cause.” Come Back Alive’s page said that funds would be used to train soldiers, as well as provide technical equipment, according to Patreon’s blog post.</p><p id=\"ioTeiH\">Come Back Alive’s Patreon page dates back to at least May 2020, according to <a href=\"https://www.dailydot.com/debug/patreon-missiles-ukraine/\">the <em>Daily Dot</em></a>, but as of January 26th this year it had a modest 936 patrons bringing in around $19,000 a month. That all changed this week after Russia invaded Ukraine, when its crowdfunding drew widespread attention, and its membership list ballooned to over 14,000 patrons, contributing a total of $436,966 a month. </p><div id=\"uSjQ0t\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our statement on the suspension of Come Back Alive, and the situation in Ukraine <a href=\"https://t.co/LxYpI1PTC7\">https://t.co/LxYpI1PTC7</a></p>— Patreon (@Patreon) <a href=\"https://twitter.com/Patreon/status/1497068371120390144?ref_src=twsrc%5Etfw\">February 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"g4kGYF\">According to <a href=\"https://savelife-in-ua.translate.goog/en/?_x_tr_sl=uk&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=wapp\">Come Back Alive’s website</a>, the Kyiv-headquartered NGO aims to provide technical assistance to the Ukrainian military, such as providing night vision equipment, as well as rehabilitating veterans. <em>CNBC</em> reports that the organization also provided body armor, medical kits, and helmets to Ukrainian soldiers. But the branding of the NGO’s Patreon tiers — including “Bullet,” “Projectile,” and “Bomb” — led to confusion that funds were literally buying ammunition for the Ukranian military. </p><p id=\"veq7Uo\">The Ukrainian government itself is also soliciting donations directly to help with its war effort. A <a href=\"https://ukraine.ua/news/support-the-armed-forces-of-ukraine/\">page on the country’s government website</a> lists account details where funds can be sent to to help “the logistics and medical support of the Armed Forces of Ukraine.” Asking the public for money to help with war efforts is not an entirely new phenomenon, with countries like the United Kingdom and Germany selling <a href=\"https://en.wikipedia.org/wiki/War_bond\">war bonds</a> during World War 1 to finance their military operations, for example. (Those bonds, though, were a form of debt that would be repaid in time, rather than direct donations.) </p><p id=\"1HksVM\">It’s not clear what’s happened to the funds raised by Come Back Alive. The organization’s director, Taras Chmut, told <em>CNBC</em> that he sees a “This page has been removed” notice when he tries to access the account and withdraw money. But Patreon tells <em>CNBC </em>its policy is to “send the creator the remaining funds or refund all pledges” if a page is removed from its service.</p><p id=\"CAsUnV\">“We are shocked and heartbroken at the invasion of Ukraine,” Patreon’s blog post reads. “Like so many around the world, we are watching this tragedy closely and wishing for the safety of the Ukrainian people in harm’s way.” The company lists the <a href=\"https://blogs.icrc.org/ua/\">Ukrainian Red Cross Society</a>, <a href=\"https://voices.org.ua/en/\">Voices of Children</a>, and <a href=\"https://www.rsukraine.org/\">Revived Soldiers Ukraine</a> as other charities and platforms that would benefit from donations.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/30TlJSUlayBKoh38zL824ZnFQwk=/39x0:2320x1194/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270437/FMX7cGtXwAUqODW.jpg",
  "description": "Came Back Alive is a Kyiv-based NGO.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}