{
  "title": "PayPal is making more features freely available to Ukrainians",
  "url": "https://www.theverge.com/2022/3/18/22984917/paypal-ukraine-transfers-fees-reduced-russia-digital-ministry",
  "date": "2022-03-18T17:48:41.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4QRXAH-E1TTyvFnRlzYoMrxRlmI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70642239/acastro_180410_1777_payapl_0002.0.jpg\" />        <figcaption><em>Another win for Ukraine’s Minister of Digital Transformation.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"HkNSKF\">PayPal is expanding the services available to its Ukrainian users and waiving fees to help with humanitarian efforts in the country <a href=\"https://www.theverge.com/2022/2/28/22954857/russia-invades-ukraine-news-updates\">during Russia’s ongoing invasion</a>. According to a <a href=\"https://newsroom.paypal-corp.com/2022-03-Expanding-PayPals-Money-Services-To-Help-Ukraine-Humanitarian-Efforts\">news release</a>, Ukrainians will be able to send and receive peer-to-peer PayPal or Xoom payments, and the company won’t apply its normal fees to either side of the transaction (h/t <a href=\"https://www.cnn.com/2022/03/18/tech/paypal-ukraine/index.html\"><em>CNN Business</em></a>). </p><p id=\"gF2OUl\">PayPal also says that it’s giving Ukrainians the ability to transfer money out of their accounts onto Mastercard and Visa cards. Citizens who have fled the country will also be able to access these features if they set up a Ukrainian PayPal account. The company says Ukrainians will be able to send and receive funds in US and Canadian dollars, as well as British pounds and Euros. (Ukraine’s official currency is the hryvnia.)</p><div class=\"c-float-right\"><aside id=\"ArDkB3\"><q>This change gives Ukrainian customers more options</q></aside></div><p id=\"jKjqU9\">PayPal confirmed to <em>The Verge</em> that before the change went into effect Thursday, Ukrainian customers were only able to send cross-border transfers, not receive them. PayPal didn’t directly answer why they couldn’t receive money before — the company’s spokesperson Tom Hunter only said that “functionality varies by market” based on “a number of factors.” Ukrainian customers were able to receive funds from friends and family in the US, Canada, UK, and other parts of Europe via PayPal’s cash pickup and prepaid mobile phone refill, according to <a href=\"https://newsroom.paypal-corp.com/2022-03-14-supporting-ukraine-relief-efforts\">a post from the company</a> about its efforts in Ukraine.</p><p id=\"6eR50q\">PayPal notes that the changes, including the removal of fees, are for a limited time — they’re currently slated to be in effect only until June 30th, 2022. But since the situation is “developing,” PayPal says it is reserving the right to make any changes but will post notices to its site if or when it does.</p><p id=\"EJv0ir\">Ukrainian Vice Prime Minister and Minister of Digital Transformation Mykhailo Fedorov has been actively reaching out to many tech companies, asking them to help Ukraine and <a href=\"https://www.theverge.com/2022/2/25/22951413/ukraine-russia-apple-app-store-block-fedorov\">cut off services to Russia</a>. According to <a href=\"https://twitter.com/FedorovMykhailo/status/1504540605703241736\">a letter he posted to Twitter</a>, he had reached out to PayPal asking them to expand services in the country before the company made the change. </p><div id=\"bNMkoQ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Welcome to Ukraine!  <a href=\"https://twitter.com/PayPal?ref_src=twsrc%5Etfw\">@PayPal</a>, <a href=\"https://twitter.com/Dan_Schulman?ref_src=twsrc%5Etfw\">@Dan_Schulman</a>, thank you for supporting Ukraine and peace! <a href=\"https://t.co/RS632fessN\">pic.twitter.com/RS632fessN</a></p>— Mykhailo Fedorov (@FedorovMykhailo) <a href=\"https://twitter.com/FedorovMykhailo/status/1504540605703241736?ref_src=twsrc%5Etfw\">March 17, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"yKqeRN\">Fedorov has also successfully <a href=\"https://www.theverge.com/2022/2/28/22955339/elon-musk-spacex-starlink-ukraine-user-terminals-russia-invasion\">asked for help from companies like SpaceX</a> — he tweeted at Elon Musk asking him to supply Ukraine with Starlink satellite internet dishes and, a few days later, posted a picture of a truck full of the devices.</p><p id=\"HBa9ho\">Earlier this month, PayPal <a href=\"https://www.theverge.com/2022/3/5/22962848/paypal-pauses-service-russia-ukraine-invasion\">paused most of its services in Russia</a> shortly after it stopped accepting new users from the country. (The company said at the time it would “continue work to process customer withdraws for a period of time.”) International sanctions have restricted Russian citizens’ access to other financial services, like <a href=\"https://www.theverge.com/2022/2/26/22952191/russian-bank-customers-apple-pay-google-pay-financial-sanctions-ukraine\">Apple and Google Pay</a>, as well as <a href=\"https://www.theverge.com/2022/2/26/22949156/russia-expelled-swift-ukraine-sanctions\">the system that helps carry out</a> many international money transfers.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ELmmoos_KkeGqU3t3hRJnq5hzsQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10646751/acastro_180410_1777_payapl_0002.jpg",
  "description": "It won’t apply its fees to peer-to-peer transfers to Ukraine.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}