{
  "title": "PC market on the decline as Chromebook sales slide from their pandemic peak",
  "url": "https://www.theverge.com/2022/4/11/23021029/pc-market-decline-chromebooks-post-pandemic-hit-idc-gartner",
  "date": "2022-04-11T23:02:12.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Best Chromebook 2022: Acer Chromebook Spin 713\" src=\"https://cdn.vox-cdn.com/thumbor/tr6GvxJd2M5tthda9gqUEMdjZHQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70738009/mchin_181029_4126_0006.0.0.jpg\" />        <figcaption>Photo by Monica Chin / The Verge</figcaption>    </figure>  <p id=\"4LyWLV\">Global shipments of PCs declined in the first quarter of 2022 as pandemic-related purchases begin to taper off, according to reports from research firms <a href=\"https://www.gartner.com/en/newsroom/press-releases/2022-04-11-gartner-says-worldwide-pc-shipments-declined-7-percent-in-first-quarter-of-2022\">Gartner</a> and <a href=\"https://www.idc.com/getdoc.jsp?containerId=prAP49019122\">International Data Corporation</a> (IDC). While IDC reports a total of 80.5 million PC shipments last quarter, Gartner cites a lower 77.5 million figure, a 7.7 percent drop when compared to the first quarter of 2021.</p><p id=\"ivF7VR\">Gartner says a decline in Chromebook shipments weighed heavily on the market — not counting Chromebooks, the PC market would’ve risen by 3.3 percent year over year. IDC didn’t include any information about Chromebooks but notes a slowdown in purchases from educational institutions, a market that utilizes <a href=\"https://www.blog.google/outreach-initiatives/education/2020-chromebooks/\">over 40 million Chromebooks</a> for teachers and students. Lenovo was still the top-selling PC brand, followed by HP, Dell, and Apple. </p><p id=\"1hsPFu\">However, Dell, Apple, and ASUS were the only brands that saw year-over-year growth. Apple should’ve seen a bump after releasing new <a href=\"https://www.theverge.com/22751921/apple-macbook-pro-14-16-inch-2021-m1-pro-max-review\">14- and 16-inch MacBook Pros</a> last October, which come with the company’s in-house M1 Pro and M1 Max chips. Its new <a href=\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\">Mac Studio desktop system</a> came to market in March, bolstering Apple’s desktop lineup at the end of last quarter and beyond.</p><div class=\"c-float-right\"><aside id=\"f1uh8p\"><q>“The focus shouldn’t be on the year-over-year decline in PC volumes”</q></aside></div><p id=\"zLt4cm\">Demand for Chromebooks was especially high in the midst of the pandemic in 2020 and 2021, as schools bought up Chromebooks to aid in the transition to remote learning. The PC market, in general, <a href=\"https://www.theverge.com/2021/1/11/22225356/pc-sales-shipments-2020-growth-idc-canalys-remote-work\">was up 11 percent in 2020</a>, and <a href=\"https://www.theverge.com/2021/1/30/22256873/chromebook-best-year-ever-double-yearly-sales\">over 30 million Chromebooks</a> were sold at the time. A <a href=\"https://www.theverge.com/2021/10/12/22722151/us-pc-market-decline-supply-issues-windows-11-launch\">supply chain shortage caused sales to dip</a> in quarter three of 2021 but <a href=\"https://www.theverge.com/2022/1/13/22881569/pc-sales-shipments-2021-growth-idc-gartner-pandemic-demand\">managed to recover</a> in the final quarter.</p><p id=\"9ESn3w\">Both firms agree that the market for PCs is beginning to level off after two years of a surge in shipments. Gartner cites the war in Ukraine as a factor contributing to the last quarter’s lack of growth as well, given that many companies stopped shipping their hardware to the country due to economic sanctions.</p><p id=\"4kY9X3\">“The focus shouldn’t be on the year-over-year decline in PC volumes because that was to be expected,” Ryan Reith, the group vice president at IDC, said in a statement. “The focus should be on the PC industry managing to ship more than 80 million PCs at a time when logistics and supply chain are still a mess, accompanied by numerous geopolitical and pandemic-related challenges.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bQrPKIJubA7zXx6AffKw3IQgozM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21698824/mchin_181029_4126_0006.0.jpg",
  "description": "PC sales dipped 7.7 percent year over year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}