{
  "title": "Peacock’s Queer as Folk looks ripped from the headlines in first trailer",
  "url": "https://www.theverge.com/2022/5/18/23124461/peacock-queer-as-folk-trailer",
  "date": "2022-05-18T17:41:26.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xElHaQ588Fm8t7dxLtYn9tLiMyc=/0x39:5127x3457/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883840/NUP_196327_00202R.0.jpeg\" />        <figcaption>Armand Fields as Bussey | Alyssa Moran/Peacock</figcaption>    </figure>  <p id=\"nWLxSP\">Both the original British and American <em>Queer as Folk</em> series were celebrations of queer culture that also took the time to tell stories about the violence and hatred queer people face simply for existing. In its first trailer, <a href=\"https://www.theverge.com/2022/4/13/23023548/peacock-queer-as-folk-teaser\">Peacock’s upcoming <em>Queer as Folk </em>reboot</a> from Stephen Dunn appears to be following in its predecessors’ footsteps as it pulls its cast of clubgoers together for a night of drag and debauchery at Babylon, a club in New Orleans, Louisiana.</p><p id=\"CipLog\">The new <em>Queer as Folk </em>follows recent med school dropout Brodie (Devin Way) as he journeys from Baltimore to Louisiana in search of anything but a committed relationship. Though Brodie’s glad to be reunited with old friends like debutant Brenda (Kim Cattrall) and pop culture nerd Julian (Ryan O’Connell), it isn’t until he crosses paths with newcomer-to-drag Mingus (Fin Argus) that he feels as if his life’s about to change. While Brodie and Mingus’ burgeoning romance will play a key role in <em>Queer as Folk</em>’s plot, the trailer establishes that what truly kicks the series’ story into gear is a <a href=\"https://www.vox.com/2016/6/12/11911962/pulse-gay-nightclub-shooting-orlando-updates-news\">Pulse-like shooting</a> in Babylon that leaves the local community shaken. Though tragedy may be what brings Brodie and Mingus together, it also seems to be what inspires <em>Queer as Folk</em>’s larger cast to band together and reinforce the connections that sustain their communities.</p><p id=\"GsVnqj\"><em>Queer As Folk </em>also stars Jesse James Keitel, CG, Johnny Sibilly, Ryan O’Connell, and Juliette Lewis. The show hits Peacock on June 9th, 2022.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eyUXqb4JbiesqbRZPoNWP9valEE=/0x406:5127x3090/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23540530/NUP_196327_00202R.jpeg",
  "description": "Queer as Folk’s first trailer is about Babylon pulling together.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}