{
  "title": "Peacock’s new Queer as Folk reboot debuts this June",
  "url": "https://www.theverge.com/2022/4/13/23023548/peacock-queer-as-folk-teaser",
  "date": "2022-04-13T15:42:15.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"A man in a chainmail tank top dancing in a dimly-lit club alongside other partygoers.\" src=\"https://cdn.vox-cdn.com/thumbor/PbKkSLRn8bo1aBHk_5TIUUo9fO8=/0x17:5622x3765/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70744693/NUP_196327_00896R.0.jpeg\" />        <figcaption>Devin was as Brodie in Peacock’s Queer as Folk. | Peacock</figcaption>    </figure>  <p id=\"Mkq6Mu\">When Russell T. Davies’ original <em>Queer as Folk </em>first premiered on <a href=\"https://www.theguardian.com/news/audio/2022/apr/12/who-gets-to-decide-the-future-of-channel-4\">Channel 4</a> back in 1999, it made a name for itself with its frank and often joyful depictions of queer lives with a particular focus on sex. Showtime’s 2000 adaptation led with a similar focus that established its <a href=\"https://www.vox.com/identities/2016/12/5/13834432/lgbtq-representation-media-supergirl\">spin on <em>Queer as Folk</em></a><em> </em>as a cultural phenomenon and changed the landscape of American TV. Now, Peacock’s banking that the <em>Queer as Folk </em>brand still has enough of that old magic to make its upcoming reboot stand out in an era when networks and streaming services have long since come around to the idea of telling sexy stories about queer club goers.</p><p id=\"NNRdom\">Today, Peacock released a new teaser along with details and a series of images from Stephen Dunn’s <em>Queer as Folk</em>, a reimagining of both its predecessors. Though the teaser doesn’t actually feature any footage from the show, it establishes that the new <em>Queer as Folk </em>will once again revolve around a club called Babylon, where a number of its characters’ lives intersect.</p><div id=\"J0eaQF\"><div data-anthem-component=\"gallery:11142186\"></div></div><p id=\"GWncnq\">In a press release about the series, Dunn recalled how he, like many ’90s queer kids, grew up watching <em>Queer as Folk </em>and immediately being struck simply being seeing a television show that gave queer characters the space and freedom to be fully formed people. Though the new show is definitely taking cues from its predominantly white predecessors, Dunn noted that this <em>Queer as Folk</em>’s creative team took care to build its story with the queer community’s actual diversity in mind.</p><p id=\"kaTjRF\">“I wanted to create a new groundbreaking version of this show for this moment,” Dunn said. “Our new <em>Queer as Folk</em> is set in New Orleans — one of the most unique queer communities in North America — and I am immensely proud that the new series is comprised of an electric ensemble of fresh characters that mirror the modern global audience.”</p><p id=\"jpfm1n\"><em>Queer as Folk </em>stars Devin Way, Fin Argus, Jesse James Keitel, Candace Grace, Johnny Sibilly, and Ryan O’Connell. The series hits Peacock on June 9th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sjPSivGNyVVeT1CA7Bs7K-VteJ0=/0x420:5622x3363/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23386857/NUP_196327_00896R.jpeg",
  "description": "Peacock’s reimagining Queer as Folk for a new generation.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}