{
  "title": "Peacock is swiping back some of Hulu’s most popular streaming shows",
  "url": "https://www.theverge.com/2022/3/4/22929440/peacock-hulu-snl-streaming-disney-comcast",
  "date": "2022-03-04T20:38:44.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ux5tS1SkL3F-njs1vKkD0XG-0ks=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70580695/acastro_200714_1777_peacock_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"3QVuCP\">Some of the most popular programming on Hulu will now head to Peacock. A contract between the streaming services’ parent companies Disney and Comcast to stream NBCUniversal shows to Hulu has been terminated.</p><p id=\"TJxvpM\">“The Hulu agreement was terminated,” NBCUniversal spokesperson Lisa Scalzo confirmed to <em>The Verge</em>.</p><p id=\"DKJWWI\">The partnership will see episodes of NBCUniversal-owned shows like <em>Saturday Night Live</em> and <em>The Voice</em> debut on Peacock, rather than Hulu, after airing on pay-TV. Because Hulu will no longer be paying for some of NBC’s biggest titles, the deal could give Hulu the financial freedom to pursue more originals.</p><p id=\"ABVuh8\">The change will likely go into effect next broadcast season, possibly around September and October. The termination will not wipe all NBCUniversal programming from Hulu, as the companies have deals in place that will keep shows like <em>Law &amp; Order SVU</em> and <em>This Is Us</em> on Hulu for several more years, <a href=\"https://variety.com/2022/digital/news/nbcu-terminates-hulu-tv-disney-peacock-1235196550/\"><em>Variety</em> reported</a>.</p><p id=\"fYXyCt\"><em>The Wall Street Journal</em> <a href=\"https://www.wsj.com/articles/comcasts-nbcuniversal-near-deal-to-alter-content-sharing-partnership-with-hulu-11644536221\">earlier reported</a> that the shift in programming from Hulu to Peacock was imminent. </p><p id=\"5th8Kx\">The deal is a massive win for NBCUniversal’s fledgling Peacock, which has leaned heavily on its rights to major sports events like the <a href=\"https://www.theverge.com/2021/7/29/22589928/peacock-2020-olympics-streaming\">Olympic Games</a> and <a href=\"https://www.theverge.com/22910839/super-bowl-streaming-issues-sports-broken-lvi\">Super Bowl LVI</a> to reel in subscribers. But Peacock has struggled to make as much of a splash with its original programming (short of, perhaps, <em>Yellowstone</em>). </p><p id=\"BojAlt\">In a highly competitive streaming space, the addition of wildly popular shows to Peacock’s programming roster could help it retain and even attract subscribers who might’ve otherwise taken their wallets elsewhere.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/a0Gr8V-qCceyF-Cb6SW-TDcGpwU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20083298/acastro_200714_1777_peacock_0001.jpg",
  "description": "Some NBC shows will stream on Peacock instead of Hulu.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}