{
  "title": "Pebble’s reign as Kickstarter king comes to an end",
  "url": "https://www.theverge.com/2022/3/4/22960365/brandon-sanderson-fantasy-novels-kickstarter-cosmere",
  "date": "2022-03-04T09:26:57.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/I_w46Qcdevo4I7A--usTmsy_Wa4=/53x0:628x383/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70577715/a3e890c642960d634867aa7c88b10ddf_original.0.jpeg\" />    </figure>  <p id=\"bU8J7o\">Prolific fantasy author Brandon Sanderson <a href=\"https://www.kickstarter.com/projects/dragonsteel/surprise-four-secret-novels-by-brandon-sanderson/description\">has just broken the Kickstarter record</a> for the most successful crowdfunded project of all time, cracking the $20,338,986 milestone set by the Pebble Time <a href=\"https://www.theverge.com/2015/3/3/8103029/pebble-time-most-successful-kickstarter-ever\">all the way back in 2015</a>. </p><p id=\"61wxa6\">Sanderson’s achievement isn’t just notable for the sheer amount of money raised but for the speed. The project — for four new novels that the author wrote in secret over the course of the pandemic — was announced on Tuesday, March 1st and broke the record by early Friday morning, March 4th. </p><p id=\"cBhDeT\">The project’s original goal was to raise $1,000,000 in 30 days; Sanderson hit that number in around 35 minutes, <a href=\"https://www.nytimes.com/2022/03/03/books/brandon-sanderson-kickstarter.html\">according to <em>The New York Times</em></a>. The campaign currently exceeds 82,000 backers and still has 27 days to raise additional contributions. The Pebble Time ended its record-setting campaign with contributions from 78,471 backers.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Du7G0HoaT1KMlTEVQP9PZo7Tj6c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23287651/3XdoX2g.png\">      <cite>Image: Kickstarter</cite>      <figcaption><em>The top three most funded kickstarters in history from left to right.  </em></figcaption>  </figure><p id=\"szzCTS\">There are actually two halves to the Kickstarter project: the aforementioned four novels, which Sanderson will be releasing directly to fans on a quarterly basis throughout 2023 in ebook, print, or audiobook formats; and a larger “Year of Sanderson” subscription box that pairs the four book drops with an additional eight boxes of swag themed across different Sanderson series and novels. </p><div class=\"c-float-right\"><aside id=\"XLI1qa\"><q>The new Kickstarter king</q></aside></div><p id=\"MCk5YI\">Pledges start at $40 for just the four ebooks, $160 for hardcovers, $360 for ebooks and the rest of the swag, and a full $500 for the four books in all three formats and the eight swag boxes. </p><p id=\"MlAujA\">Sanderson is one of the science-fiction and fantasy genre’s most prolific modern writers, famous for the sheer speed at which he churns out new books across his various series (often in comparison to the glacial pace of other popular writers like George R.R. Martin or Patrick Rothfuss), as well as the varied and intricate magic systems across his books. He also rose to prominence for his work in finishing the final three books of the <em>Wheel of Time</em> series following the death of original author Robert Jordan. </p><div id=\"iUeQcG\"><div ><iframe src=\"https://www.youtube.com/embed/6a-k6eaT-jQ?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"PpY098\">Sanderson is best known, however, for the Cosmere — a massive, interconnected super-series of different fantasy series, including <a href=\"https://www.theverge.com/2018/3/2/17071468/brandon-sanderson-stormlight-archive-vr-experience-way-of-kings-escape-the-shattered-plains-htc-vive\"><em>The Stormlight Archive</em></a>, the <em>Mistborn</em> novels, <em>Elantris</em>, <em>Warbreaker</em>, and other books and novellas. While each series or novel is intended to stand up as a standalone work, similar to projects like the Marvel Cinematic Universe, the ultimate goal is a much wider story, with characters (and their different powers and abilities) crossing over and facing off against each other as the stories progress in each series. </p><p id=\"2TkCKM\">Three of the four novels in the Year of Sanderson package are new Cosmere stories, which may help explain some of the popularity — much like a new Marvel series, fans of Sanderson’s work tend to enthusiastically follow each new release to better follow the overarching story of the Cosmere. </p><p id=\"piMMFB\">As with any Kickstarter — and especially high-profile projects with huge numbers of backers and scale — there’s always a risk that the products won’t materialize or that the company won’t follow through (<a href=\"https://www.theverge.com/2019/12/9/21003445/coolest-cooler-update-business-tariffs-kickstarter\">like infamous crowdfunding disaster The Coolest Cooler</a>, now the third most funded Kickstarter campaign). That said, Sanderson’s project feels a little less risky than most, given that the author has already written all four of the novels, in addition to the fact that books are a relatively solved problem in terms of mass production. </p><p id=\"lgVRK5\">Sanderson’s company, Dragonsteel Entertainment, has successfully run a Kickstarter before — <a href=\"https://www.kickstarter.com/projects/dragonsteel/the-way-of-kings-10th-anniversary-leatherbound-edition\">a $6.7 million project for leatherbound editions of <em>The Way of Kings</em></a><em> </em>that ended with almost 30,000 backers, so the company does have some experience handling fulfillment for large projects like this. </p><p id=\"cJhdSs\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WqqT9jQlCCwMDqM04KGBrUqua0I=/0x14:680x370/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23286229/a3e890c642960d634867aa7c88b10ddf_original.jpeg",
  "description": "The previous record holder was the Pebble Time.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}