{
  "title": "Peloton’s latest gadget is a $90 heart rate monitor for your arm",
  "url": "https://www.theverge.com/2022/1/31/22906352/peloton-heart-rate-band-fitness-tracking",
  "date": "2022-01-31T14:30:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/tOfNqASBAfKld5LaD6hunc_bKwE=/0x2:8011x5343/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70452930/Peloton_Heart_Rate_Band_embargo_1.31_930amET.0.jpg\" />        <figcaption>Image: Peloton</figcaption>    </figure>  <p id=\"b6bHoL\">It’s <a href=\"https://www.theverge.com/2021/8/20/22634770/peloton-rower-rumors-android-app-mazu-app-analysis\">not a rower</a> or the forthcoming <a href=\"https://www.theverge.com/2021/11/9/22771827/peloton-guide-camera-movement-tracking-price-release-date\">Peloton Guide</a>, but Peloton announced today that it’s releasing a new Bluetooth heart rate monitor. Unlike its existing chest strap, the Peloton Heart Rate Band is meant to be worn on a user’s forearm and features optical heart rate sensors. </p><p id=\"ARPakO\">The Heart Rate Band will be available in small and large sizes and will cost $90. That’s a little less than double the price of its existing chest strap, which retails for $49 on <a href=\"https://www.onepeloton.com/shop/accessories/pl-hr-c-01\">Peloton’s website</a>. It’ll also sport five LED lights that indicate which heart rate zone you’re currently training in, battery level, and Bluetooth connectivity status. It also has a rechargeable battery that gets an estimated 10 hours on a single charge. </p><p id=\"bGekKp\">The device is meant to be an accessory that slots into the rest of the Peloton ecosystem: the Bike, Bike Plus, Tread, the forthcoming Guide, and the Peloton app. The more expensive Tread Plus was not listed in Peloton’s press release as a compatible device. However, Peloton says this is because it is not currently available and that existing Tread Plus owners should also be able to use the device. The Heart Rate Band will also work with any third-party applications that support standard Bluetooth heart rate monitor profiles. </p><p id=\"B0gLFV\">The Heart Rate Band will support Peloton’s <a href=\"https://blog.onepeloton.com/strive-score/\">Strive Score metric</a>, too. The Strive Score measures how long you’ve spent in a specific heart rate zone to determine workout intensity and progress. Generally, you’d be able to gauge that via power output on a treadmill or bike. However, it’s much harder for non-equipment-based classes like HIIT and strength training. The same holds true for Peloton’s bootcamp classes, which intersperse floor exercises with cycling / running. </p><p id=\"1FrU6S\">The armband has been rumored for some time now. <em>Bloomberg</em> first reported that Peloton was <a href=\"https://www.bloomberg.com/news/articles/2021-06-22/peloton-plans-armband-heart-rate-monitor-in-push-into-wearables?sref=P6Q0mxvj\">working on the device</a> back in June 2021 as part of a wearables push. There are multiple reasons why a company like Peloton might want to expand beyond its existing chest strap. For starters, chest straps typically rely on an electrical current to measure heart rate. While this usually results in better accuracy, chest straps can also be cumbersome to use. For example, while you can simply slip on an optical sensor heart rate monitor, a chest strap requires that you moisten the contact point and position it correctly before starting an activity. This can be difficult for those with mobility issues or limb differences, and wearing a chest-based device may not be comfortable for some individuals. </p><p id=\"ps52sd\">One caveat is that, without testing, it’s hard to say how accurate the Heart Rate Band will be compared to other monitors. Optical sensors require good skin contact for accurate readings and location matters. Each area of the body has its pros and cons. Valencell, a wearable biometric sensor maker, for example, notes that while the wrist is a popular area for optical heart rate sensors, it’s one of <a href=\"https://valencell.com/blog/heart-rate-monitor-location-matters/\">the more difficult places</a> to get an accurate reading. A recent study also found that optical sensors are less accurate for people <a href=\"https://www.theverge.com/2022/1/21/22893133/apple-fitbit-heart-rate-sensor-skin-tone-obesity\">with darker skin tones or obesity</a>.</p><p id=\"yaWzlE\">Peloton is not the only connected fitness company that’s exploring areas for heart rate monitoring outside of the wrist and chest. Polar has the Verity Sense, which is also an arm-based optical heart rate sensor. Meanwhile, Whoop has long sold armbands accessories for its tracker and recently released an <a href=\"https://gizmodo.com/whoops-weird-recovery-tracker-is-getting-smarter-and-mo-1847631004\">apparel line</a> that lets you wear its tracker on various parts of the body. </p><p id=\"7xa15o\">Peloton’s Heart Rate Band is available today in the US, Canada, UK, Germany, and Australia.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zORhPc4zBzfICMbqLF1cYA_jtYY=/0x612:8011x4806/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23202007/Peloton_Heart_Rate_Band_embargo_1.31_930amET.jpg",
  "description": "The band uses optical sensors and works with all Peloton devices.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}