{
  "title": "Peloton’s Lanebreak video game is finally here",
  "url": "https://www.theverge.com/2022/2/17/22939177/peloton-lanebreak-video-game-fitness-bikes",
  "date": "2022-02-17T19:04:09.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PvxuQm99leABgYY257gLOJJ5FfY=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70521738/In_Game___Breakers___EN.0.jpg\" />        <figcaption><em>A screencap of the “Breakers” mechanic in Peloton’s Lanebreak game.</em> | Image: Peloton</figcaption>    </figure>  <p id=\"hMf0Km\">Finally, some <a href=\"https://www.theverge.com/2022/2/8/22923229/peloton-layoff-new-ceo-mccarthy\">less</a> <a href=\"https://www.theverge.com/2022/2/8/22923434/peloton-foley-ceo-layoffs-earnings-connected-fitness\">dramatic</a> <a href=\"https://www.theverge.com/2022/2/8/22923480/peloton-severance-package-membership-layoffs\">news</a> from Peloton: its Lanebreak in-app video game <a href=\"https://blog.onepeloton.com/lanebreak/\">is finally here</a> for Peloton Bike and Bike Plus owners.</p><p id=\"MhIvKm\">You can find Lanebreak in the “More Rides” menu at the bottom right of a Peloton bike’s tablet. The game itself sort of looks a lot like riding a light cycle in <em>Tron</em>, but it takes elements from rhythm games. Essentially, you can switch between six virtual “lanes” by turning the bike’s resistance knob. The farther right you go, the higher the resistance. There are also game mechanics — dubbed by Peloton as “Moments” — that relate to your resistance and how fast you’re pedaling. For instance, “Beats” are blue bars that give you points for being in a certain lane. “Breakers” are orange sections where you’re supposed to pedal faster, while “Streams” are green sections where you stay within a specific cadence range.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hMT1oYoWsOYv9qZYEte2QA_A0LU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23252536/Peloton_Lanebreak_POP_Playlist.jpg\">      <cite>Image: Peloton</cite>      <figcaption><em>Lanebreak keeps the leaderboard feature.</em></figcaption>  </figure><p id=\"VNDb8V\">Peloton says the games are available at beginner, intermediate, and advanced levels. You can pedal along to various music genres, as well as collections of David Bowie remixes and David Guetta. Peloton also says it’ll launch with 20 levels and will be adding new levels regularly. And in case you’re the competitive type, there’s still a leaderboard as well.</p><p id=\"M3NmZc\">We’ve known Lanebreak was coming for a while. Peloton first <a href=\"https://www.theverge.com/2021/7/19/22580340/peloton-lanebreak-in-app-game-launch\">hinted at the video game</a> in July, but the game was in beta. Then earlier this month, Google announced it was <a href=\"https://www.theverge.com/2022/2/4/22917999/google-stadia-white-label-peloton-bungie-capcom\">demoting Stadia</a> in favor of powering gaming experiences for other companies — and Peloton’s Lanebreak was one of them. So the timing makes sense. </p><p id=\"SnV8SX\">Connected fitness gaming is a rising trend, and metric gamification is commonly used in fitness apps. However, fitness games are on consoles (<em>Nintendo Ring Fit Adventure, Just Dance, </em>etc.) or in the metaverse. Les Mills, for instance, just launched its own <a href=\"https://www.theverge.com/2022/2/4/22917669/les-mills-quest-meta-fitness-vr-boxing-metaverse\">VR boxing game</a>. Lanebreak stands out as it’s the first in-app video game for what’s essentially a fitness streaming service. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/StGu8Xv4dOhS69P_VvGTTRLtVpg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23252543/Peloton_Lanebreak_music_player.jpg\">      <cite>Image: Peloton</cite>      <figcaption><em>In Lanebreak, you’re encouraged to pedal along to music and gain points based on your cadence and resistance.</em></figcaption>  </figure><p id=\"7uSQwj\">Although the game has been in the works for months, its official launch dovetails neatly with recent comments from new Peloton CEO Barry McCarthy. In an <a href=\"https://www.ft.com/content/034ef665-6604-4cb9-b1af-b09e8b5ede39\">interview with the<em> Financial Times</em></a>, McCarthy emphasized that he viewed Peloton as a “connected fitness company, not a bike company” and that <a href=\"https://www.theverge.com/2022/2/14/22932948/peloton-mccarthy-new-ceo-sale-connected-fitness\">his future strategy was to focus on content</a>. </p><p id=\"S2K7o9\">It might seem odd for Peloton to launch a new product amid its corporate drama. However, the company is thought to have some big projects in the pipeline. In the same <em>FT </em>report, Peloton is <a href=\"https://www.ft.com/content/034ef665-6604-4cb9-b1af-b09e8b5ede39\">rumored to be in the testing stages</a> for a connected rower, with a possible reveal in May. It’s also purportedly working on a new dedicated strength training system to rival Tonal. Finally, we’re also still waiting on the <a href=\"https://www.theverge.com/2021/11/9/22771827/peloton-guide-camera-movement-tracking-price-release-date\">Peloton Guide</a>, a camera-based strength training gadget announced in November. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mCiclW2ssBCx3O47L_KnYwnTMe0=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23252530/In_Game___Breakers___EN.jpg",
  "description": "Peloton’s pedaling through its drama with a new video game",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}