{
  "title": "Peloton finally adds a pause button to its treadmills ",
  "url": "https://www.theverge.com/2022/3/22/22990772/peloton-tread-fitness-pause-button",
  "date": "2022-03-22T15:36:59.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Woman running on Peloton Tread\" src=\"https://cdn.vox-cdn.com/thumbor/ALXS4_EpTx5WoVWXKv-KPWh_KB0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657077/akrales_220120_4970_0017.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"rpCJou\">One downside to Peloton’s treadmills is that they’ve lacked a pause button. Thankfully, the company <a href=\"https://blog.onepeloton.com/pause-button/\">announced</a> yesterday that the latest software update brings the feature to both the Tread and Tread Plus.</p><p id=\"WCp3CT\">Tread and Tread Plus users can now tap the center of the screen to bring up the pause button. You can then hold the button to confirm. Previously, you’d have to hit the back button to exit the class or hit the manual stop button. Once you hit pause, the Tread will gradually slow down until it comes to a complete stop. At that point, you have the option of locking the Tread, or the machine will automatically lock itself after 45 seconds for safety. Your aggregate metrics, class, and progress can be paused for up to 60 minutes.</p><p id=\"KhjvQm\">It might seem a tad ridiculous that Peloton hasn’t made this feature available until now. After all, it first launched the <a href=\"https://www.theverge.com/2019/5/3/18527294/peloton-tread-treadmill-review-running-training-5k-live-streaming\">Tread Plus</a> in 2018, and the smaller, sleeker <a href=\"https://www.theverge.com/22927723/peloton-tread-review-connected-fitness-treadmill\">Tread</a> arrived last summer. That said, there are a few technical considerations that made programming a simple pause button a bit more complicated. </p>  <figure class=\"e-image\">        <img alt=\"The Tread Lock screen on the Peloton Tread\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/w6VAE1haYNVVXtK-x9QPa1f8NIo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23224391/akrales_220120_4970_0175.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>You’ll have to input your Tread Lock passcode to resume classes.</em></figcaption>  </figure><p id=\"UEFoEx\">For example, the pause button can only be used for on-demand classes. According to Peloton’s <a href=\"https://support.onepeloton.com/hc/en-us/articles/4408408928276-Pause-Button\">support page</a>, that means no live classes, encores, sessions, Just Run, or Scenic runs. You also can’t pause during the pre-start section or the post-class cooldown. Users who pause will also be removed from the Leaderboard rankings for that class, likely to keep things fair and prevent cheating. However, paused workouts will still contribute toward streaks, PRs, milestones, and challenges. </p><p id=\"g0rvfM\">Peloton users have been requesting a pause button for a long time. While the connected fitness company first began selling its bikes in 2014, it didn’t add a pause feature <a href=\"https://www.theverge.com/2021/11/8/22770666/peloton-pause-button-on-demand-classes-bike-plus\">until November 2021</a>. At the time, Peloton promised pause buttons would then come to the Tread “in the future.” That led to <a href=\"https://www.reddit.com/r/pelotoncycle/comments/rpf838/pause_button_for_tread/\">some confusion online</a> as it was available for some Peloton machines but not all. </p><p id=\"XNbM7w\">It’s possible that the Tread Lock screen — a safety mechanism required by the Consumer Product Safety Commission after <a href=\"https://www.theverge.com/2021/5/5/22420918/peloton-treadmill-recall-tread-accidents-cpsc-voluntary-refund\">both treadmills were recalled</a> — had something to do with the delay. Last summer, there was a kerfuffle when Tread Lock programming difficulties led to Just Run sessions <a href=\"https://www.theverge.com/2021/6/22/22545663/peloton-tread-plus-treadmill-subscription-plan-recall\">being locked behind a paywall</a>. Peloton compensated treadmill owners with three free months of membership before later figuring out a way to <a href=\"https://www.theverge.com/2021/8/4/22609744/peloton-update-tread-plus-treadmill-lock-subscription\">enable the feature</a> without a mandatory subscription.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GVxGM5BaWlp-dODDWgCKFIlbKi8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23224375/akrales_220120_4970_0017.jpg",
  "description": "You can pause classes for up to 60 minutes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}