{
  "title": "Peloton adds Apple Watch integration to all of its machines",
  "url": "https://www.theverge.com/2022/3/9/22969632/apple-watch-peloton-fitness-wearables",
  "date": "2022-03-09T22:18:17.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8Drb9cg4qV4fy1ekjgZ1MX4AksU=/122x0:1709x1058/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70601487/step4_1830x1058.0.png\" />        <figcaption><em>The Apple Watch can now track workouts on any Peloton machine.</em> | Image: Peloton</figcaption>    </figure>  <p id=\"pejpo2\">Peloton’s making it easier for Apple Watch users to close their rings. Today, the company announced a new Apple Watch integration for the original Bike, Bike Plus, and Tread. </p><p id=\"fVIeJ4\">According to a Peloton <a href=\"https://blog.onepeloton.com/apple-watch-integration/\">blog</a>, the Peloton watch app will notify users any time they start a class on the Bike, Bike Plus, or Tread. It’ll also work for classes started on the app. Users can also choose to proactively start recording workouts. If enabled, the Apple Watch can also double as a heart rate monitor so you can view Peloton’s Strive Score feature. The Strive Score is a metric that tells users how much time they spend in a specific heart rate zone. It’ll also make it easier to log Peloton workouts in Apple’s Activity app. </p><p id=\"GMirgo\">The integration isn’t automatic, however. You have to go through a one-time setup process. First, make sure the Peloton app is on both your phone (or tablet) and the Apple Watch. From there, open the Peloton app on your phone and tap the “More” tab. Select “Apple Watch,” then “Set Up,” and “Connect to Health app.” That should then bring up the Health app. Grant whichever health permissions you’re comfortable with — keeping in mind that if you deny any metrics, it may affect how well the integration works. After that, head back to the Peloton app and hit “Done.” Finally, when the Apple Watch app asks for notification permissions, tap “Allow.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eAiVJPg8-ghJNP7Fa-xZ2NF5nz8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23302209/step2_1830x1058.png\">      <cite>Image: Peloton</cite>  </figure><p id=\"Wi6xog\">That might seem like a lot, but it’s fairly typical for integrating a fitness app with Apple Health. This also isn’t the first time we’ve seen this sort of feature. It’s similar to how GymKit, Apple’s proprietary fitness API, allows you to record workouts on NFC-enabled exercise equipment on the Apple Watch. The ability to start recording from your wrist is also reminiscent of Apple’s own Fitness Plus service.</p><p id=\"fR6cgS\">Previously, only the Bike Plus supported any kind of Apple Watch integration via GymKit. However, there was a dustup when Peloton <a href=\"https://www.theverge.com/2021/4/15/22385515/peloton-bike-plus-gymkit-apple-watch-bootcamp-support\">removed GymKit support</a> for its Bootcamp workouts. Technically, <a href=\"https://www.theverge.com/2021/4/16/22387412/peloton-apple-watch-integration-gymkit-statement-terms-of-service\">GymKit wasn’t able to support Bootcamp workouts</a> as they switched between cardio and strength training. However, that was a GymKit-specific issue. Peloton says that the new integration will allow users to track all workouts on every Peloton machine. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/f2XnTc0qDzkqBAoKJ-aEF4S-pTI=/0x50:1830x1008/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23302120/step4_1830x1058.png",
  "description": "It just got easier for Peloton users to close their rings.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}