{
  "title": "Peloton’s new CEO says a sale isn’t in the cards",
  "url": "https://www.theverge.com/2022/2/14/22932948/peloton-mccarthy-new-ceo-sale-connected-fitness",
  "date": "2022-02-14T16:00:28.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Peloton’s new CEO says a sale isn’t happening any time soon\" src=\"https://cdn.vox-cdn.com/thumbor/UwPbcsb7F7hOHktv1GvLCQ1oeMo=/28x0:3000x1981/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507348/1365914836.5.jpg\" />        <figcaption>Photo by Joe Raedle/Getty Images</figcaption>    </figure>  <p id=\"kkvhGI\">Last week was an eventful week for Peloton: it <a href=\"https://www.theverge.com/2022/2/8/22923229/peloton-layoff-new-ceo-mccarthy\">got a new CEO</a>, investors <a href=\"https://www.theverge.com/2022/2/8/22923434/peloton-foley-ceo-layoffs-earnings-connected-fitness\">unleashed their fury</a> at outgoing CEO John Foley, <a href=\"https://www.theverge.com/2022/2/8/22923480/peloton-severance-package-membership-layoffs\">2,800 employees were fired</a>, and then some of those employees <a href=\"https://www.theverge.com/2022/2/9/22926095/peloton-ceo-all-hands-fired-employees\">crashed an all-hands</a>. At the heart of the drama, a big question was whether new CEO Barry McCarthy had been brought on to get Peloton in shape for a sale as the company’s value has plunged to $8 billion from a pandemic high of $50 billion. However, in a <a href=\"https://www.ft.com/content/034ef665-6604-4cb9-b1af-b09e8b5ede39\"><em>Financial Times</em> interview</a>, McCarthy has officially nixed the idea for the “foreseeable future.” </p><p id=\"43UaDI\">“If I thought it was likely that the business was going to be acquired in the foreseeable future, I can’t imagine it would be a rational act to move across the country. There are lots of other things I could be doing with my time that are quite lucrative than hanging out a with a business that’s about to be sold,” McCarthy told <em>The Financial Times</em>, referring to the fact that he’ll be moving from California to New York for the job.</p><p id=\"xsWnlL\">McCarthy emphasized that Peloton had room to grow and that he would focus on the content because Peloton is a “connected fitness company, not a bike company.”  (Something that product reviewers and analysts have been saying since day one.) This tracks with McCarthy’s background. Before becoming Peloton CEO, McCarthy was the chief financial officer at Netflix and Spotify (as well as chief operating officer at the ill-fated, ill-remembered <a href=\"https://www.vox.com/2014/3/13/11624542/clinkles-still-a-hot-mess-as-its-big-shot-coo-departs\">mobile payment app Clinkle</a>). Following McCarthy’s appointment, Foley touted his experience with digital streaming services and subscription business models. In the <em>FT</em> interview, McCarthy also hinted that Peloton’s pricey $39 monthly membership fee could be replaced by an entirely different pricing structure. </p><div><aside id=\"BlFpFZ\"><q>Peloton is separately working on a connected rowing machine, as well as a “dedicated strength training system”</q></aside></div><p id=\"Ftlbi6\">It also follows the tone set during Peloton’s Q2 earnings call last week, where Foley and Peloton’s chief financial officer Jill Woodworth repeatedly emphasized the company would pursue “sustained growth.” However, none of this means Peloton’s given up on hardware completely. McCarthy told the <em>Financial Times </em>his strategy includes creating “product line extensions” to entice customers into owning multiple Peloton devices. </p><p id=\"qrAUBR\">The report also notes that Peloton is separately working on a connected rowing machine, as well as a “dedicated strength training system.” The former will purportedly feature the same tablet as the Bike Plus, use magnetic resistance, and give form feedback. The rower, which <a href=\"https://www.bloomberg.com/news/articles/2021-08-21/peloton-app-hints-a-rowing-machine-will-arrive-soon-report\">has been long-rumored</a>, is supposedly in the testing phase and may be announced before or after Peloton’s annual “Homecoming” event in May. </p><p id=\"YdSVdj\">The strength training system is supposed to be Peloton’s answer to rival Tonal, but according to <em>FT</em>, it seems like it may be separate from the forthcoming <a href=\"https://www.theverge.com/2021/11/9/22771827/peloton-guide-camera-movement-tracking-price-release-date\">Peloton Guide</a>. Tonal is <a href=\"https://www.theverge.com/2020/1/23/21077238/tonal-review-strength-training-connected-weight-fitness-machine-price\">a weight training system</a> that relies on electromagnetic resistance cables and is installed directly into a user’s wall. Peloton’s rumored strength training device will pair with television instead and won’t be released for a while. </p><div class=\"c-float-right\"><aside id=\"eGGePA\"><q>For now, McCarthy and Foley seem to be presenting a united front</q></aside></div><p id=\"tU0NDf\">All this seems to put the kibosh on a Peloton sale, at least in the short-to-medium term. McCarthy did acknowledge that the decision to sell isn’t really his, however. That belongs to shareholders. More specifically, a group of company insiders that holds 80 percent of Peloton’s voting rights, which includes former CEO — and now executive chairman — John Foley. McCarthy also said that he was “confident a large percentage of the votes will be cast in favor of my leadership” and cited that as a reason why he agreed to take the job.</p><p id=\"wDYM7f\"><em>The Financial Times</em> interview, however, also made it clear that Foley isn’t going anywhere, either. While McCarthy tried to underline that the buck stopped with him, he also said Foley would continue to play “an instrumental role” in Peloton’s products, strategy, and vision. The two have also been publicly singing each others’ praises for the past week and, for now, seem to be presenting a united front. Foley told <a href=\"https://www.wsj.com/articles/peloton-ceo-john-foley-to-step-down-become-executive-chair-11644314403?mod=hp_lead_pos2\"><em>The Wall Street Journal</em></a> that McCarthy was “perfectly suited” for the job, while McCarthy said that together, the two were one “complete grown-up.”  This time around, McCarthy indicated he wouldn’t be leaving Foley behind, and McCarthy said he intended to “suck every ounce of superpower out of him” for as long as Foley would let him.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/woGko4gUGOznKZbHFiD8d5H0PNY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23224381/akrales_220120_4970_0065.jpg",
  "description": "A new rower and strength training system might be next.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}