{
  "title": "Peloton teases new rower at Homecoming event",
  "url": "https://www.theverge.com/2022/5/13/23068592/peloton-connected-rower-homecoming-tom-cortese",
  "date": "2022-05-13T14:15:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/VnBf2_SyKw2g4ZkNrhabUMbqREs=/362x0:1679x878/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70865176/Screen_Shot_2022_05_12_at_3.46.53_PM.0.jpg\" />        <figcaption><em>The Peloton rower’s handle. I was not kidding when I said they were teasing the machine.</em> | Screenshot: Peloton</figcaption>    </figure>  <p id=\"80AObb\">Peloton’s annual Homecoming event is for the fans. It’s where the fitness tech company teases new products, as well as drops new features and content. It’s also a chance for fans to take live classes taught by their favorite instructors and attend special panel discussions. This year, the big tease is that Peloton officially confirmed a connected rower is coming.</p><p id=\"Z9JC3k\">Peloton’s reveal is more of a teaser and official confirmation than anything else. We don’t know the specs or when it’ll launch — just that it’s “coming soon.” In terms of design, the rower itself appears to have a similar vibe to the <a href=\"https://www.theverge.com/22927723/peloton-tread-review-connected-fitness-treadmill\">Peloton Tread</a> — sleek, with a minimalist profile and a display to watch classes on. Rumors about the rower have been floating around since 2018, when <em>Bloomberg</em> <a href=\"https://www.bloomberg.com/news/articles/2019-11-13/peloton-to-sell-cheaper-treadmill-and-a-rowing-machine-in-2020?sref=P6Q0mxvj\">reported</a> that Peloton had plans to launch it in 2020. Obviously, 2020 came and went, and no rower was to be seen.</p><p id=\"A175HG\">Ahead of Peloton’s Homecoming announcement, I got to speak with co-founder and chief product officer Tom Cortese about the decision, as well as Peloton’s other Homecoming announcements. </p><p id=\"19ugMG\">“We’re entering the rowing category, which is long-awaited and feels like the worst-kept secret on Earth, so might as well just talk about it,” Cortese told me over Zoom.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Bh5t_OCFxNIrykOny0EZWcSkJgo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23456744/Homecoming_2022_Icon.png\">      <cite>Image: Peloton</cite>      <figcaption><em>Homecoming is an annual event for fans where Peloton announces new features and teases new products.</em></figcaption>  </figure><p id=\"4aKigS\">For an at-home gym, treadmills and bikes make sense. In the fitness tech world, a lot of equipment makers cater to runners and cyclists because they’re popular activities. But rowing has traditionally been a bit more niche. Part of that is the space it takes up in your home, and most people don’t grow up rowing. You instinctively know how to run, and learning to ride a bike is often a fond childhood memory. There’s a distinct form that accompanies rowing that you wouldn’t know unless someone taught you. And while rowers have been available at gyms for decades, the sport it's based on has a rep for <a href=\"https://row-360.com/who-we-leave-behind/\">being elitist and exclusionary</a>.</p><p id=\"HKvQrw\">That said, indoor rowing has <a href=\"https://www.outsideonline.com/health/training-performance/indoor-rowing-fitness-classes/\">increasingly become popular</a> during the last few years, thanks to boutique and connected fitness classes. Hydrow made its name as the “Peloton of rowers,” and there are plenty of other Hydrow-esque services out there right now. Apple included rowing as a category in Fitness Plus. OrangeTheory is another trendy boutique fitness studio that heavily features rowing.</p><p id=\"Rp7iKQ\"> “In a relatively short period on the rower, like a 10 or 15-minute class, you can actually engage <a href=\"https://oce.ovid.com/article/00005768-200803000-00026/HTML\">86 percent of the muscles in your body</a>,” Cortese says. “The problem with rowing has been it’s kind of inaccessible because the average person like me looks at a rower, and I don’t know what to do.” </p><div id=\"8tkym6\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Peloton Homecoming 2022 Sizzle Reel|107164\" data-volume-uuid=\"dbb792d6d\" data-volume-id=\"107164\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-303\" class=\"volume-video\" data-volume-player-choice=\"chorus\"></div><div class=\"caption\"><em>This video has a tiny tease of the rower. Blink, and you might miss it.</em></div></div><p id=\"lhOhTV\">The idea is that Peloton wants to leverage its tech, bullpen of popular instructors, and hardware design sensibilities to de-mystify rowing. It also dovetails with another Peloton initiative to expand its strength training options. Cortese noted that Peloton is going to steadily increase its strength training content. At Homecoming, the company announced a new four-week program hosted by trainer Tunde Oyeneyin focusing on arms and shoulders that’ll first be a <a href=\"https://www.theverge.com/23009893/peloton-guide-review-fitness\">Peloton Guide</a> exclusive. The Guide, a camera-based system that lets you check your form on a TV as you follow along with your instructors, is Peloton’s first foray into strength training hardware — and the rower, a combination of cardio and strength, will be its second.</p><p id=\"kWXuM5\">This is all in line with Peloton’s overall approach through the years. However, sticking to a game plan is unlikely to soothe antsy investors fixating on Peloton’s stock price, especially since the hardware itself is often what analysts hold under the microscope. </p><div class=\"c-float-right\"><aside id=\"ssBVtP\"><q>Sticking to a game plan is unlikely to soothe antsy investors fixating on Peloton’s stock price</q></aside></div><p id=\"Ndi13j\">Earlier this week, the company posted larger-than-expected losses for <a href=\"https://www.theverge.com/2022/5/10/23065004/peloton-earnings-q3-2022-barry-mccarthy\">its Q3 earnings</a>. During the call, new CEO Barry McCarthy repeatedly told analysts from big-name banks that while Peloton was good at hardware, “being good at hardware is not nearly sufficient.” And while McCarthy is still new to the job, he’s been <a href=\"https://www.theverge.com/2022/2/8/22923434/peloton-foley-ceo-layoffs-earnings-connected-fitness\">consistent</a> <a href=\"https://www.theverge.com/2022/2/19/22942449/pelotons-new-ceo-subscriptions-open-app-store-barry-mccarthy\">since</a> <a href=\"https://www.theverge.com/2022/2/14/22932948/peloton-mccarthy-new-ceo-sale-connected-fitness\">taking</a> <a href=\"https://www.theverge.com/2022/3/10/22970905/peloton-bike-fitness-subscription-model\">the helm</a> about subscriptions being at the front and center of his strategy. Chief Financial Officer Jill Woodworth explained that its overstocked inventory was costing the company. But, yet again, Peloton is launching new hardware.</p><p id=\"XeIJAO\">When asked about how the rower fits into Peloton’s new software-first strategy, Cortese says that the company “has always been and will always be a subscription business.” That in turn means keeping the fanbase happy with an ever-growing library of content and features. The goal is to hook users into the community and make sure they never want to quit the Peloton ecosystem. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EH4678y8XHe6S69MH4brCz4RiVo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23456791/Invite_Members.png\">      <cite>Image: Peloton</cite>      <figcaption><em>Invite Members is one of the new features announced at Homecoming that allows you to schedule community workouts from the Bike.</em></figcaption>  </figure><p id=\"IktgP4\">So far, the company’s been remarkably successful at that. Quarter after quarter, the company’s monthly churn rate — the percentage of Peloton users who cancel their membership<strong> </strong>— stays under one percent. In this most recent quarter, even with an increase in subscription cancellations following <a href=\"https://www.theverge.com/2022/4/14/23025237/peloton-cuts-prices-exercise-equipment-subscription-costs-barry-mccarthy\">news of a price hike</a>, the churn rate actually improved to 0.75 percent. The question is whether that’ll change.</p><p id=\"xZOaaP\">“Our business incentive is to keep you as a subscriber forever,” Cortese says. “We believe there’s so much that we can do on a daily and weekly basis to continue to change and evolve the bike experience, the tread experience, and now the rowing experience.”</p><p id=\"fqSYYK\">That explains the strategy behind <em>several</em> of the new features announced at Homecoming. For instance, Cortese says the company has seen that a growing number of users are taking yoga classes, and lo, Peloton announces it’s adding a second installment in its Yoga series “The Approach.”  To appeal to hardcore Bike users, Peloton previously launched its <a href=\"https://blog.onepeloton.com/power-zone-training/\">Power Zone Training Program</a>. At Homecoming, that too is getting a new eight-week program called “Peak Your Power Zones.” </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3Mzuyxeka7lWd3868_pYDZbmolI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23456796/Just_Work_Out.png\">      <cite>Image: Peloton</cite>      <figcaption><em>Just Workout gives users less incentive to leave the app to record their other workouts.</em></figcaption>  </figure><p id=\"dFB7bE\">Peloton is also making it easier for current users to interact with each other. Members can now directly schedule workouts from the Bike with a new “Invite Friends” feature. Likewise, it’s also introducing a “Just workout” feature — meaning that any uninstructed activity can be recorded within the Peloton app. Meanwhile, the company is adding TalkBack — an accessibility feature to help blind and low-vision users — to the Tread. The feature talks these users through the Tread’s UI. It’s a savvy move, as multiple studies have found this community is <a href=\"https://pubmed.ncbi.nlm.nih.gov/16254234/\">massively</a> <a href=\"https://journals.sagepub.com/doi/full/10.1177/02646196211067356\">underserved</a> by current exercise equipment and fitness facilities. According to the <a href=\"https://www.afb.org/aw/8/6/14300\">American Foundation for the Blind</a>, ideally, treadmills would have tactile surfaces, braille labels for controls, and speech output. So while Peloton could do more in the future along these guidelines, this is at least a step in the right direction. It also makes Peloton a more palatable option for those communities and throws down the gauntlet for Peloton’s army of copycats to do the same.</p><p id=\"1yFsGJ\">But perhaps the one that will make Peloton diehards most excited is that the company is reopening its Peloton Studios. The Studios is where Peloton films and broadcasts its content, and before the pandemic, it was a place where many Peloton fans visiting New York City would pop in and get some face time with their favorite instructors. The original Studio was located on 23rd St but has since been moved to a shiny new facility near Hudson Yards. Due to the pandemic, the new Studio has never been open to the public. There are no details on timing, however.</p><div class=\"c-float-left\"><aside id=\"htTykc\"><q>Loyalty has never been a problem for Peloton</q></aside></div><p id=\"WT3Kkr\">All of these announcements are a means of reaching new users, keeping those users engaged in the Peloton platform — and giving them fewer and fewer reasons to leave. And if you’re a Peloton fan, I’d say they’re pretty effective. But loyalty has never been a problem for Peloton. The problem is the disconnect between a company that makes an industry-leading product and its stock price.</p><p id=\"ypqyhn\">When asked about the negative press and the endless speculation about <a href=\"https://www.theverge.com/22778851/peloton-growing-pains-connected-fitness-tonal-hydrow-mirror\">Peloton’s future</a>,  Cortese was unfazed. </p><p id=\"g4yXBy\">“It’s a blip. It’s a moment in time. As long as we stay focused on doing what we do well and continue to drive genuine value into a space where there’s a genuine need by a real consumer — I’m ready to do this for another 10 years.” </p><p id=\"06IcPw\">If Peloton sticks around for a long time, then yes. This is a blip in the same way Apple had its “lost years.” There is a way forward for the company if its restructuring plan is successful — though it’s not likely that it’ll return to its peak pandemic valuation anytime soon. In the earnings call, Peloton’s leadership team talked about its restructuring goals continuing into 2023 and maybe 2024. But so long as the fans stick through the ups and downs, Peloton can keep on rowing.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AVP3BBymTQvOdQiSyMTbiZivB0Y=/182x0:1859x878/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23456868/Screen_Shot_2022_05_12_at_3.46.53_PM.jpg",
  "description": "But will Cody Rigsby teach rowing classes?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}