{
  "title": "Peloton Guide review: a webcam that watches you squat",
  "url": "https://www.theverge.com/23009893/peloton-guide-review-fitness",
  "date": "2022-04-05T11:00:00.000Z",
  "author": "Victoria Song",
  "content": "  <p>The camera-based device lets you monitor your form while strength training</p> <p class=\"p--has-dropcap p-large-text\" id=\"tRSdhp\">Generally, I do not even lift, bro. I am a cardio gal who begrudgingly strength trains when I remember it’ll help me run faster. Some of that is because I hate being perceived by judgy gym bros. Some of it is my lack of confidence in throwing together a good, varied routine for my goals. Coincidentally, connected fitness thus far has also been primarily cardio-heavy and struggles with strength training. Either you’re grappling with <a href=\"https://gizmodo.com/jaxjox-kettlebell-connect-review-this-connected-kettle-1844285865\">clunky connected weights</a>, or you’re spending thousands to install a high-tech system like <a href=\"https://www.theverge.com/2020/1/23/21077238/tonal-review-strength-training-connected-weight-fitness-machine-price\">Tonal</a> in your home. That’s why, at $295, the camera-based Peloton Guide is an interesting proposition.</p><p id=\"nUE50p\">The Peloton Guide is the company’s first foray into strength training hardware. (Though it’s had strength training classes for ages.) It’s a camera that, once it’s plugged into your TV, mirrors and tracks your real-time movements during Peloton classes. The idea is to check your form against the instructor’s so you get a better sense of what you’re doing. </p><p id=\"FeExpU\">Basically, it’s sort of like a fitness webcam — except you’re not talking to anybody else. But seriously, when it’s mounted on my TV, it reminds me of my Logitech webcam. It even has a sliding privacy cover and two LED indicator lights so you can tell when the device is on. On the back, you’ll find a physical microphone switch, an HDMI port, and a USB-C port for power. It also comes with a remote control and a magnetic mount for attaching it to the top of your TV. </p><div id=\"sCWBa7\"><div data-anthem-component=\"scorecard:11127978\"></div></div><p id=\"Bgg74F\">A lot of fitness tech companies have promised me their equipment can fit in my home. But whenever I get down to measuring, my narrow living room often falls short. This is one of the few fitness gadgets that can truly fit in just about any home. The device is about the size of my TV remote, and its space requirements are very reasonable. Peloton recommends having at least 4.5 by 6 feet of unobstructed space. Basically, if you can fit two yoga mats next to each other at a distance of 2-3 feet from your TV, you’re good. I only had about a 6 by 6 feet square of free space to work with in my living room. It was a tight fit, and my cat was furious that I moved the couch back a few inches. But it worked!</p><p id=\"FbkKvJ\">To set up the Guide, all you have to do is plug it into a power source and connect it to one of your TV’s HDMI ports. From there, you follow on-screen prompts to pair the remote, connect it to your Wi-Fi, log into your Peloton account, and train the camera. That involves a few things. First, you’re helping the 12-megapixel wide-angle camera to recognize your workout space. Then, you’ll be prompted to do a few basic poses, like holding your hands above your head to see if the tracker can detect your movements. You’ll also get a short tutorial on how the movement tracker works. If you want to use voice commands, you’ll also be prompted to read a few short sentences so the Guide can recognize your voice. Altogether, I’d say it took about 10-15 minutes from start to finish. </p>  <figure class=\"e-image\">        <img alt=\"A view of the Peloton Guide’s HDMI port, USB-C Port, and physical microphone switch.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wRXehzKJafQrVGPCWY8KMreXWnA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366144/vsong_220331_5109_0006.jpg\">      <figcaption><em>The physical microphone switch is on the back, along with the USB-C power and HDMI ports.</em></figcaption>  </figure><p id=\"AgCPrP\">But while the Guide was easy enough to set up, I had qualms about how the overall experience would go. There were so many things that could go wrong. The class could lag, the Guide could lose connection, the picture might be too grainy, or the camera might not even be able to track me adequately. It could work one day and completely crap out the next. So I was pleasantly surprised when the Guide consistently did its job — and did it pretty well.</p><p id=\"wcCjd8\">I was particularly impressed by the Guide’s user interface. My biggest pet peeve when it comes to strength training in fitness apps is filtering classes. Most apps sort classes by upper body, lower body, core, and full body. They don’t, however, let you search by muscle group. If my goal is to strengthen my glutes, I have to dive into each lower body class description to see if it’ll contain exercises targeting that area. Depending on the app, sometimes you have to scrub through a preview video. It’s time-consuming. </p><p id=\"bav4nZ\">With the Guide, each compatible class tells you which muscles are targeted. You can even sort by body part, in case you’re really focused on beefing up your biceps. You’re also able to see which muscle groups you’ve recently exercised, so you can make smarter decisions about the type of workout you should do next. (Also known as <em>not</em> skipping leg day.) This level of granularity isn’t absolutely necessary, but it sure does make searching for classes easier. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Peloton Guide on top of a TV in a living room.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JEzAs5A03QWEbinCWhaXsh71Ci4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366141/vsong_220331_5109_0003.jpg\">      <figcaption><em>See, it looks like a fitness webcam for your TV.</em></figcaption>  </figure></div><p id=\"IAXLc7\">Each workout preview also lists all the exercises involved. If you’re unfamiliar with a move, you can then click it to view a short video demo. I also appreciated that each workout lists the exact equipment you’ll need. For instance, one 20-minute full-body class specified that I’d need medium <em>and</em> heavy dumbbells. Too often, I’ve had to scramble during a warmup to find a dumbbell of a different weight because the description merely said “dumbbells required.” </p><p id=\"MjQdtG\">In class, you can also adjust how you appear on-screen, and the camera will also make sure you’re always centered in the frame. Some options include stacking your video on top and your instructor on the bottom, as well as viewing yourself as a smaller picture-in-picture. You can also reverse that so you’re the big one on screen. You could also just focus on the instructor only.</p><p id=\"mRwkFA\">Most of these UI elements aren’t unique to Peloton. I’ve seen them implemented in various apps over the years. I just haven’t really seen it executed in such a complete, intuitive way. </p>  <figure class=\"e-image\">        <img alt=\"The Peloton Guide with its magnetic mount\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SGabiFLd3nk3ex_1OLcmUz77mDM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366143/vsong_220331_5109_0005.jpg\">      <figcaption><em>The magnetic mount is actually quite sturdy.</em></figcaption>  </figure><p id=\"5B3M5X\">As for the classes themselves, they’re pretty straightforward. There’s a whole stable of instructors, and most classes range from 10 to 45 minutes. An instructor guides you through the movements, there’s motivational music in the background, and because this is Peloton, there’s also a leaderboard. In the top-left corner are a timer and a “playlist” of moves so you can see what’s coming up. There’s also a teardrop-shaped movement tracker, which fills up during each exercise so long as you keep moving. At the end of each workout, you’re given a detailed report of which muscles you exercised and what percentage of moves you completed.</p><p id=\"Ktoy9H\">In the 10 days I’ve been testing the Guide, I’ve taken eight classes. To my surprise, the movement tracker was able to keep up with me about 90 percent of the time. There were a few instances where the camera wasn’t able to track me, but I pin that on my cramped space rather than the Guide itself. And there really were moments where watching myself on the big screen did improve my form. A few times, I noticed a rounded spine while in a hinge or improper hip alignment during a plank. (However, I did <em>not</em> appreciate that correcting my form made the moves harder.) </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Peloton Guide’s remote control\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4lDvKn422yNOVvDVH4nFKPHwOko=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366139/vsong_220331_5109_0001.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>Peloton’s remote control is easy to use. I just wish I didn’t need another one.</em></figcaption>  </figure></div><p id=\"phwYta\">That said, it was on me to check my form — and sometimes the moves aren’t conducive to that. For instance, if you’re facing the screen during a squat, you can’t exactly see if your spine is neutral. Some AI feedback on my form would’ve been nice. Also, if you were hoping the movement tracker would track reps, bad news. You’re going to have to keep count yourself. Peloton spokesperson Amelise Lane told <em>The Verge</em> that at launch, the Guide is focusing on helping people with “accountability and guidance.” For example, the movement tracker is there as a motivational tool to help you keep moving throughout. That’s great for beginners since you’re less likely to get discouraged if you can only do a low number of reps. However, I could see that being potentially frustrating for more experienced athletes. It’s possible this will change down the line. Lane also said that because the Guide uses AI, it’s a platform that can be regularly updated with new moves and features in the future. </p><div class=\"c-float-left c-float-hang\"><div id=\"N4iPZB\"><div data-anthem-component=\"aside:11127984\"></div></div></div><p id=\"PSUPxW\">Overall, the Guide is best suited for beginning and intermediate level strength training — as that’s who’d benefit most from checking their form. Though, there’s plenty to enjoy for the already shredded. I assure you, the advanced classes I took were absolutely brutal. </p><p id=\"6oXo9F\">It’s, admittedly, a little weird to have a camera watching you huff and puff. Logically, it’s not that different from working out in front of a mirror at the gym. At least at home, only your pets can judge you. That said, something about smart cameras always feels mildly dystopian. During a briefing, Peloton said it was aware customers might feel wary of that during the design period. According to Peloton, no video or images of you working out ever gets uploaded to the cloud. The device does collect data that specifically identifies you — your face, body, and voice — to “understand you as a user,” analyze your workout performance, and make recommendations. Voice recordings are also done on-device, and you’re given the option of whether you want to share voice data with Peloton. You can also physically turn off the mic if the idea of the device listening to you feels creepy. When you’re not using the device, you can use the camera cover. This is, however, still the Internet of Things. Even if a company takes precautionary measures, you still assume some risk when you bring a connected gadget into your home.</p><p id=\"Hq5u2F\">As for voice controls, they work. I was able to pause a workout by saying, “OK, Peloton, pause workout.” I can see that being handy if you forget where you put the remote, but I only used it a handful of times. Speaking of remotes, I don’t love that you need a separate one for the Guide. I already have a basket brimming with remote controls. I don’t need any more. Still, in the grand scheme of things, that’s me nitpicking.</p><p id=\"IeIX7M\">A few months ago, I would’ve said that although the Peloton Guide was well made, it was too expensive. That’s because it was <a href=\"https://www.theverge.com/2021/11/9/22771827/peloton-guide-camera-movement-tracking-price-release-date\">supposed to be $495</a> with a $39 monthly membership. However, Peloton has slashed that to $295 with a reduced $24 monthly fee through 2022. (It’ll go back up to $39 in January 2023. The hardware price will not change.) </p>  <figure class=\"e-image\">        <img alt=\"The Peloton Guide with the camera open in front of a TV\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xhC6v84bAqd2Rt2Rh1JdaiqEQTw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366142/vsong_220331_5109_0004.jpg\">      <figcaption><em>You can also use the the Guide under the TV.</em></figcaption>  </figure><p id=\"X01jlk\">The new price is actually not that bad. If you math it out, one year of the Peloton Guide is comparable to shelling out for an Apple Watch Series 7, an Apple TV, and a year of Fitness Plus. That’s if you buy the Guide now and get roughly nine months at the introductory price and three months at the regular price. It gets more expensive the longer you wait, and then you’re then on the hook for the $39 subscription — a price that’s comparable to many gym memberships. Connected fitness is also a fairly expensive category. Subscriptions, free trials, and limited promotional offers can also make it hard to definitively say just how much a connected fitness gadget will cost you. All things considered, the Guide is reasonably priced for what it is.</p><p id=\"kuoieX\">However, that’s if you already have a pair of dumbbells and a workout mat lying around. If you don’t, you’ll have to factor in the extra cost to buy them. Peloton also offers bundles that include dumbbells, a workout mat, and the Peloton Heart Rate Band. Depending on how many dumbbell sets you get and whether you want the heart rate band, the price ranges from $545 to $1,270. That’s when it starts to get too pricey, but to be fair, you don’t have to buy Peloton’s accessories. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Side angle of the Peloton Guide\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KMcxNl_JW_xS32q34gbyqMmdVJ8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366140/vsong_220331_5109_0002.jpg\">      <figcaption><em>The fabric covering the Guide is admittedly nice.</em></figcaption>  </figure></div><p id=\"gK9mqe\">The $495 Tempo Move is a competitor also worth considering. I’ve been testing it alongside the Guide, and it’s the closest thing out there in terms of price and feature set. It relies on your iPhone camera to detect your moves and provide feedback when your form slips. It also comes with special NFC-enabled dumbbells, so you can keep track of how many reps you did at a certain weight. But the classes aren’t quite as good as Peloton’s, and you still have to pay a $39 monthly fee. I’ve had a few connectivity issues as well. And for Android users, this is a no-go, as the Move is currently limited to iPhone users only. </p><p class=\"c-end-para\" id=\"JAOuwN\">Ultimately, this is Peloton’s most affordable hardware. The device itself is fine, the UI is excellent, the camera works as it should, and the content is best in class. I have my quibbles, sure, but I really do think the Guide is the most innovative hardware Peloton’s ever made. Personally, I’d love for it to expand to yoga classes. But right now, it’s a great option for anyone who’s intimidated by gym culture or just starting to strength train. If that’s you, I say let the Guide be your guide.</p><p id=\"myDlV2\"><em>Photography by Victoria Song / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/diixXVo74VMZqLFYLP4j8L3jV7M=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366146/vsong_220331_5109_0008.jpg",
  "description": "In case you need help keeping a neutral spine",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}