{
  "title": "Peloton is extending its free home trial from 30 to 100 days",
  "url": "https://www.theverge.com/2022/3/3/22960205/peloton-free-trial-bike-treadmill-fitness",
  "date": "2022-03-03T19:43:43.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"Pelton Bike Plus in an apartment\" src=\"https://cdn.vox-cdn.com/thumbor/NWo4U_WkvN2NmDaPGfeYkCT0fac=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70575412/akrales210108_4344_0020.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"BTuqpK\">Coming off a fraught month, Peloton is now extending free at-home trials for its Bike, Bike Plus, and Tread from 30 to 100 days. </p><p id=\"YvpEec\">According to Peloton’s <a href=\"https://www.onepeloton.com/home-trial\">website</a>, this is a limited-time offer for new customers who buy a Peloton machine between March 3rd, 2022, 5PM ET and March 22nd, 2022, 2:59AM ET. Essentially, the program allows customers to buy a new Peloton device, try it for a little over three months, and then return the machine for a full refund if it’s not to their liking. Returns will get free pickups, and Peloton says it’ll also cover shipping fees. While the trial starts once the machines are delivered, Peloton says that buyers will get immediate access to the Peloton app once their orders are confirmed. </p><p id=\"vywMQJ\">That said, there’s always fine print with these sorts of things. In this case, it’s not available to customers who live in remote areas such as Alaska, Hawaii, Puerto Rico, the US Virgin Islands, and “ferry-only accessible locations.” You also have to pay upfront. Customers who pay by credit card will have to pay the full cost at time of purchase. Those who qualify for financing will have to pay their first installment. Another catch: Peloton added a $250 delivery fee to all Bike, Bike Plus, and Tread purchases after January 31st, which this new promotion doesn’t remove. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/B2ZwCWqjiKV12_PSv0GjCBL-U50=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23224379/akrales_220120_4970_0043.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"b1x2HS\">This isn’t the first time Peloton’s extended its free trials. At the start of the pandemic, Peloton <a href=\"https://www.theverge.com/2020/3/16/21182267/peloton-workout-app-trial-at-home-subscription\">extended its 30-day app trial period</a> to 90 days. It was a move that made a lot of sense at the time, and this is no different — though Peloton’s circumstances have <a href=\"https://www.theverge.com/2022/2/8/22923434/peloton-foley-ceo-layoffs-earnings-connected-fitness\">changed quite a bit</a>. </p><p id=\"VVJa9c\">After experiencing a boom during the pandemic, the company <a href=\"https://www.prnewswire.com/news-releases/peloton-completes-precor-acquisition-301261010.html\">ramped up</a> <a href=\"https://www.theverge.com/2021/5/24/22451515/peloton-400-million-factory-ohio-treadmill-bikes\">manufacturing</a> to meet increased demand and alleviate months-long shipping delays. However, once quarantine restrictions lifted, that demand began to die off. Just before a <a href=\"https://www.theverge.com/2022/2/8/22923229/peloton-layoff-new-ceo-mccarthy\">major leadership shakeup</a> last month, there were rumors that Peloton was <a href=\"https://www.theverge.com/2022/1/20/22893462/peloton-bikes-treadmills-production-connected-fitness\">halting all manufacturing</a> because it had an excess of bikes and treadmills. Then-CEO and co-founder John Foley denied the claim. However, chief financial officer Jill Woodworth said during <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.fool.com%2Fearnings%2Fcall-transcripts%2F2022%2F02%2F08%2Fpeloton-interactive-pton-q2-2022-earnings-call-tra%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F3%2F22960205%2Fpeloton-free-trial-bike-treadmill-fitness\" rel=\"sponsored nofollow noopener\" target=\"_blank\">last month’s earnings call</a> that the company had “higher-than-normal inventory.” Woodworth also noted that the company was looking to improve its profit margins on hardware sales, hence the new $250 delivery fee. </p><p id=\"zznnUb\">Extending the trial is a shrewd move to ease concerns from potential customers — especially those who may be hesitant to bite the bullet given the brouhaha over the company’s health. And if it helps Peloton work down its inventory, well, that slots into the company’s ambitious restructuring plan. </p><p id=\"6BvCFR\"></p><p id=\"jN0FcO\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tGOO-mXtMwbXNM-_lmsgXVkHaaM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22233853/akrales210108_4344_0020.jpg",
  "description": "The offer is for new customers between March 3rd and March 22nd.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}