{
  "title": "Peloton fired 2,800 employees and gave them free Peloton memberships",
  "url": "https://www.theverge.com/2022/2/8/22923480/peloton-severance-package-membership-layoffs",
  "date": "2022-02-08T17:01:56.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Peloton Pauses Production Of Its Bike As Demand Decreases\" src=\"https://cdn.vox-cdn.com/thumbor/vKR6RKu6vOMEr4P5kbAxDvNHoSs=/71x0:2930x1906/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70484263/1365914829.0.jpg\" />        <figcaption><em>Peloton laid off 2,800 people on February 8th.</em> | Photo by Joe Raedle / Getty Images</figcaption>    </figure>  <p id=\"qE2svB\">As Peloton announced it was <a href=\"https://www.theverge.com/2022/2/8/22923229/peloton-layoff-new-ceo-mccarthy\">firing 2,800 people Tuesday morning</a>, its outgoing CEO outlined in a memo the “meaningful” severance package those who are losing their jobs will receive, and great news: it includes a complimentary Peloton membership for the next year. Because really, getting a shoutout from an instructor or showing up on the leaderboard during that brutal HIIT class provided by your former employer is sure to take the sting out of losing your job.</p><p id=\"Z5gw8G\">The <a href=\"https://www.onepeloton.com/press/articles/a-message-from-john-foley\">memo from John Foley</a> (who is losing the CEO job but will stay on as executive chairman) said Peloton saw “unprecedented demand” during the pandemic, but the company’s “post-COVID demand picture looks different than anticipated,” so it is slashing thousands of jobs (which <a href=\"https://www.wsj.com/articles/peloton-ceo-john-foley-to-step-down-become-executive-chair-11644314403?mod=hp_lead_pos2\">reportedly doesn’t include</a> any of its class instructors). </p><aside id=\"objaLw\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"CPSC urges people with children at home to stop using Peloton Tread Plus treadmill ‘immediately’\",\"url\":\"https://www.theverge.com/2021/4/17/22389301/cpsc-treadmill-peloton-children-risk-injury\"}]}'></div></aside><p id=\"HhFoU4\">Under a section in the goodbye memo titled “Taking care of our team,” Foley said the company was “equipping every team member leaving Peloton with helpful tools to make them as comfortable as possible as they explore their career path post-Peloton,” as if the fired people are just going on a long trip and need snacks or a neck pillow.</p><p id=\"5x2tMl\">In addition to offering career services and extending equity vesting periods through the end of the month, Peloton is giving those leaving the company a “meaningful cash severance allotment” and having their healthcare benefits extended “for a period of time” that was not specified. And: “The monthly Peloton membership will be complimentary for impacted team members for an additional 12 months.” </p><aside id=\"Hvhnza\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Amazon named as possible Peloton buyer in a suspiciously well-timed rumor\",\"url\":\"https://www.theverge.com/2022/2/4/22918596/peloton-amazon-acquisition-rumor-fitness-bike-wearables\"}]}'></div></aside><p id=\"dMdMa5\">There was no word from Foley in the memo about what might happen to these free former employee memberships if Peloton is bought by a larger company. Last week, the rumor mill was hot with speculation that Amazon or Nike might be among the bidders. It’s up for debate whether that’s based in reality, but Peloton could use a wealthy suitor; the company said Tuesday that it had a <a href=\"https://www.cnbc.com/2022/02/08/peloton-slashes-full-year-revenue-outlook-to-3point7-billion-to-3point8-billion-from-4point4-billion-to-4point8-billion.html\">net loss of $439.4 million</a> in its fourth quarter. </p><p id=\"sJOr0z\">“We are taking steps to best position Peloton for sustainable growth, while also establishing a clear path to consistent profitability,” Foley wrote in a letter to shareholders. (<em>Except for you, 2,800 people they just fired, you can just sweat it out. Literally.</em>)</p><p id=\"1Jq3r3\">It’s not all that surprising that Foley and Peloton handled the employee firings in such a stunningly out-of-touch way. This is, after all, the company that, last spring, <a href=\"https://www.theverge.com/2021/4/16/22388707/peloton-fighting-recall-treadmill-child-death\">fought a request</a> from the Consumer Product Safety Commission (CPSC) to recall its Tread Plus treadmill, which was <a href=\"https://www.theverge.com/2021/3/18/22338287/peloton-ceo-accident-treadmill-child-death-safety\">involved in the death of a child</a>. </p><p id=\"PYzXYU\">While you don’t need a Peloton bike to subscribe to its classes, Foley’s memo suggests that the fired employees may have access to Peloton workout equipment? It’s worth noting that its most expensive <a href=\"https://www.onepeloton.com/shop/bike-plus\">bikes go for around $3,000</a> and its all-access membership costs $39 / month or about $468 / year. Seems like selling your Peloton bike is worth more — their aftermarket value on eBay looks to be around $800 to $1,000 — than awkward interactions with former coworkers in spin classes. You don’t <em>need</em> them to work on your revenge bod, former employees, but Peloton has certainly provided some excellent motivation.</p><p id=\"jbW4io\"></p><p id=\"2KdpIY\"></p><p id=\"uw00WN\"> </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6o0FexhO4G1qGBnGeAwLurrc_qI=/0x168:3000x1739/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23226455/1365914829.jpg",
  "description": "The CEO stepped down Tuesday as well.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}