{
  "title": "Performance art is horror in Crimes of the Future’s first trailer",
  "url": "https://www.theverge.com/23025028/crimes-of-the-future-trailer",
  "date": "2022-04-14T14:43:48.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u1WoaMGKW0Z5u9iUwlB5yK6SNa4=/105x0:1919x1209/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70748535/crimesofthefuture_courtestyofneon_1649932802122.0.jpeg\" />    </figure>  <p id=\"3ZrtfW\">Though director <a href=\"https://www.theverge.com/2015/2/24/8097855/david-cronenberg-interview-maps-to-the-stars-hollywood\">David Cronenberg</a> is capable of inhabiting a number of artistic modes as a storyteller, his deft command of body horrors like Neon’s upcoming <em>Crimes of the Future</em> is what he’ll always be known for, and with good reason. Hard as it’s been to believe some of the <a href=\"https://bloody-disgusting.com/movie/3710308/crimes-of-the-future-first-reaction-to-david-cronenbergs-new-movie-promises-something-special/\">early buzz</a> about <em>Crimes of the Future</em> being a controversial feature that’s going to polarize audiences, the movie’s first teaser trailer and some new details suggest that the hype might be warranted.</p><p id=\"Bm0XoP\"><em>Crimes of the Future </em>tells the story of Caprice (Léa Seydoux) and her partner Saul Tenser (Viggo Mortensen), a performance artist who’s made a name for himself with his avant-garde projects like his latest: a showcase of his organs going through a metamorphosis. While the future Caprice and Saul live in is one where humanity’s become accustomed to body modification, his art brings him to the attention of National Organ Registry investigator Timlin (Kristen Stewart), just as Saul becomes the target of a cult-like group.</p><p id=\"7aq9ah\"><em>Crimes of the Future </em>will debut at Cannes prior to releasing in the US sometime in June.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/htjYTDdb7b8JK9H4E8QVmQT5m3U=/0x76:2023x1135/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23389217/crimesofthefuture_courtestyofneon_1649932802122.jpeg",
  "description": "Crimes of the Future turns horror into performance art in first teaser.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}