{
  "title": "Peter Thiel is stepping down from Meta’s board",
  "url": "https://www.theverge.com/2022/2/7/22922425/peter-thiel-retiring-meta-facebook-board-directors",
  "date": "2022-02-07T21:45:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"Peter Thiel Visits “FOX &amp;amp; Friends”\" src=\"https://cdn.vox-cdn.com/thumbor/Ap22ghhET564Yhg5UOzR_qy7Fa0=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70481468/1167010564.0.jpg\" />        <figcaption>Photo by John Lamparski/Getty Images</figcaption>    </figure>  <p id=\"ioGIxD\">Venture capitalist Peter Thiel is stepping down from his long-standing role on Meta’s (formerly Facebook’s) board of directors. <a href=\"https://www.nytimes.com/2022/02/07/technology/peter-thiel-facebook.html\"><em>The New York Times</em> reported the news</a> on Monday, and Meta <a href=\"https://investor.fb.com/investor-news/press-release-details/2022/Peter-Thiel-to-Retire-from-Meta-Board-of-Directors-at-2022-Annual-Shareholder-Meeting/default.aspx\">confirmed it in a press release</a>, saying Thiel would continue to serve until the company’s annual stockholder meeting.</p><p id=\"GWNIOg\">The <em>Times</em> cites an unnamed source who says Thiel is retiring in order to focus on November’s US midterm elections. Thiel didn’t elaborate on his reasons for leaving in an official statement, nor did Meta CEO Mark Zuckerberg. “Peter has been a valuable member of our board and I’m deeply grateful for everything he has done for our company,” said Zuckerberg. “Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions. He has served on our board for almost two decades, and we’ve always known that at some point he would devote his time to other interests.”</p><p id=\"0wancH\">Thiel was an early investor in Facebook alongside many other tech companies, and he joined the company’s board of directors in 2005. But in recent years, he’s become better known for his conservative political advocacy. After publicly supporting former President Donald Trump’s campaign in 2016, Thiel has more quietly donated to Republican candidates that include Kris Kobach (who <a href=\"https://www.theverge.com/2020/8/4/21352787/kris-kobach-loss-kansas-primary-peter-thiel-backing-roger-marshall-immigration\">lost a Kansas Senate seat election</a> despite Thiel’s backing), <em>Hillbilly Elegy </em>author J.D. Vance, and <a href=\"https://www.theverge.com/2021/7/12/22574232/blake-masters-peter-thiel-arizona-senate-campaign-anduril-capital\">his former business associate</a> Blake Masters. Zuckerberg has previously resisted calls to cut ties with Thiel and has defended his presence on the board — something that <a href=\"https://www.theverge.com/2016/10/19/13334608/mark-zuckerberg-peter-thiel-donald-trump\">became particularly controversial</a> after Thiel threw his weight behind Trump.</p><p id=\"YECNOp\">Thiel’s departure comes shortly after Meta announced disappointing quarterly financial results, including the first-ever loss of Facebook daily active users, and <a href=\"https://www.theverge.com/2022/2/3/22916007/facebook-meta-stock-drop-history-invest\">suffered a 25 percent market value drop</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tk4HCEkbIu_1feaCZkqtCOTICe8=/0x252:6000x3393/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23224631/1167010564.jpg",
  "description": "He’s served on the board since 2005.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}