{
  "title": "Pete Davidson won’t actually be going to space on the next Blue Origin flight",
  "url": "https://www.theverge.com/2022/3/18/22984441/blue-origin-space-pete-davidson-new-shepard",
  "date": "2022-03-18T09:10:37.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"Saturday Night Live - Season 46\" src=\"https://cdn.vox-cdn.com/thumbor/HYjnAuo2Q_5tDNLXkhkTjMJK2cY=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70639695/1232777398.0.jpg\" />        <figcaption><em>Pete Davidson playing Chad as an astronaut on SNL.</em> | Photo By: Kyle Dubiel/NBC/NBCU Photo Bank via Getty Images</figcaption>    </figure>  <p id=\"YHZOkn\">Saturday Night Live star Pete Davidson is no longer scheduled to fly on Blue Origin’s space flight later this month, the <a href=\"https://twitter.com/blueorigin/status/1504652822117163013\">space tourism venture has announced</a>. No reason was given for Davidson’s departure, only that the date of the launch has shifted from its original March 23rd date. </p><p id=\"YnUrxC\">“Blue Origin’s 20th flight of New Shepard has shifted to Tuesday, March 29. Pete Davidson is no longer able to join the NS-20 crew on this mission,” Blue Origin spokesperson Sara Blask said in a statement. </p><p id=\"Lkt3BY\">Davidson was scheduled to be an “honorary guest” (an inclusion designed to build hype) alongside five paying customers on Blue Origin’s fourth crewed flight. Previous guests have included <a href=\"https://www.theverge.com/2021/10/13/22724058/blue-origin-william-shatner-new-shepard-flight-success\">Star Trek actor William Shatner</a>, GMA anchor and former football star Michael Strahan, female aviator Wally Funk, and Blue Origin founder Jeff Bezos himself. Blue Origin said it will announce the new sixth crew member “in the coming days.”</p><div id=\"4mdV4r\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Blue Origin's 20th flight of New Shepard has shifted to Tuesday, March 29. Pete Davidson is no longer able to join the NS-20 crew on this mission. We will announce the sixth crew member in the coming days.</p>— Blue Origin (@blueorigin) <a href=\"https://twitter.com/blueorigin/status/1504652822117163013?ref_src=twsrc%5Etfw\">March 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"EBaGpm\">Blue Origin flights send crews over 60 miles above the surface of the earth on the company’s New Shepard rocket. Participants experience a few minutes of weightlessness before parachuting back down to earth, in a ride that lasts roughly 10 minutes. The rocket is designed to land upright on a landing pad using its engine, while the capsule containing its crew returns to the surface under parachutes. </p><p id=\"iDRgU2\">Davidson has previously played an astronaut on SNL, when his Chad character <a href=\"https://www.youtube.com/watch?v=FuaDWyCnJxs\">went to Mars on a SpaceX mission</a> during a show hosted by Elon Musk. For now, it looks like Davidson’s space antics will continue to be tethered to comedy skits. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LDMtJokBmEfxXpMX8LWajK_zJCs=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23326449/1232777398.jpg",
  "description": "A new sixth passenger is yet to be announced.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}