{
  "title": "Pixar’s Lightyear is going to be about traveling through time as well as space",
  "url": "https://www.theverge.com/2022/4/21/23035508/pixar-lightyear-time-travel-trailer",
  "date": "2022-04-21T15:51:36.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/p1I8gfr5b9D-x0RpOs_GfJOZOJI=/1142x0:5002x2573/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70776374/HSK_104_14836_R.0.jpeg\" />        <figcaption>Pixar/Disney</figcaption>    </figure>  <p id=\"FYcgEM\">Pixar and Disney’s upcoming <a href=\"https://www.theverge.com/2021/10/27/22748435/lightyear-trailer-disney-pixar-chris-evans\"><em>Lightyear</em></a><em> </em>feature has already thrown people with the idea of it <a href=\"https://www.theverge.com/2021/10/27/22748435/lightyear-trailer-disney-pixar-chris-evans\">being an origin story</a> about the “real” space ranger <em>Toy Story</em>’s Buzz Lightyear is apparently based on. That aspect of the feature immediately raised questions about whether <em>Toy Story</em>’s been set in some sort futuristic universe this whole time without acknowledging it, or if the studios were dancing around <em>Lightyear </em>actually being an in-universe movie about Buzz.</p><p id=\"UBbbar\"><em>Lightyear’s </em>latest trailer doesn’t clarify if either of those situations are the case, but it does lay out the broad strokes of the movie’s plot and reveal yet another interesting twist to its story. In the new trailer, Buzz (Chris Evans) along with his earthbound partner Alisha Hawthorne (Uzo Aduba) are finally prepping for a launch involving one of Star Command’s first gates seemingly designed to facilitate long distance. Though Buzz’s solo flight through the gate at first seems to be a near success, when he touches down on what seems to be an unfamiliar planet, his robot cat assistant Sox (Peter Sohn) informs him that he’s somehow journeyed decades into the future. While one of the first faces Buzz sees in the future is a friendly one who he mistakes for Alisha, Izzy (Keke Palmer) informs him that Alisha was her grandmother, and it quickly becomes clear that Buzz has wandered much, much farther than anyone intended.</p><p id=\"TXvrCq\"><em>Lightyear</em> hits theaters on June 17th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RsVRPeoG3cn4kBkT9ZdH2987aJA=/615x0:5529x2573/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23406211/HSK_104_14836_R.jpeg",
  "description": "Pixar’s Lightyear movie just got even more peculiar",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}