{
  "title": "Pixar’s Turning Red captures the wonder and horror of being a teen in 2002",
  "url": "https://www.theverge.com/2022/3/7/22961455/turning-red-pixar-review",
  "date": "2022-03-07T14:03:34.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Meilin in her panda form, shocked to realize that she’s become a panda.\" src=\"https://cdn.vox-cdn.com/thumbor/XJqEJFn2cfF7u0kdmTcRHJ0bGzA=/0x179:4062x2887/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70588555/Turning_Red_OOH_Expres_281_Surprised_MASTER_v3.0_Mech1_FS.0.jpg\" />        <figcaption>Meilin in her panda form. | Pixar</figcaption>    </figure>  <p>Pixar’s latest feature is another stunner</p> <p class=\"p--has-dropcap\" id=\"AkIydh\">Pixar’s <em>Turning Red, </em>from director Domee Shi, may be Disney’s latest animated feature aimed at kids. But any adult over the age of 30 or so needs to understand that the movie is also a kind of one-way time machine back to the halcyon days of 2002 when burning CDs was the easiest way to share music with your best friends. Though <em>Turning Red</em>’s rooted in a moment from our past, its story about a young girl trying to break free of her lovingly-overbearing family is both timeless and a surprising testament to its studio growing up in some very important ways.</p><p id=\"HjP29j\"><em>Turning Red’</em>s central character Meilin Lee (Rosalie Chiang) is the sort of 13-year-old girl that most parents of grade eights (the movie is unabashedly Canadian to wonderful effect) dream of. Meilin stays on top of her grades, dives into extracurricular activities, loves her trio of BFFs, and has nothing but the utmost respect for her laidback father, Jin (Orion Lee) and her somewhat domineering mother, Ming (Sandra Oh). Meilin’s more than accustomed to juggling her responsibilities and meeting her parents’ expectations, but after years of playing the role of an extremely dutiful daughter, she reaches her breaking point when Ming humiliates her so thoroughly that it almost feels like mother is trying to destroy her social life. But just as Meilin resigns herself to a death by way of embarrassment, life throws her for a loop when she spontaneously transforms into a massive red panda in an explosion of pink smoke — a magical power that acts as a defense mechanism throughout the movie.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DEBzTSQDUXz0AOT4IhGGwUzvhAw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23290090/T_RED_ONLINE_USE_r345_211j_pub.pub16n.1328.jpg\">      <cite>Image: Pixar Animation Studios</cite>  </figure></div><p id=\"smXgcl\">Compared to some of Pixar’s other films about people fighting for their lives or trying to save their worlds from destruction, <em>Turning Red</em>’s story’s far more intimate and grounded as it follows Meilin on her journey to figure out what her panda form is and how to control it. Obviously, Meilin’s whole turning into a panda thing is a concern and something that she fights to keep secret from her friends Miriam (Ava Morse), Priya (Maitreyi Ramakrishnan), and Abby (Hyein Park). But between Meilin also starting to realize that crushes on boys are going to be a thing for her, and learning that her all-time favorite boy band 4*Town are on their way to Toronto, her panda’s just one of the many things on her plate, and not always the one that’s at the front of her mind.</p><div class=\"c-float-right c-float-hang\"><aside id=\"xNFT8h\"><q>Meilin’s panda is just one of the many things on her plate</q></aside></div><p id=\"yXFtDT\">What jumps out most immediately about <em>Turning Red </em>in its first few scenes is how refreshingly comfortable the movie is shifting between aesthetic modes for comedic effect. Though <em>Turning Red</em> generally looks and feels like a bright and busy Pixar feature, the movie’s peppered with beats and gags more commonly found in two-dimensional anime and manga that all speak to Meilin’s own sensibilities as a budding artist. </p><p id=\"ivNEJ9\">Of the many challenges Meilin faces, her mother’s inability to recognize the things that fulfill her emotionally is the biggest, and what <em>Turning Red</em>’s most interested in exploring. <em>Turning Red</em>’s magical elements are important to its story, but they’re secondary to its focus on how stifling and oppressive a parent’s love for their child can become when it’s only expressed through control and a desire to shelter them from the outside world. </p><div class=\"c-wide-block\"><div id=\"KgNJnv\"><div ><iframe src=\"https://www.youtube.com/embed/mLsUEJPXubc?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"jotbIP\">Main character though Meilin may be, Oh frequently luxuriates in the spotlight with a performance that will alarm anyone who’s ever wanted to vanish while watching their parents cause a scene in public. Chiang’s Meilin is very much your prototypical Pixar protagonist, but what makes her feel like such a breath of fresh air coming from the studio is the way <em>Turning Red </em>acknowledges and has fun with a number of the specific realities of being a hormonal teenager. </p><p id=\"bPYZE7\">In the same way that turning into a humongous panda becomes Meilin’s own personal hell, the prospect of breathing the same air as 4*Town’s five members — Robaire (Jordan Fisher), Aaron Z. (Josh Levi), Aaron T. (Topher Ngo), Jesse (Finneas O’Connell), and Tae Young (Grayson Villanueva) — is her and her friends’ idea of heaven. The movie’s handful of jokes about the girls’ obsession with boys work to remind you that <em>Turning Red </em>is a coming-of-age story about a young girl discovering what kind of person she’s growing up to become. But <em>Turning Red </em>also takes a somewhat more serious, though still lighthearted, turn in its third act with a series of plot points that put an interesting twist on the all-too-common experience of children being ostracized for bringing their “ethnic” cultures to school.</p><p class=\"c-end-para\" id=\"P8eEnQ\">Though it would be more than fair to count <em>Turning Red </em>among the growing number of children’s movies like <em>Encanto </em>broaching the concept of generational trauma, it feels distinct in that the trauma at hand isn’t exactly <em>the </em>point of the movie. It’s just one element of Meilin’s magically complicated life. It’s a life that, among other things, involves her emotions becoming so powerful that they give rise to a new physical form, an idea that becomes increasingly relatable the more you let the movie and its unfortunately addictive soundtrack wash over you.</p><p id=\"b70oHV\"><small><em>Turning Red </em></small><small>also stars Wai Ching Ho, Tristan Allerick Chen, and Addison Chandler. The movie begins streaming on Disney+ on March 11th.</small></p><h1 id=\"1xIDHK\"></h1><p id=\"8ctyQH\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zS5dGi9qnu0fnL35Iz0ChsHKkco=/0x470:4062x2597/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23287913/Turning_Red_OOH_Expres_281_Surprised_MASTER_v3.0_Mech1_FS.jpg",
  "description": "Director Domee Shi’s Turning Red will take you back to 2002",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}