{
  "title": "Playdate review: all it’s cranked up to be",
  "url": "https://www.theverge.com/23025390/playdate-handheld-portable-gaming-console-review",
  "date": "2022-04-18T17:00:00.000Z",
  "author": "Andrew Webster",
  "content": "  <p>Little, yellow, different</p> <p class=\"p--has-dropcap\" id=\"LCQUOx\">Portable gaming has always been a little, let’s say, different. While there have been some attempts at shrinking console gaming down into something that will fit in your hands, <a href=\"https://www.theverge.com/21441254/nintendo-ds-3ds-discontinued-eulogy\">many of the best handheld experiences have been downright weird</a>. Think of the Nintendo DS with its dual screens that helped inspire memorable games about walking dogs, doing surgery, and, well, whatever is going on in <em>Electroplankton</em>. There’s something about the smaller scale of these games that often invites creativity from developers.</p><p id=\"9riLMI\">The Playdate, from first-time hardware maker Panic — best known for its Mac software and publishing games like <a href=\"https://www.theverge.com/2016/2/8/10922560/firewatch-review-ps4-pc\"><em>Firewatch</em></a> and <a href=\"https://www.theverge.com/2019/9/20/20868532/untitled-goose-game-review-nintendo-switch-pc-house-panic\"><em>Untitled Goose Game</em></a> — takes this idea to the extreme. It’s a tiny yellow square, not much bigger than a credit card, with a black-and-white screen and a crank that juts out of its side. <a href=\"https://www.theverge.com/22587172/playdate-hands-on-preview\">It looks like a Game Boy from a parallel world</a>. And, much like with the DS and its contemporaries, those limitations and distinct features have inspired a library of games unlike anything I’ve ever played: everything from a strategy game about cryptid photography and a turn-based samurai adventure to a role-playing game where all you do is manage inventory.</p><p id=\"4J7lgL\">And, just like with the DS, the best games are ones I couldn’t imagine existing anywhere else.</p><div id=\"jKpkRn\"><div data-anthem-component=\"scorecard:11148874\"></div></div><p id=\"fvn8n0\">First, the basics. The Playdate measures in at a scant 76 × 74 × 9mm, a square about the size of a modern smartphone cut in half. It’s probably the cutest dedicated handheld since <a href=\"https://www.theverge.com/2012/10/26/3494628/status-symbols-game-boy-micro\">the Game Boy Micro</a>. About half of that space is taken up by a 400 x 240, 1-bit display capable of outputting visuals in glorious black and white. There is no backlight. Below the screen are a nice, clicky D-pad and two face buttons; a home button rests beside the display. Along the top edge is a sleep button, and the bottom has a USB-C port and headphone jack. The body is a bright yellow plastic with a nice matte texture. Inside, there’s a battery that, in my experience, gets about eight hours of playtime on a single charge. (The Playdate comes with a USB-C cable, but you have to provide your own wall charger.)</p><p id=\"SSedXH\">Oh yeah, and then there’s a crank on the side of it. It’s a little silver protrusion, about an inch long, that folds into the device when not in use. Basically, it’s another control option that can be used for, well, a variety of things depending on the game. Some use it to scroll through text; others make it a way to control things like spaceships or surfboards. One game utilizes the crank so you can stir up magical potions. It’s not a requirement for Playdate games, which is nice, but it does add something distinct to those that use it.</p><p id=\"YE7rPP\">Overall, aside from the slightly flimsy handle on the crank, it’s a solid, well-made device. (For those curious, the hardware remains the same as it was <a href=\"https://www.theverge.com/22587172/playdate-hands-on-preview\">when I previewed the Playdate last year</a>.) My only real complaint is the lack of a backlight. While it’s nowhere near as bad as, say, the original Game Boy Advance, the Playdate does require decent lighting to play games comfortably. There are a handful of titles that I would’ve loved to play before bed, but it just doesn’t work with the dim display.</p><p id=\"5FHU5x\">The flip side is that, unlike many modern devices, the Playdate works extremely well in bright sunlight. Despite the seemingly low-fi nature of the device, games look crisp and clean, and developers have managed to cram some beautiful visuals onto it — from big, detailed character portraits to dense-but-readable interfaces.</p><div class=\"c-float-right c-float-hang\"><div id=\"N4dEMG\"><div data-anthem-component=\"aside:11144025\"></div></div></div><p id=\"8psYTy\">When it’s asleep, the Playdate displays a simple clock, and you wake it up by pressing the top button twice. The handheld’s interface is simple — it’s mostly just a list of your games along with a settings option — but there’s a certain playfulness to it. You can scroll through a list of big, animated icons using the crank or D-pad, and adjusting the volume sounds like playing a xylophone. The wake-up animation looks like two eyes opening as you press the unlock button. It’s straightforward, which makes sense because this thing is designed to do one thing: play games. And finding what you want to play is incredibly fast and simple.</p><p id=\"dlf4u9\">Outside of its unique look and crank, the Playdate is also notable for how you get access to games. Everyone who buys the handheld will automatically get a season of games, which release over time. (Right now it’s not clear if subsequent seasons will happen.) As soon as you boot up your device and connect it to Wi-Fi, season 1 will begin, and you’ll have two games automatically downloaded to the device every week for 12 weeks.</p><p id=\"JFIx8T\">That’s a total of 24 games, and Panic has pulled in some notable developers to craft the initial batch, including <a href=\"https://www.theverge.com/2019/12/17/21025916/keita-takahashi-interview-wattam-katamari\"><em>Katamari</em> creator Keita Takahashi</a> and Bennett Foddy, the mind behind the infamous <em>QWOP</em>. When new games are delivered, a white light flashes on the top of the Playdate, and you have to virtually unwrap the icon before you play it. (It’s a bit like digital games on the 3DS but more extravagant). It should also be noted that the games are tiny. The biggest one I have installed right now is just under 160MB, so it’ll likely be a long time before the handheld’s 4GB of storage is anywhere near full.</p><p id=\"nWPaRv\">For the purposes of this review, I wasn’t able to experience the prolonged 12-week rollout. Instead, I had two games delivered every day. This meant that I haven’t been able to spend as much time with these games as I would’ve liked. But even still, I’ve been impressed by the breadth of experiences available. Here, in no particular order, are the 10 games that have stuck with me the most so far.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/a5AGqa6TNhZM4YxaeFLOuO0BqyY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23396647/vpavic_220415_5149_0080.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption>The title screen for Playdate game <em>Lost Your Marbles</em>.</figcaption>  </figure><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kOCl7TigKpLq8eMyEMvIqrhlYrI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23396646/vpavic_220415_5149_0074.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption>A Playdate laying on top of an iPhone 13 Pro Max.</figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8rxc9ZOICyVKHnHEhiumZgC38rk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23396648/vpavic_220415_5149_0088.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption>A closer look at the Playdate’s crank.</figcaption>  </figure></div></div></div><hr class=\"p-entry-hr\" id=\"Jpeh4k\"><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Inventory Hero, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/L8nVqzQG423oeCDn9pxhaWu92gU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389880/inventory_hero_still_1.png\">      <figcaption><em>Inventory Hero.</em></figcaption>  </figure></div><h3 id=\"0tX8H3\"><em>Inventory Hero</em></h3><h4 id=\"w668es\">By James Moore, Neven Mrgan, Steven Frank, Jesus Diaz, and Aaron Bell</h4><p id=\"2VmjZ9\"><em>Inventory Hero</em> is a bit like an idle RPG, the kind where your character acts on their own. But it’s a lot more frantic. Your hero character runs through the fantasy world of their own accord, slicing up foes, and your only job is managing their inventory as loot comes flying out of bad guys. It sounds simple but there are limited slots and items are tossed at you constantly. You’ll need to keep the hero’s health topped up with potions, constantly replace their damaged armor and weapons, and toss out junk to keep slots open for good gear and items. (Sometimes a bunny will show up in your inventory and just keep breeding until all the slots are full.) It’s a fun twist on a well-worn genre and an ideal portable game for when you only have a few minutes to play.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Sasquatchers, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Nkh_CLZo0YpJRN894RF_SgMNskU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389881/Sasquatchers_POV.png\">      <figcaption><em>Sasquatchers.</em></figcaption>  </figure></div><h3 id=\"CGbYsg\"><em>Sasquatchers</em></h3><h4 id=\"jZSgM1\">By Chuck Jordan and Jared Emerson-Johnson</h4><p id=\"Q0raQG\">Imagine <em>Advance Wars</em>, only instead of an army, you’re controlling a squad of monster-hunting influencers. <em>Sasquatchers</em> is a turn-based game where the goal isn’t to defeat the cryptids lurking around but instead take the perfect photo or video of them. There are units with different skills — the host who can take great selfies, the wrangler who can calm down Bigfoot, and more — and you have to manage your health and battery life while exploring dark, dangerous forests. The goal is to take photos that get lots of likes and views, which earn you money, opening up new units and maps. My favorite part is how <em>Sasquatchers</em> uses the crank: it serves as your camera, so you have to turn it around to nail the picture or video you’re attempting. It’s very satisfying.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Snak, Playate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uDI9mTmEBf2axoWvTXh7B7Mrfz4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389884/Snak_Screenshot.png\">      <figcaption><em>Snak.</em></figcaption>  </figure></div><h3 id=\"AuujHh\"><em>Snak</em></h3><h4 id=\"OJYHrl\">By Zach Gage and Neven Mrgan</h4><p id=\"nUMuSK\">Zach Gage is best known for reinventing classic games ranging from <a href=\"https://www.theverge.com/2016/10/13/13262994/really-bad-chess-zach-gage-iphone-ipad\">chess</a> to <a href=\"https://www.theverge.com/21334116/good-sudoku-iphone-ipad-app-game-zach-gage\">sudoku</a>. On the Playdate, he does the same for <em>Snake</em>. It works a lot like it did on your old Nokia: you control a snake as it twists around a rectangular level, trying not to crash into a wall or your own overlong body. But there are a few twists. In <em>Snak</em> you can jump over your own body, and you earn points by eating apples that float into the level. It’s familiar but <em>just</em> different enough to feel fresh, and there are multiple difficulty levels that increase the speed dramatically for an extra challenge. <em>Snak</em> doesn’t use the crank at all, but it fits the Playdate’s retro aesthetic very well.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Saturday Edition, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zImoOXQu72Ld0udnD-cavftGtBw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389886/sat_edition_1.png\">      <figcaption><em>Saturday Edition.</em></figcaption>  </figure></div><h3 id=\"AcBEis\"><em>Saturday Edition</em></h3><h4 id=\"Rc8V0D\">By Chris Makris, Gord McGladdery, and Alfonso Salinas</h4><p id=\"FWfiml\"><em>Saturday Edition</em> is, essentially, a tiny LucasArts adventure game crammed onto the Playdate’s miniature screen. You play as a man roped into a strange mystery involving dozens of missing people, and, just like in classic point-and-click adventure games, you do that by talking to lots of characters and collecting items to solve puzzles. It’s all fairly straightforward here — don’t expect any of the obscure, frustrating logic puzzles the genre is known for — but I’ve mostly been surprised by how comfortable it’s been to sit back and enjoy a game that’s almost entirely reading on such a small screen.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Questy Chess, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qUlF9i-3i8xQlm0d8nBYpIbrWfc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389904/Questy_Chess_Gameplay.png\">      <figcaption><em>Questy Chess.</em></figcaption>  </figure></div><h3 id=\"pr1P0v\"><em>Questy Chess</em></h3><h4 id=\"2ZH0Du\">By Dadako</h4><p id=\"OZdCxq\">This is a game about exploring strange places while (mostly) following the rules of chess. You start as a pawn, moving through a grid-based world that’s like a chessboard that’s been hacked. Initially, you can move one space forward at a time and only diagonally to knock enemies off the board, just like a pawn. From there, there are interesting twists, like treasure chests to refill your health or unlock new pieces (e.g., the knight) to play as for new movement options. On occasion, you’ll need to use the crank to move tiles around in order to proceed. Each level is a short, self-contained puzzle, and the game is rendered with a cryptic tone that makes it feel like you’re inside an old, broken computer.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Omaze, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IoHq2G2lFOQE0NQoeIo2CcNmico=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389908/Omaze___screenshot_2.png\">      <figcaption><em>Omaze.</em></figcaption>  </figure></div><h3 id=\"krNmfv\"><em>Omaze</em></h3><h4 id=\"o3qTdH\">By Gregory Kogos</h4><p id=\"EIuJe8\">If you ever played the excellent and stylish Bit Generations line of games from Nintendo, <em>Omaze</em> will feel familiar. It’s a seemingly basic puzzle game where you rotate a dot around the inside of a maze made up of connected spheres. It makes great use of the crank, which you use to control the dot, and it steadily throws in new concepts — like enemy dots and reversed movement — to keep things interesting. Like the best puzzle games, <em>Omaze</em> is a straightforward concept executed extremely well. And its minimalist visuals mean that it not only looks great but also is always clear about what you need to do.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Zipper, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AuLPGD-IffkqCcpDVl4jDRZJhG4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390047/Zipper_Screen.png\">      <figcaption><em>Zipper.</em></figcaption>  </figure></div><h3 id=\"oCLWJF\"><em>Zipper</em></h3><h4 id=\"cQJbWp\">By Bennett Foddy</h4><p id=\"QHb5VW\"><em>Zipper</em> combines the challenge of a turn-based strategy game with the tone of a classic samurai film. You control a samurai fighting their way through a series of rooms and gardens filled with guards. The title comes from how you move; your little samurai can zip across a grid, slashing any enemies it passes along the way. After you move, the guards act, and the challenge lies in strategically planning your movements so that you can eliminate your enemies without giving them the opportunity to strike. It’s also extremely hard thanks to its one-hit deaths: a single mistake and you have to restart the entire game.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Crankin’s Time Travel Adventure, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/P6dQ3BzL3cm1L3ckLnPgEYgH878=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390049/Crankin_2.png\">      <figcaption><em>Crankin’s Time Travel Adventure.</em></figcaption>  </figure></div><h3 id=\"MMndKt\"><em>Crankin’s Time Travel Adventure</em></h3><h4 id=\"Ix7BJQ\">By Keita Takahashi, Ryan Mohler, Matthew Grimm, and Shaun Inman</h4><p id=\"iv7sAQ\"><em>Crankin’s Time Travel Adventure</em> is probably the closest the Playdate has to a showcase game. It’s created by a big name — Keita Takahashi is best known for the seminal <em>Katamari Damacy</em> — and it’s a game built entirely around the crank. The premise is simple: Crankin is late for a date, and he keeps running into obstacles on his way there. These range from surprisingly strong butterflies to hordes of rushing pigs. In order to avoid these, you utilize the crank to control time, fast-forwarding or reversing to move Crankin away from danger. For instance, he always stops to smell flowers, so you can avoid flying enemies by moving him to a flower bed. It’s quirky and fun, and a game that definitely wouldn’t exist on any other platform.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Casual Birder, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BSJAcxBs2q__bknOMTVDYeesHkU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390066/Casual_Birder_Screen_2.png\">      <figcaption><em>Casual Birder.</em></figcaption>  </figure></div><h3 id=\"EilDt8\"><em>Casual Birder</em></h3><h4 id=\"rEHqUC\">By Diego Garcia and Max Coburn</h4><p id=\"F7qm3i\"><em>Casual Birder</em> is kind of like <em>Pokémon</em> meets… <em>Pokémon Snap</em>. It looks like a 16-bit RPG, but there are no battles or epic quests. Instead, you’re the new resident in a small town obsessed with birding, and your goal is to snap a photo of every kind of bird around. You do this by collecting info from local haunts like the café and pool hall, gathering useful items like worms, and listening for the screech or song of nearby creatures. Once you find a bird, you pull out your camera and utilize the crank to focus the picture for the perfect shot. It’s a breezy little adventure, with some <em>Earthbound</em>-esque silly writing and a copious amount of bird puns.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Star Sled, Playdate\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gjRZwJPojZgw1nvu5iy7RUmQff4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390068/6.png\">      <figcaption><em>Star Sled.</em></figcaption>  </figure></div><h3 id=\"VlIjc6\"><em>Star Sled</em></h3><h4 id=\"2eXtz8\">By Greg Maletic, Jesus Diaz, and Aaron Bell</h4><p id=\"ZWDczu\">My favorite use of the crank might just be <em>Star Sled</em>, an arcade-style, top-down spaceship game. Instead of shooting swarms of aliens, your goal is to lasso stars by quickly flying around them. It took some getting used to. (I probably played through the tutorial level a dozen times.) But once I got the handle on using the crank to pilot the ship, it felt incredible. It’s really satisfying making a daring hairpin turn while a drone tries to attack you and you narrowly avoid a dangerous cluster of floating space wreckage. It’s all the more gratifying because one hit — whether you crash into a star, enemy, or some space junk — means instant death.</p><hr class=\"p-entry-hr\" id=\"hwM8wZ\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q952IhxKdPu9ciqeRprj65YypxQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23396644/vpavic_220415_5149_0055.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption>The Playdate’s screen turns into a clock when in sleep mode.</figcaption>  </figure></div><p id=\"eE1C6A\">What’s on offer in the initial batch of games is great, aside from a few clunkers. (There’s a surfing game that I just can’t seem to figure out the controls for.) And even if Panic doesn’t end up commissioning a second season, there’s still a chance the device will have a decently long life through sideloading. Panic has made it fairly easy for developers to make their own games <a href=\"https://www.theverge.com/2022/1/19/22892269/panic-playdate-pulp-in-browser-game-builder-available-now-public-beta\">through its Pulp tool</a> and SDK, and getting those games onto your device is similarly straightforward. You can either log on to the Playdate website and upload the file to your device wirelessly or transfer the game via USB after connecting the Playdate to your computer.</p><p id=\"OZlx9t\">I used the wireless method to add <a href=\"https://rngpartygames.itch.io/bloom\"><em>Bloom</em></a> — a charming flower shop simulator developed by RNG Party Games that’s launching alongside the Playdate for $10 — and it only took a few minutes before I was playing. Panic also announced an upcoming app called Catalog where users can buy new games for the device. I’m really excited to see what happens when the Playdate is out in the wild and more people are making games for it, though it’s unclear now what the future will hold in terms of new releases.</p><p id=\"BiRxNp\">We’re in something of a golden age for video game handhelds. <a href=\"https://www.theverge.com/games/22711889/nintendo-switch-oled-review\">The Nintendo Switch is a runaway success</a>, <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">Valve is off to a messy-but-interesting start with the Steam Deck</a>, and <a href=\"https://www.theverge.com/22831589/analogue-pocket-review\">Analogue has made classic portable games look better than they ever have</a>. Even mobile gaming is in a good place, thanks to <a href=\"https://www.theverge.com/2021/4/7/22370217/apple-arcade-fantasian-nba2k-wonderbox-classics-netflix\">services like Apple Arcade</a> and <a href=\"https://www.theverge.com/2021/10/19/22734392/xbox-touch-controls-game-pass-games-list\">Xbox Cloud Gaming</a>, along with <a href=\"https://www.theverge.com/21525741/backbone-one-iphone-ios-controller-gaming-portable-review\">add-ons like Backbone’s smartphone controllers</a>. There probably has never been a better time to play games on the go.</p><p class=\"c-end-para\" id=\"BonHyj\">But even in this crowded landscape, Playdate offers something entirely unique. It’s not a necessary device, one that will transform gaming in the long run, and I don’t expect the next Switch or iPhone will come with a crank for playing games. Instead, it’s more like a strange evolution, a handheld left in the gaming version of the Galápagos Islands to develop in its own way, apart from industry trends. If you want to get away from live service games and microtransactions and the never-ending graphical arms race, the Playdate is the place to do it. Its games are as weird as its design — and that’s what makes them so interesting.</p><p id=\"MsPj51\"><em><strong>Correction April 18th, 3:30PM ET: </strong></em><em>An earlier version of this story listed the incorrect developers for </em>Saturday Edition<em>.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/l3vQR_6CKB6WiLgqL_gchkVa_g4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23396647/vpavic_220415_5149_0080.jpg",
  "description": "A quirky handheld with equally quirky games.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}