{
  "title": "Plex’s latest beta features can help you navigate every streaming service you have",
  "url": "https://www.theverge.com/2022/4/5/23012425/plex-discover-source-watchlist-cross-streaming-service-compatibility-beta",
  "date": "2022-04-06T01:35:24.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QU-VIkcEvVI-FB7n663e0kPaQbY=/0x0:1260x840/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70715001/Discovery_Blog_hero_image_1440x840.0.jpg\" />        <figcaption>Image: Plex</figcaption>    </figure>  <p id=\"qkbAlG\">Plex’s latest beta features are a modern solution to a modern problem — having to search through HBO Max, Netflix, Disney Plus, and like, three other services to find something to watch. <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.plex.tv%2Fblog%2Fend-the-streaming-struggle-with-plex%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F5%2F23012425%2Fplex-discover-source-watchlist-cross-streaming-service-compatibility-beta\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The company announced</a> a new “Discover” feature, which aggregates and recommends content from various streaming services and a universal watchlist that gathers everything you want to watch all in one place.</p><p id=\"q61PnX\">The Discover screen acts like most streaming services’ homepages, giving you recommendations on what to watch next, but with the ability to show content from many different catalogs. It shouldn’t overwhelm you with selections you don’t have access to, though. There’s a setting that lets you choose only the services you have. Plex has been working for several years <a href=\"https://www.theverge.com/2019/8/29/20838378/plex-streaming-service-warner-bros-apple-netflix-disney-amazon-piracy\">to slide into position as a legitimized one-stop-shop for streaming</a> — and an <a href=\"https://www.theverge.com/2021/7/14/22577727/plex-15-new-tv-channels\">ad-supported free TV</a> business model — which the new menu may finally be able to pull off.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/J1UcnSRvKnKi97QEE2sIa1bvjUU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23370167/Screen_Shot_2022_04_05_at_17.30.41.png\">      <cite>Image: Plex</cite>      <figcaption><em>The Discover screen, which is currently in beta, showing content from Disney Plus, HBO Max, and Apple TV Plus.</em></figcaption>  </figure><p id=\"RjkjzX\">There’s also a new “watch from these locations” feature, which helps if you know what you want to watch but not where to find it. It adds a section to the info page for movies and TV shows showing which streaming services offer that content. On some versions of the app (which is available on devices like the Apple TV, Fire Stick, Roku, PlayStation, smart TVs, etc.), Plex can even bounce you right to the streaming service from the page.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/d3wqQazSgjwnBq6tDg5GySUQC3A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23370176/Screen_Shot_2022_04_05_at_16.50.24.png\">      <figcaption><em>“Watch from these locations” makes it so you don’t have to search through multiple apps to find a specific show.</em></figcaption>  </figure><p id=\"RDyzvW\">The list of streaming services Plex supports with these features is, to put it lightly, immense. It includes all the big names, like Hulu, Disney Plus, Netflix, Amazon Prime, HBO Max, and Peacock, along with — no joke — almost 150 others (many of which, like Martha Stewart TV, I’d never heard of). Basically, if you can legally stream what you’re watching somewhere on the internet, Plex can probably tell you about it, with only a few exceptions. And, of course, you can also let it search your Plex libraries of self-hosted videos or other media.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fVmna3FoZE2tmdu4kZpTN71TIM0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23370187/Screen_Shot_2022_04_05_at_17.41.31.png\">      <figcaption><em>Look how small that scroll bar is.</em></figcaption>  </figure><p id=\"KRzQE4\"><a href=\"https://support.plex.tv/articles/discover/\">Plex’s support page</a> says that “not all platforms allow sending the user to the corresponding streaming app.” From <a href=\"https://www.reddit.com/r/PleX/comments/twuite/comment/i3iw8zj/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">reports on Reddit</a>, it seems like one big platform that can’t do the linking is Roku. Testing it out on my Apple TV, it seemed to work okay, but it was very clearly a beta. I could open links to Netflix, Hulu, and Apple TV Plus but got an error trying to open links for HBO Max and YouTube. Plex said the apps weren’t installed, even though they were. On the web version of Plex, it worked for every platform I could think to try (though when opening things on YouTube, it just took me to the search results page for the title instead of the actual page for the movie itself). </p><aside id=\"Nzhz4n\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The best streaming device to buy right now  \",\"url\":\"https://www.theverge.com/21375098/best-streaming-device\"}]}'></div></aside><p id=\"CfCefn\">Personally, this might be what finally gets me to use Plex. I recently experienced what the company cheekily refers to as “the streaming struggle,” where my wife and I spent an hour figuring out what to watch. Most of the features Plex is adding here aren’t unique to it — the Apple TV has a built-in universal search and kind of lets you make a watchlist (though these features have very limited support for content on Netflix). Google does a decent job of telling you what services a show or movie is available on, and other smart TV platforms have universal search features too. But it would certainly be nice to have it all in one place and in a relatively neat interface that works across many different devices.</p><p id=\"k3hcXf\">These features should be available for free on most platforms, as long as you’re using the most up-to-date version of the Plex app. I didn’t have to sign up for a beta program to get access to them, but you may have to <a href=\"https://support.plex.tv/articles/discover/\">follow Plex’s instructions</a> to find them depending on your settings. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/w-aVrhuWxBBvphvPLZfz68IFt5w=/0x86:1440x840/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23370129/Discovery_Blog_hero_image_1440x840.jpg",
  "description": "Wrangling content from Disney Plus, Netflix, and more.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}