{
  "title": "Ploopy and the promise of an open-source trackball",
  "url": "https://www.theverge.com/2022/5/10/23065171/ploopy-trackball-open-source-vergecast-podcast",
  "date": "2022-05-10T17:01:48.000Z",
  "author": "Alex Cranz",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MttakpnSEKwZ0K2EtffVdT8M6us=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70853012/acastro_220509_5125_Trackball_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"l4FSCN\">The worst thing about my beloved Logitech trackball is the software. Every time my computer restarts the annoying Logitech software pops up and asks me to fiddle with my system preferences. I never do. My trackball works exactly as I need it to, and the software seems to do nothing but vex me. </p><p id=\"mRY8oQ\">A small company called Ploopy, started by brothers Colin and Phil Lam, has created a trackball — also called Ploopy — that has no annoying software. Instead it relies on <a href=\"https://qmk.fm/\">QMK</a>, open-source firmware originally created for keyboards that stores all the crucial settings on the hardware instead of the computer.</p><div id=\"SHs6an\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP2481652343&amp;light=true\" width=\"100%\"></iframe></div><p id=\"hl4Dh1\">That wasn’t the reason I purchased a Ploopy. It was all the other elements of the open-source trackball that appealed to me: Ploopy’s trackballs rely on a combination of relatively easy to source sensors and PCBs and a whole lot of 3D-printed parts. The Lam brothers created Ploopy with the idea that there would be a lot of other nerds like them willing to participate in the project and create cool tweaks and mods. And they were right.</p><p id=\"U7IH2J\">This month, <em>The Vergecast</em> is doing a special miniseries of Tuesday episodes focused on creators building really cool gadgets (and communities) that larger companies may be reluctant to invest in. Trackballs are not a hot commodity the big gadget makers are tripping over themselves to build. But Colin and Phil have forged a whole community of trackball lovers online, myself included. </p><p id=\"fMQEmJ\">In this episode, we talk to another member of that community, Chris Person, <a href=\"https://www.theverge.com/22958439/trackball-diy-building-ploopy\">who previously wrote about Ploopy right here at <em>The Verge</em></a>. He’s built more than one trackball and has created plenty of his own mods, including a trackball based around a pool cue ball and one using a big steel ball bearing. But first we spoke with Colin and Phil, who talk about the rationale behind a company focused on open-source gadgets and also explain why the heck this thing is called Ploopy.</p><aside id=\"p2w4ve\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How the mechanical keyboard went mainstream again\",\"url\":\"https://www.theverge.com/23053738/mechanical-keyboard-mainstream-evolution-history\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ogvwwy3gyi9qFau7cjDnu-Y0Wyg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23449295/acastro_220509_5125_Trackball_0002.jpg",
  "description": "Yes, Ploopy is the real name.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}