{
  "title": "Podcasting will be a $4 billion industry by 2024",
  "url": "https://www.theverge.com/2022/5/10/23065056/podcasting-industry-iab-report-audacy-earnings-patreon-pulitzer",
  "date": "2022-05-10T15:03:07.000Z",
  "author": "Ariel Shapiro",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XZT3RLk3dKYZhIwoRHjJD7_Uyx0=/0x0:2051x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70852427/Hot_Pod_Site_Post.0.jpg\" />    </figure>  <p id=\"sWsDyw\">Remember when podcasting becoming a $1 billion industry was a big deal? So quaint. Let’s get into it.</p><p id=\"8y7Qhv\"><strong>Podcasting will be a $4 billion industry in two years</strong></p><p id=\"uRdQwj\">It’s the boom times for audio. Ahead of the Podcast Upfronts, the Interactive Advertising Bureau and PricewaterhouseCoopers released their <a href=\"https://www.iab.com/insights/u-s-podcast-advertising-revenue-report-fy-2021-results-2022-2024-growth-projections/\">annual joint report</a> on the podcasting business, projecting that the industry will generate $2 billion in revenue this year and $4 billion by 2024. </p><p id=\"HRBaPP\">That growth is not just because the number of podcasts and time people spend listening to podcasts are increasing (though that doesn’t hurt). A lot of it, according to executives at IAB, also comes from advances in ad tech that allow advertisers to better target audiences and encourage them to spend more money. </p><p id=\"4Ki6bh\">The way ads are placed in podcasts has changed significantly over the last couple of years. Dynamically placed ads made up less than half of the podcast ad market in 2019; last year, 84 percent of ads were dynamically inserted into podcasts. Plus, advertisers traditionally placed ads based on podcast genre and content, which casts a wide (and sometimes ineffective) net. Now the tech has improved to target listeners based on location, age, and gender, and there are better methods for advertisers to track whether their spots had any effect on listeners.</p><p id=\"ERrEq4\">That shift has had a number of effects. First, it encourages advertisers to spend more money if they are seeing better results. Second, it enables podcasters to effectively monetize their back catalogs by allowing them to place new ads in old episodes. “The value is not just from an advertiser perspective; it’s also from a creator perspective,” said Eric John, vice president of the IAB Media Center.</p><p id=\"aEApFJ\">While the idea that podcast ads will be more closely tracking listeners may make some people uncomfortable, that influx of ad money is also necessary for the industry to grow. Podcasts don’t run on dreams, people!</p><p id=\"hFjGKR\"><strong>Audacy sees 37 percent growth in podcasting business</strong></p><p id=\"23ADtk\">The last of the three biggest private radio companies to report first-quarter earnings, Audacy echoed a similar theme to iHeartMedia and Cumulus: podcasts are a major growth area, especially as traditional broadcasting faces hiccups in the ad market. Ad-driven broadcast revenue grew by 14 percent year over year, while podcasting far outpaced it with <a href=\"https://audacyinc.com/press/audacy-reports-first-quarter-results-2/\">37 percent growth</a>. </p><p id=\"T4po5B\">Podcasting is still a relatively small portion of Audacy’s business model — its broadcast sector is three times the size of its digital operation, and podcasts only account for a portion of that. But the company’s 2019 acquisition of Pineapple Street Studios and Cadence13 is paying off. It reported 32 million podcast listeners a month thanks to smash hits like Cadence13’s <em>Fly on the Wall with Dana Carvey and David Spade </em>and the Pineapple Street / Wondery collaboration <em>Will Be Wild</em>.</p><p id=\"9f6sXQ\">Audacy CFO Richard Schmaeling cited the IAB / PwC’s study’s projection that the podcast industry will grow by 47 percent in the next year as a positive sign for the company’s trajectory. If the stock market keeps going the way it is, Audacy is going to need it. As B. Riley analyst Daniel Day <a href=\"https://hotpodnews.com/insider-may-5-2022-cumulus-doesnt-take-the-deal/\">told <em>Hot Pod</em> last week</a>, newer, cheaper industries like podcasting tend to fare better in a recession than legacy media sectors like broadcast television and radio.</p><p id=\"U0TDpn\"><strong>Futuro Media and PRX win Pulitzer for </strong><em><strong>Suave</strong></em></p><p id=\"gLOR26\"><em>Suave</em>, a seven-part podcast produced by Maria Hinojosa’s Futuro Media and PRX that follows three decades in the life of a man sentenced to life in prison as a juvenile, beat out competitors from NPR and NBC News to take home the <a href=\"https://www.pulitzer.org/winners/staffs-futuro-media-new-york-ny-and-prx-boston-mass\">Pulitzer Prize in Audio Reporting</a>. Hinojosa, the longtime host of public radio program <em>Latino USA</em>, founded Futuro Media in 2010 and has since produced podcasts like politics show <em>La Brega: Stories of the Puerto Rican Experience</em> with WNYC and <em>Anything For Selena</em> with WBUR. This is Futuro’s <a href=\"https://twitter.com/Maria_Hinojosa/status/1523753042797293568\">first Pulitzer</a>.</p><p id=\"ukziqD\">“When I heard the news that ‘Suave’ won the Pulitzer Prize, I felt like a tectonic shift happened,” said Hinojosa in a statement. “The ‘Suave’ podcast was always scrappy from the start. Never in my life did I think we could win a Pulitzer. I think that’s the reason we won.”</p><p id=\"adAXAd\">PRX recently <a href=\"https://medium.com/prxofficial/prx-and-futuro-media-announce-an-expanded-podcast-partnership-1837b6208137\">deepened its ties</a> with Futuro, cutting a distribution deal in February for podcasts like<em> Latino Rebels Radio</em> and Hinojosa-helmed <em>In The Thick</em>. </p><p id=\"9mmYdg\"><strong>EXCLUSIVE: Patreon revamps its app’s audio section</strong></p><p id=\"LJaMQf\">The audio tab on Patreon’s app is getting a filter. Intended to make podcast sorting and listening on the app easier, the filter will let users select or weed out unplayed, in progress, downloaded, or archived podcasts. The new feature rolled out to iOS users on Monday.</p><p id=\"xRgaAS\">Even as tech giants like Spotify and Apple have allowed podcasters to offer subscriptions, early-in-the-game Patreon still has a number of heavy hitters like <em>Maintenance Phase</em> and <em>Chapo Trap House</em>. The company claims that podcasting has doubled on the platform in the past three years. “Podcasting continues to be one of the most popular verticals on Patreon,” says Sandeep Rajan, product lead at Patreon, “and the revamped audio tab is a direct response to our creators looking to give patrons an enhanced audio experience.”</p><p id=\"ye4cdb\"><strong>Moves: Edison podcast data lead Tom Webster heading to Sounds Profitable</strong></p><p id=\"gXZkdq\">Tom Webster, the researcher behind Edison’s <em>The Infinite Dial</em> report on the audio industry, is heading to Bryan Barletta’s podcasting business publication, <em>Sounds Profitable</em>. He’ll be joining as a partner and will continue to produce research on the industry. Additionally, he will do consulting work for audio companies and turn his newsletter, <em>I Hear Things</em>, into a monthly column.</p><p id=\"7XFEQf\">Webster, who will leave at the end of the month, has been at Edison Research since 2004. When compiling <em>The Infinite Dial</em>, he started tracking podcast data starting in 2005 and, after a decade of baby steps, watched the industry explode in the past several years. Still, he says, “it’s such an under-monetized space.” At <em>Sounds Profitable</em>, he’ll work on more targeted reports about the business. First up: a study looking at podcasters themselves.</p><p id=\"UocEhm\">That’s all for today! I’ll be back later this week with coverage of the Podcast Upfronts.</p><aside id=\"IEKlpV\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/mDH9IBqr0tVCL9iYQelLh9cElx4=/0x174:2051x1248/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23434856/Hot_Pod_Site_Post.jpg",
  "description": "It’s the boom times for audio.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}