{
  "title": "Pokémon Go developer Niantic is making an AR pet game called Peridot",
  "url": "https://www.theverge.com/2022/4/13/23021722/peridot-niantic-ar-pet-game-iphone-android-pokemon-go",
  "date": "2022-04-13T17:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qgNRk7N0BI2slBy8QN3xjcET7XY=/469x0:5532x3375/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745123/Peridot_Key_Art_1920_x_1080.0.png\" />    </figure>  <p id=\"uNlJ0U\">Niantic, the developer behind <a href=\"https://www.theverge.com/2021/11/3/22761166/pokemon-go-ar-games-future-pikmin-harry-potter\">the blockbuster success <em>Pokémon Go</em></a>, has announced its next augmented reality game — and once again, it’s full of adorable creatures. Called <em>Peridot</em>, the game is all about caring for and breeding magical critters. Think of it like <em>Pokémon Go</em> crossed with a Tamagotchi, with some real-world and AR elements tossed in.</p><p id=\"gvxNcw\">Here’s the basic premise, according to Niantic: “After thousands of years of slumber, Peridots are waking to a world vastly different from the one in which they used to roam, and they’ll need your help to protect them from extinction.” Practically speaking, this means you’ll be caring for creatures by training, feeding, and playing with them, helping them grow from cute little babies to full-grown adults before eventually breeding more.</p><p id=\"2ux1Jc\">One of the defining aspects of Peridots is that every creature is unique. They all look different — through a combination of hand-crafted assets and procedural generation — and have distinct personality traits. Niantic says they also have their own DNA; this ties into the breeding aspect, which the developer says is “patterned after the way DNA works in real life.” There are different creature archetypes, like unicorn or cheetah, and these can be blended during breeding to create all-new adorable little critters.</p><p id=\"uU4u7A\">(And no, despite being unique digital assets, the Peridots are <em>not</em> <a href=\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\">NFTs</a>. “It’s a really interesting idea, and it’s something that we’re obviously looking at,” senior producer Ziah Fogel tells <em>The Verge</em>. “But right now, we’re focused on testing and refining the core gameplay experience to ensure it’s really fun and accessible.”)</p><div id=\"TAf3dX\"><div data-anthem-component=\"gallery:11140246\"></div></div><p id=\"dzv5de\">Like Niantic’s previous games — <a href=\"https://www.theverge.com/22746461/pikmin-bloom-hands-on-niantic-iphone-android\">including, most recently, <em>Pikmin Bloom</em></a> — much of the gameplay requires going out in the real world. This can mean searching for nests in the wild, which are required for breeding, or satisfying the needs of your Peridot by going for a walk or finding specific food for it. It should also be noted that, despite a storyline about saving a species from extinction, there is no death in <em>Peridot</em>. “There is no punitive element in this game,” says Fogel. “The creatures will never die. Instead, we try to reward people for players for coming back and playing with their creatures more often.”</p><div class=\"c-float-right\"><aside id=\"TnpnNe\"><q>“The creatures will never die.”</q></aside></div><p id=\"uWhI60\">Similarly, AR appears to be a large component of the game; just like in <em>Pokémon Go</em> and similar games, part of the experience is seeing these fantastical creatures in the real world. <em>Peridot</em> is being built with <a href=\"https://www.theverge.com/2021/11/8/22768925/niantic-lightship-developer-platform-john-hanke-pokemon-go\">Niantic’s Lightship platform</a>, and the developer says that the game’s virtual creatures can “recognize different real-world surfaces such as dirt, sand, water, grass, and foliage” and react to them accordingly.</p><p id=\"VIic2K\">Since the breakout success of <em>Pokémon Go</em>, Niantic has mostly focused on other licensed properties like <em>Pikmin</em>, <a href=\"https://www.theverge.com/2021/11/2/22759677/harry-potter-wizards-unite-shutting-down-january-2022-niantic-ar\"><em>Harry Potter</em></a>, and, soon, <a href=\"https://www.theverge.com/2021/6/14/22529378/transformers-heavy-metal-niantic-pokemon-go-location-game-ar\"><em>Transformers</em></a>. <em>Peridot</em> will notably be the developer’s first completely original property since <a href=\"https://www.theverge.com/2017/12/2/16725884/ingress-prime-update-niantic-pokemon-go\"><em>Ingress</em></a>. And while the new game doesn’t have a specific release date, Niantic says it will be rolling out in “select markets” in April on both the App Store and Google Play, while “additional markets will be added as testing and iteration during soft launch continues.”</p><p id=\"mpHe9C\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KLObJLgCoDJ93voT90v3QAhgcW0=/0x118:6000x3259/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23383998/Peridot_Key_Art_1920_x_1080.png",
  "description": "Pokémon Go crossed with a Tamagotchi",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}