{
  "title": "Polar’s new smartwatches aim to help runners pace themselves",
  "url": "https://www.theverge.com/2022/4/13/23022409/polar-pacer-pro-running-smartwatch",
  "date": "2022-04-13T09:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/40TfrOrQxmlReX4r6ovGGQ6P-y8=/136x0:2023x1258/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70743483/ecf9f64b_8b98_4e6f_97c7_4404dcda3884.0.png\" />        <figcaption><em>The Polar Pacer Pro is available today for $299.90</em> | Image: Polar</figcaption>    </figure>  <p id=\"Bf8XMk\">The pandemic sparked a running boom, with <a href=\"https://runningmagazine.ca/the-scene/study-finds-that-28-per-cent-of-runners-started-during-the-pandemic/\">one study</a> finding that roughly 28 percent of current runners got their start during quarantine. To cater to this new crowd, Polar announced today that it’s launching two new GPS watches designed to help runners get better at the sport. The $199.90 Pacer is aimed at novices, while the $299.90 Pacer Pro is meant to help serious runners up their game.</p><p id=\"tdc3H1\">Polar says that both smartwatches will feature faster processors than their predecessors, with 5MB of RAM. It’s an upgrade that’s meant to improve performance and deliver a better user experience. That’s been sorely needed in Polar watches, which sometimes lag during syncing and occasionally struggle with menu transitions. Both watches also have Polar’s Precision Prime heart rate monitoring tech. </p><p id=\"1Mrj5F\">As far as design and features go, the watches have a lot of overlap. The Pacer and Pacer Pro share the same minimalist design, physical buttons, and memory-in-pixel color displays for better outdoor visibility. Battery life is also the same, with an estimated seven days on a single charge and up to 35 hours of GPS training with heart rate monitoring. Lastly, both watches support push notifications, weather, music controls, and third-party integrations with running apps. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UXJdMczO8sLoVltnIuQz2Sv7iS0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385270/833f5a84_b308_472e_bc58_55dd89633405.png\">      <cite>Image: Polar</cite>      <figcaption><em>The Polar Pacer. It looks like the Pacer Pro, but it’s not.</em></figcaption>  </figure><p id=\"kCB0vl\">The main design differences between the two come down to weight, straps, and colorways. The Pacer is slightly lighter at 40g, while the Pro weighs 41g. Both watches accommodate 20mm straps, but the Pacer requires those with quick-release spring bars. The Pro is the only one that has an adapter that enables <em>any</em> standard 20mm strap. As for colors, the Pacer comes in white, black, teal, and purple. The Pro comes in gray, white, blue, maroon, and green.</p><p id=\"WiWM4y\">Despite the watches’ similarities, Polar says they’re targeted at runners of different skill levels. The Pacer is designed with newbies in mind. For example, it introduces a new walking test that can estimate aerobic fitness after a 15-minute walk on a flat surface. While you can also do the walking test on the Pro, the company says the test was designed for beginners who may not have the ability to complete Polar’s more strenuous Running Performance Test. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/47VsNijzImFc7GBEN78qH1k2WQc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385272/4731c500_15a5_4ce4_ad21_eff1a5910b30.png\">      <cite>Image: Polar</cite>      <figcaption><em>The Pro’s tools are geared more for experienced runners.</em></figcaption>  </figure></div><p id=\"Gn4G94\">The Pro, on the other hand, is for, well, pros. On top of turn-by-turn navigation, it adds a barometer to measure a runner’s “power values” in watts from the wrist. In simpler terms, the idea is to monitor how much effort a runner exerts during a run so they can run at the right intensity level. We’ll have to see how it works in practice, but it sounds similar to Garmin’s stamina gauge. </p><p id=\"CEHVTd\">Otherwise, both watches utilize Polar’s longtime running and recovery tools, like heart rate training on guided runs, training load, sleep tracking, and running index score (Polar’s metric for measuring progress over time). </p><p id=\"GVdvRF\">The Polar Pacer Pro is available today for $299.90 at Polar’s website and in retail stores. The $199.90 Pacer is available for preorder on Polar’s website and is expected to ship in May.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PdsnXZPlzqnrU4pjrPaIqUq4QjQ=/0x64:2158x1194/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385269/ecf9f64b_8b98_4e6f_97c7_4404dcda3884.png",
  "description": "The Pacer is for beginners, while the Pacer Pro targets experts.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}