{
  "title": "Polestar’s ‘Arctic Circle’ performance EV can shred a snowy track",
  "url": "https://www.theverge.com/2022/2/2/22913533/polestar-arctic-circle-electric-fastback-one-off-snow-test",
  "date": "2022-02-02T09:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CMQgnQt8wDfxgjkMvLgGrgOj-tY=/0x2:5000x3335/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70461236/Polestar_2_Arctic_Circle_A__1_.0.jpg\" />    </figure>  <p id=\"RL8LmT\">Polestar, the electric automaker jointly owned by Volvo and Geely, likes one-offs. There was the more powerful version of its electric fastback Polestar 2 sedan <a href=\"https://www.theverge.com/2021/7/8/22566761/polestar-2-electric-specs-goodwood-hill-climb\">made for the Goodwood Festival of Speed</a>. And now there’s the Arctic Circle, a high-riding, studded winter-tire-sporting, icy blast of winter racing prowess from the company’s Swedish engineers (who know how to design a vehicle for snow riding). </p><p id=\"lGsyGh\">The one-off was designed by Polestar chief chassis engineer – and trophy winning rally driver – Joakim Rydholm, who said he took on the challenge in order to improve the accuracy of the Polestar 2’s handling. “With such low levels of grip, we can feel and analyze the dynamics at a much slower pace than on tarmac, which means we can really fine-tune the way our cars behave, down to the smallest details,” Rydholm said in a statement. “These are my absolute favorite conditions to develop cars in.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RhL8KvcvxfWoEN3vL-PZqiahe38=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23211716/Polestar_2_Arctic_Circle_A__3_.jpg\">  </figure><p id=\"5f6reb\">Rydholm and his team tweaked the Long range Dual motor version of the Polestar 2 in order to make it more agile on snow and ice. Changes include: a raised ride height (+1.18 in / +30 mm), increased power and torque output (469 hp / 350 kW and 502 lb-ft / 680 Nm) and custom-made 19-inch studded winter tires (245/35 R19), each featuring 0.16 in / 4 mm metal studs (490 per tire). </p><p id=\"hMFLl1\">The three-way performance dampers, supplied by Swedish suspension manufacturer Öhlins, were also tweaked to include springs that are 30 percent softer than those found in a road-going Polestar 2. According to the company, the dampers are are set to nine clicks front and rear — slightly softer than the standard Polestar 2 with Performance Pack setting — and feature auxiliary adjustment chambers for better traction control.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DAF-aGzB52Hj-mlqIEfq8Soc-20=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23211717/Poletar_2_Arctic_Circle_A__5_.jpg\">  </figure><p id=\"zdJsIS\">“Executed within the Arctic Circle at a latitude of over 66-degrees north, Polestar’s intense winter testing program runs annually for 15 weeks from December to March and sees teams of engineers pushing prototypes — and themselves — to the limit.”</p><p id=\"Ty7aQ2\">Chill out, Polestar. </p><p id=\"o6O2ug\">Testing EVs on snowy tracks is almost a cliche now. <a href=\"https://www.theverge.com/2017/2/12/14575620/lucid-motors-air-snow-drifting-electric-car\">Lucid Motors does it in Minnesota</a>. <a href=\"https://www.cnet.com/roadshow/news/tesla-alaska-exclusive/\">Tesla has a test track in Alaska</a>. Ostensibly the idea is to show how well the electric vehicle handles in icy, Hoth-like conditions, while also showcasing seductive images of tires kicking up fresh clouds of sparkles.  </p><p id=\"GVtz7c\">Left unsaid is the deleterious effect cold weather can have on an EV battery. <a href=\"https://www.theverge.com/2019/2/10/18217041/electric-car-ev-extreme-weather-polar-vortex\">Studies show</a> that when the mercury dips below 20 degrees Fahrenheit, the average driving range decreases by 41 percent. Much of this is the result of EV owners cranking up the heat, which puts a serious strain on an EV’s battery, reducing the overall range and increasing the need to charge more often to minimize the chance of being stranded by a dead battery. </p><p id=\"OwZVt0\"><a href=\"https://www.polestar.com/us/manual/polestar-2/2021/article/Winter-driving\">Polestar warns</a> its customers to change the setting for one-pedal drive to “off” or “low” to when driving in slippery or icy conditions. And avoid driving your car above the Arctic Circle if you can manage. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SOW8wuoJm0woroK65yvvVB09n5I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23211718/Poletar_2_Arctic_Circle_A__7_.jpg\">  </figure>",
  "image": "https://cdn.vox-cdn.com/thumbor/f1LwAN3mcXOA0BelFgmDuLeFySg=/0x359:5000x2977/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23211656/Polestar_2_Arctic_Circle_A__1_.jpg",
  "description": "Polestar’s latest one-off is designed for snowy racing.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}