{
  "title": "Polestar’s most affordable EV is coming to the US",
  "url": "https://www.theverge.com/2022/3/24/22993409/polestar-2-single-motor-long-range-us-price-specs",
  "date": "2022-03-24T11:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kgpn07XcoWmkK4Yho9n5H26Az2k=/0x0:1200x800/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70665293/642805_20211216_Electric_Car_Brand_Polestar_Opens_Showroom_in_Marin_County_California.0.jpg\" />    </figure>  <p id=\"bfex8k\">Swedish electric automaker Polestar is bringing its most affordable model to the US. The long-range, single-motor Polestar 2 may not have as much performance as the dual-motor variant, but it will certainly be more accessible.</p><p id=\"HyK9fi\">The single-motor was previously only available to pre-order in the US. Starting this week, deliveries of this variant are beginning. Interested car buyers can also test drive the EV if they want, at Polestar’s two dozen retail locations around the country. </p><p id=\"HGtwU8\">The single-motor Polestar 2 starts at $45,900, as compared to $51,200 for the dual-motor version. Polestar says the price can get down to $33,400 after qualified federal and state incentives. (The federal EV tax credit is $7,500, while some states, like New Jersey, offer as much as $5,000 in additional incentives.) </p><div class=\"c-float-right\"><aside id=\"RCITnu\"><q>The single-motor Polestar 2 starts at $45,900</q></aside></div><p id=\"sQslm2\">The Environmental Protection Agency has estimated that the Polestar 2’s long-range single-motor model has 270 miles of driving range. It has the same 78-kWh battery pack as the dual-motor version, sending 231 horsepower and 243 pound-feet of torque to the front wheels. And when it’s time to charge, the Polestar 2 can accept 150 kWh of DC fast charging, meaning an 80 percent charge is possible in 40 minutes. </p><p id=\"hr9wRb\">Polestar, which started out as the performance sub-brand of Volvo, has emerged as one of the more interesting EV companies on the market in recent years. The company — which is jointly owned by Volvo and Volvo’s parent company, Geely — recently announced <a href=\"https://www.theverge.com/2021/9/27/22696139/polestar-spac-public-value-ev-startup-volvo-geely\">plans to go public</a> by merging with a special acquisition company, or SPAC.</p><p id=\"mmnv0c\">Polestar has only released two vehicles so far: <a href=\"https://www.theverge.com/2017/10/17/16487290/polestar-volvo-hybrid-electric-revealed\">the $155,000 hybrid coupe Polestar 1</a> and the <a href=\"https://www.theverge.com/21365032/polestar-2-hands-on-first-drive-electric-android-automotive-photos-range\">Polestar 2</a>. That lineup will grow with the release of the <a href=\"https://www.theverge.com/2021/12/2/22814368/polestar-3-electric-suv-tease-volvo\">Polestar 3 SUV in 2022</a>, the Polestar 4 compact SUV in 2023, and <a href=\"https://www.theverge.com/2021/11/23/22798880/polestar-5-precept-electric-sedan-tease-2024\">the Polestar 5 (née Precept) sports sedan</a> in 2024. The company also unveiled a sleek roadster concept called <a href=\"https://www.theverge.com/2022/3/2/22956775/polestar-o2-electric-roadster-concept-drone\">the Polestar O2</a>. </p><p id=\"JzuFTw\">The single-motor Polestar 2 looks indistinguishable from the dual-motor version. When I tested the dual-motor model last year, I came away impressed by the sharp design and the native Android Automotive operating system. </p><p id=\"gTd5Rw\">Polestar is offering two option packages: “Plus” and “Pilot.” The Plus Pack ($4,000) features a new mechanical heat pump to extend range, a full-length panoramic glass roof, a 13-speaker Harman Kardon audio system, and WeaveTech vegan interior upholstery. The Pilot Pack ($3,200) offers driver assistance features like adaptive cruise control and blindspot detection. </p><p id=\"aAhrki\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2XG1lM6z4DZlmM1jU9X6RRpsZDc=/0x86:1200x714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340722/642805_20211216_Electric_Car_Brand_Polestar_Opens_Showroom_in_Marin_County_California.jpg",
  "description": "The single-motor Polestar 2 starts at $45,900.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}