{
  "title": "Polk crammed Dolby Atmos and a ton of features into this 15-inch soundbar",
  "url": "https://www.theverge.com/2022/3/15/22979396/polk-magnifi-mini-ax-small-dolby-atmos-soundbar",
  "date": "2022-03-15T17:53:32.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jNCV7Q2YPf3coKTg03mDvodMuaA=/95x0:1906x1207/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70626279/polk.0.jpg\" />        <figcaption>Image: Polk</figcaption>    </figure>  <p id=\"Yo4zku\">How small can a soundbar get while still offering Dolby Atmos? According to Polk, the answer is 14.5 inches. That’s the width of the company’s new <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.polkaudio.com%2Fen-us%2Fproduct%2Fsound-bars%2Fmagnifi-mini-ax&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F15%2F22979396%2Fpolk-magnifi-mini-ax-small-dolby-atmos-soundbar\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$499 MagniFi Mini AX</a>, which supports both Atmos and DTS:X. In addition to the <em>very</em> compact soundbar, Polk is also including a wireless subwoofer for that price.</p><p id=\"cYPmSk\">The <a href=\"https://www.theverge.com/22701137/sonos-beam-gen-2-atmos-soundbar-review-specs\">Sonos Beam</a> — which itself is what I’d consider a small-ish soundbar — measures 25.63 inches wide. The MagniFi Mini AX manages to hack over 10 inches off of that, and frankly its dimensions and top-panel controls make it look more like a Bluetooth speaker than home theater gear. On the front is an OLED ticker for relaying key information like sound adjustments. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MteclKQGrJgMa8MefJ-E7_SpllY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23317978/withphone.jpeg\">      <cite>Image: Polk</cite>      <figcaption><em>Most soundbars dwarf an iPhone in size, but not this one.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Nq14l7Q31aM92bHhobcR1DxqZcc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23318011/Polk_MagniFiMiniAX_Hear.png\">      <cite>Image: Polk</cite>      <figcaption><em>An OLED display on front will show key info.</em></figcaption>  </figure><p id=\"tphGRZ\">But Polk has included a ton of functionality in this tiny thing. Aside from its eARC HDMI and optical inputs, the MagniFi Mini AX supports audio streaming via Bluetooth, AirPlay 2, Chromecast, and Spotify Connect. There’s an aux input, and the system is even Roku TV Ready. This means you can adjust sound settings right from the native menus of a Roku TV. Polk really covered all the bases here. </p><p id=\"NmNPy9\">But by now, you might be wondering how powerful a 14.5-inch soundbar can possibly be. The MagniFi Mini AX includes five speaker drivers — but none of them are up-firing. So like Sonos does with the second-generation Beam, Polk is virtualizing those Dolby Atmos height surround sound effects. You can optionally add in the company’s SR2 rear surround speakers for an extra $170. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/t-uWI0jJGe-E0AdPEOVcICvX5mU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23317972/subwoofer.jpeg\">      <cite>Image: Polk</cite>      <figcaption><em>The downward-firing subwoofer kinda looks like a paper shredder, but at least it comes in the box.</em></figcaption>  </figure><p id=\"NKyahQ\">Polk claims the MagniFi Mini AX can produce “quality that you’d expect to pay two or three times as much for.” The company’s VoiceAdjust feature optimizes voice clarity through the center channel and keeps all dialog easy to understand. There’s also a 3D audio mode that “transforms stereo audio to 360-degree surround sound.” That last trick isn’t particularly novel and usually has mixed results, but it’s another trick in this soundbar’s large bag of them. Polk also lets you dial back the bass or enable night mode to cut down on rumble if you’re watching something late at night. </p><p id=\"Oqw5bQ\">Do I expect an ultra-compact soundbar’s audio to blow me away? Not entirely. This whole Dolby Atmos thing keeps getting more and more diluted as laptop makers and other tech companies throw the Atmos badge on products that often sound totally fine but rarely deliver any extra immersion. Still, I’m definitely curious about the MagniFi Mini AX’s performance, and Polk has certainly stuffed it full of features (and thrown a subwoofer into the mix) all for a reasonable $499. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Sh6jsXShZQdzKihICIywgLpOYj8=/0x121:2040x1189/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318027/polk.jpg",
  "description": "It even comes with a wireless subwoofer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}