{
  "title": "Porsche is working on all-electric Macan and 718 vehicles — and its own charging network",
  "url": "https://www.theverge.com/2022/3/18/22984659/porsche-ev-charging-macan-718",
  "date": "2022-03-18T15:29:39.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ftlgoWATqIlR_G5ILqkK5MOcKHc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70641331/sokane_191127_3819_5743.0.jpg\" />        <figcaption>Photo by Sean O’Kane / The Verge</figcaption>    </figure>  <p id=\"XhlXAu\">In a rare move, Porsche announced that it is planning on building its own network of electric vehicle charging stations. It also announced that it aims to have 80 percent of its sales be electric vehicles by 2030.</p><p id=\"jRA3Aq\">The move was outlined <a href=\"https://newsroom.porsche.com/en_US/2022/company/porsche-annual-press-conference-financial-year-2021-annual-and-sustainability-report-27766.html\">during the automaker’s annual meeting</a>, in which it also revealed plans to expand its portfolio of EVs with an all-electric Macan compact SUV and 718 sports car. </p><p id=\"xPp2PU\">Porsche EV owners currently rely on third-party companies for their charging needs. The automaker, which sells the <a href=\"https://www.theverge.com/2019/11/27/20983836/porsche-taycan-turbo-electric-car-first-drive-hands-on-photos-video-range\">Porsche Taycan</a> in addition to some plug-in hybrid models, has a partnership with EV charging provider Ionity, a joint venture with Ford, BMW, Daimler, and Porsche-parent company Volkswagen. But now, Porsche has expressed willingness to build its own EV charging network, á la Tesla’s Superchargers. </p><div class=\"c-float-right\"><aside id=\"YFsiVn\"><q>The chargers will be built along well-trafficked corridors in Austria, Germany, and Switzerland</q></aside></div><p id=\"gLeWdM\">The chargers will be built along well-trafficked corridors in Austria, Germany, and Switzerland, with the first installations taking place at the end of the year. The Porsche-branded charging stations would be “exclusively for Porsche customers,” the company said, and are meant to supplement Ionity’s charging network in Europe. </p><p id=\"F4s90L\">The investment in premium charging stations is meant to boost Porsches sales of EVs, which it hopes will comprise 80 percent of its sales by 2030. The company is also spending money on battery production, which it hopes will be ready for series production by 2024. </p><p id=\"feSkEt\">Porsche envisions its charging stations as luxury lounges, where EV owners can have a drink and relax while their vehicles are plugged in. Executives said they would consider expanding the network into China and the US at a later date. </p><p id=\"5M4qKI\">As far as the automaker’s upcoming EVs, Porsche said its next-generation mid-engine 718 will be exclusively electric. The 718 will take inspiration from the <a href=\"https://www.theverge.com/2021/9/9/22665004/porsche-mission-r-electric-race-car-livestream-button\">Mission R</a>, the automaker’s racecar concept. But while the electric Macan crossover will be coming out soon, we won’t get to see the 718 EV until 2025.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CxWdPHwMOB4_WyM0F8ZOd9bdZ7I=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19413459/sokane_191127_3819_5743.jpg",
  "description": "It wants 80 percent of its sales to be EVs by 2030.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}