{
  "title": "Pour one out for Crucial Ballistix memory — Micron’s killing off the brand",
  "url": "https://www.theverge.com/2022/2/17/22939354/crucial-ballistix-ram-ddr-memory-end-of-life-discontinued",
  "date": "2022-02-17T19:41:29.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/HEdpr4VLMTH11Dc5qCoGaEzAtHw=/91x68:747x505/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70521941/crucial_ballistix_max.0.jpg\" />    </figure>  <p id=\"cPzAeF\">Years ago, one of my PC building buddies swore by Crucial Ballistix memory. I’m pretty sure I bought Corsair Dominator instead. Are people like me why Micron just decided to retire the Ballistix brand for good? Your guess is as good as mine because Crucial ain’t talking, but it’s definitely a thing that just happened. Crucial Ballistix is officially end-of-life, rep Chelsea Garecht confirmed to <em>The Verge</em>, and the company will focus on Micron DDR5 memory and Crucial-brand memory and SSDs instead.</p><p id=\"Ws33i6\">It’s making me all nostalgic for the days when RAM brands seemed to matter.</p><div class=\"c-float-right\"><aside id=\"6WOk27\"><q>got any good RAM stories?</q></aside></div><p id=\"8pScWa\">There was a time you could theoretically buy worse RAM, or at least RAM from a notably less reputable manufacturer, for your desktop or laptop PC. I remember stories about defective batches of RAM and times when gamers eyed upstarts like OCZ and G.Skill with serious skepticism. I had a couple bad modules myself. </p><p id=\"LXFqAh\">But consumer DRAM memory modules have been pretty reliable for many years now, and it’s only with recent generations of CPU that RAM speed is <a href=\"https://www.eurogamer.net/articles/digitalfoundry-2020-08-22-does-ram-speed-affect-fps-on-amd-ryzen-memory-frequency-vs-timings\">beginning to matter again</a> (and even then, <a href=\"https://www.pcgamer.com/does-ram-speed-matter-gaming-amd-intel/\">not by all that much</a> in games). For quite a while, you’ve been able to buy the cheapest RAM that’ll fit your motherboard in whatever capacity you need and know that it’ll have quality chips from one of the few big DRAM manufacturers and very little lost performance (as long as your motherboard is set correctly), even if I admittedly did buy the “correct” 3200MHz memory for my own AMD Zen 3 chip. </p><p id=\"H7nmS7\">Crucial comes from one of those big three DRAM manufacturers, by the way: Samsung, SK Hynix and Micron make up roughly 94 percent of that industry, and the Corsair modules I’m currently using have Micron chips in them. Micron created the Crucial brand back in 1996. </p><p id=\"yU7t9B\">For Micron, killing off Ballistix is apparently such a small, non-material matter that the company didn’t even bother publishing the news to its investor relations website — or anywhere else. So here’s everything Micron has to say about the end of this era:</p><blockquote><p id=\"3UnbUN\"><strong>Micron To End-of-Life (EOL) Crucial</strong><sup><strong>® </strong></sup><strong>Ballistix</strong><sup><strong>®</strong></sup><strong> Product Lines</strong></p><p id=\"TWL3VT\">BOISE, Idaho; Feb. 16, 2022 – Micron released the following information about a change to its business strategy for Crucial<sup>®</sup> memory.</p><p id=\"Ckc3E0\">The company will end-of-life (EOL) its Crucial Ballistix, Crucial Ballistix MAX and Crucial Ballistix MAX RGB product lines.</p><p id=\"fV7aHr\">The company will intensify its focus on the development of Micron’s DDR5 client and server product roadmap, along with the expansion of the Crucial memory and storage product portfolio.</p><p id=\"4f7jFc\">The company will continue to support the performance compute and gaming communities with its award-winning SSD products, such as the Crucial P5 Plus Gen4 PCIe NVMe SSD, Crucial P2 Gen 3 NVMe SSD, and the popular Crucial X6 and Crucial X8 portable SSDs.</p><p id=\"gpeiM7\">Teresa Kelley, Vice President and General Manager, Micron Commercial Products Group: “We remain focused on growing our NVMe and Portable SSD product categories, which both offer storage solutions for PC and console gamers. Additionally, Crucial JEDEC standard DDR5 memory provides mainstream gamers with DDR5-enabled computers with better high-speed performance, data transfers and bandwidth than previously available with Crucial Ballistix memory.”</p></blockquote><p id=\"0tMhBP\">I do have to admit that “Ballistix” definitely sounds like an outdated “gamers love guns” kind of name for a product, but I also have a feeling that rival brand names like “Ripjaws,” “Vengeance,” “Blade,” and “Trident” aren’t going away anytime soon.</p><p id=\"h7Vwe1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/aQ509C9mvT3fyXn52uTyxDveCvs=/103x119:740x453/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23252571/crucial_ballistix_max.jpg",
  "description": "Bye, RAM",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}