{
  "title": "‘Pro’ has lost all meaning, and Apple knows it",
  "url": "https://www.theverge.com/2022/3/14/22968241/apple-pro-studio-branding-creative-marketing-mac-display",
  "date": "2022-03-14T16:17:37.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9OweVSL1GdyOEfqb3rEJfIAqRjs=/521x139:2168x1237/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70620838/05__j5ibvcf9rpm6_large_2x.0.jpg\" />        <figcaption><em>Apple is marketing its Studio products to the same people it marketed Pro products to — the creative types.</em> | Image: Apple</figcaption>    </figure>  <p id=\"zNL8ni\">Apple has a “Pro” problem — while some products bearing the label are clearly intended for <em>pro</em>fessional use (like Logic Pro, Final Cut Pro, and the Mac Pro), years of Apple and competitors slapping the name onto wireless earbuds and slightly fancier phones have made it hard to tell what “Pro” even means. Which is why my ears perked up when Apple used a <em>different</em> word to describe its <a href=\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\">new computer</a> and <a href=\"https://www.theverge.com/2022/3/8/22962052/apple-studio-display-specs-price-release-date\">monitor</a> that clearly targeted its audience of creative professionals: “Studio.” I wondered if I was witnessing the start of a new brand for Apple. </p><p id=\"9zXTHJ\">From the jump, Apple made it clear who the Mac Studio and Studio Display were for. It showed them being used by musicians, 3D artists, and developers <a href=\"https://youtu.be/CUwg_JoNHpo?t=2657\">in its presentation</a>, and the message was clear: these are products for creative professionals or people who aspire to be creative professionals. You know, the <a href=\"https://www.youtube.com/watch?v=9tobL8U7dQo\">same exact crowd</a> it’s targeted with <a href=\"https://www.youtube.com/watch?v=bj_Kn36aRdQ\">MacBook Pro commercials for years</a>.</p><div id=\"PYNEMJ\"><div ><iframe src=\"https://www.youtube.com/embed/bj_Kn36aRdQ?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"gX1KRv\">“My first thought was, ‘Oh, I wonder when the iPhone Studio comes out,” says Jonathan Balck, co-founder and managing director of ad agency Colossus, in an interview with <em>The Verge</em>. “Pro was exclusive, and it was about one way of doing things, but the whole culture is moving toward creativity,” he adds while musing whether we could see Apple’s Pro branding shift to become Studio branding instead.</p><p id=\"IEqLdm\">I can hear people asking: “Isn’t it a bit early to predict that, given that we’ve only seen two products?” It’s a very fair question. But it definitely seems like a first step — to me, the Mac Studio line is a clear successor to <a href=\"https://www.theverge.com/2017/12/14/16775156/apple-imac-pro-photos-xeon-radeon-power-vr-final-cut-8k\">Apple’s iMac Pro</a>. Both computers are powered by monstrous CPUs and come standard with 10Gb Ethernet and a healthy crop of Thunderbolt and USB ports. I’m convinced that, had Apple released the new Studio even two years ago, it would’ve put “Pro” in the name. (Though, to play devil’s advocate, I’m not as sure it would’ve done so for <a href=\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\">the Studio Display</a>.)</p><p id=\"n7nhLQ\">Some marketing experts tell me that the word “Pro” is starting to get long in the tooth, and not just from overuse. “The previous term Pro is, in my opinion, outdated and dry,” says Keith Dorsey, founder and CEO of the creative marketing group and management company YoungGuns Entertainment. </p><p id=\"EnzRn0\">Balck agrees; “If you look at the word Pro, that is in many ways restrictive,” he says in an interview, explaining that when you say a product is “professional,” it evokes ideas like job interviews, portfolios, and standoffishness. Pro products, he says, come across as just for those who use creativity to get a paycheck.</p><div class=\"c-float-right\"><aside id=\"lO5XzE\"><q>Studio “is evocative of a particular kind of vibe and environment where creative work happens”</q></aside></div><p id=\"1H9aOD\">In comparison, I heard a lot about how “Studio” is a great word given Apple’s target audience. “Apple has always been about empowering the creative class, and studio evokes that and only has positive connotations. Music studio. Design studio. Photography studio. It’s an idea we all romanticize,” says Matt Talbot, chief creative officer at the ad agency WorkInProgress, in an email. “Apple has always been a club you want to be part of,” he adds. Buying a product called “Studio” could help you feel like you’re part of the Apple club and the club of creators so many people aspire to be in, he suggests. </p><p id=\"y0erVS\">Michael Janiak, a co-founder of the Pattern design agency, puts it another way — “it definitely is evocative of a particular kind of vibe and environment where creative work happens,” he says in an email. “To me, it seems like the goal of using the term is more to send a cultural signal to current and potential customers.” Balck says it evokes the image of a studio where people can get together and collaborate on projects, not necessarily for money but to fulfill a creative drive. (It’s not a far cry from how Apple pitched <a href=\"https://www.theverge.com/2017/9/12/16296460/apple-self-love-iphonex-iphone8-event\">its “town square” stores</a>.) </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Kf92hxor1R1gg6i2yYYmf5b-sxk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13448681/jbareham_181115_3084_0081.jpg\">      <cite>Photo by James Bareham / The Verge</cite>      <figcaption><em>Microsoft’s 2018 Surface Studio 2.</em></figcaption>  </figure><p id=\"MdoFAq\">Which is, of course, why this isn’t the first time we’ve seen companies use the word “studio” to market similar products. Apple’s actually reusing the Studio Display name from a lineup of monitors it sold in the late ’90s and early 2000s, but almost every Windows PC manufacturer has harnessed the word more recently: <a href=\"https://www.theverge.com/2019/10/17/20919266/razer-blade-15-studio-edition-nvidia-rtx-graphics-4k-oled-creative-laptop-available-price\">Razer</a> and <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Fp%2Flaptops%2Flegion-laptops%2Flegion-laptops-series%2Flenovo-legion-y740-17irh%2F88gmy701306%3ForgRef%3Dhttps%25253A%25252F%25252Fwww.google.com%25252F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F14%2F22968241%2Fapple-pro-studio-branding-creative-marketing-mac-display\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Lenovo</a> created “studio” versions of some laptop models, HP has its <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fworkstations%2Fzbook-studio-configure.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F14%2F22968241%2Fapple-pro-studio-branding-creative-marketing-mac-display\" rel=\"sponsored nofollow noopener\" target=\"_blank\">ZBook Studio line</a>, Asus has the incredibly-named <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.asus.com%2Fus%2FLaptops%2FFor-Creators%2FProArt-Studiobook%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F14%2F22968241%2Fapple-pro-studio-branding-creative-marketing-mac-display\" rel=\"sponsored nofollow noopener\" target=\"_blank\">ProArt StudioBook</a>. Nvidia even has a whole <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.nvidia.com%2Fen-us%2Fstudio%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F14%2F22968241%2Fapple-pro-studio-branding-creative-marketing-mac-display\" rel=\"sponsored nofollow noopener\" target=\"_blank\">“Studio” program</a> that <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fstore.nvidia.com%2Fen-us%2Fstudio%2Fstore%2F%3Flimit%3D9%26locale%3Den-us%26page%3D3%26tab%3Dnv_tb_2%26personaType%3D%2522CREATIVE_MAESTRO%2522&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F14%2F22968241%2Fapple-pro-studio-branding-creative-marketing-mac-display\" rel=\"sponsored nofollow noopener\" target=\"_blank\">certifies computers</a> from the likes of Dell, HP, Maingear, MSI, and just about every PC-maker that wants to attract creators with a little more money to spend.  </p><p id=\"aoQCvH\">The real elephant in the studio might be Microsoft — its <a href=\"https://www.theverge.com/2018/11/19/18102490/microsoft-surface-studio-2-review-specs-features-price\">Surface Studio desktop</a> was marketed directly at artists and could fold down to turn into a massive drawing tablet. It now has the <a href=\"https://www.theverge.com/22716121/microsoft-surface-laptop-studio-review\">Surface Laptop Studio</a>, too. Not all of these products were successful, mind, but the point is that Apple’s spinning a well-known record. </p><p id=\"2Dm7tW\">The reason Apple may need to, though, is because it led the industry in thoroughly overusing the word “Pro” to the point where it’s lost all meaning. It’s hard to pinpoint where exactly this started (though, in my mind, it was with <a href=\"https://www.theverge.com/2019/7/17/20696238/apple-macbook-pro-13-inch-2019-review-specs-price-features\">the two-port MacBook Pro model</a>), but now the word gets slapped on everything. Want to sell wireless earbuds for even more money? Those are Pro earbuds now. Want to have a regular and fancy version of your phone? No problem, call the nice one the Pro. </p><p id=\"OWzzOY\">To quote my colleague Chaim Gartenberg in <a href=\"https://www.theverge.com/2019/9/12/20862381/iphone-11-pro-professional-name-huawei-p30-oneplus-7-extra-camera-ram-display-differences\">his piece about what it means for a phone to be pro</a>:</p><blockquote><p id=\"OVH5Kv\">For the most part, both for Apple and the rest of the world, the “pro” label doesn’t imply that hardware is meant to be “professionally” focused. It’s marketing shorthand for “better,” much in the same way that “plus” has seemingly become the streaming service term of choice or “lite” indicates a less feature-filled version of an app or device.</p></blockquote><p id=\"bbbfHy\">But because Apple also does make a few genuinely professional products, there’s always that slight bit of confusion. Seeing the word Pro on an Apple product could mean that it’s an expandable computer that <a href=\"https://www.theverge.com/circuitbreaker/2019/12/10/21003636/apple-mac-pro-price-most-expensive-processor-ram-gpu\">can hold 1.5TB of RAM</a>. Or it could just mean it has an extra camera — and a <a href=\"https://www.youtube.com/watch?v=8Tl1RL8MRCA\">flashy ad campaign</a> to try and convince you that no, really, this phone will make you the next Rian Johnson).</p><div id=\"vfZfox\"><div ><iframe src=\"https://www.youtube.com/embed/8Tl1RL8MRCA?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"lUS1SL\">But Apple’s new word, “studio,” seems to come ready-made to excite the company’s target audience. </p><p id=\"8dmVXo\">For what it’s worth, I don’t think “studio” branding has been widely used to make computers sound more capable than they actually are. And that definitely doesn’t seem to be the case with the Mac Studio, which seems like it’ll be plenty capable for creative work. That means fewer <a href=\"https://www.theverge.com/2016/11/7/13548052/the-macbook-pro-lie\">“Apple’s new Pro isn’t actually for pros”</a> headlines for Apple to deal with.</p><div class=\"c-float-left\"><aside id=\"iL1ZHV\"><q>“Pro is so arbitrary, but I could absolutely see this in studios sooo”</q></aside></div><p id=\"7VCodZ\">Though, talking to some members of <em>The Verge</em>’s own video and design team, I didn’t get the impression that it’s an absolute shoo-in for creative work. While it’s got Apple’s most powerful processor to date, that’s not necessarily what all creatives are looking for. Grayson Blackmon, our senior designer (who also <a href=\"https://www.theverge.com/2020/3/2/21161358/mac-pro-review-apple-display-xdr-adobe-hardware-software-price-video\">helped us review the Mac Pro</a>), says he’s unsure whether the risk of working on a computer with a new CPU would be worth the extra performance, which may not even make much of a difference for a lot of his work. </p><p id=\"mBg1Dk\">“I don’t care about the Mac Studio,” he tells me but says he could imagine the types of people that would. “Big studios, that are at the end of their life cycle of their machines, are going to be interested in it. They can just buy a whole bunch of them, and they’re good to go for a while. On the flip side, independent freelancers or extremely small studios may like this thing. It’s priced inside of their budget.”</p><p id=\"kGTiQG\">Our senior video director Becca Farsace says she could be interested in the Studio as an upgrade to her personal machine — but only after she sees tests proving it’s capable of long edits with 4K video. It’s not the branding that sold her, though. “I care so little about the name... But I’m happy to see them label it properly. Pro is so arbitrary, but I could absolutely see this in studios sooo,” she says, adding a shrug emoji.</p><p id=\"ldpwSn\">For the most part, it seems like the word “Studio” is being used for products that could actually belong in a creative studio. But what about two or three years from now? If Apple is trying to, as Talbot puts it, “build equity in the Studio line,” will it be tempted to repeat the mistakes it made with “pro?” We have already seen a bit of this — Apple has some <a href=\"https://www.theverge.com/22532970/beats-studio-buds-review\">decidedly consumer products</a> that have a liberal use of the word “Studio” in <a href=\"https://www.theverge.com/2017/10/25/16542656/beats-studio-3-wireless-headphones-review-noise-canceling\">its Beats lineup</a>, though I’m sure <em>someone’s</em> mastered a song using those headphones.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UuXKkkEqzrh8HmbYHdCEeGPSNiQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23308316/01__cyuzkvua0eky_large_2x.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>Apple’s Mac Studio product page is filled with images of people meticulously doing their craft, which it hopes you’ll see yourself in.</em></figcaption>  </figure><p id=\"gTL8fw\">Apple knows that not everyone with a creative passion project has the same needs as professional filmmakers or musicians. I’ve made a fair amount of videos in my day, and none of them would’ve been too much for something like a $1,300 Mac Mini to handle — but just imagine how cool and hip I would’ve felt had I been editing on a Mac Studio (which, by the way, starts at $2,000). And what if Apple could take that feeling and use it to sell a set of AirPods? The AirPods Pro may seem old and uncreative in comparison to a new set of AirPods Studio. </p><p id=\"EKExvD\">Yet, Apple’s already been claiming <a href=\"https://www.theverge.com/2019/11/21/20974649/apple-macbook-pro-16-inch-laptop-review-keyboard-test-specs-price-features\">for a few years</a> that the microphones in the MacBook Pro are “studio-grade” — when, in reality, most creatives will be left wanting for a dedicated mic setup. In this case, studio-grade is meant to evoke a feeling rather than describe something’s actual quality. Recording with the MacBook’s microphones might make you feel like your favorite podcaster, but it probably won’t make you sound like them. That’s the same trap Apple fell into with “Pro.”</p><p id=\"g943i9\">“There is always a risk that the word gets overused and eventually detached from its original meaning,” says Janiak. For the time being, Apple seems to have a lot of creatives’ attention with the Studio — if it wants to keep it, it’ll have to make sure that it doesn’t waste that brand equity on products that don’t deserve it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FjLpJr89FVgW_z94PQnBuANcdIc=/252x234:2168x1237/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23302806/05__j5ibvcf9rpm6_large_2x.jpg",
  "description": "The creative computer, like Macs have always been",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}