{
  "title": "Pro-Biden super PAC launches six-figure paid influencer program",
  "url": "https://www.theverge.com/2022/4/18/23030500/biden-pac-american-bridge-influencer-campaign-midterm-elections",
  "date": "2022-04-18T17:01:52.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"WH ATF and Gun Violence Announcement\" src=\"https://cdn.vox-cdn.com/thumbor/8VsUJfR43QhH4s7ak238Mn7qQnY=/0x2:8192x5463/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70762897/1239923986.0.jpg\" />        <figcaption>Photo by Nathan Posner/Anadolu Agency via Getty Images</figcaption>    </figure>  <p id=\"twaEmJ\">American Bridge, a Democratic super PAC, is jumping into the 2022 midterm elections with an eight-figure paid media program that includes big investments in podcast and influencer media to brandish support for President Joe Biden’s economic agenda.</p><p id=\"yVjhaf\">American Bridge’s six-figure influencer program runs paid digital ads behind content that it’s worked to make with creators on platforms like TikTok and Instagram and falls under the PAC’s total media investment. Most of these influencers have anywhere between 20,000 to 100,000 followers — making them microinfluencers — and have increasingly been called on <a href=\"https://www.theverge.com/2022/1/5/22868483/turning-point-charlie-kirk-republican-influencers-instagram-today-is-america\">by both Republican</a> and <a href=\"https://www.theverge.com/2022/4/6/23012077/biden-tiktok-president-white-house-account-gen-z\">Democratic campaigns</a> and nonprofits over the last few years. The creators tout strong followings in hotbed states like Arizona, Georgia, and Pennsylvania, American Bridge told <em>The Verge</em>.</p><div class=\"c-float-right\"><aside id=\"tlVAgR\"><q>The goal of the program is to reach voters through typically nonpolitical channels and voices</q></aside></div><p id=\"Uq5eZC\">A spokesperson for American Bridge said that the goal of the program is to reach voters through typically nonpolitical channels and voices. For example, <a href=\"https://www.instagram.com/p/CcTWyXlA7Rl/\">musician Logan Alexandra</a> wrote a song describing what Bridge said were the Biden administration’s accomplishments over the last few years. Another creator, Bethany Dani, plans to post a tutorial on the topic of how to make a face mask while explaining how the American Rescue Plan helped women throughout the pandemic, the spokesperson said. </p><p id=\"CBlhGL\">Allyson Marcus, American Bridge’s political director, believes the program will help Democrats mobilize women voters in the midterm elections. “Women Voters were the key to democratic victories through the Trump-era, and to electing President Biden,” Marcus told <em>The Verge</em>. “We want to make sure that these women are going to continue to hear positive information about what the President and his administration are accomplishing, and that they’re going to turn out and vote for Democrats up and down the ballot in the midterms.”</p><p id=\"ZkkcpP\">During the 2016 presidential election, the gender gap among voters was much narrower than it was in 2020, <a href=\"https://www.pewresearch.org/politics/2021/06/30/behind-bidens-2020-victory/\">according to a recent Pew Research Center study</a>. While support for Biden over Hillary Clinton grew among men throughout the last election, former President Donald Trump’s support from women grew around 5 percent, the study said. </p><p id=\"nyaUgj\">Asked what makes a paid influencer campaign like American Bridge’s successful, Marcus said, “We’re looking at engagement, statistics and benchmarks like that. We’re looking at what the comments are like. And mostly, I think what is unique about our program is we’ve built really strong relationships with these creators.”</p><p id=\"nYLiRY\"><strong>Correction April 18th, 2022 at 3:25 PM ET: </strong>American Bridge’s paid media program totals nine-figures, not eight-figures as originally reported in this story. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yWhktRCHMl-qfMRpkdFyWc39j3M=/0x588:8192x4877/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397688/1239923986.jpg",
  "description": "The program targets competitive states like Arizona.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}