{
  "title": "Proctorio subpoenas digital rights group in legal spat with critical student",
  "url": "https://www.theverge.com/2022/2/22/22945634/proctorio-fight-for-the-future-twitter-copyright-lawsuit-subpoena-remote-proctoring",
  "date": "2022-02-22T19:41:40.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"Storm Ylenia - Bielefeld\" src=\"https://cdn.vox-cdn.com/thumbor/cg_VF1IZabEPYWJV93CUBK_e2IA=/69x0:5292x3482/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70537752/1238551725.0.jpg\" />        <figcaption>Photo by Friso Gentsch/picture alliance via Getty Images</figcaption>    </figure>  <p id=\"wadV6n\">The controversial proctoring platform Proctorio has filed a broad subpoena against the prominent digital rights nonprofit Fight for the Future as part of its legal battle with Miami University student Erik Johnson, in what the group describes as an effort to silence critics through legal maneuvering.</p><p id=\"MNlmAK\">The fight between Johnson and the company began in September of 2020 when the student <a href=\"https://www.theverge.com/2021/4/22/22397499/proctorio-lawsuit-electronic-frontier-foundation-test-proctoring-software\">published a lengthy Twitter thread</a> criticizing Proctorio’s practices, including excerpts of the platform’s source code that he’d posted on PasteBin. Proctorio filed a copyright takedown notice. Three of the tweets were removed but later reinstated. The Electronic Frontier Foundation then <a href=\"https://www.docketalarm.com/cases/Arizona_District_Court/2--21-cv-00691/Johnson_v._Proctorio_Incorporated/1/\">sued Proctorio</a> on Johnson’s behalf, arguing that the takedown had “interfered with Johnson’s First Amendment right.”</p><p id=\"ScLGl6\">Proctorio is one of the most prominent software platforms that schools use to watch for cheating on remote tests. It records students through their webcams as they work, monitoring their head positioning, and flags possible signs of cheating to professors. </p><p id=\"kZHUxj\">The company has been embroiled in several public controversies since remote learning exploded in 2020. It’s still embroiled in a legal spat with a technology specialist named Ian Linkletter who, like Johnson, <a href=\"https://www.theverge.com/2020/10/22/21526792/proctorio-online-test-proctoring-lawsuit-universities-students-coronavirus\">made a series of tweets</a> criticizing the platform in mid-2020, some of which contained unlisted YouTube videos and screenshots from Proctorio’s website. In that case, Proctorio claimed that the tweets contained constituted the sharing of confidential information and copyright infringement. Linkletter has filed a petition <a href=\"https://www.edsurge.com/news/2022-02-03-a-proctoring-company-tried-to-sue-an-edtech-critic-he-s-fighting-back-in-court\">to dismiss the suit</a>, which the court has <a href=\"https://www.gofundme.com/f/stand-against-proctorio\">not yet ruled on</a>.</p><p id=\"LIzIQx\">Amid the EFF lawsuit, filed in the district of Arizona, Proctorio appears to be taking on yet another one of its critics. Not only has Fight for the Future been <a href=\"https://twitter.com/fightfortheftr/status/1412909294727618566\">publicly critical</a> of Proctorio and other remote proctoring platforms on social media, but it also <a href=\"https://www.theverge.com/2021/6/16/22535439/ban-eproctoring-fight-for-the-future-colleges-online-tests\">runs a website</a> tracking the colleges that use them and encouraging students to take action in opposition.</p><p id=\"MVfoO8\">The subpoena requests that FFTF produce “all documents and communications” between itself and EFF, Erik Johnson, and Ian Linkletter, as well as any related to the proctoring software industry. </p><div class=\"c-float-right\"><aside id=\"HWQY70\"><q>“This subpoena amounts to a fishing expedition.”</q></aside></div><p id=\"2XqF8F\">Fight for the Future has filed <a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23263485/2___Memo_of_Law__1_.pdf\">a motion to quash the subpoena</a>. Its memo argues that “FFTF is not a party to the Arizona litigation and, indeed, has no meaningful connection to the claims asserted by Johnson and Proctorio.” It denounces the subpoena as part of an effort to “intimidate and gain access to the strategies of digital and human rights advocates who highlight the harm of Proctorio’s business practices.”</p><p id=\"Qj8FOA\">In a statement, FFTF wrote, “This subpoena amounts to a fishing expedition. It’s a form of harassment clearly intended to silence critics of Proctorio and its CEO.” The group added that “Proctorio’s attempts to bully us through their legal team will not change our principled view that surveillance-based eproctoring is inherently harmful.”</p><p id=\"NU40r5\">This isn’t the first time Proctorio’s aggressive legal strategies have been challenged. A British Columbia court recently blocked the company from cross-examining Linkletter about his private communications related to its platform. Proctorio’s critics have hailed that ruling as a victory, and Linkletter continues to freely criticize eproctoring software on Twitter.</p><p id=\"R9MVkd\">Proctorio has not yet responded to a request for comment.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/v0PXIDqAzewodaEAPUq1Xx-pOtY=/0x338:5359x3144/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262948/1238551725.jpg",
  "description": "An e-proctoring legal battle continues.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}