{
  "title": "PUBG: Battlegrounds is earning a lot more money after going free-to-play",
  "url": "https://www.theverge.com/2022/5/13/23070946/pubg-battlegrounds-free-to-play-money-krafton",
  "date": "2022-05-13T21:21:10.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2Fll1Ubixo4b1l7vtRQG0pQRR9k=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70867360/ss_01d84950ddfb28ea611f1fa1a28c3cb08ccd7eee.1920x1080.0.jpg\" />        <figcaption><em>Somebody at Krafton is probably doing these poses after the company’s latest earnings report.</em> | Image: Krafton</figcaption>    </figure>  <p id=\"8gNYtx\"><em>PUBG: Battlegrounds</em>, the PC and console version of the battle royale shooter series, is making a lot of money following its switch to free-to-play in January, as revealed by <a href=\"https://press.pubg.com/KRAFTON-INC-REPORTS-RECORD-REVENUE-OF-4057-MILLION-USD-FOR-Q1-2022\">developer Krafton’s latest earnings report published Friday</a>.</p><p id=\"L5kX0A\">According to the report, on PC, sales were up 61 percent year over year to $82.3 million. On console, the sales jump was even bigger, increasing 124 percent from the previous quarter and 274 percent year over year, though Krafton didn’t put a dollar figure behind those increases. The game also saw a “nearly tripled” increase in average monthly active users from Q4 2021. </p><p id=\"i3YYep\"><em>PUBG: Battlegrounds</em> was originally a paid title when it launched on Steam in early access in 2017, but the outsized financial success of free-to-play battle royale shooters like <em>Fortnite</em>, <em>Call of Duty: Warzone</em>, and <em>Apex Legends </em>proved that the free model can be quite lucrative. To give you an idea of just how lucrative, EA said this week that <em>Apex Legends</em>, a game that has been out for a little over three years, has surpassed $2 billion in lifetime net bookings. And Epic <a href=\"https://www.theverge.com/2022/4/4/23009838/fortnite-ukraine-relief-fundraising-total\">raised $144 million for Ukraine relief</a> from just two weeks of <em>Fortnite</em> proceeds.</p><p id=\"fFNIRc\">So for Krafton, switching <em>PUBG: Battlegrounds</em> <a href=\"https://www.theverge.com/2021/12/9/22821220/pubg-playerunknowns-battlegrounds-free-to-play-release-date\">to free-to-play</a> was likely a pretty easy decision. And the popularity of <em>PUBG: Mobile</em> (which is also free-to-play) probably helped; Krafton says that game, which has been downloaded more than 1 billion times <a href=\"https://www.theverge.com/2021/3/25/22350782/pubg-mobile-one-billion-downloads-tencent\">as of March 2021</a>, earned $307.1 million in revenue in the first quarter of 2022, a figure that was up 5 percent year over year.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8xUHDUWOxMEVIpVqllRyIMclh6E=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23463781/ss_01d84950ddfb28ea611f1fa1a28c3cb08ccd7eee.1920x1080.jpg",
  "description": "Sales are up in a big way.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}