{
  "title": "Pure Paste aims to fix the pain of formatted text for good",
  "url": "https://www.theverge.com/2022/3/3/22959920/pure-paste-menubar-app-macos-useless-copy-formatted-text",
  "date": "2022-03-03T18:29:23.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6YhrQJhEUIE-shmd9Xxfh_1oK8c=/46x0:1666x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70575049/Screen_Shot_2022_03_03_at_12.49.13_PM.0.png\" />    </figure>  <p id=\"FTdtDV\">One of my biggest computer pet peeves is copying and pasting text. Not the actual mechanism of getting words from one document to another, but the way that modern computers insist on trying to be overly helpful and copying not just the text I want, but all the formatting that comes with it, mucking up my emails and my documents. </p><p id=\"sFzRek\"><a href=\"https://apps.apple.com/app/id1611378436\">Pure Paste</a> is a neat new menubar app for macOS that aims to fix that: when it’s open, it automatically strips out any formatting on text you copy, allowing you to paste clean, unformatted text every time. There’s also an option to only clear formatting when you ask Pure Paste to (either through clicking on the menubar icon or through a keyboard shortcut). </p><p id=\"VOsaCb\">For those worried about security concerns, the developer notes that while the app does access your clipboard, it doesn’t store any data — or is even capable of connecting to the internet at all.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZHp9XibW5HBWDCH70CyHdiO5Lac=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23285880/Screen_Shot_2022_03_03_at_12.49.06_PM.png\">  </figure><p id=\"peqa63\">Technically, there is already a way to do something similar on a Mac: if you paste with the convoluted four-key shortcut of Command-Shift-Option-V, instead of the usual Command-V, it will paste and match the style of whatever document you’re in. (Enterprising users can also delve deeper into the macOS settings and remap “paste and match style” to be Command-V, too, but that also requires more effort.) </p><p id=\"d6Gx4P\">To that end, I’m not entirely sure that Pure Paste will be overly helpful to someone like me, who has grown so entirely used to mashing Command-Shift-Option-V every time I paste something that it’s become ingrained into my muscle memory. (I’ve also grown used to pasting text into Alfred and then copying out from there, which also clears any formatting). </p><p id=\"iIZeXB\">Still, Pure Paste is a free, simple application that does what it says on the can, and might just make your day-to-day workflow a tiny bit less aggravating. </p><p id=\"SrxEqj\"></p><p id=\"u6L7z2\"></p><p id=\"CqemCE\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wAPJsoCWvYu5SDR1FzIJLJ4uhC4=/0x92:1712x988/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285881/Screen_Shot_2022_03_03_at_12.49.13_PM.png",
  "description": "A useful (and free) new menubar app",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}