{
  "title": "Qualcomm’s new AR glasses are thinner and wireless",
  "url": "https://www.theverge.com/2022/5/20/23130369/qualcomm-xr2-wireless-ar-smart-viewer-announcement",
  "date": "2022-05-20T12:00:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"Qualcomm AR glasses reference design\" src=\"https://cdn.vox-cdn.com/thumbor/X7C0bYhrir3fD_JpcnAA6EUoKBI=/0x203:4000x2870/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70891288/Hero_Image_for_Wireless_XR2_AR_Viewer__JPG.0.jpg\" />        <figcaption>Qualcomm</figcaption>    </figure>  <p id=\"zaPZ0a\">Qualcomm is introducing a wireless version of its augmented reality Smart Viewer, a reference design that manufacturers could adapt into commercial headsets. The Wireless AR Smart Viewer updates Qualcomm’s <a href=\"https://www.theverge.com/2021/2/23/22296100/qualcomm-xr1-smart-viewer-ar-glasses-announce-lenovo-thinkreality-a3\">earlier smart glasses design</a> with a higher-powered chipset, plus a tethering system that uses Wi-Fi 6 / 6E and Bluetooth instead of a USB-C cable. That comes with the tradeoff of a potentially <em>very </em>short battery life — although Qualcomm says consumer-ready versions might be designed differently.</p><p id=\"xTSvdy\">The new Smart Viewer was developed by Goertek. It’s currently available to a few manufacturing partners with plans to expand access in the coming months. Like its predecessor, it connects to a phone or computer and delivers mixed reality experiences with full head and hand tracking, using tracking cameras and projections powered by micro-OLED displays. Qualcomm has maintained the previous 1920x1080 resolution and 90Hz refresh rate, but it’s slightly narrowing the field of view, dropping it from 45 degrees to 40 degrees diagonal.</p>  <figure class=\"e-image\">        <img alt=\"A comparison between Qualcomm’s wired and wireless glasses\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LNLNHPAt_3WKkLUDn_C5sQDKONk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576037/image__2_.png\">  </figure><p id=\"T3W2Kf\">That’s substantially smaller than <a href=\"https://www.theverge.com/2022/3/10/22969007/magic-leap-2-augmented-reality-headset\">the non-consumer-focused Magic Leap 2</a>, which offers closer to 70 degrees. But in its favor, the Smart Viewer has a slimmer profile than either the wired Smart Viewer or most competitors. Its frames are 15.6mm deep compared to around 25mm for the wired version, softening AR glasses’ typical bug-eyed look. (This shallower design, which uses <a href=\"http://centerfreeformoptics.org/what-is-freeform-optics/\">freeform optics</a>, might be much harder to achieve with a wider FOV.)  At 115 grams, it’s a little heftier than <a href=\"https://www.theverge.com/22791981/nreal-light-augmented-mixed-reality-glasses-review\">the 106-gram Nreal Light glasses</a>, a bit lighter than the <a href=\"https://www.theverge.com/2021/3/23/22346564/apple-mixed-vr-virtual-augmented-reality-headset-light-ming-chi-kuo\">rumored 150 grams</a> of Apple’s AR / VR headset, and far svelter than VR headsets like the 503-gram Meta Quest 2.</p><p id=\"wbGuxd\">The wireless viewer uses Qualcomm’s <a href=\"https://www.theverge.com/2020/2/25/21147912/qualcomm-snapdragon-xr2-vr-ar-xr-platform-reference-design-announcement\">Snapdragon XR2 chipset</a> compared to the previous model’s XR1 — something Qualcomm says offers more power for computer vision processing and other tasks. Qualcomm promises a brisk 3ms latency between the glasses and the connected phone or PC, as long as your phone or PC includes Qualcomm’s <a href=\"https://www.qualcomm.com/products/technology/wi-fi/fastconnect/fastconnect-6900\">FastConnect 6900</a> chip. (That’s not a given for many machines.) Qualcomm AR / VR head Hugo Swart says the actual “motion to photon” latency is under 20ms, just clearing the threshold for a comfortable mixed reality experience.</p>  <figure class=\"e-image\">        <img alt=\"Specs for the AR Smart Viewer as described in article\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mjwOkfgc7v6TMeuUkmI8QxMl0HM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576040/image__3_.png\">  </figure><p id=\"p7552I\">A wireless headset has been on Qualcomm’s roadmap for years, but the Smart Viewer still highlights one of AR’s enduring challenges: making high-powered glasses that don’t run out of juice almost immediately. Swart told reporters that the most demanding virtual experiences could drain the headset’s 650mAh battery in 30 minutes, although he emphasized that a light, simple virtual overlay could use much less power. Users can also plug in an attachable battery with a cable, and Swart said manufacturers could choose to prioritize a longer-lasting headset in their own designs. But the current tech probably can’t support some of AR’s most obvious applications, like creating a set of virtual monitors you can use all day at work.</p><p id=\"ciUiGx\">We weren’t able to try the new Smart Viewer ourselves, and consumers might never buy hardware that looks precisely like the reference design since manufacturers could tweak the system to their own specifications. While Swart said Qualcomm was working with “at least four” manufacturers, he didn’t name them or say how long it might take to commercialize the headset. But Qualcomm’s earlier designs have anchored products like the Nreal Light and Lenovo ThinkReality A3 glasses — so it’s a good example of what wireless headsets might look like in the coming months and years.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z885Xva2I_qdzLTAIm-NASCnNmU=/0x489:4000x2583/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23575984/Hero_Image_for_Wireless_XR2_AR_Viewer__JPG.jpg",
  "description": "The reference design uses Qualcomm’s XR2 chip.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}