{
  "title": "Qualcomm announces Snapdragon 8 Plus Gen 1, for when flagship isn’t flagship enough",
  "url": "https://www.theverge.com/23131792/qualcomm-snapdragon-8-gen-1-plus-soc-cpu-gpu",
  "date": "2022-05-20T12:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ALcasVqh1EJGA8MMVf4z5IfqqK0=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70891272/Snapdragon_8__Gen_1_Snapdragon_7_Gen_1___Reference_Design_Lockup_2.0.jpg\" />    </figure>  <p id=\"1NCjpR\"><a href=\"https://www.theverge.com/2021/11/30/22809687/qualcomm-snapdragon-8-gen-1-chip-smartphone-processor-specs-details\">Qualcomm’s Snapdragon 8 Gen 1</a> set the stage for the biggest Android smartphones of 2022, including Samsung’s flagship Galaxy — but it’s about to be surpassed by a better “Plus” version that’ll no doubt appear in buy-it-for-the-bragging-rights gaming phones and luxury handsets. It’s called the Snapdragon 8 Plus Gen 1, which just rolls off the tongue, and Qualcomm says it’ll offer 10 percent faster CPU performance, 10 percent faster GPU clocks, and — get this — use 15 percent less power for “nearly 1 hour” of extra gameplay or, say, 50 minutes of social media browsing.</p><p id=\"L11cRR\">Technically, Qualcomm says it’s achieved “up to 30 percent” better power efficiency from both the CPU and GPU, and 20 percent better AI performance per watt, but that doesn’t necessarily all transfer into more battery life — some of it’s about performance, too.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8cIbAEY-RA7uU_RonSA3o2uv8Ck=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576231/snapdragon_8_gen_1_bento.jpg\">      <cite>Image: Qualcomm</cite>      <figcaption><em>Snapdragon 8 Plus Gen 1 features.</em></figcaption>  </figure><p id=\"sGaao4\">Qualcomm is particularly touting better <em>sustained</em> performance from the new chip too — theoretically maintaining its clockspeed for longer as it heats up while gaming or tapping into 5G. Of course, that all depends on how phone manufacturers decide to cool the chip. </p><p id=\"ueZpZ7\">The company’s not breaking down where the extra performance and efficiencies are coming from, but you can see some of the chip’s other features in the slide above, even though many of them (like Wi-Fi, Bluetooth, 10Gbps of theoretical 5G, and 8K HDR video capture) haven’t changed from <a href=\"https://www.theverge.com/2021/11/30/22809687/qualcomm-snapdragon-8-gen-1-chip-smartphone-processor-specs-details\">the original Snapdragon 8 Gen 1</a>. Qualcomm says it’ll live alongside that older chip, so you can probably expect a price premium.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7v9lgh597KPThRoW1aA8O_WCLFU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576230/snapdragon_7_gen_1_bento.jpg\">      <cite>Image: Qualcomm</cite>      <figcaption><em>Snapdragon 7 Gen 1 features.</em></figcaption>  </figure><p id=\"2ivAe3\">Qualcomm’s also announcing a new Snapdragon 7 Gen 1 today, suggesting to journalists that it’s aimed at gamers with a 20 percent graphics performance boost over the prior gen and the trickle-down of features like its “Adreno Frame Motion Engine” to make games see smoother <a href=\"https://www.ubergizmo.com/2021/12/snapdragon-8-gen1-overview/\">by interpolating frames</a>. </p><p id=\"EZEoob\">But it’s pretty clear from the company’s press release that “gaming phone” makers are choosing the 8 Plus Gen 1 instead. Asus ROG and Black Shark are both signed up for the premium chip, as well as Honor, iQOO, Lenovo, Motorola, Nubia, OnePlus, OPPO, OSOM, realme, RedMagic, Redmi, vivo, Xiaomi, and ZTE. </p><p id=\"62A1CJ\">Honor, Oppo and Xiaomi are the only brands listed as building devices around the 7 Gen 1 as of today, though those phones may arrive first — they’re listed for Q2 2022, and Qualcomm says we’ll see the first devices within weeks. The 8 Plus Gen 1 devices, meanwhile, are expected in Q3. </p><p id=\"olKHlX\">We should also see Qualcomm announce <a href=\"https://www.theverge.com/22876511/qualcomm-ceo-cristiano-amon-interview-decoder-podcast\">its Snapdragon 8 Gen 2</a> later this year.</p><aside id=\"3SCReu\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"What comes after the smartphone, with Qualcomm CEO Cristiano Amon\",\"url\":\"https://www.theverge.com/22876511/qualcomm-ceo-cristiano-amon-interview-decoder-podcast\"}]}'></div></aside><p id=\"Bi3Dy0\"></p><p id=\"zpmIJl\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rCVv7UO4Npcc5sXfdkYUB0mOQGQ=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23576220/Snapdragon_8__Gen_1_Snapdragon_7_Gen_1___Reference_Design_Lockup_2.jpg",
  "description": "And there’s a 7 Gen 1 for less expensive gaming phones",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}