{
  "title": "Ram aims to ‘steal’ some of Ford’s electric truck ‘thunder’ with 1500 EV tease",
  "url": "https://www.theverge.com/2022/4/25/23041381/ram-1500-ev-tease-electric-truck-ford",
  "date": "2022-04-25T18:42:29.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4YPl_yVi3Y0AQ5yionIlTaPGUZE=/0x88:1131x842/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70791666/Screen_Shot_2022_04_25_at_1.39.45_PM.0.png\" />    </figure>  <p id=\"GZCXlw\">Ram teased its upcoming electric 1500 pickup truck, which is scheduled to go into production in fall 2022. The new electric truck is expected to be one of the first major long-range EVs to come out of Stellantis, the multinational conglomeration that formed last year when Fiat Chrysler merged with the French PSA Group.</p><p id=\"TwZlTd\">The decision to tease the electric Ram 1500 is clearly a shot at Ford, which is set to begin customer deliveries of its hotly anticipated F-150 Lightning truck this week. “Time to steal some thunder,” the tweet from Ram reads — a clear allusion to Ford and its lightning-branded EV. </p><div id=\"4qXMBa\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Time to steal some thunder.   <br>Unleashing Fall 2022. <a href=\"https://t.co/epaaYdKHj9\">https://t.co/epaaYdKHj9</a> <a href=\"https://t.co/m4wB9AjYBp\">pic.twitter.com/m4wB9AjYBp</a></p>— Ram Trucks (@RamTrucks) <a href=\"https://twitter.com/RamTrucks/status/1518577924479365121?ref_src=twsrc%5Etfw\">April 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"7Jo2MX\">It’s slightly less ham-handed than <a href=\"https://www.theverge.com/2022/3/1/22956861/jeep-electric-suv-2023-ram-1500-ev-truck\">the last time Ram teased the electric 1500</a>, when it actually left in some of the vehicle’s design outlines in the teaser image, showing more of the truck than the automaker’s marketing team probably would have preferred. Ram is also making an electric ProMaster delivery van that will be incorporated into Amazon’s fleet starting in 2023.</p><p id=\"nHkQ6A\">When it’s released later this year, the Ram 1500 EV will be among the few electric trucks that are available to customers, including the Ford F-150 Lightning and Rivian R1T. General Motors plans on releasing the Chevy Silverado EV next year, as does Tesla with its long-delayed Cybertruck. Pickup trucks are among the most popular and fastest-growing segments in the US car market. </p><p id=\"J9Qly4\">Stellantis, which has been slower to embrace electric vehicles than its US and European rivals, is just starting to get some momentum going around its new lineup of EVs. The company, which is the fourth-largest automaker in the world, announced a comprehensive plan last year to electrify the lineups at most of its brands, including EV versions of Dodge’s popular muscle cars as well as multiple Jeep models.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6QwFrbIwLuu6bEHSeEcIsBrwx_c=/0x169:1131x761/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23415216/Screen_Shot_2022_04_25_at_1.39.45_PM.png",
  "description": "Ram says it wants to \"steal\" Ford’s \"thunder.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}