{
  "title": "Razer’s Leviathan V2 is a great-sounding soundbar trapped on PC",
  "url": "https://www.theverge.com/23033515/razer-leviathan-v2-pc-soundbar-system-review",
  "date": "2022-04-21T15:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "  <p>Full of improvements, but with fewer ports</p> <p class=\"p--has-dropcap p-large-text\" id=\"uonYbY\">Soundbars are typically reserved for the entertainment center, but Razer is among the few companies releasing soundbars made specifically for the desktop PC battlestation. It just announced the $249.99 Leviathan V2 sound system, following up its previous iteration that launched back in 2014. </p><p id=\"HtNMl3\">The soundbar component retains a similarly low-profile form factor that’s compact at just about 20 inches long, and it includes a wired subwoofer that connects via a long cable. The 65W soundbar itself is nearly a pound and a half lighter than the previous iteration, making it easier to move around on your desk if you need to. On the other hand, the subwoofer is about a pound and a half heavier, boasting a slightly bigger 5.5-inch downward-firing driver.</p><p id=\"qjxXuw\">The Leviathan V2 is packed with a few improvements, some being more obvious than others. For starters, it has a strip of RGB LEDs on its underside that can be programmed within Razer Synapse software for Windows to shine as wildly, or not, as you’d like. From a design standpoint, the Leviathan V2 looks more like a modern entertainment soundbar than its predecessor, with more subtle markings. As for its LEDs, it looks pretty cool to see some color splashed onto my desk’s surface. One of my favorite additions, though, are the swappable feet that are included, allowing you to angle the soundbar upward to better match where your ears are at.</p><div id=\"OaHz5o\"><div data-anthem-component=\"scorecard:11152424\"></div></div><p id=\"YTquYm\">Internally, the Leviathan V2 has two full-range drivers and two tweeters, just like its predecessor, but it adds passive radiators to the rear, allowing the soundbar to deliver palpable bass by itself. But, of course, the wired subwoofer is there to further amp up the booming low-frequency sounds.</p><p id=\"gzq3ea\">I’ll get to more of the features below, but at $250, the main obstacle for Razer here isn’t just convincing gamers that this is a good product (which it is). It’s trying to convince them why they shouldn’t instead get their audio fix from a different, more versatile kind of speaker system for a similar (or smaller) amount of money. The main reason why I bring that up is because if you’re into console gaming or want to hook it up to your TV for streaming, you absolutely shouldn’t get this, as there’s no way to connect it to those kinds of devices.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Razer Leviathan V2\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/E2kVgFQ4BfvAPQh00Nnng_9A3-E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401165/cfaulkner_141231_5150_0005.jpg\">      <figcaption><em>Each button acts as you’d expect. The leftmost button can toggle to a secondary audio source.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Razer Leviathan V2\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/l0Q68KTjrvAbU0iuPIkhNJ3Vxi0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401167/cfaulkner_141231_5150_0007.jpg\">      <figcaption><em>Passive radiators on each side of the Leviathan V2’s rear are new additions in this model.</em></figcaption>  </figure></div></div></div><p id=\"BUAy4A\">This soundbar lacks an HDMI port, and other common connectors, like a 3.5mm jack and an optical audio port (both were present in the original Leviathan) for routing a multitude of audio sources that would make it viable in the living room. Instead, it relies solely on USB for its wired connectivity. While it does support Bluetooth 5.2 for wirelessly connecting to phones, tablets, and other sources, that may not be enough versatility for you. </p><p id=\"B8Lhri\">Even if you aren’t hung up on what features the Leviathan V2 lacks, it’s entirely possible that your taste in design might lean more towards something that’s understated. There are numerous options out there ranging in price, but I settled on <a href=\"https://www.kantoaudio.com/powered-speakers/yu2/\">Kanto’s elegant YU2 self-powered bookshelf speakers</a>. These connect to my PC via USB (just as the Leviathan V2 does), but they also support audio-in via a 3.5mm jack. This lets them work with my PC, as well as my record player, or a TV if I had an audio receiver. These normally cost $269.99, but I was able to find a deal for around $150. This is, of course, just one of the many options out there.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Razer Leviathan V2\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/h-1dC5BHN4EyM4upzzS2dcjoxGs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401166/cfaulkner_141231_5150_0006.jpg\">      <figcaption><em>This soundbar is seriously lacking in ports, unless you’re just on PC.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Razer Leviathan V2 subwoofer\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ny3xgNAlm-Py2xiOrBGE-feBGIo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401168/cfaulkner_141231_5150_0008.jpg\">      <figcaption><em>Here’s the new wired subwoofer that’s included. Sega Dreamcast for scale.</em></figcaption>  </figure></div></div></div><p id=\"fadgTn\">While the first-gen soundbar focused on Dolby’s audio technologies that were popular in 2014, the Leviathan V2 features THX Spatial Audio, which is a little too complicated to use, but sounds pretty fantastic. Alongside Razer Synapse, you’ll need to use the free THX Spatial Audio app to turn it on (it installs upon setup when this product is plugged into your PC). From there, you need to set your main PC audio device as “THX Spatial Audio,” then turn the feature on within the dedicated app. Note: there’s a toggle between “Stereo” and “THX Spatial Audio” within Synapse, which would make this process far simpler, but it doesn’t seem to do anything presently.</p><p id=\"1MD4lJ\">So yes, Spatial Audio is definitely a cool feature for a spacious, virtual surround sound effect, and a growing number of PC games support it at this point. I enjoyed using it enough to leave the setting switched on, but some music sounded better to me with the setting off.</p><p id=\"kohbB1\">There’s also a new, software-based “Center Focus” mode in Synapse that claims to steer more of the audio directly to the center. While Razer said it’s made to work best with content that has multi-channel audio, it didn’t make a significant impact to the listening experience for me with gaming or other content types.</p><p id=\"nW6lU9\">I enjoyed listening to music on the Leviathan V2 as much as I did my gaming audio. On PC, it’s vastly overpowered for my needs; I commonly had it set near the lowest volume, which could fill my delegated work zone in our studio apartment. Suffice it to say, you could bring the house down with this soundbar system. The sound from this soundbar is direct, clear, and robust, and it provides a wider soundstage than I expected.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Razer Leviathan V2\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9Rnc20Y7GKtNcAWk8MFqSkCGlew=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401169/cfaulkner_141231_5150_0009.jpg\">      <figcaption><em>The Leviathan V2 looks even more elegant if you decide against using the RGB LEDs.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Razer Leviathan V2\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Cwb5N_zF73QcoXaAnY4L8OQYQjg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23401170/cfaulkner_141231_5150_0010.jpg\">      <figcaption><em>Razer thoughtfully included swappable feet that can angle the soundbar upward.</em></figcaption>  </figure></div></div></div><p id=\"LEb5Kc\">If your PC space is anything like mine, it’s already a rat nest of cables, which the Leviathan V2 adds to. In addition to its power cable and USB cable, the subwoofer is wired. Given that many entry-level soundbars in the home entertainment space typically include wireless subwoofers, I can’t understand why Razer omitted it in this $250 system. </p><p id=\"E4ezkP\">One cool feature that can be customized in Synapse is the source toggle button, the leftmost button on the soundbar’s top-facing panel. You can program it to toggle to a different audio source by tapping and holding this button, in case you need to route audio to your headset in a jiffy. Another addition that I like about the Leviathan V2 is that it can be controlled remotely via the Razer Audio app for iOS and Android. From the app, you can cycle between equalizer settings, adjust the soundbar’s volume, change songs, and more.</p><p id=\"bdqWBB\">If you’re someone who uses their PC for their main source of entertainment, the Razer Leviathan V2 will likely be the source of a lot of enjoyment. It isn’t a soundbar for everybody, and that might be okay for some people. But considering its somewhat high price, it’s hard to ignore the many devices that this soundbar simply can’t connect to.</p><div><div id=\"e9c3Zl\"><div data-anthem-component=\"aside:11152586\"></div></div></div><p id=\"9lvE7q\"><em>Photography by Cameron Faulkner / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4OKwcgR-f3Dg8IVMOhh61oAVlI4=/0x62:2040x1130/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23401164/cfaulkner_141231_5150_0004.jpg",
  "description": "Fewer ports than before, but great all-around performance",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}