{
  "title": "Razer’s Viper V2 Pro wireless gaming mouse is extremely lightweight",
  "url": "https://www.theverge.com/2022/5/10/23055788/razers-viper-v2-pro-wireless-gaming-mouse-lightweight-specs-price",
  "date": "2022-05-10T15:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Razer Viper V2 Pro\" src=\"https://cdn.vox-cdn.com/thumbor/Kul_jbz1bk_RfRpltcdCfF_R9sI=/0x1:2144x1430/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70852381/Viper_V2_Pro_KV_1_with_Logo.0.jpg\" />        <figcaption><em>The Viper V2 Pro looks very similar to previous versions, but it’s made just for right-handed gamers.</em> | Razer</figcaption>    </figure>  <p id=\"1odLiA\">Razer has delivered a follow-up to its <a href=\"https://www.theverge.com/2019/8/1/20750672/razer-viper-gaming-mouse-optical-switches-price-specs-features\">original Viper gaming mouse from 2019</a>. The new wireless Viper V2 Pro is all about shedding off what little excess weight it had before. Like almost every peripheral company, Razer is gunning for the top place with the lightest wireless mouse, and, currently, it holds the crown with its latest mouse. It weighs 58 grams, which is a few grams below the runner-up, <a href=\"https://www.theverge.com/2020/11/18/21562618/logitech-g-pro-x-superlight-wireless-gaming-mouse-release-date-price-features-weight\">Logitech’s G Pro X Superlight.</a> Similarly, the Viper V2 Pro manages this feat without being drilled full of holes to lop off weight. The V2 Pro is launching today for $149.99.</p><p id=\"j84ErW\">Even with a weight reduction, the Viper V2 Pro doesn’t feel compromised in terms of hand feel, performance, or battery life — all of the things that matter most with a wireless gaming mouse. But it’s the first mouse that I feel could actually be blown off the table if a strong wind came through. It’s impressive that Razer fit all of the necessary hardware (wireless radio, battery, and all) into a design that’s as lightweight as some of the lightest wired gaming mice available, like the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.pcgamingrace.com%2Fproducts%2Fglorious-model-o-black&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F10%2F23055788%2Frazers-viper-v2-pro-wireless-gaming-mouse-lightweight-specs-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">58-gram Glorious Model O-</a>. The Viper V2 Pro is even lighter than the <a href=\"https://www.theverge.com/2020/3/4/21161433/razer-viper-mini-gaming-mouse-price-wired-features\">61-gram Viper Mini</a>.</p><p id=\"8VlBWR\">Really, it just feels like Razer’s previous Viper mice to use, which is a good thing. It isn’t as bulbous and ergonomic as, say, its <a href=\"https://www.theverge.com/2021/9/8/22650400/razer-basilisk-v3-chroma-rgb-scroll-wheel-price-features\">Basilisk</a> or <a href=\"https://www.theverge.com/2020/9/22/21444287/razer-new-wireless-gaming-accessories-headset-mouse-keyboards\">DeathAdder</a> options. But its shape seems ideal for a range of grip styles. As for whether an ultra-lightweight mouse like this might be good for you, I can see it fitting in nicely if you’re someone who plays competitively. But it might be hit or miss for some casual players, some of whom may desire added weight for more customizable levels of control. If you’re in the latter bucket, the Corsair M65 Ultra Wireless or Logitech’s G502 Lightspeed are good choices. (You can find <a href=\"https://www.theverge.com/21252193/best-gaming-mouse\">more of my thoughts on both mice right here</a>.)</p>  <figure class=\"e-image\">        <img alt=\"Razer Viper V2 Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CPdtkKzkNO9zewsyN73PhJEGTUk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450255/Viper_V2_Pro_KV_2_Black.jpg\">      <cite>Image: Razer</cite>      <figcaption><em>The Viper V2 Pro ships with grip tape to attach to the buttons and sides.</em></figcaption>  </figure><p id=\"6pTGiY\">The Viper V2 Pro is most similar to the Razer’s Viper Ultimate, with both being wireless options. Some key differences from generation to generation include the Viper V2 Pro having thumb buttons just for right-handed gamers (the previous gen was a true ambidextrous option) and jumping from the dreaded Micro USB charging connector to USB-C. In addition to being lighter in weight, the Focus Pro 30K optical sensor claims to offer greater sensitivity (up to 30,000 DPI) and greater speed. Razer also claims that its Optical Gen-3 switches can last up to 90 million clicks — a 20 million increase over the previous component. The Viper V2 Pro can last up to 80 hours per charge, a 10-hour increase over the Viper Ultimate.</p><p id=\"ewZn56\">Sometimes the trend of ultra-lightweight gaming mice costing as much as this one does strikes me as being a little off. I know that a heavier mouse isn’t worth more money because of weight alone. But with the Viper V2 Pro and its lightweight competitors, I guess all of that development work to trim off a few stray grams without disrupting function probably doesn’t come cheap. Though, with Razer’s mouse, it does make me shudder to imagine how much a Viper V2 Ultimate might cost.</p><aside id=\"ZHC85w\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The best gaming mice you can buy\",\"url\":\"https://www.theverge.com/21252193/best-gaming-mouse\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/sclaRDIjUU8Ey_gND7iwdevSWpk=/0x154:2144x1277/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23450251/Viper_V2_Pro_KV_1_with_Logo.jpg",
  "description": "It’s lighter than Logitech’s G Pro X Superlight.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}