{
  "title": "Read Tim Cook’s email to employees on Ukraine",
  "url": "https://www.theverge.com/2022/3/1/22957538/apple-tim-cook-ukraine-email-employees",
  "date": "2022-03-02T02:57:47.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/i-FOBrV3BSerBECJ43IrUcC2SkE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70567968/acastro_180604_1777_apple_wwdc_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ZGZIAj\">Tim Cook sent out an email to employees this morning addressing the Russian invasion of Ukraine and explaining the actions Apple has taken in reaction to <a href=\"https://www.theverge.com/2022/2/28/22954857/russia-invades-ukraine-news-updates\">the events of the past two weeks</a>. The email also tells employees that Apple will be matching donations they make to certain humanitarian relief funds two to one, and will do so retroactively for donations made since February 25th.</p><p id=\"CM1UuE\">A copy of this email was obtained by <em>The Verge</em>, and you can read it below in full (with the exception of an internal Apple email address being redacted):</p><blockquote><p id=\"ULBwtG\">I wanted to take a moment to address the ongoing crisis in Ukraine.</p><p id=\"dO46Tq\">I know I speak for everyone at Apple in expressing our concern for all of those affected by the violence. With each new image of families fleeing their homes and brave citizens fighting for their lives, we see how important it is for people around the world to come together to advance the cause of peace.</p><p id=\"jimeFQ\">Apple is donating to humanitarian relief efforts and providing aid for the unfolding refugee crisis. We are also working with partners to assess what more we can do. I know that many of you are eager to find ways to support as well, and we want to help amplify the impact of your donations. Starting today, Apple will match your donations at a rate of 2:1 for eligible organizations, and we will make this retroactive for donations to those organizations since February 25. Please visit the Employee Giving Portal to learn more.</p><p id=\"TKulTM\">We are working to support our teams in Ukraine and across the region. In Ukraine, we have been in contact with every employee, assisting them and their families in any way we can. For our Ukrainian team members located outside of the country that may need support, please contact [email redacted]. And for any employee who needs any support, please visit the People site for available resources.</p><p id=\"j1UX9P\">As a company, we are taking additional actions as well. We have paused all product sales in Russia. Last week, we stopped all exports into our sales channel in the country. Apple Pay and other services have been limited. RT News and Sputnik News are no longer available for download from the App Store outside Russia. And we have disabled both traffic and live incidents in Apple Maps in Ukraine as a safety and precautionary measure for Ukrainian citizens.</p><p id=\"01Sg5C\">We will continue to evaluate the situation and are in communication with relevant governments on the actions we are taking.</p><p id=\"teUuxH\">This moment calls for unity, it calls for courage, and it reminds us that we must never lose sight of the humanity we all share. In these difficult times, I take comfort in knowing that we are united in our commitment to each other, to our users, and to being a force for good in the world.</p></blockquote><p id=\"TsATa9\">As Cook highlights in his email (and as Apple has mentioned in public statements), Apple has taken a variety of actions in the region. On Tuesday it announced that it’s <a href=\"https://www.theverge.com/2022/3/1/22957000/apple-russia-ukraine-invasion-halt-product-sales-app-store\">halting the sale of its products in Russia</a>. It’s also limited Apple Maps data sharing in Ukraine and <a href=\"https://www.theverge.com/2022/2/26/22952191/russian-bank-customers-apple-pay-google-pay-financial-sanctions-ukraine\">Apple Pay</a> use in Russia.</p><p id=\"vYsMbN\">Cook also mentions that Apple has been in contact with “every employee” based in Ukraine, and is working to help them and their families. Internally, some employees have discussed getting their families out of Ukraine.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OrCEcxQRSQP5T2C0miJ8ruYHs0E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477049/acastro_180604_1777_apple_wwdc_0002.jpg",
  "description": "The company promises humanitarian aid",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}