{
  "title": "Read exactly how Microsoft’s $68.7 billion deal for Activision Blizzard came together",
  "url": "https://www.theverge.com/22941636/microsoft-activision-blizzard-acquisition-sec-filing-came-together",
  "date": "2022-02-19T03:54:34.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vW1idDVKlkXTd6EgQCnMYb4_EU4=/0x0:2500x1667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70528054/vpavic_070616_1091_0165.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"SGp2HD\">Microsoft shocked the tech and gaming world <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">on January 18th</a> when it announced it would acquire Activision Blizzard in a $68.7 billion deal, by far the biggest ever in gaming. Activision Blizzard, one of the most storied developers on the planet, had been reeling for months from multiple scandals, including <a href=\"https://www.theverge.com/2021/7/22/22588215/activision-blizzard-lawsuit-sexual-harassment-discrimination-pay\">California’s lawsuit accusing</a> the company of creating a culture of “constant sexual harassment,” an explosive <em>Wall Street Journal</em> report <a href=\"https://www.theverge.com/2021/11/16/22785457/activision-blizzard-bobby-kotick-ceo-wall-street-journal-wsj-report-allegations\">suggesting CEO Bobby Kotick was both aware of that harassment</a> and that he himself was accused of mistreatment by women, as well as <a href=\"https://www.theverge.com/2021/12/6/22820549/activision-blizzard-raven-software-layoffs-walkout-call-of-duty\">labor protests from <em>Call of Duty</em> workers</a>.</p><p id=\"m4kliQ\">Microsoft’s Phil Spencer, at the time the company’s Xbox chief, reportedly responded to the accusations from the <em>WSJ</em> article <a href=\"https://www.theverge.com/2021/11/18/22789881/microsoft-xbox-boss-phil-spencer-deeply-troubled-by-activision-blizzard-bobby-kotick\">two days later</a> in an email to Xbox staff, saying he was “disturbed and deeply troubled by the horrific events and actions” at Activision Blizzard and that Microsoft is “evaluating all aspects of our relationship with Activision Blizzard and making ongoing proactive adjustments.” But based on a timeline of the acquisition Activision Blizzard has now laid out in <a href=\"https://www.sec.gov/Archives/edgar/data/718877/000110465922025210/tm225196-3_prem14a.htm\">its official merger proposal</a> to its own shareholders (<a href=\"https://www.cnbc.com/2022/02/18/microsofts-activision-talks-started-after-reporting-on-sex-misconduct.html\">via CNBC</a>), it seems that Spencer’s idea of changing the relationship with Activision Blizzard was to almost immediately offer to purchase the troubled company. </p><p id=\"RKKXsK\">And, according to the documents, he wasn’t the only one interested in a deal.</p><div class=\"c-float-right\"><aside id=\"y4F6XO\"><q>The initial conversation happened on November 19th — just three days after the WSJ’s bombshell report</q></aside></div><p id=\"F7OpBN\">The initial conversation about an acquisition happened between Spencer and Kotick on November 19th, just three days after the <em>WSJ’s</em> report about the Activision Blizzard CEO and a single day after Spencer said told Xbox staff he was “deeply troubled.” It might have even come up as part of the same conversation.</p><p id=\"SwMNYm\">“In the course of a conversation on a different topic between Mr. Spencer and Mr. Kotick, Mr. Spencer raised that Microsoft was interested in discussing strategic opportunities between Activision Blizzard and Microsoft and asked whether it would be possible to have a call with Mr. Nadella the following day,” the document reads. The next day (a Saturday), Microsoft CEO Satya Nadella was apparently more explicit, indicating that “Microsoft was interested in exploring a strategic combination with Activision Blizzard.” </p><p id=\"sGtslO\">That kicked off nearly two months of conversations between Microsoft and Activision Blizzard into what would become the acquisition announced on January 18th, and you can read the whole blow-by-blow over the course of ten pages in <a href=\"https://www.sec.gov/Archives/edgar/data/718877/000110465922025210/tm225196-3_prem14a.htm#tTHME\">Activision Blizzard’s filing</a>, beginning on page 31. (The copy of the document embedded at the bottom of this article should begin there.) I’ve always wondered what goes on behind the scenes to make these sorts of mega-acquisitions happen, and the document provides an illuminating look at the wheeling and dealing to pull this deal together.</p><p id=\"0MjXpJ\">One thing I found interesting was that Activision Blizzard was in touch with four other companies and one individual about some sort of deal in addition to Microsoft. Disappointingly, they are only named as companies A, C, D, and E, and the individual is named as “Individual B,” so we don’t know who else could have ended up owning <em>Call of Duty</em>. None of those deals went through for various reasons — Company E, for example, said it couldn’t do a full acquisition of Activision Blizzard — and Microsoft was rapidly and aggressively pursuing its deal, getting the terms together before some other companies had even entered the picture.</p><div class=\"c-float-right\"><aside id=\"g2Shkf\"><q>If the deal is terminated, someone is paying billions</q></aside></div><p id=\"hzGssc\">Activision Blizzard’s SEC filing also includes the terms of the merger agreement, which shows that Microsoft would be on the hook if the merger gets blocked by government regulators — it would pay Activision Blizzard a termination fee ranging from $2 billion to $3 billion if the acquisition is axed due to an “Injunction arising from Antitrust Laws.” If Activision Blizzard’s shareholders do not vote to approve the merger, though, it might have to pay Microsoft a termination fee of $2.27 billion.</p><p id=\"jR9wth\">While it’s unusual for mergers like these to get actively blocked, we do have a recent example: Nvidia’s $40 billion deal to acquire Arm from SoftBank fell apart due to regulatory challenges. The Federal Trade Commission (FTC), <a href=\"https://www.theverge.com/2021/12/2/22814633/nvidia-arm-purchase-semiconductor-ftc-40-billion-lawsuit-block-deal\">which sued to block Nvidia’s purchase of Arm</a>, specifically noted in a statement this week <a href=\"https://www.ftc.gov/news-events/press-releases/2022/02/statement-termination-of-nvidia-attempted-acquisition-of-arm-ltd\">that the failed merger</a> “represents the first abandonment of a litigated vertical merger in many years.” While Microsoft says it’s still early in the Activision Blizzard deal — it’s “so early in the process that we’re not yet at a point where we’re getting any real feedback [from the FTC],” Microsoft president Brad Smith told reporters, <a href=\"https://www.cnn.com/2022/02/18/tech/microsoft-activision-blizzard-ftc-antitrust/index.html\">according to <em>CNN</em></a><em> — </em>there’s always the possibility that the FTC and other regulatory bodies intervene.</p><p id=\"uyMJra\">While Kotick is <a href=\"https://www.wsj.com/articles/microsoft-to-buy-activision-blizzard-games-11642512435?mod=e2tw\">expected to leave the company</a> should the deal go through, the document also shows he’ll leave with a tremendous fortune either way: with 4,317,285 shares in Activision Blizzard, he stands to gain $410,142,075 based on the $95 per share that Microsoft plans to pay — and he has an additional “golden parachute” worth $14,592,302 if he decides to stay and Microsoft then pushes him out anyway. That doesn’t count his 2.2 million stock options, either, which could be worth hundreds of millions of additional dollars depending on how much they cost to exercise.</p><p id=\"30ZSbh\">The document also reveals that <em>Call of Duty: Vanguard</em>, 2021’s annual release in the mega-popular series, underperformed and failed to meet its fourth quarter projections.</p><p id=\"ZA3qii\"><em>Disclosure: Casey Wasserman is on the board of directors for Activision Blizzard as well as the board of directors of Vox Media, The Verge’s parent company.</em></p><div id=\"stMgit\"><div class=\"DC-embed\" >  <div >    Page 42 of <a class=\"DC-embed-resource\"  href=\"https://embed.documentcloud.org/documents/21270320-activision-blizzard-form-prem14a/#document/p42\" title=\"View entire Activision Blizzard Form PREM14A on DocumentCloud in new window or tab\" target=\"_blank\"> Activision Blizzard Form PREM14A</a>  </div>  <img src=\"s3.documentcloud.org/documents/21270320/pages/activision-blizzard-form-prem14a-p42-xlarge.gif?ts=1645238014\" alt=\"Page 42 of Activision Blizzard Form PREM14A\" >  <div >    Contributed to <a href=\"https://www.documentcloud.org\" title=\"Go to DocumentCloud in new window or tab\" target=\"_blank\" >DocumentCloud</a> by The Verge (Vox.com) • <a  href=\"https://embed.documentcloud.org/documents/21270320-activision-blizzard-form-prem14a/#document/p42\" title=\"View entire Activision Blizzard Form PREM14A on DocumentCloud in new window or tab\" target=\"_blank\">View document</a> or <a  href=\"s3.documentcloud.org/documents/21270320/pages/activision-blizzard-form-prem14a-p42.txt?ts=1645238014\" title=\"Read the text of page 42 of Activision Blizzard Form PREM14A on DocumentCloud in new window or tab\" target=\"_blank\">read text</a>  </div></div><script src=\"https://www.documentcloud.org/embed/enhance.js\"></script></div><p id=\"fPYEUS\"><em><strong>Correction February 19th, 11:55AM ET</strong></em><em>: The </em>Wall Street Journal’s<em> Bobby Kotick profile reports that women accused him of harassment, including one instance where he fired a woman who was allegedly being sexually harassed by his pilot, but doesn’t suggest he sexually harassed employees himself. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_wbu8OtKBsWa1nmucL_pJ0Z7KFU=/0x180:2500x1489/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16333233/vpavic_070616_1091_0165.jpg",
  "description": "There were nearly two months of negotiations.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}