{
  "title": "Realme 9 Pro and Pro Plus announced with color-changing new design",
  "url": "https://www.theverge.com/2022/2/16/22936918/realme-9-pro-plus-launch-specs-details-camera-color",
  "date": "2022-02-16T09:00:00.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/e0G2BUBUIfObn9Fe8M0wBKHCyl8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70515634/IMG_2020.0.jpg\" />        <figcaption>The “sunrise blue” Realme 9 Pro Plus turns red in sunlight.</figcaption>    </figure>  <p id=\"h7i4Zh\">Realme has announced the Realme 9 Pro and Pro Plus, two new phones that now sit at the top of its extremely popular mid-range numbered series. We <a href=\"https://www.theverge.com/22372644/realme-8-pro-review-price-specs\">reviewed the 8 Pro last year</a> and found it to be one of the best value phones available anywhere — except the US, of course, where Realme doesn’t have a presence. </p><p id=\"cuHOpx\">The two new 9 Pro phones are big upgrades on the 8 Pro. The physical design is all new, combining thin flat sides with a curved back panel that, at least on the “sunrise blue” model, uses a photochromic layer that changes color under exposure to sunlight. Take the phone outside on a reasonably sunny day and it’ll change from blue to a reddish tint in a matter of seconds. Vivo, which shares the same BBK ownership as Realme, launched a phone with a similar effect <a href=\"https://www.theverge.com/2022/1/5/22868114/vivo-v23-pro-announced-india-specs-price\">earlier this year</a>.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ESJay1cMsLncZ-hkGLWv0m67cOc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23249159/IMG_2015.jpg\">      <figcaption>This is the same phone as the one in the first image. It’s blue until you take it outside.</figcaption>  </figure><p id=\"Ut2C1m\">The headline feature on the 9 Pro Plus is its 50-megapixel primary camera, which has optical image stabilization and uses the same Sony IMX766 sensor found in some BBK flagship phones from last year like the OnePlus 9 Pro and the Oppo Find X3 Pro. It’s a large 1/1.56” sensor with 2.0µm pixels, though its performance will of course be affected by how Realme has tuned the software. The main cameras are backed by a 119-degree ultrawide and a macro lens; the non-Plus 9 Pro’s main camera has an unspecified 64-megapixel sensor that doesn’t have OIS and is presumably physically smaller.</p><p id=\"Dk2N0X\">The spec differences between the 9 Pro and the 9 Pro Plus are actually quite unusual, because the Plus isn’t necessarily better across the board. The 9 Pro Plus has a 90Hz OLED screen, a MediaTek Dimensity 920 processor, and a 4,500mAh battery that fast-charges at 60W. The 9 Pro, meanwhile, has a 120Hz LCD, a Snapdragon 695 processor, and a 5,000mAh battery with 33W fast charging. The 9 Pro Plus’ OLED screen with an in-display fingerprint sensor is really what marks it out as the more flagship-aping device.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lMHQba1kFjptgrZuzENEGjw7uvM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23249160/IMG_2021.jpg\">      <figcaption>The Realme 9 Pro phones combine curved back panels with flat edges.</figcaption>  </figure><p id=\"jRAjPs\">Realme hasn’t provided pricing or release information for the 9 Pro and 9 Pro Plus yet. Launch markets are likely to include India and Europe.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZRrudBMjRxcLnXBLfVTE9cQa8tU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23249158/IMG_2020.jpg",
  "description": "A big upgrade on the good-value 8 Pro.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}