{
  "title": "Reddit’s new Discover tab pushes the app into the modern social media era",
  "url": "https://www.theverge.com/2022/2/24/22947781/reddit-discover-tab-mobile-app-social-media-feature",
  "date": "2022-02-24T14:14:25.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/bSfgzZDlthNpGzqbI5iPQRwloFY=/908x0:4409x2334/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70544519/Blog_Header.0.png\" />        <figcaption>Image: Reddit</figcaption>    </figure>  <p id=\"yV0V9j\">Reddit today <a href=\"https://www.redditinc.com/blog/introducing-our-discover-tab-a-new-way-to-use-reddit-and-find-more-communities\">introduced a new Discover tab</a> feature for the official Reddit iOS and Android apps. The new feature curates pictures, GIFs, and videos in a scrollable grid to help Reddit users find new content and communities that they may be interested in, in a way that’s reminiscent of Instagram’s explore page or Pinterest.</p><p id=\"WEkH3A\">The Discover tab replaces the Communities / Subscriptions tab in both iOS and Android as the second icon on the bottom, represented by a compass icon. While this means that now you can’t access a list of your subscribed communities from the bottom, fret not — you can still get to your subscribed community list by swiping in a drawer from the left (and yes, r/all is still there). There’s also a new slide-over from the right for your profile, where you can change your online status, look at your posts, and more.</p><div class=\"c-float-right\"><aside id=\"0DgdDK\"><q>At first glance, the grid of media in Reddit’s Discover tab is very Instagram or Pinterest-esque</q></aside></div><p id=\"hkuqMo\">“The corpus of content and communities on Reddit is pretty vast,” said Jason Costa, Reddit’s director of product for community and content. Costa described Reddit as traditionally having a heavy emphasis on text-based expression, yet Costa believes that there was an opportunity to showcase the rich multimedia content within communities as context. “[I]n particular, there’s not really a place on Reddit where you can go and easily discover great video content, great imagery content, great GIF content,” Costa said. Reddit was evaluating the use of the Communities button, and Costa said that’s how the location of the Discover tab came to be. Since the profile slide-over from the left already existed, the subscriptions list and favorites were moved there. “We think the community drawer is a real improvement over the existing tab,” Costa said.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C7oj8qZUzUHqqkEi9m0c_nx4gYU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23267790/Discover_Tab_Feed_.jpg\">      <cite>Image: Reddit</cite>      <figcaption><em>Discover tab helps you find new communities using pictures / videos. You can scroll through topics on the top from left to right.</em></figcaption>  </figure><p id=\"fsKrTA\">“I personally think users are going to discover and join more communities as a result of this. And I think the old and new Redditors alike are gonna find really interesting and compelling content that resonates with them.” Costa said. In testing, users that tried the Discover tab subscribed to at least one additional community vs. those that didn’t use it, “which is exactly what we were hoping for,” Costa explains “they would discover, and... traverse the breadth of the corpus of content communities on the site. So you know, that alone, as a signal, gets us really excited for you know, what old and new users are going to do with [it].”</p><div class=\"c-float-right\"><aside id=\"hFjFG1\"><q>“I think we’re thinking through more broadly this year, what our developer platform strategy could look like.”</q></aside></div><p id=\"XfvOv2\">The Discover tab kind of feels like a replacement for r/all, but it turns out the longtime cumulative subreddit of all subreddits is sticking around. Costa confirmed Discover is not a replacement for r/all and that they will continue to coexist, saying, “I think Discover tab is a pretty unique and differentiated experience.” The Discover tab adjusts to your current interests, so If you subscribed to a lot of football subs and spend a lot of time in baseball subs, you’re going to start seeing more sports-related content in the Discover tab.</p><div id=\"hS318R\"><div data-anthem-component=\"imageslider:11064312\"></div></div><p id=\"4YX2rG\">Finally, with regards to third-party Reddit clients like Apollo, Relay, and BaconReader, it looks like the Discover feature won’t make it there: “You know, I think we’re thinking through more broadly this year, what our developer platform strategy could look like. But for the Discover tab, specifically, no plans to expose an API at this time,” Costa said.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/oBZZTGWX3RGwDlKeclb6a1LmXA8=/429x0:4887x2334/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23267787/Blog_Header.png",
  "description": "Reddit’s new Discover tab scrolls like Pinterest on mobile.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}