{
  "title": "Reddit is spending $1 million to fund its users’ best ideas and competitions",
  "url": "https://www.theverge.com/2022/4/26/23042665/reddit-community-funds-projects",
  "date": "2022-04-26T15:38:32.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/fvnqx9FycclY1DT-sNj7TmZhGiQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70795067/acastro_180413_1777_reddit_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"j5BfE8\">Reddit is <a href=\"https://www.redditinc.com/blog/bringing-community-ideas-to-life-with-community-funds#\">expanding its Community Funds program</a>, the company announced this week, and  it plans to spend $1 million funding various projects across the platform. “We will invite communities to submit ideas for projects, events, contests, giving, almost anything you can think of to bring people together for inspiration and delight,” the company said in its announcement. Projects can ask for between $1,000 and $50,000, and Reddit will start issuing grants in June.</p><p id=\"2zmuom\">In a way, this is Reddit’s version of the creator funds that Facebook, Snapchat, TikTok, YouTube, Spotify, and, well, pretty much everybody has been offering to people using their platforms. And, in that sense, Reddit’s commitment here is pretty small: Facebook <a href=\"https://www.theverge.com/2021/7/14/22577242/facebook-1-billion-payments-creators-2022\">pledged to spend $1 billion</a> on creator-related funding, and Snap was at one point throwing <a href=\"https://www.theverge.com/2020/11/23/21585513/snapchat-snap-spotlight-creators-app-update-tiktok\">$1 million a day</a> at the things people were making on the platform. There are a lot of places to make things online, and one way to get them to make them for you is to back a dump truck full of money up to their house!</p><p id=\"sGbCq4\">But since Reddit’s not a creator-focused platform in the same way — the best thing about Reddit isn’t the individual users, it’s the subreddits — it seems to be trying to help groups do stuff without over-involving itself in the process. Over the last few months, as it has experimented with the Community Funds idea, Reddit paid for two billboards that displayed art from the winners of <a href=\"https://www.reddit.com/r/bangtan/comments/rmxgl7/211223_announcing_permission_to_billboard_ptb_a/\">a BTS subreddit contest</a>, ponied up the prize money for a couple of other competitions, helped the <a href=\"https://www.reddit.com/r/Random_Acts_Of_Amazon/\">Random Acts of Amazon</a> crew buy kids Christmas presents, and funded several other projects. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/f9p7uydUZhChWZ9MF6KleB_ZoTA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417133/Community_funds_program_header_V03_22x_2022_04_21_233002_nawv.png\">      <cite>Image: Reddit</cite>      <figcaption><em>Reddit is funding projects and competitions around the platform.</em></figcaption>  </figure><p id=\"2ZCZ0w\">The money surely helps gin up interest in those projects (and, by extension, gets more people using Reddit) but in a slightly more circuitous way than your average “thanks for going viral, here’s some money!” creator fund. Though it might also be a way for Reddit to create its own kind of viral hits; those BTS billboards <a href=\"https://www.adweek.com/social-marketing/redditors-to-design-billboards-celebrating-bts-in-los-angeles-new-york/\">were big news</a>, for instance, and a win for Reddit and its community-first story. For a company often thought of as a place for trolls, memestockers, and <a href=\"https://www.reddit.com/r/AmItheAsshole/\">assholes</a>, every heartwarming story about a cool community doing cool work is a big win.</p><p id=\"1AsTlx\">It’s going to be fascinating to see which kinds of projects Reddit funds. When it first <a href=\"https://www.reddit.com/r/CommunityFunds/comments/qh97ce/welcome_to_community_funds/\">announced the Community Funds test</a> last fall, it offered some examples of what it was looking for: “online conferences, outdoor festivals, workshops, books, magazines, cultural or heritage programs, short films or musical productions.” Since then, Redditors have also asked for money to <a href=\"https://www.reddit.com/r/CommunityFunds/comments/s6ns79/we_want_to_do_something_to_mark_the_very_near/\">give away Costco memberships</a>, money <a href=\"https://www.reddit.com/r/CommunityFunds/comments/rudo6e/cats_community_calendar/\">for cat calendars</a>, money <a href=\"https://www.reddit.com/r/CommunityFunds/comments/toyfxz/community_funds_request_for_rlotr_on_prime/'\">to give away <em>Lord of the Rings</em> books</a>, and money <a href=\"https://www.reddit.com/r/CommunityFunds/comments/tp5tsw/horse_and_animal_welfare_in_ukraine_requestrian/\">for equestrian welfare in Ukraine</a>. There’s presumably much more to come in the next few months, but one thing’s for sure: Reddit’s going to spend its $1 million in a deeply weird and extremely Reddit-y way. I can’t wait to see what wild project the r/WallStreetBets crew tries to get $50,000 to pull off.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eH0lJDgbIhWqV_zE2rjnVTkaoQE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10646761/acastro_180413_1777_reddit_0001.jpg",
  "description": "From a BTS billboard contest to Random Acts of Amazon.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}