{
  "title": "Reggie Fils-Aimé doesn’t believe in Meta’s verse",
  "url": "https://www.theverge.com/2022/3/14/22977987/reggie-fils-aime-nintendo-facebook-meta-metaverse-oculus-interview",
  "date": "2022-03-14T22:45:41.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"Reggie Fils-Aimé sitting on stage at South by Southwest with journalist Emily Chang.\" src=\"https://cdn.vox-cdn.com/thumbor/1oEM8EzrrdICMiYRGo8dZ5EhulQ=/0x0:2397x1598/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70622928/Screen_Shot_2022_03_14_at_13.19.23.0.png\" />        <figcaption>“Facebook itself is not an innovative company,” said the former Nintendo boss. | Image: <em>Bloomberg</em></figcaption>    </figure>  <p id=\"DyuDKd\">Reggie Fils-Aimé (who led Nintendo of America before <a href=\"https://www.theverge.com/2019/2/21/18235073/nintendo-america-president-reggie-fils-aime-retirement-doug-bowser\">Bowser took over</a>) isn’t impressed with the company <a href=\"https://www.theverge.com/22749919/mark-zuckerberg-facebook-meta-company-rebrand\">formerly known as Facebook</a>, or its idea of the metaverse. He lobbed a few fireballs in Mark Zuckerberg’s direction during <a href=\"https://www.bloomberg.com/news/articles/2022-03-13/facebook-s-metaverse-vision-questioned-by-gaming-veteran?sref=ExbtjcSG\">an interview with <em>Bloomberg</em>’s Emily Chang</a> at South by Southwest over the weekend, saying that Meta isn’t innovative and that it bought or copied almost all of its interesting ideas.</p><p id=\"hyzO90\">Just so we’re all on the same page when discussing this concept, Fils-Amié defines the metaverse as “a digital space where you interact with your friends in a social and gaming type of environment” during his interview. (You can also read <a href=\"https://www.theverge.com/22701104/metaverse-explained-fortnite-roblox-facebook-horizon\">our great explainer on the idea here</a> if you want to go deeper.) In general, Fils-Amié doesn’t seem terribly down on it — he says that Roblox is an example of something where elements of the metaverse already exist. </p><div class=\"c-float-right\"><aside id=\"RnHEOa\"><q>He doesn’t think you’ll spend “100 percent of your time, or even 100 percent of your entertainment time” in VR.</q></aside></div><p id=\"4wEY0A\">When it comes to the idea that Mark Zuckerberg’s trying to sell us all on, though, he’s not convinced. “I’m not a buyer of that idea. I don’t think that their current definition is going to be successful. I say that because, first... and I don’t know if anyone from Facebook is here, but you have to admit that Facebook itself is not an innovative company. They’re not.”</p><p id=\"jgFkqp\">After the crowd was finished applauding Fils-Amié for his dunk — yes, really — he continued, saying that Meta has “either acquired really interesting things, like Oculus, like Instagram, or they’ve been a fast follower of other people’s ideas.” (He does credit the company with “the very original social platform that was created many years ago,” but <a href=\"https://www.theverge.com/2022/2/20/22943279/facebook-whistleblower-climate-change-misinformation-frances-haugen-sec\">who wants to be known for <em>that</em></a> these days?) Returning to the company’s plans for the metaverse, he commented “that’s why I look at the vision that’s been to date articulated, and I’m not a believer.”</p><p id=\"0SMyET\">When Chang asked if he thought people would spend all day in a virtual reality headset made by anyone, not just Meta, he said no. He said that even though he’s tried “just about every VR device, and just about every VR experience, I don’t think [VR]’s ready for prime time yet. Doesn’t mean it’s not going to get there, but I don’t believe that it’s going to be an experience that you’re doing 100 percent of your time, or even 100 percent of your entertainment time.” </p><p id=\"Pbk14f\">Instead, he sees people using augmented reality throughout the day to interact with their digital worlds and friends, while still being present in the physical world — perhaps like the <a href=\"https://www.theverge.com/2021/7/6/22565654/pokemon-go-5-billion-fifth-anniversary-revenue-analytics\">massively successful <em>Pokémon Go</em></a>, which he cites as a shining example of AR during the interview.</p><div><aside id=\"HoP0p6\"><q>“When I was running Nintendo, that was a good year, one year, in terms of hardware sell through.”</q></aside></div><p id=\"6BT6Yu\">Part of Fils-Amié’s doubts for VR also comes down to sales volume — he noted that, the last he heard, the all-time sales numbers for VR devices were around 20 million in total. He then proceeded to absolutely flex on the VR industry by saying that, under his watch, that would’ve made a good single year of <a href=\"https://www.theverge.com/2022/3/12/22974056/nintendo-switch-top-selling-console-february-2022\">hardware sales at Nintendo</a>. (Ouch.) </p><p id=\"jj1V1o\">So what does Fils-Amié think the future looks like? <em>Fortnite</em>, apparently, but with more AR elements. “I think the types of experiences are going to continue to innovate and be new and different. The example I use is <em>Fortnite</em>. This type of battle royale experience has only been in the marketplace four years, and we take it for granted. Four years ago that didn’t exist.” In the next four years, he thinks we’ll see new, “incredibly compelling” game experiences, and a lot more blending of the physical and digital world — he just doesn’t think that digital world will come from Meta.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0ONlxinyMqyorQ57EqBj0_DC6do=/0x0:2880x1508/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23315808/Screen_Shot_2022_03_14_at_13.19.23.png",
  "description": "\"Facebook itself is not an innovative company.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}