{
  "title": "Renewable energy growth in the US lags far behind Biden’s climate ambitions",
  "url": "https://www.theverge.com/2022/2/16/22937248/biden-climate-goals-renewable-energy-growth-us-lags-solar-wind-batteries",
  "date": "2022-02-16T19:07:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Alta Wind, Windmills produce renewable energy in Mojave Desert outside of Lancaster, California\" src=\"https://cdn.vox-cdn.com/thumbor/rarE7XsmgtO1eLn25SGzrk8qJeU=/2x0:5462x3640/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70517714/1262738334.0.jpg\" />        <figcaption>Alta Wind, Windmills produce renewable energy in Mojave Desert outside of Lancaster, California. | Photo by: Visions of America/Education Images/Universal Images Group via Getty Images</figcaption>    </figure>  <p id=\"pewl8b\">Renewable energy growth in the US in 2021 fell far short of what’s needed to reach climate goals, according to a new <a href=\"https://cleanpower.org/news/u-s-surpasses-200-gigawatts-of-total-clean-power-capacity-but-the-pace-of-deployment-has-slowed-according-to-acp-4q-report/\">report</a> by trade group American Clean Power. </p><p id=\"lHBwjU\">The US installed close to 28 gigawatts (GW) of wind, solar, and energy storage capacity last year — which ACP says is less than half of what’s needed to reach Joe Biden’s goal of a carbon pollution-free power grid by 2035. It’s also a 3 percent drop from 2020’s record rate of clean energy installations, as the US wind and solar industries trudged through supply chain disruptions, rising commodity prices and shipping costs, and policy uncertainty last year. </p><div class=\"c-float-right\"><aside id=\"qSqawz\"><q>There were unique roadblocks for wind and solar deployment in the US</q></aside></div><p id=\"3Xcklu\">Globally, 2021 still managed to set a <a href=\"https://www.theverge.com/2021/12/1/22811869/renewable-energy-electricity-record-growth-2021-supply-chain-problems\">record</a> for renewable energy growth. But there were unique roadblocks for wind and solar deployment in the US. Last June, the Department of Homeland Security cracked down on goods made with silica tied to human rights abuses in China’s Xinjiang Uyghur Autonomous Region. Customs agents began <a href=\"https://pv-magazine-usa.com/2021/08/19/customs-enforcement-is-jeopardizing-2-1-gw-of-solar-projects/#:~:text=The%20Withhold%20Release%20Order%20instructs,arrive%20at%20a%20U.S.%20port\">seizing</a> solar panels and other <a href=\"https://www.cbp.gov/newsroom/national-media-release/department-homeland-security-issues-withhold-release-order-silica\">silica-based products from a Chinese company</a> facing allegations of forced labor. That could continue to “further delay projects or even lead to their cancellation,” ACP says in its report. Xinjiang produces about <a href=\"https://www.shu.ac.uk/helena-kennedy-centre-international-justice/research-and-projects/all-projects/in-broad-daylight\">45 percent</a> of the world’s solar-grade polysilicon, and the blacklisted company is the <a href=\"https://www.scmp.com/economy/china-economy/article/3139062/us-ban-chinas-xinjiang-solar-products-linked-alleged-forced\">region’s largest producer</a>. </p><p id=\"NLSq0F\">Wind energy had a different problem. After a massive jump in new wind farms in 2020, there was a 25 percent drop in installations last year. As COVID-19 lockdowns delayed construction, the industry <a href=\"https://acore.org/clean-energy-sector-calls-on-congress-for-help-surmounting-the-impacts-of-the-covid-19-pandemic/\">lobbied</a> the Biden administration to extend a key tax credit for wind projects that was set to expire in 2020. They ultimately got a one-year <a href=\"https://www.eia.gov/todayinenergy/detail.php?id=46576\">extension</a>, but the initial uncertainty was enough to curb growth.</p><p id=\"LDWhVa\">There was a silver lining to 2021: batteries had a remarkable year. Utility battery storage installations grew by a whopping 196 percent in the US. Energy storage is the linchpin for a clean grid; batteries make solar and wind energy available when gusts calm and sunshine fades. And we still <a href=\"https://www.theverge.com/2021/8/19/22632172/large-battery-power-capacity-us-grew-2020\">need a hell of a lot more</a> of them. Today, the large-scale battery power capacity in the US is roughly equivalent to the capacity of just a few large power plants.</p><div class=\"c-float-left\"><aside id=\"tgV31n\"><q>Batteries had a remarkable year</q></aside></div><p id=\"ZR8GdU\">A significant amount of renewable energy capacity that was supposed to come online last year was delayed by a year or two. As a result, the development pipeline was nearly 50 percent bigger at the close of 2021 than it was at the end of 2020. </p><p id=\"omPtG6\">Texas leads as the state with the most renewable energy projects in development. It also far outranked other states for the most renewable energy installations last year, with 7,352 megawatts (MW) added compared to California coming in second at 2,697 MW added. (A megawatt is one one-thousandth of a gigawatt.) As the ACP report notes, “Texas is looking to become the undisputed clean power hub” of the nation. </p><p id=\"K9q6ms\">To be sure, the 27.7 GW of clean energy added across the US in 2021 still amounts to the second-largest annual addition of wind, solar, and energy storage on record after 2020, a testament to the technology’s maturity and the dramatic drop in costs over the last few decades. There’s now enough clean energy capacity in the US to power 56 million homes. But that needs to grow by tens of millions of households over the next decade or so to avert the worst effects of climate change.</p><p id=\"RrxNvn\">“Although the US has reached this incredible achievement, more needs to be done, at a faster pace, to reach the climate goals and targets our country needs to achieve,” ACP CEO Heather Zichal said in a statement.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fy9N8xeTENd9J2fJJrMimZ3TWhU=/0x390:5464x3251/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23250077/1262738334.jpg",
  "description": "Supply chain kinks and rising costs posed problems in 2021.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}