{
  "title": "Rep. Marjorie Taylor Greene throws support behind Section 230 repeal bill",
  "url": "https://www.theverge.com/2022/4/28/23046880/elon-musk-twitter-marjorie-taylor-greene-section-230-repeal-hagerty",
  "date": "2022-04-28T18:29:45.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"Rep. Marjorie Taylor Greene Holds Press Conference On Elon Musk Buying Twitter\" src=\"https://cdn.vox-cdn.com/thumbor/AOfjQxThV6IDZvzUamc_6NcZsq8=/0x2:8192x5463/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70805954/1394252400.0.jpg\" />        <figcaption>Photo by Win McNamee/Getty Images</figcaption>    </figure>  <p id=\"FwUqaU\">Standing beside a poster-sized printout of her suspended Twitter account, Rep. Marjorie Taylor Greene (R-GA) introduced a new bill on Thursday to abolish Section 230 — the hotly debated law that protects tech companies from liability over what users post on their platforms.</p><p id=\"hzrUZQ\">Titled the <a href=\"https://thehill.com/news/house/3470022-greene-offers-bill-to-abolish-section-230/?rl=1\">21st Century FREE Speech Act</a>, Greene’s measure serves as the House companion to a Senate version of <a href=\"https://www.theverge.com/22442359/republican-common-carrier-social-media-facebook-trump-ban-antitrust-section-230\">the bill introduced by Sen. Bill Hagerty (R-TN) last year</a>. The bill would repeal <a href=\"https://www.theverge.com/21273768/section-230-explained-internet-speech-law-definition-guide-free-moderation\">Section 230</a> and replace it with language requiring “reasonable, non-discriminatory access to online communications platforms” by classifying them as “common carriers.”</p><p id=\"fJclku\">Greene’s announcement comes days after Elon Musk won a bid to take Twitter private at $54.20 a share, with Musk vowing to annoy lefties and right-wingers alike in a new effort to make the platform “politically neutral.” Greene’s personal Twitter account was <a href=\"https://www.theverge.com/2022/1/2/22863583/twitter-marjorie-taylor-greene-banned-covid-19-misinformation\">permanently suspended</a> for violating the platform’s policies against COVID-19 misinformation earlier this year. During a Thursday press conference, Greene said she spent months analyzing several bills targeting Big Tech censorship. After Musk’s Twitter bid was accepted this week, she rushed to find a bill to support, landing on Hagerty’s measure. </p><div class=\"c-float-right\"><aside id=\"UItwCI\"><q>“Elon Musk buying Twitter and talking about defending free speech has ramped up the Democrats’ efforts to want to clamp down on speech”</q></aside></div><p id=\"gF22kq\">“Elon Musk buying Twitter and talking about defending free speech has ramped up the Democrats’ efforts to want to clamp down on speech,” Greene said.  “That made me realize, you know, that I need to introduce this now.”</p><p id=\"oA76Tt\">Greene applauded Musk’s takeover in a hopeful <a href=\"https://twitter.com/RepMTG/status/1518567498148417536?s=20&amp;t=hPhD3_7L724waPOKdBxZeA\">tweet on Monday</a>, writing, “Prepare for blue check mark full scale meltdown after [Musk] seals the deal and I should get my personal Twitter account restored.”</p><p id=\"VN4vZR\">The act of classifying social media platforms as common carriers — similar to telecom services like broadband — was first laid out by Supreme Court Justice Clarence Thomas last April. When the court declined to take up a case against former President Donald Trump for blocking people on Twitter, Thomas issued a concurring opinion posing the idea to use the classification that net neutrality rules use for broadband providers.</p><p id=\"RBkjOh\">“There is a fair argument that some digital platforms are sufficiently akin to common carriers or places of accommodation to be regulated in this manner,” Thomas wrote in the opinion. “In theory, common carriage would ban platforms from unfairly discriminating against speech.”</p><p id=\"Qg99gY\">Thomas’ opinion had no legal force, but it provided a new option for Republicans outraged over Big Tech censorship outside of the usual tedious and delicate legislative process <a href=\"https://www.theverge.com/22309566/section-230-explainer-video-internet-changes-klobuchar-event\">related to Section 230 reform</a>. </p><p id=\"lh9fkl\">Still, Hagerty’s bill hasn’t garnered much support from lawmakers outside of Greene. When asked how Republicans would win over Democratic support for the bill to get it approved, Greene said she expects it to move forward if Republicans take back the House after this year’s midterm elections.</p><p id=\"O22ToF\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8RHYLPgWRGEcAl9nLKTcFQIYbP0=/0x588:8192x4877/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23423141/1394252400.jpg",
  "description": "The return of common carriage laws",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}