{
  "title": "Riot’s latest League of Legends spinoff hits Netflix Games as a mobile exclusive",
  "url": "https://www.theverge.com/2022/2/1/22912706/riot-games-hextech-mayhem-netflix-mobile-exclusive",
  "date": "2022-02-01T22:01:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ZhekcfxRsFZWH-IgyrpSRuf9ydk=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70459671/hextechmayhem.0.png\" />    </figure>  <p id=\"MbIfoA\">Netflix has announced that it’s adding two new titles to its small but steadily growing lineup of mobile games — including Riot’s newest <em>League of Legends</em> spinoff. Starting today, users can play <em>Dungeon Dwarves</em> and <em>Hextech Mayhem</em> on Android and iOS devices for free with a Netflix subscription. </p><p id=\"a32i73\"><em>Dungeon Dwarves</em>, developed by Hyper Hippo, is an idle dungeon crawler that continues to play if the app isn’t active. You control a party of five dwarves who beat down walls and monsters to reclaim their underground home bit by bit. They continue their dungeon dive even if you aren’t actively playing the game, rewarding you with the loot and weapons they found whenever you return.</p><p id=\"gvt0Tp\">The more notable of the two releases is <em>Hextech Mayhem</em>, a rhythm runner featuring characters and locales from Riot Games’ <em>League of Legends</em>. Developed by Choice Provisions, <em>Hextech Mayhem</em> is published by <a href=\"https://www.theverge.com/2019/12/5/20993328/riot-forge-publishing-label-league-of-legends-games\">Riot Forge</a>, Riot Games’ publishing arm that offers smaller, self-contained games set in the <em>League of Legends</em> universe. <em>Hextech Mayhem</em> has already launched on consoles and PC but made waves when it was announced that it would be <a href=\"https://www.theverge.com/2021/11/9/22772338/league-of-legends-spinoff-netflix-games-nintendo-switch-hextech-mayhem\">available on mobile as a Netflix exclusive</a>, making it the biggest game launch for the streaming service yet.</p><p id=\"3QgCYB\">Netflix’s foray into gaming started with its programming, creating interactive choose-your-own-adventure shows for <em>Black Mirror</em>, <em>Unbreakable</em> <em>Kimmy Schmidt</em>, and more. The company then loudly signaled it wanted to add gaming to its streaming service by hiring Mike Verdu, a former EA and Oculus executive, to be the <a href=\"https://www.theverge.com/2021/7/14/22577868/netflix-video-games-confirmed-mike-verdu-ea-oculus-facebook\">VP of game development</a> and <a href=\"https://www.theverge.com/2021/9/28/22699241/netflix-night-school-acquisition-oxenfree\">acquiring <em>Oxenfree</em> developer Night School</a>. </p><p id=\"Mo02fJ\">Initially, Netflix’s gaming offerings didn’t go beyond mobile fare that wouldn’t look out of place, choking the gaming section of any app store. But the addition of <em>Hextech Mayhem </em>signals that Netflix wants to compete not only for casual mobile players but serious (™) gamers as well. In the era of major consolidation in the gaming industry, as big corporations with bigger wallets snap up everything in sight, that <a href=\"https://www.theverge.com/22770244/netflix-gaming-app-launch-android-ios-future\"><em>Netflix</em> is offering essentially a platform exclusive</a> of a Riot-published game is a big deal.</p><p id=\"O2xKxc\">Both <em>Dungeon Dwarves</em> and <em>Hextech Mayhem</em> are free to play on iOS and Android, ad-free, and available only with a Netflix subscription.</p><p id=\"G9nyLr\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3T8auDLXf8QEfQYSTMgX7nAcVDo=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23211004/hextechmayhem.png",
  "description": "Netflix grows its gaming service with Riot’s newest game",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}