{
  "title": "Rivian says it delivered nearly 1,000 electric trucks in 2021",
  "url": "https://www.theverge.com/2022/3/10/22971092/rivian-electric-truck-deliveries-earnings-q4-2021",
  "date": "2022-03-10T21:46:20.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FXp_VG0qOaV7NhvoKQ-KKUFAeY8=/0x1:2040x1361/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70606036/K._Rivian_R1T_Fun_In_Dirt_2.0.jpg\" />        <figcaption>Image: Rivian</figcaption>    </figure>  <p id=\"s4O3bP\">Rivian, the buzzy electric vehicle company backed by Ford and Amazon, delivered 909 vehicles to customers in the fourth quarter of 2021, the company said in its <a href=\"https://assets.rivian.com/2md5qhoeajym/7MVaHLcGevcUKE0QZZjzEZ/e3ac410e5f9676c894389c6bc844f1e7/Rivian-Q4-2021-Shareholder-Letter.pdf\">second earnings report</a> since its <a href=\"https://www.theverge.com/2021/11/10/22774403/rivian-ipo-debut-evs-12-billion-amazon-tesla-valuation\">historic IPO</a> last year. The company says it has delivered a total of 920 vehicles in 2021. </p><p id=\"ENztcH\">Rivian said it brought in $55 million in revenue over the course of the year, almost all of which in the last three months. It recorded a net loss of $2.5 billion in the fourth quarter and a net loss of $4.5 billion for the year. </p><p id=\"Dj200V\">With supply chains constrained and the global chip shortage continuing to batter the auto industry, Rivian is maintaining a modest production schedule for 2022. In a shareholder letter, the company said it expects to produce only 25,000 vehicle over the course of the year, including its R1T truck and its electric delivery vans for Amazon. Without supply chain problems, the company said it would be able to make 50,000 vehicles. </p><div class=\"c-float-right\"><aside id=\"sPuJcc\"><q>“the supply chain will be a fundamental limiting factor in our total output”</q></aside></div><p id=\"HfAWbw\">“We are no doubt experiencing one of the most challenging supply chain environments the automotive industry has ever seen,” Rivian CEO RJ Scaringe said in an earnings call.</p><p id=\"m8JdLk\">The earnings report follows a rough week for Rivian, which had to <a href=\"https://www.theverge.com/2022/3/3/22959855/rivian-r1s-r1t-price-ev-vaporware-cars-preorder\">walk back a planned price increase</a> for its electric R1T truck and R1S SUV after a customer backlash. People who put down $1,000 to reserve one of the vehicles were incensed upon learning the original price quote had gone up by as much as $20,000. After an uproar, Scaringe issued a public apology. Meanwhile, the company’s share price fell over 25 percent. </p><p id=\"FXU9pA\">It was a noticeable drop, given the company’s high-flying status over the past six months. Rivian’s IPO helped raise close to $14 billion, and despite only shipping a small handful of trucks since production started, the company’s stock market value was nearly double that of Ford’s. </p><div class=\"c-float-right\"><aside id=\"5XRBg6\"><q>The earnings report follows a rough week for Rivian</q></aside></div><p id=\"men2yp\">Earlier this week, an investor <a href=\"https://arstechnica.com/tech-policy/2022/03/rivian-hit-with-shareholder-lawsuit-over-surprise-ev-truck-price-hike/\">sued Rivian</a> claiming that the company omitted pricing details at time of IPO filing. The lawsuit calls for class-action status and a review by the Securities and Exchange Commission due to the timing of unprecedented price hikes on vehicle preorders.</p><p id=\"au7s9R\">Investors have been impressed by the high demand for Rivian’s electric trucks and SUVs. But the lawsuit alleges that demand was negatively affected, and the company’s brand tarnished, by the abrupt price increase and subsequent reversal. </p><p id=\"UMlq4H\">In the earnings call, Rivian said that it saw an “increased rate” of cancellations after the price increase was made public, but that “more than half” came back after the company reversed itself. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cVeRpOt3F5Ow0Mn0slwbUDifDEY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22883223/mclark_210923_4776_0019.jpg\">      <cite>Photo by Mitchell Clark / The Verge</cite>  </figure><p id=\"J1IEax\">“This wasn’t driven by some mass cancellations, but rather the recognition that the brand we’re building is the foundation of a platform upon which  ultimately we’re going to be selling millions of different vehicles per year,” Scaringe said. “And these early customers are such a critical part of what we’re building as an organization.”</p><p id=\"qcMiDB\">Rivian’s ability to make vehicles at scale is still unproven; it has only just started making and delivering the R1T and is still preparing its R1S SUV and an electric delivery van for mass production. Though Rivian is still worth about $55 billion, its stock has fallen by nearly two-thirds from its peak and is well below its IPO price.</p><div class=\"c-float-right\"><aside id=\"ykkNNc\"><q>Rivian said that it saw an “increased rate” of cancellations</q></aside></div><p id=\"XOu6vp\">Rivian started shipping the R1T late last year, earning the distinction of being the first company to deliver an electric truck to customers. Most of the initial deliveries were to employees, though a few have gone to some actual customers. The rest of the auto industry is still scrambling to get its own plug-in pickup trucks into production. (GMC also started initial deliveries of the Hummer EV late last year.)</p><p id=\"Hfbe8w\">Rivian is also collaborating with Amazon on <a href=\"https://www.theverge.com/2019/9/19/20873947/amazon-electric-delivery-van-rivian-jeff-bezos-order\">an electric delivery van</a>. The e-commerce giant said it would order up to 100,000 vans through 2024, part of the effort to decarbonize its logistics fleet. Amazon <a href=\"https://www.cnbc.com/2021/10/29/amazon-reveals-20percent-stake-in-electric-vehicle-maker-rivian.html\">recently confirmed</a> it <a href=\"https://www.theverge.com/2021/10/7/22711196/rivian-s-1-ipo-amazon-ford-r1t-electric-pickup-truck\">owns some 20 percent of Rivian</a> after participating in multiple funding rounds before the IPO.</p><p id=\"51awB2\">In the shareholder letter, Rivian said it sold its first electric delivery van to Amazon in the fourth quarter of 2021. The production ramp for the van has gone “smoother” than for the R1T truck, the company said. Scaringe confirmed that the van won’t start rolling out in greater quantities until the second quarter of 2022. </p><p id=\"tdtQcn\">Rivian isn’t the only EV newcomer to feel growing pains. Lucid Motors <a href=\"https://www.theverge.com/2022/2/28/22955518/lucid-motors-q4-2021-earnings-ev-air-deliveries\">slashed its production expectations</a> to 12,000-14,000 vehicles from the original prediction of 20,000 vehicles. Still, Rivian has faced a tougher road than most, with the loss of $117 billion in market value over the last four months alone. Analysts are lowering their price targets by an average of 40 percent, <a href=\"https://www.bloomberg.com/news/articles/2022-03-10/rivian-enthusiasm-turns-to-skepticism-after-117-billion-wipeout?sref=ExbtjcSG\"><em>Bloomberg</em> reports</a>.</p><p id=\"7i6oe8\"><em>With additional reporting by Umar Shakir</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3SfYzvSz3KHc9pYyI8lB-82h3-I=/0x147:2040x1215/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13469279/K._Rivian_R1T_Fun_In_Dirt_2.jpg",
  "description": "It was a rough week for Rivian.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}