{
  "title": "Rivian wins $1.5 billion tax incentive package to build an EV factory in Georgia",
  "url": "https://www.theverge.com/2022/5/3/23055112/rivian-georgia-factory-deal-tax-incentive-amount",
  "date": "2022-05-03T15:19:38.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/V1ohtF4-y45wzdAwOIX-z3P8fdM=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70827224/1240401224.0.jpg\" />        <figcaption>Brian Cassella/Chicago Tribune/Tribune News Service via Getty Images</figcaption>    </figure>  <p id=\"HOQNXv\">The state of Georgia offered Rivian $1.5 billion in tax incentives for the buzzy EV company to build a factory east of Atlanta, according to <a href=\"https://www.georgia.org/rivian\">documents signed</a> by the company and local officials in the state. <a href=\"https://www.theverge.com/2021/12/16/22840111/rivian-factory-georgia-5-billion-electric-amazon\">The factory will cost $5 billion</a> to construct, and eventually produce 400,000 electric vehicles a year. In order to receive the money, Rivian agrees to create 7,500 jobs, with an average wage of $56,000 a year, plus benefits, by the end of 2028. </p><p id=\"nzu8k2\">Georgia officials are portraying the agreement as the largest economic development deal in the state’s history. Rivian has said it will start construction of the $5 billion facility in the summer of 2022 and expects to start making vehicles there in 2024. In addition to its R1T electric truck, Rivian also is planning to mass-produce 100,000 electric delivery vans for its main investor, Amazon. The company is already building its first electric pickup trucks at a former Mitsubishi factory in Normal, Illinois. </p><p id=\"5vd58T\">“The long-term economic partnership promises to deliver value to Rivian, the people of Georgia and their kids’ kids’ kids,” the company said in a statement.</p><div class=\"c-float-right\"><aside id=\"e8Flgy\"><q>“The long-term economic partnership promises to deliver value to Rivian, the people of Georgia and their kids’ kids’ kids”</q></aside></div><p id=\"QM8RLN\">Founded in 2009, Rivian didn’t come out of stealth mode until 2018, shortly before it debuted the pickup truck (the R1T) and SUV (the R1S) at that year’s LA Auto Show. Since then, though, it has been on an incredible rise. It has hired thousands of employees, collected billions of dollars in funding from Amazon, Ford, T. Rowe Price, and others, and recently <a href=\"https://www.theverge.com/2021/11/10/22774403/rivian-ipo-debut-evs-12-billion-amazon-tesla-valuation\">went public in one of the biggest IPOs in US history</a>.</p><p id=\"DQbRaE\">In recent months, its stock price has plummeted as supply chain constraints and manufacturing woes have <a href=\"https://www.theverge.com/2022/3/10/22971092/rivian-electric-truck-deliveries-earnings-q4-2021\">slowed its progress</a>. The company has responded by pulling back on its ambitions by maintaining a more modest schedule for the rest of the year, only producing 25,000 vehicles over the course of 2022, according to its most recent earnings report. </p><p id=\"3FDn6c\">Critics of corporate tax incentives are calling it among the largest windfalls to a private company in US history. “The state can never break even,” Greg LeRoy, executive director Good Jobs First, a group skeptical of subsidies to private companies, <a href=\"https://apnews.com/article/technology-business-georgia-atlanta-electric-vehicles-172bfd6fcd2db913fb11532ab57ba6b7\">told the AP</a>. “There’s no way that the average worker in this place is going to pay $200,000 more in state and local taxes.”</p><p id=\"IcM8IB\">Rivian’s plan to build a factory in Georgia has been a “lightning rod” in the state, <a href=\"https://www.nytimes.com/2022/03/14/climate/rivian-georgia-kemp-perdue.html\">with <em>The New York Times</em> reporting</a> opponents holding rallies, dabbling in conspiracy theories, and even threatening local officials. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2m9JH848A1qab15JRL1R-LmkzvE=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23435020/1240401224.jpg",
  "description": "It’s one of the largest deals in US history.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}