{
  "title": "Rivian has altered the deal, and now its EVs will cost buyers up to $20K more",
  "url": "https://www.theverge.com/2022/3/2/22958066/rivian-price-increase-r1t-r1s-for-new-and-existing-reservations",
  "date": "2022-03-02T22:10:11.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6kXS1gJnlakDYCeZ0E953wJaGTM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70571871/mclark_210923_4776_0010.0.jpg\" />        <figcaption>Photo by Mitchell Clark / The Verge</figcaption>    </figure>  <p id=\"E9crCW\">Rivian increased the estimated prices of its R1T electric pickup and R1S electric SUV this week by up to 20 percent, as reported by <a href=\"https://techcrunch.com/2022/03/01/rivian-raises-price-on-r1t-electric-truck-r1s-suv-ahead-of-new-dual-motor-version/\"><em>TechCrunch</em></a>. The company is applying the new estimates to new orders and changing them for reservation holders who don’t yet have a vehicle entering production.</p><p id=\"3nwrmX\">This is the first significant change in pricing Rivian has revealed since orders opened, and while customer preorders all stated “prices are subject to change as they get closer to production,” it seems like no one was ready for a change this big. Prospective EV buyers are used to <a href=\"https://www.theverge.com/2021/6/2/22464552/tesla-price-increases-supply-chain-pressure-chip-shortage-elon-musk\">fluctuations in the pricing</a> of cars from Tesla, but in that case, prices are usually locked in from the time they put in their orders.</p><div class=\"c-float-right\"><aside id=\"CtoG2G\"><q>Many customers shared they have cancelled or plan to cancel their orders</q></aside></div><p id=\"fzXDyP\">The news of the price increase came bundled with Rivian’s announcement of the ability to preorder a dual-motor configuration of both the R1T and R1S, along with a smaller “standard” battery pack option rated for 260 miles of range.</p><div class=\"c-float-left\"><div id=\"CG3NUt\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There are price hikes that sting, there are price hikes that are offensive, and then there are price hikes that verge on sociopathic. My R1T going from $74,950 up to $92,700 overnight is the latter.</p>— Bradley Kent (@bradley_kent) <a href=\"https://twitter.com/bradley_kent/status/1498799489733521408?ref_src=twsrc%5Etfw\">March 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"um2krA\">The quad-motor configuration of the R1T with 314 miles of range used to start at $67,500, but now that price point will only get you a dual-motor and standard battery pack configuration — which won’t be available until 2024. The quad-motor configurations now start at $79,500 for the R1T and $84,500 for the R1S (originally $70,000).</p><p id=\"lNoK8p\">In a statement from Jiten Behl, Rivian’s chief growth officer, the price hike was attributed to global chip shortages and supply chain issues:</p><blockquote><p id=\"UO1GB0\">“Like most manufacturers, Rivian is being confronted with inflationary pressure, increasing component costs, and unprecedented supply chain shortages and delays for parts (including semiconductor chips). This rise in cost and complexity due to these challenging circumstances necessitate an increase to the prices of the R1T and R1S models we offer today — prices which were originally set in 2018. This decision will allow us to continue to offer competitive products that maintain the high standard of quality, performance and capabilities that our customers expect and deserve from Rivian. Along with the adjusted prices for our current offerings, we are also announcing Dual-Motor AWD and Standard battery pack options for R1T and R1S, which will provide a broader range of choices for customers as part of our expanding portfolio of options, upgrades and accessories.”</p></blockquote><p id=\"YitAyY\">People who preordered the truck are not happy about the price increases. Many customers have taken to <a href=\"https://www.reddit.com/r/Rivian/comments/t4m4cq/and_that_is_the_ballus_gamus_as_my_dad_would_say/\">Reddit</a> to share they canceled or plan to cancel their orders. <a href=\"https://twitter.com/Rivian/status/1498786420349181956\">Rivian’s tweet</a> on the new dual-motor configuration announcement has nearly 400 replies, including many customers sharing disappointment of the $12,000 to $20,000 price increase to their existing preorders.</p><div id=\"VvfUyR\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">YIKES!!! <a href=\"https://twitter.com/Rivian?ref_src=twsrc%5Etfw\">@Rivian</a> with another swing and a miss. They now want over $100,000 for the truck I reserved at $85,000 a few months ago (and not honoring locked-in prices as Tesla does). Honestly, this is cancellation worthy. An extra $15K is INSANE. <a href=\"https://t.co/TEXXz4VMRM\">pic.twitter.com/TEXXz4VMRM</a></p>— Quinn Nelson (@SnazzyQ) <a href=\"https://twitter.com/SnazzyQ/status/1498787339220307968?ref_src=twsrc%5Etfw\">March 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><div class=\"c-float-right\"><div id=\"kkENVx\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Price of my <a href=\"https://twitter.com/Rivian?ref_src=twsrc%5Etfw\">@Rivian</a> Truck just went up $10k. As a day one preorder holder this feels suuuuper bait and switchy. Not a fan. <br><br>The tone of my video would have changed if I had known it was a $100,000 dollar truck. Extra zeros matter.</p>— JerryRigEverything (@ZacksJerryRig) <a href=\"https://twitter.com/ZacksJerryRig/status/1498856781967020037?ref_src=twsrc%5Etfw\">March 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"vsynTr\">Even YouTubers <a href=\"https://twitter.com/ZacksJerryRig/status/1498856781967020037\">Zack Nelson</a> of Jerry Rig Everything and <a href=\"https://twitter.com/SnazzyQ/status/1498787339220307968\">Quinn Nelson</a> of Snazzy Labs took to Twitter on the subject. Both were early fans and reservation holders of Rivian’s R1T truck, but now they are speaking out about feeling like they experienced a bait and switch. Quinn wrote on Twitter that five months ago, people at Rivian told him they were confident on the pricing of the cars. “Stuff hasn’t changed that much in 5 months—certainly not 20 percent. They lied to me, customers, and investors,” wrote Quinn.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n41U3OiTmHBtFk7q8FYqzuEOHNA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22883215/mclark_210923_4776_0010.jpg",
  "description": "The preorder bonus for Rivian’s EV is a $20K price hike.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}