{
  "title": "Rivian issues recall for R1T electric truck over faulty airbag sensors",
  "url": "https://www.theverge.com/2022/5/12/23068584/rivian-recall-r1t-truck-airbag-deactivate-child",
  "date": "2022-05-12T15:29:03.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1AudGAuO30dyJTCDXpvdcQHC4DU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861305/mclark_210922_4776_0024.0.jpg\" />        <figcaption>Photo by Mitchell Clark / The Verge</figcaption>    </figure>  <p id=\"kd0mzL\">Rivian is recalling some of its R1T electric pickup trucks over faulty airbag systems, <a href=\"https://static.nhtsa.gov/odi/rcl/2022/RCAK-22V319-9345.pdf\">according to a notice</a> filed with the National Highway Traffic Safety Administration (NHTSA). The vehicle’s sensors in the front seat may not deactivate the airbag when a child occupies the front passenger seat, necessitating the recall. </p><p id=\"d9c6Ub\">The recall covers 502 R1T trucks from the 2022 model year that were produced September 21st, 2021, through April 12th, 2022. It is the first recall issued by the buzzy electric vehicle company. </p><div class=\"c-float-right\"><aside id=\"eqgrlu\"><q>The recall covers 502 R1T trucks</q></aside></div><p id=\"4dUFfi\">In a recall report submitted to NHTSA this week, Rivian says the “Occupant Classification System (OCS) may not deactivate the air bag when a child or child seat occupies the front passenger seat.” Federal motor vehicle safety standards require vehicles to deactivate the front airbag when a child is sitting in the passenger seat in order to prevent injury. </p><p id=\"YjVnFT\">The company reported its <a href=\"https://www.theverge.com/2022/5/11/23067212/rivian-earnings-q1-2022-electric-truck-deliveries-stock\">first quarter 2022 earnings yesterday</a>, in which it revealed that it has shipped 1,227 vehicles to customers, bringing its total number of deliveries up to 2,148 vehicles. Assuming all of those deliveries are R1T trucks, the recall covers about 23 percent of the delivered vehicles. </p><p id=\"ftTg4a\">Rivian says it will replace the front passenger seats for the affected trucks brought in to the company’s service centers. There are currently 20 such service centers located in the US. The seats are supplied by Hyundai Transys Michigan in Farmington Hills, Michigan. </p><p id=\"Il6w5y\">A Rivian spokesperson said there have been no injuries reported associated with this recall. “We are contacting those with affected Rivian vehicles, and they will receive a passenger seat replacement free of charge at a Rivian service center,” the spokesperson said. “In the meantime, infants and children should not be placed in the front passenger seat of affected Rivian vehicles until a front passenger seat replacement is complete.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mk_Am_2Z47w-P9VE-v73gd8BXeI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22883197/mclark_210922_4776_0024.jpg",
  "description": "Rivian says 502 electric trucks are affected by the recall.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}