{
  "title": "Robinhood’s crypto wallet opens up to the 2M people waiting for it",
  "url": "https://www.theverge.com/2022/4/8/23016270/robinhood-crypto-wallet-waitlist-open",
  "date": "2022-04-08T11:12:11.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u6TUGeTlN3hRgsnPNFDqaJxYaU8=/0x0:627x418/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70725319/Blog_Header_WalletTransfers_1.0.jpg\" />        <figcaption>Image: Robinhood</figcaption>    </figure>  <p id=\"ZQqJAt\">Robinhood’s cryptocurrency wallet, which lets users spend and trade select digital currencies including Bitcoin and Ethereum, is being made available to “all eligible customers’’ on its waitlist, <a href=\"https://blog.robinhood.com/news/2022/3/28/the-future-of-investing-is-247-s8ksg\">the company has announced</a>. That amounts to over two million people, although the company cautions that the wallet won’t be available in Hawaii, Nevada, or New York due to “local regulations.” The wallet was initially launched as a <a href=\"https://www.theverge.com/2021/9/22/22686377/robinhood-crypto-wallet-currency-bitcoin-ethereum\">limited test last year</a>.</p><p id=\"JdHntn\">Although Robinhood has allowed customers to buy cryptocurrency on its platform, you couldn’t easily spend the cryptocurrency — it just sits in your account as a speculative asset until you decide to sell it. In contrast, Robinhood says its wallet gives customers “full access to their crypto” and the ability to “participate in the crypto ecosystem — by tipping on social media, paying for NFTs and more” with no withdrawal fees. </p><div class=\"c-float-right\"><aside id=\"o4Mzc3\"><q>Promising “full access” to crypto</q></aside></div><p id=\"IWyUUa\">Robinhood is best known as an equities trading platform, and played a big role in <a href=\"https://www.theverge.com/22744728/money-fandom-cryptocurrency-retail-trades-stocks\">last year’s meme-stock frenzy</a>, but says that cryptocurrency purchases have been increasingly popular with its users. “Bitcoin is actually the top most recurring buy for our customers, more than even many of the stocks that you think about,” the company’s chief product officer Aparna Chennapragada said onstage at the Bitcoin 2022 conference in Miami. But <a href=\"https://www.bloomberg.com/news/articles/2022-04-07/robinhood-rolls-out-cryptocurrency-wallet-to-2-million-users\"><em>Bloomberg</em> notes</a> that its revenue from cryptocurrency transactions has been volatile, dropping by 79 percent between Q2 and Q4 last year.</p><p id=\"Qswfg4\">Its cryptocurrency wallet supports QR codes to send crypto, and includes address validation and mandatory two-factor authentication for security. But unlike some other wallets, Robinhood’s is <a href=\"https://robinhood.com/us/en/support/articles/cryptocurrency-wallets/\">custodial</a>, meaning the company is ultimately responsible for the keys that can unlock it. Many critics balk at the idea of end-users not having complete control over their private keys, but custodial wallets are helpful for anyone worried about <a href=\"https://www.theverge.com/2021/1/12/22227535/nyt-bitcoin-millions-forgot-passwords-digital-wallet\">losing access to their funds</a> by misplacing their credentials.</p><p id=\"vftBXo\">There are also other limits to the Robinhood crypto wallet’s functionality to be aware of. An <a href=\"https://robinhood.com/us/en/support/articles/cryptocurrency-wallets/\">FAQ from the company</a> clarifies that sending an NFT to a Robinhood address may result in it being lost, and as of <a href=\"https://www.theverge.com/2021/9/22/22686377/robinhood-crypto-wallet-currency-bitcoin-ethereum\">September last year</a> the company said it wouldn’t be letting customers buy stocks directly with cryptocurrency.</p><p id=\"nVcb0l\">In addition to the rollout of its wallet to people on the waitlist, Robinhood has also announced that it will add support for the Bitcoin Lightning Network “in the near future.” When launched, it should offer customers a quicker and cheaper way to transfer Bitcoin by having these transfers take place “off-chain.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Q7otkCWSCQ31vCfg5QjNpnEWhEI=/0x45:627x373/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23375892/Blog_Header_WalletTransfers_1.jpg",
  "description": "Letting users buy and sell cryptocurrency.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}