{
  "title": "Rockstar finally confirms it’s working on the next Grand Theft Auto",
  "url": "https://www.theverge.com/2022/2/4/22917783/rocstar-games-gta6-active-development-gta5-ps5-xbox-series-x-patch",
  "date": "2022-02-04T15:59:32.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Q2lgeaT1164H3Op0aTGNw2EfIGA=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70471351/480_3840.0.jpg\" />        <figcaption><em>GTA5’s Michael De Santa.</em> | Image: Rockstar Games</figcaption>    </figure>  <p id=\"5EQmKU\">A new entry in the Grand Theft Auto series is in active development, <a href=\"https://www.rockstargames.com/newswire/article/ak73k92o47ko75/grand-theft-auto-community-update\">Rockstar Games has confirmed</a>. “We are pleased to confirm that active development for the next entry in the Grand Theft Auto series is well underway,” the company wrote in a post on its website. In the more immediate future, <em>GTAV</em> and <em>Grand Theft Auto Online</em> will release on PS5 and Xbox Series X and S on March 15th.</p><p id=\"99Jvgl\">The popularity — and profitability — of <em>GTAV</em>’s online component has meant that there’s been an unusually long wait for a sequel. The game originally released for the PS3 and Xbox 360 in 2013, over eight years ago. In contrast, <em>GTAV</em> released a little over five years after 2008’s <em>GTAIV</em>. “With the unprecedented longevity of <em>GTAV</em>, we know many of you have been asking us about a new entry in the Grand Theft Auto series,” Rockstar Games writes. “With every new project we embark on, our goal is always to significantly move beyond what we have previously delivered.” </p><div id=\"IRzXxl\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We look forward to sharing more as soon as we are ready, so please stay tuned to the Rockstar Newswire for official details.<br><br>On behalf of our entire team, we thank you all for your support and cannot wait to step into the future with you!</p>— Rockstar Games (@RockstarGames) <a href=\"https://twitter.com/RockstarGames/status/1489617781347831812?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"uMB82W\">Rockstar doesn’t explicitly call the new entry in the series <em>GTAVI</em>, but this would follow the naming scheme the company has used since 2008’s <em>GTAIV</em>. There are also no official details about where or where the new game might be set.</p><p id=\"RFgyOr\">In the more immediate future, we can expect the release of the current-gen version of <em>GTAV</em>, which will become the third generation of consoles the game has released on. The current-gen version was originally announced with a <a href=\"https://www.theverge.com/2021/5/18/22441925/grand-theft-auto-5-gta-online-ps5-xbox-series-x-release-date\">release date of November 2021</a>, but its release date was <a href=\"https://www.polygon.com/22665110/grand-theft-auto-5-online-expanded-enhanced-edition-delayed-march-2022\">later pushed back to March this year</a>.  </p><p id=\"BZJVAA\">Rockstar says these current-gen versions will feature “new graphics modes with up to 4K resolution, up to 60 frames per second, texture and draw distance upgrades, HDR options and ray-tracing... faster loading times, immersive 3D audio, platform-specific features like advanced haptic feedback, and much more.” There’ll be a new standalone version of <em>GTA Online</em> available on both consoles, which will be available free for the first three months on PS5.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IeRqIK_qpZJz5CawigopGZuZSmo=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22522740/480_3840.jpg",
  "description": "Over eight years after the original release of GTAV",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}