{
  "title": "Rocket Lab catches falling rocket with a helicopter — then drops it in the ocean",
  "url": "https://www.theverge.com/2022/5/2/23032354/rocket-lab-helicopter-catch-electron-reuse",
  "date": "2022-05-03T00:04:55.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-e5fe00fKNp_l5qyEy0MBsyHD5I=/181x0:2044x1242/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70823571/Screen_Shot_2022_05_02_at_12.51.15_PM.0.png\" />        <figcaption><em>Rocket Lab previously tested catching a dummy booster after dropping it from a second helicopter</em> | Image: Rocket Lab</figcaption>    </figure>  <p id=\"WA0GtX\"><em><strong>Update May 2nd, 7:50PM ET: </strong></em><em>Shortly after launch, Rocket Lab’s Electron fell back to Earth and deployed its parachutes as planned. It then came into view of the company’s helicopter, which then successfully caught the rocket for a few brief moments. However, the helicopter pilot noticed “different load characteristics” that Rocket Lab had not experienced during previous testing. </em></p><p id=\"2IC3wf\"><em>“At his discretion, the pilot offloaded the stage for a successful splashdown, where it has been recovered by our vessel for transport back to our factory,” Murielle Baker, a communications representative for Rocket Lab, said during the launch livestream. “The stage is in great condition though, and we look forward to assessing it in detail when it’s back here in the factory.” The rest of the launch continued as planned, and Rocket Lab deployed all 34 satellites on board the flight.</em></p><p id=\"5KFohR\"><strong>Original Story:</strong> After nearly three years of preparation, small satellite launch company Rocket Lab will attempt to catch one of its rockets in mid-air today, after launching the vehicle to space from New Zealand. As the rocket falls back to Earth, Rocket Lab will use a helicopter to try to snag the booster just before it hits the ocean. That way, the rocket can potentially be launched again.</p><p id=\"hoDOtZ\">This will be the first time that Rocket Lab attempts to catch one of its Electron rockets with a helicopter, part of the company’s plan to recover and reuse its vehicles after launch. Up until now, Electron — designed to launch batches of small satellites into low Earth orbit — has mostly been an expendable rocket. Most of these rockets fall back to Earth after each flight and are ultimately destroyed.</p><p id=\"r54our\">But by catching and reusing its rockets after flight, Rocket Lab hopes to cut down on the manufacturing cost associated with building an entirely new rocket for each of its missions. The goal is similar to that of SpaceX, which has become famous for landing and reusing its rockets post-flight. Rocket Lab also claims that recovering and reusing its rockets could also help speed up its flight cadence. “By bringing one back, it just saves a tremendous amount of time where you don’t have to build a whole new rocket from scratch,” Peter Beck, CEO of Rocket Lab, tells <em>The Verge</em>. “So we’ll obviously see some good cost savings, but I think the most important thing for us right now is just getting the vehicles back into the production line.”</p><div class=\"c-float-right\"><aside id=\"q9UDZB\"><q>“the most important thing for us right now is just getting the vehicles back into the production line.”</q></aside></div><p id=\"Im49aV\">When Electron launches to space, computers on board the vehicle guide the booster back through Earth’s atmosphere, maneuvering it in just the right way so that it stays intact during the fall to the ground. Once the rocket reaches an altitude of about 8.3 miles up, it deploys a drogue parachute to slow its fall, followed by a main parachute. As the rocket leisurely floats down toward the ocean, that’s when the helicopter will arrive and attempt to capture the line of the parachute with a dangling hook, avoiding a splashdown in salty seawater.</p><p id=\"Grgkal\">Rocket Lab has been working on its recovery plan since 2019, when it <a href=\"https://www.theverge.com/2019/8/6/20757441/rocket-lab-electron-reusable-helicopter-recovery-spacex\">announced that it would try to make its Electron rockets reusable</a>. The first major test came in December 2019, when Rocket Lab <a href=\"https://www.theverge.com/2019/12/6/20998539/rocket-lab-electron-reusability-guided-reentry-launch-test\">tested its guidance and control system on Electron</a>. For Rocket Lab, guiding Electron’s fall through the atmosphere is one of the most difficult parts of this entire process. “I think a lot of people think the hardest thing is catching the rocket, and that it certainly is hard,” Beck says. “But really, from an engineering standpoint, the hardest thing has been making sure the rocket survives through the reentry.” The rocket reaches speeds of more than 5,000 miles per hour during its fall, and it must stay in one piece as scorching-hot plasma builds up around the vehicle. </p><p id=\"nT1Isu\">Rocket Lab successfully splashed down intact Electron rockets in<strong> </strong>the ocean, and the company retrieved three rockets out of the water to learn more about their journeys back to Earth. Company engineers were able to open up the rockets and strip some of their components in order to fly them again. Rocket Lab also <a href=\"https://www.theverge.com/2020/11/19/21578725/rocket-lab-electron-launch-recovery-reusability-parachute-dress-rehearsal\">demonstrated Electron’s ability to deploy its various parachutes</a> after launch. And the company <a href=\"https://www.theverge.com/2020/4/8/21213917/rocket-lab-rocket-electron-helicopters-reusable-mid-air-catch\">used a helicopter to capture a dummy rocket in mid-air</a> (though the fake booster didn’t fall from space but was instead released from another helicopter nearby).</p><div id=\"CtRJhu\"><div ><iframe src=\"https://www.youtube.com/embed/N3CWGDhkmbs?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"0TYJ9e\">Now, Rocket Lab is putting all of these steps together with its upcoming launch, named “There and Back Again” — a reference to the nature of the flight and also a fitting tribute to New Zealand where The Hobbit and The Lord of the Rings were filmed. Though the company has rehearsed each step, they’ll still need to conduct them all together for one launch. “The other really logistically challenging bit is: can you rendezvous with a rocket under a parachute in the middle of the ocean?” Beck says. “I mean, a few moments ago, it was traveling at eight times the speed of sound.”</p><div class=\"c-float-left\"><aside id=\"Ye2jNo\"><q>“Can you rendezvous with a rocket under a parachute in the middle of the ocean?”</q></aside></div><p id=\"CCLmQa\">If the helicopter successfully catches Electron, the company will fly the booster back to New Zealand and offload it on a truck. The rocket could also get dropped off on a boat first if the flight home is too challenging. Rocket Lab will then take a closer look at the vehicle to see how it fared. Moving forward, Rocket Lab will ultimately be selective about which missions are recovered. Flights that are recovered need more systems onboard, meaning the vehicle cannot carry as much to space. Additionally, the path that Electron takes to orbit will influence Rocket Lab’s decision to try a helicopter catch. “Some of the trajectories aren’t very suitable for recovery,” says Beck. “So there’s not going to be 100 percent reuse on every vehicle. It’ll be 50 percent or more probably.”</p><p id=\"QewkSm\">But first, Rocket Lab has to demonstrate that it can catch a falling rocket with a helicopter. The company has pushed back the launch multiple times as it waits for ideal weather conditions. Now, “There and Back Again” is <a href=\"https://twitter.com/RocketLab/status/1521181257698213888\">slated for takeoff at 6:35PM ET</a>, with the helicopter catch happening sometime after the main parachute deploys, about eight and a half minutes after launch. Morgan Bailey, Rocket Lab’s director of communications, says the company will try to provide a livestream of the event, and there’s even going to be a camera on the helicopter’s capture line. But the company warns that maintaining connection throughout will be tricky.</p><p id=\"AyXW3R\">“Space is hard but so is live TV,” <a href=\"https://twitter.com/MoreMorganB/status/1519061285107019778\">Bailey tweeted</a>.</p><p id=\"jIFuDO\"><em><strong>Update May 2nd, 4:50PM ET: </strong></em><em>This post was updated with additional information about how the booster may return home.</em></p><p id=\"rGX9ME\"></p><p id=\"SOv11B\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IYfUulwmq7OBXtFqh8-ZzOTPx7I=/0x39:2224x1203/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23433259/Screen_Shot_2022_05_02_at_12.51.15_PM.png",
  "description": "A catch and then a fumble",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}