{
  "title": "Rode’s first pair of headphones offer a comfortable and balanced way to monitor audio",
  "url": "https://www.theverge.com/22996194/rode-nth-100-mixing-headphones-review",
  "date": "2022-03-28T23:00:00.000Z",
  "author": "Andrew Marino",
  "content": "  <p>The NTH-100 offers a great option for audio mixing</p> <p id=\"gIVpMt\">Rode, the audio company best known for its microphones, is debuting its first pair of headphones, the <a href=\"https://rode.com/en/headphones/over-ear/nth-100\">NTH-100.</a></p><p id=\"Ml9hJ7\">The NTH-100s are wired, over-ear headphones designed for audio and video productions. Compared to headphones made for casual listening, these deliver a flatter frequency response for more accurate mixing and monitoring. </p><p id=\"ri97zh\">The NTH-100 aims to take on some popular models used in productions, like <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.bhphotovideo.com%2Fc%2Fproduct%2F49510-REG%2FSony_MDR_7506_MDR_7506_Headphone.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22996194%2Frode-nth-100-mixing-headphones-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sony’s MDR-7506</a>, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.bhphotovideo.com%2Fc%2Fproduct%2F1253444-REG%2Fsennheiser_hd_280_pro_circumaural.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22996194%2Frode-nth-100-mixing-headphones-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sennheiser’s HD 280 Pro</a>, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.sweetwater.com%2Fstore%2Fdetail%2FDT770pro--beyerdynamic-dt-770-pro-250-ohm-closed-back-studio-mixing-headphones%3Fmrkgadid%3D3251365599%26mrkgcl%3D28%26mrkgen%3Dmpla%26mrkgbflag%3D0%26mrkgcat%3Dstudio%26recording%26acctid%3D21700000001645388%26dskeywordid%3D92700046997884733%26lid%3D92700046997884733%26ds_s_kwgid%3D58700005286965298%26ds_s_inventory_feed_id%3D97700000007215323%26ds_a_cid%3D405527921%26ds_a_caid%3D9238738029%26ds_a_agid%3D94108777819%26ds_a_lid%3Dpla-868723672696%26dsproductgroupid%3D4582283429213633%26product_id%3DDT770pro%26prodctry%3DUS%26prodlang%3DEN%26channel%3DOnline%26storeid%3D%26device%3Dc%26network%3Do%26matchtype%3De%26adpos%3Dlargenumber%26locationid%3D%26creative%3D%26targetid%3Dpla-4582283429213633%26campaignid%3D283268301%26awsearchcpc%3D1%26msclkid%3D65cdb63128191e60e30ad470940125b7%26gclid%3D65cdb63128191e60e30ad470940125b7%26gclsrc%3D3p.ds&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22996194%2Frode-nth-100-mixing-headphones-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Beyerdynamic’s DT 770 Pro</a>, and <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.bhphotovideo.com%2Fc%2Fproduct%2F1024222-OREG%2Faudio_technica_ath_m50x_closed_back_professional_studio.html%2F%3Fmsclkid%3Dfb266581a7aa1b01763f07c01b964613&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22996194%2Frode-nth-100-mixing-headphones-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Audio-Technica’s ATH-M50x</a>. They are competitive in price, costing $149, and they have some unique features, highlighting that Rode knows what producers and audio editors need as they edit for long periods of time. </p><div id=\"YzzBzY\"><div data-anthem-component=\"scorecard:11114271\"></div></div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/E3_8AepbPliG_hLij8nvrqiRre4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345444/amarino_220325_5080_0001.jpg\">      <cite>Photo by Andru Marino / The Verge</cite>      <figcaption><em>The NTH-100’s sound signature is designed to be flat and not color the audio in any way.</em></figcaption>  </figure><p id=\"EZOSvA\">I was able to try out the NTH100 over the past month and here are the features that really stand out to me: </p><ul><li id=\"2172sA\"><strong>CoolTech gel cushions with Alcantara fabric on the earcups and headband:</strong> These are surprisingly comfortable headphones to wear — more so than any of the headphones I mentioned previously. After a four-hour continuous session editing our podcast <a href=\"http://theverge.com/the-vergecast\"><em>The Vergecast</em></a><em>,</em> there was little to no discomfort and they didn’t get too warm on my head (I would like to see how they feel after editing in my hot apartment this summer). Those are common issues with headphones like these, and I was pleasantly surprised with the NTH-100. </li><li id=\"UaZZ89\"><strong>FitLock headband locking system:</strong> There is a turn-lock mechanism on each side of the headphones to adjust, then lock the height of where each earcup rests on your head. I appreciate being able to wear these on and off throughout the week without having to adjust the headband each time — and not getting my hair caught in them while doing so.  </li><li id=\"hVyPNk\"><strong>Dual-sided cable attachments: </strong>The NTH-100’s cable is removable, which is helpful for both repair and for swapping the length of headphone cables. But something novel that these offer is having the option to plug in the cable on either ear cup. I don’t see this very often on mixing headphones, and it’s been helpful when using these headphones in different setups. Rode includes a black 2.4 meter/7.8 foot cable but also sells cables of different colors (green, orange, pink, and blue) in 7.8 feet or 3.9 feet lengths to match the colored labels on Rode’s other audio products. Like many wired headphones, experiencing <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fen-us.sennheiser.com%2Fwhy-does-touching-the-headphone-cable-create-noise&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22996194%2Frode-nth-100-mixing-headphones-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">microphonics</a> (the noise that travels into your ear from the cable rubbing against itself or your clothes) is typical, and you’ll find them in these headphones. If that kind of thing bothers you, I’d suggest testing them out first before you buy. At first, I noticed it a lot when using the NTH-100, but I have since gotten used to it, to a point where I almost forgot to write that in here. </li><li id=\"RcYjBM\"><strong>Unique design: </strong>The NTH-100s are sleek with the ear shape of the earcups and the subtle curves of the headband. Though these will be used a lot behind the scenes, Rode making sure they have a visual presence in the headphone space makes sense — when I watch <a href=\"https://www.youtube.com/watch?v=XypnALPMcNc\">video podcasters on YouTube</a>, a lot are using Rode microphones and Rode’s audio mixer <a href=\"https://www.theverge.com/2019/4/8/18294629/rodecaster-pro-review-podcast-studio-xlr-microphones\">the Rodecaster Pro</a>, but are always wearing Sony, Audio-Technica, or other brands of headphones. Rode is filling that gap to appeal to the creators who already trust products for their production work and who also may be looking for a different look to their headphones on video. </li></ul>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bIW8kcE7egggEqTFvs1aI36Kpc0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23321003/akrales_220311_5080_0067.jpg\">      <figcaption><em>Both ear cups and the headband have soft Alcantara padding that makes them comfortable for hours.</em></figcaption>  </figure><p id=\"4s6uJB\">I’ve only been using these for the past month, but they feel very durable. Rode says that its durability testing ensures “decades of use,” which is an impressive, but hard-to-test claim. There are no creaking or rattling parts that I noticed when using them — something that a lot of other headphones in this price range suffer from (I have had to send back my own <a href=\"https://www.audio-technica.com/en-us/ath-m70x\">Audio-Technica ATH-M70x</a> for repair multiple times due to a plastic piece breaking). The NTH-100s have a strong headband, and it may be a downside for some that they do not fold up at all. So, you may have to leave a little extra room in your gearbag, especially if you need multiple pairs for a podcast recording. </p><p id=\"PZONn4\">So how do they sound? They sound better than most headphones in the $150 price bracket. They aren’t the ultimate mixing headphones that will make you want to ditch using mixing monitors — but great for a lot of production work. There’s no sonic element that jumped out to me or surprised me when testing them out, and that’s kind of the point. Nothing that is of concern when relying upon them for mixing podcasts or videos. </p><p id=\"ZxM7vP\">Rode claims that the NTH-100s deliver an “extremely accurate frequency response,” but next to Sony’s MDR-7506s (a headphone that’s well regarded for its flat frequency response) and Audio-Technica’s popular ATH-M50x, Rode’s NTH-100s have a bit more presence in the low-mids, and end up making the other headphones sound screechy or tinny with more presence in the higher frequencies. As an audio engineer, I have learned that every model of headphones still requires my ears to adjust and analyze how they color sound to properly mix and EQ audio, and these are no different. And after a while, I have started to prefer their frequency response over my other editing headphones. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xrSXoUKGnAI0Vu2q7nKqlO0mj9I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345449/amarino_220325_5080_0006.jpg\">      <cite>Photo by Andru Marino / The Verge</cite>      <figcaption><em>The NTH-100’s cable can be plugged into either the right or left ear cup.</em></figcaption>  </figure><p id=\"UGUiHv\">Overall, these stand out more for their comfortability and durability over their sound. Considering the ergonomics, the NHT-100s are a thoughtfully-made competitor to the crowded headphone market. They offer small, but welcome features that others in the $150 price range do not, and feel comfortable to wear for long periods of time. If you are struggling with headphone fatigue in your production, cursed with fragile headphones, or want a cool look for your video podcast, the Rode NTH-100s may be a great upgrade from your current pair. For now, they are my go-to headphones for long session podcast editing. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uri-Csw__40EHzQ6I84WDqEoEn8=/0x144:2000x1191/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23345519/rode_nth100_lifestyle_insitu_005_2000x1334_rgb.jpg",
  "description": "Headband locks, comfy ear cushions, and unique design",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}