{
  "title": "Roku devices are getting an Apple Music app",
  "url": "https://www.theverge.com/2022/5/2/23053535/roku-apple-music-app-subscriptions-tv",
  "date": "2022-05-02T18:23:51.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/X6t8yxsIRXWi0n5Ngesn0hYKAD8=/129x0:1071x628/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70823420/Unknown_6.0.jpg\" />        <figcaption><em>It’s been a while coming.</em> | Image: Roku</figcaption>    </figure>  <p id=\"boQQLe\">Roku users can now play songs and videos from Apple Music on their TVs, streaming players, or Roku soundbars. Roku <a href=\"https://www.businesswire.com/news/home/20220502005327/en/Apple-Music-Now-Available-on-the-Roku-Platform\">announced on Monday</a> that the “app will be available to download later today.”</p><p id=\"AOokEy\">It’s taken a while for Apple’s music service to make it to one of the most popular smart TV platforms. <a href=\"https://www.theverge.com/2019/3/13/18264267/apple-music-now-available-amazon-fire-tv\">It was ported to Amazon’s Fire TV in 2019</a> and has since made it to <a href=\"https://www.theverge.com/2021/10/27/22727865/sony-ps5-apple-music-app-streaming-game-console\">at least one game console</a>: the PS5 (though it doesn’t seem to be supported on Xbox or Switch). In my opinion, though, streaming music services make a lot of sense on TVs. If someone has a nice set of speakers, odds are they’re connected to the TV, and having album art displayed on such a large screen is a treat for most of us who usually only see it in thumbnail form.</p><div class=\"c-float-right\"><aside id=\"th0bMx\"><q>It may be hard to hear any benefits from lossless audio through your TV’s speakers</q></aside></div><p id=\"5Eg55E\">Unfortunately, Apple Music on Roku won’t support features like lossless or spatial audio “at this time,” Roku spokesperson Sophia Economou told <em>The Verge</em> in an email. While Apple doesn’t keep these features locked to its own platforms (they’re <a href=\"https://www.theverge.com/2021/7/23/22590148/apple-music-spatial-audio-dolby-atmos-lossless-android\">available on the Android Apple Music app</a>), they don’t seem to be very common on platforms meant to be hooked up to TVs. (I couldn’t find any mention of them in the PS5 version of the Apple Music app.) Of course, they are supported on the Apple TV 4K, though that box <a href=\"https://support.apple.com/en-us/HT212183\">does have certain limits</a> when it comes to the highest-resolution lossless files. </p><p id=\"yKlorl\">On one hand, it makes sense, given the wide variety of hardware that Roku apps can run on and the fact that both features would likely be wasted on TV speakers. But, on the other hand, it could definitely be a bummer for anyone who has a sound system hooked up to their Roku device.</p><p id=\"mmFQEh\">Roku users will be able to either sign in to the app if they have an existing Apple Music subscription or subscribe to the service through the Roku channel store.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HawhRpEEuQbCL_KECXpbooTFIfc=/1x0:1200x628/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432936/Unknown_6.jpg",
  "description": "There are a few features missing.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}