{
  "title": "Romance scammers collected $139 million in crypto last year",
  "url": "https://www.theverge.com/2022/2/14/22933056/crypto-romance-scammers-139-million-fraud",
  "date": "2022-02-14T18:10:12.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"An illustration of bitcoin\" src=\"https://cdn.vox-cdn.com/thumbor/7Y2856GoEBQZPIfe1GKYkbFmd0U=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507857/acastro_bitcoin_2.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"qiFiOW\">Romance scammers made off with a total of $139 million in cryptocurrency last year, five times more than the amount stolen in 2020, according to a <a href=\"https://www.ftc.gov/news-events/blogs/data-spotlight/2022/02/reports-romance-scams-hit-record-highs-2021\">new report from the Federal Trade Commission</a> (FTC). Cryptocurrency payments made up the largest fraction of the $547 million lost to scammers in 2021, with victims losing $9,770 in crypto on average.</p><div class=\"c-float-right\"><aside id=\"9ASNKE\"><q>Some scammers pretend to be “financial experts” who promise to invest their victims’ money</q></aside></div><p id=\"5eEhtK\">Romance scammers (whom we could probably also call catfishers) often create fake social profiles using pictures taken from the internet, and then trick victims into sending them money, the FTC explains. They may claim to need money for some sort of financial crisis, but even more interestingly, some scammers pretend to be “financial experts” who promise to invest their victims’ money in cryptocurrency or the stock market. </p><p id=\"N3ykMU\">Outside of crypto, gift cards were romance scammers’ most commonly requested form of payment — 28 percent of victims paid their “lover” with one, amounting to a total of $36 million lost, the FTC said. Victims also paid a total of $121 million through bank transfers and other forms of payments, and paid $93 million through wire transfers.</p><p id=\"nov5DQ\">As the FTC notes, there are some red flags to watch out for that may indicate you’re being scammed; when anyone you’ve met online asks for payment in gift cards, crypto, or through wire transfer, it’s best to decline their request. And if you’re suspicious that someone may be catfishing you, just run their profile picture through a reverse image search to see if it’s been used elsewhere. </p><p id=\"YjLUEu\">And remember that romance scams aren’t the only way fraudsters fool people into sending cryptocurrency. Last year, <a href=\"https://www.theverge.com/2021/11/5/22765900/crypto-scam-fbi-psa-atm-qr-code-wire-transfer-con-artist\">the FBI warned the public</a> about a scam where bad actors convinced victims to put their cash into cryptocurrency ATMs and then sent newly purchased coins to the scammer via a QR code. In that scenario, scammers used promises of wealth or love, or impersonated financial institutions to reel in their victims. </p><aside id=\"Q44vq5\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Inside the cryptocurrency scam vortex \",\"url\":\"https://www.theverge.com/22522380/cryptocurrency-scams-hacks-bitcoin\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/mde_l3lUC4muDPEFG7LYrUz0O3g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8921023/acastro_bitcoin_2.jpg",
  "description": "Victims paid $9,770 in crypto on average",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}