{
  "title": "Ron Gilbert is making a new Monkey Island game, and it will be out this year",
  "url": "https://www.theverge.com/2022/4/4/23009951/ron-gilbert-return-to-monkey-island",
  "date": "2022-04-04T15:46:41.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"The logo for Return to Monkey Island.\" src=\"https://cdn.vox-cdn.com/thumbor/1M58TJwsRiiB7o-T0LSIELjJnhI=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70708158/Return_to_Monkey_Island___Coming_2022_0_40_screenshot.0.png\" />        <figcaption>Image: Terrible Toybox</figcaption>    </figure>  <p id=\"NPE5SU\">Turns out Ron Gilbert’s <a href=\"https://grumpygamer.com/april_fools_2022\">April Fools’ joke</a> wasn’t a joke at all. He is indeed working on a new entry in the classic <em>Monkey Island</em> adventure game series, titled <em>Return to Monkey Island</em>, and it’s set to release this year. You can watch the <a href=\"https://www.youtube.com/watch?v=sahskKAxSCY\">first trailer for the game here</a> or at the top of this post. </p><p id=\"LjtjU7\">According to the YouTube trailer’s description, <em>Return to Monkey Island</em> is a “long-awaited follow-up” to <em>The Secret of Monkey Island</em> and <em>Monkey Island 2: LeChuck’s Revenge</em>. Protagonist Guybrush Threepwood is back, and he’ll once again be voiced by Dominic Armato.</p><p id=\"Dthz0O\">The trailer reveals that <em>Return to Monkey Island</em> is being made by Terrible Toybox, the developer of the 2017 <a href=\"https://www.theverge.com/2017/2/10/14574646/thimbleweed-park-ron-gilbert-adventure-game-preview\">old-school adventure game <em>Thimbleweed Park</em></a>, in collaboration with Disney-owned Lucasfilm Games, which was involved in the first four <em>Monkey Island</em> games under the LucasArts banner, and Devolver Digital. Rex Crowle, who was involved with the design of some good-looking games like <em>Tearaway</em> and <em>LittleBigPlanet</em>, is the art director, which likely means that the game will have a great sense of style. </p><p id=\"t7TgUQ\">We don’t know much else just yet, though you might want to bookmark <a href=\"https://returntomonkeyisland.com/\">the game’s website</a> so you can check it for future updates. In 2013, Gilbert wrote a blog post titled <a href=\"https://grumpygamer.com/if_i_made_another_monkeyisland\">“If I Made Another Monkey Island”</a> — perhaps that has some clues about what we can expect? And that same year, <a href=\"https://twitter.com/grumpygamer/status/380819751208902656\">he did promise</a> that if he ever was to make another <em>Monkey Island</em> game, he’d announce it on April 1st.</p><p id=\"abQWgJ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3bxtAX586Rn-3ErvNm1C9BV10yU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366415/Return_to_Monkey_Island___Coming_2022_0_40_screenshot.png",
  "description": "Return to Monkey Island is launching in 2022.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}