{
  "title": "Ron Gilbert’s Monkey Island announcement was a joke ‘18 years in the making’",
  "url": "https://www.theverge.com/2022/4/14/23021974/return-to-monkey-island-ron-gilbert-dave-grossman-interview-screenshots",
  "date": "2022-04-14T15:38:22.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nuVuK1Tz5m6pjomQCbhUc82B3uI=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70748788/return_to_monkey_island_04.0.png\" />        <figcaption><em>A mysterious and dangerous location on Monkey Island.</em> | Image: Terrible Toybox</figcaption>    </figure>  <p>Read on for an interview and the first screenshots from Return to Monkey Island</p> <p class=\"p--has-dropcap p-large-text\" id=\"2fLKjp\">This year, Ron Gilbert pulled off perhaps the best April Fools’ joke ever. On April 1st, he announced on his personal blog that he was making a new <em>Monkey Island</em> game. It was hard to know if this was actually a joke, but a few days later, he revealed <a href=\"https://www.theverge.com/2022/4/4/23009951/ron-gilbert-return-to-monkey-island\">it was real</a> by sharing the <a href=\"https://www.youtube.com/watch?v=sahskKAxSCY\">official trailer for <em>Return to Monkey Island</em></a>. The game promises to harken back to the classic point-and-click era of the first two <em>Monkey Island</em> titles, with creator Gilbert returning, Dave Grossman back to co-write, and composers Michael Land, Peter McConnell, and Clint Bajakian writing the music once again.</p><p id=\"lB5Ebu\">This week, I had a chance to talk with both Gilbert and Grossman to learn a little bit more about the game and its development. The team making <em>Return to Monkey Island</em> has revealed very little beyond what’s in the trailer, and while Gilbert and Grossman didn’t want to get into too many specifics, they did shed some light on what to expect when the game comes out sometime this year. </p><p id=\"xKGMsl\">Read on for our full discussion about creating a modern point-and-click adventure, learning from past projects, and keeping the project a secret. The team has also shared the first official screenshots of the game, which we have included throughout this article. The captions were provided by the developers.</p><p id=\"lHyBs4\"><em>This interview has been lightly edited for length and clarity.</em></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nvarjSkEqRfpmD4Fy7vePyDZeGA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389447/return_to_monkey_island_02.png\">      <cite>Image: Terrible Toybox</cite>      <figcaption><em>Melee Island.</em></figcaption>  </figure></div><p id=\"i7eSif\"><strong>Why are you both returning to </strong><em><strong>Monkey Island</strong></em><strong> right now?</strong></p><p id=\"DCMBWw\">Ron Gilbert: As is kind of obvious if you follow <a href=\"https://grumpygamer.com/\">my blog</a> or follow me <a href=\"https://twitter.com/grumpygamer\">on Twitter</a>, I’m just constantly bombarded by people who want a new <em>Monkey Island</em>, and it’s definitely something I’ve been very interested in. [Note: I missed a sentence here because I accidentally pressed something on my keyboard that turned on a YouTube video. Thankfully, I was muted.] But I think when that opportunity did arise, it was something that I was very eager to jump on and rope Dave into the big scheme. I think, at the bottom level, I think it’s just that the timing was right.</p><p id=\"uHsjHo\">Dave Grossman: And I think we should do these things periodically. I feel like Ron and I have evolved enough that we have some new things to say about the world of Monkey Island. And the minute he called me, I was just like, “Oh, this is a chance to work with Ron again and to revisit these characters, this world that I love, and to have some fun.” I was not a hard sell, honestly. I was basically immediately in. I think Ron was still pitching while I was saying, “Yes, yes. When can we start?”</p><p id=\"dc0HHR\">Ron: I think you were a little more enthusiastic. I still had a lot of trepidation and stuff. We should get together 35 years from now, and we can…</p><p id=\"JPUTIZ\">Grossman: I’m in! I’m in now, call me in 35 years.</p><p id=\"RavZM5\"><strong>With this new entry, what do you hope to accomplish for people who have maybe never played a </strong><em><strong>Monkey Island</strong></em><strong> game before?</strong></p><p id=\"3om5YU\">Grossman: We would like to correct that imbalance in their lives. </p><p id=\"Oyjvjy\">Gilbert: When Dave and I first started to seriously break apart the design and really think about it, I think there were two camps that it was very important to us to fully embrace. That was the fans of <em>Monkey Island</em>, the people who know the games inside and out and quite frankly probably know the games better than Dave and I know the games. And we wanted to build a really good, authentic <em>Monkey Island</em>, something that was going to really satisfy their thirst for a new one.</p><p id=\"l2gUS2\">But we also were very aware that there are probably way more people out there in the world who’ve never played <em>Monkey Island</em> but have heard about it. We also wanted to do something that was accessible to them so that they could be eased into the world of <em>Monkey Island</em> and not feel like outsiders the moment they started the game. Those are really important story and design aspects of what we tackle.</p><p id=\"NdIQyn\">Grossman: To be fair, that’s not a new problem. But this is the thing that happens anytime you make a sequel to anything.</p><p id=\"rCT2pI\"><strong>Can you give any clues as to how you’re thinking about doing that? I can imagine it’s a huge challenge.</strong></p><p id=\"JKXAB8\">Gilbert: It is a challenge. The game that I did earlier, <a href=\"https://www.theverge.com/2017/2/10/14574646/thimbleweed-park-ron-gilbert-adventure-game-preview\"><em>Thimbleweed Park</em></a>, was more kind of a retro-type game. Even with that game, we had people comment that they felt there was a lot of humor and jokes and situations that were just kind of going above their head because they weren’t entrenched in that old LucasArts point-and-click stuff.</p><p id=\"ZAQcjQ\">With this game, Dave and I really tried to have the situations either be explained to people while they’re playing it, so they understood the context to what they were jumping into, but not in a way that talked down to them. Just very naturally explain the context of what’s going on. Or if there was stuff that was going to go over their head, just because it’s kind of an inside joke or inside information, just to make sure that they didn’t feel like they were losing out on something. There’s a lot of times maybe [where things] just kind of go right through your head, and you don’t realize it. So that was what we were really trying to do, serve those two audiences well.</p><p id=\"Nn0ELt\">Grossman: A lot of that falls down on the writing and this sort of standard practice if you think about it. Hardly any stories start out without any characters who already have a history together. And you just have to make sure that when those characters are featured that that history comes out, especially if it’s important to the understanding of anything.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8MC9dLCf93KeqruKBzV1RVAJ_tI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389449/return_to_monkey_island_01.png\">      <cite>Image: Terrible Toybox</cite>      <figcaption><em>The courthouse of a chilly new island.</em></figcaption>  </figure></div><p id=\"1Ytzha\"><strong>Ron, I’m curious what else you may have learned making </strong><em><strong>Thimbleweed Park</strong></em><strong> that you’re applying to </strong><em><strong>Return to Monkey Island</strong></em><strong>.</strong></p><p id=\"8Jrpr8\">Gilbert: Well, <em>Thimbleweed Park</em>, because of <a href=\"https://www.theverge.com/2014/11/18/7242433/maniac-mansion-spiritual-successor\">the Kickstarter</a>, really was geared as a “go back and play a classic” LucasArts adventure. So there were a lot of things that, because of the success of the Kickstarter, I felt very compelled to do. Things like the interface being the same, things like pixel art, etc.</p><p id=\"M8kvyC\">With [<em>Return to Monkey Island</em>], I think we felt a little more free from that. Despite the history of it being <em>Monkey Island</em>, it was nice to be able to explore more openly about things like the art style and things like what the interface was. I think that was probably the lesson I really took away from <em>Thimbleweed Park</em> was — alongside the stuff I mentioned earlier — it’s just make sure you don’t become so entrenched in the past with stuff, which is really fun for a certain group of people but can leave a whole other group of people just feeling a little bit lost.</p><p id=\"swjyyg\"><strong>I was going to ask how you’re looking to keep up the spirit of what many of these classic adventure games represent without maybe — I don’t know the best word — cruft or mechanics that maybe don’t hold up as well. How are you thinking about keeping that balance?</strong></p><p id=\"TIzuib\">Gilbert: A lot of that for us was taking a step back and really looking at what’s going on. How much of it is just cruft? How much of it is just nostalgia? And being able to look at everything from how puzzles are constructed, how dialogues happen, and how the user interface works or how movement works. All of these things. And really, being able to re-examine all that stuff.</p><div class=\"c-float-right c-float-hang\"><aside id=\"7UvE9x\"><q>This is still a point-and-click adventure</q></aside></div><p id=\"ObouCm\">But at its core, this is still a point-and-click adventure. It’s not a first-person shooter. It’s not a kart racing game. It is a point-and-click adventure. And so it’s kind of figuring out, or really deconstructing, the point-and-click genre and going, “Well, what does that really mean? What is it that is really fun about point-and-click games?” And making sure that we really emphasize that and not necessarily just a bunch of nostalgic things. Does that jive, Dave, with what we went through?</p><p id=\"AxXfP5\">Grossman: That sounds about right. Basically, any element of the game has to either be supporting the gameplay or the story and hopefully both. Anything that wasn’t — that was dragging either of those things back — we tried to identify and rethink it and redesign it.</p><p id=\"EmidBd\"><strong>Can you give any examples, even at a high level? I understand you don’t want to talk specifics about the game, but is there anything you can share about how you’re trying to capture that?</strong></p><p id=\"p5yNoF\">Gilbert: If you look at people who play games today, a lot of games are played on consoles. There’s a lot of excellent players — PlayStation players and Switch players and all this stuff. One of the things we really wanted to do is understand how these people would play a point-and-click adventure with a controller. Because it’s different. There’s a different mindset to it. There’s just a different way about how it engages your gameplay brain.</p><p id=\"rSn0FI\">We spent a lot of time, far more than we did with <em>Thimbleweed Park</em>, really thinking about a controller and how the game can be thoroughly enjoyable playing with a controller as opposed to just with a mouse. Being able to do that but not distracting or detracting from what the mouse play is. Because we’ve seen a lot of games which are kind of controller-first games, and they wedge the mouse play in. We really tried to very evenly balance these two modes of play for people.</p><p id=\"PaGeIj\"><strong>And you mentioned the art style as well, which, if I’m hearing correctly, is not going to be a pixel-based art style. Is that right? [Note: I had not yet seen the screenshots when I interviewed Gilbert and Grossman.]</strong></p><p id=\"e0aFzO\">Gilbert: Yeah, that is correct. The art that you’re seeing in the trailer is fairly representative of what the art in the actual game will be.</p><p id=\"iqlveZ\">So it isn’t pixel art, and that was a discussion that Dave and I had early on about “should it be a pixel art game? Should it not be a pixel art game?” Ultimately, we thought that we just had a lot more freedom and flexibility to not make it a pixel art game. I think people are going to be very happy with the art once they see it and once they see it moving and the animation. We have an incredible group of animators on the project, and it’s really neat when you actually start to see everything moving in the game.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/n7qwG5Uyw-8h-QRs61j5fBv_6Qg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389450/return_to_monkey_island_03.png\">      <cite>Image: Terrible Toybox</cite>      <figcaption><em>The iconic High Street of Melee Island.</em></figcaption>  </figure></div><p id=\"kB8zij\"><strong>What has surprised you about making this game at this point? It sounds like you’re getting near the finish line since the release is sometime this year. So what has surprised you about the development?</strong></p><p id=\"ri7buD\">Gilbert: I don’t know if it should be surprising, but just getting back together with Dave again has been a wonderful experience. Being able to brainstorm with him, talk with him, write with him, and all those things. Dave is a much better writer than I am — just actually writing stuff — and I learned so much from being able to work with him on that.</p><p id=\"j9ysuM\">And working with Michael Land and Peter [McConnell] and Clint [Bajakian], who are doing the music, just getting back together with them and falling into that 35-year-old glove — it has been a really wonderful experience.</p><p id=\"7X1lBg\">And revisiting the world, revisiting Monkey Island — I haven’t done that in a long, long time. I remember when I first started this project, and I was writing code, and I first typed the words “Guybrush.” It sent a chill down me because I had not typed those words into code in 35 years. That was really fun to just kind of relook at the world again.</p><p id=\"EP7Yp5\">Grossman: It’s almost like not a day has passed. Except, 30 years has.</p><p id=\"uDLZz2\">I was actually very impressed, I would say, rather than surprised — maybe a little surprised — at how smoothly, relatively speaking, it’s gone, building this whole thing for two years with nobody being in an office together. It’s kind of a triumph of remote communication to get that to work. And also keeping it a secret that entire time. I can’t believe we pulled that off.</p><p id=\"jl7B83\"><strong>So it’s an all-remote team putting this together?</strong></p><p id=\"LcJhBP\">Grossman: That’s right.</p><p id=\"KTpxq1\"><strong>And what have you had to do to make sure this is kept under wraps? It was such a wonderful surprise last week.</strong></p><p id=\"s4q2Mv\">Gilbert: Whenever we bring people onto the project, we just have discussions with them about the secrecy, how important it was, and how important it was to the project, and we would tell everybody what our launch plans were, the April 1st stuff. So I think they really understood how important it was for that whole thing to be pulled off. The whole April Fools’ thing had to be in just complete secrecy. And making sure that people understood that the secrecy is not about what’s in the game, which is typical for games — it’s about that this game even exists. I think we hired wonderful people, and we just didn’t have a problem with it, which is great.</p><div class=\"c-float-left c-float-hang\"><aside id=\"kTjTu8\"><q>“We need to do this. We need to announce this on April Fools’.”</q></aside></div><p id=\"mKiASD\"><strong>How long have you been planning to reveal the game in that way?</strong></p><p id=\"5wNkHk\">Gilbert: My blog is almost 18 years old, which is really surprising. Makes me feel very old. But the blog is 18 years old. And I have always, every single April 1st, I have always posted something that said, “This blog will always be April Fools’ joke-free,” because I personally don’t really like April Fools. I’ve always just posted that, and now it’s just kind of a running joke.</p><p id=\"mewBJ0\">And then I wrote <a href=\"https://grumpygamer.com/if_i_made_another_monkeyisland\">that article</a> on my blog about if I made another <em>Monkey Island</em>, and that was when I kind of realized, “wouldn’t it be really fun if I got the rights and I just did it as an April Fools’ announcement.” That was just a weird little thing in the back of my head. It was just kind of a fun little internal joke.</p><p id=\"u3hVOv\">When this project came about, I realized that because of the duration of the development and when we started it, April 1st would fall around the time we needed to announce. That’s the point I said, “We need to do this. We need to announce this on April Fools’.” It just felt it was a joke 18 years in the making.</p><p id=\"JN1GR2\">Grossman: It was literally part of our first conversation about the project. He said he wanted to do that. And I was terrified by the idea at first. I had to sleep on it before I realized how brilliant it was.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1DJKTurV4pyTinqQ9aQVqQOBN8w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389453/return_to_monkey_island_05.png\">      <cite>Image: Terrible Toybox</cite>      <figcaption><em>The locksmith shop of Melee Island and its proprietor.</em></figcaption>  </figure></div><p id=\"RHtVl8\"><strong>How much does this new game match with what your vision was in that blog post [about returning to the series]? And I ask this question having seen the edit you made to the top of the post clarifying some of that.</strong></p><p id=\"dpSl3n\">Gilbert: I think there are a lot of things in that post that are still completely accurate. I didn’t even add the thing about [how] I was trying to make the game in complete secrecy. We pulled that one off.</p><p id=\"xQK3QH\">There’s some stuff, like the pixel art stuff, which I think is a little bit controversial to some people. But I wrote that blog entry before I had done <em>Thimbleweed Park</em>. I do think a lot of what I wanted to do with pixel art and making a game that was a little bit of a throwback game, I think I really kind of did that with <em>Thimbleweed Park</em>. So there’s a whole bunch of the pixel art stuff that probably isn’t as accurate.</p><p id=\"sVp1A2\">And also, you know, as you think about stuff… I mean, that article was something I just whipped off some afternoon. As you really sink into things and start thinking about what the actual game would be, reality kind of intersects with your fantasy on stuff. But I think — generally, I think the spirit of what I said in that article, it really does still hold.</p><p id=\"69WPq2\"><strong>Can you give me an idea of how large the team is for the game?</strong></p><p id=\"i7gHyv\">Gilbert: I think at our peak, we were about 25 people. Some people have rolled off the project just because we’re getting towards the end. But I think at the peak, we were about 25 people.</p><p id=\"Bl9FJR\"><strong>Is that a typical team size for something like this? Is it kept intentionally small? What was the thinking behind having a team that size?</strong></p><p id=\"5VYOr7\">Gilbert: Well, I think that probably depends a lot on the game. Clearly, if you’re building a triple-A game, your team size is probably well into the several hundreds. But for a game like this… <em>Thimbleweed Park</em> was 14 people at its peak. So it was more than <em>Thimbleweed Park</em>, but it wasn’t exponentially more than <em>Thimbleweed Park</em> was.</p><p id=\"qwxT5g\">When you’re building something like we really wanted <em>Monkey Island</em> to be, there’s a kind of intimacy of the team that I think is very important. It was very much the case back at Lucasfilm during the original games, where our team size was seven or so. I like building games where the team size is small enough that everybody can contribute. If you’re an artist and you have a game design idea, if you’re a tester and you have a game design idea or a writing idea or whatever — that the team is kind of small and intimate enough that everybody feels ownership. They feel like this is their game in a way.</p><p id=\"kzV4HL\">Once projects get beyond a certain size, I think that kind of stops happening. It was very important to me that we continued that because I think that was very successful with the original <em>Monkey Islands</em> was that [sense of intimacy]. I really wanted to continue that with this game.</p><p id=\"5nQdwk\"><strong>Can you give me a sense — and you don’t need to go into spoiler territory here — if and how the other </strong><em><strong>Monkey Island</strong></em><strong> games will factor into this one at all?</strong></p><p id=\"wf7aoI\">Gilbert: That’s a tricky thing to discuss. As we announced when we announced the game, this game really does pick up where <em>Monkey Island 2</em> ended. But how it all weaves into the whole world… that’s something that’s been a lot of fun to figure out, and I don’t think we’re ready to really talk about the details yet. Other than that, it’s kind of what you would expect from us.</p><p id=\"tk5QpU\">Grossman: We could talk philosophy about it because I think it might satisfy part of the itch you’re trying to scratch there.</p><p id=\"5jcJoC\">When we were first talking about the project, one of the things we realized was that we can’t really build the exact game that we would have built in 1992 because we’re not the same people that we were then, and the world is different, and there are several more <em>Monkey Island</em> titles in it. We see them, and we like them, and we didn’t want to just not acknowledge them.</p><div class=\"c-float-right\"><aside id=\"a196PP\"><q>Canon can sometimes get in the way of telling a good story</q></aside></div><p id=\"OvASHY\">Our general philosophy was that we would adhere to existing canon as much as we could with sort of two caveats — one being that it’s really hard to keep track of all that stuff. And some of these games don’t agree with each other, so sometimes there’s a paradox, and you just live with it. The other is that canon can sometimes get in the way of telling a good story, and that’s never a battle you want to lose. So whenever there was something that didn’t quite fit, we just ignored it conveniently.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sooI_M8auiPnmTQWnGS3EdZy7dU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389475/return_to_monkey_island_06.png\">      <cite>Image: Terrible Toybox</cite>      <figcaption><em>LeChuck’s ship being loaded up to set sail.</em></figcaption>  </figure></div><p id=\"w2gpVe\"><strong>What about the game have I not asked about or that you both want to talk about at this point in time?</strong></p><p id=\"Wt7jXb\">Grossman: Killer soundtrack, original composers returning.</p><p id=\"9l2cI5\">Gilbert: Yeah, that’s been an exciting aspect. Getting Michael Land and Peter and Clint back on the project has been a ton of fun. The music just feels like <em>Monkey Island</em>. That’s neat.</p><p id=\"KmCm8y\"><strong>I can think of how those soundtracks sounded just with you mentioning that. I imagine it must be a real joy to return to that musical vibe with the composers.</strong></p><p id=\"jGj0l7\">Grossman: The music is one of the pieces that’s coming in now. As we’re talking, more and more pieces are flooding the game, and it’s just sort of expanding like a great big mushroom cloud of awesomeness inside my brain. Every time I see the game, there’s more stuff in there. I love it.</p><p id=\"s3eTJb\">Gilbert: We’re also voice recording right now. Every time you play the game, there’s more and more and more voice building up, which is also really exciting for me to hear.</p><p id=\"vjWGL4\"><strong>How has it been working with the voice actors? I know you mentioned the original Guybrush [played by Dominic Armato] is back, and that must be really exciting.</strong></p><p id=\"0ENOKT\">Grossman: He’s so good. It’s astounding. He was not around when we made the first games. Despite being involved with <em>Tales</em> [<em>of Monkey Island</em>], I had never been in the studio with him before. I’ve been to conventions with him, but I never worked directly with him in the studio. He just nails everything so well. His control is so good. You can give him the tiniest bit of direction, and he’ll just [Grossman makes a tiny squeak noise] change the line to make it go from awesome to extremely awesome.</p><p id=\"f3vbgo\">Gilbert: I think you, Dave, called him the Terminator of voice actors.</p><p id=\"Ql4yJX\">Grossman: If I didn’t, I should have.</p><p id=\"8lN9nB\"><strong>How did [Armato] react to hearing you wanted him back for the role of Guybrush?</strong></p><p id=\"vEe6Mr\">Gilbert: He was pretty stunned. I knew him, but obviously, we never worked together because we didn’t have voice back then.</p><p id=\"gHlTaz\">But I kind of knew him, and I was at about the point that I wanted to loop him into what we were doing. I live in Seattle, and just by chance, he was visiting Seattle that weekend. So I said, “Hey, let’s get together, just have a coffee, and I can tell you about my new game, air quotes.”</p><p class=\"c-end-para\" id=\"Aq2tW8\">We got together, we had coffee, and I think he was very interested in the new game, almost kind of wondering whether maybe he could have a voice part in it. And then I told him that it was the new <em>Monkey Island</em>, and he was just floored. Which is a reaction I get from a lot of people. Before, when we were bringing people on, and we’d talk to them, the minute I mentioned, “I’m making a new <em>Monkey Island</em>….” One person literally started crying. They were so happy that this was happening. So I think Dominic was really floored that we were doing it and extremely happy.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wCThjt161ZuvwTJX0bLfNygOD-Q=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23389530/return_to_monkey_island_04.png",
  "description": "Check out the first screenshots from Return to Monkey Island.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}