{
  "title": "Russian hackers have obtained sensitive defense information technology by targeting US contractors, according to CISA",
  "url": "https://www.theverge.com/2022/2/16/22937554/russian-hackers-target-us-defense-contractors-nsa-cisa",
  "date": "2022-02-16T18:42:10.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ILylLKwci9SCQFID4kN232Uf_oM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70517580/acastro_170621_1777_0003_fin.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"yDJUft\">Russian state-sponsored hackers have been targeting security-cleared US defense contractors for at least two years, according to an <a href=\"https://www.cisa.gov/uscert/ncas/alerts/aa22-047a\">alert</a> released Wednesday by the Cybersecurity and Infrastructure Agency (CISA), Federal Bureau of Investigation (FBI), and National Security Agency (NSA).</p><p id=\"501pKl\">According to the alert, Russian-backed actors had targeted cleared defense contractors (CDCs) and subcontractors that supported the Department of Defense (DoD) in a range of areas, including weapons and missile development, vehicle and aircraft design, surveillance and reconnaissance, and combat communications systems. Compromised entities include contractors supporting the US Army, Air Force, Navy, Space Force, DoD, and Intelligence programs.</p><p id=\"zulaBj\">Through intrusions against defense contractors, Russian-backed actors had acquired sensitive unclassified information as well as export-controlled technology, CISA said. Under normal circumstances, technology subject to export-control laws requires a license to be released to foreign entities, necessitating approval from the US government.</p><p id=\"O3g2wR\">Though there is no mention of classified documents being stolen, details suggest that the nature of the information gives a significant understanding of US military operations.</p><p id=\"8F8ldC\">“The acquired information provides significant insight into U.S. weapons platforms development and deployment timelines, vehicle specifications, and plans for communications infrastructure and information technology,” the text of the alert said. “By acquiring proprietary internal documents and email communications, adversaries may be able to adjust their own military plans and priorities, hasten technological development efforts, inform foreign policymakers of U.S. intentions, and target potential sources for recruitment.”</p><p id=\"kbe8Bd\">Given the success of current efforts, the FBI, NSA, and CISA anticipate that Russian state-sponsored cyber actors will continue to target defense contractors for information in the near future.</p><p id=\"4O7lgj\">Although Russia is known for harboring cybercriminal gangs, direct attribution of cyber activities to Russian state-sponsored actors is rare and represents a forceful statement from the US agencies involved. <a href=\"https://www.theverge.com/2022/2/15/22936192/ukraine-defense-ministry-ddos-russia-conflict-de-escalation\">As tensions continue on the Russian border with Ukraine</a>, analysts have been particularly sensitive to state-sponsored cyberattacks from the country.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ec09iymDZZtLyMew7HpVc02Kec0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8726989/acastro_170621_1777_0003_fin.jpg",
  "description": "The FBI, NSA, and CISA warned that Russian state-sponsored intrusions will continue.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}