{
  "title": "Russian regulator says it will fine Google over Ukraine war videos",
  "url": "https://www.theverge.com/2022/3/30/23002909/russia-youtube-google-illegal-content-roskomnadzor-ukraine-war-regulator-fine",
  "date": "2022-03-30T16:36:33.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FqvcovpDosAFH7dltpNZqTkCnTs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70690039/acastro_180403_1777_youtube_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"NLiGQg\">Russia’s communications regulator, Roskomnadzor, has threatened to fine Google over its failure to follow the country’s orders to remove certain “illegal” YouTube videos, as first reported by <a href=\"https://www.washingtonpost.com/technology/2022/03/29/russia-youtube-fine/\"><em>The Washington Post</em></a>. In a translated version of its <a href=\"https://t.me/rkn_tg/225\">post on Telegram</a>, the Roskomnadzor warns it may fine the tech company up to 8 million rubles (about $94,675 USD), an amount that will increase to 20 percent of Google’s annual revenue in case of a repeat offense.</p><p id=\"mZ2frM\">The Roskomnadzor alleges YouTube “promotes the distribution of false content” about what it calls the country’s “special military operation” in Ukraine, and it accuses the platform of “discrediting” the Russian army. It also says YouTube houses “extremist” content “with calls to carry out violent actions against Russian servicemen.”</p><div class=\"c-float-right\"><aside id=\"Z3KLrb\"><q>YouTube has already taken a number of actions against Russia</q></aside></div><p id=\"xyJSvc\">It’s not exactly clear which videos the Roskomnadzor is referring to, but it likely has to do with a complaint waged by the communications regulator earlier this month. On March 18th, the <a href=\"https://techcrunch.com/2022/03/18/russia-warns-youtube/\">Roskomnadzor demanded YouTube take down ads</a> it says promotes the destruction of Russian and Belarusian railways. “The actions of the YouTube administration are of a terrorist nature and threaten the life and health of Russian citizens,” it wrote in <a href=\"https://rkn.gov.ru/news/rsoc/news74196.htm\">a press release</a>. “Roskomnadzor categorically opposes such advertising campaigns and requires Google LLC to stop broadcasting anti-Russian videos as soon as possible.”</p><p id=\"4ZmRbX\">YouTube has already taken a number of actions against Russia following the country’s invasion of Ukraine. The platform has adjusted its policies to <a href=\"https://www.theverge.com/2022/2/26/22952439/youtube-bans-ads-rt-russia-channels-google-ukraine\">demonetize the channels</a> belonging to RT and other Russian state-backed media outlets and is <a href=\"https://www.theverge.com/2022/3/11/22972911/youtube-rt-russian-sputnik-block-state-media-globally\">barring access to videos posted by these channels</a>. According to a report from <a href=\"https://www.bloomberg.com/news/articles/2022-03-22/youtube-at-risk-of-russia-ban-after-facebook-is-deemed-illegal?sref=ExbtjcSG\"><em>Bloomberg</em></a>, YouTube suspended Russia’s military account after it posted two videos (which were later removed) calling the war in Ukraine a “liberation mission” last week. <em>Bloomberg</em> says it banned a YouTube channel associated with Russia’s Ministry of Defence as well.</p><p id=\"RZ3rjq\">Facebook and Instagram have taken similar actions to <a href=\"https://www.theverge.com/2022/3/1/22956532/facebook-russian-state-media-global-recommendation-suspension\">de-platform media outlets</a> run by the Russian government. Both social services started <a href=\"https://www.theverge.com/2022/3/10/22970705/russia-ukraine-moderation-facebook-instagram-hate-speech-violence-policy\">allowing users in certain countries</a> to call for violence against Russian soldiers, a policy that led <a href=\"https://www.theverge.com/2022/3/14/22976603/russia-bans-instagram-facebook-meta-call-to-violence\">Russia to ban the two sites</a> altogether <a href=\"https://www.theverge.com/2022/3/21/22988955/russia-facebook-instagram-putin-meta-whatsapp-ban-ukraine\">for “extremist activities.”</a> </p><p id=\"EBlggA\">It’s unclear whether Google has responded to the Roskomnadzor’s threats. <em>The Verge</em> reached out to YouTube with a request for comment but didn’t immediately hear back.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DraPh7MDxtyd1sUUeOgDjI6muf8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10581345/acastro_180403_1777_youtube_0001.jpg",
  "description": "Russia may fine Google up to 8 million rubles.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}