{
  "title": "Russian military reportedly hacked into European satellites at start of Ukraine war",
  "url": "https://www.theverge.com/2022/3/25/22996187/russian-military-hack-viasat-internet-satellite-ukraine",
  "date": "2022-03-25T15:32:56.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/VRogwS_9ZitZsfgPRxmpW1g6ikI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70671522/acastro_190201_1777_satellite_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"x1fJux\">American government officials <a href=\"https://www.washingtonpost.com/national-security/2022/03/24/russian-military-behind-hack-satellite-communication-devices-ukraine-wars-outset-us-officials-say/\">told <em>The</em> <em>Washington Post</em></a> that the Russian military was responsible for a cyberattack on a European satellite internet service that affected Ukrainian military communications in late February. </p><p id=\"NNY9Tb\">The hack affected the KA-SAT satellite broadband network, owned by Viasat, an American satellite communications company. On February 24th, the day the Russian invasion of Ukraine began, the KA-SAT network was hit by outages that affected Ukraine and surrounding regions in Europe. A few days afterward, Viasat <a href=\"https://www.cnbc.com/2022/02/28/ukraine-updates-viasat-says-cyber-event-disrupting-satellite-internet-service.html\">blamed outages on a “cyber event,”</a> but did not release further details.</p><p id=\"LPbSq3\">Though Ukrainian officials have not fully disclosed the impact, the outage is <a href=\"https://www.wired.co.uk/article/viasat-internet-hack-ukraine-russia\">believed to have caused significant communications disruptions</a> at the beginning of the war.</p><p id=\"bVdgKY\">The NSA was reported to be <a href=\"https://www.pcmag.com/news/report-nsa-investigates-viasat-hack-that-coincided-with-ukraine-invasion\">collaborating on an investigation</a> with Ukrainian intelligence services, but no results have been officially announced. However, anonymous officials reportedly told the <em>Post</em> that US intelligence analysts have now concluded that Russian military hackers were behind the attack.</p><p id=\"p0fQFT\">A request for confirmation sent by <em>The Verge</em> to the Cybersecurity and Infrastructure Security Agency (CISA) had not received a response by the time of publication.</p><p id=\"B5FkHv\">Officials from Viasat <a href=\"https://www.airforcemag.com/hackers-attacked-satellite-terminals-through-management-network-viasat-officials-say/\">told <em>Air Force Magazine</em></a> that the attack was conducted through a compromise of the system that manages customer satellite terminals, and only affected customers of the KA-SAT network, a smaller broadband provider that Viasat bought last year from French satellite operator Eutelsat.</p><p id=\"B58d5S\">At the outset of the conflict, commentators feared that Russia could launch widespread and destructive cyberattacks. While one perspective holds that such attacks have failed to materialize, the slow release of additional information gives credence to the suggestion that many attacks <a href=\"https://www.nytimes.com/2022/03/18/opinion/cyberwar-ukraine-russia.html\">may have occurred in the shadows</a>.</p><p id=\"4pXQNO\">In the aftermath of the hack, CISA and the FBI issued a <a href=\"https://www.cisa.gov/uscert/ncas/alerts/aa22-076a\">joint cybersecurity advisory</a> to satellite communications providers, warning that the agencies were aware of possible threats to US and international networks, and advising companies to report any indications of malicious activity immediately.</p><p id=\"C50tEj\">As the war in Ukraine continues — and US opposition to Russia grows in the form of sanctions — the Biden administration has issued increasingly serious warnings about the possibility of Russian cyberattacks on US infrastructure.</p><p id=\"m6yCpA\">On Monday, President Biden advised US businesses to take added precautions against hacking, <a href=\"https://www.nbcnews.com/politics/joe-biden/evolving-intelligence-suggests-russia-may-target-us-businesses-cyberat-rcna20921\">citing “evolving intelligence”</a> that Russia was preparing to target the US with cyberattacks. Then on Thursday, the Department of Justice <a href=\"https://www.justice.gov/opa/pr/four-russian-government-employees-charged-two-historical-hacking-campaigns-targeting-critical\">unsealed indictments against four Russians</a> accused of mounting state-sponsored cyberattacks against the US, publicly releasing details of a highly sophisticated hacking campaign involving supply-chain software compromises and spear-phishing campaigns against thousands of employees of companies and US government agencies.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zjFnKDjPdxTiYpJznEpdMY4yWNw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13959928/acastro_190201_1777_satellite_0001.jpg",
  "description": "The outage caused significant comms disruption for the Ukrainian army",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}