{
  "title": "Russian fans of The Sims can’t play My Wedding Stories expansion pack because of anti-gay law",
  "url": "https://www.theverge.com/2022/2/10/22927278/ea-sims-4-my-wedding-stories-russia-anti-gay-law",
  "date": "2022-02-10T17:44:11.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KXmLgCzzugy5MK4bwgdUAt9-IEI=/148x0:1750x1068/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70493644/Screen_Shot_2022_02_10_at_12.05.58_PM.0.png\" />    </figure>  <p id=\"B8gsmc\">EA has decided it will not sell the newest <em>The Sims 4</em> wedding expansion pack in Russia due to the country’s anti-LGBTQ “gay propaganda law.” <a href=\"https://www.ea.com/games/the-sims/the-sims-4/news/my-wedding-stories-february-8th-2022\"><em>The Sims 4: My Wedding Stories</em></a> is a content pack that allows players to create their dream (or nightmare) wedding in <em>The Sims 4</em>. Marketing for <em>My Wedding Stories</em> centers on a lesbian couple, Camille and Dominique, as they plan their big day. </p><div id=\"6ooNum\"><div ><iframe src=\"https://www.youtube.com/embed/xr_5WU_nWrA?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"B6D7LP\">“As we moved through our development and brand storytelling process, we became aware that the way we wanted to tell Cam and Dom’s story would not be something we could freely share around the world,” EA said <a href=\"https://www.ea.com/games/the-sims/the-sims-4/news/our-commitment-to-you\">in its announcement</a>. “We are steadfast in upholding that commitment by shining a light on and celebrating stories like Dom and Cam’s, so we have made the decision to forgo the release of <em>My Wedding Stories</em> where our storytelling would be subject to changes because of federal laws.”</p><p id=\"FfdCei\">In 2013, Russia <a href=\"https://en.wikipedia.org/wiki/Russian_gay_propaganda_law\">passed a law</a> that bans the “propaganda of non-traditional sexual relationships among minors.” The law effectively criminalizes the free expression of LGTBQ people in Russia, resulting in fines for pro-LGBTQ speech, banning access to popular LGBTQ websites, and increased violence toward LGBTQ people.</p><p id=\"ApK7h5\"><em>The Sims 4</em> base game and its numerous expansion packs already permit and contain same-sex relationships and are sold in Russia under an 18+ rating. When asked if EA would have to change its marketing materials or the content of the game itself in order to not run afoul of the law, Dana Berkowitz, senior manager of global communications, said there was no further information to share on the decision.</p><p id=\"3lQNlG\">Reaction to the news online has been mixed. Some have praised EA for uncompromising its vision, while others were saddened that Russian players, especially those who might not otherwise be able to express their queerness, will have to go without. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hcKreFeyo4xPwnebjfbkQKIsXgY=/0x37:1898x1031/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23232611/Screen_Shot_2022_02_10_at_12.05.58_PM.png",
  "description": "The pack heavily features a lesbian couple in its marketing.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}