{
  "title": "Russia’s Yandex lays off two dozen US-based workers from its robot and self-driving teams",
  "url": "https://www.theverge.com/2022/3/29/23000184/yandex-layoff-michigan-autonomous-vehicle-robot-delivery",
  "date": "2022-03-29T12:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/UaTINPwAsct_Vlqv1VeCMRB9Ii4=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70684190/Yandex_Self_driving_Sonata_Ann_Arbor_2.0.jpg\" />        <figcaption>Yandex, a multi-billion dollar tech company based in Russia, had been operating autonomous vehicles in Michigan before the invasion of Ukraine.  | Yandex</figcaption>    </figure>  <p id=\"CNbydn\">Yandex, the multi-billion dollar Russian tech company that’s been operating a small fleet of autonomous vehicles in Ann Arbor, Michigan, laid off over two dozen US-based workers earlier this month, claiming that its vehicle licenses were suspended by Michigan’s state regulators, <em>The Verge</em> has learned. But Michigan says this just isn’t true.</p><p id=\"At4a3x\">In the days following Russia’s invasion of Ukraine, <a href=\"https://www.theverge.com/2022/3/4/22962016/yandex-autonomous-vehicle-pause-ann-arbor-russia\">Yandex paused its AV testing in Ann Arbor,</a> as well as its tests with six-wheeled delivery robots at several college campuses in Ohio and Arizona. But the pause was only supposed to be temporary — the company said it hoped to resume those operations at a later date. </p><p id=\"A7J9fj\">Yandex claims it was informed on March 9th that its vehicle licenses were suspended by the Michigan Department of Transportation (MDOT). Six Ann Arbor-based safety drivers were laid off, the company confirmed. (Yandex employed about 15 people in the city, according to one former employee.) In addition, Yandex also laid off 21 workers in Arizona and Ohio who acted as on-the-ground support staff for the company’s delivery robots. </p><div class=\"c-float-right\"><aside id=\"83sqUL\"><q>“We have received no requests to cancel them”</q></aside></div><p id=\"CfkfvG\">The state, however, says it isn’t true that Yandex’s licenses were suspended. Yandex still has 14 valid manufacturer plates registered with the state, says Tracy Wimmer, a spokesperson for the Michigan Secretary of State. “We have received no requests to cancel them,” she says. As for the MDOT, it <em>did</em> have a contract with Yandex to <a href=\"https://www.fox2detroit.com/news/test-ride-an-autonomous-vehicle-at-the-detroit-auto-show-this-year\">operate an autonomous ride-hail service during the 2021 North American International Auto Show in Detroit</a>, but that contract was terminated on July 1st because of the pandemic. </p><p id=\"imSAR1\">“MDOT had no further business with Yandex,” Cranson said. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NgXf67_HnJHAIz-aUZe-c2dNxOU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23350752/Yandex_robots_OSU.jpeg\">      <cite>Yandex</cite>      <figcaption>The company was operating a robot delivery pilot at several universities in Arizona and Ohio, with plans to expand to hundreds more. </figcaption>  </figure><p id=\"QeFvr1\">But that isn’t what Yandex told its employees — or <em>The Verge.</em> Yandex, which has been called “the Google of Russia,” insists that it was pressured by the state to shut down its autonomous vehicle testing operation in Ann Arbor. “In the beginning of March 2022 the company’s legal counsel had a discussion with MDOT and was asked to pause its on-road operations,” said Yulia Shveyko, a spokesperson for Yandex, in an email. “On March 9th we were informed by [the] Michigan Department of Transportation that our testing license was suspended. On-road testing without a license is not possible, so we had to lay off 6 safety-drivers in Ann Arbor.”</p><p id=\"JUXOxz\">When asked to respond to the information provided by MDOT and the Secretary of State, Shevyko declined. “I shared with you all the details from our side available for the moment,” she said. </p><p id=\"eUZAYq\">One employee said that he was told that Michigan Governor Gretchen Whitmer had received complaints about a Russian company gathering traffic data on public streets and ordered the suspension of Yandex’s licenses. (A spokesperson for the governor deferred comment to MDOT.)</p><p id=\"1dDlul\">“We were blindsided,” the former Yandex employee said. “And we were told it was the governor of Michigan why we had to cease operations.”</p><div class=\"c-float-left\"><aside id=\"Apb2rY\"><q>“We were blindsided”</q></aside></div><p id=\"IxCm52\">Yandex has been interested in doing business in the US for more than a decade. In 2009, the company opened Yandex Labs in Palo Alto, a 10-minute drive from Google’s headquarters. The company sought to hire nearly two dozen engineers who could share with Moscow the latest trends in Silicon Valley, <a href=\"https://www.wired.com/story/yandex-arkady-volozh-russia-largest-tech-company/\">according to <em>Wired</em></a>. </p><p id=\"gB7Dy0\">That interest expanded to include autonomous vehicles after Yandex’s ride-hailing division, Yandex Taxi, <a href=\"https://www.theverge.com/2017/7/13/15963754/uber-yandex-merger-russia\">acquired all of Uber’s business in Russia in 2017.</a> The two companies formed a joint venture, with several Uber executives joining Yandex’s board of directors. A year later, Yandex launched what it claimed to be the “world’s first robo-taxi business” in Moscow. The company demonstrated a fully driverless vehicle at CES in Las Vegas in 2020 and then began testing self-driving cars in Ann Arbor. Later that year, it launched a robot delivery pilot with Grubhub, with plans to potentially expand to 250 additional college campuses.</p><p id=\"wYwDNH\">Those plans were upended by Russia’s invasion of Ukraine. <a href=\"https://www.reuters.com/business/uber-remove-executives-yandex-joint-venture-2022-02-28/\">Uber removed its executives from Yandex’s board</a> and, after initiating the sale of its stake in Yandex last August, sped up that process after the invasion. <a href=\"https://www.reuters.com/technology/grubhub-ends-driverless-robot-delivery-partnership-with-russias-yandex-2022-03-04/\">Grubhub terminated its partnership with Yandex</a>, as did <a href=\"https://www.protocol.com/bulletins/duckduckgo-yandex-ukraine\">privacy-focused search engine DuckDuckGo</a>. </p><p id=\"cu69YC\">In Ann Arbor, Yandex’s small team was rocked by the invasion, the former employee said. Many of the employees are immigrants with family back in Russia and friends in Ukraine. And despite the company’s efforts to become less reliant on Moscow, the AV division was still dependent on decisions made at Yandex’s headquarters.   </p><p id=\"K8l64e\">Initially, the message from Moscow was to sit tight, the employee said. “We were told that we have a certain amount of reserves, specifically for international employees,” the employee said. “So you’re gonna be fine.”</p><div class=\"c-float-right\"><aside id=\"kcx5pz\"><q>Initially, the message from Moscow was to sit tight</q></aside></div><p id=\"4H9p4k\">Even the <a href=\"https://www.theverge.com/2022/2/26/22949156/russia-expelled-swift-ukraine-sanctions\">banning of Russia from SWIFT</a>, the international payment system employed by banks to send money around the world, seemed to be taken in stride. But then, on March 10th, Yandex told the Ann Arbor team that they were going to be laid off. The license plates were removed from the test vehicles, and they were told that their insurance company had canceled their policy. </p><p id=\"1Ou20g\">“If it wasn’t for the governor shutting us down, I honestly believe that they probably would have footed the bill for another month,” the employee said in an interview that was conducted before the state agencies responded to Yandex’s claims. </p><p id=\"T0o6d4\">After state regulators pointed out that Yandex still had valid vehicle licenses, the employee recalled that some co-workers did express doubts about the claim that Governor Whitmer was indirectly responsible for the layoffs. One former Yandex employee said they reached out to a local Michigan legislator’s office to confirm it but wasn’t able to, according to a screenshot of a group chat shared with <em>The Verge</em>. </p><p id=\"U5sELO\">“So far as I can tell my state legislator has heard nothing of the sort of the governor pulling licenses,” the employee said in the chat. </p><p id=\"6kZQ0b\">“Because it’s bogus,” another responded. “But hey, whatever helps them sleep at night.” </p><p id=\"Lp44NF\"></p><p id=\"wDa2pz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CQmIAPJ_Sl53kYVvvvfeVtRY02U=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23350742/Yandex_Self_driving_Sonata_Ann_Arbor_2.jpg",
  "description": "Michigan denies it revoked Yandex’s licenses.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}