{
  "title": "Russia holds OneWeb rocket launch hostage, issues conditional demands",
  "url": "https://www.theverge.com/2022/3/2/22958082/russia-roscosmos-oneweb-soyuz-launch-demands-ukraine-invasion",
  "date": "2022-03-02T15:22:55.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"Soyuz-2.1b rocket carrying OneWeb satellites installed at Baikonur Cosmodrome launch pad\" src=\"https://cdn.vox-cdn.com/thumbor/7AN2KqkmgKlLEIWKjhDRv_KyQSE=/186x0:5865x3786/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70569730/1238865917.0.jpg\" />        <figcaption>The Russian Soyuz rocket slated to launch OneWeb’s satellites on March 5th from Kazakhstan | Photo by Roscosmos Press Office\\TASS via Getty Images</figcaption>    </figure>  <p id=\"EgkwUZ\">In its latest response to international sanctions and growing geopolitical tensions, Russia’s state space corporation, Roscosmos, is making a list of demands of its customer OneWeb before it agrees to launch the company’s upcoming mission this week. OneWeb’s satellites were scheduled to take off on top of a Russian Soyuz rocket on March 5th in Kazakhstan, but in light of these new demands, it seems likely that launch will not take place.</p><p id=\"zCZlrG\"><a href=\"https://twitter.com/roscosmos/status/1498967071727706114\">In a video posted to Twitter</a>, the head of Roscosmos, Dmitry Rogozin, outlined in an interview that he wants assurances from OneWeb that the company’s satellites will not be used for military purposes. Roscosmos also demanded that the British government, which is a primary shareholder in OneWeb, divest its stake in the company. If these demands aren’t met, Roscosmos says it will roll back the Soyuz rocket, and the launch won’t take place as planned.</p><div class=\"c-float-right\"><aside id=\"A45poT\"><q>OneWeb has been launching its satellites exclusively on Russia’s Soyuz rocket</q></aside></div><p id=\"REnZBn\">OneWeb has been launching its satellites exclusively on Russia’s Soyuz rocket for the last few years, either from French Guiana or Kazakhstan. <a href=\"https://www.theverge.com/2019/2/27/18242120/oneweb-650-satellite-constellation-arianespace-soyuz-launch\">OneWeb is building out a massive mega-constellation</a> of low Earth orbit satellites to provide internet coverage from space,<strong> </strong>similar to SpaceX’s Starlink system. The company has been launching its satellites in batches of 34 and 36 at a time. This week’s launch was supposed to carry 36 new satellites to orbit to flesh out the constellation.</p><p id=\"I32ZnZ\">OneWeb has yet to provide a response to the demands, and the company did not respond to a request for comment from <em>The Verge</em> in time for publication.</p><p id=\"5gMqEr\">The demand for the British government to divest seems impossible to adhere to, which pretty much guarantees the launch won’t take place. The British government became a major shareholder in OneWeb in 2020 <a href=\"https://www.theverge.com/2020/7/3/21312456/uk-oneweb-500-million-space\">when it invested roughly $500 million</a> to help save the company from bankruptcy. The British government has also come under pressure separately to cancel this launch in light of the Russian invasion, <a href=\"https://www.bbc.com/news/uk-politics-60569300\">according to the BBC</a>.</p><p id=\"zB9eCU\">Roscosmos claims that delaying the launch “will cause no economic damage” because the rocket had already been built and paid for, <a href=\"https://tass.com/science/1415139\">according to Russia’s state press organization TASS</a>. The OneWeb satellites will also remain at the launch site at the Baikonur Cosmodrome in Kazakhstan “until the situation is resolved,” the space organization claims. Roscosmos says if this rocket is not used to launch OneWeb’s satellites, then it will be used for another flight. In the meantime, it seems like OneWeb’s future working relationship with Roscosmos is in jeopardy.</p><p id=\"Qc3Ixl\">“No other vehicles for orbiting satellites of the OneWeb orbital cluster are envisaged in the near term,” Tass writes. “The Russian side is ready to fulfill its commitments given that the foreign customer provides legal guarantees, the statement says.” OneWeb planned to launch an initial constellation of 648 satellites and had a handful of launches planned for 2022 to flesh out the system. It has successfully launched 428 satellites so far.</p><div id=\"Cx7gA4\"><blockquote class=\"twitter-tweet\"><p lang=\"ru\" dir=\"ltr\">Стартовики на Байконуре решили, что без флагов некоторых стран наша ракета будет краше выглядеть. <a href=\"https://t.co/jG1ohimNuX\">pic.twitter.com/jG1ohimNuX</a></p>— РОГОЗИН (@Rogozin) <a href=\"https://twitter.com/Rogozin/status/1499043075586469900?ref_src=twsrc%5Etfw\">March 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"tc8hp4\">To really emphasize how much Russia’s relationships with other nations have deteriorated, Rogozin posted a video on Twitter showing personnel at Baikonur covering up the flags of the United States, Japan, and the United Kingdom that had been painted on the nosecone of the Soyuz rocket carrying OneWeb’s satellites. <a href=\"https://twitter.com/Rogozin/status/1499043075586469900\">Rogozin claimed</a> that they “decided that without the flags of some countries, our rocket would look more beautiful.”</p><p id=\"vuuPco\">The conditional launch is yet another way Russia’s invasion of Ukraine is having a spillover effect on space partnerships. Because of European sanctions on Russia in response to the invasion, Roscosmos announced that it was <a href=\"https://www.theverge.com/2022/2/26/22952535/russia-suspends-soyuz-rocket-launches-european-sanctions-ukraine-conflict\">suspending launches of its rockets from Europe’s primary spaceport in French Guiana</a> and removing Russian personnel from the area. The European Space Agency also announced that its joint Mars rover with Russia <a href=\"https://www.theverge.com/2022/2/28/22955003/esa-exomars-roscosmos-rosalind-franklin-rover-red-planet\">probably wouldn’t launch this year as planned</a>, in light of current events on Earth.</p><p id=\"p8xC0n\"><em><strong>Update March 2nd, 10:50AM ET:</strong></em><em> This article was updated to include a new tweet from Dmitry Rogozin.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7ZD92OYJ19DC-TgVUQmI7e-pero=/0x310:6049x3477/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23282796/1238865917.jpg",
  "description": "Russia’s invasion of Ukraine continues to impact space.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}