{
  "title": "Russian pipeline company Transneft hit by data leak dedicated to Hillary Clinton",
  "url": "https://www.theverge.com/2022/3/17/22983085/russia-transneft-omega-data-leak-hillary-clinton",
  "date": "2022-03-17T17:20:31.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"RUSSIA-OIL-PIPELINE-TRANSNEFT\" src=\"https://cdn.vox-cdn.com/thumbor/nogw0ExM8wd1W39wCasHqBHwDzA=/6x0:5531x3683/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70636528/1239209588.0.jpg\" />        <figcaption>Photo by -/AFP via Getty Images</figcaption>    </figure>  <p id=\"s3238Q\">As the Russian invasion of Ukraine moves into its third week, unconventional actors continue to target Russian state-backed businesses with a <a href=\"https://www.theverge.com/2022/3/11/22968049/anonymous-hacks-ukraine-russia-cybercrime-danger\">string of hacks and data leaks</a> — the latest apparently referencing pro-hacktivism comments made by Hillary Clinton.</p><p id=\"Ke0rHu\">The targeted organization is Transneft, the Russian state-controlled oil pipeline giant. On Thursday, leak hosting website Distributed Denial of Secrets published a link to 79GB of emails from the Omega Company, the research and development division of Transneft.</p><p id=\"JDO8CJ\">Headquartered in Moscow, Transneft is the largest pipeline company in the world. As a state-owned Russian enterprise, it is now blocked from receiving investments from the US market <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/02/24/fact-sheet-joined-by-allies-and-partners-the-united-states-imposes-devastating-costs-on-russia/\">under the terms of sanctions</a> against Russia.</p><p id=\"WjZWVx\">Its in-house R&amp;D unit, the Omega Company, produces a range of high-tech acoustic and temperature monitoring systems for oil pipelines, ironically focused on leak detection.</p><p id=\"koezE8\">The email leaks appear to contain the contents of multiple email accounts from company employees, including not only email messages but file attachments containing invoices and product shipment details and image files showing server racks and other equipment configurations.</p><p id=\"N1jQD4\">Some emails reviewed by <em>The Verge</em> were timestamped as recently as March 15th, just days before the leaked data appeared online.</p><p id=\"dwYlhK\">Unusually, according to a note from Distributed Denial of Secrets accompanying the email upload, the source dedicated the leaks to Hillary Clinton. In an interview with MSNBC in February, Clinton took the unconventional step of <a href=\"https://twitter.com/MikaelThalen/status/1504321727110651905\">encouraging Anonymous to launch cyberattacks against Russia</a>.</p><p id=\"ZQTRam\">“People who love freedom, and understand that our way of life depends on supporting those who believe in freedom as well, could be engaged in cyber support of those in the streets in Russia,” Clinton said.</p><p id=\"uRYoEA\">While the Ukrainian government has <a href=\"https://www.wired.com/story/ukraine-it-army-russia-war-cyberattacks-ddos/\">actively encouraged hacktivism</a> against Russian government targets, it is an uncommon position for a high-profile US politician to adopt. Clinton’s statement might have been intended as an echo of her one-time presidential rival <a href=\"https://www.theverge.com/2016/7/27/12297424/trump-hopes-russia-hacked-hillary-clinton-email-server\">Donald Trump’s 2016 entreaty to Russian hackers</a> to release her private emails if they had them, following the breach of the Democratic National Committee’s emails.</p><p id=\"fYm9LF\">Though data leaks have emerged as a key tactic in hacktivists’ support for Ukraine, they have so far had little overall impact on the course of the war. Although analysts initially expected that the conflict would include a pronounced dimension of cyberwarfare, it has largely failed to materialize — in part because the Russian military continues to <a href=\"https://www.aljazeera.com/gallery/2022/3/14/photos-destruction-in-ukraine-as-russias-attacks-intensify\">devastate Ukrainian housing and infrastructure</a> by conventional means.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jqpmZU6Xgaamu5OKWznJ2iMIcmE=/0x393:5536x3291/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23323841/1239209588.jpg",
  "description": "The source appeared to reference a Clinton interview encouraging hacktivism.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}