{
  "title": "Russia blocks Twitter as Ukraine invasion escalates",
  "url": "https://www.theverge.com/2022/2/26/22952006/russia-block-twitter-ukraine-invasion-censorship-putin",
  "date": "2022-02-26T13:29:12.000Z",
  "author": "Russell Brandom",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/EcUEUQVgFRW43AL_WtgneqW5GRM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70553819/acastro_200715_1777_twitter_0004.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"WbzZNx\">As the invasion of Ukraine enters its third day, Russia has blocked access to Twitter in an apparent effort to stifle the flow of information, according to <a href=\"https://netblocks.org/reports/twitter-restricted-in-russia-amid-conflict-with-ukraine-JBZrogB6\">a report from the internet monitoring group NetBlocks</a>. Beginning Saturday morning, NetBlocks saw failed or heavily throttled connections across every major Russian telecom provider, including Rostelecom, MTS, Beeline, and MegaFon. Russians are still able to access Twitter through VPN services, but direct connections are restricted.</p><p id=\"cZzw2T\">Journalists <a href=\"https://twitter.com/BBCSteveR/status/1497563538742730758\">on the ground in Russia</a> have confirmed the block. <a href=\"https://twitter.com/BBCSteveR/status/1497563538742730758\">A BBC reporter</a> described access as “severely restricted,” saying “this message got through, but took a while.”</p><p id=\"fzzSSf\">The motivation behind the restrictions is unclear, but comes amid a broader crackdown on social media platforms in the country. Friday night, Russia announced a new block on Facebook after the platform removed the accounts of four state-run media organizations, a move the government described as a violation of “the rights and freedoms of Russian citizens.”</p><div class=\"c-float-right\"><aside id=\"I6G78E\"><q>198 Ukrainians have been killed in the fighting</q></aside></div><p id=\"X6rMC1\">Twitter did not immediately respond to a request for comment.</p><p id=\"tFw3oZ\">Fighting <a href=\"https://www.washingtonpost.com/world/2022/02/26/russia-ukraine-war-news-updates/\">remains heated across Ukraine</a> as Russian forces focus their attack on the capital city Kyiv.  As of Saturday, the capital remained in the hands of the Ukrainian government. According to the country’s health minister, 198 Ukrainians have been killed in the fighting and more than 1,000 have been wounded.</p><p id=\"mvtaCc\">Russian state media has presented a <a href=\"https://twitter.com/ASLuhn/status/1497562490024169474\">heavily sanitized</a> version of the conflict, focused largely on the plight of refugees from the Eastern Donbas province. </p><p id=\"5bHoF1\">Social media platforms have painted a more chaotic picture, with disturbing images and videos from the conflict circulating widely. One widely circulated video shows a Russian missile <a href=\"https://twitter.com/theragex/status/1497483043858272256\">striking a residential apartment tower</a> in Kyiv, an <a href=\"https://www.rferl.org/a/ukraine-invasion-icc-war-crimes-prosecutor/31722403.html\">apparent violation of international law</a>. Other images <a href=\"https://twitter.com/bellingcat/status/1497523559647920130\">appear to show</a> the use of cluster munitions, although the evidence is still unverified.</p><p id=\"3mSWhm\">Internet access in Ukraine itself remains active and Twitter has not been blocked in the country itself. Some analysts have <a href=\"https://www.theverge.com/2022/2/24/22949115/internet-disruptions-ukraine-kharkiv-russia\">raised concerns</a> that Russian forces could seize telecom infrastructure and institute an internet blackout as the conflict intensifies, but so far outages have been sporadic and localized around Kharkiv.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/giU_BUhPLHDoWcncob_qvRxDm-M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20086268/acastro_200715_1777_twitter_0004.0.jpg",
  "description": "Access is still possible through VPNs",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}