{
  "title": "Russia bans Instagram as promised, blocking access for 80 million users",
  "url": "https://www.theverge.com/2022/3/14/22976603/russia-bans-instagram-facebook-meta-call-to-violence",
  "date": "2022-03-14T11:46:08.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/O_TQ78qNZhPzZlyZrQeRdzCL6NA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70619223/acastro_190919_1777_instagram_0002.0.0.png\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"DjbImo\">Russia’s promised ban on Instagram has kicked into effect today, with the social media platform inaccessible for the vast majority of the country’s population, according to internet monitoring service <a href=\"https://globalcheck.net/en\">GlobalCheck</a>.</p><p id=\"26V8VE\">The country announced <a href=\"https://www.theverge.com/2022/3/11/22972869/instagram-ban-russia-ukraine-facebook-whatsapp-meta\">plans to ban Instagram last week</a>, in response to parent company Meta’s decision to <a href=\"https://www.theverge.com/2022/3/10/22970705/russia-ukraine-moderation-facebook-instagram-hate-speech-violence-policy\">allow Facebook and Instagram users</a> in some countries to call for violence against Russian soldiers following the country’s invasion of Ukraine. Russia has been steadily restricting access to online platforms in an effort to control the flow of information about the war and has already banned Facebook and Twitter.</p><p id=\"9ZIXy4\">Last Friday, Instagram chief Adam Mosseri said <a href=\"https://twitter.com/mosseri/status/1502431327093604352\">in a tweet that</a> “This decision will cut 80 million in Russia off from one another, and from the rest of the world as ~80% of people in Russia follow an Instagram account outside their country. This is wrong.”</p><div id=\"rD7TlR\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">On Monday, Instagram will be blocked in Russia.  This decision will cut 80 million in Russia off from one another, and from the rest of the world as ~80% of people in Russia follow an Instagram account outside their country. This is wrong.</p>— Adam Mosseri (@mosseri) <a href=\"https://twitter.com/mosseri/status/1502431327093604352?ref_src=twsrc%5Etfw\">March 11, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"W3caYi\">Over the weekend, Russian influencers on Instagram posted farewell messages to their followers, encouraging them to follow them on other platforms, or download VPN software to bypass the state’s ban. </p><p id=\"itzckc\"><em>The Washington Post</em> <a href=\"https://www.washingtonpost.com/world/2022/03/13/russia-instagram-ukraine-war/\">reports</a> that one Russian fashion influencer, Karina Nigay, bemoaned the ban in a live video. “This is my work,” said Nigay. “Imagine you were just fired completely from work and you aren’t receiving any income at all, but at the same time you have expenses for your family, for your team if you have subordinates, and then all of a sudden you have nothing to pay your team.” </p><p id=\"46NFXM\">Nigay later suggested the ban might actually turn out to be good for Russian fashion brands. She also responded to commenters on her video who were unfavorably comparing her complaints to the plight of Ukrainians by saying, “Listen, to those who are writing all sorts of filth, all these propaganda stories, I absolutely don’t give a shit.” </p><p id=\"rZN1QC\">Instagram has also provided a platform for Russians to speak out against the war, including wealthy oligarchs and their families. Sofia Abramovich, daughter of billionaire Roman Abramovich, shared an <a href=\"https://www.standard.co.uk/sport/football/chelsea-roman-abramovich-vladimir-putin-russia-ukraine-daughter-instagram-b984669.html\">anti-Putin post on Instagram</a> before deleting it, while wealthy Russian banker Oleg Tinkov <a href=\"https://www.instagram.com/p/CahQTQgsNtO/\">posted</a> that the war was “unthinkable and unacceptable.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/j4ThmwgWiagOy8bOXuj-oYw0kOw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19228499/acastro_190919_1777_instagram_0002.0.png",
  "description": "Russia notches up another tech ban",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}