{
  "title": "Russian space director’s wild threats could have real implications for the ISS",
  "url": "https://www.theverge.com/2022/2/25/22950498/russia-nasa-international-space-station-dmitry-rogozin-roscosmos-ukraine-iss",
  "date": "2022-02-25T18:49:15.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/t4CZj-1WQ9nbIp_7Rikq6SLjg54=/0x0:5568x3712/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70550942/51710869322_c8c7abe29a_o.0.jpg\" />    </figure>  <p id=\"TrHEyq\">The announcement of new sanctions against Russia provoked a strong reaction from the head of Russia’s space program, Dmitry Rogozin, yesterday, who seemed to threaten that the restrictions would destroy Russia’s partnership with NASA and lead to the demise of the International Space Station. Though Rogozin is <a href=\"https://www.nbcnews.com/storyline/ukraine-crisis/trampoline-space-russian-official-tells-nasa-take-flying-leap-n92616\">known for his bluster</a> and provocative statements, his comments did spark concern over what NASA would do if the Russians abruptly pulled out of the ISS program — a move that could be a substantial problem.</p><p id=\"thWfR1\">President Joe Biden announced the new sanctions on Thursday in response to Russia’s invasion of Ukraine, claiming the sanctions would “degrade [Russia’s] aerospace industry, including their space program.” A list of the sanctions <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/02/24/fact-sheet-joined-by-allies-and-partners-the-united-states-imposes-devastating-costs-on-russia/\">released by the White House</a> mentioned denying experts of “sensitive technology” like semiconductors, telecommunications, and avionics. In response, Rogozin, the head of Russia’s state space corporation, Roscosmos, fired off a series of threatening tweets about how the sanctions could impact the ISS program. Notably, he claimed that without Russia, there would be no one to correct the space station’s orbit, and the ISS could come crashing down on the US, Europe, India, or China.</p><div class=\"c-float-right\"><aside id=\"llnNoD\"><q>“Either we’re going to stay together, or the thing is not going to work.”</q></aside></div><p id=\"l89php\">There is some truth to what Rogozin is saying. NASA does rely on Russian propulsion to help control the International Space Station’s attitude, or position and orientation in space, and periodically boost the station on its orbit around Earth. Without Russia, NASA would have to engineer a new solution to help keep the station on the right path in space, so that the vehicle does not slowly fall out of orbit and enter Earth’s atmosphere. “If the Russians walk away, then you’ve got this massive object that’s going to come back in randomly somewhere over the Earth,” Wayne Hale, former program manager of NASA’s Space Shuttle and a member of NASA’s Advisory Council, tells <em>The Verge</em>. However such a scenario would take quite a while to manifest, possibly giving NASA some time to devise an alternate solution. “It’s not like a week, it’ll probably be several years,” says Hale.</p><p id=\"97nxfk\">But the Russians heavily rely on NASA to keep the space station active, too. NASA also helps to control the space station’s position in orbit, and the space agency is solely responsible for generating electricity for the entire vehicle. When it comes to the ISS, the NASA and Roscosmos relationship is a symbiotic one, and either party leaving would spell trouble. “Either we’re going to stay together, or the thing is not going to work,” says Hale.</p><div><div class=\"c-image-grid c-image-grid__odd c-image-grid__odd-first-wide\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/49VY-yU7hfHKbruqLkUGoxGcy4c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270790/Screen_Shot_2022_02_25_at_9.38.20_AM.png\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UX32Cd_Vpz3V7134qeTF6aTsWZA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270791/Screen_Shot_2022_02_25_at_9.38.46_AM.png\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_bkeaqL0xOjV9JeE_yEuurBR5eM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270792/Screen_Shot_2022_02_25_at_9.39.12_AM.png\">  </figure></div></div></div><p id=\"CLAOcK\">As of now, there’s no reason to worry about the demise of the ISS. Both NASA and Roscosmos say they are still working to keep the space station afloat. “NASA continues working with all our international partners, including the State Space Corporation Roscosmos, for the ongoing safe operations of the International Space Station,” Josh Finch, a NASA spokesperson, said in an email to <em>The Verge</em>. “The new export control measures will continue to allow US-Russia civil space cooperation. No changes are planned to the agency’s support for ongoing in orbit and ground station operations.” <a href=\"https://www.theverge.com/2022/2/24/22947884/nasa-russia-space-cooperation-international-space-station-invasion\">Roscosmos also acknowledged in a statement</a> to <em>The Verge</em> amid the early hours of the invasion on Thursday that the two organizations are still working together.</p><p id=\"Nd92Nb\">That cooperation will be necessary, as there are quite a few important events planned for the month ahead. On March 18th, Roscosmos is scheduled to launch a crew of three Russian cosmonauts on board a Soyuz spacecraft, who will join the seven-person crew already on the ISS, according to NASA. That crew includes two cosmonauts, four NASA astronauts, and one German astronaut from the European Space Agency. Then on March 30th, NASA astronaut Mark Vande Hei and two cosmonauts will return to Earth inside another Soyuz capsule, the space agency says. Vande Hei’s safe return will rely on Russia.</p><div class=\"c-float-left\"><aside id=\"HKOxBw\"><q>Despite the need for cooperation right now, Rogozin made some fairly terrifying statements</q></aside></div><p id=\"JrC6OR\">But despite the need for cooperation right now, Rogozin made some fairly terrifying statements that insinuated the relationship between Roscosmos and NASA is cracking in light of the sanctions. And he painted a grim future scenario for the ISS if there’s a complete rift.</p><p id=\"vvGyl9\">“Maybe President Biden is off topic, so explain to him that the correction of the station’s orbit, its avoidance of dangerous rendezvous with space garbage, with which your talented businessmen have polluted the near-Earth orbit, is produced exclusively by the engines of the Russian Progress MS cargo ships,” Rogozin <a href=\"https://twitter.com/Rogozin/status/1496933973817425920?s=20&amp;t=0BwMq1liM2fhghyyT1h24Q\">tweeted in Russian</a>, translated by Google Translate. “If you block cooperation with us, who will save the ISS from an uncontrolled de-orbit and fall into the United States or Europe? There is also the option of dropping a 500-ton structure to India and China. Do you want to threaten them with such a prospect? The ISS does not fly over Russia, so all the risks are yours.”</p><p id=\"iYsCuf\">Plenty of people online tried to derive the precise meaning of Rogozin’s tweets, with some wondering if he might actually be threatening to de-orbit the space station over a populated area. What seems more likely is that Rogozin is implying that without Russia stepping in to take evasive measures, the ISS could potentially fall onto one of these countries, which are periodically below the station on its orbit. (The station does actually pass over parts of Russia, but mostly along the country’s southern border.)</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Gc_IIuRqhnF19WClujshJWzowW8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270832/iss054e047999_large.jpeg\">      <cite>Image: NASA</cite>      <figcaption><em>A Russian Progress spacecraft approaching the Zvezda module</em></figcaption>  </figure><p id=\"Ex1cMS\">It sounds like a scary scenario, but it’s not totally without merit. The altitude of objects in low Earth orbit, like the ISS, decays over time and they need adjustments to maintain their trajectory. And the reality is <a href=\"https://www.nasa.gov/pdf/167129main_Systems.pdf\">the ISS does primarily use Russia’s cargo spaceships</a>, called Progress, to periodically boost the station’s altitude and maintain the vehicle’s orbit around Earth. </p><p id=\"hHEiDo\">Whenever they’re docked to the ISS, the Progress spacecraft will use their onboard thrusters to give the station a little nudge — either to change the altitude or move it out of the way of debris. Another way Russia can boost the ISS is by using thrusters embedded in the country’s Zvezda module, though this option isn’t used as much. (There are also <a href=\"https://www.theverge.com/2021/7/29/22600306/uncontrolled-firing-from-russian-module-causes-brief-tug-of-war-on-international-space-station\">thrusters on Russia’s new Nauka science module</a>, which accidentally fired and spun up the whole space station in July.) The station thrusters and the Progress spacecraft are also sometimes needed to help control the space station’s attitude. Normally, NASA takes care of that with the use of what are known as Control Moment Gyros, spinning wheel devices that don’t use propellant and use momentum to control the station’s position. However, those gyros can get saturated over time, according to Hale, and the Russian thrusters are used to help with adjustments when the gyros become limited.</p><p id=\"cIYDNb\">Without Russia’s capabilities, all of this becomes much more complicated and a new solution would be needed. In response to Rogozin’s tweets, some online commenters wondered whether American cargo space capsules, like SpaceX’s Dragon or Northrop Grumman’s Cygnus could be used to boost the station like the Progress ships do. In fact, there is a Cygnus at the station right now, and in April, <a href=\"https://www.cbsnews.com/news/northrop-grumman-launches-international-space-station-supply-mission/\">it will test out a new orbit-boosting capability</a> for the space station. But as of now, neither the Dragon nor the Cygnus are meant to serve as long-term solutions.</p><div class=\"c-float-right\"><aside id=\"Ryrfsd\"><q>So far, that rupture has not totally extended to the countries’ partnership in civil space</q></aside></div><p id=\"7UXzM0\">While the thought of the ISS falling to Earth may seem tragic, it’s going to have to happen someday. The station cannot live up in space forever. And while the Biden administration <a href=\"https://blogs.nasa.gov/spacestation/2021/12/31/biden-harris-administration-extends-space-station-operations-through-2030/\">wants to extend the station’s life through 2030</a>, plans are already being made for how the station will be destroyed eventually. That will entail bringing the station down into Earth’s atmosphere in a controlled manner, over a region that is not populated. Since the ISS is such a massive structure, it’s likely that parts of it will survive the heated descent through Earth’s atmosphere, and NASA wants to ensure the safety of people on the ground.</p><p id=\"P2wMSh\">However, the current tentative plan for de-orbiting the space station also relies on Russia. NASA outlined a concept in January that would <a href=\"https://www.nasa.gov/sites/default/files/atoms/files/2022_iss_transition_report-final_tagged.pdf\">entail docking three Russian Progress ships to the ISS</a>, and using the thrusters on those vehicles to help guide the station down into the atmosphere in a safe way. Without Russia’s cooperation, that plan will have to change, though NASA did note the Cygnus could be involved somehow.</p><p id=\"kzEqGG\">“If the Russians pull the plug and went home and left us up there to our own devices, we would put an emergency program together to try to de-orbit the station with our own systems,” says Hale. “And I don’t know exactly what that would take the form of.”</p><p id=\"plBDRU\">For now, the easiest and safest path forward is continued cooperation between NASA and Roscosmos to both keep the station running and then bring it down safely. But the situation is particularly precarious, especially since Biden said there is a “complete rupture” in US-Russia relations. So far, that rupture has not totally extended to the countries’ partnership in civil space, but Rogozin’s comments don’t provide much comfort. In a recent tweet, Rogozin hinted at more updates to come. “In the meantime, we continue to analyze the new US sanctions to detail our response,” <a href=\"https://twitter.com/Rogozin/status/1497087192786776067?s=20&amp;t=0BwMq1liM2fhghyyT1h24Q\">he wrote</a>.</p><p id=\"jRrvlR\"></p><p id=\"8KOirv\"></p><p id=\"maimIK\"></p><p id=\"nByKeD\"></p><p id=\"pK3x0c\"></p><p id=\"uTgbc7\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/682jCgHDTRpQeu6EGWSdHJTcTYg=/0x399:5568x3314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270803/51710869322_c8c7abe29a_o.jpg",
  "description": "But NASA and Roscosmos are working together for now",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}