{
  "title": "Samsung Galaxy S22 Ultra review: notably unique",
  "url": "https://www.theverge.com/22941246/samsung-galaxy-s22-ultra-review-price-screen-specs-stylus",
  "date": "2022-02-21T15:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p>A worthy Note successor that stands alone</p> <p class=\"p--has-dropcap p-large-text\" id=\"dPvYSB\">Phones in a flagship lineup have come to feel like variations on a theme. There’s the base model, the <em>bigger</em> base model, and then the <em>biggest</em> model with an extra camera and some other minor hardware upgrades. Features, screen size, and cost all increase in increments as you go up the chain, but you’re more or less getting the same phone in three different flavors. </p><p id=\"T2YVYD\">That’s been true of Samsung phones for the past few years, but it’s not the case anymore — the $1,199 Galaxy S22 Ultra sits at the top of this year’s lineup as an entirely different option. It’s the first S series phone to include a built-in stylus, a feature it’s inheriting from the evidently now-retired Galaxy Note series. On top of that, it still offers a very good 10x optical zoom, as well as some appealing updates to its photography features. It happens to be a great phone, too, but despite its place in Samsung’s mainstream S series, it still feels like the enthusiast device that the Note series represented. </p><div id=\"OJFbPD\"><div data-anthem-component=\"scorecard:11057432\"></div></div><p id=\"G5lL9T\">Samsung has, at least, made the job of deciding which of this trio of phones is for you very easy. If you miss the Note and you love the stylus life, get the S22 Ultra. There’s nothing else like it in Samsung’s lineup or anywhere else on the market, really. If you’re just slightly curious about the stylus, or the 10x zoom, or you just want a really nice big-screened phone without a lot of fuss, then you’re probably better off with the S22 Plus. It’s not for everyone, but for a few, the S22 Ultra is a truly great device.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qJXpdB6Y_Vfsjl2s7Z2y7FqTyJ4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256281/ajohnson_220216_5032_0008.jpg\">      <figcaption><em>The Ultra clearly stands apart in Samsung’s S22 lineup.</em></figcaption>  </figure></div><h2 id=\"gCf8y8\">Samsung S22 Ultra design and hardware</h2><p class=\"p--has-dropcap\" id=\"jON9tm\">Different it may be, there’s still plenty of common ground between the Ultra and its S22 and S22 Plus siblings. All three models include (in the US) Qualcomm’s latest, the Snapdragon 8 Gen 1 processor, as well as IP68 weather sealing, and Gorilla Glass Victus Plus on the front and back. The Ultra and S22 Plus have OLED screens with higher 1,750 nits peak brightness, but all three have a top refresh rate of 120Hz. Only the Ultra uses an LTPO display, which allows the screen to change its refresh rate more than the other models, which in theory helps save battery life. It’s a huge, 6.8-inch 1440 x 3088 panel, so every bit of power saving can make a big difference.</p><p id=\"FvkZU2\">Not surprisingly, the display itself is excellent. At its default “vivid” setting, it’s a little on the warm side, but I only noticed this looking at it side by side with the Pixel 6. Colors are, indeed, vivid but not to the point of oversaturation. There’s also a slightly cool color shift when viewed from extreme angles, but nothing that bothered me in day-to-day use. It was also plenty bright for me outside, but I live in Seattle, so I didn’t exactly push it to the limit here.</p><p id=\"gnCGvx\">The Ultra stands apart with a boxier design lifted straight from the Galaxy Note and, of course, that built-in S Pen silo. While the S22 and S22 Plus follow last year’s design cues with rounded corners and a camera bump that blends into the side rail of the phone, the S22 Ultra embraces chaos and skips the camera bump altogether. Four camera lenses (and a laser autofocus sensor) protrude from the back plate of the device housed in… nothing at all. More than one person on Twitter told me it looks like a spider. And it is weird at first, but I’ve grown to like it. Maybe more phone makers will follow Samsung’s lead. Who knows? I’m here for it. </p><div><aside id=\"FRrK4s\"><q>the S22 Ultra embraces chaos and skips the camera bump altogether</q></aside></div><p id=\"SsxJfL\">I was a little worried that the protruding lenses would catch on pockets, but that hasn’t been a problem. The spaces between the lenses, however, are serious dust and lint traps. I have faith that the IP68 sealing will keep dust out of the cameras, so it’s more of an aesthetic thing if you’re meticulous about keeping your phone dust-free. And if you can’t live your life at these kinds of speeds, Samsung sells a case that will very neatly eliminate the valleys between lenses.</p><p id=\"pZ5Gjo\">The rear camera array is one way you can immediately differentiate the Ultra from the S22 and S22 Plus, but it also stands apart with curved edges on the long sides of its screen, where the others have flat displays. It looks nice and makes the tiny bezels on the sides all but disappear, but I ran my stylus off the edge of the screen one too many times, expecting a flat surface where there wasn’t one. Personally, I could live with a little bit of bezel to avoid the whole situation.</p><p id=\"ejwlTs\">The S22 Ultra supports 45W fast wired charging, but you’ll need to buy the $50 power brick separately. Spending $1,200 on a phone and having to spend another $50 on a charger is about as annoying as paying $12 for Wi-Fi on a $500 flight. If you preordered the Ultra, I hope you put some of your Samsung store credit toward one. There’s also 15W wireless charging. I utilized this extensively during my review, and it usually charged the half-depleted battery back up to 100 percent in under two hours, which is fine for me. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tEb2j0E1-wIFn5BYVZyZdm8jkm4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256279/ajohnson_220216_5032_0006.jpg\">      <figcaption><em>The S Pen comes with a powerful set of stylus features that can be overwhelming to a newcomer.</em></figcaption>  </figure></div><h2 id=\"nBVFnq\">Samsung S Pen</h2><p class=\"p--has-dropcap\" id=\"MMdOG3\">While the S21 Ultra officially supported the S Pen, it didn’t include a built-in silo for storage, which is sort of… half supporting the S Pen. The S22 Ultra includes full support <em>and</em> stylus storage — the real deal. There’s not a lot that’s new to the S Pen or stylus features this time around, though Samsung does say it has reduced latency by 70 percent. It’s hard to say if that’s accurate since it’s a matter of milliseconds, but either way, writing with the S Pen feels fluid, and recognition is speedy.</p><p id=\"BHNS01\">Using the S Pen can be as simple as putting the digital pen to screen, scribbling yourself a note, and calling it a day. Or, you can go really deep with the stylus features, which I suspect a lot of Note power users do. It took me a little while to find my way around just everything you can do with the stylus throughout the system, but especially in Samsung’s Notes app. I found at least three different ways to convert handwriting to text in the app, not counting the option to use the keyboard in handwriting mode and go about it that way. It’s a little overwhelming.</p><div class=\"c-float-right c-float-hang\"><aside id=\"ocWiXg\"><q>You can go deep with the stylus features or stay on the surface level</q></aside></div><p id=\"bGiySW\">There are other ways to use the S Pen throughout the system aside from scribbling notes and watching them magically become human-readable text. It’s very handy for photo editing or grabbing a screenshot and circling important information. You can use it to trace a shape and clip something out of an image, like a picture you took of your dishwasher model number (I can attest this is very handy). There are Air Actions, too, in which you use the S Pen as a kind of remote control in certain apps without touching the screen, which work okay but don’t feel like they solve a real problem.</p><p id=\"QXSdOx\">You can go deep with the stylus features or stay on the surface level, but if you suspect that you’re the kind of person who would use the stylus a few times and then forget about it, then the S22 Ultra probably isn’t for you. I do think it’s for someone who likes to be able to scribble out a quick note without unlocking their phone or make a to-do list with a pen rather than a digital keyboard. I imagine that digital artists would also make good use of the S Pen and its many digital brush stroke options. It’s also more responsive and flexible for sketching than a simple passive stylus. Note fans will feel right at home, but unless you’re sure you can embrace the stylus life, you’re likely better off with a regular old stylus-free phone.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GpzI-bsKvg-AhyxQdZooDRRo5As=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256278/ajohnson_220216_5032_0005.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The Ultra’s powerful set of features and huge, bright screen make it a power-hungry device.</em></figcaption>  </figure></div><h2 id=\"an59pz\">Samsung S22 Ultra performance</h2><p class=\"p--has-dropcap\" id=\"JazE4M\">In everyday use, the S22 Ultra performs like the $1,200 flagship that it is. Jumping from app to app is quick, graphics-intensive games run smoothly, and everything looks buttery smooth on the 120Hz display. In my testing, it was a very rare occurrence to see the screen stutter as I scrolled, and in the cases where it did, I don’t think it was the phone’s fault (I’m looking at you, Twitter for Android).</p><p id=\"8eyv8Z\">The phone does get noticeably warm with intensive tasks like gaming and using the Expert RAW app. I never saw slowdowns as a result while playing <em>Genshin Impact</em> for about half an hour, but Samsung’s Expert RAW app does take progressively longer to process (very large) RAW file after RAW file if you just keep pressing the shutter. You can’t take another photo until the last one is done processing, so there’s nothing to do except wait. </p><div class=\"c-float-left c-float-hang\"><aside id=\"7o737o\"><q>the power users who are certainly the Ultra’s target audience will have to keep an eye on battery life</q></aside></div><p id=\"AuGf06\">The more significant bad news is that the Ultra’s 5,000mAh battery doesn’t perform quite as well. On days of lighter use with a lot of time on Wi-Fi, plenty of social media scrolling but not much video or gameplay, I got through with about 50 percent battery left by the evening. It doesn’t take a lot of effort, though, to drain the battery much lower in a single day. </p><p id=\"wIbiFm\">With screen brightness cranked up, the always-on display always (not sometimes) on, and about an hour of video play and gaming, I was down below the 20 percent mark by the end of the day. That’s not exactly a torture test, so the power users who are certainly the Ultra’s target audience will probably have to keep an eye on battery life more than they’d like to. That’s disappointing from a flagship phone with a huge battery.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/D4SEQFXM5lXhEQepXqA27DJF1hs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256273/ajohnson_220216_5032_0003.jpg\">      <figcaption><em>Two stabilized, telephoto cameras and a 108-megapixel main camera are a key part of the S22 Ultra’s strong set of photography features.</em></figcaption>  </figure></div><h2 id=\"EY5Nrz\">Samsung S22 Ultra camera</h2><p class=\"p--has-dropcap\" id=\"CYcoM1\">There are a few minor differences in the S22 Ultra’s camera hardware compared to last year’s — the telephoto lenses are just a little wider, for example — but it’s largely the same setup. Here’s what you get:</p><ul><li id=\"auJLNT\">108-megapixel f/1.8 standard wide with OIS</li><li id=\"zVgQLe\">10-megapixel f/2.4 3x telephoto with OIS</li><li id=\"sPIFM1\">10-megapixel f/4.9 10x telephoto with OIS</li><li id=\"ZkzTFl\">12-megapixel f/2.2 ultrawide</li><li id=\"ofhLPv\">40-megapixel f/2.2 selfie</li></ul><p id=\"sHsCsG\">Since the hardware is mostly unchanged, what was true of last year’s model is still true this year: it’s a great camera system overall, with a couple of quirks. The 10x optical zoom continues to be really impressive, Samsung is still cranking up the blue skies and the saturation to 11, and 100x “Space Zoom” is still a gimmick. </p><div id=\"5K2dHO\"><div data-anthem-component=\"gallery:11057610\"></div></div><p id=\"0QYDHw\">Video capabilities are largely the same, too. There’s a new autoframing feature, which will track up to 10 people and adjust automatically as people move in and out of frame. There’s also an auto frame rate feature to adjust frame rate on the fly to account for brighter or darker conditions. Video recording resolution still tops out at 8K/24p for the main camera and 4K/60p for the selfie cam.  </p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rQDv1km4gdse0znKjhQvg_p06aQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23255912/20220211_165119_vert.jpg\">      <figcaption><em>It’s not perfect, but depth mapping does a better job of keeping fine detail sharp rather than blurring it into the background</em></figcaption>  </figure></div><p id=\"dAMK5B\">This year’s photo improvements are mostly software-based, which makes them sound boring, but they’re not. Portrait mode photos have been improved with better, more detailed depth mapping (and, importantly, official support for pet portraits). The phone is better able to identify small details on a subject like individual hairs and keep them sharp rather than blurring them into the background. </p><p id=\"UkNrn3\">This change has resulted in some of the most impressive portrait mode photos I’ve seen from a smartphone yet. Portraits from the wide lens still aren’t totally convincing — even if the depth mapping is better, elements in the foreground are sharp where they shouldn’t be. But photos from the 3x zoom in good lighting look excellent — pets and humans alike. It can still get tripped up on some details, but it gets a lot right, even wispy hair and glasses.</p><p id=\"aoJPGR\">I’m a little less enthusiastic about the night photography improvements — they’re fine, just not as impressive. You can now use night mode and shoot a 108-megapixel, full-res image at the same time where previously you could do one or the other. This is only possible in <em>very</em> dark conditions, where a little moon icon will appear on-screen to enable night mode. Without night mode, a high-res image in these conditions looks quite bad, so the bar is sort of low to start with. You get a slightly better 108-megapixel image rather than a very noisy one.</p><div id=\"OxhQl6\"><div data-anthem-component=\"imageslider:11057470\"></div></div><p id=\"ccp3NY\">It’s also possible to apply night mode to the selfie camera, and similarly, it has to be really dark for the option to appear. I’m impressed that the camera can find enough light to make *any* usable photo of me sitting very still in near-total darkness, but the results are so unflattering that I think I’d rather just have no photo at all. </p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/11L1IcePGfvf5mmDLsygRum4Gtw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23255972/20220214_175714_vert.jpg\">      <figcaption><em>This is one of the better shots I took with the selfie camera with portrait and night mode enabled, and reader, I do not like it.</em></figcaption>  </figure></div><p id=\"8OkMB7\">Samsung has also officially graduated its <a href=\"https://www.theverge.com/2021/11/24/22800655/samsung-expert-raw-app-beta-telephoto-pro-mode\">Expert RAW app</a> out of beta with the S22 Ultra, a multi-frame RAW capture app similar to Apple’s ProRAW. Expert RAW captures multiple frames and merges them into a single DNG file, combining the benefits of computational photography with the post-processing flexibility of a RAW file. To use the feature, you need to download the Expert RAW app from the Galaxy app store — it’s an entirely separate camera app, and it’s not preloaded on the phone. It provides access to manual exposure controls, and you can use it with any of the rear cameras.</p><p id=\"pEQx3E\">The resulting RAW files are huge, but they’re more malleable than a traditional, single-frame RAW file from the standard camera app. Pushing shadows all the way up on a standard RAW photo reveals some unpleasant banding. The multi-frame RAW is noisy but tolerates the edit better because it has that much more information to work with. Is this a difference you’re going to see on an Instagram-sized image? Probably not. But if you’re a photo geek who likes to tinker with post-processing, it’s a really nice tool to have on hand for the occasions that call for it. </p><div id=\"AASlBT\"><div data-anthem-component=\"imageslider:11057502\"></div></div><p id=\"LB6yE5\">One logistical note — there’s a shortcut in the Expert RAW app to take your photo directly into Lightroom <em>for Samsung</em> to edit it. This is a version of Lightroom Mobile that you need to download from — you guessed it — the Galaxy app store. Samsung will give you a two-month free trial of the app, but after that, you’ll need an Adobe license, which will run you a minimum of $120 for a year. Or, you know, just download Snapseed for free — Expert RAW gives you a standard DNG file you can take to any photo editing software that supports it.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kdZyhIQcca5KJ_EjO4ZQ_SIiHYE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256280/ajohnson_220216_5032_0007.jpg\">      <figcaption><em>The S22 series ships with One UI 4.1, which is Samsung’s Android 12 skin.</em></figcaption>  </figure></div><h2 id=\"M0Pjdo\">Samsung S22 Ultra software</h2><p class=\"p--has-dropcap\" id=\"yP1pTi\">The Galaxy S22 Ultra ships with One UI 4.1, Samsung’s take on Android 12. I like it, for the most part. I wasn’t sure how I’d feel about the whole “match the UX to your wallpaper” thing, but it’s actually nice. This is a major new feature of Android 12, and though Samsung’s implementation doesn’t go nearly as far as Google’s version for Pixel phones, it’s just enough to make the phone feel a little more personal to me.</p><p id=\"4s1gwy\">Samsung has also mercifully removed the ads that once sat at the top of the page on the weather app. But just when I feel like the company is scaling back its often in-your-face pre-downloads and ads, I get a push notification about a promotion for Samsung Credit if I buy an S22. On this S22 Ultra. Or a Samsung Pay cash back offer slides across my screen when I open Hulu. This feels especially frustrating and out of place on a $1,200 phone, and I do not care for it.</p><p id=\"9BuU4D\">As much as I dislike some of Samsung’s UI choices, the company comes through where it counts with a very good support policy. The S22 series <a href=\"https://www.theverge.com/2022/2/9/22923577/samsung-galaxy-unpacked-android-upgrades-4-years\">will get “up to” four generations of Android OS updates</a>, which is one more year than Google promises for its own devices and just about the best policy you’ll find for an Android phone — if the company does make good on four OS upgrades. I’m not a climate scientist, but I’m willing to bet that <em>not</em> making people buy a new phone every two years has a bigger environmental impact than recycling fishing nets into the phone chassis <a href=\"https://www.theverge.com/2022/2/7/22921361/galaxy-s22-plastic-recycled-fishing-nets\">or whatever it’s doing</a>.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8ihIZmwtO77DmD3NBQ7V18pVgX0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23256275/ajohnson_220216_5032_0004.jpg\">      <figcaption><em>The Galaxy S22 Ultra stands tall with a unique feature set among flagship smartphones.</em></figcaption>  </figure></div><p id=\"fYDEhI\">It’s hard to come up with things that the Galaxy S22 Ultra can’t do. Can I make a GIF from a video I took and paste it into a note that’s pinned to my home screen? Yes. Can I take a clear photo of the top of Seattle’s Smith Tower while standing several blocks away at street level? Yes. Can I take a picture of my dishwasher’s model number, convert it to text, and paste it into Google as I search for a part that mysteriously vanished into thin air? Also yes. </p><p id=\"xFmaxu\">It can do just about anything you can reasonably expect a slab-style phone in 2022 to do. But the S22 Ultra is not a phone for just anyone. Do you really want to embrace the stylus life, or are you merely stylus-curious? Will you really use that 10x lens again and again, or will you just take a few photos with it and forget that it’s there? Do you plan to take and edit 40-plus-MB RAW files on your phone more than once or twice? Take a good look in the mirror and ask yourself these questions before you spend $1,200 on this phone (and potentially another $50 on a charger).</p><div><aside id=\"72kuXt\"><q>If you’re someone who would get the most out of the Ultra, you probably already know it</q></aside></div><p id=\"GYN4ux\">Really, Samsung has already done the work of judging whether this phone is for you. If you’re someone who would get the most out of the Ultra, you probably already know it. If you’re questioning whether it would be worth it, then you’d probably be just fine with the S22 Plus.</p><p class=\"c-end-para\" id=\"k22oLe\">For someone who does plan to make regular use of its powerful but rather niche features, the S22 Ultra will be a phone like no other on the market. Some UI quirks remain, and battery life is disappointing. But if you can live with these shortcomings and navigate the sometimes steep learning curve of the S Pen life, then you’ll be well rewarded with a device that’s truly one of a kind.</p><p id=\"zFfdlh\"><em>Photography by Allison Johnson / The Verge.</em></p><div><div id=\"iRXa3w\"><div data-anthem-component=\"aside:11057597\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/oSdUK6YvIflCnLV3pN7Hi8gRd-0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23256271/ajohnson_220216_5032_0001.jpg",
  "description": "The Note is alive and well.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}