{
  "title": "Samsung’s Galaxy S22 is $100 off at Best Buy today only",
  "url": "https://www.theverge.com/good-deals/2022/4/1/23004624/samsung-galaxy-s22-hp-aero-laptop-msi-monitor-chromebook-2-apple-ipad-air-deal-sale",
  "date": "2022-04-01T15:08:53.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/L9zS0AKlT-1h3heLC1UCkrpehLk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70698386/ajohnson_220216_5033_0008.0.jpg\" />        <figcaption><em>Save $100 on the Samsung Galaxy S22 at Best Buy for today only</em> | Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p id=\"N6tHGx\">We’re kicking off April Fools’ Day with a deal that’s dead serious. For today only, Best Buy is knocking $100 off the price of the unlocked Samsung Galaxy S22. The 128GB and 256GB models of the S22 are currently discounted to $699.99 and $749.99, respectively. Just note that this discount only applies to the standard model of the S22, not the S22 Plus or Ultra. You don’t have to activate this phone when you purchase it either, just make sure to select “activate later” before adding it to your cart. This is the first discount we’ve seen on the latest model of Samsung’s smartphone since its release, making this a prime opportunity to upgrade.</p><p id=\"aUcHw7\">The S22 features an impressive array of specs, including a Snapdragon 8 Gen 1 chipset, a 50MP main rear camera that reviewer Allison Johnson says delivers “top-notch” results, and a 10MP front-facing camera. With features like these and more, it’s no wonder that we consider the Galaxy S22 the default phone for Android users, despite the less-than-stellar battery life. Overall, this is an excellent deal on a speedy phone that has outstanding build quality. <a href=\"https://www.theverge.com/22955139/samsung-galaxy-s22-plus-review\"><strong>Read our review</strong></a>.</p><div id=\"rKjWcC\"><div data-anthem-component=\"productcard:11037933\"></div></div><p id=\"YWnrH4\">HP’s budget-friendly Pavilion Aero laptop just got a little cheaper. Typically $999.99, you can <a href=\"https://www.awin1.com/cread.php?awinmid=7168&amp;awinaffid=173843&amp;ued=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fpdp%2Fhp-pavilion-aero-laptop-13-be0097nr%3F%26a%3D1%26jumpid%3Dcs_con_nc_ns%26utm_medium%3Dcs%26utm_source%3Dga%26utm_campaign%3DHP-Store_US_All_CPS_All_AMD_Google_All_Smart-PLA%26utm_content%3Dsp%26adid%3D528037761309%26addisttype%3Du%26406J8UA%2523ABA%26cq_src%3Dgoogle_ads%26cq_cmp%3D13541623146%26cq_con%3D123108433905%26cq_term%3D%26cq_med%3D%26cq_plac%3D%26cq_net%3Du%26cq_pos%3D%26cq_plt%3Dgp%26gclid%3DCjwKCAjwopWSBhB6EiwAjxmqDbPctFfpsQmRAldDLiXoJ2psA18EqUgUnD3rX1-53KIeK4VwDEm-AhoCyHwQAvD_BwE%26gclsrc%3Daw.ds\" rel=\"sponsored nofollow noopener\" target=\"_blank\">currently grab a capable configuration on the HP store for just $749.99</a>, its lowest price ever. The lightweight, 13-inch HP Pavilion Aero is a Pavilion in name only, boasting excellent specs and build quality at a competitive price point. </p><p id=\"J5R63V\">This model of the Aero 13 is equipped with an AMD Ryzen 5800U processor, 16GB of RAM, and 512GB of storage out of the box, with the option of adding up to an additional 1TB using a microSD card. While its reliance on integrated AMD graphics means it can’t handle much in the way of gaming, the laptop’s octa-core CPU means that the Aero 13 should be able to handle a variety of applications. While it isn’t a dealbreaker at this price, it’s worth noting that the Aero 13 comes with a significant amount of bloatware pre-installed, which will supply an egregious number of pop-ups until you uninstall all of it. <a href=\"https://www.theverge.com/22632318/hp-pavilion-aero-13-2021-amd-review\"><strong>Read our review</strong></a>.</p><div id=\"eBz2gI\"><div data-anthem-component=\"productcard:10730332\"></div></div><p id=\"K9Vtex\">Gaming monitor deals that are <em>this </em>good don’t come around every day. Right now, the MSI Optix 32-inch curved QHD gaming monitor is matching its best price ever. This particular monitor usually sells for $359.99, but it’s on sale at <a href=\"https://adorama.rfvk.net/c/482924/51926/1036?u=https%3A%2F%2Fwww.adorama.com%2Fmsiom321cqr.html%3Fsterm%3DRqpQXlWXCxyIUPzRYH2TSQJ8UkGQKSVB1yfEVg0&amp;sharedid=verge\">Adorama</a> and <a href=\"https://www.amazon.com/MSI-Non-Glare-Adjustable-Optix-MAG321CQR/dp/B07NQG1FFB/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> for $289.99. Currently, this is one of the best prices you can find for a gaming monitor with these specs, especially from a brand like MSI. </p><p id=\"YecL5k\">MSI’s MAG321CQR, as it’s officially called, is equipped with many of the features you’d expect from a mid-range gaming monitor. This includes 1440p resolution, a 144Hz refresh rate, a 1ms response time, and AMD FreeSync adaptive sync support for AMD GPUs, which come together to create a gaming experience that should look great and run smoothly. The back of the monitor is equipped with RGB lighting, but more importantly, it has a wide variety of connectivity options. It includes a pair of HDMI 2.0 ports, a single DisplayPort hookup, a pair of USB-A passthrough ports with the option for data transfer, and a 3.5mm audio jack. While the monitor is compatible with VESA mounts, the stand it comes packaged with is height, tilt, and swivel adjustable. </p><div id=\"YjS9ag\"><div data-anthem-component=\"productcard:10871048\"></div></div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/N295NRrR8JpNZOwYc5jNuy8xBG8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360158/Razer_Iskur_X_Lifestyle.jpg\">      <figcaption><em>Both the Iskur X and Enki gaming chairs are discounted</em></figcaption>  </figure><p id=\"hzDox0\">Today, you can find discounts on a pair of Razer’s serpentine gaming chairs. Both the Razer Iskur X and Razer Enki are selling for less than their regular prices of $399.99. The Iskur X is currently discounted to $249.99 at <a href=\"https://shop-links.co/cgWiDvOdhpz\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> and <a href=\"https://www.amazon.com/Razer-Iskur-Ergonomic-Gaming-Chair-Steel-Reinforced/dp/B092CJWKP6?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a>, while the newer Enki is on sale for $349.99 at <a href=\"https://shop-links.co/cgWiFh17eqJ\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> and <a href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM&amp;mid=24348&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Fhome%2Ffurniture%2Fchairs%2Fproducts%2Frazer-enki-all-day-comfort-gaming-chair%2F307905.html%3Futm_source%3Dgoogle%26utm_medium%3Dfeeds%26utm_campaign%3Dunpaid_listings%26a%3D1\" rel=\"sponsored nofollow noopener\" target=\"_blank\">GameStop</a>. Both of these models have been sitting at this price (pun intended) for about a month, but who knows? They could return to full price soon.</p><p id=\"NqvMmb\">As for which model is the better fit for you, there are two big differences between them to take into account. The Iskur primarily uses synthetic leather, whereas the Enki uses a mix of synthetic leather and fabric for the seat. The Iskur X also lacks lumbar support and head cushioning, whereas the Enki comes packaged with a headrest and has lumbar support integrated into the back of the chair.</p><p id=\"ntcGOM\">While choosing a gaming chair can be a highly subjective process — and we haven’t had the chance to try these out ourselves — it’s rare to find gaming chairs with similar features for a better price. By comparison, many of the gaming chairs from Secretlab can cost over $500, even when on sale. Secretlab does have a better warranty and return policy, but the three-year standard warranty on Razer’s gaming chairs is still pretty robust.</p><div id=\"sT8yp2\"><div data-anthem-component=\"productcard:11122983\"></div></div><div id=\"v0XuUA\"><div data-anthem-component=\"productcard:11122991\"></div></div><p id=\"qePzPd\">If you’re looking to pick up a Chromebook, you still have time to cash in on the largest discount we’ve seen to date on Samsung’s eye-catching red or gray Galaxy Chromebook 2. Normally, the higher-end configuration equipped with an Intel Core i3-10110U processor sells for $699.99, but you can currently find this lightweight laptop on sale for $549.99 at both <a href=\"https://www.amazon.com/dp/B097WD9P4K/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and <a href=\"https://shop-links.co/cgM0O19vqGU\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a>. Out of the box, this configuration comes equipped with 8GB of RAM and 128GB of storage; but that latter spec can be expanded with a microSD card.</p><p id=\"bEuwrJ\">As for the design, the 13-inch touchscreen offers 1080p resolution and can be transformed into a tablet thanks to its 2-in-1 design. While its specs don’t allow for much heavy lifting in terms of processing power, the Galaxy Chromebook 2 also features a 3.5mm audio jack and a pair of USB-C ports that can support peripherals and external displays if you need them. <a href=\"https://www.theverge.com/22301481/samsung-galaxy-chromebook-2-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review</strong></a>.</p><div id=\"D8AXD5\"><div data-anthem-component=\"productcard:11109103\"></div></div>  <figure class=\"e-image\">        <img alt=\"The new iPad Air with Magic Keyboard and Apple Pencil\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uU0ZELodKHp9OMSCN3xNlwzpPww=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21975638/vpavic_4244_20201020_0001.jpg\">      <figcaption><em>The 2020 iPad Air is down to $469.99</em></figcaption>  </figure><p id=\"wUKm9h\">The fourth-generation 64GB iPad Air from 2020 originally sold for $599.99 but is <a href=\"https://www.amazon.com/dp/B08J66ZMY7?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">currently discounted to $469.99</a> at Amazon with a coupon that gets applied at checkout. While this price isn’t unheard of, this is still one of the better prices we’ve seen for the Wi-Fi-equipped iPad Air. This discount only applies to the gray and green colorways of the lightweight Apple slab but remains one of the best discounts on this device to date. While the iPad Air recently received a 2022 update that included Apple’s M1 processor, the 2020 model still has plenty of power under the hood, thanks to its A14 Bionic CPU.</p><p id=\"OoA5um\">This model of the iPad Air features an excellent 10.9-inch display, a 12MP rear camera, and a 7MP front-facing camera for video chatting. A couple of other noteworthy selling points include a USB-C connection for charging and compatibility with the latest accessories for the iPad Pro like the second-gen Apple Pencil and Apple Magic Keyboard. <a href=\"https://www.theverge.com/21525780/apple-ipad-air-2020-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review</strong></a>. </p><div id=\"FUcGKL\"><div data-anthem-component=\"productcard:11118462\"></div></div><aside id=\"JrYqDP\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"deals\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/a64WHRqPpsIimI7GEsKYnbT_MWI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262018/ajohnson_220216_5033_0008.jpg",
  "description": "The first discount on this phone since its release",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}