{
  "title": "Samsung Galaxy A53 5G review: a good deal gets better",
  "url": "https://www.theverge.com/23015400/samsung-galaxy-a53-5g-review-specs-price-screen-camera",
  "date": "2022-04-08T16:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p>An excellent midrange feature set at the right price</p> <p class=\"p--has-dropcap p-large-text\" id=\"yK5Rl2\">How do you make a good midrange phone better? If you’re Samsung, you swap in a house-made processor, bump up the battery capacity, ditch the in-box charger, and lower the price by $50. Follow that recipe and you get the $449 Galaxy A53 5G.</p><p id=\"MSYqz1\">Samsung also followed the cardinal rule of not fixing what wasn’t broken. The cameras, screen, and design are all unchanged from last year’s model. Performance is about the same, too, even with the switch from a Snapdragon processor to a new, unproven Exynos chipset. Losing the previously included charging brick is a bummer, but it was going to happen eventually.</p><div id=\"9bgrr7\"><div data-anthem-component=\"scorecard:11134009\"></div></div><p id=\"bK8S01\">Even better than the minor spec upgrades, Samsung has improved its already strong software support policy. The A53 5G will get four years of Android OS platform updates and five years of security updates. That’s as long as Google supports its flagship Pixel 6 phones with security updates. Don’t expect to get <em>frequent </em>updates toward the end of its lifespan, but getting any kind of update five years after launch is fantastic for a midrange Android device.</p><p id=\"zz1LmO\">Samsung has addressed some of our software complaints, too. The A53 5G ships with Android 12-based One UI 4.1, which is a little tidier than the version that came before it. It is still a Samsung device, though, and Samsung still desperately wants you to live in its world with its own app store, virtual assistant, and constellation of pre-downloaded apps. </p><p id=\"FKSZs5\">If you’re happy living in Samsung’s world, or at least don’t mind putting up with it, then the Galaxy A53 5G should reward you with an excellent return on your investment. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MQjaon31NPl7i03H4CO4G69ZMps=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371620/ajohnson_220405_5129_0002.jpg\">      <figcaption><em>The A53 includes a 6.5-inch OLED with 120Hz refresh rate, with rich contrast and smooth animations.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"yoEB5G\">The Galaxy A53 5G is the first Samsung phone sold in the US to use an Exynos chipset since 2015. Samsung has continued using its own-brand chips in international versions of its phones (and they’ve <a href=\"https://www.theverge.com/2021/8/10/22617873/samsung-exynos-w920-chip-announced-galaxy-watch-4\">shown up in recent wearables</a>). But in the US, it’s been all Qualcomm or MediaTek starting with the Galaxy S7. The A53 5G and A33 5G are the first devices anywhere to use this particular 1280 Exynos processor. It’s paired with 6GB of RAM, which is more than you’ll find on most other midrange phones.</p><p id=\"M3LSfX\">Performance seems to be about on par with the A52 5G. Using them side by side, sometimes there’s a slightly longer lag after tapping on the search bar before the keyboard pops up on the A53. But just as often, the A53 will open an app faster than the A52. In practical use, I’d call it a toss-up between the two. I notice slight hesitations here and there throughout my daily use, but all within the normal range for a midrange phone and nothing I couldn’t live with. It will even run <em>Genshin Impact</em>, albeit with some frequent stutters when there’s a lot happening on screen. I’d expect overall performance to hold up reasonably well, even after three or four years of software updates, too.</p><p id=\"P4Aenr\">Whether you buy the phone unlocked or through a carrier in the US, you’ll have one choice of storage options: 128GB. That’s a healthy amount for this price range, and if you run out of space after a few years, there’s a microSD slot for additional storage. </p><div class=\"c-float-right c-float-hang\"><aside id=\"n7PRzA\"><q>At this price point, it’s about the best you can expect from a phone screen</q></aside></div><p id=\"oJa0dx\">The A53 5G features a 6.5-inch OLED with a 120Hz refresh rate, and it offers a good level of detail with 1080p resolution. It can be a little tricky to see in very bright outdoor conditions, but in all other situations, it’s a rich, vibrant display, and the fast refresh rate keeps things looking smooth. At this price point, it’s about the best you can expect from a phone screen.</p><p id=\"ojcm7H\">There’s an in-display fingerprint scanner for biometric unlocking. Samsung says it’s the same one used in the A52 5G, and I believe them. But I’m having an easier time with it than I did in the previous model, and I feel like I’m getting fewer prompts to retry. Maybe the software got better. Maybe I have more patience now. Who can say? It’s a beat slower than the <em>very</em> best optical fingerprint sensors in flagships, like the OnePlus 10 Pro, but it’s generally accurate and quick enough not to cause any major frustration day to day. </p><p id=\"gMrA7S\">The A53 5G features IP67 dust and water resistance, which is still rare in this class. That means the A53 5G should stand up to splashes, spills, and some water submersion. If you’ve ever seen a phone die a watery death after an accidental drop in a body of water (let’s not talk about what happened at West Seattle Summer Fest 2019), then you know how valuable that water resistance is. </p><p id=\"NJSTal\">The other key spec improvement is the upgrade from a 4,500mAh battery to a 5,000mAh capacity. Samsung claims the new battery will get you through two full days of use, and if you’re a light user or on Wi-Fi most of the time, then that’s a fair claim. I can get through a full day no problem, even streaming some video and spending most of my time on 5G, but not quite two days. I did push it pretty hard on day two by downloading <em>Genshin Impact</em>, but I only got to about 2PM when I started getting prompts to charge the phone. Light users can expect to get through two days on a charge, but if you’re a moderate or heavy user, it might be best to recharge overnight to avoid dipping into the single-digit percentages.</p><div><aside id=\"2OYv0R\"><q>There’s no charging brick included in the A53’s box, and not even a USB-C cable is included</q></aside></div><p id=\"BSFGDQ\">There’s no charging brick included in the A53’s box, and not even a USB-C cable is included. The headphone jack that the A52 included is gone, too, because all good things must end. These are a couple of flagship features trickling down to the A53, and I wish they hadn’t.</p><p id=\"k0CBQr\">If you buy the A53 through AT&amp;T, T-Mobile, or unlocked, you’ll get a version of the device that’s compatible only with low- and mid-band 5G — no superfast high-band millimeter wave (mmWave). This is fine — mmWave is hard to find anyway. The version of the phone sold through Verizon <em>does</em> offer mmWave support and costs $50 more. </p><p id=\"juA6FR\">If you’re buying your phone through Verizon, you are likely paying for it on your monthly bill rather than at the full retail price — in which case the mmWave version is your only choice. If you do have the option of buying the phone unlocked, go ahead and save yourself $50 and just buy it without mmWave even if you’re on Verizon. You won’t miss it, and <a href=\"https://www.theverge.com/22606623/best-cell-phone-plans-verizon-att-t-mobile\">your wireless plan might not even include it</a> to begin with.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DU4qKAMnzWn2KYHnzPjKqRHl9UE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371621/ajohnson_220405_5129_0003.jpg\">      <figcaption><em>Photos from the A53 are punchy and saturated.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"RS9pnn\">The Galaxy A53 5G borrows its predecessor’s camera system, headlined by a 64-megapixel f/1.8 standard wide. It features optical stabilization, which is a rare and welcome feature in the midrange class. (You’re more likely to get a sharp shot in moderate lighting conditions.) There’s also a 12-megapixel ultrawide, along with 5-megapixel macro and depth sensors.</p><p id=\"FAcU57\">Expect good quality photos in bright light, with punchy, saturated colors. The main camera holds its own in dim and even very low light, with a night mode that brings out a good amount of detail provided your subject isn’t moving much. Portrait mode photos are serviceable, too, especially when there’s plenty of light, but not as impressive as we saw on the Galaxy S22. There’s also no telephoto lens here, so your only option for portraits is the wider view of the standard camera.</p><div id=\"HoQNjy\"><div data-anthem-component=\"gallery:11134039\"></div></div><p id=\"n5Rzkf\">Video recording tops out at 4K / 30p, with 30 and 60p options in 1080 resolution. Video clips look fine; the camera’s autofocus hunts a little bit in low light. There’s additional stabilization available in 1080 / 30p mode, but it’s best suited for bright outdoor light. (Clips in moderate and low light with this feature enabled look dark and noisy.)</p><p id=\"v9EqOQ\">Altogether, it’s a camera system that’s good for the price. You’d certainly get better from a flagship — including a telephoto lens — but it does an adequate job. The A53 doesn’t quite measure up to the midrange class leader: the Google Pixel 5A. Portraits and low light photos look just a little better from the Pixel, and colors are a little less saturated. There are good reasons to opt for the Samsung over the Pixel 5A (more on that in a bit), but if it’s pure camera quality you’re after, the 5A is still the best you can do for under $500. </p><div class=\"c-float-left c-float-hang\"><aside id=\"Vm0Vek\"><q>Samsung has done a little cleanup, like removing the ads at the top of the weather app</q></aside></div><p id=\"qGkzhP\">The A53 5G’s hardware leaves me with very little to complain about; it does just about everything you could reasonably expect a $450 phone to do. But I <em>can</em> find some nits to pick in Samsung’s software — mainly that it’s <em>Samsung</em> software. </p><p id=\"YYdQJQ\">If Samsung has its way, you’ll wind up with a whole bunch of Samsung apps downloaded on your phone when you start using it. Thankfully, you can opt out of downloading a lot of these during setup. Still, you’ll have an extra app store and an extra voice assistant on your phone, whether you want them or not. Bixby, I learned, has a tendency to mishear certain radio DJs saying “KEXP” as its own name. This is a very Pacific Northwest problem, but I was already irritated with Bixby, and this hasn’t helped things.</p><p id=\"AzeogQ\">To be fair, Samsung has done a little cleanup since One UI 3.0, like removing the ads at the top of the weather app. You can hide all of the superfluous Samsung apps in a folder, and it’s possible to use the phone without ever creating a Samsung account if you want to live your life without an extra login. Just know that you may one day decide to <a href=\"https://www.theverge.com/23014763/samsung-galaxy-phone-change-font-a53-s22-plus\">change the font on your phone</a> and discover that you’ll need a Samsung account to download one from the Galaxy Store. Win some, lose some.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oLE3ty_D6326ePYrOAV_mWKlGFg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371623/ajohnson_220405_5129_0005.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>With a healthy support policy and IP67 rating, the A53 5G should last for many years to come.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"HqBL9Y\">The Galaxy A53 5G is an easy pick if you live in the US and you’re looking to spend less than $500 on an Android phone. The Google Pixel 5A is basically the phone’s only competition, but it’s likely to be replaced soon and has a shorter shelf life at this point with only a couple more OS updates headed to it. You’d get a better camera and better software without all of the Samsung duplicates, but it’s not sold through any carriers if you’re looking to subsidize it with your wireless plan. </p><p id=\"MOxpOF\">Aside from waiting for the Google Pixel 6A, the other option would be to spend more and <a href=\"https://www.theverge.com/22750387/google-pixel-6-pro-review\">go for the Pixel 6</a>. Google seems to have addressed some early bugs with Android 12 security patches, and for $599, it’s a fantastic device with an excellent camera and lovely software. But it’s significantly more expensive — an extra $150. If you’re not picky about getting the very best image quality and you like (or at least don’t mind) Samsung’s version of Android 12, then there really isn’t a compelling case for spending the extra money.</p><p class=\"c-end-para\" id=\"wMXf2c\">Samsung offers a lot of A-series budget phones, and they’re generally among the best options in their respective price brackets. The A53 5G is the Samsung A-series at its very best. It keeps up with day-to-day tasks now and should last well into the next four or five years if you take care of it. The A52 was a good buy for $50 more, and the A53 will give you an even better return on your investment — even if you have to bring your own charger now.</p><p id=\"QARI3k\"><em>Photography by Allison Johnson / The Verge</em></p><div><div id=\"NAOiik\"><div data-anthem-component=\"aside:11133778\"></div></div></div><p id=\"ijgkKd\"></p><p id=\"TQ4eJz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lkVHWMVf_nLappUdjC0WXVEf1_Y=/0x167:2040x1235/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23371619/ajohnson_220405_5129_0001.jpg",
  "description": "Like last year’s model — but cheaper.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}