{
  "title": "Samsung is working on a Galaxy self-repair program with iFixit",
  "url": "https://www.theverge.com/2022/3/31/23004309/samsung-self-repair-service-program-ifixit-right-to-repair-galaxy",
  "date": "2022-03-31T16:03:17.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-ud5znq-O6yLbuN6rudE_NejKVc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70694377/cgartenberg_210111_4368_0011.0.jpg\" />        <figcaption>Photo by Chaim Gartenberg / The Verge</figcaption>    </figure>  <p id=\"N0TAiY\">Today, Samsung announced a new self-repair program that will give Galaxy customers access to parts, tools, and guides to repair their own devices. The program is in collaboration with popular repair guides and parts website iFixit, which has worked with manufacturers such as <a href=\"https://www.theverge.com/circuitbreaker/2018/10/23/18013320/ifixit-motorola-official-parts-repair-kits\">Motorola</a> and <a href=\"https://www.theverge.com/2022/2/15/22935171/valve-steam-deck-replacement-parts-teardown-ifixit\">Steam</a> on similar ventures. The Galaxy S20 and S21 series phones and the Galaxy Tab S7 Plus are first in line for the spare parts — but not Samsung’s latest S22 family of phones.</p><p id=\"aiv0Tv\">“We are working with Samsung to improve their repair guide and DIY parts offerings,” iFixit CEO Kyle Wiens tells <em>The Verge</em>. The new program follows <a href=\"https://www.theverge.com/2021/11/19/22787245/apple-iphone-mac-self-service-program-repair-diy\">Apple’s recent change of heart</a> in announcing a self-service program and Microsoft’s work with iFixit to <a href=\"https://www.theverge.com/2021/12/14/22833120/ifixit-microsoft-surface-repair-tools-partner-professional-servicehttps://www.theverge.com/2021/12/14/22833120/ifixit-microsoft-surface-repair-tools-partner-professional-service\">manufacture Surface tools</a>. “It is clear that manufacturers are recognizing that they need to embrace repair,” Wiens said.</p><div class=\"c-float-right\"><aside id=\"NeyUHj\"><q>Initially, the available parts include displays, back glass, and charge ports</q></aside></div><p id=\"fKQcbC\">Consumers who take advantage of the program will get access to “intuitive, visual, step-by-step repair guides” as well as the needed tools, according to Samsung’s press release. Wiens tells us that the Galaxy S20 series guides are already complete and that iFixit is actively working on writing the guides for the S21 series and Galaxy Tab S7 Plus.</p><p id=\"6eDjIJ\">We asked Samsung if there are plans to make parts available for newer phones or cheaper ones like the Galaxy A series. A spokesperson responded: “Samsung plans to expand the range of products, parts and self-repair capability as the program matures.” But for the devices confirmed at launch, the initial parts list consists of displays, back glass, and charge ports.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IW9TBYS18BLSt4H4bexqhcEAQdM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23357195/GybPXiaQ2LsdPWtv.huge.jpeg\">      <cite>Image: iFixit</cite>      <figcaption><em>Removing the battery from this Galaxy S20 is difficult, which is probably why it’s not initially included as an available part in the new program.</em></figcaption>  </figure><p id=\"CWZfR7\">The press release is absent of any mentions of battery replacement options, but Wiens said the Samsung display assemblies would have pre-glued batteries attached to them. This simplifies the repair process for the Galaxy S20 and S21 devices since <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ifixit.com%2FGuide%2FSamsung%2BGalaxy%2BS20%2BBattery%2BReplacement%2F132827%23s272673&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F31%2F23004309%2Fsamsung-self-repair-service-program-ifixit-right-to-repair-galaxy\" rel=\"sponsored nofollow noopener\" target=\"_blank\">freeing the battery</a> in those models requires copious amounts of isopropyl alcohol to loosen the battery and careful strenuous force to pull it out.</p><aside id=\"T9hqMv\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple’s new Self Service Repair program is an opportunity to repair relationships \",\"url\":\"https://www.theverge.com/2021/11/19/22787245/apple-iphone-mac-self-service-program-repair-diy\"}]}'></div></aside><p id=\"SFlXeO\">Batteries aside, this self-repair program is another step the company is taking toward its sustainability goals. The company recently <a href=\"https://www.theverge.com/2022/2/9/22923577/samsung-galaxy-unpacked-android-upgrades-4-years\">increased Android software support timelines</a> on its phones, and for the new self-repair program, you can send the old broken parts back to Samsung to recycle for free.</p><p id=\"8xsyQ6\">But Samsung has a lot to make up for. You may recall <a href=\"https://www.theverge.com/2021/5/25/22452693/ifixit-samung-galaxy-upcycling-e-waste-initiative-program\">its phone repurposing “upcycling” program</a> that it previously worked on with iFixit. Instead of opening the bootloaders for older Samsung devices to allow for fully reprogrammable re-use of old Galaxy devices as imagined initially, Samsung turned it into a more limited program where some people could turn a Galaxy S9 into <a href=\"https://www.theverge.com/2021/4/21/22395694/samsung-galaxy-phone-upcycle-smart-home-sensor-iot\">a sensor</a> for a Samsung SmartThings smart home system.</p><p id=\"ax7HcZ\">“The original Galaxy Upcycling was absolutely fantastic and the ability to install long-lasting operating systems on smartphones is something that the industry desperately needs,” Wiens said. We asked Wiens if this new self-repair program had any link to the Galaxy Upcycling pitch. “I honestly have no idea,” Wiens responded.</p><p id=\"vlAp9z\">It seems that Samsung and iFixit put their previous engagements aside for this venture and look forward to launching the program this summer as another option that helps prolong the usable life of older Galaxy phones. Details remain slim, but a Samsung spokesperson tells us we’ll hear more once it’s available. It’ll bolster Samsung’s growing repair service offerings that include over 2,000 official and authorized repair locations as well as mobile service and mail-in service options.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/u8IRUd5ZZf1nGpDLdB5ZxsS5xjU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22232929/cgartenberg_210111_4368_0011.jpg",
  "description": "Samsung’s self-repair program is starting with older phones.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}