{
  "title": "Samsung Galaxy S22 vs. S21: unpacking the key specs",
  "url": "https://www.theverge.com/22925818/samsung-galaxy-s22-s21-fe-plus-ultra-specs-comparison-differences-price",
  "date": "2022-02-10T14:35:55.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "      <figure>      <img alt=\"The Galaxy S22 family — S22 Ultras on the left.\" src=\"https://cdn.vox-cdn.com/thumbor/HflcfTOe_R1f5eHOHJ1PjZojDIA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70492688/cwelch_220204_5008_0016.0.jpg\" />        <figcaption><em>The Galaxy S22 phones come in three different sizes.</em> | Photo by Chris Welch / The Verge</figcaption>    </figure>  <p id=\"Q0beWl\">It’s that Samsung time of year again when an Unpacked event announces new Galaxy S flagship phones to be the latest iPhone-fighters. In fact, it’s another year of Samsung triplets: the new models are the <a href=\"https://www.theverge.com/2022/2/9/22922028/samsung-galaxy-s22-plus-price-features-specs\">Galaxy S22</a>, <a href=\"https://www.theverge.com/2022/2/9/22922028/samsung-galaxy-s22-plus-price-features-specs\">Galaxy S22 Plus</a>, and <a href=\"https://www.theverge.com/2022/2/9/22917015/samsung-galaxy-s22-ultra-screen-price-specs-note\">Galaxy S22 Ultra</a>. This time, they bring along Note-like functionality with the S-Pen — and the S22 Ultra even comes with one. But how do these stack up to last year’s S21 line? Is it a worthwhile upgrade? Should you sit this one out or hop on the S22 train and <a href=\"https://www.theverge.com/22923423/samsung-galaxy-s22-plus-ultra-buy-preorder-price-release-date\">get that preorder in</a>? Let’s break down the new Galaxy S22 lineup vs. its predecessor, the S21 line.</p><aside id=\"DCh78s\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Everything announced at Samsung’s Galaxy S22 Unpacked event\",\"url\":\"https://www.theverge.com/2022/2/9/22925259/samsung-galaxy-s22-ultra-unpacked-2022-biggest-announcements\"},{\"title\":\"Here’s how Samsung’s Galaxy S22 compares to the iPhone 13\",\"url\":\"https://www.theverge.com/22921675/samsung-galaxy-s22-apple-iphone-13-specs-comparison-differences-price\"}]}'></div></aside><h2 id=\"r7u8At\">Galaxy S22 vs. Galaxy S21</h2><p id=\"FuXebc\">What a difference a year makes — or doesn’t. In fact, you could think of this as an incremental year. The Samsung Galaxy S22 lineup looks a whole lot like the S21 line — the designs have not been fully revised but refined.</p><p id=\"q2kJbH\">As mentioned before, the Galaxy S21, S21 Plus, and S21 Ultra all came out just over one year ago. The S21 represented the baseline (smallest) model in the line, with a 6.2-inch OLED display, a Snapdragon 888 processor, 8GB of RAM, an in-display ultrasonic fingerprint sensor, triple-camera array (12MP wide, 12MP ultrawide, 64MP telephoto), 8K video recording, wireless charging, and IP68-rated protection, all starting at $799. The S21 Plus had all of that with a larger 6.7-inch display and bigger battery for $999. The top-end S21 Ultra was the crème de la crème, with a slightly bigger 6.8-inch display, a whopping 108MP main rear camera, a 40MP front-facing camera — and an equally whopping starting price of $1,199. It also had support for the S-Pen, which was a tease of what’s to come.  </p><div id=\"7epb7H\"><div data-anthem-component=\"gallery:11021018\"></div></div><p id=\"0Ep4BE\">Fast forward to yesterday’s Unpacked event, and we have the Galaxy S22, S22 Plus, and S22 Ultra. Sound familiar? It’s the same approach once again, with the base S22 now sporting the latest Snapdragon 8 Gen 1 CPU (which is a smaller 4nm processor), slightly smaller 6.1-inch screen, and revised cameras (now 50MP for main wide-angle, 10MP in the telephoto, and once again 12MP ultra-wide) for $799. The S22 Plus now sports a 6.6-inch display, while most other specs match the S22, save for the addition of Wi-Fi 6E, for $999. Noticing some trends here? </p><p id=\"AnTmDU\">Lastly, The Galaxy S22 Ultra has a 6.8-inch screen just like the S21 Ultra, though now its 120Hz display can go all the way down to 1Hz for saving battery power when that ultra-fast speed isn’t needed — like looking at a still picture. Speaking of photos, the S22 Ultra has the same camera specs as last year’s Ultra, though Samsung is touting new claims of improved low-light performance as a theme across the line. </p><p id=\"fjEiIg\">The other big theme with the entire S22 lineup is S-Pen compatibility. You can use it with any of them, though the S22 Ultra is the only one that includes it and integrates it into the chassis like the Note line it aims to replace.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/upwKDy-O6wfAM0xYH8HjK7xtxsQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23142236/ajohnson_220102_4951_0001.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The recent Galaxy S21 FE is meant for Samsung fans on a budget but just $100 less than the S22.</em></figcaption>  </figure><p id=\"azPru8\">But hold up, there’s one more phone that we cannot forget. Just last month, the S21 line got its curtain call release with the Galaxy S21 FE (short for Fan Edition). This one is designed to be the lower-cost option without stepping down to the more modest Galaxy A models. It does not make many sacrifices — matching the S21 in most specs but downgrading the RAM and telephoto camera while clocking in at a 6.4-inch screen size that sits between the S21 and S21 Plus. Its price of $699 puts it within $100 of the outgoing S21 and new S22, so it may only be worth considering if you find it on any upcoming deals.</p><p id=\"n3MA9a\">OK, so that’s a lot to unpack (sorry). If you’re chasing the latest and greatest, you may consider your preferred flavor and size of the Galaxy S22 lineup, but when you look at the specs side by side, you see how this year looks to have mostly modest changes. However, there may be a lot to love in these new phones if you study the ways of the Samsung S-Pen and have been feeling a Note-sized hole in your heart. We’ll be sure to offer you our take once we get to fully review these new Galaxies.</p><div id=\"HDN4s4\"><div data-anthem-component=\"table:11020817\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/EzQUF7RoSM0nhR-JQFoIJ6ir9hc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23227357/cwelch_220204_5008_0016.jpg",
  "description": "Model for model, spec for spec",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}