{
  "title": "Samsung’s Galaxy Watch 4 will track your sleep with cartoon animals",
  "url": "https://www.theverge.com/2022/2/7/22921615/samsung-galaxy-watch-4-wear-os-google-assistant-wearables-smartwatch",
  "date": "2022-02-07T23:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/f4cotgWE4bPm6HdlPIKTgr1A_IA=/0x1:1784x1190/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70481790/Screen_Shot_2022_02_04_at_3.10.35_PM.5.png\" />        <figcaption><em>Tag yourself, I’m nervous penguin.</em> | Image: Samsung</figcaption>    </figure>  <p id=\"6GVVgA\">Samsung isn’t expected to launch a new smartwatch at its Unpacked event this week, but it hasn’t forgotten the Galaxy Watch 4 and Galaxy Watch 4 Classic. Starting February 9th, both smartwatches will support new health and fitness features like custom interval training, sleep coaching, and the ability to set body composition goals. Oh, and it’s also promising better app compatibility for the new Wear OS platform — but you’re still going to have to wait a bit for Google Assistant.</p><p id=\"zzATif\">Sleep tracking has been an area where Samsung’s lagged a bit compared to more fitness-oriented trackers. On that front, Samsung is adding a sleep coaching program that seems to take some inspiration from <a href=\"https://www.sleepfoundation.org/how-sleep-works/chronotypes#:~:text=Chronotype%20is%20the%20natural%20inclination,exercise%2C%20and%20core%20body%20temperature.\">chronotypes</a> — in a nutshell, it’s basically what your natural circadian rhythm is. Traditionally, people are categorized into four chronotypes associated with animals (lion, dolphin, bear, or wolf), but it seems like Samsung’s gone a step further and expanded it to eight types. After tracking your sleep patterns for a week and completing two sleep surveys, Samsung says it assigns you one of eight animals representing a sleep type. Afterward, you’ll have the option of a four-to-five-week program that aims to help you improve sleep quality via things like checklists, sleep articles, meditation, and reports.</p><p id=\"GJExyp\">One of the marquee health upgrades for the <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4</a> and Galaxy Watch 4 Classic was a shiny new 3-in-1 biosensor that enabled body composition readings. It was impressive, as that had been the purview of smart scales and specialized equipment at either your doctor’s or at a gym. That said, what you ended up getting was a readout of numbers that may not have made a lot of sense for beginners. Now, Samsung says its partnering with <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fcentr.com%2Fjoin-us&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F7%2F22921615%2Fsamsung-galaxy-watch-4-wear-os-google-assistant-wearables-smartwatch\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Centr</a> to provide “body composition insights.” (If you’ve never heard of Centr, its claim to fame is that it’s <em>Thor </em>beefcake Chris Hemsworth’s fitness app.) For example, if someone puts on weight while also gaining body fat and muscle, it might provide extra context on why that’s normal. Galaxy Watch 4 users will also get a 30-day trial to the app. </p><p id=\"mTwWKO\">Samsung also introduced running coaching a few years ago, but the updates also add a new interval target feature for runners and cyclists. You’ll now be able to pre-set duration, distance, and number of sets. Samsung says that from there, the Galaxy Watch 4 will guide users through a custom “intensity training session” that alternates high and low-intensity workouts.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FoD1Qm34ng-U6edleAp8NZfarlk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23223541/Galaxy_Watch4_New_Straps.jpg\">      <cite>Image: Samsung</cite>      <figcaption><em>New strap options and colors</em></figcaption>  </figure><p id=\"6j5qXu\">Samsung’s main announcements may be health-focused, but it also snuck in a promise to greater Android compatibility. The watches launched with Google Maps, Google Pay, and YouTube Music, as well as a handful of other third-party apps. However, that’s been about it since the watches launched in late August. The company now says it’s planning to enable easier setup, as well as the ability to stream directly to the wrist over Wi-Fi or LTE on the YouTube Music app. It also re-confirmed that Google Assistant is, in fact, coming to the Galaxy Watch 4. Once it arrives, users will have the choice between Assistant or Samsung’s Bixby. As for <em>when,</em> Samsung kept it vague. While the YouTube update will be “coming soon,” it says Google Assistant will be available “in the coming months.” </p><p id=\"e1XlXI\">Lastly, Samsung is offering more style options in the form of new strap colors, a fabric band, and a link bracelet. It’ll also be adding more colors and digital clock fonts to better personalize watch faces.</p><p id=\"z5kLma\">The new health features will be available via the Galaxy Wearable app beginning February 9th. The new straps will be available in late February. And hopefully, Google Assistant will arrive before the end of 2022. </p><hr class=\"p-entry-hr\" id=\"7j3qmJ\"><h2 id=\"QqJFRZ\">Related:</h2><div id=\"9wPCmC\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Samsung Watch 2021|103385\" data-volume-uuid=\"43c4c273d\" data-volume-id=\"103385\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-984\" class=\"volume-video\" data-volume-player-choice=\"youtube\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/GoKnrZzwW4LEwHm7t3IfDsN-KWI=/0x128:1784x1062/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23224858/Screen_Shot_2022_02_04_at_3.10.35_PM.png",
  "description": "And it swears Google Assistant is coming eventually.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}