{
  "title": "Samsung’s really good midrange phone just got a bigger battery and a price cut",
  "url": "https://www.theverge.com/2022/3/17/22978286/samsung-galaxy-a53-5g-price-specs-screen-battery",
  "date": "2022-03-17T14:00:00.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/e5ltE8wBoc3FPzek2PmfAM-zP4I=/0x84:2000x1417/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70635393/Galaxy_A53_5G_Black_Lockup_RGB.0.jpg\" />        <figcaption><em>Not much has changed on the outside, but there are a couple important tweaks under the hood.</em> | Image: Samsung</figcaption>    </figure>  <p id=\"Pdumyp\">Last spring, Samsung announced <a href=\"https://www.theverge.com/2021/3/17/22334392/samsung-galaxy-a52-5g-a72-specs-price-camera\">a trio of Galaxy A-series phones</a> that were all destined for US retailers’ shelves. This year, it’s promising just one new model for US customers: the Galaxy A53 5G. It offers some modest upgrades, which is fine because <a href=\"https://www.theverge.com/22399456/samsung-galaxy-a52-5g-review-camera-screen-specs-price\">the A52 5G was a really good phone</a>. But its best new feature is a $50 lower price tag, which at $449 for 128GB of storage, puts it juuuuust under Apple’s $479 iPhone SE with 128GB. Maybe that’s a coincidence! Probably not!</p><p id=\"DvGmlV\">The A53 5G’s most notable hardware change is the switch to Samsung’s new Exynos 1280 5nm processor. The version of the A52 5G sold in the US included a Qualcomm processor, so using the house-brand chip represents a shift in strategy, maybe to accommodate a lower price point. Or maybe it’s the whole chip shortage situation. In any case, it’s paired with 6GB of RAM, which is a healthy amount of memory for a midrange phone.</p><div id=\"SDRGwY\"><div data-anthem-component=\"gallery:11096692\"></div></div><p id=\"cCNuve\">There’s a bigger battery on the A53 5G, too — up to 5,000mAh from 4,500mAh in the previous model. Battery performance was already good in the A52, so Samsung’s claim of two full days on a single charge in the new model seems plausible. </p><p id=\"wIcrsy\">Just about everything else on the phone is carried over from the previous generation, starting, of course, with 5G — likely just low and mid-band, though I weirdly couldn’t get Samsung to confirm this prior to the embargo lifting. There’s also the same 6.5-inch OLED 120Hz panel, IP67 water resistance, a stabilized 64-megapixel main camera with a 12-megapixel ultrawide, and 25W fast wired charging (there’s still no wireless charging). These were all really good specs for a midrange phone last year, and they continue to stand out in 2022’s model. </p><div class=\"c-float-right\"><aside id=\"SNfAbQ\"><q>Samsung has promised four years of OS updates and five years of security updates</q></aside></div><p id=\"BnpK2a\"><a href=\"https://www.theverge.com/22618794/samsung-galaxy-a42-5g-review-screen-battery-price-specs\"></a><a href=\"https://www.theverge.com/2022/1/19/22891284/verizon-c-band-5g-ultra-wideband-now-available\"></a><a href=\"https://www.theverge.com/22968066/apple-iphone-se-5g-mmwave-verizon-uw\"></a></p><p id=\"nAtkQV\">There’s also one more improvement that you won’t find on the spec sheet. For certain devices, Samsung has promised four years of OS updates and five years of security updates, and the A53 5G will be included. That’s among the best support policies for Android flagship phones and certainly one of the best you’ll find for a midrange phone. It’s just short of Apple’s track record of supporting six- or seven-year-old phones with new software versions, but for a lot of people, those five years might be just enough.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GhoVZVnWBzvHZ3ZIegvNp7-IPMI=/0x227:2000x1274/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318103/Galaxy_A53_5G_Black_Lockup_RGB.jpg",
  "description": "Conveniently $30 cheaper than the 128GB iPhone SE",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}