{
  "title": "Samsung confirms hackers stole Galaxy source code",
  "url": "https://www.theverge.com/2022/3/7/22965220/samsung-hack-lapsus-galaxy-source-code-confirmed-nvidia",
  "date": "2022-03-07T11:18:30.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/dgq1_5TiuZCd_OaEW0uomtwXiSA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70587995/ajohnson_220216_5032_0004.0.jpg\" />        <figcaption>Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p id=\"Vfb3ee\">Hackers have successfully stolen internal company data and source code for Galaxy devices from Samsung, the South Korean tech giant confirmed today. </p><p id=\"E7bSG7\">News of the breach was first reported earlier this month, with a hacking outfit named Lapsus$ claiming responsibility. The group, which <a href=\"https://www.theverge.com/2022/3/1/22957212/nvidia-confirms-hack-proprietary-information-lapsus\">recently hacked Nvidia</a>, shared screenshots purportedly showing roughly 200GB of stolen data, including source code used by Samsung for encryption and biometric unlocking functions on Galaxy hardware.</p><p id=\"1Xxz7P\">In a statement today, Samsung did not confirm or deny the identity of the hackers, nor whether or not they had stolen data related to encryption and biometrics. But, the company said that no personal data, belonging either to employees or customers, had been taken. </p><div class=\"c-float-right\"><aside id=\"fDhfHT\"><q>“we do not anticipate any impact to our business or customers”</q></aside></div><p id=\"RgxI4d\">“There was a security breach relating to certain internal company data,” said Samsung in a statement reported by <a href=\"https://www.bloomberg.com/news/articles/2022-03-07/samsung-says-hackers-breached-company-data-galaxy-source-code?\"><em>Bloomberg News</em></a><em> </em>and <a href=\"https://www.sammobile.com/news/samsung-says-your-personal-info-wasnt-leaked-in-its-recent-data-hack/\"><em>SamMobile</em></a>. “According to our initial analysis, the breach involves some source code relating to the operation of Galaxy devices, but does not include the personal information of our consumers or employees. Currently, we do not anticipate any impact to our business or customers. We have implemented measures to prevent further such incidents and will continue to serve our customers without disruption.”</p><p id=\"o4iluH\">In the case of the recent Nvidia hack, the hacking group Lapsus$ <a href=\"https://www.pcgamer.com/nvidia-hackers-leak-employee-credentials-threaten-to-release-nvidias-most-closely-guarded-trade-secrets/\">attempted to blackmail</a> the company, threatening to leak data online unless Nvidia removed cryptocurrency mining limiters from certain GPUs and made the drivers for these video cards open source. It’s not clear if Lapsus$ has made any threats to Samsung trying to extort specific concessions.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iljP-g85UP4DsoQSQ9ljBRyuyUU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23256275/ajohnson_220216_5032_0004.jpg",
  "description": "Hackers claim they stole source code for encryption and biometric features",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}