{
  "title": "Samsung’s M8 monitor comes with a webcam, speakers, and smart TV features for $700",
  "url": "https://www.theverge.com/2022/3/28/22999709/samsung-m8-4k-32-inch-smart-monitor-features-price-airplay-tv-apple-studio-display-comparison",
  "date": "2022-03-28T15:54:48.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Samsung M8 Smart Monitor\" src=\"https://cdn.vox-cdn.com/thumbor/9Q_NXXG0J62dcxL4Zr9n8mb13Jw=/0x0:856x571/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70681093/m8hero.0.jpg\" />        <figcaption><em>The white-colored model costs $700, while the others cost $30 more.</em> | Samsung</figcaption>    </figure>  <p id=\"91EDse\">Samsung’s latest smart monitor, the 32-inch 4K M8, <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.samsung.com/us/computing/monitors/smart-monitors/32-m8-4k-smart-monitor-and-streaming-tv-blue-ls32bm80bunxgo/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">is now available to reserve in four colors: white, blue, green, and pink</a>. The white-colored option will cost $699.99, while the other colors cost $30 more. <a href=\"https://www.theverge.com/2022/1/2/22860029/samsung-smart-monitor-m8-4k-smartthings-iot-workspace-game-home\">Samsung announced the M8 during CES 2022</a>, though it didn’t share a price or that it would arrive in multiple colorways. The company still hasn’t shared a release date. And for now, you can only reserve — not outright purchase — an M8 monitor. After you reserve by entering your e-mail address, you’ll eventually be able to preorder one, and Samsung says your purchase will include a $100 Samsung credit to use in the future.</p><p id=\"f8lRYk\">Its colorful design and thin profile could make the M8 fit in with a group of M1 iMacs. Compared to a more relevant Apple product, the <a href=\"https://www.theverge.com/22981744/apple-studio-display-5k-monitor-webcam-speakers-review\">$1,600 Studio Display</a>, the M8’s feature set easily outpaces it.</p><p id=\"rrQz1s\">The monitor itself can run video streaming apps like Apple TV Plus, Netflix, Disney Plus, and it has built-in speakers and support for HDR 10+. It can use Google Duo to make video chats with its stick-on webcam (Samsung says it has face tracking and auto-zoom functions). You can even run Microsoft 365 web apps with the M8 once you connect a keyboard and mouse. It’s also controllable via Bixby, Alexa, or Google Assistant. Heck, it even supports AirPlay 2.</p>  <figure class=\"e-image\">        <img alt=\"Samsung M8 Smart Monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8FMotJdWraCHhU6CbKvamFS-GI8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23350292/m8pink.jpg\">      <cite>Samsung</cite>      <figcaption><em>If you have a keyboard and a mouse, that’s all that you need to jump into Microsoft 365 web apps.</em></figcaption>  </figure><p id=\"kqu3UN\">It’s much more of a computer-meets-TV than the Studio Display, for a fraction of the cost. And its included stand (while not VESA-compatible, which we’d prefer) is height-adjustable and supports tilting. The display can be moved up or all the way down to meet the surface of your desk, <a href=\"https://www.theverge.com/2019/6/11/18661401/samsung-space-monitor-32-review-price-specs-features\">just like Samsung’s unique Space Monitor</a>.</p><p id=\"ZYr0l3\">For all of those perks, it still might not be what some Mac users are looking for. The M8 supports 4K resolution compared to the Studio Display’s 5K panel. Like the Space Monitor, the M8’s connectivity leaves a lot to be desired. It has one micro HDMI port and two USB-C ports (supporting 65W passthrough charging), only one of which can handle video or data transfer.</p>  <figure class=\"e-image\">        <img alt=\"Samsung M8 Smart Monitor\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/n4Nd3_yw0RuKixmAvSOos-YO-1E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23350287/m8green.jpg\">      <cite>Samsung</cite>      <figcaption><em>I love the feisty choice of highlighting Apple TV Plus in this photo.</em></figcaption>  </figure><p id=\"r984gU\">And since we haven’t seen the M8’s build or picture quality first-hand or tested out its webcam, we don’t know exactly how it’ll compare. But if you’re looking for a stylish, feature-packed monitor that’s unapologetically cribbing Apple’s styling, this could be a good option for many Mac or Windows users who raised an eyebrow at the Studio Display’s questionable value proposition.</p><p id=\"1cu7BE\"></p><p id=\"sNwv5d\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/65tfpfaz3JAdGwYDOL09D_0QtDg=/0x62:856x510/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23350286/m8hero.jpg",
  "description": "Plus, it could be confused with an M1 iMac",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}