{
  "title": "Samsung’s new tablets go bigger than ever",
  "url": "https://www.theverge.com/2022/2/9/22923565/samsung-galaxy-tab-s8-ultra-plus-tablets-android-price-specs-features",
  "date": "2022-02-09T15:00:00.000Z",
  "author": "Dan Seifert",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WG7SqhVT7FH3BGbxnBIDur0oowE=/1x0:6421x4280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70488029/1_004_lifestyle_Tab_S8_Ultra_Graphite_Tab_S8__Graphite_Tab_S8_Silver_HI.0.jpg\" />        <figcaption><em>The Galaxy Tab S8 family now spans three sizes of tablets</em> | Image: Samsung</figcaption>    </figure>  <p id=\"S65Ook\">Samsung thinks your tablet is too small. So the company is announcing the Galaxy Tab S8 Ultra, a slim tablet with a massive 14.6-inch screen. The $1,099.99 Tab S8 Ultra sits at the top of the Tab S8 line, which includes the more pedestrian-sized Tab S8 and Tab S8 Plus, successors to the <a href=\"https://www.theverge.com/21444688/samsung-galaxy-tab-s7-plus-review\">Tab S7 models from 2020</a>.</p><p id=\"spVYYt\">The Tab S8 Ultra takes the same approach that Samsung has used with its smartphones bearing the Ultra name. It’s bigger and more feature-packed than the other models in the lineup. Its 14.6-inch screen is an OLED panel with a 120Hz refresh rate and a 2,960 x 1,848 resolution. It has up to 16GB of RAM, 512GB of storage, two front-facing cameras, and Qualcomm’s latest Snapdragon Gen 1 chip, the same processor that’s in the new S22 line of phones.</p><p id=\"cwJ5s2\">The star of the show is certainly the screen, which is big, bright, and color-rich, just like you’d expect from an OLED panel. It’s the kind of screen you just want to watch movies on forever. We haven’t been able to test it side-by-side with the Mini LED screen on Apple’s 12.9-inch iPad Pro, but it’s a safe bet it’s a close comparison. The Ultra’s new screen is 20 percent larger than the 12.4-inch screen on the Tab S7 Plus and Tab S8 Plus and bigger than the biggest screen you can get on an iPad. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/N0NPLUdoj8gwqTvDO0BZVPq5anc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23227299/1_008_Design_Tab_S8_Ultra_with_Book_Cover_Keyboard_Graphite_HI.jpg\">      <cite>Image: Samsung</cite>      <figcaption><em>Samsung’s chosen wallpaper conveniently hides the camera notch, but I can assure you it’s there.</em></figcaption>  </figure><p id=\"F9qnJo\">The two front-facing cameras (a standard wide and an ultrawide, both 12 megapixels) are housed in a notch that slightly dips into the screen’s real estate, but it’s the kind of thing that is easily forgotten once you start using the device. Samsung has added some Apple-esque auto-framing features to the camera, which try to keep you centered in the frame on video calls. It also has the ability to blur the background on calls, and there’s a three-way microphone with three different types of noise cancelation for clear audio.</p><div class=\"c-float-right\"><aside id=\"YIozBw\"><q>The Tab S8 Ultra is closer in size to a Microsoft Surface Pro than an iPad</q></aside></div><p id=\"GFm8gc\">At 1.6 pounds, almost 13 inches across, and over 8 inches tall, the Tab S8 Ultra is closer in size and weight to a Microsoft Surface Pro than what most people would consider a tablet. Despite its size, Samsung claims that the Ultra is 40 percent less prone to bending than the Tab S7, and its aluminum is 30 percent more scratch resistant. It’s impressive to be holding such a big screen in your hands, but it’s hard to see how useful the Ultra will be as an actual tablet and not parked in a keyboard case on a desk. Samsung is including an S Pen stylus in the box with all of the Tab S8 models, but a keyboard case will cost extra. (Those that place preorders will get the keyboard case for free as a perk.)</p><p id=\"dqfTPM\">Its usefulness as a laptop replacement is tempered by the fact that it’s still running Android 12 and not a more desktop-focused operating system. Samsung does have its Dex feature, which provides a desktop-like environment with windowed apps, a taskbar, and other features when you’ve got the tablet docked to a keyboard. Samsung also says it has improved the multi-window mode that lets you split the screen among three different apps and adjust the size of each window, a trick pulled from the Galaxy Fold 3’s software. But at the end of the day, you’ll still be working in Android apps, which are rarely optimized for smaller tablets, much less something this large. </p><p id=\"W9u9BH\">Other new Dex features include the ability to work in portrait orientation and make the tablet a wireless touchscreen monitor for a paired PC or phone. You can even drag and drop files between the devices, similar to Apple’s Universal Control feature between Macs and iPads.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NrCEFc8a7ioTOk58TR-bbZR4T-E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23227305/1_014_Family_Tab_S8_Ultra_Graphite_Tab_S8__Silver_Tab_S8_Graphite_HI.jpg\">      <cite>Image: Samsung</cite>      <figcaption><em>The Tab S8 and S8 Plus are direct replacements to the Tab S7 models from 2020.</em></figcaption>  </figure><p id=\"DMEoE7\">The other two tablets in the lineup, the $699.99 Tab S8 and $899.99 Tab S8 Plus, are more direct replacements for their Tab S7 predecessors. The standard Tab S8 has an 11-inch, 120Hz LCD screen, while the Tab S8 Plus has a 12.4-inch 120Hz OLED panel. Both have the Snapdragon 8 Gen 1 processor, four Dolby Atmos speakers, 8GB of RAM, up to 256GB of storage, and a single 12-megapixel ultrawide front camera. All of the Tab S8 models have Wi-Fi 6E and Bluetooth 5.2, but only the Tab S8 Plus will be available with optional 5G cellular connectivity.</p><p id=\"vxhqLx\">Samsung has been making Android tablets for a long time, despite the lackluster support from Google and general dearth of third-party apps available for them. Hardware is rarely the problem with a Samsung tablet, and it’s unlikely to be the issue this time around, either. But while the Tab S8 Ultra and its siblings pack impressive spec sheets, the experience of using them is going to come down to the software, and Samsung <a href=\"https://www.theverge.com/21444688/samsung-galaxy-tab-s7-plus-review\">doesn’t have a great track record</a> there. We’ll have to see if the company has managed to fix the wrongs from the Tab S7 line and can justify the Tab S8 models’ hefty price tags when we’re able to review production versions of them.</p><p id=\"Nnq46f\">Samsung is putting the Tab S8, S8 Plus, and S8 Ultra up for preorder starting today, February 9th, and is expecting to begin shipping them later this month.</p><p id=\"1JpbRI\"></p><p id=\"QU3qis\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CvOh7oLccPfS0tDSYyYtX7waJ5c=/0x459:6421x3821/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23227298/1_004_lifestyle_Tab_S8_Ultra_Graphite_Tab_S8__Graphite_Tab_S8_Silver_HI.jpg",
  "description": "How big is too big for a tablet?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}