{
  "title": "Samsung updates its Galaxy Book Pro line with 1080p webcams",
  "url": "https://www.theverge.com/2022/2/27/22950976/samsung-galaxy-book2-pro-360-price-features-ports-specs-intel-evo",
  "date": "2022-02-27T18:00:00.000Z",
  "author": "Monica Chin",
  "content": "      <figure>      <img alt=\"The Samsung Galaxy Book 2 Pro on a white plush chair with a houseplant in the background. The screen displays a blue supernova on a black background.\" src=\"https://cdn.vox-cdn.com/thumbor/UH5x11Cj6SiYIfySg6aJEXgsUys=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70557132/mchin_200521_5049_0001.0.jpg\" />        <figcaption><em>Here’s the Galaxy Book 2 Pro.</em></figcaption>    </figure>  <p id=\"qbXLee\">Samsung has announced two updates to its premium Galaxy Book line: the Galaxy Book 2 Pro and Galaxy Book 2 Pro 360. The devices will start at $1,049.99 and $1,249.99 respectively; they hit shelves on April 1st with preorders beginning on March 18th. A budget-oriented Galaxy Book 2 360, a convertible version of the <a href=\"https://www.theverge.com/2021/10/25/22744949/samsung-galaxy-book-odyssey-pro-360-5g-laptops\">regular Galaxy Book</a>, will also ship April 1st with a starting price of $899.99.</p><p id=\"UzVoK0\">Both Pro models come in 13.3-inch and 15.6-inch sizes, while the regular Book 2 360 is only a 13.3. As you can probably guess from the names, the Galaxy Book 2 Pro is a clamshell while the Galaxy Book 2 Pro 360 is a 2-in-1 convertible with a touchscreen and S Pen support.</p>  <figure class=\"e-image\">        <img alt=\"The keyboard of the Galaxy Book 2 Pro seen from above on a white plush chair.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ojol45_oYUVdYBHeOoIQViczdmg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23272054/mchin_200521_5049_0002.jpg\">      <figcaption><em>Here’s the Galaxy Book 2 Pro’s keyboard, which is backlit and has a nice smooth texture.</em></figcaption>  </figure><p id=\"LqEYAS\">These devices look and feel pretty similar to the Galaxy Book Pro and Galaxy Book Pro 360 models we reviewed last year. <a href=\"https://www.theverge.com/22820568/samsung-galaxy-book-pro-13-inch-review\">Like its predecessor</a>, the smallest Galaxy Book 2 Pro is just 1.92 pounds and 0.44 inches thick. It’s still one of the absolute lightest clamshell laptops you can buy, and picking it up really messes with your mind. But it also makes remarkably few compromises for that portability. In particular, the 15-incher manages to squeeze an HDMI port into that tiny chassis. Many laptops of this size are now exclusively USB-C. (The 360 model is, as you’d anticipate, a bit heavier.)</p><p id=\"ePmQm3\">The primary chassis update is that all the new models feature 1080p webcams. There are also some new software features meant to enhance the video-call experience, including some new background and face-effect features, as well as an Auto Framing tool that keeps you centered as you move around. This is a fairly predictable investment as more workers continue to embrace remote and hybrid setups. </p><p id=\"B4lwkE\">The displays (all FHD AMOLED) are also brighter than they were on last year’s models. I <a href=\"https://www.theverge.com/22419899/samsung-galaxy-book-pro-360-15-inch-review\">wasn’t floored by the brightness</a> on either of the 2021 Galaxy Book Pros, so I’m happy to see this change. I did catch some glare from the bright lights in Samsung’s demo area, though I didn’t have trouble seeing anything on the screens. Unfortunately, all of these devices still have the cursed 16:9 aspect ratio, which many other premium lines have moved away from this year.</p><p id=\"DjitSs\">The Pro convertible is also available in a new burgundy color, in addition to graphite and silver. It’s very pretty in person and feels smooth, though the graphite offering is still my favorite.</p>  <figure class=\"e-image\">        <img alt=\"The Samsung Galaxy Book 2 360 on a black plus bench angled to the right. The screen displays a blue supernova on a black background.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vlJ5Kr1QsajeZgdIwUUknGz9TPc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23272057/mchin_200521_5049_0005.jpg\">      <figcaption><em>Here’s the regular Galaxy Book 2 360. Note the bigger bezels.</em></figcaption>  </figure><p id=\"uq9cBY\">These devices can be configured with up to a 12th-Gen Core i7, 32GB of RAM (the Book 2 360 maxes out at 16GB), and 1TB of storage (the Book 2 360 goes up to 512GB). Samsung says they’ll be certified through Intel’s Evo program (which means that Intel vouches that a device’s performance, battery life, and other important features are up to snuff). </p><p id=\"l6Dzjp\">The Pro models meet <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=24542&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fwindows%2Fbusiness%2Fwindows-11-secured-core-computers\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Microsoft’s “secured-core PC” requirements</a>, which means that they include various hardware-based security components like TPM 2.0 and virtualization-based security, as well as features consumers might care more, about like biometric authentication. (Both of these devices have fingerprint sensors in their power buttons.) </p><p id=\"pKcl8N\">And both Pro models support a few Samsung-specific connectivity features, which has always been a major draw for Galaxy Books among Samsung enthusiasts. These include Single Sign-on, Smart Switch (which makes it easier to transfer data, photos, settings, etc. between PCs), and support for the SmartThings smart home dashboard. </p>  <figure class=\"e-image\">        <img alt=\"The Samsung Galaxy Book 2 Pro 360 next to a Samsung Galaxy Tab S8. The Galaxy Book displays a blue supernova on a black background. The Tab S8 displays a Microsoft Edge homepage.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_EQlj8fK6DbpONWAmc0wOryIilE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23272055/mchin_200521_5049_0003.jpg\">      <figcaption><em>Here’s Multi Control in action with a Galaxy Book 2 Pro 360.</em></figcaption>  </figure><p id=\"lcvBKM\">An interesting addition is Multi Control, which allows you to use a Galaxy Tab S8 as a secondary screen alongside a Galaxy Book 2 Pro. I got to try this out with a 15-inch Book 2 Pro 360, and it was functional; I could successfully move the cursor back and forth between the two Galaxy devices, dragging windows and such. I did experience some significant lag when navigating on the Tab S8 — the cursor seemed like it was having trouble keeping up with my gestures, though it did eventually follow them. This is something I hope Samsung irons out as the release date approaches. </p><p id=\"aFrGUV\">Stay tuned for our full reviews of these devices, where we’ll have more impressions of the new webcams and software features.</p><p id=\"D8GoIC\"><em>Photography by Monica Chin</em></p><p id=\"p0CIqf\"></p><p id=\"CAwJGl\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/y_HaHM6YjiJN1HsHpHAvl90TeqI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23272053/mchin_200521_5049_0001.jpg",
  "description": "13-inch and 15-inch options.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}