{
  "title": "Samsung’s self-cleaning Jet Bot Plus robot vacuum is half off today",
  "url": "https://www.theverge.com/good-deals/2022/3/24/22994306/samsung-jet-bot-plus-robot-vacuum-jabra-elite-65t-earbuds-meross-smart-home-apple-imac-deal-sale",
  "date": "2022-03-24T16:02:15.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/B0zGYmAfnme7X8lgYRG2MMugE4U=/113x0:1328x810/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70666797/samsung_jet_bot_plus.0.jpeg\" />        <figcaption><em>The Samsung Jet Bot Plus and its cleaning station, rendered in a very fake home.</em> | Image: Samsung</figcaption>    </figure>  <p id=\"dqMkjk\">Samsung is no stranger to attacking a product category with multiple options at different price points, and offering large discounts on those products is another of its signatures. The robot vacuum space isn’t an exception, with the Samsung Jet Bot Plus — its mid-tier option — available today for $399.99 at <a href=\"https://shop-links.co/cgTeyEKCv7g\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> and <a href=\"https://www.amazon.com/Automatic-Emptying-Precision-Cleaning-Intelligent/dp/B0912V3VTZ?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a>. The Jet Bot Plus offers fairly strong suction, a soft brush that’s especially good for hard surfaces, and a self-cleaning station borrowed from <a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\" rel=\"sponsored nofollow noopener\" target=\"_blank\">its pricier, AI-infused counterpart</a>. This package usually costs $799, which is a bit much for a robot vacuum that lacks object detection, but the current discount of 50 percent makes the Jet Bot Plus more approachable.</p><p id=\"ZqmKCI\">The Jet Bot Plus’ addition of a self-cleaning station makes it more attractive at this price point, though its brush design makes it better suited for hard floor surfaces, as it lacks some of the deep carpet cleaning you get in other models. It also has a tendency to tangle up long strands of hair, which is something vacuums like the <a href=\"https://www.theverge.com/2022/3/10/22967391/irobot-roomba-i3-update-smart-mapping\" rel=\"sponsored nofollow noopener\" target=\"_blank\">recently updated iRobot Roomba i3 Plus EVO</a> now do better — albeit <a href=\"https://shop-links.co/cgTe1Pfl1k2\" rel=\"sponsored nofollow noopener\" target=\"_blank\">for about $100 more</a>. While that Roomba i3 might be worth it for some that can stretch their budgets a little further, the Jet Bot Plus offers a nice value at its current deal price.</p><div id=\"JwUoOH\"><div data-anthem-component=\"productcard:11111876\"></div></div><p id=\"E4qDmj\">Sticking with smart home deals for a moment, the <a href=\"https://www.amazon.com/dp/B084Z5QZR2?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Smart Garage Door Opener Remote by Meross is currently just $37.49</a> at Amazon when you clip the $5 on-page coupon. We have seen similar deals to this one in the past, and it’s about $2 shy of its lowest price to date, but it’s a worthwhile accessory that’s highly recommended by some <em>Verge</em> staffers. </p><p id=\"ecLBVg\">This smart garage door opener doesn’t require a hub, but it easily connects to Apple HomeKit, Amazon Alexa, Google Assistant, and Samsung SmartThings. Using Meross’ smartphone app, you can open or close your garage door from anywhere you have an internet connection. This helpful feature is an invaluable asset when you’re not home but need to let in a friend or family member or for just never having to worry “Did we remember to close the garage door before we left?” ever again. </p><div id=\"aDCFmN\"><div data-anthem-component=\"productcard:10919412\"></div></div><p id=\"jGusEf\">In need of good pair of true wireless earbuds that won’t break the bank? Or maybe you already own a fancy pair like Apple’s AirPods Pro but need something else as a “knock-around” model? Enter the Jabra Elite 65t, which are <a href=\"https://shop-links.co/cgTeMhDAnPQ\" rel=\"sponsored nofollow noopener\" target=\"_blank\">currently on sale for just $54.99 at Best Buy</a>, a discount of about $45. These earbuds came out in 2018, and while many other earbuds have added newer tech like improved audio codecs in that time, they have also continued getting pricier. It’s hard to find earbuds in this price range from a reliable brand that are worthwhile, at least without opting for a refurbished or used model.</p><p id=\"M2EOaW\">The Jabra Elite 65t may lack noise cancellation and <a href=\"https://www.theverge.com/2021/8/31/22649800/jabra-elite-7-pro-active-3-features-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">will soon be phased out in favor of Jabra’s latest models</a>, but they offer a stable wireless connection and good sound quality, rendering them a no-fuss value. And just look at the size of that charging case! It’s incredibly compact, which makes these all the better for throwing in a gym bag or taking along on a trip. Now, if only it didn’t charge over Micro USB. <a href=\"https://www.theverge.com/2018/4/17/17247354/jabra-elite-65t-truly-wireless-earbuds-review-airpods\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review</strong></a>.</p><div id=\"iCf4Km\"><div data-anthem-component=\"productcard:9625428\"></div></div><p id=\"atMrsp\">Lately, it seems as though Apple’s new <a href=\"https://www.theverge.com/22981815/apple-mac-studio-m1-ultra-max-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Mac Studio</a> and <a href=\"https://www.theverge.com/2022/3/17/22982915/apple-m1-ultra-rtx-3090-comparison-specs-charts-cpu-gpu-performance\" rel=\"sponsored nofollow noopener\" target=\"_blank\">M1 Ultra CPUs</a> have been generating all the buzz, namely for their exceptional performance for high-level pros and content creators. But let’s not forget that even the base M1 processor does a fine job for us mere mortals who need an efficient machine for everyday use and some light creative work. Apple’s colorful, 24-inch iMac fits the bill for an everyday desktop computer, whether you intend to do some light work in Adobe Photoshop and Lightroom or just need a well-equipped family computer that should last more than a few years.</p><p id=\"KpKEvd\">How ideal, then, that the <a href=\"https://www.amazon.com/dp/B0932FPBV8?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">base model iMac is on sale at Amazon right now for $100 off</a>, matching the machine’s best price to date. This configuration comes with the M1 CPU outfitted with seven GPU cores, along with 8GB of RAM and a 256GB SSD. This model usually runs $1,299, but today’s deal brings the price down to $1,199 for the blue, pink, and green colorways. It’s an excellent value for a capable computer, complete with a 4.5K display and a quality 1080p webcam — complete with Apple’s Center Stage. <a href=\"https://www.theverge.com/22440059/apple-imac-m1-2021-24-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review</strong></a>.</p><div id=\"LkeIER\"><div data-anthem-component=\"productcard:10872931\"></div></div><h2 id=\"WRIM9y\">Deals, but more</h2><ul><li id=\"tHkJVv\">The new <a href=\"https://www.theverge.com/2022/1/2/22858577/samsung-frame-2022-tv-matte-antireflective-screen\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Samsung Frame TVs for 2022</a> are landing, but the outgoing 2021 models are seeing some solid discounts right now. The jumbo-sized, 75-inch Frame TV is about $2,700 ($300 off) at <a href=\"https://www.amazon.com/SAMSUNG-75-Inch-Class-Frame-Built/dp/B08VVYS438?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and directly from <a href=\"https://shop-links.co/cgTffJaeAB4\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Samsung</a>. The older model may lack the new matte display of the 2022 Frame, but they both display refined artwork while in standby mode.</li><li id=\"znnfFf\">Need a large amount of external storage? <a href=\"https://shop-links.co/cgTeFYUxMlm\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Western Digital’s 8TB EastyStore is $149.99</a> ($60 off) as part of Best Buy’s deals of the day. The USB 3.0 hard drive is compatible with both Windows and macOS, as well as Apple’s Time Machine feature (after reformatting).</li><li id=\"2YmFEe\"><a href=\"https://www.dpbolvw.net/click-8836602-13527013?sid=vergedailydeals032422&amp;url=https%3A%2F%2Felectronics.woot.com%2Foffers%2Frazer-nari-essential-gaming-headset-30\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Razer’s Nari Essential is just $39.99</a> ($60 off) at Woot. We see these go on sale rather frequently, but the wireless gaming headset remains an excellent value, given the current sale price is usually reserved for wired models only.</li><li id=\"q62mtu\">The <a href=\"https://www.amazon.com/dp/B004YW7WCY/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Logitech C615 webcam is just $29.99</a> ($40 off) at Amazon. This little webcam may not stack up to pricier models in terms of dynamic range or <a href=\"https://www.youtube.com/watch?v=0gZpdU1NPYY\" rel=\"sponsored nofollow noopener\" target=\"_blank\">extra fancy features</a>, but it’s an affordable price for a 1080p camera with a handy swivel function that allows you to point it anywhere you need. </li><li id=\"Gm5wiX\"><a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://nomadgoods.com/collections/spring-cleaning-sale-10\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Nomad is running a spring cleaning promotion on its site</a>, discounting its leather iPhone cases, AirPods cases, Apple Watch straps, and <a href=\"https://www.theverge.com/2021/12/14/22833200/nomad-base-station-magnet-edition-wireless-charger-price-features\" rel=\"sponsored nofollow noopener\" target=\"_blank\">charging stations</a> by 10 percent. </li></ul><aside id=\"iXPAsZ\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"deals\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/-IgWUpMJdtFSXgSXocWXHKbuKoo=/0x28:1440x782/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23342089/samsung_jet_bot_plus.jpeg",
  "description": "The bot and self-cleaning station are cheaper than ever.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}