{
  "title": "Samsung Galaxy Book2 Pro 360 (15-inch) review: a light and bright convertible",
  "url": "https://www.theverge.com/23045104/samsung-galaxy-book2-pro-360-15-inch-review-a-light-and-bright-convertible",
  "date": "2022-04-28T12:00:00.000Z",
  "author": "Monica Chin",
  "content": "  <p>This lightweight is worth a look</p> <p class=\"p--has-dropcap\" id=\"rp0X8J\">Light chassis, great screen. That’s the entirety of what you sign up for when you buy a Samsung Galaxy Book. They are not the most powerful laptops out there, and they’re not what I’d recommend people be issued for, say, work. But for those looking for a great multimedia laptop that’s a breeze to carry around, this is the one. </p><p id=\"cBBljE\">That’s certainly the case with the Galaxy Book2 Pro 360, the latest 15-inch convertible addition to the Galaxy Book line. It’s 3.11 pounds, it’s under a half inch thick, it has an OLED display, and it’s just <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.samsung.com/us/computing/galaxy-book2/buy/?link=galaxy-book2-360\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$1,549.99 as reviewed</a>. It’s a good option for all people shopping in the ultraportable space but has some extra features that will particularly appeal to Samsung superfans. If I were already plugged into the Galaxy ecosystem, I’d probably be ordering this laptop right now because there’s really not much to dislike about it as long as you know what you’re getting. </p><div id=\"03IDXK\"><div data-anthem-component=\"scorecard:11164434\"></div></div><div class=\"c-float-right\"><div id=\"gY50Eb\"><div data-anthem-component=\"aside:11164436\"></div></div></div><p id=\"ncq5v3\">Samsung is famous for its screens, and this Galaxy Book doesn’t disappoint on that front. It’s an OLED panel with vivid colors — videos and photos looked great. It’s fairly accurate, covering 100 percent of the sRGB gamut, 96 percent of AdobeRGB, and 99 percent of P3 in our testing. <a href=\"https://www.theverge.com/22419899/samsung-galaxy-book-pro-360-15-inch-review\">Last year’s 15-inch Galaxy Book Pro 360</a> was a bit dim, maxing out at just 276 nits, but Samsung has fixed that problem with this screen, which reached a much brighter 391 nits. The touch panel also supports Samsung’s S Pen (included in the box), which you can use for note-taking, sketching, and other stylus things.</p><p id=\"z72gZM\">One thing to be aware of is that the screen has a 1920 x 1080 resolution, so the image is noticeably more pixel-y than what you’d see on a higher-resolution screen, such as the 3546 x 2160 OLED on the <a href=\"https://www.theverge.com/22958468/dell-xps-15-2021-oled-review\">Dell XPS 15.</a> Those start to get pretty expensive, though, and this is likely one of the best-looking panels you’ll find at this price point. (It’s also 16:9, which isn’t my preference but is not as cramped-feeling on a 15-incher as it is on smaller machines.)</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The Samsung Galaxy Book2 Pro 360 in tablet mode seen from above, displaying The Verge homepage.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2ljmDmyXl8RCwNhGSYMzcb8FkfU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397438/akrales_220414_5142_0095.jpg\">      <figcaption><em>Maybe someday Samsung will make my 16:10 wish come true.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The back hinge of the Samsung Galaxy Book2 Pro 360\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BX_Hl3CzMK5Y3jfs0Wf3OHCkuPs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397432/akrales_220414_5142_0037.jpg\">      <figcaption><em>Loving the lack of screen wobble on this thing.</em></figcaption>  </figure></div></div></div><p id=\"DjAcuh\">Next, on the weight. At 3.11 pounds, this laptop is a breeze to carry around. It’s basically the same weight as last year’s model (which looks otherwise very similar to this year’s, though the Book2 comes in a new Burgundy color). For context, it’s over a pound lighter than the OLED Dell XPS 15 or <a href=\"https://www.theverge.com/22751921/apple-macbook-pro-14-16-inch-2021-m1-pro-max-review\">Apple’s 16-inch MacBook Pro</a> (and it’s even lighter than the 14-inch MacBook Pro). I have trouble thinking of many 15-inch convertibles lighter than this — there are certainly lighter clamshells, like the 2.44-pound <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.lg.com%2Fus%2Flaptops%2Flg-15z95p-p.aas5u1-ultra-slim-laptop&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23045104%2Fsamsung-galaxy-book2-pro-360-15-inch-review-a-light-and-bright-convertible\" rel=\"sponsored nofollow noopener\" target=\"_blank\">LG Gram 15</a>, but it’s hard to find them with OLED at this price.</p><p id=\"EgMcLX\">Before I go on: if you’re not impressed by the two features I’ve just discussed, this probably isn’t the laptop for you. They’re the two standout qualities of the Galaxy Book line and the two places where it’s solidly at the top of its category. They are what you’re paying for if you buy this. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Samsung Galaxy Book2 Pro 360 half open in front of a polka dot wallpaper.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2Wqyjf3gRSwBJNJbxT19KlzeQAE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397429/akrales_220414_5142_0011.jpg\">      <figcaption><em>The pen does magnetically attach to the lid, but there’s no garage.</em></figcaption>  </figure><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The ports on the left side of the Samsung Galaxy Book2 Pro 360.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_1uMxS38VXbTl1LBUb541ZF-XOE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397433/akrales_220414_5142_0038.jpg\">      <figcaption><em>Two USB-C on the left.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The ports on the right side of the Samsung Galaxy Book2 Pro 360.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MG0WXhnsuqP3JebilOWZ_p8jHAo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397431/akrales_220414_5142_0034.jpg\">      <figcaption><em>Here, have more USB-C (and a headphone jack, and a microSD slot).</em></figcaption>  </figure></div></div></div><div class=\"c-float-right\"><div id=\"0DFIvd\"><div data-anthem-component=\"aside:11164466\"></div></div></div><p id=\"JCprin\">Okay, for everyone still with me, let’s talk about the software. While this computer should have broad appeal, Samsung fans will get a bit more out of it than everyone else. You can charge it with Samsung’s 65W Universal Charger, which can also charge Galaxy phones and tablets. It also comes with Samsung’s One UI interface tweaks, which means it has many apps (with icons identical to their mobile counterparts) that Samsung users will be familiar with. There’s a laundry list of Samsung apps that you can sync across devices. (I personally found the sheer number of Samsung programs on here intimidating — I counted 28 in total— but those with Galaxy phones will presumably already know which to use for what.) </p><p id=\"m0SOAN\">The feature I found the most useful was Second Screen, which allows you to, as the name implies, use a Samsung tablet as a second screen, similar to Apple’s Sidecar feature or the third-party Duet Display. I gave this a shot with a <a href=\"https://www.theverge.com/23015091/samsung-galaxy-tab-s8-ultra-tablet-android-review\">Tab S8 Ultra</a>, and it took probably five seconds to get up and running. It worked quite well — I could easily drag and drop windows between the two devices, and though I experienced some slight cursor lag while navigating on the S8, it was very usable. If I were to buy a Galaxy Book, I would probably also consider buying a <a href=\"https://www.theverge.com/23014720/samsung-galaxy-tab-s8-s8-plus-tablet-android-review\">Galaxy Tab</a> because the ability to easily whip out a second screen in an airport or coffee shop seems very handy (especially if you only need to bring one charger), and the fact that it’s all first-party is a good sign for consistent integration down the line.</p><p id=\"FWcWGL\">I was also able to easily share photos between the Galaxy Book and the Tab S8 using <a href=\"https://www.theverge.com/2020/2/11/21133825/samsung-galaxy-s20-quick-share-airdrop-easy-sharing-feature\">Quick Share</a>, Samsung’s AirDrop competitor. This was a bit slower than AirDrop between a Mac and an iPhone, but it did still work.</p><p id=\"QSi27T\">And there’s also Studio Mode, which includes a number of tools to help you look better on video calls. Some of these worked well. Auto Framing did a good job of keeping me in frame as I was moving around, and Blur adequately blurred the busy background behind me. Others are still a bit goofy; Color, which replaces your background with a solid color of your choice, had a bit of trouble figuring out where the edges of my hair were. Some of the Face Effects, which are supposed to shrink your nose, enlarge your eyes, and generally make you look more conventionally attractive in real time, made me look like a bit of an alien. But these are all there, overall, if you want to use them with the Galaxy Book2’s 1080p webcam (a welcome upgrade from last year’s camera).</p><p id=\"qliSLH\">Probably the one downside of the Book2 360 is the port selection. There are just three USB-C ports (one of which is Thunderbolt 4), a microSD, and a headphone jack. This will be fine for some people, but I’d like to see an HDMI or a USB-A on there. </p>  <figure class=\"e-image\">        <img alt=\"The keyboard of the Samsung Galaxy Book2 Pro 360 (15-inch) seen from above.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/blFUOmGygCovLW4OUm6eyGvGdTM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397437/akrales_220414_5142_0088.jpg\">      <figcaption><em>The keyboard is a bit flat but also very quiet, which I appreciate in an on-the-go device.</em></figcaption>  </figure><p id=\"jIWA3F\">On the inside, my $1,549.99 test unit comes with 1TB of storage and 16GB of RAM, as well as Intel’s Core i7-1206P, which is one of Intel’s new <a href=\"https://www.theverge.com/2022/2/23/22941383/intel-12th-gen-alder-chips-p-series-u-laptops-release-date\">P-series chips</a> for ultraportable devices. All three colors are the same price; you can also get a 512GB storage / 8GB RAM configuration for $1,349.99. 13.3-inch models start down at $1,249.99. This certainly isn’t a cheap laptop, but for context about how reasonable of a deal this is, a Dell XPS 15 with a Core i7 and an OLED screen costs <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.dell.com/en-us/shop/laptops/new-xps-15/spd/xps-15-9520-laptop/xn9520cto020s\" rel=\"sponsored nofollow noopener\" target=\"_blank\">close to $1,000 more</a>. (That gets you a beefier chip and screen higher-resolution screen, but still). </p><p id=\"XnHwbe\">Despite the “Pro” moniker, the Galaxy Book is not ideal for intense professional workloads or gaming, given its lack of a discrete GPU or H-series processor. But it could certainly keep up with whatever tasks I needed it to do, including all kinds of streaming, Zoom calls, and photo editing, both on battery and on power. It even beat the 11th Gen Dell XPS 15 on Cinebench R23 Single (reflecting Alder Lake’s advances in single-core performance) and was not too far behind it on the multicore benchmark. This is a solid CPU.</p><p id=\"5hZgDk\">The deck was often a bit warm in the keyboard area but never uncomfortably so. The only time I heard the fans was when I was running a long Zoom call on battery over a huge heap of Chrome tabs, and they weren’t loud enough to be distracting even then.</p><p id=\"PnEjWH\">Battery life was also fairly good. I averaged eight hours and 47 minutes of continuous work with the screen at 200 nits of brightness, which is the best result I’ve seen from a 12th Gen Intel processor so far. It’s not quite as much as I saw from last year’s Galaxy Book Pro 360, which gave me close to 10 and a half hours on a charge, but it should still get you through a full day of work.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The fingerprint reader on the Samsung Galaxy Book2 Pro 360 (15-inch) seen from above.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Lo4IG8yvGG8dROfqs2EG64ltuoE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397434/akrales_220414_5142_0040.jpg\">      <figcaption><em>Fingerprint sensor!</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The webcam on the Samsung Galaxy Book2 Pro 360.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Uoo_fCNozX5UMwIHUv8qKC-jYlI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23397436/akrales_220414_5142_0083.jpg\">      <figcaption><em>The webcam itself is...fine.</em></figcaption>  </figure></div></div></div><p id=\"wsQA11\">Provided that you know what you’re getting, I really don’t have many complaints about the Galaxy Book2 Pro 360. Its battery life is good, its screen is great, and it’s one of the lightest 15-inchers you’ll find. The various Galaxy ecosystem features will be icing on the cake for owners of Samsung phones and tablets. But the real highlight of this laptop is how effortless it is to transport places (and how effortless it is to bring a second screen along). </p><p class=\"c-end-para\" id=\"2TGpuw\">I struggle to think of a model I’d buy over this one if I were looking for a light, 15-inch multimedia device (rather than a powerful workstation). The primary one that comes to mind is <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=24542&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fstore%2Fconfigure%2FSurface-Laptop-4%2F946627fb12t1%3Fcrosssellid%3D%26selectedColor%3D9A9CA3\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Microsoft’s 15-inch Surface Laptop 4</a>. But that’s still a fairly different device; while it is slightly (and, in my opinion, not noticeably) lighter, the top model gives you half this Book2’s storage for the same price, it’s not a convertible, and it has a non-OLED display. For Samsung devotees, I think the Galaxy Book2 Pro is a no-brainer, and for everyone else, I think it’s worthy of consideration. The thin port selection means it wouldn’t be my laptop of choice, but it offers an excellent package in a space that doesn’t have a ton of competitors.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KV8hGSFMxAq1mwrADkkSHqaPb-o=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397428/akrales_220414_5142_0006.jpg",
  "description": "A lightweight contender",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}