{
  "title": "Samsung Galaxy A13 5G review: functional, no-frills 5G",
  "url": "https://www.theverge.com/22907086/samsung-galaxy-a13-5g-review-price-screen-specs",
  "date": "2022-02-02T13:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p>A low-cost phone with meaningful 5G connectivity</p> <p class=\"p--has-dropcap\" id=\"Cp7Rb5\">The Galaxy A13 5G doesn’t offer much in the way of surprises, good or bad. For $249, it’s a reliable device with good performance, healthy battery life, and a decent camera. None of this comes as a surprise because Samsung makes a lot of these kinds of phones, and it’s something the company is very good at.</p><p id=\"2YQtzB\">The phone launched in the US as an AT&amp;T exclusive; now, you can buy it unlocked or through T-Mobile, too. But that initial carrier relationship plays into what might be the most compelling reason to look at the A13 5G right now: it’s certified to use AT&amp;T’s newly enabled C-band spectrum. This is the variety of 5G that promises faster-than-4G speeds and good signal reach — a combination that some US 5G networks have been lacking until now. The list of C-band enabled devices at the network’s launch was short and dominated by pricey flagships, with the exception of the Galaxy A13 5G.</p><div id=\"VOLCQW\"><div data-anthem-component=\"scorecard:11001805\"></div></div><p id=\"d6Arb8\">More phones at a range of price points will join the C-band club this year, but for now, the A13 5G offers the lowest price of admission if you’re on AT&amp;T. That’s not a good reason in itself to buy the A13 5G, especially since <a href=\"https://www.theverge.com/2022/1/19/22891286/att-5g-rollout-select-metro-areas-faa-delay\">AT&amp;T’s C-band launch is limited to just eight US cities</a>, and rollout will be slow, but it’s a point in the A13’s favor if you’re already considering it.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/d9xuaEFmfXXo0ZJAkOum13xVRIU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23200086/ajohnson_220124_4990_0001.jpg\">      <figcaption><em>The A13 5G’s 6.5-inch screen is plenty big, but its 720p resolution is too low for its size.</em></figcaption>  </figure><p id=\"lcBqmB\">The Galaxy A13 5G features a 6.5-inch 720p screen — a low resolution for a relatively big display. It’s an LCD panel, too, which is common in the under-$300 class and looks a little washed out compared to the richer OLED displays you’ll find on midrange phones like the Galaxy A52 5G. It does feature up to a 90Hz refresh rate, which makes scrolling and animations look a little smoother than the standard 60Hz. But overall, the poor resolution and low contrast mean the screen isn’t one of the A13 5G’s strengths.</p><div class=\"c-float-right\"><aside id=\"eE7rDI\"><q>You may need to factor an extra $10–20 for a microSD card into your purchase</q></aside></div><p id=\"vGcm42\">The MediaTek 700 5G chipset and its 4GB of RAM are, however, strong points. For a phone at this price, it handles daily tasks very well, letting me jump quickly between apps and isn’t prone to closing apps in the background overzealously. It stutters a little with more intensive tasks like zooming / scrolling around Google maps or Zillow, but overall, the A13 kept up with everything I asked it to do in my day-to-day. </p><p id=\"UI6Iea\">The A13 5G includes just 64GB of built-in storage. That’s not uncommon in the budget class and is enough to get by if you’re very careful with your cloud storage options and downloads, but it’s not a lot. You may need to factor an extra $10–20 for a microSD card into your purchase. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/O6jffww1v8MDz-OziHCVxIusROw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23200090/ajohnson_220124_4990_0005.jpg\">      <figcaption><em>The power button doubles as a fingerprint reader for biometric unlocking.</em></figcaption>  </figure><p id=\"bHFtUl\">There’s a fingerprint sensor embedded in the power button on the side of the phone, and it’s very fast — so fast I actually double-checked that the phone was actually locking correctly (it was). It’s not as sleek as the in-display readers on high-end phones, but it actually feels more reliable and easier to use. Long live the side-mounted fingerprint reader, I say.</p><p id=\"MKEW99\">Battery life is another one of the A13’s strong points. The phone’s 5,000mAh cell lasted me a couple of days of moderate use on Wi-Fi; a heavy user would likely get through a full day and then some. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Z8EcXg5iHct7FUo1IfgViq1XaC8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23200089/ajohnson_220124_4990_0004.jpg\">      <figcaption><em>The A13 5G includes a 50-megapixel main camera along with two low-res macro and depth sensors.</em></figcaption>  </figure><p id=\"N8KC4Z\">The A13 5G’s camera setup is basic: there’s a 50-megapixel main camera with f/1.8 lens joined by 2-megapixel macro and depth sensors. Those 2-megapixel cameras are mostly useless, so you’re really just working with the standard wide-angle rear camera and a 5-megapixel selfie camera. There’s no ultrawide — you’d need to step up to the A32 5G in Samsung’s lineup for that — and there’s no night mode in the camera app. </p><div id=\"5vHWBo\"><div data-anthem-component=\"gallery:11001679\"></div></div><p id=\"tlhCGn\">Photos in bright daylight look fine, and even moderately low light images look good enough for social media, though images in very low light are a smudgy mess of noise reduction. The live preview in the camera app as you’re taking photos looks horribly washed out, but the final product almost always looks much better. This makes it hard to know what you’re getting exactly, so you just have to trust the A13’s camera to do its thing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lBCfh_pWRPcbz68Puw-s-OM7eso=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23200088/ajohnson_220124_4990_0003.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The Galaxy A13 5G is a functional, low-cost device that will connect to AT&amp;T’s new C-band 5G spectrum.</em></figcaption>  </figure><p id=\"vfI2zP\">The Galaxy A13 5G is a fine budget device that makes sense for those who are more concerned with day-to-day performance and long battery life than a high-quality screen or a versatile camera. If you’re on a strict budget and you’re an AT&amp;T customer, those are two more reasons to consider the A13. The carrier’s C-band 5G is limited to just a few markets now, but the phone will be supported with three years of security updates and two years of OS upgrades — long enough to see the network expand to more major cities.</p><div class=\"c-float-left\"><aside id=\"2dzVGl\"><q>If you’re on a strict budget and you’re an AT&amp;T customer, those are two more reasons to consider the A13</q></aside></div><p id=\"H83WgW\">If any of the above criteria doesn’t apply to you, then there are better options available for the same cost — even less! The <a href=\"https://www.theverge.com/22547482/oneplus-nord-n200-5g-review-screen-price-specs\">$239 OnePlus N200 5G</a> is a great choice if you’re on T-Mobile — it offers comparable performance and a nicer screen for $10 less than the A13’s retail price. The N200 doesn’t work on AT&amp;T or Verizon’s 5G networks, so it’s a 4G-only phone if you’re with one of those carriers — not a bad deal for the price, but you’ll miss out on the better 5G speeds coming over the next couple of years.</p><p id=\"XLrsoW\">As of this writing, the <a href=\"https://www.theverge.com/22538663/motorola-moto-g-stylus-5g-review-specs-screen-price\">Motorola Moto G Stylus 5G</a> has come down in price to $249 if you buy through AT&amp;T (from $399), offering a better screen and equally healthy battery life. It’s not currently certified for AT&amp;T C-band, but it’s a good buy if you’re outside of one of those eight launch cities anyway. </p><p class=\"c-end-para\" id=\"9akHgD\">If those alternatives don’t appeal, then the A13 5G will serve you fine — it’s a reliable device for well under $300 that’s fully prepared for the next generation of wireless technology, with no unpleasant (or pleasant) surprises included. </p><p id=\"THl6u8\"><em>Photography by Allison Johnson / The Verge</em></p><div><div id=\"i02wwr\"><div data-anthem-component=\"aside:11001695\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/tbmhlpUcLcyG63iuk4nTV1SegSg=/0x214:2040x1282/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23200087/ajohnson_220124_4990_0002.jpg",
  "description": "A low-cost ticket to AT&T’s new C-band 5G network",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}