{
  "title": "Samsung and LG preview the future of weird phone displays",
  "url": "https://www.theverge.com/2022/5/11/23066618/lg-samsung-display-foldable-smartphones-360-degree-hinge-dual-fold",
  "date": "2022-05-11T09:17:48.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Wm1nLYekb9qduspSv8x8pxYfN_c=/40x0:480x293/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70855480/SID_2022_The_Future_of_OLED.0.gif\" />    </figure>  <p id=\"RS3XNj\">Future foldables could move on from existing single-fold designs to fold twice, use displays that are capable of folding both inwards and outwards, or even use rolling screens to expand outwards. That’s if manufacturers embrace new folding screen technologies being shown off by <a href=\"http://global.samsungdisplay.com/29905/\">Samsung Display</a> and <a href=\"https://news.lgdisplay.com/global/2022/05/lg-display-showcases-innovative-oled-technology-at-sid-2022/\">LG Display</a> this week in San Jose, California, during the annual Display Week conference. </p><p id=\"bP8kzP\">LG Display is showing off an 8-inch foldable touchscreen which it says can fold both inward and outward, similar to what we saw from <a href=\"https://www.cnet.com/tech/mobile/we-tried-tcls-new-foldable-phone-concepts-with-rollable-and-bendable-screens/\">TCL’s Ultra Flex concept</a> earlier this year. The design allows a single folding display to serve as both an inner screen (like with the <a href=\"https://www.theverge.com/22638257/samsung-galaxy-z-fold-3-review\">Galaxy Z Fold 3</a>) and an outer screen (like with <a href=\"https://www.theverge.com/2020/2/24/21145519/huawei-mate-xs-foldable-phone-news-features-quad-layer-screen-hinge-kirin-990-5g\">Huawei’s Mate XS</a>). Devices equipped with this “360-degree Foldable OLED” could avoid the need to have both an inner and an outer display in favor of just one large screen. </p><div id=\"auZbh9\"><div ><iframe src=\"https://www.youtube.com/embed/LqLkRgCxISg?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"hqNzgQ\">LG Display’s 360-degree Foldable OLED can apparently survive being folded “over 200,000 times” before it starts to break, and LG Display says it uses a “special folding structure” that minimizes any creasing. <a href=\"https://gizmodo.com/lg-develops-folding-oled-display-that-can-fold-in-and-o-1848904544\"><em>Gizmodo</em> reports</a> that the display has a resolution of 2,480 x 2,200 pixels, the same as the inner display on <a href=\"https://www.theverge.com/2021/2/22/22294983/huawei-mate-x2-fold-specs-price\">Huawei’s Mate X2</a>. </p><p id=\"ejhbsM\">Not to be outdone, Samsung Display is also showing off some interesting foldable technology of its own. Its Flex G and Flex S displays, which it first showed <a href=\"http://global.samsungdisplay.com/29253/\">back at CES</a>, both offer screens that are able to fold twice. In the case of the Flex G they fold twice in the same direction like a tri-fold wallet, while the Flex S folds once inwards and once outwards like a paper map.</p><div id=\"6n8lqa\"><div ><iframe src=\"https://www.youtube.com/embed/mA8lvN7ZFb0?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"dYNGBZ\">Samsung Display also has a pair of sliding handsets with screens that can unfurl horizontally or vertically. We’ve seen plenty of rollable concepts over the years from companies including <a href=\"https://www.theverge.com/circuitbreaker/2020/3/5/21165069/tcl-foldable-trifold-phone-hands-on-rollable-concept-prototype-display-tablet\">TCL</a>, <a href=\"https://www.theverge.com/2021/6/16/22536363/oppo-x-2021-rollable-smartphone-demonstration-features\">Oppo</a>, and even <a href=\"https://www.theverge.com/2021/1/12/22226532/lgs-rollable-phone-launch-release-date-ces-2021\">LG</a>  prior to it <a href=\"https://www.theverge.com/2021/4/4/22346084/lg-exits-smartphone-business\">exiting the smartphone business entirely</a>. But despite the interest, no smartphones with rollable displays have yet made it to market. </p><p id=\"O6UqcS\">These are just some of the new form-factors that LG Display and Samsung Display are showing off at this week’s show. Both companies are also investing heavily in OLED displays for car infotainment screens, as well as screens designed for gaming, like Samsung Display’s OLED laptop screen with a 240Hz refresh rate, or a folding screen that’s designed to have game controllers attached to both ends. LG Display also has a 17-inch foldable OLED laptop, where the entire inner surface of the clamshell design is one big folding screen.</p><p id=\"l4KKIh\">As the display divisions of their respective South Korean tech giants, neither LG Display nor Samsung Display actually produce the consumer devices that their panels end up in. But because they supply displays to some of the world’s biggest consumer tech companies, showcases like Display Week can give us an interesting glimpse of where foldable devices are headed in the years to come. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/98bgrMqMvdaaTLe5kisUCNzK2q4=/0x15:740x402/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23452711/image.jpeg",
  "description": "Display Week offers a glimpse into the future of foldables.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}