{
  "title": "Samsung phones will get an extra year of Android updates versus Google’s Pixel",
  "url": "https://www.theverge.com/2022/2/9/22923577/samsung-galaxy-unpacked-android-upgrades-4-years",
  "date": "2022-02-09T15:00:00.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/F6UYQPSvuSGDwBUDWxeqid0sOvg=/0x1:6566x4378/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70488025/1_19_Galaxy_S22_Ultra_Group_Image2_design_HI.0.jpg\" />        <figcaption><em>The new Galaxy S22 phones will get four generations of Android OS upgrades.</em> | Image: Samsung</figcaption>    </figure>  <p id=\"mNQa84\">Samsung announced today during its Galaxy Unpacked 2022 event that the new Galaxy S22 phones and other recent devices will get up to four generations of Android OS upgrades.</p><p id=\"pQny8l\">The company revealed the news in a press release today:</p><blockquote><p id=\"djAtAI\">As part of our commitment to giving users the best possible mobile performance and experience, the entire Galaxy S22 series will be supported by up to four generations of Android OS upgrades. Now millions of Galaxy users can take advantage of the latest security, productivity and other exciting new features, for longer. Samsung will scale this effort across our product line-up to ensure you’re fully supported across your Galaxy ecosystem.</p></blockquote><p id=\"d7EQTG\">The promise of OS upgrades ensures you get more out of a device down the line by getting new features and improved security. This also helps in tech sustainability efforts by extending the useable life of smartphones and keeping them out of electronics junkyards.</p><p id=\"RjPnnf\">Coincidentally, this follows Samsung’s “together for tomorrow” marketing campaign last month during CES to <a href=\"https://news.samsung.com/global/samsung-electronics-unveils-together-for-tomorrow-vision-at-ces-2022\">promote sustainability</a>.</p><p id=\"0MtuiH\">Google committed to five years of updates last year with the debut of its Pixel 6 phones. However, the promise was <a href=\"https://www.theverge.com/2021/10/19/22735485/google-pixel-6-three-years-android-updates-security-feature\">later clarified</a> as five years of security patches and only three years of actual Android OS upgrades.</p><p id=\"OTTTqU\">Samsung’s promise for new Android OS upgrades is great, but there might be variations on what future features will make it to older devices over the years, as noted in today’s release:</p><blockquote><p id=\"5N1grl\">Availability and timing of Android OS upgrades and features may vary by device model and market.</p></blockquote><p id=\"ZZbYsG\">There will be at least 12 devices that will get new Android OS upgrades for at least four years. That includes last year’s Galaxy S21 lineup consisting of the S21, S21 Plus, S21 Ultra, and S21 Fan Edition, plus the Galaxy Z Fold3 and Flip3. The three newly announced S22 devices plus the three new Tab S8 devices will be getting the new Android OS upgrades too.</p><p id=\"Nn7jDv\">In terms of actual demonstrated commitment to long-term support, Apple is still winning. The iPhone 6s from 2015 <a href=\"https://www.theverge.com/2021/6/8/22523351/ios-15-iphone-6s-plus-se-compatibility\">supports the latest iOS 15</a> — albeit without some of the newest features like <a href=\"https://www.theverge.com/22559167/ios-15-live-text-feature-how-to\">Live Text</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uitKK9YwN4cnfePN9mBHBF4FDiw=/0x470:6566x3908/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23227451/1_19_Galaxy_S22_Ultra_Group_Image2_design_HI.jpg",
  "description": "Samsung’s recent devices will get four Android OS updates.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}