{
  "title": "Samsung getting rid of the rotating bezel would be a stupid, stupid, stupid idea",
  "url": "https://www.theverge.com/2022/4/22/23037285/samsung-galaxy-watch-5-rotating-bezel",
  "date": "2022-04-22T18:01:31.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DxLK0O7m1Nr2i5LPKscGHJ4e5tk=/0x0:5417x3611/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70781735/dseifert_200811_4139_0019.0.0.jpg\" />        <figcaption><em>The rotating bezel on the Samsung Galaxy Watch 3.</em> | Dan Seifert / The Verge</figcaption>    </figure>  <p id=\"obHUuv\">While we’re likely months away from seeing Samsung’s Galaxy Watch 5 lineup, a disturbing report is making its way around the smartwatch rumor mill. According to a <a href=\"https://www.sammobile.com/news/exclusive-samsung-galaxy-watch-5-lineup-change/\"><em>SamMobile</em> report</a>, Samsung is considering ditching the Classic model — and possibly the physical rotating bezel along with it.</p><p id=\"JAdxPw\">To put it nicely, that is a stupid idea.</p><p id=\"w73slH\">It is not hyperbole to say that the physical rotating bezel is one of the most beloved features on Samsung smartwatches. It goes back all the way to when its smartwatches were under the “Gear” moniker. The bezel at that time actually <em>looked</em> like a gear — teeth and all. It was a clever design aesthetically, but it was also functional. Being able to rotate the bezel to scroll through widgets, screens, and apps is one of those things that’s so intuitive, it makes you wonder why everyone doesn’t do it.</p><p id=\"n7yyIx\">But no one else does. The only smartwatch that’s come remotely close was the <a href=\"https://www.theverge.com/2017/1/5/14172032/misfit-vapor-smartwatch-touchscreen-watch-fossil-ces-2017\">Misfit Vapor</a> — a watch that was beset with so many delays it almost became vaporware. That had a frosted glass touch bezel that paled in comparison to Samsung’s physical rotating bezel. Misfit then ditched the feature for subsequent models. </p><p id=\"CzaH5d\">If you’ve never worn a Samsung smartwatch, I cannot overstate how satisfying the physical rotating bezel is to use. The clicks it makes put the Apple Watch’s digital crown to shame. It’s more enjoyable than touchscreens, and it doesn’t require you to memorize what the zillion buttons on the sides of your watch do. It works whether you’re wearing gloves or sweaty from a run. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/er54aoa-pNzA-CLB0-Nh4g-qDCg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23409625/Screen_Shot_2022_04_22_at_11.51.53_AM.png\">      <cite>Image: Victoria Song / The Verge</cite>      <figcaption><em>People keep searching to see if Samsung’s keeping the rotating bezel.</em></figcaption>  </figure><p id=\"IHMPsT\">It’s also a fan-favorite feature. Seriously. You only have to take a look at this screenshot above to see how beloved it is. People keep searching to see whether Samsung’s kept the bezel from one generation of smartwatches to the next. When the <a href=\"https://www.theverge.com/21368752/samsung-galaxy-watch-3-review-price-specs-features\">Galaxy Watch 3</a> launched, Samsung even had a <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.samsung.com/global/galaxy/what-is/rotating-bezel/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">support page</a> clarifying which of its watches had the physical rotating bezel. </p><p id=\"Xym5DG\">To be fair, getting rid of the Classic doesn’t necessarily mean that Samsung will trash the concept of bezel navigation completely. It did that with the <a href=\"https://www.theverge.com/2019/3/7/18253561/samsung-galaxy-watch-active-review-smartwatch-fitness-specs-features-price\">Galaxy Watch Active</a>, a decision that was so bemoaned by reviewers that it released the <a href=\"https://www.theverge.com/2019/10/8/20903452/samsung-galaxy-watch-active-2-review-fitness-tizen-apps-features-android-price\">Galaxy Watch Active 2</a> just six months later. This time, Samsung introduced a capacitive touch bezel. (It’s what the standard version of the <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4</a> has, too.) Basically, it did what Misfit wanted to do with the Vapor but better. It made sense since the Active lineup’s design was supposed to be slimmer and sleeker. It was a nice way to keep the feature without sacrificing the design intent. </p><p id=\"GMZ0ky\">The thing is the touch bezel isn’t quite as useful. I appreciated that it kept Samsung’s signature feature, but it’s not as precise. It’s very easy to overshoot the app you’re trying to select, and there’s a learning curve to using it effectively. Also, I run a lot, and it’s simply not as reliable when you’re drenched in sweat. </p>  <figure class=\"e-image\">        <img alt=\"Galaxy Watch 4 Classic (top left) and Galaxy Watch 4 (bottom right)\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nsSkFQ8_ozOZjNPwrd0E0fMaDEA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22788001/dbohn_210816_4717_0007.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>Can we just stick to offering both a physical and digital rotating bezel like with the Galaxy Watch 4 lineup?</em></figcaption>  </figure><p id=\"3A9FUK\">The best-case scenario? Samsung is just switching up its branding. (Again.) Another Galaxy Watch 5 rumor is that in lieu of the Classic, Samsung will <a href=\"https://www.theverge.com/2022/4/8/23017059/samsung-galaxy-watch-smartwatch-wearables\">introduce a Pro model</a>. All we know so far is that the Pro will have a significantly larger battery to make up for the poor battery life on the Galaxy Watch 4 lineup. <em>SamMobile</em>’s report also states this Pro model could potentially only come in one size. And, given the recent trend in wearables, that probably means a significantly bigger size. </p><p id=\"Fbd1Sm\">Should Samsung keep the physical rotating bezel to the larger Pro, you end up creating less choice for consumers. People with smaller wrists who want a medium-sized watch that retains the physical rotating bezel are left with no good solution. People with larger wrists who want a sleeker vibe and good battery life are also left wanting. </p><p id=\"SopDWA\">I’m sympathetic to the fact that shifting over to Wear OS comes with its own challenges that likely require creative thinking both in terms of technology and design. Figuring out the right mix of SKUs to cater to a diverse customer base is also a huge challenge. It’s a problem that Samsung isn’t facing alone. Its competitors also have yet to figure out how to reconcile mass production with the fact that humans come in all shapes, sizes, and design preferences. I just know that removing or limiting options for consumers isn’t the answer. </p><p id=\"UTrSvZ\">Samsung had a good thing going with the Galaxy Watch 4 lineup by providing four sizes across two distinct styles. Is it too much to hope that it doesn’t try to fix what isn’t broken with the Galaxy Watch 5? </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8sKZgCxiy2RGHyuWUWGnTUoTnBQ=/0x388:5417x3224/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21759727/dseifert_200811_4139_0019.0.jpg",
  "description": "It’s one of the few design features that sets Samsung apart.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}