{
  "title": "Saving sites: Pocket’s bookmarking app and its alternatives",
  "url": "https://www.theverge.com/22927750/bookmarks-pocket-firefox-instapaper-raindrop",
  "date": "2022-02-24T13:15:00.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1eLldG7X0pKf23h2_HfOYDWiDqA=/0x22:1956x1326/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70544284/Screen_Shot_2022_02_23_at_11.00.46_AM.0.png\" />    </figure>  <p id=\"tJVaUL\">It’s hard to keep up with all the interesting, important, or just plain fun things you come across on the web. You may come across something you just don’t have time to read right now or want to save because it will come in handy later. But, as most of us have discovered, creating a bookmark on a browser for each article and site that we want to read later can result in a huge bookmarky mess.</p><p id=\"Eha69C\">Years ago, I started getting the better of this issue by signing into Pocket, a popular and long-standing app that allows you to save a bookmarked article to a separate server and then retrieve it for reading at your leisure, using either a computer or a mobile device. Pocket has been around since 2007; originally called Read It Later, it started life as a Firefox browser extension, eventually became its own app, and was acquired by Mozilla in 2017.</p><p id=\"HFC9b9\">Recently, however, I (and at least one other staff member here at <em>The Verge</em>) opened the app to find a warning that “all existing Pocket accounts will need to convert to a Firefox account by June 30, 2022.” The reason, <a href=\"https://support.mozilla.org/en-US/kb/pocket-firefox-account-migration#:~:text=We're%20requesting%20all%20existing,login%20and%20access%20their%20list.\">according to Mozilla</a>, is “[p]roducts from Mozilla use Firefox accounts as a centralized and secure account system.” The company goes on to suggest that this is an advantage for the app’s fans since they will now be able to use two-factor authentication and other security features.</p>  <figure class=\"e-image\">        <img alt=\"If you use Pocket, you’ve probably seen this notice.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AR5qZPnjgtglXy1aZotuullKyIs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23265410/pocket_must_be_converted.jpeg\">      <figcaption><em>If you use Pocket, you’ve probably seen this notice.</em></figcaption>  </figure><p id=\"CxSWoi\">If you use Pocket and already have a Firefox account, or if you don’t mind creating one, there’s no problem: <a href=\"https://support.mozilla.org/en-US/kb/pocket-firefox-account-migration#:~:text=We're%20requesting%20all%20existing,login%20and%20access%20their%20list.\">simply convert the account</a> (you have until June 30th) and continue with Pocket as before. However, if you’re reluctant to add a Firefox account for any reason, there are alternative apps that you can use to collect bookmarks for reading material. </p><p id=\"T2sYpV\">What follows is a description of Pocket and four other bookmarking service apps. This is, obviously, only a limited list: they all offer free versions, and all (except one) sync across a variety of devices, including web browsers, Android devices, and iPhones, among others. There, of course, are other less specific alternatives — for example, note apps such as Evernote and Keep will save and tag article links. </p><p id=\"OSCUlM\">I’ve also linked to instructions for each for importing and exporting existing bookmarks; most will work in HTML format, and several also accept CSV and other file formats.</p><h2 id=\"iFWsNj\"><a href=\"https://getpocket.com/\">Pocket</a></h2>  <figure class=\"e-image\">        <img alt=\"Pocket has developed an attractive interface and a variety of features.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_oCko5087B7qOwdXa5q1q53jf0g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23263791/Screen_Shot_2022_02_22_at_4.08.43_PM.png\">      <figcaption><em>Pocket has developed an attractive interface and a variety of features.</em></figcaption>  </figure><p id=\"Rietss\">Pocket has developed a nicely designed interface with lots of options that let you sort your articles from newest or oldest, choose favorites, display them in list or grid format, and archive the ones you want to keep or organize them via tags. Its Home screen (currently carrying a “beta” tag) shows you your most recent saves along with what it terms “Best of the web.” You can share your articles via social media or recommend them within the app for others to find. There are extensions for a variety of browsers, including Chrome, Firefox, Edge, and Safari, and apps for Android and iOS devices. </p><p id=\"skgaxd\"><strong>Paid version:</strong> the Premium version ($4.99 a month or $49.99 a year) adds a permanent library of everything you’ve saved (in case it disappears from the web) as well as full-text search and other features.</p><p id=\"DAPj2I\"><a href=\"https://getpocket.com/export\"><strong>Export instructions</strong></a><strong> - </strong><a href=\"https://help.getpocket.com/article/1133-importing-into-pocket\"><strong>Import instructions</strong></a></p><h2 id=\"c9sIhM\"><a href=\"https://www.instapaper.com/\">Instapaper</a></h2>  <figure class=\"e-image\">        <img alt=\"Instapaper, which has been around for a while, is a solid, easy-to-use app.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9fPyHVRBPpxW1TFPmbHgR5TP1Hw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23265490/Screen_Shot_2022_02_23_at_9.55.56_AM__1_.png\">      <figcaption><em>Instapaper, which has been around for a while, is a solid, easy-to-use app.</em></figcaption>  </figure><p id=\"MgTmcC\">Like Pocket, Instapaper started out as a simple web add-on and has gone through several iterations (and owners); currently, it is part of an independent company called Instant Paper. The web app has a nicely simple UI; while there is no grid view, you can turn thumbnails on and off. It offers (and syncs across) web browsers (using a Chrome extension, Safari extension, Firefox extension, or bookmarklet), iOS, Android, and Kindle. A free account lets you save an unlimited number of articles, videos, and other content. You can also highlight text in the articles you’ve saved, create up to five notes a month, and edit the name, link, or summary of each article.</p><p id=\"HBbH3G\"><strong>Paid version:</strong> The Premium version ($2.99 / month or $29.99 / year) adds full-text search for your saved documents, unlimited notes, and text-to-speech.</p><p id=\"C4dIdo\"><a href=\"https://www.instapaper.com/user#pocket-import\"><strong>Export instructions</strong></a><strong> - </strong><a href=\"https://www.instapaper.com/user#pocket-import\"><strong>Import instructions</strong></a> (only accessible to registered users)</p><h2 id=\"u3pIip\"><a href=\"http://raindrop.io\">Raindrop.io</a></h2>  <figure class=\"e-image\">        <img alt=\"Raindrop.io is for the serious user, and offers a number of options and UIs.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NTnpAD2vmHxMULUB0W5UiEQyWY8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23265496/Screen_Shot_2022_02_23_at_9.59.13_AM.png\">      <figcaption><em>Raindrop.io is for the serious user, and offers a number of options and UIs.</em></figcaption>  </figure><p id=\"rpnreb\">Raindrop may not have the simplicity of Instapaper, but it has a load of features that could be helpful, especially if you’re serious about your info collections. The web version lets you view your articles in a variety of formats, including an interesting one called Moodboard. Like most of the others listed here, the free version of Raindrop offers an unlimited number of bookmark saves on an unlimited number of devices; these include apps for Macs, iOS devices, Android devices, and extensions for Chrome, Safari, Firefox, and Edge browsers. You can share with others and edit titles, tags, and descriptions.</p><p id=\"h7ANn5\"><strong>Paid version:</strong> The Pro version ($3 / month or $28 / year) adds full-text search, cloud backup, and a permanent library of all your bookmarked sites.</p><p id=\"HWlIgZ\"><a href=\"https://app.raindrop.io/settings/backups\"><strong>Export instructions</strong></a><strong> - </strong><a href=\"https://app.raindrop.io/settings/import\"><strong>Import instructions</strong></a></p><h2 id=\"A20jtA\"><a href=\"https://www.paperspan.com/\">Paperspan</a></h2>  <figure class=\"e-image\">        <img alt=\"Paperspan provides simple, basic bookmarking.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Jg1cBlBoDxNWbUDdDGtlThdIu9M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23265645/Screen_Shot_2022_02_23_at_10.43.14_AM__1_.png\">      <figcaption><em>Paperspan provides simple, basic bookmarking.</em></figcaption>  </figure><p id=\"fkzZSn\">Paperspan is an old-fashioned, simple app that is fine if you want a really plain bookmarking service. You can create separate folders for your saved bookmarks, but that’s about it. Unlike the other three services listed here, there are no nice graphics, no highlighting, no choices between lists and grids — you do not even read the article within the app but are simply sent to the original article. Most readers will probably miss those other features, but if you’re into the bare basics, you may want to give it a try.</p><p id=\"3qpdu1\"><strong>Paid version:</strong> none</p><p id=\"inHJMw\"><a href=\"https://www.paperspan.com/\"><strong>Export instructions - Import instructions</strong></a> (Click on “Import” in the side menu)</p><h2 id=\"nyFwlp\"><a href=\"https://hq.getmatter.app/\">Matter Reader</a></h2><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Matter’s home screen has recommended reading.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YELWiEawJBpQblruOH3iOZcVcQA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23266014/IMG_B2488C4769AC_1.jpeg\">      <figcaption><em>Matter’s home screen has recommended reading.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Your queue of saved links.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0EqskGtApbpNSvVhBOuh-seN0b4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23266015/IMG_D06BAC09772E_1.jpeg\">      <figcaption><em>Your queue of saved links.</em></figcaption>  </figure></div></div></div><p id=\"DsWcPA\">Matter is a brand new, still-in-development app that is currently only available for iOS devices and for the web (although you have to install it on iOS first); an Android app is promised sometimes in the future. The app is much more attuned to following social media favorites and finding new influencers than simply saving bookmarks. You can add your email to read your newsletters, follow specific tweeters, sync with apps such as Readwise and Notion, and send articles to Kindle. Currently, the mobile app is the way to go; the web version simply shows sites from your queue without any other features. If you want to pull in your existing Pocket sites, you do it by connecting to the app (rather than importing data). Currently, the app is free without any premium tiers. All in all, an interesting app with potential.</p><p id=\"K9IEKd\"><strong>Export instructions: </strong>in the app, select Settings &gt; Export your data</p><p id=\"CTn6VP\"><strong>Import instructions:</strong> in the app, select Settings &gt; Connected Accounts</p><p id=\"EziSjX\"></p><p id=\"ypAjrp\"></p><p id=\"XmMi4e\"></p><p id=\"uZCI7I\"></p><p id=\"W1ol33\"></p><p id=\"3C4zls\"></p><p id=\"KEAMkX\"></p><p id=\"wd2DQb\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SaA0KS1gbRBWO3DO7haHrAaJkkc=/0x162:1956x1186/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23265667/Screen_Shot_2022_02_23_at_11.00.46_AM.png",
  "description": "The bookmarking app Pocket has several alternatives.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}