{
  "title": "Scientists create algae computer powered by photosynthesis",
  "url": "https://www.theverge.com/2022/5/16/23074715/algae-computer-chip-photosynthesis-arm-cortext-iot-biophotovoltaics",
  "date": "2022-05-16T14:42:13.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CfAia0uscWyqYfL9-G3f6mApPJY=/119x0:767x432/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70874360/al_anode_mini_device_credit_p_bombelli_580x288px.0.jpeg\" />        <figcaption><em>The colony of algae was enclosed in a unit the size of an AA battery. </em> | Image: <a class=\"ql-link\" href=\"https://www.cam.ac.uk/research/news/scientists-create-reliable-biological-photovoltaic-cell-using-algae\" target=\"_blank\">Paolo Bombelli / Creative Commons</a></figcaption>    </figure>  <p id=\"HeCqBY\">Scientists have used algae to power a <a href=\"https://www.cam.ac.uk/research/news/scientists-create-reliable-biological-photovoltaic-cell-using-algae?\">low-energy computer chip</a> for six months. </p><p id=\"wNbOXy\">Researchers from the University of Cambridge sealed a colony of cyanobacteria, commonly known as blue-green algae, inside a metal enclosure the size of an AA battery. The unit was then left on a windowsill, according to <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.newscientist.com%2Farticle%2F2319584-computer-powered-by-colony-of-blue-green-algae-has-run-for-six-months%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F16%2F23074715%2Falgae-computer-chip-photosynthesis-arm-cortext-iot-biophotovoltaics\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><em>New Scientist</em></a><em>, </em>where the algae photosynthesized, generating a tiny current of electricity that powered an ARM Cortex-M0+ chip. </p><p id=\"zfIiDT\">The system is only a proof of concept, but its creators hope algae-powered chips could be used in future Internet of Things devices. They say the advantage of using algae over traditional batteries or solar power is that it has a smaller environmental impact and could potentially provide continuous power. </p><div class=\"c-float-right\"><aside id=\"qD8iIG\"><q>“Our photosynthetic device doesn’t run down the way a battery does”</q></aside></div><p id=\"zv6hUx\">“The growing Internet of Things needs an increasing amount of power, and we think this will have to come from systems that can generate energy, rather than simply store it like batteries,” Professor Christopher Howe, joint senior author of the paper, said in a <a href=\"https://www.cam.ac.uk/research/news/scientists-create-reliable-biological-photovoltaic-cell-using-algae\">press statement</a>. “Our photosynthetic device doesn’t run down the way a battery does because it’s continually using light as the energy source.”</p><p id=\"WIFOu7\">The algae-powered ARM chip was used to carry out very basic calculations, during which it consumed a tiny 0.3 microwatts an hour, reports <em>New Scientist</em>. Although the energy usage of normal computers varies based on factors like workload and age, this is a sliver of the electricity needed to run an average PC. If a normal desktop computer consumes, say, 100 watts of power an hour, you would need roughly 333,000,000 algae “batteries” to run it. </p><div class=\"c-float-right\"><aside id=\"cteRuH\"><q>The algae system produced an extremely small amount of power</q></aside></div><p id=\"Wv17RI\">The researchers behind the project will obviously need to scale up their solution, but they say the basic attributions of algae power generation are heartening. The algae they used did not need feeding, they say, gathering all its energy needs from natural sunlight, and was able to continue producing power at nighttime based on energy stored during the day. </p><p id=\"tcvulQ\">“We were impressed by how consistently the system worked over a long period of time — we thought it might stop after a few weeks but it just kept going,” Dr. Paolo Bombelli, the first author of the paper, said in a press statement. </p><p id=\"nNkUvq\">Although using algae in this way is definitely unusual, it’s also part of a growing area of research known as “<a href=\"https://www.stem.org.uk/system/files/elibrary-resources/legacy_files_migrated/9579-catalyst_21_4_487.pdf\">biophotovoltaics</a>.” The aim of the field is to harness the power generated by biological microorganisms that naturally convert light into electricity through photosynthesis.</p><p id=\"ZqDj8r\">Although this process is extremely inefficient, with plants absorbing only 0.25 percent of the energy of sunlight (compared to 20 percent absorbed in solar panels), advocates say biophotovoltaic energy systems could be cheap to produce and environmentally friendly. They imagine that, in the future, giant “lily-pads” that float on water could be coated in algae to act as mobile power stations alongside offshore wind farms. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MvNvuZfYs_sRFS5MXKvYt34o3Bs=/31x0:856x432/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23470924/al_anode_mini_device_credit_p_bombelli_580x288px.jpeg",
  "description": "Before you ask: it won’t run Doom, let alone Crysis",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}