{
  "title": "Scuf’s Reflex Pro is a sleek, but costly DualSense upgrade",
  "url": "https://www.theverge.com/22981354/scuf-reflex-pro-ps5-pc-dualsense-controller-review-specs-remapping",
  "date": "2022-03-17T18:00:00.000Z",
  "author": "Cameron Faulkner",
  "content": "  <p>It costs as much as three DualSense controllers, and you can’t remap rear triggers to its paddles</p> <p id=\"Z2aHww\">The PS5’s DualSense is one of the <a href=\"https://www.theverge.com/2021/3/31/22360812/ps5-adaptive-triggers-dualsense-button-next-gen-immersion\">most feature-packed controllers</a> ever made. And at $69.99 (or <a href=\"https://www.theverge.com/22878067/sony-dualsense-controller-color-purple-blue-pink-hands-on\">slightly more for bolder colors</a>) it’s expensive enough as is if you need to buy another one. Nevertheless, peripheral brand Scuf has packed even more into its Reflex lineup of controllers, in turn ballooning its cost. </p><p id=\"q4H4TO\">It <em>starts </em>at $199.99 — half the cost of a digital edition PS5. And the cost goes up with the $229.99 Reflex Pro (the model I tested, which costs more than three DualSense controllers) and the $259.99 Reflex FPS. The Reflex FPS lacks both haptics and adaptive triggers in favor of Scuf’s more clicky “instant triggers,” but that’s apparently what pro gamers want: fewer features and a higher cost.</p><p id=\"HRi8Ak\">The Reflex and Reflex Pro controllers have the same features as Sony’s controller, adaptive triggers, touchpad, advanced haptics, headphone jack, rechargeable battery, and all. It even has similar system integration; your PS5 can deliver updates to it as it would to Sony’s Dualsense. But Scuf has taken liberties with some design and functionality choices (some of which were done to create opportunities for you to spend <em>even more</em> money). </p><div id=\"0YhHRh\"><div data-anthem-component=\"scorecard:11100079\"></div></div><p id=\"oOihgi\">The biggest draw (and, perhaps, the most divisive quality) of all three Reflex variations is the rear-mounted paddles. Each one has a non-removable module on its back with four paddles stemming from it. These can be mapped to execute almost any function on the controller, aside from duplicating the home, options, or create functions. The Reflex also cannot remap the rear triggers, which <a href=\"https://customercare.scufgaming.com/hc/en-us/articles/4415736963725-Which-functions-can-be-remapped-to-SCUF-Reflex-s-paddles-\">Scuf doesn’t acknowledge in its online FAQ</a>. However, the <a href=\"https://customercare.scufgaming.com/hc/en-us/articles/4415763574413-SCUF-Reflex-Manual\">controller’s instruction manual</a> accurately lists what functions can be remapped. </p><p id=\"NguqGA\">Here’s the statement that Scuf spokesperson Lexie Harkness provided to <em>The Verge</em> as to why it opted to not include this function: </p><blockquote><p id=\"A1R7GT\">“The internal structure of the DualSense controller is very unique, and the adaptive triggers represent technical limitations for other components. Since the L2 and R2 triggers are in a relatively accessible location already, we decided to prioritize other functionalities which give the user more options for harder to access areas.”</p></blockquote><p id=\"93hQQ5\">I can take not being able to remap some of the controller’s key OS-level functions, but lacking trigger remapping to the paddles is a major blow to the value proposition of this pricey product — not to mention to Scuf’s key audience that wants a no-compromise controller. Also, the triggers may be “relatively accessible” for many people, but it doesn’t help folks who may require more accessibility to play games. <a href=\"https://www.theverge.com/2021/8/17/22627413/scuf-instinct-pro-microsoft-xbox-controller-wireless-series-x-s-one-pc-features-price\">Scuf’s Instinct lineup of Xbox wireless controllers has the same limitation.</a></p><p id=\"UvXpWT\">It’s worth mentioning that, with the PS5, Sony’s DualSense supports custom button assignments, letting you remap any function (triggers included) to any of the face buttons. Like Scuf’s controller, this excludes the home, options, or create buttons.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Scuf Reflex Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-fWA7b3lCW56k5UFYhQwZBxro_g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320992/cfaulkner_141231_5086_0004.jpg\">      <figcaption><em>The grip is what separates the $199 Reflex and this $229 Reflex Pro.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Scuf Reflex Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3xhGNbLCNF-aUCE1Y6onZEi9qB4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320989/cfaulkner_141231_5086_0002.jpg\">      <figcaption><em>Each rear paddle can be yanked out, in case you only want a couple.</em></figcaption>  </figure></div></div></div><p id=\"ES3cQm\">The Reflex Pro is still a very good controller, if you’re able to overlook that flaw. And as for what it <em>can </em>remap, the function works as intended. You can toggle between three saved profiles with a rear backlit button, letting you switch between a few custom control schemes. <a href=\"https://www.theverge.com/2021/8/17/22627413/scuf-instinct-pro-microsoft-xbox-controller-wireless-series-x-s-one-pc-features-price\">Unlike the Xbox-specific Instinct controller that Scuf makes</a>, the Reflex’s paddles can be yanked out one-by-one, if you prefer fewer of them, or just to have them on one side of the controller instead of both.</p><p id=\"hseHBr\">Your interest may vary with customizing controls, but it can make it easier to execute certain controller functions that typically require more of a reach. I remapped the “look behind” function in <em>Gran Turismo 7</em> to a rear paddle, which was more intuitive to me than the default L1 button mapping. In <em>Elden Ring</em>, I changed toggling through equipment from the directional pad to one of these paddles. That saves me from awkwardly reaching over to the directional pad, which is a particular nuisance during battle. </p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Scuf Reflex Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kP5YRJ3O_E_aD6mdJL2XBAg_ucg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320995/cfaulkner_141231_5086_0007.jpg\">      <figcaption><em>It’s easy enough to remove the plate, along with the sticks.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Scuf Reflex Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZQ5y9psiCwdOm346I3WoCcotAtM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320994/cfaulkner_141231_5086_0006.jpg\">      <figcaption><em>The Reflex Pro includes a couple of sticks with different heights.</em></figcaption>  </figure></div></div></div><p id=\"h5EL2m\">As for other changes that Scuf made to the DualSense, the company removed the labeling from the face buttons, giving the Reflex a more sophisticated look than the DualSense — assuming that you’re already intimately familiar with Sony’s traditional layout. The other changes are generally positive, except for the home button. In place of the PlayStation logo that rises slightly out of the DualSense, there’s a slightly more awkward to press button here. It might feel fine to some people, but I occasionally failed to press it, which isn’t a problem that I have with the DualSense. </p><p id=\"tGclko\">You can get a Reflex in some other colors than what Sony currently offers for its DualSense. The general color of the controller (which has a soft-touch coating) can’t be changed after the purchase, but the frame that surrounds the joysticks can be removed. By removing that frame, which locks seamlessly into footholds at the bottom of the Reflex’s grips, you can swap out the joysticks themselves, too, along with the colored rings that surround them. Along with your purchase, Scuf includes a few swappable joysticks of different heights, and with convex or concave surfaces, to accommodate different play styles. The company says you’ll someday be able to purchase more sticks and their surrounding rings in different colors.</p><p id=\"9TymA6\">Despite these changes, the Reflex feels identical to a DualSense when you’re focused on the game and not the controller. Yet, my favorite change here is the patterned rubber grips added to the Reflex Pro and FPS (but not the standard model). This makes it feel like the definitive PS5 controller. It fits more snugly in my hands during more intense play sessions, as well as making it less prone to sliding around on my coffee table between gaming sessions.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Scuf Reflex Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vYXJV3Qh7RWPoz432WtVT--oHfI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320993/cfaulkner_141231_5086_0005.jpg\">      <figcaption><em>The unlabeled buttons look awesome, but aren’t welcoming to new PlayStation players.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Scuf Reflex Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oju6Hg96NJHrFWivE1reqXPSuB4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320988/cfaulkner_141231_5086_0001.jpg\">      <figcaption><em>Thanks to its grips, it won’t fall over in this precarious position.</em></figcaption>  </figure></div></div></div><p id=\"jcdULS\">Having paddles on a controller isn’t for everyone, but it’s one of those things you may not be able to live without after you’re accustomed to it. And for people who have never bought a controller like this, you may only realize what your preference is by trying it out. It’d be easier to recommend that more people give it a try, if only the $199.99 starting price for Scuf’s Reflex wasn’t so high. And unfortunately, with practically no wireless alternatives to the DualSense currently available, Scuf charges more for these extra features than they’re worth.</p><p id=\"OHEOAD\">Scuf knows how to make already-good controllers a little better. But these prices only serve to keep most players from being able to experience them. In the absence of other equally customizable options, I still can’t recommend this to most people. I’ll just sit here, crossing my fingers, and hoping that Sony will eventually make a PS5 version of <a href=\"https://www.theverge.com/21571413/sony-dualshock-4-back-button-attachment-ps4-ps5-controller-playstation\">its Back Button Attachment</a>, or an even more premium wireless controller of its own that costs less than this one.</p><p id=\"TPGOK2\"><em>Photography by Cameron Faulkner / The Verge</em></p><p id=\"B9g8e3\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/zqoC0p-J4J5ptfu6DvaJIgoTVLA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320991/cfaulkner_141231_5086_0003.jpg",
  "description": "It’s the cost of three DualSenses, yet still compromised",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}