{
  "title": "Seawalls alone won’t save coastal cities, major UN report says",
  "url": "https://www.theverge.com/2022/2/28/22953552/sea-walls-coastal-cities-climate-change-adaptation-united-nations-report",
  "date": "2022-02-28T11:00:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"General Views From Torres Strait Islands\" src=\"https://cdn.vox-cdn.com/thumbor/RRZejtPXJWK5yft4haCh0Nu5j7s=/0x1:6783x4523/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70559115/1309339999.0.jpg\" />        <figcaption>6: A general view of Dauan Island&nbsp;on March 26, 2021 in Dauan Island, Australia.&nbsp;As sea levels continue to rise, tides have become more destructive and coastal erosion is occurring at a faster rate. New seawalls are being built in different projects around the islands in an effort to hold back rising sea levels. | Photo by Brook Mitchell/Getty Images</figcaption>    </figure>  <p id=\"CwrlkU\">Relying solely on seawalls and other engineering fixes won’t be enough to keep communities safe from rising sea levels or other consequences of climate change, a major new United Nations <a href=\"https://www.ipcc.ch/report/ar6/wg2/\">report</a> warns. Seawalls might be able to temporarily fend off rising tides and storm surges, but the report’s authors say more “transformative changes in our behaviour and infrastructure” are needed as the climate crisis worsens.</p><p id=\"qxIqQg\">Greener cities and healthy ecosystems are just as important as built infrastructure for keeping people safe, the report emphasized. And urban planners might need to give up developing some of the most vulnerable coastal areas, or risk building in places that’ll be inundated with water in the future. </p><div class=\"c-float-right\"><aside id=\"t8dDVN\"><q>Greener cities and healthy ecosystems are just as important as built infrastructure </q></aside></div><p id=\"IPK5zP\">The report, authored by hundreds of experts from 67 countries, also synthesizes what the vast body of research tells us about how the climate crisis affects society as we know it — and what humans will likely have to do to adapt. Deadly heat stress could affect up to 76 percent of humanity by the end of the century, the report says. Up to 3 billion people around the world (nearly 40 percent of the current global population) could face chronic water scarcity if world leaders fail to meet the goals of the Paris climate accord. </p><p id=\"RxuPbB\">But in many places, too much seawater is the problem. More than a billion people living in low-lying coastal areas around the world will be exposed to climate-related risks like frequent flooding or even permanent inundation by the middle of the century — which could force many to move to higher ground. </p><p id=\"8ONWMT\">The report finds that communities around the world haven’t done nearly enough to prepare for climate change, so they’ll have to take action urgently to avoid unnecessary pain. Sometimes, building up physical defenses like seawalls are needed to protect a community, the report acknowledges. But seawalls are not a one size fits all solution, and they’re not always the best choice.</p><p id=\"uLNSWx\">That makes them an excellent example of what report authors call “maladaptation” — strategies that are supposed to help people cope with dramatic changes, but wind up having unintended negative consequences. Seawalls might do a good job at protecting a small area of a coastline, but harm neighboring coral reefs, which serve as <a href=\"https://oceanservice.noaa.gov/facts/coral_protect.html\">natural barriers</a> that protect shorelines from swells during big storms. Seawalls can even escalate risks in the long run by encouraging more residents to settle in a place that’s more perilous than they think.</p><p id=\"Ouxu1j\">There are other solutions that are often overlooked. In a lot of cases,<strong> </strong>“Reestablishing wetlands is cheaper and more effective and more resilient to coming climate change than are hard barriers,” report co-author Camille Parmesan said in a press call. Wetlands are like <a href=\"https://www.epa.gov/wetlands/why-are-wetlands-important#:~:text=wetlands%20were%20destroyed.-,Flood%20Protection,more%20slowly%20over%20the%20floodplain.\">natural sponges</a> that can make flooding less severe and prevent erosion. But these kinds of nature-based solutions, across the globe, have received less funding than concrete infrastructure projects, the report notes.</p><div class=\"c-float-left\"><aside id=\"BzJN0v\"><q>“What this looks like is that people are going to not be able to adapt”</q></aside></div><p id=\"3oM1Lt\">Without cutting down planet-heating pollution, some places are already expected to be beyond saving. “What this looks like is that people are going to not be able to adapt,” report co-author Adelle Thomas said in the press call. “For coastal communities, things like sea walls ... putting in sand dunes or relying on ecosystem-based adaptation like restoring coral reefs or wetlands will no longer be financially feasible, or may no longer be technically feasible.” </p><p id=\"9xeNDX\">Some <a href=\"https://isledejeancharles.la.gov/\">coastal communities</a> have picked up and left or are preparing for their homes to become a real-life Atlantis. And while the report is clear that climate change affects people and infrastructure everywhere, some places struggle more than others. “People and ecosystems least able to cope are being hardest hit,” a press release for the report says. And “Finance has tended to favour the wealthiest rather than the poorest,” an accompanying fact sheet says.</p><p id=\"banTHH\">The newly released report is a second in a series by the United Nations Intergovernmental Panel on Climate Change. The first piece came out last year, which detailed how <a href=\"https://www.theverge.com/2021/8/9/22613531/climate-change-united-nations-report-extreme-weather-ipcc\">climate change is supercharging extreme weather</a> and causing other devastating changes to the planet. The third in the series is expected next month, and will focus on solutions for slowing down global warming.  </p><p id=\"GQz1WW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/q3ODDTWd12KtoGZRUDFeTJcD5R8=/0x487:6783x4038/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23275854/1309339999.jpg",
  "description": "They’ll also need help from wetlands and coral reefs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}