{
  "title": "SEC asks companies to divulge pollution and climate risks",
  "url": "https://www.theverge.com/2022/3/21/22988921/sec-companies-greenhouse-gas-pollution-climate-change-risks-divulge",
  "date": "2022-03-21T18:22:03.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"SEC Chair Gensler Testifies Before Senate Banking Committee\" src=\"https://cdn.vox-cdn.com/thumbor/9nArIgIm_E9KWbMexP0UXY4wrM8=/0x3:5037x3361/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70653107/1235252261.0.jpg\" />        <figcaption>Gary Gensler, Chair of the U.S. Securities and Exchange Commission, testifies before a Senate Banking, Housing, and Urban Affairs Committee oversight hearing on the SEC on September 14, 2021 in Washington, DC. | Photo by Evelyn Hockstein-Pool/Getty Images</figcaption>    </figure>  <p id=\"4MD9Hf\">The US Securities and Exchange Commission <a href=\"https://www.sec.gov/news/press-release/2022-46\">proposed new rules today</a> that could require companies to update investors annually on how much planet-heating pollution they’re pumping out and how that pollution could ultimately affect their earnings.</p><p id=\"ArBsAf\">A slew of companies from <a href=\"https://www.theverge.com/2020/7/21/21332461/apple-carbon-neutral-2030-climate-change\">Apple</a> to <a href=\"https://www.theverge.com/2019/9/19/20873834/amazon-sustainability-jeff-bezos-climate-change-pledge-emissions-paris-accord\">Amazon</a> have pledged to become carbon neutral in coming decades. Consistent updates on how much pollution they generate help ensure that climate pledges aren’t just greenwashing or making false promises. The proposed rules are also supposed to protect investors as companies cope<strong> </strong>with disasters linked to climate change, like <a href=\"https://www.theverge.com/2021/8/9/22613531/climate-change-united-nations-report-extreme-weather-ipcc\">more extreme weather</a>.</p><p id=\"rt6R31\">“We are concerned that the existing disclosures of climate-related risks do not provide investors with the detailed and reliable climate-related information they need to make informed investments and voting decisions,” Renee Jones, director of the SEC’s Division of Corporation Finance, said during an SEC <a href=\"https://www.sec.gov/news/upcoming-events/open-meeting-032122\">open meeting</a> today.</p><div class=\"c-float-right\"><aside id=\"wQPmN7\"><q>“We are concerned that the existing disclosures of climate related risks do not provide investors with the detailed and reliable climate related information”</q></aside></div><p id=\"vXUx46\">If the rules go into effect, public companies would need to share greenhouse gas emissions from their operations and electricity use. The SEC also sought to hold some<strong> </strong>companies responsible for indirect emissions that come from their supply chains and consumers using their products, a more contentious disclosure. Some companies have excluded these indirect emissions from climate pledges, arguing that this pollution is out of their control. The SEC said today that smaller companies won’t have to disclose those indirect emissions, and larger companies only need to share the indirect emissions that are “material” or essential for investors’ understanding of a company’s financial situation — a murky distinction. </p><p id=\"4wzsuR\">About one-third of companies already disclose at least some of their emissions or climate risks in annual reports, according to the SEC. But without federal standards for greenhouse gas emissions reporting, it’s difficult for investors to compare companies’ environmental impacts with each other. For example, two companies might claim to be carbon neutral — but one company might include<strong> </strong>indirect emissions (which often amount to the biggest chunk of a company’s pollution), while the other doesn’t. </p><p id=\"DB13QI\">The SEC also called on public companies to be more transparent about how they plan to reach their climate goals. Carbon neutrality, for example, can be achieved by reducing pollution or by offsetting emissions through efforts like <a href=\"https://www.theverge.com/2020/1/31/21115862/davos-1-trillion-trees-controversy-world-economic-forum-campaign\">planting trees</a> to draw down carbon dioxide. But offset schemes have often <a href=\"https://features.propublica.org/brazil-carbon-offsets/inconvenient-truth-carbon-credits-dont-work-deforestation-redd-acre-cambodia/\">failed</a> to result in meaningful greenhouse gas reductions. And some companies, <a href=\"https://www.theverge.com/2020/6/23/21300427/amazon-climate-change-commitments-greenhouse-gas-emissions-jeff-bezos\">including Amazon</a>, have actually seen their emissions grow since pledging to reach net-zero emissions. </p><p id=\"szE37x\">The new rules also require public companies to acknowledge how their operations could change in a warming world, including how climate change might have an impact on business already. Some companies are already starting to do this. <a href=\"https://www.theverge.com/2021/4/19/22392621/oatly-climate-change-monoculture-risk-factors-ipo\">Oatly</a>, for one, said in documents it filed to the SEC upon going public that climate change could endanger crops it relies on. Investor demand for climate disclosures has grown “dramatically,” <a href=\"https://www.sec.gov/news/public-statement/lee-climate-change-disclosures\">according to the SEC</a>, since 2010, when the commission issued initial <a href=\"https://www.sec.gov/rules/interp/2010/33-9106.pdf\">guidance</a> on how climate change related to existing disclosure requirements.</p><p id=\"FKmxt5\">The stricter guidelines proposed today by the SEC still need to be finalized after a public comment period. The rules are likely to face legal challenges, and there’s also pushback within the commission. “This proposal steps outside or statutory limits by using the disclosure framework to achieve objectives that are not ours to pursue,” Trump-appointed Commissioner Hester Peirce said during the SEC’s meeting today. “Many calls for enhanced climate disclosure are motivated not by an interest in financial returns, but by deep concerns about the climate or sometimes superficial concerns to garner goodwill,” she said. Peirce was the only commissioner, out of four, to oppose the proposal today.</p><p id=\"fLHHMU\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AssJfREelqYsCWtvqWJQ5uTTJPI=/0x364:5037x3001/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23334317/1235252261.jpg",
  "description": "Climate change could be taking a toll on profits already.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}