{
  "title": "SEC nearly doubles crypto enforcement unit, citing fraud risk in booming market",
  "url": "https://www.theverge.com/2022/5/3/23055499/sec-nearly-doubles-cryptocurrency-enforcement-unit",
  "date": "2022-05-03T18:24:22.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"sec4\" src=\"https://cdn.vox-cdn.com/thumbor/MOLhqX-GBRjv2oVsnQ76UhG9GbQ=/0x0:1020x680/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70828046/sec4.1419978993.0.jpg\" />    </figure>  <p id=\"Pg8QbN\">The US Securities and Exchange Commission (SEC) announced Tuesday that it will close to double its cryptocurrency enforcement division, adding another 20 positions to the Crypto Assets and Cyber Unit — which has been newly renamed from the “Cyber Unit.” The total number of staff will rise from 30 to 50, increasing the agency’s ability to prosecute securities law violations related to new crypto products.</p><p id=\"KcdpPj\">In a <a href=\"https://www.sec.gov/news/press-release/2022-78\">press release</a>, the SEC cited a booming period for crypto markets and a corresponding responsibility to keep investors safe from the growing risk of fraudulent investment schemes.</p><p id=\"Nn1sMI\">“Crypto markets have exploded in recent years, with retail investors bearing the brunt of abuses in this space. Meanwhile, cyber-related threats continue to pose existential risks to our financial markets and participants,” said Gurbir S. Grewal, director of the SEC’s Division of Enforcement. “The bolstered Crypto Assets and Cyber Unit will be at the forefront of protecting investors and ensuring fair and orderly markets in the face of these critical challenges,” Grewal said.</p><p id=\"zKxGLA\">As cryptocurrency has become more available to retail investors, fraud and abuse have kept pace. One prominent type of scam is known as a rug pull, where the operators of a project solicit investment, promise big returns, and simply abscond with the money — as happened recently with a <a href=\"https://www.theverge.com/2022/3/24/22995107/us-arrest-charges-crypto-nft-rug-pull-frosties-ethan-nguyen-andre-llacuna\">collection of 3D avatars called Frosties</a> and a <a href=\"https://www.cbsnews.com/news/squid-game-cryptocurrency-rug-pull-scam/\">crypto token inspired by the Netflix hit show <em>Squid Game</em></a>.</p><p id=\"wvFVoB\">In its announcement, the SEC expressed particular interest in crimes connected to staking and lending platforms, decentralized finance (DeFi) services, stablecoins, and NFTs. The newly created staff positions would include investigative attorneys, trial counsels, and fraud analysts, the SEC said.</p><p id=\"jyrVe2\">“The Division of Enforcement’s Crypto Assets and Cyber Unit has successfully brought dozens of cases against those seeking to take advantage of investors in crypto markets,” said SEC chair Gary Gensler in a statement. “By nearly doubling the size of this key unit, the SEC will be better equipped to police wrongdoing in the crypto markets while continuing to identify disclosure and controls issues with respect to cybersecurity.”</p><p id=\"n94xaZ\">Since taking up the position of SEC chair in 2021, Gensler has frequently highlighted a need for more power and resources in regulating cryptocurrency. In August 2021, he <a href=\"https://www.theverge.com/2021/8/3/22608096/cryptocurrency-bitcoin-sec-gary-gensler-regulation\">described the industry as being the “Wild West</a>” in terms of investor protection, calling on Congress to expand the agency’s authority to regulate trading and lending platforms. Soon after, the SEC <a href=\"https://www.theverge.com/2021/8/6/22613195/sec-cryptocurrency-blockchain-gensler-charge-illegal-fraud-tokens\">brought its first-ever charges against a DeFi platform</a>, accusing the operators of the Cayman Islands-based Blockchain Credit Partners of unregistered sales of more than $30 million in securities.</p><p id=\"meCQuh\">While the expansion of the crypto enforcement team is a boon for Gensler, it’s unclear whether it will be enough to meet the full range of the agency’s ambitions in the field. Previously, Gensler highlighted the huge number of newly launched products and services that could fall under the SEC’s remit, citing <a href=\"https://www.cnbc.com/2021/09/14/cryptocurrency-regulation-sec-chair-gary-gensler-grilled-by-senators.html\">6,000 new projects in need of evaluation</a> to determine whether they qualify as securities under US law.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7ItQo3tfixdnnFKpzj1zVOXscio=/0x73:1020x607/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14125704/sec4.1419978993.jpg",
  "description": "New chair Gary Gensler described crypto investment as a \"Wild West.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}