{
  "title": "Second Apple Store gets a union election date",
  "url": "https://www.theverge.com/2022/5/4/23056187/apple-second-store-union-election-petition-retail",
  "date": "2022-05-20T15:45:15.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yo_biJ0WDyM8Z9MrWTTgFLeRFj8=/227x0:2645x1612/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70831802/R063.0.jpeg\" />        <figcaption><em>Employees at Apple’s Towson Town Center may soon be voting on whether to unionize.</em> | Image: Apple</figcaption>    </figure>  <p id=\"gDuKWZ\">Employees at Apple’s Towson Town Center store in Maryland will begin their union election on June 15th, after filing a request with the National Labor Relations Board (NLRB) earlier this month. The store is the second to schedule an election. In April, employees from an Apple Store in Atlanta <a href=\"https://www.theverge.com/2022/4/20/23034175/apple-store-workers-atlanta-union-retail-amazon-google\">filed their own petition to hold a union election</a>, which Apple <a href=\"https://www.theverge.com/2022/5/3/23055452/apple-retail-store-atlanta-union-vote-date-set-june-cwa\">recently agreed to</a>. That vote is set to start on June 2nd.</p><p id=\"Anz8Dw\">The election in Maryland will take place over four days, and voting will be in-person.</p><p id=\"gxCoLk\">On May 3rd, organizers at the store announced their intentions to unionize with the IAMAW. The group of employees calls itself AppleCORE, with CORE standing for Coalition of Organized Retail Employees. According to <a href=\"https://www.washingtonpost.com/technology/2022/05/03/apple-retail-towson-union-labor-machinists/\">a report from <em>The Washington Post</em></a>, they want to have a greater say in decisions about their pay, hours, and the coronavirus safety measures at their store.</p><div class=\"c-float-right\"><aside id=\"Zw5cKg\"><q>The first formal step in the process</q></aside></div><p id=\"W6MIF0\">In <a href=\"https://www.goiam.org/dear-tim/\">a letter to Tim Cook</a>, the group said that it had support from “a solid majority” of the workers at the store. The NLRB requires that at least 30 percent of employees support a union election before it tries to negotiate terms for the vote between the company and employees. (If the two parties, in this case, Apple and AppleCORE, don’t agree, the regulator will hold a hearing.) </p><p id=\"gcXeBu\">It’s likely the employees at Towson Town Center won’t be the last to file for a union election. Last month, employees at Apple’s Grand Central Terminal store in New York <a href=\"https://www.theverge.com/2022/4/16/23028356/apple-store-workers-grand-central-terminal-new-york-union-signatures\">began collecting signatures</a> they can use to show interest in a vote to the NLRB. </p><p id=\"QbNQA3\"><em><strong>Update May 20th, 11:45AM ET:</strong></em><em> Added the date for the election.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5t2FKeQ9Vtm-TPONrZqKrPlU-FA=/0x104:2880x1612/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23436618/R063.png",
  "description": "Apple workers may be holding another vote.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}