{
  "title": "Secret Republican group budgets millions for media and influencer programs",
  "url": "https://www.theverge.com/2022/4/7/23015307/rockbridge-network-peter-thiel-donald-trump-influencers-turning-point-usa",
  "date": "2022-04-07T19:05:37.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"Peter Thiel Visits “FOX &amp;amp; Friends”\" src=\"https://cdn.vox-cdn.com/thumbor/8uCrZZu2zAMd1AnCSOD6wq-hCHc=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70722855/1167013929.0.jpg\" />        <figcaption>Photo by John Lamparski/Getty Images</figcaption>    </figure>  <p id=\"fwA8s3\">There’s a new group of affluent conservatives planning to revamp the American right by investing more than $30 million into new legal, policy, and media ventures, including “influencer programs,” according to <a href=\"https://www.nytimes.com/2022/04/06/us/politics/republican-donors-rockbridge-network-trump.html?unlocked_article_code=AAAAAAAAAAAAAAAACEIPuonUktbfqYhkTFUbBSbIRp8_qRmHmfnE2_smi2fjJiyUQj9EiugSBY-a4ALXYqFgbcEy0zuWAdlMLKAoXv830vVCOlQrSxWtptHMvqU5FBgPiND5WHIqjdWKVKok8DTuYy61Iu0kmrPi4FeKOzTrRKCLhic-LV1uqI9gcV2g0CEDxPjHGuFly5Ipi6dac5N8QjcAYyOJueC5SEktfYXbMWyPr1U-SOpbWjrMnNOD6rxmcAtaC17OTXIX8n9roZoHe4tRZPCjWkZmLMnugrwRCXhqKZOpB_AyQYvVk7Zoud3duBobFbMkbNa-hHjLZez-VkQ&amp;referringSource=articleShare\">a recent report from <em>The New York Times</em></a>. </p><p id=\"HExniS\">The coalition, known as The Rockbridge Network, features prominent conservative billionaires like Peter Thiel and Rebekah Mercer. The network aims to “disrupt but advance the Republican agenda” with its new policy and media programs. According to a network brochure obtained by the<em> Times</em>, “The Rockbridge Network will replace the current Republican ecosystem” of activist and media organizations with “better action-oriented, more effective people and institutions.”</p><div class=\"c-float-right\"><aside id=\"QXan77\"><q>The brochure doesn’t reveal the details of these new media ventures</q></aside></div><p id=\"cvb7JK\">The brochure doesn’t reveal the details of these new media ventures but sets a working budget of $8 million for 2021. Named initiatives include “public relations and messaging, a rapid response communications team for conservative activists and leaders, funding of polling, sponsorship of area-specific coverage and influencer programs, investigative journalism, documentaries, and other projects for cultural influence and renewal.”</p><p id=\"cDPGmK\">Rockbridge Network members met at former President Donald Trump’s Mar-a-Lago club this week for private meetings and a closed-door address from Trump himself, the<em> Times </em>reported. The meeting comes as Republicans are pulling together their strategies ahead of the 2022 midterm elections. </p><p id=\"3coaz7\">The brochure’s focus on “influencer programs” follows a year of massive spending from the Trump wing of the Republican Party on similar initiatives. Last December alone, Trump’s “Make America Great Again PAC” <a href=\"https://docquery.fec.gov/cgi-bin/fecimg/?202201319486183802\">paid over $50,000</a> to the influencer marketing firm Legendary Campaigns, according to FEC records. Additionally, the National Republican Senatorial Committee <a href=\"https://docquery.fec.gov/cgi-bin/fecimg/?202203209494066968\">paid the firm a similar amount</a> for “advertising.”</p><p id=\"mhyQV2\">Trump’s team has previously enlisted Legendary Campaigns, a “partner organization” for Urban Legend Co., for online advertising. The company, run by former Trump White House Digital Officer Ory Rinat, reportedly pays popular conservative influencers “fees in exchange for driving engagement  — such as email signups, donations, and purchases — for the firm’s clients,” <a href=\"https://www.axios.com/trump-campaign-social-media-influencer-firm-9f646905-ae17-4e5e-8036-9ffcffabfe58.html\"><em>Axios </em>reported last year</a>.</p><p id=\"z69MYs\">During the 2020 election cycle, platforms like Facebook, Google, and Twitter dramatically changed the ways political campaigns could advertise on their platforms. <a href=\"https://www.theverge.com/2019/10/30/20940587/twitter-political-ad-ban-election-2020-jack-dorsey-facebook\">Twitter banned political ads outright</a>, while Facebook and Google began requiring significantly more detailed disclosures from political buyers. This prompted new money flowing into firms like Legendary Campaigns for advertising partnerships with content creators. </p><p id=\"vRlhIP\">In December, <a href=\"https://www.theverge.com/2022/1/5/22868483/turning-point-charlie-kirk-republican-influencers-instagram-today-is-america\"><em>The Verge </em>detailed the conservative college group</a> Turning Point USA’s latest efforts to onboard influencers into the movement. At the time, TPUSA touted more than 400 “ambassadors,” and its 2021 investor prospectus budgeted more than<a href=\"https://www.documentcloud.org/documents/21091980-turning-point-usa-2021-investor-prospectus\"> $7 million</a> for the organization’s media arm. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/e6TLfQqAtdr7CXoOn5NRq5nsjOk=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23374540/1167013929.jpg",
  "description": "The Rockbridge Network includes Peter Thiel",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}