{
  "title": "Security experts say new EU rules will damage WhatsApp encryption",
  "url": "https://www.theverge.com/2022/3/28/23000148/eu-dma-damage-whatsapp-encryption-privacy",
  "date": "2022-03-28T19:55:01.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BKyD1aMu8Zn6LXhGDhD1tB2cXHI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70682222/acastro_210119_1777_whatsapp_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"XesXKT\">On March 24th, EU governing bodies announced that they had <a href=\"https://www.theverge.com/2022/3/24/22994234/eu-antitrust-legislation-dma-digital-markets-act-details\">reached a deal</a> on the most sweeping legislation to target Big Tech in Europe, known as the Digital Markets Act (DMA). Seen as an ambitious law with far-reaching implications, the most eye-catching measure in the bill would require that every large tech company — defined as having a market capitalization of more than €75 billion or a user base of more than 45 million people in the EU — create products that are <a href=\"https://www.theverge.com/2022/3/24/22995431/european-union-digital-markets-act-imessage-whatsapp-interoperable\">interoperable with smaller platforms</a>. For messaging apps, that would mean letting end-to-end encrypted services like WhatsApp mingle with less secure protocols like SMS — which security experts worry will undermine hard-won gains in the field of message encryption.</p><p id=\"MiEd6b\">The main focus of the DMA is a class of large tech companies termed “gatekeepers,” defined by the size of their audience or revenue and, by extension, the structural power they are able to wield against smaller competitors. Through the new regulations, the government is hoping to “break open” some of the services provided by such companies to allow smaller businesses to compete. That could mean letting users <a href=\"https://www.theverge.com/2022/3/25/22996248/apple-sideloading-apps-store-third-party-eu-dma-requirement\">install third-party apps outside of the App Store</a>, letting outside sellers <a href=\"https://themarkup.org/amazons-advantage/2021/10/14/amazon-puts-its-own-brands-first-above-better-rated-products\">rank higher in Amazon searches</a>, or requiring messaging apps to send texts across multiple protocols.</p><div class=\"c-float-right\"><aside id=\"Q0fF69\"><q>The main focus of the DMA is a class of large tech companies termed “gatekeepers”</q></aside></div><p id=\"PxtjgU\">But this could pose a real problem for services promising end-to-end encryption: the consensus among cryptographers is that it will be difficult, if not impossible, to maintain encryption between apps, with potentially enormous implications for users. Signal is small enough that it wouldn’t be affected by the DMA provisions, but WhatsApp — which uses the Signal protocol and is owned by Meta — certainly would be. The result could be that some, if not all, of WhatsApp’s end-to-end messaging encryption is weakened or removed, robbing a billion users of the protections of private messaging.</p><p id=\"Jmlj6d\">Given the need for precise implementation of cryptographic standards, experts say that there’s no simple fix that can reconcile security and interoperability for encrypted messaging services. Effectively, there would be no way to fuse together different forms of encryption across apps with different design features, said Steven Bellovin, an acclaimed internet security researcher and professor of computer science at Columbia University.</p><p id=\"D8Ke4Y\">“Trying to reconcile two different cryptographic architectures simply can’t be done; one side or the other will have to make major changes,” Bellovin said. “A design that works only when both parties are online will look very different than one that works with stored messages .... How do you make those two systems interoperate?”</p><div class=\"c-float-left\"><aside id=\"2KHJVa\"><q>“Trying to reconcile two different cryptographic architectures simply can’t be done”</q></aside></div><p id=\"0wMrrL\">Making different messaging services compatible can lead to a lowest common denominator approach to design, Bellovin says, in which the unique features that made certain apps valuable to users are stripped back until a shared level of compatibility is reached. For example, if one app supports encrypted multi-party communication and another does not, maintaining communications between them would usually require that the encryption be dropped.</p><p id=\"kRlxyJ\">Alternatively, the DMA suggests another approach — equally unsatisfactory to privacy advocates — in which messages sent between two platforms with incompatible encryption schemes are decrypted and re-encrypted when passed between them, breaking the chain of “end-to-end” encryption and creating a point of vulnerability for interception by a bad actor.</p><p id=\"1ztOmC\">Alec Muffett, an internet security expert and former Facebook engineer who recently <a href=\"https://www.theverge.com/2022/3/8/22967843/twitter-tor-onion-service-version-launch\">helped Twitter launch an encrypted Tor service</a>, told <em>The Verge</em> that it would be a mistake to think that Apple, Google, Facebook, and other tech companies were making identical and interchangeable products that could easily be combined.</p><p id=\"5TSPiR\">“If you went into a McDonald’s and said, ‘In the interest of breaking corporate monopolies, I demand that you include a sushi platter from some other restaurant with my order,’ they would rightly just stare at you,” Muffett said. “What happens when the requested sushi arrives by courier at McDonald’s from the ostensibly requested sushi restaurant? Can and should McDonald’s serve that sushi to the customer? Was the courier legitimate? Was it prepared safely?”</p><p id=\"t2to32\">Currently, every messaging service takes responsibility for its own security — and Muffett and others have argued that by demanding interoperability, users of one service are exposed to vulnerabilities that may have been introduced by another. In the end, overall security is only as strong as the weakest link.</p><p id=\"wFkjA5\">Another point of concern raised by security experts is the problem of maintaining a coherent “namespace,” the set of identifiers that are used to designate different devices in any networked system. A basic principle of encryption is that messages are encoded in a way that is unique to a known cryptographic identity, so doing a good job of identity management is fundamental to maintaining security.</p><p id=\"KUEba2\">“How do you tell your phone who you want to talk to, and how does the phone find that person?” said Alex Stamos, director of the Stanford Internet Observatory and former chief security officer at Facebook. “There is no way to allow for end-to-end encryption without trusting every provider to handle the identity management... If the goal is for all of the messaging systems to treat each other’s users exactly the same, then this is a privacy and security nightmare.”</p><div class=\"c-float-right\"><aside id=\"Fzt6kY\"><q>“There is no way to allow for end-to-end encryption without trusting every provider to handle the identity management”</q></aside></div><p id=\"JU84nt\">Not all security experts have responded so negatively to the DMA. Some of the objections shared previously by Muffett and Stamos have been addressed in a <a href=\"https://matrix.org/blog/2022/03/25/interoperability-without-sacrificing-privacy-matrix-and-the-dma\">blog post</a> from Matrix, a project geared around the development of an open-source, secure communications standard.</p><p id=\"4JHR7I\">The post, written by Matrix co-founder Matthew Hodgson, acknowledges the challenges that come with mandated interoperability but argues that they are outweighed by benefits that will come from challenging the tech giants’ insistence on closed messaging ecosystems.</p><p id=\"cAwLHE\">“In the past, gatekeepers dismissed the effort of [interoperability] as not being worthwhile,” Hodgson told <em>The Verge</em>. “After all, the default course of action is to build a walled garden, and having built one, the temptation is to try to trap as many users as possible.”</p><p id=\"HUVw7I\">But with users generally happy to centralize trust and a social graph in one app, it’s unclear whether the top-down imposition of cross-platform messaging is mirrored by demand from below.</p><p id=\"XGZyqq\">“iMessage already has interop: it’s called SMS, and users really dislike it,” said Alex Stamos. “And it has really bad security properties that aren’t explained by green bubbles.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9ozwrIAv8iUCGS6ztVXQhPTaLV0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22245549/acastro_210119_1777_whatsapp_0001.jpg",
  "description": "Is this the end of end-to-end?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}