{
  "title": "Sega is reportedly working on big-budget reboots of Crazy Taxi and Jet Set Radio",
  "url": "https://www.theverge.com/2022/4/19/23031704/sega-crazy-taxi-jet-set-radio-reboots-planned",
  "date": "2022-04-19T11:25:34.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"Jet Set Radio Hd\" src=\"https://cdn.vox-cdn.com/thumbor/S_GCUAKDQ3iD1wheU3LNOYvcWH0=/43x0:846x535/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70765801/Jet_Set_Radio_Coming_To_PS_Vita___Gaming_News_and_Opinion_at_TheSixthAxis.com.0.jpg\" />        <figcaption><em>A screenshot from </em><a class=\"ql-link\" href=\"https://www.polygon.com/2013/1/24/3739980/jet-set-radio-hd-review-bad-reception\" target=\"_blank\">Jet Set Radio HD</a>. </figcaption>    </figure>  <p id=\"R6D8rO\">Sega has reportedly started work on big-budget reboots of two cult titles: <em>Crazy Taxi </em>and <em>Jet Set Radio</em>. According to a <a href=\"https://www.bloomberg.com/news/articles/2022-04-19/sega-reboots-crazy-taxi-jet-set-radio-to-chase-fortnite-riches?sref=ExbtjcSG\">report from <em>Bloomberg</em></a><em> </em>citing “people familiar with its plans,” the Japanese game giant wants to create new games that can become global hits like <em>Fortnite</em> and deliver recurring revenue.</p><p id=\"hwHPAL\"><em>Fortnite, </em>of course, has built its success on a number of attributes. It’s cross-platform, free-to-play, and generates money for publisher Epic Games through the use of cosmetic micro-transactions. <em>Bloomberg</em> doesn’t state that Sega is following this mold exactly, but it’s hard to know how you’d create a <em>Fornite-</em>like hit without ... replicating <em>Fornite</em>’s key traits. </p><div class=\"c-float-right\"><aside id=\"fhwW6q\"><q>Sega wants to reboot old games to boost flagging video game revenue</q></aside></div><p id=\"SBBq3l\">Vague hints of Sega’s plans in this department have been appearing for a while now. In the company’s <a href=\"https://www.segasammy.co.jp/english/ir/library/pdf/settlement/2021/20210513_4q_presentation_script_final_e.pdf\">annual earnings report</a> for the year ending March 2021, it named <em>Jet Set Radio</em> and <em>Crazy Taxi </em>as “examples of past IP” it wanted to utilize through reboots, remasters, and remakes. (Other games named included <em>Rez</em>, <em>Panzer Dragoon</em>, and <em>Streets of Rage</em>.) This same report discussed an internal “Super Game” initiative, which Sony exec Shuji Utsumi <a href=\"https://www.videogameschronicle.com/news/sega-says-its-super-game-plan-is-multiple-games-and-may-use-nfts/\">later explained</a> would mean building multi-platform AAA titles with global releases. (He also alluded vaguely to NFTs, but honestly I think executives just say this as a reflex right now.)</p><p id=\"9pOZAP\">Earlier this month, Utsumi said that several Super Game projects were currently underway, and <em>Bloomberg</em> is now saying these include <em>Crazy Taxi</em> and <em>Jet Set Radio</em>. The new <em>Crazy Taxi </em>game has been in development for a year, says <em>Bloomberg</em>, with a targeted release of 2024 to 2025. No such timeframe for <em>Jet Set Radio </em>is mentioned, and the publication stresses that “both new games are in the early stages of creation and could still be canceled.”</p><p id=\"pl75q9\">Things are still very much in development, then, but it’s tantalizing to imagine what Sega might do with these properties. Both titles arrived on Sega’s Dreamcast in 2000 (<em>Crazy Taxi</em> appeared in arcades the previous year) and gained cult followings for their stylish graphics and soundtracks. <em>Crazy Taxi</em> tasked players with delivering fares around a fictional San Francisco as quickly as possible, while Tokyo-based <em>Jet Set Radio</em> offered a number of game modes focused on inline skating and graffiti tagging. </p><p id=\"6kJkJE\">Both titles are much more focused on gameplay than story, but <em>Jet Set Radio</em>’s use of factions and competitions seems particularly well suited to the sort of mass-participation multiplayer that has helped make <em>Fortnite </em>so popular. And who knows, perhaps a reboot of <em>Crazy Taxi</em> will mean a <a href=\"https://youtu.be/MNHoWdid7ag\">new theme song</a> from <em>The Offspring</em>? That would certainly get the attention of anyone who played these titles on release.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/18OuAldVKNfzGW0ivayJW-fjs2k=/0x36:887x500/fit-in/1200x630/cdn.vox-cdn.com/assets/1139943/Jet_Set_Radio_Coming_To_PS_Vita___Gaming_News_and_Opinion_at_TheSixthAxis.com.jpg",
  "description": "New money for old IP",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}