{
  "title": "Segway’s Ninebot Engine Speaker adds engine noises to your electric ride",
  "url": "https://www.theverge.com/2022/4/14/23025585/segway-ninebot-engine-wireless-speaker-engine-noise-v8",
  "date": "2022-04-14T19:23:44.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8SiHdLoLpjETlsOjfb6YlyCzsb4=/400x0:4720x2880/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70749968/Screen_Shot_2022_04_14_at_2.31.45_PM.0.jpeg\" />        <figcaption>Image: Segway</figcaption>    </figure>  <p id=\"nc0yIc\">Segway has a new speaker accessory attachment for its electric scooters that makes V8 engine noises. The Ninebot Engine Speaker is a Bluetooth wireless speaker that straps onto a number of Segway’s personal transport vehicles. It can not only get rowdy with your favorite beats but also cause a ruckus like there’s a neighborhood drag race (<a href=\"https://gizmodo.com/segways-strap-on-speaker-makes-your-scooter-sound-like-1848783531\">via<em> Gizmodo</em></a>).</p><p id=\"jbnV9p\">The Engine Speaker comes with a mounting system that straps onto Segway / Ninebot electric scooters, GoKarts, electric bikes, and even its self-balancing vehicle offerings. The speaker then slides right on, looking like an add-on battery pack for the scooter. But really, the speaker runs on its own 2,200mAh battery that can <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fstore.segway.com%2Fninebot-engine-speaker&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F14%2F23025585%2Fsegway-ninebot-engine-wireless-speaker-engine-noise-v8\" rel=\"sponsored nofollow noopener\" target=\"_blank\">play for up to 23 hours</a> and charges via USB-C. The speaker is also rated for IP55 dust and water resistance, so it can handle hydroplaning drifts.</p><div id=\"EbwM1l\"><div ><iframe src=\"https://www.youtube.com/embed/VRo9_hI7vyI?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"CPn7mW\">The accessory can find and connect to an active Segway / Ninebot vehicle when in pairing mode and then can be switched into different engine modes: single-cylinder, twin-cylinder, V8, and V12. The speaker will sync up with the accelerator and rumble as you rev, take off, and idle. It could scratch the itch for combustion engine fans needing to disturb the peace, but at least there aren’t any emissions. </p><p id=\"3VoNwJ\">The Ninebot Engine speaker is also a great match for Segway’s new Super Scooter GT-series that can go 0–30 mph in as quickly as 3.9 seconds and can go as fast as 43.5 mph. The obvious risk of bodily harm riding the new high-powered scooters certainly called for an audible safety solution in the Ninebot Engine Speaker — and that safety comes at the cost of $149.99.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QOOF5FGU8csIOUzGEFlWwre-K9I=/0x100:5120x2781/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390264/Screen_Shot_2022_04_14_at_2.31.45_PM.jpeg",
  "description": "The Ninebot Engine Speaker adds rumble to your commute.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}