{
  "title": "Sen. Warren pushes TurboTax for answers about its efforts to block free tax filing",
  "url": "https://www.theverge.com/2022/4/18/23027618/senator-warren-taxes-turbotax-intuit-lobbying-free-file",
  "date": "2022-04-19T02:07:45.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Senate Armed Services Examines U.S. Central Command And U.S. Africa Command\" src=\"https://cdn.vox-cdn.com/thumbor/1b5JlmfHDp3qq411r12AXLT2wN8=/0x0:7547x5031/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70762085/1239211629.0.jpg\" />        <figcaption>Photo by Drew Angerer/Getty Images</figcaption>    </figure>  <p id=\"uVDGnW\">As millions of Americans file their 2021 income taxes online today, Sen. Elizabeth Warren (D-MA) is demanding answers from Intuit about its popular TurboTax e-filing product.</p><p id=\"uWWb9t\"><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23397131/2022.04.18_Warren_Intuit_Letter.pdf\">In a letter to Intuit CEO Sasan K. Goodarzi</a>, Warren says the company has used “extensive lobbying and adroit influence peddling” to prevent Americans from filing their taxes for free online. </p><p id=\"O2IrJq\">The Federal Trade Commission (FTC) <a href=\"https://www.ftc.gov/news-events/news/press-releases/2022/03/ftc-sues-intuit-its-deceptive-turbotax-free-filing-campaign\">filed suit against Intuit in March</a> for deceptive marketing, an action Warren calls “both welcome and long overdue.” Reps. Brad Sherman (D-CA) and Katie Porter (D-CA) also signed onto the letter. </p><div class=\"c-float-right\"><aside id=\"LFnAAl\"><q>“scamming taxpayers into paying for services that should be free”</q></aside></div><p id=\"6Zxaj9\">Many of Warren’s complaints center on the Free File program, an IRS partnership with a nonprofit coalition of tax prep <a href=\"https://freefilealliance.org/free-file-alliance-members/\">companies</a> founded in 2003 to provide free tax services to low-income filers. Under the terms of the partnership, 2021 filers with an adjusted gross income of $73,000 or less are eligible for the services, which are <a href=\"https://apps.irs.gov/app/freeFile/browse-all-offers/\">listed on the IRS website</a>.</p><p id=\"CeGGVZ\">Intuit’s participation in the program came under criticism after a series of <a href=\"https://www.propublica.org/series/the-turbotax-trap\"><em>ProPublica</em> reports</a> showed that both Intuit and H&amp;R Block had misled Free File-eligible filers into paying to file their taxes. The companies also deliberately made the free versions of their software <a href=\"https://www.propublica.org/article/turbotax-deliberately-hides-its-free-file-page-from-search-engines\">difficult to find</a> in online search results, according to <em>ProPublica</em>. Intuit <a href=\"https://www.theverge.com/2021/7/17/22581587/turbotax-parent-company-intuit-opts-out-irs-free-file-program\">left the Free File program</a> in 2021.</p><p id=\"JgLxQb\">In the letter to Goodarzi, Sen. Warren writes that “the Free File program has been a failure, scamming taxpayers into paying for services that should be free,” adding that “deceptive practices and outright sabotage from Free File companies” were largely to blame for the low rate of taxpayer participation in the program — a rate of only about 3 percent, by Warren’s <a href=\"https://thehill.com/opinion/finance/395762-free-file-providers-scam-taxpayers-congress-cant-be-fooled/\">estimation</a>.</p><p id=\"hKXksr\">In response, Intuit director of corporate communications Derrick Plummer provided the following statement to <em>The Verge</em>: </p><blockquote><p id=\"0CTg90\">Intuit strongly believes that Americans should be at the center of their financial life and is proud to have helped more taxpayers file their taxes for free than all our competitors combined. Over the past eight years alone, Intuit’s free tax preparation offering has helped nearly 100 million Americans file their taxes completely free of charge. We are clear and fair with our customers and open and transparent about our advertising practices, and our participation in the Free File program was done in compliance and with the oversight of the IRS. We are reviewing the letter from Sen. Warren and other policymakers and will respond.</p></blockquote><p id=\"INZ4n8\">Warren’s letter also points to a March 31st <a href=\"https://www.opensecrets.org/news/2022/03/intuit-spends-millions-lobbying-amid-accusations-of-deceptive-turbotax-advertising/\">report from OpenSecrets</a>, which found that Intuit employed former government officials, including former members of Congress, in its lobbying efforts. Intuit’s corporate political action committee has given donations to both Democrats and Republicans, according to the data. The company spent $3.3 million on lobbying in 2021.</p><p id=\"fWqRNI\">Warren’s letter also notes a “revolving door” problem in enforcement, in which Intuit hires former regulators to help deflect government action. A recent court filing revealed that the company had hired former FTC chair Jon Leibowitz “to defend itself from an FTC complaint,” which Warren says raises conflict of interests concerns. A 2019 <a href=\"https://www.citizen.org/article/ftc-big-tech-revolving-door-problem-report/\">report from Public Citizen</a> found that Leibowitz was one of dozens of former FTC officials with such potential revolving door conflicts.</p><p id=\"sokHS3\"><em><strong>Update 10:07PM ET</strong></em><em>: Added statement from Intuit.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/krZEmlzdhKMRjNb9G58rl7vw5Yw=/0x541:7547x4492/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397114/1239211629.jpg",
  "description": "Intuit has worked for years to block free filing, Warren says.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}