{
  "title": "Senate confirms Bedoya to FTC, establishing Democratic majority",
  "url": "https://www.theverge.com/2022/5/11/23067374/alvaroy-bedoya-federal-trade-commission-ftc-lina-khan-privacy-antitrust-senate",
  "date": "2022-05-11T19:33:40.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"uscapitol\" src=\"https://cdn.vox-cdn.com/thumbor/O0mpMuxyiXsXkGuRoPgAmZeXaZY=/9x0:1016x671/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70858039/capitoldome23.0.jpg\" />    </figure>  <p id=\"ANhl5W\">On Wednesday, the Senate voted to confirm privacy expert Alvaro Bedoya to the Federal Trade Commission. The confirmation secured a Democratic voting majority at the agency tasked by the Biden administration with investigating big tech companies like Facebook and Google over potential data privacy and competition violations. </p><p id=\"QaD705\">Vice President Kamala Harris voted to break a 50-50 tie on the Senate floor to finalize Bedoya’s confirmation.</p><div class=\"c-float-right\"><aside id=\"5qX0cy\"><q>“The confirmation secured a Democratic voting majority at the agency”</q></aside></div><p id=\"2Sdvqf\">Bedoya will replace former Commissioner Rohit Chopra who left the FTC last year to head the Consumer Financial Protection Bureau. Before his confirmation, Bedoya was a Georgetown law professor with a focus on privacy law, founding the university’s Center on Privacy and Technology in 2014. In his academic career, Bedoya explored the disproportionate effects of surveillance on minority groups, particularly regarding facial recognition technology.</p><p id=\"nKJd0S\">Bedoya was first nominated <a href=\"https://www.theverge.com/2021/9/13/22671880/biden-alvaro-bedoya-privacy-ftc-commissioner-facial-recognition\">to the FTC last September</a>, but his confirmation process was stalled by Republican opposition to his nomination. After several canceled and rescheduled committee hearings and votes last year, the Senate Commerce Committee voted 14-14 in March,<a href=\"https://www.commerce.senate.gov/2022/3/cantwell-without-a-full-ftc-we-can-t-protect-consumers-from-fraud-bring-nominee-to-a-senate-vote#:~:text=Bedoya's%20vote%20in%20the%20Commerce,placed%20on%20the%20Senate%20calendar.\"> requiring a motion to discharge</a> by Majority Leader Chuck Schumer (D-NY) to bring a final vote to the floor. </p><p id=\"Plzaav\">In April, <a href=\"https://www.axios.com/2022/04/20/us-chamber-commerce-ftc-commissioner-bedoya-letter\"><em>Axios </em>reported that the US Chamber of Commerce</a> had urged lawmakers to delay Bedoya’s confirmation </p><div id=\"9Y3Fg2\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Alvaro’s knowledge, experience, and energy will be a great asset to the FTC as we pursue our critical work. I’m excited to begin working with him, along with our other Commissioners, once his appointment is made final by President Biden.</p>— Lina Khan (@linakhanFTC) <a href=\"https://twitter.com/linakhanFTC/status/1524473326697132038?ref_src=twsrc%5Etfw\">May 11, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"apHpaC\">On Tuesday, Senate Minority Leader Mitch McConnell (R-KY) continued to pressure lawmakers to oppose Bedoya’s confirmation and urged the White House to pull his nomination. In a Tuesday floor speech, McConnell said, “he is an essentially foolish choice.” He continued, “I would urge my colleagues on both sides to stop this awful nomination so the president can reconsider and send us somebody suitable.”</p><p id=\"Lgf22n\">Bedoya’s confirmation comes as the FTC has heightened its scrutiny over the tech industry, led by chair Lina Khan. The commission <a href=\"https://www.theverge.com/2021/7/21/22587331/right-to-repair-apple-iphone-ftc-lina-khan-open-meeting\">had previously pledged</a> to take on unlawful “right to repair” restrictions, and is reportedly in the process of <a href=\"https://www.theverge.com/2022/1/14/22884198/ftc-state-ag-investigating-meta-facebook-vr-oculus-antitrust\">investigating Meta’s VR division</a> for potential antitrust violations.</p><p id=\"Na6fdl\">In a Wednesday statement, Khan said “Alvaro’s knowledge, experience, and energy will be a great asset to the FTC as we pursue our critical work.”</p><p id=\"17yW4J\"><em><strong>Updated 5/11/22 at 3:39PM ET: </strong></em><em>Included statement from FTC Chair Lina Khan.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_AMkTXUmxKjZxG1WI6-YtjQLyJg=/0x68:1024x604/fit-in/1200x630/cdn.vox-cdn.com/assets/2436755/capitoldome23.jpg",
  "description": "The vote secures a Democratic majority at the FTC",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}