{
  "title": "Sending a probe to Uranus labeled as top priority by space science community",
  "url": "https://www.theverge.com/2022/4/19/23030765/uranus-orbiter-probe-planetary-science-decadal-survey-top-priority",
  "date": "2022-04-19T15:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xXLN26vnH6c8IYeMFNPcgvy2QOg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70766689/Untitled_8.0.jpg\" />        <figcaption><em>The planet Uranus, seen from Voyager 2.</em> | Image: NASA/JPL-Caltech</figcaption>    </figure>  <p id=\"OJeajr\">The space science community thinks the time is ripe to study Uranus in depth — and they’re being serious. A new report compiled by planetary scientists from across the United States says that sending an interplanetary probe to study the ice giant planet should be considered the top priority for planetary exploration over the next decade.</p><p id=\"cerXJW\">Specifically, scientists are calling on NASA to create the Uranus Orbiter and Probe, or UOP. The mission concept would send a spacecraft into orbit around Uranus, along with a probe that would plunge into the planet’s atmosphere. Scientists envision such a mission launching sometime in the early 2030s as long as engineers get started on it as soon as next year.</p><p id=\"sLZfMM\">If it works, the UOP mission could provide the most intricate details yet about this mostly unexplored world. The only spacecraft to ever visit Uranus was NASA’s Voyager 2 mission, which flew by the planet in 1986, coming within 50,700 miles of the planet’s cloud tops. Voyager 2 unlocked some intriguing secrets about Uranus, discovering new moons and rings around the planet. But Voyager 2 didn’t stay for long; it zoomed by during its exploration of the outer Solar System and kept going, eventually heading off into interstellar space. </p><div class=\"c-float-right\"><aside id=\"NZXc35\"><q>“Our understanding of the interior structure of the planet is so poor”</q></aside></div><p id=\"FZGK0J\">An orbiter and a probe could provide a wealth of additional knowledge. Most of all, they could tell us exactly what Uranus is made of. Scientists believe the planet mainly consists of some combination of rock, ices, and hydrogen and helium, but that hasn’t really been confirmed. “Our understanding of the interior structure of the planet is so poor that we really have very little idea what the ratio of those three things are to each other,” Jonathan Fortney, a professor at UC Santa Cruz <a href=\"https://www.theverge.com/2017/6/16/15810926/nasa-uranus-neptune-mission-voyager-2-spacecraft\">who authored a report about possible missions to Uranus and Neptune</a>, tells <em>The Verge</em>. “And so there’s been a long assumption that it’s mostly these ices but that’s that’s literally an assumption. We don’t really know that.”</p><p id=\"rgwrNK\">Additionally, when scientists look at planets outside our Solar System, ice giants like Uranus and Neptune seem to dominate the Universe. And yet, they are the only main planets in our Solar System that we’ve never orbited. “Ice giant-like planets are some of the most common ones out there,” Bethany Ehlmann, a professor at Caltech and one of the steering committee members on the Decadal, tells <em>The Verge</em>. “We have two in our cosmic neighborhood in our Solar System, and it’s high time we check them out.”</p><p id=\"oOBzzm\">The Uranus mission is at the top of a long wishlist detailed today in what is known as the <a href=\"https://www.nationalacademies.org/news/2022/04/report-identifies-priority-planetary-science-missions-planetary-defense-efforts-and-strategic-investments-for-the-next-decade\">Planetary Science Decadal Survey</a>. Published by the National Academies of Sciences, Engineering, and Medicine, it’s a massive document written every 10 years or so by groups of planetary scientists detailing the space missions they’d most like to see happen a decade into the future. The Decadal Survey is done so infrequently because of the extensive amount of time it takes to plan and build a flagship interplanetary spacecraft, often requiring roughly a decade of work to execute.</p><p id=\"lvYod0\">Because it takes so long to pull off a space mission, scientists have to be strategic about their asks, ranking the missions they want to happen in order of highest to lowest priority. The Uranus mission was actually first recommended in 2011 during the last Decadal Survey, but the spacecraft was listed as the third-highest priority behind a Mars rover designed to look for signs of life on the Red Planet and a spacecraft to study Jupiter’s icy moon Europa, thought to harbor a liquid water ocean underneath its surface.</p><p id=\"U0IaR7\">Both of those priorities have manifested into actual missions. The Mars rover became NASA’s Perseverance rover, which landed on the Red Planet in February 2021 and continues to drill up samples of Martian soil. The mission to Europa became NASA’s Europa Clipper, a spacecraft designed to periodically zoom by Jupiter’s moon to potentially taste its atmosphere and perhaps pass through plumes of water that might erupt from its surface. As of now, Europa Clipper is slated to launch in October of 2024, with its arrival at Europa scheduled for 2030.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WP8nLrP51mQyBjiDlQX1FtP33HM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23400006/486_PIA11133.jpeg\">      <cite>Image: NASA/JPL/Space Science Institute</cite>      <figcaption><em>Saturn’s moon Enceladus, as seen from NASA’s Cassini spacecraft.</em></figcaption>  </figure><p id=\"AfZ86g\">Since those programs have been funded and planned, the lower priority missions from a decade ago have now moved to the top. Now, the second-highest priority on the list, after the Uranus mission, is a spacecraft to visit Saturn’s enticing moon Enceladus, also thought to harbor a liquid water ocean underneath its crust. Specifically, the Decadal calls for building an Enceladus Orbilander — a spacecraft that would function as both an orbiter and a lander. First the spacecraft would insert itself into orbit around Enceladus, possibly flying through plumes that are thought to erupt from the moon’s surface. Eventually, it would look for a spot to land on Enceladus, where it would stay for a two-year mission. Its main objective would be to search for signs of life.</p><p id=\"TEwiSH\">It’s going to be a while before the Enceladus mission takes flight, though. The Decadal calls for the mission to begin formulation in fiscal year 2029 at the earliest, with an arrival at Enceladus in the 2050s. And that’s <em>if</em> the budget manifests in full for both the Uranus mission and the Enceladus mission at NASA, which will likely cost billions of dollars. Understanding that funding is always precarious, the authors of the Decadal also made a second set of recommendations in case the money doesn’t materialize; they suggested that the Uranus mission could start development in 2028. But that would likely mean the Enceladus mission wouldn’t get underway until the 2030s at the earliest. </p><p id=\"P1HvLw\">While the Uranus and the Enceladus missions are the top new missions for the Decadal authors, they’ve also included a list of recommendations for space missions already taking place that they want to see continue. For instance, they strongly recommend that NASA continue to work toward bringing back samples from Mars. The Perseverance rover was just one major step in a long-term plan to dig up samples and then eventually transport them to Earth, where they can be studied in a lab. NASA is slowly moving forward with the next part of that plan, which entails creating a suite of vehicles that would land on Mars, collect the samples Perseverance cached, launch them off Mars, and then travel back to Earth. It’s going to be a very complicated process, and again, the Decadal recognizes budget can be a concern. While the report recommends finishing this sample return as quickly as possible, it also cautions not to let the budget balloon too much that it impacts all of the other planetary missions NASA is juggling.</p><p id=\"e45QiA\">There are also plenty of smaller planetary missions that are recommended that wouldn’t cost nearly as much money as the Uranus and Enceladus flagship missions. These would include probes to Saturn and its moon Titan, a new Venus mission, another mission to fly by Enceladus, missions to the Moon, and more. The Decadal isn’t done with Mars, either; it wants to create another mission called the Mars Life Explorer to look for signs that life may currently live on the Red Planet while assessing the world’s habitability. Additionally, the authors want NASA to continue the search for hazardous asteroids that could pose a threat to Earth by completing a planned spacecraft called the NEO Surveyor, which is scheduled to launch in 2026. </p><p id=\"SuCnc9\">It’s an extremely detailed report, consisting of nearly 800 pages. And while the focus of the Decadal may be on studying the worlds and rocks in our Solar System, wrapped in this report is a key message that the authors want to emphasize: we also need to protect and support the people <em>working</em> on these missions. In an effort to create a more diverse community of scientists and engineers working on these programs, the report recommends engaging students from underrepresented communities to pursue planetary science. The authors also recommend that NASA’s planetary science division work to eliminate bias and create codes of conduct surrounding its missions and conferences.</p><p id=\"5syPUw\">“While scientific understanding is the primary motivation for what our community does, we must also work to boldly address issues concerning our community’s most important resource — the people who propel its planetary science and exploration missions,” Philip Christensen, a professor at Arizona State University and co-chair of the Decadal’s steering committee, said in a statement. </p><p id=\"N7A035\"></p><p id=\"gK6OaX\"></p><p id=\"Cpf7HX\"></p><p id=\"qWxnC6\"></p><p id=\"sPgnzG\"> </p><p id=\"bwz3jM\"></p><p id=\"IYILhy\"></p><p id=\"xXvKJ9\"></p><p id=\"ggH190\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_KHsXq1kM2ebcHD5s7H7ozM33Nk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23400026/Untitled_8.jpg",
  "description": "It may sound funny, but it’s what the scientists want.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}