{
  "title": "Sennheiser’s Momentum True Wireless 3 earbuds have a fresh design and better ANC",
  "url": "https://www.theverge.com/2022/4/25/23041127/sennheiser-momentum-true-wireless-3-features-price",
  "date": "2022-04-25T22:00:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7WX_QR4yemX0lWabSw5Yv2_85WU=/40x0:2001x1307/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70792509/MTW3.0.jpg\" />        <figcaption>Image: Sennheiser</figcaption>    </figure>  <p id=\"vKp3q5\">Ever since the original pair’s debut back in 2018, Sennheiser’s Momentum True Wireless earbuds have received heaps of praise for their sound quality. <a href=\"https://www.theverge.com/2020/4/22/21230931/sennheiser-momentum-true-wireless-2-review-earbuds-headphones-sound-specs-battery-life-price\">After releasing a sequel in 2020</a>, Sennheiser is announcing the third product in the series today — and this time, they’ve been given a substantial redesign. They’ll be available starting May 10th in black, graphite, and white for $249.95.</p><p id=\"yp3Gl2\">The Momentum True Wireless 3 buds look closer to the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fen-us.sennheiser.com%2Fcx-true-wireless&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F25%2F23041127%2Fsennheiser-momentum-true-wireless-3-features-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">CX</a> and <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fen-us.sennheiser.com%2Fcx-plus-true-wireless&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F25%2F23041127%2Fsennheiser-momentum-true-wireless-3-features-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">CX Plus</a> True Wireless than they do their direct predecessors. Clearly, Sennheiser has settled on a universal design language of sorts for its earbud lineup, and that’s reflected here. The Momentums do give off a sleeker and more premium impression than the company’s cheaper buds.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/r7aK_hHrEhYdf-Kin4AXNNjYYWs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23414989/MTW32.jpg\">      <cite>Image: Sennheiser</cite>      <figcaption><em>Sennheiser’s new flagship buds move the USB-C port to the front of the case.</em></figcaption>  </figure><p id=\"tiQ96q\">The fabric-covered case is similar in shape and size to previous versions, though Sennheiser has moved the USB-C charging port to the front. This is becoming increasingly common, with companies like Jabra recently having made the same change. It looks a bit strange at first but can be more convenient in some charging scenarios. This new case also supports wireless charging, a feature that was absent from previous models — and hard to accept given the asking price.</p><p id=\"UJS7iD\">Aside from the refreshed style, Sennheiser says its latest earbuds offer improvements to comfort, active noise cancellation, and call quality. But, in two key areas — audio quality and battery life — they are no major upgrades. The Momentum True Wireless 3s continue to use the company’s made-in-Germany, 7-millimeter drivers. Sennheiser’s mobile app now lets you take a listening test to better personalize the bass, mids, and treble, but at least judging from the press release, I’d expect the overall sound profile to be similar. The True Wireless 3s support AAC, SBC, and <a href=\"https://www.theverge.com/2018/8/31/17660460/aptx-adaptive-qualcomm-audio-compression-algorithm-android-pie-ifa-2018\">aptX Adaptive</a> Bluetooth codecs. The latter should reduce any perceptible latency when using the buds with devices that also make use of aptX Adaptive, while also reaching higher bitrates than AAC.</p><p id=\"CT2vCp\">Sennheiser has implemented adaptive noise cancellation, which allows the Momentum True Wireless 3s to automatically adjust how much noise cancellation is applied based on your changing surroundings. The company says its “system continuously observes ambient noise to suppress it in real time,” though users still have the option of manually adjusting it to their preference. </p><p id=\"MRM7cQ\">Each of the two earbuds now contains three microphones, which Sennheiser says has led to noticeable improvements and “crystal clear quality” for both voice and video calls. Battery life remains at seven hours of continuous playback with the charging case holding an additional 21 hours. The Momentum True Wireless 3s are IPX4 certified for water resistance, making them suitable for workouts and light rain.</p><p id=\"s5Pc4U\">Aside from revamped looks, Sennheiser isn’t making any radical changes with the Momentum True Wireless 3s. They still lack Bluetooth multipoint, for example. It seems the company is confident that these will appeal to the same market as prior models in the series: people who prioritize sound quality above all else. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/e7_j1LkIw-juGTPFD8NMRFkgs7E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23415096/sennsport.jpg\">      <cite>Image: Sennheiser</cite>      <figcaption><em>Sennheiser is aiming to lure in the fitness crowd with its also-new Sport True Wireless earbuds.</em></figcaption>  </figure><p id=\"EJFrsL\">Sennheiser recently also introduced <a href=\"https://www.sennheiser-hearing.com/p/sport-true-wireless/\">the $199.95 Sport True Wireless</a> earbuds to compete against the likes of the Beats Fit Pros. The unique aspect of the Sport buds is that Sennheiser includes both open and closed ear tips, letting owners switch between the two depending on the activity and how aware of their surroundings they need to be. The open adapters will lessen the intensity of body noise like breathing and footsteps, whereas the closed tips will give you more isolation. The Sport True Wireless also add dust resistance to the equation, with an IP54 rating.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/unaJaGNoI1QFoep01rc9ncMcbBU=/0x120:2040x1188/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23414986/MTW3.jpg",
  "description": "Plus aptX Adaptive for lower latency playback.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}