{
  "title": "Sennheiser’s flagship wireless earbuds are now better and cost less",
  "url": "https://www.theverge.com/23059336/sennheiser-momentum-true-wireless-3-earbuds-review",
  "date": "2022-05-06T15:45:00.000Z",
  "author": "Chris Welch",
  "content": "  <p>New design, more features, and the same signature sound</p> <p class=\"p--has-dropcap p-large-text\" id=\"H8uXJN\">Sennheiser’s new Momentum True Wireless 3s are the company’s latest flagship earbuds. With a more refined style, improved active noise cancellation, new features, and top-notch sound quality, Sennheiser has delivered a worthy competitor to the Apple AirPods Pro, Sony’s WF-1000XM4, and Bose’s QuietComfort Earbuds. </p><p id=\"AzumOD\">Perhaps the most welcome thing about the latest Sennheiser buds is that they’re less expensive than the previous model: the <a href=\"https://www.theverge.com/2020/4/22/21230931/sennheiser-momentum-true-wireless-2-review-earbuds-headphones-sound-specs-battery-life-price\">Momentum True Wireless 2s</a> launched at $299, but the company is releasing these at $249.95. That’s still premium pricing, but Sennheiser is now on par with Apple’s AirPod Pros and comes in cheaper than both Sony and Bose’s flagships. With tech products increasingly creeping up in price every year, it’s nice to see one go in the opposite direction for a change — and add new features, to boot.</p><div id=\"xApxA3\"><div data-anthem-component=\"scorecard:11179014\"></div></div><p id=\"IYyYh2\">Wireless charging is the most significant upgrade. It was hard to accept the lack of this feature in the Momentum True Wireless 2s. For the price, wireless charging should be table stakes. I’m not sure how it took three tries for Sennheiser to realize that.</p><p id=\"0n5dyX\">Another improvement is what comes in the box: Sennheiser gives you four sizes of ear tips — the fourth is an extra small — but with the new model, the company also includes three optional wing fins that wrap around each earbud and tuck into your ears for added stability. The medium size comes preinstalled, but it’s easy to remove or replace with a smaller or larger wing if you need to keep the earbuds extra steady and secured in place during a workout or run. Even without the stabilizer fins, the MTW3s took to my ears comfortably and didn’t easily come loose.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/a0oVVT9VgH2ll3sqbHAk8X0Ovxw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441284/cwelch_220504_5199_0002.jpg\">      <figcaption><em>The earbuds have a revamped design.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/iNCPe04d2D1J_tgwHcmMQMfmRKU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441288/cwelch_220504_5199_0006.jpg\">      <figcaption><em>Sennheiser includes optional stabilizer fins with its latest earbuds.</em></figcaption>  </figure></div></div></div><p id=\"dqtmgi\">The earbuds are smaller than their predecessors, with a more squared-off outer-facing design that comes in black, grey, or white. My black review unit looks far more subtle in the ear compared to the MTW2s, which have a shiny silver Sennheiser logo. But they still protrude further than something like Samsung’s Galaxy Buds Pro, so these aren’t the most discreet buds around. The charging case also shrank a bit thanks to Sennheiser making better use of space, and the USB-C charging port has been relocated to the front. This can seem odd at first, but it’s something other companies like Jabra have started doing as well, and you might find it more convenient depending on where you’re charging the MTW3s. </p><div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ecusLhGflF8Y4Slot_PSctJN9Jw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441285/cwelch_220504_5199_0003.jpg\">      <figcaption><em>The USB-C port is now on the frontside of the charging case.</em></figcaption>  </figure></div><p id=\"8e6jQn\">Sennheiser has improved the strength of its noise cancellation, though you don’t actually have any direct control over how much ANC is applied with the MTW3s. The company uses an adaptive ANC to automatically increase and lower noise cancellation based on your current environment. Other earbud makers have also tried this adaptive approach, though most make it optional rather than the full-time default. I didn’t find myself missing manual adjustment while testing these earbuds, but you might prefer more control. The ANC isn’t at the same level as Sony or Bose, but it does the trick to help hush nearby distractions. And you always have the ability to activate transparency mode with a tap of the left earbud, though Sennheiser’s implementation still doesn’t match the same natural sound that Sony, Bose, and Apple have all achieved.</p><div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uWL5wjI65fGis8i87viPFkTbnww=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441283/cwelch_220504_5199_0001.jpg\">      <figcaption><em>The more compact Momentum True Wireless 3s might be a better fit for people with smaller ears.</em></figcaption>  </figure></div><p id=\"tPZCld\">When it announced its latest earbuds, Sennheiser didn’t make any mention of major changes to their sound. They still use 7-millimeter drivers that are similar to what was inside the MTW2s, and I’d put the overall audio quality in the same ballpark as those and Sennheiser’s CX Plus — though these are slightly better and can crank louder in volume. That’s a good place to be, as these still sound wonderful. Sennheiser supports AAC, SBC, AptX, and AptX Adaptive Bluetooth codecs, with the latter helping to eliminate any perceptible audio delay when watching videos or playing mobile games on Android. It would’ve been nice to see Sony’s LDAC added to the equation, but that’s the kind of omission I can live with, considering the lower price. And AptX Adaptive also has support for higher-res audio than what AAC and SBC allow.</p><p id=\"zzNVbA\">Tossing on an old favorite like <em>Buena Vista Social Club</em>, the Sennheisers deliver a very spacious, clean, and detailed sound, with the piano, classical guitars, and vocals all nicely layered without a hint of muddiness. The same held true when I switched between The National, Molly Tuttle, or Bon Iver’s “Second Nature” track from <em>Don’t Look Up</em>. These earbuds bring out the small touches of a song with very enjoyable clarity. Sennheiser’s Smart Control app for iPhone and Android lets you adjust the EQ with bass boost and podcast modes that are separate from any changes you make to the bass, mid, and treble sliders. (The podcast option enhances speech clarity.) The standard consumer-friendly tuning curve is present here, but I’d say the Sennheisers are more balanced than the <a href=\"https://www.theverge.com/22523584/sony-wf-1000xm4-wireless-earbuds-headphones-review\">Sony 1000XM4s</a>. Not everyone will prefer that: I ended up enabling bass boost more often than not, whereas the Sonys deliver powerful, energetic sound out of the box. </p><div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fy1T8witRdjsuCSoiuWBY6m0Zgo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441286/cwelch_220504_5199_0004.jpg\">      <figcaption><em>The case finally supports wireless charging.</em></figcaption>  </figure></div><p id=\"yzQXVA\">The mobile app also recently added the option to set up “sound zones” and automatically change the level of noise cancellation and EQ customizations based on where you are — whether it’s home, the office, at the gym, or other spots that you frequent. This worked as expected in my tests, but it does require you to grant the Sennheiser app location tracking privileges on your phone. Plus, using Sound Zones (or the Sound Check feature that personalizes your EQ) requires you to set up a Sennheiser account. I’m not a fan of making people sign up for an account just to use earbud features.</p><p id=\"iNoOsz\">Some owners of Sennheiser’s previous Momentum True Wireless models reported an audible, persistent white noise effect while listening to the buds. Even in a completely silent room, I’ve noticed no such annoyance with the third-generation pair. Battery life remains unchanged at seven hours of continuous listening, and the earbuds (along with their case) are IPX4 water-resistant, which makes them suitable for routine exercise.</p><p id=\"z2JG1i\">Voice call performance seems to have a leg up over the MTW2s, and I didn’t get any major complaints about call quality or being hard to understand. These still come up short against recent standouts like Sony’s LinkBuds, however. Either earbud can be used by itself while the other charges in the case, and these also have auto-pause whenever you remove one or both buds.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LH3G7082dGiEFr5DUG4FaktZPZ4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441291/cwelch_220505_5199_0009.jpg\">      <figcaption><em>The MTW3s come in black, grey, or white.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SXs3ACfJvastgDaHdPaiOU4ZbCw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23441292/cwelch_220505_5199_0010.jpg\">      <figcaption><em>Their sound is detailed, spacious, and balanced.</em></figcaption>  </figure></div></div></div><p id=\"N9O9Pw\">The MTW3s weren’t completely immune from minor bugs in my time reviewing them: I noticed the occasional (though rare) signal dropout, and the status / prompt voice sometimes quickly said both “disconnected” and then “connected” soon after I removed them from the case and plopped them in my ears. At launch, the new Sennheiser flagship earbuds don’t support multipoint Bluetooth, so you’re only able to connect to one device at a time. The company has claimed that it’s planning to add multipoint in a future firmware update, but as the old adage goes, you should only buy a product based on what it can do right now and not for what might come later.</p><div><div id=\"igrMBU\"><div data-anthem-component=\"aside:11179024\"></div></div></div><p class=\"c-end-para\" id=\"U7uGCA\">If the Sennheiser Momentum True Wireless 3s <em>did</em> have multipoint, I’d consider them a home run and recommend an upgrade for fans of the company’s past buds. But even as they are, Sennheiser has done a good job of upping their value while lowering the sticker price. The noise cancellation is better, you now get wireless charging, and they still sound splendid. Even if battery life is the same and call quality is merely fine, the overall package is more compelling than Sennheiser’s past premium efforts. They don’t <em>quite</em> unseat the Sony 1000XM4s as my favorite earbuds; I’ll take the better noise cancellation, foam ear tips, and warmer sound profile of Sony’s buds. But maybe that’s just what I’m used to now. Sennheiser’s right up there with the very best in audio quality — and for $50 less than last time.</p><p id=\"pzdFjS\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/T24vg91D93poxnb0hkGn0deTgzY=/0x279:2040x1347/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23441367/sennheiser.jpg",
  "description": "Same sound, more features, less money.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}