{
  "title": "Sennheiser’s new in-ear monitors are all about the metal",
  "url": "https://www.theverge.com/2022/3/2/22954718/sennheiser-earbuds-metal-zirconium-audiophile",
  "date": "2022-03-02T22:39:13.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CTopmQeFzlFHMmdVKHqnDRKZsl8=/0x400:2400x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70570283/Sennheiser_IE_600_Mood_Shot_1x1_P1120993_web.0.jpg\" />        <figcaption><em>Zirconium is a key part of the IE 600 earbuds.</em> | Image: Sennheiser</figcaption>    </figure>  <p id=\"BdcBCg\">Sennheiser’s new earbuds are 3D printed with the same material used in the drill bits for the Mars rover. The IE 600 earbuds have a shell that’s composed of ZR01 amorphous zirconium, lending it a unique aesthetic and remarkable durability.</p><p id=\"evdiUZ\"><a href=\"https://www.rsc.org/periodic-table/element/40/zirconium\">What the hell is zirconium anyway</a>? Without going into too much detail, zirconium is a shapeable metal that's highly resistant to corrosion. This is why zirconium is frequently used for a variety of industrial and medical applications and is commonly used in steel alloys. So why is Sennheiser using zirconium in its headphones?</p><p id=\"yv0et3\">One might assume that using this uncommon material would somehow provide you with otherworldly sound quality, but that’s not what Sennheiser seems to be pitching here. Rather, it’s the material’s malleable nature and toughness that make it an exceptional choice for a lightweight and durable shell.</p><p id=\"Pt9TE2\">Sennheiser products have always been directed at audiophiles, and the IE 600 is no different. Where most earbuds these days are entirely wireless, the IE 600 relies on either a 3.5mm or 4.4mm wired connection to support hi-fi and lossless audio. The IE 600, like other in-ear models from Sennheiser, can be disconnected at the earbud itself so you can easily replace the cables when they get worn out.  </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PVzxATfQlYlXsoOys9rWFLsfuos=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277537/ie_600_product_shot_4_final.jpg\">      <cite>Image: Sennheiser</cite>      <figcaption><em>The IE 600 disconnects at the earbud for different inputs.</em></figcaption>  </figure><p id=\"h7ecel\">Sennheiser hasn’t yet shared many other technical details on the IE 600, only that it will use a single 7mm driver and precision-molded resonator chambers to provide a “tonally neutral” sound profile.</p><p id=\"nfPq2d\">The IE 600s are set to launch later this spring, and with an MSRP of 699 euros (roughly $785), they certainly represent an investment that isn’t for the faint of heart, but could pay big dividends for just about any audiophile who can stomach the price. Or for someone who wants to listen to their heavy metal catalog through some light metal headphones.</p><p id=\"t1KJjw\"><em><strong>Correction March 2nd, 5:38PM ET: </strong></em><em>An earlier version of this story stated that the Sennheiser IE600 used a 3.5mm and 1/4-inch wired connection. It uses a 3.5mm and 4.4mm balanced termination connection. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CfC1eb7BStTSOr7sJIcf1Jo-Xwk=/0x572:2400x1829/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23277516/Sennheiser_IE_600_Mood_Shot_1x1_P1120993_web.jpg",
  "description": "The IE 600s launch in spring and will cost roughly $785.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}