{
  "title": "She-Hulk: Attorney at Law’s first trailer looks simply smashing",
  "url": "https://www.theverge.com/2022/5/17/23104195/she-hulk-first-trailer-disney-plus-release-date",
  "date": "2022-05-17T22:32:27.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JNx7EYfrrygSHermng2MdmoMXAg=/550x0:2326x1184/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70880789/Screen_Shot_2022_05_17_at_5.57.04_PM.0.png\" />        <figcaption>She-Hulk showing up at an event. | Disney</figcaption>    </figure>  <p id=\"alpv9z\">Though Bruce Banner’s been <a href=\"https://www.theverge.com/2014/8/17/6028767/biologist-tries-to-explain-captain-america-and-the-hulk\">one of the most physically powerful people</a> running around Marvel’s movies for years at this point, that’s all about to change this summer as his cousin Jennifer Walters makes her way to MCU in<a href=\"https://www.theverge.com/2019/8/23/20830548/she-hulk-moon-knight-disney-plus-streaming-kevin-feige-marvel-cinematic-universe\"> Disney Plus’ <em>She-Hulk: Attorney At Law</em></a><em>.</em> While both Hulks make appearances in <em>She-Hulk</em>’s first trailer, the show’s clearly going to be Jennifer’s to own as she embarks on her own path to heroism.</p><p id=\"Qf5asu\"><em>She-Hulk: Attorney At Law</em>’s first trailer introduces Jennifer at a tricky point in her already complicated life. Because the world’s filled with so many villains committing super crimes, Jennifer’s legal skills put her in high demand, but she isn’t quite certain that’s the kind of force for justice she wants to be. That soul searching’s likely what leads to her meeting up with Bruce (Mark Ruffalo) that somehow leads to an experiment that leaves her with the ability to transform into a hulking (and very CGI-ed) version of herself who leaps into action as a new vigilante. In addition to the Hulks, <em>She-Hulk</em>’s trailer also features a handful of glimpses of longtime Hulk foe Abomination (Tim Roth), pointing to how the series will find ways to connect to the larger MCU.</p><p id=\"SlYSn5\"><em>She-Hulk: Attorney at Law </em>also stars Ginger Gonzaga, Josh Segarra, Jameela Jamil, Jon Bass and Renée Elise Goldsberry<em> </em>hits Disney Plus on August 17th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/G7cceS0zOPtji8Lrwq4srRdhH-w=/308x0:2569x1184/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23521510/Screen_Shot_2022_05_17_at_5.57.04_PM.png",
  "description": "Meet Jennifer Walters",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}