{
  "title": "Shortwave just rescued my inbox from the drudgery of Gmail",
  "url": "https://www.theverge.com/22990303/shortwave-email-google-gmail-inbox-successor-hands-on",
  "date": "2022-03-24T10:00:00.000Z",
  "author": "Shubham Agarwal",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/b4EYR_NItLF3rTyfMSrVtnK_3Es=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70665170/VRG_Illo_5099_K_Radtke_Shortwave.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"WM8O8R\">When Google killed its Gmail alternative Inbox in 2018, it promised that several of its ideas would eventually come to Gmail. While some did arrive, most of what made Inbox a success, such as “bundles,” never did. Instead, in the following years, Google has shoehorned its entire productivity suite into Gmail to push people into using the rest of its Workspace services. And it’s about to get worse <a href=\"https://www.theverge.com/2022/1/31/22911287/gmail-redesign-workspace-rollout-april-q2-chat-meet-spaces\">as Google gears up to roll out a major Gmail update</a> that’s more cluttered than ever.</p><p id=\"BlKCuy\">Gmail’s evolving interface works for those invested in Google’s ecosystem, but it does little to save people from the drudgery of sifting through their messy inboxes every day. It’s easy to see why: it still dumps on you a list of emails with no real structure beyond an unpredictable set of filters for keeping out promotional messages, spam, and social media updates.</p><p id=\"REVC9Y\">The email apps that offer to fix Gmail’s shortcomings have been equally disappointing for me: Newton Mail <a href=\"https://www.theverge.com/2020/5/11/21253924/newton-mail-new-owners-essential-shutdown-email-app-mac-ios-windows-android\">couldn’t keep an owner</a>, nor my trust. Spark had too many features I didn’t need. <a href=\"https://www.theverge.com/21299681/superhuman-email-app-review-price-gmail-iphone-mac\">Superhuman</a>, a $30 / month email app that wants to make you “feel like you have superpowers,” overpromises and underdelivers. But after years of app hopping, my search for a Google Inbox successor may be finally coming to an end, thanks to a refreshingly minimalistic new Gmail client called <a href=\"https://www.shortwave.com/\">Shortwave</a>.</p><div id=\"bS4HVT\"><div ><iframe src=\"https://www.youtube.com/embed/zKVIwhtP52E?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"SC3zWn\">Shortwave is designed by a group of ex-Googlers, including Andrew Lee, who previously founded and sold Firebase, an app development platform, to Google. Shortwave — priced at $9 / month unless you’re OK with only three months of email history — makes no bones about its ambitions to step into Inbox’s shoes. It even looks and works like it with a blue-accented theme, but it’s more than just a clone. It builds upon the effective design choices that powered Inbox with some of its own, and in the two weeks I’ve spent with it, it has made me far more productive at managing my email.</p><p id=\"gW30Kz\">When I fire up Shortwave — available on the web, iOS, and Android — it doesn’t drown me in an avalanche of emails. Instead, the non-essential items, such as updates from social media and automated confirmations like the ones from Amazon, are bundled neatly together, and the threads I labeled previously for, say, a project are sorted in another by default. This all happens within the same inbox, not under various tabs like Gmail, which allows me to keep an eye on it and prevent junk from piling up.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oX_LfCdwXfW7ACPFeMfnR_ku_l0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23335734/shortwave.png\">      <cite>Image: Shortwave</cite>      <figcaption><em>Shortwave’s sample inbox.</em></figcaption>  </figure><p id=\"2VF4M6\">Because most of my inbox is already organized when I jump into it, there are far fewer emails that demand my immediate attention. It feels like my work has been cut in half: I know the messages under bundles such as “Newsletters” can wait, and I can quickly get to the emails that matter without stressing over the unread count (which doesn’t exist on Shortwave anyway).</p><p id=\"nfTry9\">Shortwave’s most striking quality for me, however, is how it compelled me to rethink how I tackle my email inbox. Before, I used to dive into it head-on with no plan — handling whatever was at the top first and likely missing what was at the bottom. </p><p id=\"PHR4Gw\">Now when I log on, there’s a certain routine to it. I first archive all the junk in one go with the “sweep” button, instantly unclogging my inbox. Next, I check if there are any unread messages in the “Favorites” section, which houses emails from my most frequently contacted people, to know whether I have any updates from my editors and respond to those in case I do, as that’s usually my top priority, and I can now find them without manually going through countless stacks of other messages. </p><p id=\"6FWrSj\">Then I can comfortably triage the rest: I pin the most urgent items to the top of the inbox, snooze what can wait, drag and drop related emails onto each other to throw them in a new bundle I can revisit later. Aside from actually answering my emails, none of it takes me more than a few minutes, and you can do just about everything with keyboard shortcuts.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/y4SKZ-k7LQmK3VKVqadQAaArPoM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23335736/shortwave_1.png\">      <cite>Image: Shortwave</cite>      <figcaption><em>Shortwave groups routine threads under a single item in your inbox.</em></figcaption>  </figure></div><p id=\"egaacY\">Like a lot of people, I suffer from an anxious tendency to roll over to my phone and check my emails first thing in the morning, but Shortwave’s Do Not Disturb mode now holds all emails until later and keeps my email-anxious brain in check. The app also lets me cherry-pick the sort of emails I want to be notified of and frees up my notification panel of junk like deals and marketing updates altogether. </p><p id=\"SuRVt6\">And unlike many new email clients, it feels like Shortwave strikes the right balance when it comes to information density. Its interface is just spacious enough that my inbox shows plenty of emails at a time, doesn’t appear as one giant messy glob of text, and is easy to navigate — unlike Inbox’s, whose design was <a href=\"https://www.theverge.com/2014/10/22/7039391/google-inbox\">criticized</a> for its low density of information. I also find it much better at laying out busy threads, clearly showing when there’s a new recipient in an email chain or when someone pings me directly instead of everyone by breaking the reply-all into a sub-thread. </p><p id=\"UN6TcW\">To bring these sorts of conveniences to Gmail, I had to trust that Shortwave won’t sell or read my emails, which it technically can do. Though handing reins to my data to new companies has become harder for me to do than ever, Shortwave makes a convincing case. In addition to clear policies that state Shortwave doesn’t monetize personal data, it says it has passed a Google-mandated annual audit — which can cost third parties over $75,000 and involves stress-testing their security protections. It also helps its case that its business model depends on a premium subscription, not on ads or data brokerage.</p><p id=\"QOLiIC\">(Google and the company that did Shortwave’s audit, NCC Group, refused to comment.)</p><p id=\"gcY8va\">Although Shortwave is now my default inbox, I still have to return to Gmail every once in a while because it can’t schedule emails yet and lacks a few standard folders, such as spam. The absence of a delete option has been a letdown as well. Lee claims all of these are “high on the priority list,” but he can’t comment on when those updates will arrive.</p><p id=\"MTnNIh\">Another thing that could throw a wrench in Shortwave’s experience for me is the startup’s grander ambitions to replace apps like Slack with email. On Shortwave, organizations can create “Workspaces” where employees can chat in real-time as they would on a messaging service. Except in Shortwave’s case, all the messages are emails. At the moment, these enterprise tools live in their separate division and don’t get in the way, but whether that changes (and clutters Shortwave’s clean inbox in the same way Google did with Gmail) remains to be seen.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/72oboljHUQr2T_BpDYqNAeWO0Q0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23335739/shortwave_chat_email.jpg\">      <cite>Image: Shortwave</cite>      <figcaption><em>Shortwave also lets you turn email into chat.</em></figcaption>  </figure><p id=\"eZao3P\">I am skeptical of Shortwave’s plan to transform email into the silver bullet for all work communication, but if my squeaky clean inbox is any indication, it can certainly restore a state of calm into your chaotic relationship with emails and patch that Inbox-sized hole in the world. </p><p id=\"Rl5Omq\">Shortwave doesn’t attempt to reinvent or complicate email, and its smart inbox is simple and practical. So much so that while using it, all I could wonder was why Google never brought over all of Inbox’s features to Gmail. Many of its features may seem minor additions to Gmail — but put together, they add up to an email experience that’s less frustrating and more functional. </p><p id=\"Jifijb\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AVrSw-kfPz9dEQBXTIvoGEXA39k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340128/VRG_Illo_5099_K_Radtke_Shortwave.jpg",
  "description": "It might succeed where Google Inbox failed.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}