{
  "title": "SIDS study shows the risks of science hype",
  "url": "https://www.theverge.com/2022/5/13/23071364/sids-research-hype-science-studies",
  "date": "2022-05-13T20:53:49.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"GUTHRIE TEST\" src=\"https://cdn.vox-cdn.com/thumbor/fKP409VzinftdqvQBRwgKMc8DiI=/0x0:5100x3400/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70867244/1041926692.0.jpg\" />        <figcaption>Photo by: BSIP/Universal Images Group via Getty Images</figcaption>    </figure>  <p id=\"sZThsF\">Sudden infant death syndrome, or SIDS, is a devastating condition that’s still very poorly understood, so when new research comes out, it can feel like a very big deal — especially if that research seems to offer a way to save children’s lives. Posts on social media cheered one such new study this week, heralding the research as identifying the reason hundreds of babies die unexpectedly each year. </p><p id=\"i5JeDi\">But even though the study points in a promising direction for future research, it isn’t a panacea, experts say. “There is nothing definitive about this at all,” said Rachel Moon, a researcher studying sudden infant death syndrome at the University of Virginia, in an email to <em>The Verge</em>. The surge in interest around <a href=\"https://www.thelancet.com/journals/ebiom/article/PIIS2352-3964(22)00222-5/fulltext\">the study</a> is understandable, she said, but isn’t warranted. </p><p id=\"6Sc6xT\"><a href=\"https://www.cdc.gov/sids/about/index.htm\">SIDS refers to</a> the sudden and often unexplained death of an infant one years old or younger. It is largely a mystery, and doctors don’t have good answers as to why it happens. Parents of infants who die from unexplained causes are <a href=\"https://www.statnews.com/2019/03/27/sids-medical-bureaucrats-deepened-parents-anguish/\">often the focus of suspicion</a>, which can make the parents feel even more guilty and bereaved than they already do. Medical research into SIDS<strong> </strong>has, for the past few decades, focused on prevention: there’s an association between how infants are placed down to sleep and SIDS, so parents are encouraged to place babies on their backs and on firm surfaces. </p><p id=\"V8YfG3\">But even with safe sleeping campaigns, which have <a href=\"https://safetosleep.nichd.nih.gov/activities/SIDS/progress\">been effective at reducing infant deaths since the late 1980s</a>, rates of deaths from SIDS have stayed <a href=\"https://www.cdc.gov/sids/data.htm#:~:text=SIDS%20rates%20declined%20considerably%20from,when%20rates%20began%20to%20increase.\">around the same</a> in the United States for years. Without good explanations for why the deaths occur, parents of young children often spend months fearful it could happen to their infant. </p><div class=\"c-float-right\"><aside id=\"KpDT51\"><q>It’s a problem that can give people unrealistic expectations of solutions and undermine trust in science more generally</q></aside></div><p id=\"Mt5Zn3\">That’s likely why the new study hit such a chord on social media. Its findings were also overhyped by early <a href=\"https://www.biospace.com/article/researchers-answer-how-and-why-infants-die-from-sids/\">coverage</a> that claimed it showed the clear-cut reason for SIDS. <a href=\"https://www.vox.com/science-and-health/2019/6/11/18652225/hype-science-press-releases\">That’s common</a> with scientific studies, which are sometimes presented by press releases, their researchers, or surface-level reporting as more sensationalist than they actually are. It’s a problem that can give people unrealistic expectations of solutions and undermine trust in science more generally. </p><p id=\"7sYSDw\">Taking a close look at this SIDS study, published in the journal <em>EBioMedicine</em> last week, shows that it was very small — it included blood samples from 67 infants who died and 10 who survived. The analysis showed that infants who died of SIDS had lower levels of an enzyme called butyrylcholinesterase, which researchers <a href=\"https://www.nature.com/articles/nrn1035#:~:text=Butyrylcholinesterase%20is%20a%20serine%20hydrolase,possible%20involvement%20in%20neural%20function.\">think</a> is involved in neural function. That doesn’t necessarily mean that the enzyme is responsible for SIDS or has a role in an infant’s death. And even though there was a statistical difference between the levels of the enzyme between the two groups of infants, there was overlap between them. That would make it hard to design an accurate blood test to check if an infant had levels of the enzyme linked with SIDS, Moon said. </p><div id=\"gjM7CQ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I've seen this report multiple times on my feed today so wanted to comment.<br><br>This is interesting (&amp; promising) work but the report (<a href=\"https://t.co/uhyRmmZc9e\">https://t.co/uhyRmmZc9e</a>) VASTLY overstates the research findings.<a href=\"https://twitter.com/hashtag/SIDS?src=hash&amp;ref_src=twsrc%5Etfw\">#SIDS</a> is awful, but we need to be careful with messaging here<br><br>A brief  <br>1/x <a href=\"https://t.co/uVx7sExjrp\">https://t.co/uVx7sExjrp</a></p>— Jonathan Marron MD MPH (@JonMarronMD) <a href=\"https://twitter.com/JonMarronMD/status/1524888237256241153?ref_src=twsrc%5Etfw\">May 12, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"uhbVd6\">Individual scientific studies rarely offer clear-cut answers, especially to complex issues like SIDS. Science is an iterative process, and research builds on itself over time. Research on the more fundamental, biological reasons for devastating issues like SIDS are important to help remove stigma from grieving parents and help offer potential solutions. And any new finding that points in a promising direction is helpful. But it’s also important to be clear about what the limits of any given research are. In this case, there’s still a long way to go before a screening test for SIDS might be available.  </p><p id=\"9YNR2Z\">“This is progress, and for that we should be optimistic, but it’s not the entire answer,” said Alison Jacobson, CEO of the SIDS-focused nonprofit First Candle, <a href=\"https://firstcandle.org/wp-content/uploads/2022/05/Statement-from-Alison-Jacobson-CEO-of-First-Candle-on-the-new-study-from-Australia-on-SIDS..pdf\">in a statement</a>. “As bereaved parents ourselves, we understand how parents whose babies have died from this mysterious disease desperately want answers and new parents want assurance that it won’t happen to their baby. We pray that someday that will happen but that’s not the case today.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/v7Ecqw90eVL67hHv_3gvjFR2_DM=/0x365:5100x3035/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23463537/1041926692.jpg",
  "description": "There isn’t an easy test around the corner.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}