{
  "title": "Sifu’s toughest battle is with its own origins",
  "url": "https://www.theverge.com/22920754/sifu-review-pc-ps5-sloclap",
  "date": "2022-02-07T15:00:00.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ok_aYAPpOSuSeAoNRt1zCrgUURs=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70479408/H3Atrium.0.jpg\" />    </figure>  <p>Sloclap’s love letter to kung fu won’t be received by everyone</p> <p id=\"m5XX6r\"><em>Sifu</em> is very hard. You will metaphorically ram your own head through a wall trying to finish the game as often as you will literally ram the heads of your various assailants through walls, windows, glass bottles, metal pipes, bats, and the occasional footstool. <em>Sifu</em>’s difficulty is also underpinned by the challenging conversations happening around the game itself. As hard as <em>Sifu</em> is, and as thorny as the discourse surrounding its provenance and development are, <em>Sifu</em> succeeds in its attempt to capture the frenetic action of the kung fu film and tries to be a thoughtful and respectful portrayal of Chinese martial arts culture. But that authenticity and respect also exist in parallel with the game’s problems of representation.</p><p id=\"wBkYfk\"><a href=\"https://www.theverge.com/2021/12/15/22837639/sifu-preview-sloclap-games-playstation-epic-games-store\"><em>Sifu</em> is a playable martial arts flick</a>. It is <em>The 36th Chamber of Shaolin</em> meets <a href=\"https://www.theverge.com/2019/3/22/18277376/sekiro-shadows-die-twice-review-xbox-ps4-pc\"><em>Sekiro: Shadows Die Twice</em></a>, combining quick-hitting, one vs. many kung fu action with “the die and try again” aspect of a roguelike. You are tasked with eliminating five martial arts masters who murdered your father a training montage-appropriate number of years before. You would have also died that fateful night if not for a mysterious power that resurrected you, which forms the basis of the game’s unique structure.</p><p id=\"fFNASB\">In most roguelike games, you die early and often, with death resetting your progress, reviving slain enemies, and plopping you at some previous point. In <em>Sifu</em>, you will also die early and often, but with each death, you have the option to revive right where you fell, no enemy resets. This comes at a price. Each time you resurrect, you get older, and after a certain number of resurrects, your health decreases while your strength increases. So, starting at age 20, death provides both boon and bane until you’re tottering around in your 70s, able to punch a semi-truck but unable to withstand a stiff wind. It’s a neat little twist on the “fight, die, repeat” roguelike formula. Rather than death being a punishment, it functions as a bit of a buff. A miniboss I fought in my 20s took forever to take down, but when I fought that same enemy in my 50s, she went down in a couple of strikes. </p><div id=\"0BfXj2\"><div data-anthem-component=\"gallery:11015696\"></div></div><p id=\"eBY9Sd\">Do not approach <em>Sifu</em> with the same button-mash mentality of beat-em-ups like<em> Bayonetta</em> or <em>Devil May Cry</em>. <em>Sifu</em> is designed to be smarter than that. Any attempt to cheese will be swiftly and brutally punished. With the way your health bar melts after taking a couple of hits from the simplest of goons, <em>Sifu</em> feels like the rare game to acknowledge that getting punched in the face fucking hurts, and so the way to win is to avoid that at all costs. There’s a heavy emphasis on parrying, dodging, and using weapons to create distance between you and the folks who wanna kill you. </p><p id=\"jewaFZ\">Playing <em>Sifu</em> made me feel like Robert Downey Jr. in <em>Sherlock Holmes</em>. There’s a moment when he’s about to get into a fight with a larger, stronger enemy, and he mentally runs through a checklist of everything he has to do to prevail. In <em>Sifu</em>, it’s the same. </p><p id=\"ZbIfFl\"><em>The Club</em><br><em>Run down the steps</em><br><em>Three enemies: one minion behind counter, one elite, one minion at the door</em><br><em>Vault over counter staggering minion against the wall, easy take down</em><br><em>Grab bat before other two enemies notice</em><br><em>Beat elite with bat</em><br><em>Drop before dealing with minion to preserve bat durability for group of enemies behind the door</em></p><p id=\"rqHicA\">Your constant death and resurrection require you to create a step-by-step internal guide that will hopefully get you deeper into the level with minimal deaths. And while I appreciate that <em>Sifu </em>forces me to think strategically about each and every fight, it’s still prohibitively hard. It pains me to admit that I haven’t yet beaten the game, and there are only so many times I can redo the same level over and over before I put my head through a wall as I alluded to earlier. </p><p id=\"acDjgf\">The developers understand that <em>Sifu</em> is challenging. In an interview with <em>The Verge</em>, they said they want players to experience the intoxicating sense of triumph that comes with methodically learning a difficult enemy’s patterns and weaknesses to eventually win. Even still, they acknowledged some parts of<em> Sifu</em> are a little too tough and patched the game before release. I still haven’t made it beyond the second zone. There will be players who will enjoy this challenge, and for a while, I was one of them. But there’s a point when being hard for the sake of a potential payoff later wasn’t worth the time or frustration. </p><div><aside id=\"bllzac\"><q>Do not approach <em>Sifu</em> with the same button-mash mentality of beat-em-ups like<em> Bayonetta</em> or <em>Devil May Cry</em></q></aside></div><p id=\"LUzi9T\"><em>Sifu</em> comes from <em>Absolver</em> developer Sloclap, a Paris-based studio a part of the Kepler Interactive family of developers. For its second game, Sloclap wanted the same kind of martial arts action present in Absolver but without all the technical headaches that accompanied Absolver’s online PvP components. </p><p id=\"cxK0ch\">“We all shared a love for martial arts action movies,” Pierre Tarno, co-founder of Sloclap and <em>Sifu</em>’s executive director, told <em>The Verge</em>. “Ranging all the way from old Bruce Lee movies, to ’80s and ’90s Jackie Chan movies, Donnie Yen, and contemporary movies like <em>The Raid</em>. We were like, ‘Okay, let’s do a game that is a love letter to that cinema which we deeply love.’”</p><p id=\"wEb3JC\">To help translate the martial artistry of their beloved movies into video game form, Sloclap enlisted the help of Benjamin Colussi. Colussi is a French-born Pak Mei master who studied Pak (or Bak) Mei in China under the tutelage of Lao Wei San, son of Lao Siu Leung, who is commonly known as the father of the Foshan branch of Pak Mei. According to <a href=\"https://lwspakmei.com/en/the-school/\">Colussi’s website</a> and reiterated by Tarno, after learning Chinese and years of study, Colussi received the blessing of his Sifu (or mentor/master) Lao Wei San to open a Pak Mei school in France where he met and trained several Sloclap devs long before they would create <em>Sifu</em>.</p><div id=\"YMoOjT\"><div ><iframe src=\"https://www.youtube.com/embed/WMcjF-S6_cg?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"iYCUzl\">Which now brings us to <em>Sifu</em>’s other inherent difficulty: this is a Chinese story told almost exclusively by white men. As the video game industry (painfully, slowly) evolves beyond its old white boys’ club, it should be standard practice that a story about a culture, involving its mythologies, language, and sacred practices, intimately involves people of that culture. </p><p id=\"vQwaw9\">As news about <em>Sifu</em> slowly trickled out, some people accused the game of <a href=\"https://www.fanbyte.com/reviews/sifu-is-a-sharp-but-uncomfortable-action-movie/\">being appropriative</a> of Asian culture as <a href=\"https://www.thegamer.com/sifu-kungfu-brawler-sloclap-white-developers/\">it seemed no Asians were involved in making it</a>. That the game’s kung-fu consultant was also not Asian, and the fact that the game’s marketing swag box seems to be a mishmash of game-relevant items and a bunch of stuff that simply screams, “Let’s fill this with as many stereotypical Asian things as possible,” raised even more red flags. </p><div id=\"fbPwNu\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Sifu?src=hash&amp;ref_src=twsrc%5Etfw\">#Sifu</a> creator kit. <a href=\"https://t.co/45F4NElPa6\">pic.twitter.com/45F4NElPa6</a></p>— Janet Garcia (@Gameonysus) <a href=\"https://twitter.com/Gameonysus/status/1489438187470548997?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"cDY5tF\">“Our intention is to make something that is as authentic and respectful of Chinese kung fu culture as possible,” Tarno said. “Although we’ve got one concept artist on the team who’s of Chinese culture and descent, [who] was that first layer of how to get certain texts and details of the environment, right. But that was not enough for us. We wanted to go deeper.”</p><p id=\"EOuJdH\">To do that, Sloclap engaged others of Asian descent, including Anlu Liu of Kowloon Nights, a video game investment fund, and Richie Zhu of Kepler Interactive, Sloclap’s publishing partner. “Throughout the entire development of <em>Sifu</em>, we have constantly played builds and provided feedback,” Liu told <em>The Verge</em>. </p><p id=\"FuO3eo\">Both consulted on a number of issues related to gameplay and cultural elements, like correcting the order of characters on the coin talisman that holds your resurrection power. For the game’s pending Chinese localization, they helped select the Chinese voice actors and sat in on recording sessions to ensure the dialogue was representative of how Chinese people speak to each other. Liu and Zhu were also responsible for connecting Sloclap with consultants in China who provided feedback on everything down to the smallest detail. There’s an anecdote both Tarno and Liu shared about washing machines in the background of the game’s first level being swapped from front loading to top loading since the latter is the kind most Chinese would be familiar with. </p><div class=\"c-float-right\"><aside id=\"rf2IeU\"><q><em>Sifu</em> feels like the rare game to acknowledge that getting punched in the face fucking hurts</q></aside></div><p id=\"Bfqzgv\">When asked about their feelings about <em>Sifu</em>, both were excited by the prospect of having a proper kung fu game that has been taken as culturally seriously and sensitively as Sifu has been. “I was also very surprised by this game because there haven’t been any real authentic kung fu games since <em>Sleeping Dogs</em>,” Zhu said. </p><p id=\"F9DKsp\">From what Zhu told <em>The Verge</em>, Chinese netizens seem similarly excited about <em>Sifu</em>.</p><p id=\"ei61w7\">“I think a lot of people actually feel very proud of seeing China’s kung fu culture coming from a French studio putting so much effort into making this game,” Zhu said. </p><p id=\"wXbFwu\">And that’s great. That <em>Sifu</em> already seems to be receiving a warm reception in China, the birthplace of the martial arts movies from which it takes its inspiration, is awesome. </p><p id=\"Muyrrs\">However, the criticisms others have for the game cannot and should not be written off because, essentially, “Some Chinese people gave it a thumbs up.” Nor does the fact that only white guys made this game not being strictly correct in no way invalidates people’s distaste over seeing white people tell a non-white story.</p><div id=\"nDICeU\"><div ><iframe src=\"https://www.youtube.com/embed/w77IYxQpBOw?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"7VZBGG\">It is not my place to try to enumerate all of the criticisms my Asian colleagues have with<em> Sifu,</em> nor take a stab at Chinese diasporic conflicts and differences. I am a stranger, and that’s a conversation for family only — one that I hope will have more relevant voices as more people get their hands on <em>Sifu</em> post-release. As someone who is herself a part of a diaspora, I can at least explain why I think Chinese people in Asia might receive <em>Sifu</em> differently than Chinese people in the west. </p><p id=\"vzPcpO\">In the west, Chinese people and Asians in general are the minority. In every recent video game developer survey I could find, Asian people account for no more than 7 percent of the industry. The western video game industry is dominated by white folks telling white stories. And on the chance a developer decides to tell an Asian story, it’s done largely by predominantly white studios and filled with the same done-to-death trope of “family honor” that the story might as well be for white people, too. See also: <a href=\"https://bulletpointsmonthly.com/2020/08/28/end-of-honor-ghost-of-tsushima\"><em>Ghost of Tsushima</em></a>.</p><p id=\"23v0SR\">With this perspective in mind, it becomes easier to see how a Chinese person in Chicago might get more reflexively defensive about <em>Sifu</em> than a Chinese person in Shanghai. The latter can go about their day with the opportunity to see themselves expressing the length and breadth and depth of human emotion in every piece of media they consume. <em>Sifu</em>, to them, is just another tasty morsel on the buffet of representation they are served daily, while the Chinese Chicagoan starves for that very necessary and life-affirming piece of representation. And when it is occasionally given, it’s nearly always filtered through the narrow lens of family, honor, and duty. <em>Sifu</em>, then, becomes just one more way their cultural practices and aesthetics are flattened into the same one-note narrative.</p><p id=\"uFpTtK\">There’s also the notion of <em>who</em> gets to tell these stories and why. While it’s good to hear <em>Sifu</em> wasn’t created without assistance from Asian people, that’s not a replacement for having actual representation on the creative team. <em>Genshin Impact</em> aside, would an authentically Chinese game made by Chinese developers that has nothing to do with kung fu receive the same kind of attention, support, and funding <em>Sifu</em> has? Or is <em>Sifu </em>more palatable because of where and from whom it’s coming? </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/76VRLZz2O-As4da3Hgnsjb7l_nI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23223212/H4Fight.jpg\">  </figure><p id=\"1xCqOI\">I asked Tarno if his team is the best suited to tell the story<em> Sifu</em> is telling.</p><p id=\"4bSH2t\">“I can’t really answer this question. I just hope we did a good job basically,” he said. “The only thing I see is that, and which makes me happy is when I see comments that are translated from Chinese social networks of players who say, ‘We think it’s awesome that a studio on the other side of the world has been inspired by our culture and loves what comes from our countries.’”</p><p id=\"HvOx5W\">I do think Sloclap did their best. It’s obvious to see the love for martial arts movies when the game recreates the infamous hallway fight scene from Park Chan-wook’s <em>Oldboy</em>. I also think that despite developers and consultants doing their best, the criticisms facing <em>Sifu</em> are valid. <em>Sifu</em> is neither all good nor all bad. It just is, and it’s our job to listen to the people from the cultures <em>Sifu</em> pays homage. </p><p id=\"7WCKal\"></p><p id=\"6IPLBv\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UKVHJPmcJOLWcdV2NiAKE0_p1rI=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23222416/H3Atrium.jpg",
  "description": "Sifu might be too hard, even if you enjoy tough challenges.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}