{
  "title": "Sifu’s early access release is causing issues for some players on PlayStation",
  "url": "https://www.theverge.com/2022/2/6/22920844/sifu-early-access-release-playstation-problems",
  "date": "2022-02-06T22:36:30.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KMQmgjjkKpwgwl9uaggDSxOwQsw=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70477851/SIFU_Reveal_Screenshot_1920x1080_CorridorAfter.0.png\" />    </figure>  <p id=\"ChBNvR\"><a href=\"https://www.theverge.com/2021/12/15/22837639/sifu-preview-sloclap-games-playstation-epic-games-store\"><em>Sifu</em> was released today</a> for anyone who preordered the deluxe edition of the kung-fu action-adventure, but those who bought it on PlayStation experienced some trouble downloading it (via <a href=\"https://www.thegamer.com/sifu-early-access-cant-download-playstation/\"><em>TheGamer</em></a>). While PlayStation says it has since resolved the issue, it looks like there are still some players having problems accessing the game.</p><div id=\"kVrbtt\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The PlayStation teams have told us the early access issue is now resolved, and the game can now be downloaded! Again, we're very sorry to all players who were hoping to play earlier today, we'll have an exclusive gift for all Deluxe edition holders to share with you soon !</p>— SifuGame (@SifuGame) <a href=\"https://twitter.com/SifuGame/status/1490403045120827396?ref_src=twsrc%5Etfw\">February 6, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"WicJKa\">As a potential solution, Sloclap (the developers behind <em>Sifu</em>), suggests restarting your console and launching the game from your library. If you’re on a PS5, you can also try going to Settings &gt; Users and Accounts &gt; Other &gt; Restore Licenses, and then hitting “Restore” to begin the restoration process. (On a PS4, head to Settings &gt; Account Management &gt; Restore Licenses.)</p><p id=\"bBz38G\">It doesn’t seem like these solutions are working for everyone, unfortunately. If it’s still not working for you, <a href=\"https://twitter.com/SifuGame/status/1490428726680637448?s=20&amp;t=upNKCTedEgZGQT2GdoxMsA\"><em>Sifu’s</em> developers ask</a> that you DM them with your PlayStation Network ID, along with the region and whether you’re using a PS5 or PS4. Sloclap says it will relay this information to PlayStation engineers who “are tracking the problem.” Some users also suggest downloading a game that you currently don’t have from your PS Plus collection and then trying to install <em>Sifu</em>.</p><p id=\"GA7HFe\">Problems arose when the game was set to go live Sunday morning at 7AM ET. Users quickly noticed that the game’s countdown timer on the PlayStation Store — which should’ve ticked down to “00:00:00” this morning — was stuck several days in the future, barring players who preordered the game from downloading it.</p><div id=\"r2Sseh\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">Mine says it now is releasing in 13 days <a href=\"https://t.co/fQ4TZL9bPI\">pic.twitter.com/fQ4TZL9bPI</a></p>— Cinematteo Productions (@NickMatteo17) <a href=\"https://twitter.com/NickMatteo17/status/1490295914719764481?ref_src=twsrc%5Etfw\">February 6, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"pA53xm\">As <em>TheGamer</em> points out, it might have something to do with the PlayStation Store’s internal release date for the game. While some <a href=\"https://twitter.com/FilipDelic18/status/1490313350714208256?s=20&amp;t=mW5DfLHrTsELFh0EU_WyJg\">users report seeing a release date set in April</a>, others saw it set in late February, potentially due to an error with date formatting. In any case, we still don’t really know what went wrong. <em>The Verge</em> reached out to Sony and Sloclap with a request for comment but didn’t immediately hear back.</p><p id=\"TC1IqY\">I have to say, Sloclap has been on top of the issue from the very beginning, which is even more impressive considering the issue seems to be on Sony’s end (the game’s early access release went smoothly on the Epic Games Store). Soclap is also offering a free in-game gift as a sort of consolation prize, but that probably doesn’t make up for a whole day wasted of not being able to play the game a day early.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FIpML_OV1VIabfygLwJPK6fgetE=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23098541/SIFU_Reveal_Screenshot_1920x1080_CorridorAfter.png",
  "description": "The problem seems to be fixed for most players.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}