{
  "title": "Silent Hill is reportedly coming back with multiple new games",
  "url": "https://www.theverge.com/2022/5/16/23075106/silent-hill-leaked-screenshots-konami",
  "date": "2022-05-16T18:13:49.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"Silent Hill 3\" src=\"https://cdn.vox-cdn.com/thumbor/VHtPjP4sJWYX_8o8c8HQxIIxduw=/25x0:775x500/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70875361/silent_hill_kojipro.0.jpg\" />        <figcaption>Konami</figcaption>    </figure>  <p id=\"jbZa72\">Last week, leaked concept art revived fans’ hopes that a new <em>Silent Hill</em> game was in the works. Now, a <a href=\"https://www.videogameschronicle.com/news/konamis-silent-hill-plans-could-include-a-remake-full-sequel-and-episodic-stories/\"><em>VGC</em> report</a> is claiming that Konami is working on several entries in the survival horror series.</p><p id=\"cK8CY2\">On May 12th, Twitter user <a href=\"https://twitter.com/AestheticGamer1\">AestheticGamer1</a> shared four images that were allegedly from a new entry in the <em>Silent Hill </em>series. Shortly after he tweeted the images, they were removed for copyright reasons, adding fuel to the speculation that they were indeed what he claimed them to be. </p><div id=\"aMK4X5\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">(1/2) Silent Hill leak. There's a lot I'm not sharing for now. This is from a relatively new source for me, but I have been given more than enough proof to believe them. I also will mention the names \"Anita &amp; Maya\", \"SMS Messages\", &amp; this is not the only SH game in dev. The shots <a href=\"https://t.co/t5MWzNxfFS\">pic.twitter.com/t5MWzNxfFS</a></p>— AestheticGamer aka Dusk Golem (@AestheticGamer1) <a href=\"https://twitter.com/AestheticGamer1/status/1524939034056790016?ref_src=twsrc%5Etfw\">May 13, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"0fOv6q\">The four images featured a hallway shaded in red light covered in sticky notes, a garbage-strewn room that looks reminiscent of the house in <em>Resident Evil 7</em>, Japanese text over a desk covered in yet more garbage, and a picture of a young woman with peeling skin revealing written notes like, “I hate myself.”</p><div id=\"o5f07C\"><div data-anthem-component=\"gallery:11196012\"></div></div><p id=\"LADFiD\">AestheticGamer1, who has credibly leaked details in the past, did not provide additional context for the images, only that he had enough proof from his source to believe they were real. In his thread, he also revealed that this was not the only <em>Silent Hill </em>game in development, a statement this newest report from <em>VGC</em> possibly confirms.</p><p id=\"tP0Wvx\">The <em>VGC</em> report says that several of its sources, as well as notable video game insiders, have claimed that Bloober Team, the studio behind the <a href=\"https://www.theverge.com/22251159/the-medium-game-review-xbox-series-x-pc\">ho-hum horror game <em>The Medium</em></a><em>,</em> are working on a<em> Silent Hill 2</em> remake. This is seemingly backed up by the studio’s own CEO saying his team is working on “another gaming project, another horror IP” with a “very famous gaming publisher,” <a href=\"https://www.gamesindustry.biz/articles/2021-02-18-bloober-team-adding-action-to-its-psychological-horror-focus\">in an interview with <em>GI.biz</em></a>.</p><p id=\"2jNthe\">In addition to a brand new <em>Silent Hill</em> game and a <em>Silent Hill 2 </em>remake, there is possibly one more <em>Silent Hill </em>game in development — an episodic story-driven narrative game. The <em>VGC</em> report was light on details about this facet of the <em>Silent Hill</em> news, floating studios like Annapurna Interactive and Supermassive Games (both known for their high-concept, narrative-driven games) as potential partners. Unfortunately, it doesn’t seem like there’s been any work to revive <em>Silent Hills</em>, <a href=\"https://www.theverge.com/2015/4/27/8503181/silent-hills-cancelled\">the now-canceled game that Guillermo del Toro and Hideo Kojima were working on</a>. </p><p id=\"Kv2QXY\">Konami has not yet publicly commented on the leaks nor confirmed any new <em>Silent Hill</em> projects.</p><p id=\"2HomEG\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GD5OvwzNegApp_Jf8OXbgt8ScI8=/0x41:800x460/fit-in/1200x630/cdn.vox-cdn.com/assets/1450171/silent_hill_kojipro.jpg",
  "description": "According to a VGC report, three new Silent Hill games are potentially in the works",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}