{
  "title": "Skullcandy’s new Mod earbuds offer cheap multipoint Bluetooth support",
  "url": "https://www.theverge.com/2022/5/19/23130824/skullcandy-mod-wireless-earbuds-cheap-multipoint-bluetooth-support-headphones",
  "date": "2022-05-19T19:13:27.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vb0ccYuGjnp5MGioqLaFYUE-GdM=/1181x228:3339x1667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70888918/9f36142aa5337efb10c17091ffad58d7ac0a559b5620c84dea5f3796d2bde6d5.0.jpg\" />        <figcaption><em>Skullcandy’s new Mod earbuds are some of the cheapest to include multipoint Bluetooth connectivity.</em> | Image: Skullcandy</figcaption>    </figure>  <p id=\"u8Gc1N\">Skullcandy is continuing its trend of inexpensive, feature-rich earbuds with <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.skullcandy.com%2Fmod-wireless-earbuds%2F%23play&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F19%2F23130824%2Fskullcandy-mod-wireless-earbuds-cheap-multipoint-bluetooth-support-headphones\" rel=\"sponsored nofollow noopener\" target=\"_blank\">its latest offering, the Mod earbuds</a>. All of the standard fare is present here with IP55 weatherproofing and USB-C charging. The Mods also manage to pack in multipoint Bluetooth connectivity, which, as the name might suggest, lets you connect and listen to multiple devices at the same time. This isn’t a new feature to earbuds in general, but when those earbuds only cost $60, it's definitely worthy of attention.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OfNVu_Fb7E0Avi8lyy_b4buMm4Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23575228/55b2eeb610eca66ee0d9a6d4dd98c928660726b2434db4c09082ddb253a5d70d.jpg\">      <figcaption><em>You can have them in any color as long as it’s black.</em></figcaption>  </figure><p id=\"9P844Y\">Wireless earbuds have become the standard for answering calls, jamming out, or accessing voice assistants like Amazon’s Alexa and Google Assistant, which is why it's so common to see prices in excess of $100. It's even possible to shell out as much as $249.99 for something like the Apple AirPods Pro. There are plenty of budget-friendly options on the market, but very few can compete with the features offered by more expensive models. However, Skullcandy is shaking up that notion by offering a litany of features in a pair of earbuds that are remarkably inexpensive by comparison. Skullcandy has even rolled in Tile tracking that can be accessed via an app if you happen to misplace these earbuds.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tW41PpEjv0GyCboZQaI4UECVTD4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23575226/9500_16436.jpg\">      <figcaption><em>The Mods also come packaged with a variety of ear tips to ensure a comfortable fit.</em></figcaption>  </figure><p id=\"p1Vc48\">While Skullcandy has been known to produce products with some loud and outrageous designs, the Mod earbuds are extremely inoffensive in terms of their look and style. They don’t depart from what you’d expect from a pair of wireless earbuds and are currently only available in black. </p><p id=\"CqHhHx\">Because we have a tendency to use our wireless earbuds for a variety of tasks, multipoint Bluetooth connections have become an increasingly important feature. This feature allows your earbuds to remain connected to several devices at once and differentiate between audio sources. For instance, you can remain paired to your laptop and receive calls from your phone seamlessly, and your earbuds will know to drop the audio from your laptop when you pick up the phone.</p><p id=\"fGlzEj\">Rounding out its list of features, the Mods use Bluetooth 5.2 connectivity and can last for up to seven hours on a single charge with an additional 27 hours stored in the case. While they may lack active noise cancellation, the mics used by the Mods are capable of reducing background noise. You’ll also be able to access a hear-through mode either via the Skullcandy app or the touch controls built into the earbuds. The Mods aren’t blowing anyone away in terms of their features or curb appeal, but their low price point is certainly enough to get the attention of the more budget-conscious among us.    </p><aside id=\"fJhb41\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The best cheap wireless earbuds to buy in 2021\",\"url\":\"https://www.theverge.com/21575716/best-cheap-wireless-earbuds-budget\"}]}'></div></aside><p id=\"NswDH7\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/O-du0Rm65t7PQvPvc6jmlz3_KSg=/1181x382:3339x1512/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23574853/9f36142aa5337efb10c17091ffad58d7ac0a559b5620c84dea5f3796d2bde6d5.jpg",
  "description": "Pair with two devices simultaneously.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}