{
  "title": "Slack is struggling this morning",
  "url": "https://www.theverge.com/2022/3/9/22968785/slack-down-outage-messages-edit-chat-connection-problem",
  "date": "2022-03-09T14:46:26.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/utnzCtR13tt3OrBibDUuU3UUFcg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70598757/acastro_200331_1777_slack_0001.0.0.jpg\" />    </figure>  <p id=\"gbHvLd\">Some people are back in the office while others are operating remotely, but for many workers, no matter where they are, Slack is still a default method of communication, and on this Wednesday morning, it is not working very well. </p><p id=\"MrKTzs\">Complaints in <em>The Verge</em> Slack channels mention messages failing to send or edits that the app just won’t update, and over the last few hours, <a href=\"https://status.slack.com/2022-03/8a9e98bfaa32ef5f\">the company has confirmed</a> it’s working to fix problems affecting “calls, huddles, email processing, file uploads, emoji reactions retention, new DM groups retention in sidebar, Search, Workflow builder, Workflow pop out windows, Channel creation, API errors, webhooks and Slack Connect invites.”</p><div class=\"c-float-right\"><div id=\"7NQSKg\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some customers may be experiencing intermittent issues using Slack. We apologize for the trouble. We're working to resolve this as fast as we can. <a href=\"https://t.co/u6xkK8zrSq\">https://t.co/u6xkK8zrSq</a></p>— Slack Status (@SlackStatus) <a href=\"https://twitter.com/SlackStatus/status/1501532448198332417?ref_src=twsrc%5Etfw\">March 9, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"a4aIdM\">Slack’s first report of the issue went up at 5:49AM ET, and its most recent update at 9:22AM ET says only that its support team is continuing to investigate the issue, with no ETA for a fix.</p><blockquote><p id=\"j0gWul\">We’re still investigating the issue affecting some of our features (calls, huddles, email processing, file uploads, emoji reactions retention, new DM groups retention in sidebar, Search, Workflow builder, Channel creation, API errors, webhooks, invites and admin actions). Thanks for sticking with us as we continue to work on a fix.</p></blockquote><p id=\"1yUl6L\">Yesterday, <a href=\"https://www.theverge.com/2022/3/8/22967531/spotify-discord-logout-outage-offline-server-problem\">a Google Cloud glitch pulled down Spotify and Discord for a while</a>, but it’s unclear what might be the cause of today’s Slack disconnections. Anyway, if your boss sent you a message and you forgot to respond, just toss them this leak — for now, you have a verifiable excuse for missing a notification or two.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DWGn46gt65ygdtO3AfhT5jOgTfY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19861741/acastro_200331_1777_slack_0001.0.jpg",
  "description": "It’s not your computer — Slack is (at least partially) down.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}