{
  "title": "Slack overhauls iPad app with interface inspired by its desktop app",
  "url": "https://www.theverge.com/2022/3/16/22978839/slack-ipad-app-update-two-columns-accessibility-sidebar",
  "date": "2022-03-16T15:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mXRT_L-LvOP7w8AronbjOL6rSlo=/0x0:1242x828/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70630097/1QuickAccess_02_2x.0.jpg\" />        <figcaption><em>Slack’s upgraded iPad interface.</em> | Image: Slack</figcaption>    </figure>  <p id=\"iOA1U4\">Slack is giving its iPad app a much needed upgrade that will see it inherit many features of its desktop version, the <a href=\"https://slack.com/blog/news/ipad-app-new-look-improved-functionaility\">company has announced</a>. The app is getting a new two-column layout that shows a list of available channels and messages on the left, and their contents on the right. The left-hand sidebar is also being updated, and the app is getting better support for accessibility features like Apple’s VoiceOver screen reader. </p><p id=\"XZ1aNs\">None of these are particularly revolutionary features, but they’re welcome additions to an iPad app that can sometimes feel more like a giant iPhone app. Slack is marketing the update as serving the needs of newly emerging hybrid workplaces, which should hopefully make it easier to keep up with workplace conversations while on the go. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-ulitv6SvYIIAIJk8J9VPR0-iH4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23317154/ezgif.com_gif_maker.gif\">      <cite>Image: Slack</cite>      <figcaption><em>The upgraded iPad app sidebar in action.</em></figcaption>  </figure><p id=\"AAYK8D\">The Slack iPad app’s upgraded sidebar sounds particularly useful. Sections are collapsible if you want to hide groups of channels; channel names can be long-pressed to access a context menu; and usernames will now include avatars in direct messages, making them easier to identify at a glance. The way sections are set up should also now sync with Slack’s desktop version, to make it easier to keep everything neat and tidy. </p><p id=\"ZOzYJi\">Finally, there are also accessibility improvements. Support for Apple’s VoiceOver screen reader has been improved, as well as Dynamic Type font-scaling to make text easier to read. </p><p id=\"DErxzV\">Slack says the new iPad version should be available to download today, with further improvements — such as support for keyboard shortcuts and “additional support for accessories” — coming later in the year.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7mobRNamplqDiAQ2U2av2PBzn6A=/0x89:1242x739/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23317153/1QuickAccess_02_2x.jpg",
  "description": "A long overdue update.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}