{
  "title": "Slaying monsters in Vampire Survivors is like walking through a casino",
  "url": "https://www.theverge.com/2022/2/19/22941145/vampire-survivors-early-access-steam-pc-mac-luca-galante",
  "date": "2022-02-19T14:00:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xaarlCVc_d3Z1XBayQa7Oj4pogc=/61x0:1797x1157/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70528775/Screen_Shot_2022_02_14_at_7.06.54_PM.0.png\" />        <figcaption><em>Look at all the numbers!</em> | Screenshot by Jay Peters / The Verge</figcaption>    </figure>  <p id=\"Ox87Bz\"><em>Vampire Survivors</em> is an Early Access roguelike on Steam that has completely sunk its teeth into me.</p><p id=\"PAIBiQ\">Each round starts simply: you have just one weapon to take on a few baddies. The weapon autofires, so you only have to worry about moving your character to avoid enemies and scoop up experience gems. But as you level up, get more weapons, and fight more monsters, your screen quickly becomes filled with a smorgasbord of magical weapons and fearsome enemies covering nearly every inch of the screen. Like so:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2j_vfOZS2xOCYdpln0tzsc96urI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23255504/Screen_Shot_2022_02_17_at_2.57.40_PM.png\">      <cite>Screenshot by Jay Peters / The Verge</cite>      <figcaption><em>Despite this apparent chaos, I promise you I felt fully in control.</em></figcaption>  </figure><p id=\"85Kdfd\">The sensory barrage of colors and sounds can almost feel like being in an arcade or a casino — which is what Luca Galante, <em>Vampire Survivors</em>’ developer, was going for. Galante previously worked as a software developer in the gambling industry, and that experience informed his perspective when it came to making a more traditional game.</p><p id=\"SShrVT\">“Slot games are very simple,” he tells <em>The Verge</em>. “All the player has to do is press one button, and the game designers have to find a way to push the player to press that button. [The player] is actually spending money every time they press it, and because of that, there’s a huge attention to detail on the sounds, the animations, and the sequences, because you have so few elements to work with. Basically, [the designers] try to maximize the importance and impact those elements have on the player. I just absorbed that knowledge basically just by being in the industry. And so when making a game, I have automatically applied it to what [I’ve been] doing.” </p><p id=\"QV9GRe\">That’s all reflected in <em>Vampire Survivors</em>. Starting a game immediately drops you into the action, and the only controls to think about are moving your character and picking upgrades. You don’t even need to press a button to use your weapons. The charming retro graphics feel like they’re ripped straight from a long-forgotten Super Nintendo <em>Castlevania</em> game, and you’ll hear a delightful chime every time you pick up one of the countless experience gems. Opening treasure chests seems to intentionally create the feeling that you’re pulling a slot machine; pixelated weapons stream by on ribbons of color as coins fly everywhere, all backed by a catchy jingle. (If you get lucky and find a chest with five items, there are actually fireworks.)</p><p id=\"uZTUkn\">Galante also analyzed other games he likes for inspiration. “The main one was <em>Magic Survival</em>, which is a game on Android that plays exactly the same,” he said. “The prototype of <em>Vampire Survivors</em> was based on <em>Magic Survival</em>. When it comes to the elements that are more unique to [<em>Vampire Survivors</em>] — for the gameplay, for the impact and how it feels good to play — I play a lot of stuff like <em>Bayonetta</em>, <em>Devil May Cry</em> games that are actually rather complex and that ask a lot of effort from the players to get some strong feedback. Instead, I just made it very easy for the player to actually get the same kind of strong feedback.”</p><p id=\"Ihr3iT\">As for the <em>Castlevania</em>-esque visuals, they were much less intentional. “I just took an asset pack I liked, and that asset pack turned out to be <em>Castlevania</em>-inspired,” Galante explains. “I like the series, of course, I know the lore of the series. So from there, it just started to become a part of the game. I definitely got inspired by a lot of different things, a lot of different games, and there are references to a lot of other games, just because at the end of the day, playing games is my main hobby.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4BRE9vVXkHXqT7Mpf7Key3jqENQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23255513/Screen_Shot_2022_02_16_at_7.21.43_PM.png\">      <cite>Screenshot by Jay Peters / The Verge</cite>      <figcaption><em>Enemies are manageable to start, but eventually you’ll be taking on many more of them at once.</em></figcaption>  </figure><p id=\"4q2l91\"><em>Vampire Survivors</em> has been a huge success, despite only being available in Early Access since December. When I checked <a href=\"https://store.steampowered.com/stats/Steam-Game-and-Player-Statistics\">Steam’s stats on Friday</a>, there were more people playing it than heavyweights like <em>Terraria</em>, <em>Skyrim</em>, <em>Left 4 Dead 2</em>, and even <em>Rocket League</em>. Galante started the game in December 2020 when he was unemployed, but it’s been big enough that he was able to leave a new job in January after just a week. </p><p id=\"t2OiOk\"><em>Vampire Survivors</em> is $3 right now on PC and Mac, and Galante plans to raise the price as he adds more features. He hopes to bring the game out of Early Access this year. He has already updated the game many times, often adding with major additions like weapons, characters, and quality-of-life fixes. It seems like that cadence will continue, meaning you’ll likely have plenty of reasons over time to pull the figurative slot machine again for a round of chaotic monster slaying. And if you just want to see what <em>Vampire Survivors </em>is all about, <a href=\"https://poncle.itch.io/vampire-survivors\">you can try it for free on itch.io, too</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Lz90OxOOM_J5MhqUI8Ni_aNnUFA=/0x93:1857x1065/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23255507/Screen_Shot_2022_02_14_at_7.06.54_PM.png",
  "description": "Runs can become a delightful sensory barrage.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}