{
  "title": "Smart devices and the fight against climate change ",
  "url": "https://www.theverge.com/2022/4/5/23011341/smart-devices-climate-change-report",
  "date": "2022-04-05T18:27:35.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Green Thermostat\" src=\"https://cdn.vox-cdn.com/thumbor/fDRhXQ1J6zp8NuJllqd7C1PbcPI=/91x0:4843x3168/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70713380/841564696.0.jpg\" />        <figcaption>TORONTO, ON - AUGUST, 30 Diana Carradine with Ecobee smart thermostat in her home in the Eglinton and Avenue road area. The province is launching the Green Ontario Fund, bankrolled with $377 milion in cap-and-trade revenues, to help homeowners and businesses with programs to reduce their greenhouse gas emissions. The first move is offering free smart thermostats to eligible homeowners, so they can more easily turn down the heat or air conditioning when they’re not home — saving on natural gas and electricity. | Richard Lautens/Toronto Star via Getty Images</figcaption>    </figure>  <p id=\"kuZwwc\">Smart devices have a role to play in the move from dirty to clean energy,<strong> </strong>according to a major new climate <a href=\"https://www.ipcc.ch/report/ar6/wg3/\">report</a> <a href=\"https://www.theverge.com/2022/4/4/23009804/united-nations-climate-change-report-greenhouse-emissions-2030-ipcc\">released this week</a>. People need tools that help them better understand where their energy comes from, see how much they’re using, and pitch in to make a more resilient power grid.</p><p id=\"Ba4x0H\">“Digital technologies can contribute” to the fight to stop climate change, the report released yesterday by the United Nations Intergovernmental Panel on Climate Change (IPCC) says. That contribution can include smart appliances that make homes more energy-efficient or rooftop solar panels that work in tandem as “virtual power plants.” Those technologies have the power to cut down greenhouse gas emissions and transform the electric grid. </p><div class=\"c-float-right\"><aside id=\"Pv9pxJ\"><q>Smart devices have a role to play in the move from dirty to clean energy</q></aside></div><p id=\"XtjqJL\">To avoid climate change so intense that humans and ecosystems would struggle to adapt, the report says, humans need to slash their planet-heating pollution in half this decade. Hundreds of leading climate scientists who authored the report call for those emissions to peak before 2025 and then virtually vanish by 2050. Meeting those goals will mean<strong> </strong>major changes for how we power our homes and devices. Not only do we need to replace fossil fuels with clean energy, but we also have to use less energy in the first place. </p><p id=\"5sey54\">That’s where smart devices could play a role. If they connect to a smarter grid in the future — one powered by clean energy — they can work with the grid to cut down on both energy and pollution.  </p><p id=\"gENn99\">A <a href=\"https://www.theverge.com/22419206/smart-grid-renewable-energy-power-sector\">clean grid will most likely need to be a smart one</a>. A smart grid could be in constant conversation with smart devices in your home, like thermostats. That way, your home doesn’t waste energy, for instance, heating or cooling empty rooms. It can also schedule charging for, say, an EV or other devices to times in the day when renewable energy is most abundant. </p><p id=\"Y9giil\">That’s an especially helpful feature for balancing the demand and supply of wind and solar energy, which ebb and flow with the weather. Those smarts can even make the grid <a href=\"https://www.theverge.com/2021/2/17/22288292/texas-grid-upgrade-disaster-planning-power-outage-energy-crisis\">more reliable</a> since too much energy demand and not enough supply can lead to blackouts. Consumers would <a href=\"https://www.vox.com/recode/22543678/smart-thermostat-air-conditioner-texas-heatwave\">first need to be on board</a> for this, of course. But if many households on the same grid could work together, these small changes at home could reduce greenhouse gas emissions while making the grid more resilient to climate change.   </p><p id=\"bqDIrU\">Being better prepared in the event of a blackout is crucial as climate-related disasters like wildfires and storms place more stress on grids. If your EV is already in regular communication with the grid, utilities might reach out to ask if its battery can <a href=\"https://www.theverge.com/2020/9/23/21451642/tesla-ev-electric-vehicle-energy-grid-battery-day-elon-musk\">send power back</a> to the grid for another customer in need. </p><div id=\"OglKnG\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Powering a real city with a virtual power plant|95786\" data-volume-uuid=\"e9cbe1c6a\" data-volume-id=\"95786\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-811\" class=\"volume-video\" data-volume-player-choice=\"youtube\"></div></div><p id=\"69XO8d\">Even better, <a href=\"https://www.theverge.com/2022/3/8/22965919/gm-pge-ev-charging-grid-home-california\">fleets of EVs</a> can band together to become a virtual power plant. The power their batteries store, combined, can be a resource the grid taps in times of disaster. The same sort of thing can be done with<a href=\"https://www.theverge.com/2020/8/27/21403271/virtual-power-plants-california-apartment-buildings-solar-energy\"> solar panels and batteries</a> strewn across <a href=\"https://www.theverge.com/2019/8/28/20835786/sonnen-solar-vpp-battery-power-renewable-energy-utah\">neighborhoods</a> but still in virtual conversation with one another and utilities. What’s more, these virtual power plants could potentially replace dirty gas-fired “peaker” plants that have historically stepped in to provide excess power when needed.</p><p id=\"fmOdsz\">While those are exciting possibilities, there are caveats that the new climate report points out. “Digital technology supports decarbonisation only if appropriately governed,” the report authors write. E-waste is a <a href=\"https://www.theverge.com/21309776/record-amount-ewaste-2019-global-report-environment-health\">growing problem</a>, and many countries still <a href=\"https://www.theverge.com/2019/12/4/20992240/e-waste-recycling-electronic-basel-convention-crime-total-reclaim-fraud\">lack policies</a> to stop old devices from becoming <a href=\"https://www.youtube.com/watch?v=vufLW4xOsS4\">heaps of toxic trash</a>. Devices also need to be <a href=\"https://www.theverge.com/2022/3/8/22949669/apple-microsoft-google-repairability-index-ranking\">designed to be longer-lasting</a> to cut down on both e-waste and the greenhouse gas pollution associated with shipping and manufacturing new goods. </p><p id=\"O89i70\">Smart homes and devices obviously won’t save the planet on their own, but with careful planning, they could play their part.</p><p id=\"NT9Rfa\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/O-3k84ixJvjMAqgpLs34Zyity28=/0x293:4933x2876/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23368964/841564696.jpg",
  "description": "With careful planning, smart homes can help transform the grid.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}