{
  "title": "Snap CEO Evan Spiegel thinks the metaverse is ‘ambiguous and hypothetical’",
  "url": "https://www.theverge.com/2022/4/28/23046594/snap-evan-spiegel-metaverse-pixy-ar-interview",
  "date": "2022-04-28T23:11:24.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Snap, Inc. Hosts Virtual Snap Partner Summit\" src=\"https://cdn.vox-cdn.com/thumbor/VHYbN0O9Wfg3ZnO0MTlC5Elahsk=/0x0:3240x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70807402/1394250228.0.jpg\" />        <figcaption><em>CEO of Snap Inc. Evan Spiegel presents at the livestreamed Snap Partner Summit 2022</em> | Photo by Snap, Inc./Getty Images for Snap, Inc.</figcaption>    </figure>  <p id=\"FSP7Wu\">Snap isn’t the only social media company with smart glasses and an expanding hardware portfolio, but what’s separating its approach from Meta? While announcing <a href=\"https://www.theverge.com/2022/4/28/23043011/snapchat-pixy-drone-hands-on\">Pixy, a $229 drone that takes off from your hand</a> to capture selfies, Snap CEO Evan Spiegel spent some time explaining his decision to focus on experiences built for the real world instead of the virtual metaverse. </p><p id=\"oOugmI\">“The reason why we don’t use that word is because it’s pretty ambiguous and hypothetical,” he told <a href=\"https://www.theguardian.com/technology/2022/apr/28/snapchat-evan-spiegel-dismisses-facebook-metaverse-hypothetical\"><em>The Guardian</em></a><em>. “</em>Just ask a room of people how to define it, and everyone’s definition is totally different.”</p><div class=\"c-float-right\"><aside id=\"mwDZZb\"><q>“Just ask a room of people how to define it, and everyone’s definition is totally different.”</q></aside></div><p id=\"rfgtyr\">Spiegel also told <em>The Verge’s </em>Alex Heath that companies making metaverse pitches “are really talking about something that doesn’t exist yet,” as opposed to augmented reality, where “there are 250 million people engaging with AR every day in just the Snapchat application.” Those AR interactions include everything from the goofy selfie effects that Snap made popular years ago to <a href=\"https://www.theverge.com/2022/4/28/23046385/snap-dress-up-ar-shopping\">more advanced shopping experiences</a>.</p><aside id=\"65gUr7\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Snap Pixy: hands-on with Snapchat’s selfie drone\",\"url\":\"https://www.theverge.com/2022/4/28/23043011/snapchat-pixy-drone-hands-on\"}]}'></div></aside><p id=\"FraFi4\">While they disagree on the metaverse, Spiegel and Mark Zuckerberg agree that AR glasses will one day be big. Zuckerberg has called them the “holy grail” device, and Spiegel has said AR glasses will be key to overlaying computing on the world around you. Zuckerberg’s first true pair of AR glasses aren’t coming until at least 2024, while Spiegel already has <a href=\"https://www.theverge.com/22819963/snap-ar-spectacles-glasses-hands-on-pictures-design-features\">AR Spectacles being tested by developers today</a>.</p><p id=\"2fwKgz\">Zuckerberg’s vision of the future also includes virtual reality headsets to power <a href=\"https://www.theverge.com/2022/4/27/23045274/zuckerberg-says-meta-will-slow-spending-first-quarter-earnings\">the metaverse he’s spending billions of dollars to build</a>. He calls it an “embodied internet” full of holograms and virtual board rooms people will increasingly spend time in through headsets strapped to their faces. It’s a maximalist, escapist vision of where the internet, and how we interact with it, is headed.</p><aside id=\"9L1TRo\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Mark Zuckerberg’s augmented reality  \",\"url\":\"https://www.theverge.com/23022611/meta-facebook-nazare-ar-glasses-roadmap-2024\"}]}'></div></aside><p id=\"pueQTQ\">By contrast, here’s what Spiegel told <em>The Verge’s </em>Heath<em> </em>last week: “Our fundamental thesis and our big bet is on the real world, and that people really enjoy spending time together in reality. And that computing can really enhance that, [and] make that more fun and contribute to shared experiences.” </p><p id=\"assn3b\">“But, ultimately, people are going to spend the vast majority of their time in the world because it’s really a wonderful place...And that’s why we talk with a lot of specificity about the products we have today, about the solutions that exist today, and about the way that people are using our products, rather than talking in hypotheticals.”</p><p id=\"tigRhe\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/w9z7-q0rS3yyy-uAgeP_Qjn1Lk4=/0x0:3840x2010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23423932/1394250228.jpg",
  "description": "Snapchat is placing its ‘big bet’ on the real world",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}