{
  "title": "Snapchat’s new tool builds Stories based on ESPN, Bloomberg, and Vogue articles",
  "url": "https://www.theverge.com/2022/4/12/23022005/snap-dynamic-stories-newsrooms-rss",
  "date": "2022-04-12T17:07:23.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nMKdxDjMIPMwLvcLt3t80AliFKI=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740641/Dynamic_Stories_US.0.png\" />    </figure>  <p id=\"m9QLpZ\">A new feature from Snap will let publishers on Snapchat automatically create posts based on stories published to a website. <a href=\"https://www.axios.com/snapchat-newsrooms-automated-dynamic-stories-bb20eef9-cb33-4ea2-adf8-dccb02d0883b.html\">According to <em>Axios</em></a>, more than 40 publishers from the US, the UK, France, and India will begin using <a href=\"https://newsroom.snap.com/discover-dynamic-stories\">Dynamic Stories</a> to automatically share published content to Snapchat.</p><p id=\"WziYVT\">Dynamic Stories uses a publisher’s RSS feed to create posts that go directly on a newsroom’s Snapchat Stories. Early partners include CNN, ESPN, <em>The Washington Post, </em>British<em> Vogue, </em>and more.</p><p id=\"5upw3m\">“By tying publishing on Snapchat into our partners’ existing workflow, we’ve created an easy way for them to create daily content and significantly lower costs,” Snap says in an announcement. “This new format will also play a significant role in supporting our continued effort to bring local content to our community across the globe.”</p><p id=\"0yAIes\">The company says the new feature will make it easier for Snapchat users to keep up with breaking news from credible sources as it’s being reported. </p><p id=\"yLEKNQ\">Dynamic Stories from publishers appear on a Snapchat user’s Discover feed and update in real time as news breaks. Users can tap on a publisher’s Stories, read a headline, and swipe up to read the full story. Only verified publishers and creators appear on the Discover tab, Snap says. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bP_WaHBVbORkxB_aY2OWYtlfKCI=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23384359/Dynamic_Stories_US.png",
  "description": "Early partners include Bloomberg, Vogue, and ESPN.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}