{
  "title": "Snapchat now lets you share YouTube videos as a sticker in your snap",
  "url": "https://www.theverge.com/2022/4/2/23007949/snapchat-share-youtube-videos-sticker",
  "date": "2022-04-02T22:30:13.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2Depc4SPwVYys4lc_2kIPOJ6BTY=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70703307/snapchat_youtube_links_sticker.0.jpg\" />        <figcaption><em>YouTube videos will now appear as a resizable sticker.</em> | Image by Snapchat</figcaption>    </figure>  <p id=\"vDGVLg\"><a href=\"https://newsroom.snap.com/youtube-creativekit-integration\">Snapchat is making it easier to share YouTube videos</a> within your snap or story, letting you bypass the process of copying, pasting, and attaching the video as a link (via <a href=\"https://www.androidpolice.com/snapchat-integrates-youtube-sharing/\"><em>Android Police</em></a>). The feature is available on both Android and iOS.</p><p id=\"v04Hww\">Now all you need to do is navigate to YouTube, hit the “Share” button, and then select “Snapchat.” Snapchat will open, and the video will automatically appear in your camera as its own sticker, showing the name, thumbnail, and creator of the video. After you take your picture or video, you can play around with the size of the sticker, rotate it, and place it anywhere on the screen. Anyone who views your snap or story can click on the link and view the video within the YouTube app or in their web browser.</p><div class=\"c-float-right\"><aside id=\"rlSe6g\"><q>The new sticker gives you a clearer look at the video’s thumbnail</q></aside></div><p id=\"4ARnbO\">If you ever tried to include a YouTube video before, you’ll probably recall having to copy the link from YouTube and then open Snapchat, where you’d have to take your photo or video, hit the paperclip icon, and paste the link in (or give Snapchat access to your clipboard). The video would appear as a resizeable banner, showing a small thumbnail along with the title of the video.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IEKhb5XKlozRwWS0SIFzAdj1grs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23363374/snapchat_youtube_sticker.jpg\">      <cite>Screenshot: Snapchat</cite>      <figcaption><em>Snapchat’s new YouTube sticker (left) vs. a YouTube video added as a link in Snapchat (right).</em></figcaption>  </figure><p id=\"nhQl5Z\">You can still add YouTube videos like this, but in my opinion, it just doesn't look as aesthetically pleasing as this YouTube-specific sticker. The new sticker gives you a clearer look at the video’s thumbnail, and actually shows you the name of the creator behind the video, whereas the plain old link format left that — sometimes crucial — piece of information out. <a href=\"https://www.theverge.com/2020/12/10/22166657/twitter-share-tweets-snapchat-snap-ios-feature-launch\">Snapchat similarly made a sticker for Twitter</a> in 2020, saving you from sending screenshots of tweets, or god forbid, taking a picture of a tweet on your computer screen.</p><p id=\"d4nsSw\"><em><strong>Update April 2nd 6:48PM ET:</strong></em><em> Updated to add a screenshot to compare the YouTube sticker in Snapchat with a link to a YouTube video in Snapchat.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SuzW3F-ru3MjaEibmW3U1I1NJYs=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23363161/snapchat_youtube_links_sticker.jpg",
  "description": "You no longer have to paste YouTube videos into your snap.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}