{
  "title": "Snapchat will put ads within stories and share the money with creators",
  "url": "https://www.theverge.com/2022/2/14/22927656/snapchat-snap-stars-stories-ads",
  "date": "2022-02-14T14:00:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"The Snapchat white ghost logo on a bright yellow background.\" src=\"https://cdn.vox-cdn.com/thumbor/L4O9cuauykWo-8yGTQR2bcPaLMI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70506765/snapChatPattern_BW.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"fOqAcN\">Snapchat is introducing a new way for creators on the app to earn money. The platform is testing mid-roll ads that appear in the Stories of a small group of US creators, with a wider rollout happening in the coming months.</p><p id=\"2fXs6h\">When an ad is placed within a Snap Star’s Story, Snapchat will share the revenue with the creators. The company says the revenue share is based on a formula that takes into account metrics like posting frequency and engagement. The feature is only available to Snap Stars, who are creators or public figures with large followings that have been verified on Snapchat, indicated by a gold star.</p><p id=\"PhBJeB\">In recent years, Snapchat has added various ways for creators to monetize their presence on the app. Snapchat users already see ads in between friends’ Stories and on the Discover section, but this is the first time creators will get a cut of the ad revenue on Stories.</p><p id=\"eL94aJ\">This comes shortly after Snapchat signaled that users were moving toward TikTok-esque content over Stories. Snap CEO Evan Spiegel <a href=\"https://www.theverge.com/creators/2022/2/3/22916642/snapchat-and-facebook-future-of-social-media-tiktok\">told investors earlier this month</a> that users are spending less time posting and viewing stories and instead watching content on Spotlight, Snapchat’s TikTok equivalent. </p><p id=\"L5OxdY\">In an effort to entice users to create more vertical video content for Spotlight, the company announced it would pay out $1 million per day through the end of 2020. Now, Snapchat says it pays millions of dollars a month to creators making top Spotlight videos. Last year, Snapchat announced Spotlight Challenges — cash prizes for users creating top videos using specific lenses, sounds, or topics. The company says it paid out more than $250 million to creators in 2021.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/xs4HuQvReou8Jq4wvSvaDDk6WRk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9030239/snapChatPattern_BW.jpg",
  "description": "A small group of verified users are part of the beta test.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}