{
  "title": "Snapchat and Facebook agree that the future of social media looks like TikTok",
  "url": "https://www.theverge.com/creators/2022/2/3/22916642/snapchat-and-facebook-future-of-social-media-tiktok",
  "date": "2022-02-03T22:51:45.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"Tessellated TikTok logos against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/S_jmVfrY0emjUeAcC-OHOBlcfOc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70468777/acastro_190723_1777_tiktok_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"EGmMHg\">Snapchat invented the Stories format of sharing pictures and videos that disappear. Now the company is indicating, along with Facebook, that the future of social media looks more like TikTok.</p><p id=\"IZ48NG\">In remarks to investors for its quarterly earnings report on Thursday, Snap CEO Evan Spiegel said that less time is being spent watching Stories from friends in the app, even though the company had hoped Stories engagement would pick up as pandemic lockdowns eased and people started leaving their houses more. Instead, Snapchat users are increasingly flocking to watch videos on Spotlight, Snapchat’s TikTok rival for viewing viral videos posted by random creators, and its Discover section for premium shows.</p><p id=\"dJubhu\">“This is a continuation of the trend we have observed throughout the pandemic, and friend story posting and viewing per daily active user have not returned to pre-pandemic levels,” Spiegel said in his comments to investors. “While we are hopeful our community will in time return to the friends story behaviors that we observed prior to the pandemic, we are focused on innovating on our content offerings to better serve our community today.”</p><div class=\"c-float-right\"><aside id=\"HVQrcy\"><q>“People have a lot of choices for how they want to spend their time, and apps like TikTok are growing very quickly.”</q></aside></div><p id=\"wsJttg\">While Snap hasn’t detailed exactly what the changes to its content section will look like yet, it’s easy to imagine the tab looking more like TikTok by opening to fullscreen videos from Spotlight creators, with the ability to dive deeper into longer Discover shows. Spiegel highlighted that some Spotlight creators already have their own reoccurring shows in the app, supporting “our vision of Spotlight as a platform where audiences can discover new Creators, topics, and communities, and then engage with them more deeply on Discover.”’</p><p id=\"rVRLH6\">Mark Zuckerberg, the CEO of Facebook parent company Meta, also identified TikTok as a formidable threat this week. “People have a lot of choices for how they want to spend their time, and apps like TikTok are growing very quickly,” he said during Meta’s fourth-quarter earnings call on Wednesday. Unlike Snap, which is still growing its user base and showing better-than-expected revenue growth, Meta disappointed investors <a href=\"https://www.theverge.com/2022/2/2/22914970/facebook-app-loses-daily-users-first-time-earnings\">with its earnings report this week</a>, wiping out more than $200 billion of its market value in a day — beating the record it previously set in 2018.</p><p id=\"gXGpMA\">So while Snap and Meta’s business performance is divulging, it’s notable that they both see TikTok as competition. Compelling new formats, whether it’s Stories or the TikTok video feed, have the potential to shift user attention quickly. Snap invented a format that’s now ubiquitous, but now it and Meta are playing catch up.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gGRtqOl8BuJLKbMIib87tuEQrq0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331847/acastro_190723_1777_tiktok_0001.0.jpg",
  "description": "\"People have a lot of choices for how they want to spend their time, and apps like TikTok are growing very quickly.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}