{
  "title": "Snap didn’t make enough Pixy drones, but won’t say how many it made",
  "url": "https://www.theverge.com/2022/5/6/23059094/snap-pixy-drone-camera-shipping",
  "date": "2022-05-06T23:02:56.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ws-UtuJgmVrvayCaEJuGEwMaOCQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70841795/vpavic_220418_5168_0131.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"m08kVs\">Snap’s new flying camera, the $230 Pixy drone, went on sale last week — but the earliest buyers were told they’d have to wait three months to actually get the gadget. We’re now thinking that the company didn’t make enough, because Snap has extended the Pixy’s shipping time to four whole months, <a href=\"https://pixy.com/shop\">according to the drone’s website</a>.</p><div id=\"Ea9hxa\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Estimated shipment in 15-16 weeks for the Pixy drone, per Snap’s website<br><br>“Honestly, in hindsight, we probably should have made more,” Evan Spiegel told me before the launch <a href=\"https://t.co/7ePpWWUimA\">https://t.co/7ePpWWUimA</a> <a href=\"https://t.co/ACON9SlJ2A\">https://t.co/ACON9SlJ2A</a></p>— Alex Heath (@alexeheath) <a href=\"https://twitter.com/alexeheath/status/1521888341767036928?ref_src=twsrc%5Etfw\">May 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"ang1Wc\">Does this mean the Pixy is selling well? It’s possible, but it seems more likely that Snap didn’t make that many to begin with. In the past, Snap <a href=\"https://www.theverge.com/2017/11/7/16620718/snapchat-spectacles-40-million-lost-failure-unsold-inventory\">lost almost $40 million</a> when it made too many pairs of its Spectacles, but Snap CEO Evan Spiegel <a href=\"https://www.theverge.com/2022/4/28/23043011/snapchat-pixy-drone-hands-on\">suggested to <em>The Verge</em> before Pixy’s launch</a> that Snap underestimated how many Pixys it needed and made too <em>few</em> this time around. “Honestly, in hindsight, we probably should have made more,” Spiegel told us. </p><p id=\"vlfXF7\">As a result, people who purchased the Pixy drone are going to have to wait. Even the very first people who bought the Pixy on day one won’t see their drone for weeks, Snap spokesperson Chloe Keusder confirmed in an email. </p><p id=\"6KT187\">That won’t be a surprise to buyers: Snap’s website always showed an 11- to 12-week shipping window on its launch date, April 28th. But if you purchase one today, you’ll now have a longer wait time of 15 to 16 weeks. Snap, however, isn’t waiting for orders to come in before making each drone; the Pixy isn’t made-to-order, Keusder tells <em>The Verge</em>. So there’s at least a small stockpile somewhere, one that takes multiple months to make it to your door.</p><p id=\"ysk5Rg\">How small? Snap declined to tell us how many drones it made. So we can’t really begin to guess how popular the Pixy might be. </p><p id=\"H0Yxxb\"></p><p id=\"uyEIqy\"></p><p id=\"0Rgqh3\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/je_FeIrYtCGzYImH4EDZlQLhQto=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23417283/vpavic_220418_5168_0131.jpg",
  "description": "Customers wanting to buy have to wait four months",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}