{
  "title": "SNK is now almost entirely owned by the Saudi crown prince’s foundation",
  "url": "https://www.theverge.com/2022/4/5/23011757/snk-corporation-mohammed-bin-salman-misk-foundation",
  "date": "2022-04-05T19:17:54.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"SAUDI-RUSSIA-DIPLOMACY\" src=\"https://cdn.vox-cdn.com/thumbor/tqx4E21ZZyOKvIV5DXnLQQNpFT8=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70713696/1175945544.0.jpg\" />        <figcaption>Photo by ALEXANDER ZEMLIANICHENKO/POOL/AFP via Getty Images</figcaption>    </figure>  <p id=\"ANFcfq\">SNK Corporation, the developer of games like <em>Metal Slug</em> and <em>Fatal Fury</em>, is now nearly entirely owned by a subsidiary of the Saudi crown prince’s foundation. Electronic Gaming Development Company (EGDC), which is owned by the Mohammed bin Salman Foundation (MiSK Foundation), holds 96.18 percent of SNK’s shares, according to a February 15th filing on SNK’s website (<a href=\"https://www.snk-corp.co.jp/kr/ir/wp-content/uploads/2022/02/Results_of_Tender_Offer_Korea_220210_English-2.pdf\">PDF</a>).</p><p id=\"n0ejDT\">This follows “a strategic investment” announced in November 2020, where the MiSK Foundation acquired an “initial” 33.3 percent stake in SNK. At the time, MiSK Foundation indicated it planned to eventually take a 51 percent stake in SNK, but it seems MiSK Foundation decided to buy a much larger stake. </p><p id=\"kY97DT\">“The Mohammed bin Salman Foundation’s (MiSK Foundation) investment in the Japanese company SNK reinforces its continuous commitment to its goals of empowering Saudi men and women through building economic partnerships, within the Foundation’s updated strategy to maximize the positive impact on youth empowerment,” MiSK Foundation said in <a href=\"https://misk.org.sa/en/the-mohammed-bin-salman-foundation-misk-foundation-announces-strategic-investment-of-around-sar-813-million-us-216-5-million-in-japanese-gaming-company-snk/\">the press release for that investment</a>. “The investment decision will also enhance SNK’s strong capabilities, which has many innovative intellectual properties in the gaming sector with real potential for development\\ [sic] in the future in line with anticipated growth with the electronic gaming industry.” </p><p id=\"L4ReP5\">Recently, Saudi Arabia has made some big investments in the gaming industry. <em>Bloomberg</em> reported <a href=\"https://www.bloomberg.com/news/articles/2022-02-03/saudi-wealth-fund-reveals-latest-video-game-bet-with-nexon-stake\">in February</a> that Saudi Arabia’s Public Investment Fund (PIF) has taken stakes of more than 5 percent in both Capcom and Nexon — stakes that, combined, are worth more than $1 billion. The PIF also invested more than $3.3 billion to buy stock in gaming giants Activision Blizzard (which is set to be <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">acquired by Microsoft</a>), EA, and Take-Two in the fourth quarter of 2020, <a href=\"https://www.aljazeera.com/economy/2021/2/17/saudi-wealth-fund-acquired-3-3bn-in-us-video-game-stock\"><em>Al Jazeera</em> reported</a> in February 2021.</p><p id=\"26yBdJ\">But the investments carry the weight of Saudi Arabia’s recent history of human rights abuses. Most recently, a US intelligence report concluded <a href=\"https://www.bbc.com/news/world-us-canada-56213528\">Mohammed bin Salman approved</a> the plans to “capture or kill” journalist Jamal Khashoggi, who was murdered and dismembered after visiting a Saudi consulate in Istanbul. Riot Games received a wave of criticism for a sponsorship deal <a href=\"https://www.theverge.com/2020/7/29/21347066/riot-league-of-legends-lec-esports-controversy-neom-saudi-arabia\">with the Saudi megacity Neom</a> and ended the deal <a href=\"https://www.theverge.com/2020/7/30/21347858/riot-league-of-legends-lec-sponsorship-neom-canceled\">less than a day</a> after it was announced.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-iv_2ogi8i43PPzrujz2UJ31Cy4=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23369211/1175945544.jpg",
  "description": "Saudi Arabia has made some big gaming investments.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}