{
  "title": "Social media might be bad for teens’ mental health at certain age windows",
  "url": "https://www.theverge.com/2022/3/29/23000460/social-media-mental-health-window-puberty",
  "date": "2022-03-29T18:59:23.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"The iPhone 13 Pro Max battery lasts a very, very long time. Screen-on time can clear 10 hours.\" src=\"https://cdn.vox-cdn.com/thumbor/EBM0tUnTAvH-yec5tQzB8aN3dFo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70686185/akrales_210917_4760_0331.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"XY41CF\">Social media use is more strongly linked to bad mental health for adolescents and teenagers during years around puberty and when they’re probably about to leave home, according to a <a href=\"https://www.nature.com/articles/s41467-022-29296-3#MOESM1\">new study</a>. Teenagers who used social media more frequently in those periods scored lower on measures of life satisfaction one year later. </p><p id=\"BjsNs8\">Many researchers say things like Instagram and TikTok probably aren’t entirely bad for all adolescents. They’re not entirely good, either, and can cause <a href=\"https://www.theverge.com/2021/10/6/22712927/facebook-instagram-teen-mental-health-research\">documented problems</a> with body image, but the impact varies: for some kids at some points in time, it might help them socialize and build relationships; for others at other times, it might be a hit to their self-esteem. </p><p id=\"nnp9dW\">The challenge has been figuring out which teens are at risk — and <em>when</em> they’re at risk — so experts can develop strategies to help them. </p><p id=\"c9lWzn\">“Adolescence is a time of such massive cognitive, biological, and social change. These changes interface with social media in very interesting ways,” says study author Amy Orben, a psychologist who heads the Digital Mental Health program at the University of Cambridge. “There’s probably a huge amount of variability between how different individuals use social media and how their life influences their use.”</p><p id=\"YZno02\">It’s a particular challenge because any impact of social media on mental health is likely to be small. “Predicting mental health will always be in very small impacts because mental health and well-being are so complex,” Orben says. “Any one behavior will only be a very, very small slice of that pie.”</p><p id=\"GIOVIg\">To drill down on the relationship, Orben and her team first looked at a survey of over 72,000 people 10 to 80 years old in the United Kingdom. They were surveyed up to seven times each between 2011 and 2018 and asked a series of questions that included their life satisfaction and the amount of time they estimated they spent on social media each day. </p><p id=\"kaDxUJ\">Narrowing in on adolescents, the team found that for people in the 16- to 21-year-old age range, both very low and very high social media use were both linked with lower life satisfaction. In 10- to 15-year-olds, there wasn’t<strong> </strong>much difference in life satisfaction between kids reporting low and high social media use. But in that group, girls with high social media use had lower life satisfaction than boys.</p><p id=\"uPqJtc\">The team also examined data from a survey given to over 17,000 10- to 21-year-olds, identifying separate windows for boys and girls in their early teens where higher social media use was linked with lower life satisfaction a year later — 14 to 15 for boys and 11 to 13 for girls. The relationship showed up for both sexes at age 19. The windows seem to map on to the start of puberty for both boys and girls (girls tend to hit puberty earlier) and a major social transition — many young adults in the UK<strong> </strong>leave home at around 19. </p><p id=\"SipsDj\">Other types of research could help figure out the reasons for those windows, Orben says: studies looking at things like sensitivity to social rejection or impulse control, compared with these sorts of data sets, could help understand why kids at certain ages might have worse experiences after using social media. </p><p id=\"LR7Ln5\">Orben cautioned that there are limitations to the study — it can’t show that social media use caused changes in life satisfaction, just that there’s a relationship. It also relies on people reporting how much they use social media, which could be inaccurate. That’s a challenge for most social media research. Companies like Meta <a href=\"https://www.theverge.com/2021/10/28/22749357/facebook-mental-health-research-tobacco\">don’t give researchers access</a> to internal data that could give scientists a more objective look at social media use — things like<strong> </strong>how long people use the platforms or who they’re interacting with. </p><p id=\"LeOZgh\">Future research could help identify the groups of adolescents and teenagers who might have the most negative impacts from social media. “Understanding who’s impacted, to what extent, how, and why helps create a better environment to negate those risks,” Orben says. Social media isn’t like sugar, she stresses — but experts understand the health impacts of things like sugar. They can give some people small policy nudges (like how the UK banned candy bars from checkout lines). They can also give people with existing health conditions, like diabetes, more direct help around their sugar intake. </p><p id=\"EXfZmY\">Experts want to create similar policy frameworks or recommendations for social media, which could help keep especially vulnerable people from experiencing negative effects. But they need to get a better handle on the problem first — they still don’t have enough understanding of who might benefit from what type of help, Orben says. “We don’t fully understand the problem. So we can’t address it.”</p><p id=\"bl2tHI\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jtJlixvNM2zkTfs_3Mj-lbDgcxo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863261/akrales_210917_4760_0331.jpg",
  "description": "Researchers want to figure out who’s most vulnerable.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}