{
  "title": "Some Russian bank customers have been cut off from Apple Pay and Google Pay",
  "url": "https://www.theverge.com/2022/2/26/22952191/russian-bank-customers-apple-pay-google-pay-financial-sanctions-ukraine",
  "date": "2022-02-26T19:04:04.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"A customer uses pays for their order using Apple Pay at a Square Register at Mateo’s on Thursday, October 25, 2018 in San Francisco, Calif.\" src=\"https://cdn.vox-cdn.com/thumbor/sWswcHXUxZjST_5OSz3nhWtJLoc=/0x0:6720x4480/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70554747/1322363774.0.jpg\" />        <figcaption><em>Financial sanctions from several countries bar some card payments through Google Pay and Apple Pay.</em> | Photo By Lea Suzuki/The San Francisco Chronicle via Getty Images</figcaption>    </figure>  <p id=\"lTq3yE\">Customers at a number of banks in Russia can no longer use their bank cards with Google Pay and Apple Pay due to newly-imposed financial sanctions on the country, as reported by <a href=\"https://www.businessinsider.com/russian-banks-sanctions-apple-google-pay-ukraine-invasion-money-cards-2022-2\"><em>Insider</em></a>. According to a press release from <a href=\"https://cbr.ru/press/event/?id=12720\">Russia’s Central Bank</a>, affected financial institutions include VTB Group, Sovcombank, Novikombank, Promsvyazbank, and Otkritie FC Bank.</p><div class=\"c-float-right\"><aside id=\"eI7Bs8\"><q>Sanctions issued by the EU target 70 percent of Russia’s banking network</q></aside></div><p id=\"zew4WL\">While customers can still use bank cards from these institutions within Russia, they’ll no longer work abroad or when making online payments to stores and services belonging to countries that issued sanctions on Russia. This also includes card payments through Apple Pay and Google Pay, although the Central Bank says contactless payments will still be available with the bank cards themselves, given that they support it.</p><p id=\"vXW9n7\">Google and Apple didn’t immediately reply to <em>The Verge</em>’s request for comment.</p><p id=\"0ajB0l\">Google Pay and Apple Pay aren’t as popular in Russia <a href=\"https://techcrunch.com/2021/04/05/fueled-by-pandemic-contactless-mobile-payments-to-surpass-half-of-all-smartphone-users-in-u-s-by-2025/\">as they are in the US</a>. According to <a href=\"https://www.statista.com/statistics/1056296/most-popular-online-payment-services-russia/\">statistics recorded in 2020</a>, Russia’s most popular mobile payment service was the Russia-owned Sberbank Online, followed by YooMoney (formerly Yandex Money) and QIWI, two other Russian payment service providers. At the time, 29 percent of Russians reported using Google Pay, while 20 percent used Apple Pay.</p><p id=\"AX4y9S\"><a href=\"https://www.cnn.com/2022/02/25/business/list-global-sanctions-russia-ukraine-war-intl-hnk/index.html\">Several countries have imposed financial sanctions</a> on Russia following its invasion of Ukraine. According to <a href=\"https://twitter.com/vonderleyen/status/1497021840572796928\">Ursula von der Leyen</a>, the president of the European Commission, sanctions issued by the European Union target 70 percent of Russia’s banking network. The <a href=\"https://home.treasury.gov/news/press-releases/jy0608\">US has put sanctions on Sberbank and VTB Bank</a>, two of Russia’s biggest financial institutions, while <a href=\"https://www.gov.uk/government/news/uk-hits-russian-oligarchs-and-banks-with-targeted-sanctions-foreign-secretary-statement\">the UK froze the assets</a> of five Russian banks.</p><p id=\"cmY5DP\">As <a href=\"https://www.bloomberg.com/news/articles/2022-02-26/eu-edges-toward-nuclear-option-of-blocking-russia-from-swift?sref=ExbtjcSG\">nations weigh blocking Russia from SWIFT</a> (Society for Worldwide Interbank Financial Telecommunication), the financial system used to communicate transactions across the globe, the US, EU, and the UK are moving to directly <a href=\"https://apnews.com/article/russia-ukraine-vladimir-putin-business-china-asia-b57700241d650315db1eb0e8516ce2d6\">impose sanctions on Russian President Vladimir Putin</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CSBuXYsoXeZMljT3-TecE3bWvIE=/0x685:6720x4203/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23273724/1322363774.jpg",
  "description": "Sanctions on Russia are making some bank cards unusable.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}