{
  "title": "Some new BMWs will reportedly come without Android Auto and Apple CarPlay",
  "url": "https://www.theverge.com/2022/5/8/23062417/new-bmws-reportedly-come-without-android-auto-apple-carplay-chip-shortage",
  "date": "2022-05-08T16:21:12.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Economic Photo Illustrations\" src=\"https://cdn.vox-cdn.com/thumbor/Va5QzkEhL5gOSYAV-GI9W2FoFC8=/0x0:3543x2362/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70845744/1239883660.0.jpg\" />        <figcaption>Photo by Jakub Porzycki/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"HuRb8S\">BMW is temporarily shipping some new vehicles without support for Android Auto and Apple CarPlay after changing chip suppliers, according to a report from <a href=\"https://europe.autonews.com/automakers/bmw-ships-cars-without-apple-google-tech\"><em>Automotive News Europe</em></a> (via <a href=\"https://9to5google.com/2022/05/07/bmw-shipping-without-android-auto-carplay-update/\"><em>9to5Google</em></a>). The chips from the new supplier reportedly aren’t compatible with Android Auto and CarPlay yet, and require an update for the software to work.</p><p id=\"HGaHpM\">“The chips built into these cars in the first four months of this year need updated software in order to be fully functional and offer Apple CarPlay/Android Auto and Wi-Fi capability,” BMW said in an emailed statement to <em>Automotive News Europe</em>. BMW didn’t immediately respond to <em>The Verge</em>’s request for comment.</p><div class=\"c-float-right\"><aside id=\"fxQB5Y\"><q>An OTA update is coming by the end of June</q></aside></div><p id=\"Cx1Zb7\">Drivers may not have to wait too much longer to get Apple CarPlay and Android Auto support, though. The car manufacturer told <em>Automotive News Europe</em> that it plans on rolling out an over-the-air (OTA) update to make the functionality available “by the end of June at the latest.”</p><p id=\"e4tMPS\">BMW didn’t specify which car models are affected or how many, but says vehicles with “6P1” in their production code won’t come with Android Auto or Apple CarPlay. It’s unclear if only certain regions are affected by the issue — <em>Automotive News Europe</em> says drivers from the US, UK, Italy, Spain, and France have reported receiving their new vehicles without either functionality.</p><p id=\"vtfAb8\">This isn’t the first sacrifice BMW has made due to the chip shortage. Last November, BMW confirmed that it stopped shipping <a href=\"https://www.theverge.com/2021/11/5/22765709/bmw-chip-shortage-touchscreen-car-suv-manufacturing\">some of its new vehicles without touchscreens and a backup assistant feature</a> and gave affected drivers a $500 credit in return.</p><p id=\"2dtTBy\">Other car companies, like General Motors, were also heavily impacted by the shortage. GM <a href=\"https://www.theverge.com/2021/7/13/22575836/gm-wireless-charging-cadillac-chevy-tahoe-chip-shortage\">dropped wireless charging</a> from a range of vehicles, <a href=\"https://www.theverge.com/2021/3/15/22331766/gm-pickups-semiconductor-shortage-fuel-economy-emissions\">axed a fuel management module</a> from some of its trucks, and cut the driverless <a href=\"https://www.theverge.com/2021/9/29/22701086/cadillac-super-cruise-2022-escalade-semiconductor-shortage\">Super Cruise feature</a> in the 2022 Cadillac Escalade. More recently, <a href=\"https://www.theverge.com/2022/3/13/22975246/ford-ship-sell-incomplete-vehicles-missing-chips\">Ford started temporarily shipping and selling Explorer SUVs</a> without rear heating and air conditioning controls.</p><p id=\"5Kvkzk\"><a href=\"https://www.theverge.com/2022/4/29/23049114/chip-shortage-intel-ceo-2024\">Intel CEO Pat Gelsinger predicts</a> the chip shortage, which affects an array of industries in different ways, may last into 2024.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7KheLc6xISSweKZOMGaxI5Pym78=/0x139:3543x1994/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23446268/1239883660.jpg",
  "description": "An over-the-air update is expected by the end of June.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}