{
  "title": "Someone plugged an entire 4K desktop graphics card into the Steam Deck ",
  "url": "https://www.theverge.com/2022/4/13/23023839/valve-steam-deck-egpu-external-amd-rx-6900-xt-4k-eta-prime",
  "date": "2022-04-13T17:45:16.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2S9xvDuNUQ49SN9p8nAaYFaq5Yw=/25x0:1105x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745326/maxresdefault.0.jpg\" />        <figcaption>Image: ETA Prime</figcaption>    </figure>  <p id=\"vRAuEj\">The $400-plus <a href=\"https://www.theverge.com/22960536/steam-deck-faq-valve-one-month-later\">Steam Deck</a> gaming handheld <em>does not</em> support external graphics cards. Valve has been clear on this point for months — you can’t magically plug in a dock and run <em>Cyberpunk </em>or <em>Elden Ring</em> at 4K. But ever since the company revealed that the Steam Deck’s storage plugs into a (relatively) easily accessible M.2 PCI-Express x4 socket, the PC gaming community has speculated that an eGPU module could totally fit there instead.</p><p id=\"5aQZih\">Now, <a href=\"https://www.youtube.com/watch?v=8WEGY6aY8lM\">YouTuber ETA Prime has actually done it</a>, adding an AMD Radeon RX 6900 XT, one of the highest-end graphics cards on the market. </p><p id=\"xx27CF\">It works, it runs, it plays games at 4K with maxed-out settings at framerates a vanilla Steam Deck could only dream of. But no, you probably shouldn’t do this at home! Not only does it kind of defeat the portable purpose to have a desktop graphics card sticking out the back — not to mention an external power supply! — but a bunch of games seem to bog down due to having a relatively slow CPU and only four lanes worth of PCI-Express bandwidth for that beefy graphics card, too. </p><p id=\"dPQybc\">Oh, and you can’t close the Steam Deck’s case, either, which is probably not optimal for its longevity. And ETA Prime says an Nvidia GPU didn’t work.</p>  <figure class=\"e-image\">        <img alt=\"A Steam Deck, a stand, USB-C dongle, USB stick, eGPU, power supply, and HDMI cable\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BnKYwWohk-TdxhRGk-bUR_rmQqM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387605/eta_prime_deck.jpg\">      <cite>Image: ETA Prime</cite>      <figcaption><em>That’s a lot of kit.</em></figcaption>  </figure><p id=\"2XnoD6\">Perhaps some future Steam Deck will have a bonafide external graphics compatible connector so you could simply plug in a ready-made eGPU box? Thunderbolt is pricey and traditionally exclusive to Intel systems, but <a href=\"https://www.theverge.com/2022/1/4/22856150/amd-ryzen-6000-laptop-chips-gaming-battery-life-zen-3-plus-ces-2022\">AMD’s Ryzen 6000 processors support USB 4</a>, which incorporates the Thunderbolt 3 spec. And <a href=\"https://www.phoronix.com/scan.php?page=news_item&amp;px=Linux-5.14-AMDGPU-Hot-Unplug\">AMD has been working on Linux drivers</a> specifically to allow hot plugging and unplugging of external graphics cards. </p><p id=\"iwgaCU\">It might cost Valve more to incorporate the faster I/O that’d be required to enable a single-cable-4K-graphics-docking dream, but Valve might be up to it — it’s publicly said that it’s not only interested in working on a Steam Deck successor but that it was surprised how many buyers opted for a premium $649 model instead of the $400 base configuration. </p><p id=\"HY4O5U\">Me, I’ll probably just <a href=\"https://www.theverge.com/22962051/steam-games-remote-play-windows-ios-android-macos-streaming\">stream my games from my desktop PC to the Deck</a> inside my own home. It works fairly well.</p><p id=\"TP9N8X\"><em><strong>Correction, 3:54PM ET: </strong></em><em>Thunderbolt is no longer exclusive to Intel systems, counter to what I originally suggested. Thunderbolt 4 began sneaking into AMD desktop boards last year.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RPg85REx2-q1CDfdDKz--skUSas=/0x43:1280x713/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387408/maxresdefault.jpg",
  "description": "Because he could",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}