{
  "title": "Sonic 2 is a family-friendly speedrun through the franchise’s awkward phase  ",
  "url": "https://www.theverge.com/23014568/sonic-the-hedgehog-2-review-movie-jim-carrey",
  "date": "2022-04-07T18:10:43.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Sonic the hedgehog with his little satchel full of rings.\" src=\"https://cdn.vox-cdn.com/thumbor/xKyl7qXA_8S15kuIT6zHwujPRt0=/413x0:1730x878/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70722647/sth2_ff_067.0.jpeg\" />        <figcaption><em>Sonic the hedgehog with his little satchel full of rings.</em></figcaption>    </figure>  <p>Sonic’s cinematic franchise is eager to grow up</p> <p class=\"p--has-dropcap\" id=\"sgsZCZ\">Short of simply never even trying to make sequels, studios have no guaranteed way of keeping their cinematic franchises from sinking into sophomore slumps like director Jeff Fowler’s <a href=\"https://www.theverge.com/2021/8/10/22618880/idris-elba-knuckles-voice-actor-sonic-the-hedgehog-2\"><em>Sonic the Hedgehog 2</em></a>. Taking ambitious chances on fresh ideas the way <em>Sonic 2</em> does is an important part of how these kinds of ongoing narratives are able to evolve, though. And while the new movie is far from perfect, its flaws all play like the growing pains of a project that’s well on its way to becoming genuinely interesting.</p><p id=\"JPZAYd\"><em>Sonic the Hedgehog 2 </em>presumes that you remember most of the beats of its 2020 predecessor. But the movie more or less works as a standalone as it reintroduces a now-bald and markedly more chaotic Dr. Robotnik (Jim Carrey), who’s become obsessed with destroying Sonic (Ben Schwartz) after their last battle. Unlike Sonic — an alien who ended up finding his chosen family in Green Hills sheriff Tom Wachowski (James Marsden) and his veterinarian wife Maddie (Tika Sumpter) — Robotnik was ripped away from his only real friend, Agent Stone (Lee Majdoub). He was then marooned on a distant planet <a href=\"https://www.theverge.com/2021/9/23/22690607/chris-pratt-mario-nintendo-illumination-animated-movie-december-2022-release-date-cast\">inhabited by nothing but mushrooms</a>. Though Robotnik tells himself that his desire for revenge is what pushes him to survive and keep building things in his solitary kingdom of mushrooms, <em>Sonic 2 </em>makes clear that his loneliness is also a key factor — not just in this situation but also as part of who the mad scientist is.</p><p id=\"B9mRdd\"><em>Sonic 2 </em>does make a go at peppering its plot and characterizations with a bit more substance than the first film. Because it’s squarely aimed at a much younger audience than the diehard adult <em>Sonic</em> fans who are also going to see it, its attention to fine details is quickly put aside to make room for an excess of referential humor. It’s legitimately astounding just how many nods to other movies and real-world events <em>Sonic 2 </em>manages to make. As it does so, it also firmly establishes Carrey’s unhinged Robotnik more as comedic relief than a proper villain. Carrey’s still exceedingly capable at vacillating between the shades of Pee-wee Herman and <em>Watchmen</em>’s Ozymandias that <em>Sonic 2 </em>paints Robotnik with. But because <em>Sonic 2 </em>fires off its jokes at such a frantic clip, it doesn’t really leave you much time to appreciate the effort it puts into infusing Robotnik and other characters with the essence of their video game counterparts.</p>  <figure class=\"e-image\">        <img alt=\"Knuckles meeting Robotnik for the first time.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qkzuGtpZ36qsSBHvWPsOCVlbMk4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23374276/sth2_ff_082r.jpeg\">      <cite>Image: Paramount Pictures</cite>      <figcaption><em>Knuckles meeting Robotnik for the first time.</em></figcaption>  </figure><p id=\"6we7ga\">This is less true of newcomer Knuckles (Idris Elba), a single-minded warrior and last of the echidna tribe, who once warred with a rival tribe of anthropomorphic owls for control of the legendary Master Emerald. Though Knuckles and Robotnik are both framed as somewhat comedic villains early on, <em>Sonic 2</em>’s approach to the echidna ends up working far better, mainly because he’s only got one bit. Knuckles isn’t dumb, per se, but Elba plays the character very much like <em>Guardians of the Galaxy</em>’s Drax the Destroyer: he’s big (for an echidna), he’s strong, and he has little understanding of human jokes or the concept of sarcasm. What Knuckles does understand, however, is that Robotnik can lead him to Sonic and that both of the begloved aliens have an important connection to the Master Emerald.</p><p id=\"jaUode\"><em>Sonic 2 </em>begins to lose some of its steam the moment it shifts its focus to its central hero back on Earth: Sonic has taken to a life of well-meaning but ultimately destructive vigilantism vaguely inspired by all of the superhero comics and movies Tom keeps him stocked with. Having embraced his superspeed powers in the previous film, <em>Sonic 2 </em>finds Sonic wanting to put them to good use, which Tom understands — but only up to a point. Because Tom sees himself as Sonic’s adoptive father figure, though, he can’t help but be concerned for the hedgehog’s safety, in no small part because the government is still actively looking to capture him. While <em>Sonic 2, </em>thankfully, moves past its “Blue Justice” Batman jokes rather quickly, it does get somewhat stuck going through the motions. (Much like many movies about young vigilantes butting heads with their older mentors who want nothing more than to keep their young charges safe.) But much in the same way that the movie sort of rushes off after briefly touching on Robotnik’s loneliness, it puts a pin in Sonic and Tom’s father / son dynamic almost immediately after bringing it up in order to keep things light and roll into its next batch of jokes.</p><p id=\"6eMsIv\">Similar to <em>Godzilla </em>movies, Sonic’s cinematic adventures almost always feel hamstrung by the presence of his human friends who, due to their lack of powers, seldom have all that much to do when things start going sideways. This, one imagines, is why <em>Sonic </em>smartly chooses to split Sonic and his family up for most of the film; Maddie and Tom venture off to Hawaii for a wedding, freeing Sonic to live out his <em>Ferris Bueller </em>fantasies and make first contact with Tails (Colleen O’Shaughnessey).</p>  <figure class=\"e-image\">        <img alt=\"Tails revealing himself to Sonic in a moment of danger.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3DEAn6H09PW0Aw5B9RE4YLWAmu0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23374283/sth2_ff_017r.jpeg\">      <cite>Image: Paramount Pictures</cite>      <figcaption><em>Tails revealing himself to Sonic in a moment of danger.</em></figcaption>  </figure><p id=\"R8DWSQ\">On the big screen, what’s notable about Marsden’s return as Tom and O’Shaughnessey’s debut as Tails is how both performances speak to Paramount’s growing sense of what its cinematic <em>Sonic </em>franchise should be. Tails, a soft-spoken inventor who can fly, doesn’t have all that much of a personality outside of his obsession with Sonic. But the movie is obviously interested in solidifying the concept of them working as friends and partners as the franchise moves forward — perhaps pointing to Tom playing a smaller role in Sonic’s future adventures. <em>Sonic 2 </em>doesn’t sideline Tom as much as it reminds you that the movie’s not about him. (The film doubles down on the idea that Tom and Maddie see themselves as Sonic’s parents who need to give him space.)</p><p id=\"87Wq1n\">That space is what frees Sonic and Tails to embark on an adventure that takes them across the world and feels vaguely inspired by <em>Sonic Adventure. </em>Curiously, <em>Sonic 2 </em>always seems as if it’s holding back from getting too deep into the bits and pieces of deeper <em>Sonic</em> lore it touches upon here and there — despite those moments always feeling like when the movie’s about to pop off. At times, this has the effect of making <em>Sonic 2 </em>play like a second outing Paramount’s not entirely sure can be successful, even despite the first movie having been a box office hit. </p><p id=\"J0EcQc\"><em>Sonic 2</em>’s air of uncertainty about which parts of <em>Sonic </em>it should lean into ends up working against the movie as it progresses and tries to weave its disparate storylines together into a big, bombastic final act. Knuckles and Sonic’s flashiest fight sequence is legitimately cool to watch, as is the way <em>Sonic 2 </em>introduces even more of the classic Eggman aspects of Robotnik’s villain. But both of those things are introduced so late that it’s hard not to imagine how the film might have been better served by working them in earlier and more organically.</p><p class=\"c-end-para\" id=\"40LGl2\">Those avoidable drawbacks are what keep <em>Sonic the Hedgehog 2 </em>from sticking its landing when you look at it on its own. But they don’t feel like such a bad omen when you bear in mind that Paramount’s already <a href=\"https://www.theverge.com/2020/5/28/21274020/sonic-the-hedgehog-movie-sequel-in-development-jeff-fowler\">greenlit a third movie installment</a> as well as <a href=\"https://www.theverge.com/2022/2/15/22936219/paramount-plus-knuckles-tv-show-series-sonic-third-movie\">a Knuckles<em> </em>spinoff</a>. Again, <em>Sonic the Hedgehog 2 </em>isn’t a perfect movie. But it is one that’s clearly switching up the landscape of this world ahead of it becoming even more fantastical and full of talking animals wearing shoes. </p><p id=\"ft2jjV\"><small><em>Sonic the Hedgehog 2 </em></small><small>hits theaters on April 8.</small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/A9E2a20wloPzdlOY6wp75yzWeUU=/233x0:1910x878/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23373597/sth2_ff_067.jpeg",
  "description": "Sonic’s cinematic franchise is eager to grow up.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}