{
  "title": "Sonos announces entry-level Ray soundbar for $279, coming on June 7th",
  "url": "https://www.theverge.com/2022/5/11/23065587/sonos-ray-soundbar-announced-features-price-release-date",
  "date": "2022-05-11T20:05:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/z2CzLgc2YDkZvVTjIJDGat8dVvc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70858175/cwelch_220510_5210_0006.0.jpg\" />        <figcaption><em>The Sonos Ray is smaller than the Beam and Arc.</em></figcaption>    </figure>  <p id=\"AB8VWL\">Sonos this afternoon officially announced its <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.sonos.com/en-us/shop/ray\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sonos Ray</a> soundbar. Matching the specs and design that <a href=\"https://www.theverge.com/2022/4/21/23035569/sonos-new-soundbar-2022-s36-fury-specs-price-release-date\"><em>The Verge</em> first reported last month</a>, the company’s new entry-level soundbar will be priced at a slightly higher-than-initially-planned $279 when it goes on sale on June 7th. (Hey, maybe Sonos is feeling inflation just like the rest of us.)</p><p id=\"IjwdLK\">The Ray is being positioned as ideal for first-time soundbar buyers who want to upgrade their TV’s lackluster built-in speakers. It’s capable of outputting Dolby Digital audio — there’s no Atmos — and connects to TVs via an optical cable. Sonos is leaving HDMI and eARC for its more expensive Beam and Arc products. Gamers should note that soundbars that rely on an optical connection can sometimes exhibit a slight audio delay. But I think Sonos figures that anyone with an Xbox Series X or PS5 plugged into their TV is likely to opt for the Beam or Arc instead.</p><p id=\"88frEb\">The Ray has two tweeters that handle high frequencies. And as seen in our original render, the soundbar has split waveguides at the left and right sides to route sound “from wall to wall.” In the center are two midwoofers that “ensure faithful playback of mid-range frequencies and solid bass.” Sonos says that because its acoustic elements are all forward-facing, the Ray is designed to perform well sonically no matter where it’s placed — including when it’s tucked into a media stand.  </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vumjs-azkHv2wH48_dtM-XiBuOM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453557/cwelch_220510_5210_0007.jpg\">      <figcaption><em>The Ray is the most affordable Sonos soundbar yet.</em></figcaption>  </figure><p id=\"7kSBbl\">Despite no HDMI connectivity and thus a lack of HDMI-CEC, Sonos believes the Ray stands out from similarly priced competitors, thanks to its full integration with the company’s multiroom audio platform. Speaking to <em>The Verge</em>, product manager Scott Fink also called out other features like <a href=\"https://support.sonos.com/s/article/3251?language=en_US\">TruePlay tuning</a> as differentiators for the Ray. The Ray lacks built-in mics, however, so you can only optimize its sound using TruePlay with supported phones. The new soundbar shares software features like speech enhancement and night mode with Sonos’ other home theater products.</p><p id=\"08n7ZY\">Like the Beam and Arc, the Ray can be expanded to a fuller surround system by using pairs of Sonos speakers like the Sonos One SL for rears. It can also be combined with the Sonos Sub, though I don’t envision many people spending $749 on a subwoofer for a $279 soundbar. Unfortunately, the rumored, more affordable Sub Mini isn’t part of today’s announcements from Sonos.</p><div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yCydPPdp5S_60Sj9Zey9xD8Kc6Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453555/cwelch_220510_5210_0005.jpg\">      <figcaption><em>The Sonos Ray connects to TVs with an optical cable.</em></figcaption>  </figure></div><p id=\"OFdLXE\"><em>The Verge</em> originally reported that the Sonos Ray would be able to be vertically mounted and serve as rear surrounds for Sonos’ other soundbars. However, the company made no mention of this feature during its media briefing sessions. When asked whether the functionality might still be on the way, Fink said he had nothing to share regarding rumors. (<em>The Verge</em> revealed internal Sonos materials that proved accurate regarding the Ray’s design, features, and release date, so the vertical mounting capability might have been scrapped at the last minute.)</p><p id=\"d72c29\">The Sonos Ray will go on sale on June 7th in the US, Canada, and a host of other countries. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ap56T86dfraqGZkaCX9D4127CIU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453560/cwelch_220510_5210_0010.jpg\">      <figcaption><em>Sonos’ portable Roam speaker now comes in new colors.</em></figcaption>  </figure><p id=\"mDn6xI\">Alongside the new soundbar, Sonos is also introducing new colors of its portable Sonos Roam Bluetooth speaker. Red, green, and blue versions of the Roam are available beginning today for the same $179 price as before.</p><p id=\"c2TMfp\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eQYGDydVV20MatLTHkPAzspnz54=/0x170:2040x1238/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23453556/cwelch_220510_5210_0006.jpg",
  "description": "There’s no Dolby Atmos, but it should still sound impressive.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}