{
  "title": "Sonos confirms its own voice control service will launch on June 1st",
  "url": "https://www.theverge.com/2022/5/11/23065623/sonos-voice-control-announced-features-giancarlo-esposito",
  "date": "2022-05-11T20:05:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Sh23OCS-DXtgoVnVbX6G_2HjeD8=/1x0:1600x1066/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70858177/sonos_voice_control_grouping.0.jpg\" />        <figcaption>Image: Sonos</figcaption>    </figure>  <p id=\"Ee5xDs\">Sonos will roll out its very own voice control assistant on June 1st in the United States. As <a href=\"https://www.theverge.com/2022/5/4/23056149/sonos-voice-assistant-features-release-date\"><em>The Verge</em> reported earlier this month</a>, Sonos Voice Control will be added to all of the company’s voice-enabled smart speakers through an upcoming software update. Once it arrives, owners of those devices will be able to start music playback, skip tracks, adjust volume, and send audio to other Sonos speakers in their home using “Hey Sonos” voice commands. Sonos Voice will expand to France later in 2022, but the company hasn’t announced rollout plans beyond those two initial countries. </p><p id=\"h9yqkv\">Amazon Music, Apple Music, Pandora, Deezer, and Sonos Radio are the supported services at launch. Some will be disappointed by the absence of Spotify, but during a recent press briefing, Sonos clarified that the assistant can still execute core commands like pause, stop, track controls, volume, and so on for Spotify content that’s already playing on a Sonos system, even though customers won’t be able to request a song or playlist from Spotify using Sonos Voice Control.</p><p id=\"Ub5a1z\">Sonos tapped a celebrity to become the voice of Sonos Voice Control. Giancarlo Esposito, known best for his roles in <em>Breaking Bad, Better Call Saul,</em> and <em>The Mandalorian,</em> has lended his recognizable voice to the service. The actor went through a lengthy recording session to give Sonos’ machine learning system enough samples to work with.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6UBSXiJsYQPqwAHFW4p4P-RdCqk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453943/sonos_voice_control_giancarlo_esposito.jpg\">      <cite>Image: Sonos</cite>      <figcaption><em>You’ll hear actor Giancarlo Esposito’s voice when interacting with Sonos Voice Control.</em></figcaption>  </figure><p id=\"nzdhlL\">Sonos Voice Control is strictly focused on music and isn’t meant to challenge Amazon Alexa, Google Assistant, or Apple’s Siri as a full-fledged digital assistant. The company says customers will be able to use Sonos Voice and Alexa concurrently on the same device, sticking to the latter for smart home controls and inquiries about the weather, calendar appointments, and general questions that Sonos’ service isn’t intended to handle. Google Assistant cannot be used alongside Sonos Voice Control. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/olDXrqMUWVl3WSibl6UFNYVUT4I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453106/sonos_voice_control_move_rooms.jpg\">      <cite>Image: Sonos</cite>      <figcaption><em>Sonos Voice Control can quickly move music from room to room.</em></figcaption>  </figure><p id=\"pcdtqc\">Aside from basic music commands, Sonos Voice Control can also be used to group speakers and rooms — you can tell it to play something “everywhere” to activate all of your speakers — or move the audio from one device to another in seconds. Sonos has designed the service to be as fast as possible; the company says that it limits “responses and chimes” in favor of quickly executing a voice command. </p><p id=\"o7taHr\">Sonos Voice Control has been developed to understand everyday language instead of requiring specific phrasing. (For example, you can say “Hey Sonos, turn it up” instead of “increase the volume.”) And as long as they’re strung close together, you can follow one voice command with another without having to say the “Hey Sonos” phrase every single time. For portable Sonos products like the Move and Roam, you can also check on battery life.</p><div class=\"c-float-right\"><aside id=\"LYg6fL\"><q>Sonos is highlighting the privacy of its assistant</q></aside></div><p id=\"O08i4O\">Sonos seems confident in the performance of Sonos Voice Control. The company says you can get pretty granular with commands like “stop playing in the kitchen and play in the living room instead” or “volume up in the bedroom only.” These very Sonos examples demonstrate why it made sense for the company to create its own voice solution rather than using resources to make this stuff work through Amazon Alexa or Google Assistant skills.</p><p id=\"qlnFjm\">The service is rooted in technology that Sonos picked up <a href=\"https://www.theverge.com/2019/11/21/20975607/sonos-buys-snips-ai-voice-assistant-privacy\">when it acquired Snips</a>, a privacy-oriented voice assistant, back in 2019. After buying the company, Sonos’ team has continued to evolve the service ahead of today’s introduction. All Sonos Voice Control commands are processed locally on-device and not sent to Sonos servers in the cloud. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SZZv84FIBJperp0GNQTwz3c9GBQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23453551/cwelch_220510_5210_0001.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Sonos’ Jo Dureau, VP of voice experience, and Alice Coucke, the company’s head of machine learning research.</em></figcaption>  </figure><p id=\"i2q9XR\">Sonos says a fair number of consumers refrain from ever setting up or using the voice assistant on smart speakers for privacy reasons, and it thinks that Sonos Voice Control might overcome this hesitation. If it meets the company’s performance claims, it could definitely become a convenient new feature. Sonos Voice Control is free, which is no surprise considering its limited scope.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Mb-HhrAvz3cZaSIqwxJpeMRSVOk=/0x114:1600x952/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23453091/sonos_voice_control_grouping.jpg",
  "description": "Actor Giancarlo Esposito lended his voice to the service.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}