{
  "title": "Sonos acquisition fuels new headphone rumors",
  "url": "https://www.theverge.com/2022/2/1/22912007/sonos-t2-software-bluetooth-startup-le-audio-lc3-codec",
  "date": "2022-02-01T10:15:23.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qSnex22FXQXGlRlalukGFprxAiM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70456616/sonoslede.0.jpg\" />        <figcaption><em>Images of Sonos’ rumored headphones from a patent application.</em> | Image: German Patent and Trademark Office</figcaption>    </figure>  <p id=\"5GEsJ7\">Sonos has acquired the Bluetooth audio startup T2 Software, <a href=\"https://www.protocol.com/entertainment/sonos-bluetooth-audio-t2-software\"><em>Protocol </em>reports</a>, adding fuel to rumors that Sonos is developing its own headphones. T2 had been working on implementations of the new Bluetooth LE Audio standard and <a href=\"https://www.theverge.com/2020/9/23/21452127/bluetooth-sig-low-complexity-communication-codec-lc3-power-efficient-audio-quality\">LC3 codec</a>, which delivers better audio quality at lower bitrates for improved headphone battery life.</p><p id=\"zlQhuF\">A recent <a href=\"https://www.linkedin.com/posts/petepedersen_agency-friends-and-industry-insiders-sonos-activity-6892166802177171456-uJRu/\">LinkedIn post</a> from Sonos VP of global marketing and communications Pete Pedersen suggests that a Sonos headphone launch may be imminent. He said the company was looking for a marketing agency to help it launch “a new category” of product, “targeting a new audience/consumer segment.”</p><p id=\"nUIJR2\">A spokesperson for Sonos confirmed the acquisition to <em>Protocol</em>. “Occasionally, we will acquire teams, talent, and/or technology that augment our existing and future product roadmap,” the spokesperson said. T2 Software was acquired by Sonos in November 2021, <em>Protocol </em>reports, around three years after the startup was originally founded. </p><div class=\"c-float-right\"><aside id=\"OOXhzM\"><q>“Occasionally, we will acquire teams, talent, and/or technology that augment our existing and future product roadmap”</q></aside></div><p id=\"OCGoSA\">Sonos’ long-rumored <a href=\"https://www.theverge.com/2020/9/1/21409963/sonos-headphones-patent-wireless-noise-cancellation-bluetooth\">debut pair of headphones</a> could have the most to gain from a power-efficient Bluetooth codec like LC3. Headphones typically have to make difficult tradeoffs between having large enough batteries to offer good battery life, and being lightweight enough to wear for extended periods. LC3’s promise is that it can help mitigate this tradeoff with higher audio quality that requires less power. </p><p id=\"h43atq\">If you want to hear the kind of benefit the LC3 Codec can provide, the Bluetooth SIG has an interactive comparison available on <a href=\"https://www.bluetooth.com/learn-about-bluetooth/recent-enhancements/le-audio/\">its website</a> which lets you toggle between different audio encoders and bitrates. The tool shows how LC3 audio remains listenable at bitrates far lower than the usual SBC codec. And, most interestingly, it notes that the encoded audio streams were provided by “T2 Labs,” the old name of T2 Software.</p><p id=\"loj4p3\">Sonos historically shunned streaming over Bluetooth in favor of Wi-Fi for its home speakers, and has only embraced Bluetooth audio more recently for portable speakers like the <a href=\"https://www.theverge.com/2019/9/18/20871409/sonos-move-wireless-bluetooth-speaker-review-alexa-google-assistant-wifi-price-specs-sound-quality\">Sonos Move</a> and <a href=\"https://www.theverge.com/22368487/sonos-roam-bluetooth-speaker-review-features\">Sonos Roam</a>. Sonos’ headphones will reportedly compete with high-end competitors from Sony and Bose while also neatly integrating with Sonos’ existing speakers. </p><p id=\"mBnNQi\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PD6RvhKXepU4djs1lGrqAqfMD5M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22308242/sonoslede.jpg",
  "description": "It quietly acquired T2 Software last year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}