{
  "title": "Sonos might make your next TV streaming OS",
  "url": "https://www.theverge.com/2022/3/22/22991456/sonos-home-theater-os-tv-rumor-job-listings",
  "date": "2022-03-22T22:07:33.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Tk-9NqWroPlGeg01jabC4hnb8AY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70659044/DSCF5692_3.0.jpg\" />        <figcaption><em>Imagine if the Sonos Beam had its own TV interface</em> | Photo by Chris Welch / The Verge</figcaption>    </figure>  <p id=\"Nk5CO7\">Sonos is known for its whole-home audio systems and its soundbars, but now the company is hiring for a new home theater project that’s sure to give you more control from the couch. The speculation comes from the mention of a new “Home Theater OS” project being revealed in new Sonos job postings, <a href=\"https://www.protocol.com/entertainment/sonos-tv-home-theater-os\">as reported by <em>Protocol</em></a>.</p><p id=\"7E1Iy1\">The most revealing job posting is perhaps the “Head of Partnerships, Home Theatre” position:</p><blockquote><p id=\"xpSkng\">The Head of Partnerships for our Next Generation Sonos Home Theater OS will play a pivotal role in connecting users to the content and services they love with Sonos quality experiences they’ve come to expect.</p></blockquote><p id=\"O5k4Z7\"><em>Protocol </em>points out that Nick Millington, who is Sonos’ chief innovation officer, <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6910990918468714496/\">personally promoted</a> the “Head of Partnerships, Home Theatre” position on LinkedIn: “I’m working on a new home theater project and looking for a partnering executive to help,” Millington said.</p><p id=\"2iNSCA\">Another position is the “UX Lead, Next Generation Home Theater Experience,” which calls for someone with “a proven track record” in items like TV, digital content creation, and advertising. The posting says it requires at least eight years of experience designing “successfully shipped” user interfaces for mobile and TV.</p><div class=\"c-float-right\"><aside id=\"PGhVbm\"><q>Sonos would be taking on TV streaming systems like Roku</q></aside></div><p id=\"003GhH\">There’s recognition from Sonos that “content comes in many forms and from many different sources,” as laid out in the UX Lead job description. The company also mentions in the description that there’s an opportunity to grow its product offerings and “anticipate how this complex landscape reconciles to meet user needs.”</p><p id=\"0u4rom\">According to the <em>Protocol</em> report: Sonos had also apparently pursued an alternative solution where the company’s audio hardware could be embedded into a partner manufacturer’s TV set — thereby providing a branded audio system experience. <em>The Verge</em> contacted Sonos for comment on its apparent home theater TV interface goals, and we received the following statement from the company:</p><blockquote><p id=\"AM70Iu\">“As a leader in Home Theater audio, we will continue to innovate and create products and experiences that make listening simpler and more joyful, bringing you closer to the music and content you love. We don’t have anything further to share today.”</p></blockquote><p id=\"HVXTCh\">With companies like Roku already <a href=\"https://www.theverge.com/circuitbreaker/2019/9/4/20848492/roku-smart-soundbar-wireless-subwoofer-speakers-tv-setup-ifa-2019\">embedding TV streaming</a> experiences in its soundbars, it’s certainly the next logical step for Sonos. Currently, Sonos’ end-user app experience revolves around its ecosystem of audio products, controlling personal music libraries and providing a central way to control music apps, including Spotify, Apple Music, and more.</p><p id=\"o8ZjCZ\">Sonos would be taking on TV streaming systems like Roku, Fire TV (<a href=\"https://www.theverge.com/2019/9/4/20848392/anker-nebula-soundbar-fire-tv-alexa-amazon-ifa-2019\">also in a soundbar</a>), Google TV, and Apple TV, which is already a crowded space. But if there’s any company that’s poised to enter the TV space, it’s Sonos; and all it has to do is park a new Home Theater OS into its <a href=\"https://www.theverge.com/22701137/sonos-beam-gen-2-atmos-soundbar-review-specs\">Beam soundbar</a>, shake hands with existing Sonos configurations in the house, and get people addicted to the Sonos experience on the TV.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ovHDHci7YN7nljeP3_Gu5bP8KTA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22889000/DSCF5692_3.jpg",
  "description": "Sonos \"Home Theater OS\" hints at smart TV ambitions",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}