{
  "title": "Sony’s new PlayStation Plus makes retro games an expensive option",
  "url": "https://www.theverge.com/2022/3/30/23003625/sony-playstation-plus-premium-retro-games-expensive-option",
  "date": "2022-03-30T20:42:23.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"PlayStation\" src=\"https://cdn.vox-cdn.com/thumbor/HIF0Iocuj4zZ2QgTPwtUM5dQD1g=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70691262/vpavic_191127_untitled_0072_Edit.0.jpg\" />        <figcaption><em>The new PlayStation Plus Premium subscription will have PS1 games, but it’s the most expensive tier.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"xb7FDt\">Sony has just announced its <a href=\"https://www.theverge.com/2022/3/29/23001164/sony-playstation-plus-subscriptions-price-release-date\">new PlayStation Plus subscription tiers</a>, which will be available later this year, and with the new “Extra” and “Premium” levels, you’ll get access to back catalogs of many PlayStation games. However, if you want to play classic PS3, PS2, PS1, and PSP games, you’ll have to pay for “Premium,” the most expensive option, meaning that Sony is joining Nintendo in putting some of its older games behind its highest-cost subscription.</p><p id=\"BT2ZxL\">Using a subscription to access classic games isn’t new for Sony. For years, the company has offered access to PS4, PS3, and PS2 games as part of PlayStation Now, which is an entirely separate subscription service from PlayStation Plus. But instead of using the Plus shakeup to bring more games to the standard tier, Sony has instead decided to use classic games as a carrot to encourage players to subscribe to Premium, which will cost $17.99 per month, $49.99 for three months, or $119.99 per year. That annual fee is essentially what you would have used to pay to subscribe to a year of both Plus and Now — though if you’re a Now subscriber, Sony says you’ll be migrated to the new Plus Premium.</p><p id=\"xsDWki\">Nintendo has a similar tiered pricing strategy with its Nintendo Switch Online service. That subscription launched in September 2018 with access to <a href=\"https://www.theverge.com/2018/9/12/17850516/nintendo-switch-online-service-release-date\">a handful of NES games</a>, and nearly a year later, Nintendo <a href=\"https://www.theverge.com/2019/9/4/20848125/super-nintendo-games-snes-switch-online-service-mario-zelda-tomorrow\">added SNES games</a> — and all were available for the relatively low prices of $3.99 per month, $7.99 for three months, or $19.99 for one year. But if you want to play Nintendo’s selection of N64 or Sega Genesis games on your Switch, you’ll have to pay $49.99, a cost that’s more than double the standard individual annual membership, <a href=\"https://www.theverge.com/2021/10/15/22728113/nintendo-switch-online-plus-expansion-pack-price-n64-genesis-animal-crossing\">for an entire year of the Expansion Pack</a>. </p><p id=\"70kWMo\">Microsoft, on the other hand, has taken a different approach with its Game Pass library. With Xbox Game Pass, you can play the same Microsoft titles on your Xbox whether you pay for the lowest-tier $9.99 per month Game Pass or the more expensive $14.99 per month Xbox Game Pass Ultimate. Microsoft has also invested a lot <a href=\"https://www.theverge.com/2021/11/15/22782746/microsoft-xbox-backward-compatibility-76-new-games\">into backward compatibility</a>, meaning you can still access and play many older Xbox games on the Xbox Series X / S without needing a subscription. </p><aside id=\"js0dx0\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How the new PlayStation Plus compares to Xbox Game Pass and Switch Online\",\"url\":\"https://www.theverge.com/23001397/xbox-game-pass-nintendo-switch-online-playstation-plus-comparison-essential-extra-premium\"},{\"title\":\"Sony’s PS Plus tiers complicate the simplicity of subscription services\",\"url\":\"https://www.theverge.com/2022/3/30/23003225/sony-playstation-plus-essential-extra-premium-complicated\"}]}'></div></aside><p id=\"iXMScF\">Exacerbating potential frustrations with Sony’s approach is that the company has been somewhat dismissive of the importance of its back catalog in the past. Here’s PlayStation boss Jim Ryan in a 2017 interview <a href=\"https://time.com/4804768/playstation-4-ps4-pro-psvr-sales/\">with <em>Time</em></a>:</p><blockquote><p id=\"85mTyw\">“When we’ve dabbled with backwards compatibility, I can say it is one of those features that is much requested, but not actually used much. That, and I was at a <em>Gran Turismo </em>event recently where they had PS1, PS2, PS3 and PS4 games, and the PS1 and the PS2 games, they looked ancient, like why would anybody play this?”</p></blockquote><p id=\"pJ4ZTJ\">Ryan acknowledged he could have been clearer <a href=\"https://www.axios.com/sony-playstation-boss-video-games-d28e0c4f-23aa-420c-ba5a-7b7f9dad0295.html\">in a 2021 <em>Axios</em> interview</a>:</p><blockquote><p id=\"n61bNl\">“The point I was trying to make — obviously not very well — was just how great the PS4 version looked and how far the series had evolved. I certainly wasn’t trying to be disrespectful to our heritage.” </p></blockquote><p id=\"43ElC0\">But the 2017 comment still stings — especially when you consider how impactful many PlayStation games, like the <em>Metal Gear Solid</em> series, <em>Jak &amp; Daxter</em>, and <em>Shadow of the Colossus</em>, have been to video game history.</p><p id=\"4Ln8Yo\">Although many older PlayStation games have been remastered or brought to other platforms, it can still be great to play them the way they originally looked. And while the PS5 <a href=\"https://www.theverge.com/21509390/playstation-5-ps4-games-backwards-compatible-how-to-play\">is backward compatible</a> with nearly every PS4 game, the only way to play PS3 and PS2 games on Sony’s newest console is through the on-its-way-out PlayStation Now service and soon via the revised PlayStation Plus. </p><p id=\"OIS70n\">That said, subscriptions do offer a convenient way to <a href=\"https://www.theverge.com/2022/3/21/22988902/nintendo-wiiu-3ds-eshop-closure-dmca-section-1201\">preserve retro games</a> that may be hard to find. With some digital game stores <a href=\"https://www.theverge.com/2022/2/15/22936552/nintendo-eshop-wii-u-3ds-no-new-purchases-late-march-2023\">shutting down</a> and hardware <a href=\"https://www.theverge.com/2022/1/13/22881211/microsoft-discontinues-xbox-one-consoles-2020\">becoming obsolete</a>, subscriptions are one way to make older games accessible. But Sony — and Nintendo — seem to be moving toward making retro games <em>only</em> available via a subscription and sticking some behind the most expensive tier. And for the PlayStation 5 and the Switch, there isn’t a way to buy older games one at a time, like with Nintendo’s Virtual Console.</p><aside id=\"rruIIY\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\" Inside the fight to save video game history\",\"url\":\"https://www.theverge.com/2022/3/21/22988902/nintendo-wiiu-3ds-eshop-closure-dmca-section-1201\"}]}'></div></aside><p id=\"gJM2GD\">Sony hasn’t shared what retro games will be included with PlayStation Plus Premium, so we don’t currently know what you might get if you are planning to put aside cash for the more expensive subscription. However, the company is promising that “up to 340” games will be available on the Premium tier — a far larger amount than what you can play on Nintendo Switch Online. That Premium selection will also include some PS1 and PSP games, which aren’t currently on PlayStation Now. </p><p id=\"xxlKgf\">Despite the higher cost, I’m excited to check out some classic PlayStation games, thanks to the new Premium tier. But I wish there were ways to play them on my PS5 instead of coughing up extra cash on top of what I’ve already paid for PlayStation Plus — or that Sony offered some in the standard tier. </p><p id=\"xRzGAU\"></p><p id=\"XlPs9k\"></p><p id=\"GOHx0f\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sQaTG8gouf2wNmKlSUk63i16Als=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19430859/vpavic_191127_untitled_0072_Edit.jpg",
  "description": "The highest-priced tier offers the most games.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}