{
  "title": "Sony Xperia 1 IV leaked in renders showing off a mostly unchanged design",
  "url": "https://www.theverge.com/2022/2/28/22954714/sony-xperia-1-iv-leak-rumor-headphone-jack",
  "date": "2022-02-28T21:52:44.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vlFRECwQmJi4iVM9PrAM5mbyIaM=/80x0:944x576/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70562202/SONY_XPERIA_1IV_5K1_1_1024x576.0.jpg\" />        <figcaption><em>Leaked render of the Sony Xperia 1 IV</em> | Image: OnLeaks / Giznext</figcaption>    </figure>  <p id=\"o3uVAs\">It looks like the new Sony Xperia 1 IV is coming soon, based on newly leaked renders coming from reliable leaker OnLeaks through <a href=\"https://www.giznext.com/news/giznext-exclusive-sony-xperia-1-iv-5k-renders-reveal-design-in-full-glory/\">Giznext</a> (<a href=\"https://www.androidauthority.com/sony-xperia-1-iv-design-3121674/\"><em>via Android Authority</em></a>). The purported sequel to last summer’s Xperia 1 III looks to retain a very similar design, including a 6.5-inch OLED display on an elongated flat-edged slab.</p><p id=\"gKw6t8\">The leaked render looks like the Sony Xperia 1 IV will also have a headphone jack, side fingerprint sensor, and top / bottom bezels that house front-facing stereo speakers and a selfie camera. And there are three cameras shown on the rear of the Xperia 1 IV, each reportedly touting 12MP sensors, including one that seems to be telescopic.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/H5T4IARKBakFsyKIFBIYiI4WQ1s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277803/SONY_XPERIA_1IV_5K4_3_1024x576.jpg\">      <cite>Image: OnLeaks / Giznext</cite>      <figcaption><em>The leaked Xperia 1 IV has a shutter button, fingerprint sensor, power on the side, and SIM tray on the bottom. There are three cameras on the back, one seeming to be telescopic. And there’s still a headphone jack on the top.</em></figcaption>  </figure><p id=\"plpoIm\">Sony’s Xperia 1 flagships are known to have comprehensive controls for its cameras, with the 2019 model including a <a href=\"https://www.theverge.com/2019/7/8/20683429/sony-xperia-1-review-android-cinealt-color-screen-21-9-tall-price\">manual 4K video mode</a>, the Sony <a href=\"https://www.theverge.com/21322518/sony-xperia-1-ii-review-smartphone-new-camera-photo-pro\">Alpha-like manual camera</a> mode in the 2020 model, and last year’s Xperia 1 III with <a href=\"https://www.theverge.com/22580552/sony-xperia-1-iii-review-price-specs-screen-camera\">dual phase-detect and tracking AF</a> technologies. What might come of the Xperia 1 IV camera remains to be seen, but the phone still looks like it has a dedicated shutter button on the side.</p><p id=\"BHQgtM\">The leaked Xperia 1 IV will come with flagship specs, <a href=\"https://m.weibo.cn/detail/4724754643157263\">according to Weibo user Zackbucks</a>, who <a href=\"https://www.reddit.com/r/SonyXperia/comments/n8ujre/zackbuks_xperia_1_iii_will_be_launched_on_june_1/\">leaked release details</a> of the Xperia 1 III last year. The leaked specs include a Snapdragon 8 Gen 1 chip, 256 or 512 storage, and “up to” 16GB of RAM. The battery also looks like it’s getting an upgrade compared to last year’s Xperia 1 III, pumping up from 4,500mAh to 5,000mAh — and it may be capable of 45W fast charging. According to the same source, the Xperia 1 IV may be announced in May.</p><p id=\"eWCbOD\">Of course, the biggest problem with the Xperia 1 III (and even the Xperia 1 II) was the price. At $1,300, it was a tough sell with no mmWave 5G capability and only two years of promised Android OS support. If the Xperia 1 IV retains the same price point, it will still be more expensive than the larger 6.8-inch Samsung Galaxy S22 Ultra — which has an <a href=\"https://www.theverge.com/22941246/samsung-galaxy-s22-ultra-review-price-screen-specs-stylus\">impressive camera system</a> and promises <a href=\"https://www.theverge.com/2022/2/9/22923577/samsung-galaxy-unpacked-android-upgrades-4-years\">“up to four generations”</a> of Android OS updates. Sony did <a href=\"https://www.sony.com/electronics/support/articles/00274395\">release an Android 12 update</a> for the Xperia 1 III, but unfortunately for its predecessor Xperia 1 II, it hasn't widely been made available yet.</p><p id=\"3EA8R8\">Sony’s Xperia phones sort of have a cult following but never quite make it to mainstream smartphone status due to restrictions that usually mean purchasing from Sony directly or through Amazon. It’s good to see Sony still making attempts, though, and if the price is right for the Xperia 1 IV, it could deserve some real mainstream recognition.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3_cEB0hw20XIhZ-4RPrUJ6j__ak=/0x20:1024x556/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23278195/SONY_XPERIA_1IV_5K1_1_1024x576.jpg",
  "description": "Sony’s next flagship phone might have a headphone jack.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}