{
  "title": "Sony and Nintendo update gaming subscription auto-renewals after UK investigation",
  "url": "https://www.theverge.com/2022/4/13/23023955/sony-nintendo-microsoft-updating-subscription-practices-uk-competition-markets-authority-cma",
  "date": "2022-04-13T19:50:16.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yv_vW_w4-0EZgOfZyL01Wompnoc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745869/acastro_210113_1777_gamingstock_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"hSxrCE\">Sony and Nintendo are making changes to their gaming subscriptions in the UK after working with a regulator in the country (<a href=\"https://www.engadget.com/sony-nintendo-stop-unused-game-subscription-billing-uk-131717625.html?src=rss\">via <em>Engadget</em></a>). The UK’s Competition and Markets Authority (CMA) has raised concerns about how people may be charged for subscriptions indefinitely until they proactively end them, which could mean they’re paying for services they don’t use.</p><p id=\"Yti6rL\">For PlayStation Plus, “Sony has agreed to put in place measures to protect customers who haven’t used their memberships for a long time but are still paying,” <a href=\"https://www.gov.uk/government/news/cma-welcomes-sony-and-nintendo-s-gaming-subscription-improvements\">the CMA said</a>. “Sony will contact these customers to remind them how to stop payments and, if they continue not to use their memberships, Sony will ultimately stop taking further payments.” We’ve reached out to Sony to ask if these changes will apply only in the UK or will also be extended to other countries.</p><p id=\"MiEUF8\">The CMA “also engaged with Nintendo, which changed its business practices during the course of the investigation so that Nintendo Switch Online Service is no longer sold with automatic renewal set as the default option,” the regulator said. “This means people will not be automatically entering into renewing contracts, addressing a number of the CMA’s concerns about people becoming locked in.” The change applies in the “Nintendo eShop and on the Nintendo website in all countries and regions that are operated by Nintendo of Europe,” the company said in a statement to <em>The Verge</em>.</p><p id=\"CQ1J4TN8G-1649866946.921409-thread-list-threads-flexpane_1649871546.517059\">Microsoft <a href=\"https://www.theverge.com/2022/1/27/22904713/microsoft-xbox-subscriptions-changes-uk-cma-regulator\">also committed</a> to changes in January in response to CMA concerns, including contacting customers who were still paying for memberships they hadn’t used in a long time. At the time, Microsoft said to <em>The Verge</em> that it would initially roll out its changes in the UK and make them available globally soon.</p><p id=\"5EqqxQ\">The CMA first announced it was investigating the auto-renewal practices of the three companies <a href=\"https://www.gov.uk/cma-cases/online-console-video-gaming\">in 2019</a>. That investigation is now closed, the CMA said Wednesday.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/g9sxnMP2FQ1Ar7x-gFZeadmFNSU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22236383/acastro_210113_1777_gamingstock_0002.jpg",
  "description": "A UK regulator has raised concerns.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}