{
  "title": "Sony is still struggling with PS5 supply",
  "url": "https://www.theverge.com/2022/2/2/22913870/sony-earnings-q3-2021-ps5-sales-vs-ps4",
  "date": "2022-02-02T07:17:41.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Rs7ttZ4ViF3jVNaawdRpPh_z7_0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70461187/vpavic_4278_20201030_0206.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"B5k7tT\">Sony shipped just 3.9 million PlayStation 5 consoles in its all-important holiday quarter, a slight bump over the previous quarter’s figure of 3.3 million, demonstrating how the electronics giant is still struggling to meet demand during the ongoing global supply chain crunch. 17.3 million units in total have been shipped as of December 31st, nearly three million fewer than the PlayStation 4 had managed at the equivalent point after its release. The PS4, however, was easily found on store shelves during its first year on sale, whereas we don’t yet have a good measure of true demand for the PS5.</p><p id=\"SYG4sW\">The gaming division’s revenue was down 8 percent year on year to 813.3 billion yen (~$7.09 billion), but operating profit rose 12.1 percent to 92.9 billion yen (~$810 million). That’s what you’d expect a year removed from a major console launch — Sony still can’t make enough loss-making PS5 hardware, but that has a positive effect on the bottom line this early into the product’s life cycle. Sony would be making less profit each quarter if it were able to satisfy demand.</p><aside id=\"Nx2rCQ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Why the global chip shortage is making it so hard to buy a PS5\",\"url\":\"https://www.theverge.com/2021/8/31/22648372/willy-shih-chip-shortage-tsmc-samsung-ps5-decoder-interview\"}]}'></div></aside><p id=\"7kV8Zw\">PlayStation is now Sony’s most important individual division, accounting for more than a quarter of the company’s overall revenue and almost a quarter of its operating profit. Sony has revised its full-year 2021 gaming revenue forecast down by 6 percent to 2.73 trillion yen because of lower than expected PS5 sales, indicating its supply challenges are going to continue for the short term at least. The operating profit forecast has been increased 6 percent to 345 billion yen accordingly. Full-year PS5 shipments are now expected to reach 11.5 million units, down from 14.8 million. </p><p id=\"52ieDN\">Sony’s crucial image sensor division had a good quarter, with sales increasing 22 percent year on year to 57.8 billion (~$504 million). Operating profit was up 26 percent to 13.3 billion yen (~$116 million), though Sony attributes 12 billion yen of that to the weakening yen. Sony says the revenue jump was thanks to higher sales of image sensors for smartphone cameras, a larger portion of which were premium products.</p><p id=\"bzDWy2\">The movie division saw a huge increase in revenue, jumping 141 percent year on year to 461.2 billion yen ($4.02 billion). <em>Spider-Man: No Way Home</em> and <em>Venom: Let There Be Carnage</em> contributed to much higher theatrical revenues than a year before, while Sony says its TV productions business got a boost by licensing <em>Seinfeld. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/o1QgV4Y8bfdC1r8LhZqb6LO8WPw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22015302/vpavic_4278_20201030_0206.jpg",
  "description": "The problem is supply, not demand",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}