{
  "title": "Sony is buying Jade Raymond’s Haven Studios as part of its live service push",
  "url": "https://www.theverge.com/2022/3/21/22989187/sony-playstation-haven-studios-acquisition-jade-raymond-new-multiplayer-game",
  "date": "2022-03-21T16:08:45.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"Inside The 2016 E3 Electronic Entertainment Expo\" src=\"https://cdn.vox-cdn.com/thumbor/4xQzmJNT-096K2VPIcZ1543UKW0=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70652321/539774786.0.jpg\" />    </figure>  <p id=\"R8hgpM\">Sony announced Monday that it has entered an agreement to acquire Montreal-based Haven Studios, which is founded and led by veteran game designer Jade Raymond. Haven and Sony originally announced a partnership <a href=\"https://www.theverge.com/2021/3/16/22334101/jade-raymond-haven-game-studio-playstation\">just over a year ago</a>, but now Sony is bringing Haven into the fold as one of its first-party PlayStation studios. The price of the deal wasn’t disclosed. </p><p id=\"hvYrP8\">The first title from Haven will be a new AAA multiplayer game, <a href=\"https://blog.playstation.com/2022/03/21/welcoming-haven-studios-to-the-playstation-studios-family/\">Raymond said in a blog post</a>, though it’s unclear when we might be able to play it. Here’s her description of the game:</p><blockquote><p id=\"b2Ho9L\">Our first new IP for PlayStation is on track to deliver a AAA multiplayer experience with a vision to build a systemic and evolving world focused on freedom, thrill, and playfulness that will keep players entertained and engaged for years.</p></blockquote><p id=\"4xVRXw\">Based on <a href=\"https://www.businesswire.com/news/home/20220321005315/en/\">a press release</a>, it sounds as if the game could be a PlayStation 5 exclusive. PlayStation boss Jim Ryan said that the game will “flex the power of PlayStation 5,” while Raymond said that “we intend to fully embrace the incredible capabilities of the PS5 to create new worlds that inspire players and allow them to connect in new ways.” The acquisition also means Sony will have its first PlayStation studio in Canada. </p><p id=\"ceg11v\">The Haven acquisition follows Sony’s major announcement that it plans <a href=\"https://www.theverge.com/22910846/sony-bungie-acquisition-playstation-destiny-halo\">to acquire <em>Destiny</em> creator Bungie</a>, and both signal Sony’s intent to get into live service games in a big way. Investing in live service games “allows us to build larger worlds, it allows us to create really meaningful social connections between players,” PlayStation Studios head Hermen Hulst said in an interview <a href=\"http://GamesIndustry.biz\"><em>GamesIndustry.biz</em></a>. Sony has also probably seen the massive financial success of live service games <a href=\"https://www.theverge.com/2022/2/1/22912075/sony-bungie-acquisition-fortnite-playstation-destiny-live-service-games\">like <em>Fortnite</em></a> and <em>Call of Duty: Warzone</em> and wants to bring its own take on those types of games to PlayStation platforms.</p><p id=\"IZQmKE\">Raymond established Haven Studios after leading Google’s first-party games studio for Stadia, which the search giant <a href=\"https://www.theverge.com/2021/2/1/22260803/google-stadia-game-development-studio-shut-down-jade-raymond\">shut down last year</a>. She has also held major roles at studios including Electronic Arts and Ubisoft. </p><aside id=\"m5yVZG\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Big video game companies just can’t stop buying studios\",\"url\":\"https://www.theverge.com/2022/1/31/22911408/sony-bungie-deal-zynga-microsoft-blizzard-gaming-acquisition\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/YCjTr2NL4jos7ggO7ZwC1_eE0Wo=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23333957/539774786.jpg",
  "description": "The deal follows Sony’s acquisition of Bungie.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}