{
  "title": "Sony announces $200 LinkBuds S with ANC and lightweight design",
  "url": "https://www.theverge.com/2022/5/18/23124164/sony-linkbuds-s-announced-features-price-release-date-earbuds-headphones",
  "date": "2022-05-18T16:00:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/DnMx4Rav2gNmzpyg0XiIh-v8Gzg=/0x3:2040x1363/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883385/linkbuds2.0.jpg\" />        <figcaption><em>The LinkBuds S come in black or white.</em> | Image: Sony</figcaption>    </figure>  <p id=\"rKdY3G\">Sony is indeed adding a new product to its lineup of earbuds. Today, the company announced the $199.99 LinkBuds S. While they share branding with the <a href=\"https://www.theverge.com/22933521/sony-linkbuds-earbuds-review-features-specs\">open-design LinkBuds released earlier this year</a>, the “S” model have a more conventional form factor and in-ear fit. Available in black, white, or beige (exclusively at Best Buy), the LinkBuds S have a compact design and weigh just 4.8 grams each. </p><p id=\"mRrdob\">Despite their small presence on the scale, Sony’s latest earbuds don’t go light on features: they include active noise cancellation, an ambient sound / transparency mode, and support for the company’s LDAC Bluetooth codec. Like the standard LinkBuds, Sony is positioning these as earbuds you can wear all day and “link” your outside and digital lives with intelligent software features. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C7lgVDY60zBFE4JkTzbaDL_MqQw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23537929/1652807988_df21c85817e709091893290e4c8746ac.jpeg\">      <cite>Image: Sony</cite>      <figcaption><em>The earbuds offer active noise cancellation and also support Sony’s LDAC codec.</em></figcaption>  </figure><p id=\"mcedHd\">The LinkBuds S can automatically start playing music immediately after you put them in, or pick up from a preferred Spotify playlist, or start playing relaxing soundscape audio tracks after you’ve just concluded a work call. They also include the usual set of Sony features, like adaptive sound control, letting you customize levels of noise cancellation and ambient sound depending on your location or current activity.</p><p id=\"MtDhp7\">Battery life is rated at six hours with ANC and 20 hours when you factor in recharges from the case. The LinkBuds S are IPX4 water resistant as well. Unfortunately, Sony omitted wireless charging from these earbuds, which is a rough omission given their premium price.</p><p id=\"rgOcXO\">The LinkBuds S will be available on May 20th and go up for preorder starting today. I’ve been testing them for several days, and you can <a href=\"https://www.theverge.com/e/22887358\">read my impressions in <em>The Verge’s</em> full review</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rAOOZmaB9SclWeSj_YcI6_tEMc8=/0x149:2040x1217/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23537452/linkbuds2.jpg",
  "description": "They’ll be available on May 20th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}