{
  "title": "Sony LinkBuds S review: supreme comfort doesn’t come cheap",
  "url": "https://www.theverge.com/23123317/sony-linkbuds-s-earbuds-headphones-review",
  "date": "2022-05-18T16:00:00.000Z",
  "author": "Chris Welch",
  "content": "  <p>An airy fit, ANC, and LDAC all in one pricey package</p> <p class=\"p--has-dropcap p-large-text\" id=\"Qk5fPj\">Sony’s LinkBuds S are the company’s latest earbuds, fitting into a lineup that consists of the flagship <a href=\"https://www.theverge.com/22523584/sony-wf-1000xm4-wireless-earbuds-headphones-review\">WF-1000XM4s</a>, the very unique <a href=\"https://www.theverge.com/22933521/sony-linkbuds-earbuds-review-features-specs\">LinkBuds</a>, and the entry-level <a href=\"https://www.theverge.com/22828293/sony-wf-c500-earbuds-review-features-price\">WF-C500s</a>. Though they share a name with the open-air LinkBuds, the “S” model earbuds have a far more conventional design that seals in the ear with silicone tips. This makes it possible for them to include active noise cancellation, which the regular LinkBuds lack, and Sony also added support for its higher-quality LDAC Bluetooth codec. </p><p id=\"XQCU0J\">At $199.99, they cost only $20 more than the LinkBuds. But the two products have very different purposes and distinct target customers. The standard LinkBuds are fully open, meaning you’ll hear outside, ambient noise at all times. This might appeal to people who don’t like traditional ear tips and prefer to maintain complete awareness of their surroundings. The LinkBuds are also some of the best-performing earbuds I’ve ever tested for voice calls. </p><p id=\"RrGOw9\">The LinkBuds S attempt to toe the line between the LinkBuds and 1000XM4s and deliver the best of both worlds: they’re more comfortable for extended listening than the pricier flagship earbuds — thanks in large part to a smaller, lighter design. And while nothing beats an open design for natural ambient sound, Sony’s transparency mode is better than ever. The sound quality and noise cancellation aren’t fully up to par with the $279.99 1000XM4s, but might rank as good enough for many people in exchange for the outstanding comfort these earbuds provide.</p><div id=\"gvpjLF\"><div data-anthem-component=\"scorecard:11244484\"></div></div><p id=\"nKJ7Im\">I’ve been testing the black LinkBuds S, which have a textured finish that’s almost coarse — especially the case. It’s reminiscent of the sandstone texture from early OnePlus phones. I really came to like the in-hand feel, and it also makes both the case and earbuds impervious to fingerprints. Sony also provided a set of the white LinkBuds S, and though the hardware has a smoother feel, I think both look equally sharp. </p><p id=\"vAIhOg\">But comfort and fit are more important than style, and Sony is touting the lightweight, small design of the LinkBuds S. Each earbud weighs just 4.8 grams, making them feel genuinely airy when you pluck them from the case. For comparison, the WF-1000XM4 buds each weigh 7.3 grams, and the AirPods Pro are 5.4 grams. With these, it almost seems like you’re holding an empty earbud shell. Eyeing the LinkBuds S side by side with the 1000XM4s, the size reduction is very noticeable and substantial. Sony includes four pairs (XS, S, M, L) of silicone ear tips in the box. Surprisingly, the default medium tips provided a great seal for me, even though I usually reach for the large tips right away. Just goes to show that all earbuds are different, and the contours and structure of the earbud hardware can be a difference maker. </p><p id=\"A631zd\">The LinkBuds S are delightfully comfortable, and I had no issue wearing them for hours at a time. They stayed planted in my ears while talking, eating, and during a treadmill run. I only wish that Sony had built-in vents or some other way of alleviating ear pressure and the “plugged up” feeling. Because even with how light they are, you can still experience that with these. The charging case is a nice size and easily pocketable, but it only tops up over USB-C; there’s no wireless charging. That’s tough to accept for $200.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DGoFNKK9gKcFd5iHf0q8ebJg6T4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23535745/DSCF7972edit.jpg\">      <figcaption><em>Sony’s family of earbuds: the WF-C500, LinkBuds, LinkBuds S, and WF-1000XM4.</em></figcaption>  </figure></div><p id=\"csOJUT\">Active noise cancellation on the LinkBuds S is no match for the 1000XM4s, but it’s certainly competent and did the trick for suppressing distractions when I was working from my local coffee shop. Sony is continuing to improve upon its transparency mode, and it’s sounding more and more natural. It’s still not AirPods level, but it’s in spitting distance and a far cry from the digitized, over-processed ambient sound modes that were the norm a couple years ago. You control the LinkBuds S with taps on the earbuds: the left bud toggles between ANC and ambient mode, and the right is for track controls. (Tap once to play/pause, twice to skip tracks, three times to go back, etc. Very standard stuff.) You can also optionally add a shortcut for instantly starting music from Spotify on your phone. But you’ve got to have the Spotify app open on your phone beforehand for this to work, otherwise you’ll hear an error message. </p><p id=\"2BsIJ1\">If there’s one reality check for the LinkBuds S, it’s sound performance. Sony had to go with 5-millimeter drivers to achieve the weight and compact dimensions it wanted. Just as I said in my review of the WH-1000XM5 headphones, driver size isn’t everything: the fantastic 1000XM4 earbuds use 6-millimeter drivers and Sony has found ways to cheat physics and squeeze out impressive bass from those even when some competitors are using significantly larger drivers. But the same can’t be said of the LinkBuds S. Both at the high end and with lower frequencies, their audio sounds slightly reined in. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/htCcTY9FeUFY5NiYE8ZhbLTIS34=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23535964/DSCF7974.jpg\">      <figcaption><em>There’s mesh covering the external microphones.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Fm4ywNDOtDLTK5qM-WFWskcEIH4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23539325/DSCF7971_2.jpg\">      <figcaption><em>The LinkBuds S have ear detection sensors for auto-pause.</em></figcaption>  </figure></div></div></div><p id=\"7rM8me\">By no means do they sound <em>bad</em>. Clarity is excellent, especially when it comes to mids and vocals. HAIM’s “Lost Track” and Angel Olsen’s “All The Good Times” demonstrate how well these earbuds can showcase vocals and tracks with many layers. There’s nothing muddled or messy about them, and all the acoustic instruments on Molly Tuttle’s “She’ll Change” come through with pleasant warmth and jangle. But I could’ve used more low-end kick behind the driving rhythm of Orville Peck’s “Daytona Sand.” </p><p id=\"TX5ZVB\">More often than not, I was satisfied with the LinkBuds S, and they blow away the regular LinkBuds in this department. But they didn’t meet my expectations for $200 earbuds every time. Their soundstage is on the narrower side, and everything sounds in the middle of your head — whereas true wireless earbuds with richer audio (like the 1000XM4s) are more immersive and enveloping. LDAC can help bring out more detail if you’ve got an Android phone, and Sony says that the LinkBuds S will support <a href=\"https://www.bluetooth.com/learn-about-bluetooth/recent-enhancements/le-audio/\">Bluetooth LE Audio</a> after a firmware update in the coming months.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CVNRuSSpzWwrUkYAuZ8TfMYjjKY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23536085/DSCF7950.jpg\">      <figcaption><em>Sony’s LinkBuds and LinkBuds S have completely different designs.</em></figcaption>  </figure></div><p id=\"bzP2di\"> If you’ve been wondering, the S in LinkBuds S is supposed to stand for their smarts. One of Sony’s taglines for these earbuds is “never off,” and the company envisions people wearing them throughout the day, with the buds automatically reacting to different activities, changes in location, and so on. Sony’s headphones have long been able to apply custom noise cancellation and transparency settings for places you frequent or if they detect movement (like walking or running).</p><p id=\"YoYe04\">The LinkBuds S attempt to step this up with new features like “wear to play,” where the earbuds will immediately begin playing music as soon as you put them in. With the “after call” option, you can have them automatically start up a Spotify playlist after you’ve wrapped up a teleconferencing call. Both of these tricks are exclusive to Android. But they’re also awkward to use, requiring multiple app installations and only supporting audio from Spotify and <a href=\"https://endel.io/\">Endel</a>, a service geared towards soundscapes and other audio that help with concentration. </p><div><div id=\"9Y4uFo\"><div data-anthem-component=\"aside:11243708\"></div></div></div><p id=\"bEUS5l\">The tried and true Sony features like adaptive sound control, EQ customization, and even Speak to Chat continue to work just fine, but the new extras are underwhelming and come off as half-baked toss-ins. It seems like Sony is starting to hit a ceiling for what it can pull off in terms of bonus functionality when it doesn’t have control over a whole product ecosystem like Apple, Samsung, or Google. It’s got no answer for tricks like head-tracking spatial audio or automatic device switching. And the LinkBuds S continue to go without multipoint Bluetooth. Adding this would really help up the convenience factor and allow for better multitasking — here’s hoping it shows up in Sony’s next generation of earbuds. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XXPNzB9yW5rB3DxmsNLahdv9-GQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23536114/DSCF7969.jpg\">      <figcaption><em>Sony’s LinkBuds S are incredibly light and comfortable.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PMZJJ7D_5WnpemSrHJd-m8y-IgI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23539409/DSCF7967.jpg\">      <figcaption><em>They’re significantly smaller than the 1000XM4s.</em></figcaption>  </figure></div></div></div><p id=\"JnilRl\">Voice call performance on the LinkBuds S has been very good, even if they can’t fully duplicate the wow factor of the open-style model. They still did well at separating my voice in noisy environments, and a mesh covering over the outer microphones helps avoid wind distortion. Battery life on the LinkBuds S is estimated to be around 6 hours with ANC enabled, and a total of 20 hours with case recharges. So far in my time reviewing the earbuds, those numbers seem on the mark, and I don’t think you could reasonably expect much more given their size and weight. As with the rest of Sony’s line, they’re rated IPX4 for water resistance, making them suitable for exercise. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/608b7p4JXQnKcigZUMnjEoLWEFY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23536275/DSCF7983.jpg\">  </figure></div><p id=\"Ktils6\">The LinkBuds S are perhaps the most comfortable earbuds that Sony has ever made, but they don’t come cheap. There’s no shortage of competition in their $200 price range. Some alternatives will get you superior noise cancellation or bigger, bassier sound. Others might outlast the LinkBuds S in battery life or offer more features like wireless charging. When so many people already swear by the comfort of AirPods or Galaxy Buds, Sony’s latest earbuds face an uphill battle to prove their worth. </p><p class=\"c-end-para\" id=\"YBRVMC\">But I plan on keeping them in my earbuds rotation for situations where I need all-day comfort, strong voice call performance, and capable noise cancellation. There’s room for improvement, but all I know is I can barely tell when I’m wearing these buds. That’s music to my ears, and maybe the same will be true for you.</p><p id=\"htoLlL\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GDUDCWQ96NqCNwjnk4Cns0PFpc4=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23535727/DSCF7987.jpg",
  "description": "Sony’s new earbuds are its most comfortable yet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}