{
  "title": "Sony and Honda plan to make electric vehicles together",
  "url": "https://www.theverge.com/2022/3/4/22961207/sony-honda-electric-car-new-company-2025-date",
  "date": "2022-03-04T06:38:46.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/r4yl-ukyocgc4287Iu6JuvYIj1g=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70577524/sony_vision_s_9852.0.jpg\" />    </figure>  <p id=\"hQqnzu\">Sony and Honda are planning to form a new company to design and sell electric vehicles together. The venture hasn’t been finalized just yet, but the two companies have signed a memorandum of understanding that states their intent. The as-yet unnamed new company is expected to be formed this year, with sales of the first EV model planned for 2025.</p><p id=\"plC7KS\">Honda will manufacture the first model, with the new company handing the vehicle’s design, development, and sales, and Sony set to develop a mobility service platform. The partnership is intended to combine Honda’s expertise in making and marketing cars with Sony’s capabilities in image sensors, telecommunications, and entertainment. </p><p id=\"4ZpjKK\">“Sony’s purpose is to ‘fill the world with emotion through the power of creativity and technology,” Sony CEO Kenichiro Yoshida says in a <a href=\"https://global.honda/newsroom/news/2022/c220304beng.html\">statement</a>. “Through this alliance with Honda, which has accumulated extensive global experience and achievements in the automobile industry over many years and continues to make revolutionary advancements in this field, we intend to build on our vision to ‘make the mobility space an emotional one,’ and contribute to the evolution of mobility centered around safety, entertainment and adaptability.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eo_34TGLdCF4-bVk7zd3z5sri44=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23287563/vision_s_01.jpg\">      <figcaption>Sony’s previously announced Vision-S concept EVs.</figcaption>  </figure><p id=\"5ZItxw\">“The New Company will aim to stand at the forefront of innovation, evolution, and expansion of mobility around the world, by taking a broad and ambitious approach to creating value that exceeds the expectations and imagination of customers,” says Honda CEO Toshihiro Mibe. “We will do so by leveraging Honda’s cutting-edge technology and know-how in relation to the environment and safety, while aligning the technological assets of both companies. Although Sony and Honda are companies that share many historical and cultural similarities, our areas of technological expertise are very different. Therefore, I believe this alliance which brings together the strengths of our two companies offers great possibilities for the future of mobility.”</p><p id=\"KTVU6W\">Sony has signaled its intentions to enter the automotive world for a while, but this marks its first concrete move into the commercial industry. At CES 2020, Sony showed off an electric concept car called the Vision-S, and followed it up at CES 2022 with the Vision-S 02. At that time Sony announced plans to establish an operating company called Sony Mobility by the spring of 2022; it would appear that the new Honda partnership has rendered that idea moot. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Z8tziUSo6_f3ot2VMa4enY35tZU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19585591/sony_vision_s_9852.jpg",
  "description": "Sony gets serious about EVs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}