{
  "title": "Sony’s PS Plus tiers complicate the simplicity of subscription services",
  "url": "https://www.theverge.com/2022/3/30/23003225/sony-playstation-plus-essential-extra-premium-complicated",
  "date": "2022-03-30T17:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/35TFzAGEVgvjz7og7CF_sLgcMJ0=/0x1:1088x726/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70690200/d06f2ea58af14c3828a688d7e0625fe7d6f5170d.0.jpg\" />        <figcaption><em>Sony’s PlayStation Plus.</em> | Image: Sony</figcaption>    </figure>  <p id=\"HzcEF0\">Sony has announced a <a href=\"https://www.theverge.com/2022/3/29/23001164/sony-playstation-plus-subscriptions-price-release-date\">new range of PlayStation Plus subscriptions</a>: PlayStation Plus Essential, PlayStation Plus Extra, and PlayStation Plus Premium. Prior to their official unveiling, the plans were <a href=\"https://www.theverge.com/2021/12/3/22816087/sony-playstation-5-game-subscription-service-xbox-games-pass-now-spartacus\">characterized</a> as an attempt to respond to Microsoft’s Xbox Game Pass, offering various selections of games to download or stream as part of a single monthly subscription. But now that they’re official, the truth is a lot more complicated.</p><p id=\"037S3V\">Microsoft’s Xbox Game Pass pitch is relatively simple. You get access to a broad array of games as part of a subscription, and Microsoft has committed to releasing its major first-party games on its subscription service the day they release. $9.99 gets you games on either Xbox <em>or </em>PC, or $14.99 gets you both, plus the ability to stream games over the cloud (handy if you want to play them on more portable devices like phones) as well as access to online multiplayer thanks to including Xbox Live Gold.</p><p id=\"nitFHy\">But Sony has taken a different approach. It’s <a href=\"https://www.eurogamer.net/articles/2022-03-29-new-games-wont-be-added-to-sonys-ps-plus-service-says-jim-ryan\">not committing</a> to releasing its first-party games on its subscription service as they launch, and it’s split PlayStation Plus across three different tiers, which offer more games the more you pay. They’ll launch in Asian markets in June, with North America, Europe, and others following closely behind. It’s a much-needed step towards improving Sony’s subscription offerings, but in the process, Sony has created a complicated array of price points to choose between. </p><div class=\"c-float-right\"><aside id=\"knF5Ga\"><q>There are nine ways to pay for PS Plus in the US</q></aside></div><p id=\"jDJeNY\">The $9.99 PlayStation Plus Essential tier will offer the same as what PlayStation Plus has now — including the dozen-plus games already <a href=\"https://twitter.com/jmdornbush/status/1508900788139003906\">available as the PlayStation Plus Collection</a>. Next up, the $14.99 PlayStation Plus Extra gets you up to 400 PS4 and PS5 games to download. Finally, the $17.99 PlayStation Plus Premium gets you up to an extra 340 games, which include games from the original PlayStation, PS2, PSP, and PS3. Some of these additional games are available to download, but others — like those originally released for the PS3 — can only be streamed. </p><p id=\"6oV603\">There are also discounts available if you choose to pay for a subscription on a quarterly or yearly basis. I won’t list all the prices here (you can check out <a href=\"https://blog.playstation.com/2022/03/29/all-new-playstation-plus-launches-in-june-with-700-games-and-more-value-than-ever/\">Sony’s official press release</a> for that), but in total, you’re left with a choice of nine different ways to pay for PlayStation Plus in the US alone. It’s a lot of choices, and it means there are a lot of decisions to make.</p><aside id=\"5tzwII\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How the new PlayStation Plus compares to Xbox Game Pass and Switch Online\",\"url\":\"https://www.theverge.com/23001397/xbox-game-pass-nintendo-switch-online-playstation-plus-comparison-essential-extra-premium\"}]}'></div></aside><p id=\"jSo9I3\">If you find that complicated, then I wouldn’t blame you. With Xbox Games Pass Ultimate, you could conceivably never pay separately for one of Microsoft’s games ever again — they’re all included. But Sony seems to be pitching its subscription tiers as an additional purchase. In Sony’s world, you still pay as much as $70 for its big-budget games at launch, but you might <em>also </em>pay for a subscription that bulks out your library with a selection of slightly older and even retro titles. And exactly how many games you get comes down to how much — and how often — you’re willing to pay.</p>  <figure class=\"e-image\">        <img alt=\"PS3\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oyP9LMZPwR4oEOnEkqjzxwGL0vE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19434204/vpavic_191205_untitled_0018_Edit.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>With no hardware backwards compatability, Sony is using streaming to offer PS3 games.</em></figcaption>  </figure><p id=\"IQDYXj\">Yet, despite its complexity, Sony’s new PlayStation Plus tiers are arguably simpler than the subscriptions it already offers. Currently, if you want to both stream games via PlayStation Now <em>and</em> get access to PlayStation Plus, then you have to pay for two entirely separate subscriptions. That’s not an uncommon situation, apparently, with <a href=\"https://www.gamesindustry.biz/articles/2022-03-28-playstations-jim-ryan-our-games-could-suffer-if-we-put-them-straight-into-ps-plus\">PlayStation CEO Jim Ryan telling <em>GameIndustry.biz</em></a>, three-quarters of PlayStation Now subscribers also hold a PlayStation Plus subscription. </p><p id=\"ae9OqT\">The pricing of the new PlayStation Plus Premium tier, as analyst <a href=\"https://twitter.com/ZhugeEX/status/1508788345547206663\">Daniel Ahmad points out on Twitter</a>, suggests that it’s targeted at exactly these users. PlayStation Plus (soon to be re-branded as its “Essential” tier) cost $9.99 a month, and PlayStation Now also costs $9.99. Paying for them both together would set you back $19.98 a month, compared to $17.99 for the new PlayStation Plus Premium. Pay yearly, and the two set you back $119.98 separately or $119.99 as part of PlayStation Plus Premium. In other words, paying for PlayStation Plus Premium will be a no-brainer for three-quarters of PlayStation Now subscribers.</p><div class=\"c-float-right\"><aside id=\"BZ4nZL\"><q>PlayStation Now and PlayStation Plus are now one</q></aside></div><p id=\"YIVZpx\">But that still doesn’t explain PlayStation Plus Extra, Sony’s middle tier that offers PS4 and PS5 games. At $14.99, it directly competes with Xbox Game Pass Ultimate but lacks any of its cloud gaming features. With just $3 separating it from the PlayStation Plus Premium tier, it almost feels like an attempt to nudge customers up to Sony’s most expensive subscription.</p><p id=\"BpdvMR\">It’s not unusual for music or video subscription services to offer a couple of different tiers. Netflix offers three different tiers, which differ in terms of their video quality (4K vs HD vs SD) and the maximum number of streams you can watch at a time, while HBO Max offers a cheaper ad-supported tier. On the music front, Spotify has a single paid tier but offers discounts if you subscribe as a family or a couple, while Apple recently added a <a href=\"https://www.theverge.com/2021/10/18/22733053/apple-music-voice-plan-playlists-price-siri\">discounted plan</a> that restricts it to being controlled with Siri commands. </p><p id=\"VrE8qH\">In all of these non-gaming cases, the different price tiers all offer exactly the same content and drop their quality levels if you pay less. But each tier of PlayStation Plus offers radically different amounts of content for your money.</p><div class=\"c-float-right\"><aside id=\"tWrewE\"><q>Sony is stitching its services together</q></aside></div><p id=\"tFRggQ\">In ditching PlayStation Now and merging it with PlayStation Plus, Sony appears to be trying to simplify its subscription offering. But, in contrast, Microsoft has spent years building an all-in-one service from the ground up. When Sony abandoned backward compatibility for the PS3 with the PS4, Microsoft would go on to make <a href=\"https://www.theverge.com/2015/11/9/9695808/xbox-one-xbox-360-backwards-compatibility-games-list\">hundreds of Xbox 360</a> and <a href=\"https://www.theverge.com/2017/6/11/15779896/xbox-discs-backwards-compatibility-one-original-games-e3-2017\">original Xbox games</a> playable on the Xbox One, and it continued the initiative on to the Series X and S. While Sony was allowing its PlayStation Now service to <a href=\"https://www.theverge.com/2019/12/5/20993828/sony-playstation-now-cloud-gaming-gaikai-onlive-google-stadia-25th-anniversary\">languish in relative obscurity</a>, Microsoft was building out its cloud gaming service and releasing its <a href=\"https://news.xbox.com/en-us/2021/12/08/halo-infinite-available-now-with-xbox-game-pass/\">biggest</a> <a href=\"https://support.forzamotorsport.net/hc/en-us/articles/4402249796243-Forza-Horizon-5-Announce-FAQ\">games</a> there on day one. Perhaps most significantly, Microsoft has been on the kind of acquisition spree that’ll make gamers sit up and take notice when it promises to include its first-party titles in its subscription service. </p><p id=\"l14752\">The result is that Sony feels like it’s taking a patchwork approach to its PlayStation Plus tiers. It’s consolidating here, bundling there, and making its older titles available via subscription long after their initial release. Some games for Sony’s older platforms will be available to download, but cloud streaming is needed to offer PS3 games because hardware backwards compatibility isn’t possible. It’s stitching together these different initiatives, but there are gaps in its approach.</p><p id=\"6hykFJ\">That doesn’t make Sony’s revamped subscription offerings a bad deal. It just means you might need to pay close attention to the fine print.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fektSlhu9vVHhAeOQytecQn9yJ4=/0x78:1088x648/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23355405/d06f2ea58af14c3828a688d7e0625fe7d6f5170d.jpg",
  "description": "Plus, Essential, Extra, Deluxe, Premium, Turbo, HD, Remix",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}