{
  "title": "Sony is buying Bungie, the developer of Destiny and original creator of Halo",
  "url": "https://www.theverge.com/22910846/sony-bungie-acquisition-playstation-destiny-halo",
  "date": "2022-01-31T18:06:43.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KZJM0ZDMUdSNPWs3UV0fkqklNOY=/85x0:1003x612/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70453862/8f2d141dbfa9c1dd61befc2de0a92266.5.jpeg\" />        <figcaption><em>It’s another blockbuster gaming acquisition.</em> | Image: Sony</figcaption>    </figure>  <p id=\"TsWQn6\"><a href=\"https://www.bungie.net/en/Explore/Detail/News/50988\">Sony is buying Bungie</a>, the developer of <em>Destiny</em> and the original creator of <em>Halo,</em> for $3.6 billion. The acquisition arrives shortly after Microsoft’s announcement that it <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">intends to acquire Activision Blizzard</a> in a deal worth $68.7 billion. Bungie will “continue to independently publish and creatively develop our games,” Bungie CEO Pete Parsons writes <a href=\"https://www.bungie.net/en-us/Explore/Detail/News/50988\">in a blog post.</a></p><p id=\"rDWXN4\">“In SIE, we have found a partner who unconditionally supports us in all we are and who wants to accelerate our vision to create generation-spanning entertainment, all while preserving the creative independence that beats in Bungie’s heart,” Parsons writes. “Like us, SIE believes that game worlds are only the beginning of what our IPs can become. Together, we share a dream of creating and fostering iconic franchises that unite friends around the world, families across generations, and fans across multiple platforms and entertainment mediums.​”</p><div id=\"g2QtoJ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bungie has limitless potential to unite friends around the world.<br><br>We have found a partner in PlayStation that shares our dream and is committed to accelerating our creative vision of building generation-spanning entertainment.<br><br>Our journey begins today.<a href=\"https://t.co/PLuVn48zdy\">https://t.co/PLuVn48zdy</a> <a href=\"https://t.co/kAhRbAg3vD\">pic.twitter.com/kAhRbAg3vD</a></p>— Bungie (@Bungie) <a href=\"https://twitter.com/Bungie/status/1488211903482527744?ref_src=twsrc%5Etfw\">January 31, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"YOvblU\">Bungie will continue to be a multiplatform and independent studio and publisher, and it will sit <em>alongside</em> the company’s PlayStation Studios developers, Jim Ryan, the president and CEO of Sony Interactive Entertainment, <a href=\"https://blog.playstation.com/2022/01/31/bungie-is-joining-playstation/\">said in a post on the PlayStation Blog</a>. “Bungie’s world-class expertise in multi-platform development and live game services will help us deliver on our vision of expanding PlayStation to hundreds of millions of gamers,” he said.</p><p id=\"kg3Nao\">Hermen Hulst, head of PlayStation Studios, reiterated that sentiment in a separate blog post. “Bungie’s technical expertise, coupled with their track record of building highly engaged communities, make them a natural fit for collaboration with PlayStation Studios,” <a href=\"https://www.sie.com/en/blog/bungie-joining-playstation-the-playstation-studios-perspective/\">he said</a>. “We are excited to make plans to share skills and expertise, and to unlock the potential in having the brilliant minds at Bungie under the PlayStation roof.”</p><p id=\"lm0EMd\">Bungie is telling the audience flatly that its future games will <em>not</em> become PlayStation exclusives. “No. We want the worlds we are creating to extend to anywhere people play games. We will continue to be self-published, creatively independent, and we will continue to drive one, unified Bungie community,” writes Bungie <a href=\"https://www.bungie.net/en/Explore/Detail/News/50989\">in an FAQ about the deal</a>. In that FAQ, Bungie also discussed how the acquisition will affect the long-running hit <em>Destiny 2:</em></p><blockquote><p id=\"QoMVqM\"><strong>Q. As a Destiny 2 player, does Bungie becoming part of PlayStation have any immediate impact on how I play and experience Destiny 2? ​</strong></p><p id=\"Yw9XIa\">No. Our commitment to Destiny 2 as a multi-platform game with full Cross Play remains unchanged.  ​</p><p id=\"s0Mz6u\">We want you to play The Witch Queen on February 22, 2022, on the platform of YOUR choice. ​</p><p id=\"b7dIFu\"><strong>Q. Will the Destiny 2 experience on non-PlayStation platforms be impacted by Bungie becoming part of PlayStation? ​</strong></p><p id=\"6CVrte\">No. We want to maintain the same great experience you already have on your platform of choice. ​</p><p id=\"hmP9LP\"><strong>Q. Will any announced seasons, events, packs, or expansions be changed or impacted by Bungie becoming part of PlayStation? ​</strong></p><p id=\"D4fnus\">No. Bungie retains full creative independence for our games and our community. Our plans for the Light and Dark Saga are unchanged, all the way through The Final Shape in 2024. ​</p><p id=\"jIIAPS\"><strong>Q. Will Destiny 2: The Witch Queen include any platform exclusives? ​</strong></p><p id=\"y0P8fP\">No. The Witch Queen will not contain any platform exclusives. Every player should have an amazing Destiny experience, no matter where you choose to play ​</p><p id=\"nypAj0\"><strong>Q. Will cross platform features, like Cross Save, Cross Play, the Destiny 2 Companion App, or third-party apps like Destiny Item Manager (DIM) be changed or removed? ​</strong></p><p id=\"QrYXHC\">No. Bungie’s commitment to cross-platform play and social features remains unchanged. We believe games are best shared with friends, wherever they choose to play, and will continue to invest in new features and platforms. ​</p><p id=\"tNS6jN\"><strong>Q. Bungie has future games in development, will they now become PlayStation exclusives? ​</strong></p><p id=\"Aw8Ona\">No. We want the worlds we are creating to extend to anywhere people play games. We will continue to be self-published, creatively independent, and we will continue to drive one, unified Bungie community. ​</p><p id=\"gvJ51Z\"><strong>Q. I play Destiny on Steam, Xbox, or Stadia – will my platform still be supported? ​</strong></p><p id=\"daxHtC\">Yes.  </p></blockquote><p id=\"m4pWWs\">The acquisition is the latest in a slate of big ones that have been announced just this month. The industry is still reeling from Microsoft’s deal for Activision Blizzard, and that arrived just over a week after the news of <a href=\"https://www.theverge.com/2022/1/10/22876184/take-two-interactive-zynga-acquisition-deal\">Take-Two’s $12.7 deal for mobile developer Zynga</a>. And last year, Sony bought up a lot of studios to bolster its PlayStation Studios family, including <a href=\"https://www.theverge.com/2021/6/29/22555358/sony-housemarque-returnal-developer-acquisition-bluepoint\"><em>Returnal</em> developer Housemarque</a> and <a href=\"https://www.theverge.com/2021/9/30/22665426/sony-buys-bluepoint-games-remake-remaster-demons-souls-shadow-ico-uncharted\"><em>Demon’s Souls</em> remake developer Bluepoint Games</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_8kP_DYbLyY3jgA9zvhIMrYZNy8=/0x21:1088x591/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23207703/8f2d141dbfa9c1dd61befc2de0a92266.jpeg",
  "description": "Another huge acquisition in the gaming industry",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}