{
  "title": "Sony reportedly plans to announce its Game Pass competitor next week",
  "url": "https://www.theverge.com/2022/3/25/22996376/sony-playstation-spartacus-subscription-game-pass-rumor-ps5",
  "date": "2022-03-25T17:17:08.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7vbq21qSpSIhHmQsHP0Rtxz46NE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70671998/vpavic_4278_20201030_0301.0.jpg\" />        <figcaption><em>It seems likely to be a combination of PlayStation Plus and Now.</em> | Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"bsVWGE\">Sony will reportedly announce its answer to Xbox Game Pass, a service that’s <a href=\"https://www.theverge.com/2021/12/3/22816087/sony-playstation-5-game-subscription-service-xbox-games-pass-now-spartacus\">currently known as Spartacus</a>, “as early as” next week, <a href=\"https://www.bloomberg.com/news/articles/2022-03-25/sony-to-unveil-playstation-subscription-as-soon-as-next-week\">according to <em>Bloomberg</em></a>. Previous reports say that Spartacus could be a combination of Sony’s two current subscription services, PlayStation Plus, and PlayStation Now. <em>Bloomberg</em> says that the service will launch featuring popular, recent games, but that it may not include the upcoming tentpole game <em>God of War: Ragnarok.</em></p><p id=\"g1aKnZ\">The service is expected to have three different tiers, which will offer different games at different price points. One tier is expected to be very similar to the current PlayStation Plus subscription, while subsequent tiers would add PS4 and PS5 games (though the latter are expected to come “in the future”), as well as “access to extended demos and the ability to stream games over the internet,” according to <em>Bloomberg</em>. Previous reports also said that the highest tier could include a library of classic games from systems like the PS2 and PSP.  </p><div class=\"c-float-right\"><aside id=\"U3tCJY\"><q>Sony seems like it’ll lean more on its back catalogue for Spartacus, rather than offer today’s new hits</q></aside></div><p id=\"U3JCka\">Sony currently has two subscription services: PlayStation Plus, which grants access to multiplayer gaming, some discounts, and a few free games a month, and PlayStation Now, which lets you play a back catalog of select PS4, PS3, and PS2 games either via cloud gaming or a download (which options are available depends on the specific title). These services, at least in my opinion, don’t hold a candle to Xbox’s Game Pass, which lets you play <a href=\"https://www.theverge.com/2022/1/25/22901755/halo-infinite-forza-horizon-5-player-numbers-microsoft-xbox-game-pass-free-to-play\">major Xbox and PC games</a> the day they launch — mostly ones published by Microsoft — along with a catalog of third-party titles.</p><p id=\"6Cu8MM\">With Spartacus, Sony seems to be looking to give PlayStation users a service they can really be excited about — though reports do make it seem like it’ll lean more on the massive PlayStation back catalog, rather than today’s new hits. </p><p id=\"GX94XV\">It’s also not clear how much it’ll cost. Currently, PlayStation Now and PlayStation Plus are $60 a year each when you buy an annual subscription, or $120 combined. That’s about the same price as the standard Game Pass subscription, and a bit less than Game Pass Ultimate, so Sony does have some wiggle room when it comes to pricing. </p><p id=\"lkxdxc\">There’s also the issue of migration — you can buy multiple months, or even years of a PlayStation Plus subscription. If the service is being replaced, how will Sony deal with switching over users who aren’t doing a month-to-month subscription? It does sound like Spartacus will have a reasonably equivalent tier, but there could aways be changes in price that will have to be factored in. </p><p id=\"VRB1mk\">From the sounds of things, we might not have to wait long to find out the answers to all the questions we have about Sony’s new service.</p><p id=\"VuXzk4\"><em><strong>Update March 25th, 1:39PM ET: </strong></em><em>Updated to mention potential questions about PlayStation Plus migration.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/POMHd2Q9hxLajMqe5KSouXoTF4o=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22015307/vpavic_4278_20201030_0301.jpg",
  "description": "It’s rumored to meld and add to PlayStation Plus and Now.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}