{
  "title": "Sony’s Xperia 1 IV delivers real zoom for a steep price",
  "url": "https://www.theverge.com/23065641/sony-xperia-1-iv-announcement-hands-on-price-specs-zoom-screen",
  "date": "2022-05-11T07:05:00.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ZeOvf4g3JuqCBJrozlDLD1fHVgY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70855421/ajohnson_220506_5203_0001.0.jpg\" />        <figcaption><em>The Xperia 1 IV brings a true optical zoom lens to a smartphone for the first time.</em></figcaption>    </figure>  <p>Real zoom for a steep price</p> <p class=\"p--has-dropcap p-large-text\" id=\"TAtJeK\">Smartphones have point-and-shoot cameras (<a href=\"https://www.theverge.com/2012/1/29/2756199/sony-cybershot-wx50-wx70-tx200v\">remember those?</a>) beat in a lot of ways, but there’s one thing traditional cameras still do better than phones: zoom. The new Sony Xperia 1 IV aims to change that with a true continuous optical zoom lens. It’s a technical achievement, for sure, but at this stage, it’s more proof of concept than game-changer.</p><p id=\"iu2oiA\">At $1599, it’s a steeply priced concept, too. To be sure, you’ll find plenty of premium specs on the device, starting with a 6.5-inch 4K (well, 1644 x 3840 but close enough) OLED with a 120Hz refresh rate. There’s also a Snapdragon 8 Gen 1 processor, IP68 waterproofing, 512GB of storage, 12GB of RAM, a 5000mAh battery, and even a headphone jack. But $1600 matches the most expensive variants of the iPhone 13 Pro Max and Samsung Galaxy S22 Ultra, both of which at least give you 1TB of storage for that kind of money.</p><p id=\"BOXdUo\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mge_xivXM2W2FLV7PACw-1nMsII=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23449187/ajohnson_220506_5203_0003.jpg\">  </figure></div><p id=\"8GTIHi\">In any case, the Xperia 1 IV has something that neither Samsung or Google offers: that continuous optical zoom lens. Sure, plenty of smartphone cameras allow you to pinch and zoom, but that’s digital rather than optical zoom. At least right now, optical zoom generally produces better results than digital since it actually uses moving lenses to magnify your subject. Digital zoom is usually just cropping in on a wider image and relying on AI to try and recreate detail it wasn’t able to capture — more like an educated guess than the ground truth.</p><p id=\"V5kJKR\">You might also have a telephoto lens on your smartphone, like the 3x lens (or 77mm equivalent, to use the film-era terms familiar to photographers) on the iPhone 13 Pro or the 10x (230mm equivalent) on the Samsung Galaxy S22 Ultra. They aren’t “zoom” lenses either, meaning they’re fixed and don’t allow you to move between focal lengths. The Xperia 1 IV’s telephoto lens is different because it does allow you to set the focal length at 85mm, 125mm, and anywhere in between.  </p><p id=\"DRXYtY\">Smartphone makers stick with fixed lenses because they’re smaller and less expensive. Shrinking the moving parts of a zoom lens down to smartphone size is a technical challenge few OEMs are up for, apparently. Oppo <a href=\"https://www.theverge.com/2021/8/19/22631974/oppo-continuous-zoom-lens-smartphone-camera-tech-event\">showed off a continuous optical zoom concept last year</a> but hasn’t yet brought it to market. To be fair, the Xperia 1 IV exists only in prototype form now and won’t ship to consumers until September, so Oppo could still beat Sony to the punch. But until then, the Xperia 1 IV offers our only real, tangible proof of a true smartphone-sized zoom. </p><p id=\"36YI84\">It’s a huge achievement, but it’s also… kind of a letdown.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZC6ngJ8q64cfmNUf4tGkF_CJRUM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23449185/ajohnson_220506_5203_0002.jpg\">  </figure></div><p id=\"MCgX91\">For starters, it’s a <em>very</em> small zoom range: just 3.5–5.2x relative to the standard 24mm wide angle. Sony says it chose those focal lengths because they’re traditionally used for portraits, and, individually, they’re useful for that purpose. I’m just not sure how valuable the space between them is.</p><p id=\"8I3i2Z\">Before we get too far into the zoom lens, here’s a quick rundown on all three rear cameras on the Sony Xperia 1 IV:</p><ul><li id=\"NPn1hk\">16mm F2.2 ultrawide: 12-megapixel 1/2.5-inch sensor</li><li id=\"nImGNi\">24mm F1.7 standard wide: 12-megapixel 1/1.7-inch sensor with OIS</li><li id=\"DUjzAU\">85-125mm F2.3-2.8 telephoto zoom: 12-megapixel 1/3.5-inch sensor with OIS</li></ul><p id=\"BMDGFp\">All three rear camera sensors support 120fps high-speed readout, so Sony’s face and eye detection run seamlessly on each one. Seriously, it’s almost creepy how good it is at finding your subject’s eye and sticking with it, and it works nearly flawlessly on all of the rear cameras. There’s also a 12-megapixel front-facing sensor that now supports 4K HDR video. </p><div id=\"UZjdLF\"><div data-anthem-component=\"gallery:11185599\"></div></div><p id=\"ZMvD9L\">The Xperia 1 IV is sometimes capable of fantastic images — photos I’m amazed I was able to take with a smartphone. But the unit I was able to demo is also inconsistent and sometimes makes poor judgments on white balance and scenes with challenging lighting. The phone I’m testing out is a prototype so things are subject to change before the device ships later this year, but Sony’s senior product information manager El-Deane Naude says he doesn’t expect a lot will change between now and then. </p><p id=\"unKwKt\">First, the good: there is that real zoom lens on this phone, and it works fairly well. It’s a little bit soft but certainly good enough for the small image sizes used on social media. The small zoom range doesn’t make much of a difference for distant subjects, but up close for portrait subjects it provides some added flexibility. </p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YGpyVY9b5nRpjVuT6mlPFnTLl_A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451195/20220508_134950_vert.jpg\">      <figcaption><em>When it gets things right, the Xperia 1 IV is capable of excellent image quality.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZG45FeBCL1g5Qn7sAxeBBxXQSDI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451209/20220507_172038_vert.jpg\">      <figcaption><em>This image at 85mm features some unattractive blown highlights and appears to have missed focus.</em></figcaption>  </figure></div></div></div><p id=\"PQcJ1z\">In good lighting, or consistent indoor lighting, the Xperia 1 IV is smart about choosing a balanced exposure with vibrant colors that don’t look overly saturated. </p><p id=\"9du4Ou\">It occasionally gets into trouble in mixed or dim indoor lighting — unsurprising given its smaller sensor and dimmer aperture compared to the main wide camera. There are also some white balance misses or an HDR effect that turns the white ice in a fresh fish display gray. Some of my shots with the zoom lens look a little overexposed and are softer than they should be. Sony’s Naude acknowledges a problem specific to the prototype unit with the autofocus at 5.1x zoom, which I can see clearly in my device, but these exposure and quality issues are seen at other focal lengths.</p><p id=\"sudptN\">There’s also no getting around the fact that the Xperia 1 IV is working with small sensors and small optics compared to a traditional camera. Sharp photos of moving subjects in dim light are a challenge, as they are for all smartphones, and don’t expect to get much subject separation even at the long end of the telezoom. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bDyJjKaEl-2dYYK-zfwjdEeQF78=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23449189/ajohnson_220506_5203_0005.jpg\">  </figure><p id=\"Z0miI4\">The Xperia 1 IV offers a ton of manual control for video recording — way more than an enthusiast still photographer like me can hope to understand and use properly. As in previous models, this is all housed in Sony’s Cinema Pro app. Thankfully, there’s a more simplified video recording app available on this year’s model: Videography Pro. It doubles as a livestreaming app, too. I haven’t used it extensively, but, so far, I find it much more comfortable and familiar than Cinema Pro.</p><p id=\"m5Zyrw\">Most of my concerns with the Xperia 1 IV stem from its price. For the same MSRP, the Galaxy S22 Ultra offers an excellent portrait mode, a standard wide, ultrawide, a 3x telephoto, <em>and</em> a 10x telephoto. For my money, I’d rather have the long reach of the 10x lens and the portrait-friendly 3x lens with digital zoom in between, rather than two portrait lenses connected by optical zoom.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bkve8hXrxXiBAgZMOl2C2DnIwFg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23449188/ajohnson_220506_5203_0004.jpg\">  </figure><p id=\"ayFO4F\">The Xperia 1 IV is IP68 rated, which means robust protection against dust and water, but it’s not clear how tolerant the lenses inside of the Xperia’s zoom will be to everyday bumps and wear and tear. Sony hasn’t responded to my question about this as of now, and I’ll update this article if they do. Until then, it seems like moving optics could be jostled out of alignment more easily than fixed lenses. If I spent $1,600 on this phone, I’d want to know just how careful I should be with it.</p><p class=\"c-end-para\" id=\"QgDc3q\">Bottom line, Sony put a good point-and-shoot zoom in a smartphone. That’s an impressive feat. In practical use, it’s a bit less impressive. It’s essentially two lenses that serve the same function: portrait photography. The fact that there’s optical zoom connecting them doesn’t make them much more versatile. Maybe the next iteration will go a step further with a longer zoom range. In the meantime, this concept feels like it’s still under development. </p><p id=\"seb0Ht\"><em>Photography by Allison Johnson / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OwBEMNFaRRGyJNZXBDnC3u35bR0=/0x176:2040x1244/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23449184/ajohnson_220506_5203_0001.jpg",
  "description": "Optical zoom in a phone for the first time.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}