{
  "title": "Sony’s new QD-OLED and Mini LED TVs are just as expensive as you’d guess",
  "url": "https://www.theverge.com/2022/5/2/23053221/sony-qd-oled-mini-led-tvs-a95k-x95k-a90k-a80k-price-release-date",
  "date": "2022-05-02T14:00:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MXfprdSxbGOeVlgEIkXeYzmeiN0=/20x0:916x597/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70822071/Sony.0.jpg\" />    </figure>  <p id=\"bLP7Yr\">Today, Sony announced the full pricing and availability details for its 2022 Bravia XR lineup of TVs. The range is led by the flagship 8K Mini LED series — this is Sony’s first year making Mini LED sets — but also includes 4K Mini LED, QD-OLED, and more traditional OLED and LCD sets. </p><p id=\"6gePPl\">Nobody expects giant-sized 8K televisions to sell for a reasonable price, and Sony’s Master Series Z95K Mini LED models come in at $6,999.99 for the 75-inch size and a penny shy of $10,000 for the 85-inch set. The <a href=\"https://electronics.sony.com/tv-video/televisions/all-tvs/p/xr75z9k\">Z95K series</a> will be available to preorder this summer, but among Sony’s latest TVs, I don’t see many consumers giving them serious consideration.</p><p id=\"wRr66R\">Next up are Sony’s first QD-OLED TVs, which utilize new panels from Samsung Display. <a href=\"https://www.theverge.com/2022/4/4/23009841/samsung-qd-oled-tv-s95b-preview\">Samsung Electronics also has a QD-OLED TV hitting the market</a> at the moment, and I was pleasantly surprised at the reasonable pricing. But Sony’s TVs are always more expensive than the competition. Sony prides itself on superior image processing and accuracy — but those benefits don’t come cheap on the A95K QD-OLEDs. </p><aside id=\"bT5PW5\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Sony announces the world’s first QD-OLED 4K TV, coming later this year \",\"url\":\"https://www.theverge.com/2022/1/4/22865220/sony-a95k-qd-oled-qdoled-4k-tv-announced-features-explainer\"}]}'></div></aside><p id=\"7WMp4J\">You’ll have to cough up $2,999.99 for the 55-inch model, with the 65-inch going for $3,999.99. That makes for a rough direct comparison against Samsung, which is charging $2,199.99 for a 55-inch and $2,999.99 for its 65-inch OLED TV. But again, Sony tends to lead the pack if you’re willing to pay a premium for top-notch picture fidelity. Sony says its QD-OLED sets will go up for preorder in June for US customers and this month in Canada.</p><p id=\"ajB9lg\">If you’re more interested in the superior brightness of Mini LED, well, the company’s X95K 4K sets are also going to do some damage to your wallet. Sony says the XR Backlight Master Drive in these TVs “controls thousands of high-density Mini LEDs in precisely controlled zones to create incredible dynamic range that makes content burst to life with deep blacks, natural colors, and phenomenal brightness.” Going from smallest to largest, the 65-inch X95K runs $2,799.99, the 75-inch is $3,799.99, and the 85-inch demands $5,499.99. If you’ve got the cash to spare, the good news is that <a href=\"https://electronics.sony.com/tv-video/televisions/all-tvs/p/xr65x95k\">the X95K is available to order immediately</a>. </p><aside id=\"ZutyX7\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Making sense of new TV features in 2022\",\"url\":\"https://www.theverge.com/22884014/tv-features-hardware-screens-hdmi-hdr-vrr-oled-mini-led\"}]}'></div></aside><p id=\"foDwG2\">Sony also has a new <a href=\"https://electronics.sony.com/tv-video/televisions/all-tvs/p/xr42a90k\">A90K Master Series</a> targeted at gamers: these OLEDs only come in 48-inch ($1,499.99) and 42-inch ($1,399.99), and while they’re not using QD-OLED panels, they’ll still offer terrific picture quality and full support for HDMI 2.1 gaming features like VRR and 120Hz gameplay. </p><p id=\"iA8Vj7\">From there, you get into the “regular” OLED TVs with the A80K series starting at $1,999.99 for a 55-inch model. These also have full HDMI 2.1 support and the best-in-class built-in speakers that Sony is known for. All of Sony’s TVs run Google TV, and after years of supporting Android TV, it’s all gotten to a very fluid, responsive, and stable place. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SJXEe7fX2YysVexaKnuwqXRnZjg=/0x54:935x544/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432520/Sony.jpg",
  "description": "But you’re getting the best picture quality out there.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}