{
  "title": "Sony reportedly plans to put ads in PlayStation games",
  "url": "https://www.theverge.com/2022/4/21/23035875/sony-playstation-microsoft-games-in-game-ads",
  "date": "2022-04-21T18:59:15.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MQXYevduLiDcZbd5-ysatRTk0Rs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70777450/acastro_180604_1777_playstation_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"dzFJnM\">Sony is reportedly working to bring advertisements to free-to-play PlayStation games, according to a report by <a href=\"https://www.businessinsider.com/sony-plans-to-sell-advertising-in-playstation-games-2022-4\"><em>Insider</em></a>. The ads would appear in games and are meant to give game developers a way to monetize their work and encourage them to continue building free-to-play games.</p><p id=\"ZEnbfC\">The in-game ads are expected to launch by the end of the year and would appear in inconspicuous places within the game, like billboards<em>. </em>Players could also get rewards for watching advertisements, and the ads would be sold through a private marketplace, <em>Insider</em> reports. Sources told <em>Insider </em>that Sony hasn’t yet decided if it would take a portion of ad revenue but is considering having developers and publishers pay for consumer data.</p><p id=\"dwZCoT\">Sony did not immediately respond to a request for comment.</p><p id=\"ekZ5i9\">Reports of Sony’s plans follow <a href=\"https://www.theverge.com/2022/4/16/23027934/microsoft-report-ads-free-to-play-xbox-games\">news last week</a> that Microsoft was reportedly planning on doing something similar with free-to-play Xbox games, also reported by <a href=\"https://www.businessinsider.com/microsoft-is-building-an-advertising-program-for-xbox-2022-4\"><em>Insider</em></a>. Ads in free-to-play Xbox games are expected to roll out later this year, and Microsoft doesn’t plan to take a cut of revenue, sources told <em>Insider. </em></p><p id=\"Jkkpia\">As noted in the <em>Insider</em> report, advertisers may need some convincing to join the program. Ads that appear next to mature or violent content might be a concern, and tracking what users do after seeing an in-game ad could be difficult. The possibility of ads annoying gamers is also a concern for Microsoft, according to <em>Insider</em>.</p><p id=\"zXDAMc\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/quV6zCwsGwbytUI3P15jYsDHkuo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11515157/acastro_180604_1777_playstation_0001.jpg",
  "description": "PlayStation and Xbox games will reportedly have ads.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}