{
  "title": "Sony’s Bungie acquisition is all about Fortnite",
  "url": "https://www.theverge.com/2022/2/1/22912075/sony-bungie-acquisition-fortnite-playstation-destiny-live-service-games",
  "date": "2022-02-01T14:00:00.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NHkr3J634nqXvyjXxLEbZ69gkuI=/359x151:1301x779/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70457103/witch_queen_hero_pic.10.jpg\" />        <figcaption>Image: Bungie</figcaption>    </figure>  <p>And huge virtual worlds on multiple platforms</p> <p class=\"p--has-dropcap p-large-text\" id=\"cKFMRu\">Microsoft has <em>Minecraft</em>, Epic Games has <em>Fortnite</em>, and Sony now has <em>Destiny</em>. In a $3.6 billion deal, <a href=\"https://www.theverge.com/22910846/sony-bungie-acquisition-playstation-destiny-halo\">Sony is acquiring Bungie</a>, the game studio famous for creating the <em>Halo </em>and <em>Destiny</em> universes. It’s a big deal, in a month already <a href=\"https://www.theverge.com/2022/1/10/22876184/take-two-interactive-zynga-acquisition-deal\">full</a> of <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">massive deals</a>. It’s also backed by some equally big promises from Bungie about its independence, the future of <em>Destiny</em>, and commitments to multiplatform games. </p><p class=\"p-large-text\" id=\"ChcOCk\">Beyond <em>Destiny</em>, this deal reveals Sony’s ambition to compete with games like <em>Fortnite</em> alongside the steps it has been taking to bring the PlayStation brand to multiple platforms.</p><p id=\"wA0KkO\">The deal itself is unusual. Bungie will maintain creative independence inside Sony, self-publishing its future games despite being owned 100 percent by Sony. <em>Destiny 2</em> will remain multiplatform, so it’s not going to disappear from the Xbox and turn into a PlayStation exclusive. Bungie has even committed to keeping the game the same “no matter where you choose to play.” That likely means we won’t see exclusive <em>Destiny</em> strikes or weapons on PlayStation like we saw in the past, thanks to an Activision and Sony deal.</p><p id=\"qk2HNO\">Bungie’s future games won’t be PlayStation exclusive, either. “We want the worlds we are creating to extend to anywhere people play games,” reads a <a href=\"https://www.bungie.net/en/News/Article/50989\">vision blog post</a> from Bungie’s Joe Blackburn and Justin Truman. So what is Sony paying $3.6 billion for, exactly?</p><div class=\"c-float-right\"><aside id=\"z1g6jG\"><q>So what is Sony paying $3.6 billion for?</q></aside></div><p id=\"oLVpzO\">You only have to look at Sony’s <a href=\"https://blog.playstation.com/2021/11/12/playstation-5-turns-one-today/#sf251182436\">top 10 played PS5 games</a> to see how important <em>Destiny</em> is to PlayStation. <em>Destiny 2</em> is number six on the list, based on gameplay hours. It’s a list that includes <em>Fortnite</em> at the top and <em>Call of Duty: Black Ops Cold War</em> in the second spot alongside the usual annual FIFA and NBA releases. <em>Destiny 2</em> is still incredibly popular across Xbox, PC, and PlayStation, even as the game is about to enter year five.</p><p id=\"phroe2\">Despite many <em>Destiny</em> killers promising to compete (<a href=\"https://www.theverge.com/2021/2/24/22274771/ea-wont-continue-anthems-post-launch-development\">RIP <em>Anthem</em></a>), there’s still nothing quite like <em>Destiny</em> on the market. It has a unique blend of looter shooter and MMO and a PvP crucible mode that lets you show off the guns and armor you’ve acquired through hours of grinding. While it’s technically free-to-play, it also has a unique revenue model. You can purchase cosmetics through micro-transactions, buy a season pass to get more rewards and unique weapons, and also purchase DLC to get access to additional campaign content and activities like dungeons or raids.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nYQH6Z9pqySZESkMH4GgW-A-HEM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23209525/witch_queen_hero_pic.jpg\">      <cite>Image: Bungie</cite>      <figcaption>Destiny 2: The Witch Queen<em> arrives on February 22nd.</em></figcaption>  </figure></div><p id=\"VbAGed\">Revenue from live service games is attractive to Sony<em>. </em>Look at<em> Fortnite: </em>it’s big enough to impact gaming content and services revenue at both Sony and Microsoft. We saw its <a href=\"https://venturebeat.com/2018/07/19/fortnite-helps-xbox-revenue-jumps-39-to-2-29-billion/\">impact on Xbox revenue in 2018</a>, and court documents revealed last year that <em>Fortnite</em>’s true <a href=\"https://www.theverge.com/2021/4/28/22407939/fortnite-biggest-platform-revenue-playstation-not-ios-iphone\">cash cow is PlayStation</a>. Sony also made a <a href=\"https://www.theverge.com/2020/7/9/21318978/sony-epic-games-fortnite-investment-250-million-game-development\">$250 million investment</a> in <em>Fortnite </em>owner Epic Games in 2020, followed by an additional $200 million last year. It’s only a couple of percent stake overall, but it demonstrates the clear value Sony sees in <em>Fortnite</em>.</p><p id=\"4urA5H\"><em>Destiny</em> isn’t perfect, but it has always had the potential to compete with <em>Fortnite</em> for attention and the social space that has turned <em>Fortnite</em> into a type of metaverse for kids and adults alike. Bungie’s big ambition with the original <em>Destiny</em> release was for players to interact freely in giant worlds, form fireteams in dedicated social spaces, and then team up to take on enemies in strikes, raids, and other activities. But instead of an ever-changing world like <em>Fortnite</em>, <em>Destiny</em> has become an ever-growing world that has often pulled in different directions. </p><p id=\"l5gS0l\"><em>Destiny 2: Forsaken</em> represented the best of <em>Destiny</em>, with a Dreaming City world that changed weekly, full of secrets to discover. Nothing in <em>Destiny</em> has quite delivered the same magic ever since, and it often feels like the game has so much untapped potential. A weird game exploit demonstrated this best, letting players have <a href=\"https://gamerant.com/destiny-2-12-guardian-raids-exploit-entertaining-unofficial/\">tons of fun with 12-person raids</a> instead of the usual restriction to just six people. It was a brief but enjoyable bug that demonstrated the potential for a game to tap further into the social aspects that unite millions of <em>Destiny</em> players. </p><p id=\"UTqi2w\">Many <em>Destiny </em>players dream of being able to stand alongside dozens of fellow guardians, fending off mini screebs or the countless other enemy types that are designed to wipe you out. Right now, a lot of activities are limited to three-player teams, but raids expand to six players. These limitations create a weird mix where you have to split up friend groups when new content drops, and you’re never truly experiencing an ever-changing <em>Destiny</em> world with everyone else.</p>  <figure class=\"e-image\">        <img alt=\"Destiny\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WklUDPnADBpzjWZ_7oqBrUtFrq4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/4135136/destiny-gif.0.gif\">      <figcaption><em>Destiny has a lot of untapped social potential.</em></figcaption>  </figure><p id=\"rsTibf\">Bungie has experimented with improving these live aspects and demonstrated its ambitions to do <em>Fortnite</em>-style live events a couple of years ago. Both seasonal live events in 2020 were a solid start but were rather <a href=\"https://www.theverge.com/2020/6/6/21282559/destiny-2-bungie-almighty-rasputin-live-event-fortnite-update\">slow and underwhelming</a>. Despite its shortcomings, <em>Destiny</em>’s uniqueness and smooth gunplay keep a lot of players hooked (I’ve played for more than 5,000 hours personally), and the franchise has a loyal fanbase that regularly returns for big content like the upcoming <em>Witch Queen</em> expansion on February 22nd. Sony’s acquisition won’t upset this flow, and Bungie says its plans for <em>Destiny 2</em> content remain unchanged. “Our plans for the Light and Dark Saga are unchanged, all the way through The Final Shape in 2024.”</p><p id=\"fi1hgY\">In <em>Destiny</em> alone, Sony gets immediate access to a game that’s battling for the attention of players that might otherwise play <em>Fortnite</em>, <em>Call of Duty</em>, or many other free-to-play shooters. It also gives Sony a big multiplatform game, just as the company has been dipping its toes into publishing its exclusive PlayStation games on PC.</p><p id=\"d3Mf7Z\">“We are starting to go multiplatform, you’ve seen that,” says PlayStation CEO Jim Ryan in an <a href=\"https://www.gamesindustry.biz/articles/2022-01-31-playstation-bungie-will-considerably-accelerate-our-journey-with-multiplatform-live-service-games\">interview with <em>GamesIndustry.biz</em></a>. “We have an aggressive road map with live services. And the opportunity to work with, and particularly learn from, the brilliant and talented people from Bungie... that is going to considerably accelerate the journey we find ourselves on.”</p><p id=\"vlJgGe\"><em>Destiny</em> is a big acquisition for Sony, allowing the company to foster the live service elements, but what could really make the deal worth it for Sony is Bungie’s next game. It just so happens that Bungie has a new franchise on the way soon. Codenamed Matter, job postings initially described the new IP as a “multiplayer action game” with “character-based” gameplay. That’s led many to <a href=\"https://www.dexerto.com/gaming/bungie-rivals-overwatch-valorant-character-esports-game-1583170/\">make comparisons</a> to <em>Valorant</em> or <em>Overwatch</em>, but Bungie has proven with <em>Halo</em> and <em>Destiny</em> that it never makes anything that’s exactly like what exists today. Bungie hasn’t commented officially other than <a href=\"https://www.businesswire.com/news/home/20210218005230/en/Bungie-Prepares-for-Future-Growth-in-2021-with-Studio-Expansion-Key-Talent-Investments-and-New-Board-Members\">promising last year</a> “to bring at least one new IP to market before 2025.”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Las Vegas Hosts Annual CES Trade Show\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Rn1stkj1Z4RhYHNvTFxi9vx61WE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23209527/1362839159.jpg\">      <cite>Photo by Alex Wong/Getty Images</cite>      <figcaption><em>Sony’s PlayStation CEO says it has an aggressive road map for live services.</em></figcaption>  </figure></div><p id=\"usm9ng\">Matter, or whatever it ends up being called, will be a key part of why Sony has acquired Bungie. <em>Destiny</em> will live on for many years to come and could see Sony tap into TV shows for the franchise or help bring <a href=\"https://www.bungie.net/en/Explore/Detail/News/50109\">Bungie’s promise</a> of an “expansion of the Destiny Universe into additional media” to life. If the early Bungie job postings are accurate, then Matter could be the next big live service game that further puts pressure on <em>Fortnite</em>’s dominance. It’s also easy to imagine a Bungie game with crossovers to Sony’s range of IPs and the potential to fulfill <em>Destiny</em>’s original promises.</p><p id=\"DLOWCR\">What Sony’s acquisition of Bungie isn’t about is exclusivity, though. Games like <em>Destiny</em> thrive because they’re available on multiple platforms and can connect different friend groups in a virtual world. <em>Fortnite</em>, <em>Call of Duty</em>, and <em>Destiny</em> aren’t hugely popular because they’re locked to one platform; they’re available everywhere, and that drives their success. Sony might have <a href=\"https://www.theverge.com/2021/5/3/22417560/sony-ps4-cross-play-confidential-documents-epic-games-agreements\">pushed back against crossplay and cross-platform in the past</a>, but it’s clear the PlayStation maker is now embracing its potential and has bigger plans for live service games.</p><p class=\"c-end-para\" id=\"PNYxo3\">“Philosophically, this isn’t about pulling things into the PlayStation world,” says Ryan. “This is about building huge and wonderful new worlds together.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/TOf0C0Dr0mdiBx7v9MiK5IMpsRY=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23209580/destiny_2_witch_queen__16_.jpg",
  "description": "Destiny is just part of a bigger Bungie plan.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}