{
  "title": "Sony WH-1000XM5 review: new design, new sound, new price",
  "url": "https://www.theverge.com/23067645/sony-wh-1000xm5-noise-canceling-headphones-review",
  "date": "2022-05-12T16:00:00.000Z",
  "author": "Chris Welch",
  "content": "  <p>Sony’s latest noise-canceling headphones have a fresh look and iterative improvements</p> <p class=\"p--has-dropcap p-large-text\" id=\"YvDsKI\">Sony has a brand new flagship set of noise-canceling headphones: the WH-1000XM5. And as much as we’ve ragged on Sony’s terrible product names before, I think that at least with the 1000X series, people get it: these have always been among the very best noise-canceling headphones you can buy. Sony’s been battling it out for years with Bose, and more recently Apple, to win over frequent flyers, commuters, work-from-homers, and everyone else who can’t go without noise cancellation. As more jobs shift to a hybrid work model, noise-canceling headphones have only become more essential for peace and quiet both at the real office and in your home office. </p><p id=\"nRPB2K\">The 1000XM5s have a fresh design, cleaner sound, and even better ANC than before. But they don’t really do anything <em>new</em>. Now priced at $399, they’re also $50 more expensive than the M4s, which Sony is keeping in the lineup. Are they worth the upgrade? Potentially, but it’s not exactly a slam dunk.</p><div id=\"qZNGIS\"><div data-anthem-component=\"scorecard:11187554\"></div></div><p id=\"v0F4rd\">For the first time in several years, Sony has overhauled the entire design of the headphones. The 1000XM5s look totally distinct from their predecessors. The headband is slightly thinner, and, instead of arms that cradle the ear cups at both sides, there’s a single stem running down the center. If you look at some of Sony’s competitors like Bose’s Noise Canceling Headphones 700 or Apple’s AirPods Max, you can see where Sony may have found some inspiration. </p><p id=\"hSYclo\">This style looks more refined and cleaner with fewer obvious seams and such. The mic inlets that looked like USB-C ports on the previous model are gone, now located around the perimeter of the headphones and set deeper to help cut back on wind noise. The ear pads are a bit wider and more memory foam-y, which results in improved overall comfort. Even with the revamped design, the M5s weigh in at 250 grams, pretty much the same as the 254-gram M4s. Sony continues to offer them in black or off-white, and the latter has a subtle textured finish that hides finger oils and smudges better than the black model.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nuKEMx8FjzTqM6JlQMhZPIU2Pas=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454343/DSCF7932.jpg\">      <figcaption><em>The headphones come in black or off-white.</em></figcaption>  </figure></div><p id=\"cgss4p\">But I’m not convinced that these headphones look very <em>premium</em>. The 1000XM4s at least had some visible metal on their ratcheting ear cup sliders, but everything you can see or touch on the 1000XM5s is all plastic. I wouldn’t be concerned about durability: I twisted the hell out of these headphones and they held up perfectly fine. It’s more about fit and finish. For $400, I’d have appreciated some nicer materials thrown in — or ear pads that are easier to replace a la the AirPods Max. My Sennheiser Momentum 3s have a more impressive build quality that feels appropriate for their price. That said, it’s possible to go too far in the other direction, too. You can make a good case that the AirPods Max are too heavy, and Sony is clearly prioritizing extended comfort above a lavish design. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/R72m6P-aaWkJe6DOJHojkLLpkbo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454337/DSCF7891.jpg\">      <figcaption><em>The new headphones can’t fold down like Sony’s previous models could.</em></figcaption>  </figure><p id=\"Dgi2xj\">The ear cups still pivot and turn just as they did before. But one thing Sony’s new headphones can’t do anymore is <em>fold</em>. This is one of my biggest disappointments with the 1000XM5s. Instead of folding down for convenient portability, these headphones just lay flat in their case. And, as a result, that case is significantly larger than before. The 1000XM4 case is easy to toss in my bag, but the 1000XM5s don’t fit in the usual compartment, so I’ve had to clumsily put them in the main part of the bag. You can always leave the case at home, but then you’ve got to be mindful of what else might be in your bag nudged up against the headphones.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/omCL037yA7ldqNC1_xgMcyubksU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454333/DSCF7671.jpg\">      <figcaption><em>The case is significantly larger than before.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/q3X2J_bQLeZ33SDyGYtxfkkvp1w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454342/DSCF7929.jpg\">      <figcaption><em>It takes up more space in my bag than I’d like.</em></figcaption>  </figure></div></div></div><p id=\"ptPifQ\">Even though it’s collapsible without the headphones inside, this case is too bulky, and I think Sony could’ve done better. Bose’s case for the Noise Canceling Headphones 700, which can’t fold up either, is smaller and makes efficient use of space. People travel with these headphones constantly, and I think Sony’s oversized case is going to cause frustration. But it’s at least a functional case — hello, Apple — with storage for the USB-C and aux cables. Sony no longer includes a dual-prong airline adapter in the box. That strikes me as stingy for $400, but it is what it is. </p><div class=\"c-float-right\"><div id=\"QUpTkV\"><div data-anthem-component=\"aside:11188280\"></div></div></div><p id=\"10uv0a\">As for how the 1000XM5s sound, there are bigger changes than I was expecting. Sony has switched from 40-millimeter drivers in the 1000XM4s to 30-millimeter drivers in these new headphones. Driver size isn’t everything, but I can’t think of the last time a pair of Sony headphones sounded this different from their predecessors. The 1000XM5s are tighter, more detailed, and clean up the sometimes muddy bass of the 1000XM4s. “The new 30mm driver unit, with a light and rigid dome, uses carbon fiber composite material that improves high frequency sensitivity for more natural sound quality,” Sony spokesperson Chloe Canta told <em>The Verge</em>.</p><p id=\"jpE2Yx\">More natural, yes, but they also have less oomph to them. They’re less in your face and less potent out of the box overall. I’ve done direct comparisons with the same songs on both headphones, and the M5s won out in most cases. They’re noticeably more refined, detailed, and spacious. But in some instances, particularly when listening to thumpy hip-hop or EDM tracks, I leaned towards the M4s.  </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GslmlesWh5-DskItliRBP5LhFRs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454336/DSCF7813.jpg\">      <figcaption><em>With a new design, the 1000XM5s look sleeker and more streamlined.</em></figcaption>  </figure></div><p id=\"TVtJGA\">There are inevitably going to be people who prefer the more energetic sound of the 1000XM4s. And maybe that’s partly why Sony is keeping them around; selling two headphones that are otherwise so similar wouldn’t make much sense. You can use the EQ controls in Sony’s Headphones Connect app on Android or iOS to bring the sound of these headphones closer together, but the best thing to do is try both of them yourself if possible. You can look at all the frequency curve charts you want, but this stuff is fundamentally subjective. </p><p id=\"qUMKhO\">Sony stuck with the same QN1 noise cancellation processor for the new headphones, but now it’s also added in a <em>second</em> processor to dial up ANC even further. As a result, the company says noise cancellation performs similarly to the M4s on a plane but should be better at handling street noise and cutting down on nearby voices. That’s been true in my experience. It’s still not enough to completely silence the world if you’re in a busy coffee shop, but it’s an improvement over what was already fantastic noise cancellation. </p><p id=\"oHL12m\">One minor hardware thing to note: Sony previously had an “optimize” button on the headphones that would adjust the ANC for factors like air pressure and fit — hairstyle, whether you wear glasses, etc. But now the button is gone, and Sony says the same optimization is all happening automatically in the background. I miss the button a little; it was a fun trick that only took a few seconds, but I can see why Sony ditched it for simplicity’s sake. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/F4IEl8Z2HN3L8_WxQMyNqpaYolg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454334/DSCF7803.jpg\">      <figcaption><em>The 1000XM5s take after competitors like Bose’s Noise Canceling Headphones 700 and Apple’s AirPods Max.</em></figcaption>  </figure></div><p id=\"oN89uF\">As for voice calls, Sony is going for broke. The 1000XM5s have <em>eight</em> microphones in total, and four of those are used for voice. Add that together with AI algorithm improvements for noise reduction on calls, and the M5s deliver a noticeable upgrade over the M4s in this department. They aren’t a match for the standout LinkBuds, but, for over-ear headphones, they hold their own just fine at home. Things get a bit dodgier if you’re in a loud environment, but all headphones struggle in that scenario. </p><div><div id=\"MzRMSI\"><div data-anthem-component=\"aside:11188278\"></div></div></div><p id=\"j36SzY\">The 1000XM5s still support LDAC, Sony’s codec for higher-quality wireless audio. And if you can’t plug in, LDAC is the next best thing for listening to hi-res music on Apple Music, Amazon Music, and others. This only applies to Android, mind you; iPhone owners are still limited to the lower-bitrate AAC codec. These headphones also support multipoint, meaning you can connect to two devices at once. But unfortunately, Sony still makes you pick one advanced feature or the other: you can enable either LDAC or multipoint but not both at the same time. The 1000XM4s had the same restriction, which makes me think it might come down to Bluetooth bandwidth. </p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BIPRQnb2N4l892dNHUtQXm6118w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454344/DSCF7936.jpg\">      <figcaption><em>The ear pads are slightly wider and roomier.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FGoeqRv6ewcdEJ2MD3hQaDKf4Ts=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454346/DSCF7946.jpg\">      <figcaption><em>Controls and buttons remain largely unchanged.</em></figcaption>  </figure></div></div></div><p id=\"TLULwS\">Some core basics about the 1000XM5s remain unchanged. You control them with taps and swipes on the right ear cup. The old Sony hallmarks — like holding your hand over the right ear cup to briefly lower your music and boost the outside world — are still present. Same goes for features from the 1000XM4s, like “speak to chat,” where the headphones can detect when you’re talking and automatically halt music and enter transparency mode. You can also lift the left ear cup (or remove the headphones entirely) to automatically pause your music. Battery life is the same 30 hours as before if you’re using noise cancellation. If you turn all the extra bells and whistles off, you can stretch well beyond that.</p><p id=\"atrFtW\">Now, I want to discuss some missed opportunities: the things I was hoping Sony might add this time around but still hasn’t. First, it’s getting silly that these expensive headphones can’t work wirelessly with the PlayStation 5. They’re both top-tier, headline Sony products, but you’ve still got to plug into the PS5 controller with a cable. Second, the USB-C port is <em>still</em> just for charging, when a number of other headphones let you use it for audio as well. And finally, the 1000XM5s aren’t remotely water or sweat resistant: there’s a little paper in the box that urges you to avoid getting them wet. I’m not under the impression that these are fitness headphones, but some progress and resistance to the elements would be great to see in the year 2022. Maybe a few of these points will be addressed by the time the 1000XM6s come along in another two years. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NmwIYJrHclveHuy2X85Z_hM1IR8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23454339/DSCF7908.jpg\">      <figcaption><em>Sony’s WH-1000XM5 (left) compared to the prior-gen WH-1000XM4 (right).</em></figcaption>  </figure></div><p id=\"SXXIBk\">The WH-1000XM5s have a very comfortable new design that looks more modern but doesn’t quite rise up to their $400 price tag. The already best-in-class noise cancellation has been stepped up even further. These headphones sound clearer and more natural but also very different from their predecessors, which could prove divisive. </p><p id=\"HM7HgG\">If you’ve got a pair of 1000XM4s and are happy with them, there’s zero reason to run out and upgrade. Those headphones can do everything these can. But if you’re on an older pair of Sony cans — say the 1000XM2s or M3s and your battery is starting to give out, then these are a much better buy. You’re getting multipoint and the best ANC Sony has achieved yet. </p><p class=\"c-end-para\" id=\"Kys1c6\">I don’t love that the price has gone up, and the case is a miss. For those reasons, you should do your own side-by-side comparisons with the M4s and potentially save some money. It seems like Sony got confused with what it wanted the 1000XM5s to be: they’re a strange half-step between the 1000XM4s and luxury headphones like the AirPods Max. There’s no major new feature or big headlining thing about them. But they’re still damn good noise-canceling headphones.</p><p id=\"nuKyhY\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/es1fIlZICcchhddynflWmrdorcw=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23454340/DSCF7916.jpg",
  "description": "Familiar features packaged in a completely new design.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}