{
  "title": "SpaceX successfully launches first all-private crew en route to space station for Axiom Space",
  "url": "https://www.theverge.com/2022/4/8/23016377/spacex-crew-dragon-axiom-space-ax-1-successful-launch-iss",
  "date": "2022-04-08T15:33:42.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wCccDCAecHV6QEPDBcm5mwBQgpo=/45x0:2003x1305/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70726580/51990762679_9b7da6c82b_k.5.jpg\" />        <figcaption><em>SpaceX’s Falcon 9 and Crew Dragon liftoff from Cape Canaveral, Florida with the Ax-1 crew on board</em> | Image: NASA/Joel Kowsky</figcaption>    </figure>  <p id=\"9mWSYs\">This morning, SpaceX successfully launched a new crew of four astronauts to orbit on the company’s Crew Dragon spacecraft — a group that includes three<strong> </strong>customers who have reportedly paid millions for their seats. The four private flyers, riding to space with a commercial aerospace company called Axiom Space, are now en route to the International Space Station after launching from Cape Canaveral, Florida, on SpaceX’s Falcon 9 rocket.</p><p id=\"jA7u7b\">When they dock with the ISS tomorrow morning, they’ll become <a href=\"https://www.theverge.com/2022/4/7/23013067/spacex-crew-dragon-axiom-space-ax-1-iss-launch\">the first entirely private crew of astronauts to visit and live on the orbiting lab</a>. The crew is slated to spend roughly eight days on the ISS, where they’ll conduct a total of 25 science experiments lasting a cumulative 100 hours.</p><div class=\"c-float-right\"><aside id=\"psJj2c\"><q>Ax-1 is the first in a series of four missions</q></aside></div><p id=\"RVXBXG\">Their mission, <a href=\"https://www.axiomspace.com/ax1\">called Ax-1</a>, is the first in a series of four missions that Axiom plans to conduct in partnership with SpaceX. Axiom’s long-term goal is to build a fleet of commercial space stations, beginning with Axiom Station. The company plans to attach the first module of Axiom Station to the ISS as early as 2024 before eventually breaking away and building a free-flying platform. Ax-1 and the following missions are meant to help Axiom establish all of its protocols and procedures for conducting human spaceflight missions to its own<strong> </strong>platform when it’s ready.</p><p id=\"dKwkJZ\">On board the Ax-1 flight are: American Larry Connor, founder and managing partner of real estate investment firm The Connor Group; Canadian Mark Pathy, CEO of investment and financing company MAVRIK; and Eytan Stibbe, a former Israeli Air Force pilot and founder of investment fund Vital Capital. Their commander is Michael López-Alegría, a veteran NASA astronaut and now chief astronaut for Axiom. The company announced the crew in January 2021, and the crew has spent between 750 and 1,000 hours training for this mission, according to Connor.</p><p id=\"Vmdwjd\">“Thanks for flying Falcon 9,” William Gerstenmaier, vice president of build and flight reliability at SpaceX, told the crew once they had reached orbit. “Enjoy your trip to that wonderful space station in the sky. Do some great research for us. We’ll see you back here on the ground.”</p><p id=\"H7pxdI\">López-Alegría thanked the SpaceX team for getting the crew safely to orbit. “That was a hell of a ride, and we’re looking forward to the next 10 days,” he concluded.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lofZXeJ4zLNnt7DdqjZbAUD3mIM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23376303/SPACEX_AX_1_Test_Drive_20220317_Axiom1_ceit_031722_DSC_1829_1___1_.jpeg\">      <cite>Image: Axiom Space</cite>      <figcaption><em>From L to R: Larry Connor, Michael López-Alegría, Mark Pathy, and Eytan Stibbe in their SpaceX pressure suits</em></figcaption>  </figure><p id=\"NWxMvo\">Axiom has been tightlipped on the financials of this trip, but when the crew was first announced, media reports noted that the astronauts had paid a whopping $55 million to secure their seats on the Crew Dragon. Axiom is also paying an undisclosed sum to NASA to use the space agency’s facilities on the ISS. In 2019, NASA announced that it was opening the US portion of the ISS to more commercial activities. At the time, NASA announced that using the life support systems and toilets would cost $11,250 per night per person.</p><p id=\"XK6OI6\">The Ax-1 crew will be primarily working on the US portion of the ISS, though they will visit the Russian portion on invitation from the three cosmonauts on board. The four visitors will sleep in various places on the ISS: two will be in the Columbus module, one will sleep inside the Crew Dragon docked at the ISS, and one will be sleeping in an airlock.</p><div class=\"c-float-left\"><aside id=\"GwyMNx\"><q>if the toilet happens to break, the Ax-1 astronauts will not be responsible for fixing it</q></aside></div><p id=\"0Fiwx2\">While the Ax-1 astronauts did not receive the same intense level of training that NASA astronauts receive before flying to the ISS, they learned basic protocols they’ll need to use for being a guest on the station, such as how to use the food galley and dealing with hygiene in microgravity. “There’s a lot of daily living training, just so that they’re comfortable and know how to kind of operate independently on board,” Dana Weigel, the deputy program manager for the ISS at NASA, said during a press conference ahead of the flight. The Ax-1 team also learned emergency response training in case there’s a major disaster on board the ISS. The wealthy fliers are still considered guests, though<strong> — </strong>if the toilet happens to break when they’re on board, the Ax-1 astronauts will not be responsible for fixing it.</p><p id=\"is5bXf\">Once their mission is over, the Ax-1 astronauts will load back into the Crew Dragon currently taking them to the ISS, depart the station, and eventually splash down somewhere off the coast of Florida. Once they return, SpaceX is on tap to launch yet another crew to the ISS on April 21st — its latest launch for NASA called Crew-4, which will send three agency astronauts and a European partner astronaut to the ISS for a six-month stay. SpaceX will then bring home another set of astronauts, part of the Crew-3 mission, who have been on the ISS since November. </p><p id=\"FTaseU\">It’s a bit of a high-traffic time for the ISS, and it may continue to be busy as more private missions are scheduled to visit the station in the future.</p><p id=\"mih2OI\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rakz6sDV6tJh7a8Eh61qpwdVnUA=/0x117:2048x1189/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23376445/51990762679_9b7da6c82b_k.jpg",
  "description": "The Ax-1 crew is on its way.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}