{
  "title": "SpaceX pausing production of new Crew Dragon spacecraft",
  "url": "https://www.theverge.com/2022/3/28/23000175/spacex-crew-dragon-fleet-capsules-production-iss",
  "date": "2022-03-28T19:11:03.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yZk-LvmUB8jClkHwL9xMI3wyxSY=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70681973/KSC_20210413_PH_SPX01_0002_orig.0.jpeg\" />        <figcaption>SpaceX</figcaption>    </figure>  <p id=\"LTy4ih\">SpaceX says it will no longer build new vehicles of its Crew Dragon capsule, the spacecraft the company uses to take humans to and from the International Space Station, <a href=\"https://www.reuters.com/lifestyle/science/exclusive-spacex-ending-production-flagship-crew-capsule-executive-2022-03-28/\">according to a report in <em>Reuters</em></a>. The plan for now is to cap the Crew Dragon fleet for carrying humans at four, which SpaceX will re-fly again and again to get crews to space.</p><p id=\"1tlBvb\">“We are finishing our final [capsule], but we still are manufacturing components, because we’ll be refurbishing,” SpaceX President Gwynne Shotwell told <em>Reuters</em>. After each flight of a Crew Dragon, the spacecraft must go through a refurbishment process in Florida, where certain hardware is tweaked or swapped out to make the vehicle flight-ready again. SpaceX did not respond to a request for comment.</p><div class=\"c-float-right\"><aside id=\"sLDTlD\"><q>“We are finishing our final [capsule], but we still are manufacturing components.”</q></aside></div><p id=\"UXZ1vS\">SpaceX initially developed the Crew Dragon for NASA’s Commercial Crew Program, an initiative to spur the creation of private vehicles to ferry agency astronauts back and forth from the ISS. As part of that program, SpaceX has launched four crews of NASA astronauts to the ISS on the Crew Dragon. In September of last year, the company launched its first fully private crew, carrying four civilian astronauts to Earth orbit for a three-day trip.</p><p id=\"8h0rSz\">The company has plenty of future trips planned for the four Crew Dragons, each of which has been named by their first astronaut crews: Endeavour, Resilience, Endurance, and Freedom. </p><p id=\"h1sjJ8\">In roughly a week, a commercial space station company called Axiom will launch a crew of <a href=\"https://www.theverge.com/2021/1/26/22250327/space-tourists-axiom-private-crew-iss-price\">four private astronauts on a Crew Dragon to the space station for a 10-day-long trip</a>. Axiom holds a contract with <a href=\"https://www.axiomspace.com/press-release/axiom-spacex-deal\">SpaceX to launch at least three additional human missions to the ISS</a> on Crew Dragon after this first one. Meanwhile, SpaceX still holds a contract with NASA to launch crews to the ISS every six months and then bring them back home. In February, NASA <a href=\"https://www.nasa.gov/feature/nasa-awards-spacex-additional-crew-flights-to-space-station\">awarded SpaceX three additional human missions with Crew Dragon</a> to the ISS, on top of the six SpaceX was originally contracted to do. The news brought SpaceX’s Commercial Crew contract award with NASA to $3.49 billion. </p><p id=\"zattXm\">While SpaceX has paused production of the Crew Dragon, plenty of resources are being poured into the development of the company’s new Starship rocket, a massive new vehicle designed to carry people and cargo to deep space destinations like the Moon and Mars. However, Shotwell tells <em>Reuters</em> that SpaceX can always restart Crew Dragon production if necessary.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vDgYDOVLITjO7XyCV1BQFGXeW10=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23350902/KSC_20210413_PH_SPX01_0002_orig.jpeg",
  "description": "Four is the lucky number for now.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}