{
  "title": "SpaceX successfully launches latest crew of astronauts to the space station for NASA ",
  "url": "https://www.theverge.com/2022/4/26/23043042/spacex-crew-4-dragon-falcon-9-launch-watch-live",
  "date": "2022-04-26T21:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/N19gf42DvsHU7F4lC_WtQgqrOBo=/0x0:1698x1132/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70796787/NHQ202204260004_large.0.jpeg\" />    </figure>  <p id=\"CzKCug\"><em><strong>Update April 27th, 4:18AM ET: </strong></em><em>SpaceX successfully launched the crew from NASA’s Kennedy Space Center at 3:52AM ET. The astronauts will now spend roughly 17 hours en route to the ISS, and are due to dock with the space station at around 8:15PM ET, reports </em><a href=\"https://www.reuters.com/lifestyle/science/spacex-launches-crew-4-astronauts-flight-space-station-2022-04-27/\">Reuters</a>. </p><p id=\"DfDhyk\"><strong>Original Story: </strong>In the early morning hours, SpaceX is set to launch its seventh crewed mission to orbit, this time <a href=\"https://blogs.nasa.gov/commercialcrew/2022/04/22/nasa-and-spacex-adjust-agencys-crew-4-launch-date/\">sending three NASA astronauts and an Italian astronaut to the International Space Station</a>. Their launch will spark the beginning of a six-month stay on board the ISS, part of SpaceX’s commitment to NASA to periodically fly astronauts to and from the orbiting lab.</p><p id=\"hXPabr\">The mission, called Crew-4, is SpaceX’s fourth operational human spaceflight mission to the ISS for NASA. The company has been flying NASA astronauts to the space station as part of the agency’s Commercial Crew Program, an initiative to use privately made spacecraft to ferry crews to low Earth orbit. SpaceX launched its first crew to the ISS on the company’s Crew Dragon spacecraft in 2020 and has been getting into a steady rhythm with follow-up crewed missions ever since.</p><p id=\"Xdii1l\">On board this flight are two veteran flyers: NASA astronaut Kjell Lindgren and Italian astronaut Samantha Cristoforetti from the European Space Agency, who have both visited the International Space Station before. They’ll be joined by two rookie flyers for this trip, including NASA astronauts Jessica Watkins and Bob Hines, both of whom were selected to be astronauts in 2017. Watkins will also be making history with her flight, as she’ll be the first Black woman to live as a long-term crew member on the space station.</p><div class=\"c-float-right\"><aside id=\"Yp8eH6\"><q>“This is certainly an important milestone, I think both for our agency and for the country.”</q></aside></div><p id=\"fF1Rjl\">“This is certainly an important milestone, I think both for our agency and for the country,” Watkins said of her flight. “And I think it’s really just a tribute to the legacy of the Black women astronauts that have come before me, as well as to the exciting future ahead. And so I’m honored to be just a small part of that legacy moving forward.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6KgKjlqK4b-Nv54j7SAOpJvEkbQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417958/NHQ202204180001_large.jpeg\">      <cite>Image: NASA</cite>      <figcaption><em>From left to right: Jessica Watkins, Kjell Lindgren, Samantha Cristoforetti, Bob Hines</em></figcaption>  </figure><p id=\"t68suZ\">Crew-4 is taking place less than two days after SpaceX brought back <em>another</em> crew of four from the space station, though that crew did not include any government flyers. On April 8th, SpaceX launched four private astronauts to the ISS on a Crew Dragon <a href=\"https://www.theverge.com/2022/4/7/23013067/spacex-crew-dragon-axiom-space-ax-1-iss-launch\">for the commercial aerospace company Axiom Space</a>, which has contracted with SpaceX to launch a series of human spaceflight missions to the space station. The majority of the Axiom flyers each paid a reported $55 million for their seat on the Crew Dragon, agreeing to conduct experiments while aboard the station and helping Axiom develop protocols for launching people to private space stations in the future.</p><p id=\"ie4u4t\">The Axiom astronauts were supposed to return to Earth after an eight-day visit to the ISS, but their journey home was delayed by a week due to bad weather around Florida where they needed to splashdown. As the Axiom flight stretched, NASA had to push back the launch of Crew-4, as the agency wanted about two days to get ready between splashdown and launch. Finally, the Axiom crew was able to come home on Monday afternoon, paving the way for Crew-4 to launch on Wednesday morning.</p><p id=\"jl6vvv\">Once Crew-4 is at the space station, they’ll join three Russian cosmonauts, three NASA astronauts, and a German astronaut from the European Space Agency already living on the ISS. The NASA astronauts and ESA astronaut will help familiarize the incoming crew with the ISS before returning home on a SpaceX Crew Dragon of their own. They’re part of NASA and SpaceX’s Crew-3 mission, which launched to the space station in November and is now coming to an end.</p><p id=\"Z8FMoq\">Crew-4 is set to launch at 3:52AM ET on top of SpaceX’s Falcon 9 rocket out of the company’s launchpad at NASA’s Kennedy Space Center. NASA plans to provide launch coverage starting at midnight ET on Wednesday morning.</p><p id=\"MZ9bbt\"></p><p id=\"cYvqvs\"></p><p id=\"lGL2LM\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kqk8tnpJxcZi2juzOQpjvz5FZ00=/0x70:1920x1075/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23417966/NHQ202204260004_large.jpeg",
  "description": "Crew-4 is set to launch in the early morning hours on Wednesday.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}