{
  "title": "SpaceX reportedly paid $250,000 to cover up Elon Musk’s sexual misconduct",
  "url": "https://www.theverge.com/2022/5/19/23131680/elon-musk-sexual-misconduct-accusations-spacex-flight-attendant",
  "date": "2022-05-20T00:52:46.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"GERMANY-ECONOMY-AUTOMOBILE-TESLA\" src=\"https://cdn.vox-cdn.com/thumbor/vcsfVHpZ6FEUJDWrqV5MauaqKtA=/0x5:3142x2100/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70890043/1239416791.0.jpg\" />        <figcaption>Photo by PATRICK PLEUL/POOL/AFP via Getty Images</figcaption>    </figure>  <p id=\"iYayAV\">SpaceX reportedly paid a flight attendant $250,000 to ensure she didn’t speak out or sue the company after Elon Musk allegedly exposed himself and propositioned her for sex, according to a <a href=\"https://www.businessinsider.com/spacex-paid-250000-to-a-flight-attendant-who-accused-elon-musk-of-sexual-misconduct-2022-5\">report from <em>Business Insider</em></a>. In response, Musk took to Twitter to call the accusations “<a href=\"https://twitter.com/elonmusk/status/1527496917579612161\">utterly untrue</a>.” </p><p id=\"gDMQ4P\"><strong>Content warning</strong>:<em> The following story contains descriptions of sexual misconduct. If you need immediate support, you can contact the National Sexual Assault Hotline by going to </em><a href=\"http://online.rainn.org\"><em>online.rainn.org</em></a><em> or by calling 1-800-656-4673</em>.</p><p id=\"MWGY3p\">According to one of the flight attendant’s friends, the alleged victim worked as a crew member on a SpaceX corporate flight. During one of the flights, the attendant told her friend, Musk asked her for a full body massage in his room — reportedly, this was not unusual, and SpaceX had encouraged the attendant to get a masseuse license. During the massage, Musk allegedly removed the sheet that was covering the lower half of his body, showing her his erect penis. While rubbing her leg, he reportedly offered to buy the attendant a horse if she would “do more.” (The story notes that the attendant rode horses.)</p><p id=\"SZNtnW\">The allegations were relayed to <em>Insider</em> by one of the flight attendant’s friends, who was asked by the attendant’s attorney to sign a declaration backing up the claims in 2018. The friend told <em>Insider</em> the attendant refused to carry out any sexual acts on Musk, and that she was “really upset” following the flight. The friend also said SpaceX cut down on the number of shifts she was given following the incident, which the attendant saw as a sign of retaliation.</p><p id=\"OLUE5U\">In an attempt to discredit <em>Business Insider’s</em> reporting after the story was published, Musk <a href=\"https://twitter.com/elonmusk/status/1527518555641618433\">called the flight attendant’s friend</a> “a far left activist/actress in LA with a major political axe to grind.”</p><div class=\"c-float-right\"><aside id=\"dUlOnt\"><q>Hush money</q></aside></div><p id=\"JoxmsB\">According to <em>Insider</em>, the attendant filed a complaint to SpaceX’s HR department in 2018, saying that her career with the company had suffered because of her refusal. The company reportedly took the complaint to a mediator, not a court or an arbitrator, and signed the attendant to a $250,000 severance agreement barring her from saying anything bad about Musk or his companies, including SpaceX and Tesla. This included talking about the payment itself.</p><p id=\"Fg8c5j\"><em>Insider</em> says its source did not consult the flight attendant before coming forward with the story, and says that the alleged victim declined to comment. The attendant’s friend did not sign a non-disclosure agreement.</p><p id=\"u74CPv\">When contacted for comment, Musk reportedly said that there was “a lot more” to the story, and said that it was a “politically motivated hit piece.” The language reminds us of <a href=\"https://twitter.com/elonmusk/status/1526961470562508802?s=20&amp;t=JKGfOTUgcJqlmkn0DVgRIQ\">a tweet from Musk</a> on Wednesday, where he told his followers that “political attacks on me will escalate dramatically in coming months.” He <a href=\"https://twitter.com/elonmusk/status/1526997132858822658?s=20&amp;t=Sjje-lDSigurXOU0Ng4img\">also warned</a> that he would be the victim of a “dirty tricks campaign.” </p><p id=\"CLFgX0\">According to <a href=\"https://twitter.com/johnjcook/status/1527421611070177307?s=20&amp;t=JKGfOTUgcJqlmkn0DVgRIQ\">an editor at <em>Insider</em></a>, Elon’s tweets were posted shortly after the outlet reached out for comment, making it seem as if he was trying to get out ahead of the story by priming people to not believe the next thing he was accused of. The outlet says he requested more time to respond further, but never responded again after <em>Insider</em> extended the deadline.</p><p id=\"5EpYnN\">Musk told <em>Insider</em>: “If I were inclined to engage in sexual harassment, this is unlikely to be the first time in my entire 30-year career that it comes to light.” </p><p id=\"qy45Yc\">Employees at <a href=\"https://www.theverge.com/22831380/spacex-employees-harassment-workplace-misconduct-elon-musk\">SpaceX</a> and <a href=\"https://www.theverge.com/2021/11/19/22791321/worker-sues-tesla-rampant-sexual-harassment-fremont-elon-musk\">Tesla</a>, however, have previously said that both companies helmed by Musk have cultures of sexual harassment. One worker at SpaceX said that the company didn't take meaningful action after they reported being groped by coworkers, and Tesla is facing multiple lawsuits over its HR department failing to protect workers who were “objectified, threatened, touched, and propositioned on the factory floor.” One worker said that Musk’s tweets, which sometimes contain sexual innuendos, help to set an example for how employees behave.</p><p id=\"9t2Tn5\">SpaceX did not reply to <em>The Verge</em>’s request for comment.</p><p id=\"6CfBmc\"><em><strong>Update May 19th 8:52PM ET: </strong></em><em>Added references to reports of Tesla and SpaceX allegedly having cultures of sexual harassment.</em></p><p id=\"KIxspG\"><em><strong>Update May 20th, 2:43AM ET: </strong></em><em>Added relevant tweets from Musk made in response to the allegations.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bH2ahjApEPV8xH4Inu2dW4lGh7Y=/0x230:3142x1875/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23576135/1239416791.jpg",
  "description": "He allegedly asked a flight attendant for an erotic massage.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}