{
  "title": "Spider-Man: No Way Home’s VFX wizards couldn’t see the Doc Ock memes coming",
  "url": "https://www.theverge.com/2022/3/22/22989935/spider-man-no-way-home-vfx-digital-domain",
  "date": "2022-03-22T15:38:03.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Alfred Molina on the set of Spider-Man: No Way Home.\" src=\"https://cdn.vox-cdn.com/thumbor/p4DTJktRTgSjUZBBiSInVpjp4_M=/264x0:3060x1864/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657083/HBX3240_mp01_v002.1044.0.jpg\" />        <figcaption>Digital Domain/Marvel Studios</figcaption>    </figure>  <p>VFX supervisor Scott Edelstein opens up about Spider-Man: No Way Home</p> <p id=\"F2fAz0\">By the time Marvel eventually got around to using <a href=\"https://www.theverge.com/2021/12/14/22834061/spider-man-no-way-home-review-tom-holland-marvel-multiverse\"><em>Spider-Man: No Way Home</em></a>’s trio of Spider-Men to <a href=\"https://www.polygon.com/22947332/spider-man-no-way-home-pointing-meme\">recreate the pointing Spider-Man meme</a>, the Spider-Man fandom had already taken matters into its own hands and turned Alfred Molina’s Doc Ock into the breakout star of the film by way of unintentional comedy. Though the movie’s <a href=\"https://www.theverge.com/2021/8/23/22638877/spider-man-no-way-home-first-trailer\">earliest trailers</a> were meant to mystify fans who didn’t yet know the multiversal specifics that would bring Molina’s Doc Ock face to face with Tom Holland’s Peter Parker, they also ended up setting off a wave of jokes taking the piss out of one of Spider-Man’s most self-serious villains.</p><p id=\"Gelsjq\">Given the amount of planning that goes into Marvel’s tentpole features, one could have gotten the impression that everything about <em>No Way Home</em>’s rollout, from the immediate jump to speculation about characters edited out from the trailers to <a href=\"https://www.polygon.com/22880209/spider-man-no-way-home-floating-doc-ock-twitter-memes\">the rise of Doc Ock memes</a>, was part of Marvel’s grand plan. But when we recently spoke with Scott Edelstein, a VFX supervisor for Digital Domain, one of the production houses that worked on <em>No Way Home</em>, he explained that while the studio runs a tight ship held together with precise coordination, he and the rest of his team had very little sense of how the public was going to run with and remix their work.</p><div id=\"G7XOJo\"><div data-anthem-component=\"imageslider:11108397\"></div></div><p id=\"mLdKmC\"><strong>It’s come up in a couple of other conversations, and I wanted to ask you. What’s your experience been like since working from home became the norm for a lot of VFX professionals during the pandemic?</strong></p><p id=\"EEwGBX\">Scott Edelstein:<strong> </strong>It has allowed this work-life balance that we haven’t... it’s not the easiest thing in this industry, you know? For me personally, I was driving an hour and a half each way, so three hours of my day is sitting in the car. This setup really lets me wake up in the morning and be able to sit down at like 7AM with a cup of coffee and go through morning emails. By the time the team gets in, they already know what to do, and I can start getting my kids’ mornings kicked off, and it’s really changed a lot. I just — I think it’s made things more efficient, and I don’t see how we ever go back.</p><p id=\"1J3a6G\"><strong>Efficient how?</strong></p><p id=\"u7Sp5F\">When you’re talking about the leadership on a show, something like 80 percent of their day is going from meeting to meeting, running around the building to talk about this stuff. When you’re doing it all over Zoom, you’re not traipsing around trying to get to each different meeting room. While you’re in these Zoom meetings, you’re still working, and you’re paying attention, but you don’t always have to contribute 100 percent of the time.</p><div class=\"c-float-right\"><aside id=\"WHTUL8\"><q>I think working from home made things more efficient, and I don’t see how we ever go back</q></aside></div><p id=\"6x1rmG\"><strong>I get that.</strong> </p><p id=\"3SOgQW\">I can’t tell you how many times we’ve been in meetings with lots of people where we’re talking about stuff, and things are being actioned during the meeting. Before the meeting ends, stuff is already finished, and you’ve already looked at it and approved it, whereas before, people had to go back to their desks an hour later, and then get into it, and <em>then</em> wait for the next meeting to show you.</p><p id=\"3Doi1h\"><strong>Was that your experience with </strong><em><strong>No Way Home</strong></em><strong>?</strong></p><p id=\"G5Clal\">In part, yeah. For me, part of what was cool about working on <em>No Way Home </em>was the daily review process. Typically in the office, we’d go into the screening room, sit there, watch all the shots and talk about them, and give notes. Usually, we would be in the front row of a dark room, and you’re in there for however many hours a day. Artists sort of filter in the back, and their shots would come up, and you talk about them with the laser pointer on the screen. But you never really get a lot of face time with people that way because there are so many people. </p><p id=\"zv1YFC\"><strong>Right.</strong></p><p id=\"6PTVO6\">With <em>No Way Home</em>, we had probably 200-ish artists on the project, and what I found that was really cool about work from home and Zoom meetings like this is like what we’re doing right now. [<em>gesturing towards the camera</em>]</p><p id=\"cm8V0q\">Like when I’m talking to an artist about a shot, I’m not in a dark room in the front row, and they’re in the back. I’m looking at them, and we’re having a conversation about their work. I think that’s super cool. You can say what you want about the personal aspect of it and how it’s a creative environment and how being together helps you have that sort of back and forth. But I think that there’s other ways of doing that, and I think that the pandemic has shown us that we <em>can</em> do it from home.</p><div id=\"j2cje8\"><div data-anthem-component=\"imageslider:11108378\"></div></div><p id=\"nnyJMF\"><strong>What were some concepts about Doc Ock’s physicality that you really wanted to highlight in the bridge fight scene that might not have been quite as technically feasible back in 2004 for </strong><em><strong>Spider-Man 2</strong></em><strong>?</strong></p><p id=\"tHmMGB\">Our approach was to watch the old films because we really wanted to pay homage to them. We wanted the personality of the arms to kind of come through in a similar way but also wanted to bring new technology into the mix to give them more character. Because of the way movies like this are shot, we sometimes had Alfred Molina on wires, and other times, he was standing on a platform that lifted him around. For the most part, it ended up being that he was more comfortable standing on this platform so that he wasn’t just dangling. We almost always replaced him from the neck down because we had to replace all of his legs and his jacket because that long coat he’s wearing is getting draped over stuff or stuck on things. </p><p id=\"lLZBa8\">So we almost just kept his head for the whole time, but then you have to talk about his weight, his movement, and how you make it look like he’s not just floating. We paid a lot of attention to grounding it in a little bit of reality. So like, he’s got four arms, but we had to make sure that he wasn’t ever only standing on one of them while he’s also leaning way out and holding a car, you know? The weight transfer of how he walked had to make sense so that it felt like he was like a heavy piece of machinery crawling around.</p><p id=\"Ri0hzS\"><strong>Talk to me about the internal logic you developed for how Otto interacts with his tentacles and how they move and behave.</strong></p><p id=\"VCjXq9\">So, there’s a couple of things that go into this. For one thing, their inner lights change color depending on who’s in control. If you watch the old movie, you sort of get it even though the continuity of that maybe wasn’t so strong, but in this one, we really wanted to pay attention. When the lights inside are red, it means that his chip is fried, and so the arms’ AI is 100 percent in control. Under the bridge, when Spider-Man takes over with the nanotech, the lights turn blue because he is now in control of them, sort of like a Bluetooth connection. And then later in the film, when the chip gets fixed and Doc Ock is in charge again, they’re white, which is a nod to the original <em>Spider-Man 2</em> when Otto first puts the arms on. </p><p id=\"I4niD4\">Something that Kelly Port, the overall VFX supervisor, had told us about from talking to Alfred on set for <em>No Way Home</em> is that Alfred actually named the arms way back in the day so that he, in his own head, could give them personality like, you know. So the two top arms were Moe and Flo, and the two bottom halves were Larry and Harry. The idea that we kind of ran with is that Moe and Flo — the two top arms — are kind of the more planning-oriented. They’re the ones that are really kind of communicating with Otto because they’re the smart ones. You can see moments in the bridge fight where you notice that they’re kind of looking around and maybe talking to him or planning with each other about what to do. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-R24grNsmjEVEuZR0zbdBBVb2gk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23336776/HBX2380_comp_v102.1018.jpg\">  </figure><p id=\"k6tp4i\"><strong>You can see some of that with Otto when everyone’s gathered together at Happy’s condo.</strong></p><p id=\"azWlsg\">It’s a little bit more subtle, but yeah, you sort of see the interaction between Moe and Flo and Doc Ock. The tentacles are paying attention, but also, they’re looking and almost making eye contact with Doc Ock. Moe and Flo are following what’s going on in the room, but Larry and Harry — the guys on the bottom — are kind of just straight down or on the ground providing balance. Larry and Harry are more like the muscle, and they’re carrying out the plan. They’re really usually what’s walking him around, and a lot of times, when things get thrown or crushed, it’s Larry and Harry doing that kind of work.</p><p id=\"jBVN3X\"><strong>With a project like this, where there’s so much blue screening, there are so many different moving parts that all have to sort of fit together to create a false reality. Does the potential for meme-ing factor into your creative process at all?</strong></p><p id=\"ecc0Xn\">I wish I could say that we had time to really consider a lot of that, but when you’re in it, there’s so very little time, and you’re just in this little box. Our main focus is making this all look as real as possible. You have these blinders on, and you’re trying to make it look as real and as cool as you can make it. I think that if you are aware of anything, it’s just “that movement doesn’t look good” or “he doesn’t feel real” or “this character wouldn’t do that.” But as far as thinking so far ahead to what memes might come out of it, we just don’t, really.</p><p class=\"c-end-para\" id=\"nMXkB9\">We don’t really get to see the fan reaction or think about them until the thing comes out. It is fun, though, watching people react to trailers and come up with theories about things because you’re in it. You’re making those scenes, and you’re releasing these trailer pieces, and sometimes they’re not finished. Sometimes it’s not even going to be the same action shot that’s going to make it into the final film. But you hear these theories about, like, where Doc Ock got the nanotech. “What’s he doing with all that nanotech on his arms? He obviously took it from Tony Stark. He’s going to make himself way stronger, and it’s going to be so cool!” Meanwhile, we’re sitting there the whole time like, “No, Spider-Man’s just taking control of his body.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6nTfi_bpvjZD1UNRzNRYIb1rOsE=/0x34:3495x1864/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23335409/HBX3240_mp01_v002.1044.jpg",
  "description": "No Way Home’s VFX team could not predict how fans would run with their work",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}