{
  "title": "Sports streaming is busted — the Super Bowl likely won’t be any different",
  "url": "https://www.theverge.com/22910839/super-bowl-streaming-issues-sports-broken-lvi",
  "date": "2022-02-07T18:00:00.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"An outside shot of SoFi Stadium in Los Angeles ahead of Super Bowl LVI, featuring the logo for the Super Bowl spelled out in roman numerals.\" src=\"https://cdn.vox-cdn.com/thumbor/l6udVrLXJp2SLoSo-16xrtcpZJg=/0x0:5472x3648/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70480374/1238091558.0.jpg\" />        <figcaption><em>Super Bowl LVI will be played at SoFi Stadium in LA — but it’ll take crucial seconds for the livestream to reach fans who are watching over the internet instead of traditional broadcast methods.</em> | Photo by Jevone Moore / Icon Sportswire via Getty Images</figcaption>    </figure>  <p id=\"sK35Dc\">There’s a lot that can go wrong for cord-cutters, particularly when it comes to live sports:  buffering, crashing, login issues, you name it. It’s almost certain that the next big US sporting event, <a href=\"https://www.theverge.com/super-bowl\">Super Bowl LVI</a>, will face many of the same hiccups — and that’s especially true for anyone hoping to place bets on the big game.  </p><p id=\"03JaKb\">As cord-cutting becomes more common in households, these problems have become entirely too frequent for anyone hoping to stream a live event. Take, for example, the recent 2020 Summer Olympics Games, where even<em> finding</em> specific coverage<em> </em>was <a href=\"https://www.theverge.com/2021/7/29/22589928/peacock-2020-olympics-streaming\">needlessly complicated</a>, and streaming didn’t work the way it was promised to. </p><p id=\"qrjcMu\">That’s a big problem for interactivity in sports streaming and <a href=\"https://www.theverge.com/22822590/sports-betting-streaming-wars-disney-dazn-fubo-tv-sling\">bet-placing exploding</a> with wider legalization. Problems with latency can throw a big ol’ wrench into the experience, especially when it comes to micro-betting on specific plays. Heck, it makes even <em>talking</em> about the game with friends and family in real time dang-near impossible.</p><div class=\"c-float-right\"><aside id=\"hkW8DZ\"><q>Delays in streams are throwing a wrench into interactivity for sports fans</q></aside></div><p id=\"r9yjkS\">“You need real-time streaming to really have to have legitimate or true interactivity,” Jed Corenthal, CMO of real-time streaming platform Phenix, tells <em>The Verge</em>. “Because if you and I are watching a game and you’re two seconds behind me, even, we can’t really chat with each other because we’re delayed. It doesn’t make for a good user experience.”</p><p id=\"v4UDjq\">According to a recent Phenix survey of 1,014 adults in the US who stream sports, 14 percent of respondents said they’d want to place bets live during the Super Bowl. But the issue is streaming introduces a whole mess of ways that a live event can be interrupted, and that’s a big problem with real money involved. Sure, cable users can experience delays as well, but that’s markedly different than a live TV streaming service freezing or cutting out entirely. </p><p id=\"cFokvm\">“Cable, satellite and OTA (over the air), which is how users get their ‘bundle,’ all come with delays,” Corenthal says, speaking to lag issues with traditional pay TV. “Typically we see from 7-15 seconds depending on provider and location. Part of that is due to language and ‘wardrobe malfunctions’ and the rest is technology related.”</p><div class=\"c-float-right\"><aside id=\"ROrFiu\"><q>“When you get into micro-betting on plays, it’s certainly an issue”</q></aside></div><p id=\"WNFKfw\">But when it comes to streaming, whether you’re watching the Super Bowl on NBC’s apps or Peacock or a live TV service like YouTube TV or FuboTV, there’s no promise you won’t bump into a cornucopia of streamer’s problems. This kind of nuisance is a better’s nightmare.</p><p id=\"UYl2eS\">“Even Comcast is delayed versus being in the stadium,” Rich Greenfield, analyst and partner at LightShed Partners, tells <em>The Verge. </em>He notes<em> </em>that technologies like Phenix can work to reduce latency in livestreams, but Greenfield adds that when it comes to streaming live events, users can experience “upwards of 45 seconds of delay.”</p><p id=\"7Hq38s\">“It’s a real issue for betting — not for betting on who wins, but when you get into micro-betting on plays, it’s certainly an issue,” he says. </p><p id=\"i2YSEu\">Corenthal echoed that, saying it’s relatively commonplace now that streamers are complaining about the ability to stream stuff without crashing, login issues, etc. Phenix’s survey found that 72 respondents were frustrated with how slow the delays were during live events.</p><div class=\"c-float-right\"><aside id=\"Flp5YG\"><q>“The same issues keep popping up”</q></aside></div><p id=\"JckU34\">“There is latency from the field of play ... and then there is ‘drift’ which is the time between users watching the same thing on the same platform,” he says. “In other words, you and I could watch the Super Bowl on YouTube TV and be 60 seconds apart from each other. So it’s both the latency and the drift when you hear your friend comment on a touchdown but you haven’t seen the play yet.”</p><p id=\"tuPwCQ\">It shouldn’t be an unreasonable ask of streaming services to deliver a sturdy experience without any significant problems. (Quality is an issue as well, but don’t even <em>think</em> about asking for true 4K coverage — it <a href=\"https://www.theverge.com/2022/1/19/22878110/super-bowl-lvi-2022-no-4k-streaming\">ain’t happening</a> this year.) But, Corenthal says, “the same issues keep popping up because the same technology is being used by most of all the broadcasters and people that are streaming these types of events. And until that really changes, frankly, nothing else is going to change.”</p><p id=\"TmV2X9\">The nice part about streaming the game this year is that it’s as easy as paying a few bucks for one of Peacock’s premium tiers. The bad news is that sports streaming’s still a whole mess — particularly for anyone planning to place bets. Outside of temporary trials or stuff you’re already paying for, there aren’t a ton of “free” streaming solutions. (Peacock’s free tier will feature clips and highlights but not the live game or on-demand replays.)</p><p id=\"uGBFk8\">For the most pain-free experience, you’re probably still best off with OTA or cable, which is ludicrous considering <em>it’s</em> <em>the year 2022</em>. And unfortunately, canceling a temporary Peacock subscription is unlikely to be the only headache fans have to deal with come game day.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OqRsfMkkNihIpQJOezFMbVArqM0=/0x0:5472x2865/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23207659/1238091558.jpg",
  "description": "There are almost certainly going to be problems.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}