{
  "title": "Spotify’s subscribers rise to 182M despite Joe Rogan controversy",
  "url": "https://www.theverge.com/2022/4/27/23044260/spotify-financial-results-q1-2022-joe-rogan-russia-suspension",
  "date": "2022-04-27T10:22:22.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IaMAlHqeqYQlSq_w8W4KLt2K8iI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70798639/acastro_180213_1777_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"BKHyFI\">Spotify’s <a href=\"https://www.businesswire.com/news/home/20220427005371/en\">latest earnings release</a> suggests that the audio streaming service’s subscriber numbers haven’t seen much, if any, impact from the controversies that surrounded its Joe Rogan podcast <a href=\"https://www.theverge.com/2022/2/1/22912275/joe-rogan-spotify-covid-misinformation-moderation-podcast-exclusive\">just a few short months ago</a>. </p><p id=\"WAOpFZ\">In the quarter ending March 31st, Spotify says its premium subscribers rose 15 percent on a year-on-year basis to 182 million, up from 180 million the previous quarter. Monthly active users rose 19 percent year-on-year to 422 million, up from 406 million at the end of last year. For context, in the previous quarter premium subscribers rose 16 percent year-on-year, while monthly active users were up 18 percent.</p><p id=\"07lMy4\">Spotify had previously expected to hit 183 million premium subscribers this quarter, but slightly missed this target as a result of withdrawing from the Russian market. “Excluding the impact of our exit from Russia, subscriber growth exceeded expectations” the company said in its press release. </p><div id=\"VJrxBI\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We delivered another strong quarter building on momentum from 2021. Grateful for the tireless work of the <a href=\"https://twitter.com/Spotify?ref_src=twsrc%5Etfw\">@Spotify</a> team on behalf of creators and listeners around the world <a href=\"https://t.co/jnNPFgm9YK\">https://t.co/jnNPFgm9YK</a> <a href=\"https://t.co/ddq1NiJf5n\">pic.twitter.com/ddq1NiJf5n</a></p>— Daniel Ek (@eldsjal) <a href=\"https://twitter.com/eldsjal/status/1519256728466042880?ref_src=twsrc%5Etfw\">April 27, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"hd9UCj\">Spotify’s subscriber growth does not appear to have meaningfully slowed down as a result of the Joe Rogan controversy, which engulfed the company this financial quarter. The controversy kicked off when high-profile artists like <a href=\"https://www.theverge.com/22922714/neil-young-spotify-letter-ceo-daniel-ek-employees-joe-rogan\">Neil Young</a> and <a href=\"https://www.theverge.com/2022/1/29/22907696/joni-mitchell-spotify-joe-rogan-podcast-misinformation-covid-19\">Joni Mitchell</a> pulled their music from the platform after they said Joe Rogan was using his Spotify podcast to spread vaccine misinformation. <a href=\"https://www.bloomberg.com/news/articles/2022-01-27/-spotifydeleted-trending-amid-the-platform-s-neil-young-dilemma\"><em>Bloomberg</em> noted</a> that #SpotifyDeleted was soon trending on Twitter, as users pledged to stop using the service. </p><p id=\"hS9N1h\">Rogan recently revealed that he actually gained subscribers as a result of the controversy. “It’s interesting, my subscriptions went up massively — that’s what’s crazy,” Rogan <a href=\"https://www.theverge.com/2022/4/26/23042559/rogan-subscriber-bump-spotify-controversies\">said on a recent episode</a>. “During the height of it all, I gained 2 million subscribers.”</p><p id=\"cMvFlt\">Spotify is widely considered to be the world’s largest audio streaming service. Competitors like Amazon Music and Apple Music don’t regularly release subscriber numbers, but the last public figures <a href=\"https://musically.com/2022/02/03/spotify-apple-how-many-users-big-music-streaming-services/\">compiled by <em>Music Ally</em></a> saw Apple Music with 60 million subscribers, and Amazon Music with 55 million. </p><p id=\"ZpV6Lx\"><a href=\"https://www.theverge.com/2022/3/25/22996412/spotify-russia-suspending-services\">Spotify announced it would be suspending its services in Russia</a> at the end of March, a few days before the end of the financial quarter. In a statement, the company cited “recently enacted legislation” as the reason for the suspension; an apparent reference to a Russian law passed in the wake of its invasion of Ukraine that punishes the spreading of “<a href=\"https://www.theverge.com/2022/3/4/22961472/russia-fake-news-law-military-ukraine-invasion-casualties-jail-time\">fake news</a>” with up to 15 years in prison. Spotify announced the suspension near the end of the financial quarter, and said that it expected services to be fully wound down by April. It reports that it’s already seen 1.5 million disconnects as a result of a wind-down and that it expects to see 600,000 more in April for a total of over 2 million. </p><p id=\"ZA4Ly3\">Spotify only recently <a href=\"https://investors.spotify.com/financials/press-release-details/2020/Spotify-Launches-in-Russia-and-12-Additional-European-Markets/default.aspx\">launched its services in Russia</a>, and later called it its “<a href=\"https://www.theverge.com/2020/10/29/21539759/spotify-320-million-monthly-active-users-155-subscribers-q3-2020-earnings\">most successful new market launch to date.</a>”</p><p id=\"m0eWF9\">Otherwise, Spotify’s average revenue per user fell slightly from €4.40 (around $4.66) for premium subscribers last quarter to €4.38 this quarter (around $4.65), although it increased 6 percent year-on-year. Overall, the company made a profit of €131 million this quarter. Spotify generally prioritizes subscriber growth over quarterly profit and revenue, which has made quarterly profits like this relatively uncommon. </p><p id=\"7APIgd\">This quarter marked a year since Spotify announced a new <a href=\"https://www.theverge.com/2021/2/22/22295273/spotify-hifi-announced-lossless-streaming-hd-quality\">higher quality streaming tier called Spotify HiFi</a> that would offer CD-quality lossless streaming. Despite saying that it intended to launch HiFi before the end of the year, it’s <a href=\"https://www.theverge.com/2021/12/23/22851667/spotify-hifi-lossless-hi-fi-streaming\">still not available</a>. Meanwhile, the world’s second largest music streaming service, Apple Music, <a href=\"https://www.theverge.com/2021/5/17/22440090/apple-music-lossless-audio-dolby-atmos-support-audio\">announced</a> and <a href=\"https://www.theverge.com/2021/6/7/22523228/apple-music-lossless-spatial-audio-dolby-atmos-features\">then launched</a> lossless music streaming of its own after Spotify’s announcement, while <a href=\"https://www.theverge.com/2021/5/17/22440058/amazon-music-hd-price-cut-apple-lossless-audio\">Amazon stopped charging extra</a> for lossless on its service.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VZbOnVgk9uWtT7tCxD5NNjEQSyU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10224897/acastro_180213_1777_0003.jpg",
  "description": "It also suspended services in Russia this quarter.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}