{
  "title": "Spotify’s 2021 royalty report paints a rose-tinted vision of the music streaming industry",
  "url": "https://www.theverge.com/2022/3/24/22994404/spotify-2021-royalty-report-music-streaming-industry-revenue-artists-loud-clear",
  "date": "2022-03-24T15:16:46.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Pd5Nt7wGQu_1zMyy25qnUdTFgmE=/94x0:1107x675/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70666459/2___Revenue_Generated.0.png\" />    </figure>  <p id=\"8K9kfH\">Spotify is continuing its effort to offer some transparency to <a href=\"https://www.latimes.com/entertainment-arts/music/story/2022-03-01/spotify-protest-songwriters-royalty-rates\">musicians who are unhappy with its streaming rates</a>. The company updated <a href=\"https://loudandclear.byspotify.com/\">its “Loud &amp; Clear” website</a> today, providing a breakdown of some 2021 metrics for how artists, publishers, and rights holders actually make money off Spotify streams. </p><p id=\"0nMID1\">As one might expect, Spotify chooses to call out here are positive improvements <a href=\"https://www.theverge.com/2021/3/18/22336087/spotify-loud-clear-website-launch-pay-artists-streaming-royalities\">over 2020</a>. Spotify paid out over $7 billion to artists, labels, and the other moving pieces of the music industry last year, up from $5 billion last year. Over 16,500 artists’ catalogs earned at least $50,000 in royalties in 2021, compared to 13,400 in 2020, and over 1,000 artists cracked $1 million from Spotify streaming for the first time (versus 870 artists hitting that high watermark last year). Meanwhile, over 52,600 artists earned at least $10,000 from Spotify streams last year, compared to 42,500 in 2020. </p><p id=\"JkA5k6\">And like last year, there’s still a calculator where artists (and fans) can input their monthly listener count or song streams to see how their stats compare to the rest of Spotify.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uYkzJBhyf3jwMRsF1e2ukdnX1Tc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342272/T00_Overview.png\">  </figure><p id=\"SNtvlp\">Of course, Spotify seems to be specifically picking numbers that showcase its contributions to the music industry in the best light — nothing on the Loud &amp; Clear website portrays Spotify’s royalty rates as anything other than a net positive for the industry, something that musicians clearly don’t see eye to eye on (as a <a href=\"https://www.latimes.com/entertainment-arts/music/story/2022-03-01/spotify-protest-songwriters-royalty-rates\">recent protest</a> in LA shows). </p><p id=\"sWbYkW\">Spotify’s site emphasizes those big wins, but is quieter at highlighting the context of the far larger number of artists who <em>aren’t</em> pulling in thousands of dollars every year from the streamer. According to Spotify, there are over 8 million artists on its platform, of which about 2.6 million have uploaded at least ten songs. And of those 2.6 million artists, only 165,000 of them averaging at least 10,000 streams a month — compared to the 52,600 artists that Spotify says made at least $10,000 through its platform last year, a gulf that speaks to the spectrum of success on the platform. </p><p id=\"uxNQac\">The overall growth is encouraging — but as Spotify grows more popular, the relative numbers for “success” shift. And given that Spotify divvies out earnings based on how well a song or artist does compared to the rest of the platform, it doesn’t just matter how popular an artist’s catalog is — it’s how popular it is compared to everything else on Spotify. The company calls out as an example that over 230,000 songs broke 1 million streams in 2021, something that would have been a rarified achievement back in the service’s earlier days when it had far fewer listeners.</p><p id=\"KqkGUO\">Spotify’s increased transparency is a good thing, especially as the music industry continues to hold streaming platforms to increasing scrutiny over how they pay artists. But there’s clearly still a lot of work to be done in translating streaming music success into monetary success for most artists on the platform. </p><p id=\"RE9aq3\"><em><strong>Correction March 24th, 12:10pm: </strong></em><em>This article originally stated that Spotify did not provide context for the number of total artists on its platform compared to its revenue goalposts. That information has been added to this post. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dOFwN_-9_23zt9SuIDiWo_nK6ks=/0x24:1200x652/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23342274/2___Revenue_Generated.png",
  "description": "The company’s latest \"Loud & Clear\" report highlights artists’ wins in 2021.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}