{
  "title": "Spotify will shut down its radio-like listening app Stations on May 16th",
  "url": "https://www.theverge.com/2022/5/6/23060239/spotify-stations-experiment-may-16th-radio-pandora",
  "date": "2022-05-06T19:26:23.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3ntanCv6HAewXIUZjT2KE5O9yQk=/0x69:1638x1161/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70840972/stations2.0.jpg\" />    </figure>  <p id=\"mN9vnZ\">Besides podcasts, things for your car, and annual listening recaps, Spotify has been running another experiment since 2018 with Stations, a “lightweight” app available for free and paid subscribers. </p><p id=\"6mmgrY\">After its <a href=\"https://www.theverge.com/2018/1/30/16953800/spotify-stations-new-app-playlists-features\">initial debut overseas with an Android version</a>, Spotify launched an iOS version of the app in 2019 <a href=\"https://www.theverge.com/2019/6/4/18651865/spotify-stations-ios-release-date-news-features-australia-playlists\">and opened it up to users in the US</a>. However, now the test is over, and <a href=\"https://9to5google.com/2022/05/05/spotify-stations-app-shut-down/\"><em>9to5Google</em> reports</a> Spotify has started notifying users that the app will shut down on May 16th.</p><p id=\"TJZ7tV\">If you used Stations, you can visit <a href=\"https://stations.spotify.com/\">the site </a>to move your favorite curated lists over to the main Spotify app, which includes the following message:</p><blockquote><p id=\"POtOCr\">Stations is shutting down on May 16th. The stations you created will go away, but you can still enjoy Spotify by logging in with your Stations account. Discover playlists made for you, plus millions of songs and podcasts.</p></blockquote><p id=\"mzQpqb\">The Stations gimmick was that it started playing as soon as you opened the app, and while users could swap across their preferred stations / playlists, there was no way to pick specific tracks or artists, and returning to a station would start right where it left off. The available stations included a number of presets and some you could create by picking your favorite artists from a list, and it would attempt to personalize the experience for you over time.</p><p id=\"6hXVZN\">In a statement given to <a href=\"https://techcrunch.com/2022/05/06/spotify-stations-shutting-down-may-16/\"><em>TechCrunch</em></a>, Spotify said of its various projects: “Some of those tests end up paving the way for our broader user experience and others serve only as an important learning. Our Spotify Stations Beta was one of those tests. We will be sunsetting the current feature, but users will be able to easily transfer their favorite stations and enjoy a similar radio experience directly within the Spotify app.”</p><p id=\"ukoKjc\">If you’ve been devoted to the Stations feature, you may notice an improved Spotify Radio experience within the main app, <a href=\"https://www.theverge.com/2018/10/18/17992758/spotify-premium-personalized-artist-radio-search-update-2018\">which now can include personalized radio stations</a> as well as <a href=\"https://www.theverge.com/2019/6/12/18662060/spotify-your-daily-drive-playlist-update\">a news and music playlist for drivers</a>. As <em>TechCrunch </em>notes, Spotify announced a <a href=\"https://www.theverge.com/2022/4/12/23022006/spotify-live-audio-programs-greenroom-podcasts\">rebranding for its live audio platform from Greenroom to Spotify Live</a> last month and will include its features in the main app while also leaving a standalone app available.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yGfrpisMdSJ-3D5SgtD7EBclKGU=/0x186:1638x1044/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10127783/stations2.jpg",
  "description": "Now you can’t avoid the main Spotify app so easily.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}