{
  "title": "Spotify’s CEO mistakes company growth for a mission statement",
  "url": "https://www.theverge.com/2022/2/8/22923525/spotify-daniel-ek-mission-statement-talent-recruitment",
  "date": "2022-02-08T16:58:01.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2JK7FhKt75ELQj07eQdMuZHQ3bA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70484189/acastro_180213_1777_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"8iJ53G\"><em>This story originally ran in Hot Pod, The Verge’s preeminent audio industry newsletter. You can subscribe </em><a href=\"https://hotpodnews.com/subscribe/\"><em>here</em></a><em> for more scoops, analysis, and reporting.</em></p><p id=\"QxrGfO\">Let’s pick up with the news last week that Spotify hosted an internal town hall during which CEO Daniel Ek addressed his staff around the world. I obtained the audio from that meeting, and you can read the transcript in full <a href=\"https://www.theverge.com/2022/2/3/22915456/spotify-ceo-joe-rogan-daniel-ek-town-hall-speech-platform-podcast\">here</a>. (Over the weekend, there was also a second twist in the Rogan story involving a viral video of the comedian using the n-word many times. You can read all about that <a href=\"https://www.theverge.com/2022/2/5/22919271/spotify-joe-rogan-experience-slur-planet-of-the-apes\">here</a> and Spotify’s response <a href=\"https://www.theverge.com/2022/2/6/22921203/spotify-joe-rogan-episode-removal-internal-memo\">here</a>. And then my take <a href=\"https://www.theverge.com/2022/2/7/22921608/spotify-joe-rogan-moderation-guidelines-episode-deletion\">here</a>. Links, we got ‘em.)</p><p id=\"G5uvLg\">Today, though, I want to focus on Ek’s message to his employees, some of whom have concerns about Spotify’s choice to license Rogan’s content. Keep in mind that Spotify pays $100 million for the programming and is financially incentivized to promote Rogan’s show to make back its investment through ad revenue. This is an especially troubling decision for some of the company’s trans and Black employees, as well as its science reporters. </p><p id=\"kzdFT0\">Throughout his speech, Ek emphasized the need for Rogan. The company had no leverage in negotiations with hardware partners like Google and Amazon, he said, and it needed exclusives to keep its service on their platforms. </p><div class=\"c-float-left\"><div id=\"Thi1EK\"><div data-anthem-component=\"aside:1522405\"></div></div></div><p id=\"AHtscA\">Ek then directly related Rogan to Spotify’s “mission” to reach 1 billion users and bring 50 million creators to its platform. I quote the word mission specifically because we’ve talked a lot about the idea of mission in audio lately, particularly as it relates to recruiting and retaining talent. So let me first be clear about this: company growth isn’t a mission. It’s an understood reality of being part of a corporate machine, but it’s not a beating heart mission that inspires employees, particularly creatives, who want to get paid to make cool things and inform the world.</p><p id=\"ObLjpA\">Still, Ek seemingly can’t understand why his employees wouldn’t be able to both reckon with whatever feelings they have about Rogan while also accepting that to become the biggest audio app, they need Rogan and must accept him. </p><p id=\"FdhW1t\">“If we limit these divisive topics [like religion and politics], top creators will leave, and users deprived of the choice in content would flee from our platform and seek other alternatives,” he said. “And this, of course, would mean that we would never achieve our mission.”</p><p id=\"fUI49Y\">Now, the last time I wrote at length about mission and its relation to talent acquisition was when NPR lost multiple hosts seemingly back to back. </p><p id=\"RWz1qA\">Maria Hinojosa of Futuro Media <a href=\"https://www.theverge.com/2022/1/6/22870634/npr-audie-cornish-all-things-considered-host-departures\">specifically mentioned</a> NPR’s mission statement — to “create a more informed public” — to me as a way for the public media organization to not only retain people but to also point to as a north star for its content and goals. (Granted, there are other things that need to happen, too, including giving people creative freedom and compensating them more, but the mission can add to a compelling pitch.) </p><p id=\"H5ZVkO\">Spotify’s Silicon Valley growth mindset above all else is where I see potential for podcasting organizations to compete. Selling coveted hosts, reporters, producers, editors, and others on taking a job not only means offering fair compensation but also providing an ideal to uphold. Spotify might think its growth idea is empowering — and maybe it is for the employees who prize their stock options above all — but I think this rhetoric will lead to talent loss across the organization. (And committing $100 million to content made by people from historically marginalized groups as an apology doesn’t sub in as a real mission, either.)</p><div class=\"c-float-right\"><aside id=\"juGQie\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside></div><p id=\"KW04fZ\">Maybe by this time next week, we’ll have yet more Rogan news to share — new clips will surface, or new podcasters and musicians will pull their content — but I’m watching the employees. How do they feel about what Ek is selling, and will they be speaking up? How will recruitment fare?</p><p id=\"mPqWuF\">These are still open questions, but if I was a podcast organization competing against Spotify for talent, its “mission” is the weak spot. </p><hr class=\"p-entry-hr\" id=\"PLqR7T\"><h2 id=\"ndHIOw\">Related:</h2><div id=\"hSn1LB\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Why Spotify bought Joe Rogan’s podcast|76039\" data-volume-uuid=\"59ce4c7f8\" data-volume-id=\"76039\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-672\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/feZJXvWKTxgrNdZ4g9ZPfvj1kv8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10224895/acastro_180213_1777_0002.jpg",
  "description": "Will employees feel inspired?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}