{
  "title": "Spotify CEO Daniel Ek confirms removal of Joe Rogan episodes after n-word video resurfaces",
  "url": "https://www.theverge.com/2022/2/6/22921203/spotify-joe-rogan-episode-removal-internal-memo",
  "date": "2022-02-07T03:21:43.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"UFC 264 Weigh-in\" src=\"https://cdn.vox-cdn.com/thumbor/nebDYDWG1eTYV-puI1vtwLjH3kw=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70478332/1327904144.0.jpg\" />        <figcaption>Photo by Stacy Revere/Getty Images</figcaption>    </figure>  <p id=\"030lGU\">Spotify CEO Daniel Ek addressed staff in a late night memo addressing Joe Rogan’s use of the n-word and the <a href=\"https://www.theverge.com/22918697/joe-rogan-experience-podcast-episodes-disappear-controversy\">mysterious removal</a> of 70 podcast episodes earlier this week. The total number of deleted Joe Rogan Experience episodes is now 113, according to the website jremissing.com.</p><p id=\"cJcd9l\">“Not only are some of Joe Rogan’s comments incredibly hurtful — I want to make clear that they do not represent the values of this company,” Ek writes in the memo, which <em>The Verge</em> obtained. “I know this situation leaves many of you feeling drained, frustrated and unheard.”</p><p id=\"aufHGV\">He goes on to say Spotify spoke with Rogan and his team about “some of the content in his show, including his history of using some racially insensitive language.” Following these chats “and his own reflections,” Ek says Rogan “chose to remove a number of episodes from Spotify.”</p><p id=\"oFRpbu\">Ek also says that although he “strongly condemns” Rogan’s words, he does not believe “silencing Joe is the answer.” </p><p id=\"NBibAM\">“We should have clear lines around content and take action when they are crossed, but cancelling voices is a slippery slope,” he writes. “Looking at the issue more broadly, it’s critical thinking and open debate that powers real and necessary progress.”</p><div class=\"c-float-right\"><div id=\"F7b4F8\"><div data-anthem-component=\"aside:1522405\"></div></div></div><p id=\"Fkjaja\">He reiterates that he believes Spotify is a platform, not a publisher, but acknowledges employees and others might think otherwise given its licensing agreement with Rogan. (Ek made a similar point in a company town hall <a href=\"https://www.theverge.com/2022/2/3/22915456/spotify-ceo-joe-rogan-daniel-ek-town-hall-speech-platform-podcast\">last week</a>.) </p><p id=\"55XNgu\">Ek then says he’s committing $100 million — the same amount reportedly paid to exclusively distribute Rogan’s show — to licensing, developing, and marketing music and other audio content by creators from historically marginalized groups. He also says the company is expanding the number of outside experts it consults on how to balance user safety and “creator expression” and will share more details.</p><p id=\"uMyLEr\">Rogan himself <a href=\"https://www.theverge.com/2022/2/5/22919271/spotify-joe-rogan-experience-slur-planet-of-the-apes\">apologized</a> yesterday for using the n-word and for making a racist joke in which he compared being in an area with many Black people to being in<em> Planet of the Apes.</em></p><p id=\"bBDCdR\">This latest Rogan controversy started when Neil Young <a href=\"https://www.theverge.com/2022/1/26/22903354/spotify-joe-rogan-removing-neil-young-music\">removed his music</a> from the platform to protest Rogan’s skepticism of COVID-19 vaccines; Spotify responded to that issue by <a href=\"https://newsroom.spotify.com/2022-01-30/spotifys-platform-rules-and-approach-to-covid-19/\">promising to place</a> informational labels on any podcast content that discusses COVID, but otherwise insisted it is only a platform and will not take further action.</p><aside id=\"cdH7gX\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside><p id=\"5Z3V2Q\"></p><p id=\"RSjYKM\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dZ8D_ojRGE6kPo4yf7VzeHZOx10=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23222792/1327904144.jpg",
  "description": "Spotify will spend $100 million on content from marginalized groups",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}