{
  "title": "Spotify Car Thing gets ‘add to queue’ and call answering features",
  "url": "https://www.theverge.com/2022/4/7/23015144/spotify-car-thing-add-to-queue-calls-podcasts",
  "date": "2022-04-07T18:11:28.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WHV8n9zkuQtgQIQnhWQt3Jp14PY=/0x1:815x544/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70722651/Car_Thing_Image_3.0.jpg\" />        <figcaption>Spotify Car Thing has added new features | Image: Spotify</figcaption>    </figure>  <p id=\"08EPFi\">Spotify <a href=\"https://newsroom.spotify.com/2022-04-07/spotifys-car-thing-device-debuts-new-features/\">announced</a> Thursday it was adding the ability to respond to phone calls and other new features to its Car Thing infotainment system. Owners of the <a href=\"https://www.theverge.com/2022/2/22/22945403/spotify-car-thing-price-release-date\">$90 device, which went on sale in February</a>, also will now be able to add songs and podcasts to a queue, control other media, and use voice commands. </p><p id=\"lxLKhF\">Car Thing users will be able to see incoming calls and either answer them or dismiss them right in the Car Thing interface. They’ll also be able to switch between Spotify and other media using presets, voice, or tapping its screen. </p><p id=\"f13R1G\">Spotify says the new “add to queue” feature is one of its most-requested for Car Thing; you can do it either by voice (using the “hey Spotify” prompt), touch, or the device’s dial. You can also ask Car Thing to create a personalized playlist by telling it what genre or music type you’re interested in listening to. </p><p id=\"UQd4TZ\">Designed as a more convenient way of controlling Spotify while you’re driving, the Car Thing device uses Bluetooth to connect to your phone, and you can either run a cable to plug it into your car or have your phone connect to your car via Bluetooth. It lacks a rechargeable battery, so it needs to stay plugged into your car’s USB socket. </p><p id=\"N8VsU8\">Spotify says the features will roll out for iOS users automatically, and Android availability will roll out “at a later date.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Pd9EHwWMOTmneZWPdjCGc8haO8k=/0x59:815x486/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262334/Car_Thing_Image_3.jpg",
  "description": "Tell your Car Thing what you want to listen to.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}