{
  "title": "Spotify buys naming rights on FC Barcelona’s massive stadium",
  "url": "https://www.theverge.com/2022/3/15/22979943/spotify-camp-nou-barcelona-stadium",
  "date": "2022-03-15T22:57:31.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6bko3LSJpmNMNmOERxJbHOVe5Ew=/78x0:1947x1246/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70627752/spotify_camp_nou_soccer_stadium.0.png\" />        <figcaption>Spotify’s name will be featured on FC Barcelona’s jerseys for the next four seasons. | Image by FC Barcelona/Spotify</figcaption>    </figure>  <p id=\"pGKWGK\">Camp Nou, one of the most iconic soccer stadiums in the world, is being rebranded as Spotify Camp Nou as part of a sponsorship agreement with Spanish soccer club FC Barcelona that <a href=\"https://www.fcbarcelona.com/en/club/news/2535530/fc-barcelona-and-spotify-seal-a-strategic-long-term-partnership-in-sports-and-entertainment\">gives Spotify naming rights to the stadium</a>. Spotify’s name will also appear on the jerseys of both the men’s and women’s teams for the next four seasons starting in the 2022/23 season.</p><p id=\"fJZgXO\">The deal still has to get ratified by FC Barcelona’s Extraordinary Delegate Members Assembly in a vote that will take place on April 3rd. It likely won’t have much trouble passing, however, as <a href=\"https://frontofficesports.com/barcelona-1-57b-in-debt-looks-to-sell-media-stake/\">FC Barcelona is in a huge amount of debt</a> and sought to sell a stake in its media production division last year. </p><p id=\"TYDjm9\">The deal is <a href=\"https://www.cbssports.com/soccer/news/fc-barcelona-agree-to-sponsorship-deal-with-spotify-will-rebrand-stadium-as-spotify-camp-nou/\">reportedly worth $310 million</a>. It could have been worth more, Spanish publication <a href=\"https://www.sport.es/es/noticias/barca/spotify-base-datos-barca-13360992\"><em>SPORT</em></a><em> </em><a href=\"https://barcauniversal.com/barcelonas-small-database-of-fans-could-cost-the-club-millions-in-sponsorship-deal/\">reported</a>, if the club had a higher percentage of “registered” fans — fans who gave the club access to names, emails, and other personal information. Only around 1 percent of the club's 350 million followers are registered, according to the report. </p><div class=\"c-float-right\"><aside id=\"bcezHn\"><q>Spotify wants to bring “the worlds of music and football together”</q></aside></div><p id=\"GlbdLX\">Spotify will use its sponsorship as an opportunity to “amplify the work of artists” in a way that brings “the worlds of music and football together, giving a global stage to players and artists” at Spotify Camp Nou, Alex Norström, Spotify’s chief freemium business officer, said <a href=\"https://newsroom.spotify.com/2022-03-15/spotify-and-fc-barcelona-announce-a-first-of-its-kind-partnership-to-bring-music-and-football-together/\">in a statement</a>.</p><p id=\"zMku5I\">“Spotify is working with Barça to leverage our access to in-stadium elements to amplify artists and enable discovery,” Norström said. “For example, using the dynamic digital displays to showcase and geo-target relevant artists to Barça’s global TV audience. While viewers in Europe may see a message about one artist, TV viewers in India could be served a different and locally relevant message.” That could mean Spotify will be <a href=\"https://twitter.com/UltraLinx/status/1411807406728925196\">investing in those digital stadium ads</a> that change based on your location and the channel you’re watching the game on. </p><p id=\"A6fWgN\">But that’s about the only specifics Norström reveals about the partnership, and he said Spotify is considering “other exciting pieces” the company will share more about later this year.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6Uk2hcGVbd4Lac4N-UdhdohAtbk=/0x182:2032x1246/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318946/spotify_camp_nou_soccer_stadium.png",
  "description": "Spotify’s name will be on FC Barcelona’s jerseys.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}