{
  "title": "Spotify closes Russia office and removes Kremlin-backed content",
  "url": "https://www.theverge.com/2022/3/3/22959636/spotify-removes-rt-sputnik-russia-kremlin-ukraine-conflict",
  "date": "2022-03-03T12:08:13.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ft_o5uky6qkQSJjy-sX6MER-NSg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70573446/acastro_220202_1777_spotify_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"oKcnSz\">Spotify has closed its office in Russia and removed content from Kremlin-backed outlets RT and Sputnik, <a href=\"https://variety.com/2022/digital/news/spotify-closes-russia-office-removes-rt-sputnik-1235194594/\"><em>Variety </em>reports</a>. In addition, it’s also restricting the discoverability of content from other outlets affiliated with the Russian government. <a href=\"https://www.reuters.com/technology/spotify-closes-its-office-russia-response-attack-ukraine-2022-03-02/?taid=622085ef9fa2ce00010f14c7&amp;utm_campaign=trueAnthem:+Trending+Content&amp;utm_medium=trueAnthem&amp;utm_source=twitter\"><em>Reuters</em> reports</a> that RT and Sputnik’s content has been removed in several markets including the United States and European Union, but not in Russia itself. In total, Spotify says it’s reviewed thousands of pieces of content since the start of the war.</p><p id=\"YFEPDj\">Closing Spotify’s Russian office means that the company is no longer in compliance with a Russian law from July 2021 which obliges foreign social media companies with over 500,000 daily users to have a local office in the country. Failing to comply means these services can face restrictions up to and including being banned in the country,<em> </em><a href=\"https://www.reuters.com/technology/spotify-closes-its-office-russia-response-attack-ukraine-2022-03-02/?taid=622085ef9fa2ce00010f14c7&amp;utm_campaign=trueAnthem:+Trending+Content&amp;utm_medium=trueAnthem&amp;utm_source=twitter\"><em>Reuters </em>reports</a>.</p><p id=\"9lZ6w7\">For now, the music streaming service says it will continue to stream in Russia, a market it entered in July 2020 alongside Ukraine and 10 other European countries. “We think it’s critically important to try to keep our service operational in Russia to allow for the global flow of information,” a Spotify spokesperson told <em>Variety.</em></p><div class=\"c-float-right\"><aside id=\"WAXxqe\"><q>“It’s critically important to try to keep our service operational in Russia”</q></aside></div><p id=\"hNBX0y\">“Our first priority over the past week has been the safety of our employees and to ensure that Spotify continues to serve as an important source of global and regional news at a time when access to information is more important than ever,” Spotify said in a statement. “We are deeply shocked and saddened by the unprovoked attack on Ukraine.” The company is also matching employee donations to humanitarian efforts in the country two-to-one, and has launched a new <a href=\"https://open.spotify.com/genre/0JQ5DAqbMKFQB5IcbpPARW\">guide on the platform</a> to direct its users to trusted news sources, according to <em>Variety</em>.</p><p id=\"RKIq9u\">Spotify’s removal of RT and Sputnik is the latest example of efforts to restrict the reach of Russia’s state-backed media outlets. The European Union has <a href=\"https://www.theverge.com/2022/2/27/22953563/eu-ban-russia-aircraft-state-backed-media-ukraine-sanctions\">ordered their removal from the bloc</a>, and tech platforms including <a href=\"https://www.theverge.com/2022/3/1/22956114/youtube-blocks-russian-media-rt-russia-today-sputnik-europe\">YouTube</a>, <a href=\"https://www.theverge.com/2022/2/28/22955542/facebook-meta-blocks-rt-sputnik-eu-instagram\">Facebook</a>, and <a href=\"https://www.npr.org/2022/02/28/1083633239/facebook-and-tiktok-block-russian-state-media-in-europe?t=1646306276122\">TikTok</a> have complied by blocking their accounts, with Apple and Google following suit in their respective app stores. </p><p id=\"y2tpJc\">The ban is a notable move from Spotify, which has historically taken a lighter-touch approach to content moderation on its service. This year it’s faced tough questions and protests for exclusively hosting Joe Rogan’s podcast in a deal reportedly worth <a href=\"https://www.theverge.com/2022/2/17/22939587/joe-rogan-experience-spotify-podcast-deal\">$200 million</a>. The popular podcast host has been criticized for promoting COVID-19 misinformation as well as uttering racist language. Even after dozens of the podcast’s episodes <a href=\"https://www.theverge.com/22918697/joe-rogan-experience-podcast-episodes-disappear-controversy\">disappeared from the platform</a>, the <a href=\"https://www.theverge.com/2022/2/6/22921203/spotify-joe-rogan-episode-removal-internal-memo\">company’s CEO Daniel Ek</a> said it was Rogan himself who chose to remove them. </p><p id=\"n5LnOE\"></p><p id=\"rEM89H\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/piy4UaQSVeNWUvCO34_InDvmpHc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215198/acastro_220202_1777_spotify_0001.jpg",
  "description": "It’s been removed in the EU and USA, but not Russia itself.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}