{
  "title": "Spotify experiments with musician NFT galleries",
  "url": "https://www.theverge.com/2022/5/16/23074909/spotify-experiments-musician-nft-galleries",
  "date": "2022-05-16T16:08:32.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"A photo illustration of Spotify’s green circle logo\" src=\"https://cdn.vox-cdn.com/thumbor/_g82tQF3HtJUaJYsBrZWQH3YlaQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70874808/acastro_201110_4286_spotify_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Ii1ZYa\">Spotify is testing a way for artists to display their non-fungible token (NFT) collections, as first reported by <a href=\"https://musically.com/2022/05/13/spotify-artists-promote-nfts/\"><em>Music Ally</em></a>. The music streaming platform has rolled out the test for some users on Android in the US and currently includes NFT previews for artists like Steve Aoki and The Wombats.</p><p id=\"s5lBik\">“Spotify is running a test in which it will help a small group of artists promote their existing third-party NFT offerings via their artist profiles,” a Spotify spokesperson said in a statement to <em>Music Ally</em>. “We routinely conduct a number of tests in an effort to improve artist and fan experiences. Some of those tests end up paving the way for a broader experience and others serve only as an important learning.” Spotify didn’t immediately respond to <em>The Verge</em>’s request for comment.</p><p id=\"F1nQLj\">More companies are trying to catch the NFT wave, but it looks like that initial surge could be petering out (at least for the time being). According to <a href=\"https://www.wsj.com/articles/nft-sales-are-flatlining-11651552616\"><em>The Wall Street Journal</em></a>, daily NFT sales have dipped 92 percent from 225,000 in September of last year to just 19,000 as of May 3rd. The number of active NFT wallets is also on the decline, from about 119,000 in November to 14,000 toward the end of April.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ae4xAFZrzmSR3iNUPQyKrlZXQ4A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23471057/spotify_nfts_gallery.png\">      <figcaption><em>You can view NFT galleries from select artists’ profiles.</em></figcaption>  </figure><p id=\"O8rRYL\">I noticed I had access to the test after updating Spotify. When I navigated to both Steve Aoki’s and The Wombats’ artist pages, I saw that the NFT gallery sits beneath the artist’s header and song list. Clicking into it reveals a collection of NFTs that you can scroll through. If you select an NFT, you’ll see an enlarged version of it, as well as a brief description.</p><p id=\"xmsFiO\">Spotify will also give you the option to “See More,” which directs you to the NFT’s page on OpenSea where you can purchase it. But keep in mind that Spotify doesn’t seem to support  NFTs that are videos or GIFs — Spotify only shows a static image of the NFT in the app, not the full video. It also doesn’t include sound, which is kind of strange for a music streaming platform. You can only listen to the NFT or see if it’s a video or GIF by clicking through to its page on OpenSea.</p><p id=\"EkFFXG\">According to <em>Music Ally</em>, Spotify won’t collect a commission for any NFT sales made through the app and is just testing the integration. It also isn’t clear if the test has been made available to any other artists or if it’s just limited to Steve Aoki and The Wombats for now.</p><p id=\"1AI3Xv\">Rumors about Spotify entering the Web3 space surfaced in March after the company <a href=\"https://www.ft.com/content/9e77bf41-5814-4c18-96f6-f800f6b41216\">posted two job listings related to blockchain technology and NFTs</a>. As <em>Music Ally </em>notes, <a href=\"https://twitter.com/swiggity_swagg/status/1525007553800900608?s=20&amp;t=KN_mAGsNR86AXhY90rbXOw\">some users report</a> seeing a survey pop up on the Spotify app that asks them about their feelings on NFTs as well. In addition to Spotify, <a href=\"https://www.theverge.com/2022/5/9/23063514/nfts-coming-to-instagram-meta-digital-artwork\">Instagram also started testing NFT integration</a> last week.</p><aside id=\"sljJt7\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Steve Aoki on why he’s a ‘crypto believer’\",\"url\":\"https://www.theverge.com/22999333/decoder-steve-aoki-crypto-web3-aokiverse-metaverse-music-industry-business-nft\"},{\"title\":\"NFTs, explained\",\"url\":\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\"},{\"title\":\"Why gamers hate crypto, and music fans don’t \",\"url\":\"https://www.theverge.com/22917126/nfts-crypto-gamers-music-fans-fandoms\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/xuFFwxI55lIR0_bTJQ6qPVBKMfg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22026912/acastro_201110_4286_spotify_0001.jpg",
  "description": "Spotify’s first NFT test is like what Instagram is planning.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}