{
  "title": "Spotify’s COVID problems are bigger than Joe Rogan",
  "url": "https://www.theverge.com/2022/2/15/22934779/spotify-covid-vaccine-music-moderation-hot-pod",
  "date": "2022-02-15T15:31:15.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Z1xzKrxlh23I3YZ-OZdwuaipmeU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70511341/mdoying_180308_1437_0084still.0.jpg\" />        <figcaption>Photo by Michele Doying / The Verge</figcaption>    </figure>  <p id=\"AaCvWs\">Wow, we’re already mid-way through February, and Hot Pod Summit is next week. It’s been a marathon over here, not including my <em>Love Is Blind</em> binge time. Today, we have various stories all connected around the idea of money — making and spending it. Let’s get right to it.</p><p id=\"2RfgAp\"><strong>This week’s Rogan check-in</strong></p><p id=\"WVyq48\">Though Hurricane Rogan has mostly passed over, related stories continue to trickle out. The first comes from <em>The Guardian</em>, <a href=\"https://www.theguardian.com/technology/2022/feb/13/dont-take-the-damn-thing-how-spotify-playlists-push-dangerous-anti-vaccine-tunes\">which reports</a> that multiple Spotify playlists pushed listeners to anti-vaccine music after they had already listened to similar content. The songs “encourage people not to get vaccinated and say those who do are ‘slaves,’ ‘sheep,’ and victims of Satan,” the publication says. “Others call for an uprising, urging listeners to ‘fight for your life.’” </p><p id=\"wyU5lI\">Many songs were easy to find by searching “vaccine” and “mask,” and one user who listened to an anti-vaccine song received a “personalized playlist directing them to even more extreme songs. Of the 50 songs in that playlist, 19 included explicit references to anti-vaccine and COVID misinformation, including claims the vaccine is being used to microchip people.”</p><p id=\"wqXhF7\">The company says it removed this music after <em>The Guardian</em> reached out because the songs promoted “dangerous, false, or deceptive content about COVID-19” that could threaten public health.</p><p id=\"uOMaze\">This story interests me because it again raises the question of how Spotify detected the supposed “over 20,000 podcast episodes” it <a href=\"https://www.nytimes.com/2022/01/26/arts/music/spotify-neil-young-joe-rogan.html\">says</a> it removed over COVID statements. In this case, yes, we’re talking about music, but we could reasonably assume that whatever mass moderation effort is happening in spoken word content could happen for songs, too. We have no idea how Spotify’s moderation works, and the company doesn’t seem interested to share, so for now, its main line of defense appears to be media reports. That’s not great for a company whose ambitions are along the lines of becoming the next YouTube and recruiting tens of millions of podcasters to its platform.</p><p id=\"bNfjgk\">I’ll also just point out that <em>The Guardian</em>’s distinction between an algorithmically generated music playlist and Spotify’s star podcaster being paid to make exclusive content is important. The algorithm promoting songs is potentially what we’re more interested in because software often amplifies and distributes content, and so far, that hasn’t been as much of an issue in the podcast world. (I’m sure that’s a spoiler alert for, like, a year from now.)</p><div class=\"c-float-right\"><aside id=\"Sy220I\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside></div><p id=\"lMIIut\">Next in Rogan land, one of my pals and former podcast co-host Kaitlyn Tiffany wrote <a href=\"https://www.theatlantic.com/technology/archive/2022/02/joe-rogan-podcast-transcripts/622053/\">in <em>The Atlantic</em></a> about the idea of podcasts once existing in relative privacy and conversations now being scrutinized as show archives become a landmine of regrettable and sometimes shocking comments. Don’t get too cozy in front of the mic! </p><p id=\"cXeCVU\">“As the business grows up, and as more reporters or agitators invest the time in poring over all this content, the days of podcasting without consequences will be numbered,” she writes. </p><p id=\"bCl7TW\">She also points out that moderating — or even just listening — to all these podcasts is a full-time job, particularly for reporters. She notes podcasts often lack transcripts, which I, once again, fail to understand. If not for accessibility sake, then make them available for transparency! But something tells me a written record of everything a controversial podcast host has said doesn’t make for good business. Now I’m the one getting conspiratorial.</p><p id=\"dgXeBG\"><strong>Money moves</strong></p><p id=\"KC66oG\">We now enter the money section of the newsletter, starting with Acast’s earnings. <strong>Acast </strong><a href=\"https://investors.acast.com/press-releases/q4-one-billion-listens\"><strong>says</strong></a><strong> it made around $119 million last year and has 40,000 shows on its platform. </strong>It also says it had more than a billion listens across its network last quarter. I don’t have too much to add here other than I’ll continue to watch Acast and am particularly curious how its play for scale goes when it’s competing against SiriusXM, iHeart, and others for ad sales deals, especially now that everyone is trying to sign them consistently and spending lots to do so.</p><p id=\"shO102\">Maybe making ad sales massive won’t be as difficult with more advertisers entering the space, however, which Magellan says is happening in its <a href=\"https://www.magellan.ai/resources/reports/q4-podcast-advertising-benchmark-report\">latest quarterly benchmark report</a>. <strong>The company says podcast ad spend increased 14 percent quarter over quarter while over 2,200 brands ran audio ads for the first time during Q4. </strong>The team also says ad time ticked up slightly during shows, with podcasters dedicating an average of 5.98 percent of their time to them — another trend we’re watching as companies try to recoup their money back from splashy, expensive deals. (Will this be the radio all over again?)</p><p id=\"LicsH2\">One advertiser who doesn’t show up in Magellan’s report but continues to spend in podcasting is Squarespace, which <em>The New York Times</em> profiled ahead of its Super Bowl ad this weekend. Among some of the little tidbits is that <strong>Squarespace </strong><a href=\"https://www.nytimes.com/2022/02/13/business/how-did-squarespace-know-podcasts-would-get-this-big.html\"><strong>paid $100,000</strong></a><strong> to be the sole advertiser on Marc Maron’s Barack Obama interview episode in 2015. </strong>Midroll employees also reportedly met because higher-ups were concerned that Squarespace accounted for one-third of revenue. Dax Shepard is also quoted as saying he thought Squarespace ads helped “legitimize his show,” and he knows the ads by heart. “It’s a party trick.” </p><div class=\"c-float-left\"><div id=\"Injd3i\"><div data-anthem-component=\"aside:10776720\"></div></div></div><p id=\"DVWul7\">The piece touches on the idea that podcast customer conversion rates are higher than web ads or ads on social media, and it says Rogan specifically yields bonkers returns for the company. To bring it full circle, this is why we likely <em>won’t</em> see a YouTube adpocalypse of sorts on Rogan or against Spotify — advertisers know what they get from him, which is lots of new customers.</p><p id=\"bL5Qbi\">Finally, <a href=\"https://news.sky.com/story/amazon-and-spotify-mull-bids-for-london-listed-podcaster-audioboom-12541467\"><strong>Amazon and Spotify are reportedly considering acquiring Audioboom</strong></a>, though these offers could also “fail to materialize,” per <em>Sky News</em>. The company says it made $60.2 million last year, and its shows are downloaded 116 million times every month by 32 million unique listeners. I’m not entirely clear what Spotify or Megaphone would gain from this acquisition, given that both already acquired hosting / monetization services in Megaphone and Art19, respectively, as well as studios to make content. I can see this being worthwhile to them if they want to bulk up their ad inventory quickly, which Spotify might want to do, or to just take a company off the market because they can easily afford to do so. As always, I’m here for your thoughts and feelings!</p><hr class=\"p-entry-hr\" id=\"vCQ3YR\"><p id=\"H4kE4Q\">That’s all for today, folks. I’ll be back Thursday, with Aria here Friday. See ya then!</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QlnOlyB3YSu9UbQNKEIqzqHaJ2g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10432241/mdoying_180308_1437_0084still.jpg",
  "description": "Now we’re talking about music playlists",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}