{
  "title": "Spotify wants to beat YouTube at audio",
  "url": "https://www.theverge.com/2022/2/17/22939137/spotify-google-youtube-podsights-chartable-acquisitions",
  "date": "2022-02-17T17:22:24.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"Spotify Stock\" src=\"https://cdn.vox-cdn.com/thumbor/1qcVLOc5hpYBRDs2S_HPR66zj-c=/0x0:1820x1213/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70521272/acastro_180213_1777_0004.0.jpg\" />        <figcaption>Alex Castro / The Verge</figcaption>    </figure>  <p id=\"8iJ53G\"><em>This story originally ran in Hot Pod, The Verge’s preeminent audio industry newsletter. You can subscribe </em><a href=\"https://hotpodnews.com/subscribe/\"><em>here</em></a><em> for more scoops, analysis, and reporting.</em></p><p id=\"9fAbTW\">Spotify <a href=\"https://newsroom.spotify.com/2022-02-16/spotify-acquires-podsights-and-chartable-to-advance-podcast-measurement-for-advertisers-and-insights-for-publishers/\">announced yesterday</a> its acquisition of Podsights and Chartable, two companies known for tracking pixels that allow marketers, advertisers, and podcasters to measure the success of their shows. This is a big deal, to state the obvious, if for no other reason than if podcasters have avoided Spotify’s podcast world up until now, well, they’re probably going to have to start engaging. Both these platforms are critical to the space to show advertisers that their marketing is being heard and acted upon and that podcast ads are effective and worthy of a budget.  </p><p id=\"yOuaEO\">As for its plans, Spotify says it’ll bring Podsights’ tech to its “audio ads within music, video ads, and display ads.” In both <a href=\"https://podsights.com/blog/spotify-acquires-podsights/\">a post on its website</a> and <a href=\"https://ads.spotify.com/en-US/news-and-insights/spotify-podsights-announcement/\">an interview</a> with Podsights CEO Sean Creely, the team emphasizes that nothing is changing in the immediate future, and Spotify will only enhance its tech. Chartable’s fate seems less clear. Its tech will be integrated into Megaphone, specifically its marketing tech like SmartPromos and SmartLinks. The company’s <a href=\"https://chartable.com/blog/chartable-joins-the-spotify-family\">blog post</a> doesn’t mention what will happen to the full team. </p><p id=\"kobK4u\">I want to note a couple things. One is that this purchase puts Spotify in a powerful position to know exactly how shows perform, even those not hosted on its own platform or consumed on its app, and that’s going to likely present a dilemma for big networks. Do they build their own trackers? Do they trust Spotify to protect their data from Spotify’s own publishing teams as <a href=\"https://podsights.com/blog/spotify-acquires-podsights/\">Podsights says it will</a>? Then there’s the open question of how much Spotify will lock this tech down to its own platform. For what it’s worth — and a pain point I’ve heard from various folks in the industry — Anchor, Spotify’s <em>other</em> hosting and creation platform, has never allowed for tracking pixels. I imagine that might change. </p><div class=\"c-float-right\"><aside id=\"76yB25\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside></div><p id=\"0fNtL0\">Now, in a worst-case scenario, Spotify could require podcasters to host on its platforms in order to attribute ads — not ideal for someone like Amazon, which owns a hosting platform. Spotify spokeswoman Erin Styles tells me Chartable’s tools will only be available to people who have a Megaphone account, but they do not need to be paying customers, so we can see a slight hint of this already. On the flip side, there’s also the possibility Spotify sees opportunity — and money — in catering to advertisers widely, regardless of where listens come from or where shows are hosted. I’m not sure how this pans out!</p><p id=\"VEiWEK\">But I also read this news in a different way: these purchases set Spotify up to better compete with YouTube, specifically YouTube’s analytics. I’m thinking a lot about YouTube lately because we’ll have a panel on it at <a href=\"https://www.theverge.com/2022/2/15/22934828/the-verge-and-on-air-fest-announce-hot-pod-summit-lineup\">Hot Pod Summit</a>, and one thing video publishers enjoy about YouTube — and wish would apply to solely audio on the platform — is AdSense, as well as the comprehensive analytics the platform provides. (There’s an entire <a href=\"https://www.youtube.com/watch?v=J1t34uTT0iA\">5-minute video</a> dedicated to just navigating its analytics dashboard!) These analytics mean someone uploading a video gets broader data about who watched it, including their age and gender, as well as granular info like what exact moments best held the audience’s attention. </p><p id=\"m72aRX\">YouTube, I believe, is Spotify’s primary competitor. We can see this in Spotify’s product priorities — it built <a href=\"https://www.theverge.com/2020/5/6/21249389/spotify-video-podcast-test-upload-content-test-youtube\">video podcasts</a> into its platform, courted YouTube podcasters (i.e., Rogan and others), and launched Anchor in an attempt to bring creators to its app. CEO Daniel Ek <a href=\"https://www.theverge.com/2022/2/2/22914720/spotify-q4-earnings-creators-audio-podcast-joe-rogan\">says</a> the company’s mission is to have 50 million creators on Spotify. To accomplish that goal, it needs not only a way for them to make money (quality, dependable programmatic ads) but also robust analytics, which Podsights and Chartable can help provide.</p><p id=\"9GstxP\">Yesterday, I logged onto Spotify and saw this on my homepage:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hNuumtJwr6zy3lUEFyyzmY3xoAM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23252306/IMG_8101.jpg\">  </figure><p id=\"Krhd12\">Pure video content that, when I click through, shows me a description in which Rowena literally says she makes videos on “personal development and productivity <em>on YouTube</em>.” (Emphasis my own.) The move to sync audio and video together on one app is already happening, and it’s on Spotify, not YouTube.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Fe9uH5epvp0zSrguk_G8TBLrNUE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23252307/IMG_8102.PNG\">  </figure></div><p id=\"TJlNfO\">Now, I’ve wondered in this newsletter what YouTube could do in the podcast space. YouTube already has programmatic ads for anyone who wants them (something Spotify is trying to make happen); YouTube already, without even trying, is a popular place for people to consume podcasts (a space Spotify is trying to dominate); and YouTube already offers robust analytics about who is watching and how (again, an area Spotify wants to own). Critically, YouTube also has loads of data on users’ behavior because of Google essentially being synonymous with everything we do online, like emailing and browsing. It doesn’t have to worry about Apple not allowing cross-app tracking, like Facebook or Spotify might.</p><p id=\"nhTOAm\">YouTube <a href=\"https://www.theverge.com/2021/10/26/22746466/youtube-podcasting-kai-chuk-amazon-project-mic-live-audio-hot-pod\">hired Kai Chuk</a> last year to oversee podcasts on the platform — the first person to take on that role — and also <a href=\"https://www.theverge.com/2021/10/4/22708688/youtube-music-free-background-listening-date\">made background listening free</a> for Canadian YouTube Music users. Both of these could arguably been seen as indicators of Google’s growing interest in the space, though I should caveat and say it doesn’t ensure any meaningful changes will result, in which case, all the better for Spotify. </p><p id=\"GVBXC8\">So yes, this purchase, as always, is about giving Spotify a larger piece of the podcasting world. It wants to be the biggest and best place to buy and distribute audio ads, and this acquisition helps it get there. The question is whether it can become that place before YouTube lets people upload solely audio to its platform and, because of its size, clouds out Spotify’s ambitions.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4RBkpEcbeZBFBM3w6g6bVEtKbUg=/0x131:1820x1084/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19556817/acastro_180213_1777_0004.jpg",
  "description": "Why the company bought Chartable and Podsights",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}