{
  "title": "Spotify’s Featured Curator pilot highlights user-made playlists",
  "url": "https://www.theverge.com/2022/4/4/23010375/spotify-featured-curator-pilot-user-made-playlists",
  "date": "2022-04-04T21:13:33.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/D1kfJw3A5BvqkHensf8diPupvmk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70709836/acastro_180213_1777_0005.0.jpg\" />    </figure>  <p id=\"GMbTs7\"><a href=\"https://newsroom.spotify.com/2022-04-04/three-things-to-know-about-spotifys-featured-curators-pilot/\">Spotify is testing a new feature</a> that brings popular user-created playlists to the app’s homepage. If you’re a part of the test, the recommended playlists will appear in their own Featured Curator carousel. Spotify says it’s piloting the feature in “select markets” but doesn’t specify where exactly it’s rolling it out or on which devices.</p><p id=\"M1mJ2R\">As Spotify notes, the Featured Curators section doesn’t include playlists from just <em>any</em> users; the platform selected curators based on their followings and playlist popularity as well as whether they tell “unique stories through playlists” or create “authentic connections” with listeners.</p><p id=\"2NiUPG\">Something I’ve come to realize as a Spotify user is that sometimes my fellow listeners are <em>a lot</em> better at figuring out which songs mesh well on certain playlists. The algorithms powering Spotify’s Made for You playlists can only go so far when it comes to guessing my varied taste in music, and its in-house playlists are limiting when trying to discover new artists. It’s nice that Spotify is making an effort to highlight users’ creations, rather than tucking them away in search results.</p><p id=\"HA5UHC\">Spotify recently <a href=\"https://newsroom.spotify.com/2022-03-30/discover-and-listen-to-music-with-even-more-friends-and-family-plus-some-of-your-favorite-artists-with-spotifys-newest-blend-update/\">rolled out a new feature, called Blends</a>, which allows you and 10 other friends to create a collaborative playlist that’s personalized to the entire group. After each member joins, Spotify will automatically generate a playlist based on everyone's preference.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MmoVqfGUocooPk0jeKd7hxNrqXs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10224901/acastro_180213_1777_0005.jpg",
  "description": "The test brings user-made playlists to Spotify’s homepage.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}