{
  "title": "Spotify CEO defends Joe Rogan deal in tense company town hall",
  "url": "https://www.theverge.com/2022/2/3/22915456/spotify-ceo-joe-rogan-daniel-ek-town-hall-speech-platform-podcast",
  "date": "2022-02-03T14:11:31.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/q0tRqXjweJvAxW793OLsWBcnQxA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70466430/acastro_220202_1777_spotify_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"2M8BQm\">Spotify CEO Daniel Ek addressed employees about the Joe Rogan controversy in a 15-minute speech yesterday, of which <em>The Verge </em>obtained audio, defending the company’s choice to work with Rogan, explaining its reasoning, and defining why he believes Spotify is a combination of a platform and a publisher. Employees had been skeptically awaiting the discussion at the company’s regular town hall meeting for nearly a week: since things had escalated with Joe Rogan, the company’s star exclusive podcaster, employees had been venting inside the corporate messaging system and awaiting a response from leadership about why it chose <em>The Joe Rogan Experience</em> <a href=\"https://www.theverge.com/2022/1/26/22903354/spotify-joe-rogan-removing-neil-young-music\">over Neil Young</a>, setting off a domino effect of other musicians and podcasters pulling content off the service.</p><p id=\"mPgZvV\">Joining Ek in-person at the company’s new Los Angeles headquarters, dubbed “<a href=\"https://www.latimes.com/entertainment-arts/business/story/2021-12-17/spotify-unveils-podcast-hub-in-downtown-l-a\">Pod City</a>,” were: Dustee Jenkins, Spotify’s head of global communications and public relations; Dawn Ostroff, chief content and advertising business officer; Gustav Söderström, chief R&amp;D officer; and Paul Vogel, CFO.</p><div class=\"c-float-right\"><aside id=\"RvDLVu\"><q>“It all kind of ladders up to, ‘What’s the best for Joe Rogan and Joe Rogan’s audience?’”</q></aside></div><p id=\"001xea\">The event had been a long time coming, given the amount of conversation happening internally. Employees shared last week in an ongoing thread that their friends and family came to them with questions about why Spotify supported a podcaster who continued to spread COVID misinformation and bring on controversial guests, while the broader backlash made them feel embarrassed to work at the company, according to two sources.</p><p id=\"wDnEbI\">“Everyone’s a little upset, especially the people whose initiatives directly contradict what’s happening,” says one current employee who asked to remain anonymous so as to not compromise their job. “People are feeling increasingly frustrated that no matter what the company says messaging-wise, or no matter what people’s initiatives are, it all kind of ladders up to, ‘What’s the best for Joe Rogan and Joe Rogan’s audience?’”</p><p id=\"Kz3rPU\">This person notes that people working on trying to highlight other podcasting talent or showcase diverse creators for Black History Month have seen their initiatives sidelined while Rogan captured the company‘s attention.</p><p id=\"pGbVHm\">The only message employees had received from leadership was on Friday, two days after Young pulled his music over misinformation he says Rogan spread, as well as an entire media cycle, complete with speculation about who might follow in his wake. In that message, which<a href=\"https://www.theverge.com/2022/1/28/22907069/spotify-joe-rogan-neil-young-covid-19-moderation-policies\"> <em>The Verge</em> viewed</a>, Jenkins shared the company’s moderation policies and said it didn’t move fast enough to make them public.</p><div class=\"c-float-left\"><div id=\"p1qlfS\"><div data-anthem-component=\"aside:1522405\"></div></div></div><p id=\"kAE1Ti\">So when it came time for the town hall, employees hoped they might come away with more clarity or understanding of the situation. Ek instead offered an impassioned pitch for why Rogan is critical to Spotify’s well-being. Despite Rogan’s show never being available on Spotify prior to its deal, the program was the most searched podcast on the platform, he says, and when the company decided to enter the podcasting industry, its catalog was “not that differentiated’’ from competitors. It had been struggling to make deals with “critical hardware partners like Amazon, Google, and even Tesla,” given that they were building “similar streaming services with essentially the same content.”</p><p id=\"DQTHPN\">“To combat this, we needed to find leverage, and one way we could do this was in the form of exclusives,” he says. “To be frank, had we not made some of the choices we did, I am confident that our business wouldn’t be where it is today.” He says the company now operates the number one podcast app in the US.</p><p id=\"K1fqLW\">Ek reframed the conversation, both in his speech and <a href=\"https://newsroom.spotify.com/2022-01-30/spotifys-platform-rules-and-approach-to-covid-19/\">external press release</a> on Sunday, around the idea that Spotify is a platform — pure distribution technology for various audio creators to use without input from Spotify on what they share. He explained why he doesn’t consider Spotify a publisher of <em>JRE</em>, meaning it would assume editorial responsibility for what Rogan and his guests say. “I understand the premise that because we have an exclusive deal with him, it’s really easy to conclude we endorse every word he says and believe the opinions expressed by his guests. That’s absolutely not the case,“ he said. Spotify doesn’t “fit neatly into just one category,” Ek says. “We’re defining an entirely new space of tech and media. We’re a very different kind of company, and the rules of the road are being written as we innovate.”</p><div class=\"c-float-right\"><aside id=\"vDohOH\"><q>Ek believes Spotify will need to host content “many of us may not be proud to be associated with”</q></aside></div><p id=\"xkFrGc\">“A publisher has editorial control over a creator’s content — they can take action on the content before it’s even published,” he says, like editing episodes, removing guests, or preventing one from publishing at all. Ek noted that Spotify does have editorial control over the properties it owns outright, like The Ringer and Gimlet, but emphasized the distinction between those studios and Rogan. “Even though <em>JRE</em> is an exclusive, it is licensed content. It is important to note that we do not have creative control over Joe Rogan’s content. We don’t approve his guests in advance, and just like any other creator, we get his content when he publishes, and then we review it, and if it violates our policies, we take the appropriate enforcement actions.”</p><p id=\"vuLmyh\">Notably, Ek did not defend Rogan’s views. “There are many things that Joe Rogan says that I strongly disagree with and find very offensive,” he said.</p><p id=\"LpQQkX\">He adds that there are a “number” of <em>JRE </em>episodes Spotify has removed because they violate the platform’s rules. (It’s unclear what episodes Ek is referencing, but fans <a href=\"https://www.reddit.com/r/JoeRogan/comments/ikf9at/full_list_of_every_missing_episode_from_spotify/\">noticed some missing</a> when Rogan made the move to the platform in September 2020, and Rogan <a href=\"https://www.digitalmusicnews.com/2021/03/30/spotify-joe-rogan-episodes-removed/\">acknowledged</a> their removal last March.) </p><p id=\"FxESzb\">During a question-and-answer session, employees pushed back on Ek’s position. They questioned whether the platform rules are stringent enough, if the company’s latest actions did enough to address the scientific community’s concerns, and how employees’ work to advance diversity within the company can reckon with some Rogan comments, like his <a href=\"https://www.thedailybeast.com/joe-rogan-says-its-very-strange-to-call-people-black-unless-theyre-from-darkest-place-of-africa\">questioning of Black identity</a>. Ek responded with the same messaging he employed earlier but added that “exclusivity does not equal endorsement” and said the solution to this problem might be signing more exclusives: “The real thing here is to try to go for an even broader set of exclusives that represent even more voices.”</p><div class=\"c-float-left\"><aside id=\"mSMz6R\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside></div><p id=\"ycgOdG\">“If we want even a shot at achieving our bold ambitions, it will mean having content on Spotify that many of us may not be proud to be associated with,” he says. “Not anything goes, but there will be opinions, ideas, and beliefs that we disagree with strongly and even makes us angry or sad.”</p><p id=\"CCV2f9\">For some employees, though, Ek and the team’s sentiments rang hollow. Throughout the town hall, they messaged internally, according to screenshots viewed by <em>The Verge</em>, expressing disappointment with the choice Spotify made in not only signing Rogan but also in defending him. They questioned how the company considers itself a platform while still actively promoting <em>JRE</em> and including its logo on the cover art and how what some consider an ethical issue is being put in pure business terms.</p><p id=\"vvkBMU\">Ek stuck with the message, though, ending his speech with a word of encouragement to employees: consider the company mission.</p><p id=\"Tr9Mjx\">“So I think ultimately, this really comes down to two things. First, do we believe in our mission: 50 million creators and 1 billion users? And finally, are we willing to consistently enforce our policies on even the loudest and most popular voices on the platform? And I’m telling you, I believe both.”</p><p id=\"wV2Khz\">We’ve reached out to Spotify for additional comment.</p><p id=\"2VtItk\"><strong>You can read a full transcript of CEO Daniel Ek’s speech below:</strong></p><div><div id=\"dvuZMR\"><div data-anthem-component=\"aside:11010611\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/piy4UaQSVeNWUvCO34_InDvmpHc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215198/acastro_220202_1777_spotify_0001.jpg",
  "description": "\"Exclusivity does not equal endorsement.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}