{
  "title": "Spotify might soon bypass Android billing, but Google’s still getting paid",
  "url": "https://www.theverge.com/22993765/google-spotify-android-user-choice-billing",
  "date": "2022-03-24T20:08:19.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BTR-BLUcI46AFYsRwxhKyS-B38g=/135x0:1125x660/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70668226/Screen_Shot_2019_07_08_at_5.30.40_PM.0.png\" />        <figcaption>Spotify</figcaption>    </figure>  <p id=\"0F2KOH\">For years, a loose coalition of companies, including Spotify and Epic Games, has been railing against the so-called app store tax — taking Apple and Google to court and spurring regulators to investigate their up-to-30 percent cut of developers’ app revenue. They argue they’re locked into grossly overpriced billing, hosting, and curation services that <a href=\"https://www.theverge.com/2021/5/6/22423567/apple-epic-app-store-policies-fortnite-trial-day-4\">sometimes hurt more than they help</a>.</p><p id=\"lv32mi\">So it was a surprise when, on Wednesday, Google <a href=\"https://www.theverge.com/2022/3/23/22993417/google-pilot-test-android-alternate-billing-systems-spotify\">revealed a pilot program with Spotify</a> that will let some developers bypass Google Play billing on Android — letting Spotify and potentially others use their own payment platforms instead. But if you think that means Google’s going to give up its piece of the action, think again. Reading between the lines, it’s clear that Google is still getting its cash. </p><p id=\"w20uv9\">Here’s <a href=\"https://www.bloomberg.com/news/articles/2022-03-23/google-opens-its-app-store-billing-starting-with-spotify?sref=ExbtjcSG\">how <em>Bloomberg</em> put it</a>:</p><blockquote><p id=\"Fs5L6s\">If a user chooses to pay Spotify directly instead of using Google’s billing system, Spotify won’t have to give Google its entire 15% fee, according to a person familiar with the matter. A Google spokesperson said the company hasn’t sorted out the financial terms yet.</p></blockquote><p id=\"gYwPvD\">And <a href=\"https://techcrunch.com/2022/03/23/google-play-to-pilot-third-party-billing-option-globally-starting-with-spotify/\">here’s <em>TechCrunch</em></a>:</p><blockquote><p id=\"vJBpfM\">Reached for comment, Spotify declined to say what sort of commission it would be paying Google as a part of this pilot test, noting that the agreement was confidential. But a company spokesperson suggested that the commercial terms met Spotify’s “standards of fairness.”</p><p id=\"HSelIZ\">Google also declined to detail the commission structure involved. However, it noted that user choice billing, such as is the case in South Korea, will still involve a service fee regardless of which billing system the user chooses.</p></blockquote><p id=\"IYBJTh\">There will still be a fee. There will still be a commission. As Google’s “first partner,” Spotify just got to negotiate a new deal for itself. We just don’t know how much it is — only that Spotify seems happier today than <a href=\"https://www.theverge.com/2021/10/21/22738370/google-play-cut-music-streaming-apps-10-percent-regulation\">when Google announced</a> that “on-demand music streaming services” will be “eligible” for a fee “as low as 10%.” </p><p id=\"LOPdgI\">And we know that Google and Spotify are being cagey about it. Google spokesperson Dan Jackson would not confirm Google’s comments to <em>Bloomberg</em> and <em>TechCrunch</em> on the record. Spotify spokesperson Taylor Griffin wouldn’t go on the record either. </p><p id=\"wbEmwI\">I suspect a lot of app developers are wondering why Google is launching a limited pilot program<em> at all,</em> letting big companies like Spotify get dibs and get to negotiate favorable backroom deals. Why not open up the Play Store to alternative payment processors, period, and let the market set the price?</p><aside id=\"rKrb54\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Sweetheart deals and plastic knives: all the best emails from the Apple vs. Epic trial\",\"url\":\"https://www.theverge.com/c/22611236/epic-v-apple-emails-project-liberty-app-store-schiller-sweeney-cook-jobs\"}]}'></div></aside><p id=\"JH4Mha\">Sweetheart deals were already a thing on these app stores. <a href=\"https://www.theverge.com/c/22611236/epic-v-apple-emails-project-liberty-app-store-schiller-sweeney-cook-jobs\">The Epic v. Apple trial revealed, for instance</a>, that Netflix had a “unique arrangement” to share only 15 percent of its revenue on iOS back when the going rate was 30. <a href=\"https://embed.documentcloud.org/documents/21044017-2021-january-microsoft-revshare-many-exceptions-for-media-streaming-88-12-for-all-games-streaming-rights/#document/p10\">Microsoft gave loads of its top app partners a “store policy exception”</a> that let them pay differently, too. That’s not sending the message that indie developers actually get a fair shake in these marketplaces.</p><p id=\"1iiX2r\">I’m also curious what it means for that loose coalition of companies fighting the app store tax — organized as <a href=\"https://www.theverge.com/2020/9/24/21453745/spotify-epic-tile-match-coalition-for-app-fairness-apple-app-store-policies-protest\">the Coalition for App Fairness</a> — now that prominent member Spotify has negotiated this deal for itself. The CAF has been completely silent on Google and Spotify’s announcement in public and replied to us today with a generic statement about how “CAF is committed to fighting for systemic change.” (It also reportedly <a href=\"https://9to5mac.com/2022/03/22/coalition-for-app-fairness-loses-ed/\">lost its executive director</a> earlier this week.) Epic Games, another founding member of the CAF, would also not speak to us on the record.</p><p id=\"3wgBx3\">The CAF <a href=\"https://appfairness.org/issues/broken-marketplace/\">has argued that</a> a 5 percent fee is the “upper limit for fees charged by other payment providers for purchases” — so if developers wind up paying more than 5 percent to use their own payment processors via Google, it would be hard for it to call Google’s move a victory. </p><p id=\"2q99qB\">But if it’s under 5 percent and available to all, it could be a different story. We’ll have to wait and see. </p><p id=\"fvDpX8\">“While this is a good deal for Spotify, it does nothing to help the millions of small businesses and entrepreneurs that are crushed by exorbitant app store fees,” reads part of a statement from House Antitrust chairman David Cicilline, <a href=\"https://www.bloomberg.com/news/articles/2022-03-24/google-s-app-billing-concession-isn-t-moving-needle-in-congress?sref=ExbtjcSG\">via <em>Bloomberg</em>.</a> “Self-regulation is not a solution.” Cicilline is one of many sponsors of <a href=\"https://www.theverge.com/22914479/open-app-markets-act-legislation-senate-committee-markup-explained\">the Open App Markets Act</a>, legislation designed to curb anticompetitive behavior in the iOS and Android app stores.</p><aside id=\"P71UTm\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Everything you need to know about the bill that could blow up the app store\",\"url\":\"https://www.theverge.com/22914479/open-app-markets-act-legislation-senate-committee-markup-explained\"}]}'></div></aside><p id=\"Xy4go8\"><em><strong>Update, 4:19PM ET: </strong></em><em>Added statement from Cicilline.</em></p><p id=\"Thdfr5\"></p><p id=\"e4o7g1\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9KbprXpCXIR0a8VvP5_bpI3jKg4=/0x0:1260x660/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18296764/Screen_Shot_2019_07_08_at_5.30.40_PM.png",
  "description": "The app store tax isn’t going away.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}