{
  "title": "Spotify is ‘blending’ your playlists with K-pop stars",
  "url": "https://www.theverge.com/2022/5/20/23132473/spotify-kpop-blend-playlists",
  "date": "2022-05-20T17:46:38.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1RbyrRTZFdP1pWUbxWzgyVUYfCY=/170x0:1270x733/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70892941/K_Pop_Blend_FTR_Post_Header_1440x733.0.png\" />        <figcaption>Image: Spotify</figcaption>    </figure>  <p id=\"VjBhmX\">After introducing its <a href=\"https://newsroom.spotify.com/2021-08-31/how-spotifys-newest-personalized-experience-blend-creates-a-playlist-for-you-and-your-bestie/\">Blend playlists</a> last year, Spotify announced Friday that it’s expanding the feature to <a href=\"https://newsroom.spotify.com/2022-05-20/k-pop-fans-can-now-blend-with-some-of-their-favorite-groups-on-spotify/\">include K-pop artists</a> — and yes, that includes the mega-popular boyband BTS.</p><p id=\"Dt5ZM2\">Spotify’s Blend playlists are an easy way for users to create shared playlists based on each user’s listening preferences. In March, the company <a href=\"https://newsroom.spotify.com/2022-03-30/discover-and-listen-to-music-with-even-more-friends-and-family-plus-some-of-your-favorite-artists-with-spotifys-newest-blend-update/\">released updates</a> for the music discovery feature that include the ability to “blend” with up to 10 people or with musical artists. This new K-pop expansion is an example of the latter.</p><p id=\"oQzam4\">The K-pop Blend artists include BTS, Stray Kids, ENHYPEN, TOMORROW X TOGETHER, Nmixx, and AB6IX. The feature will mix your favorite tracks with those of the aforementioned bands. Of course, it wouldn’t be a Spotify feature if it didn’t include some data, either. After blending playlists, you can receive a “share card” that displays “taste-match” scores identifying which songs you have in common. The cards can then be shared on Instagram, Facebook, Snapchat, or Twitter.</p><p id=\"Gys9YK\">Part of the reason K-pop has become a global phenomenon in recent years is the fact that the bands are incredibly active online. Idols are encouraged to interact with fans on various social media platforms, which, in turn, <a href=\"https://www.theverge.com/22589460/kpop-fan-cafe-weverse-universe-lysn-bts-idol-fandom-group\">encourages parasocial relationships</a> with fans. Spotify’s Blend feature slots nicely into that dynamic, as it creates the sense that you know something about a particular group or idol. </p><p id=\"zYG0Gj\">Whether the playlists Spotify generates are on point is another matter entirely. My BTS Blend playlist seems to suggest BTS and I would like to listen to a lot of Post Malone... and I’m good. </p><p id=\"l1gVvA\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-nPKaPm1A0zWXhMnsCOzTYM_Vso=/20x0:1420x733/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23577414/K_Pop_Blend_FTR_Post_Header_1440x733.png",
  "description": "Music streaming services can’t get enough.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}