{
  "title": "Spotify’s Car Thing goes on general sale for $90",
  "url": "https://www.theverge.com/2022/2/22/22945403/spotify-car-thing-price-release-date",
  "date": "2022-02-22T13:30:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5CnuUWWzFNPY3nbX1SRxkRBKcNg=/0x1:815x544/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70536071/Car_Thing_Image_3.0.jpg\" />        <figcaption><em>Car Thing being used alongside a car’s infotainment system.</em> | Image: Spotify</figcaption>    </figure>  <p id=\"7NTRDT\">Spotify’s Car Thing, the dashboard accessory that controls Spotify on your phone, is now widely available to buy in the US, the <a href=\"https://newsroom.spotify.com/2022-02-22/car-thing-from-spotify-is-now-officially-available-in-the-u-s/\">company announced today</a>. The accessory was first made available free of charge <a href=\"https://www.theverge.com/2021/4/13/22380014/spotify-car-thing-release-voice-control-data-interactive-ads\">as part of an invite-only limited release last April</a>, and <a href=\"https://www.theverge.com/2021/10/14/22726497/spotify-car-thing-hardware-waitlist\">in October, Spotify opened up a waitlist</a> for people to get their hands on the device. Now, Car Thing is going on general sale for $89.99 — a $10 increase over the advertised price in October.</p><p id=\"SGZ6A7\">Car Thing is designed to offer a more convenient way to control Spotify while driving. It doesn’t have a speaker, and it doesn’t have its own data connection, so it’s essentially a Spotify remote that can output to your car’s speakers. It offers a combination of physical controls, a touchscreen, and voice controls via Spotify’s own “Hey Spotify” assistant, and it requires both a Spotify Premium subscription and a phone with a data connection to function.</p><p id=\"tnLUlL\">As well as confirming a general launch for the device, Spotify says it’s working to bring a night mode and a new “add to queue” voice command to the device with future updates. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WUezr2V-VdwO6_Ew3EgVw_O8QsA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262333/What_s_Inside_Image.jpg\">      <cite>Image: Spotify</cite>      <figcaption><em>Mounting and charging hardware is included in the box.</em></figcaption>  </figure><p id=\"S1YlCS\">$89.99 gets you the Car Thing itself, as well as mounting hardware and a charging cable to plug it into your car’s USB socket (if it has one) or an included 12V adapter. The device doesn’t have a rechargeable battery, so it needs to be plugged in constantly for power. The Car Thing connects to a phone via Bluetooth, and then you can either run an auxiliary cable between the Car Thing and your vehicle or have your phone connected to your car via Bluetooth.</p><p id=\"UNr5AV\">In its testing, Spotify says it found people with Car Thing listened to the service more while in their cars and that it made the process easier for them. But when my colleague Ashley Carman <a href=\"https://www.theverge.com/2021/4/13/22380014/spotify-car-thing-release-voice-control-data-interactive-ads\">tried the device out last year</a>, she found it wasn’t a great deal better than her existing solution of having her phone mounted to her dashboard.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_j_H0nwwJPv4rWEK_J05eDZmVPg=/0x63:815x490/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262334/Car_Thing_Image_3.jpg",
  "description": "You’ll need a Premium subscription to use it.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}