{
  "title": "Spotify is more confused about Joe Rogan than ever",
  "url": "https://www.theverge.com/2022/2/7/22921608/spotify-joe-rogan-moderation-guidelines-episode-deletion",
  "date": "2022-02-07T19:13:59.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"UFC 249 Spann v Alvey\" src=\"https://cdn.vox-cdn.com/thumbor/QALN_J55buz6ZAmD1Dsp7_xR1dk=/0x0:5172x3448/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70480731/1223897013.0.jpg\" />        <figcaption>Photo by Douglas P. DeFelice/Getty Images</figcaption>    </figure>  <p id=\"cozt7i\">The Joe Rogan situation at Spotify keeps getting more confused. </p><p id=\"xTUZNm\">As the situation has evolved, so has the company’s treatment of its star podcaster. One day, it says it’s a hands-off platform that treats all creators the same. The next, it admits to having backdoor discussions with Rogan and pulling episodes due to outrage over language used on the show. The whiplash undermines Spotify’s narrative about how it interacts with Rogan and other podcasters and offers a window into the delicate relationship between Rogan and the company that depends on him to stay differentiated. Let’s dive into where things aren’t lining up.</p><p id=\"zZpHAy\">Spotify has reiterated multiple times now that it considers itself merely a platform for podcasts — despite paying Rogan a reported $100 million to distribute his show. That Spotify wants to believe Rogan is an audio creator like any other has been a constant refrain since Neil Young and other musicians pulled their music from the platform nearly two weeks ago over their belief that Rogan and his guests spread COVID-19 misinformation.</p><p id=\"7gyC71\">Spotify responded to that controversy by saying that it would only take moderation actions against content that violated its rules — rules that were not public until <a href=\"https://www.theverge.com/2022/1/28/22907069/spotify-joe-rogan-neil-young-covid-19-moderation-policies\"><em>The Verge</em> first reported on them</a>, and then which Spotify itself <a href=\"https://newsroom.spotify.com/2022-01-30/spotifys-platform-rules-and-approach-to-covid-19/\">published</a> days later.</p><p id=\"il2VvY\">That Spotify was paying $100 million to exclusively distribute <em>The Joe Rogan Experience</em> should not change anything, according to CEO Daniel Ek, who directly addressed that relationship in an internal town hall last week:</p><p id=\"CM0hp7\">“Even though <em>JRE</em> is an exclusive, it is licensed content,” Ek said in remarks <a href=\"https://www.theverge.com/2022/2/3/22915456/spotify-ceo-joe-rogan-daniel-ek-town-hall-speech-platform-podcast\">obtained by <em>The Verge</em>.</a> “It is important to note that we do not have creative control over Joe Rogan’s content. We don’t approve his guests in advance, and just like any other creator, we get his content when he publishes, and then we review it, and if it violates our policies, we take the appropriate enforcement actions.”</p><p id=\"MFPqmI\">Ek was also clear that Rogan was critical to the company’s success, telling employees that the Spotify catalog wasn’t differentiated from rivals and that signing exclusives like Rogan gave the company leverage in negotiations with Amazon, Google, and Tesla. Signing Rogan helped turn Spotify into the number one podcasting app in the US, he noted.</p><div class=\"c-float-right\"><aside id=\"uR8cjq\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside></div><p id=\"VVHRTP\">At this point, Spotify’s position seemed to be clear: Rogan was critically important to Spotify’s success, and he would be allowed to say whatever he wanted, so long as it fit within the bounds of Spotify’s moderation rules. Dustee Jenkins, Spotify’s head of global communications and public relations, affirmed to Spotify employees that Rogan would be treated like any other creator under those rules: “We apply our policies consistently and objectively,” she wrote in a note to staff seen by <em>The Verge</em>.</p><p id=\"fJ3Ffu\">On the company’s February 3rd earnings call, Ek was clear that the rules were the rules and Spotify would not “change our policies based on one creator nor do we change it based on any media cycle or calls from anyone else.”</p><p id=\"Qng42o\">Then the next Joe Rogan media cycle arrived.</p><p id=\"J4INy0\">Musician India Arie <a href=\"https://www.instagram.com/p/CZah4f1OLIJ/\">pulled her music</a> from the platform last week over Rogan’s repeated use of the n-word and shared a viral video montage of Rogan using the racial slur on his podcast — a montage that had originally been made in January of 2020. In stark contrast to how it handled Young and Joni Mitchell protesting COVID misinformation, Spotify quickly stepped in.</p><p id=\"uSyoga\">Spotify’s <a href=\"https://newsroom.spotify.com/2022-01-30/spotify-platform-rules/\">public content rules</a> don’t appear to prohibit the use of the n-word. Here’s the most relevant section on what’s prohibited:</p><blockquote><p id=\"4MmjSw\">“Content that incites violence or hatred towards a person or group of people based on race, religion, gender identity or expression, sex, ethnicity, nationality, sexual orientation, veteran status, age, disability or other characteristics associated with systemic discrimination or marginalization includes, but may not be limited to:</p><p id=\"LXDoyv\">praising, supporting, or calling for violence against a person or group of people based on the characteristics listed above</p><p id=\"l7kYOc\">dehumanizing statements about a person or group based on the protected characteristics listed above</p><p id=\"iHIdnH\">promoting or glorifying hate groups and their associated images, and/or symbols”</p></blockquote><p id=\"8PX4nT\">Rogan’s use of the n-word does not appear to fall into any of these categories. Based on Spotify’s own statements about how it applies its rules, the episodes using that language should stay live, as they have been for over a year. And they certainly shouldn’t come down because of a “media cycle.”</p><p id=\"kezxJ6\">But on Friday, episodes<a href=\"https://www.theverge.com/22918697/joe-rogan-experience-podcast-episodes-disappear-controversy\"> of <em>JRE </em>began to disappear</a>, joining prior removed episodes. Spotify has now removed more than 100 episodes, according to <a href=\"http://jremissing.com/\">JREMissing.com</a>.</p><p id=\"7Prcz1\">This happened after Ek and the team discussed removing episodes with Rogan, according to <a href=\"https://www.theverge.com/2022/2/6/22921203/spotify-joe-rogan-episode-removal-internal-memo\">an internal memo</a> viewed by <em>The Verge</em>. In it, Ek states again that he believes Spotify is a neutral platform, even as he engages in content-shaping behavior.</p><p id=\"ApYcOE\">Ek says Spotify staffers spoke with Rogan about “some of the content in his show, including his history of using some racially insensitive language” and following these chats “and his own reflections,” Ek says Rogan “chose to remove a number of episodes from Spotify.”</p><p id=\"5RtPJ6\">So: after a PR crisis, Spotify reached out to Rogan and got him to agree to remove episodes of his show from the platform. Ek’s memo also says the company will now dedicate $100 million to licensing and marketing content made by creators from historically marginalized communities — a move the company has not actually announced officially but clearly wants credit for.</p><p id=\"TiqmN6\">At the same time, former guests on Rogan’s show are upset, pointing to Spotify as an example of broader conspiracy theories around government censorship, cancel culture, and more. <a href=\"https://twitter.com/michaelmalice/status/1489738086720356352?s=20&amp;t=ZFteJVk0UUTv3txG6Tn6hQ\">Michael Malice</a> and<a href=\"https://twitter.com/kylekulinski/status/1490525559574695936?s=21\"> Kyle Kulinski</a> have since tweeted, as has <a href=\"https://twitter.com/TimJDillon/status/1490055351064043523?s=20&amp;t=4P5YCDaHXtqyxtn8WaUHbA\">Tim Dillon</a>, <a href=\"https://twitter.com/WhitneyCummings/status/1490312297117589504?s=20&amp;t=PRRxqIM_YEu0OGhi1AbX8g\">Whitney Cummings</a>, <a href=\"https://twitter.com/lexfridman/status/1490088366783844352\">Lex Fridman</a>, and others.</p><p id=\"LzvtYl\">Spotify wants it every way: to be considered a mere platform when it comes to COVID misinformation but to get the credit for being an engaged and responsible participant when it comes to racist language. The result is confused actions, confused messaging, and confused creators.</p><p id=\"mP47to\">Spotify employees, if you have any clarity on what’s happening behind the scenes or thoughts to share, I’m at <a href=\"mailto:ashley.carman@theverge.com\">ashley.carman@theverge.com</a> and <a href=\"https://twitter.com/ashleyrcarman\">on Twitter</a>, where you can DM for my Signal.</p><p id=\"B05v5C\">The company did not respond to a request for comment. </p><hr class=\"p-entry-hr\" id=\"0m8kzg\"><h2 id=\"2Zqk0e\">Related:</h2><div id=\"bJDYYh\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Why Spotify bought Joe Rogan’s podcast|76039\" data-volume-uuid=\"59ce4c7f8\" data-volume-id=\"76039\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-248\" class=\"volume-video\"></div></div><p id=\"X5n8af\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/veow5DUsYiw4jWqumSgxJaUMM4k=/0x0:5172x2708/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23223996/1223897013.jpg",
  "description": "Hands-off around COVID misinformation, but hands-on around racial slurs",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}