{
  "title": "Square Enix showed off lots of new games and none of them were Final Fantasy XVI",
  "url": "https://www.theverge.com/2022/3/9/22969466/final-fantasy-square-enix-sony-march-2022-state-of-play",
  "date": "2022-03-09T23:45:25.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/8JepPA7GvZZKEKNqc7-sl2BuTWI=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70601851/ffxvi.0.jpg\" />    </figure>  <p id=\"XvZWwh\">During Sony’s March State of Play presentation, Square Enix debuted two new games, showed off gameplay trailers for two more, and completely ignored the two games most people were looking forward to. </p><p id=\"NmFigb\">Ahead of its release on March 15th, <em>Stranger of Paradise Final Fantasy Origin</em> is getting its third and final demo. The unfathomably long-titled game (that has been shortened to an equally unwieldy <em>SOPFFO</em>) is an action RPG created in collaboration with <em>Nioh</em> developer Team Ninja. <em>SOPFFO</em> is a <a href=\"https://www.theverge.com/2022/1/24/22898351/stranger-of-paradise-final-fantasy-origin-developer-interview\">darker, bloodier re-imagining of the first <em>Final Fantasy</em> game</a> from the perspective of the villain, Garland. The game’s grimdark, <a href=\"https://www.theverge.com/2021/10/4/22709720/stranger-of-paradise-final-fantasy-origin-demo-playstation-square-enix\">Chaos-obsessed protagonist</a> and its use of <a href=\"https://youtu.be/N0WvpMw0Sko\">Frank Sinatra’s 1969 hit “My Way<em>”</em></a> has endeared <em>SOPFFO</em> to <em>Final Fantasy</em> diehards eager to what other weirdness the game contains. During the State of Play presentation, Square Enix revealed glimpses of new jobs Garland can learn and announced the new demo which is available now. </p><p id=\"md6sBk\">Square Enix also showed off new gameplay from <em>Forspoken</em>, the isekai RPG developed by Luminous Productions. In the gameplay trailer, Frey squares off against numerous baddies using her talking power bracelet and some souped-up sneakers that give her a cool parkour-like double jump. <em>Forspoken</em> was delayed by five months from its May 23rd release date citing the need to “<a href=\"https://twitter.com/Forspoken/status/1500863854359846913\">focus all our efforts on polishing the game</a>.” It launches on October 11th.</p><div id=\"PUYBuE\"><div ><iframe src=\"https://www.youtube.com/embed/a_Jnap7qQK8?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"92cf1X\">Hot on the heels of <a href=\"https://www.theverge.com/2022/3/4/22960053/triangle-strategy-nintendo-switch-interview\"><em>Triangle Strategy</em></a>, Square Enix premiered another high fantasy three warring nations tactics RPG <em>The DioField Chronicle</em>. Billed as <a href=\"https://blog.playstation.com/2022/03/09/the-diofield-chronicle-announced-for-ps5-and-ps4/\">a real-time tactical battle strategy game</a>, <em>The DioField Chronicle</em> boasts character designers from <em>Final Fantasy XII </em>and <em>XIII </em>and sound design from <em>Game of Thrones</em> composer Ramin Djawadi. Though no specific release date was announced, <em>The DioField Chronicle</em> is slated for release later this year.</p><div id=\"q3Zm80\"><div ><iframe src=\"https://www.youtube.com/embed/Ve_JJ5uH72A?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"xJAsVE\">Sony ended its presentation with one more new game from Square Enix — <em>Valkyrie Elysium</em>. It’s the newest entry in the <em>Valkyrie</em> series that debuted on PlayStation 22 years ago with <em>Valkyrie Profile</em>. It’s an action-RPG that takes place in a fantasy world where Ragnarok looms. Like <em>The DioField Chronicle</em>, Valkyrie Elysium is also scheduled for a release in 2022.</p><p id=\"MYwJte\">Surprisingly (or perhaps not so surprisingly) the Square Enix portion of this State of Play, with a stated focus on Japanese-developed games, <em>did not</em> feature any news on <em>Final Fantasy VII Remake 2</em> or <em>Final Fantasy XVI</em> — the two most anticipated games from the developer. Square Enix did just release <em>FFVIIR</em>’s side-story DLC <a href=\"https://www.theverge.com/2021/2/25/22274549/final-fantasy-7-remake-intergrade-ps5-update-graphics-expansion\"><em>Intergrade</em></a> in June of last year so maybe it needs more breathing room before it drops any news on the remake’s second entry. But the <em>Final Fantasy</em> developers did say more news on <em>XVI</em> would be forthcoming <a href=\"https://twitter.com/finalfantasyxvi/status/1475335618905669635?s=20&amp;t=RxJOJ76ToCPLHxs9-vfOTw\">in Spring 2022</a>, which is technically now-ish.</p><p id=\"dh8x2p\">Spring doesn’t officially start for another 11 days in the northern hemisphere so we may have to wait until then. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jZPktOsrfS5f4g6QPFvBl1CyBWs=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23302485/ffxvi.jpg",
  "description": "How long are you gonna make us wait, Square Enix?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}