{
  "title": "Square Enix is selling Tomb Raider, Deus Ex, and its Western studios",
  "url": "https://www.theverge.com/2022/5/2/23053107/square-enix-tomb-raider-deus-ex-studio-sale-embracer-group",
  "date": "2022-05-02T13:17:47.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/v0qpMb1uiknbFE-Vmc36WmRzStE=/94x0:1107x675/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70821818/SOTTR_Preview5.0.jpg\" />        <figcaption><em>Shadow of the Tomb Raider.</em></figcaption>    </figure>  <p id=\"fWdtXc\">Square Enix is selling off its three major Western game studios along with the associated video game properties — which includes big names like <em>Tomb Raider</em>, <em>Deus Ex</em>, and <em>Thief</em>. The studios and properties are set to be <a href=\"https://embracer.com/release/embracer-group-enters-into-an-agreement-to-acquire-eidos-crystal-dynamics-and-square-enix-montreal-amongst-other-assets/\">acquired by Embracer Group</a> for an estimated $300 million; following regulatory approvals, the acquisition is set to be finalized between July and September of this year.</p><p id=\"HqJ14P\">In total, Embracer is acquiring Crystal Dynamics, Eidos-Montreal, and Square Enix Montreal, which amounts to “1,100 employees across three studios and eight global locations.” In terms of game properties, the company will be the steward of brands including <em>Tomb Raider, Deus Ex, Thief</em>, and<em> Legacy of Kain</em>, “along with continued sales and operations of the studios’ more than 50 back-catalogue games,” according to Embracer. Among other games already in development, <a href=\"https://www.theverge.com/2022/4/5/23011603/tomb-raider-new-crystal-dynamics-unreal-engine-5\">Crystal Dynamics recently announced that it’s working on a new <em>Tomb Raider</em> title</a>.</p><div class=\"c-float-right\"><aside id=\"gouJ1b\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Big video game companies just can’t stop buying studios\",\"url\":\"https://www.theverge.com/2022/1/31/22911408/sony-bungie-deal-zynga-microsoft-blizzard-gaming-acquisition\"}]}'></div></aside></div><p id=\"jXb9AY\">Embracer is a quietly huge publishing group, which operates more than 100 studios including the likes of <em>Borderlands</em> developer Gearbox, Saber Interactive, and THQ Nordic. It also owns comics and entertainment brand Dark Horse. Embracer says that, when the deal with Square Enix closes, it will have a total of 124 internal studios and 14,000 employees.</p><p id=\"LmR6XQ\">”We are thrilled to welcome these studios into the Embracer Group,” co-founder and CEO Lars Wingefors said in a statement. “We recognize the fantastic IP, world class creative talent, and track record of excellence that have been demonstrated time and again over the past decades. It has been a great pleasure meeting the leadership teams and discussing future plans for how they can realize their ambitions and become a great part of Embracer.”</p><p id=\"FArbuq\">Square Enix originally began its move into Western game development in 2009 with its acquisition of Eidos Interactive, during which time it oversaw new <em>Hitman</em>, <em>Tomb Raider</em>, and <em>Deus Ex</em> releases along with an expansion into original Marvel games. In 2017, <em>Hitman</em> developer IO Interactive split from Square Enix <a href=\"https://www.ioi.dk/the-future-of-ioi/\">to become an independent studio</a>. Despite the deal, Square Enix isn’t completely out of the Western scene; <a href=\"https://www.hd.square-enix.com/eng/news/pdf/20220502%20A_Press%20Release_fin.pdf\">the company noted</a> it will still publish <em>Just Cause</em>, <em>Life is Strange</em> and <em>Outriders</em> games.</p><p id=\"HnX27P\">The news comes during a particularly busy time for video game acquisitions. <a href=\"https://www.theverge.com/22910846/sony-bungie-acquisition-playstation-destiny-halo\">Sony is buying <em>Destiny</em> developer Bungie for $3.6 billion</a>, <a href=\"https://www.theverge.com/2022/1/10/22876184/take-two-interactive-zynga-acquisition-deal\">Take-Two spent $12.7 billion for <em>FarmVille</em> maker Zynga</a>, and, in the biggest deal yet, <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">Microsoft is set to acquire Activision Blizzard for nearly $69 billion</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/A-K-rZifyBwN3vw8R8lh0szdRu4=/0x24:1200x652/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23432291/SOTTR_Preview5.jpg",
  "description": "The deal is worth $300 million.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}