{
  "title": "SSD prices could spike after Western Digital loses 6.5 billion gigabytes of NAND chips",
  "url": "https://www.theverge.com/2022/2/11/22928867/western-digital-nand-flash-storage-contamination",
  "date": "2022-02-11T11:58:25.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/SUU_0NqRWJ1BKzlhhGoQB9BHwdE=/0x214:1280x1067/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70496802/wd_black_sn850_nvme_ssd_family.png.thumb.1280.1280.0.png\" />        <figcaption>Image: Western Digital</figcaption>    </figure>  <p id=\"AZ2T5U\">Western Digital says it has lost at least 6.5 exabytes (6.5 billion gigabytes) of flash storage due to contamination issues at its NAND production facilities. The contamination could see the price of NAND — the main component of SSDs — spike up to 10 percent, according to <a href=\"https://trendforce.com/presscenter/news/19700101-11116.html\">market research firm TrendForce</a>. Any potential NAND shortages or price fluctuations could affect the PC market over the next few months, which had <a href=\"https://www.theverge.com/2022/1/13/22881569/pc-sales-shipments-2021-growth-idc-gartner-pandemic-demand\">another big year in 2021</a> despite global chip shortages and demand for GPUs.</p><p id=\"ujhCDF\">The contamination of materials used in the manufacturing processes appears to have been detected in late January at two plants in Japan, with Western Digital’s joint venture partner, Kioxia (previously Toshiba), <a href=\"https://about.kioxia.com/ja-jp/news/2022/20220210-1.html\">revealing</a> it has affected BiCS 3D NAND flash memory.</p><p id=\"AeElXo\">Western Digital and Kioxia’s partnership amounts to around 30 percent of the NAND flash market, according to TrendForce. Both Western Digital and Kioxia primarily supply SSD and eMMC storage drives for PCs, and Western Digital is one of the leading suppliers in the industry. </p><p id=\"KP7RHK\">It’s not clear what caused the contamination, whether products on the market will need to be recalled, or when production will resume. <a href=\"https://www.businesswire.com/news/home/20220209006166/en/Western-Digital-Comments-on-Production-Status-of-its-Joint-Venture-Flash-Memory-Manufacturing-Facilities\">Western Digital says</a> it’s “working closely with its joint venture partner, Kioxia, to implement necessary measures that will restore the facilities to normal operational status as quickly as possible.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sRcQjPYevPL9rESuO-xA6UPTIeo=/0x305:1280x975/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21946160/wd_black_sn850_nvme_ssd_family.png.thumb.1280.1280.png",
  "description": "The production issues could impact SSD pricing.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}