{
  "title": "Stablecoins are struggling to survive the crypto crash",
  "url": "https://www.theverge.com/2022/5/12/23069232/terra-luna-collapse-stablecoins-crypto-crash-bitcoin",
  "date": "2022-05-12T20:56:14.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uuAKH2TNS3Tyqyp7riWeJvVz2UU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70862652/acastro_180402_2428_001.0.jpg\" />        <figcaption>Illustration by Alex Castro</figcaption>    </figure>  <p id=\"v3jeQ2\">It’s been a crushing few days for the Terra project, in a week that has been unforgiving for cryptocurrency as a whole.</p><p id=\"RyNc5r\">Over the past few days, the TerraUSD (UST) stablecoin, which is meant to maintain a dollar peg, uncoupled dramatically from the $1 mark and dropped to a low of less than 30 cents on May 10th. In the latest update to the saga, the beleaguered project put its entire blockchain <a href=\"https://techcrunch.com/2022/05/12/terra-halts-its-blockchain-to-prevent-hacks-ust/\">on halt for around two hours</a> on Thursday, freezing user funds until the blockchain was unpaused.</p><div id=\"UEIEVk\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Terra blockchain was officially halted at a block height of 7603700.<a href=\"https://t.co/squ5MZ5VDK\">https://t.co/squ5MZ5VDK</a><br><br>Terra validators have decided to halt the Terra chain to prevent governance attacks following severe <a href=\"https://twitter.com/search?q=%24LUNA&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$LUNA</a> inflation and a significantly reduced cost of attack.</p>— Terra (UST)   Powered by LUNA   (@terra_money) <a href=\"https://twitter.com/terra_money/status/1524785058296778752?ref_src=twsrc%5Etfw\">May 12, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"xb4wcz\">It’s a severe measure, particularly given cryptocurrency’s emphasis on decentralization. “We have seen hard forks before, but this is the first time we’ve seen such a big, decentralized blockchain system decide to halt the entire thing,” said Ronghui Gu, CEO and founder of blockchain security firm CertiK.</p><div class=\"c-float-right\"><aside id=\"MDxThb\"><q>“this is the first time we’ve seen such a big, decentralized blockchain system decide to halt the entire thing”</q></aside></div><p id=\"3K4gmP\">The chaos has been fueled by a steep slide that has seen <a href=\"https://www.bloomberg.com/news/articles/2022-05-12/more-than-200-bilion-wiped-off-cryptocurrency-market-in-a-day\">$200 billion in value wiped out in a single day</a>. Bitcoin alone <a href=\"https://www.coindesk.com/markets/2022/05/12/tether-loses-1-peg-bitcoin-drops-to-2020-levels-of-near-24k/\">fell to below $25,000</a> on the morning of May 12th, a price not seen since December 2020 and less than half of its peak in November 2021. Other cryptocurrencies have faced a similarly punishing few days, with Ethereum having <a href=\"https://www.independent.co.uk/tech/ethereum-cryptocurrency-bitcoin-market-crash-b2077226.html\">lost around 20 percent of its value</a> in just 24 hours.</p><p id=\"yKBxyY\">Terra’s problems started on May 9th when the price of the UST stablecoin began to slide dramatically. Because of the way that algorithmic stablecoins operate, this caused a huge increase in the supply of the corresponding Luna cryptocurrency token, which is traded against UST in order to balance the price.</p><p id=\"eThQea\">Adding Luna tokens into circulation or removing them was previously sufficient to maintain a consistent price for UST. But the size of the price slide and the corresponding amount of Luna minted — supply <a href=\"https://www.coindesk.com/markets/2022/05/12/terras-luna-has-dropped-997-in-under-a-week-thats-good-for-ust/\">more than tripled</a> in a matter of days — sent the two linked cryptocurrencies into a “death spiral” from which neither has been able to recover.</p><p id=\"ns4geS\">Currently, UST is trading at around 40 cents instead of $1; and the value of Luna has been almost entirely wiped out, <a href=\"https://www.cnbc.com/2022/05/12/cryptocurrency-luna-now-almost-worthless-after-ust-falls-below-peg.html\">crashing from $100 to around 1 cent</a>.</p>  <figure class=\"e-image\">        <img alt=\"UST value from May 7th to May 12th. Chart via CoinMarketcap\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/81jKEIKtFSv1Gmh1wD2x-BkYeBc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23456820/UST_7D_graph_coinmarketcap.png\">      <cite>Image: CoinMarketcap</cite>      <figcaption><em>UST value from May 7th to May 12th.</em></figcaption>  </figure><p id=\"j2f6D3\">Terra’s nightmare week shows clearly that stablecoins, which theoretically should maintain a fixed price, can in reality be very much affected by bigger cryptocurrency market movements — and affect those movements in turn.</p><p id=\"SHTo7a\">Terra isn’t the only stablecoin facing problems in the wake of the cryptocurrency downturn. Tether’s USDT stablecoin, the largest by circulation, sank well below its dollar peg to <a href=\"https://www.cnbc.com/2022/05/12/tether-usdt-stablecoin-drops-below-1-peg.html\">trade at 95 cents on some exchanges</a> on Thursday morning, though the price has since recovered. The moves were significant enough that Treasury Secretary Janet Yellen weighed in to reassure the US House Committee on Financial Services that the events <a href=\"https://cointelegraph.com/news/stablecoins-recent-de-pegging-is-not-a-real-threat-to-financial-stability-says-janet-yellen\">did not pose a significant risk</a> to financial markets as a whole.</p><div class=\"c-float-left\"><aside id=\"Fnfjty\"><q>“There are fiat-backed stablecoins but people feel this is too simple”</q></aside></div><p id=\"WQUBWm\">Still, the sudden drop is a reminder that the economics behind most stablecoins is still highly experimental. “There are fiat-backed stablecoins but people feel this is too simple – in the web3 and blockchain world they want to create big, novel ideas and innovations,” said Gu. “That’s why there is so much research on if it’s possible to use algorithms to generate a stablecoin, but so far there are no completely convincing solutions.”</p><p id=\"LgnCe4\">Terra’s future is uncertain, but the sheer volume of unredeemed Terra coins presents a huge problem for the project. As more coin-holders try to cash out, they are likely to devalue the supply of Luna tokens even further, creating <a href=\"https://www.bloomberg.com/opinion/articles/2022-05-12/crypto-crash-contagion-could-go-beyond-bitcoin-ethereum-tether?sref=ExbtjcSG\">what <em>Bloomberg</em>’s Matt Levine described as “a death spiral</a>.”</p><p id=\"OKyKyu\">But Gu is still guardedly optimistic about the broader future for stablecoins. “The crash shows people have overestimated what can be done with blockchain and web3 in a short period of time,” he says, “but they still underestimate what can be done in five or ten years.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rUaR5RqYmvfihRfA_BzIMNOzcio=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10576389/acastro_180402_2428_001.jpg",
  "description": "I need a dollar, dollar, a dollar is what I need.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}