{
  "title": "Starlink is coming to Hawaiian Airlines in a bid to try and fix in-flight Wi-Fi",
  "url": "https://www.theverge.com/2022/4/25/23040937/starlink-airlines-in-flight-wifi",
  "date": "2022-04-25T15:35:15.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KsU-XmndS_fB8GgCf1eB0WZCIh8=/0x85:2040x1445/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70790483/npatel_20210512_4552_0048.0.jpg\" />        <figcaption>Photo by Nilay Patel / The Verge</figcaption>    </figure>  <p id=\"Pgk3Yv\">SpaceX is starting to make deals with airlines to provide its Starlink satellite internet to sky travelers everywhere. It <a href=\"https://newsroom.hawaiianairlines.com/releases/hawaiian-airlines-to-offer-free-high-speed-starlink-internet-connectivity-on-transpacific-fleet\">announced a deal</a> on Monday with Hawaiian Airlines, and last week made a similar deal with charter carrier JSX. None of the involved parties shared the financial details of their deals, but both airlines did say they’re planning to offer the in-flight Wi-Fi for free, which is both a semi-miraculous fact and a sign of hope that free Wi-Fi is becoming the industry standard. Delta meanwhile, <a href=\"https://www.theverge.com/2022/4/19/23031241/delta-airlines-starlink-internet-wi-fi-flights-spacex\">confirmed last week</a> that it’s running “exploratory” Starlink tests. </p><p id=\"zmIOPY\">In-flight Wi-Fi has been on the minds of Team Starlink for a while. Jonathan Hofeller, SpaceX’s VP of Starlink and commercial sales, said last year that the company was building an aviation product, and was “<a href=\"https://www.theverge.com/2021/6/9/22526601/elon-musk-spacex-starlink-internet-talks-commercial-airlines-in-flight-wifi\">in talks with several of the airlines</a>.” It’s a natural place for the company to focus, really: in-flight Wi-Fi is a billion-dollar market and growing fast, and it’s currently dominated by Viasat and Gogo, two products nobody would accuse of being fast-moving innovators. And maybe best of all for Starlink, there are <a href=\"https://www.theverge.com/22435030/starlink-satellite-internet-spacex-review\">none of those pesky trees or buildings</a> in the sky to get in the way! In the long run, there might be lots of competition here, including from companies like OneWeb and Amazon, which are also making big bets on satellite internet. But for now, the industry appears ripe for disruption.</p><p id=\"a1BR75\">Over the last couple of years, the company has been busy launching more satellites, <a href=\"https://www.theverge.com/2021/3/8/22319761/spacex-starlink-fcc-internet-cars-boats-aircraft\">seeking FCC approvals</a>, and building out the capability to let satellites talk to each other without needing to communicate with ground stations. </p><p id=\"ctEzmY\">When it all comes together, Hofeller promised it’ll be a huge step up in the speed and quality of in-flight Wi-Fi. (Starlink currently promises downloads speeds up to 200Mb/s for its earthbound users.) Now, if you’ve ever paid extra for “fast” internet on a flight, you know just how loosely that term gets used, so don’t get your hopes up too high. And there’s still a lot to work out, both on the regulatory and product fronts, and even Starlink’s existing products have bugs and issues. But the current in-flight bar is definitely low enough to make it easy for Starlink (or someone else) to do better.</p><p id=\"tyYXCy\">Airlines seem to be just as enthusiastic about the idea. Executives have noted repeatedly over the last few years that passenger expectations are way ahead of the available in-flight technology, and things have slowly begun to get better. Delta opened up some bandwidth to allow users to message throughout a flight, for instance, and JetBlue made in-flight Wi-Fi free for its passengers. But there’s still nothing out there that even comes close to rivaling your home internet, or even what you’d get at a crowded coffee shop. SpaceX thinks Starlink can change that, and a number of airlines seem to be open to the idea.</p><p id=\"UBO4iS\">As for when all this is coming to your aisle seat? JSX said it’s already testing Starlink service and plans to roll it out to its fleet <a href=\"https://twitter.com/flyjsx/status/1517247913692442624?s=20&amp;t=i0E6EwU84xEh1AtdHARKkQ\">later this year</a>, while Hawaiian Airlines said that it’s “in the initial stages of implementation and expect[s] to begin installing the product on select aircraft next year.” That’s a vague timeline, and Elon Musk-owned companies are not exactly famous for hitting their deadlines. But it’s happening. And these are not likely to be the last airlines that start looking for a place to mount a Starlink antenna.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jmn3a5tSQbWllc7bULX6sd0aLBk=/0x231:2040x1299/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22512181/npatel_20210512_4552_0048.jpg",
  "description": "Disrupting the market one decent connection at a time",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}