{
  "title": "Starlink hikes prices for monthly service and starter kit, even if you put down a deposit",
  "url": "https://www.theverge.com/2022/3/22/22991841/spacex-starlink-price-hike-inflation-user-terminal",
  "date": "2022-03-22T22:48:15.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"Odesa receives Starlink systems\" src=\"https://cdn.vox-cdn.com/thumbor/KcknCgh0LAnYK0eZ6fdQzSI3l5k=/0x1:6387x4259/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70659272/1239230849.0.jpg\" />        <figcaption>A Starlink terminal being used in Ukraine | Photo credit should read Nina Lyashonok/ Ukrinform/Future Publishing via Getty Images</figcaption>    </figure>  <p id=\"edtryl\">SpaceX’s internet-from-space program Starlink is increasing prices for both the purchase of Starlink kits and for the monthly service, according to a new email sent out to customers this afternoon reviewed by <em>The Verge</em>. The company says the “sole purpose of these adjustments is to keep pace with rising inflation.”</p><p id=\"stslJE\">Originally, opting into Starlink required a $499 upfront purchase of a starter kit with all the necessary supplies, including a user terminal, or antenna, for connecting with SpaceX’s satellites. Customers would then pay a $99 monthly charge to keep the service running. Now, the new monthly price going forward will be $110. All new orders of the Starlink kit will now cost $599, and anyone who put down a deposit for the original $499 kit will have to pay $549 instead. The new monthly prices will come into effect at different times for different customers.</p><div class=\"c-float-right\"><aside id=\"kyWw7x\"><q>“the sole purpose of these adjustments is to keep pace with rising inflation.”</q></aside></div><p id=\"S8O2Rm\">The new prices seem to be separate from <a href=\"https://www.theverge.com/2022/2/2/22913921/spacex-starlink-premium-satellite-internet-faster-speed-expensive\">Starlink’s premium service</a> which runs customers $2,500 to purchase the kit and $500 a month for higher performance. The new Starlink Premium service was unveiled this year, despite the fact that SpaceX president Gwynne Shotwell had previously said the company had no plans to add price tiers for the service.</p><p id=\"daV3CM\">Starlink is SpaceX’s ambitious program aimed at launching tens of thousands of satellites to beam broadband Internet coverage to the entire globe. To tap into the system, users must point their user terminal at a large patch of open sky, connecting with whichever satellites are overhead. Those satellites then relay signals to SpaceX’s various ground stations on Earth, which are connected to existing fiber-optic infrastructure. So far, the company has launched more than 2,000 Starlink satellites, and an executive for SpaceX claimed this week that Starlink has 250,000 users worldwide, <a href=\"https://www.cnbc.com/2022/03/21/spacex-starlink-vp-aviation-internet-market-ripe-for-overhaul.html\">according to CNBC</a>. SpaceX also recently <a href=\"https://www.cnbc.com/2022/03/22/elon-musk-spacex-thousands-of-starlink-satellite-dishes-sent-to-ukraine.html\">sent thousands of terminals to Ukraine</a> upon <a href=\"https://www.theverge.com/2022/2/28/22955339/elon-musk-spacex-starlink-ukraine-user-terminals-russia-invasion\">the request of the Ukrainian government</a>.</p><p id=\"MersAm\">When SpaceX first started offering Starlink to customers, the cost to construct each user antenna ran about $3,000, which meant SpaceX was selling its kits to customers at a loss. In April of 2021, Shotwell claimed that SpaceX managed to shave down the construction cost, <a href=\"https://www.cnbc.com/2021/04/06/spacexs-shotwell-no-plan-for-tiered-starlink-internet-pricing.html\">putting it around $1,300 to build each terminal</a>. In August, she vowed that the user terminals SpaceX created by the end of 2021 would be “roughly half of what our current user terminals cost,” <a href=\"https://www.pcmag.com/news/spacex-prepares-to-cut-starlink-dish-cost-by-half-later-this-year\">according to PC Mag</a>.</p><p id=\"K3OrFH\">In its email to Starlink customers announcing the price hike, SpaceX touted its latest improvements to the entire system. “Since launching our public beta service in October 2020, the Starlink team has tripled the number of satellites in orbit, quadrupled the number of ground stations and made continuous improvements to our network,” the email stated. “Going forward, users can expect Starlink to maintain its cadence of continuous network improvements as well as new feature additions.” There were no details on if additional price hikes might occur.</p><p id=\"yYdJGg\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/y_D00TI-wksyf-UiDwS-I2_5VNE=/0x458:6387x3802/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23338224/1239230849.jpg",
  "description": "A new starter kit will run you $599",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}