{
  "title": "Startup Trail is Oregon Trail for tech policy wonks",
  "url": "https://www.theverge.com/2022/4/28/23045333/startup-trail-game-oregon",
  "date": "2022-04-29T15:00:00.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nx292gEDoRMbcpqsNn_ILzYdZ8s=/340x0:2206x1244/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70805813/Screen_Shot_2022_04_27_at_4.50.34_PM.0.png\" />        <figcaption>Image: Startup Trail</figcaption>    </figure>  <p id=\"JtErhB\">My startup went public, and it only took me about 25 minutes to pull it off. I don’t remember what the company does, though I don’t think it really matters? I own 16 percent of the place, but after I made some rash decisions about a legal fight and opted to set up a local office in India, the company basically doesn’t have any cash left on hand. Users love us, though! So the future’s bright for... whatever our name is. It doesn’t matter. In a minute, I’ll start over and try something else.</p><p id=\"3YOaMx\">I’ve spent too much of my day today playing <a href=\"https://startuptrail.engine.is/\"><em>Startup Trail</em></a>, a new browser game made by The Copia Institute (a think tank and the parent organization of the publication <em>Techdirt</em>)<em>, </em>the startup trade group Engine, and developer Leveraged Play. The two organizations created the game, as <em>Techdirt’s</em> Mike Masnick puts it, to give people a small glimpse into the kinds of policy decisions startups have to make and why they’re rarely as easy as they look. Especially for small companies that don’t have the seemingly infinite resources of a Google or an Amazon. </p><p id=\"OotS2Z\">At the start of <em>Startup Trail</em> — which definitely has echoes of <em>Oregon Trail,</em> and Masnick told me the debate about whether dysentery should be involved made it all the way through the night before launch — you choose the kind of founder you want to be and where you want to be located. I picked Mike, who has wealthy connections, graduated from “an elite institution with a reputation for turning out startup founders,” and sounded roughly like most of the Stanford grad startup founders running around Palo Alto. I opted to set up shop in “University Park,” where there was plenty of cheaper talent but not as many investors as I would have found in “Big Tech Valley.” I actually never got to choose what my company does because it doesn’t really seem to matter. Most startups deal with the same stuff.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZvBhgzKhXus864dnwQfo9gwcU6I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23421125/Screen_Shot_2022_04_27_at_4.50.14_PM.png\">      <cite>Image: Startup Trail</cite>      <figcaption><em>Life as a startup founder is a series of non-obvious decisions.</em></figcaption>  </figure><p id=\"CoqaiE\">From there, my life as a founder became an endless series of questions, each one vying for my money, my time, and my team’s talent. Every time I made a choice — to fundraise instead of hire or to punt on content moderation issues instead of spending my limited capital to work on them — the meters on the left side of the screen would move around. One tracked my financial health, another my user growth, a third my tech and talent. And underneath them all, three slowly disappearing clocks reminded me that time and energy are both finite, and I can’t do everything at once.</p><p id=\"uDaxTw\">The game’s larger point becomes clear pretty fast: doing the right thing is hard, even when it’s obvious what the right thing is. (And it’s not usually obvious.) Even as I’d come upon what seemed like easy choices — like telling users when I’m handing over their information to law enforcement — I had to reckon with the time, money, and potential downsides of that decision. (Picking a fight with the FBI is a bit of a time-suck.) When I decided not to worry about the competition, because every startup CEO tells me they’re not worried about competition, my competition eventually crushed me. I had to decide who to raise money from and how much to raise, all with no idea what geopolitical or regulatory issues might show up later. I pulled out of Brazil rather than comply with a terrible new regulation, but I’m still not sure I did the right thing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/o-7-btPzoMmgYSCGR_LXpd60tLM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23421126/Screen_Shot_2022_04_27_at_4.49.56_PM.png\">      <cite>Image: Startup Trail</cite>      <figcaption><em>In the startup world, sometimes you win, but mostly you lose.</em></figcaption>  </figure><p id=\"vwqCde\"><em>Techdirt</em> has worked on games like <em>Startup Trail</em> before, mini-simulators meant to help people understand the complexities behind newsy issues. “We discovered that games as a concept are a really interesting way to explore difficult ideas, difficult policy ideas, and also play with the future in general,” Masnick told me. In too many cases, he said, “everybody’s got their position, and they’re really dug in.” But when it comes to games, “just by the premise, you’re saying, ‘OK, put yourself in this other role. What would you do?’” <em>Techdirt</em> <a href=\"https://www.techdirt.com/2020/08/27/we-ran-our-online-election-disinformation-simulation-game-theres-plenty-to-be-worried-about/\">ran a simulation</a>, for instance, to learn how disinformation might affect the 2020 election, and got some... dispiriting results. And its <em>Magic: The Gathering</em>-style card game <a href=\"https://www.theverge.com/2018/5/21/17374054/cia-collect-it-all-declassified-training-tabletop-card-game\">based on a CIA training program</a> is still a fun way to spend an evening. Going forward, Masnick said the team is hard at work on an even more intense game dedicated to trust and safety issues.</p><div id=\"YaiDdE\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Going through this was a bit too autobiographical for comfort. <a href=\"https://twitter.com/hashtag/StartupTrail?src=hash&amp;ref_src=twsrc%5Etfw\">#StartupTrail</a><br><br>The End - Going Public<br>Progress: 35/35<br>Rank:      <br><br>     ⬛️⬛️<br>      ⬛️<br>       <br><br>  ⚫️<br><br>Play: <a href=\"https://t.co/XdGEz0bAu7\">https://t.co/XdGEz0bAu7</a></p>— Matthew Prince   (@eastdakota) <a href=\"https://twitter.com/eastdakota/status/1519491979914006529?ref_src=twsrc%5Etfw\">April 28, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"aKBBbH\">When you get to the end of the game, you can share how you did. You get scores on each category, plus an overall score out of five unicorns. (I got four unicorns, not to brag.) And eventually, if you’re lucky, you get to decide what to do: go public, get acquired, stay private, or hire another CEO and go hang out on a yacht somewhere. </p><p id=\"oNQWGm\">Masnick said that if there’s a perfect way to play the game, even he doesn’t know what it is. “I know exactly how it’s scored, I have access to that, and I have no idea what the best path through is,” he said. As I’ve played through a few times, most roads end in ruin. You run out of money, you get squashed by a competitor, some legal issue catches up to you and takes you down. In a way, I guess “the patent trolls got you” is the 2022 version of dying of dysentery. </p><p id=\"2VMckT\"><em><strong>Update April 29th, 11:00AM ET:</strong></em><em> Article updated to add the Copia Institute and Leveraged Play as partners behind the Startup Trail game.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GYqEtjclY2WC7u2bu3zTmRruAc4=/85x0:2461x1244/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23421120/Screen_Shot_2022_04_27_at_4.50.34_PM.png",
  "description": "Always one decision away from falling apart",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}