{
  "title": "Star Wars has a Luke Skywalker problem",
  "url": "https://www.theverge.com/2022/2/2/22914062/the-book-of-boba-fett-star-wars-luke-skywalker-aging-cgi",
  "date": "2022-02-02T15:17:54.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/tqeJSw7wYGJeGhqtujLwSATPGvo=/502x0:2203x1134/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70462184/Screen_Shot_2020_12_18_at_8.36.31_AM.0.png\" />        <figcaption>Image: Lucasfilm Ltd.</figcaption>    </figure>  <p id=\"22cruo\"><em>The Book of Boba Fett</em> — much like all of Disney’s current and future Star Wars shows — has a Luke Skywalker problem. And it’s one that no amount of expensive CGI technology can solve.</p><p id=\"n0n8EM\"><strong>Spoilers for The Book of Boba Fett, episode six ahead</strong></p><p id=\"Vhb9wk\">The issue goes something like this: Luke is, obviously, a hugely important character to Star Wars as a franchise. Star Wars’ current plan for its future is heavily focused on Disney Plus TV shows set in the post-<em>Return of the Jedi</em> era, like <em>The Mandalorian</em> and <em>The Book of Boba Fett</em>, set five years after <em>Return of the Jedi</em>, where Luke is roughly 28 years old. </p><p id=\"TwU8Si\">Mark Hamill — who is still portraying Skywalker — is 70, meaning that a vast array of de-aging technology and body doubles are needed to allow the actor to practically portray a character two and a half times younger. But Star Wars’ tendency for nostalgia is quickly becoming an issue, particularly as the de-aged Skywalker is given a more and more prominent role in the story. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-LK27jiOOIdAUMKNym9uy_iP2nY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212566/Screen_Shot_2022_02_02_at_9.16.11_AM.png\">      <cite>Image: Lucasfilm</cite>  </figure><p id=\"vofAQJ\">From an emotional perspective, I fully understand Lucasfilm’s desire to keep Hamill in the role as long as possible. Skywalker’s brief appearance in <em>The Mandalorian </em>season two’s finale was a fantastic moment for fans, and a perfect chance for Hamill to get to play the character in his prime one last time — <a href=\"https://www.youtube.com/watch?v=VgHdyaBMMhc\">it’s Luke Skywalker! Here to rescue you!</a> — cutting down armies of battle droids. But the moment worked in part due to its brevity, with the de-aged actor appearing more of as a cameo at the end, rather than a key part of the episode.</p><p id=\"7EU0EX\">But the latest episode of <em>The Book of Boba Fett</em> spends almost <em>half</em> its runtime with the uncanny, blank visage of Mark Hamill’s frozen 1983 face. Scenes feel awkwardly cut to long perspectives and odd shots of characters running to (presumably) give over-taxed animators a break. Even then the result is still a poor simulacrum. There’s almost no emotion or humanity in the part-CGI’s Luke’s face; he rarely cracks a smile, and even brief flares of frustration or disappointment never quite reach his eyes.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wCiIn3P7g4mR1Y0sYTqi7S20Y2A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23212569/Screen_Shot_2022_02_02_at_9.15.06_AM.png\">      <cite>Image: Lucasfilm</cite>  </figure><p id=\"BQlwow\">This isn’t to belittle Hamill’s performance here, or that of Lucasfilm’s animation team: the efforts here are a <em>long</em> way forward from the <a href=\"https://www.theverge.com/2016/12/27/14090152/rogue-one-animators-star-wars-grand-moff-tarkin-peter-cushing-cgi\">plastic-y rendition of Peter Cushing’s Grand Moff Tarkin in <em>Rogue One</em></a>, for example. But it’s hard not to feel that the episode would have gotten a lot more mileage out of simply admitting the fact that Hamill isn’t 29 anymore, and that recasting the role with a younger actor would have allowed for a more dynamic performance (in addition to cutting down on the hours of CGI makeup that the current setups presumably needs).</p><div class=\"c-float-right\"><aside id=\"kctr2Y\"><q>CGI de-aging can only go so far</q></aside></div><p id=\"cQ6s1O\">And while Hamill’s portrayal of Skywalker is — and forever will be — the definitive version of the character, pretending that recasting a new actor to play a younger version of iconic Star Wars characters is some kind of sacred line that must never be crossed is also ridiculous. </p><p id=\"ORLpNL\">The franchise already <em>has</em> done exactly that: the spinoff prequel <em>Solo</em> recast Han Solo with Alden Ehrenreich and Lando Calrissian with Donald Glover. Different performances, sure, than those of Harrison Ford and Billy Dee Williams, but also ones that accepted that Ford and Williams were not the best choices to play the 20-something versions of their iconic characters anymore. And whatever criticisms one might make of Ehrenreich’s and Glover’s performances, it’s undeniable that <em>Solo</em>’s recast characters are far more compelling to watch on screen than the stiff de-aged deepfakes that Star Wars has started to gravitate towards. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kdohnzaS7L6XGJBMIpm18vGGOhk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10849823/HanSolo5ae0af0be16e2.jpg\">      <cite>Jonathan Olley / Lucasfilm Ltd.</cite>  </figure><p id=\"IjScuE\">Recasting younger actors for prequels also doesn’t mean that the original actors can’t still portray older versions of their characters in future installments, too. Ford and Williams both returned to delight fans in appearances as the older iterations of Han and Lando in <em>The Rise of Skywalker</em>, for example. And it’s a no-brainer to assume that Hamill would continue to portray Luke for stories that feature the older version of the Jedi Master (as he did in the sequel trilogy of films).</p><div class=\"c-float-right\"><aside id=\"66qaF1\"><q>Not even Star Wars can escape the march of time</q></aside></div><p id=\"jhfPFl\">But if Star Wars insists on staying firmly in the franchise’s past, instead of forging onward into the post-<em>Rise of Skywalker</em> future of the series’ timeline — as the current crop of shows seems intent on doing — then it’s going to have to acknowledge at some point that while its storylines might be stuck in the post-80s era of the franchise, time doesn’t stop for anyone else. </p><p id=\"EXBhHG\">And if Luke Skywalker is going to continue to be a crucial part of <em>Star Wars</em>’ future, the franchise needs to start thinking about how it’ll pass the torch of the character to a new generation. </p><p id=\"2rALZn\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/G9KOiBRUr0AFDRV-t0BCmtAx8-g=/269x0:2435x1134/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22182173/Screen_Shot_2020_12_18_at_8.36.31_AM.png",
  "description": "Emphasized by The Book of Boba Fett’s latest episode",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}