{
  "title": "Starlink’s new Portability feature brings internet to vanlifers ",
  "url": "https://www.theverge.com/2022/5/5/23058181/starlink-portability-internet-price-locations",
  "date": "2022-05-05T09:59:11.000Z",
  "author": "Thomas Ricker",
  "content": "      <figure>      <img alt=\"Starlink dish in the back of a truck\" src=\"https://cdn.vox-cdn.com/thumbor/YOyZeW2tCuGYJniTk2Nvt1iPhgE=/0x85:2040x1445/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70834407/npatel_20210512_4552_0022.0.jpg\" />        <figcaption><em>Starlink Portability lets your take your SpaceX internet anywhere.</em> | Photo by Nilay Patel / The Verge</figcaption>    </figure>  <p id=\"RAcLgl\">Starlink’s internet-from-SpaceX service has gone mobile with a new Portability feature. For an additional monthly fee, Starlink subscribers can now take their “dishy” anywhere on their home continent that provides <a href=\"https://www.starlink.com/map\">active internet coverage</a>. That opens up connectivity to remote places that will likely never be covered by 5G — a potential boon to the increasing numbers of work-from-anywhere types spawned by the COVID 19 pandemic.</p><p id=\"tzlKZS\">SpaceX CEO Elon Musk responded to one happy Starlink camper saying, “Starlink is awesome for RV’s, camping or any activity away from cities.”</p><div id=\"8suRzj\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Starlink is awesome for RV’s, camping or any activity away from cities</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1521527168731279360?ref_src=twsrc%5Etfw\">May 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"VvOBlF\">Starlink doesn’t support use while driving yet, but the company says it’s actively working on a solution for moving vehicles. Musk has previously tweeted about working on a <a href=\"https://twitter.com/elonmusk/status/1499442132402130951\">power-efficient solution</a> that can plug into a car’s 12V cigarette lighter and still maintain connectivity. That hasn’t stopped some owners using a bit of hackery to <a href=\"https://www.youtube.com/watch?v=8PDVURcvWeg\">test Starlink on speeding cars</a> — with varied success.</p><p id=\"ogEmXM\">Power consumption is an important consideration when boondocking and living off your vehicle’s battery. Starlink reportedly draws between 60-70W, according to <a href=\"https://www.jeffgeerling.com/blog/2022/starlink-roaming-makes-mobile-usage-possible\">Jeff Geerling’s blog</a>, an improvement on the 80-100W draw from just a year ago.</p><p id=\"Vy4qSb\">Starlink is offering Portability on a “best effort basis,” the company says, with users at their registered service addresses receiving priority for network resources. “When you bring your Starlink to a new location, this prioritization may result in degraded service, particularly at times of peak usage or network congestion,” notes the <a href=\"https://support.starlink.com\">Starlink support page</a>.</p><p id=\"wPUhep\">Existing Starlink customers can add Portability from their account page which then immediately becomes active. It costs an additional $25 each month, on top of monthly subscriptions that already start at $110 after a one-time hit of $599 to purchase the Starlink kit.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Qbdi778NnwKrBqJDsjUs8ULEktw=/0x231:2040x1299/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22512179/npatel_20210512_4552_0022.jpg",
  "description": "SpaceX internet in remote spaces.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}