{
  "title": "Steam Deck, one month later",
  "url": "https://www.theverge.com/22960536/steam-deck-faq-valve-one-month-later",
  "date": "2022-03-29T17:30:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/d_inpKafP9rROVFgfn8y4naqvi8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70685803/vpavic_220210_5030_0090.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p>We kept using Valve’s handheld game console — here are answers to your burning questions</p> <p class=\"p--has-dropcap\" id=\"XTBU1N\">Love it or hate it, fail or succeed, <a href=\"https://www.theverge.com/22579493/valve-steam-deck-gaming-handheld-pc\">the Steam Deck</a> will go down in gadget history. It’s a bold attempt to make PC gaming more portable <em>and </em>affordable than ever before, an ultimate gadget with exotic features and infinitely customizable controls, and perhaps the most powerful gaming PC ever sold for a mere $400. </p><p id=\"gRaAfM\">But it also shipped incomplete. <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">We titled our February 28th review “Steam Deck: it’s not ready”</a> — even though I <em>also</em> called it the most fun I’ve had in years.</p><p id=\"y1saPq\">One month and <a href=\"https://store.steampowered.com/news/collection/steam/?emclan=103582791470414830\">many updates</a> later, has anything changed? Yes and no!</p><p id=\"sACVgv\">Here’s what I learned spending another month with the Steam Deck, as well as the answers to many burning questions I wasn’t able to address in our original review. </p><p id=\"lq0XyP\">Consider this our Steam Deck FAQ.</p><div class=\"c-wide-block\"><div id=\"QRTIiT\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Steam Deck|106078\" data-volume-uuid=\"fef96bfb9\" data-volume-id=\"106078\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-561\" class=\"volume-video\" data-volume-player-choice=\"youtube\"></div></div></div><h2 id=\"Xyxduj\"><strong>What is the Steam Deck, in one sentence flat?</strong></h2><p id=\"qTQx97\">It’s a Linux gaming PC that runs many but not all Windows games, on the go like a Nintendo Switch, only with <em>way</em> more horsepower, shorter battery life, and a seriously noisy fan. </p><p id=\"22Hy34\">Or, <a href=\"https://www.theverge.com/2022/3/10/22971108/valve-steam-deck-windows-runs-drivers-no-support\">optionally</a>, it’s a Windows gaming PC that runs more games — but often poorly — without as much portability, without speakers, and a whole bunch of other weirdness because Valve isn’t officially supporting Windows on Deck. </p><p id=\"IJtf2N\">I’ll talk about Windows more later, but TL;DR: I don’t recommend Windows on Deck at all.</p><p id=\"b9snfz\"><strong>How noisy is that fan? </strong></p><p id=\"zy5mAt\">Here, <a href=\"https://youtu.be/0w64KhTguWA?t=503\">take a listen</a>!</p><p id=\"N0E1GO\">It doesn’t exactly overpower the Deck’s excellent speakers, and I don’t think it’d be audible over the noise of an airplane, and my wife hasn’t kicked me out of bed for repeatedly playing <em>Elden Ring</em> past midnight — yet. </p><p id=\"UZKFk8\"><strong>Isn’t it... heavy to hold above your head in bed? </strong></p><p id=\"PBnQRN\">It’s no Nintendo Switch, that’s for sure, and at 1.47 pounds, I tend to lie on my stomach and play it prone instead. The USB-C port’s on the top, so you can still charge it that way. </p><div><div id=\"WaLIEv\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I have held and played the Steam Deck. <br><br>It is ginormous compared to a Nintendo Switch. <br><br>I did not necessarily mind that.  <a href=\"https://t.co/1GfGXRua4f\">https://t.co/1GfGXRua4f</a> <a href=\"https://t.co/XLbDE9D9s2\">pic.twitter.com/XLbDE9D9s2</a></p>— Sean Hollister (@StarFire2258) <a href=\"https://twitter.com/StarFire2258/status/1423693284937924609?ref_src=twsrc%5Etfw\">August 6, 2021</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"zZQM4A\"><strong>How much does it hurt to drop it on your face? (Is it more late </strong><em><strong>Harry Potter</strong></em><strong> or </strong><em><strong>A Game of Thrones</strong></em><strong>?)</strong></p><p id=\"aRV1UV\">Do you <em>really</em> need to know? The things I do for readers... </p><p id=\"tDbHmC\">OW, MY NOSE. Yes, that’s definitely worse than a Nintendo Switch. At least there’s nothing pointy on the Steam Deck, unlike some of the book corners I’ve brained myself with over the years.</p><p id=\"6EQy1x\"><strong>Just how powerful are we talking?</strong> <strong>Should I buy this instead of the PS5 that never wants to hop into my online shopping cart?</strong></p><p id=\"eyE21o\">It’s more PS4 than PS5 — and our friends <a href=\"https://www.youtube.com/watch?v=44TRzEGPbfE\">at <em>Digital Foundry</em> have the video to prove it</a>, running <em>God of War</em> on both the Steam Deck and a PS4 at the same settings. But PS4 power in a handheld is unheard of. (Compare to the Nintendo Switch, where <em>The Witcher 3 </em><a href=\"https://youtu.be/3L2j_pFgEuk?t=69\">looks like dirt by comparison</a>.)</p><p id=\"RoghHh\">And in some games, I’d argue the Steam Deck does better than a PS4, at least at its given resolution. When I’m playing games like <em>Control</em> at 60fps, it feels more like a PS4 Pro.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5c3sXUNv_LaZdxMqb0Sltp9KbE0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270008/vpavic_220210_5030_0087.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>  </figure></div><p id=\"Vh5LrX\"><strong>OK, but can it run Crysis / Doom / INSERT GAME HERE???</strong></p><p id=\"NNGXw2\"><a href=\"https://www.youtube.com/watch?v=8MJ8vuwZWSA\">Yes</a>. <a href=\"https://www.youtube.com/watch?v=I_niB-Xfb5Q\">Yes</a>. Probably? Like I say <a href=\"https://www.youtube.com/watch?v=0w64KhTguWA\">in the video review</a>, you can’t be 100 percent sure a game will play brilliantly even if Valve has “verified” it — and over the past month, early adopters have discovered Valve’s verification system is anything but foolproof.   </p><p id=\"r8wh3r\">Examples:</p><ul><li id=\"WJxwTk\"><em>Deathloop</em> has a green “Deck Verified” badge but doesn’t play well, with slowdown and stuttery controls</li><li id=\"YirO9w\"><em>Vampire Survivors </em>has a green “Deck Verified” badge, which worked perfectly for me at launch but no longer detects the Deck’s controls at all</li><li id=\"8obyhw\"><em>Slay the Spire</em> has a green “Deck Verified” badge, which worked great at launch, but the controls are broken and buggy now</li><li id=\"cOclHV\"><a href=\"https://www.youtube.com/watch?v=5SZ5AX4TiG4\"><em>LinusTechTips</em> says</a> <em>Horizon Zero Dawn</em>, which has a green “Deck Verified” badge, only started stuttering after the first six to seven hours of the game</li></ul><p id=\"YlXjLK\">Perhaps as a result of this, Valve is now polling Steam Deck owners <a href=\"https://store.steampowered.com/news/collection/steam/?emclan=103582791470732252&amp;emgid=3108053564724486396\">to verify its verification system</a> so it can adjust its testing.</p><p id=\"lBsCWC\">All that said, most games seem to work! I’ve put loads of hours into the brand-new <em>Elden Ring </em>and <em>Control Ultimate Edition</em> on the Deck with no real issues, and even the majority of “unverified” games I’ve tried generally worked. Some games that didn’t work at launch, like <em>Cyberpunk 2077</em>, now do with caveats.</p><p id=\"kXkfKu\">When games didn’t work for me, it was mostly due to anti-cheat software — allegedly an easy thing for game developers to patch. </p><p id=\"rx2ZWh\"><strong>If it’s so easy, why aren’t game developers enabling anti-cheat? </strong></p><p id=\"ZfeRH6\">That’s the question, isn’t it? <a href=\"https://www.theverge.com/2022/2/8/22923163/fortnite-steam-deck-update-epic-tim-sweeney\">Fear, uncertainty, a sense that it wouldn’t be worth the effort</a>. </p><p id=\"bj3uld\">But some companies actually are: <em>Elden Ring </em>and <em>Apex Legends</em> now have working online multiplayer on Deck because their dev enabled Easy Anti-Cheat. Neither of those games worked at the Steam Deck’s launch one month ago. </p><p id=\"HHNgJJ\">And though <em>Halo Infinite</em> still won’t even let you launch its single-player mode, Microsoft did update <em>Halo: The Master Chief Collection</em> so you can do classic Halo campaigns. </p><p id=\"C2WSnC\"><strong>Can the Steam Deck be my daily driver gaming PC? (Is it yours?)</strong></p><p id=\"uusKDg\">If I’m being totally honest, it’s my daily <a href=\"https://www.theverge.com/2022/2/23/22946279/elden-ring-review-ps5-xbox-pc\"><em>Elden Ring</em></a> machine right now. It works great native, and it works great streamed from my desktop to the Deck, too. And if I were just playing single-player games like that, there’s no end of titles to keep me busy: I’ve been sucked back into <em>Into the Breach,</em> <em>Resident Evil 2</em>, <em>The Witcher 3, Fallout 4</em>, even <em>Metal Gear Solid V</em>,<em> </em>which seems to run butter-smooth at 60fps. (I guess I’m on a sequel kick.)</p><p id=\"Ci18ey\">And that’s before we talk about the wide array of things you can access from the Linux desktop, like GameCube, PlayStation, Wii and even Nintendo Switch emulators, as well as <a href=\"https://www.gamingonlinux.com/2022/03/heroic-games-launcher-now-on-flathub-even-easier-to-run-epic-games-on-steam-deck/\">launchers like Heroic</a> that can give you access to the Epic Games Store and games from GOG.com. Some community members are so enthusiastic they’re building custom software for the Deck <a href=\"https://www.emudeck.com/\">like EmuDeck</a>, an app designed to automatically configure emulators for the system. </p><div id=\"EJSLwV\"><div ><iframe src=\"https://www.youtube.com/embed/LIP-DF9K2SM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"osNluS\">But no, I can’t quite make it my only computer because buds play online games that still don’t work on Deck — no <em>Halo Infinite</em>, no <em>Duck Game</em>, no <em>PUBG. </em>So I’m still swapping back and forth between the Deck and my desktop PC. </p><p id=\"C6aQzj\"><strong>Who’s actually going to play competitive games with joysticks on a 7-inch screen? </strong></p><p id=\"m6byCO\">Yeah — after an <em>Apex Legends </em>session or two, I don’t think I enjoy the challenge of spotting distant enemies on the Deck’s display. It’s hard! But remember: you can plug in a USB-C hub for monitor, mouse, keyboard, power, and wired internet simultaneously. And the Deck’s built-in global AMD FSR upscaling makes the Deck look remarkably OK blown up to a 1440p monitor. </p><p id=\"9ev1TK\">Here’s a close-up with <em>Elden Ring (</em>more examples <a href=\"https://www.theverge.com/22959533/steam-deck-fsr-upscaling-nintendo-switch-pro-dlss\">at this link</a>).</p><div><div id=\"dnQouB\"><div data-anthem-component=\"imageslider:11076097\"></div></div></div><p id=\"j86vPq\"><strong>What about streaming games to the Deck? Google Stadia, Xbox Cloud Gaming, GeForce Now, or maybe from that desktop you mentioned?</strong></p><p id=\"3ysDRf\">They all work as of today — if your internet and Wi-Fi are up to snuff, you can play <em>Destiny 2</em>, <em>PUBG</em>, and <em>Fortnite</em> on a Steam Deck without installing Windows. But each has caveats, so let’s do a quick rundown.</p><div class=\"c-float-right c-float-hang\"><aside id=\"3Wew9x\"><q>Try Stadia first, I’d say</q></aside></div><p id=\"lTf1wO\"><strong>Google Stadia</strong> is the lowest hanging fruit because it’s free, easy, and responsive. Flip over to the Steam Deck’s desktop mode, use the Discover app to install Google Chrome, log in with your Google account at <a href=\"http://stadia.google.com\">stadia.google.com</a>, maybe set a Chrome profile to automatically launch that website, then <a href=\"https://help.steampowered.com/en/faqs/view/4B8B-9697-2338-40EC\">add Chrome to your Steam library</a> so you can access it from the Steam Deck’s regular interface. The only time-consuming part is mapping controls — unfortunately, Chrome still doesn’t support the Steam Deck as a gamepad, so you’ll need to have it emulate a keyboard and mouse. Still, that’s free access to <em>Crayta, Destiny 2</em>, <em>Hitman</em>, <em>PUBG </em>and<em> Super Bomberman R Online</em>.</p><p id=\"51qqK5\">If you pay Microsoft for Game Pass Ultimate<strong>,</strong> I’d definitely recommend giving <strong>Xbox Cloud Gaming</strong> a go, too. <a href=\"https://support.microsoft.com/en-us/topic/xbox-cloud-gaming-in-microsoft-edge-with-steam-deck-43dd011b-0ce8-4810-8302-965be6d53296\">It’s a lengthy setup process</a>, but when you’re done, it almost feels like a native app with a whole additional library of games, including <em>Halo Infinite </em>and<em> Microsoft Flight Simulator</em>. But Microsoft’s cloud gaming service is a tad laggier than the competition — <em>Dead Cells </em>and<em> Hades</em> felt playable but maybe not as responsive as on my Nintendo Switch, and I wouldn’t play <em>Halo</em> multiplayer that way.</p><p id=\"5hNO0v\"><strong>GeForce Now</strong> has largely the same simple setup process as Stadia, and <a href=\"https://www.theverge.com/22750246/nvidia-geforce-now-rtx-3080-google-stadia-cloud-gaming\">its impressive but expensive RTX 3080 tier</a> is incredibly responsive, too. If you told me its copy of <em>Fortnite </em>was running natively on the Steam Deck, I’d probably believe you. But Nvidia’s web client and / or the Chrome browser need work: not only do they not detect the Deck’s gamepad, but the login fields also wouldn’t properly detect the Deck’s virtual keyboard, and I had to stab the touchscreen to get past prompts before games would fully load. GeForce Now refused to launch for me in Microsoft Edge, even though it claims to support it.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/abrM16Ear7D9h-gepjdUpmUgR3Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23352340/fortnite_steam_deck_gfn.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Fortnite on a Steam Deck, via GeForce Now.</em></figcaption>  </figure></div><p id=\"4JLRHM\"><strong>Steam In-Home Streaming</strong> lets you sling your games from any gaming PC to another over your home network, and it works beautifully on Deck with two annoying quirks: you’ll need to set the Deck and / or your streamer PC to send higher resolution video (because by default, it looks <em>real bad</em>), and you can’t properly map the Deck’s controls because Steam In-Home Streaming still uses the old controller configuration interface. For gamepad-first games like <em>Elden Ring</em>, it’s OK, but I really miss the Deck’s gyroscope for games where I have to aim. </p><p id=\"KbMQKz\">Oh, and don’t forget to turn off the Deck’s built-in framerate limiter, which can make these streaming services artificially choppy. I learned that the hard way. </p><div class=\"c-float-right c-float-hang\"><aside id=\"AFwNWP\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to play Steam games in any room of your house\",\"url\":\"https://www.theverge.com/22962051/steam-games-remote-play-windows-ios-android-macos-streaming\"}]}'></div></aside></div><p id=\"RGKPT4\"><strong>Can you stream from Steam Deck to another PC? </strong></p><p id=\"R39bDX\">Yes! If you want to stream your Deck to a shitty laptop that happens to have a larger screen, that totally works. It’s way uglier than just plugging the Deck into a monitor, though, particularly since you don’t get AMD’s fancy FSR upscaling. </p><p id=\"wKXuiK\"><strong>Sounds like there’s a mountain of games to play on Deck and more all the time. What’s the issue?</strong></p><p id=\"zkpPGX\">One month ago, the Deck was a buggy mess — and while I think it’s getting better, I still run into issues almost every day. </p><p id=\"wnAfAB\">Sometimes the Wi-Fi just drops out. It’ll often forget to reconnect after waking, too, and always asks me for the Wi-Fi password even though the Deck has it saved. The last time I tried to connect to a new Wi-Fi network, it wouldn’t recognize the input from the Deck’s own virtual keyboard. Sometimes it won’t reconnect to the Steam servers until I completely reboot the system. Occasionally, it won’t recognize my USB-C hub until I reboot the Deck. A few times (including today), it’s refused to fully power on without a hard reboot. I’ve had a handful of crashes and freezes, including one that Valve introduced when it rolled out a new way to install the Chrome browser that wasn’t ready.</p><p id=\"6LxSxe\">Last I checked, Bluetooth audio was still too laggy for me to use in games, and the auto-brightness adjustment still doesn’t work. And though you’ve been able to launch multiple apps simultaneously since launch, it doesn’t work for multiple <em>games</em>: each app continues to run simultaneously, audio and all, consuming processing power instead of pausing. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/totHLXkF6qaK56CRlt1E_OEF0b4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270013/vpavic_220210_5030_0093.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>Power and I/O.</em></figcaption>  </figure></div><p id=\"jNAJ8W\">My Deck is also often confused about what it does and doesn’t have patched after I wake it from sleep — there’ll always be a handful of patches for my Steam library<em> </em>every time I wake the Deck, and some of them look suspiciously similar. I downloaded a 654.6MB patch for <em>Halo: The Master Chief Collection</em> three times in two days, for example. The Deck also still refuses to move some games between the SD card and internal storage.</p><p id=\"TrAI4s\">A lot of games also refuse to use the Steam Deck’s full 1280 x 800 screen resolution, forcing themselves to run at 1280 x 720 instead, which makes the Steam Deck’s big bezels look even bigger. <em>Elden Ring</em> is one of those games.</p><p id=\"EFScHp\"><strong>Those... don’t seem great. Is Valve fixing any of this?</strong></p><p id=\"B4UtQj\">I’m a little bummed that some of the issues I pointed out in my review are still kicking around a month later, but Valve is indeed issuing lots of patches — <a href=\"https://store.steampowered.com/news/collection/steam/?emclan=103582791470414830\">nearly a dozen since launch, read their changelogs</a> — and I’m pretty sure I’m seeing fewer big crashes and slightly smoother UI than before. </p><p id=\"zaUgbc\">Valve’s added a few new features, too: you can now see which games your friends are playing, set the framerate limiter to 15 fps instead of just 30 or 60, there’s an added average-FPS-only overlay that doesn’t block as much of your game, and a “return to gaming mode” button on the Linux desktop that pops you back into Valve’s controller-friendly interface.</p><p id=\"8Czqh2\">Oh, and though I complained about patches coming <em>too</em> quickly during the review period and introducing new bugs, that’s not (<a href=\"https://www.theverge.com/2022/3/1/22956866/valve-steam-deck-stick-drift-replacement\">quite)</a> as much of a problem anymore: you can now choose from “Stable” and “Beta” update channels from the system menu. </p><p id=\"Dqe5wA\"><strong>Why not just </strong><a href=\"https://www.theverge.com/2022/3/10/22971108/valve-steam-deck-windows-runs-drivers-no-support\"><strong>install Windows</strong></a><strong> and make the problems go away?</strong></p><p id=\"qBseno\">Ha, afraid it doesn’t quite work that way!</p><p id=\"EgfnJz\">I tested Windows 10 on Deck for a week, and I found it a worse experience in almost every way, due to unfinished drivers, games that wouldn’t launch properly, similar or worse performance to Linux, and a complete lack of features to make Windows comfortable on a 7-inch portable gaming PC. </p><p id=\"7u2iTw\">I’d launch a demanding game like <em>Red Dead Redemption 2</em> or <em>Cyberpunk 2077</em> and sometimes find it would bluescreen or tell me it wasn’t properly installed or launch at an incredibly low resolution and / or ignore my attempts to fullscreen the game. With games that did work reasonably well, like <em>Shadow of the Tomb Raider, </em>the framerate wasn’t any better — and in <em>Elden Ring</em>, where it did seem to be a minuscule 1-3fps faster, it also <a href=\"https://arstechnica.com/gaming/2022/03/how-valve-made-steam-deck-the-first-pc-to-smoothly-run-elden-ring/\">came with some nasty hitches</a>. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fVTraRw-m6QsbxnVIL2_U0_DfiE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23352345/sean_hollister_20220310_181931.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>I installed Windows on the Steam Deck and lived to regret it.</em></figcaption>  </figure></div><p id=\"7pmOqf\">And while worst-case battery life seems similar — I got two hours of demanding games, same as with Linux — there’s no Gamescope or similar performance overlay to let you fine-tune the battery vs. performance equation here. It’s one of the best things about the Steam Deck, but Valve’s Greg Coomer told me there’s currently no plan to add anything like that on the Windows side of things. Given that we’ve gone two weeks without an audio driver (the speakers and headphone jack still don’t work on Windows), I wouldn’t hold my breath.</p><p id=\"3uMnkh\">I also had a whole bunch of glitches just navigating around Windows, with disappearing cursors and randomly popping-up Steam virtual keyboards. Brightness adjustment is finicky, too. (There was also a major issue with writing data to SD cards on Windows, though <a href=\"https://help.steampowered.com/en/faqs/view/6121-ECCD-D643-BAA8\">a new SD card driver</a> appears to fix it.) </p><p id=\"w00U7W\">Oh, and you’ll have to wipe your Deck if you want to install Windows on the internal SSD because there’s no dual-boot installer yet. </p><p id=\"zUIBqV\">If you’re looking for a Steam Deck alternative built for Windows, my colleague Sam Byford <a href=\"https://www.theverge.com/22972334/aya-neo-next-review-vs-steam-deck-windows\">recently reviewed the (comparatively pricey) Aya Neo Next</a>.</p><p id=\"Z4FUb7\"><strong>How easy is it to swap the Deck’s internal SSD, anyhow? Or are SD cards good enough? </strong></p><p id=\"mjVtGY\">I’m hoping to answer this question more fully when I get my own 64GB model in Q2 (with its slower eMMC storage), but I’ve already got some pretty strong feelings about this — I <em>have </em>found myself running into issues with SD cards, and replacing the SSD isn’t <em>quite </em>easy enough for me to recommend just anyone do it.</p><div class=\"c-float-right c-float-hang\"><aside id=\"U0HS0p\"><q>Patching big games on SD can be painful</q></aside></div><p id=\"8stxnn\">Early reviews showed that <em>game load times</em> aren’t that different between the SD card and an internal SSD, and that’s been my experience, too, save a few outliers like first-time loads for <em>Red Dead Redemption 2</em> and <em>Deathloop.</em> </p><p id=\"Clo2ru\">But <em>writing</em> games and patches to an SD card is a whole different story — and the difference between an SD card with 10MB/sec or 30MB/sec or 50MB/sec sustained write speeds and a true NVMe SSD might mean hours of your life. When <em>Elden Ring</em> recently needed to update every nook and cranny of its 50GB install on my 400GB SanDisk Ultra card, downloading and patching and verifying, it took 45 minutes before I could play. It happened again with the next patch, too, and I’ve seen that on a different game as well.</p><p id=\"XyJ1Ts\">And while it’s pretty neat how you can swap out entire SD cards full of games like they were a Nintendo Switch cartridge, I think it’s worth noting that I’ve put three microSD cards into the Deck that no longer work. They worked fine before; they started behaving weirdly with the Deck, I formatted them there, and now they don’t work anymore. I don’t mean to scare you — it could be those bad Windows drivers or user error, and some of my other cards work fine. But I’m <a href=\"https://www.reddit.com/r/SteamDeck/comments/tkqwqt/so_this_is_their_solution_for_sd_card_that_can/\">not the only one with that story</a>, and I am one of the few people outside Valve who have been hammering the Deck with a wide variety of microSD cards for well over a month. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RXRigYHqulqsBiC5sTdIeMCGf1k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23352346/sean_hollister_20220310_173828.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Inside the Steam Deck.</em></figcaption>  </figure></div><p id=\"Cyc8qR\">If you know what you’re doing, it’s actually quite easy to swap the internal SSD: just eight case screws, unsnap the case, three internal screws and a bit of foil tape to remove the internal shield, one last screw to get at the M.2 drive, then swap your own single-sided<em> </em>M.2 2230 drive in. (You can find small capacity drives cheap on eBay and Amazon: $40 for 256GB.) But some teardowns skip over the “unsnap the case” part, and that can be a little daunting — there are a lot of potentially fragile plastic clips in there, and you’ve gotta gently but firmly shove a plastic tool into the edge of your Deck to pry them open. (If you use a metal screwdriver, you might damage them.) I managed it OK twice, but I can see <a href=\"https://www.theverge.com/2021/10/6/22713075/valve-steam-deck-teardown-repair-open\">why Valve warns people away.</a></p><p id=\"4dmazh\"><strong>What about external USB drives?</strong>\t</p><p id=\"l7Mxuc\">For whatever reason, the Steam Deck’s gaming mode only recognizes the internal SSD and a single microSD card right now, but you can mount whatever you want on the Linux or Windows desktop. I was able to set up a Steam Library on an external NVMe SSD and download games to it incredibly quickly. </p><p id=\"STHArk\">But you’ll need to plug in sufficient power for that drive, too — I actually burnt out that NVMe drive by relying on the Deck’s own USB-C bus, which can only supply 7.5W for peripherals. No warning, just poof, no more working drive. If you’re using a USB-C hub with a Power Delivery input, you should be able to prevent that by plugging in external power or using an external drive with its own power supply.  </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7d1tUoxZSPv_TdDQ7TPd-G-N44k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23352347/sean_hollister_20220310_174316.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Here’s the M.2 slot, with one last screw holding in the internal drive.</em></figcaption>  </figure></div><p id=\"eGXQkc\"><strong>What size and speed of storage do you recommend?</strong></p><p id=\"ts4AN8\">Even with a 512GB Steam Deck review unit and a 256GB SD card, I felt like storage was filling up pretty fast with a handful of 30GB, 50GB, and the occasional 80GB and 100GB game. But with a 400GB card, I’m feeling pretty comfortable with a huge library of games. If you’re looking to mostly carry around older or less graphically intensive titles, you might be able to get away with quite a bit less. </p><p id=\"ILzpFu\">Personally, I bought a cheap 256GB SSD and a 512GB card to swap into my 64GB eMMC Deck when it arrives, and I’m thinking that between those and the 400GB card, I’ll have plenty of room for everything I want to take on the go. </p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RkvTdXUzOA7j0g9NJ1cN2eBjcd0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23352348/sean_hollister_20220310_174652.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>You’ll want an M.2 2230 drive that has storage modules on one side of the board only, like this  $20 128GB Samsung PM991A.</em></figcaption>  </figure></div><p id=\"PvOwNc\"><strong>Can I backup games from my Windows machine and play them on the Deck? </strong></p><p id=\"FmcTgE\">Both Windows and Linux read the NTFS filesystem just fine, so I formatted my external drive that way, and the Deck’s SteamOS was able to read my backups there — but it took so long to decompress and install one that I’d have been better off downloading from scratch. </p><p id=\"sGxqUX\">Valve’s Lawrence Yang says another way is to copy your steamapps folder to the root of a microSD card formatted for Steam Deck, but you’d need a good way to write to the ext4 filesystem: “We have ideas for improving this in the future, but for now, the best way to get games on Deck is to download them directly via Wi-Fi (or Ethernet if you have an adapter).” </p><p id=\"DHIrOo\"><strong>What’s the pick-up-and-play experience like between a Steam Deck and another PC? </strong></p><p id=\"TtXzkv\">You can’t just suspend the Deck, sit down at your Windows desktop, and be playing exactly where you left off quite yet. </p><p id=\"mWTyFO\">While the Deck has an (awesome) instant suspend function of its own, it doesn’t necessarily save your game to the cloud when you put it to sleep — <a href=\"https://www.theverge.com/22779252/steam-deck-things-we-learned-from-valve-developer-summit#:~:text=VALVE%E2%80%99S%20CHANGING%20HOW%20CLOUD%20SAVES%20WORK%20SO%20YOU%20CAN%20PICK%20UP%20AND%20PLAY\">that’s the idea</a>, but developers would have to take advantage of Valve’s new cloud APIs. </p><p id=\"Maphka\">In the meantime, you’ll either see a lot of messages like this: </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cS3rYZulxB1NiL2ewIpg_jaO-Sc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23351662/elden_ring_sync.jpg\">      <cite>Screenshot by Sean Hollister / The Verge</cite>      <figcaption><em>You’ll see a lot of these messages if you try to swap between Deck and desktop without quitting out of games.</em></figcaption>  </figure><p id=\"lckI6T\">Or you’ll need to save and quit a game before you pick it up on the other end. </p><p id=\"iQpnKI\">Or, if you’re home, you can just stream your desktop game to the Deck, then use your desktop’s mouse and keyboard when you get there. </p><p id=\"Lmtby9\"><strong>The SD card slot doesn’t have a cover... does it just... pop out?</strong></p><p id=\"xkGjUi\">It’s one of those little mechanical doohickeys where you push it in, then it pops out. I don’t think there’s much danger of it falling out on its own, but I’ve definitely had it miss my thumbnail on the way out and shoot across the room. A cover might be nice on future models. </p><p id=\"Mbt7AI\"><strong>Why not just turn down the fan curve so it’s less noisy?</strong></p><p id=\"wDDcqp\">That’s not something that Valve or AMD are letting users adjust quite yet — on Windows, none of the sensors are exposed to apps like MSI Afterburner, either. </p><p id=\"CSqleZ\"><strong>Does the screen break if you drop it? </strong></p><p id=\"VoMn3U\">That’s not one I’m going to test because the Deck’s in short supply, but I did accidentally drop my phone <em>onto</em> the Deck and left a nasty scratch. I only see it when the screen’s reflecting light right back at me, thankfully. </p><p id=\"0Kb4zM\"><strong>Can it get dim enough for a dark room? Bright enough for outdoors?</strong></p><p id=\"dPtfNT\">Like <em>LinusTechTips</em>, I’m really pleased with the range of brightness on the screen. I play a bunch of games late at night, and it’s important not to wake the wife. It<em>’</em>s <em>nowhere near</em> as vibrant as an OLED screen, so we’re talking about a pretty washed-out gray image at the lowest brightness levels, but it’s comfortable for low-light gaming. </p><p id=\"oXV1Nz\">Even with the anti-glare treatment, it doesn’t get bright enough to play in direct sunlight, but I found it fine for indirect light with games that aren’t terribly dark. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VVkrC2TISxbUpsAO68U0fwirVPU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270011/vpavic_220210_5030_0091.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The face buttons rattle a bit, but I find it comforting.</em></figcaption>  </figure></div><p id=\"cbbbsh\"><strong>How do all the controls feel — and I mean </strong><em><strong>all the controls</strong></em><strong>, don’t skip any!</strong></p><ul><li id=\"yeY5ow\">The joysticks feel fantastic to me, as high-quality as the latest Sony and Microsoft, except for two things — they’re a little taller than usual, presumably so your palms don’t brush the touchpads, and occasionally, I can feel them brush against the unusual ribbon cables they have inside to power their capacitive touch sensors. Both things are weird at first but very manageable. Ditto the smooth tops of the sticks. Like every modern gamepad, each stick clicks in to become its own button, too</li><li id=\"iRviy0\">The analog triggers have a nice long, smooth throw, way better than Switch, though they feel a little hollow and only have a single physical stage — you can set a threshold for the second stage and add some basic vibration, but nothing even close to <a href=\"https://www.theverge.com/21562206/ps5-dualsense-controller-review-games-features-vibrations\">what Sony’s DualSense</a> can manage</li><li id=\"QA3m3c\">The bumpers are a little weak, IMO. Reaching up to activate them feels weird, and the way they waterfall into the triggers just makes my fingers want to slip off and hit the triggers instead. A month in, I’m finding myself binding bumper commands to the triggers or grip buttons just so I can avoid them</li><li id=\"wVruDR\">The grip buttons have VERY little throw and take a bit of force to press, which is nice for buttons you can hold without accidentally pressing them all the time and less nice if you imagined yourself holding those buttons down or hammering them repeatedly. I use ‘em for quick jumps and parries and grenade throws and force powers and things</li><li id=\"ITIRRZ\">The ABXY, start, and select face buttons have slightly loose, rattling tops on my unit, not unlike those on an Xbox 360 gamepad, but much more than most modern controllers. I actually like the old-school sound</li><li id=\"rd1URy\">The D-pad is a little squishy, with a low pivot point, fully rollable, fine, but nothing to wax poetic about (but I prefer sticks anyhow)</li><li id=\"4PZWyU\">The “STEAM” and “...” quick access buttons are extremely, annoyingly shallow for me, hard to tell when you’ve successfully pressed them</li><li id=\"OzeRC8\">The volume up and down buttons are firm but with a very solid, obvious, individual press and responsive physical that makes them easy to use</li><li id=\"UGflxl\">I’d describe the power button the same as the volume buttons, just shallower</li></ul><p id=\"AZvHgf\">One month later, I still feel like almost all the controls are in the right places for me and my average-sized hands — but I’ve soured on the bumpers a bit, and I still feel like the touchpads only fit when I tilt the screen parallel to the ground. But I don’t really mind since I’m mostly using the Deck’s gyro aiming when I want precision control.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ymX8qjgOAqsOU06UZ3eduGQ5W8w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23352300/prototypes01__1_.jpg\">      <cite>Image: Valve</cite>      <figcaption><em>Valve went through quite a few prototypes while settling on the design.</em></figcaption>  </figure></div><p id=\"1ORFZ7\"><strong>Does the Deck work for people with small hands?</strong></p><p id=\"4sCLC6\"><a href=\"https://www.engadget.com/steam-deck-review-small-hands-180026719.html\">Jessica Conditt at <em>Engadget </em>wrote about that</a>, and it sounds like it could be a problem. </p><p id=\"3Ekgvk\"><strong>Didn’t I hear something about joystick drift, too?</strong></p><p id=\"6z3wcl\">That was actually <a href=\"https://www.theverge.com/2022/3/1/22956866/valve-steam-deck-stick-drift-replacement\">a bug Valve introduced</a>, and it’s already fixed.</p><p id=\"d2sSSe\"><strong>There’s no fingerprint sensor. Is there any other way to lock it? </strong></p><p id=\"tYkhH6\">Weirdly, no. Once you enter your password to log into the system the first time, there’s no login or password check or two-factor to type in thereafter. Makes it really easy to resume games inside your house, though. </p><p id=\"2QkAlX\"><strong>Can you connect a second controller for local multiplayer?</strong></p><p id=\"6EcYo2\">Yep — and not just two! The Steam Deck lets you mix and match loads of different external controllers over USB and Bluetooth. As an example, I just fired up a four-player session of <em>Speedrunners</em> with one PS4 controller over Bluetooth, two Xbox 360 controllers plugged in to <a href=\"https://www.theverge.com/22244488/gaming-gear-recommendations-favorite-nintendo-logitech-microsoft#:~:text=MICROSOFT%20XBOX%20360%20WIRELESS%20RECEIVER%20FOR%20WINDOWS\">the ancient-but-amazing</a> Wireless Receiver for Windows, plus the Steam Deck’s internal pad. Plug that into a TV, and you’ve got a killer couch gaming session. </p><p id=\"oPZioW\">And because the Steam Deck itself can emulate both mouse and keyboard and gamepad simultaneously, you could technically get some two-player games working on a single Steam Deck with no additional controls. I started building a controller profile for <em>Towerfall</em> that lets two people play one-handed, one on each side of the Deck.</p><p id=\"RmBuKg\"><strong>Can you connect a VR headset or an external graphics card?</strong></p><p id=\"lAmYZi\">Valve doesn’t support either of them, but VR is technically possible with Windows — <a href=\"https://www.youtube.com/watch?v=Zmg-Lc-byAs\">here’s Chinballs Gaming</a> playing what looks like an absolutely terrible session of <em>Half-Life: Alyx</em> with an Oculus Quest 2 plugged into the system.</p><div class=\"c-float-right c-float-hang\"><div id=\"Oput81\"><div ><iframe src=\"https://www.youtube.com/embed/Zmg-Lc-byAs?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"t7smeX\">Someone will probably hack an eGPU onto the Deck by tapping into the PCIe slot, but it’ll also probably defeat the purpose of having a portable console.</p><p id=\"pyBtfW\"><strong>How’s the virtual keyboard, and is typing to someone a chore? </strong></p><p id=\"soJVW4\">Valve has a new, fairly barebones virtual keyboard on the Steam Deck, and it’s not terrible — solid haptic and audible feedback when you stab a key, a full number row, and you can navigate it with the analog stick or D-pad if you don’t want to grease up your screen. But if you do want something better than hunt-and-peck and a bank of emoji, you’re out of luck for now. There’s no swipe typing, no autocomplete suggestions, and Valve’s awesome <a href=\"https://www.youtube.com/watch?v=V1wYD_sb0wU\">dual-touchpad Steam Controller keyboard</a> isn’t available outside of the Linux desktop mode.</p><p id=\"608sSl\">On the plus side, the Steam Deck makes it super easy to fire up a quick Steam voice chat. </p><p id=\"hpzse9\"><strong>How’s the touchscreen in general?</strong></p><p id=\"TQzFcM\">It’s plenty serviceable, given the price, but a far cry from what we expect on a flagship smartphone or tablet these days. Part of that’s down to the SteamOS interface, which just doesn’t respond instantly to any kind of input, let alone a tap. But I’d also find myself missing small touch targets on the desktop and have to stab again and again. I stick with the joysticks when I can. </p><p id=\"rw1P7x\"><strong>Do Android games work?</strong></p><p id=\"h9fG2H\">I haven’t dug into this myself yet, but ETA Prime shows it’s at least possible through emulators, getting playable performance out of a bunch of top Android games <a href=\"https://www.youtube.com/watch?v=htjOkII-oZc\">in this YouTube video</a> — though he did have difficulty mapping some of the controls to the Steam Deck’s gamepad in titles like <em>PUBG Mobile</em>. </p><p id=\"ot99Iy\"><strong>Can I binge my shows on Deck?</strong></p><p id=\"nvIqMg\">Netflix and YouTube definitely work via the Chrome browser once you’ve got that installed, and you can easily set up a Chrome profile just for those for easy access via Steam. I haven’t checked other streaming services yet. </p><p id=\"hexzxw\">VLC and Kodi also both have Linux clients in the Discover store, and Plex has a third-party client there, too. I haven’t gotten around to setting up my NAS yet, but I’ll let you know when I do.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q5O-eq9QKMb78BghXX9PceVCkGY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270014/vpavic_220210_5030_0094.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>No kickstand on this Switch-shaped portable.</em></figcaption>  </figure></div><p id=\"qvQ8bd\"><strong>Does the Deck have a kickstand?</strong></p><p id=\"s5FvsE\">No, and not a day goes by that I don’t wish it did, partly because of Netflix and partly because you still have to leave the screen on while installing games. (Connected standby is on Valve’s roadmap but hasn’t been implemented yet.)</p><p id=\"pPpL69\"><strong>Where’s the Steam Deck Dock? </strong></p><p id=\"wsHU6K\">We’re still waiting to find out: <a href=\"https://www.theverge.com/2022/2/23/22947985/valve-steam-deck-dock-launch-details-order-time\">Valve delayed it till “late spring.”</a> You can use your own USB-C hub in the meantime, though I’ve heard dual-monitor ones don’t yet work. </p><p id=\"ZA7use\"><strong>Can you buy screen protectors for it?</strong></p><p id=\"1CE6OY\"><a href=\"https://www.amazon.com/s?k=steam+deck+screen+protector\">Yes.</a> There’s a handful of protective cases, too, but I haven’t tried them yet.</p><p id=\"cliciv\"><strong>What’s that USB cable in your review, the one with the built-in screen?</strong></p><p id=\"FofGQU\"><a href=\"https://www.theverge.com/2022/1/28/22907150/usb-c-pd-cable-power-meter-100-watt-power-delivery\">It’s this!</a> Came in super handy while testing how quickly the Steam Deck charges its battery.</p><p id=\"xQhdVE\"><strong>Speaking of batteries, can you use an external battery pack?</strong></p><p id=\"TccKmj\">Absolutely, but you’ll want to be careful which one you buy. I’ve got a 15,000mAh, 54Wh, 20W PD battery that can get the Deck from 0 percent to 90 percent just fine — but only while the Deck’s turned off. If you’re hoping to play and charge at the same time, you should really look for a 45W PD battery or better — the same amount Valve’s own AC adapter puts out. </p><p id=\"bbYVYS\">The Deck will only draw as much as you need, so it doesn’t hurt to go over. I’m primarily using a 100W PD battery myself, even if that’s a bit overkill.</p><p id=\"szlOQv\"><strong>How often do you actually need to use Linux, and how hard is it? </strong></p><p id=\"JACVbf\">I’m a Linux n00b myself, and I’ve been pleasantly surprised! Word is that Valve’s chosen Arch Linux and KDE Plasma desktop are among the more Windows-like options anyhow, and it’s extremely easy to download apps from the Discover package manager, navigate the Dolphin file browser and play around with desktop settings, like setting up a second monitor.</p><p id=\"mZEboh\">That said, I did most of my navigating with a physical keyboard plugged in because KDE doesn’t seem to have a decent virtual one — and the way Valve segregates the user and system data, you’ll probably only want to install Flatpak applications from the package manager unless you know what you’re doing.</p><p id=\"9tfBEG\">But if you just want to play Steam games, you’ll never need to touch the Windows desktop, and a few brief trips are enough to get emulators, browsers, and cloud gaming platforms up and running. <a href=\"https://help.steampowered.com/en/faqs/view/671A-4453-E8D2-323C\">Here are Valve’s tips on how to use the Linux desktop</a>, including how to sudo.</p><p id=\"mLWmaw\"><strong>Can you work from the Deck?</strong></p><p id=\"R3Gz7J\">I did it for a day and mentioned it in my review — if you work on the web, like me, it’s not particularly hard as long as you’ve got an external monitor and keyboard. Some are pushing it further just because they can: <a href=\"https://www.youtube.com/watch?v=ozqDg9FpjlY&amp;feature=share\">here’s a video of Maya and Blender on the Deck</a>. </p><div><div id=\"O6HtXI\"><div ><iframe src=\"https://www.youtube.com/embed/ozqDg9FpjlY?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"aL2O9E\">I wouldn’t necessarily recommend anyone buy a Steam Deck as a work PC — while it might be the most potent complete computer you can buy for $400, I think you’d need to be deep into Linux to get the most out of it. </p><p id=\"yoJtod\"><strong>Can you record and stream games from the Deck?</strong></p><p id=\"h8Ro9V\">OBS Studio came out with its own flatpack Linux app <a href=\"https://www.gamingonlinux.com/2022/02/obs-studio-272-is-out-bringing-flatpak-support-and-much-more/\">just last month</a> and has <a href=\"https://store.steampowered.com/news/app/1905180/view/3091164432526320493\">now made its way to Steam</a>, so perhaps... it’s on my list of things to try <a href=\"https://twitter.com/StarFire2258/status/1503515402017533953\">now that I finally have a worthy internet connection</a>.</p><p id=\"YjuqXe\"><strong>Can you take screenshots? </strong></p><p id=\"AECkAA\">Yep, there is a built-in shortcut: <strong>Steam</strong> + <strong>Right Bumper</strong>. They’re not the easiest to share, though — you can upload them to your Steam Profile and Activity Feed, but if you want to fling ‘em to social media or a thumb drive, you’ll have to go hunt down the game folder in the Linux filesystem in desktop mode. </p><p id=\"HsONZc\"><strong>Any other handy shortcuts?</strong></p><ul><li id=\"TUiOf1\"><strong>Steam</strong> + <strong>Left Bumper</strong> is a built-in magnifier that works in any game</li><li id=\"5nzxCA\"><strong>Steam</strong> + <strong>Up / Down</strong> on the thumbstick raises and lowers screen brightness</li><li id=\"7mY5X0\"><strong>Steam</strong> + <strong>hold down B</strong> can force-close a misbehaving game</li><li id=\"swwVvP\"><strong>Steam</strong> + <strong>joystick or trackpad</strong> instantly gives you a mouse cursor whenever you need one, overriding your other controls</li><li id=\"xcKb5d\"><strong>Steam </strong>+ <strong>Left D-Pad</strong> is the escape key (handy for quitting out of fullscreen browser apps)</li><li id=\"Gr1LgX\"><strong>Steam</strong> + <strong>Right D-Pad</strong> is enter </li><li id=\"GNErvk\"><strong>Long-press Power</strong> to get to the power menu (sleep, shutdown, restart, switch to desktop)</li><li id=\"ZmlHGL\"><strong>Volume Down</strong> + <strong>Power</strong> (when powered off) to get to the boot manager</li><li id=\"B9NYOC\"><strong>Volume Up</strong> + <strong>Power</strong> (when powered off) to get to the BIOS</li></ul><p id=\"HiccX5\">Oh, and as <a href=\"https://twitter.com/RyTron/status/1508873522273259522\">RyTron on Twitter points out</a>, you can actually activate these with the “...” button instead of the Steam one. “Great for quick dimming the screen without needing to be a contortionist,” he says, and it’s true!</p><p id=\"k08HdH\"><strong>Will developers actually optimize games for the Deck?</strong></p><p id=\"yHAHOE\">I really think they might! I wasn’t sure Valve would sell enough of them at first or make enough of a splash, but the community’s more enthusiastic and vocal than I’ve ever seen for a non-Nintendo, non-Sony handheld. Some developers are already on board, too: for instance, the <em>Cyberpunk 2077</em> team is working on a Steam Deck-specific graphical setting, <em>Valheim’s </em>developers <a href=\"https://twitter.com/jsmars\">tweaked a few things</a>, and I’ve heard that <em>Fall Guys</em> may not stay incompatible with the Deck for long. </p><p id=\"AsHgeA\"><strong>Are you still having fun? </strong></p><p id=\"Vjm0Uk\">Absolutely. Even if the Steam Deck doesn’t wind up fulfilling all my portable PC gaming dreams, it’s one of the coolest gadgets in recent memory — and a fantastic way to get in bite-size game sessions on the couch while my wife and I binge television.</p><p class=\"c-end-para\" id=\"ZKYP0k\">If you’ve got other worthy questions about the Deck, please leave ‘em in the comments below! I’ll try to answer the best ones in a future update to this post.</p><p id=\"9VAH6H\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-7Q0D4kLSaNGZSGasLoAt838zSk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270010/vpavic_220210_5030_0090.jpg",
  "description": "If we don’t cover it here, just ask.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}