{
  "title": "Steam Deck review: it’s not ready",
  "url": "https://www.theverge.com/22950371/valve-steam-deck-review",
  "date": "2022-02-28T15:03:35.000Z",
  "author": "Sean Hollister",
  "content": "  <p>Early access memories</p> <p class=\"p--has-dropcap p-large-text\" id=\"xUSPY2\">Both of these things are true:</p><p class=\"p-large-text\" id=\"XyPeUz\">First, I’m having more fun with the Steam Deck than any gadget I’ve tested in years.</p><p id=\"958H6e\">Second, the Steam Deck is a <em>mess</em>. It’s rushed, unfinished, buggy, and unstable. If Valve sold the console I’ve been playing at Best Buy or GameStop, people would return it in droves.</p><p id=\"C0QC5t\">Of course, Valve <em>isn’t</em> stocking this $400 handheld gaming PC at Best Buy. The maker of <em>Half-Life</em> and <em>Portal</em> is trickling it out directly to devout fans of Steam, the platform that pioneered the idea of selling “early access” games before they’re actually complete. Remember when Valve let an unknown developer sell a broken, buggy game called <em>PlayerUnknown’s Battlegrounds</em> in early access? It changed the world. The bugs didn’t outweigh the fact that its unproven formula was uniquely fun — to the point that <em>PUBG</em>, its clones, and the games it inspired (including <em>Fortnite</em>, <em>Call of Duty: Warzone</em>, and <em>Apex Legends</em>) rank among the most popular titles around the globe.</p><p id=\"vRBvjs\">The Steam Deck has a unique formula, too. It’s a Linux computer that plays Windows games like a Nintendo Switch with unheard-of bang for the buck. And just like <em>PUBG</em>, a game I played for 452 hours despite glitches, I can’t get enough.</p><p id=\"HjTSl0\">Welcome to the early access game console. There will be bugs.</p><div id=\"iYkp9H\"><div data-anthem-component=\"scorecard:11066696\"></div></div><p class=\"p--has-dropcap\" id=\"fN4jSs\">Let’s get one thing out of the way: it’s easy to look at pictures of the Steam Deck, see a Nintendo Switch, and imagine yourself magically playing a gigantic library of PC games that “just work” without messing with graphics settings or controls. </p><p id=\"EvWN7B\">That’s <em>not</em> the Steam Deck that exists today — and not just because the Steam Deck is an absolute <em>chonk</em> that can practically fit a Switch between its grips. (It reminded me a little of Darth Vader’s Star Destroyer swallowing Princess Leia’s Tantive IV.) No, today’s Steam Deck expects you to tweak more and forgive more than your average PC, not less.</p><p id=\"yMoqp0\">But for me, the magic of Steam Deck is this: it makes PC gaming truly <em>portable</em> for the first time ever.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lEMz-P8XIDqEimP9cmhvEPmWGHo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269999/vpavic_220210_5030_0028.jpg\">      <figcaption><em>You can almost fit a Nintendo Switch under there.</em></figcaption>  </figure></div><div class=\"c-float-right c-float-hang\"><div id=\"ceidUW\"><div data-anthem-component=\"aside:11067107\"></div></div></div><p id=\"FLxSjG\">What do I mean? Last year, I borrowed a then-state-of-the-art <a href=\"https://www.theverge.com/circuitbreaker/2021/1/18/22237379/aya-neo-gpd-win-3-nintendo-switch-gaming-pc-handheld-specs-comparison\">Aya Neo handheld gaming PC</a> and managed to play through <em>Persona 4 Golden</em> on that $800-and-up Windows machine. But it never quite <em>felt </em>like PC gaming to me. I could barely navigate the OS with its joysticks and touchscreen, there wasn’t enough performance to competently play even moderately demanding games like <em>Outer Wilds</em> and <em>Valheim</em>, there were no precision controls for shooting or point-and-click titles, and there was no point in bothering with anything but the lowest graphical settings. (There was also no way to quickly and reliably suspend the system without losing progress.)</p><p id=\"MqpXNN\">The Steam Deck turns all that on its head. Starting at just $400, its custom AMD chip with RDNA 2 graphics instantly outstrips every boutique portable gaming PC on the market. While you might still struggle with the very latest titles, it’s got enough oomph that I’m playing <em>Control</em> and the <em>Resident Evil 2</em> remake at a smooth 60 frames per second outside of big fights, and I can even turn the graphics up if I’m willing to accept 30fps instead. Older or less demanding games can easily run on their highest settings, like <em>Max Payne 3</em> or <em>Mirror’s Edge</em>.</p><p id=\"I4sH0r\">And if the game you’re playing really doesn’t need the juice — say <em>Hotline Miami </em>or <em>Nidhogg</em> — you can throttle the frame rate, GPU clockspeed, or even the processor wattage to prolong the Deck’s battery life. It only takes three taps, and the awesome <a href=\"https://github.com/flightlessmango/MangoHud\">open-source MangoHud overlay</a> gives you instant feedback on your frame rate, clockspeeds, frame times, even how quickly you’re draining the battery and how long it’s likely to last. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/o0yKHUo1C97LadqCT2p-8IyOfQw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270006/vpavic_220210_5030_0079.jpg\">      <figcaption><em>The joysticks are just slightly taller than I’d like, but they feel great and keep my palms from accidentally brushing the pads. </em></figcaption>  </figure></div><p id=\"dUfa0q\">Okay, you might ask, but all the games I just named have gamepad support — what about the decades of mouse-and-keyboard fare? The Steam Deck lets you borrow or build a dizzying array of custom control schemes that make them feel at home, too. In addition to providing an entire traditional gamepad worth of analog joysticks, triggers, and face buttons — almost all of which feel fantastic, I might add — you also get four rear grip buttons and a pair of Steam Controller pads so customizable, calling them “trackpads” feels like a disservice. You can click, swipe, flick, and “spin” a virtual trackball; press down on their pressure-sensitive surfaces; and even set their edges to continually move or turn your character... and every one of the Deck’s 20-plus programmable controls can issue multiple different commands depending on how and when you press. You can build macros and chorded combinations with other keys and per-key turbo modes, and like I said, it’s dizzying — and Valve barely explains how any of it works.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jPTwaZKmhY26GvgB0ccTvk5CqzY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270426/community_layouts_2.jpg\">      <figcaption><em>Expert controls for Ace Combat...</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/X8IgCE5mp50TDjr94W7HI7RmA18=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270425/gyro_quick.jpg\">      <figcaption><em>...versus basic tweaks</em></figcaption>  </figure></div></div></div><p id=\"c6mDBb\">I wouldn’t be surprised if you’re thinking, “Uh, wasn’t the Steam Controller a flop?” But I’m here to tell you <a href=\"https://www.theverge.com/good-deals/2019/11/26/20984123/valve-steam-controller-discontinued-sale-price\">not only did it have an amazing cult following</a>, the Deck makes it work. The fancy touchpads no longer get in your way if you’re not interested, and you can now get precision aiming without relying on them one bit: just rest your thumb on the thumbstick to activate a gyro so you can tilt the Deck to easily zero in on your target. And while you have the <em>option</em> of spending hours designing the perfect multi-layered control scheme, Valve makes it easy to add that gyro or a few extra grip buttons and go on with your day. </p><p id=\"eISOBl\">With <em>Control</em>, I did both, instantly making myself a crack shot with the railgun revolver while binding back buttons to let me fly into the air and summon a shield of debris without ever taking my thumbs off the all-important sticks. With <em>Slay the Spire</em> and <em>Into the Breach, </em>I simply reduced the “friction” on the virtual trackball so I could easily fling the 2D mouse cursor around. For many games, I often found that a Steam Controller cultist had already uploaded a great controller scheme — I <em>love</em> what Runic did with <em>Torchlight II — </em>and it’s a cinch to take any profile you see, remix it, and share it with the community.</p><p id=\"gFoXLN\">Still, I’m not going to tell you that the Steam Controller is better than my 20 years of muscle memory with a mouse and keyboard, or necessarily a fit for every game. While I’m sure you might be able to swing a mean sword in <em>Mordhau</em> with the right tweaks, the full-forearm motion of a mouse just feels right to me.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RZVernJouXz6YQ6Oy8HFAPzLiLo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270003/vpavic_220210_5030_0054_Edit.jpg\">      <figcaption><em>The screen and speakers are remarkably good for a device that starts at $400. Crisp and clear.</em></figcaption>  </figure></div><p id=\"JsRjDM\">For me, the best part of the Deck is how you can suspend the entire SteamOS session, at any moment, without needing to pause or save. I was about to run out of battery in the middle of a boss fight against a nasty dark demon in <em>Control</em>, but I never lost my place. I hit the power button, and though it took an entire hour for me to get back to a charger, I was able to fire it right back up again and keep on playing.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PAXHuZC_dOdi-oTUgW5u-ANLVxQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270423/fallout_4_mangohud.jpg\">      <figcaption><em>With 25 percent battery remaining, Fallout 4 is drawing 22.6 watts, giving me, at most, 28 minutes before I need to plug in... or I can extend it by throttling frame rate.</em></figcaption>  </figure></div><p id=\"fv71jn\">Speaking of the battery: it’s a weak spot, but it’s not as bad as I feared. I got just under two hours of <em>Control </em>on<em> </em>the Deck at 60fps and around 60 percent brightness, but nearly four hours when I set it to 30fps or in moderately less intensive games. And I never had to wonder how much time I had left or how to extend that battery life because the Deck can instantly report its own total power draw: if you see 20W in MangoHud, you know you’ll get roughly two hours out of the Deck’s 40Wh pack. <em>Control</em> drew 12 watts at 30fps, <em>Max Payne 2</em> drew 10W at 60fps, and<em> Nidhogg</em> drew only 6W. Not all games fit that formula, though; I saw <em>Resident Evil 2</em> pulling over 20W at 30fps, and many games crossed the 24W mark at 60fps. You should know that downloading games at high speed <em>dramatically</em> stresses the system, too, drawing just as much electricity and causing stutter when I tried to play <em>Call of Juarez </em>simultaneously.</p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lsQQ05rqjXcDozVqnMn6BMM8Zvw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270015/vpavic_220210_5030_0096.jpg\">      <figcaption><em>Technically, I tested the $650 model with 512GB of fast storage, an etched anti-glare screen, and a premium case. The anti-glare works, though I don’t have the glossy screen to compare to, and this version doesn’t easily let go of fingerprints.</em></figcaption>  </figure></div><p id=\"wYBBgl\">Those sessions were generally long enough to satisfy me, though I’m the kind of guy who’s never far from <a href=\"https://www.theverge.com/2019/5/1/18410552/laptop-portable-batteries-high-wattage-usb-c-charger\">a high-wattage USB-C PD battery</a>. I’ll also point out that the original Nintendo Switch wasn’t dramatically held back by the fact that it only got 2.5 hours of <em>Breath of the Wild</em> on a charge. But I worry about what happens after a year or two as the battery ages, particularly <a href=\"https://www.theverge.com/2022/2/15/22935171/valve-steam-deck-replacement-parts-teardown-ifixit\">since iFixit shows it’s not easy to remove</a>.</p><p id=\"xB0BAO\">Valve’s Lawrence Yang tells me the battery <em>will</em> be one of the replacement parts on offer, though, and it does take pains to protect it while charging. I never saw the system draw more than 30 watts unless I was playing a game, it dropped to half-speed when it got three-quarters of the way, it trickle-charges the last 10 percent or so, and the last 4 percent took 15 whole minutes to complete. The whole charge takes 2 hours and 45 minutes, and it won’t keep charging forever on the plug: Valve lets it drain to 95 percent after “a long period of time.”</p><p id=\"pqjv2a\">What doesn’t satisfy me is the Steam Deck’s fan. It never stops whining, the ramp-up can be jarring, and while Valve’s designers tell me they’re still optimizing the curve and improving the ramp rate, they say “high end games that max out the APU will likely not see a ton of improvement.” On the plus side, the fan does the job: I never saw the Deck throttle or felt the Deck’s grips or controls get hot.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4ZK0jMQA7bsT23eRgThBTvVHtmM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269998/vpavic_220210_5030_0023.jpg\">      <figcaption><em>I think the screen has too much bezel, and the “Steam” menu button could use a tactile press.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"e0c1rY\">When the Steam Deck works, I finally feel like I can take PC gaming with me. I fire up the new <em>God of War</em> or <em>XCOM 2</em> or <em>Streets of Rage 4</em>, let my fingers melt into the fantastic controls, feel the rousing music come out of the truly excellent stereo speakers, watch smooth gameplay on the remarkably good 7-inch 1280 x 800 screen, and sigh with delight — knowing I can get through my long-neglected PC games one bite-size session at a time.</p><p id=\"cAWP7d\">But the operative word is “when.” Because the Steam Deck’s software is coming in hotter than any gadget I’ve ever tested — every single day I used the Steam Deck, I was dodging error messages, bugs, crashes, black screens, UI glitches, regressions, even entire feature changes from Valve on the eve of release.</p><div class=\"c-float-right c-float-hang\"><div id=\"d6XAaj\"><div data-anthem-component=\"aside:11066684\"></div></div></div><p id=\"loTcug\">I lost track of how many times I had to reboot the system or reconnect a device because Bluetooth or Wi-Fi or an SD card stopped working as expected. A few games I downloaded never finished installing, randomly stopping in the middle or retroactively running out of space. Some games told me their “content” was “locked” when I tried to move them, or that they grabbed “corrupt update files.” Sometimes parts of my library, or all of the games on my SD card, would temporarily go missing. I destroyed one card after the Deck seemingly froze while formatting it, and I stupidly reset the console (never ever do that while writing to flash). There were times I couldn’t reach the Steam servers to download save games or verify ownership of a title — and let me tell you, it really sucks to find out you can’t play a single-player game like <em>Control</em> or <em>Red Dead Redemption 2</em> on the go because of DRM. (My phone hotspot worked in a pinch.)</p><p id=\"TXOhRP\">Occasionally, the whole system would lock up. Sometimes the UI would break or scale badly while connecting or disconnecting an external monitor. And while I didn’t have a lot of problems playing or installing games to SD, I did have lots of issues transferring between the SD and internal drive — and unusually long transfer times during which the Deck wouldn’t let me do <em>anything else</em> with the system. Games I’d already installed would suddenly need new updates or need to randomly re-verify a gigabyte or three worth of contents, and I had to download <em>Elden Ring</em> a second time after I’d already preloaded it. Even when the Steam Deck has no Wi-Fi, it pauses a long time before launching games, presumably to see if it can download a cloud save.</p><p id=\"sUjRC0\">In many cases, Valve’s developers admitted I’d spotted a bug, and to their credit, a lot has changed over the past two weeks. The UI used to be incredibly choppy, and it’s way smoother now. I can now stream games reliably to Deck from my desktop PC, even if I can’t actually use the Deck’s controls or gyro there just yet. After at least three huge tweaks to the frame limiter, it’s finally stable. A huge update to Proton enabled a whole bunch of additional games. </p><p id=\"Jd3EC7\">But as I type these words, Valve has yet to fix Bluetooth, which never fails to lag, skip, and fail to reconnect after waking from sleep, and a recent update introduced a new issue where the Deck no longer reconnects to Wi-Fi, even though I have auto-connect checked and the password saved. The auto-brightness adjustment has never worked properly for me, despite Valve’s tweaks. The last update seemingly broke the download progress indicator, and... I think you get the picture.</p><p id=\"ER1kpj\">In an interview, Valve candidly told <em>The Verge</em> that it knows many things won’t be ready on day one; it’s had to focus on showstopper bugs and hardware production while deprioritizing other work. “So many things will be coming out immediately after launch, in the weeks after launch,” Valve veteran Greg Coomer tells me. “We really do look at it as the starting gun instead of the finish line.” Valve’s Lawrence Yang says early adopters should expect frequent fixes for some time to come, even if you won’t necessarily see the multiple changes per day I saw during the review period.</p><p id=\"GtPq6s\">Are frequent updates a bad thing? Early access can be neat! It’s exciting to see new features appear — like how all of a sudden, I could play my games on an external monitor with three different kinds of upscaling, including <a href=\"https://www.theverge.com/2021/6/22/22545441/amd-dlss-fidelityfx-super-resolution-fsr-supersampling-tests-benchmarks\">AMD’s FSR</a>, which you can apply to <em>any game</em> from the quick settings menu and made <em>Fallout 4</em> look so much better on a big monitor. </p><p id=\"KRXZxn\">But it’s not<em> </em>great if, say, you want to hear how well the Steam Deck runs Windows before you buy one because I never got to test that — Valve’s promised GPU drivers have yet to materialize.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dK5j_BGU5h66SXQJ4_K_WRvNfEc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269997/vpavic_220210_5030_0021.jpg\">      <figcaption><em>The ABXY face buttons rattle a tiny bit if you shake the Deck, but I like how they feel to press.</em></figcaption>  </figure></div><p id=\"pRh6Hq\">And you might actually care how well the Steam Deck runs Windows — because, despite Valve’s best efforts, the single-most frustrating thing is the one everyone saw coming a mile away: right now, you won’t quite know whether a game will actually run on Linux until you’ve downloaded it, installed it, patched it, let it install the first-time-launch dependencies, and hit play.</p><p id=\"zLA2CJ\">Let’s talk about those efforts for a moment because they’re not small: <a href=\"https://github.com/ValveSoftware/Proton\">Valve’s Proton compatibility layer</a> (which is built on top of <a href=\"https://en.wikipedia.org/wiki/Wine_(software)\">Wine</a>) really does make many Windows games run on Linux, and run incredibly well. I only saw the rare glitch, like weird effects around flashing lights in <em>Max Payne 3</em> and choppy cutscenes in 1997’s <em>Jedi Knight: Dark Forces II</em>, and I wouldn’t be surprised to hear if those plagued the Windows versions as well. Additionally, Valve has a team of people <a href=\"https://www.steamdeck.com/en/verified\">reviewing the entire Steam catalog</a> to see how games play — as of February 24th, 419 of them “work great,” and 398 are “playable” with tweaks, <a href=\"https://steamdb.info/instantsearch/?refinementList%5Boslist%5D%5B0%5D=Steam%20Deck%20Verified&amp;refinementList%5Boslist%5D%5B1%5D=Steam%20Deck%20Playable\">according to SteamDB scrapers</a>. You can also theoretically look <a href=\"https://www.protondb.com/\">at the ProtonDB community reports</a> to see what’s broken or <a href=\"https://store.steampowered.com/steamdeck/mygames\">try Valve’s checker</a> to see which games in your own library might work.</p><p id=\"XT0DtQ\">But in practice, I couldn’t completely rely on any of those sources when it came time to play. They’ve all got holes. <em>Duck Game</em> is certified gold on ProtonDB, but listed as unsupported on Steam Deck, and it didn’t run for me. Valve’s database shows <em>Persona 4 Golden</em> is completely unsupported, too, even though <a href=\"https://www.theverge.com/2022/2/16/22937525/steam-deck-proton-linux-persona-4-golden-monster-hunter-rise-forza-horizon-5\">Valve did the legwork to fix it</a> and I played a few minutes without issue. And I <em>definitely</em> disagree that <em>Deathloop</em> “plays great” on Deck “right out of the box,” considering the low frame rate and stuttery Xbox gamepad emulation I saw when I tried to play. Valve also lists its own <em>Half-Life 2</em> as a “great on Deck” title, but the default control scheme didn’t work for me at all (though a custom one totally did). </p><p id=\"nK6hZh\">And even if the listings were accurate today, there’s a chance they won’t be tomorrow — like how <em>Cyberpunk 2077</em> was working, even after <a href=\"https://www.theverge.com/2022/2/15/22933552/cyberpunk-2077-next-gen-update-patch-ps5-xbox-series-x\">the big patch</a>, and as of publish, I can’t run it at all.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LqVTaPm0_o9uWTbmK7BhPwYhhm8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270007/vpavic_220210_5030_0081.jpg\">      <figcaption><em>Reading games from an SD card never felt like a problem, but write speeds felt a bit slow. This up-to-90MB / sec card usually only gave me half that.</em></figcaption>  </figure></div><p id=\"GwuRmQ\">If you’re looking to play some of the biggest games in the world, which often use anti-cheat software, you may need Windows as well. Remember my<em> PUBG</em> analogy at the beginning of this story? <em>PUBG</em> doesn’t run at all, nor does <em>Destiny 2</em> or <em>Apex Legends </em>or <em>GTA 5</em> or <em>Lost Ark</em>. My very first night with the Steam Deck, I discovered it won’t run the most important games I play with my friends — <em>Halo Infinite </em>and <em>Back 4 Blood</em> — and none of these are a fluke. When we contacted the biggest game developers about whether they’d deign to enable anti-cheat now that Valve offers built-in support, <a href=\"https://www.theverge.com/2021/10/5/22709918/valve-steam-deck-supported-games-anti-cheat-proton-eac-battleye-epic\">most of them declined to even answer the question</a>. Epic Games CEO Tim Sweeney was braver, <a href=\"https://www.theverge.com/2022/2/8/22923163/fortnite-steam-deck-update-epic-tim-sweeney\">explicitly telling me why <em>Fortnite</em> won’t</a> — because the rewards don’t justify the work it’d take to convince themselves they aren’t letting cheaters in.</p><p id=\"8ZbFLc\">On a lesser note, Valve doesn’t differentiate between whether the Windows or Linux version of a game is the version that’s been verified, so you need to watch out if a game might quietly have <em>both</em>. My review unit installed the Linux version of <em>Rocket League</em>, which no longer offers multiplayer, and the Windows version of <em>Shadow of the Tomb Raider</em>, which doesn’t launch at all. And while you can dive into a compatibility menu to force the Deck to download the other version, there’s nothing to warn you which is which — and, sadly, the Linux version of <em>Shadow of the Tomb Raider</em> doesn’t support Windows cloud saves, so I might have to start from scratch.</p><div class=\"c-float-right c-float-hang\"><div id=\"vw40zN\"><div data-anthem-component=\"aside:11066702\"></div></div></div><p id=\"GTN34b\">I don’t blame Valve for shipping the Steam Deck before it’s fully ready. I might have made the same choice myself, considering Valve’s got at least half a year’s worth of preorders to fulfill before a single new customer will experience the Deck. That’s a lot of early adopters who’ll likely be willing to endure some bugs to be part of the club. Also, the Deck’s impressive performance might not be that impressive for long, since their RDNA 2 integrated graphics are <a href=\"https://www.theverge.com/2022/2/17/22935783/amd-ryzen-6000-h-radeon-rx-processor-graphics-launch-asus-g14-benchmarks\">beginning to make their way into thin-and-light laptops</a> and presumably other portables to come. Valve probably doesn’t want to sell stale chips.</p><p id=\"viw3rD\">But you should know that it also means reviewers like me didn’t get to properly test it all: not Windows, not the delayed Dock, not Xbox Cloud Gaming (since we’re still waiting on the Linux browser version to recognize the Steam Deck’s gamepad), and not the ability to swap between two apps because that’s a feature Valve added at the last moment. And <em>The Verge </em>doesn’t review gadgets on potential. We review what we can see and touch.</p><p id=\"BNKQmP\">I do have some faith in Valve: as an owner of an original Steam Controller and the <a href=\"https://www.theverge.com/circuitbreaker/2018/11/19/18103672/valve-discontinues-steam-link-streaming-set-top-box\">Steam Link streaming HDMI dongle</a>, a passive observer of the Valve Index VR headset, and a pundit <a href=\"https://www.theverge.com/2021/7/18/22579747/valve-steam-deck-steam-machines-editorial\">who can draw a straight line between the Steam Deck and Valve’s failed Steam Machines</a>, I’m pretty sure it isn’t lip service when Valve says it’s planning to keep updating the Deck and building out the portable category. The Steam Controller and Steam Link got bug fixes and feature updates <em>long</em> after it was clear they weren’t going to change the world.</p><p id=\"Aag7bG\">But if early access isn’t your beverage of choice, you might just want to wait for a Steam Deck 2. Because Valve, no big believer in <a href=\"https://en.wikipedia.org/wiki/Osborne_effect\">the Osborne effect</a>, is already <em>strongly</em> hinting that a sequel is inbound. Valve has repeatedly said that Steam Deck should be a “multigenerational product,” including in a new interview with <em>The Verge. </em>Valve founder Gabe Newell went one better in a chat <a href=\"https://www.gamesradar.com/steam-deck-2-is-already-being-planned-out-by-valve-and-it-will-be-even-more-powerful/\">with <em>Edge</em></a>, saying that “the second iterations” will be more about “the capabilities that mobile gives us, above and beyond what you would get in a traditional desktop or laptop gaming environment.”</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tNBkwFwhgffOeYRP49fhbjX5EcY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23270002/vpavic_220210_5030_0046.jpg\">      <figcaption><em>One last shot of the Steam Deck.</em></figcaption>  </figure></div><p id=\"CWrQAg\">When I flew to Valve’s headquarters last August to see the Steam Deck, <a href=\"https://www.youtube.com/watch?v=3L2j_pFgEuk\">I told you why I was putting money down</a>: I loved the idea of taking my PC games on the go, resuming them right where I left off on my desktop, finally<em> </em>having the time to play through <em>Control</em> and <em>Resident Evil 2</em> and <em>Fallout 4</em> and <em>The Witcher 3 </em>and a mountain of indie games I used to wait years to buy on Switch because that’s the only way I found enough time to see them through. So far, that’s the one part of the Steam Deck that’s largely working out, and I can only hope it’ll get better.</p><p id=\"BS0lKL\">Maybe game developers will natively target the Deck. Maybe they’ll come to terms with anti-cheat. Or maybe, <a href=\"https://www.theverge.com/2013/7/31/4573596/nvidia-shield-review\">like the Nvidia Shield portable I reviewed and purchased in 2013</a>, it’ll stare down at me from a shelf, forever taunting me with unrealized potential. But at least this one seems to have a decent library of compatible games from the get-go.</p><p class=\"c-end-para\" id=\"Zlq6a1\">For now, I’m having fun. My own 64GB model is coming in Q2, and I can’t wait to early access the heck out of its eMMC storage — and probably, swap in the SSD I already bought.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/u2_Fki2lVZc7PTyIg5wkG-qwHQA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270003/vpavic_220210_5030_0054_Edit.jpg",
  "description": "The Steam Deck is a joy, the Steam Deck is a mess.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}