{
  "title": "Stellantis plans to build an EV battery plant in the US",
  "url": "https://www.theverge.com/2022/3/23/22993071/stellantis-ev-battery-factory-us-canada-lg",
  "date": "2022-03-23T18:24:08.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GA52E-BOTHWprJp-p0ZN1BVM1-Q=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70662723/BU022_006EV4c5ffij5togna19gdeuoekltig.0.jpg\" />        <figcaption>© 2022 Stellantis</figcaption>    </figure>  <p id=\"l6PnXc\">Stellantis, the parent company of Dodge, Jeep, and Chrysler, plans to build an electric vehicle battery factory in the US. The news came out of an <a href=\"https://media.stellantisnorthamerica.com/newsrelease.do?id=23655&amp;mid=1\">announcement Wednesday</a> that the automaker would invest $4.1 billion on a new battery facility in Canada, along with South Korea’s LG Energy Solution.  </p><p id=\"CQJHcK\">The factory in Windsor, Ontario, will be the first of two planned battery plants to come out of the joint venture between Stellantis, which was formed last year from the merging of Fiat Chrysler and PSA Group, and LG. Construction on the plant is expected to start later this year, with operations set to launch in the first quarter of 2024. </p><p id=\"xw6MSf\">A second plant will be built somewhere in the US, officials said at the event announcing the Windsor facility (<a href=\"https://twitter.com/BreanaCNoble/status/1506670227572109318\">via <em>The Detroit News’ </em>Breana Noble</a>). Stellantis previously announced another joint venture with Samsung SDI to build a battery factory in North America. The location of the second factory will be announced in the coming weeks. </p><div class=\"c-float-right\"><aside id=\"f5kePo\"><q>A second plant will be built somewhere in the US</q></aside></div><p id=\"7zlXMX\">Stellantis, which has been slower to embrace EVs than Ford and General Motors, has said it is targeting the sale of 5 million EVs by 2030. The company, which is the fourth-largest automaker in the world, announced a comprehensive plan last year to electrify the lineups at most of its brands, including EV versions of the Dodge Ram 1500 and an electric muscle car, as well as <a href=\"https://www.theverge.com/2022/3/1/22956861/jeep-electric-suv-2023-ram-1500-ev-truck\">multiple Jeep models</a>. (Earlier this year, Stellantis previewed the <a href=\"https://www.theverge.com/2022/1/5/22862387/chrysler-electric-only-2028-airflow-concept-ces-2022\">Chrysler Airflow concept</a>.)</p><p id=\"jXimSe\">As the auto industry slowly shifts to electrification, the need to expand battery manufacturing capacity is growing. Globally, battery production is expected to grow from 95.3GWh in 2020 to 410.5GWh in 2024, according to GlobalData, a data and analytics company.</p><p id=\"i5rsdA\">Stellantis said its new Windsor factory will enable 45 gigawatt-hours (GWh) a year of production capacity. By comparison, <a href=\"https://www.theverge.com/2021/9/27/22696427/ford-ev-battery-factory-tennessee-kentucky-investment\">Ford has said its three new battery plants</a> will enable 129 GWh a year of production capacity. <a href=\"https://www.theverge.com/2021/3/4/22313251/gm-ev-second-battery-factory-lg-chem-tennessee\">General Motors</a> is planning four new battery factories in the US (also with LG Chem) for a total annual capacity of 140GWh, while <a href=\"https://www.theverge.com/2021/3/15/22325813/vw-volkswagen-power-day-battery-electric-car-announcement\">Volkswagen</a> is aiming to have six battery cell production plants operating in Europe by 2030 for a total of 240GWh a year. </p><p id=\"nuHzKA\">And Tesla CEO Elon Musk has said his company’s first <a href=\"https://www.theverge.com/2019/11/12/20961812/elon-musk-berlin-tesla-ceo-fourth-gigafactory-construction\">battery factory in Berlin</a> (which just <a href=\"https://www.theverge.com/2022/3/22/22808108/tesla-gigafactory-open-production-start-elon-musk\">opened this week</a>) would eventually produce 250GWh — roughly equivalent to the current world battery cell production capacity.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ns-CTbv606u2X3ijPzmV9gmuJZg=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340055/BU022_006EV4c5ffij5togna19gdeuoekltig.jpg",
  "description": "The first plant will be built in Windsor, Ontario.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}