{
  "title": "Stephen Wilhite, creator of the GIF, has died",
  "url": "https://www.theverge.com/2022/3/23/22992066/stephen-wilhite-gif-creator-dies",
  "date": "2022-03-23T20:02:40.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"The 17th Annual Webby Awards - Backstage\" src=\"https://cdn.vox-cdn.com/thumbor/EzfEYFDJsqBSS_q8phEMGjKDg-4=/0x107:1996x1438/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70663237/169208696.0.jpg\" />        <figcaption><em>Wilhite after winning a Webby Lifetime Achievement award.</em> | Photo by Stephen Lovekin/Getty Images for The Webby Awards</figcaption>    </figure>  <p id=\"4EUrFg\">Stephen Wilhite, one of the lead inventors of the GIF, died last week from COVID at the age of 74, according to his wife, Kathaleen, who spoke to <em>The Verge</em>. He was surrounded by family when he passed. His <a href=\"https://www.megiefuneralhome.com/obituaries/Stephen-E.-Wilhite?obId=24311617#\">obituary page</a> notes that “even with all his accomplishments, he remained a very humble, kind, and good man.”</p><p id=\"fBoV3R\">Stephen Wilhite worked on GIF, or Graphics Interchange Format, which is now used for reactions, messages, and jokes, while employed at CompuServe in the 1980s. He retired around the early 2000s and spent his time traveling, camping, and building model trains in his basement.</p><div class=\"c-float-left\"><aside id=\"SIXuyk\"><q>“It’s pronounced ‘jif,’ not ‘gif’”</q></aside></div><p id=\"4Bcmmz\">Although GIFs are synonymous with animated internet memes these days, that wasn’t the reason Wilhite created the format. CompuServe <a href=\"https://www.w3.org/Graphics/GIF/spec-gif87.txt\">introduced them in the late 1980s</a> as a way to distribute “high-quality, high-resolution graphics” in color at a time when internet speeds were glacial compared to what they are today. “He invented GIF all by himself — he actually did that at home and brought it into work after he perfected it,” Kathaleen said. “He would figure out everything privately in his head and then go to town programming it on the computer.”</p><p id=\"iFcSdA\">If you want to go more in-depth into the history of the GIF, the <em>Daily Dot</em> has <a href=\"https://www.dailydot.com/upstream/gif-history-steve-wilhite-olia-lialina-interview/\">a good explainer</a> of how the format became an internet phenomenon.</p><p id=\"YiNntK\">While there have been <a href=\"https://www.theverge.com/tldr/2020/2/25/21147389/jif-peanut-butter-giphy-settle-gif-pronunciation-debate\">long-standing debates</a> about the <a href=\"https://time.com/5791028/how-to-pronounce-gif/\">correct pronunciation of the image format</a>, Wilhite was very clear on how he intended for it to be said. In 2013, he <a href=\"https://bits.blogs.nytimes.com/2013/05/21/an-honor-for-the-creator-of-the-gif/\">told <em>The New York Times</em></a>, “The Oxford English Dictionary accepts both pronunciations. They are wrong. It is a soft ‘G,’ pronounced ‘jif.’ End of story.” </p><p id=\"6nkpsI\">He reiterated that stance while accepting a Webby Lifetime Achievement Award for the invention of the GIF later that month, using an animation to give his acceptance speech. (You can watch the whole <a href=\"https://www.youtube.com/watch?v=DUmVvocbrgQ\">clip of him receiving the award here</a>.) “After 25 years, they finally honored that achievement that he did,” Kathaleen said, adding that creating the GIF was the thing he was most proud of.</p><div id=\"OrSf7H\"><div ><iframe src=\"https://www.youtube.com/embed/ofm4XCdZzI4?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"1sdjQF\">Several messages from former colleagues <a href=\"https://www.megiefuneralhome.com/obituaries/Stephen-E.-Wilhite?obId=24311617#\">on his obituary page</a> said that Stephen also made other important contributions during his time at CompuServe, describing a hard worker who had a major influence on the company’s success. </p><p id=\"DP9gtz\">After Stephen retired, the couple traveled together. Kathaleen said that one of the most memorable trips was their honeymoon when they visited the Grand Canyon. “I had never seen it before, and he wanted to show it to me,” she said fondly. The couple also went camping “all the time,” she said.</p><p id=\"VbzS5L\">While at home, he liked to work on his model train set. “When we had the house built, we actually had a whole section in the basement for his train room. He always did the designs and electric work for the layout,” said Kathaleen.</p><p id=\"M89H8y\">In the <em>Times</em> interview, Wilhite said that one of his favorite GIFs is the <a href=\"https://techcrunch.com/gallery/a-brief-history-of-the-dancing-baby-meme/\">dancing baby meme</a>, which went viral before “memes” and “going viral” were widely used terms. So <a href=\"https://i.kym-cdn.com/photos/images/newsfeed/000/662/994/a4a.gif\">here’s to you, Mr. Wilhite</a>. Thanks for creating the image format that made downloading color images over dial-up bearable before it turned into one of the internet’s own languages. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LaW7RU07KgTl2aMFgkhE-BKG6zM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23338558/21_baby_custom1.gif\">      <cite>Gif via <em>The New York Times</em></cite>      <figcaption><em>One of Wilhite’s favorite gifs, according to a 2013 interview.</em></figcaption>  </figure>",
  "image": "https://cdn.vox-cdn.com/thumbor/Av_0GWWumDYFB8ONNG6_apgtKRw=/0x250:1996x1295/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340546/169208696.jpg",
  "description": "The man behind the internet’s favorite animated images",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}