{
  "title": "Steve Aoki on why he’s a ‘crypto believer’",
  "url": "https://www.theverge.com/22999333/decoder-steve-aoki-crypto-web3-aokiverse-metaverse-music-industry-business-nft",
  "date": "2022-03-29T15:11:49.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/eOdzqOK8gte8OlY3Pu7V-7ND9FM=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70685102/VRG_ILLO_Decoder_Steve_Aoki.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>Are NFTs the future of the music business?</p> <p class=\"p--has-dropcap p-large-text\" id=\"dWl03s\">I have always been utterly fascinated by the constant back and forth between tech and the music business — new tech makes it easy to create and distribute music, but every time that happens, the business model of music changes. And my pet theory is that whatever is happening to music today is a preview of what will happen to everything else five years from now. Take streaming: Spotify came to the US in 2011, years before Netflix released <em>House of Cards</em>, and now Apple TV Plus just had a movie that won the Oscar for Best Picture.</p><p id=\"cPLQJc\">For this episode, I’m talking to Steve Aoki. He is a superstar DJ, producer, record label owner, and prolific entrepreneur. Steve has been part of the music industry since 1996, so he’s been through a lot of these big tech transitions, and now he’s heavily invested in another, with Web3, the <a href=\"https://a0k1verse.xyz\">Aokiverse</a> (which he stylizes as “A0K1VERSE”). It involves selling tokens and NFTs and, over time, is meant to be part of the metaverse. Because, of course.</p><p id=\"nuSQMU\">I talked to Steve about how he makes his bets, what the business of music is like for him today, and where he sees it changing. And, of course, I had to push on the hype around the Aokiverse — Steve calls it a social club that will combine Web3, Web2, and IRL experiences. What does that really mean? And how is he actually going to manage that community? And like all blockchain entrepreneurs, I wanted to know how he was thinking about the energy use and climate impact of his project.</p><p id=\"VH9ntH\">This one takes a lot of different turns — we talk a lot about how Steve manages his time and all the different roles he plays, and at one point, he even manifests a future musical collaboration. I think you’re going to like it. </p><p id=\"p0NnMY\">Okay, Steve Aoki. Here we go. </p><p id=\"FJPEKI\"></p><div id=\"YTFQc1\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP3933588533\" width=\"100%\"></iframe></div><p id=\"XFJ822\"><em>This transcript has been lightly edited for clarity.</em></p><p id=\"KR8OlN\"><strong>Steve Aoki is a DJ, music producer, and the founder of the Aokiverse. Welcome to </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"L32QTf\">What’s up guys? Thanks for having me.</p><p id=\"05PCsB\"><strong>I am very excited to have you. I am personally fascinated by how art and business work together, especially in music. My personal belief is that whatever happens to the music business happens to everyone else five years later. There is a lot going on in music right now, between NFTs and the blockchain. I want to talk about the Aokiverse, but we should start with some foundation so people can understand how the business was working. Before COVID-19, before NFTs, before everything went upside-down, what was your business like? How was work for you?</strong></p><p id=\"E7qMCA\">Outside of music and touring,  a primary part of my business was investing. Once I started making money around the late 2000s, after DJing actually came through full-bore,  that’s when I started doing some small investments. My family has been involved in restaurants since I was born; my dad was a restaurateur. I said, “Oh, I might as well invest in something like that,” and kind of went into that world a little bit. Actually, as difficult as restaurants are in general — nine out of ten fail; if you open something like a nightclub or a restaurant, there is a 90% chance it is going to fail — the restaurant business has been doing very well for me for the past 10-plus years. </p><p id=\"FvYKZ0\">Then I got into properly investing, and understanding how to position myself in that space. I started a private fund with Eminem called Eminoki, just using our money. We were basically just getting into rounds of late-stage investing in stuff like Uber, Pinterest, Spotify. So all those investments we got into were very successful. We got into SpaceX.</p><p id=\"mTbDWJ\"><strong>You did SpaceX?</strong></p><p id=\"5zvKfj\">Yes, it was a friends-and-family situation where some people that had stock were selling. There was a sliver of a chance to be able to participate in that and I was able to get in, so that was pretty awesome. I got into that about five or six years ago. The 2010s are when I started getting into alternative investments as well. If you talk to my business manager, you’re supposed to work at a triangular business model, where your private equity and all the alternative investments are at the top end of the triangle, and all your safe investments are at the bottom. </p><p id=\"43xPfV\"><strong>The pyramid, yes. </strong></p><p id=\"r5YXCS\">If it was up to me, it would be flipped. It’s  just way more fun to get into startups and passion projects. That’s how I started. I consider my record label and myself — what I do with music — an investment. That’s private equity. But thank God I have someone else at the other end of the stick that gives me sound advice.</p><p id=\"BrUZPJ\"><strong>That balances you out?</strong></p><p id=\"rjH8Ez\">Yes, but it is more like a square, not a pyramid, at this point. I do so much in crypto now. I got into crypto around 2018. I invest in art heavily. I have some incredible pieces in my house. And I don’t sell. What I have realized is that in the end I am a bag holder. The NFT community loves me because I hardly ever sell. I have a team that helps me operate, so we try to get some cost basis back, but it’s rare that I sell. Also, I go and sweep floors. If I believe in a project, I don’t just buy one. I learned my lesson. With art, I’ll buy one because I’m going to have it hanging on my wall. I have also invested into some very high-end toys and I have a whole room of them.</p><p id=\"0Xtc3k\">But, when it comes to investing, it has to have a level of experiential value for me. It has to have a sentimental attachment. I am far more likely to invest into something like that, rather than a stock that’s going to perform well. I will let my business management handle that. That’s one of the differences between investing into a coin versus an NFT. The back end of the technology is similar, but the front end is really important. NFTs are the way we identify with culture, with other people. It is a way we communicate. It is obvious that the majority of the people who are very confused about NFTs do not see that. They’re like, “You identify with a JPEG?”</p><p id=\"2dWGJL\"><strong>The name is funny. People think non-fungible token is a bad name but it is the most literal description. You cannot trade them for another.</strong></p><p id=\"DOh9q6\">It’s like EDM; electronic dance music is literally EDM. NFT is a literal definition of what you are getting.</p><p id=\"9OVEau\"><strong>All right, so that’s your investment side. One of the things I really want to explore with you is how NFTs and the music industry are colliding. Tell me how the music part of your business works, or how it worked before COVID-19. I think people are often really confused about that, because it is a business that doesn’t really make a lot of sense.</strong></p><p id=\"Tgutbt\">The business of music feels nonexistent outside of shows.</p><p id=\"nQx9l6\"><strong>Really?</strong></p><p id=\"kncpTb\">Yes. Unless you get a big sync, but that’s rare. That’s how people get their payday.</p><p id=\"hoBvpi\"><strong>A “sync” is when a song is used in a commercial or a movie?</strong></p><p id=\"ClGEdD\">Yes. Even some big movies might low-ball you because they’re so big. Unless you get something like a commercial for Tide detergent and get paid a hundred grand a side. That’s sweet, especially if you wrote the song or are participating in the publishing and the master — you get paid on the master side. But 99.9% of the artists that are making music and putting it out there cannot survive off of streaming income. You probably know better than me how much we make on a stream. A Spotify stream is a fraction of a penny.</p><p id=\"6v3zRh\"><strong>It’s something like 0.008.</strong></p><p id=\"SXr2bm\">The majority of people who are making music are not getting 100 million streams or 100 million views on YouTube. Even if you are a big artist — even for me — I might get some really high streaming numbers on a few songs, but it’s only a few songs. YouTube is also a very low income stream per view. </p><p id=\"xxlubx\">I definitely would not be able to have the lifestyle that I have if I was not touring, because that is 95% of my income, I think. I don’t know the exact percentage. </p><p id=\"iQ0mTu\">Obviously, as you get bigger as an artist, you find other ways to make money outside of the “music business.” The music business has not changed. Once they set a standard, that is what everyone is paying. Whether you get 0.008 of a cent or 0.01 of a cent, it doesn’t change much. You might get a level up there, but it is not enough. </p><div class=\"c-float-right c-float-hang\"><aside id=\"5R9QCT\"><q>“NFTs are providing a different way for musicians to be more engaged with their audience”</q></aside></div><p id=\"4n2Gc8\">So clearly, NFTs are providing a different way for musicians to be more engaged with their audience. You have the NFT community, the crypto community, that is also looking into music as an art form. They’re having that conversation — that music is art, which we can all agree with, but it is not regarded as an art on the financial side of collecting. You do not collect a song. You just listen to it for free. It has always been that way.</p><p id=\"19Nxzq\"><strong>You have been running your record label Dim Mak for 27 years, right? Since 1996?</strong></p><p id=\"oenzLB\">Yes.</p><p id=\"20lGP6\"><strong>The ‘90s were crazy for record sales. CD sales were through the roof, there was no streaming. Then came Napster and MP3s and the whole business got turned upside-down. Now we are in Spotify’s world. I have a vinyl collection, and I am sure you have a much bigger vinyl collection, but people still collect physical music. No one collects digital music. How did you manage through that?</strong></p><p id=\"CHC8K0\">As a label?</p><p id=\"483VY6\"><strong>Yes, as proprietor of a label or as an artist yourself.</strong></p><p id=\"mnPhm0\">One of the first things our label and the artists did during that period of time was the unthinkable — give songs away essentially for free. Then management would say, “What? No! No chance.” But I knew this was where the business was going to go, even if it didn’t make any sense and it felt like everything was getting chopped off in terms of how much money we were making — especially since the label doesn’t participate in artists’ touring. But I knew artists were going to make more money when more people listened to their songs, period. </p><p id=\"QkdCTw\">Th</p><div class=\"c-float-right\"><div id=\"5D0bd3\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"sNoEwW\">As far as the business side of things, I feel like one thing that I have always had in my back pocket is being a little bit earlier and saying, “We have got to do something that other people aren’t doing and take that leap forward that is a bit scary and a bit speculative. The haters are going to come out, but fuck ‘em. Let’s go.” I definitely went into the space guns blazing, and it worked. I said, “Just trust me on this, on one song.” There was so much more visibility on that single.</p><p id=\"HNORdu\">To answer your question, on the business side, it didn’t really help us in the short term, but it did in the long term. That is how you have to think whenever you make these speculative moves. You can’t think about short-term gain, or you’re doing it for the wrong reason. Period. </p><p id=\"F7KHrj\">One of the life lessons I have learned is that I’m here, and I’m not going anywhere. When it comes to my label, I don’t say, “We have got to make all this money on this artist or band, then boom, we’re out.” No. We are here to establish an even larger community of people that support us, starting in small rooms then onto bigger rooms or arenas. And keep growing it, keep servicing them, and keep advancing. Fast forward to now, I still work from exactly the same concept. I’m not going anywhere. I’m here. This is the future. This is how commerce will be.</p><p id=\"VkNl7p\">Regardless of my not going anywhere, commerce will be here. That is why I see these people that get into the NFT space and think there are these “rugs” that are happening [people who are pulling the rug out from others]. I’m like, “Don’t you see? Next year everyone is going to be doing it, and you just rugged yourself. This is how commerce will be. This is how we will communicate. This is going to become very normalized.” You have to think about the long game.</p><p id=\"rPsmRs\"><strong>This actually leads me into what I think of as the classic </strong><em><strong>Decoder</strong></em><strong> question that I ask everybody. You run a lot of businesses, you are an artist, and you are obviously an investor in a lot of different things. How do you make decisions? What is your thought process?</strong></p><p id=\"1ImrQZ\">It’s a balance of passion. I only have so much time in the day, so I have to ask, “Is my passion going to lead me into making sure I carve out this amount of time in my day [for this project]?” Time is all we have; my time, just like everyone else’s time, is valuable. My schedule is stacked — stacked beyond belief — but it is with things that I am obsessed with and that I love. Passion has got to lead the way. I learned the hard way you have to think about economics too, and that is why you have teams involved that can provide a different angle on what you are doing. They give you more insight and more information on your choices.</p><p id=\"xncODC\">I do keep my mind open. I think it is important to not be stubborn, to know when you’re wrong and that you’re not always right. I think it is important that you have the right team because those people are saying stuff that actually can change your decision. You keep trusting, time and time again, that this decision is really true to your core. Regardless of the money, you have to find the right team. </p><p id=\"f0fdjv\"><strong>I have asked this question of everyone from the biggest CEOs to individual creators, and it’s funny how the answers can all be different but, at the end of the day, all line up. To me, it’s one of the most important questions we ask on the show. Honestly, few people take the time to step back and think about it, but it’s kind of the most important thing you do with your time. </strong></p><p id=\"l7GAHR\">I think it is important for everyone to step back from what they do on the daily grind and ask themselves the question, “Why am I doing this?” It is okay to be like, “This isn’t for me, even though it feels like it is.” You only have one life. I always think about that. You have got to think about the time that you have on the planet. My average life expectancy, I’m in good health, is maybe 90, but let’s say 80.</p><p id=\"XzHNOs\"><strong>You might want to slow down at some point, man.</strong></p><p id=\"UdrZL4\">Let’s say 80. So, I have 36 years left. That’s it? 36 years. Only three decades? Three decades! With some of these decisions that you make, it’s not like you can say, “Yeah, we’ll do this and we’ll get out of it soon.” No, most of the decisions I make are long-term, for life. </p><p id=\"LnwCr9\">There was no end in sight — no exit — with Dim Mak, my record label. When it comes to real big businesses, you think of the exit. “In five years, we’re going to sell and we’re out. Now we do something else.” A lot of the stuff I do, there is really no exit. In some cases, yes, I am going to continue to build — it becomes a part of me — and maybe partners will come in to give an exit and I will get some money out of the equation for myself. But I have to consider if this is going to be part of my game plan for 36 more years. There is a legacy attached to that too, afterwards.</p><p id=\"RSc5Fe\"><strong>I’m telling you, I ask that question almost every episode. It leads to places that you would never expect. Now, you are a worker. I saw a stat that one year you toured 361 days of the year, which is crazy. How do you decide what is Steve-the-performer time or Steve-the investor time? How do you manage all that?</strong></p><p id=\"4GikoI\">Steve-the-performer time is only two hours, which people forget, but traveling — and the side effects of traveling — is a crazy time sink for sure. It takes away from the brain cycles. When you are zombie-ing through jet lag, it’s hard to be optimal. I am still trying to figure that biohack out because I do travel, or at least pre-COVID-19 I did. I am a global artist, so it’s not like I’m just doing one or two or three different time zones; I’m traveling across the country every other week. I think I did 14 tours in China in two or three years, so every other month I was in China, then I was in Ibiza, then I was across Europe, then back to America, Central America, South America, Asia. It never ends as far as jet lag. It’s constant.</p><p id=\"lhnVFw\">So, that is tough, but I have a really good team making sure that everything is on schedule and on point. I regard my schedule like the grail; I really stick to it. Being 100% with what I’m doing on the schedule is very important. Out of all the shows that I have done — I never broke under 200 shows a year for 15 years — I think I have only missed a few. My track record of reliability is like I am the UPS man. Rain, sleet, or snow, I’m there, and I will make it there however I need to; I will do whatever is in my power. Sometimes the act of God comes, or I just feel sick, and I just can’t go, but shows are just one aspect of the things I do in my life that are important. For the most part, I try to really maintain them alongside everything else. In order to be able to make it to all of those things, you have to be a mental athlete. There is no other choice if I’ve decided to take on all this stuff. Trust me, the NFT world, Aokiverse, is a major time sink in a good and exciting way, in the future-development way. We’re building a world.</p><p id=\"oKlivd\">With all that going on, you have to sacrifice certain things that will not allow you to be optimal, which is so important. I go into things with my team and they have to be optimal too. Just like I was talking about before, the team you pick has to be with you. We’re going together, we’re moving forward at this speed, at this pace, at this tempo, and the train does not stop. You have to want that, you have to like that, and you have to train like an athlete. I love the whole physical, mental, spiritual bootcamp mentality.</p><p id=\"KMbFkh\"><strong>One of the things that I find in my life is I wear a bunch of hats — a management hat, a creative hat, a podcaster hat. For me, I need to schedule time to switch modes between my own creative time and talking to people. Do you have to do that, or are you a mental athlete that can just go right from one to the other? Can you walk out of a business meeting and right on stage?</strong></p><p id=\"2GRgEg\">Yes. 100%.</p><p id=\"RoFpBv\"><strong>That is crazy to me. I would not be able to do that.</strong></p><div class=\"c-float-left c-float-hang\"><aside id=\"BBJ7Lu\"><q>“I have mastered the nap.”</q></aside></div><p id=\"NmzSrE\">I have mastered the nap, which I think is far more difficult. I did five shows in five different countries in 40 hours and the only ounces of sleep I was getting were on the transportation. I remember one show, I was driven right to the back of the stage. I could hear them chanting my name, I’m on, and I’m still asleep. My manager was shaking my arm saying, “You have got to hit the stage right now. We just arrived and they’re chanting your name. You have to.” Thirty seconds is all I really needed. I just got to the stage and boom; you just feel it. I’m just excited.</p><p id=\"dqZFdx\">At the end of the day, just follow the excitement and the passion. Yes, when you go from the polar opposite mental hats that you’re talking about, you just have to accept that your brain is not going to be able to adjust so quickly. You’re going to have to just fail a little bit in the first part. Once I’m going, I catch up and I’m good. It’s like I’m riding on my horse and I’m flying. I always accept that it’s just part of who I am. Luckily, I have some leniency from people that are listening to me to give me some benefit of the doubt.</p><p id=\"tjx2Rm\"><strong>Let’s talk about the Aokiverse. When COVID-19 hit and touring went away — that is where you were spending all your time — you got deep in NFTs. You jumped in really hard. What drove you in that direction?</strong></p><p id=\"PfPd49\">I was already a crypto believer, which I think is actually important as the foundation. I was already pretty savvy in the space before I was into NFTs. During COVID-19 was the opportune time for everyone like me who has some money to invest, who believes in alternative investments, believes in art, believes in collectibles, and believes in crypto. There are a lot of different reasons why I jumped in and there are so many different angles as to why it makes sense to me. On the collecting side, on the investing side, on the curating side, on the creative side, there is just so much more I can participate in. </p><p id=\"0m1oRI\">At the same time I was getting into cards, like sports cards and Pokémon cards. Later on down the line, I formed my own TCG company with the founder that was already developing this particular brand, and we are doing absolutely incredible with this. I’m heavy into the card world — and that whole collectible space — so I’m already there on the collecting side for NFTs. </p><p id=\"ktQ1XD\">With certain things that you love, certain things you believe in, you understand the communities. That is the other thing too, the community side of NFTs is just as important as the art, as the technology and utilities behind it. By far, the communities that are part of each of these projects are far more important than in any other industry I have ever been a part of. Whether you are an investor in Tesla or you own the stock, you have a voice. Essentially, it is very similar, but this is way more of a two-way street, way more transparent, and way more real-time.</p><p id=\"EOrnvt\">That was important when I created the Aokiverse membership community. We have to be real-time and we have to deliver fast. In the projects that I was part of, I was not seeing the delivery as fast as I would like. When I created the Aokiverse, I was like, “Wow, there are multi-layers to what we can deliver to this community. Real-time, real-world stuff.” </p><p id=\"RMWNlN\">I’m excited to do these shows. The first Aokiverse-only event — exclusively for passport holders during NFT LA — is about to happen. We haven’t even announced it yet. </p><p id=\"MdUtje\"><strong>There’s a scoop.</strong></p><p id=\"oKG2x4\">Yes. There is some alpha there. That’s what’s so exciting, and I want to do this just for the citizens of the Aokiverse. Part of being in the Aokiverse is that you get a passport, and you can grow your passport and level it up.</p><p id=\"8m73xE\"><strong>Let’s talk about that. The Aokiverse is your community. I have seen it described as a token-gated social club, and you just described it as a membership community, but on the website it says it is Web3, meets Web2, meets IRL. Tell me what all that means. How does it work?</strong></p><div class=\"c-float-right c-float-hang\"><aside id=\"HASb4G\"><q>“It’s a social club, a membership community, Web2, Web3, IRL all combined into one.”</q></aside></div><p id=\"2N5Ihu\">It is everything that we just said. It’s a social club, a membership community, Web2, Web3, IRL all combined into one because there are the real-world utilities and offerings, like the live shows. </p><p id=\"lVl7my\">There is actually one person that made it to the highest level, level six. On that level, one of the offerings is that they can come to the studio, where we are going to make a record and release it together; it’s going to be Steve Aoki and XYZ dropping a record. I don’t just work with musicians and artists. I have made songs with Bill Nye, J.J. Abrams, Ray Kurzweil, people that are scientists and thinkers. Probably one of the most exciting collabs I haven’t ever actually done that I’m putting out to this space — the ether — is hopefully doing a record with Elon Musk. I just need the spirit of someone in the studio with me when I am creating, and it can turn into something beautiful. In any case, a lot of stuff is happening at my shows, between the access — to shows I am already doing and that we are going to be creating — and the drops, both physical and digital. I think one thing that is really exciting to announce here is the first collab that we’re doing with <em>My Little Pony</em>.</p><p id=\"jOnChF\"><strong>That’s great.</strong></p><p id=\"yjJGyW\">I swear to God, every time I have announced this or talked about this in Twitter spaces, everyone is so excited. Our commercial line for my brand, Dim Mak fashion, does tons of collabs and licensing deals with really big anime and cult intellectual properties that I love and grew up with like <em>The Matrix</em>, <em>Gremlins</em>, <em>My Little Pony</em>, <em>Naruto</em>, <em>Dragon Ball</em>, <em>Bleach</em>, and <em>Attack on Titan</em>. The first drop we’re doing is going to be an exclusive collection from My Little Pony for all the Aokiverse members. For my first NFT drop, I did Character X. We had launched with Stoopid Buddy [Studios], Seth Green’s stop-motion animation company, and created <em>Dominion X</em> —  Seth and I are doing the <em>Dominion X</em> NFT collection — and now we’ve got the next chapter. PFP is coming soon with exclusive early access to just passport holders.</p><p id=\"DLslG6\"><strong>This is the stuff about these communities that I think is utterly fascinating: They are all built on the blockchain — these are all tokens — you should theoretically be able to sell them and resell them. On the website, it says Aoki credits are ERC 1155 NFTs, they are on Ethereum. You can buy a bunch of those and trade them in for an Aokiverse passport, which is itself an NFT. When people trade them in to you, you get them back. Do you get to resell them?</strong></p><p id=\"DRs7E4\">Yes. When you trade them in, you essentially burn them.</p><p id=\"9MK9fa\"><strong>You burn them?</strong></p><p id=\"FxDhwo\">Yes. Obviously, the more credits people burn, the less are in population, and presumably that drives the price of the credits up. You use up the credits to level up your passport. Level one is one credit, level two is four credits, level three is 16, level four is 64, level five is 256, and level six is 1,000-something. It’s all in multiples of four. Each level has different applicable rewards, utilities, and offerings.</p><p id=\"iIwivA\"><strong>The idea is to get a lot of people in the community, right? What happens if someone buys a lot of the credits? It’s early on so you’re still learning about this part of buying and selling your way into a community. The idea that there could be an Aokiverse whale that just chokes out the community seems like a problem that may or may not happen.</strong></p><p id=\"sbb7WU\">I think it’s difficult to do that. Because there are whales here, for sure. There’s already one that got to black prism level six, and there are about five members at level five. The floor of the credits are still around the same price from when we launched the passports; 0.1, maybe 0.15. I have to check the floor again to be sure. As these credits burn, the floor will decidedly go up. It’s up to the market to decide that.</p><p id=\"C204T6\"><strong>Then the passport itself is an NFT? Can people resell the passport?</strong></p><p id=\"BHrd45\">Absolutely. We are building out a mechanism where you can level up. The dev behind this is Manifold, and to me, they are the best dev on Web3. Period. Previous to Aokiverse, from Pak’s Pages to Lost Poets — which I thought was phenomenal — to Mad Dog Jones, everything they have worked on has always been, out of the gate, something unique. We launched this with a culmination of a lot of the ideas that already existed and put together. I love The Hundreds and Adam Bomb Squad phygital concept, because they’re a merchant and a fashion company.</p><p id=\"nTfzSj\">I offer the same thing. That’s why we are doing these drops with My Little Pony, then Attack on Titan next. We’re going to be working with other NFT projects in dropping exclusive collabs inside of Aokiverse with great projects that are blue chip. You have that aspect that Gary V and VeeFriends have done; I am building out what VeeCon is going to look like, and I’m going to be speaking there as well.</p><p id=\"rK49LF\"><strong>Again, this stuff is all really new, so I’m thinking of the corner cases. What if someone buys all 30,000 credits to turn them into level six passports, so when you hold the show there are only 30 people there?</strong></p><p id=\"kAdacy\">That’s fine with me.</p><p id=\"HJYITT\"><strong>That’s fine with you? That’s a weird outcome that could happen.</strong></p><p id=\"G5fr49\">I think there are between 2,000 to 3,000 members of the Aokiverse, so that could happen, but has not. You’re right that there is someone that could have done that. For example, I played for Gala Games at the first Vegas show they did. I think they booked out Doja Cat and Aziz Ansari — who couldn’t make it for some reason — Kings of Leon, H.E.R., and myself and some other DJ friends like 3lau all showed up at The Forum, which holds 20,000 people. Gala Games was doing an exclusive community show and had brought in the heavyweights. They turned this 20,000-cap, legendary iconic venue in LA, into something special for 200 to 300 people.</p><p id=\"80QFcY\"><strong>That’s amazing.</strong></p><p id=\"CUAdL5\">That’s something that’s aspirational. They have an incredible business and an incredible community that they’re taking care of. I love that. It feels like you can do anything. For me, it’s going to be a different feeling when I play this Aokiverse show; I really don’t care if there are only five people there. I look at each person as people that believed in the Aokiverse membership, that got themselves a passport, and it’s going to be so much more meaningful to me because I know where every single person came in from.</p><p id=\"pD6tnK\"><strong>How does that generate revenue over time? Once all 30,000 credits are burned and there are however many passports, you’re playing shows for those people — where do you get more money from?</strong></p><p id=\"DcJgvG\">The secondary.</p><p id=\"TuawwP\"><strong>So when people resell the passports, that’s how you get paid?</strong></p><p id=\"aHIMQe\">Yes. We — the Aoki IP or whatever company — are participating in the secondary. When we launched this, we wanted to have a very healthy cross-section of NFT culture and community that was participating, not just Aoki fans. We started designing this about six to eight months ago and have reached out to all these different communities that supported us in the last year. We really wanted a diverse, broad base reaching out to Doodles’ camp, Adam Bomb Squad, 3lau’s camp, and about 24 different communities that were all part of the launch of Aokiverse. As far as building the community, it just brings in a lot of different kinds of ideas and reasons as to why they are part of it. </p><p id=\"qIcob2\">It makes the Discord way more vibrant. Conversation is not going to be about just one thing; there are going to be different things that they want, things that they are looking for, things that they are excited about, and things that they value. As a social club, it fits perfectly that we are going to communicate and actually connect with a lot of these different partners, like the DeadFellaz, and do really cool offerings and something exclusive for our communities.</p><p id=\"gXkKLk\"><strong>When you have a community that has a Discord, do you have moderators to keep it clean, or to keep the racists out? How does that work?</strong></p><p id=\"NvlBRN\">That is a good question. Yes, we have moderators. We have weekly calls and meetings about how things are going in the Discord, and I definitely rely on the moderators to do all that stuff. I think it’s really important. You hear all the time, “Oh my God, so-and-so community’s Discord got hacked.” You’re not impenetrable; it happens to everybody. I think as people have ventured into this space, that’s one of the big conversations and initial dialogues to have. Be careful about whoever is saying what, when hitting a link, and so on. Just double-check and make sure.</p><p id=\"ebx7Nm\"><strong>But are your moderators double-checking for you?</strong></p><p id=\"wBqHs4\">Yes, that is their job. They might miss through the cracks and some things get dropped, but it goes right back to making sure you have a quality team.</p><p id=\"K0mNo8\"><strong>Let’s say that your level six passport owner — not to impugn this person — goes on the Discord and says some silly shit or tries to do a scam. Do you boot them and take the passport away?</strong></p><p id=\"dRUpi4\">God, I haven’t even thought about that. There is a different conversation we have at level six. I have a one-on-one Discord with them. Would a level six do something like that? It’s possible for anything in the world to happen, but I think it is highly unlikely. If someone is going to invest all that money, time, and energy to be a part of it at such a high level, it is very difficult for me to see them trying to pull the rug out from under everyone and scam people. Is it possible? Yes. But is it likely? No. It’s highly unlikely.</p><p id=\"oemrnF\"><strong>I was just curious, because again, it is early.</strong></p><p id=\"OCHU49\">Of course. I think the only way you can safeguard, or protect, is by asking every question you can. You’re right, it is early, and it is decentralized. The only way we are going to move forward with innovation, technically and philosophically, is with these kinds of questions.</p><p id=\"5j9eWv\"><strong>Let me wind this down with some of the most important questions of all. You’re on Ethereum?</strong></p><p id=\"UoA0bK\">Yes.</p><p id=\"Ahc9Xp\"><strong>The criticism or feedback I get from our audience — whenever anyone talks about NFTs on our site or we talk about it on the podcast — is that all this stuff is so energy-inefficient, horrible for the climate, and that it is all a scam. The worst thing is the climate aspect; you are burning a lot of energy to do this stuff that is a club. You could just not do it on the blockchain. Do you think about the climate aspect of all this?</strong></p><p id=\"g8UDtx\">Yes, I do. It definitely is a very important topic, and something that needs to be addressed in a way that uproots all of it. If we could figure out a way to build a more ecologically friendly foundation underneath the actual blockchain, it needs to happen. We can ask the question, “Is it worth doing, or not doing?” It is definitely a hope and dream that people who are more versed in this space can find a way to make it more ecologically sound.</p><p id=\"D1qIw3\"><strong>Do you think that the climate aspect outweighs the opportunity aspect? I think that’s the complaint, if I had to sum it up: There might be a lot of opportunities there,  it might be better for musicians, and there is a direct relationship, but the climate stuff is so bad. The thing is so inefficient that maybe we should wait or should use a different blockchain. You picked Ethereum, so I am just wondering how you made that decision?</strong></p><p id=\"3zCM2i\">I first got into NFTs through Nifty Gateway, which is on the Ethereum blockchain and where we were able to source it all up. I still can’t really answer that question for you in detail, but that is something I converse with my team about. Do we switch to Solana, or another blockchain? I actually love Solana and what they’re doing. I think it still needs some work and needs a way to build into a premium NFT blockchain provider, but I do love it. I do plan on working with Solana, and that could be the pivot. There are a lot of different people on the team that actually make these decisions, so we are just going with what we’re all going for, for the time being.</p><p id=\"KIrjR7\"><strong>You’re describing a bunch of people in a club who can buy and sell the tokens, which is mostly happening inside; you are not interfacing with the world a whole bunch. Why does this have to be on blockchain at all? Why don’t you just set up a server, and a little social network, and do it super Web2?</strong></p><p id=\"kocxY3\">The big difference is exactly what you just said, and the whole idea is that we are moving towards Web3. With Web2 you do not own anything. I always put it like this: I fly American Airlines because I want to get my points up. I’m at the highest level, but I can’t ever sell it. Of course, I could fly United all the time, but I decided to be an American flyer. I am Concierge Key and I am proud of that. I don’t necessarily want to sell it, but I want to have the opportunity to. I think that’s the main difference. With Web3, this is the social club that you subscribe to. I like going to Soho House and feeling like I can have my meetings there; I enjoy being in that environment. I’ll pay whatever I pay to be part of that, but I can’t sell it. The main difference is Web3 allows you to grow and sell. </p><p id=\"XIBx5S\">Eventually, we are going to make it where you can gamify it, where you go to all these different shows and start to micro-level in your level. You could spend all this time grinding it all the way up to a different level, and have all your POAPs and different badges and stamps in your passport. Then when you get to that different level, you can say, “You know what? I want to sell it,” and have the ability to do that.</p><p id=\"CBoGEF\"><strong>This leads right into my last big-think question. I have been excited to ask you this question the whole time. You are in it when it comes to art and commerce and finance. I’m a hippie; I think the point of art is to be democratic, to improve people’s cultural lives, and to knock people out of their comfort zones. We have spent an hour talking about financialization — buying and selling things, creating tokens, creating markets, and grinding so you can resell a product that is based on your experiences. Where do you see that tension? Do you ever worry that art and music is just getting too financialized, and that NFTs are creating monetary incentives around culture?</strong></p><div><aside id=\"l7HFiW\"><q>“Do you ever worry that art and music is just getting too financialized, and that NFTs are creating monetary incentives around culture?”</q></aside></div><p id=\"Aw3tJ3\">I think we have not really even made a dent in culture. We’ve made a dent within our small world for sure, but as far as cultural ramifications, we are so small. We are such a small percentage of the whole space. The dialogue is going to change when your favorite artist is doing an NFT and it is art. The whole world could listen to Radiohead’s album, let’s say, but Thom Yorke is making something special with that album limited to only a certain number, for people that love that album and love Radiohead. It then provides an income stream and a conversation in a way that never happened before. It adds a different layer. It allows it to be viewed as art, the same way that you would buy a piece. It’s exciting. I think at the end of the day, it is up to the artist.</p><p id=\"HiYRuZ\"><strong>This is, again, just me pulling the string. It is early, so I don’t know. I think a lot of what we have talked about is based on the fact that unfortunately, in the current system, the music itself is not worth very much money. We are moving the value to everything else, and the music is kind of becoming — for a lack of a better term — like marketing for the stuff that is worth money.</strong></p><p id=\"NEMJhe\">That’s right. At this point, the way we view music is that it is meant to be free and heard, but you are adding a different layer of scarcity to it that has an art impact. Like I said, it is up to the artist to decide if they even want to venture down that path.</p><p id=\"Sos8kF\"><strong>Can any artist realistically make that choice? Will you be able to make money as an artist if you say, “I’m just going to do music,” and then the music isn’t worth anything?</strong></p><p id=\"hnhJOe\">It’s entirely up to the market. The exciting thing about the whole world is that the market decides if they are going to spend money on a band that just came out and said, “Hey, I want to make money off this album that no one has heard of.” The market will decide if they want to pay for it and what the floor is, and they are going to decide with their wallets at the end of the day. Why not allow this kind of conversation and way of viewing music as art to happen?</p><p id=\"KheQJj\"><strong>I mean, I don’t think I wouldn’t allow it. </strong></p><p id=\"3pfuDh\">I am just saying that to pull the string the other way, because the artist doesn’t have to do it. They can just release music. That is just how it is.</p><p id=\"diyfT2\"><strong>But then you won’t make any money.</strong></p><p id=\"Z5UMuc\">You would only make money in the confines of how it works, you’re right.</p><p id=\"mE3ZI8\"><strong>I think that is the tension that I’m really interested in. At some point, the music itself should be valuable.</strong></p><p id=\"tBTkP2\">Yes, but that is a different conversation and has nothing to do with NFTs. Are you saying the NFTs take away from the potential for music to have its own value?</p><p id=\"UzfUEM\"><strong>I am saying that if the money is on the NFTs, then everyone’s incentive is to focus on that instead of the music. In my ‘90s don’t-sell-out worldview, the music is the most important thing.</strong></p><p id=\"Zn7ARX\">Oh, I know, but I think this is like two people talking over each other’s heads because the music is going to exist regardless. It is going to be out there for people to listen to, and like we said earlier, it is basically free. With Spotify, they might increase a little bit for people to make extra money, but it is not going to be a game-changing effect. It is always going to be at that free level. </p><p id=\"rTOlWl\">It is going to exist, but there may be someone that says, “Hey, I absolutely love this album, and its attachment to this particular rarity or scarcity of this NFT of art. It is connected to this emotion that I feel when I listen to this song, and I want to be the person that owns one of those few hundred pieces of that.” Why not allow that conversation or dialogue to exist? It is up to the person buying it, the market that dictates what the value is, and the artist to actually allow it to happen.</p><p id=\"Pux8ne\"><strong>I think that is an amazing place to end it. I will say this, I think you should come back in a year and we should talk about how it’s going. It is early and I feel like we are talking about some hazy ideas that are going to get a lot clearer in even just a year.</strong></p><p id=\"rDEhaV\">I feel like you are a veteran in the NFT space if you have been here for even six months; it’s like you have a PhD in NFTs, even if it is early. I feel like it was so long ago when I got into NFTs around the summer of 2020. It was literally only a year ago that I dropped my first collection — in February 2021 — but I feel incredibly knowledgeable about what I understand now. It is exciting that every day there is a new level, a new way to advance it forward and do something that is interesting, and keep building on this idea of community, because that is really what it’s all about. Beyond the art, beyond everything, it is about this two-way convo with the community and delivering incredible experiences. </p><p id=\"H2P6zi\">At the end of the day, if I go back to the real-world stuff — real-world shit — our life is based on a bunch of experiences. You want those experiences to be meaningful, whether it is spending time with your family, going to a live event where you feel something, listening to a song that makes you cry, or looking at art that makes you melt, being part of communities that make you feel connected. We need to continue building off that. The reason why I play so many shows is because I am obsessed with that level of connection I am having with different crowds through music. I am barely even saying anything on the microphone yet I’m connecting with strangers. Those are moments that are so important. How do you encapsulate that and bring it into what the future looks like?</p><p id=\"FPudS3\"><strong>I’m old now, but when I was in my 20s, before my friends and I would do something crazy, we would always say, “Life is a collection of experiences.” I think about that all the time.</strong> </p><p id=\"MheYlS\">It really is, though. That’s all it is.</p><p id=\"CLBRMy\"><strong>Sometimes, maybe we shouldn’t have had some of those experiences, but we did.</strong></p><p id=\"GCuabM\">Yeah, we’ve all had that.</p><p id=\"Isd1Q6\"><strong>Steve, this was great. I really do want you back in a year to talk about where this has all gone and what you have learned. It is the beginning, and I feel like a lot of these threads are going to get pulled. This was a great conversation. Thank you so much for coming on.</strong></p><p id=\"LmmO3f\">I do want to say, I really love this whole world that we are creating with Aokiverse, the passports, the community membership, the social club, and NFTs in the past year. It’s like a multiverse of communities that I am a part of. When you enter the space and say, “I want to be part of all of that happening in the Aokiverse,” we start understanding and respond with “Oh, you really like that? Okay. We are going to try to deliver that if it is possible.” I really believe that in a year’s time, there will be other people in the space that are in the center of certain things that they love. Let’s say there is someone that loves cars, they deserve to be able to say, “This is our membership community to all things in the car culture.” And I really love the person that is in the middle of all that. They should have a membership community.</p><p id=\"L6dh9e\">This is basically what I think is going to happen in a year’s time. Whenever you see really brilliant projects that drop, you think, “Oh, this is great. I’m going to use this idea — this seed — but I am going to put our own DNA into it, and build it out for the community that we are trying to speak to.” My prediction is that this is going to happen a lot more in the next year. Can you time-capsule that?</p><p id=\"5I3Jn8\"><strong>Yes, we are going to have a soundboard of all your predictions, and we’ll play it a year from now. This was great, man. Thanks for going deep with me. I really appreciate it.</strong></p><p id=\"0kI1iB\">Of course, man.</p><aside id=\"7Vn5OF\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe now!\",\"url\":\"https://podcasts.apple.com/us/podcast/decoder-with-nilay-patel/id1011668648?i=1000496212371\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/BMuvt1AdLSwEGxTSvxuYTu65r7E=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23345883/VRG_ILLO_Decoder_Steve_Aoki.jpg",
  "description": "Steve Aoki just launched the Aokiverse and wants to make a song with Elon Musk.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}