{
  "title": "Storms and sea level rise could cost ports billions",
  "url": "https://www.theverge.com/2022/3/16/22980905/storms-sea-level-rise-ports-billions-climate-change",
  "date": "2022-03-16T18:12:40.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Typhoon Maemi Hits South Korea\" src=\"https://cdn.vox-cdn.com/thumbor/oQIASPHXiuoXh9ffX7qbmJxY7ck=/24x0:2976x1968/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70631391/2490313.0.jpg\" />        <figcaption>&nbsp;South Korean workers observe collapsed container cranes after Typhoon Maemi pounded the southern port city of Busan on September 13, 2003 in Busan, about 450km (281 miles) southeast of Seoul, South Korea. | Photo by Getty Images</figcaption>    </figure>  <p id=\"Axre3Y\">Ports around the world stand to suffer billions of dollars in losses if greenhouse gas emissions continue to grow, a new <a href=\"https://www.edf.org/sites/default/files/press-releases/RTI-EDF%20Act%20Now%20or%20Pay%20Later%20Climate%20Impact%20Shipping.pdf\">report</a> finds. Extreme weather, flooding, and rising sea levels would all damage vital seaport infrastructure, disrupting global supply lines.</p><p id=\"VDqnHg\">Losses from storms and climate-related port disruptions could near $10 billion a year by 2050, according to the report, commissioned by the nonprofit Environmental Defense Fund (EDF). By 2100, without action on climate change, those costs could balloon to more than $25 billion a year. For context, that last figure is more than the total operating profits for the entire global container shipping industry in a year.</p><p id=\"tZ9RWD\">Many ports are already <a href=\"https://www.theverge.com/22800410/black-friday-holiday-shopping-supply-chain-pollution-ports-warehouses-california\">overwhelmed</a> after the COVID-19 pandemic exposed <a href=\"https://www.theverge.com/2020/3/13/21177024/apple-just-in-time-manufacturing-china-coronavirus-supply-chain\">weaknesses</a> in global supply chains. Now, ports and the shipping industry have a lot of work ahead of them to cut down their own planet-heating pollution and avoid the worst-case scenarios outlined in the report, its authors warn.</p><div class=\"c-float-right\"><aside id=\"yqOycR\"><q>“The shipping industry has an early warning bell and an opportunity to act”</q></aside></div><p id=\"QVXSp0\">“Just as the COVID-19 pandemic threw our ports and the global supply chain into crisis mode, the climate emergency will have major consequences for international shipping,” Marie Hubatova, senior manager of EDF’s global transport team, said in a <a href=\"https://www.edf.org/media/shipping-industry-and-ports-susceptible-billions-dollars-damage-disruption-climate-change\">press release</a>. “In the face of climate breakdown, however, the shipping industry has an early warning bell and an opportunity to act.” </p><p id=\"WsPf4Z\">Severe storms are one of the biggest threats outlined in the report, particularly when stormwaters mangle infrastructure and vessels. The damage they do to ports accounts for the majority of the losses forecasted in the report. <a href=\"https://www.gfdl.noaa.gov/global-warming-and-hurricanes/\">Evidence</a> is piling up that tropical cyclones are becoming more intense in a warming world. That means more rainfall and even stronger hurricane-force winds. Then there are rising sea levels: when sea levels are higher, destructive waves and storm surges are bigger.  </p><p id=\"o16GLB\">Those changes come with bigger price tags, should storms tear through ports. Hurricane Katrina, which struck the US Gulf Coast in 2005, cost US ports <a href=\"https://www.edf.org/sites/default/files/press-releases/RTI-EDF%20Act%20Now%20or%20Pay%20Later%20Climate%20Impact%20Shipping.pdf\">about $2.2 billion</a>. The economic toll at the port in Mobile, Alabama, alone could have been 5.5 times larger from Katrina if sea levels and storm surges were as high then as some models predict they could be by 2100, the new report says.</p><p id=\"Pdq3Ca\">After storms, there are lingering recovery costs and costly shipping delays. The report also points to costs ports incur in adapting to climate change. Ports might have to raise structures, build <a href=\"https://www.theverge.com/2022/2/28/22953552/sea-walls-coastal-cities-climate-change-adaptation-united-nations-report\">protective barriers</a> like sea walls, or even relocate to higher ground. There are also costs from ships having to chart new routes to avoid bad weather. Weather, which is becoming more extreme as the world warms, was responsible for roughly 1 in 5 vessels lost across the globe from 2015 to 2019, notes the report.</p><p id=\"NWYkh7\">Fortunately, the path forward isn’t set in stone. The report is based on a worst-case scenario for the climate crisis, which is if greenhouse gas emissions continue unabated. The Paris agreement commits nations to <a href=\"https://www.ipcc.ch/sr15/chapter/spm/\">nearly eliminating greenhouse gas emissions</a> by the middle of the century, although <a href=\"https://climateactiontracker.org/global/temperatures/\">the world isn’t yet on track</a> to achieve that goal. </p><p id=\"kc2bJ5\">Some policymakers, however, are also thinking about how to prepare. In the US, a bipartisan infrastructure law last year includes $17 billion in upgrades to ports and waterways — largely to ease congestion. Ports also “face extensive challenges modernizing infrastructure and maintaining essential facilities under threat from sea level rise and other climate challenges,” a White House <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/11/09/fact-sheet-the-biden-harris-action-plan-for-americas-ports-and-waterways/\">fact sheet</a> says.</p><p id=\"ql89fm\">Those efforts will also require cooperation with the private sector. “Tactically there’s this question of, how do you engage with companies to try to help them understand their own asset risk?” Sreenivas Ramaswamy, senior policy adviser at the US Department of Commerce, said at a <a href=\"https://www.youtube.com/watch?v=lhDar40zVKU&amp;_cldee=anVzdGluZS5jYWxtYUB0aGV2ZXJnZS5jb20%3d&amp;recipientid=contact-3e52c67d759aec11a99900155d3b3c69-6f68b09929954e1d8c4df16e0e3bd2f0&amp;utm_source=ClickDimensions&amp;utm_medium=email&amp;utm_campaign=Energy%20%7C%20DOE%20Event%20%7C%203.15.22&amp;esid=59e60c2e-66a4-ec11-983f-0022483527b5\">panel</a> yesterday as he discussed strengthening US supply chains — including ports — against climate change and other risks. Facilitating more collaboration between policymakers and industry is a key foundation for supply chain resiliency, he noted. </p><p id=\"NOhWJY\">Some <a href=\"https://www.theverge.com/2021/10/20/22736701/amazon-ikea-shipping-pollution-major-retailers\">retail</a> and <a href=\"https://www.theverge.com/2021/3/16/22334173/retail-cargo-ships-climate-change-goals-maersk\">shipping</a> giants have moved to use less polluting vessels. That’s vital, since maritime shipping generates nearly <a href=\"https://yaleclimateconnections.org/2021/08/maritime-shipping-causes-more-greenhouse-gases-than-airlines/\">3 percent</a> of global greenhouse gas emissions. The <a href=\"https://www.weforum.org/agenda/2021/10/global-shortagof-shipping-containers/\">vast majority</a> of goods traded, after all, are transported by ship. The shipping industry should “act now or pay later,” the report says.</p><p id=\"4eGXWN\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wHvz2hHTRCpCMIdUfV1pHLHSXXQ=/0x199:3000x1770/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23321135/2490313.jpg",
  "description": "Already overwhelmed ports could face new risks.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}