{
  "title": "Storm-battered UK unites behind live stream of planes trying desperately to land",
  "url": "https://www.theverge.com/tldr/2022/2/18/22940592/big-jet-tv-storm-eunice-heathrow-airport",
  "date": "2022-02-18T12:43:32.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hpOQ_00AmAJhREpWEwYamST2Pdc=/0x0:929x619/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70524582/Screen_Shot_2022_02_18_at_12.23.24_PM.0.jpg\" />        <figcaption><em>A flight trying to land at the London airport.</em> | Screenshot: Big Jet TV</figcaption>    </figure>  <p id=\"nykItx\">As Storm Eunice batters the walls of my flat in South London, I’m taking solace in the fact that I don’t have to do anything difficult like land a plane on a day like today. So naturally I, along with roughly 180,000 other people, have been gripped by a <a href=\"https://www.youtube.com/watch?v=vPQh1FrbOc0\">live stream from London’s Heathrow airport</a>, where Big Jet TV is using a Panasonic HC-VX1 with 24x zoom to show the difficulties pilots are facing as they come in to land against gale-force winds.</p><p id=\"8cqcha\">Each landing is genuinely hair raising, with aircraft routinely approaching the runway sideways as they’re buffeted by the wind measuring in excess of 60mph. But what would already be an interesting live stream is made fascinating by Big Jet TV’s host, who pivots between knowledgeable explanations of each plane and enthusiastic encouragement of the pilots wrestling with today’s conditions with aplomb. </p><p id=\"KjWOWz\">A few fun quotes:</p><ul><li id=\"8nOtBg\">“You’re bleedin’ mad you are”</li><li id=\"OX4LDv\">“Don’t dive towards me mate” </li><li id=\"0HwJMm\">“Flippin’ heck!”</li><li id=\"I1IrbA\">“Next please next please, the doctor will see you now”</li><li id=\"uEUala\">“Bring it in son! Wa-hey!”</li><li id=\"rewxwg\">“Flipping nora, the Aussies have gone mad”</li><li id=\"Z9Rlx6\">“Qatar, let’s see what you’re made of son”</li><li id=\"MSp0sH\">“Beers are on me if you bring her in”</li></ul><p id=\"cGy6fF\">Although each landing has an element of danger, a combination of pilot skill and modern safety systems means an actual crash seems pretty unlikely. So we’re free to enjoy the spectacle of the storm currently battering our little island. Now if you’ll excuse me, a Boeing 777 is just about to attempt a landing, and I don’t want to miss it. </p><p id=\"2eJFAi\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AGZkmm_apUyf-6WZXX-w_1ku-GQ=/0x133:929x619/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23254740/Screen_Shot_2022_02_18_at_12.23.24_PM.jpg",
  "description": "Big fun with Big Jet TV.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}