{
  "title": "Stranger Things season 4 is so big they’re splitting it into two volumes",
  "url": "https://www.theverge.com/2022/2/17/22939060/stranger-things-season-4-netflix-premiere-date",
  "date": "2022-02-17T17:30:15.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Four different sets of people all walking towards the Upside Down.\" src=\"https://cdn.vox-cdn.com/thumbor/nDy5KEk3MhmAmgZP-UpClg5WPBw=/0x505:1500x1505/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70521323/EN_ST4_Main_LocationPayoff_Vertical_27x40_RGB_PRE.0.jpeg\" />        <figcaption>Netflix</figcaption>    </figure>  <p id=\"GopIkT\">Each <a href=\"https://www.theverge.com/2019/7/12/20692109/stranger-things-3-netflix-nielsen-media-research-hit\"><em>Stranger Things</em></a><em> </em>season so far has featured either eight or nine episodes, but according to series co-creators Matt and Ross differ, the <a href=\"https://www.theverge.com/2021/11/6/22765226/stranger-things-4-netflix-trailer-eleven-netflix-release-date\">upcoming fourth season</a> is going to be a little different as it starts to bring the story of Eleven and her friends to its impending close.</p><p id=\"h4SKrq\">Today, Netflix <a href=\"https://about.netflix.com/en/news/stranger-things-the-duffer-brothers-reveal-a-super-sized-season-4-rollout\">shared an open letter</a> from the Duffer Brothers detailing elements of <em>Stranger Things</em>’ fourth season, which they described as “the beginning of the end,” and announcing that the show’s fifth season will be its last.</p><p id=\"ZYt6ea\">“Seven years ago, we planned out the complete story arc for Stranger Things,” the brothers explained. “At the time, we predicted the story would last for to five seasons. It proved too large to tell in four, but — as you’ll soon see for yourselves — we are now hurtling toward our finale.”</p><p id=\"Hrvd0m\">Because of the fourth season’s runtime, the Duffer Brothers and Netflix ultimately landed on the decision to split it into two volumes consisting of nine episodes that will apparently be far longer than any we’ve seen from <em>Stranger Things </em>so far.</p><p id=\"sBvhLl\">“With nine scripts, over eight-hundred pages, almost two years of filming, thousands of visual effects shots, and a runtime nearly twice the length of any previous season, Strange Things 4 was the most challenging season yet, but also the most rewarding one,” the brothers said.</p><p id=\"09zgXA\">Netflix hasn’t shared many details about season 4 aside from <a href=\"https://deadline.com/2021/11/stranger-things-season-4-premiere-update-episode-titles-1234869361/\">its episode titles</a> and a quartet of new posters depicting various <em>Stranger Things </em>characters from important locations all approaching the Upside Down. While the streaming platform’s shared even less about <em>Stranger Things’ </em>fifth season, the Duffer Brothers made clear that while it’s going to bring Eleven’s specific story to a close, that doesn’t necessarily mean that this will be the end of the larger <em>Stranger Things </em>franchise.</p><p id=\"deKSoE\">“There are still many more exciting stories to tell within the world of Stranger Things; new mysteries, new adventures, new unexpected heroes,” the Duffers intoned. “But first we hope that you stay with us as we finish this tale of a powerful girl named Eleven and her brave friends, of a broken police chief and a ferocious mom, of a small town called Hawkins and an alternate dimension known only as the Upside Down.”</p><p id=\"elbCgy\"><em>Stranger Things </em>4 <em>Volume 1</em> premieres May 27th, and <em>Volume 2</em> premieres July 1st.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/363y161YmMwEu-oBiev-hyaWufo=/0x688:1500x1473/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23252233/EN_ST4_Main_LocationPayoff_Vertical_27x40_RGB_PRE.jpeg",
  "description": "Stranger Things season four will have an \"unprecedented length.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}