{
  "title": "Streamers say reported cuts to Twitch pay-outs won’t go down well",
  "url": "https://www.theverge.com/2022/4/29/23048161/twitch-revenue-split-cut-report-bloomberg-streamers-complain",
  "date": "2022-04-29T11:38:51.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/spfLZ-J3v1sqAUMfJBbcjSYLVvI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70809402/acastro_210115_1777_twitch_hate_raid_0002.0.jpg\" />        <figcaption>Illustration by William Joel / The Verge</figcaption>    </figure>  <p id=\"Dgn0lR\">Top Twitch streamers are voicing their anger about reported plans by the Amazon-owned platform to boost profits by cutting pay-outs in its partnerships program. </p><p id=\"6OeATT\">As <a href=\"https://www.bloomberg.com/news/articles/2022-04-27/amazon-s-twitch-seeks-to-revamp-creator-pay-with-focus-on-profit?sref=ExbtjcSG\">reported by <em>Bloomberg News</em></a>, Twitch is considering a number of changes to increase the revenue it collects from its most popular streamers. These include encouraging streamers to run more ads; reducing revenue share for streamers from 70 percent to 50 percent (a favorable deal only available to some of the platform’s biggest draws); and introducing a new tier system allowing streamers to graduate through different revenue splits based on set metrics. </p><p id=\"T8S93I\">As a concession, Twitch could release partners from exclusivity clauses, letting them stream on rivals like YouTube and Facebook. <em>Bloomberg</em> stressed that “updates to the partnerships program aren’t finalized and could be abandoned,” while Twitch refused to comment on the news to the publication. </p><div class=\"c-float-right\"><aside id=\"sqAJRy\"><q>“Makes it worse for everyone except twitch themselves”</q></aside></div><p id=\"aDPdZM\">In response, many streamers said the mooted changes would make life harder, and could force them to move to rival platforms. Others, though, noted that Twitch has no serious competition in the streaming world, allowing the company to extract profits as it sees fit.</p><p id=\"oz3SCC\">“Subscriptions are more important to the life of every streamer than almost any other utility Twitch offers and to touch the split is to financially devastate and potentially remove thousands of full-time creators from your platform it [sic] immediately,” <a href=\"https://twitter.com/JERICHO/status/1519334177996378112\">said Twitch streamer Jericho</a>.</p><p id=\"YaB5Jc\">“What a joke. Makes it worse for everyone except twitch themselves,” <a href=\"https://twitter.com/Jacksepticeye/status/1519314287575154691\">said Irish YouTuber Jacksepticeye</a>. </p><p id=\"CaSfBj\">Left-wing Twitch streamer Hasan Piker said it was “wild” Twitch didn’t consider its current revenue splits profitable enough, but that the platform’s biggest names don’t have anywhere else to go. </p><div id=\"LL5m3h\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">hate to say it but twitch only makes moves like this because they think there is no competitor in the livestreaming space. mixer is dead, fb is a black hole for relevance, and yt is too big to care abt livestreaming and to slow to change. they threw   at some creators &amp; stopped</p>— hasanabi (@hasanthehun) <a href=\"https://twitter.com/hasanthehun/status/1519334445773299712?ref_src=twsrc%5Etfw\">April 27, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"MOmyLw\">“Hate to say it but twitch only makes moves like this because they think there is no competitor in the livestreaming space,” <a href=\"https://twitter.com/hasanthehun/status/1519334445773299712\">tweeted Piker</a>. “Mixer is dead, fb is a black hole for relevance, and yt is too big to care abt livestreaming and to slow to change.”</p><p id=\"hExfUj\">Some streamers, though, did see some positives in the <em>Bloomberg</em> report. “Most streamers are already getting 50/50 and a tier system that automatically moves you higher would be better than BEGGING Twitch for a split,” <a href=\"https://twitter.com/NathanStanz/status/1519382805435666432\">tweeted YouTuber and Twitch streamer Stanz</a>. “Also non-exclusivity being the norm? SOUNDS GOOD TO ME.”</p><p id=\"fTvRPO\">According to <a href=\"https://twitchtracker.com/\">data platform TwitchTracker</a>, the Amazon-owned streaming service currently has around 51,000 individuals in its partnership program. Viewers can pay to subscribe to channels from $5 a month (perks include custom emoticons and ad-free content, if the streamer allows it) with Twitch then splitting this revenue with content creators.</p><p id=\"lPRXnp\">Amazon does not break out revenue figures for Twitch, but the company as a whole has been hit by slowing growth. In its most <a href=\"https://www.theverge.com/2022/4/28/23047095/amazon-q1-2022-earnings-why-stock-is-falling\">recent earning report</a>, although sales increased nearly $8 billion in Q1 year-on-year, analysts still balked at Amazon’s lower-than-expected projections for Q2.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rfp_bWcW0ShAf6Rj8SN5ndGs4Xg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22795418/acastro_210115_1777_twitch_hate_raid_0002.jpg",
  "description": "Top streamers get twitchy",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}