{
  "title": "Stripe, Alphabet, Meta, Shopify, and McKinsey launch new carbon removal initiative",
  "url": "https://www.theverge.com/2022/4/12/23022343/stripe-alphabet-meta-shopify-mckinsey-launch-carbon-removal-initiative-frontier",
  "date": "2022-04-12T20:46:11.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"ICELAND-CLIMATE-CARBON\" src=\"https://cdn.vox-cdn.com/thumbor/a1uSK4eY5ULvmaaZeBIs5dVRJ5Y=/685x0:6289x3736/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70741676/1236290818.0.jpg\" />        <figcaption>Climeworks factory with it’s fans in front of the collector, drawing in ambient air and release it, as largely purified CO2 through ventilators at the back is seen at the Hellisheidi power plant near Reykjavik on October 11, 2021.  | Photo by HALLDOR KOLBEINS/AFP via Getty Images</figcaption>    </figure>  <p id=\"tqFizH\">Big names in tech and consulting just made a $925 million commitment to purchase captured carbon between now and 2030. The pledge — made by<strong> </strong>Stripe, Alphabet, Meta, Shopify, and McKinsey — marks a big investment in carbon removal technologies. </p><p id=\"oMBUvn\">Their new initiative, called <a href=\"https://frontierclimate.com/\">Frontier</a>, is supposed to scale up deployment of the still-emerging tech, while making it more affordable for other companies who are also looking to purchase captured carbon as a way to make up for some of the planet-heating pollution they produce.</p><div class=\"c-float-right\"><aside id=\"O1UZ3q\"><q>The technology is still prohibitively expensive</q></aside></div><p id=\"5oQiwl\">There are already <a href=\"https://www.theverge.com/2021/9/9/22663597/largest-direct-air-capture-plant-c02-climeworks-iceland\">facilities that can filter that CO2</a> out of the air, as well as efforts to store CO2 in rock formations or in the ocean once it’s been captured. But the existing capacity to do this is <a href=\"https://www.theverge.com/2022/4/7/23013822/carbon-dioxide-removal-direct-air-capture-climate-change\">minuscule in comparison</a> to what some climate experts say is needed. Plus, the technology is still prohibitively expensive. </p><p id=\"ayzmHR\">Frontier aims to get costs down by drumming up more demand for the service. It’ll eventually act as a sort of broker between buyers that want to pay to draw down greenhouse gas emissions and suppliers that can do that for them. It’ll have to lay much of the foundation for this kind of market — from creating criteria to vet carbon removal projects to figuring out some sort of system to issue credits to companies that show how much CO2 they’ve paid to remove from the atmosphere.</p><p id=\"dAgno3\">Such a market for carbon removal will have to tread carefully to avoid some of the pitfalls with similar markets for carbon offsets. There’s a <a href=\"https://features.propublica.org/brazil-carbon-offsets/inconvenient-truth-carbon-credits-dont-work-deforestation-redd-acre-cambodia/\">history</a> of carbon <a href=\"https://www.propublica.org/article/the-climate-solution-actually-adding-millions-of-tons-of-co2-into-the-atmosphere\">offset projects failing</a> to actually sequester CO2 in the long term, even as companies that invested in them made claims that they were essentially erasing their carbon footprint. </p><div class=\"c-float-left\"><aside id=\"70vSyA\"><q> Carbon removal isn’t meant to be a get-out-of-jail-free card for corporations</q></aside></div><p id=\"7vsCft\">Crucially, many experts that have called for more carbon removal <a href=\"https://www.ipcc.ch/report/ar6/wg3/\">emphasize</a> that it’s primarily meant to balance out the pollution that’s toughest to prevent. Those “<a href=\"https://report.ipcc.ch/ar6wg3/pdf/IPCC_AR6_WGIII_FinalDraft_FullReport.pdf\">hard-to-abate</a>” emissions typically come from heavy industries, like cement and steel manufacturing, that can’t easily turn to renewable energy. Carbon removal isn’t meant to be a get-out-of-jail-free card for corporations that need to take major steps to curb their pollution in the first place. </p><p id=\"0dJXsC\">Frontier is wholly owned by Stripe, while the other companies are providing initial funding. The new subsidiary builds on Stripe’s previous efforts to promote carbon removal technologies. Stripe initially <a href=\"https://www.theverge.com/2019/8/19/20811981/stripe-carbon-capture-climate-change-pay-negative-emissions\">committed</a> to spending $1 million a year to take CO2 out of the air in 2019. The following year, the online payments platform started <a href=\"https://www.theverge.com/2020/10/28/21537247/stripe-customers-carbon-capture-projects-climate-change\">offering</a> its customers an option to give a portion of the money they make from each sale to carbon removal projects. Those customers’ contributions will also feed into the Frontier initiative. </p><p id=\"U92RVK\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6yy2CeXbFqyy8KxRBJadVCn7sZM=/0x43:6974x3694/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385187/1236290818.jpg",
  "description": "They made a $925 million pledge.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}