{
  "title": "Subaru’s Solterra EV starts at $44,995",
  "url": "https://www.theverge.com/2022/4/26/23042924/subaru-solterra-pricing-starting-ev-tax-incentives",
  "date": "2022-04-26T18:40:25.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/2SgUBw-WqqDrv0JQoIsmSXhsUPY=/60x0:1860x1200/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70796081/Prepro_Standard_AWD_1920x1200.0.jpg\" />        <figcaption><em>Subaru is sticking to its outdoorsy roots when marketing the Solterra.</em> | Image: Subaru</figcaption>    </figure>  <p id=\"6KRtUT\">Subaru has <a href=\"https://media.subaru.com/newsrelease.do?id=1900\">announced the pricing</a> of its first all-electric vehicle, the <a href=\"https://www.subaru.com/solterra-ev\">Solterra SUV</a>. The vehicle, which comes standard with all-wheel drive like most Subarus, will start at $44,995, with the “Limited” and “Touring” trims starting at $48,495 and $51,995, respectively. All models will have an extra $1,225 destination and delivery charge, bumping their cost out the door up a bit more.</p><p id=\"ehRegC\">The Solterra will have an “up to a 228-mile” range, according to Subaru, and will be able to charge 80 percent of its battery in under an hour. While the Limited and Touring models add features like roof rails, wireless charging, and a glass roof, there’s currently not an option to add more range to the vehicle — something that many other manufacturers offer.</p><p id=\"hFSLjY\">As someone loyal to their Subaru Outback, that’s a bit rough. The company touts the Solterra’s “go-anywhere capability,” but my favorite backpacking spot is 108 miles from my house, with a single level two charger available anywhere along the two-ish hour route. I simply couldn’t trust this vehicle to get me there and back again.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oZvCva36t5E9vMsCdn5a4_S4NMA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417498/Screen_Shot_2022_04_26_at_09.51.22.png\">      <cite>Image: Toyota</cite>      <figcaption><em>The Toyota bZ4X, seen above, is very clearly related to the Solterra.</em></figcaption>  </figure></div><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qI7ghVe0LYaRvrGQb56Y_TxtTBM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417506/DSC_3335_v2.jpg\">      <cite>Image: Subaru</cite>      <figcaption><em>I think it may be the fog lights (a feature of the “Limited” model) that make me like the Solterra, seen here, more.</em></figcaption>  </figure></div><p id=\"ZCPsLp\">The Solterra is based on the same platform as <a href=\"https://www.theverge.com/2022/4/12/23022385/toyota-bz4x-ev-suv-pricing-availability-announcement\">Toyota’s bZ4X</a>, which starts at $42,000 for a front-wheel-drive model. If you want the bZ4X with all-wheel drive, you’ll have to pay an extra $2,000 — adding up to still be $1,000 less than Subaru’s model.</p><p id=\"x7oKYS\">Of course, the Solterra and bZ4X aren’t <em>exactly</em> the same car. Yes, they have the same or nearly identical range (when comparing the AWD models, anyways), X-Mode off-road assistance, and infotainment systems, but Subaru’s vehicle has 0.2 extra inches of ground clearance. There are also at least a few stylistic differences between the two vehicles (beyond them being available in different colors), especially around the front; I personally prefer the Solterra’s headlights and grille, though I’m not sure I could point to exactly why. And while I’m not saying I’d pay $1,000 to be able to say “I drive a Solterra” instead of “I drive a B4... no, bZX... wait,” it would at least be a consideration.</p><p id=\"g6DMIj\">There is a complication when comparing prices between the Solterra and bZ4X. Subaru says its EV will be eligible for the $7,500 federal tax credit. While that’s currently available for buyers trying to get their hands on a Toyota, it probably won’t be for much longer, thanks to how many other electrified vehicles the company sells. Toyota executives <a href=\"https://electrek.co/2022/04/11/federal-tax-credits-will-soon-be-phased-out-for-toyota-ev-customers-in-the-us/\">have predicted</a> that by October 2022, anyone looking to buy a bZ4X may only be eligible for a $3,750 tax credit and that the incentive could be gone completely a year later. </p><p id=\"dSpUMa\">Given that Toyota is estimating extremely limited availability for the bZ4X, it may be tough to get it before those tax incentives are gone. If that’s the case, it could make the Solterra’s higher starting price slightly less of a factor. </p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ntpK58FBgy31nQL-HHUi5-Ub5J0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417810/Screen_Shot_2022_04_26_at_11.01.38.png\">      <cite>Map: ChargeHub</cite>      <figcaption><em>There aren’t a lot of chargers in some places people like to take their Subarus.</em></figcaption>  </figure></div><p id=\"qBhCVz\">Of course, realistically, people will also probably compare Subaru’s offering with EVs like the  $40,900 <a href=\"https://www.theverge.com/22960060/kia-ev6-review-electric-specs-price\">Kia EV6</a>, $33,500 <a href=\"https://www.theverge.com/2021/2/14/22280449/chevy-bolt-ev-euv-super-cruise-range-price-specs\">Chevy Bolt EUV</a>, the $42,690 Tesla Model 3, and potentially even the <a href=\"https://www.theverge.com/transportation/2021/9/28/22697309/rivian-r1t-electric-truck-test-drive-off-roading-camp-tested\">Rivian</a>. None of these are perfect comparisons — the Model 3 doesn’t get the tax incentive, and you have to spend another $9,000 to get AWD (though that also boosts it up to a comfy 334-mile range), and the Kia and Chevy aren’t as rugged. But given how expensive the Subaru is, buyers might think long and hard about what they really want from an EV before buying.</p><p id=\"unW36T\">It’s also worth noting that while many manufacturers do technically have EVs, actually buying one can be a bit of a pain at the moment. The widespread shortages that make it difficult to find cars in stock also apply to electric options, and we’ve <a href=\"https://www.theverge.com/2022/1/8/22872969/ford-f-150-lightning-electric-pickup-resale-ban-dealerships-year-scalping-shortages\">seen dealers applying egregious markups</a>. At this point, though, it’s hard to tell whether the same will happen with the Solterra.</p><p id=\"uxTXav\">Subaru says the Solterra will “begin arriving in limited numbers at Subaru retailers this summer.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mT4vnXQy2cv95fh731zoO6lsnrs=/0x98:1920x1103/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23417424/Prepro_Standard_AWD_1920x1200.jpg",
  "description": "It is eligible for the $7,500 tax rebate, though.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}