{
  "title": "Super Pumped is a bumpy Uber ride that gets lost on its way to being interesting",
  "url": "https://www.theverge.com/2022/2/26/22951082/super-pumped-review-uber-showtime-series",
  "date": "2022-02-26T15:27:06.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pVwWYY5oSjwKqUdYDsRz6CjgbMo=/0x0:2028x1352/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70554197/super_pumped_the_battle_for_uber_joseph_gordon_levitt_uma_thurman.0.jpeg\" />        <figcaption><em>Joseph Gordon-Levitt as Travis Kalanick and Uma Thurman as Arianna Huffington in Super Pumped: The Battle for Uber.</em> | Showtime</figcaption>    </figure>  <p>The Fight For Uber is Super Pumped’s first chapter</p> <p class=\"p--has-dropcap\" id=\"zy3IhZ\">Showtime’s <a href=\"https://www.theverge.com/2022/1/10/22877447/super-pumped-season-one-teaser-trailer-uber-travis-kalanick-showtime\"><em>Super Pumped: The Battle for Uber</em></a> is just one of the many dramatizations of major Silicon Valley downfalls that have made headlines in recent years. But unlike <a href=\"https://www.theverge.com/2022/2/25/22948048/the-dropout-review-hulu-elizabeth-holmes\">Hulu’s adaptation of <em>The Dropout</em></a> or Apple’s forthcoming <em>WeWork </em>series, which both focus on the creators of services that have largely fallen out of the public’s favor, <em>Super Pumped </em>revolves around a product many people watching the series still use despite the high-profile scandals associated with it.</p><p id=\"fP2x59\">Adapted from <a href=\"https://www.theverge.com/2019/9/9/20853330/mike-isaac-uber-new-york-times-tech-reporter-super-pumped-vergecast-interview\">Mike Isaac’s 2019 book of the same name</a>, <em>Super Pumped </em>details former Uber CEO Travis Kalanick’s (Joseph Gordon-Levitt) meteoric rise to fame and <a href=\"https://www.theverge.com/2017/6/21/15846014/uber-kalanick-resignation-fowler-blog-post\">eventual ousting</a> from the company in 2017 amid rising concerns about sexual harassment in the workplace, deceiving drivers about wages, user privacy violations, and a cavalcade of other problems. Though these and other pieces of Uber’s history have already been unpacked through multiple years’ worth of reporting, <em>Super Pumped </em>presents them all as fresh puzzle pieces that fit together to form a picture depicting Kalanick as an embodiment of everything that can make unicorn founders as successful as they are reviled.</p>  <figure class=\"e-image\">        <img alt=\"Joseph Gordon-Levitt as Travis Kalanik.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RhUEYgzIp0LnVYQl24Jf1e3buMo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23272698/021722_super_pumped.png\">      <cite>Showtime</cite>      <figcaption><em>Kalanik speaking in front of a crowd.</em></figcaption>  </figure><p id=\"qQjp67\">The idea that being an abrasive asshole (the show’s words) is key to making it in Silicon Valley is something <em>Super Pumped</em>’s Kalanick readily shares with most anyone who’ll talk to him as the series opens on at a time when Uber was already logging over 1 million rides a day. Despite Uber being well past its days of being a startup, <em>Super Pumped</em>’s Kalanick can’t pull himself out of that scrappy, upstart kind of mindset even as those closest to him, like his girlfriend Angie (Annie Chang) and his mother Bonnie (Elizabeth Shue), repeatedly remind him that he’s playing a different game at that point in his career. From Kalanick’s perspective, hustling is a founder’s default state of being, and anyone foolish enough to disagree with him is simply an annoyance destined for dismissal, both from his company and his life.</p><div class=\"c-float-right\"><aside id=\"rQRgrz\"><q>Kalanick’s sees hustling as a founder’s default state of being</q></aside></div><p id=\"jko7MV\"><em>Super Pumped </em>does not shine a light on the secrets of Kalanick’s success as much as it — similar to what <em>The Dropout</em> does with Elizabeth Holmes — illustrates how Kalanick and other figures like him are themselves products of an industry that loves self-aggrandizing mythmakers. Everything Kalanick does and all the airs he puts on are part of his plans to impress power players, like venture capitalist Bill Gurley (Kyle Chandler), who he knows hold the keys to unlocking doors to even greater levels of success. Wild as Kalanick’s plans often are, Uber co-founder Garrett Camp (Jon Bass), Uber’s former chief business officer Emil Michael (Babak Tafti), and Uber’s former head of strategy Austin Geidt (Kerry Bishé) willingly follow his lead because they believe in his process and understand his madness to be a part of it.</p><p id=\"QkKGkZ\">Of Kalanick’s many personal relationships, <em>Super Pumped </em>frames his with Gurley as being the most crucial to understanding Uber’s story even though Gurley’s influence over the company gradually begins to wane. The series details how the friction between the two men — small at first, but ever-growing — was a fixture within Uber that became emblematic of Kalanick’s larger approach to presenting himself and his application to hail ersatz cabs as the Second Coming. Because <em>Super Pumped </em>doesn’t presume that you know all of the ins and outs of Uber’s story, it attempts to lay them all out in painstaking detail like the book it’s based on, and it’s for this reason that the show often feels like a bit of a slog in its first few episodes. </p>  <figure class=\"e-image\">        <img alt=\"Emil, Quentin, and Travis looking at a laptop screen.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pj5Yy53knHidYL73JkS0H7LHquQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23272699/great_new_trailer_for_super_pumped_the_battle_for_uber_starring_jospeh_gordon_levitt.jpeg\">      <cite>Showtime</cite>      <figcaption><em>Emil, Quentin, and Travis deploying Uber’s Greyball.</em></figcaption>  </figure><p id=\"M4xgU1\"><em>Super Pumped </em>knows that its scenes zooming in on the Uber team hammering out system bugs, and chasing stodgy venture capitalists’ money-lined skirts aren’t especially interesting in and of themselves. So, the show attempts to stylistically amp things up with a torrent of on-screen text, cutaway gags, and moments of bombastic narration from Quentin Tarantino of all people. That and a handful of moments in which people break the fourth wall make <em>Super Pumped </em>feel like it’s trying to be something akin to <em>The Wolf of Wall Street.</em></p><p id=\"yVOvoF\"><em>Super Pumped</em>’s prioritization of so-so style over substance wouldn’t be so much of an issue were it not for the very serious subject matter the show eventually gets around to focusing on. It’s when <em>Super Pumped </em>draws lines between points, like Gurley’s concerns about Uber’s spending, Kalanick’s desire to throw drug-field parties because they supposedly energize workers, and Uber’s gender imbalance within its ranks that the show feels like it’s found its voice. Uber’s problem, the show posits, wasn’t just that many of its male employees felt comfortable harassing their female colleagues, but that Kalanick and his right-hand people all enabled that sort of behavior under the auspices of trying to foster a very specific culture of sexist camaraderie within the company. </p><div class=\"c-float-left\"><aside id=\"LWZcY9\"><q><em>Super Pumped </em>tried to amp things up with narration from Quentin Tarantino</q></aside></div><p id=\"EtiiEK\">It’s not until <em>Super Pumped </em>has introduced <em>all</em> of its characters including Arianna Huffington (Uma Thurman) and Tim Cook (Hank Azaria) that the show properly kicks into gear because of the important roles they play in Kalanick’s fate as Uber’s CEO. By the time <em>Super Pumped </em>makes that shift, though, it’s already spent so much time hyperfocused on Kalanick’s paranoia and increasingly erratic behavior that one could easily assume the show doesn’t know how to wrap itself up succinctly. </p><p id=\"POnWGc\">It’s fair to say that <em>Super Pumped</em>, which is an anthology series, is a bit heavy on the backend in a way that makes this first season feel uneven more often than not, but the show may fare much better the next time around with its <a href=\"https://www.theverge.com/2022/2/15/22936393/super-pumped-second-season-facebook-meta-mark-zuckerberg-sheryl-sandberg\">story about Mark Zuckerberg and Sheryl Sandberg</a>.</p><p id=\"MvHdqk\"><small><em>Super Pumped: The Fight for Uber </em></small><small>hits Showtime on February 27th.</small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yS5Xw519LzXQvkU7ykC92AtaLNU=/0x171:2028x1233/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23271667/super_pumped_the_battle_for_uber_joseph_gordon_levitt_uma_thurman.jpeg",
  "description": "Super Pumped: The Fight for Uber is just the first chapter.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}