{
  "title": "Survey shows Netflix is losing more long-term subscribers",
  "url": "https://www.theverge.com/2022/5/18/23125424/netflix-losing-long-term-subscribers-streaming",
  "date": "2022-05-18T22:50:01.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xq6x4ArSBQkbT7vKq2NVJrBoxu8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70885465/acastro_181101_1777_netflix_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"2amUIP\">More long-term Netflix subscribers are canceling their subscriptions, according to a report from <a href=\"https://www.theinformation.com/articles/netflix-cancellations-rise-among-long-standing-subscribers\"><em>The Information</em></a>. Survey data viewed by the outlet revealed that subscribers who have been with the service for more than three years accounted for 13 percent of cancellations in the first quarter of 2022. </p><p id=\"qj452a\"><em>The Information</em> says it got its data from Antenna, an analytics firm that gathers data from 5 million Americans who share their streaming subscriptions anonymously. The data showed that overall cancellations hit 3.6 million people last quarter, an increase from the 2.5 million cancellations in the past five quarters.</p><p id=\"NSGguV\">As the number of cancellations overall has grown, <em>The Information</em> reports that new users are accounting for a smaller share of them — another indicator that Netflix is struggling to retain users for longer periods of time. In the second quarter of 2021, people surveyed who subscribed to the platform for less than one year made up 70 percent of cancellations, while long-term subscribers accounted for six percent. 60 percent of cancellations were made by newer subscribers last quarter.</p><div class=\"c-float-right\"><aside id=\"FvoHcm\"><q>A number of factors are contributing to Netflix’s wavering subscriber count</q></aside></div><p id=\"GoEa5b\">Here at <em>The Verge</em>, a number of my colleagues who’ve been with Netflix for years have already given up their Netflix subscriptions or are at least considering it. Although I’m (admittedly) spoiled and get to mooch off a shared Netflix subscription, I don’t find myself watching it that much anymore due to its selection of shows and movies, some of which I can just as easily find on other services I subscribe to, like Hulu and Peacock. Not to mention that <a href=\"https://deadline.com/2022/03/archive-81-canceled-netflix-one-season-mamoudou-athie-and-dina-shihabi-1234986278/\">it canceled <em>Archive 81</em></a> — and yes, I’m still mad about it — which was actually one of the few shows I enjoyed watching on Netflix.</p><p id=\"sOHgUt\">Plus, like our news editor Richard Lawler aptly points out, <a href=\"https://www.theverge.com/2022/1/20/22893419/netflix-price-increase-q1-2022-earnings\">after all of the rate hikes over the years</a>, Netflix’s “price has risen out of default subscription range, and it’s easily out of ‘forget I even had it’ range,” when compared to cheaper, ad-supported plans from other services like Hulu, which costs just $6.99 / month.</p><p id=\"KusFlh\">Netflix has started 2022 out rough. In the first quarter, <a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">the streaming giant reported losing 200,000 subscribers</a><em>, </em>marking the first time it lost subscribers in over 10 years. On top of that, Netflix expects to lose another 2 million more subscribers in the second quarter of 2022. It currently sits at a total of 74.58 million subscribers in the US and Canada.</p><p id=\"zMfxq0\">A number of factors are contributing to Netflix’s wavering subscriber count. In March, <a href=\"https://www.theverge.com/2022/3/6/22964565/netflix-shuts-down-services-russia-ukraine-invasion\">Netflix suspended its services in Russia</a> due to its war on Ukraine, cutting off around <a href=\"https://variety.com/2022/tv/news/russia-netflix-sue-loss-of-service-1235231822/\">one million subscribers in the country</a>. <a href=\"https://www.theverge.com/2022/3/24/22993562/netflix-price-increase-us-plans-2022\">Netflix later raised the price across all its subscription tiers</a>, bringing its basic plan to $9.99 / month (from $8.99), its standard plan to $15.49 / month (from $13.99), and its premium tier to $19.99 / month (from $17.99).</p><p id=\"ijt7Kl\">We will likely see a number of changes from Netflix within the next year or so, as the platform reportedly told employees it plans on <a href=\"https://www.theverge.com/2022/5/10/23065126/netflix-login-sharing-rollout-ads\">launching a cheaper, ad-supported plan</a> sometime this year. Netflix co-CEO Reed Hastings hasn't been shy about <a href=\"https://www.theverge.com/2022/4/19/23032643/netflix-password-sharing-subscribers-100-million\">cracking down on password sharing</a>, either. </p><p id=\"ZWKToW\">The service is currently <a href=\"https://www.theverge.com/2022/3/16/22981283/netflix-password-sharing-test-multiple-streams\">testing a feature in Chile, Costa Rica, and Peru</a> that will let subscribers add “sub accounts” for anyone using the service outside their households at a lower price. <a href=\"https://www.theverge.com/2022/5/14/23072842/netflix-looking-into-livestreaming-report\">Netflix is also working on livestreaming</a> for comedy specials and other unscripted content. That said, it might want to do that soon if it wants to keep pace with the likes of Disney Plus, which <a href=\"https://www.theverge.com/2022/5/11/23067551/disney-plus-q2-2022-earnings-205-million-streaming-subscribers\">added 8 million new subscribers</a> last quarter and already <a href=\"https://www.theverge.com/2022/4/8/23016891/dancing-with-the-stars-disney-plus-exclusive-abc\">has both a livestreaming</a> feature and an <a href=\"https://www.theverge.com/2022/3/4/22961433/disney-plus-subscription-ad-tier-price\">ad-supported tier</a> confirmed to be in the works.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iexRnvKTJwll810C7TgDaqIFq9M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18956934/acastro_181101_1777_netflix_0002.jpg",
  "description": "The rate of long-term subscribers leaving Netflix is growing",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}