{
  "title": "Sweeping legal ruling orders ISPs to block pirate sites",
  "url": "https://www.theverge.com/2022/5/6/23057391/pirate-site-injunction-isp-blocking-requirement",
  "date": "2022-05-06T19:20:59.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7B5Wa3TXJDcZR23sVDLXya9zwrE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70840958/acastro_170619_1777_FCCserver.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"AVF3vU\">A copyright battle has spawned a sweeping order demanding internet service providers block a set of pirate sites — one of the broadest such rulings to date.</p><p id=\"jWpjJY\"><a href=\"https://torrentfreak.com/us-court-orders-every-isp-in-the-united-states-to-block-illegal-streaming-sites-220502/\">As <em>TorrentFreak</em> recently reported</a>, a New York district judge ruled in late April on a series of copyright lawsuits <a href=\"https://torrentfreak.com/images/1-21-cv-11024-United-King-v-Israel-tv-judgment-injunction-220426.pdf\">against</a> <a href=\"https://torrentfreak.com/images/1-21-cv-11025-United-King-v-Israel-tv-judgment-injunction-220426.pdf\">three</a> <a href=\"https://torrentfreak.com/images/1-21-cv-11026-United-King-v-Israel-tv-judgment-injunction-220426.pdf\">sites</a> that rebroadcast mostly Hebrew-language television. The rightsholders demanded monetary damages from the site operators — who didn’t show up in court — and an injunction meant to prevent viewers from accessing the services. Judge Katherine Polk Failla approved the request and ordered a voluminous list of ISPs to block Israeli-TV.com, Israel.tv, and Sdarot.com. The companies are required to block not only the current addresses but also any domain known to be “used in the future ... by any technological means available.” Users should instead be directed to a page that notifies them of the block.</p><p id=\"j77Ath\">It’s not just ISPs that are affected either. Web hosting providers, web designers, domain name registration services, and advertising companies — among others — are all barred from doing business with the sites.</p><p id=\"lCIWug\">Copyright suits can ask for blocking orders. But it’s highly unusual for them to be this comprehensive, says Meredith Rose, senior policy counsel of the nonprofit Public Knowledge. “That scope of the injunction and listing that many players in it is beyond the norm,” she says. Among other things, third parties are supposed to get a chance to show up in court and contest blocking orders, which raises the barrier to demanding them. That doesn’t appear to have happened in this case.</p><div class=\"c-float-right\"><aside id=\"DaiEBP\"><q>“There are ways to do this that respect due process.”</q></aside></div><p id=\"WDaIkp\">Instead, <a href=\"https://www.techdirt.com/2022/05/04/who-needs-sopa-judge-orders-every-us-isp-to-block-entire-websites-accused-of-enabling-piracy/\">as Mike Masnick of <em>Techdirt</em> outlines</a>, the order is reminiscent of the Stop Online Piracy Act or SOPA-PIPA — a highly controversial bill that was scuttled after <a href=\"https://www.theverge.com/2012/1/18/2715300/sopa-blackout-wikipedia-reddit-mozilla-google-protest\">widespread protests in 2012</a>. SOPA-PIPA would have <a href=\"https://www.eff.org/issues/coica-internet-censorship-and-copyright-bill\">created a category</a> of “rogue” foreign piracy sites that ISPs and other companies were required to ban, something critics said might amount to an overpowered censorship tool. “It is exactly what the content lobby has been pushing to get and explicitly lobbying for for years now. This is sort of a dream scenario for a lot of them,” says Rose. “Rightsholders want to be able to go into court and quickly and easily get one order that they could then hold out to the world that says: do not interact with this particular website.”</p><p id=\"T0AI4Z\">ISPs and other companies — or the defendants — could still contest the order. But it’s not clear the biggest players are going to. AT&amp;T declined to comment on whether it would dispute the decision, and Verizon didn’t respond to a request for comment. (Charter didn’t immediately respond to a more recently made request.) Comcast also declined to say whether it would push back on the injunction but offered slightly more detail. “We only recently learned about it and the implications and are still examining it,” said spokesperson Sena Fitzmaurice.</p><p id=\"Re1HCq\">Rose acknowledges that it’s often difficult to shut down foreign piracy sites at their source instead of trying to ban third parties from dealing with them. But “that’s a State Department problem,” she says. “There are ways to do this that respect due process, and we need to work on those.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RmQOjy1blAVnWaOSU6-iT6xuPKo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8833787/acastro_170619_1777_FCCserver.jpg",
  "description": "They must also block any future versions of the sites.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}