{
  "title": "TCL 30 V 5G review: even on a budget, you can do better",
  "url": "https://www.theverge.com/23037446/tcl-30-v-5g-review-specs-screen-battery-camera-price",
  "date": "2022-04-23T13:00:00.000Z",
  "author": "Allison Johnson",
  "content": "  <p>A good screen and the right 5G bands, but not much else going for it</p> <p class=\"p--has-dropcap p-large-text\" id=\"yVB9Qe\">If you find yourself face to face with <a href=\"https://www.theverge.com/2022/1/27/22904664/tcl-30-v-5g-verizon-price-screen-specs-c-band\">the TCL 30 V 5G</a>, chances are you’re at a Verizon store or on Verizon’s website contemplating its prospects as a “free” phone. Free is nice! But free may even be too steep for the 30 V 5G.</p><p id=\"177mQk\">The 30 V 5G’s full retail price, which few people will opt to pay upfront, is $299. That gets you a nice, big full HD display, a healthy 128GB of storage, 4GB of RAM, and a 4,500mAh battery that easily lasts over a day. Those specs are just fine — even good for a budget phone where lower-res 720p screens and paltry 64GB of storage are not uncommon. </p><div id=\"FUUAgQ\"><div data-anthem-component=\"scorecard:11156517\"></div></div><p id=\"W6rOs1\">But I have one major gripe with the 30 V 5G: laggy performance in almost every aspect of using this phone, from scrolling through menu screens to streaming video. On paper, the phone has the components to perform well enough, but the day-to-day use tells a different story. Life doesn’t need to be this way, even when the phone is free.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EjtBNCK7WSqpxJZ1_Hxwgmcjki8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23405859/ajohnson_220419_5153_0004.jpg\">      <figcaption><em>The 30 V 5G’s NXTVISION technology aims to optimize images and video for better color and contrast.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"9QzNQD\">One of TCL’s key selling points for the 30 V 5G is its screen and the NXTVISION image processing behind it. TCL says this AI-driven feature enhances color and contrast in the media you view on your phone and that it can convert standard definition content to “HDR quality.” In reality, the difference in image quality with NXTVISION on or off can be hard to spot. Streaming <em>Chernobyl</em> on the HBO Max app, I was way too distracted by the frequent framerate drops to care if what I was seeing was SDR or HDR.</p><p id=\"sKnrMz\">The screen itself is fine; it’s a 6.6-inch 1080p LCD that gets bright enough to use comfortably in sunny conditions. It’s a big display with enough resolution to keep things looking sharp, which is great in a $300 phone. But even at this price point, other manufacturers are adding features like higher refresh rates or contrast-rich OLEDs rather than LCD panels. These aren’t necessarily must-haves, but they’re more compelling than NXTVISION.</p><p id=\"BcWUxu\">The Snapdragon 480 5G used by the 30 V 5G is coupled with 4GB of RAM. This is certainly not the worst processor / memory combination in the budget class, but, for whatever reason, it makes for noticeably sluggish performance in this device. Apps close in the background often enough to annoy me, and there’s noticeable stuttering when scrolling through app screens, pulling down the notification shade, and even playing video. </p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GTqKbpVBl8QoFuPb_31YsOqR7s0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23405860/ajohnson_220419_5153_0005.jpg\">      <figcaption><em>There’s a fingerprint sensor on the device’s back panel.</em></figcaption>  </figure></div><p id=\"krDuSi\">Battery life is a bright spot on the TCL 30 V 5G’s report card. I managed to eke out two days of light-to-moderate use on a single charge. With more consistent moderate or heavy use, that kind of longevity would be a challenge, but it would likely stand up to a full day of even heavy use. There’s also a wall charger included in the box, which is increasingly rare these days. There’s no wireless charging, which isn’t too common in the budget category, <a href=\"https://www.theverge.com/2021/4/27/22405828/zte-blade-11-prime-price-specs\">though not unheard of</a>.</p><p id=\"2x2aOp\">The TCL 30 V 5G’s rear-panel fingerprint sensor is quick and reliable, and facial recognition also works well. I’m less pleased with the weak haptics. I’ll often hear the phone buzzing without really feeling it vibrate in my pocket. There’s also no option to adjust the strength of the vibrations. </p><p id=\"NvPl9l\">On the bright side, you do get all flavors of Verizon 5G, including C-band, which is significantly faster than 4G with a wide-ranging signal. You also get millimeter wave (mmWave), which is very fast but scarce. Verizon lumps these two faster varieties of 5G together and calls it Ultra Wideband, and you’ll want to <a href=\"https://www.theverge.com/22606623/best-cell-phone-plans-verizon-att-t-mobile\">check if your phone plan includes it</a> — some only offer access to the C-bandless Nationwide 5G, which isn’t really faster than 4G. If your plan doesn’t include Ultra Wideband and you’d rather not upgrade to one that does, then you might be just fine with a 4G-only phone for now.</p><div class=\"c-float-left c-float-hang\"><aside id=\"7oja4V\"><q>I’ll often hear the phone buzzing without really feeling it vibrate in my pocket</q></aside></div><p id=\"RgUOYj\">One of my least favorite things about this phone really isn’t TCL’s fault — it’s Verizon’s. Since it’s a carrier-locked phone, Verizon has taken the opportunity to load it up with all kinds of proprietary cloud storage and call filtering apps in addition to a bunch of pre-downloaded games like <em>Game of Thrones Slots Casino</em> (why?). Some of them, like <em>Word Trip</em> and <em>CrossWord Jam</em> can be uninstalled, which means setting up the phone is a little more time-consuming, but the Verizon apps can’t be uninstalled, and that is a real pain. </p><p id=\"Fj6ZqJ\">None of this is surprising or unusual on a carrier-specific device, but Verizon takes it as far as setting its own Message Plus as the default SMS app. Google Messages isn’t even pre-downloaded on the phone, but Apple Music<em> </em>is because Verizon wants you to sign up for a six-month free trial through your phone plan and then keep paying for the service when you forget about it after that. Apple Music! On this Android phone!</p><p id=\"WOthgU\">Another software note: the 30 V 5G is pre-loaded with Android 11. There’s no update to Android 12 available right now, and TCL hasn’t confirmed whether it will even get one. The company also hasn’t confirmed how long it will support this device with security updates, but two years has been the standard for the company in recent history.</p><p id=\"wn9P0V\">I noticed a weird quirk with Google Maps, too: when running navigation with the screen turned off and the phone locked, it drops the GPS signal. Most reasonable people probably use Google Maps with the screen on and their phone in a cradle or using their car’s touchscreen. Me, I like to play it fast and loose — punch in my destination, start navigation, lock my phone, and leave it on the seat next to me with nothing but good vibes and my virtual co-pilot’s voice to guide me. This is the first phone I’ve encountered that won’t work like this, and it’s a little odd. Strava <em>does</em> maintain a GPS signal with the phone locked, so this seems to be a Google Maps issue.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SFQXtBf77vlUlv1y_Fv1XIT2lQc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23405857/ajohnson_220419_5153_0002.jpg\">      <figcaption><em>You’ll find three cameras and a flash on the 30 V 5G’s back panel.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"35ABQa\">There are three rear cameras on the 30 V 5G: a 50-megapixel f/1.9 wide angle, a 5-megapixel f/2.2 ultrawide, and a 2-megapixel macro. Around front, there’s a 16-megapixel selfie camera. Photos in good light from all of these cameras look fine, if a little oversharpened. </p><p id=\"RKdfaE\">The main camera is a little squirrely (that’s the technical term) about choosing exposure. Often, I’d move the camera just the slightest between shots and end up with a noticeably darker or lighter image even though the subject matter hadn’t changed materially. I generally like the choices the phone makes for exposure and color, but it sometimes takes a few shots to get to the right answer.</p><div id=\"PLdtD6\"><div data-anthem-component=\"gallery:11156502\"></div></div><p id=\"4AwWDB\">The 30 V 5G struggles in low light but no more so than any other budget phone. It’s not really cut out for photographing moving subjects in low light. Shutter speeds are often too slow, so subjects appear blurry <em>and</em> smoothed over from noise reduction, which isn’t a good look. In very dim conditions, a night mode will kick in, and it does a fine job with subjects  that aren’t moving. </p><p id=\"1cNcfS\">Video resolution is capped at 1080 / 30p, so there’s no 4K, which is becoming more common in phones at all price points. Video quality is fine, but the lack of any electronic image stabilization is very noticeable, and there’s a lot of distracting camera shake in my video clips. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HCxclueS6Pq_KI3NrRnzeKwIOPA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23405858/ajohnson_220419_5153_0003.jpg\">      <figcaption><em>The TCL 30 V 5G doesn’t stand up to its competitors at the $300 price point.</em></figcaption>  </figure></div><p class=\"p--has-dropcap\" id=\"gIPs3g\">The TCL 30 V 5G is not a <em>bad</em> phone. It does just about everything I need it to do: make calls, run apps, take pictures, and wake me up in the morning. It’s just not very good, and there are enough better options at this price point that it’s very hard to recommend it to anyone. TCL is well-known for its good quality TVs at great prices. Maybe the company is still in the process of figuring out what that price / quality equation looks like for phones. </p><p id=\"ZTaxMS\">As it stands now, things aren’t adding up. The screen is good, but it’s hard to enjoy when it’s hampered by choppy performance. It supports the 5G bands that matter, but your phone plan might not even include them. The interface is cluttered with pre-downloads and Verizon services, and NXTVISION is underwhelming. </p><p id=\"4TIIwA\">Thus, the TCL 30 V 5G really only makes sense for someone who doesn’t want a Samsung phone but does want all flavors of Verizon 5G, a healthy amount of built-in storage, and a big, high-resolution display. <em>And</em> they also don’t want to pay anything out of pocket for it.</p><div class=\"c-float-right c-float-hang\"><aside id=\"3cUiD9\"><q>The TCL 30 V 5G really only makes sense for someone who doesn’t want a Samsung phone</q></aside></div><p id=\"hjpSJP\">Otherwise, at the time I’m writing this, Verizon is also offering <a href=\"https://www.theverge.com/22618794/samsung-galaxy-a42-5g-review-screen-battery-price-specs\">the Samsung Galaxy A42 5G</a> for free, and I think that’s a better choice. And, at least right now, that offer is good for a new line on <em>any</em> unlimited plan, not “select” (read: more expensive) unlimited plans required to get the TCL promotion. The A42 5G’s performance and camera quality are a little better, and its Android 12 update is already available. Buying an unlocked <a href=\"https://www.theverge.com/2021/6/12/22529760/samsung-galaxy-a32-5g-review-price-screen-specs\">Galaxy A32 5G</a> for $279 is another good option. The screen isn’t as nice and you’ll need to expand its 64GB of storage with a microSD card, but the camera system is better, C-band Ultra Wideband is supported, and it’s currently being updated to Android 12.</p><p class=\"c-end-para\" id=\"IEed20\">And let’s be clear, there’s no such thing as a free phone. There’s a ton of value in securing your business for the next 36 months — Verizon knows that well. If that’s the currency you’re spending, then I think you should use it on another device.</p><p id=\"GVyRoY\"><em>Photography by Allison Johnson / The Verge</em></p><div><div id=\"KQwwhn\"><div data-anthem-component=\"aside:11156476\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/TX7qCOGBDGm6bA_DK4KpZIthO9s=/0x115:2040x1183/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23409679/ajohnson_220419_5153_0001.jpg",
  "description": "Not your best bet, even if the phone is free.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}