{
  "title": "TCL 6-Series Google TV review: a great Mini LED TV at a good price",
  "url": "https://www.theverge.com/22914122/tcl-6-series-google-tv-r646-review-mini-led",
  "date": "2022-02-03T15:30:00.000Z",
  "author": "Chris Welch",
  "content": "  <p>After a rocky beginning, TCL’s flagship Google TV is a winner</p> <p class=\"p--has-dropcap p-large-text\" id=\"h1Rt7J\">TCL’s first Google TVs were supposed to be a triumphant flex for the second most popular TV manufacturer in the US. Long known for its easy-to-use Roku TVs, TCL has been trying to push the message that it’s adopting a platform-agnostic approach and will offer sets with software from either Roku or Google. (The company has already released many Android TV models internationally.) </p><p id=\"U540jT\">So with the latest update to its 6-Series — model name R646 — TCL set out to blend its best TV hardware with the Google TV experience that debuted on the 2020 Chromecast. The 6-Series has Mini LED technology, truly impressive peak brightness levels, vivid HDR colors, and even includes built-in mics for hands-free Google Assistant voice commands. I reviewed the $1,299 65-inch model. But at any size, the R646 improves upon the older, Roku TV edition of the 6-Series by upgrading two of the four HDMI ports to support full-fledged 4K gaming at 120Hz; the Roku model was limited to 1440p at that frame rate. </p><div id=\"GcR4m9\"><div data-anthem-component=\"scorecard:11010635\"></div></div><p id=\"aw2SJ6\">TCL had all the ingredients for a must-have TV, but it floundered on the execution — at least initially. Soon after the R646 started shipping, buyers complained of sluggish software and buggy performance that often led the TV to freeze or reset itself. The volume of complaints grew so substantial that <a href=\"https://www.theverge.com/2021/12/9/22826619/tcl-6-5-series-google-tv-best-buy-removal-os-bugs-slow\">Best Buy briefly halted sales</a> of the 6-Series and 5-Series Google TVs until TCL could smooth things over with software updates. To the company’s credit, that happened fairly quickly, and TCL has continued to release new updates to address lingering bugs. (This review was published when the current TV firmware was version v97 and on the January security update.) </p><p id=\"fkonp5\">I’ve had the 6-Series Google TV for well over a month now. During my first weeks of testing, the software was clearly too raw and in rough shape. Google TV’s home screen and content recommendation carousels worked mostly as expected, but bringing up and navigating the TV’s settings menus was noticeably laggy. Sometimes the TV would randomly reboot itself — or the screen wouldn’t come on after the first few times I hit the remote’s power button. My roommates reported frequent crashes of apps like HBO Max, and the Dolby Vision badge would occasionally pop up repeatedly while watching a single movie or show. In short, TCL’s first Google TVs shipped with unfinished, undercooked software. Their release should’ve been pushed back by a few weeks or a couple of months until the user experience was more stable, consistent, and with fewer slowdowns. </p><p id=\"kp6vQf\">Thankfully, the software situation on this TV is much better now. And when watching movies and TV shows, the R646 delivers phenomenal picture quality that would have you believe it costs hundreds more. The set’s overall brightness blows my LG CX OLED out of the water; <a href=\"https://www.pcmag.com/reviews/tcl-55-inch-6-series-4k-google-tv-55r646\"><em>PC Mag</em></a><em> </em>measured peak brightness at just under 1,200 nits. Even in the sunniest living rooms, the TCL’s picture would be able to punch through and remain totally visible. This is aided by the panel’s semi-gloss finish, which does a commendable job reducing reflections. </p><p id=\"l6cJwA\">TCL supports HDR10, Dolby Vision, HDR10+, and HLG for HDR formats, which checks all the boxes you could ask for. Watching <em>The Matrix Resurrections </em>on HBO Max<em> </em>was enthralling, and it’s TVs like this that keep me committed to maintaining a 4K Blu-ray collection with recent standouts like <em>Dune</em>. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eXCE-ccahMNkmkGR-jC-Ulve0DM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215200/cwelch_220119_4998_0001.jpg\">      <figcaption><em>Mini LED backlighting gives the 6-Series an impressively bright picture with great contrast.</em></figcaption>  </figure></div><p id=\"lWBuAm\">The speakers are merely adequate, which can be said of most TVs except for high-end Sony and Samsung models that offer premium built-in audio. If you’re buying a TV in this price bracket, odds are you’re pairing a soundbar or speaker system with it. The TV supports Wi-Fi 6 and also has an ethernet jack for wired connectivity. Initial setup is much easier if you’ve got the Google Home app on your phone; you can get the TV up and running there instead of clicking through a ton of on-screen prompts.</p><aside id=\"xcZLts\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Making sense of new TV features in 2022\",\"url\":\"https://www.theverge.com/22884014/tv-features-hardware-screens-hdmi-hdr-vrr-oled-mini-led\"}]}'></div></aside><p id=\"GP971h\">I was impressed by how little blooming I noticed (when viewing normal content and not test patterns) while local contrast was set to “high” and the Mini LED backlighting was working its hardest. Contrast and black levels weren’t quite at OLED levels, but the difference is shrinking as companies continue to iterate upon their Mini LED algorithms and picture performance. TCL includes a number of “auto” options in picture settings — auto brightness, auto color balance, and so on — but I always leave these off for a consistent experience. Same goes for the dynamic tone mapping toggle, which can make HDR and games look even brighter by constantly optimizing the picture, but I prefer leaving this off and letting content come through accurately without the TV constantly adjusting levels on the fly.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/u9vW5juyZfdYt5cHemGLYMdlLTU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215207/cwelch_220130_4998_0008.jpg\">      <figcaption><em>The Google TV home screen offers personalized recommendations.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lHPm82fkvCuzFTwXNsKWPqTPHZw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215205/cwelch_220130_4998_0006.jpg\">      <figcaption><em>Most of the early bugs have been worked out.</em></figcaption>  </figure></div></div></div><p id=\"Y36nvW\">But some bugs and odd quirks still persist. Every so often, the R646 will reset its picture settings to “low power” mode, making me go into the options and set everything back the way it was. TCL tells me it thinks this “previously infrequent” bug has been eliminated after a recent update. What’s more annoying is that by default, the TV will display Dolby Vision content in “Dolby Vision IQ” mode with a slight amount of soap opera effect that <em>can’t be disabled</em> unless you switch the picture mode to “Dolby Vision Bright” or “Dolby Vision Dark,” which unlocks more granular settings for motion.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kuW81aoIZD4kCCoRy5sVMpyGQfI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215201/cwelch_220119_4998_0002.jpg\">      <figcaption><em>The 6-Series Google TV has a built-in mic array for voice commands.</em></figcaption>  </figure><p id=\"lLZAyj\">Toggles for VRR and auto low-latency mode are buried too deep in the menu tree. When TV competitors like Samsung and LG are including “game bars” that put key info in a central place, TCL is definitely lagging a little behind here. Also baffling: the remote control lacks a button for switching inputs; this can only be done by pulling up the quick panel, which <em>does</em> have a dedicated button, and then scrolling over to inputs. I’d have greatly preferred an input shortcut on the remote instead of the branded button for TCL’s Home app that I’ll never, ever use.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pboiT3BOdY-xm0kREbwpJGqF1r0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215209/cwelch_220130_4998_0010.jpg\">      <figcaption><em>Some important features are annoying buried in settings.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AODtpQhN2EOrKjSYz58xKJCp2DA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215220/DSCF7108.jpg\">      <figcaption><em>The remote is a bit confusing and lacks an input button.</em></figcaption>  </figure></div></div></div><div class=\"c-float-right\"><div id=\"hMVHjv\"><div data-anthem-component=\"aside:11008986\"></div></div></div><p id=\"4gRb2U\"><a href=\"https://www.avsforum.com/threads/2021-tcl-6-series-4k-qled-with-google-tv-r646.3211348/\">Some R646 owners on <em>AVS Forum</em></a> have noticed an infrequent video slowdown or “slow motion” effect with the TV; I <em>think</em> I briefly encountered this while watching Sling TV one night and Peacock on another, but it’s hard to be sure when you’re talking about streaming services. It only happened once or twice and corrected itself after about 15 seconds. Hopefully this is another thing TCL can resolve with firmware.</p><p id=\"gepizP\">With a few updates under the TV’s belt, the Google TV software experience is also now where it ought to be. The interface does a great job with personalized recommendations — though it continues to sting that Netflix is unwilling to participate — and the built-in microphone array picked up my “Hey Google” voice queries without any struggles even when the TV was playing something. You can turn off the mics with a physical switch if you’re not a fan of the concept. Google’s OS offers pretty much every streaming app you could want, and also comes with Google Cast built-in. On the flip side, TCL’s Roku TVs support Apple’s AirPlay 2 and HomeKit protocols, but that’s not true of the Google TV models. </p><p id=\"k18GKf\">I tested the R646 with both my Xbox Series X and PS5, and this is one heck of a gaming TV. <em>Uncharted: Legacy of Thieves</em> collection looks stunning in its 4K fidelity mode — same for <em>Forza Horizon 5</em>. <em>Halo Infinite</em> and <em>Uncharted</em> both played great in their 120Hz modes. Some owners have wondered whether TCL might be adjusting or halving the resolution of 4K games when running at 120Hz, but the company insists that the 6-Series Google TV maintains a full 4K output when that’s what it’s receiving from a game. This is a key differentiator from the Roku TV edition, which only supports 1440p at 120Hz. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oa2wZnJvKXZs5mx101Fb1osv0D8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215203/cwelch_220130_4998_0004.jpg\">      <figcaption><em>Two of the HDMI ports support 4K gaming at 120Hz.</em></figcaption>  </figure></div><p id=\"sedKBG\">VRR seemed to work as expected on the Series X, helping to smoothen out gameplay and avoid any noticeable frame rate stutters. But as I mentioned earlier, the TV’s settings can get a little confusing in game mode: the local dimming option can sometimes disappear or display as “off” when VRR is enabled, but it’s actually still enabled and stays at whatever setting you had it at previously. Asked about, TCL spokesperson Rachelle Parks said:</p><blockquote><p id=\"Hq8K2n\"><em>TCL continuously evaluates the usability of TVs, including how to enable advanced controls for the many powerful features available through high-performance TVs like 6-Series.  Although we believe that 6-Series featuring Google TV has the right balance between easy operation and advanced customization, together with our game console and graphics card partners that deliver VRR games, we are studying ways to make gaming even easier for our customers.  And yes – local dimming is available with the game mode setting.</em></p></blockquote><div><div id=\"oqqR20\"><div data-anthem-component=\"aside:11010653\"></div></div></div><p class=\"c-end-para\" id=\"jIJI43\">At the end of the day, TCL’s 6-Series Google TV is among the very best 4K TVs you’ll find in its price range and the sort of set that will keep owners satisfied for years to come. The company made an unfortunate mistake in shipping the R646 with half-baked software, but has managed to correct course in a respectable amount of time. The Google TV 6-Series is technically superior to its older Roku sibling in a number of ways — most importantly with that proper support for 4K 120Hz gaming — and it’s an impressive showcase of TCL’s Mini LED advancements. If you want a bright, bold TV and can find a deal, there’s little reason to hesitate. I wasn’t sure I’d be able to say that back when the software was laggy and bug-prone, but I’ve got no reservations now. </p><p id=\"dZIbpX\"><em>Photography by Chris Welch / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hTdu7HwlOiUFcXCKPZpEcsgvqqc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215204/cwelch_220130_4998_0005.jpg",
  "description": "Updates have resolved most of the early bugs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}