{
  "title": "Tech’s cult of thinness needs to come to an end",
  "url": "https://www.theverge.com/22960574/tech-thinness-battery-life-cooling-durability-galaxy-s22-xps-15-iphone-13-end",
  "date": "2022-03-04T18:10:52.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BiVpoIAHZ0xecG6wAgzXMXmPgnU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70579892/akrales_211027_4820_0151.0.jpg\" />        <figcaption>More devices need to follow in the footsteps of Apple’s recent (bigger) MacBook Pros | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"1FQkXJ\">Gadgets are getting too thin, again. </p><p id=\"c0CaW1\">These past few weeks saw some of the latest victims of the seemingly unending drive towards making our devices as thin as possible, no matter the consequences. <a href=\"https://www.theverge.com/22955139/samsung-galaxy-s22-plus-review\">Samsung’s Galaxy S22 and S22 Plus</a> — what will undoubtedly be some of the most popular Android phones of the year — are thinner than last year’s models and held back by disappointing battery life. <a href=\"https://www.theverge.com/22958468/dell-xps-15-2021-oled-review\">The new Dell XPS 15</a> is “exceptionally thin and light” but barely lasts four hours on a charge and runs nearly as hot as the sun. And <a href=\"https://www.theverge.com/2022/2/21/22944852/oneplus-10-pro-snaps-in-half-durability-test-jerryrigeverything\">the OnePlus 10 Pro</a> is a flagship smartphone that can somehow be snapped in half with your bare hands. </p><p id=\"L86XxY\">It seems that despite over a decade of chasing the thinnest, lightest phones and computers around to the detriment of battery life, cooling, and durability, companies still haven’t learned their lessons. </p><aside id=\"nzOfYT\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Samsung’s Galaxy S22 and S22 Plus are the default Android phones to buy\",\"url\":\"https://www.theverge.com/22955139/samsung-galaxy-s22-plus-review\"},{\"title\":\"Dell XPS 15 review: too hot to handle\",\"url\":\"https://www.theverge.com/22958468/dell-xps-15-2021-oled-review\"}]}'></div></aside><p id=\"VmWUHM\">The science here is not complicated. All other things being equal, putting a bigger battery — broadly speaking — into your phone or laptop means that you’ll be able to get more battery life out of it. A bigger laptop has more room to keep it cool. And if your device is thicker, it is harder to break it in half. </p><p id=\"Q9kz84\">Obviously, that can vary a huge amount by the specifics of hardware, software, firmware, and a myriad of other factors (one of the reasons why Apple’s iPhones have smaller batteries than their flagship Android counterparts but are still competitive on battery life). But generally, if you take identical hardware running identical software to two different batteries, the one that’s got the larger battery pack will win. </p>  <figure class=\"e-image\">        <img alt=\"The Dell XPS 15 open on a wooden table. The screen displays a marbled blue and purple surface.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Wm_3INLA3QKAmu97_EkvHbRXibg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22964109/akrales_211015_4758_0081.jpg\">      <cite>Photo by Amelia Holowaty Krales</cite>  </figure><p id=\"IdaxeA\">And yet, manufacturers are still chasing the dragon of making the thinnest, lightest device. <a href=\"https://www.theverge.com/2022/3/3/22958980/dynabook-portege-x40l-k-laptop-prirce-release-date-specs\">Dynabook just announced its Portégé X40L-K</a>, which aims to be one of the lightest 14-inch laptops ever — but that weight has to come from somewhere.</p><p id=\"RuaCRv\">But it doesn’t have to be this way. Yes, lighter and thinner devices are good, but as with everything in life, there’s balance. Take one of the biggest worshippers at the altar of thinness: Apple.</p><div class=\"c-float-right\"><aside id=\"jBsBdv\"><q>It doesn’t have to be this way</q></aside></div><p id=\"eTm2xo\">Apple spent years full of attempts to slim down its laptops by any means necessary: <a href=\"https://www.theverge.com/circuitbreaker/2020/5/27/21270299/apple-butterfly-keyboard-hardware-design-macbook-pro-physical-key-button\">swapping in its thinner (and absurdly fragile) butterfly switches</a> or excising ports in favor of an all USB-C setup. All this at the same time it was trying to pack even more powerful (and power-hungry) parts and bigger, better displays into its computers. And ultimately, the company’s laptops were worse off for it. </p><p id=\"MSFGPa\">But the company finally caught on, first removing the butterfly switches to go back to the bulkier scissor switches and then going <em>even bigger</em> <em>and heavier</em> with its 2021 redesign. The <a href=\"https://www.theverge.com/22751921/apple-macbook-pro-14-16-inch-2021-m1-pro-max-review\">latest 16-inch MacBook Pro</a> is almost 9 percent heavier than the old model and thicker to boot, despite the fact that Apple’s new Arm-based chips take up less space than its old Intel CPUs and discrete GPUs. Apple could have gone thinner, but it chose not to. Instead, it made a laptop that’s a little thicker but also one of the best laptops we’ve ever used, with battery life and cooling that no other computer on the market can touch.</p>  <figure class=\"e-image\">        <img alt=\"The iPhone 13 Pro is a bit thicker because of a larger battery, so iPhone 12 Pro cases won’t fit.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4ny6ArzeT0abX7U_ZwlO2TJfb_0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22863285/vpavic_210916_untitled_0027.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>  </figure><p id=\"ym7I0n\">Or take last year’s iPhone 13 lineup. 2021’s models were <a href=\"https://www.theverge.com/2021/9/17/22678607/iphone-13-reported-battery-sizes-increase-laptop-comparison\">thicker and heavier</a> across the board than the iPhone 12 lineup from 2020, largely due to Apple conceding that customers wanted phones that could last a full day on a charge and putting in bigger batteries. <a href=\"https://www.theverge.com/22684421/apple-iphone-13-mini-review\">It worked</a> — and the iPhone 13 was a far better device for it, despite being a few fractions of a millimeter and a few grams bigger. Samsung’s Galaxy S22, on the other hand, made a starkly different choice, making its latest phones incrementally thinner but with worse battery life.</p><p id=\"f4neM9\">But tech’s race to the bottom is a losing game in the end. Even if you could make a laptop as thin as a few sheets of paper, the battery life would burn out quicker than a matchstick, too (while getting almost as hot). And if you could somehow manage to solve the first two issues, the tradeoffs in the fragility of such a product would instantly doom it anyway.</p><p id=\"2e0MUA\">It’s time for consumer tech’s cult of thinness to come to an end so that the phones and computers of the future can move on — literally — to bigger and better things. </p><p id=\"5SvAnK\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fWwcPuS7eh9ewJF6mQ6SoePBEn4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22965876/akrales_211027_4820_0151.jpg",
  "description": "Gadgets need to get bigger if we want better battery life.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}