{
  "title": "Telegram now lets you set any sound for your notifications ",
  "url": "https://www.theverge.com/2022/4/18/23030356/telegram-messaging-app-set-any-sound-notifications-update",
  "date": "2022-04-18T17:24:23.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JevZExweBDu6tVfrn2cgpzvDRIc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70763015/acastro_180417_1777_telegram_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"WBeMvk\">In <a href=\"https://telegram.org/blog/notifications-bots#custom-notification-sounds\">a new update</a>, Telegram announced it’s letting users set <em>any</em> sound as their notification tone. You can use short audio files uploaded from your phone and save voice messages as notification tones from a chat. </p><p id=\"Q1dSOg\">Telegram says it currently supports audio files and voice messages under 300KB and less than five seconds long. You can assign a sound to specific chats or whole groups of chats from the Settings &gt; Notifications and Sounds menu. If you don’t have a sound you want to use right away, you can choose from an array of options, ranging from a bell to Merlin the cat, available from <a href=\"https://t.me/s/CustomNotificationSounds\">Telegram’s Notification Sounds channel</a>. </p><div class=\"c-float-right\"><aside id=\"0AIQwd\"><q>There’s new animated food emoji, too</q></aside></div><p id=\"gKmRvC\">Aside from custom notification tones, Telegram has also rolled out custom mute durations. Previously, you could only mute notifications for one hour, eight hours, or two days, but the new update gives you many more options. Now the feature is a bit more practical if you want to pause notifications during a 30-minute drive, for example, or even for a much longer two-month period if you’re on an extended break. The update includes more increments for the <a href=\"https://www.theverge.com/2021/2/25/22301393/telegram-auto-delete-messages-widgets-andoird-ios-update\">auto-delete timer</a>, which automatically makes messages in a chat disappear at a specific time.</p><p id=\"8ETg7k\">Telegram has also made some OS-specific changes, including improved in-app translation on iOS that supports just as many languages as the Android version of Telegram. The messaging app now lets you change the size of the player window in picture-in-picture mode on Android, letting you use pinching gestures to resize the window or hit the “X” button to close the screen. </p><p id=\"l2aZIZ\">Oh yeah, and there's new animated food emoji, too, if you’ve been longing to include a hopping bag of popcorn or a syrupy stack of pancakes with your messages.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sX51fAc2XHIX2ihPpHKKv88Tcig=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10668741/acastro_180417_1777_telegram_0001.jpg",
  "description": "The feature supports audio files less than five seconds long.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}