{
  "title": "Telemedicine leaves behind non-English speakers, study shows",
  "url": "https://www.theverge.com/2022/2/24/22948959/telemedicine-limited-english-digital-literacy",
  "date": "2022-02-24T21:24:03.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"Physician’S Computer\" src=\"https://cdn.vox-cdn.com/thumbor/LoGbKV-7_lsPPX_BorBWI838QO8=/0x209:5000x3542/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70546454/1356576574.0.jpg\" />        <figcaption>Photo by Smith Collection/Gado/Getty Images</figcaption>    </figure>  <p id=\"1OEWSX\">People who speak limited English struggled to access telehealth services in the US during the first year of the COVID-19 pandemic, according to <a href=\"https://www.sciencedirect.com/science/article/pii/S2667321522000166\">a new analysis</a>, affecting their ability to connect with medical care. It’s something <a href=\"https://www.theverge.com/21277936/telehealth-english-systems-disparities-interpreters-online-doctor-appointments\">experts worried about</a> as soon as health organizations made the switch from in-person to virtual care. </p><p id=\"urRHZ1\">“That was really a concern of ours — who is getting left out?” says Denise Payán, an assistant professor of health, society, and behavior at the University of California, Irvine, who worked on the study. </p><p id=\"2VSw1v\">Payán and her colleagues interviewed staff and patients at two community health centers in California about their experiences with telehealth between December 2020 and April 2021. One of the clinics serves a primarily Spanish-speaking population, and the second serves a primarily Chinese-speaking population. Neither had offered video or phone visits before the pandemic started. Both started to them available soon after the California stay-at-home orders in March 2020 — first with phone calls, then with video. The researchers spoke with 15 clinic workers and nine patients. </p><p id=\"j976aI\">Clinic patients who spoke limited English struggled to set up and use platforms like Zoom for health visits, the researchers found. “Things like not being able to read FAQs,” Payán says. “There’s reliance on either clinic personnel, staff, or family members — like kids, who are helping their parents get connected to video visits.” </p><div class=\"c-float-right\"><aside id=\"FL7ZMY\"><q>“There’s reliance on either clinic personnel, staff or family members”</q></aside></div><p id=\"782pHW\">Even if information on a platform was translated into other languages, it was often translated badly. “Patients said, ‘I went into the FAQs in Spanish, and I have high fluency and a high reading level in Spanish, and it made no sense because it was such a poor translation,’” Payán says. </p><p id=\"UIB7US\">Integrating third-party interpreters for non-English speaking patients into telehealth platforms was also difficult, Payán says. It’s a <a href=\"https://www.theverge.com/21277936/telehealth-english-systems-disparities-interpreters-online-doctor-appointments\">logistical challenge</a> to add a third person to a phone or video call, particularly in platforms that aren’t set up to support external interpreting services. That can mean additional delays to care. Even something simple like a patient getting a call from a number they didn’t recognize — and didn’t want to answer — could derail the process. And having those interpretation services are key for good care: people who speak limited English are at <a href=\"https://www.theverge.com/21277936/telehealth-english-systems-disparities-interpreters-online-doctor-appointments\">risk of bad health outcomes</a> without them because they can’t understand their medical providers as well. </p><p id=\"JrslW7\">Luckily, at the clinics Payan spoke with, many doctors and clinic staff were bilingual — they were able to talk with patients in their first language. It showed how much recruiting and retaining staff from the same communities as the patients can help build trust and improve care, particularly during challenging times, Payan says. “It is very important that [the doctor] speaks the same language because that way, we understand each other,” one Spanish-speaking patient said in a study interview. </p><div class=\"c-float-right\"><aside id=\"GxHuGu\"><q>“With that older population, it is a little bit more difficult because they don’t know how to use the technology”</q></aside></div><p id=\"TLdSXn\">But even without language barriers getting in the way, many patients didn’t have the digital literacy to navigate telemedicine, didn’t have devices that could use the telehealth tools, or didn’t have good enough internet access to connect with a provider. “With that older population, it is a little bit more difficult because they don’t know how to use the technology or they need the assistance of their relatives,” one care coordinator <a href=\"https://www.sciencedirect.com/science/article/pii/S2667321522000166\">said in a study interview</a>. Unhoused patients were also particularly hard to reach because they didn’t have reliable phone or internet connections. </p><p id=\"rtUwds\">Phone visits, without a video component, were far more accessible to older patients and patients who spoke limited English. They were great resources for patients and helped connect them with medical care. But they don’t have all the benefits of video calls — like letting a doctor see a patient’s body language or getting a sense of their environment. “Saying, well, we can’t figure out the technology piece, so let’s just do let’s just do audio — I don’t think that’s good enough,” Jorge Rodriguez, a health technology equity researcher at Brigham and Women’s Hospital in Boston, <a href=\"https://www.theverge.com/21277936/telehealth-english-systems-disparities-interpreters-online-doctor-appointments\">told <em>The Verge</em> in 2020.</a> </p><p id=\"83Ngxr\">The findings of the study show how important it is for telehealth platforms to consider their most vulnerable users while developing tools. People who speak languages other than English should be included in pilot tests, for example, Payán says. </p><p id=\"Ior4Mc\">“Increasingly, the focus in Silicon Valley is on diversity, equity inclusion, this is clearly it — are you actually meeting the needs of a diverse set of patients?” she says. </p><p id=\"PNowa4\">Some smaller groups and entrepreneurs in digital health are working to expand internet access and improve digital health tools for vulnerable groups, Payán says. But it’ll take big platforms with high use getting on board to drive major changes. “The onus is on them to really pilot test and prioritize the development of high-quality language services,” she says. </p><p id=\"h0YsQS\"></p><p id=\"GzV7Fb\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/TsSenb0W9BBwl6c2bsmq2HKc0io=/0x566:5000x3184/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268841/1356576574.jpg",
  "description": "They have more trouble with the digital tools.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}