{
  "title": "Telegram forgot to check its email and now it’s banned in Brazil",
  "url": "https://www.theverge.com/2022/3/18/22985737/telegram-brazil-supreme-court-ban-email-address-statement-durov",
  "date": "2022-03-18T23:23:58.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XlcQUrxCuMinFRKKgDY-ABKlAPY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70644071/acastro_180417_1777_telegram_0001.0.jpg\" />        <figcaption><em>The company apparently missed the missive.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ITtAxp\">Telegram’s founder and CEO Pavel Durov has just put out a statement about <em>why</em> <a href=\"https://www.theverge.com/2022/3/18/22985595/brazil-supreme-court-telegram-apple-google-block-order\">Brazil’s Supreme Court is now suspending the app</a>, and the reason is incredible. In the statement, which you can read in full below or <a href=\"https://t.me/durov/180\">on Durov’s Telegram channel</a>, he says it was because his company was <em>checking the wrong email address.</em></p><p id=\"iOwNY4\">“It seems that we had an issue with emails going between our telegram.org corporate addresses and the Brazilian Supreme Court,” Durov says, going on to explain that his company asked the court to send future takedown requests “to a dedicated email address.” But the court didn’t do that, apparently — it kept using “the old general-purpose email address,” and Telegram missed them somehow, and now it’s getting banned, unless the court takes pity. </p><p id=\"g32Y2N\">The company says it’s now found those emails (implying that the old address did at least work, which makes it even more bizarre that the emails somehow got missed), and is trying to remedy the situation with the court. There’s a lot of political context surrounding the ban, which stems from accusations that Telegram facilitates the spread of disinformation, and my colleague Adi Robertson lays it out clearly <a href=\"https://www.theverge.com/2022/3/18/22985595/brazil-supreme-court-telegram-apple-google-block-order\">in this story</a>. But to hear Telegram tell it, the whole thing boils down to an issue we all struggle with — keeping track of emails.</p><blockquote><p id=\"ELUe1q\">It seems that we had an issue with emails going between our telegram.org corporate addresses and the Brazilian Supreme Court. As a result of this miscommunication, the Court ruled to ban Telegram for being unresponsive.   </p><p id=\"SJrYkB\">On behalf of our team, I apologize to the Brazilian Supreme Court for our negligence. We definitely could have done a better job.   </p><p id=\"u2oXLB\">We complied with an earlier court decision in late February and responded with a suggestion to send future takedown requests to a dedicated email address. Unfortunately, our response must have been lost, because the Court used the old general-purpose email address in further attempts to reach us. As a result, we missed its decision in early March that contained a follow-up takedown request. Luckily, we have now found and processed it, delivering another report to the Court today.  </p><p id=\"PjtzT3\">Because tens of millions of Brazilians rely on Telegram to communicate with family, friends and colleagues, I ask the Court to consider delaying its ruling for a few days at its discretion to allow us to remedy the situation by appointing a representative in Brazil and setting up a framework to react to future pressing issues like this in an expedited manner.   </p><p id=\"SBP9N4\">The last 3 weeks have been unprecedented for the world and for Telegram. Our content moderation team was flooded with requests from multiple parties. However, I am certain that once a reliable channel of communication is established, we’ll be able to efficiently process takedown requests for public channels that are illegal in Brazil.</p></blockquote>",
  "image": "https://cdn.vox-cdn.com/thumbor/sX51fAc2XHIX2ihPpHKKv88Tcig=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10668741/acastro_180417_1777_telegram_0001.jpg",
  "description": "\"Oh ahah, sorry I’m just seeing this.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}