{
  "title": "Tern announces a more affordable version of its popular electric cargo bike",
  "url": "https://www.theverge.com/2022/3/9/22967229/tern-quick-haul-electric-cargo-bike-price-specs",
  "date": "2022-03-09T06:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Tics1M6DRILO33d1CcmFXwyxNbs=/0x0:4800x3200/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70597624/TN_QuickHaul_Commuting2.0.jpg\" />    </figure>  <p id=\"K2NxWg\">Taiwanese electric bike company Tern announced a more affordable version of its popular line of cargo bikes. The Tern Quick Haul is as slim and approachable as the company’s other bikes, but with a slightly discounted sticker price. </p><p id=\"eMBDe1\">For years, <a href=\"https://www.theverge.com/22675834/tern-gsd-s10-lx-electric-cargo-bike-review-specs-price\">Tern’s GSD</a> and <a href=\"https://www.theverge.com/22274747/tern-hsd-p9-ebike-review-electric-cargo-bike-price-specs\">HSD models</a> have delighted customers looking for powerful, high-performance e-bikes with plenty of cargo space. Now, the company is introducing a slightly smaller model for city-dwelling customers who care as much about parking and storage as they do about hauling kids or groceries. </p><p id=\"dtr2G1\">Another major selling point is the starting price. The Quick Haul lineup comes in two models: the D8, a Class 1 e-bike with a top speed of 20mph, which starts at $2,999; and the P9, a Class 3 bike with a top speed of 28mph, starting at $3,999. A third model, the P5i, will be introduced in Europe first with other markets to follow. </p><p id=\"T5gPHJ\">That may still be too expensive for some customers, but it represents a discount when compared to Tern’s previous models, including the GSD ($5,499 for single-battery configuration, $6,299 for the dual-battery) and the HSD (which starts at $3,199). Regardless, when it comes to cargo bikes, I try not to compare them to other non-electric bikes, but rather to the car I am trying to replace. Using that rubric, the e-bike is always the cheapest option. </p><div class=\"c-float-right\"><aside id=\"qFIwwH\"><q>An e-bike is always the cheapest option</q></aside></div><p id=\"1VYBDc\">Tern says it priced the Quick Haul to be eligible for potential tax credits, should the US Congress decide to pass the E-Bike Act. The bill is included in <a href=\"https://www.theverge.com/2021/10/28/22751273/ebike-tax-credit-build-back-better-biden\">President Joe Biden’s Build Back Better social welfare package</a>, which is currently stalled in Congress. Tern and other companies are hoping that the bill can still live on, even if lawmakers fail to come to a consensus on Biden’s plan. </p><div id=\"V1tNvO\"><div data-anthem-component=\"gallery:11084090\"></div></div><p id=\"TIBeLa\">Also, Tern’s e-bikes are pricey because the company builds them using some of the best parts and components in the industry. The Quick Haul is no different, with its Bosch Active Line Plus or Performance Line Sport motor and Shimano Nexus 5 hub. The P5i model will come with a Gates carbon belt drive, which is quite popular with e-bike makers these days because it is cleaner and easier to maintain than traditional metal chain transmissions. </p><p id=\"63llBJ\">The Tern Quick Haul distinguishes itself with its modularity, too. With a max gross vehicle weight of 330 pounds (150kg), the Quick Haul is a comfortable ride for a kid or even a second adult. The seat and stem are adjustable, meaning the bike can be used by people of varying heights. </p><p id=\"k07qr1\">The Quick Haul is shorter than Tern’s previous models, and with a low center of gravity, it should be easy to maneuver through narrow city streets or throw transit hubs, like subway or bus stations. And the rear rack doubles as a stand for when you want to park the bike vertically, which is a great space-saver for anyone who keeps their bike in their apartment. And while the handlebars do not fold down, unlike Tern’s other models, the Quick Haul is compatible with the company’s vast constellation of accessories, including the Clubhouse, Storm Box, and Storm Shield. </p><p id=\"Zp1i97\">Interestingly, Tern is also marketing the Quick Haul as a perfect bike for delivery businesses. With its sturdy frame and cargo capacity, the company says this model is a “reliable workhorse” for any business looking to grow its delivery options. The company has long sought to <a href=\"https://www.bicycleretailer.com/announcements/2018/11/29/tern-launches-bikesforbusiness#.YieK7xPMLt0\">position itself as a commercial partner</a> in addition to being a consumer-facing brand. </p><p id=\"ehUAkB\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nb476QhtAMsiD2C5m63YMy9_ueU=/0x344:4800x2857/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23298074/TN_QuickHaul_Commuting2.jpg",
  "description": "Shorter and cheaper than Tern’s other models.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}