{
  "title": "Terra’s crash has left some other stablecoins and protocols on shaky ground",
  "url": "https://www.theverge.com/2022/5/16/23075139/stablecoin-terra-crash-depeg-dei-fantom-usd-scream-defi-instability",
  "date": "2022-05-16T19:38:11.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/L1AtLwGpVFYwPxQC2jcxMxbuM1w=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70875693/acastro_170726_1777_0008.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"VlwIoW\">In the wake of the sudden collapse of TerraUSD, several other stablecoins’ values (whose values are supposedly pegged to the dollar) have started facing issues.</p><p id=\"KWeUbF\">Deus Finance’s <a href=\"https://www.coindesk.com/markets/2022/05/16/fantom-stablecoin-dei-becomes-latest-to-lose-dollar-peg/\">DEI coin</a> is currently trading at around 66 cents and has been <a href=\"https://coinmarketcap.com/currencies/dei/\">fluctuating since Sunday</a>, reaching a low of around 52 cents early Monday morning.</p><p id=\"iOpYer\">Unlike other major stablecoins like USD Coin and Tether, which (<a href=\"https://www.theverge.com/22620464/tether-backing-cryptocurrency-stablecoin\">allegedly</a>) have actual dollars or assets backing them, DEI’s values are controlled by algorithms making trades. It’s not that there’s <em>no</em> collateral — as <a href=\"https://cointelegraph.com/news/deus-finance-s-dollar-pegged-stablecoin-dei-falls-below-60-cents\"><em>CoinTelegraph</em> points out</a>, there’s a DEUS token that you can use to get new DEI tokens and that you can receive if you redeemed DEI. Unlike with Terra, where the value of the corresponding coin crashed, <a href=\"https://coinmarketcap.com/currencies/deus-finance-2/\">the value of DEUS</a> seems to be holding up okay.</p><p id=\"Igqg6f\">The Terra coin lost its peg to the dollar, eventually leading to <a href=\"https://www.theverge.com/2022/5/12/23069232/terra-luna-collapse-stablecoins-crypto-crash-bitcoin\">massive inflation</a> in the accompanying Luna coin. Eventually, the Terra blockchain was frozen, and many major exchanges delisted it from sale. The result has been a major blow to the credibility of stablecoins, previously seen as the safest commodities in the volatile cryptocurrency world.</p><div class=\"c-float-right\"><aside id=\"4FxisZ\"><q>Stablecoins are having a moment, so small dips can turn into big worries</q></aside></div><p id=\"uGQeTY\">The destabilization of DEI and other coins has also opened up a new attack on a decentralized finance protocol called Scream, which lets users borrow cryptocurrencies by posting other ones as collateral. <a href=\"https://www.theblockcrypto.com/post/147046/defi-lender-left-with-35-million-bad-debt-after-quoting-depegged-stablecoins-at-1\">According to <em>The Block</em></a>, Scream had the price of DEI hardcoded to $1 — so attackers were able to buy DEI coins for less than $1 and post them as a full dollar’s worth of collateral. The result has left many Scream users unable to withdraw their deposits, left holding the bag on the protocol’s bad debts. </p><p id=\"Sc3iHw\">In the case of DEI, primary lenders have “agreed to repay back all debts borrowed out,” <a href=\"https://twitter.com/Screamdotsh/status/1526138254185181184?s=20&amp;t=HuVixW4N96QMQJgjlhNo4A\">according to Scream</a> — but other hard-coded stablecoins are continuing to cause problems. Another coin called Fantom USD has also depegged from the dollar and is currently trading around 83 cents. Scream also had Fantom USD’s listed at $1 despite its depegging — though <a href=\"https://twitter.com/Screamdotsh/status/1526138207372550144?s=20&amp;t=ePeeWWNePQwMn9BLVK-71Q\">that’s changing</a> — letting people play the same trick in a separate currency.</p><p id=\"WeDkCj\">As for Deus, it seems like there is a plan on getting DEI back to its $1 value. In a Medium post on Sunday, a member of Deus’ controlling organization said that Deus <a href=\"https://lafayettetabor.medium.com/dip-7-treasury-bonds-4cc886148b9e\">will start selling treasury bonds</a>. Yes, like the ones the US Treasury does — in fact, the post says that the idea is “inspired by the best stable coinproject [sic] in human history, the US dollar.” Basically, users will put up something in collateral and get a bond they can “redeem 1 DEI for 1$ worth of” the collateral. </p><p id=\"Q1s1Jv\">Of course, Deus is promising to pay interest on the bonds, too. The idea, according to the post, is that this will help make sure DEI has “an unbreakable backing at 1 DEI: 1 USDC.” Deus also recently made some changes to its processes in April, when it <a href=\"https://lafayettetabor.medium.com/new-dei-peg-mechan-1af3e3d9a975\">implemented a new mechanism</a> to make sure DEI stays at its peg after it destabilized a few times in March.</p><p id=\"WcRIrp\">Deus <a href=\"https://twitter.com/DeusDao/status/1526195318341218305\">says on Twitter</a> that it’s “working around the clock to restore the DEI peg” and promises further updates.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9inLHdPYtMB1pyO936DAKt3d7b4=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8954807/acastro_170726_1777_0008.jpg",
  "description": "Terra may have done a number on the stablecoin market.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}