{
  "title": "Tesla fired employee who reviewed its driver assist features on YouTube",
  "url": "https://www.theverge.com/2022/3/16/22980580/tesla-fired-employee-john-bernal-ai-addict-youtube-full-self-driving-beta-reviews",
  "date": "2022-03-16T10:21:15.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/96kDYrJn59mqFv1MfofLRTb-pHA=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70629029/Screenshot_2022_03_16_at_09.02.56__2_.0.png\" />        <figcaption>Image: <a class=\"ql-link\" href=\"https://youtu.be/6vEcXc8Zxxs\" target=\"_blank\">YouTube / AI Addict</a></figcaption>    </figure>  <p id=\"XdEx6X\">Tesla has a complicated relationship with customers who pay to test the beta version of its “Full Sell Driving” software. Often, these people are diehard fans, keen to promote the company’s prowess and show off its new driver assist features. Sometimes, though, they overshare — posting videos that show exactly when and how Tesla’s software gets it wrong.</p><p id=\"wrCigj\">When the person sharing these clips also works for Tesla, things are even more complicated. John Bernal, a former Tesla employee who reviewed the company’s FSD Beta software on his YouTube channel <a href=\"https://www.youtube.com/channel/UCnSt1nfVXyTyMbKhk-IaTJw\">AI Addict</a> says he was fired by the company last month after posting a video that showed his Tesla <a href=\"https://youtu.be/sbSDsbDQjSU\">hitting a bollard</a>. </p><div class=\"c-float-right\"><aside id=\"1NcGU8\"><q>Bernal says he was told his YouTube channel was a “conflict of interest”</q></aside></div><p id=\"FprX0C\">As <a href=\"https://www.cnbc.com/2022/03/15/tesla-fired-employee-who-posted-fsd-beta-videos-as-ai-addict-on-youtube.html\">reported by <em>CNBC</em></a>, Bernal says that prior to his dismissal he was told verbally by his managers that he “broke Tesla policy” and that his YouTube channel was a “conflict of interest” (though his written separation notice did not specify a reason for his dismissal). Bernal said he’d previously been approached by managers after posting a video in March 2021 that showed <a href=\"https://youtu.be/antLneVlxcs\">a number of close calls with pedestrians and cyclists</a> while using the FSD beta software. The video has more than 250,000 views and was shared widely on social networks like Twitter. </p><div id=\"cBmP1F\"><div ><iframe src=\"https://www.youtube.com/embed/antLneVlxcs?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"p0F36F\">Bernal said that after posting the video, “A manager from my Autopilot team tried to dissuade me from posting any negative or critical content in the future that involved FSD Beta. They held a video conference with me but never put anything in writing.” </p><p id=\"RcE857\"><em>CNBC</em> says Tesla’s social media policy for employees does not forbid criticism of the company’s products in public, but notes that the company “relies on the common sense and good judgment of its employees to engage in responsible social media activity.” Bernal says that after being fired, his access to the FSD Beta software was revoked.</p><p id=\"MyfAoa\">The FSD Beta gives customers who pay for the company’s advanced driver assist software (branded by Tesla as “Full Self Driving,” to the annoyance of <a href=\"https://www.theverge.com/2022/1/26/22901349/self-driving-coaltion-rebrand-autonomous-vehicle-industry-tesla\">many industry groups</a>) access to experimental updates. Tesla says <a href=\"https://seekingalpha.com/article/4482970-teslas-ace-in-the-hole-60000-fsd-beta-testers\">some 60,000 customers</a> are signed up to test FSD Beta on public roads, providing it with invaluable data to improve the software. The company says there have been zero accidents or injuries involving FSD Beta since its launch (though there have been a number of deaths where Tesla’s regular driver assist software was involved). </p><p id=\"aIOchY\">Tesla previously required customers who opted in to the FSD Beta to <a href=\"https://www.theverge.com/2021/9/28/22696463/tesla-fsd-beta-nda-video-clips-controversy-full-self-driving\">sign a non-disclosure agreement</a>, which told signatories: “there are a lot of people that want Tesla to fail; Don’t let them mischaracterize your feedback and media posts.” Tesla CEO Elon Musk later said <a href=\"https://www.theverge.com/2021/9/28/22699361/elon-musk-tesla-full-self-driving-beta-nda-footage\">the company “probably” didn’t need the NDAs</a> as people tended to ignore them anyway. </p><p id=\"flBz93\">A number of FSD Beta testers post reviews of the company’s software on YouTube, and Bernal says he intends to maintain his channel (though he now needs to borrow friends’ cars to test FSD Beta). As Bernal told <em>CNBC</em>: “I still care about Tesla, vehicle safety and finding and fixing bugs.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LDDZGTMO4qyeH_kn-Xp8_l_iifw=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23319993/Screenshot_2022_03_16_at_09.02.56__2_.png",
  "description": "Tesla has a complicated relationship with its beta testers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}