{
  "title": "Tesla sues former engineer for allegedly stealing its supercomputer’s secrets",
  "url": "https://www.theverge.com/2022/5/7/23061523/tesla-sues-former-engineer-allegedly-stealing-supercomputer-technology-project-dojo",
  "date": "2022-05-07T22:37:40.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1S9ar2JI-LLn0anYLd_FsECyc_o=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70843996/acastro_180430_1777_tesla_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"wMYjnj\">Tesla is suing former engineer Alexander Yatskov for allegedly stealing “confidential and tightly guarded” information related to the company's supercomputer technology, called Project Dojo, as first reported by <a href=\"https://www.bloomberg.com/news/articles/2022-05-06/tesla-sues-engineer-over-dojo-supercomputer-technology-theft\"><em>Bloomberg</em></a>. In a <a href=\"https://ecf.cand.uscourts.gov/cgi-bin/show_multidocs.pl?caseid=395269&amp;arr_de_seq_nums=3&amp;magic_num=&amp;pdf_header=&amp;hdr=&amp;pdf_toggle_possible=&amp;caseid=395269&amp;zipit=&amp;magic_num=&amp;arr_de_seq_nums=3&amp;got_warning=&amp;create_roa=&amp;create_appendix=&amp;bates_format=&amp;dkt=&amp;got_receipt=1\">copy of the complaint</a>, Tesla accuses Yatskov of downloading the information to his personal devices and refusing to give it back.</p><p id=\"1Vq7cQ\">Yatskov, who Tesla claims lied on his resume about his work history and skillset, started working for the electric vehicle maker as a thermal engineer in January and aided in the design of Dojo’s cooling systems. <a href=\"https://www.theverge.com/2021/8/18/22627101/tesla-event-ai-day-rumors-elon-musk-what-to-expect\">Dojo is Tesla’s neural net training computer</a> that processes large amounts of data used to train the AI software in Tesla’s self-driving cars. According to the complaint, Yatskov had access to Dojo’s cooling information, as well as other confidential information associated with the project. </p><div class=\"c-float-right\"><aside id=\"cCUwph\"><q>Tesla claims Yatskov admitted to stealing the information</q></aside></div><p id=\"rXXVYo\">Tesla says all engineers sign a non-disclosure agreement that should prevent them from disclosing or storing confidential information about Dojo, which Tesla says Yatskov has violated by allegedly “removing Tesla confidential information from work devices and accounts, accessing it on his own personal devices, and creating Tesla documents containing confidential Project Dojo details on a personal computer.” The company also says it discovered Yatskov sending emails with classified Tesla information from his personal email address to his work email.</p><p id=\"n1W3NM\">As noted in the complaint, Tesla claims Yatskov admitted to storing classified information on his personal devices when the company confronted him about the situation. The EV maker then put Yatskov on administrative leave starting April 6th, 2022, and asked him to bring in his devices so Tesla could recover any stolen information. Yatskov responded by allegedly providing Tesla with a “dummy” laptop in an attempt to conceal any evidence against him. This purported decoy contained none of the information in question, and was made to “look like it may have accessed only inoffensive Tesla information, like an offer letter.”</p><p id=\"jMTyI3\">Yatskov resigned from his position on May 2nd. Tesla is suing Yatskov for compensatory and exemplary damages, and is also seeking a court order that would force Yatskov to return the classified information.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/t3DT8qyznxCW4ahGTwGCSC4l56s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10752835/acastro_180430_1777_tesla_0001.jpg",
  "description": "The engineer allegedly stored classified information on his computer.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}