{
  "title": "Tesla owners report dozens of instances of ‘phantom braking’",
  "url": "https://www.theverge.com/2022/2/2/22914236/tesla-phantom-braking-complaints-nhtsa-fsd",
  "date": "2022-02-02T16:31:42.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IG15OvfK-o2R8alZUqakNzVEx9A=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70462529/tesla_model_y_3543.0.jpg\" />        <figcaption>Photo by Sean O’Kane / The Verge</figcaption>    </figure>  <p id=\"BVRNaC\">Tesla vehicles are inexplicably slamming on their brakes for no reason, frightening owners and eliciting over 100 complaints to the federal government in the last three months alone, <a href=\"https://www.washingtonpost.com/technology/2022/02/02/tesla-phantom-braking/?utm_source=twitter&amp;utm_campaign=wp_main&amp;utm_medium=social\">according to <em>The Washington Post</em></a>. </p><p id=\"jTq6kM\">It’s been a persistent issue for the automaker. Last October, Tesla CEO Elon Musk said on Twitter that the company was <a href=\"https://www.theverge.com/2021/10/24/22743628/elon-musk-tesla-fsd-beta-10-3-rollback-issues-phantom-fcw\">forced to “roll back” version 10.3 of its Full Self-Driving beta software</a> because of issues with forward collision warnings and phantom braking. </p><p id=\"DXuOdo\">But since then, the number of complaints about Tesla’s braking has spiked. According to <em>The Washington Post</em>’s analysis, reports from Tesla owners about phantom braking to the National Highway Traffic Safety Administration (NHTSA) rose to 107 complaints in the past three months, compared with only 34 in the preceding 22 months. </p><div class=\"c-float-right\"><aside id=\"HPvRMW\"><q>“No other cars around. Flat, clear open freeway.”</q></aside></div><p id=\"EP3rJh\">“Using adaptive cruise control with autopilot steering (as well as without Autosteer), multiple episodes of severe ‘phantom breaking [sic]’ where the car slams on the breaks [sic] for no apparent reason,” a Model Y owner from Sterling, Ill., wrote in a November 16th complaint. “No other cars around. Flat, clear open freeway.”</p><p id=\"cSNkAU\">Another Model Y owner, who reported installing FSD in October 2021, said they “immediately” experienced issues with Autopilot and Traffic-Aware Cruise Control after the update was installed, including “spurious forward collision warnings.” “These warnings involved the standard warning beeps and red indicators on the driving display, and at one point included an unnecessary emergency braking incident when no obstacle was in front of me,” this person wrote. “As such, I had reverted to driving the car in manual mode, not on autopilot,” this person wrote. </p><p id=\"lE5lJc\">A Model 3 owner in San Ramon, Calif., reported “numerous phantom braking events when on [A]utopilot. These seemingly happen out of nowhere, various conditions, and for no apparent reason.” </p><p id=\"qoaF18\">The problem may be traced to the controversial decision last year to <a href=\"https://www.theverge.com/2021/5/25/22453518/tesla-vision-radar-autopilot-model-3-y-fsd\">remove radar sensors from new Model 3 and Model Y vehicles</a>. The decision came after Musk publicly expressed a desire to rely on cameras to power the company’s advanced driver assistance system.</p><div class=\"c-float-right\"><aside id=\"QrIbjX\"><q>The problem may be traced to the controversial decision last year to remove radar sensors from new Model 3 and Model Y vehicles</q></aside></div><p id=\"1qAhB8\">Tesla has drawn intense scrutiny from safety advocates and regulators for its willingness to allow its customers to test what is essentially an unfinished version of a product that Musk has long promised will lead to fully autonomous vehicles on the road. Earlier this week, the company was forced to issue a software update to remove an FSD feature that allows cars to perform a “rolling stop” — a maneuver in which the vehicle moves slowly through a stop sign without coming to a full stop. (A rolling stop is a common driving maneuver despite being illegal in all 50 states in the US.)</p><p id=\"cP2WrQ\">A spokesperson for NHTSA said the agency was “aware of complaints received about forward collision avoidance and is reviewing them through our risk-based evaluation process. This process includes discussions with the manufacturer, as well as reviewing additional data sources, including Early Warning Reporting data. If the data show that a risk may exist, NHTSA will act immediately.”</p><p id=\"05ud4X\">During an earnings call last week, <a href=\"https://www.theverge.com/2022/1/26/22903136/tesla-q4-earnings-profit-chip-shortage-cybertruck-elon-musk\">Musk cited FSD as “a primary area of focus.”</a> FSD is a beta version of an advanced driver-assist system that controls some of the car’s functions on local roads but still requires human supervision. In contrast, autonomous vehicles are cars that can operate on public roads without any human intervention or supervision.</p><p id=\"5YzmSK\">Still, the company claims that FSD will lead to more profits in the future thanks to the “higher utilization of our vehicles.” Musk has said that once Tesla’s cars are able to drive themselves, the company will leverage that capability into <a href=\"https://www.theverge.com/2019/4/22/18510828/tesla-elon-musk-autonomy-day-investor-comments-self-driving-cars-predictions\">a robotaxi fleet.</a> The goal is to make it so that each Tesla customer’s car can double as an autonomous vehicle that other people can hail while the owner isn’t using it.</p><p id=\"3gf9QR\">Tesla said it released seven over-the-air software updates for FSD over the quarter and that there are currently 60,000 vehicles operating with the advanced driver assist system in the US.</p><p id=\"jxbJ5i\">Last fall, complaints began to surface on social media of problems with some Tesla vehicles. Owners said the 10.3 update of FSD introduced phantom forward collision warnings, while <a href=\"https://www.reddit.com/r/teslamotors/comments/qeu10x/known_fsd_beta_103_taccautosteer_bug/\">others noticed</a> a disappearing Autosteer option, traffic-aware cruise control (TACC) problems, and occasional Autopilot panic. </p><p id=\"gghjJG\">Now it’s clear some owners were also filing complaints with NHTSA. To be sure, the agency does not individually verify each complaint. Owners submit a description of the issue, their vehicle identification number, and other identifying information when they report their problems to the agency. </p><p id=\"y3t4K3\">Late last year, a Tesla Model Y with FSD allegedly crashed southeast of Los Angeles. No one was injured in the crash, but the vehicle was reportedly “severely damaged.” The incident was reported to NHTSA, but there were no media reports of the crash, leading some Tesla fans to dismiss the incident as fake. </p><p id=\"TyNrWi\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/eHyO5mzExquHsQeUoScwg6NlhQU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963757/tesla_model_y_3543.jpg",
  "description": "New complaints have dramatically increased in 3 months.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}