{
  "title": "Tesla officially opens Berlin Gigafactory",
  "url": "https://www.theverge.com/2022/3/22/22808108/tesla-gigafactory-open-production-start-elon-musk",
  "date": "2022-03-22T11:01:21.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"Opening Tesla Factory Berlin Brandenburg\" src=\"https://cdn.vox-cdn.com/thumbor/B9C3jftS792Qj5HuZEs35Fcin-I=/420x0:5183x3175/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70655826/1239408887.0.jpg\" />        <figcaption><em>Tesla cars in front of its new factory in Germany.</em> | Photo by Patrick Pleul/picture alliance via Getty Images</figcaption>    </figure>  <p id=\"3LMRjH\">Tesla’s fourth Gigafactory, and its first in Europe, is officially being opened today by the company’s CEO Elon Musk, <a href=\"https://www.reuters.com/business/autos-transportation/tesla-hands-over-first-model-ys-german-gigafactory-finally-goes-live-2022-03-22/\"><em>Reuters </em>reports</a><em>.</em> The milestone was reached <a href=\"https://www.theverge.com/2019/11/12/20961812/elon-musk-berlin-tesla-ceo-fourth-gigafactory-construction\">around two and a half years</a> after Tesla initially announced its plans to build a factory on the site, which is located just outside the German capital of Berlin, and is officially called <a href=\"https://www.tesla.com/en_gb/giga-berlin\">Giga Berlin-Brandenburg</a>. </p><p id=\"wIbFDR\">As part of the opening ceremony, Tesla is handing over the first production cars made at the factory to customers: 30 Model Y compact SUVs. <em>Reuters </em>reports that these are the performance configuration of the vehicle, which have a range of 320 miles and sell for €63,990.</p><div id=\"X1NAzD\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Excited to hand over the first production cars made by Giga Berlin-Brandenburg tomorrow!</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1505977175488483339?ref_src=twsrc%5Etfw\">March 21, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"9DTRJ8\">Tesla was given provisional approval to begin commercial production at the factory earlier this month, <a href=\"https://www.cnbc.com/2022/03/04/tesla-factory-in-germany-gains-approval-to-start-commercial-production.html\"><em>CNBC </em>reported at the time</a>, allowing it to produce up to 500,000 vehicles at the site per year. The company had originally hoped to start production at the factory in summer 2021, but a combination of the pandemic, supply chain disruptions, and environmental concerns delayed its opening.</p><p id=\"fdCsGd\">Environmental concerns have surrounded the factory since its early preparation stages, dating back to February 2020 when <a href=\"https://www.theverge.com/2020/2/17/21140666/tesla-gigafactory-4-berlin-gruenheide-environmental-protest-pause\">Tesla was forced to temporarily halt its work on the factory’s site</a>. But Tesla and its CEO have consistently defended the factory’s impact on the environment. Musk argued that the Gigafactory will use “<a href=\"https://www.reuters.com/business/autos-transportation/teslas-brandenburg-factory-becomes-festival-site-giga-fest-2021-10-09/\">relatively little</a>” water and that the forest that needed to be cleared prior to its construction wasn’t natural (it had been <a href=\"https://www.ft.com/content/8b10555e-4345-11ea-abea-0c7a29cd66fe\">planted to supply a cardboard factory</a>). In a letter sent to a local court, Tesla argued that Germany’s regulatory framework “directly contradicts the urgency to plan and realize such projects that is necessary to battle climate change,” <a href=\"https://www.reuters.com/article/us-tesla-germany-idUSKBN2BV1OG\"><em>Reuters</em> reported</a> in April 2021. </p><p id=\"fak1Gx\">Although the factory is now up and running, Musk has previously warned that <a href=\"https://www.reuters.com/business/autos-transportation/teslas-brandenburg-factory-becomes-festival-site-giga-fest-2021-10-09/\">ramping up production is the real challenge</a>. Germany publication <a href=\"https://www.automobilwoche.de/article/20211129/BCONLINE/211129943/1276/exklusiv%E2%80%94bereits-fuenf-model-y-gefertigt-tesla-startet-in-gruenheide-noch-im-dezember\"><em>Automobilwoche </em>previously reported</a> that Tesla hopes to ramp up production to around 1,000 units a week in January, and that the factory could contribute a maximum of 30,000 vehicles over the first half of 2022. Eventually, Tesla has said it aims to produce as many as 500,000 cars and 50GWh of battery capacity annually at the location. <em>Reuters</em> reports that the company has hired over 3,000 of the 12,000 workers eventually expected to staff the factory.</p><p id=\"Tk8juW\">Creating a European manufacturing hub will be an important logistical victory for Tesla, which currently imports European cars from its factories elsewhere in the world. The Berlin Gigafactory follows locations in Nevada, New York, and Shanghai, China. A fifth factory is currently under construction in Texas, where the company <a href=\"https://www.theverge.com/22715458/tesla-move-headquarters-to-austin-texas\">will also have its headquarters</a>.</p><p id=\"FShsj7\"></p><p id=\"KOKmaY\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-FsFRglvVdwIL8-hAJ-VGFzp114=/0x122:5601x3054/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23336425/1239408887.jpg",
  "description": "The company’s first European manufacturing hub is here.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}