{
  "title": "Tesla has a new feature that will disable your seat controls if you keep messing with them",
  "url": "https://www.theverge.com/2022/1/31/22911072/tesla-seat-controls-disable-lock-out-brose",
  "date": "2022-01-31T21:54:43.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/I_t9QL2lROuTTTitJWtiwvf_1W4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70455229/jbareham_180213_2301_0139.0.jpg\" />        <figcaption>Photo by James Bareham / The Verge</figcaption>    </figure>  <p id=\"tas04H\">Tesla’s new vehicles rolling out of the factory will include a bizarre feature designed to prevent abuse of the seat adjustment controls. The new seats will track and measure the amount of adjustments users make and will disable the controls if they detect “excessive” changes. The feature was first identified by @greentheonly, an anonymous hacker and researcher, and subsequently <a href=\"https://jalopnik.com/noted-tesla-hacker-finds-evidence-of-seat-abuse-prote-1848453737?utm_source=twitter&amp;utm_medium=SocialMarketing&amp;utm_campaign=dlvrit&amp;utm_content=jalopnik\">covered by <em>Jalopnik</em></a>. </p><p id=\"ms03NN\">Tesla recently began installing new seat motors in some of its Model 3 and Model Y vehicles, in addition to the seats it gets from China’s Yangfeng and the ones it makes in-house. The new motors come from Brose, a 110-year-old German company that supplies a lot of components to the automotive industry. </p><div class=\"c-float-right\"><aside id=\"rIB75H\"><q>“seat abuse” metrics</q></aside></div><p id=\"fsB4yT\">The difference between the Brose seats and Yangfeng and Tesla’s are what @greentheonly calls “‘seat abuse’ metrics.” This functionality will issue warnings to the users if they are making too many adjustments and eventually will disable the seat controls if the warnings are unheeded. Apparently, the car is tracking how many times users move their seats forward and backward, as opposed to lumbar support controls — though the feature could eventually include those controls as well. </p><div id=\"m2NWto\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ha, they are also introducing \"seat abuse\" metrics complete with disabling of seat moving for busers with helpful messages like \"Excessive use of seat track motor detected\"\"Seat track motor unavailable due to excessive use\" and \"Wait 5 minutes to adjust seat track position again\"</p>— green (@greentheonly) <a href=\"https://twitter.com/greentheonly/status/1486783199132983297?ref_src=twsrc%5Etfw\">January 27, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"y18Dek\">If that sounds weird and annoying, keep in mind, we’re talking about <em>a lot</em> of fiddling with the seat controls. The first warning — “Excessive use of seat track motor detected” — comes after 90 seconds of use within a 5-minute period of time. If you decide to say “screw it” and keep messing with the controls for an additional 30 seconds, the car will disable the seat control tracker altogether with a warning against further “excessive use.” </p><p id=\"He42I6\">(For anyone with trouble imagining under what circumstances someone would be screwing around with their seat controls for a full two minutes, allow me to introduce you to a concept known as “children.”)</p><p id=\"XGRhN4\">In a direct message on Twitter, @greentheonly said they discovered the new feature while scanning Tesla’s latest firmware releases in order to compare them to old releases and see what new functionalities were coming. The hacker also had some theories on why Tesla decided on including the new seat control protections:</p><blockquote><p id=\"K6oAf7\">so there are two possibilities:</p><p id=\"FmJL2t\">1. their historical replacement pattern show that motors fail like this.</p><p id=\"i9JZdh\">2. they are using worse motors at the factory now so added this check into factory firmware first.</p><p id=\"LiDl9Z\">In the end I cannot tell you it’s one or the other for sure. This change is coincident with the BROSE seats config so may be just the Brose seats have this weaker motor? That would explain the first appearance is in the factory firmware too, then.</p><p id=\"f1RK6h\">But may be it is based on historical data too and would apply to all cars and it’s all just a [coincidence]. I have no real way to know. I don’t even have a model3 car myself</p></blockquote><p id=\"m2lwcx\">@greentheonly notes that the new feature “is not in any widely public release yet as it came from a factory release installed on new cars on factories and have not made the jump into the public ones, but typically that happens rather soon.”</p><div class=\"c-float-right\"><aside id=\"ZSCTcj\"><q>I would be <em>very</em> annoyed if I got locked out of my seat controls</q></aside></div><p id=\"i2tg6d\">I’m not sure what the rate of use is for a burned-out seat motor, but Tesla must have some idea if they’re installing these weird new behavior trackers. As a person married to another person who is much shorter than myself, I know that I would be <em>very</em> annoyed if I got locked out of my seat controls. This would likely prevent me from driving my car altogether. </p><p id=\"olsdgp\">But as @greentheonly observes, this must be a real thing; otherwise, why would Tesla spend the time and energy tracking it and deciding when it makes sense to curtail its use? “[E]ither way 2 minutes out of 5 seems to be a decent amount,” they noted, “so we are not talking about ‘10 seconds and you are out.’”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Eyit-4SPM4Ki0L2eGoqUZdnNSc0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10228155/jbareham_180213_2301_0139.jpg",
  "description": "Tesla has new seat motors with weird new features.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}