{
  "title": "Tesla CEO Elon Musk and his brother are under investigation for alleged insider trading ",
  "url": "https://www.theverge.com/2022/2/24/22949453/tesla-elon-musk-kimbal-sec-investigation-insider-trading",
  "date": "2022-02-24T20:08:05.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"US-SPACE-SPACEX-STARSHIP\" src=\"https://cdn.vox-cdn.com/thumbor/Ue-PeCCYu_mX7bfZrSMUyLDaDX4=/6x0:6042x4024/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70546086/1238365926.0.jpg\" />        <figcaption>Photo by JIM WATSON/AFP via Getty Images</figcaption>    </figure>  <p id=\"8AC83g\">The Securities and Exchange Commission is looking into whether recent stock sales by Tesla CEO Elon Musk and his brother Kimbal Musk potentially violated insider trading rules, <a href=\"https://www.wsj.com/articles/sec-probes-trading-by-elon-musk-and-brother-in-wake-of-tesla-ceos-sales-11645730528\">according to <em>The Wall Street Journal</em></a><em>. </em></p><p id=\"EIJfBK\">The investigation began late last year after Musk and his brother sold $108 million worth of Tesla shares, according to the <em>Journal</em>. That sale happened the day before Elon Musk polled his Twitter followers about whether he should sell 10 percent of his stake in the company — and promised to abide by the poll’s results. </p><p id=\"fh6sPS\">Elon Musk portrayed the stock sales as a way to cover any fees he would face if Congress imposed new taxes on unrealized capital gains. When the poll closed, 57.9 percent of more than 3.5 million participants had voted “yes,” and 42.1 percent voted “no.” The Tesla stock price fell sharply as a result of the poll. </p><div class=\"c-float-right\"><aside id=\"ctYOe6\"><q>Kimbal Musk, who also sits on Tesla’s board of directors, sold 88,500 shares one day before his brother tweeted the poll</q></aside></div><p id=\"POtuLI\">Kimbal Musk, who also sits on Tesla’s board of directors, sold 88,500 shares one day before his brother tweeted the poll, the <em>Journal</em> says. Insider trading laws prohibit employees and board members from trading based on information that has not been made public. </p><p id=\"igQPxj\">Employees and board members can avoid insider trading charges by trading at predetermined times as part of a program known as 10b5-1. Kimbal Musk has used this program in the past, issuing 40 disclosures since 2011 that he has traded shares under the 10b5-1 program, according to the <em>Journal</em>. But a November 5th disclosure regarding the shares he sold before his brother’s Twitter poll did not indicate he was using that program. </p><p id=\"GRS2U7\">The <em>Journal</em>, citing securities law experts, noted that regulators will likely be looking into whether Musk told his brother about the poll or potential sale before Kimbal Musk sold his shares on November 5th, or if Kimbal otherwise learned of the poll and then traded. </p><p id=\"IwJYk4\">A spokesperson for the SEC declined to comment. Tesla disbanded its media relations division in 2019 and has not responded to reporters’ questions since then. </p><p id=\"Hjytyz\">Elon Musk has been at war with the SEC in recent weeks, accusing the agency of subjecting <a href=\"https://www.theverge.com/2022/2/17/22938823/elon-musk-sec-investigation-free-speech-tesla\">him and his company to “endless, unfounded investigations</a>.” He also alleged that the agency was ignoring its commitment to distribute $40 million in fine money to Tesla shareholders, as per the 2018 settlement. And he claimed that the SEC was <a href=\"https://www.theverge.com/2022/2/22/22946117/elon-musk-sec-accuse-leak-information-tesla\">leaking information</a> regarding federal investigations, without providing any specific evidence to back his claim. </p><div class=\"c-float-right\"><aside id=\"N5vOU4\"><q>Elon Musk has been at war with the SEC in recent weeks</q></aside></div><p id=\"IcqieM\">The dispute goes back to when Musk tweeted about his intentions of taking Tesla private in 2018, infamously declaring “funding secured.” After Musk sent the tweet, the SEC launched an investigation, eventually concluding that Musk misled investors about his plan to take Tesla private.</p><p id=\"ujvPKP\">A year later, Tesla and the SEC agreed that Musk’s tweets about Tesla should be subject to more oversight, with a company lawyer designated to pre-approve his tweets about Tesla’s financial health, sales, or delivery numbers — estimated or otherwise — as well as other specific subjects.</p><p id=\"gFnUfc\">In February 2019, the SEC asked a federal judge to hold <a href=\"https://www.theverge.com/2019/2/25/18240568/elon-musk-tesla-sec-contempt-of-court-settlement-violation-tweet-twitter\">Musk in contempt</a> for sending out an inaccurate tweet, arguing it violated the terms of the agreement. Musk claimed the SEC was attempting an “<a href=\"https://www.theverge.com/2019/3/11/18260339/elon-musk-sec-twitter-filing-contempt-response\">unconstitutional power grab</a>,” and the agency said the Tesla CEO was in “<a href=\"https://www.theverge.com/2019/3/18/18271914/sec-elon-musk-contempt-twitter-court-fraud\">blatant violation</a>” of the settlement. Eventually, the two sides were ordered by a federal judge <a href=\"https://www.theverge.com/2019/4/4/18295240/elon-musk-sec-tweets-judge-nyc-ruling\">to work things out</a>.</p><p id=\"DhGs9r\">On Twitter Thursday, Musk said he was “building a case” against the SEC and declared, “I didn’t start the fight, but I will finish it.”</p><div id=\"2woMpJ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I didn’t start the fight, but I will finish it.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1496564151493304324?ref_src=twsrc%5Etfw\">February 23, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"CLXSwe\"></p><p id=\"Zw6dFs\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YPZjmBQTcc2Dfhu_hCAUI4iz6Oo=/0x429:6048x3595/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268619/1238365926.jpg",
  "description": "Kimbal Musk’s stock sales are being examined.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}