{
  "title": "Tesla Model S with motorized tilting screen spotted in the wild  ",
  "url": "https://www.theverge.com/2022/5/4/23056503/tesla-tilt-screen-model-s-x-motorized-parts-shortages",
  "date": "2022-05-04T09:12:48.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1AYl0purTVq5YzgMgqrk7nOnE80=/78x125:1326x957/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70830081/Screen_Shot_2021_01_27_at_3.55.43_PM.0.png\" />        <figcaption><em>The refreshed Model S interior and large center display.</em> | Image: Tesla</figcaption>    </figure>  <p id=\"QOXfUt\">A Model S with a factory-equipped motorized, swiveling center screen has been spotted in the wild thanks to a <a href=\"https://twitter.com/TeslaFrunk/status/1521539727215587328\">video posted to Twitter by Larry Li</a>. In it, Li can be seen tilting the display from center, to left, and then to right, with the tap of a button on the screen. Note that the motorized front trunk (aka, the “frunk”) seen in the video is an aftermarket modification. </p><p id=\"V9MqOl\">A swiveling center screen represents a small quality-of-life improvement for Tesla owners. Rather than the display being static, and positioned so that both the driver and passengers can see it, it can be moved for optimum visibility by the driver when operating the vehicle, or by a passenger when parked, for example.</p><div id=\"J7DkW7\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Tesla finally added screen swivel to the refreshed model s <a href=\"https://t.co/JeldBrRTXw\">pic.twitter.com/JeldBrRTXw</a></p>— Larry Li (@TeslaFrunk) <a href=\"https://twitter.com/TeslaFrunk/status/1521539727215587328?ref_src=twsrc%5Etfw\">May 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"E6PwVl\">Tesla’s swiveling screens have a bit of a weird history. Although the feature has long been available in the form of <a href=\"https://www.youtube.com/watch?v=a2Dh1ENzqQU\">aftermarket</a> <a href=\"https://www.youtube.com/watch?v=xbhdhlDLdPA\">mods</a>, last year <a href=\"https://driveteslacanada.ca/model-s/first-pictures-of-tesla-model-s-refresh-and-plaid-released/\">Tesla’s website</a> said a center display with “left-right tilt” would be coming to its <a href=\"https://www.theverge.com/2021/1/27/22252832/tesla-model-s-redesign-plaid-mile-range-interior-refresh\">refreshed Model S and Model X cars</a>. A few short months later, however, the product pages were updated to remove references to the feature, as <a href=\"https://driveteslacanada.ca/model-s/tesla-removes-reference-to-refresh-model-s-x-tilting-display/\"><em>Drive Tesla Canada</em> reported</a> at the time (although it notes that the feature had already been spotted in the wild on a couple of occasions by that point).</p><p id=\"iCpHHv\">Even more perplexing, a <a href=\"https://www.youtube.com/watch?v=jSP2yVpcd3s\">recent teardown</a> showed that the Model S already has most of the hardware required to offer a swiveling screen, but without the motor to actually move it. It’s led to speculation that parts shortages have until now prevented Tesla from offering the feature in its cars. </p><p id=\"QuRKoI\">In replies to his original tweet, Li confirmed that the swiveling display is not an aftermarket mod but was “<a href=\"https://twitter.com/TeslaFrunk/status/1521626278587092992\">from [the] Tesla factory</a>” and that the Model S shown in the video was <a href=\"https://twitter.com/TeslaFrunk/status/1521560112883666944\">delivered on April 29th</a>. Host of the Tesla podcast <em>Ride the Lightning</em> <a href=\"https://twitter.com/dmc_ryan/status/1520124903436943360\">Ryan McCaffrey recently tweeted</a> that the latest Model S and Model X cars rolling off Tesla’s factory lines are equipped with the hardware to support the feature. With any luck, that should mean that swiveling screens are about to become standard on future Model S and X Teslas.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bv1KMI9dSViApm2XGoEUIC1f1OM=/0x211:1326x905/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22264126/Screen_Shot_2021_01_27_at_3.55.43_PM.png",
  "description": "It’s been a long time coming.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}