{
  "title": "Tesla will no longer include mobile connectors with every car",
  "url": "https://www.theverge.com/2022/4/17/23029094/tesla-no-longer-include-mobile-chargers-every-car-purchase",
  "date": "2022-04-17T16:55:38.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/lT1NTHef0SeA81Sxj8czUmAWzWQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70759590/acastro_180430_1777_tesla_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ecPE9a\">Tesla has stopped including its mobile connector with new car purchases, and will instead sell its Gen 2 (Level 1) bundle separately for a lower $200 price, Tesla CEO Elon Musk confirmed in a <a href=\"https://twitter.com/elonmusk/status/1515577134437347329\">series of tweets</a>. The <a href=\"https://shop.tesla.com/product/gen-2-mobile-connector-bundle\">mobile connector</a> bundle comes with an adapter that allows drivers to charge their cars from a standard 110v household outlet, with other adapters available for purchase separately.</p><div id=\"MFTnXO\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Based on feedback received, we will drop mobile connector price to $200 &amp; make it easy to order with car. <br><br>Note, mobile connector is not needed if you have a Tesla wall connector or to use Superchargers.<br><br>Recommend installing Tesla wall connector well before car arrives.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1515577134437347329?ref_src=twsrc%5Etfw\">April 17, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"HHdkKl\">On Saturday night, Twitter user <a href=\"https://twitter.com/tesla_adri\">@Tesla_Adri</a> found that Tesla updated <a href=\"https://www.tesla.com/support/home-charging\">its support page</a> to indicate the mobile connector bundle no longer comes with the car, as it was previously listed as an accessory that “comes with vehicle.” It looks like there may be a mistake on this page, however — the chart pictures a Gen 2 mobile connector bundle, but shows the price for a <a href=\"https://shop.tesla.com/product/corded-mobile-connector\">$400 Gen 1 (Level 2) bundle</a> (which is also available for purchase separately). Other changes spotted by <a href=\"https://twitter.com/tesla_adri/status/1512761164530339848\">@Tesla_Adri</a> and <a href=\"https://driveteslacanada.ca/news/design-studio-hints-tesla-mobile-connector-no-longer-included/\"><em>Drive Tesla Canada</em></a> provide further evidence that the Gen 2 charger is likely the one affected here.</p><p id=\"Lwvgqg\">In a reply to a user’s reaction to the situation, Musk confirmed that the company will no longer include the Gen 2 mobile connector with new car purchases. “Usage statistics were super low, so seemed wasteful,” Musk explained, adding that Tesla “will be including more plug adapters with the mobile connector kit” in the future. It’s unclear which adapters Tesla will start including with the kit.</p><p id=\"dRPLrI\">Musk provided another update hours later, stating that, “based on user feedback,” Tesla will lower the price of the mobile connector to $200. He also said that Tesla will “make it easy” to order the mobile connector when purchasing a car, and encouraged customers to get a wall charger installed “well before” their car arrives.</p><p id=\"A3kmCk\">The Gen 2 mobile connector is still listed as costing $275 on Tesla’s site, and you couldn’t purchase one even if you wanted to — the mobile connector is currently out of stock, and the same goes for the Gen 1 connector. That said, it’s unclear how long either accessory has been out of stock, or whether a supply chain shortage is contributing to Tesla’s decision. Tesla didn't immediately respond to <em>The Verge</em>’s request for comment (Tesla disbanded its public relations team in 2019 and typically doesn’t respond to inquiries from the media).</p><p id=\"bMGEJu\">Reactions to Musk’s decision have been mixed. Although a mobile connector isn’t a necessity, as Tesla owners can charge their car from a wall charger installed at their home or at a charging station, <a href=\"https://twitter.com/wrathoftesla/status/1515447680994004997\">some</a> <a href=\"https://twitter.com/kimpaquette/status/1515516189056946176\">drivers</a> say it’s comforting to have the mobile connector with them while traveling. The accessory can come in handy at campsites or when traveling in an area without charging stations, as it allows drivers to plug their car into a standard outlet. It does charge at a much slower rate, though, with the Gen 2 charger providing about one to three miles of range after an hour of charging. </p><p id=\"i38N0u\"><a href=\"https://twitter.com/TeslaKing23/status/1515593472648126470\">Some</a> <a href=\"https://twitter.com/HisandHersTesla/status/1515665286476746755\">drivers</a> also say the mobile connector servers as a much cheaper alternative to the expensive wall charger, <a href=\"https://twitter.com/StargazerPlaid/status/1515673847151972353\">while</a> <a href=\"https://twitter.com/Vaccject/status/1515654639416451078\">others</a> say they rarely use it at all. Connectors with a 120v or 240v adapter come standard with other EVs, such as the <a href=\"https://www.nissanusa.com/experience-nissan/news-and-events/nissan-leaf-charging-101.html\">Nissan Leaf</a>, <a href=\"https://www.ford.com/mustang/ev-charging/mache/\">Ford Mustang Mach-E</a>, <a href=\"https://www.chevrolet.com/electric/living-electric/home-charging\">Chevy Bolt</a>, and all <a href=\"https://www.bmwusa.com/charging.html\">BMW EVs</a>. But as <a href=\"https://electrek.co/2022/02/04/kia-ev6-first-drive-10-things-i-didnt-know-about-the-big-310-mile-every-person-sportwagon\"><em>Elecktrek</em></a> points out, the Kia EV6 also doesn’t come with a Level 1 or 2 charging cable.</p><p id=\"wiVEjd\">In 2020, <a href=\"https://www.theverge.com/2020/10/13/21514480/apple-iphone-charging-brick-charger-earbuds-box-environmental-impact-carbon-emissions\">Apple</a> famously stopped including chargers with its new iPhones, with <a href=\"https://www.theverge.com/22225930/samsung-galaxy-s21-no-charger-brick-headphones-price\">Samsung</a> and <a href=\"https://www.theverge.com/2021/8/17/22628702/google-pixel-6-charger-not-included\">Google</a> following suit. Although it’s easy to see parallels between this situation and Tesla’s, it’s far too early to tell if Tesla’s move will create a domino effect among other EV makers.</p><p id=\"GGBeTo\"><em><strong>Update April 17th 12:55PM ET: </strong></em><em>Updated to clarify that the mobile connection affected here is likely the Gen 2 mobile connector bundle, and added more context surrounding this. Also updated to add that the Kia EV6 also doesn’t come with charging cables.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NtrXLlFjYSqxLfRFBG6QpA2MjeQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10752833/acastro_180430_1777_tesla_0004.jpg",
  "description": "Musk says including the connector is \"wasteful.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}