{
  "title": "Tesla’s ‘phantom braking’ problem is now being investigated by the US government ",
  "url": "https://www.theverge.com/2022/2/17/22938944/tesla-phantom-braking-nhtsa-investigation-defect",
  "date": "2022-02-17T16:04:16.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/be2n-KLtMDQ2MsCsq8UJDo3yxok=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70520854/tesla_model_y_3454.0.jpg\" />    </figure>  <p id=\"XqcYLJ\">The National Highway Traffic Safety Administration says it is investigating 416,000 Tesla vehicles after receiving hundreds of <a href=\"https://www.theverge.com/2022/2/2/22914236/tesla-phantom-braking-complaints-nhtsa-fsd\">complaints of unexpected braking</a>. The investigation covers all Tesla Model 3 and Model Y vehicles released in 2021 and 2022. </p><p id=\"zu24oA\">Reports of “phantom braking” first surfaced last fall, when Tesla was <a href=\"https://www.theverge.com/2021/10/24/22743628/elon-musk-tesla-fsd-beta-10-3-rollback-issues-phantom-fcw\">forced to “roll back” version 10.3 of its Full Self-Driving beta software</a>, the company’s advanced driver assist system, because of issues with forward collision warnings and phantom braking.</p><p id=\"Vd3Aq8\">But after the rollback, the number of complaints actually increased substantially, with NHTSA receiving at least 107 from November to January, compared with only 34 in the preceding 22 months, <a href=\"https://www.washingtonpost.com/technology/2022/02/02/tesla-phantom-braking/?utm_source=twitter&amp;utm_campaign=wp_main&amp;utm_medium=social\">according to <em>The</em> <em>Washington Post</em></a>.</p><div class=\"c-float-right\"><aside id=\"xrKjwC\"><q>In total, NHTSA said it has received 354 complaints in the last nine months</q></aside></div><p id=\"BfjL4a\">In total, NHTSA said it has received 354 complaints in the last nine months. “The complaints allege that while utilizing the ADAS features including adaptive cruise control, the vehicle unexpectedly applies its brakes while driving at highway speeds,” <a href=\"https://static.nhtsa.gov/odi/inv/2022/INOA-PE22002-4385.PDF\">the report reads</a>. “Complainants report that the rapid deceleration can occur without warning, at random, and often repeatedly in a single drive cycle.”</p><p id=\"ue40vN\">NHTSA’s Office of Defects Investigation is opening a “preliminary evaluation,” which is the stage before the agency could issue a formal recall. To date, there have been no reports of crashes, injuries, or fatalities as a result of this issue, the report states. </p><p id=\"O09wdt\">Tesla owner Paul Reddy said that he experiences phantom braking during “most long drives” that involve Autopilot and Traffic-Aware Cruise Control, two of Tesla’s advanced driver-assist features. </p><p id=\"I06LCs\">“Some are minor — car slows suddenly,” Reddy wrote in an email. “Some are downright dangerous, where the car slams on the brakes when you have a truck behind you. Because the sudden braking (and my sudden acceleration) freaks out your passengers and any car behind you, I cannot use either AP or TACC in traffic or with passengers in the car.”</p><p id=\"qoaF18\">The problem may be traced to the controversial decision last year by Tesla to <a href=\"https://www.theverge.com/2021/5/25/22453518/tesla-vision-radar-autopilot-model-3-y-fsd\">remove radar sensors from new Model 3 and Model Y vehicles</a>. The decision came after Musk publicly expressed a desire to rely exclusively on cameras to power the company’s advanced driver assistance system.</p><p id=\"1qAhB8\">Tesla has drawn scrutiny from safety advocates and regulators for its willingness to allow its customers to test what is essentially an unfinished version of a product that Musk has long promised will lead to fully autonomous vehicles on the road. </p><p id=\"zpAgnO\">Earlier this week, the company was <a href=\"https://www.theverge.com/2022/2/1/22912099/tesla-rolling-stop-disable-recall-nhtsa-update\">forced to issue a software update</a> to remove an FSD feature that allows cars to perform a “rolling stop” — a maneuver in which the vehicle moves slowly through a stop sign without coming to a full stop. (A rolling stop is a common driving maneuver despite being illegal in all 50 states in the US.)</p><p id=\"ARozDJ\">Tesla has issued 10 recalls since October on a range of problems, from a <a href=\"https://www.theverge.com/2021/12/30/22859717/tesla-model-3-s-recall-trunk-latch-failure-nhtsa\">defective trunk latching mechanism</a> to a <a href=\"https://www.theverge.com/2022/2/10/22927004/tesla-recall-model-3-x-y-boombox-nhtsa-pedestrian-warning\">faulty windshield defroster</a>. <a href=\"https://www.theverge.com/2021/10/13/22724171/nhtsa-tesla-letters-fsd-beta-autopilot-recall-emergency-vehicles\">The company is also under investigation</a> for nearly a dozen incidents involving Tesla vehicles crashing into stationary emergency vehicles while using Autopilot. </p><p id=\"SJ7kYz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kVTEu_ltXsmcIVbcC1xdBq8puRQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963542/tesla_model_y_3454.jpg",
  "description": "The government has received hundreds of complaints.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}