{
  "title": "Tesla workers in Shanghai will reportedly sleep and eat in the factory after COVID shutdowns",
  "url": "https://www.theverge.com/2022/4/20/23033394/tesla-shanghai-factory-sleep-eat-factory-closed-loop-covid",
  "date": "2022-04-20T10:58:17.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"CHINA-SHANGHAI-TESLA-GIGAFACTORY-MODEL Y (CN)\" src=\"https://cdn.vox-cdn.com/thumbor/NPSTo4xbA44xkXO-XUz9Nxx1Ghk=/0x0:5472x3648/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70770367/1192521419.0.jpg\" />        <figcaption><em>Tesla’s Shanghai factory previously produced about 2,100 cars a day. </em> | Xinhua/Ding Ting via Getty Images</figcaption>    </figure>  <p id=\"j2j7gP\">Tesla is restarting production at its massive Shanghai factory as the city of 25 million begins to <a href=\"https://www.theguardian.com/world/2022/apr/19/shanghai-prepares-to-ease-covid-lockdown-as-factories-reopen\">ease lockdown restrictions</a> following a substantial COVID outbreak. </p><p id=\"kQRxlt\">According to a <a href=\"https://www.bloomberg.com/news/articles/2022-04-18/tesla-shanghai-sets-out-hand-washing-sleeping-plans-for-workers\">report from <em>Bloomberg News</em></a> that cites internal company memos, the factory will re-open in what’s being called a “closed-loop system” — an approach <a href=\"https://www.scmp.com/business/china-business/article/3174564/shanghai-resume-some-production-after-16-day-lockdown-even\">encouraged by Shanghai authorities</a> to get people back into the workplace while maintaining the country’s zero-covid strategies. Essentially, this means nobody goes in or out: employees will live and work at the factory, with the first “shift” entering earlier this week and expected to stay until May 1st under the city’s current COVID policies. </p><div class=\"c-float-right\"><aside id=\"a3Ke54\"><q>The Shanghai factory is Tesla’s largest</q></aside></div><p id=\"JlqGK0\">According to the Telsa memo cited by <em>Bloomberg,</em> each worker will be provided with a sleeping bag and mattresses, with designated areas for sleeping, showering, eating, and relaxation. Each employee will receive three free meals a day and a daily stipend of around 400 yuan ($63). Only workers who have received two vaccination doses will be allowed to enter the factory, and each will take daily nucleic acid tests for the first three days back. </p><p id=\"OhH2E3\">In addition to COVID restrictions, <em>Bloomberg</em> says Tesla is also increasing working hours to try and claw back the roughly 40,000 cars it’s missed producing since the factory shut down on March 28th. Employees will not only live and eat at the factory, they’ll also reportedly work 12 hour days, six days in a row.</p><p id=\"OcIC7B\">Tesla may well reveal more about how the shutdown and plant re-opening is expected to affect production targets in its earning call later today. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/xfxuwwYkwLTNmZZPnC-y0ZoJ-Rc=/0x392:5472x3257/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23402910/1192521419.jpg",
  "description": "Tesla restarts Shanghai production with stringent new working conditions",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}