{
  "title": "Tesla earned over $3 billion in profit in the first quarter",
  "url": "https://www.theverge.com/2022/4/20/23031976/tesla-q1-earnings-profit-elon-musk",
  "date": "2022-04-20T20:48:26.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"US-AUTOMOBILE-INDUSTRY-TESLA-ECONOMY\" src=\"https://cdn.vox-cdn.com/thumbor/Zt4n-VYIWy-AG89i3hf1R60AXZw=/0x0:5791x3861/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70773322/1239824662.0.jpg\" />        <figcaption>Photo by Suzanne Cordeiro / AFP via Getty Images</figcaption>    </figure>  <p id=\"jwwNmi\">Amid supply chain constraints and <a href=\"https://www.theverge.com/2022/4/3/23008668/tesla-shanghai-factory-closed-lockdown-covid-china\">production delays in China</a>, Tesla reported that it earned a $3.3 billion profit in the first quarter of 2022. Tesla turned that profit on just over $18.7<strong> </strong>billion in revenue, the company announced. That represents an 81 percent increase year over year, compared to $10.4 billion in revenue in Q1 2021. </p><p id=\"gNkQpB\">The company logged $679 million in emission credit sales to other automakers, compared to $314 million in credit sales in Q4 2021. The company generates this revenue by selling these credits to automakers that make fewer “clean” vehicles than are required by the US government and the European Union. </p><div id=\"NxYJ5c\"><iframe title=\"Tesla total revenue by quarter\" aria-label=\"Column Chart\" id=\"datawrapper-chart-MiVcx\" src=\"https://datawrapper.dwcdn.net/MiVcx/3/\" scrolling=\"no\" frameborder=\"0\"  height=\"327\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script></div><p id=\"j7gSwO\"></p><p id=\"7nDZWZ\">The credit sales have come in handy in past years, helping Tesla eke out a profit while its car-making business struggled. Last summer, the company reported that its manufacturing and energy sales business was profitable for the first time without counting emission credit sales. </p><p id=\"hszfmG\">It was undoubtedly a noteworthy quarter for Tesla. The company opened two new factories — one in <a href=\"https://www.theverge.com/2022/3/22/22808108/tesla-gigafactory-open-production-start-elon-musk\">Berlin on March 22nd</a> and the second in <a href=\"https://www.theverge.com/2022/4/8/23008731/tesla-texas-gigafactory-open-cybertruck-elon-musk\">Austin, Texas, on April 8th</a> — while also being forced to shutter its Shanghai factory for several weeks amid rising COVID numbers. The costs of opening those two factories, while also struggling to keep its Chinese factory in operation, were expected to weigh down Tesla’s numbers this quarter. </p><p id=\"GFOHm9\">The company says it started production in Berlin last month, and that it started Model Y deliveries from Texas in April. The company also mentioned it’ll produce its structural battery packs with 4680 cells in Texas later this year, alongside the standard packs with 2170 cells.</p><p id=\"9ebUkt\">The earnings report also follows a robust quarter for delivery and production for Tesla. The company said it sent 310,048 vehicles to its customers in Q1 2022. Tesla CEO <a href=\"https://twitter.com/elonmusk/status/1510288141495640070\">Elon Musk described</a> that feat as “exceptionally difficult,” citing global supply chain issues and the closure of the company’s factory in Shanghai amid rising COVID case numbers. Despite that, Musk also predicted on the earnings call that the company would be able to ramp up production and make 1.5 million cars this year.</p><div id=\"R9VTeU\"><iframe title=\"Tesla deliveries by quarter\" aria-label=\"Stacked Column Chart\" id=\"datawrapper-chart-ERnFv\" src=\"https://datawrapper.dwcdn.net/ERnFv/3/\" scrolling=\"no\" frameborder=\"0\"  height=\"381\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script></div><p id=\"t1iNR0\"></p><p id=\"KfnW7X\">Tesla said it delivered 295,324 Model 3 and Model Y vehicles, while 14,724 were for the Model S and X. Deliveries increased slightly from the previous quarter’s <a href=\"https://www.theverge.com/2022/1/2/22863751/tesla-delivered-one-million-vehicles-2021\">308,600 deliveries</a> and outpaced <a href=\"https://www.theverge.com/2021/4/2/22364067/tesla-q1-2021-deliveries-elon-musk\">the 184,800 shipments Tesla made</a> in the first quarter of 2021, representing a 68 percent year-over-year increase. On the production side of things, Tesla said it built a total of 305,407 vehicles during the past three months. </p><p id=\"CC0UK6\">The company has also continued its trend of making more per car — its gross automotive margin was 32.9 percent in Q1 2022, compared to 26.5 percent in Q1 2021. In its notes to investors, the company says it increased the average selling price of its cars and grew the number of cars it was delivering.</p><p id=\"iKWPfc\">Tesla navigated the global supply chain crisis better than its rivals, posting record deliveries and profits for several quarters. The company was able to avoid the same kinds of headaches as other global automakers by <a href=\"https://www.theverge.com/2021/7/2/22560608/tesla-q2-2021-deliveries-elon-musk\">sourcing different chips and rewriting software on the fly</a>. </p><p id=\"aljOQN\">It was also a busy quarter for Tesla for reasons unrelated to its finances. The company was hit with recall notices for a variety of malfunctioning features, including a pedestrian warning sound that was being obscured by <a href=\"https://www.theverge.com/2022/2/10/22927004/tesla-recall-model-3-x-y-boombox-nhtsa-pedestrian-warning\">loud music played over the external “Boombox”</a> speakers and an aspect of the Full Self-Driving beta software that allowed vehicles to <a href=\"https://www.theverge.com/2022/2/1/22912099/tesla-rolling-stop-disable-recall-nhtsa-update\">roll through some stop signs</a> without coming to a complete stop. </p><p id=\"obMQmT\">Tesla’s legal drama continued to mount this quarter. The company was sued by California’s civil rights agency after several employees came forward with reports of racial discrimination and harassment. One Black former Tesla employee was awarded <a href=\"https://www.theverge.com/2021/10/5/22710279/tesla-racism-fremont-plant-137-million-judgement-owen-diaz\">$137 million in damages</a> after he reported a hostile work environment where he heard “daily racist epithets.” (<a href=\"https://www.theverge.com/2022/4/14/23025226/tesla-racism-lawsuit-award-reduce-owen-diaz\">A judge later reduced the award</a> to $15 million, calling the jury’s decision “excessive.”)</p><p id=\"ijs8m9\">And, of course, there’s Elon Musk’s surprise offer to buy Twitter for $48 billion. It’s unclear exactly how Musk’s hostile takeover efforts may spill over to affect Tesla or its shareholders, but at the very least, it’s bad timing, given the number of important milestones Tesla still needs to hit this year. </p><p id=\"ub1gQg\"><em><strong>Update April 20th, 6:53PM ET:</strong></em><em> Added Elon Musk’s production prediction.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XXmZbVj5T-8jRaJnNE4ZLX5nsYs=/0x415:5791x3447/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23400122/1239824662.jpg",
  "description": "The company has started production at two new factories.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}