{
  "title": "Tesla insists Autopilot and Full Self-Driving are safe, but US senators aren’t buying it",
  "url": "https://www.theverge.com/2022/3/9/22969297/tesla-autopilot-fsd-letter-safety-blumenthal-markey",
  "date": "2022-03-09T20:00:16.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/43lwiqW3_iLmn3GZsFQVTuwWZag=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70600757/acastro_180524_1777_tesla_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"BKTLyj\">Tesla’s Autopilot and Full Self-Driving features are safe, the company insists in a letter to two top Senate Democrats. Like, really safe. Safer than human driving. Unfortunately, the senators aren’t really buying it. </p><p id=\"Nzgqg9\">“Tesla’s Autopilot and FSD Capability features enhance the ability of our cusotmes [sic] to drive safer than the average driver in the U.S.,” Rohan Patel, senior director of public policy at Tesla, writes in a March 4th letter to US Senators Richard Blumenthal (D-CT) and Ed Markey (D-MA). (The letter was <a href=\"https://www.autonews.com/regulation-safety/tesla-tells-us-senators-autopilot-safe-sec-ready-distribute-40m-settlement-elon?utm_source=dlvr.it&amp;utm_medium=twitter\">first reported by <em>Reuters</em></a>.)</p><p id=\"k2OBQ7\">Tesla is responding to the senators’ letter to the company’s CEO Elon Musk last month raising “significant concerns” about Autopilot and FSD. Blumenthal and Markey have also <a href=\"http://theverge.com/2021/4/22/22397826/tesla-autopilot-investigation-blumenthal-markey-nhtsa-ntsb\">called on federal regulators to crack down on Tesla</a> to prevent further misuse of the company’s advanced driver-assist features. </p><p id=\"KSeWq8\">Patel describes Autopilot and FSD as Level 2 systems “which require the constant monitoring and attention of the driver.” These features are “capable of performing some but not all of the Dynamic Driving Tasks (DDT) that can be performed by human drivers,” he notes. (That would seem to contradict Tesla’s overly optimistic branding of the product as “Full Self-Driving.”)  </p><div id=\"eGxrrk\"><p >   <a title=\"View Tesla 3.4.22 Response to Blumenthal &amp; Markey 2.8.22 Ltr on Scribd\" href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.scribd.com%2Fdocument%2F563664614%2FTesla-3-4-22-Response-to-Blumenthal-Markey-2-8-22-Ltr%23from_embed&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F9%2F22969297%2Ftesla-autopilot-fsd-letter-safety-blumenthal-markey\"  rel=\"sponsored nofollow noopener\" target=\"_blank\">Tesla 3.4.22 Response to Blumenthal &amp; Markey 2.8.22 Ltr</a> by <a title=\"View ahawkins8223's profile on Scribd\" href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.scribd.com%2Fuser%2F112638498%2Fahawkins8223%23from_embed&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F9%2F22969297%2Ftesla-autopilot-fsd-letter-safety-blumenthal-markey\"  rel=\"sponsored nofollow noopener\" target=\"_blank\">ahawkins8223</a> on Scribd</p><iframe class=\"scribd_iframe_embed\" title=\"Tesla 3.4.22 Response to Blumenthal &amp; Markey 2.8.22 Ltr\" src=\"https://www.scribd.com/embeds/563664614/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-Ay9mBRdANuJpBFAqIYqh\" data-auto-height=\"false\" data-aspect-ratio=\"0.7729220222793488\" scrolling=\"no\" id=\"doc_58720\" width=\"100%\" height=\"600\" frameborder=\"0\"></iframe></div><p id=\"Op1d87\">In his letter, Patel provides a more nuanced (and most likely legally vetted) overview of Autopilot and FSD than what is typically provided by Musk on Twitter and in other public comments. In a recent earnings call, for example, Musk claimed that FSD will be safer than human driving by the end of 2022. </p><p id=\"evjhHK\">Patel doesn’t apply the same deadline, but he does insist that Tesla’s advanced driving features are safer than human driving. He notes:</p><blockquote><p id=\"yvx3Y5\">For example, in the fourth quarter of 2021, Tesla recorded one crash for every 4.31 million miles driven in which our drivers were using Autopilot technology, compared to the NHTSA most recent data, which shows an automobile crash occurs every 484,000 miles. </p></blockquote><p id=\"tAfIH1\">Tesla occasionally releases safety reports that echo these same statistics in an effort to frame Autopilot as safer than human driving. But experts note that these stats are largely meaningless, as Autopilot is primarily used for highway driving. Comparing it to national statistics that include a wide variety of driving environments, including residential and urban driving, gives Tesla an unfair advantage. </p><div class=\"c-float-right\"><aside id=\"7hdJsy\"><q>experts note that these stats are largely meaningless</q></aside></div><p id=\"pSwOFs\">Patel goes on to describe Tesla’s driver monitoring system, which uses torque sensors in the steering wheel and (for some Model 3 and Model Y vehicles) cabin cameras to monitor driver attentiveness. </p><p id=\"KaGXxa\">He does not mention, however, that regulators and safety experts have spent years <a href=\"https://www.theverge.com/2020/2/25/21153320/tesla-autopilot-walter-huang-death-ntsb-probable-cause\">begging</a> Tesla to add <a href=\"https://www.theverge.com/2020/2/25/21152984/tesla-autopilot-safety-recommendations-ignored-ntsb-crash-hearing\">better driver monitoring to its cars</a>. Musk has even admitted that crashes involving Autopilot <a href=\"https://www.theverge.com/2018/5/2/17313324/tesla-autopilot-safety-statistics-elon-musk-q1-earnings\">stem from complacency</a> but <a href=\"https://www.theverge.com/2018/5/14/17352814/elon-musk-tesla-autopilot-face-tracking-gm\">previously rejected his own engineers’ calls</a> to add more robust driver monitoring to the company’s cars. Musk said at the time that the tech was “ineffective.” </p><p id=\"QL2uYn\">Companies like General Motors and Ford currently sell cars with camera-based eye-tracking systems that are meant to make sure drivers pay attention while using hands-free driving features.</p><p id=\"pe1RQI\">If the goal of Patel’s letter was to assuage the concerns of Blumenthal and Markey about Tesla’s commitment to safety, it doesn’t appear to have worked. </p><p id=\"JR7wKD\">“This is just more evasion and deflection from Tesla,” the senators said in a joint statement. “Despite its troubling safety track record and deadly crashes, the company seemingly wants to carry on with business as usual. It’s long past time Tesla got the message: follow the law and prioritize safety.”</p><p id=\"RgZ3To\">Tesla did not (and has not since 2019) respond to a request for comment. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QOXVhSBb4175xx8o0uvdkZ4tAgA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11423503/acastro_180524_1777_tesla_0001.jpg",
  "description": "Tesla is under increasing scrutiny.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}