{
  "title": "Tesla sued by civil rights agency for operating ‘racially segregated workplace’",
  "url": "https://www.theverge.com/2022/2/10/22926851/tesla-sued-california-racially-segregated-workplace-dfeh",
  "date": "2022-02-10T12:00:47.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"ssjm0614tesla\" src=\"https://cdn.vox-cdn.com/thumbor/VzdBLFFsrEsAolF6hnGIidWO0iY=/161x0:2479x1545/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70492006/1359224391.0.jpg\" />        <figcaption>Workers assemble Model S Sedans at the Tesla Fremont factory in 2012.  | Photo by Patrick Tehan/MediaNews Group/Bay Area News via Getty Images</figcaption>    </figure>  <p id=\"WnY1JH\">Tesla has been sued by a state civil rights agency for operating what it describes as a “racially segregated workplace” in California.</p><p id=\"Mv51ic\">The California Department of Fair Employment and Housing (DFEH) filed the lawsuit late on Wednesday, after the automaker published a blogpost <a href=\"https://www.tesla.com/blog/dfehs-misguided-lawsuit\">pre-empting and denying the charges</a>. </p><p id=\"erXPSv\">DFEH director Kevin Kish said in a statement: “After receiving hundreds of complaints from workers, DFEH found evidence that Tesla’s Fremont factory is a racially segregated workplace where Black workers are subjected to racial slurs and discriminated against in job assignments, discipline, pay, and promotion creating a hostile work environment.”</p><p id=\"1DTRti\"><em>Warning: racist language and slurs as reported from DFEH’s case follow</em>. </p><p id=\"y43SeY\">The DFEH’s case against Telsa describes a wide range of discriminatory behavior and harassment at the company’s Fremont factory. Defendants in the case say they heard workers, managers, and supervisors frequently using racial slurs including the n-word, “monkey toes,” and “hood rat.” Areas in the factory where many Black and African American employees were located were referred to as the “porch monkey station,” and defendants say managers and supervisors were either “active participants and/or witnesses to these racist comments.” Racist graffiti was also left in break rooms, restrooms, and work stations including phrases such as “all monkeys work outside,” “fuck [n-words]” and “hang [n-words]” next to a drawing of a noose. Defendants says this graffiti was “left up for months.” </p><div class=\"c-float-right\"><aside id=\"0EaeME\"><q>Black workers say they were assigned harder jobs and given stricter punishments</q></aside></div><p id=\"0v2qll\">Work, reward, and punishment was also meted out along discriminatory racial lines, say defendants in the case. They report that Black employees were given the most physically demanding jobs in the factory, and told they were “better suited” to such work. Black workers say they were more frequently penalized for minor workplace infractions than non-Black colleagues, and that they were more often denied promotions. As a result, they were underrepresented in Tesla’s management. A <a href=\"https://www.tesla.com/sites/default/files/downloads/2020-DEI-impact-report.pdf\">2020 diversity report</a> from Tesla said Black workers made up 10 percent of its workforce and 4 percent of its leadership.</p><p id=\"7WAzzb\">Tesla has previously been sued for racial harassment and discrimination at its Fremont factory. In October last year, a judge awarded a Black former employee <a href=\"https://www.theverge.com/2021/10/5/22710279/tesla-racism-fremont-plant-137-million-judgement-owen-diaz\">$137 million in damages</a> after he reported a hostile work environment where he heard “daily racist epithets” including the n-word and was told to “go back to Africa” by colleagues. </p><p id=\"0xG7yf\">In a blogpost preempting this new lawsuit from DFEH, Tesla said it “strongly opposes all forms of discrimination and harassment and has a dedicated Employee Relations team that responds to and investigates all complaints.” </p><p id=\"nAeEc2\">The company also raised its status as “the last remaining automobile manufacturer in California” in the post, and said past DFEH investigations had found no evidence of misconduct at the plant. “Yet, at a time when manufacturing jobs are leaving California, the DFEH has decided to sue Tesla instead of constructively working with us,” said the company. “This is both unfair and counterproductive, especially because the allegations focus on events from years ago.”</p><p id=\"LURSan\"><em><strong>Update February 10th, 6:52AM ET: </strong></em><em>Story has been updated with additional details from DFEH’s lawsuit.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/836kEZ79xDlDQXQbZ7FhA5Q4HZM=/0x82:2640x1464/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23231899/1359224391.jpg",
  "description": "Tesla sued for racial discrimination again",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}