{
  "title": "Texas is suing Meta over Facebook facial recognition",
  "url": "https://www.theverge.com/2022/2/14/22933279/texas-attorney-general-facebook-meta-facial-recognition-photo-tagging",
  "date": "2022-02-14T18:23:07.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/tp2ih665bt6MCOdu8iY-qW5kmZw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70507891/acastro_180730_1777_facial_recognition_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"IPehdi\">Texas Attorney General Ken Paxton has sued Meta over its use of facial recognition. The lawsuit, <a href=\"https://www.texasattorneygeneral.gov/news/releases/paxton-sues-facebook-using-unauthorized-biometric-data\">filed today in state district court</a>, claims Meta’s Facebook photo tagging system violated the Texas Capture or Use of Biometric Identifier (CUBI) Act. It’s seeking financial damages and an end to any unauthorized use of Texans’ biometric data.</p><p id=\"m6cXbv\">The <a href=\"https://statutes.capitol.texas.gov/Docs/BC/htm/BC.503.HTM\">CUBI restrictions</a>, which were passed in 2009, require obtaining informed consent before collecting biometric data like facial geometry. The lawsuit alleges that Facebook scanned user photos without asking for permission and downplayed the fact that its automated tagging system amounted to mass biometric data collection. It also echoes an <a href=\"https://www.bloomberg.com/news/articles/2020-08-12/facebook-s-instagram-targeted-in-new-lawsuit-over-biometrics\">earlier lawsuit’s claim</a> that Instagram scans images for facial recognition, allegedly contradicting statements in its user agreement. In a statement sent to <em>The Verge</em> by Dina El-Kassaby, Meta responded that “these claims are without merit and we will defend ourselves vigorously.”</p><p id=\"EAqjkE\">Altogether, the attorney general’s office alleges Meta has “captured the biometric identifiers of millions of Texans without their informed consent, for a commercial purpose, and failed to destroy them in a reasonable time.” The suit seeks $25,000 in civil penalties for each CUBI violation and an additional $10,000 per violation of the Texas Deceptive Trade Practices Act — which <a href=\"https://www.wsj.com/articles/texas-sues-meta-over-facebooks-facial-recognition-practices-11644854794?mod=pls_whats_news_us_business_f\"><em>The</em> <em>Wall Street Journal </em>notes</a> would theoretically total hundreds of billions of dollars.</p><p id=\"iShrxw\">Texas is one of a few states — alongside Illinois and Washington — with a biometric privacy law. The better-known Illinois law has caused headaches for Meta in the past: In early 2021, a judge <a href=\"https://www.theverge.com/2021/2/27/22304618/judge-approves-facebook-privacy-settlement-illinois-facial-recognition\">approved a $650 million class action settlement</a> in that state over the Facebook tagging system. The Texas law, unlike its Illinois counterpart, must be enforced by the attorney general’s office.</p><p id=\"XWLYSO\">Meta <a href=\"https://www.theverge.com/2021/11/2/22759613/meta-facebook-face-recognition-automatic-tagging-feature-shutdown\">discontinued the Facebook automated tagging system</a> in November, several months after the Illinois settlement. But it hasn’t foreclosed the possibility of using facial recognition on other services — including the nascent virtual and augmented reality “metaverse” platforms where the company has focused <a href=\"https://www.theverge.com/22752986/meta-facebook-andrew-bosworth-interview-metaverse-vr-ar\">much of its recent attention</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/D6P-Ny2-sAy26IbTciy8qSt9Sio=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11900053/acastro_180730_1777_facial_recognition_0001.jpg",
  "description": "Meta retired the system last year",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}