{
  "title": "The iPod is dead, but the podcast lives on",
  "url": "https://www.theverge.com/2022/5/15/23071515/ipod-dead-podcast-legacy-apple-spotify",
  "date": "2022-05-15T15:30:00.000Z",
  "author": "Ariel Shapiro",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rbWvWg5EnoNZMNYWCbkdIJ0EKos=/0x0:2500x1667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70871707/hot-pink-new-ipod-nano-0085.0.0.jpg\" />        <figcaption>The back of a seventh-generation iPod Nano. | Photo: Sean O’Kane</figcaption>    </figure>  <p id=\"sIx5Gg\">Pour one out for the iPod, the beautiful little gadget of my teenage dreams. While Apple finally discontinued <a href=\"https://www.theverge.com/2022/5/10/23065412/apple-ipod-touch-canceled-discontinued\">the last iPod model this week</a>, the “pod” lives on in the digital audio medium we all love and obsess over. </p><p id=\"4Ruywx\">The iPod was never really the format where the podcast flourished (that would be the smartphone), but at the time podcasts were getting started, the iPod was pretty much the only game in town. In 2004, <a href=\"https://money.cnn.com/2005/01/03/markets/spotlight/spotlight_aapl/index.htm\">the iPod controlled 60 percent</a> of the total MP3 player market. It was the default option for listening to audio shows on the go, if an inelegant one.   </p><div class=\"c-float-right\"><aside id=\"ajurAe\"><q>In 2004, the iPod dominated the MP3 market</q></aside></div><p id=\"AwfxEf\">“It was a terrible experience,” says Leo Laporte, founder of early digital audio outlet <em>This Week in Tech</em> (TwiT) and host of radio show <em>The Tech Guy</em>. “You had to download it to your computer, connect your computer via iTunes to your iPod, copy it over your iPod, and then you could listen to it.”</p><p id=\"DmchL1\">But with the gadget ubiquitous, the “podcast” name seemed like a natural fit for the scrappy online audio shows that were starting to emerge. So natural that two people claim to have separately merged “iPod” and “broadcast” together. The first recorded instance is in a 2004 <a href=\"https://www.theguardian.com/media/2004/feb/12/broadcasting.digitalmedia\"><em>Guardian</em> article</a> by journalist and technologist Ben Hammersley where he threw around potential names for the medium (“GuerillaMedia” didn’t catch). That same year, digital audio pioneer Dannie Gregoire named one of his software programs “podcaster” and registered domain names featuring the word “podcast,” then <a href=\"https://podnews.net/article/history-of-word-podcast\">popularized it with the help</a> of former MTV VJ and early podcast host Adam Curry. Gregoire says he had not been aware of Hammersley’s article before coming up with the name. “​​It’s an obvious word to come up with, given the technology,” he said. Hammersley did not respond to request for comment. </p><div class=\"c-float-left\"><aside id=\"GuC52m\"><q>Apple embraced podcasting wholeheartedly</q></aside></div><p id=\"d8OKlf\">Either way, it caught on. Apple not only let the word live, despite potential trademark infringement, but it <a href=\"https://www.apple.com/newsroom/2005/06/28Apple-Takes-Podcasting-Mainstream/#:~:text=%E2%80%9CApple%20is%20taking%20Podcasting%20mainstream,to%20their%20computer%20and%20iPod.%E2%80%9D\">embraced the medium wholeheartedly</a> by creating a podcast directory in iTunes in 2005. That same year, <a href=\"https://www.washingtonpost.com/wp-dyn/content/article/2005/08/11/AR2005081100695.html\">George W. Bush began releasing</a> his presidential radio addresses in podcast form. The New Oxford American Dictionary took notice of all the hubbub and made “podcast” <a href=\"https://www.engadget.com/2005-12-06-word-of-the-year-2005-podcast.html\">its 2005 word of the year</a>. </p><p id=\"sQbdl7\">Not everyone was thrilled. For years, <a href=\"https://www.engadget.com/2006-10-07-leo-laporte-wants-to-rebrand-podcasts-as-netcasts-i-agree.html\">Laporte fought</a> — and lost — the battle to rebrand “podcasting” as “netcasting,” arguing that the word tied the form too closely to Apple. Time has proven him right and wrong. Yes, the iPod was a fleeting phase in the run of podcasting. But the word outgrew its namesake to the point where Apple is just one part of the podcasting ecosystem and not even the dominant one. <a href=\"https://www.emarketer.com/content/spotify-apple-podcasts-controversy\">Spotify has taken its crown</a> as the most-used platform for podcasting, and Apple’s podcast programming is minimal, at best. </p><p id=\"5XuLpJ\">Even so, the word is inescapable. A few years ago, Laporte relented and finally changed the TWiT Netcast Network to the TWiT Podcast Network. “That’s the way language is,” he said. “You can’t fight it.”</p><hr class=\"p-entry-hr\" id=\"fTzJXu\"><p id=\"8iJ53G\"><em>This story originally ran in </em>Hot Pod<em>, </em>The Verge<em>’s preeminent audio industry newsletter. You can subscribe </em><a href=\"https://hotpodnews.com/subscribe/\"><em>here</em></a><em> for more scoops, analysis, and reporting.</em></p><aside id=\"RvWfpV\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/cw48RdfT0MncZaB4KW7dIJM9Ioo=/0x91:2500x1400/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3882706/hot-pink-new-ipod-nano-0085.0.jpg",
  "description": "The iPod played a crucial, if fleeting, role in podcasting’s development.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}