{
  "title": "The Bluetooth group is fighting the maker of Dodges and Jeeps for not paying twice",
  "url": "https://www.theverge.com/2022/4/7/23015034/fca-bluetooth-radio-case-first-sale-doctrine-appeals-argument",
  "date": "2022-04-07T19:41:48.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/x2G99vG9Ug1Nqs4YIDjZpb291Kk=/271x0:991x480/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70723065/2022_chrysler_pacifica_technology_hero.0.jpg\" />        <figcaption><em>The radio in the 2022 Chrysler Pacifica, which includes Bluetooth.</em> | Image: Chrysler</figcaption>    </figure>  <p id=\"s4kGWZ\">A US appeals court has decided that Fiat Chrysler Automobiles (or FCA) has a valid argument in a trademark case brought against it by the standards organization behind Bluetooth. The case being litigated could end up setting a precedent about whether automakers can buy radios that are already certified for Bluetooth or whether they will also have to pay the Bluetooth Special Interest Group (SIG) to certify <em>the cars</em>, too, adding cost at a time when <a href=\"https://www.caranddriver.com/news/a38748092/new-car-average-sale-prices-47100/\">car prices are already ballooning</a>.</p><p id=\"DgwzOM\">The Bluetooth SIG sued the automaker — now known as Stellantis after FCA merged with Peugeot — back in 2018. At the time, it said that FCA was improperly using its trademark on cars like the Jeep Wrangler and Dodge Grand Caravan, which Bluetooth SIG hadn’t certified. The appeals court’s decision means that the case is being sent back to the lower court, which will now have to listen to the automaker’s argument. You can read that decision at the bottom of this post.</p><p id=\"eghs7q\">FCA’s defense, which was initially rejected by that lower court, is that Bluetooth SIG is trying to double-dip by saying that both the car radio and the car itself have to go through certification. Its basis is something called <a href=\"https://copyrightalliance.org/education/copyright-law-explained/limitations-on-a-copyright-owners-rights/first-sale-exceptions-copyright/\">the first sale doctrine</a> — a concept that’s meant to allow the resale of copyrighted works. In this case, FCA is saying that it applies because it buys its infotainment systems from companies like Alpine, Harmon, and Panasonic, which have already paid fees and gotten their products certified for Bluetooth. Why should it have to re-certify what’s already been certified just because it slotted those products into a dashboard?</p><p id=\"n6ahDW\">Bluetooth SIG thinks it should. In <a href=\"https://fingfx.thomsonreuters.com/gfx/legaldocs/byvrjbdoeve/IP%20BLUETOOTH%20TRADEMARKS%20complaint.pdf\">its complaint</a> (PDF), the group argues that FCA was trying to get “a free ride” by putting Bluetooth branding in cars and ads “without paying requisite product declaration fees” or getting its cars certified. The group’s argument doesn’t seem to be that the automaker is tarnishing its brand with a bad experience — its complaint doesn’t mention compatibility issues at all. Basically, the group is upset that the automaker is getting to say that its cars have Bluetooth just because it bought a radio that was certified for Bluetooth. </p><div class=\"c-float-right\"><aside id=\"iq3dcK\"><q>FCA argues it shouldn’t have to re-certify products just because it’s using them in its cars</q></aside></div><p id=\"CsTc6w\">The recent decision from the appeals court says that the lower court was wrong to reject FCA’s argument that first sale doctrine applies. As <a href=\"https://www.reuters.com/legal/transactional/us-appeals-court-revives-fiat-chrysler-defense-bluetooth-trademark-case-2022-04-06/\"><em>Reuters</em> points out</a>, this doesn’t mean that the case is settled, though — it just means that FCA gets to go back to court and argue it again. While the appeals court’s decision could set precedent for future cases, this isn’t a settled matter yet. FCA might still lose the case, and if so, it could act as a green light for Bluetooth SIG to go after other automakers.</p><p id=\"so0Qvl\">We’ve seen first sale doctrine come up in other cases. It was <a href=\"https://www.theverge.com/2022/2/10/22925252/nike-stockx-shoe-lawsuit-vault-nft-trademark-infringement\">brought up</a> when StockX started selling NFTs featuring images of Nike shoes, saying that the digital tokens were basically stand-ins for physical sneakers it had already bought. It came up again when Nike sued MSCHF for trademark infringement when it collaborated with Lil Was X to sell <a href=\"https://www.theverge.com/2021/3/29/22357225/nike-sues-lil-nas-x-unauthorized-satan-shoes-mschf\">Nike sneakers it had modified into Satan Shoes</a> (which were made with human blood). MSCHF and Nike <a href=\"https://www.theverge.com/2021/4/8/22374480/nike-mschf-lil-nas-x-unauthorized-satan-shoes-lawsuit-settled\">ended up settling</a> before there were any arguments in court about whether the first sale doctrine allowed it to sell a set of shoes with Nike’s logo on them, and the StockX lawsuit is <a href=\"https://www.reuters.com/legal/litigation/stockx-strikes-back-nike-nft-lawsuit-2022-03-31/\">still ongoing</a>.</p><p id=\"iusoXP\">Of course, it’s not just limited to cases involving Nike — there have also been arguments about it in relation to <a href=\"https://www.theverge.com/2021/12/13/22826114/takedown-notices-online-thrift-shops-copyright-trademark\">online thrift shops</a> and the <a href=\"https://www.theverge.com/2013/3/19/4123740/supreme-court-upholds-first-sale-rights-abroad\">sale of used books and DVDs</a>.</p><div id=\"HUiQ1K\"><iframe src=\"https://embed.documentcloud.org/documents/21580545-appeals-court-fca-bluetooth-sig-opinion/?embed=1&amp;responsive=1&amp;title=1\" title=\"Appeals Court FCA Bluetooth SIG opinion (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/ojMsmZLCK5njfEKNCGqZKo1kSwU=/186x0:1103x480/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23374245/2022_chrysler_pacifica_technology_hero.jpg",
  "description": "The court case shall continue.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}