{
  "title": "The Cuphead Show is half-full of lukewarm nostalgia plays",
  "url": "https://www.theverge.com/2022/2/14/22933027/the-cuphead-show-review-netflix",
  "date": "2022-02-14T21:37:05.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GreUbFwmMzE-JU8KDhKulft5Ono=/110x0:1730x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70508761/Cup.0.jpeg\" />        <figcaption>Cuphead and Mugman realizing that they’re in danger. | Netflix</figcaption>    </figure>  <p id=\"ZnhdxK\">Watching <a href=\"https://www.theverge.com/2022/1/18/22884643/netflix-the-cuphead-show-trailer-release-date\"><em>The Cuphead Show</em></a>, Netflix’s new adaptation of the Studio MDHR run-and-gunner featuring two anthropomorphic cup brothers, it’s hard to say who exactly the series is for. </p><p id=\"NZ5c51\">Like <a href=\"https://www.theverge.com/2017/9/28/16378364/cuphead-art-design-1930s-animation\">the game before it</a>, <em>The Cuphead Show</em> revolves around Cuphead (Tru Valentino) and his brother Mugman (Frank Todaro), two rambunctious talking cups who love each other almost as much as they enjoy beating one another up whenever their kindly guardian, Elder Kettle (Joe Hanna), isn’t watching. Though the boys enjoy getting into all sorts of mischief in and around their tiny cottage, they know that there’s a world of adventure waiting for them on the rest of the Inkwell Isles, where they’re not meant to wander without supervision. It’s during one of the brothers’ excursions into town to spend time at a carnival that they end up crossing paths with the Devil (Luke Millington-Drake), a singing, dancing con man with his eyes set on owning Cuphead’s soul, a turn of events that Cuphead himself doesn’t seem all that concerned about at first.</p><p id=\"xXGA0q\">As <em>The Cuphead Show</em>’s 12-minute-long premiere<em> </em>lays out its premise, you can see some some of the logic <em>Cuphead </em>co-creators Chad and Jared Moldenhauer (who also serve as the series’ co-executive producers) applied while figuring out how to fit the original game’s story into 12 episodes. Though there’s still plenty of the game’s core plot that follows the brothers as they’re forced to come up with ways of outsmarting the Devil, <em>The Cuphead Show </em>tries to spend some time fleshing out the lives of its supporting characters like the villainous King Dice (Wayne Brady) and Ms. Chalice (Grey Griffin). It’s almost always great when video game expansions — be they actual playable game content, or “expansions” in the narrative sense the way <em>The Cuphead Show </em>is — go for this kind of character-broadening and world building. </p><p id=\"38OQ2F\">In <em>The Cuphead Show</em>’s case, though, the way the series jumps between plots from episode to episode has a way of making it feel a bit disjointed at times, like a project that’s best consumed as supplementary material to the game. When you pause on any given frame of <em>The Cuphead Show</em>, most everything about it will look like a still from a show based on <em>Cuphead</em> the game. That’s not exactly the case when you hit the play button, however, as a whole host of small changes here and there add up to a final product that feels like a version of <em>Cuphead </em>that lost some of its essence in the process of being translated across mediums.</p><div id=\"y4Aa2B\"><div ><iframe src=\"https://www.youtube.com/embed/Sel3fjl6uyo?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"bnOu2v\">With <em>The Cuphead Show </em>being a modern-day cartoon targeted at young audiences, you can understand why the show’s creative team couldn’t exactly rely on blocks of text-based dialogue set to old-timey music in order to move its story along. Rather than settling into a measured rhythm befitting the classic Fleischer Studios animation that <em>The Cuphead Show</em>’s aesthetics hearken back to, the new series’ pacing errs more on the modern side of things — which is to say that it’s fast, loud, and a bit more frantic than it needs to be. In some scenes that are clearly based on <em>Cuphead</em>’s more memorable boss battles, the show’s frenzied energy works as a kind of mirroring of the stress that can come as you’re trying to rack up perfect rankings in the game. </p><p id=\"uiDo0z\">But because this is a show you watch and not a game you actively participate in, that same energy often ends up making <em>The Cuphead Show </em>feel as if it’s rushing itself along in fear of people losing interest. The speed with which each of <em>The Cuphead Show</em>’s episodes moves also plays a role in the show’s overall sense of not quite feeling like the tribute to classic Fleischer Studios animation that the game was. It’s not really that <em>The Cuphead Show </em>would work any better if every single frame were illustrated by hand, but rather that it seems unsure of how much energy to put into its faux-vintage-ness versus playing to modern storytelling sensibilities. </p><p id=\"hEgVW3\">By the time that <em>The Cuphead Show </em>does begin to sharpen its focus a bit and dig more into Cuphead and Mugman’s fight for Cuphead’s soul, you can clearly see how close it is to capturing the same kind of magic that made <em>Futurama</em>’s<em> </em>“Hell Is Other Robots” one of that series’ strongest, most memorable episodes. Most of the necessary elements are there, and it’s commendable just how much detail each of <em>The Cuphead Show</em>’s episodes manages to pack given their constraints. Density of details does not always make for great television, though, and in <em>The Cuphead Show</em>’s case, opting for less in favor of giving everyone on screen a chance to breathe might have been the better option.</p><p id=\"2SIJpV\"><small>The Cuphead Show</small><small><em> hits Netflix on February 18th.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/U3BcWQy5cUQlNJnkBEYZgD6xqf0=/0x75:1920x1080/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23240764/Cup.jpeg",
  "description": "Cuphead comes to Netflix.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}