{
  "title": "The Halo show unmasks Master Chief to reveal yet another generic chosen one",
  "url": "https://www.theverge.com/2022/3/23/22991842/paramount-halo-show-review",
  "date": "2022-03-23T18:01:23.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Pablo Schreiber as Master Chief.\" src=\"https://cdn.vox-cdn.com/thumbor/UNfe-9IZ0tuudP8yupN2vObHGyk=/0x0:2781x1854/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70662625/Halo_101_4869_RT.0.jpeg\" />        <figcaption>Paramount Plus</figcaption>    </figure>  <p>Paramount Plus’ Halo show neither shocks nor awes</p> <p class=\"p--has-dropcap\" id=\"JlKGGd\">It would have been a bold move if the Master Chief of <a href=\"https://www.theverge.com/2022/1/30/22909041/halo-trailer-paramount-plus-live-action-showtime\">Paramount Plus’ new <em>Halo </em>series</a> never removed his helmet, and we were left to wonder <a href=\"https://www.theverge.com/22923104/master-chief-chili-recipe-tested-steve-downes\">what kind of person</a> the hulking spartan in his signature Mjolnir armor truly is, as is the case in <a href=\"https://www.theverge.com/2014/11/7/7171681/halo-master-chief-collection-review-xbox-one\">the <em>Halo </em>video games</a>. Repeatedly unmasking Master Chief and highlighting the difficulty he has processing basic emotions is one of the major ways <em>Halo </em>tries to humanize him as he embarks on an adventure across a universe that’s familiar, but slightly different continuity-wise. But rather than using Master Chief as a lens through which to view its war-torn worlds, <em>Halo </em>instead tries to mythologize him with a story that turns him into your standard-issue Chosen One Who Doesn’t Know He’s Special.</p><p id=\"I2EX0L\">Though <a href=\"https://www.theverge.com/2022/3/5/22962196/paramount-plus-first-year-yellowstone-star-trek-1883-spongebob\">Paramount Plus</a>’ <em>Halo </em>doesn’t immediately try to bowl you over with dense world-building information dumps, it’s obvious from the pair of episodes provided to press that co-creators Kyle Killen and Steven Kane both have a deep respect for the source material. With a civil war raging between the United Nations Space Command and groups of insurrectionists from Earth’s off-planet colonies, humanity’s future was already uncertain before the events of <em>Halo</em>’s first season. But things became that much more complicated when alien beings known as the Covenant first appeared unexpectedly and established themselves as a powerful, deadly force from beyond the stars. </p><p id=\"fIJiyP\">While the UNSC’s Spartan super soldiers like Master Chief Petty Officer John-117 (Pablo Schreiber) were created by Dr. Catherine Halsey (Natascha McElhone) to deal with the rebels, their enhanced physical capabilities and combat training make them one of humanity’s most effective means of fighting back the Covenant — a race of bipedal behemoths armed with guns and energy swords. </p>  <figure class=\"e-image\">        <img alt=\"Pablo Schreiber as Master Chief, Kate Kennedy as Kai, Bentley Kalu as Vannak and Natasha Culzac as Riz.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ty187PpnHurchuvOvIn6y4wzmaU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339993/Halo_101_2004_RT.jpeg\">      <cite>Paramount Plus</cite>      <figcaption>Pablo Schreiber as Master Chief, Kate Kennedy as Kai, Bentley Kalu as Vannak and Natasha Culzac as Riz</figcaption>  </figure><p id=\"MsbFPw\"><em>Halo </em>opens in the midst of a Spartan-led attack on a group of insurrectionists that goes left when the Covenant suddenly shows up in a sequence that illustrates how fraught the galaxy’s balance of power has become in the present day. Master Chief and the rest of his Silver Team of Spartans already have marching orders when we’re first introduced to them on the planet Madrigal where they’ve been sent to kill freedom fighters like Kwan Ha (Yerin Ha). But when the Covenant arrives in a barrage of gunfire, Master Chief, Kai-125 (Kate Kennedy), Riz-028 (Natasha Culzac), and Vannak-134 (Bentley Kalu) take it upon themselves to push the invaders back in a fight sequence that establishes just how gruesome <em>Halo</em>’s willing to get. </p><p id=\"So5HqN\">People don’t just get shot in <em>Halo </em>— their bodies are <em>devastated </em>by flurries of bullets that the camera makes sure you never lose sight of in the chaos of the battle. Carefully-placed sprays of blood all work to remind you how vulnerable <em>Halo</em>’s baseline humans are against their well-armed enemies, and the brutality with which the Spartans and the Covenant fight one another is the show’s way of reminding you how both groups can be seen as monstrous, depending on your perspective.</p><p id=\"JQbBBW\">It doesn’t exactly become clear until later on, but the way <em>Halo </em>glamorizes and heroically frames its Spartans in the heat of battle is actually one of the more effective ways it telegraphs its larger goal making audiences consider what it actually means to root for or want to be a character like Master Chief. <em>Halo </em>wants you to see the Spartans as cool, and the show frequently shifts to a first-person perspective evocative of the games in an effort to make it feel like you’re part of the combat. </p><p id=\"kTFEhi\">But <em>Halo </em>also wants you to understand how Halsey’s Spartan program has robbed Master Chief of vital aspects of his identity in order to mold him into an unfeeling killing machine incapable of truly living for or understanding himself. What he does understand, though, is that he’s quite skilled at killing terribly-rendered CGI aliens, and that he has some sort of connection to a powerful MacGuffin-shaped Covenant relic that comes to feature larger in <em>Halo</em>’s story as the season progresses.</p>  <figure class=\"e-image\">        <img alt=\"A member of the Covenant race.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QsDaFvAb_cCbMuOZPo7KmdmRggM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23339984/Halo_S1_005_RT.jpeg\">      <cite>Paramount Plus</cite>      <figcaption>A member of the Covenant race.</figcaption>  </figure><p id=\"jQrBUS\">Master Chief is only but so aware at first of the depths of the UNSC’s treachery and Halsey’s willingness to break the law in pursuit of illegal science, but <em>Halo </em>puts a significant amount of that on display, again, in order to show you how the story being told isn’t quite as simple as good vs. evil. Even though Halsey and John’s unsettling mother / son dynamic is a core part of their nuanced relationship in the <em>Halo </em>games, here, it plays much more two-dimensionally in part because of how zoomed-in on the pair <em>Halo </em>often is. Because we’re only told so much about the history of <em>Halo</em>’s world, it’s hard to get a sense of how much debate there is around the ethics of Halsey’s work and the influence she has over the Spartans. This is part of the reason why Cortana’s (also McElhone) introduction ends up feeling less like <em>Halo </em>translating one of the franchise’s most iconic characters across mediums and more like it’s trying to make the character work for TV by stripping her of some important video game context.</p><p id=\"vaRPTx\">As Master Chief, a character known for his stoicism and general silence, Schreiber is serviceable — good, even — in moments where he’s meant to just be standing there exuding intimidating energy. In more emotional moments, though, <em>Halo</em>’s John suffers from being rendered as inert and somewhat flat in ways that have little to do with his canonical conditioning. This Master Chief is presented as a brainwashed man who’s beginning to recall the life he led before the UNSC kidnapped him and the other Spartans-to-be like Soren-066 (Bokeem Woodbine) as children. Watching someone figure out who they are or used to be can be interesting when that person is more than just a souped-up cipher, but that’s precisely what <em>Halo</em>’s Master Chief often feels like: an ubercipher whose relatability depends on one’s ability to see themselves in hypermasculine space marines who shoot first and don’t ask questions, mostly.</p><p id=\"UqxOjR\">Though <em>Halo </em>works hard to put Master Chief on a pedestal, a number of narrative decisions like introducing foil character Makee (Charlie Murphy), a human kidnapped and radicalized by the Covenant, have a way of making it feel like Paramount Plus wasn’t <em>entirely </em>sold on him as a concept. That in and of itself wouldn’t be so much of an issue if it weren’t for how <em>Halo</em> has a tendency to feel like just another episodic epic about humans battling aliens rather than a strong, vision-focused adaptation of one of the most beloved Xbox franchises of all time.</p><p id=\"AKXupv\"><em>Halo</em> is set to premiere on Paramount Plus on March 24.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/frw5gMBVWZhnBXsoMp1JDp2bjeU=/0x139:2452x1423/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340142/Halo_101_4638_RT.jpeg",
  "description": "Paramount Plus’ Halo show can’t figure out its take on Master Chief",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}