{
  "title": "The best wired or wireless gaming mouse you can buy",
  "url": "https://www.theverge.com/21252193/best-gaming-mouse",
  "date": "2022-04-12T15:31:37.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/emGA8ro9D4lNLBPQkh0oh092_xQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/66870539/acastro_200323_1777_gamingMouse_0001.0.0.jpg\" />        <figcaption><em>Whatever your budget or grip style is, we’ve found the best gaming mouse for you.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>Multiple picks for all budgets</p> <p id=\"eiRucN\">Finding the right gaming mouse amid all the options available can be a struggle. There are a lot of factors to consider, like how it looks, how it feels in the hand, the button selection and arrangement, the quality of its sensor, and whether you want a mouse that’s wireless or wired. These details, minor as they may seem, can have a major impact on your experience with the mouse you choose to buy. On the other hand, sometimes mice have features that get overblown and aren’t really worth the extra cost. </p><p id=\"MOD0oD\">If you’re looking for a wireless gaming mouse, you’ll want the best that your budget allows for. The best wireless gaming mouse is <a href=\"https://www.amazon.com/dp/B07L4BM851?&amp;linkCode=sl1&amp;tag=vergereviews-20&amp;linkId=0e8456acb6ff5049a8ca9a3010f859d7&amp;language=en_US&amp;ref_=as_li_ss_tl\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Logitech’s G502 Lightspeed</a>. It’s the most well-rounded choice if you want comfort, a long-lasting battery, and the best selection and arrangement of buttons. But if you want some alternatives, there are some new, solid contenders below that offer different designs and features.</p><p id=\"bbAxZF\">If you are looking for the best wired gaming mouse, we’ve recently made some major changes to this section. The Razer DeathAdder V2 has been dethroned by the more feature-dense <a href=\"https://shop-links.co/cgxJSoX8hWV\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Razer Basilisk V3</a>, and for people who don’t want to spend $70, there’s a cheaper alternative to consider.</p><p id=\"xBKPjC\">Like our guide to the <a href=\"https://www.theverge.com/21549510/best-gaming-headset-wired-wireless-features-specs-price-sound-microphone-test-buy\" rel=\"sponsored nofollow noopener\" target=\"_blank\">best gaming headset</a>, what follows focuses mostly on newer models that you’re more likely to see on store shelves as opposed to older models, which may be tougher to find in stock — even if they might still be worth your money.</p><p id=\"0ywWGk\"><em>Note: there’s typically a dry spell for new mice at the beginning of the year, so we aim to update this as soon as we’re able to take a look at the new, upcoming releases.</em></p><hr class=\"p-entry-hr\" id=\"IFgBQ4\"><h2 id=\"PBNYtv\">SELECT A CATEGORY</h2><ul><li id=\"6VaHUe\"><a href=\"https://www.theverge.com/21252193/best-gaming-mouse#3lO4oA\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The best wireless gaming mouse: Logitech G502 Lightspeed</a></li><li id=\"PoiOGu\"><a href=\"https://www.theverge.com/21252193/best-gaming-mouse#I7xlEt\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The runner-up wireless mouse: Corsair M65 Ultra Wireless</a></li><li id=\"tmDnis\"><a href=\"https://www.theverge.com/21252193/best-gaming-mouse#WRps16\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Other good wireless options</a></li><li id=\"e57OQ6\"><a href=\"https://www.theverge.com/21252193/best-gaming-mouse#OXztCs\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The best wired gaming mouse: Razer Basilisk V3</a></li><li id=\"CYNcn3\"><a href=\"https://www.theverge.com/21252193/best-gaming-mouse#whOXje\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The runner-up wired mouse: Cooler Master MM720</a></li><li id=\"xUgOpL\"><a href=\"https://www.theverge.com/21252193/best-gaming-mouse#opSJY5\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Other good wired options</a></li></ul><hr class=\"p-entry-hr\" id=\"OI1GuQ\"><h2 id=\"3lO4oA\">The best wireless gaming mouse: Logitech G502 Lightspeed ($120)</h2><div>  <figure class=\"e-image\">        <img alt=\"Best gaming mouse: Logitech G502 Lightspeed\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KjQweePnmr6NqW900etrvOctA34=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/16219644/akrales_190507_3407_0017.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>Logitech G502 Lightspeed  </em></figcaption>  </figure></div><p id=\"GenFNF\">The Logitech G502 Lightspeed is a great gaming mouse for discerning gamers who don’t want to compromise on much of anything — or for casual users who just want a good, solid mouse. It’s comfortable and feature-packed, and even though it’s wireless, it’s a fast and accurate performer that doesn’t feel at a disadvantage against wired mice. </p><p id=\"gJdIHm\">At $150, the best doesn’t come cheap (though you can sometimes find it for around $100). But if you’ve tossed around the idea of making an investment in a high-end wireless mouse, no other model that I tested for this buying guide justified its price so easily. The G502 Lightspeed has the best features of Logitech’s gaming and general-use mice all rolled into one. The main buttons deliver a satisfying bounce response when you tap them, and unlike some other popular models, they click easily no matter how you grip your hand on the mouse. </p><p id=\"qIq7sZ\">This mouse also features a quick-release button, a feature borrowed from other Logitech consumer-focused and gaming mice. By default, the scroll wheel staggers down a single webpage with each step, which is how you expect a scroll wheel to work. Tapping the button releases the mechanism gripping the wheel, allowing it to freely sail to the bottom of a long page. It’s a small feature, but one that gives the mouse more versatility in certain situations, like being able to quickly scroll through your inventory when in a game.</p>  <figure class=\"e-image\">        <img alt=\"Logitech G502 Lightspeed\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tRLAe6Nq6SE9DoYoV5sxbZJTxrk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/16219645/akrales_190507_3407_0026.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The G502 Lightspeed may not have the most inviting design, but it’s incredibly comfortable to use.</em></figcaption>  </figure><p id=\"1Q3DLU\">Another nice feature is the inclusion of 16 grams of weights you can insert into the mouse to give it more resistance. A mouse’s weight comes down to personal preference, and that could vary from game to game. This mouse is among the few modern wireless devices to give you the flexibility to change up the weight. </p><p id=\"v2V6RE\">The fact that the G502 Lightspeed is wireless makes it that much easier to bring along with you wherever you go. But if you just can’t swing the $150 price, I suggest that you check out the $50 <a href=\"https://www.amazon.com/dp/B07GBZ4Q68/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Logitech G502 Hero</a>, which is the wired version of this mouse. It has almost every feature that you’ll find in the wireless model — except, you know, wireless capability. </p><div id=\"UBe8su\"><div data-anthem-component=\"productcard:9550529\" data-anthem-component-data='{\"layout\":\"full_with_square_img\"}'></div></div><hr class=\"p-entry-hr\" id=\"1K4jR3\"><h2 id=\"I7xlEt\">The runner-up: Corsair M65 Ultra Wireless ($130)</h2>  <figure class=\"e-image\">        <img alt=\"Corsair M65 Ultra Wireless\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/i2jkT3Tx63B1LBX33LDCe53SJcc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23067610/cfaulkner_141231_4910_0008.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>In terms of fit and finish, the M65 Ultra Wireless is identical to its wired counterpart.</em></figcaption>  </figure><p id=\"OxTTkG\">Corsair’s M65 has long been one of my favorite mouse designs. It’s hefty, bulky, and each of its buttons are big enough that I never whiff on hitting them. That all might sound like it amounts to an unwieldy mouse to some (and it will be, if you prefer lighter mice that have a lower profile), yet it always makes me feel like I have total control over every aspect of the mouse. So it wasn’t a surprise that I enjoyed using the new M65 Ultra Wireless, which keeps the same design (including the ability to add up to 18g of weights), but lops off the cable, adding Bluetooth and 2.4GHz wireless support.</p><p id=\"mvkqcx\">Just like the wired version, this one comes with extra weights, letting you boost it from 110g (its default weight) to 128g after you add three weights. As several wireless mice are gunning to be a featherweight, averaging at around 65g, this one’s a monster comparatively.</p><div id=\"bnxVKm\"><div data-anthem-component=\"productcard:10909065\" data-anthem-component-data='{\"layout\":\"full_with_square_img\"}'></div></div><p id=\"IcMvHo\">I enjoy using the M65 Ultra Wireless as much as the G502 Lightspeed in-game, though there was one experimental feature on Corsair’s mouse that gave it the edge: its gyroscope that can trigger preset actions when you tilt the mouse. After you customize this setting in Corsair’s iCue companion software, you can do things like reload or anything else by giving the mouse a tilt. It’s satisfying to use and undeniably clever, though this never became second nature to me. That said, I could see this being the kind of feature that earns this mouse some die-hard fans. </p>  <figure class=\"e-image\">        <img alt=\"Corsair M65 Ultra Wireless\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2TrjyALbhq-keuEuKwwSzEbDs2c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23067603/cfaulkner_141231_4910_0001.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>The M65 Ultra Wireless’ side buttons are delightfully big, making them easy to feel.</em></figcaption>  </figure><p id=\"gpY31v\">The fit and finish of the M65 Ultra Wireless is on par with some of the best mice out there, though I missed one too many features to make this my main mouse. Namely, the G502 Lightspeed’s button that lets the scroll wheel spin freely when pressed is essential because it makes the mouse more useful in both games and non-play time when I’m working. I like that the Corsair’s mouse charges via USB-C, while the G502 Lightspeed is using Micro USB. If these differences don’t irk you, and you’re alright with a heavy mouse, you might really like the M65 Ultra Wireless. As for me, it’s one that I want to keep on my desk for some games, but not for nonstop use.</p><hr class=\"p-entry-hr\" id=\"vOoCiS\"><h2 id=\"WRps16\">Other good wireless options</h2>  <figure class=\"e-image\">        <img alt=\"Logitech G303 Shroud\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-tXZtDJOTsSPvJgWBDrdJ3OsLrI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23067611/cfaulkner_141231_4910_0009.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>The G303 Shroud makes for an understated addition to your desk.</em></figcaption>  </figure><p id=\"Z5bmll\">Logitech recently released a wireless take on its G303 Daedalus mouse in partnership with pro gamer and streamer Shroud. It’s called the G303 Shroud. And while this <a href=\"https://www.amazon.com/Logitech-Lightspeed-Wireless-tunable-Weights/dp/B08L9HPLP1/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$109.99 mouse</a> is relatively light on features (and mostly identical to its wired counterpart, with two side buttons and a DPI switcher being its only supplemental buttons), it’s a comfortable, long-lasting option that seems particularly well suited to first-person shooters.</p><p id=\"BFUrM5\">Compared to the G502 Lightspeed above, the G303 Shroud doesn’t exactly cradle your hand, though gamers who don’t want to smother a mouse with their grip might prefer how this one feels. It has an ambidextrous shape (though its thumb buttons suit right-handed mouse users), and the translucent plastic sides jut out a bit to fit within your thumb joint and serve as a stopper for your pinky on the other side. The thumb buttons here are easy to reach for, though I wish they were thicker to minimize the chance of misfiring during a heated match. </p>  <figure class=\"e-image\">        <img alt=\"Logitech G303 Shroud\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qzVEV0SDPTmtLDwrwCtMFuXJEBI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23067609/cfaulkner_141231_4910_0007.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>I wish the G303’s side buttons were thicker, but they’re more than serviceable as is.</em></figcaption>  </figure><p id=\"DJ4z1H\">The G303 Shroud is a simplistic gaming mouse that some minimalists will take to for its distinct lack of flair — the only LED is its battery indicator near the scroll wheel. The G303 didn’t blow me away with its design or with how it feels in the hand, but it’s a solid option if you want a no-frills wireless gaming mouse — if you can swallow the cost.</p><div id=\"b1o7wq\"><div data-anthem-component=\"productcard:11008667\"></div></div>  <figure class=\"e-image\">        <img alt=\"Corsair Dark Core RGB Pro SE\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/34H4GpKR93Xz1ejL3_3XCarRxQw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19984098/cfaulkner_200513_4020_0001.0.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>  </figure><p id=\"LxusJS\">Corsair’s Dark Core RGB Pro SE (<a href=\"https://shop-links.co/1726258737981131320\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$84.99</a>) is a good pick if you want oodles of features, including USB-C and Qi wireless charging. This mouse can switch between 2.4GHz wireless mode via its included USB dongle (cleverly tucked under its removable, magnetic wing) or Bluetooth. Of course, you’ll get better results by using the dongle, but it’s great to have options. I found that the battery life, while decent, wasn’t quite as long-lasting as the G502 Lightspeed or the Kone Pro Air.</p><p id=\"fOpEA3\">Some smaller, but equally welcome, features here come in the form of that removable magnetic wing I just mentioned, which snaps onto its right side to let me comfortably rest my ring and pinky fingers. You might appreciate this most customizable design like I did.</p><div id=\"pmQZjo\"><div data-anthem-component=\"productcard:11008674\"></div></div><hr class=\"p-entry-hr\" id=\"9tGmNh\"><h2 id=\"OXztCs\">The best wired gaming mouse: Razer Basilisk V3 ($70)</h2><p id=\"KJMcde\">Razer’s DeathAdder V2 has been my favorite wired gaming mouse for a while, mainly because it’s just so comfortable to use. But one of Razer’s newer mice, the <a href=\"https://www.amazon.com/Razer-Basilisk-Customizable-Ergonomic-Gaming/dp/B09C13PZX7?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$59.99 Basilisk V3</a>, delivers the comfort that I’m looking for, along with several more features. One feature that I personally have a tough time living without is its new scroll wheel tech that can automatically alternate between ridged scrolling and free-spin modes depending on the intensity of your scrolling. This is a feature that comes in handy in and out of gaming.</p>  <figure class=\"e-image\">        <img alt=\"Razer Basilisk V3\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rkAF9GigtoFNF7N99FqpSZ6qzcA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23067607/cfaulkner_141231_4910_0005.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>The DPI clutch (also known as the sniper button) is now fixed to the Basilisk V3. It was removable in the previous iteration.</em></figcaption>  </figure><p id=\"25cJZk\">The Basilisk V3 is, in many ways, identical to its predecessor, with a familiar, ergonomic design that’s similar to the G502 Lightspeed wireless gaming mouse. There’s a large, grippy thumb rest on its site, sharing that space with two generously sized thumb buttons and a DPI clutch that can make sniping easier (unlike the V2, where this clutch was optional, it’s fastened to the V3). This mouse has some other niceties as well, like a tilting scroll wheel and support for multiple profiles saved to its onboard storage. If you’re inclined to customize your RGB LEDs, this mouse has a section around its entire body that can let LEDs shine onto your mousepad.</p><p id=\"gAzpUr\">The $69.99 Basilisk V3 costs the same amount as the DeathAdder V2 at many retailers, and for the price, you’ll be hard-pressed to find a mouse that can offer more features.</p><div id=\"WDXFps\"><div data-anthem-component=\"productcard:10909072\" data-anthem-component-data='{\"layout\":\"full_with_square_img\"}'></div></div><hr class=\"p-entry-hr\" id=\"zVjY6B\"><h2 id=\"whOXje\">The runner-up: Cooler Master MM720 (starts at $27)</h2><p id=\"Y7fF8B\">During the latest update to this guide, no mouse that I went hands-on with surprised me as much as Cooler Master’s MM720, a $50 model that, as it turns out, has a bit of a cult following for a good reason. It’s one of the most comfortable mice that I have ever used, with a design that’s equally suited to people who want a cozy grip during work hours and those who have a claw grip while gaming. </p><p id=\"TuxwdM\">The MM720’s design is undeniably divisive (and goofy) at first blush, with a large section jutting out of its right side to give your ring or pinky fingers a cozy place to rest. There’s much about this mouse’s design that one person may love, while another might curse its existence. Like all mice, however, it comes down to personal preference, grip style, and the games that you like to play. As for me, it feels great to use, despite the fact that I don’t tend to use a claw-style grip. Instead, my medium-sized hand fits over the mouse’s barely curved surface, with my fingertips hanging off the edge of the mouse slightly. </p>  <figure class=\"e-image\">        <img alt=\"Cooler Master MM720\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3TJ5NxN5-npgqFMakX5vW9nWop8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23067605/cfaulkner_141231_4910_0003.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>      <figcaption><em>The MM720 is one of the lightest wired mice around at 49 grams. Yet, it doesn’t feel like a toy.</em></figcaption>  </figure><p id=\"hGIqmg\">The MM720 is the lightest mouse that I’ve tested yet, coming in at 49 grams. Despite that ultra-lightweight build, it doesn’t feel hollow or cheap — not that this mouse has much to prove at $27. It features two main mouse buttons, as well as an LED-lit scroll wheel that indicates the DPI sensitivity when you press its bottom-located DPI-switching button. Its two thumb buttons on the side are slightly bulbous, too, which makes them easier to feel. There are just a lot of smart design choices here considering the low price.</p><p id=\"nXD6D5\">If you’re shopping for a wired mouse on a budget, and you know you don’t want a ton of features, consider picking up Cooler Master’s MM720. There’s less at stake with the cost compared to pricier mice, and if your taste in mice and grip style sound anything like mine, you stand to be impressed.</p><div id=\"j41kF0\"><div data-anthem-component=\"productcard:10909085\" data-anthem-component-data='{\"layout\":\"full_with_square_img\"}'></div></div><hr class=\"p-entry-hr\" id=\"d6EsI3\"><h2 id=\"opSJY5\">Other good wired options</h2><p id=\"QqAQPG\">Razer’s DeathAdder V2 is proof that a wired mouse doesn’t need countless features to be worth the money — it just needs to be extremely good at the fundamentals. It should be comfy enough to use for hours at a time with games that require quick reflexes, feature a simple assortment of buttons that take little to no time to master, and, of course, offer great performance. If this matches what you want in a mouse, the <s>$70</s> <a href=\"https://www.amazon.com/Razer-DeathAdder-Gaming-Mouse-Programmable/dp/B082G5SPR5/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$37.56 Razer DeathAdder V2 is the one to get</a>.</p><div id=\"VWlfF0\"><div data-anthem-component=\"productcard:10674248\"></div></div>  <figure class=\"e-image\">        <img alt=\"SteelSeries Prime Plus\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CU-ZSEdoLEZdTXD28DuCS5oJ31g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22528993/primeplus.jpg\">  </figure><p id=\"UMPQwJ\"><a href=\"https://shop-links.co/1743526088835385586\" rel=\"sponsored nofollow noopener\" target=\"_blank\">The $50.99 Prime Plus</a> is the middle child in SteelSeries’ new <a href=\"https://www.theverge.com/2021/5/25/22445746/steelseries-prime-arctis-headset-wireless-plus-gaming-mouse-features-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">made-for-esports Prime lineup</a> of mice, yet it’s also the most interesting and value-packed. It feels just like the others in that lineup, both in the way it fits your hand with a high arch that slopes to the right, as well as with what SteelSeries aptly calls “crispy” clicks. They’re a little louder than your average gaming mouse, and they have a more tactile feel.</p><p id=\"xLVmkp\">What sets the Prime Plus apart from the others in the Prime lineup (as well as the other options below) is the OLED screen and controls built into its underside. There’s no driver required to change in-depth settings. You hold the bottom button once it’s plugged in and use the scroll wheel to navigate a menu that lets you change things like the brightness of the OLED and the LED illuminating the scroll wheel. More importantly, you can adjust sensitivity, polling rate (125Hz to 1000Hz), and liftoff distance right from this display. </p><div id=\"LapUa4\"><div data-anthem-component=\"productcard:10608342\"></div></div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/XaAB1eVU8bRyClrUhCnKl0hOpek=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22365358/logitech_g502.jpg\">  </figure><p id=\"TeVjwP\">As I mentioned near the top of this article, if $150 for Logitech’s wireless G502 Lightspeed is too much for you to spend, you might want to consider this wired version, <a href=\"https://www.amazon.com/Logitech-G502-Performance-Gaming-Mouse/dp/B07GBZ4Q68?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">the $40 G502 Hero</a>. It’s basically the same in almost every way as our top pick for the best wireless gaming mouse, down to the kind of sensor it uses and its adjustable weights. That makes it almost as good, though some might take issue with its thick, braided cable and the somewhat slippery plastic used on the scroll wheel that isn’t on the Lightspeed model.</p><p id=\"VPma8f\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pQ1CDQAcBFP_gHkSz9SKURZoAdM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19831031/acastro_200323_1777_gamingMouse_0001.0.jpg",
  "description": "We tested several models from Logitech, Razer, and more to find the best gaming mouse in 2022.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}