{
  "title": "The first US Super Nintendo World is coming to Universal Studios Hollywood in 2023 ",
  "url": "https://www.theverge.com/2022/3/10/22971096/super-nintendo-world-america-universal-studios-hollywood-theme-park",
  "date": "2022-03-10T18:48:46.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Super Nintendo World, Univeral Stuudios Hollywood, opening 2023\" src=\"https://cdn.vox-cdn.com/thumbor/oA9l5NnX1jEgufVTxGDrNCAuqjg=/0x0:1823x1215/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70604925/SNW_Key_Art_2000.0.jpg\" />        <figcaption>Image: Universal Studios Hollywood</figcaption>    </figure>  <p id=\"K0AEbX\">Universal Studios Hollywood <a href=\"https://www.nbcumv.com/mediavillage/interactive/2929fed4187b40648b79a9839e70e91fproduct169208/index.html\">will be the first US park with a Super Nintendo World</a> when it opens its doors next year. Last year, the first Nintendo-style theme park made its debut at a Universal Studios location in Osaka, Japan, despite a number of delays and a global pandemic, and we’ve been waiting <a href=\"https://www.theverge.com/2015/5/7/8564337/nintendo-universal-theme-park-licensing-deal\">since the partnership was announced in 2015</a> to find out when there would be one in the US.</p><p id=\"YL6Lpk\">Universal says Nintendo-themed merch will be available in its gift shop soon but didn’t go into much detail about what rides and experiences will be available at the US Super Nintendo World location. To get an idea of what’s in store, <a href=\"https://www.theverge.com/22339582/super-nintendo-world-review-theme-park-japan\">you can check out our experience in Japan’s park</a>. </p><blockquote><p id=\"LY1Fid\">SUPER NINTENDO WORLD opened first at Universal Studios Japan to rave consumer and critical reviews in 2021. The U.S. debut of SUPER NINTENDO WORLD at Universal Studios Hollywood will transport theme park guests and Nintendo fans into the world of Mario, Luigi and Princess Peach to become part of their compelling universe.</p><p id=\"0L7mny\"> SUPER NINTENDO WORLD was conceived in partnership with Nintendo and the visionaries at Universal Creative to deliver exhilarating entertainment with innovative technological achievements inspired by characters and video games that have appealed to generations of Nintendo fans for over 40 years.</p><p id=\"uDMqUZ\">The immersive land will be a visual spectacle of vibrant colors and architectural ingenuity located within a newly expanded area of the theme park, featuring a groundbreaking ride and interactive areas, to be enjoyed by the whole family. Themed shopping and dining will enhance the entire experience.</p></blockquote><div class=\"c-float-right\"><div id=\"SApEw6\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/SuperNintendoWorld?src=hash&amp;ref_src=twsrc%5Etfw\">#SuperNintendoWorld</a> is opening in 2023 at Universal Studios Hollywood! Level up with exclusive merch at the Feature Presentation store, opening soon. <a href=\"https://t.co/4qh0bDACGN\">pic.twitter.com/4qh0bDACGN</a></p>— Universal Studios Hollywood (@UniStudios) <a href=\"https://twitter.com/UniStudios/status/1501979735978655747?ref_src=twsrc%5Etfw\">March 10, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"XgtQBb\">Similar to The Wizarding World of Harry Potter, Super Nintendo World in Japan uses a separated space within the larger park, as well as a smartwatch-like Power Up Band that pairs with your phone to track your progress through the park. The rides available so far included an augmented reality Mario Kart experience and a slower-paced Yoshi’s Adventure train ride. A Donkey Kong-themed area <a href=\"https://www.theverge.com/2021/9/28/22697850/super-nintendo-world-donkey-kong-area-confirmed\">is supposed to open there in 2024</a>.</p><p id=\"2reEBW\">The <a href=\"https://www.theverge.com/2016/11/29/13775256/nintendo-universal-theme-parks-us-mario-orlando-hollywood\">list of planned Nintendo parks</a> also includes Universal Studios Orlando. There’s no mention of when that park will be ready to open, but fans <a href=\"https://www.orlandoweekly.com/orlando/everything-we-know-about-universals-upcoming-epic-universe-park/Content?oid=30511662\">have been tracking the progress of construction there closely</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MDq5eQHoAqOBTZNSuZOSLEmfa48=/0x50:2000x1097/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23304145/SNW_Key_Art_2000.jpg",
  "description": "The second Nintendo theme park will open up next year.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}