{
  "title": "The best wired or wireless gaming headsets to buy",
  "url": "https://www.theverge.com/21549510/best-gaming-headset-wired-wireless-features-specs-price-sound-microphone-test-buy",
  "date": "2022-04-12T18:16:45.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Best gaming headset\" src=\"https://cdn.vox-cdn.com/thumbor/v1RJtFLddK43NxKDkfTFTv0_OH8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/67799392/acastro_201109_4282_gamingHeadsets_0001_2021update.5.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>A few options for each platform</p> <p id=\"ekTFw5\">If you’re shopping for a gaming headset in 2022, you have a <em>lot </em>of options. While there are some great ones out there, it’s easy to pay too much, to accidentally purchase a headset that doesn’t work with your desired console or platform, or to get one that’s uncomfortable after a few hours of use. Knowing a thing or two about headphones <em>might</em> aid in your search, but gaming headsets have only gotten more complicated to shop for — especially the wireless ones.</p><p id=\"uOIb46\">For instance, wireless headsets made for Xbox operate via Microsoft’s proprietary wireless protocol. They’ll only work on Xbox consoles or a PC that has one of Microsoft’s Xbox Wireless Adapters plugged in, in most cases. Conversely, if you get a multiplatform wireless headset that includes a 2.4GHz wireless USB dongle, it’ll likely work on the likes of the PS4, PS5, Nintendo Switch (when plugged into the console’s TV dock), and PC — but not Xbox. In short, it’s best to buy the headset that mentions support for your preferred platform(s) explicitly (or just buy a wired gaming headset instead).</p><p id=\"s7JNU3\">This guide focuses mostly on newer options that you’re likely to encounter at stores as opposed to older models that, while possibly still being worthy of your money, are often tougher to find affordably and easily online. Also, just to mention it at the top, I have a large-ish head, and that factor obviously played a major role in how I judge the comfort of these headsets.</p><p id=\"nKGdzA\">You’ll find a few categories below, including the <strong>best multiplatform wireless headsets</strong> that are compatible with PC, PS4, PS5, and Nintendo Switch via its dock (and likely more products than that), the <strong>best Xbox wireless gaming headsets</strong>, <strong>the best PlayStation wireless gaming headsets</strong>, and the <strong>best wired gaming headsets</strong> that support the widest variety of platforms, from console controllers to phones, tablets, and VR headsets that feature a 3.5mm headphone jack. </p><hr class=\"p-entry-hr\" id=\"cwk1AY\"><h2 id=\"McEjqN\">Best multiplatform wireless gaming headset: <a href=\"https://www.theverge.com/2021/9/14/22665355/logitech-g435-lightspeed-wireless-gaming-headset-features-price\">Logitech G435 Lightspeed</a> (<a href=\"https://www.amazon.com/Logitech-G435-Wireless-Gaming-Headset/dp/B08R8DT7X6?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$79</a>)</h2><p id=\"VkhLA2\"><em>Compatible with PC, PS4, PS5, Nintendo Switch (via its dock)</em></p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AK0wY-eE_KIKq1w2fqpMbo1QPd0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001468/akrales_211109_4870_0263.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"rmR97d\">For some time now, Logitech has been on the cusp of making a gaming headset that’s good enough for console gamers, mobile gamers, and PC gamers alike. It has finally nailed the balancing act with its new $79.99 (sometimes cheaper) G435 wireless gaming headset. While this headset likely won’t satisfy most enthusiasts because of its lack of a boom microphone (it utilizes beamforming microphones) and its minimal noise isolation, that doesn’t take away from the G435 being a lightweight and comfortable delight to use.</p><p id=\"qm50XY\">The G435 ships with a USB-A audio transmitter and is compatible with most platforms that have that port, including PCs, PlayStation consoles, and the Nintendo Switch’s dock. It isn’t compatible with Xbox, though. I’ve also had success using a USB-A to USB-C adapter to plug it into my Oculus Quest 2, MacBook Pro, and other devices. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kSXoyFKV3-99o7xb9TzpTt1-dqQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001470/akrales_211109_4870_0299.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"loNIV3\">The G435’s killer feature (aside from its broad compatibility and comfort) is its Bluetooth mode, which lets you connect to a phone so you can remain available to accept calls while you use the headset for something else via the 2.4GHz transmitter. You can also just use them as standard headphones via Bluetooth. It’s far from the first device to combine Bluetooth with 2.4GHz wireless, but the G435’s lightweight design makes it an easier companion to carry around and use for work and play.</p><div id=\"aZK2cz\"><div data-anthem-component=\"productcard:10866389\"></div></div><p id=\"psEEeB\">The G435 headset is an evolution of the <a href=\"https://www.theverge.com/2020/8/25/21378026/logitech-g733-lightspeed-wireless-gaming-headset-accessories-g203-g305-g915-colors\">made-for-PC G733</a>’s design but without the futuristic LEDs. Like the G733, it utilizes breathable ear pads, though its plastic headband is wrapped in a layer of fabric. Speaking of plastic, that’s mostly what you’ll find here. This isn’t a robust headset with steel-reinforced arms, like many of our other options below. Yet, when it’s on your head, it’s comfortable enough that you might just forget about that little detail.</p><p id=\"L9cEM2\">The ear cups are mounted to rails that extend from the headband, letting you easily move them around until you find the right fit. And even though <a href=\"https://imp.i125364.net/c/482924/1195040/11355?subId1=vergegamingheadsets111521&amp;u=https%3A%2F%2Fwww.logitechg.com%2Fen-us%2Fproducts%2Fgaming-audio%2Fg435-wireless-bluetooth-gaming-headset.981-001073.html\">one look at its advertising</a> should tell you that these were built for a younger generation, my large head fits comfortably within the range of the G435’s sizing. There’s no annoying clamping, and these are extremely lightweight, so fatigue wasn’t something that I encountered.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lyIuWslohYKsqKZs0pmPd0QI6QI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001471/akrales_211109_4870_0311.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"COhKuT\">Sound quality is better than I expected for the price, and I often found myself picking these up just to listen to music. They’re also fine for gaming, though they lack the hearty low-end sound and noise isolation you might be looking for (especially if you game competitively). Generally, if you’re in the market for a lightweight wireless gaming headset that costs no more than $80 (again, it’s often cheaper than this) and has a good number of features and broad compatibility, check out the G435.</p><div id=\"mZOYqO\">Here’s what the microphone on the Logitech G435 Lightspeed headset sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23017066/logitechg435.mp3\" type=\"audio/mp3\"></source></audio></div><hr class=\"p-entry-hr\" id=\"WZCbmS\"><h2 id=\"XkeORm\">A runner-up: <a href=\"https://www.theverge.com/e/22548062\">Epos H3Pro Hybrid</a> (<a href=\"https://www.amazon.com/gp/product/B099KPHR5B/ref=ox_sc_act_title_1?smid=ATVPDKIKX0DER&amp;psc=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$279</a>)</h2><p id=\"Wx556r\"><em>Compatible with PC, PS4, PS5, Nintendo Switch (via its dock)</em></p>  <figure class=\"e-image\">        <img alt=\"Epos H3Pro Hybrid\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NWtzwpFH05xquTWzdHvv0rNNgCg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001463/akrales_211109_4870_0115.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"ZLXEQ9\">The Epos H3Pro Hybrid is a new favorite if you’re okay with spending a little more on a gaming headset. At $279, this wireless model supports 2.4GHz wireless and Bluetooth concurrently, like the G435 Lightspeed above. However, in several ways, it’s a huge upgrade in terms of comfort, overall build quality, thoughtful design, and sound quality — all while still remaining relatively lightweight at about 311 grams. </p><p id=\"yZX5q1\">It’s actually similar in appearance and comfort to the company’s more affordable H3 Hybrid wired headset, which includes Bluetooth support in addition to its wired connection. But the H3Pro Hybrid cuts the cord (the option for wired is still there, though) and adds other capabilities that make it worth the price hike.</p><div id=\"cnWdAU\"><div data-anthem-component=\"productcard:10868309\"></div></div><p id=\"ywj8RS\">Notably, the H3Pro Hybrid features a switch that toggles active noise cancellation and further reduces the amount of incoming noise from your surroundings. The thick, plush ear cups already do a good job at limiting noise as it is, and ANC takes it a step further. It’s difficult to hear much of anything around you when the sound-dampening feature is on, so gamers who need to focus closely on positional sounds should find these to be a great companion (not to mention how handy the feature is for just filtering out noise to focus on work). </p><p id=\"B64dqL\">Outside of that, the H3Pro Hybrid makes good on its price by nailing the fundamentals. The steel-reinforced headband feels strong and flexible, and it offers a staggering amount of sizing options, going far beyond the size that my large head requires. The ear cups clamp down just tightly enough to make a seal with your skin, and there’s a generous amount of padding at the headband to keep it from weighing you down. </p><p id=\"dahMWG\">Battery life is good. These support USB-C charging, and with ANC on, they can last around 20 hours per charge or more than 30 hours with ANC off.</p>  <figure class=\"e-image\">        <img alt=\"Epos H3Pro Hybrid\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UsHBuputWCagONM2_uTbD3FNH2E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001461/akrales_211109_4870_0072.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"JNgms6\">They sound good out of the box, but the Epos gaming suite software for Windows is necessary for tweaking the equalizer and other sound and mic settings. With a little fine-tuning, I was able to achieve my preferred sound reproduction of somewhere between warm and a reference sound, with just a little bass to give it some pep. The drivers are punchy and balanced, and in addition to gaming, these are a joy to listen to music with. They look, feel, and sound like premium headphones should in this price range.</p><div id=\"RN18Ik\">Here’s what the microphone on the Epos H3Pro Hybrid headset sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23017058/eposh3prohybrid.mp3\" type=\"audio/mp3\">  <p><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23017058/eposh3prohybrid.mp3\">Here’s what the microphone on the Epos H3Pro Hybrid headset sounds like</a>(opens a new window)</p></source></audio></div><hr class=\"p-entry-hr\" id=\"kVCQQA\"><h2 id=\"j1QvYC\">Best wireless gaming headset for Xbox: <a href=\"https://www.theverge.com/22325883/microsoft-xbox-wireless-headset-gaming-series-x-s-pc-windows-10-review\">Microsoft Xbox Wireless headset</a> (<a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24542&amp;u1=Verge&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fd%2Fxbox-wireless-headset%2F8z1dcql8z512%3Factivetab%3Dpivot%3Aoverviewtab\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$99.99</a>)</h2><p id=\"9eHTCI\"><em>Compatible with Xbox Series X / S, Xbox One, Bluetooth-ready devices, and PC if you have an adapter</em></p>  <figure class=\"e-image\">        <img alt=\"Xbox Wireless headset\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8T3InI_Jx1ABKPuq9tgDd-BkhyM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22363682/cfaulkner_210311_4469_0006.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>  </figure><p id=\"BF4Nbd\">Microsoft’s Xbox Wireless headset is surprisingly good for $100. It has all of the same features as our previous top pick, Razer’s Kaira Pro, but knocks $50 off the price and has a better design. Like the Surface Headphones, this headset features twistable dials on the outside of its earcups, and it simplifies making quick adjustments, like turning up the volume on the right side or tweaking the game / chat audio mix on the left.</p><p id=\"YrpptY\">This headset operates on the Xbox Wireless protocol, letting it connect effortlessly to a modern Xbox console with a push of its pairing button (it pairs just like a controller). It supports a concurrent Bluetooth connection, too, so you can be paired to your phone and console at the same time. </p><div id=\"LIHpB2\"><div data-anthem-component=\"productcard:10420028\"></div></div><p id=\"dv7vfB\">Battery life is fine but not spectacular at around 15 hours per charge. While I really like the Bluetooth feature, this headset lacks a multifunction button for controlling, say, phone calls or playing / pausing music or podcasts coming from your phone or tablet that might be connected. Another fault is that this model lacks a 3.5mm headphone jack, but that might not be a big deal for you.</p><p id=\"XYmful\">Microsoft’s headset doesn’t break new ground — it just does a lot right for a reasonable price. There are other options that offer noise cancellation and more hearty sound quality than this model. But if you don’t want to spend more than $100, most people should be very happy with what the Xbox Wireless headset offers.</p><div id=\"A6JDyP\">Here’s what the microphone on the Xbox Wireless headset sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408477/xboxtest.mp3\" type=\"audio/mp3\">  <p><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408477/xboxtest.mp3\">Here’s what the microphone on the Xbox Wireless headset sounds like</a>(opens a new window)</p></source></audio></div><hr class=\"p-entry-hr\" id=\"yPjxFw\"><h2 id=\"tJaksn\">A runner-up: Victrix Gambit (<a href=\"https://www.amazon.com/Victrix-Gambit-Wireless-Xbox-Headset-Microphone/dp/B08FCWYQGT/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$129.99</a>)</h2><p id=\"5FyUOH\"><em>Compatible with Xbox Series X / S, Xbox One, and PC</em></p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Q8gC2SDcMgGB4htGHKpCOQrEAyw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001472/akrales_211109_4870_0346.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"GxfKc3\">I’m willing to bet that you may not have heard of Victrix, a brand owned by PDP Gaming that’s focused on making peripherals suited for e-sports pros and aspiring gamers. Either way, it made a killer wireless headset in the Gambit that I think many people will enjoy. It’s a $129.99 device that comes in two versions: one that’s compatible with the Xbox family of consoles and with PCs and <a href=\"https://www.amazon.com/Victrix-Gambit-Wireless-Xbox-Headset-Microphone/dp/B08FCVR17N/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">a PlayStation version</a> that operates with a different dongle than the one included with the Xbox version. I tested the Xbox version, which has a different chipset.</p><div id=\"p7cMDC\"><div data-anthem-component=\"productcard:10866862\"></div></div><p id=\"g4jP5W\">It’s easy to recommend this headset to people who want to do the least amount of fiddling. I’m no designer, but it’s tough to imagine how Victrix could have made the built-in controls any more intuitive. On the left ear cup, there’s a mic that turns on when you lower it and mutes when you raise it back upward. That cup also has a button that adjusts between three levels of mic monitoring sensitivity and a rubberized dial for finding the perfect balance of game and chat audio. Over on the right cup, a fantastic volume knob sits alone as the only control. </p><p id=\"6UsdJW\">I enjoyed the sound quality as much, if not slightly more, than the Xbox Wireless Headset above. The Victrix Gambit doesn’t try too hard to woo with bass or with an overly crisp sound that forgoes warmth. It just sounds good out of the box, and I have no complaints about its performance while tethered to the included USB audio transmitter (alternatively, it can be used wired via 3.5mm). Its mic quality is also better than I expected.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2mALx4gvMT8HzvBzYqqhqtRMgoY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001474/akrales_211109_4870_0390.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"Z7EqjY\">Its build quality leans heavily on plastic and leatherette. This alone doesn’t negatively impact its comfort, but it didn’t feel like it seamlessly fit my head like a glove the way Microsoft’s option did.</p><p id=\"omhxWE\">For me, this headset’s lack of a USB-C charging port would be a deal-breaker — it uses a Micro USB port for recharging. That aside, there’s very little that the Victrix Gambit does wrong, and unlike with Microsoft’s Xbox Wireless Headset, the included audio transmitter lets it work with a PC out of the box using the Xbox Wireless protocol (normally, you’d have to purchase Microsoft’s own transmitter that doubles as a wireless controller hub). But unless you prefer it aesthetically, it’s tough to recommend it over the cheaper Xbox Wireless Headset if you’re just gaming on Xbox. </p><div id=\"3lknrN\">Here’s what the microphone on the Victrix Gambit headset sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23017025/victrixgambit.mp3\" type=\"audio/mp3\">  <p><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23017025/victrixgambit.mp3\">Here’s what the microphone on the Victrix Gambit headset sounds like</a>(opens a new window)</p></source></audio></div><hr class=\"p-entry-hr\" id=\"fD8Ib3\"><h2 id=\"NvDGre\">Best wireless gaming headset for PlayStation: <a href=\"https://www.theverge.com/2021/10/29/22726734/steelseries-arctis-7-7p-plus-battery-life-usb-c-features-price-compatibility\">SteelSeries Arctis 7P Plus</a> (<a href=\"https://shop-links.co/cf0AY3Z81f3\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$169.99</a>)</h2><p id=\"Nz0scw\"><em>Compatible with PS5, PS4, PC, Nintendo Switch, mobile, Oculus Quest 2</em></p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GmIrmAdddJUsjpFzP87v7Dw4mPQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001466/akrales_211109_4870_0168.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"TNyeD4\">The SteelSeries’ Arctis 7P Plus has dethroned Sony’s own Pulse 3D headset as the best option out there for PlayStation gamers, despite costing $69 more. It’s one of the company’s most complete headsets yet in terms of features, connectivity, and comfort. Really, the previous version nailed the comfort already, but this year, it added on more battery life, a game and chat audio dial, and USB-C charging (good riddance, Micro USB).</p><div id=\"tw7021\"><div data-anthem-component=\"productcard:10866865\"></div></div><p id=\"cqOHWp\">If you’ve read anything about the older Arctis 7P, that’s probably still true about this newer one. It has SteelSeries’ signature ski goggle headband that suspends its weight without pressing down. The ear cups rotate to be stored more easily or lay on your chest. It still includes a USB-C audio transmitter (and a USB-A converter), making it compatible with a wide range of devices, including the Oculus Quest 2, Switch, and much more. It’s these small additions that elevate this year’s model higher in our rankings than before. Also, it comes in black if you prefer that color over white.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SrnWL1G59uJIn_vKtUTmYPwV3Js=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23001467/akrales_211109_4870_0213.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure><p id=\"jZRyTE\">SteelSeries boosted the advertised battery life from 24 to 30 hours per charge — a claim that it meets. I won’t shut up about USB-C charging, and in this case, it really just makes a lot of sense to have since it’s the same charging port as the DualSense controller. This is the first of many (I hope) SteelSeries headsets to ditch Micro USB for the reversible USB standard.</p><p id=\"ZQsvDR\">The $169.99 price might be steep if you were hoping to spend less, but compared directly to the Pulse 3D headset, the Arctis 7P Plus’s comfort, microphone quality, button layout, and ease of use make it a far better choice for gamers who want to get the best bang for their buck.</p><div id=\"F3ZGSk\">Here’s what the microphone on the SteelSeries Arctis 7P Plus headset sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23017035/arctis7pplus.mp3\" type=\"audio/mp3\">  <p><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23017035/arctis7pplus.mp3\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Here’s what the microphone on the SteelSeries Arctis 7P Plus headset sounds like</a>(opens a new window)</p></source></audio></div><hr class=\"p-entry-hr\" id=\"RnfN90\"><h2 id=\"eOf5hA\">A runner-up: Sony Pulse 3D (<a href=\"https://www.amazon.com/PULSE-3D-Wireless-Headset-PlayStation-5/dp/B08FC6QLKN/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$100</a>)</h2><p id=\"p66JhZ\"><em>Compatible with PS5, PS4</em></p>  <figure class=\"e-image\">        <img alt=\"Sony Pulse 3D headset\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rOf5ce2ocE5G4xWmRzB8Os1tqq8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22276836/pulse3d.jpg\">      <cite>Sony</cite>      <figcaption>The Sony Pulse 3D gaming headset</figcaption>  </figure><p id=\"KWlvfW\">Sony’s $99 Pulse 3D wireless headset for the PS4 and PS5 is a surprisingly feature-packed headset that’s also one of the most comfortable options on this list. I’m a sucker for well-fitting headsets, and the bungie-style headband Sony supplies is fantastic. Instead of having a hard plastic band pulling down on the top of your head, this headset hangs its weight on a silicone band. It gives the headset a near-weightless feel when it’s on my head. <strong>Just a note</strong>: the ear cups are on the smaller side, and while mine fit just fine, folks with larger ears might not find them all that comfortable.</p><p id=\"avxDnB\">The Pulse 3D’s headline feature, though, is its ability to serve up 3D audio from the PS5’s Tempest sound engine. Actually, Sony says most headphones can push out the 3D effect, but this headset was made to really show it off. Support for 3D audio varies from game to game, but I found the PS5’s <em>Demon’s Souls</em> to be a great showcase for it. In that game, everything from the highs that ring out from swords clashing to daunting fire-breathing dragons that push out medium- and low-frequency sounds were a delight to hear. For a more relaxing experience, <em>Astro’s Playroom</em> and <em>Returnal</em> sound great, too. There are little sounds coming from everywhere, it seems. Games that don’t support 3D audio still sound good but are not quite as enthralling. </p><p id=\"GPcK8B\">For a $99 headset, the positional audio quality is better than I expected, as is the sound balance. There’s not an overwhelming amount of bass or tinny highs — everything is delivered delicately. I like that because it helps prevent fatigue during long play sessions.</p><div id=\"63qvPj\"><div data-anthem-component=\"productcard:10420564\"></div></div><p id=\"gb182h\">Sony claims 13 hours of wireless performance per charge. The headset actually landed between about 10 and 12 hours during my testing, which is an underwhelming result. Of course, this is less of an issue if you’re connecting it to a power source each time you stop gaming for the day.</p><div id=\"srEr31\">Here’s what the microphone on the Sony Pulse 3D sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408432/pulse3d.mp3\" type=\"audio/mp3\">  <p><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408432/pulse3d.mp3\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Here’s what the microphone on the Sony Pulse 3D sounds like</a>(opens a new window)</p></source></audio></div><hr class=\"p-entry-hr\" id=\"oeTf6a\"><h2 id=\"UW01so\">Best wired gaming headset: <a href=\"https://www.theverge.com/2020/9/16/21439699/bose-quiet-comfort-35-ii-noise-canceling-gaming-headset-pc-bluetooth-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Bose QC 35 II gaming headset</a> (<a href=\"https://www.amazon.com/dp/B08DVCNYJC?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$329</a>)</h2><p id=\"MPJACg\"><em>Compatible with any device with an available 3.5mm jack or via Bluetooth</em></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Bose quiet comfort 35 II gaming headset\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pciMgUYAGo-xYKzVk_U8Kf6fy80=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21885342/boseqc35iigame2.jpg\">      <cite>Image: Bose</cite>  </figure></div><p class=\"p--has-dropcap\" id=\"uWo9Sy\">Bose’s QC 35 II gaming headset offers the most features but at the highest cost of any other headset featured in this guide. Despite usually costing more than an Xbox Series S or Nintendo Switch, this set delivers on value. It comes with the QC 35 II wireless noise-canceling headphones that can be used on the go with Bluetooth and wired 3.5mm connectivity. There are no other options I’ve listed that have a noise cancellation feature and support for voice assistants like Alexa and Google Assistant. It’s also among the most comfortable, lightweight options on this list. You’ll know when the QC 35 II is on your head, but it doesn’t pinch or press hard against your ears.</p><p id=\"qRyE2r\">Used as a gaming headset, either connected via USB through its included desktop controller or via 3.5mm, the QC 35 II makes for a lightweight, comfortable option with a microphone attachment that’s easy to use. This model offers the best noise isolation (even without the battery-draining noise cancellation feature switched on) in any headset I’ve tested. Noise isolation is usually something most headsets fumble, but with this one, you’ll be able to better hear footsteps and other crucial noises that might decide the match. With noise cancellation switched on, it really does make everything around you very quiet — perfect for boosting the immersion in your games. The desktop controller I mentioned above adds more features, including a nice volume dial and button that adjusts the intensity of mic monitoring. </p><div id=\"ZtgrRG\"><div data-anthem-component=\"productcard:9568255\" data-anthem-component-data='{\"layout\":\"full_with_portrait_img\"}'></div></div><p id=\"s3ZNt7\">The $329 price is high, but if you value noise cancellation and want to have a headset you can easily take on the road (and that has ear cups that can swivel and fold into a compact size), check this out. It’s worth noting that current owners of the QC 35 II headphones, unfortunately, won’t be able to easily acquire the microphone attachment, as Bose isn’t selling it separately. </p><div id=\"b6Zsn5\">Here’s what the microphone on the Bose QC 35 II gaming headset sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408439/bose35.mp3\" type=\"audio/mp3\">  <p><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408439/bose35.mp3\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Here’s what the microphone on the Bose QC 35 II gaming headset sounds like</a>(opens a new window)</p></source></audio></div><hr class=\"p-entry-hr\" id=\"oHaXwr\"><h2 id=\"YUH1Gy\">The runner-up: <a href=\"https://www.theverge.com/2020/7/30/21345836/razer-blackshark-v2-x-budget-friendly-wired-gaming-headsets\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Razer BlackShark V2 + sound card</a> (<a href=\"https://www.amazon.com/Razer-BlackShark-Gaming-Headset-Detachable/dp/B086PKMZ1Q?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$100</a>)</h2><p id=\"U8pXiM\"><em>Compatible with any device with an available 3.5mm jack</em></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Razer BlackShark V2\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_xx8tXQweQhnns7y4ri_KSFBcyE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/20782512/blacksharkv2.jpg\">      <cite>Image: Razer</cite>  </figure></div><p class=\"p--has-dropcap\" id=\"Ejvb7t\">Razer’s updated BlackShark headset is my runner-up choice for a wired headset you can buy. It’s $100 (often available for less), yet it features a similar design and general feature set to Razer’s $200 wireless V2 Pro model. That also means it’s just as comfortable, with a plush headband and breathable ear cups that don’t apply too much pressure.</p><p id=\"AOPElj\">This model’s build materials are a step above the $59 BlackShark V2 X when it comes to being breathable, and it includes a USB sound card, into which the headset’s 3.5mm end plugs. With it, you’ll get slightly better sound quality. Also, using the sound card allows you to use THX spatial sound in Razer’s Synapse 3 software, which I found to be a nice value add but not particularly alluring in practice. Razer says it’s adding spatial audio profiles for popular games moving forward, so you’ll have plenty of ways to utilize the sound card if this feature strikes your interest. Regardless of your interest, you’ll also be able to plug the headset’s 3.5mm end into a variety of controllers and the Nintendo Switch.</p><div id=\"Gz2EXW\"><div data-anthem-component=\"productcard:9568257\" data-anthem-component-data='{\"layout\":\"full_with_portrait_img\"}'></div></div><p id=\"HgFwUw\">Something that stood out to me during testing is that finding a comfortable fit took almost no effort. And while many headsets are comfortable enough to wear for hours, I didn’t want to take the BlackShark V2 off my head. Another nice touch is its volume knob, which affords fine-tune adjustments that dials don’t usually provide.</p><div id=\"SMekMu\">Here’s what the microphone on the BlackShark V2 sounds like:<br><br><audio controls=\"\">  <source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408449/blacksharkv2.mp3\" type=\"audio/mp3\">  <p><a href=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/22408449/blacksharkv2.mp3\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Here’s what the microphone on the BlackShark V2 sounds like</a>(opens a new window)</p></source></audio></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/qsXMisLnR8etjnQozTiDjrka_X4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23016103/acastro_201109_4282_gamingHeadsets_0001_2021update.jpg",
  "description": "From brands like Epos, Logitech, Sony, and more",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}