{
  "title": "The latest Pixel 6 update turned notification vibrations way down",
  "url": "https://www.theverge.com/2022/3/25/22996788/google-pixel-6-pro-notification-vibration-weak-march-update",
  "date": "2022-03-25T22:05:55.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/B72aHrKqllmlAR-6eBn98sl6-aI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70673347/bfarsace_211014_4802_0012.0.jpg\" />        <figcaption>Photo by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"CZkIWe\">This <a href=\"https://www.theverge.com/2021/12/30/22860191/pixel-6-pro-google-december-feature-update-paused\">may sound familiar</a>, but there’s something wrong with <a href=\"https://www.theverge.com/2022/3/21/22989212/google-pixel-6-pro-march-software-update-delay\">the latest software update for Google’s Pixel 6 phones</a>. As Google tweaks the version of Android it distributes to phones running its custom Tensor chip, there have been some odd issues, but instead of <a href=\"https://www.theverge.com/2022/2/8/22923777/pixel-6-pro-february-update-wifi-bluetooth-bugs\">problems with Wi-Fi</a> or a slow thumbprint scanner, this time, it’s affecting another key feature: notifications. They still pop up on the phone just as regularly, but for some reason, the strength of the vibration is now significantly weaker than it was before.</p><div class=\"c-float-right\"><aside id=\"VZQ2aC\"><q>Adjusting the vibration settings has no effect</q></aside></div><p id=\"8uB0Li\">I’ve had my phone’s sounds set to silent for years, so any difference in the notification buzz is immediately an issue. It’s also noticeably softer for incoming calls, and some people have reported missing phone calls as a result. </p><p id=\"OFHOpj\">Adjusting the phone’s strength slider seems to have no effect, which suggests the problem is a bug rather than something intentional. A poster on Reddit pointed out that <a href=\"https://www.reddit.com/r/android_beta/comments/sqf2v7/the_new_vibration_intensity_for_notifications_on/\">people noticed the same thing during the Android 12.1 beta,</a> but it appears to have made its way into the production release without a response or adjustment. <a href=\"https://www.droid-life.com/2022/03/24/pixel-6-owners-notice-weaker-notification-haptics-after-march-update/\"><em>Droid-Life</em></a> noted that after a list of changes in the March Pixel update appeared on March 7th, Google added a line saying it includes “Fix for issue causing weaker haptic feedback in certain conditions” on March 8th.</p><p id=\"V6EMPm\">Why did Google change that, and was it intentional? I don’t know, and despite requesting more information, the company has not responded. Everyone I’ve talked to with a Pixel 6 has noticed the change in their phones, from friends to other <em>Verge </em>staffers, while <a href=\"https://twitter.com/charliebensaid/status/1506685994665455616?s=21\">a number</a> of posts <a href=\"https://www.reddit.com/r/GooglePixel/comments/tk4675/p6_vibration_weak_after_update/\">on social media sites</a> and comments suggest it’s affecting pretty much everyone with one of the devices.</p><p id=\"CexPrI\">At least a few folks have said they like the change, but if you’re not one of them, you may have to wait for another update or install another app that lets you adjust vibrations directly.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DksPoZM8Y5Hj8zSzgx6VkJRW-8s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22934832/bfarsace_211014_4802_0012.jpg",
  "description": "The whole point of notifications is to notice them.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}