{
  "title": "The Mac Studio is myth fulfillment",
  "url": "https://www.theverge.com/22974998/apple-xmac-myth-midrange-mid-tower-mac-studio",
  "date": "2022-03-13T13:00:00.000Z",
  "author": "Jason Snell",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WPLWxnPpfP1YB4B4a0vgNCRi47k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70615698/VRG_Photo_5083_magazine.0.jpg\" />        <figcaption><em>In 2008, Macworld devoted five pages to the kind of midtower Mac that Apple refused to make.</em> | <em>Photo by Jason Snell</em></figcaption>    </figure>  <p>The myth of xMac, the midrange Mac tower that never was</p> <p class=\"p--has-dropcap\" id=\"2xV9Fj\">Apple’s announcement of the Mac Studio on Tuesday may have <a href=\"https://www.theverge.com/2022/3/9/22968839/apple-mac-studio-display-m1-ultra-strategy-users\">fulfilled a dream</a> that some Mac users have been clinging to for a couple of decades. Finally, there’s a modular desktop Mac that’s more powerful than the Mac mini without carrying the Mac Pro’s high price tag.</p><p id=\"U3ddMM\">Back in the ‘90s and early 2000s, being a Mac nerd meant using a Power Mac. The arrival of the original iMac in 1998 was greeted with enthusiasm by Mac nerds because it meant that Steve Jobs might be able to restore Apple to greatness after it foundered in the mid-’90s—but none of them would ever stoop to using one themselves.</p><p id=\"ftDuKu\">When Jobs returned to Apple, he presided over a dramatic and necessary simplification of the product line. The desktop Power Mac, a go-to model for power users, <a href=\"https://everymac.com/systems/apple/powermac_g3/specs/powermac_g3_233_dt.html\">vanished in 1998</a>. The choices dwindled to the underpowered iMac (and later, the Mac mini) on one end, and the increasingly expensive Power Mac/Mac Pro tower on the other.</p><p id=\"V4ZqO4\">In between, at least for Mac power users, was a desert. And rising out of the desert was a glorious mirage: a mythical mid-range Mac minitower like the Power Macs of old. This legendary creature was known as the xMac.</p><h2 id=\"4gix5l\"><strong>Range anxiety for computers</strong></h2><p class=\"p--has-dropcap\" id=\"ogSiRa\">It’s hard to pinpoint exactly when and where grumblings about Apple’s lack of a mid-range Mac desktop started, but they’re at least 20 years old. A <a href=\"https://hypercritical.co/fatbits/2005/10/30/night-of-the-living-xmac\">2005<em> Ars Technica</em> post by John Siracusa</a> suggests it was coined in that site’s Mac forums in 2001 or earlier. </p><div class=\"c-float-right c-float-hang\"><aside id=\"OewyxZ\"><q>Funneled toward iMac or Power, users wanted more</q></aside></div><p id=\"gHQk53\">Regardless, the discontinuation of the desktop Power Mac seemed to create a community of Mac users who felt trapped between the iMac and the larger and more expensive Power Mac tower. They vented on Internet forums and in threads attached to stories about new Apple hardware.</p><p id=\"es8amK\">The introduction of the Mac mini in 2005 provided a clearer focus for the frustration. In his post, Siracusa rejected the Mac mini as too limited to be a proper alternative to an expensive Power Mac, and expressed his desire for an affordable modular Mac with configurable specs:</p><blockquote><p id=\"Xlrwlr\">Here’s what I want. Start with a choice of two possible CPUs: the very fastest single CPU Apple sells, and the second-fastest. In contemporary terms, these would both be dual core CPUs. The internal expansion buses should also be top-of-the-line, but with less capacity than the Power Mac.... The build-to-order options must span the entire range for each item that can be configured.</p><p id=\"vOxA8k\">Ladies and gentlemen, I give you the xMac. My xMac. The Mac that I want to buy. Reduced to one sentence, it’s a <em><strong>completely</strong></em><strong> configurable, headless Mac that trades expandability for reduced size and cost</strong>.</p><p id=\"7tcWw6\">[...] but I’d be happy with a compromise: a <s>completely configurable</s> headless Mac that trades expandability for reduced size and cost. Call it the <strong>Power Mac mini</strong>, make it cheaper and faster than at least one Power Mac model, and give the “deluxe” version the fastest available single CPU. That’d still cannibalize some Power Mac sales, but it’d also present an opportunity to up-sell iMac and (especially) Mac mini customers. It could still be a net win.</p></blockquote><p id=\"8pmfxq\">Siracusa was happy to trade away expandability, but for many users, it was impossible to detach the desire for the xMac with the desire for a modular PC-style Mac. In 2007, <em>Macworld</em>’s Dan Frakes wrote his own article <a href=\"https://www.macworld.com/article/186190/midrangemac.html\">dreaming about a mid-range desktop Mac</a>, and while he was very enthusiastic about the prospect, he also made this important point about the fallacy of the whole thing:</p><blockquote><p id=\"gepZm1\">The reality of the computer market is that the proportion of people who actually upgrade their computers beyond adding RAM is quite small. But at the same time, many of the people who will never upgrade their computers still think they’ll upgrade their computers—or at least want the security and comfort of knowing that they could.</p></blockquote><p id=\"shq1lS\">The truth hurts. Buyers of electric cars will prioritize range and charging networks despite <a href=\"https://nhts.ornl.gov/vehicle-trips\">the fact</a> that 95 percent of vehicle trips are 30 miles or less — and nearly 60 percent are less than six. Computer upgrade anxiety was a thing long before EV range anxiety existed.</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\"Power Macintosh G3 beige desktops, one a tower, one a pedestal computer, with big CRT monitors.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/S6SInv-hQkgF2pOga7OSBZNoe8Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23310444/Apple_199803_G3_moni.jpeg\">      <cite>Image: Apple</cite>      <figcaption><em>25 years ago, Apple built mid-size modular desktops for power users.</em></figcaption>  </figure></div><p id=\"m2kIrN\">Of course, the last two decades have almost entirely eliminated the concept of upgradeable tech, especially on Apple’s devices. What’s built into current Macs is what they’ll have—processor, memory, storage, and GPU—forever. Only the ultra-expensive Mac Pro offers upgradeability. (And how much of that will remain when it makes the transition to Apple silicon? Only Apple knows for sure, but <a href=\"https://www.theverge.com/22972996/apple-silicon-arm-double-size-mac-m1-pro-max-ultra-a15\">the evidence so far</a> suggests it will be little to nothing.)</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Haqk9bhFFwfSXYc374w1rf1gXJ8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23310450/return_of_the_clones.jpg\">      <cite>Photo by Jason Snell</cite>      <figcaption><em>Page one of Macworld’s five-page Hackintosh story.</em></figcaption>  </figure></div><p id=\"guRTHF\">So what’s an xMac fan to do? A lot of them tried building Hackintoshes, custom Intel PCs that used Apple-compatible parts, onto which macOS could be installed. In 2008, a company named Psystar <a href=\"https://www.macworld.com/article/190146/psystar.html\">tried to sell macOS-compatible minitowers</a>, directly to consumers, only to be <a href=\"https://www.engadget.com/2009-11-14-apple-wins-copyright-infringement-case-against-psystar-in-califo.html\">sued into oblivion</a> by Apple.</p><p id=\"2JWeTb\">That same year, <em>Macworld</em>’s Rob Griffiths <a href=\"https://www.macworld.com/article/190185/building_mac_clone.html\">explained</a> his building of a “Frankenmac” (a synonym for Hackintosh we used to avoid incurring Apple’s wrath) this way: “I don’t want or need a machine with a built-in monitor, I don’t need the power of an eight-core Mac Pro, but I’d like my Mac to be faster and more expandable than a mini.”</p><p id=\"n4JB4v\">That’s how badly Mac users yearned for something more. <em>Macworld </em>magazine devoted five physical pages to a story about buying a Psystar clone and building a Hackintosh, all in order to create a Mac that Apple refused to make.</p><p id=\"ejIaWr\">The Hackintosh community never really died; there are still <a href=\"https://www.youtube.com/watch?v=d5T8t5kNKgU\">YouTube tutorials</a> showing you how to make one. However, the Mac’s move away from Intel means that the Hackintosh era is going to be coming to a close in the next few years.</p><h2 id=\"tGyhz1\"><strong>2013 Mac Pro: Everybody loses</strong></h2><p class=\"p--has-dropcap\" id=\"qKXGIg\">In 2012, the devotees of the xMac got excited when Tim Cook replied to an email from an Apple customer named Franz by telling him that a <a href=\"https://www.macworld.com/article/218078/cook_apple_planning_professional_mac_for_2013.html\">new Mac Pro was due in late 2013</a>. The old Mac Pro was long in the tooth. Surely this was a chance for Apple to rethink the entire idea of a desktop Mac!</p><p id=\"3432Ci\"><em>Macworld</em>’s Frakes jumped on the story, providing an <a href=\"https://www.macworld.com/article/220501/the-time-is-finally-right-for-a-mac-minitower.html\">updated list of requests</a> for the xMac, citing the massive price gap between the Mac mini and the Mac Pro. Alas, Frakes found that the late 2013 Mac Pro <a href=\"https://www.macworld.com/article/222619/mac-pro-late-2013-review-apples-new-mac-pro-really-is-for-pros.html\">was still just for pros</a>. </p><div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DjwaTUScBUFL0RjHCw4kSdg4fJs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19397485/IB3C0192_1024.jpg\">      <cite>Photo by The Verge</cite>      <figcaption><em>The cylindrical Mac Pro from 2013. </em></figcaption>  </figure></div><p id=\"Dxy61S\">Not only did that Mac Pro not please the xMac crowd, it also lacked real internal expandability and had serious thermal problems, leading to a <a href=\"https://techcrunch.com/2017/04/06/transcript-phil-schiller-craig-federighi-and-john-ternus-on-the-state-of-apples-pro-macs/\">remarkable mea culpa</a> in which Apple promised to do better when it released the next version of the Mac Pro. That version <a href=\"https://www.theverge.com/2020/3/2/21161358/mac-pro-review-apple-display-xdr-adobe-hardware-software-price-video\">shipped in late 2019</a> and starts at $6,000.</p><h2 id=\"uQ5GoH\"><strong>The waste of a good screen</strong></h2><p class=\"p--has-dropcap\" id=\"e2XFWA\">For the last couple of decades, the iMac has been the product that straddles the divide between Mac mini and Mac Pro. And forced to buy <em>something</em>, an awful lot of the champions of the xMac have ended up buying iMacs. I’d argue that this ended up distorting the iMac, forcing it to <a href=\"https://www.macworld.com/article/621545/mac-studio-power-users-27-inch-imac.html\">support high-end chips and other features</a> that overcomplicated what was meant to be a friendly consumer all-in-one. The <a href=\"https://www.theverge.com/22440059/apple-imac-m1-2021-24-review\">M1 iMac</a>, with its simple design and bright colors, is a return to form.</p><p id=\"ztdLKZ\">And then there’s the waste of that perfectly good display, which has always nagged at many xMac proponents. Displays can last a very long time, and if you’re the type of person who upgrades your computer every two or three years, it means you’re tossing out a perfectly good screen. It just seems wasteful. (Apple briefly offered a feature called Target Display Mode, which allowed you to boot an iMac and use it as a dumb external display.)</p>  <figure class=\"e-image\">        <img alt=\"A user works on the Mac Studio Display.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EdjMQ3qI2Zhnw1Bur6aVpYG3CJ4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298812/lcimg_3cf0d7db_821f_4efb_8c69_29cbe61d1f1a.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>The Mac Studio and Studio Display — headless modularity once again.</em></figcaption>  </figure><p id=\"N6HVGH\">With the announcement not just of the Mac Studio but the new Studio Display—the company’s first new sub-$5,000 display in more than a decade!—Apple seems to have gotten this part of the message of the xMac philosophy. Yes, buying a Mac Studio and a separate display will cost a lot more than an iMac—but at least you can swap out the computer for a new one in a couple of years. And if you’ve already got a display handy, you’re already sitting pretty.</p><p id=\"DYoUYF\">Is it a big money saver? Possibly. Is it less wasteful? Yes, a bit. And it fills at least part of the requirements for being a proper xMac.</p><h2 id=\"oCTjwq\"><strong>Requiem for the xMac</strong></h2><p class=\"p--has-dropcap\" id=\"Pa9gWn\">A funny thing happened on the way to the xMac finally existing: The world moved along and left the dream behind. I asked 2005 xMac proponent John Siracusa about how he felt about the arrival of the Mac Studio. “Sixteen years is a long time,” he said. “If you have the same desire for long enough, the world will change and make your wishes moot.”</p><p id=\"tgxTyK\">Today’s Macs, bar the Intel-based Mac Pro, don’t have swappable banks of RAM or storage bays or card slots. Not even the Mac Studio has those. “The fact that we can’t upgrade RAM, we get a huge benefit for that,” Siracusa <a href=\"https://overcast.fm/+R7DWJClow/1:16:54\">said this past week on his podcast</a>. “Apple’s not doing it just to be mean. The memory is really, really fast... it makes the computers better.”</p><p id=\"0nZDB1\">It can be tough to let go of that computer-nerd desire to tinker with the internals of a computer, to accept that the benefits we get from a modern, integrated Mac might be worth the PC equivalent of range anxiety. It’s hard to fight human nature. </p><p id=\"yYJ16i\">But if you look past it, you see this: Apple’s now selling a computer that’s powerful enough to please “power users,” but doesn’t start at $6,000. It’s not that there <a href=\"https://sixcolors.com/post/2022/03/the-missing-mid-range-desktop-mac/\">aren’t still holes in the lineup</a> that might need to be filled by <a href=\"https://9to5mac.com/2022/03/09/exclusive-updated-mac-mini-to-have-versions-with-m2-and-m2-pro-chip/\">a more powerful Mac mini</a>, but the decades-long desire for power users to buy a desktop Mac in between the Mac mini and Mac Pro has finally fulfilled.</p><p class=\"c-end-para\" id=\"Vzv0yu\">Even ex-<em>Macworld</em> editor and xMac fan Rob Griffiths, who built that “Frankenmac” back in the day, bought a Mac Studio this week. That oasis in the Mac desktop desert? It’s not a mirage anymore.</p><p id=\"uuaXRw\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Nq_XoDDKg9ndjsFNItN2Xx7xTZk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23310393/VRG_Photo_5083_magazine.jpg",
  "description": "Two decades ago, an idea called \"xMac\" was born.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}