{
  "title": "The CDC is still trying to fix its data problem",
  "url": "https://www.theverge.com/2022/3/22/22990852/cdc-public-health-data-covid",
  "date": "2022-03-22T15:51:26.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"PCR Coronavirus Testing Site As U.S. Surpasses One Million Cases\" src=\"https://cdn.vox-cdn.com/thumbor/7RjDuYQRxNWkCRx09Qrf1fSWO6Q=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657136/1237552630.0.jpg\" />    </figure>  <p id=\"xpZDj5\">Two years into the COVID-19 pandemic, the Centers for Disease Control and Prevention is still trying to improve the way it collects and analyzes public health data, <a href=\"https://www.politico.com/news/2022/03/21/cdc-email-data-walensky-00018614\"><em>Politico</em> reported</a>. </p><p id=\"E74oOs\">A March 16th email reviewed by <em>Politico</em> from Dan Jernigan, the CDC’s deputy director for Public Health Science and Surveillance, mentioned the Data Modernization Initiative — a plan that would include integrating state and federal data systems and giving states funding to hire staffers to work with data. </p><p id=\"oAdJVX\">The COVID-19 pandemic highlighted the <a href=\"https://www.theverge.com/22633116/covid-data-us-vaccine-boosters\">stark limitations</a> of the US <a href=\"https://www.theverge.com/2021/8/16/22627004/public-health-data-gaps-fax-email-politico\">public health data</a> systems: information is siloed at individual hospitals and local health departments and often takes a winding path before it gets to the federal level. Labs couldn’t send information on cases straight from their own data systems to the CDC, relying on emails and faxes to pass along information. Some data-collection programs required manual entry. It took weeks and months for federal agencies to figure out answers to questions that other countries had the systems to answer in real-time. </p><p id=\"8XoKcd\">Jernigan <a href=\"https://www.politico.com/news/2022/03/21/cdc-email-data-walensky-00018614\">told <em>Politico</em></a><em> </em>that the CDC is spending $3 billion to help states hire and train new employees to work with public health data. The CDC’s renewed efforts come as the United States stares down yet <a href=\"https://www.cnbc.com/2022/03/20/health-experts-predict-uptick-in-us-covid-cases-due-to-new-bapoint2-variant.html\">another wave</a> of viral infection from COVID-19 variants. </p><p id=\"MNMAOM\">Improving public health data systems would help the agency more effectively monitor all public health threats, not just COVID-19. If the efforts are successful and properly funded, they could also leave the US in a better position for any future pandemics. </p><p id=\"8m5Kyp\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yaQkdiaorKy6OyPVWffzpYACar4=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23336796/1237552630.jpg",
  "description": "COVID-19 data has been a mess for two years.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}