{
  "title": "The Verge’s favorite gadgets for your car",
  "url": "https://www.theverge.com/23054969/car-auto-tech-gadgets-gear-favorite",
  "date": "2022-05-03T20:08:52.000Z",
  "author": "Verge Staff",
  "content": "      <figure>      <img alt=\"iOttie Wireless Car Charter\" src=\"https://cdn.vox-cdn.com/thumbor/lTUGodUlwMzUQRN436N5SXFWICI=/0x250:1500x1250/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70828449/car_holder.0.jpg\" />        <figcaption>Photo: iOttie</figcaption>    </figure>  <p id=\"5aZnzE\">Cars have become bastions of electronic gadgetry — but that doesn’t mean that we can’t add a few of our own. Some of us are simply not content with what came with our vehicles, some of us want to have emergency gear available just in case, and some of us have older cars that need help in order to be able to accommodate modern electronics. </p><p id=\"SmO05H\">Here are some of the gadgets that staffers at <em>The Verge</em> have used to upgrade their various vehicles.</p><h2 id=\"YyeSOp\"><a href=\"https://www.amazon.com/gp/product/B09G97XMKR?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Bluetooth Aux Receiver for Car</a></h2><p id=\"BHL3Sy\">I’m one of those boring people who has little interest in cars other than as a way to get from point A to point B. As a result, I tend to hold on to a vehicle until it costs more to keep it running than to buy something new. My current car is a 2007 Honda Civic, which, despite all the dings and dents it’s acquired over the years (mostly from being parked on the NYC streets) is still running well. The problem is that it lacks all the features that current cars offer: electronic locks, built-in touch screens — you know, anything digital.</p><p id=\"eOgPPm\">So if I want to listen to Google Maps directions or to my podcasts or music, I have to secure my smartphone to the dashboard using a car mount holder and connect it to the audio system via the car’s audio jack. However, since my recently purchased Pixel 6 doesn’t have a headphone jack (thank you, Google), and my car doesn’t have Bluetooth, I’ve had to find another way to make the connection.</p><p id=\"b0SJtH\">So I bought this receiver, which plugs into the audio jack in my car and then connects to my phone via Bluetooth. It’s a simple gadget from an unknown brand, but once I press the button to start the Bluetooth signal, it makes the connection immediately and lets me hear all the audio from my phone over the car’s speakers. It also holds a charge for a good long while; I haven’t scientifically gauged how long the charge lasts, but it’s been some time since I last powered the receiver up, and it hasn’t run out yet. <em>— Barbara Krasnoff, reviews editor</em></p><div id=\"a6JANn\"><div data-anthem-component=\"productcard:11174513\"></div></div><hr class=\"p-entry-hr\" id=\"fi6FbD\"><h2 id=\"NeaQAg\"><a href=\"https://www.amazon.com/gp/product/B074CW4QTQ/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;psc=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">3-in-1 retractable USB cable</a></h2><p id=\"LaYzNP\">I spent years trying to find the perfect USB cable that could support both an iPhone and an Android phone for charging in the car. (Anyone whose partner or spouse uses a different phone operating system than they do can probably relate.) While there are many cables out there with adapters that turn a Micro USB connection into Lightning or USB-C, those invariably fail after a few months of regular use.</p><p id=\"fT8mny\">But reader, I have found the solution, and it’s this retractable USB cable that has all three connections (Lightning, USB-C, and Micro USB) at the end of its plug — no adapters needed. It’s sturdy and solidly clicks into whatever phone I need it to, so I don’t have to deal with annoying adapters that are certainly going to fail. It also supports data connections for both CarPlay and Android Auto.</p><p id=\"WSc9bk\">Beyond that, the retractable design keeps the cable tidy — no longer do I have to deal with a gangly, too-long USB cable awkwardly draped across the center console. I can just pull the cable out, plug in my phone, retract the cable, and tuck my phone into the cubby near the USB port. If I’m taking a short trip and not plugging my phone in, the cable stays retracted and out of the way. You’d think that this feature would require a thin, flimsy cable that would break after just a few uses, but that’s not the case — the cable here is thick and flat and isn’t likely to break anytime soon. I’ve been using one of these retractable cables in both cars we own for nearly a year, and they work just as well as they did the day I got them. — <em>Dan Seifert, deputy editor</em></p><div id=\"KnJE4U\"><div data-anthem-component=\"productcard:11174555\"></div></div><hr class=\"p-entry-hr\" id=\"MkyTU6\"><h2 id=\"AqRZh4\">Breaker Bar </h2><p id=\"GoLW8R\">After my car broke down in college and a stranger emerged from the darkness with a shotgun and a declaration that he would protect me until the tow truck arrived, my mom bought me a breaker bar, which is like a wrench but much much longer. The idea was absolutely so I’d have something akin to a bat in my car in case I ever found myself in a similar situation, but even better, it gave me a great deal more torque for removing the nuts on my tires. Too often when you get your tires rotated or changed, they’ll use a ratchet gun to loosen and tighten the nuts, and they can often over-tighten them, which makes changing a tire on the side of the road absolutely miserable. A breaker bar absolutely helps. And according to at least one parent, it can also be used in case of other weird emergencies. <em>— Alex Cranz, managing editor</em></p><div id=\"re1y5i\"><div data-anthem-component=\"productcard:11174582\"></div></div><hr class=\"p-entry-hr\" id=\"f3WiLG\"><h2 id=\"htyQDv\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.crutchfield.com%2Fg_462350%2FApple-CarPlay-Compatible-Receivers.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23054969%2Fcar-auto-tech-gadgets-gear-favorite\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Apple CarPlay receiver</a></h2><p id=\"iLfoUw\">The biggest upgrade I’ve made to my car is adding a radio that supports CarPlay, letting me see directions and control music from a screen built into my dashboard (and ignore whatever terrible UI my car came stock with). My particular unit is a Sony XAV-AX100, which <a href=\"https://bestbuy.7tiv.net/c/482924/614286/10014?u=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fsony-6-4-android-auto-apple-carplay-in-dash-receiver-black%2F5664822.p%3FskuId%3D5664822&amp;sharedid=theverge.com\" rel=\"sponsored nofollow noopener\" target=\"_blank\">seems to be discontinued</a>. However, there are plenty of other <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.crutchfield.com%2Fg_462350%2FApple-CarPlay-Compatible-Receivers.html%3Ftp%3D72357%26fa%3D1%23%26avf%3DN%26nvpair%3DAG_Android_Control%257CFFAndroid_Auto&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23054969%2Fcar-auto-tech-gadgets-gear-favorite\" rel=\"sponsored nofollow noopener\" target=\"_blank\">options on Crutchfield</a>, the site I use to shop for car audio stuff because of its incredibly handy compatibility checker.</p><p id=\"74Dh52\">It took me several days to install the Sony into my Outback (exclusively thanks to the asinine way Subaru <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.crutchfield.com%2FS-DEWx7THnuxb%2Flearn%2F2005-2009-subaru-legacy-and-outback.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23054969%2Fcar-auto-tech-gadgets-gear-favorite\" rel=\"sponsored nofollow noopener\" target=\"_blank\">has the AC controls hooked up</a>, which I will die mad about), though there are plenty of shops around that could’ve done it for relatively cheap. If you decide to install a new head unit in your car, I’d recommend looking up a guide to see if it’s something you want to tackle yourself — but I’d say if you’re at all techie, it’s definitely worth getting CarPlay or Android Auto into your vehicle no matter how you go about it. Not having to fiddle around with a mount or charger is well worth the investment for me — so much so that, when we got a new car, I immediately started looking into replacing its radio, too. <em>— Mitchell Clark, news writer</em></p><hr class=\"p-entry-hr\" id=\"gOtfD0\"><h2 id=\"YsBg75\">A fast car charger</h2><p id=\"t5YSxL\">Whether you typically go on short or long car rides, it’s really nice to have a charger that can quickly recharge your gadgets. And for that, you’ll need a car charger that has a USB-C PD port <a href=\"https://www.amazon.com/SAMSUNG-Super-Charger-Ports-EP-L5300XBEGWW/dp/B089RD7F71/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">like this Samsung model</a> (though there is no shortage of other options on sites like Amazon). </p><p id=\"SbMi4C\">It features a USB-C PD port that can quickly recharge a device with up to an impressive 45W of power, if required. The one that I’ve been using in our car can quickly recharge my Pixel 6 while it’s supplying navigation via Google Maps, or keep my Nintendo Switch topped up. The device can even recharge my MacBook Pro as it sleeps (or keep the battery from free-falling while in use). It also has a USB-A port with support for an additional 15W recharging, totaling 60W from this particular model. — <em>Cameron Faulkner, reviewer</em></p><div id=\"SKZgqX\"><div data-anthem-component=\"productcard:11174615\"></div></div><hr class=\"p-entry-hr\" id=\"OQrrs9\"><h2 id=\"title\">iOttie Wireless Car Charger</h2><p id=\"1F6CVD\">Maybe someday Apple will realize that it wasn’t the brightest idea <a href=\"https://www.theverge.com/2021/8/18/22629703/apple-magsafe-charging-mfi-standard-accessory\">to artificially limit the reach of its MagSafe charging ecosystem</a> and you’ll be able to plop your phone on a magical minimalist disc that charges it at high speeds. In the meanwhile, a standard Qi charger is about the best you’ll get — and the bulky but practical <a href=\"https://www.amazon.com/iOttie-Wireless-Charging-Dashboard-Smartphones/dp/B07X4YDKTF?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">iOttie Easy One Touch Qi</a> does it with the satisfying snap of springs. When you push your phone into its waiting jaws, it depresses a button that causes those jaws to firmly snap closed on either side of your device. When you want to remove it, you pinch a pair of levers with your finger and thumb to release as you grab your slab. It’s wide enough to fit practically anything on the market, save an opened Samsung Z Fold. I’ve used one for years with Android and Apple phones alike, including newer MagSafe handsets. <em>— Sean Hollister, senior reports editor</em></p><div id=\"FjTfyG\"><div data-anthem-component=\"productcard:11174640\"></div></div><hr class=\"p-entry-hr\" id=\"6lMYCQ\"><h2 id=\"gnLGOo\"><a href=\"https://www.raspberrypi.com/\">Raspberry Pi</a></h2><p id=\"tuAoLY\">Thanks to increased emissions standards, it’s very common to find turbochargers on almost all new vehicles (at least the ones that still have internal combustion engines). No replacement for displacement, sure, but the lovely thing about turbos is how easily you can modify them to increase engine power and even improve fuel economy. Turbochargers work by reusing exhaust gasses to compress air going into the engine, allowing for more power. (It’s a bit more complicated than that, but I’ll spare you the details.)</p><p id=\"bzRwpA\">But what does this have to do with car gadgets? My favorite gadget is a Raspberry Pi running custom software from <a href=\"https://www.protuningfreaks.com/\">Pro Tuning Freaks</a>, which allows me to adjust my car’s ECU (engine control unit) from my iPhone — everything from the amount of boost pressure my turbo builds to adjusting engine timing when I can’t find 93 octane fuel. A Raspberry Pi, paired with a special OBD-II-to-ethernet cable and a <a href=\"https://buy-tuning-files.com/chiptuning/all-you-need-to-know-before-buying-tuning-files/#:~:text=When%20explained%20in%20the%20simplest,how%20your%20car's%20ECU%20runs.\">tune file</a>, can literally add 50 to 60 horsepower with the click of a button. If you don’t care about cars, this will leave you asking, why? If you do, well, I certainly think it’s worth it. </p><p id=\"SWgYYB\">Some explanations: the tune is the software that the car reads and which makes changes to engine timing, throttle response, boost pressure, etc. The Raspberry Pi is essentially a dongle allowing my iPhone (or Android device) to talk directly with the car wirelessly. You need to purchase a tune, but you do not absolutely need the Raspberry Pi. You can install the tune by connecting a laptop directly to your car. </p><p id=\"tbDhpX\">Pro Tuning Freaks will sell you <a href=\"https://www.protuningfreaks.com/collections/bootmod3-menu/products/bootmod3-obd-agent-device-beta-all-f-series\">a hardware kit</a> for $149 (when it is available — when this was being written, it was out of stock due to the microchip shortage) but will also <a href=\"https://bootmod3.atlassian.net/wiki/spaces/BCS/pages/363631/bootmod3+WiFi+Adapter+OBD+Agent+Hardware+-+Firmware+Update\">provide the software</a> separately (with a guide) so you can make it yourself. It requires zero coding: you basically drop the appropriate tune file (which you buy separately) onto a microSD, pop it in the Pi, and you’re good to go. Once logged in using the bootmod3 app on your iPhone or Android, you have access to your “tunes.”</p><p id=\"peB7G6\">Pro Tuning Freaks sells “<a href=\"https://www.protuningfreaks.com/collections/bootmod3-menu\">off-the-shelf maps</a>,” or tunes that have been tested firsthand, starting from around $500. Some tunes require no additional modifications, while others require hardware changes to allow for increased airflow (upgraded exhaust, cooling, etc). Engine tuning is not a new concept (and there are hundreds of other companies that make great tunes for various engines) but having access to vital vehicle information and the ability to make ECU changes from the palm of your hand is certainly a welcome change for the aftermarket car community.  <em>— Phil Esposito, supervising producer, tech</em></p><div id=\"kCWjaJ\"><div data-anthem-component=\"productcard:11175028\"></div></div><hr class=\"p-entry-hr\" id=\"h9Cyqs\"><h2 id=\"q5xqE1\"><a href=\"https://www.amazon.com/gp/product/B00080QHMM?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Accutire digital tire pressure gauge</a></h2><p id=\"wPUzaj\">I live in a state that is known for poorly maintained potholes, and so I’ve had more than my fair share of tire-related issues. There’s not much worse than that sinking feeling when you accidentally hit a pothole so big you can probably fit three Jimmy Hoffas in it and start hearing the beep of your tire pressure monitoring system as your car begins pulling to one side. After many flats and bent or cracked wheels, I’ve become a hawk for keeping up my car’s tire pressure. So I bought one of the handiest tools that I’ve been using for years now: a digital air pressure gauge. This Accutire gauge is about as simple as they come, and it instantly reads your tire’s pressure down to one-tenth of a PSI. Couple that with <a href=\"https://www.amazon.com/AstroAI-Portable-Compressor-Inflator-Motorcycle/dp/B07QR4Q42L?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">an inflator that runs off your car’s auxiliary power outlet</a>, and you can easily keep your tires topped off — which is safer in general, and with some luck, may help your wheels and tires survive that next pothole.  <em>— Antonio G. Di Benedetto, commerce writer</em></p><div id=\"MKW4co\"><div data-anthem-component=\"productcard:11175071\"></div></div><p id=\"2WoNrB\"></p><p id=\"eNnfyD\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/skEeb5wIO7VI0j-loKjdVbzEkUM=/0x358:1500x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23435073/car_holder.jpg",
  "description": "Gear to help you upgrade your ride.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}