{
  "title": "The Verge’s favorite gear for outdoor fun",
  "url": "https://www.theverge.com/23021823/summer-hiking-scooter-biking-gear-favorites",
  "date": "2022-04-14T13:00:00.000Z",
  "author": "Verge Staff",
  "content": "      <figure>      <img alt=\"It’s time to prepare for a summer outdoors.\" src=\"https://cdn.vox-cdn.com/thumbor/3SpoiSVrIzubyTDsTBMktM8kh7w=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70748053/vpavic_160816_1188_0035.0.0.jpg\" />        <figcaption><em>It’s time to prepare for a summer outdoors.</em></figcaption>    </figure>  <p id=\"UPrl51\">Sumer is icumen in — or, in other words (and if you’re not Chaucer), “Get ready, summer’s around the corner!” Especially if you’ve been cooped up all winter watching the COVID stats and waiting for a chance to get outdoors, now’s the time to get ready to see the sky.</p><p id=\"sqQXzu\">We asked the staff of <em>The Verge</em> to tell us about their favorite gear to help them enjoy the outdoors, whether it was on a bike, on a scooter, hiking, camping, or just hanging out and watching the world go by. Here’s what they reported.</p><h2 id=\"ktQ8Z2\"><a href=\"https://www.amazon.com/PETZL-ACTIK-CORE-Headlamp/dp/B07W7CTBGT?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Petzl Actik Core</a> headlamp</h2><p id=\"oQ2Wvh\">Weighing in at 2.65 ounces, the Petzl Actik Core is <em>not</em> <a href=\"https://www.litesmith.com/nitecore-nu25-triple-output-usb-rechargeable-headlamp/\">an ultra-light headlamp</a>, but it makes up for that fact by being really bright — using two LEDs, it can pump out up to 450 lumens, which can really help if you’re trying to navigate treacherous terrain at night (or if you’re a complete weenie about being in nature in the dark, like me). It also has a red light, so you’re not <em>that</em> person tramping into camp at midnight and waking everyone up or disturbing the bats while caving. </p><p id=\"r1JpVJ\">Its biggest feature in my eyes, though, is that you can use it with multiple power sources. It comes with the “Core,” a removable and rechargeable battery. (There’s a microUSB plug right on the battery — yes, I wish it was USB-C, but I have to carry a microUSB cable anyway for my <a href=\"https://www.theverge.com/22777116/holiday-gifts-wishes-favorite-expensive\">original InReach Mini</a>.) It can also take AAAs, which lets you easily carry a backup in case your rechargeable dies in the middle of a night hike. If your headlamp does go dark, though, it won’t come as a surprise; the Actik Core flashes its beam repeatedly to let you know it’s running low on juice. <em>— Mitchell Clark, news writer</em></p><div id=\"lK2vDH\"><div data-anthem-component=\"productcard:11140362\"></div></div><hr class=\"p-entry-hr\" id=\"q0L2bI\"><h2 id=\"P14xQL\"><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=0f9b0f6f-13ac-4498-8e0f-b3beae765e07&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F147514%2Fblack-diamond-trail-ergo-cork-trekking-poles-pair&amp;ctc=VergeFavoriteGear041322\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Black Diamond Trail Ergo Cork</a> trekking poles</h2><p id=\"zVhZit\">The Black Diamond Trail Ergo Cork trekking poles are, to me, basically the perfect set of hiking sticks. They’re not too heavy despite being aluminum, the latch locks have never failed me over hundreds of miles, and (as the name implies) the handles are incredibly comfy, even after hours of hiking in rugged terrain. I’ve used poles with twist locks or plastic handles before, and in my mind, they just can’t compare. While the Trail Ergo Corks are a bit spendy, I don’t regret a single penny I spent on them.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Cork is apparently a yummy snack to nighttime critters.  \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tXsK8eKc9Ibqbdo5BZ1G9G_o0g8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23387124/mclark_220405_5140_0001.jpg\">      <cite>Photo by Mitchell Clark / The Verge</cite>      <figcaption><em>Cork is apparently a yummy snack to nighttime critters.</em>  </figcaption>  </figure></div><p id=\"iq5FoT\">One word of warning about the cork handles, though: my tent (the <a href=\"https://www.tarptent.com/product/protrail/\">Tarptent ProTrail</a>, another piece of kit I’d highly recommend) uses trekking poles instead of traditional poles to get set up. For some strange reason, the default configuration puts the handles of the poles on the ground instead of the tips. One morning I found that some sort of creature — probably a chipmunk, but in my mind, it was a grizzly — had chewed up the cork on one of my poles. So if you go backpacking with a pair of Trail Ergo Corks, it might be best to not leave them lying around overnight. The creatures of the woods crave that delicious salt from your hands. — <em>Mitchell Clark, news writer</em></p><div id=\"45ODtw\"><div data-anthem-component=\"productcard:11140418\"></div></div><h2 id=\"tEYsg5\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.camelbak.com%2Frecreation%2Fshop%2Fpacks%2Fbike%2Fchase-bike-vest-50-oz%2FCB-2414.html%3Fdwvar_CB-2414_color%3DAtlantic%2520Teal%252FBlack&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23021823%2Fsummer-hiking-scooter-biking-gear-favorites\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Camelbak Chase</a> bike vest</h2><p id=\"tyy5UB\">Two years of social distancing have turned me into a bit of an outdoorsman. Nine months ago, I bought a <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.camelbak.com%2Frecreation%2Fshop%2Fpacks%2Fbike%2Fchase-bike-vest-50-oz%2FCB-2414.html%3Fdwvar_CB-2414_color%3DAtlantic%2520Teal%252FBlack&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23021823%2Fsummer-hiking-scooter-biking-gear-favorites\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Camelbak Chase</a> bike vest to accompany me on trail runs, mountain bike rides, hikes, and to the gym. The tiny pack was a big purchase for me, as it would be replacing the trusty Camelbak I’ve been using for over twenty years — I couldn’t be more pleased. Chase is breathable and extremely comfortable to wear in all climates, even when fitted with its removable 1.5-liter (50-oz) water reservoir. A big pocket up front makes accessing my phone super easy, while the smaller pockets make for quick access to fuel gels, snacks, and keys. Cargo capacity is small at 2.5 liters (150 cubic inches), and its $100 price tag is steep, but if you’re looking for a lightweight pack that won’t bounce around during outdoor pursuits, then look no further than the Camelbak Chase. — <em>Thomas Ricker, deputy editor</em></p><div id=\"ixdAUT\"><div data-anthem-component=\"productcard:11140820\"></div></div><hr class=\"p-entry-hr\" id=\"TBga8Z\"><h2 id=\"XnszKn\"><a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.garmin.com/en-US/c/sports-fitness/multisport-smartwatches/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Garmin Fenix</a> sports watches</h2><p id=\"jhofAa\">If you’re an outdoor athlete obsessed with tracking performance, then there’s simply no better multisport watchmaker than Garmin. I’ve relied upon an indestructible <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.garmin.com/en-US/p/641449\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Fenix 6</a> to map my kite surfing sessions, optimize my stride cadence while running, find my way home on unfamiliar forest trails, measure the grit and flow of my mountain biking (and call for help when I crash), and track my overall fitness levels over time using detailed charts and graphs. I was so impressed by this watch that I took up golf just to see how well it tracks each shot (nicely, for anything but putting and pitching) while also doing a fine job of helping me to keep score and choose the next club. </p><p id=\"WutaZv\">And those are just a few of the dozens upon dozens of activities that Fenix watches — including the new <a href=\"https://www.theverge.com/22934516/garmin-epix-2-review\">Epix 2</a> (which I adore) and <a href=\"https://www.theverge.com/22937154/garmin-fenix-7s-review-fitness-tracker-smartwatch\">Fenix 7 series</a> — can track straight out of the box for a week or more before needing to be charged. They’re not cheap, but if the pandemic taught me one thing, it’s that I can’t afford to ignore my health. — <em>Thomas Ricker, deputy editor</em></p><div id=\"kL62p2\"><div data-anthem-component=\"productcard:11102682\"></div></div><hr class=\"p-entry-hr\" id=\"WqLQ2l\"><h2 id=\"e5ofjH\"><a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeFavoriteOutdoorGear041322/https://www.nike.com/t/dri-fit-aerobill-featherlight-perforated-running-cap-h1mV7m/DC3598-010\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Nike Dri-FIT Aerobill Featherlight</a> cap</h2><p id=\"WOqRWZ\">I’ve accepted that some people will never wear SPF 50 sunscreen every day of the year, but protecting your skin from the sun is important, especially if you’re outdoors a lot. I’ll run outside so long as it’s between 25-90 degrees Fahrenheit — and at either end of that range, my Nike Dri-FIT Aerobill Featherlight running cap comes in clutch. </p><p id=\"oNbWOO\">In the summer, it protects my face from the sun, and the perforations help me stay cool. It’s also great for wicking sweat away from my brow and keeping my hair off my neck. On blustery winter days, I stick a headband over it and boom: warm ears and protection from the wind. It’s also lightweight enough that I’ll wear it on errands, hiking, to the beach or just walking around. Most recently, I wore it while I ran the NYC Half Marathon. But the best thing about a running hat is I don’t get distracted by environmental annoyances. I can just enjoy my run. — <em>Victoria Song, reviewer</em></p><div id=\"j1PcUJ\"><div data-anthem-component=\"productcard:11140970\"></div></div><hr class=\"p-entry-hr\" id=\"KK4XlM\"><h2 id=\"e4A6ce\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.chromeindustries.com%2Fproduct%2Fcitizen-messenger-bag%2FBG-002.html%3Fdwvar_BG-002_color%3DBK%26dwvar_BG-002_size%3DNA%26cgid%3Dview_all_bags&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23021823%2Fsummer-hiking-scooter-biking-gear-favorites\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Chrome Citizen Night Messenger Bag</a> / <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.jbl.com%2Fbluetooth-speakers%2FJBL%2BCLIP%2B3.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23021823%2Fsummer-hiking-scooter-biking-gear-favorites\" rel=\"sponsored nofollow noopener\" target=\"_blank\">JBL Clip 3</a> portable speaker</h2><p id=\"XezDAq\">My favorite summer look is a Chrome Citizen Night Messenger bag with a JBL Clip 3 speaker on the shoulder hook. The speaker perfectly clicks onto the hook of the backpack and sits at right about shoulder height, ensuring I can hear my music clearly without it blasting for every last Brooklynite to hear. Although I would not recommend this backpack for everyday use — when standing upright, the weight on the bag can sit a bit heavy for just one shoulder — it is incredibly comfortable to bike with. And that is why it’s a summer look! Catch me whippin’ down Brooklyn streets jamming every sunny day in this set-up. <em>— Becca Farsace, senior director</em></p><div id=\"r6n1Sn\"><div data-anthem-component=\"productcard:11141000\"></div></div><div id=\"CvUVFg\"><div data-anthem-component=\"productcard:11141038\"></div></div><hr class=\"p-entry-hr\" id=\"b9rdW3\"><h2 id=\"yuF3G6\"><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=0f9b0f6f-13ac-4498-8e0f-b3beae765e07&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F140110%2Fgarmin-inreach-mini&amp;ctc=VergeFavoriteGear041322\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Garmin inReach Mini</a> satellite communicator</h2><p id=\"zKgoAc\">As someone who has seen his fair share of incidents in the backcountry of the Pacific Northwest due to my involvement with search and rescue, I’ve never been one to balk at overcompensating for safety in the outdoors. That’s why I started carrying Garmin’s rugged inReach Mini a few years back for some added peace of mind for me, my partner, and pretty much everyone I know.</p><p id=\"8NQgi0\">The inReach Mini is pretty barebones as far as two-way satellite communicators go. The small, 3.5-ounce device relies on the Iridium satellite network and allows you to send and receive text messages when you’re out of cellphone range, giving you a quick way to communicate with an email address, a phone number, or another inReach via the device itself or through an accompanying mobile app. You can also use it to trigger an SOS beacon, which will alert a 24/7 monitoring center, notify preset contacts, and contact emergency responders in your area. Thankfully, I’ve never had to use the latter function, but it’s nice to know it’s there should I break my leg or find myself wandering the Cascades aimlessly.</p><p id=\"OFJ0T8\">Beyond that, however, the inReach Mini is pretty limited. Depending on which subscription you opt for, you can also use it to check the weather forecast in your area — something incredibly handy when you plan on sleeping outside — and to track and share your progress online, which allows others to keep tabs on your trek by monitoring Garmin’s web interface. The newer Mini 2 touts a few incremental upgrades, including a USB-C port and longer battery life, but the bulk of the functionality remains unchanged. <em>— Brandon Widder, senior editor, commerce</em></p><div id=\"9c8pQ0\"><div data-anthem-component=\"productcard:10861275\"></div></div><hr class=\"p-entry-hr\" id=\"bxy8Qg\"><h2 id=\"E4x0tX\"><a href=\"https://www.amazon.com/Vapur-Element-Foldable-Flexible-Carabiner/dp/B00BI9AM14?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Vapur Solid Flexible Water Bottle</a></h2><p id=\"5DDwmt\">I drink a lot of water. My daily goal is to drink one gallon or more, and I do often succeed in this task. Now, that’s not so hard when I’m home all the time, but it’s much more challenging when I’m out and about. While I own many water bottles, there’s only one I really prefer most of all for traveling or taking outdoors on an adventure — the Vapur collapsible bottle. It’s basically a flexible bladder with a removable cap and carabiner, and once you’ve drunk all your water, you can roll / fold it up and tuck it away. I’ve brought this water bottle on many outdoor hikes and both domestic and international travel, and it’s been a lifesaver as well as a space-saver for me. It’s just so easy to head out with some water in tow, drink it, roll it up, and tuck it away in a bag or even a pocket until there’s a chance to refill. You can even clip it to your bag strap or a belt loop once it’s filled up, so it can go with you just about anywhere and not take up too much space or add much weight to your load.</p><p id=\"5JwZ4D\">Sure, it’s a little awkward to drink from at first, and you may get the occasional odd look when someone thinks you’re drinking from a plastic bag, but you get used to both aspects over time. If you have to keep yourself very hydrated, even when you have to pack light and small, the Vapur is a helpful little ally to have in your corner (or the tiny pocket of your camera bag or purse). — <em>Antonio G. Di Benedetto, writer, commerce</em></p><div id=\"NWirFQ\"><div data-anthem-component=\"productcard:11142062\"></div></div><hr class=\"p-entry-hr\" id=\"QMtBCg\"><h2 id=\"TrW5gb\"><a href=\"https://uscooters.com/products/uscooter-booster?variant=48077743567\">E-TWOW Uscooters Booster V-Powered</a> scooter</h2><p id=\"EiuIq7\">When I <a href=\"https://www.theverge.com/22923871/carvana-pandemic-used-car-prices-sold-online-chip-shortage\">sold my car to a robotic algorithm</a> for more than I paid brand new, I knew exactly how I’d get around town: the best lightweight electric scooter on the market. I unfold my E-TWOW Booster V and zip down the street in the bike lane, passing all but the fastest road bikes at 25 miles per hour. If I need to hop on the BART train to San Francisco, it folds down easy (including the handlebars) to fit right under the seats, and its 24-pound weight is plenty manageable when hauling it up and down escalators and staircases. </p><p id=\"nbDOZn\">I’ve been keeping my eyes out for the past five years, and nobody’s come up with a better all-around design than E-TWOW yet. Anything with more speed and range is usually <em>far</em> heavier, and the few scooters that come close (<a href=\"https://www.theverge.com/2022/4/4/23004667/google-unagi-electric-scooter-subscription-return-office\">like Unagi</a>) have comparatively terrible suspension. I’d never ride them on the road. But the hidden rear coil and front shock absorber of the E-TWOW are springy enough that I only feel the jolts at train crossings or actual debris in the road. Just don’t be lulled into a sense of long range by the neat regenerative braking feature — if you’re a moderately heavy rider like me, you’re not going to get anywhere near the quoted 24 miles on a charge.</p><p id=\"ikTNyb\">E-TWOW and its distributor, UScooters, also sell <a href=\"https://e-twow.com/e-twow-s2-gt-line-gt-se-gt-sl-gt-sport/\">a new longer-range model</a> with an extra handbrake, but it weighs more. — <em>Sean Hollister, senior reports editor</em></p><div id=\"92RBUQ\"><div data-anthem-component=\"productcard:11142093\"></div></div><hr class=\"p-entry-hr\" id=\"bweaij\"><h2 id=\"zvRxvG\"><a href=\"https://www.amazon.com/4Es-Novelty-Flamingo-Ornaments-Flamingos/dp/B07FCTJMPZ?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Pink Lawn Flamingos</a></h2><p id=\"lsie2u\">Several years ago, my partner and I went to a small trade show where the theme was Florida. We stayed until closing, chatting with friends, and as we were leaving, a staffer who was packing up the show’s decorations ran up to us and asked, rather desperately, “Could you use a pink flamingo?” It turned out that the many plastic pink flamingos that decorated the show floor had been bought (not rented) for the occasion, and now the organizers had no idea what to do with them, short of putting them out for the trash. So we took two of them home and stuck them in our tiny garden, and ever since, we’ve loved our retro lawn decorations. They keep us company when we’re sitting outside and help make up for my innate lack of talent with growing things. And they come in handy — whenever we want to direct somebody to our home, all we have to do is say, “Look for the house with two pink flamingos!” <em>— Barbara Krasnoff, reviews editor </em></p><div id=\"LDObtg\"><div data-anthem-component=\"productcard:11142118\"></div></div><hr class=\"p-entry-hr\" id=\"vCCJbf\"><p id=\"Dyj6KQ\"></p><p id=\"qcbXwY\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MDSb0YAWVaVt6RkVjCt-faJ6rkk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6978817/vpavic_160816_1188_0035.0.jpg",
  "description": "The best gear for a summer outdoors",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}