{
  "title": "The Nintendo Switch changed what I want from video games",
  "url": "https://www.theverge.com/2022/3/3/22958526/nintendo-switch-five-year-anniversary-console-gaming",
  "date": "2022-03-03T15:30:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LDWkbj6RFHW-Z5GnMj6Znsi7U4k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70574152/jbareham_180301_2346_nintendo_switch_0065_zelda.0.jpg\" />        <figcaption>Photo by James Bareham / The Verge</figcaption>    </figure>  <p id=\"eZd4bu\">For most of my life, there were two kinds of video games: those you played at home and those you played on a handheld. There was a clear distinction. Even when a powerful device came along, like the PlayStation Vita with its “console-quality” graphics, you could still pretty much always tell the difference; games had their own feel based on the platform. <em>Metroid</em> on the GameCube was very different from <em>Metroid</em> on the Game Boy Advance. But that all changed when the Nintendo Switch launched five years ago.</p><p id=\"knNfz6\">I stumbled upon the power of Nintendo’s tablet in a unique way. Back in 2017, I was tasked with reviewing <a href=\"https://www.theverge.com/2017/3/2/14787082/the-legend-of-zelda-breath-of-the-wild-review\"><em>The Legend of Zelda: Breath of the Wild</em></a>, a gigantic open-world game that upended the classic <em>Zelda</em> formula. I started out playing it in my living room, much like I had with past games in the series. It felt right. But then I had to cover the Game Developers Conference in San Francisco, which meant hours spent on airplanes, in hotel rooms, and waiting in long lines inside the Moscone Center. All of those moments were spent exploring Hyrule — and the fact that I was able to seamlessly pick up from where I started at home proved to be transformative. (In a personally surreal twist, the day I finished writing the review, <a href=\"https://www.theverge.com/2017/3/11/14881076/the-legend-of-zelda-breath-of-the-wild-nintendo-interview\">I was also able to spend an hour chatting with the game’s directors</a>.)</p><p id=\"3Z72Dl\">That’s obviously not a situation most people will find themselves in. But that just made the point even more clear: the Switch is a device designed to fit into your life, even if you have a really weird job like I do. In a world where games are more demanding of your time than ever, with daily quests and open worlds that can span hundreds of hours, this was a big deal. Immediately after <em>Breath of the Wild</em>, whenever I’d play a big game — <a href=\"https://www.theverge.com/2017/3/21/14985854/nintendo-switch-open-world-games-zelda-mass-effect-persona\">whether it was <em>Mass Effect</em> or <em>Persona</em></a> — I’d wish it was on the Switch. (Seriously though, how is it possible that <a href=\"https://www.theverge.com/2017/3/29/15098458/persona-5-review-ps4-ps3\"><em>Persona 5</em></a> hasn’t been ported yet?)</p><p id=\"TkP99H\">And I’m not the only one. Fans begging for Switch versions of their favorites has become a meme at this point, and the Switch version of <em>Fortnite</em> — <a href=\"https://www.theverge.com/2018/6/12/17454606/fortnite-nintendo-switch-ps4-block-accounts-cross-play-e3-2018\">which initially wasn’t compatible with the PS4 version</a> — helped usher in our current era where cross-platform play is an expected feature for big live-service titles because players got so mad.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/T22oTeCZcRI7322Fd_y3fbmQFD4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22873309/cfaulkner_210921_4751_0010.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>  </figure><p id=\"loBCny\">This is a long-winded way of saying that the freedom of the Switch has fundamentally changed how I view video games. That distinction between console and portable that defined my earliest memories with the medium no longer exists. Now when a game comes out, I think long and hard about <em>how</em> I’m going to play it. If it’s a live-service game like <em>Genshin Impact</em> or <em>Fortnite</em>, I want to know that I can take progress with me on the Switch or a smartphone. If it’s a lengthy role-playing game, I might just wait for a Switch version, even if the graphics take a hit. Much in the way my Netflix experience follows me around from device to device, I want my video games to do the same thing. I personally regret playing <a href=\"https://www.theverge.com/22915054/olliolli-world-review-switch-ps5-xbox-pc\">the excellent skateboarding game <em>OlliOlli World</em></a> on the PS5 since it’d be perfect for short sessions on the Switch.</p><p id=\"ag7kuP\">This desire to take video game worlds with me now extends beyond Nintendo hardware. There are cross-platform games that support mobile; Xbox games that work across PC, console, and the cloud; subscription services like Apple Arcade and Game Pass that work on multiple devices; and — most excitingly — a brand-new device in <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">the Steam Deck</a> that expands the concept to all of those unplayed games from my Steam library.</p><p id=\"cqsdYr\">All that said, as the lines between console and handheld have disappeared, we have lost something notable. <a href=\"https://www.theverge.com/21441254/nintendo-ds-3ds-discontinued-eulogy\">I felt it especially when the Nintendo 3DS was discontinued</a>: there’s something very particular about games designed around the limitations of a handheld device that now mostly doesn’t exist. The DS era was a creative zenith for Nintendo and its partners, with everything from <a href=\"https://www.theverge.com/2013/11/14/5103870/legend-of-zelda-a-link-between-worlds-gets-back-to-series-roots\">inventive takes on <em>Zelda</em></a> to wonderful touchscreen oddities like <em>Nintendogs</em> and <em>Electroplankton</em>. Switch title <a href=\"https://www.theverge.com/2021/10/6/22710468/metroid-dread-review-nintendo-switch\"><em>Metroid Dread</em></a> probably wouldn’t exist if it weren’t for its predecessor <a href=\"https://www.theverge.com/2017/9/12/16291350/metroid-samus-returns-review-nintendo-3ds\"><em>Samus Returns</em></a>. Thankfully, that spirit is still living on as something of a niche through products like the <a href=\"https://www.theverge.com/22831589/analogue-pocket-review\">Analogue Pocket</a> and <a href=\"https://www.theverge.com/22587172/playdate-hands-on-preview\">PlayDate</a>.</p><p id=\"69rfzS\">When it comes to playing games across devices, things are often still messy. Platform exclusives and annoying cross-progression restrictions mean you don’t always have that kind of freedom; things aren’t always as seamless as plucking a Switch from its dock and bringing a game with you. But thanks in part to the Switch, the last five years have seen a dramatic improvement in how accessible games can be across devices. I’m too embarrassed to tell you how many devices I have <em>Fortnite</em> installed on, but it’s <em>a lot</em>.</p><p id=\"Gz383j\">This has, in turn, improved my relationship with the game, much like having <em>BOTW</em> on the Switch did. The platform hasn’t just changed how I look at games — it’s made me appreciate them in a whole new way.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Z7wq3gDapU49UAtDrL_JqCAo9Rk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10329917/jbareham_180301_2346_nintendo_switch_0065_zelda.jpg",
  "description": "It all started with Breath of the Wild.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}