{
  "title": "The Lotus Eletre is an electric SUV with hints of hypercar",
  "url": "https://www.theverge.com/2022/3/29/23001370/lotus-eletre-electric-suv-type-132-specs-range",
  "date": "2022-03-29T19:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KVI9wIdBeK-XzX__KR4C8bEOYeI=/0x2:7952x5303/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70686207/04_Lotus_Eletre_Yellow_Studio_Profile.0.jpg\" />    </figure>  <p id=\"5APumo\">British sports car maker Lotus is jumping on the electric bandwagon with the reveal of the Eletre, a plug-in crossover SUV with design language inspired by <a href=\"https://www.theverge.com/2019/7/16/20696638/lotus-evija-hypercar-specs-price-photos\">the automaker’s Evija hypercar</a>. The Eletre will also be the first of three new EVs that Lotus plans to roll out over the next four years, including a sports car (natch), a coupe-sedan, and another SUV. </p><p id=\"puYxtV\">Previously called Type 132, the Eletre is the Geely-owned automaker’s second electric vehicle and will feature futuristic components like camera-only side-view mirrors and a lidar sensor affixed to the front and rear of the roof. </p><p id=\"vlOnzS\">As is befitting its sports car legacy, Lotus is emphasizing the performance capabilities of its new electric SUV. The Eletre will be able to sprint from 0-100km/h (0-62mph) in less than three seconds, with Lotus claiming a spot in the “exclusive ‘Two Second Club’” that also includes the Tesla Model S Plaid (under very specific conditions, mind you). </p><p id=\"9bjUeb\">But just because it can tear it up on the track doesn’t mean the Eletre isn’t built like an SUV. With all-wheel drive, the five-door EV will be fairly compact, but it will still pack a lot of power, including a battery capacity that’s over 100kWh, and 600 horsepower. </p><div class=\"c-float-right\"><aside id=\"PztUEt\"><q>But just because it can tear it up on the track doesn’t mean the Eletre isn’t built like an SUV</q></aside></div><p id=\"GijOEe\">Lotus says that a 350kW charger will deliver 400km (248 miles) of range in just 20 minutes. The car’s target maximum WLTP driving range is 600km (373 miles). It also comes with the ability as standard to accept 22kW AC charging, which, where available, reduces the time plugged in.</p><div id=\"E1OSFj\"><div data-anthem-component=\"gallery:11119245\"></div></div><p id=\"0gg5sw\">Design-wise, the Eletre features an aggressive, forward-leaning nose and a rakish, coupe-like roofline. Lotus’ designers are clearly pulling from their experience in building sleek sports cars. The proportions, though, are unmistakably SUV-like.</p><p id=\"a078eo\">Lotus boasts that the Eletre delivers a lot of “firsts” for the brand, including the first five-door production car, the first non-sports car model, the first lifestyle EV, and the most “connected” Lotus ever. It will also be the company’s first car to be built in China, where its parent company is based. </p><p id=\"1KRgAV\">The Eletre will be built on Lotus’ new Electric Premium Architecture, a low-to-the-ground “skateboard” design that’s flexible to accommodate different battery sizes, motors, component layouts, and “smart” driving technologies. For the Eletre, Lotus claims this will include “end-to-end autonomous driving technology” and over-the-air software update capabilities. The platform will be the basis for a range of premium performance EVs from Lotus.</p><div class=\"c-float-right\"><aside id=\"XDctB5\"><q>The Eletre will be built on on Lotus’new Electric Premium Architecture</q></aside></div><p id=\"6isucD\">By “end-to-end autonomous driving,” Lotus is really referring to self-parking capabilities. The company says that “a customer can use their smartphone app to request their Eletre to drive to them autonomously from a nearby parking space, and then autonomously repark once the journey is complete.” More advanced autonomous driving will be added later via OTA updates, the company says. The EV will have 5G connectivity as well. </p><p id=\"DhdVdG\">The Eletre will come with a range of alphabet-soup advanced driver assist features: Intelligent Adaptive Cruise Control (ACC); Collision Mitigation Support Front (CMSF); Traffic Sign Information (TSI); Door Open Warning (DOW); Rear Cross Traffic Alert (RCTA); Front Cross Traffic Alert (FCTA); Lane Change Assist (LCA); Children Presence Detection (CPD); Lane Keep Aid with Lane Departure Warning / Prevention (LKA+); Parking Emergency Brake (PEB); Collision Mitigation Support Rear (CMSR); and Emergency Rescue Call (E-Call). Still, the Eletre is likely to require driver supervision at all times. </p><p id=\"8BEUrY\">Geely bought a majority stake in Lotus in 2017, and over the last decade, the Chinese group has added everything from Volvo to an <a href=\"https://www.theverge.com/2017/11/13/16643342/volvo-geely-terrafugia-flying-car-acquisition\">electric vertical takeoff and landing company</a> to its portfolio. Even before the Eletre’s debut, the company had garnered something of a reputation for <a href=\"https://www.bloomberg.com/news/features/2018-05-24/volvo-is-better-than-ever-thanks-to-this-chinese-billionaire\">resuscitating stale brands</a>, like it did with Volvo or the <a href=\"https://www.theverge.com/2019/3/6/18252789/polestar-2-price-release-date-photos-geneva-motor-show-2019\">Swedish automaker’s Polestar brand</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5uzE4bNTsCGorZaRcpeKKxNQfFw=/0x571:7952x4734/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23352608/04_Lotus_Eletre_Yellow_Studio_Profile.jpg",
  "description": "The Eletre will feature lots of futuristic hardware.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}