{
  "title": "The Joe Rogan controversy is what happens when you put podcasts behind a wall  ",
  "url": "https://www.theverge.com/2022/2/1/22912275/joe-rogan-spotify-covid-misinformation-moderation-podcast-exclusive",
  "date": "2022-02-01T16:00:00.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/n49r1w9LrBls73P2xbrocDZSdO0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70457753/acastro_210824_4719_rogan_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge | Photo by Vivian Zink/NBCUniversal via Getty Images</figcaption>    </figure>  <p id=\"8iJ53G\"><em>This story originally ran in Hot Pod, The Verge’s preeminent audio industry newsletter. You can subscribe </em><a href=\"https://hotpodnews.com/subscribe/\"><em>here</em></a><em> for more scoops, analysis, and reporting.</em></p><p id=\"18DlkX\">Spotify didn’t discover Joe Rogan, and Joe Rogan didn’t create Spotify, but their union portends the future of a closed podcasting ecosystem. Up until September 2020, <em>The Joe Rogan Experience</em> was available through RSS feeds, YouTube, and podcast players. His content bubbled up every so often, but broadly, Rogan did his show, and the various distribution platforms let him do so without having to worry and monitor every episode — if it infringed on a policy, it could be removed, and so it went. This is the world in which Rogan stans and haters can find common ground.</p><p id=\"NzK0U7\">Rogan could have been “deplatformed” in the sense that his episodes be deleted from YouTube or removed from searches on podcast players, but interested listeners could still seek him out through RSS. Everyone would win, theoretically, unless you believe Rogan shouldn’t be published anywhere at any time. </p><div class=\"c-float-right\"><div id=\"s5ygPK\"><div data-anthem-component=\"aside:1522405\"></div></div></div><p id=\"K0di0p\">Take <em>Infowars</em> creator Alex Jones for example: Apple Podcasts delisted his show <a href=\"https://www.theverge.com/2018/8/6/17655168/alex-jones-infowars-apple-itunes-podcasts-removed\">for hate speech,</a> as did various other podcast apps, but anyone can still listen through an RSS feed. They have to seek it out — it doesn’t surface on hit charts or in searches and isn’t promoted in-app, but it benefits from the open podcast system and serves as a counterweight to any one platform controlling what people can and cannot hear. </p><p id=\"G9HDd2\">This has always been the promise of open RSS: even if one platform doesn’t like your content, you can still be heard. Still, podcasting is moving away from this world, meaning other platforms that are cheering on Spotify’s demise should take note of how it’s handling the situation. The backlash is coming for them, too, which is why <a href=\"https://www.wsj.com/articles/neil-young-pushes-amazon-music-to-fans-after-pulling-music-from-spotify-amid-joe-rogan-controversy-11643641915\">Amazon Music</a>, <a href=\"https://twitter.com/siriusxm/status/1486704650309058566?s=21\">SiriusXM</a>, and <a href=\"https://twitter.com/elgabrielgtz/status/1486858342421221378?s=21\">Apple Music</a> piggybacking off the current controversy to sell more subscriptions struck me as shortsighted. All three companies have a vested interest in the success of specific podcasts, whether it be exclusive to a platform or a<strong> </strong>subscription service. Just because Rogan is the target today doesn’t mean one of their shows won’t be tomorrow.</p><p id=\"ITY3g6\">Of course, business will business, and obviously, Amazon will try to <a href=\"https://www.wsj.com/articles/neil-young-pushes-amazon-music-to-fans-after-pulling-music-from-spotify-amid-joe-rogan-controversy-11643641915\">convert</a> some Neil Young listeners to its platform. But what happens if <em>SmartLess</em> or a Wondery show or <em>My Favorite Murder </em>take a turn for the worst? Amazon, which licenses or owns these shows and others, should have its strategy prepared. </p><p id=\"dkGJBn\">We’re moving away from a world in which a podcast player functions as a search engine and toward one in which they act as creators and publishers of that content. This means more backlash and room for questions like: why are you paying Rogan $100 million to distribute what many consider to be harmful information? Fair questions!</p><p id=\"laUmsM\">This is the cost of high-profile deals and attempts to expand podcasting’s revenue. Both creators and platforms are implicated in whatever content’s distributed, hosted, and sold, and both need to think clearly about how they’ll handle inevitable controversy.</p><div><aside id=\"885dvx\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/bCwqltstHA8afYFqiNffnG_h-eo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22803608/acastro_210824_4719_rogan_0001.jpg",
  "description": "A problem of Spotify’s own making",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}