{
  "title": "The Verge’s favorite audio gear for 2022",
  "url": "https://www.theverge.com/22929697/audio-gear-favorite-headphones-earbuds-speakers",
  "date": "2022-02-15T16:00:22.000Z",
  "author": "Verge Staff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Z9aZ9j8jjByMeAm8idD05g5wnUQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70511476/adiaconis_201202_4322_0003.0.0.jpg\" />        <figcaption>Photo by Alix Diaconis / The Verge</figcaption>    </figure>  <p id=\"yE78TA\">It’s been about a year since we first asked the staff of <em>The Verge</em> to <a href=\"https://www.theverge.com/22297466/audio-gear-headphones-earbuds-speakers-mics\">tell us about some of their favorite audio gear</a>. As we said in last year’s piece, the people here spend a lot of time listening to a variety of music, podcasts, and other interesting sounds — and that hasn’t changed. Many of us have used music to get through the ups and downs of the past year, and our audio devices have made it possible not only to lose ourselves in our tunes but to communicate with remote friends and relatives and to get work done via Zoom, Slack, and other apps. </p><p id=\"T6Izdu\">But that isn’t to say that we have the same tastes in music or tech. <em>The Verge</em> is an assembly of distinct personalities, and our tastes in music — and the tech we use to listen to that music — is distinct as well.</p><p id=\"j8nVdS\">So here is this year’s rundown of our favorite audio gear. </p><h2 id=\"ejrM03\"><a href=\"https://www.amazon.com/Headphones-Yinyoo-Resolution-Comfortable-nomic/dp/B07D3QGXKQ?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">KZ ES4 earbuds</a></h2><p id=\"aJlAEh\">The KZ ES4s — and KZ’s headphones in general — are often praised because they sound very good and are very inexpensive. And I’ve found that to be true — I think the ES4s have a very pleasing sound for the type of music I listen to, and they’re comfortable to have in for extended periods of time. But if I’m honest with myself, the main thing standing between me and enjoying music isn’t sound quality (unless I’m using absolutely bottom-of-the-barrel equipment) — it’s the amount of attention I’m actually giving the music. If I’m just sitting and listening to music and not scrolling Twitter or working, I can enjoy my favorite songs almost just as much through a half cat-chewed pair of EarPods as I can through expensive headphones.</p><p id=\"gXxrbC\">That’s why I like keeping <a href=\"https://www.theverge.com/2021/7/4/22561092/apple-bring-back-ipods-2021-music-services\">an iPod</a> around. Yeah, I’ve got it loaded up with lossless files from Bandcamp, but the best thing about it is that it can’t do anything but play music. It reminds me to put my phone away, close my laptop, and treat music as a thing to do, rather than just something that plays in the background. And for that, $19 headphones are more than enough. <em>— Mitchell Clark, news writer</em></p><div id=\"mx14Q0\"><div data-anthem-component=\"productcard:11024687\"></div></div><hr class=\"p-entry-hr\" id=\"ySBqJ5\"><h2 id=\"vmMkqu\"><a href=\"https://www.theverge.com/22351451/bose-frames-tempo-audio-sunglasses-review-features\">Bose Frames - Tempo</a> </h2><p id=\"xQiOeV\">I know how I look wearing these, but hear me out: running was never meant to be a stylish sport. I’ve tested a lot of fitness earbuds, many of which promise excellent ambient modes but then utterly fail to deliver. That’s important because the last thing I want when training for a race is to get flattened by an errant driver or a kid zipping by on a scooter. I tried AfterShokz’s bone conduction headphones, but they just don’t deliver the thumping bass I need to stay pumped during my long runs. The Tempo sound good for open-ear headphones, let me stay attuned to my surroundings, <em>and</em> help me see better on really sunny days. And I don’t have to worry about chasing after earbuds that fall out mid-run. I’ll admit it’s a really specific use case for a $250 pair of ugly audio sunglasses, but it’s been a game-changer for me. <em>— Victoria Song, reviewer</em></p><div id=\"7ycj0Z\"><div data-anthem-component=\"productcard:11024704\"></div></div><hr class=\"p-entry-hr\" id=\"jFBErX\"><h2 id=\"aQGomh\"><a href=\"https://www.theverge.com/2019/11/1/20942472/apple-airpods-pro-review-design-price-specs-features-noise-cancellation\">AirPods Pro</a></h2><p id=\"qaPsR9\">I am an AirPods super stan. They connect easily to my Apple devices (and my Nintendo Switch), have a pretty great battery life, are simple to charge in their case, and are usually quite comfortable (though my Pros have a bad habit of falling out if I’m talking or eating). I use them all day at work, when out and about on walks and runs, and while doing chores around the house.</p><p id=\"JbTRw9\">Most importantly, <em>they’re just so dang convenient, and I hardly have to think about them</em>, which is why I haven’t seriously considered another type of headphones since I got the first generation of AirPods right after they launched. <em>— Jay Peters, news writer</em></p><div id=\"E1HSyI\"><div data-anthem-component=\"productcard:11027899\"></div></div><hr class=\"p-entry-hr\" id=\"A7t8Pl\"><h2 id=\"9kxdQw\"><a href=\"https://gradolabs.com/headphones/prestige-series/item/131-sr325x\">Grado SR325x headphones</a></h2><p id=\"WBlLh9\">My favorite way to listen to music is more of an experience than just one specific audio gadget and typically takes place at a specific time. Late at night, when my neighborhood is the quietest, I’ll dedicate some time to listening to music as a “treat” rather than in the background or while doing something else. While I’m lying in bed, I will hook up my <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.headphones.com%2Fproducts%2Faudioquest-dragonfly-cobalt-usb-dac-headphone-amplifier%3Fvariant%3D17599363022919%26currency%3DUSD%26utm_medium%3Dproduct_sync%26utm_source%3Dgoogle%26utm_content%3Dsag_organic%26utm_campaign%3Dsag_organic%26gclid%3DCj0KCQiAjJOQBhCkARIsAEKMtO2TwGLgUs4D23bGTjpsPBGDgvpWiOyIdJrSRmckIGW6Tb7ck2Sz0AMaAlkIEALw_wcB&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22929697%2Faudio-gear-favorite-headphones-earbuds-speakers\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Dragonfly Cobalt</a> DAC to my phone (<a href=\"https://www.theverge.com/c/22278012/dongle-quiz-tech-gadgets\">don’t forget the dongle</a>) and use my Grado SR 325x headphones to listen to lossless music with Qubuz, Apple Music, or some files I downloaded to my phone. </p><p id=\"mhygeX\">This high-quality, focused, and potentially pretentious setup is very relaxing to me and results in a deep listening experience. I start to notice things in my favorite songs that I may not have ever noticed before, or I end up paying more attention to the meaning behind the lyrics in a song. </p><p id=\"XNXZOf\">Though it’s a bit of a clunky setup, it makes me think about the way that the environment and how we use technology affect the way we consume media. <em>— Andrew Marino, senior audio engineer </em></p><div id=\"HIRtVe\"><div data-anthem-component=\"productcard:11028349\"></div></div><hr class=\"p-entry-hr\" id=\"hPbOV9\"><h2 id=\"ft5zOr\"><a href=\"https://www.amazon.com/Audio-Technica-AT-LP120XUSB-Direct-Drive-Hi-Fidelity-Anti-Skate/dp/B07N3S4X3P?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Audio-Technica AT-LP120-USB turntable</a></h2><p id=\"rd5GhB\">While I love constantly streaming music and podcasts via Wi-Fi speakers in my home, nothing beats making the time to put on a record. My Audio-Technica is a very modest setup — an inexpensive homage to the legendary Technics SL-1200 — but it’s the experience of sitting and listening that makes it special. I’m well aware that music is recorded digitally now, and the vinyl doesn’t make the sound much better unless you pony up for pricey gear, but I don’t care. </p><p id=\"rCEAQW\">My record collection is my poor man’s art collection. When I buy an LP or seven-inch, I’m not just buying the songs but also the larger artwork, photography, design, liner notes, and ultimately the experience of dedicating my time and attention to it all when I listen. I love the occasions when I get to sit around the living room with friends, taking turns picking a record, and just chatting while the songs spin for hours. I don’t even mind having to get up in the middle to flip the disc. It’s all part of the experience, and it always puts me in a good mood. <em>— Antonio G. Di Benedetto, commerce writer</em></p><div id=\"VFsJVh\"><div data-anthem-component=\"productcard:11028432\"></div></div><hr class=\"p-entry-hr\" id=\"xPynOk\"><h2 id=\"ylj7ST\"><a href=\"https://www.kztws.com/products/zsx-1\">KZ ZSX headphones</a></h2><p id=\"sTYwnR\">I see that Mitchell already introduced you to a set of high-performance, low-cost in-ear headphones. I can vouch for another, the KZ ZSX, which cost a little more at $60. There are two reasons why I bought these. I, of course, want high-quality sound without going broke. After I <a href=\"https://www.theverge.com/2019/11/7/20943377/chinese-hi-fi-audio-chifi-fiio-hifiman-tin-audio\">read our piece on Chinese hi-fi earphones</a> that have good components at a fraction of the cost that some well-known brands typically price them at, I was sold.</p><p id=\"YdaXpU\">The other reason is for getting some passive hearing protection while I play drums without ruining sound quality. Over-ear noise-canceling headphones are good at blocking out sound, but sometimes, the noise-canceling algorithm in my <a href=\"https://shop-links.co/cgDfZTa2nve\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sony WH-1000XM3 headphones</a> goes on the fritz with too much noise coming in from the drums and cymbals. It can sound bad. And, I usually have to listen to music too loudly to hear it as I trace over the track’s drums with my own. The KZ ZSX are a good, affordable fix for that. <em>— Cameron Faulkner, reviewer</em></p><div id=\"te91B8\"><div data-anthem-component=\"productcard:11028449\"></div></div><hr class=\"p-entry-hr\" id=\"AehKqh\"><h2 id=\"Sycs9b\"><a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAudioGear021422/https://www.sonos.com/en-us/shop/wireless-speakers\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sonos wireless speakers</a></h2><p id=\"Kb6dBG\">There’s nothing better than sitting in your favorite chair, putting on a favorite album, and enjoying the music without other distractions. At least, that’s the ideal — the reality in my home is hearing the same 10 songs my kids are into at the moment playing through our Sonos speaker system.</p><p id=\"bV24Wl\">Over the past decade or so, I’ve collected enough Sonos speakers to put them in each room where I care to listen to music. I’ve got a <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAudioGear021422/https://www.sonos.com/en-us/shop/one\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Sonos One</a> and a <a href=\"https://www.amazon.com/Sonos-Play-Compact-Wireless-Speaker/dp/B00EWCUK1Q?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Play:1</a> paired in stereo in my office (shout out to the <a href=\"https://apps.apple.com/us/app/sonosequencr/id967043604?itsct=apps_box_link&amp;itscg=30200\">SonoSequencr app</a> for letting me make unsupported pairings of my hodgepodge of speakers); a <a href=\"https://www.amazon.com/Sonos-Play-Ultimate-Wireless-Streaming/dp/B014LFINIA/ref=sr_1_2?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Play:5</a> in our living room; a <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAudioGear021422/https://www.sonos.com/en-us/shop/beam-gen1\" rel=\"sponsored nofollow noopener\" target=\"_blank\">gen-one Beam</a> with a Play:1 and Ikea bookshelf as surrounds in our playroom; a <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAudioGear021422/https://www.sonos.com/en-us/shop/move\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Move</a> in our dining room / outdoor patio; and the most recent addition, a <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergeAudioGear021422/https://www.sonos.com/en-us/shop/roam\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Roam</a> in our main bedroom that works as an Alexa speaker and provides shower tunes for me. My kids own the playlists on the Beam, I get to pick what I like in my office, and the Play:5 and Move are on the same floor, so sometimes I play the same thing across both of them when we have guests or are enjoying meals as a family.</p><p id=\"svNy7y\">Sonos’ sound quality is generally excellent for the price, and it’s great whether you’re listening at low volumes so as not to wake the baby napping or when it’s turned up to 11 and you want to bring the house down. But the reason it’s my favorite way to listen to music is because of how easy it is to play what I want through any combination of the speakers in my home. The Sonos app supports nearly any music service I might subscribe to, plus things like my preferred podcast player, Pocket Casts. But more often than not, I use AirPlay from my iPhone or iPad to play something through other apps. Vinyl may be hipper, and good headphones might provide more immersion, but when it comes to ease of use, it’s hard to beat Sonos. <em>— Dan Seifert, deputy editor</em></p><div id=\"fFDbSD\"><div data-anthem-component=\"productcard:11028723\"></div></div><hr class=\"p-entry-hr\" id=\"umdLr2\"><h2 id=\"K6Avam\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ultimateears.com%2Fen-us%2Fwireless-speakers%2Fwonderboom-2.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22929697%2Faudio-gear-favorite-headphones-earbuds-speakers\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Ultimate Ears Wonderboom 2</a></h2><p id=\"PGEy7Y\">The Wonderboom 2 is one of the more popular Bluetooth speakers out there, so I won’t bore you with a sales pitch, just a story. I recently got an electric cargo bike to take my kids to school and quickly realized there was an opportunity to make the morning commute a little less dull. Two kids on the back of one bike can sometimes lead to fights over personal space, so I had the idea to bring along the Wonderboom as a distraction. Let them listen to music or books-on-tape so they won’t kill each other before reaching school. But after attaching the speaker to the rear rack with a carabiner, I realized what I was riding was less a cargo bike and more of a rolling party. Sometimes, the kids choose the music (<em>Encanto</em> soundtrack, Justin Beiber), and sometimes, dad chooses (’90s R&amp;B, pop-punk). Either way, we get a lot of smiles along the way. The Wonderboom doesn’t have the best sound, but you can’t beat it for portability. Call me the <a href=\"https://www.youtube.com/channel/UCqP8aunScrdAcrUUQIOhI3Q\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Dom Whiting</a> of suburbia. — <em>Andrew J. Hawkins, transportation editor</em></p><div id=\"u3hGRI\"><div data-anthem-component=\"productcard:11028793\"></div></div><hr class=\"p-entry-hr\" id=\"mWal9j\"><h2 id=\"fRJZyM\"><a href=\"https://www.theverge.com/2020/1/15/21066947/jabra-elite-75t-review-wireless-earbuds-airpods-alternative\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Jabra Elite 75t wireless earbuds</a></h2><p id=\"JnhxxD\">To start with, I need to say that I have a slight tendency toward paranoia, in that I don’t feel comfortable walking around Brooklyn (or any other part of NYC) without being able to hear what’s going on around me. As a result, for a very long time, I only used wireless headsets — basically, single earbuds that were meant mainly for phone calls. </p><p id=\"zg1NOe\">About a year ago or so, however, I realized that my Plantronics Explorer 500 headset was way, way overdue for replacement. I looked around for something that (a) reasonable quality audio (I love music, but I’m not an audiophile by any means), (b) could pair with two devices at a time (so I could pick up a phone call while listening to my computer’s audio), and (c) in a concession to my cautionary nature, could be listened to using only one earbud. And all this on a budget. Finally, I picked up a pair of Jabra Elite 75t buds on sale, and I’m very glad I did. Now I can surround myself with music at home and wander my local streets listening to podcasts using one bud. (Although my Plantronics is still sitting in a drawer, just in case…) <em>— Barbara Krasnoff, reviews editor</em></p><div id=\"C64gmC\"><div data-anthem-component=\"productcard:10386608\"></div></div><hr class=\"p-entry-hr\" id=\"WmscrW\"><h2 id=\"pRVTr1\"><a href=\"https://www.theverge.com/2017/12/20/16797728/google-home-max-smart-speaker-assistant-review\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Google Home Max</a></h2><p id=\"mqnERX\">The only problem with my favorite audio system is that you probably won’t be able to find a new one. I missed out on a Google Home Max deal when the prices dipped to $150 each on Black Friday in 2020. However, a month later — <a href=\"https://www.theverge.com/2020/12/14/22175243/google-home-max-discontinued-smart-speaker-support\" rel=\"sponsored nofollow noopener\" target=\"_blank\">after it had been officially discontinued</a> —  the prices dropped below $200 again, and I got one right away, then added a second one not long after that.</p><p id=\"1zmoAZ\">I don’t use voice assistants, but being able to cast music from my phone or PC works exactly the way I want it to, and the Home Max gives me an option for decent sound in my home office where I don’t have a surround sound setup. </p><p id=\"rN6H13\">When Google launched its smart speaker for $400 in 2017, it was fair to question whether its sound quality matched other devices with similar prices. But for what I paid, they are not just good enough, they’re great. If you can find <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ebay.com%2Fsch%2Fi.html%3F_from%3DR40%26_trksid%3Dp2047675.m570.l2632%26_nkw%3Dgoogle%2Bhome%2Bmax%26_sacat%3D185067%26mkcid%3D1%26mkrid%3D711-53200-19255-0%26siteid%3D0%26campid%3D5338794975%26customid%3DVergeAudioGear021422%26toolid%3D10001%26mkevt%3D1&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22929697%2Faudio-gear-favorite-headphones-earbuds-speakers\" rel=\"sponsored nofollow noopener\" target=\"_blank\">one or two in decent shape</a> and you use Google Cast-compatible audio services, I’d recommend picking them up. <em>— Richard Lawler, senior news editor</em></p><div id=\"I8tdkC\"><div data-anthem-component=\"productcard:11028883\"></div></div><hr class=\"p-entry-hr\" id=\"yInU5L\"><p id=\"xK3ade\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0bjvJKLzKO21mvtnvbKV8LBFNLk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22141594/adiaconis_201202_4322_0003.0.jpg",
  "description": "The Verge staff talks about the audio gear they listen with.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}