{
  "title": "The Google Pixel Watch needs a good chip, but which?",
  "url": "https://www.theverge.com/2022/5/16/23070725/google-pixel-watch-smartwatch-wear-os-processor-chip",
  "date": "2022-05-16T12:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3AAziMmK4RM9f7x6BiOpOfLd0j0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70873693/Google_Pixel_Watch_Google_Maps.0.png\" />        <figcaption><em>Is turn-by-turn navigation on Google Maps going to work if the Pixel Watch’s chip blows?</em> | Image: Google</figcaption>    </figure>  <p id=\"1dTjqi\">Earlier this week, Google confirmed what we’ve suspected for a long time: the <a href=\"https://www.theverge.com/2022/5/11/23064072/google-pixel-watch-fitbit-io-2022\">Google Pixel Watch is coming later this fall</a>. And while we learned some details, the reveal was more of a teaser than a full-blown announcement. Some of that was to be expected, and of course, the next few months will be full of speculation about what the final form of the Pixel Watch will be. But one thing Google has to get right is the chip inside.</p><p id=\"k9tspa\">It’s clear, from the Pixel Watch’s design to the company’s massive undertaking in retooling Wear OS, that Google is trying to make an Android flagship smartwatch that <a href=\"https://www.theverge.com/2022/4/30/23049490/pixel-watch-leaked-battery-specs-cellular-models-flagship\">can give the Apple Watch a run for its money</a>. The thing is, Wear OS’s sluggish evolution wasn’t all on Google. For a number of years, Wear OS was stymied by a lack of capable processors.</p><p id=\"RqXpQm\">Most Wear OS watches run on a Qualcomm Snapdragon Wear chip. A few run on proprietary chips, but those are an exception to the rule. At a time when Samsung and Apple were rolling out advanced smartwatch<strong> </strong>features left and right on increasingly powerful SoCs, Qualcomm understandably put more of its effort into its mobile chips than its wearable ones. That left Wear OS without a processor that could keep up. The watches were laggy, downloading apps on the wrist could be tedious, and sometimes it felt like the watch was fighting against you.</p>  <figure class=\"e-image\">        <img alt=\"The Fossil Gen 6\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-E8DubxzhEGwwy_nshUbapnGSH0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22996109/dbohn_211105_4864_0001.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>The Fossil Gen 6 had the Qualcomm Snapdragon 4100 platform. Didn’t make that much of a difference.</em></figcaption>  </figure><p id=\"O7H2mN\">There are many reasons why Wear OS struggled to gain a foothold, but there are two major factors that led it to where it is today: infrequently updated software and this chip problem. Fixing either was going to be a bumpy ride, but at the very least, Wear OS 3 is a concerted effort on the software front. The hardware issue is a little more concerning because up until now, Wear OS watches have primarily depended on Qualcomm’s chips. And unfortunately, Qualcomm didn’t deliver. </p><p id=\"9vRwlJ\">There was <a href=\"https://www.theverge.com/2020/6/30/21307368/qualcomm-snapdragon-4100-google-wear-os-smartwatch-wearables-faster-battery-life\">hope when the Snapdragon Wear 4100 platform</a> was announced as it used newer (though still outdated) process technology that would enable faster performance and more modern features. But then<strong> </strong>it took over a year for a handful of watches to actually use it, and the total experience still wasn’t dramatically improved. </p><p id=\"HiE2cu\">To be blunt, the Snapdragon Wear 3100 and 4100 platforms are not going to cut it for the Pixel Watch. It was telling when Samsung opted to use its own <a href=\"https://www.theverge.com/2021/8/10/22617873/samsung-exynos-w920-chip-announced-galaxy-watch-4\">Exynos W920 SoC</a> over the Snapdragon Wear 4100 platform for the Galaxy Watch 4 lineup — the very first Wear OS 3 watches. Whatever Qualcomm had available, it simply was never going to outmatch Samsung’s own tech. </p><p id=\"0SRQti\">And when Google and Fossil started explaining how upgrades to Wear OS 3 might work, it became clear that the 3100 wouldn’t cut it either.<strong> </strong>Fossil revealed that <a href=\"https://www.theverge.com/2021/6/6/22521256/fossil-not-upgrade-existing-watches-wear-os-google-android\">none of its 3100-powered smartwatches</a> would receive the upgrade to the new unified platform, counter to what many believed. When Google announced which existing Wear OS watches would be <a href=\"https://www.theverge.com/2021/7/22/22588440/google-wear-os-3-update-smartwatch-samsung-2022\">eligible for an upgrade</a> to Wear OS 3,<strong> </strong>it not only excluded all 3100-powered watches — it also included the ominous message with others that “in some limited cases, the user experience may be impacted.” </p><p id=\"8KjijW\">The kicker was when a few months after the Wear OS 3 reveal,<strong> </strong>Qualcomm announced in July 2021 that it was getting its ducks in a row to <a href=\"https://gizmodo.com/qualcomms-feeling-the-heat-over-its-android-smartwatch-1847336735\">develop a new 5100 platform within the next year</a>. Which should mean the 5100 is almost ready unless it got delayed.</p><p id=\"AdtBIY\">This leaves us with a big question. What exactly is going to power the Pixel Watch? And will it be able to run Wear OS 3 the way Google envisions?</p>  <figure class=\"e-image\">        <img alt=\"Galaxy Watch 4 Classic (top left) and Galaxy Watch 4 (bottom right)\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nsSkFQ8_ozOZjNPwrd0E0fMaDEA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22788001/dbohn_210816_4717_0007.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>Google could potentially license the proprietary Exynos chip Samsung used to power the Galaxy Watch 4 lineup</em></figcaption>  </figure><p id=\"PpBGIJ\">Perhaps Google will license Samsung’s Exynos W920. Samsung has declined to comment on whether that’s a possibility multiple times. (Understandably so.) Another recent rumor is that the Pixel Watch will feature Samsung’s <a href=\"https://9to5google.com/2022/05/13/google-pixel-watch-chip/\">last-gen wearable chip</a>, the Exynos 9110. Or given Qualcomm’s sudden desire to hustle on a new wearable chip, perhaps the Pixel will be one of the first watches powered by the 5100 platform. Or, maybe Google will adapt its Tensor chip for the Pixel Watch. We asked Google to comment about the Pixel Watch’s processor, but it declined to comment.</p><p id=\"FkERLm\">All of these scenarios are hard to predict. Wear OS 3 ran well on the <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4</a> — except when it came to battery life with the always-on display. You can’t say the Pixel Watch would suffer the same, even if it has the same chip. It’s going to run a refreshed version of the Wear OS 3 UI and likely won’t use the exact same components. Leaks already suggest that the <a href=\"https://www.theverge.com/2022/4/30/23049490/pixel-watch-leaked-battery-specs-cellular-models-flagship\">battery sizes are different</a>. The watch running on the older Exynos 9110 might be potentially disappointing, but not the end of the world either. The Samsung Galaxy Watch 3 ran Tizen quite smoothly — and Wear OS 3 is at least part Tizen. As for battery life, the Galaxy Watch 3 wasn’t anything to write home about but it was, at least in my experience, better than its successor.</p><p id=\"kq6vrV\">Opting for a Tensor chip would be intriguing — partly because we wouldn’t know what to expect but also because Google wouldn’t be limited by a third party. As for a Qualcomm 5100 chip, it’s hard to be hopeful based on the past. </p><p id=\"bgEi7R\">That said, Qualcomm could surprise everybody, and I find it hard to imagine that Google would suffer a subpar chip when it’s been <a href=\"https://www.theverge.com/2022/4/15/23026915/pixel-watch-wear-os-wearables-smartwatch\">actively and continuously laying the groundwork</a> for the Pixel Watch for over two years. That would be flopping when it counts most.</p><div class=\"c-float-right\"><aside id=\"WtboC9\"><q>What it can’t afford are laggy performance and abysmal battery life</q></aside></div><p id=\"428Uke\">Obviously, we won’t know what the chip will be until Google confirms it later this year. But one thing’s for sure — Wear OS 3 can’t repeat the mistakes of the past. It’s not the end of the world if the Pixel Watch doesn’t come with FDA-cleared EKGs, body temperature sensors, and every experimental health feature under the sun. (We asked Google about this too, but it again declined to comment.) Those can always come later. What it can’t afford are laggy performance and abysmal battery life. </p><p id=\"6fHL7M\">The only way to judge Google’s success (or failure) will be to test the Pixel Watch ourselves. But knowing what’s powering it would at least give an idea of what to expect.</p><p id=\"AubpzW\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_26HliO3abBmHDQ_cIPtqeW0MhA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23449157/Google_Pixel_Watch_Google_Maps.png",
  "description": "Wear OS has always struggled with processing power.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}