{
  "title": "The TikTok and Oracle ‘trusted technology partner’ deal might really happen",
  "url": "https://www.theverge.com/2022/3/11/22972530/tiktok-oracle-china-bytedance-trump-cfius",
  "date": "2022-03-11T16:41:55.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ft-AJzBjNLCW66y2yAzSvTz0_EQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70609307/acastro_200713_1777_tikTok_0001.0.0.jpg\" />        <figcaption>Tiktok | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"BOWeYH\">TikTok is reportedly close to finalizing a deal with Oracle that would see the short-form video platform storing its US users’ data without providing access to Chinese parent company ByteDance. As first reported by <a href=\"https://www.reuters.com/technology/exclusive-tiktok-nears-deal-with-oracle-store-its-data-sources-2022-03-10/\"><em>Reuters</em></a>, a dedicated team of engineers and cyber security workers would act as gatekeepers for US users’ data and would likely not be under TikTok’s supervision. </p><p id=\"Di42OP\">According to a report by <a href=\"https://www.buzzfeednews.com/article/emilybakerwhite/tiktok-project-texas-bytedance-user-data?scrolla=5eb6d68b7fedc32c19ef33b4\"><em>BuzzFeed News</em></a>, the agreement is known internally at TikTok as “Project Texas,” a reference to Oracle’s Austin, Texas headquarters. The company will put in place new controls that restrict access to US user data, which it will later recreate in Europe, <em>BuzzFeed</em> reported. But BuzzFeed says it’s still undecided how much access Chinese managers at the company will have to the data and the US-based team. </p><p id=\"ol8hHa\">The stalled agreement, first announced under former President Trump, was put together after <a href=\"https://www.theverge.com/2020/8/10/21358505/trump-tiktok-wechat-tencent-bytedance-china-ban-executive-order-legal-sanctions-rules\">Trump ordered what amounted to a ban</a> on TikTok, citing concerns about US users’ data being made available to the Chinese government. Oracle was to become a “trusted technology partner” for TikTok in the US. In addition to Trump’s order, the Committee on Foreign Investment in the US (CFIUS) formally <a href=\"https://www.theverge.com/2020/11/13/21564030/us-tiktok-injunction-cfius-deadline-trump-bytedance-china\">ordered parent company ByteDance</a> to divest itself of operations in the US. </p><p id=\"OhkTng\">TikTok appealed both orders. A judge ruled in December 2020 that the Trump administration had overstepped its authority under the International Emergency Economic Powers Act (IEEPA) and granted TikTok a preliminary injunction. The deal appeared all but dead —<a href=\"https://www.theverge.com/2021/2/10/22276090/tiktok-oracle-deal-biden-trump-ban-china-bytedance-white-house\">reportedly “shelved indefinitely”</a>— after President Biden took office.</p><p id=\"05kFhq\"><em>Reuters </em>reported, citing sources, that Oracle would store all of TikTok’s US users’ data on its servers as part of the proposed agreement. It’s not clear how such an agreement would affect the prior CFIUS order, however. </p><p id=\"THiDJp\">TikTok and Oracle did not reply to requests for comment from <em>The Verge.</em></p><p id=\"47B9vs\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WvvNCfrpwjz2-hyH4inN5gfpxzQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21694348/acastro_200713_1777_tikTok_0001.0.jpg",
  "description": "The shelved agreement may be revived.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}