{
  "title": "The US House of Representatives has voted to decriminalize marijuana",
  "url": "https://www.theverge.com/2022/4/1/22999751/cannabis-bill-decriminalize-more-passes-us-house-party-lines",
  "date": "2022-04-01T16:39:03.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Light Cannabis Growers In Italy As The Country Moves Towards Decriminalisation\" src=\"https://cdn.vox-cdn.com/thumbor/Xl4IZ8Gs2Nvwvd01SzhJRYu52mo=/0x0:5568x3712/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70698755/1235766842.0.jpg\" />        <figcaption>Cannabis bill to decriminalize gets a vote in the House  | Photo by Antonio Masiello/Getty Images</figcaption>    </figure>  <p id=\"eMDSVU\">The US House of Representatives voted Friday to approve a bill that would decriminalize cannabis at the federal level. It’s a first step toward making the drug legal and attempting to undo some of the damage caused by punitive drug laws, particularly among communities of color. The voting happened along party lines, with 220 votes in favor and 204 opposed. The bill faces an uncertain future in the Senate, but advocates say with Democrats controlling both houses of Congress, they’re more hopeful that the legislation will finally become law. </p><p id=\"fbRqX3\">The Marijuana Opportunity Reinvestment and Expungement (or <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/3617\">MORE Act</a>) would remove marijuana from the federal list of controlled substances and add a federal tax on cannabis products. It would also establish a process to expunge convictions and review sentences for past federal cannabis convictions.</p><p id=\"OCNTHW\">The House also added several amendments to the bill, among them a requirement by the National Institute for Occupational Safety and Health to conduct a study on the “Impact of the legalization of recreational cannabis by states on the workplace” and help employers develop best practices in updating their cannabis policies. Another, which was rejected on Friday, would have rescinded cannabis use as a reason for denying a federal security clearance, retroactive to 1971.</p><p id=\"tETBTO\">The House passed an earlier version of the bill in a lame-duck session in December 2020, only to see it stall in the Senate. But with midterms looming, advocates think the timing may finally be right for Congress to take action.</p><p id=\"bzP41w\">“I feel a lot more optimistic than I did last time around,” Maritza Perez, director of the Drug Policy Action office for national affairs, said in an interview with <em>The Verge</em>. “The bill is the same version passed in 2020, with no substantive changes, so hopefully everyone who voted last time will vote in favor again.” </p><aside id=\"OPPrvo\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Will Democrats keep their promise to decriminalize marijuana?\",\"url\":\"https://www.theverge.com/2021/2/1/22243311/democrats-biden-marijuana-policy-reschedule-drug\"}]}'></div></aside><p id=\"bFMACn\">House Judiciary Chairman Jerrold Nadler (D-NY), a sponsor of the bill, says the recent wave of <a href=\"https://www.koat.com/article/cannabis-in-new-mexico-heres-what-you-need-to-know/39563739\">state</a> <a href=\"https://www.marijuanamoment.net/south-dakota-senate-approves-marijuana-legalization-and-expungements-bills-while-house-defeats-tax-measure/\">legalization</a> <a href=\"https://www.nj.com/marijuana/2022/03/top-democrat-orders-probe-into-unacceptable-delay-in-launching-nj-legal-weed-market.html\">efforts</a> has put pressure on Congress to act. He told <em>The Verge</em> he hopes “the Senate will finally [pass the MORE Act] so the federal government can join dozens of states in putting an end to these unfair and outdated policies.” </p><p id=\"qji3hU\">The fate of the MORE Act in the Senate is uncertain, but Sens. Cory Booker (D-NJ), Chuck Schumer (D-NY), and Ron Wyden (D-OR) <a href=\"https://www.theverge.com/2021/7/14/22576119/democrats-new-plan-legalize-marijuana-schumer-wyden-booker-senate\">introduced draft legislation</a> for the Cannabis Administration and Opportunity Act last summer, which could be introduced in the Senate next month.</p><p id=\"XRlu9H\">The Biden administration, however, has <a href=\"https://www.marijuanamoment.net/after-one-year-as-president-bidens-marijuana-promises-remain-unfulfilled/\">not made the progress</a> many expected on cannabis reform, and its actions suggest a stance that is still very anti-cannabis. For instance, in 2021, the <a href=\"https://www.cnn.com/2021/03/19/politics/biden-white-house-staff-marijuana/index.html\">White House screened staff</a> for marijuana and asked some who tested positive to resign or work remotely. It also updated rules earlier this month that could <a href=\"https://www.politico.com/news/2022/03/02/white-house-applicants-weed-companies-00013390\">deny security clearances</a> to prospective job candidates who invested in legal cannabis companies. And Perez said earlier hopes that Vice President Kamala Harris might influence the president’s thinking have cooled. </p><p id=\"SEN0Aq\">In addition, Perez notes that Biden had an opportunity to reduce cannabis restrictions in Washington, DC, but didn’t do so. The president’s 2023 budget proposal keeps intact a rider that <a href=\"https://www.theverge.com/2021/6/4/22516914/biden-proposed-budget-block-recreational-marijuana-washington-dc\">blocks DC from legalizing marijuana sales</a>, even though DC’s city council <a href=\"https://www.theverge.com/2014/3/4/5470934/washington-dc-votes-to-decriminalize-marijuana\">voted to decriminalize marijuana</a> possession in 2014. </p><p id=\"2XWsqC\">“To me, that’s pretty shocking — you would think the budget is an area where he could make a statement,” she said. “This tells me where his mind is at; that he believes more research is still needed.” Perez added that she thinks it’s possible Biden may yet take some action to give clemency to people convicted of low-level marijuana-related crimes. </p><p id=\"wlv0CH\">During a hearing for the MORE Act before the House Rules Committee on Wednesday, Chairman Jim McGovern (D-Mass.) said the MORE Act would “address our nation’s failed approach to the war on drugs.” It’s worth noting that Biden was a key part of the federal war on drugs in the 1980s and 1990s; <a href=\"https://www.vox.com/policy-and-politics/2019/6/20/18677998/joe-biden-1994-crime-bill-law-mass-incarceration\">he authored</a> the 1994 Violent Crime Control and Enforcement Act, which ramped up the war on drugs and imposed tougher prison sentences for federal drug crimes.</p><p id=\"0GW6DE\">Biden took a softer line during the 2020 presidential campaign, saying he would seek “to reschedule cannabis as a Schedule II drug so researchers can study its positive and negative impacts.” He has not yet taken action on rescheduling.</p><p id=\"Nb73xQ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ChmL0A1rOI_CJFbRRD1RVrDxI_c=/0x399:5568x3314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23360202/1235766842.jpg",
  "description": "The bill would impose a federal tax on weed sales.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}