{
  "title": "The US government reportedly paid to send Starlink terminals to Ukraine",
  "url": "https://www.theverge.com/2022/4/8/23016670/starlink-spacex-us-government-terminals-funding-usaid",
  "date": "2022-04-08T18:01:37.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H3Kr5d0K5g1SK2sFuVZQo9v7gJI=/0x85:2040x1445/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70727445/npatel_20210512_4552_0048.0.jpg\" />        <figcaption><em>The company often receives public assistance for its projects.</em> | Photo by Nilay Patel / The Verge</figcaption>    </figure>  <p id=\"Lvcr6r\">Despite <a href=\"https://www.cnbc.com/2022/03/22/elon-musk-spacex-thousands-of-starlink-satellite-dishes-sent-to-ukraine.html\">SpaceX implying</a> that the US didn’t give money to send Starlink terminals to Ukraine in March, a <a href=\"https://www.washingtonpost.com/politics/2022/04/08/us-quietly-paying-millions-send-starlink-terminals-ukraine-contrary-spacexs-claims/\">report from <em>The Washington Post</em></a> reveals that the government actually paid millions of dollars for equipment and transportation. The report found that the US Agency for International Development, or USAID, paid $1,500 apiece for 1,333 terminals, adding up to around $2 million. USAID disclosed the number of terminals it bought from the company in a <a href=\"https://www.usaid.gov\">press release</a> from early April that has <a href=\"https://twitter.com/joroulette/status/1511781864356212737/photo/1\">since been altered</a> to remove mentions of the purchase. </p><p id=\"WVyD6j\">According to <a href=\"https://twitter.com/joroulette/status/1511701930543771655\">space reporter Joey Roulette</a>, SpaceX donated 3,667 terminals to Ukraine, or around $10 million worth, after also factoring in the three months of data it provided with the terminals. However, it’s possible this donation was partially subsidized by USAID’s $1,500-a-unit purchase. <em>The Washington Post</em> says it’s unclear whether Ukraine received standard terminals, which SpaceX currently charges $600 for, or the advanced terminals, which <a href=\"https://www.theverge.com/2022/2/2/22913921/spacex-starlink-premium-satellite-internet-faster-speed-expensive\">were announced in February</a> and cost $2,500. </p><div id=\"Aku3S2\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Looks like USAID edited their press release and deleted the value of SpaceX's donation, as well as the number of terminals the agency said SpaceX provided on its own dime. Here's the previous version vs. current version: <a href=\"https://t.co/ws1urZu4VM\">https://t.co/ws1urZu4VM</a> <a href=\"https://t.co/1eZxfQ6DPA\">pic.twitter.com/1eZxfQ6DPA</a></p>— Joey Roulette (@joroulette) <a href=\"https://twitter.com/joroulette/status/1511781864356212737?ref_src=twsrc%5Etfw\">April 6, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"q9HM4P\">If USAID purchased regular terminals, it paid $900 over retail cost per unit (adding up to around $1.2 million) — notably, a recent report said that <a href=\"https://www.protocol.com/bulletins/spacex-releases-starlink-premium\">the terminals cost SpaceX around $1,000 to build</a>. It is possible that USAID was also paying for internet service, which costs $110 a month for Starlink’s standard plan and $500 a month for its premium plan available with the more expensive terminals.</p><div class=\"c-float-right\"><aside id=\"PvKZIY\"><q>SpaceX sells its terminals to consumers at a loss</q></aside></div><p id=\"zG0ncl\"><em>The Washington Post</em> also reports that USAID agreed to pay more than $800,000 for transportation of the 5,000 terminals that were sent to Ukraine through what the agency now calls a “public-private partnership.”</p><p id=\"6oiJw6\">In February, <a href=\"https://www.theverge.com/2022/2/28/22955339/elon-musk-spacex-starlink-ukraine-user-terminals-russia-invasion\">Ukraine’s vice prime minister posted images</a> of a truck filled with what appeared to be standard Starlink terminals, days after he tweeted at SpaceX CEO Elon Musk asking for assistance. It’s unclear whether these terminals were sent solely by SpaceX, though <em>The Washington Post</em>’s report does note that USAID had previously bought 175 Starlink terminals as part of a separate agreement.</p><p id=\"1aOUWb\">It does appear like SpaceX did make a significant charitable donation to Ukraine. USAID told the <em>Post</em> in a statement that the “delivery of Starlink terminals were made possible by a range of stakeholders, whose combined contributions valued over $15 million,” and its original press release said that SpaceX donated $10 million worth of equipment in service. But, <a href=\"https://www.theverge.com/2019/6/18/18683455/nasa-space-angels-contracts-government-investment-spacex-air-force\">as with many other SpaceX projects</a>, the company does appear to have gotten a significant amount of public funding for the project.</p><aside id=\"QHRaBh\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Ukraine engineer snags SpaceX’s new Starlink service with old eBay dish\",\"url\":\"https://www.theverge.com/2022/3/1/22956481/ukraine-spacex-starlink-oleg-krutkov-dish-internet-russia-invasion\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/jmn3a5tSQbWllc7bULX6sd0aLBk=/0x231:2040x1299/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22512181/npatel_20210512_4552_0048.jpg",
  "description": "SpaceX seems to have received millions in public funding.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}