{
  "title": "The Batman is young, dumb, and full of soft-spoken ennui",
  "url": "https://www.theverge.com/22954478/the-batman-review-robert-pattinson-matt-reeves-movie",
  "date": "2022-02-28T17:00:35.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Robert Pattinson as Batman.\" src=\"https://cdn.vox-cdn.com/thumbor/7uG2_uI2XqhU_IzXTNa0_E7zu8E=/3055x0:8000x3297/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70560650/rev_1_TBM_01883r_High_Res_JPEG.0.jpeg\" />        <figcaption><em>Robert Pattinson in </em>The Batman<em>.</em> | Photo: Jonathan Olley / Warner Bros.</figcaption>    </figure>  <p>The Batman franchise has seen better days</p> <p class=\"p--has-dropcap\" id=\"VFZuLO\">Bruce Wayne has been so thoroughly deconstructed and analyzed as both a fictional hero and cultural icon that it would almost be unfair to expect <a href=\"https://www.theverge.com/2020/8/22/21377631/the-batman-teaser-trailer-robert-pattinson-matt-reeves-dc-fandome\">Matt Reeves’ <em>The Batman</em></a><em> </em>to bring all that much new to the conversation. But that expectation is something Warner Bros. saddled upon <em>The Batman</em> by implicitly asking viewers to just kinda ignore its <a href=\"https://www.theverge.com/22334362/zack-snyder-justice-league-fandom-release-cut-star-wars-twitter\">other recent Bat-related films</a>, and to instead see this feature as the beginning of the franchise’s future. Unfortunately, the new Dark Knight doesn’t rise to the occasion.</p><p id=\"QTpN6S\">Gotham is a rotting tinderbox on the brink of utter social collapse as <em>The Batman </em>opens on the city just a couple years into Bruce Wayne’s (Robert Pattinson) career as the Dark Knight. Inexperienced as this new Batman is, he’s well past his days of merely looming in people’s imaginations as an urban myth. Gothamites know there’s a vigilante lurking in their midst who hunts down and brutalizes criminals. But the sociopathic ferocity that defines his brand of “justice” understandably leaves many questioning whether he’s a monster, himself.</p>  <figure class=\"e-image\">        <img alt=\"Batman standing\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yNAcG3TCVeiDFUyXbctv6l5oIe4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277498/rev_1_TBM_TRL2_88772_High_Res_JPEG.jpeg\">      <cite>Image: Warner Bros.</cite>      <figcaption><em>Batman gazing upon Gotham during one of the movie’s many scenes when the sun is up.</em></figcaption>  </figure><p id=\"G2CwA2\">Though Batman terrifies most of Gotham’s on-edge police force, he shares an uneasy working relationship with James Gordon (Jeffrey Wright), a GCPD lieutenant constantly butting heads with his colleagues over his use of the Bat-Signal and his willingness to invite the Dark Knight into ongoing investigations. As green as both Gordon and this Batman are, they’re also powerful because of their ability to strike fear into the heart of Gotham’s criminal element simply by shining a bright light into the sky. But while many of Gotham’s two-bit baddies live in fear of the Bat-Signal, there are proper up-and-coming villains like the Riddler (Paul Dano) who are drawn to it like moths to a flame specifically because of the hero it heralds.</p><p id=\"n8u3tv\">Before <em>The Batman </em>fully settles into its central game of cat-and-mouse, the film uses a few precious, and legitimately disturbing, moments to establish what a threat this grimdark take on the Riddler poses to Gotham elites like mayor Don Mitchell Jr. (Rupert Penry-Jones). The degree to which <em>The Batman</em>’s Riddler is inspired by the Zodiac killer cannot be overstated, but the movie smartly introduces him as the stuff that home invasion nightmares like <em>The Strangers</em> and gory horror thrillers like <em>Saw</em> are made of. It’s always too late for the Riddler’s most recent victims by the time GCPD shows up. And with each coded clue he leaves behind for the Batman to find, it becomes increasingly clear that he’s building to something much larger than any one member of Gotham’s landed gentry.</p><p id=\"LUBrgn\">As premises for Batman movies go, <em>The Batman</em>’s is fairly solid on paper, and will ring familiar to fans of writer Frank Miller and artist David Mazzucchelli’s <em>Batman: Year One </em>arc from 1987. But unlike <em>Year One</em>, which used Gordon and Batman’s intertwining origin stories to illustrate dark facets of Gotham’s identity to powerful effect, <em>The Batman</em>’s handling of both characters often errs more toward an unintentional comedy and narrative woolliness that generally detracts from the film.</p>  <figure class=\"e-image\">        <img alt=\"Batman, Jim Gordon, and multiple Gotham cops all about to brawl with one another.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/zlrQgYPV6Xy2tOx2XHVPJ7ACwlE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277502/rev_1_TBM_11721r_High_Res_JPEG.jpeg\">      <cite>Image: Warner Bros.</cite>      <figcaption><em>Jim Gordon trying to defend Batman from a bunch of his fellow cops.</em></figcaption>  </figure><p id=\"GPPxEH\"><em>The Batman</em>’s plot is already busy enough with its hunt for a serial killer, its exploration of systemic police corruption, and the time it spends trying to flesh out its vision of Bruce Wayne: an antisocial insomniac and recluse who the movie strongly suggests may have a form of autism. But <em>The Batman</em>’s plot becomes further complicated by the presence of crime boss Carmine Falcone (John Turturro), his henchmen Oswald Cobblepot (Colin Farrell), and their colleague Selina Kyle (Zoë Kravitz), who splits her time between working in a local club as a waitress and robbing people blind as a masked thief who never gets the cool bad-guy alias she clearly deserves. </p><p id=\"ww86Hu\">Though <em>The Batman </em>introduces Falcone, the Penguin, and Selina as a means of adding some depth and nuance to its story, each of their arcs has a way of derailing the film to varying degrees because of how inelegantly it tries to weave them all together. Each of <em>The Batman</em>’s villains are connected in ways that become clearer the deeper you get into the movie. But because it takes a significant amount of time for their bonds to become crucial to the story, there are long stretches where it feels like characters simply stop existing until the script remembers that they’re out there somewhere.</p><p id=\"4maIGB\">For every one of <em>The Batman</em>’s good ideas — like focusing on Batman and Gordon bonding over their shared fondness of actually doing detective work — there are at least two things holding it back. These include the fact that none of the Riddler’s riddles here are all that complicated, or that Pattinson and Wright don’t have all that much on-screen chemistry. In <em>The Batman</em>’s defense, the movie <em>does </em>want you to understand how profoundly lonely Bruce Wayne is and how difficult it is for him to relate to other people; the weird energy between him and Gordon may be a directorial choice. But even in Bruce’s more vulnerable moments with longtime Wayne family butler Alfred Pennyworth (Andy Serkis), there’s an emotional inertness that feels intentional, but ultimately unsatisfying, given the intimacy the characters traditionally share.</p><p id=\"oohuXN\">Things become slightly more interesting when Selina’s in the picture. This is because of how <em>The Batman </em>allows itself to enjoy a little bit of whimsy that always feels just out of Batman’s reach, especially in the many scenes where he’s just standing there silently brooding while staring into nothingness. Whenever the film starts to have some fun, though, it cuts things short, almost as if to remind you that this is supposed to be Gotham before costumed psychopaths gallivanting around was a regular occurrence. This is also, one imagines, why there are so many scenes in which Bruce… is not particularly good at being Batman quite yet. It’s an idea that’s interesting to see laid out at first, but becomes kind of cringe-inducing later in the film as the stakes get higher, and his competence becomes a matter of life and death for more and more people.</p>  <figure class=\"e-image\">        <img alt=\"Selina Kyle and Batman atop a skyscraper disagreeing about how to handle criminals.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6D5dr68-9xEHHZR-W6nRhvmt5Io=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277510/rev_1_TBM_56056JOrv4_High_Res_JPEG.jpeg\">      <cite>Image: Warner Bros.</cite>      <figcaption><em>Selina Kyle and Batman leering at one another like the weirdos they both are.</em></figcaption>  </figure><p id=\"NUAJ73\">Compared to previous cinematic versions of Batman, this Dark Knight is more of a brawler who makes up for his lack of experience with his ability to take a punch. But after the first few instances of seeing Batman getting the daylights beaten out of him, it’s hard not to interpret the movie’s multiple mentions of “vengeance” as allusions to Batman’s desire to get back at all the petty criminals who manage to get their licks in, rather than his larger existential mission. Whatever goodwill <em>The Batman </em>earns by steering clear of exhaustively explaining, once again, how Bruce’s parents were murdered is somewhat squandered by the degree to which they loom in the background of this story, set some 20 years after their deaths.</p><p id=\"e21krw\">What’s most likely to take audiences by surprise, and perhaps draw some criticism, are the decisions that were made regarding the sound of Pattinson’s Batman: a man who breathily snarls in a soft-spoken voice that’s difficult to imagine supervillains being scared by. When it isn’t skewing far more Southern than you’d think a Gotham native’s accent would, what’s interesting about this Batman’s voice — and really much of Pattinson’s performance — is that it doesn’t feel “wrong” for Batman per se, but rather not right for Bruce Wayne. There is something to the idea of a moody, introverted Batman whose access to wealth makes him feel disconnected from the very city he swears he wants to defend. But this incarnation of the character<em> </em>puts so little effort into trying to maintain the semblance of a double life that you’re left wondering how no one’s managed to figure out who he is.</p><p id=\"liYRpi\">That sort of flimsy world-building and the notable thematic similarities this film<em> </em>ends up bearing to <a href=\"https://www.theverge.com/2019/10/4/20899422/joker-movie-review-todd-phillips-joaquin-phoenix-incel-violence-dc-comics-batman\">Todd Phillips’ 2019 <em>Joker</em></a> are a big part of what makes <em>The Batman </em>feel like one of the lesser entries, substance-wise, in the grand Batman cinematic canon. It’s a perfectly passable return to Gotham with a spiffy car in tow — but it’s not the absolute jolt to the system the beleaguered Bat-movie franchise needs.</p><p id=\"99yNCv\"><small><em>The Batman </em></small><small>also stars Barry Keoghan, Peter Sarsgaard, Jay Lycurgo, and Jayme Lawson. The movie hits theaters on March 4th.</small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Fg1dqIC1BG4B34dzzbT3W39VFM8=/0x120:1232x765/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23277628/Screen_Shot_2022_02_28_at_12.43.50_PM.png",
  "description": "Director Matt Reeves’ The Batman isn’t the Dark Knight’s finest hour.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}