{
  "title": "The great football series the NFL got canceled",
  "url": "https://www.theverge.com/22922330/playmakers-nfl-show-cancelation-football-espn",
  "date": "2022-02-10T15:00:00.000Z",
  "author": "Eve Peyser",
  "content": "      <figure>      <img alt=\"The fictional Cougars team from Playmakers\" src=\"https://cdn.vox-cdn.com/thumbor/h7hLbR4RBgdl0jhUrLX4nqXu3i4=/0x186:2400x1786/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70492785/003.0.jpg\" />        <figcaption><em>The fictional Cougars team from Playmakers.</em> | Image: ESPN</figcaption>    </figure>  <p id=\"GfuOiK\">When ESPN canceled <em>Playmakers</em>, a <a href=\"https://www.nytimes.com/2003/08/26/arts/television-review-psyching-out-football-in-an-espn-drama.html\">critically acclaimed</a> and popular drama about the lives of professional football that ran for a single season in 2003, they were pretty transparent about why: it had pissed off the NFL. “It’s our opinion that we’re not in the business of antagonizing our partner, even though we’ve done it, and continued to carry it over the NFL’s objections,” <a href=\"https://www.nytimes.com/2004/02/05/sports/pro-football-citing-nfl-espn-cancels-playmakers.html\">said</a> Mark Shapiro, the then executive vice president of ESPN. “To bring it back would be rubbing it in our partner’s face.”</p><p id=\"gtpho0\">At the time, <em>Playmakers</em> was the highest-rated program on ESPN, outside of actual Saturday and Sunday primetime football games. Now, almost 20 years later, <em>Playmakers </em>is hard to come by. You can buy it on DVD and probably download it using not-so-legal means, but it is streaming nowhere. “It was just, like, wiped out of existence,” co-executive producer Michael Angeli told me. “It’s conspicuous in its absence.”</p><p id=\"uy4mP4\">It’s unfortunate that the show has been buried under the rug because it’s a powerful and gritty examination of professional football, and it holds up nearly two decades later. <em>Playmakers</em> details the lives of athletes on the fictional Cougars. A harsh and realistic characterization of pro football, the pilot opens with middle linebacker Eric Olczyk feeling enormous guilt about accidentally paralyzing a member of the opposing team. We later meet rookie running back Demetrius Harris, who is addicted to crack and other drugs; the team’s extremely unlikeable owner, who does everything he can to help Harris hide his drug use and involvement in violent crimes from the league; and a veteran back trying to become a starter again, even if it means taking performance-enhancing drugs.</p><div class=\"c-float-right\"><aside id=\"BZPPtw\"><q>“I had no expectation that it would be controversial,” Eisendrath told me. “I was clearly naive.”</q></aside></div><p id=\"usfomc\">So it’s not particularly surprising that the NFL wasn’t too keen on a show that focused on the darker side of their sport. At the time, commissioner Paul Tagliabue <a href=\"https://www.nytimes.com/2004/02/05/sports/pro-football-citing-nfl-espn-cancels-playmakers.html\">said</a> <em>Playmakers </em>was “one-dimensional and traded in racial stereotypes” and a “gross mischaracterization of our sport.” But the show was nevertheless positively received by NFL players and critics alike. The <em>New York Times</em> called <em>Playmakers</em> “well written and well acted… professional football as observed by Joan Didion rather than John Madden.” Deion Sanders <a href=\"https://www.nytimes.com/2004/02/05/sports/pro-football-citing-nfl-espn-cancels-playmakers.html\">reportedly</a> thought it was a realistic portrait of the NFL, and the show’s creator John Eisendrath said that he heard that “there were a lot of players who loved it.” He remembered that when it was on the air, Philadelphia Eagles quarterback Donovan McNabb was “outspoken and supportive of it.”</p><p id=\"O05Gpx\">“I had no expectation that it would be controversial,” Eisendrath told me. “I was clearly naive.” He said that he wrote the show because he wanted to explore male relationships and thought sports would provide good “scaffolding” to talk about the emotional lives of men.</p><p id=\"tvsFJi\">“I imagined what the individual players are afraid of, and what in their individual lives scared them the most, and built the whole thing based on the emotion of fear,” he said. “I think that is a huge component of sports: the fear of being hurt, the fear of hurting someone, the fear of failure, the fear of being replaced.”</p><p id=\"M86LWA\">Consulting producer Charles Holland told me he was disappointed when he learned it got canceled because he loved writing for the show, but your show getting canceled is just part of the reality of working in Hollywood. “The late Steven Bochco once told me that every single show you ever do is going to be canceled. It’s just a question of when,” he said.</p><p id=\"KgA90Z\">Despite the show’s popularity, no other network picked it up. “We tried to sell it somewhere else,” Angeli said. “No one wanted to touch it. I’m sure it was because the NFL exerted pressure on everybody.”</p><p id=\"905B6r\">For the past decade, we’ve been having more frank conversations about the realities of the NFL: the effects of CTE, the pervasiveness of domestic abuse, the league silencing the protests of its players, and most recently, its racist hiring practices. In many ways, <em>Playmakers</em> was dramatizing many of these things before they’d become widely known. “It’s the best product made about football, and I think we definitely suffered from being ahead of our time,” Holland said.</p><div class=\"c-float-right\"><aside id=\"JkiaZQ\"><q>“You cannot touch the world of major league sports.”</q></aside></div><p id=\"egMOki\">I suggested to Eisendrath that perhaps it could’ve been picked up by a streamer like Netflix had it been on the air 10 years later. After all, <em>Friday Night Lights</em>, another football series, was saved by DirecTV after getting dropped by NBC.</p><p id=\"5F0GrI\">“No fucking way,” he replied. It’s why no show has approached the world of professional sports with the same brutal honesty since <em>Playmakers </em>aired. While <em>Friday Night Lights</em> wrestled with injury, race, and class, it was contained to high school football and didn’t take shots at the NFL. Today, the league’s TV rights are among the most competitive among networks and streaming platforms — the next decade <a href=\"https://www.npr.org/2021/03/19/979178471/new-113-billion-nfl-media-rights-deal-gives-fans-more-options-to-watch-games\">worth over $100 billion</a>. </p><p id=\"TT42FN\">“More so today than ever, the most powerful among the most powerful people in Hollywood are the heads of the commissioners of major league sports. The reason they’re so powerful is because sports is the sole remaining juggernaut of live TV ratings,” Eisendrath said. “And that is why there hasn’t been a single show like <em>Playmakers</em> that has come on since. You can dramatize any occupation in America: doctors, lawyers, cops. You can show them doing anything. You can show the president getting a blowjob in the White House. But you cannot touch the world of major league sports.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/J4wKMrqq21xxzhZChsZYonOSdfk=/0x358:2400x1615/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23224476/003.jpg",
  "description": "\"It was just, like, wiped out of existence.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}