{
  "title": "The government is investigating Amazon’s severe weather event rules following deaths ",
  "url": "https://www.theverge.com/2022/4/1/23006449/amazon-investigation-oversight-reform-committee-us-house-edwardsville-tornado",
  "date": "2022-04-01T20:33:53.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ecH9z7lKx0Ai1v2FkUrcSbDY6jw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70700022/acastro_181114_1777_amazon_hq2_0004.0.jpg\" />        <figcaption><em>The Oversight Committee is demanding answers.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"mDKsPA\">The House Committee on Oversight and Reform has launched an investigation into Amazon’s labor practices around severe weather events, focusing on the company’s Illinois warehouse where <a href=\"https://www.theverge.com/2021/12/11/22829363/amazon-warehouse-tornado-collapse-edwardsville-illinois\">six people died in a tornado</a> strike last winter. </p><p id=\"PPBY4P\">The committee is seeking documents and communication records from Amazon within the next two weeks, according to <a href=\"https://oversight.house.gov/sites/democrats.oversight.house.gov/files/2022-03-31.CBM%20AOC%20Bush%20to%20Jassy-Amazon%20re%20Document%20Request.pdf\">a letter</a> signed by Reps. Carolyn B. Maloney (D-NY), Alexandria Ocasio-Cortez (D-NY), and Cori Bush (D-MO) and sent Thursday to Amazon CEO Andy Jassy.</p><p id=\"6JV4Mn\">The letter cites reports that Amazon threatened to fire employees if they left work as the tornado bore down on the area and that delivery dispatchers <a href=\"https://www.theverge.com/2021/12/17/22841667/amazon-delivery-driver-illinois-tornado-warehouse-destruction\">weren’t allowed to call drivers back without Amazon’s approval</a>, even when there was an active tornado warning. The storm ended up hitting an Amazon warehouse, which <a href=\"https://www.theverge.com/2021/12/11/22829363/amazon-warehouse-tornado-collapse-edwardsville-illinois\">collapsed and killed six people</a>. </p><aside id=\"l5LxOo\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How Amazon warehouse policies put workers at risk\",\"url\":\"https://www.theverge.com/22836393/amazon-warehouse-tornado-collapse-illinois-disaster\"}]}'></div></aside><p id=\"xdvLzC\">The committee is seeking an extensive amount of information from Amazon — the letter requests documents about the company’s emergency preparedness requirements, the drills it carried out in Edwardsville, and logs of “all communications between managerial staff, employees, or contractors regarding employment responsibilities and company protocol during the severe weather events,” among other things. </p><p id=\"CeAApl\">Lawmakers also want documentation on Amazon’s internal reviews or investigations into the events in Edwardsville, as well as information on any discipline employees and contractors faced in Illinois and other locations. Amazon is requested to produce the documents by April 14th.</p><p id=\"yUshv8\">The legislators also bring up concerns that have arisen at other Amazon warehouses — some of the information requests pertain to Amazon staff being told to keep working during wildfires in California, extreme heatwaves in Washington and Oregon, and hurricanes in 2017 and 2018. </p><p id=\"UFMt57\">This isn’t the first government investigation into Amazon’s warehouse practices in Edwardsville. Two groups of lawmakers <a href=\"https://www.theverge.com/2021/12/20/22845309/warren-bush-aoc-amazon-letter-tornado-warehouse-deaths\">sent letters demanding answers</a> in December, and the Occupational Safety and Health Administration (OSHA) <a href=\"https://www.theverge.com/2021/12/13/22833012/amazon-fatal-warehouse-collapse-osha-investigation-illinois-tornado\">opened its own investigation</a>. </p><p id=\"2GMWQP\">Amazon didn’t immediately respond to <em>The Verge’s</em> request for comment, but one of its spokespeople <a href=\"https://www.nytimes.com/2022/04/01/technology/amazon-labor-practices.html\">told <em>The New York Times</em></a>: “Our focus continues to be on supporting our employees and partners, the families who lost loved ones, the surrounding community, and all those affected by the tornadoes. We will respond to this letter in due course.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fhTpM7RsSd5QYNKxgAePu6s5uWA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443464/acastro_181114_1777_amazon_hq2_0004.jpg",
  "description": "Lawmakers are pushing Amazon after a deadly tornado.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}