{
  "title": "The Dropout on Hulu makes an unconvincing case for Elizabeth Holmes’ humanity",
  "url": "https://www.theverge.com/2022/2/25/22948048/the-dropout-review-hulu-elizabeth-holmes",
  "date": "2022-02-25T17:01:01.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gQalmNPE0guX1m_xHUjPcW5MO2c=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70550291/dropout_105_bd_01682rt.0.jpeg\" />        <figcaption>Hulu</figcaption>    </figure>  <p>Amanda Seyfried stars as Theranos founder Elizabeth Holmes</p> <p class=\"p--has-dropcap\" id=\"gwncT5\">Theranos founder <a href=\"https://www.theverge.com/2021/11/30/22811246/elizabeth-holmes-texts-control-theranos-money\">Elizabeth Holmes</a> was a subject of fascination within Silicon Valley and the tech press even before her eventual downfall and recent <a href=\"https://www.theverge.com/2022/1/3/22865362/theranos-elizabeth-holmes-wire-fraud-verdict-guilty\">conviction for defrauding investors</a>. But <a href=\"https://www.theverge.com/2022/2/7/22922126/the-dropout-trailer-amanda-seyfried-elizabeth-holmes\">Hulu’s <em>The Dropout</em></a><em> </em>is confident there are still people out there dying to know more about the woman behind the disruptive medtech unicorn that could have been.</p><p id=\"17SfhR\">Adapted from <a href=\"https://www.theverge.com/2019/2/10/18216012/dropout-podcast-abc-series-theranos-elizabeth-holmes\">ABC News’ investigative true crime podcast</a> of the same name hosted by Rebecca Jarvis, and produced by Taylor Dunn and Victoria Thompson, <em>The Dropout </em>chronicles Holmes’ (Amanda Seyfried) journey from being just another Stanford dropout with a half-baked dream to becoming one of the most infamous American CEOs of the 21st century. </p><p id=\"8PZciC\">Like the podcast, the new Hulu show — which Jarvis, Dunn, and Thompson co-executive produced along with series director Michael Showalter —  sets out to both entertain and inform as it lays out a timeline of events beginning in Holmes’ childhood and culminating in 2015 as <em>The</em> <em>Wall Street Journal</em>’s Theranos reporting began to expose the company’s troubles. Though <em>The Dropout</em>’s dramatization of past events pulls heavily from the podcast’s reporting, the show is far more comfortable editorializing with a story that somewhat sympathetically frames Holmes not simply as a visionary-turned-fraudster, but also as a woman navigating the treacherous and broadly sexist world of multimillion-dollar tech startups.</p>  <figure class=\"e-image\">        <img alt=\"Elizabeth Holmes sitting before a Yoda quote mural as she’s about to be interviewed.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/l0jBrIbrWgRnLkOylXUcd2070Hg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23267922/dropout_106_md_03842rt.jpeg\">      <cite>Hulu</cite>      <figcaption>Holmes preparing to be interviewed at Theranos HQ.</figcaption>  </figure><p id=\"2gioib\">Much like Holmes herself, <em>The Dropout </em>is as focused as it is busy. Its first few episodes jump back and forth in time between various moments from Holmes’ past, and in 2017 as she’s being deposed by the Securities and Exchange Commission ahead of <a href=\"https://www.theverge.com/2018/3/14/17120236/theranos-elizabeth-holmes-fraud\">being charged in 2018</a>. After opening on Seyfried’s nervous tick-driven Holmes at a point when the public still took the <a href=\"https://www.theverge.com/22656190/theranos-elizabeth-holmes-wire-fraud-trial-founder-myth\">carefully-constructed idea of Elizabeth Holmes, blood wunderkind</a>, at face value, <em>The Dropout</em> tries to make you understand how she got there by zeroing in on important chapters from her past that she carried into the future. </p><div class=\"c-float-right c-float-hang\"><aside id=\"nkCjpG\"><q>Much like Holmes herself, <em>The Dropout </em>is as focused as it is busy</q></aside></div><p id=\"KTr7lJ\"><em>The Dropout </em>suggests the root of Holmes’ ambition and fixation with money is her relationships with her somewhat overbearing mother Noel (Elizabeth Marvel) and father Chris (Michel Gill), a recently laid-off Enron vice president. As the Holmes family’s pre-Theranos money troubles begin to loom, their uneasy competition with neighbor Richard Fuisz (William H. Macy), a physician and inventor who expresses interest in learning more about Elizabeth’s nascent work, intensifies and <em>The Dropout </em>presents all of these as major data points necessary to understanding the sort of person Holmes becomes.</p><p id=\"H4HKHs\">The true focus of <em>The Dropout </em>is exploring the circumstances of Holmes’ life and her relationships as a <a href=\"https://www.theverge.com/2021/12/15/22834892/elizabeth-holmes-theranos-trial-investors-money\">commentary on the culture</a> that gave birth to the concept of $1 billion unicorns.  <em>The Dropout </em>creates the impression it’s that same culture that pushes Holmes to study abroad in Beijing where she meets Ramesh “Sunny” Balwani (Naveen Andrews), a man nearly two decades her senior, with whom she forges an awkward friendship that evolves into an unsettling and <a href=\"https://www.theverge.com/2021/11/29/22809049/elizabeth-holmes-sunny-balwani-abuse-fraud\">sometimes violent romantic and working relationship</a> as the series progresses. </p>  <figure class=\"e-image\">        <img alt=\"Sunny Balwani and Elizabeth Holmes staring at their reflections in a mirror together.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oR9l6zP6GPryrx0OsCBQ-FRRX1E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23267929/dropout_103_bd_05256rt.jpeg\">      <cite>Hulu</cite>      <figcaption>Balwani and Holmes sharing a tense moment in front of a mirror.</figcaption>  </figure><p id=\"rVeCM8\">Though each of <em>The Dropout</em>’s big plot points is based in reality, because the show weaves them all together into a singular narrative, it can read as the continued mythologization of Holmes — here set to a soundtrack of early-aughts hits like <a href=\"https://www.youtube.com/watch?v=3O3148VwWtw&amp;ab_channel=crunchgear\">Passion Pit’s “Sleepyhead”</a> and <a href=\"https://www.youtube.com/watch?v=sijSh4tMPVg&amp;ab_channel=TheiPodSpot\">Feist’s “1234.”</a></p><p id=\"mzO7MM\">Fuisz and Balwani are just two of the older, powerful men who come into Holmes’ life either looking to challenge or take advantage of her in some way. And while <em>The Dropout </em>doesn’t depict them as being part of a grand nefarious project working to take Holmes down, it does make a point of highlighting how figures like them have been ever-present in her story. This is what makes <em>The Dropout </em>both somewhat dubious as an account of how Holmes got into a life of white-collar crime, and kind of interesting as a takedown of Silicon Valley itself as it begins to surrender to the Jobsian distortions of reality emanating from Theranos HQ.</p><div class=\"c-float-left c-float-hang\"><aside id=\"zg9HDz\"><q>The Dropout far more interested in exploring Holmes’ life to comment on Silicon Valley culture</q></aside></div><p id=\"tibyIF\"><em>The Dropout </em>takes a good long while before it trains its focus on specific bits of deception and manipulation Holmes used to convince people like Stanford professor Channing Robertson (Bill Irwin), economist George Schultz (Sam Waterston), and biochemist Ian Gibson (Stephen Fry) to trust her. In doing so, the show uses its supporting cast to illustrate the degree to which people were willing to enable Holmes — sometimes knowingly — in order to feel better about themselves or to support causes larger than any of them as individuals, like the push to combat misogyny in tech. Because of this, though, <em>The Dropout </em>often feels as if it’s handling Holmes’ story with kid gloves, and only feels comfortable being critical of her in moments that lend themselves to depicting her as cartoonishly-awkward and inept at interacting with other people.</p><p id=\"muz5o0\">For all the punches that <em>The Dropout</em>’s script seems like it’s pulling, Seyfried’s performance hits hard: she churns out a studied barrage of Holmes’ quirks much in the same way that <a href=\"https://www.theverge.com/22858603/theranos-elizabeth-holmes-blood-testing-future\">Theranos’ malfunctioning machines</a> spit out blood. Though everyone’s going to be fixated on the sound of Seyfried’s take on <a href=\"https://www.thecut.com/2019/03/why-did-elizabeth-holmes-use-a-fake-deep-voice.html\">Holmes’ voice</a>, what’s infinitely more fascinating (and telling about the show) is how the voice is first introduced, and how it goes on to wax and wane like <a href=\"https://www.digitalspy.com/tv/ustv/a36759564/wandavision-scarlet-witch-accent-elizabeth-olsen/\">the Scarlet Witch’s Sokovian lilt</a>. Rather than just speculating about whether Holmes affects her speaking voice, <em>The Dropout </em>presents her tone, as well as her mannerisms and fashion sense, as modular aspects of her identity that she haphazardly learns to swap out in efforts to impress people. </p>  <figure class=\"e-image\">        <img alt=\"Holmes attending a ribbon cutting ceremony with her new Walgreens partners.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/h7O9Hc8u_nJ0jcQlf6CQ1ifZyHI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23267943/dropout_105_bd_03876rt.jpeg\">      <cite>Hulu</cite>      <figcaption>Holmes attending a ribbon cutting ceremony with her new Walgreens partners.</figcaption>  </figure><p id=\"pjUbE5\">As odd as Seyfried’s Holmes looks and sounds standing in front of a mirror while practicing phrases using the lower register of her speaking voice, <em>The Dropout </em>also tries to underline how that kind of reinvention of the self is something that nearly everyone does — especially those trying to succeed in professional settings where people like them have been historically shut out. Just as the show begins to broach his idea a bit more deeply through its depiction of early Theranos hire Ana Arriola (Nicky Endres), <em>The Dropout </em>sort of drops it in favor portraying all of Holmes’ eccentricities — like lying to investors — as reflexive <a href=\"https://www.theverge.com/2021/8/28/22646130/theranos-elizabeth-holmes-sunny-balwani-abuse-fraud\">defenses that spring up in response to pressure and fear</a>.</p><p id=\"EKOyE4\"><em>The Dropout </em>never goes so far as to say that Holmes isn’t responsible for her actions. But it does ask you to wonder with whom culpability lies in an industry where faking it until one makes it is how many successful people have played the game. These are things worth reflecting on, but as you get deeper into <em>The Dropout</em>’s eight episodes, the show feels increasingly hesitant to let itself and the audience slow down and sit with how bad things became at <a href=\"https://www.theverge.com/2021/12/9/22820995/elizabeth-holmes-theranos-trial-testimony-defense-abuse\">Theranos under Holmes’ supervision</a>.</p><p class=\"c-end-para\" id=\"Ih4BY8\">When you look at <em>The Dropout </em>as part of the larger constellation of Holmes-related media that’s come out over the past few years, it’s hard to say what exactly the show brings in terms of new insight or clarity into Holmes’ thinking. As a piece of entertainment tailor-made for <a href=\"https://deadline.com/2020/12/podcasts-hollywood-film-tv-adaptations-trend-deals-1234636040/\">Hollywood’s current obsession</a> with <a href=\"https://www.wbur.org/hereandnow/2021/10/01/true-crime-white-women\">true crime podcasts</a> shot through with <a href=\"https://www.motherjones.com/media/2020/06/true-crime-podcasts-white-women/\">a very two-dimensional strain of white feminism</a>, however, <em>The Dropout </em>makes perfect sense.</p><p id=\"VEsXlG\"><small><em>The Dropout </em></small><small>also stars Anne Archer, Michaela Watkins, Kate Burton, Utkarsh Ambudkar, Michael Ironside, Laurie Metcalf, Ebon Moss-Bachrach, Kevin Sussman, LisaGay Hamilton, and Kurtwood Smith. The series hits Hulu on March 3rd.</small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SgvWLwMslRcqXZHMIwhy2CEmxdw=/0x0:6000x3141/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23267898/dropout_105_bd_01682rt.jpeg",
  "description": "The Droput’s story tries and fails to humanize Elizabeth Holmes",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}