{
  "title": "The defunct LG Wing is getting Verizon C-band, because 5G in this country is silly",
  "url": "https://www.theverge.com/2022/5/17/23097651/lg-wing-verizon-5g-c-band",
  "date": "2022-05-17T22:08:40.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/tHuy2TlZBES25s84_Z1J1-bU7Rs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70880694/cgartenberg_201022_4254_0009.0.0.jpg\" />        <figcaption><em>The LG Wing is cleared for takeoff on Verizon’s newest 5G spectrum.</em> | Photo by Chaim Gartenberg / The Verge</figcaption>    </figure>  <p id=\"ME5rWl\">Verizon announced this week that <a href=\"https://www.theverge.com/21536659/lg-wing-review-dual-screen-price-specs-features\">the LG Wing</a> will be getting an update that will allow it to use Verizon’s newest 5G spectrum — over a year after LG left the smartphone business altogether. The LG Wing has been certified to use mid-band spectrum called C-band, an important piece of Verizon’s 5G network that delivers better-than-LTE speeds and wide-ranging signal. Verizon spokesperson George Koroneos says that the update started arriving on devices yesterday and will continue to be pushed out through the rest of the week. </p><p id=\"kp9SGV\">That’s good news if you’re one of the few people who bought an LG Wing, and really a testament to LG for <a href=\"https://www.theverge.com/2021/4/4/22346084/lg-exits-smartphone-business\">making good on its promise</a> to keep providing some support for its devices. But why is a one-and-a-half-year-old phone from a defunct mobile brand getting this update now, when, say, <a href=\"https://www.theverge.com/2022/3/22/22991308/google-pixel-4a-5-5a-5g-c-band-pixel-6-software\">last year’s Google Pixel 5A isn’t</a>? Because 5G in this country is still a mess, that’s why. </p><div class=\"c-float-right\"><aside id=\"enXvnk\"><q>Their efforts to win the “race to 5G” has resulted in a confusing patchwork of network frequencies</q></aside></div><p id=\"xZVn0u\">Carriers have been frantically gathering 5G spectrum over the past few years in an effort to <a href=\"https://www.theverge.com/2019/5/23/18637213/5g-race-us-leadership-china-fcc-lte\">win some imagined race</a>. While AT&amp;T and Verizon had to wait to get ahold of their share of the all-important mid-band spectrum, they got creative and did things like <a href=\"https://www.theverge.com/2020/5/20/21265048/att-5g-e-misleading-advertising-recommendation-narb\">re-packaging LTE as “5G Evolution”</a> and <a href=\"https://www.theverge.com/22968066/apple-iphone-se-5g-mmwave-verizon-uw\">pretending that mmWave would be the future</a>. Meanwhile, T-Mobile gobbled up the country’s fourth wireless carrier for its mid-band spectrum and its replacement has been <a href=\"https://www.theverge.com/2022/2/24/22949389/dish-network-5g-las-vegas\">floundering with endless delays</a>.</p><p id=\"KVFGV1\">Their efforts to win the “race to 5G” has resulted in <a href=\"https://www.theverge.com/22914668/5g-uw-uc-icon-meaning-verizon-att-t-mobile\">a confusing patchwork of network frequencies</a> that require the right hardware, software, and FCC clearances to use them. With so many hoops to jump through, manufacturers like Google can launch a phone that <em>could</em> support C-band, but ultimately decide not to clear the final hurdle to certify it on the carrier’s network. </p><p id=\"SB10Id\">This isn’t something you need to worry about if you buy a new 5G phone through your carrier — it will almost certainly work with whatever 5G network they’re currently promoting. But if you have a 5G phone from your carrier that’s a year or two old, or an unlocked phone, it’s much less clear which networks they’ll support and which ones they won’t. LG may not have figured out the smartphone business, but at least they got that part right.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/33Wa7AuP4pC6Scm-nZ63DF_I24g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21990608/cgartenberg_201022_4254_0009.0.jpg",
  "description": "An oddball flagship phone from 2020 gets new 5G support.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}