{
  "title": "The dinos have already won in Jurassic World Dominion’s new trailer",
  "url": "https://www.theverge.com/2022/2/10/22927076/jurassic-world-dominon-trailer",
  "date": "2022-02-10T15:08:58.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sBVkdaPcd0JU65vULroPLEPrCYE=/788x0:6706x3945/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70492879/JurassicWorld.0.jpeg\" />        <figcaption>Universal Pictures</figcaption>    </figure>  <p id=\"axQadT\">At this point in the <a href=\"https://www.theverge.com/2018/6/6/17434496/jurassic-world-fallen-kingdom-review-chris-pratt-bryce-dallas-howard\"><em>Jurassic World</em> franchise</a>, humanity’s more or less just there to make sure that the dinosaurs have enough to eat as they once again ascend to the top of food chains across the entire planet. <a href=\"https://www.theverge.com/2019/9/25/20883094/jurassic-park-3-sam-neill-laura-dern-jeff-goldblum\">Everyone in <em>Jurassic World Dominion</em></a>’s latest trailer can feel this undeniable truth creeping up on them — not because of some sort of deep sense about how the balance of power is shifting on the planet, but because they can literally see living dinosaurs running around in their backyards like they run the place.</p><p id=\"dbWgkw\">The new trailer once again introduces us to dino-whisperer Owen Grady (Chris Pratt) and former Jurassic Park operations manager Claire Dearing (Bryce Dallas Howard) as the world continues to deal with the fallout of Dr. Henry Wu’s (B.D. Wong) groundbreaking research. With multiple species of dinosaurs having made the jump from Isla Nubar, it’s become common, apparently, to see packs of raptors trekking through frozen landscapes and for raptors and T-rexes to somehow wind up in what appears to be an Italian city center. </p><p id=\"5zcb6x\">Prepared as Owen and Claire are to deal with the creates, much of the public’s understandably terrified as the very real possibility of dying in a dino attack, and it’s possible that Dr. Alan Grant (Sam Neill), Dr. Ellie Sattler (Laura Dern), and Dr. Ian Malcolm (Jeff Goldblum) are going to be pulled into this story to help keep the peace. Stunning as <em>Dominion</em>’s visuals seem like they’re going to be, the trailer still raises the question of where <em>Jurassic World </em>plans to go now that the thing the humans were always worried about has come to pass.</p><p id=\"v8iWD8\"><em>Jurassic World Dominion</em> also stars DeWanda Wise and hits theaters on June 10th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OKs3SJ7G0ozM3um5lZ6vJGMd1QY=/0x12:7493x3935/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23232133/JurassicWorld.jpeg",
  "description": "Jurassic Park’s latest trailer teases the end of humanity.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}