{
  "title": "The man who got fired by his DAO",
  "url": "https://www.theverge.com/22928769/web3-ethereum-name-service-ens-tokens-voting-dao",
  "date": "2022-02-11T17:45:17.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"Cryptocurrency Companies Photo Illustrations\" src=\"https://cdn.vox-cdn.com/thumbor/ymgbK1TvvRGDAPQCT-zUamiMbXk=/0x0:2971x1981/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70498487/1235570383.0.jpg\" />        <figcaption>Photo illustration by Jakub Porzycki/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"zju4wI\">One of the many aspirations for “web3” is that you could potentially take certain messy, emotional human processes and clean them up by putting them on the blockchain. “Smart contracts” write their terms directly into code, and actions they take are both public and irreversible. Enthusiasts believe this sort of “trustless” system can enable people come together to work on projects that they otherwise might not.</p><p id=\"9Gp2ID\">If you get enough of those people together to work on a project, you might have a decentralized autonomous organization, or <a href=\"https://ethereum.org/en/dao/\">DAO</a>. The Ethereum network, on which many DAOs run, describes them as “a safe way to collaborate with internet strangers.” Remember when thousands of people came together within days <a href=\"https://www.theverge.com/22820563/constitution-meme-47-million-crypto-crowdfunding-blockchain-ethereum-constitution\">to raise $47 million in an effort to buy a copy of the Constitution</a>? A DAO is how they did it.</p><div class=\"c-float-left\"><aside id=\"xBt1Kk\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"From a meme to $47 million: ConstitutionDAO, crypto, and the future of crowdfunding\",\"url\":\"https://www.theverge.com/22820563/constitution-meme-47-million-crypto-crowdfunding-blockchain-ethereum-constitution\"}]}'></div></aside></div><p id=\"AjZbIk\">DAOs can be governed in various ways, and one way is to issue governance tokens. The cryptocurrency exchange platform Uniswap, for example, issued tokens to community members, employees, investors, and advisers, and lets them vote on “development proposals.” Imagine that Instagram let you vote on which features it should develop next, and you’ve got the basic idea.</p><p id=\"Cn8FdC\">One web3 startup that created a DAO is <a href=\"https://ens.domains/\">Ethereum Name Service</a>, or ENS. If you’ve been on Twitter and seen someone whose username ends in “.eth,” you’ve found an ENS customer. ENS handles can be bought and sold like web domain names, and could represent the start of an identity layer for web3: like logging in with your Facebook account, but for crypto. (The project is still quite small, by the standards of the wider internet: ENS says about 300,000 people have registered names to date.)</p><p id=\"MZH4lN\">I became familiar with ENS last summer as I began to familiarize myself with the crypto world. My goal was not to become a trader or investor. Rather, I wanted to use crypto products <em>just</em> enough to get the hang of them, so that I might ask better questions and write more interesting stories. And so I set up a couple crypto wallets, one with Coinbase and one with a company called Rainbow, and funded them with $100 each in ETH, the currency of Ethereum.</p><div class=\"c-float-right\"><aside id=\"m8YIZY\"><q>What seemed like a low-stakes exploration was about to become more</q></aside></div><p id=\"qdls47\">I tweeted something about these explorations, and some nice people at Rainbow reached out and asked if I had considered setting up a name on ENS. I hadn’t, but when I looked at its website, I saw the appeal. My crypto identity at the moment consisted of an un-memorizable string of letters and numbers. With ENS, I could simply be caseynewton.eth. So I registered that name, along with platformer.eth, for what struck me as the bargain price of $5 per year apiece.</p><p id=\"sZTTb3\">I have since done nothing of use with my new web3 identities, because at the moment there is basically nothing to do other than to log into cryptocurrency exchanges.</p><p id=\"j0WgrD\">Anyway, on November 1st, a few months after I had acquired my .eth names, ENS announced a DAO. Here it’s worth saying that ENS has a confusing organizational structure, even by the standards of web3. As best as I understand it, there is a Singapore-based nonprofit company named <a href=\"https://ens.mirror.xyz/qjlFjV5QSs17li8Tu5O6_7WoSMEak2D1YP0ED-Mp-GA\">True Names Limited</a> that leads and supports ENS. ENS itself is a decentralized protocol that runs autonomously.</p><p id=\"qKD4R4\">The DAO represents a further effort to decentralize the project. Brantly Millegan, who was then the director of operations at ENS and the project’s de facto spokesman <a href=\"https://coinmarketcap.com/alexandria/article/a-deep-dive-into-how-the-top-daos-work\">described the effort this way</a>:</p><blockquote><p id=\"cQVs1z\">The core components of ENS are decentralized and self-running (e.g., no one can take away another person’s .ETH name), but there are a few things that require some human discretion. We believe that both ENS and the DAO space have matured enough that now is the time to pass ENS governance over to the community via the creation of a DAO and the $ENS governance token.</p></blockquote><p id=\"MFjOpb\">If you owned a .eth address on October 31, you could claim your share of governance tokens. The precise number was determined by how long you had held your name, how many names you had registered, and how active you had been in the community. Once you claimed your tokens, you could use them to vote on proposals directly, or you could delegate your vote to someone you trusted.</p><p id=\"WEiGXm\">I had no particular opinions on how ENS should be run; most of what I know about the company I learned writing this column. In November, though, this seemed like exactly the sort of exploration of crypto I had hoped to undertake when I began the project: a low-stakes effort to understand DAOs and community governance by becoming a passive participant.</p><p id=\"AaHudC\">I bought a little more ETH to cover the transaction fees — here is your periodic reminder that Ethereum is the slowest, and most expensive, and hardest to use computer in the world — and soon, 251 ENS tokens belonged to me. I delegated their voting power to someone I follow on Twitter, and stopped thinking about it.</p><p id=\"e0Zk84\">It was then that something unexpected happened: the ENS tokens, which can be bought and sold on cryptocurrency markets, quickly became very valuable. At one point, the crypto wallet showed the value of my holdings at more than $20,000. As a journalist who had yet to fully consider an ethics policy around crypto usage, this struck me as a fairly catastrophic (if hilarious) development. This was more crypto than I had ever intended to own, and worse, I might need to write about this company someday, at which point my token ownership would leave me hopelessly compromised.</p><p id=\"LNi9QD\">While I thought the problem through, the news cycle forced my hand.</p><p id=\"W02c8S\">Specifically, Brantly Millegan forced my hand.</p><hr class=\"p-entry-hr\" id=\"9TKGNf\"><p id=\"smMP2y\">In keeping with the complex nature of the ENS project, Millegan served many roles. For three years he was director of operations of True Names Limited. When the DAO was formed, he became one of a handful of official “stewards” guiding its development; and also as its top delegate, receiving more delegated votes than any other person or company. (Coinbase and Rainbow are also top delegates in the ENS DAO.) There’s more: the ENS tokens are governed by a separate foundation; Millegan was (is?) a director.</p><p id=\"9pzwwH\">In recent weeks, as their profile grows, some leaders in the web3 community have been the subject to one of the world’s most dangerous acts of scrutiny: a search through their old tweets. Last month, the investor and influencer Cooper Turley <a href=\"https://www.coindesk.com/business/2022/01/15/crypto-influencer-cooper-turley-removed-from-fwb-over-2013-bigoted-tweets/\">was removed from the Friends With Benefits DAO</a> after he was found to have used racist and homophobic in a series of 2013 tweets. (He <a href=\"https://twitter.com/Cooopahtroopa/status/1481060726307500038?s=20\">apologized</a>.) This week, a community manager for the NFT trading platform SuperRare “parted ways” with the company after <a href=\"https://web3isgoinggreat.com/?id=2022-02-07-2\">some old, racist tweets were unearthed</a>.</p><div><aside id=\"lVJ0m4\"><q>“nice to see some ppl finally read the first word of my bio”</q></aside></div><p id=\"tzBMul\">Millegan is Catholic, and holds reactionary conservative views. In 2016 he<a href=\"https://discuss.ens.domains/t/ens-dao-next-steps-re-brantly/10424\"> tweeted</a>: “Homosexual acts are evil. Transgenderism doesn’t exist. Abortion is murder. Contraception is perversion. So is masturbation and porn.”</p><p id=\"lCsKb9\">When asked about this Saturday, Millegan — whose Twitter bio identifies him as Catholic — doubled down. “hey looks like I’ve got my first mob,” <a href=\"https://twitter.com/BrantlyMillegan/status/1490143924895334400\">he tweeted</a>. “nice to see some ppl finally read the first word of my bio. I love you all, I’m gonna keep working on web3.”</p><p id=\"SriwTe\">Members of the ENS community lambasted Millegan, both for making his original comments and standing by them. Twitter suspended his account. In the ENS Discord server, Millegan wrote that despite his views he had “never excluded anyone from ENS or my work (or even my personal life) because of who hey are or what they believed.” He<a href=\"https://twitter.com/nicksdjohnson/status/1490398146077540352/photo/1\"> went on</a>:</p><blockquote><p id=\"z1Dezy\">I believe in working with, and also being friends with, a wide range of people. … Yes, I believe Catholic doctrine (not a secret), and I’m not changing that, and I don’t think it’s practical or moral for the web3 industry to exclude the many traditional-minded Christians, Muslims, Jews and others who agree with me. I’m obviously aware many people disagree with me and that’s fine. I believe in tolerance with a wide net, I live that out, and I ask others to give me and other the same.</p></blockquote><p id=\"0qBlHO\">Typically in this case, the decision about what to do next is left entirely to the head of the company. That can be frustrating to the employee, who often has no recourse; and to the public, which is instead left to campaigning on Twitter, organizing boycotts, or other indirect protests.</p><p id=\"3KG0Xv\">Millegan’s case was different, though, because of the DAO.</p><p id=\"oOSCcZ\">In the aftermath of his tweets, some members of the ENS community saw an opportunity. The nonprofit <a href=\"https://she256.org/\">she256</a>, which works on diversity and inclusion initiatives in web3, <a href=\"https://twitter.com/she_256/status/1490452162098262016?s=20&amp;t=OPzJv4OzZ5U1DbP0Q3N88g\">tweeted Sunday</a> that the Millegan affair represented “a chance for the collective to take action, and make this a reality.” It added: “To the ENS community — the power is literally in *your* hands.”</p><p id=\"Yvwxhv\">Normally people would just have to keep tweeting about ENS or stage some kind of boycott. But because of the ENS DAO, they had an alternate approach. They could remove him from his steward role, <a href=\"https://www.theverge.com/2022/2/7/22921674/ethereum-name-service-ens-remove-director-operations-resurfaced-tweet-brantly-millegan\">which they did</a>. And they could re-delegate their tokens away from him. (ENS eventually <a href=\"https://twitter.com/nicksdjohnson/status/1491229564676501509\">created a way</a> for people who have at least 100 tokens to re-delegate them without paying transaction fees.)</p><p id=\"Ll90Nu\">Over the weekend, I attended a Twitter Spaces conversation in which members of the ENS community discussed the situation. Many came forward to share anguish over Millegan’s remarks. But there was a sense of empowerment, too — a feeling that web3 could be different than web 2.0, because this time around there are smart contracts, and governance tokens, and the unique leverage of a blockchain.</p><p id=\"jKNVCS\">The DAO prevailed. Late Sunday night, Nick Johnson, ENS’ founder and lead developer, announced that Millegan’s contract at True Names Limited had been terminated. “Brantly has been a valued team member of TNL for the past three years,” <a href=\"https://twitter.com/nicksdjohnson/status/1490581940839546883\">Johnson wrote</a>. “However, as a team we felt that his position with TNL is no longer tenable.”</p><p id=\"anL2UH\">But the DAO cuts both ways. While Millegan no longer works for ENS, <a href=\"https://www.withtally.com/governance/eip155:1:0x323A76393544d5ecca80cd6ef2A560C6a395b7E3/voters\">he continues to be the project’s top vote delegate</a>. The decentralized, self-running aspects of ENS meant that Millegan can continue to exert influence over the project.</p><p id=\"8gAHJV\">I asked Millegan if he wanted to talk.</p><p id=\"jzWxmG\">“I don’t have a comment except to say that I had multiple roles at different entities, and from a procedural standpoint what’s happening is a bit complicated,” he told me over email.</p><p id=\"Ic2QdS\">ENS did not respond to my request for comment.</p><hr class=\"p-entry-hr\" id=\"PFuJhH\"><p id=\"lN72un\">What do we make of the man who was fired by his own DAO?</p><p id=\"SCta2l\">On one hand, we can view it as some community members did, as a story of web3 empowerment. As the crypto investor and evangelist Chris Dixon <a href=\"https://twitter.com/cdixon/status/1490471136097800197\">said over the weekend</a> as this all went down: “Don’t like something someone did? Change how you delegate your tokens. This is how the internet should have worked all along.”</p><p id=\"aU7QHF\">On the other, I imagine it all may have come as a surprise to right-leaning blockchain enthusiasts who prize the technology for the way it resists censorship and stands apart from more traditional systems of governance. The intersection between people who love crypto and angrily inveigh against “cancel culture” is large and vocal, and the Millegan affair has thrown them all for a loop.</p><p id=\"qrnmWc\">But another question I find myself asking about the whole situation is: do you really need a DAO for all that?</p><div class=\"c-float-right\"><aside id=\"KRY4Xb\"><q>the ham sandwich question</q></aside></div><p id=\"FEnAGC\">A good friend once told me of a colleague who, whenever presented with an elaborate scheme devised to achieve a simple result, would call it “a long way to go for a ham sandwich.” And the ENS DAO, at least in terms of the role it played in Millegan’s termination, is giving real ham-sandwich energy.</p><p id=\"Z8gvQ3\">Because yes, the DAO did give community members power over Millegan’s ability to shape the future of ENS. But did it give them any more power than they would have had if they had simply continued tweeting and complaining in the Discord server until the CEO fired him, which he did a day or so later anyway?</p><p id=\"CQcDf0\">In other words: do you have to go to the lengths of ensuring you can cancel a man “on chain,” when in practice you can do it just as easily on Twitter?</p><div id=\"ri9MJe\"><iframe src=\"https://www.platformer.news/embed\" width=\"480\" height=\"320\"  frameborder=\"0\" scrolling=\"no\"></iframe></div><p id=\"ipIIfC\"></p><p id=\"aQW2Qp\">I don’t know the answers. But I suspect this won’t be the last time that a mad scientist of community governance finds himself attacked by his own creation, in novel new ways supported by the blockchain.</p><p id=\"zTunzZ\">I’ve also learned my lesson about acquiring governance tokens in the name of journalistic curiosity. To my relief, the price of ENS tokens declined by about 75 percent from their peak. But even after I (<a href=\"https://twitter.com/CaseyNewton/status/1490769708924104704?s=20&amp;t=kS4DLGbvL-eLQ0itBCbidA\">eventually!</a>) sold them over the weekend, they were still worth an uncomfortable $5,000 or so in ETH.</p><p id=\"WFzRL3\">It doesn’t feel right to have profited from any of this. As soon as I can figure out the tax implications, I’m going to sell all but a nominal amount of ETH and donate the proceeds to the <a href=\"https://www.thetrevorproject.org/\">Trevor Project</a>.</p><p id=\"S8rnjj\">I’ll mention it here in this column when that’s done.</p><p id=\"T6TSnF\"><em>Editor’s Note: </em><a href=\"https://www.theverge.com/ethics-statement\"><em>The Verge ethics policy</em></a><em> prohibits full-time Verge staffers from owning cryptocurrencies or stocks in the companies we cover. When we do need to buy crypto products for reporting, we will disclose it.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZeyDoysLspvsgyMcZVV53M4-SQA=/0x214:2971x1769/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23234758/1235570383.jpg",
  "description": "Brantly Millegan and the ENS DAO",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}