{
  "title": "The EU, US, and 32 other countries just announced a ‘Declaration for the Future of the Internet’",
  "url": "https://www.theverge.com/2022/4/28/23046652/declaration-for-the-future-of-the-internet-eu-us-regulation-commitment-announced",
  "date": "2022-04-28T18:36:17.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zaI5cb8zaHBsnN77tfGBy_UB-Gg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70805975/akrales_220309_4977_0079.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"lESYeY\">The United States, all European Union member states, and 32 non-EU countries have announced a “Declaration for the Future of the Internet” that lays out priorities for an “open, free, global, interoperable, reliable, and secure” internet. It highlights goals like affordability, net neutrality, and removing illegal content without curtailing free expression — although it offers few specifics for achieving them.</p><p id=\"IZR9bi\"><a href=\"https://www.whitehouse.gov/wp-content/uploads/2022/04/Declaration-for-the-Future-for-the-Internet_Launch-Event-Signing-Version_FINAL.pdf\">The three-page declaration</a>, also summarized by <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/04/28/fact-sheet-united-states-and-60-global-partners-launch-declaration-for-the-future-of-the-internet/\">the White House</a> and <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/IP_22_2695\">the European Commission</a>, offers a broad vision of the net as well as a mix of more specific issues for its 61 signatories. “We are united by a belief in the potential of digital technologies to promote connectivity, democracy, peace, the rule of law, sustainable development, and the enjoyment of human rights and fundamental freedoms,” the document begins. But “access to the open internet is limited by some authoritarian governments and online platforms and digital tools are increasingly used to repress freedom of expression and deny other human rights and fundamental freedoms.”</p><p id=\"bXl4dX\">The declaration emphasizes that the internet should be decentralized and globally interconnected, saying that countries should “refrain from undermining the technical infrastructure essential to the general availability and integrity of the internet.” That’s an implicit repudiation of the “splinternet,” <a href=\"https://www.internetsociety.org/blog/2022/03/what-is-the-splinternet-and-why-you-should-be-paying-attention/\">an internet that’s fragmented</a> by countries banning services and shutting down online access. It’s a counterpoint to the visions of countries like Russia and China (neither of whom are signatories) that have heavily restricted access to foreign sites and apps. It also contradicts unsuccessful Ukrainian requests to cut Russia off from <a href=\"https://arstechnica.com/tech-policy/2022/03/icann-wont-revoke-russian-internet-domains-says-effect-would-be-devastating/\">global domain services</a>.</p><div class=\"c-float-right\"><aside id=\"TFflJY\"><q>It’s implicitly repudiating a “splinternet” future</q></aside></div><p id=\"06pEOt\">The document’s discussion of privacy and safety reflects steps that the EU particularly has taken in recent years, including the General Data Protection Regulation (GDPR) and Digital Services Act (DSA), which <a href=\"https://www.theverge.com/2022/4/23/23036976/eu-digital-services-act-finalized-algorithms-targeted-advertising\">will impose greater obligations</a> for web services to remove illegal content and prevent harm to users. It denounces the use of “algorithmic tools or techniques” for surveillance and oppression, including social credit scorecards — a concept the EU has <a href=\"https://www.theverge.com/2021/4/14/22383301/eu-ai-regulation-draft-leak-surveillance-social-credit\">weighed legislating against</a> after it became ubiquitous in China.</p><p id=\"ZamIUW\">Signatories also agree to uphold the principles of net neutrality and “refrain from blocking or degrading access to lawful content, services, and applications on the internet,” although it doesn’t discuss laws that could prevent private internet service providers from doing so. It’s not clear how this language would square with signatory rules <a href=\"https://www.theverge.com/2022/3/17/22982841/uk-online-safety-bill-tech-managers-jail-time-threats-draft\">like the UK’s Online Safety Bill</a>, which requires companies to reduce the visibility of “legal but harmful” online content.</p><p id=\"4Et1nk\">Most of the principles cover well-trodden ground, but some details are less closely tied to contemporary regulatory debates. Signatories agree to cooperate on “reducing as much as possible the environmental footprint of the Internet and digital technologies,” for instance. That commitment could come into play as nations explore regulating and adopting cryptocurrency, which is often energy-intensive. Despite its name, however, the declaration is broad enough that it doesn’t tell us much about how countries will shape the future of the internet — at least not more than their regulation already has.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WR3fYKGqtYsJMznzYbtH526BYx8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318432/akrales_220309_4977_0079.jpg",
  "description": "Member states agree to fight a \"splinternet\" future.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}