{
  "title": "The writing may be on the wall for sharing Netflix accounts",
  "url": "https://www.theverge.com/2022/4/19/23032643/netflix-password-sharing-subscribers-100-million",
  "date": "2022-04-19T20:52:44.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1sormvsuiV3II-RhtndxMkE_tQE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70768425/acastro_181101_1777_netflix_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"idiu8U\">Netflix announced in March that it <a href=\"https://www.theverge.com/2022/3/16/22981283/netflix-password-sharing-test-multiple-streams\">plans to crack down on password sharing</a>, and in its first quarter earnings letter to shareholders (<a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2022/q1/FINAL-Q1-22-Shareholder-Letter.pdf\">pdf</a>), it gave a big clue as to why. </p><blockquote><p id=\"uANJ1m\">First, it’s increasingly clear that the pace of growth into our underlying addressable market (broadband homes) is partly dependent on factors we don’t directly control, like the uptake of connected TVs (since the majority of our viewing is on TVs), the adoption of on-demand entertainment, and data costs. We believe these factors will keep improving over time, so that all broadband households will be potential Netflix customers. Second, in addition to our 222m paying households, we estimate that Netflix is being shared with over 100m additional households, including over 30m in the UCAN region. Account sharing as a percentage of our paying membership hasn’t changed much over the years, but, coupled with the first factor, means it’s harder to grow membership in many markets - an issue that was obscured by our COVID growth.</p></blockquote><p id=\"9ncJdf\">Netflix has 222 million “paying households,” but it estimates the service is shared with over 100 million “additional households,” 30 million of which are in the US and Canada. That indicates there is a massive swath of people who aren’t paying Netflix directly for the ability to stream their favorite shows.</p><aside id=\"ALnmzG\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Why Netflix keeps cranking up its prices \",\"url\":\"https://www.theverge.com/2022/1/20/22893419/netflix-price-increase-q1-2022-earnings\"}]}'></div></aside><p id=\"x1P93s\">“We’re working on how to monetize sharing,” Netflix co-CEO Reed Hastings said <a href=\"https://youtu.be/O1abP3Eo_RA\">in a video regarding this quarter’s earnings</a>. “You know, we’ve been thinking about that for a couple years. But you know, when we were growing fast, it wasn’t the high priority to work on. And now we’re working super hard on it. Remember, these are over 100 million households that already are choosing to view Netflix. They love the service. We’ve just gotta get paid in some degree for them.”</p><p id=\"TPSruJ\">Netflix chief operating officer and chief product officer Greg Peters elaborated further on the company’s thinking in Tuesday’s video. “If you’ve got a sister that’s living in a different city, you want to share Netflix with her, that’s great,” he said. “We’re not trying to shut down that sharing. But we’re going to ask you to pay a bit more to be able to share with her so she gets the benefit and the value of the service but we also get the value of the revenue associated with that viewing.”</p><p id=\"uqTlwc\">Right now, the company is testing <a href=\"https://about.netflix.com/en/news/paying-to-share-netflix-outside-your-household\">a new feature</a> in Chile, Costa Rica, and Peru where subscribers can add “sub accounts” for up to two people outside of their home at reduced prices. But it may not launch more broadly for some time, according to Peters. “Just to set your expectations, my belief is that we’re going to go through a year or so of iterating and then deploying all of that so that we that solution globally launched, including [in] markets like the United States,” he said.</p><p id=\"9o7qiE\">Netflix also revealed Tuesday that it lost subscribers <a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">for the first time in a decade</a> last quarter. </p><p id=\"Zg7mPM\"><em><strong>Update April 19th, 6:50PM ET</strong></em><em>: Added quotes from Greg Peters.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iexRnvKTJwll810C7TgDaqIFq9M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18956934/acastro_181101_1777_netflix_0002.jpg",
  "description": "Netflix has 100 million reasons to stop password sharing.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}