{
  "title": "The Steam alpha is finally arriving on select Chromebooks",
  "url": "https://www.theverge.com/2022/3/22/22990267/steam-alpha-chromeos-chromebook-supported-models",
  "date": "2022-03-22T16:00:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"A screenshot of Steam running on Chrome OS.\" src=\"https://cdn.vox-cdn.com/thumbor/_H3Wd1kvQQVgPV-PjKHtk6ZTJUQ=/36x0:1386x900/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657181/Untitled.0.png\" />        <figcaption><em>Google recommends testing out (slightly older) AAA games on the Chromebook, like </em>Portal 2<em>, </em>The Witcher 3<em>, and </em>Civ V. | Image: Google</figcaption>    </figure>  <p id=\"2kqbUh\"><a href=\"https://support.google.com/chromebook/thread/156452389/early-support-for-steam-coming-to-dev-channel?hl=en\">Google says</a> that an alpha version of Steam is finally available for Chrome OS users with specific machines to test, as long as they’re willing to put a beta OS on their computer. This announcement comes after the company <a href=\"https://www.theverge.com/2022/3/15/22979368/steam-chromeos-chromebook-valve-google-2022-alpha\">prematurely said</a> Valve’s PC game store was available last week before changing its tune to say it would be “coming soon.” While Google’s John Maletis, a Chrome OS VP, calls it “early days” for the software, it’s exciting that we’re finally going to get a peek at what the Steam experience will be like on Chromebooks.</p><p id=\"JibFSQ\">Google says that the alpha will only be available on “a small set of recent Chromebooks,” as it’s focused on “devices where more games can run well.” (It’s also limited to certain configurations of those computers — more on that in a second.) According to <a href=\"https://www.chromium.org/chromium-os/steam-on-chromeos/\">a blog post from the company</a>, those Chromebooks are:</p><div class=\"c-float-right\"><aside id=\"RkvPKH\"><q>The Steam alpha’s really only for people willing to dig in and test unfinished software</q></aside></div><ul><li id=\"XKufhH\">Acer’s Chromebook 514 and 515</li><li id=\"GXNDK7\">Acer’s <a href=\"https://www.theverge.com/21355769/acer-chromebook-spin-713-review-best-chromebook-to-buy\">Chromebook Spin 713</a></li><li id=\"EVGOCY\">Asus’ <a href=\"https://www.theverge.com/22776850/asus-chromebook-flip-cx5-review-the-15-inch-chromebook-to-beat\">Chromebook Flip CX5</a></li><li id=\"nf4BQI\">Asus’ <a href=\"https://www.theverge.com/2021/7/20/22585185/asus-chromebook-cx9-flip-cx5-laptops-chrome-os-price-store\">Chromebook CX9</a></li><li id=\"5MADhz\">HP’s Pro c640 G2</li><li id=\"6rq2ja\">Lenovo’s 5i Chromebook</li></ul><p id=\"4khvX5\">There are a few other additional caveats to note: Google’s only opening it up for configurations of those Chromebooks that have Intel XE graphics, an 11th-gen i5 or i7 processor, and at least 8GB of RAM. The company also notes that if a game requires 6GB of RAM, it may not work very well with a laptop that has 8GB of RAM. There are also apparently “performance and scaling” issues with screens that run at above-1080p resolutions, which Google is working on fixing. </p><p id=\"d6g5Li\">The install process also reflects the early state of the software — according to a post from Google, it involves switching your computer to the Dev channel version of Chrome OS, setting a flag, and entering a terminal command. After you’ve gone through all that, though, you should be ready to test out Steam and the games that come with it (Google has a list of which ones it recommends trying out, some of which have a few caveats). Google says Steam on Chrome OS will “typically run the Linux version of a game,” but it also says that Proton, a compatibility layer for running Windows games, is supported as well.</p><p id=\"VUN8T1\">That’s a welcome surprise, though it does make sense given how much effort Valve’s <a href=\"https://www.theverge.com/2021/11/8/22737127/valve-steam-deck-battleye-anti-cheat-pubg-dayz-r6-siege\">put into the Linux gaming experience</a> in an effort to make <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">its Steam Deck console</a> as capable as possible. Maletis even sites Valve’s “deep investment in the Linux ecosystem” when talking about how Google worked with the company to get Steam working on Chrome OS.</p><p id=\"mq5MEP\">Steam has been a long time coming to Chromebooks — Google <a href=\"https://www.theverge.com/2020/1/17/21070284/chrome-os-steam-support-linux-games\">announced it in January 2020</a> and didn’t say much else about it after that until last week. And given the number of warnings Google is giving people about the alpha — it says “anything can break” and that “you will encounter crashes, performance regressions, and never-before-seen bugs” while testing it — it could be a while before it’s a good idea to put it on your main Chromebook. Still, it’s nice to hear that it’s finally time to run it on actual hardware, after all the waiting and <a href=\"https://9to5google.com/2022/02/19/steam-chrome-os-supported-chromebooks/\">rumors</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5cJxMHeTbxoK9QtgApzM_aRhsX0=/0x0:1600x838/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23335709/Untitled.png",
  "description": "Early days for PC gaming on Chrome OS but still exciting",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}