{
  "title": "The Amazon Bessemer union election is going into overtime",
  "url": "https://www.theverge.com/2022/3/31/23004479/amazon-workers-vote-results-union-bessemer-warehouse-challenged-ballots-results",
  "date": "2022-03-31T22:25:11.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"US-IT-POLITICS-LABOR-AMAZON\" src=\"https://cdn.vox-cdn.com/thumbor/8y7Jdn16tFWVnHfvZvaBnAQ1v5M=/0x0:5154x3436/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70695828/1232001976.0.jpg\" />        <figcaption>Workers at Amazon’s warehouse in Bessemer, Alabama held their second union vote | Patrick T. Fallon/AFP via Getty Images</figcaption>    </figure>  <p id=\"wjgdQh\">The votes for the union drive at Amazon’s warehouse in Bessemer, Alabama, have been counted, but the final result is so close that it will depend on a court hearing yet to come.</p><p id=\"flhBCK\">The vote count announced on Thursday was 993 against and 875 in favor, with 59 ballots counted as void and 416 counted as challenged. Since the challenged ballots are sufficient to swing the election, the result will depend on a court hearing adjudicating the status of the challenged ballots. That hearing has yet to be scheduled but is likely to take place in the next few weeks. Both parties will also have a chance to file objections to the election over the coming month.</p><p id=\"5Cdllp\">In a statement <a href=\"https://www.rwdsu.info/bessemer_alabama_amazon_union_vote_hangs_on_416_challenged_ballots_workers_await_outcome_in_bid_to_become_america_s_first_unionized_amazon_warehouse_workers\">posted to its website</a>, the Retail, Wholesale and Department Store Union (RWSDU) said that it plans on filing objections to Amazon’s behavior. “Every vote must be counted,” said Stuart Appelbaum, the union’s president. If the vote goes in favor of unionization, the warehouse workers would be represented by the RWSDU. </p><p id=\"uVtEnQ\">The outcome thus far is much closer than most expected. The union lost the first election last April by a margin of <a href=\"https://www.theverge.com/2021/4/10/22377142/bessemer-amazon-labor-union-loss-warehouse-rwdsu\">more than 2 to 1</a>, but the National Labor Relations Board ordered a do-over, saying Amazon violated US labor laws. The RWSDU had raised concerns about <a href=\"https://www.theverge.com/2021/5/21/22445940/amazon-union-nlrb-hearing-mailbox-bessemer\">a USPS mailbox installed in the warehouse parking lot during the drive</a>. The union alleged the mailbox led some workers to believe that Amazon had improper access to ballots sent by mail. The NLRB said Amazon “interfered with the employees’ exercise of a free and reasoned choice by creating the appearance of irregularity in the election.” </p><p id=\"uoViqc\">Votes are also currently being counted for a separate union drive at Amazon’s JFK8 facility in Staten Island, New York. The union is <a href=\"https://twitter.com/amazonlabor/status/1509640083925786625?s=20&amp;t=a3jrHFZT0gSzfSfgqW1qyA\">currently ahead</a> by several hundred votes, but the count will be continuing on Friday.</p><p id=\"1Ge7PV\"><em><strong>Update March 31st, 6:25PM ET:</strong></em><em> Added statement from RWDSU.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SPKPdI7qa_VKyDDvXti0XGMCJiw=/0x399:5154x3097/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23357371/1232001976.jpg",
  "description": "The results are too close to call.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}