{
  "title": "The official Steam Deck dock won’t be available at launch",
  "url": "https://www.theverge.com/2022/2/23/22947985/valve-steam-deck-dock-launch-details-order-time",
  "date": "2022-02-23T21:08:55.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MruDivukXtEsMElvIdRRSbqGYDk=/1x0:1072x714/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70542365/hardware_accssories.0.jpeg\" />        <figcaption><em>Valve hasn’t shared many details about the dock just yet.</em> | Image: Valve</figcaption>    </figure>  <p id=\"BmaWW1\">The first orders for the Steam Deck, Valve’s handheld gaming PC, will begin on Friday, but the company’s official dock for the device won’t be available at that time.  </p><p id=\"fMxhVV\">“We are also looking forward to getting the official Dock for Steam Deck into customers’ hands,” Valve said <a href=\"https://store.steampowered.com/news/app/1675180/view/3113680526234449023\">in a post about the Steam Deck’s launch day</a>. “It won’t be happening as early as we wanted, but we’re excited to talk more about it soon and are planning to make them available in late spring.”</p><p id=\"WtRbn0\">Valve hasn’t shared many details about the dock just yet, though there is a short description on Valve’s Steam Deck website. “The official dock props up your Steam Deck while connecting to external displays, wired networking, USB peripherals, and power,” Valve says. But you don’t <em>need</em> Valve’s specific dock; “you can also use a powered USB-C hub, if you’ve got one lying around,” according to the company.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LS31GC-TM9PfD2TP2k7gMTR0c_8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23266361/Screen_Shot_2022_02_23_at_12.44.50_PM.png\">      <cite>Screenshot by Jay Peters / The Verge</cite>      <figcaption><em>Here’s a lot of what we know about the official Steam Deck dock.</em></figcaption>  </figure><p id=\"jlErz6\">Docking a Steam Deck won’t improve its performance, according to <a href=\"https://www.steamdeck.com/en/faq\">Valve’s Steam Deck FAQ</a>, so it doesn’t sound as if your games will run better if you play them while docked. “[D]ocking is more akin to plugging a USB-C hub into a PC. Steam Deck runs at full performance in portable mode,” the company says. </p><p id=\"ReJFhS\">Valve also provided a reminder about the order rollout for launch day. The company will send emails to the “first batch” of reservation holders for the device at 1PM ET / 10AM PT on Friday, February 25th. “Those folks will then have 72 hours to complete their purchase on Steam for the specific model they reserved. If they cancel or do not purchase in this time frame, we’ll release their reservation to the next person in the queue.”</p><p id=\"yhildi\">If you want to know Valve’s estimate for when you’ll be able to order one of the devices based on your place in the reservation queue, <a href=\"https://store.steampowered.com/steamdeck/\">check the Steam Deck website</a>. </p><aside id=\"ZkMagF\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Valve Steam Deck hands-on: the Nintendo Switch of PC gaming\",\"url\":\"https://www.theverge.com/2021/8/6/22612886/valve-steam-deck-handheld-gaming-pc-hands-on-preview\"},{\"title\":\"This is the Steam Deck’s box\",\"url\":\"https://www.theverge.com/2021/12/2/22814910/steam-deck-box-package-power-adapter\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/KlrEEMd4Ox62zYadKOB224n4m8U=/0x77:1072x638/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23266393/hardware_accssories.jpeg",
  "description": "\"We’re excited to talk more about it soon\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}