{
  "title": "The Super Bowl won’t be lit: no cannabis ads allowed",
  "url": "https://www.theverge.com/2022/2/8/22911200/super-bowl-ads-cannabis-weed",
  "date": "2022-02-08T18:00:00.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"A cannabis leaf seen in a basket on a table during the “...\" src=\"https://cdn.vox-cdn.com/thumbor/NUoECHOwfgoeF9_ayU6nNtSs0FQ=/0x3:5000x3336/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70484485/1237915530.0.jpg\" />        <figcaption>No cannabis ads in the Super Bowl  | Photo by Peerapon Boonyakiat/SOPA Images/LightRocket via Getty Images</figcaption>    </figure>  <p id=\"uV5LLR\">If a brand wants to reach — or offend — a large swath of Americans all at once, there are few better venues than a Super Bowl ad. There are plenty of brands advertising this year that wouldn’t have been allowed in the big game just a few years ago, such as hard liquor or sports betting apps. This year’s ad lineup even includes ads for <a href=\"https://www.wsj.com/articles/bengals-rams-and-bitcoin-crypto-ads-invade-the-super-bowl-11644159817\">cryptocurrencies</a>, a product still far from the American mainstream despite what your laser-eyed Twitter followers may tell you. </p><p id=\"dEauVX\">But one so-called “lifestyle” product — cannabis — is once again shut out from the Super Bowl this year, even though it’s legal in a majority of US states, and <a href=\"https://news.gallup.com/poll/323582/support-legal-marijuana-inches-new-high.aspx\">public support for legal weed</a> has never been higher. Marijuana remains illegal at the federal level in the US, however, and cannabis ads — where they’re allowed — are typically restricted to audiences over 21. </p><p id=\"CT4SsP\">So as you might expect, there won’t be any ads for cannabis products in this weekend’s Super Bowl. The National Football League has a “restricted” category for certain products, which applies not only to ads in the Super Bowl but to all NFL games, said spokesperson Alex Riethmiller. “Cannabis falls within that restricted category,” he said.</p><p id=\"OL1kSR\">The NFL didn’t elaborate on what else appears on its restricted ads list, but just because a product or company is on that list now doesn’t mean it will stay there indefinitely. In <a href=\"https://www.wsj.com/articles/nfl-adds-liquor-to-menu-of-advertisers-1496441710\">2017, the NFL revised the list to allow distilled spirits</a> to be advertised during its games, with some restrictions. But that was also the same year <a href=\"https://www.washingtonpost.com/news/early-lead/wp/2017/01/31/nfl-reportedly-nixes-gnc-super-bowl-ad-over-association-with-banned-substances/\">GNC had its Super Bowl ad rejected</a> after the players union pointed out that some GNC products had substances banned by the league. </p><div class=\"c-float-right\"><aside id=\"ADOy1Q\"><q>Sports betting and crypto ads: yes; Weed ads: no</q></aside></div><p id=\"YMTqFi\">And the restricted list isn’t always how the NFL determines a product’s ad-worthiness; there’s always the almighty dollar. Anheuser-Busch is the exclusive beer and hard seltzer sponsor of the Super Bowl after <a href=\"https://www.sportsbusinessjournal.com/Daily/Issues/2021/12/20/Marketing-and-Sponsorship/AB-NFL.aspx\">renewing its contract with the league</a> last year. Other beer companies can buy Super Bowl ad spots sold in local markets, but the ads don’t run nationally. Asked if a cannabis company could run a similar local ad in a state where the drug is legal, Riethmiller reiterated “it’s currently a prohibited category.” </p><p id=\"29NjgD\">Where the league draws the line on what gets in and what gets rejected can be a bit puzzling. For instance, a <a href=\"https://static1.squarespace.com/static/5435569fe4b0d289e7405178/t/59f0b950edaed8619307cc33/1508948306461/NFL.pdf\">2017 list</a> allowed ads for antidepressants and prescription birth control pills but banned ads for condoms. This year’s confirmed Super Bowl ads include a 30-second spot from sports betting site Draft Kings, its second year advertising in the big game. </p><p id=\"JIWqq0\">The lack of cannabis ads in the biggest advertising event of the year is not for lack of trying. In 2019, Acreage Holdings, a medical cannabis company, tried to <a href=\"https://www.youtube.com/watch?v=j4GpGHgOHAk&amp;feature=emb_imp_woyt&amp;ab_channel=JavierHasse\">get its ad</a> focused on medical marijuana treatments to <a href=\"https://www.vox.com/the-goods/2019/1/28/18200875/acreage-medical-marijuana-super-bowl-53-ad\">run during Super Bowl 53</a> but was rejected. </p><p id=\"kvEjZZ\">California-based Weedmaps, which was founded in 2008 as a way to locate dispensaries online, asked its ad agency to broach the topic of getting an ad into the Super Bowl this year, “but it was a blanket ‘no,’” Juanjo Feijoo, COO of Weedmaps, said in an interview with <em>The Verge. </em>The company ran its <a href=\"https://www.adweek.com/brand-marketing/in-heavyweight-move-for-cannabis-weedmaps-sponsors-mike-tysons-return-to-the-ring/\">first-ever TV ad</a> at the end of Mike Tyson’s return to the boxing ring in 2020, which was a pay-per-view event. And Weedmaps went ahead and made a tongue-in-cheek <a href=\"https://www.youtube.com/watch?v=x0KYgXiqxc0\">digital ad</a> anyway, starring a life-sized broccoli sprout (broccoli emoji are often used to represent marijuana online) who’s tired of being mistaken for something he’s not. </p><p id=\"C1oL1b\"></p><p id=\"0yhToZ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/A7fHJU9WgtgNimW-qvMIv6zd-b4=/0x360:5000x2978/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23219400/1237915530.jpg",
  "description": "But the tide may be turning.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}