{
  "title": "The Mac Studio’s ports are a step back in all the right ways",
  "url": "https://www.theverge.com/2022/3/10/22969574/mac-studio-apple-ports-hdmi-usb-c-design-dongles-back",
  "date": "2022-03-10T14:15:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/X7yxstOfeFQS38YBy7TnhSSyTN0=/156x0:1844x1125/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70603590/image.5.png\" />    </figure>  <p id=\"mQRhOG\">The ports have won. After years of Apple’s USB-C experiments, the past few months have seen a decisive victory for the concept of “being able to plug things into your computer without a complicated array of dongles and adapters” — marked in particularly by the latest announcement of <a href=\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\">Apple’s new Mac Studio desktop</a>. </p><p id=\"lFQIpr\">Not only does the new Mac Studio pack <em>six </em>USB-C ports — four of them full-fledged Thunderbolt 4 on the entry-level model and all six featuring Thunderbolt 4 support on the $3,999 M1 Ultra model — there’s a UHS-II SD card slot, an HDMI port, an Ethernet port, a headphone jack, and <em>two</em> USB-A ports. It’s a glut of ports that manages to outclass even the best proper, standalone Thunderbolt docks (the current reigning champ, <a href=\"https://www.theverge.com/22957456/caldigit-ts4-thunderbolt-4-dock-review\">the CalDigit TS4</a>, for example, only has three Thunderbolt ports, although it does win out with more USB-A ports). </p><aside id=\"4ZAqVx\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple’s Mac Studio is a new desktop for creative professionals\",\"url\":\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\"}]}'></div></aside><p id=\"rnwEGM\">It’s the kind of port selection that means that you won’t have to suffer a dongle to connect anything to your computer. There are even ports on the front of the device — something that’s been absent from Apple’s Mac Mini and iMac desktops for years — instead of making you blindly rummage around the back of your iMac to try and plug in a hard drive. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/aj_0zRRI1p8piqkryD_uJ0a50WE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23302164/Screen_Shot_2022_03_09_at_4.33.22_PM.png\">      <cite>Image: Apple</cite>  </figure><p id=\"uMLRiZ\">There is a looming caveat to the triumphant return of ports to Apple’s products: they’re only to be found on Apple’s priciest machines. That means that if you want HDMI or SD card slots on a modern Apple computer, you’ll have to shell out at least $1,999, whether for the cheapest Mac Studio or an entry-level MacBook Pro.</p><p id=\"29L9jv\">Anything less, be it a $1,299 iMac, a $999 MacBook Air, or a $699 iPad Air, and you’re still stuck in a dongle life. Ports may have won, but they still come at a cost: whether upfront or through docks and hubs, you’ve got to pay to break free of your port-less prison. </p><div class=\"c-float-right\"><aside id=\"IUPCwe\"><q>You gotta pay up for the ports, though</q></aside></div><p id=\"8Mux2m\">But as welcome as the triumphant return to more diverse I/O options are, it’s hard to look at Apple’s recent products as anything but a damning judgment on USB-C and Apple’s years-long attempt to transition to the standard. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/W86juJ6D9PKQtTug2ih0vCdcZqw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23298871/mac_studio_202203_gallery_3.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>It’s got ports on the front, too!</em></figcaption>  </figure><p id=\"TZN7pJ\">When the company first added USB-C to its laptops with the 2015 MacBook, much ado was made about how Apple was — once again — trying to trailblaze a path to a new hardware standard. Cries for legacy ports were met with rebuttals that compared the switch to Apple’s once-controversial decision to eschew a floppy disc slot on the original iMac in favor of a CD drive. </p><p id=\"4MfAP3\">USB-C adherents argued that the MacBook was riding the cresting wave of another hardware revolution and that the pain points of the present would vanish once ecosystems caught up; Apple was simply skating to where the puck would be, rather than letting the future pass it by. </p><p id=\"quPaCj\">On paper, it makes sense: a single connector that could handle ethernet, power, video, and data all at once; cables that were agnostic and could charge your computer just as easily as they could be used to connect it to a monitor; a dream of never having to carry more than a single charger for all your devices ever again. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oeHMSWGh8LjvFzXGLk7ik44N-D4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22938855/Apple_MacBook_Pro_Ports_10182021.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>PORTS!</em></figcaption>  </figure><div class=\"c-float-right\"><aside id=\"xEGX05\"><q>USB-C was supposed to bring about a utopian cable dream, not a dongle nightmare</q></aside></div><p id=\"UECqsk\">Unfortunately, the reality of the USB-C transition has utterly failed to meet that utopian ideal. The USB-C ecosystem is a perplexing morass of charging speeds, data transfer rates, and optional audio and display features that vary from cable to cable (which all appear physically identical, adding to the confusion). One USB-C cable on my desk charges my laptop and connects it to my monitor — another gives only a trickle of power that’s better suited to a smartphone than a computer, but you wouldn’t know it by looking at it.  </p><p id=\"EB4Ivc\">Attempts to untangle the mess have resulted in a patchwork quilt of standards such that “USB 3.2 Gen 2x2” could refer to either a USB-A or USB-C plug, with entirely different definitions for how fast it can charge something. </p><p id=\"jaqSMG\">But most importantly, customers and manufacturers alike simply weren’t willing to make the switch. It turns out it was easier — if not more convenient — to buy a dongle (usually from Apple, at least until the third-party market caught on) or adapter than rebuild their setups from scratch. Apple’s USB-C switch bet big on customers being willing to change their digital lives to match the new port: instead, customers simply added another layer to translate their old setups to their new computers.  </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AWpZAQQRvYsvx16cvdtcrQEyyP8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23302207/23363_29449_18824_18336_thunderbolt_top_l_xl.jpeg\">      <figcaption><em>The sins of the past</em></figcaption>  </figure><p id=\"xVoFMq\">It felt like <a href=\"https://www.theverge.com/22733328/apple-macbook-pro-ports-professional-specs\">Apple failed a huge part of its core Mac audience</a> by taking away the ports they needed to use their computers properly for basic tasks like pulling files off SD cards or connecting monitors. And it was a change that looked like something users would just have to live with. Even some of Apple’s otherwise excellent M1 Macs looked to continue that trend for a time: the M1 Mac Mini and iMac offered worse port selection than their Intel counterparts that they replaced. </p><p id=\"LMfF9Y\">One could argue that Apple itself was a part of the problem: the company embraced USB-C with open arms on its laptops (and most of its iPads) but still obstinately refuses to offer support on its iPhones, AirPods, or other accessories, fragmenting Apple’s own ecosystem into two and neutralizing many of the benefits of the new standard. </p><div class=\"c-float-right\"><aside id=\"hyUWM9\"><q>Ports are back — hopefully, for good this time</q></aside></div><p id=\"xsH7GL\">A world where Apple shipped a USB-C iPhone at the same time as its first USB-C laptops and unified all its devices under a single connectivity standard from the start could have significantly helped the company’s case for USB-C as a whole. But Apple stuck with Lightning instead, splitting its own product lineup (a schism that still exists today). </p><p id=\"sl62zr\">It still is possible that USB-C may still manage to turn things around. The recent USB4 specification looks like it might have a shot to try to solve the standards mess by laying down some ground rules for physical connectors (for example, all USB4 plugs are USB-C only) and basic specs (largely by just borrowing the Thunderbolt 3 standard as a baseline) — but it’s yet another transition that will take time. </p><p id=\"Q5VNNJ\">In the meantime, ports are back. And hopefully, for good this time. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ShjZrBDIeUBkld8Qbx1B0qGETi0=/0x40:2000x1087/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23303715/image.png",
  "description": "Assuming you’re willing to pay $2,000 for a computer, that is",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}