{
  "title": "The business of finding a better job, with Career Karma CEO Ruben Harris",
  "url": "https://www.theverge.com/22910624/career-karma-ceo-ruben-harris-interview-startup-tech-linkedin-decoder",
  "date": "2022-02-01T15:25:00.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/wV6KurC483ebh-YqyPAetMUXJeQ=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70457555/VRG_ILLO_Decoder_Ruben_Harris.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>Turning the ‘Great Resignation’ into good business</p> <p class=\"p--has-dropcap p-large-text\" id=\"4cSsac\">It’s an interesting time to talk to someone in the business of helping people get new jobs — we’re still fully in the middle of the pandemic-driven Great Resignation, and a record <a href=\"https://www.cnbc.com/2022/01/04/jolts-november-2021-record-4point5-million-workers-quit-their-jobs.html\">4.5 million people quit their jobs in November 2021</a>, and it doesn’t seem to be slowing down. But that’s exactly what Career Karma and CEO Ruben Harris are doing. </p><p id=\"gAwQI6\"><a href=\"https://careerkarma.com/\">Career Karma</a> helps job-seekers identify potential new career paths, then matches them with coding boot camps and other training programs to help them on their way. Ruben and his team just <a href=\"https://techcrunch.com/2022/01/10/career-karma-lands-40-million-to-evolve-into-a-edtech-employee-benefit/\">raised $40 million in Series B funding</a> for a total of $52 million, and it’s launching a live audio feature for job seekers to connect and talk about their career paths.</p><p id=\"RfIyRC\">So, of course, I wanted to talk to Ruben about what they plan to do with that infusion of cash and how exactly they plan to grow — and to talk about how Career Karma makes money, what he’s learned from his community about the future of the job market, and if he thinks the traditional 9 to 5 might be on the way out.</p><p id=\"ALLCCf\">Now, if you’ve been listening to Decoder, you know I love a startup CEO with ambition, and Ruben is definitely an ambitious startup CEO. This was a good one — I think you’ll like it. </p><p id=\"s3QEUZ\">Okay, Ruben Harris, CEO of Career Karma. Here we go. </p><div id=\"ziS9yc\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP2355217570\" width=\"100%\"></iframe></div><p id=\"9gfyjt\"><em>This transcript has been lightly edited for clarity.</em></p><p id=\"LdssJo\"><strong>Ruben Harris, you’re the co-founder and CEO of Career Karma. Welcome to </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"CwUW8X\">Yes, sir. Thank you, brother.</p><p id=\"oPtnrD\"><strong>You have some news to talk about. You just raised $40 million in Series B funding. That’s a total of $52 million. I want to talk about what you plan to do with the money, but let’s start at the very beginning. What is Career Karma? What do you do for people?</strong></p><p id=\"5HGHEj\">Career Karma is the easiest way to find a job training program online. We serve blue-collar workers — usually ages 25 to 35 years old — who want to get a job in tech. They can be younger or older, but that tends to be the age range. Job training programs pay us to send them qualified applicants. A common misconception is that Career Karma only helps people get jobs as software engineers, but we actually offer seven different career paths that are technical and non-technical, like sales, marketing, and design. Once we match someone to our best recommendations of a school, they enroll into a training program that gets them a job in about three to 12 months. We have live audio rooms to give students support from peers, coaches, and mentors during the program so that they can get any questions answered or overcome any insecurities. Then, when they get to the job search, they can connect directly with companies to find a job.</p><p id=\"BwKQQo\"><strong>That live audio program has been a pandemic hit, right? Are these Clubhouse and Twitter spaces? Did you build that because the networking component was harder in the pandemic?</strong></p><p id=\"ep1E44\">Before we started Career Karma, we had a podcast like this one; it was called <a href=\"https://breakingintostartups.com/\"><em>Breaking Into Startups</em></a>. We still have it. I used to work in radio: we’ve always been bullish on audio because most people that come from this demographic actually listen to the radio and television. We’ve always known that at some point cars are going to be digitized and Bluetooth technology is going to be a big deal. It’s not just Tesla that’s out there, but everything’s digital. Then you have these at-home devices like Amazon and Alexa and things like that. Our roots are in audio, but to your point, as we started to see how audio starts taking off on the internet — it wasn’t just Clubhouse and Twitter spaces. LinkedIn has audio now. Reddit has audio.</p><p id=\"GPXnHT\"><strong>To be fair, LinkedIn has everything. </strong></p><p id=\"U9Oz04\">LinkedIn has everything. Exactly. To your point, rather than going crazy with all the features before we had audio rooms, we were actually pretty dependent on Zoom and Discord and Slack to run our community features and spreadsheets. That only gets you so far: if you want to have a billion people, you probably need proprietary technology, so we launched on iOS, Android, and the web last year. Now our rooms are stable and established.</p><p id=\"bGztzE\"><strong>That’s cool. How many people work at Career Karma?</strong></p><p id=\"PiRyiy\">We have about 40 people in the US and 200 people total globally.</p><p id=\"blUgiZ\"><strong>Wow. How is that structured? You’ve obviously got a community component. You’re building some technology. You partner with all these boot camps and other job training programs. You must have a partnerships group. How is that structured? How is it allocated?</strong></p><p id=\"GrDJUc\">I’m the CEO, so I have the people team that reports to me. Our VP of people is Jessica Lam. She covers not just the recruiting side of things, but also employee experience, compliance, and people development. Once people are in the company, how do we lay out their competencies and create internal pathways so people can grow? Our people team is the strongest team in the organization. I’m biased, but everybody’s going to say that about their team. I am also actively hiring for a head of business development and the head of finance. My co-founder [Artur Meyster] is the chief technology officer, so he has the engineering team, the data team, and the marketing team reporting to him. All of our organic traffic, like SEO and marketing — he’s in charge of all of that. We are hiring in departments there on the executive side, so he has fewer reports. Then we have our chief product officer — also his twin brother — Timur Meyster. He has the product team, the design team, the partnerships team, and the community team reporting to him. We’re building out execs underneath all of them, so that’s how it’s broken down.</p><p id=\"VoaEHz\"><strong>You just raised money. That money usually is pretty helpful when you’re trying to attract, recruit, and retain people. Is the money all going into headcount and hiring? Is it going into expansion? How do you think about that?</strong></p><p id=\"TFT0eE\">It’s a great question. The big focus right now immediately in the first quarters is finding the head of financial/CFO-type person, head of business development, head of sales, head of data, head of product management, head of growth and marketing. These are all people that we want to hire as we build out an executive team. In the beginning, it’s very easy to just have everything be your responsibility. Now we have to actually bring in people that aren’t just hustlers, but people who have done this before. If we want to expand it to higher education, for example, you want to have people that have really deep relationships with people that are in higher education. Knock on wood — I think we made an offer yesterday for someone. Yes, most of it is going towards hiring just so you can think about it strategically. </p><div class=\"c-float-right c-float-hang\"><div id=\"WIzhPw\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"PiQD30\">We have about 3 million people a month coming to us organically looking for career advice; we’re introducing about 25,000 people a month to different job training programs now, so we need somebody that’s really good at that. We need to get really good at data and segment people by level of intent. We need to get really good at product to be able to make sure that those people are getting the right recommendations, because if we have 3 million people coming to us and 25,000 people going into schools, there’s a lot of people that aren’t just going to boot camps. They want to look at short courses. They want to look at professional courses like Salesforce and Trailhead. They want to look at non-degree courses. They want to look at courses that are launched by individuals themselves. We want to be that front end for all job training, so we have to get good at product. Then we have to get good at design. Once you get really good at segmenting people or giving them the right recommendations, you have to have a different way to follow up with every single person.</p><p id=\"5sc5me\">It’s not just going to be through product or text or phone or email; you also have to have a human component to it. We have a phone team that follows up with people, but the phone team’s not going to be able to call a billion people every single day, so then you have to figure out how this product can leverage its own community to nurture and support people — kind of like how the Reddit community supports each other with volunteers and moderators and things like that. Those are all things that we are investing in right now. </p><p id=\"m8N499\">One more thing: I think the head of business development is really, really important, which is why I want that individual reporting to me because the enterprise is a big channel. If you think about where we’re at in the economy right now, there’s 10 million open jobs. Four million people quit their jobs as part of the “great resignation.” You have record job growth, but you have college enrollment declining twice over the last two years since the pandemic started.</p><p id=\"VBkcY3\">We’re entering into year three and colleges are spending billions of dollars trying to attract enrollments to change this around, but they’re starting to embrace the need to go online. Employers are also facing challenges attracting talent. Especially on the retail side, people don’t want to go back to jobs that are impersonal and put them in danger. They want to take advantage of the remote work trends now that companies have gone online. They’re getting aggressive: “If we’re not paying for an office, let’s get creative on paying for benefits. We used to pay for health care because people worked at factories. Let’s pay for their education so that they can upscale while they’re working for us, but also so we can attract talent.” So you see Amazon paying $700 million for tuition for warehouse [workers], you see <a href=\"https://www.pwc.com/bb/en/press-releases/2019/3bn-investment-in-digital-upskilling.pdf\">PWC with $3 billion</a>, and <a href=\"https://www.cnbc.com/2018/03/13/atts-1-billion-gambit-retraining-nearly-half-its-workforce.html\">AT&amp;T with a billion</a>, and many others like <a href=\"https://www.businesswire.com/news/home/20211109005635/en/Macy%E2%80%99s-Inc.-Announces-Significant-Investments-in-its-People-by-Launching-a-Debt-Free-Education-Program-Raising-Minimum-Wage-and-Expanding-Other-Benefits\">Macy’s</a> and <a href=\"https://ir.chipotle.com/news-releases?item=122378\">Chipotle</a> and <a href=\"https://corporate.target.com/article/2020/08/summit-academy\">Target</a>. Anyway, those are the things we’re investing in.</p><p id=\"OuZAAs\"><strong>I want to talk about the great resignation and how you’re taking advantage of that, but let me ask kind of what I think of as the last big </strong><em><strong>Decoder </strong></em><strong>question. You were just talking about delegating. You were a founder, you’ve got a couple co-founders who had to do it all. As companies grow, you have to hire people with experience. How do you make decisions? What’s your framework and how is that changing?</strong></p><p id=\"HtHHPz\">That’s a really good question. How do you make decisions? It really depends on the decision that you’re referring to. We do use the OKR framework; objectives and key results. We do have wranglers for each one of those KRs. There are decisions that are made by those leaders, but then we also have to think deeply about, what are the decisions that we make as founders that don’t always require consensus? We’re actually going through the exercise of that now because the things that got us here won’t get us to the next level. We do have ambitions to be a public company, so we’re going through it all. </p><p id=\"K3lkYM\">The short answer is if there’s an objective and there’s a wrangler, it’s their final say, but we still talk about it and we have different meetings in order to drive those numbers and those stretch calls.</p><p id=\"VRcQDi\"><strong>I think that you’re in one of the most interesting stages of a company. It’s successful. You’re raising money. You’re profitable, I think? </strong></p><p id=\"keDLWb\">We’re not profitable now. We were profitable during the Series A. For five months, that’s what we have to do in order to survive, but now we’re investing into growing our team so that healthy revenue stays.</p><p id=\"cTai9V\"><strong>In order to grow, you have to change how things will work, and it sounds like you’re thinking about that a lot.</strong></p><p id=\"BlJkco\">I like that you brought up the profitable thing because we are looking for a head of finance. It’s very important because if you grow head count drastically to plant seeds for these things that you’re going to be able to harvest later — things that will grow the revenue beyond the cost of the head count — you have to make sure that the hires that you’re making are within the right budget, while also being mindful of the money that’s coming in and all the other things that you’re doing to build culture with the team and stuff like that. I’m looking for a CFO that doesn’t just keep the books and be an accountant, but can be very strategic about different things that we can do, and maybe even different opportunities that exist out there now that we have all of these resources.</p><p id=\"a7BEUm\"><strong>Let’s talk about money for a second. You said you generate revenue right now. When you place a student into a boot camp, the boot camp programs pay you. Boot camps are kind of like a unique business: they end up placing students into big software companies, then they take a portion of the salary. Software company salaries tend to be pretty big, so that all maps out, but you mentioned you had other job training programs in sales and other fields. Those numbers aren’t necessarily as big as software numbers, so does that math work the same for non-software jobs and non-technical jobs?</strong></p><p id=\"F1mwHX\">Think about schools in general, including boot camps. They’re kind of like startups, where there’s thousands of schools that are out here that teach the same thing in different ways. Like startups, you have to spend money to attract people. That’s why even though we have 3 million people a month coming to us organically, and we are the number one destination for career advice on the internet, we’re only attracting people that know what career path they want. You still have to use paid advertising in order to reach people that don’t know what they want — which is most people — or aren’t doing what they love, which is a lot of people. I say that because some of the boot camps that we work with do have the ISA model that you just described — the income share agreement model.</p><p id=\"NIcM9L\">Some of them have a deferred tuition model, but they all have traditional models as well, where you pay tuition upfront. Tuition for a boot camp ranges between $10,000 to $50,000, including the schools that are in different career paths like sales. The duration of completing a boot camp that’s not a software engineering boot camp tends to be on the shorter side of things, so if you’re trying to get a job in less than six months, that’s an easier path for a lot of people from a time perspective, even though it still requires a lot of studying and a lot of work and a lot of building. The thing that boot camps don’t have that colleges have is financial aid. A couple of them have financial aid that the government provides. As you know, colleges make most of their money from the government and financial aid qualifications and stuff like that. Student loans are actually massive in the US, which is kind of crazy.</p><p id=\"NjeJvm\">There’s a liability for others, which is a different conversation. The point is that the math works because colleges and boot camps have to spend money to attract students. They want to focus on not just marketing that’s spewing a bunch of information in their face, but a human component that actually leads to an enrollment; that gives them control, and analytics on how a lead converted once you paid for it.</p><p id=\"iT1HWB\"><strong>You just said lead conversion and you talked about marketing. There’s a portion of what Career Karma does that looks just like e-commerce: you have a big funnel of incoming people. You want to be the destination for them. Then you segment them like you said, you match them with a product, you send them into that product, and you take a commission on the back.</strong></p><div class=\"c-float-right c-float-hang\"><aside id=\"05AjyT\"><q>“We’re Booking.com for your career or TripAdvisor for your career.”</q></aside></div><p id=\"Lt1Lqy\">That’s exactly right. Something we played with when we were in our Y Combinator days was like: we’re Booking.com for your career or TripAdvisor for your career, where if the destination that you’re going to is the company that you want to reach in the future, then the hotels and the airlines are the schools and we’re Kayak.</p><p id=\"ZmdkK0\"><strong>But let me just push you on that comparison, since it sounds like you didn’t run with it all the way. Delta Air Lines is not in love with Kayak.com — they compete. Sometimes you get a better deal if you go direct. The schools and boot camps are still advertising; they would probably prefer not to pay you the commission. How do you think about that competition and that partnership? Over time, the big danger is that you become Google for job training: everyone funnels through you and then you have a lot of market power. That’s the dynamic we see everywhere.</strong></p><p id=\"ZveQtf\">I would think about it kind of like Glassdoor. [Glassdoor co-founder] Rich Barton’s a good entrepreneur that I like to study. There’s a really good article by Kevin Kwok called “<a href=\"https://kwokchain.com/2019/04/09/making-uncommon-knowledge-common/\">Making Uncommon Knowledge Common</a>,” where you take information that’s traditionally opaque and then you give power to workers — which, to your point, is what we do. We give power to workers so they have information, like Glassdoor gives you information about companies. Some companies don’t like transparent information about what’s going on, but workers do, which is why they check out those reviews. You can claim your page on Glassdoor if you want to or just let it run. You can get serious about making sure that you are doing right by your workers so that the reputation is good. I think there are players that do right by their users.</p><p id=\"nGGK5e\">Some players don’t do so nice for their students, which is why workers aren’t just trying to find schools that train them. They’re trying to find schools that aren’t predatory — that they can trust. We have worker trust. If you go to our directory, you don’t just see five-star reviews. You don’t just see reviews of people that graduated that have a graduation bias. You see pros and cons. You see outcome data that has been uploaded. You see companies where people have been hired. You see projects that have been uploaded by those individuals. You have the ability to see each one of those individuals’ profiles. At some point, you’ll also be able to see the live rooms for each school that are being hosted in real time. We will eventually be the Better Business Bureau of job training. We will be kind of like the Common App for every school, but yes, that’s important. Some people don’t like that.<strong> </strong>But the only time they don’t like that is if they’re not doing right by people. If they’re doing right by people...</p><p id=\"eidKZN\"><strong>Then they’re happy, and it’s like the movie poster with all the good quotes. Do you vet the schools before they come in? Is it like any boot camp can sign up and be a part of your thing and get rated? Or are you saying, “Hold up, first we have to make sure you’re legit”?</strong></p><p id=\"5ephI6\">It’s very important for schools to develop a reputation in the community first before coming into a marketplace. It is very important to us to understand whether schools have an online component. Even before the pandemic, that was very important for us: if you can have an online component, that means that you can train an infinite number of people. Also, it was most important for us to make sure that the schools had not just full-time options, but part-time options. Like I mentioned before, we’re serving blue-collar workers and most blue-collar workers can’t go to school full-time unless they’re really sacrificing something else. You have to have a part-time option. Ideally, you’re graduating thousands of people — at least 1,000 people a year. If you have 3 million people a month coming to us, we have to be able to have some volume to give you, right? Ideally you have accessible financing that doesn’t cripple people with debt.</p><div class=\"c-float-left c-float-hang\"><aside id=\"Oe4mHs\"><q>“Do you get people jobs?”</q></aside></div><p id=\"Xi4At7\">Ideally you have an income share agreement option or a deferred tuition option, not a situation where what was marketed to students is not what was promised and delivered. That’s important on the financing side of things. Do you have a history of job outcomes? Have you gotten people jobs? That’s very clear; it’s a very simple question. Do you get people jobs?</p><p id=\"hmB5W4\"><strong>Is that data that you audit? When the boot camps come to you, you’re saying, “Give me the books. We’re doing our diligence. We’re doing the audit. Okay. You’re in.” Or is that data self-reported? As you scale, that process is going to be a bottleneck.</strong></p><p id=\"1nha76\">It is an ongoing process that we are working on getting better at. Currently, if you go to our directory, you can actually see the outcomes data by school. There are entities like CIRR — the Council on Integrity in Results Reporting — that tracks data and things like that. We do watch data at the boot camp market report so that people are able to see outcomes by the top schools in our directory, but we have to get better at it. That’s part of the reason why we’re investing into a product and into data and into design so that we can not just have it inside of our directory, but we can make it easy for the schools to share. We can show them why that’s important and how it helps them not just with enrollments, but with outcomes and retention.</p><p id=\"m9Od3f\"><strong>Let’s talk about the great resignation. Around </strong><a href=\"https://www.washingtonpost.com/business/2022/01/04/job-quits-november-2021/\"><strong>4 million people per month are quitting their jobs</strong></a><strong>. As you said, </strong><a href=\"https://www.cbsnews.com/news/great-resignation-60-minutes-2022-01-10/#:~:text=The%20government's%20jobs%20report%20released,others%20the%20%22great%20resignation.%22\"><strong>20 million people in the second half of 2021 alone have quit</strong></a><strong>. There are endless theories about why it’s happening, but for you it represents an opportunity, right?</strong></p><p id=\"rppdj4\">Yes.</p><p id=\"da8N64\"><strong>How do you see that opportunity?</strong></p><p id=\"07TK3x\">When I was in Y Combinator and people asked me about what we did, I told them something different. I said that Career Karma helps job training programs find qualified applicants. On the next slide, I told them the same thing about serving blue-collar workers and how we get paid. Then I mentioned a big stat: I said 375 million workers are going to switch careers between now and 2030. Instead of going back to college, they’re going to rely on programs to find their next jobs. I talked about income share agreements being this unique thing happening that made them more accessible. I also talked about automation and how, because of technology and because of robots, a lot of jobs were going to be destroyed and new opportunities were going to be created.</p><p id=\"7ECmlb\">Some people pushed back on me during that time period. You could believe whether automation is here now, or it’s going to be coming later. Not everybody agreed with me at that point, but then the pandemic hit. When the pandemic hit, then that was kind of like a perfect storm to show that the digital economy is here. Once every company was forced to go online, new opportunities were created. In the beginning of 2020, it was a little bit rocky, but then last year tech had one of the biggest booms ever — it’s a record funding history. It’s $300 billion in funding that came out. What you saw in a lot of headlines is remote work, which was a very big deal — even though you see that our employment rate went down to 3.9 percent, the unemployment rate has actually grown for Black people, especially Black women, and brown people and many other people that are from underestimated backgrounds.</p><div class=\"c-float-right c-float-hang\"><aside id=\"psGMdy\"><q>“How do I take advantage of being able to work from home and record podcasts?”</q></aside></div><p id=\"XXpWaq\">Those individuals tend to be in those jobs that they used to be called heroes. They are heroes: the essential worker jobs on the front lines of the grocery stores and warehouses and hospitals. A lot of people aren’t giving them the respect and love that they deserve. So these workers are like, “Why am I doing this? Why am I putting my own family in danger? How do I take advantage of being able to work from home and record podcasts?” Since they knew the tech world was a very big deal, we started getting a huge influx of people that are interested in making this career transition. Now companies themselves are not just providing remote work opportunities, they’re recognizing that if they don’t go digital, they will die. When people hear me talk about the enterprise, they think I’m just going to go to like all the tech companies, which, I am definitely going to work with the gig economy companies.</p><p id=\"2vPkWx\">I’m not going to name them, but they have millions of drivers and shoppers that are in jobs that they don’t want, but they eventually want another job. The big opportunities are working with companies that have big workforces in retail and are shutting down stores. Since I’m not in this conversation, I can use CVS as an example: <a href=\"https://www.cnn.com/2021/11/18/investing/cvs-store-closures/index.html\">they shut down 900 stores</a> and they specifically said that they’re going to double down on digital. What happens to all those workers that just got shut down? They probably are not going to want to go back to another retail job because they don’t want the same thing to happen to them again. Like you mentioned e-commerce earlier — we’ve seen what Amazon did. You thought Amazon was the juggernaut, then Shopify popped up. That’s only going to continue to happen. What’s the last time you’ve been at a mall? I don’t know. I don’t remember the last time I was at a mall. </p><p id=\"pYs0NK\">People that are in these jobs have woken up and they recognize that they need to figure out not just how to find a job that pays, but whether that’s flexible, and how to always stay relevant. You can’t just get a new job and fall back by the wayside. These are all the things that are happening. I manifested that CVS thing, so if you’re listening to this right now, holler at me.</p><p id=\"8jfLU2\"><strong>There’s a lot of manifestation on </strong><em><strong>Decoder</strong></em><strong>. I don’t know if you know this. </strong><a href=\"https://www.theverge.com/22807858/tiktok-influencer-microsoft-excel-instagram-decoder-podcast\"><strong>We did an interview with a woman who manifests an audience on TikTok to sell Excel training courses.</strong></a><strong> She’s doing very well.</strong></p><p id=\"Jjd4iR\">I like that.</p><p id=\"HQkv9i\"><strong>That conversation was more about manifestation than I ever thought it would be, so you’re in good company.</strong></p><p id=\"XqFO0h\"><strong>You talked a lot about blue-collar workers and retail workers. You want to make sure that you’re offering them good training so they’re not getting ripped off. These income sharing agreements are fascinating — the boot camps take a percentage of your salary to pay off your training once you get the job. There are pluses and minuses to that, but you think that that was one of the unlocks to your business.</strong></p><p id=\"lHkFZ2\">Huge unlock.</p><p id=\"eGmKsd\"><strong>Go through the pros and cons of ISAs, because I’ve heard various versions of how well that works out.</strong></p><p id=\"2HQBhH\">I’ll give you an example of my brother. My brother got a job making $150,000 in five months. He went to a boot camp called App Academy. He did not know how to code before that. I believe at the time — I’m not going to say exactly what it was — but I think they charged around between 15 to 7 percent of whatever his future salary was going to be. I forget the time period, but think it was supposed to be paid off in three years. After he got a job, he ended up paying it all off in one year. It was less than $30,000 that he paid, and he got a job making $150,000 in five months, so that’s a good story.</p><p id=\"Wx732o\">Whenever you’re thinking about an income share agreement and whether you should sign up to one or not, I think the first question you have to ask yourself is: “Are they charging me a percentage of my tuition for the job that they are promising that they will get me?” Like a construction ISA contract where I promise to get you a job; if you don’t get a job, you don’t pay anything. If you do get a job, the tuition comes out of your salary, but the job that I’m helping you get needs to be the specific job that I trained you in. If it’s any job, then that can be challenging. That’s number one.</p><p id=\"glNHjy\">Number two: what percentage of the tuition are you charging? What’s cool about ISAs is that there’s a cap structure. Let’s say it’s like 10 percent tuition just to keep the math simple, and it’s a $100,000 job that you get. That’s $10,000 a year, and I tell you the cap is $15,000.</p><p id=\"pKlHxc\">By year one and a half, you’ll have paid off your $15,000, versus if you pay 10 percent for three years, then that’s $30,000 total. You have to ask yourself, “What’s the cap?” How they set the cap matters a lot. The time period also matters: do you have to pay it all in one year? Do you have to pay it in three years? Do you have to pay in five years? Colleges that have ISAs — which, by the way, colleges are the originator of income share agreements. It started at Yale University. I have a whole YouTube video on the history of income share agreements, but colleges tend to have longer durations for how to pay off income share agreements. I have a very big differentiator that I explained in that video about how income share agreements are not alone. Then I sang a bad version of Michael Jackson’s “You Are Not Alone.”</p><p id=\"qBPsoO\"><strong>This podcast has gone sideways. Now we’re doing karaoke.</strong></p><p id=\"Jhlh7d\">One other thing here — there is a new thing that I’m seeing that is very common. Deferred tuition is similar to income share agreements where they charge after you get a job, but instead of a percentage of your salary, it’s a fixed amount. It has more loan-like components to it — we’re not anti-loan, but we have to make sure that whatever it is that you’re thinking about doing is structured. We have to make sure that it doesn’t screw you over for years, like so many people who are screwed over with $1.8 trillion in student loans. If we’re sending somebody somewhere, we want to ensure that they are put in a good position. That’s why we have so much trust and so much loyalty in our community.</p><p id=\"T9pM7c\"><strong>One of the things that’s interesting is deferred tuition — you’re in and out, you’re done. You don’t have these loans to contend with. All that stuff is aimed at what you’re defining as your market: blue-collar workers, retail workers who are getting the short end of the stick. It’s a horrible time to be a flight attendant in America. The service worker economy is just suffering. All those people want out. They need a low-risk way to get a different set of skills. Underrepresented people need a different pathway in, but one of the things that struck me is the pathway is into tech companies. That’s where a lot of the money is. Tech companies are not great at retaining or developing their underrepresented employees. We hear these stories over and over again. If I had to tell you where the biggest scoops at </strong><em><strong>The Verge </strong></em><strong>come from, it’s unhappy workers at big tech companies over the last year. </strong></p><p id=\"P8aYEs\"><strong>How do you see that dynamic playing out? You want to get your market access to these opportunities, but then the companies are dropping the ball once they’re in the door.</strong></p><p id=\"UtVQ0w\">That’s such a good question. Breaking into tech is one thing, staying in tech is another thing. It’s not always the worker’s fault. It could be a toxic environment that they’re in. Company selection really matters. You don’t want to just look at the headlines for who are the hot companies. I’ll give a few examples of non-tech companies that are doubling down on tech. Domino’s—</p><p id=\"Gj4yWG\"><strong>They’re going to make the pizza tracker for real, because right now it’s fake.</strong></p><p id=\"NrTDIN\">I know, right? Domino’s, Target, Goldman Sachs, JP Morgan, Walmart, Starbucks, Nike — all of these companies are really, really investing in their digital side of things. If you actually look at the open jobs that — I’m probably going to screw up the stat that I heard through the grapevine, so these are not my words — Target hired like over 2,000 software engineers last year. A company like American Express, for example, is very well known for customer service and probably has really good training internally, so what does a company like American Express look like, hiring someone in a tech job and training them and retaining them and surrounding them with love?</p><p id=\"dnKCHP\">I have not looked at American Express Glassdoor reviews, but I would assume that they’re high just because I do like the customer service. Identifying companies that are well known for having really good internal cultures that are in an antiquated position and need to double down on digital is probably a good idea. There are some retail companies that are transforming into e-commerce companies. It’s not just retail companies that are affected, like you mentioned: the travel industry, the trucking industry, the oil and gas industry, and the health care industry — there are so many spaces that are being changed. Find the ones that have really good reputations for training, and at some point, Career Karma will have a company directory as well to be able to give you that information too. </p><p id=\"tZiHdV\"><strong>You’ve talked about Glassdoor a number of times, but once someone is in the industry and has proven their value, they’re looking for their next gig. They might not come back to Career Karma for skills. They might start engaging recruiters or LinkedIn. But those are open pathways for Career Karma, right? Is that where you’re going?</strong></p><p id=\"GvO5Xt\">That’s the play. I mean, number one: become the number one destination for career advice on the internet. Number two: become the world’s largest community of career transitioners online. If we’ve given you advice, where do you think you’re going to go to get guidance about where you want to go next? When people are thinking about picking schools, where do they go? They go to their families and their friends. but if the family and friends don’t know about these career paths, they come to a place like Career Karma. They meet a family of strangers that end up being like a pseudo-family that really become their friends for life. They build a lot of social capital with those individuals, and a lot of those individuals get jobs through Career Karma. Then, when people are in the job search, those people are able to get referred into companies because most jobs come through referral. Then we can have a directory of companies where — here’s a good example. Are you in the Bay Area?</p><p id=\"EvGjpZ\"><strong>No, I’m in New York.</strong></p><p id=\"XbaVLC\">You’re in New York. Have you always been in the tech world or the journalism world?</p><p id=\"CEn1N9\"><strong>I was a lawyer before.</strong></p><p id=\"tzisDs\">You’re a lawyer. Okay, cool. Imagine if I could show you a list of companies with former lawyers that graduated from Flatiron School in New York.</p><p id=\"ZzANy8\"><strong>I’d run. A company of former lawyers? Get out!</strong></p><p id=\"GXdw7k\">Or whatever it is. But now you have found people who hated being a lawyer who also figured out how to transition into tech, by level of concentration: “Wow, I found my people that also wanted to get out and made it and had their exit opportunities. These are companies that are probably likely to hire me. All right. Now let me look at each one of those companies. How long have they stayed at those companies? Are they remaining in it or are they using those companies as their first job on the resume to flip and get the next job?” Because a lot of people get higher salaries by job hopping, which is another reason why people are changing jobs all the time. I think that’s the right approach in order to start building out reputations, not just by reviews and stuff like that. We will be doing things on the company side at some point, so we are going to start building a company directory this year.</p><p id=\"O8MSUG\"><strong>And then you’re doing the enterprise stuff and helping companies train their own workers?</strong></p><p id=\"zOGVKY\">Yeah.</p><p id=\"w6YLiK\"><strong>You’re kind of describing a fairly traditional job market: with some training, some resources, some transparency, some democracy of access, but you’re still trying to get a job with a 401(k), stay there for years, and then you’re off to get another job. I would say one of the trends is that a lot of people are like, “I don’t want that. I want to trade Bitcoin all day and then play </strong><em><strong>Halo</strong></em><strong> all night. I want to find another community, another way to make money in my life.” Is that a threat? Is that an opportunity? Is that just happening in parallel and it’s not disrupting your market? Because that is the flip side of all of this, people saying, “I don’t want these traditional careers. I’ll be a free agent. I’ll do it project-based. I’ll get out, I’ll travel for six months, I’ll come back and do it again.”</strong></p><p id=\"7unYV8\">That’s a great question. I love all these questions. Probably one of the best questions I’ve ever heard. The creator economy is a very real thing. Assuming that we have all of these things that we just described, those creators might want to create a lane for themselves, educating people on crypto or Web3, for example. Most people at Career Karma have no idea what Web3 is. They’re still trying to figure out what to — a lot of them don’t even know what JavaScript is. Nothing wrong with that. Most people don’t, right? There’s room for creators to host audio rooms or post inside of our community to reach those people, to build their audiences and be freelancers and make a lot of money by selling their own courses that are effective and get people jobs, that we can host inside of our community as well.</p><div class=\"c-float-left c-float-hang\"><aside id=\"jYmVaQ\"><q>“I believe that the individual creator will be bigger than any institution by itself.”</q></aside></div><p id=\"NylTQg\">This is my personal opinion: I believe that the individual creator will be bigger than any institution by itself because that’s where things are going. You’re starting to see it with podcasters. Joe Rogan himself is bigger than many media platforms. You can see that as well with education. I was just with my crypto friends recently, and I was asking them, I was like, “Hey man, I’m moving to Miami. I see tokens and crypto and it’s such a big thing, but there’s so much scamming that’s out there. So it’s hard to understand what’s real and what’s fake. What should I listen to?”</p><p id=\"YUnQ7D\">He started giving me recommendations of what I should listen to and who I should talk to and what courses to take, because I need to educate myself about what’s going on with the new economy. There’s ways to get paid through cash, stock options, but then there’s tokens. So, you have to understand that, especially if you’re thinking about building a big community, because if you don’t, you’re going to get left.</p><p id=\"nvlV1y\">Anyway, I do think that the creator economy is a big deal, and I do think they can build their audience inside of Career Karma. Garry Tan, who is at Initialized, also a former Y Combinator [partner] that created Bookface internally for [Y Combinator] — he says that Career Karma was like Y Combinator for the people. Y Combinator is based on first-time founders and Career Karma is based on people [getting tech jobs] for the first time. Right now we’re helping people get jobs. Eventually those individuals could either start their own courses or start their own companies. Eventually we could probably connect those people to not just Y Combinator, but any other accelerator as well, and maybe even cut a check directly to them. One of our angels is Jack Altman, CEO of Lattice. When people leave his company — which eventually they will — if they want to start a company, there’s a world where they can cut them a check as well. Just like Slack has a fund, Salesforce has a fund, Citi — all these people have these corporate venture funds.</p><p id=\"1yfZ7z\"><strong>It’s funny. I did mention Bitcoin so I probably led you there, but I asked about how people are thinking about careers broadly and you immediately went to creators and crypto, right? And maybe like in the tech world, those are the answers; if you don’t want a 9 to 5, you have a podcast. It’s a great marketing channel for Career Karma. But I’m a big YouTuber, I hear it all the time. We interview YouTubers, very complex businesses, but that’s not all. There are other people who are saying, “I was a nurse at a hospital and if I just quit my job as a full-time nurse and now am a traveling nurse, I actually make more money and I feel more respected.” We were actually doing a story about accountants and tax season. Accountants across America are furious at their lives and they’re all bailing out. They’re not all going to become podcasters, but the nature of the profession, or the nature of how the profession is organized, will change. For example, sales is one of your career paths. Is that something you see happening as well?</strong></p><p id=\"0v7qmL\">I think the freelance economy is huge because of the internet. You can get money in so many ways. You could pick something random, like, “I want to get money doing this,” and there’s probably a way for you to make money from it. I would think about jobs more as the way to get the skills for who you ultimately want to be. We’ve entered into the end of occupational identity where you’re not an accountant or a lawyer or whatever, you’re just who you are. There’s a really good book by [LinkedIn co-founder] Reid Hoffman called <em>The Start-up of You</em>. The book mentions how you do these tours of duty during your lifetime that help you become your ultimate version of who you are.</p><p id=\"GK2A4i\">The relationship with the job is less like, “How does this pay me the most amount of money so I could retire and take care of my family?” And more like, “How does this help me at this moment of time to become the version of myself that I ultimately want to be?” Our whole view of what retirement years are is changing. In addition to working at a startup, outside of skills, people are looking to be able to say that they built something that’s a W — not necessarily to put on their resume to get another job, but to be able to say that they did it so that when they do strike out on their own, they can say, “I’ve done this before. Listen to me.”</p><p id=\"WCC0VT\"><strong>Is there any better credibility than saying I did it already? It’s pretty good.</strong></p><p id=\"1hcGod\">Period.</p><p id=\"LFW4nR\"><strong>On creators, you mentioned you’ve got people on your platform who are offering courses. You’ve got a live audio component. You’ve talked a lot about how you might scale. Once you start doing user content like that and letting people just talk live, you get moderation problems. Like, “I did it and now I have credibility. Listen to me, because I’ll tell you.” That could just be a total scam. How are you thinking about those moderation challenges?</strong></p><p id=\"QswLNC\">Such a good question, man. Seems like you’ve done this before.</p><p id=\"pdiM2u\"><strong>Here, you want the secret of </strong><em><strong>Decoder</strong></em><strong>: it’s all the same questions every time. Everybody’s got the same problems. It’s the whole secret of the show. The only thing I haven’t asked you about is a chip shortage. Is that affecting you?</strong></p><p id=\"Mecw4I\">The chip shortage, I don’t know.</p><p id=\"seDi7h\"><strong>That’s it. It’s the one box that I haven’t checked with you, but moderation seems like it’s—</strong></p><p id=\"BnbR0f\">Moderation’s right there. Even though we have the live audio component and it’s special, and we have this huge war chest that we can scale quickly, I will say this lightly: I want to avoid the moderation issues that come from scaling live audio that we’re all familiar with. It’s very important to make sure that as you grow that you don’t just expand to every single career set immediately. You want to make sure that you are thoughtful about it. Right now, most of the rooms are hosted by us, but we have opened it up so anybody can start a room because the purpose of technology is to give people a voice — the power to create and the power to organize. We still want to be thoughtful about who is speaking inside of the rooms, and we’re starting with schools and students and alumni themselves. The short answer to your question is we haven’t fully figured it out yet. We’re not dealing with that issue yet, but we’re mindful that it could be a problem, so we study different communities </p><div><aside id=\"xW1YGM\"><q>We have friends at all of those entities that have given us guidance on how to create community guidelines in a way that doesn’t turn into a cesspool.</q></aside></div><p id=\"tEcLRu\">that have done it well. I do like how Discord has done things. There’s a lot of things that we have to be careful of, and learn from other people that we admire in the ecosystem about challenges that they have faced. We have friends at all of those entities that have given us guidance on how to create community guidelines in a way that doesn’t turn into a cesspool.</p><p id=\"rgzSg6\"><strong>All right, I don’t have to be as polite as you. It’s the benefit of my gig. I’ll tell you: I think Clubhouse has a massive moderation issue. Every night on Clubhouse, people are just wilding. It’s nuts. They haven’t solved it. With live audio in particular, how do you solve this issue? Unless you record everybody to have access to a history, so you can make a decision. That’s iffy for another whole host of other reasons. Then you’ve got the scale problem. If you let everybody do everything, you’re going to spend all 52 million of those dollars just hiring moderators all day. Those are just the basics. Are you recording everybody all the time? Are you just managing the scale of rooms? Are you going to hire your own moderators? Are you going to contract that out to Accenture or whatever? How are you thinking about that?</strong></p><p id=\"fWKgMK\">We do have moderators right now. We also have groups called squads; they’re squad leaders. We have a lady named Brenda that just joined us from Udacity. Then we have Julie, who is in charge of our events, and some product managers like Melvin who are managing these rooms. I think the trick is to really keep the rooms small right now to test a lot of things. We are launching recorded rooms in the first couple of quarters, but it’s less on moderation types of things and more so that people have power to build their own brands as an individual, which is a different conversation than this one. I think the short answer to your question is: don’t get distracted by the amount of capital that you’ve raised, to just spend it and burn it all to just grow users at all costs without understanding how they’re retaining and how they’re interacting. Are they really getting value out of it?</p><p id=\"EQ55Lr\">I talked about design earlier, but having designers that are really asking unbiased questions and not leading questions for the outcome that you want is important. We want to build the world’s largest community of career transitions online, but you could ask questions to your users that have your own biases in mind, that are revalidating your thinking, instead of making you reorganize your stuff so that you could retain people inside the community. That’s going to be very important. One of our angel investors is also the CEO of Apna, which is the fastest growing unicorn in India. It’s a workforce development company. They got to 16 million users in two years and they’re doing very well, so we’re speaking with people like him about how to find the balance of growing fast, moderation, and serving people properly.</p><p id=\"J6Lyqw\"><strong>I hear about responsible growth mostly from platforms. Do you think of this as a social platform like that? You mentioned people building their own brands there. I wouldn’t have started this conversation thinking that Career Karma is a social platform and it’s going to have social platform dynamics, but you’re headed in that direction. You’re using that language. Is that what you’re thinking about?</strong></p><p id=\"T806sO\">Yes.</p><p id=\"0MdC6C\"><strong>That was great. Perfect answer. No follow-ups.</strong></p><p id=\"sgnd3v\">That is correct.</p><p id=\"rr9eeC\"><strong>Really? So Career Karma is in the same zone as Twitter and YouTube?</strong></p><p id=\"1sDzlB\">If you think about the people that we are serving — they’re blue-collar, right? Blue-collar workers don’t look good on LinkedIn because a lot of them didn’t go to college. I don’t like the word blue-collar anyway, and I’m not shutting down LinkedIn. I think LinkedIn is amazing, but it’s geared towards white-collar workers. If a lot of people join Career Karma who never had a LinkedIn profile before or have never had an online resume before — we are their first version of a digital identity. Since we have such good SEO, when people Google their name, we pop up number one. That profile is rich. It has who they are, where they’re from, what school they’re attending, what stage that they’re at, what projects they’ve built. That’s big because the resume is dying. There’s so many things that are out there, but yes, that’s the next phase. We’ll talk about that at the next fund raising.</p><p id=\"PFqY9w\"><strong>Lastly, you just mentioned that you moved to Miami. We’ve seen this massive shift to remote work. People are reorganizing themselves physically as well as in their careers. Is that here to stay or do you think people are going to re-sort into cities and offices?</strong></p><p id=\"pnkCmu\">Oh, people are not going to go back to their offices full-time. </p><p id=\"Pfi8Fq\"><strong>You’re in an office right now?</strong></p><p id=\"PXznJh\">No, this is my live-work space. These are all laptops. We have a living wall over there. We have bedrooms upstairs. We have bunk beds here for anybody in the job search. We always keep that open, but we’re 100 percent remote. We’ve been remote since before remote was cool. We started in April of 2018, so if you want to check my receipts, check. </p><p id=\"63OWtp\">I do think that human interaction matters. Last night I was with one of our new data hires. He came from North Carolina to visit, to break bread with us. I’m from the South so I understand the importance of Southern hospitality. Eating food in person is not the same as eating food on a Zoom video.</p><p id=\"b9RdSy\">But when you think about the cost savings that a company has, the life that is wasted on a commute back and forth — some people would be on a commute back and forth between New York and New Jersey for hours every single day. I think that pretty much every company is either going to go fully remote or hybrid. That’s why I do think that co-working spaces have a big opportunity. I also think co-living spaces have a big opportunity. When I first moved to the Bay Area, I lived in a house with 14 people. It was a big mansion in the Mission, but there’s now companies like <a href=\"https://www.launchhouse.com\">Launch House</a> that are starting to buy up different houses. As people get more wealthy, they’re able to buy more land and property. They’re able to expand out to different places.</p><p id=\"ZYKEqf\">I was just in Argentina last week with my co-founder, and now I’m here doing this interview, and I could pretty much pick wherever I want to go tomorrow and work from there, as long as it has a Wi-Fi and internet connection and be just as effective. I don’t see why anybody wouldn’t want to do that. </p><p id=\"Npo6K8\"><strong>This is the back-and-forth here. Right? I hear that, and then I hear, we’re all going to Nashville or Austin or Miami.</strong></p><p id=\"UN59P5\">The reason why I’m going to Miami is, first of all, I have an advantage. So, I’m Black and I speak Spanish, that’s my first language; and then, I’m close to my family. Personal reasons, which I think are very important. And you have a lot of growth from tech jobs’ perspective, venture capitalists coming there, operators coming there, companies wanting to change and a lot of hunger to be one of the most driven cities in the nation. There’s a very vocal politician that’s really speaking about what’s going on. But you’re already starting to see similar dynamics to other cities that have done this, where the rents are starting to go up and the local people that make the city magical don’t know about how to take advantage of the opportunities that are being presented.</p><div class=\"c-float-right c-float-hang\"><aside id=\"cNlorC\"><q>“The local people that make the city magical don’t know about how to take advantage of the opportunities that are being presented.”</q></aside></div><p id=\"xdtweB\">Think about San Francisco: you have people in Oakland and in San Francisco that used to live here, that are from the Bay. They can’t live here anymore. They know why it’s happening. They know tech has taken over, but they don’t know how they can get a piece. What’s interesting about Miami is like 50 percent of the economy is in the service sector, making $35,000 a year and susceptible to automation. I brought up automation earlier in this interview; it can kick them out of those jobs. What I want to do is work with the people. I want to work with the government and the local employers — not just the tech companies, but the local employers that have to change into tech companies — the universities that are there, Miami has a great university system. So we have to figure out how to create a playbook to make sure that local people can take advantage of these jobs.</p><p id=\"Url5QY\">I’m working with Saif [Ishoof] over there, who’s worked with [Miami Mayor] Francis Suarez to come up with a playbook, work with workforce development agencies like Rick Beasley that I know over there, to come up with the playbook that works for Miami. If that works for Miami — I believe Mayor Suarez is now in the US Conference of Mayors, so whether it’s through him or if I do it myself — I’m going to figure out how to get to all the other cities in the nation to get that done. Then I’m going to talk to Davos and the World Economic Forum, tell them this is what they need to do. That’s going to happen. I manifest that too.</p><p id=\"p686zn\"><strong>All right, man. This is great. We started with the resume being dead and we ended with Mayor Suarez will change everything. We need to get him on this show. </strong></p><p id=\"yJvxbu\">I can set that up. I’ll figure it out.</p><p id=\"tXKhaA\"><strong>Let’s do it. Last question. This is the easy one. You have a lot of big plans. You just raised some money. You’ve got some steps ahead of you. What’s next for Career Karma? What’s the next big thing we should see from a user perspective or a consumer perspective?</strong></p><p id=\"rpo0EH\">On the ideal side of things, I think that’ll be the recorded live audio rooms. I think that’s going to be a really big deal. I think up until this point, you’ve only had students and schools hosting rooms, and some companies like Pandora and others that host rooms. We’re going to see a lot more companies involved with the community. But you’re also going to see really interesting nonprofit communities, like Dev Color and Women Who Code, and Slack communities and others that have been self-organized start joining the platform. I think that’s going to all really be interesting to see how we get all of these communities that exist in Facebook groups and other places on the internet into Career Karma. That will be cool.</p><p id=\"OOiEqk\"><strong>That’s great. Ruben, this has been a fascinating conversation. Thank you so much for coming onto </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"6K97Kg\">Thank you, brother.</p><aside id=\"haeyZM\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe now!\",\"url\":\"https://podcasts.apple.com/us/podcast/decoder-with-nilay-patel/id1011668648?i=1000496212371\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/yVcMNy0-Y3OBQR4K7_ry0FR4y3c=/0x73:2050x1146/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23209674/VRG_ILLO_Decoder_Ruben_Harris.jpg",
  "description": "Amidst the \"Great Resignation,\" Career Karma will help you escape retail hell by finding you a job training program to get a new career.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}