{
  "title": "The best gaming headset deals you can get right now",
  "url": "https://www.theverge.com/good-deals/22876408/best-gaming-headset-deals-sales",
  "date": "2022-05-19T00:08:13.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/twf3rzDdhwbFmzx5reNOs-ZvcC8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70446099/akrales_211109_4870_0299.0.jpg\" />        <figcaption><em>Logitech’s budget-friendly G435 boasts color and comfort, as well as a host of solid features.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"4pbkcW\">A good gaming headset is practically a necessity these days. Clean and precise audio is essential for competitive gaming, allowing you not just to pinpoint your enemies but to communicate effectively with your teammates. Moreover, recent developments in spatial audio and virtual surround sound have allowed headsets to meet — and occasionally surpass — more expensive audio setups, allowing even the most budget-conscious gamer to obtain a competitive edge at a fraction of the price.</p><p id=\"L38ri8\">While you could always invest in a massive pair of speakers, they’re likely to earn you the dubious distinction of the worst roommate of the decade. Thankfully, the right headset will allow you to keep the running and gunning to yourself, which is why we’ve rounded up a collection of the best deals you can currently find on some of our favorite models.</p><aside id=\"nNSwiH\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The best wired or wireless gaming headsets to buy\",\"url\":\"https://www.theverge.com/21549510/best-gaming-headset-wired-wireless-features-specs-price-sound-microphone-test-buy\"},{\"title\":\"The best wired or wireless gaming mouse you can buy\",\"url\":\"https://www.theverge.com/21252193/best-gaming-mouse\"}]}'></div></aside><p id=\"jivJMA\">For the sake of clarity, we’ve broken the deals down into two categories: wireless and wired. The former is tailored toward gamers looking for a little less clutter in their setup, while the latter is aimed at anyone who doesn’t mind a little extra cabling or is looking for a headset that's a little more budget-friendly.</p><div id=\"D187Y7\"><div data-anthem-component=\"table:11089914\"></div></div><h2 id=\"7EBSnw\">The best wireless gaming headset deals</h2><h3 id=\"ac6WRy\">Logitech G435</h3><p id=\"6nDk4v\"><em>Compatible with PC, PS4, PS5, Nintendo Switch</em></p><p id=\"bqOPQC\">Definitely the boldest headset on our list, the Logitech G435 is a gaming headset perfect for anyone that isn’t afraid to make a statement. This comfortable, colorful headset is on sale in a variety of colorways at <a href=\"https://www.amazon.com/Logitech-G435-Wireless-Gaming-Headset/dp/B08R8GJPC2/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a>, <a href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM&amp;mid=24348&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Fconsoles-hardware%2Fdesktops-laptops%2Fpc-headsets%2Fproducts%2Flogitech-g435-wireless-gaming-headset-for-pc%2F295436.html%3Futm_source%3Dgoogle%26utm_medium%3Dfeeds%26utm_campaign%3Dunpaid_listings%26a%3D1\" rel=\"sponsored nofollow noopener\" target=\"_blank\">GameStop</a>, and <a href=\"https://shop-links.co/cgVTIxdsbfs\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> for just $59.99, nearly matching its best price to date.</p><p id=\"re6j7P\">Logitech’s on-ear headset features both Bluetooth and 2.4Ghz wireless connectivity, making it compatible with PCs in addition to consoles and mobile devices. The 18-hour battery life is impressive, too, and while it does lack the more traditional 3.5mm audio jack, the included USB-C cable can be used to simultaneously charge and listen.     </p><p id=\"3Bo973\">While the lightweight headset lacks the prevalent boom-mic design used by other headsets in this category — it opts for beamforming microphones — the integrated mic still manages to provide an adequate audio input solution. This has the added benefit of giving the headset a more traditional, on-ear profile, giving you the option of wearing these in public without broadcasting your gamer status.</p><div id=\"tS3KsZ\"><div data-anthem-component=\"productcard:10866389\"></div></div><h3 id=\"djrvF2\">Razer BlackShark V2 Pro</h3><p id=\"EPVc1E\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S, Nintendo Switch (via 3.5mm audio)</em></p><p id=\"KDRPr5\">The wireless version of the esports-inspired BlackShark headset from Razer boasts a lightweight, aviator design and is currently discounted in multiple colorways to $139.99 at <a href=\"https://www.amazon.com/Razer-BlackShark-Wireless-Gaming-Headset/dp/B08FQG96RP?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24348&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Fconsoles-hardware%2Fdesktops-laptops%2Fpc-headsets%2Fproducts%2Frazer-blackshark-v2-pro-wireless-gaming-headset-with-microphone%2F258919.html%3Futm_source%3Dgoogle%26utm_medium%3Dfeeds%26utm_campaign%3Dunpaid_listings%26a%3D1\" rel=\"sponsored nofollow noopener\" target=\"_blank\">GameStop</a>. This isn’t the lowest price we’ve seen the comfortable headset go for, but it remains a solid discount on an excellent gaming headset that normally retails for $179.99.</p><p id=\"4TjLw6\">The Razer BlackShark V2 Pro is sturdy and perfectly suited for extended play sessions. The only break in its otherwise innocuous profile is a dedicated knob on the right earcup that allows for quick adjustments to volume when necessary and its detachable boom mic. The headset also features a 3.5mm audio jack and can be paired via 2.4Ghz wireless thanks to the included dongle, but the lack of Bluetooth is a bit disappointing. The V2 Pro is THX 7.1 surround capable, too, and comes with an included license for Razer’s THX Spatial Audio software.</p><p id=\"NoCFmg\">In terms of battery life, the V2 Pro is capable of lasting up to 24 hours on a single charge, making it one of the longer-lasting headphones on the market. Sadly, however, it still relies on Micro USB for charging.</p><div id=\"FUfm2k\"><div data-anthem-component=\"productcard:11144495\"></div></div><h3 id=\"jKN5gn\">Razer Barracuda X</h3><p id=\"U7c1cL\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S (via 3.5mm), Nintendo Switch</em></p><p id=\"iMxtmY\">The Razer Barracuda X, another solid entry from team green, is definitely one of Razer’s more versatile (and affordable) options when it comes to wireless gaming headsets. It typically retails for $99.99, but the black, and white colorways are on sale at <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24348&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Fconsoles-hardware%2Fdesktops-laptops%2Fpc-headsets%2Fproducts%2Frazer-barracuda-x-wireless-gaming-headset%2F295615.html\" rel=\"sponsored nofollow noopener\" target=\"_blank\">GameStop</a>, and <a href=\"https://www.amazon.com/Razer-Barracuda-Wireless-Multi-Platform-Headset/dp/B096N6Q51N/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> right now for $79.99, just $10 shy of their best price to date. </p><p id=\"kwA6xJ\">The Barracuda X is a fairly unremarkable headset at first glance, given its standard design, but despite its bulkier profile, it is actually lighter than the Razer BlackShark series of headsets. <a href=\"https://www.theverge.com/2021/7/13/22566803/razer-barracuda-x-wireless-headset-ps5-nintendo-switch-android\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Our initial impressions</a> by <em>Verge </em>staffer Cameron Faulkner noted how comfortable the Barracuda X was, even after several hours of wear, and mentioned that the design sets a strong precedent for potential future iterations.</p><p id=\"3ovLKR\">While the lack of Bluetooth makes the Barracuda X a poor choice for mobile gaming, the 2.4Ghz wireless dongle uses a USB-C connection, meaning that you won’t have to rely on a 3.5mm audio cable to use the headset with your Nintendo Switch. The USB-C dongle can enable wireless connectivity with PS4 and PS5 thanks to the included adapter, too, but it can’t be used with Microsoft consoles unless you use a wired connection. </p><div id=\"aRl0PA\"><div data-anthem-component=\"productcard:10669983\"></div></div><h3 id=\"hZINZz\">HyperX Cloud Core Wireless</h3><p id=\"0lMsdO\"><em>Compatible with PC, PS4, PS5</em></p><p id=\"noEq3e\">At first glance, you’d be forgiven for mistaking HyperX’s Cloud Core Wireless — which is currently <a href=\"https://shop-links.co/cheCEStXq9s\" rel=\"sponsored nofollow noopener\" target=\"_blank\">on sale for $69.99 ($30 off) at Best Buy</a> — for its more expensive cousin, the Cloud II Wireless. Both feature virtually the same design, with a padded leatherette band and removable earcups, as well as the ability to pair with devices via 2.4Ghz wireless. They also feature a detachable, noise-canceling microphone and the same 53mm drivers, which managed to deliver punchy, balanced sound when we tested them in the <a href=\"https://www.theverge.com/21519747/hyperx-cloud-ii-wireless-pc-gaming-headset-ps4-ps5-nintendo-switch-usbc-review-release-date-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Cloud II Wireless</a>. Both feature support for DTS:X virtual surround sound as well, allowing for more precise directional audio while gaming. </p><p id=\"N7iczf\">If you’re on a budget, however, you’ll be happy to know that the bulk of the compromises the Core Wireless makes to achieve its more accessible price point are relatively minor. It omits Bluetooth connectivity, for instance, which limits its compatibility with other devices, and it swaps out some of the aluminum hardware found on the Cloud II for plastic. HyperX also claims the Core Wireless only offers 20 hours of battery life per charge, which is 10 hours less than the Cloud II Wireless. Still, the Cloud Core remains a straightforward headset that’s currently available for less than $100.</p><div id=\"abDlTE\"><div data-anthem-component=\"productcard:11191663\"></div></div><h3 id=\"DuxNl0\">Razer Nari Ultimate</h3><p id=\"RVzf9x\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S (via 3.5mm), Nintendo Switch</em></p><p id=\"3XocHy\">The Nari Ultimate, the high-end model in Razer’s Nari lineup, offers a fairly comprehensive list of features for a wireless headset. The headset normally retails for $199.99; however, it’s currently on sale on <a href=\"https://www.amazon.com/Razer-Nari-Ultimate-HyperSense-Gel-Infused/dp/B07HZ6YWNB/ref=asc_df_B07HZ6YWNB?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> for $137.35, one of its best prices to date.</p><p id=\"KHFH33\">Like the rest of the Nari lineup, the Ultimate comprises an aluminum frame with leatherette cushions on the headband and earcups. The adjustable boom mic can be quickly muted by retracting it into the earcup, and each earcup sports an RGB Razer logo that can be customized using the Razer Synapse software or the Razer Chroma app. The Ultimate also features a bass-heavy sound that's accentuated not only by THX Spatial Audio but Razer’s “Hypersense” feature, which provides haptic feedback through the earcups for thunderous sounds.    </p><p id=\"eMNkz6\">The only real drawback to this particular model is the lack of wireless connectivity with Xbox consoles. You can use the headset with an Xbox One or Series X / S, but only via a 3.5mm wired connection.</p><div id=\"VelKQA\"><div data-anthem-component=\"productcard:11121119\"></div></div><aside id=\"5UbqUK\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Verge Deals on Twitter\",\"description\":\"Join our over 46,000 followers, and keep up with our best daily tech deals with @vergedeals\",\"label\":\"Follow us!\",\"url\":\"http://bit.ly/2JzR5Ud\"}'></div></aside><h1 id=\"E9Dfnk\">The best wired gaming headset deals</h1>  <figure class=\"e-image\">        <img alt=\"EPOS H3 gaming headset\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sNWBy4WEPCnP3Wr9Qjb9ZBb1vdg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22455569/eposh3text.jpg\">      <cite>EPOS</cite>      <figcaption><em>The mic on the EPOS H3 is muted when it’s flipped up, as it is in the picture.</em></figcaption>  </figure><h3 id=\"3v06Bq\">EPOS H3 Closed Back gaming headset</h3><p id=\"HaXqz6\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S, Nintendo Switch</em></p><p id=\"StgB3o\">The EPOS H3 is a newer release from this lesser-known manufacturer, and you can currently find the lightweight headset on <a href=\"https://www.amazon.com/gp/product/B08YZ9NMB5/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and <a href=\"https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&amp;mid=24348&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Felectronics%2Faudio%2Fheadphones%2Fover-ear-headphones%2Fproducts%2Fepos-h3-wired-headset%2F307695.html%3Futm_source%3Dgoogle%26utm_medium%3Dfeeds%26utm_campaign%3Dunpaid_listings%26a%3D1\" rel=\"sponsored nofollow noopener\" target=\"_blank\">GameStop</a> in either the black or white colorway for $78.03 instead of $99.99, which matches its best price to date.</p><p id=\"bgvtaT\">The headset shares a similar form factor to its more expensive siblings, with wide-set, closed-back earcups that offer some decent noise isolation but fall short of what you’d expect when it comes to active noise cancellation. This design choice also lends the H3 an excellent sound stage that's equally impressive for gaming or just jamming out. Overall, the sound quality easily rivals headsets that normally cost twice as much.</p><p id=\"8lnJv6\">Elsewhere, you’ll find a flexible boom mic that is hardwired to the headset and can be flipped up to quickly mute it. The right earcup also has a knob for fine-tuning volume, but the H3 lacks a built-in audio mixer as well as the ability to adjust the mic pickup levels. It relies on a 3.5mm audio connection as well, which may prevent it from working with some mobile devices, but it’s otherwise compatible with all current consoles and PC.</p><p id=\"eJ3hes\">Indeed a bit larger than your average gaming headset, the EPOS H3 remains deceptively light. And while it may not appeal to everyone from an aesthetic standpoint, the thick leatherette cushions that cover its contact points make the EPOS H3 an excellent choice for extended wear. <a href=\"https://www.theverge.com/22392330/epos-h3-gaming-headset-wired-pc-ps5-xbox-series-x-s-ps4-nintendo-switch-features-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Read our review.</strong></a></p><div id=\"MJDL4G\"><div data-anthem-component=\"productcard:11143952\"></div></div><h3 id=\"Ajs0LR\">Logitech G Pro Gaming Headset</h3><p id=\"gcH5or\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S, Nintendo Switch</em></p><p id=\"ENuBME\">This esports-centric entry in the wired category gets serious points for opting for its super-clean aesthetic. The Logitech G Pro headset was designed with esports in mind and is currently <a href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM&amp;mid=24348&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Fconsoles-hardware%2Fdesktops-laptops%2Fpc-headsets%2Fproducts%2Fg-pro-gaming-headset%2F203880.html\" rel=\"sponsored nofollow noopener\" target=\"_blank\">available at GameStop</a> and <a href=\"https://www.amazon.com/Logitech-G-Pro-Gaming-Headset/dp/B07PHML2XB/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> for $79.99, a modest discount on its typical $99.99 price tag. This is still one of the lower prices we’ve seen for this particular headset, which was already a substantial value prior to the current discount.</p><p id=\"8M9DjP\">The G Pro is remarkably simple in terms of its appearance, with no visible knobs or buttons, and no extra ports with the exception of a second 3.5mm audio jack for the detachable boom mic. In addition to the expected 3.5mm audio cable, the G Pro also comes packaged with velour ear pads that can be swapped with the standard leatherette earcups, as well as an external USB DAC that can be used to fine-tune your audio experience on PC using Logitech’s G Hub software.</p><div id=\"xu1PZQ\"><div data-anthem-component=\"productcard:10984462\"></div></div><h3 id=\"KNWatD\">HyperX Cloud II</h3><p id=\"eDUC6H\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S, Nintendo Switch</em></p><p id=\"bMwPlS\">Reminiscent of the minimalist designs used by Logitech and Corsair, the HyperX Cloud II is a simple and effective headset that’s currently on sale in the black-and-red colorway for $66.06 at <a href=\"https://www.amazon.com/HyperX-Cloud-Wireless-Detachable-Cancelling/dp/B00SAYCXWG?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and $66.99 at <a href=\"https://shop-links.co/cgWlCn6f36v\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> — decent discounts for a headset that usually retails for $99.99.</p><p id=\"mM4SCI\">The Cloud II is a versatile, wired headset that’s remarkably comfortable and features audio fidelity that’s typically reserved for headsets that cost twice as much. The 53mm drivers deliver sound that is both punchy and balanced, much like those found in the <a href=\"https://www.theverge.com/21519747/hyperx-cloud-ii-wireless-pc-gaming-headset-ps4-ps5-nintendo-switch-usbc-review-release-date-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">wireless version we reviewed</a> in 2020, and there’s a virtual 7.1 surround sound mode for added effect. The headset also features a detachable, noise-canceling mic, as well as inline remote for adjusting the volume of both the mic and audio playback.</p><p id=\"LJhYff\">It may not be as capable as its wireless sibling, but the HyperX Cloud II remains an excellent option that’s compatible with all contemporary consoles and mobile devices as long as you have a USB-C adapter.</p><div id=\"LRRlfL\"><div data-anthem-component=\"productcard:11001321\"></div></div><h3 id=\"WiwNLx\">Razer Kraken</h3><p id=\"dBEWC8\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S, Nintendo Switch</em></p><p id=\"Dj6sEk\">An absolute unit of a headset, the Razer Kraken is currently on sale in its green colorway at <a href=\"https://www.amazon.com/Razer-Kraken-Gaming-Headset-2019/dp/B07N86GL5T/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> and <a href=\"https://shop-links.co/chgNLTaLcPF\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Best Buy</a> for $39.99, roughly $40 off its standard retail price. The massive headset is certainly one of the larger models in Razer’s arsenal, yet it remains a solid choice for anyone who wants powerful sound while gaming on their PC or console.</p><p id=\"GMkKsd\">The Kraken uses an integrated digital-analog converter (DAC), which provides 7.1 virtual surround without the need for additional accessories. However, this feature is only available when connected to PCs running Razer’s THX Spatial Audio software. Additionally, the headset features thick, leatherette ear cups with cooling foam — which are perfect for extended play sessions — as well as a flexible boom mic that retracts into the left earcup when not in use. And, thanks to its 3.5mm audio connection, it's compatible with both consoles and mobile devices, as well as PC.</p><div id=\"gBveii\"><div data-anthem-component=\"productcard:11064189\"></div></div><h3 id=\"eJVO2p\">Steelseries Arctis 3</h3><p id=\"6cRPCd\"><em>Compatible with PC, PS4, PS5, Xbox Series X / S, Nintendo Switch</em></p><p id=\"iNPqol\">The SteelSeries Arctis 3 is an excellent, budget-friendly wired headset. Normally $69.99, the headset is currently available in white at <a href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM&amp;mid=24348&amp;murl=https%3A%2F%2Fwww.gamestop.com%2Fconsoles-hardware%2Fdesktops-laptops%2Fpc-headsets%2Fproducts%2Fsteelseries-arctis-3-console-edition-wired-gaming-headset%2F167255.html\" rel=\"sponsored nofollow noopener\" target=\"_blank\">GameStop</a>, <a href=\"https://www.amazon.com/SteelSeries-PlayStation-Nintendo-not-machine-specific/dp/B09FTMB8R6?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a>, and <a href=\"https://goto.target.com/c/482924/1314991/2092?subId1=VergeBestGamingHeadsetDeals041422&amp;u=https%3A%2F%2Fwww.target.com%2Fp%2Fsteelseries-arctis-3-wired-gaming-headset-for-playstation-4-5-white%2F-%2FA-82822951\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Target</a> for $49.99, matching one of its better prices to date in recent months. If white isn’t your color, the black colorway is also <a href=\"https://www.amazon.com/SteelSeries-All-Platform-Headset-PlayStation-Nintendo/dp/B07G12Z1HR?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">discounted at Amazon to $53.99</a>. </p><p id=\"okdhQg\">Like all the models in the Arctis line of headsets, the Arctis 3 uses a less conventional design, opting for a ski-goggle headband instead of a padded leatherette. You can secure the headband with velcro and adjust it to provide a better fit, but you can also replace it with a variety of other Steelseries headbands if you want different accents. The slimness of the headband also makes it uniquely suited for use with VR headsets.</p><p id=\"moGbnQ\">The earcups, which rotate to lay flat are covered with a breathable textile cushion, can also be removed and replaced with either imitation leather or velour cushions (both sold separately). Additionally, the left earcup is equipped with sliders to fine-tune volume and mic pickup, and the boom mic can be muted by retracting it into the earcup housing. </p><p id=\"bd4o4A\">As for connectivity, the Arctis 3 relies on a 3.5mm audio jack to provide connectivity to your platform of choice, and just like other wired headsets, this gives it a broad spectrum of compatibility, with mobile devices lacking 3.5.mm audio jacks being the lone exception.</p><div id=\"w0S9Eg\"><div data-anthem-component=\"productcard:10984455\"></div></div><aside id=\"Br6qAt\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"deals\"}'></div></aside><p id=\"ArMLbF\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Jk_dlUEvaYhdyIr58wZBOrxGADU=/0x185:2040x1253/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23001470/akrales_211109_4870_0299.jpg",
  "description": "Save on our favorite wired and wireless gaming headsets.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}