{
  "title": "The House hearing on 5G and planes shows the ride isn’t over yet",
  "url": "https://www.theverge.com/2022/2/4/22917018/5g-c-band-airplanes-house-committee-transportation-infrastructure-faa-fcc",
  "date": "2022-02-04T19:51:32.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"The first commercial flight out of the new Everett Paine Field Airport terminal takes off Monday, March 4, 2019. The inaugural flight left at 10 am, carrying state and local dignitaries to Portland, and two subsequent flights departed to Las Vegas and Pho\" src=\"https://cdn.vox-cdn.com/thumbor/rqXhnYVoqb1Z8pmoWriwh8TywC8=/0x0:3606x2404/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472483/1298903274.0.jpg\" />        <figcaption>Photo by Genna Martin/San Francisco Chronicle via Getty Images</figcaption>    </figure>  <p id=\"wYtzqF\">On Thursday, after <a href=\"https://www.theverge.com/2022/1/19/22891634/faa-att-verizon-5g-c-band-rollout-battle-airlines-buffer-zones\">a month of confusion, delays, and canceled flights</a> related to Verizon and AT&amp;T’s rollout of 5G C-Band networks, the House Committee on Transportation and Infrastructure held a <a href=\"https://transportation.house.gov/committee-activity/hearings/finding-the-right-frequency-5g-deployment-and-aviation-safety\">hearing</a> to “discuss the impact that deployment of 5G technologies has on the aviation industry.” </p><p id=\"SAA753\">Anyone tuning in hoping for bombshell revelations would’ve been disappointed. While some of the testimony was enlightening, giving insight into how certain segments of the industry viewed the events, the main takeaway was that we have a long way to go before C-Band and aviation will be able to co-exist happily. </p><div class=\"c-float-right\"><aside id=\"6ElKEy\"><q>“We recognize that the existing process for spectrum allocation didn’t serve anyone well”</q></aside></div><p id=\"bus86U\">“The process” that led to this situation, where the FCC auctioned off bandwidth that the FAA had warned could cause problems, “did not serve anyone well in this case,” FAA Administrator Steve Dickson said. He admitted that carriers and regulators <a href=\"https://www.theverge.com/2022/1/28/22906706/att-verizon-carriers-faa-airlines-5g-deployment-growth-agreement-maps-rush\">weren’t working together until the very last minute</a>, when <a href=\"https://www.theverge.com/2022/1/18/22889141/us-airlines-united-american-delta-5g-c-band-disruption-radar-altimeter\">the airline industry threatened to grind to a halt</a>. The FAA had to ask telecoms for data about where exactly their cell towers were and how they operated, according to Dickson.</p><p id=\"3I78vJ\">Overall, the situation was “very confusing and contentious,” Dennis Roberson, an expert called by the subcommittee, said. It comes down to a piece of equipment on airplanes called the radio (or radar) altimeter, which measures how far the plane is from the ground and is essential for landing safely in low visibility conditions. There were concerns, however, that some altimeters could get tripped up by the 5G C-Band signals that were about to start traveling through the air, as the signal they put out is similar to the ones used by the altimeter.</p><aside id=\"6CATF7\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Why AT&amp;T and Verizon are feuding with the US government over a last-minute delay to 5G\",\"url\":\"https://www.theverge.com/2022/1/4/22867221/att-verizon-5g-midband-spectrum-faa-air-safety-delay-cband\"}]}'></div></aside><p id=\"Bbh3XP\">But as carriers got ready to switch on their equipment, it became clear that the airline industry and regulators weren’t prepared. This led to a <a href=\"https://www.theverge.com/2021/11/4/22763502/verizon-att-cband-5g-faa-delay-safety-aircraft\">series</a> of <a href=\"https://www.theverge.com/2022/1/3/22866098/faa-dot-verizon-fcc-att-5g-c-band-delay-airplane-safety\">delays</a> and meant that when AT&amp;T and Verizon launched their upgraded networks in January, the FAA was <a href=\"https://www.theverge.com/2022/1/20/22893597/faa-5g-c-band-rollout-airports-cleared-altimeters-regional-jets\">scrambling to clear airplanes for flight</a>, trying to make sure they could safely land in low-visibility conditions where 5G had been rolled out. The result was a patchwork of regulations for airlines and pilots, with rules that only apply to specific airplane models and airports, under certain conditions. And the rules had to be constantly updated as regulators receive more information about the cellular network and how it affects altimeters.</p><p id=\"a7f3N6\">As stakeholders from the aviation industry testified, this has put a lot of stress on pilots and flight crews, who already reeling from the effect of the pandemic on their industry. And the regional airlines, which service rural communities and are an important part of the major airlines’ hub and spoke system, <a href=\"https://www.theverge.com/2022/1/27/22899835/att-verizon-5g-rollout-major-airlines-regional-airports-faa-restrictions\">still have to wait for clearance to fly</a>, unlike their counterparts at United and Delta. </p><aside id=\"rYi2y7\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Major airlines shrugged off 5G fiasco, but small regional carriers still face turbulence \",\"url\":\"https://www.theverge.com/2022/1/27/22899835/att-verizon-5g-rollout-major-airlines-regional-airports-faa-restrictions\"}]}'></div></aside><p id=\"JJLDIO\">Meanwhile, carriers have had to switch course and are now unable to use parts of the valuable spectrum they paid for. As representatives from both Congress and the telecom industry pointed out, this can exacerbate internet access inequality. The neighborhoods that live in <a href=\"https://www.theverge.com/2022/1/8/22873765/faa-verizon-att-airport-5g-carriers-buffer-zone\">the buffer zones around airports</a> (which are <a href=\"https://www.theverge.com/2021/11/24/22801008/verizon-att-midband-5g-c-band-lower-power-six-months\">currently temporary</a> and set to go away in July) are often working-class, and the people that live there are majority Black and Latino and sometimes <a href=\"https://www.theverge.com/2022/1/20/22893597/faa-5g-c-band-rollout-airports-cleared-altimeters-regional-jets\">lack access to broadband</a>. If the buffer zones are made permanent, the 5G that could’ve helped those people won’t be available. </p><p id=\"Ylvo3A\">Members of the subcommittee typically asked the same question: when are things going to get better? What’s the solution? But there weren’t any clear answers from the FAA or experts — and the FCC didn’t send anyone to weigh in or give its side of the story (which was remarked upon several times). There were some tentative timelines offered for certain milestones, but they didn’t offer much hope that the situation would be resolved quickly. “This is a matter of years, not days and not weeks. It’s something that’s being looked at, but it’s just getting underway, and it’s going to take time,” said Nicholas Calio, a representative from the Airlines for America lobbying group.</p><p id=\"IDGsjJ\">Dickson said that the FAA is working on new safety standards for altimeter equipment but that those standards wouldn’t be ready until “early 2023.” At that point, manufacturers will have to work on designs that meet those standards, and there will almost certainly be extended certification and testing periods.</p><div class=\"c-float-right\"><aside id=\"BcjAtl\"><q>A representative from the cell industry implied the government could pay to upgrade altimeters if it wanted</q></aside></div><p id=\"f8Dh8w\">Then, there’s the question of how faulty altimeters will be replaced, according to Dickson. When the committee asked CTIA, a lobbying group for carriers, if telecoms would pay to upgrade altimeters when new ones became available, Meredith Attwell Baker punted the question — she said that they weren’t convinced interference would be an issue and said that the government was free to use the tens of billions it received from auctioning off the C-Band spectrum however it wanted.</p><p id=\"cogVpu\">What the hearing left us with was a handful of promises. Dickson promised that the FAA was working with carriers and manufacturers to do the testing and keep everyone safe. The carriers promised that they were cooperating. And both vowed that the situation would be smoother from here on out. But with the number of question marks and unshared details, the hearing made it clear that we haven’t heard the last of this issue. </p><p id=\"QwTOXs\">Several experts expressed the idea that, until this point, information wasn’t free-flowing between government regulators and the various players involved. Dickson said that the key to avoiding another debacle (and solving the current issues) was early and frequent data exchanges between all parties and promised airlines that the FAA and carriers are “going to smooth this process out and make it more predictable.” If that really happens, the path to a real solution may be a little less bumpy. </p><p id=\"nAYYr9\">You can watch the full hearing below.</p><div id=\"SyiuWu\"><div ><iframe src=\"https://www.youtube.com/embed/DEiRht7gP-s?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/FQggw8Usp3YO4A1RXMmKB9_p6y8=/0x516:3606x2404/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23217097/1298903274.jpg",
  "description": "\"This is a matter of years, not days and not weeks.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}