{
  "title": "The new season of Love, Death and Robots doesn’t miss  ",
  "url": "https://www.theverge.com/23132482/love-death-and-robots-volume-3-review-netflix",
  "date": "2022-05-20T18:11:16.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MR4aGKAildZKDiTN-OhyP828_XA=/240x0:1680x960/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70893079/ROB_9986_R.0.jpg\" />        <figcaption><em>Three Robots: </em>Exit Strategies<em>.</em> | Image: Netflix</figcaption>    </figure>  <p id=\"wgpZ6h\">Over its first two seasons, <em>Love, Death and Robots</em> has made good on its name by offering myriad animated shorts spanning sci-fi and horror — and occasionally both at the same time. It’s been bloody and visceral but also frequently uneven. For every smart treatise about the nature of humanity, there was a gorefest that was bloody and shocking and little else. But with <a href=\"https://www.theverge.com/2022/5/9/23063543/love-death-robots-volume-3-trailer-netflix\">volume 3</a>, we get arguably the strongest collection yet: nine genre shorts without a weak link among them.</p><p id=\"y1ArrK\">Perhaps the most impressive thing about the third season is how varied the shorts are, which range from seven to 21 minutes long. My personal favorite is <em>The Very Pulse of the Machine</em>, directed by Emily Dean, which follows an astronaut stranded on Jupiter’s moon Io. As she drags the corpse of a dead colleague back to safety through a desolate landscape, she starts hallucinating… probably. It could be the drugs keeping her alive, or it could be the <em>Moebius</em>-inspired planet speaking directly to her. Whatever it is, it’s gorgeous to watch and ends on a particularly poetic note.</p><p id=\"SimLzQ\">Other highlights include David Fincher’s <em>Bad Travelling</em>, a horrifying tale of a group of sailors accosted by a gigantic hungry crab who forces them to reevaluate their priorities. It’s notable not just for its moral dilemmas but also the terrifying realism with which it renders its monsters and viscera. It’s the stuff of nightmares. Similarly, <em>Jibaro</em>, from director Alberto Mielgo, is a terrifying vision in which a deaf knight watches his entire platoon be killed by a golden siren before the two square off in a disorienting, wordless battle. <em>Swarm</em> imagines what would happen if humans tried to enslave a peaceful race of alien bugs. Spoiler: it doesn’t go well.</p><div id=\"KsGbFI\"><div ><iframe src=\"https://www.youtube.com/embed/1cotItdK_Eg?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"ubZ3B9\">Perhaps the most impressive thing about volume 3 of <em>Love, Death and Robots</em> is that even the seemingly generic stories turn out to be interesting. The token zombie short — <em>Night of the Mini Dead</em>, directed by Robert Bisi and Andy Lyon — takes a bird’s eye view of an undead apocalypse, showing a sped-up version of events with an adorable art style that makes it look like a <em>StarCraft</em> spinoff. It’s almost like a timelapse of our demise at the hands of zombies. And then there are two stories that begin with a bunch of gun-toting soldiers exploring some mountains — but the two go in very different directions. <em>Kill Team Kill</em>, from director Jennifer Yuh Nelson, is a gleefully grotesque battle with a mecha bear, while <em>In Vaulted Halls Entombed, </em>directed by Jerome Chen, starts out very <em>Call of Duty</em> before turning into <a href=\"https://www.theverge.com/2021/4/29/22408468/returnal-ps5-dualsense-3d-audio\"><em>Returnal</em></a>.</p><p id=\"wZ3r8W\">Volume 3 even adds continuity to the anthology series with the return of the three robots, who are once again traveling through the remnants of humanity to try to learn who we were in <em>Exit Strategies</em>, directed by Patrick Osborne. This time, they’re focused on our apocalyptic shelters, from hardcore survivalist camps and oil tankers retrofitted to tech billionaire playgrounds to underground bunkers for the political elite. It’s grim and hilarious and ends on the important realization that “humans are the actual worst.”</p><p id=\"sia2K5\">There isn’t necessarily a through line connecting the nine films beyond the fact that they’re all animated shorts that explore sci-fi and horror. Some have lots of blood and some are deep contemplations of the future of humanity — and some have both. But that connective tissue isn’t really necessary here when each of the shorts is so distinct and interesting. Yes, you get lots of death and robots (and a little love). But the main standout of volume 3 is that, well, there isn’t a standout: here are nine excellent genre flicks that all feel very different from one other. Humanity may be the worst, but at least we can make some cool stuff.</p><p id=\"Neros0\"><small><em>Volume 3 of </em></small><small>Love, Death and Robots</small><small><em> is streaming on Netflix now.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6szH3rSLFMz5eI8z90RE8O2MUtI=/43x0:1877x960/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23577221/ROB_9986_R.jpg",
  "description": "Settle in for some good, short sci-fi.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}