{
  "title": "The best Etsy alternatives for selling your crafts",
  "url": "https://www.theverge.com/23013610/etsy-crafts-sell-creative-amazon-shopify-how-to",
  "date": "2022-04-07T15:06:05.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mjdtTjo8Oj1EQCTWjmTf88ntJps=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70721659/VRG_Illo_5133_K_Radtke_Etsy_Leaving.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"3smkIT\">Since its launch in 2005, Etsy has become well known as the place to go for handcrafted, one-of-a-kind items from a wide variety of creators. Unfortunately, over the last few years, that rosy reputation has darkened a bit. To begin with, <a href=\"https://twitter.com/weggles/status/1509202411629559809?s=20&amp;t=N_nYb1iw-wNdSXE2XDmtiw\">buyers have been noticing</a> an influx of mass-market goods that are noticeably not handmade. </p><p id=\"lsMCam\">But there has been a lot of discontent online from sellers as well, due both to the increased number of manufactured goods and to increased expenses <a href=\"https://www.theverge.com/2020/3/13/21173710/etsy-seller-complaints-advertising-program-revenue-growth-sales\">such as mandatory market plans</a>. The final straw may have come In early April of this year when Etsy announced <a href=\"https://www.theverge.com/2022/2/24/22949707/etsy-sellers-transaction-fee-increase\">it is raising seller transaction fees</a> from 5 percent to 6.5 percent. </p><p id=\"MGQz3f\">As a result, a large number of <a href=\"https://www.theverge.com/2022/3/30/23001727/etsy-seller-strike-boycott-fee-increase\">Etsy sellers plan to go on strike</a> between April 11th and 18th and are calling for a boycott of the site by buyers in support. Meanwhile, many of those same sellers are no doubt wondering if there is another way to sell their products outside of the increasingly difficult site.</p><div class=\"c-float-right\"><aside id=\"XQ15xg\"><q>Etsy sellers plan to go on strike between April 11th and 18th and are calling for a boycott</q></aside></div><p id=\"hd1BpP\">It’s not easy, especially if you’re a relatively small vendor who is trying to get your handmade product recognized in a very crowded market. </p><p id=\"N81O5I\">As any retailer knows, it takes a lot of time and resources to sell products, either online or off — resources that you may not have, especially if you are not running a full-time business. You have to create a professional-looking website where you can show off your wares to their best advantage or showcase them in a venue where potential customers can find them. You have to track your inventory so you don’t accidentally accept a sale you can’t fulfill, especially if you sell at more than one site. You need to be able to accept sales from credit cards, PayPal, or other financial institutions, add tax and shipping fees, and offer approximate ship dates. You have to pack up your items (or arrange to have them packed) and send them out. If you accept returns, you have to deal with refunds and shipping fees.</p><p id=\"RkfUmp\">In other words, even if you’re a very small shop, it can be really complicated, especially if you try to do it completely by yourself.</p><p id=\"eX4DjK\">Selling through Etsy solved that problem for a lot of creators. It was a single source that a lot of people looking for crafty items would go to; it supplied a sales page, a way to interface with your customers, and other retail services. But if Etsy has become a problem for its sellers, what do you do?</p><h2 id=\"ItS9kZ\">If you’re a buyer</h2><p id=\"PgqAtB\">If you’re a buyer and you want to support your favorite Etsy craftspeople, one way is to find out what alternate ways there are to contact them and / or buy from them. The best way is to ask them. This is where your search engine is your friend. It’s possible that the vendor has a website with the same name as their Etsy shop; do a little online research.</p><p id=\"znwMCz\">If you’re having trouble, then you can contact them through Etsy. </p><ul><li id=\"RLqNZZ\">On the site (presumably, before the strike), go to your Esty <strong>Favorites</strong> (the heart icon at the top right), or if you haven’t been keeping a Favorites list, click on your personal icon and go to <strong>Purchases and reviews.</strong></li><li id=\"U3o6PQ\">Find the name of the vendor and select it. This should take you to the main page for that vendor.</li><li id=\"0GOJnR\">Scroll down where you see <strong>Contact shop owner</strong> (usually on the left side of the page) and send them a request for where else you can find them. (You could also ask them if they support the strike; <a href=\"https://twitter.com/fleurdechair/status/1511437681569456132?s=20&amp;t=weiPXpQyyhY_tcEETPglzg\">according to some messages on Twitter</a>, there are vendors who do not and who are concerned about losing customers.)</li></ul>  <figure class=\"e-image\">        <img alt=\"You can contact a favorite seller via their Etsy listing.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JJi7n5rl3xrTit8IXQ6X9nvwLW8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371780/Screen_Shot_2022_04_06_at_2.12.08_PM.png\">      <figcaption><em>You can contact a favorite seller via their Etsy listing.</em></figcaption>  </figure><h2 id=\"bUtTHO\">If you’re a seller</h2><p id=\"SHc4W4\">Unfortunately, Etsy — even in its current incarnation — seems to be unique. While there are a number of other outlets where craftspeople can get help for marketing their wares, few have the full-service plans and the outreach that Etsy boasts. </p><p id=\"QKDTnA\">To begin with, of course, you can simply sell out of your own website. However, it takes time, knowledge, and skill to be able to build a retail site, not to mention to publicize it so that your customers can find you. If you’ve got those skills — or if you’ve got the wherewithal to hire somebody with those skills — then that could be a solution. However, there are alternatives. They may not be the all-in-one solution that Etsy has been, but if you really want to find other markets — even if you’re not ready to abandon Etsy altogether — they might work for you.</p><p id=\"khSZbf\">Note that these are only a few of the available options out there. There are many different e-commerce sites and services available, and there are others besides these that may work for a smaller retail shop. But this will, hopefully, give you a place to start.</p><h2 id=\"5rxrOP\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.etsy.com%2Fsell%3Fref%3Dftr&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Etsy</a></h2>  <figure class=\"e-image\">        <img alt=\"Etsy\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mkcvAyFaTRALDyAwgqsMeqRmHas=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371851/Screen_Shot_2022_04_06_at_2.35.42_PM.png\">      <figcaption><em>Etsy</em></figcaption>  </figure><p id=\"1bmOMb\">If we’re going to compare several services to that of Etsy, it makes sense to first take a quick look at what Etsy offers its retailers.</p><p id=\"4eLIUS\">Of course, to begin with, Etsy is well known for being the place to go for various crafts and handmade items. As mentioned before, this reputation is starting to fray a bit — I’ve spoken to a couple of friends whose purchases, they said, were obviously not handmade. However, Etsy does provide you with your own “shop,” a way to exhibit your items and get paid, and a variety of other services.</p><h3 id=\"JbxUFE\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.etsy.com%2Fsell%3Fref%3Dftr&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Fees</a></h3><p id=\"vaHNDQ\">Etsy has a list of fees that includes:</p><ul><li id=\"uSs5V1\">A 20 cent listing fee for a four-month listing</li><li id=\"YwasyU\">A 6.5 percent transaction fee (as of April 11th)</li><li id=\"Nr01EY\">A 3 percent plus 25 cent payment processing fee</li><li id=\"GHDtz0\">A 15 percent offsite ads fee (this fee is only required if you made over $10,000 in the last 365 days, but if you don’t want to participate in Etsy’s Offsite Ads program, you need to manually opt out)</li><li id=\"Gp0r56\">Another $10 / month puts you on Etsy Plus, which adds the ability to have your own web address, additional customization options, and other features.</li></ul><p id=\"jMJeQK\"><strong>Trial period:</strong> There is no trial period for an Etsy shop.</p><h2 id=\"6kicuw\"><a href=\"https://sell.amazon.com/programs/handmade?ref_=asus_soa_rd&amp;\">Amazon Handmade</a></h2>  <figure class=\"e-image\">        <img alt=\"Amazon Handmade\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hB1mehdwf_CsDdjDZX_cdMM5VtU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371854/Screen_Shot_2022_04_06_at_2.37.50_PM.png\">      <figcaption><em>Amazon Handmade</em></figcaption>  </figure><p id=\"zQzOPN\">Retail giant Amazon has a special shop called Amazon Handmade, where customers can find crafts and other handmade goods. On the one hand, this <em>is</em> Amazon, so there are a lot of people going there to buy things. On the other, Amazon Handmade doesn’t seem to be as well known as Etsy (I didn’t know about it until I started researching this article). </p><h3 id=\"XIUFt9\"><a href=\"https://sell.amazon.com/programs/handmade?ref_=asus_soa_rd&amp;\">Fees</a></h3><p id=\"oVpwGC\">Amazon offers two general plans: Individual and Professional. </p><ul><li id=\"knJdwT\">Individual, costing 99 cents per item sold, is for beginners — basically: for those who expect to sell fewer than 40 units a month and don’t plan to advertise. However, you cannot be a part of Amazon Handmade if you’re on the Individual plan. You must be on the Professional plan.</li><li id=\"9H7UDt\">Professional is $39.99 per month and offers advertising, top placement on site pages, and other features. But for those who want to be part of Handmade and who are true craftspeople, there is an out. Once you’ve created a <a href=\"https://sell.amazon.com/sell?ld=ELXXFBA-sevesujira.aka.amazon.com\">Professional Amazon seller’s account</a>, you can apply to have the fee waived by <a href=\"https://sell.amazon.com/programs/handmade?ref_=asus_soa_rd&amp;#fees\">qualifying for an Artisan account.</a></li><li id=\"wIvdV1\">Add to that the referral fees. <a href=\"https://sell.amazon.com/pricing#referral-fees\">According to Amazon</a>, “For every item sold, sellers pay Amazon a percentage of the total price—including item price, shipping cost, and any gift-wrapping charges—or a minimum amount, whichever is greater. Referral fees are in addition to selling plan fees.” The percentage depends on what you are selling. For example, if you create and sell jewelry, Amazon will take 20 percent of the total sale price up to $250 and 5 percent for any portion above that. However, if you qualify for Handmade, then Amazon will deduct a straight 15 percent referral fee.</li><li id=\"tHqpjn\">Amazon will charge you for shipping as well but will then refund the amount — or a portion of it. Professional users get to determine how much shipping will cost; Amazon will charge them for it and then credit them for that amount. Individual users have to use a set shipping fee that Amazon charges; if their shipping costs are more than Amazon’s refund, they’ll have to eat that cost (or raise the price of their goods).</li></ul><p id=\"GEiirG\"><strong>Trial period</strong>: There is no trial period for Amazon Handmade.</p><h2 id=\"F0ui86\"><a href=\"https://www.shopify.com/\">Shopify</a></h2>  <figure class=\"e-image\">        <img alt=\"Shopify\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/alE-3-g_I1Wzb7y_xOOt_73LD7o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371860/Screen_Shot_2022_04_06_at_2.40.31_PM.png\">      <figcaption><em>Shopify</em></figcaption>  </figure><p id=\"MANskB\">Shopify is not a marketplace like Etsy or even Amazon — it’s an e-commerce platform for sellers who want to sell their products on their own sites. It offers a variety of services for a range of sellers, from individuals to large retailers. For example, the Basic plan includes an e-commerce website (including a variety of themes) and blog, access to various sales channels (depending on your country), and the ability to sell gift cards, among others. You also get shipping discounts and a point of sale app (for in-person sales). The Shopify plan adds several staff accounts and reporting services; the Advanced plan includes services for international sales.</p><p id=\"iz9Co8\">If you’re thinking about selling out of your own website but want a way to more easily handle payments, sales tracking, shipping costs, etc., an e-commerce platform could be very useful, and Shopify seems to have relatively friendly small-shop services.</p><h3 id=\"Q6hqON\"><a href=\"https://www.shopify.com/pricing\">Fees</a> </h3><ul><li id=\"eKoO8X\">The Basic plan starts at $29 / month. If you decide to use Shopify’s payment services, then credit card fees for online sales are 2.9 percent plus 30 cents per transaction; credit card fees for in-person sales are 2.7 percent per transaction. If you don’t use Shopify’s payment services, you are charged 2 percent per transaction.</li><li id=\"LuIqnO\">The Shopify plan starts at $79 / month. If you decide to use Shopify’s payment services, then credit card fees for online sales are 2.6 percent plus 30 cents per transaction; credit card fees for in-person sales are 2.5 percent per transaction. If you don’t use Shopify’s payment services, you are charged 1 percent per transaction.</li><li id=\"irsegr\">The Advanced plan starts at $299 / month. If you decide to use Shopify’s payment services, then credit card fees for online sales are 2.4 percent plus 30 cents per transaction; credit card fees for in-person sales are 2.4 percent per transaction. If you don’t use Shopify’s payment services, you are charged 0.5 percent per transaction.</li></ul><p id=\"igzcAh\">Finally, if all you want is a way to process credit card payments, you can use Shopify Lite, which lets you process in-person payments or add a button to your existing website for $9 / month.</p><p id=\"Yshja5\"><strong>Trial period</strong>: 14-day free trial </p><h2 id=\"BnA23O\"><a href=\"https://www.bigcartel.com/\">Big Cartel</a></h2>  <figure class=\"e-image\">        <img alt=\"Big Cartel\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mZNgn22jtaQPEKKye-PxzKiA-jI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371865/Screen_Shot_2022_04_06_at_2.42.05_PM.png\">      <figcaption><em>Big Cartel</em></figcaption>  </figure><p id=\"mrmpb4\">Big Cartel is geared specifically toward creatives and even has a limited but usable free plan. It doesn’t offer a central marketplace like Etsy does, but it does provide services to help crafters develop an online store on their own site. Note that it doesn’t include arrangements for credit card or other payments; that you will have to arrange yourself via Stripe, PayPal or Venmo (and remember they will have separate fees for retail sales). But Big Cartel doesn’t ask charge extra fees to charge through their service.</p><h3 id=\"BsIZ67\"><a href=\"https://www.bigcartel.com/pricing\">Fees</a></h3><ul><li id=\"9qdS3o\">The free Gold plan gives you a market for up to five products with a single photo per product, the ability to sell online and in person, a custom domain, tax calculation, the ability to run discounts and track shipments, and other features. </li><li id=\"EZmISG\">The Platinum plan ($9.99 / month) lets you list up to 50 products with five images per product and adds Google statistics, inventory tracking, and other services. </li><li id=\"k7wCM2\">The Diamond plan lets you list up to 500 products with five images per product for $19.99 / month.</li></ul><p id=\"ZGL3cH\">Trial period: The Gold plan <em>is</em> essentially a trial plan; there is no time limit.</p><h2 id=\"ac707T\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.bonanza.com%2Fsell_products_online&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Bonanza</a></h2>  <figure class=\"e-image\">        <img alt=\"Bonanza\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/T0P_wTUSy_REFwHmPYyh-Ze1sMM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371869/Screen_Shot_2022_04_06_at_2.43.34_PM.png\">      <figcaption><em>Bonanza</em></figcaption>  </figure><p id=\"qlNxl6\">Like Etsy, Bonanza offers a central hub where you can sell your stuff — but unlike Etsy, it doesn’t purport to concentrate on crafts and other handmade items. It is a much more general marketplace, including clothing, jewelry, cosmetics, furniture, etc. </p><p id=\"6lBvN9\">On the other hand, Bonanza is <a href=\"https://support.bonanza.com/hc/en-us/articles/360000605292\">very upfront with their terms</a>. According to the <a href=\"https://support.bonanza.com/hc/en-us/articles/360001683512-General-FAQ\">company’s FAQ</a>, it does not cost anything to list your product(s) on the site or upload photos, and you do so on what Bonanza calls a “booth,” which is very similar to Etsy’s “shop.”  Vendors are charged against what Bonanza calls Final Offer Value (FOV): “the amount that the buyer paid to you for the item sold, plus any portion of the shipping fee that exceeds $10.” The company also says it will sync your products with any other marketplace you’re using. </p><h3 id=\"b5BDAh\"><a href=\"https://support.bonanza.com/hc/en-us/articles/360000605292-Bonanza-Pricing\">Fees</a></h3><ul><li id=\"i5hYUB\">If the FOV is under $1,000, you pay 3.5 percent.</li><li id=\"Ksvm3J\">Over that amount, you pay the same 3.5 percent plus 1.5 percent of the amount over $1,000. </li><li id=\"5ZTtpj\">Bonanza also offers <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.bonanza.com%2Fads_primer&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">advertising services</a> for an additional fee which can range from 9 percent to 30 percent of the FOV. </li></ul><p id=\"b7T5qW\"><strong>Trial period</strong>: Bonanza doesn’t charge until you make a sale, so there is no trial period.</p><h2 id=\"M80qol\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.indiemade.com%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">IndieMade</a></h2>  <figure class=\"e-image\">        <img alt=\"IndieMade\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hJ_fq2db8nDUiLJJr6Noj_3CuXw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371874/Screen_Shot_2022_04_06_at_2.45.29_PM.png\">      <figcaption><em>IndieMade</em></figcaption>  </figure><p id=\"ateS6Q\">IndieMade, like Shopify, is an e-commerce platform rather than a retail site — in other words, it helps you create a website that you can sell your items from. Unlike Shopify, it is directed toward craftspeople and works on a much smaller scale. </p><p id=\"cBF6VR\">IndieMade offers four membership levels — and they all offer the same features, including a custom IndieMade-branded domain with SSL certification; the ability to sell directly from your site using PayPal, Stripe or Square (each of which will have its own fees); the ability to generate coupons; the ability to allow customers to choose product aspects (color, size, etc.); and a blog. The only differences between the levels are how many products you can sell and how many photos you can exhibit per product.</p><h3 id=\"X91eEf\"><a href=\"https://account.indiemade.com/pricing\">Fees</a></h3><ul><li id=\"ozMM0i\">Basic costs $4.95 / month and includes the ability to sell up to 10 products with five photos per product. </li><li id=\"j6gNIp\">Standard costs $12.95 / month for up to 250 products and 10 photos per product</li><li id=\"qMmTZa\">Pro costs $14.95 / month for up to 500 products and 20 photos per product</li><li id=\"9BPl38\">Plus costs $19.95 for unlimited products and unlimited photos</li></ul><p id=\"XLXhhS\"><strong>Free trial</strong>: IndieMade offers a free 30-day trial.</p><h2 id=\"2C227K\"><a href=\"https://www.zibbet.com/\">Zibbet</a></h2>  <figure class=\"e-image\">        <img alt=\"Zibbet\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kfkiBbV00bFitIsMpHH_uJ-Wnfs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371881/Screen_Shot_2022_04_06_at_2.47.40_PM.png\">      <figcaption><em>Zibbet</em></figcaption>  </figure><p id=\"Xevanh\">Zibbet is not a traditional e-commerce site, although it offers some e-commerce features. Its main purpose, according to the site, is to help you track your products across multiple sales channels. Currently, the only channels available are eBay and Etsy; Facebook Shop and Instagram are, according to the site, coming soon. Of course, you will still be responsible for any fees charged by the channels you sell through. </p><p id=\"YXi1zr\">Zibbet does offer tools to help you build an e-commerce site using a development platform called Stitch; if you don’t have your own domain set up, Zibbet will set one up for you, free for the first year. Using Zibbet’s themes and tools, you can create a site that includes a stats dashboard, coupon codes, the ability to send automated emails if a sale is started but not completed, and customer discounts. The site will accept credit card and PayPal payments.</p><h3 id=\"wzfY6K\"><a href=\"https://www.zibbet.com/pricing/\">Fees</a></h3><ul><li id=\"KcXozm\">Zibbet’s fees are extremely simple: $5 per month per channel, with a minimum of two channels. </li></ul><p id=\"IPHIi3\"><strong>Free trial</strong>: Zibbet offers a 14-day free trial</p><h2 id=\"rc2nZv\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ebay.com%2Fsl%2Fsell%3Fsr%3Dwnstart%26_trksid%3Dp2481888.m570.l1528&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">eBay</a></h2>  <figure class=\"e-image\">        <img alt=\"eBay\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FR6RBdvoIh5qHBe3buW3ZSe5OKE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372322/Screen_Shot_2022_04_06_at_4.20.11_PM.png\">      <figcaption><em>eBay</em></figcaption>  </figure><p id=\"9R1teL\">And then there’s eBay. While the number of products being sold on eBay can be overwhelming, if someone is looking for a specific type of product, it could be a place where a creator could find a customer. And while eBay was originally known mostly for reselling used items, it is now a marketplace for almost anything you can find. There are also some useful features; for example, if you have customers who like your wares, they can easily set email reminders to appear whenever you add something new.</p><h3 id=\"WKo0wM\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ebay.com%2Fhelp%2Fselling%2Ffees-credits-invoices%2Ffrais-pour-les-vendeurs-particuliers%3Fid%3D4822&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Fees</a></h3><p id=\"JJU51X\">eBay charges two types of fees: a listing fee (known as an insertion fee) and a final value fee. </p><ul><li id=\"NjfAuY\">You can list up to 250 items per month without having to pay an insertion fee. After that, you’ll pay 35 cents / month / listing.</li><li id=\"OI7IYl\">The final value fee can vary widely, depending on what you’re selling, and is calculated as a percentage of your final sale price plus 30 cents per order. To find out what your specific product would cost, your best bet is to <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ebay.com%2Fhelp%2Fselling%2Ffees-credits-invoices%2Fselling-fees%3Fid%3D4822%23section2&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">check out eBay’s chart</a>.</li></ul><p id=\"F8LBEn\">If you want to become a serious eBay retailer, you can create your own shop via <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fpages.ebay.com%2Fseller-center%2Frun-your-store%2Fsubscriptions-and-fees.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23013610%2Fetsy-crafts-sell-creative-amazon-shopify-how-to\" rel=\"sponsored nofollow noopener\" target=\"_blank\">eBay’s Store subscriptions</a>. Subscription fees depend on how much you will be selling per month and the type of sales and promotional tools you’ll need.</p><p id=\"Ofepby\">Besides a storefront, these subscriptions offer a large number of fixed-price and auction listings per month, customer support, and other features. </p><ul><li id=\"vYnPNZ\">Starter Store costs $4.95 / month and offers up to 250 free fixed-price or auction listings.</li><li id=\"6PRMJC\">Basic Store costs $21.95 / month and offers up to 1,000 free fixed-price listings and 250 free auction listings, together with lower final value fees and $25 worth of eBay branded shipping supplies.</li><li id=\"llDirP\">Premium Store costs $59.95 a month and offers up to 10,000 free fixed-price listings, 500 free auction listings, lower final value fees, and $50 worth of eBay branded shipping supplies.</li></ul><p id=\"sgwUzG\">And there are additional levels for larger retailers. </p><p id=\"s7D81f\"><strong>Free trial</strong>: eBay offers no free trials.</p><p id=\"un1zcz\"></p><p id=\"FyaTnN\"></p><p id=\"XkXA2p\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3_-Qx4em7enyEvx76dChvkdhjBE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23373856/VRG_Illo_5133_K_Radtke_Etsy_Leaving.jpg",
  "description": "If you’re an unhappy Etsy seller, there are other possibilities to try.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}