{
  "title": "The best smartphone you can buy for under $500",
  "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
  "date": "2022-02-09T00:18:49.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"iPhone SE (2020), Pixel 5A, OnePlus Nord N200 5G, TCL 20S, Moto G Pure, Samsung Galaxy A52 5G\" src=\"https://cdn.vox-cdn.com/thumbor/sHxEoXqr1i6JVkup6wsoJeDPpyY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/67732462/best_phone_grid_16x9.6.jpg\" />        <figcaption><em>Best budget phones of 2021: iiPhone SE (2020), Pixel 5A, OnePlus Nord N200 5G, TCL 20S, Moto G Pure, Samsung Galaxy A52 5G.</em> | The Verge</figcaption>    </figure>  <p>You can get a great smartphone at this price, whether you want an iPhone, a 90Hz screen, or 5G support</p> <p id=\"7By4QV\">If you’re shopping for a new phone on a budget, we’ve got good news: you’re more likely to find mid-range sub-$500 phones available in these days of crunched supply chains than many of the recent flagships. </p><p id=\"ZY6SyC\">Due to an unfortunate series of events — from the <a href=\"https://www.theverge.com/22777216/global-chip-supply-chain-shortage-holidays-christmas-shopping\">ongoing chip shortage</a>, labor shortage, the pandemic, and global shipping delays — retailers are having a hard time keeping phones like the Samsung Galaxy S21 or iPhone 13 Pro in stock; Samsung has been hit particularly hard with supply issues all year. Fortunately, there are many excellent alternatives that are nearly as capable and cost a lot less to boot.</p><p id=\"WU3Cg6\">Companies like Apple, Google, and Samsung are spreading the wealth of features enjoyed by their flagships down to less expensive options. Other brands like OnePlus are also finding ways to challenge more established manufacturers with lower prices and more premium features.</p><p id=\"xoCnCZ\">The bad news is this makes the job of picking the best budget phone<em> that </em>much harder. It’s impossible to buy a phone that does everything well at this price point. So prioritize the features that matter most to you, whether it’s 5G compatibility with a particular network, high-resolution screen, low price, best camera, or longevity with software updates. It’s difficult to get straight A’s in every single one of these needs, but if you’re able to tolerate the occasional B, you’ll find a phone you’ll love. We recommend getting an unlocked phone for the best price and portability, but you might find better deals by buying through a carrier and signing up for a wireless plan.</p><p id=\"Svhy7y\">Our pick for the best inexpensive iPhone is the 2020 edition of the <a href=\"https://www.theverge.com/2020/4/22/21230308/apple-iphone-se-2-2020-review-features-specs-camera-price\">Apple iPhone SE</a>. Even though it’s well over a year old, we think it’s still the best bet for most people. While it does a competent job at everything, its standout feature is that it should last four or more years if treated well.</p><p id=\"fQUJ3j\">If you’re looking for the best budget Android phone, then the <a href=\"https://www.theverge.com/22628205/google-pixel-5a-review-price-screen-battery-specs\">Google Pixel 5A</a> is our top choice. You’ll find an all-around good phone with a flagship-level camera, three years of software updates from Google, plus IP67 water resistance — all at a lower price than last year’s model.</p><div id=\"PuCkqJ\"><div data-anthem-component=\"productcard:10885054\"></div></div><div id=\"RvhA7v\"><div data-anthem-component=\"productcard:10885083\"></div></div><p id=\"E9aGHP\"></p><hr class=\"p-entry-hr\" id=\"GatTSx\"><h1 id=\"xLIfAi\">The best smartphone for under $500 in 2021</h1><p id=\"do3cBl\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Apple iPhone SE is a great choice if you want a phone that lasts for years.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/dBU6PLPRcKtVVTdfTrprm4mAigQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19916232/vpavic_042019_3980_0024.jpg\">      <figcaption><em>The Apple iPhone SE is a great choice if you want a phone that lasts for years.</em></figcaption>  </figure></div><h2 id=\"PEjixV\">1. <a href=\"https://www.theverge.com/2020/4/22/21230308/apple-iphone-se-2-2020-review-features-specs-camera-price\">Apple iPhone SE 2020 (2nd-generation)</a></h2><h3 id=\"YvXuY9\">The best iPhone under $500</h3><p id=\"QjIUAS\">Apple’s iPhone SE 2020 (2nd-generation) strikes the right balance of camera, build quality, speed, battery life, software, and longevity for most people. Even though it’s over a year old now, it should still give you an excellent return on investment. We recommend upgrading to the model with 128GB of storage for $449, which is $50 over the base price but well worth it long term.</p><p id=\"x9YYEN\">The iPhone SE follows a very tried and true formula. It has the same body and 4.7-inch LCD screen that Apple has been using since the iPhone 6. That puts the display on the smaller end of screen sizes today, which also means the phone’s bezels are bigger than anything else sold on the market. High-refresh-rate screens with smoother animations and scrolling have been trickling down into the budget class recently, but you won’t find one here.</p><p id=\"5TvHua\">The 2020 SE is part of the iPhone 11 generation, so its A13 Bionic processor is two years behind the latest and greatest and won’t win any benchmark races. (That would be the A15 chipset in the iPhone 13 lineup.) It’s still plenty performant, though, and it’s often hard to tell </p><div class=\"c-float-right c-float-hang\"><aside id=\"878itp\"><q>If you’re looking for the fastest wireless connectivity, the SE is not going to provide it</q></aside></div><p id=\"x5bwzf\">the difference between a two-year-old iPhone processor and a brand-new one in use. But why that processor <em>really</em> matters, though, is overall longevity. Apple consistently supports its phones for four or more years with software updates. (That’s in comparison to Android, where getting software updates on anything but the Pixel is still a struggle.) So Apple’s choice of a fast processor means, in a few years, the iPhone SE will still feel snappy and be supported with iOS updates.</p><p id=\"OUd3WA\">Cellular connectivity is limited to LTE, which is fine for now but might be limiting in a year or so when 5G networks become more widely available. If you’re looking for the fastest wireless connectivity, the SE is not going to provide it.</p><p id=\"H9LjWN\">Battery life is good but not best in class. It should last about a day. Luckily, this iPhone supports wireless charging, which is still uncommon at this price point. And because it has the exact same shape as the iPhone 6, 6S, 7, and 8, there is a huge ecosystem of chargers and cases for it. Unlike many inexpensive Android phones, finding compatible accessories for the iPhone SE will be a breeze.</p><hr class=\"p-entry-hr\" id=\"smYbEU\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Google Pixel 5A.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OsDX3SyDEYXfF58kJLK4zYKEcXs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22781446/ajohnson_210813_4713_0001.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The Pixel 5A’s 6.34-inch screen isn’t huge, but it’s just big enough to not look out of place next to the 6.5-inch competition.</em></figcaption>  </figure></div><h2 id=\"B9aQm4\">2. <a href=\"https://www.theverge.com/22628205/google-pixel-5a-review-price-screen-battery-specs\">Google Pixel 5A</a></h2><h3 id=\"MeddEq\">The best Android phone under $500</h3><p id=\"7LCnMV\">If you’re looking for the best sub-$500 Android phone, the Pixel 5A is your best bet. </p><p id=\"aZV88A\">The $449 Pixel 5A has a 6.34-inch OLED screen that’s on the smaller side for the budget class, but it’s bigger than the previous-gen 6.2-inch panel on the Pixel 4A 5G. There’s a bigger battery, too: a 4,680mAh cell that will last through a full day of heavy use and well into day two if you’re a lighter user. The 5A also offers IP67 water resistance for added peace of mind in the event of accidental spills or tumbles into water.</p><p id=\"WD7mEy\">That’s more or less the extent of the 5A’s improvements over its predecessor. The 5A’s dual rear-facing cameras (main and ultrawide), Snapdragon 765G processor, as well as the 6GB RAM and 128GB storage combination, were inherited from the 4A 5G and still deliver solid performance in this iteration.</p><p id=\"N4bk7u\">Software is another area where Pixel phones shine, and the 5A is no exception. It launched with Google’s own Android 11 OS and has already gotten upgraded to Android 12. The software is refreshingly free of the added clutter that other manufacturers sometimes pile onto it. The Pixel 5A is also guaranteed three years of OS upgrades and security updates, which isn’t quite as long as Apple or Samsung’s standard software support timespan but is certainly better than a lot of the Android competition.</p><p id=\"uppsrx\">There’s also, of course, 5G connectivity. You won’t get the super-fast mmWave flavor of 5G support, but you will be able to access the slower but more common, sub-6GHz 5G network. </p><div class=\"c-float-left c-float-hang\"><aside id=\"L7fhLs\"><q>The 5A also offers IP67 water resistance </q></aside></div><p id=\"cubsS1\">But there’s a weird question mark over whether Google will support another set of frequencies that AT&amp;T and Verizon will start using in the near future called the C-band. The company isn’t committing to making the necessary software update to use it, despite supporting it in hardware. It’s a strange blemish on the 5A’s otherwise strong feature set.</p><p id=\"CHUScD\">The 5A is also getting somewhat of a limited release: it isn’t being sold through any of the major US carriers, but you can buy it from the <a href=\"https://store.google.com/us/product/pixel_5a_5g?hl=en-US\">Google Store</a> and <a href=\"https://fi.google.com/about/phones/pixel-5a-5g?id=CR6HaBzv0AUAEggeh2gc79AFAA%3D%3D\">Google Fi</a>. All in, the Pixel 5A is still the budget Android phone we’d recommend. It’s not flashy, but it’s well priced and has it where it counts.</p><hr class=\"p-entry-hr\" id=\"ykrqeX\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7jGjKdcssyDUAL1Vc67gH-WoCNo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22465667/ajohnson_20210419_4541_0005.jpg\">      <figcaption><em>The Galaxy A52 5G offers a 120Hz fast refresh-rate screen.</em></figcaption>  </figure></div><h2 id=\"qyhaRs\">3. <a href=\"https://www.theverge.com/22399456/samsung-galaxy-a52-5g-review-camera-screen-specs-price\">Samsung Galaxy A52 5G</a></h2><h3 id=\"7CPw9a\">The best phone display for $500 </h3><p id=\"qpM5xB\">If you’re looking for the best display for your money, the $500 Samsung Galaxy A52 5G is a great option for future-proofing your phone, albeit at the very top of this buying guide’s price range, but it’s well worth its higher price tag.</p><p id=\"Fpya2a\">The A52 5G’s 6.5-inch screen is an OLED panel that’s bright with good contrast that’s generally nice to look at. But its best feature is a subtle one: a 120Hz refresh rate that gives a much smoother appearance to animations and content as you swipe and scroll through menus and social feeds. We’ll likely see this feature make its way into more budget phones soon, but for now, the A52 5G is one of only a few to offer better than the standard 60Hz screen in its class, and it makes the experience of using the phone that much nicer.</p><p id=\"99z3je\">The phone overall performs well for its class with a Snapdragon 750G processor and 6GB of RAM. You may notice the occasional hesitation or stutter with heavy tasks, but otherwise, everyday scrolling, app switching, and navigating are handled easily. And even with a power-hungry display, the Galaxy A52 5G’s 4,500mAh battery should get you through at least a day of moderate to heavy use before needing another charge.</p><p id=\"DIU18y\">One of the A52 5G’s not-so-bright spots is Samsung’s current take on Android, which puts a lot of pre-downloaded apps on your phone that you probably don’t want, and it even </p><div class=\"c-float-right c-float-hang\"><aside id=\"85J3ce\"><q>more of an investment in a phone that you can keep using three or four years from now</q></aside></div><p id=\"C4ZNpo\">includes the occasional ad in places like the native weather app. For a cleaner or more grown-up Android skin, look to the Pixel or OnePlus. The Galaxy A52 5G’s camera is another consideration: it’s capable, but it tends toward an oversaturated look. If you prefer a more natural look to your photos, then the Pixel 5A is the winner here.</p><p id=\"INZwJl\">There’s also 5G, which we still don’t think is a feature you should run out and buy a new phone for, but it is nice to have the support here — particularly if you plan to hold on to your phone for a few years. This device doesn’t support super-fast mmWave 5G, but it’s hard to come by, so that’s not a huge loss. Importantly, it supports more widely available sub-6GHz bands and should be able to take advantage of improving 5G networks in the US over the next few years.</p><p id=\"mOCh8W\">You can buy a much less expensive device to get you through the next couple of years, and that’s just fine. But if you do want to make more of an investment in a phone that you can keep using three or four years from now, the A52 5G is your best bet right now on Android.</p><div id=\"Tty2Wh\"><div data-anthem-component=\"productcard:10885114\"></div></div><hr class=\"p-entry-hr\" id=\"JjjEKP\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"OnePlus, N10 5G\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BXMhOf_K6HW_6jVKD9akUraWoYk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22214229/ajohnson200104_4354_0001.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The N10 5G is priced well under $500.</em></figcaption>  </figure></div><h2 id=\"mjpWjB\">4. <a href=\"https://www.theverge.com/22214280/oneplus-nord-n10-5g-review\">OnePlus Nord N10 5G</a></h2><h3 id=\"nCclP5\">Best 5G phone for under $300 </h3><p id=\"RmpXOg\">At $299, the OnePlus N10 5G brings 5G and some upscale features to a budget phone. </p><p id=\"ge4QQF\">While you won’t find a fantastic screen here, its large 6.46-inch LCD does come with a faster-than-average 90Hz refresh rate. Worth noting is the device’s somewhat “tall” 20:9 aspect ratio, which is a little unusual at first glance but makes the phone slightly narrower and easier to use with one hand. Its processor is capable enough, though it sometimes shows its limits and only supports sub-6Hz 5G networks. It launched with Android 10, and </p><div class=\"c-float-left c-float-hang\"><aside id=\"XlPkb6\"><q>don’t expect to get Android 12 on this model</q></aside></div><p id=\"y4Y1Qv\">OnePlus has released the update to Android 11 already. But that’s it — don’t expect to get Android 12 on this model. OnePlus is offering two years of security updates in addition to that.</p><p id=\"FucmrC\">On the camera side, the N10 offers a 64-megapixel main camera that’s surprisingly good in daylight and even moderately low light. There’s an 8-megapixel ultrawide, too, along with macro and monochrome cameras that aren’t really worth talking about. It’s not Pixel 5A-level good, but if you don’t push it too hard, the N10’s main camera takes good photos in the right light.</p><p id=\"vB1WYg\">If you prefer Samsung phones, the <a href=\"https://www.theverge.com/2021/6/12/22529760/samsung-galaxy-a32-5g-review-price-screen-specs\">Samsung Galaxy A32 5G</a> is also well worth your consideration for two very good reasons: it’s a bit less expensive at $279 and will be supported with security updates for the next four years. However, it lacks some of the N10’s nicer features, like a higher refresh rate screen, good cameras, and a nicer implementation of Android. The A32 5G is a better pick if you want to hang on to your phone for as many years as possible, but the N10 is a more likable device overall.</p><p id=\"FOtHJH\">What if both the Samsung Galaxy A32 5G and the OnePlus Nord N10 5G are just beyond your budget, but you still want a 5G-ready phone in this price bracket? Luckily for you, the unlocked <a href=\"https://www.theverge.com/22547482/oneplus-nord-n200-5g-review-screen-price-specs\">OnePlus Nord N200 5G</a> retails for $240 (or lower from carriers) and includes some fancy features as well. You’ll be treated to a 1080p display that refreshes at 90Hz and a 5,000mAh battery, but it only includes 64GB of internal storage. Yes, it only works on T-Mobile’s sub-6GHz 5G network but will function as a 4G phone on Verizon and AT&amp;T. For the price, it’s not a bad way to get in on all the 5G action. </p><div id=\"2zE49h\"><div data-anthem-component=\"productcard:10348332\"></div></div><div id=\"83GHYn\"><div data-anthem-component=\"productcard:10885146\"></div></div><div id=\"5NGD5Q\"><div data-anthem-component=\"productcard:10885162\"></div></div><hr class=\"p-entry-hr\" id=\"0FM1jw\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"TCL 20S\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IyD38njcgbawWivV9S0_l-sDoHQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23010104/gsin_211112_4876_0002.jpg\">      <cite>Photo by Gloria Sin / The Verge</cite>      <figcaption><em>The TCL 20S has an usually vibrant screen for its class, thanks to TCL’s television display expertise.</em></figcaption>  </figure></div><h2 id=\"bFMC0d\">5. <a href=\"https://www.theverge.com/22717002/tcl-20s-and-20se-review-budget-affordable-unlocked-smartphone\">TCL 20S</a></h2><h3 id=\"Oj4ljX\"><strong>The best 4G phone under $300</strong></h3><p id=\"npapoA\">The TCL 20S is proof that even $250 can buy a good phone without many compromises. It just nails all the basics that anyone would want from a phone: good performance, a good screen, and good battery life, all for a good price.</p><p id=\"uRkfu4\">You might recognize the TCL brand from its popular budget smart TVs, where its screen expertise is what makes the TCL 20S’ vibrant, 6.67-inch 1080p screen a standout. The 20S has a layer of fingerprint-resistant, “micron-sized prismatic crystals’’ on its back that gives it a subtle shimmer. It has a quick fingerprint sensor that is built into its power button, as well as face unlock as an additional option.</p><div class=\"c-float-right c-float-hang\"><aside id=\"HhlvTs\"><q>for the best bang for your buck, the $250 TCL 20S is a solid choice</q></aside></div><p id=\"rA2h68\">While the 20S’ camera system is nothing to write home about, its 64-megapixel main camera and 15-megapixel front camera are both more than capable of taking detailed photos in good lighting conditions — just don’t use them for night or macro photography.</p><p id=\"xLPoSw\">For a budget phone, the 20S has no noticeable lag in performance, thanks to its Qualcomm Snapdragon 665 processor and 4GB of RAM. By default, it comes with 128GB of internal storage, a microSD card slot, a 3.5mm audio jack, and a 5,000mAh battery that lasts for around two days without a recharge.</p><p id=\"Ijydf9\">If your budget is sub-$300, and you are on the hunt for the best bang for your buck, the $250 TCL 20S is a solid choice that should work on all major 4G networks in the US.</p><div id=\"FtL0ba\"><div data-anthem-component=\"productcard:10861755\"></div></div><hr class=\"p-entry-hr\" id=\"PNDiYl\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Moto G Stylus (2021)\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xMwyscYsaBk45_Mxu3BlvMy9hSc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22336738/ajohnson_210228_4453_0002.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>Motorola’s Moto G Stylus (2021) is a good phone whether you’re a stylus devotee or just style-curious.</em></figcaption>  </figure></div><h2 id=\"2pPPrl\">6.<strong> </strong><a href=\"https://www.theverge.com/22311690/motorola-moto-g-stylus-2021-review-price-specs\">Motorola Moto G Stylus (2021)</a></h2><h3 id=\"0wGhHB\">The best budget phone with a stylus</h3><p id=\"MC6Jne\">It’s slim pickings for Android users who want a new budget phone with a stylus. With <a href=\"https://www.theverge.com/2021/4/4/22346084/lg-exits-smartphone-business\">LG exiting the smartphone market</a> and <a href=\"https://www.theverge.com/22627058/samsung-galaxy-note-stylus-z-fold-3-a-series\">Samsung pausing (or perhaps ending) its premium Galaxy Note series</a>, there’s only Motorola’s Moto G Stylus left to hold the line. </p><p id=\"Q6Y0rd\">Of the Motorola budget devices we’ve tested recently, the Moto G Stylus (2021) offers the best balance of features and cost-saving measures. It’s a good phone for $280, whether you’re a stylus devotee or just stylus-curious.</p><p id=\"pyyTGB\">It has a big 6.8-inch LCD display at 1080p resolution, good battery life with its 4,000mAh cell, and ample internal storage with 128GB of capacity. Thanks to its Qualcomm Snapdragon 678 processor and 4GB of RAM, the G Stylus performs just fine with the </p><div><aside id=\"fJsUIu\"><q>it’s a good phone for $280, whether you’re a stylus devotee or just stylus-curious</q></aside></div><p id=\"3VEksQ\">occasional hiccup. The cameras, though flawed, are good enough to get by. You won’t find an amazing night mode or top-notch picture quality here, but for a sub-$300 phone, it does the job just fine.</p><p id=\"44WwOS\">The Moto G Stylus’ stylus is built into the device like the Galaxy Note. Popping it out brings up a quick menu of shortcuts to stylus-friendly apps, like its coloring book app.</p><p id=\"y5Ppnc\">There’s no telling how much longer Motorola will make the Moto G Stylus, so if you want a budget phone with a built-in stylus, you should grab one while you can.</p><div id=\"fjmzFX\"><div data-anthem-component=\"productcard:10885207\"></div></div><hr class=\"p-entry-hr\" id=\"UcHD0D\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"TCL 20SE\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/y23HLKFT4D2eX5y-WPCxRJk6IUc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22911281/gsin_190125_4797_0008.jpg\">      <cite>Photo by Gloria Sin / The Verge</cite>      <figcaption>TCL 20SE has a gigantic 6.82-inch display that delivers brighter and more vibrant colors than other phones in its class .</figcaption>  </figure></div><h2 id=\"Qq9tmB\">7. <a href=\"https://www.theverge.com/22717002/tcl-20s-and-20se-review-budget-affordable-unlocked-smartphone\">TCL 20SE</a></h2><h3 id=\"tXDuyi\">The best 4G phone under $200</h3><p id=\"3LcHIR\">There aren’t many great phones available in the sub-$200 range, but the $190 TCL 20SE is a rare gem of its class. It has a 5,000mAh battery, ample onboard storage, and a beautiful “nano-photoetched” back that makes this budget phone look more expensive than it is. </p><p id=\"rPgkC4\">As the most affordable model of the TCL 20 series, the TCL 20SE has a gigantic 6.82-inch display that is quite low in resolution at 720p but delivers brighter and more vibrant colors than other phones in its class — thanks to TCL’s television screen expertise. </p><p id=\"TbBgrN\">The 20SE’s Qualcomm Snapdragon 460 processor is supported by 4G of RAM, where they work well enough together to make <em>Pokémon Unite</em> mostly playable, albeit with a slight lag. </p><div class=\"c-float-right c-float-hang\"><aside id=\"7K8RPt\"><q>This budget phone looks more expensive than it is</q></aside></div><p id=\"UeESwB\">Unlike other budget phones in this space, the 20SE comes with a generous 128GB of internal storage, plus a micro SD card slot for even more capacity. In addition, its 5,000mAh battery lasted a whopping 32 hours on one charge, using only Wi-Fi to connect to the internet. </p><p id=\"ve1o43\">While the 20SE’s 48-megapixel main camera can take great snaps in natural light, it’s not really meant for night or macro photography.</p><p id=\"AfkexN\">All things considered, TCL 20SE is a smart choice for a sub-$200 4G phone, especially If you won’t be using Verizon as your carrier.</p><p id=\"5bJEGA\">However, if you’re on an even tighter budget and need a 4G phone that will work on all the major carriers, you should consider Motorola’s <a href=\"https://www.theverge.com/22787370/moto-g-pure-review-4g-android-budget-phone\">Moto G Pure</a>. Retailing at $160 for the unlocked version, you may be able to find deals as low as free at some carriers — if you sign up for a plan, of course. While the Moto G Pure is slower and smaller than the TCL 20SE, it has a more capable 13-megapixel main camera (f/2.2 aperture) that works admirably in low-light situations. Unfortunately, the G Pure only comes with a paltry 32GB of internal storage, so you’ll need to budget for a microSD card to expand its extremely limited capacity. </p><div id=\"yq4gTc\"><div data-anthem-component=\"productcard:10875340\"></div></div><div id=\"hrRekQ\"><div data-anthem-component=\"productcard:10885230\"></div></div><hr class=\"p-entry-hr\" id=\"jpOqcd\">",
  "image": "https://cdn.vox-cdn.com/thumbor/A-zEG2fDCY5y-nV4DjMZkqVwjHc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23034854/best_phone_grid_16x9.jpg",
  "description": "Find a great phone at this price — just know your goals.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}