{
  "title": "The best wireless earbuds to buy right now",
  "url": "https://www.theverge.com/21309820/best-wireless-earbuds",
  "date": "2022-04-19T16:15:18.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qIqT6EMRepUea5ztPgjCClI6hqM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/67005648/DSCF4089_Edited.11.jpg\" />        <figcaption>Photo by Chris Welch / The Verge</figcaption>    </figure>  <p>The best from Apple, Samsung, Sony, Beats, and more</p> <p id=\"neJQmc\">It’s hard to buy a bad pair of wireless earbuds these days. The market has come a long way since the early era of true wireless earbuds when we had to deal with mediocre sound quality and unreliable performance, all for the sake of ditching wires. Things are much different now. After several product generations of learned lessons, companies like Sony, Apple, Samsung, and others are releasing their most impressive earbuds yet. </p><p id=\"H0HzJg\">You can get phenomenal noise cancellation and sound quality in the premium tier of earbuds if you’re willing to spend big. But those aren’t always the most important criteria for everyone: maybe you’re looking for the perfect fitness earbuds or for a set that works just as well for Zoom calls as for playing your favorite playlists and podcasts. Tech companies are increasingly making their earbuds <a href=\"https://www.theverge.com/22627099/samsung-galaxy-buds-2-apple-airpods-pro-ecosystem-lock-in-features-companion-app\">work best with their own products</a> through exclusive features and functionality, so that’s another thing to consider as you shop around.</p><div id=\"lVXiJ0\"><div data-anthem-component=\"productcard:10600158\"></div></div><p id=\"pqS6dl\">In terms of overall excellence, the best wireless earbuds you can get are Sony’s WF-1000XM4. They’ve got an unbeatable combo of top-notch active noise cancellation, wonderfully detailed audio, and long-lasting battery life. But we’ve also got a number of other picks based on other factors that you might rank higher. </p><h1 id=\"pNy3BT\">The best wireless earbuds in 2022</h1><hr class=\"p-entry-hr\" id=\"zlQO6t\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lSw46_F71FYZ50eLPQxU31hsJGw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22644193/DSCF4085_Edited.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Sony’s WF-1000XM4 are the best overall wireless earbuds.</em></figcaption>  </figure></div><h2 id=\"tmCflo\">1. <a href=\"https://www.theverge.com/22523584/sony-wf-1000xm4-wireless-earbuds-headphones-review\">Sony WF-1000XM4</a></h2><h3 id=\"mSCWfZ\">Best overall wireless earbuds</h3><p id=\"iRpJZT\">Though they come at a hefty price, the best overall wireless earbuds you can buy are Sony’s WF-1000XM4. They offer superb, warm, detailed sound quality and top-tier active noise cancellation. And their impressive battery life can stretch to eight hours of continuous listening with noise cancellation turned on, enough to outlast all of Sony’s top competition. </p><p id=\"SHOmBh\">The WF-1000XM4s have a premium, matte black (or light gray) design with stylish rose gold accents. Most earbuds come with standard silicone ear tips, but Sony includes foam-style tips that expand in your ears to create an excellent seal that, together with the noise cancellation, do an impressive job at hushing the outside world. </p><p id=\"de0Fag\">On Android phones, the 1000XM4s support Sony’s LDAC codec for higher-quality music playback. But even when used on other platforms, they’re up there with the very best audio-focused premium earbuds like Sennheiser’s Momentum True Wireless 2 — with much better noise cancellation. </p><p id=\"T49ehN\">The only thing preventing the 1000XM4 from being the perfect set of wireless earbuds is their lack of multipoint / two simultaneous Bluetooth connections. They’re also on the larger side compared to some of the competition. But with their best-in-class mix of features (including bonuses like 360 Reality Audio support), improved voice call performance, and impressive battery endurance, you can’t do much better. </p><hr class=\"p-entry-hr\" id=\"z7gyVY\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Lx1n1-UXCTGwKwbgPg4-95FUU5g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22854826/DSCF5585_Edited.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>The Jabra Elite 3 are the best wireless earbuds under $100.</em></figcaption>  </figure></div><h2 id=\"DOsyHK\">2. <a href=\"https://www.theverge.com/22676362/jabra-elite-3-wireless-earbuds-review\">Jabra Elite 3</a></h2><h3 id=\"wRf3xs\">Best earbuds under $100</h3><p id=\"xyCMjr\">Sometimes all you need are the fundamentals, and that’s where Jabra’s Elite 3 earbuds manage to rise above the crowded field of sub-$100 competition. Their sound puts some emphasis on the bass but still manages to come through nicely balanced overall with very good clarity for this price range.</p><div id=\"Fs6sYM\"><div data-anthem-component=\"productcard:10844228\"></div></div><p id=\"F63F5J\">The earbuds last for up to seven hours of continuous playback, and the compact case holds three additional charges. Their large physical buttons are easy to use, and the earbuds are rated IP55 for dust and water resistance. </p><p id=\"YdhZzT\">The Elite 3s lack the multipoint feature that Jabra has long been known for — that’s the main sacrifice you make for the price — but in an improvement from past models, either earbud can be used standalone in mono mode. And they’re extremely comfortable to wear for long stretches. You don’t get features like active noise cancellation or wireless charging (though Jabra does include a so-so transparency mode), but the Elite 3s perform reliably with a strong Bluetooth signal. They’re a terrific value for the money. </p><hr class=\"p-entry-hr\" id=\"hWu3Jv\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ds_HnWvvgrCsv6J7sKcYODjSnto=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21946559/IMG_0720-1.0.jpeg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Bose’s QuietComfort Earbuds have the best noise cancellation you’ll find in any earbuds.</em></figcaption>  </figure></div><h2 id=\"EGS3sY\">3. <a href=\"https://www.theverge.com/21507552/bose-quietcomfort-earbuds-review-best-noise-cancellation\">Bose QuietComfort Earbuds</a></h2><h3 id=\"AGqjBz\">Best noise-canceling earbuds</h3><p id=\"0TWUxd\">Bose’s QuietComfort Earbuds are neck and neck with Sony when it comes to the effectiveness of their active noise cancellation — and probably a hair better. Like their main rival, the QC Earbuds have a fit and finish that exudes quality. </p><div id=\"Aar5Ga\"><div data-anthem-component=\"productcard:10386455\"></div></div><p id=\"zicZdh\">With Bose’s mobile app, you can dial in the level of noise cancellation that’s perfect for the environment you’re in. Their charging case is a bit chunky, but it supports wireless charging. The QC Earbuds also handle voice calls better than most, so that’s another plus in exchange for their pricey cost.</p><hr class=\"p-entry-hr\" id=\"iU0gjj\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rqULYd7Vneck60NRlyx1aucD5Hc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22973267/DSCF6021_Edited_2.JPG\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>The Beats Fit Pro are the best earbuds for running and working out.</em></figcaption>  </figure></div><h2 id=\"Phouot\">4. <a href=\"https://www.theverge.com/22753158/beats-fit-pro-earbuds-review-apple\">Beats Fit Pro</a></h2><h3 id=\"MJaN1M\">Best earbuds for working out</h3><p id=\"xk3ZRx\">The long-reigning champ of fitness earbuds, the Powerbeats Pro, have finally been defeated. And fittingly, they’ve been outdone by Beats’ latest earbuds. The Beats Fit Pro trade the ear hooks of the Powerbeats for a new wing tip design that keeps them securely locked in your ears during even the most vigorous workouts. As a result, these earbuds have a much smaller form factor — and their carrying case is mercifully far more manageable. The way these earbuds magnetically latch into the case also means you don’t have to worry about one or both buds failing to charge in the case, which was a common annoyance with the Powerbeats Pro.</p><p id=\"XPJTnP\">Unlike the Powerbeats Pro, the Fit Pros include active noise cancellation. And they’re on par with the AirPods Pro in that department, so you’ll be able to exercise without distraction. When you do want to stay alert to your surroundings, the transparency mode is also as natural-sounding and clear as on the AirPod Pros. </p><div id=\"8NgG5q\"><div data-anthem-component=\"productcard:10844241\"></div></div><p id=\"sfx8aI\">The earbuds are rated IPX4 for water resistance. While that’s not as robust as some other fitness-focused buds, it should be sufficient to survive sweat and outdoor runs in various conditions. The Fit Pros have easy-to-use physical button controls, and although they lack the dedicated volume rocker of the Powerbeats Pro, you’ve got the option to remap a long-press of each earbud to adjust volume instead of toggling noise cancellation.</p><p id=\"W7gkOl\">If you’re an iPhone owner, the Fit Pros offer Apple-only features like dynamic head tracking for spatial audio, auto device switching, Find My integration, and more. For Android users, Beats has an app that will let you adjust settings and see the battery status of the earbuds and case, among other functions. </p><hr class=\"p-entry-hr\" id=\"UrdVrj\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uPyp1tAFu7ySzKQN1zzQF9Y5QPI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19336099/cwelch_191031_3763_0003.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Apple’s AirPods Pro remain the best earbuds for people who own several of the company’s other devices.</em></figcaption>  </figure></div><h2 id=\"5DaumO\">5. <a href=\"https://www.theverge.com/2019/11/1/20942472/apple-airpods-pro-review-design-price-specs-features-noise-cancellation\">Apple AirPods Pro</a></h2><h3 id=\"DkEuTL\">Best earbuds for Apple fans</h3><p id=\"lLBDNk\">For those invested in Apple’s ecosystem, the AirPods Pro offer an appealing mix of powerful noise cancellation, good-enough sound quality, and an array of features that make them the ideal companion to the company’s other devices. They’re also the only AirPods that come with different sizes of ear tips for a customizable fit. </p><p id=\"kqPPhS\">The AirPods Pro have a compact case that supports wireless charging. Setting them up is as simple as holding the open case near your iPhone. The earbuds are lightweight and fit snugly in most ears. Their force sensor pinch controls are easy to get down, and they rank among the very best wireless earbuds when it comes to voice call quality. Their ANC can’t match Bose or Sony but is enough to quiet your surroundings a fair amount, and the transparency mode almost makes it feel like you’re not wearing earbuds at all.</p><div id=\"pqRzuC\"><div data-anthem-component=\"productcard:9513673\"></div></div><p id=\"mxfus6\">Where the AirPods stand out is with their Apple-only features like head tracking for spatial audio, automatic pairing with all of your Apple iCloud devices, auto device switching, extensive Find My support, and so on. They also support audio sharing, and if you’ve got an Apple TV and need to keep things quiet in the living room or bedroom, you can use the AirPods for private listening. The AirPods Pro are pretty standard in other areas like sound quality and battery life, but their deep intertwining with Apple’s world is reason enough to give them serious consideration.</p><hr class=\"p-entry-hr\" id=\"9rJ372\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VKKynJBCoA04Zi7RagNuJaU9rdo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22775336/IMG_1106_Edited_2.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>If you’ve got a Samsung Galaxy smartphone, the Galaxy Buds 2 are the best earbuds to go along with it.</em></figcaption>  </figure></div><h2 id=\"q3cBQl\">6. <a href=\"https://www.theverge.com/22619305/samsung-galaxy-buds-2-review-specs-price-features\">Samsung Galaxy Buds 2</a></h2><h3 id=\"5YAL6G\">Best earbuds for Samsung fans</h3><p id=\"FuVr9O\">Samsung’s Galaxy Buds 2 are so good that there’s little reason to shell out more money for the Galaxy Buds Pro. They’ve got a small, discreet design that won’t stick out of your ears like other buds. They sit more comfortably over long stretches of time than the company’s Pro buds. And the Buds 2 produce balanced, vibrant sound that’s quite close to the sound signature of the Pros.</p><div id=\"q9Ybgn\"><div data-anthem-component=\"productcard:10844268\"></div></div><p id=\"2LdugR\">If there’s one downside, it’s the below-average IPX2 water resistance, which makes them less than ideal for workouts or getting caught in the rain. The Buds Pro have a more worry-free IPX7 rating. </p><hr class=\"p-entry-hr\" id=\"j12RRo\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/M6h63DEaW6azn8uU-w15vHQCU8M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22800050/DSCF4677_Edited.JPG\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>The OnePlus Buds Pro are the best earbuds if you’re a loyal OnePlus customer.</em></figcaption>  </figure></div><h2 id=\"9LHtPH\">7. <a href=\"https://www.theverge.com/2021/8/23/22637548/oneplus-buds-pro-review-specs-price-features\">OnePlus Buds Pro</a></h2><h3 id=\"aYIRNs\">Best earbuds for OnePlus fans</h3><p id=\"pJYhX6\">OnePlus has come a long way since its original OnePlus Buds. The OnePlus Buds Pro are the company’s most refined earbuds yet, with a sleek stemmed design that’s right on par in comfort with Apple’s AirPods Pro. There’s no denying that these are AirPod clones, but their noise cancellation is slightly even better than Apple’s, and there’s a satisfactory transparency mode to go along with it.</p><div id=\"NawWim\"><div data-anthem-component=\"productcard:10844490\"></div></div><p id=\"yaWD39\">The controls are pretty much an exact copy of the AirPods Pro squeeze gestures, but OnePlus manages to best Apple at durability: these are rated IP55 for dust and water resistance. Voice call performance is also above most earbuds that cost the same $150 as the OnePlus Buds Pro. For that price, you also get wireless charging in the case. And when it comes to calls, the OnePlus Buds Pro are among the very best performers out there with clear voice reproduction and excellent background noise cancellation so others can hear you perfectly. </p><hr class=\"p-entry-hr\" id=\"FIJ8K9\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/WK-mSuFuVOg5iUNkHQdRI1SwPYA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22953803/IMG_0044.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Apple’s AirPods 3 are the best earbuds for voice calls and sound much better than their predecessors.</em></figcaption>  </figure></div><h2 id=\"MMWh6V\">8. <a href=\"https://www.theverge.com/22744686/apple-airpods-third-gen-review\">Apple AirPods (third generation)</a></h2><h3 id=\"zUT2zw\">Best earbuds for voice calls on iPhone</h3><p id=\"2Yu1aA\">Apple’s third-generation AirPods have a new design with shorter stems than the original model. But even with their mics now being farther from your mouth, they still perform very well on calls — and there are bigger improvements to sound quality and fit / comfort that make upgrading to the so-called AirPods 3 worthwhile. </p><div id=\"J0qCuz\"><div data-anthem-component=\"productcard:10844500\"></div></div><p id=\"lZKllk\">Apple has also added new features that were previously exclusive to the AirPods Pro, like head tracking spatial audio and deeper Find My integration for hunting down your misplaced buds. And the case is now optimized to work with Apple’s MagSafe wireless charging system. The AirPods still have a one-size-fits-most hard plastic form factor, so you’ll want to try them before buying to make sure they’re the right match for your ears. But if they are, these are Apple’s best regular AirPods yet by a wide margin.</p><hr class=\"p-entry-hr\" id=\"P3VBkm\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yeZR7S10SzSHm1RIGsMkKrMyago=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23241306/9A5F2D63_4916_4C88_8108_219AB41DDB45.jpeg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Sony’s LinkBuds are the best earbuds for voice calls on Android.</em></figcaption>  </figure></div><h2 id=\"6kvmL6\">9. <a href=\"https://www.theverge.com/22933521/sony-linkbuds-earbuds-review-features-specs\">Sony LinkBuds</a></h2><h3 id=\"rEED6p\">Best earbuds for voice calls on Android</h3><p id=\"8OHWyv\">Sony’s unconventional-looking LinkBuds have a donut hole right in the middle of each earbud. This surprisingly comfortable design is meant to allow in outside noise and keep you aware of your surroundings at all times. But it also means that the LinkBuds won’t be for everyone — especially those people who prefer to drown out the world when listening to their music.</p><p id=\"KW66TB\">But more than their quirky fit, the LinkBuds’ greatest strength is stellar performance on voice calls. Sony reworked its voice isolation algorithms for these earbuds, and as a result, the LinkBuds are several rungs above the call quality of the flagship 1000XM4s and nearly <em>all</em> competitors minus AirPods. If you’re looking for something you can pop into your ears throughout the workday, the LinkBuds don’t disappoint. </p><hr class=\"p-entry-hr\" id=\"9ct7ND\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1Mbuxj5OdJvZId3pvKYdYSwxyzc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22792478/DSCF4633_Edited.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Razer’s Hammerhead True Wireless earbuds have flashy RGB lighting.</em></figcaption>  </figure></div><h2 id=\"PcGTEM\">10. <a href=\"https://www.theverge.com/22632338/razer-hammerhead-true-wireless-earbuds-2nd-gen-review\">Razer Hammerhead True Wireless (2021)</a></h2><h3 id=\"6ic0rB\">Best earbuds for mobile gaming</h3><p id=\"PG68TP\">The Hammerhead True Wireless earbuds have decent sound quality and active noise cancellation for their price. But likely, what’s equally as important to avid mobile gamers is their low latency gaming mode that cuts response time down to 60ms.</p><div id=\"2TSOzc\"><div data-anthem-component=\"productcard:10844522\"></div></div><p id=\"KcYx9m\">And then there’s the Chroma. Unlike the first-gen Hammerhead True Wireless, these ones have fully customizable RGB lights on each earbud. It’s an eye-catching effect, though it does eat into battery life a little. Razer’s mobile app for the earbuds allows for control remapping and extensive EQ adjustment. The Hammerhead True Wireless earbuds are average in metrics like battery life, and their transparency mode is merely passable, but if you’re big on Razer gear, now you can flash the brand while playing your favorite mobile games at the coffee shop.</p><hr class=\"p-entry-hr\" id=\"KVAIqq\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fpQT7CfT9FwmZzy0mKv08NvJYdA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22747060/DSCF4365_20Edited.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>The Nothing Ear 1s have a very cool look, but they can be buggy.</em></figcaption>  </figure></div><h2 id=\"9AzthM\">11. <a href=\"https://www.theverge.com/22598920/nothing-ear-1-earbuds-review-features-specs\">Nothing Ear 1</a></h2><h3 id=\"nhE8Ll\">Best earbuds for standout style</h3><p id=\"0pKVp1\">Though they can be buggier than we’d like, and their noise cancellation is run of the mill, there’s no denying that the first earbuds from Nothing have a unique look. With their semi-translucent design and unique charging case, the Ear 1 earbuds will catch some attention when lined up with earbuds from more established brands. And at $99, you don’t have to break the bank for that added style — and maybe that price will make it easier to overlook the areas where Nothing came up short with its debut pair of earbuds. </p><div id=\"7fqCtb\"><div data-anthem-component=\"productcard:10844531\"></div></div><hr class=\"p-entry-hr\" id=\"xiUBQ2\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/a1OfV5rzbzKb1R-s-3DuQUVa0P4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21993704/DSCF2216.0.jpeg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>The UE Fits can mold to the contours of your ear for a perfect fit.</em></figcaption>  </figure></div><h2 id=\"tbqWHp\">12. <a href=\"https://www.theverge.com/21537150/ue-fits-review-wireless-earbuds-review-custom-fit-ear-tips\">UE Fits</a></h2><h3 id=\"MAbkyl\">Best earbuds for a perfect fit</h3><p id=\"0VNbge\">They mold to the shape of your ears in 60 seconds. That’s really all that needs saying for you to know why the UE Fits surpass all other wireless earbuds at nailing the right fit. Short of visiting an audiologist and having custom IEMs made, you’re not going to do much better. </p><div id=\"X9garq\"><div data-anthem-component=\"productcard:10386604\"></div></div><p id=\"ZZfliz\">But the Fits are really only worth it if you often struggle with keeping other earbuds in your ears. If you’ve exhausted all options (including trying memory foam tips), then definitely give these a try. The molding sensation — the tips warm up in your ears as they adapt their shape — is certainly unlike anything you’ll get from other earbuds. </p><p id=\"QSR2yw\">Related: </p><div id=\"kwcWJO\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"2021 Airpods|104501\" data-volume-uuid=\"1a50839d4\" data-volume-id=\"104501\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-437\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZZpanm2soOMOSBM6R4agJ37d2G0=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22644194/DSCF4089_Edited.jpg",
  "description": "Sony takes the top spot, but there’s a new pick for fitness buds.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}