{
  "title": "The era of fixing your own phone has nearly arrived",
  "url": "https://www.theverge.com/23017361/ifixit-right-to-repair-parts-google-samsung-valve-microsoft",
  "date": "2022-04-09T16:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ARLxuO6zt0hYp4i3D1fro3sWpqk=/0x256:4763x3431/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70730459/ZMAy1r2nNBMo5WNf.0.jpg\" />        <figcaption><em>Inside a Pixel 5 smartphone.</em> | Image: iFixit</figcaption>    </figure>  <p>Fresh off big wins with Google, Samsung and Valve, iFixit says more parts deals are nigh </p> <p class=\"p--has-dropcap p-large-text\" id=\"17DJxt\">When I called up iFixit CEO Kyle Wiens, I figured he’d be celebrating — after years of fighting for right-to-repair, <a href=\"https://www.theverge.com/2022/4/8/23016233/google-pixel-smartphones-ifixit-repair-program\">big name companies like Google</a> <a href=\"https://www.theverge.com/2022/3/31/23004309/samsung-self-repair-service-program-ifixit-right-to-repair-galaxy\">and Samsung</a> have suddenly agreed to provide spare parts for their phones. Not only that, they signed deals with <em>him</em> to sell those parts through iFixit, alongside the company’s repair guides and tools. <a href=\"https://www.theverge.com/2022/2/15/22935171/valve-steam-deck-replacement-parts-teardown-ifixit\">So did Valve</a>.</p><p id=\"2fIdRc\">But Wiens says he’s not done making deals yet. “There are more coming,” he says, one as soon as a couple of months from now. (No, it’s not Apple.) <a href=\"https://www.theverge.com/circuitbreaker/2018/10/23/18013320/ifixit-motorola-official-parts-repair-kits\">Motorola was actually the first to sign on</a> nearly four years ago. And if Apple meaningfully joins them in offering spare parts to consumers — <a href=\"https://www.theverge.com/2021/11/19/22787245/apple-iphone-mac-self-service-program-repair-diy\">like it promised to do by early 2022</a> — the era of fixing your own phone may be underway. Last October, the United States <a href=\"https://www.theverge.com/2021/10/27/22747310/us-copyright-office-dmca-section-1201-exemption-rulemaking-report\">effectively made it legal to open up many devices for the purpose of repair</a> with an exemption to the Digital Millennium Copyright Act. Now, the necessary parts are arriving.</p><p id=\"D1VqUa\">What changed? Weren’t these companies fighting tooth and nail to keep right-for-repair off the table, <a href=\"https://www.theverge.com/2019/5/1/18525542/apple-right-to-repair-bill-california-lobbyist-comptia\">sometimes sneakily stopping bills at the last minute</a>? Sure. But some legislation is getting through anyhow... and one French law in particular might have been the tipping point. </p><div class=\"c-float-right c-float-hang\"><aside id=\"yfJROV\"><q>80 percent said they’d choose a more repairable device</q></aside></div><p id=\"CRrE3t\">“The thing that’s changing the game more than anything else is the French repairability scorecard,” says Wiens, referring to a 2021 law that requires tech companies to reveal how repairable their phones are — on a scale of 1.0 to 10.0 — right next to their pricetag. <a href=\"https://www.theverge.com/2021/2/26/22302664/apple-france-repairability-scores-index-law-right-to-repair'\">Even Apple was forced to add repairability scores</a> — but Wiens points me to <a href=\"https://news.samsung.com/fr/sondage-indice-reparabilite\">this press release by Samsung</a> instead. When Samsung commissioned a study to check whether the French repairability scores were meaningful, it didn’t just find the scorecards were handy —  it found a staggering <em>80 percent of respondents would be willing to give up their favorite brand for a product that scored higher. </em></p><p id=\"itx8Lu\">“There have been extensive studies done on the scorecard and it’s working,” says Wiens. “It’s driving behavior, it’s shifting consumer buying patterns.” </p><p id=\"uyMRBc\">Stick, meet carrot. Seeing an opportunity, Wiens suggests, pushed these companies to take up iFixit on the deal.</p><p id=\"nZKFZU\">Nathan Proctor, director of the Campaign for the Right to Repair at the US Public Interest Research Group (US PIRG), still thinks the stick is primarily to thank. “It feels cheeky to say 100 percent... but none of this happens unless there’s a threat of legislation.”</p><p id=\"0ILDM7\">“These companies have known these were issues for a long time, and until we organized enough clout for it to start seeming inevitable, none of the big ones had particularly good repair programs and now they’re all announcing them,” Proctor notes. He draws my attention to the fact <a href=\"https://www.pubaffairsbruxelles.eu/right-to-repair-meps-want-more-durable-and-more-easily-repairable-products-eu-parliament-press/\">the European Parliament just voted 509-3</a> in favor of asking the EU to force manufacturers to make devices more repairable.</p><div><aside id=\"ZtwGaK\"><q>“none of this happens unless there’s a threat of legislation.”</q></aside></div><p id=\"NP6wH7\">“I think there’s a growing realization and resignation that phones are going to last longer and there’s nothing they can do about it,” says Wiens.</p><p id=\"d1idHj\">Google might have a financial incentive, too, Proctor admits. “Google is a huge, huge company, but their Pixel phone sales are not a big part of the market, right? Some of the carrot is they can do something about a really popular anti-trust, anti-monopoly issue in an area where they’re not the dominant player.” </p><p id=\"9uPtbo\">What about the practical reasons tech companies have stonewalled right-to-repair in the past, concerns about consumers accidentally puncturing their batteries or breaking their phones, and forcing the likes of Google or Samsung to handle more support calls? Wiens says they’re a bit overblown. But he also claims it’s why these companies chose iFixit, because his website provides repair guides and specially designed tools that make people less likely to screw up.</p><p id=\"s5QdjN\">Samsung, Google, and even Valve aren’t necessarily opening up the floodgates to every kind of repair, mind you. Wiens says iFixit won’t be selling any boards with chips, so if your Pixel sprouts the kind of notorious bootloop issue that <a href=\"https://www.theverge.com/circuitbreaker/2018/1/31/16957332/lg-bootloop-lawsuit-settlement-g4-v10-v20-nexus-5x-g5\">plagued many Nexus phones</a>, you’ll still need Google to fix it. “[Boards are] definitely something to look at, but there are supply chain challenges around making those,” he says.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/q38WAEyxOI5HPKsexaNxri1Z_oU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23375848/Screen_Shot_2022_04_08_at_9.26.40_AM.jpg\">      <cite>Image: iFixit</cite>      <figcaption><em>Google Pixels alongside iFixit tools.</em></figcaption>  </figure></div><p id=\"Q84tB1\">Importantly, the most common parts should indeed be included in iFixit’s new parts caches, like official screens and batteries, and iFixit says it’s committed to supporting phones even if it has to stockpile “last chance” components when factories quit making them. While it’s difficult to forecast how many of those components they’ll need, the manufacturers are helping some, sharing data with iFixit, like how many phones they’ve sold.</p><p id=\"Nn6FNy\">Wiens says iFixit already has hundreds of thousands of parts in an offsite warehouse, and is currently expanding as a result of these deals. Wiens won’t say if tech companies are subsidizing the parts or how much you’ll pay, but iFixit says it does have to buy them and will sell them at a markup.</p><p id=\"kaczU8\">While you don’t necessarily need officially sanctioned parts for every kind of repair, it sounds like there might be some perks: iFixit’s repair kits will come with the same kind of pre-cut waterproofing gaskets that Google and Samsung use to properly re-seal their own phones. “As long as you do it right, get the seal all the way around, then you’re good again,” says Wiens. </p><p id=\"Z5DTzT\">He says it’s something more people should probably do once every year or two anyhow — since the adhesive that manufacturers use to waterproof their gadgets tends to wear out over time. “You do your first test in the shower and you’re happy with it, that doesn’t mean that three months later it’ll still work in the shower,” he adds.</p><div class=\"c-float-right c-float-hang\"><aside id=\"dRVRLd\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The shareholder fight that forced Apple’s hand on repair rights\",\"url\":\"https://www.theverge.com/2021/11/17/22787336/apple-right-to-repair-self-service-diy-reason-microsoft\"},{\"title\":\"Apple, Microsoft, and Google all receive poor grades on repairability report card\",\"url\":\"https://www.theverge.com/2022/3/8/22949669/apple-microsoft-google-repairability-index-ranking\"},{\"title\":\"Apple was conflicted over right-to-repair stance, emails show\",\"url\":\"https://www.theverge.com/2020/7/30/21348240/apple-right-to-repair-legislation-antitrust-investigation-policy\"},{\"title\":\"John Deere turned tractors into computers — what’s next?\",\"url\":\"https://www.theverge.com/22533735/john-deere-cto-hindman-decoder-interview-right-to-repair-tractors\"}]}'></div></aside></div><p id=\"BTvynT\">Regardless of whether these companies are being pushed or led, the result might be the same: an era where your aging good-enough phone can stay good-enough for far longer than it otherwise might. Politicians, <a href=\"https://www.theverge.com/2021/7/9/22570826/president-joe-biden-executive-order-right-to-repair\">governments</a>, <a href=\"https://www.theverge.com/2021/7/21/22587331/right-to-repair-apple-iphone-ftc-lina-khan-open-meeting\">regulators</a>, <a href=\"https://www.theverge.com/2021/11/17/22787336/apple-right-to-repair-self-service-diy-reason-microsoft\">shareholders</a>, and advocacy groups like US PIRG are <a href=\"https://www.theverge.com/2022/3/8/22949669/apple-microsoft-google-repairability-index-ranking\">putting on the pressure</a>, and it may open up opportunity as well.</p><p id=\"IszpLj\">“If the market were to change and people hold onto phones a lot longer... eventually the companies would change and they’d find a way to make more money in that environment, right?” says Proctor, suggesting that a phone that lasts might be another way to get customers to stick around. “I’m just encouraged that those incentives are now a bit more aligned with what’s better for people on the planet.” </p><p id=\"twykvv\">I fully expect tech companies will continue to resist right-to-repair in some ways, even while pretending to embrace it. (<a href=\"https://www.theverge.com/2020/2/6/21126970/apple-iphone-independent-repair-contract-search-audit\">We’ve seen that from Apple before</a>, and Apple didn’t respond to a request for comment this week about its Self Service Repair Program.) There are lots of ways for companies to screw around, like charging too much for parts or throwing up scary warnings — to its credit, Apple <a href=\"https://www.theverge.com/2021/12/9/22824733/apple-iphone-part-service-history-ios-15-2\">does seem to be backing off</a> on that one.</p><p id=\"79J7N1\">And of course, they’ll continue to entice you to rapidly upgrade to new phones, like <a href=\"https://www.theverge.com/2021/9/20/22678111/iphone-13-carrier-promotions-new-signups\">how carriers brought back the subsidy model last year</a> to spur sales while society was still stuck at home, and how Apple is reportedly looking to <a href=\"https://www.theverge.com/2022/3/24/22994814/apple-iphone-hardware-subscription-bundle-report\">sell the iPhone as a subscription service now</a>. </p><p class=\"c-end-para\" id=\"8ir7cl\">But it sounds like when my iPhone mini’s battery expires and <a href=\"https://www.theverge.com/2022/3/16/22980216/apple-iphone-mini-hopefully-alive\">there’s no new mini to replace it</a>, I’ll be able to swap the battery myself. And if not? I might take a hint and switch to a newly repairable Pixel.</p><p id=\"e58Uig\"></p><p id=\"22yaar\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WOaJkahoMt8VB32rXzZ3FHwJqrw=/0x596:4763x3090/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23377704/ZMAy1r2nNBMo5WNf.jpg",
  "description": "iFixit won over Google, Samsung and Valve. Who’s next?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}