{
  "title": "The best phone plans in 2022 (and how to pick one)",
  "url": "https://www.theverge.com/22606623/best-cell-phone-plans-verizon-att-t-mobile",
  "date": "2022-04-11T17:05:28.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/scMaL7yhAqctduO7lUG16ZZ6KzM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/69687901/awhite_200223_3916_0446.0.jpg\" />        <figcaption>Photo by Avery White for The Verge</figcaption>    </figure>  <p>Shopping for a phone plan doesn’t have to be painful</p> <p class=\"p--has-dropcap\" id=\"sWASXY\">Some of us get excited about shopping for a new phone (New technology! Megapixels! Fancy screen!), but none of us enjoy shopping for a new phone plan. It’s always been a confusing experience, and things aren’t getting any easier to understand in the era of 5G. With more 5G spectrum coming online this year — <a href=\"https://www.theverge.com/22914668/5g-uw-uc-icon-meaning-verizon-att-t-mobile\">and carriers inventing more words for it</a>— understanding what a phone plan includes and picking the right one is difficult. While we can’t promise to make it an enjoyable experience, we can help you do a little homework ahead of time to make it less painful. </p><p id=\"OQUpt4\">If you prefer to cut right to the chase, we’ve got two recommendations from the major US carriers for you: <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.t-mobile.com%2Fcell-phone-plans%2Fessentials&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22606623%2Fbest-cell-phone-plans-verizon-att-t-mobile\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>T-Mobile’s Essentials</strong></a> if you’re looking for unlimited and <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergePhonePlans08052021/https://www.verizon.com/plans/shared-data/\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Verizon’s 10GB Shared Data plan</strong></a> if you’d rather have a set amount of data each month.</p><div id=\"ObrwNh\"><div data-anthem-component=\"productcard:10682646\" data-anthem-component-data='{\"layout\":\"full_with_square_img\"}'></div></div><div id=\"EVX5wr\"><div data-anthem-component=\"productcard:10682697\" data-anthem-component-data='{\"layout\":\"full_with_square_img\"}'></div></div><p id=\"YxiK3j\">T-Mobile’s Essentials plan is your best bet for a cheap phone plan with unlimited data: at $60 per month for a single line, it’s the least expensive unlimited plan from a major carrier and includes some nice extras like wireless hotspot data (at slower 3G speeds, but better than none at all — which is what you’ll get on comparable plans).</p><p id=\"rGcWlt\">Verizon’s 10GB Shared Data plan is $65 per month for a single line and should provide plenty of data for most people. Verizon lets you roll over unused data and includes mobile hotspot usage for no extra fee.</p><p id=\"HZtrZO\">We’ll go into more detail about these plans and some of our recommendations for the best cheap unlimited plan, best premium unlimited plan, and best cheap by-the-gig plan a bit later, but first, take a look at a few things to consider before you pick a plan. If you also happen to be shopping for a new device, we’ve got suggestions for the <a href=\"https://www.theverge.com/22163811/best-phone\">best phone you can buy right now</a> and the <a href=\"https://www.theverge.com/21420196/best-budget-smartphone-cheap\">best phone under $500</a>.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/s_qJ3xeWXCnCBAPAWbr7rMnn2vM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13250625/akrales_181010_3013_0161.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure></div><h3 id=\"nUzok3\">Location</h3><div class=\"c-float-right c-float-hang\"><div id=\"fL0aST\"><div data-anthem-component=\"aside:10686366\"></div></div></div><p id=\"kTOBax\">This is an obvious — and important — first consideration in your mobile plan shopping process. On a high level, you’ll want to know which wireless carriers cover your area. If you’re in or near a major city, you’re pretty much guaranteed service from any of the major carriers. If you’re in a rural area, you may have fewer choices and a smaller, regional carrier might serve your needs better. </p><p id=\"I5Jvjw\">Carriers’ published coverage maps are a good starting point. They’re not reliable enough to gauge coverage in a particular neighborhood or on your street, but they can help identify carriers without a significant presence in your area. Check US Cellular’s coverage, too, since it tends to offer service where some of the major carriers don’t. </p><p id=\"3O97am\"><em>PCMag</em> provides a thorough, balanced evaluation of the major carriers’ network performance across the country every year; <a href=\"https://www.pcmag.com/news/fastest-mobile-networks-2021\">take a look at the 2021 results</a>. And it doesn’t hurt to poll your co-workers and neighbors about their wireless service for more data points.</p><h3 id=\"FHTFCl\">Budget basics</h3><p id=\"xeRavP\">When you start shopping around, you’ll see some very attractive prices on the major carriers’ unlimited plans, like $30 or $45 per month. Remember that those are prices <em>per line</em> on your account, and the prices carriers like to show you are based on their best per line rate, which is usually available when you have four or five lines. If you’re shopping for a single line, expect to spend around $70 per month, plus taxes and fees in most cases. For four lines, expect around $140 for your total bill.</p><p id=\"7LEeRV\">The quoted prices on carriers’ websites also include a discount for signing up for autopay. If you’re not comfortable signing up for autopay, you’ll need to add a little more to your monthly bill — $10 per line per month in most cases.</p><h3 id=\"702rIO\">Shared data versus unlimited</h3><p id=\"DnX0ZR\">Plan costs add up fast, but there are ways to save a little bit if you’re okay with looking outside of the big carriers’ marquee plans. If you’re a lighter data user, a shared data plan with a set allotment of data per month can save you a bit of money. AT&amp;T and Verizon both offer such plans starting around $50 per month for a single line. (All of T-Mobile’s plans offer some kind of “unlimited” data service.)</p><p id=\"aaXT4w\">Shared data plans seem to be on their way out, and carriers will be much happier to steer you toward an unlimited plan. There are some downsides to shared data plans, too. They tend to be limited to 4G or low-band 5G, which isn’t a big deal now but could be in the next few years. But on the plus side, both Verizon and AT&amp;T allow mobile hotspot use on their shared data plans, which isn’t an option on either carrier’s basic unlimited plan.</p><p id=\"m0GJll\">Which brings us to one of the great mysteries of carrier unlimited plans: they aren’t really unlimited. Even the most expensive unlimited plans include limitations on how much data you can use via mobile hotspot. Most plans also include monthly data thresholds that, once exceeded, leave you subject to temporary slowdowns in times when the network is busy. Before you pick an unlimited plan, it’s a good idea to <a href=\"https://www.theverge.com/2021/3/31/22360228/unlimited-plan-verizon-att-t-mobile-premium-data-tethering-limits\">read up on the fine print</a> so you know just what you are (and aren’t) getting. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ePTP7Pj9AsZJelzBrpC_kv5cKl0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/11579471/akrales_180620_1777_0481.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure></div><h3 id=\"wEQp9g\">MVNOs</h3><div class=\"c-float-right c-float-hang\"><div id=\"Fwtn3f\"><div data-anthem-component=\"aside:10685640\"></div></div></div><p id=\"CN3dzx\">Signing up with a Mobile Virtual Network Operator (MVNO) can also help you save some money. These companies resell service on the major carriers’ networks, so with a couple of exceptions, you’re getting access to the same network for less money. These plans are better suited for those who don’t need the absolute best network speeds because they typically include lower prioritization thresholds than the major network plans. </p><p id=\"a7hMrT\">Many MVNOs are set up to operate without retail locations, too, which could be a positive or a negative depending on if you prefer to walk into a store to troubleshoot issues with your connectivity. They’re also more eagerly adopting eSIM, which many newer phones support and which removes the need to wait for a physical SIM card to pop into your device.</p><p id=\"XQzs7e\">Generally, you’ll find more plan options with set data limits per month than the few shared data options that remain with the big carriers. You’ll also find more prepaid options and fewer requirements like credit checks or contracts.</p><h3 id=\"2YDxaJ\">Prepaid versus postpaid</h3><div class=\"c-float-right c-float-hang\"><div id=\"tFCoEl\"><div data-anthem-component=\"aside:10685643\"></div></div></div><p id=\"oCKEFj\">In addition to MVNO prepaid options, the big three carriers also offer their own prepaid plans. These plans don’t require credit checks, but you’re still getting your service and customer support directly from the network operator. There are data-capped and unlimited data options across the board, and if you’re willing to spend more, you can get premium features like HD streaming video and mobile hotspot data that not even all postpaid unlimited plans include.</p><p id=\"zjDshy\">Prepaid plans directly from the big carriers can also be nearly as expensive as postpaid. Depending on your situation, it may make sense to pay a little more per month for a postpaid plan or go with an MVNO for a better price. But they’re a decent option, especially if you’re looking for a single-line plan, have predictable data usage habits, and need to avoid the credit check on postpaid plans. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_eXRr4Xo7Emg-AFewkPhvPS7nUk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/11596517/akrales_180620_1777_0259.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>  </figure></div><h2 id=\"3gBzjR\">Best phone plans in 2022</h2><p id=\"SSIljM\"><em>Our plan recommendations take into account cost, features, and restrictions imposed on the carrier plans we evaluated. They should be considered along with network performance in your area.</em></p><h3 id=\"81QBe1\"><strong>Best basic unlimited plan: </strong><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.t-mobile.com%2Fcell-phone-plans%2Fessentials&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22606623%2Fbest-cell-phone-plans-verizon-att-t-mobile\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>T-Mobile Essentials</strong></a><br>$60 / month for one line (with autopay)</h3><p id=\"ei18fC\">At $60 per month for a single line, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.t-mobile.com%2Fcell-phone-plans%2Fessentials&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22606623%2Fbest-cell-phone-plans-verizon-att-t-mobile\" rel=\"sponsored nofollow noopener\" target=\"_blank\">T-Mobile’s Essentials</a> is the least expensive of the major carriers. Assuming T-Mobile coverage in your area is sufficient, it offers the best value for someone who just wants to stay connected and not worry about data overages. Plus, it includes 3G hotspot data and access to all flavors of T-Mobile’s already-strong 5G network. </p><p id=\"mi9lYS\">It’s always subject to data slowdowns when the network is busy, but so are the other carriers’ basic unlimited plans. T-Mobile may impose additional slowdowns for users who go over 50GB of data in a month, so if you’re a heavy data user, you may want to consider a more expensive unlimited plan. </p><p id=\"lnoIck\">T-Mobile offers <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.t-mobile.com%2Foffers%2Ffree-trial&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22606623%2Fbest-cell-phone-plans-verizon-att-t-mobile\" rel=\"sponsored nofollow noopener\" target=\"_blank\">a handy way to test-drive its network</a> on your own phone without switching from your current provider. It’s only available with certain iPhones right now, and you should be aware that you might experience faster speeds than you’ll actually get with data prioritization on the Essentials plan.</p><div id=\"BoeptR\"><div data-anthem-component=\"productcard:10682646\"></div><div id=\"EncFUu\"><div data-anthem-component=\"table:10682520\"></div></div></div><hr class=\"p-entry-hr\" id=\"5g314D\"><h3 id=\"ymV6yH\"><strong>Best premium unlimited plan: </strong><a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergePhonePlans08052021/https://www.verizon.com/plans/unlimited/\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Verizon 5G Play More</strong></a><br>$80 / month for a single line (with autopay)</h3><p id=\"dSigOl\">The major carriers offer two pricier “step-up” plans with the exception of Verizon — it offers three, but the middle two are essentially the same except for the mix of included services. For very heavy data users and those who want the highest possible streaming video quality, the top tier plans make the most sense, but for most people, one of the middle-of-the-road options is likely a better fit. <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergePhonePlans08052021/https://www.verizon.com/plans/unlimited/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Verizon’s 5G Play More Unlimited</a> (and nearly identical Do More) plan isn’t the cheapest option, but it strikes the best balance of cost versus features.</p><p id=\"Sj6Tfo\">You’ll get 720p HD video streaming typically, or even 4K streaming if you’re connected to the Ultra Wideband network (though this needs to be enabled in your Verizon account) along with a healthy 25GB of mobile hotspot data and a 50GB threshold of premium data before slowdowns can be imposed. Crucially, it includes access to Verizon’s Ultra Wideband (UW) 5G, which is becoming more important as C-band spectrum comes online. You get super-fast but hard to find mmWave 5G, too, which isn’t worth upgrading for, but it’s part of the UW bundle.</p><p id=\"GOY5Dj\">Finally, the included services are worthwhile. Play More includes access to Disney Plus, Hulu, and ESPN Plus, which is shared across all lines on the account. If you’re not interested in those streaming services, Do More includes 600GB of Verizon Cloud storage as an alternative, though, honestly, that sounds like a lot less fun than having nine seasons of <em>Letterkenny</em> included with your phone plan.</p><div id=\"h8N4bl\"><div data-anthem-component=\"productcard:10685853\"></div></div><h3 id=\"u7d2fg\"><strong>Best family plan: </strong><a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergePhonePlans08052021/https://www.verizon.com/plans/unlimited/\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Verizon 5G Play More</strong></a><br>$180 / month for four lines (with autopay)</h3><p id=\"YNWBrA\">Verizon’s Play More is also our top pick for families. Four standard lines will cost $45 each for a total of $180 per month, but parents with younger kids can mix and match the standard plan with <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergePhonePlans08052021/https://www.verizon.com/plans/unlimited/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Verizon’s Just Kids plans</a>, which are cheaper and offer parental control features. Just Kids lines come with a limit of up to 20 contacts for talk and text, and speeds capped at 5Mbps — good for a younger kid whose phone use you want to keep closer tabs on but not well-suited for older kids.</p><p id=\"ZGmyt7\">At least one unlimited plan line is required to add Just Kids lines, which are $35 each for an account with four lines, making a plan with two Play More lines and two Just Kids lines $160 per month. And Disney Plus included with the price of the plan doesn’t hurt, either.</p><div id=\"Tn0aVJ\"><div data-anthem-component=\"table:10682526\"></div></div><hr class=\"p-entry-hr\" id=\"GtZ2fZ\"><h3 id=\"KrlGCb\"><strong>Best postpaid shared data plan: </strong><a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergePhonePlans08052021/https://www.verizon.com/plans/shared-data/\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Verizon Shared Data Plan — 10GB</strong></a><br>$65 / month</h3><p id=\"KapvP3\">We think <a href=\"https://www.anrdoezrs.net/links/Verge/type/dlg/sid/VergePhonePlans08052021/https://www.verizon.com/plans/shared-data/\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Verizon’s $65 per month 10GB plan</a> provides the best bang for your shared-data buck compared to its 5GB plan and AT&amp;T’s 4GB plan (T-Mobile doesn’t offer postpaid shared data plans). However, if you buy a phone from Verizon on a two-year contract, that monthly price goes up. </p><p id=\"OFCXUf\">The 10GB plan typically costs $40 per month for account access and an additional $25 per month per line (with autopay), adding up to $65 per month for a plan with a single line. If you’re on a two-year device contract, that $25 fee per line per month goes up to $40 — with or without autopay enabled — so you’ll pay $80 per month for a single line plus the cost of the phone itself, which varies depending on the model. If you prefer buying your phone through your carrier on a two-year plan, then an unlimited plan may make more sense.</p><p id=\"wBAB6t\">Otherwise, the 10GB plan is about the same price as the company’s basic unlimited plan but comes with the ability to stream video at 720p (once enabled for your account) and use your data via a mobile hotspot. You can also carry unused data over to the next billing cycle, and use your data on other non-phone connected devices like a tablet for an extra $10 per month per device; unlimited requires a separate device plan starting at $10 per month for a smartwatch or $20 for a tablet. </p><div id=\"b8q5vP\"><div data-anthem-component=\"productcard:10685884\"></div></div><div id=\"Jgd2CY\"><div data-anthem-component=\"table:10682529\"></div></div><hr class=\"p-entry-hr\" id=\"oVlryv\"><h3 id=\"6KFJ2Z\"><strong>Best cheap phone plan (by the gig): </strong><a href=\"https://fi.google.com/about/plans/\"><strong>Google Fi Flexible</strong></a><br>Starting at $30 / month for a single line</h3><p id=\"T7sKQo\">Our pick for the best cheap data-capped phone plan is <a href=\"https://fi.google.com/about/plans/\">Google Fi Flexible</a>, which costs between $30 and $80 per month. It isn’t the least expensive, and it’s certainly not the one with the easiest pricing structure to comprehend. But it does live up to its “Flexible” name and offers some inclusions that cost extra on other plans, like mobile hotspot data and additional SIMs for non-phone devices.</p><p id=\"K4jQDm\">Here’s how it works: on the Flexible plan, you prepay a set access fee per line at the start of every month, depending on the number of lines on your account. (It’s $20 for one line.) At the end of that, you pay $10 for every 1GB of data used during the month, up to a set maximum amount determined by, again, the number of lines on your plan. That’s 6GB on a single-line plan, so your plan will cost at most $80 per month. </p><p id=\"K9wbPA\">You can keep using data beyond that limit, but you won’t be charged more, and you won’t experience drastic slowdowns until you reach 15GB. At that point, you’ll be dropped down to 2G speeds for the rest of the month unless you add more data at $10 / GB. Again — not the cheapest plan by any means — but if you can get by most months on 2 or 3GB of data, your $40 or $50 bill will look pretty good compared to most alternatives.</p><p id=\"zugdMm\">It’s a little bit more complicated than your typical phone plan, but it means you’re only paying for the data you use in a month — with a lot of flexibility built in if you need to use a little or a lot more data than usual in a typical billing cycle. And it includes a somewhat rare feature: the option to add data-only SIMs at no extra charge so you can use your plan across other devices like tablets and smartwatches. </p><div id=\"U9Psqx\"><div data-anthem-component=\"productcard:10685910\"></div></div><div id=\"GWgECJ\"><div data-anthem-component=\"table:10682574\"></div></div><hr class=\"p-entry-hr\" id=\"jsQiQH\"><h3 id=\"Fhbd29\"><strong>Best cheap unlimited phone plan: </strong><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.mintmobile.com%2Fproduct%2F12-month-unlimited-sim-card-plan%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22606623%2Fbest-cell-phone-plans-verizon-att-t-mobile\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><strong>Mint Mobile 12-month Unlimited Plan</strong></a><br>$30 / month (pre-pay $360)</h3><p id=\"BXc1NS\">Going by raw numbers alone, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.mintmobile.com%2Fproduct%2F12-month-unlimited-sim-card-plan%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22606623%2Fbest-cell-phone-plans-verizon-att-t-mobile\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Mint Mobile’s $30-per-month unlimited plan</a> stands out with easily the lowest monthly cost for unlimited data. However, to get that price you’ll need to prepay for 12 months of service for a sizable $360 upfront cost. New customers can try the service for three months at that $30 rate. But after that, you’ll need to renew for the full year or pay a little more for a six-month plan ($35 per month for an upfront cost of $210). </p><p id=\"sh5oxm\">If paying up front is doable for you, then you’ll get one of the best deals in wireless. The plan includes 5G, comes with 5GB of mobile hotspot data per month. An important note: if you exceed 35GB in a month you’ll see <em>very</em> slow 2G speeds until the start of the next month. That’s much slower than typical deprioritization, so <a href=\"https://www.theverge.com/2021/12/21/22848536/mint-mobile-prepaid-unlimited-ad\">Mint’s use of the word “unlimited” is a little misleading</a>.</p><p id=\"tlENcl\">If you want an unlimited plan that’s more unlimited, or paying for six or 12 months of service up front isn’t the best option for you, then we think <a href=\"https://visible.pxf.io/c/482924/1068329/12909?subId1=VergePhonePlans08052021&amp;u=https%3A%2F%2Fwww.visible.com%2Fplan%2F\">Visible’s $40 per month standard plan</a> is the next best option. Visible runs on Verizon’s network (and is, in fact, owned by Verizon) and includes mobile hotspot usage — <em>not</em> a feature of Verizon’s own basic unlimited plan — capped at 5Mbps. That’s a bit slower than 4G, so you won’t want to rely on it as a primary connection for your laptop, but it’s good enough for basic internet browsing and email. </p><p id=\"OxZkPP\">Of course, Visible customers are more likely to see their speeds slow down compared to Verizon’s own subscribers when the network gets busy, so there is some benefit to signing up directly with the network. But it’s a significant step up from $40 per month to the $70-per-month Verizon Start Unlimited plan in order to guarantee faster network speeds at all times.</p><div id=\"SpJLD3\"><div data-anthem-component=\"productcard:10685972\"></div></div><div id=\"j797LN\"><div data-anthem-component=\"table:10682576\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/LBrg7-MVBSRJ4bULBjGaXCf7DLY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19743257/awhite_200223_3916_0446.jpg",
  "description": "Phone plan shopping survival tips — and our top picks.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}