{
  "title": "The Witcher 3 is a whole new experience in first person",
  "url": "https://www.theverge.com/2022/4/6/23010362/witcher-3-first-person-mod",
  "date": "2022-04-06T14:30:00.000Z",
  "author": "Cian Maher",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ipzHMBgHmb1xaftJ282yDoAZmFo=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70716710/Screenshot__1237_.0.png\" />    </figure>  <p>Delving into a game-changing mod for CD Projekt Red’s role-playing epic</p> <p class=\"p--has-dropcap\" id=\"KujP1D\">As one of the most unanimously beloved video games of all time, it’s difficult to imagine <a href=\"https://www.theverge.com/2015/5/12/8586515/witcher-3-wild-hunt-review-ps4-xbox-one-game\"><em>The Witcher 3</em></a><em> </em>as anything other than what it emphatically is: a sprawling, gorgeous, third-person RPG spearheaded by a gruff old man who’s best pals with his horse. Geralt also likes collecting cards and betting on races, both of which are hobbies he practices while he’s supposed to be looking for his missing daughter. That’s not to mention his fondness for fisticuffs.</p><p id=\"iSAPpE\">Aside from all of the above, part of what has made CD Projekt Red’s behemoth role-playing game so enduring is how reliably fans can recall its stinky swamps, snow-laden sierras, and repugnant little rotfiends, all of which we’ve come to know through a third-person lens. But ever since 2016, fan-made first-person mods for <em>The Witcher 3 </em>have existed — though they’ve never been on par with official support for the game and have since been hidden on Nexus, the internet’s largest modding hub. For the most part, these projects have felt like proof-of-concept experiments far more so than actionable add-ons designed to change flow, pacing, or functionality in the game. </p><p id=\"jNnI61\">That was until <a href=\"https://www.nexusmods.com/witcher3/mods/5706\">Gervant First Person</a>, a 2021 mod that blows all previous attempts at converting <em>The Witcher 3 </em>into a first-person RPG out of the water. While it’s technically almost a year old, its main file was updated just last month, evidence of its continuous progress as it attempts to reimagine not just general exploration or perspective but cutscenes, combat, and everything in between.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kjg9y4dHZ_8TMX_UFbKvLX67fHE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366981/Screenshot__1237_.png\">  </figure></div><p id=\"iSw1yz\">“I just wanted to fight some nekkers in first person and didn’t find a suitable mod for that,” crthdr, the mod’s enigmatic creator, tells <em>The Verge</em>. “First person isn’t ‘better,’ but that’s how I prefer to play computer games.” Crthdr spent around a year developing the mod with tools like Witcher Script Studio, Ghidra, and Rust, among others. They then tested it by partially playing through the game four separate times to ensure it worked consistently. “Good thing I also made the Skip Dialogue mod,” crthdr says. </p><p id=\"JmSxbu\">Crthdr’s blasé response is indicative of a wider disregard for how their work is perceived by others. They don’t have much of a social media footprint — they’re not on Facebook, Twitter, or Instagram, and their YouTube channel doesn’t include any contact information. When I reached out to ask for an interview, they explained that they would discuss the mod and nothing else, and given that English is not their first language, their answers would be short and to the point. In their eyes, the mod was never designed so they could talk about it — it was designed so they and others like them could see through Geralt’s eyes instead of over his shoulder.</p><div class=\"c-float-right c-float-hang\"><aside id=\"E9WHXN\"><q>“First person isn’t ‘better,’ but that’s how I prefer to play computer games.”</q></aside></div><p id=\"F3CfxV\">And so it became apparent that to properly engage with this mod, I’d need to install it myself. If you’re already acquainted with <em>The Witcher 3’s </em>modding scene, installation should be a breeze. The only mods necessary for running Gervant First Person are <a href=\"https://www.nexusmods.com/witcher3/mods/3652\">Community Patch - Base</a> and <a href=\"https://www.nexusmods.com/witcher3/mods/2110\">Community Patch - Shared Imports</a>, both of which are fairly standard for any mods designed for versions 1.31 or 1.32 (it’s worth noting that these versions are essentially the same, given that the latter just adds support for Simplified Chinese). Manual installation can be a pain, but launching it via <a href=\"https://www.nexusmods.com/witcher3/mods/2678\">The Witcher 3 Mod Manager</a> automatically merges all of the necessary scripts. Provided you’re not messing around with dozens of other mods, you can get GFP up and running pretty painlessly.</p><p id=\"UZNMxt\">Once you get started, you’ll notice the mod supports both first- and third-person perspectives, allowing you to easily flit between the two after selecting a custom key binding for flipping the camera. The third-person option is exactly the same as it is in the vanilla version, but changing to a first-person view instigates radical change, converting the experience into something that feels like a bona fide <a href=\"https://www.theverge.com/2021/11/15/22783314/elder-scrolls-6-xbox-exclusive-pc-phil-spencer\"><em>Elder Scrolls</em></a><em> </em>adventure. If you’ve ever wondered what <em>The Witcher 3: Wild Skyrim </em>would look like, this is the mod for you.</p><p id=\"w3mBnb\">The transition between perspectives isn’t exactly seamless, and it’s often obvious that the world was never designed to facilitate first-person play. For example, characters who should be off-screen occasionally teleport around cutscenes, while issues with lighting become significantly more prominent once the camera is fully unlocked. Similar problems arise in combat, which is initially unintuitive but eventually grows on you, especially if you’re playing with a gamepad instead of a mouse and keyboard. While dodging can be tough, combining swords and signs feels great in the first person — there’s a real weight to your witchering that makes it slightly more tangible. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/P-jMbp09XFzBiieqaGCGYvfwMhI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366987/Screenshot__1219_.png\">  </figure></div><p id=\"qSQxQY\">While there are obviously many minor complications that arise from playing a blockbuster game in a way it was never intended to be played, the fact that a single person made this mod is remarkable and presents the strongest case yet for a first-person <em>Witcher </em>game. Sure, <a href=\"https://www.theverge.com/22157995/cyberpunk-2077-cd-projekt-red-review-xbox-ps4-ps5-pc-stadia\"><em>Cyberpunk 2077</em></a><em> </em>is an FPS built using REDEngine, the same engine that powers <em>The Witcher 3</em>. But GFP allows you to explore Velen, Novigrad, and Skellige in first person to your heart’s content. It’s definitely janky, but what else could you expect from a solo developer who built this in his spare time, for free, just so he could beat up a bunch of nekkers? Not everything needs to be polished to be a worthwhile experiment. </p><p id=\"tLg6T5\">Issues be damned, there are some aspects of GFP that actively improve on <em>The Witcher 3</em>. It’s no exaggeration to suggest that this is one of the most gorgeous game worlds to have ever existed, so having the ability to disable various HUD widgets and explore its stunning sets in first person gives you the perfect opportunity to really drink in the splendor of it all — as a <em>Witcher </em>photography simulator, GFP is unmatched. It also highlights some of the mostly hidden functions that subtly texture the world of <em>The Witcher 3</em>: you can closely study supply lines, patrol routes, and wolves forming packs to close in on a carcass. It’s clear that this world wasn’t designed with first person in mind, but its ability to incorporate it nonetheless is a real testament to how magnificent it is.</p><div class=\"c-float-left c-float-hang\"><aside id=\"j9krEz\"><q>The world feels fundamentally different in first person</q></aside></div><p id=\"Rhty28\">In the interest of providing clear context, it’s worth noting that, at the time of writing, I have slain the griffin in White Orchard and cleared several side quests like “A Frying Pan, Spick and Span” and “On Death’s Bed.” The introductory sequence in Kaer Morhen is bugged as a result of the tutorial prompts interfering with first-person actions, which means it’s highly advised to complete it in third person. But as soon as you wake up next to Vesemir, you gain unrestricted access to a full-fledged version of <em>The Witcher 3 </em>as a first-person adventure game. </p><p id=\"6lOQSi\">Perhaps one of the weightiest arguments for why seasoned witchers should give this mod a whirl is that it is extremely easy to get lost. The world feels fundamentally different in first person — it looks more dense, for one thing, but it also enjoys immense draw distance, creating a massive atmosphere where towns and towers can be seen from miles away. This scale can be further compounded by turning the HUD off, transforming places like Velen and Skellige into whole new areas that retain all the warmth and familiarity of the originals. It’s obviously not as professionally designed as the actual game’s third-person view — but that’s not what’s important here. GFP makes a compelling case for why implementing the kind of first-person / third-person hybridity you might expect to find in a Bethesda RPG into <em>The Witcher </em>could work; it’s probably the first project of its kind to attempt that and emerge successful. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NpxYXQ_k_xdilnNFhtPVpJ5udb0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23366993/Screenshot__1222_.png\">  </figure></div><p id=\"Yu5dPj\">There are multiple clear examples of this too, which indicate both CDPR’s attention to detail and crthdr’s vision when it comes to converting that to first person. For example, when you swim, you’ll notice that Geralt pops his head up to inhale every two or three strokes. Witcher senses feel more palpable in first person, too, particularly when you’re following tracks or scent trails. It simply does not matter whether this mod feels polished or janky. (For the record, it oscillates between the two). The important thing here is that it accentuates how refined this world is while simultaneously acting as an unofficial prototype for how a future, better one might look. </p><p id=\"xQzMLA\">Despite all of this, crthdr is far too modest to admit how radical the project is. “The mod is made for <em>Witcher 3</em> fans who like first-person games,” they explain. “Those guys like the mod. The rest don’t care. Technically, of course CDPR could have done it better and faster. It just wasn’t on their to-do list at all. Most people don’t care about first-person, and doing hybrid first person / third person is probably considered too much work. I personally prefer first person.”</p><p id=\"z4IUB0\">While crthdr themselves might reckon their work is no big deal, anyone who engages with GFP will likely come away thinking the exact opposite. This is the kind of unofficial project that’s sufficiently well-considered to prompt real introspection within actual official ones. </p><p class=\"c-end-para\" id=\"XQWEgu\"><em>The Witcher 3’s </em>upcoming new-gen patch provides a more-than-worthy reason for avid monster slayers to return to The Continent — but if you want a completely different experience in this world, you should make a point to check out GFP, too.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ku77AFTOPwFkVUJSc7AHu99YcKE=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23366981/Screenshot__1237_.png",
  "description": "A new look for Geralt",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}