{
  "title": "The Steam Deck finally has Windows audio drivers",
  "url": "https://www.theverge.com/2022/5/13/23071454/steam-deck-windows-audio-drivers-speakers-headphone-jack",
  "date": "2022-05-13T20:22:10.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/oKB-E23605B1VpgOK9pAPZtQqac=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70867116/vpavic_220210_5030_0094.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"0PwcDf\">Two and a half months after <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">our Steam Deck review</a>, Valve has finally provided the drivers you’ll need for audio if you choose to install Windows on the gaming portable. Before today, you would have had to pair Bluetooth headphones or plug in USB-C earbuds or a dongle to get any kind of audio on Windows at all. Both the speakers and 3.5mm jack did nothing on Windows before today, and it blamed AMD for the delay.</p><p id=\"MOqkNq\">But now, <a href=\"https://help.steampowered.com/en/faqs/view/6121-ECCD-D643-BAA8\">this pair of new drivers</a> should enable both of the missing audio features. It took a while for AMD and Valve to bring out <a href=\"https://www.theverge.com/2022/3/10/22971108/valve-steam-deck-windows-runs-drivers-no-support\">the initial set of graphics, Wi-Fi, Bluetooth, and SD card drivers for Windows</a>, too.</p><p id=\"yshG99\">Is it time to install Windows on your Deck? Nope, I definitely wouldn’t say that. While Valve keeps squashing bugs and <a href=\"https://www.theverge.com/2022/5/11/23067870/steam-deck-update-per-game-performance-profiles\">adding neat features</a> on the Linux side of things, Windows was even more of a mess to start, and Valve’s been clear you’re largely on your own if you go that direction. I had all sorts of issues with Windows 10 some weeks back — and while the Deck now has proper TPM support in the BIOS so you can install Windows 11, I can’t tell you if it’d be any better.</p><div class=\"c-float-right\"><div id=\"Wrns7a\"><div data-anthem-component=\"aside:11166775\"></div></div></div><p id=\"QR3zrF\">Personally, I would wait for Valve’s upcoming dual-boot wizard so you can add Windows without wiping the Steam Deck’s existing SteamOS installation first. (You can simply swap out the M.2 NVMe drive instead and keep the two OS separate that way, but be careful.)</p><p id=\"3eHTO1\">For me, the bigger deal is that Windows simply doesn’t have the same console-like trappings that make the Deck so good to begin with, <a href=\"https://www.theverge.com/2022/5/11/23067870/steam-deck-update-per-game-performance-profiles\">particularly how</a> you can get an instant window into your performance and battery life and fine-tune all of that on the fly. </p><p id=\"StEreu\">If you want Windows, I’d probably look into <a href=\"https://www.theverge.com/22972334/aya-neo-next-review-vs-steam-deck-windows\">a dedicated Windows portable instead,</a> particularly once rivals react to the Deck with more powerful chips and / or lower prices.</p><p id=\"Bo6rOz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/cuIoiisGpMcaxOeGvLz_XjE_3mI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270014/vpavic_220210_5030_0094.jpg",
  "description": "Not that we’d recommend Windows yet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}