{
  "title": "The Pentagon has 400 reports of strange aerial phenomena — but nothing suggests aliens",
  "url": "https://www.theverge.com/2022/5/17/23093622/house-hearing-ufo-unidentified-aeria-phenomenon-uap-task-force",
  "date": "2022-05-17T16:09:50.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"UFO Hearing\" src=\"https://cdn.vox-cdn.com/thumbor/KdWiYHI3BJIrh4UdDVqpNs5uBtw=/0x0:7684x5123/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70879019/1240725438.0.jpg\" />        <figcaption>Bill Clark/CQ-Roll Call, Inc via Getty Images</figcaption>    </figure>  <p id=\"xuPjEY\">The Pentagon’s new task force for tracking unidentified aerial phenomena (or UAPs) has collected roughly 400 reports, an official told Congress in an open hearing on Tuesday. </p><p id=\"2RY52p\">The comments came from Scott Bray, the deputy director of US naval intelligence, who testified today as an expert witness in a hearing about UAPs hosted by a subcommittee of the House Intelligence Committee. The hearing marked the first time Congress has held a public hearing on UAPs, also known as UFOs, in more than 50 years.</p><p id=\"UsLhnG\">Bray attributed the increase in sightings to a number of factors, including the growing popularity of quadcopters and drones, updates in sensor technologies, increasing aerial clutter like mylar balloons, and a perceived decrease in stigma surrounding reporting. While many of the sightings remain unexplained, there’s been no evidence suggesting supernatural or extraterrestrial involvement, Bray explained.</p><div class=\"c-float-right\"><aside id=\"hqjeZg\"><q>“We have detected no emanations within the UAP Task Force that would suggest it’s anything non-terrestrial in origin.”</q></aside></div><p id=\"9hrsss\">“When it comes to material that we have, we have no material — we have detected no emanations within the UAP Task Force that would suggest it’s anything non-terrestrial in origin,” Bray said. “When I say unexplained, I mean everything from too little data to... the data that we have doesn’t point us towards an explanation.”</p><p id=\"K1Nay2\">Today’s hearing is just the latest chapter in a recent saga that has renewed interest in UAP sightings. The latest round of concern began in 2017, when the <a href=\"https://www.nytimes.com/2017/12/16/us/politics/pentagon-program-ufo-harry-reid.html\"><em>New York Times</em> published a report</a> about a classified Pentagon program called the Advanced Aerospace Threat Identification Program (AATIP), <a href=\"https://www.theverge.com/22550116/uap-ufo-pentagon-report-aliens\">purportedly aimed at investigating UAPs</a>. The story ultimately <a href=\"https://www.defense.gov/News/Releases/Release/Article/2314065/establishment-of-unidentified-aerial-phenomena-task-force/\">culminated with the creation of the UAP Task Force</a> within the Department of the Navy in 2020, which continues to investigate the sightings. Today’s hearing served as a check-in on that task force from various representatives who have taken an interest in the topic.</p><p id=\"XFbB8I\">“UAPs are unexplained; it’s true,” Rep. Andre Carson (D-IN), chair of the House Intelligence Counterterrorism, Counterintelligence and Counterproliferation Subcommittee, said in opening remarks. “But they are real. They need to be investigated, and many threats they pose need to be mitigated.” </p><p id=\"0wvVys\">To illustrate what the UAP Task Force has in its stores, Bray showed two different videos of reported sightings which have already circulated online and in the media. One involved a video taken from the cockpit of a Navy aircraft, showing a small reflective spherical object zooming by the window. It was an incredibly short video, lasting just a few seconds, meant to illustrate how little evidence the task force can get for sightings sometimes. “In many cases, that’s all that a report may include, Bray said. “And in many other cases, we have far less than this.”</p><div class=\"c-float-left\"><aside id=\"swbCj1\"><q>“They need to be investigated, and many threats they pose need to be mitigated.” </q></aside></div><p id=\"urk7qs\">Bray showed another video that showcased what appeared to be a blinking triangle moving through the sky, observed through night vision goggles. He noted that the explanation for the video stumped officials for years. But then other Navy officials record a similar image years later, while also observing drones nearby. Now, the UAP Task Force is certain that the original video contained a drone, as well. </p><p id=\"QKNyhu\">“We’re now reasonably confident that these triangles correlate to the unmanned aerial systems in the area,” Bray said. “The triangular appearance is a result of light passing through the night vision goggles and then being recorded by an SLR camera.”</p><p id=\"7H6RDn\">The open session was followed by a closed session, in which officials shared classified information with Congress.</p><p id=\"MnTZKc\">Last year, the <a href=\"https://www.theverge.com/22550116/uap-ufo-pentagon-report-aliens\">Pentagon released a detailed report on UAP sightings</a> that listed five possible explanations for UAPs, which included things like airborne clutter, natural phenomena in the atmosphere, top-secret US technology, or technology from foreign adversaries like Russia and China. The report also included a fifth explanation — “other” — which encompasses everything they can’t explain. Those are the ones that continue to capture the imagination of the public. And while Bray emphasized that the UAP Task Force hasn’t seen any wreckage that is “inconsistent with being of terrestrial origin,” they are focused on explaining the unexplainable.</p><p id=\"cat1I1\">“There are a number of events in which we do not have an explanation and there are a small handful in which there are flight characteristics or signature management that we can’t explain with the data that we have,” Bray said. “Those are obviously the ones that are of most interest to us.”</p><p id=\"3AjuPN\"></p><p id=\"UbYH18\"></p><p id=\"TrXwPy\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bN0FomQM_mZo6onc7uMC9YtDwNw=/0x551:7684x4574/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23516314/1240725438.jpg",
  "description": "The explanations range from airborne clutter to \"other\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}