{
  "title": "The playful Playdate gets serious as a personal organizer",
  "url": "https://www.theverge.com/23068657/playdate-pocket-planner-app-hands-on-personal-organizer",
  "date": "2022-05-13T14:30:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/EV7y4FSZ0lQsc01oHnv0xAri5_U=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70865217/vpavic_220415_5149_0055.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"DR8koF\">One of the best things about the Playdate, <a href=\"https://www.theverge.com/23025390/playdate-handheld-portable-gaming-console-review\">Panic’s quirky gaming handheld</a>, is how it only really does one very specific thing: play video games. It’s not bogged down by other apps or features, so when you’re playing something like <em>Crankin’s Time Travel Adventure</em>, it’s easy to stay focused on the game. It’s refreshing to have a device so single-mindedly focused on fun — which is why I found the idea of using the little yellow console as a personal organizer so intriguing. For the past week, I’ve been doing just that, and while it’s definitely not an option for everyone, much like the Playdate itself, it manages to be both simple and straightforward.</p><p id=\"fJT54Z\">First, a few notes for context. One, it’s important to know that I have yet to find a to-do list app I prefer over a paper notebook. I spent a good while testing out the likes of Evernote and Fantastical — once upon a time I used the RPG app <a href=\"http://www.rexbox.co.uk/epicwin/\">Epic Win</a> to track things — but they were always too fiddly to bother with. For the last few years, my process has been simple: near the end of each work day, I write down everything I have to do the next day so it’s ready for me when I log on in the morning. It’s basic and fast, and the act of writing things down has a tendency to help me remember them.</p><p id=\"DLw2nP\">The second thing is that the app I’ve been using, called <a href=\"https://hydra-softworks.itch.io/pocket-planner\">Pocket Planner</a>, is still in a fairly early beta state. It has three main features: a to-do list, a calendar, and voice memos. In its present state, you can’t add events to the calendar, and voice memos haven’t been implemented yet. (Both features are expected in a future update.) So, for the time being, I’ve only been using the to-do list tool.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Pocket Planner\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/9-n5-sG6GxacUZDU6DfcLhA2WBo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23456094/oIdRir.png\">  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"Pocket Planner\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C45u3FrqArgyLFhOEnBpT7F5TZI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23456104/mMIt_u.png\">  </figure></div></div></div><p id=\"3x7oAg\">Now, the Playdate may be a dedicated gaming machine, but its screen, despite its small size, is actually great for this kind of thing. The low-fi, black-and-white display (which has no backlight) is reminiscent of a Kindle, which itself is meant to replicate the experience of reading on paper. So the Playdate is great for paper-like experiences. That’s part of the reason <a href=\"https://www.theverge.com/2022/4/26/23042607/playdate-best-games-sideloading\">why I’ve enjoyed so many puzzle games on the handheld</a> and why I’m dying for someone to make a sudoku app for it. And it works well for replicating the vibe of a classic physical organizer.</p><p id=\"Nfi482\">The to-do portion of the app is exceedingly straightforward. You can make a number of different lists and add multiple items to each, all of which have a little checkbox beside them. Items can be renamed, deleted, or moved between lists. And really, that’s about it. For my purposes, I made five lists, one for each day of the week, and — much like in my paper notebook — at the end of each day I add items to accomplish the next day. Finished items are deleted, and anything I don’t finish I simply move to the next day.</p><div class=\"c-float-right\"><aside id=\"7yZYtX\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Playdate review: all it’s cranked up to be\",\"url\":\"https://www.theverge.com/23025390/playdate-handheld-portable-gaming-console-review\"},{\"title\":\"Panic isn’t sure if people will like the Playdate’s seasonal model\",\"url\":\"https://www.theverge.com/2022/4/26/23041825/panic-playdate-season-one-two-release-model\"},{\"title\":\"Here are some great games to sideload onto your Playdate\",\"url\":\"https://www.theverge.com/2022/4/26/23042607/playdate-best-games-sideloading\"}]}'></div></aside></div><p id=\"pSmfIj\">It has worked well enough, and using the Playdate has a few nice bonuses — namely that it’s incredibly tiny and comfortable to carry around. I put it in my pocket and almost forget about it. It’s also a very clean process of checking off items or shifting them around for different days. Another bonus: constantly having my Playdate around for work meant I remembered to water my virtual flowers in the Playdate game <em>Bloom</em> more often. The downside is speed. One of the things I love about a physical notebook is how quick it is to just jot down what’s on your mind. But typing on a Playdate, which involves picking letters from a carousel, is a much, much slower process. I’ve been using <em>a lot</em> of abbreviations to speed things up.</p><p id=\"BCBVvc\">It should be pretty obvious by now that the Playdate won’t be an organization solution for everyone. It has a barebones list of features and doesn’t connect to other tools, like a personal Google calendar. But if you’re looking for something dead simple — like I am — it’s a pretty good substitute, particularly given that it costs $1 right now. I wouldn’t recommend buying a Playdate with grand plans of turning it into a modern PalmPilot. But if you managed to get your hands on one and have very straightforward needs for staying on top of your to-do list, it’s a solid option. Your <em>Bloom</em> flowers will probably thank you.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/dw9OniE2ufji1Q4i3F_p2tSfvRM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23396644/vpavic_220415_5149_0055.jpg",
  "description": "Keep it simple.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}