{
  "title": "The Google One VPN is now available on iPhones",
  "url": "https://www.theverge.com/2022/2/1/22912595/google-one-vpn-ios-iphone-new-features-safe-disconnect",
  "date": "2022-02-01T18:51:22.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/g1NQxrESisABbFp9lqugheCvwJk=/0x63:1718x1208/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70458593/Screen_Shot_2022_02_01_at_09.11.40.0.png\" />        <figcaption><em>Google’s VPN is available for Premium subscribers.</em> | Image: Google</figcaption>    </figure>  <p id=\"5jhpiW\">The VPN service that’s included with a Google One Premium subscription is <a href=\"https://blog.google/products/google-one/vpn-by-google-one-ios/\">finally available on iPhones</a> after <a href=\"https://www.theverge.com/2020/10/29/21541032/google-one-vpn-cloud-storage-subscription\">Google’s promise in October 2020</a> that it would come to iOS. While a Google-run VPN has been available on the platform for months <a href=\"https://www.theverge.com/2021/6/25/22550048/google-fi-vpn-iphone-subscribers\">via the Google Fi cell service</a>, today’s update means that anyone who <a href=\"https://www.theverge.com/2021/9/11/22668790/google-one-adds-5tb-storage-plan-photos\">pays for 2TB or more</a> of Google One storage should now also get a VPN for their phone.</p><p id=\"S9hDOw\">The VPN is <a href=\"https://support.google.com/googleone/answer/7582172\">available to people in 18 countries</a>, including the US, UK, Canada, and Mexico. iPhone users may be familiar with the idea of an upgraded storage plan that also comes with a way to keep your IP and internet traffic private — Apple includes <a href=\"https://www.theverge.com/22573519/apple-private-relay-icloud-plus-ios-15-ipados-macos-monterey-how-to\">its Private Relay service</a> in all of its paid iCloud plans.</p><div class=\"c-float-right\"><aside id=\"vsn3fa\"><q>Google’s VPN doesn’t let Americans watch British Netflix</q></aside></div><p id=\"N4eEdi\">For iPhone owners who are more into Google’s services than Apple’s, though, a VPN is a nice addition. The service does have one main caveat — you won’t be able to get an IP address in another country, potentially unlocking different shows on streaming services. While there are other VPN services that use this feature as one of their main selling points, it’s not something you get with Google or Apple’s offerings.</p><p id=\"w4ibB6\">Google also mentions some features it’s added to the VPN for Android users <a href=\"https://blog.google/products/google-one/vpn-by-google-one-ios/\">in its blog post</a>, including a “safe disconnect” feature that shuts off internet access if you’re disconnected from the VPN (which should make sure that your data doesn’t end up going somewhere unexpected). It also mentions that you can set certain apps to bypass the VPN if you’re using it on Android.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/d8e5H430cv8FoDLTo0ItWl2zb8o=/0x186:1718x1085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23210112/Screen_Shot_2022_02_01_at_09.11.40.png",
  "description": "For people who pay for 2TB or more of Google One storage",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}