{
  "title": "The New York Times runs Wordle now, and stats are getting m-e-s-s-y",
  "url": "https://www.theverge.com/2022/2/10/22927898/wordle-new-york-times-version-website-statistics-cookies",
  "date": "2022-02-10T21:38:45.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kGTWJqD5NVs0Ckd8KgazaMjyBqQ=/236x0:1403x778/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70495005/Screen_Shot_2022_02_10_at_13.01.14.0.png\" />    </figure>  <p id=\"rU5nC4\">Wordle, the <a href=\"https://www.theverge.com/22892044/wordle-free-game-online-how-to-puzzle\">extremely popular online puzzle</a>, is now officially being run by <em>The New York Times</em> after its creator sold it <a href=\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\">a few weeks ago</a>. It lives at a new URL, <a href=\"https://www.nytimes.com/games/wordle/index.html\">https://www.nytimes.com/games/wordle/index.html</a>, but before you head there for your daily game, you should know that there’s currently issues with how player statistics (including streaks, win percentages, and guess distribution) are being transferred from the old version to the new.</p><p id=\"tH0yHh\">Here’s what <a href=\"https://help.nytimes.com/hc/en-us/articles/360029050872-Word-Games-and-Logic-Puzzles#h_01FVGCB2Z00ZQMDMCYWBPWJNXB\">an FAQ page from <em>The Times</em></a> says about how the stats transfer should work:</p><blockquote><p id=\"vRhON8\"><strong>How can I transfer my game statistics to the new Wordle site?</strong></p><p id=\"lNuaLg\">We have automatically transferred your game statistics (including streaks) to Wordle’s new home on New York Times Games. Nothing to do on your end.</p><p id=\"huoM5U\"><strong>Help! My game statistics or streaks did not migrate correctly.</strong></p><p id=\"2RV1O1\">We have automatically transferred your game statistics to Wordle’s new home on New York Times Games. If your data looks a little different than you remember, first ensure you are opening the game on the same device and browser you used previously. Your game data is stored locally on your browser and your statistics will automatically transfer without any additional action on your part.</p></blockquote><p id=\"gZmXRX\">For quite a few <em>Verge</em> writers, this hasn’t been the case. Some have clicked on the stats button to see a completely clean slate, with no streak or stats. One can see how many games they’ve played and their win percentage, but their streak seems to have been reset. And one of our lucky staff members experienced a peaceful transition of power, getting to keep their streak and stats.</p><p id=\"FXgAxE\"><a href=\"https://twitter.com/NYTimesWordplay/status/1491886073336803338\">In a tweet</a>, the <em>Times</em> said it was aware of the streaks being reset, and that it’s investigating.</p><div id=\"nBRxVB\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hi Wordlers! We are aware that your \"current streak\" has been reset today. Our Games team is currently investigating. Stay tuned for more <a href=\"https://twitter.com/hashtag/Wordle?src=hash&amp;ref_src=twsrc%5Etfw\">#Wordle</a> updates.</p>— NYTimes Wordplay (@NYTimesWordplay) <a href=\"https://twitter.com/NYTimesWordplay/status/1491886073336803338?ref_src=twsrc%5Etfw\">February 10, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"PWlp3g\">The writer that kept their stats seemed to skirt these issues when they went to the old URL (<a href=\"http://www.powerlanguage.co.uk/wordle/\">www.powerlanguage.co.uk/wordle/</a>) and got redirected to the <em>Times</em>’ version. That doesn’t seem to be a sure-fire tactic, though, as one of our writers doesn’t even get redirected at this point and is still able to access the original game (and her stats). </p><aside id=\"0ATpji\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to play Wordle\",\"url\":\"https://www.theverge.com/22892044/wordle-free-game-online-how-to-puzzle\"},{\"title\":\"Wordle has been bought by The New York Times, will ‘initially’ remain free for everyone to play\",\"url\":\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\"}]}'></div></aside><p id=\"Tb70ob\">Again, this isn’t how it’s supposed to work — <em>The Times</em> says everything should just come over. The outlet didn’t immediately respond to a request for comment from <em>The Verge</em>, where we asked if there was any way to make sure that you kept your stats. An assistant managing editor for the paper tweeted out a link to the new URL but has since taken it down — so it may be a good idea to just hold off on your daily game for a bit until things are sorted out (unless, of course, you <a href=\"https://www.theverge.com/2022/2/1/22912711/wordle-web-save-download-webpage-local-personal\">saved your own offline version</a> of the original game).</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5TlRzOkrT2YVycCl4alAYdl365o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23233440/Screen_Shot_2022_02_10_at_13.14.11.png\">      <figcaption><em>Left: the NYT’s version of Wordle. Right: the original Wordle.</em></figcaption>  </figure><p id=\"EOyaWB\"><em>The Times</em> takeover has also introduced a few changes to the game. The sans serif title is replaced with a font that’s very much in the style of the game’s new owners. There’s also a new menu in the left corner that you can open to access other NYT games. And, of course, all the help and Twitter links go to Times-owned accounts rather than creator Josh Wardle.</p><p id=\"wsbmii\"><em><strong>Update February 10th, 4:50PM ET: </strong></em><em>Added tweet from the </em>Times<em> confirming the issue.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/cSkmzZYZhTM_tq6aQ4m3fgupIPI=/76x0:1562x778/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23233394/Screen_Shot_2022_02_10_at_13.01.14.png",
  "description": "Maybe hold off on your daily game.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}