{
  "title": "The streaming service formerly known as IMDb TV is rebranding to ‘Amazon Freevee’",
  "url": "https://www.theverge.com/2022/4/13/23023835/imdb-tv-amazon-freevee-rebrand",
  "date": "2022-04-13T17:30:56.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Wl4RElK223dVKkj9tfLLsOHjAMA=/110x0:1249x759/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745256/Freevee.0.jpeg\" />        <figcaption>Freevee</figcaption>    </figure>  <p id=\"cqFKrs\">After launching as “<a href=\"https://techcrunch.com/2019/01/10/amazons-imdb-launches-a-free-streaming-service-freedive/\">IMDb Freedive</a>” back in 2019, IMDb TV quickly faded into the background of the ongoing <a href=\"https://www.theverge.com/streaming-wars\">streaming wars</a> that parent company Amazon had already established a respectable foothold in. While that initial rebrand never quite managed to put the fledgling platform and its content on the map, Amazon’s just announced its plan to reintroduce the streamer yet again under new branding ahead of a massive content push.</p><p id=\"2pcwkV\">Going forward, IMDb TV will be known as “Amazon Freevee,” a name meant to emphasize that the ad-supported platform is free to viewers. In <a href=\"https://apnews.com/article/technology-business-amazoncom-inc-netflix-jennifer-salke-84b0978c4880366ea6bd8dfff7e77af0\">a press release</a> detailing its vision for Freevee’s future, director Ashraf Alkarmi framed the service as a supplemental platform meant to appeal to consumers interested in watching “premium” series and films with significantly fewer commercial interruptions.</p><p id=\"StVWjJ\">“Customers are increasingly shifting to streaming ad-supported premium content, and we have developed Freevee to deliver them highly sought content with half the commercials of traditional TV,” Alkarmi said. “Our new name clearly communicates who we are: An easy-to-navigate streaming service, available to users for free, whenever and wherever they choose to watch some of the greatest Original and licensed content available.”</p><p id=\"OXAVOJ\">Though Freevee will feature a certain amount of licensed content, the streamer’s banking on its original programming like <a href=\"https://ew.com/tv/bosch-legacy-first-trailer-release-date/\"><em>Bosch: Legacy</em></a> and a <a href=\"https://www.hollywoodreporter.com/tv/tv-news/tegan-sara-quin-find-their-high-school-counterparts-in-tiktok-twins-1235113394/\">scripted adaptation of Tegan and Sara’s <em>High School </em>memoir</a> from Clea DuVall. While Freevee plans to grow its slate of original programming by 70 percent by the end of the year, what’s going to ultimately determine the platform’s success is whether people end up watching it. It’s certainly possible that the third time will be the charm for Amazon Freevee, but at this mature and intense stage of the larger streaming game, <a href=\"https://www.theverge.com/2022/4/12/23022359/cnn-plus-viewership-rates-streaming-warnermedia\">a wealth of content doesn’t necessarily ensure success</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NoFjb-eQGgxaxKXDm7vkQmBrtuI=/0x25:1357x735/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23387407/Freevee.jpeg",
  "description": "Amazon Freevee will expand its original programming by 70% in 2022",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}