{
  "title": "The US is trying to fix medical devices’ big cybersecurity problem",
  "url": "https://www.theverge.com/2022/4/8/23016588/medical-device-cybersecurity-fda-congress-hacking",
  "date": "2022-04-08T17:30:53.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-QDplZtzomak2EESz7nwyX87K14=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70727302/acastro_180109_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"hM6u0A\">Medical devices are one major weak point in health care cybersecurity, and both Congress and the Food and Drug Administration took steps towards closing that gap this week —Congress with a proposed bill and the FDA with new draft guidelines for device makers on how they should build devices that are less likely to be hacked.</p><p id=\"kBbYkr\">Devices like infusion pumps or imaging machines that are connected to the internet can be targets for hacks. Those attacks can siphon off patient data or put their safety directly at risk. Experts <a href=\"https://www.theverge.com/2022/1/19/22891440/internet-connected-medical-devices-vulnerable\">consistently find</a> that devices in use today have vulnerabilities that could be exploited by hackers.  </p><p id=\"DhXueV\">The FDA, which regulates medical devices, has been trying to get a handle on this problem for a while. Back in 2014, it put out guidance for medical device makers that outlined how they should incorporate cybersecurity before they asked the agency to clear their products. The agency<strong> </strong>then put out a draft guideline in 2018. This new draft replaces the 2018 version and is based on feedback from manufacturers and other experts and changes in the medical device environment over the past few years, Suzanne Schwartz, director of the Office of Strategic Partnerships and Technology Innovation at the FDA, told <em>The Verge</em>. </p><p id=\"HcGqNy\">The new document is still just a draft, and device makers won’t start using it until it’s finalized after another round of feedback. But it includes a few significant changes from the last go-around — including an emphasis on the whole lifecycle of a device and a recommendation that manufacturers include a Software Bill of Materials (SBOM) with all new products that gives users information on the various elements that make up a device. An SBOM makes it easier for users to keep tabs on their devices. If there’s a bug or vulnerability found in a bit of software, for example, a hospital could easily check if their infusion pumps use that specific software.</p><p id=\"sXihVE\">The FDA also put out <a href=\"https://www.fda.gov/media/157192/download\">legislative proposals</a> around medical device cybersecurity, asking  asking Congress for more explicit power to make requirements. “The intent is to enable devices to be that much more resilient to withstand the potential for cyber exploits or intrusion,” Schwartz says. Manufacturers should be able to update or patch software problems without hurting the devices’ function, she says. </p><p id=\"jVRVb9\">The FDA’s efforts dovetail with a proposed bill introduced in Congress <a href=\"https://healthitsecurity.com/news/senators-introduce-patch-act-to-ensure-medical-device-security\">this week</a>, the Protecting and Transforming Cyber Health Care (PATCH) Act, which would codify some of the FDA’s proposals. The bill would require device manufacturers to have a plan to address any cybersecurity issues with their devices, and require an SBOM for new devices. If the bill passes, then those elements become requirements rather than just recommended guidelines from the FDA.</p><div class=\"c-float-right\"><aside id=\"YFeAgu\"><q>“This would give us extra teeth”</q></aside></div><p id=\"eWlsFs\">“This would give us extra teeth,” Schwartz says. “This really, for the first time, would establish, very explicitly, authority in the area of cybersecurity and tie that directly to the safety of medical devices.”</p><p id=\"oBk83m\">Notably, these new recommendations and the legislation would primarily apply to new devices coming onto the market — they don’t cover the millions of medical devices already in use in the United States. The FDA has guidelines, written in 2016, that outline how device makers should keep tabs on potential cybersecurity issues in their existing devices already on the market. Schwartz says that the FDA doesn’t have active plans to update that guidance, but it’s something the agency would consider. </p><p id=\"ePKDYF\">The focus of the new draft guidelines and the FDA’s push for legislation around device cybersecurity is to make sure new devices coming online are in better shape than the ones that have been on the market and that have existing cybersecurity issues. “We want the devices of tomorrow not to have the same legacy issues that we’re dealing with today,” she says.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EN5rNlX7CHRVFv0Kueof6708x0E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10005783/acastro_180109_1777_0001.jpg",
  "description": "Medical devices are targets for hacking.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}