{
  "title": "The incredible sci-fi mystery 13 Sentinels is a perfect fit for the Switch",
  "url": "https://www.theverge.com/2022/4/12/23020928/13-sentinels-nintendo-switch-review",
  "date": "2022-04-12T14:30:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NY3VfPYBk15Sm-yro7bYS5dEfCA=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70739905/ss_01_4b2b511bc5.0.jpg\" />    </figure>  <p id=\"PifYKm\">To enjoy <em>13 Sentinels: Aegis Rim</em> is to embrace confusion. The game, which originally launched in 2020 on the PS4, is hard to describe, with gameplay that spans multiple genres and a non-linear storyline that involves everything from time travel to android doppelgängers and only gets weirder from there. It demands a lot from players, but the result is one of my favorite science fiction stories in years — and, unsurprisingly, it’s a great fit for the Switch, with a new version for Nintendo’s tablet that launches today.</p><p id=\"xEwpb4\">For a more detailed rundown, <a href=\"https://www.theverge.com/21493208/13-sentinels-aegis-rim-ps4-review-vanillaware\">here’s my review</a> from when <em>13 Sentinels</em> first debuted. But the short version is: the game is a mix of a visual novel and a real-time strategy game, which follows more than a dozen characters across events that span multiple centuries. It’s a narrative that likes to trick you. At first, it seems like a simple classic mech vs. kaiju story, where the RTS portions of the game involve high school students piloting powerful mechs to fight off an invading alien force. These sequences are simple but satisfying as you move characters across a grid to destroy increasingly devious creatures, unlocking new abilities along the way.</p><p id=\"ITlvGL\">Mostly, though, <em>13 Sentinels</em> is a visual novel where you follow the stories of around a dozen Japanese high school students across a handful of different eras, starting in the 1980s. These play out as side-scrolling vignettes, where you can do a bit of exploration, but mostly, you’re reading / listening to dialogue. It definitely requires some patience. What’s most interesting about the story, though, is its structure. At almost any given moment, you can pick from a handful of different characters’ stories, allowing you to follow the path that seems most interesting to you. The non-linearity made me feel more invested in the story, as if I was investigating different leads to find out just what the heck was going on. <em>13 Sentinels</em> also introduces a fascinating feature called a thought cloud, which is basically like a video game inventory, except for ideas, adding a dynamic feel to conversations.</p><div id=\"qJBoEj\"><div ><iframe src=\"https://www.youtube.com/embed/lFQzi1ycl8I?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"T4sShf\"><em>13 Sentinels</em> also does an incredible job of slowly revealing itself. While it initially seems like that kaiju invasion story, with a little bit of teen drama thrown in for good measure, eventually becomes a sprawling, complex narrative about, among other things, the future of the entire human race. I won’t spoil any of the big reveals, but it probably took me 10 hours before I had any idea what the game was really about. The way it lays out weird and interesting narrative breadcrumbs helped pull me through that early feeling of being completely lost.</p><p id=\"BN8C0G\">This was all true before, of course, but that structure of bite-sized episodes also makes <em>13 Sentinels</em> an ideal Switch game. I’ve replayed the first few hours so far, and most of that time has been spent in bed, squeezing in a few more episodes before going to sleep. Each episode lasts maybe 20 to 30 minutes, too, making it easy to play in short bursts. It’s a lot like reading a good book — only one where you have to pause every few chapters to play a quick game of chess. The game is identical on the Switch otherwise, but the portability is ideal for the game, making it easier to choose between savoring the story or binging it.</p><p id=\"GizPsm\">This means that <em>13 Sentinels</em> still retains some of its rough edges on the Switch. As fascinating as the story can be, it’s incredibly demanding; you have to really believe that those hours and hours of utter confusion are going to pay off. And while the game has beautiful 2D visuals — something developer Vanillaware is well-known for — it does have some, let’s say, questionable character designs that can sour the experience.</p><p id=\"35Wfjp\">Still, if you can look past that, it’s worth pushing through that initial feeling of bewilderment. Because while confusion can often be a bad thing, here it just makes piecing the story together all the more satisfying. <em>13 Sentinels</em> crams so many high-level concepts into one experience — including, among many others, <em>Groundhog Day</em>-like repetition, time-traveling robots, and a talking cat with a magical gun — but somehow in a way that, eventually, makes sense. And now you can solve the mystery from pretty much anywhere.</p><p id=\"FqJKtq\"><small>13 Sentinels: Aegis Rim</small><small><em> is available now on the Nintendo Switch and PS4.</em></small></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5QZLJkjyKBhqYpp8L9mkhjPk91E=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382907/ss_01_4b2b511bc5.jpg",
  "description": "Confusion on the go",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}