{
  "title": "The Asus ROG Strix Flare II Animate: feature-packed, but overpriced",
  "url": "https://www.theverge.com/22913232/asus-rog-strix-flare-ii-animate-gaming-keyboard-review",
  "date": "2022-02-16T20:00:00.000Z",
  "author": "Alice Newcome-Beill",
  "content": "  <p>An expensive hot-swappable gaming keyboard that features a dot matrix LED panel</p> <p class=\"p--has-dropcap p-large-text\" id=\"2q1OLg\">If you’ve been shopping around for a gaming keyboard in the past couple of years, odds are you’ve happened upon a model from Razer, Corsair, or Logitech which have really dominated this space. Asus and its gaming brand, Republic of Gamers, have been around just as long as the competition but typically aren’t the first names that come to mind when buying a new mechanical keyboard for your setup.</p><p id=\"Vj1dnB\">The Asus ROG Strix Flare II Animate is part of that new lineup that intends to position Asus in parallel with its competitors in the arena of gaming peripherals by offering at least one unique feature with each of its gaming keyboards. The Falchion, its tenkeyless model, features a touch bar built into the side for controlling media playback, while the largest model, the Claymore II, has optical switches and a detachable number pad that can be clipped onto either side of the keyboard. The Strix Flare II boasts an eye-catching dot matrix LED display cut into the corner, as well as a hot-swappable PCB.</p><p id=\"4mp1Cm\">The Asus ROG Strix Flare II Animate is <a href=\"https://shop.asus.com/us/rog-strix-flare-ii-animate.html\">available now for $219.99</a>, but can currently only be purchased from the Asus storefront. While not quite as expensive as the Corsair K100 was at launch ($229.99), this keyboard is still markedly more expensive than other keyboards on the market.  </p><div id=\"BsPjRM\"><div data-anthem-component=\"scorecard:10740932\"></div></div><p id=\"tZgwu1\">On paper, the Asus Strix Flare II Animate is a full-size mechanical gaming keyboard with customizable RGB backlighting. Some additions to the hardware include a dedicated media playback cluster, a hot-swap PCB for easy changing of switches, and its namesake dot matrix LED light panel. It also features an 8K polling rate and has sound dampening foam built into the chassis to improve acoustics.</p><p id=\"buA3kD\">Right out of the box, the Flare II Animate doesn’t appear too different from other gaming keyboards. It’s a bit lighter than you’d expect for a full-size board, which is nice, and the aluminum top plate gives the keyboard a sturdy feel with virtually no flex in the chassis. The design may appear a little plain to some, but I prefer to see it as pure and uncomplicated. I’ve seen enough boards that look like the Batmobile, so I can definitely appreciate a choice that’s a little more understated.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1W1EEAfbhyzhN6NBpzY8YTsv7_k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23236664/akrales_220209_5005_0014.jpg\">      <figcaption><em>The underglow RGB bar can be removed and replaced by a magnetic wrist rest.</em></figcaption>  </figure></div><p id=\"lV2Nja\">Asus’ own mechanical switches are virtually indistinguishable from Cherry counterparts, and the keyboard can ship with a selection of linear, tactile, or clicky switches based on your preference. My review unit came with Asus’ linear red switches and I didn’t experience a notable difference from the Cherry Reds I’m used to. </p><p id=\"hwRDlD\">The features in the Flare II Animate read like a gamer’s wish list. While N-Key rollover, anti-ghosting, and per-key RGB lighting are more or less expected, some of the less common features include dedicated media playback buttons, PBT keycaps, and USB 2.0 passthrough. The one unfortunate omission is the lack of a detachable USB connection for the keyboard itself but is understandable considering it requires a pair of USB ports on your desktop to support the passthrough.</p><p id=\"j6bpA3\">This extensive list checks nearly all the boxes of what you want in a full-size gaming keyboard, but this isn’t what sets the Flare II Animate apart. The first standout feature is a dot matrix LED panel sliced into the upper right corner of the keyboard that gives the Animate its name. The second, less obvious inclusion is a hot-swappable PCB that I’ll touch on later.</p><div class=\"c-float-right c-float-hang\"><div id=\"0JPOJw\"><div data-anthem-component=\"aside:9444621\"></div></div></div><p id=\"uRlG9S\">The Animate display uses a collection of 312 LEDs that can be customized to display static images, animations, provide you with basic alerts, show marquee text, or simply be an audio visualizer. </p><p id=\"SYJAVT\">However, getting the display to consistently work as intended is an uphill battle. There are three separate modes to display all the various bits of information. Unfortunately, only a single mode may be active per profile. If you want the keyboard to display the time and date, it can’t cycle between that function and an audio visualizer without making a separate profile in the software.    </p><p id=\"fkQM9z\">Outside of scrolling text, nearly every image I tried to put on the display was entirely illegible. The animations that come packaged with the Armoury Crate software are a good showcase of what this modest screen is capable of,  but trying to import or make your own animations is just way too difficult. This is partly the fault of trying to fit any image onto a small, monochromatic dot matrix screen, but it’s a curious feature for the company to hang its rebranding on, sticking these displays into the lids of laptops, on motherboards, and now keyboards.</p><p id=\"v5MF67\">Once the initial novelty of the display wears off, it’s pretty clear that the utility of this feature is extremely limited and not really worth the effort. </p><p id=\"lwEpCu\">Sadly, trying to implement customized per-key RGB backlighting isn’t much better. The Asus Armory Crate software is fairly simple to use and allows some basic customization of performance and lighting options. However, if you’re trying to create something a little more detailed, you need to use the Asus Aura Creator software which feels about as unintuitive as it looks, resembling a program like Final Cut Express.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nUiVgD2JYMBdZWSRqu1EoyDaqAw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243695/Screenshot_2022_02_11_170013.png\">      <cite>Asus</cite>      <figcaption><em>The Aura Creator software offers some interesting possibilities, if you can get past its steep learning curve.</em></figcaption>  </figure><p id=\"5ctMfa\">The Aura Creator software offers far more granular control over your lighting options than programs like Razer Synapse or Corsair’s iCue software, so it can take a bit of trial and error to implement the kind of lighting scheme you want. But once you get a handle on how the systems work, you can create some incredibly detailed effects. If you don’t want to engage with the software at all, that’s an option as well, the hardware comes with a handful of pre-set lighting effects you can cycle through, as well as static backlighting. However, this feature is extremely basic with no way to adjust the color, only the brightness.</p><p id=\"d3CSj5\">Perhaps more exciting than the Animate display, the Flare II has hot-swappable switches, an uncommon feature outside of the enthusiast keyboard market. The keyboard ships with Asus’ own switches pre-installed, but you can use any number of Cherry-compatible third-party switches. Unfortunately only three-pin switches are supported, which slightly limits your options unless you’re happy to modify five-pin switches. I tested the Flare II with a set of Gateron Silver switches and was able to swap them into the PCB with no trouble thanks to the included switch and keycap puller included in the box.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/icnSJl1A5CScUvJY4bDgHvPUdwE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23236671/akrales_220209_5005_0154.jpg\">      <figcaption><em>Besides the LED display, the other standout feature of this keyboard are the hot-swappable switches.</em></figcaption>  </figure></div><p id=\"gxLODm\">The hot-swappable PCB paired with the standard keycap layout opens an impressive amount of customization options.  This is an excellent feature for anyone that wants to dip their toe into the world of DIY keyboards with custom switches or keycaps, or for players that want a more granular selection outside of the typical red, blue, or brown Cherry MX-style options.</p><p id=\"8kNXIW\">All right, with all that out of the way let’s talk about the typing and gaming experience on the Strix II Animate. The addition of sound-dampening foam below the PCB does change the audio profile of the keys slightly but isn’t very noticeable unless you have an unpadded keyboard to compare it to. (Which I’ve actually done below, comparing the sound of the Strix II Animate to the Razer Huntsman Tournament Edition.) Even then, unless you’re an incredibly discerning user, it’s unlikely you’ll pick up on this difference. While there is a small amount of rattle in the stabilizer keys, there’s thankfully enough padding to prevent any audible “pings” while typing.</p><p id=\"O0CLA3\">The Asus Strix Flare II Animate</p><div id=\"1SCPXC\"><br><br><audio controls=\"\"><source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23249531/animate.mp3\" type=\"audio/mp3\"></source></audio></div><p id=\"BtRopp\">The Razer Huntsman Tournament Edition</p><div id=\"x5QAsa\"><br><br><audio controls=\"\"><source src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/23249536/huntsman.mp3\" type=\"audio/mp3\"></source></audio></div><p id=\"NqNWcw\">The keycaps are a standard layout shine through double-shot PBT set, that uses the blocky Asus ROG font. The keycaps have a nice texture and won’t pick up smudges, and while the blocky font is legible and inoffensive, it won’t appeal to everyone. The keyboard doesn’t come packaged with alternate keycaps like some Corsair models, but the standard layout allows the Animate to adopt just about any custom keycap sets you can find on the internet.</p><p id=\"twE108\">A small difference from the first Strix Flare board was the choice to move Flare II’s dedicated media controls to the left side of the board in order to accommodate the LED panel. Condensing and moving the media playback buttons took some getting used to, but the hardware is functional and well-executed.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/r227Jd2mMMYkXg4yp9kyenXBo1A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250190/anbeill_220216_5026_0001.jpg\">      <cite>Photo by Alice Newcome-Beill / The Verge</cite>      <figcaption><em>The Flare II’s media and volume controls are on the left side to make room for the animated display on the right.</em></figcaption>  </figure><p id=\"DFbskS\">The keyboard does come with a leatherette wrist rest that does have RGB underglow, similar to that on the larger Razer Huntsman keyboard. Unfortunately, attaching it or removing it to the keyboard involves a curious process that involves removing the magnetic light strip at the bottom so the wrist rest can attach itself. It’s not particularly complicated but feels like an additional step that didn’t need to be there. </p><p id=\"Xe3QM5\">The Asus ROG Strix Flare II Animate is a mouthful of a mechanical keyboard that presents a stride in the right direction in this company’s attempt to play a more prominent role in the crowded gaming peripherals space.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_yTm0qDbbzyoDmYkuR536P18hhU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23236669/akrales_220209_5005_0120.jpg\">      <figcaption><em>The Strix Flare II Animate uses a proprietary switch from Asus that comes in linear, tactile, or clicky flavors.</em></figcaption>  </figure><p id=\"vgmaEn\">The relatively standard fare of PBT keycaps, dedicated media playback buttons, and per-key RGB lighting aren’t really enough to make you consider upgrading if you’re someone that’s bought a new keyboard recently. But the inclusion of sound-dampening foam and a hot-swappable PCB might be enough to convince you if you can stomach the price tag. </p><p id=\"yY5H1z\">The LED panel, on the other hand, shouldn’t be the reason you purchase this keyboard. It would be much easier to recommend this model if they ditched that particular feature to shave $20 or $30 off the price, as $220 is on the pricey end of the spectrum, especially when some of the features adding to that price feel so superficial.</p><p class=\"c-end-para\" id=\"aqAd4C\">If you’re shopping for a gaming keyboard that ditches the pricey extras for a lower price, we’d recommend looking at the Razer BlackWidow V3 or the Corsair K70 RGB Pro.</p><p id=\"aqAVyX\"></p><p id=\"gKklo9\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/w5UCN_JTBpkheS0TR49QOzRuBJg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23236665/akrales_220209_5005_0073.jpg",
  "description": "This hot swappable keyboard has a dot matrix LED panel",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}