{
  "title": "The Pixel 6A loses the A-series’ best feature",
  "url": "https://www.theverge.com/2022/5/12/23067680/google-pixel-6a-phone-camera-tensor",
  "date": "2022-05-12T19:02:35.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/cHxrwWKvJw3RVxz8UwVKQlHgyYA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70862200/ajohnson_210813_4713_0005.0.jpg\" />        <figcaption><em>The camera is no longer the centerpiece of Google’s phones: Tensor is.</em> | Photo by Allison Johnson / The Verge</figcaption>    </figure>  <p id=\"66jj7g\">One of the coolest things about the Pixel A-series was that it was an inexpensive way to get the very same class-leading camera as the main Pixel models. It’s one of the reasons I bought a Pixel 3A years ago — that, and it was in stock at Best Buy with in-store pickup. It was also one of the top reasons why the Pixel A-series was our go-to recommendation for <a href=\"https://www.theverge.com/21420196/best-budget-smartphone-cheap\">the best budget Android phone</a> for years. Everything else about the phone — screen, processor, battery — was <em>fine</em>, but the camera was <em>excellent.</em></p><p id=\"UhjSx2\">That streak <a href=\"https://www.theverge.com/2022/5/11/23064495/google-pixel-6a-price-specs-screen-tensor-io\">comes to an end in the Pixel 6A</a>. Unlike the A-series phones that came before it, the 6A doesn’t include the same camera hardware as the Pixel 6 or Pixel 6 Pro. <a href=\"https://www.theverge.com/2022/5/11/23067702/google-pixel-6a-headphone-jack\">There’s no headphone jack either</a>, which stinks, too. But rather than a bigger, 50-megapixel sensor behind those devices’ main cameras, the 6A has the same 12-megapixel sensor that the Pixel 5 and 5A used. And the Pixel 4. And the Pixel 3.</p><div class=\"c-float-right\"><aside id=\"CDXrM9\"><q>Google wants the Pixel to be the phone that does really cool, helpful stuff for you</q></aside></div><p id=\"2B1FJv\">That’s kind of a bummer. But it also tells us a lot about where Google sees the value in its devices going forward. Google doesn’t want the Pixel just to be known as the phone with the really good camera. It wants the Pixel to be the phone that does really cool, helpful stuff for you. </p><p id=\"lItEat\">This was probably an inevitable move, too. The 6 and 6 Pro aim higher in the premium category than the Pixel 4 or 5 before them, so there were more decisions to be made about what had to go to make a budget version of the phone. Google’s SVP of devices and services, Rick Osterloh, summed up the challenge thusly: </p><blockquote><p id=\"hk6z78\">Basically, what we want to try to do is get the core experience to as many users as possible. That’s the overall goal. Every phone has a lot of difficult components to try to cost-reduce. And so without a doubt, you have to change some of the key capabilities in the device to get it to where we want it to be on the price-point side.</p></blockquote><p id=\"6nqVFz\">For previous Pixel models, a big part of that “core experience” was the camera. Now, it means Google’s custom chipset, Tensor. This is the processor that makes many of the Pixel 6’s software features, like improved speech recognition, possible. It also makes it easier for Google to develop new features for the whole Pixel 6 series. Tensor has taken center stage in Google’s priorities, and the camera is playing a supporting role.</p><p id=\"ooo4L0\">Of course, it’s worth mentioning that one benefits the other. Tensor is also behind some of the new software-based camera features on the 6 and 6 Pro, like Magic Eraser. And really, the camera hardware on Pixel phones has always been secondary to the software that makes them work so well. But Google couldn’t outfit the 6A with the latest hardware <em>and</em> software this time, so it doubled down on the latter.</p><aside id=\"9AQmkK\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Google Pixel 6 and Pixel 6 Pro review: finally, more than just good cameras\",\"url\":\"https://www.theverge.com/22750387/google-pixel-6-pro-review\"}]}'></div></aside><p id=\"RciBBo\">Maybe that’s a reflection of our priorities as people who buy phones, too. The difference between what this year’s smartphone camera can do versus last year’s isn’t as noticeable as it was four or five years ago. And for a lot of us, our phone cameras have gotten good enough at the things we need them to do that the difference between a really good camera and a just-okay smartphone camera isn’t worth paying an extra $300 or $500.</p><p id=\"yEoX4A\">Moving the camera out of the spotlight on the Pixel is a sensible move, even if it makes me a little nostalgic for the feeling that I was getting away with something when I bought the Pixel 3A. Maybe Pixel 6A owners will feel that way when they try out live speech recognition and find out just how good it is. (It’s really good.) That’s the bet that Google is making, anyway.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/SZqmfF9FwsYCLTmKHhLkFzxvO2c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22781450/ajohnson_210813_4713_0005.jpg",
  "description": "Google is all about Tensor now.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}