{
  "title": "The Halo show is nothing like the games, and that’s why it’s good",
  "url": "https://www.theverge.com/2022/3/24/22994651/paramount-plus-halo-tv-show-halo-lore",
  "date": "2022-03-24T18:09:05.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6m_-rIV7K4zzddDYQ5e07rvPYYI=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70667555/Halo_101_5450_RT.0.jpeg\" />        <figcaption>Adrienn Szabo/Paramount+</figcaption>    </figure>  <p id=\"Kf1VYG\">After seeing <a href=\"https://www.theverge.com/2022/3/23/22991842/paramount-halo-show-review\">the first episode of <em>Halo</em></a><em>,</em> I’m totally on board. I’m a <em>Halo</em> lore hobbyist, meaning that while I’ve enthusiastically experienced the campaigns of <em>Halo</em>’s <em>Combat Evolved </em>through <em>Guardians</em>, go on regular Halopedia wiki dives, and own a well-loved copy of Eric Nylund’s <em>The Fall Of Reach</em>, I haven’t consumed <em>everything</em> the Halo universe has to offer. (<em>Ghosts of Onyx</em>, I swear I’ll get to you one day.) But based on the <em>Halo</em> stories I do know, I think Paramount Plus’ series offers a far more compelling look at the Master Chief than anything the games have done so far. </p><p id=\"eC07yO\"><em><strong>Spoilers for the first episode of Halo below:</strong></em></p><p id=\"EVi4MB\">It’s hard translating video games to film and TV. It’s only recently been done right with <a href=\"https://www.theverge.com/22763818/netflix-league-of-legends-arcane-review\"><em>Arcane</em>,</a> <a href=\"https://www.theverge.com/2017/7/7/15938192/netflix-castlevania-review-animated-video-game-adaptation\"><em>Castlevania</em></a>, and the <a href=\"https://www.theverge.com/2020/2/13/21133092/sonic-the-hedgehog-movie-review-paramount\"><em>Sonic</em> movie</a>. And the common thread for all these successful titles seems to be “chuck out every established story the audience knows and tell a new one.” <em>Halo</em>’s showrunner Steven Kane said <a href=\"https://variety.com/2022/tv/features/halo-series-paramount-plus-master-chief-1235205361/\">in an interview with <em>Variety</em></a> that “We didn’t look at the game. We didn’t talk about the game. We talked about the characters and the world. So I never felt limited by it being a game.” His comments <a href=\"https://twitter.com/Variety/status/1504184189674958851/retweets/with_comments\">drew criticisms from <em>Halo</em> fans on social media</a> worried that this show was going to look nothing like the games. It doesn’t, and that’s what makes it really good.</p><p id=\"W19dMV\">I love that the central premise of the first episode has barely anything to do with the fight against the Covenant. It would have been very easy to make a show about the Master Chief with his Blue Team pals running up on the Gravemind or 343 Guilty Spark. Instead, the entire first episode is all about the friction between the Chief and his UNSC masters — a topic that wasn’t even broached until <em>Halo 5: Guardians </em>and, even then, only in the context of “I must save my AI girlfriend / mom, and you won’t let me.”</p><p id=\"S3EV6o\">The showrunners were absolutely correct in their choice to “not look at the games.” The result is a story that asks us to grapple with the very reason Spartans were created: as weapons for the suppression, repression, and subjugation of humanity — a premise the games have almost never asked us to interrogate. Spartans have always been these superhuman human-killing machines devoid of emotion, but we have never had the chance to see how the Spartans themselves feel about that. That’s the promise of this show, and I’m super invested in the conclusions it’ll draw. </p><p id=\"tWLC2U\">That’s not to say I loved everything about the show’s first episode. I am befuddled by the introduction of a high-ranking human in the Covenant faction, and, as my colleague Charles Pulliam-Moore alluded to in <a href=\"https://www.theverge.com/2022/3/23/22991842/paramount-halo-show-review\">his <em>Halo</em> review</a>, it’s a bit <em>too</em> gruesome. <em>Halo</em> as a game was never like <em>Gears of War</em>. You shot the Covenant, and they fell down — they never exploded in a cloud of purple mist. Maybe that choice was made out of consideration for the game’s ratings or some other unknown, but I always felt that choice made it such that when gruesome things do happen (like <a href=\"https://youtu.be/6rdslzQRlm0\">That Scene in <em>Halo 4</em></a>),<em> </em>they hit harder. The bloody violence of the <em>Halo</em> show seems to lack that same gravitas and comes across as a cheap-feeling <em>Game of Thrones</em>-like gratuitousness.</p><p id=\"i7N9My\">I’ll also say this: Master Chief is already the chosen one. In the games, Cortana literally chooses him based on nothing more than her perception of his “luckiness.” So I find his additional “I am a very special boy” modifier in the form of his preternatural connection to the show’s mysterious artifact a little annoying. </p><p id=\"a318US\">Ultimately, this is only episode one. There’s still time for the show to devolve into an “oorah let’s kill us some aliens” fest. But if it continues along the path this first episode has charted, I think the show will be a refreshing entry in the <em>Halo</em> canon. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Pw7jJmZe9WPrZJBO2Ok32r01yAY=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23338216/Halo_101_5450_RT.jpeg",
  "description": "The Covenant is secondary to a more interesting conflict",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}