{
  "title": "The Hummer EV’s battery weighs more than a Honda Civic ",
  "url": "https://www.theverge.com/2022/2/16/22937491/hummer-ev-electric-truck-battery-weight-truck-bloat",
  "date": "2022-02-16T19:21:01.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/nCbe5cJRH0vJpNAzSJiWoEmHS5Q=/362x0:5338x3317/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70517772/2022_GMC_HUMMER_EV_001.0.jpg\" />    </figure>  <p id=\"1XhFmR\">We always knew that when General Motors decided to resurrect the Hummer brand as an electric truck, we were still going to get something excessively massive, as per its namesake. But I don’t think we were adequately prepared for the amount of <a href=\"https://theweek.com/articles/929196/case-against-american-truck-bloat\">truck bloat</a> encapsulated in <a href=\"https://www.theverge.com/2020/10/20/21525290/hummer-ev-electric-truck-gmc-price-specs-range\">the Hummer EV</a>. </p><p id=\"aB73xR\">According to <a href=\"https://dis.epa.gov/otaqpub/display_file.jsp?docid=54610&amp;flag=1\">test data filed by GM with the Environmental Protection Agency</a> — which was <a href=\"https://www.caranddriver.com/news/a39049358/2022-gmc-hummer-ev-pickup-epa-specs/\">first spotted by <em>Car &amp; Driver</em></a> — the GMC Hummer EV clocks in at an eye-watering 9,063 lbs. That’s several pounds heavier than the 9,046 lbs first reported last summer by enthusiast site GM Trucks. </p><p id=\"YWlIVA\">But that wasn’t the number that really floored me. The one that really singed my corneas was 2,923 lbs, which is the total weight of the Hummer EV’s battery. That’s heavier than a whole ass Honda Civic, bulkier than a Subaru BRZ, flabbier than a Ford Fiesta. That’s a snack and a half. </p><div class=\"c-float-right\"><aside id=\"2U61Sj\"><q>After all, it’s a <em>freaking Hummer</em></q></aside></div><p id=\"LDmYu2\">Look, I’m not going to sit here and claim to be shocked by the Hummer EV’s colossal dimensions. After all, it’s a <em>freaking Hummer</em>. Were you expecting a dainty Euro-style smart car to bear the nameplate made <a href=\"https://www.vox.com/the-goods/2020/1/2/20992114/hummer-masculinity-america-humvee-schwarzenegger\">famous by Arnold Schwarzenegger</a>? </p><p id=\"3CPewy\">But it does seem to be a subject that gets lost in the general hype surrounding the EV boom. President Joe Biden has <a href=\"https://www.theverge.com/2021/12/8/22824500/biden-executive-order-climate-change-carbon-emissions-electric-vehicles\">hitched his political star</a> to the massive shift taking place right now in the auto industry from dirty gas engines to cleaner electric motors — while largely ignoring the gratuitous dimensions these new EVs are inhabiting. </p><p id=\"pnusfo\">To be sure, electric vehicles are generally heavier than their internal combustion engine counterparts. But what many people seem to forget is that heavier vehicles are inherently more polluting than lighter ones, regardless of whether they emit any tailpipe emissions. All vehicles produce non-exhaust emissions from a variety of sources, including rubber tires, road dust, and brakes. This is especially true for electric vehicles, thanks to the added weight from their batteries. </p><p id=\"5St6qr\"><a href=\"https://www.oecd.org/officialdocuments/publicdisplaydocumentpdf/?cote=ENV/EPOC/WPIEEP(2020)4/FINAL&amp;docLanguage=En\">According to the Organization for Economic Cooperation and Development</a> (emphasis mine):</p><blockquote><p id=\"CpRoZn\">Regenerative braking systems can reduce brake wear, but tyre wear, road wear, and road dust resuspension remain significant sources of non-exhaust emissions from electric vehicles. <strong>Non-exhaust emissions from these sources can in fact be higher for electric vehicles than for their conventional counterparts, as the heavy batteries in electric vehicles imply that they typically weigh more than similar conventional vehicles.</strong> This is particularly the case for electric vehicles with greater autonomy (driving range) that require larger battery packs.</p></blockquote><p id=\"S9LQR2\">GM isn’t the only offender here. While <a href=\"https://www.theverge.com/2021/6/7/22522488/ford-f-150-lightning-electric-pickup-truck-first-look-photos\">Ford’s upcoming F-150 Lightning</a> is roughly the same size as its fossil fuel-powered equivalent, it weighs 6,500 pounds — or over 35 percent more than the gas engine version. That’s in large part thanks to the 1,800-pound battery resting immovably in the floor of the truck.</p><div class=\"c-float-right\"><aside id=\"ZCHKZe\"><q>heavier vehicles are inherently more polluting than lighter ones</q></aside></div><p id=\"Ear2IZ\">We’ve known for years that the boom in SUV and truck sales have led to increased CO2 emissions and a distressing spike in pedestrian deaths. <a href=\"https://www.usatoday.com/story/news/nation/2019/01/28/video-man-clings-hood-moving-suv-road-rage-incident/2699155002/\">Anecdotal evidence</a> has shown that driving extra-large vehicles can lead to unhealthy levels of road rage. </p><p id=\"EUK3fn\">And while people driving SUVs are slightly safer, the number of pedestrians killed by those drivers has skyrocketed: an estimated 31,720 people died in motor vehicle traffic crashes from January through September 2021, which, <a href=\"http://nhtsa.gov/press-releases/traffic-fatalities-estimates-jan-sept-2021\">according to the National Highway Traffic Safety Administration</a>, is the “highest number of fatalities during the first nine months of any year since 2006 and the highest percentage increase during the first nine months” in the history of the agency’s reporting. </p><p id=\"FPh8SK\">But at least the Hummer EV should get great range out of that massive battery, right? Range anxiety will be a thing of the past! Think again. According to GM’s test data, the Hummer EV will go 329 miles on a single charge with 212.7 kWh of usable energy in the battery. And it will consume energy at 47 MPGe (miles per gallon equivalent), which is the EPA’s unit of measurement for an EV’s energy consumption level to compare with gas-powered vehicles. </p><p id=\"5Jck38\">That’s less efficient than 33 percent less than the Rivian R1T electric truck’s rating of 70 MPGe, as noted by <em>Car &amp; Driver</em>. (A GMC spokesperson told the publication that it will not be displaying the Hummer EV’s MPGe number in the sticker window, as vehicles with a gross vehicle weight rating of 8,500 lbs or more are not required to.) </p><p id=\"49gxq7\">Hefty, inefficient it may be, the Hummer EV still stands to soak up praise from auto journalists and elected officials eager to tout a sea change in the US auto industry. But these figures are a good reminder that while GM claims to be turning over a new leaf, a Hummer is still just a Hummer, bloat and all. </p><p id=\"gt0vlZ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/fpzVvjgXfmkd6U_qPcAZUADNp4Y=/0x167:5700x3151/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21975965/2022_GMC_HUMMER_EV_001.jpg",
  "description": "The Hummer’s battery weighs 2,923 lbs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}