{
  "title": "The first trailer for Love, Death and Robots volume 3 is full of killer animals",
  "url": "https://www.theverge.com/2022/5/9/23063543/love-death-robots-volume-3-trailer-netflix",
  "date": "2022-05-09T14:55:55.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"Love, Death &amp;amp; Robots: Volume 3\" src=\"https://cdn.vox-cdn.com/thumbor/aQiZeZ8x9TB0w2Jyko0lotwqEPI=/428x0:3668x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70848394/LDR_V3_FirstLookImage_5_Final.0.jpg\" />        <figcaption>Image: Netflix</figcaption>    </figure>  <p id=\"8pojf8\">We already knew that Netflix’s sci-fi anthology <a href=\"https://www.theverge.com/2022/4/18/23031238/netflix-love-death-and-robots-third-season-volume-release-date\"><em>Love, Death and Robots</em> was returning for a third volume</a>. But thanks to a fresh trailer, we now also know what to expect. As always, the show will feature short animated stories that generally fall into the genres of sci-fi, horror, and, occasionally, fantasy. But what really makes <em>Love, Death and Robots</em> stand out is the variety of stories it tells. This season looks no different, with animation ranging from hyper-real to cel-shaded trippiness.</p><p id=\"XgekGQ\">Netflix says the new season will feature nine stories, and if there’s a unifying theme — aside from the titular love, death, and robots — it might just be animals. The trailer includes giant crabs, warrior rats, cyborg bears, and what appears to be an astronaut kitty. Also, there’s a not very subtle dig at tech billionaires. The third volume of the show, produced by Tim Miller and David Fincher, is due to start streaming on May 20th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DUBsyqgyccZhIsfWlZE0zHR8Hts=/0x8:4096x2153/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23448150/LDR_V3_FirstLookImage_5_Final.jpg",
  "description": "Also there’s love, death, and robots.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}