{
  "title": "The best Bluetooth speakers to buy right now",
  "url": "https://www.theverge.com/23022617/best-bluetooth-speakers",
  "date": "2022-04-13T16:00:00.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JuKtV5n43FpLBF5OWEwtj_Wiz90=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70744759/cwelch_220410_5136_0007.0.jpg\" />        <figcaption>Photo by Chris Welch / The Verge</figcaption>    </figure>  <p>Water resistance and lengthy battery life are now standard</p> <p class=\"p--has-dropcap p-large-text\" id=\"7KZaft\">Wireless Bluetooth speakers have become ubiquitous, indispensable gadgets. Everyone’s got one somewhere, and the use cases vary from person to person. Maybe you use your speaker around the house or as a shower soundtrack. Maybe you bring it along to the park or beach. And then there are those people who take a portable speaker practically everywhere they go — sharing their music from a bike or backpack with everyone nearby. </p><p id=\"RjjGGW\">I know a lot of people who have old Bluetooth speakers kicking around, and if the one you’ve got is still working for you, there’s no immediate need to upgrade to something newer. But Bluetooth speakers have gotten <em>very</em> good in recent years. Sound quality continues to improve, battery life is stretching to new records, and they’re more robust and durable than ever before. </p><p id=\"db1pM4\">If you’re shopping around for a new speaker, start off by considering what size you want. For this guide, I’m mostly sticking to portable Bluetooth speakers and excluding anything that’s impractical to take on the go. From there, you need to weigh other criteria like audio quality, ease of use, durability, and bonus features like speakerphone functionality. Some speakers let you stereo pair two of them together, and several companies include “party mode” capabilities that let you link many speakers together. If you don’t really care about any of that, you can get a tiny Bluetooth speaker <a href=\"https://www.amazon.com/Anker-SoundCore-Super-Portable-Noise-Cancelling-Microphone/dp/B01HTH3C8S?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">for as little as $25</a>. But all of the picks here go a little further in terms of features and style.</p><h1 id=\"PngioE\">The best portable Bluetooth speakers</h1><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Dkwr6TflBOclt0_1mpZjoEbdl18=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382984/cwelch_220410_5136_0001.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Bose’s SoundLink Flex is more rugged and durable than it looks.</em></figcaption>  </figure></div><h1 id=\"yBH4WM\">1. Bose SoundLink Flex</h1><h3 id=\"re8YwF\">Best Bluetooth speaker under $200</h3><p id=\"vF5KvY\">I don’t know what kind of engineering sorcery goes into Bose’s Bluetooth speakers; I just know that going back to the <a href=\"https://www.dpbolvw.net/click-8836598-11556694?sid=VergeSpeakersGuide041322&amp;url=https%3A%2F%2Fwww.bose.com%2Fen_us%2Fproducts%2Fspeakers%2Fportable_speakers%2Fsoundlink_mini_ii_special.html%23v%3Dsoundlink_mini_ii_special_triple_black\" rel=\"sponsored nofollow noopener\" target=\"_blank\">SoundLink Mini II</a>, they’ve simply sounded clearer and <em>better</em> — to my ears, at least — than any competitors in the same size range. The $149 SoundLink Flex is Bose’s latest portable speaker, and it continues to make good on that reputation. </p><p id=\"w1xYw1\">Despite only having a mono driver (which isn’t uncommon for Bluetooth speakers), the SoundLink Flex delivers expansive sound with a genuinely surprising amount of bass. And crucially, that low end isn’t muddy or boomy. Everything about this speaker is rich and clear. That’s even more surprising when you consider that it only supports the baseline SBC Bluetooth codec instead of AAC or the more advanced LDAC. And yet, this speaker sounds excellent. </p><div id=\"EIs6iJ\"><div data-anthem-component=\"productcard:11142055\"></div></div><p id=\"C1TSD0\">You can expect around 12 hours of battery life, and like many other speakers in this guide, the SoundLink Flex is rated IP67 for dust and water resistance. Bose is very confident it can withstand tumbles and swims. Whether you lay the speaker flat or stand it upright, the Flex will automatically optimize the EQ for either orientation. And it also works better than most as a speakerphone with the help of built-in mics. Not everything about the SoundLink Flex is ideal: its buttons aren’t easy to use by feel alone, and it’s strange that Bose opted to go with Bluetooth 4.2 instead of a newer version of the spec. But if those are my biggest gripes, it’s fair to say that the SoundLink Flex is a winner. </p><hr class=\"p-entry-hr\" id=\"gvAtZr\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/MOd6Q1nWGi9CSl1cj_Lt-zj3Puk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13123803/vpavic_180918_2955_0015.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The UE Boom 3 remains a popular Bluetooth speaker several years after release.</em></figcaption>  </figure></div><h1 id=\"fqzDVU\">2. UE Boom 3</h1><h3 id=\"HYurbZ\">Best waterproof Bluetooth speaker</h3><p id=\"PO0Lwv\">It’s frankly a little mind-boggling that I’m still writing about the UE Boom 3 in 2022. This speaker was released in 2018, and Ultimate Ears has been coasting on it ever since. Maybe that says something about how stagnant the Bluetooth speaker market has become, or maybe UE just hasn’t come up with anything that outshines the $149.99 Boom 3 in a meaningful way. Or maybe it’s just a testament to how good of a portable speaker the Boom 3 is.</p><div id=\"0PNxJu\"><div data-anthem-component=\"productcard:11142074\"></div></div><p id=\"7XMgFV\">The company considers this the “perfected” take on the cylindrical, 360-degree speaker design that it pioneered with earlier Booms. And with 15-hour battery life, a fully waterproof exterior that floats in swimming pools, and those giant, foolproof volume buttons, the UE Boom 3 still holds up. Its standout feature compared to older models <a href=\"https://www.theverge.com/circuitbreaker/2019/7/22/20703600/ue-boom-3-magic-play-pause-button-bluetooth-speaker\">is the Magic Button</a>, which lets you quickly play a specific playlist with a press and hold of the top button. But what’s given the Boom 3 such staying power is its simplicity, rugged build, and satisfactory sound. Having drivers fire in all directions makes for an expansive soundstage, even if the Boom 3 can lack the detail and sharpness of some competitors. But as an all-rounder, there’s a lot to like.</p><hr class=\"p-entry-hr\" id=\"FbV0oq\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ORZBUs5UAHQfPO5KtvUNUWlvfqY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22422266/RoamFrame.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>The Sonos Roam has big smarts for a small speaker.</em></figcaption>  </figure></div><h1 id=\"o2Yaky\">3. <a href=\"https://www.theverge.com/22368487/sonos-roam-bluetooth-speaker-review-features\">Sonos Roam</a></h1><h3 id=\"34raDK\">Best Bluetooth smart speaker </h3><p id=\"oZrPFR\">It’s important to keep your expectations reasonable if you’re looking at buying the Sonos Roam. The company’s larger speakers often deliver audio performance that sounds bigger and more spacious than you’d expect, but that’s not necessarily true of the tiny Roam. Don’t get me wrong: while it’s not going to blanket a room with music, it’s more than capable of putting out clear, dynamic sound if you’re sitting nearby or using it as a shower speaker. </p><div id=\"cqwrik\"><div data-anthem-component=\"productcard:11142113\"></div></div><p id=\"Gw0WrG\">The real selling points of the Roam are its smarts and tight integration with Sonos’ whole-home audio platform. When at home, the Roam streams music over Wi-Fi, so you’re getting better fidelity than Bluetooth. You can seamlessly hand off playback from the Roam to another nearby Sonos speaker with the press of a button, and it’s a cheap way of adding a turntable to your Sonos system — so long as your turntable supports Bluetooth. You can also easily group it with other Sonos speakers for multi-room playback. If you want to use the Roam as a smart speaker, take your pick between Amazon Alexa or Google Assistant for hands-free voice commands.  </p><p id=\"NmBBiD\">Sonos recently released a slightly cheaper Roam SL that omits the built-in microphones. But unless you’re adamantly opposed to having mics in your gadgets, I’d steer clear of the Roam SL. It only saves you $20 but loses fairly substantial features like automatic Trueplay sound quality tuning, the Sound Swap feature mentioned above, and (obviously) all voice interactions. For $99 or $129, I could absolutely see it. But $159 is just too much to ask for the Roam SL.</p><hr class=\"p-entry-hr\" id=\"5T1FRt\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QLk3qLdAF1VDdf-R3fbsvXdrlgg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382986/cwelch_220410_5136_0003.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>JBL’s Charge 5 is a perfect kitchen speaker.</em></figcaption>  </figure></div><h1 id=\"V57NKZ\">4. JBL Charge 5</h1><h3 id=\"fNvZtA\">Bluetooth speaker with the best battery life</h3><p id=\"qS9oiT\">If you’re looking for something a little more powerful, JBL’s Charge 5 is beefier than the UE Boom in terms of both dimensions and audio reproduction. I’m not a fan of JBL putting a super-sized logo on its newest speakers; so much for subtlety. But if you don’t mind that aesthetic decision, the Charge 5 ticks off many boxes for functionality. </p><p id=\"JTOcuF\">It’s a stamina champ with up to 20 hours of continuous playback. Speaking of batteries, a unique trick offered by the Charge 5 is its ability to recharge external devices: there’s a USB-A port for topping up your own phone or a friend’s as you listen to tunes. </p><div id=\"bvFDkL\"><div data-anthem-component=\"productcard:11142127\"></div></div><p id=\"IqAPwC\">My main disappointment with the Charge 5 is its mono driver, which has to downmix stereo content. When you’re dealing with mono portable speakers, there might be sections of a song or particular instruments that aren’t as prevalent as they are on stereo speakers. And since the Charge 5 doesn’t sound quite as pristine and detailed as Bose’s SoundLink Flex, it’s more noticeable here.</p><hr class=\"p-entry-hr\" id=\"6X4fow\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7x7JDMJWN-nhzS5NEB_qQsRLFs0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385556/DSCF1244.jpg\">      <figcaption><em>The Sony SRS-XB43 mixes powerful sound with flashy lights.</em></figcaption>  </figure></div><h1 id=\"vQoUy2\">5. Sony SRS-XB43</h1><h3 id=\"MpIYwS\">Best Bluetooth speaker for outdoor parties</h3><p id=\"B08cU1\">Sony’s SRS-XB43 gives you powerful stereo sound with deep, resounding bass. Plus, you get a light show to go along with the music. This speaker is more than capable of handling the soundtrack to an outdoor party — especially if you enable its Extra Bass mode. </p><div id=\"GYFqeg\"><div data-anthem-component=\"productcard:11142138\"></div></div><p id=\"K19Jw9\">It also has an aux jack (a rarity among the picks here), so anyone can plug in and play audio if you don’t want to deal with Bluetooth. But if you do, the XB43 also supports Sony’s LDAC codec, and like JBL’s Charge 5, there’s a USB-A jack on the back for juicing up your gadgets. </p><p id=\"zGuL0R\">The headphone jack is a goner on most phones these days, and sadly the aux input is also increasingly disappearing from many Bluetooth speakers. But this one gives you the best of everything. It weighs six and a half pounds, so this isn’t a speaker you’ll be casually tossing in your bag. But it’s tailor-made for use around the house and for parties. And yes, you can download an app and take full control of the lights. </p><hr class=\"p-entry-hr\" id=\"d0uk2a\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gUxyZiYFTKshev3vKBn_DqVd2lg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382993/cwelch_220410_5136_0010.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>JBL’s Clip 4 can latch onto a bag or backpack with ease.</em></figcaption>  </figure></div><h2 id=\"vOFxNW\">6. JBL Clip 4</h2><h3 id=\"XlXlLk\">Best small Bluetooth speaker</h3><p id=\"JmrFEb\">The Clip 4 from JBL is actually a bit larger than I would’ve expected when looking at marketing images. But the integrated carabiner makes it effortless to attach to your bag, bike, and who knows what else. I was pleasantly surprised by the sound this compact speaker can produce. </p><div id=\"J48RYN\"><div data-anthem-component=\"productcard:11142141\"></div></div><p id=\"H171uh\">The bass is a little recessed, but the Clip 4 puts out clear and crisp mids and treble. Like our other picks, it’s rated IP67 for dust and water resistance. Combined with its diminutive size and 10-hour battery life, you’re looking at a great speaker for bringing along on hikes or other adventures. </p><hr class=\"p-entry-hr\" id=\"tbxBWg\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AA9HyxbPdU-iSVH-UKuxYxhH9RI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19208410/dseifert_190915_3647_0009.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>The Sonos Move combines good sound with whole-home audio integration.</em></figcaption>  </figure></div><h1 id=\"Gqqjjl\">7. <a href=\"https://www.theverge.com/2019/9/18/20871409/sonos-move-wireless-bluetooth-speaker-review-alexa-google-assistant-wifi-price-specs-sound-quality\">Sonos Move</a></h1><h3 id=\"AYzqPN\">Best large Bluetooth speaker</h3><p id=\"RDUX8f\">At 6.61 pounds, the Sonos Move is a hefty thing to lug around. That’s why it’s mainly intended to be moved around the house or out to the backyard. It’s not what I’d consider convenient, but in exchange for putting up with a much bigger speaker than the Roam, you’re rewarded with a substantial sound upgrade.</p><div id=\"6KMOqv\"><div data-anthem-component=\"productcard:11142195\"></div></div><p id=\"SXvDpk\">The Move is more than capable of filling a room with resonant audio, and like the Roam, you get your choice of using it like a regular Bluetooth speaker or playing music over Wi-Fi with the Sonos app. With an IP56 dust and water resistance rating, the Move is designed to be weatherproof, and it’s able to withstand some bumps. You’d hope for as much considering this speaker’s $400 price tag. But when you add in extras like hands-free voice controls and automatic Trueplay, the Move has a large bag of tricks that make it a unique choice if you’re after a larger, louder speaker.</p><p id=\"9eHIEh\"></p><p id=\"xUB4nq\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Lfsby_JJJZhoZE8luKDvQFCC3NE=/0x279:2040x1347/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382990/cwelch_220410_5136_0007.jpg",
  "description": "Sound quality and durability have never been better.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}