{
  "title": "The mashup of an M1 and G4 is the whimsical Apple desktop I want",
  "url": "https://www.theverge.com/2022/3/14/22973567/m1-imac-g4-mod-apple-desktop-computer-project",
  "date": "2022-03-14T19:20:59.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QAzhF1Pjm6Q1xjXkNLldzAtUKNs=/0x0:2000x1333/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70621835/9F33374D_FC91_4816_85F3_50D4E581D2C4.0.jpeg\" />        <figcaption><em>The modder behind the project went all the way for the peak early 2000s aesthetic.</em> | Image: Connor55 on MacRumors</figcaption>    </figure>  <p id=\"UndMzW\">Apple is releasing <a href=\"https://www.theverge.com/2022/3/8/22962081/apple-mac-studio-m1-max-ultra-price-specs-processor-release-date\">cool new desktop Macs again</a>, but people are still doing plenty of fun projects using older Apple machines. A fun example that we spotted recently (h/t <a href=\"https://www.inputmag.com/design/modder-hacks-imac-g4-m1-mac-mini-fully-functional\"><em>Input</em></a>) was this mod by someone named Connor, who took the internals of an M1 Mac Mini and put them into one of Apple’s most iconic desktops, the iMac G4.</p><p id=\"PvdQuq\">As Connor shows <a href=\"https://www.youtube.com/watch?v=neO_Svu5Dbc&amp;t=9s\">in a YouTube video</a>, the G4 still has all of its original functionality after his mod — it can play DVDs from an internal drive (though they did have to swap out the original one, which <a href=\"https://www.xlr8yourmac.com/systems/iMac_g4/imacg4_takeapart.html\">connected using IDE</a>) — and at first glance, it hasn’t been changed at all. But with the screen on, it’s obvious the computer is running the modern macOS Monterey, instead of OS X 10.5 Snow Leopard, the last operating system that officially supported the G4’s original hardware. </p><div id=\"XvSS1C\"><div ><iframe src=\"https://www.youtube.com/embed/neO_Svu5Dbc?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"tQCEvy\">Connor is far from the first person to mod the iMac G4. Their post even cites <a href=\"https://forums.macrumors.com/threads/imac-g4-with-m1-chip-success.2315757/\">another <em>MacRumors</em> user</a> who did an M1-based G4 build and gives credit to <a href=\"http://www.dremeljunkie.com/2011/08/guide-step-by-step-17-imac-g4-tmds-to.html\">a guide</a> from the (oft-cited in the Mac modding community) Dremel Junkie. Searching YouTube reveals that plenty of others have done G4 mods. You’ll find a few Hackintosh PC builds, a Raspberry Pi-based arcade machine, some upgrades and restorations, and even someone who’s <a href=\"https://www.youtube.com/watch?v=NjC6rv6b0ls\">turned it into an external display</a>. <em>The Verge </em>has even made one — one of our producers, Creighton DeSimone, modded a G4 using a Surface tablet so hosts of a live YouTube show could use it. </p><p id=\"O9UCbA\">It’s no wonder people are drawn to doing fun things with this computer. It’s got a unique design (as long as you’re not comparing it to <a href=\"https://www.youtube.com/watch?v=b5P3QDm61go\">lamps</a>), but its internals are old enough that you’re not risking a lot by tearing it apart.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nUq22oj_zvFp9OoNH2JU2NY6O7Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23315374/tempImagemy9Mmz.png\">      <cite>Image: Connor55</cite>      <figcaption><em>There’s a lot going on in the base of this G4.</em></figcaption>  </figure><p id=\"wyAzLa\">To me, though, Connor’s build is the gold standard when it comes to doing this kind of mod. It keeps fun things like the CD drive and screen from the original, while updating the parts that were old and creaky, like the actual computer and I/O. They’ve also posted an incredibly in-depth look into their process over on <a href=\"https://forums.macrumors.com/threads/imac-g4-to-m1-conversion-progress.2329778/\">the <em>MacRumors</em> forum</a>, so if you’re interested in all the blood, sweat, and complicated electronics work that went into this mod, be sure to give it a look.</p><p id=\"GKGmak\">When I dropped this mod in our Slack, <em>Verge</em> editor-in-chief Nilay Patel responded “I want this so bad.” I totally agree, but given just how much work went into making it, I think I’ll stick to admiring it on YouTube for now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PvDMtfDnZa9QWuw535tXExajtH4=/0x101:2000x1148/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23308277/9F33374D_FC91_4816_85F3_50D4E581D2C4.jpeg",
  "description": "How many M1 computers have an internal DVD drive?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}