{
  "title": "The IRS will use Login.gov in the future, but for this tax season, video interviews are here to stay ",
  "url": "https://www.theverge.com/2022/2/22/22946108/irs-login-gov-id-me-tax-season-facial-recognition",
  "date": "2022-02-22T19:41:38.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/E5z6lD3a0jqKxfxrV0jVMW6wAY8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70537750/acastro_210512_1777_deepfake_0001.0.jpg\" />    </figure>  <p id=\"ceHBRj\">Two weeks after dropping a controversial facial recognition plan, the IRS has given new details about how it plans to replace the system. <a href=\"https://www.irs.gov/newsroom/irs-statement-new-features-put-in-place-for-irs-online-account-registration-process-strengthened-to-ensure-privacy-and-security\">In a statement on Monday</a>, the agency confirmed that all users of the IRS.gov website will be able to opt out of biometric data collection, offering video interviews as an alternative for this year’s filers and promising a shift to the government-run authentication system Login.gov service in the future.</p><p id=\"TReYbC\">“[A] new option in the agency’s authentication system is now available for taxpayers to sign up for IRS online accounts without the use of any biometric data, including facial recognition,” the statement said. “This is consistent with the IRS’s commitment earlier this month to transition away from the requirement for taxpayers creating an IRS online account to provide a selfie to a third-party service to help authenticate their identity.”</p><p id=\"byivPC\">The implementation of the opt-out feature follows weeks of intense criticism from both legislators and the general public alike, spurred by the IRS’s January announcement that facial recognition scans <a href=\"https://www.theverge.com/2022/1/20/22893057/irs-facial-recognition-taxes-online-idme-identity\">would be a pre-requisite for accessing tax information</a> through the IRS.gov website.</p><p id=\"pttpEW\">In the face of the backlash, the tax agency <a href=\"https://www.theverge.com/2022/2/7/22922212/irs-id-me-facial-recognition-end-privacy-concerns\">abandoned its initial plans</a> to use facial recognition services provided by identity verification company ID.me, an apparent victory for facial recognition critics.</p><p id=\"HGUelx\">Per the latest announcement, in the future, the IRS will be transitioning to the use of <a href=\"https://login.gov/\">Login.gov</a> for the creation of online taxpayer accounts. Developed by the government, Login.gov is a secure sign-in service for accessing government services, although it does not perform the same kind of identity verification techniques employed by ID.me.</p><p id=\"WWJI44\">But with tax filing deadlines approaching, the Login.gov system cannot be rolled out fast enough or securely enough to authenticate taxpayers submitting returns ahead of the 2022 filing date.</p><p id=\"7uK5HL\">In the meantime, the IRS said, it will employ a “short-term solution” whereby taxpayers who do not wish to submit to biometric data collection can verify their identity through a live virtual interview.</p><p id=\"aZk4F2\">In practice, this means that taxpayers will still be interacting with ID.me’s services but through a human video reviewer rather than a facial recognition system. However, it is unclear how long online account users should expect to wait to access the human review process. Benefits claimants forced to use the service have frequently complained of long wait times, with ID.me’s own video review staff <a href=\"https://www.theverge.com/2022/2/11/22928082/id-me-irs-facial-recognition-overworked-employees\">enduring high performance quotas and stressful working conditions</a> in order to meet demand.</p><p id=\"XoTfkL\">The IRS did not respond to a request for comment by time of publication.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jdGuVNONb3nGrflkDgDm1yCevRo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22512649/acastro_210512_1777_deepfake_0001.jpg",
  "description": "A \"short-term solution\" will let taxpayers request human video reviews.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}