{
  "title": "The US has sanctioned the head of Russia’s largest social network",
  "url": "https://www.theverge.com/2022/2/26/22951307/us-sanctions-russia-vk-ceo-vladimir-kiriyenko",
  "date": "2022-02-26T13:53:04.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/cm9wz0DSaolX-i6EaQ1YhfA6g_g=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70553873/acastro_180608_1777_net_neutrality_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"t21gcJ\">On Thursday, following Russia’s invasion of Ukraine, the Biden administration imposed sweeping sanctions on Russian banks, energy and infrastructure companies, and a number of individual Russian elites.</p><p id=\"xAv5kf\">The US Department of the Treasury provided the full list <a href=\"https://home.treasury.gov/news/press-releases/jy0602\">in a press release</a>, which divided sanctioned entities into two categories: “major Russian financial institutions” and “elites and families close to Putin.”</p><p id=\"6p5DQ0\">Among the sanctioned individuals is Vladimir Kiriyenko, CEO of VK Group, the parent company of Russia’s biggest social network VKontakte. While he isn’t being sanctioned specifically for his work with the VK group, the result still forbids one of the country’s most powerful tech executives from doing business with any US entity.</p><div class=\"c-float-right\"><aside id=\"3gIZgL\"><q>The result forbids one of the country’s most powerful tech executives from doing business with any US entity</q></aside></div><p id=\"d3sbs7\">Though it does not operate on the global scale of Facebook, VK — originally known as VKontakte — is the dominant social media platform in Russia. It claims to have around 70 million monthly active users, making it roughly a quarter of the size of Twitter; and the vast majority of these accounts post in Russian from within Russian geographic borders.</p><p id=\"oDtf7m\">Kiriyenko wasn’t a Vkontakte founder: in fact, his association with the company only dates back to 2021. But his leadership of the company represents the final twist in a saga that has seen the social network steered away from a platform committed to privacy and free expression, into one much more likely to tow Putin’s party line.</p><p id=\"wtkO2D\">Vkontakte was created in 2006 by Pavel Durov, who was just 22 years old at the time. Its rapid success — driven by hunger for a homegrown alternative to Facebook — earned Durov the nickname of “Russia’s Mark Zuckerberg.” But in 2014, Durov was pushed out of his position as CEO in a conspiracy-filled case that included <a href=\"https://www.washingtonpost.com/news/worldviews/wp/2013/05/06/the-strange-conspiracy-filled-case-of-russias-mark-zuckerberg/\">disputed allegations of a hit-and-run incident</a> involving a police officer, followed by an attempted hostile takeover in which an investment fund belonging to Ilya Sherbovich, a Russian businessman and Putin ally, <a href=\"https://www.theguardian.com/world/2013/apr/18/russian-internet-social-media-network\">secretly acquired 48 percent of the company</a>.</p><p id=\"wl7Fmn\">Durov placed the blame for his ouster squarely with the Russian government. “I’m afraid there is no going back [to VK],” he <a href=\"https://techcrunch.com/2014/04/22/durov-out-for-good-from-vk-com-plans-a-mobile-social-network-outside-russia/\">told TechCrunch</a> at the time, “not after I publicly refused to cooperate with the authorities. They can’t stand me.”</p><p id=\"H4bTJn\">The entrepreneur subsequently <a href=\"https://www.reuters.com/article/russia-vkontakte-ceo/russias-vkontakte-ceo-says-he-was-fired-flees-russia-idUSL6N0NE1HS20140422\">fled Russia</a> and began to focus on a new project: the encrypted messaging app Telegram, which he had <a href=\"https://techcrunch.com/2013/10/27/meet-telegram-a-secure-messaging-app-from-the-founders-of-vk-russias-largest-social-network/\">launched in 2013</a>. From the start, Telegram espoused a more robust attitude to privacy and free expression, driven by Durov’s experience of censorship in Russia. </p><p id=\"889VQM\">Durov first rejected <a href=\"https://www.nytimes.com/2016/09/06/world/europe/telegram-isis-privacy-encryption.html\">requests from French authorities</a>, and later <a href=\"https://www.rferl.org/a/telegram-durov-russia-fsb-encryption-keys-security/28760575.html\">pressure from Russia’s FSB security service</a>, to put a “back door” into the encryption that would let governments eavesdrop on encrypted messages. Russian telecoms companies were ordered to block Telegram within the country, but largely failed. The Russian government eventually <a href=\"https://www.atlanticcouncil.org/blogs/new-atlanticist/whats-behind-russias-decision-to-ditch-its-ban-on-telegram/\">gave up in 2020</a>, by which point it was already being used as an official communication channel for many government agencies. In neighboring Ukraine, it has enjoyed similar adoption as a tool for both personal and <a href=\"https://covid-19.ebscomedical.com/ukraine-health-ministrys-telegram-page-live-updates\">official communications</a>.</p><p id=\"4RXsMC\">Meanwhile, leadership of VKontakte was taken up by Boris Dobrodeyev, formerly the deputy chief executive of the company. Dobrodeyev maintained the CEO position until 2021, when a restructure of parent company Mail.ru — the Russian digital services provider which owned the other 52 percent of shares in Vkontakte — brought the entire company under the VK brand. Vladimir Kiriyenko was <a href=\"https://www.reuters.com/article/russia-vk-idCNL8N2SO3IY\">appointed the new CEO</a> shortly afterward in December 2021, following Dobrodeyev’s resignation.</p><p id=\"lIQTkF\">Kiriyenko, 38, has previously occupied a senior executive position at Rostelecom, Russia’s national telecommunications operator. Before that, he held board chairman positions at a telecommunications company, bank, and investment company — a function of his status as the son of Sergei Kiriyenko, the former prime minister of Russia under Boris Yeltsin, and now first deputy chief of staff in the Putin administration. (Sergei Kiriyenko also appears as a named individual under the elite sanctions list.)</p><p id=\"eT0Wsq\">Under the leadership of a regime insider like Vladimir Kiriyenko, it’s hard to imagine that VK would host content critical of the Putin government, or take any of the stands for privacy that Durov’s Telegram has been willing to adopt.</p><p id=\"UvtuPq\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/e3dw5zihPBrogeythiPF7Sp54ms=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11515901/acastro_180608_1777_net_neutrality_0001.jpg",
  "description": "He’s forbidden from doing business with any US entity.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}