{
  "title": "The best robot vacuum you can buy right now",
  "url": "https://www.theverge.com/22997597/best-robot-vacuum-cleaner",
  "date": "2022-03-31T14:39:39.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Pu5ZeNJJutVNZgb9bdp1DNshxtA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70693925/VRG_ILLO_5103_RobotVacuum_Guide.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>These wonderful little robots do all the hard work for you</p> <p class=\"p--has-dropcap p-large-text\" id=\"wlBADN\">The best robot vacuums are impressive devices that will clean your floors well without complaining (much). They’ve largely shaken off the category’s early reputation for running out of juice halfway through a job, missing large swaths of your floor, or losing a battle with a chair leg. Today’s robo vacs know when to go back to their base to recharge, and if they do get stuck, can call for help. </p><p id=\"7fMJfm\">Many models can also map your home using variations on a technology called simultaneous localization and mapping (SLAM), so they won’t miss spots, plus you can tell them exactly where you want them to go <em>and</em> where not to bother. Thanks to Wi-Fi connectivity, they can be commanded by a smart voice assistant as well as an app. Some robots have even devised ways to prevent getting stuck on common robot traps such as cables and socks. And yes, a few can even identify when your precious pet made a whoopsie and <a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\">avoid smearing it all over your rug. </a></p><p id=\"SH5MEn\">The latest and greatest robot vacuum invention is the auto-empty dock. This turns the charging base for your robot into a motorized empty station, which sucks out the dirt from its bin so you don’t have to empty it for weeks on end. (Warning: this process is very loud!) It’s not <a href=\"https://thejetsons.fandom.com/wiki/Rosey\">Rosie the Robot</a> yet, but it feels like we’re not too far away.</p><p id=\"rPWAQ7\">However, not all of these busy little bots are created equal, and you’ll pay more for those with whizz-bang features that make your life a little easier. Robot vacuums range in price from under $200 to well over $1,000, so there’s a bot for every budget. Whether you have a 3,000-square-foot home to clean and three shaggy dogs or a small, stylish apartment you share with a goldfish, there’s a robot vacuum to suit your needs.</p><div id=\"EJ3ZSW\"><div data-anthem-component=\"table:11115368\"></div></div><h1 id=\"S85h3x\"></h1><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PGxKY_aHxbe9ALrZuSe5MECRJf4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23163830/vtuohy_211029_4963_0014.jpg\">      <figcaption><em>The Roomba j7 is a superb vacuum that looks good (for a vacuum) and works well. You can get the robot on its own or with iRobot’s Clean Base auto-empty dock.</em></figcaption>  </figure></div><h2 id=\"wBwFmA\">1. <a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\">Roomba j7</a></h2><p id=\"9cNwJz\"><em>Best robot vacuum overall</em></p><p class=\"p--has-dropcap\" id=\"ehrHqq\"><a href=\"https://www.amazon.com/iRobot-Roomba-Self-Emptying-Robot-Vacuum/dp/B094NYHTMF?ots=1&amp;slotNum=7&amp;imprToken=aebfe11c-816c-1f65-4d5&amp;tag=theverge02-20&amp;ascsubtag=%5B%5Dvg%5Bp%5D22644393%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD\" rel=\"sponsored nofollow noopener\" target=\"_blank\">iRobot’s Roomba j7</a> is the best of the best right now, offering excellent cleaning power, an impressive app, plenty of extra features, and a really nice design for $600. While it’s a steep price tag, this is the first Roomba with AI obstacle avoidance, which means it uses both a camera and some processor-powered smarts to see and avoid potential obstacles such as power cables, shoes, socks, and pet waste. The real benefit here is that you don’t have to tidy up before you run your vacuum (although cluttered floors won’t get as clean). It also means it rarely gets stuck during a job, so you won’t come home to a beached bot and a half-clean house.</p><p id=\"DJnLT0\">Stepping it up a notch, and for $200 more, you can take away the chore of having to empty its decent-sized bin by investing in the j7 Plus, the robot vac plus an auto-empty dock. This is one of the most reliable, nicest-looking auto-empty docks I’ve tested. The design is compact with some welcome aesthetic touches, such as ribbed matte black plastic casing and a leather pull tab to access the bin area, so it doesn’t look too alien in your home.</p><div id=\"LNSslD\"><div data-anthem-component=\"productcard:11115278\"></div></div><p id=\"e4zMH8\">The Roomba j7 is a mapping robot that can not only learn your home’s floor plan but also identify the furniture and appliances in it. This lets you ask the robot (using the app or a voice assistant) to clean specific areas, such as in front of the fridge or behind the couch. Most mapping robots also allow you to create virtual keep-out zones in the app, areas the robot shouldn’t venture. Combined with its AI smarts, this Roomba can even suggest trouble spots for you in the app, so you can create a keep out zone with just a tap.  </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1QJfuG8VegQiacijNdeUiIMt5Mg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23163827/vtuohy_211029_4963_0011.jpg\">      <figcaption><em>The j7 uses two rubber roller brushes and a large side brush.</em></figcaption>  </figure><p id=\"Z7Vg3O\">A feature I really like is that you can link the robot to other smart devices in your house to send it cleaning when you lock your front door or close your garage on your way out. It also works with Amazon’s Alexa to start running when you leave (using geolocation) and stop when you arrive home — so you never even have to think about it. If you want to run it on a regular schedule, the app can handle that, too.</p><p id=\"lk3Aao\">If you are looking for the best clean for your buck and want to avoid the possibility that the robot won’t finish its run because of a stray piece of clutter, the Roomba j7 is the one to go with. Its cleaning prowess is largely unmatched thanks to iRobot’s decades of experience in this space, and it’s one of the easiest robot vacuums to use. The app is simple and uncluttered, with <a href=\"https://www.theverge.com/2022/3/17/22982578/irobot-software-update-roomba-robot-vacuums\">new features added frequently</a> (Siri support just arrived this month). </p><p id=\"xTwWlw\">The biggest potential downside is that all Roombas are quite noisy — the loudest in my testing — and there’s no option for a quieter cleaning mode. But I do like how easy Roomba’s are to repair, a crucial factor for an expensive gadget you’d like to use for many years. While parts are costly, they are readily available (which is not the case for many of the other bots I tested). You can basically rebuild your bot if needed, making this an investment that should last a long time.</p><p id=\"AxYZVE\">You can read my full <a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\">review of the Roomba j7 Plus here</a>, where I put it head-to-head with <a href=\"https://www.amazon.com/SAMSUNG-Recognition-Intelligent-Touchless-Navigation/dp/B0912TLG7T?ots=1&amp;slotNum=8&amp;imprToken=c6bfed8e-6671-e00a-0a5&amp;ascsubtag=%5B%5Dvg%5Bp%5D22644393%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Samsung’s Jet Bot AI Plus robot vac</a>, which shares similar features.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/y3nw3l5A0PdMnlVnmLKeyVS6ixI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342419/jtuohy_220323_5101_0005.jpg\">      <figcaption><em>With an impressive battery life, big bin, and some navigational smarts, the Roborock E4 is a great budget bot.</em></figcaption>  </figure></div><h1 id=\"q7EwSd\">2. <a href=\"https://www.amazon.com/Roborock-E4-Cleaner-Internal-Suction/dp/B0825NN2FM?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Roborock E4</a></h1><p id=\"dJDGUM\"><em>Best robot vacuum on a budget</em></p><p class=\"p--has-dropcap\" id=\"e5nOQY\">At $300 (and often available for less), this is the least amount you can spend on a bot and get a decent experience. Yes, there are cheaper options, but those are mainly what are known as “bump and roll” bots. They roll until they bump into something, then trundle off in another direction. This also means they often miss spots. The Roborock E4 uses a dual gyroscope and OpticEye sensor system to navigate your home by “feel.” It moves in a somewhat methodical pattern that covers all the ground it can reach. </p><p id=\"2PQfGM\">The E4 also packs a powerful 5,200mAh battery, the same found in the higher-end Roborock S7 and unheard of in robots in this price range, allowing it to run for about 200 minutes. Its closest competitor for this spot, the Yeedi k650, only goes for 130 minutes. Since most bots can recharge and resume, run time isn’t as big of a deal as it once was. But it’s still more convenient if your bot can get the job done in one go.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DhCku_ies71Jo9dvydcsb9e9zEQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342420/jtuohy_220323_5101_0006.jpg\">      <figcaption><em>The Roborock E4 uses a hybrid rubber / bristle brush and a side-sweeping brush. </em></figcaption>  </figure><p id=\"fa2myP\">As with most budget robot vacuum cleaners, there are no mapping features, so if you need to create keep-out zones — and a door won’t work — you’ll have to purchase some magnetic tape to create a barrier. The Roborock E4 also has an impressively large 640-milliliter bin and four suction levels (silent, balanced, turbo, and max), so you can run it for a light clean without much noise. It’s compatible with Google Home and Amazon’s Alexa. But without mapping, voice commands are limited to start, stop, and pause. You can also add a mopping pad to this bot. It costs extra and, with a small 180ml reservoir, it’s not an effective substitute for a proper mop. But it will help get up any fine dust the robot’s suction action missed. </p><div id=\"N9K0LN\"><div data-anthem-component=\"productcard:11115332\"></div></div><p id=\"6CB5OE\">If you need a basic bot that will get the job done and don’t mind ditching the fancy features of the higher-end models, this is a good option. It’s a powerful robot that rarely got stuck in my testing, even on my high-pile, fluffy, tasseled living room rug I’ve nicknamed the robot killer. It could also tackle most transitions with ease. The biggest downside is that, instead of using the very good Roborock app, for some reason you are stuck with Roborock’s parent company Xiaomi’s Mi Home app. But the app does let you add schedules, set a do-not-disturb period, and play with a few other features, which is really all you need to get the job done. </p><p id=\"8JK5hB\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/A253H-C5qhGHp3vkSoe--BOICwU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23194360/jtuohy_220120_4984_0012.jpg\">      <figcaption><em>The Roborock S7 is a great vacuum that can also mop well.</em></figcaption>  </figure></div><h1 id=\"2bJaTr\">3. <a href=\"https://www.theverge.com/22901270/roborock-s7-plus-robot-vacuum-and-mop-review\">Roborock S7</a></h1><p id=\"mVjlct\"><em>Best robot vacuum / mop hybrid</em></p><p class=\"p--has-dropcap\" id=\"L8LKPr\">The hot thing in robot vacuums a few years ago was sticking a cloth attached to a tiny liquid reservoir underneath the bot and calling it a mopping robot. These were very ineffective at mopping, and they took away from the capacity of the dustbin, a key feature if you don’t have an auto-empty dock. Then the <a href=\"https://www.amazon.com/Roborock-S7-Mopping-Auto-Empty-Multi-Level/dp/B08VHXZZ22?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Roborock S7</a> ($650) came along and changed the game. </p><p id=\"zbcZX3\">This hybrid vacuum / mopping robot really does do both jobs well because Roborock designed a mop that not only vibrates 3,000 times a second to simulate some good old-fashioned scrubbing but also made room for an extra-large water tank so the mop can get wet enough to be effective. It also has an ingenious “VibraRise’’ feature that lifts up the mop a few millimeters when it senses carpet, meaning you don’t get a damp rag dragged over your living room rug. You also don’t have to worry about swapping out the mopping pad when you just want to vacuum. It is limited to very low-pile rugs, however, so the S7 has an option to set a no-mopping zone around any plush floor coverings you have. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/irJzk3Lq4EgArRqTcpFcIP794oQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23194352/jtuohy_220119_4984_0002.jpg\">      <figcaption><em>The Roborock S7 has a rubber brush, a side-sweeper, and a detachable mopping unit.</em></figcaption>  </figure><p id=\"g6zKkG\">You can use the Roborock as two separate robots — a vacuum and a mop — as it has a mop-only mode that moves in a tighter “Z” pattern and goes over the floors twice. I liked to send it out to vacuum everywhere first then recharge and go out again to mop, which resulted in sparklingly clean floors. It takes a while, though. My top pick, the Roomba j7, does work in combo with iRobot’s mopping robot, the Braava Jet M6. It also has the option of a self-emptying bin / dock, and iRobot sells this all as a <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fstore.irobot.com%2Fdefault%2Froomba-robot-vacuums%2Firobot-roomba-j7-self-emptying-robot-vacuum-and-braava-jet-m6-robot-mop-bundle%2Fj7plus_m6.html%3F_gl%3D1*1lbrubj*_ga*OTU5MzQwODYuMTY0NjMyNzM4NQ..*_ga_CX1FERKJKP*MTY0ODY0MDE5Ny4xOC4xLjE2NDg2NDAyNTguMA..%26_ga%3D2.71451283.1043183404.1648640198-95934086.1646327385%26_gac%3D1.261674495.1648315959.Cj0KCQjw8_qRBhCXARIsAE2AtRbS8yGa-rvcboFmMFTVL_jgKxu588qfZkaxD2TVj7XAA0Y941MuOQsaAjCoEALw_wcB&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22997597%2Fbest-robot-vacuum-cleaner\" rel=\"sponsored nofollow noopener\" target=\"_blank\">bundle for $1,200</a>. But that’s quite a jump from $950 for Roborock’s bin / dock combo.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/X9P1bth8pDmqZhl0ZdfqsMlfmss=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23194358/jtuohy_220119_4984_0008.jpg\">      <figcaption><em>The Roborock S7 Plus combines the robot vac with an auto-empty dock.</em></figcaption>  </figure><p id=\"AwCFLm\">The Roborock S7 is a mapping robot that uses lidar sensors to map your home in minutes. It also gives you the option of room-specific cleaning commands (with the app or voice control via Alexa, Google, or Siri) and allows you to set keep-out zones. This is essential as it doesn’t have AI obstacle avoidance, so will get stuck in regular robot traps such as clusters of cables. It also struggles with tight furniture footprints as it’s quite wide. The Roborock S7 works with Alexa Routines and can be set to run when you leave home, or you can use the app’s scheduling feature. </p><div id=\"beITDe\"><div data-anthem-component=\"productcard:11115293\"></div></div><p id=\"moZ09U\">The S7 is the best option for a bot that can actually mop at a semi-accessible price. It does require a bit more hands-on effort, though, since you have to refill the reservoir (it doesn’t warn you when it’s empty) and wash the mopping pads (you can throw them in the washing machine). There is a new Roborock model that cleans its own mop, <a href=\"https://www.theverge.com/22960447/roborock-s7-maxv-ultra-review-robot-vacuum-mop-hybrid\">but it costs $1,400</a> (see the section below “What about robot vacuum mops that can clean their mops and refill themselves?”).</p><p id=\"vGb63h\">For more details, read my <a href=\"https://www.theverge.com/22901270/roborock-s7-plus-robot-vacuum-and-mop-review\">full review of the S7 Plus here</a>.</p><p id=\"3GE5BA\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RO6dBEdPgoqNk7C_K5bzjEc6iEA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345006/jtuohy_220325_5101_0015.jpg\">      <figcaption><em>The Roomba i3 is the best value Roomba that can empty its own bin. </em></figcaption>  </figure></div><h1 id=\"QMgnup\">4. <a href=\"https://www.amazon.com/iRobot-Roomba-Wi-Fi-Connected-Vacuum/dp/B08C4JXBPF?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Roomba i3 Plus EVO</a></h1><p id=\"YcCZU5\"><em>Best robot vacuum that can auto-empty</em></p><p class=\"p--has-dropcap\" id=\"ffva7x\">While the Roomba j7 is the best bot if you want all the bells and whistles, the Roomba i3 Plus EVO ($550) is the best robot vacuum for a better price that also empties itself. You don’t get AI obstacle avoidance or app-enabled clean or keep-out zones, but you do get smart mapping (so you can control exactly which rooms it cleans and when) and a physical spot cleaning button that lets you do small areas on the fly. </p><p id=\"lIaOLt\">The mapping feature (<a href=\"https://www.theverge.com/2022/3/10/22967391/irobot-roomba-i3-update-smart-mapping\">which is a recent update</a>) allows you to set a schedule to clean only certain rooms or send it off at anytime to clean just the kitchen or living room. This helps make it less intrusive since it doesn’t try to clean the whole house on every run — meaning you’re less likely to find it sitting silently in a corner because an annoyed family member shut it off. However, it does take a long time to map your home initially (almost two hours for my downstairs), because iRobot uses its own navigation tech and not lidar, which most other mapping bots use to map in minutes. </p><p id=\"Db0ZIn\">The i3 Plus EVO is also iRobot’s most affordable self-emptying option. For $550, $250 less than the j7 Plus, you get the power of a high-end Roomba vacuum; it has the same suction level and similar battery life to the j7. You can also buy the i3 as a standalone vacuum for $350. However, it does have a tendency to bump into things more often than the j7, likely because it doesn’t have a camera on board. During testing, this resulted in a few toppled chairs, so this isn’t the right bot for you if you have delicate items like vases on pedestals. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RNVXAFs9FZPtI-mDon9sVZrzwRs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345007/jtuohy_220325_5101_0016.jpg\">      <figcaption><em>Just like the j7, the Roomba i3 uses two rubber brushes and a side brush. Unlike the j7, it has a spot cleaning button on the robot.</em></figcaption>  </figure><p id=\"OpOUZN\">Most other features are the same as the j7, including voice control with Alexa, Google, and Siri; scheduling; the option to create favorite cleaning routes; and integration with smart devices to tell your robot to get busy when you’re gone. The physical design is also very similar under the hood, with two multisurface rubber roller brushes to get more dirt up. These rubber brushes don’t get tangled by long hair the way bristle brushes can. Because there’s no option to add keep-out zones in the app, you’ll need to buy iRobot’s virtual walls if there are places you don’t want the robot to go. These are little towers that emit a 10-foot barrier or a 4-foot circle. They cost $99 for two, so if keep-out zones are important to you, it’s worth upgrading to the j7.</p><div id=\"hgxgUG\"><div data-anthem-component=\"productcard:11115335\"></div></div><p id=\"i8wILH\">The i3 has an attractive woven plastic gray top — a nice change from most of the shiny black plastic you find in this category (which is a magnet for dust, fingerprints, and scratches). It does still get stuck on common robot traps such as phone charging cables, cat toys, and, in my house, the skinny feet of a lounger chair. You do need to tidy up a bit before you set it free, but it does better with large cables and rug tassels than many other robots. (iRobot has an anti-tangle tech that makes the bot reverse course if it starts to get tangled.) This works pretty well for bigger items but, sadly, not phone charging cords.</p><p id=\"xaXMBL\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bZDFgXnNLDIVUO7xRY6i8rjVez4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345009/jtuohy_220325_5101_0018.jpg\">      <figcaption><em>The Shark AI Ultra XL is an excellent self-emptying robot with high-end features for a lower price.</em></figcaption>  </figure></div><h1 id=\"HUFg7A\">5. <a href=\"https://www.amazon.com/Shark-AV2501AE-Robot-Vacuum/dp/B08QZVSC8D?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Shark AI Ultra</a></h1><p id=\"glf6lG\"><em>Best midrange robot vacuum</em></p><p class=\"p--has-dropcap\" id=\"qC6B5G\">The latest vacuum from Shark is the company’s first that uses lidar mapping. This brings the level of this bot way up, making it much more reliable than some of Shark’s previous models. It’s also designed exclusively as a self-emptying bot. (You can’t buy it separately.) For only $650, you get most of the features of the high-end bots. </p><p id=\"rx1Pnh\">A mapping robot, the Shark has room-specific cleaning and app-enabled keep-out zones. It also has a handy Zones feature that lets you select areas of your house — say, half the living room and the hallway — to clean on a schedule. This is useful for regular, quick cleans in high-traffic areas and it doesn’t need to be set up every time you run it, as with some clean zone options.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_bg3dbHRW5OqeLWFGf6X9VeGVQU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23345011/jtuohy_220325_5101_0020.jpg\">      <figcaption><em>The Shark AI Ultra XL has a hybrid bristle brush Shark calls “self-cleaning,” and two side brushes.</em></figcaption>  </figure><p id=\"YVuuwk\">The Shark has both clean zones and keep-out zones — neither of which the Roomba i3 Plus has. If those features are important to you and the j7 Plus is a step too far, the Shark is a good option.</p><div id=\"CSmnI9\"><div data-anthem-component=\"productcard:11115341\"></div></div><p id=\"3hr5d5\">The downside is that this robot is loud. It rattles terribly as it rolls around and is super distracting — you want to be far away when this is doing its job. The design is also flashy and ugly: lots of chrome and shiny black plastic and a really obnoxious Shark logo. But the base is relatively compact, and it’s the only self-emptying robot I tested that doesn’t use bags. You just empty it over the trash bin, so cost-wise you don’t have to spend $20 every few months for extra bags (which is how much iRobot charges for a three-pack of bags).</p><p id=\"P4qz0S\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tskKNyOcf5J3UBoYt_ywAuMBjV4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342417/jtuohy_220323_5101_0001.jpg\">      <figcaption><em>This budget Deebot bot from Ecovacs is an excellent match for your furry beast.</em></figcaption>  </figure></div><h1 id=\"1KG3T0\">6. <a href=\"https://www.amazon.com/gp/product/B08F2S98DM/ref=ox_sc_act_title_1?smid=AMP860VP2CG0X&amp;psc=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Deebot U2 Pro</a></h1><p id=\"vdNvdA\"><em>Best robot vacuum for pet hair</em></p><p class=\"p--has-dropcap\" id=\"t5CL2x\">The <a href=\"https://www.amazon.com/gp/product/B08F2S98DM/ref=ox_sc_act_title_1?smid=AMP860VP2CG0X&amp;psc=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Deebot U2 Pro</a> is a monster. With a giant 3,200mAh battery that goes for 150 minutes and a huge 800ml dustbin, this is one of the best sub-$400 bots for pet owners. There’s no smart mapping, keep-out zones, or AI obstacle avoidance, but it has enough intelligence to go in straight lines and not bumble randomly around your home.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/K7Uxl9bfS0Ujw5LnCXUIxP2swh8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342418/jtuohy_220323_5101_0002.jpg\">      <figcaption><em>The Deebot U2 uses a bristle / rubber brush or a rubber brush, and has two side brushes.</em></figcaption>  </figure><p id=\"85WX3r\">Two things make it a great pet bot: the big bin and that it comes with a swappable bin / mopping pad. This means that, if your pup makes a mess, you can do a quick switcheroo and have it mopped up in a few minutes. (It has a spot cleaning mode in the app.) The second bin combines a 400ml dustbin with a 300ml water reservoir, which is unusually large for a budget bot. This ensures there’s enough water to get the grime up, and you can select different water levels in the app.</p><div id=\"NoGvgO\"><div data-anthem-component=\"productcard:11115321\"></div></div><p id=\"Bh5a85\">In addition to spot mode and the standard back-and-forth cleaning mode, you can opt for edge-only cleaning to get all that pet hair off your baseboards. The Deebot U2 also comes with a tangle-free silicone brush you can swap out with the standard bristle brush. In my testing, bristle brushes work better on carpet but are prone to getting tangled with fur. (A lot of bots come with a little cutting tool to help with this.) The silicone brushes are able to shake off the hair better, making them good for households with lots of pet hair.</p><p id=\"ZjwDMi\"></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Vxu-WnAxOu1d2Oy-w7UeGUeAGB8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342415/jtuohy_220318_5101_0003.jpg\">      <figcaption><em>The Eufy G20 Hybrid is a small, svelte robot vac that’s perfect for tackling smaller jobs with less fuss.</em></figcaption>  </figure></div><h1 id=\"czNCfG\">7. <a href=\"https://www.amazon.com/eufy-RoboVac-Navigation-Ultra-Slim-Compatible-dp-B09LHBZ6KB/dp/B09LHBZ6KB/ref=dp_ob_title_home?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Eufy G20 Hybrid</a></h1><p id=\"n8Qixm\"><em>Best robot vacuum for small spaces </em></p><p class=\"p--has-dropcap\" id=\"jW7WM4\">This small, practically silent robot is an ideal, inexpensive option for a cozy apartment or to use as a second bot for an upstairs space or home office. At $320 (or <a href=\"https://www.amazon.com/dp/B09LGZ6HV7/ref=emc_b_5_t?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$279 for the mopless version</a>), it lacks smart mapping features, has no smart obstacle avoidance, and only runs for 90 minutes. But it is the smallest and quietest vacuum I tested. </p><p id=\"6W4vmX\">Despite being a budget bot, it doesn’t partake in the classic bump and roll navigation, Instead, it uses gyroscopic navigation to divide the space into individual areas and clean each one methodically. It’s quite soothing to watch it go to work as it moves up and down in neat, rectangular boxes. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vWz7maK3QFmoA13o638R2nOO-wI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342416/jtuohy_220318_5101_0004.jpg\">      <figcaption><em>The Eufy G20 Hybrid has a bristle / rubber brush, a side brush (not pictured), and a mop pad. The G20 model doesn’t have a mop.</em></figcaption>  </figure><p id=\"OROb8D\">Slimness is a trademark of Eufy bots, as is a stylish, sleek design. If the competition are bulky SUVs, Eufys are the Porsches of the robot vacuum world. At 2.85 inches high, the G20 is the smallest robot vacuum I tested. Combined with whisper-quiet operation (66 decibels on the lowest suction level on hardwood floors), this makes it a good option if you’re looking for something to get under low furniture or run quietly while you’re working in your home office. </p><div id=\"rw7TdZ\"><div data-anthem-component=\"productcard:11115343\"></div></div><p id=\"3Smof4\">It also holds a decent amount of debris. The standard model has a large, 600ml dustbin, which can handle five or six runs’ worth of debris in a small space before you need to empty it. If you’re taking care of hardwood floors, the G20 Hybrid model swaps the 600ml debris bin for a 450ml bin, and has a 130ml mopping reservoir. This is not going to do much to mop your floors, but it does help with fine dust and debris. </p><p id=\"eKYBEI\">While not really a feature I consider essential for operation, the G20 has a remote control option in the Eufy Home app, which means it can also double as a fun cat toy.</p><p id=\"020ZZR\"></p><hr class=\"p-entry-hr\" id=\"r3ptRQ\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AmTlqlBceB-GtpxxgBtYf45MQLw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23342424/jtuohy_220323_5101_0014.jpg\">      <figcaption><em>We tested a lot of robot vacuums. Here’s some tips on what to look for when picking your next house cleaner.</em></figcaption>  </figure></div><h2 id=\"9EDtTU\">What to look for in a robot vacuum cleaner</h2><p class=\"p--has-dropcap\" id=\"pNS4ra\">There’s a lot of specs around suction for you to study when selecting your new housemate (see my comparison chart), but I can tell you all of these rolling sweepers are suitably sucky, picking up everything from dog hair and kitty litter to Cheerios and dust bunnies. Most have multiple suction levels and will adjust when they sense carpet. This makes the key consideration whether you want to spend money on a robot that can map your house for precision cleaning and avoidance (crucial if you have delicate objects or areas in your home), even more money on a model that can intelligently avoid clutter and a potential poop-ocalypse, and copiously more on one that can empty its own bin. If you don’t go the latter route, then the size of its onboard bin is an important factor. The bigger it is, the less often you’ll have to dump it out — never a fun experience.</p><p id=\"dgF9pG\">Every Wi-Fi-connected robot vacuum worth its salt today works with Alexa or Google smart speakers for voice control, although some are limited to just stop / start and pause, whereas others can be told to go clean specific areas. I wrote two blogs on how to use your robot vacuum with your voice assistant, so check those out if you want to know more about <a href=\"https://www.theverge.com/22961597/robot-vacuum-connect-control-amazon-alexa-assistant-roomba-roborock-how-to\">Alexa voice control</a> or <a href=\"https://www.theverge.com/22968709/robot-vacuum-connect-google-assistant-roomba-roborock-how-to\">Google Home voice control</a>. A couple of manufacturers now also work with <a href=\"https://www.theverge.com/2022/3/17/22982578/irobot-software-update-roomba-robot-vacuums\">Siri Shortcuts so you can use Apple’s Siri voice assistant to command your bot</a>. If this is something you want, look for robots from iRobot or higher-end models from Roborock and Ecovacs.</p><p id=\"ODEe17\">A few other things to keep in mind. No robot vacuum can climb stairs (yet), so if you want hands-free cleaning everywhere, you’ll want to budget for one per floor or be prepared to move it around. You can also buy extra charging bases, and some models can map multiple floors. Thankfully, all the bots I tested have cliff sensors and none attempted to dive off the stairs. Finally, none could really, truly get carpets clean. They get the surface, but if you have a carpeted house or lots of rugs, I’d recommend investing in a stick vac as well for weekly deep cleans. (They’re also handy for stairs.) The only robot I found that does a really good job on carpets is the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fstore.irobot.com%2Fdefault%2Froomba-vacuuming-robot-vacuum-irobot-roomba-s9-plus%2Fs955020.html%3Fsource%3Dgoogle_paid%26medium%3Dcpc%26ds_campaign%3DUS%2B-%2BSmart%2BShopping%2B-%2BRoomba%2Bs%2BSeries%26ds_content%3Ds%2BSeries%26ds_keyword%3DPRODUCT_GROUP%26gclid%3DCj0KCQjw8_qRBhCXARIsAE2AtRbCJB8dCMfxGlBH3Mde09Ov-C-UH6lDlUlrJWeLalOiU6moznrhKEwaAi8gEALw_wcB%26gclsrc%3Daw.ds&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22997597%2Fbest-robot-vacuum-cleaner\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Roomba s9</a>, which has 30 times the suction power of the Roomba j7. But that’s a $1,000 bot (including a self-empty base), and its lack of AI obstacle avoidance means it’s prone to getting stuck.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7pBxxSmggefDJ0jW0dHSYJKssU0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277459/jtuohy_220221_5047_0009.jpg\">      <figcaption><em>The Roborock S7 MaxV Ultra is a new breed of bot that can do more for you, for a lot more money.</em></figcaption>  </figure></div><h2 id=\"tHTbHA\">What about robot vacuum mops that can clean their mops and refill themselves?</h2><p class=\"p--has-dropcap\" id=\"dAbGYo\">As I’ve mentioned, robot vacuums are advancing rapidly. The latest innovation is an auto-empty dock that can refill the mopping reservoir, clean the mop, and empty the bin, promising hands-free operation for at least a couple of months. </p><p id=\"hEHRhY\">I’ve tested Roborock’s version of this model, the <a href=\"https://www.theverge.com/22960447/roborock-s7-maxv-ultra-review-robot-vacuum-mop-hybrid\">Roborock S7 MaxV Ultra</a> (available in April for $1,400), and the $1,550 <a href=\"https://www.amazon.com/ECOVACS-Self-Empty-Auto-Clean-Navigation-Avoidance/dp/B09NPKWDRX?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Ecovacs Deebot X1 Omni</a> (which also has its own built-in voice assistant). Right now, I’m not ready to recommend these, not because they’re not good but because they are incredibly expensive. And the technology is still new enough that I’m not sure how they’d hold up to heavy use. I’ll be keeping an eye on this space and provide an update when I have a solid recommendation.</p><p id=\"cSFeYD\"></p><p class=\"c-end-para\" id=\"1IiIbJ\"><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hf3wLXb3cMIkz-kBy4jOWfuH1F8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23343147/VRG_ILLO_5103_RobotVacuum_Guide.jpg",
  "description": "These busy little bots will keep your floors sparkling.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}