{
  "title": "The best smartphone you can buy for under $500",
  "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
  "date": "2022-04-01T20:11:11.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TNGRMSLZtKWPCx_U3u5Sm7Ptp3I=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/67732462/Best_phone_grid_16x9_2022.11.jpg\" />        <figcaption><em>The iPhone SE (2022) and Google Pixel 5A are our two top picks under $500, but a range of devices from Motorola, TCL, and Samsung make for great choices at every price.</em></figcaption>    </figure>  <p>You can get a great smartphone at this price, whether you want an iPhone, a 90Hz screen, or 5G support</p> <p class=\"p--has-dropcap p-large-text\" id=\"7By4QV\">If you’re shopping for a new phone on a budget, we’ve got good news: you’re more likely to find mid-range sub-$500 phones available in these days of crunched supply chains than many of the recent flagships. Fortunately, there are many excellent alternatives to the pricey, premium models that are nearly as capable and cost a lot less to boot.</p><p id=\"WU3Cg6\">Companies like Apple, Google, and Samsung are spreading the wealth of features enjoyed by their flagships down to less expensive options. Other brands like TCL are also finding ways to challenge more established manufacturers with lower prices and more premium features.</p><p id=\"xoCnCZ\">The bad news is this makes the job of picking the best budget phone<em> that </em>much harder. It’s impossible to buy a phone that does everything well at this price point. So prioritize the features that matter most to you, whether it’s 5G compatibility with a particular network, high-resolution screen, low price, best camera, or longevity with software updates. It’s difficult to get straight A’s in every single one of these needs, but if you’re able to tolerate the occasional B, you’ll find a phone you’ll love. We recommend getting an unlocked phone for the best price and portability, but you might find better deals by buying through a carrier and signing up for a wireless plan.</p><p id=\"Svhy7y\">Our pick for the best inexpensive iPhone is the 2022 edition of the <a href=\"https://www.theverge.com/2020/4/22/21230308/apple-iphone-se-2-2020-review-features-specs-camera-price\">Apple iPhone SE</a>. You’ll need to be comfortable using a small screen, because its 4.7-inch display is starting to feel very cramped in this era of giant displays, but otherwise, this latest iteration of the SE does exactly what the previous generations have done: offer a low-cost entry point to Apple’s iOS ecosystem, from a device that will last upwards of five years if you take care of it.</p><p id=\"fQUJ3j\">If you’re looking for the best budget Android phone, then the <a href=\"https://www.theverge.com/22628205/google-pixel-5a-review-price-screen-battery-specs\">Google Pixel 5A</a> is our top choice. You’ll find an all-around good phone with a flagship-level camera, three years of software updates from Google, plus IP67 water resistance — all at a lower price than last year’s model.</p><div id=\"PuCkqJ\"><div data-anthem-component=\"productcard:11124510\"></div></div><div id=\"RvhA7v\"><div data-anthem-component=\"productcard:10885083\"></div></div><hr class=\"p-entry-hr\" id=\"GatTSx\"><h1 id=\"xLIfAi\">The best smartphone for under $500 in 2022</h1><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VbW5M91jdAENMNsqzHuoSetHpn4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307883/ajohnson_221103_5070_0003.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The 2022 iPhone SE is a low-cost entry point to the iOS ecosystem.</em></figcaption>  </figure></div><h2 id=\"PEjixV\">1. <a href=\"https://www.theverge.com/22975531/apple-iphone-se-2022-review-price-specs-screen-battery\">Apple iPhone SE 2022 (third-generation)</a></h2><h3 id=\"YvXuY9\">The best iPhone under $500</h3><p id=\"psGPF7\">The iPhone SE remains undefeated as the best value proposition on the smartphone market, period. Even though the price went up $30 over the second-gen version, it’s still a great deal at $429 when you consider that it will continue receiving iOS updates for upwards of five, even six or seven years.</p><p id=\"ZnVNY0\">However, there’s one major consideration to make if you’re ready to pick up an SE and coast through most of the next decade without having to buy a new phone: living with its very small, very dated 4.7-inch screen. It’s the same one that the iPhone 6 used, and it’s starting to feel very cramped in an age when apps and web pages are designed for bigger screens. The SE’s big bezels make the device look dated, too, but really the usability of a small screen over the years to come is the important factor to consider.</p><div class=\"c-float-right c-float-hang\"><aside id=\"vEPwFk\"><q>There’s no night mode for brighter photos in very low light, which is a curious omission</q></aside></div><p id=\"ku3Nhi\">That’s the biggest knock against the SE. Otherwise, it’s a fantastic midrange device. Its A15 processor is the same as Apple’s top-tier iPhone 13 Pro Max, so performance is excellent. There’s IP67 waterproofing — uncommon in this price range — and even though it uses the same 12-megapixel camera that iPhones have used since the dawn of time, it takes very nice photos and high-quality video clips. There’s no night mode for brighter photos in very low light, which is a curious omission. Many other midrange phones offer some sort of low-light photo mode, and the phone’s processor is certainly up to the task. Apple gonna Apple.</p><p id=\"EHQR6Y\">This generation SE, of course, offers 5G connectivity — just low- and mid-band, which is fine. You won’t get the fast millimeter wave 5G you might encounter in an NFL stadium, but it’s nothing to lose sleep over. Battery life is also improved over the last generation, and it will generally last a full day unless you really push it with demanding tasks like gaming and streaming video.</p><p id=\"0OkYFn\">If you can live with the small screen and you aren’t bothered by the lack of night mode, we recommend picking up the 128GB version. The base model’s 64GB of storage isn’t quite enough, and you’ll be glad you spent the extra $50 when you’re using this phone for years into the future.</p><hr class=\"p-entry-hr\" id=\"smYbEU\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Google Pixel 5A.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OsDX3SyDEYXfF58kJLK4zYKEcXs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22781446/ajohnson_210813_4713_0001.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The Pixel 5A’s 6.34-inch screen isn’t huge, but it’s just big enough to not look out of place next to the 6.5-inch competition.</em></figcaption>  </figure></div><h2 id=\"B9aQm4\">2. <a href=\"https://www.theverge.com/22628205/google-pixel-5a-review-price-screen-battery-specs\">Google Pixel 5A</a></h2><h3 id=\"MeddEq\">The best Android phone under $500</h3><p id=\"7LCnMV\">If you’re looking for the best sub-$500 Android phone, the Pixel 5A is your best bet. </p><p id=\"aZV88A\">The $449 Pixel 5A has a 6.34-inch OLED screen that’s on the smaller side for the budget class, but it’s bigger than the previous-gen 6.2-inch panel on the Pixel 4A 5G. There’s a bigger battery, too: a 4,680mAh cell that will last through a full day of heavy use and well into day two if you’re a lighter user. The 5A also offers IP67 water resistance for added peace of mind in the event of accidental spills or tumbles into water.</p><p id=\"WD7mEy\">That’s more or less the extent of the 5A’s improvements over its predecessor. The 5A’s dual rear-facing cameras (main and ultrawide), Snapdragon 765G processor, as well as the 6GB RAM and 128GB storage combination were inherited from the 4A 5G and still deliver solid performance in this iteration.</p><p id=\"N4bk7u\">Software is another area where Pixel phones shine, and the 5A is no exception. It launched with Google’s own Android 11 OS and has already gotten upgraded to Android 12. The software is refreshingly free of the added clutter that other manufacturers sometimes pile onto it. The Pixel 5A is also guaranteed three years of OS upgrades and security updates, which isn’t quite as long as Apple or Samsung’s standard software support timespan but is certainly better than a lot of the Android competition.</p><p id=\"uppsrx\">There’s also, of course, 5G connectivity. You won’t get the super-fast mmWave flavor of 5G support, but you will be able to access the slower but more common, sub-6GHz 5G network. Unfortunately, <a href=\"https://www.theverge.com/2022/3/22/22991308/google-pixel-4a-5-5a-5g-c-band-pixel-6-software\">Google has made an odd decision not to support C-band 5G frequencies on the 5A</a>, even though the hardware is capable. </p><div class=\"c-float-left c-float-hang\"><aside id=\"L7fhLs\"><q>The 5A also offers IP67 water resistance </q></aside></div><p id=\"CHUScD\">That’s not a big deal if you’re on T-Mobile since that carrier isn’t using a lot of C-band for its 5G network, but it is something to consider if you’re on AT&amp;T or Verizon. C-band is what they’re using to make their 5G networks actually <em>good</em>, and they’ll be lighting up a lot more of it over the next few years. The Pixel 5A won’t be able to use that spectrum, and that is a shame.</p><p id=\"abYO8A\">The 5A is also getting somewhat of a limited release: it isn’t being sold through any of the major US carriers, but you can buy it from the <a href=\"https://store.google.com/us/product/pixel_5a_5g?hl=en-US\">Google Store</a> and <a href=\"https://fi.google.com/about/phones/pixel-5a-5g?id=CR6HaBzv0AUAEggeh2gc79AFAA%3D%3D\">Google Fi</a>. All in, the Pixel 5A is still the budget Android phone we’d recommend. It’s not flashy, but it’s well priced and has it where it counts.</p><hr class=\"p-entry-hr\" id=\"ykrqeX\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7jGjKdcssyDUAL1Vc67gH-WoCNo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22465667/ajohnson_20210419_4541_0005.jpg\">      <figcaption><em>The Galaxy A52 5G offers a 120Hz fast refresh-rate screen.</em></figcaption>  </figure></div><h2 id=\"qyhaRs\">3. <a href=\"https://www.theverge.com/22399456/samsung-galaxy-a52-5g-review-camera-screen-specs-price\">Samsung Galaxy A52 5G</a></h2><h3 id=\"7CPw9a\">The best phone display for $500 </h3><p id=\"KwvytU\">If you’re looking for the best display for your money, the $500 Samsung Galaxy A52 5G is a great option for future-proofing your phone, albeit at the very top of this buying guide’s price range, but it’s well worth its higher price tag. </p><p id=\"A3YAum\">At the time of this writing, the <a href=\"https://www.theverge.com/2022/3/17/22978286/samsung-galaxy-a53-5g-price-specs-screen-battery\">Galaxy A53 5G has just gone on sale</a>, and it costs $50 less. The A52 5G remains available, at least for now. The A53 5G uses a new Samsung-made processor, which is a bit of an unknown quantity compared to the Snapdragon chipset in the A52 5G, so we’re sticking with our current recommendation while we test the A53 5G. Oh, and one more thing you get for the A52 5G’s higher price? A charger in the box.</p><p id=\"Fpya2a\">The A52 5G’s 6.5-inch screen is an OLED panel that’s bright with good contrast that’s generally nice to look at. But its best feature is a subtle one: a 120Hz refresh rate that gives a much smoother appearance to animations and content as you swipe and scroll through menus and social feeds. We’ll likely see this feature make its way into more budget phones soon, but for now, the A52 5G is one of only a few to offer better than the standard 60Hz screen in its class, and it makes the experience of using the phone that much nicer.</p><p id=\"99z3je\">The phone overall performs well for its class with a Snapdragon 750G processor and 6GB of RAM. You may notice the occasional hesitation or stutter with heavy tasks, but otherwise, everyday scrolling, app switching, and navigating are handled easily. And even with a power-hungry display, the Galaxy A52 5G’s 4,500mAh battery should get you through at least a day of moderate to heavy use before needing another charge.</p><p id=\"DIU18y\">One of the A52 5G’s not-so-bright spots is Samsung’s current take on Android, which puts a lot of pre-downloaded apps on your phone that you probably don’t want, and it even </p><div class=\"c-float-right c-float-hang\"><aside id=\"85J3ce\"><q>more of an investment in a phone that you can keep using three or four years from now</q></aside></div><p id=\"C4ZNpo\">includes the occasional ad in places like the native weather app. For a cleaner or more grown-up Android skin, look to the Pixel or OnePlus. The Galaxy A52 5G’s camera is another consideration: it’s capable, but it tends toward an oversaturated look. If you prefer a more natural look to your photos, then the Pixel 5A is the winner here.</p><p id=\"INZwJl\">There’s also 5G, which we still don’t think is a feature you should run out and buy a new phone for, but it is nice to have the support here — particularly if you plan to hold on to your phone for a few years. This device doesn’t support super-fast mmWave 5G, but it’s hard to come by, so that’s not a huge loss. Importantly, it supports more widely available sub-6GHz bands and should be able to take advantage of improving 5G networks in the US over the next few years.</p><p id=\"mOCh8W\">You can buy a much less expensive device to get you through the next couple of years, and that’s just fine. But if you do want to make more of an investment in a phone that you can keep using three or four years from now, the A52 5G is your best bet right now on Android.</p><div id=\"Tty2Wh\"><div data-anthem-component=\"productcard:10885114\"></div></div><hr class=\"p-entry-hr\" id=\"0FM1jw\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"TCL 20S\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IyD38njcgbawWivV9S0_l-sDoHQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23010104/gsin_211112_4876_0002.jpg\">      <cite>Photo by Gloria Sin / The Verge</cite>      <figcaption><em>The TCL 20S has an usually vibrant screen for its class, thanks to TCL’s television display expertise.</em></figcaption>  </figure></div><h2 id=\"bFMC0d\">4. <a href=\"https://www.theverge.com/22717002/tcl-20s-and-20se-review-budget-affordable-unlocked-smartphone\">TCL 20S</a></h2><h3 id=\"Oj4ljX\">The best 4G phone under $300</h3><p id=\"npapoA\">The TCL 20S is proof that even $250 can buy a good phone without many compromises. It just nails all the basics that anyone would want from a phone: good performance, a good screen, and good battery life, all for a good price.</p><p id=\"uRkfu4\">You might recognize the TCL brand from its popular budget smart TVs, where its screen expertise is what makes the TCL 20S’ vibrant, 6.67-inch 1080p screen a standout. The 20S has a layer of fingerprint-resistant, “micron-sized prismatic crystals’’ on its back that gives it a subtle shimmer. It has a quick fingerprint sensor that is built into its power button, as well as face unlock as an additional option.</p><div class=\"c-float-right c-float-hang\"><aside id=\"HhlvTs\"><q>for the best bang for your buck, the $250 TCL 20S is a solid choice</q></aside></div><p id=\"rA2h68\">While the 20S’ camera system is nothing to write home about, its 64-megapixel main camera and 15-megapixel front camera are both more than capable of taking detailed photos in good lighting conditions — just don’t use them for night or macro photography.</p><p id=\"xLPoSw\">For a budget phone, the 20S has no noticeable lag in performance, thanks to its Qualcomm Snapdragon 665 processor and 4GB of RAM. By default, it comes with 128GB of internal storage, a microSD card slot, a 3.5mm audio jack, and a 5,000mAh battery that lasts for around two days without a recharge.</p><p id=\"Ijydf9\">If your budget is sub-$300 and you are on the hunt for the best bang for your buck, the $250 TCL 20S is a solid choice that should work on all major 4G networks in the US.</p><div id=\"FtL0ba\"><div data-anthem-component=\"productcard:10861755\"></div></div><hr class=\"p-entry-hr\" id=\"PNDiYl\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Moto G Stylus (2021)\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xMwyscYsaBk45_Mxu3BlvMy9hSc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22336738/ajohnson_210228_4453_0002.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>Motorola’s Moto G Stylus (2021) is a good phone whether you’re a stylus devotee or just style-curious.</em></figcaption>  </figure></div><h2 id=\"2pPPrl\">5.<strong> </strong><a href=\"https://www.theverge.com/22311690/motorola-moto-g-stylus-2021-review-price-specs\">Motorola Moto G Stylus (2021)</a></h2><h3 id=\"0wGhHB\">The best budget phone with a stylus</h3><p id=\"8bNLIA\">It’s slim pickings for Android users who want a new budget phone with a stylus. With<a href=\"https://www.theverge.com/2021/4/4/22346084/lg-exits-smartphone-business\"> LG exiting the smartphone market</a> and <a href=\"https://www.theverge.com/22941246/samsung-galaxy-s22-ultra-review-price-screen-specs-stylus\">Samsung’s Galaxy S22 <s>Note</s> Ultra</a> in a much higher price bracket, there’s only Motorola’s Moto G Stylus left to hold the line. </p><p id=\"Q6Y0rd\">Of the Motorola budget devices we’ve tested recently, the Moto G Stylus (2021) offers the best balance of features and cost-saving measures. It’s a good phone for the price, whether you’re a stylus devotee or just stylus-curious. Motorola recently introduced <a href=\"https://www.theverge.com/2022/2/3/22914918/motorola-2022-moto-g-stylus-refresh-90hz-display-battery-processor-camera\">a 2022 version of the G Stylus</a>, which we haven’t tested yet, but in the meantime, the 2021 edition is enjoying a steep markdown to $200 — while it’s still in stock.</p><p id=\"pyyTGB\">It has a big 6.8-inch LCD display at 1080p resolution, good battery life with its 4,000mAh cell, and ample internal storage with 128GB of capacity. Thanks to its Qualcomm Snapdragon 678 processor and 4GB of RAM, the G Stylus performs just fine with the </p><div><aside id=\"fJsUIu\"><q>it’s a good phone for the price, whether you’re a stylus devotee or just stylus-curious</q></aside></div><p id=\"3VEksQ\">occasional hiccup. The cameras, though flawed, are good enough to get by. You won’t find an amazing night mode or top-notch picture quality here, but for a sub-$300 phone, it does the job just fine.</p><p id=\"44WwOS\">The Moto G Stylus’ stylus is built into the device like the Galaxy S22 Ultra. Popping it out brings up a quick menu of shortcuts to stylus-friendly apps, like its coloring book app.</p><p id=\"y5Ppnc\">There’s no telling how much longer Motorola will sell this second-gen Moto G Stylus, so if you want a budget phone with a built-in stylus, you should grab this one while the price is right.</p><div id=\"fjmzFX\"><div data-anthem-component=\"productcard:10885207\"></div></div><hr class=\"p-entry-hr\" id=\"UcHD0D\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Moto G Pure phone.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HPsy2yP9PjUDDftJPGGR4i7dKj0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22956984/gsin_190209_4806_0008.jpg\">      <cite>Photo by Gloria Sin / The Verge</cite>      <figcaption><em>Plan to add a microSD card to your purchase to complement the Moto G Pure’s paltry 32GB of built-in storage.</em></figcaption>  </figure></div><h2 id=\"Qq9tmB\">6. <a href=\"https://www.theverge.com/22787370/moto-g-pure-review-4g-android-budget-phone\">Motorola Moto G Pure</a></h2><h3 id=\"tXDuyi\">The best 4G phone under $200</h3><p id=\"RJ53J5\">The Motorola Moto G Pure gets a lot right for its very low price: just $140, permanently marked down from $160. It’s a 4G-only phone, and its biggest weak point is a slower processor — everything from opening a web page to switching apps takes just a beat longer than on most other budget phones. But as a tradeoff, it includes a capable 13-megapixel rear camera and good battery life that should take most users through a full day and well into the next.</p><p id=\"X2MJlm\">The Moto G Pure only includes 32GB of storage, and that’s not really enough, considering the Android OS will take up almost half of that. Thankfully, you can add more storage via the microSD card slot. If you don’t have one already, just plan on budgeting an extra $15 or $20 for a microSD card with the purchase of this phone.</p><div id=\"hrRekQ\"><div data-anthem-component=\"productcard:10885230\"></div></div><hr class=\"p-entry-hr\" id=\"jpOqcd\">",
  "image": "https://cdn.vox-cdn.com/thumbor/Sa9xFQ4poFi93NDmix-HIKCOql0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23360977/Best_phone_grid_16x9_2022.jpg",
  "description": "Find a great phone at this price — just know your goals.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}