{
  "title": "The NLRB is suing Amazon to get a fired activist his job back",
  "url": "https://www.theverge.com/2022/3/17/22983692/nlrb-amazon-labor-activism-gerald-bryson-jfk8-warehouse-injunction",
  "date": "2022-03-17T23:55:01.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mUTUxvB5df__lED1aRxJmFk5tPE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70638536/acastro_181114_1777_amazon_hq2_0001.0.jpg\" />        <figcaption><em>The NLRB says Gerald Bryson’s firing is a clear case of retaliation.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"flDgNE\">Amazon is facing a lawsuit in federal court from the National Labor Relations Board. The watchdog has asked a judge to issue an injunction forcing Amazon to give labor activist Gerald Bryson his job back. Amazon fired Bryson in April 2020, in what the NLRB says is a clear case of Amazon retaliating against him for protesting unsafe working conditions at its JFK8 warehouse in Staten Island, NY.</p><p id=\"O4Jfzq\"><a href=\"https://www.nlrb.gov/news-outreach/news-story/general-counsel-jennifer-abruzzo-releases-memorandum-on-importance-of-10j\">According to the NLRB</a>, the Section 10(j) injunction it’s pursuing is intended to temporarily make a situation right when the court case could take too long to fix the alleged issue. In this case, Bryson has been fighting to get his job back for almost two years, <a href=\"https://www.nytimes.com/2022/03/17/business/amazon-staten-island-facility.html\">according to <em>The New York Times</em></a>. The NLRB petition (which you can read in full below) argues that other employees may be afraid to speak out if Bryson isn’t reinstated, as it views Bryson’s firing as a message from Amazon to its workers. That’s especially relevant now, as workers at the JFK8 warehouse are <a href=\"https://www.theverge.com/2022/2/16/22937440/amazon-jfk8-staten-island-union-election-march-25th\">voting on unionization</a> starting next Friday, March 25th. </p><p id=\"5X2lXH\">In a statement emailed to <em>The Verge</em>, NLRB Regional Director Kathy Drew King said:</p><blockquote><p id=\"o3zb6D\">We are seeking an injunction in District Court to immediately reinstate a worker that Amazon illegally fired for exercising his Section 7 rights. We are also asking the Court to order a mandatory meeting at JFK8 with all employees at which Amazon will read a notice of employees’ rights under the National Labor Relations Act. No matter how large the employer, it is important for workers to know their rights—particularly during a union election—and that the NLRB will vociferously defend them.</p></blockquote><p id=\"DaI6CT\">Amazon did not immediately respond to a request for comment.</p><div class=\"c-float-right\"><aside id=\"w2N1BP\"><q>“This isn’t a court case with somebody suing for me, this is my life”</q></aside></div><p id=\"MUusIw\">For Bryson, the process has been frustrating. In a conversation with <em>The Verge</em>, he said that the systems for fighting back against large corporations like Amazon are outdated and need to be rebuilt — “those places were made for little people to fight in, but we can’t. It’s like we’re told ‘hey, here’s a boxing ring, but you won’t get any gloves.’” He also said that he had been frustrated seeing Amazon <a href=\"https://www.cnbc.com/2021/09/29/amazon-settles-with-employees-who-said-they-were-fired-over-activism.html\">settle other cases brought by employees</a> while his dragged on. </p><p id=\"DiObt2\">“This isn’t a court case with somebody suing for me; this is my life,” he said, talking about his struggles dealing with being out of work as a single father. Despite that frustration, Bryson says he’s “fighting until the end. And hoping to make a change for other people” that work at Amazon. </p><p id=\"U9aBTR\">Bryson says he’s one of the leaders of the Amazon Labor Union, the organization leading unionization efforts at the JFK8 warehouse where Bryson used to work. The ALU is also involved in efforts at another Amazon Staten Island facility, LDJ5, where organizers <a href=\"https://www.theverge.com/2022/3/2/22959234/amazon-union-staten-island-ldj5-election-drive-nlrb-approval-go-ahead\">have received the go-ahead</a> to continue unionization efforts. The process of deciding election details is ongoing. The union is headed by Christian Smalls, <a href=\"https://www.theverge.com/2021/4/28/22408128/amazon-warehouses-unionizing-staten-island-jfk8-christian-smalls\">another worker fired by Amazon</a>.</p><aside id=\"RPO4JJ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"A fired Amazon worker is trying to unionize four NYC-area facilities\",\"url\":\"https://www.theverge.com/2021/4/28/22408128/amazon-warehouses-unionizing-staten-island-jfk8-christian-smalls\"}]}'></div></aside><p id=\"bGaFiP\">According to <em>The New York Times</em>, Amazon has said it fired Bryson after he got into a heated shouting match with another warehouse employee while attending a protest, which the company says was a clear case of bullying and intimidation.</p><p id=\"crT9qF\">Bryson says that the company has a zero-tolerance policy for fights, meaning that if two employees are in a fight, its policy is to fire both of them. He also denies starting the argument and says he’s submitted video evidence proving that to the court.</p><p id=\"Ng0W6I\">Bryson was “the public face of the organizing movement for improved COVID-19 health and safety practices at the JFK8 Facility” before Amazon fired him, according to the NLRB’s petition. The company <a href=\"https://www.theverge.com/2020/3/30/21199942/amazon-warehouse-coronavirus-covid-new-york-protest-walkout\">faced</a> <a href=\"https://www.theverge.com/2020/4/10/21216172/amazon-coronavirus-protests-response-safety-jfk8-fired-covid-19\">heavy criticism</a> from workers for <a href=\"https://www.theverge.com/2020/5/5/21248427/amazon-warehouse-worker-coronavirus-death-new-york-covid-19\">how it handled the pandemic</a> at JFK8 and similar facilities, and the New York Attorney General <a href=\"https://www.theverge.com/2021/4/10/22377308/lawsuit-amazon-protect-workers-covid-19-new-york-warehouse-smalls-jfk8\">filed a lawsuit last year</a>, alleging that the company didn’t protect its workers from COVID.</p><p id=\"pNzApP\">Amazon has faced other suits from the NLRB about its actions at its Staten Island facilities during unionization efforts. <a href=\"https://www.theverge.com/2022/1/27/22905235/nlrb-amazon-broke-labor-laws-jfk8-warehouse-workers\">In a complaint issued earlier this year</a>, the labor watchdog accused the company of “threatening, surveilling, and interrogating” employees. The complaint alleged that security personnel at the warehouses confiscated union materials from organizers, the company called organizers “thugs,” and that it promised to solve employees’ issues itself if they rejected unionization efforts.</p><p id=\"tUCJsP\">In December, the NLRB <a href=\"https://www.theverge.com/2021/12/23/22851842/amazon-union-settlement-nlrb-email-electronic-post-rights\">reached a settlement with Amazon</a> that required the company to notify workers of their rights to organize via emails, a message on an internal app and website, and physically posted signs. While these notifications were a step forward, the all-hands meeting the NLRB is proposing (which would also involve posting written notices) would likely be significantly more attention-grabbing for employees. In the settlement, Amazon also agreed to let employees organize on company property outside of their shift time, something they were reportedly not allowed to do before. </p><div id=\"QYyom5\"><iframe src=\"https://embed.documentcloud.org/documents/21436083-nlrb-amazon-injunction-for-gerald-bryson/?embed=1&amp;responsive=1&amp;title=1\" title=\"NLRB Amazon Injunction for Gerald Bryson (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/y-L6MHvt0CtVVEz71kNdDVgrdQ4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13443460/acastro_181114_1777_amazon_hq2_0001.jpg",
  "description": "The labor watchdog says Amazon fired him in retaliation.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}