{
  "title": "The FTC sues TurboTax to stop ‘misleading’ ads for free tax prep software ",
  "url": "https://www.theverge.com/2022/3/29/23002219/ftc-turbo-tax-irs-free-tax-prep-software-intuit-misleading",
  "date": "2022-03-29T22:51:35.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Intuit Inc.’s TurboTax Software\" src=\"https://cdn.vox-cdn.com/thumbor/mn5Vi3cIfDNqMfOgWfEL_J4A5x4=/0x3:3500x2336/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70687274/138903655.0.jpg\" />        <figcaption>The FTC says TurboTax ads claiming its tax prep software is free are misleading | Getty Images</figcaption>    </figure>  <p id=\"9c10UN\">The Federal Trade Commission (FTC) <a href=\"https://www.ftc.gov/news-events/news/press-releases/2022/03/ftc-sues-intuit-its-deceptive-turbotax-free-filing-campaign\">said Tuesday </a>that Intuit’s “ubiquitous” advertising claiming its TurboTax tax prep software is free to use is misleading, and has asked a federal court to order Intuit to stop “disseminating the deceptive claim that consumers can file their taxes for free using TurboTax.” </p><p id=\"9XKzXX\">According to the commission, the ads “some of which have consisted almost entirely of the word ‘free’ spoken repeatedly” mislead people into believing they can file their taxes for free with TurboTax. “In fact, most tax filers can’t use the company’s ‘free’ service because it is not available to millions of taxpayers, such as those who get a 1099 form for work in the gig economy, or those who earn farm income.,” the agency said in a press release. The FTC said that in 2020, “approximately two-thirds of tax filers could not use TurboTax’s free product.”</p><p id=\"3Ecm8Y\">The FTC is seeking a preliminary injunction that would prevent Intuit “from engaging in deceptive acts or practices” in its marketing and advertising, including ads for TurboTax. </p><p id=\"oLOjT6\">Intuit said in a <a href=\"https://www.intuit.com/company/press-room/press-releases/2022/intuit-responds-to-complaint-from-u.s.-federal-trade-commission/\">statemen</a>t that it will “vigorously challenge” the FTC’s complaint, claiming the arguments were not credible. “Far from steering taxpayers away from free tax preparation offerings, our free advertising campaigns have led to more Americans filing their taxes for free than ever before and have been central to raising awareness of free tax prep,” said Intuit’s executive vice president and general counsel Kerry McLean.</p><p id=\"Dqklht\">The IRS has a program that allows many Americans to file their taxes for free, as part of a partnership with the nonprofit coalition Free File Alliance. <a href=\"https://www.theverge.com/2021/7/17/22581587/turbotax-parent-company-intuit-opts-out-irs-free-file-program\">Intuit said last July it was leaving that program</a>, however, citing its “limitations.” </p><p id=\"h2Be3k\">If all this seems a little familiar to readers, they may be remembering the 2019 series of <a href=\"https://www.propublica.org/series/the-turbotax-trap\">reports by <em>ProPublica</em></a>, which found that Intuit and H&amp;R Block had misled people into paying to file their taxes. ProPublica found that both companies kept free versions of their software from <a href=\"https://www.propublica.org/article/turbotax-deliberately-hides-its-free-file-page-from-search-engines\">showing up in search engine results</a>, making them harder for customers to find online. The IRS later <a href=\"https://www.propublica.org/article/irs-reforms-free-file-program-drops-agreement-not-to-compete-with-turbotax\">changed the Free File</a> program, removing a provision that prohibited the agency from creating an online filing system of its own that could be a competitor for the software companies’ products.</p><div id=\"x8gnq0\"><iframe src=\"https://embed.documentcloud.org/documents/21562581-ftc-v-intuit-1-main/?embed=1&amp;responsive=1&amp;title=1\" title=\"ftc-v-intuit-1-main (Hosted by DocumentCloud)\" width=\"700\" height=\"905\"  sandbox=\"allow-scripts allow-same-origin allow-popups allow-forms allow-popups-to-escape-sandbox\"></iframe></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/XVHQghJAcqXvhJhPH_5hTreK0Zk=/0x253:3500x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23353959/138903655.jpg",
  "description": "It’s asking a court to order the company to stop the ads",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}