{
  "title": "The FBI reportedly confirms it tested NSO’s spyware",
  "url": "https://www.theverge.com/2022/2/2/22914854/fbi-nso-pegagus-tests-us-phone-numbers-legality",
  "date": "2022-02-02T22:46:28.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mgEEsI74b1N8Uyq-auG32EmdSxY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70464539/acastro_170621_1777_0006_v4.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"b9NQMH\">The FBI has <a href=\"https://www.washingtonpost.com/technology/2022/02/02/pegasus-fbi-nso-test/?utm_source=rss&amp;utm_medium=referral&amp;utm_campaign=wp_business-technology\">confirmed to <em>The Washington Post</em></a> that the agency had a license to use NSO’s Pegasus spyware and that it tested out the software’s capabilities. The bureau insists that the software, which is capable of <a href=\"https://www.theverge.com/22589942/nso-group-pegasus-project-amnesty-investigation-journalists-activists-targeted\">silently infecting phones</a> and accessing camera and microphone feeds, contacts, texts, and more, was never used “in support of any investigation,” but the <em>Post’s</em> report says that there were at least discussions within the FBI and Department of Justice about how the FBI might go about deploying the spyware.</p><p id=\"Dba5wY\">The confirmation comes after <em>The New York Times </em><a href=\"https://www.nytimes.com/2022/01/28/magazine/nso-group-israel-spyware.html\">released a sweeping report last week</a>, which included details about the FBI’s relationship with NSO. Not only did the FBI try out the spyware on phones using foreign SIM cards, according to the <em>Post</em>, but the agency also carried out discussions about the legality of <a href=\"https://www.vice.com/en/article/8899nz/nso-group-pitched-phone-hacking-tech-american-police\">a version of Pegasus that could be used in the US</a>, called Phantom. </p><div class=\"c-float-right\"><aside id=\"88xaRm\"><q>NSO has repeatedly claimed that Pegasus can’t be used on American phone numbers</q></aside></div><p id=\"q9rtvs\">It’s a worrying detail — NSO has repeatedly claimed that Pegasus cannot be used on phone numbers with a +1 country code and is only allowed to be used in countries outside the US. If Phantom is, as <a href=\"https://www.vice.com/en/article/8899nz/nso-group-pitched-phone-hacking-tech-american-police\">one former NSO employee told <em>Vice</em>,</a> just a brand name for the “same Pegasus,” then the company was telling the public and law enforcement agencies very different stories. According to the <em>Times</em>, the FBI decided it wouldn’t use Pegasus for international or domestic use right around the time when Forbidden Stories and a coalition of news outlets started releasing <a href=\"https://forbiddenstories.org/case/the-pegasus-project/\">dozens of reports centered around the spyware</a>.</p><p id=\"c8Sjra\">The FBI didn’t confirm other details from the <em>Times’</em> report to the <em>Post</em>, such as the allegation that it had racked up a $5 million bill with NSO and that it renewed a contract for Pegasus at one point. The FBI did, however, reiterate a statement that it will “routinely identify, evaluate, and test technical solutions and problems for a variety of reasons, including possible operational and security concerns they might pose in the wrong hands.”</p><div class=\"c-float-right\"><aside id=\"SVW9Ha\"><q>The FBI says it was only testing the software, not using it</q></aside></div><p id=\"rKlNUy\"><a href=\"https://www.nytimes.com/2022/01/28/magazine/nso-group-israel-spyware.html\">The <em>Times’ </em>report</a><em> </em>is well worth a read, as it takes an in-depth look at the Israeli government’s approval process for Pegasus and how the tool ended up more or less becoming a part of the country’s foreign policy. It also goes into NSO’s history as a company, tracing how it went from a startup focusing on phone support agents to a spyware company besieged by controversy, <a href=\"https://www.theverge.com/2021/11/23/22798917/apple-nso-group-spyware-pegasus-cybersecurity-research\">lawsuits</a>, and reports of government abuse.</p><p id=\"EROowL\">Since the initial reports came out last summer, NSO has faced near-constant difficulties. The company was <a href=\"https://www.theverge.com/2021/11/3/22761565/nso-group-pegasus-spyware-entity-list-us-government-human-rights\">blacklisted by the US government</a>, severely limiting how it can do business with tech companies based in the States. Further investigations also linked its spyware (which is only supposed to be sold to government agencies approved by the Israeli government) to <a href=\"https://www.theverge.com/2021/12/21/22848485/pegasus-spyware-jamal-khashoggi-murder-nso-hanan-elatr-new-analysis\">the murder of journalist Jamal Khashoggi</a>, the <a href=\"https://www.theverge.com/2021/12/3/22816068/us-state-department-officials-nso-pegasus-uganda-government-spyware\">hacking of US State Department phones</a>, and <a href=\"https://www.theverge.com/2021/12/27/22855390/poland-pegasus-spyware-opposition-brejza-nso\">political surveillance in Poland</a>. Apple has <a href=\"https://www.theverge.com/2021/11/23/22798917/apple-nso-group-spyware-pegasus-cybersecurity-research\">sued the company for attacking iPhones</a>, and its <a href=\"https://www.theverge.com/2022/1/25/22900706/nso-chairman-domestic-spying-allegations-israel-pegasus\">chairman stepped down</a> amidst accusations that Pegasus was used domestically by Israeli police forces.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-DYDHOYMJfyKizamFrWJWm0_0jI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10265107/acastro_170621_1777_0006_v4.jpg",
  "description": "This comes after a sweeping report about Pegasus.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}