{
  "title": "The best video doorbell camera to buy right now ",
  "url": "https://www.theverge.com/22954554/best-video-doorbell-camera",
  "date": "2022-03-01T15:00:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sxSidjIZg78EqJRBlKmHTpPiwcA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70564714/VRG_ILLO_5012_K_Radtke_Doorbell_Buying_Guide.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge, Shutterstock</figcaption>    </figure>  <p>We pick the best brainy buzzers</p> <p class=\"p--has-dropcap p-large-text\" id=\"oW81Cm\">A video doorbell is one of the most useful smart home devices you can buy. With one gadget you can update your front door’s communication skills from a 1980s landline to a modern smartphone. A motion-activated camera with a microphone, speaker, and doorbell attached, a smart doorbell sends alerts to a smartphone to show you who’s calling without you needing to open the door, or even be at home. Whether you’re tucked up on the couch, hard at work in a home or actual office, or sunning on a beach in the Bahamas, a video doorbell keeps you in touch with what’s happening on your doorstep.</p><p id=\"dR6bRK\">I have tested more than 30 smart doorbell cameras and while there’s no one size fits all — like a smartphone, it’s a personal choice — I have thoughts on which are the best of the best, and which work well for specific use cases. </p><aside id=\"A0P7Kv\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to stream your doorbell camera to a Nest Hub or Echo Show \",\"url\":\"https://www.theverge.com/22949565/doorbell-video-nest-echo-show-alexa-google-how-to\"}]}'></div></aside><p id=\"jAYigs\">My top pick is the <a href=\"https://www.amazon.com/Ring-Video-Doorbell-4/dp/B08JNR77QY?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$250 Ring Video Doorbell Pro 2</a>. A true wired doorbell with sharp resolution, an all-encompassing view, accurate people and package detection, and excellent motion detection, you can’t go wrong with this doorbell. This is doubly true if you use Alexa devices, which it plays very well with (Ring is owned by Amazon). For users who may be put off Ring due to its <a href=\"https://www.theverge.com/2021/6/3/22465295/ring-public-agencies-request-for-assistance-feed-neighbors-app\">Neighbors app or controversial police partnerships</a>, there are other options. However, it’s worth noting you can opt out of both those.</p><p id=\"0do9pc\">If you’re firmly in another ecosystem, the <a href=\"https://www.amazon.com/Arlo-Essential-Wired-Video-Doorbell/dp/B07YMV9VMT?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$150 Arlo Essential Wired Doorbell</a> is a great choice, adding HomeKit and Google Home support, and more smart alerts (it can spot pets and vehicles, too). It’s also cheaper, but its motion sensitivity and connectivity aren’t as good as the Ring’s. I also like the wider range of design options available with the Ring Pro 2, which is one of the smaller doorbells you can get. After all, this will be the first thing people see when they come to your house, so you want it to look nice. </p><div class=\"c-float-right\"><aside id=\"lwj2aO\"><q>If you have existing doorbell wires, use them</q></aside></div><p id=\"K6ErLP\">The <a href=\"https://www.amazon.com/Blink-Video-Doorbell/dp/B08SG2MS3V?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$50 Blink Video Doorbell</a> is a solid choice for those on a budget, albeit with a number of concessions to hit its much lower price. Up to two years of battery life, local storage, and the option to hardwire it to add pre-roll video and ring your indoor chime make this a great choice whether you have wires or not. You do get lower video quality and less smart features, but you’re also paying a lot less. </p><p id=\"nrYUm3\">I’ve also got recommendations for the best battery-powered doorbell camera, the best doorbell for Google Home and Apple HomeKit, and the best option if you don’t want to pay a monthly fee. </p><div id=\"g66JXn\"><div data-anthem-component=\"table:11071139\"></div></div><hr class=\"p-entry-hr\" id=\"B2aPFS\"><h2 id=\"b9D4sa\"><a href=\"https://www.theverge.com/22359973/ring-video-doorbell-pro-2-review\">1. Ring Video Doorbell Pro 2 </a></h2><h3 id=\"psZYgn\">The best video doorbell </h3><h3 id=\"UkVxnT\">The best wired video doorbell</h3><h3 id=\"WKdkI4\">The best video doorbell that works with Amazon Alexa</h3><div id=\"c6RMKY\"><div data-anthem-component=\"productcard:11070920\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"Vri5K8\">The Ring Pro 2 is the best video doorbell you can buy, thanks to excellent video quality (1536p HD), an ideal square ratio for a full front porch view, speedy notifications, and impressively accurate motion detection (using three separate sensors — radar, video analysis, and passive infrared). It also has a nice slim design (just 1.9 inches wide and 4.49 inches tall) and multiple faceplate options to fit your decor.</p><p id=\"OC6KuB\">A true wired doorbell, there are package and people alerts, color night vision, dual-band Wi-Fi, and smart responses (where your doorbell can talk to your visitor for you). The Ring app is excellent, and the timeline view to scroll through your recordings is the best by far. The Pro 2 will work with existing doorbell chimes, plus Ring sells a plug-in Chime / Wi-Fi extender that can help boost connectivity while providing a selection of fun doorbell tones. Of all the doorbells I tested this had the best range and connectivity, and built-in, full-color pre-roll means you never miss any action. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FkDL_t08zPS3GPvsaf8w3ZCzOUs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22406591/dseifert_20210323_4486_0003.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>The Ring Video Doorbell Pro 2 has a compact design and the option of swappable faceplates for a different look.</em></figcaption>  </figure><p id=\"p9uVHn\">This is also the doorbell to get if you want the best product that works with Amazon Alexa, but steer clear if you use almost any other smart home platform (the only other one it works with directly is SmartThings; integrating it into an Apple HomeKit setup can be done, but requires extra hardware and expertise that’s out of the scope of this guide). As with a lot of doorbell cameras, the Pro 2 can use Echo smart speakers to announce when there’s somebody at the door. But Ring is the only video doorbell manufacturer whose buzzers can automatically pull up a live feed of your doorbell on an Echo Show or Fire TV-enabled television when someone presses the doorbell. This gives you an instant video intercom in your home — a super handy feature.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kjTrVh0nkP6WtX8tMoC_iKHI2Tc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23262928/jtuohy_220217_5036_0010.jpg\">      <figcaption><em>Ring doorbell cameras can stream to Amazon Echo Show smart displays, and show the feed automatically if someone presses the doorbell.</em></figcaption>  </figure></div><p id=\"RzKDeR\">The downside is the Pro 2 is expensive, and you will need to pay for the Ring Protect plan ($3 a month or $30 a year for 60 days of video storage) to view recorded footage and get smart alerts. This also adds an extra six seconds of pre-roll video, which, in lieu of 24/7 recording (not an option on any Ring doorbell), provides plenty of time around motion events to catch all the action. The digital zoom is good, but not the best on offer (Arlo wins that race with a whopping 12x).</p><p id=\"V08Ibz\">However, the other new features exclusive to this buzzer — Bird’s Eye View (a small pop-up window in the app shows you the motion as it was tracked by the radar) and Alexa Greetings (which uses Amazon’s AI assistant to chat with visitors), still feel a bit gimmicky and have less obvious value, for now. </p><p id=\"TunpuE\">Read our full <a href=\"https://www.theverge.com/22359973/ring-video-doorbell-pro-2-review\">Ring Video Doorbell Pro 2 review</a>. </p><hr class=\"p-entry-hr\" id=\"vEZPYv\"><h2 id=\"NPVth1\">2. Blink Video Doorbell</h2><h3 id=\"7QuWhA\">The best cheap video doorbell </h3><div id=\"6tzqGP\"><div data-anthem-component=\"productcard:11071060\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"MsvDG6\">The Blink Video Doorbell is the best option for a cheap doorbell with no ongoing fees. It lacks a lot of bells and whistles (no smart alerts or quick replies, only 1080p video, and a standard 16:9 aspect ratio), but the basics are here — motion-activated recording and alerts, night vision, motion zones, and two-way audio. If you want to pay $50 to have a camera at your door and be done with it, get the Blink. </p><p id=\"nBX8aZ\">The biggest selling point for <a href=\"https://www.theverge.com/22704290/amazon-blink-ring-camera-doorbell-brands-smart-home-why\">Blink</a> is the feature that makes its similarly inexpensive security cameras so attractive; up to two years of battery life on two AA lithium batteries. The company has developed a super energy-efficient chip that will power its cameras longer than any other doorbell I’ve tested (it’s still going strong four months into testing). </p><p id=\"Kcggca\">The Blink can also be a true hardwired doorbell. When wired it will activate an existing chime (something neither the sub-$100 Ring nor <a href=\"https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera\">Wyze</a> doorbells can do), and provide constant power — not just trickle charge. This means it’s able to wake up faster than a battery-powered buzzer and catch your visitor as they arrive. Wiring also adds on-demand two-way audio and live view (otherwise, you can only see the stream if there’s a motion event at the doorbell.) </p><p id=\"Z0s24Z\">The lack of an on-demand live view on battery power would be a deal-breaker, but I only recommend buying this doorbell with its wireless hub, the Sync Module 2, which facilitates on-demand live views plus free, local storage. The extra $35 for the Sync Module 2 should pay for itself compared to a monthly subscription, and for a total of $85, this is still less than <a href=\"https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera\">Wyze</a> or <a href=\"https://www.theverge.com/2021/1/27/22252181/ring-video-doorbell-new-wired-size-features-price\">Ring’s</a> similar offerings (you will also need a USB stick to store the videos on). </p><div class=\"c-float-left c-float-hang\"><aside id=\"yxkIih\"><q>With the Blink you’re saving hundreds of dollars over some competitors</q></aside></div><p id=\"sUImIx\">Blink has a cloud-subscription plan, but with the Sync Module, you don’t need it, plus you can connect the camera to Amazon’s Echo speakers and smart displays to announce visitors or motion, as well as let you speak to them, a feature only Ring also has (Blink is also owned by Amazon).</p><p id=\"i5Hqs1\">The Blink comes in white or black, and because it uses AA lithium batteries, it isn’t as huge as most battery-powered doorbells, making it a more discreet option. It is a giant pain in the neck to install; however, make sure to follow the <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__www.youtube.com_watch-3Fv-3D3xSHRiE-5F7-2D4&amp;d=DwMGaQ&amp;c=7MSjEE-cVgLCRHxk1P5PWg&amp;r=HTakECkqD13F_4No8TePr7snOg-TM_Z0bAqwspVK1Ig&amp;m=F3bVs1RDQQjltruLowQMEQzX4QXTLqh2wnlOdE-QbIo&amp;s=A4uRxuj7wvLBZ-eKFSExudfv4iq7rR51t86iV8AKi_8&amp;e=\">video instructions</a> Blink provides closely to save you a lot of frustration. </p><p id=\"VLZ0fZ\">Overall, the biggest drawbacks here are lower video and audio quality and no smart alerts, plus the app is a bit tricky to navigate. But you don’t have to pay a thing after you’ve bought the buzzer. </p><hr class=\"p-entry-hr\" id=\"NckpXs\"><h2 id=\"gS9dee\">3. Arlo Essential Wired and Wire-Free video doorbells</h2><h3 id=\"7b3IIX\">The best video doorbell for any smart home platform or installation</h3><div id=\"8kpwEf\"><div data-anthem-component=\"productcard:11070927\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"ZVCTa4\">For less money and more features than the Ring Pro 2, Arlo’s two video doorbells are a good choice if you’re not in the Alexa ecosystem. With a wired and wire-free option, they work with Alexa but also offer compatibility with Google Nest and Apple HomeKit (wired only). </p><p id=\"7iV3NV\">The $149.99 Arlo Essential Video Doorbell Wired and the $199.99 Arlo Essential Video Doorbell Wire-Free have the same software and similar hardware, with the exception of a removable battery in the wire-free option. Both buzzers offer smart alerts for people, packages, animals, and vehicles (Ring doesn’t have the last two), a handy square aspect ratio, and a 180-degree field of view that gets the whole porch. Plus, they have the same video resolution as the Pro 2. </p><p id=\"gDP13X\">The Arlos also have a built-in siren for scaring off a package thief or neighborhood cat. The wired version has a built-in backup battery (it only lasts for a few minutes, though), and courtesy of its wired nature, includes pre-roll that captures your visitor as they approach. The wire-free option doesn’t have this and suffers from that back-of-the-head problem, where the camera takes too long to wake up to catch the visitor as they approach.</p><div class=\"c-float-right\"><aside id=\"OTmt4t\"><q>Arlo’s doorbells cost less and offer more</q></aside></div><p id=\"moP1Xe\">Either model is a good option if you are looking for Google Home integration; these are some of the few non-Google cameras you can view live feeds from in the Google Home app. Arlo also works with Alexa and Samsung SmartThings, plus the hardwired model adds Apple HomeKit compatibility (not HomeKit Secure Video, however). You will need to pick up the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.arlo.com%2Fen-us%2Faccessories%2FVMB4540-100NAS.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22954554%2Fbest-video-doorbell-camera\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Arlo SmartHub</a> ($100) to use this with HomeKit, but that also adds local storage, allowing you to record videos without paying for a subscription. So, if those are features you’re interested in, this is a better option than the Ring Pro 2. </p><div id=\"Evq7RW\"><div data-anthem-component=\"productcard:11070947\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"sR0kOb\">However, the Arlo is not as fast or reliable as the Ring. Neither the battery-powered version nor the hardwired option were as quick to send alerts or pull up a video feed. They also struggled when placed farther from the router, in a spot where the Ring worked fine. If you don’t have a good Wi-Fi signal at your front door, the Arlo isn’t for you. And there is no option of a chime Wi-Fi extender as with the Ring Pro 2. The doorbells also only work over 2.4 GHz Wi-Fi. </p><p id=\"4GUS1z\">As with Ring, a subscription plan is pretty much a necessity, since without it, all you get is a live view. Arlo Secure starts at $2.99 a month and adds smart alerts, geofencing to turn your camera off when you arrive home, 30 days of rolling cloud video storage, interactive notifications, quick responses, and activity zones (Ring doesn’t charge for activity zones). The Arlo Plus plan ($14.99 a month for unlimited cameras) also adds a button to quickly call emergency services right from the notification, but there’s no option of 24/7 recording, which is available on Arlo’s standard security cameras.</p><div class=\"c-float-right\"><aside id=\"ZHjOQq\"><q>Doorbell notifications arrive like a phone call</q></aside></div><p id=\"BQc0Um\">The Arlo is a nice-looking doorbell, taking <em>a lot</em> of design cues from the wired Nest Doorbell, although it’s slightly larger. There’s the option of all black or black with white trim. Both will work with your existing chime (the wire-free will have to be wired), and both can use Amazon Echo or Google Nest smart speakers to notify you of a visitor, plus <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.arlo.com%2Fen-us%2Faccessories%2FAC2001-100NAS.html&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22954554%2Fbest-video-doorbell-camera\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Arlo sells its own plug-in chime</a> with a choice of ringtones, for $50. </p><p id=\"meiJlT\">Finally, a unique feature about Arlo doorbells I really like is that when someone presses the doorbell the notification arrives like a phone call — as opposed to a pop-up. This makes it less likely you’ll miss a visitor, plus the doorbell will prompt them to leave a message if you do.</p><hr class=\"p-entry-hr\" id=\"YQZxyZ\"><h2 id=\"rWiofV\"><a href=\"https://www.theverge.com/2018/5/3/17312166/nest-hello-yale-lock-smart-home-review\">4. Nest Doorbell Wired (formerly Nest Hello)</a> </h2><h3 id=\"oyIQaW\">The best video doorbell for 24/7 recording </h3><h3 id=\"PPPt6y\">The best video doorbell that works with Google Home</h3><div id=\"5OUSYE\"><div data-anthem-component=\"productcard:11071056\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"zZyzFW\">The Nest Doorbell Wired is a true wired doorbell that has been around since 2018. Yes, that’s the Stone Age in smart home terms. But it remains one of the best smart video doorbells thanks to an excellent camera (1600 x 1200 HD resolution with a 2K sensor and HDR, and an 8x digital zoom), a 4:3 aspect ratio that gets most of your doorstep, facial recognition features that actually work, and the option of continuous video recording. It is the only video doorbell I’ve tested with that capability, so if you want to be able to scroll through a 24/7 timeline view of everything that’s happened in front of your door, the Nest is the one to get.</p><p id=\"wOJbR3\">Unlike the <a href=\"https://www.theverge.com/22710545/nest-doorbell-battery-cam-battery-test-review-price-specs-features\">newer Google Nest Doorbell (battery),</a> you do have to pay for Nest Aware to view any recorded footage and activate smart alerts for people and packages (from $6 a month / $60 a year) for 30 days of recorded clips on unlimited cameras). For $12 a month you can add 24/7 recording with 10 days of history and 60 days of recorded clips. You can also use the excellent, but effectively abandoned, Nest app rather than dealing with the mess that is the newer Google Home app. And there are alerts for sound, which no other doorbell I tested offers, making up somewhat for no animal alerts (you’ll get a sound notification if a dog’s barking, for example). </p><div class=\"c-float-right c-float-hang\"><aside id=\"5geJdg\"><q>The Nest’s elegant design is small enough to fit on most door jambs</q></aside></div><p id=\"qdEDUS\">The Nest works with existing chimes and can trigger Google Nest speakers to announce a doorbell press and even who is at the door (if you’ve activated and paid for the Familiar Faces feature). It has gorgeous video quality, great audio, and fast notifications. The live feed pulls up quickly and will automatically display on a Nest Hub, with two-way audio, making it a great option for Google Home users. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/QvcnkecWNmAZetuFFeTTbfF7fOQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10758413/fion_180428_2519_8687.jpg\">      <cite>Photo by Florence Ion for The Verge</cite>      <figcaption><em>The Nest Doorbell (wired) still works with the excellent Nest app, for now.</em></figcaption>  </figure><p id=\"WdVlQK\">The doorbell also still works with Amazon Alexa smart displays to show a live feed, which none of Nest’s newer cameras do. You can set multiple activity zones and get different notifications based on each one, and Google’s Home/Away feature can automatically switch the camera off when you come home if you don’t like seeing yourself on video. You can also respond to visitors with three quick replies and snooze alerts for up to three hours.</p><p id=\"5msLo6\">I love that the Nest is small enough to fit on most door jambs and its elegant design is still one of my favorites, although there’s only one color choice — black with a white frame. The biggest drawback here is that this is an older device whose motion detection technology isn’t the best. I got a lot of false alerts in my testing, and Ring’s improvements in this area make the Ring Pro 2 the better doorbell.</p><p id=\"CAqMuQ\">If you want a Nest Hello, grab one quickly, as Google has already announced a <a href=\"https://www.theverge.com/2021/9/29/22700859/google-nest-doorbell-wired-2nd-gen-launching-2022\">new Nest Doorbell Wired is in the works</a>, which could mean that this little beauty will soon be part of the smart home Hall of Fame. </p><hr class=\"p-entry-hr\" id=\"5BZ8Nk\"><h1 id=\"bxly7k\">5. Ring Video Doorbell 4 </h1><h3 id=\"Pd8O52\">The best battery-powered video doorbell </h3><div id=\"roILV1\"><div data-anthem-component=\"productcard:11070952\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"LQ0tzE\">If you have no choice but to rely on battery power, the Ring Video Doorbell 4 is my top pick. With good, clear 1080p HD video and the option of HDR if your porch is backlit, night vision, and dual-band Wi-Fi, the Ring 4 has a lot to offer. However, there are three significant issues: the battery barely lasted a month in my testing, its 16:9 aspect ratio gives you a wide, rectangular field of view that is too short to show your whole porch (as the Ring Pro 2 can), and there are no package alerts (the only smart alerts are for people). </p><div class=\"c-float-left c-float-hang\"><aside id=\"tpLQE8\"><q>Three low-powered cameras that capture four seconds of color pre-roll footage</q></aside></div><p id=\"M2EsLl\">But, the reason it’s my top battery-powered pick is that it’s the only battery-powered doorbell I tested that won’t miss your visitor arriving, thanks to three low-powered cameras that capture four seconds of color pre-roll footage. It also uses a removable rechargeable battery, so it’s easy to have an extra on hand to swap out. If you’re more concerned about seeing a package than the face of the person who put it there, the Eufy Dual is the best option for you, but for everyone else, the Ring 4 is the way to go.</p><p id=\"yuNJ6d\">The Ring 4 uses the excellent Ring app, and you can turn on snapshot mode to automatically take a picture every hour, 14 minutes, or five minutes for a better idea of what’s been happening at your door. You need a Ring Protect Plan for this and to enable people-only mode, which cuts down on unnecessary alerts. A subscription plan starts at $3 a month and adds 60 days of cloud storage for videos, plus useful rich notifications that show a snapshot of the video on your lock screen. This is useful as the Ring 4 can take a while to bring up a live view (a problem with most battery-powered doorbells).</p><p id=\"TJaHNl\">Free quick replies, which can be set to play automatically, are helpful here. I recommend setting up the “Hi! We’ll be right there” to keep your visitor around a bit longer while you wait for the app to load. As with all Ring Doorbells, the Ring 4 can announce visitors on Echo speakers and automatically pull up a two-way audio/video call on an Echo Show. It won’t work with your existing chime, unless you wire it, but Ring sells a plug-in chime.</p><hr class=\"p-entry-hr\" id=\"YVSU9I\"><h2 id=\"GL7Z3Z\"><a href=\"https://www.theverge.com/22939350/eufy-dual-video-doorbell-review-price-release-date\">6. Eufy Video Doorbell Dual </a></h2><h3 id=\"amJDoE\">The best video doorbell without a subscription</h3><div id=\"yZChqB\"><div data-anthem-component=\"productcard:11071065\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"83yOdH\">If you don’t want to pay any monthly fees but want a feature-packed doorbell, Eufy, the Anker smart home brand, has a number of options that use local storage on its HomeBase 2. The latest one, the <a href=\"https://www.amazon.com/eufy-Security-Battery-Powered-Detection-Recognition/dp/B099RX62SC?ots=1&amp;slotNum=2&amp;imprToken=9cbf9e0a-691b-4d32-be3&amp;tag=theverge02-20&amp;ascsubtag=%5B%5Dvg%5Bp%5D22703391%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Eufy Dual</a>, is the best, thanks to the addition of a second camera at the bottom to show the doorstep alongside the approach to your front door. </p><p id=\"YXKrBW\">A battery-powered doorbell (with the option of wiring to trickle charge the battery), the Eufy Dual doesn’t charge for storing video on the included HomeBase 2 (16GB provides up to 90 days of clips). If you already have a Eufy HomeBase 2, you can buy the Dual for $200. </p><p id=\"XNPPCI\">There’s also no charge for smart alerts that spot people and packages, and innovative AI features are free, too. These include “package live check assistance,” which frames any packages in a blue box and collects recent events around the delivery for quick viewing, and an uncollected package alert, which has the doorbell check for packages at a designated time, alerting you if you forgot to pick something up. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/C5f_uZUVxMmohJ1MR3gNeSm7WBE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242016/jtuohy_220209_5016_0001.jpg\">      <figcaption><em>The Eufy Dual comes with a Eufy HomeBase 2 that has to be hardwired to your router during setup, and which provides local storage.</em></figcaption>  </figure><p id=\"4OI76e\">However, as a battery-powered doorbell, the Dual has the same problem as others. No pre-roll footage means you may not get footage of the person as they approach your door, only when they’re in front of it or walking away. But its onboard machine learning, AI-powered smart alerts, and motion detection that use both PiR and radar mean no false alerts. And those two cameras give you a blind spot-free view of your front door area; one in 2K, the other in 1080P. The double vision feature also doesn’t rely on an awkward fish-eye view as some cameras do, and you can see plenty from side to side as well as a full view from top to bottom, making it handier as a security camera.</p><p id=\"Tyd6pC\">Battery life is very good, much better than the Ring 4’s, lasting about three months based on my testing (it claims three to six months). But you have to take the whole doorbell down to charge, which is a pain. The doorbell also only works over 2.5 GHz Wi-Fi but can ring your existing chime (when wired) and is compatible with both Amazon Alexa and Google Home, working with both companies’ smart displays to pull up a <a href=\"https://www.theverge.com/22949565/doorbell-video-nest-echo-show-alexa-google-how-to\">live feed of your doorbell</a>.</p><p id=\"YYyO4F\">For more on the camera and its performance and features, read <a href=\"https://www.theverge.com/22939350/eufy-dual-video-doorbell-review-price-release-date\">my in-depth Eufy Dual Doorbell review</a>.</p><hr class=\"p-entry-hr\" id=\"NIe0Rq\"><h2 id=\"ZcazYL\"><a href=\"https://www.theverge.com/22922576/belkin-wemo-video-doorbell-apple-homekit-camera-review\">7. Wemo Smart Video Doorbell </a></h2><h3 id=\"IScTVr\">The best video doorbell camera that works with Apple HomeKit</h3><div id=\"lsFGCa\"><div data-anthem-component=\"productcard:11071088\" data-anthem-component-data='{\"layout\":\"full_layout\"}'></div></div><p id=\"bFUQrM\">For a doorbell that works with Apple’s HomeKit smart home ecosystem, the new <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.belkin.com%2Fus%2Fsmart-home%2Fwemo%2Fwemo-smart-video-doorbell%2Fp%2Fp-wdc010%2F%3F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22954554%2Fbest-video-doorbell-camera\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Wemo Video Doorbell</a> from Belkin is the best choice. Fast, secure, and with support for HomeKit Secure Video, the Wemo has a decent 1200 x 1600 HD video stream with HDR, and a circular view that shows you the whole porch, although with a rather discombobulating fish-eye effect. But it’s a better view than the other good HomeKit option, the Logitech Circle View.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/LtA0tNTsu8Ln5uTGR18_trotQXM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23278071/IMG_1794.PNG\">      <figcaption><em>With rich notifications in HomeKit, you can talk to a visitor from your lock screen.</em></figcaption>  </figure></div><p id=\"Mz6GBs\">The Wemo is also easier to install than the Logitech, but both share a simple software setup (thanks to relying entirely on the Apple Home app — there’s no compatibility with the Wemo app). The doorbell recognizes multiple motion events (people, packages, animals, and vehicles) and can also identify faces and announce exactly who is at the door on a connected HomePod or HomePod Mini. You do need one of these (or another HomeKit hub) to effectively use the Wemo, and adding in that cost makes this an expensive doorbell. </p><p id=\"RPUKv8\">While daytime footage was good, night vision isn’t great, and I had some issues with it missing motion events and sending false alerts for people due to its reliance on pixel-based motion detection. However, the Wemo was very, very quick, with the speed from button push to a notification to pulling up the live video being under five seconds. It’s even quicker if you use the interactive notification on your device (through which you can talk to the visitor). And that speed makes up for some of its failings. </p><p id=\"oVEB4b\">The main reason to go with Wemo is for HomeKit Secure Video, Apple’s service that stores recorded video securely in your personal iCloud account. Additionally, video is processed locally on a HomeKit hub for the smart alerts, and only recorded video is sent to the cloud. However, there is no local storage option or 24/7 recording, and you have to pay for an iCloud Plus plan (starting at 99 cents per month) to view any captured clips.</p><p id=\"aprkms\">All things considered, it’s the best option for a HomeKit video doorbell right now. Read my <a href=\"https://www.theverge.com/22922576/belkin-wemo-video-doorbell-apple-homekit-camera-review\">full Wemo Video Doorbell review</a> for more details.</p><hr class=\"p-entry-hr\" id=\"TUJzkV\"><h2 id=\"pLUqwz\">What to look for in a video doorbell camera</h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ynkAiawXyFMTtylxsgGpJ48PmKM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226619/jtuohy_220121_5003_0002.jpg\">      <figcaption><em>There are a variety of video doorbell designs, but shades of gray and black are most common.</em></figcaption>  </figure><p id=\"fSlneD\">Besides an attractive design, a good video doorbell camera needs top-notch motion detection, the option of smart alerts and motion zones, affordable (or free) options for storing recorded videos, good quality video with HDR to help if your doorway is backlit, and useful smart home integrations, such as viewing the doorbell feed on a smart display. </p><p id=\"c7YuEl\">It should also have some way of ringing inside your house (not just through your smartphone), and ideally, can capture the space in front of your door top to bottom, so you can see packages and people equally well. </p><p id=\"LlCd0I\">Another important feature is how the doorbell is powered. My unequivocal recommendation is that if you have existing doorbell wires, use them. Buy a true wired doorbell camera and you never have to worry about charging your doorbell, plus recordings will catch your visitor arriving, not just leaving. The main downside is that if the power goes out, you won’t get any recordings.</p><h2 id=\"BsRCdV\">Wired vs. wireless doorbell cameras: what’s the difference?</h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kttJumiFD73CEqDQizNY_UAlRdQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242025/jtuohy_220209_5016_0010.jpg\">      <figcaption><em>Most doorbells can be wired to existing doorbell wiring, but only true wired doorbells are powered by your home’s electricity. Battery-powered doorbells are just trickle-charged when wired.</em></figcaption>  </figure><p id=\"0DINNz\">Wired video doorbells use existing doorbell wiring attached to a doorbell transformer and chime box to provide continuous power, so they don’t need to be recharged. Most won’t work when the power goes out, but some have small batteries to keep them going for a few minutes in the event of a power outage. If you don’t have existing wiring, you can use an AC power adapter (<a href=\"https://ring.com/products/video-doorbell-plugin-adapter-gen-2\">Ring</a> and <a href=\"https://store.google.com/us/product/ninety7_indoor_power_adapter_nest_hello?hl=en-US\">Nest</a> sell their own; you can also find <a href=\"https://www.amazon.com/Certified-Transformer-Doorbell-Compatible-Doorbells/dp/B07YDN4Q96?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">generic ones</a>). </p><p id=\"mAczsc\">Battery-powered doorbells, also known as wireless doorbells (a misnomer, as all video doorbells connect wirelessly to the internet), are powered by a rechargeable battery. Because they don’t have continuous power, they have to wake up first when they detect motion before starting to record. This often results in a clip only catching the back of the person’s head as they walk away, which is not super helpful if you’re concerned about porch pirates. True wired doorbells don’t have this problem, and most will reliably catch all the action.</p><p id=\"0bCe4G\">Many doorbells that advertise themselves as wireless and run on a battery can also be hard-wired to your existing doorbell wiring. But these are not “true” wired doorbells. They aren’t being powered by your home’s electrical power. Instead, in almost all cases (Blink being the only exception), the battery is being “trickle charged” by the power from the doorbell wiring. This means that without any extra features, they simply don’t react as quickly as true wired doorbells. It’s science, people.</p><h2 id=\"hRx7tb\">What is aspect ratio on a doorbell camera and why is it important?</h2><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rhGs2WAshDRj_CKOFLJG2rE8EGk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23278031/IMG_2022.PNG\">      <figcaption><em>The Blink Video Doorbell has a 16:9 aspect ratio.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ZkBt0wIAWu-zC32rgJNFUfiiFyM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23278040/IMG_2021_2.PNG\">      <figcaption><em>The Ring Video Doorbell Pro 2 has a 1:1 aspect ratio.</em></figcaption>  </figure></div></div></div><p id=\"XL8fue\">Aspect ratio is arguably more important than video resolution when it comes to video doorbells. This spec tells you what shape of video you will get; whether it’s top-to-bottom or side-to-side, so, whether you’ll see your doorstep and the whole of the visitor, or just a head-and-shoulders shot. Common aspect ratios include 4:3, 3:4, 16:9, and 1:1.</p><p id=\"xWC5dV\">Aspect ratios are always written with the horizontal number first. If the first number is smaller than the second number, then the image will be taller than it is wide, or “portrait orientation.” If the first number is larger than the second (as in 16:9), then the image will be wider than it is tall, or “landscape orientation.” If both numbers are the same, as in 1:1, it will be a square view.</p><p id=\"20UBPq\">My recommendation is to go for a square view when possible, but if you have a wide porch area — and would like to see people approaching from the left or right, as well as straight on — a 4:3 or 16:9 might suit you better.</p><h2 id=\"c4lcSW\">How to install a video doorbell camera</h2>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/s_EExAiigm6SmnGsr_OSlXwqYaA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23226623/jtuohy_220125_5003_0008.jpg\">      <figcaption><em>Installing a wired video doorbell camera involves connecting a chime power kit to your indoor chime box to help power the camera.</em></figcaption>  </figure><p id=\"z1TGrD\">Battery-powered doorbells are easy to install and generally just require screwing the mounting bracket to the area around your door. Some come with the option of tape strips so you don’t even need to get out the screwdriver. </p><p id=\"cOa13W\">Wired doorbells require a bit more effort. And while you can choose to pay around $100 for a professional to install it, if you have existing doorbell wiring, it’s a simple job.</p><p id=\"2zfmhZ\">The steps generally involve the following:</p><ol><li id=\"qUpwaG\">Turn off the power to your doorbell wiring</li><li id=\"fgbwUi\">Locate your indoor chime and connect the chime power connector that came with the doorbell (this helps to facilitate power to the new doorbell)</li><li id=\"Z1ZJiv\">Remove your old doorbell</li><li id=\"PAiyKz\">Attach the mount for your new doorbell using screws or double-sided tape (some have the option of an angled wedge to get a better view of the person in front of the door)</li><li id=\"4y2HuP\">Attach the doorbell wires to the connector screws on the doorbell</li><li id=\"01DihN\">Attach the doorbell to the mount, either with screws or by snapping it on</li><li id=\"N04dBQ\">Turn the power back on</li></ol><p id=\"34OVXJ\"><em><strong>Pro tip:</strong></em> Before installing any doorbell, download the manufacturer’s app and check the instructions — some cameras need to be paired to the app before mounting them.</p><p id=\"mlF15G\"><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/DBNoj5pK2-8A01RIhnS22djp1VY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23241501/VRG_ILLO_5012_K_Radtke_Doorbell_Buying_Guide.jpg",
  "description": "We tested dozens of video doorbells to find the best buzzer  for you.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}