{
  "title": "The latest version of color E Ink brings us closer to the perfect tablet",
  "url": "https://www.theverge.com/2022/4/25/23041407/e-ink-color-gallery-3-announced",
  "date": "2022-04-25T21:46:34.000Z",
  "author": "Alex Cranz",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/iiSMI2J62FEkioq0M3M-woDZODk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70792472/E_Ink.0.jpg\" />        <figcaption>E Ink / The Verge</figcaption>    </figure>  <p id=\"l4fSAM\">E Ink <a href=\"https://www.businesswire.com/news/home/20220425005064/en/E-Ink-Launches-E-Ink-Gallery-3-Color-ePaper-for-Sustainable-Digital-Reading\">has a new version of color electronic paper</a>, and while it isn’t as pretty as an OLED or possessing the new tech sheen of stuff like <a href=\"https://www.theverge.com/2021/4/21/22395449/apple-ipad-pro-2021-liquid-retina-xdr-mini-led-explainer\">mini</a>- and <a href=\"https://www.theverge.com/22884014/tv-features-hardware-screens-hdmi-hdr-vrr-oled-mini-led\">microLED</a>, E Ink Gallery 3 sure is easy on the eyes. Gallery 3 isn’t quite as fast as the E Ink found in your Kindle, but it has some absolutely stellar upgrades compared to previous versions of the Gallery technology and brings us a whole lot closer to a color E Ink screen that big companies like Amazon might actually risk putting in a tablet. </p><p id=\"Js0OIe\">Currently, a handful of companies are making color E Ink tablets based on E Ink’s <em>other</em>  color technology, Kaleido. Those include the PocketBook Color (really neat!) and the Boox Nova3 Color (cooler in theory than in practice). Kaleido was E Ink’s first attempt at color E Ink that came in a gadget most people could buy. It relies on a traditional black and white E Ink display with a color filter laid over the top possessing red, green, and blue pigments. I’ve used a few products based on that tech, and while it's neat to see comics and covers of books rendered in color, Kaleido has thus far been a pretty disappointing experience. Instead of the more paper-like white of black and white E Ink, Kaleido is this... muddy greenish gray thanks to that color filter. Colors only pop when the backlight is engaged or the full force of the sun is streaming down on it. Resolution is also crummy. Black and white E Ink has a crisp resolution of 300 dpi, but Kaleido, depending on the version, is 100 to 150 dpi. The effect is noticeable and frankly unpleasant. <a href=\"https://goodereader.com/blog/e-paper/e-ink-kaleido-3-color-e-paper-is-now-available\">E Ink showed of Kaleido 3 earlier this month</a> and it should fix some of the issues I’ve had with the last version, Kaleido Plus, but muddy colors and a reliance on a backlight still appear to be part of Kaleido’s deal.</p><p id=\"TgAOzn\">Gallery 3 appears to do away with some of Kaleido’s biggest flaws. Instead of 4,096 colors, it can produce over 50,000, all at 300 dpi. No backlight appears to be needed for eye catching colors—though in the press release E Ink claims Gallery 3 will have a front lit LED that should cut down on blue light emissions. The reason previous versions of the Gallery color tech maintained a similar gamut of colors at a similar resolution but haven’t been found in consumer devices. That’s because previous versions were slow as molasses. Full-color pages in the last version took a whopping 10 seconds to change. In Gallery 3 that time has dropped to just 1,500 milliseconds (or 1.5 seconds) when the mode is chosen to optimize quality over speed. When speed is preferred over quality that time drops to 350ms. That’s still excruciatingly slow when you’re used to an iPad Mini refreshes 60 times a second, but that’s a massive leap in speed from generation to generation.</p><div id=\"bYguLy\"><div ><iframe src=\"https://www.youtube.com/embed/e_YguTm3D1Q?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"gIsWNe\">And it’s the big leap in improvements generation over generation that has me excited. E Ink needs to improve its refresh rate dramatically if it wants to compete with displays refreshing 60 times a second or more. This kind of leap in performance, generation over generation, might not be a fluke but a sign of a company really getting...up to speed. </p><p id=\"bgLmEP\">And that means we could see actual color E Ink products competing against OLED and LCD tech. Given how much easier E Ink is on the eyes, how much better it performs in sunlight, and how much longer it lasts on a charge, an E Ink tablet would theoretically be the platonic ideal if page refresh tech can get fast enough.</p><p id=\"9yFPDx\">And E Ink is probably thinking that too. E Ink released two demo videos alongside its announcement. One shows an E Ink displayunfurling like the dozens of rollable OLED demos we’ve seen and the other shows E Ink bending like a whole line of Samsung phones might.</p><div id=\"qtA6V2\"><div ><iframe src=\"https://www.youtube.com/embed/omD3BIh9Czs?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"axCHeA\">Again, this tech isn’t quite at the same fidelity as what you’ll find in a folding phone, or even a rolling phone right now. But it's a step in a very cool direction.</p><p id=\"rdwTT5\">E Ink hasn’t said which companies, if any, will be putting Gallery 3 tech in a tablet or phone, but companies like Boox and PocketBook have shown a real willingness to play around with the next tech and explore what all an E Ink tablet can do besides let you read a book. I wouldn’t be surprised if we see an announcement from one of those companies, or the growing number of E Ink tablet makers in China, by the end of the year.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/A8sRU_km8ZHdZYHKQHegGE5PVlw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23415597/E_Ink.jpg",
  "description": "More color and faster refresh rates",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}