{
  "title": "The Department of Energy to dole out $3.5 billion for carbon removal hubs ",
  "url": "https://www.theverge.com/2022/5/19/23131286/energy-department-3-5-billion-carbon-removal-hubs",
  "date": "2022-05-19T21:46:53.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"World’s Largest Carbon-Sucking Plant Starts Making Tiny Dent in Emissions\" src=\"https://cdn.vox-cdn.com/thumbor/IFMOZGLsDJS-qzmvzKvudgbj_K0=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70889673/1235138842.0.jpg\" />        <figcaption>Intake fans on collector containers at the ‘Orca’ direct air capture and storage facility, operated by Climeworks AG, in Hellisheidi, Iceland, on Tuesday, Sept. 7, 2021.&nbsp; | Arnaldur Halldorsson/Bloomberg via Getty Images</figcaption>    </figure>  <p id=\"gZkHlD\">The Department of Energy (DOE) just <a href=\"https://www.energy.gov/articles/biden-administration-launches-35-billion-program-capture-carbon-pollution-air-0\">launched</a> a new $3.5 billion program to take carbon dioxide out of the atmosphere and store it away. The program focuses on developing four “hubs” across the country focused on direct air capture, the technology that draws CO2 out of the air. </p><p id=\"CQghCc\">Each of the hubs is ultimately supposed to be able to capture and store at least a million metric tons of CO2. That’s a <a href=\"https://www.theverge.com/2022/4/7/23013822/carbon-dioxide-removal-direct-air-capture-climate-change\">massive endeavor</a>. Currently, all the direct air capture facilities in the world only have the capacity to capture about <a href=\"https://www.iea.org/reports/direct-air-capture\">0.01 million metric tons</a> of CO2. </p><p id=\"zRcwGE\">Today, the DOE filed a <a href=\"https://www.fedconnect.net/FedConnect/default.aspx?ReturnUrl=%2ffedconnect%3fdoc%3dDE-FOA-0002746%26agency%3dDOE&amp;doc=DE-FOA-0002746&amp;agency=DOE\">Notice of Intent</a> — a kind of official “heads-up” — that says that they’ll be making a funding announcement related to those hubs “in the fourth quarter of Fiscal Year 2022.” At that point, companies can apply for funds to develop projects that will “contribute to the development” of those hubs.<strong> </strong>The funding comes from the Bipartisan Infrastructure Law passed last year and is supposed to be deployed between 2022 and 2026. The Biden administration is billing this effort as part of its <a href=\"https://www.theverge.com/2021/4/22/22394366/joe-biden-pledge-us-greenhouse-gas-emissions-2030\">plan</a> to reduce the United States’ greenhouse gas emissions by at least 50 percent this decade compared to 2005 pollution levels.</p><div class=\"c-float-right\"><aside id=\"ncMEYq\"><q>By lumping different projects together into hubs, they can cut costs and scale up quickly</q></aside></div><p id=\"WXf9s4\">For projects to be eligible for the funding, they have to meet certain criteria. They need to be able to permanently store the CO2, rather than using it in products like <a href=\"https://grist.org/article/direct-air-carbon-capture-global-thermostat/\">fizzy drinks</a>. That ensures that the greenhouse gas doesn’t quickly wind up in the atmosphere again. The DOE is also barring any projects that would use the captured CO2 to produce more fossil fuels. That excludes the oil and gas industry’s “<a href=\"https://www.energy.gov/fecm/science-innovation/oil-gas-research/enhanced-oil-recovery\">enhanced oil recovery</a>,” a technique that involves shooting captured carbon dioxide<strong> </strong>into the ground to force out hard-to-reach oil reserves. </p><p id=\"u6xRK4\">The exact locations of the hubs haven’t been decided yet, but the government hopes that by lumping different projects together into hubs, they can <a href=\"https://www.catf.us/2021/04/decarbonisation-hubs-carbon-reduction/\">cut costs and scale up quickly</a>. Ideally, different facilities would be able to share the same infrastructure — i.e., <a href=\"https://www.theverge.com/2021/8/3/22606395/pipeline-battle-co2-removal-carbon-capture-bipartisan-infrastructure\">pipelines</a> to transport the captured CO2 to somewhere it can be stored nearby. </p><p id=\"3KINgO\">The plan is for at least two of the hubs to be located in “economically distressed communities in the regions of the United States with high levels of coal, oil, or natural gas resources.” Some advocates from communities already surrounded by a lot of polluting facilities, however, are <a href=\"https://climatejusticealliance.org/bbb-and-infrastructure/\">wary</a> about carbon removal projects burdening them with even more industrial infrastructure. The DOE said in its announcement that it would consult communities that might be affected.</p><div class=\"c-float-right\"><aside id=\"dmxJzc\"><q>It looks like the Gulf Coast could be a prime candidate </q></aside></div><p id=\"XkZUCA\">The DOE will also be looking for regions with other kinds of heavily polluting industry. While this round of funding excludes similar technologies that scrub CO2 out of smokestack emissions instead of the ambient air, siting these different technologies near each other might also allow them all to share the same pipelines to cut down costs. And since the oil and gas industry has experience with building pipelines, <a href=\"https://www.theverge.com/2021/8/26/22642806/co2-pipeline-explosion-satartia-mississippi-carbon-capture\">including those for CO2</a>, having that expertise nearby could come in handy during the build-out of these hubs.</p><p id=\"PqXgQr\">Taking all that into consideration, it looks like the Gulf Coast could be a prime candidate for such hubs since it has a long history with oil, gas, and petrochemicals. On top of that, there’s already speculation that oil and gas companies are <a href=\"https://www.theverge.com/2022/1/31/22910757/federal-court-decision-carbon-capture-storage-gulf-of-mexico-exxonmobile\">eyeing the bottom of the Gulf of Mexico</a> as a place to deposit captured CO2. We’ll likely learn more about the project in the funding announcement later this year.  </p><p id=\"jFaQnK\"></p><p id=\"l3tF3T\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MRmYWpAUYzx4PcrwnUvB889XomU=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23575799/1235138842.jpg",
  "description": "The Gulf Coast might be a prime location.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}