{
  "title": "The best smartphone you can buy for under $500",
  "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
  "date": "2022-05-18T22:19:40.000Z",
  "author": "Allison Johnson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uD06OA77PuqkkmuRF72-PonUw4I=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/67732462/Best_phone_grid_16x9_2022_v2.12.jpg\" />    </figure>  <p>You can get a great smartphone at this price, whether you want an iPhone, a 90Hz screen, or 5G support</p> <p class=\"p--has-dropcap p-large-text\" id=\"7By4QV\">If you’re shopping for a new phone on a budget, we’ve got good news: you’re more likely to find midrange sub-$500 phones available in these days of crunched supply chains than many of the recent flagships. Fortunately, there are many excellent alternatives to the pricey, premium models that are nearly as capable and cost a lot less to boot.</p><p id=\"WU3Cg6\">Companies like Apple, Google, and Samsung are spreading the wealth of features enjoyed by their flagships down to less expensive options. Other brands like TCL are also finding ways to challenge more established manufacturers with lower prices and more premium features.</p><p id=\"xoCnCZ\">The bad news is this makes the job of picking the best budget phone<em> that </em>much harder. It’s impossible to buy a phone that does everything well at this price point. So prioritize the features that matter most to you, whether it’s 5G compatibility with a particular network, high-resolution screen, low price, best camera, or longevity with software updates. It’s difficult to get straight A’s in every single one of these needs, but if you’re able to tolerate the occasional B, you’ll find a phone you’ll love. We recommend getting an unlocked phone for the best price and portability, but you might find better deals by buying through a carrier and signing up for a wireless plan.</p><p id=\"Svhy7y\">Our pick for the best inexpensive iPhone is the 2022 edition of the <a href=\"https://www.theverge.com/2020/4/22/21230308/apple-iphone-se-2-2020-review-features-specs-camera-price\">Apple iPhone SE</a>. You’ll need to be comfortable using a small screen because its 4.7-inch display is starting to feel very cramped in this era of giant displays, but otherwise, this latest iteration of the SE does exactly what the previous generations have done: offer a low-cost entry point to Apple’s iOS ecosystem from a device that will last upwards of five years if you take care of it.</p><p id=\"mprVHy\">If you’re looking for the best budget Android phone, then the <a href=\"https://www.theverge.com/23015400/samsung-galaxy-a53-5g-review-specs-price-screen-camera\">Samsung Galaxy A53 5G</a> is our top choice. It features one of the best screens in the class, with a fast refresh rate for smooth animations and scrolling. It’s also backed by the longest software support policy you’ll find among Android phone makers, with five years of security updates promised. </p><div id=\"PuCkqJ\"><div data-anthem-component=\"productcard:11124510\"></div></div><div id=\"RvhA7v\"><div data-anthem-component=\"productcard:11191489\"></div></div><hr class=\"p-entry-hr\" id=\"GatTSx\"><h1 id=\"xLIfAi\">The best smartphone for under $500 in 2022</h1><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VbW5M91jdAENMNsqzHuoSetHpn4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23307883/ajohnson_221103_5070_0003.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The 2022 iPhone SE is a low-cost entry point to the iOS ecosystem.</em></figcaption>  </figure></div><h2 id=\"PEjixV\">1. <a href=\"https://www.theverge.com/22975531/apple-iphone-se-2022-review-price-specs-screen-battery\">Apple iPhone SE 2022 (third-generation)</a></h2><h3 id=\"YvXuY9\">The best iPhone under $500</h3><p id=\"psGPF7\">The iPhone SE remains undefeated as the best value proposition on the smartphone market, period. Even though the price went up $30 over the second-gen version, it’s still a great deal at $429 when you consider that it will continue receiving iOS updates for upwards of five, even six or seven years.</p><p id=\"ZnVNY0\">However, there’s one major consideration to make if you’re ready to pick up an SE and coast through most of the next decade without having to buy a new phone: living with its very small, very dated 4.7-inch screen. It’s the same one that the iPhone 6 used, and it’s starting to feel very cramped in an age when apps and web pages are designed for bigger screens. The SE’s big bezels make the device look dated, too, but really the usability of a small screen over the years to come is the important factor to consider.</p><div class=\"c-float-right c-float-hang\"><aside id=\"vEPwFk\"><q>There’s no night mode for brighter photos in very low light, which is a curious omission</q></aside></div><p id=\"ku3Nhi\">That’s the biggest knock against the SE. Otherwise, it’s a fantastic midrange device. Its A15 processor is the same as Apple’s top-tier iPhone 13 Pro Max, so performance is excellent. There’s IP67 waterproofing — uncommon in this price range — and even though it uses the same 12-megapixel camera that iPhones have used since the dawn of time, it takes very nice photos and high-quality video clips. There’s no night mode for brighter photos in very low light, which is a curious omission. Many other midrange phones offer some sort of low-light photo mode, and the phone’s processor is certainly up to the task. Apple gonna Apple.</p><p id=\"EHQR6Y\">This generation SE, of course, offers 5G connectivity — just low- and mid-band, which is fine. You won’t get the fast millimeter wave 5G you might encounter in an NFL stadium, but it’s nothing to lose sleep over. Battery life is also improved over the last generation, and it will generally last a full day unless you really push it with demanding tasks like gaming and streaming video.</p><p id=\"0OkYFn\">If you can live with the small screen and you aren’t bothered by the lack of night mode, we recommend picking up the 128GB version. The base model’s 64GB of storage isn’t quite enough, and you’ll be glad you spent the extra $50 when you’re using this phone for years into the future.</p><hr class=\"p-entry-hr\" id=\"smYbEU\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oLE3ty_D6326ePYrOAV_mWKlGFg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23371623/ajohnson_220405_5129_0005.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The Galaxy A53 5G provides some uncommon budget-class features like waterproofing and a stabilized main camera.</em></figcaption>  </figure></div><h2 id=\"B9aQm4\">2. <a href=\"https://www.theverge.com/23015400/samsung-galaxy-a53-5g-review-specs-price-screen-camera\">Samsung Galaxy A53 5G</a></h2><h3 id=\"Wx2m8G\">The best Android phone under $500</h3><p id=\"tG8OqZ\">The Samsung A53 5G offers an outstanding value for its $449 MSRP. It has one of the best screens in its class — no surprise from display maker Samsung — with a 6.5-inch 1080p OLED that provides richer contrast than the LCDs that are common in this category. It also uses a top refresh rate of 120Hz, which makes for smooth scrolling and a little bit more of a “premium” experience.</p><p id=\"AD94vy\">The A53 5G’s battery lasts a full day of use, and performance from the Exynos processor gets through daily tasks fairly smoothly. The phone’s main 64-megapixel camera is a cut above the usually unremarkable cameras in this class, with optical image stabilization to help get more sharp shots in poor lighting conditions. </p><div class=\"c-float-left c-float-hang\"><aside id=\"rlD2XS\"><q>The A53 5G’s best feature might just be its excellent software support policy</q></aside></div><p id=\"0tZuwn\">It stands out from other budget Android phones in a lot of ways, but the A53 5G’s best feature might just be its excellent software support policy. Samsung has promised four years of Android OS version updates and five years of security updates. That gives the A53 5G an exceptionally long shelf life, especially among Android phones where two or three years of security updates is more common. Considering that the phone is also IP67 rated for dust and water resistance, it should last a very long time.</p><p id=\"nAdJre\">It’s worth noting that Google will be launching its Pixel 6A this summer, which is really the only device on the horizon that could give the A53 a run for its money. On paper at least, it compares well — with a five-year security support policy to match Samsung (though only three years of OS upgrades promised). But the A53 sets a high bar for the Pixel 6A, and right now, it’s easily the best Android phone in the class. </p><hr class=\"p-entry-hr\" id=\"0FM1jw\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"TCL 20S\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/IyD38njcgbawWivV9S0_l-sDoHQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23010104/gsin_211112_4876_0002.jpg\">      <cite>Photo by Gloria Sin / The Verge</cite>      <figcaption><em>The TCL 20S has an usually vibrant screen for its class, thanks to TCL’s television display expertise.</em></figcaption>  </figure></div><h2 id=\"bFMC0d\">3. <a href=\"https://www.theverge.com/22717002/tcl-20s-and-20se-review-budget-affordable-unlocked-smartphone\">TCL 20S</a></h2><h3 id=\"Oj4ljX\">The best 4G phone under $300</h3><p id=\"npapoA\">The TCL 20S is proof that even $250 can buy a good phone without many compromises. It just nails all the basics that anyone would want from a phone: good performance, a good screen, and good battery life, all for a good price.</p><p id=\"uRkfu4\">You might recognize the TCL brand from its popular budget smart TVs, where its screen expertise is what makes the TCL 20S’ vibrant, 6.67-inch 1080p screen a standout. The 20S has a layer of fingerprint-resistant, “micron-sized prismatic crystals’’ on its back that gives it a subtle shimmer. It has a quick fingerprint sensor that is built into its power button, as well as face unlock as an additional option.</p><div class=\"c-float-right c-float-hang\"><aside id=\"HhlvTs\"><q>For the best bang for your buck, the $250 TCL 20S is a solid choice</q></aside></div><p id=\"rA2h68\">While the 20S’ camera system is nothing to write home about, its 64-megapixel main camera and 15-megapixel front camera are both more than capable of taking detailed photos in good lighting conditions — just don’t use them for night or macro photography.</p><p id=\"xLPoSw\">For a budget phone, the 20S has no noticeable lag in performance, thanks to its Qualcomm Snapdragon 665 processor and 4GB of RAM. By default, it comes with 128GB of internal storage, a microSD card slot, a 3.5mm audio jack, and a 5,000mAh battery that lasts for around two days without a recharge.</p><p id=\"Ijydf9\">If your budget is sub-$300 and you are on the hunt for the best bang for your buck, the $250 TCL 20S is a solid choice that should work on all major 4G networks in the US.</p><div id=\"FtL0ba\"><div data-anthem-component=\"productcard:10861755\"></div></div><hr class=\"p-entry-hr\" id=\"PNDiYl\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/exupepktApYiQyWFy5QUaXPP8pM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23385634/ajohnson_220411_5138_0004.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The Moto G Stylus has an approachable stylus feature set.</em></figcaption>  </figure></div><h2 id=\"2pPPrl\">4. <a href=\"https://www.theverge.com/23025548/motorola-moto-g-stylus-2022-review-specs-screen-battery-price\">Motorola Moto G Stylus (2022)</a></h2><h3 id=\"0wGhHB\">The best budget phone with a stylus</h3><p id=\"8bNLIA\">It’s slim pickings if you want a new budget phone with a stylus. With<a href=\"https://www.theverge.com/2021/4/4/22346084/lg-exits-smartphone-business\"> LG exiting the smartphone market</a> and <a href=\"https://www.theverge.com/22941246/samsung-galaxy-s22-ultra-review-price-screen-specs-stylus\">Samsung’s Galaxy S22 <s>Note</s> Ultra</a> in a much higher price bracket, there’s only Motorola’s Moto G Stylus left to hold the line. </p><p id=\"kIoxm8\">This year’s edition of the 4G-only Moto G Stylus continues to offer an excellent balance of features and cost-saving measures. It’s a good phone for the price, whether you’re a stylus devotee or just stylus-curious. </p><p id=\"BbKsRV\">It has a big 6.8-inch LCD display at 1080p resolution, good battery life with its 5,000mAh cell, and ample internal storage with 128GB of capacity. With a capable MediaTek Helio G88 processor and a healthy 6GB of RAM, the G Stylus performs well with everyday tasks. The cameras, though flawed, are good enough to get by. You won’t find an amazing night mode or top-notch picture quality here, but for a sub-$300 phone, it does the job just fine.</p><div class=\"c-float-right c-float-hang\"><aside id=\"JRUzdL\"><q>It’s a good phone for the price, whether you’re a stylus devotee or just stylus-curious</q></aside></div><p id=\"kyRHCq\">The Moto G Stylus’ stylus is built into the device like the Galaxy S22 Ultra. Popping it out brings up a quick menu of shortcuts to stylus-friendly apps, like its coloring book app. It’s a feature set intended for a more casual user than the likes of the S22 Ultra and, as a result, feels more approachable.</p><p id=\"Q6Y0rd\">It is a bit of a drawback that this version of the G Stylus doesn’t offer 5G (Motorola offers a higher-spec’d, midrange model that does) and 5G networks on all US carriers will improve substantially over the next few years. But if you’re perfectly happy with 4G speeds and you’re looking for a good deal on a phone with a big screen, this is a great option.</p><div id=\"fjmzFX\"><div data-anthem-component=\"productcard:11191513\"></div></div><hr class=\"p-entry-hr\" id=\"UcHD0D\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Moto G Pure phone.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HPsy2yP9PjUDDftJPGGR4i7dKj0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22956984/gsin_190209_4806_0008.jpg\">      <cite>Photo by Gloria Sin / The Verge</cite>      <figcaption><em>Plan to add a microSD card to your purchase to complement the Moto G Pure’s paltry 32GB of built-in storage.</em></figcaption>  </figure></div><h2 id=\"Qq9tmB\">5. <a href=\"https://www.theverge.com/22787370/moto-g-pure-review-4g-android-budget-phone\">Motorola Moto G Pure</a></h2><h3 id=\"tXDuyi\">The best 4G phone under $200</h3><p id=\"RJ53J5\">The Motorola Moto G Pure gets a lot right for its very low price: just $140, permanently marked down from $160. It’s a 4G-only phone, and its biggest weak point is a slower processor — everything from opening a web page to switching apps takes just a beat longer than on most other budget phones. But as a tradeoff, it includes a capable 13-megapixel rear camera and good battery life that should take most users through a full day and well into the next.</p><p id=\"X2MJlm\">The Moto G Pure only includes 32GB of storage, and that’s not really enough, considering the Android OS will take up almost half of that. Thankfully, you can add more storage via the microSD card slot. If you don’t have one already, just plan on budgeting an extra $15 or $20 for a microSD card with the purchase of this phone.</p><div id=\"hrRekQ\"><div data-anthem-component=\"productcard:10885230\"></div></div><hr class=\"p-entry-hr\" id=\"jpOqcd\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yF9Z_A9QsWFrzV7pFw5Gye-BYy8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23418319/ajohnson_220425_5165_0004.jpg\">      <cite>Photo by Allison Johnson / The Verge</cite>      <figcaption><em>The N20 5G includes a 1080p OLED screen, with richer contrast than the LCDs common in this class.</em></figcaption>  </figure></div><h2 id=\"MftneE\">6. <a href=\"https://www.theverge.com/23044768/oneplus-nord-n20-5g-review-price-screen-specs-camera-battery\">OnePlus Nord N20 5G</a></h2><h3 id=\"EnVYUC\">The best budget phone on T-Mobile</h3><p id=\"84qqeB\">The OnePlus N20 5G is a $280 phone that feels like it should cost a lot more. It offers a 6.4-inch screen with good 1080p resolution. Better yet, it’s an OLED panel in a category where lower-contrast LCDs are much more common. As a tradeoff, you’ll have to make do with a standard 60Hz refresh rate. But unless you’re coming from a phone with a faster 90Hz or 120Hz screen, you won’t know the difference. Refresh rate aside, it’s a good screen that’s enjoyable to use. Plus, there’s a good fingerprint scanner under the display that makes unlocking the phone a frustration-free experience.</p><p id=\"zeYCVY\">The N20 5G is equipped with a good Snapdragon 695 processor and generous 6GB of RAM for very good daily performance. A charger is included in the box to support the phone’s fast 33W wired charging — another feature you’d be hard pressed to find in any of the N20’s competitors. You can charge the phone from 0 to 30 percent in just 20 minutes, which is really helpful if you’re in a jam and need a quick battery boost.</p><div class=\"c-float-right c-float-hang\"><aside id=\"4J7k6i\"><q>A charger is included in the box to support the phone’s fast 33W wired charging</q></aside></div><p id=\"5IRH0z\">Camera quality is a bit of a weak point for the N20. The main rear 64-megapixel camera is fine; the other two cameras (a low-res macro and a monochrome sensor) are best ignored. The phone also ships with Android 11, which is a version behind most other new Android phones at this point. </p><p id=\"qmK2K4\">At launch, it’s only available through T-Mobile, where it supports the carrier’s sub-6GHz 5G. OnePlus will sell it unlocked at some point, but it’s unlikely to offer any kind of meaningful 5G support at AT&amp;T or Verizon. For the moment, though, it’s a great budget option if you’re on T-Mobile. </p><div id=\"a0Bq79\"><div data-anthem-component=\"productcard:11191532\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/nrgeNX-H9ojTqVkwlxYb-l6HNG8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23545539/Best_phone_grid_16x9_2022_v2.jpg",
  "description": "Find a great phone at this price — just know your goals.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}