{
  "title": "The iPod made the iPhone possible",
  "url": "https://www.theverge.com/2022/5/11/23065643/apple-ipod-iphone-revitalization-mobile-devices",
  "date": "2022-05-11T13:00:00.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/40FRPkQY4xjFAh3JSPR_Piab5NY=/471x116:2787x1660/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70856003/Screen_Shot_2022_05_10_at_11.21.46.0.png\" />        <figcaption><em>When announcing the iPhone, Steve Jobs joked about it looking like an iPod with a rotary dial.</em> | Image: Apple, via John Schroter on YouTube</figcaption>    </figure>  <p id=\"K5spHd\">This week, Apple announced that it’s <a href=\"https://www.theverge.com/2022/5/10/23065412/apple-ipod-touch-canceled-discontinued\">discontinuing the iPod Touch</a>, its last product with the “iPod” name. More than 20 years after the original iPod was announced, and after over a decade in the shadow of the iPhone, it can be hard to remember just how important the device was to Apple. But the music player helped define the company we know today — and was a big factor in bringing it back from the brink of ruin.</p><p id=\"xHuuuu\">The story of Apple’s comeback has been told over and over to the point of <a href=\"https://www.theverge.com/2015/10/6/9461209/steve-jobs-movie-review-aaron-sorkin-danny-boyle-michael-fassbender\">becoming mythologized</a>, so I’ll try to keep it brief. The 1990s were not kind to the company, almost leaving it bankrupt. By the turn of the century, though, things were starting to turn around: the iMac G3 was selling well, and Apple’s revenue was starting to grow again. But while the original iMac stabilized Apple as a company, Apple was <a href=\"https://lowendmac.com/2003/apple-has-always-been-a-niche-player/\">still a niche player</a> when it came to the overall consumer electronics market.</p><div class=\"c-float-right\"><aside id=\"GfDKQO\"><q>iPod sales rescued Apple from its niche in the PC market</q></aside></div><p id=\"ojWnxN\">Enter the iPod. In October 2001, Steve Jobs <a href=\"https://youtu.be/Mc_FiHTITHE?t=681\">introduced the now-iconic portable music player</a>, which synced to your Mac over FireWire, and held 1,000 MP3 songs on a 5GB hard drive. It wasn’t the first portable media player, but one of <a href=\"https://vimeo.com/2044097\">the iPod’s first commercials</a> (which featured plenty of dancing but <a href=\"https://www.theverge.com/2016/4/1/11340526/ipod-commercial-throwback-songs-apple-anniversary\">no silhouettes</a>) instantly showed why you’d want one: with just a few clicks, you could take your computer’s music library on the go with a device that fit in your pocket.</p><p id=\"Qj8FY3\">iPod sales exploded over the next few years as Apple introduced more models and added Windows support. In 2002, Apple sold around 400,000 iPods, <a href=\"https://www.statista.com/chart/10469/apple-ipod-sales/\">according to Statista</a>. By 2006, Apple was <a href=\"https://www.apple.com/newsroom/2006/10/18Apple-Reports-Preliminary-Fourth-Quarter-Results/\">selling 39 million of them a year</a>. The iPod had quickly outstripped the Mac in terms of units sold, reaching a far wider audience and, critically, making the general public familiar with Apple as a company that makes products you carry around in your pocket.</p><p id=\"p9Vfzc\">And the sales kept growing. According to Statista, the company would sell over 51 million in 2007. But that was the year Apple introduced its next big thing: the iPhone.</p><p id=\"lUHgeU\">The iPod looms large over the iPhone’s announcement — so much so that <a href=\"https://youtu.be/MnrJzXM7a6o?t=90\">the first thing Steve Jobs says</a> about the smartphone is that it’s “a wide-screen iPod with touch controls.” It was an apt comparison, as the iPhone built on many concepts the iPod introduced.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SYQ6CxFNGdS5O-xoXGFEf9Xn5gE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451632/Screen_Shot_2022_05_10_at_14.14.47.png\">      <figcaption><em>Unveiling the iPhone, Steve Jobs highlighted that it synced “just like iPod.”</em></figcaption>  </figure><p id=\"IFjziX\">Let’s start with the obvious: when the iPhone first came out, you <em>had</em> to sync it with iTunes to activate it and set it up. Jobs used that as a selling point when introducing it, saying that iPod owners would already know how to set up their phone and would likely have their data already in iTunes. And after you set the phone up, you’d see an app called iPod on it — its icon depicting a classic scrollwheel-adorned device.</p><p id=\"Tvlxm3\">Then there’s the App Store, which came to define the iPhone, despite <a href=\"https://appleinsider.com/articles/08/07/10/apples_app_store_launches_with_more_than_500_apps\">not even being one of its original features</a>. By the time it launched in 2008, Apple already had half a decade of experience building and maintaining a digital storefront. It <a href=\"https://www.youtube.com/watch?v=NF9o46zK5Jo\">had launched the iTunes Music Store</a> in 2003 as a way to purchase digital music for your then-new third-gen iPod. And Apple <a href=\"https://www.billboard.com/music/music-news/itunes-to-start-selling-movies-1350487/\">started selling movies on iTunes in 2006</a> as it built out its infrastructure for the age of portable media consumption. The iPhone was a revolution in many ways, but it’s hard to imagine what it would’ve looked like without the iPod.</p><div class=\"c-float-left\"><aside id=\"1z7LIm\"><q>The iPhone and iPad quickly outsold the iPod</q></aside></div><p id=\"hsAzsb\">Of course, the iPod doesn’t deserve credit for everything that the iPhone popularized. It <em>had</em> games, but they weren’t one of its main selling points until the iPod Touch. And despite <a href=\"https://youtu.be/vN4U5FqrOdQ?t=215\">Steve Jobs’ joke during the iPhone announcement</a>, the click wheel was largely usurped by the touchscreen despite many people’s fond memories of the input device.</p><p id=\"ryXRGg\">While the iPod would live on for years after the iPhone was introduced (even the Nano and Shuffle held on for about a decade after iOS came onto the scene), its days as the thing Apple was known for were numbered. Apple’s sales record for iPods was in <a href=\"https://www.apple.com/newsroom/2009/01/21Apple-Reports-First-Quarter-Results/\">Q1 2009</a> — consumers bought 23 million of them. At the time, those would’ve been second-gen Shuffles, first and second-gen iPod Touches, fourth-gen Nanos, and the iPod Classic. </p><p id=\"z9vOm8\">The iPod would never reach those heights again. As iPhone sales took off like a rocket, fewer and fewer people bought iPods. In 2010, the iPad (which Apple dreamed up as a touchscreen device <a href=\"https://www.intomobile.com/2010/06/02/which-came-first-ipad-or-iphone-turns-out-apple-ipad-was-first/\"><em>before</em> it came up with the idea for the iPhone</a>) was introduced. Within two years, it too was <a href=\"https://www.cnet.com/tech/tech-industry/apples-fiscal-2012-in-numbers-125m-iphones-58-31m-ipads/\">outselling the iPod</a> at its peak. The iPod Touch was a good device if you wanted an iPhone without the phone — but, for most people, the iPad fit that mold even better.</p><div class=\"c-float-right\"><aside id=\"aw9iA6\"><q>You can draw plenty of lines from the iPod lineup to what Apple’s doing successfully today</q></aside></div><p id=\"AdQ9Xt\">The iPod’s importance at Apple continued to diminish over the next decade. By 2015, Apple’s earnings reports lumped the iPod into an “Other Products” category with the Apple TV, Apple Watch, Beats, and “Apple-branded and third-party accessories.” The iPod Classic, the last in the line started by the original iPod, was <a href=\"https://www.theverge.com/2014/9/9/4715274/ipod-classic-discontinued-a-visual-history\">discontinued in 2014</a>. The iPod Nano and Shuffle would be <a href=\"https://www.theverge.com/circuitbreaker/2017/7/27/16050420/apple-ipod-nano-shuffle-discontinued\">next to go in 2017</a>, and the <a href=\"https://www.theverge.com/2022/5/10/23065412/apple-ipod-touch-canceled-discontinued\">iPod Touch finally fell in 2022</a>.</p><p id=\"7dyfIk\">It’s hard to imagine that Apple sold many seventh-gen iPod Touches over the past few years, but there are sure to be at least a few people that’ll miss it — when I went to my local Apple Store on Tuesday to buy one, the employees told me I was far from the first person to do so upon hearing the news that it was discontinued. Starting at $199 for a 32GB model, it was the cheapest iOS device you could buy new from Apple. That honor now falls to the entry-level iPad, which starts at $329 for a 64GB model. The Touch was also the last easily pocketable device that Apple sold with (say it with me now) a headphone jack. </p><p id=\"0imnhg\">While the iPod may be no more, its legacy lives on. You can draw plenty of lines from the iPod lineup to what Apple’s doing successfully today — music is still a big part of its identity, both with its streaming service and <a href=\"https://www.cnbc.com/2022/01/03/apple-airpods-business-grew-like-gangbusters-over-the-holidays.html\">astoundingly popular</a> AirPod lineup. Apple loved video so much it named <a href=\"https://www.cnet.com/reviews/apple-ipod-video-review/\">an entire iPod model after it</a>; now, it has Apple TV Plus, and <a href=\"https://www.theverge.com/2021/9/14/22673545/iphone-13-pro-camera-cinematic-mode-video-features-macro\">markets the iPhone on its video prowess</a>. And remember that time people were wearing the square touchscreen iPod Nanos <a href=\"https://www.engadget.com/2010-11-18-ipod-nano-review-as-a-watch.html\">as a watch</a>? </p><p id=\"rk4Vp7\">But while services, wearables, and accessories are important to Apple, the iPhone is <a href=\"https://www.theverge.com/2022/4/28/23046890/apple-q2-2022-earnings-iphone-mac\">still its biggest money-maker</a> by far. That type of success doesn’t come down to any one factor; it happens thanks to a decade-plus-long series of good decisions and solid marketing. But Apple could only make the iPhone thanks to all the momentum it built up in the 2000s — and a lot of that happened thanks to the chord it struck with the iPod.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/uwXtrYynxeq5tou6sQqPLlp6LCY=/454x176:2880x1446/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23451081/Screen_Shot_2022_05_10_at_11.21.46.png",
  "description": "The music players helped catapult Apple to success.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}