{
  "title": "The company behind celebrity cameo videos has laid off a quarter of its workers",
  "url": "https://www.theverge.com/2022/5/4/23057796/cameo-layoffs-ceo-pandemic-growth-fameo",
  "date": "2022-05-05T01:28:25.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"Cameo Is Said In Talks To Raise Funds At About $1 Billion Value\" src=\"https://cdn.vox-cdn.com/thumbor/aXCIkxs9F3jDe1L_FRhZ0a9YRgE=/0x2:4000x2669/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70833839/1231257514.0.jpg\" />        <figcaption><em>The company apparently grew too large during the pandemic.</em> | Image: Getty</figcaption>    </figure>  <p id=\"iOGg5H\">Cameo, the company that lets you pay a celebrity to record a custom message or <a href=\"https://www.theverge.com/2021/9/16/22678456/cameo-calls-live-app-chat-celebrities-meet-and-greet\">hop on a video call with you</a>, has announced that it’s laying off 87 people, or around a quarter of its staff, <a href=\"https://www.theinformation.com/articles/cameo-a-celebrity-shoutout-app-lays-off-25-of-workforce?rc=rtpyqg\">according to <em>The Information</em></a>. According to the report, employees got the news at an all-hands meeting on Wednesday.</p><p id=\"9eusrC\">The company’s co-founder and CEO Steven Galanis says the layoffs are a “course correction” after Cameo grew massively during the pandemic. The company went “from just over 100 to nearly 400” employees during lockdown, according to Galanis’ <a href=\"https://variety.com/2022/digital/news/cameo-layoffs-celebrity-video-shout-out-1235258625/\">statement to <em>Variety</em></a>. Since then, he says, “market conditions have rapidly changed.” Early in 2021, <a href=\"https://variety.com/2021/digital/news/cameo-steven-galanis-celebrity-videos-1234908473/\"><em>Variety</em> reported that</a> the company’s revenue was 4.5 times higher in 2020 than it had been in 2019. Galanis told the outlet the success was partially because so many actors turned to the platform after other projects were put on hold, and predicted that they would stick around. </p><p id=\"g4fVyW\">It sounds like that prediction didn’t entirely pan out, given that the company is now shrinking its workforce by a sizable amount.</p>  <figure class=\"e-image\">        <img alt=\"Today has been a brutal day at the office. I made the painful decision to let go of 87 beloved members of the Cameo Fameo. If you’re looking to hire hungry, humble, smart, kind, curious, learning machines who love to win - and you see Cameo on their resume - look no further.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/U-yHL5SRIBzSqTR3c2YFCgTna3E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23438926/Screen_Shot_2022_05_04_at_16.35.17.png\">      <figcaption><em>The tweet announcing the layoffs from Cameo’s CEO.</em></figcaption>  </figure><p id=\"Qo0D0Y\"><a href=\"https://twitter.com/Mr312/status/1521970016920477696\">On Twitter</a>, Galanis asked other companies to hire the members of the “Cameo Fameo” that have been laid off. While it’s a nice sentiment, the tone is... awkward, to say the least. Executives saying that their company is like family and then letting a large chunk of employees go is <a href=\"https://www.theverge.com/23047593/airbnb-remote-work-no-pay-cuts-location-countries\">unfortunately nothing new</a>, and it’s almost always uncomfortable to see corporate culture crash into the realities of capitalism. But using a cutesy name for your workers in the context of publicly announcing layoffs is probably not going to soften that blow. </p><p id=\"5VMcUv\">(Also: I do understand that CEOs probably face an emotional toll when letting people go — they’ve let down people who put their livelihoods in their care. But they mayyyybe shouldn’t call it a “brutal day at the office,” given that it was likely way worse for the people actually losing their jobs.)</p><p id=\"5DlGHM\">Galanis isn’t necessarily known for his tact, though; in March he <a href=\"https://www.engadget.com/cameo-steven-galanis-crypto-colonialism-140038311.html\">reportedly said</a> that Web3 was like Europe’s colonization of the Americas, making an analogy about trading beads for the island of Manhattan. This was, apparently, meant to make Web3 seem like a good thing. In his statement to <em>Variety</em> regarding the layoffs, Galanis said that he wanted to make sure the company had “time and space to nurture newer business segments like Cameo for Business, Represent and web3.” On Tuesday, the company <a href=\"https://cameoblog.medium.com/introducing-the-snap-x-cameo-advertiser-program-141ab5502218\">announced its latest Cameo for Business venture</a>; a partnership with Snap, Inc where advertisers will be able to hire Cameo performers to appear in ads on Snapchat.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7dAh0wHxAFpnXFCOTTb0gzAP-aQ=/0x288:4000x2382/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23438988/1231257514.jpg",
  "description": "The CEO’s tweet announcing the layoffs wasn’t great.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}