{
  "title": "The biggest announcements at the Meta Quest games showcase",
  "url": "https://www.theverge.com/2022/4/20/23030460/meta-quest-game-vr-showcase-biggest-announcements",
  "date": "2022-04-20T17:31:53.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Resident Evil 4 Mercenaries\" src=\"https://cdn.vox-cdn.com/thumbor/GrX85ki03ZVimqBnVR2IUXnoX7U=/0x0:2160x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70772304/RE4_Mercs_Store_Art__16x9_JP.0.png\" />    </figure>  <p id=\"xB2MXg\">Meta hosted its 2022 games showcase, which was filled with games that you can expect to play on your Quest 2 virtual reality headset at some point this year. Last year’s surprise announcement was the VR port of <em>Resident Evil 4 </em>(which <a href=\"https://www.theverge.com/22726158/resident-evil-4-vr-capcom-oculus-quest-2-review\">turned out to be far better than expected</a>), but several standout titles seem like they’ll be must-play experiences when they launch. In case you missed out on the showcase, we’ve rounded up the biggest announcements below.</p><div id=\"P1tPI2\"><div ><iframe src=\"https://www.youtube.com/embed/26X2iZHvA58?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"udeHHy\"><em>Ghostbusters</em> is coming to VR</h2><p id=\"Afvx3f\">The showcase ended with Mark Zuckerberg revealing that a <em>Ghostbusters</em> VR game is in the works for the Quest 2. There aren’t many details (and it’s still in development under a working title) but the game will have players running their own Ghostbusters headquarters in San Francisco. “Track, blast, and trap ghosts in gripping encounters by wielding iconic equipment,” the official description reads. No word on a release date.</p><div id=\"ISSKC8\"><div ><iframe src=\"https://www.youtube.com/embed/0-ARGHXBw4I?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"tvfZnb\">The Mercenaries mode is now available in <em>Resident Evil 4</em></h2><p id=\"Q6rAt9\">The Mercenaries mode has been released by Armature Studio and is a free update for anyone who purchases <em>Resident Evil 4</em> on the Oculus Store. It’s a time-based challenge mode where you aim to survive and rack up the biggest score possible. This version of the game features online leaderboards, 20 new challenges, and new unlocks including big head mode, a black-and-white visual effect, and golden gun skins that you can also use in the campaign.</p><div id=\"xrFqkn\"><div ><iframe src=\"https://www.youtube.com/embed/QUWpd7F-OZU?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"DhI73S\">A new trailer for <em>Among US VR</em></h2><p id=\"5ozVfU\">InnerSloth, Robot Teddy, and Schell Games announced that the VR version of <em>Among Us </em>is going to release by the end of 2022. There was also a new trailer shared for the VR adaptation of the hit game. In addition to completing this title, Schell Games, which also developed hit VR titles like <em>I Expect You To Die</em>, announced that it’s working on three more projects with the Meta Studios teams.</p><div id=\"zcTTLY\"><div ><iframe src=\"https://www.youtube.com/embed/MJIkIHfEzJ4?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"xNeofC\"><em>Bonelab</em></h2><p id=\"NfZCAP\"><em>Bonelab </em>is a new Quest 2 and PC VR title from the studio that developed <em>Boneworks</em>, a PC VR-exclusive title that pushed the boundaries on realistic weapons handling, combat, and platforming. <em>Bonelab </em>has a new story, and it builds on the predecessor with new maps, new weapons, and new avatars that you can play. Given the studio’s history of making intense experiences that involve your whole body, it will probably be a title that experienced VR players will get the most out of.</p><p id=\"RADj6g\"><em>Bonelab </em>is releasing later this year.</p><div id=\"8doDjP\"><div ><iframe src=\"https://www.youtube.com/embed/2KFlzKe3B1Y?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"bKhedb\"><em>Beat Saber</em>’s “Electronic Mixtape” add-on</h2><p id=\"Bw06QK\"><em>Beat Saber</em> will soon get another add-on to its already-expansive soundtrack. There’s an Electronic Mixtape coming that will feature songs from Deadmau5, Fatboy Slim, Marshmello, Pendulum, and more. A release date hasn’t been shared, but the pack will cost $12.99, or $1.99 per song. It will also release on Rift, PSVR, and Steam.</p><div id=\"YYYVbM\"><div ><iframe src=\"https://www.youtube.com/embed/oTr9zPEsmq4?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"MZch2e\"><em>Cities: VR</em> is coming soon</h2><p id=\"ZgbfRS\">If you’ve enjoyed city-building simulators like <em>SimCity </em>and <em>Cities: Skylines </em>on PC, you probably already know about <em>Cities: VR</em>. It aims to provide a more immersive view of the cities that you build (and destroy). It’ll be out on April 28th for $29.99, and you can get a 10 percent discount by preordering ahead of release day.</p><div id=\"Td1vHu\"><div ><iframe src=\"https://www.youtube.com/embed/527CWvDw7yM?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"FoEr6p\"><em>NFL Pro Era</em> looks better than I expected it to</h2><p id=\"biXaCU\"><em>NFL Pro Era </em>is the first VR football game to arrive that’s officially licensed by the NFL. It’s a football experience that’s played in first-person view, and the game will feature a season mode that lets you build your team up to go to the Super Bowl. It appears to be shaping up nicely. You can play games, participate in drills, or just play catch with friends in VR. It will release in the fall, and the game will also be available for PSVR.</p><div id=\"lMSlC8\"><div ><iframe src=\"https://www.youtube.com/embed/qp5RSZES1v4?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><h2 id=\"HH7mgF\"><em>Moss: Book II</em> is coming to Quest 2 in the summer</h2><p id=\"SBubBb\">The sequel to indie VR darling <em>Moss — </em>which<em> </em>stars a very cute mouse — is coming to the Quest 2 this summer. The game debuted a few weeks ago for PSVR, and Quest owners won’t have to wait long to see the next chapter in <em>Moss</em>. </p><p id=\"67sJKu\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QTQrp7AQlqXneJIWe__Fi4JsR_I=/0x155:2160x1286/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23398188/RE4_Mercs_Store_Art__16x9_JP.png",
  "description": "You can download Mercenaries mode right now.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}