{
  "title": "The Rig 800 is still the most comfortable wireless gaming headset I’ve tried",
  "url": "https://www.theverge.com/2022/5/10/23064413/nacon-rig-800-pro-wireless-gaming-headset-ps4-ps5-xbox-pc",
  "date": "2022-05-10T12:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/I-ZYORTHrCZMYyARP9LWVLEy4TA=/0x0:2200x1467/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70851488/sean_hollister_20220509_173238.0.jpg\" />        <figcaption><em>The Nacon Rig 800 wireless gaming headset.</em></figcaption>    </figure>  <p id=\"IAlTCw\">In 2018, in a bout of curiosity, I decided to review every single wireless gaming headset on the market: <a href=\"https://twitter.com/StarFire2258/status/986767328942501888\">32 pairs to be exact</a>. None of them were anywhere <em>near </em>as comfortable as the Plantronics Rig 800. “The only one so lightweight, so comfortable, I sometimes forgot I was wearing it,” I wrote for <em>CNET</em>. </p><p id=\"lX94Gt\">Four years later, I’m happy to say that feeling hasn’t changed. </p><p id=\"1wYAZA\">Plantronics no longer exists, after merging with Polycom to become “Poly” and then <a href=\"https://press.hp.com/us/en/press-releases/2022/hp-inc-to-acquire-poly.html\">selling itself to HP</a>. But the <a href=\"https://www.amazon.com/RIG-Wireless-Headset-Multi-Function-Station/dp/B09KDSZMSZ?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Rig 800</a> is alive and well at French gaming company Nacon. I’ve been trying the 2022 “Pro” model for the past couple of weeks, and it’s hard for me to imagine a more comfortable headset. </p><p id=\"sFlKGf\">It still uses the same exact design with a spring-loaded inner headstrap that automatically adjusts tension to the size of your skull, rather than pinching the sides of your head by a fixed amount. That, combined with its unique modular headband that lets you snap the earcups into three distinct positions for small, medium, and large heads, makes it even more comfortable than SteelSeries’ lauded Arctis headsets, at least in my book. (The 10.9oz weight and super soft earcups also don’t hurt.)</p><div id=\"XYcuPM\"><div data-anthem-component=\"imageslider:11184197\"></div></div><p id=\"FReOkd\">Plus, the $150 headset looks like it might eliminate one of <a href=\"https://www.theverge.com/22643754/steelseries-arctis-pro-wireless-power-button-battery-swap\">my biggest frustrations with headsets like these</a>: the battery. Not only does the new Rig 800 appear to have even more battery life than the original — I measured 38 hours at 50 percent volume this weekend, which is 14 hours more than Nacon quotes! — but also it now comes with a magnetic docking station so you can charge it just by setting it down. While it sometimes requires a firm press to get the contacts seated, it totally works, and <a href=\"https://www.theverge.com/23005435/magic-mouse-apple-logitech-powerplay\">I love having one less charge to worry about</a>.</p><aside id=\"mNlCh2\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The real magic mouse is made by Logitech, not Apple\",\"url\":\"https://www.theverge.com/23005435/magic-mouse-apple-logitech-powerplay\"},{\"title\":\"The best wireless gaming headset is slowly driving me up the wall\",\"url\":\"https://www.theverge.com/22643754/steelseries-arctis-pro-wireless-power-button-battery-swap\"}]}'></div></aside><p id=\"anGmsM\">In some ways, I wish Nacon had gone further than the original 2016-era design because some of the Rig’s deficiencies haven’t changed. While game audio is crisp and immediate, the headset’s identical 40mm drivers still sound a little flat and tinny without much depth or punch for music and movies. (The Rig does have bass tubes that kick in if there’s a real, substantial drop, and I do enjoy those drops.)</p><p id=\"N8yxWm\">And, in one way, the Rig 800 is actually worse: wireless range. While the original Rig 800 had an ugly pigtail of a USB breakout antenna box, I wrote it had epic reach — enough to let me walk across the house and get a snack. Today’s Rig 800 has that nifty charging dock, but its wireless antenna is confined to a thumb-size removable USB stick. That might come in handy if, say, you plan to switch between a console and PC, but I was getting pops and static and disconnects from just a room and a half away. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ya5Qp3e6-94HkQtz6hjI1c2YI1A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23449466/rig_jack_reynolds.jpg\">      <figcaption><em>Jack Reynolds launched the Rig brand back at Plantronics, too.</em></figcaption>  </figure><p id=\"KVLEqW\">Nacon USA president (and Rig brand director) Jack Reynolds tells me that since the Rig 800 was one of the company’s best reviewed, best liked headsets, the company didn’t want to change too much about its “quintessential” design. The team just wanted to address some of the biggest complaints, like its rigid microphone arm and the annoyance of plugging in a USB cable for charging. I do like that Nacon got rid of the old two-position power switch, which was easy to accidentally leave on. Now, you press and hold a button down.</p><p id=\"1QmQuw\">But I do think they should have tested the bigger changes a little more. In addition to the decreased wireless range, I found the new microphone tends to pick up a lot of wind noise when I’m simply breathing, and Reynolds says future shipments of the Rig 800 will come with an acoustic cloth for their mics as a result.</p><p id=\"lp8o8r\">But Reynolds also hints that a more premium Rig headset is coming. The existing design is already<em> </em>far more comfortable and has a way better battery solution than <a href=\"https://www.theverge.com/22643754/steelseries-arctis-pro-wireless-power-button-battery-swap\">my current fav, the SteelSeries Arctis Pro Wireless</a>, at less than half the price. Maybe the next Rig will give it a run for its money in audio quality as well.</p><p id=\"4lPzRp\">If you decide to give the Rig 800 a try (instead of one of our other <a href=\"https://www.theverge.com/21549510/best-gaming-headset-wired-wireless-features-specs-price-sound-microphone-test-buy\">best wireless gaming headset picks</a>), know that there are still three versions: <a href=\"https://www.amazon.com/RIG-Wireless-Headset-Multi-Function-Station/dp/B09KDSZMSZ?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">one for PlayStation and PC</a>, <a href=\"https://www.amazon.com/RIG-Wireless-Headset-Multi-Function-Station/dp/B09KDGDCVC?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">one for Xbox and PC</a> that includes the Dolby Atmos software, and an upcoming version just for PC. On Xbox, there’s a game / chat balance dial; on PlayStation, that dial controls mic monitoring. Unfortunately, none of them offer dual audio outputs on PC.</p><p id=\"iI2bzG\"><em>Photography by Sean Hollister / The Verge</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/H0t9oiw632PZKejJEZrQ3d7K088=/0x99:2200x1251/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23449387/sean_hollister_20220509_173238.jpg",
  "description": "PlayStation, Xbox, or PC.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}