{
  "title": "The original Winamp skin is selling as an NFT",
  "url": "https://www.theverge.com/2022/3/16/22981109/winamp-music-player-original-skin-sale-nft-crypto-opensea-auction",
  "date": "2022-03-16T19:18:20.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"An image of the Winamp 1.0 skin\" src=\"https://cdn.vox-cdn.com/thumbor/_ZTsFgSabE7Qnn6viSCPurdVuCQ=/0x134:1400x1067/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70631774/winamp1_demo_large_spaced.0.png\" />        <figcaption>The Winamp 1.0 skin | Winamp</figcaption>    </figure>  <p id=\"PrfKuI\">Winamp will <a href=\"https://www.winamp.com/winamp-nft-initiative\">sell a non-fungible token</a> (NFT) linked to its media player’s original 1997 graphical skin, becoming the latest company to blend nostalgia and crypto. Winamp will put the NFT up for auction through OpenSea between May 16th and May 22nd, followed by a separate sale of 1997 total NFTs based on 20 artworks derived from the original skin. The proceeds will go to the Winamp Foundation, which promises to donate them to charity projects, starting with the Belgian nonprofit Music Fund.</p><p id=\"w1hmWs\">The NFT sale appears to be a combination of a publicity move and a fundraising effort. Winamp is sourcing the derivative art NFTs by asking artists to submit Winamp-based works between now and April 15th, then giving selected artists 20 percent of the proceeds from each sale of their image as an NFT. Nineteen of the pieces will sell in editions of 100 copies, and the remaining one will have 97; they’ll all sell for 0.08 Ethereum — around $210 at current exchange rates. The artists will get 10 percent of any royalties on later sales, where the seller will set their own price.</p><div class=\"c-float-right\"><aside id=\"RLPEKt\"><q>Buyers will get a token linked to a picture of the app’s UI</q></aside></div><p id=\"7FQ4SA\">Winamp’s head of business development Thierry Ascarez tells <em>The Verge</em> that buyers will get a blockchain token linked to an image of either the original skin seen above or one of its derivatives, which is a common setup for NFTs. Buyers will have the right to “copy, reproduce, and display” the image, but they won’t own the copyright. Likewise, selected artists will agree to transfer all intellectual property for their work to Winamp, according to a <a href=\"https://www.winamp.com/wp-content/uploads/terms-and-conditions_winamp-player-derivatives-nft-initiative.pdf\">page of terms and conditions</a>.</p><p id=\"IdZh0L\">Winamp isn’t <em>precisely</em> the service you might remember from the ’90s. The MP3-playing software was acquired by AOL in 1999, then <a href=\"https://www.engadget.com/2014-01-14-radionomy-acquires-winamp-and-shoutcast.html\">sold to online radio company</a> Radionomy in 2014 after a <a href=\"https://arstechnica.com/information-technology/2017/07/winamp-how-greatest-mp3-player-undid-itself/\">long decline</a> and shutdown. Radionomy (and later its majority stakeholder AudioValley) <a href=\"https://techcrunch.com/2018/10/15/winamp-returns-in-2019-to-whip-the-llamas-ass-harder-than-ever/\">revamped it</a> as a mobile audio app, then announced a <a href=\"https://www.bleepingcomputer.com/news/software/winamp-prepares-a-relaunch-new-beta-version-almost-ready/\">broader relaunch</a> for this year. There’s also a <a href=\"https://getwacup.com/\">long-running community update project</a> for the original app.</p><p id=\"atwRDu\">However, there’s a stronger connection between Winamp’s current form and its original one than some crypto projects. Venerable peer-to-peer file-sharing service LimeWire recently “relaunched” as an NFT marketplace, but it shares effectively no connection to its previous iteration; a new company <a href=\"https://torrentfreak.com/limewire-founder-not-thrilled-that-strangers-exploit-the-brand-for-nft-marketplace-220316/\">apparently just bought the domain name</a> and revived an expired trademark. It’s a little closer to a <a href=\"https://www.theverge.com/2021/12/22/22849943/radioshack-defi-cryptocurrency-radio-token-launch\">resurrected RadioShack’s plans to launch</a> a cryptocurrency marketplace, except that this NFT sale is a small part of its relaunch as a music service, not a broader move into crypto — at least so far.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/g5d1YEdfQuK5oaTw-VqWSnykBKc=/0x234:1400x967/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23321384/winamp1_demo_large_spaced.png",
  "description": "Buyers will get a token linked to a picture of the app.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}