{
  "title": "The creators of Triangle Strategy know it has a weird name",
  "url": "https://www.theverge.com/2022/3/4/22960053/triangle-strategy-nintendo-switch-interview",
  "date": "2022-03-04T14:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5jRuVv17ZtvRR68YsDUHpIodx7k=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70578430/Switch_ND021721_PTS_SCRN_09.0.jpg\" />    </figure>  <p id=\"N0lAgm\">The last few games that Tomoya Asano has worked on all have a few things in common. A producer at Square Enix, Asano’s most recent titles have been attempts at reimagining the classic Japanese role-playing game for modern audiences, harking back to the glory days of turn-based <em>Final Fantasy</em> adventures. They also all have extremely weird names like <a href=\"https://www.theverge.com/2021/2/18/22287791/bravely-default-2-nintendo-switch-interview-square-enix\"><em>Bravely Default</em></a>, <a href=\"https://www.theverge.com/2018/7/12/17561880/octopath-traveler-review-nintendo-switch\"><em>Octopath Traveler</em></a>, and <em>Various Daylife</em>. That trend continues with the release of <em>Triangle Strategy</em> on the Nintendo Switch today.</p><p id=\"GDebHb\">“We do want the titles to have a uniqueness to them,” Asano tells <em>The Verge</em>. “We also try to be careful that it’s not outrageously weird to the point that consumers can’t remember the name of the game.”</p><p id=\"wECpyR\">At first glance, <em>Triangle Strategy</em> doesn’t seem like much of a departure for Asano and his team. It features the same high-def 2D art that helped define <em>Octopath Traveler</em> and once again takes place in a fantasy universe reminiscent of classic <em>Final Fantasy</em> games. But it also switches up the genre in a big way, with a move to tactical RPGs. If <em>Bravely Default</em> is a modern take on <em>Final Fantasy</em>, <em>Triangle Strategy</em> is the same for <em>Final Fantasy Tactics.</em></p><div class=\"c-float-right\"><aside id=\"HBTmKf\"><q>“We also try to be careful that it’s not outrageously weird.”</q></aside></div><p id=\"wghJVW\">Asano says he decided to tackle the genre for a few reasons. For starters, fans wouldn’t stop asking for a new game in this style. But he also wanted to explore a “story that focuses on human drama.” Whereas most JRPGs feature otherwordly menaces set on destroying the world, Asano believed a tactics game was better suited for more human-scale storytelling. “When we thought about it from that perspective, that’s when I thought the tactics RPG genre would be the best fit,” he explains.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GLVV7rR5kqWRmq2pzNEIeFdszzg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23285869/Switch_TRIANGLESTRATEGY_screen_02_bmp_jpgcopy.jpg\">  </figure><p id=\"Qn9WbW\">And narrative is a huge part of <em>Triangle Strategy</em>. The story follows a group of characters caught up in a long-running conflict between three warring nations, where players will also have to make key choices at pivotal moments. It’s an impressive feat of worldbuilding that also features a huge amount of voice acting. This results in lengthy moments of exposition in between battles, some so long that my Switch actually went to sleep when I had it set to auto-play. (You do have the option to skip or fast forward through these sequences if you want.)</p><p id=\"60XzhP\">It can be overwhelming at times, especially if you’re mostly excited for strategic battles, but it also appears to be something that fans want. Last year, <a href=\"https://www.nintendo.com/en-ca/whatsnew/detail/2021/triangle-strategy-debut-demo-survey-results-nintendo-switch/\">Square Enix released a demo of the game</a> and solicited player feedback. Yasuaki Arai, another producer on the game who was also responsible for much of the story, said he expected to hear about how players felt about the combat and class-switching mechanics. Instead, he says, “the fact is, the audience is most focused on the storyline. That was a surprise for me. I thought, ‘I’ll have to work harder on the story’s quality.’”</p><div class=\"c-float-right\"><aside id=\"jHAnl4\"><q>“It’s one to two months of looking through English terms to decide what to use.”</q></aside></div><p id=\"3rlWJb\">Which brings us back to that name. Asano says that one of the goals is to “make sure that people can imagine what the game content is based on the title.” In the case of <em>Triangle Strategy,</em> at least, that appears to be the case; you can tell it’s a tactical game right from the name. This is then balanced with a few other factors, including the desire to create a title that stands out. (At one point during our conversation, he asked me to rank the games by how strange their name was. I put <em>Octopath</em> at number one.) It’s a process that Asano says can take upwards of two months. “We ask a lot of people for their opinions,” he says. ”For example, we even ask native English speakers about the new titles, and they usually tell us: ‘It’s obvious that a Japanese person named this game.’”</p><p id=\"HqKgYB\">There are also aesthetic considerations when it comes to the name. “If you put our team’s games side by side, you might notice that another thing that we think of is we want to make sure that the first and second line of the title balance well,” Asano explains. “We also look at the number of characters in that word we’re considering. So it’s one to two months of looking through English terms to decide what to use.”</p><p id=\"rXcIvZ\">The result of that process is a series of games that, while not technically part of the same franchise, are now recognizably a set. They take place in unique worlds, star different characters, and introduce new mechanics, but games like <em>Triangle Strategy</em> and <em>Bravely Default</em> also have enough in common that they all fit together, like a strange offshoot of the <em>Final Fantasy</em> brand. That franchise is now approaching its 16th mainline entry, which does inspire some jealousy in Asano — at least when it comes to naming conventions.</p><p id=\"7G90g3\">“Of course, it’s easier to just put a number at the end,” he says.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/E0Bq7weXxZE0M-Jw4yAIqtrEVGw=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285652/Switch_ND021721_PTS_SCRN_09.jpg",
  "description": "An interview about the new strategy game on the Switch",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}