{
  "title": "The US government finally realizes that cars kill people outside the vehicle, too",
  "url": "https://www.theverge.com/2022/3/3/22960262/nhtsa-ncap-five-star-safety-rating-adas-proposal",
  "date": "2022-03-03T20:01:57.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"US-NEWS-CARCRASHES-DEATHS-FL\" src=\"https://cdn.vox-cdn.com/thumbor/txcVdbIZL3L9Mgh3DIdUYPBiITY=/30x0:1571x1027/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70575514/1238878842.0.jpg\" />        <figcaption>Joe Cavaretta/Sun Sentinel/Tribune News Service via Getty Images</figcaption>    </figure>  <p id=\"SjnaXF\">The US government’s New Car Assessment Program (NCAP), also known as the five-star safety rating, is getting <a href=\"https://www.nhtsa.gov/sites/nhtsa.gov/files/2022-03/NCAP-ADAS-RFC-03-03-2022-web.pdf\">a major update</a>. The National Highway Traffic Safety Administration (NHTSA) announced Thursday a set of new proposals for the federal program aimed at curbing the surge in pedestrian deaths. </p><p id=\"mYNaFc\">For the first time, NHTSA will consider the inclusion of advanced driver-assistance system (ADAS — sorry for all the acronyms!) features, like automatic emergency braking, blind-spot detection, and lane-keep assistance. These ADAS features, which are quickly becoming standard in most vehicles today, could become essential criteria for a five-star safety rating from the government. </p><p id=\"vPPtwL\">Traditionally, NHTSA assigns safety ratings to new cars and trucks by putting a couple of crash test dummies inside the vehicle and ramming it into a wall at high speed. But this system really only assesses the risks posed to automobile occupants — and not the danger posed to vulnerable road users like pedestrians and cyclists.</p><div class=\"c-float-right\"><aside id=\"2qUvJ3\"><q>NHTSA acknowledges that this no longer a tenable system</q></aside></div><p id=\"yArQbl\">NHTSA acknowledges that this is no longer a tenable system. “For the first time ever, NCAP includes technology recommendations not only for drivers and passengers but for road users outside the vehicle, like pedestrians,” Steven Cliff, deputy administrator at NHTSA, <a href=\"http://nhtsa.gov/press-releases/five-star-safety-ratings-program-updates-proposed\">said in a statement</a>. </p><p id=\"VQII9h\">The European Union’s version of the NCAP is different and obviously better. Vehicles receive a five-star review only if they can demonstrate an ability to come to a complete halt — or at least slow down — before colliding with a pedestrian or cyclist. Under President Obama, NHTSA began the process of <a href=\"https://www.federalregister.gov/documents/2015/12/16/2015-31323/new-car-assessment-program\">revising NCAP to address the safety of those outside the vehicle</a>; under President Trump, that effort was abandoned. </p><p id=\"FJQ4am\">But President Joe Biden resurrected it through the <a href=\"https://www.theverge.com/2021/8/3/22607890/infrastructure-impaired-driving-provision-federal-standard-transportation\">Bipartisan Infrastructure Plan</a>, which was signed into law last year. In addition to requiring passenger cars to include forward-collision warnings, automatic emergency braking, and lane-keep assistance, it also directed the Department of Transportation to revise NCAP to include those features in its safety rating criteria. </p><p id=\"E1NNYu\">The idea is to rate automobile safety on a host of new technologies that can stop risky driving behavior before it even occurs. As a result, NCAP tests will become more stringent, and vehicles that don’t include these features are likely to receive a lower rating. As David Zipper, a visiting fellow at Harvard’s Kennedy School and a vocal advocate for automobile safety, <a href=\"https://www.bloomberg.com/news/articles/2021-01-06/u-s-new-car-safety-ratings-are-overdue-for-update?sref=ExbtjcSG\">wrote in <em>Bloomberg </em>last year</a>: </p><blockquote><p id=\"vpp1fd\">From the outset, NCAP has been a consumer education program intended to help Americans understand the relative safety of new automobiles before making a purchase. Automakers can ignore NCAP if they choose, but federal law requires that its ratings be placed on vehicle window stickers at auto dealerships... Automakers eagerly seek top five-star NCAP ratings, and they boast when they get them.</p></blockquote><p id=\"nOK2XV\">Still, NHTSA’s new proposals may not go far enough. <a href=\"https://twitter.com/DavidZipper/status/1499459174845067266\">As Zipper notes</a>, the agency states it will “perform tests” to determine whether to include automatic emergency braking for cyclists, as done its counterparts in Europe. </p><p id=\"hLSgnJ\">The new proposals come amid a tragic — but entirely predictable — rise in the number of traffic fatalities. Even as fewer Americans were on the road driving during the pandemic, close to 39,000 people were killed during 2020 — the highest number of deaths since 2007. And 2021 is shaping up to be another record year, <a href=\"https://www.nhtsa.gov/press-releases/traffic-fatalities-estimates-jan-sept-2021#:~:text=NHTSA%20projects%20that%20an%20estimated,first%20nine%20months%20of%202020.\">with nearly 32,000 people dying from January through September</a>. (NHTSA is still collecting data from the final three months of the year.) </p><div class=\"c-float-right\"><aside id=\"STSOFE\"><q>It’s been a particularly bloody couple of years for pedestrians and cyclists</q></aside></div><p id=\"pcDRMz\">It’s been a particularly bloody couple of years for pedestrians and cyclists. In 2020, bicyclist deaths increased more than 9 percent, hitting the highest number since 1987. Fatalities in cities rose almost 9 percent, and pedestrian deaths approached 4 percent, the highest number since 1989. </p><p id=\"Qaojz3\">“There’s a crisis on America’s roadways: 3,000 people die every month, and the numbers have only gotten worse in recent years,” said US Transportation Secretary Pete Buttigieg in a statement. “These important changes will help save lives on our roadways by ensuring that consumers have the information they need about the latest safety technologies when they buy a new vehicle.” </p><p id=\"lkUV9t\">The correlation between vehicle design and pedestrian deaths is pretty clear. The most popular types of vehicles, SUVs and pickup trucks, are typically the most dangerous. While people driving SUVs are slightly safer, the number of pedestrians killed by those drivers has skyrocketed by 81 percent in the last decade, according to a report released a few years ago by the Insurance Institute for Highway Safety.</p><p id=\"LWNUhG\">This is mostly because of the way SUVs are designed: larger bodies and higher carriages mean pedestrians are more likely to suffer deadly blows to the head and torso. Higher clearances mean victims are more likely to get trapped underneath a speeding SUV instead of pushed onto the hood or off to the side.</p><p id=\"39aTEl\">An overhauled NCAP could penalize vehicles that are designed in this deadly manner. That could have a huge impact on current SUV and truck design — but only if NHTSA sticks to its guns and adopts these proposals. </p><p id=\"DpRc2w\"></p><p id=\"RCgD7j\"></p><p id=\"BWylXX\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/7d0TYsNFyOvst4tzKxDqR3I5E5E=/0x95:1600x933/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23286015/1238878842.jpg",
  "description": "Five-star safety rating getting a major overhaul",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}