{
  "title": "The Obamas are leaving Spotify for a new multiplatform podcast deal",
  "url": "https://www.theverge.com/2022/4/20/23034638/spotify-barack-michelle-obama-higher-ground-productions-deal",
  "date": "2022-04-21T00:06:35.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"Barack And Michelle Obama Attend Portrait Unveiling At Nat’l Portrait Gallery\" src=\"https://cdn.vox-cdn.com/thumbor/tpaUW7KwDzGc0UiESL-0DfEzCUc=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70774198/917433500.0.jpg\" />        <figcaption>Photo by Mark Wilson/Getty Images</figcaption>    </figure>  <p id=\"tLey5h\">Barack and Michelle Obama won’t be signing a new podcast deal with Spotify, <a href=\"https://www.bloomberg.com/news/articles/2022-04-20/obamas-to-leave-spotify-seek-multimillion-dollar-deal-elsewhere\"><em>Bloomberg</em> reports</a>, marking a major departure for the Obamas’ production company, Higher Ground Productions. “The company is instead talking to other distributors about a deal worth tens of millions of dollars, among the most-lucrative in the podcasting business,” according to the report. </p><p id=\"xr0DTK\">Amazon’s Audible and iHeartMedia are among the “several” companies Higher Ground is in negotiations with for a new deal. Higher Ground had talked to Spotify as well, but it “declined to make an offer,” <em>Bloomberg</em> says. Higher Ground apparently wants to be able to make multiple shows and release them on platforms simultaneously, which would go against Spotify’s typical exclusives-based strategy. </p><p id=\"MMDm9N\">Higher Ground, Amazon, and iHeartMedia didn’t immediately reply to a request for comment. Spotify spokesperson Grey Munford declined to comment.</p><p id=\"Nj0yEM\">Spotify has come under significant scrutiny lately as the home of the Joe Rogan Experience podcast, <a href=\"https://www.theverge.com/2022/2/17/22939587/joe-rogan-experience-spotify-podcast-deal\">an arrangement that is reportedly worth $200 million</a> and whatever headaches come from Rogan’s opinions about vaccines. Musicians including <a href=\"https://www.theverge.com/2022/1/26/22903354/spotify-joe-rogan-removing-neil-young-music\">Neil Young</a> and <a href=\"https://www.theverge.com/2022/1/29/22907696/joni-mitchell-spotify-joe-rogan-podcast-misinformation-covid-19\">Joni Mitchell</a> removed their music from the streaming service in protest. It’s unclear if the controversy surrounding Rogan contributed to the Obamas’ decision to look elsewhere.</p><p id=\"tYK9no\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Khjk27cg_n29OBsnJDWEbejm8oI=/0x49:3000x1620/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23404918/917433500.jpg",
  "description": "The Obamas are looking for a new podcast partner.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}