{
  "title": "The best fitness trackers to buy right now",
  "url": "https://www.theverge.com/22985108/best-fitness-tracker",
  "date": "2022-03-22T15:30:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9NfU5CzAkm1H45234kKpT8gicKk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657030/acastro_220321_5092_0001.0.jpg\" />        <figcaption>Photo illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>From simple fitness bands to rugged sports watches</p> <p class=\"p--has-dropcap p-large-text\" id=\"Fn8Az0\">Fitness trackers have come a long way from the simple bands that tracked steps and little else. Modern trackers can monitor everything from your heart health to how well you’ve recovered from a hard bout of training. They’ve got sensors galore and, in some cases, can give smartwatches a run for their money. Whatever your fitness goals are, there’s probably a fitness tracker that can help you achieve them.</p><p id=\"dQE0ME\">Compared to some other gadgets, wearables are incredibly personal. That means there are <a href=\"https://www.theverge.com/22940671/fitness-tracker-how-to-choose-specs-price-features-smartwatch\">a few extra considerations</a> you’ll have to take into account before reaching for your wallet. It makes it hard to say that any one fitness tracker is the best for everyone. Thankfully, the best thing about fitness trackers in 2022 is that there’s enough variety to fit into every kind of lifestyle. </p><h1 id=\"40siUL\">Best Fitness Trackers in 2022</h1><hr class=\"p-entry-hr\" id=\"GmeI0T\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-ViogBDcBf6g-WRkXfJ2f3N3LaM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23324671/vsong_220317_5089_0005.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Fitbit Versa 3 is a versatile tracker with a reasonable mix of features for the price.</em></figcaption>  </figure></div><h2 id=\"YNni5E\">1. <a href=\"https://www.amazon.com/Fitbit-Fitness-Smartwatch-Battery-Included/dp/B08DFPV5Y2/ref=sr_1_3?crid=23WPGV5YBAQNQ&amp;keywords=fitbit+versa+3&amp;qid=1647628747&amp;sprefix=fitbit+versa+3%2Caps%2C76&amp;sr=8-3&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Fitbit Versa 3</a></h2><h3 id=\"Qnmv9C\">Best fitness tracker overall</h3><p id=\"YHDPFN\">There’s a reason the Versa lineup is so popular. While it doesn’t have <em>all</em> the bells and whistles, it’s got everything you need in a basic fitness tracker for a reasonable $229.95. Plus, you can frequently find it on sale for under $200. </p><p id=\"3aSNta\">In terms of sensors, you get continuous heart rate monitoring and SpO2. It supports NFC payments and has a microphone for taking phone calls on the wrist. Plus, you can have the option of both Alexa and Google Assistant. Unlike previous iterations of the Versa, this one also comes with built-in GPS. The Versa 3 also gets you about a week of battery life and the ability to get a day’s worth of charge in just 12 minutes. </p><p id=\"gIGWAr\">Fitbit’s platform is also among the most user-friendly, especially for folks just getting started in the world of fitness trackers. It’s got a large community for competitions and one of the more streamlined companion apps. There’s no lack of data, especially if you opt for Fitbit Premium. The Versa 3 also comes with a 90-day trial of Fitbit Premium, so it’s something you can mull over before deciding to shell out. </p><p id=\"dwcOrc\">Sure, you don’t get EKGs or the flagship <a href=\"https://www.theverge.com/21450123/fitbit-sense-review\">Fitbit Sense</a>’s electrodermal activity sensor — but I’d argue most people won’t end up using these features regularly anyway. Like the Apple Watch SE, the pared-down Versa 3 makes more sense for the average person.</p><div id=\"KaOMYS\"><div data-anthem-component=\"productcard:10911444\"></div></div><hr class=\"p-entry-hr\" id=\"1Vqsqz\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vc02lWyt3EqjRSMrv3sqxmkaBV4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23327507/vsong_220317_5089_0006.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Amazfit Bip S offers more features than you’d expect for $70.</em></figcaption>  </figure></div><h2 id=\"HyDsPU\">2. <a href=\"https://www.amazon.com/Amazfit-Smartwatch-Battery-Display-Water-Resistant/dp/B082VZZHK4/ref=sr_1_1_sspa?crid=3MZ01Z2V7RLUS&amp;keywords=amazfit+bip+s&amp;qid=1647628683&amp;sprefix=amazfit+bip+s%2Caps%2C102&amp;sr=8-1-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExTUI1N1VOMzU2Wk4wJmVuY3J5cHRlZElkPUEwNTI0NjE1MUpHMVc0TlY1UjVCUSZlbmNyeXB0ZWRBZElkPUEwODExODQ1M0NBRjJSQkUwVkZBUyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazfit Bip S</a></h2><h3 id=\"0YhN4a\">Best budget fitness watch</h3><p id=\"znMtNc\">If you’re looking to save a little moolah, the $69.99 Amazfit Bip S is an excellent choice. It’s not the most attractive tracker out there, but it gets you a lot of features you wouldn’t expect on a tracker under $100. For example, it has built-in GPS, in-depth sleep tracking, continuous heart rate monitoring, an always-on display, and about two weeks of battery life. It’s definitely more fitness tracker than a smartwatch, but you do get the option of editing watch faces, notifications, and music controls. That’s impressive at this price point.</p><p id=\"n4yopQ\">The Bip S won’t win awards for looks, but in testing, it delivered accurate results on par with more expensive watches. If you’ve been missing Pebble’s simple and cheap smartwatches, this is a worthy alternative.</p><div id=\"IHfbhc\"><div data-anthem-component=\"productcard:11102667\"></div></div><hr class=\"p-entry-hr\" id=\"cbrXUy\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Garmin Fenix 7S closeup on top of a book\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hNmza8_FxX3rgNuv4oDQWw4W6Mo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23242343/vsong_220209_5015_0009.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Fenix 7S Sapphire Solar is an excellent outdoors fitness tracker </em></figcaption>  </figure></div><h2 id=\"4TBBXs\">3. <a href=\"https://www.theverge.com/22937154/garmin-fenix-7s-review-fitness-tracker-smartwatch\">Garmin Fenix 7S/7/7X</a></h2><h3 id=\"GnB1mV\">Best for serious outdoor athletes</h3><p id=\"HGdnJT\">Garmin’s <a href=\"https://www.theverge.com/22937154/garmin-fenix-7s-review-fitness-tracker-smartwatch\">flagship Fenix 7 series</a> is no joke. It’s got built-in multi-band GPS, weeks’ worth of battery life, the option of touchscreen or button navigation, topographical maps, and oodles upon oodles of data. There’s also a handy new real-time stamina feature that helps you figure out how much you’ve got left in the tank. </p><p id=\"oiB6jf\">Depending on the model you get, you might also get a built-in LED flashlight and solar charging. Garmin wearables are also known for providing extensive, in-depth metrics, and the Fenix is no exception. You get excellent recovery metrics, as well as helpful training guides and coaching programs. The best part is Garmin doesn’t charge extra for those features. That’s good news since the Fenix 7 series starts at $699.99.</p><p id=\"U78gVi\">We appreciate how quickly the Fenix 7 watches are able to pick up a GPS signal. That’s a must if you’re training in the dead of winter. These watches can also take a beating. All models are built to military-grade standards and feature up to 10 ATM of water resistance. That means they’re more than capable of a dunk in the ocean. Another plus is that the Fenix 7 series comes in some attractive colorways, making this watch less of an eyesore than some other rugged fitness watches. That helps people who may want a watch that can double as a daily driver.</p><p id=\"cLzwW8\">The transflective screen isn’t our absolute favorite — the OLED on the <a href=\"https://www.theverge.com/22934516/garmin-epix-2-review\">Garmin Epix 2</a> is a lot easier on the eyes. (The Epix 2 is also a good option if battery life isn’t your highest priority.) However, the Fenix 7 lineup’s multiple size options make it a more versatile pick if you don’t have large wrists. It’s on the pricier end of things, but it’s an excellent option for people who spend a lot of time outdoors. </p><div id=\"aVThIM\"><div data-anthem-component=\"productcard:11102682\"></div></div><hr class=\"p-entry-hr\" id=\"U8J0VC\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Oura Ring Gen 3, close up\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DaZ75ckiqSQpV07TJFJiF9BOEUE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23035226/vsong_211117_4890_0007.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Oura Ring is one of the most recognizable smart rings around.</em></figcaption>  </figure></div><h2 id=\"GynRpv\">4.<a href=\"https://www.theverge.com/22789248/oura-ring-3-review-sleep-tracker-fitness-tracker\"> Oura Ring Gen 3</a></h2><h3 id=\"Tldrb0\">Best non-wrist tracker</h3><p id=\"jhfVES\">The vast majority of fitness trackers are worn on the wrist, but the $299 <a href=\"https://www.theverge.com/22789248/oura-ring-3-review-sleep-tracker-fitness-tracker\">Oura Ring</a> isn’t. The smart ring is a good option for people who are looking for something a little more discreet. It’s also less distracting than some other wrist-based options, as it lacks a screen and doesn’t forward push notifications. </p><p id=\"3K3FPS\">While smaller than your average wearable, the Oura Ring still tracks a ton of metrics, including heart rate variability and body temperature. The third iteration of the device also introduces SpO2 sensors, as well as all-day heart rate monitoring and period predictions. Future updates will also add activity tracking (at the moment, you have to import activities) and blood oxygen levels. If you’re looking for some stress relief, the Oura Ring also lets you track guided meditation sessions. </p><p id=\"3q81Rj\">The Oura Ring tracks typical metrics — such as steps and calories burned —  but its main focus is sleep and recovery. Each day, you’re given three sets of scores for your readiness, sleep, and activity. It’s a simple, holistic look at your overall wellness and an ideal pick if you want a more hands-off experience with your data.</p><div id=\"OXt4JZ\"><div data-anthem-component=\"productcard:11102690\"></div></div><hr class=\"p-entry-hr\" id=\"vRevUH\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/M23bRElsZH7rGXcLq-EnHtL1wvQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22864048/jpeters_210914_4757_0007.jpg\">      <cite>Photo by Jay Peters / The Verge</cite>      <figcaption><em>The Fitbit Charge 5 is one of the most advanced fitness bands you can buy right now.</em></figcaption>  </figure></div><h2 id=\"Wt0hha\">5. <a href=\"https://www.theverge.com/22680300/fitbit-charge-5-review-fitness-tracker\">Fitbit Charge 5</a></h2><h3 id=\"PYatLY\">Best fitness band</h3><p id=\"5y9b57\">The $179.99 <a href=\"https://www.theverge.com/22680300/fitbit-charge-5-review-fitness-tracker\">Fitbit Charge 5</a> is one of the most advanced fitness trackers you can buy. It’s also one of the more significant upgrades to the lineup in a while, adding a bright OLED touchscreen, electrodermal activity sensor, and EKGs. It also supports smart features like contactless payments, notifications, and timers. On the health tracking side, it has built-in GPS, continuous heart rate monitoring, sleep tracking, and SpO2 sensors.</p><p id=\"ahqsHF\">Is the Charge 5 one of the most exciting trackers out there? No. But it does its job well and for a decent price. The only thing we’re not super happy about is how enabling the always-on display is a mega drain on the battery. While the Charge 5 has an estimated battery life of seven days, but that drops to 2-3 once you’ve got the AOD on. Otherwise, it’s hard to beat the Charge 5.</p><div id=\"hDjZI8\"><div data-anthem-component=\"productcard:10905023\"></div></div><hr class=\"p-entry-hr\" id=\"a03g01\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nftwUDOcInF6oGnIY6znOZ3FB74=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23162060/vsong_220110_4962_0004.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Garmin Vivomove Sport is a beautiful hybrid tracker that doesn’t cost a fortune.</em></figcaption>  </figure></div><h2 id=\"SNkQpt\">6. <a href=\"https://www.theverge.com/22882401/garmin-vivomove-sport-review-fitness-tracker-smartwatch-wearables\">Garmin Vivomove Sport</a></h2><h3 id=\"QxUXWf\">Most stylish fitness watch</h3><p id=\"1Ld39y\">While Garmin’s made some truly exquisite hybrid trackers in the past, the price made them hard to recommend. However, the <a href=\"https://www.theverge.com/22882401/garmin-vivomove-sport-review-fitness-tracker-smartwatch-wearables\">Vivomove Sport</a> finally gets things right. It looks like an analog Swatch, thanks to the hidden OLED display, but you don’t actually lose anything in terms of accuracy. </p><p id=\"JY6jqX\">For $179.99, you are giving up some things like built-in GPS and NFC payments. However, you do get push notifications and access to Garmin’s entire fitness tracking platform. There are some more jewelry-like trackers — Bellabeat’s lineup or the Fitbit Luxe come to mind — but the Vivosport Move’s design is a lot sturdier for active lifestyles. </p><div id=\"8908cL\"><div data-anthem-component=\"productcard:11056921\"></div></div><hr class=\"p-entry-hr\" id=\"tDQLVt\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/u2SJkRbKhPDIAIqMcTRUceNmLFE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21926107/dseifert_200930_4218_0010.0.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>The Apple Watch SE doesn’t require you to give up a lot.</em></figcaption>  </figure></div><h2 id=\"x26IPp\">7. <a href=\"https://www.theverge.com/21496928/apple-watch-se-review-smartwatch-wearos-price-specs-features\">Apple Watch SE</a></h2><h3 id=\"xIBcrh\">Best for iPhone owners</h3><p id=\"p4N5F6\">If you’re looking for a smartwatch that does fitness well, then iPhone owners need to look no further than the $279 Apple Watch SE. Apple’s mid-tier smartwatch lacks marquee features like EKGs, an always-on display, and SpO2, but very little else. If you’re a relatively healthy person, EKGs aren’t necessary as the SE still provides abnormal heart rate alerts. Likewise, Apple hasn’t really figured out how it wants to best utilize its SpO2 sensors just yet. The SE also still gets you built-in GPS, cellular capability, contactless payments, and fall detection. It’s also compatible with Apple’s Fitness Plus service. </p><p id=\"ebC0fn\">Put bluntly, the vast majority of people will get the same experience on the SE that they will on the flagship Series 7. You might as well save the extra cash. We’d recommend the Series 7 over the SE only if the slightly bigger screen is easier on your eyes, if you <em>must</em> have the always-on display, or if your doctor thinks you could benefit from EKGs. </p><div id=\"WIiGt8\"><div data-anthem-component=\"productcard:9514947\"></div></div><div id=\"CPz4Hy\"><div data-anthem-component=\"productcard:10966490\"></div></div><hr class=\"p-entry-hr\" id=\"ilVJvt\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The regular Galaxy Watch 4 has a touch-sensitive bezel, which is fiddly.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/i4Vc96wcN6ynBFQfkw4AXX8cQKk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22787999/dbohn_210816_4717_0005.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>The Samsung Galaxy Watch 4 delivers the most advanced fitness tracking for Samsung phone owners.</em></figcaption>  </figure></div><h2 id=\"RJ1yu4\">8. <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Samsung Galaxy Watch 4</a></h2><h3 id=\"0MzrjJ\">Best for Samsung phone users</h3><p id=\"FbLJU9\">If you have a Samsung phone, this is going to be the best full-featured smartwatch for fitness tracking. Not only is this the only Wear OS 3 smartwatch available right now, but Samsung’s genuinely put more effort into the Galaxy Watch’s health offerings. It recently beefed up sleep tracking, and the $249.99 <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4</a>’s new 3-in-1 sensor also enables body composition analysis. That’s a unique feature that no other smartwatch at the moment is capable of. You can also access workout videos from the Samsung Health app — though the production value isn’t as good as Fitness Plus or Peloton. </p><p id=\"IhbhDS\">Keep in mind there are also growing pains with the Wear OS 3 transition. We’re still waiting on Google Assistant coming to this watch, though you can download alternatives like Google Pay if Samsung Pay isn’t to your liking. Also, some of the Galaxy Watch 4’s best features are limited to Samsung owners, making it hard to wholeheartedly recommend this to non-Samsung Android users.</p><div id=\"xOVsf9\"><div data-anthem-component=\"productcard:10848015\"></div></div><hr class=\"p-entry-hr\" id=\"AbaYyl\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xpwjAXR9FOycxGWuDI1DK8JNq48=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23324669/vsong_220317_5089_0003.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Mobvoi TicWatch Pro 3 Ultra GPS is your best fitness tracking smartwatch for Wear OS right now.</em></figcaption>  </figure></div><h2 id=\"N4b8Wf\">9. <a href=\"https://www.amazon.com/Pro-Ultra-GPS-Smartwatch-Assessment/dp/B09FXRR32P/ref=sr_1_1_sspa?crid=1P6WMBWD6HVLW&amp;keywords=mobvoi+ticwatch+pro+3+ultra+gps&amp;qid=1647630187&amp;smid=A1UNG9F2JVH11Z&amp;sprefix=mobvoi+ticwatch+pro+3+ultra+gps%2Caps%2C87&amp;sr=8-1-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExSjZPMlZaWFVJUU45JmVuY3J5cHRlZElkPUEwMTc0MTQ5MzZPNUJNQVpYV0VOQyZlbmNyeXB0ZWRBZElkPUEwNDk3ODk0MzZNVFc5TElCWEQ3VyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Mobvoi TicWatch Pro 3 Ultra GPS</a></h2><h3 id=\"FMPneL\">Best fitness smartwatch for Android</h3><p id=\"eSDDhJ\">It’s slim pickings for non-Samsung Android users when it comes to a more smartwatch-y fitness tracking experience. That said, if you’re determined to go this route, the $299.99 Mobvoi TicWatch Pro 3 Ultra GPS is your best bet. You get the latest Qualcomm Snapdragon Wear 4100 chip. That’s big because this is one of the few watches that we know will get the Wear OS 3 upgrade when it arrives later this year. </p><p id=\"PoKN0q\">On top of that, it has fitness-focused features that the <a href=\"https://www.theverge.com/22764448/fossil-gen-6-smartwatch-review\">Fossil Gen 6</a> simply doesn’t. That includes better durability and more in-depth sleep tracking. There’s also atrial fibrillation and irregular heartbeat detection, as well as stress tracking. </p><div id=\"QWtQ4L\"><div data-anthem-component=\"productcard:11102727\"></div></div><hr class=\"p-entry-hr\" id=\"Yg1Dp4\"><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Whoop 4.0 in a strap, the battery pack, and the sports bra.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bag2IlMOWT5516ZCOw50D-_hmW0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23277338/vsong_220225_5048_0008.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>The Whoop 4.0 is best for elite athletes or people who don’t mind experimental trackers.</em></figcaption>  </figure></div><h2 id=\"1WotcG\">10. <a href=\"https://www.theverge.com/22957195/whoop-review-fitness-tracker-wearables\">Whoop 4.0</a></h2><h3 id=\"4r15d2\">Best for first adopters and elite athletes</h3><p id=\"7YPJBo\">The <a href=\"https://www.theverge.com/22957195/whoop-review-fitness-tracker-wearables\">Whoop 4.0</a> is not for the casual enthusiast. Not only does it come with an expensive $30 monthly subscription, but the information it provides is only useful if you’re actively training for a cardio-intensive sport. If strength training is your main form of exercise, you’re better off looking elsewhere. Like the Oura Ring, this is a distraction-free tracker that specializes in sleep and recovery. The main difference is this has a more athletic bent. For instance, you’ll get way more insight into how much strain you’ve taken on in the past week. </p><p id=\"pQTJm4\">Whoop also provides a lot of novel ways to wear its tracker, including in underwear and arm/knee sleeves. This makes it an appealing option if you’re one of those unicorns who needs a <em>secondary</em> tracker to supplement another form of fitness tracking. Again, this is a tracker best appreciated by people who go hard and aren’t afraid to experiment. </p><div id=\"ZuYiCM\"><div data-anthem-component=\"productcard:11102748\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/Ef3urSDJc4GRYpVZ2-bWN1lDKlc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23336503/acastro_220321_5092_0001.jpg",
  "description": "The 10 best trackers for your 2022 health goals",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}