{
  "title": "The internet is a force multiplier for Ukraine",
  "url": "https://www.theverge.com/22955742/ukraine-russia-invasion-social-media-platforms-democracy",
  "date": "2022-03-01T14:30:00.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GGaJtddm7FmqTN3mYDNfMqj5f5k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70564580/acastro_220224_stk010_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge Photography by Sergei Guneyev / Getty Images</figcaption>    </figure>  <p>But how much will it matter?</p> <p class=\"p--has-dropcap\" id=\"ijcuif\">Over the past decade, the biggest tech companies came to feel less like traditional corporations and more like quasi-states: borderless empires whose decisions increasingly had geopolitical consequences, to the growing frustration of the nation states in which they operate.</p><p id=\"ywSFRW\">During the rise of former President Trump and other authoritarians around the world, global attention sensibly focused on the worst aspects of this arrangement. As they grew, companies acquired a vast civic responsibility they were reluctant to accept. The platforms were motivated primarily by growth and profits, and many were structured to make their leaders <a href=\"https://www.nytimes.com/2019/11/27/opinion/tech-dual-class-stock.html\">unaccountable even to their own boards</a>. In the meantime, platforms were exploited by adversaries — along with domestic politicians, led by Trump — spreading lies and sowing dissent in the United States and abroad.</p><p id=\"VModWA\">From 2016 to 2021, then, it was only natural that pro-democracy forces largely came to believe that social networks could only have a corrosive effect on the world. Algorithms built to identify and promote the angriest and most outrageous sentiments would, over time, polarize populations and pave the way for their countries to be taken over by strongmen. Weak, largely outsourced content moderation would make it easy for authoritarians to rule through misinformation and incitements to violence. Social networks seemed to play a key role in democracy’s doom loop.</p><p id=\"KbL8Gq\">Perhaps they still will. But it has been striking, watching the horrific invasion of Ukraine that Vladimir Putin’s Russia began on Thursday, the degree to which social networks have been used in efforts to <em>preserve</em> democracy.</p><div class=\"c-float-right c-float-hang\"><aside id=\"23kSvN\"><q>Ukraine complicates our understanding of big tech and democracy</q></aside></div><p id=\"FRb0G1\">After being widely credited for Trump’s election in 2016, and preparing to initiate the biggest war of the social network era, Russia might have been expected to excel at information warfare. Instead, like the rest of the war, it has gone quite badly for them. It is Ukraine that has been masterful in its use of social media — and while that may not prove decisive in whether or not it overcomes Russia’s superior military, at the very least it complicates our understanding of big tech and democracy.</p><p id=\"xWlxKu\">Today, let’s talk about how.</p><p id=\"Tzj1u6\">Start with the broader context. The United States played a critical role in damaging Putin’s credibility before the war even began. US intelligence agencies understood that an invasion was coming, the Biden administration <a href=\"https://www.nytimes.com/2022/02/12/us/politics/russia-information-putin-biden.html\">shared that information publicly</a>, and in doing so removed both Putin’s ability to launch a surprise attack and any efforts to create a phony pretext for doing so.</p><p id=\"vGkWBI\">Those moves were not enough to prevent the invasion. But they <a href=\"https://www.nytimes.com/2022/02/24/world/europe/intelligence-putin-biden-ukraine-leverage.html\">did create a powerful trans-Atlantic alliance of democratic countries</a>, creating a more unified front against authoritarianism than the world has seen in decades, and <a href=\"https://twitter.com/RHFontaine/status/1498101441814310914\">re-shaped the global order in a matter of days</a>. Germany surprised the world by saying it would increase defense spending after decades of pacifism; famously neutral Switzerland said it would join the rest of the free world in applying economic sanctions to Russia; the European Union is sending jets to Ukraine.</p><p id=\"mvv3ss\">At a time of plummeting trust in institutions, the collective force of these actions has been profound. There may be no greater depolarizing force on earth than a common enemy, and Russia’s murderous and erratic autocrat has given us one.</p><p id=\"No1Tdu\">All of this is critical, I think, to understanding the moves platforms have made (and resisted making) over the past few days, and of the way the war has been received on those platforms. It is exceedingly rare to witness an event of such global importance in which the forces of good and evil are so clearly delineated. Everything we have seen on tech platforms so far is downstream of that.</p><div class=\"c-wide-block\"><div id=\"5bEtnS\"><iframe src=\"https://www.platformer.news/embed\" width=\"480\" height=\"320\"  frameborder=\"0\" scrolling=\"no\"></iframe></div></div><p id=\"QjwuKn\">So what have we seen?</p><p id=\"r427P1\">One, observers have been electrified by <a href=\"https://www.nytimes.com/2022/02/27/world/europe/volodymyr-zelensky-ukraine-russia.html\">regular videos shared on social networks</a> by Ukraine President Volodymyr Zelensky, whose decision to remain in the capital city of Kyiv while it is bombarded by Russians has rallied the world to his side. Grim-faced but resolute, shooting on a mobile phone selfie cam, Zelensky’s status as a global folk hero is secure. In bravely resisting a massive army in the face of likely death, addressing the world directly using social media, he has inspired massive popular support for Ukraine that translated into aid from other countries around the world.</p><p id=\"3jzWrr\">If you want to know how social media can affect politics in a <em>good</em> way, <a href=\"https://www.nytimes.com/2022/02/27/world/europe/volodymyr-zelensky-ukraine-russia.html\">here’s this from <em>The</em> <em>New York Times</em></a>: “Mr. Zelensky’s actions and the tough resistance efforts from ordinary Ukrainian men and women … have also had an important impact on European opinion, European officials say, making it easier for their leaders to be bolder and to more freely accept refugees coming their way from Ukraine.”</p><p id=\"zXt7Vc\">Two, social networks have made this war feel like something that average people around the world can <em>participate </em>in.</p><p id=\"1wfaND\">When the (incredible, in all senses of the word) Twitter account of the government of Ukraine tweeted asking for donations in cryptocurrencies, <a href=\"https://www.theverge.com/2022/2/26/22952357/ukraine-bitcoin-ethereum-donation-vitalik-buterin?scrolla=5eb6d68b7fedc32c19ef33b4\">people contributed $9.9 million in two days</a>. (It’s now above <a href=\"https://www.coindesk.com/business/2022/02/28/crypto-donations-to-ukraine-near-10m/\">$20 million</a>.) When Ukraine’s minister for digital transformation announced the creation of a volunteer “IT army” for cyber defense and attacks, <a href=\"https://www.wired.com/story/ukraine-it-army-russia-war-cyberattacks-ddos/\">175,000 people joined the Telegram channel</a>. Since then, they’ve conducted distributed denial-of-service attacks against more than 25 Russian websites, including banks and government websites.</p><p id=\"vmN6nR\">This enthusiasm has also been fueled in part by all of the viral stories about Ukrainians resisting occupation: <a href=\"https://www.theguardian.com/world/2022/feb/28/ukrainian-sailor-arrested-for-trying-to-sink-oligarchs-superyacht\">the Ukrainian sailor who tried to sink the yacht of his Russian oligarch boss</a>; the Ukrainian company that hacked Russian electric vehicle chargers to stop them from working (and display “<a href=\"https://www.vice.com/en/article/akvya5/russian-electric-vehicle-chargers-hacked-tell-users-putin-is-a-dickhead\">PUTIN IS A DICKHEAD</a>”); the Ukrainian soldiers caught on video telling an advancing Russian warship to “go fuck yourself.” (<a href=\"https://www.cnn.com/2022/02/28/europe/snake-island-ukraine-russia-survivors-alive-intl/index.html\">They seem to have survived the attack</a>.)</p><p id=\"xkvzV9\">Platforms can participate, too. Microsoft said Monday that it worked with the Ukrainian government over the weekend <a href=\"https://blogs.microsoft.com/on-the-issues/2022/02/28/ukraine-russia-digital-war-cyberattacks/\">to prevent a series of cyber attacks</a> on the eve of the invasion. Facebook and Twitter <a href=\"https://www.nbcnews.com/tech/internet/facebook-twitter-remove-disinformation-accounts-targeting-ukrainians-rcna17880\">removed small-scale propaganda campaigns tied to Russia and Belarus</a>. <a href=\"https://www.reuters.com/technology/youtube-blocks-rt-other-russian-channels-generating-revenue-2022-02-26/\">YouTube (finally) demonetized</a> the Russian state media channel RT, and restricted access to it within Ukraine.</p><p id=\"5rBcWD\">Social media didn’t cause any of this resistance. But it amplified these stories quickly and at scale, overwhelming what <a href=\"https://twitter.com/irgarner/status/1498334397904441344?s=21\">analysts say</a> has been a shockingly inept information strategy from the Russians. And with every viral TikTok about the situation unfolding — here’s one in which <a href=\"https://twitter.com/joshuapotash/status/1498332884121399307?s=21\">Ukrainians teach you how to drive abandoned Russian military vehicles</a> — support for the resistance grows.</p><p id=\"R5CgGx\">All of this has offered some comfort during a frightening time. But there is a risk of making too much of the way the internet and social networks have bolstered the Ukrainian resistance to date — or in underestimating Russia’s ability to retaliate.</p><p id=\"9kc6gN\">On the war front: yes, Ukraine’s efforts so far have been inspiring. But we are only a few days in, and as this long thread from a Russian military analyst explains, <a href=\"https://twitter.com/kofmanmichael/status/1498381975022940167?s=21\">most of the country’s significant firepower is still waiting to be deployed</a>. The most likely outcome continues to be a Russian takeover of the country. (Though even then Putin may find it exceedingly difficult or even impossible to govern, as Yuval Noah Harari <a href=\"https://www.theguardian.com/commentisfree/2022/feb/28/vladimir-putin-war-russia-ukraine\">explains here</a>.)</p><p id=\"WhDldV\">And on the platform front, the path forward is not at all clear. For their part, tech companies have largely acted as democratic governments have asked them to. On Monday, Meta’s Nick Clegg announced that the company <a href=\"https://www.theverge.com/2022/2/28/22955542/facebook-meta-blocks-rt-sputnik-eu-instagram\">would restrict access to Russian state media networks RT and Sputnik</a> in the European Union, just as the European Union itself announced it would do <a href=\"https://www.theverge.com/2022/2/27/22953563/eu-ban-russia-aircraft-state-backed-media-ukraine-sanctions?utm_campaign=theverge&amp;utm_content=chorus&amp;utm_medium=social&amp;utm_source=twitter\">a day earlier</a>. (TikTok <a href=\"https://twitter.com/oliverdarcy/status/1498436939078373376?s=21\">followed suit on Monday as well</a>.) Twitter stopped short of banning the networks but <a href=\"https://twitter.com/yoyoel/status/1498343849273425921\">added a state media label</a> to any links shared on the network.</p><p id=\"cRMZSn\">Russia is actively resisting these efforts. It <a href=\"https://www.theverge.com/2022/2/26/22952006/russia-block-twitter-ukraine-invasion-censorship-putin\">blocked Twitter</a> and <a href=\"https://www.protocol.com/policy/russia-chicken-facebook\">slowed Facebook</a>. It sought to ban <a href=\"https://www.vice.com/en/article/qjbxmv/russia-ukraine-tiktok\">any footage of military action on TikTok</a>. It wrote to Google <a href=\"https://www.reuters.com/world/europe/russia-demands-google-restore-access-its-media-youtube-channels-ukraine-2022-02-27/\">protesting the demonetization of RT and Sputnik</a>.</p><p id=\"oKPajl\">These moves are unfortunate primarily for Russian citizens, who will have less access to independent media and the organizing tools that social networks provide. But Russia has other tools at its disposal, and I fear that the country may use them in very grim ways.</p><div class=\"c-float-left c-float-hang\"><aside id=\"K3ozAz\"><q>“Hostage-taking laws”</q></aside></div><p id=\"bl4uXX\">In September I wrote about <a href=\"https://www.platformer.news/p/apple-and-google-bow-to-russia?utm_source=url\">the decision by Apple and Google to comply with a Russian order</a> to remove from their app stores an app designed to help voters organize around anti-Putin candidates. They had little choice but to do so if they wished to remain in business there. A recent piece of Russian legislation known as the “landing law” requires some tech companies to maintain local offices with designated representatives who can be personally intimidated into doing the government’s bidding — part of a wave of so-called “<a href=\"https://www.platformer.news/p/how-censorship-became-the-new-crisis\">hostage-taking laws</a>” around the world. Google employees were reportedly threatened with jail or worse for failing to remove the voting app last year.</p><p id=\"HQDQXG\">The platforms have been given a deadline of February 28th to comply with the law, and were in varying stages of compliance when the war began. Here’s <a href=\"https://www.nytimes.com/2022/02/26/technology/russia-censorship-tech.html\">Adam Satariano in <em>The</em> <em>New York Times</em></a>:</p><blockquote><p id=\"xKltNb\">Last week, Russian authorities warned Google, Meta, Apple, Twitter, TikTok and others that they had until the end of this month to comply with a new law that requires them to set up legal entities in the country. The so-called landing law makes the companies and their employees more vulnerable to Russia’s legal system and the demands of government censors, legal experts and civil society groups said. […]</p><p id=\"FJZ4Es\">Apple, TikTok and Spotify have complied with the landing law, according to the Russian internet regulator, Roskomnadzor, and Google has taken steps to do so as well. Twitch and Telegram have not. Meta, the parent of Facebook, and Twitter have complied with some parts of the law but not others.</p></blockquote><p id=\"qAmqXO\">What happens next will bear close scrutiny. Many of these platforms have employees in Russia, and if the war continues to escalate they could be at personal risk.</p><p id=\"df9A0V\">Platforms that do not have full-time employees in the country may have an easier time resisting Russia’s awful demands. Netflix, which was ordered to begin carrying Russian news and entertainment channels (with all of the state propaganda that entails) under a new rule, <a href=\"https://www.wsj.com/articles/netflix-wont-add-russian-channels-to-service-defying-new-regulation-11646076964#:~:text=It%20has%20no%20offices%20or,accounts%20for%20its%20Russia%20business.\">said Monday that it would refuse</a>. Notably, it has no workers in Russia. (Neither does Twitter.)</p><p id=\"RoNTez\">But the biggest platforms do not have that luxury, and the implications here could be very dangerous. With the world united against Russia, and platforms working in concert with the global order to thwart Russia’s information warfare, local employees remain a chillingly obvious point of leverage.</p><aside id=\"pbyADU\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Deplatforming Trump didn’t work\",\"url\":\"https://www.theverge.com/2021/12/14/22833467/deplatforming-trump-didnt-work\"},{\"title\":\"What a new book reveals about Facebook and Russian interference\",\"url\":\"https://www.theverge.com/2021/7/15/22577939/facebook-an-ugly-truth-frankel-kang-stamos-russia-interference\"},{\"title\":\"Why the 2020 election will never end on social networks\",\"url\":\"https://www.theverge.com/21558540/election-2020-twitter-facebook-biden-trump-stop-the-steal\"}]}'></div></aside><p id=\"SiXcJf\">Putin’s war has demonstrated the powerful role that platforms can play in amplifying democratic voices. If they weren’t that effective, after all, Russia wouldn’t be spending so much time trying to throttle them. After a half-decade in which it appeared Russia and other authoritarians had successfully bent platforms to their will, the past few days may have permanently altered our sense of Russia’s ability to manipulate global narratives.</p><p id=\"CU7RrB\">But control of the narrative and control of geography are two distinct things. If Russia ultimately takes over Ukraine, this war will have also revealed the limits of what internet organizing can do to stop a global superpower. And if other democracies fall to fascism, our own included, I have no doubt that platforms will be pressured into playing an important supporting role.</p><p id=\"MAVRtg\">In the meantime, millions of people are needlessly suffering. Billions are fearing what further escalation could mean for their own families. And despite the moral clarity that they have been gifted by Putin, platforms still face very difficult questions around how to navigate a world at war, starting with their own employees in Russia.</p><p class=\"c-end-para\" id=\"is6bsP\">The stakes have rarely been higher. For a few days, the internet has been a valuable force multiplier for Ukraine and the allies of democracy. But the worst of this war is very likely yet to come. And when it arrives, it may have consequences no internet platform is equipped to address alone.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5KzyCdu7CziFi1w6qM0PPS9YAHI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268331/acastro_220224_stk010_0001.jpg",
  "description": "Ukraine complicates our understanding of big tech and democracy",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}