{
  "title": "The cost of ripping and replacing Chinese cellular equipment has ballooned by billions",
  "url": "https://www.theverge.com/2022/2/4/22918611/rip-and-replace-hauwei-zte-fcc-cell-network-securty",
  "date": "2022-02-05T00:44:52.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/W8Kj6v9WxcS12tEmy-InHZPwuhg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70473765/acastro_190521_1777_huawei_0003.0.0.jpg\" />        <figcaption><em>The original estimate was $1.8 billion. The FCC received applications for $5.6 billion in reimbursements.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"jYAcVD\">The estimated cost of replacing Huawei and ZTE equipment in US networks has increased substantially. On Friday, Federal Communications Commission (FCC) chairwoman Jessica Rosenworcel <a href=\"https://www.fcc.gov/document/rosenworcel-notifies-congress-demand-rip-and-replace-program\">told Congress</a> that providers had applied to be reimbursed $5.6 billion for “ripping and replacing” equipment deemed insecure by the US government (<a href=\"https://www.lightreading.com/security/fccs-rip-and-replace-for-zte-and-huawei-balloons-to-%2456b/d/d-id/775112?_mc=RSS_LR_EDT\">via <em>Light Reading</em></a>). In September, 2020, the FCC <a href=\"https://www.theverge.com/2020/9/4/21422939/huawei-zte-us-phone-networks-fcc-congress-reimbursement-cost\">estimated that the effort would cost $1.8 billion</a>, and in December, 2020 Congress <a href=\"https://www.fiercetelecom.com/telecom/fcc-sets-date-to-begin-reimbursement-for-huawei-rip-and-replace-program\">earmarked around $1.9 billion for the effort</a>.</p><p id=\"sYR4fa\">But Rosenworcel said Friday in a statement that the FCC had received “over 181 applications from carriers who have developed plans to remove and replace equipment in their networks that pose a national security threat.” She went on to say that she “look[s] forward to working with Congress to ensure that there is enough funding available for this program to advance Congress’s security goals and ensure that the U.S. will continue to lead the way on 5G security.”</p><div class=\"c-float-right\"><aside id=\"HFRc6g\"><q>The FCC declared that ZTE and Huawei were security risks in summer, 2020</q></aside></div><p id=\"LzvYOa\">The Supply Chain Reimbursement Program was put in place after intelligence agencies <a href=\"https://www.theverge.com/2019/5/22/18634401/huawei-ban-trump-case-infrastructure-fears-google-microsoft-arm-security\">raised concerns</a> about carriers building out their 5G networks with equipment from Chinese companies like Huawei. The FCC under former chairman Ajit Pai said <a href=\"https://www.theverge.com/2020/6/30/21308477/fcc-huawei-zte-ban-universal-service-fund-national-security-threat-risk\">ZTE and Huawei were national security risks</a>, more or less blocking telecoms from purchasing equipment from them. But by that point, some carriers had already bought and installed equipment from the manufacturers, and smaller telecoms claimed they wouldn’t be able to bear the replacement costs (especially since the main draw of the Chinese equipment was its low cost compared to other providers).</p><p id=\"SmwvDB\">The program was designed to “reimburse providers of advanced communications services for costs reasonably incurred for removing, replacing, and disposing of communications equipment and services” from ZTE and Huawei. After surveying networks that had the Chinese equipment in 2020, the FCC reported that it would cost over $1.8 billion to “remove and replace,” and estimated that around $1.6 billion would qualify for reimbursement.</p><p id=\"cQctKk\">While the applications from carriers totaled more than three times that in the three month filing window (which closed at the end of January), the final bill won’t necessarily end up being $5.6 billion — for one, Congress hasn’t appropriated the funds yet. Rosenworcel also <a href=\"https://twitter.com/JRosenworcelFCC/status/1489712137077415944?s=20&amp;t=j_n4xy5-eXjJwEXvTM0IAw\">tweeted on Friday</a> that the applications were being reviewed, so there’s the possibility that the total could end up being less. </p><div id=\"peRcKb\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">While we have more work to do to review these applications, I look forward to working with Congress to ensure that there is enough funding available for this program to advance Congress’s security goals and ensure that America will continue to lead the way on <a href=\"https://twitter.com/hashtag/5G?src=hash&amp;ref_src=twsrc%5Etfw\">#5G</a> security.</p>— Jessica Rosenworcel (@JRosenworcelFCC) <a href=\"https://twitter.com/JRosenworcelFCC/status/1489712137077415944?ref_src=twsrc%5Etfw\">February 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/FCB7PblhMxuLZlaMRnjCohcvR7I=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16290650/acastro_190521_1777_huawei_0003.0.jpg",
  "description": "The carriers’ applications are still being reviewed.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}