{
  "title": "The Duovox Mate Pro is a tiny camera that truly sees in the dark",
  "url": "https://www.theverge.com/2022/4/13/23023276/duovox-mate-pro-night-vision-camera-hands-on-kickstarter",
  "date": "2022-04-13T08:36:01.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uTaJSflybU7BLUgxBdHh_NyxWGg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70743477/IMG_2461.0.jpg\" />    </figure>  <p id=\"hxOslK\">If you have a relatively recent phone, you probably have a dedicated night mode in your camera app. These features have transformed the possibilities for night-time photography, blending multiple images together to create a single bright exposure. But there are limitations to this approach — you have to stay still, for example, and it doesn’t work with video.</p><p id=\"d2zD7d\">The makers of a new camera called the Duovox Mate Pro, which <a href=\"https://www.kickstarter.com/projects/duovox/duovox-mate-pro?ref=cnlfog&amp;utm_source=pr&amp;utm_medium=TheVerge&amp;utm_campaign=Duovox\">just launched on Kickstarter</a>, are betting that there’s still a place for dedicated low-light hardware. The Mate Pro is a compact camera with a Sony STARVIS 2 CMOS sensor that Duovox claims is a thousand times more sensitive than the sensor in an iPhone 13 Pro and has 148 percent more dynamic range than a Sony A7S III.</p><p id=\"8wE6eE\">Sony’s STARVIS image sensors are primarily designed for security cameras. They use backside illumination and have the ability to capture infrared light as well as visible light, which lets them produce a viewable image in the most extreme of lighting conditions.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/v9j50B1aJ-Ksy5McZmUI3xMMVqg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23386448/IMG_2464.jpeg\">  </figure><p id=\"jsIfHU\">The Mate Pro’s design is utilitarian but cute in its own way. The proportions kind of remind me of <a href=\"https://www.theverge.com/2011/10/31/2527244/pentax-q-hands-on\">Pentax’s Q</a> line of mirrorless cameras from a decade ago — there’s a tiny lens that looks huge on an even tinier body, which is only four inches wide. The back panel of the camera is solely occupied by a 3-inch touchscreen, which is used to control almost everything; the top plate just has a power button, a shutter button, and four-way directional buttons. </p><p id=\"v87xuv\">The high light sensitivity is clearly apparent when walking around with the Mate Pro. I live in Tokyo, where it’s difficult to find yourself in a truly pitch-black situation, but the darkest alleyways in my neighborhood looked like daylight on the Mate Pro’s screen, with colors rendered clearly. It’s an interesting alternative to a flashlight — you can see the whole scene in front of you instead of shining a light in a certain direction. (There is also an actual flashlight mounted on the front of the camera, too.)</p><p id=\"YfiDEJ\">Just don’t expect the image quality to hold up for still photography. The sensor is only 2K resolution, and the odds are really stacked against the Mate Pro when you compare it to a smartphone night mode that makes use of complex algorithms and a modern image signal processor. Duovox says it’s using advanced noise reduction, but the results are still very noisy. Here’s an example next to the Oppo Find X5 Pro, which I would rate as having one of the best night modes available today:</p><div id=\"C5Mes3\"><div data-anthem-component=\"imageslider:11141844\"></div></div><p id=\"e2A1xe\">Poor image quality aside, the Mate Pro’s lens isn’t really ideal for general photography, either. The focal length is tight but the minimum focusing distance is long, meaning it’s not useful for taking photos of close objects. For snapshots and quick video clips, though, it does the job.</p><p id=\"GAhZ33\">It’s better to think of the Duovox Mate Pro as a portable security camera than an artistic tool. You can capture footage of just about anything with this device, and it’s small enough to mount almost anywhere and leave to run for as long as the battery (internal or USB-C-powered external) holds out. There’s also a built-in Wi-Fi hotspot so you can stream the camera’s feed to Duovox’s smartphone app.</p><p id=\"nifs0R\">I could see the Mate Pro as a useful travel accessory, too. I often do stay in parts of Japan with very little light — unfortunately not during the time I’ve had with the Mate Pro — and it would be helpful when hiking, driving, or looking for wildlife. </p><p id=\"mBoVXX\">The Mate Pro is available on Kickstarter from $599, but Duovox says the standard retail price will be $1,200, which feels like a stretch. Depending on your use case, though, $599 will either be a lot of money to pay for a bad photo camera or a pretty good deal for legitimate night vision in your pocket. It’s expected to ship in October this year.</p><div><div id=\"evTXrk\"><div data-anthem-component=\"aside:1523637\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/BRiPyNsq88gJC-pZcQ7SERwFg-w=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23386447/IMG_2461.jpg",
  "description": "More of a portable security camera than an artistic tool.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}