{
  "title": "The SEC subpoenas Tesla over one of Elon Musk’s tweets again",
  "url": "https://www.theverge.com/2022/2/7/22921648/tesla-sec-elon-musk-subpoena-tweet-poll-shares",
  "date": "2022-02-07T15:20:13.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"Elon Musk Visits Site Of New Tesla Gigafactory In Germany\" src=\"https://cdn.vox-cdn.com/thumbor/hieO4nicIpwUZ_U6jlUTbgo9yjc=/0x127:3678x2579/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70479528/1234732042.0.jpg\" />        <figcaption>Photo by Patrick Pleul - Pool/Getty Images</figcaption>    </figure>  <p id=\"Z8dSU2\">The Securities and Exchange Commission issued a subpoena to Tesla over Elon Musk’s 2018 tweet about taking the company private, <a href=\"https://www.autonews.com/automakers-suppliers/sec-subpoenas-tesla?utm_source=dlvr.it&amp;utm_medium=twitter\">according to <em>Bloomberg</em></a>. </p><p id=\"yYeDMH\">The news of the subpoena, which was issued November 16th, 2021, <a href=\"https://www.theverge.com/2018/9/27/17911428/sec-lawsuit-elon-musk-tesla-funding-tweet\">reignites a feud between Musk and the SEC</a> that has been simmering for <a href=\"https://www.theverge.com/tldr/2019/8/7/20758944/elon-musk-twitter-tesla-funding-secured-private-420\">over four years</a>. Musk sent the notorious tweet on August 7th, 2018, in which he claimed to have the funding to take Tesla private at $420 a share. (Tesla has been a publicly traded company since 2010.) </p><p id=\"COvULN\">Musk said on Twitter that he had “funding secured” to pull off the deal and buy out any shareholders who didn’t want to stick with the company. He published these tweets during the afternoon while trading was still happening, and the company’s stock price jumped in response.</p><div class=\"c-float-right\"><aside id=\"RpoOFH\"><q>reigniting a feud between Musk and the SEC that has been simmering for over four years</q></aside></div><p id=\"8DmLBg\">The SEC immediately launched an investigation, eventually concluding that, while he had held a few meetings with Saudi Arabia’s sovereign wealth fund, Musk “had never discussed a going-private transaction at $420 per share with any potential funding source, had done nothing to investigate whether it would be possible for all current investors to remain with Tesla as a private company via a ‘special purpose fund,’ and had not confirmed support of Tesla’s investors for a potential going-private transaction.”</p><p id=\"6ipOsW\">A year later, Tesla and the SEC agreed that Musk’s tweets about Tesla should be subject to more oversight. <a href=\"https://www.theverge.com/2019/4/26/18484751/elon-musk-sec-fraud-tesla-tweets-contempt-agreement\">As per the settlement</a>, a company lawyer was designated to pre-approve Musk’s tweets about Tesla’s financial health, sales, or delivery numbers — estimated or otherwise — as well as other specific subjects. </p><p id=\"ctdjrQ\">But that hardly settled the dispute. In February 2019, the SEC asked a federal judge to hold <a href=\"https://www.theverge.com/2019/2/25/18240568/elon-musk-tesla-sec-contempt-of-court-settlement-violation-tweet-twitter\">Musk in contempt</a> for sending out an inaccurate tweet, arguing it violated the terms of the agreement. (Musk <a href=\"https://twitter.com/elonmusk/status/1098013283372589056?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1098080063801585664&amp;ref_url=https%3A%2F%2Fwww.theverge.com%2F2019%2F2%2F25%2F18240568%2Felon-musk-tesla-sec-contempt-of-court-settlement-violation-tweet-twitter\">tweeted</a> Tesla would make “around” 500,000 Model 3s this year, which appeared to clash with the company’s official guidance of delivering 360,000 to 400,000 cars total in 2019.)</p><p id=\"n4Y7lx\">Musk claimed the SEC was attempting an “<a href=\"https://www.theverge.com/2019/3/11/18260339/elon-musk-sec-twitter-filing-contempt-response\">unconstitutional power grab</a>,” and the agency said the Tesla CEO was in “<a href=\"https://www.theverge.com/2019/3/18/18271914/sec-elon-musk-contempt-twitter-court-fraud\">blatant violation</a>” of the settlement. Eventually, the two sides were ordered by a federal judge <a href=\"https://www.theverge.com/2019/4/4/18295240/elon-musk-sec-tweets-judge-nyc-ruling\">to work things out</a>. </p><p id=\"DyMI1C\">The latest subpoena was issued a little over a week after Musk tweeted <a href=\"https://www.theverge.com/2021/11/7/22768364/elon-musk-poll-twitter-tesla-10-percent-billionaires-capital-gains-tax\">a poll asking his followers</a> whether he should sell 10 percent of his Tesla stake, ostensibly to pay more tax. The carmaker’s shares plunged 16 percent the following two trading days.</p><div id=\"nhh8Ed\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Much is made lately of unrealized gains being a means of tax avoidance, so I propose selling 10% of my Tesla stock.<br><br>Do you support this?</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1457064697782489088?ref_src=twsrc%5Etfw\">November 6, 2021</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"tPCir2\">Musk had been a vocal critic of a <a href=\"https://www.wsj.com/articles/how-the-billionaires-income-tax-would-work-11635325201?mod=article_inline\">proposal to tax unrealized gains</a> on publicly traded assets for some of the wealthiest Americans. Under the <a href=\"https://www.finance.senate.gov/imo/media/doc/Billionaires%20Income%20Tax%20-%20One%20Pager.pdf\">proposal</a>, if assets increased in value, even if the person didn’t sell the assets, the person would have to pay taxes on the unrealized gain. It would basically end the tax loophole that lets billionaires defer capital gains taxes indefinitely while still being able to borrow against that wealth.</p><p id=\"HwmRrK\">Tesla, which revealed the subpoena in its <a href=\"https://sec.report/Document/0000950170-22-000796/\">10-K filing</a> to the SEC, did not elaborate as to the nature of the agency’s investigation, except to say that it was “seeking information on our governance processes around compliance with the SEC settlement, as amended.” </p><p id=\"FIeIfz\">Tesla did not respond to a request for comment; the company disbanded its public relations department in 2019 and has not responded to requests from the media since then. A spokesperson for the SEC declined to comment. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FSAZDZ_2ZAkHVlhnVw3wSUle9bQ=/0x390:3678x2316/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23223357/1234732042.jpg",
  "description": "Another tweet, another subpoena",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}