{
  "title": "The Book of Boba Fett is so busy it forgets to make Boba Fett interesting",
  "url": "https://www.theverge.com/22925214/the-book-of-boba-fett-season-finale-review-star-wars-disney-plus",
  "date": "2022-02-09T15:13:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LoxYGYUvSmqqtpYF-m1W323jlLI=/714x0:3126x1608/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70488110/BUC_FF_006086.0.jpg\" />        <figcaption>Lucasfilm Ltd.</figcaption>    </figure>  <p id=\"HAurAP\">The final episode from <em>The Book of Boba Fett</em> has arrived, bringing a close to the increasingly crowded series. But the finale still can’t manage to corral the show’s various plot threads into a satisfying ending, despite some big action moments designed to delight fans. </p><p id=\"jEjF7f\">Fett’s character has always been one full of potential: a morally ambiguous bounty hunter roaming the galaxy with a badass outfit and a cool-looking ship. Unfortunately, this week’s finale falls flat in a similar manner to the rest of the show. Boba Fett (Temuera Morrison) still feels strangely sidelined in the series that bears his name, defanged of his fearsome reputation into a more family-friendly hero. And the show leaves viewers with <a href=\"https://www.theverge.com/2022/1/13/22882255/the-book-of-boba-fett-on-the-job-training\">more questions than answers</a> about who Boba Fett is and what he wants in life. </p><aside id=\"yg62Kw\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"We have so many questions about Boba Fett’s new job in The Book of Boba Fett\",\"url\":\"https://www.theverge.com/2022/1/13/22882255/the-book-of-boba-fett-on-the-job-training\"},{\"title\":\"The Book of Boba Fett’s first chapter has a lot of blank pages  \",\"url\":\"https://www.theverge.com/2021/12/29/22858259/the-book-of-boba-fett-episode-one-recap-star-wars-mandalorian\"}]}'></div></aside><p id=\"tptv5l\">Looking back on <em>The Book of Boba Fett</em> as a whole, there’s seemingly three shows here. There’s what was ostensibly the main story, with Boba Fett establishing himself as a crime lord in Mos Espa. There were the flashbacks filling in every last gap of the time between when we last saw Boba (vanishing into the sarlacc pit off of Jabba’s barge) and his reappearance in <em>The Mandalorian</em>. And then there were the two episodes of <em>The Mandalorian</em> with guest star Boba Fett stuck in the middle. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KPM8Exvr97BwfhhGGJbdXqDyHLU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23229286/BUC_FF_000917.jpg\">      <cite>Lucasfilm Ltd.</cite>  </figure><p id=\"henBo4\">Unfortunately, the first storyline — what should have been the main plot of the show — was the one that <em>The Book of Boba Fett </em>was least interested in telling. </p><p id=\"FPRVPE\">Star Wars has the unfortunate tendency to leave no corner of its universe unexplained or disconnected, and <em>The Book of Boba Fett</em> takes this habit to its extreme. It feels like someone at Lucasfilm just really wanted a chance to tell fans <em>exactly</em> what happened to Boba Fett between his appearances. Sticking all that backstory into the next season of <em>The Mandalorian</em> wouldn’t fit, so Boba gets his own show. But those flashbacks aren’t enough to sustain a whole TV series, so the A plot is grafted on. </p><p id=\"g20KF9\">But once that sequence of extended flashbacks is done, The Book of Boba Fett doesn’t really know what else to do with its rehabilitated new hero. Boba has nothing to really strive for, no motivation for any of the things he’s doing, and no ambitions other than “riding a rancor” (which, obviously, Boba gets to do in a moment that can only be described as <em>rancor ex machina</em>). </p><div class=\"c-float-right\"><aside id=\"lIp7i6\"><q>Boba just really wants to ride a rancor</q></aside></div><p id=\"umVa71\">Even characters <em>in</em> the show are confused. As Cad Bane comments during his standoff with Fett: “One thing I can’t figure. What’s your angle?”</p><p id=\"ECVnCO\">“This is my city. These are my people,” Fett declares while facing near-certain death with the unexpected commitment of a man who almost certainly does not know the name of a single person who lives in Mos Espa. (This sudden dedication to ideals is especially rich coming from the same person who, mere scenes before, incredulously observes that Din Djarin is willing to put his own life on the line for his Mandalorian creed.) </p><p id=\"hdhXRE\">Part of the problem is that the series has no real antagonist to throw at him, or any real threats that stand in the way of whatever it is Boba actually wants. The Hutt twins who show up to lay claim to Jabba’s turf don’t even get names before they jet off. The other crime families of Mos Espa are non-entities. And the show’s “big bad,” the Pyke Syndicate, is just an army of goons that die in waves as needed and whose leadership is instantly taken out by Fennec Shand in a single go. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OM8orBN-EfiZfxb7m1TTkCi_aio=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23229284/BUC_FF_005303.jpg\">      <cite>Lucasfilm Ltd.</cite>  </figure><p id=\"oy3IxM\">The closest thing the finale does to give Boba an actual nemesis is a half-hearted try at turning the live-action debut of <em>The Clone Wars</em>’ Cad Bane into a worthy adversary. It’s an 11th hour storyline that requires viewers not only to be familiar with the character from his animated appearance, but <em>also</em> be aware of his and Boba’s mentor/mentee relationship that went sour in a planned arc of The Clone Wars TV series <a href=\"https://starwars.fandom.com/wiki/The_Clone_Wars_Legacy#Bounty_Hunter_Arc\"><em>that never actually happened</em></a>. </p><p id=\"eKvbPT\">Implying that there’s a long and meaningful history between two characters isn’t a substitute for actually having that relationship, and certainly not one that can hang the entire climax of the show on. There’s a world in which <em>The Book of Boba Fett</em> went and actually told the story of Fett and Bane’s history and established Bane as a darker foil that Fett is striving to avoid becoming, but it’s not the show we got here. </p><p id=\"d22DfS\">The end result is less a meaningful opportunity to examine what makes Boba (and his newfound morales) different from the morally gray Bane, and more of an opportunity for creator Dave Filoni to try and take another shot at retroactively canonizing <a href=\"https://www.youtube.com/watch?v=85Jw-63YNYI\">his original story for the character</a>. And even then, it’s not the dramatic peak of the episode: that moment happens a scene later when Grogu (née Baby Yoda) and Mando get to team up to fight off Boba’s loose rancor. </p><p id=\"OLh98d\">It’s not clear where <em>The Book of Boba Fett</em> goes forward from here. The show leaves off with Fett and his newly acquired crew just sort of hanging out in Mos Espa, having won over the townsfolk thanks to their heroics. Disney hasn’t announced a second season for the series yet, and the closing scene of the show — which shifts focus again to the Mandalorian and Grogu flying off together — points towards Star Wars’ Disney Plus-verse heading back to continue that story with <em>The Mandalorian</em>’s third season whenever it arrives in the future. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oqSGGudiUg7N5hSoGCQWDylLq-M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23229285/BUC_FF_005174.jpg\">      <cite>Lucasfilm Ltd.</cite>  </figure><p id=\"mRpHHW\">If Boba Fett does show up again, it feels like he’ll do so relegated in the same category of appearance as Peli Motto (Amy Sedaris) or Cobb Vanth (Timothy Olyphant), a recurring character encountered the next time Din and Grogu end up passing through Tatooine. </p><p id=\"zkNpCn\"><em>The Book of Boba Fett</em> was always going to be at a disadvantage: <em>The Mandalorian</em> had already taken on what would have been the perfect series for the armored bounty hunter. But like midichlorians or <em>Solo</em>, the series is more proof that attempting to explain everything in Star Wars takes away a bit of the magic that made it so cool in the first place. Sometimes, less is more — but in a world where the entire Disney Plus streaming service hinges on new Star Wars shows, it’s likely that <a href=\"https://www.theverge.com/2022/2/2/22914062/the-book-of-boba-fett-star-wars-luke-skywalker-aging-cgi\">“more” is all we’ll get of these characters</a>. </p><aside id=\"811sKW\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Star Wars has a Luke Skywalker problem\",\"url\":\"https://www.theverge.com/2022/2/2/22914062/the-book-of-boba-fett-star-wars-luke-skywalker-aging-cgi\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/TvWWRq3iE1CGgMh2hG0NQL0IhTU=/385x0:3456x1608/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23229282/BUC_FF_006086.jpg",
  "description": "Boba Fett gets a backstory, and not much else, in his theoretically solo show",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}