{
  "title": "The internet’s infamous fake portable GameCube has finally been brought to life",
  "url": "https://www.theverge.com/2022/3/14/22977421/gamecube-portable-fake-image-2005-hardware-hack-gingerofoz-real",
  "date": "2022-03-14T19:31:31.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/HMhsVJalW1gjn3seZwcEIT97Sd4=/198x0:2244x1364/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70621880/Screen_Shot_2022_03_14_at_3.14.36_PM.0.png\" />    </figure>  <p id=\"G152PP\">The “Nintendo GameCube Advance” is a strange piece of internet gaming history: a fanciful render of a portable version of the GameCube that has <a href=\"https://web.archive.org/web/20060417150057/http://www.joystiq.com/2005/05/05/are-these-portable-gamecube-pics-real/\">made the rounds online since 2005</a>. But while the render has long been dismissed as a fan-made fake, YouTuber GingerOfOz has  taken matters into his own hands and <a href=\"https://www.youtube.com/watch?v=ENEpJJPQomg\">built a real, functional version of the concept</a>, <a href=\"https://www.eurogamer.net/articles/2022-03-14-the-portable-gamecube-is-now-a-real-thing\">as spotted by <em>Eurogamer</em></a>. </p><p id=\"sl5Fcq\">Ginger didn’t just build his own <em>real</em> GameCube Advance, though: he also tracked down the original artist behind the 2005 mockup and got the scoop on how and why they made it in the first place.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5_s9M_iMqd8_fANdMD6s7gLQHHM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23315534/maxresdefault.jpeg\">  </figure><p id=\"91aIl1\">Ginger is no stranger to making slick custom Nintendo mods, like his impressive <a href=\"https://www.theverge.com/circuitbreaker/2020/8/29/21406254/nintendo-modder-custom-wii-game-cube-game-boy\">Wii Boy Color from 2020</a> that somehow managed to shrink an entire Wii into the size and form factor of a Game Boy Color.</p><aside id=\"ruqAZW\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"This Game Boy Color is actually a portable Nintendo Wii and it’s so damn clean\",\"url\":\"https://www.theverge.com/circuitbreaker/2020/8/29/21406254/nintendo-modder-custom-wii-game-cube-game-boy\"}]}'></div></aside><p id=\"irg9mx\">The nearly 20-minute video details Ginger’s quest to re-create the console (based on just a 2005-era render of a single angle of the device) and the trials and tribulations along the way. Some aspects of the original render simply weren’t viable in real life, like the hinge (which Ginger instead built to function similar to a Nintendo DS for a more comfortable display angle) or the joysticks (which had to be replaced with 3DS-style sliders so the screen can actually close). </p><p id=\"nPNo8X\">The biggest sacrifice, though, is the lack of a functional disc drive. The parts were simply too big for the modded console, although Ginger does leave in a slot to allow for a disc to be (uselessly) inserted to match the render’s aesthetics. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/d2_sccCJ16dLIXDPdPt_RI1E9f8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23315560/Screen_Shot_2022_03_14_at_3.14.05_PM.png\">  </figure><p id=\"E0uDjr\">Ginger also technically didn’t build a portable <em>GameCube. </em>Instead, he used a Wii motherboard, which uses less power, is physically smaller, more easily modded, and is more affordable to get a hold of. Despite that, Ginger did go out of his way to add some of the GameCube’s unique software (including the iconic boot logo).</p><p id=\"GykqPz\">The final build is impressively functional: it looks like the original render and plays GameCube games, although it gets about an hour and a half of battery life. </p><p id=\"qbf60o\">As for the original render, it was created by an artist who goes by the name Demond. They said they created the original image for fun as a way to practice product rendering in Autodesk 3D Studio Max. Demond went on to create other futuristic renders — like a <a href=\"https://www.engadget.com/2011-01-26-the-psp2-so-far.html\">popular PSP2 image</a> that made its way around the internet a few years later — and has gone on to do work for actual video game companies like Ubisoft and Epic Games. </p><p id=\"EWsYX8\"></p><p id=\"iws4V3\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KzmMUGuoqkNE96ajZJDymEZx5ws=/0x43:2442x1322/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23315558/Screen_Shot_2022_03_14_at_3.14.36_PM.png",
  "description": "The disc drive isn’t functional, but the rest of the console is.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}