{
  "title": "The real magic mouse is made by Logitech, not Apple",
  "url": "https://www.theverge.com/23005435/magic-mouse-apple-logitech-powerplay",
  "date": "2022-04-02T10:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vgyVKCvVtieYsonU6QnXHoY1yHw=/13x0:2040x1351/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70701591/Apple_Magic_Mouse_Bad_Design_2.0.0.jpg\" />        <figcaption><em>Apple’s Magic Mouse doesn’t deserve the name.</em> | Photo by Nick Statt / The Verge</figcaption>    </figure>  <p>And it hasn’t changed since 2017</p> <p class=\"p--has-dropcap p-large-text\" id=\"ft8227\">We may never know why Apple doggedly insists on you charging its mouse upside down, like a beetle with its legs in the air, <a href=\"https://www.theverge.com/22967776/apple-magic-mouse-charging-port-bottom-upside-down-its-2022\">year</a> after <a href=\"https://www.theverge.com/2021/4/20/22394552/apple-new-magic-mouse-charging-port-bottom-lightning\">year</a> after <a href=\"https://www.theverge.com/2015/12/8/9872746/apple-bad-hardware-design-iphone-case-pencil-magic-mouse\">year</a>. </p><p id=\"6EWG2l\">But I do know this: if you want a mouse that <em>actually</em> feels magical, price be damned, Logitech has the gadget for you. </p><p id=\"1zqRM9\">When I want to charge my wireless mouse now, I don’t need to plug in a cord or place it on a dock. In fact, I don’t think about charging at all. It just... does. Because this past Christmas, a very generous brother-in-law effectively bought me a wireless mouse that charges itself.  </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Mk4ze7Z435FynZloWzxTA-vpIcI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360772/sean_hollister_20220401_123023.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Logitech Powerplay, with G502 Lightspeed mouse.</em></figcaption>  </figure></div><p id=\"h5nVRV\">What you’re looking at here is the <a href=\"https://www.amazon.com/Logitech-Powerplay-Wireless-Charging-Lightspeed/dp/B071WZ56G9?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Logitech Powerplay Wireless Charging System</a>, effectively a mousepad with a wireless charger that magnetically beams electricity to a special puck. Logitech’s been selling it <a href=\"https://www.theverge.com/2017/6/12/15780536/logitech-powerplay-wireless-charging-gaming-mouse-pad\">since 2017</a> — nearly as long as Apple has subjected us to the upside-down beetle. </p><p id=\"C7jnoZ\">To give you an idea, here is the <em>complete</em> description of what I did once I received this product: </p><ul><li id=\"d8zBmf\">Opened the packaging</li><li id=\"tgmTzl\">Placed the charging slab on my desk</li><li id=\"ytfNsA\">Plopped an included soft cloth mousepad on top</li><li id=\"jzFKNH\">Removed my Logitech G502 Lightspeed mouse’s wireless USB dongle from my PC</li><li id=\"MweYcm\">Plugged in the Powerplay’s USB cable instead</li><li id=\"5jGvzV\">Snapped the magnetic puck into the bottom of my mouse</li><li id=\"eukgVR\">Switched the mouse off and on</li></ul><p id=\"0azElD\">And then, <em>I never thought about charging my mouse again</em>. Not until this very story.</p><p id=\"l8aygE\">Seriously, it’s been three months, and I’ve never had to lift a finger — because it charges all by itself. Always. Automatically. Just by being on the mousepad. </p><p id=\"arpPCU\">Magic. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/g31OqQg3z4vNWEBlRo3RKBvFpL0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23359055/logitech_mouse_setup.jpg\">      <cite>Image: Logitech</cite>      <figcaption><em>This is literally the entire setup instructions.</em></figcaption>  </figure></div><p id=\"eV5MgU\">I have never reviewed a perfect product before, and I’m not saying this is one — I’d hate to jinx myself. Particularly when some customers <em>do </em>claim their mice eventually <a href=\"https://www.reddit.com/r/LogitechG/search/?q=charging%20powerplay&amp;restrict_sr=1&amp;sr_nsfw=\">stopped charging</a> or that the mousepad peeled apart and had to be taped or glued. Plus, it’s incredibly pricey at <a href=\"https://www.amazon.com/Logitech-Powerplay-Wireless-Charging-Lightspeed/dp/B071WZ56G9/?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$120 for the mousepad alone</a>, no mouse included. And no, it doesn’t double as a phone charger or use Qi: it only works with its own magnetic puck, which only fits into a handful of the priciest Logitech mice, including the G502 Lightspeed, G703, G903, G Pro Wireless and <a href=\"https://www.theverge.com/2020/11/18/21562618/logitech-g-pro-x-superlight-wireless-gaming-mouse-release-date-price-features-weight\">G Pro X Superlight</a>.</p><div class=\"c-float-right\"><aside id=\"NprJuo\"><q>Also it doesn’t work on metal desks</q></aside></div><p id=\"Hb74si\">Still, it carries a 4.7-star rating on Amazon with <a href=\"https://www.amazon.com/Logitech-Powerplay-Wireless-Charging-Lightspeed/dp/B071WZ56G9?th=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">surprisingly few negative reviews</a>. The most common complaint is that nearby speakers or headphones can pick up a hum when it’s charging, and I haven’t noticed that myself.</p><p id=\"k9JBm8\">What I have noticed so far is that there’s nothing to notice. It just works. No disconnects, no on-off switches, nothing to adjust. It is true that <a href=\"https://www.reddit.com/r/LogitechG/comments/gwmoa4/the_insides_of_your_logitech_powerplay_mousepad/\">the charging coil doesn’t cover the entire mousepad</a>, but I’ve never had to think about it, never come back to a dead mouse. It’s always sprung to life every morning at work and every evening I game. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/qj2XDwb5a8uouEdl8oq_ouD0saU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23360773/sean_hollister_20220401_123324.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Some users have DIY’d the Powerplay </em><a class=\"ql-link\" href=\"https://www.reddit.com/r/LogitechG/comments/ms6rap/powerplay_extended_v2/\" target=\"_blank\"><em>into larger mousepads</em></a><em>, but this is the only size Logitech sells.</em></figcaption>  </figure></div><p id=\"NmykGs\">It probably doesn’t hurt that I’m using it with the <a href=\"https://www.amazon.com/dp/B07L4BM851?ots=1&amp;slotNum=29&amp;imprToken=c4bff0fe-e370-4bfc-786&amp;ascsubtag=%5B%5Dvg%5Bp%5D21016234%5Bt%5Dw%5Br%5Dgoogle.com%5Bd%5DD&amp;th=1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Logitech G502 Lightspeed</a>, our pick for <a href=\"https://www.theverge.com/21252193/best-gaming-mouse\">the best wireless gaming mouse</a>, whose comfortable grip, loads of well-placed clicky buttons, incredible performance and adjustable weight put it head and shoulders over the also-excellent, also-wireless Razer Mamba and Logitech G900 I owned before. But that’s a $140 mouse, <a href=\"https://www.amazon.com/Logitech-Lightspeed-PowerPlay-Compatible-Lightsync/dp/B083C41BS4?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">and there’s no discount on a bundle with both</a>. Even the least expensive compatible mouse, the G703 Lightspeed, will typically cost you <a href=\"https://www.amazon.com/Logitech-Lightspeed-Lightsync-Compatible-Lightweight/dp/B07NSSPV9S?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$70 on sale</a> — and the Powerplay charging pad rarely goes on sale at all. </p><p id=\"jACFcZ\">But you could do what I did: get the mouse, use it until the battery bugs you, and then add Powerplay. (Find a generous brother-in-law while you’re at it, too.)</p><p id=\"2xkEkX\">That was kind of the idea, recalls Andrew Coonrad, who was technical marketing manager on Powerplay (and wrote the reviewer’s guide) back in 2017. It was designed to be the ultimate solution for demanding gamers willing to spend extra to solve charging once and for all. </p><p id=\"oQSxy1\">At the time, there was still a stigma against wireless gaming mice, and battery life was part of that — while the Razer Mamba and Logitech G900 convinced me that low-latency gaming was possible over wireless, neither could hold much of a charge after a couple years of use. With the G900, Coonrad says that’s because while its PMW3366 sensor was capable, it used an order of magnitude more energy than Logitech’s newer Hero sensors. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4dZbjETcxvUzauzUD9ZN4mBmedg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8026043/akrales_170221_1474_A_0027.0.jpg\">      <cite>Photo by Amelia Holowaty Krales / The Verge</cite>      <figcaption><em>The Logitech G900, with play-and-charge cable inserted.</em></figcaption>  </figure></div><p id=\"LevJYD\">While it was developing Hero, Logitech also looked at wireless charging — but at first, it didn’t like what it saw. Qi wireless charging meant keeping your mouse in a fixed spot. Same with wireless charging cradles like <a href=\"https://www.theverge.com/circuitbreaker/2019/9/30/20891001/hyperx-pulsefire-dart-wireless-mouse-qi-charging-chargeplay-base\">this HyperX</a>. Razer and Mad Catz <a href=\"https://www.theverge.com/circuitbreaker/2018/1/9/16867292/razer-wireless-charging-hyperflux-mamba-firefly-mouse-pad-ces-2018\">eventually put instant-charge supercapacitors</a> <a href=\"https://www.cnet.com/pictures/mad-catz-ces-2018-photos/\">in some ill-fated mice</a>, but that meant they stopped working if you removed them from their charging pads, and those pads and mice had to be sold as a pricy set. “We wanted to create a modular solution,” says Coonrad.</p><p id=\"fndWM2\">So Logitech charged its R&amp;D lab in Lausanne, Switzerland, with that idea, and they came up with a set of loop antennas that could slowly charge the mouse — think days, not hours — even while you’re moving it around. </p><div class=\"c-float-left c-float-hang\"><div id=\"tf15Ja\">    <blockquote class=\"reddit-card\" data-card-created='\"2022-04-01T18:44:16.916286+00:00\"'>      <a href=\"https://www.reddit.com/r/LogitechG/comments/gwmoa4/the_insides_of_your_logitech_powerplay_mousepad/?ref_source=embed&amp;ref=share\">The insides of your Logitech Powerplay mousepad</a> from      <a href=\"https://www.reddit.com/r/LogitechG/\">LogitechG</a>    </blockquote>    <script async=\"\" src=\"https://embed.redditmedia.com/widgets/platform.js\" charset=\"UTF-8\"></script></div></div><p id=\"fuwJoQ\">“I called it the dogbone when I first saw it,” says Coonrad, who took a trip to the R&amp;D facility during development. “They were like, ‘Yes, but it’s because of the way the concentric fields overlap that creates that hotspot in the middle.’ The entire pad can be covered because of those lobes.”</p><p id=\"uV7ooM\">“It’s basically just a giant modular, movable transformer,” he explains. “You have that smaller winding coil that transfers to the higher winding coil, and the field is wide enough that the energy charge is always more than the total energy of the mouse.” </p><p id=\"GhamW0\">According to <a href=\"https://fccid.io/JNZPR0001/\">an FCC filing</a>, it operates at 6.78MHz, the same as <a href=\"https://www.theverge.com/2013/12/12/5201954/theres-a-new-name-in-wireless-charging-rezence\">the old A4WP / Rezence standard</a> that fell by the wayside once Samsung and Apple gave Qi the nod instead. Coonrad wouldn’t say how much credit Logitech’s partners might deserve: for instance, both the charging pad and the transmitter circuit board are labeled LG Innotek, though it’s possible it just served as manufacturer. </p><p id=\"yn5D3B\">The other thing I find interesting about the Powerplay mousepad is that it’s not just a charger. It also doubles as the wireless receiver for the mouse, so you don’t need to leave the mouse dongle plugged into your PC anymore — I keep it inside the mouse for easy grab-and-go. The FCC filing shows there’s <a href=\"https://www.mouser.com/ProductDetail/STMicroelectronics/STM32L100RBT6A?qs=9MuLHSklicorOpgcQS6nMw%3D%3D\">a full 32MHz Arm Cortex-M3 computer</a> and a working Bluetooth antenna inside there — though Coonrad suspects the Bluetooth was never actually used. He says it’s not a functional part of the final product, and Logitech uses its own proprietary 2.4GHz “Lightspeed” wireless stack to connect to the mouse instead. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hu34UklGLvGFrij-n7HQ0dUgXsY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23361066/powerplay_chip_fcc.jpg\">      <cite>Image via FCC</cite>      <figcaption><em>The Arm chip inside the Logitech Powerplay’s receiver module.</em></figcaption>  </figure><p id=\"iMiKCV\">But, to me, the most unusual thing about the Powerplay system is how long it’s stuck around without fanfare — even the packaging hasn’t changed since 2017. Does this product actually sell? Coonrad says it does, that “people buy them like crazy,” and it helps that the compatible G502 Lightspeed, G Pro Wireless, and G Pro Wireless Superlight are becoming its most popular mice of all time. But he can’t share sales numbers. And he also admits that he doesn’t use them himself, but rather the smaller G305 that doesn’t have a space for a Powerplay puck. Instead of a wireless charging mousepad, he keeps a box of Energizers under his desk. “It pisses me off once every six to eight months.” </p><p id=\"TOdIXj\">By and large, gaming mouse battery life has significantly improved since 2017, with the recent G Pro X Superlight boasting 70 hours a charge, compared to 60 hours for the previous generation, which itself was double that of the generation before. Less feature-filled mice — like Coonrad’s G305 and mice from competitors — can easily cross the 200-hour mark now. </p><p id=\"8V7jAf\">Says Coonrad: “If this is so awesome, why isn’t Logitech making a bigger stink about it? The war on wireless is won.” </p><p class=\"c-end-para\" id=\"BPI6KF\">In 2022, you most definitely <em>do not </em>need to spend hundreds of dollars just to get a wireless mouse that doesn’t die every week. But it’s nowhere near as magical as never needing to charge at all.</p><p id=\"eJ2Aih\"></p><p id=\"PkPLwG\"></p><p id=\"pE55Cw\"></p><p id=\"u65b3v\"></p><p id=\"iqa8Pe\"></p><p id=\"ofSXJm\"></p><p id=\"OWuh22\"></p><p id=\"66X6O2\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VtW5L1AmcQIl5oNi-QMlkJgMPKo=/0x283:2040x1351/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/4336361/Apple_Magic_Mouse_Bad_Design_2.0.jpg",
  "description": "Powerplay is legit, and Apple should take notice.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}