{
  "title": "The Pixel Watch puzzle pieces are falling into place",
  "url": "https://www.theverge.com/2022/4/15/23026915/pixel-watch-wear-os-wearables-smartwatch",
  "date": "2022-04-15T20:12:54.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"The Fossil Gen 6 is a shame — good hardware undone by old software\" src=\"https://cdn.vox-cdn.com/thumbor/VFdhd6mMIJ_51pdyefCl_8GtheM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70754759/dbohn_211105_4864_0003.0.jpg\" />        <figcaption><em>This isn’t the Pixel Watch, but we may not have to wait too much longer.</em> | Photo by Dieter Bohn / The Verge</figcaption>    </figure>  <p id=\"QHbnPH\">After years of rumors and <a href=\"https://www.theverge.com/2019/9/18/20872740/google-pixel-smartwatch-flagship-why-it-failed-wear-os\">false starts</a>, it seems like we’re close to finally, <em>finally</em> seeing <a href=\"https://www.theverge.com/2021/12/2/22814461/google-pixel-watch-wear-os-2022-rohan\">a Pixel Watch running Wear OS</a>. </p><p id=\"I3joWY\">We’ve been hearing Pixel Watch rumors for the past few months, but what got me thinking about all this was a recent leak from Evan Blass. Earlier today, Blass posted <a href=\"https://twitter.com/evleaks/status/1514941722815610888\">a screenshot</a> on Twitter of an interactive tutorial teasing a “Pixel Rohan” running Wear OS 3.1. Blass also captioned the tweet by saying, “Won’t be long now” — a nod to the very likely possibility that Google will tease the Pixel Watch at next month’s Google I/O. </p><p id=\"LBA2lI\">Nothing about this is incredibly surprising if you’ve been paying attention. It was always likely the Pixel Watch would run Wear OS, though for a small while there was speculation Google might <a href=\"https://www.cnet.com/tech/mobile/googles-40m-purchase-of-fossil-tech-was-for-hybrid-smartwatches-report-says/\">opt for a digital-analog hybrid</a>. However, this relatively inconsequential leak solidifies that 2022 will be a watershed year for Google’s wearables ambitions. </p><div id=\"hB88Te\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Won't be long now. <a href=\"https://t.co/kIry1QdYNK\">pic.twitter.com/kIry1QdYNK</a></p>— Ev (@evleaks) <a href=\"https://twitter.com/evleaks/status/1514941722815610888?ref_src=twsrc%5Etfw\">April 15, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"YDklBV\">Essentially, this is the culmination of at least three years of Google laying the groundwork for a real Apple Watch competitor. In early 2019, Google shelled out <a href=\"https://www.theverge.com/2019/1/17/18187026/google-fossil-group-smartwatch-sale-40-million-wear-os-android\">$40 million to buy Fossil’s smartwatch tech</a> and a portion of the company’s research and development team. Fossil has long been one of Google’s most prominent wearable partners and, at the time, Google said the move was indicative of the company’s commitment to wearables. Later that year, Google emphasized <a href=\"https://www.cnbc.com/2019/10/15/google-ambient-computing-puts-its-services-everywhere.html\">a renewed focus on “ambient computing”</a> at its Made by Google event before closing out 2019 by plunking down <a href=\"https://www.theverge.com/2019/11/1/20943318/google-fitbit-acquisition-fitness-tracker-announcement\">$2.1 billion for Fitbit</a>. </p><p id=\"lEwc1h\">Not much happened on the Google wearable front in 2020. Fitbit continued to release products under the Fitbit brand — though its smartwatches <em>did</em> get Google Assistant. Likewise, Wear OS continued to see <a href=\"https://www.theverge.com/2020/8/13/21366514/google-wear-os-fall-update-smartwatch-faster-apps-weather-pairing\">incremental</a> <a href=\"https://www.theverge.com/2020/4/14/21221294/google-wear-os-smartwatches-reminders-wash-your-hands\">updates</a>. However, Google busted the door wide open in 2021 at I/O, announcing it was partnering with Samsung to create <a href=\"https://www.theverge.com/2021/5/18/22440483/samsung-smartwatch-google-wearos-tizen-watch\">a new unified version</a> of its long-stagnant Wear OS platform. The Samsung Galaxy Watch 4 lineup then debuted Wear OS 3 in late 2021. </p>  <figure class=\"e-image\">        <img alt=\"The Fossil Gen 6\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-E8DubxzhEGwwy_nshUbapnGSH0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22996109/dbohn_211105_4864_0001.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>Google’s been laying the groundwork for an in-house smartwatch since at least 2019.</em></figcaption>  </figure><p id=\"2Oq65q\">That brings us to 2022 — the first year where the new Wear OS platform will be available on more than just Samsung smartwatches. Google has said for the past year that existing Wear OS watches from Fossil and Mobvoi will be <a href=\"https://www.theverge.com/2021/7/22/22588440/google-wear-os-3-update-smartwatch-samsung-2022\">eligible to upgrade</a> in the second half of this year. Google has also been hinting at <a href=\"https://www.theverge.com/22733159/sundar-pichai-rick-osterloh-google-pixel-6-interview-podcast\">future Fitbit integrations</a> for some time now, and Fitbit CEO James Park has also stated multiple times that a Fitbit Wear OS watch is coming. (Though <a href=\"https://www.theverge.com/2022/3/25/22996549/fitbit-wear-os-smartwatch-fitness-tracker\">it’s hard to say when</a>.) Google also recently received <a href=\"https://www.theverge.com/2022/4/11/23020143/fitbit-google-fda-clearance-heart-rhythm-afib\">FDA clearance for passive atrial fibrillation monitoring</a> on Fitbit devices. Given that Google owns Fitbit, it’s not hard to imagine that it’ll also benefit from Fitbit’s years of research into advanced health tech features. Qualcomm — whose lackluster Snapdragon Wear chipsets have also contributed to Wear OS’s struggles to catch up to its competitors — is also expected to <a href=\"https://www.androidauthority.com/snapdragon-wear-5100-3114073/\">release a more potent chip</a> sometime this year. </p><p id=\"ZonIsd\">Basically, all the pieces are falling into place. Sure, there are still a lot of questions. Will the Pixel Watch primarily focus on fitness and wellness or will it also incorporate more smart features like LTE connectivity? Is this going to work equally well with all Android phones or will it prioritize Google’s own Pixel ecosystem? What about iOS? We likely won’t have these answers until the second half of this year. But one thing is for sure. This is a big year for Google’s wearable platform — and capping it off with a Pixel Watch would be a hell of a way to make a statement. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/i2LQI6kOwibpDU1mdM9clZMUFYE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22996111/dbohn_211105_4864_0003.jpg",
  "description": "Why 2022 is the perfect time for Google to launch a smartwatch.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}