{
  "title": "The world’s largest airline ticket-booking service cuts ties with Russia’s Aeroflot",
  "url": "https://www.theverge.com/2022/3/3/22959816/sabre-cuts-ties-aeroflot-russian-invasion-ukraine",
  "date": "2022-03-03T15:37:55.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/eo8KAj4wj5_RmGT1it8OKXmMZSg=/45x0:5136x3394/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70574199/1376620977.0.jpg\" />        <figcaption>Russia’s Aeroflot is losing its ticket-booking software provider. | Photo by Mario Tama/Getty Images</figcaption>    </figure>  <p id=\"WsS5Sq\">Sabre, one of the largest airline ticket booking companies in the world, is terminating its distribution agreement with Russian air carrier Aeroflot, <a href=\"https://www.sabre.com/insights/releases/sabre-terminates-distribution-agreement-with-aeroflot/\">the company announced</a> Thursday. The move could further restrict Russian air travel, which has already seen its planes banned from most Western countries’ airspace. </p><p id=\"311ryM\">State-owned Aeroflot is the flag carrier and the largest airline in the Russian Federation. The airline has about 200 aircraft in its fleet and travels to 146 destinations around the world. Being shut out of online booking software could make it difficult for the airline to operate domestically.  </p><p id=\"y3sOHQ\">Sabre said it is taking “immediate steps” to remove Aeroflot from its global distribution system, which is used by travel agencies, travel websites, and corporations around the world to shop, book, and service flight reservations.</p><div class=\"c-float-right\"><aside id=\"z38fn6\"><q>Sabre said it is taking “immediate steps” to remove Aeroflot from its global distribution system</q></aside></div><p id=\"ShWmtJ\">“Sabre has been monitoring the evolving situation in Ukraine with increasing concern. From the beginning, our primary focus has been the safety of our team members in the impacted region, as well as doing our part to support the much-needed relief efforts,” said Sean Menke, CEO of Sabre, in a statement. “We are taking a stand against this military conflict. We are complying, and will continue to comply, with sanctions imposed against Russia. In addition, today we announced that Sabre has terminated its distribution agreement with Aeroflot, removing its content from our GDS.” </p><p id=\"dAP3fQ\">Sabre is also donating $1 million to the Polish Red Cross to support relief efforts, as high numbers of Ukrainian refugees continue to stream across the border. </p><p id=\"gi9eFe\">The US, Canada, and European Union nations have joined together to <a href=\"https://www.npr.org/2022/03/02/1084101038/ban-of-russian-aircraft-from-u-s-airspace-has-gone-into-effect\">ban Russian planes from their airspace</a>. Russian President Vladimir Putin is expected to respond with a similar measure, prohibiting planes from those nations from his country’s airspace. Flights could take longer as they re-route around restricted airspace, but aviation experts say Russia is likely to bear the brunt of the closures. </p><p id=\"vcif4i\">Before the invasion, Aeroflot had routes into Miami, Los Angeles, New York, and Washington, DC, and had been flying over US and Canadian airspace to destinations in the Caribbean. Those flights to and from the US are now banned and Aeroflot will have to reroute flights to get to popular vacation destinations.</p><p id=\"FrT6qh\">Now that it’s cut off from Sabre’s reservation software, Aeroflot will have a much harder time operating domestic flights as well. There have been other repercussions too, with Airbus and Boeing announcing the suspension of parts and services to the Russian fleet, effectively cutting off maintenance support to Russian airlines.</p><p id=\"2Sdlus\">Russia’s airlines are not completely left out in the cold. Amadeus IT Group, which provides ticket-booking software for Russia’s S7 and Ural Airlines, has yet to say whether it will be following in Sabre’s path. A spokesperson for the company did not immediately respond to a request for comment. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0m5__P-W8FwEGnOL7gR_FJptxRA=/0x341:5179x3053/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285318/1376620977.jpg",
  "description": "Russia’s domestic air travel could be crippled as a result.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}