{
  "title": "The Overwatch 2 closed beta starts April 26th on PC only",
  "url": "https://www.theverge.com/2022/3/18/22984763/overwatch-2-beta-release-date-faq-activision-blizzard",
  "date": "2022-03-18T21:07:28.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"Overwatch 2\" src=\"https://cdn.vox-cdn.com/thumbor/5XH9_MwDa5WxwKnADKUxsTO_tcU=/125x0:1475x900/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70643443/OW2_Blizzcon_2019_Rio_IGC_Group_03.0.jpg\" />        <figcaption><em>Overwatch 2</em> | Image: Blizzard</figcaption>    </figure>  <p id=\"VnrChu\">Last week, Blizzard <a href=\"https://www.theverge.com/2022/3/10/22970734/blizzard-overwatch-2-closed-beta-alpha-annoucement-sojourn\">revealed plans to start <em>Overwatch 2</em> closed beta testing in April</a> and attempted to open the door for user sign-ups, but its registration page crashed almost immediately under the strain. Now the developers are talking more about what to expect from the new game and have announced a date for the start of beta testing: April 26th.</p><p id=\"kvddGk\">The <a href=\"https://www.theverge.com/2021/11/2/22760118/activision-blizzard-delays-overwatch-2-and-diablo-4-again\">delayed</a> development of this sequel is already occurring in the shadow of <a href=\"https://www.theverge.com/2021/7/28/22597113/activision-blizzard-california-sexual-harassment-lawsuit-discrimination-employee-action\">scandals</a>, <a href=\"https://www.theverge.com/2021/7/22/22588215/activision-blizzard-lawsuit-sexual-harassment-discrimination-pay\">lawsuits</a>, and <a href=\"https://www.theverge.com/2022/1/18/22889258/microsoft-activision-blizzard-xbox-acquisition-call-of-duty-overwatch\">Microsoft’s pending acquisition of Activision Blizzard</a>. So far, the team has been quiet about how things are progressing, but with a date for the beta test set and plans to <a href=\"https://www.theverge.com/2022/2/15/22935230/the-overwatch-league-opening-day-may-5\">start season five of the Overwatch League in May</a> using an early build of the new game, it appears that we’re going to hear and see a lot more about <em>Overwatch 2</em> very soon.</p><div class=\"c-float-left\"><div id=\"fFljHK\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Overwatch2?src=hash&amp;ref_src=twsrc%5Etfw\">#Overwatch2</a> PVP Beta is coming April 26.<br><br>✋  Beta Sign Up <a href=\"https://t.co/jC3gYjfdBc\">https://t.co/jC3gYjfdBc</a> <a href=\"https://t.co/FLVxCEtLZj\">pic.twitter.com/FLVxCEtLZj</a></p>— Overwatch (@PlayOverwatch) <a href=\"https://twitter.com/PlayOverwatch/status/1504906715053137931?ref_src=twsrc%5Etfw\">March 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"ELxX3O\">This should serve as a reminder for still-interested players <a href=\"https://playoverwatch.com/en-us/beta/\">to sign up</a> if they didn’t get the chance to, and <a href=\"https://playoverwatch.com/en-us/news/23788534/overwatch-2-pvp-beta-frequently-asked-questions/\">notice of this FAQ</a> that should answer several questions players have. The FAQ can tell you whether this start date will be available for console players (no — PC only for now, although there will be console betas in the future) and if you need to own a copy of <em>Overwatch 1</em> to participate (yes). </p><p id=\"nt1Z57\">Participants will be selected based on things like their region and the specs of their machine, with invites sent out via email. If you’re not selected (and not one of the journalists or influencers invited in), then stay tuned as Blizzard suggests other ways in will be announced, and that it could expand the test group once it’s sure matchmaking will remain stable.</p><p id=\"OOcfkZ\">It also reveals the minimum and recommended specs for participation, which have risen slightly from the specs listed for the first game. Generally, the <a href=\"https://us.battle.net/support/en/article/65159\">recommended specs for <em>Overwatch 1</em></a><em> </em>are now closer to the minimum listed specs for the <em>Overwatch 2</em> beta, which will ask that participants have at least an Nvidia GeForce GTX 600 series or AMD Radeon HD 7000 GPU and 6GB of RAM to target 30fps on minimum settings. The recommended specs to target 60fps on medium settings list a Core i7 or Ryzen 5 series CPU, GTX 1060 or AMD R9 380 graphics card, and 8GB of RAM.</p><p id=\"n9qPgH\">On <a href=\"https://www.twitch.tv/videos/1429493894?t=00h09m59s\">a Twitch livestream today</a>, the developers discussed reworking the game for 5v5 action with one tank instead of its predecessor’s 6v6 teams with two tanks and how they plan on addressing issues that caused players to dislike or even avoid taking over the vital role. There’s also some information about the new “ping” system players can use to communicate information and intended actions, and it sounds like each character’s voice lines may play a large part in delivering context about what’s going on, even if no one on your team is using their microphone. </p><p id=\"NYKMSA\">The launch of the beta will also allow players to finally use the long-awaited hero Sojourn, the <a href=\"https://www.theverge.com/2022/3/10/22970734/blizzard-overwatch-2-closed-beta-alpha-annoucement-sojourn\">first Black woman on the game’s roster</a>. Last week’s update also confirmed a new release strategy that will “decouple” PvP experiences from PvE content to get the competitive elements out sooner, although we still don’t know when (parts of) <em>Overwatch 2 </em>will be officially released.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OINgSpYmGjAcSivliTUmXuPUsx4=/0x31:1600x869/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23328115/OW2_Blizzcon_2019_Rio_IGC_Group_03.jpg",
  "description": "Overwatch 2 will expand its 5v5 testing next month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}