{
  "title": "The F-150 Lightning is finally shipping — is Ford ready?",
  "url": "https://www.theverge.com/2022/4/26/23042056/the-f-150-lightning-is-finally-shipping-is-ford-ready",
  "date": "2022-04-26T10:00:00.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"US-AUTOMOBILE-ENVIRONMENT-FORD\" src=\"https://cdn.vox-cdn.com/thumbor/XctsnntSz5jWS2T40g3ifcGZbck=/0x0:4000x2667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70793633/1232993924.0.jpg\" />        <figcaption><em>Ford CEO Jim Farley and the F-150 Lightning.</em> | Photo by JEFF KOWALSKY/AFP via Getty Images</figcaption>    </figure>  <p>Ford CEO Jim Farley knows there’s lots to improve as Ford turns into an EV company</p> <p class=\"p--has-dropcap p-large-text\" id=\"yA2uyM\">The first Ford F-150 Lightnings are rolling off assembly lines and heading to customers today after almost a year of anticipation. The company’s second EV after the successful Mustang Mach-E is in a category of one for the moment: the only full-size electric pickup truck available right now. (Rivian has sold around 2,000 of the well-reviewed R1T, but it slots somewhere between the compact Toyota Tacoma and full-size trucks like the F-150.) Full-size competitors from GM, Ram, and Tesla are all forthcoming, but the Lightning will have the market to itself for at least a year, and Ford CEO Jim Farley intends to take full advantage of that lead to steal customers away from his competitors. </p><p id=\"KeeX61\">“We should send every one to a customer who’s never bought a Ford before,” Farley tells me in a short interview last week. “My opinion is we should go for it.”</p><p id=\"PrTgqN\"><em>After</em> he ships out all 200,000 preorders, of course. Demand for the Lightning has been so strong that Ford’s invested $950 million into factory expansion, added 750 jobs, and doubled production, but some preorder customers will still be waiting until 2023 to get their trucks, and Ford’s website says no more 2022 Lightnings are available.</p><p id=\"d4jDSM\">The plant had built about 1,800 Lightnings when we spoke, and Farley says that while Ford will be “on plan” with its capacity goals, he simply laughs and says “no” when asked if production will meet demand anytime soon. There simply aren’t enough batteries to build Ford’s goal of 150,000 Lightnings a year. But even then, Farley says he’s confident that the battery plant in Georgia Ford operates in partnership with SK Battery will be able to scale up. “I think we’re in good shape for batteries, and that seems to be the biggest gating issue to get to 150,000 units,” he says.</p><div class=\"c-float-right\"><aside id=\"1Fb794\"><q>“I don’t see the chips as a constraint for Lightning”</q></aside></div><p id=\"8MExMS\">As for the rest, well, the Lightning is heavily based on the existing F-150, so there’s a lot of existing manufacturing capacity. “The seats and the instrument panel, that’s something we’ve been building for two years now,” Farley reminds me. It’s true even for chips, which have been in a perpetual worldwide shortage since the pandemic began. Ford makes around a million F-series trucks a year, which means it buys a lot of chips, and Farley has prioritized making sure the Lightning gets the chips it needs out of that supply. “I don’t see the chips as a constraint for Lightning,” says Farley. “I definitely see it as a constraint for our company. But we’re not going to produce 20 percent less Lightnings because we got 20 percent less chips for the F-series.”</p><p id=\"yhgRyg\">Farley says Ford will have to stay focused on preorders for six months to a year, but then he wants to aggressively market the Lightning to people shopping for other truck brands. Truck owners are famously loyal, of course, but Farley thinks having an actual EV truck people can buy will entice switchers. “If you’re offering something and it can be <em>bought</em>, that’s a pretty big advantage,” he says. “And if you have a year in the market essentially to yourself, you gotta get after it.”</p><p id=\"FLbe3h\">If things go well, Farley predicts Ford will run out of its 125,000 $7,500 EV tax credits sometime late this year or early next year. He’s lobbying for more. “I spend some high proportion of my day talking to legislators and leaders about the importance of helping our customers — any customers — transition to [EV] technology. China has done it. Europe has done it. It’s not even a Ford thing. If we want to be competitive as a country, if we want to attract EV investments from foreign companies here in the US, if we want to localize the raw material supply chain, we have to have consumer incentives.“</p><p class=\"p--has-dropcap\" id=\"uSALyy\">Ford’s first EV, the Mustang Mach-E, has been lauded by critics and buyers alike, but the experience of driving a Mach-E is severely hampered by the charging network, which lags behind Tesla’s superlative Supercharger network. “We have lots of scars to show,” when it comes to charging, Farley says. Ford has touted itself as having the largest charging network, “but it’s not really helpful that it’s the biggest if half the chargers don’t work,” says Farley. “Or if you show up, and you need a fast charger, and it’s not a fast charger — that’s not going to work.”</p><p id=\"jBwdW2\">The Lightning will ship with a new charging-locator map that identifies fast chargers and allows users to report broken or malfunctioning charging stations. “We’ve done a lot of benchmarking of our competitors’ algorithms to find a charger and there are others that were better than us,” says Farley. “It was very impressive to see what Hyundai did for their Ioniq 5.”</p><div class=\"c-float-right\"><aside id=\"mxFN93\"><q>“I would give ourselves a C-plus” on charging, says Farley. “The number of fast chargers is just going to take time.”</q></aside></div><p id=\"elsukK\">Ford’s main internal metric for the quality of its charging network — introduced by new EV boss Doug Field — is “successful charge,” which is simply a measure of how often drivers pull up to a charger, complete a charge, and drive away. It’s easily measurable, and it doesn’t require drivers to report anything. The data reveals there’s a lot of work left to be done.</p><p id=\"GlZdrC\">“I would give ourselves a C-plus,” on successful charging, says Farley. “The number of fast chargers is just going to take time. This will be like brushing our teeth — we’re never going to be done with this.”</p><p id=\"60lwIT\">That new charger-locator interface will eventually come to the Mustang Mach-E, which is due for a major software update later this year that will refresh the entire interface displayed on the screens in the car. Farley likens it to an iPhone update, saying “the whole UX is going to change.” Farley has set ambitious goals for OTA software updates in the future, part of Farley’s push to rethink cars as “digital vehicles,” but it’s off to a slow start. “We’re still not shipping enough software to the car,” he says. Field, coming off stints from Apple and Tesla, has begun to improve things.</p><p id=\"o3z0Ue\">“We had some difficulties with BlueCruise when Doug got here,” Farley says, discussing Ford’s Level 2 driver-assistance system, which was released as a software update for vehicles that had the right hardware. “We had designed the over-the-air update for BlueCruise in three different tranches, and that just was not going to work. So we’ve simplified it down. We’re getting a lot of BlueCruise downloads now.”</p><p class=\"p--has-dropcap\" id=\"6UY9ng\">Of course, the biggest software change of all will come when Ford’s collaboration with Google on an entirely new Android-based Sync infotainment stack that has Google Maps and other services arrives next year. Ford has said “millions” of vehicles will run this new version of Sync by 2023, but Farley says it’s running behind schedule by “months.” </p><div class=\"c-float-right\"><aside id=\"PXP1Ji\"><q>Ford’s new Android-based Sync system will be delayed to later in 2023, and current cars won’t be upgradable</q></aside></div><p id=\"el5pCy\">“We’re making a lot of progress. I’m very impressed with the team that Google has put in place,” Farley says. “They’ve been very accommodating — you can imagine that we don’t want a generic solution for the instrument panel for Mustang. We want, like, line lock to do a burnout. But it is slightly delayed, so that’ll be later in the fall.”</p><p id=\"mo0V5S\">Current Ford vehicles will not be upgradable to the new Android-based Sync — which means these first Lightnings off the line will have Ford’s existing Sync 4 system, while 2023 Lightnings that ship next year will have the new Android-based Sync, a potential silver lining for impatient preorder buyers.</p>  <figure class=\"e-image\">        <img alt=\"The F-150 Lightning\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/00ehwDI803Ebm7bCdloPJhoXTmA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23416252/1236650037.jpg\">      <cite>Photo by FREDERIC J. BROWN/AFP via Getty Images</cite>  </figure><p class=\"p--has-dropcap\" id=\"mhSeMt\">Farley recently reorganized Ford into two divisions: Ford Blue, which makes traditional cars, and Ford Model E, led by Field, which will make EVs. Farley says the Lightning is just the first of a “portfolio of trucks,” and that Field and his team have the freedom to invent radically new vehicles to compete against Tesla and others. “We are not going to serve the entire market with just one product,” says Farley. “Our strategy is definitely to electrify our icons” like the Mustang and F-150. “But just because we’re electrifying our icons doesn’t mean we’re going to be kind of rote in approaching that.” So don’t expect a Ranger Lightning or a Maverick Lightning — even if an EV Maverick seems like a great idea.</p><p id=\"BehVwD\">The goal, in the end, is to allow the Model E team to build new kinds of EVs that compete directly with Ford’s existing vehicles and let the chips fall where they may. Asked if he’s ready to mediate disputes between Ford’s huge traditional car business and his upstart EV division, Farley laughs.</p><p class=\"c-end-para\" id=\"u6lwu0\">“I think if we do our job right, I’ll be worrying about that for the rest of my career.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qXV7Adh_8CH3p3XpFu-zJxd16JQ=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23416244/1232993924.jpg",
  "description": "Ford CEO Jim Farley knows there’s lots to improve as Ford turns into an EV company.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}