{
  "title": "The Verge Partners with Vox Media Studios and 21 Laps on New Netflix Series",
  "url": "https://www.theverge.com/2022/5/4/23056898/the-verge-partners-with-vox-media-studios-and-21-laps-on-new-netflix-series",
  "date": "2022-05-04T15:52:21.000Z",
  "author": "aude.white",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OJv-VG4FBXU_2YInTF9cRy52gzc=/548x0:3788x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70831510/TFO_Title.0.jpg\" />    </figure>  <p id=\"7FT8Pn\">Netflix is set to release <em>The Future Of...</em>, a new documentary series produced by The Verge, 21 Laps Entertainment <em>(Unsolved Mysteries</em>), and Vox Media Studios (<em>Explained</em>). The series will be released globally in two batches - with the first six episodes on Tuesday, June 21, and the remaining six episodes on Tuesday, June 28, 2022.</p><p id=\"Jh5Mrk\"><strong>Logline: </strong>What if we could look into the future to see how every aspect of our daily lives – from raising pets and house plants to what we eat and how we date – will be impacted by technology? We can, and should, expect more from the future than the dystopia promised in current science fiction. The Future Of… will reveal surprising and personal predictions about the rest of our lives — and the lives of generations to come.</p><ul><li id=\"OC7eU3\"><strong>Josh Barry,  21 Laps Entertainment:</strong>  “From the first meeting where Chad Mumm and I started conceptualizing this idea, we knew that sharing an optimistic view of the future was something that 21 Laps, The Verge, and VMS could craft into innovative stories for Netflix.  We look forward to sharing the ideas and technology that the series explores as a hopeful and innovative look at the future.” </li><li id=\"45OJDO\"><strong>Nilay Patel, The Verge</strong>: “The Verge is all about how science and technology make us feel, and <em>The Future Of </em>is an ambitious exploration into how innovation could radically transform the experience of everything from cheeseburgers to falling in love – and how all of us can shape what kinds of futures we can build together.” </li><li id=\"YYDzSj\"><strong>Chad Mumm, Vox Media Studios</strong>: “We are thrilled to be expanding our relationship with Netflix and collaborating with The Verge and 21 Laps. “The Future Of…” is a great example of how we work with our award-winning editorial networks to create new and compelling series for today’s audience. </li></ul><p id=\"jQgfwC\"><em>The Future Of…</em> is executive produced by Nilay Patel and Eleanor Donovan for The Verge, Josh Barry and Shawn Levy for 21 Laps Entertainment, and Chad Mumm, Mark W. Olsen, Max Heckman, Michael John Warren, and Chris Grosso for Vox Media Studios. </p><p id=\"FUSKTj\"><strong>ABOUT THE VERGE</strong></p><p id=\"Yj52Uu\">The Verge is an ambitious multimedia effort founded in 2011 to examine how technology will change life in the future for a massive mainstream audience. Our original editorial insight was that technology had migrated from the far fringes of the culture to the absolute center as mobile technology created a new generation of digital consumers. Now, we live in a dazzling world of screens that has ushered in revolutions in media, transportation, and science. The future is arriving faster than ever, and The Verge brings you what’s next. </p><p id=\"A19pyt\"><strong>ABOUT 21 LAPS ENTERTAINMENT</strong></p><p id=\"lN3CBe\">21 Laps Entertainment is a film and television production company founded in 2005 by director-producer Shawn Levy, producing content in multiple genres and collaborating with some of the most distinguished filmmakers in the industry. </p><p id=\"jSC9gR\">21 Laps’ recent projects include the Levy directed films Free Guy, the top grossing original IP/original concept film of last year and The Adam Project, already the #4 watched film on Netflix of all time.   The company is currently in production on the series “All the Light We Cannot See” which Levy is directing.  Upcoming projects at Netflix include the upcoming fourth season of “Stranger Things,” volume three of “Unsolved Mysteries,” and the second season of “Shadow and Bone.”  Additionally, Rosaline for Hulu is in post-production and Crater and an animated version of Night at the Museum are both launching this year on Disney+.  A sequel to Free Guy and Dead Pool 3 are also in the works with Levy directing both. </p><p id=\"vmJhSk\"><strong>ABOUT VOX MEDIA STUDIOS </strong></p><p id=\"3uqXxk\">Vox Media Studios is a modern studio producing premium unscripted, documentary, and scripted programming for television, film, OTT, podcasts, and brand partners for today’s global audience. As an Emmy and Academy Award-winning full-service production studio, it works both independently and in partnership with Vox Media’s category-leading networks—including New York Magazine, The Verge, Eater, Vox, NowThis, and The Dodo—to extend the company’s storytelling capabilities to the most relevant platforms including HBO, Netflix, Hulu, Apple TV+, Discovery+, Disney+, YouTube Originals, and Freeform. Vox Media Studios is also home to the award-winning Vox Media Podcast Network and Epic, the Academy Award-winning powerhouse producing extraordinary true stories.</p><p id=\"KOoNLp\"> </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Wt4ojNAeuYm4WwNDyu5NSHbvjzg=/0x95:3840x2105/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23437566/TFO_Title.jpg",
  "description": "Out this summer, ‘The Future Of...’ will explore the many ways in which our lives will be impacted by technology.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}