{
  "title": "The first trailer for The Lord of the Rings: The Rings of Power debuts at the Super Bowl",
  "url": "https://www.theverge.com/2022/2/13/22923339/lord-of-the-rings-trailer-super-bowl-amazon",
  "date": "2022-02-14T01:46:57.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IZAGODEs53tcENj916bvdk4WbnE=/647x0:2714x1378/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70505638/Screen_Shot_2022_02_13_at_8.44.38_PM.0.png\" />    </figure>  <p id=\"UWYVah\">It’s time to return to Middle Earth: the first trailer for Amazon’s incredibly ambitious <em>The Lord of the Rings: The Rings of Power</em> <a href=\"https://twitter.com/JeffBezos/status/1493037596796022787\">has finally arrived</a> during the Super Bowl LVI, giving a first good look at the upcoming prequel series. </p><p id=\"xQnZ2y\">The trailer reveal comes after a steady stream of teasers for the upcoming series, which will be set hundreds of years before the events of <em>The Hobbit</em> or <em>The Lord of the Rings</em> in what Tolkien referred to as “The Second Age” of Middle Earth (as opposed to his more popular books and their film adaptations, which take place during the Third Age.) </p><p id=\"lb3Cw7\">Amazon’s series will be condensing some of Tolkien’s timeline from <em>The Silmarilion</em>, which spans thousands of years and documents key events in the history of Middle Earth like the fall of Númenor, the rise of Sauron, and — of course — the forging of the legendary (and titular) rings of power. </p><div class=\"c-float-right\"><aside id=\"TNdAkZ\"><q>One ring to rule them all</q></aside></div><p id=\"UJGx2Z\"><em>The Rings of Power </em>will feature a massive ensemble cast, too, with both familiar characters to Lord of the Rings fans, like Elrond (Robert Aramayo), Galadriel (Morfydd Clark) and the human warrior Isildur (Maxim Baldry). The show also stars Cynthia Addai-Robinson, Owain Arthur, Nazanin Boniadi, Ismael Cruz Córdova, Charles Edwards, Trystan Gravelle, Sir Lenny Henry, Ema Horvath, Markella Kavenagh, Joseph Mawle, Tyroe Muhafidin, Sophia Nomvete, Lloyd Owen, Megan Richards, Dylan Smith, Charlie Vickers, Leon Wadham, Benjamin Walker, Daniel Weyman, and Sara Zwangobani.</p><p id=\"BXzLQL\">Amazon is also spending some <em>serious</em> cash to try and turn The Lord of the Rings: The Rings of Power into the next big fantasy hit: <a href=\"https://www.vanityfair.com/hollywood/2022/02/amazon-the-rings-of-power-series-first-look\">according to <em>Vanity Fair</em></a>, the company spent a whopping $250 million on the rights for the adaptation alone, on top of the staggering $462 million that the company is said to have spent on just making the first season.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tcngi-JqW6QOnisA-9qPdPbBFlE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23239871/Screen_Shot_2022_02_13_at_8.44.51_PM.png\">  </figure><p id=\"S1NCuF\">The first season of <em>The Lord of the Rings: The Rings of Power</em> is set to debut on Amazon Prime Video on September 2nd. </p><div id=\"OGFDHg\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">LOTR Super Bowl teaser... <a href=\"https://t.co/YgZ2o4rwCB\">pic.twitter.com/YgZ2o4rwCB</a></p>— Jeff Bezos (@JeffBezos) <a href=\"https://twitter.com/JeffBezos/status/1493037596796022787?ref_src=twsrc%5Etfw\">February 14, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/bsGgR6QUD-LDkJ7d1kCSJLRkSp4=/364x0:2996x1378/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23239870/Screen_Shot_2022_02_13_at_8.44.38_PM.png",
  "description": "Get a first look at Amazon’s Lord of the Rings prequel show",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}