{
  "title": "The EU accelerates plans to phase out Russian gas",
  "url": "https://www.theverge.com/2022/3/8/22967244/european-union-russia-clean-energy-transition-gas",
  "date": "2022-03-08T23:09:59.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Natural Gas Prices Continue To Climb\" src=\"https://cdn.vox-cdn.com/thumbor/S0TNY1iHCnAKNZNWJUfwnHdxkyk=/0x2:8192x5463/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70596574/1351095369.0.jpg\" />        <figcaption>Exhaust rises from a chimney of the Heizkraftwerk Lichterfelde natural gas-fired power and heating plant stands on November 03, 2021 in Berlin, Germany.&nbsp; | Photo by Sean Gallup/Getty Images</figcaption>    </figure>  <p id=\"5401XX\">The European Union announced new <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_1511\">plans</a> today to swiftly shrink its reliance on Russian gas and accelerate its transition to clean energy.<strong> </strong>Russia’s brutal invasion of Ukraine and continued threats to further squeeze Europe’s gas and oil supplies have made clean energy an even more critical priority. </p><p id=\"TpLzgL\">“It is time we tackle our vulnerabilities and rapidly become more independent in our energy choices. Let’s dash into renewable energy at lightning speed,” European Commission Executive Vice President Frans Timmermans said in a March 8th <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_1511\">statement</a>.</p><p id=\"yx2dpn\">Over the next<strong> </strong>year, the European Commission says it can drastically cut its gas use by changing how it heats homes and powers buildings.<strong> </strong>Russian gas accounted for <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/qanda_22_1512\">nearly</a><a href=\"https://ec.europa.eu/commission/presscorner/detail/en/fs_22_1513\"> half</a> of the bloc’s gas supply last year. That’ll shrink down to zero “well before” the end of the decade, if the European Commission follows through on goals set out today. </p><div class=\"c-float-right\"><aside id=\"71fEO7\"><q>Phasing out gas will trigger makeovers in homes, buildings, and the power sector</q></aside></div><p id=\"WvrYlG\">Eventually phasing out gas will trigger makeovers in homes, buildings, and the power sector. Those changes were already on the way, thanks to Europe’s plans to tackle climate change. Things just have to happen much faster now. </p><p id=\"IWqmmp\">“A lot of the blockers for further reduction in fossil fuel dependence will be much easier to remove,” Charles Moore, European programme lead at energy think tank Ember, told <em>The Verge </em>in an interview in advance of the European Commission’s new announcements. “There’s nothing like a really terrifying crisis to unwind that inertia.” </p><p id=\"Fbgv0w\">A painful <a href=\"https://www.bloomberg.com/news/articles/2022-01-04/europe-s-energy-supply-crisis-has-the-eu-at-the-mercy-of-putin-and-the-weather\">gas shortage</a> had already driven heating and energy prices up across the continent over the past year. Much of that was triggered by a steep rise in gas demand as economies emerged from pandemic-induced shutdowns, although other <a href=\"https://www.nytimes.com/2021/10/14/business/energy-environment/britain-europe-energy-gas-shortage.html\">factors</a> have contributed to the crisis. Russian President Vladimir<strong> </strong>Putin’s hostility has made things even more volatile. Just today, Russian officials <a href=\"https://www.cnbc.com/2022/03/08/russia-warns-of-300-oil-if-ban-goes-ahead-threatens-to-cut-off-european-gas.html\">threatened</a> to shut down a major pipeline that brings gas from Russia to Germany in response to heightened sanctions from the West. </p><p id=\"e2i1we\">“We must become independent from Russian oil, coal and gas. We simply cannot rely on a supplier who explicitly threatens us,” European Commission President Ursula von der Leyen said in a <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_1511\">statement</a> today.</p><div class=\"c-float-left\"><aside id=\"QHuLSh\"><q>“We simply cannot rely on a supplier who explicitly threatens us.”</q></aside></div><p id=\"Gksj2R\">The European Commission’s new plan includes speeding up permitting for renewable energy projects. It also wants to ramp up deployment of rooftop solar panels this year. To power heavy industry, it wants to replace Russian gas with hydrogen fuel made with renewable energy. It envisions a “Hydrogen Accelerator” to encourage more storage, port, and transport infrastructure for the fuel. The European Commission also wants to double the bloc’s production of biomethane made from waste by 2030. </p><p id=\"UUD3XG\">Another key pillar of the EU’s plan is boosting energy efficiency. Renovating homes and buildings so that they use less energy is one of the easiest things Europe can do to reduce its gas consumption. And while winter is winding down, Europe needs to start getting ready for the next one — ostensibly without relying on as much Russian gas for heating. Replacing gas heating with more efficient electric heat pumps is another top priority between now and next winter, experts tell <em>The Verge</em>. The European Commission now plans to get 10 million heat pumps out to residents over the next five years.</p><p id=\"kDVuUl\">While the European Union made plans to wean itself off its dependency on fossil fuels from Russia in the long-term, the US today imposed an immediate <a href=\"https://www.whitehouse.gov/briefing-room/press-briefings/2022/03/08/background-press-call-on-announcement-of-u-s-ban-on-imports-of-russian-oil-liquefied-natural-gas-and-coal/\">ban</a> on Russian energy imports. As the world’s leading oil and gas producer, the US is far less reliant on Russian fuel. </p><p id=\"g09efd\">“We can take this step when others cannot,” US President Joe<strong> </strong>Biden <a href=\"https://www.whitehouse.gov/briefing-room/speeches-remarks/2022/03/08/remarks-by-president-biden-announcing-u-s-ban-on-imports-of-russian-oil-liquefied-natural-gas-and-coal/\">said</a> at a press conference today. “But we’re working closely with Europe and our partners to develop a long term strategy to reduce their dependence on Russian energy as well.” </p><p id=\"G44NDf\">The US has already <a href=\"https://www.eia.gov/todayinenergy/detail.php?id=51358\">boosted</a> its exports of liquified natural gas to Europe in recent months. And the EU today said that, for now, it will rely more on imports from the US and places outside of Russia to replenish dwindling gas stores. The commission wants gas storage filled to 90 percent of capacity by October in preparation for winter heating demand. </p><p id=\"QIsqsZ\">But there are concerns that turning to new places for gas could prolong Europe’s reliance on the fossil fuel. Germany, for example, recently decided to build <a href=\"https://www.wsj.com/livecoverage/russia-ukraine-latest-news-2022-03-04/card/germany-goes-ahead-with-first-lng-terminal-to-cut-dependence-on-russian-gas-EfKaIozflVs7b1lXX6fY\">new terminals</a> to import liquified natural gas.  </p><p id=\"NumKkx\">When it comes to the power sector, gas-fired power plants currently fill in<strong> </strong>gaps in Europe’s growing<strong> </strong>wind and solar energy capacity. Renewables are increasingly cheap and abundant, but customers need a source of power when winds calm and sunshine fades. Historically, fossil fuels and nuclear power plants have made up for that intermittency while utility-scale batteries and other crucial forms of energy storage are still under development. But with Russian gas off the table, Europe faces two controversial options as it builds out more renewable energy: nuclear and coal. </p><div class=\"c-float-right\"><aside id=\"XCEp0i\"><q>Europe faces two controversial options as it builds out more renewable energy: nuclear and coal</q></aside></div><p id=\"5oRXxJ\">The debate over what role nuclear energy will play in the world’s clean energy transition was already <a href=\"https://www.theverge.com/2022/2/2/22914195/eu-nuclear-energy-gas-sustainable-climate-investment\">heating up</a> before Russia invaded Ukraine. It’s even more complicated now. Last week, the International Energy Agency proposed maximizing power generation from nuclear power plants as part of a <a href=\"https://www.iea.org/news/how-europe-can-cut-natural-gas-imports-from-russia-significantly-within-a-year\">10-point plan</a> for slashing Europe’s gas imports from Russia. <a href=\"https://www.reuters.com./world/belgian-greens-make-u-turn-consider-nuclear-plants-extension-2022-03-07/\">Belgian</a> and <a href=\"https://www.reuters.com/business/energy/could-germany-keep-its-nuclear-plants-running-2022-02-28/\">German</a> officials have similarly mulled over extending their countries’ nuclear programs over the past week.</p><p id=\"MfHGQ2\">But Germany did an <a href=\"https://www.reuters.com/world/europe/german-ministries-say-cannot-recommend-extending-nuclear-plants-lifetime-2022-03-08/\">about-face</a> again today, with officials shooting down the possibility of keeping the country’s few remaining power plants open beyond their previously planned shutdowns this year. Germany had planned to retire them over concerns about safety and radioactive waste. Russia’s apparent attack on Ukraine’s largest nuclear power plant last week <a href=\"https://www.theverge.com/2022/3/4/22960816/ukraine-nuclear-power-plant-fire-russia-zaporizhzhia\">raised fears</a> of radioactive materials being released.</p><p id=\"kYdbUQ\">In the absence of nuclear power and gas, more polluting coal-fired plants could find a lifeline. Power generation from coal in the EU has <a href=\"https://ember-climate.org/wp-content/uploads/2021/01/Report-European-Power-Sector-in-2020.pdf\">dropped</a> in half since 2015. Cheap renewables and gas drove that trend, but soaring gas prices now make coal more attractive again.<strong> </strong> </p><p id=\"Xo2nOu\">“There’s definitely a risk of higher emissions in the short-term,” Moore says. But he still sees Europe’s future in clean energy.</p><p id=\"Ij7yyc\">Whatever happens next, Europe is about to undergo big changes. “In the course of weeks and days, European history has been changed,” Timmermans said in a <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_1616\">statement</a> yesterday on the war in Ukraine’s impact on energy and environmental policy. “Europe will never be the way it was before.”</p><p id=\"xsMKzC\"></p><p id=\"5uwBCm\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/u_ZGdA2t4hzum02dsWobV5kgpSo=/0x588:8192x4877/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23299002/1351095369.jpg",
  "description": "That’ll change how Europe heats homes and powers businesses.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}