{
  "title": "The Mac Studio’s removable SSD is reportedly blocked by Apple on a software level",
  "url": "https://www.theverge.com/2022/3/21/22989226/apple-mac-studios-removable-ssd-blocked-software-replacement",
  "date": "2022-03-21T21:59:58.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"The Mac Studio on a black surface seen from above.\" src=\"https://cdn.vox-cdn.com/thumbor/bgc0lZmly7XhYEQTd4shKTB2r2w=/0x1:2040x1361/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70654218/bfarsace_171212_5072_0090.0.jpg\" />        <figcaption>Photo by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"wbOlSF\">Apple’s new Mac Studio was revealed to have an interesting secret over the weekend: it has <a href=\"https://www.theverge.com/2022/3/19/22986705/mac-studio-teardown-potentially-upgradeable-ssd-storage-apple\">removable SSD storage</a>. But a subsequent video from <a href=\"https://youtu.be/xEwS_VGD2yY\">YouTuber Luke Miani</a> reveals that the Mac Studio still can’t be upgraded: not because of hardware limitations, but because Apple appears to be blocking replacement SSDs on a software level, <a href=\"https://appletrack.com/the-mac-studios-upgradability-has-been-locked-in-software/\">via <em>AppleTrack</em></a>. </p><p id=\"ndWdX5\">Unlike all of Apple’s other M1-powered computers, the Mac Studio’s storage isn’t soldered onto the mainboard, as <a href=\"https://youtu.be/IY0gRMpT4AY\">Max Tech’s teardown</a> over the weekend discovered. Getting to the SSD is a tricky business, involving removing the rubber ring on the bottom of the device, unscrewing the panel, and pulling out the unshielded power supply. But as it turns out, those expandable SSD hardware slots are for naught: even if you <em>can</em> take apart your Mac Studio to get to it, Apple appears to be blocking any additional or swapped storage on a software level. </p><aside id=\"NmZOXE\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Mac Studio teardown reveals potentially upgradeable SSD storage\",\"url\":\"https://www.theverge.com/2022/3/19/22986705/mac-studio-teardown-potentially-upgradeable-ssd-storage-apple\"}]}'></div></aside><p id=\"KbmvbK\">Which ultimately means that no, you won’t be able to escape Apple’s heinously expensive SSD upsells for extra storage, even if you are willing to disassemble your entire computer to do so. </p><p id=\"ZVxOue\">That tracks with Apple’s official line: “Mac Studio storage is not user accessible,” the company notes on the Mac Studio’s product page. “If you think you may need more storage capacity in the future, consider configuring to a higher capacity.”</p><p id=\"CoP4w6\">But my issue here is not necessarily that the Mac Studio as it exists right now isn’t user-upgradeable. It’s with the philosophy that Apple has taken to get to this point.</p><div id=\"KLfuHk\"><div ><iframe src=\"https://www.youtube.com/embed/xEwS_VGD2yY?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"ZKcFGM\">Because the Mac Studio <em>does</em> have removable SSDs. Nothing about Apple’s design here necessitates the choice to bury it behind rubber sheets and a potentially dangerous power supply or to lock it on a software level. </p><p id=\"z0kLtj\">But Apple made an active choice to make it impossible to upgrade the Mac Studio’s internal storage. Whether it was hoping to discourage end users from tearing apart their computers in search of cheaper SSD upgrades or because it wants to nudge customers into its pricier options (which, due to their non-replaceable nature, implicitly urge you to buy more upfront, lest they be caught with too little after the fact) — both options don’t reflect well on the company.</p><p id=\"wKgsQs\">It’s true that the Mac Studio makes it exceedingly difficult for customers to get to the SSD slots in the first place, but that’s <em>also </em>a choice Apple made. This isn’t a laptop or a tablet or even an ultra-slim all-in-one like the M1 iMac. It’s a desktop computer, one that presumably could have offered more expandable storage at the expense of a slightly bigger chassis. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CPZplpuYMpPNliVI2OpPQdldF3o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23335248/Screen_Shot_2022_03_21_at_5.28.47_PM.png\">      <cite>Image: <a class=\"ql-link\" href=\"https://www.youtube.com/watch?v=xEwS_VGD2yY\" target=\"_blank\">Luke Miani</a></cite>      <figcaption>The Mac Studio’s removable SSD</figcaption>  </figure><p id=\"Cb0Kif\">Nor can Apple make the argument it has for things like the unified memory, which offers tangible benefits by not offering a user-replaceable component: the SSDs here are <em>already</em> removable. Apple is just preventing Studio owners from doing it themselves. </p><p id=\"HJkhiO\">We know Apple can do this, too: it already does for the <a href=\"https://www.theverge.com/2020/3/2/21161358/mac-pro-review-apple-display-xdr-adobe-hardware-software-price-video\">2019 Mac Pro</a>, which it happily sells new SSDs for users to slot in at their own leisure. (Hopefully, a trend it will continue to follow with the Apple Silicon-powered Mac Pro it teased is coming in the future, too.)</p><p id=\"QhAYZI\">But the choice to limit the Mac Studio so much here is ultimately a shame. It is a professional-grade machine, and it’d be nice to see Apple treat it like it instead of locking into the same pre-built box that so many of the company’s other recent computers have done. And you shouldn’t need to drop $5,999 on a Mac Pro just to be able to upgrade the storage on your desktop computer in 2022. </p><p id=\"0erfS5\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hcjvsQwcgB25XNNxpYrMoHRU31Q=/0x147:2040x1215/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23320968/bfarsace_171212_5072_0090.jpg",
  "description": "No SSD swaps today",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}