{
  "title": "The looming demise of Roe ties healthcare even more firmly to employers  ",
  "url": "https://www.theverge.com/2022/5/5/23058911/abortion-access-employers-amazon-supreme-court-roe",
  "date": "2022-05-05T19:12:44.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/V66ju2j1_J2MuKB7wuR7T_qD6UA=/3x0:1017x676/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70836749/amazon-box-logo-stock-4_1020.0.0.jpg\" />    </figure>  <p id=\"yFL8qm\">Even before a leaked Supreme Court opinion threw the future of abortion in the United States into turmoil, major corporations were adding a new benefit for their employees: coverage for abortion and other medical travel. </p><p id=\"Vb248f\">The <a href=\"https://www.cnn.com/2022/05/03/business/amazon-abortion-costs/index.html\">latest company</a> to add the benefit was Amazon, which announced earlier this week that it will cover travel costs for employees who have to travel out of state for abortions or other medical procedures. This could make it possible for workers living in states that make abortion illegal to still get the care they need. It’s a potential lifeline for employees — especially if the Supreme Court decides to overturn Roe v. Wade, eliminating the right to an abortion in the United States and allowing states to criminalize the safe and lifesaving medical procedure. </p><p id=\"DCkLFk\">Employers stepping in to offer that lifeline marks a continuation of a healthcare norm in the US, where the quality of care that people can access is tightly bound to their insurance, which is often linked with employment. As legal protections roll back, employers are the fallback — and each can make or change their own policies at will, making coverage of key services even more uneven throughout the country. </p><div class=\"c-float-right\"><aside id=\"LY9ENA\"><q>“We don’t have a fundamental right to healthcare”</q></aside></div><p id=\"vM6Kj9\">“We don’t have a fundamental right to healthcare,” says Liz Brown, a professor studying business and gender law at Bentley University. “A parallel development of that is that so many Americans get their healthcare from their employer, which creates all kinds of perverse incentives.”</p><p id=\"3c2yw2\">Companies like Citigroup, Match Group, and Yelp started adding abortion travel as a benefit over the past few years as states like Texas started passing laws severely restriction abortion. The option gave employees at those companies who lived in those states an escape valve, one that could be even more impactful in a post-Roe landscape. But taking advantage of that option would mean that they would have to disclose an abortion — an often sensitive, private medical procedure — to their employer. </p><p id=\"muks83\">“It is almost impossible for me to see how an employee could keep that private,” Brown says. </p><p id=\"uIZP6N\">Employees likely couldn’t face overt repercussions for disclosing that information — the federal Pregnancy Discrimination Act <a href=\"https://www.eeoc.gov/laws/guidance/enforcement-guidance-pregnancy-discrimination-and-related-issues#IA4c\">protects people</a> from being fired for thinking about or deciding to have an abortion. But even with that formal protection, people might be (reasonably) uncomfortable telling bosses about a deeply personal and often-stigmatized health situation. They might worry about being treated differently, even if they wouldn’t be explicitly fired or penalized. “The big question is, will people feel like this is a benefit they can use,” says Anna Kirkland, a women’s and gender studies professor studying health and law at the University of Michigan. </p><p id=\"8r6X2u\">In some ways, the shift puts abortion in line with employer programs that offer mental health services or subscriptions to <a href=\"https://www.theverge.com/2022/5/4/22985296/mental-health-app-privacy-policies-happify-cerebral-betterhealth-7cups\">digital mental health programs</a> — another potentially sensitive type of care that can be hard to access. </p><p id=\"VT1aZd\">“The more services you get from your employer, the more potentially your employer can find out about and make decisions about you based on the health services you receive,” Brown says. </p><div class=\"c-float-right\"><aside id=\"WjEWq6\"><q>“The more services you get from your employer, the more potentially your employer can find out about and make decisions about you”</q></aside></div><p id=\"bli4Ct\">But that leaves employees caught between a rock and a hard place — they might be in a position where they have to either agree to disclose that information or risk not being able to get the care at all. “Arguably, that’s worse than the risk of a privacy invasion,” she says. </p><p id=\"octD77\">Health access is closely linked to employment in the US, and around <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ehealthinsurance.com%2Fresources%2Fsmall-business%2Fhow-many-americans-get-health-insurance-from-their-employer&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F5%2F23058911%2Fabortion-access-employers-amazon-supreme-court-roe\" rel=\"sponsored nofollow noopener\" target=\"_blank\">half</a> of people get their insurance from employer plans. Abortion, though, has typically been one of the few medical procedures that exists outside of that relationship, Kirkland says. Clinics are specialized, and people often don’t use their insurance for the procedures. “It’s sort of forced out of regular healthcare,” she says. </p><p id=\"8jo8yb\">These travel programs rope abortion in, in some ways, with regular employer healthcare programs. In some ways, that could help normalize abortion, Brown says. “It puts abortion more on a par with something like cancer treatment, where you might want to travel to another state to find a specialist.” </p><p id=\"GiB7Lz\">But it also makes abortion another service that people could be dependent on an employer for. Like health insurance generally, people who rely on an employer for that key service might feel pressure to stay in a job to keep their access to that care — especially if they live in a state that restricts abortions.</p><p id=\"HFjCUG\">It also reinforces the inequities that already exist around reproductive rights. People who work for tech companies like Amazon and presumably who already have relatively high incomes now have more flexibility to live in places with abortion restrictions while still having access to these services. People who work for companies that don’t see abortion as an important priority or who don’t have full-time jobs with employer healthcare will have less access. Even at Amazon, contract employees, who often have lower incomes, <a href=\"https://www.vice.com/en/article/7kbnpd/amazons-abortion-travel-benefit-doesnt-include-its-most-vulnerable-workers\">aren’t eligible</a> for the travel benefit. </p><p id=\"VZGJr9\">With the Supreme Court set to roll back constitutional protections for abortion, and as other institutional protections around people’s rights (like to gender-affirming care, for example) erode, the main source of formal institutional support that people are left with is from their employer, which could change or shift policies on a whim. </p><p id=\"P6KwFM\">“It would be better to have constitutional protections,” Brown says. But without that, capitalism is the fallback. “We’re left with employer protections.” </p><p id=\"W9yQo2\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_XlJxsR-HvKrdNJrnjksbXU9Vg0=/0x71:1020x605/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10938883/amazon-box-logo-stock-4_1020.0.jpg",
  "description": "Companies say they’ll pay for abortion-related travel.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}