{
  "title": "The best webcam to buy right now",
  "url": "https://www.theverge.com/22652783/best-webcam-camera",
  "date": "2022-04-29T15:07:46.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/AnqSrYL5kIHHyJCAETZFnJ5jFWM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/69814175/akrales_210831_4734_0040.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p>Some standout options for multiple budgets</p> <p class=\"p--has-dropcap\" id=\"Y2YM1c\">If you don’t already have a laptop with a built-in webcam — or the one on your laptop isn’t very good — you might need a standalone webcam. Maybe it’s to be able to show your face during work or school. Maybe it’s for chatting with friends, or for side projects, like live streaming or recording yourself.</p><p id=\"jrBM2l\">If you don’t want to actually purchase a webcam, though, there are several routes to take. You can get crafty with your phone (and spend hardly anything or nothing at all) by using <a href=\"https://www.theverge.com/21281765/webcam-phone-tablet-android-ios-pc-mac-how-to\">an app that’ll fool your computer into thinking it’s a webcam</a>. Or you can go in the total opposite direction and <a href=\"https://www.theverge.com/21523161/phone-camera-webcam-how-to-iphone-android-dslr\">connect a pricey DSLR or mirrorless camera to your computer</a> to use as a webcam — a very good one, at that. </p><p id=\"599LPF\">But assuming you simply want to purchase a webcam, our goal is to make it easier for you to find the one that matches your needs and your budget. Here, I aim to decipher which USB webcams are worth your money.</p><p id=\"PBTZqs\">We tested popular models from brands like Logitech, Microsoft, Dell, Opal, Razer, Elgato, and more. Once the dust settled, we landed on a semi-affordable webcam that we think is the best option for most people. That’s the Logitech C920S Pro HD, which usually costs about $60. It supports 1080p resolution capture at 30 frames per second, and the visual quality is satisfactory in most lighting conditions. </p><p id=\"UX8PIq\">If you have some extra cash along with a desire for better video quality and more features, check out Logitech’s StreamCam. It also supports 1080p resolution, but with a faster 60 frames per second capture. This model is loaded with clever features, like an optional mode that can automatically follow your face around the frame. It also ships with versatile mounts, one for your monitor and another for a tripod.</p><p id=\"rGPHiq\">The invite-only <a href=\"https://www.theverge.com/22834196/opal-c1-webcam-camera-dslr-video-quality-performance-review-price\">Opal C1</a>, which is currently available for $300, is a recent addition to the list. I reviewed it in late 2021 and have been using it as my main webcam ever since. While I think it’s great, the webcam’s software is still in beta, and full Windows compatibility won’t arrive until late 2022. Opal will also begin charging a monthly subscription fee to access some premium features in the future, so keep that in mind if you’re shopping.</p><p id=\"KjCOUJ\"><strong>Note</strong>: Each camera’s video quality was judged by using it with Zoom (where footage is prone to compression, as it is with other web-based video calling apps), as well as with OBS Studio or VLC to see how it compares with a locally-stored recording. </p><div>  <figure class=\"e-image\">        <img alt=\"Logitech C920S Pro HD\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oq6w_fn8r2h5nt8UsnLMp8XGhe0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22820369/akrales_210831_4734_0071.jpg\">  </figure></div><h2 id=\"0UZo0O\">Logitech C920S Pro HD</h2><h3 id=\"HMMN3w\">The best webcam for most people </h3><p id=\"Ta46G2\"><em>Works with: Windows, macOS, Linux, Chromebook</em></p><p id=\"EamdYO\">Usually priced around $60, Logitech’s C920S Pro HD provides better video and mic quality than others that I tested in this price range. This model can record in 1080p resolution at up to 30 frames per second, and while you won’t have an issue finding other similarly-priced webcams with those specs, the C920S Pro’s out-of-box color balance, exposure, and relatively fast auto-focus made it stand out from others I tested.</p><p id=\"06NWy7\">The picture quality has sufficient detail, and even in my relatively dark apartment, the C920S Pro had no trouble making my facial features look sharp. But it wasn’t a flawless presentation overall, as is to be expected for the price. In less-than-ideal lighting scenarios, the C920S Pro made my skin look over-saturated, with red spots where the webcam couldn’t compensate for the lack of lighting. Though in a work or play environment flush with natural light, this was noticeably less of an issue.</p><p id=\"AQpq4s\">Picture quality aside, the C920S Pro has several welcome features, like a generous 78-degree field of view, status lights that activate when the webcam is being used by an application, and an included privacy shutter that can give you assurance that you’re not broadcasting unless you want to be. Some other nice features at this price include its strong articulating stand, which can sit atop your monitor or just as easily screw into a tripod. It’s just a great value for the price.</p><div id=\"ai4Ksm\"><div data-anthem-component=\"productcard:10730538\"></div></div><h2 id=\"M8JI8o\">Other webcam options you might like for under $100</h2><div>  <figure class=\"e-image\">        <img alt=\"Microsoft Modern Webcam\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vbDixIE4MNptXeWGqq88TlPL1zs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22820368/akrales_210831_4734_0069.jpg\">  </figure></div><h2 id=\"1XjelV\">Microsoft Modern Webcam</h2><p id=\"1XE3Yk\"><em>Works with: Windows, and in a more limited fashion, macOS</em></p><p id=\"jdNNIx\">Like the Logitech C920S Pro, the Modern Webcam promises 1080p resolution recording at up to 30 frames per second. Compared directly to the Logitech, Microsoft’s webcam didn’t produce as sharp of an image. It was, however, able to produce a more true-to-life look for my lighting scenario thanks to its HDR setting. </p><p id=\"xajEUQ\">HDR has some benefits, but it might also come with a few cons depending on your lighting. While the Modern Webcam did an admirable job of taming the pretty intense backlight that I have behind me during the day, it didn’t seem to have many tricks to make me look my best in other ways (at least without tweaking the picture with the Microsoft Accessory Center app). Through the lens of the Modern Webcam, I looked like I work in a dimly-lit basement apartment — which I do, but I’d rather not be reminded of that fact. As with the C920S Pro, this should be less of a problem for people who have no shortage of natural light in their room.</p><p id=\"owpuJl\">I appreciate that the Modern Webcam’s stand lets you hang it over a monitor, or screw it into a tripod. And it gets bonus points for having a physical privacy slider. This webcam also has a built-in microphone, but it strangely isn’t enabled by default. If you’re using Windows 10, you’ll need to download and enable that setting within the aforementioned Accessory Center app. If you’re using a macOS computer, well, you’re stuck with a webcam that lacks a microphone. Considering that this webcam costs $69.99, I think you’re better off with Logitech’s C920S Pro.</p><div id=\"PJKItV\"><div data-anthem-component=\"productcard:10730545\"></div>  <figure class=\"e-image\">        <img alt=\"Logitech C270 HD\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/w-y1NE1SxqTFm7HCPEo8x-3mj1E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22820367/akrales_210831_4734_0062.jpg\">  </figure></div><h2 id=\"h6Ocsh\">Logitech C270 HD</h2><p id=\"a0ZCZM\"><em>Works with: Windows, macOS, Android, Chrome OS</em></p><p id=\"Nsz1XC\">If you’re really in a pinch, and your main requirements in a webcam are simply that it’s reliable, very affordable, and it has a microphone, you might want to check out the Logitech C270 HD. It’s by no means a stunner when it comes to video quality — it’s only capable of 720p resolution at 30 frames per second — so you’ll get a fairly fuzzy image no matter what your lighting situation is. You’ll get the best picture if you have it connected in a well-lit environment.</p><p id=\"FLaENJ\">The C270 HD’s bulkier design will likely overlap your monitor’s screen, unlike the options above. It’s a minor consolation that its monitor mount doubles as a stand of sorts, so it can hold itself up on your desk or a table. Being an affordable webcam doesn’t mandate that it shouldn’t have good design, though, so hopefully Logitech improves this aspect in particular for the next iteration.</p><p id=\"piS4zR\">This isn’t the most glowing recommendation, but I understand that spending more isn’t something that some people may want to do. Most people should spend $60 on our top pick, but if you just want something that gets the job done without making a large investment, the C270 HD will do just that.</p><div id=\"tJMDzD\"><div data-anthem-component=\"productcard:10730561\"></div>  <figure class=\"e-image\">        <img alt=\"Logitech StreamCam\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nh1GFyxuwOqYABKQWVCaktQzGYQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22820366/akrales_210831_4734_0060.jpg\">  </figure></div><h2 id=\"9eDY3g\">Logitech Streamcam</h2><h3 id=\"fmc0AB\">The best webcam for people who need better picture quality</h3><p id=\"BffJel\"><em>Works with: Windows and macOS</em></p><p id=\"GpcJPD\">If you’re comfortable spending somewhere in the $150-$200 price range, your webcam selection will open up to devices that have sharper picture quality and other features that may make them worth the extra cost. Logitech’s Streamcam isn’t the newest webcam to be released, but it stands out as being a great value overall — and it’s currently $79.99 at GameStop. </p><p id=\"yEyIJ0\">For one, it’s compact, and its picture fidelity can reach 1080p resolution at 60 frames per second. To my eyes, the Streamcam had only slightly improved clarity, exposure, and color reproduction over the cheaper C920S Pro mentioned above. But it easily takes the win with its much more fluid capture at 60fps. The Streamcam also has a built-in dual omnidirectional mic and a fast auto-focus feature. For people who’d rather have a fixed focus webcam that isn’t constantly searching for objects in motion, Logitech’s Capture software lets you switch off the auto-focus, in addition to several other picture-tweaking settings.</p><p id=\"S8I6mT\">These are all great to have (and what you should expect in a $100+ webcam), but it’s the extra features that put this one at the top. The Streamcam can record in landscape or portrait mode, which may save you a step when you edit clips that are made for mobile viewing. It includes two stands, one that can mount it to a tripod and another, more flexible one that rests on your monitor. The latter stand supports a generous amount of vertical tilt, as well as panning from left to right. Lastly, the Capture software allows you to activate an AI feature that can follow your face as it moves within the frame.</p><p id=\"djm8fC\">If you have an older laptop, one aspect of the Streamcam that might cause trouble is that it plugs in via USB-C. So, if your computer doesn’t have a USB-C port, you’ll need to purchase a USB-C to USB-A adapter. Also, there are other higher-end webcams that offer wider fields of view than the Streamcam’s 78 degrees, so you may want to look elsewhere if you want to capture an image that encompasses more of your room or desk setup.</p><div id=\"MrH5U6\"><div data-anthem-component=\"productcard:10730585\"></div></div><h2 id=\"NlGSTH\">Other options you might like</h2>  <figure class=\"e-image\">        <img alt=\"Opal C1 camera\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/siwa5zrz0tBBaDoEx9FJItTRLMc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23067799/cfaulkner_141231_4911_0001.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>  </figure><h2 id=\"XcZjAd\">Opal C1</h2><p id=\"tAJavz\"><em>Works with: macOS, Windows (plug-and-play for now, full Windows compatibility coming later in 2022)</em></p><p id=\"jAIlUD\">The Opal C1 is an unconventional webcam. By design, it looks unique, but that’s not what makes it stand out from the rest of the models in our buying guide. It’s a webcam that borrows some tricks from smartphones to make its image quality better than any other model that I’ve tried yet. It’s a 4K-capable camera that borrows the same lens featured in Google’s 2016 Pixel phone. That alone provides good video quality, but the C1 benefits most from its software and machine learning features, which make it possible for this webcam to have accurate bokeh and face-tracking, and to be very good at picking the right automatic picture settings to make you look good. </p><p id=\"V3v2yB\"><a href=\"https://www.youtube.com/watch?v=0gZpdU1NPYY&amp;t=305s\">A webcam with great video quality and interesting features</a> sounds like a shoo-in for this list, but it comes with some disclaimers that others do not. Namely, it’s $300, and you need to have received an invite from Opal in order to purchase one. But even if you get that long-awaited invite, its app is in beta (and sometimes acts a little wonky), and the company’s roadmap of features is more exciting than what’s currently available for buyers. </p><p id=\"bnmcNm\">It wants to let the Opal C1 recognize gestures to issue commands, like using the peace sign to log off from video calls. It also envisions that the C1 will be able to wean you off from using verbal crutches like “uh” and “uhm” by providing post-meeting breakdowns. I talked about <a href=\"https://www.theverge.com/22834196/opal-c1-webcam-camera-dslr-video-quality-performance-review-price\">some of these features in my review</a>, as well as <a href=\"https://www.youtube.com/watch?v=0gZpdU1NPYY&amp;t=2s\">in this YouTube video that gives you a few good webcam options</a>.</p><p id=\"4XwBc1\">But getting access to some of these features will cost $4 per month — that is, whenever Opal decides to begin charging. Whenever the flip happens to this paid access model, the C1 will still work as a standard webcam, but we don’t currently know the extent of what you’ll get in terms of complementary features with the C1 because Opal hasn’t yet communicated that info. So, if you want to purchase the Opal C1, purchase it with these things in mind.</p><div id=\"lfDF5T\"><div data-anthem-component=\"productcard:11028371\"></div>  <figure class=\"e-image\">        <img alt=\"Elgato Facecam\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/n-DPVsE7UXl4CXq1faIpRT8hGmA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22820364/akrales_210831_4734_0054.jpg\">  </figure></div><h2 id=\"5BtEmd\">Elgato Facecam</h2><p id=\"gC1SzH\"><em>Works with: Windows and macOS</em></p><p id=\"7MYdPD\">The Streamcam is a tough webcam to beat for the price, yet Elgato’s Facecam comes close. It has a great balance of performance and features — offering slightly better-looking video quality than Logitech’s webcam — but its lack of a microphone combined with its higher, $199 price tag makes it tough to recommend to most people. </p><p id=\"xYt6rS\">The Facecam has similar specs to the Streamcam. It can record at 1080p with up to 60 frames per second, and you can customize how you look in its companion software. After some tweaking to the many settings in Elgato’s Camera Hub app, I preferred how the Facecam made me look with my lighting setup (though its default settings out of the box weren’t great).</p><p id=\"dXdHAX\">There are a few problems, though, minor as they might seem to some people. As I’ve already mentioned, the Facecam costs a little more, and for the price, its lack of a microphone surprised me, even if it may not be an issue for people who already use a standalone mic or a headset. And the Facecam’s boxy design won’t exactly blend in with every setup. </p><p id=\"0CtsdR\">Despite its flaws, there is a lot to like here. The Facecam supports an 82-degree field of view that’s a little wider than the Streamcam’s, and the fixed focus means that the lens won’t be constantly going in and out of focus as you move around. The Facecam also produces footage that looks noticeably less grainy than any other webcam that I tested for this guide. Some other things I like about this model are that it includes a privacy cap and the webcam itself has a tripod thread on its bottom, so you can easily mount it to a tripod.</p><p id=\"WX61Qw\">Whether you’re willing to forgive the Facecam for its lack of a mic, or if it wasn’t a problem for you in the first place, I’d still recommend waiting until this one drops a bit in price.</p><div id=\"QkCwjk\"><div data-anthem-component=\"productcard:10730597\"></div>  <figure class=\"e-image\">        <img alt=\"Razer Kiyo Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gsa07uaWlsBlRq4jP_gypkLSwMk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22319958/cfaulkner_210219_4432_0001.jpg\">      <cite>Photo by Cameron Faulkner / The Verge</cite>  </figure></div><h2 id=\"b84tbO\">Razer Kiyo Pro</h2><p id=\"hAbxOa\"><em>Works with: Windows</em></p><p id=\"wRVqwt\">The differentiating feature of the lens-shaped $199 Kiyo Pro, compared to other higher-end webcams, is its super-wide 103-degree field of view. It allows you to see more of your work or play space, as well as more of you. It can also be set to 80 degrees or 90 degrees, if you want to tweak the look. </p><p id=\"ur5tIT\">Otherwise, its specs will look familiar if you’ve made it this far down the guide. It supports 1080p capture at 60 frames per second, and there’s an HDR mode that knocks the framerate down to 30fps in exchange for a more balanced-looking image. <a href=\"https://www.theverge.com/22295235/razer-kiyo-pro-webcam-review-adjustable-field-of-view-streaming-zoom-video-calls-price-features\">During my testing earlier in 2021</a>, I thought it did a better job than the webcam that I’ve used the most during the pandemic: the one built into my 2019 MacBook Pro. </p><p id=\"qzxHbZ\">That’s underselling it a bit, though. It’s basically on par with the Logitech Streamcam in its ability to produce a satisfying picture with good exposure, although the image was fuzzier than I would have liked for the price. Picture quality aside, the build quality is excellent, and its stand lets you easily mount it on your monitor, or attach it to a tripod. But, this might be a more attractive option if it’s discounted.</p><div id=\"REO1AH\"><div data-anthem-component=\"productcard:10730624\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/dF5tHQui81-TwSYSg1su14KpqQ8=/0x74:2040x1142/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22820351/akrales_210831_4734_0007.jpg",
  "description": "If you don’t have a webcam, or if your laptop isn’t cutting it.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}