{
  "title": "The Polestar O2 is a sleek electric roadster with an integrated drone for aerial filming ",
  "url": "https://www.theverge.com/2022/3/2/22956775/polestar-o2-electric-roadster-concept-drone",
  "date": "2022-03-02T14:54:19.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1V9IqUBPiz6o4xbH3Wntb-BxPZE=/0x62:4000x2729/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70569544/646266_20220302_Polestar_O2_electric_performance_roadster_concept.0.jpg\" />        <figcaption>The Polestar O2 roadster is the second concept from the Swedish automaker.  | Polestar</figcaption>    </figure>  <p id=\"dYBXVa\">Polestar, the Swedish electric automaker, announced a new roadster concept called the Polestar O2. The hardtop convertible, which made its debut in Los Angeles today, is designed to showcase the automaker’s bonded aluminum platform, which it produces in-house, as well as some quirkier innovations, like an integrated drone for aerial filming. </p><p id=\"wxQuH8\">It’s the <a href=\"https://www.theverge.com/2020/2/25/21151592/polestar-precept-concept-electric-car-2020-geneva-motor-show\">second concept from the company</a>, which is a joint venture between Volvo and the automaker’s Chinese parent company Geely. And it’s a nod to the company’s roots as a performance sub-brand of Volvo, having since recast itself as an EV-only marque. </p><div class=\"c-float-right\"><aside id=\"0npasv\"><q>We haven’t seen an electric two-seater sports car introduced since the Tesla Roadster</q></aside></div><p id=\"QmIrVq\">On the surface, the Polestar O2 looks like it would be extremely fun to drive. We haven’t seen an electric two-seater sports car introduced since the Tesla Roadster — and even Elon Musk’s next-generation version of his company’s first production vehicle is <a href=\"https://www.theverge.com/2021/9/1/22653205/tesla-roadster-elon-musk-ship-delay-2023\">delayed until 2023</a>. Most of the major sports car manufacturers like Lamborghini and Ferrari are still working on their first electric models, leaving an opening for Polestar to lay the smackdown with its zippy-looking concept.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nKFots6Od5_BD82t1dlsg3NsulI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23282653/646274_20220302_Polestar_O2_electric_performance_roadster_concept.jpg\">  </figure><p id=\"ZTeg3a\">As it is just a concept, the company isn’t releasing any of the Polestar O2’s specifications, such as 0-60 time, battery capacity, and range. But in an interview, Polestar CEO Thomas Ingenlath said that the modularity of its bonded aluminum platform allows for a bigger battery even within a shortened wheelbase. </p><p id=\"E8wvy0\">“Over 110 kilowatt hours of battery power, we still can package without any compromise in this short wheelbase,” Ingenlath said. </p><div class=\"c-float-right\"><aside id=\"EOKdW8\"><q>The O2 shares a lot of design traits with Polestar’s first concept, the Polestar Precept</q></aside></div><p id=\"hOtHI2\">The O2 shares a lot of design traits with Polestar’s first concept, the Polestar Precept, including sharp-looking lines and a lighting signature that reflects the company’s Volvo origins. The vehicle’s body is low and wide, with an aggressive stance and a compact cabin orientation. Polestar calls it “classic sports car proportions” with a more modern electric feel — and it’s hard to argue with that. </p><p id=\"vWouA9\">“We wanted to make sure people understand the architecture is capable of catering for sports cars like this,” Ingenlath said. “The high torque, high power, P10 engine that we developed for the Precept will find, in the top peak performance version, a home in all of our products... And of course, it could be packaged in the roadster here.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Z6zwFS9bGeUaZ9w03eZUpU_1tYc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23282656/646275_20220302_Polestar_O2_electric_performance_roadster_concept.jpg\">  </figure><p id=\"8NlfWE\">The O2 is also an opportunity to showcase Polestar’s environmental bonafides. The interior is made from a new thermoplastic mono-material, which describes the use of a single base material to manufacture different components. In this case, a recycled polyester is used as the sole material for all the soft interior components, such as seat foam, adhesive, 3D knit fibers, and non-woven lamination. Polestar says this simplifies recycling and represents a step towards “greater circularity,” while also reducing weight and waste.</p><p id=\"XO1Io3\">“That is an idea that we definitely would love to put in production,” Ingenlath said of the use of a mono-material in the interior. “That’s how we use these concept cars really, to put out that ambition and inject the energy into the organization to really strive for making it possible.”</p><p id=\"jjzWgd\">And the chassis of the vehicle is designed in a way to make recycling more seamless. Different grades of aluminum are labeled, allowing them to be recycled more effectively and for their properties to be retained. </p><div id=\"r8y1fZ\"><div data-anthem-component=\"gallery:11074526\"></div></div><p id=\"m9hPfm\">The most distinctive feature in the Polestar O2 is the inclusion of a “cinematic drone” so owners can film themselves as they drive along a twisty mountain road, for example. The drone — which is a concept, too — was developed in collaboration with Aerofugia’s consumer electronics brand Hoco Flow. (Aerofugia is the company that was formed after <a href=\"https://www.theverge.com/2017/11/13/16643342/volvo-geely-terrafugia-flying-car-acquisitionhttps://www.theverge.com/2017/11/13/16643342/volvo-geely-terrafugia-flying-car-acquisition\">Geely acquired Boston-based electric vertical takeoff and landing startup Terrafugia</a>.) It’s designed to be deployed while the car is moving, to record driving sequences.</p><p id=\"XtRgNo\">Ingenlath described the perception of European sports car ownership, driving along that twisty mountain road, can be “very old fashioned” and out of touch with today’s concept of shared experiences. </p><div class=\"c-float-right\"><aside id=\"BAkcED\"><q>“That is an idea that we definitely would love to put in production”</q></aside></div><p id=\"ZmeXpY\">“We challenged our team and said, ‘Look, guys, how would the modern answer to that  look?’” he said. “The drone definitely is the vehicle to produce memories, to produce shareable moments, to capture that experience that you have, together with your partner in the car, and the drone can film you. It can make really exciting dynamic shots of the car or very calm ones.”</p><p id=\"qlJssk\">Ingenlath said the technology that would integrate a drone into the vehicle is “very feasible,” with the drone following the car at speeds of up to 100 km/hour. After filming, the drone can autonomously return to the car. And video clips can be edited and shared directly from the 15-inch center display when the car is parked. Ingenlath described it as less distracting to the driver than attempting to film yourself with your smartphone. </p><p id=\"nwO1II\">Polestar has already committed to turning its first concept, the Precept, <a href=\"https://www.theverge.com/2021/11/23/22798880/polestar-5-precept-electric-sedan-tease-2024\">into a production vehicle, the Polestar 5</a>. Could the same thing happen to the Polestar O2? “Possibility? Definitely,” Ingenlath said. “I very much strive for provoking that question. I want to make that proposition with this car and I would be more than happy to confirm it in the future.”</p><p id=\"SmRzLD\"></p><p id=\"HecSpu\"></p><p id=\"Vp2Tnj\"></p><p id=\"IyyxbZ\"></p><p id=\"SqzYs6\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/26uFHecaXg9ODnam9ZxYicVA1Cg=/0x348:4000x2442/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23280365/646266_20220302_Polestar_O2_electric_performance_roadster_concept.jpg",
  "description": "A sleek roadster concept from the Swedish company",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}