{
  "title": "The PlayStation Network is down, but not for everyone on PS5 and PS4",
  "url": "https://www.theverge.com/2022/3/23/22992567/sony-playstation-plus-down-outage-ps5-ps4-psn",
  "date": "2022-03-23T14:49:33.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"DualSense\" src=\"https://cdn.vox-cdn.com/thumbor/J5PG7xJ23Qgqh6OMeU4zHXv4eSE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70661197/vpavic_4261_20201023_0028.5.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"AL9Ex3\">Players are experiencing a number of issues with the PlayStation Network right now, affecting the PS Store, PS Now cloud gaming services, as well as any games, apps, or features that require a network connection. <a href=\"https://status.playstation.com/\">PlayStation’s status page</a> currently says “some services are experiencing issues” and notes that problems began at around 8:30AM ET this morning.</p><p id=\"qBwIAK\">The problem doesn’t seem to be affecting everyone, as some staffers at <em>The Verge </em>had PlayStation Plus errors while trying to play <em>Elden Ring</em>, but for others, things are working just fine. There may be a regional aspect to the problem — so far, everyone we’ve checked in the Midwest and Canada has a fully operational PS5, but in New York, everyone is getting error messages. Among readers, reports are more scattered, there are people across the Midwest with issues, while some others are able to connect. Sony’s last update about the issue came at 9:41AM ET, and there’s still no timeline for restoration.</p><div id=\"OxVi41\"><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\">【PSN™障害発生のご案内】<br>ただいま、PSN™（PlayStation®Storeを含む）をご利用いただけない場合がございます。ご利用のお客様にはご不便をおかけし大変申し訳ございません。調査及び復旧作業を行っておりますので、いましばらくお待ちいただきますよう宜しくお願い申し上げます。 <a href=\"https://t.co/nrzKIrMVnY\">pic.twitter.com/nrzKIrMVnY</a></p>— Ask PlayStation JP (@AskPS_JP) <a href=\"https://twitter.com/AskPS_JP/status/1506595277486145538?ref_src=twsrc%5Etfw\">March 23, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"5fePcj\"> Some players are <a href=\"https://www.reddit.com/r/PS5/comments/tkrpvm/psa_the_latest_ps5_system_update_may_give_you_an/\">reporting issues with their PS Plus subscription</a> and are receiving errors when trying to launch games or access cloud saves. If you’re getting that message, you shouldn’t sign up for another year, as it won’t help you get back online. It’s unclear whether these problems have anything to do with the <a href=\"https://www.theverge.com/22992420/sony-playstation-5-variable-refresh-rate-feature-release-date\">just-released system update for PlayStation 5 and PlayStation 4 systems</a>, as the people who are still online were able to update without issue.</p><p id=\"JZQCyU\">PlayStation’s Japanese Twitter account also confirmed the network outage. “PSN™ (including PlayStation® Store) may not be available at this time,” a translated version of <a href=\"https://twitter.com/AskPS_JP/status/1506595277486145538\">the tweet reads</a>. “We apologize for any inconvenience caused to our customers. We are conducting an investigation and restoration work, so please wait for a while.”</p><p id=\"uc3keT\">There currently isn’t a timeline for when PlayStation’s services will be fully restored. <em>The Verge</em> reached out to PlayStation with a request for comment but didn’t immediately hear back.</p><p id=\"O2xwAi\"><em><strong>Update March 23rd 9:53AM ET: </strong></em><em>Added notes about regional reporting of the outage.</em></p><p id=\"bH9zDW\"><em><strong>Update March 23rd 10:48AM ET: </strong></em><em>Updated the status and details of the outage.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XrAnIOmAHHCl1vb5lZERIwLlIUc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21990362/vpavic_4261_20201023_0028.jpg",
  "description": "Sony’s outage might be causing problems for your PS5.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}