{
  "title": "Therabody launches a massage gun for your face",
  "url": "https://www.theverge.com/2022/4/12/23020395/theraface-pro-massage-gun-facial-microcurrent",
  "date": "2022-04-12T12:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/I0gCp45UE1-BCG0hzzrXs6YPneA=/0x2:8192x5463/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70739354/THERAFACE_LIFESTYLE_KELSEY_BEDROOM_0081_copy.0.jpg\" />        <figcaption><em>Therabody has a new massage gun for your face. It also does LED light therapy.</em> | Image: Therabody</figcaption>    </figure>  <p id=\"lwqN1k\">Skincare gadgets are all over Instagram and TikTok, and now the company behind the Theragun body massage gun wants in on the action. Today, Therabody announced it’s launching the TheraFace Pro — a facial massage gun that can also deliver microcurrent and light therapy with interchangeable magnetic attachments.</p><p id=\"fzeymP\">According to Therabody’s press release, the $399 TheraFace Pro was born out of customers sharing anecdotal stories of using Theragun devices on their faces. For the record, the company emphasized it does <em>not</em> recommend that particular use case for its devices. However, given the demand, Therabody says it then tasked its engineering and product team to address facial muscle tension, headaches, and jaw soreness.</p><p id=\"beAq80\">Like the Theragun, the TheraFace Pro’s main schtick is percussive massage. However, this is a gentler version that’s more suitable for your delicate facial skin than the original, which targets deep tissue muscles. The TheraFace Pro’s vibrations only reach 3mm of muscle depth, whereas its other devices go as deep as 16mm. It also comes with three attachments: a flat one for general use; a cone for targeted areas such as the eyes and smile lines; and a micropoint attachment for larger areas like the forehead and cheeks. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8ZHO6lYZ4Tpknpuuc2Y_XCEhyJc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382361/THERAFACE_LIFESTYLE_STELLA_BATHROOM_1_0288_copy.jpg\">      <cite>Image: Therabody</cite>      <figcaption><em>There’s also a magnetic attachment for microcurrent facials.</em></figcaption>  </figure><p id=\"4dre2Q\">The device can be used as a deep cleansing tool to remove dirt, oil, and debris. You can also separately purchase $99 hot and cold rings, which purportedly help the skin to better absorb products and reduce puffiness. </p><p id=\"asyv8S\">If that were it, the TheraFace Pro wouldn’t be much to write home about. However, the intriguing thing is the device can also do microcurrent and light therapy. Microcurrent therapy refers to a form of facial toning that involves sending low-voltage electric currents into the skin. Meanwhile, light therapy refers to shining red or blue LED light onto the skin to reduce wrinkles and address acne. Currently, there is <a href=\"https://www.health.harvard.edu/diseases-and-conditions/led-lights-are-they-a-cure-for-your-skin-woes\">some evidence that light therapy works</a>, though more research needs to be done and the efficacy of at-home devices can vary widely.<strong> </strong>Therabody says that customers only need a single attachment to get red, blue, and red / infrared light. The TheraFace Pro has also received FDA clearance as a <a href=\"https://www.fda.gov/medical-devices/consumers-medical-devices/learn-if-medical-device-has-been-cleared-fda-marketing#:~:text=Class%20II%20%E2%80%93%20Most%20medical%20devices,devices%20fall%20under%20this%20category.\">Class II device</a> for its microcurrent and LED features. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7Jd2SE3ZTzhuxeu6tMVCv8IiNxs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23382364/THGN_TheraFace_Exploded__Red_IR_LED___1.0.0_.png\">      <cite>Image: Therabody</cite>      <figcaption><em>The TheraFace Pro acts as several skincare devices in one.</em></figcaption>  </figure></div><p id=\"kxHUQ8\">It’s not surprising that Therabody is tacking on these particular treatments to its facial massager. Professional microcurrent facials are usually done by dermatologists and estheticians, but at-home gadgets like <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.mynuface.com%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F12%2F23020395%2Ftheraface-pro-massage-gun-facial-microcurrent\" rel=\"sponsored nofollow noopener\" target=\"_blank\">NuFace</a> have become popular due to social media. Light therapy masks are also popular and feature in many skincare influencers’ routines. The novelty is more in that this is an all-in-one device that does all these things for roughly $400. Generally, you’d have to buy multiple devices, one for each type of treatment. These devices can also cost a pretty penny. NuFace’s cheapest device costs about $160, with the majority costing several hundred dollars. Meanwhile, LED light masks tend to cost anywhere <a href=\"https://www.cosmopolitan.com/style-beauty/beauty/g29964112/best-led-masks/\">between $100 and $500</a>.  </p><p id=\"cVDgr1\">The TheraFace Pro will retail for $399, with the hot and cold ring attachments sold separately for $99. It’s currently available on Therabody’s website as well as in retail stores including Neiman Marcus, Bergdorf Goodman, Dillard’s, Best Buy, and Target.</p><p id=\"AJeaKC\"></p><p id=\"o3dZvG\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/haK4TC_4zq2hStaec3_PNOUWmXU=/0x588:8192x4877/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382357/THERAFACE_LIFESTYLE_KELSEY_BEDROOM_0081_copy.jpg",
  "description": "The multitasking skincare gadget will zap wrinkles, too.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}