{
  "title": "These are the words Amazon’s planned employee chat app reportedly won’t let you say",
  "url": "https://www.theverge.com/2022/4/4/23010608/amazon-worker-social-app-banned-words-union-living-wage",
  "date": "2022-04-04T22:50:38.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/R607GmTJkRyN47YLjbbNjlD81PI=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70710170/acastro_180329_1777_amazon_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Yyjn9l\">Amazon reportedly plans to add a content filter to an internal messaging app in the making and would ban words that reflect the company’s working conditions or pertain to organizing a union, according to internal documents obtained by <a href=\"http://tercept.com/2022/04/04/amazon-union-living-wage-restrooms-chat-app/\"><em>The Intercept</em></a>. </p><p id=\"zIWUX6\">With the filter in place, the app would block or flag messages that include words like “union,” “slave labor,” “grievance,” “living wage,” and more. Oh yeah, it would filter out “restroom,” too (probably to prevent you from telling your coworker you <a href=\"https://www.theverge.com/2021/3/25/22350337/amazon-peeing-in-bottles-workers-exploitation-twitter-response-evidence\">“just went to the <em>restroom</em> in a bottle”</a>).</p><p id=\"eYgx7d\">A source familiar with the situation told <em>The Intercept</em> that Amazon executives met in November 2021 to discuss the creation of a social media platform specifically for employees. Dave Clark, Amazon’s head of worldwide consumer business, reportedly suggested the app offer a one-on-one social experience, like the dating app Bumble, rather than serving as a large social hub like Facebook. It would allow employees to highlight each others’ work by creating posts called “Shout-Outs.” Amazon would somehow integrate these Shout-Outs into <a href=\"https://www.theverge.com/2021/3/15/22331502/amazon-warehouse-gamification-program-expand-fc-games\">its gamification program</a>, which <em>The Intercept</em> says already showers employees with virtual stars and badges for their productivity.</p><div class=\"c-float-right\"><aside id=\"47oBxy\"><q>The app would block “unfair,” “master,” “slave,” “injustice,” “ethics,” “diversity,” and “fairness”</q></aside></div><p id=\"2MAGyI\">During the meeting, executives reportedly discussed “the dark side of social media” and agreed to monitor employees’ posts (should Amazon ever launch the platform). They apparently did some brainstorming after the meeting, and that’s when the source reports they devised their list of “bad” words.</p><p id=\"07Ars2\">In addition to profanities and other inappropriate words, <em>The Intercept</em> says it would also include “unfair,” “master,” “slave,” “injustice,” “ethics,” “diversity,” “fairness,” “pay raise,” and phrases like “This is dumb” or “This is concerning.” What better way to address employee concerns than to banish them into nonexistence? Coming from a company that <a href=\"https://www.theverge.com/2022/1/27/22904145/amazon-fc-ambassadors-twitter-army-paid-influence-campaign-disbanded\">paid people on Twitter to say nice things about it</a>, I can’t say I’m surprised.</p><p id=\"aO0kze\">“Our teams are always thinking about new ways to help employees engage with each other,” Amazon spokesperson Barbara Agrait said in a statement to <em>The Verge</em>. “This particular program has not been approved yet and may change significantly or even never launch at all. If it does launch at some point down the road, there are no plans for many of the words you’re calling out to be screened. The only kinds of words that may be screened are ones that are offensive or harassing, which is intended to protect our team” </p><p id=\"w2crfB\">The first-ever <a href=\"https://www.theverge.com/2022/4/1/23004524/amazon-workers-vote-union-jfk8-staten-island-new-york-warehouse-win\">Amazon union just formed at a Staten Island, New York warehouse</a>, representing <a href=\"https://www.theverge.com/2022/4/4/23006562/amazon-labor-union-jfk8-win-contract-negotiations-expansion\">a huge landmark for Amazon workers</a> across the country. A <a href=\"https://www.theverge.com/2022/3/31/23004479/amazon-workers-vote-results-union-bessemer-warehouse-challenged-ballots-results\">union vote in a Bessemer, Alabama, warehouse</a> was too close to call and will be determined by a court hearing — it was the second election after the <a href=\"https://www.theverge.com/2022/1/27/22905235/nlrb-amazon-broke-labor-laws-jfk8-warehouse-workers\">National Labor Relations Board said Amazon broke labor laws</a> during the first. Meanwhile, <a href=\"https://www.theverge.com/2022/3/18/22985518/amazon-warehouse-union-election-second-staten-island-ldj5\">the union vote at another Staten Island warehouse is currently underway</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Wj1NpbtC8PEvfbDlTiGvSCnrjaQ=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745909/acastro_180329_1777_amazon_0002.jpg",
  "description": "Amazon’s list of banned words reportedly includes ‘union’",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}