{
  "title": "These artists are making tiny ROMs that will probably outlive us all",
  "url": "https://www.theverge.com/22935074/hundred-rabbits-uxn-roms-preservation",
  "date": "2022-03-07T15:30:00.000Z",
  "author": "Alexis Ong",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/a0I9k0UCZukBb0TEVtM2ujhjtVk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70588978/acastro_220225_5012_5045_0001.0.jpg\" />        <figcaption>Photo Illustration by Alex Castro / The Verge, Images: 100rabbits</figcaption>    </figure>  <p>Come sail away with Hundred Rabbits</p> <p class=\"p--has-dropcap\" id=\"HPoqpq\">In 2017, on a 10-meter-long sailboat off the coast of French Polynesia, Canadian artists Devine Lu Linvega and Rekka Bellum — also known as the two-person studio / collective Hundred Rabbits — realized that something had to change about the way they worked. <a href=\"https://wiki.xxiivv.com/site/home.html\">Devine</a> is a software developer who also makes music as <a href=\"https://aliceffekt.bandcamp.com/\">Aliceffekt</a>, and <a href=\"https://kokorobot.ca/\">Rek </a>is an illustrator and writer. Trying to download the latest Apple Xcode update, the pair had to <a href=\"https://www.marketplace.org/2020/12/05/how-we-survive-a-changing-mindset/\">place their iPhone in a bag</a> and hoist it up the mast; the OS was around 10GB, but their SIM cards only had 5GB of data, and it took multiple attempts to get the job done. “At that moment, we began to feel like the modern development stack was utterly incompatible with our life,” the pair explain over email. </p><p id=\"TLty2B\">It was the beginning of something small but profound: <a href=\"https://100r.co/site/uxn.html\">the Uxn</a>, a virtual ecosystem to make experimental tools and games that exists outside the revolving door of always-online tech anchored to subscriptions, needlessly complicated upgrades, and increasingly problematic forms of digital ownership. It is essentially an emulator, to translate the actions of one computer onto another, that can prolong the life of digital data tied to aging hardware and software. In line with the Rabbits’ love of storytelling, Rek even brought the Uxn to life as <a href=\"https://kokorobot.ca/site/uxn.html\">a tiny ox-like creature</a> (often accompanied by the humanoid <a href=\"https://wiki.xxiivv.com/site/varvara.html\">Varvara</a>, who represents a portable computing system built on Uxn).</p><p id=\"JYDE0w\">In 2016, Devine and Rek chose a life at sea after being inspired by <a href=\"https://www.youtube.com/watch?v=CkaH_UUH0Ek\">“liveaboard” videos</a>. They bought <a href=\"https://100r.co/site/pino.html\">Pino</a>, a 1982 Yamaha sailboat, and set about learning how to maintain their new craft. As their adventures expanded and they adjusted to living off solar panels, limited batteries, and donated secondhand devices, they learned to pare down on conveniences like <a href=\"https://100r.co/site/refrigeration.html\">food refrigeration</a>. “Our decision to liveaboard shaped our current use of technologies, but in the beginning, we naively believed that we could keep on using the same convenient products we were already familiar with,” they say.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/p4eh4Aji-pdWgAS_D_LOT_y1x2A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23278137/pino_02.jpg\">      <cite>Image: Hundred Rabbits</cite>      <figcaption><em>Pino, Hundred Rabbits’ 1982 Yamaha sailboat.</em></figcaption>  </figure></div><p id=\"q2urnb\">Today, the Hundred Rabbits <a href=\"https://100r.co/\">website</a> has grown into a living repository for a bounty of seafaring knowledge, <a href=\"https://www.pcgamer.com/enough-cyberpunkits-solarpunks-time-to-shine/\">solarpunk</a>-driven philosophy, and a window into their work — esoteric offline-first software that emphasizes sustainability and the values of <a href=\"http://viznut.fi/texts-en/permacomputing.html\">permacomputing</a>, a term coined by Finnish artist and writer Ville-Matias “Viznut’’ Heikkilä. It’s a compelling perspective that flies in the face of the metaverse hype surrounding us today, and on another level, the need for everything to be constantly connected or tied up with blockchain technology in the name of democratization. The right-to-repair movement and long-term approaches to computing are seen as more impactful, sustainable factors in empowering regular people to take control of their own software and hardware.</p><p id=\"o6GXK0\">Thinking about their previous work, the Rabbits realized they needed to work off something small, low-tech, and portable that used common peripherals like mice and keyboards. “The projects that survive the treadmill of ever-changing physical hardware, are the ones designed explicitly for small virtual machines (such as <a href=\"https://fabiensanglard.net/another_world_polygons/\">Another World</a>), which are easy to play today due to their targeting of a portable and virtual core,” they explain. Another factor in their approach to making something new was using technology with available documentation — given their long periods away from the internet, they were best off using open-source technologies that they could troubleshoot themselves.</p><div class=\"c-float-right c-float-hang\"><aside id=\"vQFb0n\"><q>“At this moment, the project lives without us”</q></aside></div><p id=\"L0YSiE\">The solution lay in the eight-button simplicity of the NES, a beloved (and very much offline) part of many childhoods that has continued to shape our emotional relationships to game consoles and the idea of play. “For a time, we thought we could probably just rebuild our projects for the classic Nintendo, to ensure their survival over the influx of disposable modern platforms,” they say. And so, the Uxn was born. </p><p id=\"uWpA17\">The Uxn can run on small devices like the Game Boy Advance, Nintendo DS, Raspberry Pi Pico, and, of course, on desktop. The desktop emulator comes with some of the Rabbits’ own creations, like <a href=\"https://100r.co/site/donsol.html\">a dungeon-crawling card game</a>, programs for <a href=\"https://100r.co/site/left.html\">writing</a> and <a href=\"https://100r.co/site/noodle.html\">sketching</a>, and Devine’s experimental <a href=\"https://100r.co/site/orca.html\">livecoding tool Orca</a>. Its apps work like game ROMs, and are written in Uxn’s own assembly language, called uxntal or TAL; the first line of Uxn code, the Rabbits recall, was written a year ago after they made landfall after a seven-week voyage from Japan to Victoria, British Columbia. </p><p id=\"HaPbhb\">Since making it public, a small community has grown around the Uxn with other artists and developers playing around with everything from <a href=\"https://git.sr.ht/~cabrendan/starling\">spreadsheet apps</a> to <a href=\"https://nilfm.cc/git/xrxs/about/\">experimental game servers</a>. One Uxn game is <a href=\"https://pup.town/catcubes.html\">cat cubes</a>, a survival puzzler inspired by the Game Boy Color. Its creator <a href=\"https://pup.town/\">puprika</a> mostly became interested in the Uxn to make games, but it grew into something more significant, especially when it comes to envisioning the footprint and future of their software. “Uxn does address many of the problems that kept me away from other video game engines,” they say. ”The <a href=\"https://www.vice.com/en/article/y3d4jy/unity-workers-question-company-ethics-as-it-expands-from-video-games-to-war\">recent revelations</a> regarding Unity’s military dealings are a good example of how choosing software to build on top of can be a complicated issue, even for video games.”</p><p id=\"MYsIRH\">Puprika was especially interested in how easily and directly they could get involved with the Uxn project. “The way I understand it, the limitations of Uxn are driven by the technical difficulty a given feature would pose to a person writing a Uxn emulator … the internal workings are relatively simple to understand,” they explain. When they had an idea to improve the Uxn’s ability to play music, they received a warm welcome in the Uxn IRC channel and Mastodon community.</p><p id=\"RWjHQ3\">Developer <a href=\"https://glitch.com/@noelleleigh\">Noelle Leigh</a>, another Uxn enthusiast, was also inspired by the accessibility of the project’s offline, low-tech nature. “Seeing the ways that modern software and hardware development fails users with low power and low connectivity needs, combined with my awareness of the right-to-repair movement, led to a change in my perspective on the state of modern computing in our capitalist society,” she says. This view was strengthened by her experience using a high-powered complex software stack for work. She believes the Uxn is both an ideal introduction to permacomputing, as well as a starting point to reimagine what modern software development could look like.</p><div class=\"c-wide-block\"><div id=\"kxMGDJ\"><div ><iframe src=\"https://www.youtube.com/embed/RWgnOFycA0g?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div></div><p id=\"F4n7FE\">The Uxn only became usable (and used) toward the end of 2021, during a period of the year when Devine and Rek don’t usually sail much. It was during this downtime — a terrestrial lull to cultivate a place for it online and draw people into its orbit — that they were finally able to let the Uxn exist fully on its own. “At this moment, the project lives without us. The language stabilized a few months ago, there are emulators for nearly all conceivable platforms, <a href=\"https://compudanzas.net/uxn_tutorial.html\">a small book</a> was even written containing everything that one might need to write programs for Uxn,” they say. “We’re free to untie the lines again knowing that if there are issues, the community can help itself.”</p><p id=\"4wghh7\">While the Rabbits are clear that theirs isn’t a reproducible lifestyle for everyone, their offline computing microcosm is an extraordinary fusion of philosophy and practice that’s hard to find in a world where convenience is king. “Uxn was created to suit our very specific needs, but what we’d love is for it to inspire the creation of a multitude of well-documented small virtual machines, capable of running on pre-existing hardware,” they say. “Nothing new needs producing and no e-waste needs processing.”</p><p id=\"ZukHvB\">As the Rabbits’ lives on Pino unfold, and their projects and <a href=\"https://100r.co/site/videos.html\">travels around the world</a> continue to inspire others, it’s incredible to see how a tiny virtual machine project can serve as a conceptual beacon to kindred spirits at the crossroads of art and technology. In an age where constant connection is a default way of life, the Rabbits’ offline-first philosophy is a curious but compelling form of technological radicalism that feels like a more thoughtful, evolved Luddism. Because the Uxn is designed to stave off bitrot — the digital decay of old information that we can no longer read — its significance to art preservation, creativity, and sustainability is more powerful than anything being peddled on a blockchain.</p><p class=\"c-end-para\" id=\"ozmNSy\">Or, as the Rabbits like to say, “if your new software no longer runs on old hardware, it is worse than the old software.”</p><p id=\"hKmyuR\"></p><p id=\"Ru6EMK\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2M94U77YtkDrJA1SlxL2QK5M8eo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270954/acastro_220225_5012_5045_0001.jpg",
  "description": "The creators of Uxn.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}