{
  "title": "They spent $3 million on a Dune script bible — now what?",
  "url": "https://www.theverge.com/2022/2/28/22950868/spice-dao-crypto-jodorowsky-dune-bible-collective-writing-contest",
  "date": "2022-02-28T14:07:24.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"An illustration of a pyramid filled with typewriters\" src=\"https://cdn.vox-cdn.com/thumbor/JXDhnH2Bj-GyLczkT3Sl15h25NI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70559818/acastro_220207_5009_0001.0.jpg\" />        <figcaption>Illustration by&nbsp;<a class=\"ql-link\" href=\"http://instagram.com/alex.e.cas\" target=\"_blank\">Alex Castro</a>&nbsp;/ The Verge</figcaption>    </figure>  <p>Spice DAO’s quest to honor a nonexistent film</p> <p class=\"p--has-dropcap p-large-text\" id=\"MfYuEu\">Spice DAO wants to be clear about one thing: it is not filming Alejandro Jodorowsky’s <em>Dune</em>.</p><p id=\"d5gOYy\">If you’ve heard of Spice DAO, you might know it as an example of cryptocurrency’s silliest excesses. The group began with a quest to <a href=\"https://www.buzzfeednews.com/article/amansethi/spicedao-dunedao-soby\">buy one of Jodorowsky’s <em>Dune</em> script bibles</a>: a set of storyboards for what’s sometimes dubbed <a href=\"https://www.theverge.com/2014/3/27/5554126/jodorowskys-dune-interview-greatest-sci-fi-film-never-made\">the “greatest sci-fi film never made.”</a> Spice DAO blew past its fundraising goal and expanded its ambitions, aiming to become one of the crypto world’s first successful production houses. But when it announced its plans to the world, some awkward phrasing implied it had made one of the <a href=\"https://www.theverge.com/2022/1/17/22887948/jodorowsky-dune-bible-spice-dao-derivative-script\">worst copyright deals ever conceived</a> — believing it had bought the film rights to Dune by acquiring the book.</p><p id=\"iAz6lT\">To put it bluntly, this wasn’t true. Spice DAO’s existence has been messy, precarious, and sometimes remarkably convoluted. But it’s also more interesting, and maybe more earnest, than a deluge of Twitter dunks suggested. With a tiny bureaucracy and a lot of online polling, the group is still trying to create an homage to Jodorowsky’s vision, starting with a story about a lonely priest looking for God.</p><p id=\"iBAXYa\">Spice DAO is a decentralized autonomous organization, or a group controlled by cryptocurrency or non-fungible token (NFT) holders. Founded by ​​Soban “Soby” Saqib and a small group of other crypto enthusiasts, the DAO raised a total of roughly $12 million in cryptocurrency last year. When Saqib won a November auction for the equivalent of $2.9 million, that left a huge surplus of money —  far more than it needed for the bible’s upkeep.</p><p id=\"4TSdPf\">A traditional crowdfunding campaign could refund excess money in a pinch. But returning cryptocurrency sometimes literally costs more than it’s worth. Ethereum requires paying fluctuating and often exorbitant “gas” fees for even small transactions, which creates a major incentive to keep a DAO alive instead of watching thousands (or even <a href=\"https://www.theverge.com/2021/11/24/22800995/constitutiondao-refund-progress-steep-gas-fees-cryptocurrency\">hundreds of thousands</a>) of dollars disappear to let it die.</p><hr class=\"p-entry-hr\" id=\"6X8Its\"><p class=\"p--has-dropcap\" id=\"ZBoXhU\">Like a lot of DAOs, Spice DAO is organized largely around a Discord server and a polling site called Snapshot. A four-person core team manages the server, the treasury, and real-world logistics like storing the <em>Dune</em> bible. The group periodically puts decisions to a community vote on Snapshot, where holders pledge a token called $SPICE toward their chosen answer.</p><p id=\"GgVgUe\">In December of 2021 before the group’s first vote, Spice DAO’s organizers announced it was creating an “animated space opera” in partnership with another DAO called the Film Society of San Gaspare. (Spice DAO’s lead strategist is also the head of yet another DAO called the Remilia Collective, so it’s DAOs all the way down.) Expanding Spice DAO’s mission was a way of carrying forward the group’s enthusiasm for <em>Dune</em> and putting its collective treasury to good use. And the first governance vote affirmed the plan, including hiring a production house called Roble Ridge to create a treatment of the series.</p><div id=\"araBr5\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Crypto brain is spending $2mil+ on an art book and thinking it gives you the IP rights to Dune <a href=\"https://t.co/daoYrQvuxT\">https://t.co/daoYrQvuxT</a></p>— guy online (@fellawhomstdve) <a href=\"https://twitter.com/fellawhomstdve/status/1482764098186137606?ref_src=twsrc%5Etfw\">January 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"VpZEIy\">Spice DAO recapped its goal as an “original animated limited series inspired by the book” — a phrase that many outsiders (and plausibly some members) interpreted as a literal <em>Dune</em> adaptation. It was also seeking the legal rights to put Jodorowsky’s script bible online, and observers read the two separate projects as a single copyright mess. In reality, the core team had already said it had no plans to film <em>Dune</em>. “Dude we aren’t using <em>Dune’s</em> IP [intellectual property] to make the animated film,” Saqib told one member in a December chat. The group eventually published an FAQ saying the book and series “have nothing to do with each other” and the latter wasn’t an adaptation of Jodorowsky or Herbert’s work — it would just have, for lack of a better term, <em>Dune</em> vibes.</p><div class=\"c-float-left c-float-hang\"><aside id=\"r9110N\"><q>“Dude we aren’t using <em>Dune’s</em> IP to make the animated film”</q></aside></div><p id=\"EqZEYR\">Part of Spice DAO’s original momentum came from the <em>Dune</em> bible’s elusiveness. Jodorowsky made several copies of the book, and they’ve sold in the past at far lower prices. But it’s never been officially published, and while some sections are <a href=\"https://www.duneinfo.com/unseen/jodorowskys-dune-uncovered\">readily available online</a>, more complete scans are passed around the internet with a slightly illicit air. The members admitted in <a href=\"https://www.buzzfeednews.com/article/amansethi/spicedao-dunedao-soby\">an early <em>BuzzFeed</em> interview</a> that they couldn’t simply release the book online, but scanning it and making it as widely viewable as possible remains one of Spice DAO’s core missions.</p><p id=\"cLfiwG\">Based on Discord messages and conversations with a few $SPICE holders, that’s still many people’s paramount goal. One member, Tyler Mincey, says his position is “pretty simple:” Spice DAO should take care of securing, scanning, and sharing the book as much as possible before taking on any other projects. “It’s fine that this group of people who came together for a primary purpose ended up with more pooled resources to do other projects like an animated series, but we should achieve that primary purpose first.”</p><p id=\"ipW1FK\">It’s still not quite clear what scanning and sharing the book will ultimately entail, nor how much of the DAO’s roughly $3 million in remaining Ethereum — according to its <a href=\"https://zapper.fi/account/0x1175185e62db6cea2517d14297333a63908c0cac\">public treasury ledger</a> — it will require. As of earlier this month, the bible was in Paris awaiting shipment to Delaware, after which it’s going to a climate-controlled art storage facility once the DAO sets up formal corporations and a bank account to make payments. The budget outline estimates storage and insurance will cost around $30,000 annually, plus fees for shipping and potential physical exhibition — which, at this point, might be the only risk-free way of sharing the whole book.</p><p id=\"hUJmAC\">Around that January vote, Spice DAO had hit a rough patch. The value of the $SPICE token had cratered alongside a worldwide crash in cryptocurrency, including Ethereum, which Spice DAO used to store its funds. (Disclosure: I purchased a little under 60,000 $SPICE for $30 in the process of reporting this story. I sold it before this article’s publication for $8.) They had also failed to get approval for putting scans of the book online, a key reason lots of people supported the project.</p><div class=\"c-float-right c-float-hang\"><aside id=\"DxLGMb\"><q>Spice DAO reassured readers that it wasn’t going to burn the book</q></aside></div><p id=\"FsR1mI\">The group’s forums lit up with drastic and quickly abandoned member proposals. They included a nixed plan that involved minting an NFT for every page of Jodorowsky’s bible and then burning the physical copy, leading the organizers to post a Discord message reassuring visitors they weren’t going to destroy the book.</p><p id=\"Dt0UNK\">The animated series, meanwhile, had become a point of tension between the core team and some backers. The organizers posted a Roble Ridge pitch for a series tentatively titled <em>Vengeance on Planet Zug</em>, including a rough draft of a potential pilot script. The script follows a protagonist with a burning desire for vengeance (naturally) and an “oversized sword,” which he uses to messily slaughter a bar full of people in an “extremely gore-heavy sequence” before throwing it across a room to impale a man against a wall. </p><p id=\"K4LsuQ\">The community response was less than thrilled. (“Sorry but what the hell is this,” said one DAO member in the group’s Discord.) The core team said <em>Zug</em> was just an early effort intended to get potential partners excited, but members questioned why they’d selected Roble Ridge without giving the DAO other options, noting that the production house had little clear experience making animation or TV. They also wondered why, in a decentralized organization, they hadn’t gotten a say in something as important as their series’ premise.</p><div class=\"c-float-left c-float-hang\"><aside id=\"ZqQ2p2\"><q>“An extremely gore-heavy sequence”</q></aside></div><p id=\"7tnSTn\">A day later the DAO shifted direction. Instead of hiring scriptwriters to produce an idea with worthy <em>Dune</em> vibes, the group would solicit short proposals in a contest and $SPICE holders would pick their favorites.</p><p id=\"PIwvBq\">The winner would take home $15,000 in USDC, a <a href=\"https://en.wikipedia.org/wiki/Stablecoin\">stablecoin</a> pegged to the US dollar, in exchange for signing over the rights to their story bible to be produced by the DAO. Two runners-up would get $5,000 and $2,500 to sign over the rights for potential future projects. Based on an earlier agreement, Roble Ridge would still out-earn all of them, receiving $35,000 from the DAO for <em>Planet Zug </em>and broader pre-production work.</p><hr class=\"p-entry-hr\" id=\"4KVDsO\"><p class=\"p--has-dropcap\" id=\"HycDRe\">Where a lot of crypto collectives involve <a href=\"https://www.theverge.com/22785051/nft-collectibles-intellectual-property-decentralized-disney\">loose fandoms or fairly traditional creative teams</a>, Spice DAO’s founders laid out a roadmap for an outsourced animated series. The winning entry would be adapted by a professional screenwriter into a full-fledged script. The script would be shopped to streaming services that could help fund production at an outside animation studio. Ideally, Spice DAO would retain all intellectual property rights and could finance pitches for other <em>Dune</em>-ish projects if it was successful. Big decisions would be approved via Snapshot votes, theoretically creating a community-owned creative fund. And it would all start with the story vote — which took place in early February, when $SPICE-holders distributed their coins between 14 motley series pitches.</p><p id=\"jH3fKm\">I spoke with a handful of entrants during and after the contest, including two of its winners. None were particularly huge fans of <em>Dune</em> or had more than a vague familiarity with Jodorowsky. None even owned Spice DAO tokens at the time we talked, although one belonged to a writing team that included a $SPICE-holder. Given that the “bibles” were supposed to clock in at 2,000 words or less, most of them had submitted on a whim.</p><div class=\"c-float-left c-float-hang\"><aside id=\"QMK8E1\"><q>“I realized there’s some actually cool people to talk to here and I just tried to chill”</q></aside></div><p id=\"eoGRE5\">The author of an entry called <em>Biosun System</em> applied after a friend had told him about the writing contest, submitting a story he’d created for a tabletop roleplaying scenario. Fledgling freelance writer Tyler Macready, whose pitch <em>Ordained</em> won third place, had joined the DAO’s Discord to dunk on its members and then been won over. “I realized there’s some actually cool people to talk to here and I just tried to chill. I just kind of stuck around,” he told <em>The Verge</em>. “I’m not going to be fussy — as long as I get credit, and it’s something that I can point to and say, ‘hey, I did that,’ that’s kind of good enough for me where I am right now.”</p><p id=\"s9iWmB\">The winning pitch <em>Dolkoroth</em> came from a formal four-person group known as the Lorecrafter’s Guild, which is part of the development team for a “blockchain MMORPG” called <em>Pills</em>. The technical details of <em>Pills</em> are under wraps, but like Spice DAO, the group also hopes to build its own extended narrative universe by recruiting outside artists. In an interview, the lead writer — who goes by Default Triangle — said the guild would be putting its $15,000 back into <em>Pills</em> development. “We’re going to take the money and use it to explore more narratives, essentially.”</p><p id=\"UXvJi7\">The entrants described a lighthearted camaraderie that belied the remarkable amount of money tied up in Spice DAO. “There was a lot of encouragement across the board, which was fantastic to see. I was expecting more of a rivalry to happen, but it was very exciting to see people encouraging one another,” said Default Triangle. The Discord moderator set up a writer’s room for people to swap ideas and workshop each other’s pitches; in the last messages before it was shut down, entrants were congratulating each other on their wins and commiserating about their losses.</p><hr class=\"p-entry-hr\" id=\"MxRvVJ\"><p class=\"p--has-dropcap\" id=\"gaHoJt\">It’s easy — as with lots of crypto projects — to still be supremely cynical about this entire process. For one thing, writing competitions often include exploitative terms and appeal to inexperienced artists who don’t understand the rights they’re giving up. The publicly posted rules for Spice DAO’s contest were extraordinarily vague; the team only confirmed that entrants would even receive story credit after Macready asked about it.</p><p id=\"MewXQV\">DAO polling also isn’t necessarily as populist as it might sound — more like a corporation with large and small shareholders. As one $SPICE holder I spoke with pointed out, votes are often decided by a handful of people with lots of coins. In the writing contest, for instance, a single account controlled more than half the coins that were pledged, while four accounts controlled 90 percent of them. (While the crypto world is small and the opportunities for fraud vast, there’s no evident connection between these accounts and the winning entries.) The vast majority of $SPICE — including mine — didn’t get used at all. “Voter turnout is abysmal in anything that requires participation. DAOs are no different,” the member, who tweets under the name SchemeDream, noted.</p><div class=\"c-float-right c-float-hang\"><aside id=\"4nV6X2\"><q>There’s a profound question at the heart of many crypto projects: Do they really need a blockchain?</q></aside></div><p id=\"trqDvA\">Even if you overlook all the logistical complications, there’s a more fundamental question: Is a blockchain the best way to handle this whole process? Organizations — including creative collectives — have maintained membership records, raised money, and taken online votes for years through more traditional means. <a href=\"https://www.theverge.com/22944579/crypto-bitcoin-internet-law-nft-tiktok-dances-tonya-evans-interview\">DAOs are in legally murky territory</a> without a formal corporate structure backing them; an unorganized one could have trouble defending a copyright or leave all members liable for damages in a lawsuit. The Spice DAO core team declined to comment on its plans for legally managing its intellectual property in a Twitter direct message, then declared the fact that it had declined to comment was off the record, an arrangement <em>The Verge</em> had not agreed to.</p><p id=\"7IoUef\">For all that, watching the contest was oddly charming. Spice DAO’s stakes are low compared with crypto behemoths where people have tied up full-time jobs or investment portfolios — more like a Kickstarter project than a minor national economy. (For scale, it was slightly out-earned by a 2014 campaign for a <a href=\"https://www.theverge.com/2019/12/9/21003445/coolest-cooler-update-business-tariffs-kickstarter\">multipurpose cooler</a>.) Crypto hype has enabled a lot of genuine ugliness including its negative environmental impact, but it’s encouraged experiments that mix art, tech, and online communities. Whether or not they technically need a blockchain, it’s not clear they’d have been formed without its organizing structure.</p><p id=\"ZSZELe\">Jodorowsky is known as the consummate cinematic auteur, and it’s a little ironic for his singular vision to become the inspiration for an attempt at a distributed filmmaking project managed by a collection of near-strangers united by a shared cryptocurrency, based on a treatment written by a team of narrative designers for a crowdsourced cinematic universe. Then again, Jodorowsky’s <em>Dune</em> departed dramatically from Frank Herbert’s own vision, so maybe it’s not such a stretch.</p><div class=\"c-float-left c-float-hang\"><aside id=\"az00zO\"><q>The consummate cinematic auteur’s vision is being honored by a collective of near-strangers</q></aside></div><p id=\"EbGmV1\">And <em>Dolkoroth</em>, Spice DAO’s contest winner, sounds legitimately fun. It’s about the last member of a priesthood whose members are implanted with spaceship-powering batteries looking for a long-deserted Earth (where he’s convinced he’ll find God) and teaming up with a young “space barbarian” along the way. Where a lot of crypto media seems made for community insiders, <em>Dolkoroth</em> is the kind of thing I would actually watch, assuming a properly hallucinatory art style.</p><p id=\"5yyhhA\">It’s still a very long shot for <em>Dolkoroth</em> to ever make it to the screen. Last week, the Spice DAO team announced it was in “advanced negotiations with a blue-chip Los Angeles animation studio and the screenwriter of a hit Netflix show” to create the series, saying it plans to take a vote on a potential deal in early March. But that still puts it in the very earliest stages of development — a stage where countless series from more experienced teams have been abandoned.</p><p id=\"BfEyuR\">Default Triangle allows that the Spice DAO’s project is a stretch. But he’s willing to hope. “I’d love to see a faithful adaptation of this,” he says. As for the DAO’s big ambitions, “I think every project in the crypto space has been super ambitious. But the thing about that is that there’s going to be some projects that fall short of that, and there’s going to be some projects that succeed. I personally think that Spice DAO’s going to be one of the projects that succeed.”</p><p class=\"c-end-para\" id=\"EBpLOq\">And if it fails, they can always call <em>Dolkoroth</em> the greatest crypto series never made.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/oiL0xwm_G0vqKtgkCmZjnkYgHnU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23272030/acastro_220207_5009_0001.jpg",
  "description": "The quest for a crypto sci-fi epic.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}