{
  "title": "Thief steals $1 million of Bored Ape Yacht Club NFTs with Instagram hack ",
  "url": "https://www.theverge.com/2022/4/25/23041415/bored-ape-yacht-club-nft-hack-instagram",
  "date": "2022-04-25T18:36:22.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"An illustration of a Bored Ape at the center of a vortex pulling in Meebits and CryptoPunks.\" src=\"https://cdn.vox-cdn.com/thumbor/N1U3Rin9AR0UN3RlqoXocNzal7c=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70791629/acastro_2203011_5082_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1DPTqH\">A hacker has stolen NFTs worth millions of dollars after compromising the official Instagram account for Bored Ape Yacht Club (BAYC) and using it to post a phishing link that transferred tokens out of users’ crypto wallets.</p><p id=\"p3ED5P\">The hack was <a href=\"https://twitter.com/BoredApeYC/status/1518590210686308354\">disclosed on Twitter by BAYC</a> just before 10AM ET on Monday morning. “There is no mint going on today,” the Tweet read. “It looks like BAYC Instagram was hacked.”</p><div id=\"VI4RMo\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> There is no mint going on today. It looks like BAYC Instagram was hacked. Do not mint anything, click links, or link your wallet to anything.</p>— Bored Ape Yacht Club (@BoredApeYC) <a href=\"https://twitter.com/BoredApeYC/status/1518590210686308354?ref_src=twsrc%5Etfw\">April 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"Z81wQP\">Another <a href=\"https://twitter.com/jatuur/status/1518590709003173888\">tweet</a> from a user unaffiliated with the project claimed to show the image that had been posted from the BAYC account, promoting an “airdrop” — essentially a free token giveaway — for any users who connected their MetaMask wallets.</p><p id=\"OKzA7d\">Unfortunately, BAYC’s warning came too late for a number of holders of the extremely expensive Bored Ape NFTs, along with many other valuable NFTs stolen in the hack. A <a href=\"https://twitter.com/MoonOverlord/status/1518603843616968704\">screenshot</a> posted by one Twitter user showed an OpenSea page for the hacker’s account receiving more than a dozen NFTs from the Bored Ape, Mutant Ape, and Bored Ape Kennel Club projects — all presumably taken from users who connected their wallets after clicking on the phishing link.</p><p id=\"P1tLy9\">The profile page tied to the hacker’s wallet address was no longer visible on OpenSea at time of publication. OpenSea head of communications Allie Mack confirmed to <em>The Verge</em> that the hacker’s account had been banned on the platform, as OpenSea’s terms of service prohibited fraudulently obtaining items or otherwise taking them without authorization.</p><p id=\"e4ME2O\">But given the decentralized nature of NFT, the contents of the hacker’s wallet can still be viewed on other platforms. <a href=\"https://rarible.com/user/0x8c7934611b6AD70FBEa13A1593dE167a4689b9A9/owned\">Seen through NFT platform Rarible</a>, the wallet contained 134 NFTs, among them four Bored Apes and many others items from projects made by Yuga Labs — the creators of BAYC — such as Mutant Apes and Bored Ape Kennel Club.</p><p id=\"pnWWcL\">Independently, each of the stolen Apes is worth well into six figures based on the most recent sale price. The lowest priced Ape, <a href=\"https://opensea.io/assets/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d/7203\">#7203</a>, last sold four months ago for 47.9 ETH — equivalent to $138,000 at current exchange price. <a href=\"https://opensea.io/assets/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d/6778\">Ape #6778</a> was last sold for 88.88 ETH ($256,200), while <a href=\"https://opensea.io/assets/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d/6178\">Ape #6178</a> sold for 90 ETH or $259,400. And <a href=\"https://opensea.io/assets/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d/6623\">Bored Ape #6623</a> was the most valuable of all, sold three months ago for 123 ETH ($354,500) — meaning that collectively the total value of the four stolen Apes is just over $1 million.</p><p id=\"sYC5ca\">It is not known yet how the hacker was able to compromise the project’s Instagram account. In a statement sent to <em>The Verge</em> by email and also posted on Twitter, Yuga Labs <a href=\"https://twitter.com/BoredApeYC/status/1518637581776437249\">said</a> that two-factor authentication was enabled at the time of the attack and that the security of the Instagram account followed best practices. Yuga Labs also said that the team was actively working to establish contact with affected users.</p><p id=\"ue9Zkr\">Though NFTs can be bought and sold for huge sums of money, they are often held in smartphone wallets rather than more secure environments because the popular decentralized crypto wallet application MetaMask <a href=\"https://metamask.zendesk.com/hc/en-us/articles/360058238591-NFT-tokens-in-your-MetaMask-wallet\">only supports NFT display on mobile</a>. It also encourages users to manage NFTs through the smartphone app rather than the browser-based extension. This means that the use of Instagram to deliver a phishing link is an effective way to steal NFTs, as the phishing link is more likely to be interacted with from a mobile wallet.</p><p id=\"xBTUr6\">While security advice in the crypto space suggests NFT holders never connect their wallet to an unknown or untrusted third party, the fact that the phishing link was sent through the official BAYC social media account likely convinced the victims that it was legitimate, raising difficult questions about where exactly the fault lies.</p><p id=\"qhLoLf\">Yuga Labs did not respond to an email from <em>The Verge </em>asking whether victims of the hack would be compensated by the project for their losses.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rVEmV_irhLRha08S9D3dyv1AKOI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23307862/acastro_2203011_5082_0001.jpg",
  "description": "Just one of the stolen Apes was worth over $350,000.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}