{
  "title": "This robot gripper is delicate enough to pick up an egg yolk without breaking it ",
  "url": "https://www.theverge.com/2022/1/31/22910269/robot-gripper-kirigami-egg-yolk-north-carolina-state",
  "date": "2022-01-31T14:43:43.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jQYAXRAQNyL5-M3YG2GKuVaWeo0=/0x43:1000x710/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70452980/Jie_Yin_gripper_yolk_CROPEDIT.0.png\" />        <figcaption><em>The gripper is made from a specially cut kirigami sheet that folds up into a 3D enclosure. </em> | Image: Hong et al, Nature Comm (2000)</figcaption>    </figure>  <p id=\"SBtyy3\">Designing robots that can handle fragile items is a big challenge for engineers. For warehouses, robots have been developed that use <a href=\"https://www.theverge.com/circuitbreaker/2017/10/8/16435314/edible-robot-fingers-technology-food\">soft rubber fingers</a> to grab items like fruit, but what about targets that are even more delicate? Like, say, a raw egg yolk?</p><p id=\"lzmldo\">Well, researchers from North Carolina State University have <a href=\"https://news.ncsu.edu/2022/01/kirigami-robotic-grippers/\">demonstrated</a> a new type of gripper that could one day help machines pick up even the most breakable items — including yolks. Inspired by the Japanese art of kirigami (like origami, but you fold <em>and</em> cut the paper), their gripper is made from flat sheets of material cut with parallel slits. When the ends of the sheet are pulled apart, the gripper forms itself into a 3D sphere that can be used to gently and precisely grab objects, from live fish to single strands of human hair. </p><p id=\"acmkTr\">The key to the design (which you can see in action in the video below) is that it applies minimal pressure on its target and encloses it within the kirigami shape.</p><div id=\"Z9FfJ0\"><div ><iframe src=\"https://www.youtube.com/embed/1oEXhKBoYc8?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><div class=\"c-float-right\"><aside id=\"pn8MRa\"><q>“our grippers essentially surround an object and then lift it”</q></aside></div><p id=\"VYM1rN\">“Conventional grippers grasp an object firmly — they grab things by putting pressure on them,” Jie Yin, an associate professor at NC State and one of the researchers involved in the project, said in a <a href=\"https://news.ncsu.edu/2022/01/kirigami-robotic-grippers/\">press release</a>. “That can pose problems when attempting to grip fragile objects, such as egg yolks. But our grippers essentially surround an object and then lift it — similar to the way we cup our hands around an object. This allows us to ‘grip’ and move even delicate objects, without sacrificing precision.”</p><p id=\"vGPnKm\">The researchers’ work, which was <a href=\"https://www.nature.com/articles/s41467-022-28187-x#Sec1\">published in an open-access paper in <em>Nature Communications</em></a>, draws heavily on their ability to predict the final shape of a gripper from the shape of the original kirigami sheet. So, for example, a 2D kirigami sheet with a circular boundary will, when cut correctly, fold into a sphere. Using 3D simulation software, they were able to rapidly prototype a number of different grippers before finalizing their design. </p><p id=\"Fit20d\">This proof-of-concept work is not yet ready to be used in commercial settings, but the engineers say they’re working on the next step of developing the technology. “We’re now in the process of integrating this technique into soft robotics technologies to address industrial challenges,” says Yin. “We’re open to working with industry partners to explore additional applications and to find ways to move this approach from the lab into practical use.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LTdpj7dZjoOEOKP5yEJ3-9mIblw=/0x114:1000x638/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23206843/Jie_Yin_gripper_yolk_CROPEDIT.png",
  "description": "They can grab an egg yolk, a live fish, or even a single hair.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}