{
  "title": "This firm made Republicans go viral — now it’s falling apart",
  "url": "https://www.theverge.com/2022/4/20/23033650/arsenal-media-group-campaign-marketing-firm-madison-cawthorn-kari-lake-benny-johnson",
  "date": "2022-04-20T17:06:00.000Z",
  "author": "Makena Kelly",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/yO9IyA6Qzavy6U0yeGL1MGKT5I8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70772152/acastro_220415_5148_0001.0.jpg\" />        <figcaption>Photo illustration by Alex Castro / The Verge; Jason Davis / Getty Images</figcaption>    </figure>  <p>Some workers were paid late, while others were berated by Benny Johnson</p> <p class=\"p--has-dropcap\" id=\"TgmFl9\">In the breathless world of conservative online politics, Arsenal Media is here to help you go viral. Co-founded by gadfly meme enthusiast Benny Johnson, the firm lists clients like Rep. Madison Cawthorn and Dana Loesch and takes credit for more than doubling Donald Trump Jr.’s Facebook following. </p><p id=\"xlt2dA\">Most enticing, it seems to offer a tried-and-true playbook for making content hit it big. One slide from a pitch deck viewed by <em>The Verge</em> describes a “viral influencer network” as the secret to making client content take off, showing a single video being passed around by a network of friendly faces. “This organic distribution network serves as the vehicle your client needs to ensure that it reaches its intended audience,” one document promises.</p><p id=\"vNXfQr\">Much of the pitch hinges on Johnson himself, who features heavily in the deck. With his background at <em>BuzzFeed</em> (where he left amid a plagiarism scandal) and Ben Shapiro’s <em>Daily Wire</em>, it’s easy to think he’s hit on the secret formula for making conservatives go viral.</p><div class=\"c-float-right c-float-hang\"><aside id=\"W7rRkc\"><q>Arsenal’s pitch deck describes a “viral influencer network” </q></aside></div><p id=\"OwzB5x\">But while that pitch has made Arsenal one of the most talked-about campaign shops in Republican politics, workers inside the company tell a different story. Six former employees who spoke to <em>The Verge</em> described a chaotic working environment, rife with internal bullying, toxic HR practices, and an intense culture of secrecy. That uncertainty has seen three employees leave the company in the last two weeks, and many insiders suspect the company’s problems are just beginning.</p><p id=\"dtQciB\">Most urgently, some contractors say they aren’t being paid. Karl Slater started doing freelance editing work for Arsenal in May 2021 — but he quickly noticed irregularities in the way the company handled money.</p><p id=\"IuoMDU\">“Invoices should be sent to [CEO] Jason Cole, but I would suggest you cc me,” an Arsenal worker wrote to Slater in an email obtained by <em>The Verge</em>. “Also – I have noticed that it seems easier for him to pay via PayPal.”</p><p id=\"mpdgja\">Soon, the invoices had run up to $8,795, and they were still going unanswered. Slater issued a formal demand the next month and then took the issue to court, winning a judgment the following November. <em>The Verge</em> spoke with Cole, who declined to make an on-the-record statement but agreed to have specific factual claims attributed; he insists he paid the invoice as soon as he became aware of the judgment, and he produced evidence indicating payments had been obtained by a collection agency earlier this month. But, as of publication, Slater says he has yet to receive any of the money, and the Second Judicial District Court in Minnesota still lists the case as unresolved, a clerk said on Wednesday.</p><hr class=\"p-entry-hr\" id=\"lZSNuZ\"><div id=\"bmH7b1\"><div data-anthem-component=\"gallery:11152783\"></div></div><p id=\"pVqTb4\">Arsenal’s biggest hit came in the summer of 2020 when it started working for Kim Klacik, a Black Republican running to fill the Baltimore congressional seat left open after the death of Rep. Elijah Cummings. Arsenal’s Klacik ad showed the then-candidate walking through impoverished areas of Baltimore. The visuals were unusual for a Republican campaign, including glitchy jump cuts and an ESPN-like flare, promoting a provocative campaign slogan: Black lives don’t matter to Democrats.</p><p id=\"ke09Ms\">As promised, the ad went viral, racking up over 4 million views on Twitter in less than a day, <a href=\"https://nypost.com/2020/08/18/republican-kim-klacik-shows-reality-for-black-people-in-ad/\">according to the <em>New York Post</em></a>. Those views translated into real money, raising more than $8 million for Klacik’s campaign. </p><div class=\"c-float-left c-float-hang\"><aside id=\"iDOkOk\"><q>“It’s almost like Captain Ahab in <em>Moby-Dick</em>.”</q></aside></div><p id=\"sn4C9k\">For the campaign shops involved with the ad, it was a jackpot. <a href=\"https://www.washingtonpost.com/local/md-politics/klacik-gop-campaign-donations/2021/03/02/76300fde-7077-11eb-85fa-e0ccb3660358_story.html\">A report from <em>The Washington Post </em>uncovered</a> an unusual deal behind the ad: the marketing firm promoting the video, Olympic Media, was set to receive up to 70 percent of the money generated from it, more than $4 million. Arsenal took a smaller cut but still ended up with a significant windfall from the ad. </p><p id=\"wgv3Mx\">As a political figure, Klacik didn’t go far: running in a district with a 27-point advantage for Democrats, she ultimately lost by more than 40 points. But the ad’s success showed the massive potential for viral conservative candidates — and how the money generated could be directed back to contractors instead of campaigns. Arsenal started taking on more clients with long odds and off-beat profiles, hoping to repeat the same fundraising strategy.</p><p id=\"NBfiUO\">“They go find the not-so-typical-looking Republican and run them for office and try to recreate the magic,” one former employee told <em>The Verge</em>. “They’re always on the hunt for that next one. It’s almost like Captain Ahab in <em>Moby-Dick</em>.”</p><p id=\"WV2vMW\">The company’s unusual relationship with campaigns doesn’t stop with the atypical fundraising split. Arsenal’s general consulting contracts, one of which was viewed by <em>The Verge</em>, stipulate that the company will have “exclusivity over the hiring of senior staff, consultants, and vendors with the prior approval of the Client” and would train these campaign staffers “for their necessary responsibilities.” </p><div class=\"c-float-right c-float-hang\"><aside id=\"06uiZ1\"><q>Johnson has begun to distance himself from the company</q></aside></div><p id=\"aej3qA\">The terms are highly unusual in political campaigning because of the self-dealing concerns raised by such an arrangement. In an interview with <em>The Verge </em>on Tuesday, Cole said that this contract language has been updated to clarify that clients have more control over the hiring of staff. <em>The Verge </em>has not been able to confirm this change</p><p id=\"1JNRYS\">Even with those terms, the firm has had no trouble attracting high-profile candidates. Last year, Arsenal worked with Kari Lake, a Trump-backed Republican candidate for Arizona governor, and Rep. Madison Cawthorn (R-NC), receiving over $80,000 per candidate, according to Federal Election Commission (FEC) records.</p><p id=\"BKE8NZ\">Despite the firm’s lofty contracts with high-profile Republican candidates, employees told <em>The Verge </em>that they were overworked and underpaid — if they were paid at all.</p><p id=\"IRTmHs\">Since Arsenal’s founding, payroll has been a mess, employees say. According to them, Cole rarely used official payroll software, opting to pay employees over online payment processing apps like PayPal or Venmo. While some companies pay contractors over these apps, one full-time staffer said they never signed tax documents when they began work and received a majority of their salary over these apps. Using these apps does not absolve a company from their tax reporting requirements, and it can be a terms of service violation to use these apps for payroll if a business is not properly registered with the app.</p><p id=\"98TJHA\">Several employees said that Cole has yet to provide them with any W-2 or 1099 paperwork they may need to file their taxes this year. Cole told <em>The Verge </em>on Tuesday that every employee is required to fill out W-4 and I-9 paperwork before they’re ever paid. (Multiple sources contradict these claims.) He did not deny sometimes issuing late payments.</p><p id=\"QFMThg\">Curiously, Johnson has begun distancing himself from the company. As recently as April 1, Johnson’s website listed him as both co-founder and chief creative officer of Arsenal. But the language disappeared from Johnson’s site after the release of <a href=\"https://puck.news/woke-war-iii-pence-desantis-battle-for-cancellation/\">a <em>Puck </em>article</a> detailing his association with Arsenal, and he has denied any formal employment with the company following its publication.</p><p id=\"ecLCKn\">Responding to a request for comment from <em>The Verge </em>on Tuesday, a Johnson spokesperson credited him with, “casting the vision for what the company could become” and said, “It’s probably true that Arsenal wouldn’t have come into being without Benny’s input early on in the company’s formation.” </p><div class=\"c-float-right\"><aside id=\"CarhMi\"><q>“I hadn’t been screamed at like that since I was probably seven years old”</q></aside></div><p id=\"TVfQQh\">Still, the spokesperson insisted there was no formal relationship between Johnson and Arsenal, saying, “He is not currently, nor has ever been an owner, executive, or even employee of Arsenal Media.” Cole put it even more starkly, saying Johnson began as a contractor and had not been involved with the company’s operations in over a year.</p><p id=\"w1UuR5\">But there’s reason to think these statements may be understating Johnson’s role with Arsenal, at least as of this year. Workers told <em>The Verge </em>that, as recently as January, Johnson had both referred clients to the company and led creative work under the company’s name.</p><p id=\"6IdCxX\">The confusion is particularly strange given the outsized role Johnson appears to have played in office life. Former employees describe Johnson bullying or humiliating staffers if video shoots or client work didn’t go as planned, often on the company’s internal Telegram chats. </p><p id=\"vOZ4x0\">Johnson can be “very abusive, very toxic, screaming at people, like using profanity, vulgarity, making women cry, like pushing them to the edge,” one former worker said. “I hadn’t been screamed at like that since I was probably seven years old on the playground.”</p><p id=\"iMyDuZ\">In one incident, a source told <em>The Verge</em> that Johnson screamed at a female employee over the phone as she was boarding a flight to Las Vegas in September 2020 to attend a video shoot. Johnson’s issue with the employee is unclear, but he allegedly demanded that the staffer apologize to himself, his wife, and his newborn daughter. The staffer in question did not comment on the matter.</p><p id=\"Jwp56m\">“Benny can be a tough director, there’s no question,” a Johnson spokesperson said when confronted with the claims. “That level of stress isn’t for everyone, but it’s also what has helped make Benny successful.” Neither Johnson nor Cole confirmed or denied the September 2020 phone call to the female staffer.</p><p id=\"ASqmzn\">Still, the pressures have led the company to shed staff just as the midterm election cycle is heating up. <em>The Verge </em>confirmed that three employees have<strong> </strong>left Arsenal over the last two weeks, although the specific reasons for the departure are unclear.</p><p id=\"ata5lu\">Meanwhile, contractors like Slater are still struggling to get paid. Earlier this year, Slater obtained a writ of execution against Cole, allowing law enforcement officials to seize payment for his debt — but Arsenal does not publicly disclose either the company or Cole’s accurate address, so the request has yet to be executed, Slater says.</p><p id=\"K8tEO6\">According to Arsenal’s website, the company is currently hiring a graphic designer, among other roles. And applicants like Slater are still drawn to the image the company creates. </p><p class=\"c-end-para\" id=\"3KJewg\">“Arsenal got the content production and content delivery aspect of the ad game. They nailed that,” one former employee said. “But they really, really fucked up the politics of it all.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-_Mfme4bb2Usq271nSbddHjlXog=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23403481/acastro_220415_5148_0001.jpg",
  "description": "Benny Johnson yelled at staff who say they weren’t paid on time",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}