{
  "title": "This Earth Day, cut through the corporate climate hype",
  "url": "https://www.theverge.com/23036346/earth-day-corporate-climate-change-goals-greenwashing",
  "date": "2022-04-21T22:30:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"BRITAIN-US-AMAZON-PROTEST\" src=\"https://cdn.vox-cdn.com/thumbor/31MBNF8j-LUiGKvfCt9hJ8p6CmU=/0x0:3800x2533/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70778426/1236815972.0.jpg\" />        <figcaption>An activist from the Extinction Rebellion (XR) climate change group, wearing a mask depicting Jeff Bezos, takes part in a protest outside of Amazon’s headquarters in central London on November 26, 2021. | Photo by TOLGA AKMEN/AFP via Getty Images</figcaption>    </figure>  <p>A lot of companies talk green this time of year — here’s what to look for in their pledges</p> <p class=\"p--has-dropcap p-large-text\" id=\"BeJkZp\">With Earth Day around the corner, it’s that time of the year again, when companies start doling out sustainability pledges like candy. Unfortunately, some of those promises can be misleading. So,<em>The Verge</em> spoke with sustainability experts for tips on how to tell whether or not a climate pledge is legit. They also shared advice on what companies should aspire to if they want to have a meaningful impact on climate change.</p><p id=\"acykSF\">It truly is tough to suss out stronger corporate climate pledges from weaker ones. Most companies just aren’t transparent enough on what the climate commitments entail. And even if there is fine print, it’s definitely not fun to sift through. </p><div class=\"c-float-right c-float-hang\"><aside id=\"p27RL9\"><q>Some of those promises can be misleading. </q></aside></div><p id=\"0TpLjb\">“They’re not as easy as calories on a package — where we can look at two packages in the grocery store and say this one’s got fewer calories and make a decision,” says Glen Dowell, a professor at Cornell who researches corporate sustainability. </p><p id=\"B4eDAt\">There are some databases out there, however, that can help break things down for consumers. Dowell recommends the nonprofit <a href=\"https://www.cdp.net/en/companies/companies-scores\">CDP</a>, formerly called the Climate Disclosure Project. CDP scores companies with letter grades, A through D- (like in school), when it comes to their action on climate change. But that only includes about 12,000 companies that agree to participate and share their environmental data. </p><p id=\"lS3gur\">There’s another tool called the <a href=\"https://www.zerotracker.net/#companies-table\">Net Zero Tracker</a> that assesses close to 2,000 companies with net zero pledges, which has information on some companies like Amazon that haven’t made their data available through CDP. The tracker was created by research labs out of University of North Carolina-Chapel Hill and Oxford and a couple nonprofit environmental organizations. They even created a helpful <a href=\"https://twitter.com/netzerocheck\">Twitter bot</a> last month that tweets out its assessments of environmental pledges. </p>  <figure class=\"e-image\">        <img alt=\"environment-wireless-internet-retail-distribution-strike\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cCUzPwP1Dt-KNIHLWrrLd5x3Rxs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407671/1169912961.jpg\">      <cite>Photo credit should read JASON REDMOND/AFP via Getty Images</cite>      <figcaption>Amazon Employees for Climate Justice lead a walk out and rally at the company’s headquarters to demand that leaders take action on climate change in Seattle, Washington on September 20, 2019. </figcaption>  </figure><p id=\"IVDwzy\">But some people may want try to assess a company’s pledges on their own. Here are just a few key points for the environmentally-minded consumer to watch for as they try to sort out green pledges from greenwashing: </p><h3 id=\"JeCNAS\"><strong>What emissions are they focused on?</strong></h3><p id=\"n7V2aO\">You might have recently seen a company set a goal of reaching “net zero” greenhouse gas emissions, or announce that it’s become “carbon neutral.” But what do these buzzwords actually mean?  </p><p id=\"eye6YD\">At face value, a net-zero pledge means that the company won’t pump out more greenhouse gas emissions than it can either offset or remove from the atmosphere. Ideally, for Alberto Carrillo Pineda, managing director and co-founder of the Science Based Targets initiative, that commitment includes all greenhouse gas emissions — from carbon dioxide to methane. Carbon neutral commitments, on the other hand, can be more limited. As “carbon” implies, these are typically more narrowly focused on zeroing out only carbon dioxide emissions, even though that term is often used interchangeably with “net zero.” </p><p id=\"sxH6RJ\">But there’s a lot more to consider beyond definitions. Carillo Pineda’s initiative, a partnership between several environmental organizations including CDP, assesses climate pledges from companies, and broad long-term goals like shooting for “net zero” are only the start. </p><div class=\"c-float-right c-float-hang\"><aside id=\"HDN5DI\"><q>“We need to go beyond embracing net zero”</q></aside></div><p id=\"EA5uOn\">“Certainly there has been an explosion of net-zero commitments,” Carillo Pineda tells <em>The Verge</em>. That’s a good thing, he says. “But we need to go beyond embracing net zero as a long term ambition, and we need to translate that into tangible targets.”</p><h3 id=\"umDHqA\"><strong>What’s the scope of their pledge? </strong></h3><p id=\"pItp9l\">The next thing to look at is how expansive a particular pledge is. Take Intel’s recent <a href=\"https://www.intel.com/content/www/us/en/newsroom/news/net-zero-greenhouse-gas-emissions-operations.html\">pledge</a> to reach net-zero greenhouse gas emissions by 2040, for example. That target takes aim at pollution from the company’s “global operations.” It includes emissions that come directly from the company’s own facilities and vehicles, as well as pollution generated from its use of electricity. In industry speak, these are called <a href=\"https://www.epa.gov/climateleadership/scope-1-and-scope-2-inventory-guidance\">Scope 1 and Scope 2</a> emissions, respectively. This is the pollution that companies refer to when they talk about cleaning up their “operations,” and it’s actually just a small fraction of Intel’s total carbon footprint. </p><p id=\"0DnDtz\">For most companies, experts say, the vast majority of their emissions come from their supply chains and the use of their products and services. These are called Scope 3 emissions. Intel’s Scope 3 emissions were more than <a href=\"http://csrreportbuilder.intel.com/pdfbuilder/pdfs/CSR-2020-21-Full-Report.pdf\">10 times as large</a> as its Scope 1 and 2 emissions combined in 2020. </p><p id=\"BSAKwq\">The company says in its net zero <a href=\"https://www.intel.com/content/www/us/en/newsroom/news/net-zero-greenhouse-gas-emissions-operations.html\">announcement</a> that its strategy for Scope 3 emissions “focuses on partnering with suppliers and customers to take aggressive action to reduce overall emissions.” But those Scope 3 emissions, which make up the majority of the company’s impact on the climate, are technically excluded from its 2040 net zero goal. </p><p id=\"9Huazb\">Intel’s not alone. One <a href=\"https://www.zerotracker.net/analysis/post-cop26-snapshot/\">analysis</a> by the Net Zero Tracker of some 2,000 companies last year found that less than a third of those with net zero pledges actually covered all scope 3 emissions.</p>  <figure class=\"e-image\">        <img alt=\"Apple Builds Solar Projects With SunPower in China\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pot9gc5BrxliHB3Gd1SYQHEj8AI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23407638/539620376.jpg\">      <cite>Photo by Jie Zhao/Corbis via Getty Images</cite>      <figcaption>Aerial view of SunPower Station in Hongyuan county, Sichuan province, southwest China on 24th June 2015. The projects of Sunpower stations at Hongyuan and Zoigê County are the first of Apple’s major solar projects in China. </figcaption>  </figure><p id=\"dpmdtq\">While cleaning up an entire supply chain is a tall order for any company, there are tech giants that have taken on this task. Apple, for instance, includes all three scopes in its <a href=\"https://www.theverge.com/2020/7/21/21332461/apple-carbon-neutral-2030-climate-change\">commitment</a> to have net-zero climate impact by 2030. Earlier this month, it <a href=\"https://www.theverge.com/2022/4/14/23025064/apple-supply-chain-pollution-renewable-energy-climate-goals\">announced</a> that it had pushed over 200 of its suppliers to make Apple products using clean energy. </p><h3 id=\"DEe8Mw\"><strong>How are they reaching their goals? </strong></h3><p id=\"6pDWFE\">When it comes to counting up greenhouse gas emissions, there’s yet another accounting trick to watch out for in companies’ climate pledges. Achieving carbon neutrality or net-zero emissions is essentially a balancing act. Companies can reach that goal through a combination of preventing pollution in the first place, and trying to negate the effects of that pollution on the climate after it’s already been released. </p><p id=\"Jm9hxR\">Relying on the later option is risky, to say the least. So in any strong climate commitment, most — if not all — of the company’s emissions should be prevented in the first place. Carillo Pineda points to an <a href=\"https://www.iea.org/reports/net-zero-by-2050\">analysis</a> by the International Energy Agency that shows that greenhouse gas emissions need to be reduced by upwards of 90 percent by 2050 in order to keep global warming from reaching catastrophic levels. </p><div class=\"c-float-left c-float-hang\"><aside id=\"5m5rHB\"><q>“Most — if not all — of the company’s emissions should be prevented in the first place.”</q></aside></div><p id=\"gkQFB3\">Other strategies, like offsetting emissions by <a href=\"https://www.theverge.com/2020/1/31/21115862/davos-1-trillion-trees-controversy-world-economic-forum-campaign\">planting trees</a> or <a href=\"https://www.theverge.com/2022/4/12/23022343/stripe-alphabet-meta-shopify-mckinsey-launch-carbon-removal-initiative-frontier\">investing in tech to draw down CO2</a>, might play a role in tackling the remaining pollution. But that should serve as a last resort. Many experts say it should be reserved mainly for heavy industry that might not be able to use renewable energy to fire up a kiln, for instance. Besides, offsets have a <a href=\"https://features.propublica.org/brazil-carbon-offsets/inconvenient-truth-carbon-credits-dont-work-deforestation-redd-acre-cambodia/\">checkered past</a> when it comes to their ability to sequester CO2 in the long-term and carbon removal technologies <a href=\"https://www.theverge.com/2022/4/7/23013822/carbon-dioxide-removal-direct-air-capture-climate-change\">have yet to materialize</a> at a scale capable of having a big impact on the climate. For those reasons and more, some environmentalists say ambitious climate pledges should drop the term “net” and focus on achieving zero emissions.</p><h3 id=\"2vVV6b\"><strong>How fast are they moving? </strong></h3><p id=\"JJ1P3n\">We are on a deadline. The world has already warmed by <a href=\"https://earthobservatory.nasa.gov/world-of-change/global-temperatures\">more than a degree</a> Celsius above pre-industrial levels. We’re already <a href=\"https://www.theverge.com/2021/8/9/22613531/climate-change-united-nations-report-extreme-weather-ipcc\">living with the consequences</a> of that, like more violent weather, intense fire seasons, and shorelines slipping into rising seas. The Paris climate accord commits most nations to preventing global warming above 1.5 degrees Celsius. And to do that, according to the <a href=\"https://www.theverge.com/2021/8/9/22613531/climate-change-united-nations-report-extreme-weather-ipcc\">consensus of hundreds of leading climate scientists</a>, the entire world needs to reach net zero greenhouse gas emissions by the middle of the century.</p><p id=\"MC1TkV\">Taking action early is tremendously important on the way towards that global goal. Emissions need to drop roughly in half by 2030, or by nearly <a href=\"https://www.unep.org/news-and-stories/press-release/cut-global-emissions-76-percent-every-year-next-decade-meet-15degc\">8 percent each year</a>. For reference, that’s a bigger drop in CO2 pollution than what the world saw <a href=\"https://www.nature.com/articles/d41586-021-00090-3\">in 2020</a> when COVID-19 brought economies to a standstill. For those cuts to materialize without a horrific global health crisis, economies will need to speed up their transition to clean energy sources like wind and solar.</p><h3 id=\"Tn8Nxi\"><strong>Is the company making progress? </strong></h3><p id=\"2Trrbs\">Some companies made pledges years ago, and it’s worth checking back in on how they’re doing. Companies with climate goals need to be held accountable for making consistent progress on a science-based timeline, Carillo Pineda says. “We need to put the emphasis on this scrutiny as a next step on companies because just committing to net zero is not is not enough,” he says. </p><p id=\"GQTssp\">We’re already seeing companies that have made sweeping climate commitments sell themselves as green even as their greenhouse gas emissions balloon. Amazon <a href=\"https://www.theverge.com/2019/9/19/20873834/amazon-sustainability-jeff-bezos-climate-change-pledge-emissions-paris-accord\">pledged</a> in 2019 to reach net-zero carbon emissions for its operations by 2040, for example. But the company’s carbon footprint actually <a href=\"https://sustainability.aboutamazon.com/about/report-builder\">rose by nearly 20 percent</a> in 2020. Apple, whose climate commitments cover broader scopes of emissions, also struggled to reduce emissions last year. It relied on offsets and carbon removal to keep its overall emissions <a href=\"https://www.apple.com/environment/pdf/Apple_Environmental_Progress_Report_2022.pdf\">flat</a>.</p><div class=\"c-float-right c-float-hang\"><aside id=\"7BfopK\"><q>We’re already seeing companies that have made sweeping climate commitments sell themselves as green even as their greenhouse gas emissions balloon. </q></aside></div><p id=\"3hPLGl\">If a company is not sharing data on its emissions at all, however, that’s probably not a good sign. Sharing limited data about, say, the environmental impact of specific products without data on what’s happening across the entire company, can also be a red flag. Let’s say a brand wants to cut down emissions associated with the a certain product it makes by 25 percent. Well, if it sells 30 percent more of that product than it previously did, then it’s already wiped out those gains, Dowell explains. </p><h3 id=\"3APCrK\"><strong>Drawing conclusions</strong></h3><p id=\"MsXqLW\">Now that you’ve had a crash course in how to read a climate pledge like a pro, what can you do as a consumer? Maybe this information can guide your decisions on which brands you choose to support with your purchases. It’s great to do your own homework before buying something, but don’t get too bogged down by it all. </p><p id=\"IPtB97\">Nothing really beats cutting down our consumption in the first place anyway. And companies have historically made that harder to do by encouraging more shopping, for instance, by designing gadgets that can’t be easily repaired. Luckily, there’s been <a href=\"https://www.theverge.com/23017361/ifixit-right-to-repair-parts-google-samsung-valve-microsoft\">progress</a> on ‘right to repair’ laws that could go a long way towards shrinking companies’ and consumers’ environmental footprint. </p><p class=\"c-end-para\" id=\"V9FzKu\">That’s the kind of systemic change that’s desperately needed to avoid a deeper climate crisis. It’s going to take the right mix of smart policy, concerned consumers, and companies willing to do their part. </p><p id=\"o2eryp\"></p><p id=\"pfBS1i\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AJ6V7duPDHbzw5T5jVyOF2PSS4U=/0x0:4000x2094/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23407484/1236815972.jpg",
  "description": "Climate claims can often be misleading.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}