{
  "title": "This monitor light is a slick way to bathe your gaming space in color",
  "url": "https://www.theverge.com/23042939/govee-dreamview-g1-pro-gaming-light-review-specs-price",
  "date": "2022-05-09T19:30:27.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "  <p>Govee’s camera-powered dynamic LED kit matches your games on the fly</p> <p class=\"p--has-dropcap p-large-text\" id=\"YaXGc1\">Govee has carved out an interesting niche in <a href=\"https://www.theverge.com/22725979/govee-tv-backlight-bars-review-specs-price\">TV bias lights that use a mounted camera</a> to match the lighting to what’s on-screen. With its latest product, the <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fus.govee.com%2Fpages%2Fg1pro&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23042939%2Fgovee-dreamview-g1-pro-gaming-light-review-specs-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Govee DreamView G1 Pro Gaming Light</a>, it brings this formula to desktop computers and gaming monitors.</p><p id=\"1QGnnp\">The DreamView G1 Pro is derived from its larger, TV-sized cousins, but it features a much more streamlined all-in-one camera and wire housing, with a higher asking price of $179 direct from <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fus.govee.com%2Fcollections%2Fgaming-lights%2Fproducts%2Fgovee-dreamview-g1-pro-gaming-light&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F23042939%2Fgovee-dreamview-g1-pro-gaming-light-review-specs-price\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Govee</a> or from <a href=\"https://www.amazon.com/Govee-DreamView-Gaming-Design-Backlight/dp/B09R1VGWSM?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Amazon</a> (though it’s likely to get frequent discounts like Govee’s other lights). There’s no separate control box for the wiring, as the 56-inch flexible light strip and two 17-inch light bars plug right into the camera via USB-C, and the whole kit thankfully takes up just one power outlet. </p><div><div id=\"9speMW\"><div data-anthem-component=\"scorecard:11162386\"></div></div></div><p id=\"EZ1pNb\">Like the TV bias lights, the camera uses a fisheye lens to view your whole monitor, and it attaches with a claw-like pressure clamp and some 3M adhesive. You do have to be comfortable with applying plenty of 3M adhesive on the back of your monitor — and for a brief moment, directly on the screen.</p><p id=\"xwbPSi\">Thankfully, the install is otherwise fairly straightforward and easy. The quick-start guide walks you through setting it up on 16:9 and ultrawide 21:9 displays, curved or flat, ranging from 24 to 30 inches. My monitor is a 30-inch Dell with a less common 16:10 aspect ratio, but it worked fine with the included 16:9 sizing guide. Govee notes that your monitor must have a smooth back for the clips to adhere to, so if you have a monitor with a whole lot of busy paneling and seam breaks, it may be more difficult to mount the main LED strip.</p><p id=\"mWcon5\">The light strip itself is encased in a soft, rubbery material, and it’s very flexible. I much prefer this design to the usual tape-style strip of LED lights on other products and Govee’s TV kits. It makes the strip much thicker, but it also gives the lighting a softer glow, reducing hotspots (where you can see each individual LED reflected back) if your monitor is right against a wall. It also makes installing, removing, and reinstalling the strip much easier — which was helpful for me, as I first ran the strip backward and had to change it later. Govee’s instructions had a small conflict between the text and pictures, telling you to run the strip counterclockwise from the top but showing an example picture that only fits one way: clockwise. This reversed the lighting at first, and you can’t swap its orientation with software. Thankfully, popping out the strip and re-mounting it to correct this mistake was fairly painless.</p><div id=\"nSePxN\"><div data-anthem-component=\"gallery:11162400\"></div></div><p id=\"Msphbc\">Once the strip is installed, you set up and plug in the two light bars about 12 inches from your monitor. The free-standing light bars should be about 12 inches away from your display or they can bleed light into the camera’s view and mess up the automatic lighting, so be sure that you have adequate desk space. </p><div class=\"c-float-right c-float-hang\"><div id=\"hILMqV\"><div data-anthem-component=\"aside:11162203\"></div></div></div><p id=\"kPEpX6\">Turning on the lights and running the initial setup in the Govee Home app on your phone to connect it via Wi-Fi and Bluetooth is when we get to everyone’s most anxiety-inducing part of the install: temporarily sticking seven small foam cubes to your monitor’s panel so the Govee camera knows where to read color info from. While I was a bit cavalier with my old monitor that’s nearing its 10th birthday and ran through this quickly and easily, I understand if you bought a fancy new monitor and this step gives you pause. The adhesive on these cubes is high quality enough to not leave any residue — just be sure to pull from one side of the cube when removing instead of pulling it off flat.</p><p id=\"T9s543\">The very last step of calibration is mapping out the five sections of your strip in the app to ensure it illuminates the right areas to match up with the corners of your screen. With the camera and lights installed and initially calibrated, the DreamView G1 Pro starts displaying colorful light based on what’s on your screen. You can choose from all kinds of preset scenes, turning the back of your monitor into a ridiculous dance party synced to music or to a chill candle-lit flicker. But the real star of the show, and the reason you buy a product like this, are the video modes that mimic the on-screen colors.</p><div class=\"c-wide-block\"><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\"The DreamView G1 Pro mounted to the back or a monitor and flanked by its two vertical light bars.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/b32agVmx7l_79N1A7lg1KoiF3yw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417600/adibenedetto_220330_5164_0006.jpg\">      <figcaption><em>The light strip’s silicone covering gives it a very soft glow, with minimal hotspots.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1O1HA-Zn_aeqpsD3Okn6gfeMkdU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417601/adibenedetto_220330_5164_0007.jpg\">      <figcaption><em>Rear view of the Govee DreamView G1 Pro on my 30-inch 16:10 monitor.</em></figcaption>  </figure></div></div></div><p id=\"XssjhC\">Video mode breaks down into two sub-modes, game and movie. Game mode makes color changes very abruptly to keep up with twitchy gameplay. Movie mode leans towards softer transitions to avoid getting too distracting or overbearing. Within each sub-mode are further display types. While movie mode is much more hands-off, with only options for controlling how varied the light is displayed across the strip and bars (from one solid color to individual segments), game mode has four themed display types — story, action, shoot, and racing. These are designed for different types of games, though the different behavior between all four of them at times felt a little random. </p><p id=\"HFJrVc\">After a whole lot of testing, here’s my best summary of the different game modes’ behavior:</p><ul><li id=\"BkZLzd\"><strong>Story mode:</strong> Quick changes in the lighting for some impact of big, bold colors. It keeps the bars of light on each side uniform, so you’re fully flanked by whatever color is designated on each side. This mode works well on most titles, and I’d even suggest trying it for watching movies and music videos if you prefer more flash to movie mode.</li><li id=\"OGXO5K\"><strong>Action mode:</strong> More mixed lighting, thanks to the side light bars now being separated into up to three segments. Each bar often displays multiple colors at once. </li><li id=\"M4VOKX\"><strong>Shoot mode: </strong>Similar multi-color behavior to Action, but the light bars are now split into just two segments. The light strip behind the monitor seems more dynamic, and there may be more variation in brightness levels, giving a slight pulse effect at times.</li><li id=\"GnUGEG\"><strong>Racing mode:</strong> The light bars will occasionally divide into smaller color segments to send pulsing waves of color up and down, which seems nicely matched when fast-moving objects speed by you in a game. It reminds me of the light stack that signals the start of a drag race (referred to as a <a href=\"https://en.wikipedia.org/wiki/Christmas_tree_(drag_racing)\">Christmas tree</a>) but moving much faster.</li></ul><div id=\"8DXxdW\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Govee DreamView G1 Pro|106928\" data-volume-uuid=\"8e276b98c\" data-volume-id=\"106928\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-120\" class=\"volume-video\"></div><div class=\"caption\"><em>Samples (video only) of the DreamView G1 Pro’s video lighting modes across </em>Elden Ring<em>, </em>Halo Infinite<em>, and </em>Forza Horizon 5. <em>After this video was produced, Govee pushed an update that renamed Storyline mode to Story mode and Competition mode to Action mode.</em></div></div><p id=\"LxNMuM\">After all that testing, I ended up using the story setting most of the time. It yielded some nice, punchy colors that were accurate enough to what was on the screen. It transitioned and changed quickly enough to keep up with the action but didn’t step into spastic flashing of colors.</p><p id=\"HOpjlH\">If the LEDs are showing inaccurate colors, there are two settings you can adjust under Color Inaccuracy in Govee’s app: a saturation slider and a white balance slider. I turned both of these down significantly to get the Govee to match the colors on screen properly. I suggest pulling up a fullscreen, all-white document and making adjustments until the emitted light from the strip and bars is actually white. This gave the lights a better baseline, and the results were much improved. </p><div class=\"c-float-left c-float-hang\"><aside id=\"pY6B9a\"><q>After all that testing, I ended up using the story setting most of the time</q></aside></div><p id=\"aCsEbk\">Part of the reason I had to make such drastic changes to the color of the LEDs is that my desk is white, and it reflects a lot of ambient light upward toward the camera. You’ll get better results with a black desk or a dark desk mat that extends under the front of your monitor. Turning off the lights in the room, of course, solves this, and that’s ultimately fine because that’s when TV and monitor backlights look their best.</p><p id=\"pPpT92\">Living with the Govee DreamView on my everyday monitor for a short while has further cemented my love for LED lights everywhere and at pretty much all times. I’ve used basic bias lights for my TVs for years now, but I’ve appreciated having these monitor-matching LEDs turned on even while I do my work. During the day, they mostly show white light that acts as an extension of my Google Docs pages, with the occasional pop of color from websites and product photos. When nighttime rolls around, the lights offer me a whole new treat — the sun is down, the room lights are off, and a rainbow’s worth of colors are dancing along to whatever game I’m spending my time with.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The Govee DreamView G1 Pro lighting up purple, blue, and magenta as Elden Ring is played on the monitor.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Ptydjmp6ANH19Kd0IzuYEeDdH5g=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417610/adibenedetto_220424_5164_0016.jpg\">      <figcaption><em>The Govee DreamView lighting up with an incantation in </em>Elden Ring<em>.</em></figcaption>  </figure></div><p id=\"DGKeWL\">The visual stimulation and immersion when I’m playing a game like <em>Elden Ring </em>add a little extra morsel of fun to the equation. No, it doesn’t transport me into The Lands Between or anything like that, but it’s just fun if you’re a nerd for lighting and an even bigger nerd for the games you’re into. There are moments when I fast-travel to certain areas and the lights abruptly cast a very stark color, like the blood-red sky of Caelid or the purple-blue of the Siofra River. Other times, little glimmers of warmth, like walking by a blazing torch in a cave, are like a small wink from the environment as it lights up a side LED bar. And while external lighting obviously doesn’t help me be better at video games, a little flash of color across my walls from a spell effect as you drop an enemy can easily trick you into thinking you’re some kind of a badass (you’re not — you’re going to get killed by a lobster, <em>again</em>).</p><p id=\"s9lEtg\">But the DreamView does sometimes get things a little wrong, or at least makes some confusing choices. While the camera is calibrated and mapped to capture all corners of the monitor, it seems to favor the top half of the screen since it dominates most of the composition of its fisheye lens. This is mostly fine though, and it rarely got things so wrong that it affected my enjoyment of a game.</p><div class=\"c-float-right c-float-hang\"><aside id=\"HLXx5d\"><q>It’s just fun if you’re a nerd for lighting and an even bigger nerd for the games you’re into</q></aside></div><p id=\"mRtXw9\">Visuals aside, the Govee also has some audio functions in its repertoire. The included Y-shaped 3.5mm cable sends your audio source to the DreamView’s camera before passing it through to your headphones or speakers. Turn on sound effects mode, and you get flashing, pulsing lights to go along with whatever music or sound effects are playing. I tried it with some different kinds of music as well as some game action, and I preferred leaving it off. It’s nice to have, but not nearly as interesting as the main function of the lights. Sound effects mode was a buggy mess at first, but temporarily switching over to music mode somehow remedied that. Ultimately, the audio features are not why you buy these lights, but it doesn’t hurt to have them as an option.</p><p id=\"AeiBDn\">The same goes for the smart home integration. The Govee Home app easily connects to Google Assistant or Amazon Alexa. You can use voice commands to turn it on, off, and adjust brightness. Though, when I used Google Assistant, it couldn’t switch between the Govee’s modes. I don’t see much need to use voice commands since the power button atop the camera is easy to reach, but with more connected devices and some macros, there’s some greater possibilities. One of the biggest side benefits of the DreamView’s connected smarts is you can sync it up with other Govee lights and control them, extending its swaths of color — which should be helpful for those already invested in other Govee lighting around their desks. Other smart functions like schedules and timers are here as well but probably don’t matter as much on a gaming monitor light. </p>  <figure class=\"e-image\">        <img alt=\"Govee’s camera overhangs the top of a monitor while other webcams have to sit off-center or be blocked.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/1wLDCbzonD9kqYO5rZGSLwAmAcw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23417607/adibenedetto_220422_5164_0013.jpg\">      <figcaption><em>Govee’s overhanging camera takes up the center spot where a webcam normally goes.</em></figcaption>  </figure><p id=\"ioE4V8\">When it comes to the downsides of Govee’s DreamView G1 Pro, the biggest sacrifice you have to make is that precious real estate at the top of your monitor. The camera must sit centered on your monitor, exactly where most webcams go, and unlike the TV lights, there’s no option for mounting it on the bottom. So your webcam must move over to the left or right a little bit. In my case, the Govee camera completely blocked the center view of my mirrorless camera that’s set up above and behind my monitor. Other webcams I tried had large enough mounts that even the LED strip on the back got in the way — limiting the locations I could mount it.</p><p class=\"c-end-para\" id=\"VsfGtf\">If you are a gamer and enjoy bathing your spaces in colorful lighting, the Govee monitor light is a fun addition to any desktop display that fits it. The install process may be daunting to some, but it’s fun and immersive for all kinds of games played on a desktop monitor — or even some Excel files.</p><p id=\"wQTcHn\"><em>Photography by Antonio G. Di Benedetto / The Verge</em></p><p id=\"PEJ8c4\"><em><strong>Update May 9th, 3:30PM ET:</strong></em><em> This article has been updated to reflect that the Govee DreamView G1 Pro is now available for purchase. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/YRsJ7DelS5yRFBQ5t146typYcWQ=/0x147:2040x1215/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23418377/adibenedetto_220424_5164_0015.jpg",
  "description": "These colorful lights match all your twitchy gameplay.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}