{
  "title": "This is the Osom OV1, a new phone from Essential’s former engineers and designers",
  "url": "https://www.theverge.com/2022/3/3/22960151/osom-ov1-soc-titanium-steel-ceramic-design-essential-phone",
  "date": "2022-03-03T23:22:07.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_xTWkQIPy8I8HU7Z2MukxLJE_7c=/0x0:1440x960/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70575860/Spec_reveal_2.0.jpeg\" />        <figcaption><em>The Essential Phone heritage is clear.</em> | Image: Osom</figcaption>    </figure>  <p id=\"IyD8Ff\">Osom, the company formed by Essential’s employees after <a href=\"https://www.theverge.com/2020/2/12/21134985/essential-phone-shutting-down-andy-rubin-startup\">the startup went under</a>, has released new details about its upcoming OV1 phone, including a very familiar list of build materials. Meant to compete with flagships from Apple, Google, and Samsung, the OV1 will have a stainless steel and titanium housing, a ceramic back, Corning Victus cover glass, and a Qualcomm processor.</p><p id=\"GnTm7Y\">The stainless steel is for the phone’s frame, while titanium will be used for accents like the power and volume buttons as well as the ring around the camera bump, <a href=\"https://www.androidpolice.com/osom-ov1-specs-stainless-steel-titainium-ceramic/#disqus_thread\">according to <em>Android Police</em></a>. It sounds like the phone will have a heft to it — Osom says the OV1 will be “noticeably bigger” than the Essential Phone, which had razor-thin bezels and a 5.7-inch screen. The company also says the phone will come in white and matte black but that there are “some surprises to come” in colors.</p><div class=\"c-float-right\"><aside id=\"qZcXyR\"><q>The OV1 looks like the Essential Phone, but Osom isn’t billing it as a spiritual successor</q></aside></div><p id=\"UAIUBy\">Talking to Osom’s founder and CEO, Jason Keats, he said that the OV1 wasn’t intentionally meant to evoke the Essential Phone. The resemblance is just the natural result of having the same team engineering and designing it. In my opinion, it still manages to stand out — the materials are still relatively uncommon in most phones, even five years after we <a href=\"https://www.theverge.com/2017/8/18/16165040/essential-phone-review-android-andy-rubin\">heaped praise on the Essential Phone’s build</a>. Arguably, Apple’s probably the closest with the iPhone 13 Pro’s stainless steel sides and “ceramic shield,” but I think most people would be able to immediately tell the difference between the iPhone and an OV1. (Plus, there’s the price — Osom hasn’t said exactly how much its phone would cost but <a href=\"https://www.androidpolice.com/osom-ov1-specs-stainless-steel-titainium-ceramic/\">told <em>Android Police</em></a> it’d come in well under $1,000, which is where the 13 Pro <em>starts</em>.)</p><p id=\"0L2zEe\">The OV1 was supposed to be fully revealed this week, according to <em>TechCrunch</em>, but Osom is pushing back its announcement and ship date so it can upgrade the phone’s processor. The company says it’ll use a “Snapdragon 8 series chipset,” though it can’t give specifics, <a href=\"https://techcrunch.com/2022/03/03/osom-talks-its-first-phone-ahead-of-a-q4-release/\">according to <em>TechCrunch</em></a>. Qualcomm <a href=\"https://www.theverge.com/2021/11/30/22809687/qualcomm-snapdragon-8-gen-1-chip-smartphone-processor-specs-details\">recently switched up its naming scheme</a> for chips with the Snapdragon 8 Gen 1, though it seems unlikely that the OV1 will use that specific chip given its vow of silence. </p><p id=\"PhEMrZ\">Osom says the phone will get “all-day” battery life and that it’ll have ultra-wideband, or UWB, the same tech other manufacturers like Apple, Google, and Samsung use for things like precision location tracking and <a href=\"https://www.theverge.com/2021/9/30/22702348/samsung-digital-car-keys-uwb-genesis-gv60\">digital car keys</a>. Keats wouldn’t say exactly what that radio’s for but said that the company has some “interesting stuff cooking” that it would announce later. It will have room for two physical SIM cards — Keats says the company purposefully chose not to go with an e-SIM to avoid tying itself to particular carriers. (He also mentioned that partnering with a particular carrier was a “devastating mistake for Essential.”)</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/csnCY213-8VTv5IpgkeX0LUpz3A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23285991/Spec_reveal_1.jpeg\">      <cite>Image: Osom</cite>      <figcaption><em>The OV1 will feature a camera bump with two cameras.</em></figcaption>  </figure><p id=\"E96S4f\">Osom says that it’s also learned from the camera missteps at Essential and that it wants the OV1 to have a “truly flagship camera experience.” Design-wise, the OV1 has a camera bump, something the Essential phone avoided. That bump holds the two rear cameras, running at 48 and 12 megapixels. The front-facing camera will be 16MP. Because of how important software is to the mobile photography experience, it’s hard to say how those specs will translate into snapshots at this point.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jONPNaiapFeaCgwiLuQFK0Z4mlg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23286026/OSOM_USB_plugged.png\">      <cite>Image: Osom</cite>      <figcaption><em>The included USB cable will let you switch off the data pins.</em></figcaption>  </figure><p id=\"pGNVsv\">Finally, there’s the USB-C to C cable that comes in the box. There’s usually not a lot to say about those, but Osom’s including one with a neat trick: the ability to flip a switch that physically disconnects the data pins, so you can feel more comfortable charging your phone from a public outlet (though admittedly in my experience those are usually still USB-A). Unfortunately, the mechanical disconnect means the cable runs at USB 2 speeds, according to Osom spokesperson Andy Fouché — a glacial 60 megabytes per second. The OV1’s port can support the much faster 625 MB/s speeds of <a href=\"https://www.theverge.com/circuitbreaker/2019/2/27/18243425/usb-3-2-standard-names-connectivity-cables-innovators-forum\">USB 3.2 Gen 1</a>, though, when paired with a different cable.</p><p id=\"rUz0DN\">Keats couldn’t say how fast the OV1 will charge, just that it will be “impressively quick.” It is BYOB (bring your own brick), though — it won’t ship with a charger in the box. </p><p id=\"Zu7AgX\"><em><strong>Update March 3rd, 6:22PM ET:</strong></em><em> Updated with additional information about the OV1’s included cable.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VSzyjSVQXDBuKTq8EF5TupW5fAI=/0x192:1440x946/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23286019/Spec_reveal_2.jpeg",
  "description": "It’ll feature an unspecified Snapdragon 8 chipset.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}