{
  "title": "This diamond company wants to help carbon capture take off",
  "url": "https://www.theverge.com/2022/3/2/22951332/aether-diamonds-carbon-capture-air-climate-change",
  "date": "2022-03-02T12:00:00.000Z",
  "author": "Maddie Stone",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mVEUEWvs5e14q7S_UXj1ebpp_KA=/163x0:3412x2166/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70568705/Aether_Tweezers.0.jpg\" />        <figcaption>An Aether diamond | Aether</figcaption>    </figure>  <p>Aether’s diamonds are pulled from the air, literally</p> <p class=\"p--has-dropcap p-large-text\" id=\"MuiKtR\">Luxury diamond producers are usually way more focused on sparkly chunks of rock in the ground than carbon dioxide emissions in the atmosphere. But one diamond company is trying to recast the gems as a crucial lever in the climate fight by growing diamonds from carbon sucked straight out of the air. </p><p id=\"FfAwVJ\">That company is <a href=\"https://aetherdiamonds.com/\">Aether</a>, a lab-grown diamond startup that just raised $18 million in a funding round led by <a href=\"https://helena.org/\">Helena</a>, a “global problem solving organization” that <a href=\"https://helena.org/our-process\">includes</a> both a for-profit investment and nonprofit action arm. Lab-grown diamonds are a hot market, and there’s no shortage of companies claiming that these synthetic gems are <a href=\"https://gizmodo.com/beyond-the-hype-of-lab-grown-diamonds-1834890351\">more ethical or environmentally friendly</a> than their Earth-mined counterparts — and there are even other <a href=\"https://skydiamond.com/our-process\">companies</a> also focused on making diamonds using carbon dioxide from the air. But Aether’s claims are backed up by some ambitious facts about its operation: not only is it making diamonds in a process powered by clean energy — it’s pulling an additional 20 metric tons of CO2 out of the atmosphere per carat it produces.</p><p id=\"sE9hlu\">While the cost of capturing all that carbon would be high for a company selling, say, cement, it’s one the luxury jewelry brand says it can easily absorb. And the world needs businesses that can pay for so-called direct air capture and still generate a profit if the nascent technology is ever going to make a dent in climate change.</p><div class=\"c-float-right c-float-hang\"><aside id=\"uB7Cbv\"><q>“It is simply too damn expensive to suck one metric ton of CO2 out of the air”</q></aside></div><p id=\"BEl3h7\">“It is simply too damn expensive to suck one metric ton of CO2 out of the air on a price per ton basis,” Helena founder and CEO Henry Elkus tells <em>The Verge</em>. “It is not a profitable endeavor right now. And in order for direct air carbon culture to get to economies of scale, it has to get that price point down.”</p><p id=\"frdUs4\">Scaling up direct air capture has been part of Aether’s mission from the get-go. CEO Ryan Shearman and COO Daniel Wojno founded the company in 2018 after reading about direct air capture and intensively exploring whether carbon pulled from the air could be used to forge diamonds. Their hope, Shearman tells <em>The Verge</em>, has always been to sell enough diamonds to meaningfully support the direct air capture market, which has attracted considerable interest <a href=\"https://www.theverge.com/2022/1/14/22882648/bill-gates-climate-fund-breakthrough-energy-rfp-europe-us\">from tech industry philanthropists</a> in recent years but few customers that can sustainably pay for the service. Currently, companies like Microsoft pay <a href=\"https://www.theverge.com/2021/9/9/22663597/largest-direct-air-capture-plant-c02-climeworks-iceland\">Climeworks</a>, a leading direct air capture firm headquartered in Switzerland, about $600 to capture a ton of CO2. </p><p id=\"xH043b\">Aether, which also works with Climeworks, wouldn’t disclose how much it’s paying for direct air capture services. But it says it can transform one ton of captured CO2 into “millions of dollars’ worth of diamonds”. On a per carat basis, those diamonds, an ultra high-purity breed known as <a href=\"https://4cs.gia.edu/en-us/blog/digging-diamond-types/\">Type IIa </a>diamonds that are difficult to find in nature, sell for anywhere from $4,900 to over $10,000. Shearman says this price range is higher than many competitors in the lab grown space and closer to that of mined diamonds because of the additional work that goes into making the fabrication process as clean as possible.</p><div class=\"c-float-left c-float-hang\"><aside id=\"KBnF22\"><q>it can transform one ton of captured CO2 into “millions of dollars’ worth of diamonds”</q></aside></div><p id=\"iVJOBm\">That process starts with Aether purchasing carbon dioxide from Climeworks’ facility in Switzerland and shipping it to the United States, where the diamonds are grown. Aether puts that CO2 through a proprietary process to convert it into high purity methane, or CH4. That methane is then injected directly into the company’s diamond reactors, where a method known as “<a href=\"https://www.gia.edu/gems-gemology/fall-2016-observations-cvd-grown-synthetic-diamonds-review\">chemical vapor deposition</a>” is used to grow rough diamond material over the course of several weeks. </p><p id=\"QKNL1X\">The chemical vapor deposition process involves heating gasses to very high temperatures under near<strong>-</strong>vacuum conditions, and considerable energy is required to do so. Shearman tells <em>The Verge</em> that this process and other manufacturing stages are powered entirely by carbon-free sources like solar and nuclear. Once the diamonds finish growing, they’re shipped to Surat, India, where they’re cut and polished before being sent back to New York City’s diamond district for sale.</p>  <figure class=\"e-image\">        <img alt=\"A pile of diamond and rose gold rings against a white background.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xWoPWe8fooZRXcJvLqDpmuWVlvw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23279931/GROUP_B_ROSE_GOLD.jpg\">      <cite>Photography by Steven DeVilbiss</cite>      <figcaption>Diamond rings made by Aether. </figcaption>  </figure><p id=\"jcZavC\">Aether’s entire operation, Shearman says, is carbon neutral, with carbon offsets used to cancel out the emissions from its New York facilities and those that occur when the company’s products are shipped by air and sea. The carbon extracted from the air to make each diamond, Shearman says, tips the manufacturing process “into carbon-negative territory.”</p><p id=\"DClXui\">“We envisioned this as a manufacturing technology that would allow us to produce diamonds of the same quality as the best diamonds on the market,” Shearman says, “but without all of the negative externalities that have been associated with diamond mining or traditional lab grown diamonds, which have a litany of challenges.” Today, many lab grown diamonds are produced using fossil fuel energy, and many also use fossil fuel-derived methane as a feedstock in their reactors.</p><div class=\"c-float-right c-float-hang\"><aside id=\"2S9AwC\"><q>for every carat of diamond it sells, the company says it removes an additional 20 metric tons of carbon from the air</q></aside></div><p id=\"P48kS7\">Aether only needs a relatively small amount of carbon dioxide to make the diamonds themselves — think fractions of grams rather than tons. Then, for every carat of diamond it sells, the company says it removes an additional 20 metric tons of carbon from the air, using a mix of direct air capture and other carbon removal methods that involve long-term carbon sequestration. Shearman says the company based this commitment on the fact that the average American has an annual carbon footprint of <a href=\"https://www.nature.org/en-us/get-involved/how-to-help/carbon-footprint-calculator/#:~:text=The%20average%20carbon%20footprint%20for,is%20closer%20to%204%20tons.\">approximately 16 metric tons</a>, meaning most customers can expect to roughly cancel a year’s worth of personal emissions by purchasing an Aether diamond. “It’s something that has proved to be difficult but doable, and we’re really proud to be able to do that,” he says.</p><p id=\"o9e7Wz\">Aether started shipping its first diamonds to customers in the middle of 2021. While Shearman wouldn’t offer specific sales figures, he says that the company produced “hundreds of carats” of diamonds last year, and this year plans to produce thousands. Shearman described the $18 million in Series A funds raised by Helena as “the fuel that’s going to enable us to increase our production footprint this year.”</p><div class=\"c-float-left c-float-hang\"><aside id=\"RSZv8j\"><q>direct air capture alone isn’t going to solve climate change</q></aside></div><p id=\"lkUllv\">Elkus of Helena says that the organization invests in companies that are “provably addressing or will address a societal problem.” It saw Aether as tackling two problems at once: the high cost of direct air capture, and the environmental and human rights concerns associated with diamond mining and the larger diamond industry. Although Elkus believes Aether’s approach of turning CO2 into methane, and from there into physical things, could be applied to many industries, focusing first on a luxury good “gives you the margins to make profitable business, and that’s certainly a great leapstart.”</p><p id=\"cg8F49\">Aether isn’t going to solve <a href=\"https://www.theverge.com/2021/9/9/22663597/largest-direct-air-capture-plant-c02-climeworks-iceland\">all of the</a> <a href=\"https://www.theverge.com/2021/8/26/22642806/co2-pipeline-explosion-satartia-mississippi-carbon-capture\">challenges</a> facing direct air capture, and direct air capture alone isn’t going to solve climate change. The climate technology <a href=\"https://grist.org/article/the-climate-solution-democrats-arent-talking-about/\">remains controversial</a>, with some environmentalists seeing it as a distraction from the hard work of curbing the world’s fossil fuel use, even as many <a href=\"https://www.nap.edu/catalog/25259/negative-emissions-technologies-and-reliable-sequestration-a-research-agenda\">models</a> <a href=\"https://www.ipcc.ch/sr15/chapter/spm/\">agree</a> we will need to pull carbon from the air to stabilize global temperatures at safe levels this century.</p><p class=\"c-end-para\" id=\"oZcLCB\">Whether Aether’s sales pitch of a cleaner diamond pulled from the air is appealing enough to turn a significant number of would-be diamond owners away from gems forged deep inside the Earth remains to be seen. But the stakes look a bit higher than one jewelry company’s fortunes.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-ysI0vjIOZYq0er_cRV_htlK7tc=/0x148:3573x2019/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23278193/Aether_Tweezers.jpg",
  "description": "An unlikely ally in the fight against climate change",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}