{
  "title": "This journalist’s Otter.ai scare is a reminder that cloud transcription isn’t completely private",
  "url": "https://www.theverge.com/2022/2/16/22937766/go-read-this-otter-ai-transcription-data-privacy-report",
  "date": "2022-02-17T02:04:15.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/h1c3dgkX3vhhid8aUAU_DItB3lE=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70519217/acastro_210430_1777_audioApps_0002.0.jpg\" />        <figcaption><em>If you upload data to a service, you can’t count on it staying private.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"jytBD9\">A report <a href=\"https://www.politico.com/news/2022/02/16/my-journey-down-the-rabbit-hole-of-every-journalists-favorite-app-00009216\">recently published by <em>Politico</em></a> about the automated transcription service Otter.ai serves as a great reminder of how difficult it can be to keep things truly private in the age of cloud-based services. It starts off with a nerve-wracking story — the journalist interviewed Mustafa Aksu, a Uyghur human rights activist who could be a target of surveillance from the Chinese government. But though they took pains to keep their communication confidential, they used Otter to record the call — and a day later, they received a message from Otter asking about the purpose of the conversation with Aksu. </p><p id=\"n0TZPn\">Obviously, it was a concerning email. After receiving mixed messages from an Otter support agent about whether the survey was real or not, the reporter went down a rabbit hole trying to figure out what had happened. He details his dive into the service’s privacy policy (which does let Otter share some info with third parties), and lays out how the ease and utility of transcription software can override critical thinking about where potentially sensitive data is ending up. </p><div class=\"c-float-right\"><aside id=\"umC7Oh\"><q>“Hey Phelim, to help us improve your Otter’s experience, what was the purpose of this particular recording with titled ‘Mustafa Aksu’”</q></aside></div><p id=\"nfFGLR\">It’s an important wake up call — automated transcription services are popping up everywhere, both from standalone companies like Otter (which we at <em>The Verge</em> have used <a href=\"https://www.theverge.com/2021/8/25/22639148/otter-ai-meeting-transcription-assistant-google-meet-microsoft-teams-cisco-webex\">and recommended</a>) and Trint, and as built-in components of services like <a href=\"https://support.zoom.us/hc/en-us/articles/115004794983-Audio-transcription-for-cloud-recordings\">Zoom</a> and <a href=\"https://www.theverge.com/21368867/transcription-google-docs-live-transcribe-how-to-zoom\">Google Docs</a>. Rationally, we know that the government can get at data stored by these cloud services with a subpoena, but convenience and accessibility can sometimes make it easy to forget those concerns. As the report says, though:</p><blockquote><p id=\"ugtldw\">“We have not and would not share any data, including data files, of yours with any foreign government or law enforcement agencies,” Otter’s Public Relations Manager, Mitchell Woodrow, told me via email. “To be clear, unless we are legally compelled to do so by a valid United States legal subpoena, we will not ever share any of your data, including data files, with any foreign government or law enforcement agencies.”</p></blockquote><p id=\"mIg0Lg\"><a href=\"https://www.politico.com/news/2022/02/16/my-journey-down-the-rabbit-hole-of-every-journalists-favorite-app-00009216\">The report</a> is more of a wake up call than a takedown of a popular service — there’s no big reveal that the transcript had been accessed by a nation’s spy agency, and Otter told the reporter that Aksu’s name was in the survey because it was in the title of the transcription. The company also said that it’s stopped doing those kinds of surveys, because of the disconcerting effect they could have. </p><p id=\"nXgAEx\">But the fact that the government can legally get its hands on the information we provide to these services is something worth keeping in mind — especially when it comes to choosing  between cloud services and alternatives like <a href=\"https://www.theverge.com/2019/10/15/20915452/google-pixel-4-recorder-app-transcription-real-time-free-language-processing\">apps that use on-device transcription</a>, or <a href=\"https://www.theverge.com/2016/8/28/12609724/record-your-own-soundscapes\">offline recorders</a>. Even for those of us not dealing with confidential sources, it’s well worth reading <a href=\"https://www.politico.com/news/2022/02/16/my-journey-down-the-rabbit-hole-of-every-journalists-favorite-app-00009216\">a report about these increasingly common transcription tools</a> from someone who does. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/T97wUc-tVG6OODW24XLV3JYwvGQ=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22482398/acastro_210430_1777_audioApps_0002.jpg",
  "description": "A reminder of how much care it takes to safeguard data",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}