{
  "title": "This is not a self-driving car",
  "url": "https://www.theverge.com/2022/2/4/22917903/adas-av-autonomous-super-cruise-autopilot-language",
  "date": "2022-02-04T18:23:53.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/jlAF6e1bExoMpxLIMkwugrdC18M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70472069/cadillac_2021_escalade_0433.0.jpg\" />        <figcaption>Photo by Sean O’Kane / The Verge</figcaption>    </figure>  <p id=\"7RqPsG\">The way we talk about cars and driving is changing — faster than most people can really keep up. Which is why we need to be periodically reminded that just because a car brakes by itself, makes automatic lane changes, or even lets you take your hands off the wheel doesn’t make it an autonomous vehicle. </p><p id=\"lpfL2T\">Case in point: <em>New York Times </em>columnist<em> </em>Farhad Manjoo <a href=\"https://www.nytimes.com/2022/02/04/opinion/self-driving-car-escalade.html\">recently wrote about his experiences driving the 2021 Cadillac Escalade with Super Cruise</a>. And while Manjoo has done a lot to advance ideas around car-free living and public transportation, he, unfortunately, fell into the common trap of conflating advanced driver-assist features with autonomous vehicles. </p><p id=\"uyxcnN\">He’s not alone, either. YouTube’s favorite auto reviewer Doug DeMuro has referred to Super Cruise as a “self-driving” system, <a href=\"https://twitter.com/DougDeMuro/status/1364086945484214273\">arguing</a> that any attempt to draw distinction between an advanced driver assistance system and autonomous technology was just “semantics.” (He eventually came around and vowed to more accurately describe these features.)</p><div class=\"c-float-right\"><aside id=\"CUE6Up\"><q>It’s completely understandable why we keep making this mistake over and over again</q></aside></div><p id=\"B5i9KX\">It’s completely understandable why we keep making this mistake over and over again. These are new and complex issues that are not easily understood by people who are not immersed in this linguistic debate on a daily basis. But I thought I’d write this just to serve as a reference point in the future because it’s my guess this is going to come up again. And again. </p><p id=\"2AFw1k\">First, let’s define what we’re talking about. An advanced driver assistance system, or ADAS, is a group of technologies, like adaptive cruise control, lane-keep assistance, blind-spot detection, and assisted parking functions, that, when taken together, perform some of the driving tasks under specific conditions. For the most part, they are convenience features, though they have the potential to increase safety, both for people inside and outside the vehicle (though that’s up for debate). </p><p id=\"EB6JvF\">Sometimes, when paired with a driver monitoring system, these advanced driver assistance systems can even allow you to take your hands off the wheel. Super Cruise uses an infrared sensor on the steering column to monitor the driver’s eye movements to make sure they keep their attention on the road. It’s also only usable on divided highways that General Motors (Cadillac’s parent company) has mapped. </p><div class=\"c-float-right\"><aside id=\"f6CAD4\"><q>ADAS require constant supervision in order to operate</q></aside></div><p id=\"ZbgIee\">But the key distinction here is that ADAS require constant supervision in order to operate. You need to either keep your hands on the wheel or your eyes on the road — or, ideally, both — in order for the system to function. GM doesn’t even want you using your smartphone while Super Cruise is engaged. </p><p id=\"RAY6an\">Calling these features “self-driving” or “autonomous” wildly oversells their capabilities. For example, Super Cruise does not yet recognize stop signs or traffic lights and can’t navigate the vehicle to a selected destination. (Tesla’s Full Self-Driving system is a bit of an outlier, but we’ll talk about that in a minute.) The danger is that confusion between what does and doesn’t require supervision will inevitably lead to overconfidence, misuse, and possibly death. </p><p id=\"HiPBEg\">When Manjoo writes that Super Cruise freed him “from the drudgery of driving” and let his eyes “wander across the scenery,” I could hear the screams of thousands of AV operators and safety advocates suddenly cry out in terror. First of all, Super Cruise does not allow your eyes to wander. It beeps at you with increasing fervor if you take your eyes off the road and eventually disengages if you don’t — something Manjoo acknowledges in a previous paragraph. </p><p id=\"TXxh7A\">But this gets to the crux of the problem. ADAS, especially really good ADAS like Super Cruise, can lure drivers into a false state of confidence, which in turn can affect their ability to retake control of the vehicle in a timely manner. This becomes even more of a problem when you’re behind the wheel of a 3-ton vehicle going 70 mph down the highway. </p><div class=\"c-float-right\"><aside id=\"I99j9B\"><q>It’s going to get worse before it gets better</q></aside></div><p id=\"zZDnto\">It’s going to get worse before it gets better. GM recently announced that Super Cruise will soon get a <a href=\"https://www.theverge.com/2021/10/6/22712566/gm-ultra-cruise-adas-hands-free-driving\">major upgrade to cover “95 percent” of driving scenarios</a>. <a href=\"https://www.theverge.com/2022/1/5/22866190/volvo-ride-pilot-level-3-autonomous-subscription-california\">Volvo is petitioning the state of California</a> to allow it to sell a highway driving feature that doesn’t require any human supervision. And, of course, there’s Tesla. </p><p id=\"y9K14z\">Elon Musk’s company is the source of a lot of this confusion that we see today. The decision to label its prototype ADAS as “Full Self-Driving” is undoubtedly <a href=\"https://www.theverge.com/2021/10/13/22724171/nhtsa-tesla-letters-fsd-beta-autopilot-recall-emergency-vehicles\">causing consternation</a> among the engineers and automakers who are working on real autonomous vehicles. And the internet is full of videos of Tesla owners misusing their vehicles, filming themselves from the backseat as their cars careen down the highway. </p><p id=\"ZXfWfK\">In fact, the Self Driving Coalition for Safer Streets, the main lobbying group for AV operators like Waymo, Cruise, Aurora, and Argo, recently <a href=\"https://www.theverge.com/2022/1/26/22901349/self-driving-coaltion-rebrand-autonomous-vehicle-industry-tesla\">changed its name</a> to the Autonomous Vehicle Industry Association in an attempt to standardize the way we talk about this technology. </p><p id=\"dy3Zhf\">“Lumping in ADAS with autonomous technology runs the risk of jeopardizing a future with AVs,” the group’s general counsel, Ariel Wolf, <a href=\"https://groundtruthautonomy.com/opinion/time-for-a-reset-on-how-we-talk-about-driver-assist-technology-and-autonomous-vehicles/\">wrote recently</a>. And at <a href=\"https://www.theverge.com/2022/2/3/22916045/congress-autonomous-vehicle-hearing-av-start-legislation\">a congressional hearing on AVs earlier this week</a>, Wolf made the distinction even clearer, responding to a question about Tesla’s Full Self-Driving by saying, “Tesla is not a member of our association because it’s not an autonomous vehicle. It’s a driver assistance technology.”</p><p id=\"g3n4NO\">There is a lot of great writing on this subject. I would recommend following researcher Liza Dixon, who helped <a href=\"https://lizadixon.com/Autonowashing\">coin the term “autonowashing”</a> and has been an excellent source of clear thinking on this complex issue. </p><p id=\"vfJfbA\">I hate policing other people’s language. I don’t want to seem like a scold or a buzzkill. But on this issue, I feel like it needs to be repeated, over and over again, loudly and without hesitation: you cannot buy an autonomous vehicle today. Anything you’re driving that seems cool and futuristic, that’s just ADAS. Full stop.  </p><p id=\"dK897e\">To be sure, there are thousands of autonomous test vehicles on the road, even some without human safety monitors behind the wheel, but anything for which you can plunk down your hard-earned cash is still just a regular car. Maybe it’s a bit smarter than the cars you’re normally used to, but it’s still dumber than anything that can accurately describe itself as “autonomous.” And we need to be really clear about that going forward. </p><p id=\"l0LejP\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/8kVW_xQJNQf9oN_cXQXRx2wEXQE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19704170/cadillac_2021_escalade_0433.jpg",
  "description": "GM’s Super Cruise is a driver-assist feature, and that’s it.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}