{
  "title": "This is the memo Twitter CEO Parag Agrawal sent about firing execs and a hiring freeze",
  "url": "https://www.theverge.com/2022/5/12/23068985/twitter-memo-parag-agrawal-firing-execs-hiring-freeze",
  "date": "2022-05-12T17:47:06.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"A photo illustration of Twitter CEO Parag Agrawal\" src=\"https://cdn.vox-cdn.com/thumbor/5jrEhBTaRS_2dZ2GRq_g2DXQoxk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70861842/acastro_211129_4896_0001.0.jpg\" />        <figcaption>Photo Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"OQdFKn\">On Thursday, Twitter CEO Parag Agrawal <a href=\"https://www.theverge.com/2022/5/12/23068851/twitter-product-chief-kayvon-beykpour-bruce-falck-parag-agrawal\">announced a number of big shakeups</a> within the company in an email to staff, including firing consumer product leader Kayvon Beykpour and head of revenue product Bruce Falck. The company is pausing most hiring and pulling back on spending in most areas, though it’s not currently planning any layoffs.</p><p id=\"JeL0Zo\">It’s a strange, uneasy moment inside Twitter, as the company prepares for <a href=\"https://www.theverge.com/23026874/elon-musk-twitter-buyout-news-updates\">Elon Musk’s $44 billion acquisition</a> to close later this fall. It’s not entirely clear why Agrawal made these changes now, though, or how they relate to Musk’s acquisition. Twitter’s new head of product is Jay Sullivan, an ex-Facebook director who joined in November. The company is now beginning its search for a new head of revenue product to replace Falck.</p><p id=\"eNJxDS\"><em>The Verge</em> obtained the email Agrawal sent to staff about the changes. (Note: “Bluebird” is what Twitter calls its consumer product team, and “Goldbird” is the team that builds revenue-generating products. “Staff” refers to Twitter’s senior leadership team.)</p><p id=\"Di8V49\">Here is Agrawal’s memo to employees in its entirety:</p><hr class=\"p-entry-hr\" id=\"7GnZNY\"><p id=\"KbbN4J\">Team,</p><p id=\"SAsT3V\">Building Twitter and serving our customers around the world is important yesterday, today, and tomorrow. Our purpose is existential. During this time of change, it’s critical that we continue to strengthen our work through increased accountability and execution to make Twitter everything it can be. The priorities and decisions we make now will not only bolster how we navigate through this time, but also for the longer-term success of Twitter which I care about deeply. Some changes are happening to us and some we will drive. A number of these changes are difficult but they are right for Twitter and its future.</p><p id=\"tBF3nJ\"><strong>Leadership </strong></p><p id=\"klydYo\">It’s critical to have the right leaders at the right time. <strong>Jay Sullivan</strong>, currently interim GM of Bluebird, has shown this powerfully. His product vision, ability to inspire, move quickly and drive change is what Twitter needs now, and in the future. I have therefore decided to make Jay the permanent GM of Bluebird. With this change, <strong>Kayvon Beykpour</strong> will be leaving Twitter. Kayvon has been an amazing leader and force at Twitter over the years with his founders mindset and deep passion for the service. Under his leadership, our product has evolved and grown meaningfully - I know I speak for all of us when I say we are deeply grateful for his tremendous impact.</p><p id=\"RhGKDj\">Over the past number of months, I have also gotten much closer to the revenue product work and believe that here too, we need to make a leadership change. <strong>Bruce Falck</strong> will be departing Twitter and we will be opening the search for a new GM of Goldbird. Bruce joined Twitter at a critical time and has been a strong collaborator, leader and supporter of the revenue product work and our purpose. Under his leadership we rebuilt our ad server and anchored the foundation for evolving our ads business to be more performance based. In the interim, the Goldbird org reports to <strong>Jay Sullivan.</strong> His leadership will be very meaningful through this transition. </p><p id=\"52rq0S\">Please join me in thanking Kayvon and Bruce for everything they’ve done for Twitter. </p><p id=\"hSVCgz\"><strong>Current environment</strong></p><p id=\"bekYlq\">At the beginning of the pandemic in 2020, the decision was made to invest aggressively to deliver big growth in audience and revenue, and as a company we did not hit intermediate milestones that enable confidence in these goals. More recently, the global macroeconomic environment has become less favorable, the war in Ukraine has impacted our results, and may continue to do so. Many other companies have been experiencing a similar effect. And, of course, we are in the middle of an acquisition and we don’t yet know the timing of the close. In order to responsibly manage the organization as we sharpen our roadmaps and our work, we need to continue to be intentional about our teams, hiring and costs.</p><p id=\"PcxxaS\"><strong>Hiring</strong> </p><p id=\"rr10SK\">Effective this week, we are pausing most hiring and backfills, except for business critical roles as determined by Staff members in partnership with their HRBPs. We will also be reviewing all extended offers to determine criticality and those that should be pulled back. We are not planning company-wide layoffs, but leaders will continue making changes to their organizations to improve efficiencies as needed. As always, performance management will continue to be a priority at this time at all levels to ensure we have the strongest teams possible.</p><p id=\"MyiJAC\"><strong>Budgeting</strong></p><p id=\"fFDeEH\">We also need to pull back on non-labor costs to ensure we are being responsible and efficient. We are reducing contractor and consulting spend, travel and events, marketing, our real estate footprint, on premise and public-cloud related infrastructure spend, and other operational costs. Please continue to treat Twitter’s resources as you would your own, and manage tightly to your budgets, prioritizing what matters most.</p><p id=\"SKgyD1\">As promised, I will continue to communicate often and directly with all of you as we continue to move forward. Next week, will be holding a virtual offsite with our Global Leadership Team (GLT) to drive further cohesion and focus, and strengthen our collective plans to best support all of you. We will report out the outputs of that meeting to you. </p><p id=\"MMaBQF\">While we are in a ton of change right now, historically, Twitter often is. What stays true is our purpose, Twitter’s importance and the criticality of our work, and how we come together. Thank you for your leadership, your focus and your support for one another.</p><p id=\"qHdx1m\">Parag</p><p id=\"eD7pGU\"><strong>Update May 12th, 3PM ET: </strong><em>Added descriptions of Twitter’s Bluebird, Goldbird, and Staff teams. Also fixed minor spelling errors in memo.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nyoaP738XwNE2UXua2BpeRBrwbE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23051237/acastro_211129_4896_0001.jpg",
  "description": "\"It’s critical to have the right leaders at the right time.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}