{
  "title": "This Final Fantasy XIV music video is going to make you cry",
  "url": "https://www.theverge.com/2022/5/18/23122881/final-fantasy-xiv-endwalker-flow-music-video",
  "date": "2022-05-18T17:25:23.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Cc6iGjdsHMookLmBp1SjIKe77ao=/0x37:1806x1241/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70883773/9781646091782_FFXIV_Endwalker_01_TXT_pp014_015_with_copyline.0.jpg\" />        <figcaption>Square Enix</figcaption>    </figure>  <p id=\"5nOns2\">Today, Square Enix released the music video for “Flow,” one of the main theme songs of <a href=\"https://www.theverge.com/2022/1/11/22877031/final-fantasy-xiv-endwalker-review-square-enix-pc\"><em>Final Fantasy XIV: Endwalker</em></a>, and friends, it’s a doozy. If you have work to do or need to be productive in any way today, do not, and I cannot stress this enough, watch this music video. </p><p id=\"rARazN\">I have already shed half of my body’s moisture in tears. It was cathartic and necessary and so very much on time. And, for as much as I don’t appreciate trying to see through a curtain of water that just don’t seem to end, I deeply and truly appreciate this music video’s ability to just get me to stop and <em>feel. </em></p><p id=\"aCcAuO\">Life, right now, isn’t normal. People are dying of a disease we don’t seem to care enough about to stop. People cannot afford to live; people cannot afford to feed their babies; and people cannot afford to step out into the world without fear of being murdered by armed white supremacists who we also don’t seem to care enough about to stop. This is not normal! And yet, the mechanisms of capitalism make it such that we must continue acting as though everything is good and fine and okay in order to keep living. </p><p id=\"keSpZV\">I know that if I take a moment to think about what happened to my people in Buffalo —people with names like my older aunts, uncles, and grandmothers — I will lie down in grief and not get back up again. So, in order to keep going, I switched off. But along comes this silly video game with these fake people who mean nothing in the grand cosmic scale of the world saying, “Welcome and well met my brave little spark,” and every emotion that I have heretofore have tried to deny myself <em>just to keep living</em> bubbled up and out, and it feels so sad but so <em>good</em> that I have no words for it. I needed that reminder of my humanity. I needed Hydaelyn’s message in the song that essentially says, “It’s okay, brave one, I’ve got you.”</p><p id=\"s4PuGW\">The thing that continually gets me about <em>Endwalker</em>, why it’s the best MMO experience one can have right now, is that it has this nuanced, mature conception of the cessation of life. Unlike most video games, it doesn’t treat death as an evil to conquer but as a constant companion to life — without trivializing the trauma of death itself. In “Flow,” death is a gentle and sweet rest that comes at the end of a beautiful journey. And though it is not without sadness, death should never be met with despair.</p><p id=\"7zFNUT\"><em>Hush, love, close your eyes, and in sleep abide</em><br><em>As sun’s distant light, echoes down to dreams, below</em><br><em>Know you will wake, on winds rise again</em><br><em>For this journey’s end is but one step forward to tomorrow</em></p><p id=\"gy0j9A\">All of <em>Final Fantasy XIV</em>’s music are bangers — from “<a href=\"https://youtu.be/39j5v8jlndM\">Answers</a>” to “<a href=\"https://youtu.be/FtuwltmTp9I\">Dragonsong</a>” and “<a href=\"https://youtu.be/lJ1M049gI7Y\">Close in the Distance</a>,” but “Flow” is special. I have nothing but reverence and awe for the emotion contained in Masayoshi Soken’s piano, Natsuko Ishikawa and Kathryn Cwynar’s lyrics, and Amanda Achen’s vocals. Give it a listen when you get the chance, but make sure you block out your schedule. You might be crying for a while.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PFX2zfhZatFHHjCjIotvKtyzCuc=/0x166:1806x1112/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23541057/9781646091782_FFXIV_Endwalker_01_TXT_pp014_015_with_copyline.jpg",
  "description": "BRB, crying myself into dehydration.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}