{
  "title": "This is what Apple retail employees in Atlanta are fighting for",
  "url": "https://www.theverge.com/2022/4/29/23048296/apple-retail-store-union-atlanta-cumberland-mall-open-letter",
  "date": "2022-04-29T14:30:00.000Z",
  "author": "Zoe Schiffer",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/RvcQc-AjHjsZeH2fjIPGBM-Sju0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70810157/VRG_Illo_STK032_apple_union.0.jpg\" />        <figcaption>Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"jgUr09\">The Apple Store, located in Atlanta’s Cumberland Mall, is the first of the company’s 272 retail locations to file for a union election. Employees have written an open letter explaining what changes they are pushing for: fair compensation and transparency on alleged pay inequality within the company, a commitment to promote more BIPOC employees into leadership positions, and increased COVID-19 safety measures in stores.</p><p id=\"rKjsoO\">“We want to have a voice in our workplace,” says Elli Daniels, a retail employee and union organizer. “We are doing this because we adore Apple and we love our jobs and we want to make sure we can continue to love the company as much as we do right now. We aren’t doing this because we want to turn our backs on the company.”</p><p id=\"a7N5mL\">On Friday, a group of Cumberland retail employees say they plan to walk into the breakroom at work and post the vision statement for all employees to see.  </p><div class=\"c-float-right\"><aside id=\"vXMVfr\"><q>“People really identified with the need to have a voice at work.”</q></aside></div><p id=\"vLWqy5\">In the letter, workers write that they work for the tech giant “because Apple’s public values align with our own.” They add: “We are here to live up to them and want Apple to as well.”</p><p id=\"yUMhdr\">The implication is that these corporate values don’t always translate to the frontlines. During the pandemic, workers complained that while Apple led the retail sector in implementing COVID-19 safety measures, managers at certain retail stores <a href=\"https://www.nbcnews.com/tech/apple/apple-store-texas-closes-covid-outbreak-rcna8000\">pressured employees to come to work while they were experiencing symptoms</a>. </p><p id=\"u17cge\">“We had such a big following when we started to organize because of everything we went through with COVID,” Daniels says. “The store opening, the store closing, needing to work from home, not having a say in what that looked like. You never knew what you were walking into or if customers were wearing masks, if they weren’t. People really identified with the need to have a voice at work.” </p><p id=\"hR3OSH\">The complaint reflects a broader sentiment among Apple’s hourly workforce. While retail workers are responsible for bringing the company’s customer experience to life, <a href=\"https://www.theverge.com/c/22807871/apple-frontline-employees-retail-customer-service-pandemic\">they often feel ignored by Apple executives</a>.</p><p id=\"nzQRr1\">As Apple continues to <a href=\"https://www.theverge.com/2022/1/27/22904413/apple-q1-2022-earnings-iphone-13-supply-chain\">post record-breaking earnings</a>, retail employees also feel like they are being left out of the company’s success. Retail workers start at $20 an hour with the opportunity for annual raises, which can range from 1 to 4 percent. (This year, <a href=\"https://www.businessinsider.com/apple-offers-retail-staff-raises-labor-market-report-says-2022-2#:~:text=Apple%20is%20giving%20raises%20of,%241%2C000%20in%20September%20last%20year.\">Apple upped that to 10 percent for certain employees.)</a> Employees increasingly feel that these raises are not keeping up with inflation or the rising cost of living in their region.</p><p id=\"5aOIXf\">The news about Apple retail employees in Atlanta filing for a union election set off a flurry of organizing activity at stores across the country. The Cumberland Mall Apple Store is one of at least six stores currently pushing to unionize, <a href=\"https://www.vice.com/en/article/k7wjdx/the-first-apple-store-in-the-united-states-files-for-union-election\">according to <em>Vice</em></a>. </p><p id=\"fp0zZ9\">Apple hasn’t pushed back publicly, but the tech giant is <a href=\"https://www.theverge.com/2022/4/25/23041632/apple-hires-anti-union-lawyers-littler-mendelson-union-fight-cwa\">working with well-known anti-union lawyers from Littler Mendelson</a> to respond to organizers in Atlanta. In a statement, spokesperson Josh Lipton said: “We are fortunate to have incredible retail team members and we deeply value everything they bring to Apple. We are pleased to offer very strong compensation and benefits for full time and part time employees, including health care, tuition reimbursement, new parental leave, paid family leave, annual stock grants and many other benefits.”</p><p id=\"uIbuzR\">Read the full letter from Apple Cumberland Mall retail employees here:</p><div><div id=\"LVwXhi\"><div data-anthem-component=\"aside:11167628\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/WovtrgLH1JO11rNGuFbT3JhCt54=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23421890/VRG_Illo_STK032_apple_union.jpg",
  "description": "\"We want to have a voice in our workplace.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}