{
  "title": "This video teaches you how to build a retro flip-walker toy out of LEGO",
  "url": "https://www.theverge.com/2022/4/17/23029202/lego-video-teaches-build-retro-flip-walker-toy-bandai",
  "date": "2022-04-17T18:24:40.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ulwyCoyRYHRxV14WZaCURcQGQDQ=/564x107:2804x1600/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70760036/lego_flipwalker_toy.0.png\" />        <figcaption>Image: JK Brickworks via <a class=\"ql-link\" href=\"https://www.youtube.com/watch?v=3sACIZd5BPY\" target=\"_blank\">YouTube</a></figcaption>    </figure>  <p id=\"C9C37j\">This LEGO flip-walking vehicle looks like it has a mind of its own, but it’s really just powered by gravity and a tiny motor. Custom LEGO builder JK Brickworks walks us through the build in a <a href=\"https://youtu.be/3sACIZd5BPY\">video on YouTube</a>, which was actually inspired by the <a href=\"https://twitter.com/Rainmaker1973/status/1487726042483728386\">old-school Bear Mobill toy</a> made by Bandai in 1987. It looks like the original toy is supposed to be some kind of sci-fi military vehicle, but JK Brickworks gives it a flashy new look.</p><p id=\"TJlfxP\">The hypnotic flipping motion is triggered by a forward-moving trolley in the center. It weighs down the machine just enough at the end of its track, causing the build to flip over on two legs, resetting the entire process. As shown in JK Brickworks’ video, the toy’s unique flipping motion lets it climb up small steps and even go up a slight incline.</p><div id=\"UJokuQ\"><div ><iframe src=\"https://www.youtube.com/embed/VjKz3ucXS9I?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"NcGRDE\">If you want a more in-depth look at how to build this oddly-satisfying flippy machine, you can check out the <a href=\"https://youtu.be/VjKz3ucXS9I\">almost two-hour-long</a> recorded livestream of JK Brickworks putting it together piece-by-piece. It looks like JK Brickworks plans on creating in-depth building instructions as well, as he notes “instructions will be forthcoming” in the description of his design breakdown video. </p><p id=\"j1XFMz\">Sure, the machine may serve no purpose whatsoever and have an unnecessarily obnoxious way of moving, but it’s interesting that such a vehicle even exists. As pointed out by <a href=\"https://www.reddit.com/r/interestingasfuck/comments/sfn2ce/the_way_this_toy_travels/\">some users on Reddit</a>, the only toy that gets close to this level of intrigue is probably <a href=\"https://youtu.be/Nn14qt9wFE8\">the 1983 He-Man dragon walker</a>, which swings itself sideways to take a single step forward.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GOkN7eYU4Y2nzZmp3a24qomXowE=/370x147:2880x1461/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23395820/lego_flipwalker_toy.png",
  "description": "It never stops flipping.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}