{
  "title": "Thomson Reuters commits to human rights assessment of ICE contracts after union investor push",
  "url": "https://www.theverge.com/2022/4/29/23048819/thomson-reuters-human-rights-assessment-ice-bcgeu-mijente",
  "date": "2022-04-29T18:09:44.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"ICE Arrests Undocumented Immigrants In NYC\" src=\"https://cdn.vox-cdn.com/thumbor/FVXI-sHUSG9vkwHD4r3kpGpEzjk=/0x24:5401x3625/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70811326/945287450.0.jpg\" />        <figcaption>Photo by John Moore/Getty Images</figcaption>    </figure>  <p id=\"dH7rMA\">In its latest <a href=\"https://ir.thomsonreuters.com/static-files/7324dde7-1cdc-48c7-8372-89de319d0d71\">notice to shareholders</a>, Thomson Reuters announced that it would align with the United Nations Guiding Principles on Business and Human Rights (UNGPs) and conduct an independent, company-wide human rights impact assessment of its products and services, including contracts with US Immigration and Customs Enforcement (ICE).</p><p id=\"oAwWNN\">The announcement comes after years of criticism over data brokerage services provided by the Canadian media conglomerate to ICE, which uses a Thomson Reuters database service known as CLEAR to track, arrest, and deport undocumented migrants in the US. Currently, Thomson Reuters has more than $100 million in contracts with ICE and provides the immigration agency not only with raw data gathered from cellphone records, license plate recognition, and other publicly available information but also with <a href=\"https://documentedny.com/2020/05/20/thomson-reuters-analysts-process-data-to-help-ice-agents-make-arrests-documents-show/\">in-house analysts and customized systems</a> to support the use of the data in ICE operations.</p><p id=\"FcHLK8\">The announcement of the impact assessment has been greeted with cautious optimism by groups like Mijente, a grassroots Latinx nonprofit organization that has led the <a href=\"https://notechforice.com/\">#NoTechForICE</a> campaign.</p><p id=\"uLRQA7\">“We’ll be watching the outcome of this assessment closely,” said Jacinta Gonzalez, senior campaign director at Mijente. “Our undocumented community members deserve the right to feel safe and should not have to fear that their data will be shared to harm them based on their immigration status.”</p><div class=\"c-float-left\"><aside id=\"8FglEC\"><q>“Our undocumented community members deserve the right to feel safe and should not have to fear that their data will be shared to harm them”</q></aside></div><p id=\"WniKOe\">The newly announced impact assessment comes after years of shareholder activism from the British Columbia General Employees’ Union (BCGEU), a Canadian union that is a minor shareholder in Thomson Reuters through its general and defense investment funds. In 2020, 2021, and 2022, BCGEU submitted shareholder proposals highlighting privacy and human rights violations committed by ICE and suggesting that Thomson Reuters adopt the UNGPs as a guiding framework for mitigating human rights risk.</p><p id=\"vRZdHg\">In an appendix to the shareholder notice, Thompson Reuters included the text of the most recently submitted proposal from BCGEU, noting that the proposal was voluntarily withdrawn from consideration at the annual meeting after commitments made to the union by the media company.</p><p id=\"kF6tPh\">“This is why our union does capital stewardship the way we do—to force corporations to make progressive changes on the issues that matter to working people,” said BCGEU president Stephanie Smith in a statement. “Thomson Reuters would not have taken this action without sustained pressure from BCGEU over the past 3 years, and ongoing work by Mijente and the NoTechForIce campaign.”</p><div class=\"c-float-right\"><aside id=\"HA1m0S\"><q>“This is why our union does capital stewardship the way we do”</q></aside></div><p id=\"of4fqB\">BCGEU’s activism toward Thomson Reuters was spurred by <a href=\"https://www.theverge.com/2020/5/21/21266431/thomson-reuters-ice-clear-software\">longstanding concern over the CLEAR database</a>, which is able to consolidate data pulled from public records across numerous external databases, such as motor vehicle and arrest records, health care provider information, cellphone records, and more.</p><p id=\"6rhtZJ\">In December 2021, the CLEAR database came into the spotlight again after the publication of a letter sent to the Consumer Financial Protection Bureau by Senator Ron Wyden (D-OR), which revealed that numerous <a href=\"https://www.theverge.com/2021/12/9/22826271/utilities-ice-data-sharing-thomson-wyden\">utility companies had been sharing data with ICE</a> through a deal that allowed credit reporting agency Equifax to re-sell information about power, water, TV, and other utilities payments.</p><p id=\"SEL7Xn\">BCGEU’s capital markets advisor Emma Pullman told <em>The Verge</em> that after first resisting calls for a human rights assessment, Thomson Reuters had been swayed by growing awareness of the dangers of third-party data sharing.</p><p id=\"Kh9m3j\">“I think [Thomson Reuters] has realized that investors are quite concerned about this, and that the public are increasingly very concerned about data brokers,” Pullman said. “In that kind of perfect storm, the company has had to respond.”</p><p id=\"6KSPS3\">Although the forthcoming impact assessment will not contain binding resolutions, a commitment to publicly sharing the results of the assessment — expected for some time in the second half of 2022 — is seen as signaling the media company’s willingness for dialogue and change.</p><p id=\"zsZWEV\">“We eagerly await the results of the impact assessment this summer – and expect other data brokers are going to receive similar kinds of pressure from responsible investors in the future,” said Smith. “This is just the beginning.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XT1BLULjRedQ7EbGZMe5KDglJrg=/0x410:5401x3238/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23426049/945287450.jpg",
  "description": "\"This is just the beginning,\" said union president Stephanie Smith.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}