{
  "title": "Thor: Love and Thunder’s cracked Mjolnir may be hiding an even cooler gadget",
  "url": "https://www.theverge.com/2022/4/18/23030386/thor-love-and-thunder-jane-hammer-undrjarn",
  "date": "2022-04-18T21:18:48.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mtVo1XEaVZ2BPGVjH2wMQzV6PSI=/546x0:2334x1192/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70764137/Screen_Shot_2022_04_18_at_11.46.12_AM.0.png\" />        <figcaption>Jane Foster gripping the hilt of Mjolnir. | Marvel Studios</figcaption>    </figure>  <p id=\"jVKUNz\">Though it’s very much felt as if Mjolnir’s days of being important in the Marvel Cinematic Universe were over, <a href=\"https://www.theverge.com/2019/7/20/20702385/marvel-cinematic-universe-disney-thor-4-love-and-thunder-natalie-portman-taiki-waititi\"><em>Thor: Love and Thunder</em></a><em> </em>is set to bring the magical weapon back and put it in the hands of Natalie Portman’s Jane Foster. In her brief appearance in <a href=\"https://www.theverge.com/2022/4/18/22945556/thor-love-and-thunder-teaser-trailer-mcu-disney\">the movie’s first trailer</a>, Jane’s new armor and ability to call a reformed Mjolnir to her suggests that she, along with Chris Hemsworth’s Odinson, will bear “Thor” as a title, a concept explored in Marvel’s <em>The Mighty Thor </em>comics from writer Jason Aaron and artist Russell Dauterman.</p><p id=\"8G9vEs\"><a href=\"https://www.marvel.com/articles/movies/thor-love-and-thunder-first-teaser\"><em>Thor: Love and Thunder </em>tells the story</a> of how the original Thor is pulled out of his adventurous but relatively chill retirement by the arrival of Gorr the God Butcher (Christian Bale), a killer on an intergalactic crusade to rid the universe of god-like aliens. Rather than relying on the Guardians of the Galaxy to deal with the God Butcher, Thor turns to his old allies Valkyrie (Tessa Thompson), who reigns as king of New Asgard, and Jane Foster, who’s now operating as the Mighty Thor and wielding the enchanted hammer. It’s unclear just how much of Jane’s comic book path to becoming Thor <em>Love and Thunder </em>will draw from, but what jumps out about her introduction in the trailer is how her Mjolnir appears to be formed from the fragments of the hammer destroyed in <em>Thor: Ragnarok</em>.</p><p id=\"qcVxRI\">Comics Mjolnir has been broken and put back together again on many occasions, but MCU Jane’s new Mjolnir feels like a nod to <a href=\"https://www.polygon.com/2019/6/26/18758890/war-of-the-realms-ending-marvel-comics-thor-mjolnir-loki-jane-foster\">Marvel’s 2019 <em>War of the Realms </em>event</a> and how comics Jane ends up with a far more fascinating signature weapon than an engraved mallet. </p>  <figure class=\"e-image\">        <img alt=\"Odinson and Mighty Thor discussing War Thor’s hammer.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/txBljMTauTHnxE-yDuB2C47qWiU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23398266/Image_from_iOS.jpg\">      <cite>Russell Dauterman, Matthew Wilson, Joe Sabino/Marvel</cite>      <figcaption><em>Odinson and Mighty Thor discussing War Thor’s hammer</em></figcaption>  </figure><p id=\"8CA6nF\">Toward the end of <em>War of the Realms</em>, Jane and Odinson were forced to confront the berserker War Thor — an Asgardian driven mad by another universe’s Mjolnir. After War Thor’s defeat, Jane ended up taking his cursed weapon into battle herself, knowing full well that it was on the verge of breaking, and when it ultimately shattered, she was helpless to stop the strange energies trapped within it from bonding with her.</p><p id=\"hP8UWw\">By the end of <em>War of the Realms</em>, Jane’s time as Thor had firmly come to an end, but her days of wielding Mjolnir left her convinced that she had more to offer the universe as a hero. To that end, Jane became the newest Valkyrie — <a href=\"https://www.polygon.com/2019/4/18/18484789/marvel-new-valkyrie-thor-war-of-the-realms-comic\">an official job title in the comics</a> — and learned that the War Thor’s hammer was actually one of the many forms that could be assumed by <a href=\"https://marvel.fandom.com/wiki/Undrjarn\">Undrjarn, the All-Weapon</a>. During Jane’s tenure as Thor in the books, her ability to fling Mjolnir about in clever and complex ways is one of the many traits that sets her apart from Odinson. As Jane shifts into her new Valkyrie identity, her Thor-era ingenuity with the hammer’s translated into a much more expansive and imaginative fighting style due to Undrjarn being able to become any sort of weapon she can think of.</p><p id=\"h2fXRt\">Unlike Jane’s Thor-self, who sometimes grappled with Mjolnir compelling her to think and act like an Asgardian god, as Valkyrie, she’s depicted as being far more in touch with her typical human sensibilities. So far, Marvel hasn’t suggested either way whether <em>Love and Thunder </em>will dig into those newer elements of Jane’s lore like Undrjarn and the skills she develops as a Valkyrie. But doing so would immediately set Jane Foster up to stand out in <em>Love and Thunder</em>’s inevitable action sequences and for the character potentially take on a larger role in the MCU going forward.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fp7Ft6EFaVBawF-1KiYBywS1bE8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23398443/Image_from_iOS__1_.jpg\">      <cite>Ron Garney, Matt Milla, Joe Sabino/Marvel</cite>      <figcaption><em>Jane recapping how War Thor’s hammer revealed itself to be Undrjarn the All-Weapon</em></figcaption>  </figure><p id=\"mQMV8K\">Of course, the trajectories of Marvel’s comics and Marvel Studios’ films are radically different from one another, and it seems unlikely that <em>Thor: Love and Thunder</em>’s bringing MCU Jane Foster back just to show everyone how she decides to stop being Thor. With this being Marvel’s fourth <em>Thor </em>movie, though, <em>Love and Thunder</em>’s got its work cut out for it in terms of keeping the momentum on the Asgardians’ story moving forward in a compelling way. Jane Foster’s big-screen debut as the Mighty Thor is definitely going to help. But the question now is whether her return to the MCU is just a one-off thing or if <em>Thor: Love and Thunder </em>is just the beginning of her reign as Asgard’s newest defender.</p><p id=\"qn81qh\"><em>Thor: Love and Thunder</em> hits theaters on July 8th, 2022.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/iDt5_WO8vye2k4316Ho4sTHbS6o=/302x0:2579x1192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23397554/Screen_Shot_2022_04_18_at_11.46.12_AM.png",
  "description": "Jane Foster’s new magic hammer may be more than it seems.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}