{
  "title": "Three Thousand Years of Longing’s first trailer is a kaleidoscope of cautionary tales",
  "url": "https://www.theverge.com/2022/5/20/23075186/three-thousand-years-of-longing-trailer",
  "date": "2022-05-20T18:15:14.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/kyfLpAeTL4frbMpdVecAP_c63q0=/263x0:1630x911/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70893099/three_thousand_years_of_longing_xxlg.0.jpeg\" />        <figcaption>MGM</figcaption>    </figure>  <p id=\"9YLogt\">In <a href=\"https://www.theverge.com/2015/5/6/8559349/mad-max-fury-road-chase-scene-road-warrior-george-miller\">George Miller</a>’s upcoming <em>Three Thousand Years of Longing</em>, the key to getting the most out of magical wishes without suffering repercussions isn’t being clever or trying to outsmart the ancient djinn that’s been trapped in a bottle for countless lifetimes. It’s stalling.</p><p id=\"bW0M5b\"><em>Three Thousand Years of Longing — </em>an epic fantasy based on novelist A.S. Byatt’s short story “The Djinn in the Nightingale’s Eye” — tells the story of Dr. Alithea Binnie (Tilda Swinton), a solitary mythography scholar who’s almost entirely thrown herself into her work.  The movie’s new trailer finds Alithea on her way to Istanbul both for a conference and a bit of shopping at a bazaar where she just so happens to purchase the bottle containing a djinn (Idris Elba). Being the expert of myths and legends that she is, Alithea knows that taking the djinn up on his offer of three wishes is a surefire way to inadvertently end up ruining her life, and so she instead implores the djinn to tell her about the people he’s granted wishes for in the past.</p><p id=\"ITJnNa\">Questionable as some of <em>Three Thousand Years of Longing</em>’s optics are, the trailer’s fantastical visuals are both striking and sumptuous, both of which are promising signs for the film’s ability to make the most of its fairytale conceit.</p><p id=\"oZNRc3\"><em>Three Thousand Years of Longing</em> hits theaters on August 31st, 2022.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9263mjdROi_rMuPBw2557MWjE14=/76x0:1816x911/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23576836/three_thousand_years_of_longing_xxlg.jpeg",
  "description": "George Miller’s new film is based on A.S. Byatt’s The Djinn in the Nightingale’s Eye.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}