{
  "title": "Three ways the European Union might ruin WhatsApp",
  "url": "https://www.theverge.com/23001152/whatsapp-eu-digital-markets-act-messaging-interoperable",
  "date": "2022-03-29T14:00:00.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Qu4ctG6QK_QmfnEg800dOc80sh0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70684656/acastro_210119_1777_whatsapp_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p>WhatsApp chief Will Cathcart on how the Digital Markets Act could upend encryption, privacy, and product design</p> <p class=\"p--has-dropcap\" id=\"0XXtR2\">Today, let’s talk about Europe’s aggressive move to require big online messaging services to be interoperable, and see how WhatsApp is thinking about the contradictory mandates it’s receiving from regulators.</p><p id=\"fn33hv\">In Europe, two big ideas currently hold sway among the people regulating technology companies. One is that it should be easier to compete with tech giants, and that a good way to accomplish this is to force their services to play nicely with others. Two is that users’ data privacy is of paramount concern, and any data sharing between corporations is to be treated with the utmost suspicion.</p><p id=\"sG6Jzm\">It’s unclear the extent which regulators realize that, in hugely important ways, these ideas are often in conflict. But at the moment they are on an absolute collision course, and it doesn’t feel hyperbolic to say that the future of end-to-end encryption hangs in the balance.</p><p id=\"kRVOwi\">I have now written about global <a href=\"https://www.platformer.news/p/the-senates-sneak-attack-on-encryption?s=w\">threats</a> <a href=\"https://www.platformer.news/p/how-signal-is-playing-with-fire?s=w\">to</a> <a href=\"https://www.platformer.news/p/how-india-could-break-whatsapp-encryption?s=w\">encryption</a> <a href=\"https://www.platformer.news/p/q-and-a-with-whatsapps-will-cathcart?s=w\">enough</a> that I feel like a somewhat tedious party guest, always steering the conversation back to my pet issue no matter what else is happening elsewhere. But the aftermath of Russia’s invasion of Ukraine, in which <a href=\"https://www.independent.co.uk/news/world/europe/ukraine-moscow-protests-phones-war-b2030786.html\">Moscow police stopped antiwar protesters and rifled through the messages on their phones</a>, offered only the latest illustration of why it all matters: the ability to communicate privately in a world of ubiquitous expanding surveillance and data retention is of real, practical importance to almost all of us.</p><div id=\"AskrKE\"><iframe src=\"https://www.platformer.news/embed\" width=\"480\" height=\"320\"  frameborder=\"0\" scrolling=\"no\"></iframe></div><p id=\"F332TT\"></p><p id=\"NoDWg8\">On Thursday, <a href=\"https://www.theverge.com/2022/3/24/22994234/eu-antitrust-legislation-dma-digital-markets-act-details\">European officials reached an agreement on the Digital Markets Act</a>, a landmark piece of legislation that would reshape the ways in which tech giants compete with their rivals. The act applies to what it calls “gatekeepers” — defined as any platform that has a market capitalization of €75 billion, or more than €7.5 billion in European revenue. So: yes to WhatsApp and iMessage; no to Signal and Telegram.</p><p id=\"2DrjEH\">Among many other provisions, the DMA would likely bar Amazon from using data from its third-party sellers to inform its own product development, and require Android to offer users alternatives to Google search and email.</p><div class=\"c-float-right c-float-hang\"><aside id=\"GVvWpZ\"><q>Note: final text is still forthcoming</q></aside></div><p id=\"lrTQ5w\">I say likely because the current text of the agreement is not available for public inspection. I never feel more at risk of making an error than I do writing about the European Union’s legislative process; the last time I did so I had to publish corrections two days in a row. But my understanding is that what has been agreed upon is essentially a rough framework for the eventual law, and the final text is still forthcoming.</p><p id=\"835WMm\">Meanwhile, legislation is now being crafted in working groups; some of the language they are considering is leaking out and being <a href=\"https://twitter.com/benedictevans/status/1508138479468879874\">posted to Twitter</a> by various parties. Those leaks, combined with past public statements and previous draft legislation, is how we know anything about Europe’s plans for messaging apps.</p><p id=\"IJFlb4\">For example, what we know about the DMA’s plans for interoperability comes in part from <a href=\"https://twitter.com/benedictevans/status/1508138479468879874\">Benedict Evans tweeting language from the draft proposal</a>:</p><blockquote><p id=\"Afz526\">“Allow any providers of [messaging apps] upon their request and free of charge to interconnect with the gatekeeper’s [messaging apps]. Interconnection shall be provided under objectively the same conditions and quality that are available or used by the gatekeeper, its subsidiaries or its partners, thus allowing for a functional interaction with these services, while guaranteeing a high level of security and personal data protection.”</p></blockquote><p id=\"bgbJFJ\">Over the weekend, cryptography experts sounded the alarm about this idea, saying that platforms might not be able to do this in a way that leaves messages encrypted. As Alex Stamos of the Stanford Internet Observatory put it to me: “Writing the law to say ‘You should allow for total interoperability without creating any privacy or security risks’ is like just ordering doctors to cure cancer.”</p><p id=\"Duhi6Q\">The problems are straightforward enough; Corin Faife<a href=\"https://www.theverge.com/2022/3/28/23000148/eu-dma-damage-whatsapp-encryption-privacy\"> captured some of them here at <em>The Verge</em></a>:</p><blockquote><p id=\"ANFq84\">Given the need for precise implementation of cryptographic standards, experts say that there’s no simple fix that can reconcile security and interoperability for encrypted messaging services. Effectively, there would be no way to fuse together different forms of encryption across apps with different design features, said Steven Bellovin, an acclaimed internet security researcher and professor of computer science at Columbia University.</p><p id=\"HaPFlc\">“Trying to reconcile two different cryptographic architectures simply can’t be done; one side or the other will have to make major changes,” Bellovin said. “A design that works only when both parties are online will look very different than one that works with stored messages .... How do you make those two systems interoperate?”</p></blockquote><p id=\"cV66tQ\">Disdain for the new requirements is not universal; Matrix, a nonprofit organization working to build an open-source standard for encrypted communication, <a href=\"https://matrix.org/blog/2022/03/25/interoperability-without-sacrificing-privacy-matrix-and-the-dma\">published a blog post Friday explaining some possible technical paths forward</a>.</p><p id=\"PK8CLe\">But it’s clear that, to the extent that there might be a way for services like iMessage and WhatsApp to interoperate and preserve encryption, that way has yet to be invented.</p><p id=\"lXF02Y\">At the very least, it hasn’t yet been <em>built</em>.</p><hr class=\"p-entry-hr\" id=\"j0Hzqc\"><p id=\"kHu1Ln\">Owing in large part to the confusion over what exactly is being proposed, platforms have so far had little to say about the DMA and interoperability. (The giants lobbied against the DMA heavily, <a href=\"https://www.ft.com/content/cbb1fe40-860d-4013-bfcf-b75ee6e30206\">but apparently without much success</a>.) Apple and Google did not respond to requests for comment from me.</p><p id=\"ExHIn6\">But on Monday afternoon, I spoke to WhatsApp chief Will Cathcart over Zoom. End-to-end encryption has become WhatsApp’s signature project under Cathcart, both on the product side (it rolled out <a href=\"https://techcrunch.com/2021/10/14/whatsapp-now-lets-users-encrypt-their-chat-backups-in-the-cloud/\">encrypted backups last fall</a>) and the policy side (<a href=\"https://www.theverge.com/2021/5/26/22454381/whatsapp-indian-government-traceability-lawsuit-break-encryption-privacy\">fighting an ongoing legal battle to preserve encryption in India</a>).</p><p id=\"FDwVOp\">I asked how he was feeling about the DMA as he understands it so far.</p><p id=\"nuTcYO\">“I have a lot of concerns around whether this will break or severely undermine privacy, whether it’ll break a lot of the safety work we’ve done that we’re particularly proud of, and whether it’ll actually lead to more innovation and competitiveness,” Cathcart said.</p><p id=\"6rL3gB\">It’s easy to dismiss these concerns as self-interested: of <em>course</em> WhatsApp is going to oppose opening its doors to allow other apps to integrate themselves into its own user experience. But when I pressed Cathcart on WhatsApp on what would be so bad about it, his answers offered plenty of things for regulators and everyday WhatsApp users to worry about.</p><p id=\"2ZrEUH\">Among them:</p><ul><li id=\"akVJp6\"><strong>Spam</strong>. The centralized nature of WhatsApp lets it identify and remove spam before it hits your phone; it removes millions of accounts each month for trying. Third-party services that connect to WhatsApp might not be as aggressive, or might openly accept spam. “We’ve seen a lot of apps that just go out and market themselves as bulk messaging on the WhatsApp network,” Cathcart said. “What happens when one of those comes in and wants to interoperate?”</li><li id=\"jNfvDP\"><strong>Misinformation and hate speech</strong>. WhatsApp adopted forwarding limits to limit the viral spread of messages there after it was used to promote election hoaxes and violence; third-party services may be under no obligation to do so. Would a WhatsApp forwarding service be allowed to use the API? Would WhatsApp be required to let it?</li><li id=\"a6X3Sh\"><strong>Privacy</strong>. WhatsApp can guarantee users end-to-end encryption, and that its new disappearing messages actually get deleted, because it can see the entire chain of communication. It won’t be able to see what third-party apps do with messages after they’re delivered, though, raising fears that users could be exploited.</li></ul><p id=\"tVd2Bd\">How much of this do European regulators understand?</p><p id=\"ywgjW0\">“It’s really hard to say without being able to see what they decided,” Cathcart said. “I don’t know. Did they consult extensively with security experts? The reactions from a bunch of security experts that I’ve seen suggests that those experts, at least, weren’t consulted.”</p><p id=\"FFSa5K\">It’s also worth asking what interoperability will actually do to make the messaging market more competitive. Email is an open, interoperable standard and has been for decades; but today, <a href=\"https://www.litmus.com/blog/email-client-market-share-2021-q1/\">Apple, Google, and Microsoft own around 90 percent of the market</a>. Meanwhile, the market for messaging apps is much more dynamic even without interoperability: it includes apps from Meta, Telegram, Signal, Snap, and others.</p><p id=\"rKuWb7\">In part that’s because companies can add features more quickly when they don’t have to create open APIs to support them. Notably, <a href=\"https://assets.publishing.service.gov.uk/media/5e8c8ad1d3bf7f1fb5b9fee6/Snap_Inc_.pdf\">Snap said two years ago</a> that mandated interoperability would be “an own goal of huge proportions” for regulators, “since the end effect would be to ossify the market, foreclosing it to innovative newcomers.”</p><div class=\"c-float-right\"><aside id=\"uAvTyT\"><q>a clear case of one hand not knowing what the other is doing</q></aside></div><p id=\"XDRmOE\">All that said, I’m not totally immune to the lure of interoperability. As someone who spends most of my day switching between inboxes, the idea of having fewer places to send and receive messages has clear appeal. And I’m open to the idea that upstarts could use access to APIs from iMessage, WhatsApp and the like to put innovations in front of users faster than the typically slower-moving tech giants, and grow more quickly as a result.</p><p id=\"NpGLke\">But Europe’s simultaneous push for increased competition and maximum user privacy feel like a clear case of one hand not knowing what the other is doing. The fact of the matter is that almost no one I have read or spoken with believes you can do both, at least not in the way that the EU has proposed. And any solution that materializes may open up worrisome new vulnerabilities around privacy, misinformation, hate speech, and other danger zones.</p><p id=\"h6ecRz\">Regulation is always a matter of attempting to solve old problems without trying to create too many new ones in the process. But doing that successfully requires developing a deep technical understanding of the issues at stake, and discussing them with experts in public. So far, the European Union hasn’t shown much evidence of doing either.</p><p class=\"c-end-para\" id=\"tuIjDo\">For encrypted messaging to have a real future, that’s going to have to change, and soon.</p><p id=\"nDIqZF\"></p><p id=\"U4IHPj\"></p><p id=\"MbpiF2\"></p><p id=\"U3mA1L\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MD0eT-m-uto-M_MHFTRUrF_FHDk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22245551/acastro_210119_1777_whatsapp_0003.jpg",
  "description": "Is compatibility compatible with privacy — or competition?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}