{
  "title": "TikTok opens AR effects tool to all users",
  "url": "https://www.theverge.com/2022/4/12/23021780/tiktok-ar-effect-house",
  "date": "2022-04-12T15:46:38.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4z3C8_uLivrdk_JAAlJYxsPRSek=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740216/acastro_190723_1777_tiktok_0002.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Fa6J4c\">TikTok is rolling out its augmented reality effects tool to all creators and developers after launching a <a href=\"https://www.theverge.com/2021/8/24/22639081/tiktok-effects-house-studio-private-beta-launch\">closed beta test</a> last fall. </p><p id=\"QHGsd7\"><a href=\"https://newsroom.tiktok.com/en-us/effect-house\">Effect House</a> allows creators to make their own AR camera effects that can be used by other TikTok users in videos. In an announcement, the company says the effects platform will be open to “all creators, designers, and developers from around the world” and will include tools and learning resources.</p><p id=\"TiaTLG\">“Whether you’re teleporting into new worlds with Green Screen or freeze-framing with Time Warp Scan, creative effects empower creators to express themselves, entertain, and share stories through a wide array of engaging and immersive formats,” the company wrote.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gG6FFu7eKtXY146hSSk-KX3Y-Pw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23384259/9d4b5ce10cc94d6ff05fb83b687bf159.png\">  </figure></div><p id=\"M76unt\">TikTok says submitted effects will be subject to certain guidelines in order to be approved for use. The company specifically says it will prohibit effects that “promote colorism or negative stereotypes against protected groups” and effects that “depict cosmetic surgery, such as lip fillers, or encourage scrutiny of someone’s appearance.”</p><p id=\"rORZNe\">Effects like Green Screen are a mainstay in popular TikTok content, and creators often make videos using effects as part of a trend. TikTok says more than 1.5 billion videos using effects have racked up over 600 billion views globally. </p><p id=\"tUnPxn\">TikTok is following moves other platforms made years ago. <a href=\"https://www.theverge.com/2017/12/14/16770088/snap-lens-studio-snapchat-lenses-filters-download-mac-windows\">Snapchat</a> and <a href=\"https://www.theverge.com/2019/8/16/20808954/instagram-face-filters-facebook-videos-effects-how-to-spark-ar-studio\">Instagram</a> introduced similar AR creator tools over the past several years, with some effects catching on and popping up on celebrity and influencer pages. The <a href=\"https://www.theverge.com/2019/2/27/18212783/instagram-creator-effect-filters-beta-program\">Beauty3000 Instagram filter</a>, created by designer Johanna Jaskowska, is credited with temporarily igniting a trend of glossy, futuristic face effects on the platform.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-NlPmQrY2z7476PqvRdKuyxw1EU=/0x232:2040x1300/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331846/acastro_190723_1777_tiktok_0002.0.jpg",
  "description": "Effect House will be open to all users worldwide.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}