{
  "title": "TikTok users can now credit specific videos to make sure viral creators get their due",
  "url": "https://www.theverge.com/2022/5/19/23129437/tiktok-credit-tag-individual-video-feature",
  "date": "2022-05-19T11:09:21.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/WDmbLh6k3s9ETRpy-BuJ9ERqSHE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70886719/acastro_200803_1777_tikTok_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"gnjeug\">TikTok is offering users <a href=\"https://newsroom.tiktok.com/en-us/crediting-tools\">a new way to credit videos</a> that kick off viral trends. </p><p id=\"HFiCMA\">When uploading content, users will be able to tag not only individual creators in video descriptions, but also specific videos — an addition the platform claims will “better enable creator credit and equitable attribution for our creator community and content originators.”</p><p id=\"P9kwEF\">The change is, in part, a response to complaints by users that the platform thrives off a parasitic approach to viral content. Last summer, for example, a number of Black dance creators <a href=\"https://www.washingtonpost.com/lifestyle/2021/06/25/black-tiktok-strike/\">went on strike</a> from the app, noting how many viral dances (like the Renegade and the Savage, etc) were created by Black users before spreading to the rest of the community without due credit or attribution. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/am8lFWZ9B7IKFxNeycmWYELYzB0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23570389/19f8d2fd02604ecfb20038687b4dc355.png\">      <cite>Image: TikTok</cite>      <figcaption><em>How to credit a viral video — a step-by-step guide from TikTok. </em></figcaption>  </figure><p id=\"C4IOMD\">It’s a pattern of exploitation that’s existed in digital spaces long before TikTok rose to prominence. Writing in <em>Wired</em> in 2016, for example, Latoya Peterson noted how short-for video progenitor Vine also <a href=\"https://www.wired.com/2016/10/how-vine-overlooked-the-people-of-color-who-made-it-amazing/\">overlooked Black creators</a> who gave the platform some of its most enduring and original output. On TikTok, though, the problem of attribution is arguably intensified by the app’s capacity to spread viral trends through shared audio and hashtags. </p><p id=\"RynK5c\">Keeping creators happy is a big part of maintaining a platform’s longevity, which TikTok’s director of creator community, Kudzi Chikumbu, alluded to in a post announcing the change. </p><p id=\"ghtFR3\">“These features are an important step in our ongoing commitment to investing in resources and product experiences that support a culture of credit, which is central to ensuring TikTok remains a home for creative expression,” wrote Chikumbu. “Whether taking part in the latest trend, adding a punchline to a joke, or creating the next viral sound, creators can easily and directly cite their inspiration.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/yYO_RezbsiRKU534Jsv2c7ece64=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21694346/acastro_200803_1777_tikTok_0001.0.jpg",
  "description": "TikTok wants to make sure viral creators get credit they deserve",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}