{
  "title": "TikTok-viral Unofficial Bridgerton Musical wins Grammy for best musical theater album",
  "url": "https://www.theverge.com/2022/4/4/23009913/bridgerton-tiktok-unofficial-musical-grammy-win-netflix",
  "date": "2022-04-04T17:21:54.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"Tessellated TikTok logos against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/CK0UVkKAMWTYwNUUkCofZD8MWU8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70708677/acastro_190723_1777_tiktok_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"0YIHLi\"><em>The Unofficial Bridgerton Musical</em> took home the Grammy for best musical theater album last night, marking the first Recording Academy win for a project that began on TikTok. </p><p id=\"yoz83l\">Emily Bear and Abigail Barlow created songs inspired by the Netflix hit series <em>Bridgerton</em>, racking up millions of views on TikTok since early 2021. Writing from the perspective of characters on the show, Bear and Barlow used TikTok to solicit suggestions, interact with fans, and share the songwriting process with viewers. The duo released songs as they were completed and eventually recorded and released a 15-song album in September. Netflix did not immediately respond to a request for comment.</p><p id=\"X1Ke1n\">“A year ago when I asked the internet, ‘What if <em>Bridgerton</em> was a musical?’ I could not have imagined we would be holding a Grammy in our hands,” Barlow said in her acceptance speech. “We want to thank everyone on the internet who has watched us create this album from the ground up. We share this with you.”</p><p id=\"igvPvN\">Other nominees in the category were Andrew Lloyd Webber’s <em>Cinderella</em>, Burt Bacharach and Steven Sater’s <em>Some Lovers</em>, Broadway’s <em>Girl from the North Country</em>,<em> Les Misérables: The Staged Concert</em>, and Stephen Schwartz’s <em>Snapshots</em>.</p><p id=\"TcSKTT\">Bear and Barlow’s win is just another example of how viral hits on TikTok can translate to more traditional off-platform success for creators, even without an established mainstream presence. The company reported that <a href=\"https://www.theverge.com/2021/12/13/22832231/tiktok-2021-roundup-music-songs\">430 songs reached 1 billion views</a> last year — more than three times as many as in 2020 — with 175 viral songs charting on the Billboard Hot 100. </p><p id=\"NW80uh\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gGRtqOl8BuJLKbMIib87tuEQrq0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331847/acastro_190723_1777_tiktok_0001.0.jpg",
  "description": "The Grammy-winning Bridgerton musical started on TikTok.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}