{
  "title": "TikTok is banning misgendering, deadnaming, and content promoting disordered eating",
  "url": "https://www.theverge.com/2022/2/8/22924019/tiktok-bans-misgendering-deadnaming-disordered-eating",
  "date": "2022-02-08T21:42:13.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"The TikTok music note logo against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/OdQ3GT4biFzy0d3AU3jrVSEyP6A=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70485524/acastro_190723_1777_tiktok_0003.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"jT9UmI\">TikTok is <a href=\"https://newsroom.tiktok.com/en-us/strengthening-our-policies-to-promote-safety-security-and-wellbeing-on-tiktok?\">updating its community guidelines</a> and rolling out new features that the company says will support the well-being of its users. Some of the policy changes crack down on content the company has previously come under fire for, including videos that critics say glorify eating disorders and dangerous viral challenges.</p><p id=\"ypeWRv\">The company announced today it would begin removing videos that promote disordered eating symptoms like short-term fasting and overexercising. Content promoting eating disorders is already banned on the platform, but news reports have <a href=\"https://www.buzzfeed.com/cameronwilson/tiktok-eating-disorder-videos-algorithm-for-you-page\">repeatedly</a> <a href=\"https://www.wsj.com/articles/how-tiktok-inundates-teens-with-eating-disorder-videos-11639754848\">shown</a> users are exposed to videos featuring unhealthy eating habits. During <a href=\"https://www.theverge.com/2021/10/26/22747330/snap-tiktok-youtube-facebook-papers-blumenthal-coppa-kids-child-safety\">an October congressional hearing</a>, senators pressed TikTok representatives on further protecting young users.</p><p id=\"f4uheU\">“We’re making this change, in consultation with eating disorders experts, researchers, and physicians, as we understand that people can struggle with unhealthy eating patterns and behavior without having an eating disorder diagnosis,” the company says in today’s announcement. </p><p id=\"D6MOXJ\">The policy changes also add to a ban on hateful ideologies, explicitly banning deadnaming, misgendering, and misogyny, as well as content promoting conversion therapy. </p><div class=\"c-float-right\"><aside id=\"JHKMHY\"><q>Over 91 million videos — accounting for around 1 percent of videos uploaded — were removed for content violation in the third quarter of 2021</q></aside></div><p id=\"FnENcA\">Critics of the social media giant have raised alarm over dangerous challenges and hoaxes circulating on the platform. In addition to adding more detail to the <a href=\"https://www.tiktok.com/safety/en-us/online-challenges/\">online challenges policy</a>, TikTok says it will release a series of videos made with creators to help viewers assess content they come across. Videos will appear in the #SaferTogether hub on the Discover page, the company says.</p><p id=\"PHUn5b\">Over 91 million videos — accounting for around 1 percent of videos uploaded — were removed for content violation in the third quarter of 2021, according to a <a href=\"https://www.tiktok.com/transparency/en-us/community-guidelines-enforcement-2021-3/\">TikTok transparency report</a> published today.</p><p id=\"p2DDYT\">“We use a combination of technology and people to identify and remove violations of our Community Guidelines, and we will continue training our automated systems and safety teams to uphold our policies,” the company says in its announcement.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/G77pE8z25QsJ10zp_NJUapTQmXo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331845/acastro_190723_1777_tiktok_0003.0.jpg",
  "description": "The new changes tighten what falls under banned content.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}