{
  "title": "TikTok is rolling out its Snapchat-style stories to more users",
  "url": "https://www.theverge.com/2022/3/17/22983504/tiktok-snapchat-stories-rollout-feature",
  "date": "2022-03-17T20:56:23.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"Tessellated TikTok logos against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/ctgKpe8aDWppdlW3Jr82lkdpX4A=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70637773/acastro_190723_1777_tiktok_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"oVnLzg\">TikTok’s <a href=\"https://www.theverge.com/2021/8/4/22610011/tiktok-stories-snapchat-feature-social-media\">experiment with Snapchat-style stories</a> is continuing, with the company further rolling out the feature to a larger group of users today. If you’ve gotten the feature, you’ll be greeted with a new banner when you launch the app encouraging you to create a story. </p><p id=\"oPhSuo\">In a statement <a href=\"https://techcrunch.com/2022/03/17/tiktok-stories-expanded-pilot-feature/\">provided to <em>TechCrunch</em></a>, TikTok noted that “Currently, we’re expanding a pilot test, which provides creators with additional formats to bring their creative ideas to life for the TikTok community,” although that doesn’t say how many users are currently included in the test or what the future rollout of the feature will look like. </p><p id=\"kGNv1s\">Adding a video or photo to a story works extremely similarly to taking a photo or video for TikTok’s standard feature, with the same editing tools, effects, filters, and sounds. Unlike a regular TikTok video, though, stories won’t show up directly on your profile or feed and disappear after 24 hours. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/4j5pDf_hMPqfBNSE4enpbe1iUQc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23324811/tiktok.png\">  </figure><p id=\"KoOuc9\">TikTok stories are also missing a major feature that Instagram, Facebook, Snapchat, Whatsapp, and others all offer — critically, it lacks the scrolling bar of stories from accounts you follow to tap through (although images from TikTok’s earlier test show that the company was experimenting with a pop-over vertical window that would have served a similar function). </p><p id=\"OICQXd\">Right now, though, the only way to see a TikTok story (assuming you’ve been selected to try the feature out) is to see a blue-circled profile picture on a video you’re watching. Tap it, and you’ll launch you straight into the story feed for that user. You can also see the same blue circle on a user’s profile if you’re viewing it, and tapping the profile picture there will also let you view the story. </p><p id=\"GFMavA\">Still, given the popularity of stories in other social media apps and TikTok’s ongoing tests, it seems like a formal rollout of the feature to the entire TikTok user base is less a question of “if?” and more “when?”.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gGRtqOl8BuJLKbMIib87tuEQrq0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331847/acastro_190723_1777_tiktok_0001.0.jpg",
  "description": "Every app adds stories eventually.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}