{
  "title": "TikTok faces investigation into its impact on young people’s mental health",
  "url": "https://www.theverge.com/2022/3/2/22958900/tiktok-state-ag-investigation-teens-kids-mental-physical-health",
  "date": "2022-03-02T23:33:53.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"The TikTok music note logo against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/qAxkDLDAl_ZMdQcaQPy2AYxcWo8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70572178/acastro_190723_1777_tiktok_0003.0.0.jpg\" />        <figcaption><em>Several state attorneys generals are looking at TikTok’s methods of keeping kids on the platform.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"l67rXL\">A coalition of state attorneys general from California, Florida, Kentucky, and more is investigating TikTok for its potential effect on young people’s mental and physical health (<a href=\"https://www.cnbc.com/2022/03/02/bipartisan-state-ags-investigating-tiktoks-impact-on-kids-and-teens.html\">via <em>CNBC</em></a>). The group of AGs is looking to see if the way TikTok designs, operates, and markets its platform has a negative effect on children, teens, and young adults’ health, according to a <a href=\"https://www.mass.gov/news/ag-healey-co-leads-bipartisan-nationwide-investigation-into-tiktok\">press release from</a> Attorney General Maura Healey of Massachusetts.</p><p id=\"bbr7Wd\">TikTok’s algorithm determines what content users see, and has proven remarkably effective at keeping users engaged on the app. While the company has <a href=\"https://www.theverge.com/2020/6/18/21296044/tiktok-for-you-page-algorithm-sides-engagement-data-creators-trends-sounds\">offered some insight into how it works</a>, it’s hard to get a grasp on exact details outside of <a href=\"https://www.theverge.com/2021/12/6/22820305/tiktok-algorithm-explained-leak-how-it-works\">leaks</a> and educated guesswork. The attorneys general may be looking to change that, though — the investigation will focus on “the methods and techniques” TikTok uses to “boost young user engagement, including increasing the duration of time spent on the platform,” according to Healey. </p><div class=\"c-float-right\"><aside id=\"IrToLK\"><q>How TikTok keeps people watching and engaging with content is somewhat mysterious</q></aside></div><p id=\"WMg6ZP\">TikTok has struggled in the past to meet the needs of its younger users — it <a href=\"https://www.theverge.com/2019/2/27/18243312/tiktok-ftc-fine-musically-children-coppa-age-gate\">had to pay $5.7 million to the FTC</a> in 2019 to settle accusations that its predecessor, Musical.ly, didn’t get proper permission from the parents of young children who signed up to use the app. The settlement also required TikTok to <a href=\"https://www.theverge.com/2019/2/27/18243510/tiktok-age-young-user-videos-ftc-settlement-13-childrens-privacy-law\">strictly limit</a> how users under 13 could interact with content on the app. Recently, some researchers <a href=\"https://www.theverge.com/2021/11/29/22808011/tiktok-health-impact-research-plan\">sounded the alarm</a> about how few studies there were that looked into TikTok’s potential health impacts, despite its massive user base.</p><p id=\"JA7AnC\">TikTok spokesperson Ben Rathe told <em>The Verge</em> that the company “appreciate[s] that the state attorneys general are focusing on the safety of younger users,” and looks forward to “providing information on the many safety and privacy protections” it has for teens.</p><p id=\"97Q3bU\">The investigation could have an impact beyond just TikTok. Other social media companies like Meta and Snapchat have been <a href=\"https://www.theverge.com/creators/2022/2/3/22916642/snapchat-and-facebook-future-of-social-media-tiktok\">taking cues from the short-form video platform</a> when <a href=\"https://www.theverge.com/2021/12/13/22832529/instagram-reels-visual-replies-feature-tiktok-copy\">designing new features</a> or discussing the future of apps. Other apps duplicating TikTok’s short-form video model isn’t surprising; Meta employees <a href=\"https://www.theverge.com/22743744/facebook-teen-usage-decline-frances-haugen-leaks\">reportedly estimated</a> that teens spent more than double the time on TikTok that they spent on Instagram, and one report estimated that US Android users spent <a href=\"https://www.theverge.com/2021/9/7/22660516/tiktok-average-watch-time-youtube-us-android-app-annie\">more time watching TikToks than YouTube videos</a>. But the copying could lead to other platforms receiving increased scrutiny if the TikTok investigation results in legislation or other actions.</p><p id=\"qvEfoi\">As <a href=\"https://www.nytimes.com/2022/03/02/technology/tiktok-states-investigation.html\"><em>The New York Times</em> points out</a>, regulators have been paying extra attention to children’s safety online. President Biden <a href=\"https://www.theverge.com/2022/3/1/22957505/biden-children-kids-privacy-tech-facebook-instagram-frances-haugen-sotu\">addressed the topic in his State of the Union address</a> on Tuesday, calling on Congress to pass laws regulating privacy and advertising towards kids, and Facebook (now Meta) <a href=\"https://www.theverge.com/2021/10/5/22710371/facebook-whistleblower-congress-hearing-instagram-kids-safety-privacy-blumenthal\">found itself at the center of congressional hearings</a> last year after reports that it <a href=\"https://www.theverge.com/2021/9/15/22675130/facebook-instagram-teens-mental-health-damage-internal-research\">knowingly ignored internal research</a> about Instagram’s effect on teenagers’ mental health. Meta is also facing <a href=\"https://www.theverge.com/2021/11/18/22789886/states-attorneys-general-investigate-instagram-meta-child-safety-engagement\">its own investigation from state attorneys general</a>, with a similar focus as the TikTok investigation announced Wednesday.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/G77pE8z25QsJ10zp_NJUapTQmXo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331845/acastro_190723_1777_tiktok_0003.0.jpg",
  "description": "State AGs say they’ll look into how it keeps kids watching.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}