{
  "title": "TikTok expands maximum video length to 10 minutes",
  "url": "https://www.theverge.com/2022/2/28/22954525/tiktok-maximum-video-length-10-minutes",
  "date": "2022-02-28T14:56:15.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"Tessellated TikTok logos against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/315xxkWWW3nA3NOV0rripOS59us=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70559971/acastro_190723_1777_tiktok_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"13FiWH\">Is TikTok still a short-form video platform? It seems less and less so, after the company announced today that it’s expanding the maximum length for uploads to 10 minutes. TikTok has been testing ever-longer uploads for years, recently <a href=\"https://www.theverge.com/2021/7/1/22558856/tiktok-videos-three-minutes-length\">introducing three-minute videos</a> last July, but this latest update is the largest increase yet, and will now roll out globally.</p><p id=\"vJF7Bl\">“We’re always thinking about new ways to bring value to our community and enrich the TikTok experience,” said a company spokesperson in a statement given to <em>The Verge</em>. “Last year, we introduced longer videos, giving our community more time to create and be entertained on TikTok. Today, we’re excited to start rolling out the ability to upload videos that are up to 10 minutes, which we hope would unleash even more creative possibilities for our creators around the world.”</p><p id=\"zElyqV\">Some users were given the news as a notification within the app, as shared on Twitter by social media consultant and analyst Matt Navarra: </p><div id=\"S6VG06\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">TikTok creeping in on YouTube territory<br><br>I can now upload videos up to 10 minutes long <a href=\"https://t.co/P2Mbf4ygWV\">pic.twitter.com/P2Mbf4ygWV</a></p>— Matt Navarra (@MattNavarra) <a href=\"https://twitter.com/MattNavarra/status/1498263963632603146?ref_src=twsrc%5Etfw\">February 28, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"kPjxfW\">Although TikTok’s meteoric rise to popularity was founded on a never-ending stream of short videos tailored to catch users’ attention, the company has been <a href=\"https://www.wired.com/story/tiktok-wants-longer-videos-like-not/\">pushing longer content for a while now</a>. Longer videos allow TikTok to better compete with YouTube (which skews heavily toward lengthy content) as well as capture an older audience and increase overall engagement time on the app. At the same time, a switch to longer content may hurt the firm by limiting the amount of data it can collect on users’ watching habits, which is what allows it to customize the algorithms it uses to attract users in the first place. In other words: getting the length of content right is something of a balancing act.</p><p id=\"eszKl4\">Ironically, as TikTok expands to offer creators and users longer content, its rivals — spurred by TikTok’s success — have done the opposite. Instagram launched short-form videos in the form of Reels, YouTube has the aptly-named Shorts, and Snapchat offers what it calls Spotlight. All these companies are trying to get the formula right. </p><p id=\"Vu4HIL\">Speaking to <em>The Verge</em>, Navarra says longer-form content is, in general, “easier to monetize and keeps people on platform longer.” But he says TikTok will now need to work out exactly how to position and present these videos on its platform. “They could do with a dedicated home for longer-form content as [it] doesn’t sit so well in the vertical feed with shorter stuff people are used to whizzing through at speed,” he says.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gGRtqOl8BuJLKbMIib87tuEQrq0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18331847/acastro_190723_1777_tiktok_0001.0.jpg",
  "description": "The better to compete with YouTube",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}