{
  "title": "Tinder users can now run in-app background checks  ",
  "url": "https://www.theverge.com/2022/3/9/22969346/tinder-background-check-swiping-match-garbo-safety-dating",
  "date": "2022-03-09T22:31:18.000Z",
  "author": "Jasmine Hicks",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qbBx2KGrDVkdYA1rE2swFhvCVkY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70601531/acastro_180822_1777_tinder_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ngIqBx\">Tinder users in the US can now run background checks in-app to screen their matches for possible violent or harmful past behavior, the company <a href=\"https://www.tinderpressroom.com/2022-03-09-Garbo-Launches-Background-Check-Platform-To-Public-and-On-Tinder\">said in a news release.</a> The checks are via <a href=\"https://www.theverge.com/2021/3/15/22327854/match-group-garbo-tinder-background-check-update\">Tinder’s partnership with Garbo</a>, a nonprofit that runs online background checks (<a href=\"https://techcrunch.com/2022/03/09/tinder-rolls-out-in-app-access-to-background-checks-powered-by-nonprofit-garbo/\">via <em>TechCrunch</em></a>). </p><p id=\"Ly7aaf\">The searches will return results that Garbo says are “relevant to the user’s safety” and will exclude some information such as drug possession and loitering. The searches also won’t include personally identifiable information like addresses and phone numbers. According to Tinder, each user will have access to two free background check searches; after that, they’ll pay $2.50 plus a small processing fee per transaction that will directly fund Garbo’s operations and other fees associated with the searches.</p><p id=\"KtWzqa\">Users can perform background checks by pressing on the blue shield in the app, then going to the Safety Center, where they’ll select the Garbo article, which will then direct them to Garbo’s website. At first, users will only need to put in a match’s first name and phone number, but in the event that doesn’t yield results, users can put in more information, such as their match’s age. Users who receive a match that Garbo shows has a history of violence are encouraged to report the person to Tinder. The company also noted that a lack of history on a Garbo background check does not guarantee that a user is totally safe and urged users to follow its <a href=\"https://policies.tinder.com/safety/intl/en\">safety tips</a> for meetings with new people. </p><p id=\"udehp1\">Match Group also announced Wednesday that it is partnering with the National Domestic Violence Hotline to give users the ability to live chat with trained advocates. The feature is designed for users who are “seeking more information about healthy relationships and relationship abuse,” according to the news release. </p><p id=\"OMFn3o\">Tinder’s in-app background check is the latest safety-oriented feature the company has rolled out in the past few years. Last August, it <a href=\"https://www.theverge.com/2021/8/16/22627460/tinder-id-verification-users-safety\">added ID verification</a> and has had a <a href=\"https://www.theverge.com/2020/1/23/21077423/tinder-photo-verification-blue-checkmark-safety-center-launch-noonlight\">blue “verified” check mark</a> feature since 2020, which signals to swipers that their identity has been verified via photo.  </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KrewKstGphKdoDQ3tLkXf18Vqgg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12448953/acastro_180822_1777_tinder_0001.0.jpg",
  "description": "Checks will run through Match Group’s partner Garbo.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}