{
  "title": "Today I learned that the FBI has an 83-page guide to internet speak",
  "url": "https://www.theverge.com/2022/4/18/23030750/fbi-83-page-guide-internet-speak",
  "date": "2022-04-18T21:29:44.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OBshQejPPGYxeKg7qTfimXtHKnU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70764180/acastro_190228_1777_vpn_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"0MZ4pL\">Today I learned (TIL) there’s an <a href=\"https://archive.org/details/FBIGuideToInternetSlang/mode/1up\">83-page FBI “guide” to internet slang</a> filled with abbreviations entered either by a complete troll or someone totally clueless, as recently reported by <a href=\"https://www.inputmag.com/culture/fbi-guide-to-internet-slang\"><em>Input</em></a>. And yes, TIL is actually included in the guide, but so are thousands of other abbreviations that I’m convinced someone just made up. Because no one actually uses BTDTGTTSAWIO (been there, done that, got the T-shirt and wore it out) ...right? </p><p id=\"0d3xmU\">As <em>Input</em> points out, the FBI’s guide was made available through a 2014 Freedom of Information Act (FOIA) request. If you decide to check it out, you should know it’s in pretty crappy quality, but it’s still readable for the most part. <a href=\"https://www.theverge.com/2014/6/18/5819892/fbi-internet-slang-list\"><em>The Verge </em>actually reported on this</a> back when it was first released; it hasn’t been rehashed in a while (and it’s the first I’ve heard of it). Almost 10 years later, it’s still just as funny.</p><p id=\"h4Ih5E\">“With the advent of Twitter and other social media venues on the Internet, the use of shorthand and acronyms has exploded,” the guide explains. “The DI’s Intelligence Research Support Unit (IRSU) has put together an extensive — but far from exhaustive — list of shorthand and acronyms used in Twitter and other social media venues such as instant messengers, Facebook and MySpace.”</p><p id=\"Te1PX0\">It says it contains about 2,800 different examples of slang, which it says “you should find useful in your work or for keeping up with your children and/or grandchildren.” The guide also encourages agents to add more words to the list (and then describes how), which kind of makes me wonder if there was any kind of approval process for additional entries. </p><p id=\"0nNdCG\">Here are some of the most bizarre ones I found:</p><ul><li id=\"r6UUOV\">420: Drugs</li><li id=\"upVOvL\">BTWITIAILWU: By the way, I think I am in love with you</li><li id=\"FJuGVE\">DITYID: Did I tell you I’m depressed?</li><li id=\"YBTzZ0\">DBI: Douche bag index</li><li id=\"ZBulfQ\">MAP: Man-alien-predator</li><li id=\"j3vqhW\">MSR: Mulder Scully Romance</li><li id=\"hEPMnI\">NAK: Nursing at keyboard</li><li id=\"VLxc43\">PIMPL: Pee in my pants laughing</li><li id=\"fSvGpb\">PMT: Pre-menstrual tension</li><li id=\"eQscpe\">SF: Surfer-friendly (low graphics website)</li><li id=\"85NK3f\">TBM: Tactical boyfriend mention</li></ul><p id=\"P2DuCe\">Some of the words included aren’t even internet slang; they’re just straight-up abbreviations that people use in their careers, like DNR (do not resuscitate), DNS (domain name service, and HSPDA (high speed packet data access). Others are just complete misinterpretations, such as “LUL,” which apparently means “lame uncomfortable laugh,” and “LOLOL,” interpreted as “lots of laughing out loud.” If a more recent guide exists, I’d like to see how things have changed — and if the agents have any idea how to understand moderation filter-bypassing “<a href=\"https://www.washingtonpost.com/technology/2022/04/08/algospeak-tiktok-le-dollar-bean/\">algospeak</a>.”</p><p id=\"zGqJRr\">In any case, though, I have found some abbreviations I might want to start using, like IAMA (I am mildly amused) and maybe even LIMB (laughing in my brain).</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_OjWtqH43nD2KWqVwbiCFr5tDoM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14840738/acastro_190228_1777_vpn_0003.jpg",
  "description": "The FBI knows what you’re saying online (at least it thinks it does).",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}