{
  "title": "Today I learned a handy trick to zoom in and out of Google Maps",
  "url": "https://www.theverge.com/2022/2/3/22915748/google-maps-zooming-one-handed-shortcut-double-tap-apple-citymapper",
  "date": "2022-02-03T08:52:41.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6Subn9H-7gJJLYgkl94aEUaB8KM=/40x0:1240x800/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70465790/googlemaps.0.png\" />        <figcaption>Image: Google</figcaption>    </figure>  <p id=\"F2t1sW\">Did you know that Google Maps has a nifty little trick that lets you adjust zoom with just one finger? Because I sure as hell didn’t until yesterday, when a <a href=\"https://twitter.com/albn/status/1488912819802226695?s=21\">tweet from Sketchfab CEO Alban Denoyel</a> alerted me to its existence via a years-old <a href=\"https://www.youtube.com/watch?v=qj0_94Ri7D4&amp;t=1s\">YouTube video from 2013</a>. The shortcut is simple: just double-tap the maps interface, but instead of lifting your finger after the second tap (the shortcut for zooming in), you leave it touching the screen. Then a swipe up zooms out, and a swipe down zooms in. Neat right?</p><p id=\"WpkkTM\">With this knowledge you can say goodbye to awkwardly holding the phone and trying to use two fingers to reposition the map to check your directions when your other hand is busy holding a dog leash, coffee cup, shopping bag, or whatever. Personally I’m looking forward to using it the next time I’m on a bike and need to whip out my phone to quickly check directions. No more taking both hands off the handlebars for this guy. No sir. </p><p id=\"EWeBbl\">I haven’t done an exhaustive search, but it looks like this feature is pretty commonplace across mapping apps. It works on Google Maps on both Android and iOS, and also works in other iOS mapping apps like Apple Maps and CityMapper. Have fun!</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FHyv3_U6FGjDH_8Jo7wRlix-EVc=/0x65:1280x735/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19700731/googlemaps.png",
  "description": "Perfect when your other hand is otherwise engaged.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}