{
  "title": "Today I learned about the ‘secret’ Twitter DM inbox — here’s how to see it",
  "url": "https://www.theverge.com/2022/5/2/23053114/twitter-direct-messages-dm-request-filter-secret-inbox-til",
  "date": "2022-05-02T14:07:29.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Twitter’s blue bird silhouette logo is seen on a black background.\" src=\"https://cdn.vox-cdn.com/thumbor/VoHepBrcb9xYxB8dpYRUXMedmvk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70822128/acastro_180827_1777_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ROMXis\">Today I learned about a secret cache of Twitter DMs that’s hidden behind a privacy setting. For <a href=\"https://twitter.com/frankcifaldi/status/1520166422340509697?s=20&amp;t=SXz8iG6WKe9_o4ddCI_1lA\">some people</a>, this means uncovering a trove of important messages that they’ve missed out on, but if you’re like me, the discovery of a “hidden” inbox wasn’t all that exciting. In either case, it’s still worth checking to see if you might have any messages Twitter blocked you from viewing.</p><p id=\"VDJZHC\">As you might already know, Twitter has a few privacy settings for DMs. To adjust them, hit the DM icon on Twitter and select the settings cog in the top-right corner of the screen. There are a couple of settings you would’ve needed to have enabled to create a secret inbox in the first place, however.</p><p id=\"7Ao37k\">First, you needed to have the “Allow message requests from anyone” option checked. Otherwise, you wouldn’t have been able to receive any spammy messages (or what Twitter thinks is spammy) that got stowed away in a separate DM folder.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uK8p7A9KlEAGNCQ0j12MtIc1WDU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23432489/twitter_dms_privacy_options.png\">      <cite>Screenshot via Twitter</cite>      <figcaption><em>You’ll see the secret inbox with the “Filter low-quality messages” option checked off.</em></figcaption>  </figure><p id=\"N20yct\">Next, if you haven’t already, see if you’ve disabled the “Filter low-quality messages” option. You might’ve unchecked this setting long ago without realizing it. If you have, congratulations! You’ve been using the “secret” inbox the whole time. But if you haven’t, leave it that way — I found that the easiest way to read any messages you missed is to leave this box <em>checked</em>. When you navigate back to your message requests folder, scroll all the way to the bottom and click the “Show” button to view additional messages, some of which Twitter may have filtered for being offensive.</p><p id=\"mUDb3V\">Here, you’ll see all the messages Twitter’s been hiding from you. Once you’ve combed through them, feel free to uncheck the “Filter low-quality messages” box in your settings so you can merge these messages with your regular messages requests folder. Or, if you like the idea of a “secret” inbox, leave it checked off. </p><p id=\"pe4hbJ\">I can’t say I had an inbox full of life-changing messages or a bunch of friends trying to get in touch with me... just a single DM alerting me of a glaring typo in one of my previous articles, which obviously would’ve been a lot more helpful if I saw it earlier (thanks, Twitter).</p><p id=\"yNszuS\"></p><p id=\"89UbE0\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/31wcDz-dd7XKS5dJnkQVko0eII0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645609/acastro_180827_1777_0002.jpg",
  "description": "A trove of messages may await you.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}