{
  "title": "Toyota shuts down its Japanese factories after reported cyberattack",
  "url": "https://www.theverge.com/2022/2/28/22954688/toyota-cyberattack-factory-shut-down-cars-output",
  "date": "2022-02-28T15:35:28.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/G6fKvrtIaAR5ffx4fuQxss57nrA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70560240/akrales_180328_2351_0623.0.jpg\" />        <figcaption><em>Toyota will idle lines in several factories, producing about 13,000 fewer vehicles than expected.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"4wP6WQ\">A cyberattack has forced Toyota to shut down its factories in Japan, forcing the automaker to lose about 13,000 cars of output, <a href=\"http://reuters.com/business/autos-transportation/toyota-suspends-all-domestic-factory-operations-after-suspected-cyber-attack-2022-02-28/\">Reuters reports</a>. The attack was directed at a key supplier of plastic and electronic components to the company. </p><p id=\"VCsZ6L\">There was no immediate information as to who was behind the cyberattack, with Japanese Prime Minister Fumio Kishida telling reporters that his government would investigate whether Russia was involved. “It is difficult to say whether this has anything to do with Russia before making thorough checks,” he said, according to Reuters.</p><div class=\"c-float-right\"><aside id=\"52BhIP\"><q>“It is difficult to say whether this has anything to do with Russia before making thorough checks”</q></aside></div><p id=\"Omj1fi\">Japan is backing the US and other Western allies that are seeking to impose harsh financial sanctions on Russia over its invasion of Ukraine. Japan supports <a href=\"https://www.theverge.com/2022/2/26/22949156/russia-expelled-swift-ukraine-sanctions\">blocking some Russian banks</a> from accessing the SWIFT international payment system, and has said it would send $100 million in aid to Ukraine. </p><p id=\"nGBIC7\">Toyota said the attack that hit supplier Kojima Industries has forced the carmaker to suspend 28 assembly lines at 14 factories, affecting both first and second shift workers. “We apologize to our relevant suppliers and customers for any inconvenience this may cause,” the company said <a href=\"https://global.toyota/en/newsroom/corporate/36961051.html\">in a statement</a>.</p><p id=\"Uyc4lA\">“We will also continue to work with our suppliers in strengthening the supply chain and make every effort to deliver vehicles to our customers as soon as possible,” the company added.</p><p id=\"EnDwKJ\">The auto industry is in the midst of a number of crises that are affecting supply, including a <a href=\"https://www.theverge.com/2022/1/25/22900987/chip-shortage-report-biden-commerce-secretary-raimondo\">global shortage of semiconductor chips</a>. The results have included record high prices for customers, as well as supply chain disruptions. Automakers have been forced to idle factories and cancel work shifts in response. Likewise, the shift to electric vehicles has increased the demand for chips and other computer parts, mostly of the high-end varieties that can only be produced by the most advanced semiconductor foundries.</p><p id=\"EHH4MB\">Last month, Toyota, the largest automaker in the world, said it <a href=\"https://www.reuters.com/business/autos-transportation/toyota-expects-annual-production-target-shortfall-chip-shortage-drags-2022-01-18/\">expects to miss its annual production target of 9 million vehicles</a> because the chip shortage was affecting its ability to ramp up production. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EVBsH22D-EmFChqJ3sqnmAY1P6g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10558721/akrales_180328_2351_0623.jpg",
  "description": "The attack will force Toyota to lose 13,000 cars of output.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}