{
  "title": "Trump’s new social media app launches on iOS",
  "url": "https://www.theverge.com/2022/2/21/22944179/truth-social-launch-ios-donald-trump-twitter-platform",
  "date": "2022-02-21T13:24:34.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Pv-Vqx6k6uCSJLZ_Vry6pqWJ3XY=/0x0:1098x732/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70533294/Screen_Shot_2022_02_21_at_12.34.51_PM.0.jpg\" />        <figcaption><em>Truth Social’s listing in the App Store.</em> | Screenshot: Apple.com</figcaption>    </figure>  <p id=\"HJeNr9\">Truth Social, a social media network developed by former president Donald Trump’s new media company, is now live on <a href=\"https://apps.apple.com/us/app/truth-social/id1586018825\">the iOS App Store in the US</a>. <a href=\"https://www.reuters.com/technology/trumps-truth-social-app-launches-apple-app-store-2022-02-21/\"><em>Reuters</em> reports</a> that the iOS app was available to download shortly before midnight, eastern time, prior to Presidents Day on February 21st.</p><p id=\"qxnJN5\">The service appears to be closely modeled on Twitter, which was previously Trump’s preferred social media platform. The former president was <a href=\"https://www.theverge.com/2021/1/8/22218753/twitter-bans-trump-permanently-realdonaldtrump\">banned from the platform in early 2021</a> after Twitter <a href=\"https://blog.twitter.com/en_us/topics/company/2020/suspension\">said he was inciting violence</a> in the wake of the <a href=\"https://www.theverge.com/2021/1/6/22217411/capitol-building-lockdown-protesters-trump-supporters\">storming of the US Capitol building</a>.</p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wwBQkuOchXrfO9GXLJIcTX156Hg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23260689/image.png\">      <cite>Image: Truth Social / App Store</cite>      <figcaption><em>An image included on Truth Social’s App Store listing.</em></figcaption>  </figure></div><p id=\"Tc7eAI\">As of this writing, <a href=\"http://truthsocial.com/\">Truth Social’s website</a> is loading intermittently, but collecting names and email addresses for users who wish to sign up. When we visited the site in Chrome or Safari, it served the page to us over an HTTP connection, instead of automatically upgrading us to a more secure HTTPS session. Truth Social does support HTTPS, but it needs to be manually typed in at the beginning of the URL (although links pointing directly to the HTTPS version will result in a secure session). The site also includes a public commitment to open-source principles, a concession from <a href=\"https://www.theverge.com/2021/10/29/22752850/mastodon-trump-truth-social-network-open-source-gab-legal-notice\">its earlier conflict with the Mastodon project</a>.</p><p id=\"PQx7WD\">Some users who signed up through the site have been shown vague “Something went wrong” error messages, while others are reportedly being told that they’ve been put on a waitlist due to “massive demand” <a href=\"https://www.cnet.com/news/trumps-truth-social-debuts-in-apples-app-store/#ftag=CAD590a51e\">according to <em>CNET</em></a>. One reporter with the <a href=\"https://www.washingtonpost.com/technology/2022/02/21/truth-social-app-donald-trump/\"><em>Washington Post</em> said</a> their verification email failed to arrive.</p><p id=\"AuQfaw\">Conservative politicians and commentators have repeatedly criticized Twitter and other big tech companies for what they see as overly harsh moderation of right-wing views. In response, a wave of right-wing platforms have grown in popularity, including <a href=\"https://www.theverge.com/2021/5/17/22440005/parler-apple-app-store-return-amazon-google-capitol\">Parler</a>, <a href=\"https://www.theverge.com/2021/7/4/22563026/former-trump-gettr-platform-hacked-social-jason-miller\">Gettr</a>, and YouTube competitor Rumble.</p><p id=\"dq4Myw\">Instead of tweets, Truth Social reportedly refers to individual posts as “Truths” which are shown to users on a “Truth Feed.” If you see a “Truth” that you want to share with your followers, you can apparently “<a href=\"https://twitter.com/Tope_soft/status/1495489075595427848\">ReTruth</a>” it. Other features under development are support for direct messaging, as well as user verification, according to the platform’s chief product officer.</p><p id=\"pqQ2DD\">Truth Social has reportedly been in beta since December with around <a href=\"https://www.reuters.com/technology/exclusive-trump-app-opens-hundreds-testers-ahead-expected-launch-2022-02-17/\">500 users on the platform</a>. It’s being developed by Trump Media and Technology Group (TMTG), which is helmed by former Representative Devin Nunes. In an interview on Sunday with Fox News, Nunes said that he hoped the service would be “<a href=\"https://video.foxnews.com/v/6298226709001\">fully operational</a>” by the end of March.</p><p id=\"PFxuEg\">An exact launch date for the service’s Android app is yet to be announced, but Truth Social’s website says it’s coming to the Google Play Store “soon.”</p><p id=\"tdTuOr\">The launch comes a little under a year after Donald Trump’s previous attempt to launch a new “platform.” What resulted was closer in format to a <a href=\"https://www.theverge.com/2021/5/4/22419850/donald-trump-social-media-platform-ban-twitter-facebook\">regular blog</a> which was <a href=\"https://www.theverge.com/2021/6/2/22464930/donald-trump-blog-facebook-twitter-social-media-platform\">shut down less than a month later</a>. </p><p id=\"rTiAQk\"><em><strong>Correction February 21st, 9:45AM ET:</strong></em><em> This article originally stated that Truth Social’s website did not have HTTPS. This is incorrect. It does have HTTPS, but it doesn’t automatically redirect to it on every occasion. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VBhoqbXuE7_QzI03HQ9GjyOng7I=/0x79:1098x654/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23260660/Screen_Shot_2022_02_21_at_12.34.51_PM.jpg",
  "description": "With a Twitter-esque design.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}