{
  "title": "Trump’s social media app will reportedly go live on Presidents’ Day",
  "url": "https://www.theverge.com/2022/2/20/22943510/trump-social-network-truth-social-presidents-day-launch",
  "date": "2022-02-20T21:03:52.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"American Conservative Union Holds Annual Conference In Florida\" src=\"https://cdn.vox-cdn.com/thumbor/p1obQbyN2s_N7aSSwGxgxyUoan4=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70531817/1304610267.0.jpg\" />        <figcaption><em>Truth Social is expected to be available on February 21st.</em> | Photo by Joe Raedle/Getty Images</figcaption>    </figure>  <p id=\"nkThA3\">Former President Donald Trump’s social media app, <a href=\"https://apps.apple.com/us/app/truth-social/id1586018825\">Truth Social</a>, is expected to make its debut on Presidents’ Day, according to a report from <a href=\"https://www.reuters.com/world/us/exclusive-trumps-truth-social-app-set-release-monday-apple-app-store-per-2022-02-20/\"><em>Reuters</em></a>. In a test version of the app viewed by <em>Reuters</em>, the outlet saw a post from the network’s chief product officer (CPO) indicating the app’s February 21st launch.</p><div class=\"c-float-right\"><aside id=\"DU7Ltl\"><q>“By the end of March, we’re going to be fully operational”</q></aside></div><p id=\"iOB1Ei\">“We’re currently set for release in the Apple App store for Monday Feb. 21,” the executive — who goes by “Billy B” on Truth Social — reportedly said in response to a beta tester’s question about the app’s public release date. Truth Social <a href=\"https://www.globenewswire.com/news-release/2021/12/14/2352123/0/en/Trump-Media-Technology-Group-Announces-Partnership-with-Rumble-Inc.html\">has been open to “invited guests only”</a> as early as December, with around <a href=\"https://www.reuters.com/technology/exclusive-trump-app-opens-hundreds-testers-ahead-expected-launch-2022-02-17/\">500 beta testers later gaining access</a> to the network.</p><p id=\"aHlxsj\">Former Representative Devin Nunes, who <a href=\"https://www.theverge.com/2021/12/6/22821450/devin-nunes-ceo-tmtg-spac-dwac-truth-social-media\">now serves as Trump Media and Technology Group’s (TMTG) CEO</a>, offered more information about the app <a href=\"https://video.foxnews.com/v/6298226709001\">in an interview with Fox News’ Maria Bartiromo</a> on Sunday. While he didn’t explicitly mention a Presidents’ Day release, he did say the app would hit the App Store sometime this week. “This week, we’ll begin to roll out [to] people on the Apple App Store,” Nunes said. “By the end of March, we’re going to be fully operational, at least within the United States.”</p><p id=\"05Q0zD\">As noted by <em>Reuters</em>, CPO Billy B. also answered beta testers’ questions about the platform itself, which, so far, looks like it closely resembles its Silicon Valley rival, Twitter. In response to a question about users’ ability to edit their “truths,” or posts, the executive said, “not yet.” The lack of an edit feature at launch is kind of funny, especially for a platform that’s supposed to directly compete with Twitter (which still doesn’t let users edit tweets, much to everyone’s discontent). The executive also revealed that Truth Social is working on a direct messaging feature, the ability to sign up to receive notifications about new content, as well as a user verification policy, <em>Reuters </em>reports.</p><p id=\"ufM1hI\">Late last week, a <em>New York Times </em>report <a href=\"https://www.theverge.com/2022/2/18/22940947/trump-twitter-clone-truth-social-delayed\">suggested the app’s release date has been pushed back</a> until March, potentially due to the <a href=\"https://www.theverge.com/2021/12/6/22820389/sec-trump-spac-deal-investigation-truth-social-media-platform-public\">Security and Exchange Commission's investigation into Trump’s SPAC deal</a> to take TMTG public. But now, it seems Truth Social might be on track for <a href=\"https://www.theverge.com/2022/1/6/22871167/trump-truth-social-app-network-launch-february-tmtg\">its scheduled release date after all</a>, although it’s still unclear when and if an Android version of the social network will be released. <em>The Verge</em> reached out to TMTG with a request for comment but didn’t immediately hear back.</p><aside id=\"7ntF6O\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Donald Trump’s new social media SPAC, explained \",\"url\":\"https://www.theverge.com/2021/10/21/22738240/donald-trump-truth-social-spac-dwac-stock-merger\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/CIWelf4w_pYqSJrCn001vcUWLWM=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23259423/1304610267.jpg",
  "description": "It’s coming to the Apple App Store first.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}