{
  "title": "TSMC’s Arizona fab reportedly runs into construction delays",
  "url": "https://www.theverge.com/2022/2/15/22935172/tsmc-arizona-factory-fab-construction-delays-semiconductor-shortage",
  "date": "2022-02-15T22:24:49.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"TSMC Became Asia Most Valuable Listed Company\" src=\"https://cdn.vox-cdn.com/thumbor/fUkauUfVvdfPhzSBOhOwnPfn35o=/0x1:3081x2055/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70514327/1237987815.0.jpg\" />        <figcaption>Photo credit should read Long Wei / Costfoto/Future Publishing via Getty Images</figcaption>    </figure>  <p id=\"72XJe4\">TSMC’s new Arizona chip-making plant has run into construction delays, according <a href=\"https://asia.nikkei.com/Business/Tech/Semiconductors/Construction-of-TSMC-s-U.S.-chip-plant-delayed-by-labor-crunch-COVID\">to a new report from <em>Nikkei Asia</em></a>, which notes work has fallen three to six months behind schedule due to a mixture of labor shortages, COVID-19 surges, and complexities in obtaining construction licenses. </p><p id=\"CBYnHa\">According to <em>Nikkei Asia</em>’s report, TSMC originally hoped that the construction of facilities would have reached the point that it’d be able to start moving in chip-making equipment by September. It’s now expecting to have to push that to early 2023 instead. </p><p id=\"K6kovu\">It’s important to note that the delays here aren’t actually directly related to chip-making — it’s not that TSMC can’t get a hold of enough semiconductor production equipment. Rather, it seems the delay is more mundane, centered on the difficulties of building a gigantic industrial facility. The fact that TSMC is on slightly unfamiliar ground (the Arizona factory is set to be its first advanced site in the US) is likely a contributing factor here, too. </p><aside id=\"wc1q79\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Apple supplier TSMC confirms it’s building an Arizona chip plant\",\"url\":\"https://www.theverge.com/2020/5/14/21259094/apple-tsmc-factory-chips-arizona-a-series\"}]}'></div></aside><p id=\"Ggk8eZ\">That timeline is key: as <em>Nikkei Asia</em> explains, once chip-making equipment is installed, it can still take up to a year to get everything certified and production started. For comparison, it typically takes TSMC two years to go from breaking ground to production for its fabs in Asia; the Arizona plant, which started construction in June 2021, may not start producing chips until sometime in early 2024, though. </p><p id=\"CmRDdx\">That said, the report notes that TSMC still hopes to make up lost time and adhere to its schedule, with the company telling <em>Nikkei Asia</em> that its production schedule was unchanged from its original plan. </p><p id=\"bNs6aJ\">Still, the TSMC delay is a reminder — especially as other companies like <a href=\"https://www.theverge.com/2022/1/22/22895447/intel-ohio-chip-fab-manufacturing-cpu-processor-explained\">Intel look to ramp up their own US-based production</a> — of the difficulties in starting up a fab, even for the most experienced of companies. And it’s a stark example of how solving the ongoing semiconductor shortage by expanding chip-making capacity is easier said than done. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/g_3Hxl3GcEp_xjXMK9aWxxI0Q5A=/0x222:3081x1835/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23248091/1237987815.jpg",
  "description": "The delays are due to ordinary construction issues, not semiconductor ones.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}