{
  "title": "Turtle Beach’s new wireless headset works on PlayStation, Xbox, and more",
  "url": "https://www.theverge.com/2022/3/1/22956334/turtle-beach-stealth-600-gen-2-max-wireless-headset-xbox-playstation-ps5-pc-nintendo-switch-usb",
  "date": "2022-03-01T19:10:55.000Z",
  "author": "Cameron Faulkner",
  "content": "      <figure>      <img alt=\"Turtle Beach Stealth 600 Gen 2 Max\" src=\"https://cdn.vox-cdn.com/thumbor/KUaU7w74WC-6GLKDh-sPJf6pa28=/0x1:3000x2001/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70566190/TB_600XB_GEN2_MAX_BLK_LIFESTYLE_1.0.jpg\" />        <figcaption><em>The Stealth 600 Gen 2 Max will arrive in black, white camo, or red.</em> | Turtle Beach</figcaption>    </figure>  <p id=\"0PKN3j\">Turtle Beach has announced the Stealth 600 Gen 2 Max, a new $129.99 wireless headset that’s one of a few models out there that can work with Xbox and a myriad of other platforms. Typically, you get compatibility with Xbox or with other platforms like PlayStation, PC, and the Nintendo Switch’s dock, but not both. This headset’s included USB-A audio transmitter has a switch that can toggle wireless modes, ensuring compatibility no matter which system you’re on. It’s worth noting that <a href=\"https://www.theverge.com/2020/4/20/21228019/steelseries-arctis-1-pro-wireless-xbox-one-series-x-cyberpunk-2077\">SteelSeries offered a similar feature with its Arctis 1 Wireless headset back in early 2020</a> (albeit with a fancier USB-C dongle), but it’s still generally difficult to find a headset that can accomplish this feat.</p><p id=\"jxX0gQ\">Outside of this functionality, the ins and outs of the Stealth 600 Gen 2 Max are very similar to Turtle Beach’s previous model <a href=\"https://www.theverge.com/2020/8/13/21358560/turtle-beach-stealth-gen-2-600-700-gaming-headset-usb-c-charging-2020\">that was released in late 2020</a>. It features a flip-to-mute microphone, a USB-C charging port, and two dials along the edge of the left ear cup — one for adjusting volume and another for tweaking the game and chat audio. Next to those dials, you’ll also find a power button and a mode button, the latter of which is used to switch audio profiles, including Turtle Beach’s “Superhuman Hearing” profile that amplifies sounds like footsteps to help you get the drop on opponents. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/iBaj9jjQWJM5gsPRROIg1zkOcIk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23280312/tb600gen2maxdongle2.jpg\">      <cite>Turtle Beach</cite>      <figcaption><em>This is the dongle that’s included with the Stealth 600 Gen 2 Max.</em></figcaption>  </figure><p id=\"JpixS5\">There are just some other minor changes to note. The Stealth 600 Gen 2 Max comes in black, red, or white camo colorways, and Turtle Beach promises over 48 hours of battery life per charge. That’d be great if the headset’s performance lines up with the company’s claims.</p><p id=\"16VBv7\">Turtle Beach also announced the Stealth 600 Gen 2 USB, a $99.99 wireless headset that drops the Xbox compatibility. The company claims to offer over 24 hours of battery life per charge (improving on the standard Stealth 600 Gen 2’s 15-hour claim). Aside from those differences, it’s identical to the Max, as well as the previous Stealth 600 Gen 2 model.</p><p id=\"GT4i3e\">Both headsets will be available for preorder starting April 3rd, 2022, and Turtle Beach expects them to release in May.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/L81VHlF97qo3ftfpkUvV5Qef-Bo=/0x216:3000x1787/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23280211/TB_600XB_GEN2_MAX_BLK_LIFESTYLE_1.jpg",
  "description": "It multiplies the battery life of its Stealth 600 Gen 2.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}