{
  "title": "TweetDeck might become a paid Twitter Blue feature",
  "url": "https://www.theverge.com/2022/3/30/23003897/tweetdeck-paid-feature-twitter-blue-subscription-pro-power-user",
  "date": "2022-03-31T01:06:26.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u2L37jW1Y433YK_pj6u_RnPFXnQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70692303/acastro_200715_1777_twitter_0004.0.0.jpg\" />        <figcaption><em>It’d be a big selling point for the subscription service.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"tRPcKO\">It’s starting to look like the upcoming version of TweetDeck, the power-user-focused version of the Twitter app, won’t be free. Security researcher Jane Manchun Wong <a href=\"https://twitter.com/wongmjane/status/1509262161566085121/photo/1\">has discovered</a> a work-in-progress sign-up page for the app, which boasts that it’s a “powerful, real-time tool for people who live on Twitter” and offers an ad-free experience. </p><p id=\"MI1sWd\">While the page doesn’t explicitly say you’ll have to pay Twitter to access TweetDeck, companies don’t usually advertise “helps you avoid the thing that makes us money” as a feature of free products (even if, like the current version of TweetDeck, it is). And wouldn’t you know it, Twitter’s already got a paid subscription service that <a href=\"https://www.theverge.com/2021/11/14/22778827/twitter-blue-undo-button-paywall-features-paid-free\">it’s trying to sell to its power users</a>.</p><div class=\"c-float-right\"><aside id=\"Sx3vuZ\"><q>TweetDeck is essentially Twitter Pro — and used by the type of people Twitter Blue targets</q></aside><div id=\"3c9YhL\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Twitter is filling in the new <a href=\"https://twitter.com/TweetDeck?ref_src=twsrc%5Etfw\">@TweetDeck</a> signup page that they’re working on. Two new highlights:<br><br>1. A link for “the legacy version of TweetDeck” (even though it might be deprecated at some point in the future)<br><br>2. “Ad-free experience” being marketed as the selling point :P <a href=\"https://t.co/XP6sYsTUGM\">https://t.co/XP6sYsTUGM</a> <a href=\"https://t.co/fRc0ujZ7o2\">pic.twitter.com/fRc0ujZ7o2</a></p>— Jane Manchun Wong (@wongmjane) <a href=\"https://twitter.com/wongmjane/status/1509262161566085121?ref_src=twsrc%5Etfw\">March 30, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"KsA70V\">This isn’t the first time we’ve heard the suggestion that Twitter’s looking to monetize TweetDeck. Earlier this month, Manchun Wong <a href=\"https://twitter.com/wongmjane/status/1504239334861406208?s=20&amp;t=D73GZUrFr2WuYWTOT8H-dA\">dug up code</a> that seemed to redirect non-Blue subscribers trying to access the new version of TweetDeck to the Twitter Blue sign-up page. And over a year ago, <a href=\"https://www.bloomberg.com/news/articles/2021-02-08/twitter-considers-subscription-fee-for-tweetdeck-unique-content\"><em>Bloomberg</em> reported</a> that Twitter was considering a subscription service component to the app. That report came just before <a href=\"https://www.theverge.com/2021/3/9/22321991/twitter-tweetdeck-overhaul-redesign-product-changes\">we heard from Twitter</a> that it was working on a “big overhaul” for TweetDeck. </p><p id=\"0l9qjw\">We’ve seen <a href=\"https://www.theverge.com/2021/7/20/22585249/tweetdeck-redesign-twitter-column-deck\">a preview of that overhaul</a>. It’s extensive (<a href=\"https://www.theverge.com/2021/7/22/22587583/twitter-new-tweetdeck-preview-beta-hands-on-editorial\">and divisive</a>) and likely took a good amount of work. It’s not impossible that Twitter’s doing it as part of its drive to seem <a href=\"https://www.theverge.com/2021/11/15/22779149/twitter-api-version-2-official-decentralized\">more friendly towards the community and third-party developers</a>, but it feels more likely that the company <a href=\"https://www.theverge.com/2021/11/9/22766286/twitter-blue-subscription-service-scroll-nuzzel-undo-tweets-ad-free-articles-us\">launched Twitter Blue</a> knowing TweetDeck could be a huge selling point. </p><p id=\"ihFznI\">The $2.99 a month subscription already feels like it’s aimed at people who use Twitter professionally, so what’s essentially the pro version of its app would fit right into the service’s feature-set.</p><p id=\"deOKMh\">There is, of course, a counter-point to this theory: Twitter Blue isn’t ad-free. That fact even makes up <a href=\"https://help.twitter.com/en/using-twitter/twitter-blue#tbadfree\">two points in the FAQ for the service</a>. So how would TweetDeck being ad-free be evidence that it’ll soon be part of Twitter Blue?</p><p id=\"HZQH8U\">It’s a fair question, but honestly, that contradiction convinces me more — having TweetDeck as a Blue feature would let Twitter offer its paying subscribers a way to get an ad-free experience without it having to do the work of exorcising them from its web and mobile apps. It’s a bit of a win-win (for Twitter, at least).</p><p id=\"GksRfm\">Twitter said it had “nothing to share on this at the moment” in response to <em>The Verge</em>’s question about whether it had plans to monetize TweetDeck, and it hasn’t announced an official launch date for the TweetDeck update. When it does come, though, I suspect it gets billed as a great new perk for Blue subscribers. (And given how much my colleagues love TweetDeck, I also suspect there could be quite a few new subscribers to the service if that’s the case.)</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/giU_BUhPLHDoWcncob_qvRxDm-M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20086268/acastro_200715_1777_twitter_0004.0.jpg",
  "description": "It could bill TweetDeck as an \"ad-free experience\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}