{
  "title": "Twitter miscounted its daily users for three years straight",
  "url": "https://www.theverge.com/2022/4/28/23046170/twitter-miscounted-daily-users-three-years-q1-2022-earnings",
  "date": "2022-04-28T12:44:06.000Z",
  "author": "Jacob Kastrenakes",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3U25iUYwLwq13aSuY5GLZi2GD3U=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70804014/vpavic_210111_4366_0237.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"II0flY\">Twitter overstated the number of daily users on its service for three years straight, overcounting by up to 1.9 million users each quarter. The error was due to Twitter inadvertently counting multiple accounts as active when they were all tied to a single user, even if they weren’t all in use. These incorrect usage numbers were given for Q1 2019 through Q4 2021.</p><p id=\"ksxIKE\">This is, somehow, not the first time Twitter has done this. In 2017, Twitter <a href=\"https://mashable.com/article/twitter-overstated-users-monthly-active-trump-bump\"><em>also </em>realized</a> it had been overstating its user figures by about 1 million to 2 million users for three years. The repeat mistake was revealed today in Twitter’s <a href=\"https://s22.q4cdn.com/826641620/files/doc_financials/2022/q1/Final-Q1%e2%80%9922-earnings-release.pdf\">earnings release</a> for the first quarter of 2022.</p><p id=\"UhPymP\">The updated figures aren’t exactly a game-changer: Twitter now has 229 million daily users, which is still up more than 10 million, even from last quarter’s inflated number. But they are one final embarrassing slip-up for Twitter as the company wrangles a deal to be taken private, at which point it will no longer have to share these figures publicly.</p><div class=\"c-float-right\"><aside id=\"cEofpN\"><q>Twitter is withdrawing prior goals in light of its sale to Musk </q></aside></div><p id=\"R0QXGS\">Twitter reported an operating loss of $128 million on revenue of $1.2 billion, both in line with its own guidance for the quarter. Revenue rose 16 percent year over year, with Twitter citing “headwinds associated with the war in Ukraine.”</p><p id=\"2PU0gc\">On Monday, Twitter <a href=\"https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\">accepted a buyout offer</a> from Elon Musk, agreeing to give him control of the company for $44 billion. The deal is expected to close later this year.</p><p id=\"UD2F0a\">Because of the pending sale, Twitter says it will stop providing guidance on its performance and is “withdrawing all previously provided goals and outlook.”</p><p id=\"XoSGoZ\">Musk has given vague statements about how he’ll change Twitter, promising to “enhanc[e] the product with new features,” make its algorithms open source, crack down on spambots, and verify all users. He’s also harped endlessly about turning it into <a href=\"https://www.theverge.com/2022/4/15/23025120/elon-musk-twitter-free-speech-government-censorship\">a platform for free speech</a>, which has raised concerns about how he’ll oversee moderation on the platform.</p><p id=\"Dvzeuy\">Notably, Musk has said that buying Twitter “<a href=\"https://www.theverge.com/2022/4/14/23025343/elon-musk-twitter-takeover-ted-talk-quote-stock-buyout\">is not a way to make money</a>.” The company has never been a huge moneymaker, and Musk has repeatedly emphasized that he wants to make changes to Twitter so that it can remain a “de facto town square.”</p><div id=\"MIyJJs\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let’s make Twitter maximum fun!</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1519495072802390016?ref_src=twsrc%5Etfw\">April 28, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"4tadVW\">Some Twitter employees publicly <a href=\"https://www.theverge.com/23042020/twitter-employees-elon-musk-buyout-slack\">expressed concern</a> about Musk’s potential takeover prior to the agreement, and Musk has only managed to validate their fears in the past few days as he continues to tweet critically about the company’s decisions. In particular, his criticism of Twitter policy leader Vijaya Gadde has <a href=\"https://www.theverge.com/2022/4/27/23044521/twitter-policy-chief-vijaya-gadde-elon-musk-policy-criticism-harassment\">led to harassment</a> from other users of the site.</p><p id=\"J1iVNp\">Twitter was supposed to discuss today’s earnings release on a call with investors but canceled the event “in light of the pending transaction.” Should the deal close, today’s numbers would be one of the last public earnings releases from the company.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/r7pFFuYUFnC_q8wzWQqvA5pT1DA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22228563/vpavic_210111_4366_0237.jpg",
  "description": "Daily usage was lower than Twitter claimed.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}