{
  "title": "Twitter’s CEO says employees can return to the office starting March 15th",
  "url": "https://www.theverge.com/2022/3/3/22960529/twitter-return-to-office-work-travel-plan-work-from-home-remote",
  "date": "2022-03-03T22:41:27.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/4pznul5UJjSWuh5R7Pc26IocL7U=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70576238/acastro_170726_1777_0012_v3.0.jpg\" />        <figcaption><em>He reiterates that employees can work fully remote if they want.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"RFbExB\">Twitter will be fully re-opening its offices and bringing back business travel starting on March 15th, according to a <a href=\"https://twitter.com/paraga/status/1499422876134371329?s=20&amp;t=_Kk7aXqdHZhmCEtlS6zNpw\">post</a> written by <a href=\"https://www.theverge.com/2021/11/29/22808756/twitter-ceo-parag-agrawal-jack-dorsey-bluesky-moderation\">CEO Parag Agrawal</a>. In his note (see the full text below), Agrawal reiterates the policy put into place by former Twitter lead Jack Dorsey, saying that employees will be <a href=\"https://www.theverge.com/2020/5/12/21256060/twitter-employees-work-from-home-covid-19-pandemic\">allowed to work remotely full-time</a> if that’s what they’re comfortable with.</p><p id=\"5RsFl7\">While Agrawal says that he wants Twitter employees to work wherever they “feel most productive and creative” and that the company is committed to “truly flexible work,” his statement does lean a lot on the benefits of office work. It mentions how difficult distributed work is while also saying that “office visits, team meetings, and events all bring that culture to life in such a powerful way.” </p><div class=\"c-float-right\"><aside id=\"qAMjk0\"><q>Twitter is going for a hybrid remote work approach rather than a full embrace</q></aside></div><p id=\"Xs4PkA\">This implies that Twitter’s remote work culture won’t quite be the same as a company like Dropbox, which <a href=\"https://blog.dropbox.com/topics/company/dropbox-goes-virtual-first\">announced in 2020</a> that it was going “virtual first.” To Dropbox, that means that remote work is the default, and offices are more like co-working spaces where employees can choose to hold meetings instead of places to work individually. </p><p id=\"HhT078\">While Twitter does seem to be expressing some preference in its messaging, its policies are still looser than what some other tech companies have announced. Amazon, for instance, is leaving work-from-home policy decisions for its corporate workers <a href=\"https://www.theverge.com/2021/10/11/22721096/amazon-work-from-home-policy-teams-decide-covid-19-pandemic\">up to individual teams</a> rather than individual employees. Google and Microsoft <a href=\"https://www.theverge.com/2021/5/6/22422518/google-hybrid-work-office-remote-work-sundar-pichai-memo-covid-19-pandemic\">have said</a> they’ll be testing out hybrid policies where employees will come to the office some, but not all, days.</p><p id=\"5uxXnt\">Here’s Agrawal’s full note to employees:</p><blockquote><p id=\"lPamBQ\">Team.</p><p id=\"NxmMmu\">There’s a lot happening in the world right now, but given the improving state of the pandemic, we have made an important decision that I wanted to share as it impacts all of us. It’s been almost two years since we closed our offices and travel, and I’m excited to announce that we’re ready to fully open up business travel and all our offices around the world! Business travel is back effective immediately, and office openings will start on March 15. Our culture is electric and palpable. Os’ffice visits, team meetings, and events all bring that culture to life in such a powerful way, and I can’t wait to see it all happen.</p><p id=\"JXczp9\">Our top priority since the beginning of the pandemic has been to keep you all safe and this will continue. But we’re now at a stage where you’re living your lives, adjusting to local health guidelines, and deciding what works best for you. So too, the decisions about where you work, whether you feel safe traveling for business, and what events you attend, should be yours.</p><p id=\"ZZDQwA\">As we open back up, our approach remains the same. Wherever you feel most productive and creative is where you will work and that includes working from home full-time forever. Office every day? That works too. Some days in office, some days from home? Of course. That’s actually how most of you feel. This brings me to my next point..</p><p id=\"QrPAZ8\">In 2020 we adjusted quickly to working virtually with resilience and agility, but almost all of us were working from home. Distributed working will be much, much harder. Anyone who has joined a meeting remotely while others are in a conference room knows this pain. There will be lots of challenges in the coming months, and we’ll need to be proactive, intentional, learn, and adapt. We’re in this together, and we each play a role in the open, inclusive, and productive culture we want to create.</p><p id=\"cfaJ0S\">Details on logistics, dates, safety measures, and how we work will be coming soon from Pat and Tracy to whom I am deeply grateful, along with the amazing cross-functional team that carried us through the past two years. And thank you to the Tweeps who have in-office roles, like our data centers, who have been coming into work for the last two years and continue to show up for us and our customers every single day. We appreciate you.</p><p id=\"abS4q7\">I look forward to seeing you all back at the office or perhaps at an event, somewhere in your home city, or mine?</p><p id=\"8uYLqs\">Can’t wait...</p><p id=\"Zz3RPD\">Parag</p></blockquote>",
  "image": "https://cdn.vox-cdn.com/thumbor/1pUHYHoQ_WKjS0ITbnxcS9Ltw5Q=/0x196:2040x1264/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8966109/acastro_170726_1777_0012_v3.jpg",
  "description": "Employees can return on March 15th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}