{
  "title": "Twitter accounts sharing video from Ukraine are being suspended when they’re needed most",
  "url": "https://www.theverge.com/2022/2/23/22947769/twitter-osint-russia-ukraine-invasion-suspended-error",
  "date": "2022-02-23T19:40:02.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/vZpgJkityK67z7tllMQooLZ6la0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70541955/acastro_200715_1777_twitter_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro</figcaption>    </figure>  <p>Twitter says the accounts were removed in error</p> <p id=\"5n7fxq\">As Russian troops and armored vehicles <a href=\"https://www.washingtonpost.com/world/2022/02/22/ukraine-russia-invasion-photos-videos-maps/\">begin moving into Ukrainian territory</a>, social media accounts sharing images and videos from the eastern Donbas and Luhansk regions have been a crucial source of information, sharing footage of <a href=\"https://twitter.com/ELINTNews/status/1490489628897513476\">Russian helicopters heading toward Crimea</a> or <a href=\"https://twitter.com/RALee85/status/1496544602647666692\">tank divisions moving to the border</a>.</p><p id=\"oHuINc\">But as the conflict intensifies, many researchers sharing this primary material taken from social media — commonly known as open-source intelligence or OSINT — have found their Twitter accounts unexpectedly suspended.</p><p id=\"GsD3K2\">On the night of February 22nd, OSINT researcher Kyle Glen was locked out of his account for 12 hours, according to <a href=\"https://twitter.com/KyleJGlen/status/1496449720390238208\">tweets from Glen</a> and a post <a href=\"https://twitter.com/COUPSURE/status/1496405615098400774\">shared by another OSINT organization</a>. Security analyst Oliver Alexander also claimed to have been locked out of his account <a href=\"https://twitter.com/OAlexanderDK/status/1496513006657839108\">twice in 24 hours</a>. Outside of the Anglosphere, the French-language OSINT account <a href=\"https://twitter.com/NeuroneIntel/status/1496501031185928196\">Neurone Intelligence</a>, Spanish-language account <a href=\"https://twitter.com/MundoEConflicto/status/1496478302428893193\">Mundo en Conflicto</a>, and Brazilian OSINT account Notícias e Guerras were <a href=\"https://twitter.com/AverageLatinAm/status/1496532823020343305\">also affected</a>. </p><p id=\"6rVyYm\">A <a href=\"https://twitter.com/N_Waters89/status/1496502590053523458\">Twitter thread</a> compiled by Nick Waters, an analyst at the pioneering OSINT organization Bellingcat, lists more account suspensions. In a <a href=\"https://twitter.com/OAlexanderDK/status/1496450598769680394/photo/1\">tweet</a>, Alexander shared a screenshot with a message stating that the account had been locked for violating Twitter rules, though the exact rule violation was not specified.</p><div id=\"CEXPpb\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I am back again after having been locked out twice in 24 hours. First time for a post debunking the \"foiled sabotage / gas attack\" and second time for a post debunking the \"Ukrainian attack into Russia\". <a href=\"https://twitter.com/Twitter?ref_src=twsrc%5Etfw\">@Twitter</a> needs to do something against these locks now.</p>— Oliver Alexander (@OAlexanderDK) <a href=\"https://twitter.com/OAlexanderDK/status/1496513006657839108?ref_src=twsrc%5Etfw\">February 23, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"yHskTz\">Researchers <a href=\"https://twitter.com/Osinttechnical/status/1496440756873093120\">raised concerns</a> that the account suspension could have been part of a mass reporting campaign intended to disable OSINT accounts during a Russian invasion.</p><p id=\"51Gt1X\">In a statement, Twitter spokesperson Elizabeth Busby said that action had been taken against these accounts in error and was not part of a coordinated campaign.</p><p id=\"85PVh8\">“We’ve been proactively monitoring for emerging narratives that are violative of our policies, and, in this instance, we took enforcement action on a number of accounts in error,” Busby said. “We’re expeditiously reviewing these actions and have already proactively reinstated access to a number of affected accounts. The claims that the errors were a coordinated bot campaign or the result of mass reporting is inaccurate.”</p><div class=\"c-float-right\"><aside id=\"LFFgIU\"><q>“We’re expeditiously reviewing these actions and have already proactively reinstated access to a number of affected accounts.”</q></aside></div><p id=\"TxDRw7\">When asked what content policies the suspended accounts were believed to have violated, Busby pointed <em>The Verge</em> to Twitter’s <a href=\"https://help.twitter.com/en/rules-and-policies/manipulated-media\">synthetic and manipulated media policy</a>, which deals with the sharing of misinformation on the platform. Under the terms of the policy, accounts may not share information that has been “significantly and deceptively altered, manipulated, or fabricated,” is “shared in a deceptive manner or with false context,” or is “likely to result in widespread confusion on public issues, impact public safety, or cause serious harm.” It is unclear how exactly the suspended accounts were thought to have breached the policy.</p><p id=\"EvsV89\">Aric Toler, director of research and training at Bellingcat, told <em>The Verge</em> that the suspensions were surprising in light of the number of English-language accounts affected.</p><p id=\"MNKe91\">“Normally when this happens it’s to relatively smaller accounts and accounts in foreign languages, because Twitter mods don’t have as much language proficiency there,” Toler said. “But here you’re getting a lot of people tweeting in English as well, some pretty big accounts with tens of thousands of followers going down as well. It’s kind of strange.”</p><p id=\"0Oojer\">Toler also highlighted the fact that many of the accounts suspended were aggregator accounts, which retweet other accounts that are posting original content, rather than directly sharing images and videos. This pointed to a likelihood that aggregator accounts had been suspended due to human intervention rather than algorithmic content moderation, Toler said.</p><div class=\"c-float-left\"><aside id=\"ZLEx0j\"><q>“Normally when this happens it’s to smaller accounts and accounts in foreign languages”</q></aside></div><p id=\"9emFk4\">Supporters of Ukraine are concerned that the removal of Twitter accounts sharing OSINT from the region could benefit Russian military goals in the region. Russia has previously mounted <a href=\"https://www.washingtonpost.com/world/national-security/inside-a-russian-disinformation-campaign-in-ukraine-in-2014/2017/12/25/f55b0408-e71d-11e7-ab50-621fe0588340_story.html\">social media disinformation campaigns</a> in Ukraine and was accused of weaponizing social media to promote false narratives <a href=\"https://www.realcleardefense.com/articles/2017/05/10/how_russia_weaponized_social_media_in_crimea_111352.html\">during its 2014 annexation of Crimea</a>. Russia has also extended its digital offensive by mounting ongoing cyberattacks on Ukraine, <a href=\"https://www.theverge.com/2022/2/15/22936192/ukraine-defense-ministry-ddos-russia-conflict-de-escalation\">targeting Ukrainian banks and government websites</a> with <a href=\"https://twitter.com/netblocks/status/1496498930925940738\">ongoing DDoS attacks</a>.</p><p id=\"jxoEyD\">Still, Toler says Twitter has been responsive in reinstating suspended accounts, and the removal of OSINT aggregators is unlikely to have a long-term impact on the release of media from the region.</p><p id=\"gnm4b1\">“If anything’s lost on Twitter, it will be elsewhere, on Telegram, Facebook, many other platforms,” Toler said. “Aggregators are getting it out to all the people like us [journalists] who are following it. So the biggest impact is on a second tier of information, but not the original sources.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/squMoXzROG9xLOfxiIOLx6JbTRQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20086188/acastro_200715_1777_twitter_0001.0.jpg",
  "description": "Researchers fear removing the accounts will benefit Russia.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}