{
  "title": "Twitter’s new acquisition could help alert you about only the tweets that actually matter ",
  "url": "https://www.theverge.com/2022/4/12/23022066/twitter-openback-acquisition-improve-push-notifications",
  "date": "2022-04-12T17:22:27.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/mvgXGlM8k-TlzwlJjJR_GWXHzHo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70740696/acastro_170726_1777_0010.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"2CgtPR\">Twitter announced Tuesday that it has acquired OpenBack, a push notifications company. OpenBack offers “device-side control of push notifications,” according to <a href=\"https://twitter.com/jaysullivan/status/1513865321941110789\">Twitter’s head of consumer product Jay Sullivan</a>, and Twitter could use the team to pull up timely information even when you're away from the app. </p><p id=\"vr5X4r\">“The best push notifications bring people to the conversations they care about on Twitter,” Sullivan said as <a href=\"https://twitter.com/jaysullivan/status/1513865323782414341\">part of a Twitter thread</a>. “But irrelevant notifications are a distraction. With millions of people visiting Twitter via notifications every day, we want them to be timely, relevant and engaging.”</p><p id=\"wpOtuD\">“OpenBack and their talented team joining Twitter will help us improve our ability to deliver the right notifications at the right time, in a way that puts people’s privacy first.”</p><div id=\"ILb4WO\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">3/ OpenBack and their talented team joining Twitter will help us improve our ability to deliver the right notifications at the right time, in a way that puts people’s privacy first. We’re thrilled to have them join the flock and look forward to seeing their impact. Welcome!  </p>— Jay Sullivan (@jaysullivan) <a href=\"https://twitter.com/jaysullivan/status/1513865325716008961?ref_src=twsrc%5Etfw\">April 12, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"lvKZDB\">It’s unclear exactly what these improved notifications might look like. But former <em>Protocol</em> editorial director David Pierce has one idea that <a href=\"https://twitter.com/pierce/status/1512896099291385863\">sounds awesome</a>: a “really good super-curated timeline and it’s all notifications.” </p><div id=\"H45KUD\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I have a theory that “a really good super-curated timeline and it’s all notifications” is Twitter’s path to a trillion dollars and nobody’s talking about it</p>— David Pierce (@pierce) <a href=\"https://twitter.com/pierce/status/1512896099291385863?ref_src=twsrc%5Etfw\">April 9, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"FIiHVH\">Perhaps I think this is a good idea because I’ve DIY’d something similar by making a highly curated Tweetdeck list that sends a push notification whenever somebody on the list tweets. But that only works when I’m on my computer. With this acquisition, Twitter could replicate something like that to automatically pick the best tweets from people I follow or that it thinks I might care about (similar to Twitter’s <a href=\"https://www.theverge.com/2015/11/15/9738818/twitter-highlights-android-best-feature\">Android-only Highlights feature</a> that <a href=\"https://www.theverge.com/2017/12/20/16799830/twitter-android-highlights-highlighter\">it shut down years ago</a>), and make it work wherever I’m logged into the platform.</p><p id=\"vkvZIY\">Twitter spokesperson Adrian Zamora declined to share terms of the OpenBack deal.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/rIx63ABhn4LDM1v2ixfC8xGRcbQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8966105/acastro_170726_1777_0010.jpg",
  "description": "Twitter has acquired OpenBack.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}