{
  "title": "Twitter pauses ads in Ukraine and Russia amid growing conflict",
  "url": "https://www.theverge.com/2022/2/26/22952128/twitter-pauses-ads-ukraine-russia-conflict",
  "date": "2022-02-26T16:25:50.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TPe_8oboljoIk-AuM3s2-lKKAHI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70554350/acastro_170726_1777_0012.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"0BiiGy\">Twitter is putting a temporary hold on advertisements in Ukraine and Russia to ensure the visibility of public safety information.</p><div id=\"sbwx3S\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">We’re temporarily pausing advertisements in Ukraine and Russia to ensure critical public safety information is elevated and ads don’t detract from it.</p>— Twitter Safety (@TwitterSafety) <a href=\"https://twitter.com/TwitterSafety/status/1497353976588689411?ref_src=twsrc%5Etfw\">February 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"gi41Nw\">“We’re temporarily pausing advertisements in Ukraine and Russia to ensure critical public safety information is elevated and ads don’t detract from it,” Twitter <a href=\"https://twitter.com/TwitterSafety/status/1497353976588689411?s=20&amp;t=9gkwRFNx_ZX64mjzWjgx6g\">said in a tweet</a>. In the thread, the platform outlines several measures it’s taking to protect users. This includes a suspension on “some” tweet recommendations from people users aren’t following, as well as search and home timeline prompts directing users to a <a href=\"https://twitter.com/i/events/1494057170756780032\">Twitter Moment</a> that includes digital security information.</p><p id=\"y3cbMB\">The social network also says it’s “proactively reviewing tweets to detect platform manipulation” and is taking “enforcement action” against them. Twitter is monitoring the accounts of journalists, government officials, activists, and other high-profile accounts to prevent “targeted takeover or manipulation” as well.</p><p id=\"waFLza\"><a href=\"https://www.theverge.com/2022/2/26/22952006/russia-block-twitter-ukraine-invasion-censorship-putin\">Russia has since blocked Twitter in the country</a>, potentially as an attempt to stifle information related to the escalating conflict in Ukraine. The country has also taken action against Facebook — it <a href=\"https://www.theverge.com/2022/2/25/22950874/russia-facebook-blocked-roskomnadzor-media-censorship\">partially restricted access to the platform</a>, which has <a href=\"https://www.theverge.com/2022/2/26/22952038/facebook-russian-state-media-blocked-advertising-monetization-ukraine-conflict\">barred Russian state-run media from advertising on its network</a>.</p><p id=\"IFumWq\">“We continue to monitor the ongoing conflict in Ukraine and our focus remains to protect the safety and integrity of the conversation on Twitter,” Twitter spokesperson Katie Rosborough said in an emailed statement to <em>The Verge</em>. “As part of this work, we have temporarily halted advertisements in Ukraine and Russia to keep the focus on people receiving critical information. We remain vigilant and will continue to closely monitor the situation.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wKKSgbRLHB_QxDbI_4dUGoOMyvY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8966107/acastro_170726_1777_0012.jpg",
  "description": "Twitter wants public safety information to remain visible.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}