{
  "title": "Twitch creates new program to pay streamers more reliably",
  "url": "https://www.theverge.com/2022/2/23/22947490/twitch-ad-incentive-program-guranteed-monthly-payments",
  "date": "2022-02-23T18:01:24.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Z36loB2eBOVTSEElCLOQ0UJRCTo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70541402/acastro_210115_1777_twitch_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"FeQ88d\">Twitch <a href=\"https://blog.twitch.tv/en/2022/02/22/reliable-ad-revenue-with-one-click-its-really-happening/?_branch_match_id=994263544276743078&amp;utm_source=Social&amp;utm_medium=marketing&amp;_branch_referrer=H4sIAAAAAAAAA8soKSkottLXLynPLEnO0EssKNDLyczL1q8IDS02K4pMcc1LAgBYctvpIwAAAA%3D%3D&amp;utm_referrer=https://t.co/\">is implementing a new initiative</a> that could alleviate one of the biggest stressors of content creation: unreliable income.</p><p id=\"MWuN1n\">The Ad Incentive Program, or AIP, is a new program that will pay select streamers a guaranteed monthly minimum amount of ad revenue. Qualified affiliate or partner streamers will receive a notification from Twitch offering them different payouts based on the amount of ads run per hour and total hours streamed. In the example Twitch provided, if a creator streamed for at least 40 hours that month, they could receive $100 for running two minutes of ads per hour, $300 for three minutes, or $500 for four minutes. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2LtdXpqX0GMicDxhC94ZeQAAjr0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23265940/cip_incentives.png\">      <figcaption>An example of what the AIP payouts could look like.</figcaption>  </figure><p id=\"ZTd4g0\">In addition to these tiered incentives, the AIP also comes with an ad management feature that controls when ads are played during a stream alleviating the burden of timing ad breaks.</p><p id=\"VoeR72\">In the announcement, Twitch said the amounts offered will vary by creator and that there’s no cap on potential earned income. Creators can receive additional revenue at their normal rate for streaming beyond the required minimum number of hours. If a creator opts out of the program, Twitch said they can receive a prorated payment based on the number of hours streamed.</p><p id=\"Y8B22Z\">The AIP seems like a kind of universal basic income program for streamers. Income unreliability is one of the biggest headaches for content creators. Revenue from donations and subscriptions can wildly fluctuate from month to month, creating a precarious environment for people who depend on that income. According to Twitch, “[h]aving a reliable floor of ad revenue should enable you to better plan for the future, whatever that may look like. We hope it’s an important step towards empowering creators.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WWFO9Zufo2HRXapr55NLSykgYpc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22238847/acastro_210115_1777_twitch_0003.jpg",
  "description": "The program is like universal basic income for streamers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}