{
  "title": "Twitter tries harder to promote third-party safety tools ",
  "url": "https://www.theverge.com/2022/4/22/23036956/twitter-toolbox-apps-promote-safety-block-mute-accounts-platform",
  "date": "2022-04-22T09:07:11.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PHxFxfTXCTuV9iohWs67UhSg3XM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70779616/acastro_180130_1777_0008.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"OOVc75\">Twitter has launched a new limited experiment that will see it promote developers’ third-party safety tools natively on its service, <a href=\"https://techcrunch.com/2022/04/21/twitter-to-promote-developers-apps-directly-on-its-platform/\"><em>TechCrunch</em> reports</a>. The test will initially focus on apps like <a href=\"https://www.blockpartyapp.com/\">Block Party</a>, <a href=\"https://www.bodyguard.ai/individuals\">Bodyguard</a> and <a href=\"https://moderateapp.com/\">Moderate</a>, which can help block harassment and other toxic content on the platform. </p><p id=\"rLNfvL\">With this experiment, select users will see these services promoted with a new prompt when they mute or block another account on Twitter. It highlights apps featured in Twitter Toolbox, a <a href=\"https://twitter.com/TwitterSupport/status/1488619414584922116\">recently launched initiative</a> that currently promotes third-party Twitter tools in an <a href=\"https://developer.twitter.com/en/community/toolbox\">online hub</a>. “The Twitter Toolbox offers more solutions to improve your experience on Twitter,” the prompt reads, before listing a selection of services.</p><p id=\"FRu8gh\">The experiment is Twitter’s attempt to promote third-party tools on its platform, which currently have to rely on word-of-mouth or traditional advertising to attract new users. “[Developers] want users and we want to provide them with the right users at the right time,” Twitter’s head of product, Amir Shevat, tells <em>TechCrunch</em>. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/p-7enJWB-cKdwV6eatUVN11iuF8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23408732/twitter_in_app_experiment.jpg\">      <cite>Image: Twitter via <a class=\"ql-link\" href=\"https://techcrunch.com/2022/04/21/twitter-to-promote-developers-apps-directly-on-its-platform/\" target=\"_blank\"><em>TechCrunch</em></a></cite>      <figcaption><em>An example of the third-party tools prompt shown to users in the test.</em></figcaption>  </figure><p id=\"t0Nkb1\">It comes as Twitter is attempting to overhaul its historically fractious relationship with third-party developers. In the early days of Twitter, the social media network had a very open approach, allowing developers to build fully-featured third-party clients for its service. But <a href=\"https://www.theverge.com/2018/8/16/17699626/twitter-third-party-apps-streaming-api-deprecation\">by 2012 this approach was changing</a>, and as of 2018, Twitter had effectively <a href=\"https://www.theverge.com/2018/8/16/17699626/twitter-third-party-apps-streaming-api-deprecation\">killed the market for feature-complete third-party clients</a>. </p><p id=\"Krxs7P\">But just two years later, the company was rebuilding the tools available to third-party developers. It launched <a href=\"https://www.theverge.com/2020/8/12/21364644/twitter-api-v2-new-access-tiers-developer-portal-support-developers\">version 2 of its API in early access</a> in 2020, with support for “conversation threading, poll results in Tweets, pinned Tweets on profiles, spam filtering, and a more powerful stream filtering and search query language.” The new API <a href=\"https://www.theverge.com/2021/11/15/22779149/twitter-api-version-2-official-decentralized\">left early access last year</a>, although it still places <em>some</em> limits on developers, like limiting them to pulling 500,000 or 2 million tweets a month, depending on their access tier. </p><p id=\"eyTCtq\">According to Shevat, the hope is to encourage a mutually beneficial relationship between Twitter and third-party developers. “I think of Twitter right now as the old Nokia phone… it was a good phone. But the only app on it was Snake, if you remember,” Shevat tells <em>TechCrunch</em>. “I see the future of Twitter as an iPhone, where the value that you get is actually through developer innovation.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BnG9WCJSDvN5drVI3i6JTS-R1vM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10125279/acastro_180130_1777_0008.jpg",
  "description": "Hoping to boost Twitter’s app ecosystem.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}