{
  "title": "Twitter reassures advertisers Musk won’t make the platform more of a toxic hell-hole than it already is",
  "url": "https://www.theverge.com/2022/4/28/23046139/twitter-elon-musk-free-speech-plans-toxic-advertisers-brands",
  "date": "2022-04-28T11:38:03.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/QL8wOwU4HMVKE6mM_Ob5gKt-z8M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70803709/acastro_180827_1777_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"j7sRe0\">Twitter has reportedly contacted advertising agencies to reassure them that Elon Musk’s plans for the platform won’t make it an inhospitable place for brands. </p><p id=\"Jm32DY\">Musk has promised that under his watch, Twitter will take a <a href=\"https://twitter.com/elonmusk/status/1519036983137509376\">maximalist approach</a> to “free speech” — perhaps only removing content that is actively illegal. However, as experts <a href=\"https://www.theverge.com/2022/4/15/23025120/elon-musk-twitter-free-speech-government-censorship\">have pointed out</a>, this would mean easing restrictions on a variety of unpleasant but <em>legal</em> forms of speech: from Nazi propaganda to ISIS beheading videos to medical misinformation. This is content that corporations do not want to be associated with, even indirectly. </p><p id=\"IVvWZA\"><a href=\"https://www.ft.com/content/8b39d137-0d40-4bc6-bb53-e3c255eacdf7\">According to an email seen by <em>The Financial Times</em></a><em>, </em>Twitter has reached out to ad agencies to preempt such fears, telling them that the advertisements they make for big brands won’t appear alongside offensive content. The report does not offer any further details, but reflects widespread fears that Musk’s leadership will lead to an uptick in hateful and toxic speech on Twitter. </p><p id=\"ftoKfb\">Already, campaign groups like the Anti-Defamation League (ADL) and the National Association for the Advancement of Colored People (NAACP), have expressed concern that Musk’s leadership will be a boon for anti-semitic and racist voices.</p><div class=\"c-float-right\"><aside id=\"E2o03P\"><q>“We know firsthand that hate and extremism in digital spaces can lead to physical violence”</q></aside></div><p id=\"eFtZKY\">“We know firsthand that hate and extremism in digital spaces can lead to physical violence, particularly against Jews and other marginalized communities,” Jonathan Greenblatt, CEO of the ADL, <a href=\"https://www.haaretz.com/us-news/.premium-elon-musk-s-takeover-might-make-twitter-more-antisemitic-adl-chief-warns-1.10763809\">told <em>Haaretz</em></a>. <em>“</em>Twitter has made some strides in tackling this hate in recent years. So while we want to be cautiously optimistic about how Elon Musk will run the platform, he hasn’t demonstrated any focus on these issues to date. We worry he could take things in a very different direction.”</p><p id=\"ncQbW8\">The president of the NAACP, Derrick Johnson, <a href=\"https://naacp.org/articles/naacps-message-elon-musk\">issued a statement</a> saying: “Mr. Musk: free speech is wonderful, hate speech is unacceptable. Disinformation, misinformation and hate speech have NO PLACE on Twitter.” Johnson singled out the possibility that Musk would allow President Donald Trump to return to Twitter, suggesting this would allow the platform to become “a petri dish for hate speech, or falsehoods that subvert our democracy.”</p><p id=\"gVFBfi\">In 2020, the ADL <a href=\"https://www.adl.org/news/letters/an-open-letter-to-the-companies-that-advertise-on-facebook\">led a boycott of advertisement on Facebook</a> in response to the company’s policies on hate speech. However, a year on, the ADL said the campaign mostly <a href=\"https://www.stophateforprofit.org/platforms-progress-year-later\">led to only “incremental” changes</a> while Facebook’s advertising revenue seemed unaffected. </p><p id=\"LNf0dK\">Because of its relatively small size, Twitter is perhaps more vulnerable to coordinated action by advertisers. (It generated $4.5 billion in ad revenue in 2021 compared to $114 billion for Facebook-owner Meta.) But Musk himself has said he’s not buying the company for the money, and is primarily interested in his ideological goals. Such comments should likely be taken with a pinch of salt (Twitter isn’t a money-spinner but has benefited Musk financially <a href=\"https://www.newyorker.com/news/q-and-a/why-elon-musk-bought-twitter\">in other ways</a>) but they do suggest that lost ad revenue will not be an immediate concern. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6HygePQ2EjTyOlCCpY0a75yvvco=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742431/acastro_180827_1777_0004.jpg",
  "description": "Musk’s \"free speech\" plans are worrying advertisers",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}