{
  "title": "Twitter’s decentralized, open-source offshoot just released its first code",
  "url": "https://www.theverge.com/2022/5/4/23057473/twitter-bluesky-adx-release-open-source-decentralized-social-network",
  "date": "2022-05-04T22:04:59.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"Project Bluesky logo\" src=\"https://cdn.vox-cdn.com/thumbor/HiKbvXjwOPwwBvK0ok6Pvtm-WRY=/0x0:1708x1139/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70833334/Screen_Shot_2021_08_16_at_12.06.33_PM.0.0.png\" />        <figcaption>Bluesky</figcaption>    </figure>  <p id=\"MNUanh\">Bluesky, Twitter’s open-source offshoot, has released early code for a decentralized social network protocol. The system is dubbed the Authenticated Data Experiment (or ADX) and is <a href=\"https://github.com/bluesky-social/adx\">available on GitHub</a> for developers to test, although Bluesky emphasizes that it’s incomplete. It’s one of the most substantive windows into Bluesky’s workings <a href=\"https://www.theverge.com/2019/12/11/21010856/twitter-jack-dorsey-bluesky-decentralized-social-network-research-moderation\">since the project was conceived</a> in 2019 and formally incorporated in early 2022.</p><p id=\"k7hrKZ\">Bluesky CEO <a href=\"https://blueskyweb.xyz/blog/5-4-2022-working-in-public\">Jay Graber writes</a> that ADX will be the start of a semi-public development process. “We’re going to take a middle path of releasing work before it’s complete, but also giving ourselves time to workshop new directions at early stages,” Graber says. The GitHub repository <a href=\"https://github.com/bluesky-social/adx/blob/main/architecture.md\">includes an overview</a> of ADX’s goals and design as well as some experimental code. “Feel free to play around, but don’t try to build your next big social app on this yet. Things are missing, and things are going to change,” Graber says. The code is available under an open source <a href=\"https://github.com/bluesky-social/adx/blob/main/LICENSE\">MIT License</a>.</p><div class=\"c-float-right\"><aside id=\"TX4gjd\"><q>“Feel free to play around, but don’t try to build your next big social app on this yet.”</q></aside></div><p id=\"A0OhLe\">ADX isn’t a single, standalone social network design. It’s a protocol built around user-controlled “Personal Data Repositories” that social network developers could choose to support. Among other things, it’s supposed to let users transfer social media posts or engagement between networks without eroding the networks’ own moderation options. “On the Web, this data lives on the social platform where it was created. In ADX, this data will live in Personal Data Repositories owned by the user,” the overview explains. Platforms can choose to only index some of this content — drawing a distinction between “speech,” or the ability to keep data in the repository, and “reach,” or being able to see that data on a given platform.</p><p id=\"BHTa0k\">ADX is emerging the week after Tesla and SpaceX billionaire <a href=\"https://www.theverge.com/23026874/elon-musk-twitter-buyout-news-updates\">Elon Musk struck a deal</a> to acquire Twitter, and one of Musk’s plans involves “making the [Twitter] algorithms open source” to increase trust in the platform. But Bluesky is a preexisting initiative with somewhat different goals. Former CEO Jack Dorsey announced in 2019 that Twitter would fund research into a decentralized version of its service. <a href=\"https://www.theverge.com/2021/8/16/22627435/twitter-bluesky-lead-jay-graber-decentralized-social-web\">Graber joined in 2021</a> and Bluesky was <a href=\"https://blueskyweb.org/blog/2-7-2022-overview\">established in February of 2022</a> as a public benefit company focused on “large-scale adoption of technologies for open and decentralized public conversation.”</p><p id=\"k5hXsy\">Twitter could adopt Bluesky-created protocols, but the two companies could also run on entirely separate tracks, and Twitter has no direct controlling interest. “Twitter’s funding of Bluesky is not subject to any conditions except one: that Bluesky is to research and develop technologies that enable open and decentralized public conversation,” <a href=\"https://twitter.com/bluesky/status/1518707606881067008\">the Bluesky team tweeted</a> after the acquisition news.</p><p id=\"4OQao0\">Bluesky joined a field already occupied by <a href=\"https://www.theverge.com/2019/12/12/21012553/twitter-bluesky-decentralized-social-network-developers-reaction-mastodon-activitypub\">several decentralized networking protocols</a>, including ActivityPub, which powers the Mastodon platform. But its researchers have stressed that they’re trying to learn from and build on these efforts, not simply replicate them. ADX is a long-awaited step forward — and a chance to see if that promise holds up.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pShl-AI-1arLhwgtSITb5HsClr0=/0x77:1708x971/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23438682/Screen_Shot_2021_08_16_at_12.06.33_PM.0.png",
  "description": "But don’t build a social network on it just yet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}