{
  "title": "Twitter now lets you place content warnings on individual tweets",
  "url": "https://www.theverge.com/2022/2/25/22951334/twitter-sensitive-content-warning-individual-tweet-update-ios-android-web",
  "date": "2022-02-25T21:54:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"The Twitter bird logo in white against a dark background with outlined logos around it and red circles rippling out from it.\" src=\"https://cdn.vox-cdn.com/thumbor/m8LVpErLWwB0EawO55iSu5D5quw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70551949/acastro_180827_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"mhE0wJ\">Twitter is giving all users access to the <a href=\"https://www.theverge.com/2021/12/8/22823870/twitter-content-warning-test\">content warning feature</a> it tested last year. The feature lets you obscure individual photos and videos behind warnings for nudity, violence, and “sensitive” content, rather than adding a blanket warning to all multimedia tweets. It’s available on Twitter’s Android and iOS apps as well as its web client.</p><p id=\"rpo9jR\">Users can put a content warning on posts by adding a photo or video, tapping to edit it, and then hitting a flag icon that will bring up the options listed above. You can tag multiple warnings for an individual piece of media, and you can add a warning to one image or video in a tweet but not another — although in the latter case, Twitter appears to place a single warning over both of them.</p><div id=\"iaY16z\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The option to add one-time sensitive content warnings to photos and videos you Tweet is now available for everyone across Android, iOS, and web.<br><br>To add a content warning, tap the flag icon when editing the photo/video after you've attached it to your Tweet.</p>— Twitter Support (@TwitterSupport) <a href=\"https://twitter.com/TwitterSupport/status/1497312745557049345?ref_src=twsrc%5Etfw\">February 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"hDuXxx\">As with the earlier system, viewers can click “Show” to view the media, and you can’t put warnings on tweet text. The warning (so far) doesn’t appear in embedded tweets or apps like TweetDeck. And there’s sadly no category for the tweets many people want to avoid most: <a href=\"https://www.theverge.com/2021/12/17/22841897/spider-man-no-way-home-spoilers-twitter-game-of-thrones-design\">movie spoilers</a>.</p><p id=\"bPGSFu\">As the categories suggest, content warnings are framed as a way to let people avoid engaging with potentially upsetting or not-safe-for-work material. But members of other platforms have used them in more complex ways. The decentralized social network Mastodon lets users write freeform content warnings that can be applied to text or multimedia messages, which can work as an informal tagging system for posts. Twitter’s system remains limited by comparison, but it’s more versatile than its predecessor — and you could still hide spoilers behind it in a pinch.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2z0nkeOqAbnZqe1cJriMBz4J4Lg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645587/acastro_180827_1777_0001.jpg",
  "description": "It tested the feature in December.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}