{
  "title": "Twitter takes a harder line on POW photos and shadowbans Russian government accounts",
  "url": "https://www.theverge.com/2022/4/5/23012046/twitter-prisoner-of-war-pow-photos-rules-russian-government-accounts",
  "date": "2022-04-05T22:24:27.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"The Twitter bird logo in white against a dark background with outlined logos around it and red circles rippling out from it.\" src=\"https://cdn.vox-cdn.com/thumbor/M4yJTHfvlwixToqHkBfbFc4FqFA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70714442/acastro_180827_1777_0001.0.jpg\" />        <figcaption><em>Twitter says it doesn’t want to be used to violate the Geneva convention.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"wv8QsL\">Twitter <a href=\"https://twitter.com/yoyoel/status/1511374454152073222?s=20&amp;t=0DoYESGyDsfltMEMMIwTEA\">announced on Tuesday</a> that it will “require the removal of Tweets posted by government or state-affiliated media accounts” if they contain images or videos that show prisoners of war from the Russian invasion of Ukraine. The company also said it would “drastically” reduce the chances of people seeing posts from Russian government accounts. </p><p id=\"ihAcrc\">In its most recent updates to <a href=\"https://blog.twitter.com/en_us/topics/company/2022/our-ongoing-approach-to-the-war-in-ukraine\">a post</a> detailing how the company is responding to the conflict, Twitter says this decision is meant to ensure its platform isn’t used to spread content that violates the <a href=\"https://ihl-databases.icrc.org/applic/ihl/ihl.nsf/INTRO/375?OpenDocument\">Geneva Conventions</a>, one of which requires prisoners of war be protected from “acts of violence or intimidation and against insults and public curiosity.” This comes after the government of Ukraine <a href=\"https://www.washingtonpost.com/technology/2022/03/03/telegram-russian-war-dead-ukraine-pows/\">has been criticized</a> for posting images of dead soldiers, as well as videos of captured soldiers being interrogated.</p><div id=\"PTXHOt\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re doing so in line with international humanitarian law, and in consultation with international human rights groups. To protect essential reporting on the war, some exceptions apply under this guidance where there is a compelling public interest or newsworthy POW content.</p>— Yoel Roth (@yoyoel) <a href=\"https://twitter.com/yoyoel/status/1511374456622837764?ref_src=twsrc%5Etfw\">April 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"ogeZnE\">While Twitter will ask government accounts to remove media showing prisoners of war, there will be some exceptions for “compelling public interest or newsworthy POW content,” according to <a href=\"https://twitter.com/yoyoel/status/1511374454152073222?s=20&amp;t=0DoYESGyDsfltMEMMIwTEA\">a thread</a> by Twitter’s head of site integrity, Yeol Roth. According to the post, users will see a “warning interstitial” if a post is allowed to stay up. The company also says that content showing PoWs that’s “shared with abusive intent” (e.g., is mocking or threatening) by anyone will be removed.</p><p id=\"429neM\">Governments sharing media depicting POWs is a controversial subject, especially in a conflict where one side is a clear aggressor. <a href=\"https://slate.com/technology/2022/03/prisoners-of-war-ukraine-social-media-geneva-conventions.html\">As <em>Slate</em> points out</a>, the videos of prisoners of war posted by Ukrainian government accounts can be viewed as sympathetic — they seem to suggest that some Russian soldiers have been lied to by their government and are also suffering because of the invasion. Some, <a href=\"https://twitter.com/MalcolmNance/status/1497485602010406913\">like Malcolm Nance</a>, a commenter on terrorism and torture, have acknowledged that the images may violate international law but say that it’s acceptable in this instance. </p><p id=\"ct7bpJ\">Others disagree. <em>Slate </em>spoke to Adil Haque, a law professor and legal ethicist, about the media being posted, and he argued that context wasn’t particularly important in this kind of conflict. “Even if a particular instance of recording a POW might seem harmless, especially if they’re actually being portrayed in a sympathetic light, the idea is we need a broad prohibition so we don’t have to debate on a case-by-case basis whether this is a good or bad subjection to public curiosity,” he told the publication. In other words, the Conventions should be used as a blanket policy.</p><div class=\"c-float-right\"><aside id=\"uOQOZ8\"><q>“Article 13 of the convention does not draw a clear dividing line between what is acceptable and what is a breach of its provisions.”</q></aside></div><p id=\"BayGRX\">A <a href=\"https://international-review.icrc.org/sites/default/files/S0020860400080542a.pdf\">paper written by Gordon Risius and Michael Meyer</a> (pdf) as part of the Red Cross’ international review argues that there could be other downsides to governments sharing media of POWs. It says that the media could be used against the prisoners or their families by their governments and that pictures can be staged, making it hard to rely on them as evidence of humane treatment (especially when they’re taken explicitly to be viewed by the general public). </p><p id=\"JdqGho\">This debate isn’t new. The Red Cross paper from Risius and Meyer was written in the 1990s following the Gulf War and argues that the Geneva Conventions need to be updated for the age of mass media. (The article about protecting against insults and public curiosity has <a href=\"https://ihl-databases.icrc.org/applic/ihl/ihl.nsf/Article.xsp?action=openDocument&amp;documentId=F3C789772F4A2CA0C12563CD00518D5D\">been around for almost a century</a>.) There were also <a href=\"https://www.theguardian.com/media/2003/mar/28/broadcasting.Iraqandthemedia2\">debates around what media could show</a> during the 2003 invasion of Iraq. While <a href=\"https://twitter.com/yoyoel/status/1511374456622837764\">Twitter says</a> its new rules allow for “essential reporting,” it does pretty firmly put its foot down on the side of not allowing states to share images of POWs.</p><p id=\"wZmO18\">In addition to its rules around POWs, Twitter is de facto shadowbanning Russian government accounts by removing them from follow recommendations and ensuring they won’t be “amplified” on peoples’ timelines or on the Explore and Search pages. Roth says in his tweet thread that this action will be taken against any “states that limit access to free information and are engaged in armed interstate conflict.”</p><div id=\"2JJley\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What does this mean?<br><br>We won’t recommend these accounts, and we won't amplify them across the Home Timeline, Explore, Search, and in other places on Twitter. This measure drastically reduces the chance that people on Twitter see Tweets from these accounts unless they follow them.</p>— Yoel Roth (@yoyoel) <a href=\"https://twitter.com/yoyoel/status/1511374459453644800?ref_src=twsrc%5Etfw\">April 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"6kEhA9\"><a href=\"https://blog.twitter.com/en_us/topics/company/2022/our-ongoing-approach-to-the-war-in-ukraine\">Twitter’s post</a> explains the rationale behind the decision by saying that a government blocking citizens’ access to a service while continuing to post on it creates a “severe information imbalance.” Early on in the invasion, Russia restricted how citizens could access Twitter and later outright blocked Instagram. Roth does clarify that Twitter will apply these rules even if it isn’t among the platforms being banned in a country.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2z0nkeOqAbnZqe1cJriMBz4J4Lg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645587/acastro_180827_1777_0001.jpg",
  "description": "It’ll require governments to remove media showing POWs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}