{
  "title": "Twitter makes it harder to choose the old reverse-chronological feed",
  "url": "https://www.theverge.com/2022/3/10/22971307/twitter-home-timeline-algorithmic-reverse-chronological-feed",
  "date": "2022-03-10T21:36:06.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"Twitter’s blue bird silhouette logo on a black background.\" src=\"https://cdn.vox-cdn.com/thumbor/G64Fh79nDzKSXkTuaqAopNNs6Yc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70605980/acastro_180827_1777_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"agJdAC\">Twitter is rolling out a change that, frustratingly, makes it a bit more difficult to see your chronological feed. </p><p id=\"AR0rKM\">The design change, which lets you swipe between your Home (algorithmically served) and Latest (reverse chronological) timelines, was <a href=\"https://twitter.com/TwitterSupport/status/1501989523588358145\">announced Thursday</a>. To set it up, you tap the sparkle icon in the top right corner, and you’ll see the option to pin your “Latest timeline,” and if you select that, you’ll see both “Home” and “Latest Tweets” tabs at the top of the iOS app. If you use pinned lists on the iOS app, the layout might look familiar. The feature is available first on iOS, and it’s coming “soon” to Android and the web, Twitter says. (The company began testing the feature <a href=\"https://www.theverge.com/2021/10/12/22722879/twitter-switch-reverse-chronological-latest-feed-test\">in October</a>.)</p><div id=\"ZdqFw4\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Home and Latest timelines are now just a swipe away for everyone on iOS, and soon on Android and web.<br><br>Tap the ✨ icon to pin (or unpin) the Latest timeline to your Home tab for easy access. <a href=\"https://t.co/cj7ofY3CZq\">https://t.co/cj7ofY3CZq</a> <a href=\"https://t.co/XR0ALOQ5Y6\">pic.twitter.com/XR0ALOQ5Y6</a></p>— Twitter Support (@TwitterSupport) <a href=\"https://twitter.com/TwitterSupport/status/1501989523588358145?ref_src=twsrc%5Etfw\">March 10, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"CFNOrf\">To my great disappointment, however, I’ve found that after testing the feature, now I can’t make the chronological feed the default. Instead, I can only have Home as my default <em>or</em> set up the two Home and Latest Tweets tabs and swap between them as needed.</p><p id=\"kecQs7\">It’s not all bad. When jumping between Twitter and other apps on my phone, if Latest Tweets was the column I was looking at, it will be the focus when I return to Twitter. But when I force close and re-open the app when looking at the Latest Tweets column, the Home feed is what Twitter shows first. Twitter spokesperson Shaokyi Amdo said that the Home feed will be pinned first by default “for now” and confirmed there is no way to pin Latest first by default. </p><p id=\"ziQHJX\">This feels like a big step back to me. Now, on iOS, any time I want to scroll through a reverse-ordered feed like I always did before, I’ll have to check first to see if I’m looking at the right feed. Fortunately, at least for now, Latest can still be the default on the web for me — including on my iPhone’s Safari.</p><p id=\"edEsR7\">Twitter first began rolling out its algorithmic timeline <a href=\"https://www.theverge.com/2016/2/10/10955602/twitter-algorithmic-timeline-best-tweets\">in 2016</a> (to some <a href=\"https://twitter.com/RobLowe/status/695874060048166912\">high-profile</a> <a href=\"https://twitter.com/Lin_Manuel/status/696030257065914369\">uproar</a>) and introduced the sparkle icon to let you toggle between the algorithmic and reverse chronological feeds <a href=\"https://www.theverge.com/2018/12/18/18145089/twitter-latest-tweets-toggle-ranked-feed-timeline-algorithm\">in 2018</a>. To me, the sparkle always felt like a decent-enough way to let the Home and Latest timelines co-exist, but with the change announced Thursday, Twitter seems to be pushing users toward the algorithmic feed. Instagram, on the other hand, <a href=\"https://www.theverge.com/2022/1/5/22868889/new-instagram-chronological-feed-algorithm-tests\">is testing <em>bringing back </em>its chronological feed</a>. </p><aside id=\"j5pJ63\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How Twitter plans to add its next 100 million users\",\"url\":\"https://www.theverge.com/2022/3/10/22970043/twitter-product-leadership-interview\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/31wcDz-dd7XKS5dJnkQVko0eII0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645609/acastro_180827_1777_0002.jpg",
  "description": "Twitter is pushing users toward the algorithmic feed.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}