{
  "title": "Twitter accepts buyout, giving Elon Musk total control of the company",
  "url": "https://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership",
  "date": "2022-04-25T18:51:28.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Did-hm26iaMonSRmbvvaogsbMp4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70791694/VRG_Illo_STK022_K_Radtke_Musk_Stock_Neutral.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"DIaaxl\">Twitter <a href=\"https://www.prnewswire.com/news-releases/elon-musk-to-acquire-twitter-301532245.html\">has accepted Elon Musk’s offer</a> to purchase the company for $44 billion, the company announced in a press release today. Musk purchased the company at $54.20 a share, the same price named in his initial offer on April 14th.</p><p id=\"8cgSQB\">“Free speech is the bedrock of a functioning democracy, and Twitter is the digital town square where matters vital to the future of humanity are debated,” said Musk in a statement included with the release. “I also want to make Twitter better than ever by enhancing the product with new features, making the algorithms open source to increase trust, defeating the spam bots, and authenticating all humans.”</p><div class=\"c-float-right\"><aside id=\"lj0bWL\"><q>“Free speech is the bedrock of a functioning democracy” </q></aside></div><p id=\"febt0W\">Twitter CEO Parag Agrawal also applauded the deal in the release. “Twitter has a purpose and relevance that impacts the entire world,” Agrawal said in an accompanying statement. “Deeply proud of our teams and inspired by the work that has never been more important.”</p><p id=\"B2sbtF\">Musk laid out his plan for funding the deal <a href=\"https://www.theverge.com/2022/4/21/23033445/elon-musk-twitter-bank-debt-commitment-letter\">in an SEC filing on Thursday</a>, which includes $25.5 billion in loans and $21 billion in personal equity. Analysts believe the loans could cost Twitter <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-21/elon-got-his-money?sref=ExbtjcSG\">as much as $1 billion a year</a> in servicing fees, or roughly <a href=\"https://www.theverge.com/2022/2/10/22925114/twitter-earnings-q4-2021-parag-agrawal\">20 percent of the company’s annual revenue</a>.</p><p id=\"6tfUM7\">Shortly after Musk announced the buyout plan, Twitter’s board instituted <a href=\"https://www.theverge.com/2022/4/15/23024978/elon-musk-twitter-buyout-offer-ownership-deal-finance\">a “poison pill” measure,</a> suggesting it intended to resist Musk’s buyout. It’s unclear what led to the company’s change of heart. <a href=\"https://www.nytimes.com/2022/04/25/technology/twitter-employees-elon-musk.html\">A <em>New York Times</em> report</a> on Monday described Twitter employees as divided by the news, receiving little information concerning the ongoing talks.</p><p id=\"WE9yZT\">It’s unclear what impact Musk will have on Twitter or where he’ll start with changes. When he first disclosed his <a href=\"https://www.theverge.com/2022/4/4/23009622/elon-musk-twitter-shares-free-speech\">9.2 percent stake in Twitter</a>, he polled Twitter users on the creation of an “edit” button, which Twitter was already developing. He later suggested nixing ads from Twitter Blue, lowering its subscription price, and adding Dogecoin as a payment option.</p><p id=\"wvk063\"><a href=\"https://www.theverge.com/2022/4/15/23025120/elon-musk-twitter-free-speech-government-censorship\">Musk has been outspoken</a> in his criticism of Twitter moderation, describing himself as a “free speech absolutist” and raising concerns over how the platform would moderate under his control. “It’s just really important that people have the reality and the perception that they’re able to speak freely within the bounds of the law,” Musk said in <a href=\"https://www.theverge.com/2022/4/14/23025343/elon-musk-twitter-takeover-ted-talk-quote-stock-buyout\">an interview with Chris Anderson during TED 2022</a>. “I think broadly, the civilizational risk is decreased the more we can increase the trust of Twitter as a public platform.”</p><p id=\"RDtJgo\"><a href=\"https://www.theverge.com/2022/4/14/23024905/elon-musk-offers-to-buy-twitter\">Musk originally offered to buy Twitter</a> for $54.20 per share on April 14th. The offer followed <a href=\"https://www.theverge.com/2022/4/4/23009622/elon-musk-twitter-shares-free-speech\">Musk’s disclosure of acquiring a 9.2 percent stake</a>, a move that made him Twitter’s largest individual shareholder at the time. At one time <a href=\"https://www.theverge.com/2022/4/5/23011256/elon-musk-twitter-board-of-directors-ownership\">Musk was offered a seat on the company’s board of directors</a> but the deal <a href=\"https://www.theverge.com/2022/4/10/23019802/elon-musk-not-joining-twitter-board-announced\">soon fell apart</a>, as a seat on the board would prevent him from buying more than a 14.9 percent stake in Twitter.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/f7GH6yYL-k_yyIeykrCIxGqhYYY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390587/VRG_Illo_STK022_K_Radtke_Musk_Stock_Neutral.jpg",
  "description": "It’s Elon’s show now",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}