{
  "title": "Twitter user sentenced to 150 hours of community service in UK for posting ‘offensive’ tweet",
  "url": "https://www.theverge.com/2022/3/31/23004339/uk-twitter-user-sentenced-grossly-offensive-tweet-tom-moore-joseph-kelly",
  "date": "2022-03-31T08:26:49.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/dbdFLdAIqYIw5s12CGRhvfCyooA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70692926/acastro_180827_1777_0004.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"mNUUcu\">A Twitter user from the UK named Joseph Kelly has been sentenced to 150 hours of community service for posting a “grossly offensive” tweet about Captain Sir Tom Moore, a British Army officer who raised money for the NHS during the pandemic.</p><p id=\"OchqVM\">Moore became a national figure in the UK after walking 100 laps around his garden before his 100th birthday. He was later knighted by the Queen. The day after his death, Kelly, 36, tweeted “the only good Brit soldier is a deed one, burn auld fella buuuuurn.” </p><p id=\"bNycEc\">Kelly was found guilty in February last year and faced possible jail time. His case brought attention to an often-criticized piece of UK legislation that allows social media users to be <a href=\"https://www.theverge.com/2022/2/7/22912054/uk-grossly-offensive-tweet-prosecution-section-127-2003-communications-act\">prosecuted for sending “grossly offensive” messages</a>. </p><p id=\"oKNeDm\">As <a href=\"https://www.thenational.scot/news/20031940.joseph-kelly-spared-jail-tweet-captain-tom-moore/\">reported by <em>The National</em></a>, Kelly was sentenced on Wednesday. His defense argued that Kelly had few followers on Twitter at the time; that he had been drinking before writing the post; and that he deleted the tweet just 20 minutes after sending it. </p><div class=\"c-float-right\"><aside id=\"g6H1R4\"><q>“His level of criminality was a drunken post, at a time when he was struggling emotionally”</q></aside></div><p id=\"Olvp2g\">“He accepts he was wrong. He did not anticipate what would happen. He took steps almost immediately to delete the tweet but the genie was out of the bottle by then,” said Kelly’s defence agent Tony Callahan. “His level of criminality was a drunken post, at a time when he was struggling emotionally, which he regretted and almost instantly removed.”</p><p id=\"YU04XQ\">Kelly was sentenced to 18 months of supervision and 150 hours of unpaid work in the form of a Scottish Community Payback Order (CPO). </p><aside id=\"oWtarP\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Here’s why Twitter users in the UK can still be jailed for sending ‘grossly offensive’ tweets\",\"url\":\"https://www.theverge.com/2022/2/7/22912054/uk-grossly-offensive-tweet-prosecution-section-127-2003-communications-act\"}]}'></div></aside><p id=\"YN2qq0\">Sheriff Adrian Cottam, who sentenced Kelly, told the 36-year-old: “My view is, having heard the evidence, that this was a grossly offensive tweet. The deterrence is really to show people that despite the steps you took to try and recall matters, as soon as you press the blue button that’s it. It’s important for other people to realise how quickly things can get out of control. You are a good example of that, not having many followers.”</p><p id=\"W0ZsZ7\">Kelly was found guilty under Section 127 of the UK’s Communications Act. The law was originally intended to prosecute individuals saying offensive things on the telephone, but has since been used to police “grossly offensive” messages on social media. Hundreds of UK citizens have been found guilty under Section 127, often for insulting, abusing, and harassing public figures like athletes, journalists, and MPs.</p><p id=\"w0f0yl\">Section 127 is set to be replaced by the UK’s sweeping <a href=\"https://www.bbc.co.uk/news/technology-59638569\">Online Safety Bill</a>, though critics worry that this new legislation will enable similar prosecutions to Kelly’s — with citizens found guilty of sending “harmful” messages based on vague notions of public morality. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6HygePQ2EjTyOlCCpY0a75yvvco=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742431/acastro_180827_1777_0004.jpg",
  "description": "\"Grossly offensive\" tweets can get you prosecuted in the UK",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}