{
  "title": "Twitch rolls out improved reporting and appeals features",
  "url": "https://www.theverge.com/2022/3/22/22989778/twitch-new-reporting-appeals-tools",
  "date": "2022-03-22T18:01:40.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/bq0eIkDHBfsbv2pn0ZyzRmkUvIk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657948/acastro_210115_1777_twitch_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"6PeIEo\"><a href=\"https://safety.twitch.tv/s/safety-news/detail?language=en_US&amp;post=Two-New-Products-to-Streamline-the-Reporting-and-Appeals-Process-on-Twitch\">Twitch is overhauling its safety tools</a>, improving its reporting process, and adding a new appeals portal. </p><p id=\"NxiZRs\">Over the next few weeks, Twitch will slowly roll out improved reporting tools, simplifying the process by which streamers and viewers can report content. The new process includes a search function so users can find the specific reason for their report and a suite of menus for the type of content getting flagged. The updated reporting tools will hit web first, with the mobile rollout happening at an unspecified later date.</p><p id=\"lMyTeI\">In addition to better reporting features, Twitch is also adding a new appeals portal, offering greater transparency into the appeals process. In the past, to contest a ban or suspension, a streamer would submit an appeal, receive an automated response acknowledging receipt, and then wait for a response that either accepted or rejected the appeal. Users complained of the process for its slowness and apparent lack of explanation for why appeals were rejected. In the announcement, Twitch said:</p><blockquote><p id=\"r2uxB6\">This all changes today with the launch of our new appeals portal, located at <a href=\"http://appeals.twitch.tv\">appeals.twitch.tv</a>. On our end, it includes some tech updates that will help our specialists review appeals more quickly. On your end, it simplifies the process by doing two main things: <br>1. It gives you visibility into the enforcements that are eligible for appeal. <br>2. It shows you the status and outcome of ongoing and prior requests, respectively.</p></blockquote><p id=\"IbY0wE\">The announcement also included an extensive FAQ highlighting specific details about how the new appeals process works. Check that out <a href=\"https://safety.twitch.tv/s/safety-news/detail?language=en_US&amp;post=Two-New-Products-to-Streamline-the-Reporting-and-Appeals-Process-on-Twitch\">here</a>. </p><p id=\"6WfWDF\">Since last summer’s <a href=\"https://www.theverge.com/22633874/how-to-stop-a-hate-raid-twitch-safety-tools\">rash of hate raids</a>, which culminated in <a href=\"https://www.theverge.com/2021/8/31/22650578/twitch-streamers-walkout-protest-hate-raids\">streamer boycotts and social media campaigns</a>, Twitch has slowly beefed up its security and safety tools. Last September, Twitch deployed a <a href=\"https://www.theverge.com/2021/9/29/22700937/twitch-safety-tools-verification-phone-hate-raids\">phone verification setting</a> that allowed streamers to protect their chats from being overrun with hateful bot spam by only allowing accounts with verified phone numbers to participate in chat. These new reporting and appeals tools are the next step in Twitch’s ongoing safety program.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WWFO9Zufo2HRXapr55NLSykgYpc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22238847/acastro_210115_1777_twitch_0003.jpg",
  "description": "Twitch will roll out the new features over the next few weeks.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}