{
  "title": "Twitch’s new boost feature puts porn on the homepage",
  "url": "https://www.theverge.com/2022/4/2/23007107/twitch-boost-train-porn-featured-recommended-channels-pause",
  "date": "2022-04-02T13:15:26.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Dx0_TIF700rwErjIqdV_hvRxe20=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70701930/acastro_210115_1777_twitch_0003.0.jpg\" />        <figcaption><em>Oops.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"f1lToi\">Twitch has paused its Boost Train feature, which launched last month and let people pay to promote streams, after porn ended up on users’ homepages with the label “promoted by the streamer’s community” slapped onto the NSFW thumbnails (<a href=\"https://kotaku.com/twitch-boost-feature-paused-porn-this-stream-hype-train-1848738396\">via <em>Kotaku</em></a>). </p><p id=\"CZTQYe\"><a href=\"https://twitter.com/thenoosh22/status/1509025702141734912\">Several</a> <a href=\"https://twitter.com/bowieTCG/status/1509555601604587521\">Twitter</a> and <a href=\"https://www.reddit.com/r/LivestreamFail/comments/tskbw3/comment/i2s39nr/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Reddit users</a> (NSFW links, by the way) shared screenshots of pornographic thumbnails that showed up at the front of their “Live channels we think you’ll like” sections. The thumbnails indicate that the streams showed up there thanks to an experimental feature that Twitch <a href=\"https://www.theverge.com/2021/10/1/22704731/twitch-testing-new-paid-front-page-promotion-feature\">first announced last year</a>. The feature has changed since it was first introduced, but the basic concept remains the same — users can spend money to get a stream in front of people’s eyes. In this case, it just happened to be content <a href=\"https://www.twitch.tv/p/en/legal/community-guidelines/20210122/\">not allowed on Twitch</a>.</p><div class=\"c-float-right\"><aside id=\"cJ8Xth\"><q>Twitch is pausing Boost Train “due to some safety considerations”</q></aside></div><p id=\"AfisyH\">Unless the Twitch users promoting the streams were explicitly trying to get the feature shut off, or get the creator in trouble, it’d be hard to call it money well spent — three accounts have been featured in the most popular screenshots of porn showing up on users’ homepages, and they have all been suspended for violating Twitch’s Community Guidelines. (As Zach Bussey <a href=\"https://twitter.com/zachbussey/status/1509324922522419206\">points out</a>, link again NSFW, the boosted streams could’ve also just been plain old-fashioned trolling.)</p><p id=\"7DTPRq\">Twitch has “decided to pause Boost Train due to some safety considerations that came up through the experiment,” Twitch’s head of communications Sam Faught said in a statement emailed to <em>The Verge. </em>He added that Twitch will “share additional updates with our community around new features to help improve discoverability, as available.”</p><p id=\"UOXah2\">While Twitch doesn’t come right out and say that the experiment has been paused because of the reports, it seems likely that it played a part in the decision. Twitch’s rules prohibit “Nudity and sexually explicit content or activities,” and the thumbnails contained... well, basically all of that. We’ve also seen how <a href=\"https://www.theverge.com/22633874/how-to-stop-a-hate-raid-twitch-safety-tools\">unwanted attention can harm marginalized streamers</a>, which could’ve also been a concern had the feature lived on. <em>Kotaku </em>asked whether the feature would return or be modified, but Twitch reportedly only replied with a reiteration that it was on pause for now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WWFO9Zufo2HRXapr55NLSykgYpc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22238847/acastro_210115_1777_twitch_0003.jpg",
  "description": "Twitch prohibits nudity and sexually explicit content.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}