{
  "title": "Twitter and Google blocked ads from a medical journal about health and racism",
  "url": "https://www.theverge.com/2022/2/18/22937318/twitter-google-ad-blocked-racism-health-journal",
  "date": "2022-02-18T18:39:07.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"The Twitter bird logo in white against a dark background with outlined logos around it and red circles rippling out from it.\" src=\"https://cdn.vox-cdn.com/thumbor/GsLT39jT6H0AcjYPzorKUcxjaEc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70526301/acastro_180827_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"lcAHn1\">The medical journal <em>Health Affairs</em> spent years planning its special issue on health and racism, which it published at the beginning of February. The journal wanted to reach new readers by promoting the issue through targeted advertisements on Twitter and YouTube. </p><p id=\"txMto7\">That’s why it was so frustrating when Twitter and Google blocked its ads before they could go up, says Patti Sweet, the director of digital strategy at <em>Health Affairs</em>. The journal’s Google ads account was also suspended. Sweet wrote a <a href=\"https://www.healthaffairs.org/do/10.1377/forefront.20220211.355893/\">blog post</a> outlining that frustration last week, saying she thought the use of the word “racism” was the trigger for the rejections. </p><p id=\"xXpG7q\">But Twitter and Google say the ad rejections didn’t have to do with the language around racism — rather, they were blocked due to policies around advocacy and COVID-19, respectively. The confusion highlights how health research sometimes doesn’t fit neatly into categories used by tech companies to flag potentially problematic content, making it challenging for them to push out credible information when certain keywords pop up. </p><div class=\"c-float-right\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ISXDVfXzJoWLYSke1v3J0bVOIzE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23255468/image001.png\">      <figcaption><em>A screenshot of the original Twitter ad that was not approved.</em></figcaption>  </figure></div><p id=\"47KxL3\"><em>Health Affairs</em> is a reputable peer-reviewed journal widely read by people working in public health and public policy. The journal’s health and racism issue, released last week, <a href=\"https://www.healthaffairs.org/toc/hlthaff/41/2\">includes articles</a> on sexual and reproductive health of Black women in the South, racial bias in electronic health records, health and police encounters, and inequity in the use of home health agencies. It hoped to use the ads to draw in a new audience to the special issue, Sweet says.  </p><p id=\"JaGkEK\">Google blocked the journal’s ads because the video the advertisements were for discussed COVID-19, communications and public affairs manager Christa Muldoon told <em>The Verge</em>. Ads for content that mentions COVID-19 have to follow the company’s “sensitive events” policy, which blocks ads “that potentially profit from or exploit a sensitive event.” </p><p id=\"2uGgav\">Twitter said in a statement that the ads were blocked under the “cause-based” policy, which requires advertisers get certified before publishing ads that “educate, raise awareness, and/or call for people to take action in connection with civic engagement, economic growth, environmental stewardship, or social equity causes.” Twitter’s caused-based ad policy was put into place <a href=\"https://www.theverge.com/2019/11/15/20966854/twitter-super-pacs-political-ads-facebook-climate-change-abortion-paid-promotion\">in November 2019</a> as part of its regulation of political ads aimed at protecting against bad actors co-opting the platform and covers topics from climate change to animal rights.<strong> </strong></p><p id=\"PBDcoo\">Sweet says she’s familiar with Twitter’s policies but wouldn’t have assumed the journal’s content would fall under cause-based policy. “We’re not advocating on behalf of something. We’re just putting the information out there,” she says. </p><div class=\"c-float-right\"><aside id=\"UXXwaX\"><q>“We’re just putting the information out there”</q></aside></div><p id=\"JOojwZ\"><em>Health Affairs</em> also got one notice for an ad taken down by Twitter under the “inappropriate content” policy, according to screenshots Sweet shared with <em>The Verge</em>. The ad was similar to the ones flagged under the cause-based policy and described how the special issue focused on racism and health. Twitter spokesperson Laura Pacas said in an email to <em>The Verge</em> that any ad would have been denied under the same cause-based policy. </p><p id=\"daiOTf\">Sweet says she thinks the tech companies’ policies around ads are important, but that they’re applied to small groups like <em>Health Affairs </em>in an inequitable way. She wasn’t able to easily contact someone at Google or Twitter to address the issue quickly the same way she might have at a large media agency. As a result, she had trouble getting information from the companies about why the ads were blocked. Sweet also doesn’t think <em>Health Affairs</em> even falls under the type of advocacy category that Twitter’s policy, for example, is set up to target. </p><p id=\"HSByPE\">“We’re not a political organization, but when a machine sees ‘health policy’, they might assume politics,” Sweet says. “And when they see us talking about racism and health, they might assume we are advocating on behalf of something for politicians. So, the brand is awkwardly in a nowhere land.” </p><p id=\"Wg1wHu\"><em>Health Affairs </em>got its caused-based certification for Twitter this week and plans to resubmit its ads. Sweet says the Google ads account is also back on after she submitted appeals. She’s hoping her team can now redirect the spotlight to the research, rather than the conflict with the tech companies. </p><p id=\"pBjATx\">“We’re not able to share it with the world as much as we want to,” she says. “Instead, we’re talking about Google and Twitter.”</p><p id=\"YCxmrh\"><em><strong>Correction February 18th, 5:24PM ET: </strong></em><em>An earlier version of the story said that the </em>Health Affairs<em> YouTube account was suspended. The Google ads account was suspended. We regret the error. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2z0nkeOqAbnZqe1cJriMBz4J4Lg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645587/acastro_180827_1777_0001.jpg",
  "description": "Medical research fits awkwardly into the companies’ policy frameworks.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}