{
  "title": "Twitter is now letting developers add labels to bot accounts",
  "url": "https://www.theverge.com/2022/2/16/22937435/twitter-labels-automated-bot-accounts",
  "date": "2022-02-16T20:00:00.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GlNLL4nQ-G_df-rewTtBQe5Dh4w=/56x0:1541x990/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70517934/AAT.0.jpg\" />    </figure>  <p id=\"EJGufX\">In September, Twitter launched an experiment of labels for automated (aka bot) accounts to make it easier to know when an account was running on its own. That experiment has apparently proved to be a success, as Twitter will let developers add labels to their automated accounts beginning Wednesday. You’ll see the label on the account’s profile and under the account’s name in your feed.</p><p id=\"U8IbPG\">Specifically, the labels will be available to automated accounts created by developers that use the Twitter API, and account owners will need to opt in to have the label applied to their account, according to Twitter spokesperson Celeste Carswell. </p><p id=\"OQyccj\">While the rollout is a little delayed from Twitter’s <a href=\"https://www.theverge.com/2021/9/9/22665748/twitter-automated-account-bot-labels-tweets-test\">previous promise</a> of letting developers use the labels by the end of 2021, I expect this will be welcome news for those who manage bot accounts. There are a lot of ways a bot could be a really handy follow — Twitter’s marketing material shows off a local weather bot, and <em>The Verge’s</em> Chaim Gartenberg made an extremely helpful bot <a href=\"https://twitter.com/todaysdaytoday\">that says what day it is</a> — and having a label attached to these types of accounts will be a useful reminder that they are automated.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2ujsmoz6SCvsWp17XC7Jij9cq1I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23249884/AAP.jpg\">      <cite>Image: Twitter</cite>      <figcaption><em>Unfortunately, </em><a class=\"ql-link\" href=\"https://twitter.com/localweather20\" target=\"_blank\"><em>@LocalWeather20</em></a><em> is a private account.</em></figcaption>  </figure><p id=\"B2IBKt\">Sadly, it’s not hard to imagine a potential bot account being used for harmful things, but Carswell says that automated accounts are subject to <a href=\"https://help.twitter.com/en/rules-and-policies/twitter-automation\">Twitter’s automated accounts policy</a> and Twitter’s overall rules. Twitter <em>won’t</em> be auditing accounts that choose to apply the new labels, though people can report accounts they think might be in violation of the rules.</p><p id=\"78tZNv\">Twitter is also working on a label to memorialize people who have died. That label was supposed to roll out in 2021, but as far as I can tell, it’s not available yet, and Twitter declined to comment about it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HW0_NtGNwN3vLPJ12IifwgrSeFc=/0x77:1596x913/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23249806/AAT.jpg",
  "description": "The feature launched first as an experiment in 2021.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}