{
  "title": "Twitter reverts change that left blank spaces in place of deleted embedded tweets",
  "url": "https://www.theverge.com/2022/4/9/23018126/twitter-reverts-change-left-blank-spaces-websites-embedded-tweets",
  "date": "2022-04-09T19:44:49.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/A2rAMgZfiYLT8T-Ke_6zmGHld1M=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70730931/acastro_170726_1777_0012.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1sFy9e\">Twitter has confirmed it reversed a change that altered the appearance of deleted tweets embedded on websites outside of Twitter (thanks to <a href=\"https://twitter.com/RuinDig/status/1512635716375031810\">@RuinDig</a> on Twitter for pointing this out). Instead of leaving a blank gap in place of the deleted tweets, the site will go back to displaying the tweet’s original text.</p><p id=\"5tnseg\">“After considering the feedback we heard, we’re rolling back this change for now while we explore different options,” Twitter spokesperson Remi Duhé said in an emailed statement to <em>The Verge</em>. “We appreciate those who shared their points of view — your feedback helps us make Twitter better.”</p><p id=\"4sVL0O\">If you head to any third-party webpage with an embedded tweet (like this one from <a href=\"https://www.theverge.com/2021/1/7/22218794/trump-twitter-ban-lifted-unbanned-realdonaldtrump\"><em>The Verge</em></a>), you’ll see that you can once again see the tweet’s original text, date, and the name of the user who posted it. Judging by Twitter’s response, it looks like this reversal is only temporary while the company figures out an alternate way to display deleted tweets on websites. It’s unclear what kind of “different options” Twitter might try out, but, hopefully, it won’t involve completely blocking out any information associated with the tweet.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DU5JHglv1Dgi7e6W6ykHQX8618o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23370738/Screen_Shot_2022_04_06_at_11.49.29_AM.jpg\">      <cite>Screenshot: <a class=\"ql-link\" href=\"https://www.theverge.com/2020/11/4/21550017/trump-pennsylvania-premature-victory-twitter-rules-tweets-biden-election-2020\" target=\"_blank\"><em>The Verge</em></a></cite>      <figcaption><em>How deleted embedded tweets appeared in articles following Twitter’s quiet change.</em></figcaption>  </figure><p id=\"vzkInw\">On Wednesday, <a href=\"http://www.kevinmarks.com/twittereditsyou.html\">Kevin Marks pointed out</a> that Twitter quietly began using Javascript — potentially <a href=\"https://twitter.com/kevinmarks/status/1508754955108241414\">as early as late March</a> — to block out deleted tweets (pictured above) embedded on other websites. This includes tweets from accounts that have been banned or suspended from Twitter, making it impossible to see embedded tweets from people like Donald Trump, who <a href=\"https://www.theverge.com/2021/1/8/22218753/twitter-bans-trump-permanently-realdonaldtrump\">Twitter banned last year</a>. This had pretty big implications for news stories that included deleted tweets or tweets from banned users, which are typically important for context.</p><p id=\"dfIFym\">Earlier this week, <a href=\"https://www.theverge.com/2022/4/5/23011327/twitter-edit-button-blue-test\">Twitter announced that it’s working on a long-awaited “edit” button</a>, sparking concerns over whether people could abuse the feature to change the content of a tweet (including those that are embedded) after it had already been shared.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wKKSgbRLHB_QxDbI_4dUGoOMyvY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8966107/acastro_170726_1777_0012.jpg",
  "description": "Twitter will start displaying deleted embedded tweets again.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}