{
  "title": "Twitter is launching a Tor service for more secure and private tweeting",
  "url": "https://www.theverge.com/2022/3/8/22967843/twitter-tor-onion-service-version-launch",
  "date": "2022-03-08T23:06:08.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/v3Ij1xE-k2gX-CZZLthHTQu26sQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70596564/acastro_200207_3900_Tor_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"3U3z86\">Twitter is launching a version of its site as a Tor onion service, optimizing it for the privacy-protecting and censorship-evading network. Software engineer Alec Muffett <a href=\"https://twitter.com/AlecMuffett/status/1501282223009542151\">announced the news</a> today on Twitter, describing it as “possibly the most important and long-awaited tweet that I’ve ever composed.” The Tor network has also been added to <a href=\"https://help.twitter.com/en/using-twitter/twitter-supported-browsers\">Twitter’s supported browsers page</a>.</p><p id=\"JcIgaO\">Twitter’s onion service is available at https://twitter3e4tixl4xyajtrzo62zg5vztmjuricljdp2c5kshju4avyoid.onion while using Tor Browser or a similar tool. While you could already access Twitter’s ordinary website via Tor, the newly launched version adds more layers of protection to <a href=\"https://www.theverge.com/2020/2/21/21138403/tor-privacy-tools-private-network-browser-settings-security\">the already anonymized browsing experience</a> and is designed specifically for the network. </p><p id=\"fdiLGO\">“It’s a commitment from the platform to dealing with people who use Tor in an equitable fashion,” Muffett told <em>The Verge</em> over Twitter direct message. “Setting up an onion address is a practical step which demonstrates that the platform is providing explicitly for the needs of people who use Tor.”</p><div id=\"GYQm3G\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is possibly the most important and long-awaited tweet that I've ever composed.<br><br>On behalf of <a href=\"https://twitter.com/Twitter?ref_src=twsrc%5Etfw\">@Twitter</a>, I am delighted to announce their new <a href=\"https://twitter.com/torproject?ref_src=twsrc%5Etfw\">@TorProject</a> onion service, at:<a href=\"https://t.co/Un8u0AEXeE\">https://t.co/Un8u0AEXeE</a> <a href=\"https://t.co/AgEV4ZZt3k\">pic.twitter.com/AgEV4ZZt3k</a></p>— Alec Muffett (@AlecMuffett) <a href=\"https://twitter.com/AlecMuffett/status/1501282223009542151?ref_src=twsrc%5Etfw\">March 8, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"c6RUgw\">Onion services are sometimes dubbed hidden services or “dark web” services, although the latter often refers to explicitly criminal sites like the Silk Road drug market. A <a href=\"https://github.com/alecmuffett/real-world-onion-sites/blob/master/README.md#social-networks\">number of websites</a> offer Tor-specific versions, including the DuckDuckGo search engine and news outlets <a href=\"https://open.nytimes.com/https-open-nytimes-com-the-new-york-times-as-a-tor-onion-service-e0d0b67b7482\">like <em>The New York Times</em></a>, <a href=\"https://www.bbc.com/news/technology-50150981\">the BBC</a>, and <a href=\"https://www.propublica.org/nerds/a-more-secure-and-anonymous-propublica-using-tor-hidden-services\"><em>ProPublica</em></a>. Tools like SecureDrop, <a href=\"https://www.theverge.com/a/tip-us-secure-contact-email\">which <em>The Verge</em></a> and other sites use to receive secure documents, also run through Tor.</p><p id=\"ZANVi7\">Muffett, who works with companies to implement onion sites, <a href=\"https://twitter.com/AlecMuffett/status/1501284441896849412\">tweeted that he’s been discussing</a> the possibility of a Tor-friendly Twitter since 2014. That’s when Facebook <a href=\"https://www.theverge.com/2014/10/31/7137323/facebook-adds-direct-support-for-tor-anonymous-users\">launched its own hidden service</a>, a move designed to fix serious functionality issues for Tor users who were often incorrectly flagged as botnets. Facebook said in 2016 that <a href=\"https://techcrunch.com/2016/04/22/facebook-usage-over-tor-passes-1m-per-month/\">a million users per month</a> were accessing the standard site or onion service through Tor.</p><div class=\"c-float-right\"><aside id=\"VPwvDD\"><q>“It’s a commitment from the platform to dealing with people who use Tor”</q></aside></div><p id=\"lTPfWN\">Tor encrypts web traffic and routes it through a series of servers to hide identifying information about users. It’s a popular way to access sites that are subject to internet censorship, and that’s made it particularly relevant since Russia’s February invasion of Ukraine, which <a href=\"https://www.theverge.com/2022/3/4/22960739/russia-internet-block-facebook-meta-roskomnadzor-ukraine\">spurred a Russian crackdown</a> on Twitter, Facebook, and independent news services. Some internet service providers <a href=\"https://blog.torproject.org/tor-censorship-in-russia/\">began censoring Tor itself</a> in December of 2021, but the Tor Project <a href=\"https://www.vice.com/en/article/v7dqxd/twitter-tor-onion-service-dark-web-version\">told <em>Vice</em> today</a> that the actual level of blocking has varied, and Russian users can still connect <a href=\"https://forum.torproject.net/t/help-censored-users-run-a-tor-bridge/704\">via a Tor bridge</a>.</p><p id=\"6deTYy\">Twitter’s onion service has been in the works far longer and has benefits that go beyond simply accessing a blocked platform, however. It forces people to use Tor’s network, since it doesn’t work with ordinary browsers, and it protects against some security risks introduced by standard web addresses. “If you are running Tor Browser and click [or] type in exactly the proper onion address, you are guaranteed to be connected to what you expect — or not at all,” explains Muffett.</p><p id=\"OY43c3\">Having a distinct access path also helps platforms like Facebook and Twitter more easily monitor malicious activity that takes advantage of Tor (like automated scraping or attacks on the site) without blocking or degrading service for good-faith users. Even if most people don’t use Tor to access Twitter, it’s an improvement for the ones who do — and a move toward greater mainstream acceptance for the system.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MFrhmRIaYdFxw3QrO0KWebwwYsY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19713460/acastro_200207_3900_Tor_0001.0.jpg",
  "description": "It’s accessible through Tor Browser and similar apps.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}