{
  "title": "Twitter CEO tells employees the board is still evaluating an Elon Musk takeover",
  "url": "https://www.theverge.com/2022/4/14/23025903/twitter-ceo-board-elon-musk-takeover-still-evaluating",
  "date": "2022-04-14T21:31:39.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"Twitter Logo STOCK\" src=\"https://cdn.vox-cdn.com/thumbor/89N9WOuv71Nq4svrsWBMZfgvU9Q=/17x0:2024x1338/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70750529/twitter-logo-stock-new-york-stock-exchange1_2040.0.jpg\" />    </figure>  <p id=\"edGdWz\">Twitter CEO Parag Agrawal told employees Thursday that the company was still evaluating <a href=\"https://www.theverge.com/2022/4/14/23024905/elon-musk-offers-to-buy-twitter\">a $43 billion offer by Elon Musk</a> to buy the company and take it private, setting the stage for a potentially drawn-out feud with the world’s richest person.</p><p id=\"0FFRwU\">After clips of the songs “I Say A Little Prayer” and “I Want It That Way” by the Backstreet Boys played, Agrawal launched into a 25-minute Q&amp;A session with employees Thursday, according to a person in attendance. He didn’t say when the board would have an answer to Musk’s offer or which way it was leaning, frustrating some who expected a more detailed explanation. The board would follow a “rigorous process” and make a decision “in the best interest of our shareholders,” he said.</p><p id=\"lVxmN6\">Agrawal, who took over as CEO of Twitter last November for Jack Dorsey, fielded concerns from employees about the future of the social network if Musk were to take it over. At least one employee asked about the possibility of future layoffs, which Agrawal said wouldn’t be dictated by individual performance ratings. In response to another question about what would happen to employee stock options if Twitter was taken private, he said it was too early to speculate. The emergency call was held during a “focus week” for Twitter employees, in which they had Monday off and were encouraged to be heads-down on projects and take few meetings.</p><p id=\"W8G8FH\">Prior to the meeting, Musk had <a href=\"https://twitter.com/elonmusk/status/1514686582745284651\">criticized the possibility</a> of board action against the deal, saying it “would be utterly indefensible not to put this offer to a shareholder vote.” In an interview earlier in the day at <a href=\"https://www.theverge.com/2022/4/14/23025343/elon-musk-twitter-takeover-ted-talk-quote-stock-buyout\">the TED 2022 conference in Vancouver</a>, Musk said his bid wasn’t about making money and that he didn’t “care about the economics at all.” Instead, he said he wanted Twitter to protect “free speech” and open up its algorithm to outside scrutiny.</p><p id=\"lSQLbY\">Together, Agrawal’s remarks suggest Twitter <a href=\"https://www.theverge.com/2022/4/14/23025537/twitter-board-shareholders-elon-musk-hostile-takeover-poison-pill\">won’t bend to Musk’s whims easily</a> and that a messy, <em>Succession</em>-style corporate battle could play out in the coming days. Twitter’s board could choose to field other offers for the company or <a href=\"https://www.bloomberg.com/news/articles/2022-04-14/twitter-is-said-to-weigh-poison-pill-defense-to-thwart-musk-bid?sref=ExbtjcSG\">adopt a poison pill</a> — a common strategy for refuting hostile takeover attempts. Musk, meanwhile, told the audience at TED on Thursday that he had a “plan B” should Twitter reject his offer.</p><p id=\"uIVbh3\">Even if Twitter succeeds in defending against Musk this time, employees are already wondering if it can withstand future takeover attempts. At one point during the all-hands, Agrawal demurred when an employee asked: “Are we just going to start inviting any and all billionaires to our board?”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BU2CaLChQyKAmq3qI2W4tqc4BAc=/0x135:2040x1203/fit-in/1200x630/cdn.vox-cdn.com/assets/3531133/twitter-logo-stock-new-york-stock-exchange1_2040.jpg",
  "description": "No decision yet.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}