{
  "title": "Twitter’s DM search will finally actually help you find conversations",
  "url": "https://www.theverge.com/2022/3/23/22993688/twitter-dm-search-keyword-conversation-results",
  "date": "2022-03-24T00:08:19.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"Image showing Twitter’s DM search pulling up a result for “content”\" src=\"https://cdn.vox-cdn.com/thumbor/zr6RQGBtyr46143VLS8RIIbo-gc=/0x0:1214x809/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70664182/Screen_Shot_2022_03_23_at_16.11.49.0.png\" />        <figcaption><em>It can now find keywords, not just names.</em></figcaption>    </figure>  <p id=\"m5rKX6\">Twitter <a href=\"https://twitter.com/TwitterSupport/status/1506723722824232960?s=20&amp;t=nsrt_VseT7l-0pHIXjHbuQ\">announced on Wednesday</a> that its DM search feature has gotten a big upgrade — it can now search through the content of your conversations and return specific messages that contain whatever keyword you type in. Before you could only use it to search for people’s names or the names of group chats, but now if you want to find that one conversation you had with a friend about “chili” you can just type it into the search bar. </p><p id=\"ry5QOB\">Of course, searching for person or conversation names still works, and you can even decide whether you want to see results for people, groups, or messages — handy if the keyword you’re trying to search happens to be someone’s name.</p><div id=\"BD2KG3\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We know you’ve been waiting for the option to search your DMs…<br><br>Now you can use the search bar in your inbox to find specific messages using keywords and names. <a href=\"https://t.co/A41G8Y45QI\">pic.twitter.com/A41G8Y45QI</a></p>— Twitter Support (@TwitterSupport) <a href=\"https://twitter.com/TwitterSupport/status/1506723722824232960?ref_src=twsrc%5Etfw\">March 23, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"7kUSDP\">This change has been a long time coming. When Twitter <a href=\"https://www.theverge.com/2021/5/13/22434936/twitter-dm-search-android-expanding\">brought DM search to Android</a> in May 2021, it said that content search was coming later that year. The company seems to have missed that deadline by a bit, but at least it’s available on every platform — the original search was <a href=\"https://www.theverge.com/2019/10/1/20893603/twitter-dm-search-launch-apple-iphone-ios-text\">available on iOS</a> for almost two years before Twitter added it to Android.</p><p id=\"JJPW3R\">Testing it out myself, the improved search seemed to work on the web, as well as the iOS and Android apps. While it can search reasonably old messages, it doesn’t seem to search all of them — it dug up results from 2020, but on my account it didn’t include any results from 2019 or earlier. (It’s worth noting that attempts to search for people’s names also seemed to only look back that far as well.)</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/lzkoRmJ8EDVyR-YvjrIYR00MEtI=/0x0:1545x809/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23341062/Screen_Shot_2022_03_23_at_16.11.49.png",
  "description": "Search for keywords, not just names",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}