{
  "title": "Two men arrested for $1.1 million NFT ‘rug pull’ scam",
  "url": "https://www.theverge.com/2022/3/24/22995107/us-arrest-charges-crypto-nft-rug-pull-frosties-ethan-nguyen-andre-llacuna",
  "date": "2022-03-24T21:10:02.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"A picture of a cartoon character with a top hat holding playing cards.\" src=\"https://cdn.vox-cdn.com/thumbor/8-RfjeOYEJNcuaBXY8otlE3EjYE=/0x34:800x567/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70668584/unnamed.0.png\" />        <figcaption>A Frosties NFT avatar. | Frosties</figcaption>    </figure>  <p id=\"hK15Xv\">US government prosecutors have <a href=\"https://www.justice.gov/usao-sdny/pr/two-defendants-charged-non-fungible-token-nft-fraud-and-money-laundering-scheme-0#_ftn1\">charged two men</a> with fraud and money laundering over a cryptocurrency “rug pull” scheme. Ethan Nguyen and Andre Llacuna allegedly earned around $1.1 million by selling non-fungible tokens (or NFTs) based on cartoon-like characters called “Frosties.” After selling the NFTs, they shut down the project and transferred its funds to a series of separate crypto wallets, leaving Frosties owners bereft of promised rewards.</p><p id=\"q9JTRR\"><a href=\"https://www.justice.gov/usao-sdny/press-release/file/1486816/download\">According to the criminal complaint</a>, the Internal Revenue Service, Criminal Investigation (IRS-CI), and Homeland Security Investigations (HSI) began investigating Frosties in January, shortly after receiving complaints about the scam. Frosties was a buzzy project whose 8,888 NFTs — priced at the Ethereum equivalent of roughly $130 — sold out within an hour of the public launch.</p><p id=\"M7viWf\">But <a href=\"https://www.protocol.com/fintech/frosties-nft-rug-pull\">as chronicled by <em>Protocol</em></a>, the creators abandoned it almost immediately. Buyers earned only a few dollars when they tried to resell their NFTs, and they gave up any hope of seeing future promised rewards, including 3D versions of their avatars and a Frosties video game. (Some scammed community members nonetheless attempted to resurrect the Frosties as a separate NFT lineup.) Now, the two men behind Frosties have been arrested in Los Angeles, California.</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\"Hey Garry, I know this is shocking, but this project is coming to an end. I never intended to keep the project going, and I don’t have a plan for anything in the future. This is why the project is coming to an end. You were an amazing mod, and you have a heart of gold. ... No matter what people say, I genuinely care about you. With everything going on, I want you to know that I do care. I appreciate you, even if you don’t appreciate me. - Frostie.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Jr-M7fbi_Kh4N_STf6NJi4WO1jo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23343386/Screen_Shot_2022_03_24_at_4.33.40_PM.png\">      <figcaption>An alleged message from Ethan Nguyen to a Frosties community moderator.</figcaption>  </figure></div><p id=\"kGfKcq\">The complaint includes an apparent apology and confession from Nguyen to the moderator of the Frosties community Discord server. “I know this is shocking, but this project is coming to an end. I never intended to keep the project going, and I don’t have a plan for anything in the future,” it reads. The message goes on to say Nguyen sent the moderator some Ethereum “for your troubles” and recommends deleting their Discord account. “I want you to know that I do care. I appreciate you, even if you don’t appreciate me,” it concludes.</p><p id=\"QfsjSk\">The Frosties operators apparently remained confident enough to plan a follow-up series called “Embers” that was supposed to launch later in March. Embers’ roadmap included a $50,000 charity donation and a community-controlled wallet that would hold a quarter of the initial sales funds — and while the Red Cross confirmed receiving the donation, the latter promise appears far more dubious.</p><p id=\"q95lCZ\">But among other details, investigators matched Nguyen and Llacuna’s Discord account data (including Nguyen’s IP address and Llacuna’s email address and phone number) with corresponding accounts on the Coinbase cryptocurrency exchange. The Coinbase accounts were linked with a Citibank credit card and government ID that let law enforcement track the pair down. Investigators also traced a series of transfers through which Nguyen and Llacuna allegedly tried to obscure where they were sending the Frosties funds, leading to the money laundering accusations.</p>  <figure class=\"e-image\">        <img alt=\"An image of a series of goals for the Embers NFT as described in the story.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CmFJ_sEGO3rcFvaourAG2k5eyGY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23343385/maps_day.png\">      <figcaption>The planned Embers NFT roadmap.</figcaption>  </figure><p id=\"Fy9dVN\">Crypto <a href=\"https://www.theverge.com/22683766/nft-scams-theft-social-engineering-opensea-community-recovery\">“rug pull” schemes</a> are extremely common, but criminal cases remain far less numerous. For one thing, the teams behind NFT series often don’t reveal their legal identities — <a href=\"https://www.theverge.com/2022/2/5/22919612/bored-apes-yacht-club-florida-men-identities-revealed\">until recently</a>, even the founders of the super-high-priced Bored Ape Yacht Club series remained pseudonymous. For another, lucrative NFT series launches are a relatively recent phenomenon. And the legal status of NFTs in general can be murky.</p><p id=\"u5Reeb\">But the Justice Department release is unambiguous about calling Frosties a scam. “NFTs represent a new era for financial investments, but the same rules apply to an investment in an NFT or a real estate development,” said IRS-CI Special Agent-in-Charge Thomas Fattorusso in a statement. “You can’t solicit funds for a business opportunity, abandon that business and abscond with money investors provided you.” In any case, if you <em>are</em> going to do it, you probably shouldn’t admit to it on Discord.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_hGuHCPoYQSjmHex54kJRVKS9ak=/0x91:800x510/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23343420/unnamed.png",
  "description": "The Frosties project shut down immediately after launch.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}