{
  "title": "UA Flow Velociti Wind 2 review: smarter, faster running shoes",
  "url": "https://www.theverge.com/22948963/ua-flow-velociti-wind-2-review-fitness-tracker-running-shoes-wearables",
  "date": "2022-02-24T15:49:45.000Z",
  "author": "Victoria Song",
  "content": "  <p>These smart shoes can tell you how to run faster</p> <p class=\"p--has-dropcap p-large-text\" id=\"NCEO25\">When you google “best running shoes,” you’re not going to find Under Armour at the top of many lists. That’s usually reserved for Brooks, Hoka, Saucony, Nike, New Balance, and a few other specialty brands. But there’s one thing Under Armour’s got that these other well-established brands don’t — a line of connected running shoes. The latest is the $160 Under Armour Flow Velociti Wind 2, and as you might guess from the name, it’s meant to help you run faster. </p><p id=\"xJTTYy\">The Velociti Wind 2 uses Under Armour’s all-in-one “Flow” foam. It acts as both the midsole and outsole, which shaves 2–3 ounces off the shoe’s overall weight. The Flow foam is also supposed to be “naturally sticky” for better traction without adding bulk. It also has a “Warp” upper that “adapts to the runner’s foot throughout their stride” using a mix of knit, nylon, and mesh. All this is a fancy way to say it’s a speedy, lightweight shoe that can handle varying terrain.</p><div id=\"hdNG3d\"><div data-anthem-component=\"scorecard:11065267\"></div></div><p id=\"IdxUd8\">As for how it differs from the original Velociti Wind, I couldn’t tell at a glance. That’s because it’s basically the same shoe, with some minor adjustments to the logo placements on the upper. That’s not the worst thing if you happen to like the original shoe — just a little disappointing. </p><p id=\"8ZPZpT\">I’ve tested three of Under Armour’s connected sneakers already (this is my fourth), and they all share the same basic features. There’s a sensor in the midsole of the right shoe that gathers data about your running form. The sensor then connects with your phone via Bluetooth to provide you insights and audio coaching in the MapMyRun app. It’s fairly straightforward. The neat thing is, unlike other smart devices, the Velociti Wind 2 doesn’t need to be charged. <em>Ever</em>. (You do, however, have to update the firmware once you pair the shoes to your phone.) </p><p id=\"Th3ts4\">The main reason you’d get these over more traditional running shoes is the smart coaching features. The shoes track metrics like cadence (how many steps you take in a minute), stride length, ground contact time, and foot strike angle. Altogether, these metrics can give you a big-picture view of your running form. After each workout, you can access graphs in the MapMyRun app that contextualizes what your individual numbers mean. I’ve run hundreds of miles in Under Armour connected shoes over the years, so I now know I’ve had a good run when my cadence is between 170–180 steps per minute, with a stride length of about 62–65 inches. I also know my foot strike angle is usually between 7–9 degrees, but that doesn’t tell me much other than I tend to land on my midfoot.  </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"Close up of the bottom of the UA Flow Velociti Wind 2 shoe\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6RNwwrIk7TBDDwuHwFe8BM3Napo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23263008/akrales_220215_5021_0064.jpg\">      <figcaption><em>The “Flow” foam acts as both midsole and outsole to reduce the shoe’s weight</em></figcaption>  </figure></div><p id=\"UIPXwD\">Under Armour isn’t the first company to make this kind of product. The first smart running shoe I ever tested was the <a href=\"https://www.digitaltrends.com/wearables/altra-torin-iq-smart-shoes/\">Altra Torin IQ</a> several years ago. They were… not great. Comfortable, sure, but the smart coaching was buggy due to crappy connectivity. You don’t have that problem with Under Armour’s shoes. Setup is almost instantaneous, and I’ve never had an issue with a shoe failing to connect with the app. It’s good enough that you can get real-time audio cues where the MapMyRun app tells you if your cadence is too high or low for your target pace. It’s occasionally laggy, but they’ve been helpful reminders for me whenever my form starts slipping.</p><p id=\"uCz84h\">But my favorite — and most underrated — feature is that these shoes will notify you when it’s time to replace them. Apps like Strava and Runkeeper let you track your gear’s mileage, but it’s limited to activities recorded in that app. The Velociti Wind 2 should last you about 300–400 miles, which is on par with your average running shoe.<strong> </strong>Because these shoes are smart, they track your mileage regardless of whether you’ve recorded a run — even if you don’t sync right away. Is it weird getting an email from your shoes telling you they’re about to die? Absolutely yes. But I also love not having to worry that I accidentally wore my running shoes on a casual walk.</p>  <figure class=\"e-image\">        <img alt=\"Person tying shoe next to a phone with the MapMyRun app pulled up\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sdDx-ApUPwWZqBza_QJXPCys2lc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23263009/akrales_220215_5021_0091.jpg\">      <figcaption><em>The UA Flow Velociti Wind 2 pairs with the MapMyRun app.</em></figcaption>  </figure><p id=\"dg0Qdo\">The smart features are nice, but Under Armour is also promising faster performance with this generation. I enjoy busting a marketing gimmick, but I have to give credit where credit is due: I hit my fastest mile split since I started half-marathon training while wearing these shoes. </p><p id=\"xYUA3q\">Also, the Velociti Wind 2 truly are light. It’s what I noticed most when I slipped them on for the first time. In several runs, it felt like I was flying through my neighborhood. On one run, I managed to shave off a whole 30 seconds off my average pace. That totally shocked me since I didn’t feel like I’d put in a lot of effort. I mostly run on concrete sidewalks and roads, so I can’t speak to how the Velociti Wind 2 handles trails, and I also make a point of avoiding snow and ice. That said, on my runs, they were grippier than my usual Hoka Rincon 3. </p><p id=\"njktSh\">But while Under Armour delivered on a lot of its promises, picking a running shoe involves a whole lot more than how fast you can run in them. Everybody’s running goals, feet, and preferences are different. If you run on a lot of dirt roads and gravel, you’ll probably want a trail shoe for better traction. If your feet roll inwards, you might want stability or motion control shoes for more arch support. Maybe you run long distances and want a little extra cushioning. These are lightweight neutral shoes, meaning there’s no extra cushioning or support.<strong> </strong>Unfortunately, the Velociti Wind 2 just aren’t the right shoes for me at the moment.</p><div><aside id=\"IjUQte\"><q>Picking a running shoe involves a whole lot more than how fast you can run in them</q></aside></div><p id=\"6pTz5N\">For the next few weeks, my goal is to build up my endurance so I can continuously run my first half marathon <em>without</em> getting injured. My regular route features uneven terrain that’s hard on my ankles. I’m also coming off a year of injuries. In short, I want a comfortable shoe that lets me run longer distances without getting injured again. Speed isn’t at the top of my list of priorities.</p><p id=\"GO9non\">In fact, while I was a speedier runner in the Velociti Wind 2, I had to cut a few runs short. I wasn’t used to the lighter weight, and I ended up burning out faster than I should have. It also has less cushioning than my Hokas, which meant I felt every bit of uneven ground shoot up my knees. At 2.5 miles into a 5-mile run, I felt a twinge in my shin — my worst fear since shin splints sidelined me for two months last year. At the three-mile mark, my toes started going numb. Out of an abundance of caution, I called it quits for the day.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The MapMyRun app showing the shoe’s form data on a phone\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hgf43lXLlT7k8BUTe0Jky1dJNkM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23263010/akrales_220215_5021_0131.jpg\">      <figcaption><em>The shoes track cadence, stride, ground contact time, and foot strike angle.</em></figcaption>  </figure></div><p id=\"BpfFfi\">That freaked me out, but I decided to try again with insoles. After I did that, I had a much better experience. I managed to complete my runs and even set a new PR. But still, I noticed the beginnings of shin and knee pain at around the 4-mile mark. Knowing that, there was no way I was going to risk running my weekly long run in these. For me, these shoes would be fine for shorter runs or speedwork, but I definitely wouldn’t use them for any run longer than 10K (6.2 miles). </p><p id=\"jpu54i\">Again, this is very specific to me, my goals, and my feet. If you like lighter, speedier shoes, the Velociti Wind 2 might tick off a lot of boxes — but you won’t know until you go for a run in them. </p><p id=\"I1MkNd\">Lastly, $160 is a lot for a pair of running shoes. You can easily buy an excellent, non-smart pair for $120 or less. And that’s at retail price — running shoes are cheaper to buy online and <a href=\"https://runrepeat.com/running-shoe-prices-analyzed\">frequently on sale</a>. You’re paying a lot for the smart features here, and that gives me pause. </p>  <figure class=\"e-image\">        <img alt=\"Shot of person walking in the UA Flow Velociti Wind 2\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8TiRX_L2ko8bzrSI-9d1TQO-7Kk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23263002/akrales_220215_5021_0005.jpg\">      <figcaption><em>I’d stick to shorter runs or speedwork in these shoes.</em></figcaption>  </figure><p id=\"uVTcAh\">The people who would most benefit from gait coaching are beginners, but $160 is a lot for someone to invest if they’re not even sure they like running. Also, while I liked Under Armour’s gait coaching early on, I’ve since outgrown it. My stats are so consistent that I’m not learning much anymore. Plus, since the sensor is only in the right shoe, I’m not getting a complete picture of my running form. A couple of years ago, I had my running form <a href=\"https://gizmodo.com/asicss-new-smart-shoes-roasted-my-running-form-1840869085\">analyzed at CES by Asics</a>, and it revealed I’m a bit of an asymmetrical runner. These shoes won’t help me fix that. I had a more in-depth experience with the <a href=\"https://gizmodo.com/nurvv-run-made-me-a-faster-runner-but-i-dont-know-if-i-1845803310\">Nurvv Run</a> insoles, which monitor both feet and can even tell you whether <a href=\"https://www.verywellfit.com/pronation-definition-3436329\">you’re over- or under-pronating</a>. (That said, the Nurvv Run also had its fair share of limitations and was stupid expensive at $300.) </p><p class=\"c-end-para\" id=\"fLOD5A\">Ultimately, if you’ve been running for a while, you probably already know what works for you. If you’re new, I can’t stress enough that you should probably go get fitted at a running specialty store first. But if you don’t mind the price and want the extra form feedback, Under Armour’s connected shoes are going to get you the best experience for the most affordable price.</p><div><div id=\"k2SlOF\"><div data-anthem-component=\"aside:11065287\"></div></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/DEZNSfBH_ODq7FZ1ae43nbQrVBM=/0x208:2040x1276/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23263004/akrales_220215_5021_0035.jpg",
  "description": "These smart sneakers also double as a running coach.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}