{
  "title": "Uber unveils new products for business travelers, wedding parties, and EVs",
  "url": "https://www.theverge.com/2022/5/16/23071034/uber-product-travel-wedding-eats-av-ev-delivery-features",
  "date": "2022-05-16T15:15:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pJ18w_C6e9ixrcFWMONEmTdZiRA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70874554/acastro_180927_1777_uber_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"8g2pS8\">Uber held its <a href=\"https://www.theverge.com/2022/3/31/23005307/uber-go-get-2022-product-event-date\">second annual product event</a> today, at which the company announced new features for business travelers, group rides, and electric vehicles. The news comes as the company’s CEO, Dara Khosrowshahi, is renewing his efforts to make <a href=\"https://www.theverge.com/2022/5/9/23063499/uber-ceo-slash-costs-hiring-slowdown-ride-hailing-profit\">Uber’s core ride-hailing product profitable</a> through cost-cutting and a hiring slowdown. </p><p id=\"UIJwzh\">Just because Uber is trying to rein in its costs doesn’t mean it will stop rolling out new features in its ongoing effort to win new customers (or retain its current customers) and expand into new fields. Since the pandemic, Uber has pivoted away from trying to be the “Amazon of transportation” and toward a more streamlined version of itself as a car service with a thriving delivery business. </p><p id=\"gHQpal\">In a blog post, Khosrowshahi said that Uber’s new suite of products falls under two categories: “go anywhere” and “get anything.” The former is focused on transporting people, while the latter is geared toward the company’s takeout food and grocery delivery business. </p><div class=\"c-float-right\"><aside id=\"FCdGpa\"><q>“go anywhere” and “get anything”</q></aside></div><p id=\"VFS61w\">Under “go anywhere,” the company is launching a new product called <strong>Uber Travel</strong> that automatically books car service trips for every element of an upcoming trip, either business or personal. Users will need to link their Gmail to their Uber account to give the app’s algorithm a peek at upcoming flights, hotel stays, and restaurant reservations. If you don’t relish the idea of giving Uber access to your Gmail account, the company is offering 10 percent back in money you can use in the Uber app for other services as an incentive. </p><p id=\"VGQB7s\">Uber is looking to expand on its <a href=\"https://www.theverge.com/2015/11/7/9684422/uber-events-caravan-party-bus-california\">long-held interest in party buses</a> with a new product called <strong>Uber Charter</strong>. This is aimed at customers planning weddings, work trips, wine tastings... anything where you need to move a large group of people. Now those reservations can be made through the Uber app with upfront pricing. Uber Charter is launching “across the US” later this summer. </p><p id=\"a5GsYE\">If you’d rather pay for a large batch of Uber rides for, say, your wedding guests, Uber is offering <strong>vouchers</strong>. Customers can share a unique code with their guests that they can then use to book an Uber ride that’s already been paid for. Vouchers also work for Uber Eats deliveries and are available through Uber for Business customers as well. </p><p id=\"h0jcsM\">Uber is expanding its <a href=\"https://www.theverge.com/2019/7/9/20686640/uber-comfort-extra-legroom-quiet-mode-temperature-air-conditioning-ac\">Comfort product</a>, which is fancier than UberX but not as pricey as Uber Black, by adding electric vehicles to the mix. The company has set a goal for itself to have “100 percent” EVs in North America by 2030. Now it’s incentivizing drivers to switch to EVs through a new <strong>Comfort Electric</strong> product. Only premium EVs, like Tesla, Polestar, and Ford Mustang Mach-E, would be considered eligible for Comfort Electric trips. It will sit alongside the company’s other EV product, <a href=\"https://www.theverge.com/2021/1/12/22226094/uber-electric-vehicles-cities-public-transportation\">Uber Green</a>, which gives drivers an extra fee (usually $1) to use electric vehicles. Comfort Electric is now available in Los Angeles, San Francisco, San Diego, and Dubai, with more cities to come soon.</p><div class=\"c-float-right\"><aside id=\"r99VGx\"><q>Comfort Electric</q></aside></div><p id=\"cpXcdc\">Uber is also creating a <strong>new hub for its drivers</strong> who are using EVs to make money on the platform. The hub, which will live on Uber’s driver app, is being billed as a “one-stop shop” (<a href=\"https://www.theverge.com/2019/5/30/18646470/uber-eats-ride-hailing-promotions-dara-khosrowshahi\">Uber loves that phrase</a>) to compare costs between regular cars and EVs and finding charging stations. </p><p id=\"tgtuIP\">Uber is also making a number of announcements under the “get anything” category. Customers who own a <strong>Google Home</strong> smart device can now use it to order food delivery through Uber Eats. It will start rolling out for English-speaking customers first, with other languages to follow. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/geNXivgE16Dx_p1VjTFcuZ62-9o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23470722/MotionalIONIQ5Robotaxi.jpg\">  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FknnNX6sb8_jhPDusA1uVgaJB5U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23470720/Serve_street.jpg\">  </figure><p id=\"D1K6ZC\">The company is also partnering with two autonomous vehicle companies, Serve Robotics and Motional, to test out <strong>robot deliveries</strong>. Serve Robotics operates delivery robots that travel on sidewalks, while Motional uses electric Hyundai Ioniq 5 SUVs with two safety drivers in the front seats. Serve and Motional’s respective pilots with Uber Eats will be available to customers in the Los Angeles area.</p><p id=\"UgCbBQ\">Uber has been interested in using AVs to make deliveries for years. It was in talks with Nuro, a startup founded by two ex-Google engineers, about using the companies’ vehicle-sized robots to make Uber Eats deliveries, but that never panned out. </p><p id=\"CwNH4d\">The company is expanding its <strong>Uber Eats delivery service to a handful of stadiums</strong> as a way to let sports fans satisfy their hunger without missing any of the game. Customers can use Uber Eats to order food to pick up at a concession stand and skip the line. Eligible stadiums include Dodger Stadium and Angel Stadium in LA; Yankee Stadium in New York City; Capital One Arena in Washington, DC; Minute Maid Park in Houston; PayPal Park in San Jose; and Roazhon Park in France. </p><p id=\"6weDNY\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QLNQrcZS20Q8qHZNKuBCHqPJlXo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13175211/acastro_180927_1777_uber_0001.jpg",
  "description": "New EV and AV features, too",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}