{
  "title": "Uber will now let you see how many one-star ratings you got from drivers",
  "url": "https://www.theverge.com/2022/2/16/22935861/uber-five-star-rating-breakdown-customers-privacy",
  "date": "2022-02-16T10:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"The Uber logo against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/_MVO0TplZIQl1PreXAZZ9yYrBHE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70515666/acastro_180927_1777_uber_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"uaTWVu\">For the first time, Uber is allowing its customers to see how many five-star ratings they’ve received from drivers  — as well as how many shameful one-star reviews they’ve racked up. </p><p id=\"nWLIsw\">For years, <a href=\"https://www.theverge.com/2015/10/28/9625968/rating-system-on-demand-economy-uber-olive-garden\">the two-way rating system has fueled Uber’s power</a> over its riders and drivers. Low-performing drivers — those with an average of four stars or less — were at risk of deactivation. <a href=\"https://www.theverge.com/2019/5/29/18644143/uber-deactivate-rider-below-average-rating\">Even some poorly behaved passengers</a> could get kicked off the platform if they received enough one-star ratings. Now, Uber is offering its customers fresh insight into how they are perceived by drivers. </p><p id=\"twOlga\">Customers will be able to access a breakdown of their average ratings in the Uber app’s new privacy menu, which will be available to customers globally starting today.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5rg6L9NBPBh8qU3LJ1E0XsCV8w4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23247966/Ratings_Breakdown_in_Iphone_Shell__animated___1_.gif\">  </figure><p id=\"mFGeK0\">To access the Privacy Center and ratings breakdown in the app, go to the settings menu, tap “Privacy,” and then “Privacy Center.” Then, swipe to the right and click on the “Would you like to see a summary of how you use Uber” tile. Scroll down to the “Browse your data” section and tap on “View my ratings” to see the breakdown.</p><p id=\"sJCl5R\">In the interest of transparency, I found my own ratings breakdown and am publishing it below. Apparently, I’m well-liked, which will no doubt come as a shock to my many haters. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lXUG7JAJQPfCySXeE_HwRgO1Fig=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23247820/IMG_8E18E9BA4B74_1.jpeg\">      <cite>Andrew J. Hawkins</cite>      <figcaption><em>My ratings breakdown, according to the Uber app.</em></figcaption>  </figure><p id=\"taRAnY\">If you looked at your ratings breakdown and were aghast at what you found, Uber has some tips for how to improve your standing. </p><blockquote><p id=\"anpMoh\"><strong>Pack it in, pack it out: </strong>Drivers shouldn’t have to clean up after you. Always make sure to take your trash and any other belongings with you. Don’t leave a mess behind. </p><p id=\"dFbiTE\"><strong>Buckle Up: </strong>Studies show that unbuckled passengers in the back seat can put the driver at greater risk of injury in a crash. So always remember to buckle up for your and the driver’s safety. </p><p id=\"i8v8at\"><strong>Be ready: </strong>Remember that drivers’ time is valuable and they shouldn’t have to wait for you. A smooth pickup is better for everyone so be ready to go when the driver arrives. </p><p id=\"63cqIm\"><strong>Treat everyone and everything with respect: </strong>As outlined in our Community Guidelines, we want riders and drivers to feel safe, respectful, and positive. Always treat your driver and their vehicle as you would want to be treated. </p><p id=\"QL2R8d\"><strong>Don’t slam the door! </strong>It is easy to accidentally slam a door if you aren’t thinking about it, and drivers have consistently cited door slams as a reason why they deduct stars. </p></blockquote><p id=\"xSQ0f6\">Uber had been experimenting with different ways for riders and drivers to give feedback to each other for years. In 2017, the company introduced a <a href=\"https://www.theverge.com/2017/9/26/16366104/uber-driver-rider-feedback-rating-pool\">feature that allowed drivers to offer additional comments</a> to riders regarding their behavior. Drivers would choose from a list of reasons: “wait time,” “patience,” “number of riders,” “attitude,” “wanted new route,” or “other.” If a rider gets the same “tag” twice within 30 days, a notification would appear when they open the Uber app to let them know that their behavior is affecting their rating.</p><p id=\"8mdPgh\">Uber also publicized its community guidelines, which include <a href=\"https://www.theverge.com/2016/12/8/13878790/uber-community-guidelines-update-riders-assault-sex\">a list of awful behaviors</a> that will get you banned from Uber. A lot is pretty self-explanatory: don’t trash your driver’s car, don’t assault or insult your driver, and definitely don’t try to have sex with your driver. (<a href=\"https://www.theverge.com/2022/1/18/22878214/uber-lyft-women-drivers-sexual-assault-harassment-safety\">According to women who drive for Uber</a>, that last rule is often ignored by male passengers.)</p><p id=\"Nh0JmB\">In addition to the new ratings breakdowns, Uber is also publishing data on which cities have the highest and lowest average ratings in the country. As expected, New York City is undefeated in its density of surly attitudes. No. 1 city in the world, baby!</p><p id=\"4Drskz\"><strong>Top 10 highest average rider rating among large US cities</strong></p><p id=\"v1MGc3\">1. San Antonio</p><p id=\"rUNkhJ\">2. St Louis</p><p id=\"hC3jQt\">3. Nashville</p><p id=\"pEbBeA\">4. Salt Lake City</p><p id=\"xokiQ9\">5. Kansas City</p><p id=\"YYeg4C\">6. Sacramento</p><p id=\"pyQFJo\">7. Tampa Bay</p><p id=\"sjUKw1\">8. Charlotte</p><p id=\"SOkyXc\">9. Las Vegas</p><p id=\"T3jlun\">10. Portland</p><p id=\"1netTw\"><strong>Top 10 lowest average rider rating among large US cities</strong></p><p id=\"SE97Hu\">1. New York City</p><p id=\"lxfxuw\">2. Seattle</p><p id=\"ARYwcN\">3. Washington, DC</p><p id=\"qLkCD4\">4. Boston</p><p id=\"f8Y2Xw\">5. Minneapolis - St. Paul</p><p id=\"wnISQt\">6. San Francisco</p><p id=\"8aI8O4\">7. Philadelphia</p><p id=\"foMQHR\">8. Los Angeles</p><p id=\"fFfYaV\">9. Baltimore-Maryland</p><p id=\"p8oI2q\">10. Chicago</p><p id=\"gCO6dx\"></p><p id=\"rXYnmL\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HHiAGb2BBAeewprURfm0DeM1d6k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13175209/acastro_180927_1777_uber_0002.jpg",
  "description": "Too many one-star ratings? Maybe you need to check yourself.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}