{
  "title": "Uber and Lyft extend legal fee coverage to drivers sued under Oklahoma’s forthcoming abortion law",
  "url": "https://www.theverge.com/2022/4/30/23050662/uber-lyft-extend-legal-fee-coverage-drivers-sued-over-oklahoma-restrictive-abortion-law",
  "date": "2022-04-30T19:22:30.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9QMq-tKbaIlSC6KPuohItQkXRkA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70816536/acastro_180927_1777_uber_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"sIcPte\">Uber and Lyft have both pledged to cover legal fees in case their drivers are sued under Oklahoma’s restrictive abortion bill, according to a report from <a href=\"https://www.cnbc.com/2022/04/30/lyft-will-cover-legal-fees-for-drivers-sued-under-oklahoma-abortion-law.html\">CNBC</a>. While the bill has not yet been signed into law, Republican Governor Kevin Stitt is expected to approve it within the next few days.</p><p id=\"8r39rg\">On Friday, <a href=\"https://www.cbsnews.com/news/oklahoma-passes-texas-style-abortion-ban/\">Oklahoma’s House passed</a> the Heartbeat Act (<a href=\"http://www.oklegislature.gov/BillInfo.aspx?Bill=sb1503&amp;Session=2200\">SB 1503</a>), a law that <a href=\"https://www.vox.com/2022/4/29/23048887/oklahoma-abortion-ban-texas-six-week\">bans abortions at around six weeks</a> of pregnancy — much earlier than many women become aware that they’re pregnant — and now awaits Governor Stitt’s signature. Like a similar <a href=\"https://www.vox.com/2021/8/31/22650303/supreme-court-abortion-texas-sb8-jackson-roe-wade-greg-abbott\">anti-abortion law recently passed in Texas</a>, Oklahoma’s bill also gives individuals the right to sue someone who “aids or abets the performance or inducement of an abortion.” This includes the clinic that performs the procedure, as well as the person who drives the woman to the medical building. </p><p id=\"EKE6BM\"><a href=\"https://www.theverge.com/22656392/lyft-uber-legal-fees-drivers-lawsuit-texas-sb8-abortion-law\">Lyft and Uber both said they would cover drivers’ legal fees</a> after Texas passed its anti-abortion law in September, and now they’re doing the same for drivers in Oklahoma. Shortly after the bill passed through Oklahoma’s legislature, Lyft CEO Logan Green <a href=\"https://twitter.com/logangreen/status/1520196525376241664\">announced on Twitter</a> that the company “will cover 100 percent of legal fees” for drivers sued under the forthcoming law. </p><div id=\"SjmFMC\"><blockquote class=\"twitter-tweet\"><p lang=\"et\" dir=\"ltr\">Oklahoma <a href=\"https://t.co/npCUyLAYUJ\">pic.twitter.com/npCUyLAYUJ</a></p>— Logan Green (@logangreen) <a href=\"https://twitter.com/logangreen/status/1520196525376241664?ref_src=twsrc%5Etfw\">April 30, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"3k4xla\">“Women’s access to healthcare is under attack again, this time in Oklahoma,” Green said in a tweet. “Lyft drivers are once again caught in the middle just for getting people where they need to go. We believe transportation shouldn’t be a barrier to accessing healthcare and it’s our duty to support both our rider and driver communities.”</p><p id=\"VjibXX\">Green also said the company is “working with health provider partners to create a safe state program” that will cover the cost of travel for riders seeking out-of-state abortion care. Additionally, Lyft says it will cover travel costs for insured US-based Lyft drivers who need to travel over 100 miles to an abortion clinic.</p><p id=\"4G6OZ0\">Although it hasn’t been announced on Uber’s public-facing channels yet, the company confirmed to CNBC that it plans on enacting a similar policy. “Like in TX, we intend to cover all legal fees for any driver sued under this law while they’re driving,” an Uber spokesperson said in a statement to CNBC. It’s unclear whether Uber also plans on covering travel expenses for drivers or passengers traveling for an abortion. <em>The Verge</em> reached out to Uber with a request for comment but didn’t immediately hear back.</p><p id=\"yhG0ox\">Earlier this month, <a href=\"https://www.theverge.com/2022/4/12/23022695/yelp-travel-reimburse-employees-travel-abortion-access-texas-law\">Yelp announced that it would cover the travel expenses</a> if employees (or their spouses) need to travel out of state for an abortion procedure. <a href=\"https://www.theverge.com/2021/9/12/22669774/salesforce-relocate-employees-abortion-access-benioff-texas-sb8\">Salesforce also offered to help employees relocate</a> if they’re concerned about abortion access in their state, while the Texas-based <a href=\"https://gizmodo.com/bumble-and-match-have-created-a-relief-fund-to-help-cov-1847613072\">Bumble and Match Group created a relief fund</a> for women affected by Texas’ anti-abortion law.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QLNQrcZS20Q8qHZNKuBCHqPJlXo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13175211/acastro_180927_1777_uber_0001.jpg",
  "description": "Oklahoma’s governor is expected to sign off on the bill soon.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}