{
  "title": "Uber CEO vows to be ‘hardcore about costs,’ slow down hiring in memo to employees",
  "url": "https://www.theverge.com/2022/5/9/23063499/uber-ceo-slash-costs-hiring-slowdown-ride-hailing-profit",
  "date": "2022-05-09T15:03:12.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1cliI31uGnToOfpY0lxhIiMO9EA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70848451/pcheung180509_2560_0010.0.jpg\" />        <figcaption>Photo by Philip Cheung for The Verge</figcaption>    </figure>  <p id=\"322Yju\">Uber CEO Dara Khosrowshahi vowed to rein in costs at the ride-hailing company in the face of a “seismic shift” in the financial market, according to a memo sent to employees that was <a href=\"https://www.cnbc.com/2022/05/09/uber-to-cut-down-on-costs-treat-hiring-as-a-privilege-ceo-email.html?utm_term=Autofeed&amp;utm_medium=Social&amp;utm_content=Main&amp;utm_source=Twitter#Echobox=1652080931\">first reported by <em>CNBC</em></a>. </p><p id=\"sKfGFc\">The effort to reduce spending is in response to the dramatic upheaval in the labor market that has Uber scrambling to find drivers to meet growing demand. Khosrowshahi said that, moving forward, the company will treat corporate hiring as a “privilege,” suggesting that Uber may be looking to freeze or even reduce its staff numbers as it aims to become a leaner operation. </p><p id=\"GSiWkY\">Uber is the latest company to commit to a hiring slowdown as the labor market tightens and tech stocks in particular have plunged sharply from their heights at the beginning of the COVID-19 pandemic. Meta, the parent company of Facebook, also said it would slow down the pace of hiring for mid-level positions. </p><div class=\"c-float-right\"><aside id=\"hLu9NV\"><q>Uber is the latest company to commit to a hiring slowdown as the labor market tightens</q></aside></div><p id=\"DzPgjh\">Uber will now focus on achieving profitability on a free cash flow basis rather than adjusted earnings before interest, taxes, depreciation, and amortization, Khosrowshahi said, noting that is what the company’s investors now expect.</p><p id=\"SaRXNp\">Uber has long been criticized based on the way it calculates its adjusted profits. The company’s definition of EBITDA includes an unusually large list of exclusions and is widely seen as an inaccurate measure of the company’s overall profitability. The company’s stock price is down more than 40 percent year-to-date. </p><p id=\"TSguus\">“Meeting the moment means making trade offs,” Khosrowshahi wrote. “The hurdle rate for our investments has gotten higher. And that means that some initiatives what that requires substantial capital will be slowed. We have to make sure our unit economics work before we go big.” </p><p id=\"9qFjpQ\">He continues, “The least efficient marketing and incentive spend will be pulled back. We will treat hiring as a privilege and be deliberate about when and where we add headcount. We will be even more hardcore about costs across the board.”</p><p id=\"fn5DmQ\">An Uber spokesperson confirmed the authenticity of the memo but declined to comment on its contents. </p><p id=\"EvII24\">In its first-quarter earnings last week, Uber reported a $5.9 billion loss, which it said was largely due to equity investments in other mobility companies, like Grab, Aurora, and Didi. The company says it expects to post “meaningful positive cash flows” for the full-year 2022, which would be a first. </p><p id=\"I9Rr94\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/kxj6pJ359v2egVLP8x8dUpHIBh0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10814469/pcheung180509_2560_0010.jpg",
  "description": "Uber is the latest company to commit to a hiring slowdown.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}