{
  "title": "Uber, Amtrak, airlines drop mask requirements after judge strikes down rule",
  "url": "https://www.theverge.com/2022/4/19/23031870/mask-rule-transportation-airlines-trains-uber-cdc",
  "date": "2022-04-19T14:21:16.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"Philadelphia To Bring Back Indoor Mask Mandate Next Week\" src=\"https://cdn.vox-cdn.com/thumbor/W7sG846vNIoU2SA5gg4FG5ch-Sc=/0x0:4349x2899/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70766512/1391632725.0.jpg\" />        <figcaption>Photo by Spencer Platt/Getty Images</figcaption>    </figure>  <p id=\"94PsyS\">A number of transportation providers, including Uber, Amtrak, and all three major airlines, said they wouldn’t require employees or customers to wear masks anymore after a federal judge <a href=\"https://www.theverge.com/2022/4/18/23030626/mask-mandate-transportation-unlawful-judge\">struck down the Biden administration’s mask mandate</a>. </p><p id=\"i9fH64\">On Monday, US District Judge Kathryn Kimball Mizelle ruled that the Centers for Disease Control and Prevention does not have the authority to introduce a mask mandate and did not follow the proper rules to implement a mandate. The Biden administration said it was weighing whether to appeal the ruling. (The mask mandate for air travel and public transportation was set to expire April 18th but was recently extended to May 3rd.)</p><div class=\"c-float-right\"><aside id=\"1CMkqk\"><q>many private transportation providers aren’t waiting for the White House’s response</q></aside></div><p id=\"g55Jno\">But many private transportation providers aren’t waiting for the White House’s response. Uber sent out a notice to riders and drivers in the US that while masks would no longer be required, they were still recommended. Riders will also be allowed to use the front passenger seat for the <a href=\"https://www.theverge.com/2020/5/13/21257432/uber-face-mask-driver-rider-require-selfies-maximum-passengers\">first time since the start of the pandemic</a>. Lyft also <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.lyft.com%2Fblog%2Fposts%2Fupdate-to-lyfts-health-safety-guidelines&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F4%2F19%2F23031870%2Fmask-rule-transportation-airlines-trains-uber-cdc\" rel=\"sponsored nofollow noopener\" target=\"_blank\">will be making masking optional. </a></p><div id=\"6tJDJl\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You can now ride without a mask and use the front seat if you need to. While mask usage is still recommended, we’ve updated our Covid Safety policies. Let’s move forward, safely together.<br><br>For US riders only. <a href=\"https://t.co/LgHYSsC4Bg\">pic.twitter.com/LgHYSsC4Bg</a></p>— Uber (@Uber) <a href=\"https://twitter.com/Uber/status/1516396200374722561?ref_src=twsrc%5Etfw\">April 19, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"F1Vy3t\">The Transportation Security Administration, in response to the federal judge’s ruling, said it would no longer enforce the mask mandate for air travelers. Almost immediately, the three major air carriers — Delta Airlines, American Airlines, and United Airlines — lifted their own rules requiring masks to be worn during domestic flights. Masks may still be required for some international flights or when flying in and out of certain localities, the airlines said. </p><p id=\"dui7os\">A spokesperson for Amtrak said that while passengers and employees “are no longer required to wear masks while on board trains or in stations, masks are welcome and remain an important preventive measure against COVID-19. Anyone needing or choosing to wear one is encouraged to do so.”</p><div class=\"c-float-right\"><aside id=\"GwTQQ8\"><q>But some transit agencies are not being so quick to respond</q></aside></div><p id=\"vHlctC\">But some transit agencies are holding firm. The Metropolitan Transportation Authority, which operates subways and buses in New York City, said it would continue to require passengers and employees to wear masks while it reviews its policy. The Los Angeles Metro <a href=\"https://twitter.com/metrolosangeles/status/1516418945900859407\">said the same</a>, noting that it was waiting for further guidance from the federal government. New Jersey Transit, however, said it would <a href=\"https://www.nbcnewyork.com/news/local/mta-amtrak-to-still-require-masks-despite-judge-voiding-cdc-mask-mandate/3650620/\">no longer enforce mask wearing</a> on its trains, as did the Bay Area Rapid Transit agency. </p><p id=\"R1fOMY\">The CDC’s recent extension of the mask mandate came amid a rise in COVID case numbers in some parts of the country, as the BA.2 Omicron subvariant becomes the dominant strain in the US. Throughout the pandemic, public health officials have uniformly recommended the wearing of masks to curb the spread of COVID-19, particularly in crowded, poorly ventilated areas. <a href=\"https://www.cdc.gov/coronavirus/2019-ncov/travelers/face-masks-public-transportation.html\">On its website</a>, the CDC “strongly recommends” wearing masks on transportation to reduce the chance of getting and spreading the virus.</p><p id=\"imhCD8\"><em><strong>Update April 19th, 10:33AM ET: </strong></em><em>Updated to include a statement from the Los Angeles Metro. </em></p><p id=\"RXiOH3\"><em><strong>Update April 19th, 11:01AM ET: </strong></em><em>Update to include a statement from Lyft. </em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ILxcaZ44EBwLhR6qlmJAMi1c7ig=/0x312:4349x2589/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23399973/1391632725.jpg",
  "description": "Masks are still recommended for many passengers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}