{
  "title": "Uber Eats brings bill splitting to deliveries",
  "url": "https://www.theverge.com/2022/3/9/22969561/uber-eats-bill-splitting-deliveries-takeout",
  "date": "2022-03-09T22:43:08.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Uber Technologies App Illustrations Ahead Of Earnings\" src=\"https://cdn.vox-cdn.com/thumbor/U9MrRf1vqqVR7EOWfaenmsXNfSM=/0x3:4000x2670/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70601592/1231061423.0.jpg\" />    </figure>  <p id=\"izRGSh\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.uber.com%2Fnewsroom%2Fbill-splitting%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F9%2F22969561%2Fuber-eats-bill-splitting-deliveries-takeout\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Uber Eats is getting a group order and bill splitting feature</a> that should make it easier to ensure your friends and family members are picking up their share of the tab. </p><p id=\"y08g7K\">Instead of passing your phone around to everyone in the group so they can place their orders, you’ll now be able to start a group order from within the Uber Eats app. To do this, you’ll have to navigate to the restaurant you want to order from, hit the three dots in the top-right corner of the page, and then hit “group order.”</p><p id=\"vwQwZp\">From there, you can invite group members by selecting from your phone’s contacts; they’ll each receive an order link over text message (and will have to download the app if they haven’t already). Your guests can then choose and pay for the food that they want. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/mkqpKmWqfCwEqaOq9edi654EsPQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23302344/ubereats_group_orders.jpg\">      <cite>Image by Uber</cite>      <figcaption>Uber Eats’ group order feature lets your guests place orders separately on their own devices.</figcaption>  </figure><p id=\"HX1xJa\">But if you’re feeling extra generous, Uber Eats gives you the option to foot the entire bill while also letting you set spending limits to deter anyone from ordering the most expensive item on the menu. Whether you pay for or split the bill, Uber says all the food will get delivered at the same time.</p><p id=\"T9ldA0\">And if you’re planning some type of get-together, Uber also gives you the option to create group orders up to seven days before the planned event. People can pick their food within a specific window of time, and Uber will notify them in case they forget.</p><p id=\"KuG8IE\">As someone who orders from Uber Eats a ton — and also ends up picking up the tab most of the time — I can say that the bill splitting feature is a welcome addition. It eliminates every possible excuse in the book, ranging from “I’ll pay you back tomorrow” to “I don’t have Venmo,” and also means you don’t have to awkwardly nudge people to get them to repay you.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/PEh4W9M9TDPfSWmRN8t-flT5VPk=/0x576:4000x2670/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23302078/1231061423.jpg",
  "description": "Uber Eats now lets you place group orders and split the bill.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}