{
  "title": "Uber and Lyft are taking on healthcare, and drivers are just along for the ride",
  "url": "https://www.theverge.com/2022/2/17/22937849/uber-lyft-health-transport-safety",
  "date": "2022-02-17T15:00:00.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/R2xKDxDUbQPebJ1iwDJrnhnNLsQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70520556/acastro_220210_5011_0001.0.jpg\" />    </figure>  <p>Experts worry that rideshare drivers aren’t prepared</p> <p class=\"p--has-dropcap p-large-text\" id=\"yQUw4s\">Within the first week that Austin Correll was driving for Lyft in the fall of 2021, he was sent to pick up passengers at an address that turned out to be for a hospital. When he pulled up to the curb, he found an elderly woman in a wheelchair and another other with a walker, waiting for him — flanked by four or five nurses.</p><p id=\"VmHtwO\">He got out and talked to the nurses, who told him that the woman in the wheelchair had just had heart surgery and needed to go to assisted living. The woman with the walker was her daughter, and she also appeared to have some health problems, Correll says. </p><p id=\"HbeRR4\">Correll, who said he started working for Lyft for a few months while he waited for the results of his bar exam, doesn’t have any medical training. He told <em>The Verge</em> he immediately felt unprepared for the responsibility of transporting these two women, who were supposed to go to a motel around two hours away. When the nurses then told him that, on arrival at the motel, he should call an ambulance to help move the passengers into their room, he grew even more uneasy. </p><p id=\"ZenryL\">“The biggest thing I was worried about was, what if there was a medical emergency? This isn’t somebody who got their arm broken, got a cast, and needed to get home,” Correll says. “These are two people with severe medical issues.” </p><div class=\"c-float-right c-float-hang\"><aside id=\"HEDXmO\"><q>“These are two people with severe medical issues”</q></aside></div><p id=\"FL4q1o\">When they got to the motel, Correll decided he didn’t want to call the ambulance. Instead, as carefully as possible, he helped both women out of his truck and into their hotel room. After the ride was over, he reached out to Lyft to ask how he got put in this situation. The company wasn’t much help, he says. Lyft did not respond to a request for comment on this specific situation. </p><p id=\"mZwGQq\">Correll is now working as a lawyer. But if he had kept driving, he might have run into more situations like this one. That’s because, for the past few years, rideshare companies Lyft and Uber have been moving into the non-emergency medical transportation (NEMT) business, offering their networks to healthcare organizations that need to schedule rides for patients. Correll isn’t sure if his ride was through a formal NEMT program, but it could have been: to protect patient privacy, drivers aren’t told if their rides are from healthcare partnerships or not. </p><p id=\"9mxxfa\">NEMT is used as a way to help low-income patients and Medicaid recipients get to appointments they might otherwise miss because they lack access to transportation. The need for such services is significant: millions of people in the United States, mostly low income, miss doctors’ appointments each year because of transportation barriers, costing the health system billions of dollars. But while NEMT is often done through dedicated companies, rideshare groups are now interested in what’s estimated to be a <a href=\"https://www.kff.org/medicaid/issue-brief/medicaid-non-emergency-medical-transportation-overview-and-key-issues-in-medicaid-expansion-waivers/\">$3 billion market</a>.</p><p id=\"Nyj3Zf\">Rideshare is a cheaper alternative for healthcare organizations, and some experts think it has the potential to fill gaps in what NEMT services are able to offer. But research so far hasn’t borne that out, and clinicians say they worry that Uber and Lyft drivers aren’t adequately trained to safely transport the types of passengers who typically use NEMT. </p><p id=\"Ubm8rg\">“It has the benefits of flexibility,” says Yochai Eisenberg, an assistant professor of disability and human development at the University of Illinois Hospital &amp; Health Sciences System. “It can save money, and it’s less costly than a lot of the existing infrastructure. But the lower cost is taking away in some way from the quality that traditional transportation companies can provide.”</p><h3 id=\"Ko4XEx\"><strong>A healthcare gap</strong></h3><p id=\"HKXrbc\">Lyft was the first rideshare company to launch an NEMT program. <a href=\"https://money.cnn.com/2016/01/12/technology/lyft-medical-rides-health-care/\">In 2016,</a> it started offering healthcare organizations the ability to book rides for patients through its platform. In April 2021, the company launched the <a href=\"https://www.theverge.com/2021/4/15/22383498/lyft-health-care-rides-doctor\">Lyft Pass for Healthcare</a> program, which lets organizations cover the cost of rides that patients book themselves. Uber launched its NEMT program <a href=\"https://www.theverge.com/2018/3/1/17061862/uber-health-non-emergency-medical-transportation-hipaa\">in 2018</a>. </p><p id=\"ToemSF\">Both companies have expanded their partnerships with the healthcare sector over the past few years. Uber and Lyft now have their systems built into some <a href=\"https://www.healthcaredive.com/news/lyft-integrates-with-epic-exponentially-growing-nemt-reach/586420/\">electronic health</a> <a href=\"https://www.fiercehealthcare.com/tech/uber-announces-integration-cerner-ehr-system-for-u-s-providers\">record platforms</a>, so doctors can schedule directly through a patient’s medical record. They also have specialized programs available in some cities, called Lyft Assisted and Uber Assist, where drivers provide light physical assistance walking riders door to door rather than just taking passengers curb to curb. While Lyft and Uber consider their assisted services to be separate from their NEMT programs, there’s some overlap: healthcare organizations partnering with Lyft for NEMT can schedule Lyft Assisted rides for patients, and Uber’s NEMT program pulls from the general driver pool, which includes Uber Assist drivers.  </p><p id=\"yBOnFv\">Uber said in a <a href=\"https://www.globenewswire.com/en/news-release/2022/01/25/2372654/0/en/Uber-Health-Hires-First-Chief-Medical-Officer.html\">public statement</a> in January that it has over 3,000 healthcare customers and that it saw over 70 percent growth in bookings for its health services between late 2020 and late 2021. Lyft did not respond to a question about the number of bookings through its health program. </p><div class=\"c-float-left c-float-hang\"><aside id=\"LrT2mI\"><q>Uber and Lyft seem to be attempting to position themselves as healthcare companies</q></aside></div><p id=\"05GbB6\">With these new programs and expanded services, Uber and Lyft seem to be attempting to position themselves as healthcare companies. Uber just hired its first chief medical officer, geriatrician Michael Cantor. Lyft’s new head of healthcare, Buck Poropatich, comes from a healthcare strategy and business background. He told <em>The Verge </em>in an interview that if someone asked him if he worked for a healthcare company, he’d say yes. </p><p id=\"cNMtNb\">Lyft and Uber say that they want to augment and improve on today’s NEMT services, which are covered by <a href=\"https://www.kff.org/medicaid/issue-brief/medicaid-non-emergency-medical-transportation-overview-and-key-issues-in-medicaid-expansion-waivers/\">state Medicaid programs</a> and some <a href=\"https://www.mtm-inc.net/medicare-advantage-nemt-set-plan-apart/\">Medicare programs</a>. Typical NEMT rides are more expensive than rideshare, and they are usually handled by companies that employ drivers trained to transport people with medical conditions. Health rides through rideshare companies are done by contractors who drive for the technology platforms and who get limited training — if they decide to participate in physical assistance programs — or no training at all. </p><p id=\"Brr65f\">While less driver training is a downside, rideshare can be more flexible, says Krisda Chaiyachati, an assistant professor of medicine at the Hospital of the University of Pennsylvania. Traditional NEMT companies have to be booked in advance, and patients get a wide window where they can be picked up. Sometimes, these rides aren’t reliable. </p><p id=\"OtFhMx\">“It wasn’t just that the rides didn’t show,” Chaiyachati says. Even if people made it to appointments on time, the doctor might run late, and a patient would miss their ride home.  </p><p id=\"9DX4wf\">These are problems rideshare companies say they can help solve. With Lyft or Uber, people can order rides on demand instead of having a pickup window, and they can call a ride back home even if their appointment runs late.</p><div class=\"c-float-right c-float-hang\"><aside id=\"qXueGt\"><q>These are problems rideshare companies say they can help solve.</q></aside></div><p id=\"0TNrMX\">Rideshare programs have had some successes. Some individual health systems report <a href=\"https://www.healthaffairs.org/do/10.1377/forefront.20180907.685440/full/\">good results</a> switching to rideshare for their NEMT programs. They’ve found more on-time rides, shorter wait times, and high patient satisfaction. Notably, rideshare programs are also much <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6366524/\">cheaper</a> and lead to <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2547765\">cost savings</a> for health systems and insurers (rides are subsidized by the <a href=\"https://www.theverge.com/2019/5/10/18564197/uber-ipo-stock-valuation-pricing-fares-drivers-public-market\">companies</a>, making for a cheaper product even as the business <a href=\"https://www.theverge.com/2021/2/11/22277043/uber-lyft-earnings-q4-2020-profit-loss-covid\">is unprofitable</a>). </p><p id=\"bGBnUK\">But the handful of more rigorously designed studies that look at the top-line problem facing NEMT — high rates of missed appointments — haven’t found as much benefit of rideshare. Chaiyachati ran <a href=\"https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2671405\">a study</a> in West Philadelphia in 2016 and 2017 that found people offered Lyft rides weren’t any more likely to make it to their appointments than people who weren’t given rides. <a href=\"https://www.ajmc.com/view/rideshare-transportation-to-health-care-evidence-from-a-medicaid-implementation\">Another study</a>, published in 2020, found that Medicaid enrollees had similar ride experiences with rideshare and non-rideshare NEMTs, but that people who had more rideshare rides had a greater odds of failed pickups. (Lyft published a letter <a href=\"https://www.ajmc.com/view/industry-informed-perspectives-on-the-benefits-of-rideshare-based-medical-transportation\">pushing back on that study</a>, criticizing its methodology.) </p><p id=\"816Qkt\">“On the one hand, this shows that [rideshare] is just as good as the traditional way” in terms of patient experience, says Eisenberg, an author on the 2020 study. “It’s saving time and money, it has flexibility, and the satisfaction remains the same. That’s OK — it doesn’t have to be better.” </p><p id=\"OgdpzC\">But on the other hand, he notes, higher failed pickup rates are a concern. More research is needed to get a good understanding of the role rideshare can play in NEMT, Eisenberg says. It’s hard to do rigorous research, though, because the rideshare companies, like <a href=\"https://www.theverge.com/2021/12/6/22820675/open-letter-meta-mental-health-research\">most</a> <a href=\"https://www.theverge.com/2021/6/3/22514951/pandemic-public-health-solutions-google-apple-facebook\">technology</a> <a href=\"https://www.theverge.com/2021/7/27/22594178/apple-watch-data-research-heart-rate-reliability\">companies</a>, are reluctant to share their own data. </p><p id=\"Mp7R1B\">The studies done so far show that improving health access isn’t as simple as just using an algorithm to book people rides, Chaiyachati says. In his study, people said they missed appointments because they wanted to ride with a friend or family member who ended up not being available or because they didn’t think the appointment was important. Transportation, he says, is necessary for good care, but if rideshare companies want to solve healthcare problems, they have to offer more than the blunt instrument of an available car. The car needs to be accompanied by a more robust understanding of what people’s barriers to care are and a way to identify the subset of people where access to a more flexible and on-time ride is what’s needed to help them make it to their doctor’s appointments. </p><div class=\"c-float-left c-float-hang\"><aside id=\"hwKjxH\"><q>if rideshare companies want to solve healthcare problems, they have to offer more than the blunt instrument of an available car</q></aside></div><p id=\"LOD668\">“If our goal was to reach towards equity and access, there are many other layers that need to be built into that,” Chaiyachati says.</p><h3 id=\"qgXyAx\"><strong>Vulnerable populations</strong></h3><p id=\"rRPPUa\">Tim, who drives for Lyft in Baltimore, used to work for a company that specializes in driving people with disabilities. Before driving for that company, he was trained in how to assist people with disabilities, how to secure wheelchairs and scooters, and how to perform CPR, he told <em>The Verge </em>over Reddit chat.  </p><p id=\"apjFie\">Tim, who <em>The Verge </em>is referring to by his first name only because he still drives for Lyft, says he has concerns about Lyft’s healthcare programs, particularly the Lyft Assisted program, which lets drivers give rides to people who need light physical assistance after taking an online training course. At his previous company, he had in-depth training, knew that his passengers had medical issues, and had a support system in place that could come and help him out if a rider needed extra assistance. </p><p id=\"cOgJHn\">That’s not always the case with rideshare services. And riders he drove through the disability company often needed more help than was initially indicated, Tim says. “Some are very frail and can’t handle a lot of bumpy roads. We constantly had to adjust our routes to accommodate,” he says. </p><p id=\"o7nN41\">Drivers who do not sign up for Lyft and Uber’s assisted programs can be sent NEMT rides without any training. Drivers who want to participate in the assisted programs are required to take tutorials created by the Open Doors Organization (ODO), a non-profit organization that aims to “teach businesses how to succeed in the disability market.” Uber’s program includes disability awareness training and information on how to stow assistive devices like walkers, says Katy O’Reilly, program manager at ODO. They don’t include medical or emergency information, she says: “I’d say it’s more just about customer service.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"YVR3FL\"><q>“I’d say it’s more just about customer service”</q></aside></div><p id=\"dGfSlp\">Lyft’s tutorial provides more information, developed in partnership with occupational therapists, on how to safely walk with older or frail riders, O’Reilly says. It includes details about where the riders’ hands and feet should go while getting into a car and how to walk with someone who is blind, she says. </p><p id=\"FHHWsF\">The Lyft Assist program is entirely online. Uber’s program used to have an in-person component, but O’Reilly says it “wasn’t really scalable,” and so now, everything is online. Drivers in Uber’s WAV program (for wheelchair-accessible vehicles) still go through in-person training to learn how to secure a wheelchair in a vehicle.</p><p id=\"IaksqG\">“You can’t just do something like that online,” O’Reilly says. </p><p id=\"FjR1tg\">Experts who work in NEMT training don’t think an online tutorial would be sufficient to make sure drivers can safely handle people who need physical assistance. The Community Transportation Association of America (CTAA), which offers an NEMT driver training program with hands-on components, trains drivers on specific medical conditions, teaches them methods for securing wheelchairs, and other skills. Online tutorials or classroom training can provide some of that information, says Scott Bogren, the executive director of CTAA. “But we recommend as well that they do a demonstration with some of our trainers where they’re coached,” he says.  </p><p id=\"ZbOE1M\">Eisenberg, the professor of disability and human development, says he would also want to see a hands-on component that involves working with people in need of assistance. “That’s the best practice,” he says.</p><p id=\"jKY8A8\">The University of Pennsylvania’s Chaiyachati says he thinks online training could be enough, but only if drivers had resources available if they ended up in a situation that they didn’t feel would be safe for them or for the patient — like if there was a flight of stairs and a patient with a walker who they didn’t think they could safely assist. “I’m comfortable with that level of training as long as… they can call in the cavalry,” Chaiyachati says. </p><div class=\"c-float-left c-float-hang\"><aside id=\"kHfUBE\"><q>“I’m comfortable with that level of training as long as… they can call in the cavalry”</q></aside></div><p id=\"IbDhyd\">In an emailed statement to <em>The Verge</em>, Lyft’s Poropatich said that medical providers who partner with Lyft are responsible for making sure patients are able to use rideshare services. Lyft Assisted drivers do not lift riders in and out of cars or provide medical assistance, and Lyft Healthcare should not be used for people who have “medical needs,” he said. In an interview, he said Lyft aims to handle non-emergency transport for riders with fewer needs so that traditional medical transport groups could focus on rides “at the top of their license.” </p><p id=\"zqSMqP\">Uber spokesperson Noah Edwardsen said in a statement that healthcare organizations select the transportation that meets individual patient needs. </p><p id=\"kReVNc\">But the experience of Correll, the lawyer who worked for Lyft, shows that if drivers <em>are</em> called for people with more extensive medical needs, there isn’t necessarily a high level of support or backstop. He didn’t have any information about how to handle two elderly and frail women as a standard Lyft driver. Even if he’d gone through the Assisted tutorial, he still wouldn’t have specific information about medical issues or be expected to handle their more extensive physical needs. But he says he didn’t have anywhere to turn, and he didn’t want to leave the women stranded. </p><p id=\"he08ip\">Poropatich said in an interview with <em>The Verge</em> that there aren’t different protocols for a medical emergency or concerning situation on an NEMT ride than for any other ride. For privacy reasons, drivers aren’t even told if it’s an NEMT ride or not, he says. Edwardsen also said that Uber drivers do not see any difference between ride requests from Uber Health customers and regular rides. </p><p id=\"DqxPYa\">That on its own is a safety risk, Bogren says. NEMT drivers should know if a rider has a medical condition so that they know what to do if something goes wrong. Even something that seems low-risk and non-emergency, like driving a kidney patient to and from a dialysis appointment, can have risks. If a patient starts to bleed from the incision where the dialysis is being performed — as sometimes happens — Bogren says trained NEMT drivers know to reroute patients to the emergency room. “You’ve got to match up skill sets with passengers,” he says. </p><div class=\"c-float-right c-float-hang\"><aside id=\"PKswOo\"><q>NEMT drivers should know if a rider has a medical condition so that they know what to do if something goes wrong</q></aside></div><p id=\"KlknsI\">Bogren thinks there can be a role for rideshare companies like Lyft and Uber to help fill in gaps in the NEMT system, such as when patients are discharged from the hospital in the middle of the night and flexibility with rides might be helpful. And the companies’ technology could help some of the logistical problems in the NEMT space.</p><p id=\"w1M1O5\">But if companies like Uber and Lyft want to be healthcare companies, they have to take on the burden of safety and care that healthcare requires. Bogren says his company has offered to work with Uber and Lyft, but they haven’t yet taken him up on that offer. </p><p id=\"GhEjmc\">So, for now, the rideshare NEMT programs are left with mostly-untrained drivers who aren’t given a heads up that they might be on their way to someone with a medical problem when they accept a ride. Correll knows that there need to be transportation options for people without the resources to get themselves to appointments. But he thinks rideshare NEMT programs, as currently structured, are doing a disservice to vulnerable people who need support. </p><p class=\"c-end-para\" id=\"JhbWXS\">“There’s nothing about my experience and what I know about Lyft that makes me think that this is a safe thing for Lyft drivers or for patients,” he says.</p><p id=\"M65t40\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/hVyMemt4Z6ZzivQVU5B_IeX4FBw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23250519/acastro_220210_5011_0001.jpg",
  "description": "Drivers don’t know when they’re assigned health rides.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}