{
  "title": "Uber’s annual product event will focus on travel, sustainability ",
  "url": "https://www.theverge.com/2022/3/31/23005307/uber-go-get-2022-product-event-date",
  "date": "2022-03-31T20:52:27.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"The Uber logo against a dark background.\" src=\"https://cdn.vox-cdn.com/thumbor/7KGtcK_OSJsCARgpwFJDRpj4Mbo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70695682/acastro_180927_1777_uber_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"wgGvJY\">Uber will hold its annual product event on May 16th, during which the company will showcase new products, updates, and features focused on travel and sustainability. </p><p id=\"pXIVDP\">It will be Uber’s second product event, after last year’s “Go/Get 2021” gathering presented a host of pandemic-themed announcements, including the <a href=\"https://www.theverge.com/2021/4/28/22406197/uber-vaccine-appointment-schedule-app\">ability to book a vaccine appointment in the Uber app</a>. Other features included car rentals, 30-day windows for trip reservations, and multi-stop rides. </p><p id=\"SfODZP\">“We are excited to introduce our latest innovations at Go/Get 2022,” said Uber’s chief product officer, Sundeep Jain, in a statement. “As the world keeps changing, the Uber team keeps building products to serve consumers’ changing needs. We can’t wait to share what’s next.”</p><div class=\"c-float-right\"><aside id=\"92SgPJ\"><q>“We are excited to introduce our latest innovations at Go/Get 2022”</q></aside></div><p id=\"osGv2g\">This year’s event will focus on travel (<a href=\"https://www.theverge.com/2021/10/6/22710870/uber-airport-reserve-advanced-booking-flight-tracking\">airport trips</a> are Uber’s bread and butter) and sustainability. Last year, <a href=\"https://www.theverge.com/2021/10/27/22747184/uber-tesla-rent-drivers-hertz-cost-2023\">Uber acquired 50,000 Tesla vehicles</a> to rent to its drivers as part of an ambitious plan to <a href=\"https://www.theverge.com/2020/9/8/21427196/uber-promise-100-percent-electric-vehicle-ev-2030\">electrify its fleet in the US by 2030</a>. </p><p id=\"mjdvWM\">The product event comes as car companies and transportation providers around the world are coming under regulatory pressure to phase out gas-powered vehicles in favor of those that produce zero emissions. California, the largest auto market in the US, set in place rules for ride-hailing companies like Uber and Lyft, requiring that 90 percent of their fleets be electric by 2030.</p><p id=\"yatRI6\">Delivery is likely to feature heavily in the announcements as well. While Uber’s ride-hailing business has struggled to recover after the pandemic lockdowns of 2020, Uber Eats has been growing at a rapid clip. Food and other delivery bookings in the <a href=\"https://www.theverge.com/2022/2/11/22929555/uber-lyft-2021-q4-earnings-delivery-bikeshare\">fourth quarter of 2021</a> grew 33 percent year over year. The company’s CEO, Dara Khosrowshahi, recently told investors that Uber’s delivery business reported its first quarterly profit, including delivery in the US, and that “Uber Eats became the fastest-growing delivery player in America.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HHiAGb2BBAeewprURfm0DeM1d6k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13175209/acastro_180927_1777_uber_0002.jpg",
  "description": "Announcements related to travel and sustainability",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}