{
  "title": "Ubisoft’s troubled Prince of Persia remake moved to a new studio, delayed further",
  "url": "https://www.theverge.com/2022/5/3/23055673/ubisoft-prince-persia-remastered-pune-mumbai-montreal",
  "date": "2022-05-07T16:43:21.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OTN6JmId7EjjD8uhwAqkX52zWPM=/300x0:3540x2160/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70828823/PoP_SoT_KEYART_Wide.0.jpg\" />    </figure>  <p id=\"Bz4k6a\">After an indefinite delay and months without an update, Ubisoft has announced that it’s moving the development of its highly anticipated <em>Prince of Persia: The Sands of Time</em> remake to its studio located in Montréal, Canada. Ubisoft also confirmed to <em>The Verge </em>that it’s no longer targeting a release in the 2023 fiscal year, which runs until March 31st, 2023 in Canada. The game has been in the works at Ubisoft’s India-based Mumbai and Pune studios since 2020. </p><p id=\"iStatr\">“The development of Prince of Persia: the Sands of Time Remake will now be led by Ubisoft Montréal, the very birth place of the epic Sands of Time trilogy,” Ubisoft’s initial <a href=\"https://twitter.com/princeofpersia/status/1521519964074749954\">announcement on Twitter</a> reads. “This decision is an important step and the team, building on the work achieved by Ubisoft Pune and Ubisoft Mumbai, will now take the time they need to regroup on the scope of the game to deliver the best experience for this remake of an all-time classic, when it’s ready.”</p><div id=\"TBHGX2\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">An update on the development of Prince of Persia: The Sands of Time Remake <a href=\"https://t.co/8xQpqyPSwQ\">pic.twitter.com/8xQpqyPSwQ</a></p>— Prince of Persia (@princeofpersia) <a href=\"https://twitter.com/princeofpersia/status/1521519964074749954?ref_src=twsrc%5Etfw\">May 3, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"BmJbKh\">Outside of assisting with games like <em>Just Dance</em> and <em>Steep</em>, <em>The Sands of Time</em> remake marks the first major title Ubisoft Mumbai and Pune studios have led development on. Ubisoft didn’t expand on what prompted it to swap studios.</p><p id=\"8pkW1T\">“We’re proud of the work achieved by Ubisoft Pune and Ubisoft Mumbai, and Ubisoft Montreal will benefit from their learnings as the new team will continue the work to deliver a great remake,” Ubisoft spokesperson Antoine Leduc-Labelle said in a statement to <em>The Verge</em>. “As such, we are no longer targeting a FY23 release anymore. Players will be updated on the project as the development is moving along.”</p><p id=\"kDiy1p\"><em>The Sands of Time </em>remake is notably supposed to be a remastering of the game — not just a reskin — built off of Ubisoft’s AnvilNext engine. It was <a href=\"https://www.theverge.com/2020/9/10/21429389/prince-of-persia-the-sands-of-time-remake-xbox-one-ps4-announcement-ubisoft\">initially slated for release in January</a> 2021 on the Xbox One, PlayStation 4, and PC. There’s still no word on optimization for the Series X / S or PS5. </p><p id=\"juVEZT\">Pandemic-related issues caused Ubisoft to push <em>The Sands of Time</em>’s release date back <a href=\"https://www.polygon.com/2020/12/8/22163944/prince-of-persia-sands-of-time-remake-release-date-ps4-xbox-one-pc\">by a couple of months</a> until it later made the decision to <a href=\"https://www.theverge.com/2021/2/5/22268455/prince-of-persia-the-sands-of-time-remake-delayed-indefinitely\">delay the game’s release indefinitely</a>. <a href=\"https://twitter.com/princeofpersia/status/1453749652608667649\">Ubisoft’s last update</a> about the game came in October of last year, which just reassured fans that developers were still working on the game.</p><p id=\"reqp9f\"><em><strong>Update May 7th, 12:42PM ET:</strong></em><em> This post has been updated to reflect that Ubisoft has delayed </em>The Sands of Time<em> remake until after the end of the 2023 fiscal year. A statement from an Ubisoft spokesperson has also been added.</em></p><p id=\"Ag1l9q\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Z-jUsOMYFGPYcPhxd2_4m4VzWGE=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21870143/PoP_SoT_KEYART_Wide.jpg",
  "description": "Ubisoft Montréal is taking over the project.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}