{
  "title": "Ubisoft axes online support for 91 games",
  "url": "https://www.theverge.com/2022/4/27/23044852/ubisoft-games-online-support-disabled",
  "date": "2022-04-27T21:50:10.000Z",
  "author": "Alice Newcome-Beill",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/H6y_ynHoP2PGX8riiTBpn9i0Qlk=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70802039/acastro_190528_1777_ubisoft_0001.0.0.jpg\" />        <figcaption><em>91 games and counting...</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"gW84Ph\">In the past year, Ubisoft has ceased online support for a list of games <a href=\"https://ubisoft.pxf.io/c/482924/864200/12050?u=https%3A%2F%2Fwww.ubisoft.com%2Fen-us%2Fhelp%2Farticle%2Fmultiplayer-and-online-services-availability-in-ubisoft-games%2F000064576&amp;sharedid=theverge.com\" rel=\"sponsored nofollow noopener\" target=\"_blank\">that has grown to 91 titles</a>. This means that any multiplayer components associated with these games will no longer be accessible, along with any achievements or unlockables attached to the online aspect of the game. It’s worth mentioning, however, that the support for these games wasn’t cut off all at once and doesn’t necessarily impact all platforms. </p><p id=\"Q0aRNd\">Many of the titles are remarkably old and no longer playable on modern hardware, with some reaching back to the Wii era. However, at the risk of aging myself, a good portion of the list reads like a rap sheet of my wasted hours in college. Some of the standouts include <em>Tom Clancy’s Endwar</em>, <em>Splinter Cell</em>, and <em>World in Conflict</em>. Even some staples of the 360 and PS3 generation are gone as well, like <em>Ghost Recon Advanced Warfighter 2</em>, <em>H.A.W.X. 2</em>, and <em>Beyond Good and Evil</em>. </p><p id=\"xhqLVA\">This wouldn’t feel like such a big deal, except that this is effectively destroying large parts of gaming history. As <a href=\"https://kotaku.com/12-games-killed-in-2021-that-prove-preservation-is-vita-1848230336\">this article by Jeremy Winslow of <em>Kotaku</em></a> pointed out, games with large online components often get lost in the sands of time when publishers decide to no longer support them, especially when they’re so hesitant to allow communities access to the tools to keep them alive. </p><p id=\"5d6l2E\">It’s understandable that a company can’t be expected to keep a game on life support forever, but some of these games represent some significant accomplishments on behalf of the people developing them. To have those assets erased forever seems like a net loss for gaming history. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6sRQAWUlL7gdQjAj22Cdyjn4Rls=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16309954/acastro_190528_1777_ubisoft_0001.0.jpg",
  "description": "Putting down the Rabbids",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}