{
  "title": "UC Berkeley loses CRISPR patent case",
  "url": "https://www.theverge.com/2022/3/1/22956326/crispr-patent-uc-berkeley-broad-institute-nobel",
  "date": "2022-03-01T17:43:46.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/lZVznYyf_22LiJedgdYbKayrWLo=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70565681/acastro_170726_1777_0013.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"fojJ8I\">MIT and Harvard’s Broad Institute was the first to apply the gene-editing tool CRISPR to human cells, the US Patent and Trademark Office <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.scribd.com%2Fdocument%2F561762623%2F106-115-Decision-on-Priority&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F1%2F22956326%2Fcrispr-patent-uc-berkeley-broad-institute-nobel\" rel=\"sponsored nofollow noopener\" target=\"_blank\">said Monday</a>. The decision stymies years of efforts from the University of California, Berkeley to obtain lucrative patent rights to the technology. UC Berkeley is home to Jennifer Doudna, who won a <a href=\"https://www.nobelprize.org/prizes/chemistry/2020/press-release/\">2020 Nobel Prize</a> with Emmanuelle Charpentier for discovering the CRISPR-Cas9 gene-editing technique. </p><p id=\"9FT8ef\">It also <a href=\"https://www.barrons.com/articles/patent-ruling-gene-editing-crispr-51646142806\">complicates</a> the work of some biotech companies to develop gene-editing therapies based on CRISPR: many, including companies like Caribou Biosciences (co-founded by Doudna) and Intellia Therapeutics, which licensed the CRISPR tech from the UC Berkeley group. </p><p id=\"iaBH6K\">“This decision once again confirmed Broad’s patents were properly issued,” Broad Institute said in a statement. “Broad believes that all institutions should work together to ensure wide, open access to this transformative technology.”</p><p id=\"qCV5fn\">The UC Berkeley group, collectively referred to as CVC, said <a href=\"https://news.berkeley.edu/2022/02/28/u-s-patent-appeal-board-rules-against-university-of-california/\">in a statement</a> that it intends to challenge the decision. The group holds dozens of other CRISPR-related patents. </p><p id=\"IfwPzH\">The decision is likely an end to a <a href=\"https://www.theverge.com/2016/12/6/13857674/crispr-gene-editing-patent-dispute-berkeley-broad-mit-jennifer-doudna-feng-zhang\">long-running fight</a> over ownership of the gene-editing technique, which revolutionized genetic research and biotech. It lets scientists easily and precisely cut and and reorder bits of DNA, changing the way it codes for different functions. Doudna and her colleagues published the first paper on the CRISPR system in 2012, showing how it worked in a test tube. Then, in 2013, researchers at the Broad Institute published a paper on using CRISPR in the types of cells found in animals and people. </p><p id=\"38g9l4\">Both institutions filed for patents, and the US Patent and Trademark Office (PTO) initially awarded CRISPR patents to the Broad Institute in 2014. UC Berkeley contested the decision, and the PTO <a href=\"https://www.theverge.com/2017/2/15/14535032/gene-editing-tool-crispr-broad-mit-ucb-patent-dispute-ruling\">determined</a> in 2017 that the patents from the two institutions were different enough that they could both stand — and that the Broad Institute retained patents, <a href=\"https://www.theverge.com/2017/2/15/14535032/gene-editing-tool-crispr-broad-mit-ucb-patent-dispute-ruling\">potentially worth billions</a>, for the use of CRISPR in complex human and animal cells. UC Berkeley <a href=\"https://www.theverge.com/2017/4/13/15278478/crispr-gene-editing-tool-patent-dispute-appeal-ucb-mit-broad\">appealed</a> to the US Court of Appeals for the Federal Circuit in Washington, DC, and <a href=\"https://www.mercurynews.com/2018/09/10/uc-berkeley-loses-legal-fight-over-crispr-patents/\">lost that appeal</a>. </p><p id=\"4fIXdd\">The ruling Monday was the result of <a href=\"https://www.science.org/content/article/new-crispr-patent-hearing-continues-high-stakes-legal-battle\">another challenge</a> UC Berkeley put before the Patent Trial and Appeal Board in 2019, pitting different CVC patents against the Broad Institute’s patents. Once again, the PTO sided with the Broad Institute. </p><p id=\"FNskme\">Biotech companies that initially licensed technology from CVC will likely have to renegotiate with the Broad Institute. Companies that licensed from the Broad Institute, like genome editing company Editas Medicine, are more secure. “The decision reaffirms the strength of our foundational intellectual property as we continue our work to develop life-changing medicines for people living with serious diseases,” Editas CEO James Mullen said <a href=\"https://ir.editasmedicine.com/news-releases/news-release-details/editas-medicine-announces-favorable-decision-us-patent-and\">in a statement</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6Kkv8b1P0DgN4R3mx4WQ2ek0RpY=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8986109/acastro_170726_1777_0013.jpg",
  "description": "The Broad Institute controls the tech in human cells.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}