{
  "title": "UK politician who tweeted threat to nail journalist’s balls to the floor pushes user IDs to curb online abuse",
  "url": "https://www.theverge.com/2022/2/25/22950506/uk-online-safety-verify-user-id-social-media-nadine-dorries-nail-balls-floor",
  "date": "2022-02-25T15:21:53.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"Boris Johnson Returns To Holding In-Person Cabinet Meeting\" src=\"https://cdn.vox-cdn.com/thumbor/nGppIynnjXHI0YkgRYFy4vqNQHc=/0x2:4769x3181/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70549670/1366748121.0.jpg\" />        <figcaption><em>Nadine Dorries, now UK Secretary of State, has frequently insulted other Twitter users. </em> | Photo by Rob Pinney/Getty Images</figcaption>    </figure>  <p id=\"KhciZI\">The UK says it will force social media companies to <a href=\"https://www.gov.uk/government/news/new-plans-to-protect-people-from-anonymous-trolls-online\">introduce ID verification tools</a> in order to curb online abuse as part of its upcoming Online Safety Bill. </p><p id=\"4GfDD9\">The plans — which are not yet law — would essentially split platforms like Twitter and Facebook into segregated communities, with “verified” individuals able to opt out of all interactions with non-verified users. Critics say the policy will do little to stop online abuse, though, as many trolls are happy to harass people using their own names.</p><p id=\"OSMkC0\">A relevant example of this dynamic has been supplied by the same Tory politician spearheading the new policies: Nadine Dorries, the UK’s Secretary of State. Dorries once threatened a journalist <a href=\"https://twitter.com/NadineDorries/status/403985900172247040?\">on Twitter</a> that if he tried to contact her adult children for a story, she would “nail your balls to the floor... using your own front teeth.” </p><p id=\"FMKGS7\">In a <a href=\"https://www.gov.uk/government/news/new-plans-to-protect-people-from-anonymous-trolls-online\">press statement</a> announcing the government’s plans, Dorries said: “Tech firms have a responsibility to stop anonymous trolls polluting their platforms.” She did not advise on what to do when threatened by a member of the country’s government.</p><p id=\"zDlfao\">Dorries made the threat in 2013 to journalist Ben Glaze from the <em>Sunday Mirror</em>. As <a href=\"https://pressgazette.co.uk/tory-mp-tells-sunday-mirror-reporter-ill-nail-your-testicles-floor-twitter-rant-over-doorstep/\">reported by the <em>PressGazette</em></a>, Glaze had been asking Dorries why she was <a href=\"https://www.mirror.co.uk/news/uk-news/tory-mp-nadine-dorries-threatens-2845154\">claiming tens of thousands of pounds a year</a> in taxpayer funds to pay her own daughters for “secretarial support.” Dorries has frequently <a href=\"https://www.thenational.scot/news/19699617.nadine-dorries-flounders-confronted-abusive-tweets/\">used her Twitter</a> to insult other users, labeling one individual a “patronising knob” and another journalist a “public school posh boy fuckwit.”</p><div id=\"fCFDnk\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ben Glaze of the Sunday Mirror has an interest in my three daughters which borders on decidedly creepy/ stalker esque. Here is a message....</p>— Nadine Dorries (@NadineDorries) <a href=\"https://twitter.com/NadineDorries/status/403985627395653633?ref_src=twsrc%5Etfw\">November 22, 2013</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><div id=\"4z15Od\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Be seen within a mile of my daughters and I will nail your balls to the floor... using your own front teeth. Do you get that?</p>— Nadine Dorries (@NadineDorries) <a href=\"https://twitter.com/NadineDorries/status/403985900172247040?ref_src=twsrc%5Etfw\">November 22, 2013</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"6Ngqol\">Dorries is now pushing the government’s newly announced moderation plans as part of the Online Safety Bill, which is intended to overhaul rules for removing harmful content on the internet. This week, it said it would amend the bill to force the largest online platforms to “offer ways for their users to verify their identities and control who can interact with them.” </p><p id=\"UnqPg6\">The exact details of implementation will be left up to the platforms, but the government suggests they could verify users’ identities using government-issued IDs like passports and driver’s licenses. Those platforms would then offer users the option “to tick a box in their settings to receive direct messages and replies only from verified accounts.” </p><p id=\"yudLb8\">Some experts are doubtful, though. Speaking <a href=\"https://inews.co.uk/news/technology/online-safety-bill-social-media-users-block-anonymous-users-opt-out-harmful-content-1481461\">to <em>The i</em></a>, Neil Brown of the internet-focused law firm decoded.legal, said the plans would not stop all online abuse. “Those who are already willing to harass or spread misinformation under their own names are unlikely to be affected,” said Brown. “The additional step of showing ID is unlikely to be a barrier to them.” </p><p id=\"J922WN\">Brown added that the plans would negatively affect those who wish to remain anonymous online but don’t engage in abusive behavior: “If you don’t identify yourself, you could be grouped with millions of others, and with one click your comments will no longer be seen.”</p><p id=\"w7AToF\">In addition to verifying users’ identity, the UK government said this week it wanted to give people the option to block all “legal but harmful content” on social media — posts that fall below the threshold for criminal prosecution but may still include racist abuse, the promotion of self-harm, vaccine misinformation, and the like. Again, the government did not detail exactly how social media platforms would be expected to enforce this policy.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ejFSkoqF43PgNZn4NE1mrncGkP0=/0x343:4769x2840/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270641/1366748121.jpg",
  "description": "A telling example that verifying identity doesn’t stop nasty messages.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}