{
  "title": "UK porn sites could verify age using credit cards or passports in revived plans",
  "url": "https://www.theverge.com/2022/2/8/22923203/uk-porn-sites-verify-age-id-check-online-safety-bill",
  "date": "2022-02-08T10:36:27.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LumIVD_IaN-v24F9kOzLl2PS6_k=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70482882/acastro_ageID.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"cHYkQP\">The UK government has revived plans for porn sites to verify users’ ages — an initiative that was <a href=\"https://www.theverge.com/2019/6/19/18692224/uk-age-verification-system-online-porn-block-delay-indefinitely\">scrapped in 2019</a> due to technical challenges and <a href=\"https://www.theverge.com/2018/10/18/17993594/uk-porn-new-law-age-verification-bbfc-update-guidelines-privacy\">criticism from privacy campaigners</a>. </p><p id=\"veSiI4\">The new rules will be part of the UK’s Online Safety Bill, a mammoth piece of legislation intended to reset how digital platforms are governed in the country. The bill originally stipulated that only porn sites that allowed user-generated content (like OnlyFans) would have to verify users’ ages, but this has now been <a href=\"https://www.gov.uk/government/news/world-leading-measures-to-protect-children-from-accessing-pornography-online\">updated</a> to cover all pornography sites. </p><p id=\"KGheaW\">“Parents deserve peace of mind that their children are protected online from seeing things no child should see,” said digital minister Chris Philp in a <a href=\"https://www.gov.uk/government/news/world-leading-measures-to-protect-children-from-accessing-pornography-online\">statement</a>. “We are now strengthening the online safety bill so it applies to all porn sites to ensure we achieve our aim of making the internet a safer place for children.”</p><div class=\"c-float-right\"><aside id=\"iMLJ33\"><q>individual companies will have to implement age-checks in a way that meets government criteria</q></aside></div><p id=\"nZBe9o\">Details of how age-checks will be implemented are not yet clear, and individual companies will decide for themselves how to comply with the new rules. Without guarantees from the government on users’ privacy, this approach will likely reawaken old fears that such age-checks could leave users exposed; creating databases of pornography users that would be ripe targets for hackers looking to blackmail or extort individuals. </p><p id=\"fBHaEP\">As Jim Killock, executive director of the UK’s Open Rights Group, told <em>The Guardian</em>: “There is no indication that this proposal will protect people from tracking and profiling porn viewing. We have to assume the same basic mistakes about privacy and security may be about to be made again.”</p><p id=\"l4ixnD\">The UK government said possible methods of age verification could include “checking a user’s age against details that their mobile provider holds, verifying via a credit card check, and other database checks including government held data such as passport data.” However, it is possible that these credentials could be used to verify age without also checking an individual’s identity. </p><p id=\"1VUNf3\">Sites that fail to introduce age checks could be blocked from operating in the UK via blacklists issued to the country’s ISPs. And they could be fined 10 percent of their annual worldwide income. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Sa8-K9CciNupeARg7YLmFnJ7UTA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10284799/acastro_ageID.jpg",
  "description": "The UK won’t give up on plans to age-gate online smut",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}