{
  "title": "UK threatens tech execs with jail time if they fail to meet online safety standards",
  "url": "https://www.theverge.com/2022/3/17/22982841/uk-online-safety-bill-tech-managers-jail-time-threats-draft",
  "date": "2022-03-17T15:15:09.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/N3uM4nEwXBl0mnpzMoPsMbUn9xQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70635849/akrales_220309_4977_0182.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"3NfyHU\">The UK has outlined new legislation that could see top managers at tech companies sent to jail if they fail to meet the demands of regulators. The rules are part of the government’s mammoth Online Safety Bill, a new draft of which was introduced to Parliament today — a major milestone to the bill becoming law.</p><p id=\"LgVQug\">Tech execs could be jailed if they fail to respond to requests for information from newly-empowered regulator Ofcom “in an accurate and timely manner,” according to the bill. The latest draft stipulates that senior managers will be liable for criminal prosecution just two months after the bill becomes law (instead of two years, as previously outlined). </p><p id=\"RqSEBV\">New offenses have also been added, including suppressing, destroying, or altering information requested for investigations. Ofcom also has the power to fine companies who fail to comply with the regulations up to 10 percent of their global turnover or to block access to their services in the UK.</p><div class=\"c-float-right\"><aside id=\"BbZaKE\"><q>Making managers liable will worry tech companies in the UK</q></aside></div><p id=\"FdULsA\">Ben Packer, a partner at law firm Linklaters, told <em>The Verge</em> that the new offenses for tech managers focused on denying or distorting information — and that this was a narrower remit than suggested by earlier recommendations. “Though tech companies will still be concerned about the breadth and reach of the ‘information offenses,’ there will be relief that the government is not proposing to ask tech companies to nominate a fall guy to be criminally liable for corporate failures to comply with the safety duties,” said Packer. </p><p id=\"ftR6YM\">Investigations led by Ofcom will be tackling the broad range of offenses outlined in the Online Safety Bill. These measures include:</p><ul><li id=\"CZNoTJ\">Age checks for all major sites that host pornography. This would likely include not only dedicated porn sites but social platforms that host adult content, like Reddit and Twitter.</li><li id=\"DJSTBh\">Social media companies and search engines must prevent paid-for scam adverts from appearing on their platforms. If alerted about these adverts they should remove them swiftly. </li><li id=\"TRBdXj\">Cyberflashing — the sending of unsolicited sexual images through dating apps, social media, or via AirDrop or Bluetooth — will become a criminal offense punishable by up to two years in prison. This is the same maximum sentence for indecent exposure. </li><li id=\"jzPiHK\">Content that is “legal but harmful” must be moderated effectively on social media. This is content that does not constitute a criminal offense (like racist or abusive language) but that could cause “adverse physical or psychological impact.” Tech companies will be expected to introduce new measures to reduce users’ exposure to this content.</li></ul><p id=\"LdqWrP\">Although the Online Safety Bill has been trumpeted by the UK’s Conservative government as the most forward-thinking legislation for reducing online harm, it’s been heavily criticized by digital rights and advocacy groups. Many experts say the bill deploys vague language (such as “legal but harmful”) which will make enforcement a problem, and may encourage tech companies to preemptively censor users in order to avoid prosecution. </p><p id=\"6KZ9NK\">Jim Killock, executive director of the UK’s Open Rights Group, said the legislation also gives politicians too much power to describe what constitutes harmful content without due scrutiny. “It would mean state-sanctioned censorship of legal content,” said Killock. </p><p id=\"Xwgn0A\">Some UK lawmakers involved in drafting the legislation have been criticized for a lack of expertise. Conservative politician Nadine Dorries, who is spearheading the project, has come under particular scrutiny. A <a href=\"https://www.politico.eu/article/nadine-dorries-digital-minister-big-tech/\">recent report in <em>Politico</em></a><em> </em>claimed that, in a meeting with Microsoft, Dorries asked when the tech giant was going to get rid of its algorithms.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bPAxxa7a10LJXS57K0p55zD-ofk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23318433/akrales_220309_4977_0182.jpg",
  "description": "The UK is gearing up to clobber tech companies",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}