{
  "title": "Ukrainian scientists face tough choices as international community offers aid",
  "url": "https://www.theverge.com/2022/3/17/22979250/ukraine-scientists-international-resources-war",
  "date": "2022-03-17T11:00:00.000Z",
  "author": "Jody Serrano",
  "content": "      <figure>      <img alt=\"A Molotov cocktail using a science beaker instead of a liquor bottle. \" src=\"https://cdn.vox-cdn.com/thumbor/S9OQ2vldtw8cpObFxtc_lGJZAos=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70634597/acastro_220316_5088_0001.0.jpg\" />    </figure>  <p>The hopes and fears driving an online movement to help Ukrainian researchers</p> <p class=\"p--has-dropcap p-large-text\" id=\"ufPonC\">Explosions rock Dnipro, a city in central Ukraine where Vitalii Palchykov, a synthetic organic chemist, lives with his wife and 7-year-old son. He and his family get very nervous every time they hear bomb warning sirens go off. Living in the middle of the Russian invasion doesn’t feel safe. Research as usual is out of the question.</p><p id=\"uFznzE\">“Any research work involves a high level of focus on the process,” Palchykov, the director of the <a href=\"https://www.dnu.dp.ua/en/scientific_research_part\">Research Institute of Chemistry and Geology</a> at Oles Honchar Dnipro National University, told <em>The Verge</em> in an email on March 2. Achieving that focus is now extremely difficult, especially when he is tracking the news constantly. </p><p id=\"X2ZTlK\">“It is impossible to look at this and it is impossible not to look, too. When I see what is happening with the cities of Ukraine after the bombings, I have no words to describe the shock even in Russian or Ukrainian, which I know very well, so I can’t describe it in English,” he said.</p><div class=\"c-float-right c-float-hang\"><aside id=\"pzRXRk\"><q>“It is impossible to look at this and it is impossible not to look, too”</q></aside></div><p id=\"ADmxoV\">Members of the international scientific community have also found it hard to look away from the conflict or ignore the plight of their colleagues like Palchykov. In recent weeks, this desire to help has resulted in an earnest and extensive online movement made up of individuals, groups of volunteers, and institutions, which are using the internet and social media to offer Ukrainian scientists and students affected by war all the support they can: jobs, a place to continue their studies, a new home. </p><p id=\"yaN5gD\">“Dear university students who escape from <a href=\"https://twitter.com/hashtag/Ukraine?src=hashtag_click\">#Ukraine</a> in the middle of your studies, pls know that you are very welcome in Helsinki in <a href=\"https://twitter.com/helsinkiuni\">@helsinkiuni</a> to continue your studies with us. No entrance exam, no fees. High quality university. Dm for more details. Pls share,” reads a <a href=\"https://twitter.com/minnahuoti/status/1502707951232069639?s=20&amp;t=vOI_OnYbyRj7AxFPEAVhLw\">tweet</a> posted Saturday from University of Helsinki educational sciences professor Minna<strong> </strong>Huotilainen, one of <a href=\"https://twitter.com/MilenaSokolows1/status/1502311906853404676?s=20&amp;t=XtC1Q-5lUuJ83YfjpOTzgQ\">many</a> such <a href=\"https://twitter.com/DirkMessner/status/1499699461928464394?s=20&amp;t=c-EgEN9VXQL4E6OlaAX9sQ\">offers</a> on <a href=\"https://twitter.com/BellinzonaIrb/status/1502265741671817219?s=20&amp;t=e12S9zqoCVeTeJbPGTImgQ\">social media</a>.</p><p id=\"swuacA\">Within 48 hours, it had received more than 11,000 retweets and 30,000 likes.</p><div id=\"7xXGGv\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Dear university students who escape from <a href=\"https://twitter.com/hashtag/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine</a> in the middle of your studies, pls know that you are very welcome in Helsinki in <a href=\"https://twitter.com/helsinkiuni?ref_src=twsrc%5Etfw\">@helsinkiuni</a> to continue your studies with us. No entrance exam, no fees. High quality university. Dm for more details. Pls share.</p>— Minna Huotilainen   (@minnahuoti) <a href=\"https://twitter.com/minnahuoti/status/1502707951232069639?ref_src=twsrc%5Etfw\">March 12, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"qEQBIy\">Unfortunately, while the scientific community’s offers of help from around the world are appreciated by Ukrainian scientists, many will not be able to take advantage of them. Those who remain in the country are dealing with unimaginable destruction and horror. Even the scientists who want to leave sometimes can’t get to the border or aren’t allowed to cross it. Others have taken up arms to help the Ukrainian military or are volunteering in their cities to deliver clothing, food, and medicine.</p><div class=\"c-float-left c-float-hang\"><aside id=\"4tIcgu\"><q>“Ukrainian researchers are part of the Ukrainian nation”</q></aside></div><p id=\"K8d7sZ\">Speaking to <em>The Verge</em> on March 11 by phone from Ukraine, Olga Polotska, the executive director of the <a href=\"https://jordan.mfa.gov.ua/storage/app/sites/41/nrfueng.pdf\">National Research Foundation of Ukraine</a>, a state nonprofit which provides funding for fundamental and applied research, said she spends most of her time in bomb shelters. She starts every day by sending a message to the foundation’s employee chat group asking if everyone is alive. So far, she hasn’t received bad news from the group, and thanks God for that.</p><p id=\"EtljhY\">“Ukrainian researchers are part of the Ukrainian nation. Some of them have been killed. Some of them are fighting in the military forces. Some of them are fighting in the local defense forces. Some of them have left the country. Some of them are staying inside,” Polotska, who was not comfortable revealing her exact location, said. “We don’t live in a research bubble.”</p><h3 id=\"2qB4E8\">“This could be me” </h3><p id=\"1gKqi1\">One of the earliest online assistance efforts was pioneered by Andrew Kern, a <a href=\"https://kr-colab.github.io/\">population geneticist</a> at the University of Oregon. On February 24th, the first day of the Russian invasion, Kern told Ukrainian geneticists to contact him on <a href=\"https://twitter.com/pastramimachine/status/1496883682123997185?s=20&amp;t=VtEiOlgYXPF7SG6lUyge7A\">Twitter</a> because his research group wanted to offer support. A few tweets later, Kern put together a <a href=\"https://twitter.com/pastramimachine/status/1497246151019356160?s=20&amp;t=zAsC75EiPzsWcarA1SvtQA\">Google Doc</a> with a list of labs willing to support displaced Ukrainian scientists.</p><div id=\"1kBlaU\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">folks-- we are putting together a list of labs that could take on / help Ukrainian scientists as they make their way to safety. If you might be able to support a colleague with a position, please add your name here <a href=\"https://t.co/4UcjPvKK0k\">https://t.co/4UcjPvKK0k</a></p>— Andrew Kern (@pastramimachine) <a href=\"https://twitter.com/pastramimachine/status/1497246151019356160?ref_src=twsrc%5Etfw\">February 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"LAAUm3\">The list <a href=\"https://twitter.com/pastramimachine/status/1497437126559866885?s=20&amp;t=QQ64XPGw6LTgsh9fPPAh0Q\">spread like wildfire</a> on science Twitter, quickly growing to more than 200 labs, then 400. Bioinformatics researchers Björn Grüning and Anton Nekrutenko helped Kern curate and adapt his early Google Doc to make it more scalable and manageable. (They also created a GitHub page called <a href=\"https://github.com/bgruening/awesome-ukraine-support\">“Awesome Ukraine Support,”</a> that supports Ukrainian refugees more broadly.)<strong> </strong>As of the publication of this article, <a href=\"https://docs.google.com/spreadsheets/d/1HqTKukfJGpmowQnSh4CoFn3T6HXcNS1T1pK-Xx9CknQ/edit#gid=320641758\">more than 1,900 labs</a> have signed up to Kern’s effort to support Ukrainian scientists, offering internships, fellowships, short and longer-term jobs, places for master’s and PhD students, free accommodations, office space, and research materials, among other forms of support. </p><p id=\"NcSToq\">“One of the first things that I think of when I see this sort of thing is, ‘Boy, this could be me, this could have been my family,’” Kern said. “Supporting our colleagues in this way makes all the sense in the world.”</p><p id=\"yqlIlW\">Others reaching out to help have personal ties to the conflict, or experience fleeing from disaster.<strong> </strong>In Pittsburgh, Ukrainian-American professor and researcher Olexandr Isayev shared an offer for a potential stay at his lab at Carnegie Mellon University. </p><div id=\"LTe56J\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Dear Ukrainian   brothers and sisters,if you are PhD student, postdoc, or scientist in the field of computational chemistry/data science my lab at <a href=\"https://twitter.com/CarnegieMellon?ref_src=twsrc%5Etfw\">@CarnegieMellon</a> might help with a short time stay in the lab, finding other paces or funding. <a href=\"https://twitter.com/hashtag/ScienceForUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#ScienceForUkraine</a> <a href=\"https://twitter.com/hashtag/compchem?src=hash&amp;ref_src=twsrc%5Etfw\">#compchem</a> Please DM</p>— Olexandr Isayev      (@olexandr) <a href=\"https://twitter.com/olexandr/status/1498737121300865024?ref_src=twsrc%5Etfw\">March 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"9BqVur\">Like Palchykov, the synthetic organic chemist, Isayev is from Dnipro (they are former colleagues). Isayev told <em>The Verge</em> that his family in Ukraine was taking shelter multiple times every night, a fact which has left him unable to sleep for days at a time.</p><p id=\"gIwvBV\">Isayev said three Ukrainian students — two who escaped the country and are in Europe, and a third who was still in Ukraine — had contacted him personally about his offer for help so far and that his university was looking at their applications. None of them can study right now, he said. Back in Ukraine, some universities are closed to students. Others are in the middle of a war zone.</p><div class=\"c-float-right c-float-hang\"><aside id=\"diBgoE\"><q>“This could be me, this could have been my family”</q></aside></div><p id=\"58cVZL\">Meanwhile, in California, Robert Hunt has <a href=\"https://twitter.com/hunt_lab/status/1498087929486327808?s=20&amp;t=VtEiOlgYXPF7SG6lUyge7A\">opened the doors</a> of his lab to Ukrainian postdoc and PhD students in neuroscience. Hunt is an anatomy and neurobiology professor at the University of California Irvine and the director of the UCI <a href=\"https://epilepsyresearch.uci.edu/about-the-epilepsy-research-center/\">Epilepsy Research Center</a>. He was inspired to help after he saw someone else post an offer and recounted his own experience as a graduate student who narrowly escaped Hurricane Katrina when it hit New Orleans in 2005.</p><p id=\"P9q7q0\">“I evacuated to a shelter in northern Louisiana, and after a week of living in my car at the shelter, I started reaching out to universities about transferring for a semester or two,” Hunt said, adding that he eventually met two professors who helped him enroll in classes and gave him a place to stay. “These acts of kindness are probably the reason why I have a career in neuroscience. I don’t know what I would’ve done if I wasn’t able to continue my graduate studies.”</p><h3 id=\"F4uuCi\">Science is global, and interconnected</h3><p id=\"T5MLuS\">Another effort to pull together resources is the<strong> </strong>initiative <a href=\"https://twitter.com/Sci_for_Ukraine\">Science for Ukraine</a>, which is coordinated by <a href=\"https://scienceforukraine.eu/team.html\">Sanita Reinsone</a>, a digital humanities and autobiographical studies researcher at the University of Latvia, and her team. </p><p id=\"vDtpJO\">Science for Ukraine initially began as a hashtag (#ScienceForUkraine) and a Twitter account (<a href=\"https://twitter.com/Sci_for_Ukraine\">@Sci_for_Ukraine</a>). It aimed to retweet information about available support for Ukrainian scientists and students. Within a day, the offers to help increased so much that it became challenging for Reinsone to compile them all by herself. She quickly found that the international scientific community was more than willing to join her. </p><div id=\"Sm53yM\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/UK?src=hash&amp;ref_src=twsrc%5Etfw\">#UK</a>: <a href=\"https://twitter.com/UWTSD?ref_src=twsrc%5Etfw\">@UWTSD</a> announces scholarships for students from <a href=\"https://twitter.com/hashtag/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine</a>. As a Nation of Sanctuary <a href=\"https://twitter.com/hashtag/Wales?src=hash&amp;ref_src=twsrc%5Etfw\">#Wales</a> leads the way in welcoming people in need. Their scholarships will enable students to continue their studies in a safe environment.<br>Info: <a href=\"https://t.co/dMWqSC0KpC\">https://t.co/dMWqSC0KpC</a><a href=\"https://twitter.com/hashtag/ScienceForUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#ScienceForUkraine</a> <a href=\"https://t.co/VWlDahTCHU\">https://t.co/VWlDahTCHU</a></p>— Science for Ukraine    (@Sci_for_Ukraine) <a href=\"https://twitter.com/Sci_for_Ukraine/status/1501561278992723978?ref_src=twsrc%5Etfw\">March 9, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"iooEgd\">As of Monday, Science for Ukraine had volunteer coordinators from 30 countries. The initiative is active on Twitter, Instagram, and LinkedIn, where it posts support offers daily, and even has its own dedicated <a href=\"https://scienceforukraine.eu/\">website</a>, complete with an interactive world map with hundreds of pins providing information on support being offered, such as the institution publishing the opportunity, location, and type of support. It has collected and published offers of support from roughly 850 institutions across all science and research disciplines around the world, extending from other countries in Europe to the US, Japan, Chile, and Brazil, among others.</p><p id=\"NsJcZ3\">“It is important to reach people not only on the web, but also at the border and in refugee centers and also in Ukraine,” Reinsone said. “There is still a lot to do here, and I hope that there will be cooperation with other support organizations.”</p><p id=\"LJRzxC\">This volunteer-driven organization has grown dramatically in a short period of time. Yet this response isn’t out of the ordinary for the scientific community.</p><div class=\"c-float-left c-float-hang\"><aside id=\"K8ZRMG\"><q>“There is still a lot to do here,”</q></aside></div><p id=\"c8bsUm\">Researchers who spoke to <em>The Verge</em> said that science is a global discipline and community, and many institutions have mechanisms in place to promote scientific exchanges and visits. People work in many places throughout their careers and grow to depend on one another. This means that many have worked with a Ukrainian scientist in the past. Some might be working with Ukrainian scientists who live outside of the country now, like Isayev at Carnegie Mellon University.</p><p id=\"WNelaV\">“Many fields and subfields are actually quite small and many of us have more or less ‘grown up’ together as we advanced in our careers,” Hunt, of UC Irvine, said.</p><p id=\"DoVPUR\">On another level, some, like Reinsone, say they were moved to help because of the brutal nature of the war itself. Reinsone said she was motivated to start the initiative because of the “shock, anger, and also a feeling of helplessness at seeing Russia attacking Ukraine.”  </p><h3 id=\"O7S8pm\">“Everyone wants to go back home.”</h3><p id=\"p9ZXzF\">The Ukrainian scientific community has received the resources provided by the individuals, volunteer groups, and institutions with gratitude, although experts say it’s difficult for people to take advantage of the opportunities at this time. Others state that research isn’t a priority right now, given the growing catastrophe in the country. The focus is on fighting the Russians, helping when possible, and staying alive.</p><p id=\"RUeMCM\">Speaking to <em>The Verge</em> from the city of Krakow in Poland, Yevheniia Polishchuk, vice head of the <a href=\"https://mon.gov.ua/eng/ministerstvo/pro-ministerstvo/rada-molodih-uchenih\">Young Scientists Council</a> at the Ministry of Education and Science in Ukraine — an advisory body that facilitates interactions between the government and youth scientific organizations — said that there are several obstacles that prevent scientists from continuing their work in other countries. </p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/NI9yGK6hLhv0A3ZLq00rPkyPzAk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320159/Karazin_University_1.jpg\">      <cite>Courtesy of the Young Scientists Council at the Ministry of Education and Science of Ukraine.</cite>      <figcaption><em>Buildings at Karazin University in Kharkiv.</em></figcaption>  </figure></div><p id=\"0Hpvtf\">While many female Ukrainian scientists have the option to leave, most Ukrainian men between the ages of 18 and 60 are <a href=\"https://www.washingtonpost.com/world/2022/03/09/ukraine-men-leave/\">banned from leaving the country</a> in case they are called to fight. There are also physical limitations. Polishchuk points out that some Ukrainian scientists are stuck at the border while others can’t leave cities with intense fighting, such as Sumy, Chernihiv, and Kharkiv. Others don’t want to leave their country out of a sense of patriotism.</p><p id=\"8VFgSa\">In addition, not all Ukrainian scientists have the skills necessary to find a job in science outside the country, she explained. For instance, many don’t have a good command of English. Others, meanwhile, were focused on teaching and not research.</p><p id=\"MXV64m\">“Some of them will leave forever, but I know a lot [of researchers] who decided to stay,” Polishchuk said. “If the funding will be appropriate and universities will be restored, then those who are abroad will come back. Everyone wants to go back home.”</p><p id=\"QaaYrw\">Polishchuk said that although the Young Scientists Council expected a large number of scientists to leave the country, it has received only a small number of petitions for academic migration. With this in mind, Polishchuk is encouraging those who wish to help to consider offering remote working options, as well.</p><h3 id=\"s8g7gn\">The future of Ukrainian science</h3><p id=\"nTjSYI\">When it comes to the future of science in Ukraine, Polotska, the director of the country’s national research foundation, said no one can speak to that with certainty at the moment. Nobody knows when the war is going to be over, and it’s just too early to be talking about that because research is not the priority, she explained.</p><p id=\"yUC9OW\">“People die in front of your eyes. You literally have to spend almost all your time underground where it’s cold and sometimes there is no electricity,” Polotska said. She added: “Many of our research institutions and universities have been leveled down to the ground … As soon as we win, and there is no doubt that we’re going to win, then [support for researchers] is going to be the follow-up conversation.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"bcXfj5\"><q>“People die in front of your eyes”</q></aside></div><p id=\"hPoR7v\">Right now, Polotska said, the foundation is insisting that the international scientific community end research and educational cooperation with Russia. Polishchuk, from the Young Scientists Council, agreed with Polotska, although she said the council is also asking international colleagues to stop working and funding projects with Belarus, which <a href=\"https://www.npr.org/2022/03/11/1085548867/belarus-ukraine-russia-invasion-lukashenko-putin?t=1647142460271\">aided Russia</a> in its invasion of Ukraine.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3W3W9_6qRV2KnMQAE1Qx8jXU0JA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320167/Oleksandr_Pypka_and_Vitalii_Palchykov.jpg\">      <cite>Courtesy of Vitalii Palchykov</cite>      <figcaption><em>Oleksandr Pypka</em><strong><em> </em></strong><em>(left), a mathematics professor, and Vitalii Palchykov (right), an organic chemist, both of Dnipro National University, at a volunteer center in Dnipro, Ukraine, on March 7, 2022.</em></figcaption>  </figure></div><p id=\"l7oueS\">For Palchykov, the chemist in Dnipro, plans for the future aren’t clear, either. Despite things being relatively calm in the city in recent weeks, on the morning of March 11th, three Russian missiles <a href=\"https://www.wsj.com/video/missiles-strike-ukraines-dnipro-as-russian-vehicles-redeploy-near-kyiv/1067B342-1C6F-4A18-A28A-88B4F8A107F7.html\">hit an area of his city</a> densely populated with civilians. The attack was about 10 kilometers from his home.</p><p id=\"hdoJZl\">These days, he works from home because it’s not feasible for him to work in the lab; there is no one there. All of his undergraduate and graduate students are at home. He is pouring his energy into writing papers using the large amount of pre-accumulated experimental data he had on hand. Some days, he goes to the city’s local volunteer center, where he helps deliver clothes, food, sand, and medicine. He also helps make Molotov cocktails to hurl at Russian forces. </p><div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_XS6v-vvvrpBMd2jAG6gQMIts0Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23320161/Molotov_cocktails_3.jpg\">      <cite>Courtesy of Vitalii Palchykov</cite>      <figcaption><em>Molotov cocktails prepared by Palchykov and chemistry students from his university.</em></figcaption>  </figure></div><p id=\"3Pg7F3\">People with weapons are constantly walking around him and the other volunteers. Since the <a href=\"https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste\">Russian capture of the Chernobyl</a> <a href=\"https://www.voanews.com/a/chernobyl-zaporizhzhia-nuclear-plants-being-run-by-ukrainian-staff-russia-says/6482346.html\">and Zaporizhzhia</a> nuclear power plants, they’ve recently prepared more than 1,000 doses of <a href=\"https://www.cdc.gov/nceh/radiation/emergencies/ki.htm#howWorks\">potassium iodide</a>, which can help protect people from some forms of radioactive injury, in <a href=\"https://www.theverge.com/2022/3/10/22970665/ukraine-chernobyl-blackouts-nuclear-power-plants\">the event of disaster</a>. They carry doses with them at all times, Palchykov said.</p><p id=\"O9j5EH\">After the war, he affirmed that scientists in Ukraine will continue to do research. Yet, he believes that many young scientists will leave the country to work in the European Union, the US, and elsewhere, a prospect that made him very sad. Finding young scientists to work with him on his projects will be increasingly difficult.</p><p id=\"kHrTbZ\">Palchykov doesn’t know if he will continue his scientific work in Ukraine yet. He has seen Kern’s Google Doc, and calls the initiative “awesome.” After the war, he plans to use it to search for opportunities.</p><p id=\"F1cTnG\">“If, with the support of our Western partners, we manage to keep funding for our research, then we can work here in Ukraine. If not, then no,” he told <em>The Verge</em> via email. He has received many offers to take him and his family in from colleagues in Slovakia and Poland, but is staying put for now. He is needed in Ukraine, and is hoping for the best.</p><p class=\"c-end-para\" id=\"ghIfDt\">“The darkest hour is just before the dawn,” Palchykov said.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KGjZwpxFCxhw7Q7X9oC68ejFRsw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23321880/acastro_220316_5088_0001.jpg",
  "description": "The hopes and fears driving an online movement to help Ukrainian researchers.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}