{
  "title": "Ukraine’s nuclear power plants are at ‘unprecedented’ risk as fighting continues",
  "url": "https://www.theverge.com/2022/3/2/22958029/russia-invasion-ukraine-unprecedented-risk-nuclear-power-plants",
  "date": "2022-03-02T18:11:07.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Zaporizhzhia Nuclear Power Plant\" src=\"https://cdn.vox-cdn.com/thumbor/9XeS5czZ8ucG-Nx_Z_fk7jRnXhU=/0x0:5513x3675/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70570666/1161467052.0.jpg\" />        <figcaption>Six reactors generate 40-42 billion kWh of electricity, making the Zaporizhzhia Nuclear Power Plant the largest in Ukraine. Russian officials <a class=\"ql-link\" href=\"https://www.iaea.org/newscenter/pressreleases/update-6-iaea-director-general-statement-on-situation-in-ukraine\" target=\"_blank\">told the IAEA</a> that it has “taken control of the territory around” Zaporizhzhia. | Photo credit should read Dmytro Smolyenko / Barcroft Media via Getty Images</figcaption>    </figure>  <p id=\"OPUC0q\">Nuclear experts are increasingly worried about the safety of Ukraine’s nuclear power plants as Russia’s invasion of the country continues. The conflict has the grim distinction of being the first time warfare has exploded in a region so heavily reliant on nuclear energy.</p><p id=\"uiZKrd\">“The situation in Ukraine is unprecedented and I continue to be gravely concerned,” International Atomic Energy Agency (IAEA) Director General Rafael Mariano Grossi said in an introductory statement to the agency’s Board of Governors meeting today and shared with the press. “I have called for restraint from all measures or actions that could jeopardize the security of nuclear and other radioactive material, and the safe operation of any nuclear facilities in Ukraine, because any such incident could have severe consequences, aggravating human suffering and causing environmental harm.”</p><div class=\"c-float-right\"><aside id=\"Pape8l\"><q>“The situation in Ukraine is unprecedented, and I continue to be gravely concerned”</q></aside></div><p id=\"9W16uI\">Ukraine’s <a href=\"https://world-nuclear.org/information-library/country-profiles/countries-t-z/ukraine.aspx\">15 nuclear reactors</a>, which typically generate over half of the country’s power, have worrisome vulnerabilities in a warzone. Wayward explosions or a catastrophic failure of Ukraine’s power grid are the biggest concerns for now since the IAEA and experts whom <em>The Verge</em> spoke with remain skeptical that Russia would deliberately target nuclear power plants. </p><p id=\"1XwDeq\">Ukraine already has experience with nuclear catastrophe. In 1986, a reactor at Chernobyl <a href=\"https://world-nuclear.org/information-library/safety-and-security/safety-of-plants/chernobyl-accident.aspx\">exploded</a>. Now, officials are working to prevent history from repeating itself. Several layers of safety systems would have to fail for such a disaster to happen again. But conflict could poke holes in those existing safety nets. </p>  <figure class=\"e-image\">        <img alt=\"EU hands over new shield built over Reactor 4 of Chernobyl Nuclear Power Plant to Ukraine\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Y9JCBcy6utvjgQXsbrIXNORE4VU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23283126/1154967397.jpg\">      <cite>Photo by Pyotr Sivkov\\TASS via Getty Images</cite>      <figcaption>PRIPYAT, UKRAINE - JULY 10, 2019: Outside view of the mobile metal structure, officially known as the New Safe Confinement, placed over the reactor that exploded at the Chernobyl Nuclear Power Plant in 1986. </figcaption>  </figure><p id=\"A5303s\">“Nuclear power plants are very strong, and they are designed, for example, to withstand accidental aircraft crashes,” says James Acton, a physicist and co-director of the Nuclear Policy Program at the Carnegie Endowment for International Peace. “Nuclear power plants are just not designed to be in a war zone.”</p><p id=\"yb732Y\"><strong>Staying cool</strong></p><p id=\"Ak17Mr\">Ukraine ranks <a href=\"https://www.nei.org/resources/statistics/top-15-nuclear-generating-countries\">third</a> in the world when it comes to how much of its electricity comes from nuclear energy. That power comes from 15 reactors at four separate nuclear plants. The fuel in those reactors generates tremendous heat — so they need to be constantly cooled down to prevent a catastrophic meltdown that would release radioactive isotopes.  </p><p id=\"fOc65E\">Authorities have already <a href=\"https://snriu.gov.ua/en/news/march-01-2022\">shut down several of the country’s reactors</a> so that they are no longer supplying power to the grid. Shutting a reactor off significantly cuts down the heat it generates, which means it won’t need as much water and energy for critical cooling systems. But even in a shutdown, the fuel is still extremely hot. Whether or not a reactor is currently generating power for the grid, it still needs an external source of energy to run its cooling system. Nuclear plants typically rely on other sources of power to run their own operations,<strong> </strong>according to Edwin Lyman, director of nuclear power safety at the Union of Concerned Scientists. That way, if they have to shut a reactor down, the cooling systems can keep functioning normally. </p><p id=\"SL9sYY\">So one of the biggest dangers to the reactors lies outside the power plants, in the rest of Ukraine’s grid. If, for some reason,<strong> </strong>the grid fails catastrophically, nuclear power plants still have diesel-powered generators they can rely on for their cooling systems. But how long those generators are useful depends on how much diesel fuel is on hand.</p><p id=\"JXwbu8\">In the event that the grid goes down, the diesel runs out of the generators, and cooling systems fail, the reactors are sequestered within pretty heavy-duty containment buildings. Those should be able to at least temporarily block radioactive emissions from entering the environment. Still, if the fuel inside begins melting down, enough pressure could build up to rupture the containment building within days, according to Frank von Hippel, a senior research physicist and professor of public and international affairs emeritus at Princeton University. People would only have a limited amount of time to get to the plant and get the cooling systems back online. </p><p id=\"5AKlHw\">“All of those things happening at the same time are extremely unlikely under normal circumstances. But in a war, a series of very unlikely events can become a lot more likely,” says Acton.</p><p id=\"LrEmtG\">Beyond the cooling systems for the reactors, keeping the spent nuclear fuel safe is another concern. It’s typically held in adjacent cooling pools just outside of the containment building. Not only are these pools less protected, but they could also store more fuel than the reactors themselves. If the pool is drained, the fuel inside could melt down.</p><p id=\"pLY5qh\">There’s also the risk of a missile or other munitions breaking through the containment building or striking backup generators or cooling systems. Two waste disposal facilities for relatively-low risk radioactive materials were struck over the weekend, the IAEA <a href=\"https://www.iaea.org/newscenter/pressreleases/update-3-iaea-director-general-statement-on-situation-in-ukraine\">said</a>, but there were no reports of radioactive release. Experts are less concerned about a deliberate attack on high-profile nuclear sites,<strong> </strong>in part because such a disaster would also threaten Russian interests. “I’m convinced that nothing like this could ever happen,” Grossi said during a <a href=\"https://www.iaea.org/press/press-conferences\">press conference</a> today, in reference to Russia having any plans to attack nuclear facilities. </p>  <figure class=\"e-image\">        <img alt=\"Drill of Ukrainian Interior Ministry units in Prypiat\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3mWX1CSnu-1SpZE1NXU5NmoNmD4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23282987/1238270123.jpg\">      <cite>Photo credit should read Volodymyr Tarasov/ Ukrinform/Future Publishing via Getty Images</cite>      <figcaption>PRYPIAT, UKRAINE - FEBRUARY 4, 2022 - A military vehicle is pictured during tactical drills in the abandoned city of Prypiat in the Chornobyl Exclusion Zone, northern Ukraine.</figcaption>  </figure><p id=\"hNPI8z\">Russian officials <a href=\"https://www.iaea.org/newscenter/pressreleases/update-6-iaea-director-general-statement-on-situation-in-ukraine\">told the IAEA</a> that it has “taken control of the territory around” Ukraine’s largest nuclear power plant, the Zaporizhzhia plant with six reactors. But it’s unclear whether they’ve taken control of the facility’s operations. The State Nuclear Regulatory Inspectorate of Ukraine <a href=\"https://www.iaea.org/newscenter/pressreleases/update-6-iaea-director-general-statement-on-situation-in-ukraine\">reported</a> on March 2 that it is still in communication with all of the country’s nuclear facilities and that the power plants are operating normally. </p><p id=\"m0A0zr\">“But while we may use expressions like ‘normal operations’ in a technical context, I want to emphasize there is nothing normal about the circumstances under which the professionals at Ukraine’s four Nuclear Power Plants are managing to keep the reactors that produce half of Ukraine’s electricity working,” Grossi said in his statement to the IAEA Board of Governors. </p><p id=\"hgEbSH\">Stressed-out staff poses its own risks to nuclear sites, experts say, because making a mistake on the job can be dangerous. That makes the wellbeing of staff “a humanitarian issue, but not only — it’s also a technical issue,” Grossi said at today’s press conference.</p><p id=\"tSk9Jf\">Russian forces seized Chernobyl last week, and the White House <a href=\"https://www.whitehouse.gov/briefing-room/press-briefings/2022/02/24/press-briefing-by-press-secretary-jen-psaki-and-deputy-national-security-advisor-for-international-economics-and-deputy-nec-director-daleep-singh-february-24-2022/\">reported</a> that Russia was likely holding staff at Chernobyl hostage. Luckily, remaining radioactive material there isn’t an imminent threat, and any “doomsday” scenario there is unlikely, <a href=\"https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste\">experts tell <em>The Verge</em></a>. There has been a <a href=\"https://www.iaea.org/newscenter/pressreleases/update-iaea-director-general-statement-on-situation-in-ukraine-25-feb-2022\">slight rise</a> in radiation levels in the area, likely because of military equipment disturbing radioactive debris in the soil, but the IAEA says that rise isn’t enough to pose a public health hazard.</p><p id=\"uYZX9c\"><strong>Maintaining the safety net</strong></p><p id=\"yh8ls0\">If the worst should happen and<strong> </strong>a meltdown did occur at a nuclear power plant, there are steps to take to mitigate its effects. Portable pumps can be brought in to douse the melting fuel with water. Ukraine would need ample diesel to power those pumps and plenty of water available. Thinking about that supply chain in advance is something officials can do to prevent a worst-case scenario.</p><div class=\"c-float-left\"><aside id=\"n5E7GQ\"><q>Even if a meltdown did occur at a nuclear power plant, there are steps to take to mitigate its effects</q></aside></div><p id=\"9B15xB\">Ensuring uninterrupted supply lines to nuclear sites was a priority Grossi highlighted in his statements today, on top of maintaining the physical integrity of the structures and being prepared to respond to any problems. He also emphasized the importance of keeping workers safe and the power grid online. Communication systems with the sites and regulators were another priority, as well as keeping radiation monitoring systems running.</p><p id=\"i1V54B\">Notably, Grossi invoked countries’ responsibilities to uphold a 2009 decision by the IAEA General Conference that affirmed that “any armed attack on and threat against nuclear facilities devoted to peaceful purposes constitutes a violation of the principles of the United Nations Charter, international law and the Statute of the Agency.”</p><p id=\"OlBPGK\">The State Nuclear Regulatory Inspectorate of Ukraine has asked the IAEA “to provide immediate assistance in coordinating activities” to keep Chernobyl and other nuclear facilities safe. The intergovernmental organization, which is part of the larger United Nations system, held a meeting this morning to address the emergency in Ukraine — including the country’s request for help. </p><p id=\"Ap2nza\">At a press conference following the meeting, Grossi did not clarify what kind of assistance the IAEA might provide. He said he’s in touch with “all the relevant partners” to figure out what can be done and that the agency plans to conduct physical inspections of nuclear facilities at an unspecified time in the future. “I cannot get too much into details because this is a matter of very sensitive negotiation, which is ongoing,” Grossi said. </p><p id=\"0uBqvN\">The IAEA and experts <em>The Verge</em> spoke with are clear that what happens to Ukraine’s nuclear sites matters for other parts of the world. “While the conflict may not spill over to neighboring countries — a reactor meltdown could,” says Lyman.</p><aside id=\"mJzpxg\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"What does Russia’s invasion of Ukraine mean for Chernobyl? \",\"url\":\"https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/wQyEiqQ0ybMPHlpbn39pnGZZSkI=/0x395:5513x3281/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23282635/1161467052.jpg",
  "description": "Experts are increasingly worried.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}