{
  "title": "Ukraine internet outages spark concerns of broader blackout",
  "url": "https://www.theverge.com/2022/2/24/22949115/internet-disruptions-ukraine-kharkiv-russia",
  "date": "2022-02-24T19:10:05.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6CyjYMZr1i9CPVHX3nUwwh2oiZw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70545866/VRG_Illo_STK010_K_Radtke_Ukraine_Glitch.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"NrMV9F\">Late Wednesday night, Russian troops invaded Ukrainian territories across the country’s northern, southern, and eastern borders, kicking off the largest troop mobilization in Europe in a generation. As Russian media attempts to <a href=\"https://www.vox.com/2022/2/24/22948944/putin-ukraine-nazi-russia-speech-declare-war\">cast the invasion as a response to Ukrainian aggression</a>, on-the-ground reporting has played a crucial role in countering the propaganda, with footage coming from both professional journalists and amateurs on social media.</p><p id=\"NWISWp\">But as the conflict intensifies, many civil society groups are increasingly concerned about the possibility of direct attacks on the country’s internet infrastructure. Russia has previously been linked to <a href=\"https://www.theverge.com/2022/2/15/22936192/ukraine-defense-ministry-ddos-russia-conflict-de-escalation\">DDoS attacks against Ukrainian government sites</a> — but a full blackout would mean going further, using physical or cyber weaponry to disable telecommunications infrastructure at the network level, and silencing Ukrainians in the process.</p><p id=\"A8g77c\">The invasion has already reduced internet connectivity in some parts of the country. At present, outages seem to be centered around Kharkiv, Ukraine’s second-largest city, which is located in the northeast of the country, around 25 miles from the Russian border. The Internet Outage Detection and Analysis (IODA) project at Georgia Tech <a href=\"https://twitter.com/gatech_ioda/status/1496710523148144640\">reported partial outages</a> starting just before midnight on February 23rd and continuing into the morning of February 24th. Outages are affecting the Triolan internet service provider, which services a number of cities and other areas across Ukraine, including Kharkiv.</p><div><div id=\"5K5ACM\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine</a>: Partial outage of Ukrainian ISP Triolan started around 2.50am UTC<br><br>Visible in near-realtime at<a href=\"https://t.co/OqEfHQ66R9\">https://t.co/OqEfHQ66R9</a> <a href=\"https://t.co/8SBiumlOmi\">pic.twitter.com/8SBiumlOmi</a></p>— Internet Outage Alerts (@gatech_ioda) <a href=\"https://twitter.com/gatech_ioda/status/1496710523148144640?ref_src=twsrc%5Etfw\">February 24, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"Q2RG2E\">According to internet shutdown tracker NetBlocks, Triolan users had <a href=\"https://twitter.com/netblocks/status/1496708402755559424\">reported the loss of fixed-line internet services</a> while cellphones continued to work.</p><p id=\"TS3EGl\">A message visible on the Triolan website on Thursday morning advised customers of a partial or complete lack of access in some cities. Updates posted in the company’s <a href=\"https://web.telegram.org/z/#-1461527911\">official Telegram channel</a> at around 10AM ET claimed that service had largely been restored, although responses suggested that many customers were still experiencing network outages.</p><div>  <figure class=\"e-image\">        <img alt=\"Message text reads: There is currently a partial or complete lack of access to the network in a number of cities or individual areas within the coverage of the Triolan network We make every effort to restore all network services and resources as soon as possible&amp;nbsp;. we recommend to use dns&amp;nbsp;1.1.1.1&amp;nbsp;or&amp;nbsp;8.8.8.8&amp;nbsp;in network settings before full stabilization of work of our services\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-mcrTHWQgEZ-33COQkYMKpKiSEM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23268016/Screen_Shot_2022_02_24_at_10.05.21_AM.png\">      <figcaption>Messaged posted on Triolan ISP website (translation via Google)</figcaption>  </figure></div><p id=\"388BLa\">Triolan’s updates also noted that DNS servers — which send requests made to a human-readable URL like “theverge.com” towards the IP address of a website — were experiencing unstable operations in some areas. Customers were instructed to connect using the 1.1.1.1 or 8.8.8.8 services, public DNS resolvers provided by Cloudflare and Google, respectively.</p><p id=\"ot0bkr\">A Cloudflare spokesperson told <em>The Verge</em> that traffic monitoring showed Ukrainian internet services were largely operational but that connections from Kharkiv were disrupted.</p><p id=\"YWvNCS\">“The Internet continues to operate in Ukraine for the most part,” the spokesperson said. “We saw an increase in Internet use after 0330 UTC, perhaps indicating Ukrainians using the internet for news and information. Currently, we are seeing about 80 percent of the load we usually see in Ukraine. Traffic from Kharkiv seems to be about 50 percent below normal levels.”</p><div class=\"c-float-right\"><aside id=\"CKJR9I\"><q>“Traffic from Kharkiv seems to be about 50 percent below normal levels.”</q></aside></div><p id=\"55KmiN\">There are indications that the Kharkiv blackout began <a href=\"https://twitter.com/netblocks/status/1496708402755559424\">after explosions were heard in the area</a>, although it is unclear whether damage was inflicted on telecommunications infrastructure at the time. A blanket attempt to shut down internet access would likely involve similar targeted strikes against other ISPs across the country. </p><p id=\"Qrt2IV\">So far, Russian forces have conducted a number of air and ground strikes against strategic targets across Ukraine, <a href=\"https://news.sky.com/story/russia-ukraine-crisis-what-is-happening-and-where-after-full-scale-invasion-12550062\">hitting military command centers and transport hubs</a>, according to Ukrainian media; but no concentrated attack on telecommunications services has yet been reported.</p><p id=\"yRdFA5\">However, open internet advocates fear that the disruptions could herald a strategic intent to limit information flows from the region, based on previous incidents in which internet infrastructure has been targeted in active war zones. Felicia Anthonio, a campaigner for digital rights organization Access Now, pointed to the impact of internet shutdowns in other conflict zones around the world.</p><p id=\"t9gWgW\">“Internet infrastructure becomes a target in order to control the flow of information and gain or maintain power during conflict, as we witnessed through the destruction of Yemen’s telecom infrastructure due to Saudi-led airstrikes,” Anthonio told <em>The Verge</em>. “Internet shutdowns during times of crises, conflict, and unrest make it difficult for journalists and human rights defenders to get vital information in and out of these regions and for people to access crucial information that can impact their safety.”</p><div class=\"c-float-right\"><aside id=\"ntimPM\"><q>“Internet shutdowns during times of crises, conflict, and unrest make it difficult for journalists and human rights defenders to get vital information”</q></aside></div><p id=\"9n0u4x\">As Anthonio points out, blackouts have been used in military actions before. Only a month ago, a strike against the Yemeni port city of Hodeidah <a href=\"https://www.reuters.com/world/middle-east/yemenis-struggle-without-internet-third-day-after-air-strikes-2022-01-23/\">damaged undersea cables bringing internet to the country</a>, leaving almost all of the country without internet for at least three days. Elsewhere, shutdowns can be used as a tool of governments seeking to quash internal dissent: the highest number of shutdowns in 2020 took place in India, where the government cut internet services in the disputed Kashmir region <a href=\"https://www.aljazeera.com/news/2021/3/3/mapping-internet-shutdowns-around-the-world\">more than 100 times</a>.</p><p id=\"VjgeXQ\">If such a shutdown did take place, there’s little doubt it would benefit Russia, at least in the short term. As the invasion began, many researchers sharing user-generated video from the region on Twitter <a href=\"https://www.theverge.com/2022/2/23/22947769/twitter-osint-russia-ukraine-invasion-suspended-error\">found their accounts suspended</a>, an event that Twitter blamed on a moderation error. And if internet disruptions become widespread, the risk of human rights abuses grows, according to campaigners.</p><p id=\"9oiWDd\">“When the internet is shut down in times of crisis, we often receive reports of human rights violations perpetrated against the people by state and non-state actors,” said Anthonio. “But without internet access, it’s harder to corroborate — and that’s often the point.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CM4rbPHPv2tcYF-8dUPWoi-tRZM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268256/VRG_Illo_STK010_K_Radtke_Ukraine_Glitch.jpg",
  "description": "Ukrainian ISP Triolan has been most affected.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}