{
  "title": "Ukraine says it stopped a Russian cyberattack on its power grid",
  "url": "https://www.theverge.com/2022/4/13/23023854/ukraine-russian-cyber-attack-power-company-substation",
  "date": "2022-04-13T18:52:19.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/OdzfErp6vJintkablsB5KJ-7Prg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70745630/VRG_Illo_STK010_K_Radtke_Ukraine_laptop.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"fQniiS\">An attack on Ukraine’s power grid was foiled by cybersecurity analysts and officials, <a href=\"https://www.reuters.com/world/europe/russian-hackers-tried-sabotage-ukrainian-power-grid-officials-researchers-2022-04-12/\">as reported by <em>Reuters</em></a>. After investigating the methods and software used by the attackers, cybersecurity firm ESET says that it was likely carried out by a hacking group called Sandworm, which <a href=\"https://therecord.media/researchers-find-new-malware-variant-after-stopping-attack-on-ukrainian-energy-provider/\"><em>The Record</em> reports</a> allegedly has ties to the Russian government.</p><p id=\"xz0h85\">The group planned to shut down computers that controlled substations and infrastructure belonging to a particular power company, according to the <a href=\"https://cert-gov-ua.translate.goog/article/39518?_x_tr_sl=auto&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=wapp\">Computer Emergency Response Team of Ukraine</a> (or CERT-UA). The hackers meant to cut off power on April 8th while also wiping the computers that would be used to try and get the grid back online.</p><div class=\"c-float-right\"><aside id=\"JUrnPH\"><q>The attack involved malware that hasn’t been seen in the wild for years</q></aside></div><p id=\"ViBJ37\">This attempted attack involved a wide variety of malware, according to ESET, including the <a href=\"https://www.theverge.com/2022/3/14/22977873/ukraine-new-destructive-caddywiper-malware-eset\">recently discovered CaddyWiper</a>. ESET also found a new piece of malware, which it calls Industroyer2. The original Industroyer was used in a successful 2016 cyberattack that cut off power in parts of Kyiv, <a href=\"https://www.welivesecurity.com/2017/06/12/industroyer-biggest-threat-industrial-control-systems-since-stuxnet/\">according to the security firm</a>, probably by the same group behind this month’s foiled attack. Industroyer isn’t widely used by hackers — ESET notes that it’s only seen it used twice (earlier this month and in 2016), which implies that it’s written for very specific uses.</p><p id=\"JBCNSs\">CERT-UA says that the hackers were biding their time, initially breaching the company’s systems before March. ESET’s analysis shows that one of the main pieces of malware was compiled over two weeks before the attack was supposed to take place. </p><p id=\"1FiJtZ\">It’s unclear how the hackers initially got into the company’s network or how they gained access to the network that controls industrial equipment like the targeted substations. The analysis does show, however, that the hackers were planning on covering their tracks after the attack.</p><p id=\"dMH8wU\">Ukraine and its infrastructure have been <a href=\"https://www.theverge.com/2022/4/7/23013983/fake-ukrainian-surrender-messages-meta-threat-report\">targeted by hackers</a> since <a href=\"https://www.theverge.com/2022/3/8/22966892/ukraine-us-targeted-cyber-war-russia-invasion-google-phishing-energy\">before the Russian invasion</a> began. It’s likely that this won’t be the last attack on its power grid, but the country’s response to this incident shows that its cybersecurity defense strategy is capable of warding off complex attacks. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/qSGduW8lG0IrZzJS1ZpctJIIrYc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23283135/VRG_Illo_STK010_K_Radtke_Ukraine_laptop.jpg",
  "description": "Analysts found a new, highly targeted piece of malware.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}