{
  "title": "Ukraine legalizes cryptocurrency as it receives millions in crypto donations",
  "url": "https://www.theverge.com/2022/3/17/22982608/ukraine-crypotcurrency-sector-legalized-zelenskyy-signs-bill",
  "date": "2022-03-17T10:09:24.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uBrCblw43BRb0ipduRvp8LCA4JU=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70634522/VRG_Illo_STK010_K_Radtke_Russia_Crypto.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge, Icons by Shutterstock</figcaption>    </figure>  <p id=\"lF6S5p\">Ukrainian President Volodymyr Zelenskyy has signed into law a bill that <a href=\"https://www.kmu.gov.ua/en/news/ukrayina-legalizuvala-kriptosektor-prezident-pidpisav-profilnij-zakon\">effectively legalizes the cryptocurrency sector</a> in the country. The decision comes as Ukraine has received cryptocurrency donations worth tens of millions of dollars from individuals and groups hoping to help the country’s war effort against Russia. </p><p id=\"QH51M3\">The bill signed by Zelenskyy was approved by Ukraine’s parliament last month and “creates conditions for the launch of a legal market for virtual assets in Ukraine.” It allows Ukrainian banks to open accounts for crypto firms; appoints the National Bank of Ukraine and the National Commission on Securities and Stock Market as financial watchdogs for the sector; and, <a href=\"https://cointelegraph.com/news/ukraine-s-president-signs-law-establishing-regulatory-framework-for-crypto\">as reported by <em>CoinTelegraph</em></a>, means crypto exchanges and companies that handle other virtual assets will have to register with the government. The state says it will protect citizens’ cryptocurrency holdings with the same legal force as its fiat currency, the hryvnia.</p><div id=\"xKJPGd\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ukraine has legalized the crypto sector — <a href=\"https://twitter.com/ZelenskyyUa?ref_src=twsrc%5Etfw\">@ZelenskyyUa</a> signed a law. From now on foreign and Ukrainian cryptocurrencies exchanges will operate legally and banks will open accounts for crypto companies. It is an important step towards the development of the VA market in Ukraine. <a href=\"https://t.co/lqqO1J9r1k\">pic.twitter.com/lqqO1J9r1k</a></p>— Міністерство цифрової трансформації України (@mintsyfra) <a href=\"https://twitter.com/mintsyfra/status/1504111930251882500?ref_src=twsrc%5Etfw\">March 16, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"9VmTSQ\">In a post <a href=\"https://t.me/zedigital/1368\">shared on Telegram</a>, Ukraine’s Vice Prime Minister and Minister of Digital Transformation, Mykhailo Fedorov, said the law would “bring the cryptosector out of the shadows.” (Translation via Google Translate.)</p><p id=\"RSQvWX\">“With the beginning of the war, cryptocurrencies became a powerful tool for attracting additional funding to support the Armed Forces of Ukraine,” wrote Fedorov. “In more than three weeks of war, the Crypto Fund of Ukraine has raised more than $54 million in cryptocurrencies.” (Other outlets have reported that the government has <a href=\"https://www.coindesk.com/business/2022/03/09/ukraine-has-received-close-to-100-million-in-crypto-donations/\">received close to $100 million in crypto donations</a>.) </p><p id=\"EfPfTa\">Cryptocurrency is <a href=\"https://www.vox.com/recode/22955381/russia-ukraine-bitcoin-donation-war-crypto\">playing a significant role</a> in the war between Russia and Ukraine. As well as being a prime vector for donations to Ukraine, it’s been seen as a possible lifeline for Russians hit by financial sanctions. Ordinary Ukrainians have also been buying up crypto assets in increasing numbers, with trading on domestic exchange Kuna <a href=\"https://decrypt.co/93827/crypto-exchange-volumes-in-ukraine-spike-as-currency-controls-introduced\">surging 200 percent</a> following the country’s invasion by neighboring Russia. Swapping virtual assets for fiat to carry out purchases is still often necessary and difficult, but legal recognition of the crypto sector should help ameliorate some of these problems.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/xrGe6zvgS6zGUEu_VZc9kBpLZVI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23283134/VRG_Illo_STK010_K_Radtke_Russia_Crypto.jpg",
  "description": "Ukraine welcomes the crypto sector as donations flood in",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}