{
  "title": "Ukrainian defense ministry hit by DDoS during tense standoff with Russia",
  "url": "https://www.theverge.com/2022/2/15/22936192/ukraine-defense-ministry-ddos-russia-conflict-de-escalation",
  "date": "2022-02-15T22:40:36.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/g0iXB-7OXatil3rKlBMmkIuMuSc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70514381/acastro_180109_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"dWh1Re\">On Tuesday, Ukraine’s Ministry of Defence suffered from a DDoS attack that prevented users from accessing its website, and two Ukrainian banks lost access to online banking services, according to statements from the government.</p><p id=\"fHn6Nz\">In a <a href=\"https://twitter.com/DefenceU/status/1493628291844083723\">tweet</a> posted at around 7PM local time (12PM ET), the Ukrainian Ministry of Defence said that its website was probably being hit with a DDoS attack and that work to restore service was underway. Four hours later, the site still could not be accessed.</p><div class=\"c-float-right\"><aside id=\"0HSXJ0\"><q>PrivatBank faced a “massive DDoS attack” that blocked online banking services, including payments and balance inquiries</q></aside></div><p id=\"cc1rJR\">The DDoS attack comes as Russia has claimed to be de-escalating potential conflict by withdrawing troops from the Ukraine border — a statement that was <a href=\"https://www.washingtonpost.com/world/2022/02/15/ukraine-russia-nato-putin-germany/\">met with “cautious optimism” by NATO</a> but has also faced skepticism amid a series of contradictory signals from the Russian military.</p><p id=\"9ofpfO\">At the same time, two banks also suffered from a denial-of-service attack that took ATMs offline and prevented some clients from withdrawing or transferring funds online.</p><p id=\"O6yJLm\">According to a <a href=\"https://spravdi.gov.ua/uvaga-zhodnoyi-zagrozy-dlya-koshtiv-vkladnykiv-pryvatbanku-nemaye/\">statement</a> from the Ukrainian government’s Center for Strategic Communications, PrivatBank faced a “massive DDoS attack” that blocked many online banking services, including payments and balance inquiries, but did not affect core banking services or threaten customer funds. Oschadbank also lost all online banking functionality, according to the statement. A few hours later, another statement from the Ukrainian government said that the banks had resumed online service.</p><p id=\"qXUvyW\">The cyberattack has still not been attributed to a specific actor by the Ukrainian government or US officials, although in light of the ongoing military situation, many suspect Russian involvement.</p><p id=\"wysLOh\">Opinions are divided on whether today’s attacks — which are relatively commonplace in terms of Russia–Ukraine relations — represent a precursor to military activity or a return to normalcy. Matt Tait, a security analyst known by the moniker pwnallthethings, <a href=\"https://twitter.com/pwnallthethings/status/1493658790666854402\">tweeted that</a> the DDoS was not “part of the invasion” and urged caution in reporting.</p><p id=\"0j9nCe\">Other sources in the cybersecurity industry similarly downplayed the severity of the attack. “We can confirm the DDOS attacks but do not see any indication that their impact is critical...this activity could be to keep a sense of pressure on Ukraine in the face of more positive news over the past day,” said Cisco’s director of threat intelligence Matthew Olney, <a href=\"https://twitter.com/KimZetter/status/1493679728825298945\">per a tweet</a> shared by cybersecurity journalist Kim Zetter. </p><p id=\"olTAwB\">But according to reports in <em>The</em> <em>Washington Post</em>, recently declassified intelligence suggests that Russian government hackers are likely to have already <a href=\"https://www.washingtonpost.com/national-security/2022/02/15/russia-ukraine-cyber-attacks/\">compromised critical Ukrainian infrastructure</a> and would unleash much more damaging attacks in the event of an invasion.</p><p id=\"si5qny\">The <em>Post</em>’s report cites an official familiar with the intelligence documents to claim that Russia would be able to disrupt services like electricity, transport, finance, and telecommunications, either in direct support of military operations or to create a sense of panic that would destabilize the country.</p><p id=\"Y6B15l\">Reached by email, a representative of the Cybersecurity and Infrastructure Security Agency (CISA) declined to provide a statement on the situation but directed <em>The Verge</em> to an <a href=\"https://www.cisa.gov/shields-up\">information page</a> detailing preparedness measures being taken to reduce the likelihood of a Russian cyberattack against the US.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EN5rNlX7CHRVFv0Kueof6708x0E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10005783/acastro_180109_1777_0001.jpg",
  "description": "NATO met Russian claims of de-escalation with \"cautious optimism\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}