{
  "title": "Ukrainian influencers bring the frontlines to TikTok",
  "url": "https://www.theverge.com/c/22971491/ukraine-tiktok-influencers-russian-invasion",
  "date": "2022-03-16T15:45:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xiR2Ycf7-ms4AevC9tAv06lF0uQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70630394/acastro_220310_5078_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p></p><p id=\"kpBwU7\">Weeks ago, Ukraine-based influencer Kristina Korban’s TikTok was a steady stream of gym motivation and personal finance tips punctuated by trending audio. In bold title text, she told her followers to “STAY CONSISTENT” and “DO WHAT MAKES YOU HAPPY!” Aside from one lighthearted reference to the escalating situation with Russia, Korban’s page stayed on message: “YOU CAN BE AN INVESTOR.”</p><p id=\"KdvhTl\">Then, on February 23rd, the facade of normalcy fell apart. In a video that’s been viewed more than 9 million times, the Kyiv-based influencer recorded herself from bed, describing explosions in the distance that rattled her home. “This might be the beginning of something serious,” she says. </p><p id=\"XY0QWv\">For weeks, TikTok users have <a href=\"https://www.washingtonpost.com/world/2022/02/11/russia-ukraine-military-videos-tiktok/\">watched</a> Russian troops and military vehicles on the move through bite-sized clips often lacking context or verification. When Russian President Vladimir Putin launched a full-scale invasion, TikTok feeds were littered with <a href=\"https://www.nbcnews.com/politics/politics-news/live-blog/russia-ukraine-conflict-live-updates-n1289655/ncrd1289789#blogHeader\">bogus live streams</a> with siren and gunshot audio dubbed over. The White House has attempted to intervene too, even hosting a background briefing with popular TikTokkers during which officials answered questions and shared White House talking points, according to audio obtained by the <a href=\"https://www.washingtonpost.com/technology/2022/03/11/tik-tok-ukraine-white-house/\"><em>Washington Post</em></a>.</p><p id=\"1g8RWr\">Now, along with misinformation researchers and war correspondents, influencers with Ukrainian ties are becoming a go-to source for war updates. The sudden shift from travel blogging, crypto advice, and anime cosplay to frontline dispatch is jarring to observe. But the dynamics between influencer, followers, and content flow are as familiar as ever.</p><p id=\"6b8sLb\">Since her first update post, Kristina Korban’s TikTok has transformed into a firsthand view of the country’s capital during wartime, sandwiched on the For You page between makeup tutorials and celebrity fancam clips. She posts and goes live daily to her more than half a million TikTok followers, updating viewers on everything from her family’s food inventory and grocery store lines to air raid sirens in the city. </p><div id=\"sXo4PN\"><section class=\"ad\">    <div class=\"ad__inner\">      <div class=\"ad-placemarker-athena\"></div>      <div class=\"ad-placemarker-athena-mobile\"></div>    </div>  </section></div><p id=\"zERbgV\">“I believe there is a lot of chaos when people receive wrong information, so I do my best to be as honest and factual as I can with the knowledge that I possess and learn as we go through this day by day,” Korban tells <em>The Verge</em>, communicating over WhatsApp. “I aim to provide at least a little bit of clarity for those that trust in me. I feel it is my duty.”</p><p id=\"NBTnVB\">Korban’s videos about the war have become a go-to source for people outside of Ukraine who didn’t know much — if anything — about the country until a few weeks ago. Every hour of the day, someone is asking Korban if she and her family are safe. </p><p id=\"J4r2FH\">This week, followers feared the worst when Korban didn’t post any TikTok updates for over a day. In fact, @moneykristina had been blocked from posting new TikToks after multiple videos were found to be in violation of community guidelines. (Ever the professional, Korban had already set up <a href=\"https://www.tiktok.com/@kristinakorbs\">a backup account</a> to use if she got banned, where she continued to post updates). </p><p id=\"Z9uLHE\">In one video shared with <em>The Verge, </em>Korban is filming in the dark, visibly scared and crying, as explosions echo in the distance; Korban says the clip was removed for “graphic content.” In <a href=\"https://vm.tiktok.com/ZTdy7MCgL/\">another video</a>, Korban jokingly celebrates International Women’s Day: what Ukrainian women <em>really </em>want is tanks, bullets, and fighter jets. Korban says TikTok removed the video without an explanation. (According to TikTok spokesperson Jamie Favazza, @moneykristina’s ability to post new videos is back as of Monday, and three videos that were incorrectly removed by a moderator have since been restored.)</p><p id=\"1hejnd\">One of Korban’s more than 600,000 TikTok followers is Katie Callaway, a stay-at-home mom in Massachusetts. She didn’t know much about Ukraine before the war began — a cultural blindspot she now deeply regrets. But since following Korban at the beginning of the invasion, Callaway says her eyes have been opened.</p><p id=\"ExwdOA\">“It’s <em>beautiful</em>,” she says of Ukraine. “I had no idea, and that really saddens me that I didn’t even know anything about the country before. Now all of this insane craziness is going on.”</p><p id=\"VzZDdA\">Though Callaway has only followed Korban for a few weeks, she speaks of her like she’s known her for years. They’re both mothers, for one, and Callaway thinks of the unfathomable strength that must be required to stay steady for your child in times of stress. She finds Korban to be intelligent, endearing, and real, and she worries and prays for her like you might a friend — in other words, something very close to a traditional influencer-follower relationship.</p><p id=\"ZqQCgg\">“It’s just so stressful,” Callaway says, fighting back tears. “I feel so much for her and this country and the people, and it’s just so heartbreaking, and I hate what’s going on.” </p><p id=\"MhkSZH\">Korban’s years of experience creating content for social media platforms has, in a morbid way, served her well in this inadvertent role as an unconventional war correspondent. Her videos are shot selfie-style, mimicking the intimacy of a one-to-one video call, and rarely show her surroundings — as if Korban is there to talk just to you. She regularly goes on TikTok Live with family members, answering questions, cracking jokes, and hanging out with viewers. Even when discussing curfews and going into hiding, she uses popular audio clips, hashtags, and filters that can make it easier for people to find her content. She’s made merch, too: Korban has sold nearly 2,000 <a href=\"https://www.bonfire.com/10851072109310911081/\">pro-Ukraine</a> T-shirts and hoodies that fans can sport to show whose side they’re on. (They say “fuck off” in Ukrainian, a reference to <a href=\"https://twitter.com/yamphoto/status/1498722170964373509\">signs</a> and <a href=\"https://www.cnn.com/2022/02/25/europe/ukraine-russia-snake-island-attack-intl-hnk-ml/index.html\">words of defiance</a> by Ukrainian soldiers.) Korban says profits will benefit Ukrainians affected by the war.</p><p></p><p id=\"sEU2ee\">“I’ve always been very open and willing to share my opinions and experiences,” Korban says. “I don’t fear criticism — it comes with the territory.”</p><p id=\"879cMx\">And it did. As her TikTok following was ballooning, Korban set up a fundraising campaign called “<a href=\"https://chuffed.org/project/help-ukrainians-in-need-impacted-by-war\">Help Ukrainians in Need Impacted by War</a>” with a $1 million goal. (She’s raised just over $28,000 so far.) Korban says she is personally organizing the distribution of funds with the assistance of local governments and businesses. But skeptics abound in the comments of the video announcing the donation drive. Who will the money go to? How will Korban disburse the funds? And why, commenters ask, should we trust someone whose previous brand was finance, crypto, and investing, and whose handle is @moneykristina? </p><p id=\"kBgpJX\">Callaway gets most of her Ukraine news from TikTokkers like Korban and from Newsmax TV and tries to check the legitimacy of videos she encounters — she’s seen the fake TikTok Lives, watching as paid gifts pour in for users pretending to stream from Ukraine. With Korban, though, the trust runs deep: Callaway plans to donate to the fundraiser and buy the merch, and would love to visit Ukraine one day.</p><p id=\"fGLn82\">“I just get a really good feeling about people,” Callaway says. </p><p id=\"e7eKre\">Bethany Hibbett, a recruiter for a consulting firm living in St. Louis, also felt drawn to Korban almost immediately. Hibbett typically doesn’t use the app for current events — she’s selective about who she follows and mostly watches funny videos or career-related content. But she followed Korban instantly after seeing her first video about the war.</p><p id=\"L5sSEr\">“It felt like I was getting to see something more personal and more real and relatable than something that’s on the news where it’s more generalized,” Hibbett says. She used to be a regular NPR listener but fell off when she began working from home, especially as she tired of negative news in the lead-up to the 2020 election.</p><p id=\"tBOYsJ\">Soon after following Korban, Hibbett found herself waking up in the middle of the night to check for her updates and getting worried when she hadn’t posted. Though she typically isn’t the type of person to be active in comment sections, Hibbett commented on Korban’s Instagram post, checking in on how she was doing. Following Korban has imbued Hibbett with a new sense of responsibility — she wants to be present and up-to-date with what’s happening in Ukraine.</p><div id=\"QrJUoD\"><section class=\"ad\">    <div class=\"ad__inner\">      <div class=\"ad-placemarker-athena\"></div>      <div class=\"ad-placemarker-athena-mobile\"></div>    </div>  </section></div><p id=\"ODUO1j\">“I definitely didn’t have any opinion before [about Ukraine],” Hibbett says. “I think that Ukrainian people are resilient and strong, and I want to do anything I can to help.”</p><p id=\"QEogWR\">For Americans like Callaway and Hibbett, TikTok has become one of the main ways to hear about the war and rally behind Ukrainians, who are quick to express gratitude for the support. </p><p id=\"BNiCX5\">Russian state-controlled or affiliated accounts have successfully used the platform to spread Kremlin propaganda and disinformation, according to <a href=\"https://www.isdglobal.org/digital_dispatches/propaganda-russia-state-controlled-media-flood-tiktok-with-ukraine-disinformation/\">a report</a> by the Institute for Strategic Dialogue, a London-based think tank studying extremism. According to ISD, organized disinformation framing Ukraine as the aggressor and its soldiers and politicians as Nazis garnered millions of views on TikTok prior to March 4th, when the report was published.</p><p id=\"ztUzNe\">Individual influencers, too, have posted TikToks justifying Russian invasion. A viral <a href=\"https://www.instagram.com/p/Cak_L5tqa7g/\">compilation</a> shows influencers reading from the same script, including saying that “<a href=\"https://www.atlanticcouncil.org/blogs/new-atlanticist/russian-hybrid-war-report-social-platforms-crack-down-on-kremlin-media-as-kremlin-demands-compliance/#:~:text=a%20second%20wave%20appeared\">Russia wants to bring peace</a>.” An investigation by <em>Vice News </em>found that some Russian TikTok influencers were <a href=\"https://www.vice.com/en/article/epxken/russian-tiktok-influencers-paid-propaganda\">offered money</a> in exchange for making pro-Russia propaganda, though it’s unclear who was funding and organizing it.</p><p id=\"54Kojk\">TikTok has responded: the company announced it would begin <a href=\"https://www.theverge.com/2022/3/4/22962289/tiktok-misinformation-state-media-labels-rollout-russia-ukraine\">adding labels</a> to videos from some state-controlled media outlets, expediting the state media policy in response to the invasion of Ukraine. On March 6th, the company said it would <a href=\"https://www.theverge.com/2022/3/6/22964418/tiktok-suspends-creation-new-video-content-russia-ukraine\">suspend</a> livestreams and new uploads in Russia.</p><p></p><p id=\"G319eE\">But wading through TikTok to find Ukraine content without a point of view is difficult, and moderating opinions for accuracy is perhaps even harder. Viral videos from Ukrainians are crafted to appeal to viewers’ most basic human instincts of compassion, anger, and fear and have successfully mobilized people to donate to the Ukrainian military, advocate for Russian sanctions, and even go to Ukraine to fight themselves. </p><p id=\"VbIiyz\">Passionate, albeit slanted, appeals for viewers to care about war inflicted on civilians don’t compare to disinformation designed to justify an invasion. Besides, how can one stay neutral while their city is bombed or their family is stranded? But individual experiences and perspectives can have a powerful effect on public perception, even when laced with half-truths, opinion, or misleading but convenient narratives. </p><p id=\"TnETGA\">The Ghost of Kyiv, a supposed military hero heralded by the Ukrainian government and individual creators, is a <a href=\"https://www.tiktok.com/@moneykristina/video/7070232212758711595\">popular subject</a> of pro-Ukraine TikToks. He also may be an example of Ukrainian <a href=\"https://www.nytimes.com/2022/03/03/technology/ukraine-war-misinfo.html\">propaganda</a>, fabricated to boost morale. </p><p id=\"F7TCkr\">But that hasn’t stopped this pro-Ukraine narrative from taking hold around the world. #Ghostofkyiv currently has over 325 million views on TikTok, and Korban’s most recent TikTok about the mysterious soldier is flooded with supportive comments: “Ukrainian soldiers are a different breed of human,” “Is he single? Asking for a friend.”</p><p id=\"nNggMy\">One viewer questions the veracity of the fighter, pointing out that too much of his story has been debunked to be believable. Korban jumped in to respond diplomatically, a skill honed through years of building digital relationships. </p><p id=\"wgUZ8n\">“It’s up to each individual what they believe :)”</p><hr class=\"p-entry-hr\" id=\"jmkTDS\"><p id=\"kQ8ORY\">Not every account resembles the earnest, slice-of-life style of Korban’s TikTok. In fact, the tones range wildly, from purely informative to entirely meme-like.</p><p id=\"8eiWjm\">A Ukrainian TikTokker and musician who goes by @fesch6 posted an anime cosplay video the week of the invasion and checked in hours later, saying, “I’m safe for now, but don’t know for how long!” A dancing video posted the day after attempts to bring levity to the situation: “This is me staying in Ukraine and don’t know what will kill me first: 1. C0VID 2. W@R 3. Or my panic attacks,” the text reads. (The video has since been deleted.) She followed it up the next day with a spicy noodle tasting video, apparently prerecorded. </p><p id=\"eWkEPh\">Valeriya Denga, a Russian and Ukrainian TikTokker based in New York, previously made fashion and “get ready with me” videos and content referencing her Slavic heritage, like a vlog titled, “Get ready with a Russian girl,” and a video montage of her Ukrainian mother with the text, “You were raised by Karens, I was raised by Iryna.”  </p><div id=\"fCBmLr\"><section class=\"ad\">    <div class=\"ad__inner\">      <div class=\"ad-placemarker-athena\"></div>      <div class=\"ad-placemarker-athena-mobile\"></div>    </div>  </section></div><p id=\"WYkoBR\">On February 24th, Denga posted an <a href=\"https://www.tiktok.com/@valeriyadenga/video/7068880330207333675?is_copy_url=1&amp;is_from_webapp=v1\">emotional video</a> about her grandmother, who was still in Ukraine, unwilling to leave — and possibly lose — her land and home. In the week following, Denga continued to share stories about her family’s experience and other Ukraine-related content.</p><p id=\"eLWVdm\">“It makes me not want to be an influencer,” Denga says of the war in Ukraine. “I feel like I’m posting about stupid things, about fashion, or consumerist things in America. In Ukraine, we don’t value those things.”</p><p id=\"lARfoU\">After hundreds of thousands of views on her video and messages of support, Denga created a GoFundMe drive to raise $16,000 to be used to secure housing for her grandmother in New York. But after some backlash — not to mention her own conflicting feelings — she paused the fundraiser.</p><p id=\"7NNkYp\">The war in Ukraine has prompted Denga to reconsider her brand and the relationship she has with followers. Instead of posting outfit videos, for example, Denga says she wants to start focusing on building more of a community with her fans with NFTs. She also wants to create her own cryptocurrency to fundraise for aid and rebuilding in Ukraine, which has <a href=\"https://www.theverge.com/2022/2/26/22952357/ukraine-bitcoin-ethereum-donation-vitalik-buterin\">embraced</a> crypto donations.  </p><p id=\"Z04l1j\">The people going viral with Ukraine content aren’t necessarily those with large preexisting followings. Marta Vasyuta was on a three-week-long trip visiting friends in London when Putin announced a “special military operation” in Ukraine. That night, Vasyuta pulled a video from Telegram, a messaging app popular with Ukrainians, showing an empty street in Kharkiv with explosions echoing outside. She uploaded it to her TikTok account with just 400 followers that, at the time, was mostly filled with study abroad updates and slow panning clips of London.</p><p></p><p id=\"aPwjvx\">Vasyuta was thrilled when her video reached 20,000 views later that night. A second video she posted shortly after, showing <a href=\"https://www.nytimes.com/live/2022/02/24/world/russia-attacks-ukraine/videos-show-a-large-explosion-in-the-sky-over-southern-kyiv\">an explosion in the sky</a> over Kyiv with an MGMT song added over the footage, reached millions within hours; it’s since been viewed more than 50 million times.</p><p id=\"xPNRbq\">“I’m not Western media, I’m not Eastern media,” Vasyuta says. “I’m just a basic Ukrainian, which makes it easier for people to believe me.”</p><p id=\"PzeYSO\">Vasyuta gets most of her video clips from Telegram or her family in Ukraine, acting as a first filter before uploading them to a global TikTok audience. She says she verifies them by cross-referencing clips and news between multiple channels and began adding timestamps and locations to videos to fend off distrustful commenters. But it’s an imperfect system.</p><p id=\"dW2FvZ\">In early March, some social media users speculated that Putin was green-screened into a video because his hand appears to go through a microphone stand. After comparing the clip to a high-quality version on YouTube, <a href=\"https://twitter.com/Shayan86/status/1500214745718312975\">journalists</a> <a href=\"https://www.motherjones.com/politics/2022/03/no-that-putin-video-didnt-use-a-green-screen-misinformation/\">debunked</a> the claim, attributing it instead to video compression that affected the quality. Still, Vasyuta’s TikTok of the video has been viewed 9.1 million times, and she says she doesn’t intend to remove it. “I’ve seen that too,” she said of the debunking in an email. “But [that’s] not the only part of [the] video that have looked photoshopped.”</p><div id=\"vorAve\"><section class=\"ad\">    <div class=\"ad__inner\">      <div class=\"ad-placemarker-athena\"></div>      <div class=\"ad-placemarker-athena-mobile\"></div>    </div>  </section></div><p id=\"C1q8ms\">Vasyuta didn’t ask for a war in her country. But being an average Ukrainian documenting the conflict has proven to be an effective way of reaching people around the world and holding their attention. Another TikTokker, @valerisssh, was only getting a few hundred likes on videos about photography in January. Now, her TikToks filmed from <a href=\"https://www.tiktok.com/@valerisssh/video/7071270332891483397?is_copy_url=1&amp;is_from_webapp=v1&amp;lang=en\">bomb shelters</a> and <a href=\"https://www.tiktok.com/@valerisssh/video/7072136644350070022?is_copy_url=1&amp;is_from_webapp=v1&amp;lang=en\">destroyed buildings</a> rack up millions of views, regularly going viral.</p><p id=\"3iLzxC\">Though her following has grown to more than 260,000, Vasyuta hasn’t yet set up a fundraiser, launched merchandise, or developed a cryptocurrency with her newfound influence. If anything, it’s made her more cautious about what she posts, consulting with friends before sharing new content. Right now, Vasyuta’s goal is more modest: to spread awareness of what’s happening in Ukraine. </p><p id=\"TYqUAm\">For viewers, the war TikToks that are the most gripping are often the most personal, whether it’s the story of the <a href=\"https://www.tiktok.com/@ianukraine/video/7069365671263603973?_d=secCgYIASAHKAESPgo84svNrzHlJFs0CSRd0ofk6IbNl1eCnr%2FpQ4u8c6ACp7eYYE1Nnw7%2BsqQZzys8OR5K%2FU8Qcw60fNWvSq9DGgA%3D&amp;_r=1&amp;checksum=8ba1c55f56d00ff4df10cad81255e1faa8074b5a19b6fde702054028b83dfae8&amp;language=en&amp;preview_pb=0&amp;sec_user_id=MS4wLjABAAAAwm0WRGyGdizTvgkz3ptZpEcVFJff_UxXCp8bZWjZrKS5rqoLxbOGkVAWsJ51O2Gf&amp;share_app_id=1233&amp;share_item_id=7069365671263603973&amp;share_link_id=D9C40D59-F783-412E-8885-2CC7EA8A21AF&amp;social_sharing=v2&amp;source=h5_m&amp;timestamp=1646752252&amp;tt_from=copy&amp;u_code=d97igc3kk3b16i&amp;user_id=6757149442048803845&amp;utm_campaign=client_share&amp;utm_medium=ios&amp;utm_source=copy\">British father</a> who traveled to Ukraine to rescue his wife and child or dispatches from Korban on how her daughter is adjusting to living with extended family. Vasyuta’s TikTok bio reads, “I show footages of real people.” But through her collection of disparate scenes and subjects, Vasyuta’s own story remains mostly obscured — no hero’s journey to follow or daily vlogs to tune into.</p><p id=\"aFTa8r\">Vasuyta says she would like to see more coverage and resources for people like her who, by some accident, ended up outside of Ukraine when the country was invaded. She’s currently staying with friends but will likely need to find her own housing soon. It’s unclear when she will see her family again or if she’ll be able to return home.</p><p id=\"I5vFfV\">“Every day, I remind myself how when I was leaving from the airport, I told my parents, ‘Why are you crying?’” Vasuyta says. “‘I’m only leaving for two weeks.’”</p><p id=\"luWXin\">Now, her view into this crisis, both acute and distant, is through calls and texts, along with the video clips that make it onto her TikTok. In one uploaded recently, a pianist plays outside a train station, snow falling gently on Ukrainians fleeing their country. </p><p id=\"CAsP43\">“This video was captured 05th of March 2022 at Lviv Train station,” a comment reads. It comes from Vasyuta’s father, who had recorded it and sent it to his daughter.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3FlgOI_cE_wC4_ZQmP_p16nY808=/138x217:1902x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23306511/acastro_220310_5078_0002.jpg",
  "description": "The Russian invasion is turning crypto and fashion accounts into war correspondents.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}