{
  "title": "US nuclear power plants contain dangerous counterfeit parts, report finds ",
  "url": "https://www.theverge.com/2022/2/11/22929255/us-nuclear-power-plants-dangerous-counterfeit-parts-nrc-report",
  "date": "2022-02-11T20:52:09.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Nuclear power plant in northern California\" src=\"https://cdn.vox-cdn.com/thumbor/Pu05GALq4UkAfYopez-Lk3cNRy4=/0x0:4961x3307/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70499548/564091369.0.jpg\" />        <figcaption>UNITED STATES - NOVEMBER 28: Nuclear power plant in northern California | Photo by Carol M. Highsmith/Buyenlarge/Getty Images</figcaption>    </figure>  <p id=\"a2cYNJ\">At least some nuclear power plants in the US contain counterfeit parts that could pose significant risks, an investigation by the inspector general’s office of the Nuclear Regulatory Commission has found. Those parts “present nuclear safety and security concerns that could have serious consequences,” says the resulting <a href=\"https://www.nrc.gov/docs/ML2204/ML22040A111.pdf\">report</a> published on February 9th.  </p><p id=\"K76O7i\">While concerns about safety and nuclear waste have vexed the nuclear power industry for decades, the new findings come amidst growing enthusiasm for nuclear energy as a carbon-free power source that can help nations meet their climate goals. </p><p id=\"m2gltA\">The investigation was conducted after unnamed individuals alleged that “most, if not all,” nuclear plants in the US have fake or faulty parts. The inspector general’s office uncovered problems with counterfeit parts at a few different plants as part of its investigation. The report also says that the DOE had separately flagged 100 “incidents” involving counterfeit parts just last year. It’s a problem that the US will have to crack down on if it moves forward with plans to include nuclear power in its transition to clean energy. Without greater oversight at the NRC, the report warns, the risk of counterfeit parts going unnoticed in the nation’s nuclear power plants could rise.  </p><div class=\"c-float-right\"><aside id=\"XtPJga\"><q>100 “incidents” involving counterfeit parts just last year </q></aside></div><p id=\"4JXLQZ\">As part of its inquiry, the inspector general’s office looked for parts that are illegally altered to look like legitimate products, parts that are “intentionally misrepresented to deceive,” and parts that don’t meet product specifications. It sampled four power plants across the US and found evidence of counterfeit parts at one of those plants in the midwest. It also points to nuclear power plants in the Northeast, separate from those it sampled,<strong> </strong>where a “well-placed NRC principal” found that counterfeit parts were involved in two separate component failures.</p><p id=\"BNI4FQ\">The first failure identified by the NRC principal was a water pump shaft used for emergency service that snapped soon after being installed. At a separate plant in the Northeast, temperature monitors in “safety-related areas” that are used to identify steam line breaks suddenly failed “at a significantly increased rate.” Prior to that failure, some of the instruments had been repaired using defective parts.</p><p id=\"dFRVoP\">The NRC might be underestimating the prevalence of counterfeit parts, the report warns, because the regulatory agency doesn’t have a robust system in place for tracking problematic parts. It only requires plants to report counterfeits in extraordinary circumstances, like if they lead to an emergency shutdown of a reactor. The report also notes that the NRC hasn’t thoroughly investigated all counterfeit allegations. There were <a href=\"https://www.eia.gov/tools/faqs/faq.php?id=207&amp;t=3#:~:text=As%20of%20September%201%2C%202021,3%20plants%20have%20three%20reactors.\">55</a> nuclear power plants operating in the US as of September 2021, and the inspector general’s office sampled just four for its report.</p><p id=\"j5KHxW\">NRC Public Affairs Officer Scott Burnell told <em>The Verge</em> in an email that “nothing in the report suggests an immediate safety concern. The NRC’s office of the Executive Director for Operations is thoroughly reviewing the report and will direct the agency’s program offices to take appropriate action.”</p><p id=\"uZC2FE\">Other groups, including the Electric Power Research Institute and the International Atomic Energy Agency (IAEA), have also identified counterfeit valves, bearings, circuit breakers, pipe fittings, and structural steel in nuclear power plants in the US and abroad in recent years. They’re a growing problem across the nuclear power sector and other industries worldwide, notes a 2019 IAEA <a href=\"https://www.iaea.org/publications/11182/managing-counterfeit-and-fraudulent-items-in-the-nuclear-industry\">report</a>.</p><p id=\"dsWBlK\">The debate over whether to ramp up or tamp down nuclear energy is escalating as countries make new pledges to combat climate change. The EU recently made a <a href=\"https://www.theverge.com/2022/2/2/22914195/eu-nuclear-energy-gas-sustainable-climate-investment\">controversial proposal</a> to classify nuclear energy as a sustainable investment, dividing members of the bloc. While Germany plans to retire all of its remaining nuclear generators this year over safety concerns, France — which already relies on nuclear energy for more of its electricity than any other country in the world — said yesterday that it would build <a href=\"https://www.nytimes.com/2022/02/10/world/europe/france-macron-nuclear-power.html\">14 new reactors</a>.</p><p id=\"8lMsON\">Today, the US Department of Energy <a href=\"https://www.energy.gov/articles/doe-establishes-6-billion-program-preserve-americas-clean-nuclear-energy-infrastructure\">called for public input</a> on a new $6 billion program to keep aging nuclear actors online. The bipartisan infrastructure law funds the program, which also plays into the Biden administration’s aim of achieving a 100 percent clean energy grid by 2035.</p><p id=\"6kcYjT\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/oQG378oUHbDNFfF9jN6GaUcpVS4=/0x356:4961x2953/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23236074/564091369.jpg",
  "description": "It further complicates the environmental debate over nuclear energy.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}