{
  "title": "US punishes Blender.io for helping North Korea launder millions in stolen Axie crypto",
  "url": "https://www.theverge.com/2022/5/6/23060544/us-treasury-blender-io-sanctions-bitcoin-mixer",
  "date": "2022-05-06T22:54:20.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/e_gujkgihywm4w3LVebZkJuNE9s=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70841756/acastro_170726_1777_0008.0.jpg\" />        <figcaption><em>It says the Lazarus Group funneled around $20 million through the service.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"JqaoEl\">The US Treasury Department <a href=\"https://home.treasury.gov/news/press-releases/jy0768\">announced on Friday</a> that it’s sanctioning Blender.io, essentially cutting the Bitcoin mixer off from the US financial system (legally speaking, anyway). The department alleges that the service, which lets people obfuscate the record usually kept by the blockchain, was used by North Korea to “support its malicious cyber activities and money-laundering of stolen virtual currency.” </p><p id=\"hlwnOS\">According to the Treasury’s press release, Blender.io was used by the Lazarus hacking group to launder $20.5 million worth of the cryptocurrency it allegedly stole from the crypto-based game <em>Axie Infinity</em>. The entire proceeds of the hack, which the Treasury <a href=\"https://www.theverge.com/2022/4/14/23025739/north-korean-hacker-lazarus-axie-infinity-cryptocurrency-hack-theft-us-blames\">linked to Lazarus and North Korea in April</a>, were estimated to be worth <a href=\"https://www.theverge.com/2022/3/29/23001620/sky-mavis-axie-infinity-ronin-blockchain-validation-defi-hack-nft\">around $625 million at the time</a>, though a few million dollars worth of funds <a href=\"https://www.coindesk.com/business/2022/04/22/binance-recovers-58m-linked-to-axie-infinity-hack/\">have been recovered</a>. The Treasury says that Lazarus is sponsored by North Korea’s government and that the country uses hackers to “generate revenue for its unlawful weapons of mass destruction (WMD) and ballistic missile programs.”</p><p id=\"pcucVh\">The Treasury’s press release says this is the first time it’s ever levied sanctions against a virtual currency mixer. (It has done other crypto-related sanctions, though; notably, last year, it <a href=\"https://www.theverge.com/2021/9/21/22685930/treasury-sanctions-cryptocurrency-exchange-ransomware-colonial-pipeline\">issued its first sanction against an exchange</a>.) Blender.io wasn’t the only tool the hackers used, though — to start, the funds stolen from <em>Axie Infinity</em>’s Ronin network were originally in Ethereum and USDC, and Blender works with Bitcoin; at some point, there had to be a conversion. There are also reports that the hackers <a href=\"https://www.coindesk.com/tech/2022/04/13/ronin-exploiter-moved-21000-ether-to-tornado-cash-in-past-week/\">filtered some of the funds through Tornado Cash</a>, a service meant to make it harder to track transactions.</p><p id=\"Mx3h0z\">The US Treasury also alleges that Blender laundered money for ransomware organizations like <a href=\"https://www.theverge.com/2022/2/28/22955246/conti-ransomware-russia-ukraine-chat-logs-leaked\">Conti</a>, <a href=\"https://www.theverge.com/2021/6/5/22520499/justice-department-charges-latvian-helping-to-develop-trickbot-malware-ransomware\">Trickbot</a>, and <a href=\"https://www.theverge.com/2021/6/3/22466003/jbs-cyberattack-fbi-revil-sodinokibi-criminal-group\">Sodinokibi (aka REvil)</a>. Now that it’s sanctioned, it won’t be able to access any of its funds that were stored within the US, nor can it do <a href=\"https://home.treasury.gov/policy-issues/financial-sanctions/faqs/topic/1556\">transactions with American companies or citizens</a>. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tFWF8aSQYgklpmk3WhvozAjTZ1s=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23443291/Blender.io_flowchart.png\">      <cite>Image: US Department of the Treasury</cite>      <figcaption><em>The Treasury’s description of how Blender.io works.</em></figcaption>  </figure><p id=\"nI1Q41\">Blender and other mixers work by pooling together deposited funds, then randomly distributing them. Because transactions are recorded on the blockchain, it can be very difficult to use stolen funds without using these types of services. Stolen coins go into the blender, and the hackers will, in theory, get clean coins back. (And whoever ends up with the stolen coins can point back to the mixer, saying “Well, you can see I didn’t take them out of the wallet myself.”)</p><p id=\"40ChWX\">As happened with the <em>Axie</em> hack, governments can sanction wallets that are affiliated with hacking groups, and researchers can track stolen crypto’s movement. If criminals want to convert their ill-gotten crypto into, say, <a href=\"https://www.wired.com/story/alleged-russian-hacker-evil-corp-indicted/\">Lamborghinis</a>, they have to make sure that’s not being traced.</p><p id=\"alz57d\">Of course, as the Treasury points out, there are perfectly legal uses for this kind of service — people could use them to gain some semblance of privacy when making purchases with crypto, for instance. But with the department <a href=\"https://www.theverge.com/2021/10/15/22728765/us-treasury-ransomware-payout-numbers-reports-2021-first-half-cybercrime\">keeping such a close eye on crypto crimes</a>, it’s starting to feel like firms will have to be very careful about whose money they take and tumble.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9inLHdPYtMB1pyO936DAKt3d7b4=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8954807/acastro_170726_1777_0008.jpg",
  "description": "It alleges the firm laundered $20 million in stolen crypto.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}