{
  "title": "US prosecutors are going after crypto sanctions evasion",
  "url": "https://www.theverge.com/2022/5/16/23075302/us-justice-department-crypto-sanctions-criminal-prosecution-opinion",
  "date": "2022-05-16T18:25:12.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xB_wArzMW1vEiBNqRVIhuh5hBZc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70875414/acastro_181126_1777_bitcoin_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Vodd3Y\">The US Department of Justice is prosecuting the operator of a payment platform that flouted economic sanctions using cryptocurrency. <a href=\"https://www.washingtonpost.com/dc-md-va/2022/05/16/first-us-criminal-cryptocurrency-sanctions/\">As reported by <em>The Washington Post</em></a>, it’s possibly the first criminal prosecution of crypto-related sanctions evasion — underscoring both the technology’s potential for getting around financial blocks and its traceability by law enforcement.</p><p id=\"GBymn9\">District of Columbia Magistrate Judge Zia Faruqui revealed the prosecution’s existence <a href=\"https://www.dcd.uscourts.gov/sites/dcd/files/22mj00067CriminalOpinion.pdf\">in an opinion on a still-sealed case</a>, omitting the name of the payment platform as well as the “comprehensively sanctioned country” it dealt with. (There are <a href=\"https://ooc.usc.edu/international-activity/ofac/\">five such countries</a>: Iran, North Korea, Syria, Cuba, and Ukraine’s Crimea region.) The operator apparently used an exchange to purchase $10 million in Bitcoin and send it to the country on behalf of platform customers.</p><p id=\"E9ieux\">Faruqui supports guidance from the Office of Foreign Assets Control (OFAC), saying that virtual currency falls under economic sanctions. “The question is no longer whether virtual currency is here to stay,” he writes, “but instead whether fiat currency regulations will keep pace with frictionless and transparent payments on the blockchain.” Prosecuting criminal cases of willful violations matters particularly because OFAC could, in theory, go after parties that were unknowingly led into participating — like a crypto exchange that was used to buy the bitcoin — for civil violations.</p><div class=\"c-float-right\"><aside id=\"NqEwyc\"><q>“Sanctions do not apply to virtual currency? WRONG.”</q></aside></div><p id=\"Xjv2PM\">The opinion also emphasizes that crypto isn’t as anonymous as some users believe. The platform operator “did not hide the payments platform’s illegal activity. Defendant proudly stated the payments platform could circumvent US sanctions by facilitating payments via Bitcoin,” Faruqui writes. He suggests they were lulled into a false sense of security. “Virtual currency is traceable ... Yet like Jason Voorhees the myth of virtual currency’s anonymity refuses to die.”</p><p id=\"KA48oO\">Crypto has come to the forefront as a way to circumvent barriers in international commerce, particularly following Russia’s invasion of Ukraine earlier this year. (This practice can be complicated by <a href=\"https://www.theverge.com/2022/5/9/23064269/bitcoin-sell-plunge-crypto\">virtual currency’s extreme volatility</a>.) While Ukraine’s government took in millions of dollars via cryptocurrency donations, some <a href=\"https://www.theverge.com/2022/3/17/22982122/russia-youtube-crypto-creators-pay-ruble\">individual Russians turned to crypto</a> after their financial ties to the outside world were cut off.</p><p id=\"qsrf8y\">But Faruqui’s opinion seeks to throw cold water on criminal use of it. “Issue One: virtual currency is untraceable? WRONG,” he writes in a conclusion. “Issue Two: sanctions do not apply to virtual currency? WRONG.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/altkKN7BnaLUpbAVPi6j4xmC2Ug=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13546110/acastro_181126_1777_bitcoin_0001.jpg",
  "description": "\"Sanctions do not apply to virtual currency? WRONG.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}