{
  "title": "US says internet services are exempt from Russian sanctions",
  "url": "https://www.theverge.com/2022/4/11/23020221/us-russian-sanctions-treasury-department-exemption-internet-services",
  "date": "2022-04-11T15:54:19.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/NjhmqYJr6w-WbuVhaUHCYDhWAmA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70736116/VRG_Illo_STK010_K_Radtke_Ukraine_Glitch.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge</figcaption>    </figure>  <p id=\"Jt5bJG\">The US Department of the Treasury is exempting telecommunications services from ongoing sanctions against Russia. The move, <a href=\"https://home.treasury.gov/system/files/126/russia_gl25.pdf\">confirmed late last week in an order</a>, follows requests from advocacy groups who feared a disruption would cut off Russian activists’ access to the outside world. It may not, however, cause companies that voluntarily cut off access to restore it.</p><p id=\"RDyGCI\">The new order authorizes business transactions involving “services, software, hardware, or technology incident to the exchange of communications over the internet,” including messaging, domain registration, email, and sharing photos or videos. It does not authorize transactions involving Russian financial institutions or state-controlled entities like the Russian Ministry of Finance.</p><div class=\"c-float-right\"><aside id=\"YvRUTW\"><q>“Internet communication technologies are key for human rights defenders and independent media”</q></aside></div><p id=\"7vKWRv\">Access Now and other nonprofits have <a href=\"https://www.accessnow.org/letter-us-government-internet-access-russia-belarus-ukraine/\">pushed the US government</a> to avoid disrupting internet access as part of larger sanctions against Russia over its February invasion of Ukraine. In a statement, Access Now tech legal counsel Natalia Krapiva applauded the decision. “US internet communication technologies are key for human rights defenders and independent media to report on and fight Russian and Belarusian governments’ aggression in Ukraine,” said Krapiva.</p><p id=\"wTbxBX\">The decision comes after several telecommunications companies pulled out of Russia and suspended user accounts from the country. Internet backbone providers <a href=\"https://www.theverge.com/2022/3/9/22968634/lumen-internet-backbone-provider-shutting-down-russia-digital-iron-curtain\">Lumen and Cogent voluntarily ended</a> service last month, as did Mailchimp operator Intuit, <a href=\"https://www.intuit.com/blog/social-responsibility/intuit-supports-the-people-of-ukraine/\">which said</a> it was making the decision “in support of the people of Ukraine.” Other companies have moved specifically in response to the sanctions, however — like Slack, which <a href=\"https://slack.com/blog/news/access-restricted-russia-embargoed-regions-ukraine\">blocked access from Russia</a> citing a need to comply with US regulations.</p><p id=\"sljsxC\">Ukraine has urged a near-complete cutoff of the Russian internet, including a request to revoke its access to the Domain Name System. That request was <a href=\"https://arstechnica.com/tech-policy/2022/03/icann-wont-revoke-russian-internet-domains-says-effect-would-be-devastating/\">denied by DNS overseer ICANN</a>, which warned a revocation could have “devastating and permanent effects on the trust and utility of this global system.” The Russian government, meanwhile, has <a href=\"https://www.theverge.com/2022/3/14/22976603/russia-bans-instagram-facebook-meta-call-to-violence\">blocked major global services</a> like Facebook and Instagram and instituted its own internal restrictions as part of <a href=\"https://www.theverge.com/2022/3/4/22961472/russia-fake-news-law-military-ukraine-invasion-casualties-jail-time\">a wide-ranging crackdown</a> on speech criticizing the invasion.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CM4rbPHPv2tcYF-8dUPWoi-tRZM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268256/VRG_Illo_STK010_K_Radtke_Ukraine_Glitch.jpg",
  "description": "Slack and other companies had previously cut off service.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}