{
  "title": "US unveils stricter tailpipe emissions standards for new vehicles",
  "url": "https://www.theverge.com/2022/4/1/23006139/us-new-tailpipe-emissions-standards-fuel-economy-cafe-mpg-buttigieg",
  "date": "2022-04-01T14:38:44.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"EPA Declares Greenhouse Gases A Danger To Human Health\" src=\"https://cdn.vox-cdn.com/thumbor/HAJmWd-YyurH8F92cA_9u47n--o=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70698255/94117991.0.jpg\" />        <figcaption>Photo by Joe Raedle/Getty Images</figcaption>    </figure>  <p id=\"zmzeWJ\">US Transportation Secretary Pete Buttigieg unveiled <a href=\"https://www.federalregister.gov/documents/2021/09/03/2021-17496/corporate-average-fuel-economy-standards-for-model-years-2024-2026-passenger-cars-and-light-trucks\">stricter fuel economy standards</a> today that he said would save Americans money at the pump, as well as help reduce carbon emissions and fight climate change. </p><p id=\"rfwng9\">“When these standards take effect, Americans buying a new vehicle will spend less on gas than they would have if we hadn’t taken this step,” Buttigieg said at a Friday news conference in Washington, DC. “We estimate that today’s rule will prevent 5.5 trillion pounds of carbon dioxide from going into our atmosphere between now and 2050.”</p><p id=\"rOcLny\">By 2026, the average new vehicle in the US will get 49 miles of travel per gallon of gasoline (mpg) under the revised Corporate Average Fuel Economy standards, Buttigieg said. The new standards will increase fuel efficiency by 8 percent annually for model years 2024–2025 and 10 percent annually for model year 2026. They will also increase the estimated fleetwide average by nearly 10 miles per gallon for model year 2026, relative to model year 2021.</p><div class=\"c-float-right\"><aside id=\"44wAHG\"><q>“Americans buying a new vehicle will spend less on gas than they would have if we hadn’t taken this step”</q></aside></div><p id=\"RXKaca\">“That means if you’re filling up four times a month, that would become three times a month by model year 2026 based on those averages,” Buttigieg said. “And, of course, that would save a typical American household hundreds of dollars.”</p><p id=\"lnb4IK\">The new standards, which were first unveiled last year, are part of a larger effort by President Joe Biden to reverse the rules put in place by Donald Trump and return to the Obama-era fuel economy standards from nearly a decade ago.</p><p id=\"8s8fhX\">Last August, the National Highway Traffic Safety Administration <a href=\"https://www.nhtsa.gov/press-releases/fuel-economy-standards-2024-2026-proposal\">proposed new standards</a> that would increase fuel efficiency by 8 percent annually for vehicle model years 2024–2026 and increase the estimated fleetwide average by 12 miles per gallon for model year 2026, relative to model year 2021. Under the new rules, car owners are estimated to save $140 billion in fuel savings for new vehicles sold by 2030 and $470 billion by midcentury.</p><p id=\"7ciEaP\">The Environmental Protection Agency, <a href=\"https://www.theverge.com/2021/12/20/22846556/epa-rule-tailpipe-carbon-emissions-biden\">in a set of parallel rules</a>, said that passenger vehicles would be required to achieve an average of 55 miles of travel per gallon of gasoline (mpg) by 2026 — slightly over Obama’s goal of 54 mpg but a major increase over the 38-mpg rule put in place by Trump. The EPA estimated that the new standard would prevent the release of 3.1 billion tons of carbon dioxide through 2050 and will save car owners $420 billion in fuel costs.</p><p id=\"pCtbJI\">Buttigieg also called on Congress to pass Biden’s stalled Build Back Better package, which would enact a slate of environmental initiatives, including tax cuts for new electric vehicle purchases. “That would take, for example, the American-made electric pickup trucks we saw a lot of ads for during the Super Bowl, from about 40,000 bucks down into the 20s,” he said. “We could do that through policy that is available right now.”</p><p id=\"bwuPHv\">The need for new EV tax credits speaks to the problem with the cars on America’s roads today, which is that many of them are old. There are around 280 million cars and trucks on the road in the US today, only 3 percent of which are electric. </p><p id=\"NaBWG3\">Americans typically buy 16–17 million cars every year, which would mean it would take roughly 16 years of EV-only sales to completely replace all of the gas cars currently on the road. Also, we would need a total ban on the sale and use of gas cars, and so far, the Biden administration doesn’t appear willing to do that. </p><p id=\"ii0k91\">Last year, <a href=\"https://www.theverge.com/2021/12/8/22824500/biden-executive-order-climate-change-carbon-emissions-electric-vehicles\">Biden signed an executive order</a> directing the federal government to spend billions of dollars to purchase electric vehicles, upgrade federal buildings, and leverage the power of the government to shift to cleaner forms of electricity. And just this week, Biden <a href=\"https://www.theverge.com/2022/3/31/22996690/joe-biden-defense-production-act-ev-batteries\">invoked the Defense Production Act</a> to ramp up the mining and processing of key minerals used in batteries for renewable energy and electric vehicles.</p><p id=\"4DlrSw\">The rules would also keep in place the so-called <a href=\"https://www.vice.com/en/article/3abk7b/bidens-new-fuel-economy-standards-still-allow-cars-to-pollute-more-if-theyre-not-called-cars\">“light-duty truck loophole,”</a> in which vehicles that are bigger and heavier, like SUVs and pickup trucks, are allowed to pollute more than smaller vehicles. The American auto industry has essentially stopped producing small vehicles and sedans in favor of large trucks and SUVs, which have higher margins and are more profitable for automakers. (A spokesperson for NHTSA did not immediately respond to a question about the light-duty truck loophole.)</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/oIL_4L4hOKbC0ASFPi4QDaHD4V0=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23360106/94117991.jpg",
  "description": "Vehicles will have to get 49 mpg by 2026.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}