{
  "title": "USPS is doubling its initial order of electric mail delivery trucks",
  "url": "https://www.theverge.com/2022/3/24/22994483/usps-electric-truck-increase-order-oshkosh",
  "date": "2022-03-24T15:26:31.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/AAsXozvAhf-Q5dQ2RGfz5RwdHn8=/565x0:3048x1655/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70666531/1238414438.0.jpg\" />        <figcaption>Photo by Michael Bocchieri/Getty Images</figcaption>    </figure>  <p id=\"BxoJhT\">The United States Postal Service announced its initial order of 50,000 next-generation delivery vehicles, 10,019 of which will be battery-electric vehicles. It’s a notable number considering <a href=\"https://www.theverge.com/2022/2/23/22947717/usps-biden-dejoy-electric-mail-trucks-reject-oshkosh\">the agency’s resistance</a> to calls for increasing the number of EVs in its future delivery fleet. </p><p id=\"929gzr\">Originally, the postal service said it would purchase 165,000 next-generation mail trucks, <a href=\"https://www.theverge.com/2021/2/25/22300281/usps-new-mail-truck-ev-electric-workhorse-biden-dejoy\">only 10 percent of which will be battery-electric vehicles</a>. President Joe Biden and congressional Democrats urged the agency to increase the number of EVs, but USPS determined there was no legal reason to change its plans.</p><p id=\"ahEGZV\">Now, <a href=\"https://about.usps.com/newsroom/national-releases/2022/0324-usps-places-order-for-next-gen-delivery-vehicles-to-be-electric.htm\">the postal service says</a> it will increase its initial order of EVs from 5,000 to 10,019, determining it “makes good sense from an operational and financial perspective.” </p><div class=\"c-float-right\"><aside id=\"KW7baw\"><q>increase its initial order of EVs from 5,000 to 10,019</q></aside></div><p id=\"5PdY4L\">“We owe it to our carriers and the communities we serve to provide safer, more efficient vehicles to fulfill our universal service obligation to deliver to 161 million addresses in all climates and topographies six days per-week,” Postmaster General Louis DeJoy said in a statement. </p><p id=\"R8IZtq\">The question remains whether USPS will continue to purchase EVs. If the agency follows through on the full 165,000 vehicle purchase as allowed under the contract with Oshkosh, it would still need to acquire 6,500 additional EVs in order to meet the 10 percent threshold. </p><p id=\"zZMbmT\">The news comes after Congress approved a $50 billion rescue package for the postal service, which has lost more than $90 billion since 2007. DeJoy has proposed slashing billions of dollars in funding and slower first-class mail deliveries as new standards. </p><p id=\"UCTjdf\">DeJoy, a top Trump donor, has been at odds with environmentalists over the need to electrify the agency’s fleet. Following a years-long bidding process, the USPS <a href=\"https://www.theverge.com/2021/2/23/22297823/usps-postal-service-mail-truck-electric-oshkosh-workhorse\">unveiled its next-generation mail truck,</a> to be made by Oshkosh, in February 2021. They will replace the current mail trucks that have been in service for more than two decades, which were built by defense contractor Grumman.</p><p id=\"9tIfW7\">But in congressional testimony last year, DeJoy argued that the agency didn’t have the funds needed to purchase more EVs. Last month, the Environmental Protection Agency and White House Council on Environmental Quality sent letters pleading with the postal service to reconsider plans. President Joe Biden has hitched a lot of his political legacy on a <a href=\"https://www.theverge.com/2021/12/8/22824500/biden-executive-order-climate-change-carbon-emissions-electric-vehicles\">carbon-neutral federal government by 2050</a>, vowing to spend billions of dollars to purchase electric vehicles, upgrade federal buildings, and leverage the power of the government to shift to cleaner forms of electricity.</p><p id=\"IXS4xr\">It remains to be seen whether USPS ends up changing its tune on EVs. And it’s not clear whether Oshkosh, which is primarily a defense contractor, can meet the demand, considering the difficulty of the EV manufacturing process, supply chain disruptions, and the global chip shortage. The new electric trucks are not expected to be deployed until 2023.</p><p id=\"zC26gu\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1lbGnzadukB37YgJx0dMissxm18=/271x5:3048x1459/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23342181/1238414438.jpg",
  "description": "USPS has been criticized for not ordering more EVs.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}