{
  "title": "USPS rejects Biden’s plea to buy more electric mail trucks",
  "url": "https://www.theverge.com/2022/2/23/22947717/usps-biden-dejoy-electric-mail-trucks-reject-oshkosh",
  "date": "2022-02-23T18:52:31.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"USPS\" src=\"https://cdn.vox-cdn.com/thumbor/JJ40k7DgE8tJRkbuGbZj2NQ1Er4=/52x0:598x364/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70541648/Screen_Shot_2011-10-02_at_3.22.44_PM.0.png\" />    </figure>  <p id=\"0D0A2S\">The United States Postal Service authorized the replacement of its mail truck fleet with nearly all gasoline-powered vehicles, rejecting <a href=\"https://www.theverge.com/2022/2/3/22915793/us-postal-service-environmental-protection-agency-electric-gas-powered-mail-trucks\">a plea from President Joe Biden</a> to include more electric vehicles in its purchase. </p><p id=\"xakRcS\">The move, which was announced Wednesday, signals the independent agency’s decision to move forward with a controversial plan to purchase 165,000 next-generation mail trucks, <a href=\"https://www.theverge.com/2021/2/25/22300281/usps-new-mail-truck-ev-electric-workhorse-biden-dejoy\">only 10 percent of which will be battery-electric vehicles (BEV)</a>. The USPS determined there was no legal reason to delay its plans. </p><div class=\"c-float-right\"><aside id=\"QIq7OA\"><q>“the process needs to keep moving forward”</q></aside></div><p id=\"4HdYgO\"><a href=\"https://about.usps.com/newsroom/national-releases/2022/0223-usps-completes-environmental-review-of-next-gen-delivery-vehicles.htm\">In a statement</a>, Postmaster Louis DeJoy said the agency would consider adding more EVs to its fleet sometime in the future. “[W]e will continue to pursue the acquisition of additional BEV as additional funding — from either internal or congressional sources — becomes available,” DeJoy said. “But the process needs to keep moving forward.”</p><p id=\"UCTjdf\">Following a years-long bidding process, the USPS <a href=\"https://www.theverge.com/2021/2/23/22297823/usps-postal-service-mail-truck-electric-oshkosh-workhorse\">unveiled its next-generation mail truck </a>in February 2021. The vehicles will be manufactured by defense contractor Oshkosh for $500 million by 2023. They will replace the current mail trucks that have been in service for more than two decades, which were built by defense contractor Grumman.</p><p id=\"9tIfW7\">But in congressional testimony last year, DeJoy confirmed that only 10 percent of the new vehicles would be EVs, arguing that the USPS doesn’t “have the 3 or 4 extra billion [dollars] in our plan right now that it would take to do it.” </p><p id=\"oJDfH6\">Earlier this month, the Environmental Protection Agency (EPA) and White House Council on Environmental Quality sent letters pleading with the postal service to reconsider plans. President Biden has hitched a lot of his political legacy on a <a href=\"https://www.theverge.com/2021/12/8/22824500/biden-executive-order-climate-change-carbon-emissions-electric-vehicles\">carbon-neutral federal government by 2050</a>, vowing to spend billions of dollars to purchase electric vehicles, upgrade federal buildings, and leverage the power of the government to shift to cleaner forms of electricity.</p><p id=\"Vuz1Zx\">But the USPS has rejected those pleas — though it holds out for the possibility of adding more EVs to its fleet in the future. (Critics have noted that this defense is disingenuous, as it would likely cost more to convert gas-powered vehicles to electric than it would to just buy EVs upfront.)</p><p id=\"EZXh7p\">“We thank the federal agencies, including the EPA, for their input,” said Mark Guilfoil, USPS’s vice president of supply management, in a statement. “After thorough review and study we determined that EPA’s request for a supplemental [environmental impact statement] and public hearing would not add value to the Postal Service’s already year-long review. It is also important to note that a supplemental EIS and public hearing are not legally required.”</p><p id=\"oC1uLw\">The EV industry has roundly criticized the USPS’s process for approving the next-generation fleet. <a href=\"https://www.theverge.com/2020/11/17/21571747/zero-emissions-transportation-association-tesla-uber-rivian-lobby\">The Zero Emission Transportation Association</a>, which represents Tesla, Uber, Rivian, Lucid Motors, and others, slammed the move as “ill-informed and costly.” Environmentalists are also fuming over the decision.</p><p id=\"maW6Jf\">As a quasi-independent agency, Biden cannot order the USPS to procure more EVs. But Congress, which is controlled by Democrats, could pass a law requiring the agency to do so and could provide extra funding as well, as noted by <a href=\"https://www.vice.com/en/article/wxdp59/the-one-simple-trick-to-make-the-usps-buy-electric-trucks\"><em>Motherboard</em>’s Aaron Gordon</a>. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/mmfCBo5WAT6oAqNJi7NbOWUijnc=/0x12:650x352/fit-in/1200x630/cdn.vox-cdn.com/assets/733677/Screen_Shot_2011-10-02_at_3.22.44_PM.png",
  "description": "The USPS basically told Biden to get bent.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}