{
  "title": "Valorant is getting proper pro leagues starting in 2023",
  "url": "https://www.theverge.com/2022/4/28/23045328/valorant-professional-esports-leagues-2023",
  "date": "2022-04-28T16:00:00.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Kyd7axCaOi_6lBMDYJPyRBR6CHE=/0x0:2048x1365/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70805096/52027856669_7b4bdfa289_k.0.jpg\" />        <figcaption><em>Optic Gaming winning the Valorant Masters Finals in Reykjavik, Iceland.</em> | Image: Riot Games</figcaption>    </figure>  <p id=\"OlWTzY\">Riot Games is making some big changes to the <em>Valorant</em> esports scene. The shift is due to kick off in 2023 and will include the introduction of three regional leagues representing the Americas, Europe, and Asia; previously, professional <em>Valorant</em> <a href=\"https://www.theverge.com/2020/11/24/21612562/valorant-champions-tour-esports-2021\">operated on a tournament structure</a>. The changes will bring <em>Valorant</em> more in line with Riot’s other popular competitive game, <em>League of Legends</em>.</p><p id=\"xUNdNG\">It’s not clear yet which teams will participate in the new leagues, nor how they will be selected. But Riot says that “the new model will incorporate long-term partnerships with no entry fees to a select number of teams to ensure continued long-term stability for the world’s fastest-growing esport,” adding that “teams who meet the selection criteria will be provided with financial support from Riot Games in the form of an annual stipend and the exclusive opportunity to collaborate on unique in-game activations and products.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bQlOdB0TFuo6znrgbTVrOCNJN-I=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23421111/Untitled.jpg\">  </figure><p id=\"zSlWAK\">In addition to the weekly matches in regional leagues, top teams will also be able to qualify for international competitions, culminating in a world championship. The structure sounds very similar to the professional <em>League of Legends</em> scene, which similarly includes a number of domestic leagues and major international tournaments, including <a href=\"https://www.theverge.com/2021/11/21/22791688/league-of-legends-2022-wold-championship-new-york-toronto-sf\">the incredibly popular Worlds</a>. <em>League </em>is arguably the most globally successful esport, and Riot appears to be attempting to replicate that success with its team shooter.</p><p id=\"IAB3Dc\">As part of the new structure, Riot says that it’s adding a new in-game mode to <em>Valorant </em>that is “designed to identify the best talent worldwide. This mode will act as a supplement to the existing leaderboards, providing players with a new goal above ranked play that integrates into the esports ecosystem.” It’s not clear when the new mode will be introduced. “Together, all these elements will contribute to a competitive ecosystem that will position <em>Valorant</em> for its next stage of growth,” John Needham, Riot’s president of esports, said in a statement.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Iqp78Rwib-ptsiuP-ZaeuU2kBNc=/0x147:2048x1219/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23421047/52027856669_7b4bdfa289_k.jpg",
  "description": "A structure that sounds a lot like League of Legends",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}