{
  "title": "Valve ‘more than happy’ to help Microsoft bring PC Game Pass to Steam",
  "url": "https://www.theverge.com/2022/2/26/22952086/valve-microsoft-pc-game-pass-steam-comments",
  "date": "2022-02-26T14:49:58.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gzAu0oqOsJg9LURv1lOOkZVVSv0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70554058/acastro_180509_1777_steam_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"uJGKMO\">Valve CEO Gabe Newell is open to Microsoft launching its PC Game Pass service on Steam. <a href=\"https://www.pcgamer.com/valve-has-no-plans-for-a-steam-pass-but-would-help-microsoft-put-game-pass-on-steam/\">In an interview with <em>PC Gamer</em></a>, Newell says Valve has no plans for an Xbox Game Pass competitor, but that it would be happy to work with Microsoft to bring PC Game Pass to Steam.</p><p id=\"NzYSVH\">“I don’t think it’s something that we think we need to do ourselves, building a subscription service at this time,” Newell said. “But for their customers it’s clearly a popular option, and we’d be more than happy to work with them to get that on Steam.” </p><p id=\"a34e4E\">Microsoft and Valve have held discussions about bringing PC Game Pass to Steam, but it’s clearly early days and may never happen. “We’ve talked to people there quite a bit about that topic,” says Newell. “If your customers want it, then you should figure out how to make it happen. That’s where we’re at.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kJtVMSC1EdcAmQEkvyj5c2pG6ek=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23273247/vpavic_220210_5030_0017_4k.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>Valve’s new Steam Deck won’t be able to access PC Game Pass without Windows.</em></figcaption>  </figure><p id=\"gPx1GO\">A sticking point could be Valve’s 30 percent cut on software sales through Steam. Valve <a href=\"https://www.theverge.com/2018/11/30/18120577/valve-steam-game-marketplace-revenue-split-new-rules-competition\">relaxes this to 20 percent</a> for sales after $50 million, but it’s not clear how it treats subscription services like PC Game Pass. EA Play launched on Steam in 2020, but only the basic subscription is available and EA Play Pro is still exclusive to EA’s Origin launcher.</p><p id=\"HJL6cl\">Microsoft has so far shown no signs that it’s willing to bring PC Game Pass to Steam, though. The software maker <a href=\"https://www.theverge.com/2019/5/30/18645250/microsoft-xbox-game-studios-publishing-valve-steam-32-bit-windows\">started distributing more</a> of its Xbox Game Studios titles through Steam in 2019, but PC Game Pass remains exclusive to the Microsoft Store and Windows 10 or Windows 11 PCs. That means if you purchase a new Steam Deck, you can’t access PC Game Pass on the Linux OS that’s preinstalled.</p><p id=\"tnTZW5\">Microsoft also attempted to <a href=\"https://www.theverge.com/2021/4/29/22409285/microsoft-store-cut-windows-pc-games-12-percent\">shake up PC gaming</a> last year by reducing its Windows store cut to just 12 percent. Steam still dominates PC gaming, and <a href=\"https://www.theverge.com/2021/6/25/22550103/microsoft-new-windows-app-store-steam-welcome\">Microsoft has said it’s open</a> to Steam being part of its new Windows 11 app store.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UjLcQjas-Ltb_kcBiRrfIQEA-vw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10817781/acastro_180509_1777_steam_0002.jpg",
  "description": "The ball is well and truly in Microsoft’s court.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}