{
  "title": "Valve says you shouldn’t fix the Steam Deck’s noisy fan this way",
  "url": "https://www.theverge.com/23047412/valve-steam-deck-fan-tape-fix-noise-whine",
  "date": "2022-04-28T23:35:48.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ciPZqdujfHk9OK2qjpl3ma3rAZo=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70807483/vpavic_220210_5030_0079.0.jpg\" />        <figcaption>Photo by Vjeran Pavic / The Verge</figcaption>    </figure>  <p id=\"2N31A5\">The Steam Deck started shipping <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">two months ago today</a>, and it’s gotten <a href=\"https://www.theverge.com/22960536/steam-deck-faq-valve-one-month-later\">quite a bit better since</a>, but this week might be the best yet — because we’re finally addressing the single biggest issue with the $400 portable PC. Yes, I’m talking about the fan. </p><p id=\"Yoduuj\">When the Deck launched, it shipped with an extremely noisy fan to cool its AMD Zen 2 and RDNA 2 silicon, and owners like me have been dealing with its volume and constant whine from day one. It ran <em>constantly</em>, even when I wasn’t doing anything with the system, and was always ramping up even in relatively lightweight games like <em>Vampire Survivors. </em></p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SZJGqlrUk-stWfnSgWrosXFkSnU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23424084/steam_deck_delta_fan.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>My Steam Deck’s fan, from Delta Electronics.</em></figcaption>  </figure><p id=\"lSuIZ5\">Worse, it <em>whines</em>. Or at least some Steam Decks have that issue — <a href=\"https://www.reddit.com/r/SteamDeck\">the Reddit community</a> discovered that Valve actually ships the Deck with one of two different fans, one from Delta and <a href=\"https://www.reddit.com/r/SteamDeck/comments/trjkpg/huaying_fan_has_been_spotted_on_a_production_model/\">another from Huaying</a>. I’ve got the Delta one, and so do most others complaining about the whine from what I’ve seen. Valve won’t comment on the fan selection, and iFixit can’t say whether you’ll be able to swap out for a better one <a href=\"https://www.theverge.com/2022/2/15/22935171/valve-steam-deck-replacement-parts-teardown-ifixit\">when replacement parts are available.</a></p><div id=\"qC8ske\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">We're aware of the noise issue, and we're trying to source the ones without the noise, but it will depend on what's available to us.</p>— iFixit (@iFixit) <a href=\"https://twitter.com/iFixit/status/1516091028880637975?ref_src=twsrc%5Etfw\">April 18, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"vrp9FN\">But this week, Valve did take a big step towards improving it with <a href=\"https://steamcommunity.com/app/1675200/discussions/0/3269060419612777126/\">a beta software update</a> — and I can confirm it’s a whole new experience. No longer does the fan kick on when the system’s just sitting there — it’s now dead silent when idle, until or unless you warm up the chip by downloading some content or opening up big folders of games at a minimum. </p><p id=\"ow94G4\">It no longer ramps up as quickly, either, with mine generally waiting until the system crosses 65 degrees Celsius before raising fan speed to a new tier — though I did notice it getting pretty toasty before it hit maximum fan speed, and even saw some stuttering in <em>Elden Ring</em> when I topped out at around 87 degrees Celsius on the GPU. </p><div id=\"oY4Y0g\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hello! We've just shipped an update to SteamOS for Steam Deck in the beta channel. This update includes a new OS-controlled fan curve, support for changing in-game screen refresh rate, and more. <a href=\"https://t.co/iukgqSfAcx\">https://t.co/iukgqSfAcx</a> <a href=\"https://t.co/vLdwFzwF0X\">pic.twitter.com/vLdwFzwF0X</a></p>— Steam Deck (@OnDeck) <a href=\"https://twitter.com/OnDeck/status/1519500052351258624?ref_src=twsrc%5Etfw\">April 28, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"6rlR6s\">One problem: none of Valve’s tweaks fixed the whine. My Delta fan may not ramp up as quickly, but it still has that tiny jet engine scream. </p><p id=\"Jge1vc\">You know what did fix it? Electrical tape. </p><div class=\"c-float-right\"><aside id=\"Kgg8x9\"><q>none of Valve’s tweaks fixed the whine, so: electrical tape?</q></aside></div><p id=\"nA2Z4b\"><a href=\"https://www.reddit.com/r/SteamDeck/comments/uckns3/how_i_fixed_my_whiny_delta_fan_with_electrical/\">u/OligarchyAmbulance on Reddit discovered</a> that simply <em>pressing on the back of the Steam Deck’s shell</em>, near the Valve logo, was enough to deaden the whine. So they opened up their Steam Deck and stacked four little strips of electrical tape atop that same place inside the shell — right behind the fan. Here are some <a href=\"https://www.youtube.com/watch?v=ijU_2IEwcBM\">before</a> and <a href=\"https://www.youtube.com/watch?v=PBeSnel5Cbs\">after</a> videos they created.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PqX1wfznDPi9nPm3k1VmrWy3Fcg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23424087/steam_deck_back.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>The Steam Deck has its own electrical tape already; the new bits would go </em><a class=\"ql-link\" href=\"https://imgur.com/a/KIwr51n\" target=\"_blank\"><em>just underneath the circle on the left</em></a><em>.</em></figcaption>  </figure><p id=\"uJeYu3\">I did the same: first pressing on the back to see if it might work, then opening up the Steam Deck and adding the tape. The whine was all but obliterated. Don’t get me wrong, the fan is still loud at full bore! But it’s mostly the rushing of air now, not a screech. </p><div class=\"c-float-right\"><div id=\"SGVSSO\"><div data-anthem-component=\"aside:11166775\"></div></div></div><p id=\"9JuMjl\">Should you try this at home? Not necessarily, because we don’t know why it works, or if there might be ill side effects — like heat or wear. “We don’t recommend changing the airflow path as we don’t know how that would impact thermals,” Valve’s Lawrence Yang tells me.</p><p id=\"d9hzgT\">u/OligarchyAmbulance and I aren’t seeing any notable differences in temperature yet, but between Valve’s warning and the fact that opening up the Deck is a teensy bit harder than some make it out to be, I don’t know if I’d recommend it to just anyone. </p><p id=\"qaWcAq\">But it seems pretty clear that this fan problem is hardware, not just software — and if Valve doesn’t have a plan or a recommendation to deaden the sound, I’m guessing more than a few gamers will take matters into their own hands. </p><p id=\"ErlS5d\">The fan curve isn’t the only neat addition in this week’s beta update for the Deck, by the way. <a href=\"https://steamcommunity.com/app/1675200/discussions/0/3269060419612777126/\">It also adds</a> an experimental way to change the screen refresh rate between 40 and 60Hz, which could improve battery life and smoothness when your game’s running at over 30fps, but can’t quite hit 60fps. </p><p id=\"ZVWthX\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/L0EshB04FfH-1CGiU5lmYnO0nhE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23270006/vpavic_220210_5030_0079.jpg",
  "description": "Electrical tape FTW, unless you’re worried about the warranty.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}