{
  "title": "Vergecast: Google CEO Sundar Pichai on Google I/O 2022",
  "url": "https://www.theverge.com/2022/5/13/23070521/vergecast-podcast-497-google-io-sundar-pichai-interview",
  "date": "2022-05-13T16:57:46.000Z",
  "author": "Andrew Marino",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Z9B6jFAN5WzbbfQn2JR1oUzjPgc=/200x0:2360x1440/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70866008/2022_5_11_google_io_881_11_56_55.0.jpg\" />        <figcaption>Image: <em>The Verge</em></figcaption>    </figure>  <p id=\"y3H4XA\">Every Friday, <em>The Verge</em> publishes our flagship podcast, <a href=\"http://theverge.com/the-vergecast\"><em>The Vergecast</em></a>, where <em>Verge</em> editor-in-chief Nilay Patel and editor-at-large David Pierce discuss the week in tech news with the reporters and editors covering the biggest stories.</p><p id=\"ica42x\">On Wednesday, we saw Google announce a whole bunch of products and features from their keynote live stream — from updates to <a href=\"https://www.theverge.com/2022/5/11/23064610/google-assistant-nest-hub-max-features-io\">the Nest Hub Max</a> to previewing <a href=\"https://www.theverge.com/2022/5/11/23065055/google-android-tablet-pixel-io-release-date\">a 2023 Pixel tablet</a>. So, on <em>The Vergecast</em>, we’re focusing a chunk of the show on Google’s announcements and initiatives for the coming year or so. </p><p id=\"PpidlT\">And there’s no better way to start that conversation than with an interview with Google and Alphabet CEO Sundar Pichai. Read the full transcript of that conversation here. </p><p id=\"MkH1dJ\">After the interview, <em>Verge</em> deputy editor Dan Seifert joins the show to dive deeper into the Google hardware announcements and the theme of “bringing back Google’s hits” like the tablet or <a href=\"https://www.theverge.com/2022/5/11/23064568/google-wallet-payments-digital-cards-ids-transit-io\">the Wallet</a>.</p><p id=\"p0uUpg\">But wait, there’s more. <em>Verge</em> senior reporter Liz Lopatto stops by the show to talk to David about <a href=\"https://www.theverge.com/2022/5/12/23069232/terra-luna-collapse-stablecoins-crypto-crash-bitcoin\">this week’s “crypto crash”</a> and stablecoins’ struggle for... stability. David is calling this segment “Crypto Corner,” which may or may not be recurring. </p><p id=\"B81qZz\">To close out the show, <em>Verge </em>managing editor Alex Cranz brings the <em>Vergecast </em>essentials:<em> </em>gadget rumors. Apple may be thinking about bringing USB-C to the iPhone in 2023, and we saw a preview of what the next headset from Meta may look like. What a year for gadgets 2023 will be. </p><p id=\"A7kItn\">There’s a whole lot in this show that fills you in on this week’s biggest tech news — so listen here or in your preferred podcast player for the full discussion. </p><div id=\"F83g6W\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP4641009368&amp;light=true\" width=\"100%\"></iframe></div><p id=\"IaFX4o\"><em>This transcript has been lightly edited for clarity.</em></p><p id=\"GASiRU\"><strong>Nilay Patel: Sundar Pichai, you are the CEO of Google. You are the CEO and chairman of Alphabet. Welcome to </strong><em><strong>The Vergecast</strong></em><strong>.</strong></p><p id=\"W5frNw\">Well, it’s a pleasure to be here. Good to see you, Nilay and David.</p><p id=\"YapTSS\"><strong>NP: Yeah, it’s great to see you again. It’s been a while since we’ve talked. Also, I appreciate that you’re on </strong><em><strong>The Vergecast</strong></em><strong>. Real ones are on </strong><em><strong>The Vergecast</strong></em><strong> to talk product. This is where it gets serious about products. So it’s Google I/O. We obviously came off the keynote. The keynote was two hours long — lots of products, lots of really hardcore AI tech, LaMDA, big language models. Here’s my question for you, just big picture, and then I want to dive into some of the products themselves.</strong></p><p id=\"RbwdnF\"><strong>Google does a lot of things. It has a lot of research projects, a lot of far-out ideas, a lot of things on the ground like Maps and recommendations and obviously search. You run YouTube. Then you’ve got Android. It’s a lot of things. Kind of the theme of I/O this year was you’re bringing it all together, and it’s going to become a very focused set of products and experiences for people across the whole ecosystem. So just from the baseline, how real is that? How much are you actually bringing Google into focus versus you’re just lining up the pieces and making sure they make sense together?</strong></p><p id=\"YDTAY4\">There are a few things which I’ve tried to do with the company: one is at an underlying, more foundational layer that focuses on AI. So when you say research, it is a real deep focus on AI. In some ways, the big bet is AI is transformational across all the products and services we do. So for sure, that’s been a big focus bet.</p><p id=\"byGXuz\">And above it, a focus on knowledge and computing, right? And both we see as core aspects of our mission. And so, to me, it is the same AI which makes that change in search because we are able to do things in a more multimodal way, and it’s that same multimodal model which in YouTube can create auto chapters and so on. So it’s an underlying theme, so with which we are doing it across our key products and services.</p><p id=\"p95O4A\">But there is a set of products which our users use multiple times per day. These are big active user bases, and so there’s a lot of focus on, be it search or Gmail or Maps or YouTube, making sure those products are evolving in a way that makes sense. And so I think both are important.</p><p id=\"wBbEE1\"><strong>David Pierce: So on the AI front, though, there’s a piece of that that’s really interesting to me because one of the things I noticed in the keynote was that things like LaMDA and Translate and PaLM kept coming up kind of in different contexts. And I think one of the things that’s been tricky for us to figure out is when you say “we’re focused on AI,” that can mean lots of things, right? AI is this huge sprawling thing that can mean a lot of things. Within that space, it feels like maybe Google is picking its spots a little more instead of kind of trying to do lots of things. You have a few big bets, even just within AI. Is that fair?</strong></p><p id=\"5uVYSd\">Yeah. It’s a great question. You can think about it this way, right? We are all making progress in state-of-the-art ML and AI. Then there’s things in terms of what we are deploying in production, which is the latest version of either speech models, vision models, or multimodal models. Right? And then there is the future of AI, which is not in production yet. And that is large language models. And so I think we are talking about that, and that’s where LaMDA and PaLM and everything comes in. And some of that will keep flowing back into cutting-edge production, and that’s what keeps the innovation going.</p><p id=\"lo0oQg\"><strong>DP: Okay. And my sense would be then that your job as CEO is in part to sort of make sure all of those things are moving at the correct speed, because, just the idea of living deep in the future and two years from now and also right now … seems impossible.</strong></p><p id=\"D8WwaP\">There are two sides to the coin, right? So, for example, when we built something like Chrome, we unveiled the end-to-end product in one day. Well, the comic book leaked two days early, but at least it’s a product in which you come out and unveil it. When it comes to things like AI, a lot of it, we publish research. So you can’t quite do that. And B, in a technology like that, transparency is important, too, I think. And so we are talking about it ahead of time, which is what gives a sense of, “well, is this too futuristic? What of this will apply to the products?” And I think it’s a fair question, but I’m trying to explain why we are doing it the way we are doing it. And so that’s what I think makes it a bit different.</p><p id=\"bJk27g\"><strong>NP: I think the classic story of I/O has been a demo of a really impressive AI tool. I can’t help but think of the one that took the fence out of the picture in the image editor — and it turns out that’s actually a really hard problem. It’s going to take a long time to actually shift that to consumers. But at the same time, you’re demoing things in actual products, like translation, that are real for people or could be real today. And it’s just really hard to calibrate: what are we looking at that’s real right now or that is a vision of what AI could accomplish? Google is one of the few companies that still demos really impressive software every time you have an event. Most other companies are like, I don’t know, “We’re going to stream some baseball games to you.” There’s a really very hardcore engineering component to what you showed at I/O, but it’s just hard to know which of it is going to come into focus and turn into a product and which of it is: Google has an intense set of capabilities, and part of Google’s culture is chasing them down wherever they might lead.</strong></p><p id=\"7ppRlE\">If you go back, let me give a couple examples. We showed Google Lens many years at I/O, right? The promise of what Google Lens is. It’s a real product, right? And people query it, you can access it. And as Lens matures, we are bringing those capabilities into search, and that’s what helps you from a multisearch standpoint. Even the fence: you can see Magic Eraser in Pixel, and I would argue it gets at some of that promise in the context of a product. And so, the goal of everything we are showing is to actually build it into a product. That’s what we are trying to do. I have no interest in being an R&amp;D lab.</p><p id=\"f6KwOv\">We actually genuinely believe we’ve been doing cutting-edge R&amp;D, right? We are one of the world’s largest R&amp;D investors, probably over $100 billion in the past five years. And so we are definitely doing [tip of tree] R&amp;D, but the goal is all with a clear lens of our mission, how we will apply it, and working it backward. And then I think both are true.</p><p id=\"eDQrs0\">There may be times there’s a probabilistic outcome, and so that there may be one or two elements in it which we fail. And so that there is that risk of talking ahead. And I think the failures are also obvious to the external world. But I do think if you’ve looked at the capabilities we are bringing in Pixel, etc., we are translating it into products and features.</p><p id=\"vFca7Y\">Everything to do with translation, though, I would argue we’ve been steadily making progress, be it monolingual translation or what we showed in the context of translation and transcription in the context of the prototypes — AR glass prototypes — those are real products we are working on. Right?</p><p id=\"j56BkH\"><strong>NP: Wait, we’ll just skip ahead. You brought it up. The glasses are real? It’s a real pair of glasses?</strong></p><p id=\"awXntk\">Yeah. I mean, the prototypes are real. I mean, they are real use cases, and the people testing it out are real. Absolutely. We are still obviously working through what the right product in terms of AR is. </p><p id=\"TcUSPL\">With AR, we were trying to communicate two things. One is: a lot of the innovation for what we are building in AR, we are building in the context of a smartphone today. And so Lens, multisearch, scene exploration, live immersive view in Maps — these are all AR experiences.</p><p id=\"5bVvPs\">We are doing it in a smartphone today. But the magic isn’t fully obvious ‘til you can live in that future. And so we are exploring that future, also in terms of hardware form factors. But that’s going to take time to do, and we have a few more decisions ahead of us there.</p><p id=\"P7xMb9\"><strong>NP: So if people haven’t seen the video, you should watch it. It’s cool. It’s a pair of glasses. It listens. And it shows you real-time translations. Someone’s speaking in a different language, you get real-time translation on the screen of the glasses.</strong></p><p id=\"wsTqlk\"><strong>I look at that, and I say, “Oh, that’s really smart.” Right now, all the AR experiences you’re describing, they happen on a phone because a phone has a fancy camera built into it. It has a 5G network connection, for whatever that’s worth. It has a fast processor. It has a big battery. Putting that stuff in glasses is very difficult. And I look at the translation glasses you demoed, and I say, “Oh, you’re cutting the problem way down.” Now, all we’re doing is listening to someone, translating it, and then showing some text on a screen, which in the grand scheme of computer problems is still hard but, in the scheme of AR, is a very narrow solution. Is that how you’re thinking about it? That you’re going to cut it all the way down to that, and you’re not going to do real-time graphic overlays and stuff that seems really far out right now?</strong></p><p id=\"oHv30I\">I think it’s part of how we are thinking about it because I don’t think we want to overshoot it. The more you overshoot, the longer it is away, right? And so we are trying to find that sweet spot of what is it that you can do, something which people can wear. It’s comfortable, you can wear it. And also doesn’t have the other broader issues around... Well, if you have a camera, you have to solve a set of different issues. It’s a harder system integration problem, as you’re pointing out.</p><p id=\"tjOvBk\">I’ve always felt constraints help, right? Having constraints helps you actually deliver a product. And so I’m a fan of that. And so I think that’s part of what’s informing our thinking there.</p><p id=\"5txmJ8\"><strong>NP: You have to develop the hardware. That seems very challenging. There’s also the idea that you’re going to augment reality, which just on its face seems like the world’s biggest content moderation challenge. You run YouTube. YouTube is a content moderation challenge. Have you put time into thinking about, “okay, we’re going into an AR future. Someone’s looking at the Capitol building. Google’s going to put some information over the Capitol building to say what happened there. And people are going to be upset regardless of what we put on that screen.” Have you gotten all the way down that road in your thinking yet? Or are you still focused on, “we have to make a computer you put on your face?”</strong></p><p id=\"0KDOST\">Look, I think we are in the earliest stages. You can imagine use cases where there are products like Maps, or you want to listen to music when you run, or the translation use cases. I think anytime you show information with that, you have to think through all that. And I agree with you. But I don’t think we are quite there yet, if I were to be frank, thinking all that through.</p><p id=\"XybOkt\"><strong>NP: I mean, just on a timeline, do you think this is a five-year problem? Is it a 25-year problem? Is it 18 months?</strong></p><p id=\"JpeoQ7\">Well, we have the problem today, right? I think information is working at scale on the internet. And I think we’ve already crossed the inflection points. So I would argue solving content moderation is a hard enough problem today. And if I think through the future, maybe areas where I worry about more are synthetic content and how do we deal with that? AR is a dimension, but I think there are harder dimensions, which I think we are probably thinking about a bit more.</p><p id=\"uhejlw\"><strong>DP: This comes back to the “how you think about the company as a whole” question, too. Because I think we’ve seen a few companies, most aggressively Meta, make a lot of noise about AR being a bet-the-company thing, right? That this thing that is coming next is going to require everything we have, and we have to put everything we have behind it, and it’s going to require changing how we work. My sense is you’re not shifting Google quite that aggressively, but – </strong></p><p id=\"Cp5H9i\"><strong>NP: Sundar is like, “The real world’s pretty good,” which is about as hard of a shot as I’ve ever heard you take, man.</strong></p><p id=\"ohlY2d\">Look, I mean, we are definitely focused more and more on the AR side, in the context of “the real world is important.” It’s how we see it. And we are building it. VR has an important use case, too. And there’ll be mixed reality. But those things all have different timelines and access and so on. </p><p id=\"dD7kGh\"><strong>DP: But eventually, if AR is going to be as big as a lot of people think it is, it’s going to require basically every team at Google to build new things for it. Where are you in how you’re thinking about how much energy you want to put within the company onto that kind of stuff?</strong></p><p id=\"eQUY7w\">Remember, Google came from the desktop era. And we have driven the shift to mobile. AI is a big shift we are driving. And so, to me, I think it cuts across. So I don’t view it as betting the company — it is a natural evolution of the company. And I think if you’re thinking deeply and building for the future, it is a big part of getting it right.</p><p id=\"5PAfsa\">So for me, it’s important that search works in the AR context. And Maps is thinking it through. And YouTube is thinking it through. And Google Photos is thinking it through. And so, I think if you get it right that way, you’re bringing the company along through these big transitions. And so maybe it’s a way about how we think about it.</p><p id=\"bI9CL2\"><strong>NP: Let’s come back out of the clouds for a minute. That’s AR. I mean, it’s interesting. And I think the glasses are fascinating in the sense that by reducing the problem you’re trying to solve, you actually can make a more useful product as opposed to trying to boil the ocean there. But they’re still pretty far out. You’ve got another problem right in front of you, which is trying to sell Pixel phones and create a Pixel ecosystem. Even at that, for a while, we saw Pixel 7, Pixel 6A, Pixel Buds Pro. You hinted at a tablet. There’s a lot of energy in that space.</strong></p><p id=\"CYzKKN\"><strong>And one of the things that Rick [Osterloh] told David on another piece of the </strong><em><strong>Vergecast</strong></em><strong> is that the Android team and the Pixel team are much closer together now. They’re operating in harmony. Historically, that arrangement has made your OEMs very mad: I believe at one point, Google was forced to sell Motorola because things were too close. But now you’re doing it again.</strong> <strong>Tell me about that. Is that Samsung and Lenovo and whoever else don’t see Pixel as a threat, so you can bring them close together? Is it you’re going to spin some innovations from Pixel out into Android proper? How are you thinking about managing that dynamic?</strong></p><p id=\"gc38z4\">Let me step out and first answer about our focus there. To me, it’s no different over the past five years if you’ve taken an area like YouTube. We’ve put a lot of focus into it. Cloud is the same thing. Both as big areas and as important businesses to be built. To me, hardware and computing is equally important. I do think the ecosystem — all of us see value in working together to make sure we make progress, particularly beyond phones, right?</p><p id=\"6J9ete\">So Wear OS has been a great example. Because when you’re building these new categories, it’s hardware, it’s software, it’s app developers. You all understand this well. So there is value in what we did with Samsung on Wear OS aligning. And as developers, the fact that Pixel Watch is coming and Wear OS has a lot more traction, all of that matters because developers address it, too. So, “a rising tide lifts all boats” kind of a scenario is genuinely what plays out. We work super hard with Samsung on foldables and phones. </p><p id=\"DuDgJO\">And also, I think there’s some added value in our approach, in the sense that sometimes we have a strong view on what to do on top of Android, right? Our OEMs may have a different viewpoint. I think one of the benefits of Android is it allows both viewpoints to be expressed. And we can do it in the context of Pixel and the ecosystem we see. And Samsung can have a vision on top of Galaxy and their hardware ecosystem, too. So I think there’s some value in that, too.</p><p id=\"HkzXuS\">So I don’t necessarily see this being that complicated. I think the industry has evolved to this level. You can look at somebody like Microsoft with Surface and Windows, and you can ask the same question, but I think it’s natural. We work with Samsung, by the way. Our Pixel division is a major customer of Samsung’s components. And so we don’t sit there and ask, “Hey, Samsung is supplying its own phones and us. And how do you do this?” The industry has worked that way for a while. So I see it as a natural evolution.</p><p id=\"uZEklC\"><strong>DP: On the ecosystem side of things, what changed your thinking about that? I think one of the things that Nilay and I both noticed from I/O is there was a lot of resurrecting of old products and old ideas. Tablets was a thing that it doesn’t seem like Google has cared about in a while, and same with watches. And Wallet is back after not being back. The ecosystem thinking seems to have gotten much bigger. What sparked that internally?</strong></p><p id=\"78cEzR\">I think there are two aspects to it. One is what you said — that the ecosystem is important — and Android is open source, which means there are many different OEMs making things. So the Android team is thinking hard about Better Together and how do these things work together better. And additional categories becoming more important, that’s one part of it. </p><p id=\"z7z4VC\">The second part of it is, why not sooner? Hardware is such an “economies of scale” business. There’s so many things to do to get it right. And we have been building the capabilities. So, for example, Tensor has been five years in the making. You’re seeing it now, but we knew we needed that to work well to be able to do a tablet so that it shares the same silicon platform with phones. And so you had to crawl, walk, and start to run on phones before you can actually do the other things. So there’s a difference between intellectually understanding it a few years earlier versus the actual practical ability to get scale and to be able to do it all in the additional things. And so I think that’s the practical side of it.</p><p id=\"5lSCKa\"><strong>NP: But let me ask you about phones in particular, and then maybe extend it to tablets. You made the comparison to Microsoft. Microsoft did Surface because the Windows ecosystem was not producing thousand-dollar laptops. Panos [Panay] has been on the show. He said that to us very directly, very loudly. And so they’re like, “We need to reinvigorate this segment of the market. We need to compete with Apple because Apple’s winning at this segment of the market.” In phones right now, if Pixel’s a huge success, you’re not necessarily getting Apple switchers. You’re getting Samsung switchers, where you’re just moving people around the Android ecosystem. If you launch a tablet, I don’t know if you’re thinking you’re going to get iPad switchers; you might just get Chrome OS switchers or other Android tablet switchers. </strong></p><p id=\"RjNckB\"><strong>How do you think about managing that competition? And then I guess the real question is: how do you think about opening the gate to get people to switch from Apple products — however many conversations we want to have about lock-in, and I promise you, we will soon ask what RCS, but they seem to be pretty happy over there and not enticed to switch to your platforms.</strong></p><p id=\"wMeBXi\">I definitely think us doing tablets and us working better with Samsung on tablets will end up with each of us individually better off, and overall, Android as an ecosystem will do better in tablets. That’s how the math works out, at least empirically, for a while. On the phone side, too, I do think on high-ends, we need to be competitive. Similarly, you’re talking about switching, but we could also lose users from the Android ecosystem because we don’t have a good tablet offering as well. </p><p id=\"WpPfLY\">You’ve made this point before on <em>The Vergecast</em> about Nexus 7 and the impact it had. We are doing it because we think we will give a clear view on how you can do these things and how they can work together. And I think it’ll impact the whole ecosystem to do better. So I see all of that playing out. I see it so far from being a zero-sum game, and to my earlier point, we end up being a very successful — others sell components to us. We buy displays, we buy memory. So I think it’s a bit more complex than that.</p><p id=\"rTf1ry\"><strong>NP: All right, so now I definitely have to ask the RCS question. Shout out to our friend Dieter Bohn, who you ruthlessly took from us, Sundar. The noise that Google has started to make about RCS has gotten louder over the past five years. I would just say it started with, “Here’s the new standard. We hope the carriers adopt it. We’re running our own RCS servers.” To, onstage, “everyone should adopt RCS” — pointed look in the direction of Cupertino. You’re starting to advocate now for it as a company very loudly. There are good reasons for it: there’s security, there’s encryption, there’s all that stuff. There’s also just interoperability and ease of switching in the sense that iMessage is pure lock-in for Apple. How are you balancing all of that stuff? Is it you’re more focused on “this is the next generation of standards when you got to get there?” Or is there an element of competitiveness to it?</strong></p><p id=\"adOq1A\">You’ve had a long focus on our messaging efforts. And I would say RCS is … I still recall being in Mobile World Congress, six to seven years ago, and seeing the moment where the carriers suddenly looked at us and said, “We need you to do this.” And historically, it had been difficult. The carriers viewed it as, “We don’t want anyone else to come into messaging.” And so it was a big shift. And so I actually view it as a great example of, against extraordinary odds, being so focused on an area over six to seven years. And being where we are, I think, at least on the Android ecosystem side, RCS is on a clear path to both being a standard, supporting end-to-end encryption, and so on. So super excited about the progress there. </p><p id=\"6ha2De\">I think interoperability is great here. We all take it for granted in areas like email today. It would be great for it to work. I think we couldn’t even make the case until we had a viable alternative, so we’ve crossed that part. I realize teams are excited and making calls and stuff, but to me, what’s in our control is to build a compelling standard and, over time, make the compelling case that it’s to the benefit of everyone involved, including iOS users, to have that end-to-end encryption working and have that interoperability. And the rest is outside of our hands. And as you said, time will tell. But I’m at least glad we reached the stage where we are, making progress. </p><p id=\"7UJOzC\">And to taking Dieter: first of all, you guys focus a lot on products, which is great, and I think unique, but the more you focus on product, you have almost like, product manager-type of people, and Google is always hiring product managers. So I think it comes.</p><p id=\"mAbRiW\"><strong>NP: Yeah. You need someone who thinks about the people! Another just Big Think question, then I want to ask about a more distributed future. But just on a big perspective right now, when you think about the big companies, they have signature products. Google has a lot of signature products. As you’re thinking about the future of the company and how all those products might work together and how you might layer the technologies underneath them together, are you thinking about changing how Google operates or how it’s organized? Historically, Google has been doing a lot of things all at once. I think messaging is actually the ultimate example of this, where lots of teams at Google have built messaging products, but the strategy for messaging has only recently begun to perhaps coalesce. Are you thinking about that more broadly across the company?</strong></p><p id=\"P12Uli\">Yes. Becoming CEO, I wanted the company to go back and think a lot about its core mission because I felt it was important to ground ourselves there and really focus on knowledge. And the core of knowledge for us is on search and YouTube. It’s our core consumer services. And then computing — it’s Android, and as part of that, there was a big bet on hardware, too. And then making sure we are a world-class enterprise platform as well, with Cloud and Workspace. So we’ve done a lot of work to focus the company along those dimensions. </p><p id=\"wtZVxl\">So those are our five big product areas, how we are structured and how we run them. And with the common view of all the crosscutting R&amp;D and technology, particularly AI, which really drives innovation forward there. So that’s the big picture, how I think about it. And we’ll continue to be very focused. I think it takes a lot in tech. Tech is very competitive. You look at something like TikTok emerge, things happen in very fast cycles. And so, to stay on top of any significant tech product needs a lot of focus and continued innovation.</p><p id=\"p3R3EJ\">And so I’ve always viewed, as a company, we need to be very focused on it. And definitely, we have brought focus. Some of what looks outside as well, like, “You’re focused on these products, and you’re improving them.” Well, yes. These are billion-user products doing important things. And I think people rely on them. And to me, there is nothing more important than making it better constantly and continually evolving it. As a web service, sometimes it’s hard because if you’re doing hardware or something, you get these once-in-a-year moments to go talk about it. Something like search, where you’re shipping stuff every two weeks and you’re continuously releasing them, it is even more important to be very focused on making sure you’re actually moving the needle. So I think it’s definitely a big part of what I think about.</p><p id=\"QFeivG\"><strong>NP: One of the things that I’ve been thinking about a lot lately is the blockchain, decentralized computing. I talk to blockchain companies and CEOs, and whenever they’re like, “Web2,” the examples they give me are always Google. It’s always Google search. It’s always YouTube. These are the Web2 platforms that the blockchain companies are going to disrupt. Are you making big bets? We’re talking right now in the middle of a literal cryptocurrency crash, so I’m assuming you’re not making huge bets today, but are you thinking about that next future for Google?</strong></p><p id=\"tbIqKc\">Web2 was a big part of why I joined Google! And seeing the transition from the web moving from content to apps and the excitement around XML, HTTP, and Ajax and realizing that Maps and Gmail all represent a fundamental shift in how the web works. So I think it’s exciting to me anytime the web evolves, but the web is a big thing, and no one person can evolve it, right? That’s the beauty of the web. So I always look at any innovation and try to understand what are the good things coming out of it. It is still early days, though. But I’m always trying to think ahead about what are the key trends, be it on computing, be it on how the web server is evolving and trying to see where Google can contribute, where Google can also lead. And it’s a big part of how we should think about it, not to mention AI being the most important of it all.</p><p id=\"rRytlm\"><strong>NP: Let’s call it Web3, the blockchain, Web3 stuff. There’s a lot of cryptographic innovation, sure. But the innovation there is not necessarily technological capability. It’s, “I don’t have to trust your database.” Google is effectively the world’s most powerful database company. There’s a very important database at the heart of Google that you can query and get results from. Do you ever think, “Oh, this will displace the search index,” or, “This will displace the YouTube database”?</strong></p><p id=\"eJ1tZx\">I mean, don’t forget, I think Skype worked at some point on a P2P-based model. Right? Distributed databases are a hard, interesting computer science challenge, too. So I think we get equally excited about that. I think it’s important to think through user problems, what you’re trying to solve, and the underlying technology. And so, all of that is important end-to-end. But as always, when anything evolves, to make sure you’re leading in all these services, will you get disrupted? By definition, if you’re not trying hard enough, yes. The answer is absolutely 100 percent yes. I’m like when we show up to work on Mondays, and yes, I worry about all of this all the time. And so maybe I’ll leave it at that.</p><p id=\"hujaSj\"><strong>DP: My last question is, tell me what your killer app is for smartwatches. We spend a lot of time debating what smartwatches are for. And having now spent a lot of time building one, I’m curious what you see as the reason for smartwatches at the moment for Google</strong>.</p><p id=\"nVu6EO\">I want to make sure the team has something to say in September when they talk about Pixel Watches. The thing I’m excited about is it’s an end-to-end hardware portfolio, and you will see a lot of the Pixel brand identity. And if you’re a Pixel user, a lot of the design language and some of the customization of how easy it is to change bands and the expressiveness is great. In terms of killer apps, look, I mean, you look at something like GPS being on phones and what happens later, or the fact that XML/HTTP created a whole set of apps, as I talked about earlier — I’m always humbled by, when you create underlying capabilities, the creativity of developers outside. It’s not that Google will develop the killer app. I think, down the line, someone will do something really cool with it. </p><p id=\"QIVoHX\">But I would argue one of the exciting aspects of the Pixel watch is, of course, Fitbit coming on it. Fitbit coming as a service on it is a killer app we are putting on that watch. And so that is something I’m super excited by.</p><p id=\"8zkhQw\"><strong>NP: Well, Sundar, thank you so much for coming on </strong><em><strong>The Vergecas</strong></em><strong>t. It’s always great to talk to you, and I always appreciate that you want to come on the hardcore nerd show. So that’s very good. It’s good to talk to you.</strong></p><p id=\"RGrDcy\">Greatly enjoyed it. And thanks for all the focus on I/O. I appreciate it.</p><aside id=\"N6MYAt\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"The Vergecast\",\"description\":\"The podcast you need to make sense of the week in tech news\",\"label\":\"Subscribe\",\"url\":\"https://pod.link/430333725\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/tbfC9p-quwE1t4Ra8uOxESAhm78=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23461490/2022_5_11_google_io_881_11_56_55.jpg",
  "description": "We interview the Google CEO and then do another hour.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}