{
  "title": "Verizon Plus Play will bundle customer subscriptions for Netflix, Peloton, Disney Plus, and more",
  "url": "https://www.theverge.com/2022/3/3/22959926/verizon-plus-play-streaming-hub-disney-netflix-metaverse-meta-facebook",
  "date": "2022-03-03T18:42:29.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/xQrwH7Wi5lEbUoHG0tkK9v1OhIU=/98x0:1133x690/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70575116/__Play_Lockup.0.jpg\" />        <figcaption>Verizon announced a new Plus Play streaming hub | Verizon</figcaption>    </figure>  <p id=\"8YoQNT\">Verizon announced Thursday that it’s launching a new platform in partnership with Netflix, Peloton, Disney Plus, and other streamers as a hub for customers to “discover, purchase and manage some of their favorite subscriptions.” Called <a href=\"https://www.anrdoezrs.net/links/8532386/type/dlg/sid/verge/https://www.verizon.com/about/news/verizon-announces-new-platform-exclusive-verizon-customers\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Plus Play</a>, the platform will launch with a select group of customers and brands at the end of the month, with a wider launch later this year, the company said in a news release. </p><p id=\"gM3ltn\">Plus Play will centralize streaming subscription services with no additional cost to Verizon subscribers. Plus Play will let Verizon customers manage subscriptions across devices and provide information about deals on content services, like its <a href=\"https://www.theverge.com/2020/8/17/21371902/verizon-unlimited-plans-free-disney-plus-espn-hulu-bundle\">discount for access to the Disney Plus / Hulu / ESPN Plus bundle</a> and other promotional offers. However, with Verizon and other service providers, you’ll want to keep an eye on the fine print. Sometimes, signing up for a discount <a href=\"https://www.theverge.com/2021/12/17/22841372/verizon-custom-experience-opt-out-notification-email-marketing-data-collection\">automatically opts-in users to data collection</a>, like its Custom Experience Plus program that tracks location data, who you call, and what websites you visit.</p><p id=\"GAljFP\">The company said in the news release that as more streaming platforms launch across various content areas — like gaming, music, and news — that it becomes difficult for customers to know what they have, what may be available to them, and whether they’re getting the best value out of their subscriptions.</p><aside id=\"VMcDgY\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"What is the metaverse, and do I have to care?\",\"url\":\"https://www.theverge.com/22701104/metaverse-explained-fortnite-roblox-facebook-horizon\"}]}'></div></aside><p id=\"ygWlmi\">Also during its Thursday Investor Day event, Verizon announced a partnership with Facebook parent company Meta that will explore how the companies can collaborate in a future metaverse. The partnership will look at ways to use Verizon’s 5G network with Meta’s technologies “to understand the foundational requirements for metaverse applications.” </p><p id=\"P7CLgV\">Meta CEO Mark <a href=\"https://www.theverge.com/22749919/mark-zuckerberg-facebook-meta-company-rebrand\">Zuckerberg has made building out the metaverse</a> a key initiative for the company formerly known as Facebook.</p><p id=\"HnjXvP\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UOJo6hAhIS53BSi0em6SwSFLpZI=/0x23:1230x667/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23285914/__Play_Lockup.jpg",
  "description": "A one-stop shop for streaming",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}