{
  "title": "VESA will certify and label DisplayPort 2.0 cables to try to avoid HDMI 2.1 confusion",
  "url": "https://www.theverge.com/2022/2/28/22955471/vesa-displayport-cables-dp40-dp80-labels-speeds-hdmi",
  "date": "2022-02-28T22:30:18.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/FhAE7pagYp84yHToeYBYBL9dwMw=/0x0:1500x1000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70562381/Untitled.0.png\" />    </figure>  <p id=\"wJVGtG\"><a href=\"https://www.theverge.com/2019/6/27/18760897/vesa-displayport-2-spec-standard-features-8k-monitors\">DisplayPort 2.0</a> is finally starting to make its way out into the world <a href=\"https://www.theverge.com/2021/1/14/22230654/displayport-2-monitors-delay-vesa-statement\">after months of delays</a>, and the Video Electronics Standards Association (VESA) is working hard to make sure that customers will be able to actually tell whether cables or devices support the benefits of the standard with a new certification program, the <a href=\"https://www.prnewswire.com/news-releases/vesa-readies-displayport-uhbr-ultra-high-bit-rate-device-certification-and-begins-certification-of-uhbr-cables-301491323.html\">group announced today</a>. </p><p id=\"4daFi4\">The new program is specifically aimed at clarifying when a device supports the DisplayPort UHBR (Ultra-high Bit Rate) data transfer rates supported by DisplayPort 2.0. To that end, VESA is introducing new DP40 and DP80 UHBR cables. DP40-marked cables will be guaranteed to support the UHBR10 standard of 10Gbps across four lanes for a total of 40Gbps, while DP80 cables will support the UHBR20 standard (at up to 20Gbps) across four lanes for a total of 80Gbps. </p><p id=\"PuYJSm\">VESA notes that several approved cables with both full-size DisplayPort and Mini DisplayPort that support the DP40 and DP80 standards are already in production, with the first displays and other devices already being tested for certification. (VESA says it expects hardware to clear the process “soon.”)</p><aside id=\"Np994P\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Don’t buy a monitor or TV just for HDMI 2.1 — read the fine print or you might get fooled\",\"url\":\"https://www.theverge.com/2021/12/13/22833233/hdmi-2-1-fake-marketing-brand-frl-vrr-allm-bandwidth\"}]}'></div></aside><p id=\"Yx0szH\">The goal here is to avoid the kinds of issues that have <a href=\"https://www.theverge.com/2021/12/13/22833233/hdmi-2-1-fake-marketing-brand-frl-vrr-allm-bandwidth\">started to crop up around HDMI 2.1</a> — where a port or cable bearing the “HDMI 2.1” name might not actually support features from the newer spec. “Just because they’re certified to that new standard, doesn’t mean they’re all supported—that’s something that has to be communicated,” said Craig Wiley, VESA board member <a href=\"https://arstechnica.com/gadgets/2022/02/displayport-2-0-labels-specify-bandwidth-to-avoid-hdmi-2-1-like-confusion/\">in an interview with <em>Ars Technica</em></a><em>. </em></p><p id=\"Qx6pkG\">The new labels here strongly resemble the USB Implementers Forum’s (USB-IF) latest attempt to try to clarify data transfer and charging speeds on USB-C cables last year, when it rolled out <a href=\"https://www.theverge.com/2021/9/30/22702453/usb-c-pd-240-watt-charging-usb4-data-transfer-logo-branding-standard\">similar 40Gbps and 20Gbps logos</a> for manufacturers to include on their product pages and packages. </p><p id=\"hHsqbH\">That said, unless VESA is planning to mandate the iconography from its mock-ups on every certified cable (which seems unlikely), it’ll still be difficult to tell what kind of cable you’ve got just by looking at it, although the fact that the company is individually certifying products should help avoid some of the confusion. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ONI936W1r0TcwSLI2fs8MOzMouo=/0x108:1500x893/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23278442/Untitled.png",
  "description": "Look for the DP40 and DP80 labels",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}