{
  "title": "Vevo to ‘review’ security after YouTube feeds for Lil Nas X, Justin Bieber, and others were hacked",
  "url": "https://www.theverge.com/2022/4/6/23012513/youtube-vevo-hack-lil-nas-x-taylor-swift-michael-jackson",
  "date": "2022-04-06T06:42:36.000Z",
  "author": "Richard Lawler",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/eRiRnwpPUzZkcyosE8HNjrsHySI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70715510/acastro_180322_1777_youtube_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"oIaGSF\">On Tuesday morning, YouTube channels for some of the world’s biggest stars showered fans with strange music videos. Vevo channels for artists like Lil Nas X, Eminem, Drake, Taylor Swift, Ariana Grande, Harry Styles, The Weeknd, Michael Jackson, Kanye West, and many others were affected. The channels in question have subscriber counts that add up to hundreds of millions. Before the videos disappeared, viewers saw bizarre clips of Paco Sanz, a Spanish conman sentenced to two years in jail after being convicted of fraud for lying about having terminal cancer, and rapper Lil Tjay.</p><p id=\"ge9JfT\">YouTube did not respond to requests for comment from <em>The Verge; </em>however, Vevo — which bills itself as “the world’s leading music video network” — did acknowledge the incident. A spokesperson responded to contact via Vevo’s public press information and requested not to be named, citing the “nature” of the incident. They said in a statement that “Some videos were directly uploaded to a small number of Vevo artist channels earlier today by an unauthorized source.” </p><div class=\"c-float-right\"><div id=\"9Lew9s\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ATTENTION: Major artists are currently being hacked by <a href=\"https://twitter.com/lospelaosbro?ref_src=twsrc%5Etfw\">@lospelaosbro</a>      <br>so far it looks like Juice WRLD, Eminem, Ariana Grande, Harry Styles, Justin Bieber, Travis Scott, Trippie Redd, Michael Jackson, The Weeknd, and even more artist's YouTube channels have been hacked! <a href=\"https://t.co/UtL6yiKxRF\">pic.twitter.com/UtL6yiKxRF</a></p>— Music Countdowns (@MCountdowns) <a href=\"https://twitter.com/MCountdowns/status/1511280712871145476?ref_src=twsrc%5Etfw\">April 5, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></div><p id=\"2fgKFW\">Besides noting that the videos are gone, they also claimed, “No pre-existing content was accessible to the source. While the artist channels have been secured and the incident has been resolved, as a best practice Vevo will be conducting a review of our security systems.”</p><p id=\"oZ7B8w\">Another <a href=\"https://www.theverge.com/2018/4/10/17218512/youtube-hack-despacito-vevo-music-videos\">Vevo-related breach in 2018 saw popular music videos defaced</a>, while the then-most-viewed YouTube video of all time, “Despacito”<em> </em>(it is now second, behind “Baby Shark”), was vandalized and briefly removed.</p><p id=\"tuTeA2\">Google and YouTube have recently focused on trying to secure popular channels. Last year a report <a href=\"https://www.theverge.com/2021/10/21/22737580/google-youtube-channel-phishing-campaign-report-malware\">highlighted a phishing campaign targeting creators</a>, YouTube <a href=\"https://www.theverge.com/2021/10/5/22710421/google-security-2fa-inactive-account-management\">required millions of popular channels to enable two-step verification</a>, and Google says it gave away hardware authentication keys to over 10,000 high-risk users.</p><p id=\"aItffi\">Despite those precautions, an apparent compromise somewhere along Vevo’s pipeline allowed the attacker, who pointed to their Twitter handle @lospelaosbro in the posts, to continue uploading across high-profile channels for several hours. </p><p id=\"1T6lCO\">The artists or the people who operate their pages were likely unable to do anything about the issue. Vevo’s artist information page explains that it works by creating a separate verified Artist Channel to upload videos, and YouTube merges that content with videos on the artist’s own YouTube page. A <a href=\"https://support.vevo.com/hc/en-us/articles/1260804431129-How-do-I-access-a-Vevo-Artist-Channel-on-YouTube-\">support page</a> states that “Vevo does not provide access directly to artists.” Instead, independent content providers or the artist’s music label will upload the content to Vevo, which sends it to YouTube and <a href=\"https://www.hq.vevo.com/watch\">other channels</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/-X4sjZc4hjT8YMtJcabrQGpMMZA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10480483/acastro_180322_1777_youtube_0001.jpg",
  "description": "Vevo is reviewing its security after the breach",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}