{
  "title": "Virgin Hyperloop switches focus from passengers to cargo as it lays off half its staff",
  "url": "https://www.theverge.com/2022/2/22/22945405/virgin-hyperloop-freight-passenger-focus-lays-off-half-staff",
  "date": "2022-02-22T10:29:58.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"FUTURES exhibit - Washington, DC\" src=\"https://cdn.vox-cdn.com/thumbor/IrGMtGBnkUIA3KRZfqAagyNvBc0=/11x0:4150x2759/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70535684/1235722791.0.jpg\" />        <figcaption><em>An experimental Virgin Hyperloop passenger transport pod on display in Washington, DC in 2021. </em> | Photo by Matt McClain/The Washington Post via Getty Images</figcaption>    </figure>  <p id=\"DkSOKW\">Virgin Hyperloop has laid off almost half its staff as the company switches its focus from transporting passengers to shifting freight. Cuts totaling 111 jobs were confirmed by Virgin Hyperloop <a href=\"https://www.ft.com/content/d87f77bd-0a0a-4512-b983-197f184f5352\">to <em>The Financial Times</em></a>, which spoke to former employees at the company. They described the scale of the redundancies as “definitely not expected.”</p><p id=\"rKW8gn\">The US-based Virgin Hyperloop is one of the leading firms developing the eponymous technology — an updated version of a centuries-old idea to reduce the energy demands of trains by placing them in vacuum-sealed tubes where air resistance is minimal. The concept was resurrected in 2013 when Elon Musk published a whitepaper on the subject, incorporating magnetic levitation used by bullet trains and bestowing the current branding.</p><p id=\"mfUZ0v\">Virgin Hyperloop, formerly known as Hyperloop One, has achieved significant milestones, including the <a href=\"https://www.theverge.com/2020/11/8/21553014/virgin-hyperloop-first-human-test-speed-pod-tube\">first ever test-run</a> with human passengers. But, like many companies trying to bring the experimental technology to fruition, it’s also struggled with attracting funding and talent, and meeting deadlines. In 2017, company execs <a href=\"https://www.theverge.com/2017/7/14/15960686/hyperloop-one-test-success-interview-giegel-pishevar\">told <em>The Verge</em></a><em> </em>they expect to see “working hyperloops around the world... by 2020.” That date was later pushed to 2021. There are currently no working hyperloops in action. </p><div class=\"c-float-right\"><aside id=\"oVBgXo\"><q>Virgin Hyperloop said the decision was triggered by covid and supply chain issues</q></aside></div><p id=\"HRg1AE\">A spokesperson for Virgin Hyperloop told the <em>FT</em> that the recent cuts would allow the company “to respond in a more agile and nimble way and in a more cost-efficient manner” and that the decision to lose so many staff at once had not been “taken lightly.” The spokesperson said the change in focus to freight over passengers “really has more to do with global supply chain issues and all the changes due to Covid.”</p><p id=\"ugyVU4\">Moving cargo instead of people will simplify safety and regulatory burdens, according to DP World — an Emirati, state-owned logistics group that has a 76 percent stake in Virgin Hyperloop. “It’s abundantly clear that potential customers are interested in cargo, while passenger is somewhat farther away,” DP World told the <em>FT</em>. “Focusing on pallets is easier to do — there is less risk for passengers and less of a regulatory process.”</p><p id=\"g4plDA\">As reported by <em>FT</em>, DP World said Virgin Hyperloop was already in discussions with 15 potential customers to deliver a cargo-version of the hyperloop, and that the Saudi Arabian government was considering a route linking its port city of Jeddah with the capital Riyadh.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/89G4QmDrc5K4n4Tzx7KX0mqc43E=/0x291:4160x2469/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262346/1235722791.jpg",
  "description": "Leading hyperloop developer says shifting cargo is easier",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}