{
  "title": "Virgin Galactic plans to open ticket sales to the public for flights to edge of space",
  "url": "https://www.theverge.com/2022/2/15/22934652/virgin-galactic-tourism-ticket-sales-public-rebrand-price",
  "date": "2022-02-15T14:49:36.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/npufNt-5h4V0feInMYR0VAGbAoE=/0x1:4000x2668/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70511128/VP01_2_Gliding_Home.0.jpg\" />        <figcaption><em>Virgin Galactic’s </em>VSS Unity<em> gliding to a runway</em> | Image: Virgin Galactic</figcaption>    </figure>  <p id=\"iqQbYC\">Space tourism company Virgin Galactic announced its <a href=\"https://www.businesswire.com/news/home/20220214005920/en/Virgin-Galactic-Opens-Limited-Opportunity-to-Purchase-Future-Spaceflight-Reservation\">plans to open up ticket sales to the general public</a> on Wednesday, February 16th, giving people an opportunity to buy a ride on the venture’s spaceplane that takes customers to the edge of space and back. </p><p id=\"WGzDkk\">Tickets will run interested customers a cool $450,000. In order to secure their seat, people must pay a $150,000 deposit and then pay the remaining $300,000 before flight. Virgin Galactic has an application that individuals can fill out on <a href=\"https://www.virgingalactic.com/\">the company’s website</a>.</p><div class=\"c-float-right\"><aside id=\"n7N81t\"><q>Tickets will run interested customers a cool $450,000</q></aside></div><p id=\"gkVcA7\">Ticket sales may be opening soon, but it could be a while before customers get the chance to fly. <a href=\"https://www.theverge.com/2021/7/11/22572374/richard-branson-virgin-galactic-space-unity\">Virgin Galactic successfully flew its founder</a>, billionaire Richard Branson, to space in July of last year, a major milestone that the company had always planned to jumpstart its commercial operations. The company then planned to fly a follow-up flight called Unity 23, which would carry three members of the Italian Air Force, becoming the first revenue-generating flight. But in September, Virgin Galactic <a href=\"https://investors.virgingalactic.com/news/news-details/2021/Virgin-Galactic-Provides-Update-on-Unity-23-Test-Flight/default.aspx\">put the flight on pause</a> after finding a manufacturing defect in a company vehicle. The next month, the company gave an update saying that <a href=\"https://investors.virgingalactic.com/news/news-details/2021/Virgin-Galactic-Begins-Planned-Vehicle-Enhancement-and-Modification-Period-Unity-23-Test-Flight-Rescheduled-to-Follow-Completion-of-This-Program/default.aspx\">it would not resume commercial flights until the end of 2022</a> in order to conduct a full “enhancement program” of its vehicles. </p><p id=\"Y064Id\">On top of that, Virgin Galactic also has a bit of a backlog of customers who have already put down reservations for trips to space. For years, the company has had roughly 600 customers who made reservations for $250,000 during the initial ticketing round, <a href=\"https://www.space.com/20886-virgin-galactic-spaceshiptwo-ticket-prices.html\">which began roughly a decade ago</a>. Virgin Galactic then opened ticket sales again last August, allowing people who had expressed interest in purchasing a ticket to the company to actually buy a seat. Those tickets also ran $450,000, secured with a $150,000 deposit. <a href=\"https://www.theverge.com/2021/11/8/22770864/virgin-galactic-q3-earnings-2021-tickets-700-customers\">Virgin Galactic said it sold 100 of those</a>.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CPSiD5-_lEnkgxtBolRWM6rw5ls=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23243381/Hero_Space_01_3_.jpeg\">      <cite>Image: Virgin Galactic</cite>      <figcaption><em>Virgin Galactic’s new logo</em></figcaption>  </figure><p id=\"jfG3Hx\">The company has set an internal goal of reaching 1,000 ticket sales ahead of the first commercial flights this year. There’s still plenty of time left in 2022 for Virgin Galactic to sell 300 more tickets.</p><p id=\"8UFGWF\">To get to space, customers will fly in one of Virgin Galactic’s spaceplanes, which take off from the air. These vehicles are carried to an altitude of roughly 49,000 feet underneath the wing of a massive carrier aircraft called White Knight Two. Once at the right height, White Knight Two releases a plane, which then ignites its onboard rocket engine, initiating the climb to space. As the plane ascends to more than 50 miles above the Earth, passengers on board can unbuckle their seatbelts and float about the cabin for a few minutes. Then to get back down to Earth, the pilots shift the spaceplane’s wings and glide down to a runway, a bit like a regular plane.</p><div class=\"c-float-left\"><aside id=\"pSmSP8\"><q>The company has set an internal goal of reaching 1,000 ticket sales</q></aside></div><p id=\"zzLd1C\">Virgin Galactic’s primary spaceplane vehicle is <em>VSS Unity</em>, which the company unveiled in 2016 and used to take Branson to space. A newly complete plane, <em>VSS Imagine</em>, was unveiled in March of 2021. The company is currently working on a third vehicle, <em>VSS Inspire</em>.</p><p id=\"kj09Jq\">Today’s news comes a week ahead of Virgin Galactic’s next quarterly earnings meaning, scheduled for February 22nd, when the company will discuss its earnings for the fourth quarter of 2022. The update also coincides with a rebrand for Virgin Galactic. The company’s original logo, a close-up image of Stephen Hawking’s eye, has now been replaced with a purple icon of the company’s spaceship and the company’s name.</p><p id=\"YBbvVg\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/P3udaH4wNvIATi9cyQv6Ji6y0G8=/0x287:4000x2381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23243389/VP01_2_Gliding_Home.jpg",
  "description": "It’s a steep price tag.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}