{
  "title": "Virtual podcast events are bringing in six-figure earnings",
  "url": "https://www.theverge.com/2022/3/15/22979006/moment-house-virtual-events-gumball-host-read-marketplace-podcast",
  "date": "2022-03-15T14:45:00.000Z",
  "author": "Aria Bracci",
  "content": "      <figure>      <img alt=\"The webcam of the Samsung Galaxy Chromebook 2.\" src=\"https://cdn.vox-cdn.com/thumbor/ICupue-_A67PNAPDRalyGbyHFEY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70625157/akrales_210226_4438_0170.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"6pxHYX\">Howdy, team! I’m here, on a Tuesday. And what a day to have a platform, because now I can tell you to go <a href=\"https://www.youtube.com/watch?v=olo9MCKosAI\">watch / listen to the premiere</a> of MUNA’s new song at 11:45AM ET. May we sob together. (<a href=\"https://www.instagram.com/p/CbF7CjipHvx/\">The teaser</a> made the music sound somewhat upbeat, but you really never know.)</p><p id=\"xqoCga\"><strong>EXCLUSIVE: Big $$$ in virtual podcast events</strong></p><p id=\"luXozK\">In-person podcast tours have shown that people are willing to pay for something beyond a pre-recorded episode. But virtual versions of those shows? In this climate of Zoom fatigue? Oh yeah, baby. In fact, they’re booming.</p><p id=\"3PPT9h\"><a href=\"https://www.momenthouse.com/\">Moment House</a> has been live-streaming podcast recordings, called “Moments,” since March 2021, and I’m told that the company has sold 140,000 tickets over the course of the 56 that it’s hosted since then. The streams have averaged six-figure payouts for creators; one even reached as high as $500,000. Creators keep all gross revenue (Moment House makes money from a 10 percent service fee on the customer), with many shows returning to the platform quarterly.</p><div class=\"c-float-right\"><aside id=\"SqtHe3\"><q>What happened to Zoom fatigue?</q></aside></div><p id=\"0TX9Aw\">These huge payouts come from a combination of tickets, merch, and tips from the audience, as well as meet-and-greet upgrades or after parties, all of which Moment House helps create a contained environment for. The platform has been a success for big names <a href=\"https://www.momenthouse.com/themcelroyfamily?ref=homepage\">like the McElroy brothers</a> and cult favorites like <a href=\"https://podcasts.apple.com/us/podcast/morbid-a-true-crime-podcast/id1379959217\"><em>Morbid: A True Crime Podcast</em></a><em> </em>and <a href=\"https://podcasts.apple.com/us/podcast/buffering-the-vampire-slayer-a-buffy-the/id1150241800\"><em>Buffering The Vampire Slayer</em></a>, but technically <a href=\"https://www.momenthouse.com/for-creators\">any podcaster can host</a> on the platform.</p><p id=\"subaQy\">Moments are livestreamed and interactive, so they’re well suited to <a href=\"https://www.momenthouse.com/bufferingthevampireslayer?ref=homepage\">improvisational, chatty podcasts</a> with devoted listeners. Bart Coleman, Moment House’s head of comedy, described the events to me as having “‘anything can happen’ energy.” Past Moments have included interactive trivia with audience members and a live merch fundraiser where hosts made a drinking game out of the milestones reached.</p><p id=\"p88Zpo\">Mike Muney, head of creator partnerships, tells us that Moments work considerably well for podcasters, many of whom have the dual goals of making money off of their work and engaging directly with their audiences. (Moment House also hosts concerts and has done so for longer than it’s hosted podcast recordings.) Podcast audiences have shown they’re willing to do their part: common paywalled perks for podcasts are ones that give listeners increased access to podcast hosts, whether through behind-the-scenes episodes or Discord chats. Moment House is a natural extension.</p><p id=\"4OmKnq\">But Moment House isn’t alone in this space. Last spring, <a href=\"https://hotpodnews.com/the-live-event-streaming-experience-with-a-few-twists/\">Nick wrote about</a> the virtual-performance endeavors of the company <a href=\"https://frqncy.live/\">FRQNCY</a>. At the time, there was a lot of doubt swirling around about its shelf life: would it last once audiences were able to return to in-person events? Now, it seems like there’s continued to be more desire for location-agnostic events than we could’ve known.</p><p id=\"xYUpDG\"><strong>Headgum launches its platform for booking host reads</strong></p><p id=\"Wcqkbq\">Last week, the podcast network <a href=\"https://headgum.com/\">Headgum</a> publicly launched <a href=\"https://gumball.fm/\">Gumball</a>, a host-read ad marketplace that the company says is unmatched in being fully automated: brands can walk themselves through transparent booking calendars, playable samples, and audience demographics, then check out; on the other side, podcasters are given tools to manage their own workflow and decision-making (and can <a href=\"https://gumball.fm/join\">apply to join the platform here</a>).</p><p id=\"pM5oPA\">Headgum built Gumball’s tech internally, and for years before the tool’s “debut from stealth,” the company used it to book ads for its own slate of podcasts, then eventually other select shows. CEO Marty Michael tells me he’s excited for even more independent shows to get in on it, especially since they’ve already seen a “halo effect” of sales from the existing relationships that advertisers have with Headgum shows.</p><div class=\"c-float-left\"><aside id=\"4ZapLm\"><q>“Anything that saves time in this busy world, and in this demanding industry, is hugely helpful”</q></aside></div><p id=\"MmAAOS\">“It was working so well,” Michael says, “we thought it was time to go out and talk to investors,” which might be how you heard about Gumball in recent days: the platform just closed a <a href=\"https://www.linkedin.com/posts/gumballfm_gumball-raises-10-million-to-grow-its-podcast-activity-6907061602064162817-2p8O\">$10 million Series A funding round</a>. With that money, the team is bolstering its promotional abilities, as well as Gumball’s technical muscle, to keep scaling. (“We needed to get him an engineering team!” Michael says of Headgum co-founder Andrew Pile, who spearheaded the infrastructure.)</p><p id=\"eNNsvr\"><a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fathleticgreens.com%2Fen&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F15%2F22979006%2Fmoment-house-virtual-events-gumball-host-read-marketplace-podcast\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Athletic Greens</a>, a company that some may recognize for its frequent podcast ads, has been using the beta version of Gumball for almost three years. “Anything that saves time in this busy world, and in this demanding industry, is hugely helpful,” says Martha Gallant, Athletic Greens’ senior director of audio partnerships.</p><p id=\"LccQaZ\">Host-read ads tend to be more complicated to place than other types — just check out <a href=\"https://soundsprofitable.com/update/host-read-ads\">this example process</a>, as outlined in <em>Sounds Profitable</em> — but Athletic Greens still prioritizes them, says Gallant. For the right type of brand, she says, a host read is “the secret sauce of a podcast ad.”</p><p id=\"ToSsjw\"><strong>Spotify podcaster gets questioned, questions why</strong></p><p id=\"A0DLkZ\">Yesterday, the writer Damon Young published an <a href=\"https://www.washingtonpost.com/magazine/2022/03/14/damon-young-am-i-leaving-spotify-that-question-is-dumb/\">op-ed in <em>The Washington Post Magazine</em></a>, outlining the two choices that he feels he’s facing as a creator of a <a href=\"https://open.spotify.com/show/42kxHmWquXQBJCxG0rXvu6\">forthcoming Spotify show</a>, considering that Joe Rogan has caused many creators to question whether to keep aligning with the platform. </p><p id=\"YGLQHg\">First, though, he drives home that the expectation that he, a Black man, take a particular stance against Rogan makes him feel trapped. “Removing my show feels like a loss for me, my staff, my guests, my family, my fans,” writes Young, “and a win for the dummies,” a word that he uses in the piece liberally, but gently, to describe people whose behavior ranges from senseless to discriminatory.</p><p id=\"n39cwp\">He could, he says, proceed as planned with the show or “remove my <a href=\"https://spotify.link/StuckwithDamonYoung\">upcoming Spotify-owned podcast</a> — which is literally about the funny and messy and thorny collisions of race, sex and money — from Spotify, and trash the 18 months of labor invested in it.” Ultimately, Young is choosing not to abandon what he’s worked on, even with the disproportionate pressure for him to be the one to take the loss. After all, the outcome would be far different than it was for the other Young on Spotify.</p><p id=\"QsHTT7\"><strong>A sneaky sound-creation bundle from Spotify</strong></p><p id=\"TQc0w6\">Pivoting to the topic of more explicit, intentional business decisions, Spotify Premium is now available to <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.soundtrap.com%2Fpricing&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F15%2F22979006%2Fmoment-house-virtual-events-gumball-host-read-marketplace-podcast\" rel=\"sponsored nofollow noopener\" target=\"_blank\">bundle with Soundtrap</a>, the “cloud-based audio recording platform” and fellow Swedish company that Spotify <a href=\"https://techcrunch.com/2017/11/17/spotify-acquires-online-music-studio-soundtrap/\">acquired in late 2017</a>. Of note here is that Soundtrap is not strictly for music production but a more general toolkit that distinguishes offerings for “Music Makers” from those meant for “Storytellers.” In other words, it appeals directly to podcasters.</p><p id=\"Tl7a2B\">However, big catch! As <a href=\"https://www.engadget.com/a-spotify-and-soundtrap-bundle-caters-to-creators-of-all-stripes-213130332.html\">pointed out by <em>Engadget</em></a>, “there’s a big drawback to Soundtrap if you’re planning on also publishing on Apple Podcasts, Stitcher or another podcasting service. Soundtrap won’t generate an RSS feed for each episode, which you will need to publish your podcast outside of Spotify.” That feels on brand.</p><p id=\"vs38sr\"><strong>YouTube kicks election disinformation — and Trump</strong></p><p id=\"H73Vkp\">The hosts of the shouty brocast <em>Full Send</em> recently brought Donald Trump on to discuss… who knows what. But the stuff he ended up talking about amounted to “content that advances false claims that widespread fraud, errors, or glitches changed the outcome of the U.S. 2020 presidential election,” according to YouTube, which <a href=\"https://www.huffpost.com/entry/youtube-podcast-interview-donald-trump_n_622b502ce4b02961583a4752\">prompted the episode’s removal</a>. </p><div class=\"c-float-right\"><aside id=\"OxAUOD\"><q>YouTube is used to moderating in a way traditional podcast platforms aren’t</q></aside></div><p id=\"ZcPq3O\"><a href=\"https://hotpodnews.com/insider-january-21st-2022-a-podcast-prediction-check-in/\">I did call it, folks</a>! It’s an election year, public figures were already getting rowdy on podcasts, and Trump seemed like the exact person who’d make headlines at this intersection — it actually already happened, in fact, in an abrupt exit from an NPR interview that I <a href=\"https://hotpodnews.com/insider-january-21st-2022-a-podcast-prediction-check-in/\">noted a few months back</a>. Here we go again.</p><p id=\"cjmxJi\">As of press time, it looks like the <em>Full Send</em> episode is still playable on other major podcast platforms, so there’s an interesting dynamic playing out. Traditional podcasting platforms have been slower to moderate the open ecosystem of RSS-based shows, but YouTube — which has quietly become a podcasting powerhouse — has a long history of moderating its platform, if somewhat imperfectly. With podcasts, there are several examples to point to even just from recent months, like <a href=\"https://www.independent.co.uk/news/world/americas/joe-rogan-podcast-youtube-robert-malone-b1986008.html\">removing Joe Rogan content for vaccine misinformation</a> and <a href=\"https://thehill.com/policy/technology/591495-youtube-permanently-bans-dan-bongino\">permanently banning Dan Bongino</a>.</p><p id=\"shBWOl\"><strong>And a deal for reVolver and SXM Media</strong></p><p id=\"ezmGS0\">To wrap up, this partnership, which was <a href=\"https://www.prnewswire.com/news-releases/siriusxm-signs-exclusive-multi-year-agreement-with-leading-multicultural-audio-network-revolver-podcasts-301500357.html\">announced last Thursday</a>, gives SXM Media “exclusive global ad sales rights to reVolver’s extensive lineup of podcasts,” which includes popular Spanish-language shows like <a href=\"http://www.elshowdepiolin.net/\"><em>El Show de Piolín</em></a> and <a href=\"https://elerazno.com/?v=f24485ae434a\"><em>Erazno y La Chokolata</em></a>. All shows from <a href=\"https://www.revolverpodcasts.com/\">reVolver</a> — “the leading multicultural, audio-on-demand content creator and publisher in the U.S.,” according to the press release — will be distributed and available on all podcast platforms, by way of Stitcher.</p><p id=\"zULHNV\">Thanks for reading! Hi, mom!</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vU7qacuq7nh-4cemDeXgyxdYogs=/0x45:2040x1113/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22333700/akrales_210226_4438_0170.jpg",
  "description": "What happened to Zoom fatigue?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}