{
  "title": "Visualizing the scale of the carbon removal problem",
  "url": "https://www.theverge.com/2022/4/7/23013822/carbon-dioxide-removal-direct-air-capture-climate-change",
  "date": "2022-04-07T18:08:01.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"The fan and air intake of the direct air capture system stands at the Carbon Engineering Ltd. pilot facility in Squamish, British Columbia, Canada, on Monday, Nov. 4, 2019.\" src=\"https://cdn.vox-cdn.com/thumbor/X6dB8ZKmw7jEc0ot8jhrT7eRdnY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70722641/GettyImages_1186605531.0.jpeg\" />        <figcaption><em>The fan and air intake of the direct air capture system stands at the Carbon Engineering Ltd. pilot facility in Squamish, British Columbia, Canada, on Monday, Nov. 4, 2019.</em> | Photo by James MacDonald/Bloomberg via Getty Images</figcaption>    </figure>  <p id=\"IjENs4\">To get climate change under control, experts say,<strong> </strong>we’re going to have to start sucking a whole lot more planet-heating carbon dioxide out of the air. And we need to start doing it fast. </p><p id=\"k8lwgD\">Over the past decade, climate pollution has continued to grow, heating up the planet. It’s gotten to the point that not one but two major climate reports released over the past week say we’ll have to resort to a still-controversial new technology called Direct Air Capture<strong> </strong>(DAC)<strong> </strong>to keep our planet livable. Finding ways to remove carbon dioxide from the atmosphere is “<a href=\"https://www.ipcc.ch/report/ar6/wg3/\">unavoidable</a>,” a <a href=\"https://www.theverge.com/2022/4/4/23009804/united-nations-climate-change-report-greenhouse-emissions-2030-ipcc\">report</a> from the United Nations Intergovernmental Panel on Climate Change says.</p><div class=\"c-float-right\"><aside id=\"1P4bAq\"><q>Finding ways to remove carbon dioxide from the atmosphere is “unavoidable”</q></aside></div><p id=\"WY7FE5\">We already have some direct air capture facilities that <a href=\"https://www.theverge.com/2021/9/9/22663597/largest-direct-air-capture-plant-c02-climeworks-iceland\">filter carbon dioxide out of the air</a>. The captured CO2 can then be stored underground for safekeeping or used to make products like <a href=\"https://grist.org/article/direct-air-carbon-capture-global-thermostat/\">soda pop</a>, <a href=\"https://www.vox.com/energy-and-environment/2019/11/13/20839531/climate-change-industry-co2-carbon-capture-utilization-storage-ccu\">concrete,</a> or even <a href=\"https://electrek.co/2021/10/19/is-the-first-fossil-free-jet-fuel-made-from-co2-viable-the-us-air-force-thinks-so/\">aviation fuel</a>. </p><p id=\"Fd0kpG\">But this kind of carbon removal is still being done at a very small scale. There are just 18 direct air capture facilities spread across Canada, Europe, and the United States. Altogether, they can capture just 0.01 million metric tons of CO2. To avoid the worst effects of climate change, we need a lot more facilities with much larger capacity, according to a recent <a href=\"https://www.iea.org/reports/direct-air-capture-3\">report</a> from the International Energy Agency (IEA). By 2030, direct air capture plants need to be able to draw down 85 million metric tons of the greenhouse gas. By 2050, the goal is a whopping 980 million metric tons of captured CO2.</p><p id=\"n6bapK\">It’s hard to understand how massive that kind of growth is, so we decided<strong> </strong>to draw it out. The small black box below is how much CO2 existing direct air capture plants remove from the atmosphere today. The next generation of direct air capture plants is supposed to be way bigger, with a single plant able to capture the equivalent of all the blue boxes (plus the black box) together — 1 million metric tons of CO2 per year.   </p><div>  <figure class=\"e-image\">        <img alt=\"One black square representing 0.01 million metric tons of CO2 sits alongside 99 blue squares. Altogether, the black and blue square represent 1 million metric tons of captured CO2.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/COYXKIn4s6nmuDCDdBWplREmcDo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372992/VRG_Data_5131_DAC_01.png\">  </figure></div><p id=\"aM03qd\">Fast forward to 2030, and if the IEA’s vision comes true, there’ll be a lot more of those giant facilities. The blue and orange boxes below represent 85 million metric tons of captured CO2, the IEA’s goal for the end of the decade.</p>  <figure class=\"e-image\">        <img alt=\"A blue square representing 1 million metric tons sits among 84 other yellow squares. Altogether, the square represent a total of 85 million metric tons of captured CO2.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/eEmc7bxKt7uEtONL0Mh-GGY2y84=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372995/VRG_Data_5131_DAC_02.png\">  </figure><p id=\"nqDY44\">But 2030 is just a milestone on the way to a much bigger goal. By 2050, if the best-case scenario plays out,<strong> </strong>humans should have balanced out their carbon emissions.<strong> </strong>That means ditching fossil fuels, first and foremost. (For this scenario to work out, carbon removal can’t become a crutch for the fossil fuel industry — something activists are very <a href=\"https://docs.google.com/document/d/e/2PACX-1vTmu-V4zSm4tSFiLGV1gGAmTlJTdtCu8A78UKww8p8dQ2b-GdmBevAToYgefg2dwdNYh_IwjLVddmlh/pub\">worried about</a>.) Any stubborn greenhouse gas emissions that remain will need to be captured. Ideally, that should really only come from heavy industries that can’t easily turn to renewable energy — like <a href=\"https://www.nature.com/articles/d41586-021-02612-5#:~:text=But%20concrete%20has%20a%20colossal,into%20moulds%20before%20it%20dries.\">cement</a> manufacturing, which makes up 8 percent of global greenhouse gas emissions<strong>. </strong></p><p id=\"IEDCVp\">So, in addition to cutting emissions, the IEA projects we’ll need to scale up carbon removal dramatically. More than 30 new direct air capture plants would need to be built each year, on average, to reach its 2050 goal. Each of those plants would need to be able to draw down 1 million metric tons of CO2 a year, for a total of 980 million metric tons per year in 2050.  </p>  <figure class=\"e-image\">        <img alt=\"980 squares representing 980 million metric tons of CO2, the total amount of captured CO2 the IEA says is needed by 2050.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yuE9HTGFeW_uMlGsYTdxLS9Hm2Q=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23372997/VRG_Data_5131_DAC_03.png\">  </figure><p id=\"odfxen\">In the image above, the blue is what one futuristic DAC plant might capture, the orange is how much CO2 needs to be captured by 2030, and the pink represents the 2050 goal for captured CO2. </p><p id=\"onKov6\">Again, what we can capture now is just one one-hundredth of that blue square. And the first plant big enough to capture as much CO2 as that blue square represents isn’t expected to come online until the mid-2020s. So we’re already behind schedule when it comes to the IEA’s plans, and speeding things up is expected to come with a hefty price tag (right now, it typically costs upwards of $600 to capture a mere ton of CO2).<strong> </strong></p><p id=\"f8gGXY\">On top of that, there’s the question of what happens to all that carbon once it’s sucked out of the air. In addition to building the plants, you’ve got to lay out pipelines to transport the captured CO2. And then you have to find places to safely store the greenhouse gas. Some carbon removal proponents want to bury CO2 at the bottom of the <a href=\"https://www.theverge.com/2022/1/31/22910757/federal-court-decision-carbon-capture-storage-gulf-of-mexico-exxonmobile\">Gulf of Mexico</a>, for example. As you can imagine, plans to build new pipelines and dredge the seafloor have already <a href=\"https://www.theverge.com/2021/11/18/22789506/exxonmobil-gulf-of-mexico-lease-sale-carbon-capture-sequestration\">pissed people off</a>. </p><p id=\"eWpsnW\">Despite all that, companies, industries, and think tanks keep posing direct air capture as a key piece of the puzzle to stopping climate change. It might be possible. But looking at the sheer scale of the problem is an important reality check. From where we are now to the expansive future these new reports envision, carbon removal technologies face a long — and bumpy — road. </p><p id=\"h6xIHz\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EUDtGjbMlSJ70nUgcohrjgLdGUc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23374293/GettyImages_1186605531.jpeg",
  "description": "Two new reports make the case for a big build-out of controversial climate tech.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}