{
  "title": "Volkswagen reportedly will resurrect Scout as an off-road EV brand for the US",
  "url": "https://www.theverge.com/2022/5/11/23066867/volkswagen-scout-resurrect-ev-off-road-brand",
  "date": "2022-05-11T15:32:50.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/KnyySkHsW3jYJ3TKw_E2XR899wE=/1x0:640x426/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70856778/61Scout.0.jpeg\" />        <figcaption>The first model, a 1961 Scout 80, in pickup style with removable hardtop. | <a class=\"ql-link\" href=\"https://en.wikipedia.org/wiki/International_Harvester_Scout#/media/File:61Scout.jpg\" target=\"_blank\">Dutchtower</a></figcaption>    </figure>  <p id=\"cYpRmL\">Volkswagen is considering resurrecting the SUV pioneer Scout as an off-road electric vehicle brand, <a href=\"https://www.wsj.com/articles/volkswagen-is-bringing-back-the-scout-the-suv-pioneer-as-an-ev-11652220001\">according to <em>The</em> <em>Wall Street Journal</em></a><em>. </em>The brand would be focused on the US market, where it would likely compete with popular nameplates like the Jeep Wrangler and Ford Bronco. </p><p id=\"RDnEoF\">According to the <em>Journal</em>, VW’s board of directors is set to approve the plan on Wednesday. The plan envisions Scout operating as a subsidiary of VW, much like Audi, Skoda, Porsche, Lamborghini, and Bentley. (A VW spokesperson declined to comment, noting that the report refers to actions taken by Volkswagen Group’s supervisory board.)</p><p id=\"eq3yPz\">VW is one of the largest automakers in the world but only holds a small share of the US market. The plan to bring back Scout as an electric off-roading brand is clearly aimed at winning over US car buyers, which are increasingly interested in trucks and SUVs. The plan would mark the first time VW has created a separate brand focused on the US. </p><div class=\"c-float-right\"><aside id=\"57j9jK\"><q>VW hopes to eventually sell 250,000 Scout-branded vehicles in the US annually</q></aside></div><p id=\"SynPwT\">VW hopes to eventually sell 250,000 Scout-branded vehicles in the US annually, with production set to kick off in 2026, the <em>Journal</em> reports, citing sources familiar with the planning. </p><p id=\"VXz6Sj\"><a href=\"https://techcrunch.com/2022/05/10/vw-launch-scout-ev-off-roading-brand-us/\"><em>TechCrunch </em>has a rendering</a> of what some of the vehicles could look like. One appears to be similar to VW’s Atlas SUV, which can seat seven, while the other is a pickup truck in the vein of the VW Amarok. </p><p id=\"L3bmiJ\">The Scout was first introduced in 1961 by International Harvester as a small, two-door SUV. A precursor to the more sophisticated SUVs to come, it was intended to compete with Jeep, featuring rugged details and a fold-down windshield. The Scout and second-generation Scout II were produced in Fort Wayne, Indiana, as two-door trucks with a removable hardtop. </p><p id=\"97Mkdj\">Production stopped in 1980, and VW acquired the rights to the brand when it bought Navistar International in 2020. (Navistar was created in 1985 when International Harvester went out of business.)</p><p id=\"8WxGkk\">VW has hinted at its interest in making electric off-road vehicles in the past with concepts like the ID Buggy, an electric dune buggy. For VW, the buggy is meant to show off the versatility of its MEB, or “Modulare E-Antriebs-Baukasten,” which is German for “modular electric drive matrix.” The company is betting big on its MEB platform, which will serve as the basis for the <a href=\"https://www.engadget.com/2018/09/17/vw-to-sell-10m-electric-cars-on-new-platform/\">10 million electric cars</a> it wants to sell.</p><p id=\"Nup0BP\">VW is reportedly willing to pump $1 billion into the new Scout brand, which could include building a new manufacturing facility, and hiring a whole swath of US-based executives. The company could also seek outside financing for the project, with the possibility of listing the subsidiary on the public markets once it’s up and running. </p><p id=\"R8DMSD\">Still, VW will have to contend with supply chain constraints, battery material shortages, and rising inflation as it seeks to get this new EV venture off the ground. The company’s CEO Herbert Diess recently said that VW is “basically sold out on electric vehicles in Europe and in the United States” for the year. Anyone hoping to get an EV from VW, Audi, or any of the group’s other brands may have to wait until 2023 as the company tries to navigate the chip shortage and production issues from <a href=\"https://www.theverge.com/2022/4/20/23033394/tesla-shanghai-factory-sleep-eat-factory-closed-loop-covid\">COVID shutdowns in China</a>.</p><p id=\"k9VsQC\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/3kQ3__Ghc2Ilu_IzeGwJQHChEnU=/0x46:640x381/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23453155/61Scout.jpeg",
  "description": "Competition for Jeep and Ford",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}