{
  "title": "Wall Street Journal owner News Corp suffers cyberattack by hackers linked to China",
  "url": "https://www.theverge.com/2022/2/4/22917671/wall-street-journal-news-corp-cyberattack-china-fox-news-hackers",
  "date": "2022-02-04T15:21:43.000Z",
  "author": "Kim Lyons",
  "content": "      <figure>      <img alt=\"Entrance to Fox News headquarters at NewsCorp Building in...\" src=\"https://cdn.vox-cdn.com/thumbor/dVwhHcFPgK51z7XI_bYcHOrQ3uk=/0x0:3100x2067/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70471192/1236761612.0.jpg\" />        <figcaption>News Corp says it was the target of a hack | Photo by Erik McGregor/LightRocket via Getty Images</figcaption>    </figure>  <p id=\"wK8PGi\">News Corp, the media company that owns <em>The Wall Street Journal</em>, said in a <a href=\"https://investors.newscorp.com/node/11716/html\">Friday filing</a> with the Securities and Exchange Commission (SEC) that it was the victim of a cyberattack last month. Its security consultant Mandiant, which is investigating the hack, believes the attackers “are likely involved in espionage activities to collect intelligence to benefit China’s interests,” Mandiant vice president of incident response David Wong said in an email to <em>The Verge</em>. </p><p id=\"1owgFy\">According to the SEC filing, the company discovered in January that one of its cloud-based systems was the target of “persistent cyberattack activity.” A preliminary analysis found that “foreign government involvement may be associated with this activity, and that data was taken.” News Corp. said in the filing that its financial and customer data were not affected and that it believes the threat activity has been contained. <a href=\"https://www.wsj.com/articles/cyberattack-on-news-corp-believed-linked-to-china-targeted-emails-of-journalists-others-11643979328\"><em>The Wall Street Journal</em> reported</a> Friday that emails and documents of its journalists were among those targeted in the hack. </p><p id=\"VfwzNF\">In addition to the <em>Journal</em>, News Corp also owns the <em>New York Post</em> and Dow Jones. It wasn’t clear Friday how the hack was conducted or how many News Corp employees’ data were affected.</p><p id=\"XGZcpb\">In January 2013, <a href=\"https://www.wsj.com/articles/SB10001424127887323926104578276202952260718?mod=article_inline\"><em>The Wall Street Journal</em> was the target of an attack</a> by hackers linked to the Chinese government, in what was described as an attempt to monitor reporters covering China. The hackers infiltrated the Journal’s computer systems, the paper reported at the time. <em>The New York Times </em>said it also <a href=\"https://www.nytimes.com/2013/01/31/technology/chinese-hackers-infiltrate-new-york-times-computers.html\">was infiltrated by Chinese hackers</a> in January 2013 in a similar cyberattack.</p><p id=\"9m8pys\"></p><p id=\"EUWDfp\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/1QI3ouNr2E_nui8h0aVJgOp706s=/0x67:3100x1690/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23217805/1236761612.jpg",
  "description": "The Journal reports journalists’ documents and emails were targeted.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}