{
  "title": "WarnerMedia and Discovery have completed their mega-streaming merger ",
  "url": "https://www.theverge.com/2022/4/8/22972247/warnermedia-discovery-complete-merger-streaming-hbo-max",
  "date": "2022-04-08T21:31:54.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/u9y0yq2cn-vOycopb8pp6uFnIuc=/225x0:2025x1200/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70728473/WBD_VerticalLogo_OnLight_CMYK.10.jpg\" />    </figure>  <p id=\"tUpHgs\">The parents of HBO Max and Discovery Plus have officially completed their merger, allowing WarnerMedia and Discovery to build what the companies have said will be “the most differentiated content portfolio in the world.”</p><p id=\"TeHtf0\">Investors today approved the <a href=\"https://www.theverge.com/2021/6/1/22448140/warner-bros-discovery-warnermedia-new-name-merger-att\">multibillion-dollar deal</a> that will allow AT&amp;T, WarnerMedia’s current owner, to offload its content powerhouse to Discovery and form a new business under the name Warner Bros. Discovery. This new business, the <a href=\"https://about.att.com/story/2021/warnermedia_discovery.html\">companies said</a> last year, “will be able to invest in more original content for its streaming services, enhance the programming options across its global linear pay TV and broadcast channels, and offer more innovative video experiences and consumer choices.”</p><p id=\"AKKZzE\">Discovery president and CEO David Zaslav is set to helm the new company, a massive responsibility during a time of significant change for WarnerMedia (the clear crown jewel of this merger). <a href=\"https://www.theverge.com/2022/4/5/23011678/warnermedia-ceo-jason-kilar-exit-discovery-deal\">Jason Kilar</a> and a number of other <a href=\"https://twitter.com/pkafka/status/1511750056973643781\">AT&amp;T-era executives</a> are out at WarnerMedia, and a new leadership team under Zaslav <a href=\"https://corporate.discovery.com/discovery-newsroom/discovery-inc-announces-future-leadership-team-for-warner-bros-discovery/\">was announced</a> shortly before the deal’s finalization. </p><div class=\"c-float-right\"><aside id=\"OqxJEZ\"><q>HBO Max and Discovery Plus are expected to merge into a single platform.</q></aside></div><p id=\"CeYkBq\">The agreement will allow AT&amp;T to pay off its <a href=\"https://www.theverge.com/2020/1/30/21115181/att-direct-tv-time-warner-acquisition-debt-streaming-wars\">gargantuan debt</a> while positioning Discovery as a more formidable competitor in the streaming and studio space. </p><p id=\"kBWjbN\">HBO Max and Discovery Plus are eventually <a href=\"https://www.theverge.com/2022/3/14/22976876/hbo-max-discovery-plus-merge-app-confirmed\">expected to merge</a> into a single service. As AT&amp;T said last year, the deal will allow the two companies to “combine WarnerMedia’s storied content library of popular and valuable IP with Discovery’s global footprint, trove of local-language content and deep regional expertise across more than 200 countries and territories.” </p><p id=\"uDDTD2\">From a value perspective, this deal maths out. Most streamer owners are clambering over each other to buy up precious IP and diversify their portfolios enough to take on goliaths like Netflix, says Anthony Palomba, a professor of business administration at UVA’s Darden School of Business. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/jhnSp8XlxK6Iwjxjl7LRSA-Jqf0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23377656/WBD_HorizontalLogo_OnLight_CMYK.jpg\">  </figure><p id=\"AYnjR1\">“This is a merger that makes a lot of sense,” Palomba told <em>The Verge </em>by phone recently. “If you look at the stocks for AT&amp;T — which has been on the downward trend for about the last five years — and then you look at Discovery, which has been on a downward trend for maybe almost a decade now, it made sense to make this.”</p><p id=\"P50Knl\">At the same time, both companies specialize in two content businesses that seem, at least with respect to their studio legacies, at odds. HBO is renowned for critically acclaimed series like <em>Euphoria</em> and <em>Watchmen</em>. Discovery, meanwhile, is best known best for its unscripted content — think ghost hunting and <em>90 Day Fiancé</em>. </p><div class=\"c-float-right\"><aside id=\"yrRRik\"><q>“These streaming services are under the gun to showcase value differently.”</q></aside></div><p id=\"R3Cp87\">Sure, that gives Discovery the Netflix advantage of having something for pretty much anyone (a thing HBO Max has tried to pull off, arguably with mixed results). But should company executives choose to cannibalize one service for the benefit of another, that’ll only serve to further complicate their respective brand identities, which, at least in HBO Max’s case, has already been rebranded by AT&amp;T to the point of little recognition.</p><p id=\"AZCICz\">“If HBO stayed the course of being curated — perhaps targeting what was once known as the yuppie segment, the young urban professionals, perhaps the highly educated or perhaps the highly meticulous or persnickety or picky consumer — it wouldn’t have to compete against Netflix or Disney,” Palomba says. “Because that’s a completely different market. And that’s a market that remains tried-and-true and, frankly, would stand out more with a consumer decision.”</p><p id=\"AoGBw5\">There’s a question of how much mega-mergers like the one between WarnerMedia and Discovery actually benefit consumers at the end of the day. <a href=\"https://gizmodo.com/get-ready-for-hbo-max-and-discovery-to-become-one-mega-1847992208\">Bundling and rebranding</a> that give consumers more choice are, in theory, a great bargain. In practice, we’re more likely to end up with conflated production ethoses, strange mashups of algorithmically suggested content, and more consumer frustration with finding the stuff to watch. At the end of the day, it’s hard not to wonder if these company executives have any legitimate consumer-focused direction in mind at all.</p><p id=\"fFBTyg\">“If I’m thinking of the average consumer, do they really care that WarnerMedia and Discovery are together? I wonder if these strategic library acquisitions are for the investors,” Palomba says. “These streaming services are under the gun to showcase value differently. At a certain point — that’s why you’re seeing ad tiers coming in — the amount of spending on content that has to happen to look sexy, to look appealing, to grab anybody is a game that’s going to be hard to sustain long term.”</p><p id=\"sH7SXb\">More selection is all well and good. But at the cost of becoming cable’s successor in terms of charging consumers for stuff we don’t even want, it’s worth asking: what’s actually in it for us?</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/__7-X7eBZ24Qladfpgu9FjyCRmA=/0x11:2250x1189/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23377655/WBD_VerticalLogo_OnLight_CMYK.jpg",
  "description": "So, what does that mean for streamers?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}