{
  "title": "WarnerMedia is being sued for releasing The Matrix Resurrections on HBO Max",
  "url": "https://www.theverge.com/2022/2/7/22922237/warnermedia-warner-bros-sued-matrix-resurrections-hbo-max-release",
  "date": "2022-02-07T20:33:27.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"The Matrix Resurrections\" src=\"https://cdn.vox-cdn.com/thumbor/Fn2vwCo9l6cIYuunsUtpP6RtgTc=/230x0:1906x1117/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70481117/rev_1_MX4_TRLR_013rv2_High_Res_JPEG.0.jpeg\" />        <figcaption>Warner Bros.</figcaption>    </figure>  <p id=\"o4MGop\">Another major studio is facing a lawsuit over the day-and-date releases of a highly anticipated title. Village Roadshow Films, which co-produced <em>The Matrix Resurrections</em> with Warner Bros., is suing WarnerMedia for releasing the film on HBO Max the same day it debuted in theaters.</p><p id=\"ug2FoH\">The lawsuit, <a href=\"https://www.documentcloud.org/documents/21198863-village-roadshow-complaint-with-exhibits_final\">filed today</a> in Los Angeles Superior Court, alleges that WarnerMedia “rushed” the release of <em>The Matrix Resurrections</em> from 2022 to 2021 so that the film could debut as part of an internally coded initiative known as “Project Popcorn.” This release model would trade box office revenue for streaming subscriptions, depriving partners of revenue tied to the film’s performance.</p><p id=\"828Sny\">Throughout 2021, WarnerMedia opted to release its full slate of films <a href=\"https://www.theverge.com/2020/12/3/22150605/hbo-max-warner-bros-movies-2021-simultaneous-release-matrix-godzilla-suicide-squad-space-jam\">simultaneously on HBO Max</a> the same day they premiered in theaters as part of its pandemic strategy. (Warner Bros. has since returned to <a href=\"https://www.theverge.com/2021/3/23/22346613/warner-bros-theatrical-releases-2022-hbo-max\">exclusive theatrical commitments</a> in 2022.) The suit characterizes Project Popcorn as WarnerMedia’s “clandestine plan to materially reduce box office and correlated ancillary revenue generated from tent pole films that Villiage Roadshow and others would be entitled to receive in exchange for driving subscription revenue for the new HBO Max service.” </p><p id=\"6PXwXb\">In a statement shared with <em>The Verge,</em> Warner Bros. called the lawsuit “a frivolous attempt by Village Roadshow to avoid their contractual commitment to participate in the arbitration that we commenced against them last week. We have no doubt that this case will be resolved in our favor.” </p><div class=\"c-float-right\"><aside id=\"G1zxRO\"><q>The release’s “cumulative result was devastating”</q></aside></div><p id=\"m2cSAs\">As was the case in <a href=\"https://www.theverge.com/22611516/scarlett-johansson-disney-lawsuit-streaming-services-transparency\">Scarlett Johansson’s lawsuit against Disney</a> over the simultaneous release of <em>Black Widow </em>during the pandemic, Village Roadshow claims that releasing <em>The Matrix Resurrections</em> under this model provided “zero benefit” to itself, its talent, or its partners. A film that “should have been an incredibly valuable sequel to <em>The Matrix</em> trilogy” helped drive up the value of HBO Max and boost its subscribers, the suit claims, but hurt the film’s theatrical revenue and “inflicted serious harm to the entire Matrix franchise.”</p><p id=\"5WK9wF\">“The hit to <em>The Matrix Resurrections</em>’ box office returns was not the result of just the cannibalization from streaming but from the rampant piracy it knew would come by distributing this marquee picture on a streaming platform on the same day as its theatrical release,” the suit states. “The cumulative result was devastating.”</p><p id=\"Y6k3YV\">Village Roadshow has been working with Warner Bros. for decades and has co-financed 91 titles, including <em>Joker</em>, the <em>Ocean’s</em> franchise, and <em>The Matrix</em> films. The company alleges that Warner Bros. is now pushing them away, attempting to cut them out when it comes to working on and profiting from franchise works.</p><p id=\"49nol4\">These disagreements over rights extend to projects like <em>Wonka</em> and a series based on <em>Edge of Tomorrow</em>, which is a Village Roadshow film. In the case of <em>Edge of Tomorrow</em>, Warner Bros. “insisted that Village Roadshow relinquish its co-finance and co-ownership rights voluntarily.”</p><div class=\"c-float-right\"><aside id=\"6hJPOk\"><q>“[The] abysmal theatrical box office sales figures from The Matrix Resurrections dilute the value of this tent pole franchise.”</q></aside></div><p id=\"JjgwC7\">“When Village Roadshow refused, WB said the quiet part out loud: it will not allow Village Roadshow to benefit from any of its Derivative Rights going forward, despite the over $4.5 billion it has paid WB to make and distribute 91 films,” the lawsuit states. “In other words, if Village Roadshow won’t give up its rights, WB will make sure they are worth nothing.”</p><p id=\"klN3ke\">In a statement, Mark Holscher, a Kirkland &amp; Ellis litigation partner representing Village Roadshow, said that Warner Bros. “has a fiduciary duty to account to Village Roadshow for all earnings from the exploitation of the films’ copyrights, not just those it can’t hide through sweetheart deals to benefit HBO Max.” </p><p id=\"QqmNYO\">Among its allegations, Village Roadshow claims Warner Bros. knew of potential detriments to profit and piracy problems and went ahead with a hybrid release of <em>The Matrix Resurrections</em> anyhow, thereby not only harming the franchise’s earnings but also its legacy.</p><p id=\"i5E8cW\">The suit states that there’s no doubt that “the abysmal theatrical box office sales figures from <em>The Matrix Resurrections</em> dilute the value of this tent pole franchise as a film’s lack of profitability generally prevents studios from investing in additional sequels and derivative films in the near term.” </p><hr class=\"p-entry-hr\" id=\"ttgE55\"><h2 id=\"su8GSM\">Related:</h2><div id=\"vXDND3\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Keanu Reeves and Carrie-Anne Moss Interview (YT)|104877\" data-volume-uuid=\"4900396db\" data-volume-id=\"104877\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-374\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/McRslLA8qMlh2htw5VUI6Teg3ik=/2x0:2135x1117/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23115209/rev_1_MX4_TRLR_013rv2_High_Res_JPEG.jpeg",
  "description": "It \"inflicted serious harm to the entire Matrix franchise.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}