{
  "title": "Watch a raptor gets clotheslined in Jurassic World: Dominion’s latest trailer",
  "url": "https://www.theverge.com/2022/4/29/23048195/jurassic-world-dominion-trailer-2-chris-pratt-dryce-dallas-howard-sam-neill-jeff-goldblum",
  "date": "2022-04-29T11:44:49.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_BHhU3R__NBiN2BKRhXWW_7kupQ=/63x0:738x450/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70809415/image.0.png\" />    </figure>  <p id=\"2iSi8V\">When <em>Jurassic World: Dominion’s </em><a href=\"https://www.theverge.com/2022/2/10/22927076/jurassic-world-dominon-trailer\">last trailer</a> was released, my colleague Chaim Gartenberg boldly argued that <a href=\"https://www.theverge.com/tldr/22927445/jurassic-world-dominion-dinosaur-future-raptor-fight-battle-win\">he wasn’t at all scared</a> by the prospect of a dino-infested future. “Humans have things like armies and weapons and walls and cities. We’ve grown pretty good at the whole “keeping animals away from us” strategy,” he wrote. “Sure, Jurassic Park posits that a raptor could open a door — but can it eat through concrete? Can it successfully use the weird electronic swipe card that I need to get into our office building?”</p><p id=\"oLE2RG\"><a href=\"https://www.youtube.com/watch?v=DtQycgMD4HQ\"><em>Dominion’s</em> latest trailer</a> doesn’t have an answer to these questions. But it does answer our burning follow-up about whether a raptor is clever enough to avoid being clotheslined after a quick bit of thinking by Bryce Dallas Howard’s Claire Dearing.</p><p id=\"GpFYvt\">The answer? No. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/X9zqj30Kn83wblSrJNZ3u8dZB5w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23425231/Jurassic_World_Dominion__Trailer_2_HD_2.gif\">      <cite>Screenshot: Jurassic World: Dominion</cite>      <figcaption><em>Dino, meet pole.</em></figcaption>  </figure><p id=\"Ne0tFb\">The new trailer offers some interesting new plot details about the latest entry in the Jurassic franchise. We already knew <em>Dominion </em>is set three years after 2018’s <em>Jurassic World: Fallen Kingdom</em>, with the franchise’s resurrected dinosaurs having escaped to co-exist with humanity around the world. But now it seems the plot might actually revolve around <em>helping </em>one such dinosaur, by reuniting them with their mother after she’s taken by... poachers? It’s unclear.</p><p id=\"HU83hr\">Mostly I’m just happy this setup is being used as an excuse for some truly wild set-pieces, like having Chris Pratt’s Owen Grady be chased around the streets of Rome by hordes of raptors, or hunted down under the surface of a frozen lake. Along with Pratt and Howard who starred in the more recent <em>Jurassic World</em> movies, <em>Jurassic Park’s</em> original stars Sam Neill, Laura Dern, and Jeff Goldblum are also set to reprise their roles when <em>Dominion</em> debuts on June 10th.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gSoIXuKbHozQFe9Hrd6shdgkS4I=/0x16:800x435/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23425232/image.png",
  "description": "Releasing June 10th.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}