{
  "title": "Watch a swarm of drones autonomously track a human through a dense forest",
  "url": "https://www.theverge.com/2022/5/5/23058160/drone-swarm-autonomous-navigation-dense-forest-person-tracking",
  "date": "2022-05-05T11:33:26.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/N9sa2WXwyrOG6rjdgtytAueUHts=/100x0:1180x720/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70834662/maxresdefault.0.jpg\" />    </figure>  <p id=\"Qja4Le\">Scientists from China’s Zhejiang University have unveiled a drone swarm capable of navigating through a dense bamboo forest without human guidance. </p><p id=\"X3mZVo\">The group of 10 palm-sized drones communicate with one another to stay in formation, sharing data collected by on-board depth-sensing cameras to map their surroundings. This method means that if the path in front of one drone is blocked, it can use information collected by its neighbors to plot a new route. The researchers note that this technique can also be used by the swarm to track a human walking through the same environment. If one drone loses sight of the target, others are able to pick up the trail. </p><p id=\"9EWyPy\">In the future, write the scientists <a href=\"https://www.science.org/doi/10.1126/scirobotics.abm5954\">in a paper published</a> in the journal <em>Science Robotics, </em>drone swarms like this could be used for disaster relief and ecological surveys. </p><p id=\"1Dupo6\"></p><div class=\"c-float-right\"><aside id=\"evIlcv\"><q>Drones share data to plan routes and track targets</q></aside></div><p id=\"xpm95i\">“In natural disasters like earthquakes and floods, a swarm of drones can search, guide, and deliver emergency supplies to trapped people,” they write. “For example, in wildfires, agile multicopters can quickly collect information from a close view of the front line without the risk of human injury.”</p><p id=\"zbNWyk\">However, experts say the work also has clear military potential. A number of nations — most prominently the US, China, Russia, Israel, and the UK — are currently developing drone swarms that could be used in war. Militaries tend to invoke surveillance and reconnaissance as the most common applications for this work, but the same technology could undoubtedly be used to track and attack both combatants and civilians.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rDRw8n5w4wJjo3O3hXIvo7QL7F8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23439626/Screenshot_2022_05_05_at_12.08.57.png\">      <cite>Image: <a class=\"ql-link\" href=\"https://www.science.org/doi/10.1126/scirobotics.abm5954\" target=\"_blank\">Science Robotics / Xin Zhou et al</a></cite>      <figcaption><em>An illustration from the paper showing how multiple drones can be used to track a target even if the view from one drone is blocked. </em></figcaption>  </figure><p id=\"EUUDit\">Elke Schwarz, a senior lecturer at Queen Mary University of London whose specialisms include the use of drones in combat, says this research has clear military potential. </p><p id=\"51SmhY\">“The capability to navigate cluttered environments, for example, is desirable for a range of military purposes, including for urban warfare,” Schwarz tells <em>The Verge</em>. “As is the ability to ‘follow a human’ — here I can see how this converges with projects that seek to develop lethal drone capabilities that minimize risk to on-the-ground soldiers in urban environments.”</p><div class=\"c-float-right\"><aside id=\"5GtnCI\"><q>“The capability to navigate cluttered environments is desirable for a range of military purposes”</q></aside></div><p id=\"oOVXc6\">The recent war between Russia and Ukraine has shown how quickly <a href=\"https://foreignpolicy.com/2022/04/27/drones-russia-ukraine-war-donbas/\">drone technology can be adapted for the battlefield</a> and what a devastating effect it can have. Both sides in the conflict are using cheap consumer drones for reconnaissance and, sometimes, offense. One method involves using drones to drop grenades onto opposing forces. <a href=\"https://dronedj.com/2022/05/04/video-tweet-credits-phantom-3-in-ukraine-grenade-drop-through-russian-sunroof/\">A recent video</a> showed Ukrainian troops using what appears to be a DJI Phantom 3 drone (price-tag: $500) to drop a grenade through the sunroof of a car supposedly driven by Russian soldiers. </p><p id=\"FDsPek\">What makes drone swarms potentially more dangerous than lone machines, though, is not just their numbers but their autonomy. No single human can simultaneously control a swarm of 10 drones, but if this task can be offloaded to algorithms then military planners are more likely to embrace the use of this sort of autonomous system in war.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/z7y3mFfgTNFrMXbcF51I7_pzEqY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23439628/Screenshot_2022_05_05_at_12.13.53.png\">      <cite>Image: <a class=\"ql-link\" href=\"https://www.science.org/doi/10.1126/scirobotics.abm5954\" target=\"_blank\">Science Robotics / Xin Zhou et al</a></cite>      <figcaption><em>Drones in the swarm are capable of navigating through gaps as small as 30 centimeters. </em></figcaption>  </figure><p id=\"0tXz60\">Currently, drone swarms are limited in their application. The most common real world use-case is creating <a href=\"https://www.theverge.com/2016/5/4/11590646/faa-drone-swarm-intel-light-show-part-107\">elaborate light shows</a>. But in these scenarios, drones are following preset trajectories in open spaces, using tracking technology like GPS to locate themselves. </p><p id=\"PVDceg\">The research from Zhejiang University advances on this by using only on-board sensors and algorithms to control the drones’ flight without prior mapping of their environment. “This is the first time there’s a swarm of drones successfully flying outside in an unstructured environment, in the wild,” Enrica Soria, a drone swarm researcher at the Swiss Federal Institute of Technology Lausanne, <a href=\"https://www.france24.com/en/live-news/20220504-drone-swarms-can-now-fly-autonomously-through-thick-forest\">told <em>AFP</em></a>. Soria added that the work was “impressive.” </p><p id=\"G8tN4A\">In their paper, the scientists note that approaches to drone swarms tend to follow one of two programming paradigms: either “bird” or “insect.” In an “insect” swarm, the focus is on fast, reactive movements that require less forward-planning while a “bird” swarm tries to direct drones along long, flowing paths (the latter being the researchers’ approach). Both methods have their trade-offs, as thinking like an insect requires less computing power, but planning like a bird is more energy efficient. But, as the computing capacity of hardware improves, programming bird-like behavior has become more attainable.</p><p id=\"aoVigh\">Schwarz notes that although the focus in such drone swarm research is often on these technological achievements, this can obscure the trickier questions of <em>how</em> such work should be deployed. She cites the observations of 20th century US mathematician Norbert Wiener, whose work laid the foundations for AI development. </p><p id=\"AEwZOB\">Says Schwarz: “[Weiner] said — in the 1960s — that there is a disastrous focus on and obsession with ‘know-how’, which tends to eclipse the moral question we should be asking: what is it good for.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_2mwyreXKIMbslFXIvpNaJLQMkc=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23439635/maxresdefault.jpg",
  "description": "The work has potential military applications, say experts",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}