{
  "title": "Watch Blue Origin launch its fourth crewed mission to space",
  "url": "https://www.theverge.com/2022/3/31/23003226/blue-origin-ns-20-mission-new-shepard-watch-live",
  "date": "2022-03-31T12:00:00.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/zh6Rdb6tu9rRCjAGhv-S8Y1M8xg=/0x86:4200x2886/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70693223/ns19_launch_tower_clear.0.jpg\" />    </figure>  <p id=\"sObCuV\">This morning, space tourism venture Blue Origin will launch its fourth passenger flight to the edge of space and back — but this time, there won’t be any big name celebrities on board. Six crew members — five paying customers and one company employee — will be flying this mission, as Blue Origin transitions into regular commercial flights.</p><p id=\"fPrAi0\">Originally, SNL star and comedian Pete Davidson was <a href=\"https://www.theverge.com/2022/3/14/22976721/pete-davidson-blue-origin-space-new-shepard-launch-march-snl\">supposed to be on this mission</a> as a guest, back when the flight was supposed to take place on March 23rd. But Blue Origin wound up pushing the trip back a week, and <a href=\"https://www.theverge.com/2022/3/18/22984441/blue-origin-space-pete-davidson-new-shepard\">Davidson was no longer able to participate</a> with the new launch date. To fill his seat, Blue Origin swapped in Gary Lai, the chief architect of the New Shepard — the rocket the crew will ride to space.</p><div class=\"c-float-right\"><aside id=\"UVmhJn\"><q>SNL star and comedian Pete Davidson was supposed to be on this mission</q></aside></div><p id=\"eXZenv\">As for the rest of the crew, married couple Marc and Sharon Hagle will be on board. Marc Hagle is the CEO of residential and commercial development firm Tricor International, while Sharon Hagle runs a non-profit called SpaceKids Global to encourage students to pursue STEAM education. Marty Allen, “a turnaround CEO and angel investor,” and Jim Kitchen, “a teacher, entrepreneur, and world explorer,” will be riding along. Rounding out the group is George Nield, the former associate administrator of the Office of Commercial Space Transportation at the Federal Aviation Administration. He was once responsible for licensing the launches he’s about to fly on.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/a_AeDzSGM00u6RGLPKmBGchN9qw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23357289/2022_03_21_ns20social_astrogrid.png\">      <cite>Image: Blue Origin</cite>      <figcaption><em>Blue Origin’s crew for today’s launch</em></figcaption>  </figure><p id=\"m9XAEP\">While Blue Origin’s passenger flights are still relatively new, the company has tried to reserve at least one seat for a celebrity per flight. <a href=\"https://www.theverge.com/2021/12/11/22829232/blue-origin-new-shepard-michael-strahan-six-crew-success\">Good Morning America anchor Michael Strahan</a> was on the most recent flight in December, while <a href=\"https://www.theverge.com/2021/10/13/22724058/blue-origin-william-shatner-new-shepard-flight-success\">Star Trek captain William Shatner was on the flight before that</a>. Jeff Bezos, the founder of Blue Origin, <a href=\"https://www.theverge.com/2021/7/20/22582735/blue-origin-jeff-bezos-space-launch-landing\">famously rode on New Shepard’s very first crewed flight</a> in the summer of 2021, along with Wally Funk, a legendary female aviator who strived to go to space back when NASA did not accept women astronauts.</p><p id=\"Jl4Dzk\">To get its passengers to space, New Shepard launches vertically from Blue Origin’s launchpad near Van Horn in West Texas. Crew members ride inside a capsule mounted on top of the vehicle. Together, the rocket and capsule climb to space, reaching a height around 65 miles high, where they eventually separate. Passengers inside get a few brief minutes of weightlessness, as well as a spectacular view of the curvature of the Earth. Before long, both the rocket and capsule then fall back to Earth; the rocket lands upright after reigniting its engine while parachutes slow the capsule’s touch down.</p><p id=\"QvhH5S\">Blue Origin plans to begin live coverage of the mission at 8:10AM ET, with launch scheduled for an hour later. There may not be any flashy names this time, but this flight may be more typical of what Blue Origin flights will look like as the company’s trips to space become more regular.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/CLjx2Iq9yfhVMoR8jOT0plHgcRc=/0x387:4200x2586/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23357278/ns19_launch_tower_clear.jpg",
  "description": "Live coverage begins at 8:10AM ET",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}