{
  "title": "Watch NASA roll out its new mega-rocket, the Space Launch System, for the first time",
  "url": "https://www.theverge.com/2022/3/17/22982792/nasa-sls-mobile-launch-platform-roll-out-watch-live-stream",
  "date": "2022-03-17T19:03:35.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5bUcf0MZkUI9ttVUl-GDvIbWxyY=/0x96:1298x961/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70637011/NHQ202203160004_large.0.jpg\" />    </figure>  <p>The fully stacked vehicle is about to crawl to its launchpad</p> <p class=\"p--has-dropcap\" id=\"5dAFFS\">This afternoon, NASA will begin the very slow process of rolling out its brand new rocket, the Space Launch System, transporting the fully stacked vehicle out to its primary launchpad at Kennedy Space Center in Florida. It’s a major moment for the rocket, which has been in development for the last decade, <a href=\"https://www.theverge.com/2022/3/17/22978972/nasa-sls-monster-rocket-roll-out-florida-history\">but after numerous delays and hiccups</a>, the vehicle’s launch may finally be on the horizon.</p><p id=\"LVgT35\">The Space Launch System, or SLS, has spent most of the last year tucked away in NASA’s Vehicle Assembly Building, a massive warehouse structure at KSC used to house and integrate giant rockets. There, the pieces of the vehicle have been stacked together and tested, getting everything ready for this moment.</p><div class=\"c-float-right\"><aside id=\"lncgT9\"><q>the vehicle will embark on an 11-hour journey across four miles of KSC terrain</q></aside></div><p id=\"fGBu6Z\">Now, the vehicle will embark on an 11-hour journey across four miles of KSC terrain on top of NASA’s crawler-transporter, a tank-like platform with massive tracked wheels that will slowly roll the rocket over the ground. On top of the crawler is a specially modified mobile launch platform that SLS will take off from in the future. It includes a platform and a support tower that stands about 355 feet tall. The final destination for SLS is its main launch pad, LC-39B, a historic spot once used to launch an Apollo mission to orbit the Moon and flights of the Space Shuttle.</p><div id=\"Ds6hYF\"><div ><iframe src=\"https://www.youtube.com/embed/21X5lGlDOfg?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"rCJDOG\">If all goes well today, NASA plans to conduct what is known as a wet dress rehearsal in early April, a major event where engineers will simulate an actual launch day, filling the vehicle up with propellant and counting down close to the moment of launch. NASA will then roll the SLS back to the VAB and conduct more tests before rolling out the rocket again for its first launch sometime this summer.</p><p id=\"IBn0S9\">Though SLS still has a ways to go before launch, this is the first time the fully stacked vehicle will see the light of day. Don’t expect many theatrics, though. The crawler-transporter moves at roughly a mile per hour, so the SLS will be taking its time getting across KSC. </p><h2 id=\"NUsJ0g\"><strong>HOW DO I WATCH?</strong></h2><p id=\"Tp6CXL\">NASA plans to livestream the SLS rollout on its dedicated channel, NASA TV, with coverage starting at 5PM ET. You can watch the feed on <a href=\"https://www.nasa.gov/multimedia/nasatv/#public\">NASA’s website</a> or on <a href=\"https://www.youtube.com/watch?v=21X5lGlDOfg\">YouTube</a>.</p><h2 id=\"kXpvAf\"><strong>WHAT TIME IS ROLLOUT?</strong></h2><p id=\"XanXlB\">SLS will start rolling out of the VAB shortly after 5PM ET on March 17th.</p><p id=\"2vRK5P\"><strong>Scheduled start time:</strong> New York: 5PM / San Francisco: 2PM / London: 9PM / Berlin: 10PM / Moscow: 12AM / New Delhi: 2:30AM / Beijing: 5AM / Tokyo: 4AM / Melbourne: 8AM</p><p id=\"YsNja8\"></p><p id=\"GbzoAX\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/soOPAG7M0FZaiU3I4taUOT8-u24=/0x188:1298x868/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23323437/NHQ202203160004_large.jpg",
  "description": "Finally, the SLS will see some sun.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}