{
  "title": "Watch the first trailer for Zenless Zone Zero from the creators of Genshin Impact",
  "url": "https://www.theverge.com/2022/5/13/23070689/zenless-zone-zero-trailer-rpg-beta-pc-ios",
  "date": "2022-05-13T14:49:06.000Z",
  "author": "Andrew Webster",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/pa5kCyKobc4k6QZpyflDcObuPz8=/205x0:910x470/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70865331/Screen_Shot_2022_05_13_at_10.21.50_AM.0.png\" />    </figure>  <p id=\"c3xAoz\">The studio behind the breakout hit <em>Genshin Impact</em> is back with a new game — and you can watch the first trailer right now. Called <em>Zenless Zone Zero</em>, the game takes place in a post-apocalyptic city called New Eridu, which has been subject to an event known as “the sub-hollow disaster.” Based on the trailer, it appears to be an action-heavy RPG with some killer music and character designs, where players will fight plenty of monsters while looking very cool.</p><p id=\"Gbp6kR\"><em>Zenless</em> is notable in particular because it comes from Mihoyo, the Chinese studio best-known for the global smash hit <em>Genshin Impact</em>, which first launched in 2020 and is available across PC, mobile, and PlayStation. The two games look like they share much in common — including an anime-inspired visual style — but <em>Zenless</em> swaps the fantasy setting for a grittier post-apocalyptic vibe.</p><p id=\"OCsIJI\">There aren’t many other details about the game, but it’s due to launch on both iOS and PC — <a href=\"https://zenless.hoyoverse.com/en-us/news/102133\">players can sign up</a> to check out an early “tuning test” now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/L3752DJr91bJvYWXOlmctW1T4wo=/108x0:1006x470/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23461495/Screen_Shot_2022_05_13_at_10.21.50_AM.png",
  "description": "No release date yet",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}