{
  "title": "Watch 14 minutes of gameplay from Hogwarts Legacy, the upcoming Harry Potter RPG",
  "url": "https://www.theverge.com/2022/3/17/22983770/hogwarts-legacy-harry-potter-rpg-gameplay-reveal-trailer-release-date",
  "date": "2022-03-17T21:55:36.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MIHUg2yB0Sz5bJyyefVtW7Qz0C4=/194x0:2258x1376/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70638069/Screen_Shot_2022_03_17_at_5.03.39_PM.0.png\" />    </figure>  <p id=\"haOVOC\"><em>Hogwarts Legacy</em>, the upcoming open-world Harry Potter RPG, got its first proper gameplay reveal from developer Avalanche Software ahead of its release date later this year at a special PlayStation State of Play stream that showed off 14 minutes of footage from the game. </p><p id=\"x5sKQL\">(Despite the Sony-hosted debut, Hogwarts Legacy isn’t a PlayStation exclusive and will also be released on PC, Xbox One, and Xbox Series X / Series S in addition to the PlayStation 4 and PlayStation 5.) </p><p id=\"h65nBq\">Players will get to create their own character, be sorted into one of the four Hogwarts houses, and take classes (although they’ll be starting Hogwarts as a late-fifth-year student, presumably to avoid a serious RPG starring an 11-year-old.) </p><p id=\"VIBgtG\"></p><div class=\"c-float-right\"><aside id=\"HTAYMW\"><q>Live your own Hogwarts adventure</q></aside></div><p id=\"UVgwCE\">Combat will involve using different spell combinations to exploit specific enemy weaknesses or abilities, with the ability to mix and match “dozens” of spells in duels. Players will also be able to customize their characters with magical gear and abilities as they progress through the game. </p><p id=\"G4VeSo\"><em>Hogwarts Legacy</em> shares a broad setting with other entries in the franchise, but given that the game is set in the 1800s — decades before the events of either the original books or the more recent <em>Fantastic Beasts </em>franchise of films — don’t expect to see too many familiar faces. Instead, the story will focus on a possible rebellion of goblins against the Wizarding World (something that happens with concerning regularity, it seems) and the usual cadre of dark wizards and dangerous beasts. </p><p id=\"3PGutd\">Originally announced for a <a href=\"https://www.theverge.com/21440330/harry-potter-hogwarts-legacy-ps5-playstation-5-trailer-open-world-sony\">2021 release date</a>, <em>Hogwarts Legacy</em> <a href=\"https://www.theverge.com/2021/1/13/22229085/hogwarts-legacy-delay-2022-release-date\">was delayed</a> to a 2022 date shortly after its announcement. The game has also experienced no shortage of controversy: <a href=\"https://www.theverge.com/2021/3/5/22315226/hogwarts-legacy-leavitt-resigns-developer-avalanche-youtube-gamergate\">its lead designer left the project</a> due to contentious YouTube videos defending the Gamergate movement. Warner Bros. has also had to <a href=\"https://www.theverge.com/2020/9/17/21443940/hogwarts-legacy-jk-rowling-transphobia-warner-bros-robert-galbraith\">clarify explicitly</a> that Harry Potter creator J.K. Rowling isn’t directly involved in the game following a series of transphobic comments online from the author. “J.K. Rowling is not directly involved in the creation of the game, however, her extraordinary body of writing is the foundation of all projects in the Wizarding World,” the company wrote. “This is not a new story from J.K. Rowling.”</p><p id=\"9TETpp\"><em>Hogwarts Legacy</em> is coming to PC, PS5, PS4, Xbox One, and Xbox Series X / Series S this holiday season.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jPVysLxIR1l7JUFeEOJ4NLJ_ElE=/0x46:2452x1330/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23324919/Screen_Shot_2022_03_17_at_5.03.39_PM.png",
  "description": "The first real gameplay reveal for the upcoming game",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}