{
  "title": "Watching the r/Place timelapse is like staring into the heart of Reddit",
  "url": "https://www.theverge.com/2022/4/7/23015418/reddit-r-place-recap-video-gif-timeline",
  "date": "2022-04-07T20:50:48.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"A screenshot of what the r/Place canvas looked like before it was erased.\" src=\"https://cdn.vox-cdn.com/thumbor/GaDYBG9IZkqTLP8lcCpEeijrAkE=/0x0:1440x960/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70723372/unnamed_1_2022_04_06_231519_ccdh.0.png\" />        <figcaption>Image: Reddit</figcaption>    </figure>  <p id=\"zpbzWj\">Even though you can no longer place tiles on Reddit’s r/Place canvas, which was a <a href=\"https://www.theverge.com/2022/3/28/22999689/reddit-bringing-back-r-place-april-fools-day-experiment-public-art\">revival of an April Fools’ Day experiment</a>, the platform has given us the chance to relive the experience. The company has provided a treasure trove of data, including <a href=\"https://www.redditinc.com/blog/the-day-redditors-broke-the-internet-again?r\">a recap post</a> that goes over numbers and statistics (things like which country placed the most tiles or which subs talked about r/Place the most), alongside <a href=\"https://www.reddit.com/r/place/comments/txvk2d/rplace_datasets_april_fools_2022/\">an entire CSV dataset</a> for people to tinker with if they’d like. </p><p id=\"tCor2L\">But, as someone who watched the chaos unfold by checking in every hour or so (and placed a few tiles of my own), the coolest thing Reddit posted is a <a href=\"https://www.reddit.com/r/place/comments/txufad/the_complete_rplace_timelapse/\">three-minute-long timelapse</a> that shows how the canvas was shaped by users over four days.</p><p id=\"kNxV0m\">Watching it evolve is like staring into the heart of Reddit. You get to see communities fighting to take over tiles or collaborating to make their own pieces of artwork — which included everything from an <em>Among Us</em> crewmate to a giant trans pride flag. And, you know, a terrifying face peeking out from a void (which pops up multiple times, of course).</p><p id=\"ckNI5J\">The GIF finally ends with an explosion of white — not because everyone teamed up to wipe the board clean like an Etch A Sketch, but because Reddit made it so users could only place white tiles at the end. Thankfully, everyone’s tiling work isn’t gone forever. If you go to r/Place now, there’s an <a href=\"https://www.reddit.com/r/place/?cx=999&amp;cy=999&amp;px=643&amp;ts=1648817027221\">interactive version of the canvas</a> where you can scrub through the entire 80-plus-hour experience, and zoom in as far as you’d like. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/XWG9EIn2XudnF2wEaqtOxknS0zE=/0x0:1440x754/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23374775/unnamed_1_2022_04_06_231519_ccdh.png",
  "description": "There’s a three-minute GIF and all the data you could want.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}