{
  "title": "Watch Valve’s Gabe Newell deliver Steam Decks to mostly confused customers",
  "url": "https://www.theverge.com/tldr/2022/3/1/22956123/gabe-newell-valve-steam-deck-hand-delivery",
  "date": "2022-03-01T11:00:57.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/EaZDGMnRAdEwWGIq8guUejXPUP0=/0x0:1964x1309/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70564015/Screen_Shot_2022_03_01_at_10.36.54_AM.0.jpg\" />        <figcaption><em>Newell personally handing an early Steam Deck to a customer.</em> | Screenshot: Valve</figcaption>    </figure>  <p id=\"UZUQ6O\">One of my favorite things about famous game developers is how hyper-specific their fame is. So naturally I was delighted to see a promotional video put out by Valve showing its co-founder and president Gabe Newell — one of the most famous game developers in the world — confusing the heck out of some members of the public by hand-delivering Steam Decks in person. </p><p id=\"iVyU1e\">To be fair, a handful of recipients immediately recognize a face-masked Newell when he shows up at their doorstep with a Steam Deck in hand. But in a lot of other cases the deliveries are accepted on behalf of other members of the household. “What’s with the camera crew?” the confused wife of a <a href=\"https://www.reddit.com/r/SteamDeck/comments/t2fmg0/comment/hylsx25/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">man on a ski trip</a> asks, while another politely checks whether they need to sign anything before closing the door. </p><div id=\"wZIkVN\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We hired a new delivery guy to help with the Steam Deck launch, not sure he's going to work out. <a href=\"https://t.co/JgcpTIBX7u\">pic.twitter.com/JgcpTIBX7u</a></p>— Steam Deck (@OnDeck) <a href=\"https://twitter.com/OnDeck/status/1498462075915407364?ref_src=twsrc%5Etfw\">March 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"OvEcmk\">My favorite aspect of the video, though, is that Newell is a little embarrassed at having signed these early Steam Deck units. “Hopefully people won’t get mad that I’m signing them,” Newell quips to camera early on, before apologetically saying “I signed it, I hope that’s ok,” to one recipient. It’s a very relatable moment from one of the biggest names in video games.</p><p id=\"nJTun1\">As for the console itself, you can check out what we thought of it in our <a href=\"https://www.theverge.com/22950371/valve-steam-deck-review\">exhaustive review</a>. While the Steam Deck undoubtedly has a <em>lot</em> of potential, the device that’s currently shipping to people is buggy, unstable, and generally feels unfinished. But if Valve is prepared to give the Steam Deck the same level of attention and ongoing support as its most popular games, then it might just have a huge success on its hands.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/B1097UvfA5oVSPSJ4qC-XDKAGm8=/0x141:1964x1169/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23279482/Screen_Shot_2022_03_01_at_10.36.54_AM.jpg",
  "description": "‘What’s with the camera crew?’",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}