{
  "title": "WaterField finally made a great Analogue Pocket case",
  "url": "https://www.theverge.com/23016218/waterfield-analogue-pocket-pouch-review-game-boy-games",
  "date": "2022-04-08T14:00:00.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/LuHyStOLq53BKUWN28zDlChj_xI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70726003/IMG_2336.0.jpg\" />    </figure>  <p id=\"LruV2p\">Once you’ve overcome the not inconsiderable challenge of obtaining an <a href=\"https://www.theverge.com/22831589/analogue-pocket-review\">Analogue Pocket</a>, your next task is figuring out how to play the thing outside your home. It’s a beautifully designed system that you’ll want to protect, but there aren’t many case options beyond Analogue’s own, which is an awkward clear plastic box that was seemingly more intended for storage and display than on-the-go use.</p><p id=\"DFQHQe\">The best one I’ve found so far <a href=\"https://www.sfbags.com/products/analogue-pocket-pouch\">comes from WaterField Designs</a>, the San Francisco company we’ve covered a few times in the past for its <a href=\"https://www.theverge.com/2017/4/7/15216188/waterfield-designs-staad-bolt-backpack-review\">leather-clad backpacks</a> and <a href=\"https://www.theverge.com/2018/8/19/17719222/waterfield-designs-pro-executive-laptop-backpack-review-specs-price\">laptop bags</a>. The Analogue Pocket Pouch is a simple, stylish $49 accessory that protects your console and gives you storage for a few Game Boy games.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nGNlPI__wPPQ-gnumGjgw63kdC4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23375826/IMG_2338.jpg\">      <figcaption><em>The pouch latches shut with hidden magnets.</em></figcaption>  </figure><p id=\"mFEyEJ\">Unlike some of WaterField’s more expensive products, the Analogue Pocket Pouch is mostly made of a functional canvas material. It’s available in black, red, blue, and green. (I’ve been using the red version, and I think it looks great.) The closest this product comes to luxurious flair is the interior, which features a plush padded material that’s reassuringly soft.</p><p id=\"YJ0k5o\">The pouch latches shut with magnets that are hidden in the opening. I found these magnets to be a little weak — often the pouch would be open when I went to take it out of a bag. The Analogue Pocket fits very snugly inside, though, so I don’t think there’s much risk of it coming out of the pouch inadvertently in transition.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PJIKkKNmEtSbpMvVqc-SthTDEng=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23375827/IMG_2339.jpg\">      <figcaption><em>The pouch easily fits two Game Boy games and three Game Boy Advance games, or more if you squeeze.</em></figcaption>  </figure><p id=\"12xBoU\">The pouch’s other main feature is a zip pocket that’s designed to hold Game Boy games and a charging cable. WaterField says it’s good for two Game Boy cartridges; I found that you could fit four (two on top of two), but it makes the pouch bulge a little and may not protect the games as effectively. Similarly, you can easily fit three shorter Game Boy Advance cartridges in the pocket — or six if you stack three more. All in all, this is a solid amount of storage for a system that’s still designed to run original physical software.</p><p id=\"qgL3PJ\">There’s not that much more to say about WaterField’s Analogue Pocket Pouch. It does what I want it to, which is to make the Analogue Pocket a more viable portable console. WaterField has already sold through 10 batches of the pouch; you can order one from the 11th batch now, and it’ll ship April 22nd.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pq4oH6yZLB_-PMHwrvvpuZbAjv8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23375823/IMG_2336.jpg",
  "description": "Now you can actually take the Pocket outside.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}