{
  "title": "WeCrashed is the podcast-to-TV-show pipeline’s weirdest one yet",
  "url": "https://www.theverge.com/22984498/wecrashed-review-apple-tv-plus",
  "date": "2022-03-18T16:55:32.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Anne Hathaway as Rebekah Neumann and Jared Leto as Adam Neumann in WeCrashed.\" src=\"https://cdn.vox-cdn.com/thumbor/TmbE0-afOImWlbnMJEmKLCiMBvM=/718x533:5919x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70641883/ATV_WeCrashed_Photo_010303.0.jpg\" />        <figcaption>Anne Hathaway as Rebekah Neumann and Jared Leto as Adam Neumann in WeCrashed. | Apple TV+</figcaption>    </figure>  <p>Apple’s WeWork drama is yet another podcast reborn as a TV show</p> <p id=\"iV2wJ2\">If it wasn’t already abundantly apparent from Hulu’s <a href=\"https://www.theverge.com/2022/2/25/22948048/the-dropout-review-hulu-elizabeth-holmes\"><em>The Dropout</em></a><em> </em>and Showtime’s <a href=\"https://www.theverge.com/2022/2/26/22951082/super-pumped-review-uber-showtime-series\"><em>Super Pumped: The Battle for Uber</em></a>, Apple TV Plus’ <a href=\"https://www.theverge.com/2022/1/19/22891975/apple-tv-plus-wework-jared-leto\"><em>WeCrashed</em></a><em> </em>is an unsubtle reminder of Hollywood’s current obsession with turning relatively recent news cycles focused on disgraced tech founders into glitzy prestige dramas. <em>WeCrashed</em> has enough in common with its peers that you can easily recognize a nascent formula the industry seems to be latching onto with these adaptations. But the new show manages to bring something slightly different to the table with a set of performances that are as unforgiving as they are fascinating to watch, given who <em>WeCrashed </em>is about and who’s portraying them.</p><p id=\"GMDqby\">Based on the Wondery podcast of the same name, <em>WeCrashed</em> from co-creators Lee Eisenberg and Drew Crevello chronicles the story of how Adam Neumann (Jared Leto) went from selling ill-fitting baby clothes to building one of the world’s largest coworking companies and ultimately being ousted from the organization in just a few years. The real Neumann is enough of a self-aggrandizing character that it’s easy to imagine versions of this series that focused solely on him. But<em> WeCrashed </em>knows how crucial the stories of Neumann’s wife Rebekah (Anne Hathaway) and his co-founder Miguel McKelvey (Kyle Marvin) are to understanding the origins of WeWork, its culture, and how a real estate startup managed to convince everyone to see it as a tech company worth investing millions of dollars into.</p><p id=\"hEqgAC\">Because there are always people who might not necessarily have been following the news at the time, <em>WeCrashed </em>chronicles the WeWork story by jumping between significant points in the company’s history, starting in 2019 — the year WeWork’s board of directors moved to remove Neumann as CEO. <em>WeCrashed </em>first introduces Neumann at a time when <a href=\"https://www.theverge.com/2019/9/18/20872777/we-work-adam-neumann-tequila-weed-ipo-eternal-life\">his reputation</a> as a compelling orator and tenacious entrepreneur had been severely damaged by widespread reports of things like <a href=\"https://www.cnn.com/2019/11/15/tech/wework-lord-taylor-hudsons-bay/index.html\">WeWork’s reckless spending</a>, a <a href=\"https://www.vox.com/the-goods/2018/10/12/17969190/wework-lawsuit-sexual-assault-harassment-retaliation\">sexist workplace culture</a>, and <a href=\"https://fortune.com/2019/11/19/wework-softbank-takeover-lawsuits/\">a growing pile of lawsuits</a>. Even though the writing was very much on the wall for Neumann by 2019, <em>WeCrashed</em> shows you how confident he still was in the belief that he’d lead WeWork to a successful IPO because that sort of unwavering faith in himself does seem to have been one of his guiding principles as a founder. </p><p id=\"F6jERY\">Most of Neumann’s classmates at Baruch College can’t help but laugh at that confidence when they listen to him pitch years before in one of <em>WeCrashed</em>’s many flashbacks. But it’s precisely what pulls McKelvie into his orbit and convinces him to get in on another coworking venture that would act as a precursor to WeWork. While <em>WeCrashed </em>generally presents its story in a way that’s meant to be informative to those coming to the WeWork saga fresh, Eisenberg and Crevello’s scripts put a focus on Neumann’s interactions with those closest to him in order to establish the idea that his success in business was an outgrowth of his willingness to take advantage of people. </p><p id=\"6dskDP\"><em>WeCrashed</em>’s montage detailing the feverish all-nighter McKelvey single-handedly pulled that led to Greendesk’s creation feels very much a part of the current set of founder shows. Here, though, the sequence also serves as one of the many examples of Neumann’s willingness to take credit for the work of others and of how those around Neumann often felt unable to speak up for themselves.</p><p id=\"L0YSYl\">Compared to Marvin’s McKelvey, who often feels as if he’s comfortable playing second fiddle to Leto’s cartoonish, but not inaccurate, take on Neumann, Hathaway as Rebekah Neumann (née Paltrow, of those Paltrows), enters as a knowing presence who can recognize her soon-to-be husband’s insatiable hunger for business as the red flag it truly is. Rebekah has some understanding of the emotional void that exists within Adam because it’s something she herself has grappled with, and <em>WeCrashed </em>frames them as a couple bound together by a shared attraction and a marked undercurrent of madness that morphs over time.</p><p id=\"xLQXln\"><em>WeCrashed </em>doesn’t exactly deploy many tricks to distract you from the fact that, structurally, it isn’t all that different from other shows about founders. This is both because there’s only so much viable reinvention of the wheel when it comes to adapting real-world events into entertainment and because many unicorn companies’ stories have certain details in common, like founders overpromising in order to secure money from investors. </p><p id=\"H8BbId\">What <em>WeCrashed </em>has going for it — and the show smartly leans into to differentiate itself — is the fact that two of the actual people its central characters are based on are known to be rather eccentric in ways that both Hathaway and Leto are more than down to have fun with. </p><p id=\"BXnHJ7\">Tempting as it may be to interpret <em>WeCrashed</em>’s Neumann as Jared Leto simply being Jared Leto in the name of art, his performance <em>is </em>legitimately impressive when you actually compare it to any of the many clips of Neumann that can be found online. The same is true of Hathaway’s Rebekah, who moves through multiple unsatisfying and unsuccessful lives as a stock trader, yoga instructor, and actress, all while living in her much more successful cousin’s shadow. Though Hathaway’s vocal imitation of and comportment as Neumann are what immediately jumps out, what ends up making her performance one of <em>WeCrashed</em>’s bright spots is how its strangeness speaks to an emotional turmoil that Rebekah herself can’t directly articulate.</p><p id=\"MkyZbe\"><em>WeCrashed </em>isn’t a comedy, but there is a comedic quality to the show, even in some of its most serious moments because of how so many of the people involved in the WeWork story behaved in utterly ridiculous ways. Throughout the show, the truth about what WeWork is — a company that subleases office space — repeatedly pierces the thick, opaque bubble of distorted reality Neumann projects, and it will leave you wondering why, exactly, these people were entrusted with so much money to run a fundamentally non-innovative business. <em>WeCrashed </em>doesn’t exactly go so far as to deride the coworking industry, but rather the show wants you to think about how these kinds of companies come into being and what kinds of people are allowed to be their stewards.</p><p id=\"zJ1HW0\"><em>WeCrashed </em>also stars America Ferrera, Steven Boyer, O-T Fagbenle, Shanti Ashanti, Eui-sung Kim, and Cricket Brown. The show’s first three episodes are now streaming on Apple TV Plus.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RRzTKNt37EMdM2FXxbEs7hB-Cy0=/0x648:6000x3789/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23326525/ATV_WeCrashed_Photo_010303.jpg",
  "description": "Apple’s WeWork drama is yet another podcast reborn as a TV show",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}