{
  "title": "Welcome to Waabi World, the ‘ultimate simulator’ for autonomous vehicles",
  "url": "https://www.theverge.com/2022/2/9/22923904/waabi-world-virtual-simulation-autonomous-vehicle-urtasun",
  "date": "2022-02-09T11:00:00.000Z",
  "author": "Andrew J. Hawkins",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qD9NqBR8KebqhGBg0ahWnP8kXkU=/196x0:1804x1072/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70487324/Screen_Shot_2022_02_08_at_6.24.38_PM.0.png\" />    </figure>  <p id=\"kF1xc1\">Raquel Urtasun, the former chief scientist at Uber’s Advanced Technologies Group, promised an “AI-centric approach” to autonomous vehicles when <a href=\"https://www.theverge.com/2021/6/8/22522824/waabi-raquel-urtasun-autonomous-vehicle-startup-stealth-funding\">she founded her own company last year, Waabi</a>. Now, she’s ready to deliver on that promise with the announcement of the company’s first product: a virtual world in which to test its autonomous vehicles called “Waabi World.”</p><p id=\"g6pXVE\">Urtasun says she doesn’t want to rely on a large fleet of vehicles driving millions of miles on public roads and gathering data in service of training AI systems to drive better and safer than humans. That’s expensive, time-consuming, and ultimately doesn’t capture the seemingly endless number of edge cases that could confuse a self-driving vehicle. Urtasun claims that simulation is cheaper and more efficient than real-world testing. </p><p id=\"KV2XRT\">“If you look at the status of the industry, one of the things that we’ve seen is that simulation is finally starting to take a more important role,” Urtasun said in an interview. “But there is still big gaps from current simulators to this ultimate simulator that will really enable self-driving to not rely on driving millions and millions of miles on the real world to really understand whether vehicles are actually doing the right thing.”</p><div class=\"c-float-right\"><aside id=\"10JrSc\"><q>“simulation is finally starting to take a more important role”</q></aside></div><p id=\"QdfJGs\">Simulation is a critical piece of the puzzle for autonomous vehicles. These programs allow Waabi’s engineers to test — at scale — common driving scenarios and safety-critical edge cases, the learnings from which it then feeds into its real-world fleet.</p><p id=\"h78XUx\">Waabi World relies on four basic principles: “digital twins,” or the use of sensor data to recreate the real world in simulation; “near real-time fidelity sensor simulation” for the testing of the entire software stack; “stress test” scenarios; and teach AVs to learn from its mistakes. </p><div id=\"L3RcZS\"><div ><iframe src=\"https://www.youtube.com/embed/M7xIn2iNytE?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"qaNOde\">A common practice in the industry is to use visual artists to create CAD models and then use “simplistic procedural modeling” to clone those models for simulation, Urtasun said. “That’s not realistic,” she added. “That doesn’t have the diversity of the real world.”</p><p id=\"HnBt2W\">Most companies working on autonomous vehicles don’t attempt to simulate sensor data, including cameras, radar, and lidar. And if they do, it typically requires “expensive computation,” which precludes them from being tested in a closed-loop simulator, Urtasun said. </p><p id=\"IYs67k\">“Typically, the industry is going for physics-based simulators,” she said. “And the problem of that is that you need to know too much about the world that is very hard to know <em>a priori, </em>like material properties and things like this. And you also need very expensive computational simulations that do not scale.”</p><div class=\"c-float-right\"><aside id=\"RwJkKD\"><q>Waabi has also built into its simulator “AI adversaries” for its virtual autonomous vehicle</q></aside></div><p id=\"xyexk3\">Waabi has also built into its simulator “AI adversaries” for its virtual autonomous vehicle. That involves creating scenarios that the company’s engineers are sure that its “Waabi driver” won’t be able to figure out. “It’s like really understanding where you can make mistakes and then creating all these scenarios,” Urtasun said. She compared it to a driving instruction trying to teach a student driver how to parallel park, working with them to keep trying until they get it right. </p><p id=\"CGiCnI\">Urtasun described Waabi World as “an internal product for us” that won’t be available to any of the company’s future customers. When it first launched last year, Urtasun said that Waabi’s approach will be to focus on trucking, using its proprietary software to automate driving on commercial delivery routes. This new simulator will help the company commercialize its technology faster and cheaper than most of the AV startups working today.</p><p id=\"SoJXtN\">The company is entering a crowded field, with well-established competitors like Waymo, Aurora, and TuSimple, as well as major automakers like Daimler and Volvo. Most of these companies are also using simulators. Waymo, for example, just unveiled its own virtual world <a href=\"https://www.theverge.com/2021/7/6/22565448/waymo-simulation-city-autonomous-vehicle-testing-virtual\">called “Simulation City,”</a> in which the company’s engineers can simulate something as small as raindrops or as complex as late-afternoon solar glare. </p><p id=\"SxrGRR\">Urtasun said that while it’s important to create an accurate copy of the real world, she doesn’t believe you need to get bogged down in such minute details. Waabi’s approach is to combine AI with simple physics to simulate how an AV’s sensors will react in a rainstorm or during sundown, “not by building this mega-expensive physical simulator of every single drop and whatnot,” she said. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2UEZCJcG54IackfitRcGaPLJ4as=/0x13:2000x1060/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23227745/Screen_Shot_2022_02_08_at_6.24.38_PM.png",
  "description": "The company’s first simulator",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}