{
  "title": "What Twitter employees are saying about Elon Musk",
  "url": "https://www.theverge.com/23042020/twitter-employees-elon-musk-buyout-slack",
  "date": "2022-04-26T00:41:05.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5OYOvacmQf9TdNS290VXdVUShU8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70792967/VRG_Illo_STK022_K_Radtke_Musk_Twitter_Upside_Down.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p class=\"p--has-dropcap p-large-text\" id=\"EMSJpM\">In the moments before Elon Musk bought Twitter, the company’s Slack channels were lit up with nervous anticipation. It had been days since Twitter leadership had shared anything with them, and after a weekend’s worth of reports that a sale was imminent, employees were looking for answers.</p><p id=\"wt3Hlk\">For the first few hours of the morning, none came. Work all but came to a halt, employees told me. Like a classroom where the teacher is late and students are attempting to self-govern, one said. A “hellhole,” said another. One thread, in which an employee asked good-naturedly whether anyone was <em>excited</em> about the prospect of working for Musk, drew dozens of responses, many of them quite ugly.</p><p id=\"mcDzuC\">Then, just before the markets closed, the news arrived: <a href=\"https://www.prnewswire.com/news-releases/elon-musk-to-acquire-twitter-301532245.html\">the board had accepted Musk’s offer to take the company private for $44 billion</a>, or $54.20 a share. What <a href=\"https://www.platformer.news/p/elon-musks-twitter-play?s=w\">began three weeks ago as a “passive investment”</a> will end with Musk in charge.</p><p id=\"Y6HWm2\">After the announcement, sentiment in the public Slack channels remained largely concerned and negative, employees told me. “I was kind of surprised how much people seemed like they were giving up,” one told me. “Big bummer.”</p><div class=\"c-float-right\"><aside id=\"aGP4Ko\"><q>the public Slack channels remained largely concerned and negative</q></aside></div><p id=\"2aFEBb\">But in one-on-one discussions, responses were more tempered. Some employees I’ve spoken with are open to the idea that a private Twitter run by Musk stands a better chance of improving the service than would a public company beholden to its shareholders. They like the fact that he wants to eliminate harmful bots and bring more clarity to how recommendation algorithms work.</p><p id=\"thE5Cv\">At the same time, many Twitter employees receive half or more of their compensation in stock. At an all-hands meeting on Monday afternoon, they were told that employees will not receive equity once the company goes private. As a result, one person told me, “group chats are scrambling to see if working at Twitter makes economic sense first and foremost.”</p><div id=\"T5hfTZ\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Can someone just tell me if I’m rich or fired please</p>— Ned Miles (@nedmiles) <a href=\"https://twitter.com/nedmiles/status/1518666741399928833?ref_src=twsrc%5Etfw\">April 25, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"9SnCNS\">The deal is expected to take around six months to close. At that time, it seems likely that CEO Parag Agrawal will leave the company, although he did not say so when addressing employees today. Agrawal did say there would not be layoffs in the near term, though he would not comment on whether there would be a hiring freeze. (There is, however, <a href=\"https://www.bloomberg.com/news/articles/2022-04-25/twitter-locks-down-product-changes-after-agreeing-to-musk-bid?sref=CrGXSfHu\">a partial freeze on new features</a>, although I’m told that’s fairly standard during moments when there is a lot of attention on Twitter and the company doesn’t want to introduce any new bugs.)</p><p id=\"El0FTi\">In the meantime… <a href=\"https://twitter.com/dalia__khattab/status/1518670015138078725\">hiring will be harder</a>. There seems to be at least some likelihood that the company will see significant attrition, particularly in the leadership ranks — and on the “health” teams that work to fight harassment and abuse. On the plus side, the company’s earnings report Thursday no longer has the potential to further tank its stock.</p><p id=\"jr4jVN\">Beyond that, as with everything related to the Twitter-Musk story over the past month, it’s extremely difficult to predict.</p><hr class=\"p-entry-hr\" id=\"79KGqg\"><p class=\"p--has-dropcap\" id=\"q8IQQi\">How did we get here?</p><p id=\"trrWZ3\">On one hand, Musk’s acquisition really is an extraordinary story. Acquiring 9 percent of the company as a “passive” investor, failing to report it on time, <a href=\"https://www.platformer.news/p/elon-musk-joins-the-twitter-board\">getting invited to join the board</a>,<a href=\"https://www.platformer.news/p/elon-musk-leaves-the-twitter-board\"> turning it down</a>, then offering to buy the company outright — that’s an extremely strange turn of events.</p><p id=\"4EJst2\">On the other, as <a href=\"https://www.bloomberg.com/opinion/articles/2022-04-25/elon-closes-in?sref=CrGXSfHu\">Matt Levine noted today</a>, once Musk made his offer, the whole thing proceeded fairly normally. As a negotiating tactic, the board put in place a “poison pill” to prevent Musk from acquiring any more of the company. That forced Musk to prove that he actually had the financing to get the deal done. He did so, and the board considered its options. Ultimately, the 38 percent premium that Musk offered over its current stock price struck members as the best deal they could likely get.</p><p id=\"4qDo0P\">In the end, it was just business.</p><p id=\"yvUYno\">Twitter has long been an underperformer, and former executives I spoke with today were relieved that the company now has a real chance to make radical change. As a private company, beholden only to the interests of one man, Twitter may be able to transform itself in ways that it never could while it had to report quarterly earnings.</p><div><aside id=\"YkX3Ty\"><q>In the end, it was just business.</q></aside></div><p id=\"XvVrRm\">The $44 billion question, though, is… transform it into what?</p><p id=\"ewFmsk\">“What is Twitter for? Everybody who’s ever been in control of Twitter has had a different answer to that question,” one former executive told me today. “It’s a question that has vexed users since the creation of the service.”</p><p id=\"ycWCc8\">There was the era after Jack Dorsey returned as CEO and tried to focus the product’s attention on “what’s happening.” There was the effort led by former chief operating officer Anthony Noto to make Twitter a destination for live video. More recently, Dorsey oversaw efforts to both make the company a platform for “healthy conversation” and to turn it into a decentralized protocol.</p><p id=\"1FsNQI\">What does Musk think Twitter is for? All we have to go on is a series of cryptic tweets and statements that are short enough to allow for wide interpretation. In this moment, he is still a mostly blank canvas on which people can project their hopes (like the Republican members of Congress tweeting “<a href=\"https://twitter.com/Jim_Jordan/status/1518674710028034051\">free speech is making a comeback</a>”) and their fears (like those Twitter employees in Slack).</p><p id=\"5BDhOI\">On stage at TED, he said <a href=\"https://techcrunch.com/2022/04/14/elon-musk-buying-twitter-ted-talk/\">he didn’t care about “the economics” of Twitter “at all.”</a> But given the way he structured his Twitter deal, he will face pressure (if not insurmountable pressure) to see a return on his investment. Here are Krystal Hu and Anirban Sen at Reuters:</p><blockquote><p id=\"jvEDe0\">More than two-thirds of the $46.5 billion financing package that Musk unveiled on Thursday in support of his bid for Twitter would come from his assets, with the remainder coming from bank loans secured against the social media platform’s assets.</p><p id=\"nQfZRU\">That is the reverse of how most investors structure buyouts, with debt secured against the assets of the target company typically comprising the majority of the financing. […]</p><p id=\"1S5UnF\">What is more, Musk has agreed to take out a risky $12.5 billion margin loan, secured against his stock of Tesla Inc, the electric-car maker that he leads, to pay for some of the $33.5 billion equity check. Were Tesla’s stock to drop by 40%, he would have to repay that loan, a regulatory filing shows.</p></blockquote><p id=\"YfAlbO\">So, to avoid having to sell a bunch of his Tesla stock and pay off his loan, maybe Musk <em>does</em> find that he has to care about the economics of Twitter.</p><p id=\"ki8lXL\">In which case, what does he do?</p><hr class=\"p-entry-hr\" id=\"KHu0jw\"><p class=\"p--has-dropcap\" id=\"VTJnY8\">It’s fashionable lately to suggest Musk ought to get Twitter out of the ads business. (Ads are out of fashion in general.) But as a feed-based social network, ads arguably still make a great deal of sense for Twitter, former employees told me today. When former CEO Dick Costolo embraced ads as Twitter’s future, one said, it was because “it was the best way to make the most money. it wasn’t because of an inherent love of advertising.”</p><p id=\"YjkV9s\">The company could place a new emphasis on subscriptions, either by expanding its $2.99 Twitter Blue product or by scrapping it and building a new subscription product from scratch. (“Make power users pay for access to their large audiences” iis one idea that keeps coming up which seems plausible to me.)</p><p id=\"nEMg52\">Or Twitter could<a href=\"https://stratechery.com/2022/back-to-the-future-of-twitter/\"> lean harder into becoming a decentralized protocol</a>, selling API access to enable developers to build a variety of different front-end experiences. That could enable different users to choose different styles of content moderation, while effectively turning the core service into an enterprise software product.</p><p id=\"6jMpV6\">I think any of these outcomes is plausible. But if Musk has a hand, he’s not tipping it. His official statement today bears little evidence that he has thought much about what he will do with Twitter as a business much beyond the close of the deal:</p><blockquote><p id=\"U1PVZo\">“Free speech is the bedrock of a functioning democracy, and Twitter is the digital town square where matters vital to the future of humanity are debated,” said Mr. Musk. “I also want to make Twitter better than ever by enhancing the product with new features, making the algorithms open source to increase trust, defeating the spam bots, and authenticating all humans. Twitter has tremendous potential – I look forward to working with the company and the community of users to unlock it.”</p></blockquote><p id=\"OpTwvY\">Perhaps he will develop a stronger point of view, and share it, in the coming months.</p><div class=\"c-float-right\"><aside id=\"ysTkmM\"><q>Who will Musk trust with his vision for the company?</q></aside></div><p id=\"x0o9dP\">In the meantime, the other big question looming over all this is who will run Twitter day to day. Musk already leads Tesla and SpaceX and the Boring Company and Neuralink; presumably he will not be spending eight hours a day on Twitter. Agrawal said today he intends to stay with the company through the close of the deal; <a href=\"https://www.hollywoodreporter.com/business/digital/jack-dorsey-parag-agrawal-pay-twitter-execs-could-see-massive-paydays-if-elon-musk-takeover-closes-1235134985/\">he would seem to be in line for a $39 million payout</a> if and when Musk replaces him. Who will Musk trust with his vision for the company? It’s one of the year’s most interesting tech stories.</p><p id=\"APgHqL\">OK, there’s one <em>other</em> big looming question over all this, which is will Musk let Donald Trump back on the platform? Trump said today <a href=\"https://www.foxnews.com/politics/trump-will-not-return-to-twitter-even-if-elon-musk-purchases-platform-will-begin-using-his-truth-social\">he absolutely will not return to Twitter even if he was invited</a>. The former president said he will instead use his own platform, Truth Social, which he has completely ignored after posting there once. But some people pointed out that Trump has lied in the past, and <a href=\"https://www.washingtonpost.com/technology/2022/04/25/trump-twitter-elon-musk-reinstatement/\">might even in fact be lying about this</a>. Time will tell!</p><p id=\"wdP6MJ\">Over on my Twitter timeline today, people were going wild with the most definitive, histrionic takes on what Musk’s acquisition will mean for the user experience. Twitter is about to be overtaken by trolls and harassers; Twitter is about to re-learn 10 years’ worth of lessons about content moderation the hard way; Twitter is about to see an employee exodus like none we have ever seen. And so on.</p><p class=\"c-end-para\" id=\"71sxUY\">Maybe all of that is true, or maybe none of it is. At least some of the worries would seem to be justified, based on Musk’s past statements. But the cart feels way ahead of the horse here, and in any case predicting Elon Musk’s behavior is a mug’s game. For all its cultural importance, Twitter had a notably undistinguished life as a public company. For better and for worse, it’s now up to Musk to see whether it can fare any better as a private one.  </p><div id=\"QaMM1b\"><iframe src=\"https://www.platformer.news/embed\" width=\"480\" height=\"320\"  frameborder=\"0\" scrolling=\"no\"></iframe></div><p id=\"OnAYpJ\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/HXkOVDBmMUp8DCkM1tk0V6jwhL4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23382327/VRG_Illo_STK022_K_Radtke_Musk_Twitter_Upside_Down.jpg",
  "description": "Twitter staffers aren’t necessarily taking it well",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}