{
  "title": "What Doctor Strange 2’s multitude of cameos could mean for the MCU’s future",
  "url": "https://www.theverge.com/2022/5/11/23063634/doctor-strange-2-post-credits-cameos-illuminati",
  "date": "2022-05-11T14:15:00.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/fC9FkAfcBXCzVjcxjOMaQ7y21Gw=/14x0:6653x4426/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70856372/SRV_14765_R.0.jpeg\" />        <figcaption><em>Michael Stuhlbarg as Nicodemus West and Benedict Cumberbatch as Stephen Strange.</em> | Marvel Studios</figcaption>    </figure>  <p>First comes the multiverse, then come the incursions</p> <p class=\"p--has-dropcap\" id=\"b5JnwT\">While <a href=\"https://www.theverge.com/23054770/doctor-strange-2-review\"><em>Doctor Strange in the Multiverse of Madness</em></a> is mostly about <a href=\"https://www.theverge.com/2022/2/15/22933001/doctor-strange-the-scarlet-witch-marvel\">Stephen Strange and his good friend the Scarlet Witch</a>, the movie also <a href=\"https://gizmodo.com/what-superhero-movies-need-to-remember-while-embracing-1845991628?utm_content=&amp;utm_campaign=io9&amp;utm_medium=SocialMarketing&amp;utm_source=twitter\">uses its conceit</a> to introduce a number of novel and “new” characters to the MCU. Even though most of <em>Multiverse of Madness</em>’ cameos skew more toward the fan service end of the spectrum here, their on-screen arrivals may portend significant, comics-inspired developments for the MCU’s future.</p><p id=\"68CaOQ\"><em><strong>This article contains spoilers for </strong></em><strong>Doctor Strange in the Multiverse of Madness.</strong></p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sLvzqX4ubSemOEy4vd9_SM8Zli8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23448946/Screen_Shot_2022_05_09_at_9.32.49_AM.png\">      <cite>Image: Marvel</cite>      <figcaption><em>Stephen Strange holding himself together as he crosses the multiverse.</em></figcaption>  </figure><p id=\"FKtsTR\">Much like <em>Captain America: Civil War </em>before it, <em>Doctor Strange in the Multiverse of Madness </em>brings together so many characters from different Marvel movies and TV shows that it often feels like an <em>Avengers-</em>style crossover event. But newcomer America Chavez, a teenager with the ability to punch star-shaped holes in reality, ups the stakes in a big way by giving the <em>Doctor Strange </em>sequel<em> </em>a convenient means of exploring the broader multiverse outside of the 616 reality where most of the MCU’s stories have been set.</p><p id=\"rQx4DG\">Though the actual movie itself is packed with big-name cameos who are likely going to become even bigger names in the MCU’s near future, <em>Multiverse of Madness</em>’ most intriguing new arrival doesn’t show up until the movie’s mid-credits scene.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bTTvKz66TW5cH2oqpvU4S9S0k0E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450830/Clea.jpeg\">      <cite>Marcelo Ferreira, Don Ho, Roberto Poggi, Java Tartaglia, Felipe Sobreiro / Marvel</cite>      <figcaption><em>Clea demonstrating why she’s the Sorcerer Supreme.</em></figcaption>  </figure><h3 id=\"KRljg0\">Clea</h3><p id=\"jMMpfA\">As Strange walks down a New York City sidewalk, he’s suddenly accosted by Charlize Theron as a sorceress armed with a blade made of purple energy. Before Stephen has a chance to ask the woman her name or deduce whether she’s friend or foe, she uses her blade to slice a rift in space and informs him that he’s caused yet another incursion — the cataclysmic collision of two parallel universes.</p><p id=\"FSIHO1\">While the mysterious woman doesn’t introduce herself, both her purple color palette and her inviting Strange to accompany her to the Dark Dimension point to her being the MCU’s version of Clea, the current Sorcerer Supreme in Marvel’s comics who’s also Strange’s wife and Dormammu’s niece.</p><p id=\"54cjTN\">One of the most perplexing things about <em>Multiverse of Madness </em>is how, as the credits start rolling, you still get the sense that Stephen Strange might not necessarily have learned all that much from the experience outside of how to perform some feats of demonic magic. Incursions are referenced once or twice during the core movie by some of its other new characters of note. But it isn’t until Clea mentions them in her stinger that they feel less like casual references to comic book plots <em>Multiverse of Madness </em>is pulling from and more like suggestions about the next chapter of Strange’s cinematic adventures.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/DROblIRN4nBkao5-xknDpvoMJuk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450834/1499704562_inhumans_black_bolt_marvel_anson_mount_imax_abc.jpeg\">      <cite>Image: ABC</cite>      <figcaption><em>Anson Mount as Black Bolt.</em></figcaption>  </figure><h3 id=\"lAzDll\">Black Bolt</h3><p id=\"Vpupdt\">When Strange and America find themselves on Earth-838 — one of the infinite alternate Earths that exist across the multiverse — their search for that reality’s Stephen Strange leads them to Sorcerer Supreme Karl Mordo (Chiwetel Ejiofor), who isn’t exactly surprised to see them. Having known his own Stephen Strange to be a reckless person willing to take risks that would endanger the multiverse, Mordo lures the 616 heroes into a trap that ultimately leads to Strange being brought before Earth-838’s Illuminati, a secret cabal of superhuman power players. Along with Mordo, Earth-838’s Illuminati consists of Charles Xavier (Patrick Stewart), Captain Marvel (Lashana Lynch), Captain Peggy Carter (Hayley Atwell), Reed Richards (John Krasinski), and Black Bolt (Anson Mount).</p><p id=\"ryHuPH\">Of all the people who could have possibly shown up in a story about the Scarlet Witch tearing creation apart, Blackagar Boltagon is surprising for a variety of reasons — chief among them being the haphazard way Marvel <a href=\"https://deadline.com/2018/05/marvels-inhumans-canceled-abc-one-season-1202379716/\">ended its <em>Inhumans </em>series after a single season</a>. Back when Disney did not yet own the cinematic rights to Marvel’s mutants, the Inhumans were being propped up as the next best thing both in the MCU and in the comics, where the survival of Black Bolt and other Inhumans like Kamala Khan became <a href=\"https://www.polygon.com/2017/9/28/16290710/inhumans-marvel-explainer\">contingent on mutant extinction</a>. </p><p id=\"E43j2t\">Unlike Mordo or either of the Captains, Black Bolt’s comics counterpart has been a member of the Illuminati since its very first 2005 appearance in <em>New Avengers </em>#7. Though the Inhumans have had a substantial presence in Marvel’s comics over the years, they’ve all but gone extinct in more recent arcs like Donny Cates and Ariel Olivetti’s <em>Death of the Inhumans</em>. A Black Bolt cameo just a couple of years back might have played like a tease that Marvel would be bringing the characters back ahead of its <em>Ms. Marvel </em>series. Here, though, the Inhuman king serves little purpose other than to give <em>Multiverse of Madness </em>one of its most satisfying and truly gruesome deaths when Wanda seals his mouth shut and causes his sonic powers to backfire, leading to his head exploding.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2SQ3UAeqR06TM7GMXrgL_K5DA30=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450916/101_AKA0150_comp_v003.1002.jpg\">      <cite>Image: Disney Plus</cite>      <figcaption><em>Captain Peggy Carter on her motor bike.</em></figcaption>  </figure><h3 id=\"gTJBNh\">Captain Peggy Carter</h3><p id=\"zqRORN\">After making her <a href=\"https://gizmodo.com/what-ifs-premiere-turned-peggy-carter-into-the-first-na-1847453488\">MCU debut in <em>What If...?</em></a>, Captain Peggy Carter gets the live-action treatment here as an Illuminati member whose fate is clearly sealed the moment she steps onto the screen. There isn’t a super soldier serum strong enough to give any regular person the power they’d need to fight chaos magic, but Peggy tries because that’s what the Captain does, and she puts up a good fight that ends with Wanda bisecting her with her own vibranium shield. Gruesome as Peggy’s death is, it doesn’t feel quite like it’s the definitive last we’ve seen of Atwell as the Captain, but it feels far more likely that the next time she’ll pop up will be in <em>What If...?</em>’s next season.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/irsjRmwdIxu9Z3--8s22J-cdYnU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451603/RCO004.jpeg\">      <cite>Steve Epting, Rick Magyar, Frank D’armata / Marvel</cite>      <figcaption><em>Reed Richards explaining the way of the universe.</em></figcaption>  </figure><h3 id=\"BqADJp\">Reed Richards</h3><p id=\"i4V4Vi\">Like Black Bolt, Reed Richards has been part of the comics’ Illuminati from the very beginning, and with <a href=\"https://www.theverge.com/2014/10/16/6985725/marvel-iron-man-is-forever-rdj-isnt\">Robert Downey Jr.’s Iron Man</a> dying in <em>Avengers: Endgame</em>, there’s been a super science-shaped hole in the MCU that <a href=\"https://www.theverge.com/2022/4/29/23049370/marvel-fantastic-four-jon-watts\">the Fantastic Four could logically fit into</a>. </p><p id=\"iltqoE\">Earth-838’s Reed proves to be quite useless against Wanda when she shows up and turns him into silly string. But Reed’s involvement in the Illuminati’s decision to kill their universe’s Strange for using dark magic that caused an incursion is part of what makes <em>Multiverse of Madness </em>feel like the precursor to a <em>Secret Wars </em>adaptation. If Marvel Studios was planning to tackle the story of how the multiverse collapsed in on itself, it would make sense to bring the Fantastic Four into the fold. But given how much time Marvel’s movies have spent hyping up the multiverse’s destruction just for its heroes to seemingly patch it up before too long, the Fantastic Four’s introduction might have to be rooted in a different story in order for them to stand out when they arrive.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/bVdkiSVZFKkqcZzYpFTXBBNe0pM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450983/RCO017_1583518457.jpeg\">      <cite>Aud Koch, Rachelle Rosenberg / Marvel</cite>      <figcaption><em>Amalia and Elena Chavez preparing for their daughter, America, to be born.</em></figcaption>  </figure><h3 id=\"sRtsUD\">Amalia and Elena Chavez</h3><p id=\"9skJFR\">As has been the case with the vast majority of Marvel’s on-screen queer representation, one really has to be paying close attention to pick up on how <em>Doctor Strange in the Multiverse of Madness </em>addresses the existence of people who aren’t straight. The America Chavez of Marvel’s comics is a queer woman who spent years believing that she was born to two loving mothers, Amalia and Elena, in a pocket dimension outside of the multiverse known as the Utopian Parallel. It wasn’t until Kalinda Vazquez and Carlos Gómez’s <em>America Chavez: Made in the USA </em>series from 2021 that America “discovered” (which is typically how narrative retcons are framed in comics) that she and her long-lost sister Catalina were actually from Earth and that her memories of the Utopian Parallel were actually a response to childhood trauma.</p><p id=\"sgo7pS\"><em>Multiverse of Madness </em>makes a number of changes to America, like making her much less certain of her abilities, aging her down by a few years, and downplaying the fact that she might be queer outside of the small pride flags and pins she wears on her jacket. Curiously, <em>Multiverse of Madness</em>’ America does mention her mothers, and the movie shows you a brief glimpse of them together with a young America in a place that looks very much like the Utopian Parallel of the comics. </p><p id=\"YwX0DO\">Before you get any real sense of what sort of people America’s mothers were, they’re sucked into a random universe when a bee scares America and she accidentally opens a portal that she can’t control. The whole scene plays like a very convoluted way of glossing over the canonical queerness that’s a big part of America’s identity and her family, but it’s also something the studio could easily address the next time she pops up in the MCU.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/OaPpsZ0N6zAuRkwQMCTtwQXKfyw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23450986/Xavier.jpeg\">      <cite>Image: 20th Century Studios</cite>      <figcaption><em>Patrick Stewart as Charles Xavier in </em>X-Men: Days of Future Past.</figcaption>  </figure><h3 id=\"lQfZqs\">Professor Charles Xavier</h3><p id=\"hW15on\">It was very clear from <em>Doctor Strange in the Multiverse of Madness</em>’ trailers that Patrick Stewart’s Charles Xavier was going to be involved in some capacity — an idea that immediately raised the surprising prospect of the X-Men finally coming to the MCU. Though the in-universe history up to this point hadn’t gelled with the prospect of Xavier and his fellow mutants living in secret this whole time, <em>Multiverse of Madness </em>opened up the possibility of them simply existing on a parallel Earth and being poised to cross over.</p><p id=\"jhmKS4\">Earth-838’s Charles Xavier doesn’t mention the X-Men or really explain how he’s able to telepathically probe Wanda’s mind when the two of them come face to face. But both his suit and Day-Glo yellow hover chair resemble those the Xavier of Marvel’s <em>X-Men </em>animated series from the ‘90s was known for. In a very <em>X-Men: The Last Stand </em>turn of events, Xavier tries to reason with the Earth-838’s Wanda, who’s become psychically trapped in her own head by her 616 counterpart.</p><p id=\"5WMfo9\">Because so much of Wanda’s recent journey through the MCU has borrowed thematic elements from the <em>House of M </em>event in which the Scarlet Witch rewrote reality amid a mental breakdown, her meeting the founder of the X-Men seems momentous at first. It seems to genuinely surprise Wanda to fight someone else who’s able to poke around in people’s minds without the use of magic. Because the stakes are so high in <em>Multiverse of Madness</em>, it almost seems for a moment like Xavier might fight back by showing the Wanda what he knows about other versions of her <em>or </em>of her brother, who’s popped up in 20th Century Studios’ <em>X-Men </em>movies over the years.</p><p id=\"efksVH\">Instead, Xavier barely has time to orient himself in Wanda’s mind before she sneaks up behind him and snaps his neck, immediately killing his physical self and making it very unclear whether Marvel is actually interested in bringing the X-Men in anytime soon.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/GDoP_pKvOGfheDDWMA4C_0bZL4c=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451483/doctor_strange_2_multiverse_of_madness_maria_rambeau_captain_marvel_variant.jpeg\">      <cite>Image: Marvel Studios</cite>      <figcaption><em>Captain Maria Rambeau charing up.</em></figcaption>  </figure><h3 id=\"opl5J3\">Captain Marvel (Maria Rambeau)</h3><p id=\"qRBPUl\">What’s funny about <em>Doctor Strange in the Multiverse of Madness</em>’ Illuminati is how their big debut effectively robs them of all the intrigue and mystique that makes their comics selves such thorny and interesting characters. For the sake of this film, the Illuminati are all there to die and illustrate how devastatingly powerful the Scarlet Witch is once she lets loose. </p><p id=\"ssRdmB\">Because the movie is so focused on showcasing Wanda’s might, it makes sense that it would want to pair her up with an opponent who could reasonably take her on. This is part of why Lashana Lynch’s return as Maria Rambeau — here, a variant who presumably took the same energy blast that empowered Earth-616’s Carol Danvers — makes so much sense. In <em>Avengers: Endgame</em>, Wanda and Carol were the only two people who were able to hold their own against Thanos, and both women’s power sets have been implied to be near limitless.</p><p id=\"Qs0SG9\">When you recall <a href=\"https://gizmodo.com/monica-rambeau-was-wandavisions-real-hero-and-the-show-1846433688?utm_content=io9&amp;utm_source=twitter&amp;utm_medium=SocialMarketing&amp;utm_campaign=dlvrit\">the hell Wanda put Monica Rambeau</a> — Maria’s daughter — though in <em>WandaVision</em>, their clash takes on another layer of significance as a big, flashy action sequence in a movie about a witch murdering countless people to get to her children. It’s legitimately exciting to see the Scarlet Witch and Captain Marvel throwing down with the future of all things hanging in the balance, but <em>Multiverse of Madness, </em>for whatever reason, drops the ball in the way that it gives Wanda the upper hand.</p><p id=\"XJftsD\">Of all the possible ways that Wanda could kill Maria, pulling a statue down to crush her is one of the least inspired and contradictory to the story being told. Superhero movies are notorious for playing fast and loose with their senses of scale and power, but what makes <em>Multiverse of Madness</em>’ internal logic feel sort of egregious is how significant an event this is all supposed to be.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uhPXJbZdnEXX3zcYJkgdqtlaCKk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451649/RCO016.jpeg\">      <cite>Steve Epting, Rick Magyar, Frank D’armata / Marvel</cite>      <figcaption><em>Reed Richards explaining the incursions to the rest of the Illuminati.</em></figcaption>  </figure><p id=\"7Twcrc\">Earth-838’s Illuminati were all but powerless to stop the Scarlet Witch from eviscerating them, but their existence implies the potential for a similar group to come together in the MCU’s core reality. Between <em>Multiverse of Madness</em>’ nods to incursions and Marvel’s forthcoming features like <em>Fantastic Four </em>and <em>Black Panther: Wakanda Forever</em>, the studio certainly seems to be putting the pieces in place for another large-scale event in the not so distant future. But if that’s the case and <em>Doctor Strange in the Multiverse of Madness</em>’ cameos are a sign of the kinds of stories Marvel’s tackling next, the MCU’s overarching story is on the verge of becoming even wilder and tricker to follow.</p><p id=\"sDMAPi\"><em>Doctor Strange in the Multiverse of Madness </em>is in theaters now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/n8KxSvaw6fuiBR3wHKy1wRHaYrI=/0x0:7137x3737/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23448374/SRV_14765_R.jpeg",
  "description": "Doctor Strange 2’s multiverse of cameos may be setting up a very secretive war",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}