{
  "title": "WhatsApp’s new Communities tab creates a way for group admins to message thousands",
  "url": "https://www.theverge.com/2022/4/14/23024703/whatsapp-communities-admin-group-messaging-feature",
  "date": "2022-04-14T15:00:00.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/_vKhAxEYF2ma2Y_sA3mfn3q1PiA=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70748607/acastro_210119_1777_whatsapp_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"qGWhtf\">Starting this week, the concept of group messaging on WhatsApp is significantly expanding. </p><p id=\"2oJhWH\">WhatsApp has primarily been about messaging with people you know since before Facebook bought it in 2014. The experience is intentionally intimate: you need someone’s phone number to add them, and group chats are capped at 256 participants.</p><p id=\"LEMnDK\">Now, a new tab, first rolling out to a small, select number of groups, will let thousands participate in a Community that hosts multiple sub-group chats. The idea is that various organizations, from a school to a business whose employees communicate on WhatsApp, can more easily organize discussions and have their admins message everyone across different groups.</p><p id=\"TlbCVH\">If you ask WhatsApp, Communities is a response to requests from people who have already been using it for messaging across large numbers of people. “We’ve been hearing increasingly from organizations that use WhatsApp for their private communications,” the head of WhatsApp, Will Cathcart, tells me. “We think it’s time to start building with intention for those use cases, because there’s a lot we can do to make it better.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7ws0DPZ42UYLiVhWcHsVIcjH5fY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23389020/WhatsApp_Communities.png\">      <cite>Image: WhatsApp</cite>  </figure><p id=\"7ZUpJh\">Since Communities potentially makes it easier for information to spread quickly through the encrypted app, WhatsApp is also making it so that messages forwarded more than once can only be sent to one group at a time, rather than the previous limit of five. The move is designed to proactively thwart the spread of potentially harmful posts, like spam and illegal sexual content.</p><p id=\"mtsEgo\">While Communities may at first blush draw the comparison to Telegram channels or even Discord, there are some key differences. For one, only admins can broadcast to an entire Community in WhatsApp, while members are limited to the sub-groups they are in. Someone needs your phone number to add you to a Community, and WhatsApp won’t allow for Communities to be discoverable through search or recommended by an algorithm.</p><p id=\"xdZERA\">Once you’re in a Community, your number will be hidden except from admins and the people you’re in a specific sub-group with. And, unlike Telegram, all communications between people in a Community are encrypted, though a Community’s name and description are not.</p><p id=\"MlFEXP\">While it’s announcing the feature now, WhatsApp is still figuring out the details of exactly how Communities will work based largely on feedback from early testers who are being invited to try it, says Cathcart. He wouldn’t be more specific than a Community allowing for “thousands” of members, and that there are “limits” on the number of admins a single Community can have with one-to-all messaging privileges.</p><div class=\"c-float-right\"><aside id=\"vxZ6gK\"><q>“We’re imagining that the use really will ... more naturally gravitate towards communities where people have some sort of existing relationships”</q></aside></div><p id=\"ZYP8De\">“We’re imagining that the use really will, because of those limitations, more naturally gravitate towards communities where people have some sort of existing relationships,” he says. “Being a place to talk with other people on the internet about cryptocurrency is not what we’re shooting for, and I’d be surprised if we get much use there.” WhatsApp isn’t making money off Communities, though he didn't rule it out in the future, saying “you can imagine potentially there are premium features you can charge for,” especially if businesses embrace the feature for their employees.</p><div><aside id=\"yTSCZ6\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"WhatsApp sets its sights on the US \",\"url\":\"https://www.theverge.com/2022/1/28/22904967/whatsapp-meta-us-marketing-push-apple-imessage\"}]}'></div></aside></div><p id=\"5Ub3Ra\">WhatsApp is adding a few other new features this week. Even if they’re not in a Community, group admins will be able to delete messages from a thread for everyone. Users will be able to share files up to two gigabytes in size, initiate voice calls with up to 32 people at once, and, for the first time, <a href=\"https://www.theverge.com/2022/3/22/22990675/whatsapp-beta-reactions-android-emoji\">react to a message with an emoji</a> like a thumbs up.</p><p id=\"uCSpYM\">Even though Communities is being made available slowly in the coming months, it’s clearly marking a new chapter for WhatsApp. “We’re planning to work in this space for a long time,” says Cathcart. “Part of why we want to talk about this as a vision and a direction is we think there will be a lot of updates coming.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/y1dBxtHPiilVCibNWHeWkW-FV1g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22245550/acastro_210119_1777_whatsapp_0002.jpg",
  "description": "\"Being a place to talk with other people on the internet about cryptocurrency is not what we’re shooting for.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}