{
  "title": "What matters about Matter, the new smart home standard",
  "url": "https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer",
  "date": "2022-03-18T15:40:46.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/s_eg4_5q_a6w0zgsI-D2pd5mYm8=/0x0:1600x1067/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70268938/f7484de0_fd1a_11eb_8eb4_4d8ac557fa35.0.jpg\" />        <figcaption><em>Products that are Matter-compatible will have the Matter logo on them.</em> | Image: CSA</figcaption>    </figure>  <p>How Amazon, Google, Apple, and Samsung will work with Matter, and which products you should buy.</p> <p class=\"p--has-dropcap p-large-text\" id=\"GabSAa\">Matter, the coming smart home standard that aims to be <a href=\"https://www.theverge.com/e/22551770\">the answer to many of today’s smart home headaches</a>, is supported by a long list of companies. From platform owners like Apple, Google, and Amazon to major manufacturers such as Samsung and LG and smaller, accessory-focused players like Nanoleaf, Eve, and Wyze, there’s an unprecedented industry coalition behind Matter.</p><p id=\"167Ytr\">A common language for smart home devices to communicate, Matter aims to simplify everything about the smart home, from purchase, to set up, to everyday use. Its biggest promise is that it will enable smart devices to work with each other, across platforms and ecosystems, no <em>matter</em> who made them.</p><div id=\"MnDeS8\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP4578799766&amp;light=true\" width=\"100%\"></iframe></div><p id=\"Lutl1l\">But Matter hasn’t yet arrived — <a href=\"https://www.theverge.com/2022/3/17/22982166/matter-smart-home-standard-postponed-fall-2022\">following another setback</a>, it’s now expected to launch in the fall of 2022. This makes it hard to determine how it will work in your home and what it will allow you to do that isn’t easy or even possible today. </p><p id=\"j7BZr0\">To answer some of these questions we’ve gathered information from published documents and talked to the companies that plan to support it and the <a href=\"https://csa-iot.org/\">Connectivity Standards Alliance</a> (CSA) that oversees Matter.</p><aside id=\"SLaHUi\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Matter’s plan to save the smart home\",\"url\":\"https://www.theverge.com/e/22551770\"}]}'></div></aside><p id=\"n7Wouf\">Consider this article a living FAQ on all things related to Matter; how this new smart home standard will work and which products it will work with. As new information comes out, we’ll keep this article updated. </p><p id=\"z7oFfO\">If you’ve got this far and are wondering what this Matter deal is all about, check out <a href=\"https://www.theverge.com/e/22551770\">Matter’s plan to save the smart home</a> for a deep dive into this new technology and what it promises.</p><h3 id=\"4DHtEV\">Table of contents:</h3><h3 id=\"liP7C1\"><a href=\"https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer#S7Ne2e\">Which platforms will work with Matter?</a></h3><h3 id=\"PX89AY\"><a href=\"https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer#sCWUu8\">Which products will work with Matter, and when can I buy them?</a></h3><h3 id=\"LBiJxV\"><a href=\"https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer#jpYOu6\">Which products won’t work with Matter?</a></h3><h3 id=\"legaFl\"><a href=\"https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer#MyBfao\">Is Matter going to keep my smart home private and secure? </a></h3><h3 id=\"WjZXV6\"><a href=\"https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer#mEr5qU\">Will I need to replace my existing smart devices to use Matter? </a></h3><h3 id=\"8zB5y8\"><a href=\"https://www.theverge.com/22832127/matter-smart-home-products-thread-wifi-explainer#PPefPz\">Should I wait for Matter to buy new smart home products?</a></h3><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/sQDCM2XNmiFedkryyuLbBkZf71k=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22858528/Apple_HomePod_mini_iPad_iPhone_applewatch_airpods_10132020.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>Apple has committed to supporting Matter products in its HomeKit smart home platform.</em></figcaption>  </figure></div><h1 id=\"S7Ne2e\">Which platforms will work with Matter?</h1><p id=\"qVMRLo\">The four big smart home platforms, Amazon Alexa, Google Home, Apple HomeKit, and Samsung SmartThings, have all committed to supporting Matter, which means you will be able to use their apps, smart speakers / displays, and smart voice assistants as Matter controllers to manage your connected devices. </p><p id=\"F25agy\">Bear in mind, though, these won’t be the only players that can run your smart home with Matter, and as more information emerges around how other ecosystems will support Matter we’ll add that here. </p><p id=\"49W3b3\">With Matter, you can use multiple platforms at the same time because of a feature called Multi-Admin control. As long as devices and platforms are Matter-enabled, you can connect them to as many platforms as you want. So, yes, you will be able to control the new Nest Thermostat with Apple’s Siri and Amazon’s Alexa voice assistants, even both at the same time if you like.</p><p id=\"lBefjC\">But you will still need to use a smart home platform; Matter is not an automation tool, it’s a connectivity standard. While Matter will have some basic controls built-in, it isn’t capable of creating automations, such as setting your thermostat to turn down, your lights to turn off, and the door to lock when you leave home — you’ll still need an app for that type of automation setup. However, with Matter, those automations will run across devices from different companies.</p><p id=\"XjwIlN\">Here is a rundown of what each of the smart home platforms has committed to in terms of Matter support in its products and services:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fQ8X6WsIHzTMUWX7Io8CihEnPjg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23326859/matter_echo.jpg\">      <cite>Image: Amazon</cite>      <figcaption><em>Amazon has committed to bringing its existing smart speakers and displays into Matter when it arrives.</em> </figcaption>  </figure><h2 id=\"ZZYvfP\">Amazon Alexa</h2><p id=\"cLXJ2K\">Amazon has committed to upgrading its <a href=\"https://www.theverge.com/2021/11/3/22761340/amazon-matter-smart-home-standard\">fourth-generation Echo smart speaker to Thread</a> and act as a border router. Thread is a primary protocol used by Matter and a border router is a bridge between a Thread network and a Wi-Fi network, the other protocol used by Matter. Amazon’s mesh Wi-Fi network company <a href=\"https://www.theverge.com/22741839/eero-ceo-confirms-matter-support-thread\">Eero has committed to supporting Matter</a>, too. Most of its existing routers already have Thread radios inside, so they can be upgraded to support Matter.</p><p id=\"W1kwXl\">The Echos with Zigbee on board — the Echo Studio, Echo Show 10, and Echo Plus — have the same radio as the Echo fourth-gen, so they are potentially upgradable to be Thread border routers, says Chris DeCenzo, principal software development engineer at Amazon Lab126. This is because Thread is built on a Zigbee radio.</p><p id=\"RCMMvB\">DeCenzo confirmed that the rest of the current Echo speaker line up will be upgraded to support Matter over Wi-Fi. “All of the Echo devices will be able to control all of the Matter devices that are on your home network, regardless of what networking technology they happen to use,” he says. The <a href=\"https://developer.amazon.com/en-US/alexa/matter\">company has also said it will work with developers</a> to help them develop products and skills for the Alexa smart home that will integrate easily with Matter.</p><div>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xGYWIVPY2ntLUniO0QjQaOR7mkc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19170903/dseifert_190905_3634_0005.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>Google’s Nest Hub Max has a Thread radio inside and will be upgraded to Matter and serve as a border router and Matter controller, according to Google.</em></figcaption>  </figure></div><h2 id=\"K1laCp\">Google Nest</h2><p id=\"OnQcE4\">Google has <a href=\"https://www.theverge.com/2021/5/19/22444571/google-interconnected-matter-smart-home-standard-android-nest-details-io-2021\">committed to updating all its Nest smart speakers and displays</a> to Matter, and said that newer products with Thread built in — such as the Nest Wi-Fi, Nest Hub Max, and second-gen Nest Hub — will also serve as border routers. </p><p id=\"Q6yynh\">Interestingly, the Nest x Yale Lock (a smart door lock) has a Thread radio inside, as do all the wired Nest Protect smoke alarms, the Nest Learning Thermostat (all three generations), and the original wired Nest cameras. However, Google told me that just because a device has Thread doesn’t necessarily mean it will be Matter compatible. “Our goal is to make as many of our products Matter compatible as possible,” says Kevin Po, senior product manager at Google. “But much of that will be dependent on the technology needed by the protocol.”</p><p id=\"F5M5PU\">Similarly, Google has said it will <a href=\"https://www.theverge.com/2021/10/21/22738584/google-smart-home-developer-summit-2021-matter-thread\">support developers who make products for its platform to integrate those with Matter</a> via a Google Home Device SDK for Matter. It also plans to update its mobile devices with Matter support to control Matter devices and allow for Matter’s streamlined device set-up process. </p><h2 id=\"3U62vs\">Apple HomeKit</h2><p id=\"mkEFtJ\">Apple’s HomePod Mini and <a href=\"https://www.theverge.com/22454960/apple-tv-4k-2021-review\">Apple TV 4K</a> (second-gen) both have Thread radios inside, can work as Thread border routers, and will get Matter support. Apple has <a href=\"https://developer.apple.com/videos/play/wwdc2021/10298/\">committed to supporting Matter</a> on the Home app and through Siri on Apple devices. The company has also said that all existing <a href=\"https://developer.apple.com/homekit/\">HomeKit APIs will automatically work with Matter-enabled accessories</a>. </p><p id=\"hz2vxT\">“We believe all smart home accessories should work together to provide the most choice and interoperability for customers without compromising security and privacy,” Apple spokesperson Jacqueline Roy told me. “This is why we helped create and contribute to the new Matter standard so that all smart home accessories will have the same level of security, privacy, and ease of use that Apple customers enjoy today with HomeKit accessories.” </p><h2 id=\"qv4eej\">Samsung SmartThings</h2><p id=\"mmIaYV\">Samsung has <a href=\"https://www.theverge.com/2021/10/26/22745664/samsung-smartthings-matter-support-products-galaxy\">said it will upgrade all existing SmartThings hubs to support Matter</a> and enable Matter as a controller for its smartphones, smart TVs, and smart appliances (such as its Family Hub refrigerators). It has yet to confirm if this will be over Thread or Wi-Fi. </p><p id=\"6Au6Ep\">“We’re very excited about the future and utilizing Matter as a central thought for us around what the future smart home looks like,” says Samantha Fein, Vice President of Business Development and Marketing at SmartThings.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/EBoJ04RehFWIUVpQxiYkTCp0UYw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22560470/Elements_7x_Dining_Winter_4000x2250px.jpg\">      <cite>Image: Nanoleaf</cite>      <figcaption><em>A number of Nanoleaf’s products have Thread radios, and the company has said they will be upgraded to Matter when the standard arrives. Its Elements LED wall panels (pictured) currently work as Thread border routers.</em></figcaption>  </figure></div><h1 id=\"sCWUu8\">Which products will work with Matter, and when can I buy them?</h1><p id=\"bO50Dm\">While you can buy <a href=\"https://www.threadgroup.org/What-is-Thread/Thread-Benefits\">Thread products today</a> from Eve, Nanoleaf, Eero, Wemo, and Nest — and there are plenty of Wi-Fi-enabled smart home devices out there — Matter products don’t exist yet. They won’t until the standard is finalized later this year. The earliest we will see Matter-capable products is the fall of 2022. For more details on the new timeline read <a href=\"https://www.theverge.com/2022/3/17/22982166/matter-smart-home-standard-postponed-fall-2022\">this article on the CSA’s plans for the launch of Matter</a>. </p><p id=\"QNLTMM\">Almost <a href=\"https://csa-iot.org/members/\">250 companies are members of the CSA’s Matter working group</a>, and many of those have already committed to supporting Matter in existing and forthcoming products. When they do, you will know if a product you’re considering buying is Matter compatible if it has the Matter logo (which looks a bit like a <a href=\"https://www.the-ambient.com/news/project-chi-new-name-matter-2622\">stick-person wearing bikini bottoms</a>)</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Bdvcvaxicb0Iiivwwg-Q6C8NRH8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23326860/nxp_advances_iot_connectivity_with_industrys_first_secure_tr.0.jpeg\">      <cite>Image: NXP</cite>      <figcaption><em>The Matter logo will indicate if a product will work in the Matter ecosystem.</em></figcaption>  </figure><p id=\"5qNEx6\">Matter 1.0, the first Matter specification, includes these connected device categories:</p><ul><li id=\"Dt3YCb\">Lightbulbs, light switches, lighting controllers</li><li id=\"GyBRxV\">Plugs and outlets</li><li id=\"HnkszA\">Door locks</li><li id=\"BOAvFY\">Thermostats and other HVAC controllers (mini-splits etc.)</li><li id=\"GyKaEy\">Blinds and shades</li><li id=\"0jyqlF\">Home security sensors (motion, contact, CO / smoke detectors)</li><li id=\"FaMOw0\">Garage door controllers</li><li id=\"nIU45S\">Wireless Access Point and bridges</li><li id=\"yBV09P\"><a href=\"https://www.theverge.com/2021/12/9/22824559/matter-tv-streaming-devices-smart-home-casting-protocol-support\">Televisions and streaming video players</a></li></ul><p id=\"8lVDrX\">Work has already begun on the next Matter specifications. Robot vacuums, home appliances, EV charging, and smart energy management are all likely to be part of Matter in the future, says Chris LaPré, chief technology officer of the CSA. </p><p id=\"2WOUBr\">Here is a list of companies with products available or in development that they have said will work with Matter when it's released:</p><ul><li id=\"gWOEtD\">Arlo: Smart home security camera company Arlo announced its support of Matter along with its new home <a href=\"https://www.theverge.com/2022/1/3/22865040/arlo-smart-home-security-system-price-availability-ces2022\">security system</a> (but it hasn’t announced the system will work with Matter).</li><li id=\"s5K0vy\">August / Yale: The smart lock manufacturers owned by Assa Abloy <a href=\"https://www.theverge.com/2022/1/8/22872311/matter-smart-home-ces-2022\">plan to bring Matter compatible locks to market</a>. For Yale door locks this will initially be through a Matter module that can be inserted into its existing Yale Assure locks</li><li id=\"NkJaQl\">Aqara: Makers of inexpensive Zigbee sensors, Aqara has said it will update its <a href=\"https://www.theverge.com/22523877/aqara-smart-home-review-m2-hub-homekit-alexa-google-assistant\">M2 and the M1S hubs</a> to Matter and is developing Thread versions of its motion and contact sensors.</li><li id=\"5e5EYx\">Belkin Wemo: Thread versions of the Wemo Smart Plug, Wemo Smart Light Switch, and Wemo Smart Dimmer are coming this year, and will work over Matter. The <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.belkin.com%2Fus%2Fsmart-home%2Fwemo%2Fwemo-stage-scene-controller-with-thread%2Fp%2Fp-wsc010%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22832127%2Fmatter-smart-home-products-thread-wifi-explainer\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Wemo Stage Scene Controller with Thread is available now</a>.</li><li id=\"ZQSPBj\">Comcast: The ISP says its upgraded xFi Advanced Gateway will have <a href=\"https://www.theverge.com/2022/1/3/22856018/comcast-xfi-advanced-gateway-wi-fi-6e-zigbee-matter-6ghz-home-internet\">support for Matter built-in.</a></li><li id=\"G2EFOo\">Cync / GE Lighting: The <a href=\"https://www.theverge.com/2022/1/4/22860472/cync-gelighting-smart-bulbs-thermostat-camera-ces2022\">A19 smart bulb and light strip</a> will be upgraded to Matter over Wi-Fi and Cync has said it will support Matter.</li><li id=\"firD10\">Eero: All Eero’s current mesh Wi-Fi routers — the Eero 6, Eero Beacon, Eero Pro 6, Eero Pro 5 — are Thread-enabled and <a href=\"https://www.theverge.com/22741839/eero-ceo-confirms-matter-support-thread\">will support Matter</a>.</li><li id=\"AlpEIU\">Eve Systems: The company is fully committed to Matter and has rolled out nine new Thread-enabled products so far, including the Eve Weather, Eve Water Guard, Eve Room, Eve Motion Blinds, Eve Energy smart plug, and the Eve Aqua. <a href=\"https://www.theverge.com/2021/12/10/22827727/eve-matter-thread-upgrade-smart-shades-release-date\">Matter is expected to allow Eve’s products to work with platforms outside of Apple’s HomeKit</a>, which they are currently limited to.</li><li id=\"IGTEga\">Nanoleaf: The lighting company is also all in on Matter and says it will be bringing new products to market that support the protocol. Its modular lighting panels —Shapes, <a href=\"https://www.theverge.com/2021/6/3/22466594/nanoleaf-elements-light-panel-smart-home-price-release\">Elements</a>, and <a href=\"https://www.theverge.com/22758017/nanoleaf-lines-review-smart-light-bars\">Lines</a> — are Thread border routers, and its <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fnanoleaf.me%2Fen-US%2Fproducts%2Fnanoleaf-essentials%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22832127%2Fmatter-smart-home-products-thread-wifi-explainer\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Essentials line of lighting</a> currently works over Thread.</li><li id=\"Yzrjyr\">Philips Hue: The complete Philips Hue smart lighting range will be compatible with Matter <a href=\"https://www.signify.com/en-us/our-company/news/press-releases/2021/20210512-complete-philips-hue-range-to-be-compatible-with-new-smart-home-connectivity-standard-matter\">through the Hue bridge</a>.</li><li id=\"vvk1dX\">Sengled: The smart lighting company's Wi-Fi A19 bulb will work with Matter and <a href=\"https://www.theverge.com/2022/1/3/22864783/sengled-smart-health-monitoring-smart-bulb-ces2022\">it's looking at adding Thread bulbs later in 2022. </a></li><li id=\"QBvqT7\">Schlage: <a href=\"https://www.theverge.com/2022/1/4/22860197/apple-home-key-schlage-encode-plus-smart-door-lock-thread-ces2022\">Schlage’s new Encode Plus door lock</a> is the company’s first Thread-enabled product and is slated for release this spring. The company has said that it has the hardware on board to support Matter.</li><li id=\"wEiy6h\">Tuya Smart: An IoT development platform service provider that supports over 446,000 developers with over 1,100 smart home products from robot vacuums to smart lights, says it will support Matter. </li></ul><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SBjvzl400OzMIQsaiMDthMbPZkE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22881764/20210621_us_lifestyle_insitu_alarmpro_keypad_credenza_rgb_16x9.jpg\">      <cite>Image: Ring</cite>      <figcaption><em>The new Ring Alarm Pro from the Amazon-owned company does not support Matter over Thread, says the company.</em></figcaption>  </figure></div><h1 id=\"jpYOu6\">Which products won’t work with Matter?</h1><p id=\"5PrpZq\">While the list of devices Matter will support initially is impressive, the big question is what about smart security cameras? Easily one of the most popular devices in the smart home, a smart home standard without security cameras feels incomplete. <strong>“</strong>Cameras are probably 2.0,” says LaPré. “We know we will do cameras — all the companies have said they want to do cameras. But we need a quorum of people that are willing to start working on it today, and the ones that would be are currently focused on 1.0.” </p><p id=\"UeyyZi\">In the same vein, while home security sensors are part of Matter, home security systems are not — yet. Many smart homes run with an alarm system as the main hub, so the lack of integration here could be a deal-breaker for some. </p><p id=\"meA5MK\">Mitch Klein, executive director of the Z-Wave Alliance — a technology used widely in home alarm systems for door / window sensors, motion sensors, and other devices — explains that there will be significant challenges to porting that technology to Matter. “Securing UL approval for security devices is exceptionally difficult, and Matter has numerous challenges here,” he says. “UL is a benchmark and often an insurance requirement. All professionally-installed security systems insist on UL approval.” UL (formerly called Underwriters Laboratories) is part of the CSA, however, and we can assume it’s working toward integration.</p><p id=\"SODx2n\">Speaking of cameras and alarm systems, one of the biggest smart home companies in both these spaces — Ring — hasn’t offered any indication it will support Matter. When I asked how / if Ring Alarm might integrate into Matter, a spokesperson provided the following statement: “Ring Alarm Pro does not support Matter over Thread.”</p><h1 id=\"MyBfao\">Is Matter going to keep my smart home private and secure? </h1><p id=\"NyZeZC\">Smart home adoption has been seriously hampered by concerns about privacy and security, and keeping devices secure is <a href=\"https://zigbeealliance.org/wp-content/uploads/2021/11/Matter-Security-Privacy_one-pager.pdf\">a core tenant of Matter</a>. “We are secure by design, we take a zero-trust approach, we use specific industry-standard encryption technology, and every device gets authenticated before it joins the network,” says Michelle Mindala-Freeman, head of marketing at CSA. “Every message is secured on the network, and Matter supports secure over-the-air updates.” </p><p id=\"zRqGMA\">In terms of your home’s data, that relationship remains between you and the individual manufacturers, says Mindala-Freeman. However, <a href=\"https://zigbeealliance.org/wp-content/uploads/2021/11/Matter-Security-Privacy_one-pager.pdf\">Matter’s Privacy Principles</a> outline data privacy protections, including minimizing how much data is shared in any Matter interaction and defining the purpose of data sharing when requested. As a bonus, because Matter has trust built into the system, you won’t have to continually input your passwords to connect ecosystems, explains the CSA’s LaPré. </p><p id=\"b2EIlm\">The significant advantage of Matter devices, direct IP control that lets them speak straight to the internet, is at the same time a possible security concern. “This exposes them to hacking, malware, etc.,” says Mitch Klein of Z-Wave Alliance. With Z-Wave and Zigbee systems, you have a single point of control to secure: the hub. Whereas a single point of securing the home is the opposite of what Matter is doing, Klein points out. </p><p id=\"aUWHSm\">The CSA says <a href=\"https://zigbeealliance.org/wp-content/uploads/2021/11/Matter-Security-Privacy_one-pager.pdf\">Matter’s security approach</a> is more modern, delivering security that is “strong, agile (to address the evolution of things like encryption types over time), and proactive, with a community of members who do threat modeling and mitigation,” says Tobin Richardson, president and CEO of the CSA. The approach is one of resilient security while still getting the benefits of an IP-connected world, “rather than security by obscurity.” Until devices are out in the wild, it’s hard to confirm this approach’s proficiency, but the intent checks all the right boxes.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"philips hue\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wBijTaQpzCRMvJoNzLgRsflqiNU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/4124096/D2-Heart-of-your-Hue-system-square-2.0.jpg\">      <cite>Image: Philips Hue</cite>      <figcaption><em>The Philips Hue smart lighting line will be upgraded to Matter through its existing bridge, according to the company.</em></figcaption>  </figure></div><h1 id=\"mEr5qU\">Will I need to replace my existing smart devices to use Matter? </h1><p id=\"1Fr5p9\">From the beginning, Matter has been designed to include those connected devices already in our homes. “We can’t leave devices behind, or this whole program won’t work,” says Klein. “The idea that everyone has to throw everything out and start again is just not going to work.” </p><p id=\"FnlhnX\">Newer Wi-Fi or Thread devices and those that work over Z-Wave and Zigbee should be upgradable to Matter. This can happen in two ways: upgrading the device directly over the air or through an upgrade to a product’s existing bridge — <a href=\"https://www.signify.com/global/our-company/news/press-releases/2021/20210512-complete-philips-hue-range-to-be-compatible-with-new-smart-home-connectivity-standard-matter\">Philips Hue has already committed to this for its smart lighting line</a>.</p><div class=\"c-float-right c-float-hang\"><aside id=\"PR5Twe\"><q>“In the long run, Matter will take over, and eventually, you’ll just get rid of all the bridges.”</q></aside></div><p id=\"3DtIvL\">Bluetooth devices that don’t rely on bridges, such as Eve’s line of security and sensor products, will need hardware upgrades, meaning older devices won’t be compatible. Eve has already rolled out upgraded hardware for its Bluetooth products and has <a href=\"https://www.theverge.com/2021/12/10/22827727/eve-matter-thread-upgrade-smart-shades-release-date\">committed to having everything Thread-enabled</a> when Matter launches. </p><p id=\"vyhL6q\">Existing Zigbee and Z-Wave devices are unlikely to be upgraded individually — because they can’t communicate directly to the internet. Despite Thread being based on Zigbee, very few devices with Zigbee radios will be upgradable directly. “IPv6 carries a heavy software burden and the majority of Zigbee devices out there could not support [that],” says Klein. But the hubs these devices communicate through can be upgraded or bridged to Matter.</p><p id=\"oA3sGH\">But going forward, the Matter smart home should be bridge-free. “Matter is going to be cheaper for device makers, it’s going to be cheaper for Philips, for example, to make an IP-based bulb [than continue to build bridges],” says LaPré. “So, in the long run, Matter will take over, and eventually, you’ll just get rid of all the bridges.” </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/rmRJ2-4XCAJgc7bv5uCtOORQiXs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21977839/dseifert_201020_4247_0003.0.jpg\">      <cite>Photo by Dan Seifert / The Verge</cite>      <figcaption><em>The Echo smart speaker (fourth-gen) is the only one Amazon has confirmed it’s upgrading to Matter so far, but it says others will be coming soon.</em></figcaption>  </figure></div><h1 id=\"PPefPz\">Should I wait for Matter to buy new smart home products?</h1><p id=\"DtH8AA\">This promise of future upgradability means you don’t need to wait for Matter to buy new devices, says Mindala-Freeman. “You should, with confidence, continue to develop your own smart home and smart environment,” they claim. But, as anyone who has bought a smart device knows, the promise of future software updates is not one to bet your house against. </p><p id=\"1pDDCq\">Still, the message from the industry is don’t stop buying devices altogether. Our advice is to consider products with Thread radios in them first, then Wi-Fi, as both of these have a clear upgrade path. If that doesn’t suit your immediate needs, look for products with hubs or bridges that contain either protocol. Beyond that, research the company you’re considering buying from to see if it has made any commitment to Matter — but proceed with caution.</p><p id=\"Z83JLG\">If you are itching to get started with your Matter smart home, the best device to buy now would be a Thread border router. Products are currently available from Apple, Nanoleaf, and Eero, with support coming to Amazon Alexa and Google Home smart speakers and displays later. </p><p id=\"uihsmd\">While Matter will work over Thread and Wi-Fi — meaning you don’t have to have a border router to use the standard — adding one (or more) will help ensure you have a solid foundation on which to build a Matter-supported home. Because Thread is a mesh network the more devices you have on it the better the range and reliability will be. A border router will bridge your Thread and Wi-Fi devices, ensuring everything in your home can talk to each other. </p><p id=\"CT5l2T\">Fortunately, a border router is not a bridge in the traditional plug-a-white-box-into-your-router sense. They don’t need an ethernet connection, they just need continuous power and Wi-Fi connectivity. This means a border router can really be anything from a smart plug or smart speaker to a fridge, television or thermostat. Finally, the smart home is starting to make sense.</p><p class=\"c-end-para\" id=\"0rEOyA\"><em><strong>Update March 18th, 11:40 AM ET:</strong></em><em> Added a list of companies who have products available now or in development that they have said will work with Matter. Updated the timeline for the release of Matter and Matter-capable products.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2zlwJsDo87TgU_EcVbULS7NTxJQ=/0x115:1600x953/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23084939/f7484de0_fd1a_11eb_8eb4_4d8ac557fa35.jpg",
  "description": "How to prepare for the coming of Matter",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}