{
  "title": "What Elon Musk’s Twitter ‘free speech’ promises miss",
  "url": "https://www.theverge.com/2022/4/15/23025120/elon-musk-twitter-free-speech-government-censorship",
  "date": "2022-04-15T12:00:00.000Z",
  "author": "Adi Robertson",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/h4WHxd_yVuaASA_xlJ8kp7-xSes=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70752490/VRG_Illo_STK022_K_Radtke_Musk_Down_Arrow_Blue.0.jpg\" />        <figcaption>Illustration by Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p id=\"gjhvay\">Thursday morning, <a href=\"https://www.theverge.com/2022/4/14/23025396/elon-musk-jack-dorsey-twitter-hostile-takeover\">Elon Musk offered to buy Twitter</a> to save free speech. </p><p id=\"k2lzYH\">“I invested in Twitter as I believe in its potential to be the platform for free speech around the globe, and I believe free speech is a societal imperative for a functioning democracy,” wrote the Tesla and SpaceX billionaire — who recently acquired a 9.2 percent stake in Twitter — in a filing. “However, since making my investment I now realize the company will neither thrive nor serve this societal imperative in its current form. Twitter needs to be transformed as a private company.”</p><p id=\"rUekRi\">It’s <a href=\"https://www.theverge.com/2022/4/14/23025903/twitter-ceo-board-elon-musk-takeover-still-evaluating\">not clear</a> how this gambit will play out, but there’s also a more fundamental question: what does Elon Musk think free speech is, and who’s threatening it? Free expression is a cornerstone of an open society, and with governments across the world eyeing crackdowns on internet platforms, there’s a complicated interplay between different visions of what should be allowed online. But despite his sweeping declaration, Musk’s eye seems almost entirely focused on the far smaller question of Twitter’s own internal rules.</p><p id=\"NunOAg\">In 2011, <a href=\"https://www.wsj.com/articles/BL-DGB-23367\">Twitter’s former CEO Dick Costolo asserted</a> that Twitter belonged to “the free speech wing of the free speech party,” a phrase that’s been invoked by critics of the platform’s moderation calls ever since. In the context of that era, free speech controversies mostly involved Twitter’s relationship with governments. The platform was earning plaudits for letting activists organize under the threat of political repression <a href=\"https://www.theguardian.com/world/2011/feb/25/twitter-facebook-uprisings-arab-libya\">in Egypt and other countries</a>. Costolo boasted about <a href=\"https://www.wsj.com/articles/SB10001424052748704482704576072081788251562\">his fight with the US government</a> over account data related to WikiLeaks, which was under investigation after leaking diplomatic cables.</p><div class=\"c-float-right\"><aside id=\"EoNmHP\"><q>“Civilizational risk is decreased the more we can increase the trust of Twitter”</q></aside></div><p id=\"4kiKIA\">In a TED interview with Chris Anderson on Thursday, Musk’s concerns were more nebulous — and directed almost entirely at Twitter itself. Musk didn’t show much appetite for fighting global speech restrictions — noting that “in my views, Twitter should match the laws of the country.” Instead, he raised the specter of tweets being “mysteriously promoted and demoted” by Twitter’s sorting algorithm, which Musk says should be published publicly. (Former Twitter CEO Jack Dorsey has <a href=\"https://www.theverge.com/2021/2/9/22275441/jack-dorsey-decentralized-app-store-algorithms\">also envisioned a version</a> with more transparent algorithmic recommendations.) </p><p id=\"W1ymon\">“It’s just really important that people have the reality and the perception that they’re able to speak freely within the bounds of the law,” Musk told Anderson. “I think broadly, the civilizational risk is decreased the more we can increase the trust of Twitter as a public platform.”</p><p id=\"IC9Tks\">Musk was reflecting a common assumption that Twitter is a “town square” that’s become the primary arbiter of what people can say. But governments around the world still have a huge say in what gets said and how. In the years since Costolo’s comment, online speech laws have proliferated. Multiple countries have passed “fake news” rules that are (in theory) supposed to crack down on the spread of false online information, and some have threatened to <a href=\"https://www.theverge.com/2022/3/20/22988183/telegrams-ban-brazil-lifted-president-bolsonaro\">ban platforms</a> that don’t comply. European privacy rules instituted <a href=\"https://www.theverge.com/2014/7/14/5897409/google-european-union-right-to-be-forgotten-storystream\">a “right to be forgotten”</a> that requires platforms to remove embarrassing information posted online under certain circumstances. India implemented <a href=\"https://www.theverge.com/2021/8/11/22619718/twitter-indian-government-internet-it-rules-compliance-grievance-nodal-officer\">a strict legal regime</a> for social media companies, requiring local offices to appoint government liaisons and, at one point, <a href=\"https://www.theverge.com/2021/5/24/22451271/police-india-raid-twitter-tweets-government-manipulated-media\">raiding Twitter’s offices</a>.</p><div class=\"c-float-left\"><aside id=\"43dZ7u\"><q>Twitter is far from the final word on what people say online</q></aside></div><p id=\"sHVVFK\">Even inside the US, which has some of the world’s most permissive speech laws, Twitter’s moderators aren’t the only power at work. The platform has some of the loosest standards around adult content for a major social network, but <a href=\"https://www.theverge.com/2018/4/11/17223720/trump-signs-fosta-sesta-sex-trafficking-section-230-law\">the 2018 FOSTA-SESTA law</a> threatens companies’ legal protections if they allow content related to sex work. US copyright law enjoys a significant exception to the normal rules protecting platforms from legal liability, which has spurred Twitter to do things like <a href=\"https://www.theverge.com/2015/7/25/9039127/twitter-deletes-stolen-joke-dmca-takedown\">remove stolen jokes</a>. The way companies like Twitter interpret these kinds of rules has a huge effect on users’ livelihoods and creative freedoms.</p><p id=\"SkgMjU\">Big tech platforms don’t just <em>respond</em> to laws in the US; they also play a role in lobbying for new ones. Jack Dorsey appeared before Congress multiple times during his tenure as CEO, during which he was asked about issues like how lawmakers should change Section 230, one of the central pillars of online speech. Musk hasn’t indicated what role a newly private Twitter might play in these debates, and it’s not clear he’s interested. We also don’t know how Musk’s version of Twitter would engage with other digital gatekeepers. If Apple demanded it cut off access to NSFW content through its iOS app, for instance — something <a href=\"https://www.theverge.com/tech/2021/4/19/22391675/discord-ios-nsfw-ban-loosened-opt-in\">it’s pushed Discord</a> and other services to do — would Twitter play ball?</p><p id=\"BzXgdL\">Far from being better equipped to protect free speech, a Musk-owned Twitter might be in a weaker position than a publicly owned one. Musk’s involvement in numerous other industries — including telecommunications with Starlink, space travel with SpaceX, and cars with Tesla — would give regulators and politicians added leverage to pressure Twitter with. This kind of leverage has already <a href=\"https://www.theverge.com/2020/9/4/21423347/apple-freedom-speech-expression-information-china-censorship-policy\">been a powerful weapon</a> against heavily vertically integrated companies like Apple, which has complied with Chinese censorship and surveillance requests to avoid losing access to a massive market for its hardware. Musk’s businesses have the extra wrinkle of often involving government contracts and subsidies — the sort of deal that a high-profile moderation fight might put at risk.</p><div class=\"c-float-right\"><aside id=\"JrMwJo\"><q>A Musk-owned Twitter might even be more vulnerable to government pressure</q></aside></div><p id=\"oDwjH3\">Twitter’s speech stance was never as absolutist as Costolo’s comment suggested. Even while he and other employees were <a href=\"https://www.npr.org/sections/alltechconsidered/2013/03/21/174858681/on-its-7th-birthday-is-twitter-still-the-free-speech-party\">still using the phrase</a>, they <a href=\"https://www.npr.org/sections/thetwo-way/2012/10/19/163243194/twitter-blocks-offensive-accounts-in-germany-u-k-deletes-tweets-in-france\">complied with French and German hate speech rules</a> by “withholding” neo-Nazi or anti-semitic posts in those countries. The company promised it was trying to <a href=\"https://twitter.com/amac/status/258745846584188928\">apply the rules</a> “narrowly and transparently,” but “we have to abide by the laws in the countries in which we operate,” Costolo acknowledged after a French court ordered it to block hateful tweets. If you want to turn a profit as a global company, there’s a limit to how many laws you can persistently flout — there’s a reason many tools for evading censorship are open source and noncommercial.</p><p id=\"hRCpy7\">But Costolo at least acknowledged that Twitter was engaging with a much bigger world. My colleague Liz Lopatto, meanwhile, has <a href=\"https://www.theverge.com/2022/4/14/23025396/elon-musk-jack-dorsey-twitter-hostile-takeover\">aptly framed Musk’s takeover plans</a> as a virtuoso Twitter troll trying to hold sway over his favorite toy. And there’s only one enemy a troll truly fears: the mods.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/gxKrTWDLE6RXttsACpVktddRezs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390590/VRG_Illo_STK022_K_Radtke_Musk_Down_Arrow_Blue.jpg",
  "description": "Musk proposed a buyout of the social platform yesterday.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}