{
  "title": "What to expect from Apple’s ‘Peek Performance’ March event",
  "url": "https://www.theverge.com/2022/3/6/22960325/apple-march-2022-event-iphone-se-peek-performance-rumors-announcements",
  "date": "2022-03-06T14:00:00.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"“peek performance”\" src=\"https://cdn.vox-cdn.com/thumbor/FWvDzpilLZXfgDo-Wqntx-QhkpY=/53x0:1145x728/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70585584/Screen_Shot_2022_03_02_at_12.03.10_PM.0.jpg\" />        <figcaption>Image: Apple</figcaption>    </figure>  <p id=\"kYFtut\">Apple is poised for its first livestream event of 2022 on Tuesday, March 8th at 1PM ET. The company sent out press <a href=\"https://www.theverge.com/2022/3/2/22949618/apple-iphone-se-ipad-air-face-id-mask-spring-event-peek-performance\">invitation</a> emails for the event titled “Peek Performance,” with <a href=\"https://www.theverge.com/2022/2/4/22918318/iphone-se-ipad-air-5g-apple-rumor-march-8-universal-control\">rumors strongly suggesting</a> Apple will announce a new third-generation iPhone SE with 5G.</p><p id=\"R15HIT\">The iPad Air might also get a new spec bump update at the event, with upgrades to both 5G and an A15 Bionic processor, similar to last year’s <a href=\"https://www.theverge.com/22696652/ipad-mini-2021-6th-gen-review\">iPad Mini</a>. Another rumor suggests an <a href=\"https://www.theverge.com/2022/2/20/22943411/apple-m2-chip-new-macs-rumor\">Apple Silicon “M2” upgrade</a> alongside a redesigned MacBook Air might be coming. New Macs, including a Mac Mini with an M1 Pro / M1 Max processor update, could also get a showing, and new iMac and Mac Pro hardware are said to be in the works — but those will likely show up later in the year. Whatever the case might be, we might see at least one of these new Macs on March 8th.</p><p id=\"HTjbBG\">That’s not all Apple might announce on Tuesday, so prime your expectations for the Apple event by reading about all the rumors and details below.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/8Z_Bn8eFs_yEnG1JyBKYniRMZa4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19915215/vpavic_042019_3980_0011.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>The iPhone SE 2 from 2020 might get a 5G refresh</em></figcaption>  </figure><h3 id=\"J93vZx\">iPhone SE 3 with 5G</h3><p id=\"qrIfbw\">The upcoming third-generation iPhone SE is expected to succeed the 2020 model as the new budget-friendly iPhone option. The first iPhone SE came out in 2016 and remained available for four years, which means the SE line is set for a quicker change of pace.</p><p id=\"l8lMSD\">According to reliable analyst and leaker Ming-Chi Kuo, the iPhone SE 3 will probably include the latest A15 Bionic chip, 5G with millimeter wave, 64GB base storage with 128GB / 256GB options, and retain the design and colors of the current model. Kuo <a href=\"https://twitter.com/mingchikuo\">shared the info via Twitter</a> on a verified account that has remained quiet until now.</p><div id=\"78XJF4\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some predictions for the coming new iPhone SE:<br>1. Mass production in Mar'22.<br>2. Estimated shipments of 25-30 mn units in 2022.<br>3. Storage: 64/128/256GB.<br>4. A15 &amp; 5G support (mmW &amp; Sub-6 GHz).<br>5. Casing: white, black, and red.<br>6. Similar form factor design to current SE.</p>— 郭明錤 (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://twitter.com/mingchikuo/status/1499721483907907586?ref_src=twsrc%5Etfw\">March 4, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"9zeS3o\">The 2020 iPhone SE offered <a href=\"https://www.theverge.com/2020/4/16/21223187/new-iphone-se-price-value-processor\">shockingly good value</a> with the then-latest chipset, but its battery life was never the star of the show. Now that US carriers only want phones with 5G on their shelves, the battery life in a new iPhone SE would be a bigger concern — especially if the form factor remains the same. The current iPhone SE body models the iPhone 8, but its aging design language dates all the way back to 2014 with the iPhone 6.</p><p id=\"viW2Xg\">It’s also possible that the iPhone SE could borrow the form factor of the iPhone 13 Mini. Due to reports of <a href=\"https://www.theverge.com/2021/3/10/22322843/iphone-12-mini-apple-low-production-numbers-decrease\">less than expected sales</a> of the iPhone 12 Mini, it’s rumored that the iPhone 13 Mini might be Apple’s last compact mainline phone. But just as the iPhone SE from 2016 carried on the compact design of the iPhone 5s, and the 2020 iPhone SE copied the smaller iPhone 8 design, the iPhone SE might become the new home for the Mini.</p><p id=\"AXu8Bi\">There’s no word on price yet, but don’t expect to see a reduction to the starting $399 price. 5G modems are still expensive, so a starting storage option of 64GB makes sense if the price is to remain intact. Touch ID would also keep costs down if the design remains.</p>  <figure class=\"e-image\">        <img alt=\"The 2020 iPad Air and new iPad Mini have the same design and shape as the iPad Pro\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/joZsy6E_jWvf8X3cKeh92dMZ72o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/21975641/vpavic_4244_20201020_0013.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>iPad Air is expected to get 5G and a new processor</em></figcaption>  </figure><h3 id=\"cg3wMZ\">A breath of fresh iPad Air</h3><p id=\"EycOjD\">The iPad Air received an iPad Pro-style redesign in 2020: it got flat edges, thin bezels, Apple Pencil 2 support, USB-C, and a new Touch ID sleep / wake button. But the still fresh design is already lagging behind: the iPad Mini from last year followed the design of the iPad Air but one-upped it with with the latest A15 Bionic processor and 5G data options (though just sub-6GHz and no millimeter wave support).</p><p id=\"e68SQA\">So it makes sense for Apple to roll out an updated iPad Air with the latest A15 Bionic processor and with a 5G option — and perhaps <a href=\"https://www.theverge.com/2021/4/21/22395325/ipad-pro-pan-zoom-video-conferencing-microsoft-teams\">center stage</a> as well. And although FaceID would welcome, don’t expect any other changes.</p>  <figure class=\"e-image\">        <img alt=\"The new MacBook Air with the M1 chip\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/wPXjA6y9G00Ngvbdd2U88wTKSDA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22046476/vpavic_4291_20201113_0366.0.jpg\">      <cite>Photo by Vjeran Pavic / The Verge</cite>      <figcaption><em>Can you tell if this is the Intel or M1 MacBook Air? Hopefully you will be able to tell soon with the announcement of a redesigned M2 MacBook Air.</em></figcaption>  </figure><h3 id=\"3lj8Rr\">MacBook Air redesigned and with a new M2 Processor</h3><p id=\"LccYiE\">It’s possible that Apple announces a new MacBook Air with a new M2 chip at this event. The current design of the MacBook Air dates back to 2018 and was a testbed for the Apple M1 chip debut in 2020.</p><p id=\"p8f7yz\">We reviewed the current MacBook Air with M1 as one of the best laptops you could buy in 2020, with a score that was <a href=\"https://www.theverge.com/21569603/apple-macbook-air-m1-review-price-specs-features-arm-silicon\">cut short of perfect</a> only because of the less-than-stellar webcam.</p><p id=\"YR5kqe\">But it’s 2022 now, and we have freshly updated MacBook Pro designs with better screens and a better camera that you can expect the MacBook Air will soon follow. It might even come with <a href=\"https://www.theverge.com/2021/10/18/22732912/apple-macbook-pro-notch-display\">a notch</a>.</p><h3 id=\"Z3ODLv\">Max out on M1 Mac desktops</h3><p id=\"YLFieE\">A new Mac Mini was <a href=\"https://www.theverge.com/2021/8/23/22637477/new-mac-mini-design-ports-m1x-release-date-gurman\">rumored to come late last year</a>, but it never showed up. Right now, the only way to harness the power of the latest M1 Pro and M1 Max chips is in the latest MacBook Pro models. A new Mac Mini with the latest processor options would change that.</p><p id=\"oCmyMi\">The current Mac Mini design dates back to 2010, which was made to be just large enough to fit an optical drive. So it’s about time we get a new Mac Mini chassis, but if we don’t, then hopefully, we will at least get a “Pro” looking <a href=\"https://www.theverge.com/2018/11/16/18097117/apple-mac-mini-2018-review-upgrade-faster-more-powerful-features-price\">space gray finish</a> again. We could even see Mac Mini split up into a pro option and a standard option that comes with a new M2 processor.</p><p id=\"I9hPxB\">Right now, there’s only one <a href=\"https://www.theverge.com/22440059/apple-imac-m1-2021-24-review\">iMac option with M1</a> processors, but it only has a 24-inch screen option. If we don’t see new larger iMacs on Tuesday, we might see it later in the year. The iMac Pro was also <a href=\"https://www.theverge.com/2021/3/6/22316831/apple-store-imac-pro-base-model-while-supplies-last\">discontinued a year ago</a>, so that would make for an interesting surprise, though there haven’t been any supply chain leaks that would indicate a new version is imminent. There’s also the Mac Pro that has no M1 option yet — and while it’s rumored to be in the works, don’t hold your breath for that one on Tuesday.</p><h3 id=\"BbgeDH\">Apple TV plus getting more shows and movies</h3><p id=\"YAfNKC\">The last time Apple held an event in March was in 2019, a live presentation that showcased new premium Apple services like Apple TV Plus. Three years later, it’s very possible Apple could showcase new TV shows or movies like it did <a href=\"https://www.theverge.com/2021/9/14/22673907/apple-event-2021-apple-tv-plus-streaming-wars\">last September</a>.</p><h3 id=\"hFYkPS\">One more thing?</h3><p id=\"wDqnnB\"><a href=\"https://twitter.com/SmashDawg/status/1499078435012059140\">Some speculation</a> of the meaning of Apple’s event invite title “Peek Performance” points to the word “Peek” as the name of a VR / AR product. While Apple’s long-rumored headset product is <a href=\"https://www.theverge.com/2022/1/14/22883790/apple-virtual-augmented-mixed-reality-ar-vr-headset-launch-2023\">not expected to be ready until 2023</a>, perhaps there’s a chance Apple can surprise and delight — just don’t expect to see an <a href=\"https://www.theverge.com/2021/11/18/22789615/apple-self-driving-car-project-titan-custom-processor-ev\">Apple Car</a> anytime soon.</p><p id=\"rai6oE\">Apple is also expected to release some software updates: iOS 15.4 that can let your Face ID-enabled iPhone <a href=\"https://www.theverge.com/2022/2/2/22912677/apple-face-id-mask-update-ios-15-4-beta-hands-on-impressions\">unlock while wearing a mask</a> and also a macOS Monterey plus iPad OS 15.4 update that will finally enable the iPad to Mac traversing <a href=\"https://www.theverge.com/2022/1/27/22904957/apple-universal-control-ipados-15-4-macos-monterey-12-3-betas\">Universal Control feature</a>.</p><p id=\"RPYuaf\">Check out all the latest Apple news as it breaks here on <em>The Verge</em>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vtpWggATi5DNEXchk_aIpNCB8pw=/0x51:1198x678/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23289151/Screen_Shot_2022_03_02_at_12.03.10_PM.jpg",
  "description": "Apple March event might show new iPhone SE and more",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}