{
  "title": "WhatsApp’s new browser extension is aimed at making web chats more secure",
  "url": "https://www.theverge.com/2022/3/11/22972381/whatsapp-meta-code-verify-web-browser-security-hash",
  "date": "2022-03-11T10:23:48.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/CnQ9laK-z8OGhAs3vmFTEQRAd6M=/0x0:1620x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70607781/WhatsApp_Code_Verify_Hero2.0.jpg\" />        <figcaption><em>WhatsApp says its web interface is growing increasingly popular.</em> | Image: Meta</figcaption>    </figure>  <p id=\"QaVfmB\"><a href=\"https://engineering.fb.com/2022/03/10/security/code-verify/\">Code Verify</a> is a new browser extension from WhatsApp parent company Meta that aims to improve the security of <a href=\"https://web.whatsapp.com\">WhatsApp’s web version</a>, the <a href=\"https://engineering.fb.com/2022/03/10/security/code-verify/\">company has announced</a>. The extension works by verifying that the contents of WhatsApp’s web version haven’t been tampered with. The aim is to make it a lot more difficult for a would-be attacker to compromise data or the privacy of WhatsApp’s end-to-end encrypted messages when using the browser-based version of the service.</p><p id=\"7VQvUi\">The extension follows the launch of <a href=\"https://www.theverge.com/2021/7/14/22577594/whatsapp-multi-device-e2e-facebook\">WhatsApp’s multi-device beta</a> last year. This aims to make using the messaging service from devices other than your primary phone easier and more seamless. Since the feature’s launch, WhatsApp says it’s seen an increase in people accessing its service through web browsers, which present new security challenges compared to an app.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VC21llkrPh4uOVC3HGL7nooNKbk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23306196/image1_5.jpg\">      <cite>Image: Meta</cite>      <figcaption><em>A diagram of Code Verify’s steps.</em></figcaption>  </figure><p id=\"zQLEB3\">There’s nothing particularly new about the security methods underpinning Code Verify. Ultimately it’s just comparing a hash of the code running in your browser, with a hash held by <a href=\"https://blog.cloudflare.com/cloudflare-verifies-code-whatsapp-web-serves-users/\">trusted third-party Cloudflare</a>. But its value is in automating this process, which makes it easy for anyone to understand and use regardless of their technical knowhow. </p><p id=\"VQ3KJx\">Once it’s done the check, the browser extension uses a traffic light system to show you whether there are any issues. Green means everything’s a-ok, but orange suggests you might need to refresh your page or that you have a separate browser extension interfering with Code Verify. Red means there’s a problem, and <a href=\"https://faq.whatsapp.com/web/security-and-privacy/about-code-verify\">WhatsApp’s help page</a> says the extension will be able to help users solve it.</p><p id=\"yYpy16\">Meta says the extension isn’t able to read or access your messages, and none of this data is sent to Cloudflare. Meta has also released the source code for Code Verify <a href=\"https://github.com/facebookincubator/meta-code-verify/\">on GitHub</a>, opening the door for other websites to make use of its security features. The extension is available now for <a href=\"https://chrome.google.com/webstore/detail/code-verify/llohflklppcaghdpehpbklhlfebooeog\">Chrome</a> and <a href=\"https://microsoftedge.microsoft.com/addons/detail/code-verify/cpndjjealjjagamdecpipjfamiigaknk\">Edge</a>, and Meta says that a version of Firefox is “coming soon.” There’s no mention of a version for Safari in Meta’s press release, but its GitHub page notes that support is on the way. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BClPCT4n31ns2sQvkFdRMbgd2n0=/0x116:1620x964/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23306198/WhatsApp_Code_Verify_Hero2.jpg",
  "description": "Available now for Chrome and Edge.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}