{
  "title": "What an NFL coaching scandal can teach tech about diversity",
  "url": "https://www.theverge.com/22933148/tech-diversity-nfl-coach-scandal-podcast-inclusion-bari-williams-interview-decoder",
  "date": "2022-02-15T15:15:00.000Z",
  "author": "Nilay Patel",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/JNcD0efuVnnt9htL1y9PVjznrcE=/0x0:2050x1367/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70511265/VRG_ILLO_Decoder_Bari_Williams_s.0.jpg\" />        <figcaption>Photo Illustration by Grayson Blackmon / The Verge</figcaption>    </figure>  <p>Tackling tech’s diversity problem with Bärí Williams</p> <p class=\"p--has-dropcap p-large-text\" id=\"5BXn1E\">Bärí Williams is a legal and operations advisor to tech companies who focuses on AI and diversity. Her credentials are rock solid: Bärí was lead counsel at Facebook working on various projects, including internet connectivity efforts and diversifying the company’s supply chain. After that, Bärí went to work at StubHub, an AI startup studio called All Turtles, and a data and identity analytics company called Bandwagon Fan Club.</p><p id=\"Z63Uy0\">But now, she’s independent — a business of one, consulting on operations with a focus on diversity and AI. I was curious why she decided to leave being a tech executive behind and make that shift to diversity work. We talked about that, but our conversation actually started with sports news — NFL news.</p><p id=\"jO6DdG\">The week we recorded this episode, Brian Flores, the former coach of the Miami Dolphins, <a href=\"https://www.sbnation.com/nfl/2022/2/1/22913094/brian-flores-lawsuit-nfl-bill-belichick-text-messages-stephen-ross-tanking-john-elway-hungover\">sued the NFL for racial discrimination</a>. But as I was reading the case, one thing really jumped out at me: since 2003, the NFL has had something called the Rooney Rule, which requires teams to interview minority candidates for head coaching jobs. </p><p id=\"zer9z8\">Flores is Black, and even though he built a winning record at the Dolphins and the players seemed to like him, he was still fired. Flores claimed that he was given a sham interview by the New York Giants merely to fulfill the Rooney Rule requirement — his complaint has a screenshot of a text from Bill Belichick congratulating him on getting the Giants job three days before his interview… before Belichick realized he was texting the wrong person. It is all pretty shocking. Flores claims that Black coaches have fewer opportunities and get fired more quickly than white coaches. And overall, there are fewer Black head coaches in the league since the Rooney Rule was imposed than before.</p><p id=\"rJhLm0\">The reason I bring all this up is that the Rooney Rule is often held up as an example of a worthwhile diversity initiative — something that other companies should try and emulate. But here, it seems to have failed in catastrophic fashion. I wanted to understand why, and we used that conversation to launch into the diversity problem that tech is having.</p><p id=\"E5SezO\">OK, Bärí A. Williams. Here we go.</p><div id=\"MiW3nc\"><iframe frameborder=\"0\" height=\"200\" scrolling=\"no\" src=\"https://playlist.megaphone.fm?e=VMP9250320502\" width=\"100%\"></iframe></div><p id=\"4w39xW\"><em>This transcript has been lightly edited for clarity.</em></p><p id=\"5wnnvB\"><strong>Bärí Williams — you are a tech, legal, and operations adviser with a focus on diversity and AI. That’s a fun combo. Welcome to </strong><em><strong>Decoder</strong></em><strong>.</strong></p><p id=\"mUDWIm\">Thank you for having me.</p><p id=\"kg0XA7\"><strong>There’s a lot to talk about. You and I are talking just the day after Brian Flores, the ex-head coach of the Miami Dolphins, sued the NFL for racial discrimination. There’s an overwhelming amount of things to talk about in terms of how organizations and companies are structured and the processes we have to create level playing fields, but let’s start with the Brian Flores news.</strong></p><p id=\"Fhb2V8\"><strong>I mentioned in our intro that Brian Flores was interviewing for the open head coaching job of the New York Giants, but it seems like he only got the interview because of the Rooney Rule. The NFL is 70 percent Black players. But when you get to the coaching staffs, offensive and defensive coordinators, head coaches, general managers — it’s pretty much all white.</strong></p><p id=\"lYtfYa\"><strong>So the Rooney Rule, which says they are supposed to interview minority candidates for coaching positions, is often held up as a model. I hear from all kinds of companies that are going to have a Rooney Rule-like system, but in this case, it turned out they were only interviewing Flores because they had to — at least, that’s his allegation. Let’s lease this allegation — and he had no shot of getting that job.</strong></p><p id=\"YFqa9t\"><strong>Why do you think it played out this way?</strong></p><p id=\"ViZqW8\">Because [the Rooney Rule] is a box checker — it’s not a real mandate. It’s, “Oh yeah, well, of course, we’re going to interview some diverse candidates. Yeah. Yeah. Great.” That’s them counting to five. Then they go ahead, interview the person, and then end up hiring the white dude anyway.</p><p id=\"IEMopU\">For me, it’s interviewing in bad faith. That’s essentially what it is. What you’re doing is you’re not really interviewing this person because you want to give them the job or if you even think that they’re capable. The funny thing about that — and I did see that text — is that [Flores] hadn’t even interviewed yet. It’s like you’re congratulating... I don’t know what to call him. Brian D.</p><p id=\"bXR8gI\"><strong>Brian Daboll.</strong></p><p id=\"69Nq1k\">You’re congratulating Brian D., but you’re sending it accidentally to Brian F., who hasn’t even interviewed yet. At this point, you’ve already admitted that you have insider information that you know this guy isn’t getting the job; he’s just checking a box. If you’re disingenuous in terms of why you’re interviewing the person, you’re going through the motions just to say that you did it. That, to me, is what I feel like a lot of people do. It’s like saying, “Oh yeah, we interviewed somebody from San Jose State,” but then you went ahead and hired the dude from Stanford.</p><p id=\"P6Zrio\"><strong>How do you bring actual accountability to that? This story is explosive. I think it’s going to have long-lasting effects for the NFL, but it is true that the Rooney Rule has been held up as this model of making sure that the hiring pipeline is diverse and counting on exposure over time to fix the problem. We’re going to force these people to seriously interview minority candidates. You can’t tell the owner of an NFL team, “Keep your heart open.”</strong></p><p id=\"9Zibo9\"><strong>There’s no way to look in and see, so how do you bridge that gap? The promise of the Rooney Rule is simply that exposure will make things better: “We’re going to mandate this kind of exposure and this kind of conversation.” It hasn’t worked out, but I don’t really know what the next step is.</strong></p><p id=\"QIbpSC\">I don’t know necessarily that you can force people to have any type of accountability with that. I think the hard part with that is it’s very much an insular club. It’s analogous to tech in certain ways, but it’s very much who you know and what are your credentials in terms of, “Where else have you been before? Who can I backchannel to find out about you?” </p><div class=\"c-float-right c-float-hang\"><div id=\"zVjExD\"><div data-anthem-component=\"aside:9545330\"></div></div></div><p id=\"8n9flD\">The problem is a lot of these diverse candidates are coming in, and they don’t necessarily have those same networks and those same connection, so even if they have a stellar interview and even if they got the interview via the Rooney Rule and they knock it out of the park, there’s still a ding that no one is going to actively say, “Well, but you don’t know X, Y, and Z person,” or “You didn’t study under this person,” or, “You didn’t coach at one of these SEC elite schools beforehand,” or, “You didn’t do...” — insert the thing you didn’t do here because you don’t have equitable access. </p><p id=\"AfSgtE\">I don’t necessarily think exposure is enough. It’s going to take actual results. One thing that I always question is, “Who’s on these interview panels?” That’s something that when I advise companies or do training with them, I call that inclusive interviewing. </p><p id=\"iG50Lq\">If you have a list of standardized questions and you don’t deviate from those, there has to be some type of standardization to ensure it’s not just enough to give them the interview. What are you doing in the interview? Who’s on the interview panel? How are you rating and assessing these interviews after the fact? Are players involved in helping make this decision, or is it just left to the front office? Because the players are the ones that are going to have to deal with this person the majority of the time, and I would be very curious to understand how many — if any — of the 70 percent of Black players in the league are getting the chance to participate in some of these interview rounds, and how often and how many of them.</p><p id=\"G2CaEX\">It’s not just exposure. You’re going to have to have some kind of inclusive standardization of how you’re interviewing these people. That goes just as well in tech: there shouldn’t be deviation in interviews talking about personal life — you’re not supposed to ask people about their personal lives in interviews, but just to ensure that there is a sliver of some equity, and to make sure that people are going to be judged equally to the best of your ability, you have to make sure that people are answering the same questions.</p><p id=\"eBImve\">Then you can rate answer for answer, like if Brian Flores said something ridiculous about maybe a hypothetical play call and Brian D. answered it wonderfully, then sure, [hiring Brian D.] is fair, but if it turned into something else where they’re shooting the shit, that’s not a fair interview.</p><p id=\"LToUSO\"><strong>Let me bring this to tech because I could talk about the NFL and this lawsuit all day and all night.</strong></p><p id=\"3avs9C\">I could too.</p><p id=\"M7W0qX\"><strong>I think one of the things that happens particularly to young leaders at companies is that they have a negative connotation to their diversity person or their HR person. You see them coming, and you know it’s bad news. And now you have to sit through some training. And we’re all remote, so the training is just like you in your house having someone tell you you’re not doing a good job or you should feel bad.</strong></p><p id=\"rjl39X\"><strong>When it comes to tech, one thing that leaps out at me is that tech is diverse, but not in the way that we want it to be. Fifty-three percent of Meta’s technical roles are Asian people. I don’t see that diversity reflected in their product. I don’t use any of Meta’s products and think, “Wow, this company is diverse.” It actually has more people of color in it than not. And there’s just a disconnect there that I’ve never really been able to wrap my head around. Why do you think that is?</strong></p><p id=\"EQvjvD\">That’s a good question. I do appreciate that you’re calling that out in terms of how diversity impacts how a product is actually made. You could even see something like that just as simple in terms of beta testing: did anybody beta test this before you shipped it? Because it doesn’t work. </p><p id=\"V6tbbs\">That’s a good question around the disconnect that there are more people of color when you look at it in terms of Asian population, but that’s also — I went to Cal, and you could say the same thing about the University of California system, but I think what people are aiming for is to see more diversity within that diversity, if that makes sense. But I think there’s another layer to this that isn’t necessarily looked at: that’s great that a company could be 53 percent over-indexing people of color, but where do they sit within the organization — meaning what is their level? Are they directors and above? Are they VPs? </p><div class=\"c-float-right c-float-hang\"><aside id=\"CChCfW\"><q>“We can talk all day about the diversity numbers within your company, but if you’re not actively looking at the leveling of those diverse folks within your company, that’s a problem.”</q></aside></div><p id=\"fmX2F4\">That, to me, is the other piece that’s missing from this: we can talk all day about the diversity numbers within your company, but if you’re not actively looking at the leveling of those diverse folks within your company, that’s a problem. That’s also when you look at a company, and they say, “Oh well, we’re 30 percent women.” Great! What departments are they in? Because the beneficial elements of diversity are found on individual teams in those departments, so if your company is 30 percent women, but 85 percent of that 30 percent is in HR, that’s not really going to give you the product differential that you’re looking for. </p><p id=\"vKzSnN\">Also just something as simple as testing something: I did a segment last night talking about policing and AI and the use of facial recognition technology. Black women have the highest false match rates. If you have grainy footage of somebody on a security camera and you’re running it against a database that has my driver’s license, and maybe I changed my hair that day, and you come knock on my door, I’m going to say that’s not me, but are you going to believe me? Probably not. But also who built that product and who did they build it for? And who did they build it with? What was the basis that they started with an order to design that product?</p><p id=\"LdflIi\">That’s what I mean when you’re talking about needing diversity in all elements: it needs to be all throughout the fabric of your company. It can’t just be segmented into one population or one department or one team. It has to be throughout. So I understand what you mean by saying yes, there’s essentially an over-index. In particular, you said the engineering team, right?</p><p id=\"RkBFSK\"><strong>Facebook just labels them technical roles.</strong></p><p id=\"eKyk52\">Yeah. That’s probably engineers, PMs, design to a certain extent, etc. But yeah, I wouldn’t say that necessarily that does come out in the product design, but I also feel like you can’t necessarily throw all Asians in a group because they’re segmented.</p><p id=\"cTd3BA\"><strong>Sure.</strong></p><p id=\"LE6PXc\">What would be the population of Filipinos that are grouped into there? I’m guessing it’s going to be a very small number as opposed to maybe Southeast Asian or Chinese. It’s just going to be different, and all of them are going to have different lived experiences. We could go deep on this all day long, but there’s also an element of the ability and ease for some groups to assimilate more than others. That’s going to come out in terms of the access that they’re given to certain things — or certain people, even — and how they handle product design.</p><p id=\"WgIAq9\"><strong>This, to me, is the heart of it. Maybe I’ll ask this question a little bit more specifically — maybe a little bit more controversially. It seems like when we are talking about diversity for tech companies in particular, we are almost exclusively talking about men and women in the gender split, and we are definitely talking about Black people and Latino people. We very rarely talk about South Asian people or Asian people because those groups have managed to succeed in large numbers. </strong></p><p id=\"FXbAaH\"><strong>I’m wondering if you think it’s dangerous to talk about it that way — or is it better to just acknowledge that this is actually the problem?</strong></p><p id=\"sNEdj4\">No, I like to call a thing a thing, so I have no problem saying that what we’re actively talking about is representational diversity for primarily the most marginalized groups that this nation has seen, period. It’s a group of people where you essentially annexed half of the country by taking their land, and it’s another group that you enslaved them to essentially kickstart this whole thing. To me, I’m totally fine calling a thing a thing, but I think that there are nuances even within that.</p><p id=\"3tzpFl\">When people talk about Black [people] in tech, I can’t give you an actual breakdown of that, but the majority of people who are Black in tech are not Black American descendants of slaves. They are first- and second-generation West Africans for the most part, and some East Africans as well, but that is going to make up the bulk of your Black in tech. It’s not people that are necessarily like me. That isn’t to say that that is bad or it’s wrong, but I think that there is just a different culture in terms of assimilation and access and what it is that they’re able to do that some of us may not be able to do. I think that there is a ton of cultural nuance that is set around that.</p><p id=\"x7BSgy\"><strong>I think that my question is really two thoughts at once: how do you balance all of those tensions and come out with something that lets you evaluate the company you’re going into as someone seeking a job? I think we have lots of people who want to be managers listening to this or who are already managers and executives: how do you make those decisions fairly without raising those red flags?</strong></p><p id=\"XqnZdU\">I wouldn’t get super granular on something like that. I think the answer, to your point, is: yes, we want to understand gender, if someone is nonbinary, we want to understand all of those things. I would say if you’re coming down to basics, it’s race, gender — I would throw age in there because, particularly if we’re talking about tech, it’s like once you hit 38ish, people start side-eyeing you like, move along grandma.</p><p id=\"69tHT6\"><strong>I’m out.</strong></p><div class=\"c-float-left c-float-hang\"><aside id=\"d9WpSx\"><q>“Once you hit 38ish, people start side-eyeing you like, move along grandma.”</q></aside></div><p id=\"DPs836\">Right. I would look at that as well because tech is always thought of as a young person’s industry, and it’s like, once you hit 38, 39, people really say things like, “Can they really innovate, though?” The answer is yes. I would say sexual orientation if people feel comfortable disclosing that. Those, to me, are the basics.</p><p id=\"AL7HXX\">If people want to talk about their country of origin, I would maybe take it a layer there and then be done. Because I think once you start slicing and dicing, it does begin to feel like a tit for tat. There are some intraracial conversations that go on about this.</p><p id=\"cXL9uJ\">I’ve had this conversation a ton of times in terms of Black in tech — what does that actually mean? If we’re talking about representation, there are some issues of intention around that. These are not Black descendants of slaves who are taking the majority of these roles, so what does that mean in terms of adequate representation of Black in tech? Now how are we defining Black? We can go down this rabbit hole all day long.</p><p id=\"MsUwuY\"><strong>I’m not going down that rabbit hole.</strong></p><p id=\"Qf1A36\">But I’m saying no one should go down that rabbit hole. That’s what I mean. If you’re really trying to just come out with something that is clean and digestible at the end of the day, I would say segment it just to at least race, or to country of origin, where people are comfortable with that, and move on.</p><p id=\"sDYPj1\"><strong>The reason I wanted to spend some time on that is because of the situation in tech. It is not necessarily the situation in other industries, but it is very much the situation in tech that you have, oddly, a number of huge companies led by South Asian men. They have entirely white management layers underneath them, and then they are trying to diversify in lower layers of the stack.</strong></p><p id=\"IKPEwD\"><strong>When I say the stack, I mean customer service and custodial services are easy to diversify. They bundle those numbers together. But you started out by saying you also work in AI, and there’s a lot of those functions that are just going to disappear for a lot of companies over time. How do you see that? That flywheel for decision-makers now is going to get very difficult.</strong></p><p id=\"LblkFB\">There’s a McKinsey report about how AI, automation, and robotics are going to take 5 million jobs from Black Americans by the year 2030. There was a separate one for Latinx, and I think that was around 7 million.</p><p id=\"4mkpjV\">That begs the question: what is the responsibility, if any, of some of these companies to engage and help with job retraining skills, or deciding that you’re going to recruit a different way for different positions, from different places? Does everyone have to go to Stanford or can you take somebody from a coding bootcamp? What is the responsibility of some of these private companies to work with the government, to handle some kind of public-private partnerships in order to guarantee that you’re not going to see a mass windfall of 12 to 15 million people who are basically unemployed — and to a certain extent, maybe deemed unemployable? How do you rectify that and is that the job of the company?</p><p id=\"J7c0bL\">We’re going to have to put some emphasis on finding new and creative ways for people to learn on the job and for companies to embrace that attitude. This is also the nature of tech, too: you see people wear five, six, seven different hats within their lifespan at a company, because that’s just the nature of what the business may need as it evolves.</p><p id=\"fDXO3U\">Why can’t you do that with someone who didn’t go to Georgia Tech but may still want to learn and you afford them the ability to learn on the job? Maybe they spend half of their time doing something that they already know how to do that you may be phasing out, and the other 50 percent of their time training them to do something else that you know that you need — or it may evolve into that direction. There’s going to have to be a reckoning in terms of a more creative way of how you go about finding talent and retaining the talent and training the talent.</p><p id=\"dhQQD9\"><strong>In 2020, the world erupted in protests about the killings of George Floyd, Breonna Taylor, and Ahmaud Arbery. Lots of companies released diversity pledges. </strong></p><p id=\"XduqWn\">Man, I could go on all day about those pledges.</p><p id=\"wnIFQK\"><strong>Tell me about it.</strong></p><p id=\"SWbdPp\">So, that’s great: I pledge that I’m going to work out today and then I’ll self-audit and come back and tell you if I did it. That’s how we’re going to do this. That, to me, that’s basically what they did. “We’re really sorry, Blacks. We’re going to throw some money at some stuff. We’re going to donate to some organizations. We pledge to have a 25 percent diverse workforce by the year 2089” — or whatever year they set. Some were 2025, some were 2030 — “Then we’re going to invest in founders and do more business with diverse suppliers.” All of that sounds great. It’s been a year and a half. I would like to actually see what some of these companies have done. I know that <a href=\"https://www.fastcompany.com/90644593/1-year-3-8-billion-later-how-2020s-race-reckoning-shook-up-big-tech\">Fast Company did a report</a> on that last summer based on some of the things that some of the companies reported out. What’s interesting to me is that a lot of those pledges were threefold: employees, suppliers, and community engagement — meaning donations. Some of those companies only reported on one. </p><p id=\"AplONR\">What happened to the other two? Have you made any progress on those? Have you even started? My issue with the pledges is particularly around the self-audit function of this. That’s how this dovetails. If you’re going to tell me, “This is what I pledge to do, but I’m going to self-audit and then come back and tell you what I did. No one from the outside needs to come in and see this. I’m just going to tell you what I did.” That means you’re going to cherry pick and give me the things that make you look good and you’re going to ignore the things that either you haven’t started or haven’t completed, or didn’t turn out the way that you wanted them to.</p><p id=\"cTgkwC\">To me, that’s an incomplete picture, and again, that makes no sense to me. In order to authentically and accurately say that this is the progress that you made, if any, you need to have outside auditors come in and assess this.</p><p id=\"PVUV4M\">I’m just not certain. I have high hopes, but I’m also curious who’s handling all of this work. Who’s handling all of these pledges? Is that something that the diversity team at these companies is tasked with? And if so, is this in addition to the stuff that they’re already supposed to be working on? So who’s actively managing this?</p><p id=\"2L1hME\"><strong>But you don’t see a connection. To me, they all made the pledges and yep, they’re all self-auditing, which is very good. But it just seems like the opportunity of: “Boy, we can distribute our workforce. We can retain people who feel unhappy in this office by letting them move wherever they want, and we can start recruiting in different areas.” Atlanta has a burgeoning tech scene. “We can invest in Atlanta and say we can recruit here and you can work here. You don’t have to move to our spaceship campus in California.” </strong></p><p id=\"xx2XD2\"><strong>I just don’t see the connection between the two. It doesn’t seem like they’ve taken the easiest possible answer, which is everybody is working remotely. You can support a more remote workforce in this country and that can really help your diversity problem.</strong></p><p id=\"vnf8sG\">I think that’s definitely the answer, but people just haven’t embraced it yet. Part of it though is just practical in the sense of real estate: If you’re Google and Facebook and Apple, you didn’t spend all of that on all of these buildings for people to not be in them. Just from a practical standpoint, I completely agree with you that I don’t think the majority of people want to go back to an office — at least not five days a week, but maybe two or three. To some extent, there’s no way for these companies to let go of these buildings, and in order to justify retaining them, you have to fill them. What I’ve seen so far with some of these companies is that some of the positions are allowed to remain remote and some have to be in-office.</p><p id=\"IXsr69\">That’s probably what you’re going to see continue to happen, but it’s an interesting spot for them to be in, particularly if you think about it from Facebook’s standpoint. They bought up a ton of land and buildings surrounding — they had the first main campus, which was the old Sun Microsystems campus. Then they branched out with Building 20 across the street. Then they kept going further and further down the blocks into East Palo Alto, so now you also have a gentrification narrative: all these people got pushed out and left for buildings that are sitting empty. That’s not the story that I think anybody wants to tell, so my guess is that some people are going to have to come back.</p><p id=\"9zXOHc\"><strong>We were just talking about Google, Facebook, Apple wanting to keep people in their office, but these companies are almost like a gradient, right? You can start at the bottom levels, and maybe they’re a little more diverse there, and then you just slowly look towards the top of a company, and it’s more and more white. Why do you think that is?</strong></p><p id=\"4KdDdo\">I would say it’s twofold. You have one issue around access to networks. The ot</p><div class=\"c-float-right c-float-hang\"><aside id=\"SV3Psc\"><q>“Pure microaggression Olympic burnout”</q></aside></div><p id=\"JVj4Tx\">her part with access to a network: do you have a sponsor? That gets lost in the shuffle for a good number of people — you may have a mentor, but a mentor and a sponsor are two different things.</p><p id=\"drylkg\">A sponsor is somebody that’s going to talk you up and give you props in rooms where you’re not there. Rooms that you may not even know exist. People don’t tend to have that — I would even say Black women in particular don’t have that.</p><p id=\"HeVrR9\">That’s the other thing too: there’s some level of uncomfortability with not wanting to sponsor or even mentor someone who does not remind you of yourself. That was actually the thing that stuck with me during  an unnamed VC’s — I don’t know, it was like a Black history event two or three years ago. Someone had mentioned one of the panelists that said something along the lines of, “Yeah, I love to mentor people who remind me of myself.” </p><p id=\"bowafL\"><strong>That’s a classic.</strong></p><p id=\"Llgx53\">I was like, “Tell me how big your ego is without telling me how big your ego is.” It’s one of those things where if you don’t have that proper training — for lack of a better word — and someone who is willing to talk about you in rooms when you’re not there, or invite you to rooms that you haven’t been invited in, it’s very hard to get through that. That’s a different glass ceiling of its own. It’s very hard to get through that. That’s why you see people leave.</p><p id=\"noVBAT\">Another aspect to this is just pure microaggression Olympic burnout. There’s only so many, “Teach me how to dougie!”s you can hear in a day. You know what I mean? I don’t want to talk about that. Please don’t touch my hair. Why are you asking me about affirmative action when I came to talk to you about indemnification? Just all kinds of randomness.</p><p id=\"CKCsPF\"><strong>So that microaggression Olympics that you’re talking about — I think a lot of people listening to this are going to be rightfully skeptical that that adds up enough compared to the opportunities. If you’re in the door at Google, maybe you just put up with it. Are you saying that it actually burns people out — like completely out of the industry?</strong></p><p id=\"3s5mHH\">I know it could definitely burn you out from a company. It may not burn you out of the industry, but it will burn you out of a company. That is also where your retention problem comes from: a lot of these companies are not actively dealing with the source of the problem. Instead, their suggestion is, “Well, why don’t you move to a different department?” Or, “Why don’t you try a different role on a different team?” It’s like, “Well, why don’t you just deal with him, who’s been saying these things to people? How about just do that?” That’s the other thing — when you’re talking about retention of Black talent, there’s also this attitude of, “You should just be happy to be here.”</p><p id=\"7DVXB0\"><strong>Yeah, that’s what I’m pointing at. </strong></p><p id=\"uKgYzE\">Yeah. It’s like, “I should be able to talk to you however I feel and do whatever I want, and you should just accept it and assume good intent.” Well, I’m not going to assume good intent if you keep doing that at least four times a week. If you do that four times a week for years, there’s no good intent left. That good intent was dead in the water after week number two at best. That will burn you out of a particular company. </p><p id=\"0Z4QuD\">The answer is not to move the person who is the victim. The answer is to get rid of the problem or to have a conversation with the person who is the problem. Instead, what happens is that a lot of these [marginalized] employees are made to feel as though they are the problem — like I’m just supposed to let you talk to me however you want and that’s going to be okay. That’s why I really respected the two Black women at Pinterest who had been harassed enough to the extent where they just were like, “We just want to go.” And they did. </p><p id=\"4imIQr\">They had death threats. A private investigator was hired to investigate them. It was nuts — and all because they dared to complain that they weren’t being treated equitably. Their careers were stalled. The whole thing of even getting a private investigator to investigate your employees who made a complaint against you is bananas to me. They decided that they were going to go out in a blaze of glory. “Sure, we’ll sign whatever you tell us to sign, just so we can go, Pinterest. Great. Okay. Also, we’re going to tweet about it and we don’t care, so if you want to use your clawback clause in that, then get your money back, sure, but now everybody knows how you treat people.”</p><p id=\"k5No6A\"><strong>That led to this </strong><a href=\"https://www.theverge.com/22715649/california-silenced-no-more-act-law-newsom-leyva-ndas-whistleblower\"><strong>Silenced No More Act in California</strong></a><strong>. Prior to that, it was common for companies to require employees to sign NDAs in order to get severance, which prevented them from speaking out against harassment or racial discrimination. The Silenced No More Act changed that, right?</strong></p><p id=\"heKrJl\">Yes, and one of [the Pinterest employees] helped write it. Just in case anyone listening has any ideas, that is not retroactive. It is only good from January 1st of this year.</p><p id=\"dMquTR\"><strong>I want to talk about the shift to remote work. You and I are both remote. We are not in offices. That is a huge trend: people don’t want to go back to the office. Even in terms of our labor coverage of big companies, the reason a lot of it started was companies like Google and Apple saying, “You’ve got to come back.” People don’t want to.</strong></p><p id=\"pYjoIv\"><strong>Once you have a remote workforce, it seems you can cut down a lot on that managerial microaggression burnout and just say, “Here’s the work I need you to deliver.” You can actually diversify your workforce pretty quickly across the whole country, as opposed to sourcing from just one part of California. Is that playing out?</strong></p><p id=\"75IyeO\">I haven’t necessarily seen results or stats on it yet, but I do agree with you. The managerial aspect of that can go both ways: if people are using a hybrid model, what happens to the people that are remote and are in these other locations? If I’m a Black engineer who wants to stay in Atlanta, and I don’t want to come back to San Francisco, what does that mean for the people that are engaging in a hybrid model that you can actively see and engage with on a day-to-day basis? Is that person going to have more career trajectory possibilities than I would, even if we’re both doing the same level of work and the same caliber of work? </p><p id=\"9bojN7\">The other thing that is interesting about this is your excuses for hiring diverse candidates are out the window if they’re not required to move. If you want to hire a woman software engineer in Columbus, Ohio, awesome, but is that woman in Columbus, Ohio — doing the same work as a woman engineer in San Francisco — are they being paid the same? That’s another kind of rub that I don’t think people have necessarily worked out yet: are you paying for the role or are you paying for the location? </p><p id=\"cDz9Ph\">The reason why that is interesting is that diverse populations — women, differently abled, racial and ethnic minorities, LGBTQ — all of those groups are historically underpaid. Now let’s say you put one of them in Canton, Ohio. If you’re paying them Canton, Ohio, rates, and it’s a woman and she’s already technically underpaid, you’re just exacerbating that. There are other things that these companies need to be mindful of when they are hiring these folks, that there’s some kind of baseline that they’re setting in terms of making sure that it’s equitable.</p><p id=\"nV3Abx\"><strong>Yeah. You’ve given us so much time. This has been a really fun conversation. Let me ask you one wrap-up question with an eye to the future. We’ve been in the middle of a two-year racial reckoning in America: we’ve seen it ebb and flow. We’ve seen it turn into debates about critical race theory in kindergartens. It’s gotten a little out of hand. Do you think it’s getting better and more sophisticated? A lot of people are talking about it regardless. Maybe they’re talking about it from a wrong or misinformed perspective, but there’s a level of conversation that is happening now that has certainly never happened before in my lifetime. Is that going to help? Is that going to improve things? Will it become easier for people to talk about diversity more openly when before it was kind of tucked away?</strong></p><p id=\"vSvTtC\">I will say: I think the transition for how all of this started to go happened on election night in 2016, and I think the result of that election was born out of some folks really tired of the diversity that they saw in an administration and in a White House that they probably never thought they’d see — I never thought I would see it in my lifetime, so I was very pleasantly surprised. </p><p id=\"Dz0zau\">But then the pendulum swung all the way back and let all the people out and everyone felt emboldened to say whatever it is that they wanted to say at that point, and they’re still doing it, so I think the conversations are easier to have in terms of initiation, but I do not think they are easier in terms of actually reaching people and to get them to listen or have them be amenable to changing people’s minds.</p><p id=\"J5w1EB\">I think the reason why is that the Trump presidency allowed people to say all of the quiet parts out loud now. I could share screenshots of the emails that I get that have called me all kinds of interesting things — some with their names attached, and some not. People just feel emboldened to say whatever it is that they want. I understand that, but it is not necessarily useful discourse so much as it feels like it’s screaming into the void.</p><p id=\"cn5XXq\"><strong>Yeah. This was great. I could keep talking about this with you forever. I’m glad you’re doing the work. It was great talking to you. Thank you, Bärí.</strong></p><p id=\"rBmaYk\">Likewise. Have a good one.</p><aside id=\"bSa2NV\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Decoder with Nilay Patel\",\"description\":\"A podcast from The Verge about big ideas and other problems.\",\"label\":\"Subscribe now!\",\"url\":\"https://podcasts.apple.com/us/podcast/decoder-with-nilay-patel/id1011668648?i=1000496212371\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/0hzVLgHn67WABwOjNpnIEhshenc=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23241160/VRG_ILLO_Decoder_Bari_Williams_s.jpg",
  "description": "There are only four Black CEOs in the Fortune 500 and even fewer Black head coaches in the NFL. The NFL and tech are connected through their lack of diversity.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}