{
  "title": "What would you do with this cool DIY haptic knob?",
  "url": "https://www.theverge.com/2022/4/14/23025948/diy-smart-knob-smartknob-view-haptic-feedback-dreams",
  "date": "2022-04-14T23:24:35.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TO4412euete8NPFDnoyvwbwJP9o=/0x0:2406x1604/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70751008/Screen_Shot_2022_04_14_at_14.53.19.0.png\" />        <figcaption><em>It twists, taps, and turns.</em> | Image: Scott Bezek</figcaption>    </figure>  <p id=\"tEri9S\">Sometimes you come across a DIY project and immediately start figuring out ways you could use it in your life. That’s what happened to us here at <em>The Verge</em> when someone dropped <a href=\"https://www.youtube.com/watch?v=ip641WmY4pA\">the SmartKnob View</a>, a proof-of-concept project by engineer Scott Bezek, into our Slack chat. While it doesn’t seem like it’s the type of project most people could go out and build themselves at the moment (more on that later), it’s easy to imagine a future where it’s available as a kit, or where somebody turns it into an actual product.</p><p id=\"YZPxEH\">The smart knob kind of looks like <a href=\"https://www.theverge.com/2020/10/12/21511951/google-nest-smart-thermostat-new-design-lower-price-specs-features\">a mini Nest Thermostat</a>, but Bezek’s programmed it to have loads of modes. Of course, it can just act as a spinning dial, but you could also program its motor to provide haptic feedback and resistance, giving you the feeling of reaching an endpoint where the dial can’t turn anymore. Because this illusion is created through software instead of hardware, there’s a lot you can do. It can act as a turnable on-off switch, snap back to the center after you turn and release it, and even simulate ratcheted steps.</p><div id=\"6MX6kE\"><div ><iframe src=\"https://www.youtube.com/embed/ip641WmY4pA?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"vsJTt4\">When my colleagues and I heard about the knob, one <em>Verge </em>staffer immediately suggested it’d be great for controlling shower temperature; another said they’d use it as a fancy scroll wheel or volume control. Personally, I thought it’d be a great way to dial in how much food <a href=\"https://www.theverge.com/22995069/pet-tech-dogs-cats-gps\">my cat feeder</a> dispenses.</p><p id=\"51gbzy\">According to Bezek’s <a href=\"https://github.com/scottbez1/smartknob\">GitHub page for the smart knob</a>, the device (which has a far-from-finished design) can be built for “certainly less than $200 in parts.” The page also includes the code for the project, as well as an absolute wealth of information on how the knob is put together and which parts it uses. Bezek <a href=\"https://twitter.com/scottbez1/status/1502335685918814212?s=20&amp;t=ppoB880RV1DHyHtsY-sUwA\">also said on Twitter</a> that he’d make a video detailing the assembly and design process for his SmartKnob.</p><p id=\"SIVpN8\">Unfortunately, we’ll probably have to put our dreams of knob-controlled home automation on hold for now. In the project’s FAQ, Bezek writes that he’s “only implemented enough firmware for the demo shown in the video,” and that the knob can’t actually be used to control much of anything right now. It’d also be a struggle to get parts — Bezek writes that “as a result of the popularity of this project, it seems like the recommended motors are unfortunately no longer available for purchase.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ljgnVFYKNg7TAztIJUxEt9kARAY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23390897/explodedv145.gif\">      <cite>Image: Scott Bezek</cite>      <figcaption><em>Yes, the knob has USB-C.</em></figcaption>  </figure><p id=\"cLCRZx\">Even with just barebones firmware, though, and I still kind of want to build one and use it as the ultimate fidget toy. Perhaps by the time he’s nailed down a design and the parts are available, I’ll be able to build up my skills to the point where I could tackle the advanced soldering techniques needed to actually make the smart knob.</p><p id=\"fwuUW9\">Bezek admits that the knob is “not yet a mature plug-and-play project,” but he does say that he’s going to keep working on it, and even has a roadmap of sorts on his GitHub page. I’m hoping he succeeds at turning this into a real thing that’s practical to make yourself — I want a future where I can build an army of knobs to control everything in my house. TV volume needs to be adjusted? Knob. Want to turn off my camera and end a Zoom call with a flick, instead of <a href=\"https://www.theverge.com/22974570/elgato-stream-deck-mini-zoom-video-call-controls-work-from-home\">a button press</a>? Knob. Need to stop procrastinating on writing an article? I can’t think of how I’m going to solve that with a knob yet, but I assure you I’ll figure it out. </p><p id=\"jJIXeS\">What would you use a smart knob for?</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MpKjBD9NP8nlZUj0BCVytMnwrJw=/0x40:2880x1548/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390826/Screen_Shot_2022_04_14_at_14.53.19.png",
  "description": "More haptic feedback on knobs, please.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}