{
  "title": "What does Russia’s invasion of Ukraine mean for Chernobyl?",
  "url": "https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste",
  "date": "2022-02-25T01:00:42.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"UKRAINE-RUSSIA-CONFLICT-DEFENCE\" src=\"https://cdn.vox-cdn.com/thumbor/dFSjY62__ywVV-rMIQu18hQ6-dw=/6x0:5891x3923/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70547309/1238183624.0.jpg\" />        <figcaption>&nbsp;Servicemen take part in a joint tactical and special exercises of the Ukrainian Ministry of Internal Affairs, the Ukrainian National Guard and Ministry Emergency in a ghost city of Pripyat, near Chernobyl Nuclear Power Plant on February 4, 2022.&nbsp; | Photo by SERGEI SUPINSKY/AFP via Getty Images</figcaption>    </figure>  <p id=\"WxlD34\">Conflict between Ukrainian and Russian forces near Chernobyl raised fears that the site of the worst nuclear accident in history might be disturbed. The site still contains radioactive debris, which the world has worked to contain in the 36 years since the disaster.</p><p id=\"F36ra9\">Russian troops seized the nuclear power plant today, according to scattered reports from officials, including Ukrainian presidential advisor Mykhailo Podolyak. </p><p id=\"ibN90T\">“It is impossible to say the Chernobyl nuclear power plant is safe after a totally pointless attack by the Russians ... This is one of the most serious threats in Europe today,” Podolyak said, according to <a href=\"https://www.reuters.com/world/europe/putin-orders-military-operations-ukraine-demands-kyiv-forces-surrender-2022-02-24/\"><em>Reuters</em></a>. The International Atomic Energy Agency, however, said in a <a href=\"https://www.iaea.org/newscenter/pressreleases/iaea-director-general-statement-on-the-situation-in-ukraine\">statement</a> that the Ukraine regulatory body reported “no casualties nor destruction at the industrial site.”</p><div class=\"c-float-right\"><aside id=\"oxNn91\"><q> Ongoing conflict in Ukraine makes this already sensitive location even more difficult to manage</q></aside></div><p id=\"76NLFE\"><em>The Verge</em> spoke with experts on nuclear policy and the Chernobyl disaster about what we might be able to expect out of this rapidly changing situation. A worst-case scenario is unlikely, but ongoing conflict in Ukraine makes this already sensitive location even more difficult to manage.</p><p id=\"zyFQSE\">The 200 metric ton elephant in the room is the “highly radioactive material” still held in the remains of the reactor that exploded at the Chernobyl nuclear power plant in 1986, according to the trade group <a href=\"https://world-nuclear.org/information-library/safety-and-security/safety-of-plants/chernobyl-accident.aspx\">World Nuclear Association</a>. That reactor failed catastrophically during a test run — releasing radioactive particles in the ensuing explosion and fire. About 50 people died in the following two decades as a direct result of the incident, according to a <a href=\"https://www.un.org/press/en/2005/dev2539.doc.htm\">2005 United Nations report</a>, and tens of thousands more people might have been <a href=\"https://news.mit.edu/2019/chernobyl-manual-for-survival-book-0306\">affected</a> by the radiation.</p><p id=\"EPZp6G\">To try to keep radioactive material from spreading, a “sarcophagus” was quickly built afterwards to entomb the reactor’s remains. Nearly a decade later, officials decided to construct a more secure cover for it — a <a href=\"https://www.theverge.com/2014/5/8/5694698/what-does-ukraine-russia-crisis-mean-for-chernobyl-cleanup\">gigantic steel New Safe Confinement Arch</a> that was just completed in 2017 at a cost of $1.7 billion. That structure is also supposed to facilitate cleanup; workers can remotely operate a crane and other equipment inside to dismantle the rest of the the reactor and remove radioactive fuel.</p><p id=\"p1wkEa\">If that structure gets damaged and there are explosions inside it, it could stir up remaining radioactive material that might release radioactive emissions according to James Acton, a physicist and co-director of the Nuclear Policy Program at the Carnegie Endowment for International Peace. But that would take a a direct hit — either on accident or through a concentrated effort to damage the containment unit which was designed to withstand a <a href=\"https://www.dw.com/en/a-new-cover-for-the-chernobyl-sarcophagus/a-36567348\">tornado</a>.</p>  <figure class=\"e-image\">        <img alt=\"UKRAINE-CHERNOBYL-ANNIVERSARY\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tClFVCciCKy5StOvBPPo0risEkg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269310/1232301312.jpg\">      <cite>Photo by SERGEI SUPINSKY/AFP via Getty Images</cite>      <figcaption><em>A picture taken on April 13, 2021 shows the giant protective dome built over the sarcophagus covering the destroyed fourth reactor of the Chernobyl Nuclear Power Plant ahead of the upcoming 35th anniversary of the Chernobyl nuclear disaster.</em></figcaption>  </figure><p id=\"ubNGRQ\">A bigger concern is spent fuel from three other decommissioned reactors at Chernobyl that continued operating for years after the 1986 disaster, according to Acton and retired nuclear scientist Cheryl Rofer. Used fuel from those reactors is more radioactive than what’s been sequestered inside the giant confinement arch since it’s been more recently removed from the reactors. It was transferred to nearby cooling ponds for interim safekeeping. To date, Acton says, there has never been a serious accident involving spent fuel anywhere. But if something happened to cause the less protected cooling pools to sustain damage and drain out, the remaining fuel could melt and release radioactive gases and particles. </p><p id=\"mTbFJy\">Some of that spent fuel has already been <a href=\"https://www.nucnet.org/news/first-spent-nuclear-fuel-canister-loaded-in-isf-2-storage-facility-11-4-2020\">transferred</a> to a newer and more permanent dry storage facility completed in 2020. More of it is supposed to move over in the next several years. Dry storage facilities don’t require water cooling, and steel or cement casks inside house materials that have already had some time to cool off in wet pools. </p><div class=\"c-float-right\"><aside id=\"nYeLRV\"><q>A bigger concern is spent fuel from three other decommissioned reactors</q></aside></div><p id=\"4UcTzb\">“Those casks are not designed to withstand attacks, but nonetheless, they are extremely strong and robust,” Acton says. Nevertheless, if they’re broken, they can release radioactive material.</p><p id=\"vz7EZZ\">Acton is clear that such “doomsday” scenarios are very unlikely to unfold. “Not least because the Russians have no conceivable reason to want to attack the reactor,” he tells <em>The Verge. </em>It would be risky for the entire region, especially for Russian ally Belarus that borders Chernobyl. In an accidental strike, it would still be unlikely that the cooling pools or casks would be catastrophically damaged. Even then, there would be some time to react — potentially dousing the exposed fuel with water to keep it cool. </p><p id=\"0t30xV\">On top of that, much of the area surrounding Chernobyl is desolate, with very few people who might be affected by any smaller-scale event. The region was evacuated in the wake of the 1986 disaster and remains a cordoned off Exclusion Zone. </p>  <figure class=\"e-image\">        <img alt=\"Tour To Chornobyl Exclusion Zone\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/x7xTqE3YwxnBJJ-drpZgyPh876A=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23269323/1192405627.jpg\">      <cite>Photo by Maxym Marusenko/NurPhoto via Getty Images</cite>      <figcaption><em>Abandoned amusement park in ghost town Prypiat in Chornobyl exclusion zone. Ukraine, December 2019</em></figcaption>  </figure><p id=\"bsMdht\">There is still radioactive material in the debris, soil, and leaf litter around the power plant. Rofer says that radioactive material has decayed to the point where it’s not immediately dangerous — although it could potentially still be carcinogenic to people with enough exposure.</p><p id=\"1Q6FAP\">That worries Kate Brown, MIT distinguished professor in history of science. Disturbances, human or natural, defy the purpose of the containment zone, which was engineered to keep people away from the area’s radioactivity. </p><p id=\"mye8Qh\">In 2020, smoke from fires that ripped through the Chernobyl Exclusion Zone carried slightly radioactive particles across parts of East and Central Europe. The doses from those fires were “radiologically insignificant and no health impact on the European population is expected,” according to an article published that year in the journal <a href=\"https://www.nature.com/articles/s41598-020-67620-3\"><em>Nature</em></a>. But Brown remains concerned about future fires and other disturbances that could spread radioactivity outside the exclusion zone. </p><p id=\"Hgz6HQ\">“It’s a continuing problem,” Brown tells <em>The Verge.</em> “It’s supposed to be contained. It’s supposed to be left untouched. And that’s that’s the problem with any kind of nuclear site. It demands stability and peace.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ke-ZbVbYhOMIyPNAqnzPcJyITd4=/0x419:5896x3506/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23269194/1238183624.jpg",
  "description": "Experts weigh in on potential risks",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}