{
  "title": "WhatsApp seems to be working on multi-phone and tablet chatting",
  "url": "https://www.theverge.com/2022/4/28/23047475/whatsapp-multi-device-phones-tablets-desktops-beta-development",
  "date": "2022-04-29T01:26:44.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Dy3cyTIZbrUjTtG8CEkvMTsPN74=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70807844/acastro_210119_1777_whatsapp_0003.0.jpg\" />        <figcaption><em>You’ve been able to link your account to multiple computers for a while.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"pFuQuv\">WhatsApp seems to be working on a feature that would let users chat with the same account on multiple phones, or on a phone and a tablet, according to a <a href=\"https://wabetainfo.com/whatsapp-beta-for-android-2-22-10-13-whats-new/\">screen found in a beta version of the app</a> by the site <em>WABetaInfo. </em>The screen gives instructions for registering the device you’re using as a “companion” by scanning a code with your main phone — though currently there doesn’t appear to be an actual code to scan.</p><p id=\"lScfww\">A screen <a href=\"https://www.androidpolice.com/2021/09/27/whatsapps-working-on-a-big-improvement-to-multi-device-support/\">found in a previous beta</a> showed that devices could be getting the ability to sync recent messages, even though they’re end-to-end encrypted. That screen, combined with the “Register Device as Companion” screen that instructs users on how to use WhatsApp on another device, adds up to compelling evidence that this feature is in the works.</p><div class=\"c-float-right\"><aside id=\"QAWqd7\"><q>WhatsApp users can already link a phone and a computer</q></aside></div><p id=\"jaS4qf\">Both screens have been found in the Android version of the app, which implies that the feature will support chatting on a secondary phone or tablet. At the moment it’s unclear if the feature will also be available on iOS if and when it launches, though there is precedent indicating it will. WhatsApp technically supports using your account on multiple devices already, via <a href=\"https://faq.whatsapp.com/general/download-and-installation/about-linked-devices/?lang=en\">the Linked Devices feature</a>, which currently only supports using computers as secondary devices. The feature is available on both iOS and Android.</p><p id=\"TZffKx\">WhatsApp <a href=\"https://www.macrumors.com/2021/11/08/whatsapp-multi-device-rollout-ios-android/\">rolled out Linked Devices as a public beta in November 2021</a>, and has <a href=\"https://www.androidpolice.com/how-to-use-whatsapp-multiple-devices-explainer/\">improved on it since then</a> (though there are still <a href=\"https://faq.whatsapp.com/general/download-and-installation/about-linked-devices/?lang=en\">a few unsupported features</a>, depending on what your main device is). But while Linked Devices is handy for desktop users, it doesn’t do much for those with secondary smartphones or tablets. Meta, WhatsApp’s parent company, didn’t immediately respond to <em>The Verge</em>’s request for further details on its plans to expand the Linked Devices feature to support mobile devices as well. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/MD0eT-m-uto-M_MHFTRUrF_FHDk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22245551/acastro_210119_1777_whatsapp_0003.jpg",
  "description": "A long-awaited feature.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}