{
  "title": "What does the future of abortion look like?",
  "url": "https://www.theverge.com/2022/5/5/23058316/roe-v-wade-repeal-future-of-abortion-pills-mifepristone-misoprostol",
  "date": "2022-05-05T18:00:33.000Z",
  "author": "Lux Alptraum",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/isorvey6z-lOnNNqDnT4QUypArE=/0x19:2040x1379/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70836400/VRG_Illo_5193_K_Radtke_Misoprostol.0.gif\" />        <figcaption>Kristen Radtke / The Verge; Getty Images</figcaption>    </figure>  <p>The danger for many people isn’t medical — it’s legal</p> <p class=\"p--has-dropcap\" id=\"jM6W6W\">After nearly 50 years of relative stability, the future of abortion in America is suddenly very uncertain. </p><p id=\"Vwj2Un\">On Monday night, a leaked draft opinion showed the Supreme Court is preparing to overturn <em>Roe v. Wade</em>, the 1973 decision that secured the right for people to terminate their pregnancies across the United States. In a matter of months, many common abortion procedures could become illegal in the 22 states that have passed laws in anticipation of such a ruling. Even in states without those laws, access will likely grow more precarious as state legislatures respond. The new laws won’t stop abortions from happening; instead, they’ll force them underground, adding legal and medical risks to what was once a safe and standardized procedure.</p><p id=\"QiN628\">But while criminalizing abortion will have dire consequences, it doesn’t necessarily mean a return to the dangers of 50 years ago. New pharmaceuticals have made surgical abortion less necessary, and new resources have sprung up to help people obtain and self-administer those drugs. It’s not the same experience as what you would get from Planned Parenthood or other medical providers, but it’s a far cry from the worst-case-scenario options of pre-Roe America. Instead, it’s a new kind of digital underground, with providers, volunteers, and pregnant people all taking calculated risks to stay safe in the chaotic new system.</p><p id=\"TYJA6e\">“The future of abortion is increased knowledge about abortion pills,” says Susan Yanow, the US spokesperson for Women Help Women, an abortion access organization. “Abortion will not stop and those of us who support the right to bodily autonomy will continue to work to put these pills into the hands of those who need them.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"tLLrdb\"><q>“The future of abortion is increased knowledge about abortion pills.”</q></aside></div><p id=\"uCjriE\">We can see hints of that system in states where abortion rights have already been heavily restricted. “We’re already in a post-Roe world in places like Texas,” says Elisa Wells, co-founder of <a href=\"https://www.plancpills.org\">Plan C</a>, an online abortion resource, noting that expansive bans like SB 8 have rendered abortion functionally illegal in much of the South. In places where abortion is all but inaccessible, there are some echoes of an earlier era, like well-off abortion seekers heading to “safe” states like New York and California for their procedures. But Texas as well as places outside the US where abortion is currently criminalized don’t look like 1970s America.</p><p id=\"eDY4s0\">These days, most abortions are no longer surgical or necessarily require going to a doctor’s office. Instead, they’re performed with a combination of two drugs: mifepristone and misoprostol. The first pill, mifepristone, blocks the hormone progesterone and stops the pregnancy from developing further. The second pill, misoprostol, triggers contractions that expel the contents of the uterus. Together, these pills are incredibly safe and extremely effective. Misoprostol can also be used on its own, and because it has other uses like treating ulcers and inducing labor, it can be found in places where mifepristone is criminalized — sometimes even over the counter. </p><p id=\"ctjOEs\">Although many people still turn to surgical methods like vacuum aspiration or dilation and curettage (also known as a D&amp;C), abortion with pills (also known as medical abortion or medication abortion) has become an incredibly popular method around the globe. In some European countries, over 90 percent of abortions are performed with pills; in the United States, <a href=\"https://www.guttmacher.org/article/2022/02/medication-abortion-now-accounts-more-half-all-us-abortions\">over half of all abortions performed in 2020 were medication abortions</a>.</p><div class=\"c-float-left c-float-hang\"><aside id=\"5IubZZ\"><q><em>Any</em> underground abortion is far from an ideal scenario</q></aside></div><p id=\"35cVAj\">Unlike surgical abortion, terminating a pregnancy with pills does not require any special skills or the assistance of another person. People can safely take mifepristone and misoprostol all by themselves in the privacy of their own homes. And that has radically upended what it means to have an underground abortion.</p><p id=\"RDRBAt\">While <em>any</em> underground abortion is far from an ideal scenario — people who need abortions shouldn’t have to jump through hoops, and patients should be able to openly speak with their doctors about their reproductive health needs — a self-managed abortion with pills from a covert source isn’t drastically different from a medication abortion using pills from a doctor.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"A woman running by an advertisement for Plan C in the New York City subway.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yN47wcWJKQ-DPnFIJETNH-9FVfw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23440441/Plan_C_16___credit_Hana_Mendel.jpg\">      <cite>Image: Plan C</cite>      <figcaption><em>An advertisement for Plan C in the New York City subway.</em></figcaption>  </figure></div><p id=\"bPG2fe\">Pills aren’t a viable option for everyone who needs an abortion (including people with bleeding disorders, people with IUDs, and people who need abortions late in pregnancy), but for those who can use the method, safely terminating a pregnancy in a place where abortion is illegal doesn’t require finding someone willing and able to perform a safe abortion in secret. It just requires getting pills.</p><p id=\"u9tPrD\">Which brings us to the other thing that’s changed since the 1970s: the internet. As a sprawling, decentralized, and often ungovernable information platform, the internet has made it easier for people to buy drugs, <a href=\"https://www.theverge.com/2020/3/30/21199519/defense-distributed-defcad-3d-printed-gun-library-launch-vetting\">distribute blueprints for 3D printed guns</a>, and even organize insurrections. It’s also made it vastly easier to access both information about safe self-managed abortion — and abortion pills themselves — than would have been possible back in the pre-Roe era. </p><p id=\"6XPg6W\">Over the past few years, as it became clear that Roe’s fate was sealed, an entire infrastructure has been built to help Americans self-manage abortions. <a href=\"http://plancpills.org\">Plan C</a> maintains an extensive database of both telemedicine abortion sites and online pharmacies that ship abortion pills, with information on which services operate in all US states and territories. Websites like <a href=\"https://www.howtouseabortionpill.org\">How to Use Abortion Pill</a> and <a href=\"https://abortionpillinfo.org\">Self-managed Abortion; Safe &amp; Supported</a> (SASS) offer detailed guides on everything people need to know when using pills to terminate a pregnancy without a doctor’s support.</p><p id=\"CrMCjC\">While abortion with pills is vastly easier for people who live in, or can travel to, states that are served by fully legal telemedicine services like <a href=\"https://www.heyjane.co\">HeyJane</a> or <a href=\"https://carafem.org\">Carafem</a>, it’s possible to get abortion pills even in places where it’s illegal. The European site <a href=\"https://aidaccess.org\">AidAccess</a> connects patients in states where abortion is criminalized to Indian pharmacies. Because getting the pills can take several weeks, AidAccess also offers “advance provision” — basically, they’ll provide access to abortion pills before you get pregnant just so you have them on hand. And people are definitely using these sites to navigate a post-Roe world. After abortion was criminalized in Texas this past fall, <a href=\"https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2789428\">AidAccess requests from that state dramatically increased</a>, a significant jump that wasn’t mirrored in other states during the same time period.</p><div><aside id=\"hqIjVD\"><q>You don’t even have to go online to get abortion pills</q></aside></div><p id=\"v2UBjy\">You don’t even have to go online to get abortion pills. Because misoprostol has multiple uses, it’s more readily available than medications that are primarily abortifacients. Doulas have access to it. Doctors can prescribe it off label — <a href=\"https://www.aclu.org/other/mifepristone-ru-486-myths-and-facts\">as they already do when prescribing it as part of a mifepristone-misoprostol combo or when using it to induce labor</a>. In countries like Mexico, it’s available over the counter. If someone is sufficiently motivated (and has access to a lab and knowledge about chemistry), they could even make misoprostol themselves: <a href=\"https://pubchem.ncbi.nlm.nih.gov/compound/5282381\">the chemical structure is readily available online</a>. </p><p id=\"hug4n6\">Even though modern self-managed abortion is <em>physically</em> safe, it still comes with major risks. In an era where pills make safe self-managed abortion an accessible reality, the biggest danger isn’t septic shock: it’s prison.</p><div class=\"c-float-left c-float-hang\"><aside id=\"0YAhap\"><q>“People have been unjustly arrested, prosecuted, or even jailed”</q></aside></div><p id=\"OWma1N\">The legal landscape of self-managed abortion is complicated and confusing. In addition to outright abortion bans, like Texas’ SB 8 and similar laws that have popped up across the South, people have also been prosecuted under fetal endangerment laws or laws that restrict people from practicing medicine without a license — all while <em>Roe v. Wade</em> is still the law of the land. “Even though having an abortion is currently legal in every state in the US, some people have been unjustly arrested, prosecuted, or even jailed for causing their own abortion. Those who assist them have been criminalized as well,” says Melissa Grant, chief operations officer of Carafem operator FemHealth USA. Last month, <a href=\"https://abc13.com/texas-news-lizelle-herrera-murder-charges-dropped-self-induced-abortion/11734455/\">a Texas woman named Lizelle Herrera was jailed for three days</a> after being accused of self-managing an abortion. Although the charges against Herrera were dropped, they’re a chilling warning of things to come. </p><p id=\"bU4hXj\">When people do get pulled into the legal system, it’s often because they went to a doctor in one of the rare cases when a self-managed abortion has complications or is incomplete. Other times, people mention the pills during a check-up, <a href=\"https://www.nytimes.com/2014/09/22/magazine/a-mother-in-jail-for-helping-her-daughter-have-an-abortion.html\">as happened in the case of Jennifer Whalen</a>. “Providers may mistakenly believe that they have mandatory reporting obligations for a self managed abortion, and that is not correct,” says Sara Ainsworth, senior legal and policy director at <a href=\"http://ifwhenhow.org\">If/When/How</a>. “There’s no law that requires people to report self-managed abortion.”</p><p id=\"gChJay\">Additionally, because there’s no way to physically distinguish between a miscarriage and medication abortion, doctors often report people who come in seeking care post-miscarriage simply because they <em>suspect</em> that they’ve had an abortion. Not surprisingly, <a href=\"https://www.nirhealth.org/wp-content/uploads/2017/06/SIA-Exec-Summary-FINAL1.pdf\">it’s the most marginalized — like people of color and low-income people</a> — who are the most likely to be swept up in these criminal cases. </p><p id=\"BhsZ40\">Ainsworth points out that prosecution often occurs even when no law has been broken. States like <a href=\"https://www.abc10.com/article/news/local/california/california-mothers-conviction-fetal-death-overturned/103-7d694daa-5069-4259-a1e2-56c277a1e6e0\">California</a> have also punished people for miscarriages and stillbirths in addition to self-managed abortion. And the more stigmatized abortion becomes, the more likely it is that law enforcement and prosecutors will pursue criminal charges against not just people who’ve self-managed abortions but also people who’ve experienced miscarriage.</p><p id=\"2kmJO6\">In anticipation of this, If/When/How has created the <a href=\"https://www.reprolegalhelpline.org/\">Repro Legal Helpline</a> and <a href=\"http://reprolegaldefensefund.org\">Repro Legal Defense Fund</a>. The first is set up to provide advice on navigating the legal risks of self-managed abortion; the second provides financial assistance for people who’ve been criminalized for the outcome of their pregnancy.</p><p class=\"c-end-para\" id=\"5WmVaa\">Even with these risks, many abortion advocates believe that safe self-managed abortion has the power to keep the “coat hanger” abortion at bay. “<a href=\"https://www.thelancet.com/journals/lanam/article/PIIS2667-193X(22)00017-5/fulltext\">Our research</a> has shown that medication abortion self-managed in this way is safe and as effective as visiting a clinic,” says Abigail Aiken, an associate professor at the LBJ School of Public Affairs at the University of Texas, Austin. “This is such an important option to prevent a return to the unsafe abortions of the pre-Roe era.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/EvgDXlqf5knLfyuBlKf787wQb8Q=/0x165:2040x1233/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23440427/VRG_Illo_5193_K_Radtke_Misoprostol.jpg",
  "description": "For many, safe self-managed abortion is a few clicks away.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}