{
  "title": "What is going on with Elon Musk and Twitter?",
  "url": "https://www.theverge.com/23020401/elon-musk-twitter-board-takeover-agrawal-invest",
  "date": "2022-04-11T15:53:25.000Z",
  "author": "Russell Brandom",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/04h42qKkk5zmWvpkKqQ4Zt_rfN8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70736112/acastro_200715_1777_twitter_0002.0.0.jpg\" />        <figcaption>Illustration by Alex Castro</figcaption>    </figure>  <p>Here’s everything we know</p> <p class=\"p--has-dropcap p-large-text\" id=\"HdCXXk\">It has been a busy week for Elon Musk and Twitter.</p><p id=\"fg5H9K\">Last Tuesday, Elon Musk filed documents showing he had <a href=\"https://www.theverge.com/2022/4/4/23009622/elon-musk-twitter-shares-free-speech\">spent $2.8 billion to take a 9 percent stake in Twitter</a>, becoming the company’s largest individual shareholder. Shortly afterward, Twitter announced he would be <a href=\"https://www.theverge.com/2022/4/5/23012266/elon-musk-sec-twitter-stock-acquisition-13d-tesla\">taking a seat</a> on the company’s board. The stock price jumped more than 20 percent on the news of Musk’s stake, and everyone involved with the company started to ponder how his involvement would change things.</p><p id=\"dMPl8R\"><a href=\"https://www.theverge.com/2022/4/10/23019802/elon-musk-not-joining-twitter-board-announced\">Four days later</a>, the deal for the board seat fell through. In <a href=\"https://twitter.com/paraga/status/1513354622466867201\">an open letter to Twitter staff on Sunday night</a>, Twitter CEO Parag Agrawal shared that Musk had backed out the previous day. There was little explanation for the last-minute shift, but some time between Tuesday and Saturday, whatever arrangement led to Musk joining the board had unraveled.</p><p id=\"xKjDEB\">So, what on earth is going on here? We don’t have an answer for you, but we’ve laid out everything we know about the situation, organized around the five big questions we are still trying to answer. </p><h2 id=\"odnBlM\">Why didn’t Elon join the board?</h2><p id=\"T1jo7T\">It’s weird! Our best view of the situation comes from <a href=\"https://twitter.com/paraga/status/1513354622466867201\">Agrawal’s statement</a> Sunday night, but the statement is purposefully vague, giving few specifics (“Elon shared… that he will no longer be joining the board”) and heavily hinting that there is more to the story (“here’s what I can share about what happened”). </p><div class=\"c-float-right c-float-hang\"><aside id=\"01GcQ7\"><q>“here’s what I can share about what happened”</q></aside></div><p id=\"uEJV5e\">Because Twitter is a publicly traded company, Agrawal was under pressure to make some kind of statement before markets opened on Monday. The news that Musk had joined the board had sent Twitter stock shooting up in value, so any delay in sharing the news that he was leaving could spark insider trading concerns. (Twitter even <a href=\"https://www.sec.gov/Archives/edgar/data/1418091/000119312522101041/d315205d8ka.htm\">made a formal SEC filing</a> to go along with the CEO’s statement, just to be sure everyone got the message.) But Agrawal wasn’t saying any more than he absolutely had to say.</p><p id=\"LWHJxY\">Elon’s side of the story is also murky. The best clue we have is <a href=\"https://www.sec.gov/Archives/edgar/data/0001494730/000110465922044481/tm2212422d1_sc13da.htm\">a parallel SEC filing</a> where he lays out his new obligations as a major shareholder, explicitly saying that he “may express his views to the Board… through social media or other channels.” In short, he’s allowed to keep complaining about Twitter on Twitter, which may have conflicted with his fiduciary duties as a board member. Protocol correspondent Issie Lapowsky flagged a recently fav’d tweet from Musk saying, “Elon became largest shareholder for Free Speech… Elon was told to play nice and not speak freely.”</p><h2 id=\"WRdiHD\">What’s up with the background check?</h2><p id=\"gL8mzT\">In the note, Agrawal says Elon’s initial appointment was “contingent on a background check and formal acceptance.” With no other explanation handy, some observers have read this as a suggestion that the background check turned up some information that disqualified Musk as a board member, which would also explain why everything happened so abruptly and with so little explanation. It’s hard to imagine what the check would have found, but it would have to be something juicy. Maybe Musk is planning to launch a Twitter competitor? Maybe he has Dick Costolo chained up in his basement!</p><div class=\"c-float-left c-float-hang\"><aside id=\"njZftY\"><q>“contingent on a background check”</q></aside></div><p id=\"coyZ8m\">Musk is one of the most closely scrutinized public figures in the world, so it’s hard to imagine anything too wild staying hidden for long — but we did find out he had <a href=\"https://www.vanityfair.com/style/2022/03/grimes-cover-story-on-music-and-mars\">a secret child</a> last month, so anything’s possible.</p><p id=\"s6CZOL\">Or… maybe it’s nothing. The other way to read the line is that Agrawal was trying to address some potential embarrassment around Tuesday’s announcement, which made it seem all but certain that Musk would be on the board in a few days’ time. Emphasizing the background check definitely made it seem like Musk had some deep dark secret, but that’s the kind of subtle political misstep you might expect from a technically oriented CEO who’s only been on the job for six months.</p><h2 id=\"ulzBAM\">What were Twitter employees worried about?</h2><p id=\"Pf32Hh\">It doesn’t seem like Twitter employees were wild about Musk joining the company board, and many of them are breathing a sigh of relief now that he’s gone. One team lead even responded to Agrawal’s tweet <a href=\"https://twitter.com/ruchowdh/status/1513488193282260993\">with a sigh of relief</a>, saying, “I’ve kept quiet since the announcement because I wanted to give Twitter leadership a chance to do right by its employees, and they did. Thank you.”</p><div class=\"c-float-right c-float-hang\"><aside id=\"bTpglr\"><q>“I wanted to give Twitter leadership a chance to do right by its employees”</q></aside></div><p id=\"FkkBWA\">This suggests another interpretation of events, in which Agrawal quietly scuttled the deal once it became clear what a liability Musk would be on the board. Remember Agrawal’s note was originally sent to Twitter employees, and if you read it as efforts to calm an unhappy workforce, the chilly tone makes a lot more sense. This theory has a lot more loose ends than the Musk-centric theories (for one, it’s not clear what Agrawal could do to sink the offer in less than a week), but it’s worth considering.</p><p id=\"5nQoyf\">Many on the American right wing have treated Musk’s board seat as a win for conservatives, a chance to get revenge on the company for banning Donald Trump in 2020 (among other moderation grievances). If rank-and-file Twitter employees took those comments seriously, it’s easy to see why they’d be nervous. </p><p id=\"y3NXu7\">There’s no immediate evidence that Musk bought his stake in the company to settle some kind of culture-war grievance, but that only raises an even larger question…</p><h2 id=\"roJbHS\">What does Elon want from Twitter?</h2><p id=\"8rVQIQ\">This is the core question that’s been building since the news of Elon’s billion-dollar stock buy broke last week. We still don’t really know why Elon bought such a large stake in Twitter or <a href=\"https://www.theverge.com/2022/4/6/23012831/twitter-elon-musk-parag-agrawal-ceo-board-seat-what-next\">what he wants from the company</a>. If he just wanted a say in how Twitter manages its platform, then board membership makes sense. But being a board member also comes with restrictions — there are limitations on how much stock Musk can own and what he can say, springing from a broader duty to act in the best interests of shareholders. If he wanted to muscle the company into a radically different moderation approach, then the restrictions of board membership could have outweighed the benefits.</p><div class=\"c-float-left c-float-hang\"><aside id=\"uraOvs\"><q>We still don’t really know why Elon bought such a large stake in Twitter</q></aside></div><p id=\"9dNYlX\">The question is particularly urgent if Musk simply wants to take over Twitter entirely. Any time a rich person buys a significant stake in a company, there’s always a risk of a hostile takeover — and with Jack Dorsey out and <a href=\"https://www.theverge.com/interface/2020/3/4/21163146/jack-dorsey-activist-investor-paul-singer-elliott-management\">activist investors turning up the heat</a>, Twitter is particularly vulnerable. Musk is no stranger to this kind of financial power play, from <a href=\"https://www.cnbc.com/2021/02/06/tesla-founders-martin-eberhard-marc-tarpenning-on-elon-musk.html\">his contentious relationship with Tesla’s founders</a> to <a href=\"https://www.theverge.com/2016/6/22/12003316/elon-musk-tesla-solar-city-deal-model-3-powerwall\">Tesla’s 2016 acquisition of SolarCity</a>. And in strictly financial terms, he has enough money to buy the company six times over. If he wants to take over, he can probably do it.</p><p id=\"MCjkIn\">There are important material reasons why Musk might not want to do this. He’s already CEO of two companies and in leadership roles at three more. Twitter doesn’t fit with his usual brand of ambitious engineering projects, and it’s not a particularly safe bet financially. Musk’s public statements through the whole affair have been so chaotic that it’s hard to say what his plan is or if he even has one. The same day the board membership fell through, Musk was tweeting that the company headquarters should be converted to a homeless shelter. The next day, he said the company should “delete the w in Twitter.” (Both tweets have since been deleted.) In public, he seems more interested in tweeting than running the company — but it’s hard to be sure.</p><h2 id=\"ufwHzu\">What happens next?</h2><p class=\"c-end-para\" id=\"gSboIy\">Elon isn’t joining Twitter’s board, but with a 9 percent stake in the company, he’s still going to be a massively powerful voice in its future. The fact that he’s not on the board means he’s likely to exercise that power in public, whether through more financial moves or more heated criticism of the company’s choices. As Musk’s ongoing war with the SEC shows, he’s not shy about public statements that will produce wild swings in the value of a company. If he left the last week feeling put out, he’ll have lots of chances to even the score. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/j9doeI17eouZs-YIK4CCrW4nVSg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20086189/acastro_200715_1777_twitter_0002.0.jpg",
  "description": "We have questions.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}