{
  "title": "Where is Fitbit’s Wear OS watch?",
  "url": "https://www.theverge.com/2022/3/25/22996549/fitbit-wear-os-smartwatch-fitness-tracker",
  "date": "2022-03-25T21:05:32.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3c-hDdMs7NidD55Oqwnvco5r378=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70673098/akrales_190903_3635_0018.0.jpg\" />        <figcaption><em>No kidding.</em> | Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"2W69cI\">2022 is going to be a big year for Wear OS. Google’s rumored to be <a href=\"https://www.theverge.com/2021/12/2/22814461/google-pixel-watch-wear-os-2022-rohan\">making its own Pixel Watch</a> (again). Older Wear OS 2 watches are expected to finally <a href=\"https://www.theverge.com/2021/7/22/22588440/google-wear-os-3-update-smartwatch-samsung-2022\">make the transition to Wear OS 3</a>. Samsung’s promised that Google Assistant <em>will</em> be <a href=\"https://www.theverge.com/2022/2/7/22921615/samsung-galaxy-watch-4-wear-os-google-assistant-wearables-smartwatch\">coming to its Galaxy Watch 4</a> in the “coming months.” But there’s something notably missing from this Wear OS lineup: Fitbit.</p><p id=\"ccALR3\">Since Google and Samsung first <a href=\"https://www.theverge.com/2021/5/18/22440483/samsung-smartwatch-google-wearos-tizen-watch\">announced their partnership</a> at last year’s Google I/O, Fitbit CEO James Park hasn’t been coy. He’s said multiple times that a premium Fitbit smartwatch running Wear OS was in the works. This year will be the one where Wear OS 3 debuts on a wider scale. It would’ve been stellar timing to unveil a Wear OS Fitbit. However, a <a href=\"https://9to5google.com/2022/03/25/fitbit-likely-versa-4-sense-2-not-wear-os/\"><em>9to5Google </em>report</a> notes that although code uncovered in the Fitbit app hints at several new products, not a single one will run Wear OS.</p><p id=\"1D3dNO\">Instead, it looks like Fitbit may be planning a Sense 2, a Versa 4, and a Fitbit Luxe 2. The code reportedly makes reference to a “software bridge” that shares data between the device and phone using Bluetooth. According to the report, Wear OS uses a different method of sharing data between your phone and watch — meaning Wear OS watch likely wouldn’t need that so-called bridge. Two of the rumored devices share the same square screen resolution as the Versa 3 and Sense. The other matches the Luxe. That hints at updates to existing product lines rather than creating something new. If true, all this strongly suggests it’s not likely we’ll see a Wear OS 3 Fitbit anytime soon. </p><p id=\"sHgP2Q\">Of course, none of this is official. Things can dramatically change between when a product is in testing and when it actually lands on shelves. It’s just disappointing to see — and for Fitbit, rehashing the same formula isn’t in its best interest.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-ViogBDcBf6g-WRkXfJ2f3N3LaM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23324671/vsong_220317_5089_0005.jpg\">      <cite>Photo by Victoria Song / The Verge</cite>      <figcaption><em>No cheating: Is this a Versa, Versa Lite, Versa 2, or Versa 3?</em></figcaption>  </figure><p id=\"rBTJdB\">In 2014, Fitbit was a leading wearables maker, with nearly 40 percent of the market. According to <a href=\"https://www.statista.com/statistics/515640/quarterly-wearables-shipments-worldwide-market-share-by-vendor/\">Statista</a>, Fitbit’s market share in 2020 had dwindled to a measly 2.9 percent. Every year has seen Fitbit’s piece of the pie get smaller, and smaller, and smaller. There’s no one factor that led Fitbit here, but if I had to pick one, it’d be that Fitbit products have gotten a bit stale.</p><p id=\"bnm3Zq\">In my reviews, I often joke that Fitbit doesn’t like to fix what isn’t broken. You can look at the evolution of its popular Charge fitness trackers to see that in action. If you lined up the <a href=\"https://www.theverge.com/2016/9/28/13078652/fitbit-charge-2-fitness-tracker-review\">Charge 2</a>, <a href=\"https://www.theverge.com/2018/10/17/17984764/fitbit-charge-3-review-fitness-tracker-smartwatch-notifications\">3</a>, and <a href=\"https://www.theverge.com/2020/3/31/21199567/fitbit-charge-4-tracker-gps-nfc-spotify-sp02-announcement-price\">4</a>, I guarantee you most people wouldn’t be able to tell the difference. Similarly, once it became clear that its <a href=\"https://www.theverge.com/2018/3/26/17163210/fitbit-versa-smartwatch-review-wearable-tech-apple-watch\">original Versa smartwatch</a> was popular, Fitbit began pumping out Versas left and right. Again, if you lined up the Versa, Versa 2, Versa Lite Edition, and Versa 3, you’d be hard-pressed to say what was distinctive about each. I reviewed all four of them, and even I’d have to take a second look. </p><p id=\"2oN7xZ\">That’s why it was a breath of fresh air in 2020 when Fitbit lobbed a hail mary of a fall product launch. The <a href=\"https://www.theverge.com/21450123/fitbit-sense-review\">Fitbit Sense </a>introduced FDA-cleared EKGs and added an electrodermal activity sensor — something that no other wearable company had done yet. Google Assistant was added to the Sense and Versa 3. The company also upgraded its Pure Pulse 2.0 heart rate tracking tech, and all around, meaningful updates were to be had. That energy continued into 2021, when Fitbit made the first significant updates to the Charge lineup in years and introduced the fashionable Luxe. </p>  <figure class=\"e-image\">        <img alt=\"The regular Galaxy Watch 4 has a touch-sensitive bezel, which is fiddly.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/i4Vc96wcN6ynBFQfkw4AXX8cQKk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22787999/dbohn_210816_4717_0005.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>The Samsung Galaxy Watch 4 is the only Wear OS 3 watch that’s currently available.</em></figcaption>  </figure><p id=\"iVkH29\">But unless Fitbit has some new sensor it’s been hiding or finally figures out how to add LTE to its trackers, it’s hard to get jazzed over a Sense 2, Versa 4, and Luxe 2. There are so many more affordable Fitbit alternatives these days — and many of them are quite good. </p><p id=\"MCTxIN\">A Fitbit Wear OS smartwatch, however, would give a much-needed boost to the Wear OS ecosystem.</p><p id=\"lVXZHB\">Right now, Wear OS watches are predominantly Fossil Group watches. They are fine. Samsung’s there now, too, with the <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Galaxy Watch 4</a>, and there’s a smattering of luxury brands for absurd prices. Fossil and luxury smartwatches prioritize the aesthetic. Samsung’s Galaxy Watch 4 is actually great but also doesn’t serve non-Samsung phone owners well. </p><div class=\"c-float-right\"><aside id=\"ZLpWZw\"><q>Now would’ve been a great time for Fitbit to bust in like the Kool-Aid man</q></aside></div><p id=\"MVZfZd\">Now would’ve been a great time for Fitbit to bust in like the Kool-Aid man to offer a truly platform-agnostic Wear OS 3 watch. Right now, the only option for that is Mobvoi’s TicWatch 3 lineup — and let’s be real. You’ve probably never heard of Mobvoi, whereas Fitbit is a household name. </p><p id=\"Wp0BZw\">Plus, you can’t discount Fitbit’s vast experience with health data. It’s also got several advanced health features that could ostensibly take on the Apple Watch. Earlier this week, the company announced it had asked the FDA to <a href=\"https://www.theverge.com/2022/3/24/22994324/google-fitbit-heart-monitoring-afib-fda\">clear passive atrial fibrillation monitoring</a>. It was the first to implement SpO2 sensors in 2017, and it’s been hard at work researching sleep apnea. Rolling all of these things into a Wear OS 3 watch would’ve been something to actually be excited about. </p><p id=\"JWtIsF\">A Fitbit Wear OS watch will arrive one day. Hopefully. And so long as it doesn’t crap the bed as hard as the OnePlus Watch, it’ll be great for all the reasons listed. The rumored Pixel Watch will supposedly have some kind of Fitbit integration, but we all know that’s not the same thing. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/G-_m5vLxDI696zwLnjUqE54DM8U=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19168631/akrales_190903_3635_0018.jpg",
  "description": "Rumors suggest another Sense, Versa, and Luxe instead.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}