{
  "title": "Whistleblower says DeepMind waited months to fire a researcher accused of sexual misconduct",
  "url": "https://www.theverge.com/2022/4/4/23003311/deepmind-ai-sexual-misconduct-google-alphabet-fire-researcher-accused",
  "date": "2022-04-05T22:52:17.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/qQ9m6wo93v5Zvljv6vEji0fnrxE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70708954/acastro_180329_1777__brains_science_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"3xZ3c0\">A former employee at DeepMind, the Google-owned AI research lab, accuses the company’s human resources department of intentionally delaying its response to her complaints about sexual misconduct in the workplace, as first <a href=\"https://www.ft.com/content/928c5a91-baaa-41f2-b922-a07c74704e47\">reported by the<em> Financial Times</em></a>.</p><p id=\"S5b4r9\">In an open letter <a href=\"https://medium.com/@concerneddeepminder/open-letter-to-deepminders-and-all-alphabet-employees-96d1a20bdb15\">posted to Medium</a>, the former employee (who goes by Julia to protect her identity) says she was sexually harassed by a senior researcher for months while working at the London-based company. During this time, she was allegedly subject to numerous sexual propositions and inappropriate messages, including some that described past sexual violence against women and threats of self-harm.</p><div class=\"c-float-right\"><aside id=\"47qfav\"><q>“Whether it was 10 months or 7, it was far, far too long.”</q></aside></div><p id=\"oZFBiq\">Julia got in contact with the company’s HR and grievance team as early as August 2019 to outline her interactions with the senior researcher, and she raised a formal complaint in December 2019. The researcher in question reportedly wasn’t dismissed until October 2020. He faced no suspension and was even given a company award while HR was processing Julia’s complaint, leaving Julia fearing for her — and her other female colleagues’ — safety.</p><p id=\"fAXkLo\">Although the <em>Financial Times</em>’ report says her case wasn’t fully resolved until seven months after she first reported the misconduct, Julia told <em>The Verge</em> that the whole process actually took 10 months. She claims DeepMind’s communications team used “semantics” to “push back” on the <em>Financial Times</em>’ story and shorten the amount of time it took to address her case.</p><p id=\"bD8Gpw\">“It was in fact 10 months, they [DeepMind] argued it was ‘only’ 7 because that’s when the appeal finished, though the disciplinary hearing took another 2 months, and involved more rounds of interviews for me,” Julia said. “My point stands: whether it was 10 months or 7, it was far, far too long.”</p><p id=\"IZDYK0\">Besides believing her case was “intentionally dragged out,” Julia also claims two separate HR managers told her she would face “disciplinary action” if she spoke out about it. Her manager allegedly required her to attend meetings with the senior researcher as well, despite being “partially” aware of her report, the <em>Financial Times</em> says. While Julia herself didn’t sign a non-disclosure agreement, many other DeepMind employees have.</p><div class=\"c-float-right\"><aside id=\"OB3YRN\"><q>“These stories are real, they are happening to your colleagues.”</q></aside></div><p id=\"DLQrNq\">In a separate <a href=\"https://medium.com/@concerneddeepminder/equitable-p-c-process-improvements-fa27e72567f\">post on Medium</a>, Julia and others offered several suggestions as to how Alphabet (Google and DeepMind’s parent company) can improve its response to complaints and reported issues, such as doing away with the NDA policy for victims and setting a strict two-month time limit for HR to resolve grievances. </p><p id=\"g5iQAh\">The Alphabet Workers Union also expressed support for Julia in a <a href=\"https://twitter.com/AlphabetWorkers/status/1509047399200698368\">tweet</a>, noting: “The NDAs we sign should never be used to silence victims of harassment or workplace abuse. Alphabet should have a global policy against this.”</p><p id=\"2h0E4I\">In a statement to <em>The Verge</em>, DeepMind interim head of communications Laura Anderson acknowledged the struggles Julia went through but avoided taking accountability for her experiences. “DeepMind takes all allegations of workplace misconduct extremely seriously and we place our employees’ safety at the core of any actions we take,” Anderson said. “The allegations were investigated thoroughly, and the individual who was investigated for misconduct was dismissed without any severance payments... We’re sorry that our former employee experienced what they did and we recognise that they found the process difficult.”</p><p id=\"co8fk7\">DeepMind has faced concerns over its treatment of employees in the past. In 2019, <a href=\"https://www.bloomberg.com/news/articles/2019-08-21/google-deepmind-co-founder-placed-on-leave-from-ai-lab\">a <em>Bloomberg</em> report</a> said DeepMind co-founder Mustafa Suleyman, also known as “Moose,” was placed on administrative leave for the controversy surrounding some of his projects. <a href=\"https://www.theverge.com/2019/12/5/20997225/deepmind-co-founder-mustafa-suleyman-google-ai\">Suleyman left the company later that year to join Google</a>. In 2021, a <a href=\"https://www.wsj.com/articles/artificial-intelligence-will-define-googles-future-for-now-its-a-management-challenge-11611676945\"><em>Wall Street Journal</em> report</a> revealed that Suleyman was deprived of management duties in 2019 for allegedly bullying staff members. Google also launched an investigation into his behavior at the time, but it never made its findings public.</p><p id=\"RgQKIN\">“If anyone finds themselves in a similar situation: first, right now, before anything bad happens, join a union,” Julia said in response to the broader concerns. “Then if something bad happens: Document everything. Know your rights. Don’t let them drag it out. Stay vocal. These stories are real, they are happening to your colleagues.”</p><p id=\"56GfJt\"><em><strong>Correction April 5th 6:51PM ET: </strong></em><em>A previous version of the story stated Julia signed an NDA. She did not, but other DeepMind employees have. We regret the error.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/u73AWbXdxily4v6oOaJBFryq2YI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10551085/acastro_180329_1777__brains_science_0002.jpg",
  "description": "DeepMind allegedly took 10 months to resolve a complaint.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}