{
  "title": "Whistleblowers claim Facebook’s chaotic Australia news ban was a negotiating tactic",
  "url": "https://www.theverge.com/2022/5/6/23059684/facebook-australia-news-ban-internally-praised-overbroad-nonprofits-government-organizations",
  "date": "2022-05-06T10:41:53.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hFn9JEHm_2XLgdyTB_4BUa3prgs=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70838767/acastro_180720_1777_facebook_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"inLLHC\">When Facebook briefly blocked all news from being posted on its platform in Australia last year, it used an overly broad definition of news publisher that it knew would cause collateral damage, company whistleblowers are alleging. Complaints filed with Australia’s Competition &amp; Consumer Commission and the US Department of Justice allege that the company engaged in “a criminal conspiracy to obtain a thing of value, namely favorable regulatory treatment,” <a href=\"https://www.wsj.com/articles/facebook-deliberately-caused-havoc-in-australia-to-influence-new-law-whistleblowers-say-11651768302\"><em>The Wall Street Journal </em>reports</a>.</p><p id=\"cujFE1\">The news ban was put into place by Facebook <a href=\"https://www.theverge.com/2021/2/17/22287776/facebook-block-news-australia-regulation-media-link-sharing\">last February</a> in protest over a proposed Australian law that would effectively force platform-holders like it and Google to pay news publishers when sharing their content. But the ban was chaotically implemented, and there were widespread reports of it <a href=\"https://www.theverge.com/2021/2/17/22288256/facebook-australia-news-ban-governmental-agency-accounts\">blocking government organizations and nonprofits</a> alongside news publishers.</p><div class=\"c-float-right\"><aside id=\"B3a10D\"><q>The law eventually passed in an amended form</q></aside></div><p id=\"7ER2kG\">Blocked non-media pages included government organizations like the Department of Fire and Emergency Services Western Australia and Queensland Health and nonprofits like Mission Australia and the Hobart Woman’s shelter. The ban took place during fire season in Australia, the <em>WSJ</em> notes, and coincided with the country’s COVID-19 vaccine rollout. In total, the <em>WSJ </em>reports that Facebook internally recognized it had blocked 17,000 pages that it shouldn’t have in the first day of the ban. </p><p id=\"VXgiGp\">“It was clear this was not us complying with the law, but a hit on civic institutions and emergency services in Australia,” one whistleblower said, in comments reported by the <em>WSJ</em>. Facebook started removing the pages on February 18th, after the House of Representatives passed an initial version of the bill, but ahead of final votes by it and the Australian Senate the following week. </p><p id=\"yylig0\">Facebook publicly admitted at the time that it had taken a “broad definition” of news content, in light of what it said was a lack of “clear guidance” in the law. Records of internal conversations obtained by the <em>WSJ</em> offer more evidence that this was the case. “[The proposed Australian law] we are responding to is extremely broad, so guidance from the policy and legal team has been to be overinclusive and refine as we get more information,” wrote a product manager in an internal log. </p><p id=\"ErSQWZ\">Leaked documents suggest the company classified a page a news publisher if over 60 percent of the content it shared was classified as news. Documents also suggest that the company had planned on excluding all government and education domains from the ban.</p><p id=\"MNF4Kh\">But the list of organizations who saw their Facebook pages removed as a result of the ban suggests these safeguards malfunctioned, and according to the <em>WSJ</em>, Facebook ignored approaches that could have more precisely targeted news organizations. The company decided against using its database of news publishers known as the News Page Index, apparently because it relied on news publishers to opt-in, and the complaints allege it failed to use existing whitelisting tools to protect important accounts. It failed to put an appeals process in place before blocking pages, and did not notify affected pages in advance. </p><p id=\"iIy6om\">Despite the technical issues with the media ban, Facebook officials internally praised the company’s response to the legislation. Facebook’s head of partnerships Campbell Brown called the team’s efforts “genius,” while chief operating officer Sheryl Sandberg said “the thoughtfulness of the strategy, precision of execution, and ability to stay nimble as things evolved [set] a new high-standard.” CEO Mark Zuckerberg praised the team’s ability to “execute quickly and take a principled approach.”</p><p id=\"g76SoI\">When reached for comment, Facebook spokesperson Gina Murphy sent over a statement saying “the documents in question clearly show that we intended to exempt Australian government Pages from restrictions in an effort to minimize the impact of this misguided and harmful legislation. When we were unable to do so as intended due to a technical error, we apologized and worked to correct it. Any suggestion to the contrary is categorically and obviously false.”</p><p id=\"b8vu5s\">The law Facebook was protesting went on to pass <a href=\"https://www.theverge.com/2021/2/24/22283777/australia-new-media-bargaining-code-facebook-google-paying-news\">later that month</a>. But it did so while containing amended language that means the Australian Treasurer needs to consider private deals struck between publishers and platforms before designating a company like Facebook as a platform under the law, and allowing it to be forced into arbitration. As a result, over a year after the law passed, neither Facebook nor Google have officially been designated as platforms under the rules. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/0lyH5o6CS-1RwU5RSa0ro7sI0H4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948785/acastro_180720_1777_facebook_0001.jpg",
  "description": "Measures were meant to be \"overinclusive.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}