{
  "title": "Why Elon Musk should read Facebook’s latest transparency report",
  "url": "https://www.theverge.com/2022/5/18/23115281/facebook-transparency-report-understanding-moderation-elon-musk",
  "date": "2022-05-18T14:30:00.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MyZC1_kz4IwcD3JcSNMq4HES5O0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70882898/jbareham_180405_1777_facebook_0002.0.jpg\" />        <figcaption>Illustration by James Bareham / The Verge</figcaption>    </figure>  <p class=\"p--has-dropcap\" id=\"9tiKWi\">Today, let’s talk about Facebook’s latest effort to make the platform more comprehensible to outsiders — and how its findings inform our current, seemingly endless debate over whether you can have a social network and free speech, too.</p><p id=\"CT5N5D\">Start with an observation: last week, Pew Research reported that large majorities of Americans — <a href=\"https://twitter.com/elonmusk/status/1519036983137509376\">Elon Musk, for example</a>! — believe that social networks are censoring posts based on the political viewpoints they express. Here’s <a href=\"https://www.pewresearch.org/fact-tank/2022/05/13/support-for-more-regulation-of-tech-companies-has-declined-in-u-s-especially-among-republicans/\">Emily A. Vogels</a>:</p><blockquote><p id=\"jh1J4f\">Rising slightly from <a href=\"https://www.pewresearch.org/internet/2020/08/19/most-americans-think-social-media-sites-censor-political-viewpoints/\">previous years</a>, roughly three-quarters of Americans (77%) now think it is very or somewhat likely that social media sites intentionally censor political viewpoints they find objectionable, including 41% who say this is very likely.</p><p id=\"RvXAtQ\">Majorities across political parties and ideologies believe these sites engage in political censorship, but this view is especially widespread among Republicans. Around nine-in-ten Republicans (92%), including GOP leaners, say social media sites intentionally censor political viewpoints that they find objectionable, with 68% saying this is very likely the case. Among conservative Republicans, this view is nearly ubiquitous, with 95% saying these sites likely censor certain political views and 76% saying this is very likely occurring.</p></blockquote><p id=\"Le9oFP\">One reason I find these numbers interesting is that <em>of course</em> social networks are removing posts based on the viewpoints they express. American social networks all agree, for example, that Nazis are bad and that you shouldn’t be allowed to post on their sites saying otherwise. This is a political view, and to say so should not be controversial.</p><p id=\"o5vUeN\">Of course, that’s not the core complaint of most people who complain about censorship on social networks. Republicans <a href=\"https://www.theverge.com/interface/2019/4/11/18305407/social-network-conservative-bias-twitter-facebook-ted-cruz\">say constantly</a> that social networks are run by liberals, have liberal policies, and censor conservative viewpoints to advance their larger political agenda. (Never mind the evidence that social networks have generally been <a href=\"https://www.politico.com/news/2020/09/26/facebook-conservatives-2020-421146\">a huge boon to the conservative moment</a>.)</p><div class=\"c-float-right\"><aside id=\"hITJnp\"><q>they’re not answering the question you actually asked</q></aside></div><p id=\"JsHWY9\">And so when you ask people, as Pew did, whether social networks are censoring posts based on politics, they’re not answering the question you actually asked. Instead, they’re answering the question: <em>for the most part, do the people running these companies seem to share your politics</em>? And that, I think more or less explains 100 percent of the difference in how Republicans and Democrats responded.</p><p id=\"1Pua0D\">But whether on Twitter or in the halls of Congress, this conversation almost always takes place only at the most abstract level. People will complain about individual posts that get removed, sure, but only rarely does anyone drill down into the details: on what categories of posts are removed, in what numbers, and in what the companies themselves have to say about the mistakes they make.</p><p id=\"C9RsJ5\">That brings us to a document that has a boring name, but is full of delight for those of us who are nosy and enjoy reading about the failures of artificial-intelligence systems: <a href=\"https://transparency.fb.com/data/community-standards-enforcement/\">Facebook’s quarterly community standards enforcement report</a>, the latest of which the company released today as part of a larger “<a href=\"https://about.fb.com/news/2022/05/transparency-report-h2-2021/\">transparency report</a>” for the latter half of 2021.</p><p id=\"scUfzz\">An important thing to focus on, whether you’re an average user worried about censorship or recently bought a social network promising to allow almost all legal speech, is what kind of kind of speech Facebook removes. Very little of it is “political,” at least in the sense of “commentary about current events.” Instead, it’s posts related to drugs, guns, self-harm, sex and nudity, spam and fake accounts, and bullying and harassment.</p><p id=\"bGbp9W\">To be sure, some of these categories are deeply enmeshed in politics — terrorism and “dangerous organizations,” for example, or what qualifies as hate speech. But for the most part, this report chronicles stuff that Facebook removes because it’s good for <em>business</em>. Over and over again, social products find that their usage shrinks when even a small percentage of the material they host includes spam, nudity, gore, or people harassing each other.</p><div class=\"c-float-right\"><aside id=\"V4iK1D\"><q>Facebook removes these things because it’s good for <em>business</em></q></aside></div><p id=\"JszLDd\">Usually social companies talk about their rules in terms of what they’re doing “to keep the community safe.” But the more existential purpose is to <em>keep the community returning to the site at all</em>. This is what makes Texas’ new social media law, which I wrote about yesterday, <a href=\"https://www.platformer.news/p/the-platforms-witness-a-crime?s=w\">potentially so dangerous to platforms</a>: it seemingly requires them to host material that will drive away their users.</p><p id=\"RyJ6u6\">At the same time, it’s clear that removing too many posts <em>also</em> drives people away. In 2020, I reported that <a href=\"https://www.theverge.com/c/21444203/facebook-leaked-audio-zuckerberg-trump-pandemic-blm\">Mark Zuckerberg told employees that censorship was the No. 1 complaint of Facebook’s user base</a>.</p><p id=\"ADXPfH\">A more sane approach to regulating platforms would begin with the assumption that private companies should be allowed to establish and enforce community guidelines, if only because their companies likely would not be viable without them. From there, we can require platforms to tell us <em>how</em> they are moderating, under the idea that sunlight is the best disinfectant. And the more we understand about the decisions platforms make, the smarter the conversation we can have about what mistakes we’re willing to tolerate.</p><p id=\"jNPYKZ\">As the content moderation scholar <a href=\"https://www.jstor.org/stable/27007631\">Evelyn Douek has written</a>: “Content moderation will always involve error, and so the pertinent questions are what error rates are reasonable and which kinds of errors should be preferred.”</p><p id=\"lfeYiE\">Facebook’s report today highlights two major kinds of errors: ones made by human beings, and ones made by artificial intelligence systems.</p><p id=\"mMOKW8\">Start with the humans. For reasons that the report does not disclose, between the last quarter of 2021 and the first quarter of this one, its human moderators suffered “a temporary decrease in the accuracy of enforcement” on posts related to drugs. As a result, the number of people requesting appeals rose from 80,000 to 104,000, and Facebook ultimately restored 149,000 posts that had been wrongfully removed.</p><p id=\"WX2Nfj\">Humans arguably had a better quarter than Facebook’s automated systems, though. Among the issues with AI this time around:</p><ul><li id=\"xejkYY\">Facebook restored 345,600 posts that had been wrongfully removed for violating policies related to self harm, up from 95,300 the quarter earlier, due to “an issue which caused our media-matching technology to action non-violating content.”</li><li id=\"jJoFqC\">The company restored 414,000 posts that had been wrongfully removed for violating policies related to terrorism, and 232,000 related to organized hate groups, apparently due to the same issue.</li><li id=\"gDrJDk\">The number of posts it wrongfully removed for violating policies related to violent and graphic content last quarter more than doubled, to 12,800, because automated systems incorrectly took down photos and videos of Russia’s invasion of Ukraine.</li></ul><p id=\"lwZo8G\">Of course, there was also good evidence that automated systems are improving. Most notably, Facebook took action on 21.7 million posts that violated policies related to violence and incitement, up from 12.4 million the previous quarter, “due to the improvement and expansion of our proactive detection technology.” That raises, uh, more than a few questions about what escaped detection in earlier quarters.</p><p id=\"jFOvzd\">Still, Facebook shares much more about its mistakes than other platforms do; YouTube, for example, <a href=\"https://transparencyreport.google.com/youtube-policy/appeals?hl=en\">shares some information about videos that were taken down in error</a>, but not by category and without any information about the mistakes that were made.</p><p id=\"hhp3GW\">And yet still there’s so much more we would benefit from knowing — from Facebook, YouTube, and all the rest. How about seeing all of this data broken down by country, for example? How about seeing information about more explicitly “political” categories, such as posts removed for violating policies related to health misinformation? And how about seeing it all monthly, rather than quarterly?</p><p id=\"KW7WWU\">Truthfully, I don’t know that any of that would do much to shift the current debate about free expression. Partisans simply have too much to gain politically by endlessly crying “censorship” whenever any decision related to content moderation goes against them.</p><p id=\"e4tJ7E\">But I do wish that lawmakers would at least spend an afternoon enmeshing themselves in the details of a report like Facebook’s, which lays out both the business and technical challenges of hosting so many people’s opinions. It underscores the inevitability of mistakes, some of them quite consequential. And it raises questions that lawmakers could answer via regulations that might actually withstand 1st Amendment scrutiny, such as what rights to appeal a person should have if their post or account are removed in error.</p><div class=\"c-float-right\"><aside id=\"UcPt4X\"><q>millions of Facebook users are seeing their posts removed in error</q></aside></div><p id=\"9XDQKy\">There’s also, I think, an important lesson for Facebook in all that data. Every three months, according to its own data, millions of its users are seeing their posts removed in error. It’s no wonder that, over time, this has become the top complaint among the user base. And while mistakes are inevitable, it’s also easy to imagine Facebook treating these customers better: explaining the error in detail, apologizing for it, inviting users to submit feedback about the appeals process. And then improving that process.</p><p class=\"c-end-para\" id=\"wMcCxv\">The status quo, in which those users might see a short automated response that answers none of their questions, is a world in which support for the social network — and for content moderation in general — continues to decline. If only to preserve their businesses, the time has come for platforms to stand up for it.</p><div id=\"8oTpHo\"><iframe src=\"https://www.platformer.news/embed\" width=\"480\" height=\"320\"  frameborder=\"0\" scrolling=\"no\"></iframe></div><p id=\"hUtC65\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/OOyKfOEuZFywXmEnwJxt0U4rEtE=/0x267:2040x1335/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10602743/jbareham_180405_1777_facebook_0002.jpg",
  "description": "Legislators might want to check it out, too",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}