{
  "title": "Why the cryptocurrency community is celebrating Biden’s executive order",
  "url": "https://www.theverge.com/2022/3/10/22969798/crypto-executive-order-biden-reaction-digital-assets",
  "date": "2022-03-10T14:11:47.000Z",
  "author": "Elizabeth Lopatto",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/q8xfAZ7gtluYL_3dyAn-Yqv2yH4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70603581/jbareham_180313_1777__bitcoin_cryptocurrency_0003.0.jpg\" />        <figcaption>Illustration by James Bareham / The Verge</figcaption>    </figure>  <p id=\"zdTFSf\">The White House’s plan for digital asset regulation is here, and though the order doesn’t say <em>much,</em> cryptocurrency advocates are treating it as a win. Maybe that was inevitable, after a great deal of Twitter FUD (investor-speak for fear, uncertainty, doubt) about what the order would contain. <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2022/03/09/executive-order-on-ensuring-responsible-development-of-digital-assets/\">The actual text</a>, despite being a bit vague, is nonetheless a positive for the industry — not least because it gives everyone some time.</p><div class=\"c-float-right\"><aside id=\"PpYgsJ\"><q>Its approach sidelines cryptocurrency’s most dogged skeptics</q></aside></div><p id=\"CFzT0V\">There have been a few last-minute attempts to regulate cryptocurrency. There was, for instance, the time the Trump administration’s Financial Crimes Enforcement Network <a href=\"https://www.theverge.com/2020/12/22/22195834/cryptocurrency-fincen-regulations-private-wallets\">attempted to push new proposed regulations <em>over Christmas</em></a>. (This was suspended.) There were also the <a href=\"https://www.theverge.com/2021/8/25/22641375/cryptocurrency-infrastructure-irs-tax-developers-miners-bitcoin\">proposed tax changes </a>in last year’s <a href=\"https://www.theverge.com/2021/8/18/22631096/cryptocurrency-tax-bipartisan-infrastructure-bill-advocacy-jack-dorsey-ashton-kutcher\">infrastructure bill.</a> (<a href=\"https://www.theverge.com/2021/11/8/22770798/biden-infrastructure-cryptocurrency-bitcoin-crypto-tax-irs-treasury\">They passed</a>.)</p><p id=\"ursK4X\">“I’m really excited that there will be an opportunity to be part of discussions to keep the US a leader in this space,” says Kristin Smith, executive director of the Blockchain Association, an industry group. (The Trump-era FINCEN proposal ruined her Christmas that year.) There aren’t a lot of surprises in the EO — the list of issues are ones that lawmakers and industry insiders have been discussing already.</p><p id=\"EwbedD\">There’s another reason for the crypto community to celebrate: the order legitimizes digital assets by treating them as worthy of measured regulation. Its approach sidelines cryptocurrency’s most dogged skeptics and leaves people who think crypto is planet-destroying nonsense — <a href=\"https://www.reddit.com/r/Buttcoin/\">and there are a lot of those people!</a> — with few friends in DC to represent their point of view.</p><p id=\"YqRbQt\">The order instructs agencies to develop policies that will protect consumers, investors, and businesses, as well as to guard against systemic risks. The Biden order specifically tells agencies to figure out ways to minimize any risks posed by illicit uses for cryptocurrency. But it <em>also</em> directs the Department of Commerce to figure out how to keep the US competitive in the development of digital assets.</p><div class=\"c-float-right\"><aside id=\"9zwN4w\"><q>“When serious officials take a sober look at crypto, the reaction is not to light their hair on fire.”</q></aside></div><p id=\"9EAy2V\">“People were concerned it would focus solely on the risks,” says Blake Estes, a partner at Alston &amp; Bird, who focuses on fintech. “Hopefully, it gives more serious people comfort that they can enter the space and do serious projects and they won’t be regulated out of existence.”</p><p id=\"EXq7m6\">The US government has been looking into all of this regulation already, and the executive order falls short of being a clear roadmap. But the emphasis on innovation in the text of the order — as well as ensuring the “responsible development” of digital assets — suggests that a crackdown on cryptocurrency is unlikely. The response from cryptocurrency enthusiasts has emphasized that.</p><p id=\"nxT7bz\">“Digital assets have immense potential economic and social benefits for countries that establish sensible regulation,” <a href=\"https://twitter.com/faryarshirzad/status/1501565940785459208\">wrote Faryar Shirzad</a>, the chief policy officer at Coinbase, on Twitter. He wants to see the public brought into the process of regulating cryptocurrency, saying it is “essential” to get input from people who’ve been thinking about it for years. “This is a hopeful moment.”</p><p id=\"kHRz0N\">“The EO is just further affirmation that when serious officials take a sober look at crypto, the reaction is not to light their hair on fire,” <a href=\"https://twitter.com/jerrybrito/status/1501583676026638345\">wrote Jerry Brito</a>, executive director of Coin Center, a DC crypto think tank, on Twitter. Instead, the EO emphasizes that the US wants to remain competitive, fostering innovation while minimizing harm.</p><div class=\"c-float-right\"><aside id=\"FIli95\"><q>“The subtext there, as I read it, is that we need to do this to be leaders.”</q></aside></div><p id=\"jir3qz\">“The acknowledgement from the White House and the Biden Administration that this sector warrants a whole-of-government approach to at once harness opportunities while controlling and managing inherent risks in responsible innovation is encouraging,” wrote Dante Disparte, chief strategy officer of Circle, the company behind a dollar-pegged stablecoin called USDC, <a href=\"https://www.circle.com/blog/a-coming-of-age-moment-for-crypto-reflections-on-the-white-house-executive-order-on-digital-assets\">in a blog post</a>.</p><p id=\"H4t1vX\">The order also <a href=\"https://www.bloomberg.com/news/articles/2021-06-15/the-big-difference-between-a-digital-dollar-and-a-cbdc\">advances the central bank digital currency </a>(CBDC), which may also mean a digital dollar. “Sovereign money is at the core of a well-functioning financial system, macroeconomic stabilization policies, and economic growth,” the order says. For this reason, researching, developing, and exploring deployment of a CBDC is of the “highest urgency.” That could mean faster and cheaper payments across countries’ borders — and so the order calls for a report from agencies including the State Department and Homeland Security to weigh in on the future of money and payment systems. The Federal Reserve released its own, rather ambivalent, <a href=\"https://www.theverge.com/2022/1/21/22894101/federal-reserve-us-government-digital-dollar-central-bank-currency\">report on CBDCs</a> earlier this year.</p><p id=\"55YKnE\">The order suggests that the US needs to develop a CBDC to maintain the dollar as the world’s reserve currency, notes Alan Konevsky, chief legal and corporate affairs officer of tZERO, a crypto trading system. “The subtext there, as I read it, is that we need to do this to be leaders,” Konevsky says. </p><p id=\"ZAH5yv\">While Konevsky feels the tone of the order overall “isn’t necessarily friendly,” he, too, thinks the order’s existence is a recognition of both how important and how mainstream digital assets have become. If the US has to build a CBDC in order to remain competitive, that may be all the validation the cryptocurrency community needs that their technology is important.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Cc25lbecHTviBbtDHrkDsMPMUcw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10418911/jbareham_180313_1777__bitcoin_cryptocurrency_0003.jpg",
  "description": "The order seems to legitimize digital assets.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}