{
  "title": "Why gamers hate crypto, and music fans don’t",
  "url": "https://www.theverge.com/22917126/nfts-crypto-gamers-music-fans-fandoms",
  "date": "2022-02-04T14:44:56.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6kaYpjZfEj7vMmWjh-D_1By3d0k=/250x0:1750x1000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70470756/Coachella_NFTs__HERO_.0.png\" />        <figcaption>Image: Coachella</figcaption>    </figure>  <p id=\"pVqYq1\">Today, let’s talk about the very different reactions that two different types of fandoms are having to blockchain-based products — and whether that tells us anything about what average people might actually want out of crypto.</p><p id=\"m8E9IT\">The fandoms are gaming and music. And while you’re always going out on a limb when you try to draw conclusions about such large, diverse groups, I can’t help but feel like I’m seeing a trend in the way they have responded so far to efforts from industry to sell them various blockchain-related things.</p><aside id=\"Pab0kG\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"NFTs, explained\",\"url\":\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\"}]}'></div></aside><p id=\"9ZVLUa\">Start with the gamers. Outside those working on play-to-earn games like <a href=\"https://www.theverge.com/2021/10/13/22725083/axie-infinity-sky-mavis-blockchain-economy-game-pokemon\"><em>Axie Infinity</em></a>, hostility toward crypto in the gaming community tends to be overwhelming. One of the most popular recurring stories over the past two months has been for a game developer to announce some sort of NFT integration in a forthcoming video game, inspiring a massive backlash, only to later disavow the project and apologize.</p><p id=\"DlWRky\">This week, <a href=\"https://www.protocol.com/bulletins/ea-ceo-nfts-blockchain-backtrack\">it was Electronic Arts’ turn to reverse course</a>. Three months ago, CEO Andrew Wilson said NFTs and blockchain gaming were “the future of our industry.” But on an earnings call Tuesday, Wilson said EA is not currently “driving hard on” crypto projects. Here’s<a href=\"https://www.protocol.com/bulletins/ea-ceo-nfts-blockchain-backtrack\"> Nick Statt at <em>Protocol</em></a>:</p><blockquote><p id=\"79UuMS\">“I believe that collectability will continue to be an important part of our industry and the games and experiences that we offer our players. Whether that’s as part of the NFT blockchain, well, that remains to be seen. And I think the way we think about it is we want to deliver the best possible player experience we can. And so we’re going to evaluate that over time, but right now, it’s not something that we’re driving hard on,” Wilson said, in response to a question about any potential investments in NFTs or blockchain gaming.</p></blockquote><p id=\"NLsd1u\">Wilson’s comments came shortly after Team17, developers of the 75 million-copy-selling <em>Worms</em> franchise, <a href=\"https://www.theverge.com/2022/2/1/22913110/team17-worms-nft-metaworms-gaming-playtonic-overcooked\">abandoned plans for an NFT “MetaWorms” project</a>. After fan outrage, it seemed to have no other choice. “We have listened to our Teamsters, development partners, and our games’ communities, and the concerns they’ve expressed, and have therefore taken the decision to step back from the NFT space,” <a href=\"https://www.team17.com/team17-to-end-metaworms-nft-project/\">the company said</a>.</p><p id=\"vWEzJ3\">It can not be overstated the degree to which something like this happens every day. Consider these two memorable sentences from <a href=\"https://www.polygon.com/22904690/riot-games-killjoy-valorant-nft-twitter-controversy\">Cass Marshall in <em>Polygon</em></a>:</p><blockquote><p id=\"iWGhEQ\"><em>Valorant</em>, the competitive shooter from Riot Games, stars a cast of near future heroes and mercenaries with unique skillsets and personalities. One of these characters, Killjoy, briefly ended up in hot water on social media after accidentally providing some acclaim to a NFT artist.</p></blockquote><p id=\"du02V1\">What happened? Well, the <em>Valorant</em> Twitter account posted a picture of Killjoy looking at a (real) work of art in a museum; it turned out that the artist behind the image sells his works as NFTs. In response, the <em>Valorant</em> team tweeted as if it were begging for its life. “We were not aware the selected work was an NFT,” the <em>Valorant</em> account <a href=\"https://twitter.com/valorantde/status/1486759871378767878?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1486759871378767878%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.polygon.com%2F22904690%2Friot-games-killjoy-valorant-nft-twitter-controversy\">said</a>. “In no way did we intend to include NFTs as part of Killjoy’s work and hobbies.” The tweet earned 3,500 likes; <em>Valorant</em> was spared further harm.</p><div class=\"c-float-right\"><aside id=\"4LC8Yh\"><q>His fans chose hate</q></aside></div><p id=\"rugUuy\">Not even Troy Baker, one of <a href=\"https://en.wikipedia.org/wiki/Troy_Baker\">the most beloved voice actors</a> in gaming, could get away with an NFT project. He <a href=\"https://twitter.com/TroyBakerVA/status/1481869350621437955\">announced</a> a partnership with something called VoiceVerse, whose “voice NFTs” would each include “a unique AI-generated voice map.” Perhaps anticipating criticism, Baker added: “You can hate. Or you can create. What’ll it be?” His fans chose hate, to the tune of 13,000 aggrieved quote tweets, and on Monday Baker <a href=\"https://www.theverge.com/2022/1/31/22910633/troy-baker-voiceverse-nft-voice-actor-project-the-last-of-us\">quit the project</a>.</p><p id=\"VidclC\">Why are these projects so unpopular?</p><p id=\"2fJCca\">Reading through angry social media posts, a few key themes emerge. One, gamers and developers are engaged in a perennial battle over how games are monetized. Gamers generally want to pay one low price to play a game forever; developers are forever experimenting with exotic new financing schemes to grow their profits. Gamers have already been subjected to premium downloadable content; subscriptions, <a href=\"https://www.investopedia.com/articles/investing/022216/how-microtransactions-are-evolving-economics-gaming.asp\">micro-transactions</a>, and randomized <a href=\"https://en.wikipedia.org/wiki/Loot_box\">loot boxes</a>, each of which has been more poorly received than the last.</p><p id=\"WqcwqL\">What these have in common is that they generally do not make games more fun to play; they do, however, make them more expensive. And so when Ubisoft says it will integrate NFTs into its shooter franchise <em>Ghost Recon Breakpoint</em>, <a href=\"https://decrypt.co/88880/after-backlash-ubisoft-calls-gaming-nfts-a-major-change-that-will-take-time\">and its players revolt,</a> this is why. For the moment, it appears that the game’s NFTs will simply be collectible cosmetic items, like digital hats or jackets. But it’s easy to imagine Ubisoft eventually limiting access to parts of the game based on NFT ownership, at which point the whole thing has become one more micro-transaction to add to the pile.</p><div><aside id=\"32JmSt\"><q>They generally do not make games more fun to play</q></aside></div><p id=\"p4jaFK\">This, in addition to all the usual crypto concerns — bad for the environment, full of scams, and so on — helps explain the gamer hatred of crypto. They see it as a force likely to warp the gaming industry into something less entertaining and less accessible. It’s now clear that gamers will resist that force wherever they see it.</p><p id=\"76Wpw7\">That brings us to the world of music, where the response to crypto has been decidedly more muted. For example, consider the popular R&amp;B singer John Legend. Legend has 21 million monthly Spotify listeners, 13.8 million Twitter followers, and a new NFT platform. <em>(Disclaimer: John Legend is a Vox Media board member.)</em> </p><p id=\"LcPdYn\">Here’s <a href=\"https://www.bloomberg.com/news/articles/2022-02-02/john-legend-follows-tom-brady-into-world-of-celebrity-nfts?cmpid%3D=socialflow-twitter-pursuits&amp;utm_medium=social&amp;utm_campaign=socialflow-organic&amp;utm_source=twitter&amp;utm_content=pursuits&amp;sref=CrGXSfHu\">Kim Bhasin at Bloomberg</a>:</p><blockquote><p id=\"HO1uRN\">The 12-time Grammy Award winner is working with Chris Lin, who runs Taipei-based digital music service KKBOX, Twitch cofounder Kevin Lin and Matt Cheng of early-stage venture firm Cherubic Ventures as part owners of the new business.</p><p id=\"i4olgq\">The platform, called OurSong, allows artists to monetize their work through nonfungible tokens, which are digital certificates of authenticity that can be bought or sold. Legend will serve as chief impact officer to attract up-and-coming artists and their fans.</p></blockquote><p id=\"TEjYJ6\">Legend hasn’t tweeted about the platform yet, but <a href=\"https://twitter.com/johnlegend/status/1486551504290869250\">he did tweet about another NFT project</a>, and the overall response was positive. Some people announced they were unfollowing him, but other people thought the NFTs were beautiful, and in any case Legend has not had to disavow all of crypto to remain in good standing with his fan base.</p><p id=\"D6YFiK\">Or what about Coachella, perhaps the nation’s preeminent music festival for young people? Its parent company, AEG, announced it will auction off 10 lifetime passes on Friday morning<a href=\"https://www.theverge.com/2022/2/1/22912255/coachella-lifetime-passes-nfts\"> as part of a larger move into NFTs</a>. Some of the Coachella NFTs can be redeemed for physical items like posters and photo books. The digital goods come with analog benefits.</p><p id=\"bv1QVr\">Coachella <a href=\"https://twitter.com/coachella/status/1488577221857996802\">tweeted its announcement</a> this week, and while some of the expected dunking materialized, it was far lighter than anything so far endured by game developers. Plenty of people seemed legitimately excited by the chance to bid on a lifetime pass. “The same people calling NFTs a scam in 2022, will be questioning how they missed out on a lifetime Coachella Ticket in 2022 via NFT mint,” <a href=\"https://twitter.com/coachella/status/1488577221857996802\">one person responded</a>. (Then again, someone else responded to <em>that</em> with a photo of a person pushing a button labeled “cringe.”)</p><p id=\"FtJ2n3\">What’s important is that the plan is moving <em>forward</em>. No angry mob materialized, and the auction will take place Friday as planned. I’m sure there are <em>some</em> people who might boycott Coachella over this, but the majority response seems to be somewhere in between indifference and enthusiasm. Not much to brag about, perhaps, but that’s a space that game developers would <em>love </em>to get to<em>.</em></p><p id=\"wHGKcE\">So what’s the difference between gaming NFTs and music NFTs? And what explains the different reactions?</p><p id=\"IpiBZb\">One, live entertainment has always done a healthy business in collectibles; gaming hasn’t. Lots of people buy T-shirts when they go to a concert; it stands to reason that some of them would pay for a unique digital item as well. Many NFTs are sold with the implicit promise that they are investments; projects like Legend’s or Coachella’s, on the other hand, can represent themselves more honestly as souvenirs.</p><p id=\"SelzWy\">In practice, some gamers <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.sideshow.com%2Fgenres%2Fvideo-game&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F22917126%2Fnfts-crypto-gamers-music-fans-fandoms\" rel=\"sponsored nofollow noopener\" target=\"_blank\"><em>do </em>buy souvenirs</a> from the games they play. But not as many as buy concert T-shirts. And gamers’ souvenirs, whether posters or action figures, are separate from the game itself, and have no bearing on how fun the game is to play. That seems important.</p><p id=\"DIe4zU\">Two, music NFTs can more easily be positioned as helping artists. When I decided to write last year<a href=\"https://www.platformer.news/p/is-the-music-industrys-future-on\"> about the startup Royal</a>, which lets musicians sell their albums as NFTs, this was a large part of its appeal to me. Record labels are notorious for swallowing the lion’s share of an artist’s profits; what if artists could earn more by selling directly to fans? You may not want to buy an NFT from Legend or one of the artists he worked with on his project — but are you really going to begrudge him a chance to sell something directly to his fans?</p><p id=\"MyAjs5\">(It’s telling that<a href=\"https://www.nme.com/news/music/artists-slam-website-hitpiece-for-listing-their-songs-as-nfts-for-auction-without-their-knowledge-3151472\"> the NFT project that music fans arguably hate the most viscerally, Hit Piece</a>, is a straight-up ripoff of artists: a project designed to sell NFTs of their songs without the permission of anyone involved.)</p><div class=\"c-float-right\"><aside id=\"PprhW8\"><q>music NFTs can more easily be positioned as helping artists</q></aside></div><p id=\"wbo3r0\">Meanwhile, game developers are generally large, profitable corporations whose relationship with their fans is fraught as best. (The dialogue between them frequently resembles a hostage negotiation, as you see in the <em>Valorant</em> story above.) In any case, no one selling gaming NFTs is even pretending that the move is for the benefit of artists, and that costs them significant goodwill.</p><p id=\"wAKAxJ\">Three, the music NFT projects I’m describing this week are entirely optional. You can still stream Legend on Spotify without buying one of his NFTs; you can still go to Coachella without winning an auction for a lifetime pass. The music industry has so far approached crypto as a way to sell extras to an artist’s most hardcore fans, and it’s natural that those hardcore fans have not rioted in response. They like the artist; they like the festival. If some people want to blow a lot more money on it, what’s the big deal?</p><p id=\"Ud9XgP\">Compare that to the gamer, who faces the prospect of having to compete in a shooter game against people who have paid to look superior to them, or have different levels of access or other perks thanks to crypto. There, the NFTs cannot be ignored — they’re warping the whole experience for everyone.</p><p id=\"D9j3Sz\">To some extent this already happens in a game like <em>Fortnite</em>, where players can pay for skins and other cosmetic items. But <em>Fortnite</em> is free to play, and many of those items can be earned for free through gameplay; the same cannot be said for most of the NFT plans that game developers have announced so far.</p><p id=\"lZDaFN\">Why does any of this matter?</p><p id=\"omGDK3\">One of the refrains in “<a href=\"https://www.youtube.com/watch?v=YQ_xWvX1n9g&amp;t=1828s\">The Problem with NFTs</a>,” Dan Olson’s epic video on the subject that I wrote about <a href=\"https://www.theverge.com/2022/1/28/22906010/web3-nft-internet-history-video-platformer\">last week</a>, is that most crypto projects exist only to get you to buy crypto. NFTs, DAOs, “play-to-earn” games — the whole point is to get you to stock up on Ethereum or some other cryptocurrency, which will raise the value of that currency and eventually allow its current holders to cash out at a profit.</p><div class=\"c-float-left\"><aside id=\"2T4pvQ\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Three things Web3 should fix in 2022\",\"url\":\"https://www.theverge.com/2022/1/28/22906010/web3-nft-internet-history-video-platformer\"},{\"title\":\"How Twitter could take NFTs mainstream\",\"url\":\"https://www.theverge.com/2022/1/21/22894142/twitter-nft-profile-picture-hexagon-circle-mainstream\"},{\"title\":\"Is the music industry’s future on the blockchain?\",\"url\":\"https://www.theverge.com/22800746/music-industry-royalties-blockchain-crypto-royal-paradigm\"},{\"title\":\"How one company took over the NFT trade\",\"url\":\"https://www.theverge.com/2022/2/2/22914081/open-sea-nft-marketplace-web3-fundraising-finzer-a16z\"}]}'></div></aside></div><p id=\"2p9sFk\">Looking at music NFTs, I see flashes of something that goes beyond a scheme to get the world to buy crypto. Festival passes, digital art, pressure on record labels — there’s a hint of something practical there. And it seems telling that, in the court of public opinion at least, it’s those nascent projects that seem to be getting a pass.</p><p id=\"TSEfZ0\">The world that enthusiasts call “web3” is still a mess, for<a href=\"https://www.platformer.news/p/three-things-web3-should-fix-in-2022\"> all of the reasons I wrote about last week and more</a>. But there is wisdom in fandoms, and they’re already telling us what they want from the blockchain — and what they don’t. I wonder what useful or entertaining new things startups could build once they start listening. </p><aside id=\"SXmyQh\"><div data-anthem-component=\"actionbox\" data-anthem-component-data='{\"title\":\"Platformer by Casey Newton\",\"description\":\"&lt;em&gt;This column was co-published with&amp;nbsp;&lt;/em&gt;&lt;a class=\\\"ql-link\\\" href=\\\"https://www.platformer.news/\\\" target=\\\"_blank\\\"&gt;&lt;em&gt;Platformer&lt;/em&gt;&lt;/a&gt;&lt;em&gt;, a daily newsletter about Big Tech and democracy.&lt;/em&gt;\",\"label\":\"Subscribe here\",\"url\":\"https://bit.ly/3reEpGG\"}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/-1hIwqw0H-abhI0Cy2CHjdeUTO8=/45x0:1955x1000/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23209780/Coachella_NFTs__HERO_.png",
  "description": "Think about how they’re pitched — and who benefits",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}