{
  "title": "Why Trump’s Truth Social may not survive the hype",
  "url": "https://www.theverge.com/22947686/donald-trump-truth-social-network-parler-gettr-ceo-interview",
  "date": "2022-02-23T18:30:00.000Z",
  "author": "Casey Newton",
  "content": "      <figure>      <img alt=\"American Conservative Union Holds Annual Conference In Florida\" src=\"https://cdn.vox-cdn.com/thumbor/yfT77TO6Kyh8rzyt6jCcKXDYdQQ=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70541518/1304610267.0.jpg\" />        <figcaption>Photo by Joe Raedle/Getty Images</figcaption>    </figure>  <p id=\"AFrjpS\">Today, let’s talk about some of the less obvious ways that conservative social networks keep slipping up — and whether Truth Social, which has the backing of President Trump, can manage to avoid their fate.</p><p id=\"jceC59\">First, the news: Truth Social is live in the App Store, and hit No. 1 this week on the most-downloaded chart for iOS. Here are <a href=\"https://www.washingtonpost.com/technology/2022/02/21/truth-social-app-donald-trump/?utm_campaign=wp_main&amp;utm_source=twitter&amp;utm_medium=social\">Bryan Pietsch and Jeff Stein in the <em>Washington Post</em></a>:</p><blockquote><p id=\"5nRABn\">The app says it is “America’s ‘Big Tent’ social media platform that encourages an open, free, and honest global conversation without discriminating against political ideology.” It was released in the App Store over the weekend and was updated late Sunday for “bug fixes.” (Truth Social’s website says it will be in the Google Play Store soon.) […]</p><p id=\"nse0j9\">Users signing up to Truth Social are greeted by a sign-up email that describes the platform’s clientele as “Truth Sayers.” “Share your unique opinion by posting a Truth, Re-Truth, photo, news story, or video link … Don’t be shocked if they take your Truth viral!” a welcome message states.</p></blockquote><p id=\"ivDWbU\">Truth Social also boasts one thing its rivals cannot: what seems to be <a href=\"https://nypost.com/2022/02/16/trump-teases-first-post-on-new-twitter-like-truth-social/\">at least one authentic post</a> from Trump himself. That helped to sparked a wave of signups that signals at least momentary curiosity into what Trump’s presence could mean for a social app in 2022.</p><p id=\"4hRB3H\">In the immediate term, Truth Social isn’t much of a threat to its rivals, because almost no one has been allowed to use the site. (I signed up after it had been live for a few hours, and am currently #192,640 on the waiting list.) CEO Devin Nunes told Fox News he intends for the site to be <a href=\"https://www.cnet.com/news/trumps-truth-social-debuts-in-apples-app-store/\">fully operational by the end of March</a>. But if it’s delayed beyond that point, it would <a href=\"https://www.washingtonexaminer.com/news/truth-social-delayed-despite-hype\">not be a first</a> for its parent company.</p><p id=\"VvbcQj\">What else is there to say about Truth Social? It’s based on technology from Mastodon, the open-source social network. Its parent company, Trump Technology &amp; Media Group, <a href=\"https://www.bloomberg.com/opinion/articles/2021-12-13/the-trump-spac-pipe-is-free-money\">hopes to go public this year through a lucrative SPAC</a>. Its terms of service document, like its user interface, <a href=\"https://www.protocol.com/newsletters/sourcecode/donald-trump-truth-social?rebelltitem=1#rebelltitem1\">appear to be largely copied and pasted from elsewhere</a>. It prohibits “false, inaccurate, or misleading content,” a policy whose successful enforcement would represent a first in the history of the internet.</p><p id=\"CRxb60\">Maybe regular posts from Trump will be enough to create a durable social network. Perhaps his return to constant assaults on his enemies, and attacks on democracy, will create something lasting.</p><p id=\"OMPwsn\">But another view is that we have already seen Trump-like networks rise and stagnate twice before. Trump was never on them, but many of his key allies are, and after splashy launches, both saw their growth slow significantly. And Truth Social may soon find itself stuck in the same ditch. </p><div id=\"bh2rK2\"><iframe src=\"https://www.platformer.news/embed\" width=\"480\" height=\"320\"  frameborder=\"0\" scrolling=\"no\"></iframe></div><p id=\"4Q0BM3\"></p><p id=\"QKSanC\">On Wednesday I found myself in conversation with the CEOs of Truth Social’s immediate precursors: George Farmer, <a href=\"https://www.wsj.com/articles/parler-names-george-farmer-as-ceo-as-it-returns-to-apples-app-store-11621268630\">who took over Parler last May</a> and has sought to revive the company’s fortunes after its app was deplatformed following the January 6th attack on the Capitol; and Jason Miller, former chief spokesman for the 2016 Trump campaign, <a href=\"https://www.reuters.com/world/us/former-trump-aide-miller-launches-social-media-site-gettr-2021-07-01/\">who now runs the app Gettr</a>.</p><p id=\"4aXXdP\">The occasion was Pivot MIA, the inaugural conference <a href=\"https://podcasts.voxmedia.com/show/pivot\">for Kara Swisher and Scott Galloway’s Pivot podcast</a>. And the core question was whether apps like these — run by Republicans, fixated on narrow ideas about “free speech,” pitched to people who feel alienated by more mainstream social networks — have a real future.</p><p id=\"k1ff6g\">(That’s separate from whether I personally find these apps to be good or compelling. “Run by Republicans, fixated on a narrow set of ideas, and pitched to people who feel alienated from the mainstream” — that’s also not a bad way to describe Fox News, <a href=\"https://www.nytimes.com/live/2021/05/05/business/stock-market-today\">which has been an economic miracle</a>. If you believe, as I do, that Fox News has been a malign force in American politics, I think you want to stay attuned to the rise of its potential successors.)</p><p id=\"6NeGwX\">When I sat down with Farmer and Miller, then, I hoped to get a sense of whether they see something I don’t in what often appear, on their surface, to be extremely basic Twitter clones. Browsing them again today, I was struck by how many posts from top influencers on Parler and Gettr are simply tweets that have been copied and pasted over.</p><p id=\"4u46Id\">I also wanted to know what they expected to happen when a new alternative network appeared that was endorsed by Trump himself. Parler and especially Gettr had been built in anticipation that the former president would take refuge there after being suspended from Twitter, Facebook, and YouTube in 2020; didn’t it sting, I asked the CEOs, that Trump had opted not to join them?</p><p id=\"1fF66Q\">Farmer told me that Parler is evolving into a less traditional social network, and would soon launch an NFT marketplace, and you can probably imagine the expression I have on my face as I type that sentence right now. “I don’t think Truth Social is really going to be competing in that space,” Farmer said of Parler’s NFT plans. <a href=\"https://www.dailymail.co.uk/news/article-10535427/Melania-Trump-releases-collection-NFTs-Presidents-Day.html\">We’ll see</a>!</p><p id=\"NfAJzL\">Miller, who worked closely with Trump and planned to meet him later on the day we spoke, told me he was still optimistic about the prospect of a presidential Gettr account. “I’m going to see the president this afternoon and make the pitch again, to say @realdonaldtrump, all reserved and ready for you,” Miller said Wednesday.</p><p id=\"0QSO55\">He added that the announcement of Truth Social had led to a surge in signups for Gettr, and attributed the phenomenon to growing disdain for deplatforming among the mainstream networks. “I always say, to kind of channel my inner George Bailey, that every time Twitter or Facebook kick someone off of their platform, another Gettr angel gets its wings,” he said.</p><p id=\"F1TgfH\">Perhaps it says something about the still relatively rare practice of deplatforming, then, that Parler and Gettr have relatively few angels in their ranks. Parler, which came as close as any of these apps have to <a href=\"https://www.platformer.news/p/was-parler-inevitable?utm_source=url\">achieving breakout success</a>, has had 11.3 million installations to date, according to Sensor Tower. Gettr, which launched last June, has 6.7 million. Daily users are presumably a small fraction of those numbers; lots of people took an early look but quickly churned, myself included.</p><p id=\"uPt9go\">So why didn’t they stay? Apps like these suffer a handful of core problems.</p><p id=\"TCDd0O\">One, they are marketed as social networks, but they operate like broadcast networks. Join either Parler or Gettr and you’re asked to follow a bunch of conservative commentators and publishers, who immediately dominate your timeline with the exact same stories you can find on Breitbart or any other Republican-leaning publication. There are few, if any, surfaces for average users to get positive attention on these apps.</p><div class=\"c-float-right\"><aside id=\"FFHEYv\"><q>There are few if any surfaces for average users to get positive attention</q></aside></div><p id=\"fkMGrE\">Moreover, as part of their efforts to distinguish themselves from Silicon Valley rivals — and to save money on hiring machine-learning engineers — Parler and Gettr have so far chosen not to create feeds ranked by engagement. That makes it even harder for average users to stand out when they make a clever observation — unless you’re posting constantly, like the commentator Dinesh D’Souza, anything you say will quickly be drowned out by the flood of influencer content. (Much of which, D’Souza’s included, has simply been pasted in from Twitter.)</p><p id=\"aFALvn\">That leads to these apps’ second problem: tttheir market is smaller than they think it is. To hear Farmer and Miller tell it, the world is desperate for a less restrictive approach to content moderation. But TikTok, the most popular social network around, is also arguably the most restrictive — <a href=\"https://www.platformer.news/p/tiktoks-safety-dance?utm_source=url\">certainly in terms of which posts are allowed to go viral</a>. The world is voting with its eyeballs, and the majority of people clearly prefer apps with robust moderation.</p><p id=\"cCo3Nn\">What makes the CEOs of alternative networks so sure that the world wants an alternative? Miller pointed to cases of political leaders and their supporters being suspended or having their posts removed in countries including Brazil and the United Kingdom, as well as countries like Iran and Saudi Arabia where political speech is highly suppressed.</p><p id=\"ty0i48\">“The free speech issue is going on all over the world, not just here,” Miller told me. “But if you’re not being discriminated against, you’re not going to see it. Because President Trump got kicked off and you <em>applauded</em> that — you like that. There were [74] million people who voted for him, who would say, that’s a shame, that’s terrible. So there are people all over the world who, I think, would have a strikingly different viewpoint.”</p><div class=\"c-float-right\"><aside id=\"t2TGMo\"><q>Their definition of free speech isn’t all that different from what already exists</q></aside></div><p id=\"qzOHjz\">I might be more inclined to believe that if Parler, Gettr, or Truth Social were <em>actual</em> free-speech maximalists, removing posts only when legally required to. But they’re not: Parler and Gettr both remove racial slurs, for example. And at least according to its TOS, Truth Social will remove anything that is “misleading” — a challenge that would be impossible even for a much larger company, and would remove far more content than Facebook, Twitter, or YouTube ever have.</p><p id=\"kO9i3l\">In practice, then, these companies resemble the Silicon Valley giants far more than they’re willing to admit. But for the moment they offer too little to differentiate themselves — beyond the fact that, if you lead an insurrection against the government, they won’t hold it against you.</p><p id=\"FHBIxD\">All of which means that their products are for people who want a Twitter-like thing, populated primarily by conservative political commentators talking about politics, and moderated a little less aggressively than Twitter itself. (Except in cases where it is moderated <em>more</em> aggressively, as with Truth Social’s stance on “misleading” content.)</p><p id=\"tlpdl3\">I do not think this will turn out to be a particularly large market.</p><p id=\"mekL1e\">These apps have other problems, of course. There are very few liberals posting on them, reducing the amount of polarized conflict that provides so much entertainment on Twitter in particular. Their business models are fuzzy and largely theoretical. They have so far failed to hire the kind of name-brand talent that helps social apps grow and make money.</p><p id=\"3bTarX\">With the arrival of Truth Social, though, believers in a conservative-led alternative to mainstream social networks can finally play a literal Trump card. Posts from the president will undoubtedly drive at least some level of media coverage, particularly as they are cross-posted onto Twitter by his supporters and detractors. That does make it feel different, and potentially more consequential, than its predecessors.</p><p id=\"aC2kkw\">But aside from those posts, Truth Social doesn’t look much different from its predecessors at all. It still looks to be structured for mostly one-way communication, broadcast primarily to an audience of Trumpist dead-enders.</p><p id=\"gmXj57\">Breaking out of that mold for these alternative networks would require a deeper understanding of what brought people together on apps like Facebook and Twitter to begin with. What we have seen from them so far, though, does not inspire much confidence.</p><p id=\"RBfeCc\"></p><p id=\"dqZGLC\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/TsXGi7ERC2V8lVsaB4NCIliGQHU=/0x49:3000x1620/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23265980/1304610267.jpg",
  "description": "Will a literal Trump card change anything?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}