{
  "title": "Why tech giants’ cash is a hidden source of greenhouse gas emissions ",
  "url": "https://www.theverge.com/2022/5/18/23124241/big-tech-financing-fossil-fuels-cash-investments-climate-change-emissions",
  "date": "2022-05-18T19:17:01.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Climate Activists Target Banks in Germany’s Financial Capital\" src=\"https://cdn.vox-cdn.com/thumbor/15GQnx3xZ_1C7O7lCLVPLWwy40E=/0x1:4000x2668/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70884392/1234653684.0.jpg\" />        <figcaption><em>Climate activists target banks in Germany’s financial capital.</em></figcaption>    </figure>  <p id=\"UD0cbd\">Even tech companies that have promised to slash their greenhouse gas emissions have a big climate-related blind spot, according to a new <a href=\"https://www.carbonbankroll.com/\">report</a> published by three environmental groups. With their cash and investments, Google, Apple, Meta, and other tech giants are indirectly financing fossil fuel companies. </p><p id=\"W7qbfd\">While these companies might have taken steps to cut down on pollution within<strong> </strong>their own operations and supply chains, the financial institutions they bank with still funnel Big Tech’s profits<strong> </strong>into heavily polluting industries. Emissions associated with that financial activity are so significant that they actually far exceed emissions from each company’s operations, the report finds. </p><div class=\"c-float-right\"><aside id=\"3zRAgM\"><q>Financial institutions they bank with still funnel Big Tech’s profits<strong> </strong>into heavily polluting industries</q></aside></div><p id=\"ZjaSqq\">That pollution has flown under the radar because it isn’t typically included in companies’ assessments of their emissions. But if emissions associated with the cash holdings for Google, Meta, Microsoft, and Salesforce <em>were </em>taken into account, it would increase their carbon footprints by between 91 and 112 percent, the report says.</p><p id=\"jH7dD6\">The problem stems from how banks decide to use their clients’ funds. When companies entrust banks with their cash, the banks put that money to work. The money might be used to finance energy projects or grant loans to other companies. The 60 biggest commercial and investment banks in the world have collectively invested $4.6 trillion in the fossil fuel industry since 2015, according to the report.  </p><p id=\"Hs8hn9\">Those kinds of investments result in more of the pollution that’s heating up the planet. Every $1 billion in cash that a bank puts to work is responsible for pollution comparable to the annual emissions from 27,398 vehicles, the report says. That figure is based on a 2021 <a href=\"https://www.carbonbubble.net/\">report</a> that estimates that the carbon intensity of the US financial sector is roughly equivalent to 126 thousand metric tons of carbon dioxide per billion dollars. Those emissions can stem from projects and companies funded by the financial sector, which might include things like utilities, mineral exploration, or even real estate and IT projects.</p><p id=\"TjrAwN\">The report, for the first time, estimates the financial carbon footprints of nine different tech and media companies: Google, Meta, Amazon, Apple, Microsoft, Salesforce, PayPal, Disney, and Netflix. Researchers got information on each company’s cash and investments from SEC filings. The report authors then matched that to established measures of carbon intensity for different kinds of investments to estimate each company’s financial footprint.</p><p id=\"w28riq\">Apple reported $191 billion in cash and investments to the SEC in 2021. The report estimates that those billions of dollars generated nearly 15 million metric tons of planet-heating emissions. That figure is three times as much climate pollution as the emissions generated from the use of every Apple product in the world that year, the report says. </p><p id=\"kG6Dqv\">By 2030, Apple <a href=\"https://www.theverge.com/2020/7/21/21332461/apple-carbon-neutral-2030-climate-change\">plans</a> to reduce its own carbon dioxide emissions by 75 percent. On its way toward that goal, the company has <a href=\"https://www.theverge.com/2022/4/14/23025064/apple-supply-chain-pollution-renewable-energy-climate-goals\">pushed hundreds of its suppliers</a> to reduce their own pollution. Companies like Apple that want to have a positive impact on climate change ought to think about applying the same pressure on banks, the report authors contend. </p><div class=\"c-float-right\"><aside id=\"twQl6h\"><q>“The lever we use the least turns out to be the most powerful tool we have”</q></aside></div><p id=\"kDu0UN\">The report was put together by the international Climate Safe Lending Network, the think tank The Outdoor Policy Outfit, and the Rockefeller family-founded BankFWD. The groups enlisted the help of finance data experts from the social enterprise South Pole, which advises companies on their sustainability goals. </p><p id=\"f8YOmD\">“The power of this report is that its data tell us that the lever we use the least turns out to be the most powerful tool we have–where and how we choose to bank,” Valerie Rockefeller, co-chair of BankFWD, said in a <a href=\"https://www.carbonbankroll.com/press-release\">press release</a>. “Bank choice is a largely untapped frontier for climate leadership with massive potential for impact.”</p><p id=\"yWH4x0\">Google, Netflix, and Microsoft declined to provide comment to <em>The Verge </em>on the record. The other companies did not provide a response by time of publishing. </p><p id=\"U2jzzq\">To see how each company’s financial carbon footprint stacks up, check out the <a href=\"https://static1.squarespace.com/static/6281708e8ff18c23842b1d0b/t/6283204b3556a5125ce13b37/1652760661661/The+Carbon+Bankroll+Report+%285-17-2022%29.pdf\">full report</a>.</p><p id=\"VmUFvN\"> </p><p id=\"oiwO8M\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/sN-YZvdHphSgzcYbBRHnScuO8Ck=/0x499:4000x2593/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23544810/1234653684.jpg",
  "description": "They’re indirectly financing fossil fuels.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}