{
  "title": "Why fossil fuel companies see green in Bitcoin mining projects ",
  "url": "https://www.theverge.com/2022/5/4/23055761/exxonmobil-cryptomining-bitcoin-methane-gas",
  "date": "2022-05-04T12:00:00.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"US-ENERGY-OIL-CRYPTOCURRENCY-COMPUTERS\" src=\"https://cdn.vox-cdn.com/thumbor/2LuFxbo7dOF_2UbfKplTIzPmHLc=/360x0:4248x2592/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70830385/1240300988.0.jpg\" />        <figcaption><em>A Bitcoin mining site powered by otherwise lost gas from an oil well near Linden, Texas, on April 4th, 2022.</em> | Photo by FRANCOIS PICARD/AFP via Getty Images</figcaption>    </figure>  <p id=\"m4rXZy\">Of all the <a href=\"https://www.theverge.com/23036346/earth-day-corporate-climate-change-goals-greenwashing\">corporate climate hype</a> floating around this spring, ExxonMobil’s secret project to cut down its pollution by mining Bitcoin has to rank up there as one of the strangest. </p><p id=\"2Yn3Ms\">Exxon launched a pilot project in 2021 to mine Bitcoin in North Dakota’s Bakken oil fields, according to <a href=\"https://www.cnbc.com/2022/03/26/exxon-mining-bitcoin-with-crusoe-energy-in-north-dakota-bakken-region.html\">reporting by CNBC in March</a>. The US’s biggest oil and gas company is also thinking about doing the same in Alaska and parts of Nigeria, Argentina, Guyana, and Germany, <a href=\"https://www.bloomberg.com/news/articles/2022-03-24/exxon-considers-taking-gas-to-bitcoin-pilot-to-four-countries?sref=z97LigUM\"><em>Bloomberg</em> reported</a>. And it’s not alone. Other oil companies, <a href=\"https://www.cnbc.com/2022/02/15/conocophillips-is-selling-extra-gas-to-bitcoin-miners-in-north-dakota.html\">including ConocoPhillips</a> in North Dakota, see the energy-hungry cryptocurrency as a way to offload some of their climate footprint and maybe make some cash in the process. The US has become the <a href=\"https://ccaf.io/cbeci/mining_map\">biggest hub</a> for Bitcoin mining globally, so this could be a growing trend.   </p><div class=\"c-float-left\"><aside id=\"aRBNbW\"><q>A persistent gas problem</q></aside></div><p id=\"iPMMoY\">The story of how fossil fuel companies turned to the dirtiest cryptocurrency out there as a way to green up their books starts with a persistent gas problem. Whenever any company drills for oil, it often pushes some methane gas out of the ground, too. Methane is an even more potent greenhouse gas than carbon dioxide. If a company lets that methane escape into the atmosphere, which they are embarrassingly frequently <a href=\"https://news.stanford.edu/2022/03/24/methane-leaks-much-worse-estimates-fix-available/\">guilty of doing</a>, methane would trap heat with 80 times as much power as CO2 over the next 20 years. Yikes.</p><p id=\"K1DUsy\">Oil companies will often reinject some of that gas into the ground — not out of the goodness of their hearts but to keep up the pressure that drives oil up out of wells. </p><p id=\"10uhfo\">But there isn’t always enough room to put the excess gas back in the ground. The alternative? Light it on fire. Burning the methane, called “flaring” in industry-speak, releases CO2. When it comes to the climate, this is a harm reduction approach. Not releasing gas in the first place would be best — but releasing CO2 is marginally better than letting more potent methane float up into the atmosphere.</p><p id=\"NCtpxg\">The downside to this — apart from adding to a climate crisis that’s <a href=\"https://thehill.com/changing-america/sustainability/climate-change/565626-new-study-says-global-warming-could-kill-83/\">killing people</a> and making entire communities <a href=\"https://apnews.com/article/climate-united-nations-paris-europe-berlin-802ae4475c9047fb6d82ac88b37a690e\">unlivable</a> — is that burning methane is kind of like rolling up a wad of cash and smoking it. You see, methane’s marketing nickname is “natural gas.” More than <a href=\"https://blogs.edf.org/energyexchange/2022/02/28/new-rystad-cost-analysis-makes-case-for-epa-to-end-routine-flaring-in-final-methane-rule/\">$1 billion</a> in natural gas goes up in smoke every year in the US through flaring.</p><div class=\"c-float-right\"><aside id=\"gzCBKG\"><q>More than <a class=\"ql-link\" href=\"https://blogs.edf.org/energyexchange/2022/02/28/new-rystad-cost-analysis-makes-case-for-epa-to-end-routine-flaring-in-final-methane-rule/\" target=\"_blank\">$1 billion</a> in natural gas goes up in smoke every year in the US through flaring</q></aside></div><p id=\"ro57ge\">All that gas could be put to use as electricity, but that would require building out infrastructure. And it appears that fossil fuel companies might be willing to take those losses rather than spend the (<a href=\"https://blogs.edf.org/energyexchange/2022/02/28/new-rystad-cost-analysis-makes-case-for-epa-to-end-routine-flaring-in-final-methane-rule/\">surprisingly affordable</a> amount of) money and time to build pipelines to get that gas to market. A more attractive option is to put that gas to work on-site near the oil well so there’s no need to build a new pipeline to make use of the gas.</p><p id=\"bp5w5q\">This is where Bitcoin reenters the chat. The Bitcoin network uses about as much electricity in a year as the country of <a href=\"https://ccaf.io/cbeci/index/comparisons\">Malaysia</a>. Miners solve ever more complex puzzles to mint new Bitcoin, which requires special hardware and a whole lot of electricity. Luckily for Exxon and companies like it, Bitcoin mining rigs can be set up pretty much anywhere there’s a cheap, abundant power source — like, say, an oil field where Exxon has so much extra gas it’s just burning it up willy-nilly. </p><p id=\"5PFtZu\">Here’s where we finally get to Exxon’s potential climate argument for mining Bitcoin. Exxon is working with a company called Crusoe, according to CNBC, whose sole purpose is to help fossil fuel companies deal with their waste gas by using it for cryptomining or other computing projects. It’s “on a mission to align the future of computation with the future of the climate,” it says on its website.</p><p id=\"DYNSe4\">Crusoe crunched its own <a href=\"https://www.crusoeenergy.com/blog/3MyNTKiT6wqsEWKhP0BeY/understanding-the-problem-crusoe-solves\">numbers</a> and came to the conclusion that cryptomining cuts down CO2 emissions by a whopping 63 percent compared to flaring. Crusoe says that’s because its system is much more effective at burning off all methane. Flares, it figures, only combust 93 percent of the methane it’s supposed to burn. The rest escapes into the atmosphere. Crusoe’s cryptomining system, on the other hand, uses up 99.89 percent of the methane. </p><p id=\"wdMtym\">Crusoe did not respond to interview requests from <em>The Verge</em>. Exxon media relations advisor Sarah Nordin declined to “comment on rumors and speculation regarding the project” in an email to us. </p><div class=\"c-float-left\"><aside id=\"sfrC2J\"><q>“Probably one of the worst case scenarios for an infrastructure project”</q></aside></div><p id=\"2zaYtj\">Exxon’s decision to use the waste gas for Bitcoin rather than finding some other more practical use “is actually probably one of the worst case scenarios for an infrastructure project,” says Paasha Mahdavi, an assistant professor of political science at the University of California, Santa Barbara. </p><p id=\"t2TKhS\">It might be different if Exxon was getting its waste gas to the grid where it might serve an arguably more important purpose like heating and lighting homes. Then that excess gas would displace pollution that would have otherwise come from intentionally drilling for gas elsewhere. But that’s not really the case when Exxon mines Bitcoin with waste gas.</p><p id=\"hzOTo6\">“Better to be doing something of use with [the gas], rather than just flaring it to no one’s benefit,” says Jon Goldstein, a senior director at the Environmental Defense Fund. “But at the same time, it seems like [cryptomining is] not really a use that’s going to do much good for society at large. It’s going to benefit investors in cryptocurrency.” </p><p id=\"ECGl9H\">Other experts are more skeptical that this is actually an answer to the problem of waste gas. “This is basically a way to monetize flaring. It’s not a way to stop flaring,” Mahdavi says. </p><p id=\"bn8zoD\">Mahdavi also cautions that Exxon could potentially make itself <em>look</em> like it’s cutting down pollution <em>on paper</em> when it’s really just moving those emissions from its own books straight onto someone else’s. Whenever Exxon flares waste gas, that’s part of the company’s carbon footprint. But if another company burns the gas from Exxon’s oil fields for Bitcoin mining, who do the associated greenhouse gas emissions get assigned to — the Bitcoin miners or Exxon? The answers are still murky, Mahdavi says.</p><p id=\"JXDqvK\">There’s one last catch with Exxon’s cryptomining, and it’s a big one. Enabling fossil fuel companies to profit off waste gas, unsurprisingly, gives them good reason to keep on drilling, Mahdavi and environmental economist Raphael Calel write in a 2020 <a href=\"https://www.pnas.org/doi/10.1073/pnas.2006774117\">paper</a>. </p><p id=\"y1lD2b\">“There’s now potentially an incentive to increase your drilling because you’re getting a higher return,” Calel says. “All you’re going to get is an incentive for overproduction so that you get this extra benefit downstream.” </p><p id=\"EzDyja\"></p><p id=\"yekCHI\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/BZdljrBbt8tBl6oCCnckcDKqe6g=/0x90:4608x2503/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23435975/1240300988.jpg",
  "description": "They have a gas problem.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}