{
  "title": "Why blackouts are dangerous to Ukraine’s nuclear sites",
  "url": "https://www.theverge.com/2022/3/10/22970665/ukraine-chernobyl-blackouts-nuclear-power-plants",
  "date": "2022-03-10T22:40:56.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Zaporizhzhia Nuclear Power Plant\" src=\"https://cdn.vox-cdn.com/thumbor/gDfmypmVC7dT1tfaZbvMzg4GYyI=/0x2:5982x3990/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70606303/1161467054.0.jpg\" />        <figcaption>The sun sets over the horizon highlighting the electricity pylons of the Zaporizhzhia Nuclear Power Plant, Enerhodar, Zaporizhzhia Region, southeastern Ukraine, July 9, 2019.&nbsp; | Photo credit should read Dmytro Smolyenko/Future Publishing via Getty Images</figcaption>    </figure>  <p id=\"XT526N\">Russia’s invasion of Ukraine is increasingly threatening the vital connections between Ukraine’s nuclear power plants and the electric grid. The nuclear sites rely on outside electricity to keep critical safety systems running — but those links are fraying as reports come in about power lines damaged during the conflict. </p><p id=\"RzYAuf\">Fuel at nuclear sites generates tremendous heat. Without cooling systems, which typically rely on an external power source to run, that fuel could melt down and catastrophically release radioactive materials. There are several layers of <a href=\"https://www.theverge.com/2022/3/2/22958029/russia-invasion-ukraine-unprecedented-risk-nuclear-power-plants\">backup systems that would need to fail</a> for such a worst-case scenario to go down. But fighting and power losses in Ukraine have experts increasingly worried about the country’s nuclear sites in the long run. The ongoing conflict has also affected radiation monitoring, communications, and long-term maintenance and cleanup efforts at nuclear power plants across Ukraine.</p><div class=\"c-float-right\"><aside id=\"tK4s9Z\"><q>Those links are fraying as reports come in about power lines damaged during the conflict</q></aside></div><p id=\"w6EHly\">“Even though the danger may not be acute right now, the steady degradation of safety support systems [at Chernobyl] is a growing concern,” Edwin Lyman, director of nuclear power safety at the Union of Concerned Scientists, wrote in an email to <em>The Verge</em>.</p><p id=\"GFwwQR\"><a href=\"https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste\">Chernobyl</a>, the site of the worst nuclear power plant disaster in history, lost power yesterday after transmission lines failed. Zaporizhzhia, Ukraine’s largest operating power plant and the site of an <a href=\"https://www.theverge.com/2022/3/4/22960816/ukraine-nuclear-power-plant-fire-russia-zaporizhzhia\">alarming fire</a> last week, has also suffered damage to two of four power lines that supply power to the station. </p><p id=\"LVXSc4\">Luckily, so far, the International Atomic Energy Agency (IAEA) <a href=\"https://twitter.com/iaeaorg/status/1501545859468742664\">reported</a> that it “sees no critical impact on safety” as a result of the power loss to Chernobyl. Zaporizhzhia has not lost power, but conditions there have grown more worrisome in the six days since it was seized by Russian troops. </p><p id=\"sT77Fy\">Disruption to any nuclear site’s power supply is cause for concern. Electricity from the grid is one of the “indispensable <a href=\"https://www.iaea.org/newscenter/pressreleases/iaea-director-general-grossis-initiative-to-travel-to-ukraine\">pillars</a> of nuclear safety” that the IAEA outlined for Ukraine last week. Electricity keeps fuel at safe temperatures, preventing a meltdown. And it powers key maintenance and monitoring systems for radioactive materials.<strong> </strong>Here are three major components at Ukraine’s nuclear sites that need to stay powered up:</p><p id=\"MJFobX\"><strong>Cooling Pools</strong></p><p id=\"I2hl66\">Russian forces seized Chernobyl soon after it began its invasion of Ukraine in late February. The sites’ biggest vulnerability since then, experts tell <em>The Verge</em>, is a cooling pool for spent fuel. It holds much of the fuel from three shuttered reactors that kept running long<strong> </strong>after the fourth reactor at the plant exploded in 1986. </p><p id=\"L5z6Op\">Even spent fuel can generate enough heat to trigger a disastrous meltdown, so it’s usually kept in cooling pools for years. Such pools typically rely on an outside power source to pump water back and forth from the pool — keeping the water surrounding the spent fuel cool and clean. That also prevents the water from evaporating and exposing the fuel it’s supposed to protect. </p><p id=\"ZTTAyX\">Thankfully, Chernobyl’s cooling pool is likely safe for now regardless of the power outage, experts say, because the fuel it holds has had a lot of time to cool down. “The heat load of the spent fuel storage pool and the volume of cooling water contained in the pool is sufficient to maintain effective heat removal without the need for electrical supply,” the IAEA said in a <a href=\"https://www.iaea.org/newscenter/pressreleases/update-8-iaea-director-general-statement-on-situation-in-ukraine\">statement</a> on March 3rd after Chernobyl lost partial power.</p><p id=\"FEjoJC\">Zaporizhzhia also has cooling ponds.<strong> </strong>A fire broke out at the plant on March 4th after the nuclear power plant was <a href=\"https://www.iaea.org/newscenter/pressreleases/update-10-iaea-director-general-statement-on-situation-in-ukraine\">shelled</a>, in what some officials <a href=\"https://twitter.com/iaeaorg/status/1499776877258551296\">described</a> as the first time a functioning nuclear power plant has ever been attacked. The fire was eventually put out, and there was no damage to the nuclear reactors’ safety systems, <a href=\"https://www.iaea.org/newscenter/pressreleases/update-11-iaea-director-general-statement-on-situation-in-ukraine\">according to the IAEA.</a> But IAEA Director General Rafael Mariano Grossi said it was a “<a href=\"https://www.iaea.org/newscenter/statements/iaea-director-generals-introductory-statement-to-the-board-of-governors-7-march-2022\">close call</a>.”<strong> </strong>Either shelling or an uncontrolled fire<strong> </strong>could sever the plant’s connections to the grid. </p><div class=\"c-float-right\"><aside id=\"4ALtgG\"><q>“From day to day, we are seeing a worsening situation”</q></aside></div><p id=\"lmUOH4\"><strong>Chernobyl’s Sarcophagus </strong></p><p id=\"uClJrO\">The remains of the reactor that blew up at Chernobyl is another concern. It’s encased by a giant steel dome that was completed in 2017. That $1.7 billion structure was built to replace a decaying “sarcophagus” that was hastily built after the 1986 disaster to sequester 200 metric tons of radioactive material that remains. A ventilation system inside the dome, which needs electricity, prevents the kind of corrosion that ate away at what’s left of the reactor and old sarcophagus, <a href=\"https://twitter.com/clairecorkhill/status/1501543224556544005\">according to Claire Corkhill</a>, chair in nuclear material degradation at The University of Sheffield.</p><p id=\"dBp3dJ\">Ukraine’s national power grid operator, Ukrenergo, has <a href=\"https://www.facebook.com/npcukrenergo/posts/327958616039637\">called</a> for a ceasefire around Chernobyl so that it can repair transmission lines and restore power from the grid. The site has diesel generators with enough fuel for the site’s operations to last for <a href=\"https://snriu.gov.ua/en/news/chornobyl-npp-facilities-current-situation-10-march-2022-1500\">48 hour</a>s, but that time is beginning to run out. </p><p id=\"ue9mHW\">“From day to day, we are seeing a worsening situation at the Chernobyl NPP, especially for radiation safety, and for the staff managing the facility under extremely difficult and challenging circumstances,” Grossi said in a March 9th <a href=\"https://www.iaea.org/newscenter/pressreleases/update-16-iaea-director-general-statement-on-situation-in-ukraine\">statement</a>. “I repeat my urgent appeal to the forces in effective control of the plant to respect internal radiation protection procedures, to facilitate the safe rotation of staff and to take other important steps to ensure safety.”</p><p id=\"lsiujY\"><strong>Active reactors</strong></p><p id=\"HvdEDW\">Grossi also called attention to worsening conditions at Zaporizhzhia. “This is another example of where the safety pillar to secure off-site power supply from the grid for all nuclear sites has been compromised,” he said. As an active power plant, the fuel there — both in its reactors and cooling ponds for spent materials — is hotter than at Chernobyl. That makes it even more important for its cooling systems to be connected to the grid. </p><p id=\"50da7Q\">There are still two remaining high voltage power lines, plus another standby line, that connect Zaporizhzhia to the grid. Zaporizhzhia usually supplies about 20 percent of Ukraine’s electricity. Now, just two of the plant’s six nuclear reactors are generating power. Other reactors were shut down as a safety measure — they’ll require less water for cooling but still need some external power source to run their cooling systems. That’s another reason why a reliable grid is crucial for nuclear power plants — they can’t<strong> </strong>rely on their own power when their reactors shut down.</p><p id=\"ZmK8Xe\">Wrangling nuclear power in a war zone was always going to be complicated, but to make things even trickier, Ukraine typically gets about <a href=\"https://www.nei.org/resources/statistics/top-15-nuclear-generating-countries\">half</a> of its electricity from nuclear power plants. That raises the stakes of keeping Ukraine’s nuclear power plants safe and operational. </p><p id=\"8PcHXb\">This is the first time war has broken out in a place with a power grid so reliant on nuclear energy, according to the IAEA.</p><aside id=\"KEg6nc\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Battle at Ukraine’s largest nuclear power plant raises global alarm \",\"url\":\"https://www.theverge.com/2022/3/4/22960816/ukraine-nuclear-power-plant-fire-russia-zaporizhzhia\"}]}'></div></aside><aside id=\"yGB1xq\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Ukraine’s nuclear power plants are at ‘unprecedented’ risk as fighting continues \",\"url\":\"https://www.theverge.com/2022/3/2/22958029/russia-invasion-ukraine-unprecedented-risk-nuclear-power-plants\"}]}'></div></aside><aside id=\"N92zWj\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"What does Russia’s invasion of Ukraine mean for Chernobyl? \",\"url\":\"https://www.theverge.com/2022/2/24/22949329/russia-invasion-ukraine-chernobyl-nuclear-reactor-radioactive-waste\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/hp8H-jSoEq2ETt5MZuedFpctcz8=/0x430:5982x3562/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23304693/1161467054.jpg",
  "description": "Chernobyl lost power.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}