{
  "title": "Why Netflix is starting to crack down on password sharing",
  "url": "https://www.theverge.com/22983315/netflix-password-account-sharing-test-streaming",
  "date": "2022-03-17T18:17:16.000Z",
  "author": "Catie Keck",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/beo8Jd2hLSe_ShvKwaGjC417Kbg=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70636822/acastro_181101_1777_netflix_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"YXgpSI\">Netflix has for years ignored the fact that many of us are mooching off our friends’ and families’ accounts. But the streaming king now appears to be reconsidering its look-the-other-way policy, a shift that comes as Netflix’s growth slows and its annual production budget for churning out new hits creeps ever higher. In other words, Netflix needs more money.</p><p id=\"NKf2i8\">The company this week announced that it’s testing a <a href=\"https://www.theverge.com/2022/3/16/22981283/netflix-password-sharing-test-multiple-streams\">password-sharing crackdown</a> that could curb the number of accounts mooching off account holders outside their own households. As part of this test, Netflix will soon offer users in Chile, Costa Rica, and Peru the ability to add up to two additional members to their Netflix membership as sub-accounts. In Costa Rica, this will cost about $3 on top of the monthly cost of Netflix. </p><p id=\"L22unj\">Netflix has for years been <a href=\"https://www.cnbc.com/2016/10/17/your-shared-netflix-password-is-safe-the-ceo-says.html\">extremely lax</a> about password sharing, with Netflix boss Reed Hastings <a href=\"https://techcrunch.com/2016/01/11/netflix-ceo-says-account-sharing-is-ok/\">going so far</a> as to call it a “positive thing” in the past. While Netflix <a href=\"https://help.netflix.com/legal/termsofuse\">technically prohibits</a> users from sharing accounts “with individuals beyond your household,” the company has only indicated in <a href=\"https://www.theverge.com/2021/3/11/22325831/netflix-password-sharing-test-feature-piracy-security-streaming-video\">the last year or so</a> that it might be exploring ways to <a href=\"https://www.hollywoodreporter.com/tv/tv-news/netflix-boss-assures-he-wont-turn-the-screws-on-password-sharing-4169650/\">gently enforce</a> a shared-account crackdown, mostly through stray tests like the one announced this week. </p><div class=\"c-float-right\"><aside id=\"o4sngQ\"><q>“Netflix has let it go for a long, long time”</q></aside></div><p id=\"1hVmVW\">But something feels different about this new test, as the latest experiment arrives at a critical moment for the company. Netflix has long enjoyed explosive subscriber growth, but recently, that’s <a href=\"https://www.theverge.com/2022/1/20/22893419/netflix-price-increase-q1-2022-earnings\">started to wane</a>. Balanced against its astronomical content budget numbering in the tens of billions, Netflix <em>needs</em> to get creative about how it’s bringing in cash. Going full hall monitor on shared accounts is certainly one way to do it, especially since Netflix has in many households cemented itself as an essential service.</p><p id=\"EULiUl\">“Netflix has let it go for a long, long time,” analyst Richard Greenfield of LightShed Partners tells <em>The Verge</em>, speaking to Netflix’s past ambivalence to shared accounts. “When something becomes so important to your daily life, it makes it easier and easier to crack down on things like password sharing.”</p><p id=\"XdzkAx\">That’s a key difference between Netflix and some of its scrappier rivals who are arguably competing to be a supplement to, rather than a direct competitor of, the top dogs in streaming. Like everybody else, Netflix is continuing to <a href=\"https://www.theverge.com/2022/1/20/22893419/netflix-price-increase-q1-2022-earnings\">jack up its prices</a> to help offset its costs, with its <a href=\"https://www.theverge.com/2022/1/14/22884263/netflix-price-increases-2021-us-canada-all-plans-hd-4k\">latest price hikes</a> set to go into effect later this month. But while everybody else in the streaming sandbox is <a href=\"https://www.theverge.com/2022/3/9/22967831/disney-plus-ads-hbo-max-hulu-streaming\">introducing ad tiers</a> to lure subscribers (and soften the blow to wallets), Netflix has yet to follow suit.</p><div class=\"c-float-right\"><aside id=\"Rd7NG3\"><q>Netflix has long looked the other way when it comes to account sharing — but that’s changed</q></aside></div><p id=\"9TrDkx\">Cracking down on account sharing, then, offers an alternate route for Netflix to add paying members. Greenfield says that password crackdowns could be one way Netflix adds another 10 to 20 million subscribers in its US market, for example.</p><p id=\"VEV2k4\">“This is this is how you close that remaining gap,” he says.</p><p id=\"5Y7MUW\">It’s worth bearing in mind that Netflix is still calling this a “test” for now. Netflix hasn’t fully pulled the rug out from underneath those of us lucky enough to have an ex or grandparent who doesn’t mind sharing their password — and it’s possible Netflix will land on some alternative strategy over booting us from the accounts of people outside of our own households. Bringing the hammer down on shared accounts does risk pushing away its own users, which is not ideal for any streamer competing for attention right now. </p><p id=\"7St6wa\">But at the same time, password crackdowns have long seemed like an assured outcome in streaming. Streamers aren’t cranking out content out of the goodness of their hearts. However the current streaming dustup shakes out, its users themselves who’ll be paying the tab for their streaming diet.</p><p id=\"Vvtqoy\"><em>Disclosure: </em>The Verge<em> is currently producing a series with Netflix.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z7NKhXwT3kSZUT8D0tQmI_Moz74=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13370033/acastro_181101_1777_netflix_0001.jpg",
  "description": "It’s still a test — for now, at least.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}