{
  "title": "Why we can’t record mobile phone calls — and why we should be able to ",
  "url": "https://www.theverge.com/23037242/phone-call-record-iphone-android-tapping-privacy-apps",
  "date": "2022-04-22T17:27:11.000Z",
  "author": "Barbara Krasnoff",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/G6lzx0ku-QmtTm3U7N6PebrUSEc=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70781533/akrales_180314_2358_0006.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"J9DAu5\">Several years ago, I had to deal with a situation that may be familiar to a lot of people: I was slammed with a series of high medical bills that had been denied by the insurance company. The doctor was in network, but according to the insurance company, his bills were coded wrong. Or wait, his facilities weren’t in network or… well, you get the idea. It took over a year and many phone calls to iron out the issue — and I wouldn’t have gotten through it had I not been able to record each phone call I made with the insurance company and the various medical facilities involved. </p><p id=\"JUC9UW\">Today, it would be nearly impossible.</p><p id=\"ifbVq9\">Federal law in the US says that you can legally record a phone conversation, <a href=\"https://www.justia.com/50-state-surveys/recording-phone-calls-and-conversations/\">but only if you are taking part in that conversation</a>. State laws differ. While most states generally follow the federal guidelines, some require all parties to consent to the recording, rather than just one. You know how, when you’re calling a business, you get a recording that tells you that your call may be recorded? That’s why.</p><div class=\"c-float-right\"><aside id=\"LKB6xL\"><q>An individual’s right to privacy can be severely impacted if their phone calls are recorded without their knowledge</q></aside></div><p id=\"z5WkoN\">And, of course, there are reasons for those restrictions. <a href=\"https://www.dmlp.org/legal-guide/recording-phone-calls-and-conversations\">An individual’s right to privacy</a> can be severely impacted if their phone calls are recorded without their knowledge, which is why warrants are usually needed for a <a href=\"https://www.findlaw.com/criminal/criminal-rights/do-the-police-have-the-right-to-tap-my-telephone.html\">law enforcement authority</a> to tap a suspect’s phone <em>and</em> why those statements that your call may be recorded (mentioned above) are necessary. </p><p id=\"2QB6O3\">Wary of legal ramifications, and completely ignoring the needs of their customers, both Apple and Google have made it nearly impossible to record any calls made by their phones in the US. Google is about to put the nail in its phone-recording coffin by <a href=\"https://www.theverge.com/2022/4/21/23036078/google-android-call-recording-apps-accessibility-loopholes-play-store-rules\">clamping down on its Accessibility API</a>, the last method third-party app developers had for getting around its restrictions. Without that, Android users in the US may have only one way of recording calls (short of rooting their phones): use Google Voice to record incoming calls. However, Voice does not let you record outgoing calls — even though it announces the call is being recorded when it is switched on.</p><p id=\"lyKHmH\">Options for iPhone users seem to be equally limited.</p><p id=\"TNjniM\">There are still apps that will, according to their description, record your phone calls. These generally use three-way calling in which the third party is the recording service provided by the developer. I haven’t personally tried any of these, but, from what I could tell, most of them tend to be costly and quirky — and you’d better trust the company that’s doing the recording.</p><div class=\"c-float-left\"><aside id=\"V5k0SW\"><q>Why should businesses be able to casually record any conversation that occurs while I cannot?</q></aside></div><p id=\"COMTrC\">Which means that, unless I am in a place where I can (a) use my phone on speaker and (b) set up a separate recorder, I have no way of recording an outgoing phone call. Instead, I need to go back to the old-fashioned method of grabbing the nearest piece of paper and scribbling notes as fast as I can, hoping that I get everything right. And I have no way of offering a recording or a transcript of a call to an insurance company or other business, no way of making sure I have a record of my doctor’s instructions, and no way of recording my elderly relative’s unexpected remembrance of an old family story. </p><p id=\"HdsQwR\">This is incredibly frustrating. Why should businesses be able to casually record any conversation that occurs while I cannot? I’m perfectly happy to have an app announce to all parties that a conversation is being recorded — as long as I can then get that conversation on the record.</p><p id=\"15f1UF\">I can only be grateful that, for a short time, I, as an individual, was able to use a simple technology to track my important phone conversations so that I could prove that I didn’t owe several thousands of dollars in medical bills. Perhaps in this time of security cameras, drones, and other, more invasive possible privacy violations, Google and Apple will one day rethink their policies. But I’m not going to hold my breath.</p><p id=\"SRFvJ5\"></p><p id=\"pm6dvG\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ojdymkD0v-412wSI0JsNFGpke6A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10431679/akrales_180314_2358_0006.jpg",
  "description": "It’s become impossible for individuals to record phone calls.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}