{
  "title": "Windows 11 is getting new touch gestures, Start menu folders, and much more",
  "url": "https://www.theverge.com/2022/2/16/22937573/microsoft-windows-11-start-menu-folders-new-touch-gestures-features",
  "date": "2022-02-16T18:48:24.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/XS0ZSojt2wLWtw4tKudST6rWB4s=/0x4:1129x757/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70517611/Start_Folders.0.png\" />        <figcaption><em>New Start menu folders.</em> | Image: Microsoft</figcaption>    </figure>  <p id=\"8VFD2A\">Microsoft is bringing new touch gestures, Start menu folders, a redesigned Task Manager, and lots more improvements to Windows 11. A new build of Windows 11 is <a href=\"https://blogs.windows.com/windows-insider/2022/02/16/announcing-windows-11-insider-preview-build-22557/\">available to testers today</a>, and it’s full of new features that look like they will significantly improve the usability of Windows 11 overall.</p><p id=\"QUrUZX\">The new Start menu folders will allow Windows 11 users to customize the pinned section of the Start menu into folders. You drag an app on top of another to create a folder, and you can rearrange apps within folders and remove them. The ability to rename folders is coming in future test builds, but it’s good to see more customization on the Start menu, given Windows 11 launched without many ways to tweak the menu design.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/STyWdN2Uad_mqe3xNU6MJYXLky4=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250062/Start_Folders.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>New Start menu folders</em></figcaption>  </figure><p id=\"LTqJKR\">If you’ve always been a fan of the gestures in Windows 8, Microsoft is bringing five new touch gestures to Windows 11 soon that will make using tablets a little easier. The first is the ability to swipe up on the taskbar to bring up the Start menu and swipe down to dismiss it again. You’ll also be able to swipe between pinned, all apps, and recommended / more on the Start menu.</p><p id=\"K6Ivib\">The third new touch gesture lets you swipe from the bottom right of the taskbar to show the Quick Settings menu — useful if you need to toggle airplane mode quickly or access Bluetooth settings. The animations for bringing up the Notification Center have also been improved, and there’s a new full-screen gripper in touch-oriented apps that will stop you accidentally swiping from the edges of a tablet screen. Microsoft also says rotating your device between portrait and landscape orientation is getting “snapper” and “more responsive.”</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/pYvph2jiXM2bnX4a6TwkOgijaIE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250064/Invoking_Start_.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>One of the new touch gestures coming to Windows 11.</em></figcaption>  </figure><p id=\"b8Jwjf\">Microsoft’s new Snap Layouts feature in Windows 11 is also getting improved, allowing you to drag an app to the top of a window and reveal all the layouts you can use. Microsoft is also improving its Focus feature to include a Do Not Disturb mode. It makes it a lot easier to quickly silence notifications, so you only see priority ones or ones for alarms. </p><p id=\"sPftqM\">Live Captions will soon be built into Windows 11, accessible from a Winkey + CTRL + L shortcut. Live Captions will greatly benefit people who are deaf or hard of hearing, but they’re also available for anyone to use and will be automatically generated on-device from any content that includes audio. Captions can float in a window or be displayed at the top or bottom of a screen. This looks like a great accessibility improvement to Windows 11.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VN3v4k3R81MUe1sbpgMr_corSe0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250067/SnapLayoutsWIP_resized.gif\">      <cite>Image: Microsoft</cite>      <figcaption><em>New Snap Layouts feature.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/W-3D0cuXlj6iIETEcKMLZf42IbU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250068/LiveCaptions_WIPBlog_1x.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>Live Captions will be available for anything with audio.</em></figcaption>  </figure><p id=\"qWrEEw\">Other improvements on the way include the ability to drag and drop on the Windows 11 taskbar. This was a big missing part of the initial launch, so Windows 11 users will be happy to see this return. Microsoft is also making it easier to see your OneDrive storage within File Explorer and improving the Quick Access feature to let you pin files as well as folders.</p><p id=\"6UFJdN\">In a push to reduce energy consumption on PCs, Microsoft is also changing the default values for sleep and screen off in the power settings in Windows 11. You’ll only see these new settings if you clean install Windows 11, but new PCs in the future will presumably ship with more aggressive sleep / screen off options.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/-o9mAbEKBA8OfYnXReK67gNkLiE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23250073/task_manager1.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>The Task Manager is getting a dark mode.</em></figcaption>  </figure><p id=\"6zmwh7\">Last but not least, the Task Manager redesign in Windows 11 is now official. It includes a new command bar and a dark theme, alongside an efficiency mode that lets you limit apps from consuming system resources.</p><p id=\"1oRzQt\">As always, these new Windows 11 features are only in testing right now, which means some of them will likely show up in monthly updates throughout 2022. Microsoft just delivered <a href=\"https://www.theverge.com/2022/2/15/22934562/microsoft-windows-11-february-2022-update-android-apps-taskbar-improvements\">Windows 11’s first big update</a>, and the company revealed it won’t wait to bring new features just once a year.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/wx2xrw5mLvqhyBIRDLn3F650ZsM=/0x85:1129x676/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23250062/Start_Folders.png",
  "description": "A new test build includes lots of new features.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}