{
  "title": "Windows 11’s big February update finally brings back the time and date on multiple monitors",
  "url": "https://www.theverge.com/22927661/microsoft-windows-11-taskbar-clock-date-multiple-monitors",
  "date": "2022-02-10T19:11:09.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"A user types on the Surface Pro 8 keyboard. The screen displays Microsoft Teams on a blue and white background.\" src=\"https://cdn.vox-cdn.com/thumbor/2SKu5nP-rUHgiGhcB-iFIbnxDk8=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70494170/bfarsace_211004_4777_0011.0.jpg\" />        <figcaption>Photo by Becca Farsace / The Verge</figcaption>    </figure>  <p id=\"RFhcgI\">If, like me, you’ve missed the taskbar time and date on multiple monitors in Windows 11, you’ll be pleased to hear it’s returning. Microsoft is finally bringing this functionality back after shipping Windows 11 last year without the ability to see the time or date on secondary displays.</p><p id=\"rLpJxf\">“We added the clock and date to the taskbars of other monitors when you connect other monitors to your device,” <a href=\"https://blogs.windows.com/windows-insider/2022/02/10/releasing-windows-11-build-22000-526-to-beta-and-release-preview-channels/\">reads the release notes</a> for a new Windows 11 build that has just been released to Release Preview testers. It’s good to see one of the many missing taskbar features returning to Windows 11, but there are still <a href=\"https://www.theverge.com/2021/9/14/22673266/microsoft-windows-11-taskbar-features-missing-design-changes\">plenty more that Microsoft needs to address</a>.</p><p id=\"tvwG8H\">Microsoft already <a href=\"https://www.theverge.com/2022/1/26/22902477/microsoft-windows-11-update-android-apps-preview-taskbar-notepad-media-player\">promised a larger than usual update to Windows 11</a> in February, and it looks like it’s now close to rolling out to everyone. The update also includes a public preview of Android apps for Windows 11, redesigned Notepad and Media Player apps, and a number of other taskbar improvements. The weather widget will return to the taskbar in this update, and a new mute / unmute feature in the taskbar will be available for Microsoft Teams calls. You’ll also be able to quickly screen share a specific app or window from the taskbar directly into a Microsoft Teams call.</p><p id=\"ZXGRVf\">Microsoft hasn’t revealed exactly when this latest Windows 11 update will be available for everyone, but given it’s in Release Preview, it should be a matter of days before it rolls out more broadly. Microsoft is now planning to <a href=\"https://www.theverge.com/2022/2/3/22916118/microsoft-new-windows-11-features-experiment-test\">test new experimental Windows 11 features throughout 2022</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/W-pXAJ_g7pdm6JJbO0Eydbt3iws=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22900768/bfarsace_211004_4777_0011.jpg",
  "description": "This update also includes more taskbar changes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}