{
  "title": "Windows 11 is getting the Xbox HDR calibration app and better windowed gaming",
  "url": "https://www.theverge.com/2022/2/17/22938703/windows-11-xbox-hdr-calibration-app-windowed-gaming-optimizations",
  "date": "2022-02-17T10:57:38.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/5_mhN43GCNAwdC2MATPx0CEUI4k=/0x96:2276x1613/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70519897/Surface_Laptop_Studio___Gaming.0.jpg\" />    </figure>  <p id=\"l86fSz\">Microsoft’s big <a href=\"https://www.theverge.com/2022/2/16/22937573/microsoft-windows-11-start-menu-folders-new-touch-gestures-features\">upcoming feature list for Windows 11</a> includes some important optimizations and improvements behind the scenes for PC games. The software giant is planning to bring its Xbox HDR Game Calibration app to Windows 11, and make older games run with less input lag, Auto HDR, and Variable Refresh Rate (VRR) if they’re running windowed instead of fullscreen.</p><p id=\"H8naco\">The upcoming Windows HDR Calibration app will allow PC gamers to improve color accuracy and consistency of an HDR display, just like on Xbox. It will include three test patterns to calibrate HDR efficiently, and Windows 11 testers <a href=\"https://devblogs.microsoft.com/directx/windows-hdr-calibration-app/\">will be able to access the app soon</a> ahead of its general release.</p><p id=\"dbaVW5\">Windows 11 <a href=\"https://www.theverge.com/2021/3/17/22336240/microsoft-windows-10-auto-hdr-pc-gaming-directx-11-12\">shipped with the Auto HDR feature</a> from the Xbox Series X / S consoles, and Microsoft is now making some optimizations for windowed games that will allow them to support Auto HDR and VRR. The optimizations can also “significantly improve latency” for older games running in windowed mode, according to Microsoft.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/crnjWq3JGKTwnFcT_QfKf7zxVOs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23251758/System_OWG_On.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>New optimizations for windowed games feature in Windows 11.</em></figcaption>  </figure><p id=\"wgiorQ\">A new “Optimizations for windowed games” setting will appear in the graphics part of the Windows 11 Settings interface, and it will apply to older DirectX 10 and DirectX 11 games. While you’ve typically had to run games in fullscreen in the past to get all the latency and performance benefits, Microsoft has made changes to DirectX in both Windows 10 and now Windows 11 to boost games running in windowed mode.</p><p id=\"xK0ivx\">“This new optimization specifically applies to Windowed and Borderless-Windowed games because when you’re running in Fullscreen, <a href=\"https://devblogs.microsoft.com/directx/demystifying-full-screen-optimizations/\">a similar optimization already exists</a>, and this new setting brings a consistent experience no matter which mode you are running in,” <a href=\"https://devblogs.microsoft.com/directx/updates-in-graphics-and-gaming/\">explains Hannah Fisher</a>, a program manager in the graphics and DirectX team at Microsoft. “You don’t need to worry about DirectX 12 games as they already take advantage of the new presentation mode.”</p><p id=\"107ke4\">These new optimizations essentially upgrade how a game is presented on a display to a more modern model. This is known as the modern flip-model, and while lots of games already use this, thousands don’t. Bungie is only just <a href=\"https://www.bungie.net/en/Explore/Detail/News/50975\">moving <em>Destiny 2</em> to this modern flip-model</a> with the upcoming <em>Witch Queen</em> expansion next week, allowing players to get the same performance in windowed mode and enable HDR.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/PIzcy-0fTwnLj8_Q4sRZjFKvQHQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23251762/PerApp_OWG_Checked.png\">      <cite>Image: Microsoft</cite>      <figcaption><em>You can opt out of these new optimizations if there are any issues.</em></figcaption>  </figure><p id=\"5c4uyD\">While features like this sound promising for older games, there could be bugs and issues. Microsoft is allowing PC gamers to opt into these optimizations in test builds of Windows 11 this week, and you’ll even be able to exclude specific games or apps if you notice any issues. “We disable apps that have known issues on default to ensure that you have the best settings without having to do much guesswork on what might be wrong,” says Fisher. </p><p id=\"cM3Ndm\">Microsoft has only just started testing these new gaming additions to Windows 11, so it may be months before they’re fully available to all users. The software maker <a href=\"https://www.theverge.com/2022/2/15/22934562/microsoft-windows-11-february-2022-update-android-apps-taskbar-improvements\">revealed earlier this week</a> that it’s now planning to deliver new Windows 11 features more regularly, instead of a big annual drop full of changes.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vBmIkSLe9GvTB4LXb2lbMYL4leA=/0x258:2276x1450/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22871771/Surface_Laptop_Studio___Gaming.jpg",
  "description": "Microsoft is improving old games on Windows 11.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}