{
  "title": "With its Pixel Watch and tablet, Google is getting serious about its own ecosystem ",
  "url": "https://www.theverge.com/2022/5/13/23070484/google-ecosystem-pixel-watch-tablet-hardware-software",
  "date": "2022-05-13T15:00:00.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Mev7s5t13rUo6JebNuj8y6M-NuM=/150x0:1770x1080/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70865371/Google_Pixel_Watch_1.0.png\" />        <figcaption><em>The Pixel Watch, Google’s first smartwatch. </em> | Image: Google</figcaption>    </figure>  <p id=\"kl07vr\">This year’s Google I/O keynote was filled with hardware announcements, which is unusual considering it’s typically a software and services-focused affair. Of these, the most exciting was the news that Google plans to <a href=\"https://www.theverge.com/2022/5/11/23065055/google-android-tablet-pixel-io-release-date\">return to the Android tablet market</a> next year and that it’s also releasing its first smartwatch — the <a href=\"https://www.theverge.com/2022/5/11/23064072/google-pixel-watch-fitbit-io-2022\">Pixel Watch</a> — later in 2022. </p><p id=\"bTPE6g\">Google gave a couple of different reasons for its change of heart. But the most interesting of these was a comment from Google’s VP of product management Sameer Samat, who talked about the benefits a tablet device could have for the Pixel ecosystem more generally. “I think consumer expectations have changed as well over time,” Samat said. “Phone is certainly super important, but it’s also becoming very clear that there are other device form factors which are complementary and also critical to a consumer deciding which ecosystem to buy into, and which ecosystem to live [in].”</p><div class=\"c-float-right\"><aside id=\"tH57hQ\"><q>“There are other device form factors which are complementary and also critical to a consumer deciding which ecosystem to buy into”</q></aside></div><p id=\"hfmkuL\">In other words, building a Pixel tablet (and a Pixel Watch) isn’t just important because Google wants customers to buy these specific devices. It’s also important if Google wants them to buy into the Pixel ecosystem as a whole. Pixel phones themselves aren’t going to stop being important, but Google wants people to know that, once they’ve bought a Google smartphone, there’s an array of accessories like smartwatches, earbuds, and tablets that are designed to pair perfectly with it. And after they’ve bought the perfect Pixel accessory, there’s a good chance they’ll stick with the smartphone brand for their next upgrade.</p><p id=\"jxAHsi\">It’s a similar approach to the “<a href=\"https://www.wsj.com/articles/iphone-airpods-macbook-you-live-in-apples-world-heres-what-you-are-missing-11622817653\">walled garden</a>” that Apple has used (often aggressively) to turn itself into a $2 trillion company. iPhones can hand off numerous common tasks to Macs, which can be used to control iPads, which work best with AirPods. Apple Fitness workouts can be controlled on an Apple Watch and beamed to your Apple TV. iMessage requires you and all your friends to use iPhones. You get the idea. </p><p id=\"oJfUlZ\">Apple believes so strongly in its ecosystem that it’ll sometimes prioritize its walled garden over the quality of its individual products. The <a href=\"https://www.theverge.com/2018/2/6/16976906/apple-homepod-review-smart-speaker\">HomePod is a case in point</a>: designed only to work with iPhones, it would have objectively been more useful, and probably sold more units, if it had let you stream over Bluetooth rather than just Apple’s own AirPlay standard. But, as <a href=\"https://twitter.com/benedictevans/status/955894189719412736\">analyst Benedict Evans observed</a> at the time, the purpose of the HomePod was likely never to sell in huge numbers but simply to offer any iPhone owners that bought it yet another reason to stick with Apple for their next phone purchase. </p>  <figure class=\"e-image\">        <img alt=\"bottom of the homepod\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/v73gKeKp86l8dqLyufpV4zk2q_Y=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10159623/jbareham_180202_2266_0191.jpg\">      <cite>Photo by James Bareham / The Verge</cite>      <figcaption><em>The bottom of Apple’s HomePod.<span class=\"ql-cursor\">﻿</span></em></figcaption>  </figure><p id=\"JC05J9\">I don’t think for a second that Google would ever plan to build the same kinds of walls around its garden. The company’s core advertising business relies on working at a scale that outdoes even a massive company like Apple, and this open approach has allowed Android to control an estimated 75 percent of the global smartphone market. For years Google has been working to make Android phones work better with Windows, and Wear OS is <a href=\"https://wearos.google.com/wearcheck/\">designed to be compatible with iOS</a>. The release of a Google-branded smartwatch and tablet won’t change that.</p><p id=\"m7ksPK\">Google’s approach is likely to be subtler, similar to the approach Apple uses with its AirPods. Wear OS is already at its best when it’s paired with an Android phone. And Google’s software is often designed to be cross-compatible, like how <a href=\"https://www.theverge.com/2019/10/9/20903281/chromebook-os-android-apps-how-to-use\">ChromeOS offers support for running Android apps</a>. But after years of leaving hardware to other companies, Google’s focus seems to be shifting to a combined hardware and software approach. The Pixel Watch will almost certainly work across Android devices (iPhone support is <a href=\"https://9to5google.com/2022/05/12/pixel-watch-android-support-iphone/\">less clear</a>), but I’d be very surprised if it didn’t work <em>best</em> with Pixel phones. </p><p id=\"1uuYp0\">But now it appears to be finding the limits of this approach, not least because it’s butted up against the ecosystem ambitions of certain other companies. I’m talking here about Samsung, the biggest manufacturer of Android tablets and, <a href=\"https://www.theverge.com/2021/5/18/22440483/samsung-smartwatch-google-wearos-tizen-watch\">as of last year</a>, the highest profile Wear OS smartwatch manufacturer. But despite using Google’s operating systems, Samsung’s devices have always nudged their users toward Samsung’s own ecosystem.</p><div class=\"c-float-left\"><aside id=\"VuGENw\"><q>“The Galaxy Watch 4 all but forces you into Samsung’s ecosystem”</q></aside></div><p id=\"kdDo5u\">Take last year’s Galaxy Watch 4, which saw Samsung finally use Wear OS on one of its smartwatches rather than its own Tizen operating system. But although it appeared to be embracing Google’s ecosystem, in practice the smartwatch’s loyalty was always to Samsung’s. It used Samsung Pay rather than Google Pay, Bixby rather than Google Assistant, and came packed with Samsung apps like Calendar, Calculator, and Contacts rather than Google’s equivalents. It can sync settings from Samsung’s phones and uses Samsung’s system for auto-switching Galaxy-branded earbuds. </p><p id=\"SIKWs1\">“If you’re a Samsung user, the Galaxy Watch 4 is an excellent smartwatch. If you’re not, the Galaxy Watch 4 all but forces you into Samsung’s ecosystem,” my former colleague <a href=\"https://www.theverge.com/22629459/galaxy-watch-4-classic-review-bixby-google-wearos\">Dieter Bohn said in his review</a>.</p><p id=\"sK996U\">It’s the same with tablets. When my colleague <a href=\"https://www.theverge.com/23014720/samsung-galaxy-tab-s8-s8-plus-tablet-android-review\">Dan Seifert reviewed the Tab S8</a> earlier this year, he found numerous convenient features that only really mattered for users with other Samsung devices. Galaxy Buds would automatically switch between the tablet and a Samsung phone, and the tablet could also turn on the phone’s mobile hotspot feature. “After years of not seeing a great reason to buy an Android tablet, I have to admit that Samsung has presented a compelling pitch this time around — provided you are already in the Samsung Android ecosystem,” he wrote.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/j2GwVXV7xfvWxunI_TchxeykTOE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23028663/dbohn_210816_4717_0005.jpg\">      <cite>Photo by Dieter Bohn / The Verge</cite>      <figcaption><em>Samsung’s watch, Google’s Wear OS, Samsung’s ecosystem.</em></figcaption>  </figure><p id=\"NatZPY\">Samsung’s approach neatly shows off where the incentives are for consumer tech companies these days. Sure, they could design their products to integrate seamlessly with all of Google’s hardware, apps, and services. Or, if you’re the biggest smartphone manufacturer in the world, you could try using some of that install base to your own benefit, encouraging your existing customers to pick up a smartwatch or tablet to complement their phone. And who’s going to think about switching to a Google Pixel or a OnePlus once they’re kitted out with a full array of Samsung tech?</p><p id=\"h4b8T2\">Since the inception of its Pixel lineup, Google has tried to pair a limited hardware focus with broad software support. But ecosystems are important, and, in 2022, if you don’t control both your hardware and software, then you’re going to let another company do it better — and maybe even park its platform right on top of yours. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vztwGP7fw5SuqtFUfNC3WpXOS4U=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23449170/Google_Pixel_Watch_1.png",
  "description": "Gardens aren’t built on software alone.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}