{
  "title": "Withings adds new diary feature to its sleep mat",
  "url": "https://www.theverge.com/2022/3/18/22983254/withings-sleep-mat-diary-tracking",
  "date": "2022-03-18T12:00:00.000Z",
  "author": "Victoria Song",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/uy3Dy3GDA9v7CaI6RZRFhgXkBp4=/148x0:3949x2534/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70640136/KV1_3.0.png\" />        <figcaption>Image: Withings</figcaption>    </figure>  <p id=\"JszL3A\">While Withings isn’t a stranger to wrist-based sleep tracking, the company announced today that it’s adding a new diary feature to its most novel sleep monitoring gadget — the Withings Sleep mat. </p><p id=\"JgmRlm\">The mat, which is placed under a person’s mattress, automatically collects biometric sleep data like heart rate, sleep stages, and snoring. The new Sleep Diary feature allows users to combine their own observations along with the data collected from the mat. That information is then compiled into a new dashboard that aggregates sleep data over time. Users can then generate a PDF report that can be shared with doctors.</p><p id=\"kJ3cHr\">According to Withings’ press release, the diary feature was developed with the input of sleep physicians and is based on medical questionnaires such as the <a href=\"https://www.uofmhealth.org/conditions-treatments/brain-neurological-conditions/epworth-sleepiness-scale#:~:text=The%20Epworth%20Sleepiness%20Scale%20is,(high%20chance%20of%20dozing).\">Epworth Sleepiness Scale</a> and the <a href=\"http://www.stopbang.ca/\">STOP-Bang Questionnaire</a>. The Epworth Sleepiness Scale is a self-administered survey that’s commonly used by doctors and sleep clinics to evaluate a person’s daytime sleepiness. Meanwhile, the STOP-Bang Questionnaire is a <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0143697\">widely used screening tool</a> for obstructive sleep apnea. Neither can diagnose a person with a specific sleeping disorder, and both are used to identify whether a patient should receive further testing.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/xXu-vkGK7x_BrfUxjmxwdPEWWgw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23324692/KV3_1.png\">      <cite>Image: Withings</cite>  </figure><p id=\"FiowgX\">Manual sleep diaries are a common tool in sleep research but are subjective by their nature. Withings claims its take could be helpful, as it combines personal observations with data collected from the mat. Of course, that also depends on how accurate the Withings Sleep’s metrics are. I tested <a href=\"https://www.pcmag.com/reviews/nokia-sleep\">an older version of the mat</a> back during that weird time when all of Withings’ products were under the Nokia umbrella. At the time, my experience was that the mat was about as accurate as a Fitbit. That said, the <a href=\"https://gizmodo.com/does-my-smartwatchs-sleep-tracker-actually-do-anything-1838290221\">jury’s out on how accurate sleep trackers actually are</a>. Withings spokesperson Ian Twinn told <em>The Verge </em>in an email that while the hardware is the same, there have been several updates since Nokia sold its digital health business back to Withings. </p><p id=\"8QdzsG\">Several wearable makers have been working on methods to detect and diagnose conditions like sleep apnea, <a href=\"https://gizmodo.com/fitbit-really-wants-to-be-able-to-diagnose-your-sleep-a-1841027997\">including Fitbit</a>. Withings also got <a href=\"https://www.theverge.com/2021/10/12/22722333/withings-fda-clearance-blood-oxygen-heart-rhythm\">FDA clearance for its ScanWatch</a> to detect nighttime breathing disturbances using its SpO2 sensor late last year. This new Sleep Diary feature isn’t quite on that scale, but it does seem to be a more useful method for people hoping to track long-term sleep patterns over time. Currently, most sleep trackers — whether they’re based on the wrist or not — aren’t the best at giving users a bird’s eye view of their sleeping patterns beyond a week or two at a time. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6ju-2iw9VtRcOOScTmpwv3MsdyI=/0x195:4096x2340/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23324696/KV1_3.png",
  "description": "In case you wanted further proof you’re not sleeping well",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}