{
  "title": "Wordle will be free forever because you can right-click to save the whole game",
  "url": "https://www.theverge.com/2022/2/1/22912711/wordle-web-save-download-webpage-local-personal",
  "date": "2022-02-01T19:38:48.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/7fTctMyybOvYkYlvsLH6gakxmjE=/23x0:794x514/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70458846/wordle_right_click_save.0.jpg\" />    </figure>  <p id=\"LTX4Vf\"><a href=\"https://www.theverge.com/22892044/wordle-free-game-online-how-to-puzzle\">Wordle is the pandemic game we didn’t know we needed</a>, so there’s understandably some fear that <a href=\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\">its brand-new owner</a>, <em>The New York Times</em>, will eventually ruin it somehow.</p><p id=\"PsT4zY\">But as technologist Aaron Rieke brilliantly explains <a href=\"https://twitter.com/aaronkbr/status/1488550337304739840\">in a Twitter thread</a>, there’s little chance of that — because Wordle <a href=\"https://www.powerlanguage.co.uk/wordle/\">is a webpage</a>, and webpages can be saved. You could download a complete copy of the game <em>right now</em> that contains all the answers, cycles to the proper new puzzle each day, and still comes with the same “Share” button so you can share <a href=\"https://www.theverge.com/tldr/22881995/wordle-emoji-results-auto-generated-tell-a-story\">those all-important little squares</a> with fellow players. </p><div id=\"8uqP5Z\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">So you could save copy of the website right now, *unplug your computer from the internet,* and play Wordle every day for years.<br><br>2/x</p>— Aaron Rieke (@aaronkbr) <a href=\"https://twitter.com/aaronkbr/status/1488550339276165123?ref_src=twsrc%5Etfw\">February 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"z12ZQd\">I checked real quick on my Windows desktop, and sure enough, <em>right-click &gt; save as</em> created a complete copy of Wordle on my desktop, just like any other webpage I might save for offline use. I double-clicked the icon to launch it in my web browser, and it loaded today’s word. </p><p id=\"HJ7PDk\">It doesn’t retain my previous progress, just like the web version doesn’t keep your streak intact when you move from playing Wordle in a desktop browser to playing Wordle on a phone — but you could theoretically start building a new one if you want, and I wouldn’t be surprised if someone figures out a way to import progress as well.</p><p id=\"FSrVXb\">Where will you play Wordle next? It sounds like there may soon be plenty of options in addition to the one <em>The</em> <em>New York Times </em>suggested will “initially” be free. Because every web browser comes with instructions on how to download webpages for offline use — <a href=\"https://support.google.com/chrome/answer/7343019?hl=en&amp;co=GENIE.Platform%3DAndroid\">here’s Google Chrome</a>, <a href=\"https://support.mozilla.org/en-US/kb/how-save-web-page\">Mozilla Firefox</a>, <a href=\"https://support.microsoft.com/en-us/topic/how-to-make-web-pages-available-for-offline-viewing-aa1ada53-1572-562b-c7bc-73fe0845105a\">Microsoft Edge</a>, and <a href=\"https://support.apple.com/guide/safari/save-part-or-all-of-a-webpage-ibrw1089/mac\">Apple Safari for Mac</a>. And while I haven’t tried two days in a row to see if it loads the next word, it sure looks to me like <a href=\"https://support.apple.com/en-us/HT200294\">the Reading List</a> you’ll find in the iOS copies of Chrome, Safari, and Firefox save a working offline copy of Wordle, too.</p><p id=\"P93XGw\">There’s an intriguing question here over whether this might be copyright infringement, so I’m not going to necessarily recommend you do any of the above — but saving webpages for offline use is a time-honored feature of all these browsers, and places like <a href=\"https://web.archive.org/web/*/https://www.powerlanguage.co.uk/wordle/\">the Internet Archive</a> do it consistently and continuously for much of the public web. So I expect that <em>The New York Times</em> will make it easier on everyone and keep Wordle free forever.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/Wo3v_Ft0PtLpFspw_Hzjqbt50CU=/0x44:815x471/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23210335/wordle_right_click_save.jpg",
  "description": "Future answers are preserved no matter what the NYT does.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}