{
  "title": "Wordle players, fear not: The New York Times says the ‘vast majority’ of win streak stats have now been carried over",
  "url": "https://www.theverge.com/2022/2/11/22929229/wordle-new-york-times-streak-stats-issues",
  "date": "2022-02-11T21:53:04.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"Wordle Photo Illustrations\" src=\"https://cdn.vox-cdn.com/thumbor/p-PcF2_VqJl1ZJDnzXCTQU3dO1w=/0x0:3543x2362/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70499972/1238243590.10.jpg\" />        <figcaption><em>It sounds like your streaks should be safe.</em> | Photo illustration by Jakub Porzycki/NurPhoto via Getty Images</figcaption>    </figure>  <p id=\"abgBiC\"><em>The New York Times’ </em>version of <em>Wordle</em> <a href=\"https://www.nytimes.com/games/wordle/index.html\">launched Thursday</a>, but just like most big video game launches these days, <a href=\"https://www.theverge.com/2022/2/10/22927898/wordle-new-york-times-version-website-statistics-cookies\">it’s been messy</a>. While there have been reports of a few different issues, perhaps the most egregious was that some win streaks weren’t carried over from the old <em>Wordle</em> URLs to the <em>Wordle</em> URL on the <em>Times</em>, despite what <a href=\"https://help.nytimes.com/hc/en-us/articles/360029050872-Word-Games-and-Logic-Puzzles#h_01FVGCB2Z00ZQMDMCYWBPWJNXB\">was promised</a> after the <em>Times</em> announced it was <a href=\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\">buying the popular word puzzle</a> from creator Josh Wardle. We asked the <em>Times</em> what’s been going on, and spokesperson Jordan Cohen shared details about how it has been fixing things.</p><p id=\"DJxCYS\">Shortly after Thursday’s launch, the <em>Times</em> identified a problem affecting users’ current streak information. “For these users, their Current Streak was being reset to one after successfully completing Thursday’s <em>Wordle</em> following the redirect,” Cohen wrote in an email to<em> The Verge.</em> He said the <em>Times</em> deployed a fix around 7PM ET on Thursday. “We confirmed this solution is working for users who visited <em>The New York Times’s Wordle</em> page after the fix was released; i.e., their Current Streak was not being reset to one.”</p><p id=\"XmwBcE\">That wasn’t the only problem, though. “We then shifted our focus to addressing the Current Streak reset issue for users who visited <em>Wordle</em> between 2:30 p.m. E.T. and 7 p.m. E.T,” Cohen said. “Later that evening, we released a fix that addressed this set of users, and confirmed that it worked for users in that state. This fix does require that users successfully complete Friday’s <em>Wordle</em>. It may also require them to refresh their browser.”</p><div class=\"c-float-right\"><aside id=\"KEgljg\"><q>The “vast majority” of players should now have their stats and streaks carried over</q></aside></div><p id=\"izQIHR\">As of Friday, the <em>Times</em> believes “stats and streaks should be carried over for the vast majority” of players, according to Cohen, but he did note that “we are seeing some reports of users continuing to have issues, and are investigating and engaging with these users.”</p><p id=\"Ag73cv\">Cohen also noted that your stats are stored in local storage on your devices — the <em>Times</em> doesn’t have them. “This data was not stored by Josh Wardle, and is not stored by The New York Times,” he said. “The data exists in local storage on the user’s device, associated with the browser they use to play the game, and the URL at which they play the game.”</p><p id=\"ONECZW\">If you are still having problems with your stats and streaks, Cohen offered a few tips (emphasis his): </p><blockquote><p id=\"0YcMPO\">In order to preserve stats and streaks, it is necessary for users to <em>first open the old URL last used to play Wordle</em>. This will automatically redirect them to The New York Times Wordle page, carrying their stats and streaks with them. If users go directly to The New York Times Wordle page without a redirect, their stats and streaks <em>will not go with them</em>.</p><p id=\"BbeDOj\">For users who are not seeing the stats and streaks they expect, the first things to try are:</p><p id=\"FSCBcM\">Make sure you are using the same device and browser you normally use to play Wordle.</p><p id=\"hkzYX4\">Go to the original URL you used to play Wordle, and you will be redirected.</p></blockquote><p id=\"1PCiRy\">There are a couple of additional issues that users have run into as well. Some <em>Wordle</em> users reported being stuck on a blank page after being redirected to the <em>Times’</em> <em>Wordle</em> page, and the <em>Times</em> has reached out to people who emailed <a href=\"mailto:nytgames@nytimes.com\">nytgames@nytimes.com</a> with troubleshooting steps. “We are seeing promising results,” Cohen said.</p><div class=\"c-float-right\"><aside id=\"hHMrYj\"><q>Some users are seeing a repeat puzzle</q></aside></div><p id=\"1BizzM\">He added that some <em>Wordle</em> players may experience a repeat of the same puzzle on Friday after they’ve already solved it. Solving the same puzzle again won’t “meaningfully affect [users’] streaks,” according to Cohen, but may give you an extra “solve” for free. </p><p id=\"7sX2B7\">If you’re still experiencing problems, it might be best to contact the <em>Times</em> directly. It does seem intent on getting the problems solved — after all, there’s nothing quite as intimidating as strongly worded emails from annoyed word puzzle players. </p><p id=\"xkMONK\"></p><p id=\"MGWZpg\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/6vlMCIfKg0uFgy-QtaPivZr3_OE=/0x254:3543x2109/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23236297/1238243590.jpg",
  "description": "The NYT has made some fixes.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}