{
  "title": "Wordle rip-offs are running rampant on the App Store again",
  "url": "https://www.theverge.com/2022/3/2/22958907/wordle-rip-offs-app-store-apple-new-york-times-word-game-moderation",
  "date": "2022-03-02T23:01:40.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gzf4mWL6HKA7s3Nir8cvCyo97Nc=/0x0:1500x1000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70572064/wordle.0.png\" />    </figure>  <p id=\"K3KC4D\">The Wordle clones are back on the App Store, just a few weeks after Apple wiped out nearly all the copycat games in January. </p><p id=\"f1EJa9\">A quick glance at the top free apps on the App Store reveals at least two prominently placed Wordle-alikes, while diving into Apple’s more specific word games category (or simply searching “Wordle”) surfaces plenty of other copycats, many of which appear to have been part of Apple’s first wave of takedowns a few months ago. </p><p id=\"SgwhYh\">None of the new games are actively passing themselves off as Wordle — at least, not in name<em>.</em> Instead, the clones have creatively rebranded to “Wordus,” “Word Guess,” “Wordl,” and other thinly veiled references to the original game. But all of them offer some variant on Wordle’s gameplay, down to the same gameplay, UI, design, and color scheme. </p><p id=\"copycats\">Apple encourages developers to not copy other games. In section 4.1 of <a href=\"https://developer.apple.com/app-store/review/guidelines/#copycats\">its App Store Guidelines</a>, the company advises developers to “Come up with your own ideas” and not to “simply copy the latest popular app on the App Store, or make some minor changes to another app’s name or UI and pass it off as your own.” </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/na0wJ4p7xzDap-LZ4_x-d-C49HQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23284081/wordle_2.png\">  </figure><p id=\"pYfqnB\">Muddying the waters is the fact that Wordle isn’t actually on the App Store — the game was first released by original creator Josh Wardle and hosted on his website before it was bought by <em>The New York Times</em>, which currently hosts the game. The <em>Times</em> hasn’t added Wordle to its official Crossword app (where many of the company’s other daily puzzle games live), either. </p><p id=\"potHrt\">But whether the Wordle clones technically do or don’t violate the App Store Guidelines is almost irrelevant. The past decade-plus of the App Store’s history — including Apple’s own takedown of the Wordle clones earlier this year — <a href=\"https://www.theverge.com/2020/6/18/21296180/apple-hey-email-app-basecamp-rejection-response-controversy-antitrust-regulation\">have made clear</a> that the company has the power to put its foot down on whatever apps it wants. Apple, after all, is still the sole arbiter of what is and isn’t allowed on the App Store, subject to guidelines that it writes and enforces entirely on its own. </p><p id=\"czkVZX\">The question then isn’t whether Apple <em>can</em> remove Wordle clones again, but <em>should</em> it? </p><aside id=\"jNz0At\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The App Store clones are here to profit off Wordle’s success\",\"url\":\"https://www.theverge.com/2022/1/11/22878752/wordle-app-store-review-copies-advertisements-in-app-purchase\"},{\"title\":\"The Wordle clones have disappeared from the App Store\",\"url\":\"https://www.theverge.com/2022/1/11/22879295/wordle-clones-app-store-removal-online-backlash-copycats\"}]}'></div></aside><p id=\"O39IJK\">The situation around Wordle copycats has changed dramatically since the last slew of takedowns, too. In January, Wordle was a cute game that a lone creator released on his own as a gift for his partner, something that was explicitly not being monetized. “It’s not trying to do anything shady with your data or your eyeballs,” Wardle had commented in <a href=\"https://www.nytimes.com/2022/01/03/technology/wordle-word-game-creator.html\">a <em>New York Times</em> profile</a> at the time. “It’s just a game that’s fun.”</p><p id=\"fzYRWr\"><a href=\"https://www.theverge.com/2022/1/12/22880353/wordle-copycat-creator-apology-word-game-app-store-apple\">A lot of the outrage</a> over Wordle copycats (all of which either added advertisements, optional in-app purchases, or subscription fees) in the court of the public seemed to stem from that narrative: greedy developers trying to make a quick buck off this rare, pure thing on the internet.</p><p id=\"j25YzO\">Flash-forward to March 2022, and Wordle isn’t simply “a game that’s fun” anymore. It’s a major property that Wardle sold to <em>The New York Times</em>, one of the largest media companies on the planet, in a seven-figure deal. </p><p id=\"WR4e7B\">Is it Apple’s responsibility to defend a multi-billion dollar corporation (with its own teams of lawyers) from copycats? Should Apple have even taken action back when it was a single developer who was uninteresting in monetizing his work? </p><p id=\"SeG1eD\">Right now, it’s not clear what happens next. When asked by <em>The Verge</em> about Wordle clones, <em>The New York Times</em> declined to comment for this story. Apple did not respond to a request for comment by publication time either. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/pwg933039aCffDmH0JrK44_IQr4=/0x108:1500x893/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23284080/wordle.png",
  "description": "The Wordle clones are back.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}