{
  "title": "Workers at Nintendo’s third-party repair partner were reportedly overwhelmed with Joy-Con repairs ",
  "url": "https://www.theverge.com/2022/4/24/23039777/workers-nintendo-third-party-repair-facility-were-reportedly-overwhelmed-with-joy-con-repairs",
  "date": "2022-04-24T22:59:57.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/rz5AWxQqiSag7EwdvYORHBwDmwI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70788089/jbareham_180301_2346_nintendo_switch_0148.0.jpg\" />        <figcaption>Photo by James Bareham / The Verge</figcaption>    </figure>  <p id=\"TEjybS\">Workers at Nintendo’s third-party repair facility reportedly faced a “very stressful” work environment caused by a deluge of Switches sent in for issues related to Joy-Con drift, according to a report from <a href=\"https://kotaku.com/nintendo-switch-joy-con-drift-fix-repair-center-replace-1848828886\"><em>Kotaku</em></a>. A former supervisor at the New York-based United Radio, the company that partners with Nintendo to repair broken devices, told <em>Kotaku</em> that the large volume of Joy-Con repairs resulted in a high turnover rate and “lots of” mistakes.</p><p id=\"dJHwl2\">United Radio is its own company — Nintendo merely acts as the middleman, handling customer communications and leaving the repairing to United Radio, which serves Nintendo customers located in the eastern half of the US. The ubiquity of Joy-Con drift led to “easily thousands” of Joy-Cons that passed through United Radio in a single week, and prompted the company to set up a workstation dedicated to Joy-Con repair, the former supervisor told <em>Kotaku</em>.</p><p id=\"X8FvpH\"><a href=\"https://www.theverge.com/21504741/nintendo-switch-joy-con-drift-problem-explained\">Joy-Con drift is a widespread issue</a> that causes the controllers to input movement when there is none, which often manifests itself as your character moving around on-screen when you’re not touching your thumbsticks. Although many Switch owners hoped the <a href=\"https://www.theverge.com/games/22711889/nintendo-switch-oled-review\">newer OLED model</a> would fix Joy-Con drift, the issue still persists and <a href=\"https://www.theverge.com/2021/10/7/22715467/nintendo-joy-con-drift-never-fixed-switch-oled\">Nintendo itself suggested it may never be fixed</a>. In 2019, Nintendo <a href=\"https://www.theverge.com/2019/7/23/20707849/nintendo-will-reportedly-fix-joy-con-drift-for-free-even-out-of-warranty\">started repairing Joy-Con drift for free</a>, even with an expired warranty.</p><div class=\"c-float-right\"><aside id=\"JxBSkZ\"><q>Most temporary employees stopped working after two-and-a-half months</q></aside></div><p id=\"xWeJWE\">According to <em>Kotaku</em>, United Radio hires many temporary workers through the staffing firm Aerotek. Workers reportedly become eligible to be hired as full-time United Radio employees after three months of work. However, the former supervisor told <em>Kotaku</em> that most temporary employees stopped working after two-and-a-half months, whether they just didn’t show up for work or were fired. This reportedly made it hard to establish an experienced team of workers, inevitably leading to errors. In one example of such errors, <a href=\"https://www.reddit.com/r/NintendoSwitch/comments/63gzeh/nintendo_actually_their_3rd_party_repair_company/\">a customer</a> on Reddit said their Switch was returned with another person’s save data on it. There are numerous other complaints online, citing <a href=\"https://www.reddit.com/r/NintendoSwitch/comments/d9ns65/repairs_done_by_united_radio_beware/\">faulty repairs</a>, <a href=\"https://www.reddit.com/r/NintendoSwitch/comments/q7if7w/trouble_with_united_radio_repair_vendor_for/\">missing components,</a> or <a href=\"https://www.reddit.com/r/NintendoSwitch/comments/iljpvl/nintendo_repairs_damaged_my_switch/\">damage to their system</a>.</p><p id=\"8v6Zmu\">A high turnover rate wasn’t the only issue contributing to repair mistakes — a language barrier also posed challenges, the former supervisor told <em>Kotaku</em>. The supervisor claims they were the only native English speaker on the job, making it difficult to train employees. Bi-lingual workers would reportedly often have to “act as a liaison” to relay information between the trainer and trainee.</p><p id=\"4EH2lK\">Tight turnaround times didn’t help with these issues, either. The former supervisor told <em>Kotaku</em> that United Radio would simply replace any broken Joy-Cons from 2017 to 2018. After that period, workers were reportedly required to repair 90 percent of Joy-Cons within four days of receiving them. It’s unclear if these policies were mandated by Nintendo. <em>The Verge</em> reached out to Nintendo with a request for comment but didn’t immediately hear back.</p><p id=\"xGVe1l\">As <em>Kotaku </em>notes, Nintendo doesn’t just rely on contracted employees to do repairs. Former and current employees at Nintendo’s Redmond, Washington headquarters <a href=\"https://kotaku.com/nintendo-america-switch-employee-treatment-unionize-nlr-1848828975\">told <em>Kotaku</em></a> that Nintendo employs temporary workers for 11-month cycles with a two-month (or longer) break in between, with employees losing access to healthcare during this window. Earlier this week, a <a href=\"https://www.theverge.com/2022/4/20/23034323/nintendo-employee-fired-unionization-nlrb\">former Nintendo employee filed a complaint</a> with the National Labor Relations Board, claiming that they were fired by Nintendo and staffing agency Aston Carter for attempting to organize a union.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/9hTzAZDsBVCymaJWjTD0PPM0-7o=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10329949/jbareham_180301_2346_nintendo_switch_0148.jpg",
  "description": "A deluge of repairs reportedly led to many errors.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}