{
  "title": "World of Warcraft brings back dragons in new expansion",
  "url": "https://www.theverge.com/2022/4/19/23032231/dragonflight-world-of-warcraft-new-expansion-blizzard",
  "date": "2022-04-19T18:22:44.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1N2ziMy1JbhqrLQ-nSE47RO0Pzc=/0x0:1920x1280/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70767764/alexstrasza.0.png\" />        <figcaption>Blizzard Entertainment</figcaption>    </figure>  <p id=\"pRTniw\"><em>World of Warcraft</em> is bringing back the dragons. In a livestream, <em>World of Warcraft </em>developers announced <em>Dragonflight</em>, <em>WoW’</em>s ninth expansion in 18 years. </p><p id=\"yfanMd\"><em>Dragonflight </em>will focus on the return of the Dragon Aspects, the magical guardians of Azeroth who disappeared after the events of the <em>Cataclysm</em> expansion 12 years ago. Players will journey to the mysterious and heretofore hidden Dragon Isles to explore five zones, each themed after one of the five dragon aspects. <em>Dragonflight</em> will also add a new race / class combo called Dracthyr Evokers, a race of draconic humanoids (think the Worgen from <em>Wrath of the Lich King</em>) with ranged damage and healing powers related to the Dragon Aspects. Unlike the Worgen, however, Dracthyr can only be the Evoker class, and the Evoker class is race locked to the Dracthyr.</p><div id=\"o0yXu5\"><div ><iframe src=\"https://www.youtube.com/embed/3ZtedjN1JXY?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"rK5Diy\"><em>Dragonflight</em> will bring a host of changes, including a revamped talent system (again!), revamped crafting, and the game’s first UI overhaul in 18 years. </p><aside id=\"Gs0bTL\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Activision Blizzard faces lawsuit and employee backlash over sexual harassment\",\"url\":\"https://www.theverge.com/2021/7/28/22597113/activision-blizzard-california-sexual-harassment-lawsuit-discrimination-employee-action\"}]}'></div></aside><p id=\"O9YhUn\">On the crafting side, it seems like <em>World of Warcraft </em>is learning from examples set by <a href=\"https://knowyourmeme.com/memes/the-critically-acclaimed-mmorpg\">critically acclaimed MMORPG <em>Final Fantasy XIV</em></a>. Professions will introduce a new quality rating system as well as receive a dedicated inventory slot. Players who have the right raw materials but not the right crafting profession to shape them will be able to take advantage of a new way to get gear made. The work order system will replace the tried and true tradition of /yelling in trade chat. Instead of spamming the chat with requests for crafters to make a desired weapon or piece of armor, <em>Dragonflight</em> will add a new interface by which players can post what they want made and the materials to make it for crafters to pick and choose at their leisure. </p><div id=\"ojocms\"><div ><iframe src=\"https://www.youtube.com/embed/zEIwhN68O3Q?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"j19SWW\">In addition to all the new game changes and updates, <em>Dragonfligh</em>t will also add a new dragon riding activity with dragon mounts that players can customize. No word yet on if there will be dragon racing, but I’m pretty sure there will be dragon racing.</p><p id=\"qlolyH\"><em>WoW Classic </em>players also got a bit of news in the announcement that <em>Wrath of The Lich King </em>will soon be available to subscribers. Originally launched in 2008, <em>Wrath of the Lich King</em> is one of the most popular and well-regarded WoW expansions in the history of the game.</p><p id=\"LtAUtC\">As with <em>Overwatch 2</em>, it seems Blizzard is ramping up its communications about what’s going on with all the games in its development pipe, although there still is no word on progress with <em>Diablo</em>’s <em>IV</em> or <em>Immortal</em>. Neither <em>Dragonflight</em> nor <em>Lich King Classic</em> has a release date.</p><p id=\"ro8eeI\"> </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/elyJGQt4uArr917jFqopF32nCzM=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23400777/alexstrasza.png",
  "description": "Alexstrasza, Kalecgos, Wrathion, and more have come back.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}