{
  "title": "Wormhole cryptocurrency platform hacked for $325 million after GitHub error",
  "url": "https://www.theverge.com/2022/2/3/22916111/wormhole-hack-github-error-325-million-theft-ethereum-solana",
  "date": "2022-02-03T17:43:31.000Z",
  "author": "Corin Faife",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/6S87yxU7-zanqm_DNoQdpNAlAhI=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70467356/acastro_210319_1777_nft_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"t7n8I1\">On Wednesday, the decentralized finance (DeFi) platform Wormhole became the victim of the largest cryptocurrency theft this year — and <a href=\"https://www.elliptic.co/blog/325-million-stolen-from-wormhole-defi-service\">among the top five largest crypto hacks</a> of all time — when an attacker exploited a security flaw to make off with close to $325 million.</p><p id=\"2MAZDM\">The attack seems to have resulted from a recent update to the project’s GitHub repository, which revealed a fix to a bug that had not yet been deployed to the project itself.</p><p id=\"wJpI2d\">The attack took place on February 2nd and was noticed when a post from the Wormhole Twitter account announced that the network was being <a href=\"https://twitter.com/wormholecrypto/status/1488976115750383626\">taken “down for maintenance”</a> while a potential exploit was investigated. A <a href=\"https://twitter.com/wormholecrypto/status/1489001949881978883\">later post</a> from Wormhole confirmed the hack and the amount stolen.</p><div id=\"2M1h6a\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The wormhole network was exploited for 120k wETH. <br><br>ETH will be added over the next hours to ensure wETH is backed 1:1. More details to come shortly.<br><br>We are working to get the network back up quickly. Thanks for your patience.</p>— Wormhole  (@wormholecrypto) <a href=\"https://twitter.com/wormholecrypto/status/1489001949881978883?ref_src=twsrc%5Etfw\">February 2, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"cv2y2C\">Shortly after the attack, the Wormhole team also offered the hacker a $10 million bounty to return the funds, which was embedded as text in a <a href=\"https://etherscan.io/tx/0x2d8b7901bff18ae6abe1a50aebe44b70559f39ff357b21340843d368b9486859\">transaction</a> sent to the attacker’s Ethereum wallet address.</p>  <figure class=\"e-image\">        <img alt=\"Ethereum transaction data showing a message to wormhole attacker offering a $10 million bounty\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/gpe7H1C1UI4mQYnd-bQe1_tFbOM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23215795/Wormhole_bounty_tx.png\">  </figure><p id=\"qPgPnl\">Wormhole provides a service known as a “bridge” between blockchains, essentially an escrow system that allows one type of cryptocurrency to be deposited in order to create assets in another cryptocurrency. This allows a person or entity with holdings in one cryptocurrency to make trades and purchases using another, somewhat like being able to fund a bank account in dollars and then use a bank card to buy something priced in euros. </p><p id=\"0Cm5md\">To carry out the attack, the attacker managed to forge a valid signature for a transaction that allowed them to freely mint 120,000 wETH — a <a href=\"https://weth.io/\">“wrapped” Ethereum</a> equivalent on the Solana blockchain, with value equivalent to $325 million at the time of the theft — without first inputting an equivalent amount. This was then exchanged for <a href=\"https://etherscan.io/address/0x629e7da20197a5429d30da36e77d06cdf796b71a\">around $250 million in Ethereum</a> that was sent from Wormhole to the hackers’ account, effectively liquidating a large amount of the platform’s Ethereum funds that were being held as collateral for transactions on the Solana blockchain.</p><p id=\"3TaPSq\">Open-source code commits show that code that would have fixed this vulnerability was written as early as January 13th and <a href=\"https://github.com/certusone/wormhole/commit/7edbbd3677ee6ca681be8722a607bc576a3912c8#diff-0d27d8889edd071b86d3f3299276882d97613ad6ab3b0b6412ae4ebf3ccd6370L92-R101\">uploaded to the Wormhole GitHub repository</a> on the day of the attack. Just hours later, the vulnerability was exploited by the hacker, suggesting that the updates had not yet been applied to the production application.</p><p id=\"NmOosf\">As software developer Matthew Garrett <a href=\"https://twitter.com/mjg59/status/1489065444635938819\">observed on Twitter</a>, the code upload was described as if it were a run-of-the-mill version update but actually contained extensive changes — a fact that could have tipped off the attacker to the fact that it was a disguised security fix.</p><p id=\"9oqD1d\">Another file available through the Wormhole Github page also <a href=\"https://github.com/certusone/wormhole/tree/dev.v2/audits\">details a security audit</a> conducted by security research company Neodyme between July and September 2021. It is not clear whether the vulnerability was present during the audit period, and Neodyme did not respond to a request for comment.</p><p id=\"vZMgPc\">Due to the nature of cross-chain applications, the attack temporarily left a huge deficit between the amount of wrapped Ethereum and regular Ethereum held in the Wormhole bridge — as if the collateral asset backing a loan had suddenly disappeared. According to Forbes, the attack <a href=\"https://www.forbes.com/sites/billybambrough/2022/02/03/crypto-price-alert-ethereum-rival-solana-suddenly-in-free-fall-after-huge-325-million-hack/\">caused a 10 percent drop</a> in the value of the Solana cryptocurrency in the aftermath of the hack.</p><p id=\"E1ws3c\">The Wormhole team has announced that more Ethereum will be added to the bridge to replace the stolen collateral funds, effectively meaning that the company will need to find $325 million in assets to plug the gap.</p><p id=\"jalvCV\">At this stage, it is unclear where the funds will come from. Questions sent to Jump Crypto, parent company of the developers of the Wormhole application, had not received a response at time of publication.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/VlKzUjc5jhaHb2tdRHikzBpddu0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22383046/acastro_210319_1777_nft_0001.jpg",
  "description": "The hacker likely found details of a security flaw in open-source code.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}