{
  "title": "Writing Google reviews about patients is actually a HIPAA violation",
  "url": "https://www.theverge.com/2022/4/1/23006132/google-patient-reviews-hipaa-doctors-yelp",
  "date": "2022-04-01T15:11:17.000Z",
  "author": "Nicole Wetsman",
  "content": "      <figure>      <img alt=\"A pattern of light blue face masks against a purple background.\" src=\"https://cdn.vox-cdn.com/thumbor/3Hqak4reHwYauU-gfs182oSBeHw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70698406/acastro_200512_1777_faceMask_0001.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"XkM9Te\">In the past few years, the phrase “HIPAA violation” has been thrown around a lot, often incorrectly. People have cited the law, which protects patient health information, as a reason they can’t be asked if they’re <a href=\"https://ftw.usatoday.com/lists/what-is-hipaa-vaccine-questions-athletes\">vaccinated</a> or get a <a href=\"https://www.basiconline.com/blog/can-employers-ask-for-a-doctors-note/\">doctor’s note</a> for an employer.</p><p id=\"ytE0HO\">But asking someone if they’re vaccinated isn’t actually a HIPAA violation. That’s a fine and not-illegal thing for one non-doctor to ask another non-doctor. What <em>is</em> a HIPAA violation is what U. Phillip Igbinadolor, a dentist in North Carolina, did in September 2015, according to <a href=\"https://www.hhs.gov/about/news/2022/03/28/four-hipaa-enforcement-actions-hold-healthcare-providers-accountable-with-compliance.html\">the Department of Health and Human Services</a>. After a patient left an anonymous, negative Google review, he logged on and responded with his own post on the Google page, saying that the patient missed scheduled appointments. “Does he deserve any rating as a patient? Not even one star,” Igbinadolor wrote, according to the <a href=\"https://www.hhs.gov/sites/default/files/upi-npd.pdf\">notice of proposed determination</a> outlining the violation. (For the curious, the redacted HIPAA-violating Google post is on page 3.)</p><p id=\"tiSsNl\">In the post, he used the patient’s full name and described, in detail, the specific dental problem he was in for: “excruciating pain” from the lower left quadrant, which resulted in a referral for a root canal. </p><p id=\"T7y7mM\">That’s what a HIPAA violation <em>actually </em>looks like. The law says that healthcare providers and insurance companies can’t share identifiable, personal information without a patient’s consent. In this case, the dentist (a healthcare provider) publicly shared a patient’s name, medical condition, and medical history (personal information). As a result, the office was <a href=\"https://www.hhs.gov/sites/default/files/upi-nfd.pdf\">fined $50,000</a>. </p><p id=\"BZmvlD\">This isn’t an uncommon occurrence: a <a href=\"https://www.propublica.org/article/stung-by-yelp-reviews-health-providers-spill-patient-secrets\">2016 <em>ProPublica</em> investigation</a> found that doctors regularly include details about patients’ health in response to negative Yelp reviews. And in 2019, another dentist was <a href=\"https://www.hipaajournal.com/dental-practice-fined-10000-for-phi-disclosures-on-yelp/\">fined $10,000</a> for putting the information of multiple patients on Yelp.</p><p id=\"adSJxv\">The Office for Civil Rights at the Department of Health and Human Services, which enforces HIPAA, <a href=\"https://www.hhs.gov/sites/default/files/upi-npd.pdf\">asked to see</a> Igbinadolor’s office’s internal policies and procedures around personal health information and social media. As of fall 2020, the office hadn’t provided anything. The office should probably implement one easy policy to keep something like this from happening again: even if a patient is annoying, never post. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/i0ltTzBGHvowkg8Vy1E4vXN_ZXM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19981040/acastro_200512_1777_faceMask_0001.0.jpg",
  "description": "A real violation, not like asking about someone’s vaccines.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}