{
  "title": "Wyze Video Doorbell Pro review: a lot to like, except for the look",
  "url": "https://www.theverge.com/22915876/wyze-video-doorbell-pro-review-budget-doorbell-camera",
  "date": "2022-02-04T15:00:00.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "  <p>Free video recordings and package detection almost make up for a dull design</p> <p id=\"JhLyVW\">The newest doorbell from Wyze surprised me in three ways: It isn’t the cheapest video doorbell you can buy (odd from a company that’s become a by-word for good budget smart home gear). It has excellent video quality for an under-$100 doorbell camera, and it has one of the most obnoxious designs of any doorbell, ever.  </p><p id=\"ac1ore\">Design decisions aside, the <a href=\"https://wyze.com/wyze-video-doorbell-pro.html\">$89.99 Wyze Video Doorbell Pro</a> punches well above its price point, taking on the Rings, Nests, and Arlos of this space with some impressive features. It doesn’t require a subscription to view video recordings (Ring and Arlo both charge money to see cloud recordings, and Nest’s free video goes poof after three hours). As a battery-powered doorbell, it can also be hardwired to existing doorbell wiring as with the competition’s similar options. The price includes a plug-in digital chime / Wi-Fi extender (Arlo and Ring charge $50 for their comparable versions), and the buzzer has AI-powered alerts that distinguish between a person, package, pet, or vehicle (for a fee), something no other sub-$100 battery-powered camera I’ve tested does. </p><div id=\"QwLCnt\"><div data-anthem-component=\"scorecard:11010961\"></div></div><p id=\"r2Pwob\">Overall, it’s a more-than-competent doorbell camera that delivers all the necessary features without costing over $100. Plus, hardwiring has more benefits than just trickle-charging the battery. The extra power adds a few seconds of pre-roll video so you can avoid that back-of-the-head problem that plagues lower-priced battery-powered doorbell cameras because they don’t start recording early enough.</p><p id=\"TiCtEs\">There are tradeoffs, however. The entire doorbell has to be removed to charge it if you don’t wire it up. There’s a cheeky lack of onboard storage (a feature in all of Wyze’s non-doorbell cameras), no option of continuous recording, and a 5-minute cooldown period between free recordings, and then there’s that design. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6MWXuS7vmun06G-xPxt9kVhk8YQ=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23216215/jtuohy_220131_5004_0007.jpg\">      <figcaption><em>The Wyze Pro doorbell is 5.5 inches tall, 1.8 inches wide, and 1.1 inches thick. Blue LEDs light up the button when the camera detects motion.</em></figcaption>  </figure><p id=\"PVZhUe\">Seriously, this thing is enormous. And while it’s a tad shorter than the massive <a href=\"https://www.theverge.com/22710545/nest-doorbell-battery-cam-battery-test-review-price-specs-features\">Google Nest Doorbell (Battery),</a> at least that has a design aesthetic. This is a big slab of shiny white plastic with a huge black eye. It looks as cheap as its price tag is. It also mounts awkwardly to its backplate (either wired or attached using a supplied 3M strip), leaving a noticeable gap around the back of the doorbell. This makes it look unfinished (and potentially exposed). Overall, there’s too little thought given to how the device looks — which is a shame, as it will occupy such a prominent spot on your front door.</p><p id=\"BVQ2rA\">There’s also a lack of quality in other areas, including chromatic aberration from the plastic and glass lens that adds a neon green tinge to backlit details. A tinny-sounding speaker makes two-way audio slightly unpleasant (but not unusable), and there are a few small but significant software features missing (no option to set motion zones and no obvious way to hang up on a doorbell call). </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tx1_tqeRrMV9Xw0mZHmfw11JSHk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23216303/Screen_Shot_2022_02_03_at_3.48.23_PM.png\">      <figcaption><em>The Wyze Pro has a 150 degree horizontal and vertical view with a square aspect ratio, showing almost all of the front porch. The chromatic aberration is visible in the distance, but it doesn’t impact utility.</em></figcaption>  </figure><p id=\"NNP00U\">It’s also not possible to use an existing mechanical chime. The included chime (which has 24 rings to choose from) that is also a Wi-Fi extender helps with that. I was also able to link the Wyze to my Echo smart speakers using the Wyze skill and then set them to announce when someone pressed the doorbell. </p><p id=\"XDt14i\">Smart home integrations extend to viewing live footage on an Alexa or Google smart display and using a doorbell press as a trigger for an Alexa Routines. (Wyze says that support for Alexa and Google Assistant is still going through final certification, but I had no problem linking it to my accounts and using its features while testing the doorbell.)</p><div class=\"c-float-left\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/UcVQcpF9DQvYOYZcdpM9lrfsWvA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23216210/jtuohy_220128_5004_0003.jpg\">      <figcaption><em>The Wyze Pro comes with a chime / Wi-Fi extender to help with connectivity.</em></figcaption>  </figure></div><p id=\"xvWP7s\">The Wyze Pro is the second video doorbell from the Washington-based startup, and it’s the polar opposite of the original <a href=\"https://wyze.com/wyze-doorbell.html\">Wyze Video Doorbell (hardwired)</a>: battery-powered instead of wired (although there’s the option for wiring), huge instead of tiny (5.5 inches compared to just 3.25 tall), and $90 rather than $50. </p><p id=\"iRSx4Q\">It also brings a few improvements over its older sibling: 1440x1440 video (compared to 1080p HD), the addition of 5 GHz Wi-Fi compatibility on top of 2.4, and a 1:1 square aspect ratio that delivers an impressive 150 degree horizontal and vertical field of view. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KNM3EKgny0Q_itHSrWdb9V5KpSI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23216219/jtuohy_220131_5004_0013.jpg\">      <figcaption><em>The Wyze Video Doorbell alongside the Wyze Video Doorbell Pro. </em></figcaption>  </figure><p id=\"K8jJLs\">With the Wyze Pro, I could see my entire front porch ceiling to floor, side to side, compared to the more traditional 3:4 aspect ratio of the Wyze Wired. However, if you have an issue with a fish-eye view, you will not like the Pro’s heavy distortion, which does the complete Nemo and rounds out the view to cram it all in. </p><p id=\"dXQyNO\">Video quality is good, clear, and crisp during the daytime (helped by Wide Dynamic Range — a hardware version of High Dynamic Range). There’s no full-color night vision as with the company’s Wyze Cams, but the standard night vision works well, although the face is a little blown out if a person gets too close. Paired with the all-encompassing view and eight times digital zoom, nothing is getting past this doorbell. </p><div><div id=\"cBtb8R\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Wyze Video Doorbell Pro test video (wired)|105816\" data-volume-uuid=\"9688c4c51\" data-volume-id=\"105816\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-882\" class=\"volume-video\"></div><div class=\"caption\"><em>Video quality is clear, and, when wired, the Wyze catches an extra three to six seconds of pre-roll video.</em></div></div><div id=\"1b0BYa\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Wyze Video Doorbell Pro test video (battery)|105815\" data-volume-uuid=\"4cd5182c3\" data-volume-id=\"105815\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-358\" class=\"volume-video\"></div><div class=\"caption\"><em>When powered just by its battery, the Wyze does miss the person approaching, only catching the back of their head.</em></div></div></div><div class=\"c-float-right\"><div id=\"6gkrGR\"><div data-anthem-component=\"aside:11010572\"></div></div></div><p id=\"S9jNlx\">While you can view recorded videos without a subscription (motion-activated events up to 12 seconds long are stored in the cloud for free), there is a 5-minute cooldown period before the camera will record again. That’s a long time. If FedEx drops off that laptop and a porch pirate swings by a minute later to nab it, the doorbell will miss the crime. </p><p id=\"IprVro\">To get rid of the “cooldown,” you have to pay for the Cam Plus subscription service — $2 a month per camera or $15 for a year (there’s three or four camera bundles available for a discount of up to $10 annually). The new <a href=\"https://www.theverge.com/2022/1/12/22879759/wyze-cam-plus-lite-pay-what-you-want-subscription-person-detection-cloud-recordings-12-seconds\">Cam Plus Lite service</a> that adds person detection for as low as free isn’t compatible with Wyze’s doorbell cameras. With the subscription, you can choose no cooldown or any period from 15 seconds to 5 minutes. A longer cooldown can help extend battery life. </p><p id=\"6raFSB\">The Cam Plus service also adds video recordings for up to 180 seconds and the option to fast-forward through clips. But the real benefit is the AI-detection feature. With a subscription, videos are analyzed in the cloud for people, pets, packages, and vehicles (all or a selection), helping cut down on unnecessary alerts. </p><p id=\"Tek1kX\">And Wyze’s AI capabilities are excellent. It accurately picked up on all four events in my testing — never missing any action. It also kept sending a reminder for package detection every minute until I removed the package. This is helpful but slightly irritating, and I couldn’t see a way to turn it off or snooze notifications (although you can disable notifications and set a notification schedule). </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/SPBTm7uyyN1WKEydaiuC0wppBfw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23216247/wyze_pro.jpg\">      <figcaption><em>The Wyze app is easy to navigate. You view recorded footage in the Events tab and talk to visitors on the live view screen. But the lack of an “answer” or “end call” button is a bit confusing.</em></figcaption>  </figure><p id=\"j0gPml\">I always recommend hardwiring a doorbell if you can (or using a plug-in workaround). My experience is that hardwired doorbells generally perform better and respond faster. That’s the case with the Wyze, too, but if you have to use battery power, be prepared to charge this every couple of months. Despite the promise of three- to six-month battery life, in my testing, it lost 20 percent charge every two days, extrapolating out to under two weeks on a full charge. I was giving it a heavy workout, though, and I estimate it would last about four to six weeks at my busy front door with more standard use.</p><p id=\"7OodSu\">If you want a battery-powered doorbell that records video without a fee for under $100, this is the best option right now. <a href=\"https://www.theverge.com/2021/9/28/22698612/amazon-blink-video-doorbell-outdoor-camera-floodlight-solar-panel\">Blink has a $50 wired and battery-powered buzzer</a> with a nicer design and the option of free local storage. But it has fewer features (no AI-detection) and lower video quality. Ring has its budget <a href=\"https://www.theverge.com/2021/1/27/22252181/ring-video-doorbell-new-wired-size-features-price\">Ring Video Doorbell Wired</a> for $80, including a wireless indoor chime (<a href=\"https://www.amazon.com/Ring-Video-Doorbell-Wired/dp/B08CKHPP52/ref=sr_1_1?crid=1HN78XBVGOLK5&amp;keywords=ring+video+doorbell&amp;qid=1643893175&amp;sprefix=ring+video+d%2Caps%2C143&amp;sr=8-1&amp;tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">$60 without</a>), but it doesn’t have the option of battery power. You have to step it up to $100 for a <a href=\"https://www.theverge.com/2020/5/6/21249028/ring-video-doorbell-specs-price-date\">battery-powered Ring</a>, which can be wired to work with an existing mechanical chime. </p><p id=\"G8GLMR\">Another thing to consider when buying any smart home device that requires software and security updates is how long the company will support it. While Wyze doesn’t specify the length of support it will offer its newer cameras, it does publish an <a href=\"https://wyze.com/end-of-life-policy\">End of Life policy</a> with details of how it handles discontinuing products. The company recently <a href=\"https://www.theverge.com/2022/1/27/22904844/wyze-discontinues-smart-security-camera-wyzecam-v1\">discontinued security updates for its original WyzeCam</a> after five years. </p><div><div id=\"sZf7YR\"><div data-anthem-component=\"aside:11010570\"></div></div></div><p id=\"1cNQ9b\"></p><p id=\"K94Ye3\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/07ChqVvVtVEtWVlBkhRIs8cjraM=/0x68:2040x1136/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23216218/jtuohy_220131_5004_0011.jpg",
  "description": "No-fees, no-frills, but lots of features",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}