{
  "title": "Wyze hikes its home monitoring prices, but it’s still a bargain",
  "url": "https://www.theverge.com/2022/3/2/22958017/wyze-home-monitoring-security-system-price-increase",
  "date": "2022-03-02T15:23:01.000Z",
  "author": "Jennifer Pattison Tuohy",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/VEtwN3znbZRBafBWW-EW8t3XGiM=/0x334:2000x1667/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70569732/d49b0e6c_69f1_438b_a8f9_61d25ae05a3b.0b48f8f70db6334aa16250c8af18aaa8.0.jpeg\" />        <figcaption><em>Wyze is increasing the cost of its professional monitoring service for its home security system.</em> | Image: Wyze</figcaption>    </figure>  <p id=\"wnaeyK\">If you were thinking of picking up Wyze’s super cheap <a href=\"https://www.amazon.com/Security-Professional-Monitoring-Included-Required/dp/B092RL8CHP?tag=theverge02-20\" rel=\"sponsored nofollow noopener\" target=\"_blank\">home security system</a>, you might want to do it now. Starting April 6th, Wyze is increasing the price of its 24/7 professional home monitoring service for the system from $4.99 a month to $9.99 a month. Existing subscribers will stay locked into their current price, however. “This price increase will help us cover rising costs, make the service more sustainable, and allow us to continue adding new features,” the company said in an email sent to subscribers announcing the change.</p><p id=\"h2qxCH\">With higher costs come more features. The $10 a month (or $100 a year) Wyze Home Monitoring service includes one <a href=\"https://services.wyze.com/detail/camplus\">Cam Plus</a> license worth $15 a year to apply to any camera (adding unlimited event recording and other AI features), plus person detection for all the user’s cameras. The subscription will also add professional monitoring for Wyze’s leak and climate sensors and include the $10-a-year Sprinkler Plus subscription for its <a href=\"https://wyze.com/wyze-sprinkler.html#pageOverview\">smart sprinkler controller</a> (which adds real-time weather data to the device to water more efficiently). The new features will automatically apply to existing subscribers, starting April 6th.</p><p id=\"vHOXAr\">Even with the price bump, Wyze is still the cheapest option for professional home monitoring. Its budget competitors have all recently seen price changes. <a href=\"https://ring.com/protect-plans\">Ring upped its price from $10 to $20 a month</a> ($200 a year) for professional monitoring. SimpliSafe’s base price for monitoring is now <a href=\"https://support.simplisafe.com/hc/en-us/articles/360023809972-What-are-the-service-plan-options-\">$18 a month</a>, but you need to pay $28 to add camera storage. Ring’s $20 fee covers unlimited cloud camera storage, Wyze’s includes one. However, Wyze doesn’t offer cellular backup for its alarm system, a standard feature on its competitors’ products.</p><p id=\"nJobTL\">Prices on all Wyze’s hardware have been creeping up over the last two years. Its <a href=\"https://www.theverge.com/circuitbreaker/2018/2/19/17029516/wyzecam-v2-security-camera-price\">iconic $20 Wyze Cam</a> now costs <a href=\"https://wyze.com/wyze-cam-black.html\">$33</a>. And it’s not the company’s first price hike for its security system, either. The system launched last year at an astonishingly cheap $59 for the hardware and one year of professional monitoring. Today, the <a href=\"https://prod.services.wyze.com/purchase/hms/plan\">starter kit is $80</a> (for a Wyze Sense Hub, keypad, two contact sensors, and a motion sensor), and if you purchase the year of monitoring for $59, you get a $40 discount for a total of $100. That’s a $40 increase on launch. </p><p id=\"Sa7cyV\">However, at $100, it was still a bargain compared to starter kits from Ring and SimpliSafe, which are around $200 without monitoring included. Wyze hasn’t released details on what bundles it may offer when the subscription price increase goes into effect next month.</p><p id=\"W5fi7n\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/_Kgltmvx2oEFqQhPbEx91BH9n6c=/0x477:2000x1524/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23282739/d49b0e6c_69f1_438b_a8f9_61d25ae05a3b.0b48f8f70db6334aa16250c8af18aaa8.jpeg",
  "description": "It’s raising prices for home monitoring from $5 to $10 a month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}