{
  "title": "Xbox consoles can now download updates in Energy Saver mode",
  "url": "https://www.theverge.com/2022/3/10/22971187/xbox-energy-saver-mode-download-updates-microsoft",
  "date": "2022-03-10T19:28:06.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1s-6n7NBS1GvZ71tgzqVMgwxF38=/7x0:2034x1351/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70605164/twarren_200909_4177_0030.0.0.jpg\" />        <figcaption>Photo by Tom Warren / The Verge</figcaption>    </figure>  <p id=\"Iz7akk\">Microsoft is making improvements to its Energy Saver mode on Xbox consoles. While Xbox owners have traditionally had to enable Standby mode to continue getting game and system updates while consoles are powered off, the Energy Saver mode will now support downloading updates in the background.</p><p id=\"1MNIS7\">“Now, system and game updates can be downloaded during Energy Saver mode, further saving energy,” <a href=\"https://news.xbox.com/en-us/2022/03/10/an-update-on-xbox-sustainability-efforts/\">explains Dave McCarthy</a>, corporate vice president of Xbox operations. “Energy Saver mode consumes about 20 times less power than Standby mode when the console is not being used or receiving updates.”</p><p id=\"KGE8oN\">Microsoft has now made Energy Saver mode the default option when Xbox owners initially set up a console. The Energy Saver mode does mean it’s slower to resume your Xbox, particularly on older Xbox One consoles. The latest Xbox Series S / X consoles boot so quickly that the tradeoff in energy use is definitely worth enabling Energy Saver, especially coupled with game and system updates supported in the background.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/AWmPkFgOEjuhR80Cuant02uMvjc=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23304357/xboxresin.jpg\">      <cite>Image: Microsoft</cite>      <figcaption><em>Xbox Series S consoles have switched to more post-consumer recycled resin.</em></figcaption>  </figure><p id=\"OI7f6C\">Elsewhere, Microsoft has also switched to using post-consumer recycled (PCR) resins on its Xbox Series S consoles. “At a minimum, 28% of the mechanical component plastic by weight in the updated Series S console is post-consumer recycled (PCR) resin,” says McCarthy. </p><p id=\"AD6N1R\">Microsoft has also embedded an “enhanced power monitoring system” in a small number of consoles for anonymous telemetry collection. “This is key because accurate, per unit telemetry helps us identify the best opportunities to introduce future improvements that will help us save power,” explains McCarthy. Microsoft is also looking to improve Xbox Cloud Gaming. Since it’s powered by Azure, Microsoft will shift to a 100 percent supply of renewable energy by 2025.</p><p id=\"9qDINY\">All of these sustainability efforts are part of Microsoft’s broader pledge to become carbon <em>negative</em> by 2030. A lot of this involves Microsoft’s data centers, and the company has also been ramping up its plans to make its data centers less thirsty by <a href=\"https://www.theverge.com/2021/10/27/22747394/microsoft-data-centers-water-drought-climate-change-energy-emissions\">cooling servers without using water</a>. </p><p id=\"L2Xmuj\">Microsoft’s overall goals will be <a href=\"https://www.theverge.com/2021/1/28/22254483/microsoft-climate-change-pledge-update-carbon-dioxide-removal\">challenging to achieve</a>, and the software maker admitted today that <a href=\"https://blogs.microsoft.com/blog/2022/03/10/an-update-on-microsofts-sustainability-commitments-building-a-foundation-for-2030/\">some of its emissions have increased</a> year over year. “Our experience this past year has provided us with critical and additional early learning on our path towards our 2030 carbon negative milestone, and we are applying this learning quickly with additional measures to strengthen efforts to reduce our Scope 3 emissions,” says Microsoft president Brad Smith.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2oDo0mlAmYPHaHCIxtZp1OCTRbs=/0x142:2040x1210/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21867253/twarren_200909_4177_0030.0.jpg",
  "description": "Xbox owners can save in energy and still keep updated.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}