{
  "title": "Xbox Stereo Headset review: wired and worth it",
  "url": "https://www.theverge.com/22933892/microsoft-xbox-stereo-headset-review-gaming-headphones",
  "date": "2022-02-18T13:30:00.000Z",
  "author": "Antonio G. Di Benedetto",
  "content": "  <p>A no-frills gaming headset that works great on anything thanks to its 3.5mm cable</p> <p id=\"CTikcy\">Microsoft’s Xbox Stereo Headset is the no-frills affordable counterpart to its excellent <a href=\"https://www.theverge.com/22325883/microsoft-xbox-wireless-headset-gaming-series-x-s-pc-windows-10-review\">Wireless Headset</a>, with a permanently affixed 3.5mm cable in place of any Bluetooth or 2.4GHz connectivity. The $59.99 Stereo Headset combines that same performance from its wireless sibling and mixes it with better pricing and the flexibility of a wired connection, making this headset easy to recommend to gamers using any console or PC. It was announced back in the summer of 2021, and since then, we have also seen a 20th-anniversary variant released as well as frequent discounts making it even more affordable. While it’s easy to recommend, it is not without its shortcomings.</p><div id=\"bEy8QL\"><div data-anthem-component=\"scorecard:11055789\"></div></div><p id=\"RLcgr0\">The Xbox Stereo Headset shares most specs and hardware with the Xbox Wireless Headset. Both are an over-ear design, constructed primarily from plastic with pleather-wrapped foam padding to cushion your head and ears. Each model houses 40mm neodymium speakers in their respective earcups and similar boom mics on the left side that are bendable for positioning closer to your mouth or tucking up and away. I wish the boom mics were removable for a more streamlined look when they’re not needed, but these headsets are not designed to replace your headphones for dedicated music listening.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/3tXsZrLwQZ2ogQ3KHZslAyYXbA0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253166/adbenedetto_220213_5034_0005.jpg\">      <figcaption><em>Side-by-side comparison of the Xbox Wireless Headset (left) and Xbox Stereo Headset (right).</em></figcaption>  </figure><p id=\"a8y67B\">From there, the headsets have their differences, such as the Stereo Headset using a sliding mute switch instead of the push-button mute with LED light of the wireless model. As for the sleek turnable earcups for volume adjustment and audio/chat mix featured on the Wireless Headset? The Stereo Headset meets it halfway: the right earcup has the same volume control, but the left earcup is stationary with no added function. That may be why Microsoft opted not to highlight the earcups of the wired model with green accents, but it yields a sleek headset that is all black, with just a lime-green wire to give a pop of color.</p><div><div class=\"c-image-grid\"><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/lhCMN_IDtXMhNz4JgpGCb59SJM8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253168/adbenedetto_220213_5034_0009.jpg\">      <figcaption><em>Muting the mic is done with a sliding switch on the left earcup. The exposed orange color shows it is muted.</em></figcaption>  </figure></div><div class=\"c-image-grid__item\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/hRlvm49f5S8PcZP7q5-u2YWpTAw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23253167/adbenedetto_220213_5034_0007.jpg\">      <figcaption>The right earcup controls the headset’s internal volume, so it even works when plugged into non-Xbox devices.</figcaption>  </figure></div></div></div><p id=\"TQnG0D\">Looks and specs aside, the Stereo Headset fits a lot like its wireless partner. It’s fairly comfy and supportive on my head, but only once I can find the right position. My noggin is on the very large side (I wear a size 8 hat), and I have a lot of hair, so I can only wear the Stereo Headset when it’s fully extended. The padded foam headband feels soft to the touch, but it didn’t take long at first for pain and fatigue to set in on the top of my head. By positioning the headband further back to relieve some pressure, I can play games for as long as two to three hours before I need a short break — they’re just a little more prone to tip back and slip off.</p><div class=\"c-float-right\"><aside id=\"6nTmch\"><q>That’s the beauty of a 3.5mm wire — you never have to worry about charging batteries and it works on just about anything</q></aside></div><p id=\"ESDaXK\">I tested the Xbox Stereo Headset for hours at a time with a bunch of games across four different platforms: <a href=\"https://www.theverge.com/21548987/xbox-series-x-review\">Xbox Series X</a>, <a href=\"https://www.theverge.com/21550146/sony-playstation-5-ps5-review\">PlayStation 5</a>, <a href=\"https://www.theverge.com/games/22711889/nintendo-switch-oled-review\">Nintendo Switch OLED</a>, and my PC. That’s the beauty of a 3.5mm wire — you never have to worry about charging batteries, and it works on just about anything (except modern phones and tablets, of course). The cable is about 50 inches long, which is the right length to plug into your controller or handheld system and has more than enough slack without being burdened by excess wire. </p><p id=\"ehnIXE\">Playing games with the Stereo Headset made for a satisfying experience, with clear and balanced sound that was identical to its pricier, wireless sibling. Testing them side by side showed the wireless model has milliseconds more latency than the wired model. You’re unlikely to notice it when not directly comparing, but if you’re the type that loathes any latency, this may be reason enough to go wired. </p><div id=\"dpPDiq\"><div data-anthem-component=\"gallery:11055939\"></div></div><p id=\"HUhK9t\">The Stereo Headset has the right amount of bass thump when the <a href=\"https://www.theverge.com/2021/12/6/22820011/halo-infinite-campaign-review-xbox-series-x\"><em>Halo Infinite</em></a> soundtrack kicks in without drowning out the gameplay sounds. A backstab in <a href=\"https://www.theverge.com/22150718/demons-souls-remake-ps5-playstation-5-sony-game-of-the-year-2020\"><em>Demon’s Souls</em></a> sounds sharp and gives me a small shiver of excitement up my spine each time. Boss fights in <a href=\"https://www.theverge.com/2021/10/6/22710468/metroid-dread-review-nintendo-switch\"><em>Metroid Dread</em></a> were incredibly chaotic and more immersive thanks to the sound isolation of the foam earcups. Wearing the headset in my home eliminated most distractions and created a very quiet environment to get lost in another world. But using the headset for music had the opposite effect.</p><p id=\"315MCu\">Can you use the Xbox Stereo Headset to listen to music? Yes, but ultimately it is best used for gaming. The act of enjoying in-game music while playing that video game with all kinds of sound effects or dialog thrown into the mix is different from sitting back and listening to those same tunes on their own. Hearing the <a href=\"https://www.theverge.com/2018/8/6/17655322/dead-cells-review-nintendo-switch-ps4-xbox-castlevania\"><em>Dead Cells</em></a> instrumentation while I tumble around and slash at monsters with this headset on is great. Listening to that same soundtrack isolated from the sounds of weapons and gameplay highlights how overly-boomy and muddy music sounds through these cans. Some types of music felt underwater, with the sound of any electric bass getting more percussive than tonal. One small exception is that some electronic music sounded passable.</p><p id=\"rUvjDx\">As for the microphone, it rendered my voice cleanly and clearly, though it also picks up ambient noise as well. That was not really a problem for me in a quiet room, but it may be if there are background conversations happening where you play games. Since the mic has no LED light to verify it’s turned on, you have to familiarize yourself with the positioning of the mute switch to know when you’re on a hot mic (slide it towards the mic to unmute and away from the mic to mute). It’s effective, but I still ended up tapping it a few times to awkwardly double-check my mic status.</p><aside id=\"KNOL5Q\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The best wired or wireless gaming headsets to buy\",\"url\":\"https://www.theverge.com/21549510/best-gaming-headset-wired-wireless-features-specs-price-sound-microphone-test-buy\"}]}'></div></aside><p class=\"c-end-para\" id=\"RMN9PM\">The Xbox Stereo Headset is an excellent value. It renders very good sound quality when playing games, the microphone renders your voice cleanly without being muffled or nasally, and it’s comfortable enough to use for moderate play sessions. It feels a little cheap, but it’s hard to ask for too much more at its price. Even so, I’d call this a near-perfect headset if it had a swappable cable, removable boom mic, and a foldable lay-flat design — the fact that its earcups do not turn inward or fold up may be my biggest gripe overall, even if it’s a mild inconvenience. A lot of that can be forgiven due to its cost and the flexibility of a 3.5mm cable. The Stereo Headset may not be breaking any ground technology-wise, but it’s a good example of relatively old tech that still works great now.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/AUfkF5PIl4Bmjh4GRLlaEnJTSUM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23253169/adbenedetto_220214_5034_0011.jpg",
  "description": "Microsoft’s affordable gaming headset works well on anything.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}