{
  "title": "Xbox Game Pass Ultimate gets free 30-day free trial of Paramount Plus to watch the Halo TV show",
  "url": "https://www.theverge.com/2022/3/18/22984863/xbox-game-pass-ultimate-30-day-trial-paramount-plus-halo-tv-show",
  "date": "2022-03-18T17:43:23.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/0BZ5UUPKhJsz0T3vtpUAvJmXHD4=/222x0:2619x1598/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70642205/Screen_Shot_2022_03_18_at_1.20.33_PM.0.png\" />    </figure>  <p id=\"ge6eYY\"><em>Halo</em> is coming to Xbox Game Pass Ultimate. Not the games (which, after all, are already available on the streaming service), but <em>Halo: The Series</em> — the upcoming live-action Paramount Plus adaptation of the sci-fi shooter, which debuts on March 24th. </p><p id=\"kPJYID\">And to make sure that Game Pass Ultimate subscribers don’t miss out on the latest installment in the franchise, <a href=\"https://news.xbox.com/en-us/2022/03/14/halo-the-series-story-trailer-releases-today/\">Microsoft is offering customers</a> a free 30-day membership to Paramount Plus starting on March 23rd (a day before the show starts) so that they can be ready to tune in when the show arrives the following day.</p><div id=\"RbLiRZ\"><div ><iframe src=\"https://www.youtube.com/embed/b4doITNi2RE?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"a2ffWW\"><em>Halo</em> (the TV show) is technically set in a different continuity than the existing video games, books, and other <em>Halo</em> content that’s come before. The show takes place a new “Silver Timeline” that will give it a chance to tell a slightly different version of the classic Halo story without being beholden to the weight of years of canon that comes before. </p><p id=\"mXpiYY\">The free trial is also only enough to get Game Pass Ultimate subscribers through the first five episodes of the nine-episode season — so fans looking to finish the <s>fight</s> series will have to eventually pay up for another month of Paramount Plus (which is almost certainly the intention here). </p><p id=\"P029CM\">Still, if you’re a Game Pass Ultimate subscriber that’s also a <em>Halo</em> fan interested in checking out the new show — something that is undoubtedly true of a huge percentage of subscribers — it’s a nice additional perk.</p><p id=\"Bbu6sB\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/FyVq9j2OmNGi-TgrG1hLY7cgfuw=/0x56:2840x1543/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23327418/Screen_Shot_2022_03_18_at_1.20.33_PM.png",
  "description": "Or rather, half the show",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}