{
  "title": "Xbox Game Pass is reportedly getting a family plan",
  "url": "https://www.theverge.com/2022/3/31/23004950/xbox-game-pass-family-plan-rumors",
  "date": "2022-03-31T17:34:33.000Z",
  "author": "Tom Warren",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/3cvaS3Kq6-PYgKEnnJVh5RMmZr0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70694841/acastro_210429_1777_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"YnMrVX\">Microsoft is reportedly planning to introduce an Xbox Game Pass family plan this year. <a href=\"https://www.windowscentral.com/microsoft-moving-ahead-xbox-game-pass-family-plan\"><em>Windows Central </em>reports</a> that Microsoft has been contemplating a family plan for Xbox Game Pass for quite some time and that the company is now in the position to announce one in the “near future.”</p><p id=\"jhG7pj\">The family plan option will reportedly provide access to Xbox Game Pass for five players and will be priced cheaper than the cost for separate accounts. Microsoft will reportedly integrate its Family Account system, which is what the company also uses for its Microsoft 365 Family subscriptions.</p><div class=\"c-float-right\"><aside id=\"6Zkw1f\"><q>Five players will reportedly be able to access an Xbox Game Pass family plan</q></aside></div><p id=\"VnCKS6\">It’s not clear whether there will be separate family subscriptions for Xbox Game Pass, PC Game Pass, and the Ultimate version of Microsoft’s game subscription service. Microsoft has reportedly had to work through details on how royalties are distributed and compensation for third-party publishers that currently license their content for the main Xbox Game Pass plans.</p><p id=\"imr1NH\">Microsoft currently offers Xbox Game Pass or PC Game Pass for $9.99 per month. Neither includes online multiplayer capabilities, but you can upgrade to Xbox Game Pass Ultimate for $14.99, and this unlocks Game Pass for Console, PC, EA Play access, and online multiplayer.</p><p id=\"OTJlmZ\">News of a potential family plan for Xbox Game Pass comes just days after Sony <a href=\"https://www.theverge.com/2022/3/29/23001164/sony-playstation-plus-subscriptions-price-release-date\">announced its updated PlayStation Plus subscriptions</a>. Sony’s answer to Xbox Game Pass also includes multiple tiers, starting at $9.99 monthly.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jhUjLv0PgI9EVx6dTSB6j28bsf0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22478772/acastro_210429_1777_0003.jpg",
  "description": "An Xbox Game Pass family plan is rumored to launch in 2022.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}