{
  "title": "xScreen turns an Xbox Series S into a portable console",
  "url": "https://www.theverge.com/2022/3/14/22976656/xscreen-review-xbox-series-s-screen-portable-console",
  "date": "2022-03-14T14:34:21.000Z",
  "author": "Tom Warren",
  "content": "  <p>The $249.99 xScreen is a unique Xbox accessory</p> <p id=\"iAgDD4\">If you’ve ever owned a screen for the PSone or the GameCube, the xScreen will look instantly familiar. The xScreen is an 11.6-inch (1080p) display that attaches to the rear of an Xbox Series S, and it transforms Microsoft’s miniature console into more of an Xbox laptop for on-the-go gaming. It’s a modern take on the tiny 5-inch cramped LCD displays we’ve seen attached to consoles in the past, and it’s a great accessory if you never want to worry about attaching an Xbox to a TV when you’re traveling.</p><p id=\"rKakxI\">Unfortunately, that portability that doesn’t cheap. <a href=\"https://upspecgaming.com/\">The xScreen is $249.99</a>, nearly the same price as an Xbox Series S, so you’re going to really want to have a portable Xbox to buy into this. I’ve been testing an xScreen over the past few weeks, and I think it’s one of the best executions of the concept of portable console gaming. But it’s far from perfect.</p><div id=\"1TLdyr\"><div data-anthem-component=\"scorecard:11093848\"></div></div><p id=\"sthLxR\">The xScreen is really all about its display. The 11.6-inch panel supports up to 1080p at 60Hz and has surprisingly good viewing angles. If you’re looking to play outside, the panel is rated at 350 nits, and it’s matte, which helps a lot in direct sunlight. The only real limitations to playing outside are simply that you’ll need a cord long enough to power the Xbox Series S.</p><p id=\"lpHK56\">I played multiple games for hours with the xScreen and never noticed any severe input latency or ghosting issues. It’s a solid panel, except for black levels. If you’re playing titles that have a lot of low-light scenes, the panel sometimes struggles to really nail the black levels, and games can lack some detail as a result.</p><p id=\"oFYkJS\">The xScreen manages to attach to the Xbox Series S through a USB-A port and the HDMI port. You have to lineup the USB first before the unit slots into place and is secured by latches at either side. The attachment feels very secure, and I never experienced any connection issues or worried about it becoming detached.</p><p id=\"aGy4jq\">UPspec Gaming, the makers of xScreen, has done a solid job of matching the size of the xScreen to the Xbox Series S, so it all folds into a neat little package once you’ve finished playing. The white of the xScreen doesn’t quite match the Xbox Series S, but it’s close enough that I only noticed under certain light when I was closely inspecting the xScreen.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/w4ofv8pI7OXAGct1H_R5J2Du1dI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312730/tomwarren_VLS_4596.jpg\">      <cite>Photo by Tom Warren / The Verge</cite>      <figcaption>The xScreen is an 11.6-inch screen for the Xbox Series S.</figcaption>  </figure><p id=\"ddNUgP\">Setting the xScreen up does involve some work, though. The Xbox Series S immediately defaults to 720p output for the xScreen, and I had to switch to 1080p in the Xbox settings menu to rectify that. I also enabled the HDMI CEC options so that when I close the display, it turns the Xbox Series S off. This is neat integration, but you will need to use the Xbox power button to boot up the console again.</p><p id=\"FnSHMW\">To avoid any damage to the xScreen or Xbox, I also had to ensure the Xbox Series S had Energy Mode enabled, so it fully powers off instead of sitting in standby. This is important, as the xScreen covers the main vent on the Xbox Series S when it’s folded down, and the Xbox will still output some heat which could damage the display if it’s running in Standby mode. Thankfully, the Xbox Series S boots super fast, so not having standby mode is a minor inconvenience.</p><p id=\"yeffaf\">The xScreen gets its power from the Xbox Series S USB port, so you don’t have to worry about a separate power supply, and simply connecting the Xbox to a wall works like normal. You’ll need to use Wi-Fi for connectivity, though, as the xScreen blocks off the Ethernet port on the Series S and the additional USB port. That leaves only the USB port at the front open for additional accessories.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/grY0FMzjf9BcgDaRtv7qlSkXjjE=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312727/tomwarren_VLS_4584.jpg\">      <cite>Photo by Tom Warren / The Verge</cite>      <figcaption><em>Latches keep the xScreen in place.</em></figcaption>  </figure><p id=\"7lam77\">UPspec Gaming has also enabled an optional cross-hair overlay for use in FPS games, and there are a bunch of built-in controls for screen settings and the volume of the built-in speakers. The speakers get surprisingly loud — but not in a good way. There’s no mute shortcut, and the volume controls don’t seem to affect the volume after a certain level. The speakers are definitely a disappointing aspect of this $249.99 accessory.</p><p id=\"7zkFf7\">If you want to prop the whole thing up, there are optional feet that move the entire unit into a stand-mode orientation. I rarely used the xScreen this way, but it could be useful if you’re limited for space or you want the screen to be higher up in certain environments.</p><p id=\"tdI3wy\">I think the optional carry case is essential for the xScreen, though. When attached to the Xbox and folded down, I noticed that the xScreen will creak and wobble if you apply any pressure to it from above. I’m not sure I’d trust this being knocked around in a backpack without some protection. The hard carry case does a good job of protecting the xScreen, but it’s a $59.99 optional extra.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0pdYBhvlVK_0TP8uyzMMzG54mdI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23312726/tomwarren_VLS_4571.jpg\">      <cite>Photo by Tom Warren / The Verge</cite>      <figcaption><em>The xScreen speakers are disappointing.</em></figcaption>  </figure><p id=\"680u7m\">Speaking of the build quality, I’m also slightly nervous about the hinge on the xScreen. I haven’t pushed it all the way back to test, but it does feel a little flimsy, and I wouldn’t recommend this for small kids that might not handle it delicately enough not to damage it. It’s probably a non-issue for most, but if you plan to use the stand-mode orientation, then this is where the potential for damage seems high.</p><p id=\"7WrcGq\">Despite some of the drawbacks of the xScreen, I’ve had hours of fun with this little display. UPspec Gaming has created something unique here for the Xbox Series S, and it’s in a neat little package that integrates really well. You’re really paying a high $249.99 price tag for that neat integration, particularly when there are so many good portable screens out there that will do just as good a job at half the price. </p><p id=\"XRC78S\">There’s nothing quite like the xScreen, though. It has made me wish I was a kid again, taking my Xbox everywhere with me and not having to worry about a TV to plug into or a good internet connection for Xbox Cloud Gaming. It’s an old-school idea, in a modern and well-executed package.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GiHG4kBjhrhiwKhOCZ1Epegb5tI=/0x184:2640x1566/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23312724/tomwarren_VLS_4561.jpg",
  "description": "This screen makes Xbox gaming more portable.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}