{
  "title": "Yahoo Japan is going dark in Europe",
  "url": "https://www.theverge.com/2022/2/1/22911965/yahoo-japan-europe-offline-regulations-compliance-gdpr",
  "date": "2022-02-01T07:28:40.000Z",
  "author": "Sam Byford",
  "content": "      <figure>      <img alt=\"JAPAN-SKOREA-E-COMMERCE-IT-MERGER\" src=\"https://cdn.vox-cdn.com/thumbor/igGHeAMsnyyIruowvmoON0P4yLo=/0x110:3000x2110/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70456542/1183198474.0.jpg\" />        <figcaption>Photo by STR/JIJI PRESS/AFP via Getty Images</figcaption>    </figure>  <p id=\"OvcrmD\">Yahoo Japan has announced that most of its online services will cease to be accessible in the European Economic Area and the UK as of April 6th. The company’s email, credit card, and ebook services will continue to be available, but everything else is going dark.</p><p id=\"Q0Idsm\">The given reason is the cost of complying with European regulations, which would include <a href=\"https://www.theverge.com/2018/5/22/17378688/gdpr-general-data-protection-regulation-eu\">GDPR</a>. In a <a href=\"https://privacy.yahoo.co.jp/notice/globalaccess.html\">statement</a>, Yahoo Japan says it would be difficult to provide continuous service for customers in the EEA and UK, and went further in <a href=\"https://www.itmedia.co.jp/news/articles/2202/01/news107.html\">telling Japanese publication <em>IT Media</em></a> that it would be “impossible” to meet the cost of compliance and respond to the related laws.</p><aside id=\"Gfxgze\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Everything you need to know about GDPR\",\"url\":\"https://www.theverge.com/2018/3/28/17172548/gdpr-compliance-requirements-privacy-notice\"}]}'></div></aside><p id=\"zvtOpf\">Yahoo Japan is an entirely separate entity to the American former web giant <a href=\"https://www.theverge.com/2021/9/2/22653652/yahoo-aol-acquired-apollo-global-management-private-equity\">now owned by the Apollo private equity firm</a>. Set up as a joint venture between the US Yahoo and SoftBank in 1996, Yahoo Japan remains extremely popular in Japan as a web portal and search engine, with countless other Japanese-language services including online auctions, e-commerce, and well-regarded weather and maps apps.</p><p id=\"2rG22o\">The decision to pull out of Europe comes as Yahoo Japan is heightening its efforts to expand beyond its home market. Yahoo Japan’s SoftBank-owned parent Z Holdings merged with dominant Japanese chat app Line last year to create a new tech giant with worldwide ambitions. Takeshi Idezawa, Line CEO and now co-CEO of Z Holdings alongside Yahoo Japan CEO Kentaro Kawabe, <a href=\"https://english.kyodonews.net/news/2021/03/6805a66d032a-yahoo-japan-operator-line-merge-to-expand-services-globally.html\">said at the time</a> that the new company “would like to launch a global smartphone app.”</p><p id=\"ZZWwPS\">Yahoo Japan has evidently decided that its user base in Europe isn’t large enough to be worth the cost of abiding by EU regulations. Its services are mostly only provided in Japanese, so its reach will have been limited, but it’s notable that a web company with such a huge presence in its own major market feels unable to operate in Europe.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/jrs_brfRt-CmlVIuP6SIVjQvNGk=/0x325:3000x1896/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23209431/1183198474.jpg",
  "description": "A victim of GDPR?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}