{
  "title": "Yelp will reimburse employees who need to travel to access abortion services",
  "url": "https://www.theverge.com/2022/4/12/23022695/yelp-travel-reimburse-employees-travel-abortion-access-texas-law",
  "date": "2022-04-12T23:20:42.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Yelp\" src=\"https://cdn.vox-cdn.com/thumbor/15pD5s_i1IXikamgGxQGcnuC5JU=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70742421/866218082.0.jpg\" />        <figcaption>Photo by Smith Collection/Gado/Getty Images</figcaption>    </figure>  <p id=\"QuA7oO\">Starting next month, Yelp says it will cover the costs of travel if an employee or their dependent needs to leave the state to access abortion services, as first reported by <a href=\"https://www.nytimes.com/2022/04/12/business/yelp-abortion-employees.html\"><em>The New York Times</em></a>. The company employs around 200 people in Texas, where legislators passed the strictest abortion law in the country last September.</p><p id=\"uiQM2e\"><a href=\"https://www.vox.com/2021/8/31/22650303/supreme-court-abortion-texas-sb8-jackson-roe-wade-greg-abbott\">The law, called SB 8</a>, outlaws abortions after six weeks, and provides no exception for rape or incest. It also allows private citizens to sue abortion providers, as well as anyone who “aids or abets” an abortion. In line with the new law, <a href=\"https://www.vox.com/policy-and-politics/23021104/texas-abortion-murder-charge-starr-county\">a Texas woman was charged with murder</a> over a self-induced abortion earlier this week, although charges have since been dropped.</p><p id=\"9NNIsX\">Yelp says its health insurance already supports abortion care, but its new policy extends coverage beyond that. According to the <em>NYT</em>, employees will soon be able to provide receipts to their health insurance provider showing proof of travel to an abortion clinic. The insurance company will then reimburse the employee directly while maintaining their privacy, as the process won’t involve Yelp at all. The policy doesn't just apply to employees living in Texas — it’s an option for anyone at the company who needs to travel for abortion access.</p><div class=\"c-float-right\"><aside id=\"mlGQCi\"><q>“This new benefit allows our U.S. employees and their dependents to have equitable access to reproductive care”</q></aside></div><p id=\"K9zyPk\">“We’ve long been a strong advocate for equality in the workplace, and believe that gender equality cannot be achieved if women’s healthcare rights are restricted,” Miriam Warren, the chief diversity officer at Yelp, said in a statement to <em>The Verge</em>. “As a remote-first company with a distributed workforce, this new benefit allows our U.S. employees and their dependents to have equitable access to reproductive care, regardless of where they live.”</p><p id=\"Ng9634\">Last year, Yelp says it double-matched employee donations to organizations fighting the restrictive abortion law in Texas and other states. And in 2018, the platform says it worked to ensure reproductive care providers with abortion services were distinguishable from <a href=\"https://www.vox.com/2020/3/2/21146011/crisis-pregnancy-center-resource-abortion-title-x\">crisis pregnancy centers</a> on Yelp, which often operate with an anti-abortion agenda.</p><p id=\"DqubUI\">Yelp isn’t the first company to respond to the abortion law passed in Texas (<a href=\"https://www.vox.com/policy-and-politics/23012348/oklahoma-abortion-bill-ban\">and elsewhere</a> in <a href=\"https://www.npr.org/2022/03/24/1088623491/arizona-abortion-ban-15-weeks\">the country</a>. Last September, <a href=\"https://www.theverge.com/2021/9/12/22669774/salesforce-relocate-employees-abortion-access-benioff-texas-sb8\">Salesforce told employees</a> it will help them relocate if they were concerned about abortion access in their state. <a href=\"https://www.theverge.com/22656392/lyft-uber-legal-fees-drivers-lawsuit-texas-sb8-abortion-law\">Lyft and Uber also said they would reimburse drivers for any legal fees</a> associated with the Texas law, as they could potentially be sued for “aiding” an abortion by driving a passenger to an abortion clinic.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/tB0xheJGh8f3-r1BZZnypOz2SX4=/0x646:6000x3787/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385439/866218082.jpg",
  "description": "The new policy goes into effect next month.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}