{
  "title": "You can thank (or blame) NYC for Moon Knight’s English accent",
  "url": "https://www.theverge.com/2022/3/23/22993214/oscar-isaac-moon-knight-accent-london-nyc",
  "date": "2022-03-23T21:40:24.000Z",
  "author": "Charles Pulliam-Moore",
  "content": "      <figure>      <img alt=\"Oscar Isaac as Mr. Knight, one facet of Moon Knight’s personality.\" src=\"https://cdn.vox-cdn.com/thumbor/kWNYPS9hp5NMQwLiM4DJ86lMheA=/714x0:3126x1608/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70663648/BLC0142_102_comp_FRA_v0053.1037_R2.0.jpg\" />        <figcaption>Oscar Isaac as Mr. Knight, one facet of Moon Knight’s personality. | Courtesy of Marvel Studios</figcaption>    </figure>  <p id=\"ZZmuSW\">It was clear from <a href=\"https://www.theverge.com/22889548/marvel-moon-knight-trailer-english-accent-villains\"><em>Moon Knight</em>’s first trailer</a> that Steven Grant’s Britishness and vocal quirks are significant details about him that are likely to factor into how the show handles the character’s canonical struggles with dissociative identity disorder. What was less clear, though, was how the decision to depict Moon Knight as an Englishman actually came about as a result of the larger <a href=\"https://www.theverge.com/2019/8/23/20830548/she-hulk-moon-knight-disney-plus-streaming-kevin-feige-marvel-cinematic-universe\">shape of the current MCU</a>.</p><p id=\"sUb508\">Though the Moon Knight of Marvel’s comics was originally born and raised in Chicago before going on to become a marine-turned-costumed superhero, in Disney Plus’ upcoming <em>Moon Knight </em>series, <a href=\"https://www.theverge.com/2021/5/27/22457292/oscar-isaac-moon-knight-disney-plus-casting-marvel\">Oscar Isaac</a> stars as a slightly different version of the titular character who happens —it seems — to hail from jolly old London. When we spoke with Isaac recently during the <em>Moon Knight </em>press junket, he opened up about how bringing <a href=\"https://ew.com/article/2015/12/15/oscar-isaac-star-wars-brother/\">his own biological brother</a> onto the project helped shape his approaches to both Steven Grant and Marc Spector, one of Moon Knight’s alternate personalities.</p><p id=\"ur146P\">“That was really helpful to have someone that’s not only a great actor but also shares my DNA to play off of,” Isaac said of his brother, Mike Hernandez. “But something that I didn’t anticipate was how technically demanding that was going to be — having to show up and decide which character I was going to play first, and then trying to block that out, give my brother notes, and then do the scene, and then switch characters, and then figure it out.”</p><div id=\"dFyelA\"><div ><iframe src=\"https://www.youtube.com/embed/ZtxO9NQHGiY?rel=0\"  allowfullscreen=\"\" scrolling=\"no\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture;\"></iframe></div></div><p id=\"zv4jzg\"><em>Moon Knight</em>, Isaac explained, was always going to be set in London where Marc works as a mild-mannered museum store clerk because Marvel felt “we just have <a href=\"https://www.theverge.com/2022/3/1/22955274/netflix-marvel-shows-disney-plus-release-date\">too many characters in New York</a>.”  When Isaac first signed on to the project, the studio hadn’t quite committed to the idea of any of Moon Knight’s personalities being a Brit, and there was a chance that the hero could have just been <a href=\"https://www.vulture.com/2016/11/doctor-strange-benedict-cumberbatch-american-accent.html\">depicted as an American</a> expat wandering around the city. That changed, though, when Isaac began to see his <em>Moon Knight </em>character as an opportunity to showcase his passion for English comedies like <a href=\"https://deadline.com/2020/12/fox-remake-british-comedy-stath-lets-flats-joe-mande-1234656883/\"><em>Stath Lets Flats</em></a><em> </em>and <em>The Office</em>.</p><p id=\"8hFvYX\">“I thought, ‘There’s an opportunity here to maybe make something,’” Isaac said. “‘What if we make him English? Like, what if Peter Sellars was approached with a Marvel project? What would he do?’”</p><p id=\"p9thtv\">Isaac pointed to Karl Pilkington’s performance in <a href=\"https://www.vulture.com/2011/02/why-ricky-gervais-sadistic-an-idiot-abroad-is-the-funniest-thing-on-tv.html\"><em>An Idiot Abroad</em></a> as another reference point for his Moon Knight, less for his accent and more “for his sense of humor where you can’t tell if he knows he’s being funny.” Like his comics counterpart, <em>Moon Knight</em>’s Marc / Steven is Jewish, and while Isaac didn’t elaborate on how the show will explore that about him, he made a point of noting that London is home to a rather robust Jewish community in areas like Enfield in the north.</p><p id=\"fF82va\">“I started listening to accents that are kind of, you know, Northeast London, and then just committed to that and found this [character],” Isaac said. “It wasn’t just about accent, but it was also about his timidness, but also wanting to connect with people, but not quite knowing how.”</p><p id=\"Tr1TLa\"><em>Moon Knight </em>hits Disney Plus on March 30th.</p><p id=\"yhVAtB\"></p><p id=\"1RCk2N\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IQjOUUQ0MVrVbLXjRDCJ_rfuFuw=/407x3:3466x1605/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23340290/BLC0142_102_comp_FRA_v0053.1037_R2.jpg",
  "description": "Oscar Isaac opens up about where his Moon Knight accent came from.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}