{
  "title": "You might see an ad after you finish today’s Wordle",
  "url": "https://www.theverge.com/2022/4/15/23027502/wordle-spelling-bee-ad-finish-puzzle",
  "date": "2022-04-16T00:41:29.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/reowAKwe7AX73vr99ZEji0ywljg=/0x23:963x665/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70755673/Screen_Shot_2022_04_15_at_3.50.54_PM.0.png\" />        <figcaption>When I finished Friday’s <em>Wordle</em>, I saw an add for the <em>Spelling Bee</em>. | Screenshot by Jay Peters / The Verge</figcaption>    </figure>  <p id=\"dE7rWn\">I just finished Friday’s <em>Wordle</em> — which I am reminding you now is owned by <em>The</em> <em>New York Times</em> for reasons you’ll understand shortly — and when I did, I was surprised to see an addition to the results screen. Under the usual stats, the “next <em>Wordle</em>” countdown, and the share button, there was something new: a small banner advertising another puzzle, the <em>NYT’s</em> <em>Spelling Bee</em>. </p><p id=\"or8yMN\">For fans who appreciate <em>Wordle’s</em> simplicity, the ad may come as a rude surprise. Part of the appeal of <em>Wordle</em> is that simplicity: you take your shot at the day’s puzzle, decide whether or not your journey is <a href=\"https://www.theverge.com/tldr/22881995/wordle-emoji-results-auto-generated-tell-a-story\">worth sharing on Twitter</a>, then close the tab and move on. </p><p id=\"tvo4LP\">And that was by design, as noted in <a href=\"https://www.nytimes.com/2022/01/03/technology/wordle-word-game-creator.html\">the<em> NYT’s</em> profile</a> of <em>Wordle</em> creator Josh Wardle:</p><blockquote><p id=\"i9Lcxg\">But since Wordle was built originally for just Mr. Wardle and Ms. Shah, the initial design ignored a lot of the growth-hacking features that are virtually expected of games in the current era. While other games send notifications to your phone hoping you’ll come back throughout the day, Wordle doesn’t want an intense relationship.</p><p id=\"AO1uDM\">“It’s something that encourages you to spend three minutes a day,” he said. “And that’s it. Like, it doesn’t want any more of your time than that.”</p></blockquote><p id=\"88axIm\">When the <em>NYT</em> bought <em>Wordle</em> <a href=\"https://www.theverge.com/2022/1/31/22911274/wordle-new-york-times-free-word-game-acquisition\">just a few weeks later</a>, it <a href=\"https://www.nytco.com/press/wordle-new-york-times-games/\">did promise</a> that “at the time it moves to <em>The New York Times</em>, <em>Wordle</em> will be free to play for new and existing players, and no changes will be made to its gameplay.” But that promise apparently does not extend to the results screen, which has seen a change. The <em>NYT</em> didn’t immediately respond to a request for comment.</p><p id=\"yUkiOW\">If you’re raising your pitchfork over <em>Wordle’s</em> <em>Spelling Bee</em> ad, though, you should know that <em>Wordle</em> actually owes a lot to the bee-themed spelling game. According to the <em>NYT</em> profile, Wardle and his partner got into <em>Spelling Bee</em> in a big way in 2020, and the decision to limit <em>Wordle</em> players to one game per day “enforced a sense of scarcity, which [Wardle] said was partially inspired by the <em>Spelling Bee</em>.”</p><p id=\"bKqpyz\">So if you’re a fan of <em>Wordle</em>, after you finish <a href=\"https://www.nytimes.com/games/wordle/index.html\">your daily game</a>, you might want to <a href=\"https://www.nytimes.com/puzzles/spelling-bee\">give <em>Spelling Bee</em> a shot</a> — or just wait until tomorrow for a new <em>Wordle</em>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/IsKiz8hbZ4utYGnTUuUyCGo806o=/0x92:963x596/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23393389/Screen_Shot_2022_04_15_at_3.50.54_PM.png",
  "description": "It’s a real shame.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}