{
  "title": "You can now buy a Framework mainboard and turn it into the weird computer of your dreams",
  "url": "https://www.theverge.com/2022/4/22/23037156/framework-mainboard-marketplace-intel",
  "date": "2022-04-22T15:04:37.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ndB908qOPxYV5Ws31LRLxCNRz7Y=/0x57:1796x1254/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70780797/f4c3522a_40ab_4d05_9ba1_49f904ea07ba_Blog21008___SSD_RAM_WiFi___img01.0.jpeg\" />        <figcaption>Image: Framework</figcaption>    </figure>  <p id=\"xrHUXc\">When the Framework Laptop launched, it had <a href=\"https://www.theverge.com/22587205/framework-laptop-review\">all the potential in the world</a> to be both a great laptop and a repairable, upgradeable one. But — and there’s always a but — it was only ever going to work if the ecosystem worked. Framework <a href=\"https://www.theverge.com/2021/10/14/22725935/framework-laptop-modular-marketplace-launches-spare-parts-upgrades-expansions\">needed to build a market</a> around the laptop, so it can be bigger than one company’s feature ideas and release cycles. And more immediately, it needed to prove that it was invested in the idea itself, that Framework wouldn’t just move on to newer and shinier things that break from its upgrade path.</p><p id=\"39W2qJ\">On the larger ecosystem front, Framework’s success is still very much to be determined. But its own intentions don’t seem to have wavered. This week, Framework announced that the Framework Laptop’s mainboard — which includes storage and memory slots, connectors for four of Framework’s expansion cards and four displays, and three different configurations of Intel’s 11th-generation processors — is now <a href=\"https://frame.work/gb/en/blog/mainboard-availability-and-open-source-release\">available separately through the Framework marketplace</a>. The cheapest version, which comes with an i5-1135G7 chip, costs $399. The most expensive, with an i7-1185G7 processor, is $799. </p><p id=\"xoyubd\">Framework also shared all the documentation and 3D-printable designs you’d need to build your own case or device around the mainboard. And you really could build almost anything: if you drop in some storage and power, the Framework Mainboard quickly becomes a functional computer kind of like a souped-up (and much bigger) Raspberry Pi.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/BamILRd6AHXYm9FGsaMbjsCQVtI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23409142/811ce33b_7d28_4227_94d7_01aa77c7188e_blog2205___Mainboard_and_Open_Source_release___web___02.jpeg\">      <cite>Image: Framework</cite>      <figcaption>Framework’s mainboard comes with the designs to build your own case.</figcaption>  </figure><p id=\"F94WnR\"><a href=\"https://frame.work/marketplace\">Framework’s marketplace</a> has continued to grow since the laptop launched last year, though it’s still mostly straightforward computer parts: lots of interchangeable ports, swappable memory, and different types of keyboards, but not much in the way of bold new ideas about devices. That makes sense, given that Framework’s own focus has always been more on upgrades and repairs. And Framework’s primary plan for the mainboards seems to be to give people ways to re-use their old ones after they buy new upgrades. (Like, for instance, when Framework hopefully gets around to offering 12th-gen Intel chips.)</p><p id=\"HXqG2r\">But making the mainboard available separately could also be a way to kickstart a different kind of ecosystem, in which users and developers can build different kinds of computers altogether starting from Framework’s template. All of which is to say, someone please make a Framework-based <a href=\"https://www.theverge.com/2022/2/14/22933735/penkesu-diy-ultracompact-computer-with-mechanical-keyboard\">cyberdeck</a>, and tell me where to buy it.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/64yJsEYsXyZ8vehcrV-cdDaFdZc=/0x185:1796x1125/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23409148/f4c3522a_40ab_4d05_9ba1_49f904ea07ba_Blog21008___SSD_RAM_WiFi___img01.jpeg",
  "description": "Like a souped-up Raspberry Pi",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}