{
  "title": "You can now tell Alexa to plant a tree",
  "url": "https://www.theverge.com/2022/4/11/23020190/amazon-alexa-tree-planting-climate-debate",
  "date": "2022-04-11T16:47:54.000Z",
  "author": "Justine Calma",
  "content": "      <figure>      <img alt=\"Pavagada Solar Farm Propels India Towards Climate Goals\" src=\"https://cdn.vox-cdn.com/thumbor/si26lYgwhS3DM2Z3w-N6OqzQvSU=/0x0:5541x3694/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70736428/1346217396.0.jpg\" />        <figcaption>Workers plant saplings outside the Pavagada Solar Park on October 9, 2021 in Thirumani village, Karnataka, India. | Photo by Abhishek Chinnappa/Getty Images</figcaption>    </figure>  <p id=\"EHQrVD\">Starting today, customers in the US can donate $1 to plant one tree by telling Alexa-enabled devices, “Alexa, grow a tree,” Amazon <a href=\"https://www.aboutamazon.com/news/devices/alexa-grow-a-tree\">announced</a> today. Customers will be able to keep track of<strong> </strong>how many trees they’ve planted in their Amazon Pay account.</p><p id=\"iPv6KZ\">Amazon also said that it’s donating $1 million to the environmental charity it’s partnering with on the initiative, called One Tree Planted. </p><div class=\"c-float-left\"><aside id=\"SlweDM\"><q>It’s worth taking these kinds of efforts<strong> </strong>with a grain of salt</q></aside></div><p id=\"ae5qII\">The money will initially go towards <a href=\"https://alexagrowatree.raisely.com/projects\">four different projects</a> in the US and India. In Centre County, Pennsylvania, the funds will help to reforest land that was razed for mining, logging and agriculture. In California, “hard-working foresters will dedicate time to promote improved vegetation planning and resource management” to prevent wildfires from raging out of control, according to One Tree Planted. In the Pacific Northwest, newly planted trees near rivers and streams are supposed to help keep water clean for salmon spawning grounds that orca whales rely on as a food source. The campaign also says that the fruit trees it plants in India will “fight hunger, improve local economies, and combat climate change.”</p><p id=\"hCkOIQ\">Those are all pretty big claims and extremely<strong> </strong>complex problems, so it’s worth taking these kinds of efforts<strong> </strong>with a grain of salt. Your $1 dollar donation might plant a tree, but it sadly<strong> </strong>doesn’t guarantee that the tree will survive long enough to do the job it’s supposed to do <strong>— </strong>whether that’s feeding a community, reforesting a mountain, or cleaning up salmon habitat. In general, for tree-planting campaigns to have long-term success, there are certain <a href=\"https://www.theverge.com/2019/10/25/20932700/youtubers-climate-change-team-trees\">pitfalls they’ll have to avoid</a>. Organizations need to make sure they’re planting<strong> </strong>the right tree in the appropriate habitat, and it’s best to have buy-in from local community members. </p><div class=\"c-float-right\"><aside id=\"lMUFAo\"><q>These kinds of<strong> </strong>campaigns run the risk of actually doing more damage</q></aside></div><p id=\"lC2uAs\">Otherwise, these kinds of<strong> </strong>campaigns run <a href=\"https://www.theverge.com/2020/1/31/21115862/davos-1-trillion-trees-controversy-world-economic-forum-campaign\">the risk of actually doing more damage</a> to natural habitats and the people who depend on them. One damning <a href=\"https://www.nature.com/articles/s41893-021-00761-z\">study</a> published last year found that tree-planting projects in India, on average, failed to result in bigger forest canopy. Instead, it changed the makeup of the forest away from tree species on which local residents typically relied. And <a href=\"https://www.theverge.com/2020/1/31/21115862/davos-1-trillion-trees-controversy-world-economic-forum-campaign\">experts warn</a> that popular tree-planting initiatives can distract from action that’s more urgently needed to protect the planet — namely, cutting down pollution in the first place.</p><p id=\"TOkmBb\">Amazon’s own environmental footprint has continued to grow with its business in recent years. Its greenhouse gas emissions were nearly 20 percent higher in 2020 than they were in 2019, according to its latest sustainability <a href=\"https://sustainability.aboutamazon.com/pdfBuilderDownload?name=amazon-sustainability-2020-report\">report</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/U0BEsxEI_Junw71g-Of9ZxZirBA=/0x397:5541x3298/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23381999/1346217396.jpg",
  "description": "How helpful that actually is for the planet is another question.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}