{
  "title": "You can now set a lock screen for your Steam Deck",
  "url": "https://www.theverge.com/2022/4/25/23041969/valve-steam-deck-lock-screen-update",
  "date": "2022-04-26T00:05:33.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ihipKjDl2JG8zJGgrq8Z6u587jM=/40x0:1240x800/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70792903/9d5c89372b3d55a7910c158de34c7768f658f735.0.jpeg\" />        <figcaption><em>Here’s what a Steam Deck lock screen looks like.</em> | Image: Valve</figcaption>    </figure>  <p id=\"MInrHU\">Valve’s newest Steam Deck update adds a lock screen to the handheld gaming PC, <a href=\"https://store.steampowered.com/news/app/1675200/view/3216142491800836085\">the company announced Monday</a>. The change means you can now set a PIN when you wake the device from sleep, which could prevent people from accessing your device who shouldn’t be. After you’ve installed the update, you can turn on the lock screen and set a PIN in the Steam Deck’s settings menu from a new Security tab.</p><p id=\"PChJ6A\">The update also adds a handful of other welcome changes. The achievements page has gotten a “refresh,” and Valve says it’s now “faster to load and easier to navigate.” There are localized keyboards for 21 languages and layouts, and you can enable multiple keyboards at the same time, though Valve notes that it’s “currently working” on keyboards for Chinese, Japanese, and Korean.</p><p id=\"InwrTY\">And the Steam Deck now supports games and apps with multiple windows, such as web browsers or games with launchers, and you’ll be able to toggle between windows by pressing the Steam button while in a game.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/JvwhltEYpW88Dt5qWdSJjvpE32E=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23416120/72e418a02988b3c3d33c8dd695b6be280eb62e42.jpeg\">      <cite>Image: Valve</cite>      <figcaption><em>A screenshot of switching windows in Chrome on Steam Deck.</em></figcaption>  </figure><p id=\"UDicH6\">The update is available now, and you can read <a href=\"https://store.steampowered.com/news/app/1675200/view/3216142491801797532\">the full patch notes here</a>. You can get the update going by pressing the Steam button, selecting Settings, and then System, and then Software Updates. “Since so many bits are being updated today, it may take a few minutes to apply the changes to Steam Deck after downloading and restarting,” <a href=\"https://twitter.com/OnDeck/status/1518735005488345089\">Valve said in a tweet</a>. “Please be patient while your Steam Deck updates.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/5ryZXVkvYFqfc0wImQCKpu7r0WY=/0x65:1280x735/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23416121/9d5c89372b3d55a7910c158de34c7768f658f735.jpeg",
  "description": "You can set a PIN from settings.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}