{
  "title": "You can now try 1Password’s customizable redesign on your iPhone and iPad",
  "url": "https://www.theverge.com/2022/4/13/23024443/1password-8-early-access-ios-iphone-ipad-beta-redesign-password-manager",
  "date": "2022-04-14T00:37:49.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Ceony5KNfp9DwBkIUV1yem0w51w=/0x22:1300x889/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70746864/overview.0.jpg\" />        <figcaption><em>The app’s big redesign has come to iOS (at least for those brave enough to beta test).</em> | Image: 1Password</figcaption>    </figure>  <p id=\"sKW7aT\">1Password <a href=\"https://blog.1password.com/1password-8-ios-early-access/\">released an early access version of 1Password 8 </a>for iOS on Wednesday, which brings a redesigned interface and new backend to iPhone and iPad users. The new version of the app, which 1Password says will eventually make its way to all its supported platforms, has been available in early access mode <a href=\"https://www.theverge.com/2021/8/11/22619846/1password-8-macos-early-access-password-manager-app\">for Mac since August</a>, and was <a href=\"https://www.theverge.com/2021/11/16/22784996/1password-version-8-windows-release-download-features\">released for Windows in November</a>.</p><p id=\"jOY1PL\">As a longtime user of 1Password 7, the redesign was immediately obvious when I opened the beta version of the app. As far as I can tell, almost every icon has been changed to be a little more fun and colorful, and the interface feels more modern now.</p><div id=\"x06JJu\"><div data-anthem-component=\"imageslider:11143165\"></div></div><p id=\"Id6zpm\">1Password 7 opened to a favorites screen with a few recently used passwords. Other than marking or unmarking logins as favorites, there wasn’t much you could do to customize the screen. This was always a little frustrating for me, because I basically never had any use for the screen, and would immediately bounce to search.</p><p id=\"RW8ZvT\">1Password 8, on the other hand, has a home screen that lets you access things like your vaults, categories, and lists of recently created or modified passwords. You can also change it to fit how you organize and access your passwords — if you’re a big user of categories, favorites, and tags, you can move those options to the top. If you dump everything into one folder, you can hide everything but “All Items”. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kydINAkRwgBgZyP0PyBc8LXHRBU=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23388556/customise_home.jpg\">      <cite>Image: 1Password</cite>      <figcaption><em>Some of the home screen items are collapsable lists.</em></figcaption>  </figure><p id=\"EfzKVU\">The old (well, current) version of the app would let you know if one of your passwords had been compromised, and could alert you if the login you were viewing had a reused password, but there wasn’t a single screen that let you manage your overall security. The new version of the iOS app adapts the desktop version’s Watchtower section for mobile, which also gives you an overall security score. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HiT7PPEWin6_eI0qMYBJSFbqjK8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23388560/watchtower.jpg\">      <cite>Image: 1Password</cite>      <figcaption><em>Watchtower brings 1Password’s full security checkup to the app.</em></figcaption>  </figure><p id=\"99JNx0\">There’s been some controversy around 1Password 8, after the company announced that its Mac app’s user interface would be powered by Electron (the web browser tech behind apps like Slack, Evernote, and Discord) instead of native code like SwiftUI or AppKit. Some user\ts worried that the change would make the password manager more resource-intensive to run, or that it would feel less like a real Mac app. However you feel about that change, it’s not really a factor with this iOS app, which <a href=\"https://blog.1password.com/1password-8-the-story-so-far/\">1Password has said</a> uses SwiftUI for the interface, and Rust for the core. </p><p id=\"bIsm8u\">Of course, there are other reasons you may not want to use an early access version of a password manager. While it’s been okay for me so far, there will probably be a few bugs for testers to catch. If your phone’s password manager is absolutely critical to your work and / or life, it’s probably best to wait until an official release, especially since this update is a major change from the previous version. If you’re okay with increased odds of flakiness, though, and want to try the redesign for yourself as soon as possible, you can join the TestFlight using the link in <a href=\"https://blog.1password.com/1password-8-ios-early-access/\">1Password’s blog post</a>.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/a0WCd-Sgo1-QnKi5Tf5mpynd_XQ=/0x115:1300x796/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23388493/overview.jpg",
  "description": "It features a new home screen and Watchtower.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}