{
  "title": "You can make Netflix forget",
  "url": "https://www.theverge.com/2022/4/22/23037360/netflix-forget-button-streaming",
  "date": "2022-04-22T18:48:32.000Z",
  "author": "Alex Cranz",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/GuJNvCuv_pfdQ0WMOfBxVHKM0B4=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70781904/acastro_181101_1777_netflix_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"Xia8vi\">Two months ago, my best friend stayed with me and watched all of <em>Emily in Paris</em> on my Netflix account. I have spent the time since flitting past worthless recommendation after worthless recommendation because, while I enjoy a frothy dramedy, my taste is different than hers and Netflix has failed to grasp that.</p><p id=\"8KwvrP\">A “forget what you just saw” button on Netflix would fix this. But when you’re using the Netflix app on your phone, tablet, set-top box, TV, or even, if that’s a thing you do, your Facebook Portal, there is no button to forget what you have seen. There is just the ruin of your recommendations after a friend visits or your kid goes on a <em>Cocomelon</em> binge. </p><p id=\"a6kGWi\">But, as <a href=\"https://twitter.com/TheJulianGomez/status/1517520305144487936?s=20&amp;t=s7kbyA75DpC4Ed5wS_vD5w\">this tweet pointed out</a>, there is actually a Forget button. Well okay, not a button. You can’t make Netflix forget as much as hide what you have seen. </p><aside id=\"0ie2Ee\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Netflix just lost subscribers for the first time in over a decade\",\"url\":\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\"}]}'></div></aside><p id=\"Bfd6RC\">But doing it isn’t easy. First, you have to be looking at Netflix on a browser. Then you have to go to <strong>Accounts</strong>, which gives you access to a lot more menus and settings than it does in any of the Netflix apps. Then you have to choose the profile you want to hide your shame watches in and go to <strong>Profile &amp; Parental Controls</strong>. <em>Then</em> you have to open up <strong>Viewing Activity</strong>. Only then can you find the forget button, which is actually a “hide icon” that sits next to the content you're seeking to Men in Black flash from your profile.</p><p id=\"0cvPTm\">If there’s just something you started watching and want kicked out of your “Continue Watching” queue, there’s an actual “<a href=\"https://www.theverge.com/2022/2/1/22912474/netflix-continue-watching-row-remove-tv-shows-movies-update\">Remove from Continue Watching</a>” button available, too, but it's limited to certain TV apps, the web browser, and some mobile apps. So I can remove <em>Is It Cake? (</em>I only watched one episode and it was bad!) from my queue on iOS but not on Apple TV.</p><p id=\"wOcoJI\">In both cases, it is not an easy or intuitive process. The only reason I even went and excised <em>Emily in Paris</em> or <em>Is It Cake?</em> from my viewing history is that I was writing this and wanted to confirm the removal process as <a href=\"https://help.netflix.com/en/node/22205\">outlined by Netflix</a>.</p><p id=\"OQuE3K\">This shouldn’t be so hard. Features as basic as a “whoops that wasn’t to my taste and I’d prefer to avoid it in the future” button shouldn’t be limited to one specific OS or hidden behind myriad menus. </p><p id=\"RC2RRx\"><a href=\"https://www.theverge.com/2022/4/19/23032399/netflix-lost-subscribers-q1-2022-earnings\">Netflix lost 200,000 subscribers this last quarter</a> — its first loss in a decade. It blamed a lot of factors, including <a href=\"https://www.theverge.com/2022/4/19/23032643/netflix-password-sharing-subscribers-100-million\">password sharing</a>, the war in Russia, and increased competition. I’m not naive enough to say it would win back 200,000 subscribers with a more intuitive design, but I do think the bad-button situation is emblematic of a larger problem at Netflix: it's been coasting.</p><div class=\"c-float-right\"><aside id=\"a1dyY4\"><q>Netflix can’t afford to coast</q></aside></div><p id=\"VL8fcy\">And Netflix can’t afford to coast. It’s facing real competition for the first time since it piledrove Blockbuster into oblivion. It’s not just up against Hulu and a handful of ill-conceived money grabs like CBS All Access anymore. The streaming services all making a frantic money grab are, <a href=\"https://www.theverge.com/2022/4/21/23035703/cnn-plus-shutting-down\">for the most part</a>, thoughtful in their approach and using enormous culturally relevant back catalogs of shows like <em>The Office</em>, <em>The</em> <em>Sopranos</em>, <em>Star Trek</em>, and the entire Disney animated film lineup to quickly snap up subscribers. </p><p id=\"4rTfDV\">Netflix? It has a whole mess of two-season shows half greenlit by an algorithm based on your viewing history and a “<a href=\"https://www.youtube.com/watch?v=GV3HUDMQ-F8\">tudum</a>” sound that isn’t as iconic <a href=\"https://www.theverge.com/2021/8/25/22641142/netflix-tudum-fan-trailers-interviews-announcements-date-movies-shows\">as it thinks</a>. I’ll admit, I still watch a lot of those shows. I’m going to binge all of <em>Russian Doll</em> this weekend, and I’ll probably do the same when <em>Stranger Things</em> returns later this year. But I can’t guarantee I’ll stay subscribed between shows like I will HBO Max.</p><p id=\"TuWrAr\">Netflix is trying to address its catalog problem, and it has been for years, but it will need to do more than find its own version of <em>The Office</em> to compete. It can’t just coast on being first. It needs more than that. It will need things like an easy-to-navigate app that suggests the stuff you want to watch instead of the stuff your best friend watched when she slept on your couch. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/z7NKhXwT3kSZUT8D0tQmI_Moz74=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13370033/acastro_181101_1777_netflix_0001.jpg",
  "description": "Please help me forget the bad TV I’ve watched.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}