{
  "title": "You can now drill the best wireless charging AirPower alternative right into your desk",
  "url": "https://www.theverge.com/2022/2/21/22938809/zen-libery-wireless-charger-built-in-airpower-price",
  "date": "2022-02-21T07:00:00.000Z",
  "author": "Chaim Gartenberg",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IhS2W1o5INCVBmPJNivooEyjLuU=/235x0:2766x1687/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70532840/Liberty_built_in_Lifestyle_2__2_.0.jpg\" />        <figcaption>Image: Zens</figcaption>    </figure>  <p id=\"1rRnle\">Zens is expanding its excellent alternative to Apple’s failed AirPower charger, <a href=\"https://www.theverge.com/21242641/zens-liberty-review-wireless-charger-apple-airpower-coils-qi-charging-price\">the Liberty wireless charger</a>, with a new model: the Liberty Built-in charger — which, as the name implies, is designed to be integrated directly into your desk itself for an even more streamlined look. </p><p id=\"2cjnjF\">The original Zens Liberty charger was released back in 2020 and offered an innovative 16-coil design that allowed you to simply place a Qi-compatible phone or device anywhere on the wireless charging pad instead of having to carefully align charging coils or rely on a MagSafe-style magnetic system. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/nmgM6AiPqjQCyJMCG4sjfaTBapM=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23251844/Liberty_Built_in_Black__1_.png\">      <cite>Image: Zens</cite>  </figure><p id=\"AW8BtQ\">But the original model rather boringly sat <em>on top</em> of your desk, while the new Liberty Built-in charger is designed to be integrated directly into your nightstand or desktop for a more seamless design. It also adds an extra 30W USB-C charging port, allowing you to directly plug in a phone or tablet for faster charging.</p><aside id=\"jFlaK3\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The Zens Liberty is the AirPower wireless charger that Apple couldn’t make\",\"url\":\"https://www.theverge.com/21242641/zens-liberty-review-wireless-charger-apple-airpower-coils-qi-charging-price\"}]}'></div></aside><p id=\"72BeOA\">The Zens Built-in is likely destined more for companies to buy in bulk and integrate into office setups rather than for individual customers to buy and drill apart their nightstands in order to get a slightly nicer looking charging setup, although there’s nothing stopping you from buying one and trying it yourself (aside from the necessary woodworking tools and experience, anyway). </p><p id=\"9mHmi8\">The biggest issue with the new built-in model — aside from the carpentry skills needed to actually integrate it into a desk — is that none of the chargers are <em>quite</em> powerful enough. Instead of wirelessly charging two devices at up to 15W each, like the original Liberty charger, the built-in model tops out at 10W each (likely due to the fact that the charger has to share power to the added USB-C port). And while the integrated USB-C charger is shown ambitiously charging a laptop in Zens’ promo image, 30W just isn’t enough for most modern USB-C laptops. </p><p id=\"UCbcyt\">That’s especially true given the price: Zens’ built-in starts at €249.99 (roughly $284) for the plain white model, while the far more interesting-looking glass model costs €279.99 (about $318). That’s a substantial price increase over the original desktop model, which costs $169 in the US for the regular version and $199 for the glass-topped model. </p><p id=\"lPRRZs\">Still, even with those caveats, the new Zens Liberty Built-in is an attractive-looking evolution of the original design. And while it’s unlikely that I’ll be hacking apart my Ikea nightstand anytime soon to try and add an integrated wireless charger to it, I can certainly understand the appeal. </p><p id=\"Qnut2x\">The Zens Liberty Built-in wireless charger will be available in March.</p><p id=\"4mauiw\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/vX6tetMpfwHAi59xMJW_8a279fI=/0x59:3000x1630/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23251843/Liberty_built_in_Lifestyle_2__2_.jpg",
  "description": "Some carpentry experience required",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}