{
  "title": "Your next Uber ride will have an extra fee for gas — even if it’s in an EV",
  "url": "https://www.theverge.com/2022/3/11/22973474/uber-temporary-fuel-surcharge-fee-ev",
  "date": "2022-03-12T00:00:28.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/BJLtmem_kl7NOBb2T-kDn2picwY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70611453/acastro_180927_1777_uber_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"AF6hnx\">Uber is adding a “temporary fuel surcharge” to fares to help drivers pay for record-high gas prices around the country, the company announced Friday. “Rides customers will pay a surcharge of either $0.45 or $0.55 on each Uber trip, and Eats customers will pay either $0.35 or $0.45 on each Uber Eats order, depending on their location,” Uber’s head of driver operations in US and Canada, Liza Winship, <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.uber.com%2Fblog%2Ffuel-surcharge%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F3%2F11%2F22973474%2Fuber-temporary-fuel-surcharge-fee-ev\" rel=\"sponsored nofollow noopener\" target=\"_blank\">said in a blog post</a>. </p><p id=\"wi9zJV\">The entirety of the surcharge will be passed on to drivers, and the plan is for the surcharge to be in place for the next 60 days. However, Winship cautions that “we will continue to monitor gas prices and may make additional changes.” And this temporary fuel surcharge will even be in place for rides or deliveries done in an EV, “which we hope will serve as additional incentive for drivers to transition to EVs going forward,” Uber spokesperson Harry Hartfield tells <em>The Verge</em>.</p><p id=\"i2VSNd\">In her blog post, Winship listed some of Uber’s electric vehicle benefits, including higher earnings for drivers who use battery EVs, a $6,000 discount off a Nissan Leaf, and discounts on some vehicle charging. But a fuel surcharge and EV benefits may not be enough to fully prevent the sting of higher gas prices. As my colleague Andy Hawkins <a href=\"https://www.theverge.com/2022/3/11/22973174/gas-prices-electric-vehicles-inventory-russia\">wrote today</a>, EVs are still out of reach for many because of things like supply chain constraints, low inventory, and expensive prices. And because there are many reasons that gas prices have increased, including Russia’s invasion of Ukraine, they could stay high for some time.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LV2xb2Iu_Fy0r8fE-FjH2sNH6XY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13175179/acastro_180927_1777_uber_0002.jpg",
  "description": "High gas prices mean Uber fares will be more expensive.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}