{
  "title": "YouTube’s new tool for brands means you don’t have to see the same ads nauseam ",
  "url": "https://www.theverge.com/2022/5/19/23129744/youtube-advert-spam-ad-frequency-tool-brand-ctv-apps-mobile-desktop",
  "date": "2022-05-19T11:57:22.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/meGHQcQAIq2zK3RSqyLPPOPn1EQ=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70886823/acastro_180321_1777_youtube_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"vBLJRO\">Sometimes it’s a little <em>too</em> obvious when a company is launching a big advertising campaign on YouTube. If you’re a regular viewer, you may end up seeing the same ads over and over again. This week, though, YouTube announced that it’s <a href=\"https://blog.youtube/news-and-events/youtube-joins-the-upfronts-building-the-youtube-of-the-future-for-viewers-creators-and-advertisers/\">expanding the power of tools</a> that let brands control how often their ads are shown to specific users. </p><p id=\"maxLtB\">This ad frequency tool (named Display &amp; Video 360 in marketing jargon) was actually <a href=\"https://blog.google/products/marketingplatform/360/dv360-frequency-ctv/\">launched in February</a> to cover ad campaigns running across different smart TV apps, including YouTube’s app and apps from rivals like Hulu. But YouTube has confirmed to <em>The Verge</em> that the program also counts ads shown not only on smart TV apps, but across its mobile and desktop platforms. That should mean less ad spam for viewers.</p><p id=\"mwUSWS\">But why does YouTube care? Well, because seeing the same advertisements over and over isn’t just a pain for consumers — it’s bad for companies, too. They want to know not only that they’re not annoying would-be customers, but that they’re not wasting money by showing the same person the same ad too many times. </p><p id=\"eBnPev\">As YouTube explained <a href=\"https://blog.youtube/news-and-events/youtube-joins-the-upfronts-building-the-youtube-of-the-future-for-viewers-creators-and-advertisers/\">in a blog post aimed at advertisers</a>: </p><blockquote><p id=\"eywa1G\">Now, you can compliment your reach by actively setting your weekly frequency goal – a solution only YouTube can provide. Combining our unmatched audience reach and leading machine learning capabilities, advertisers will now be able to optimize how many times viewers see their ads in a week. Not only does this mean more efficient spend, but crucially, a better experience for viewers.</p></blockquote><p id=\"0BOIzz\">It’s up to brands to impose those limits, of course, but here’s hoping they know the best ad campaigns aren’t the ones that hammer you over and over again with the same message. </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/JIKkqNXULTL-gIw6Z7APYJeDKnU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10480479/acastro_180321_1777_youtube_0002.jpg",
  "description": "Brands can limit how often their ads are shown to users",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}