{
  "title": "YouTube blocks Russian news channels RT and Sputnik",
  "url": "https://www.theverge.com/2022/3/1/22956114/youtube-blocks-russian-media-rt-russia-today-sputnik-europe",
  "date": "2022-03-01T10:30:23.000Z",
  "author": "James Vincent",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/A8oQzOCiDYzEoQQbXskOFupFwBE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70563925/acastro_180321_1777_youtube_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"RUGvYF\">YouTube has blocked Russian news channels <em>RT</em> and <em>Sputnik</em> across Europe in response to Russia’s invasion of Ukraine. The Alphabet-owned company confirmed the news <a href=\"https://twitter.com/googleeurope/status/1498572529409179648\">on Twitter</a>, saying it would “take time for our systems to fully ramp up” and that it would continue to “monitor the situation around the clock to take swift action.”</p><p id=\"1aMkLv\">It’s the latest example of internet platforms blocking Russian media outlets in response to the war. Yesterday, Meta blocked <em>RT </em>and <em>Sputnik</em> on both <a href=\"https://www.theverge.com/2022/2/28/22955542/facebook-meta-blocks-rt-sputnik-eu-instagram\">Instagram and Facebook</a> after receiving requests to do so from a number of governments in the EU. TikTok <a href=\"https://www.npr.org/2022/02/28/1083633239/facebook-and-tiktok-block-russian-state-media-in-europe\">also banned</a> the two channels. YouTube had already stopped these outlets from <a href=\"https://www.theverge.com/2022/2/26/22952439/youtube-bans-ads-rt-russia-channels-google-ukraine\">generating revenue on its platform</a> via advertising and restricted access to these channels in Ukraine itself. </p><p id=\"WVeCts\">Russia’s invasion of its neighbor has triggered an information war across various online channels, as both sides spread news reports and citizens and soldiers share frontline images and videos. Many European nations have called on platforms to do more to stop the spread of Russian misinformation. In an open letter, the leaders of Poland, Lithuania, Latvia and Estonia, said that Google, YouTube, Facebook, and Twitter had become accessories to Russian aggression by allowing the country space on their sites and apps. </p><div id=\"ubmplV\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Due to the ongoing war in Ukraine, we’re blocking YouTube channels connected to RT and Sputnik across Europe, effective immediately. It’ll take time for our systems to fully ramp up. Our teams continue to monitor the situation around the clock to take swift action.</p>— Google Europe (@googleeurope) <a href=\"https://twitter.com/googleeurope/status/1498572529409179648?ref_src=twsrc%5Etfw\">March 1, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"Qx8VuU\">“Although the online platforms have undertaken significant efforts to address the Russian government’s unprecedented assault on truth, they have not done enough,” said the letter, as <a href=\"https://www.reuters.com/technology/google-facebook-twitter-must-combat-ukraine-fake-news-polish-baltic-leaders-2022-02-28/\">reported by <em>Reuters</em></a>. “Russia’s disinformation has been tolerated on online platforms for years; they are now an accessory to the criminal war of aggression the Russian government is conducting against Ukraine and the free world.”</p><p id=\"9oUmxD\">The president of the EU Commission, Ursula von der Leyen, also said that the bloc would ban “the Kremlin’s media machine.” <a href=\"https://twitter.com/vonderleyen/status/1497973706831929348\">Said von der Leyen</a>: “The state-owned <em>Russia Today</em> and <em>Sputnik</em>, and their subsidiaries, will no longer be able to spread their lies to justify Putin’s war. We are developing tools to ban their toxic and harmful disinformation in Europe.”</p><p id=\"hk0xcz\">In response, Russia too has blocked or limited access to a number of US tech platforms, including <a href=\"https://www.reuters.com/technology/twitter-says-its-site-is-being-restricted-russia-2022-02-26/\">Twitter</a> and <a href=\"https://www.theverge.com/2022/2/25/22950874/russia-facebook-blocked-roskomnadzor-media-censorship\">Facebook</a>. Last Friday, Russia’s tech and communications regulator, Roskomnadzor, accused Facebook of violating “the rights and freedoms of Russian citizens.” </p>",
  "image": "https://cdn.vox-cdn.com/thumbor/LNtr7T08eSZ-Lq-js6X2tYhJQXE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10581347/acastro_180321_1777_youtube_0002.jpg",
  "description": "New bans in the information war",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}