{
  "title": "YouTube will exclusively stream 15 MLB games this season",
  "url": "https://www.theverge.com/2022/4/14/23025552/youtube-mlb-game-of-the-week-2022-15-games",
  "date": "2022-04-14T18:55:11.000Z",
  "author": "Chris Welch",
  "content": "      <figure>      <img alt=\"Colorado Rockies v Texas Rangers\" src=\"https://cdn.vox-cdn.com/thumbor/2eSoQvXfUgGhDR61m4u8s3szmME=/126x0:4827x3134/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70749793/1239925388.0.jpg\" />        <figcaption>Photo by Brandon Wade/Getty Images</figcaption>    </figure>  <p id=\"ie1b1F\">YouTube and Major League Baseball have <a href=\"https://www.mlb.com/news/youtube-mlb-renew-partnership-for-2022-season\">renewed their streaming pact</a> for the 2022 season, which will result in 15 regular-season games being shown exclusively on the platform. The first will be streamed on May 15th between the Washington Nationals and Colorado Rockies.</p><p id=\"RXgVUi\">The news continues MLB’s effort to reach viewers across many different streaming services. Here’s a breakdown of what’s happening over the current season:</p><ul><li id=\"R3MBmj\"><strong>Apple TV Plus </strong>has <em>Friday Night Baseball</em>, a weekly doubleheader available in eight countries exclusively on Apple TV Plus throughout the regular season.</li><li id=\"srBdjD\"><strong>Peacock</strong> will stream 18 early Sunday games beginning May 8th, with all but one exclusive to the platform.</li><li id=\"0xtR8S\"><strong>Amazon Prime Video</strong> is exclusively streaming 21 New York Yankees games in the team’s home market during the 2022 season. Amazon already simulcasts in-market games after acquiring a stake in the YES Network in 2019.</li><li id=\"84qjoj\"><strong>YouTube</strong> says <a href=\"https://www.mlb.com/news/youtube-mlb-renew-partnership-for-2022-season\">15 games will be available</a> “live, for free, to fans around the world in 182 countries.”</li></ul><p id=\"86Uq3I\">One welcome improvement for the YouTube games is that they’ll be showcased in better quality: the feed will now be 1080p with a 60fps frame rate, <a href=\"https://www.cnet.com/tech/services-and-software/youtube-will-stream-15-live-mlb-games-for-free-starting-in-may/\">according to <em>CNET</em></a>, up from the 30fps 720p stream from previous years. MLB also says several “only-on-YouTube” features will be included, such as “live chat featuring game commentary from MLB superfan YouTube creators,” in-game polls, and unique replays and real-time stats for YouTube TV subscribers. </p><p id=\"jBn8Ah\">These deals are making things somewhat complicated for die-hard fans to watch their favorite team(s). Since the exclusive games aren’t being shown on regional sports networks, having MLB.TV and a local (or internet) TV package doesn’t cut it anymore if you refuse to miss any action throughout the season. But then again, the baseball season is very, very long, and maybe it’s worth doing some hopping between services if these moves successfully bring new, younger fans into the game and increase viewership. That’s the whole point, after all.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UUY2Hwv71nDJjNxSAuGMFWPStNY=/0x0:4827x2527/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23390246/1239925388.jpg",
  "description": "Want to watch every MLB game? You’ll need many services.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}