{
  "title": "YouTube is recovering from outage, fixing sidebar and casting",
  "url": "https://www.theverge.com/2022/4/12/23022541/youtube-sidebar-outage-settings-account-switch-sign-in",
  "date": "2022-04-12T23:46:42.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IcsRBxouLWfu-_a70cKO3Br_wkU=/0x0:2100x1400/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70741702/Screen_Shot_2022_04_12_at_12.57.36.0.png\" />    </figure>  <p id=\"CPFlML\">If you logged onto YouTube today, you may have noticed that something was off with the homepage: the sidebar that lets you access things like your <a href=\"https://www.youtube.com/feed/subscriptions\">subscriptions feed</a>, <a href=\"https://www.youtube.com/feed/trending\">trending videos</a>, and “Library” that keeps your <a href=\"https://www.youtube.com/playlist?list=WL\">Watch Later list</a> and video history, was missing (though you can access some of the pages by clicking on the links we’ve included). The issues plagued the site for a few hours on Tuesday, according to reports from users on Twitter.</p><p id=\"nb688Y\">Some users were also cut off from trying to cast videos to a smart TV or watch streams from a game console.</p><p id=\"F3eCzc\">The account menu, which lets you switch accounts, manage settings, and view your channel, was also broken. Users could still watch videos from your homepage or search, but people who like to carefully manage their YouTube experience or creators who weren’t logged into the correct account had a tough time using the site. </p><div id=\"svTBHN\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Getting reports from around the   that some of you are having trouble with certain features across YouTube services (e.g. logging in, switching accounts &amp; using the navigation bar) – we’re aware &amp; working on a fix.<br><br>Sharing updates as we have them here → <a href=\"https://t.co/wOtEBLiWAC\">https://t.co/wOtEBLiWAC</a></p>— TeamYouTube (@TeamYouTube) <a href=\"https://twitter.com/TeamYouTube/status/1513978146307158018?ref_src=twsrc%5Etfw\">April 12, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"9Mjomn\">YouTube hasn’t given the all-clear yet, though the amount of user complaints seems to have dwindled. At around 4:30PM ET, the company <a href=\"https://support.google.com/youtube/thread/159624032\">wrote a post</a> saying that it’s aware of the issue and is working on a fix. Around 7:50PM ET, the company <a href=\"https://support.google.com/youtube/thread/159624032?hl=en&amp;msgid=159647735\">updated the thread</a> to say that the issues were “all fixed,” and that users should be able to “log in, switch between accounts, and use the account menu &amp; navigation bar across all services (YouTube, YouTubeTV, YouTube Music, YouTube Studio) and devices.” The company’s original post also mentioned issues casting to TVs or game consoles, using YouTube Studio features, and “No internet connection” errors interrupting video playback.</p><p id=\"1acUkV\">Throughout the outage, the YouTube app still let users access their subscriptions and Watch Later lists.</p><p id=\"hQ0SK8\"><em><strong>Update April 12th, 7:58PM ET: </strong></em><em>Added update from Google.</em></p><p id=\"8jooup\"><em><strong>Update April 12th, 7:46PM ET:</strong></em><em> Updated to reflect that the outage is being resolved.</em></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/T3AXnmj_YJ6l2xCc_gPLFo3i2XM=/0x0:2100x1099/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23385167/Screen_Shot_2022_04_12_at_12.57.36.png",
  "description": "YouTube’s issues are making it tough to switch accounts.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}