{
  "title": "YouTube’s tipping feature is now available to more creators ",
  "url": "https://www.theverge.com/2022/4/26/23041651/youtube-expanded-super-thanks-tipping",
  "date": "2022-04-26T16:00:00.000Z",
  "author": "Mia Sato",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gLpz0_GK0K_QXU99tahL7BLvNYw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70795164/acastro_180403_1777_youtube_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"lpMCQu\">YouTube is expanding its Super Thanks tipping program, giving more creators another way to monetize their presence on the platform. </p><p id=\"EmQRVV\">Super Thanks, which allows fans to send creators tips directly on videos, was previously in beta since being <a href=\"https://www.theverge.com/2021/7/20/22584330/youtube-tipping-feature-super-thanks\">announced</a> last year. Tip amounts vary between $2 and $50, and fans can include a custom comment when they send creators money. The program is now open to all eligible YouTube Partner creators in 68 countries, the company announced in a blog post.</p><p id=\"gkHpqO\">YouTube has introduced a variety of ways creators can monetize interactions with fans and viewers. In addition to Super Thanks, a feature called <a href=\"https://www.theverge.com/2017/1/12/14249630/youtube-super-chat-pay-pin-comments-live-stream\">Super Chat</a> allows livestream audience members to pay to have their comment pinned in the accompanying chat. With another livestream tipping feature, <a href=\"https://www.theverge.com/2019/11/5/20949437/youtube-live-streams-super-stickers-chat-cartoons-twitch-revenue\">Super Stickers</a>, creators can make money when fans purchase cartoon character stickers.</p><p id=\"NblPkg\">Creators make money from their videos on YouTube through ad revenue split with the platform. But some creators say that income is unreliable, especially if <a href=\"https://www.theverge.com/2019/4/5/18287318/youtube-logan-paul-pewdiepie-demonetization-adpocalypse-premium-influencers-creators\">advertisers pull out</a> during controversies or bad press. The ability to monetize a fanbase directly could provide a more steady income stream for creators who worry about being too dependent on advertisers.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/WIdiE9xrh4PNzvUapQCTS672s48=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10581015/acastro_180403_1777_youtube_0001.jpg",
  "description": "All eligible YouTube Partner creators can now receive tips.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}