{
  "title": "YouTube’s memberships gifting feature launches Wednesday, but in beta to start",
  "url": "https://www.theverge.com/2022/5/10/23066080/youtube-memberships-gifting-beta-twitch-subscriptions",
  "date": "2022-05-10T23:19:01.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/lltIGZCJvIl2fgx1KA46xCJjrMw=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70854570/acastro_180403_1777_youtube_0002.0.0.jpg\" />        <figcaption><em>A major feature on Twitch is finally coming to YouTube.</em> | Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"8WKgjI\">YouTube is launching gifted memberships in beta, and they’ll be available for select channels beginning Wednesday. Memberships are YouTube’s take on Twitch’s subscriptions, which viewers can use to show financial support for creators and get access to certain perks like custom emoji. Twitch users have been able to buy gift subscriptions for some time, but if you’ve wanted to buy gift memberships to other fans of a YouTube channel, you haven’t been able to. </p><p id=\"SyHEYx\">The memberships gifting beta will be available to a “small group of creators” to start and will be expanded to more “over the next several months,” YouTube says <a href=\"https://support.google.com/youtube/thread/163130117\">on a page about the feature</a>. Channels interested in trying the feature can fill out <a href=\"https://docs.google.com/forms/d/1xyYadkf8aEF4CqMO8D6NP8zpnzAx0RAaODpqqQ5KfGE/viewform?edit_requested=true\">this Google Form</a>, though you’ll need to already be eligible to enable memberships in the first place, which has <a href=\"https://support.google.com/youtube/answer/7636690?hl=en#zippy=%2Cminimum-eligibility-requirements\">its own set of requirements</a>. And gifting will only be available for viewers using a desktop browser window to start — buying gift memberships on mobile is something YouTube plans to have in place for the feature’s full launch.</p><p id=\"4s6ivI\">Viewers will also have to opt-in to be able to receive gifted memberships on a channel (which could be a way to prevent harassment, like the changes YouTube made to <a href=\"https://www.theverge.com/2022/5/3/23055896/youtube-live-redirect-raid-settings-harassment\">its version of raids</a>). Gifted memberships will appear in the chat, and you’ll have to click a link and then a toggle to allow gifts. You can get an idea of what the experience looks like in this screenshot, taken from a GIF from YouTube:</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5THQFvhPvr63k3cqgFYDCHYybTY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23451833/Screen_Shot_2022_05_10_at_3.41.42_PM.png\">      <cite>Image: YouTube</cite>      <figcaption><em>Click the toggle to be able to receive gifted memberships.</em></figcaption>  </figure><p id=\"cQpHz6\">“With Memberships Gifting, your channel members can buy a set number of channel memberships [5, 10, 20] in a single purchase, that YouTube will ‘gift’ out to other viewers in your live stream,” YouTube says. “Viewers who receive a gift membership get 1 month of access to your channel membership perks like loyalty badges, custom emoji and more. Viewers who receive gift memberships do not pay any charges and as the creator, you receive your usual revenue share from each transaction.”</p><p id=\"6zKvFi\">Gifted memberships are just the latest YouTube versions of <a href=\"https://www.theverge.com/2021/7/14/22577574/youtube-twitch-features-subscriber-sub-only-chat-polls-clips\">major Twitch features</a> introduced to better compete with Amazon’s popular streaming service. But YouTube hasn’t only been competing on features — it’s also enticed some huge Twitch names, including  <a href=\"https://www.theverge.com/2021/8/30/22643215/drlupo-move-from-twitch-youtube-gaming-exclusivity-deal\">DrLupo</a>, <a href=\"https://www.theverge.com/2021/9/1/22652368/timthetatman-streaming-twitch-switch-youtube-gaming\">TimTheTatman</a>, <a href=\"https://www.theverge.com/2021/11/29/22808873/ludwig-ahgren-twitch-subathon-youtube-gaming\">Ludwig</a>, and, in a deal announced just last week, <a href=\"https://www.polygon.com/23053800/sykkuno-youtube-deal-streamer-twitch-valkyrae\">Sykkuno</a>, to stream exclusively on its platform.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/NeFSQReezqLwmA9MRE0ThS6x_ZA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12861241/acastro_180403_1777_youtube_0002.0.jpg",
  "description": "A major Twitch feature is finally coming to YouTube.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}