{
  "title": "Yuji Naka says Square Enix doesn’t ‘value games’ after Balan Wonderworld mess",
  "url": "https://www.theverge.com/2022/4/28/23046855/balan-wonderworld-yuji-naka-square-enix",
  "date": "2022-04-28T20:52:53.000Z",
  "author": "Ash Parrish",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/79TRS56CcK_0G3osiGbpVhNhKu4=/80x0:944x576/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70806826/Screenshots_27.0.png\" />        <figcaption>Square Enix</figcaption>    </figure>  <p id=\"6APmzJ\">In a candid Twitter thread, celebrated video game developer Yuji Naka revealed details about a lawsuit he filed against Square Enix and his struggle to make the ambitious but <a href=\"https://kotaku.com/the-worst-games-of-2021-according-to-metacritic-1848234861\">ultimately atrocious</a> <a href=\"https://www.theverge.com/21335755/balan-wonderworld-xbox-series-x-sonic-creators-gameplay-trailer\"><em>Balan Wonderworld</em></a><em> </em>a better game.</p><p id=\"eicx2e\"><a href=\"https://twitter.com/nakayuji/status/1519648950273208323?s=20&amp;t=nukySFZCGVhBEjGC04ixnQ\">In the thread</a>, written in Japanese and translated by <em>The Verge</em>, Naka wrote that he was removed as the producer of <em>Balan Wonderworld</em> six months before its release and that he sued Square Enix shortly thereafter. </p><p id=\"6lRvaJ\">“Improving a game until the very end is what being a game creator is, and it’s strange to make it impossible to do that,” Naka wrote. “I asked my lawyer to try to negotiate even just commenting on the production until the end, but I filed suit because I was refused.”</p><div class=\"c-float-right\"><aside id=\"MauSlz\"><q>“Improving a game until the very end is what being a game creator is, and it’s strange to make it impossible to do that.”</q></aside></div><p id=\"ZZ9CGX\">He says that he was removed for two reasons. The first involved comments he made about a decision to release a YouTuber’s arrangement of a piece of <em>Wonderworld</em>’s music instead of the original song. </p><p id=\"xluGDb\">“I thought it was wrong that a piano arrangement of the game music by a YouTuber was used in a promotion for an original game,” Naka wrote. “When I insisted that the original song be released, it caused trouble.”</p><p id=\"vKbxbg\">Naka stated that the other reason for his release was because he took issue with the quality of work from Arzest, the game studio behind <em>Balan Wonderworld</em>’s development. </p><p id=\"nwrMYG\">“The relationship with Arzest fell apart when I made comments about wanting to improve the game, or about Arzest submitting the game without fixing bugs,” Naka tweeted.</p><p id=\"7YhlY4\"><em>Balan Wonderworld</em> was a musical platformer that generated a lot of early buzz; it was a new franchise from Square Enix and Yuji Naka, famous for his work on the original <em>Sonic The Hedgehog</em> games, would be its director. However, post launch, the game’s whimsical luster faded, revealing <a href=\"https://www.polygon.com/2021/1/27/22250922/balan-wonderworld-demo-impressions-square-enix-yuji-naka-preview\">shallow gameplay</a> riddled with <a href=\"https://www.theverge.com/2021/3/26/22352588/balan-wonderworld-epileptic-risks-day-one-patch-square-enix\">potentially harmful bugs</a>. </p><p id=\"M8T8vI\">In game development, a game often has most of its pieces in place long before a release date, and any changes could lead to costly delays. In his thread, Naka expressed frustration at being taken off the project as it contravened his philosophy of making corrections and improvements to a game up until the last minute — something that’s served him well in the past. Naka, the original programmer on <em>Sonic The Hedgehog</em>, shared that he came up with the now-common convention of Sonic not dying as long as he had a single ring only two weeks before the game was to be sent for final approval.</p><div class=\"c-float-right\"><aside id=\"xD7ZaH\"><q>Square Enix and Arzest are companies that don’t value games or game fans</q></aside></div><p id=\"y4LrfX\">Naka said that his inability to continue working on the game was in part responsible for its poor performance.</p><p id=\"7kVNRI\">“I believe the reception and reviews of <em>Balan Wonderworld</em> that you all know have a lot to do with this situation. I’m truly disappointed that a product I worked on from the beginning has turned out this way,” he tweeted. </p><p id=\"WO8TIJ\">He also criticized his former employer, Square Enix, and <em>Wonderworld</em>’s developer, Arzest. </p><p id=\"bSIz9z\">“[They] are companies that don’t value games or game fans.”</p><p id=\"uO9n74\">In 2021, Naka left Square Enix and recently released <a href=\"https://www.theverge.com/2021/12/20/22846465/yuji-naka-sega-sonic-team-shot2048-iphone-android\">a solo-developed mobile game</a>. He did not reveal the specifics of his suit against Square Enix and apologized to his fans, saying that in the future he’ll be more responsive on social media.</p><p id=\"MczskZ\">“I’m deeply sorry to the customers who bought what I consider an unfinished <em>Balan Wonderworld</em>,” he wrote.</p><p id=\"2WpEyH\"></p><p id=\"F3KRBp\"></p><p id=\"dTHtiK\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/UQUUunDvIfybgsghbXJEaz-Btts=/0x20:1024x556/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23423657/Screenshots_27.png",
  "description": "Naka said he was removed six months before launch.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}