{
  "title": "Zoom’s new virtual avatars let you show up to your next meeting as a dog",
  "url": "https://www.theverge.com/2022/3/22/22990983/zoom-virtual-avatars-animal-face-replacement",
  "date": "2022-03-22T16:01:17.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/knCaXKEVVDSBSLjSQfVxbvGuIQM=/76x0:1525x966/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70657231/avatars_in_meeting.0.png\" />        <figcaption><em>Hopping over to my next meeting as a rabbit.</em> | Image: Zoom</figcaption>    </figure>  <p id=\"mgPDmH\">Zoom will let you show up to your next meeting as a rabbit, fox, dog, or another type of animal, using <a href=\"https://blog.zoom.us/avatars/\">its new Avatars feature</a> that replaces you with a virtual character that copies your expressions, <a href=\"https://www.theverge.com/2018/6/28/17506010/apple-ios-12-imessage-how-to-make-memoji\">Memoji-style</a>. The company says this feature, which is included in the Zoom 5.10 update, will only let you become an animal at launch, but that new avatar options will be added in the future.</p><p id=\"zZ63mL\">Zoom sees this feature as useful for a lot of different scenarios — in its press release, it mentions showing up with an avatar filter on could “bring some fun to your team-building meetings” or help pediatricians seem less intimidating to young children. There’s also the idea that it could help alleviate Zoom fatigue. At least <a href=\"https://english.elpais.com/usa/2021-03-04/why-zoom-meetings-are-more-exhausting-than-face-to-face-ones.html\">one study has indicated</a> that constantly looking at yourself to make sure you’re presentable and reacting appropriately is part of what makes being in video calls all day so tiring. If your Zoom box is showing a giraffe that’s mirroring your facial expressions, that’s a lot harder to scrutinize than your actual face.</p><div class=\"c-float-right\"><aside id=\"UwKhlK\"><q>Avatars are like video filters that completely replace you</q></aside></div><p id=\"710ojN\">To turn on Avatars, Zoom instructs users to click the ^ button next to the Start / Stop Video button, then click Choose Video Filter. Then, pick the animal you want to show up as from the Avatars tab — apparently, you can even decide whether your avatar will be wearing a hoodie or T-shirt (it’d just be immersion-breaking if you showed up as a fox not appropriately dressed for the weather). You can also optionally choose to always apply the filter whenever you enter a meeting — if you want. </p><p id=\"hbJaMW\">The video conferencing app already has a variety of Snapchat-like filters and effects that you <a href=\"https://www.theverge.com/2021/2/8/22273217/zoom-studio-special-effects-meeting-mustache-eyebrows-lips\">can use to change your appearance</a> — you could already add bunny ears or a mustache to your face or <a href=\"https://www.theverge.com/22595987/cartoon-filter-snapchat-snap-camera-desktop-app-zoom-meeting-how-to\">use Snap’s camera app</a> to give yourself a cartoonish appearance. Avatars take it one step further by completely replacing you. Zoom does say that it won’t “store any data regarding your face or facial features” if you use Avatars. </p><p id=\"qtVAnZ\">It’s hard to tell how useful Zoom Avatars will be in reducing meeting anxiety or fatigue — not because they’re not fun, but because of other people’s tolerance for Zoom playfulness. Personally, my co-workers are never going to see my face again if this feature ends up working well, but there are definitely places where you’d get told off for showing up as an animal (either by <a href=\"https://www.theverge.com/tldr/2021/2/9/22274865/zoom-hearing-cat-filter-lawyer-texas-live-court-hearing\">the judge for your court case</a> saying it’s not appropriate to have a filter on or by a co-worker teasing you by saying you look like a furry). Hopefully, though, if video calls stay a part of our lives, we all get some time to be a little less serious — something that Avatars could certainly help with.</p><aside id=\"TNt5ze\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"How to turn yourself into a cartoon for your next Zoom call\",\"url\":\"https://www.theverge.com/22595987/cartoon-filter-snapchat-snap-camera-desktop-app-zoom-meeting-how-to\"},{\"title\":\"How to look your best on a video call\",\"url\":\"https://www.theverge.com/22832137/video-call-how-to-look-good-zoom-webex\"},{\"title\":\"The Verge guide to working from home\",\"url\":\"https://www.theverge.com/22870253/work-from-home-guide-zoom-slack-video\"},{\"title\":\"How to hide your messy room for a Zoom video conference\",\"url\":\"https://www.theverge.com/2020/3/11/21173608/zoom-video-conference-how-to-virtual-background-greenscreen\"}]}'></div></aside>",
  "image": "https://cdn.vox-cdn.com/thumbor/BZLkDirSL0_bIeDyqYfU8ZHfwMI=/0x64:1600x902/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23336849/avatars_in_meeting.png",
  "description": "Zoom filters that completely replace your face",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}