{
  "title": "Zoom’s gesture recognition now works in its desktop apps",
  "url": "https://www.theverge.com/2022/4/20/23033545/zoom-gestures-raise-hand-thumbs-up",
  "date": "2022-04-20T14:25:19.000Z",
  "author": "David Pierce",
  "content": "      <figure>      <img alt=\"Screenshot of a Zoom window showing three people on a call. All three people have their pronouns in parentheses next to their names. Behind the window is a light blue background with different pronouns listed across it.\" src=\"https://cdn.vox-cdn.com/thumbor/suSw8FLhSiTt4lK3z4NXsIteqMU=/120x0:1013x595/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70771219/Screen_Shot_2021_06_21_at_2.30.07_PM.0.png\" />        <figcaption>Image: Zoom</figcaption>    </figure>  <p id=\"wdY9I9\">Zoom’s reaction emoji are one of the platform’s handiest features, letting you quickly applaud a co-worker or send a heart to a friend. With <a href=\"https://blog.zoom.us/april-product-update/\">the latest update to its desktop apps</a>, Zoom is making a couple of those reactions easier to find. Its gesture recognition feature will show a thumbs-up emoji in the meeting when you give one to your webcam, or flag a raised-hand emoji when you raise your hand.</p><p id=\"MbvT3L\">Gesture recognition won’t be news to those who use Zoom’s iPad and iPhone apps, which have supported the same two gestures since last summer. And those who have used it know that it can be as frustrating as it is helpful. Zoom has a tendency to read “I’m scratching my face” as “I’m raising my hand,” and at least in my experience only responds to the most aggressive of thumbs-ups. Still, when it works it does help Zoom bridge the gap between natural and digital communication, and it’s not surprising that the company is still investing in the idea. I look forward to someday being able to blow kisses at the screen to register a heart emoji.</p>  <figure class=\"e-image\">        <img alt=\"A Zoom Whiteboard screenshot\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/kZ0x968Ymbjszi4T8wi3yap4gEg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23403228/Zoom_Whiteboard.png\">      <cite>Image: Zoom</cite>      <figcaption>The new Zoom Whiteboard.</figcaption>  </figure><p id=\"AeBSKb\">There are a number of other features in the latest version of Zoom, most notably a big improvement to <a href=\"https://blog.zoom.us/zoom-digital-whiteboard-collaboration/\">the Zoom whiteboard</a>. Whiteboard has <a href=\"https://www.theverge.com/2021/9/13/22667556/zoom-live-translation-whiteboard-update-vr\">been around for a while</a> as an add-on to a meeting, but now it’s a separate product inside Zoom. Zoom’s trying to make it easier to manage breakout rooms and polls, and run large events on the platform a little more seamlessly too. Zoom is also continuing to roll out its chat etiquette tool, which automatically enforces corporate policies on communications. (Keep an eye on that one, because as we’ve seen from <a href=\"https://www.vice.com/en/article/v7dk8m/googles-ai-powered-inclusive-warnings-feature-is-very-broken\">companies like Google</a>, the AI writing police is often wrong and frequently ridiculous.)</p><p id=\"2cNk19\">The bigger picture here is that Zoom is doing what platforms tend to do: suck the best ideas from the rest of the industry, even those developed on top of its platform, into its core product. <a href=\"https://www.theverge.com/2020/7/7/21314035/mmhmm-personal-video-presence-beta-phil-libin-sequoia-app\">Apps like Mmhmm</a> have been exploring gesture recognition for a while, for instance, while companies like Miro and Figma have turned digital whiteboards into a surprisingly huge industry. Zoom has spent the last couple of years making noise about being an open platform for developers but continues to take the best ideas for itself in an effort to be the primary place we communicate online.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2S9HBiJnlkqtL8f2bvfKR6pNNcw=/0x2:1131x594/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22672461/Screen_Shot_2021_06_21_at_2.30.07_PM.png",
  "description": "From your hands to Zoom’s reaction emoji",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}