{
  "title": "Zuckerberg’s dream of launching a cryptocurrency is officially over",
  "url": "https://www.theverge.com/2022/1/31/22911426/meta-diem-cryptocurrency-confirms-sale",
  "date": "2022-02-01T00:40:22.000Z",
  "author": "Alex Heath",
  "content": "      <figure>      <img alt=\"Facebook CEO Mark Zuckerberg Testifies Before The House Financial Services Committee\" src=\"https://cdn.vox-cdn.com/thumbor/zWnB1piwhGBpJp0FIczn2MKP6Hg=/1x0:5035x3356/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70455808/1182969931.0.jpg\" />        <figcaption>Photo by Chip Somodevilla/Getty Images</figcaption>    </figure>  <p id=\"D88s3J\">After multiple rebrands, congressional hearings, and several high-profile staff departures, the Meta-backed cryptocurrency known as Diem is calling it quits.</p><p id=\"HULFe9\">The association behind Diem confirmed Monday that it sold its assets for <a href=\"https://www.wsj.com/articles/facebooks-cryptocurrency-venture-to-wind-down-sell-assets-11643248799\">around $200 million</a> to Silvergate, a crypto-focused bank it was working with last year to launch a stablecoin pegged to the U.S. dollar. The decision to sell was made after it “became clear from our dialogue with federal regulators that the project could not move ahead,” Diem CEO Stuart Levey said in <a href=\"https://www.prnewswire.com/news-releases/statement-by-diem-ceo-stuart-levey-on-the-sale-of-the-diem-groups-assets-to-silvergate-301471997.html\">a press release</a>. (It’s already known that the U.S. Federal Reserve <a href=\"https://www.theverge.com/2022/1/25/22901830/facebook-meta-libra-diem-crypto-project-explores-sale\">was a key opponent</a> to Diem launching.)</p><div class=\"c-float-right\"><aside id=\"lxYgEp\"><q>The sale of Diem’s assets marks the end of an effort that, in retrospect, was doomed from the start.</q></aside></div><p id=\"5ANIcn\">The sale of Diem’s assets marks the end of an effort that, in retrospect, was doomed from the start. Facebook, which now goes by Meta, created the apps that would have been the main way people used the token. So even though Facebook formed the Libra Association to govern the token with other companies, people were immediately fearful that Libra would make the controversial tech giant even more powerful. Plus, members of the Libra Association <a href=\"https://www.theverge.com/2019/10/11/20910453/libra-association-facebook-visa-mastercard-stripe-leaving\">started to drop out</a>, just months after the group had been announced.</p><p id=\"0AmmEj\">Libra also burst onto the scene when stablecoins, which are designed to <a href=\"https://www.theverge.com/22620464/tether-backing-cryptocurrency-stablecoin\">hold a set price to encourage regular transactions</a>, were a relatively new idea and not closely scrutinized by regulators. Given how big the stablecoin market has become since 2019, governments around the world are starting to take notice and look at legislation. In November, the US Treasury said it thought <a href=\"https://www.theverge.com/2021/11/1/22757899/us-treasury-stablecoins-regulated-banks-cryptocurrency-yellen-congress\">stablecoins should be regulated as banks</a>. And <a href=\"https://www.barrons.com/articles/white-house-executive-action-regulate-cryptos-national-security-51643312454\"><em>Barron’s</em> recently reported</a> that the White House is planning to direct federal agencies to regulate cryptocurrencies as a matter of national security.</p><p id=\"drq8de\">While Meta’s ties to Diem are over, there’s always the chance that Silvergate or another player revives the project. Even though Meta’s reputation ultimately sank it, the design of Diem was more transparent and regulator-friendly than a lot of existing stablecoins. But with nearly all of Libra founding team gone from Meta, the odds of Diem ever reemerging with the same level of backing it once had feel slim. </p><p id=\"39Fsc2\">It’s clear that at least some of the original leaders of Libra feel burned by how the project was politicized. David Marcus, the former Facebook executive who created Libra and left late last year, tweeted the following about Diem shutting down:</p><div id=\"KMOAJ2\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Here's to yet another chapter with a maybe more \"acceptable\" promoter driving the vision forward. There will be ample time in the future for me to properly reflect on the behavior of certain politicians and regulators along the way, but for now... onward!</p>— David Marcus - dmarcus.eth (@davidmarcus) <a href=\"https://twitter.com/davidmarcus/status/1488281478869913605?ref_src=twsrc%5Etfw\">January 31, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"5JWkAB\">A silver lining to Diem’s demise is that Meta has promised to not enforce its trove of cryptocurrency patents against other crypto developers — something that even Jack Dorsey <a href=\"https://twitter.com/jack/status/1488191645271089152?s=20&amp;t=AIq5g-Df-I2LGPcpJ7cuHQ\">thinks is a good idea</a>.</p><p id=\"eMZAEg\"></p><p id=\"Sig89w\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/KG_nlcpQR8kyM_KxocsCgzHbi2I=/0x360:5035x2996/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23208845/1182969931.jpg",
  "description": "Diem, or Libra as it was originally known, is being shut down",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}