{
  "title": "Aesthetic (YC S18) Is Hiring a Full-Stack Web Engineer",
  "url": "https://jobs.ashbyhq.com/aesthetic/335f5c64-c991-4a18-a696-b9c457217106",
  "date": "Sun, 17 Apr 2022 12:01:09 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31060276\">Comments</a>",
  "image": "https://app.ashbyhq.com/api/images/org-theme-logo/4d4cb257-5f71-473a-b8c9-13c1b9d37fbd/7d0e216e-41cd-48c1-ba20-6bcadccf8758.png",
  "description": "Role:\n\nAs Full-Stack Web Engineer, you’ll be a major contributor to shipping, iterating, and maintaining our flagship web application, coding both user-facing features and internal systems. \n\n\n\nRequirements:\n\n- Experience building full-stack web applications with TypeScript, Node.js, React\n\n- Experience with at least one web application framework (Rails, Django, Next.js, etc.)\n\n- Experience with at least one RDBMS (PostgreSQL, MySQL, etc.)\n\n- Experience with web technologies (browsers, networking, HTML, CSS, JavaScript)\n\n- Interest in, and basic understanding of, NFTs and dApps\n\n- Enthusiasm, proactiveness, empathy, self-drivenness, humility, creativity\n\n\n\nNice-to-Haves:\n\n- Experience building mobile apps with React Native\n\n- Experience with Heroku, AWS, or other cloud infrastructure services\n\n- Familiarity with blockchain technologies and products\n\n- Interest in NFTs, DeFi, DAOs, cryptocurrencies, etc.\n\n- Interest in the mechanics of social networks and online communities\n\n\n\nResponsibilities:\n\n- Build, test, deploy, and maintain web application features\n\n- Own frontend-to-backend development, QA, and bug-fixing for major features\n\n- Talk directly to customers to understand their needs and requirements\n\n- Participate in product development, recommending features and contributing to vision\n\n- Consider security, performance, maintainability, and scalability in all of your work\n\n\n\nCompensation:\n\n- Package A: $140,000 salary, 0.2% equity\n\n- Package B: $160,000 salary, 0.1% equity\n\n\n\nBenefits:\n\n- Supportive culture\n\n- Teammates who are driven yet chill\n\n- Fully remote\n\n- Flexible hours\n\n- 6 weeks vacation\n\n- Medical + dental + vision\n\n- Desk at coworking space (optional)",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}