{
  "title": "Algolia is hiring engineers to build blended textual and vector search at scale",
  "url": "https://www.algolia.com/careers/amer-staff-machine-learning-engineer-semantic-search-new-york-new-york",
  "date": "Wed, 9 Mar 2022 12:01:11 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30613531\">Comments</a>",
  "image": "https://res.cloudinary.com/hilnmyskv/image/upload/v1527077656/Algolia_OG_image_m3xgjb.png",
  "description": "<h2><span style=\"font-weight: 400;\">About Algolia</span></h2> <p><span style=\"font-weight: 400;\">Algolia is set to enable every company to create world-class Search and Discovery experiences with an API-first approach. Performance and Scalability is at the heart of our mission: we power 1.5 trillion searches a year, for 10K+ customers all over the world. We see Developer Experience as a key element of our offering: we maintain high-quality SDKs for dozens of languages and platforms. We value Grit, Trust, Candor, Care and Humility. If you're a problem solver, able to think outside the box and eager to nurture others and learn from them, then this is your challenge!</span></p> <h2><span style=\"font-weight: 400;\">The team</span></h2> <p><span style=\"font-weight: 400;\">You will be one of the first hires on the Semantic Search team. The Semantic Search team is working to blend textual and vector search to power the next decade of search experiences.</span></p> <p><span style=\"font-weight: 400;\">This is a great opportunity to work on a product from the beginning, all the way to servicing over a trillion searches a year. We are looking for someone who is skilled not only in the theory of semantic and vector search, but is “clear eyed” about the current state of the art. You will help push us around those constraints to build search that works well in areas where textual matching is best, and works well in areas where semantic matching is best.</span></p> <p class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\">&nbsp;</p> <p class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\"><span class=\"fw-bold\">YOUR ROLE WILL CONSIST OF:</span></p> <div class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\"> <ul> <li><span style=\"font-weight: 400;\">You will be responsible for managing the technical implementation of the semantic search pilot, and working with a team to bring the validated semantic search into production</span></li> <li data-stringify-indent=\"0\" data-stringify-border=\"0\">Leading the technical implementation of the semantic search pilot</li> <li data-stringify-indent=\"0\" data-stringify-border=\"0\">Researching and developing the correct approach to blend textual and semantic search results</li> <li data-stringify-indent=\"0\" data-stringify-border=\"0\">Developing semantic search models that work for dozens or hundreds of customers in different verticals and languages</li> <li data-stringify-indent=\"0\" data-stringify-border=\"0\">Working with the team to being the validated semantic search into production</li> </ul> <p>YOU MIGHT BE A FIT IF YOU HAVE:</p> </div> <div class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\"> <ul class=\"css-19zk6qp\"> <li><span style=\"font-weight: 400;\">10+ years experience in ML, 5+ years experience in search</span></li> <li><span style=\"font-weight: 400;\">Primary experience should be in industry</span></li> <li><span style=\"font-weight: 400;\">Put search or ML into production with significant traffic either as lead or a senior contributor to the team</span></li> <li><span style=\"font-weight: 400;\">Iterated on models over time and knows how to keep software up in production, while working with constraints</span></li> <li><span style=\"font-weight: 400;\">Masters or higher in Computer Science with a focus on Information Retrieval (or ML as a bonus)</span></li> </ul> </div> <p class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\"><span class=\"fw-bold\">NICE TO HAVE:</span></p> <div class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\"> <ul class=\"css-19zk6qp\"> <li data-stringify-indent=\"0\" data-stringify-border=\"0\">Experience at our current stage and beyond (over 10,000 customers, $50-200M ARR range, high growth, lots of change)</li> <li data-stringify-indent=\"0\" data-stringify-border=\"0\">Tech lead experience</li> <li data-stringify-indent=\"0\" data-stringify-border=\"0\">Have published and/or presented research on your previous work</li> </ul> </div> <p class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\">&nbsp;</p> <p class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\"><span class=\"fw-bold\">WE’RE LOOKING FOR SOMEONE WHO CAN LIVE OUR VALUES:</span></p> <div class=\"uil-fw-normal uil-ff-hind uil-fsz-16 lg:uil-fsz-18 uil-lh-bigger uil-color-grey-700\"> <ul class=\"css-19zk6qp\"> <li>GRIT&nbsp;- Problem-solving and perseverance capability in an ever-changing and growing environment.</li> <li>TRUST&nbsp;- Willingness to trust our co-workers and to take ownership.</li> <li>CANDOR&nbsp;- Ability to receive and give constructive feedback.</li> <li>CARE&nbsp;- Genuine care about other team members, our clients and the decisions we make in the company.</li> <li>HUMILITY&nbsp;- Aptitude for learning from others, putting ego aside.</li> </ul> <p>#LI-Hybrid #LI-Remote</p> </div><div class=\"content-conclusion\"><p>&nbsp;</p> <p>REMOTE STRATEGY:</p> <p><span style=\"font-weight: 400;\">Algolia’s workplace strategy, </span><strong>Hybrid Remote</strong><span style=\"font-weight: 400;\">, is designed to harness the power of the opportunities that remote work offers both employees and the company, while also providing an engaging in-office experience for the times when an employee is in an office. Our workplace approach reflects the belief that an employee’s impact, contribution, and output are more important than their physical location.</span></p> <p><span style=\"font-weight: 400;\">The majority of employees will be able to choose if, and when, they come into an office on a regular basis. There will be times when our people are asked to come into an office for “moments that matter:” activities like critical planning meetings and team social gatherings.&nbsp; Beyond those events, 80% of our workforce may choose the location from where they work in the country in which they were hired.</span></p> <p><span style=\"font-weight: 400;\">We have physical offices in San Francisco, NYC, Atlanta, Paris, London, Bucharest, and we will be opening a small office in Austin soon. https://www.algolia.com/about/</span></p> <p>ABOUT US:</p> <p>Millions of developers around the world use Algolia to unleash the power of search across their digital properties. They use Algolia because we are API-first. We unlock incredible flexibility. We build blazing fast speed into our APIs. We do this because we know developers want to build cool things and innovate. Under Armour, Lacoste, Birchbox, Stripe, Slack, Medium, Zendesk and 10,000+ other companies use Algolia to build not just great search, but search that converts at higher rates because of the relevancy. We help their customers find the right goods, offers, and content really quickly. So quickly, in fact, that they don’t go anywhere else. Algolia helps businesses build and optimize the search and discovery experience resulting in significantly enhanced online engagement, increased conversion rates and enriched lifetime value that generates profitable growth. Today, Algolia powers 1.5 Trillion searches a year – that’s 4 times more than Bing, Yahoo, DuckDuckGo, Baidu and Yandex combined. Our amazing technology is used by one in eight online users.</p> <p>Founded in 2012, we're backed by $184M in funding from Accel Partners, Alven, DAG Ventures, Founders Circle, Owl Rock Capital, Point Nine Capital, SaaStr Fund, Salesforce Ventures, Storm Ventures and World Innovation Lab. The team is headquartered in San Francisco with offices in Paris, London, Tokyo, New York, and Atlanta. To learn more, visit <a href=\"http://www.algolia.com.\" target=\"\\_blank\">www.algolia.com. </a></p> <p>WHO WE'RE LOOKING FOR:</p> <p>We’re looking for talented, passionate people to build the world’s best search & discovery technology. As an ownership-driven company, we seek team members who thrive within an environment based on autonomy and diversity. We're committed to building an inclusive and diverse workplace. We care about each other and the world around us, and embrace talented people regardless of their race, age, ancestry, religion, sex, gender identity, sexual orientation, marital status, color, veteran status, disability and socioeconomic background.</p> <p>READY TO APPLY?<br><br>If you share our values and our enthusiasm for building the world’s best search & discovery technology, we’d love to review your application!</p></div>",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}