{
  "title": "Algolia is hiring full-stack engineers to help us research a new kind of search",
  "url": "https://www.algolia.com/careers/amer-senior-software-engineer-search-ranking-united-states",
  "date": "Mon, 21 Feb 2022 12:00:22 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30414821\">Comments</a>",
  "image": "https://res.cloudinary.com/hilnmyskv/image/upload/v1527077656/Algolia_OG_image_m3xgjb.png",
  "description": "<div class=\"section page-centered\"> <p><span style=\"font-weight: 400;\">Algolia is set to enable every company to create world-class Search and Discovery experiences with an API-first approach. Performance and Scalability is at the heart of our mission: we power 1.5 trillion searches a year, for 10K+ customers all over the world. We see Developer Experience as a key element of our offering: we maintain high-quality SDKs for dozens of languages and platforms. We value Grit, Trust, Candor, Care and Humility. If you're a problem solver, able to think outside the box and eager to nurture others and learn from them, then this is your challenge!</span></p> <p><span style=\"font-weight: 400;\">We are looking for a full-stack Senior Software Engineer to grow our Search Ranking Team. Our mission is to return relevant search results at all times and give companies the ability to tailor those results to their own specific needs. We are tasked with reimagining a core piece of Algolia’s technology: how search results are ranked. To that end, we are still early in our building, and we are looking for someone who can help us perform experiments and manage the technical aspects of our pilot program, including building clients for users to test our work and tools to evaluate the impact of our changes.</span></p> <h2><span style=\"font-weight: 400;\">Your role will consist of</span></h2> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Manage the technical implementation of the search ranking pilot</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build front-ends to test search ranking changes and compare to the existing Algolia search results</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Maintain the client library according to the search ranking spec</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Building tooling to debug and test changes potential changes to the search engine ranking formula</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Able to work on a team independently of other software engineers</span></li> </ul> <h2><span style=\"font-weight: 400;\">You might be a fit if you have</span></h2> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">2-5 years Software Engineering</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experience with both frontend and backend</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Computer Science degree preferred</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Python, Ruby, or backend JavaScript experience (Python preferred)</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experience building front-end experiences from scratch (JavaScript and CSS)</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Search engine experience a plus</span></li> </ul> <h2><span style=\"font-weight: 400;\">Our Values</span></h2> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">GRIT - Problem-solving and perseverance capability in an ever-changing and growing environment</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">TRUST - Willingness to trust our co-workers and to take ownership</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">CARE - Genuine care about other team members, our clients and the decisions we make in the company.</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">CANDOR - Ability to receive and give constructive feedback.</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">HUMILITY- Aptitude for learning from others, putting ego aside.</span></li> </ul> <p class=\"p1\"><span class=\"Apple-converted-space\">&nbsp;</span>#LI-Hybrid #LI-Remote</p> </div><div class=\"content-conclusion\"><p>&nbsp;</p> <p>REMOTE STRATEGY:</p> <p><span style=\"font-weight: 400;\">Algolia’s workplace strategy, </span><strong>Hybrid Remote</strong><span style=\"font-weight: 400;\">, is designed to harness the power of the opportunities that remote work offers both employees and the company, while also providing an engaging in-office experience for the times when an employee is in an office. Our workplace approach reflects the belief that an employee’s impact, contribution, and output are more important than their physical location.</span></p> <p><span style=\"font-weight: 400;\">The majority of employees will be able to choose if, and when, they come into an office on a regular basis. There will be times when our people are asked to come into an office for “moments that matter:” activities like critical planning meetings and team social gatherings.&nbsp; Beyond those events, 80% of our workforce may choose the location from where they work in the country in which they were hired.</span></p> <p><span style=\"font-weight: 400;\">We have physical offices in San Francisco, NYC, Atlanta, Paris, London, Bucharest, and we will be opening a small office in Austin soon. https://www.algolia.com/about/</span></p> <p>ABOUT US:</p> <p>Millions of developers around the world use Algolia to unleash the power of search across their digital properties. They use Algolia because we are API-first. We unlock incredible flexibility. We build blazing fast speed into our APIs. We do this because we know developers want to build cool things and innovate. Under Armour, Lacoste, Birchbox, Stripe, Slack, Medium, Zendesk and 10,000+ other companies use Algolia to build not just great search, but search that converts at higher rates because of the relevancy. We help their customers find the right goods, offers, and content really quickly. So quickly, in fact, that they don’t go anywhere else. Algolia helps businesses build and optimize the search and discovery experience resulting in significantly enhanced online engagement, increased conversion rates and enriched lifetime value that generates profitable growth. Today, Algolia powers 1.5 Trillion searches a year – that’s 4 times more than Bing, Yahoo, DuckDuckGo, Baidu and Yandex combined. Our amazing technology is used by one in eight online users.</p> <p>Founded in 2012, we're backed by $184M in funding from Accel Partners, Alven, DAG Ventures, Founders Circle, Owl Rock Capital, Point Nine Capital, SaaStr Fund, Salesforce Ventures, Storm Ventures and World Innovation Lab. The team is headquartered in San Francisco with offices in Paris, London, Tokyo, New York, and Atlanta. To learn more, visit <a href=\"http://www.algolia.com.\" target=\"\\_blank\">www.algolia.com. </a></p> <p>WHO WE'RE LOOKING FOR:</p> <p>We’re looking for talented, passionate people to build the world’s best search & discovery technology. As an ownership-driven company, we seek team members who thrive within an environment based on autonomy and diversity. We're committed to building an inclusive and diverse workplace. We care about each other and the world around us, and embrace talented people regardless of their race, age, ancestry, religion, sex, gender identity, sexual orientation, marital status, color, veteran status, disability and socioeconomic background.</p> <p>READY TO APPLY?<br><br>If you share our values and our enthusiasm for building the world’s best search & discovery technology, we’d love to review your application!</p></div>",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}