{
  "title": "Anime Photography in the Cel Era (2020)",
  "url": "https://alexswak.tumblr.com/post/630061631289835520/cel-anime-photography",
  "date": "Sun, 20 Feb 2022 04:26:50 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30403219\">Comments</a>",
  "image": null,
  "description": "I came across this opening by the popular indie animator Kouji Nanke while watching Maison Ikkoku (it was the 5th and last in the TV series), and it made me look up a lot of details on photography in old animes that I’ll write in this post. I’ll be referring to this OP later so watch it first.\n\n\n\n\n\nI’ll come back to that OP in a moment, but what makes photography in cel era anime interesting is the fact that everything was completely physical, using a real camera and shooting real drawings and so on. I mean, if we look at the history of 2D animation, especially its most common form (cel animation), cameras were the standard for a long time and computer photography is a pretty recent development in the medium. Disney had used tower-style recording machines since the 30s at least, because remember that every cel is a layer that has to move on its own on top of the background. \n\nObviously this is a bit too sophisticated for most anime, considering the tighter economical and time-related constraints. I believe Toei Douga used something similar in its movies at least, but generally speaking laying all the cels on top of each other, including the background, does the job faster and easier, albeit not as elegantly, and this could become a nightmare if you have a lot of layers moving at the same time, maybe even at different speeds. \n\nNeedless to say this process required skilled staff to pull it off well, and while photography still requires a lot of skill and experience nowadays, using software on a computer is totally different. I once read that photography, although a visually defining step in modern anime even now, isn’t regarded as highly as it was back in the cel era, simply because it costs less and is all digital. And although photography became all digital, the workload is said to have increased since higher quality is demanded and more things are added in and tuned digitally. That’s not our topic today anyway.\n\nPhoto of what was probably a common photography setup of the day. Simpler setups also existed. The cel is usually placed on transparent glass, underneath which there is a light source. Notice the physical space available for moving the cel, which is important for creating various effects I’ll talk about later.\n\nThat’s why photography required actual photography know-how back then, and any effect you wanted to create had to be done physically somehow. A lot of these effects could be created using what is called an Optical Printer, which was a very common device in cinema for creating special effects such as transparency (and by extension fade ins and such). What it basically does is taking two film rolls and projecting them on top of each other, manipulating them as necessary, while a camera recaptures the final footage on a third film. Sounds simple but it really wasn’t, and 3 rolls of film (sometimes even more) weren’t cheap. All that made this device irrelevant when it came to anime.\n\nYou could still create most visual effects yourself, and that’s what anime creators did. If we go back to transparency, say you wanted to make a character look transparent, this had to be done by photographing the cels at different exposure than the background. It’s possible to use the same film multiple times, so all you had to do was shoot the background alone first with full exposure, rewind the film, and shoot the character only at lower exposure and it will look transparent on top of the fully visible background. I believe other methods existed but this was the most common. This is especially useful for shadows, reflections, or objects behind windows and so on. The process had to be repeated as many times as there were objects with different exposures on screen, and rewinding the film posed the risk of damaging it and having to repeat the whole process again, in other words it was troublesome.\n\nThis is what is called a “Double Exposure” in photography, and a lot of terms are used in the anime industry to refer to it derived from that. Dabu-Rashi (ダブラシ, Wラシ) and WXP are the most common and are still in use today.\n\nThe next effect I want to talk about is illumination. I mean the effects when the background or a part of it shines a bright light (e.g. sunlight). Remember what I said about the light source underneath the glass? It’s all about that light source. I think that this light isn’t necessary most of the time, and maybe it’s only used to create those effects. Since cels are transparent, all you have to do is shine light from underneath them and this light will shine through. And to focus light on certain areas of the screen just use a black paper sheet with the desired area cut-out or color the back-side of the background black except for the desired area. This is what is called 透過光 (roughly translated “Penetrating Light”).\n\nI have to note that this isn’t necessarily the way it was always implemented. Other methods existed, techniques changed with time, different people did it differently etc. I’m trying to explain the general concept behind those techniques here. Also, just because I think this is interesting, I’d like to mention that cels aren’t completely transparent, which resulted in complex cuts with multiple cels on top of each other sometimes having blurry backgrounds among other undesired artifacts.\n\nThis technique is especially useful in creating starry skies or the starry backdrops of mecha animes, all you needed was a black sheet with holes in it. You could do another trick based on a similar principle, a trick called Masking (マスク合成 - Mask Composition), using sheets of black paper called “Masks” to hide parts of the drawings you didn’t want to show. A very simple example of this would be framing a character inside a rectangle on top of a background.\n\nAs you can see, all that involves some physical manipulation in one way or another. Adding filters to the camera lens or on top of the drawings adds another whole desminsion of possibilities, but I believe that’s the most straightforward trick of the bunch so no need to go further into that. You could also manipulate the glass behind the cels, as seen in this example from Ideon: Be Invoked movie, which was one of its most memorable scenes.\n\nYou can clearly see that what’s behind the cel is glass, not completely transparent though.\n\nThe last technique I want to mention is physically moving the cel during filming. The effect resulting from moving cels is what you expect, and I bet you can easily come with a few uses for this yourself, but the use of this extends beyond creating simple visual effects.\n\nBackgrounds are usually drawn on sheets larger than cels, and then cels are placed on them accordingly. Here’s the thing: If the background is large enough, you can do a “following pan” if you move the cel on the background along a horizontal line. Characters walking in a city, running in a forest, flying through clouds, you name it. Moreover, the background can consist of multiple layers moved at different speeds based on the distance between them and the character. This is essential in creating 3-dimensionality in anime and is the basis for a lot of visual tricks. This is mainly called “Multi” (マルチ).\n\nOne has to be cautious with this, however, since scenes with both moving backgrounds and characters are and have always been some of the trickiest scenes in animation. If the disparity in the speed of movement between the character and the background is clear, say the character is animated on 3s and the background on 1s, then the character would move in a stuttery way, as if trying to catch up to the background, in what is called “Flicker” (フリッカー) in anime. This is a problem modern anime still runs into. Examples can be seen in this video or in this scene from Urusei Yatsura near the end.\n\nNow we can finally go back to the opening. \n\nStarting with the first few frames of the OP, you could see masking, illumination and transparency in a single shot. Kouji Nanke didn’t only draw Kyoko’s (the character) eyes obviously, and you can see how more parts of her hair show up on the letter and to the sides. I think it’s safe to assume this wasn’t intentional, since masking was hard to implement perfectly, and we can see light bleeding from the right edge. I believe the letters are cut-outs. As for the shadows, I believe he left a distance between the letters/cels and applied light on an angle while shooting.\n\nMoving on we see the flower petals. I’m not quite sure how he did that, but if you look closely you can see that their shapes are constant, they just “glide” on screen, so it’s safe to assume it’s some kind of sheet with shapes on it used with light some way or another. Also I feel like they don’t interact with the shadows of the letters, so maybe he filmed them with the background first and then filmed the letters on top.\n\nThis is easily the most impressive cut in the OP. You have two characters half transparent (double exposure), Kyoko framed with illuminating background (masking and illumination), a cut-out petal, and characters moving out of the screen (multi). Filming all that together requires high photography skills and shows just how versatile of an animation creator Kouji Nanke is. \n\nKyoko is cute.\n\nThis OP seems simple and plain at first, but when you take a moment to consider all the techniques involved in creating it you can’t but admire the level of craftsmanship it takes to create something like it. It boasts a strong sense of 3-dimensionality through all these visual tricks. The animation is of course nice and Nanke’s drawings are lovely, but his focus was obviously the unique feel created by the shadows/lights, the layering, framing and transparency. Almost all common photography techniques were beautifully incorporated in this OP, which made it a very fascinating piece of animation to me.\n\nWell, most of this post is irrelevant now that everything can be done with a click on computers. Nonetheless, these techniques and knowledge are the basis for what we have today, and persisted in one way or another into modern anime. This post was intended as an introduction to cel era photography, so I’ll link a few resources and extra reads below.\n\n \n\n \n\n==========\n\n \n\n \n\n \n Documentation on cel era photography in anime\n\n Introduction to a photography machine used in Toei Douga\n\n A special on photography in modern anime\n\n An article on Optical Printers",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}