{
  "title": "Are toxoplasma-infected subjects more attractive than non-infected ones?",
  "url": "https://peerj.com/articles/13122/",
  "date": "Sat, 2 Apr 2022 15:50:55 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30889109\">Comments</a>",
  "image": "https://dfzljdn9uc3pi.cloudfront.net/2022/13122/1/fig-1-1x.jpg",
  "description": "Background Parasites are among the main factors that negatively impact the health and reproductive success of organisms. However, if parasites diminish a host’s health and attractiveness to such an extent that finding a mate becomes almost impossible, the parasite would decrease its odds of reproducing and passing to the next generation. There is evidence that Toxoplasma gondii (T. gondii) manipulates phenotypic characteristics of its intermediate hosts to increase its spread. However, whether T. gondii manipulates phenotypic characteristics in humans remains poorly studied. Therefore, the present research had two main aims: (1) To compare traits associated with health and parasite resistance in Toxoplasma-infected and non-infected subjects. (2) To investigate whether other people perceive differences in attractiveness and health between Toxoplasma-infected and non-infected subjects of both sexes. Methods For the first aim, Toxoplasma-infected (n = 35) and non-infected subjects (n = 178) were compared for self-perceived attractiveness, number of sexual partners, number of minor ailments, body mass index, mate value, handgrip strength, facial fluctuating asymmetry, and facial width-to-height ratio. For the second aim, an independent group of 205 raters (59 men and 146 women) evaluated the attractiveness and perceived health of facial pictures of Toxoplasma-infected and non-infected subjects. Results First, we found that infected men had lower facial fluctuating asymmetry whereas infected women had lower body mass, lower body mass index, a tendency for lower facial fluctuating asymmetry, higher self-perceived attractiveness, and a higher number of sexual partners than non-infected ones. Then, we found that infected men and women were rated as more attractive and healthier than non-infected ones. Conclusions Our results suggest that some sexually transmitted parasites, such as T. gondii, may produce changes in the appearance and behavior of the human host, either as a by-product of the infection or as the result of the manipulation of the parasite to increase its spread to new hosts. Taken together, these results lay the foundation for future research on the manipulation of the human host by sexually transmitted pathogens and parasites.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}