{
  "title": "Bright (YC W15) – Hiring an Impact Driven Front-End Engineer",
  "url": "https://www.ycombinator.com/companies/bright/jobs/EBUZwJq-impact-driven-frontend-engineer",
  "date": "Fri, 4 Feb 2022 12:00:37 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30205709\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/23e528ef298c1a03c0a08f84e259e719c17b5977.png?1600456269",
  "description": "## About Bright\n\nBright is a venture-backed startup building the solar operating system to power every home across the world. Our platform allows homeowners to easily adopt solar with no initial investment and save 20% or more on their electricity bill. In doing so, we’re enabling rapid solar adoption and pioneering a sustainable energy future.\n \nWe’re looking for someone interested in having an impact far beyond pixels on a screen, or rows in a database. We believe global warming is one of the most important challenges in our lifetime, and Bright provides a unique opportunity for you to use engineering skills to make a serious impact. The process for homeowners to adopt solar power is unnecessarily complicated, and the industry, especially internationally, is young.\n\n## About the position\n\nThis is an incredibly unique opportunity as we’re growing very quickly as the market leader but just getting around to hiring one of our first dedicated frontend engineers. We’ve operated lean and this is a one-of-a-kind role for someone that wants to be early but is looking for a low risk opportunity that will certainly have an impact on the world.\nToday, Bright is installing 5 solar installations every day all across Mexico with software acting as a coordinator for all the parties involved. Similar to AirBnb, Uber, or OpenDoor - software is our core strategy - and we apply it to almost every team - from logistics, to finance, and customer success. With projects ranging from marketing chat bots, to solar monitoring (IoT) integrations, to logistics optimization - there is never a dull moment.\n\n## Your tasks and responsibilities\n- Spearhead building new capabilities and evolve our current ones for various web platforms: (customers, local solar partners, operations)\n- Own buildout of our marketing site (Gatsby + Strapi)\n- Create digital experiences for many different user roles. For example “your technician is arriving” with views for customers, third-party technicians, and the internal Bright operations team.\n- Design / architect / implement web platforms for homeowners, local solar partners, and financiers\n- Plenty of other more unknown challenges we haven’t faced yet!\n\n\n## We’re looking for someone who\n- Has 5+ years of professional frontend experience. You’ve led development in large projects, and have built stuff from the ground up\n- Has professional experience with React, and React hooks\n- Has the ability to create good-enough user experiences without having a UX designer available\n- Has fluency in technical English (Spanish is a bonus)\n- Is pragmatic, can prioritize and say no when needed\n- Has prior startup experience, and ideally, product intuition.\n- Is comfortable communicating and working with non-engineers (we work with almost every team at Bright in some capacity - from interns up to the CEO)\n\n## Nice to have experience with the following tools / technologies:\n- GraphQL\n- Typescript\n- Figma / InVision\n- Product analytics\n \n## Our frontend stack\n- SPAs\n- React\n- Tailwind CSS\n- Material UI\n- GraphQL (apollo)\n- Retool (as the frontend for many internal tools)\n\n## Our backend stack\n- Node.js (Typescript) as REST and GraphQL server\n- Go for special purpose tasks\n- PostgreSQL + PostGIS\n- EC2, S3 and SQS on AWS\n- Redis\n\n## Why Us? \nWhile Bright shares the same benefits many startups offer, we also have a few unique ones:\n- Directly solving one of the 21st century’s largest problems: affordable clean energy.\n- A measured impact, daily - while most startups claim to “make the world a better place”, Bright actually is.\n- Travel - the ability to travel to Mexico and around the world as Bright expands.\n- Being part of a dynamic new industry - as solar prices continue to drop, the industry is rapidly changing.  Bright is helping to lead the charge.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}