{
  "title": "Convictional (YC W19) is hiring engineers to build the future of B2B trade Remote",
  "url": "https://jobs.ashbyhq.com/convictional/91fa08f9-0850-4429-9000-19c1f5fe9ef3",
  "date": "Mon, 31 Jan 2022 12:01:07 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30147052\">Comments</a>",
  "image": "https://app.ashbyhq.com/api/images/org-theme-social/5e819c8e-a931-414f-84ae-c579d7d7ea47/376a64d4-3d4f-4f8b-bd99-41a684e11dff.png",
  "description": "We’re Convictional. We are building a modern B2B trade network. \n\n \n\nEach year, trillions of dollars worth of B2B trade is transacted using Electronic Data Interchange (EDI). EDI is difficult for modern businesses to work with. Convictional is changing that. \n\n \n\nOur Supplier Enablement Platform enables retailers and marketplaces to onboard, integrate, and transact with all of their suppliers. Convictional's API-driven infrastructure is used by large retailers like Staples, Indigo, Harry Rosen, and brands like Caraway and Detox Market. We recently raised a Series A financing to scale our impact to even more companies.\n\n \n\nConvictional's platform is informed by thousands of hours of customer consultation and a deep appreciation for both the buyer and seller perspectives. We are continuing to learn about the massive value to be unlocked from all types of B2B trade, including marketplace, dropship and wholesale. We’re aiming at theoretical maximums, not feature-completeness, and intend to bring as many businesses along with us as we can.\n\n \n\nTaking a new approach to an old problem is nothing special. Our team, and how we engage with each other, is. We are proud to be building a home for kind nerds who want to impact global trade. Our team is strengthened when we take a learning-first approach and seek out opportunities to debate the best customer-focused solutions. We value self-awareness and feel compelled to fully explore the hard questions. \n\n \n\nWe are a fully distributed team with people located across Canada and the US. We encourage you to design your work schedule and environment so they’re optimal for you. We use email, not Slack. We default to no internal meetings and Deep Work Wednesdays. We expect you to go to coaching or therapy at least occasionally and adhere to 10% compound time. https://medium.com/accelerated-intelligence/why-successful-people-spend-10-hours-a-week-on-compound-time-79d64d8132a8\n\n \n\nWe are inspired every day by the opportunity to pioneer infrastructure that will move trillions of dollars worth of B2B trade. We welcome those who want to join us.\n\n\n\n\nAbout the role\nConvictional is looking to hire Software Engineers at various levels of seniority.\n\nIf you can develop and maintain features, enjoy challenges of reliability and scalability, and can be effective cross-functionally to deliver on commitments to customers, this is probably a good fit. If you like free beer, standups, and active management, this is not a good fit.\n\n\nOur engineers are systems thinkers and futurists who see opportunity everywhere. They are conscientious but still revel in taking intelligent risks. They are proficient in something other than engineering (e.g. technical writing, solutioning, product marketing) and have demonstrated commitment to learning and self-awareness.\n\n\n\nOur software engineers are working on EDI translation, API development, product-native onboarding, and building out our feature set. All engineers contribute to support interactions.\n\n\n\nExperience\nAs long as you have at least 2 years of professional experience as a software engineer (not including co-ops), we really don’t care how you’ve amassed it. You definitely don’t need to have a degree - our CEO barely finished high school - though we’ve found systems engineers tend to have an outsized impact. If you can write high quality code aimed at business users, we want to talk to you.\n\n\n\nDisclaimer\nIf this doesn’t sound like you, but you believe you have something to contribute, tell us why in an email. We will read it, and we will reply to you with thoughtful feedback about whether or not you may be a good fit for us.\n\nDrop us a line or share your resume at jobs@convictional.com.\n\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}