{
  "title": "Dashworks (YC W20) Is Hiring a Senior Product Engineer",
  "url": "https://www.ycombinator.com/companies/dashworks/jobs/BlnGlki-senior-product-engineer",
  "date": "Thu, 28 Apr 2022 14:39:23 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31193020\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/bae1ed6b7cc5c23d0fff4417c147d153b506d321.png?1642809058",
  "description": "About the role\nAs an early engineer to join our team, you'll have the opportunity to materially impact and scale not just the company's product but also the team and the culture. You'll get to drive key product initiatives end to end, and work alongside exceptionally strong co-workers who learn quickly and ship quality work.\nYou qualify if you have:\n3+ years experience using SPA frameworks like React and Typescript for production-grade web apps\n1+ years experience with Python\nExperience designing microservices with restful APIs\nExperience with test-driven development\nExperience with AWS, Docker, Kubernetes, GraphQL a plus\nFamiliarity with SQL and database abstractions\nAbility to quickly learn new frameworks/technologies and move across the stack when necessary\nWhat we look for:\nWillingness and comfort with owning and driving major initiatives independently\nCuriosity and a love for your craft\nAn intuitive grasp for product-level thinking and system thinking\nStrong communication skills\nBenefits\nWe're working hard to create a working environment where people feel empowered to do their very best work, make a significant impact, and enjoy what they do. As an early employee, you'll have a massive say in defining the sales organization, our vision, and our culture. You'll also have uncapped opportunities for progression, learning, and exposure to different business areas.\nHere are the Dashworks essential benefits:\nA competitive salary - regularly reviewed to make sure you're always getting what you deserve.\nMeaningful pre-Series A share options (you'll own a part of Dashworks and share in our success)\nHealthcare, vision, dental, and mental health coverage\nHome office setup + hardware/software coverage: Get a laptop, and whatever hardware, software, or services you need and are reasonable to do your job.\nOption to move from our sunny loft in SOMA in SF. We'll cover relocation if you prefer to move.\nUnlimited PTO\nQuarterly team retreats\nAbout Dashworks\nToday, teams are drowning in a sea of information that is siloed across hundreds of apps (think Notion, Salesforce, Slack, Gmail ...). Finding information across these silos, and making sense of all of it, takes up most of our time as knowledge workers! But what if we could turn these silos into insights with one click, and bring the power of a company's collective knowledge to every team member's fingertips?\nIn doing so, Dashworks is on a path to redesign the future of collaboration and knowledge sharing at work. We have reached a pivotal stage in our journey: we have an impressive set of early customers, and we just went out of stealth and are growing rapidly!\nThe team\nDashworks was started by Praty (https://www.linkedin.com/in/pratyaksh) and Prasad (https://www.linkedin.com/in/prasadkawthekar/), who met as grad students working on deep learning. Our team brings product and engineering experience from foremost institutions like Google, Stanford, Microsoft, Facebook, Linkedin, Snap, and Carnegie Mellon. In addition, we are thrilled to be backed by some of the world's best investors like Y Combinator, South Park Commons, Combine, Point 72 Ventures, Goat Capital, Garuda Ventures, founders of companies like Twitch, Mercury, and Gusto, and an amazing crew of angels.\n&nbsp;\n&nbsp;\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}