{
  "title": "Enso (YC S21) Is Hiring Rust Developer",
  "url": "https://www.ycombinator.com/companies/enso/jobs/5AhkHFF-senior-rust-developer",
  "date": "Thu, 12 May 2022 07:00:08 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31350141\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/d0292ffc8c13228fb578304de4d0fb44ff9be58d.png?1628733070",
  "description": "Senior Rust Developer\nHi, we are Enso (Y Combinator S21)! We are looking for a rock star Rust/WebGL \ndeveloper to join our core team. We are a remote first company, working in \nEurope and the USA.\nWhat is Enso?\nFrom the business perspective, Enso is a no-code interactive data analysis\ntool. It lets you load, blend, and analyze your data, and then automate the \nwhole process, simply by connecting visual components together. Enso has the\npotential to disrupt the data analytics industry over the next five years. \nCurrently, the market operates using old-fashioned, limited, and non-extensible\nsoftware which has been unable to keep up with businesses as they transition to \nthe cloud.\nFrom a technical perspective, Enso is a purely functional, programming \nlanguage with a double visual and textual syntax representation and a polyglot\nevaluation model. It means that you can mix other languages with Enso (Java, \nJavaScript, Python, R) without wrappers and with close-to-zero performance overhead.\nEnso GUI is based on a custom Rust-based WebGL vector shapes renderer, while its \ncompiler utilizes the GraalVM framework. Click here to learn more (https://enso.org/language).\nWho are we looking for?\nEnso would be a great place for you if:\n- You're an expert in Rust.\n- You’re any race, color, religion, gender, national origin, political affiliation, \n  sexual orientation, marital status, disability, age.\n- You like to laugh.\n- You want to work hard, have fun doing it, and own projects from end-to-end.\n- You are friendly and like to collaborate.\n- You move fast and ask for help when needed.\n- You value being part of a team and a community.\n- You can set your ego aside because you know that good ideas can come from anywhere.\n- You enjoy working in public, putting yourself out there and showing your learning.\n- You appreciate a competitive salary and significant stock options.\nResponsibilities\nYou'll be responsible for designing and building the visual layer of Enso. \nIt includes a high-performance WebGL renderer, the Enso language graph editor, \nand its visualization system. This will involve:\n- Working closely with stakeholders and customers to design how the Enso GUI \n  should operate.\n- Developing the WebGL renderer that is used to implement this GUI.\n- Building a next-generation UI framework using this renderer for use in Enso.\n- Using this UI framework to build the GUI for Enso itself.\n- Debugging performance issues to ensure that the renderer is capable of \n  achieving high performance even on low-powered hardware.\n- Creating visualisations for data science libraries using the renderer and \n  other JavaScript libraries.\nRequirements\nWe have a few particular skills that we're looking for in this role:\nA strong focus on both user experience and aesthetics.\n3+ years commercial experience with Rust, including experience writing\nunsafe code for FFI and performance, and using the macro system for\nmetaprogramming. You should be able to write idiomatic rust code.\n2+ years experience with JavaScript, including debugging web stack\nperformance issues.\nPractical experience building high-performance graphical interfaces\nfor end-user-facing applications.\nAs part of the hiring process for this job posting we're very interested\nin your previous work in these areas. Please link us to your Rust projects, \nblog posts and shadertoy shaders if you have them! It's important for us to\nunderstand your experience at the start of the hiring process.\nIt would be a big bonus if you had:\nExperience with Rust's WASM toolchain, with wasm-bindgen, and experience with WASM itself.\nExperience with visual programming systems such as Houdini, Max/MSP, Lab VIEW, or Touch Designer.\nKnowledge of the runtime and memory models used by various JavaScript virtual machines.\nKnowledge of JavaScript visualization libraries.\nExperience with GPU programming (OpenGL, WebGL, DirectX).\nAvoid the confidence gap (https://www.forbes.com/sites/womensmedia/2014/04/28/act-now-to-shrink-the-confidence-gap/).\nYou don't have to match all of the skills above to apply!\nTell us a little bit about yourself and why you think you'd be a good fit for the role!\nYou can also tell us about:\nSome of your past work or projects.\nWhy you'd like to work on Enso, and where you imagine Enso being in 5 years.\nThe most important features of a team that you'd like to work in.\nWhether you take pride in your ability to communicate clearly and efficiently\nwith your team.\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}