{
  "title": "Enso (YC S21) Is Hiring Senior Cloud Developer",
  "url": "https://www.ycombinator.com/companies/enso/jobs/AJAh56k-senior-rust-cloud-engineer",
  "date": "Thu, 3 Mar 2022 07:00:15 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30537996\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/d0292ffc8c13228fb578304de4d0fb44ff9be58d.png?1628733070",
  "description": "Hi, we are Enso (Y Combinator S21)! We are looking for a Rust/Cloud engineer to join our core team. We are a remote first company, working in Europe and the USA.\n\n## What is Enso?\n\n**From the business perspective**, Enso is a no-code interactive data transformation\ntool. It lets you load, blend, and analyze your data, and then automate the \nwhole process, simply by connecting visual components together. It can be used for\nboth in-memory data processing, as well as SQL analytics and transformations on modern\ndata stack (ELT). Enso has the potential to disrupt the data analytics industry over the next five years. \nCurrently, the market operates using old-fashioned, limited, and non-extensible\nsoftware which has been unable to keep up with businesses as they transition to \nthe cloud.\n\n**From a technical perspective**, Enso is a purely functional, programming \nlanguage with a double visual and textual syntax representation and a polyglot\nevaluation model. It means that you can mix other languages with Enso (Java, \nJavaScript, Python, R) without wrappers and with close-to-zero performance overhead. [Click here to learn more](https://enso.org/language).\n\n## Responsibilities\n\nAs a Senior Cloud Software Engineer, you'll be in charge of building the SaaS offering for Enso, hosting both the language and its IDE in the cloud. This will involve:\n- Working closely with the other internal teams to design a secure and scalable SaaS architecture.\n- Developing a SaaS solution based upon that design with robust tooling and reliability, as well as inbuilt support for collaboration.\n- Contributing to the evolution of this vibrant open-source project by bringing a new component to its ecosystem and product offering.\n\n## Requirements\n\nWe have a few particular skills that we're looking for in this role:\n\n- 3+ years experience in designing secure, scalable, and collaboration-ready SaaS architectures.\n- Commercial experience in a low-level language such as C, C++, or Rust.\n- A strong commitment to security and scalability that permeates your approach to design.\n- Commercial experience working with at least one major cloud service: (Azure/AWS/GCP) and\n  experience working with a dedicated IaC framework (Terraform, Azure Resource Manager).\n- Experience in building cloud heavy distributed systems.\n- Familiarity with working in Linux environments.\n- Ability to work with CI/CD pipelines based on GitHub actions.\n\nAs part of the hiring process for this job posting we're very interested\nin your previous work in these areas. It's important for us to\nunderstand your experience at the start of the hiring process.\n\nIt would be a big bonus if you had:\n\n- Hands-on experience coding with NodeJS.\n- Practical experience with ReactJS and Typescript.\n- Experience with Scala (our proof of concept implementation uses Scala).\n- A good sense of UI and aesthetics.\n\nAvoid [the confidence gap](https://www.forbes.com/sites/womensmedia/2014/04/28/act-now-to-shrink-the-confidence-gap/).\nYou don't have to match _all_ of the skills above to apply!\n\nWe’d appreciate it if you could tell us a little bit about:\n- Some of your past work or projects.\n- The most important features of a team that you'd like to work in.\n- Why do you think you'd be a good fit for the role.\n\n## Who are we looking for?\n\nEnso would be a great place for you if you want to work hard, have fun doing it, and own projects from end-to-end. We believe our team and community are one of our greatest assets - we’d like to welcome on board anyone who enjoys working in public, putting themselves out there and showing their learning. We value transparency, desire for growth and the ability to work in a results-oriented environment above all else. In turn, we can offer you: \n- Competitive salary,\n- Significant stock options, \n- A fully remote opportunity,\n- Flexible working arrangement.\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}