{
  "title": "Eqtble (YC W21) is hiring a founding back end engineer",
  "url": "https://www.ycombinator.com/companies/eqtble/jobs/uXrVcaj-backend-engineer-early-hire",
  "date": "Sat, 5 Feb 2022 12:00:46 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30220263\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/8c9559310ff34cde4dc6a3018842ddef341655a9.png?1609998174",
  "description": "# About us\n\nAt eqtble, we’re on a mission is to empower companies to make more equitable decisions around their employees. We're building a people analytics platform that enables talent and people leaders to access  a rich set of analytics and insights out of their existing data. We are looking for a backend engineer to work closely with the founding team.\n\n# About the role\n\nAs a founding engineer, you will have an outsized impact on the trajectory of the company and product. You will work closely with the founding team and own the full cycle of software development and the decision-making process. \n\n## Skills\n\nPython / Django / Django Rest Framework / SQL / Postgres / Redis / AWS\n\n## In your first 30 days, you will:\n- Work closely with our CTO, Ethan, to learn about our tech stack and existing code and products.\n- Start writing backend code and completing small tasks.\n- Meet with the rest of the team to understand our people analytics product.\n\n## In your first 60 days, you will:\n- Contribute to product development and start taking on increased sized tasks\n- Run the full software development lifecycle for the features you build, from defining the problem, to design, development, testing, and production support once your feature is released.\n- Work with our small team to prioritize features and bug fixes.\n\n## In your first 90 days, you will:\n- Identify opportunities to improve the customer experience and build new features to drive key business metrics.\n- Balance immediate business goals with long-term architectural and tech debt decisions.\n- Take on increasing ownership over the engineering practices at eqtble.\n\n# About you\n- You are comfortable working autonomously and love the challenge of going from ambiguous requirements to a well-thought-out solution.\n- You are excited to build a fast-growing startup from the ground up.\n- You are naturally curious and interested in learning!\n- You are someone with a heart that wants to solve the challenges facing the Diversity, Equity, and Inclusion world.\n- You have 3+ years of experience as a backend engineer (bonus if you worked at an early stage startup)\n\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}