{
  "title": "EXO Freight (YC W22) Is Hiring",
  "url": "https://www.ycombinator.com/companies/exo-freight/jobs/PhYb8aC-senior-front-end-engineer",
  "date": "Tue, 8 Mar 2022 12:00:52 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30598974\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/24540353fb2618717e6f85465d44f0b92c946758.png?1635535219",
  "description": "# Senior Front End Engineer\n\n## Description\n\n[Exo freight](https://exofreight.com) is a trucking marketplace for open deck shipping. Open deck shipping is how you transport large and odd shaped loads and represents 20% of the 700 Billion dollar US transportation market. Our goals is to build a managed marketplace that allows shippers like Walmart, Scotts Miracle Gro, and Oshkosh find open deck capacity.\n\nWe’re a YC backed company in the Winter 22 batch and have clear product market fit with over $1m per month revenue growing 30% MoM. We’re helping some of the largest manufactures and retailers simplify their open deck shipping needs.\n\n## About the Role\n\nYou would work directly with the CTO and other engineering team members to help build our tools and engineering culture. Your focus will be to deliver high quality software solutions to support our internal team, customers, and drivers.\n\n## What we’re looking for\n\n- You are a highly knowledgeable and experienced Front End Engineer\n- You are excited about building tools that help bring clarity to the most complex form of transportation.\n- You are interested in helping set a direction for the front end team and play a part in the overall engineering vision.\n- You love testing your code.\n\n## Qualifications\n\n### Need to have\n\n- 5+ years of full-time employment building web applications. Startup experience is a plus.\n- 4+ years experience with modern front end technlogies and frameworks.\n    - React\n    - Vue\n- Providing mentorship to other team members around unit testing approaches.\n\n### Nice to have\n\n- Experience with Python and Django\n- Experience with continuous integration and deployment automation concepts\n\n## Perks\n\n- 100% company paid health/dental/vision insurance\n- Competive salary\n- Stock options\n- 401k\n\n## Location\n\nYou must be currently authorized to work in the United States or Canada on a full-time basis.\n\nAs part of the engineering team, we are open to remote work or we have an awesome office downtown Royal Oak, Michigan.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}