{
  "title": "Fetch (YC S15) Is Hiring",
  "url": "https://www.ycombinator.com/companies/fetch/jobs/aTjJR0S-head-of-growth",
  "date": "Tue, 1 Feb 2022 21:00:35 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30169187\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/c2fb5764a01fccd60f19563c78c14f3b54499891.png?1613513188",
  "description": "**About Fetch**\n \nFetch is a marketplace for self-service truck rental. Fetch created the first completely-automated process for renting a truck using just your phone. We enable individuals, families and businesses to rent a truck 24 hours a day, at the tap of their phone, without having to wait in line.\n \nIn turn, individuals, entrepreneurs and businesses can list their own vehicles for rent with Fetch and use Fetch’s self-service technology to automate their fleet operations. The Fetch platform enables fleet owners to scale their fleet and manage their operations in just a few hours a month.\n \nFetch is a venture-backed startup, headquartered in Atlanta. Our investors include Y Combinator, NextView Ventures, and Knoll Ventures.\n\n\n**About the Role**\n\nFetch is seeking a Head of Growth to play a strategic role in leading and managing the company’s growth function. You will be a partner to senior leadership at Fetch and be responsible for growing the Fetch marketplace. This is a combination of very strategic work and hands-on management of marketing campaigns and tools. \n\nIf you’re excited about solving big problems and playing a key role in building a fast-scaling business, this is an ideal role. \n\nA day in this role may include launching a new marketing campaign, brainstorming with engineering on how to increase conversion between steps in the onboarding process, working with operations to streamline security verifications and sharing feedback on new landing pages with the design team.\n\n**Responsibilities**\n\n- Identify key growth drivers for the business and building the right liquidity balance in the marketplace\n- Understand every aspect of the customer journey and how it affects the marketplace\nTest new ideas and channels that convert into high LTV customers\n- Relentlessly track KPIs and metrics \n- Implement and manage marketing campaigns \n- Implement appropriate marketing analytics and dashboards to measure success\n- Work across the company and departments to achieve results\n\n\n**Qualifications**\n\nWhile specific years of experience are not a hard requirement, you should have relevant experience in building high-growth marketing and/or product systems.\n\nAdditional qualifications:\n\n- You are relentless\n- You can solve problems on your own\n- You’re data driven\n- You are a strong writer\n- You can think in terms of systems and how metrics such as CAC, LTV, conversion rates and payback period all work together\n- Experience with growth and marketing products and tools\n- You have a bias towards action and getting things done\n- You’re comfortable managing competing priorities and projects at once\n- You are clear and direct in your communications\n- You are comfortable receiving constructive feedback and are level-headed during disagreements\n- You are serious about your work, but you don’t take yourself too seriously\n- Ideally, you will have experience working with early-stage companies\n\n\n**Grow with Fetch**\n\nWe want you to grow with Fetch, and we're committed to helping you achieve your goals. Those goals could be getting experience with a new programming language, gaining management experience or even one day starting your own business. We're here to ensure that as you contribute to Fetch, we're also contributing back to you.\n\nWe expect you to challenge yourself and your colleagues. We believe that transparent, open\ndiscussion leads to a more engaged, fulfilled team and promotes growth of individuals and the business.\n\nWe're committed to providing a challenging, but safe and rewarding environment. Regardless of your education, background, age or personal characteristics, if you can make Fetch a better place for our customers, our partners and our team - we want to hear from you.\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}