{
  "title": "Flagright (YC W22) Is Hiring",
  "url": "https://www.workatastartup.com/jobs/51714",
  "date": "Fri, 8 Apr 2022 07:00:54 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30954113\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/8b0f31dcd23bc7a96fc8672026f6dd18458ce2a8.png?1642688707",
  "description": "# Fullstack Software Engineer\n\n# What we do\n\nRegulatory compliance is often a challenging entry barrier for fintech startups. There are no providers that can deliver a high quality product focusing on startup pain points and constraints. As a result, fintech startups end up developing primitive tools in-house and invest time, money, and engineering resources in a fundamental need that doesn’t generate revenue. \n\nWe believe in enabling businesses to compete and innovate. We are on a mission to eliminate compliance-related entry barriers for startups globally and looking for an experienced Fullstack Software Engineer to join our team as a founding member.\n\nFlagright helps fintech startups prevent financial crime and remain AML compliant while enabling them to grow revenue and manage risk appetite in real-time. It’s an API-first solution with a no-code back office portal. We provide real-time responses even for data-intensive, complex rules via a simple and extensible API on a usage-based pricing model. Flagright is a Y Combinator-backed company serving startups from four continents.\n\n# You will:\n\n* Solve complex engineering problems at a fast pace\n* Deliver high quality frontend & backend code against tight deadlines\n* Collaborate closely with the founding team to deliver robust and comprehensive interfaces to core compliance and anti-fraud financial primitives\n* Make pragmatic tradeoffs considering customer experience, business priorities and a sustainable technical baseline\n* Influence the direction of Flagright’s frontend products and engineering culture\n* Own and drive changes that increase the productivity of customers working on frontend applications\n* Work with your teammates to own and innovate on the development experience\n* Collaborate closely with the founding team and designers to deliver a great experience for people using your team’s products\n* Influence the direction of Flagright’s platform, services, and engineering culture\n* Hide complexity from our users behind simple, yet powerful abstractions\n\n# We’re looking for someone who has:\n\n* At least 3 years of experience and interest in building software systems from scratch - we care much more about general engineering skill than knowledge of a particular language or framework\n* Pride in owning projects to successful completion involving a wide variety of technologies and systems\n* A high standard, of themselves and the people they work with \n* Acute interest in taking ownership of technical design, implementation and results\n* Strong and transparent English communication skills\n* Problem solving mindset - see a problem as an opportunity to grow and is motivated to find solutions, thereby focusing on growth and achieving positive results\n\n# Tech Stack\n* Distributed NoSQL Datastores - Cassandra/DynamoDB, MongoDB\n* Event brokers and Queues - Kafka, Kinesis, SQS\n* Node.js, TypeScript, Go, Scala\n* Docker Containers\n* AWS Lambda, API Gateway, Fargate\n* Apache Spark\n\n# ﻿Benefits\n* Work alongside a highly competent, top-tier team (ex AWS, Zalando, Palantir)\n* You’ll be paid at the top of your market level\n* Significant equity option package at a YC-backed startup\n* Low-bureaucracy, minimal meetings, async communications culture\n* 24 days of paid vacation per year\n* Relocation to Berlin is fully supported for this position including the visa sponsorship. Remote isn't supported.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}