{
  "title": "Flash Boys 2.0: Frontrunning, Transaction Reordering, and Consensus Instability",
  "url": "https://arxiv.org/abs/1904.05234",
  "date": "Fri, 6 May 2022 16:14:47 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31286890\">Comments</a>",
  "image": null,
  "description": "Blockchains, and specifically smart contracts, have promised to create fair\nand transparent trading ecosystems.\n  Unfortunately, we show that this promise has not been met. We document and\nquantify the widespread and rising deployment of arbitrage bots in blockchain\nsystems, specifically in decentralized exchanges (or \"DEXes\"). Like\nhigh-frequency traders on Wall Street, these bots exploit inefficiencies in\nDEXes, paying high transaction fees and optimizing network latency to frontrun,\ni.e., anticipate and exploit, ordinary users' DEX trades.\n  We study the breadth of DEX arbitrage bots in a subset of transactions that\nyield quantifiable revenue to these bots. We also study bots' profit-making\nstrategies, with a focus on blockchain-specific elements. We observe bots\nengage in what we call priority gas auctions (PGAs), competitively bidding up\ntransaction fees in order to obtain priority ordering, i.e., early block\nposition and execution, for their transactions. PGAs present an interesting and\ncomplex new continuous-time, partial-information, game-theoretic model that we\nformalize and study. We release an interactive web portal, http://frontrun.me/,\nto provide the community with real-time data on PGAs.\n  We additionally show that high fees paid for priority transaction ordering\nposes a systemic risk to consensus-layer security. We explain that such fees\nare just one form of a general phenomenon in DEXes and beyond---what we call\nminer extractable value (MEV)---that poses concrete, measurable,\nconsensus-layer security risks. We show empirically that MEV poses a realistic\nthreat to Ethereum today.\n  Our work highlights the large, complex risks created by transaction-ordering\ndependencies in smart contracts and the ways in which traditional forms of\nfinancial-market exploitation are adapting to and penetrating blockchain\neconomies.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}