{
  "title": "Flowly (YC S21) Is Hiring",
  "url": "https://www.ycombinator.com/companies/flowly/jobs/AOX8o5p-chief-of-staff-flowly",
  "date": "Fri, 11 Mar 2022 12:01:06 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30638830\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/7579534495d1bbe5a5a515e2aefe354113ddec12.png?1620967632",
  "description": "Company Description \nFlowly is a science-backed and data-driven app designed to reduce stress, anxiety and pain for improved overall wellness. Using a mobile app and VR headset, Flowly uses biometric data such as HR and HRV and converts it to visualizations in virtual experiences that reduce pain by over 40%.\n\nThe founding team is made up of Yale, DreamWorks, and Hyperloop One alums in conjunction with a world-class clinical team at University of Pittsburgh Medical Center and USC. Flowly has also been studied in NIH-backed clinical trials.\n\nFlowly is backed by Y Combinator,. Our members report life-changing outcomes including how Flowly has empowered them to stop taking opioids, sleep through the night for the first time in fifteen years, and experience deep relaxation on a daily basis. \n\nFlowly was founded by Yale, DreamWorks Animation, Hyperloop One, and California Institutes of the Arts alums. The team is also supported by our clinical partners: University of Pittsburgh Medical Center and USC. \n\nWhile we would love to build a team primarily based in Los Angeles, we want to hire the best talent regardless of location. \n\n\nJob Description \nThe Chief of Staff (CoS) will play a critical role in our success. We are a rapidly growing startup and we are looking for someone who is proactive, a fast-learner, and has strong organizational skills. \nThis position provides leverage for the leadership team and creates value by working with all facets of our business -- customers, partners, and investors -- to solve problems, evaluate new opportunities and execute both internal and external projects that don't (yet) neatly fit into any existing function. You will constantly have more projects than you can realistically handle and need to carefully prioritize between unexpected, yet critical day-to-day challenges and long-term strategic projects. In many ways, your role is a combination of an executive administrator, project manager, researcher, and business development associate, all in one.\n\n\nYou’re excited about this opportunity because you will...\n•\tSupport the CEO and the business day-to-day: Helping the leadership team prepare ahead of meetings, do follow-ups, and execute various administrative tasks. \n•\tProvide research and high-level data analysis: supporting various scientific and business development projects. \n•\tDeliver on internal execution: Run and further develop overall internal company operating system, such as cross-functional quarterly and annual planning and managing internal executive team meetings and related follow ups\n•\tEvaluate new opportunities: Own special projects (e.g., evaluate a new business opportunity) that might not neatly fit into any existing organizational structure\n•\tSee beyond the horizon: Based on careful observations about internal and external matters, suggest process, strategy and priorities changes to the leadership team \n\n\nWe’re excited about you because…\nYou are stoked to have a front-row seat to a fast-growing startup, learning and observing how the business is scaled and having a real impact on Flowly’s success. Your success in this role prepares you to grow your position with the company. We also hope to see from you:\n•\tReal functional experience in product, operations or general management \n•\tIdeal (but not a must) an MBA and a top-tier management consulting experience; 2-5 years post-MBA experience preferred\n•\tPrior experience and understanding of the U.S. healthcare system to have enough context for various scientific and research projects \n•\tInterpersonal skills to work with anyone, and persuade others to work with you even without a formal reporting relationship\n•\tStrong project management skills to be able to drive multiple projects forward towards closure and impact\n•\tSolid experience in developing presentations and spreadsheet-based models\n•\tOptimistic attitude as most of your projects are unexpected and tough; you must bring optimism and excitement to people you’re working with\n\n\nWhy you’ll love working with us...\n•\tOur team is small but mighty: each one of us represents our culture of being humble, transparent, and creative. Every Flowly team members is low ego, high impact. \n•\tYou will get to work with and learn from top engineers, designers, and business leaders from DreamWorks, Hyperloop One, Yale, NIH, and more. \n•\tWe empower team members to be autonomous and provide a collaborative environment to get support and healthy feedback. You are encouraged to bring your authentic self to work every day and are encouraged to help others do the same. \n•\tYou will feel proud that the work you do each day directly impacts people’s lives in healing and life-changing ways. \n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}