{
  "title": "Help YC pick the best startups as a member of the YC Software team",
  "url": "https://www.ycombinator.com/companies/y-combinator/jobs/1x2BVnj-product-engineer-admissions",
  "date": "Fri, 1 Apr 2022 12:00:18 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30877285\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/3b4e880263aebdde16a67ac55189c534bd3ce014.png?1556574255",
  "description": "Admissions is the team that designs the startup selection process at YC. If you’re interviewing at YC, your application has likely been read by someone on admissions and there is likely an admissions team member on your interview panel. While other executives participate in the admissions process, our team is the only one that’s fully dedicated to it. It's a very high-impact, cross-functional group of engineers and operators who also make investment decisions.  \n  \nWe're hiring another&nbsp;product engineer&nbsp;who's interested in learning how YC chooses which startups to fund, and translating that into software. This means building better tooling for YC reviewers and also improving how we programmatically&nbsp;triage applications.&nbsp;We work primarily in Ruby on Rails and React (learning on the job is fine though) and are open to people 2+ years out of school or even 10+ years of experience.\n\nThis is a good role for someone who likes working on fast-paced, small teams where they have a lot of autonomy. While everyone on the team enjoys collaboration, most projects are led by individuals who ask for feedback when needed. The users of most of what you build will be your teammates, group partners and executives, which means the feedback loop is fast. Everyone on the team has worked at a small startup at some point,&nbsp;either as a founder or early employee. Most engineers on the team also read applications and interview founders and tend to be interdisciplinary in their interests, but this is not necessary.\n\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}