{
  "title": "Hundreds of patient data breaches are left unpunished",
  "url": "https://www.bmj.com/content/377/bmj.o1126",
  "date": "Sat, 14 May 2022 18:44:38 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31381014\">Comments</a>",
  "image": null,
  "description": "Pharmaceutical companies, NHS commissioners, and universities have repeatedly breached agreements around sharing patient data, audits show. Should NHS Digital curtail their access? Esther Oxford reports\n\nHundreds of organisations including pharmaceutical companies, clinical commissioning groups (CCGs), and universities have breached patient data sharing agreements in the past seven years and yet their access to the information is not curtailed, The BMJ can reveal.\n\nCompanies, commissioners, and leading universities, including GlaxoSmithKline (GSK) and Imperial College London, have carried out “high risk” breaches according to NHS Digital audits examined by The BMJ . This means that they are handling information outside of agreed data contracts and may be failing to protect confidentiality.\n\nIn one instance of a high risk breach, clinical care commissioners allowed sensitive, identifiable patient data to be released to Virgin Care without permission from NHS Digital. When NHS Digital’s audit team tried to get access to Virgin Care to check their compliance, it was denied access for several weeks and the company refused to delete the patient data.\n\n“It is outrageous that private companies and university research teams are failing to comply,” says Kingsley Manning, former chair of NHS Digital. “How is it that these organisations can be so lax with data?”\n\n“These breaches will damage public trust that data are being handled safely and securely,” says Natalie Banner, former lead for the Understanding Patient Data initiative hosted by Wellcome. “The current system is failing to protect data adequately and a major policy shift and investment is needed,” she says.\n\nThe BMJ ’s analysis of NHS Digital audits found that in the past year 33 organisations were audited and every one had breached data sharing agreements, with hundreds more inspected and found in breach since audits began in 2015.\n\nGSK was found to be at high risk with regard to …",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}