{
  "title": "Hypercontext (YC S21) Is Hiring a Senior Software Engineer",
  "url": "https://www.ycombinator.com/companies/hypercontext/jobs/io4qhGu-senior-software-engineer-backend",
  "date": "Sat, 2 Apr 2022 12:00:49 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30887572\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/ccf3d85fc20475c5f739932c2e5adac5559d9603.png?1642702152",
  "description": "We are looking for a passionate and talented individual to join the team as a Senior Backend Software Engineer. This is a remote engineering position, reporting into an Engineering Manager and working in eastern standard time (+/- 3 hours). If you develop clean, concise and performant code, thrive in a team environment, hold yourself to the highest standards of integrity, and want to make a serious impact at a scrappy tech company, then Hypercontext is the place for you!\n\nWhat you’ll be doing \n- Building the backend for various user-facing features, working closely with the front-end and integration teams to spec, test, deploy and iterate.\n- Improving existing services to deliver a consistent and performant user experience\n- Scaling services via architectural recommendations and changes\n- Providing deep and thoughtful code reviews of backend pull requests\n- Improving existing engineering policies and standards\n\nRequirements:\n- 4+ years experience working professionally in web app development\n- Academic background in Computer Science or related field (BSc or MSc)\n- Object oriented programming experience and knowledge of MVC design patterns\n- Experience investigating and improving web applications for performance and reliability issues\n- Experience scaling services to handle high throughput and consistent data delivery\n\nGreat to haves:\n- Experience with databases (Relational or NoSQL)\n- Experience with PHP Laravel or Symfony\n- Experience developing at other startups\n- Experience with build tools\n- Familiarity with Agile Development, Testing and Continuous Integration\n\nWhy work with us?\n- Be part of a fun, dynamic, and collaborative team.\n- Work with a team of high quality developers in a fast paced agile environment, where every feature you build significantly benefits the company and customers\n- We’re all about making work awesome for our customers, and we try every day to make that a reality at our office too\n- Have tons of autonomy and responsibilities - the only thing that matters are results\n- Healthy work life balance\n- Competitive salary, huge potential for professional growth, flexible work hours, company outings, retreats and clubs, and paid vacation \n\nApply with a resume, github account name, and links to your work online.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}