{
  "title": "Jiga (YC W21) Is Hiring a full stack engineer",
  "url": "https://www.workatastartup.com/jobs/44310",
  "date": "Fri, 13 May 2022 07:00:41 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31364267\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/0666e001c77e1cb1e9179772cbcca027faaec044.png?1607851219",
  "description": "**The Job:**\n\nWe are on a mission to help engineers build physical products faster. \nImagine the `npm install` for mechanical engineers.\n\n*Remote*: We are a remote-first company with a fully flexible work culture, we like smart and friendly people to work with us no matter where they are from in the world.\n\n*Work Ethic*: We never count hours and measure team members by performance and communication only. We 100% trust team members to perform tasks and to be honest with each other.\n\n*Meetings*: We have a no-BS-meeting policy. We will have 1 weekly with the whole company and another one with the dev team. That's it.\n\n*Culture*: We're fully transparent and constantly trying to improve on that. We encourage people to talk with anyone in the team, hold annual offsites in nice places in nature and weekly remote games.\n\n*Funding*: Fully funded and 100% transparent with our runaway.\n\n\n**You should apply if**\n\n- You love building UI components as much as building data structures and API endpoints, and there isn’t a task you can't do.\n- You are connected to the product side and love to own your tasks.\n- You are not afraid to make mistakes and get your hands dirty.\n - You have a get stuff done attitude.\n- You love what you do.\n\n\n**Requirements:**\n\n- 3+ years of experience building full-stack web applications, end-to-end.\n- Proven experience with React.\n - Proven experience with NodeJS, MongoDB, AWS S3.\n- Deep love of startups and creating new products\n - Working blazingly fast.\n- Independent and autodidact.\n\nWould be nice to have also: \n- Experience with Three.js or similar 3D libraries \n- Experience with Next.js\n\n\n**About Jiga**\n\nJiga was started by our co founder, Assaf, who identified a need in the manufacturing market. After 6 years as a manufacturer himself, Assaf realized these inefficiencies had to be addressed.\n\nWe were founded in 2020, just before the first COVID lockdown. As we had to work remotely from day one, we learnt to communicate in an async way to allow everyone to focus and do what they do best, wherever they want and whenever they want.\n\nWe believe in flexible, remote work where each one of the team members has a voice and impact on the product. We don't count hours, we take a no-nonsense approach, and we’re open to any new ideas and technology.\n\nAll religions/genders/races are encouraged to apply, we simply don't care where you're from as long as you do a good job and play nice.\n\n\n**Benefits**\n\n- Fully flexible, location independent, parent-friendly remote work environment.\n- Internationally diverse and dynamic team with a clear vision and strategy.\n- Self-development budget.\n- Spotify/YouTube music subscription.\n- Generous stock options package.\n- Fast-paced environment with lots of room for creative freedom.\n- Opportunity to work on a real, painful problem together with an amazing team.\n\n\n**How to apply**\n\nPlease send us an email to ***jobs(at)jiga.io*** with your CV, a short blurb and your favourite ice cream flavour (mine is cookies, obviously)",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}