{
  "title": "Kable (YC W22) Is Hiring Founding Engineers (Remote)",
  "url": "https://www.ycombinator.com/companies/kable/jobs/7YUZkyG-founding-full-stack-software-engineer",
  "date": "Sun, 8 May 2022 12:00:04 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31303271\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/bd09e6b43ad8211627dbb1e1853f1afc932590f2.png?1649709930",
  "description": "Kable is hiring the best of the best.\nWho you are\nYou love to build. You ask great questions. You are a team player. You are passionate. You're an engineer at heart, but you have some product manager in you too. You have a strong sense of how things should be done, and you don't hesitate to voice your opinion. You are a 10x engineer, capable of getting more done than others and in a fraction of the time. You want to be a part of something great. \nWhat you’ll do\nShip bulletproof code on a daily basis. Design elegant ways to tackle big data challenges and beautiful solutions to complex billing problems. You will be as much an architect as a developer, and you will be responsible for designing and building solutions capable of handling massive scale. You will be a product builder and a team builder and you will help build Kable from the ground up.\nRequirements\nYou have 3+ years of experience building software professionally\nYou are an expert in frontend and backend development, and have experience building end-to-end applications\nYou have experience working with Node, Typescript, React, or other similar frameworks\nYou have strong communication skills and aren’t afraid to speak your mind\nWhy you should join us\nYou value ownership and want to be a part of something great. You will be involved in every aspect of building the product, from high level design to architectural approach to technical implementation. You will help drive product direction and help build our early team. You will have full autonomy in building something extraordinary in one of the most rapidly-growing parts of software. \n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}