{
  "title": "Lessons from Owning a Bookstore",
  "url": "https://ryanholiday.net/29-lessons-from-owning-a-bookstore/",
  "date": "Wed, 30 Mar 2022 16:37:58 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30857549\">Comments</a>",
  "image": "https://ryanholiday.net/wp-content/uploads/2022/03/IMG_4459.jpg",
  "description": "I’ve done some crazy things in my life, but as I’ve said, the absolute craziest was deciding to open a bookstore. Running a small business is always difficult, running a small business during a pandemic is damn near impossible but a small town book store in rural Texas?  But here we are, a year later, not just still standing but doing great!  We’ve learned a lot…about business, about books, and about ourselves.  I made a YouTube video about the experience, but I wanted to expand it here into a fuller explanation of all the lessons that The Painted Porch has taught me. I share them here so you can get something too—and perhaps learn a little from my experiences and hopefully go create something cool of your own out of it. Here are 29 lessons from the first 12 months of owning The Painted Porch.  – It always takes longer than you think it’s going to take. That’s Hofstadter’s law. From the moment my wife suggested we open a small-town bookstore, everything has taken longer and been harder than we expected. If you can’t pass the marshmallow test of delaying gratification and deferring things into the future, you’re just going to get crushed.  – For most of my life as an author and entre­preneur, my work has been digital. Close to half of the sales of my books are audiobooks and ebooks. Every morning, I send out the Daily Stoic and Daily Dad emails to over 500,000 people. I put out a podcast that’s had 80 million downloads. As satisfying as it is to reach large numbers of people through the enormous scale of the internet, there is even more satisfaction in doing something in real life, for real people, even at a much much smaller level. Every time I walk by or to the bookstore, I think, Wow, I made that.  – I think one of the best decisions we made was making our book tower. It’s 20 feet tall and made of some 2000 books, 4000 nails, and 40 gallons of glue. It was not cheap to do. It was not easy to do. It took forever. We had to solve all sorts of logistical problems to make it work. But it’s also probably one of the single best marketing and business decisions we made in the whole store. Because it’s the number one thing that people come into the store to take pictures of.  – You want to have a unique proposition. You want to have something that only you could do. Most bookstores have thousands and thousands of books. But what we decided here was that we’d have only a couple hundred books, only my absolute favorite books, only the books I put in my Reading List Email. It would only be those books. So not only did this make it cheaper and easier to run the bookstore, it makes us stand out.  – There’s this great story of when Jeff Bezos had the idea for Amazon. He was working on Wall Street at the time. He and his boss go for a walk in Central Park and after he tells him his idea, his boss says, “that sounds like a great idea for someone who doesn’t have a job.” Meaning that somebody else should do it, not Bezos. If there’s something crazy that you’re thinking about doing, maybe you should get serious about actually doing it. On the other side of the risk and the crazy leap can be something that changes your life, that changes your community, that changes the world. – Doing something cool means risk…but just because you take a big risk doesn’t mean there aren’t lots of little ways to take risk off the table. My office is above the bookstore. I rent part of the building out to another business, etc.  – There are lots of easier ways to make money than a physical bookstore in 2022…so everyday I try to remind myself this project was not about making lots of money. Remembering why you did something and how you measure success helps you calibrate your decisions properly. I’m happy enough to be putting books out in the world, making this community better, having a physical space, challenging myself, etc…as long as I don’t lose lots of money, that’s a win.  – Start small. The problem is when you have really high standards, when you expect a lot of yourself, it’s hard to be comfortable with something that’s kind of crappy or mediocre or not all the way there. But there’s a reason most tech start ups think in terms of a minimum viable product.  – Related to that there’s a great Hemingway line—we actually have a shirt with it, and I have a print of it on my wall—it’s one of my all-time favorite quotes: the first draft of everything is shit. I love how The Painted Porch is now, but it took weeks and months to get it to where it is. It’s been a continual process of improvement and growth and making changes. – Lengthen your timeline. I mentioned Hofsteader’s Law above—it was important to remind ourselves many times that the building we were in was nearly 150 years old. It can be very easy on a project to get caught up in the immediacy of what’s in front of you…but you miss the big picture and you miss the reality that most things that work are set up to work for a long time. We sell books in our store that were written 2,500 years ago! Who cares if the project took 13 months longer to open than we thought? – As Zeno said, books are a way to have conversations with the dead. You can learn from people who came before you. They can also inspire and reassure you. Some books I leaned on often throughout this were The War of Art by Steven Pressfield, Meditations by Marcus Aurelius, and A Calendar of Wisdom [...]",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}