{
  "title": "Litnerd (YC S21) Is Hiring Senior Full Stack Developer",
  "url": "https://www.ycombinator.com/companies/litnerd/jobs/v4OjVud-senior-fullstack-developer-at-litnerd",
  "date": "Wed, 16 Mar 2022 12:00:43 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30697704\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/fc7092000f00e9e9f6d9dc5e8b7bea11cf0cbdf5.png?1624631962",
  "description": "Litnerd Engineering Org Overview.\n\nEng topology chart: https://www.figma.com/file/6rFlomXiaKyE4pVQ9O7Qod/engineering-topology\n\nLitnerd’s mission is to inspire young people to fall in love with reading. We provide programs for students and teachers that make reading (and learning in general) fun. We do this by bringing books to life by reenacting our books as if you are watching your favorite TV show. 1 in 8 children in America grow up without learning how to read. 41% of 4th grade students are reading at a grade 1 level. In other words, we are failing nearly half of our nation’s students before they ever graduate elementary school. Furthermore, decline in literacy and reading proficiency increases amongst Title 1 schools socio-economically disadvantaged communities. By joining our team, you will be part of our mission to change that!\n \nLitnerd is a contracted vendor with the largest education district in America. Our program is part of in-classroom education and designated school reading time. We have been growing aggressively at 60% MoM and have served over 30,000 students across schools. \n\nTechnology\n\nAs a member of the Engineering team, you'll be at the center of product innovation, empowering the next generation of readers.  We embrace software design best practices, taking code quality and web standards seriously.  Litnerd runs a modern, fully-typed stack using technologies like Typescript, React, Node.js, Postgres, Redis, and GraphQL.\n\nWhat you’ll do:\nBuild and improve on user-facing products such as our Book Reader, Live Interaction, and other classroom management tools\nBuild reliable backend services that power our web application and mobile apps\nCreate admin tools to help us scale managing processes and workflows, including onboarding schools and scheduling live sessions\nIntegrate with cloud services/APIs  (Zoom, Auth0) \nEnsure a low-friction experience for our users\n\nBuild and maintain platform features such as:\nEngineering infrastructure (databases, servers, data pipelines) to keep up with our growing userbase\nCI/CD pipelines to ensure product development moves at a rapid pace\nAutomate and scale notifications, such as email and SMS\n\nWhat we’re looking for:\nExperience with React, Node.JS, NestJS, Typescript (or other typed languages)\nExperience building, testing, and deploying web applications in production environments\nUnderstanding of systems-level programs (bash, git)\nExperience with functional programming, domain-driven design\nA passion for thoughtful engineering, thorough testing, and a deep sense of ownership over products and code shipped\nSelf-starters who excel in a fast-paced startup environment\n\nFront-end\nUnderstanding of modern browser features (web workers, local storage)\nUnderstanding of web best practices including accessibility\nExperience testing code via unit tests and integration tests, both locally and in CI/CD environments\n\nBackend\nUnderstanding of relational databases (Postgres) and migrations in production environments\nUnderstanding of in-memory and document-based data stores, e.g. Redis, DynamoDB\nExperience building and scaling low latency APIs \n\n\tPlatform / Dev-ops\nExperience with monitoring and logging in production applications\nExperience with serverless concepts, FaaS, k8s\nExperience developing and maintaining data processing pipelines\n\n\tData / BI\nData modeling experience with relational and non-relational databases\nWork with stakeholders to create analytics charts, dashboards\nCollect and process analytics data from web properties\nDeep understanding of SQL, Python\nExperience developing and maintaining data processing pipelines\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}