{
  "title": "Markov Chain Monte Carlo analysis of climate-change variables",
  "url": "https://www.nature.com/articles/s41598-022-05643-8",
  "date": "Sun, 6 Feb 2022 13:45:05 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30232416\">Comments</a>",
  "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-05643-8/MediaObjects/41598_2022_5643_Fig1_HTML.png",
  "description": "There is substantial evidence suggesting climate change is having an adverse impact on the world’s water resources. One must remember, however, that climate change is beset by uncertainty. It is therefore meaningful for climate change impact assessments to be conducted with stochastic-based frameworks. The degree of uncertainty about the nature of a stochastic phenomenon may differ from one another. Deep uncertainty refers to a situation in which the parameters governing intervening probability distributions of the stochastic phenomenon are themselves subjected to some degree of uncertainty. In most climatic studies, however, the assessment of the role of deep-uncertain nature of climate change has been limited. This work contributes to fill this knowledge gap by developing a Markov Chain Monte Carlo (MCMC) analysis involving Bayes’ theorem that merges the stochastic patterns of historical data (i.e., the prior distribution) and the regional climate models’ (RCMs’) generated climate scenarios (i.e., the likelihood function) to redefine the stochastic behavior of a non-conditional climatic variable under climate change conditions (i.e., the posterior distribution). This study accounts for the deep-uncertainty effect by evaluating the stochastic pattern of the central tendency measure of the posterior distributions through regenerating the MCMCs. The Karkheh River Basin, Iran, is chosen to evaluate the proposed method. The reason for selecting this case study was twofold. First, this basin has a central role in ensuring the region’s water, food, and energy security. The other reason is the diverse topographic profile of the basin, which imposes predictive challenges for most RCMs. Our results indicate that, while in most seasons, with the notable exception of summer, one can expect a slight drop in the temperature in the near future, the average temperature would continue to rise until eventually surpassing the historically recorded values. The results also revealed that the 95% confidence interval of the central tendency measure of computed posterior probability distributions varies between 0.1 and 0.3&nbsp;°C. The results suggest exercising caution when employing the RCMs’ raw projections, especially in topographically diverse terrain.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}