{
  "title": "Mednet (YC W17) Is Hiring",
  "url": "https://www.ycombinator.com/companies/mednet/jobs/Oc4ZB2b-senior-backend-engineer-for-stack-overflow-for-doctors",
  "date": "Wed, 9 Feb 2022 12:00:40 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30271653\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/baafca9b6d144a24cad66c7c50a0746df06399d4.png?1556574567",
  "description": "## Company\nMednet is StackOverflow for doctors. We are a question and answer platform where doctors can get questions answered by leading practitioners in their field. This solves a huge problem in medicine: getting every doctor the best possible information on how to treat their patients.\n\nWe started with oncology, and are now the most used digital platform in the field: over 70% of oncologists use Mednet. Our business model is based on teaching doctors about newly developed drugs that can improve their patients' outcomes. Our users say we are the best online resource to get help with difficult cases and our revenue is growing at 300% YoY. \n\n## Our Values\n* **Doctors first** - Any decision we make must start by asking whether we are helping doctors make better decisions for their patients\n* **Have a can-do attitude** - No work is below any member of the team. We all pitch in to help achieve our mission\n* **Take ownership** - Develop your strategy, execute on it, iterate until you get the results that you want\n* **Treat each other right** - Treat your colleagues with respect, kindness, professionalism and integrity\n\n# Job Description\nWe’re planning to scale Mednet to 8 new medical fields this year, and improving our data processing and engineering will play a key part in enabling that goal. As a senior backend engineer, you will work closely with our CEO and engineering team. You will be responsible for ingesting and structuring medical data and designing a pipeline and service that enable us to cleanly scale to doctors in new specialties. Your first project will be to create a database of every doctor in the US from multiple sources of data which will be the foundation of our content recommendation system.\n\n## Job Requirements\n* You are passionate about your work having a social impact\n* Experience with designing and building production systems\n* Ability to own standalone mission critical services.\n* 4-10 years of engineering experience.\n* Additional experience (preferred but not required)\n  * Experience building recommendation systems\n  * Experience with NLP, especially MedBert or other medical NLP systems\n  * Experience working with medical claims data\n  * Understanding of medical terminology and the healthcare system\n  * Experience or familiarity with The Medical Subject Headings (MeSH)\n  * Familiarity with the Python scientific computing stack (Pandas, Numpy, SKLearn, etc.)",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}