{
  "title": "MutableAI (YC W22) Is Hiring a Founding Engineer",
  "url": "https://www.ycombinator.com/companies/mutableai/jobs/qnjnCR3-founding-full-stack-software-engineer",
  "date": "Fri, 29 Apr 2022 12:00:31 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31204047\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/9b9aa88b9e1812c77b65efc33c8cfe8ea028b696.png?1646543336",
  "description": "As Founding Full Stack Software Engineer you will be the first hire working alongside the founder. You should be motivated by our mission and relish the challenge of finding PMF on the ground floor of a YC and venture backed startup. \nYou will have the opportunity to create a highly performant technology stack deployed across multiple channels (Jupyter, VSCode, GitHub, PyCharm, etc) that accelerates programming velocity for developers everywhere. \nOnce our product is available in multiple channels (especially your favorite IDE), dogfooding the product will become an essential component of the role and one that will help us achieve PMF faster. \nYou do not need to know any machine learning but should have a strong desire to learn more on the job working alongside our Founder and CEO, who is an Ex-DeepMind Researcher, Google SWE, Siri ML Engineer, and Theoretical Physicist.\nRequirements\nExtremely effective, self-driven builder\n5+ years of experience building and owning a complete end-to-end technology stack (Frontend + Backend + Cloud + CI/CD)\n3+ years of Python and Typescript familiarity\n1+ years of AWS experience\nStrong product sense and customer centric mindset\nStrong remote working communication skills\nComfortable with meta-programming (ASTs, macros, etc) or have a strong desire and ability to learn\nOverlap with US hours and can meet in person once a quarter  \nBonus\nFamiliarity with Machine Learning\nFamiliarity with Rust or Go\nFamiliarity with a functional programming language (eg Haskell)\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}