{
  "title": "Parker (YC W19) Is Hiring First PM",
  "url": "https://www.ycombinator.com/companies/parker/jobs/kmHEV4X-founding-product-manager",
  "date": "Sat, 21 May 2022 12:00:10 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31457131\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/f0d281eb03976bc92861071fe9658f9fb7fb684b.png?1619637236",
  "description": "Parker's mission is to increase the number of financially independent people. We believe we can achieve this goal by building tools that enable independent business owners to scale their businesses profitably. Our first product combines a virtual credit card system with dynamic spending limits and software tooling to help merchants grow and optimize their profitability.\nWe are growing very fast -- in less than five months, we grew to millions in card volume. We have a significant waitlist of customers waiting to use our product. We are looking to expand our headcount quickly to support the demand. Our investors include Solomon Hykes (founder of Docker), Paul Buchheit (founder of Gmail), Paul Graham (founder of Y Combinator), Robert Leshner (founder of compound.finance), and many more. We have raised over $40M from top-tier fintech investors.\nWhat you'll be working on\nYou'll be involved in projects of varying scope and complexity:\n* Ensuring engineering has fully scoped work going into each sprint, work is groomed and planned out\n* Ensuring engineering is able to fully complete work that is scheduled for a given sprint, if not able to complete their work - that risk is bubbled up immediately and planned around\n* As work is pushed to staging, each completed ticket is tested before it’s moved to production\n* Building and running a triage process that sits between the engineering team and customer support/ops\nWhat You'll Need\nPassion or curiosity to learn financial technology\nAbility to work with the executive team to understand the high-level strategy of the business and how it informs projects\nOrganized & Data-driven\nAbility to work with engineering to break up work\nWhat we’d like to see:\nExperience working with eCommerce or fintech is a plus\nExperience working with card issuers and payment processors\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}