{
  "title": "Piepacker (YC S20) Is Hiring",
  "url": "https://www.ycombinator.com/companies/piepacker/jobs/nMq4ryJ-senior-game-developer",
  "date": "Thu, 7 Apr 2022 07:00:26 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30941488\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/43935b529ad76752f79f5dd0fec067aac53f8d7e.png?1597857570",
  "description": " **<u>Piepacker is a social and low tech-friendly cloud gaming platform</u>**. It has been designed to be accessible to everyone: available directly from a web browser, it does not require a high-speed internet connection to provide a seamless multiplayer game experience. Piepacker is all about bringing people together through games, with a touch of childhood playfulness and creativity.&nbsp;\n\n  \n\nWe are led by an experienced team of ex Facebook, Google, Twitter, Amazon, Docker, EA, King and other top tech companies. Piepacker is a YCombinator company and backed by top VC firms and LEGO Ventures.&nbsp;\n\n  \n\nWe're at the stage where we're scaling our Studio department as one of our key units. This is an incredible opportunity to join a booming company in its growth phase. Driven by a strong inclusive culture, we welcome self starting, fast learning, talented people wishing to start and manage unique, and challenging projects where collaboration (internal and external) is everything.&nbsp;\n\n  \n\nWe are looking for a talented <u><b>Senior Game Developer</b></u>&nbsp;to join our growing Studio team.&nbsp;\n\n  \n\n**Location:** Entirely remote. The candidate must be based in Europe or willing to work on European Time Zones.\n\n**Start date:** As soon as possible\n  \n**What you will be doing:**  \n- As a Senior Game Developer, you will work as part of a small and autonomous game development team. You will enjoy a creative, challenging and collaborative environment where your ideas will be every bit as valued as your programming expertise.\n- You will be reporting to an experienced Tech Director who will mainly focus on mentoring you and supporting your growth plan. \n- You will contribute to the full development life cycle of new games for our platform. You will be involved in all phases: conceptualization, design, development, testing, and release.\n- You will help other developers to grow their skills by providing support and mentorship.\n  \n **What we are looking for:**  \n- Significant experience in game development: **<u>minimum of 5 years</u>** of experience as a developer. \n- Knowledge of memory constraints and optimization.\n- Knowledge of the constraints of Online games.\n- Extensive knowledge of cost limitation and call optimizations for Online Games. \n- _ **Would be a real plus:** &nbsp;_Knowledge of WASM and/or WebGL.\n\n  \n\n- **_Self-motivation:_** highly autonomous & working capabilities. \n- **_Communication & Team work:_** Excellent communication and organization skills, team spirit, proactivity. Active involvement in the game creation process by interacting with the rest of the team. Be able to interact at different stages of an asset production, from conception to implementation and animation. Desire of learn. \n- Excellent spoken and written communication skills <u><b>(English)</b></u>\n  \n**Benefits:**  \n- Unlimited holiday leave (minimum 5 weeks).\n- Monthly well-being allowance (mental well-being, sports, massage, etc.).\n- Home office allowance.\n- Fully remote & flexible working hours.\n- Equal pay policy.\n- Equal maternity and paternity leave (18 weeks).\n- Maternity/Paternity subsidy of 3k euros.\n- Stock option plan.\n- Health insurance compensation a one-to-one basis, depending on geographical location & company's policy.\n- Additional benefits depending on the geographical location.\n  \n\nWe will be pleased to receive your application and wish you the best of luck. Looking forward to (hopefully) meeting you and chatting about gaming :)!&nbsp;&nbsp;\n\n  \n\n**_Why Piepacker?_** _&nbsp;_\n\n  \n\n_At the heart of Piepacker’s mission is the creation of_ **_a new way to share games_** _with friends and family: a free online place for gamers to play and hangout together, with video cameras, bringing back the golden era of_ **_multiplayer couch gaming_** _. In a world of constraining internet connections and paid services, we think differently: we are building a free, “low-tech” friendly platform for everyone to jump in, directly from their browser. Our platform is social by design and packed with fun games curated by our community. We want to create new virtual social spaces that fundamentally diverge from today's typical social networks, focusing a lot less on appearance and a lot more on experience. We are building a social gaming platform for all gamers who enjoy playing together.&nbsp;_\n\n  \n\n_Our startup has been growing very quickly since the end of 2020, attracting more than_ **_40 gaming talents_** _from developers and social media experts to designers. In June 2021, we introduced our cloud gaming beta platform featuring 80+ licensed games, including titles from industry-renowned publishers such as Codemasters, Interplay, Team 17, and Data East. Discovered and supported by_ **_Y Combinator (Twitch, Reddit, Stripe, etc)_**_, our board of advisors include former SEGA CEO Kenji Matsubara, Zynga co-founders Justin Waldron and Tom Bollich, Crunchyroll’s Kun Gao, and Humble Bundle’s Jeffrey Rosen. Our last round was led by LEGO Ventures and top gaming VC firms.&nbsp;_\n\n  \n\n_With almost half a million users who have joined us so far, our teams are prepping for our next chapter and are on the lookout for talented and motivated folks who share our passion&nbsp; for gaming and want to make a real impact while embracing a true startup spirit (autonomy, transparency, user centric).&nbsp;_\n\n  \n\n_Piepacker is an equal opportunity employer and we proudly value and promote diversity in our team. We do not discriminate on the basis of ethnicity, religion, color, national origin, gender, sexual orientation, age, marital status, World of Warcraft faction or disability status.&nbsp;_\n\n  \n\n_More info_ **[_here_](https://piepacker.medium.com/join-our-team-edee635107c1)_&nbsp;_**_on our mission, culture and team!_\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}