{
  "title": "Playhouse (YC S21) Is Hiring a Founding Full-Stack Engineer",
  "url": "https://www.ycombinator.com/companies/playhouse/jobs/s9TaYfC-founding-full-stack-engineer",
  "date": "Wed, 27 Apr 2022 12:00:04 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31178817\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/44ff22eb7dac817a3f0827fdf916ff1a9043f8be.png?1627498306",
  "description": "Zillow meets TikTok! Playhouse (https://www.playhouse.so/) is a new mobile app (https://apps.apple.com/app/apple-store/id1574401703?pt=123204504&ct=hiring_site&mt=8) for browsing video listings of homes for sale - it’s fun and addictive like TikTok, but also practical and actionable like Zillow. We’re a Y Combinator funded startup (https://www.ycombinator.com/companies/playhouse) that’s also backed by founders from Youtube, Twitch, Rotten Tomatoes, and more. \nAbout the role 🚀\nThis is a unique opportunity to join as a leading member of the founding team. You will be instrumental in bringing our first mobile app to market and establishing the foundations for its future growth.\nYour responsibilities 💪\nWork hand in hand with our technical CEO and the rest of the team to prioritize and execute on our product roadmap\nHelp establish and follow the long-term technical vision across the whole stack, while making the right calls on short-term compromises\nDevelop internal APIs and managed data integrations with key third parties.\nCollaborate with UX design team on achievable designs that deliver a world class consumer experience for real estate\nHelp establish best practices (frameworks, testing, CI, code reviews, etc) to lay the foundation for a high performing technology team and its culture\nAbout you 💁\nStartup fit 🚀\nYou know what you're getting into. \nYou understand the startup mindset. You're comfortable with uncertainty and love quick iterations to build, learn and refine. You're used to having few resources, but can be decisive, nimble and impactful. You understand that growth is life for a startup.\nYou have an ownership mentality and experience with that type of ownership over a core aspect of the product (product design, technical architecture, infra, key features, etc). You want more responsibility and accountability doesn't scare you.\nYou've worked effectively in a small and tight-knit team. You expect a lot from your teammates and lead by example.\nYou're comfortable with having little existing structure (CI/CD, refined roadmaps, etc), but you've built it all before yourself or know how it's done.\nYou're eager to drive impact with minimal oversight. Micro-management is the antithesis of what you're about and you expect the same of others around you.\nYou love product and you're eager to meet customers to develop an empathetic understanding of their problems to ensure we're building the right solutions.\nSkills and experience 🛠️\n4+ years of full-stack development experience\n2+ years of Node.js development experience\n2+ years of React or React Native development experience\nAbility to think strategically about technology, processes and people\nExcellent communication skills\nCuriosity, humility and a desire to learn and grow, and to help others do the same\nLocation 🌎\nThis is a remote role on a distributed team. North American timezone required.\nBonus points 💯\nCS degree or equivalent\nExperience building consumer social applications\nExperience building video-heavy applications\nAbout Playhouse 🏘️\nPlayhouse (https://www.playhouse.so/) is a seed-stage funded startup that recently graduated from Y Combinator's Summer 21 batch and is backed by amazing investors across consumer technology, real estate and entertainment.\nWe were recently featured in TechCrunch (https://techcrunch.com/2022/04/05/playhouse-tiktok-zillow-homeowners-millennial-gen-z/), Inman (https://www.inman.com/2022/04/07/meet-playhouse-the-app-that-wants-to-turn-zillow-scrolling-into-a-game/) and Business Insider (https://www.businessinsider.com/playhouse-pitch-deck-tiktok-real-estate-seed-millions-2022-4). We were also the #4 Product of the Day (https://www.producthunt.com/posts/playhouse-2) on and loved by (https://www.producthunt.com/newsletter/9069-zillow-meets-tiktok) Product Hunt.\nThe company was founded by Alex Perelman (https://www.linkedin.com/in/alexperelman/) and Nathan Shinder (https://www.linkedin.com/in/nathan-shinder-6387221/), who previously worked together at PeerStreet (https://www.peerstreet.com/), a real estate investment platform, where Alex was the co-founder/CTO and Nathan developed/launched new loan products, and together they helped grow the company to over $4B in total sales.\nWe are committed to building a world-class team that will change how people discover real estate and find their next home.\nCurrent tech stack 🏄\nNode.js, React, React Native, Typescript, GraphQL, Postgres, Next.js, Terraform, AWS, Heroku, Vercel and more. Always open to fresh ideas that help us deliver customer value even faster.\nWhy join Playhouse? 🌼\nMake an impact: The founding team is absolutely crucial for delivering on our mission. By joining early, you will help shape the foundations of the company - its technology, people, process and culture. You will make outsized impact in a critical role.\nTake ownership: You will be part of the decision making process. It may be a cliche that everyone wears multiple hats, but that's truly how it is at this early stage (we've been there!). Every member of the founding team should be thinking about our customers, our product, our burn and our goals when making decisions.\nElevate your education: You get to work directly with experienced and formidable YC founders. In additional to the usual challenges in your line of work, you'll also have the front row seat for learning how to build a company across all functions and connect the dots back to your contributions.\nMake an investment: Your time is limited and precious, and a wise investment has the right balance of risk and return. As an early member of the team, you get all of the above and you'll stand to gain substantially if we succeed in our mission and build a valuable business.\nAnd last but not least, we also offer:\nCompetitive salary and equity\nMedical insurance\nRemote-first culture\nFlexible work schedule\nNot sure you meet 100% of our qualifications? Please apply anyway - we look forward to hearing from you!\nPlayhouse is an equal opportunity employer. No applicant will face discrimination based on race, ethnicity, national origin, religion, age, gender, sexual orientation, gender identity, disability status, parental status, veteran status or any other characteristic protected by law.\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}