{
  "title": "PolicyFly (YC W22) Is Hiring a Senior Back End Engineer (Remote)",
  "url": "https://www.ycombinator.com/companies/policyfly/jobs/Xz4YaAK-senior-backend-engineer",
  "date": "Tue, 19 Apr 2022 12:01:12 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31081990\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/1d0b85e1884d5bb54ef2251be3bc86b395771367.png?1633357521",
  "description": "PolicyFly empowers insurers to sell and manage specialty insurance in minutes instead of months. Every year, $200B of specialty insurance like Cyber, Flood, or Trucking is processed over email between agents and insurers. It’s a slow, inefficient world where 55% of agents' time is spent on paperwork and it can take 30-90 days to get coverage.\n\nOur mission is to create a modern exchange for hard-to-insure things – connecting all parties to automate workflows and consolidate data. We are modernizing specialty insurance with software.&nbsp;\n\nOn the backend, we utilize Kubernetes, Python, Go, Django, Protobuf, gRPC, Postgres and Google Cloud.\n\nWe’re looking for a Senior Backend Engineer to join our core team that is primarily focused on developing a low-code dev framework to power insurance companies.\n\n**Responsibilities:**\n\nThe best way to learn about PolicyFly is to speak with us, we’re a small team looking for exceptional people. Our interview process starts with a conversation with our CEO & Founder. This is a high-impact role with a small team crafting the future of our platform and insurance.\n\nAs a software engineer, you’ll help design and develop features end to end. Beyond execution, you’ll collaborate with internal and external stakeholders to drive the direction of the product. If you have experience with the following skills/technologies, let’s chat.\n  \n**Requirements:**  \n- Expert in Python\n- Advanced experience in Django or Flask\n- Advanced experience in Postgres (or similar)\n- Advanced experience in Dockerized environments\n- Proficient with Microservices (e.g. Python, Go, Rust)\n  \n**Benefits:**  \n- Competitive Salary\n- Health insurance including medical, dental, and vision\n- 401k plan with 4% matching\n- Equity\n- Remote-first company\n  \n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}