{
  "title": "Remi Labs (YC W22) is hiring to build NFTs for ecom businesses",
  "url": "https://www.workatastartup.com/jobs/50556",
  "date": "Mon, 7 Mar 2022 12:00:35 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30586733\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/4e2c012e73b52760eb5c53b68738aecd3d6b8cce.png?1646601795",
  "description": "**Engineers on the team today:**\n\n-   Work primarily in TypeScript\n\n-   Ship UIs in React, often with Tailwind + Next.js\n\n-   Focus on features that will make it easier for new users to get into crypto:\n\n    -   How can we make common interactions easier? Things like buying crypto, setting up a wallet, spending crypto, buying and selling NFTs\n\n    -   How can we teach users about crypto + NFTs? We want to portray the benefits of web3, crypto and NFTs without all the \"engineery speak\"\n\n-   Are left to autonomously figure out the solutions to their challenges\n\n-   Value clear, frequent communication (we do our best to be thoughtful with everything we do)\n\n-   Enjoy being a generalist and are not tied down to a specific programming language or surface area of our codebase\n\n-   Are naturally curious and willing to take a step to learn something they don't have experience in\n\n-   Feel a great sense of accountability to their teammates\\\n\n**Skills & Experience**\n\n-   4+ years of working full-time as a software engineer\n\n-   A fundamental understanding of:\n\n    -   The DOM and it's basic APIs\n\n    -   How to use Chrome Developer Tools to debug applications, profile, and monitor network performance\n\n    -   Commonly used frontend data flow patterns (Redux, Hooks, Recoil, Relay, Mobx, React-Query, Zustand, Jotai, etc)\n\n    -   CSS - Box Model, Flexbox, Grid, and responsive design\n\n    -   Git - Branching, merging, reverting, and other common commands to collaborate with a team\n\n-   Design conscious - While you'll build the interface collaborating with full time designers, we expect you to have a deep interest in creating highly polished and delightful UX. If you feel something is off, you should be able to flag it or better yet suggest and implement a fix autonomously.\\\n\n**Here are examples of things we've worked on:**\n\n-   Minting website that allows consumers to click a button and interact with Solana blockchain APIs and produce a randomly generated NFT\n\n-   A simple onboarding flow into crypto: 1) pay for NFT with US dollars, 2) Get an email code that allows for redemption, 3) automatically spin up a new wallet for the user, 4) allow them to redeem and move the NFT to another wallet if desired\n\n-   Produce a system to automatically generate the artwork for thousands of NFTs based on a specified number of uploaded layers/NFT traits",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}