{
  "title": "Rootly (YC S21) Is Hiring for Developer Relations",
  "url": "https://www.ycombinator.com/companies/rootly/jobs/D8iCU62-senior-developer-relations-community-founding-team",
  "date": "Wed, 30 Mar 2022 12:00:36 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30853964\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/89aa0c88365f7323e39e7ea6058e40159cc55830.png?1620748375",
  "description": "### About Rootly\n\n[Rootly](https://rootly.com/) is on a mission to help companies maintain reliability in a delightful and frictionless way. We do this by building the best-in-class incident management platform to help organizations quickly resolve critical incidents. We are not simply transforming an industry, we are carving an entirely new +$B segment ourselves and need incredible talent to achieve this ambitious goal.\n\n**Investors —** don't just take our word for it, Rootly is backed by some of the top investors in the world that believe the same thing. Y Combinator, XYZ Ventures, 8VC, Bart Mediratta (CTO Dropbox), Jason Warner (CTO GitHub), Max Mullen, Brandon Leonardo (Co-Founder at Instacart), John Lilly (Greylock Partner), and more!\n\n**Customers —** some of the fastest growing companies around the world such as Canva, Grammarly, Faire, Bolt, Linktree, Poshmark, and more trust Rootly to shape their incident management process.\n\n### About the Role\n\nOur goal is to be involved in every incident management tooling evaluation whether they are looking or we spark their curiosity. You’ll play a critical role here.\n\n**Primary Goals — Brand and Community**\n\n- North star metric — number of qualified developers that book demos (measured by “how did you hear about us” and trials)\n- Develop regularly scheduled of engaging content per week (e.g. blog, videos, podcast, webinar, interview, newsletter, guides, case studies, etc.), ideally diverse and unique (today we post fairly non-engaging vanilla blogs), you’ll own a metrics driven approach here and balance between volume and quality\n- Position Rootly as a thought leader in the SRE/DevOps community both virtual (e.g. Slack communities) and in-person (e.g. meetups). We want to lead not just participate and be everywhere incident management is mentioned\n- Develop partnerships and collaborations with adjacent tooling, companies, DevRel, and influencers (e.g. PagerDuty, Gremlin, ServiceNow, Slack etc.)\n- Submit incident management/reliability related CFP at key conferences both virtual and in-person (e.g. SREcon) and identify key ones we should be at\n- Own all social across Twitter, Reddit, LinkedIn, and grow our following. Reposting across all communities e.g. SREWeekly, Monitoring Weekly, etc.\n\n**Secondary Goals — Customer**\n\n- Onboarding videos, integration guides, and Rootly documentation\n- Build customer case studies and other ways that spotlight how Rootly helps them\n- Engaging with inflight trial customers to ensure successful onboarding (e.g. Jira integration setup), game days, putting together workshops when necessary, and fielding technical questions\n\n### Benefits\n\n- Medical, dental, and vision benefits\n- Unlimited vacation policy with a minimum requirement of three weeks off per-year\n- M1 MacBook Pro of choice\n- Paid family leave - whatever you need, they come first\n- Ground floor opportunity to be an early member of a fast growing venture-backed startup",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}