{
  "title": "SigNoz (YC W21) Is Hiring Developer Advocate for Its Open Source APM Product",
  "url": "https://www.ycombinator.com/companies/signoz/jobs/cPaxcxt-developer-advocate",
  "date": "Wed, 9 Feb 2022 07:00:18 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30269788\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/6d918419895643ce9435b7e2e70cf0ff4f5d1b7b.png?1629808311",
  "description": "\nAt SigNoz, we are building an open-source alternative to DataDog. We help developers monitor their applications and troubleshoot problems, quickly.\n\nIn less than 11 months of our launch, we have reached 5500+ [Github stars](https://github.com/signoz/signoz) and 600+ members in the slack community. \n\nIf you are developer who loves talking to people, writing about what you are building and help other devs get started, this role may just be the right fit for you :)\n\n**Why us?**\n\n- Opportunity to work in a global dev infra product from India.\n- Work on an open source product. Engage with the community. Evangelise the product. \n- Founding team from IITs who are/have been devs themselves\n- Backed by YC and some of the prominent VCs in India and US.\n\n\n**Who would be a good fit**\n- 1+ yrs experience as a software engineer. \n- Can get your hand dirty in codes in different languages and deployment methods (think k8s, docker). Not necessary to have deep knowledge, but enough to set up some sample apps\n- Active in dev communities like Github or different dev focused slack communities. Open source contributions are a big plus.\n- Curious and having a get stuff done attitude\n- Interest in startups. If you are an ex-entrepreneur, we would love to chat with you\n\n\n**What you will be working on**\n\n- Create dev focused blogs or videos, speak at dev-facing conferences\n- Help users out in setting SigNoz and understand their usecases\n- Engage in online dev communities and present the product in online/in-person meetups\n\n\n**Next steps**\n\nSeems like something right up your alley? \n\nJust apply on this site or email your CV and an optional  intro note to me at [pranay at signoz  dot io]. Feel free to include links to your GitHub, LinkedIn, Twitter, or blog posts.\n\nOur process involves a short initial exploratory chat, followed by three interviews/discussions. The aim is for both sides to learn more about each other. The timeline is ~10 days unless you need more time.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}