{
  "title": "SigNoz (YC W21) Is Hiring First Product Designer",
  "url": "https://www.ycombinator.com/companies/signoz/jobs/hnlEENe-product-designer",
  "date": "Sun, 15 May 2022 07:00:47 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31385773\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/6d918419895643ce9435b7e2e70cf0ff4f5d1b7b.png?1629808311",
  "description": "SigNoz is a global open source project with users in 30+ countries. We are building an open-source application monitoring which helps developers monitor their applications and troubleshoot problems, quickly.\nIn less than a year of our launch, we have reached 6000+ Github stars (https://github.com/signoz/signoz), 900+ members in the slack community and 60+ contributors. \nCompany Vision\nSoftware and digital systems are becoming larger parts of our daily lives. Most companies are becoming software companies with increasing part of value they create coming from software. \nIn such a world, having software systems functioning seamlessly is taken for granted. Think about last time twitter or slack went down. How irritated you felt.\nWe aim to solve this problem by providing software engineers better tooling to keep systems running smoothly. We believe there are lots to be done in this space and we need your help in building this future.\nWhat will you be doing\nOur target audience is developers. Your goal is to design product features and flows that are as simple as possible.\nOur product has a complicated UX, and you will be responsible for designing it in a way that's easy to understand and visually pleasing.\nYou’ll need to walk the fine line between the simplicity of use and the complexity of features.\nYou’ll play a key role in deciding features and their implementation in collaboration with engineers.\nWork closely with users and engineers to understand requirements and design the interactions\nDevelop process flows, wireframes, and mockups to communicate high-level design strategies or detailed interaction behaviors effectively\nDesign flows and experiences that convert complex app workflows into an absolute delight\nProvide high-quality mockups and prototypes\nContribute to our product design language, both in style & structure\nIdeate and brainstorm with other teams on products, features, and enhancements to take the product to the next level.\nWho would be a good fit\n2+ years of UI/UX and product design experience\nExperience working with product team from research phases of a project through delivery to engineering\nYou can visually communicate an idea by creating quick, low-fidelity mockups such as pencil sketches.\nExcellent presentation and communication skills to get the team on board with your vision\nUnderstanding of component-based design systems\nAbility to thrive in startups with a fast-paced environment and take ownership for working through ambiguity\nFamiliarity with code to quickly prototype: HTML 5, JavaScript, CSS/SASS, styled components, responsive interfaces\nNext steps\nSeems like something right up your alley? \nJust apply on this site or email your CV and an optional  intro note to me at [pranay at signoz  dot io]. Feel free to include links to your Behance, Dribble, LinkedIn, Twitter, or blog posts.\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}