{
  "title": "Singapore Government Tech Stack",
  "url": "https://www.developer.tech.gov.sg/singapore-government-tech-stack/overview/index.html",
  "date": "Sat, 7 May 2022 13:49:32 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31294414\">Comments</a>",
  "image": null,
  "description": "Overview GovTech is developing the Singapore Government Tech Stack (SGTS) with a vision to modernise development practice across Whole-Of-Government (WOG) to help build secure systems that are responsive to constantly evolving citizens and business needs. To achieve this, we need to adopt a three-prong approach: People, Platform and Practice. People: We build the right capabilities and a growth mindset to adopt the technology practices in our development teams. Platform: We offer the right set of tools through SGTS for building high quality, secure systems. Practice: We offer guidance on how to use the tools to empower the developers. Fig 1: Three-prong approach: People, Platform and Practice SGTS products are built on principles of being developer-focused, driving automation, improving observability and auditability, ensuring compliance and security by design, exposing services via APIs and using native solutions. Key Objectives SGTS aims to improve agility of app development and deployment by reducing the need for agencies to set up extensive digital infrastructure. It offers a more powerful development ecosystem with right tools that allows the Government and vendors build code efficiently. improve quality and compliance to policy and cyber security standards by baking them into the development environment and finding vulnerabilities early. lower the costs of development of digital services by using centrally managed common services offering economies of scale and reducing duplication. What is SGTS? SGTS is a set of platform tools that streamlines and simplifies the development process and enables code reuse across WOG to build secure, high quality applications. SGTS has a 2-layer architecture where the Base Layer focuses on standardising development tools and environment and at the top, the Services Layer drives code reusability within WOG. Fig 2: The different layers in SGTS.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}