{
  "title": "Theneo (YC W22) Is Hiring",
  "url": "https://www.ycombinator.com/companies/theneo/jobs/Q5qp3xL-backend-engineer",
  "date": "Fri, 8 Apr 2022 12:00:01 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30955864\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/520039442e218ec14fb7607a29d25039d2e22971.png?1642115263",
  "description": "Theneo is looking for a Senior Backend Engineer to join our team. We're a small but experienced team, you will be working with team members who worked for companies like Google, Facebook, Twitter and much more. We as a company just got started but already have raised significant resources and are ready to scale our product! That’s where you come in. In your role, you will work with other software engineers, designers, and product owners to build a scalable dev tool that hopefully soon millions of developers will love. We welcome your innovative ideas and fresh perspectives to strengthen our growth mindset culture that is grounded in customer obsession, diversity, and inclusion.\n\n\n\n ## What we do\n\nTheneo is an AI-powered tool that generates high-quality, interactive, beautiful API documentation in just a few clicks. Our idea started with a simple notion “let’s give everyone the same quality API doc that Stripe has” and it became more than that, today we are working on not only delivering the best platform to generate a high-quality API doc but we are also automating the content writing process for developers.\n\n## What You’ll Do\n\n* Architect, design, and implement backend services including the core API, backend data processing, and vendor integrations.\n* Own the end to end delivery of software from inception to production\n* Instrument, test, profile, and code review software\n* Continuously deploy to our cloud-based infrastructure\n* Scale software infrastructure for a quickly-growing user base\n\n\n## What We’re Looking For\n\n* 3+ years of professional experience building backend software\n* An experienced engineer who can turn ideas into reliable code that others find easy to understand and modify\n* Experience building backend APIs and services in a highly collaborative team setting\n* Creative problem solver with a passion for testing, debugging, and overall code quality\n* Data-driven decision-maker, willing to take risks, fail fast, and iterate quickly\n* Experience with Node.js, MongoDB, Express.JS\n* (super helpful) experience generating API docs\n\n\n ## Benefits\n\n* Competitive Salary\n* Unlimited PTO\n* Fully remote\n* Company Equity\n* Home office setup\n* WeWork all location access\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}