{
  "title": "TrueVault (YC W14) Is Hiring Our Founding Account Executive",
  "url": "https://www.ycombinator.com/companies/truevault/jobs/4bVCF2r-founding-account-executive",
  "date": "Thu, 7 Apr 2022 12:00:46 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30943310\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/31cbdf05988d09b2d87b705067554ac9a2b9f101.png?1556574279",
  "description": "We launched our product last April with our technical founder leading the charge at sales. After a tremendous first year, we are ready to build out our sales org, starting with you, our first AE. \n\nFirst, you will take over as the primary closer in your first three months. Your unfair advantage is our 5-person prospecting team that is consistently producing qualified leads and a playbook that has 3x our revenue from last year. \n\nNext, you will improve our playbook and be responsible for hiring additional Account Executives within six months to scale the team.\n\nIn short, as our founding Account Executive, your role will evolve into a true player-coach within the first two quarters at TrueVault. \n\nSome Facts :\nTypes of sales: 100% outbound\nAccount profile: direct-to-consumer SMBs with ARR from $15M to $75M\nDecision-maker titles: VP of eCommerce, VP of Marketing, and COO.\nACV: $6K to $8k\n\nSome Facts :\n- Types of sales: 100% outbound\n- Account profile: direct-to-consumer SMBs with ARR from $15M to $75M\n- Decision-maker titles: VP of eCommerce, VP of Marketing, and COO.\n- ACV: $6K to $8k\n\nRequirements (we mean it; we will ask about these points during the interview):\n- You have created a sales playbook before\n- You have sold to SMBs before\n- You have a strong desire to improve continuously\n- You are resilient, and you are not put off by adversity\n\n**What we offer:**\n- Work/life balance\n- Competitive salary with a meaningful equity package\n- World-class medical, dental, and vision benefits\n- Open vacation policy\n- Generous equipment budget and customized workstation\n- A 100% remote team\n- 401k\n \n**What is TrueVault?**\nTrueVault makes software for privacy-conscious businesses. We believe if businesses have access to tools that make getting and staying compliant simple and straightforward, respecting consumers' data privacy becomes the sensible default. And we all benefit from that.\n \n**Who is TrueVault?**\nTrueVault is a Y Combinator graduated startup based in Silicon Valley. We have an incredible group of investors, including Paul Buchheit, Mark Pincus, and Bill Tai, who have invested more than $4 million because they believe deeply in our mission. We are a group of engineers passionate about data privacy, application performance, and building products that make people's lives easier. We are looking for a handful of engineering MacGyvers to join our team.\n \n**Why join TrueVault?**\nAt TrueVault, you will have the opportunity to work in arguably the most significant market opportunity of this coming decade: privacy. Plus, you'll get to build products that people use every single day.\n \nIf you want to work at a place that values \"getting things done\" more than \"working the startup hours,\" talk to us. If you take pride in what you do and care about the people who use the product, you'll find people just like you here. But most importantly, if you want to work with other incredible minds and welcome the challenges of doing things that haven't been done before, then we want you to join us. If you are passionate about privacy, TrueVault is where you want to be.\n\nPrivacy Notice: https://privacy.truevault.com/job-applicant-privacy-notice",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}