{
  "title": "Unflow (YC S19) Is Hiring full-stack software engineers (Rails, Remote)",
  "url": "https://www.ycombinator.com/companies/unflow/jobs/3p9VTds-full-stack-engineer",
  "date": "Wed, 23 Feb 2022 07:00:33 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30438471\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/f91125cf4a45d45ef49a83e63d427491d715080a.png?1634238143",
  "description": "We make it easy for marketers at mobile app companies to ship screens, flows and entire features without a single line of code. Non-technical team members can deliver notifications and collect feedback from users without the need for engineering input or App Store approval.\n\n**`If you join us now, you’ll be:`**\n\n1. With us at the very beginning (expect to be compensated with equity accordingly). We already have funding, customers lined up and are working closely with them to publicly launch our first version of the product in November.\n2. Trusted with owning large parts of the product. We have purposefully kept to a small team of 5 - we enjoy having an outsized impact. This will mean that you will be responsible for large parts of the product.\n3. Expected to contribute heavily to the future of our company. There will be plenty of opportunities to shape our culture, roadmap and future hires.\n\n### About this role\n\n**`We are looking to hire a fullstack engineer who:`**\n\n- Would like to work primarily on the dashboard and API\n- See themselves as “product” engineers. We place crafting a great experience for our customers and their end users above all else\n- Appreciate clear, written communication\n- Enjoy figuring big technical challenges out for themselves and owning large parts of the product\n- Are willing to get involved in aspects of the company outside our codebase\n- Care deeply about pushing the quality of our engineering, security and processes being world class\n- Have an appreciation for no-code tools and what they unlock for non-technical team members\n\n**`Who we’re looking for`**\nWe [hire for the slope, not the y-intercept](https://medium.com/a-good-life/hire-for-the-slope-not-the-y-intercept-5c8b1e701bae) but you will need to have experience in at least some of these areas:\n\n- 2+ years experience\n- Have done a CS degree, bootcamp or taught yourself online (we don’t care where you’ve come from)\n- A strong attention to detail. We're working on a user-facing SDK so a high level of polish is required. You should not feel like stopping until it looks as great as the designs\n- A bias for action. You like to move quickly and are able to prioritize\n\n**`Things you might find yourself working on:`**\nUltimately, you'll be responsible for making sure that our dashboard and API run smoothly. Here's some things the team are working on right now:\n\n- Implementing A/B testing\n- Adding increased customisability\n- Building a WYSIWYG editor on the phone simulator\n- Creating our flows concept\n- Efficient image loading\n\n### About Us\n\nYou'll be joining our team of four - [Romy](https://www.linkedin.com/in/romy-lynch-b41b91119/) (CEO), [David](https://www.linkedin.com/in/dnewell1/) (CTO), [Eoghan](https://www.linkedin.com/in/eoghanreid/) (Head of Design), Kavi (Head of Mobile).\n\nOur journey began as part of the [Y Combinator S19](https://www.notion.so/monaruhq/ycombinator.com) batch. We’ve since gone on to raise [an impressive seed round](https://www.irishtimes.com/business/technology/irish-start-up-quorum-chat-secures-2m-from-well-known-tech-backers-1.4310785) by some pretty [great](http://localglobe.vc/) [investors](http://adjacent.com) (they were some of the first to invest in Calm, Revolut, Blinkist, Opal).\n\nWhile we take the opportunity in front of us very seriously we make sure to [enjoy the journey](http://nomarketneed.com/) along the way.\n\n### How do I apply?\n\nIn your application feel free to include:\n\n- Your CV\n- A link to your LinkedIn\n- The code on GitHub for a side project you built\n- The most impressive or difficult thing you ever worked on\n- (anything else you think is relevant, these are just ideas!)\n\n---\n\n`**FREQUENTLY ASKED QUESTIONS**`\n\n**What does the interview process look like?**\nWe’ll get back to you within a day. If things move forward, we’ll start with a phone call, followed by a short technical project, some pair programming and a chance for you to meet the team. We’re flexible on the process and have in the past done short term contracting when it’s suited candidates better.\n\n**Can I work remotely?**\nYes. We have no official office and are already spread across three timezones from GMT to PST. We put very intentional effort into making our remote culture work and have meet ups at least twice a year.\n\n**What’s it like working for a startup?**\nBeing a small nimble team is a blessing and a curse. The main difference is that when something goes wrong, there’s no one else to call. It's up to us to fix it.\n\nWhile we do have some friends and mentors that we call on, it often boils down to ingenuity and perseverance to get to the bottom of things, sometimes that can mean working long hours.\n\nThis can be one of the bigger shocks to the system after working in a bigger organization. You will have to build a muscle for self-sufficiency and learning quickly.\n\n**What can I expect in terms of compensation?**\nWe aim to compensate fairly given the small team size and are able to do so thanks to our funding. We can always talk about it more but compensation will always depend on seniority / experience and is split between salary and equity. We review compensation every six months.\n\nWe also pay for healthcare. And organize regular team lunches / offsites\n\n**What’s unique about this role?**\nThis role will give you a look at what it's like to try and build a new product and start a company. We have the funding part sorted, so it's relatively safer than trying to start something yourself.\n\nWorst case scenario, you get to learn from the mistakes we make together. If you have the ambition to start your own thing, then this could be a great experience for you. There won't be any guardrails to slow you down\nIf we succeed, then you'll have the opportunity to grow with the company. If your ambition is to become a leader within a bigger organization or to stay as an individual contributor, you'll have plenty of opportunities to learn by doing.",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}