{
  "title": "UpEquity (YC S19) Is Hiring a Software Engineer in Austin",
  "url": "https://www.ycombinator.com/companies/upequity/jobs/ca50OPP-software-engineer",
  "date": "Wed, 4 May 2022 12:01:14 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31259287\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/2307f477f2d84f8d034678ea8e13273ed6850e6e.png?1600817277",
  "description": "UpEquity is a new type of mortgage lender that empowers buyers to win in the most competitive markets. We ensure that our buyers are getting the most competitive rates and closing faster than the market average. We work with buyers AND agents and are looking for the best of the best to support these strong relationships. UpEquity is looking for motivated and driven individuals to join our growing, dynamic team!\nAs a Software Engineer, you’ll be responsible for a variety of tasks including but not limited to:\n* Build new software to support our expanding partnerships and user facing features\n* Develop, test, deploy, and monitor your code through all stages of the software development lifecycle\n* Continually think of and implement new ways to automate manual processes across the organization\n* Willingly jump in and handle any task that needs handling!\nWe know this role isn’t for everybody, so this is what we’re looking for:\n* 2+ years Software Engineering experience in an agile environment\n* Bachelor’s in Computer Science or equivalent work experience\n* Passion for building software quickly and driving value\n* Experience with Node.js, React, AWS, DynamoDB and PostgreSQL\nBonus Points:\n* Experience working with Serverless framework\nBeing a competitive startup organization, we care a lot about our employees and want to take care of them the best we can. Not only does your hard work pay off monetarily but we offer great benefits, perks and incentives to make sure your efforts are recognized. We offer:\n* Competitive compensation\n* Unlimited PTO (yes, unlimited) + 13 holidays to enjoy work/life balance\n* Health benefits - Medical, Dental, Vision\n* Opportunities for growth and continuous development\n* An exciting and positive work environment - we have snacks and drinks for you daily!\n* Weekly happy hours and frequent team building activities\nImportant Details: \n* You must reside in Austin or be willing to self-relocate\n* You must be willing to work 80% in the office (we offer 1 day Work-from-home/week)\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}