{
  "title": "Verdn (YC W22) is hiring a founding full stack engineer",
  "url": "https://www.ycombinator.com/companies/verdn/jobs/wJFebb6-full-stack-engineer",
  "date": "Wed, 18 May 2022 07:01:10 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=31419978\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/a40e2f8b45a111f4f08f21feae907f43d716086a.png?1648235905",
  "description": "Come and join Verdn as one of our founding engineers as we grow our team from two co-founders this summer! We're looking for ambitious programmers who are excited by the idea of having an instrumental impact on both our product and the environment. \nIn a nutshell...\nVerdn is an API that lets companies pledge to sustainable causes with one POST call. Companies use Verdn to pledge with things like product sales (e.g. 5 trees planted with every T-shirt sold) and high-value user actions (e.g. 2kg ocean-bound plastic recovered after finishing an e-learning course). \nWe also transform the post-pledge journey for our client's end-users — by giving each one of them a unique tracking dashboard where they can follow along with where, when, and how their impact happens. See an example here. (https://my-dais.verdn.com/v2-demo-x/0azdLHRB6An8hSGJYa5T)\nAbout you\n🌍 You want your code to make a positive change to the world, and are eager to join a small, growing team where you can influence the trajectory of the product.\n🔨 You have ~3+ years' experience building web applications with React and Node, with major contributions to project planning and deployment.\n⚡️ You've created RESTful APIs using best practices, and have an understanding of how to implement SSR.\nWhat the job involves\nYou'll have a high degree of autonomy to work on new features for our web apps (React and Next.js) and endpoints for our REST API (Node.js).\nWe like to iterate on our product quickly, so you'll be part of rapid prototyping and release cycles across the stack.\nBecause we're a small (but ambitious) team, you'll have a huge amount of influence on the product's direction, and an opportunity to see how the whole business works.\nWe're strong believers in refactoring and performance, so you'll have time to maintain, improve, and test our different services.\nIf it's a good fit for you, you are in a great position to manage others over the course of the next year as we grow our engineering team.\nP.S. There'll be time for fun, hacky things like building internal bots, creating feature ideas from experimental web technologies, and exploring technically ambitious demos.\nOur stack\nWe work exclusively with TypeScript / JavaScript on both the back and front end. We use Firestore as our database.\nOur web apps include:\n- Shopify app (Next.js)\n- Impact-tracking dashboards (Next.js)\n- API dashboard (Next.js)\nOur back end includes:\n- API service (Node.js)\n- Cloud functions (Node.js)\n",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}