{
  "title": "Veryfi (YC W17) Is Hiring Account Executives (AE)",
  "url": "https://www.ycombinator.com/companies/veryfi-inc/jobs/aWDu3no-account-executive-ae",
  "date": "Wed, 16 Feb 2022 12:00:45 +0000",
  "content": "<a href=\"https://news.ycombinator.com/item?id=30358914\">Comments</a>",
  "image": "https://bookface-images.s3.amazonaws.com/logos/4b54c4cbffc737dbc0b6817b8fd6b9cf71e2cd98.png?1589261425",
  "description": "### Position Overview\nThe Account Executive (AE) is a critical component of our go-to-market strategy and presents an outstanding opportunity for the right individual.  The Account Executive (AE) will be responsible for prospecting, developing opportunities and closing deals over the phone with senior level decision makers in the Mid-Market to promote and drive sales of Veryfi products.  This position is based in San Mateo, CA or anywhere in the U.S.\n\n### Qualifications\n- 2+ years of successful experience as an SDR, ISR or AE in an enterprise SaaS company with a minimum of 1 year successful closing experience.\n- Collaborative approach, a \"can do\" attitude and relentless in pursuing goals and solving problems\n- Results-oriented individual who is excited by the prospect of fueling the continued growth and success of Veryfi by expanding and deepening our footprint in the Mid-Market\n- Exceptional written and verbal communication skills\n- Ability to work in a fast-paced entrepreneurial environment\n- Bachelor's Degree or equivalent years of experience required\n\n### Responsibilities\n- Drive a revenue number, forecast accurately and over achieve sales targets \n- Using phone, email and video conferencing, perform outbound customer demand generation, as well as responding to incoming customer inquiries regarding their business needs for Veryfi products\n- Sell the benefits of Veryfi’s solution and conduct product demonstrations to prospective customers\n\n### Benefits\n- Compensation cash compensation and equity package\n- Health, dental, and vision insurance\n- Flexible work hours\n- Professional development or continuing education\n- Unlimited vacation time\n- Flexible/hybrid work schedule eg. work-from-home based on role or 3 days per week in the office\n- Paid maternity / paternity leave\n- Free gym / health membership\n- Company-wide retreats",
  "publisher": "Hackernews",
  "publisherUrl": "http://news.ycombinator.com/"
}