{
  "title": "Apple @ Work: If I sign into a Managed Apple ID on a personal device, can my work access personal information?",
  "url": "https://9to5mac.com/2022/03/05/apple-work-if-i-sign-into-a-managed-apple-id-on-a-personal-device-what-can-my-company-do-to-my-device/",
  "date": "Sat, 05 Mar 2022 11:50:00 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2020/08/Mac-at-work.png?w=1600\" /></div><p><em>App<a href=\"https://bit.ly/2M34VT3\">le @ Work is brought to you by Kandji</a>, the MDM solution built exclusively for organizations that run on Apple. Kandji is a modern, cloud-based platform for centrally managing and securing your Mac, iPhone, iPad, and Apple TV devices, saving IT teams countless hours of manual work with features like one-click compliance templates and 150+ pre-built automations, apps, and workflows. Request access.</em></p><p>Apple IDs have come in a lot of forms over the years. From iTools, .Mac, MobileMe, iTunes Accounts, iCloud, and now managed options – they’ve become an important part of the Apple hardware experience. Managed Apple IDs are the newest part of the Apple ID family, and they are going to be a strong building block for the future of using Apple hardware in the workplace. In recent years, User Enrollment has extended the functionality of Managed Apple IDs.</p><p> <a href=\"https://9to5mac.com/2022/03/05/apple-work-if-i-sign-into-a-managed-apple-id-on-a-personal-device-what-can-my-company-do-to-my-device/#more-785618\" class=\"more-link\">more…</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/03/05/apple-work-if-i-sign-into-a-managed-apple-id-on-a-personal-device-what-can-my-company-do-to-my-device/\">Apple @ Work: If I sign into a Managed Apple ID on a personal device, can my work access personal information?</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": null,
  "description": "Managed Apple IDs can be used on personal devices to access corporate files, and it's extremely beneficial in a BYOD environment.",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}