{
  "title": "Apple @ Work: Tailscale is a first-principles approach to VPN technology with full macOS and iOS support",
  "url": "https://9to5mac.com/2022/04/23/tailscale-ios-macos/",
  "date": "Sat, 23 Apr 2022 12:00:00 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/03/Tailscale.png?w=1600\" /></div><p><a href=\"https://bit.ly/3BCEYhO\"><strong><em>Apple @ Work is brought to you by Mosyle</em></strong></a><em>, the leader in modern mobile device management (MDM) and security for Apple enterprise and education customers. Over 28,000 organizations leverage Mosyle solutions to automate the deployment,  management and security of millions of Apple devices daily. </em><a href=\"https://bit.ly/3BCEYhO\"><em>Request a FREE account today</em></a><em> and discover how you can put your Apple fleet on auto-pilot at a price point that is hard to believe.</em></p><p>There’s a concept of <a href=\"https://cribl.io/blog/building-an-agent-from-first-principles/\">building from first principles</a> that can create some pretty incredible products. For example, one of the technologies I’ve long thought was more complicated than it should be is VPN. VPNs came further into the spotlight with remote work and employees needing to access company resources from wherever they are. I recently came across a product that works great on macOS that takes that first-principles approach to how VPN connections work, and it’s called <a href=\"https://tailscale.com\">Tailscale</a>.</p><p> <a href=\"https://9to5mac.com/2022/04/23/tailscale-ios-macos/#more-795272\" class=\"more-link\">more…</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/04/23/tailscale-ios-macos/\">Apple @ Work: Tailscale is a first-principles approach to VPN technology with full macOS and iOS support</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/03/Tailscale.png?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "description": "Tailscale is a Zero config VPN service that installs on any device in minutes, manages firewall rules for you, and works from anywhere.",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}