{
  "title": "Apple @ Work: Windows file shares are still buggy on macOS; it’s time to fix it once and for all",
  "url": "https://9to5mac.com/2022/03/12/windows-file-shares-are-still-buggy-on-macos-its-time-to-fix-it-once-and-for-while/",
  "date": "Sat, 12 Mar 2022 14:00:00 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/02/SMB-on-mac.png?w=1600\" /></div><p><em>App<a href=\"https://bit.ly/2M34VT3\">le @ Work is brought to you by Kandji</a>, the MDM solution built exclusively for organizations that run on Apple. Kandji is a modern, cloud-based platform for centrally managing and securing your Mac, iPhone, iPad, and Apple TV devices, saving IT teams countless hours of manual work with features like one-click compliance templates and 150+ pre-built automations, apps, and workflows. Request access.</em></p><p>There’s no nice way to say it: File sharing to Windows Server on macOS is a half-baked solution at best. I am not sure if it’s how Apple implemented the protocol, but I’ve talked with countless IT professionals over the past year and everyone comes to the same conclusion: It’s the worst part of using a Mac at work. Disconnects plague macOS in the middle of transfers while Windows stays readily connected to the same server.</p><p> <a href=\"https://9to5mac.com/2022/03/12/windows-file-shares-are-still-buggy-on-macos-its-time-to-fix-it-once-and-for-while/#more-786487\" class=\"more-link\">more…</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/03/12/windows-file-shares-are-still-buggy-on-macos-its-time-to-fix-it-once-and-for-while/\">Apple @ Work: Windows file shares are still buggy on macOS; it&#8217;s time to fix it once and for all</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/02/SMB-on-mac.png?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "description": "Windows file sharing on macOS is still a buggy implementation all these years later, and it's time for Apple to fix it once and for all.",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}