{
  "title": "Apple @ Work: The AppleSeed for IT program is essential for success with major macOS releases",
  "url": "https://9to5mac.com/2022/03/19/the-appleseed-for-it-program-is-essential-for-success-with-major-macos-releases/",
  "date": "Sat, 19 Mar 2022 13:00:00 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/02/Apple-Seed.png?w=1600\" /></div><p><em><a href=\"https://bit.ly/2M34VT3\">Apple @ Work is brought to you by Kandji</a>, the MDM solution built exclusively for organizations that run on Apple. Kandji is a modern, cloud-based platform for centrally managing and securing your Mac, iPhone, iPad, and Apple TV devices, saving IT teams countless hours of manual work with features like one-click compliance templates and 150+ pre-built automations, apps, and workflows. Request access.</em></p><p>The months in 2022 keep moving along. It feels like we were waking up on a 1/1/22, but here we are, nearly through with Q1. If you’re in the same community, these are the “quiet months” before we move into the period where speculation about Apple’s summer software announcements ramps up, followed by the fall releases. If you’re in the IT world, you’re possibly just coming up from air on deploying macOS 12 to your fleet, so the concepts of yet another software release might be exhausting. Truthfully, it is, but it’s coming whether you want it or not. There are things you can do today to prepare for macOS 13 in your organization, though.</p><p> <a href=\"https://9to5mac.com/2022/03/19/the-appleseed-for-it-program-is-essential-for-success-with-major-macos-releases/#more-787586\" class=\"more-link\">more…</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/03/19/the-appleseed-for-it-program-is-essential-for-success-with-major-macos-releases/\">Apple @ Work: The AppleSeed for IT program is essential for success with major macOS releases</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/02/Apple-Seed.png?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "description": "Apple's AppleSeed for IT program is a key part of preparing for new macOS releases with testing plans and and direct access to report bugs.",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}