{
  "title": "Apple @ Work: How Google Apps for Your Domain helped Apple grow its Mac market share in the enterprise",
  "url": "https://9to5mac.com/2022/03/26/how-google-apps-for-your-domain-helped-apple-grow-its-mac-market-share-in-the-enterprise/",
  "date": "Sat, 26 Mar 2022 13:00:00 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/02/Apple-lineup.jpg?quality=82&#038;strip=all&#038;w=1600\" /></div><p><em><a href=\"https://bit.ly/2M34VT3\">Apple @ Work is brought to you by Kandji</a>, the MDM solution built exclusively for organizations that run on Apple. Kandji is a modern, cloud-based platform for centrally managing and securing your Mac, iPhone, iPad, and Apple TV devices, saving IT teams countless hours of manual work with features like one-click compliance templates and 150+ pre-built automations, apps, and workflows. Request access.</em></p><p>Employee choice when it comes to technology is something I applaud. Technology is deeply personal to many people, so using the tools you’re comfortable with improves morale and streamlines productivity. Unfortunately, employee choice with technology wasn’t always something employers considered. Many people give the iPhone credit for driving employee choice as it created a halo effect. The iPhone contributed that, but I want to argue that Google deserves a lot of credit here as well. Read on to learn more about how Google helped drive the concept of employee choice with technology.</p><p> <a href=\"https://9to5mac.com/2022/03/26/how-google-apps-for-your-domain-helped-apple-grow-its-mac-market-share-in-the-enterprise/#more-788908\" class=\"more-link\">more…</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/03/26/how-google-apps-for-your-domain-helped-apple-grow-its-mac-market-share-in-the-enterprise/\">Apple @ Work: How Google Apps for Your Domain helped Apple grow its Mac market share in the enterprise</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/02/Apple-lineup.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "description": "As companies looked at Google to replace Microsoft Exchange, the Mac became a clear enterprise option as employee choice rose in popularity.",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}