{
  "title": "Cash App discloses security breach impacting over 8 million users",
  "url": "https://9to5mac.com/2022/04/05/cash-app-discloses-security-breach-impacting-over-8-million-users/",
  "date": "Tue, 05 Apr 2022 20:44:38 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/04/cash-app-.jpg?quality=82&#038;strip=all&#038;w=1600\" /></div><p>Cash App, the popular <a href=\"https://cash.app/app/GSZZDSF\">peer-to-peer payment platform</a> that also offers crypto and other stock investing features, is disclosing a security breach affecting 8.2 million of its users. Block, formerly Square, disclosed this breach in a filing with the SEC this week. </p><p>The company revealed that a former employee retained access to US customer information despite departing the company months earlier. Cash App is one of the most popular apps for iOS and a competitor to Apple’s own Apple cash service. </p><p> <a href=\"https://9to5mac.com/2022/04/05/cash-app-discloses-security-breach-impacting-over-8-million-users/#more-797415\" class=\"more-link\">more…</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/04/05/cash-app-discloses-security-breach-impacting-over-8-million-users/\">Cash App discloses security breach impacting over 8 million users</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/04/cash-app-.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "description": "Cash App, the popular peer-to-peer payment platform that also offers crypto and other stock investing features, is disclosing a security breach affecting 8.2 million of its users. Block, formerly Square, disclosed this breach in a filing with the SEC this week. The company revealed that a former employee retained access to US customer information despite […]",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}