{
  "title": "Police confirm ongoing hostage situation unfolding at Apple Store in Amsterdam [Updated]",
  "url": "https://9to5mac.com/2022/02/22/police-confirm-ongoing-hostage-situation-unfolding-at-apple-store-in-amsterdam/",
  "date": "Tue, 22 Feb 2022 21:48:00 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/02/R408.png.jpeg?quality=82&#038;strip=all&#038;w=1600\" /></div><p><strong>Update:<em> </em></strong>Amsterdam Police have now confirmed that the hostage involved in this situation is safe. &#8220;Dozens&#8221; of other people who had been hiding in the Apple Store have also been able to safely leave. Apple&#8217;s website indicates the store will be closed until at least Friday. </p><blockquote class=\"wp-block-quote\"><p>Since the start of the hostage situation in the Apple Store on Leidseplein, several people have been able to leave the building. </p><p>We can confirm that the hostage-taker is from the Apple Store. He lies on the street and with a robot he is examined for explosives. From a distance, police officers control him with firearms. The hostage is in safety. </p><p>Dozens of people who have previously been able to leave the Apple Store are being collected by police officers. They go to a police location for a witness statement and of course for aftercare such as Victim Support.</p></blockquote><hr class=\"wp-block-separator\"/><p>The Amsterdam Police Unit has confirmed an ongoing robbery turned hostage situation occurring at the Apple Store located in Leidseplein. In a message posted to Twitter, the Amsterdam Police said that there is a &#8220;hostage situation&#8221; at the Apple Store, but that it is not sharing any further details at this time &#8220;for the safety of those involved.&#8221; </p><p> <a href=\"https://9to5mac.com/2022/02/22/police-confirm-ongoing-hostage-situation-unfolding-at-apple-store-in-amsterdam/#more-788761\" class=\"more-link\">more&#8230;</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/02/22/police-confirm-ongoing-hostage-situation-unfolding-at-apple-store-in-amsterdam/\">Police confirm ongoing hostage situation unfolding at Apple Store in Amsterdam [Updated]</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/02/R408.png.jpeg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "description": "Update: Amsterdam Police have now confirmed that the hostage involved in this situation is safe. “Dozens” of other people who had been hiding in the Apple Store have also been able to safely leave. Apple’s website indicates the store will be closed until at least Friday. Since the start of the hostage situation in the […]",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}