{
  "title": "Clemson Holds Off Virginia Tech for Senior Day Victory - Clemson Tigers",
  "url": "https://clemsontigers.com/clemson-holds-off-virginia-tech-for-senior-day-victory/",
  "date": "Sat, 05 Mar 2022 22:28:44 GMT",
  "content": "<a href=\"https://clemsontigers.com/clemson-holds-off-virginia-tech-for-senior-day-victory/\" target=\"_blank\">Clemson Holds Off Virginia Tech for Senior Day Victory</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Clemson Tigers</font>",
  "image": "https://clemsontigers.com/amt-media/534016",
  "description": "Final Stats CLEMSON, S.C. —  Senior Hunter Tyson (Monroe, N.C./Piedmont) knocked home a 10-footer with 32.2 seconds left to ice the game, as Clemson University Men’s Basketball hung on to upend Virginia Tech 63-59 on Saturday in the 2021-22 regular-season finale. With the win, Clemson improved to 16-15 on the season and 8-12 in league play and marked Clemson’s fourth win in a row. The Hokies, who entered the game 32nd in the NCAA NET rankings, fell to 19-12 overall and 11-9 in league play. Clemson will enter as the ten seed in the ACC Tournament at the Barclays Center in Brooklyn, N.Y. Play gets underway for Clemson against the 15-seed at 4:30 p.m. on Tuesday, televised on ACCN. Clemson started and finished strong defensively, holding Virginia Tech without a field goal for the first 8:08 of the game, and just one make in their final 11 shot attempts over the final 5:50 of the game. Clemson’s leading scorer, PJ Hall (Spartanburg, S.C./Dorman), returned after a three-game absence due to injury and responded in a big way, scoring 12 points, ten of which came in the second half, in 13 minutes of action. Saturday marked the first time both Hall and Tyson appeared in a game together since Feb. 2, a stretch of nine games. Senior David Collins (Youngstown, Ohio/First Love Christian Academy) added 10 points on 4-of-5 shooting, hitting both of his three-point attempts in a team-high 30 minutes. Alex Hemenway (Newburgh, Indiana/Castle) added 11 points, including a 3-for-3 mark behind the arc, and Al-Amir Dawes (Newark, N.J./The Patrick School) also finished in double-figures with 10 points. As part of its senior day ceremonies, Clemson honored Collins, Tyson, Naz Bohannon (Lorain, Ohio/Lorain), and Parker Fox (Reno, Nev./Oconee). Clemson’s defense came out aggressively, holding the Hokies without a field goal for the first 8:08 of the game. The teams played within two possessions in the first half before Virginia Tech’s Nahiem Alleyne matched a season high with four three-pointers over the next four minutes to help the Hokies take a lead and sparked an 11-2 run to take a seven-point advantage with 4:43 to play in the half. Clemson would trail by as many as nine with 1:11 to play in the half before a 10-0 run spanning halftime gave the Tigers the lead just over two minutes into the second half, as Hall put down a dunk and rattled home a jumper. The second half featured seven lead changes in the first eight minutes before the Tigers were able to stake a six-point lead with 10:08 to play. With the game knotted at 54-54 with 4:55 to play, Hall scored on consecutive possessions to give the Tigers a four-point edge. Nahiem Alleyne hit his season-high fifth three-pointer to close the margin to one. But Nick Honor’s jumper stretched it back out to three with 2:30 to play. Neither team scored over the next 1:45 as VT again pulled within one with 44 seconds to play. Clemson broke through full-court pressure from the Hokies, setting up Tyson’s opportunity with 32.2 seconds left, and Honor found Tyson alone at the top of the key. The senior took two dribbles and pulled up from ten feet, again giving the Tigers a cushion. The defense held on late to ice it for the Tigers. Get the latest news on all things Clemson men’s basketball by following us on Twitter (@ClemsonMBB), Facebook (/ClemsonMBB) and Instagram (@clemsonmbb).",
  "publisher": "Google News Tech USA",
  "publisherUrl": "https://news.google.com/topstories?hl=en-US&gl=US&ceid=US:en"
}