{
  "title": "Five Run Sixth Inning Leads Softball Past No. 5 Virginia Tech - Florida State University",
  "url": "https://seminoles.com/five-run-sixth-inning-leads-softball-past-no-5-virginia-tech/",
  "date": "Sun, 10 Apr 2022 19:17:41 GMT",
  "content": "<a href=\"https://seminoles.com/five-run-sixth-inning-leads-softball-past-no-5-virginia-tech/\" target=\"_blank\">Five Run Sixth Inning Leads Softball Past No. 5 Virginia Tech</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Florida State University</font>",
  "image": "https://seminoles.com/wp-content/uploads/2022/04/amt-6685556ccae4c2a416956af7aea9ad7e4318fb8c-DSC08984.jpg",
  "description": "TALLAHASSEE, Fla. -  After losing the previous two games against the Hokies, the Seminoles (37-4) bounced back in a big way to win the final game of the series against No. 5 Virginia Tech (29-5). In a back-and-forth game between the Noles and the Hokies, a clutch double by Sydney Sherill in the bottom of the sixth inning is what willed the Seminoles to victory.  After a quick 1-2-3 inning by Kathryn Sandercock in the first inning, Kaley Mudge singled on the first pitch of the game. After advancing to second on a Sherill foul out, Mudge then advanced to third on a passed ball. When Michaela Edenfield stepped up to bat, she hit a deep fly ball to center field that scored Mudge to give the Seminoles a 1-0 lead after just one inning. After stranding two VT runners on base in the second inning, Kalei Harding got the Seminoles started with a double. Harding then advanced to third on a fielder’s choice, and Josie Muffley hit an RBI single with two outs to make the game 2-0.  After a quiet inning for both teams in the third, the Hokies got on the board in the fourth when Jayme Bailey hit a sac fly to score Emma Yates and Darby Trull hit a double in the next at-bat to score Emma Ritter, tying the game at two. In the bottom of the fifth, Josie Muffley walked to open the inning and quickly advanced to third base thanks to stealing second and a throwing error by the Hokies, which allowed Mudge to get on base as well. After Sherill walked, Edenfield was up to bat and hit a single to give her a team-leading 45th RBI and made the score 3-2.  In the top of the sixth, Virginia Tech answered Florida State, retaking the lead after Meredith Slaw singled, Darby Trull walked, and Mackenzie Lawter walked to give the Hokies the bases loaded with two outs. Addy Green came to bat and hit an inside the park grand slam to give the Hokies a 6-3 lead.  The Seminoles put together a five-run sixth inning to answer and take back the lead. To open the inning, Devin Flaherty doubled and at the next at-bat, Kalei Harding hit an RBI single to make the game 6-4. After Hallie Wacaser hit a single and was pinch ran for by Autumn Belviy, Harding and Belviy advanced to second and third base after Jahni Kerr was thrown out at first base. After two walks due to illegal pitches, Josie Muffley and Kaley Mudge both got on base, with Mudge’s walk scoring Harding to make the score 6-5. Sherill then stepped up to bat at what was one of the biggest moments of the Noles' weekend and on a 2-2 pitch hit a double deep to right-center field clearing the basses and scored Mudge, Muffley, and Belviy to give the Seminoles an 8-6 lead, which would go on to be the final score of the game.   Kathryn Sandercock then took care of business in the top of the seventh to secure the win for the Noles and give her another complete-game win on the season. Sandercock finished the game allowing seven hits and six runs. The win improved Sandercock to 20-1 on the season.   The next games for this Seminole squad are next weekend as the team travels to Chapel Hill to take on North Carolina. The Noles will be back in Tallahassee on April 19th to take on Stetson.   Follow Florida State softball on Twitter (@FSU_Softball) and Instagram (fsusoftball), and like our Facebook page (Facebook.com/FSUsoftball) to keep up to date with everything about Seminole softball.",
  "publisher": "Google News Tech USA",
  "publisherUrl": "https://news.google.com/topstories?hl=en-US&gl=US&ceid=US:en"
}