{
  "title": "Georgia Tech Survives Washington's Record-Setting Performance – Clemson Tigers Official Athletics Site - clemsontigers.com",
  "url": "https://clemsontigers.com/georgia-tech-survives-washingtons-record-setting-performance/",
  "date": "Sun, 13 Feb 2022 19:33:28 GMT",
  "content": "<a href=\"https://clemsontigers.com/georgia-tech-survives-washingtons-record-setting-performance/\" target=\"_blank\">Georgia Tech Survives Washington's Record-Setting Performance – Clemson Tigers Official Athletics Site</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">clemsontigers.com</font>",
  "image": "https://clemsontigers.com/amt-media/500872",
  "description": "Atlanta, Ga. – Delicia Washington scored a career-high 40 points, but Georgia Tech outscored the Tigers 15-7 in overtime to survive against the Tigers, 92-84. The win moves the 11-ranked Yellow Jackets to 19-6, 10-4 ACC, on the year, while the loss drops the Tigers to 9-17, 3-12 ACC.Washington, now the only player in Clemson women’s basketball history not named Barbara Kennedy to score 40 points in a game, finished 16-of-23 from the floor, including 3-for-5 from three. Daisha Bradford, who hit the game-tying buzzer beater to send it to overtime, finished with 18 points, including four threes. Georgia Tech came out hot, scoring 21 points in the first quarter. The Jackets continued their hot shooting, pushing the lead to 17 on Sarah Bates’ fifth three of the half. Delicia Washington sparked a 9-0 Clemson run to cut the lead to eight at 40-32 heading into halftime.Washington poured in 12 points in the third quarter, as the Tigers out-scored the Yellow Jackets 30-19 to take a 62-59 lead heading into the game’s final 10:00. The teams traded baskets in the fourth quarter, until Georgia Tech got two free throws from Eylia Love to take a two-point lead with 18 seconds to go. Washington tied the game with 12 seconds, Lotta-Maj Lahtinen gave Georgia Tech the lead with four seconds and Bradford sent the game into overtime with a driving layup at the buzzer.Georgia Tech out-scored the Tigers 15-7 in the game’s extra five minutes to take the 92-84 win in Atlanta. Love led the Jackets with 26 points, while Lorela Cubaj finished with 22 points. Clemson is back in action next Sunday, hosting Duke in the final home game of the 2021-22 season.",
  "publisher": "Google News Tech USA",
  "publisherUrl": "https://news.google.com/topstories?hl=en-US&gl=US&ceid=US:en"
}