{
  "title": ": No. 20 Noles Drop Opener at Georgia Tech - Florida State University",
  "url": "https://seminoles.com/no-20-noles-drop-opener-at-georgia-tech/",
  "date": "Sat, 09 Apr 2022 02:16:18 GMT",
  "content": "<a href=\"https://seminoles.com/no-20-noles-drop-opener-at-georgia-tech/\" target=\"_blank\">: No. 20 Noles Drop Opener at Georgia Tech</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Florida State University</font>",
  "image": "https://seminoles.com/wp-content/uploads/2022/04/amt-764679b260603a166258d6084d56618d79b54745-James_Tibbs.jpg",
  "description": "ATLANTA – Georgia Tech (20-11, 6-7 ACC) had six runs and 10 hits in the first three innings en route to a 7-3 win over No. 20 Florida State (17-12, 6-7) Friday night at Russ Chandler Stadium.\n\n2022 Baseball Media Center\n\nParker Messick (4-2) was tagged with the loss, allowing 10 hits and six runs in 2.2 innings.\n\nConner Whittaker allowed a solo home run over 2.2 innings, the second-longest outing of his career. Dylan Simmons set career-highs with 1.2 innings pitched and three strikeouts, and Dylan Jacobs pitched a scoreless eighth inning. Combined the bullpen allowed just one run on six hits in 5.1 innings.\n\nKevin Parada got the scoring started with a two-run home run in the first inning, one of four hits for the Yellow Jackets in the frame. The Seminoles cut the lead in half in the second inning against Chance Huff (3-1) when Brett Roberts doubled and scored on Alex Toral’s groundout.\n\nGeorgia Tech took control with four more runs off Messick in the third inning.\n\nParada hit his second home run in the sixth inning to extend the lead to 7-1.\n\nToral and Tyler Martin singled in the seventh, and Logan Lacey extended the inning by reaching on a third strike passed ball. Jaime Ferrer plated two runs on a single to chip into the lead.\n\nFSU loaded the bases in the ninth inning, but Georgia Tech’s Zach Maxwell struck out the next three batters for his first save of the year.\n\nSCORING SUMMARY:\n\nB1 | FSU 0, GT 2      Parada home run, Simpson scored\nT2 | FSU 1, GT 2      Toral grounded out, Roberts scored\nB3 | FSU 1, GT 3      Borden singled, Jenkins scored\nB3 | FSU 1, GT 4      Hall sacrifice fly, Gonzalez scored\nB3 | FSU 1, GT 5      Compton sacrifice fly, Borden scored\nB3 | FSU 1, GT 6      Simpson doubled, DeLeo scored\nB6 | FSU 1, GT 7      Parada home run\nT7 | FSU 3, GT 7      Ferrer singled, Toral and Martin scored\n\nUP NEXT:\n\nGame two between Florida State and Georgia Tech is set for Saturday at 4:00 p.m. on ACCNX. LHP Bryce Hubbart (5-1) is pitching for the Seminoles.\n\nOF NOTE:\n\n \tAtlanta native Brett Roberts doubled in the second inning, his sixth of the year. Roberts’ 18 runs are the second-most on the team, one behind Logan Lacey.\n \tAlex Toral’s RBI in the second inning was his team-best 26th of the year.\n \tJaime Ferrer was hit by a pitch in the third inning, his ACC-leading 12th HBP this season. He had a two-run single in the seventh, his team-best 37th hit of the year.\n \tDylan Simmons set career-highs with 1.2 innings pitched and three strikeouts.\n\nFor more information on Florida State baseball, check Seminoles.com for the latest news and scheduling information, and keep up with the team on social media through Twitter and Facebook (@FSUBaseball) & Instagram and TikTok (@NoleBaseball).",
  "publisher": "Google News Tech USA",
  "publisherUrl": "https://news.google.com/topstories?hl=en-US&gl=US&ceid=US:en"
}