{
  "title": "No. 33 Men's Tennis Downs Virginia Tech on Senior Day - Florida State University",
  "url": "https://seminoles.com/no-33-mens-tennis-downs-virginia-tech-on-senior-day/",
  "date": "Sun, 10 Apr 2022 20:04:38 GMT",
  "content": "<a href=\"https://seminoles.com/no-33-mens-tennis-downs-virginia-tech-on-senior-day/\" target=\"_blank\">No. 33 Men's Tennis Downs Virginia Tech on Senior Day</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Florida State University</font>",
  "image": "https://seminoles.com/wp-content/uploads/2022/04/amt-9115f9179f961746bc8351f2f99d7653863233c4-IMG_5246-crop.jpg",
  "description": "TALLAHASSEE, Fla. – No. 33 Florida State men’s tennis (14-8, 4-6) beat Virginia Tech (6-15, 2-8) 4-1 on Sunday at Scott Speicher Memorial Tennis Center as the Noles celebrated their seniors at the final home match of the season.\n\n“I loved how we came out and took care of business in doubles again,” head coach Dwayne Hultquist said. “We dominated both at two and three and got the early start. I think when we get a good start, we play well and play from ahead.”\n\nBoth courts two and three claimed 6-1 wins in doubles to give the Noles a 1-0 lead. It was Alex Bulte and Youcef Rihane’s third straight doubles win on court three while Andreja Petrovic and Loris Pourroy improved to 4-0 this spring.\n\nFlorida State won four first sets to open singles play, including senior Richard Thongoana on court three with a comeback win 7-5. He closed it out with a dominant win in the second set 6-1 to extend the Noles’ lead.\n\nMaks Silagy, in only his third singles appearance this season, notched a win on court six while Petrovic clinched the win on court two, both in straight sets.\n\n“I thought the determining part of the match was the end of the first sets, and there were a bunch of tight matches going on,” Hultquist added. “Maks got a first set, and very quickly we got four first sets when it could have been just two. Once we got to four, we controlled the match, got up in the second sets and finished it off.”\n\nFlorida State travels for the final two regular season matches this week to face Clemson Thursday at 5 p.m. and Georgia Tech Saturday at 12 p.m.\n\n#33 Florida State University 4, Virginia Tech 1\n\nSingles competition\n\n \t#55 Loris Pourroy (FSU) vs. #78 Ryan Fishback (VT) 6-3, 4-5, unfinished\n \tAndreja Petrovic (FSU) def. Alvaro Ariza (VT) 6-3, 6-3\n \tRichard Thongoana (FSU) def. Michael Shepheard (VT) 7-5, 6-1\n \tYoucef Rihane (FSU) vs. Carlo Donato (VT) 4-6, 3-3, unfinished\n \tScott Sculley (VT) def. Josh Karpenschif (FSU) 6-2, 6-4\n \tMaks Silagy (FSU) def. Alberto Orso (VT) 6-2, 6-3\n\nDoubles competition\n\n \tMaks Silagy/Josh Karpenschif (FSU) vs. Ryan Fishback/Alvaro Ariza (VT) 2-5, unfinished\n \tAndreja Petrovic/Loris Pourroy (FSU) def. Scott Sculley/Matt Harper (VT) 6-1\n \tAlex Bulte/Youcef Rihane (FSU) def. Carlo Donato/Michael Shepheard (VT) 6-1\n\nFor more information on the Seminole Men’s Tennis program, check Seminoles.com and follow us on social media at FSUMTennis (IG) and @FSU_MTennis (TW).",
  "publisher": "Google News Tech USA",
  "publisherUrl": "https://news.google.com/topstories?hl=en-US&gl=US&ceid=US:en"
}