{
  "title": "Scrappy Tigers Fall to #14 Georgia Tech – Clemson Tigers Official Athletics Site - clemsontigers.com",
  "url": "https://clemsontigers.com/scrappy-tigers-fall-to-14-georgia-tech/",
  "date": "Mon, 31 Jan 2022 01:48:53 GMT",
  "content": "<a href=\"https://clemsontigers.com/scrappy-tigers-fall-to-14-georgia-tech/\" target=\"_blank\">Scrappy Tigers Fall to #14 Georgia Tech – Clemson Tigers Official Athletics Site</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">clemsontigers.com</font>",
  "image": "https://clemsontigers.com/amt-media/442746",
  "description": "Clemson, S.C. – Another furious fourth-quarter rally fell just short, as Clemson dropped a 69-62 contest to #14 Georgia Tech on Sunday evening in Littlejohn. The win moves the Yellow Jackets to 17-4 (8-2 ACC) on the year, while the loss drops the Tigers to 7-14 (1-9 ACC).Freshman Kionna Gaines turned in a breakout performance, amassing 18 points on 7-of-9 shooting in just 18:00 off the bench. Delicia Washington turned in another double-digit scoring game with 14, and a team-high six rebounds. Daisha Bradford finished with 8 points, 5 rebounds, 5 assists and three steals, and the Tigers limited Georgia Tech to just three offensive rebounds on the night. Clemson led by as many as five in the opening frame, but Georgia Tech got the first of Sarah Bates’ game-high five threes to give the Yellow Jackets the lead with just two seconds to go in the first. Georgia Tech held Clemson without a basket for 6:00 of the second quarter, pushing the lead to nine, but the Tigers cut the lead to seven after a layup by LaTrese Saine to end the half. The teams played a tight third quarter, as a layup by Gaines cut the Georgia Tech lead to one with 2:00 to go in the period. The Jackets pushed the lead back to six, but Gaines’ only  three-pointer of the evening cut the lead to three. Georgia Tech then got a basket from Lorela Cubaj to push the lead to five to start the game’s final 10:00. Georgia Tech capitalized on a 12-3 run in the fourth quarter to seemingly put the game out of reach, taking a 15-point lead with just over 1:00 to play. The Tigers wouldn’t go away quietly, however, ending the game on an 11-3 run to put pressure on the Yellow Jackets, but ultimately fall 69-62.Clemson is back in action on Thursday evening, closing out a three-game homestand with #5 Louisville Cardinals. Tipoff is scheduled for 6:00 p.m. inside Littlejohn Coliseum.",
  "publisher": "Google News Tech USA",
  "publisherUrl": "https://news.google.com/topstories?hl=en-US&gl=US&ceid=US:en"
}