{
  "title": "Tigers Complete Sweep With 14-2 Win Over No. 21 Georgia Tech - Clemson Tigers",
  "url": "https://clemsontigers.com/cu225081/",
  "date": "Sun, 08 May 2022 20:26:15 GMT",
  "content": "<a href=\"https://clemsontigers.com/cu225081/\" target=\"_blank\">Tigers Complete Sweep With 14-2 Win Over No. 21 Georgia Tech</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Clemson Tigers</font>",
  "image": "https://clemsontigers.com/amt-media/544314",
  "description": "CLEMSON, S.C. - Five different Tigers hit a home run within the first five innings and every Tiger starter had at least one hit and scored at least one run in Clemson’s 14-2 victory over No. 21 Georgia Tech at Doug Kingsmore Stadium on Sunday afternoon. The Tigers, who swept the series 3-0, improved to 31-17 overall and 9-14 in the ACC. The Yellow Jackets dropped to 27-21 overall and 12-15 in ACC play. Dylan Brewer drew a two-out walk with the bases loaded in the first inning, then Jonathan French led off the second inning with his seventh home run of the season. Five batters later in the frame with two outs, Cooper Ingle laced a three-run homer, his eighth of the year. In the fourth inning, Max Wagner crushed a two-run homer, his 22nd of the season, then Bryar Hawkins lined a solo homer, his sixth of the year, two batters later. In the fifth inning, Camden Troyer belted a solo homer, the first of his career, to up Clemson’s lead to 9-0. The Yellow Jackets got on the scoreboard in the top of the seventh inning on Drew Compton’s run-scoring single, then Clemson responded with two runs in the bottom of the seventh inning, highlighted by Benjamin Blackwell’s run-scoring double and Will Taylor’s run-scoring single. In the eighth inning, Clemson tacked on three runs on Troyer’s two-run single and Blackwell’s sacrifice fly. Reliever Jay Dill (2-1) earned the win, as he gave up two hits, one run and one walk with three strikeouts in 2.0 innings pitched. Tiger starter Billy Barlow allowed just four hits, no runs and one walk with five strikeouts in 4.2 innings pitched. Georgia Tech starter Chance Huff (3-4) suffered the loss. The Tigers play College of Charleston at Segra Park in Columbia, S.C. on Tuesday at 7:05 p.m. on ACC Network Extra.",
  "publisher": "Google News Tech USA",
  "publisherUrl": "https://news.google.com/topstories?hl=en-US&gl=US&ceid=US:en"
}