{
  "title": "BOOTCAMP project: TWITTER CLONE",
  "url": "https://flaviocopes.com/project-twitter-clone/",
  "date": "Tue, 22 Feb 2022 07:00:00 +0200",
  "content": "        <p>One of the projects of the <a href=\"https://bootcamp.dev\">2022 Full-Stack Web Development Bootcamp</a> (signups open March 29, bootcamp starts on April 05) is building a Twitter Clone.</p><p>I typically consider social networks to be a good way to lose your time.But not when you look at them as a developer trying to replicate their features.</p><p>In this case, they become really good teachers.</p><p>In part because you might be familiar with how they work.</p><p>In part because they offer features we can look at, and think about how to recreate on our own, without trying to invent anything new.</p><p>Take Twitter. Even if you don&rsquo;t use it, you surely know vaguely how it works.Someone tweets something, people can like, retweet and reply.</p><p>In this project of the bootcamp we&rsquo;ll try to replicate the core functionality of Twitter.</p><p>In particular, we&rsquo;ll focus on</p><ul><li>authentication, setting up a Next.js website for email-based authentication</li><li>letting users choose a username once they login</li><li>offering users a form to tweet their thougths</li><li>viewing all tweets (home page)</li><li>viewing tweets from just a single person (profile page)</li><li>implementing pagination when tweets are too many</li><li>allowing users to reply to tweets</li><li>allowing users to delete their own tweets</li></ul><p>Everything under the hood is powered by Next.js, PostgreSQL, Prisma.</p><p>A very simple stack that you can use to build everything you want.</p><p>In the bootcamp, we&rsquo;ll build 15 projects all with the same stack of tools.</p><p>I think repetition and a laser-focused approach is key to really &ldquo;get&rdquo; a technology.</p><p>Instead of doing every project with something different, which you&rsquo;ll forget about in 1 week, we&rsquo;ll keep reusing and reusing the same core set of tools and you&rsquo;ll become a real master.</p><p>So in the end you&rsquo;ll be able to look at anything and say &ldquo;I can build that&rdquo;.</p><p>Remember to sign up to the waiting list at <a href=\"https://bootcamp.dev\">https://bootcamp.dev</a></p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "One of the projects of the 2022 Full-Stack Web Development Bootcamp (signups open March 29, bootcamp starts on April 05) is building a Twitter Clone.\nI typically consider social networks to be a good way to lose your time. But not when you look at them as a developer trying to replicate their features.\nIn this case, they become really good teachers.\nIn part because you might be familiar with how they work.",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}