{
  "title": "BOOTCAMP project: JOB BOARD",
  "url": "https://flaviocopes.com/project-job-board/",
  "date": "Tue, 22 Feb 2022 07:00:00 +0200",
  "content": "        <p>One of the projects of the <a href=\"https://bootcamp.dev\">2022 Full-Stack Web Development Bootcamp</a> (signups open March 29, bootcamp starts on April 04) is a REST API.</p><p>During the bootcamp we&rsquo;ll work on two different kind of projects.</p><p>One kind is clones of popular applications, like Twitter, Reddit or YouTube.You already know what we&rsquo;re going to build as you use those apps and you&rsquo;re already familiar with them.</p><p>So it&rsquo;s both useful and fun. The next time you&rsquo;ll open YouTube you&rsquo;ll think about how you implemented the subscription mechanism or how you handled comments.</p><p>Another kind of applications we&rsquo;ll work on is creating regular, smaller in scale websites.</p><p>One example of this kind of app is a <strong>job board</strong>.</p><p>Job boards are popping up everywhere in every niche. Suppose you have a website that is focusing on a specific industry. A good way to make money from that is to post jobs, show them in front of people that are interested in those jobs, and make companies pay you to connect them to this audience.</p><p>It&rsquo;s a nice business model, providing value for everyone.</p><p>So that&rsquo;s what we&rsquo;ll build.</p><p>We&rsquo;ll start by listing jobs in the homepage.</p><p>Then we&rsquo;ll allow people to login.</p><p>This project is interesting because it&rsquo;s a two-sided marketplace.</p><p>This means we have 2 kinds of users:</p><ol><li>people looking for a job</li><li>companies advertising job openings</li></ol><p>To solve this we&rsquo;ll add a form after signup to say &ldquo;I&rsquo;m a company&rdquo; or &ldquo;I&rsquo;m a user&rdquo;.</p><p>Once this decision is taken, those 2 groups of users will have a radically different experience on the app.</p><p>One group can create new jobs.</p><p>One group can submit applications to jobs, adding a cover letter.</p><p>Companies will see the applications, and will be able to unlist jobs after they have received enough applicants.</p><p>This project was very interesting to build and I&rsquo;m sure it will be fun for you to work on!</p><p>Remember to sign up to the waiting list at <a href=\"https://bootcamp.dev\">https://bootcamp.dev</a></p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "One of the projects of the 2022 Full-Stack Web Development Bootcamp (signups open March 29, bootcamp starts on April 04) is a REST API.\nDuring the bootcamp we’ll work on two different kind of projects.\nOne kind is clones of popular applications, like Twitter, Reddit or YouTube. You already know what we’re going to build as you use those apps and you’re already familiar with them.\nSo it’s both useful and fun.",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}