{
  "title": "BOOTCAMP project: LANDING PAGE",
  "url": "https://flaviocopes.com/project-landing-page/",
  "date": "Tue, 15 Feb 2022 07:00:00 +0200",
  "content": "        <p>The first project we&rsquo;ll build in the <a href=\"https://bootcamp.dev\">2022 Full-Stack Web Development Bootcamp</a> (signups open March 29, bootcamp starts on April 04) is a landing page.</p><p>What&rsquo;s a landing page?</p><p>It&rsquo;s a website that has the goal of presenting something to someone that has never heard of it.</p><p>And quickly present the benefits and how what we created can solve their problems.</p><p><img src=\"Screen Shot 2022-02-15 at 10.46.33.png\" alt=\"\" /></p><p>Plus the practical information like showing prices, having a signup and login form, having a company blog etc.</p><p><img src=\"Screen Shot 2022-02-15 at 10.46.35.png\" alt=\"\" /></p><p>Gradually expanding from &ldquo;just a landing page&rdquo; to a &ldquo;website that people see and get to know our web app&rdquo;.</p><p>After seeing that they will decide if it&rsquo;s worth signing up to the applications.</p><p>This project is interesting because we can apply what we learn here to all the other projects we&rsquo;ll build in the bootcamp. Every web app needs a website that explains what&rsquo;s it all about.</p><p>We&rsquo;ll start with this project because the bootcamp starts from zero and this is a great way to introduce to HTML and styling a page with Tailwind CSS.</p><p>It&rsquo;s a great way because it&rsquo;s not too simple to be interesting.</p><p>And it&rsquo;s also not too complicated to require too much explanation beforehand.</p><p>Typically in the Bootcamp, after the first weeks where we&rsquo;ll introduce <em>concepts</em>, we&rsquo;ll work on one project every week. This strict time boxing lets us practice and become really familiar with how to create applications.</p><p>This project however will span over a few different weeks.</p><p>The first time we&rsquo;ll work on this is in week 2. We&rsquo;ll start week 1 by introducing HTML and Tailwind, the essentials you need to get started.</p><p>Initially we&rsquo;ll build the the project with Astro, which is a static site builder that&rsquo;s excellent at introducing to a JSX-like syntax without having to learn JavaScript.</p><p>We&rsquo;ll build a few pages of our &ldquo;landing page&rdquo; and we&rsquo;ll learn how to deploy that site to the Internet.</p><p>After learning JavaScript and &ldquo;JavaScript in the browser&rdquo; in week 3, we&rsquo;ll be ready to get back to our landing to create a signup form and a login form that talk to a Node.js backend.</p><p>And when we&rsquo;ll learn what components are, we&rsquo;ll introduce components to our landing site.</p><p>Finally, this will be the first React + Next.js website because once we learn the basics of React and Next.js, we&rsquo;ll move the site from Astro (which is great to familiarize with everything we said so far without feeling overwhelmed) to Next.js.</p><p>So this &ldquo;landing page&rdquo; project will be with us all throughout the first 5 weeks of the BOOTCAMP.</p><p>Then we&rsquo;ll introduce databases and we&rsquo;ll go full speed into one different project every week.</p><p>It will help us go from zero to:</p><ul><li>we know how to use HTML</li><li>we know how to use Tailwind CSS</li><li>we know how to use components</li><li>we know how to use JavaScript</li><li>we know how to use React</li><li>we know how to use Next.js</li></ul><p>..without getting distracted by &ldquo;we&rsquo;ll work on something different now&rdquo; and we have to switch focus. Instead, we&rsquo;ll move up in our &ldquo;learning ladder&rdquo; with the same flexible project.</p><p>The goal of it is to be a learning tool, but still interesting and useful because every project you&rsquo;ll ever build will be in need of a landing page.</p><p>Everything on the Internet starts from &ldquo;we have this interesting idea and we need to present it to the world&rdquo;.</p><p>That&rsquo;s our LANDING PAGE project.</p><p><img src=\"Screen Shot 2022-02-15 at 10.46.38.png\" alt=\"\" /></p><p><img src=\"Screen Shot 2022-02-15 at 10.46.39.png\" alt=\"\" /></p><p>Remember to sign up to the waiting list at <a href=\"https://bootcamp.dev\">https://bootcamp.dev</a></p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "The first project we’ll build in the 2022 Full-Stack Web Development Bootcamp (signups open March 29, bootcamp starts on April 04) is a landing page.\nWhat’s a landing page?\nIt’s a website that has the goal of presenting something to someone that has never heard of it.\nAnd quickly present the benefits and how what we created can solve their problems.\nPlus the practical information like showing prices, having a signup and login form, having a company blog etc.",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}