{
  "title": "BOOTCAMP 2022: the official schedule",
  "url": "https://flaviocopes.com/bootcamp-schedule/",
  "date": "Tue, 08 Mar 2022 07:00:00 +0200",
  "content": "        <p>The <a href=\"https://bootcamp.dev\">2022 Full-Stack Web Development Bootcamp</a> will officially open signups in just 2 weeks.</p><p>These days I&rsquo;m working full-time on building the Bootcamp projects and creating the best experience I can, to help you progress and become a Web Developer with me.</p><p>It&rsquo;s kind of a big event, as it&rsquo;s a once-a-year cohort-based course that lasts 20 weeks.</p><p>We&rsquo;re at the 3rd edition this year, and I&rsquo;m re-doing the entire curriculum from scratch.</p><p>Nothing in the 2022 edition is &ldquo;reused&rdquo; from past editions.</p><p>The first 2 editions were absolutely fantastic in terms of feedback and satisfaction. However, there was too much theory and concepts before reaching a point where you started to work on actual projects. Too much waiting before the real fun started.</p><p>So this year I decided to revisit everything and make the bootcamp much more oriented towards <strong>projects</strong>.</p><p>We&rsquo;ll learn just the tiny bit of theory and concepts you need to get started, then we&rsquo;ll 100% focus on the practical parts. </p><p>All the projects will use the same stack with React and Next.js backed by PostgreSQL and Prisma as a data layer. I&rsquo;m a firm believer that repetition and constant, consistent effort leads to results. This is the reason why we&rsquo;ll focus on one single set of technologies that you&rsquo;ll master.</p><p>And after 20 weeks you&rsquo;ll be so skilled and confident that you&rsquo;ll be able to create projects while you sleep. </p><p>If you do it well, following the projects week after week and working on the exercises I propose, you&rsquo;ll build an amazing portfolio of apps that you&rsquo;ll be able to showcase at your next job interview.</p><p>And there&rsquo;s always time to learn that particular niche feature I did not explain in the bootcamp, because you&rsquo;ll be hired at that cool company and you&rsquo;ll have all the time to learn on the job.</p><p>This morning I spent some time to prepare and publish the official schedule.</p><p>Here we go.</p><p><code>April 04</code> <strong>Week 1</strong> <strong>HTML and the basics</strong></p><p>We’ll start from absolute zero. We&rsquo;ll learn HTML, how the Web works, Git, the command line, the basics of Tailwind, how to deploy your first static website on Netlify</p><p><code>April 11</code> <strong>Week 2</strong> <code>PROJECT</code> <strong>Practice with HTML and Tailwind</strong></p><p>We’re going to build a “landing page” static website with HTML and Tailwind. We&rsquo;ll use npm and Astro as a simple static site generator.</p><p><code>April 18</code> <strong>Week 3</strong> <strong>JavaScript</strong></p><p>We will learn the basics of JavaScript (enough JS for React), DOM and browser events</p><p><code>April 25</code> <strong>Week 4</strong> <code>PROJECT</code> <strong>Forms</strong></p><p>We&rsquo;ll lean how to think in terms of components to create layouts. We&rsquo;ll learn the basics of Node.js and form elements, and how to style forms in Tailwind. We&rsquo;ll work on adding login and signup forms to the static website we created in week 2, validating and handling form submission for login, signup and newsletter. We&rsquo;ll create a Node.js endpoint to get the data.</p><p><code>May 02</code> <strong>Week 5</strong> <strong>React and Next.js</strong></p><p>We&rsquo;ll learn the basics of React and Next.js, we&rsquo;ll introduce Vercel, and we&rsquo;ll see how to install and use Node.js libraries. We&rsquo;ll make practice by creating the first React/Next.js website moving the static HTML + Tailwind site we made in week 2 to this new platform</p><p><code>May 09</code> <strong>Week 6</strong> <strong>Databases, SQL, Prisma</strong></p><p>Introduction to databases, relational databases, SQL and the Prisma ORM to interact with the database from JavaScript</p><p><code>May 16</code> <strong>Week 7</strong> <code>PROJECT</code> <strong>REST API</strong></p><p>We will create a real-world REST API with Next.js and Prisma that interacts with the database. We will learn what an API is, and we will build a real-world REST API with Next.js, backed with a database, using Prisma</p><p><code>May 23</code> <strong>Week 8</strong> <strong>State Management and Authentication</strong></p><p>Managing state in React with easy-peasy, building forms in React, handling sessions and authentication with NextAuth</p><p><code>May 30</code> <strong>Week 9</strong> <code>PROJECT</code> <strong>Build a Twitter clone</strong></p><p>We’ll build a clone of Twitter with Next.js, focusing on the core aspects of how a social network like Twitter works. We’ll implement authentication, creating a profile, tweeting, replying to tweets, and much more!</p><p><code>June 06</code> <strong>Week 10</strong> <code>PROJECT</code> <strong>Build a job board</strong></p><p>We’ll build a two-sided marketplace application: a job board. We’ll have people that submit jobs, and people that apply to jobs, so we’ll handle the experience of both those scenarios.</p><p><code>June 13</code> <strong>Week 11</strong> <code>PROJECT</code> <strong>Build a Reddit clone</strong></p><p>We’ll create a clone of Reddit, the super popular social network. We’ll create subreddits, allow people to post into them, we’ll implement nested comments, and uploading images to an AWS S3 bucket</p><p><code>June 20</code> <strong>Week 12</strong> <code>PROJECT</code> <strong>Build a YouTube clone</strong></p><p>In week 12 we’ll create our own YouTube! We’ll let people create channels, upload videos to AWS S3 and serve them via a player, subscribe to channels, we’ll add search, pagination, and more!</p><p><code>June 27</code> <strong>Week 13</strong> <code>PROJECT</code> <strong>Digital downloads website</strong></p><p>We’ll create something similar to Gumroad, but for one single user. Say you create ebooks (or anything else that’s digital), and you want to sell them. We’ll make a private area to upload and add all the details about the digital products, and the frontend-facing area will handle purchases through Stripe and we&rsquo;ll let people download the files and leave reviews.</p><p><code>July 04</code> <strong>Week 14</strong> <code>PROJECT</code> <strong>Rental apartment website</strong></p><p>Imagine Airbnb, but for your own apartment. Instead of a marketplace of houses, it’s a site dedicated to just your house. You set the rates, there’s an availability calendar, people can book nights directly on your site. We&rsquo;ll have total control and no fees.</p><p><code>July 11</code> <strong>Week 15</strong> <code>PROJECT</code> <strong>Site using a Headless CMS</strong></p><p>We’ll create a content-centered website that will use a headless CMS as its content “base”. Then our Next.js website will take care of distributing this content. A perfect use care for this is when non-technical people need to update the website.</p><p><code>July 18</code> <strong>Week 16</strong> <code>PROJECT</code> <strong>Zoom clone</strong></p><p>Ever used Zoom to make a video call? We will create a website that lets anyone start a live video call and generate an invite code so other people can join.</p><p><code>July 25</code> <strong>Week 17</strong> <code>PROJECT</code> <strong>Create a site with a private members area</strong></p><p>We are going to create a website on which you can create a private members-only area. Members will pay a monthly fee using Stripe to join the members area, and inside it we’ll add something that our users will want to pay for. Like Patreon, but on our own website.</p><p><code>August 01</code> <strong>Week 18</strong> <code>PROJECT</code> <strong>Create a Tripadvisor/Yelp clone</strong></p><p>Depending on where you live, you might be used to opening Tripadvisor or Yelp for reviews of the place you’re in. We’re going to create something similar, with places and activities and reviews, except for a local place. Think of a tourist area near you and imagine a website that is highly focused on that and its hotels, restaurants, shops.</p><p><code>August 08</code> <strong>Week 19</strong> <code>PROJECT</code> <strong>Build a project management SaaS</strong></p><p>If you’ve ever used a tool like Basecamp or Asana, you know how it makes collaboration simple. People will pay to access and use our app. We’ll create a simple project management app with free trial, signup, monthly payment plans with Stripe for users, cancellation, etc.</p><p><code>August 15</code> <strong>Week 20</strong> <code>PROJECT</code> <strong>Create an e-commerce website</strong></p><p>We will create a real-world e-commerce shop that sells physical items. We’ll add items into an admin interface, people will browse and shop for items, add them to the cart, and will checkout. We’ll send the order to the shop owner and they’ll take care of shipping etc.</p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "The 2022 Full-Stack Web Development Bootcamp will officially open signups in just 2 weeks.\nThese days I’m working full-time on building the Bootcamp projects and creating the best experience I can, to help you progress and become a Web Developer with me.\nIt’s kind of a big event, as it’s a once-a-year cohort-based course that lasts 20 weeks.\nWe’re at the 3rd edition this year, and I’m re-doing the entire curriculum from scratch.",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}