{
  "title": "BOOTCAMP project: REST API",
  "url": "https://flaviocopes.com/project-rest-api/",
  "date": "Mon, 14 Feb 2022 07:00:00 +0200",
  "content": "        <p>One of the projects of the <a href=\"https://bootcamp.dev\">2022 Full-Stack Web Development Bootcamp</a> (signups open March 29, bootcamp starts on April 05) is a REST API.</p><p>I want to give you a little preview of all the projects of the bootcamp in the coming weeks, let&rsquo;s start with the first one.</p><p>This is a REST API made with Next.js and Prisma, interacting with a PostgreSQL database.</p><p>In particular, we&rsquo;ll build an API to track travel expenses.</p><p>The project is just about the API.</p><p>There will be no &ldquo;client&rdquo; that uses the API, but we&rsquo;ll focus 100% on just creating an API in the best possible way. Imagine you&rsquo;re part of a team that is building a big travel expenses platform app and you&rsquo;re tasked with implementing the API.</p><p>All the projects in the Bootcamp will create and use a serverless REST API with the Next.js built-in API routes, and the React application will be the API client.</p><p>But here, we&rsquo;ll focus on building the API and we&rsquo;ll only talk to it through Insomnia, a very cool tool we use to interface with a REST API.</p><p>We&rsquo;ll gather a list of requirements, and we&rsquo;ll start designing the API by identifying the endpoints and HTTP methods we&rsquo;ll support.</p><p>We&rsquo;ll have to make some decisions, as the API designers.</p><p>Then we&rsquo;ll start defining the parameters each API endpoint will require (mandatory parameters) and support (optional parameters).</p><p>It&rsquo;s important to note that all this work is done before writing a single line of code.</p><p>We must first design the API on paper, and then we can start working on it.</p><p>We&rsquo;ll start with a blank Next.js site and we&rsquo;ll use it to host the API documentation.</p><p>Once we&rsquo;ve done this work, it&rsquo;s time to implement the API.</p><p>We&rsquo;ll use Prisma, a wonderful ORM for SQL databases.</p><p>We&rsquo;ll define the Prisma schema and we&rsquo;ll create the migration needed to automatically create the database table from the schema.</p><p>Then we&rsquo;ll create the first GET request, the simplest API endpoint.</p><p>Gradually we&rsquo;ll implement all the other endpoints, including the ones that support the methods POST/PUT/DELETE.</p><p>This project will be essential to know how to build an API, how to build it in Next.js, and what are the things we need to think when tasked with such a project.</p><p>As we&rsquo;ll be using an API for every bootcamp project, this will be a project you&rsquo;ll always use as reference material to remember what you should do while implementing a REST API.</p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "One of the projects of the 2022 Full-Stack Web Development Bootcamp (signups open March 29, bootcamp starts on April 05) is a REST API.\nI want to give you a little preview of all the projects of the bootcamp in the coming weeks, let’s start with the first one.\nThis is a REST API made with Next.js and Prisma, interacting with a PostgreSQL database.\nIn particular, we’ll build an API to track travel expenses.",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}