{
  "title": "BOOTCAMP project: REDDIT CLONE",
  "url": "https://flaviocopes.com/project-reddit-clone/",
  "date": "Tue, 01 Mar 2022 07:00:00 +0200",
  "content": "        <p>One of the projects of the <a href=\"https://bootcamp.dev\">2022 Full-Stack Web Development Bootcamp</a> (signups open March 29, bootcamp starts on April 05) is a REDDIT CLONE application.</p><p>One of the most interesting projects in the bootcamp are the ones that replicate very popular websites.</p><p>One of them is Reddit.</p><p>Reddit is a unique place on the Internet. You can find anything on it, and I often find myself prefixing Google searches with &ldquo;reddit&rdquo; to find what I&rsquo;m looking for.</p><p>It contains an incredible amount of information and it&rsquo;s super useful. It&rsquo;s also very entertaining.</p><p>It&rsquo;s very open, which makes it very different from other places like for example Facebook Groups.</p><p>Of course as with any “clone big application” project, in one week we’re going to clone a small core set of features, not the whole application that has been built by hundreds of experienced engineers over multiple years of work.</p><p>In the bootcamp we&rsquo;ll replicate some of the core features of Reddit, like having a homepage filled with content, subreddits, user profiles.</p><p>We&rsquo;ll fill the website with fake users and fake data so it does not look like an abandoned website.</p><p><img src=\"Screen Shot 2022-03-01 at 11.01.36.png\" alt=\"\" /></p><p>Users will create a profile, add posts to subreddits, users will add comments.</p><p>We&rsquo;ll create the single post page:</p><p><img src=\"Screen Shot 2022-03-01 at 11.02.28.png\" alt=\"\" /></p><p>Users can upvote or downvote a post.</p><p>Users can create new posts.</p><p><img src=\"Screen Shot 2022-03-01 at 11.02.44.png\" alt=\"\" /></p><p>Uploading images, too:</p><p><img src=\"Screen Shot 2022-03-01 at 11.06.18.png\" alt=\"\" /></p><p>Technically this is done by using an AWS S3 bucket.</p><p>In every project of the bootcamp we have something we&rsquo;ve already done in other projects, and some things that are unique challenges.</p><p>This time we have some interesting challenges in handling image uploads.</p><p>And in allowing nested comments (you can comment to comments, with no limits on how many levels you go into).</p><p><img src=\"Screen Shot 2022-03-01 at 11.09.47.png\" alt=\"\" /></p><p>Remember to sign up to the waiting list at <a href=\"https://bootcamp.dev\">https://bootcamp.dev</a></p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "One of the projects of the 2022 Full-Stack Web Development Bootcamp (signups open March 29, bootcamp starts on April 05) is a REDDIT CLONE application.\nOne of the most interesting projects in the bootcamp are the ones that replicate very popular websites.\nOne of them is Reddit.\nReddit is a unique place on the Internet. You can find anything on it, and I often find myself prefixing Google searches with “reddit” to find what I’m looking for.",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}