{
  "title": "Feels good to be back",
  "url": "https://flaviocopes.com/good-to-be-back/",
  "date": "Wed, 13 Apr 2022 07:00:00 +0200",
  "content": "        <p>Long story short, I&rsquo;m back at daily tutorials on this blog.</p><p>Back in January of this year I wrote &ldquo;<a href=\"https://flaviocopes.com/stopped-publishing-daily/\">I stopped publishing daily blog posts</a>&rdquo; where I announced a break from daily publishing, an habit I&rsquo;ve maintained for 4 years since January 2018.</p><p>The reason was that I was preparing the opening of the 2022 cohort of Bootcamp, which signups finished 1 week ago.</p><p>I had to 100% focus on that for 2 months, because after the cohorts of 2020 and 2021, I re-did all the course from scratch.</p><p>And while I worked full time for 3 months on it, I haven&rsquo;t still finished all the lessons, but I finished so many of them that I now have a buffer.</p><p>Plus, the launch phase is done, so I can just focus on delivering a great course for all participants.</p><p>Reading that post I also said I was looking into dedicating more time to YouTube, something I try from time to time until I remember that doing video for me is exhausting. I very much prefer writing to recording videos.</p><p>Although video is a medium I love to consume. So it&rsquo;s still a battle.</p><p>Since I declared that &ldquo;holiday&rdquo; in January, I posted 5 blog posts.</p><p>Not too bad.</p><p>But also I didn&rsquo;t write one post a week as I promised to myself.</p><p>I realized doing something weekly is not much of a habit.</p><p>Daily is a habit.</p><p>Day in, day out, it&rsquo;s just part of the routine.</p><p>But weekly, some weeks I just forgot.</p><p>Having a schedule is something that really makes a difference.</p><p>And writing is that kind of activity that the more you write, the more you&rsquo;d write.</p><p>It&rsquo;s like friction. It takes a lot to win static friction, but then it&rsquo;s relatively easy to push a moving objects with dynamic friction.</p><p>One of the few things I recall from physics lessons.</p><p>So going back to a daily, consistent schedule is going to be a much welcomed new habit.</p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "Back to the daily blog!",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}