{
  "title": "Prepare for technical interview questions",
  "url": "https://flaviocopes.com/prepare-interview-questions/",
  "date": "Tue, 04 Jan 2022 07:00:00 +0200",
  "content": "        <p>During an interview you will likely have to go through a series of technical interviews that will give the company a good idea about your expertise.</p><p>An in-person interview is usually conducted with a whiteboard.</p><p>You might be asked to solve a problem.</p><p>You might be asked how an algorithm works.</p><p>You might be asked to implement something that&rsquo;s explained in words.</p><p>It highly depends on the company you&rsquo;re interviewing at. The goal of the interview is to see if you&rsquo;re well prepared with a solid computer science foundation, and also to check if you&rsquo;re a good fit for the role.</p><p>Sometimes the interviewer will ask you to explain with your voices all the choices you make. To goal here is to see if you will be a functioning individual in a collaboration based environment, and you&rsquo;ll be a good team member.</p><p>It&rsquo;s very important to practice beforehand, because once you&rsquo;re in the interview you&rsquo;re going to have a lot of pressure and if you are not prepared it will show.</p><p>Practicing for interviewing should also become a habit. The best way to increase your salary as an employee is to change your job. Move to a different company, with a higher level role. And moving will require interviewing again (unless your skills will speak for you, in one way or another, but it&rsquo;s more common that you will interview).</p><p>Now when it comes to preparing for the questions, it&rsquo;s really a hit or miss. The questions you might be asked as so many that it&rsquo;s impossible to prepare for them all. But preparing for questions will give you a framework, a system, that you will use during the interview.</p><p>If you want to apply at a big company I also highly recommend the book <em>Cracking the Coding Interview</em>.</p><p>Pick a book on computer science. Applying at Google for example typically will require you know a lot of computer science theory. Watch YouTube videos dedicated to this topic. Search &ldquo;prepare google interview&rdquo; on YouTube.</p><p>Then I also recommend to spend a lot of time on those sites:</p><ul><li><a href=\"https://leetcode.com\">https://leetcode.com</a></li><li><a href=\"https://www.hackerrank.com\">https://www.hackerrank.com</a></li><li><a href=\"https://github.com/jwasham/coding-interview-university\">https://github.com/jwasham/coding-interview-university</a></li><li><a href=\"https://www.reddit.com/r/cscareerquestions\">https://www.reddit.com/r/cscareerquestions</a></li></ul><p>Preparing for big companies interviews is definitely hard, as they optimize their search for new CS grads, and it shows.</p><p>This is one of the reasons why I&rsquo;d prefer to apply to a small company which does not require spending too much time on learning how to solve interview questions, and would rather check my practical abilities as an individual rather than how much computer science theory I studied.</p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "An introduction to what you might be asked at the interview",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}