{
  "title": "referenceerror: window is not defined, how to solve ",
  "url": "https://flaviocopes.com/how-to-fix-referenceerror-window-not-defined/",
  "date": "Sun, 24 Apr 2022 07:00:00 +0200",
  "content": "        <p>Here&rsquo;s how to fix the &ldquo;referenceerror: window is not defined&rdquo; error that you might have in <a href=\"https://flaviocopes.com/nodejs/\">Node.js</a> or with a tool like <a href=\"https://flaviocopes.com/nextjs/\">Next.js</a>.</p><p><code>window</code> is an object that&rsquo;s made available by the browser, and it&rsquo;s not available in a server-side JavaScript environment.</p><p>I describe the <code>window</code> object is details in my extensive <a href=\"https://flaviocopes.com/dom/\">DOM Document Object Model guide</a>.</p><p>With Node.js in particular there&rsquo;s no way to workaround the problem - you must find the particular place where <code>window</code> is used, and revisit the code to figure out <em>why</em> you are accessing the <code>window</code> object.</p><p>You are running frontend code in a backend environment.</p><p>In Next.js you can fix this problem by wrapping the code you run in a conditional.</p><p>The code might be running in both situations - frontend, when you navigate to a page using a link, and server-side if you require server-side into your page, for example by running <code>getServerSideProps()</code>.</p><p>In this case, you can limit the reference into a conditional that checks if the <code>window</code> object is available, like this:</p><div class=\"highlight\"><pre tabindex=\"0\" ><code class=\"language-js\" data-lang=\"js\"><span >if</span> (<span >typeof</span> window <span >!==</span> <span >&#39;undefined&#39;</span>) {  <span >//here `window` is available</span><span ></span>}</code></pre></div><p>And this will fix your problem, since you only run anything inside the conditional in a browser environment.</p>      ",
  "image": "https://flaviocopes.com/how-to-fix-referenceerror-window-not-defined/banner.png",
  "description": "Find out how to fix the error referenceerror: window is not defined",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}