{
  "title": "At Senate Finance Hearing, Portman Discusses IRS Backlog, Negative Impact of Book Tax - Senator Rob Portman",
  "url": "https://www.portman.senate.gov/index.php/newsroom/press-releases/senate-finance-hearing-portman-discusses-irs-backlog-negative-impact-book",
  "date": "Fri, 18 Feb 2022 02:37:30 GMT",
  "content": "<a href=\"https://www.portman.senate.gov/index.php/newsroom/press-releases/senate-finance-hearing-portman-discusses-irs-backlog-negative-impact-book\" target=\"_blank\">At Senate Finance Hearing, Portman Discusses IRS Backlog, Negative Impact of Book Tax</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Senator Rob Portman</font>",
  "image": "https://www.portman.senate.gov/sites/default/files/2022-02/SenatorRobPortman.png",
  "description": "WASHINGTON, DC – During a Senate Finance Committee hearing earlier today, U.S. Senator Rob Portman (R-OH) discussed his concerns with the growing backlog at the IRS - noting that it is having a major impact on families and businesses across Ohio and the country.  \n\nPortman also outlined the harmful consequences of the so-called book tax that Democrats’ proposed as part of their Build Back Better framework. He said that the new tax would worsen the IRS backlog while negatively impacting businesses and job creators. Jan Lewis of the American Institute of Certified Public Accountants (AICPA) shared these concerns, stating that the AICPA has “grave concerns” about the tax and the complexity it introduces at the IRS.  Portman has also addressed the negative consequences of the Democrats’ book tax proposal on the Senate floor.\n\nA transcript of Senator Portman’s questioning can be found below and video can be found here.\n\n\n\nSenator Portman: “Thank you, Mr. Chairman. Thanks for having this hearing and the testimony we've had already today regarding the crisis we face, which is overwhelming, 23.5 million pieces of mail, including 8.5 million paper returns, a total of nearly 17.6 million returns. The backlog is having a huge impact on people in my home state and around the country. The IRS is overwhelmed, clearly, and we've heard a lot about those challenges today. We should be doing stuff to make it easier, not harder for the IRS to do its work. \n\n“I want to ask you about a proposal that is being advocated by some of my colleagues that I think would make it more complicated for the IRS and more difficult to administer the tax code. It's a proposal called the book tax, also called the corporate alternative minimum tax by some. But it's different because it doesn't actually tax income. It was put into the Build Back Better framework. Whether that goes forward or not, I don't know. But the idea has been advocated on its own. It adjusts the financial statement of corporations, and again, it doesn't look at the income for tax purposes, but rather the adjusted financial statement, basically creating a parallel tax system.\n\n“And among other concerns, it would override bonus depreciation, alter the foreign tax credit system, provide adverse treatment to investments in state and local bonds, and so on. The Joint Committee on Taxation said that manufacturers would be hit the hardest because of their capital investment and their use of the code to deal with their physical capital investments. Ms. Lewis, you might be the best one to answer this question. How do you feel about this book tax proposal? What would it do to the IRS and its ability to administer the tax code that it's already struggling with?”\n\nMs. Jan Lewis, Chair, Tax Executive Committee, AICPA: “Thank you, Senator Portman. This is an important issue to the AICPA. We have commented on it several times. We issued a comment letter back in October, late October, and again in early December. I believe the main issue here is that having a corporate minimum tax or a book tax, obviously on C-corporations, being based on their financial statement income as opposed to their taxable income, it takes the definition of taxable income away from Congress and it puts it in an industry, maybe even a foreign country or what the industry looks at financial statements. Financial statements aren't prepared the same way as a tax return, totally different rules with generally accepted accounting principles.  \n\n“Financial statements are made for bankers, for creditors, for shareholders to determine what the book income is. Taxable income is determined based on the tax code. And there are specific things, such as depreciation that you mentioned, that are different for tax purposes than for financial statement purposes. So, the AICPA has grave concerns about the corporate minimum tax. We're happy to look at specific provisions. Our recommendation would be look at specific provisions that are allowed, deductions or credits, that are allowed under the tax code that aren't for other reasons and build a proposal based on that. But as it stands right now, we are not in favor of this corporate minimum tax. Even though it would not affect my clients. It does only affect large corporate clients that would have more than a billion dollars of profit.\"\n\nSenator Portman: “How about IRS administration? What would it do to the IRS right now with all the burdens they're facing?” \n\nMs. Lewis: “Yeah, I think it adds one more level of complexity to the IRS and again, we're mostly focused on what can happen right now.”\n\nSenator Portman: “Let me ask you another question, Ms. Collins. We have obviously a huge backlog and it's affecting everybody, including in my home state, a lot of our constituents who are calling in. One was a low-income taxpayer who had identity theft and that's unfortunately happening more and more and he went to a low-income taxpayer clinic in Columbus, Ohio, filed his identity theft form actually in April of 2021 and he had to use a form - Form 14039 - there's no electronic option. And of course, he didn't hear back. Why? Because there's a huge backlog because people aren't looking at paper forms. So he missed his refund. He was totally frustrated. We tried to help the low-income clinic tried to help but they had to submit a paper form also to be able to help. Shouldn't we have more of this done electronically at a minimum to be able to help some of these taxpayers who are just struggling to get through the system and get their refunds and move ahead?”\n\nMs. Erin M. Collins, National Taxpayer Advocate, Internal Revenue Service: “Yeah. In our annual report we focus on some of the barriers for e-filing and I wholeheartedly agree the IRS needs to get its I.T. systems to a point that we can process, in essence, any piece of paper that the taxpayer submits, especially if it's an IRS form. If it's an IRS form, we should be able to file that electronically. But there are a number of forms that, unfortunately, are not compatible with our system to date.”\n\nSenator Portman: “Well, thank you. I appreciate that. And this is an idea that came out of the mid 90’s reforms to do more electronic filing. It's gone well in terms of the tax reform efforts and the returns themselves, but it should be expanded clearly. Thank you, Mr. Chairman.”\n\n###",
  "publisher": "Google News Finance USA",
  "publisherUrl": "https://news.google.com/search?q=finance&hl=en-US&gl=US&ceid=US:en"
}