{
  "title": "Ethics, Transparency, Campaign Finance, and Voting in the New State Budget - Gotham Gazette",
  "url": "https://www.gothamgazette.com/state/11234-state-budget-ethics-campaign-finance-government-transparency",
  "date": "Tue, 19 Apr 2022 00:41:18 GMT",
  "content": "<a href=\"https://www.gothamgazette.com/state/11234-state-budget-ethics-campaign-finance-government-transparency\" target=\"_blank\">Ethics, Transparency, Campaign Finance, and Voting in the New State Budget</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gotham Gazette</font>",
  "image": "https://www.gothamgazette.com/images/graphics/5-budget-highlights-ethics.jpg",
  "description": "\nGov. Hochul signs orders (photo: Kevin P. Coughlin/Office of the Governor)\n\nGood government groups and reform-minded officials have for years called for New York State’s Joint Commission on Public Ethics (JCOPE) to be scrapped and replaced with more independence from the elected officials it is meant to regulate. But since the details of a deal to replace the troubled commission began to emerge last month, reformers have raised alarms that the new body would hardly be better than the old.\nA new state ethics commission is one of several measures related to government ethics and accountability, voting, and campaign finance reform included in the $220 billion state budget lawmakers adopted earlier this month.\nThey include funding to launch the statewide public-matching campaign finance system previously crafted by lawmakers, and steps to make voting more accessible. The budget also includes greater oversight of some state spending on infrastructure and business subsidies. But other long-sought measures, like restoring some of the comptroller's contracting oversight, were left out, while questions remain about some of the details of the policies that were included.\n​​The budget, negotiated by Governor Kathy Hochul, Senate Majority Leader Andrea Stewart-Cousins, and Assembly Speaker Carl Heastie -- all Democrats -- will undoubtedly be the biggest legislative action of the year. It will likely factor prominently in Hochul's attempt to win her first full term later this year.\n",
  "publisher": "Google News Finance USA",
  "publisherUrl": "https://news.google.com/search?q=finance&hl=en-US&gl=US&ceid=US:en"
}