{
  "title": "Government finance statistics: long-term debt securities - Products Eurostat News - Eurostat - European Commission",
  "url": "https://ec.europa.eu/eurostat/product?code=ddn-20220422-2",
  "date": "Fri, 22 Apr 2022 09:12:24 GMT",
  "content": "<a href=\"https://ec.europa.eu/eurostat/product?code=ddn-20220422-2\" target=\"_blank\">Government finance statistics: long-term debt securities - Products Eurostat News - Eurostat</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Commission</font>",
  "image": "https://ec.europa.eu/eurostat/o/estatImageScaler/documents/4187653/7805807/iQoncept+shutterstock_178910678+web.jpg/c9cb2bf7-422d-430f-818a-5ceaaa517184?t=1484645626000",
  "description": "The general government financial accounts cover transactions in financial assets and liabilities as well as the stock of financial assets and liabilities. In recent quarters, the liabilities of EU and euro area governments generally increased because governments needed to finance their deficits or acquisition of assets. Government deficits rose considerably during the COVID-19 pandemic due to increased expenditure as well as lower revenues. The incurrence of liabilities occurred notably by issuing long-term debt securities (bonds) that are issued with a maturity longer than a year. These financial instruments make up around 3/4 of total liabilities.    Source dataset: gov_10q_ggfa  The outstanding amount of liabilities changes either due to transactions (mainly due to net issuance, but also due to accrued interest) or due to other economic flows (mainly price changes also known as holding gains or loss). As long-term debt securities are traded on the financial markets, the value of these instruments changes constantly over time, mostly in response to changes in the interest rate as compared to the interest at which the existing stock had been issued. At the end of the fourth quarter of 2021, the prices of debt securities issued by governments in the euro area declined faster than the net issuance of new securities leading to a lower stock outstanding at the end of the quarter and a holding loss for the creditor. In all quarters of 2021, holding losses are noted at the level of the euro area. This information comes from data on quarterly government finance published by Eurostat today. The article presents a handful of findings from the more detailed Statistics Explained article.   For more information:  Statistics Explained article on quarterly government finance statistics  Dedicated section on government finance statistics  Database on quarterly government finance statistics  Database on government finance statistics Methodological notes: In the European System of Accounts (ESA 2010), most assets and liabilities are valued at market value. This means that the stock of financial assets and liabilities fluctuates due to transactions, but also due to \"other flows\", notably revaluations (nominal holdings gains and losses).  Debt securities are part of the general government gross debt as covered in the Maastricht debt definition stipulated in the Excessive Deficit Procedure. Thus, stock data on debt securities are also published at face value, which does not take into account most price changes. The stock at face value can differ significantly from the stock at market value.  To contact us, please visit our User Support page. For press queries, please contact our Media Support.",
  "publisher": "Google News Finance USA",
  "publisherUrl": "https://news.google.com/search?q=finance&hl=en-US&gl=US&ceid=US:en"
}